[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1OdHU3U1o3eWRPSERjRk5DTk93UHBlejJtekxPa3Y2T2V2LUdGanV0WDNiR3h5VUlXVmt2Sk52RGdUQmYtMDAteUlZZTdDX0gxMFNaanVZNWZEYjNER3U2NlBHTFJaN3E3eHNLWDZoT3VjVGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Poised For Major Breakout, Analyst Predicts 180% Surge - TronWeekly",
        "content": "Ethere­um, the second-largest cryptocurre­ncy by market capitalization, is poised for a major breakout, with its price­ increasing by approximately 180% soon. Crypto analyst Javon Marks has highlighted this bullish tre­nd, suggesting that Ethere­um is on the­ cusp of an even more substantial bre­akout.\n\n“$ETH (Ethereum) may only be preparing here for the overtaking and surpassing of $4,723.5 which could then open $8,000+!” said Marks.\n\nMarks’s prediction indicate­s a potentially massive surge in Ethereum’s value, projecting it could more­ than double its current price. Marks’ twe­et emphasized the­ critical $4,723.5 level as a pivotal point for Ethere­um’s continued growth.\n\nSource: Javon Marks\n\nThe chart shows Ethere­um’s steady upward trajectory, refle­cting the 180% increase since­ its previous lows. This rally is marked by periods of consolidation and minor pullbacks, which, according to Marks, are­ essential for a healthie­r and more sustainable bull run. These­ pullbacks help to stabilize the price­ and prevent overe­xtension, setting the stage­ for a robust ascent towards higher targets.\n\nMarks’ analysis sugge­sts that surpassing the $4,723.5 mark could trigger a new wave­ of investor interest and marke­t activity. Ethereum’s potential to re­ach $8,000 or beyond is based on its strong technical foundation and the­ current bullish sentiment surrounding the­ cryptocurrency market.\n\nEthereum’s ETF Launch Hope\n\nDespite­ a recent rally, Ethereum’s price is struggling to get back to its all-time high. The­ rush past $3,395 came from spot ETH ETFs approval, still, lacked power afte­r a small dip mistaken for rollback at the beginning of the­ month. Market worries and stronger pe­ssimistic trends intensified the­ pullback.\n\nThe upcoming launch of ETFs may change the game­ and give the same be­nefits of the price of Bitcoin in case­ of its spot ETF’s launch. By indicating greater investor appe­tite through the ETFs, the price­ could return to the north and cross the $3,829 barrie­r, an important target.\n\nThis figure is also the 61.8% Fibonacci Re­tracement leve­l which would pave the way for another le­g up following previous resistance now turne­d to support. It may be that the target is far too high for ETH, but the­ demand is still in place for $4,000 in ETH. Howeve­r, a firm move above this leve­l is more likely to inspire furthe­r bullish sentiments.\n\nHoweve­r, a failure to go through the $4,000 barrier could provoke­ an adjustment below this leve­l. at least 3,700-3,800 the price could go flat. On the­ downside a break under this zone­ would make historians of the bull market.\n\nRelated Reading | Nigeria’s Cryptocurrency Market Surpasses $400 Million, SEC Director General"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1KSkpQWVdKQUxONkw0Uk1wajNSZldjcktGUlZjcW5rS3VhUlZoaUUyaDFjdG5VTnZKVXJWMkZEVzRrYW1xXzYtS3o5eV9Od29EWUctSVhucHB6c00wQXYwQVJJNWZhbHNhREo3akJIaEphM2fSAXhBVV95cUxPM3JFZ21PV2dVTW5SMkVCNGFIU0psVXFjYnc5NEdNVXZKS244UzV6WmN4dnR0dk9UeEZrSFRURk1IZVhBNjcwbW83MW40YlhnZkduQVRpY0RHT0xXam5KVV9taUlzbnF1dDlNTmR5d2V1Qy1pUEhlbVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Solana Just Dethroned Ethereum in This Key Metric - U.Today",
        "content": "According to data provided by DefiLlama, Solana has managed to destroy Ethereum in daily DEX trading volume ($1.148 billion and $745 million, respectively).\n\nAdvertisement\n\nSolana-based Raydium, Meteora, Orca, Phoenix and Lifinity are among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap, of course, remain in the lead.\n\nAs noted by Patrick Scott, the founder of Dynamo DeFi, Solana's DEX volume dominance is also on the rise . In fact, it is on track to surpass the 25% level for the first time this June.\n\nAdvertisement\n\nOverall, DEX volume has hit $26 billion over the past seven days, according to data provided by Dune Analytics .\n\nEarlier this year, trading on Solana-based DEXex spiked due to the growing popularity of meme coins.\n\nSOL summer?\n\nThis comes as the \"Ethereum killer\" is benefiting from increasing ETF buzz. As reported by U.Today , New York-based investment firm VanEck filed to launch an ETF for Solana on Thursday; 21Shares followed suit with its own filing for the red-hot altcoin on Friday.\n\nHowever, those who expect this ETF to see the light in the near future should cool their jets. According to leading analysts in the field, the product is now expected to be approved this year.\n\nAfter initially seeing a sharp price spike due to the ETF hype, the SOL price is currently in the red, slipping by 0.2% over the past two weeks.\n\nThe popular altcoin is currently valued at $65.2 billion, according to data provided by CoinGecko. This puts it in the fifth place by market capitalization (behind only Bitcoin, Ethereum, Tether and BNB)."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQU3RYeUR3cWVxRjUwOUljZGJiTXBRbG82R3I4TUFZYUJRV3NWQTBZVXBmVkIzdVc4R0xHSWVFYi13UGNvR3pkTi1ITll1SkFDbzNiN1lTSGNVZ01jYVQzLUw5SUJvRXoxc1FuN0Q5LXNzTGhrOEZhODQ4M0RQeTdJS2VTelJyNnBSUE9JV2xDRHc5cGg2OEVycmxmZkstd00yTENfNXpGOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Set to Launch on July 2nd – Bloomberg Analysts - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1ROFRrdUFiYmZ1OTFZaHE2MWVVWFRlMWI4WUt5QVdKQl9aVkVNYklpTWp2TnRaMlJLcHA2bWpYd01tQzZGb0JBeXVSVktJT1ZvVXBMNjJQOVNLMzFrRDZISXRZWkY0b3FoNmIyb2Q2SnUyWmFaYkk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum NFTs Make a Comeback? - CryptoSlate",
        "content": "Onchain Highlights\n\nDEFINITION: The relative amount (share) of gas consumed by the Ethereum network by transactions interacting with non-fungible tokens. This category includes token contract standards (ERC721, ERC1155) and NFT marketplaces (OpenSea, Blur, LooksRare, Rarible, SuperRare) for trading those.\n\nEthereum’s gas usage by NFTs has exhibited significant shifts over the past few years, mainly as different platforms have gained and lost prominence. Recent data indicates that Blur and OpenSea have consistently dominated gas consumption since early 2024.\n\nThis reflects the increasing activity on these platforms as traders and collectors continue to engage in the NFT market. In contrast, platforms like Rarible and SuperRare show relatively lower gas usage, highlighting their smaller user bases or less frequent transactions.\n\nHistorically, significant spikes in gas usage by NFT transactions correlate with broader trends in Ethereum’s price movements. For instance, the surge in early 2021 coincided with a considerable bull run in the crypto market, driving more transactions and higher gas fees. As Ethereum’s price stabilized in mid-2023, NFT-related gas usage also normalized, illustrating the interconnectedness of these metrics.\n\nThe current landscape suggests that while new NFT marketplaces emerge, established platforms like Blur and OpenSea maintain relative dominance, continually influencing Ethereum’s overall gas consumption patterns. This dynamic plays a crucial role in understanding the operational costs and transaction efficiency of the Ethereum network.\n\nWhile relative usage may be compatible with past cycles, overall NFT gas usage has plummeted since January 2023 as a percentage of overall network activity. At its peak, gas usage broke 40%, with a consistent level above 30%. Current levels are below 4%, partly due to the increasing popularity of layer-2s like Base and side chains like Polygon and an overall downtrend in the NFT market."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQURrakpnbk5QWGluMUZQRFJ5cTlKODhEUk1EMHVzLXFILTdjY1RUenVhSUlVWkZob2lNdnJ0WnFoSkExN2xKNkRSMnRPeGFQODgtQVZxMmwyTENmeVdRSDhTLW5NNGpIT1IxbUQ4UC1TeFdOUkZ3Qk5PR0lZcXpqb9IBiAFBVV95cUxNWXNoVEZjQ1Fja092NnNGR3RnVG9pZEhESDNaWDJ2ckYtNUpPT1NpcnZUNk9idUczYjZxVVRCVmVSLTlwYV9fNm9ZRnM2VVVvQkFMd2ZvN0d2c09CYkNSRnEwRENvQlpHWlJod3lpQ1c0LVVVMzhHSWpBc2draUNlOGUzQjVpRW9U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "What Are Blobs? Improving Ethereum’s Scalability - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOfficially introduced to the Ethereum network on March 13, 2024 in the Dencun upgrade, blobs are a new type of data storage space designed to make rollups cheaper and more efficient.\n\nThe consensus within the Ethereum community is that the best way to scale Ethereum is through rollups, also known as Layer 2s or L2’s, and that the best way to scale rollups is via the introduction of blobs.\n\nBefore blobs, if Ethereum went through a period of congestion, that would also affect the price of transactions on all of its Layer 2s. The introduction of blobs removes the correlation between Ethereum congestion and the cost of transactions on Layer 2s.\n\nWhat are blobs?\n\nBlobs are a new data structure introduced to Ethereum in EIP-4844, more colloquially referred to as “Proto-danksharding”. EIP stands for Ethereum Improvement Proposal—the process by which Ethereum core developers suggest improvements to Ethereum.\n\nProto-danksharding is the precursor to full-danksharding, and sets the foundation for it by introducing blobs. It does so in the same format in which they’ll be used when full-danksharding is implemented, in order to simplify the transition to full-danksharding.\n\nFull-danksharding, or just Danksharding, is an upcoming Ethereum protocol update. It represents what Ethereum core devs believe will be the last step (for now) in making Ethereum a truly scalable blockchain, by making transactions faster and cheaper.\n\nProto-danksharding is a step towards implementing Danksharding—it introduces concepts from Danksharding, such as blobs, to Ethereum. Starting with proto-danksharding and the introduction of blobs, instead of diving straight into full-danksharding, reduces the risk created by introducing drastic changes to a network too quickly.\n\nHow do blobs work?\n\nBefore blobs, when a Layer 2 needed to verify its transactions, it would batch up transactions, and send them to Layer 1 (Ethereum) to verify. The problem was, after the data was verified, it was still stuck on the Ethereum blockchain, taking up blockspace, forever.\n\nAD\n\nAD\n\nThis contributes to state bloat, and makes Ethereum more congested—which, in turn, also made Layer 2s more congested.\n\nWith blobs, when the data is sent to the Layer 1 for verification, it’s sent in a blob, short for “Binary Large Object.” Each blob has 4096 field elements and can hold up to 32 bytes of data per field element, which equates to around 75 MB per blob. You can think of it as a giant table of data, or… a big blob of data.\n\nBlobs improve on the previous method of verifying data in that once data has been verified from a blob, it can be deleted. This way, all the transaction data from every rollup built on top of Ethereum doesn’t have to live permanently on the Ethereum blockchain, taking up valuable space.\n\nBlobs also operate using a separate blob fee market—introducing “blob gas”. Blob gas is independent of gas on Ethereum mainnet, meaning the only things that use blob gas are blobs themselves.\n\nWhat’s so special about blobs?\n\nDespite the funny names involved in Ethereum’s Dencun upgrade, it’s a serious improvement. Blobs help to make Ethereum less congested, and they make rollups cheaper and faster to use.\n\nThis is because the data that’s verified in blobs can be deleted after use. As such, it doesn’t cause state bloat on Ethereum mainnet. “State bloat” refers to the fact that the more data that is processed by Ethereum, the more data lives permanently on its blockchain—and the more intensive maintaining that network’s “state” becomes.\n\nSeparating the blob gas market from the existing gas market is also a marked improvement. Because blobs have a separate gas market, congestion on Ethereum doesn’t affect them. In the past, if there was a large event on Ethereum such as a highly anticipated NFT mint, the congestion caused by this event would leak onto Layer 2s and make transactions there more expensive as well. Separating blob gas markets from traditional ethereum gas markets removes the correlation between Ethereum network congestion and Layer 2 transaction costs and speed.\n\nBlobs also make Layer 2s much more profitable. Before blobs, when gas fees on them correlated with Ethereum network congestion, the cost of operation for Layer 2s, and the Dapps built on top of them, were much higher. Lowering transaction fees make it so that builders and operators are able to run complex smart contracts or products at a fraction of the cost.\n\nAD\n\nAD\n\nBlobs at work\n\nLooking at onchain data from rollup.wtf, we can see that the majority of Layer 2s with the highest transactions per second are already using blobs.\n\nIn a tweet, Jesse Pollak, founder of Layer 2 network Base, revealed that after Dencun, the cost of a simple swap transaction on Base dropped from $0.31 to $0.0005.\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nHowever, it hasn't been all sunshine and rainblobs. Blobs have been slower than anticipated when it comes to actually posting transactions to Layer 1. Creating a new gas market for blobs succeeded in decoupling Ethereum congestion from rollup transaction costs, but the gas market itself needs some fine-tuning before it’s everything it’s been hyped up to be.\n\nIn one example in June 2024, blob transactions became more expensive than their predecessor– but that can be seen as a sign that blob adoption is still in progress, and hopefully, as L2’s become more efficient at using blobs, more block builders start accepting blocks that include blobs, and blob capacity increases— the costs will go down.\n\nVitalik Buterin addressed both of these issues in a March 2023 blog post published shortly after Dencun’s release. In it, Buterin cites two core areas of focus that are needed to continue scaling blobs: “Progressively increasing blob capacity, eventually bringing to life the full vision of data availability sample with 16MB per slot of data space,” and “Improving L2s to make better use of the data space that we have.”\n\nSo while blobs have seen some growing pains, they were for the most part anticipated, and solutions are underway."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPN3JxZlA0RGh0enZWd2pKeExGc3NsOHNrWmh5S0hlUGZpbGQzRzFzRjc0Vm1PYkhQV2dibTA5ZHh4eTBnR1pEUXpJSUVjZHlYWXZva04zSGU0ZmVaNnA5MHVsMGp3RG1hSldUMmJPVnI0U1c0UGdXVmJwNGllYXNVT2NTbkJhT2dsc1NVOVNIMThmNUo1alRuY25DbmVFTXNlS2FGQndxOTdDaUlYZXdUSkNvLUNLTkhYRVAzY1ZFMjg1anBlSWFfNWhTMlhoTDkwX21ncGFWblTSAd4BQVVfeXFMTkJNSUhWUWpVak9ZbHlYVXVWX2NEcmpWbmFobmlSZWhMQU1ZLThtb1ZOMjFpZUpCLU5iZnZEeDJVTU5DeVdTTWRmZjF3UnBYTmZYcnBoc2ZkazNJTGFGVjB2VkNFbkx0THNLZElNNmplZnFYV0g5anFCSUF5S0hyMEJnRVF1WGRFT3k4Yi0xUlRDOG0zTWRkLXRrcFBiLWtvcU42cVFVdVlINFFFNUFmVS1KVWVpTWl2MEM5ZE9xaTNIZnNBRWIzS2VCWjRTQ3RxYnlqLS03QW5SZHU3TmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum Rival Is Extremely Undervalued, Maps Path Forward for Bitcoin and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto analyst and trader believes that one Ethereum (ETH) rival is well below fair market value.\n\nCrypto trader Michaël van de Poppe tells his 722,500 followers on the social media platform X that layer-2 scaling solution Polkadot (DOT) could follow ETH’s upward trend.\n\n“DOT is likely going to follow Ethereum in its expansion upwards. This means that the current valuations of Polkadot are extremely low. I expect a lot from the Polkadot ecosystem with all the new segments.”\n\nLooking at his chart, he suggests the possibility of a bullish divergence for DOT on the three-day chart, a metric where a lower low appears on the price chart but then a corresponding indicator shows a higher low.\n\nDOT is trading for $6.20 at time of writing, down nearly 2% in the last 24 hours.\n\nNext up, the analyst predicts that Bitcoin (BTC) will consolidate in the near term around the lower $60,000 range.\n\n“Bitcoin did make a retest at $61,000. I expect this to continue consolidating, where I’m assuming that altcoins will have a higher return than Bitcoin.”\n\nLooking at his chart, the trader suggests that Bitcoin will bounce around $60,000 and soon return to around $64,000.\n\nBitcoin is trading for $60,757 at time of writing, down 1.47% in the last 24 hours.\n\nLastly, the analyst says that leading blockchain oracle service Chainlink (LINK) will likely rally against Bitcoin (LINK/BTC) in the near term as it bounces off a trading range low on the weekly chart.\n\n“Pretty significant start for LINK with this weekly candle of +11% on the Bitcoin pair. It’s still the cycle low and likely the bottom during this period of consolidation.”\n\nLINK/BTC is trading for 0.0002308 BTC ($13.92) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQVjEwc1FyV2tQZkhyaTZaa2kyVDZJcTI1SGtxdzFaNkpsSFpmMFpuVTdtUm1Ga2VJRXpNcTF3OXNWel80MDMyRE5VMHIxdlBVU3YxS0pKYkUyQzh6WHk0R2Z6UElxcnpWZ3IwdDVNSkVqTkxGYkk0QXU2a2dCMUZJeXVjaW82aVhfVXVtX2ctM05FRFhk0gGaAUFVX3lxTE1ZYVI4RTJjSFZZblFyWFdxWXNsQnlHbGJUSmZoejdZamY4d3EtTlFWX1lrTTMzcEFHLUpWN1JlUTdVQXhXYmNvOEQ2RDRTOWNONFZGbFdMYnN5aW5pbUlJUDZBaXFCeE1zaHJlbldJS3ZMaUZIbU5Md3ZtQUM3LVkwc1VBb1ZvTzFKdklLejE5ZmgzTTRZWTlqX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "What to Expect for Ethereum Price in July Based on Historical Trends - CoinGape",
        "content": "June Month was notably bearish for the cryptocurrency market with many assets revisiting their monthly support. Amid the market sell-off, the Ethereum price plunged from a high of $3887 to a low of $3232 registering a loss of 16.9%. However, the downfall lies within the healthy retracement of Fibonacci tools indicating a strong could allow ETH bulls to counterattack.\n\nAlso Read: Crypto Market This Week: Ethereum ETF, FOMC Minutes, US Job Data & Trade Deficit\n\nadvertisement\n\nEthereum Price Eyes Stability as 78% of ETH is Held by Long-Term Holders\n\nThe near-term trend in Ethereum price is sideways evidenced by a new lower high formation at $3975 in late May. This reversal indicates the overhead supply is high from market sellers and ETH buyers would need time to recuperate its momentum.\n\nConnecting the overhead peaks with a trendline reveals a potential triangle formation as the altcoin has also received dynamic support from an ascending trendline since October 2023.\n\nThe Ethereum price currently trades at $3389 and holds a market cap of $407.3 Billion. If the supply pressure persists, the coin price could plunge another 5% to seek support at the long-coming trendline.\n\nThe renewed buying pressure from the trendline could uplift the asset by 14-15% and challenge the triangle’s upper boundary at $3860. A bullish breakout from the triangle pattern will signal a better confirmation of uptrend continuation.\n\nAlso Read: ETH/BTC Pair Poised for Breakout as Ethereum ETF Launch Approaches: What’s Next?\n\nIn a recent tweet, the prominent crypto analytics firm IntoTheBlock revealed a striking statistic: 78% of Ether is currently held by long-term holders. Despite the volatility in Ethereum’s price, the proportion of ETH held by long-term investors has steadily increased, indicating a strong belief in the asset’s future value.\n\n78% of ETH is owned by long-term hodlers pic.twitter.com/9vb5kaUIar — IntoTheBlock (@intotheblock) June 28, 2024\n\nEthereum’s price performance in July has exhibited a mix of gains and declines over the past several years, reflecting the broader market’s volatility and investor sentiment. The biggest gain was +56.62% in 2022, while the largest drop was -27.29% in 2017.\n\nOn average, July has a positive return of +6.95%, though the median return is -4.41%, indicating mixed performance.\n\nHowever, with the ongoing development around U.S-listed Ethereum ETFs, anticipated to launch around mid-July, the odds strongly lean on buyers’ favor.\n\nTechnical Indicator\n\nBB Indicator: An upswing in the lower boundary of the Bollinger Band indicator losing bearish momentum and additional support for buyers to rebound.\n\nMoving Average Convergence Divergence : A negative crossover between the MACD and signal line highlights the near-term trend is intact and bearish.\n\nFrequently Asked Questions (FAQs) 1. What role do long-term holders play in Ethereum's market stability? A3: Long-term holders, who currently own 78% of Ethereum, play a crucial role in its market stability. Their sustained investment indicates a strong belief in Ether's long-term value. 2. What impact could the launch of U.S-listed Ethereum ETFs have on its price? The anticipated launch of U.S-listed Ethereum ETFs could significantly influence ETH price by potentially increasing buyer interest and investment. This development is expected to provide easier access for a broader range of investors. 3. How does the \"Fear and Greed Index\" affect Ethereum trading decisions? The Fear and Greed Index measures investor sentiment in the market, which can be a useful indicator for traders to gauge the general mood among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUmk2cExjdGp4SXhOMlZ2RXItQUJfUE5MYWM5eDZqeUxfN2F1aTROaXZHbU9hdTFCWkt0ME5VaTBwSWIzbkpFbXZMTWl3RW5uUkFCbUtPYjlkV2FPeXVkRzkxaUNCOWVNMDFiWmxqV3pTTFV4UXBjSDdDVU9fckdHd2E4T2ZJeVN20gGOAUFVX3lxTE5VT2hab24yU19LUlhKS0IwaWh2enNsSE9GSE4wY3FmLUVGWVNnX0xPd1hJaXl6TEs1c0xUamx2ZjFUNHBxLUx5MmY5b25pZzRjYnVKZFNWM3FsWDEzM1NsVmloeW5rRFRrcjBQRkFnaHVqcHNuVEstNURTSFk3bGI4eDliV2NHVmFSNjJjTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s ‘failed’ breakout – When will ETH’s price breach $3.5K? - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 3% in the last 7 days\n\nA key metric revealed that ETH was undervalued, hinting at a recovery on the charts\n\nEthereum’s [ETH] price action turned bullish on 28 June, giving investors hope for a recovery from their past losses. Unfortunately, this bullish trend didn’t last for long, as the coin recorded a price correction soon after. This led to both its weekly and daily charts flashing red.\n\nEthereum faces rejection\n\nAfter the aforementioned hike in price, ETH’s bears stepped up again and pushed the altcoin’s price down by more than 3%. At the time of writing, the king of altcoins was trading at $3,391.51 with a market capitalization of over $407 billion.\n\nThe worst news was that Ethereum got rejected from the upper limit of a bullish wedge pattern in the recent past. As per a tweet from ZAYK Charts, a popular crypto analyst, the token’s price started to consolidate inside the pattern in late May. A successful breakout could have resulted in a 30% price rise, which might have allowed Ethereum to go past $4k.\n\nInterestingly, a similar pattern had emerged earlier in March, only to break out in May. This allowed the altcoin to hit $3.89k on the charts. However, since ETH got rejected this time, the chances of history repeating itself might be slim.\n\nWon’t ETH recover?\n\nAMBCrypto then took a closer look at Ethereum’s current state to see whether it would fail to break out of the bullish pattern.\n\nWe found that market sentiment around the king of altcoins remained bearish. This was evidenced by the dip in its weighted sentiment after spiking on 28 June. Its network growth also dropped slightly, meaning that fewer addresses were created to transfer the token.\n\nNonetheless, a few of the metrics were in favor of a successful breakout.\n\nFor example, the MVRV ratio has improved over the last few days, which can be interpreted as a bullish signal.\n\nAMBCrypto’s assessment of Glassnode’s data also revealed that Ethereum’s NVT ratio had declined sharply. A drop in this metric usually means that an asset is undervalued – Implying an incoming price hike.\n\nAMBCrypto then took a look at Hyblock Capital’s data to look for immediate support and resistance levels.\n\nAs per our analysis, it would be crucial for ETH to touch and go above the $3.5k-mark in order to sustain a bull rally as liquidations would rise sharply. Generally, a hike in liquidations often results in price corrections on the charts.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOn the other hand, if bears continue to dominate and ETH’s volatility rises in a southbound direction, then it might fall to $3,060."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQdlpySGswSldrbHpRTGxYM1Z6SVJxekxJNlptSnkzYUJ3a1JCR2Uya2pPVnlzOHBsWDM3eDQtaGJoMmJFWVhOaHBJanZnYTl1Nk1DNGFORzZaaWNXVy03TGpLVTVvOUhhTUpueW9tQVpzNnpsdjhiQUdlbDVtU3A2UlJQWnM0eWlDbm00Rld4VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency: 3 ETH Coins To Stash Before Ethereum ETF Boom - Watcher Guru",
        "content": "The cryptocurrency world is now witnessing a dynamic shift. After Bitcoin ETF approval, Ethereum ETFs are in the queue to embrace the world and have already started to make waves in the current cryptocurrency realm.\n\nPost the Ethereum ETF approval, several analysts have already started to bet on how the phenomenon will help several Ethereum-based altcoins to skyrocket, turning them into a huge investment opportunity to capitalize on and make the most out of. Here are the latest top three ETH-based coins that an investor should stash before they hit big post the Ethereum ETF approval.\n\nAlso Read: Cryptocurrency: 3 Coins Set To Give 2x Returns In July\n\n3 ETH Coins To Stash Before They Skyrocket Post The Ethereum ETF Approval\n\nSource: WatcherGuru\n\nCryptocurrency #1- Floki Inu\n\nFloki Inu is another noteworthy Ethereum-based token that has made significant strides in the cryptocurrency realm. The token boasts a stellar community ecosystem and has been known to have float distinct marketing to tempt users from across the board. Floki Inu has recently launched a telegram bot with the intent to simplify crypto trading for traders and investors. The token is currently ranked 51st largest currency by market cap.\n\nAccording to CoinCodex, the token may surge and spike by nearly 222% by mid-July to trade at a price high of $ 0.00055. Post the Ethereum ETF approval, this figure can further amp up, making it an apt investment choice to explore and entertain. While Floki Inu is currently projected to be in a bearish mode, the cycle may change soon post the ETH ETF approvals.\n\n“The price of Floki Inu is predicted to rise by 225.91% and reach $ 0.00055 by July 28, 2024. Per our technical indicators, the current sentiment is Bearish while the Fear & Greed Index is showing 47 (Neutral). Floki Inu recorded 13/30 (43%) green days with 22.09% price volatility over the last 30 days.”\n\nCryptocurrency #2- Shiba Inu\n\nThe Shiba Inu ecosystem is known to constantly revamp its proceedings to woo investors. The token is currently busy curating a bunch of new product offerings that include launching the Shiba Eternity Blockchain version, as well as Shiba Hub, as new elements embellish its ecosystem. With the Ethereum ETF approval launch, SHIB can gain new price strength, which can help its investors accumulate new profits.\n\nAccording to CoinCodex, Shib may spike by 65% to trade at a new price high of $ 0.00002884. Per CC, SHIB is currently projecting a bearish signal but is bound to recover and heal, as its positive ecosystem upheavals will play a pivotal role in correcting its price valuation.\n\n“The Shiba Inu price forecast for the next 30 days is a projection. It is based on the positive/negative trends in the past 30 days. SHIB will be changing hands at $ 0.00002884 on Jul 5, 2024, gaining 65.31% in the process.”\n\nCryptocurrency #3- Pepe\n\nPepe is another notable cryptocurrency token that has made significant waves in the cryptocurrency sector. The token recently surged by nearly 3000% banking on the recent GME stock surge. Similarly, being an Ethereum-based token, Pepe can avail significant price valuation once Ethereum ETFs gain momentum in the mainstream market.\n\nAccording to CoinCodex, Pepe may surge by nearly 200% in mid-July, claiming an all-time high of $ 0.00003972. The CC buy indicators further project Pepe in the bullish realm.\n\nAlso Read: De-Dollarization Debunked: US Dollar Still King, Study Finds\n\n‘The price of Pepe Coin is predicted to rise by 225.55% and reach $ 0.00003972 by July 28, 2024. Per our technical indicators, the current sentiment is Bullish while the Fear & Greed Index is showing 47 (Neutral). Pepe Coin recorded 11/30 (37%) green days with 11.17% price volatility over the last 30 days."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzRV80ajkzbWs5UlAxNURid0FiU0hhYUE4Umcta3ZBdzVzQ1ZFNDFVN3hhbFZLR3FRY2hVSHRuMGEzemlMSm5LMXVGTlUtaTdQZVI2eTQyOVlaM0p3am1tQXZ1RnRzUHljWWRiX3pn0gFzQVVfeXFMUEpUNWEyNllxWjJOMzZrc0FtNUo3ZmlsVGF5aEdCTkQ3VEtaVjR2YlByNE1ZSld1b00zeU5fQ3hvSDlUVi01TlVOSXhGcVFWZ05QYUVvdktwYUd4WHBZM1hZa3lYTS00NmNyTmlxRklxYnFiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Lowest Gas Prices Since 2016 - U.Today",
        "content": "On June 30, the Ethereum network recorded its lowest fees since 2016. According to data provided by Etherscan, the average gas fee is currently sitting at just 3 Gwei ($0.14), according to data provided by Dune Analytics.\n\nAdvertisement\n\nGas fees refer to the cost of various operations on the Ethereum blockchain. By paying gas fees, users help to ensure the security of the network. Apart from incentivizing validators, gas fees are also meant to prevent various spam attacks.\n\nDuring the 2021 bull run, Ethereum's gas fees were exorbitantly high due to high demand in the non-fungible sector (NFT). This prompted some pundits to argue that the network was unsustainable and gave rise to more affordable alternatives such as Solana.\n\nAdvertisement\n\nThis time around, Ethereum gas fees are hitting extremely low levels despite the fact that the network is also experiencing strong transaction activity. In fact, the volume of the leading altcoin is on the same level as it was during the beginning of the year.\n\nThe plunging fees can be explained by a higher level of efficiency of the Layer-1 market due to the combination of Layer-2 volume and the introduction of “blob transactions” with EIP-4844 that helped to significantly boost Ethereum's scalability.\n\n\"We will still see gas spikes above 15 gwei in times of higher activity. It’s just that overall the gas market has been more efficient post 4844. So we’ll have more affordable days than expensive ones,\" Pistachio Fi founder Brian Smocovich said in a post on the X social media network.\n\nBack to inflation\n\nThe massive drop in fees means that Ethereum is no longer a deflationary network since the amount of fees to burn is very small. This flies in the face of those who were pushing the narrative about \"ultra sound money\" prior to the Dencun upgrade.\n\nOver the past seven days, 14,393 ETH has been added to the network, according to data provided by ultrasound.money. This translates into annual supply growth of 0.62%.\n\nThe total supply of Ethereum currently stands at 120,185,061 ETH, which means that it is on track to reach a new 2024 peak."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNc0xZWktGb1pLOW1KWlFkSy00TVcwcm01TWNRbkV4NDZvX0pJTktxeXFiYnNjV0dWTEx5UXBoSmw1SHJvbG01OHRxV28xMjFXTmZaY3RwNjcwV3VEODVMWVd1Y0hvUjI5N3VTY2tBbmJPTXV4MkJUVjNMRFc0TTBfQWlkOU1fcm5RbTBzZUU0WDlldUJFc3c2VWh3LUZUME1zWGtnQUcyUlFjQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Pulls 60,000 New Depositors as ETF Launch Nears - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQNXBROXNmd2doeHR0cjhISWRSRGZBSG00ZkROMmZZMFBfS2RBcHNwTW4xRWFDRW1YS0tRdTdhd2d3X2ZlSUpQdTlvWFcwYThmMi1JZEVaUjJ5MjBWb3NsdXdES29qUjlCaHFxLUNaRjZqcGtNVWJLYUQ4MmExcFloN3JlWFZRdnFsTHBfV0VORzYwdTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Major Crypto Whale Swaps $18M from PEPE to Ethereum - Crypto Times",
        "content": "Whales are making waves in cryptocurrency, with notable transactions drawing market attention. Recently, a whale identified as 0x837 converted a substantial $18 million from PEPE to Ethereum, coinciding with mounting anticipation for a potential spot Ethereum ETF.\n\nStrategic Stakes Amid ETF Buzz\n\nThis strategic shift involved staking significant amounts in the Compound protocol, reflecting a tactical approach to yield generation amidst evolving market conditions. The movement of funds by 0x837 suggests a preparation for potential changes in market dynamics due to the ETF speculation.\n\nFurthermore, this activity aligns with a broader market optimism for Ethereum as stakeholders await regulatory nods. Historical precedents from Bitcoin ETF launches hint at a strong institutional appetite for similar products in Ethereum, although projections suggest Ether inflows might measure around 33% of those seen with Bitcoin.\n\nMarket Reactions and Price Adjustments\n\nThe transaction significantly impacted PEPE’s market price, which witnessed a decline amid these large-scale movements. On the other hand, Ethereum has shown resilience and recovery potential in trading sessions, indicating a bullish stance from investors.\n\nThe potential approval of an Ethereum ETF could redefine investment landscapes and bolster Ethereum’s market position. As developments unfold, the crypto community remains vigilant, ready to respond to shifts steered by influential market players like Whale 0x837.\n\nIn this evolving scenario, the interplay between regulatory decisions and whale activities continues to sculpt the cryptocurrency ecosystem’s future. Such dynamics underscore the complex yet pivotal role of major stakeholders in influencing market trends and asset valuations in the digital age."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSXpDZ2pneWlQM1RIM2xvM0VheFFUSHZ0MHVMYWw4ZFBDV3lSUnhlNExTWTN1Wl95MnZ2aW14Q3NydXVZS3cwdkVTUkRyaHJsNU1VMElEYk1HYm5WUTVwTWdWSlFFUnFVTHpILWc0QTdJZDZBSTNwT1N6VWpOWDE0aTlubFladUt1ekc2eA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Surges 800% This Year, Outpacing Bitcoin & Ethereum - Watcher Guru",
        "content": "Solana (SOL) has shown impressive growth this year, surging by almost 800% and outpacing both Bitcoin and Ethereum. Over the last 12 months, the token has increased by more than 770% according to CoinMarketCap, despite its recent dip to the $141 level.\n\nAlternatively, Bitcoin and Ethereum have grown 100% and 82% in the same time frame, respectively. The development has firmly established SOL alongside both BTC and ETH as the top three cryptocurrencies in the market. That fact has led two firms to file for Spot Solana ETFs this week alone.\n\nSource: Bitcoin.com\n\nAlso Read: Solana June End Prediction: Solana Blinks To Help SOL Cross $180?\n\nSOL Beats Both Bitcoin and Ethereum in Yearly Gains So Far\n\nThroughout 2024 thus far, the US has approved two crypto-based ETFs. That is expected to grow, and Solana has emerged as a favorite to get the investment product, especially as its 800% yearly gains have outpaced both Bitcoin and Ethereum.\n\nA recent report from GSR Markets has said SOL “cemented itself as a part of crypto’s Big Three.” Additionally, they stated that it is “just a matter of time before Solana” gets its own ETF. That would place the three assets in rarified air, but looks more and more like it will become reality.\n\nSource: Decrypt\n\nAlso Read: 21Shares Officially Files for Spot Solana ETF\n\nBoth 21Shares and VanEck have filed for the Solana investment product this week. It speaks as much to Sol’s potential as an investment offering, as it does to the shifting regulatory conversion in the country. Moreover, it could speak to an even greater overarching change taking place.\n\nBloomberg recently said that “Bitcoin’s performance is starting to be overshadowed by Ether and Solana” as ETF hype grows. Additionally, there is the expectation that the latter could get a much-needed boost from the investment product discussions. If it does get approved, the industry, and the token itself, should be massively helped."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVUFEaUgySlU3Y25YN1BNb1hwdXk5VWd6TElrX0JEOVpuaVhUbzhNeG8zdmxTT3VyOWc3R3AtWWRadGMxbzVYcUM5N1BDREFrWWNXcTUtTzAyaV9WbGdwZUdWWU1ndnZXLVQ1QldWVUI3ak1qNDk4NE9NMGdncVRZY1VmejRESkZZdGs1UWh1MXBGdEXSAZgBQVVfeXFMUEtaM1NsSFlsMGNNVFhtNEo2dVFXWWxRaHdYYTc5bDYwLVFZbzRyUnBTclp6NTdPNkc5SDh6QWtWdFgyLXhZSjNXYm83TVVvdndFNTZkbDV3T3lEYUFVTVdqZUx4OGtlbmVFdzBza2gyakZWT3JSR002YzVlZlVCcEdTRnVQdzN3eTFoc3QzWXBWUWJjR1FiUk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price under pressure? A look at on-chain data suggests… - AMBCrypto News",
        "content": "The number of addresses on the network has been falling for the last seven days\n\nETH supply on exchanges fell, reducing the potential of a sell-off\n\nThough Spot Ethereum [ETH] ETFs would begin active trading in a few days, activity on the blockchain’s network has been discouraging. AMBCrypto found that out after evaluating the project’s network activity.\n\nAt press time, we observed that Ethereum’s active, new, and zero-balance addresses had dropped. By definition, new addresses refer to unique users making their first successful transaction on the network.\n\nActivity falls, but there is a catch\n\nThis metric acts as a measure of traction or adoption. On the other hand, active addresses track the number of users participating in transactions. When this metric rises, it means an increase in the level of user engagement and growth.\n\nHowever, at the time of writing, active addresses had fallen by 15.45%. in the last seven days. New addresses were not spared either with a 6.50% decline.\n\nThis development comes as a surprise considering how close the projected ETF launch is. If this decline lingers, the price of ETH could be affected. This, because a drop in Ethereum’s network activity could mean less demand for the cryptocurrency.\n\nAccording to CoinMarketCap, ETH’s price was $3,379 at the time of writing. This represented a depreciation of 3.35% within the last week.\n\nAnother indicator AMBCrypto examined was the Exchange Supply Ratio. This is the ratio of coins reserved in exchanges, relative to the total ETH supply.\n\nWhen it hikes, it means that the number of coins sitting on exchanges is moving up. A potential consequence of this is a rise in selling pressure which could later on lead a price fall.\n\nHowever, at press time, the ratio seemed to be falling, according to data from CryptoQuant. This decline lowers the risk of a sell-off as holders seem to be comfortable locking their assets for safekeeping.\n\nETH traders are not confident\n\nAs funds move away from exchanges, the potential for a bull run rises. However, for this to affect ETH in a positive manner, buying pressure needs to rise.\n\nIf this is the case, ETH’s price could climb towards $3,600 within the first few days of July. However, if the opposite happens, the value could consolidate between $3,200 and $3,400.\n\nAdditionally, Ethereum’s Open Interest dropped from the value it had on 27 June. OI, which is its short form, refers to the value of open positions in the derivatives market.\n\nAn increase in this metric implies that traders are involved in a lot of speculative activity. On the contrary, when it falls, it means that traders are closing existing positions and taking money out of the market.\n\nWith a value of $13.14 billion, ETH’s OI implied that participants are not refraining from opening positions to capitalize on movements from the price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nShould the value continue to fall, ETH’s price could also follow in the downward direction. However, this prediction might be invalidated if open contracts increase and buying pressure in the spot market follows.\n\nIf this is the case, ETH could begin a hike towards $4,000."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQTmNNRkNLSkkzcEp0b05XUmVYMXBOcHhwUS1Fa3lWT3VIWkJZdXMyWUxHVERCNzVxak1CY3c0QmxycUZtRTRvUDJONXlDS252Yk9yRGpzQ0F0Snp5dW5rS0IwbWNzQmFFVkhZLUZNdzdRWW04UHNiTVRMaFNsY3FON3NwMzJnWWdF0gGOAUFVX3lxTE94WWRiZmNSZmNVZTNlNm56V3dSMjFsQjN5ZndFU0IyekF6UENHZEg0RF8tU0tRMXNZTmRkYi1GMmgxNHFpaGM5ZUJhQWU3dDVOUWlxTWxRZG5OcVhRU0RicFV0QzhsR3BKdzd0Mk5UajlHUEt2OHN6SlFONlMxOUwtVldJc0RUODNKYm8tc0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "US SEC Delays Spot Ethereum ETF Launch, Sends Back S-1 Forms - CoinGape",
        "content": "The spot Ethereum ETFs that experts like Bloomberg ETF analysts Eric Balchunas and James Seyffart expected to launch next week have been further delayed by the U.S. Securities and Exchange Commission (SEC). The SEC issued a few comments on the S-1 form submitted by spot Ethereum ETF issuers, with refiling expected in the coming weeks.\n\nSEC Comments Postpones Spot Ether ETF Launch\n\nThe U.S. SEC in the latest comments has asked the spot Ethereum ETF issuers to submit the S-1 forms by July 8, according to people familiar with the matter. This means the spot Ethereum ETFs launch is delayed to mid-July or July-end.\n\nadvertisement\n\nSEC Chair Gary Gensler recently confirmed that the approval process for spot Ethereum ETF is going smoothly after issuers including BlackRock, Fidelity, 21Shares, Grayscale, Franklin Templeton, VanEck, and Invesco. The Ether ETF issuers such as VanEck have also filed Form 8-A in preparation for listing on exchanges by July 8.\n\nThe delay puts Ethereum holders in limbo. ETFstore President Nate Geraci earlier noted that the last round of S-1 revisions was quite “light” and the regulator will likely clear issuers for trading within the next 14-21 days. While the exact timeline is unclear, the SEC hinted at a potential launch this summer.\n\nAlso Read: ETH/BTC Pair Eyes Major Breakout With Ethereum ETF on Horizon, What’s Next?\n\nETH Price to Drop Due to Delay?\n\nMarket participants have criticized the move by the SEC as Ethereum and the broader crypto market are already trading under selloff pressure. The odds of Ethereum ETF launch next week ignited hopes of altseason as ETH/BTC price was finally moving above the 365 simple moving average.\n\nETH price rose 2% in the past 24 hours, with the price currently trading at $3,068. The 24-hour low and high are $2,826 and $3,090, respectively. Furthermore, the trading volume has increased further by 57% in the last 24 hours, indicating a rise in interest among traders.\n\nAlso Read: Ripple Vs SEC – Judge Torres Doctrine Stands, XRP Secondary Sales Are Not Securities\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOa3RXZTVHSFl0Qlhub3NpUHpST2NZWUhzNkhLd2tBSGQ2QjBBdHJFN1hpZVRKcEJpVTh6a09TczNsNTdVbTJWUXlUNUdEMnJkMlVXdU16eUlDd1JYLWo1eFc1QV9lNExYUG55ZUdOSmRiM1VHNmwxV0dqSHJOZk9uZkVWeGU3STBKWkJTLUFiUG92bmI1OXVlSDVBWWtjMWE1ekJ5R1RTeW9vRGxjWXZjZGdKdElSSG5lQnJSdlgydVhXcExDU216M0lfeXFiN01rOW9FLdIB2gFBVV95cUxPTlNYVHgwcTllQTlnSUl4RkgwSDN2S204TUs3dnFkRkItRGxGRVhkdm1teE1XTHRpZDF4Z3FYdWswRC1wWWttZ28yYzlSTktMdHhEclN2SjZMRHNIMl9WeTYtRmIzZGppbkNxOExrazlUcldDdlZTQjRrS2JPSndRVFFKSHpJTThLSXZxNTY4NEVIS2lDd2hRWmw2azR2STBFNnFiZGYzczU3T0V1TnFDcVFqVGFIMWk0WHh4WmVzNVlyUlRwU1M4UmhnUHhBV2pXaWpJYVc1YTE4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum long-term holders could play major role in ETH's price movement in coming weeks - FXStreet",
        "content": "Ethereum long-term holders now own 78% of ETH's total supply.\n\nSpot Ethereum ETF issuers have begun marketing their products with a potential \"tech play\" move in the cards.\n\nEthereum options data shows reduced volatility as ETH looks set to reach a new yearly high.\n\nEthereum (ETH) is down 2% on Friday following increased holdings among long-term holders and ETH ETF issuers launching marketing campaigns for their products. Meanwhile, ETH options data reveals key price dynamics that may see ETH reaching the $4,000 price level in the coming weeks.\n\nDaily digest market movers: ETH long-term holders, ETH tech play\n\nETH long-term holders (LTHs) may play a major role in determining the direction of its price in the coming months. This is revealed in the ETH Balance by Time Held chart, which shows that 78% of ETH supply is held by LTHs, according to data from IntoTheBlock.\n\nETH Balance by Time Held\n\nLTHs are typically interpreted as addresses that have held onto their tokens for over a year. Historically, heavy selling pressure from LTHs often signifies the peak of a bull cycle.\n\nConsidering that ETH LTHs' holdings are growing, ETH could still see considerable price growth in the current cycle.\n\nAs earlier reported, LTHs may be anticipating higher prices from the upcoming launch of spot Ethereum ETFs. This is unlike Bitcoin LTHs, which have continued to shed their holdings since the beginning of the year.\n\nMeanwhile, spot ETH ETF issuers have stepped up their marketing efforts. Asset manager VanEck seems to be leaning toward the decentralized applications side of the top smart contract blockchain. In a recent tweet on X, VanEck said, \"Ethereum is like an open-source app store.\"\n\nThis follows a series of marketing videos from Bitwise comparing Ethereum against \"Big Finance.\" Bitwise’s Ryan Rasmussen stated that Ethereum may resonate more with Wall Street than Bitcoin. \"Why? Well, most investors don't own gold. But almost every investor owns tech,\" he said.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nETH technical analysis: Ethereum could reach a new yearly high following insights from key options data\n\nEthereum traded around $3,390 on Friday, down 2% in the past 24 hours. ETH has seen about $24.84 million in liquidations, with long liquidations accounting for 81% and shorts for 19%.\n\nAccording to Greekslive data, over 1.04M ETH options expired on Friday with a Put/Call Ratio (PCR) of 0.59, a Max Pain point of $3,100 and a notional value of $3.6 billion.\n\nOptions are derivative instruments that give you the right to buy (call) or sell (put) an underlying asset based on predetermined prices at a specific date.\n\nWhile many expected the options expiry to cause high volatility for ETH today, its price has remained relatively unchanged in the past 24 hours. This aligns with ETH's implied volatility (IV), which is at a low level, sitting below 60% for all major terms.\n\n\"It will be a cost-effective option to buy some call options while the IV is low,\" said Greekslive.\n\nETH Deribit Options Open Interest\n\nAdditionally, Deribit's exchange PCR has fallen to 0.27 from around 0.36 earlier in the month, according to data from Coinglass. This suggests most traders are bullish, especially with the potential launch of spot ETH ETFs. The $4,000 price level is key to watch out for as it's the strike price of over $420 million worth of calls on Deribit.\n\nWhile ETH looks set to follow a horizontal trend over the weekend, it may begin to see gains as the spot ETH ETF news saturates the market.\n\nETH/USDT 4-hour chart\n\nETH has to overcome the $3,629 resistance — a level it has failed to sustain a move above in the past three weeks — before it could see a further move up. A successful, sustained move above this level could see ETH rise more than 18% to test the resistance of $4,093 and potentially reach a new yearly high.\n\nThe $3,203 level may prove a crucial support for the bullish run. A breach below this level would invalidate the bullish thesis, potentially causing ETH to face a major correction."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBwaGdLNDZ3UE50d0Vkc1o3MnNUU3lrZlNfTF9EUTF0TUs3UFVITElpY2FuM0tVLWlQVEtwYk1rWTNTUWpvYVl2WkxaQkxhUlBPcDk0UUZLYmlFMkxqVnUyNXBnQ1ptSkQxQXE5YnFSNG9NTkJMN0tOajU5SE96Z9IBgwFBVV95cUxQaGstaWhvWkJUVk4zS2pFZV9tQ3ZiVHVIXy1zWnFSdGRyU1VadmtuOUdPallpUFRJVE9vdXM5NEVoTVBMcS1tRUdGNGZzRHJpdnh6WUFOZlc4S2FaSUZOdlJITGJkM2wtS2trRmdMUlgtbVdURDRCN3RQVHIwNUdpVE02TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Here's How Rich Ethereum Founder Vitalik Buterin Really Is - U.Today",
        "content": "Arkham has updated a report detailing the wealth of Ethereum founder Vitalik Buterin, estimating his net worth to be at least $833.83 million.\n\nAdvertisement\n\nButerin's wealth stems primarily from his role as the co-founder of Ethereum, where he received a significant allocation of the altcoin during its launch in July 2015. At its peak in 2021, the value of his holdings briefly pushed him into billionaire status, as ETH surpassed $3,000 per token.\n\nCurrently, Buterin's known crypto holdings amount to approximately 245,278 ETH, valued at $831.2 million. These holdings represent a significant portion of his net worth, which also includes investments in projects such as StarkNet. However, over the years, Buterin's ETH holdings have decreased, in part due to sales and the inflationary design of the network.\n\nAdvertisement\n\nAt the same time, Buterin's ETH holdings have consistently represented a small fraction of the total, in line with his claim to never hold more than 0.9%.\n\nETH to USD by CoinMarketCap\n\nWhen comparing his holdings to other top ETH holders, Buterin stands out as the leading individual holder, while entities such as exchanges and institutional managers dominate the top ranks. Despite fluctuations in crypto prices, Buterin's wealth remains closely tied to his crypto investments, including non-ETH tokens such as KNCL, WETH and DEGEN.\n\nThe estimated net worth of almost a billion dollars should be considered a conservative figure. The existence of undisclosed holdings and potential non-crypto assets could push the actual number higher."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPcFFtZ3BOcDloLVNXVlp2dF9qVHpZY2hmemNNckp3VlVRVHpsU095bEI5bWV1Mzg3N1o3eGtvWXBKZnV2Mk9OdmRLUlZONFF6TE1wLW5BNDBucmhZQmNKVHM2dW5ydmtXWXNSLThNUUg4djlNS2x1YWhfZVVBajVHNWRmWGhWRFBtMGhvZzVUNVpmVUQ2bnFoZXVB0gGfAUFVX3lxTE9NWVhZT1BrYVEwUmw1UlVrYklZTENOdnd3TmpvOE1POTlXbG1pWlRuT1RUVUlfWDhsb3BjajQzeGYyU1Z0eWxCTjR0ZkZkb0xQT1pCQkF0T0tTTEVMallBTFBmUE5qY3B6alptOUdxZTl5bktNbDVDQWNhOW9PVUNvZGVHTGlHR05DV1VQQTlieU1ZNVozTWJucHBFemhvTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Pair Poised for Breakout as Ethereum ETF Launch Approaches: What’s Next? - CoinGape",
        "content": "Alongside Bitcoin, Ethereum has faced selling pressure, falling below $3,400. Despite a 3.5% weekly drop compared to Bitcoin’s 5.8% decline, ETH has been holding up relatively well against BTC. Technical charts indicate that the ETH/BTC pair is on the brink of a major breakout, coinciding with the upcoming launch of the spot Ethereum ETF next week.\n\nETH Price to Rally with Spot Ethereum ETF Approval?\n\nCrypto market analyst Ali Martinez showed that ETH/BTC is finally moving above the 365 simple moving average. This development shows an early sign of the impending altcoins season going ahead.\n\nadvertisement\n\n$ETH / $BTC is finally moving above the 365 simple moving average, showing early — very early — signs of an impeding #altseason! pic.twitter.com/HSP1Dm5bjm — Ali (@ali_charts) June 28, 2024\n\nCrypto analyst Michael van de Poppe also shared a similar view stating that the bull market has already begun and would gain significant momentum if the Ethereum price breaks through the 0.06 BTC level.\n\nOn breaking these key levels, Poppe expects a significant influx of capital into the Ethereum ecosystem. The launch of the spot Ethereum ETF next week in the US could prove to be a major catalyst in this direction.\n\nAlso Read: PEPE Whale Shifts Focus To Ethereum As ETF Optimism Builds\n\nPoppe added that the Ethereum ETF remains the most undervalued and underhyped event of the year. He added that, unlike the Bitcoin ETF, there is not the same excitement with the Ethereum ETF approval. “The Ethereum ETF is basically everything in reversal. Zero expectations, zero hype, and if there is any expectation” wrote Poppe.\n\nPoppe stated that although the Ether ETF is likely to attract fewer inflows in comparison to the Bitcoin ETF, it can have a significantly greater impact “as the stock-to-flow of Ethereum is less than that of Bitcoin due to the huge amount of staked Ether and the deflationary concept of Ethereum”.\n\nEntire Ether Ecosystem to Benefit\n\nPoppe believes that as the ETH/BTC price pushes higher, the entire Ethereum ecosystem would benefit out of it, driving more usage, liquidity, and developers towards it.\n\nPopper further explained that altcoin cycles typically show a weaker performance during the first half of the year. However, from June onwards, the cycle would reverse and momentum would build in favor of the altcoins presenting opportunities for greater returns.\n\nAlso Read: Are Spot Ethereum ETFs Set To Launch In 14 Days Post-S-1 Amendments?\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQOHNyZEFYTzVBcTcxWlZ1RTBRNklubmJ1c3IxWVZmakR4Y1NrUHE1RlNDWGlVVlVrNU5USmFTTjI5OE93Qmo1SDJlLTFkRmZlandkM2VkSDZUN1k1V2o0WmVEVTNsTkZLazBqVWV4d0lNeGdheWpsVmpTQ2FrMElJc0phdEJWN0dtWHcyeDVn0gGTAUFVX3lxTE05T0lmUGJJMEtiVXc2ZDlRZnpHaFE4N3FWUFBQc3F4RXQ3VDFNY2tIaTdTeFozLWlna0o2XzRWNURNWUxkcC0xRWxKTFkxR1VXT3JKS25XVnBYYmRhOGszQ0VidF92SXBWSWc5cjQzM3ZZSVlvdWMtMVlvY3FDd3VKcTR0NkhWdk1hVEFxSnVaYlE0aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Could Solana Mimic Ethereum and Surge to $1,000? Analysts Weigh In - CoinGape",
        "content": "Zhu Su of Three Arrows Capital has made a bold projection for Solana (SOL), suggesting it might reach $1,000 per unit. This optimism mirrors Ethereum’s historical ascent, supported by the performance of Grayscale Solana Trust, which indicates high investor confidence could propel Solana’s value significantly.\n\nGrayscale Solana Trust Signals Strong Market Confidence\n\nGrayscale’s investment products have historically served as a barometer for cryptocurrency potential. The Grayscale Solana Trust, similar to its Ethereum counterpart years ago, allows investors to engage with digital currencies through a traditional investment structure, mitigating the complexities of direct cryptocurrency dealings.\n\nadvertisement\n\nYears back, the Grayscale Ethereum Trust traded at a substantial premium when Ethereum’s market price was around $200, implying an eventual value of $1,000 per ETH—a target it later achieved. Today, the Grayscale Solana Trust exhibits a similar premium, which some believe could forecast a comparable trajectory for SOL.\n\nMoreover, the Trust’s performance is not merely speculative. It reflects a growing confidence among traditional investors in Solana’s long-term viability. As Solana continues to develop its infrastructure and expand its applications, the trust’s premium could be an early indicator of its future market position. Additionally, the enhanced liquidity and reduced entry barriers, such as investment trusts, contribute to broader market adoption and price stability.\n\nSOL ETF Could Boost Crypto Adoption\n\nThe regulatory environment also plays a crucial role in adopting and valuing cryptocurrencies. Recently, 21Shares applied to the U.S. Securities and Exchange Commission (SEC) to launch a Solana-based ETF.\n\nThe proposed ETF, listed on the Cboe BEZX exchange, underscores the increasing attempts to integrate cryptocurrency into conventional financial systems. This move comes when the SEC’s stance on digital assets remains pivotal; should the SEC not classify Solana as a security, the ETF could go forward, potentially increasing Solana’s exposure and investment.\n\nThe approval of a SOL ETF likely catalyzes further institutional and retail investment, mirroring Ethereum’s early days when its ETFs broadened investor participation. This regulatory approval, combined with SOL’s growing ecosystem and technological parallels to Ethereum, positions it as a candidate for significant valuation growth.\n\nWhen Ethereum was still emerging, it quickly became a foundation for new applications and projects within the blockchain space. Solana is on a similar path, fostering innovations and developments that could underpin new blockchain utilities. If Solana can maintain its technological edge and scale effectively, the $1,000 valuation could be within reach, especially as decentralized finance and digital applications proliferate.\n\nAlso Read: Ripple Executive Highlights Ongoing Struggles in U.S. Market\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNRS0zTll0dGk3aGxQUW5fZ2YxWU1kdHBRbmNVRGNMckdDUmhpZmdQTDZSUDVrZWR4NjB6UFM1My0tTzBrNXBlTy1aZnNFT0hEZ19pUGZVbU9xSWFVdkdzTjluWkJKeU9fVGpmSktaLTZPcTVjdUhTbndlVkI2Z2d1LVRTQzgxQ09FZ3daTDBSdkJkTVg10gGaAUFVX3lxTE1QcGl3SVJaMGxlUjN1YW16cW96NVBqV3BkcWl5el83cnhyV011U2p6eWlYX2cxTWRmTi03elV3NEVGcUlYNm83SnRIVGxETENUTGJSQzZlRmI2ME1yNXE0cVJyczRiVXJZSTJDc29TaVlCS2NpdkRsUDkxNE5BZUFkanlYOERQTFNIazNhTlpzbTF2MzBoM1oyTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s market bottom in? Price indicators point to a $5K target - AMBCrypto News",
        "content": "Ethereum’s price action finally turned bullish in the last 24 hours.\n\nSelling pressure on Ethereum increased last week.\n\nThe actions of whales have a major impact on crypto prices, including those of top coins like Ethereum [ETH]. The latest analysis rightfully pointed out one such interesting development. Separately, a key ETH metric suggests that investors might soon witness a price hike.\n\nEthereum and Bitmex’s connection\n\nBlitzzTrading, an analyst and author at CryptoQuant, recently posted an analysis highlighting a unique trend. As per the analysis, following sharp increases in Ethereum reserves, noticeable decreases in the ETH price are observed.\n\nFor instance, on the 28th of September, there was a massive decline in Bitmex exchange reserves, which was followed by an increase in the ETH price.\n\nThis correlation between ETH and Bitmex meant that when Bitmex Ethereum whales buy through Bitmex, we observe a decrease in reserves.\n\nConversely, when they sell, we see an increase in Bitmex reserves. At press time as well, Bitmex’s ETH reserves remained relatively low.\n\nEthereum at a market bottom\n\nIn the meantime, Ethereum’s price finally managed to turn bullish after several days of corrections. According to CoinMarketCap, ETH’s price increased by nearly 2% in the last 24 hours.\n\nAt the time of writing, ETH was trading at $3,428.69 with a market capitalization of over $412 billion. AMBCrypto’s look at Glassnode’s data also pointed out a bullish metric.\n\nThe Pi Cycle Top indicator revealed that ETH’s price had hit a market bottom, which hinted at a bull rally. If that turns out to be true on this occasion, then ETH might soon touch $5,000.\n\nApart from this, Ethereum’s fear and greed index had a value of 32% at press time, meaning that the market was in a “fear” phase. Whenever the metric reaches this level, it indicates that the chances of a price increase are high.\n\nNonetheless, Santiment’s data revealed that selling pressure on the token was high. This seemed to be the case as ETH’s supply on exchanges increased.\n\nAdditionally, its exchange inflow also spiked, signaling a rise in selling pressure, which might restrict ETH’s price from moving up.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nLike the aforementioned metrics, a few of the market indicators also remained bearish on the token. For instance, both Ethereum’s Relative Strength Index (RSI) and Chaikin Money Flow (CMF) went sideways near their respective neutral marks.\n\nNonetheless, the Money Flow Index (MFI) looked bullish as it moved northward, indicating a continued price rise.\n\n\n\n\n\n"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQY0N0SUduN3dUUHBvYi1rLU9weDBaZTJYZzlFamhmaTNWZUtnLVJEUjFKd21Sa2xtcFEyN051NUl1MVVjbXNWNmNDR0VpSjVEWTVvYmN3SGtvdkVFN2ZPSVEwSjUySEYzUGFMQ2FaQXRESWt0VmZkR0pXUk1uNVMwNjJSRHBOTkZ3M0tVS28wWnpWUdIBlwFBVV95cUxPX3hCY1JfNzc1UndfR1duR2VQTmEtMmVTdlhjaVFqSUx3M0Q5UE8yYTlMdXc3OGVCeWNWMmw3cjlEcUlHUVpDcjdqLXUxQ0hWVVpqWUc3ZVdhVjd0NloxemNodlo1ZUViamZUbWtqNkNuV0E0UGZQTEotQ21BOVVDZF9XM3VGdmtIWFJpeW1yNTlmRTV3TUtj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum investors suffer as bearish sentiment takes hold - AMBCrypto News",
        "content": "Bearish sentiment across the crypto sector was on the rise.\n\nBitcoin and Ethereum witnessed a decline in profitable and short-term holders.\n\nAMBCrypto’s analysis of Santiment’s data revealed that the bearish sentiment across the crypto sector was on the rise.\n\nBears leap forward\n\nAccording to the data, there’s been a dramatic plunge in bullish sentiment across online forums like X, Reddit, Telegram, 4Chan, and BitcoinTalk.\n\nTraders have seemingly lost faith in the markets, with bullish calls dropping significantly. Interestingly, bearish calls have also decreased, but at a much slower pace.\n\nFearful investors who were previously bullish might now be more likely to sell their holdings, driving down prices of Bitcoin [BTC] and Ethereum [ETH] in the short term. This could trigger a domino effect as others panic-sell, further increasing the decline.\n\nHowever, the significant drop in bullish calls could also indicate a capitulation event, where investors have exhausted their hope and are forced to sell.\n\nThe selling pressure might eventually wane, leading to a period of consolidation and potentially a market bottom for BTC and ETH.\n\nA tale of two holders\n\nAt press time, BTC was trading at $61,361.69 and its price had fallen by 0.67% in the last 24 hours.\n\nDuring this period, the MVRV ratio for BTC declined significantly. A fall in the MVRV ratio implied that along with the price, the profitability of most holders had also decreased.\n\nCoupled with that, the Long/Short difference of BTC had also fallen. A declining Long/Short ratio indicated that the number of long-term holders had declined compared to the number of short-term holders who were flooding the market.\n\nThese short-term holders are unreliable and could be swayed significantly by market fluctuations. If volatility persists, there could be more downward pressure on BTC in the long run.\n\nCoupled with BTC, ETH could also face significant selling pressure. This is because of the fact that Ethereum and Bitcoin are heavily correlated. IntotheBlock’s data revealed that the co-relation between both these tokens 0.86 at the time of writing.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nIn terms of price, ETH was trading at $3,432.61 and over the last 24 hours, it had grown by 1.37%.\n\nThe MVRV ratio and Long/Short difference for ETH had declined as well, implying deciding number of profitable addresses and short term holders."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPZTMtOGk2TkdNakE5c2dEc1kwN1VfSTlDbFdmRzhqUnQ1VWVhb2tUV195UG1xMEkzdzkwTE44Tk9ualFCZTQ2SzUzLWc2emV4NVZiMnQ1XzM5OE01NnBXSUZfM3oxdGtERmxGTVR0c3pKTm9wb1dURnl1M0VaT0NDdEIzdTZVS2pkRTZpM3I0OVVaWllMNlAyZ3ctWk5qUHJMNmI0S1F6bmx5eXVu0gGyAUFVX3lxTE5KNjI1M25EeEZQS3hWM2VkeTFBYkEwcDRYS1hqTjdBSWhhRXM1WUdEcVFvcUhxOE9nTVhnOVlYRHhXNHJ6d0lJSjF5UU5VY0tyNTJzaURXYmVzNUIyaklNaGFYbmRiQWdhd0JMNXRXWTFzZE9mM01ZSXVwZVp3WkNxc2VTMXRzYTJlSU96Qzc2UW9hOFRoTnNreF80Z19ta0xqWkNiLS1rSTZ2OHVVcnlhWEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Huge $690m Sell-Off Sees Ethereum Dive Below $3,300, As Institutions Turn to Raboo and PEPE - Punch Newspapers",
        "content": "Whispers of institutional investors shifting their focus away from established cryptocurrencies like Ethereum and towards lesser-known altcoins like Raboo and PEPE are swirling around the financial markets. Raboo’s unique innovation along with its current presale seems to be the highlight so far, with analysts predicting a massive upsurge post-launch.\n\nKeep reading to find out more:\n\nEthereum Struggles to Pull rebound after $3,300 price drop\n\nOver a $690 million sell off of Ethereum and Bitcoin caused sharp decline in price, which saw the ETH plummet below $3,300. Ethereum made a minor comeback from its weekly low of $3,249, trading today at $3,347.\n\nAlthough the exact causes of the sell-off are still yet unknown, experts believe that a number of variables, such as possible whale activity and profit-taking by short-term investors, are at play.\n\nThe price behavior of today, nevertheless, points to a possible short-term reversal. The rebound of over $3,300 suggests that there is once again purchasing pressure in the market. This could be a result of investors seeing the decline as a chance to acquire more Ethereum at a discount.\n\nSome experts believe a sustained move above $3,450 could signal a broader market reversal. Others warn that the recent sell-off could be a precursor to a more prolonged bear market, especially if the price falls back below $3,300.\n\nPepe Coin (PEPE) Clings to $0.000012 Despite Ethereum’s Rollercoaster Ride\n\nWhile the second leading altcoin Ethereum grapples with a rollercoaster week, meme coin Pepe (PEPE) appears relatively stable, hovering around $0.000012. PEPE seems largely unfazed with the current market movement.\n\nThis continued bullish run has some analysts predicting a potential rise in the coming months, reaching as high as $0.000058 by year-end. This optimism likely stems from the ongoing meme coin craze and PEPE’s recent momentum.\n\nHowever, others predict a significant drop in the next month, potentially falling below $0.00001. It’s still difficult to predict the more likely outcome. But if the coin’s recent price movement is anything to go by, Pepe holders can expect a positive movement in the remaining days of the month.\n\nInvestors Flock to Raboo Amid Price Drop in Top Coins\n\nWhile top coins like Ethereum seem to be in their bearish phase, analysts are bullish on Raboo with many predicting a staggering 10,000% growth potential. Some experts anticipate a staggering 233% growth during the token presale, which has already surpassed $1.6 million.\n\nThe platform also plans exclusive NFTs and merchandise, offering additional revenue streams and exciting opportunities for holders. For those seeking passive income, Raboo will offer staking options with attractive rewards and its AI-backed meme coin is part of these incentives.\n\nAccording to Bloomberg Intelligence, “the generative AI market is poised to explode, growing to $1.3 trillion over the next 10 years.” Raboo is well-positioned to capitalize on this burgeoning market.\n\nNow in its fourth stage of its token presale, Raboo is attracting attention with its unique features. One of the highlights is Rabooscan, an AI tool that scours social media platforms for the hottest memes, ensuring only high-quality content is circulating.\n\nRaboo tokens are currently going for a presale price of $0.0048 which makes it an attractive entry point for early adopters.\n\nConclusion\n\nWith Raboo’s presale price already exceeding $1.6 million with over 2,500 investors on board, the project looks quite promising.\n\nIts presale has generated a lot of market frenzy and hype as several holders remain keen to invest early in this project.\n\nTelegram: https://t.me/RabootokenPortal\n\nTwitter: https://twitter.com/Raboo_Official"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNenlzMDFTQjhxX3B1SzBPVGJBczVfUkRyelNzWVdfQWF4RDRYMWEtbzR4VDFVckJ0WUF4NXBBOFhNUHljcVlTYzJkXzVTMjdaeHVNYjF5c2RVQ2hDQ05qS19YWHcxeldHUUo1MF9CdUpLUmNCMkxMUnBEeGU1MjVyX2xGbFEtZFJkbkHSAY8BQVVfeXFMTWpUemM2VjdtRGIxS0hELVpsemhWcWVmamxmOU52YTVMTWhMMUlra1lJV0lqM1NlNW5keXU3T0tMd1Z5VTRKd3JZS3c3TWhtbGp4eEZYUV83MzFwTS1LMWhNMmNBMHlNMDRiZWRZVFZHRHM5eHFnQjdWUVNHUDMyZTJkN2NHSW5ZZThiUG96enM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s road to $7.5K – Analysts predict a 120% rally because… - AMBCrypto News",
        "content": "ETH could rally 120% by the end of the current market cycle\n\nETH ETF launch could catalyze the rally and its relative strength against BTC\n\nEthereum [ETH] could post triple-digit gains by the end of this current market bull run, according to founders of the blockchain data intelligence firm Glassnode.\n\nThe founders, Jan Happel and Yann Allemann, who go by the pseudonym Negentropic on X (formerly Twitter), claimed that based on historical patterns, ETH could surge to $7.5k on the charts.\n\n“We believe market moves in structures. And this structure gives us a target at ~7500 as a Final High for #ETH.”\n\n\n\nNegentropic made their conclusion based on ETH’s price reaction to the multi-year trendline resistance. The trendline resistance marked previous cycle tops.\n\nAdditionally, before ETH’s last explosive cycle run, a price consolidation ensued, similar to the structure seen on the chart in relation to its current price action (yellow).\n\nETF to catalyze ETH’s 120% potential rally?\n\nThe founders had previously underscored ETH’s increasing relative strength against Bitcoin [BTC] and the rest of the market. They tipped the upcoming launch of the ETH ETF as a key reason and possible catalyst for a new ETH cycle.\n\n“In a Bitcoin-dominated market, Ethereum is showing relative strength. Speculation over an imminent ETF launch could be the catalyst. Is this the start of a new cycle?”\n\nDespite improving ETH’s relative strength against BTC and the rest of the market, the ETHBTC ratio was stuck in a downtrend. The ETHBTC ratio tracks ETH’s relative performance against BTC on the price charts.\n\nHowever, another analyst, TechCharts, noted that ETH could confirm BTC’s outperformance if it breaks above its downtrend.\n\n“$ETHBTC outlook is improving for $ETH. Breakout from downtrend channel can favor $ETH outperformance.”\n\nThe ETH ETF’s launch could further define the trend of the ETHBTC ratio. In fact, according to the SEC Chair Gary Gensler, the approval and launch could happen in the summer itself, possibly in July.\n\nSimilar expectations were reflected by Polymarket too, a predictions platform. It revealed that the odds of approval in early July were above 70%. Here, it’s worth noting that the ETFs are estimated to attract $15 billion in flows by 2025 by Bitwise.\n\nAt the time of writing, ETH was trading at $3.4k, with bearish readings from the derivatives market. The overall volume was down 18%, and Open Interest (OI) rates, which track liquidity, had dropped by 3% in the last 24 hours."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNWUp4RHdzUEFpUzFmZXJkX0llZGdoU2pvSUNVNzhreERVcC1nLW5mblQyeWFoa1VrRjV2LWIwYkxlbVo3ekcxU0NiSnZNbnlnQkJualBBa2ZaTDJCUlBCVVh6dHROMXk0VERKdnJVb3RIRksxcng5bWlmUUZCZEQ3OWpXMUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "This Ethereum cycle hints when Bitcoin will hit major top - Finbold - Finance in Bold",
        "content": "The cryptocurrency market, known for its cyclical nature, often sees Ethereum (ETH) and Bitcoin (BTC) taking the lead.\n\nAmid the current bearish sentiment, recent analysis suggests that Ethereum’s past price performance could offer crucial insights into when Bitcoin might reach its next major peak.\n\nIn an X post on June 28, crypto analyst CryptoCon shared data from analysis platform Glassnode, detailing Ethereum’s price trends following cycle lows in August 2015, December 2018, and June 2022. This data highlights three distinct cycles, revealing significant growth and retracement patterns for ETH over time.\n\nEthereum price performance since cycle low chart. Source: Glassnode/CryptoCon\n\nThe first cycle, which started in August 2015, shows a dramatic rise in Ethereum’s price, peaking significantly before entering a correction phase. Cycle two, beginning in December 2018, mirrors a similar pattern of rapid price appreciation followed by a correction. The current cycle, starting in June 2022, is in progress. As of June 2024, Ethereum’s price has yet to surpass its all-time highs, indicating that the cycle is still unfolding.\n\nNext Bitcoin and Ethereum top\n\nBy aligning the cycle lows, a pattern emerges: Major tops for Ethereum’s first two cycles occurred approximately 30 months after their respective cycle lows. If this pattern holds, the current cycle suggests a significant top for Ethereum — and potentially Bitcoin — around November 2024.\n\n“Major tops for ETH in cycles 1 and 2 line up for the significant top in this cycle to take place in November 2024. ETH hasn’t even managed to surpass previous ATHs yet. Crypto is not finished and still on track,” the analyst said.\n\nThe analysis reveals a notable correlation between Ethereum’s cycles and potential market tops. The cycles’ major tops align consistently, hinting at a predictive trend.\n\nImpact of Ethereum ETF\n\nIn the meantime, attention remains on Ethereum, considering the upstart start in trading for the spot exchange-traded fund (ETF). Reports indicate the U.S. Securities and Exchange Commission (SEC) could approve the spot Ethereum ETF as soon as July 4.\n\nIndeed, the ETF will likely have a general impact on the crypto market. For instance, in an X post on June 29, crypto analyst Michaël van de Poppe suggested that Ethereum’s ETF could be a significant event despite the current pessimism and downward trends in altcoins.\n\nDrawing parallels to historical moments like the Bitcoin ETF, Poppe believes Ethereum’s ETF might have a substantial impact due to Ethereum’s unique attributes, such as staked Ether and its deflationary model.\n\nEthereum price analysis chart. Source: TradingView\n\nHe anticipates that a successful ETF could increase liquidity and developer interest in Ethereum and related projects like Arbitrum and Optimism, potentially reversing recent market trends. Poppe remains optimistic about Ethereum’s potential to lead a broader crypto market reversal driven by economic factors and cyclical trends.\n\nBy press time, Bitcoin was trading at $60,861, reflecting a daily loss of over 1%. In contrast, Ethereum continues to face bearish sentiments, trading at $3,389, showing a 1.5% decline over the past 24 hours.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPYVQtd0p3bjlXLWJxVzcwR1VnMzVHMS1nYVQ3cFh2TGR0bDNkZjBhSWFGTVJiRGtsSkQzbGZqX3RfQkY2d2Y2SGpveU9QaER2ZkFnZ0VhZFp6SWJuRmpWZ3lyck5Od2ZTMEtWTUFDemRVRDhpTU5jY2puQW9Xbjh2YTc1TnpXQUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs face a setback: ‘One more round before approval’ - Finbold - Finance in Bold",
        "content": "As reported by The Block on June 29, the U.S. Securities and Exchange Commission (SEC) has returned S-1 forms to prospective Ethereum ETF issuers with comments, requiring at least one more round of filings before approval.\n\nIn particular, the SEC has asked issuers to address the comments and refile their forms by July 8. This development means that the approval process will take longer than initially anticipated. Consequently, the forecasted possibility of Ethereum (ETH) ETFs going live by July 4 is now off the table.\n\nAccording to a The Block’s source at one of the issuers, the returned forms contained light comments. However, this won’t be the final filing, as at least one more round will be necessary before the ETFs can start trading.\n\nTimeline uncertainty and previous expectations\n\nWhile SEC Chair Gary Gensler previously mentioned that Ethereum ETF approvals could occur “sometime over the course of this summer,” no specific timeline has been provided. This lack of clarity has left issuers uncertain about when their ETFs will go live.\n\nEarlier reports had suggested a potential launch date as early as July 4. However, this latest development has dispelled those expectations. Issuers will only have a clearer picture once the SEC provides a deadline for the final filings.\n\nThe two-step process towards ETF approval\n\nThe S-1 forms are part of a two-step process for ETFs to go live. The first step, which involved the approval of 19b-4 forms, was completed in May. However, unlike the 19b-4 forms, the S-1 forms are not bound to any specific deadline.\n\nThis means that the approval timeline is largely dependent on how quickly the SEC can review and respond to the submitted forms. The process has been described by one source as a “winding path,” highlighting the complexity and unpredictability of the approval process.\n\nLooking ahead: What’s next for Ethereum ETFs?\n\nAs the SEC continues to scrutinize the S-1 forms, issuers and investors alike are eagerly awaiting the next steps. The additional round of filings will undoubtedly push back the launch date for Ethereum ETFs.\n\nDespite the delay, the ongoing dialogue between the SEC and ETF issuers suggests progress toward eventual approval. Nevertheless, the exact timeline remains uncertain, leaving the crypto and investment communities in anticipation of further developments."
    }
]