[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPVmZhbUxOX2FpVEUwcWFTMkZVbE84NnpfSGxCRDlLd0VOT1dqVHZDMnhCc25lNGdiVXdLT0tQcWc5OV8tR0xSWXZIWk5pNUVaVk55UFY1WU5RN2dDbHFqbUp0SlU2TFhIUHNPM1RYaF9NMkdjRVdvOXdTM0d3Vi1YNExKWmFPMDRGbXN4Tk9zazRndjljUmJPXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "3 Reasons Why I Sold Ethereum and Never Looked Back - The Motley Fool",
        "content": "The coin's potential has been very slow to materialize.\n\nA few weeks ago I decided to offload the vast majority of my Ethereum (ETH -1.13%) tokens after holding and accumulating them over the last few years. I don't expect to buy more anytime soon, even if the price drops to attractive levels.\n\nHere's why.\n\n1. The coin's price surpassed the target level in my investing plan\n\nThe biggest reason I decided to sell nearly all of my Ethereum was that its price was above the level that I had identified as my sell point.\n\nI first started to accumulate Ethereum in mid-2020. Per my initial investing plan, I did not set a price target for a sale at the time, opting instead to reassess the issue after roughly three years had elapsed. I continued to dollar-cost average (DCA) and build up my position through roughly the middle of 2023, after which I set a firmer target and stopped buying more.\n\nI resolved to think strongly about selling after the price hit somewhere above $3,000 per token, a level the coin had surpassed in at least three of the periods I'd held it, as shown in this chart:\n\nWhen the coin broke through that price level this year, it was only a matter of time. It's entirely possible that my sale will mean that I'll be missing out on the coin's future growth. But because of the next reason we'll discuss, I won't be losing any sleep over it.\n\n2. Transaction fees were too high, and not improving by enough over time\n\nTransaction fees, known as gas fees, are perennially high on the Ethereum chain. To transact, you'll need to cough up anywhere from $5 to $80 or more, depending on the day. And despite many repeated promises from the chain's developers regarding a permanent decline of gas fees, they have remained stubbornly and painfully high for years on end.\n\nI don't day trade in and out of my cryptocurrencies, so it might seem as though it's hyperbole to complain about the infrequent transaction costs associated with building up a position. But remember, my strategy was to dollar-cost average. Making a series of purchases entailed paying gas fees on the order of $600 in total -- way too much given the relatively small size of my position and my investments.\n\nWhat's more, the thing I kept noticing again and again over the years of my holding was that the high fees were discouraging my friends from buying Ethereum as an investment or trying to use it to interact with decentralized applications (dApps) and decentralized finance (DeFi) services. Noticeable commission costs are practically extinct for most retail investors trading stocks, so the expectation that people often have is that the same will be true in cryptocurrency.\n\nAfter a while, I stopped touting the coin as an investment because I wanted to avoid the subsequent conversations about how high the gas fees were. Ultimately I recognized that behavior in myself, and it was an unambiguous sign that it was time to sell.\n\n3. It's in the uncanny valley of cryptocurrencies\n\nThe final reason that I sold Ethereum is that it is presently in a bit of an uncanny valley.\n\nIf you're not familiar, the uncanny valley is a phenomenon in which a person's reaction to a humanoid robot is warm when the robot does not appear to be very human at all, warm when the robot appears to be fully human, but ice-cold or otherwise negative when the robot appears to be nearly human-like, but is overtly not an actual human.\n\nEthereum has a number of popular meme coins, such as Shiba Inu, a blockchain intended largely for fun or outright gambling rather than investing in serious projects and fostering frontier financial technologies. At the same time, it has a handful of rather esoteric cryptocurrency utility projects and decentralized autonomous organizations (DAOs), much like you'd expect from a chain devoted to hardcore technology development, financial engineering, or methodical new experiments in corporate governance.\n\nYet its high transaction costs make meme coin investing exceptionally painful. Likewise, the same source of friction is a massive drag on for-profit projects, which tend to have a higher need to transact on demand, meaning that they can't wait for fees to decline.\n\nFor other purposes, like minting and trading non-fungible tokens (NFTs) or creating smart contracts, there are plenty of solutions on the chain to choose from. But many of the marketplaces, exchanges, and tools on Ethereum have only rudimentary feature sets or sketchy credentials.\n\nOf course, the Ethereum blockchain itself can't fully control which projects use it or how well they work.\n\nBut for a chain's native token to be a good investment relative to other options, it helps if there's a critical mass of users within at least one (large) community that's loyal to where their projects are deployed. And for this chain, the various frictions are an impediment to that critical mass continuing to build, so I don't regret selling."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4bFhUUnZ4TFRmMTlvTjBHNmo0QjZnNVdfSGdJOWZOa0tCdnZKNDF1MkYzaklRYzMxaGJiQjU4OV9KUnE3Tk9ZWDRpY3FfaFByVlNzYThqNk15bkFHSnRxVjcxQ3FnZXJKcTRqbXV3ZHJNOXhwZHF0alpxdVlpZmvSAYQBQVVfeXFMTl9LNTBfMTJLTlNLR0lOWDZ1U0JJUnA1WHZlT3VOXzRUZ3FrVmdVQ3hfODZCcHp0TlBKQmQxZ2pCWTktMFZVY012aURoTEotbXRiXzA2SUxBRTY5bG1iUFZYRlBpRHVpRlBPUkFhRmxMVWxWZDJ4LWZlMHBBWW9JX29mTXIz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "SEC Calls for Comments on BlackRock's Ethereum ETF Proposal - U.Today",
        "content": "The U.S. Securities and Exchange Commission is now soliciting feedback from the public on BlackRock's Ethereum spot ETF proposal, according to a recent filing.\n\nAdvertisement\n\n\"Interested persons are invited to submit written data, views, and arguments concerning the foregoing, including whether the proposed rule change is consistent with the Act,\" the regulatory agency said in the filing .\n\nThose who want to weigh in on the matter can provide electronic comments via the SEC's internet comment form or via an email. The agency is also accepting paper comments.\n\nThe public will be allowed to leave comments during a 21-day period.\n\nAdvertisement\n\nEarlier this month, the SEC also called for comments on spot Ether ETF applications from Fidelity, Grayscale, and Bitwise. Back then, ETF analyst James Seyffart opined that \"nothing\" in the filing signaled that anything had changed for Ethereum ETFs. He noted that silence from the regulator \"wasn't a good thing\" for approval odds.\n\nFor now, the consensus appears to be that the SEC is not going to approve a slew of spot Ethereum ETF applications in May despite approving a slew of applications earlier this year. The regulator has refrained from engaging with ETF issuers on this matter.\n\nAs reported by U.Today , the SEC recently postponed its decision on the spot Ethereum ETF proposal submitted by prominent investment firm Franklin Templeton.\n\nAt the same time, British banking giant Standard Chartered is convinced that the Ethereum price could reach the pie-in-the-sky price target of $8,000 by the end of the year despite predicting that Ether ETF will not be launched in May."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPZ3Z2ZmctbXBtdkM1ZS1uZXdLSXlmWmloTGtRR285SGRMZ3JqTGRCZEtDdHBsNGtBZWYwM0xIZUhBeDVzZUl2ZXphSmN5RDY1d1B3aml3ekFsdkkxNzhNRVBUbVIxb213RWNET3dBVWxiejZCVHJZVmRCMlJuVTNaUFFfQUQxeDNGUG9XTEhwZlZfcV9vLVI0Wm9iOGhmaUdwZ0czUnpySjUyVzNWYlHSAbMBQVVfeXFMTUtpUU5TMVoxd3NUNmtPbkYyWFl3aHQtN2oxZHJfTy1TdmtlY0NDekZtOFVUaXQ5dllxVG45X3JreFdzRzNrWkROeUdRZXdYMG93enM2ZC1WS051LXQwQ3VXM19CWGlaX0d0WS1IengxTDhFUm5ZMHhsdmFoXzI3VHF4dV8yd0RTZXlEN2cyTTFqdkxqaFdSZDN6Z1VPNDFkMk5kRzhjd0xHdzUzNXNLSDBFY1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ether ETFs Are Unlikely to Be Approved in May: Standard Chartered - CoinDesk",
        "content": "Ether ETFs Are Unlikely to Be Approved in May: Standard Chartered\n\nThe bank reiterated its year-end bitcoin and ether targets of $150,000 and $8,000, respectively.\n\nBy Will Canny Apr 23, 2024 at 3:32 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5icnRLUk0wVXZhUDY5cUJGbFBZQ0I4aFJHc25mWnZudHdhNG1kem12QVhiOEw3aGlzNHB2ZkZWTlVlOFAyeUJoOVl2Z1RTbmZiT0JKR3dfX3VBbjBGRmVUTTlZSEY4cEtHM3hlUmFYVy1WdElJNlBqQW5uVWp0Qlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Holding 6 Ethereum (ETH) Could Make You A Millionaire, According to Cathie Wood - Yahoo Finance",
        "content": "Holding 6 Ethereum (ETH) Could Make You A Millionaire, According to Cathie Wood\n\nWith the recent halving and spot exchange-traded funds (ETFs) driving demand, Bitcoin has had the spotlight for much of 2024. However, according to Cathie Wood of Ark Invest, Ethereum (ETH) could catch up to Bitcoin and provide investors with huge profits in the coming years.\n\nAt an investor conference held by Ark Invest, Wood spoke about Ethereum, noting that the project could reach a market capitalization of $20 trillion by 2032. ETH currently has a supply of around 120 million tokens. So, a market cap of $20 trillion implies a per-token price of over $166,000. Additionally, the Ethereum foundation continues to burn tokens, so this number could be even higher.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nAt a price of $166,000, six ETH would be worth roughly $1 million. Currently, six ETHs cost around $20,000.\n\nFor reference, the entire market cap of the S&P 500 is roughly $40 trillion. Additionally, the entirety of the world's above-ground gold reserves are estimated to be worth around $16 trillion. While Ethereum could theoretically get to a market cap of $20 trillion, it likely won't happen any time soon, if at all.\n\nHowever, to give some reasoning behind this massive claim, Wood mostly discussed mainstream adoption. Ethereum mainly serves as a way to directly interact with a host of decentralized finance (DeFi) applications. These projects can provide benefits ranging from borrowing and lending to storing health records. However, in 2024, DeFi is mostly used for small-scale financial platforms. According to Wood, if Ethereum can begin to rack up use cases that are beneficial to users, adoption could follow, which could theoretically increase the price of the token.\n\nTrending: Dogecoin millionaires are increasing — investors with $1M+ in DOGE revealed!\n\nAdditionally, the potential for spot Ethereum ETFs could further propel prices. The spot Bitcoin ETFs, approved in early 2024, have been the most successful of all time. They have brought in tons of new capital to Bitcoin, helping the token reach new highs. While it is not guaranteed, the potential approval of spot ETFs could have a similar impact on the price of ETH.\n\nApart from this, Wood was likely just throwing a huge number out there to get investors excited about the future of ETH. While there is certainly the potential for a promising future, it is unlikely that Wood's prediction will be correct.\n\nStory continues\n\nIt is also important to consider that Wood has a vested interest in Ethereum's performance. Her company, Ark Invest, currently has an Ethereum futures ETF (ARKZ) and is in talks with the Securities and Exchange Commission about a spot Ethereum ETF.\n\nWood would benefit from an increased volume in ETH, specifically as it relates to the financial products that her firm offers.\n\nDespite the apparent conflict of interest, many are still bullish on ETH into the near future. As crypto adoption grows and the potential for ETH to take advantage of spot ETFs, there is certainly room for ETH to reach new heights.\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Holding 6 Ethereum (ETH) Could Make You A Millionaire, According to Cathie Wood originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPQ20xd2pfU3RUVEQxUjY1cC0tNE4wcDZoOURRbzg2a1Z1bzZaN2Z4bF8wUmsyeVE0aDJQVVY1dzlSVXF1Mm02aWMzbUhFN1dnV2FoaS15em1iUG1lTlJPOC1PclRSbkE2TE15QXFZY2JncE84MEl0Z25sRWRSWk9KNFd2Q09odUlaODFMZU9oXzlqT3VZQ0VQVkJ0N3BrcnZi0gGoAUFVX3lxTE1MVzNwRXVQek1Ub2R1UkZZRUZwNzRsaEJkYXNGSDNpT0ZSbzVBaE9CWGFvb2d2NzJNR2xEa3lkeDExbTN1cEl5RFVXRnl1VEt1eUYxTzBlMFFXcXVOZXhtODhzLXFUcHdfX2kzdDR1VEJGaVRzVXp3ZzNMTXVEbVVGOWdXTVlraUNUbXdLbVlPNWYyZ3p4WUxaSURHQWwyRFpZMm9ZemFKQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Price Reclaims $66,000, Ethereum Sees Modest Gains After BTC Halving - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum, which experienced a spate of last-minute volatility ahead of the BTC halving on Friday, have since recovered from their roller coaster ride.\n\nAt the time of writing, the Bitcoin price is up 1.6% in the past day, hovering around $66,000 after having reclaimed that milestone for the first time in a week.\n\nThe cryptocurrency's block reward halving, which occurred on Friday, saw the reward paid to Bitcoin miners reduced from 6.25 to 3.125 BTC. Although it's usually the catalyst for bullish price action, the effect isn't always immediate.\n\nThere's one thing that did change right after the halving: Bitcoin transaction fees. For a short time over the weekend, the average fee to send BTC soared to an all-time high of $127 according to Bitinfo Charts. That's largely down to the launch of Casey Rodarmor's Runes protocol.\n\nAD\n\nAD\n\nThe Runes protocol picks up where BRC-20s left off. BRC-20 is a fungible token standard, which itself makes use of the Ordinals protocol and was developed by the pseudonymous dev domo. Runes is an attempt to make the process of creating fungible tokens on Bitcoin more efficient.\n\nSo where does Bitcoin go from here? Analysts at IntotheBlock, a blockchain analytics firm, say that BTC is currently sitting a strong support level—which they argue could make it more resistant to downward pressure.\n\n\"Bitcoin is currently positioned right on top of a key demand zone, with 1.66 million addresses having purchased it at an average price of $64,800,\" they wrote on Twitter. \"This price point could potentially act as a strong support level should the market experience further downward pressure.\"\n\nETH, meanwhile, bounced back above $3,000 on Friday and has managed to maintain that price level throughout the weekend. At the time of writing, the Ethereum price is sitting just above $3,200. That's a 1.3% gain in the last 24 hours and only around 1% shy of its price this time last week.\n\nAD\n\nAD\n\nThere could potentially be some good news on the horizon for Ethereum and Bitcoin. Hong Kong has conditionally approved spot ETFs for both assets. Firms there believe they'll get the green light to begin issuing shares before the end of the month. When trading does begin, analysts are predicting that it could help dispel unease around cryptocurrencies in the region, potentially bringing $25 billion worth of new liquidity into the market."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNOUlpX2RNRnF3bUVkTUNFTWR1NGhFMW5EcDhpSTBDdmRNYURPTlF0SzkwcUczMWY0SG0tX0ZwdkFNUTc3TV9XLUxhc0M2NVAzbkpCaFNjb0ZGaWxmQldpbURXNFhrOE5UOFJ1QjdYUy0wM2s0TlVtYklwRm9FbVVLelZJX21peE5XZlRMdzhMODZEYWE5ZnFaVy1KSkpyRXEtVDZxd3l1bDBEdlh5VFgxcXhDRTdkNmNlOUt3ZTRXeHJIQTZkcllzeEtaVFQ5TVFDZUZzZEVJUU5KQdIB3wFBVV95cUxPSTVFVkh0NW1HejRtcTJyWWY1TTZ6bGIwQmFpQnJiQmY2WW5BUDJ6aWttVHl6RTlieG5ndDdqVXpWZGV6QzVWS1lpaVVBR2ZEeW5ub3VuU3gwZUZpc3Q1QmI0SEhNTHl0TDRwSmNxYmZyMFBoT1dZT3d5OEhhQ0NTM1duTkVmcHdBWkRzT1lka1pZOHBQSGppVU1qN21hNHNCdzBNQnBDbE00MjJUdFdES25ZZ0Q2NjFrbW50dnpBeGgzTllWODVEejl5LTJXbW4xa1gySjYyMlBkcFllQWZV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ethereum continues hinting at rally following reduced long liquidations - FXStreet",
        "content": "Ethereum's price often takes a downward shift after FTX and Alameda sells ETH.\n\nTraders expect a price rise in ETH following reduced long liquidations and normalizing risk reversals.\n\nEthereum needs increased trading volume to break past key resistance levels.\n\nEthereum (ETH) has continued showing signs of a potential rally on Tuesday as most coins in the crypto market are also posting gains. This comes amid speculation of a potential decline following FTX ETH sales and normalizing ETH risk reversals.\n\nAlso read: Ethereum shows signs of a potential rally as suspected Justin Sun wallet buys heavily\n\nDaily digest market movers: FTX sale, normalized risk reversals, active wallet increase\n\nEthereum's latest price movement is hinting at a potential rally. Here are key market movers driving the second-largest cryptocurrency:\n\nSince March 1, FTX and Alameda Research have deposited 20,350 ETH at strategic points right before a price dip, according to Spot On Chain. This insight comes as FTX and Alameda deposited 4,500 ETH worth $14.4 million to Binance and Coinbase at $3,207 on Tuesday. Investors may need to observe if ETH will take a downturn as in previous times. Other investors may be using FTX's move as a sell signal, hence the consistent price drop after the firm's ETH sales.\n\n\n\nWith ETH's recent price recovery, long traders are looking to gain control as long liquidations have slowed down significantly on Tuesday compared to the past two weeks, according to data from Coinglass. Short liquidations are increasing, with over $13.45 million liquidated, while long liquidations sit at $7.4 million in the past 24 hours.\n\n\n\nETH risk reversals have also normalized above -4%, from -12% one week ago, indicating traders are beginning to expect a price improvement, according to QCP Capital. As a result, \"improving speculative sentiment could see short covering and a resumption of leveraged longs,\" said QCP.\n\nRead more: Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies\n\nMeanwhile, Bankless podcast co-host Ryan Sean Adams pointed out the increasing number of active wallets in the Ethereum ecosystem, which has grown to over 10 million weekly active wallets. He speculated that the Ethereum ecosystem can now increase user growth by 10x to 100 million in this bull run.\n\n\n\nThe US Securities & Exchange Commission (SEC) has also delayed its response to Franklin Ethereum ETFs, a series of the Franklin Ethereum Trust. The latest spot Ethereum ETF decision delay follows a series of timeline delays the regulator has given to other applicants.\n\nTechnical analysis: Ethereum needs increased volume to break past key resistance\n\nEthereum's recent price movement is teasing that a potential rally is on the horizon as it's attempting to break the upper side of the $2,852 and $3,300 key range. But it must first move past the $3,279 resistance to confirm.\n\nAlso read: Ethereum shows firm support at key level as its correlation with US indices increase\n\nHowever, declining trading volume amid the price increase is a concern. While bulls appear to have taken the wheels again, the reduced trading volume indicates low commitment and uncertainty. ETH could quickly push forward to break past the $3,300 key level if increased volume accompanies the rising bullish sentiment.\n\nETH/USDT 4-hour chart\n\nSuch a move will see ETH filling the liquidity void of April 13 and aiming for the next resistance of $3,406 formed on April 7. This resistance may prove easy to break past if trading volume increases. However, if volume fails to increase, ETH may fall back to the $3,056 support of March 20.\n\nAdditionally, with the halving behind us, Bitcoin's dominance over ETH may reduce in the long term, leaving room for the largest altcoin to craft its own path.\n\nEthereum is trading around $3,232, up 1.3% on the day at the time of writing."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNX1E4OGxEdjMxU1d1MmVUWkc2UTNoeVRNa0RqdVQzbXljc2lQMjUwdkhWc2phYm0yRGtqeDRBWmRPUWtDd0NGaTU1Wi1xbmZ4WmNDcHEwRHFETGRzdXVHYkNVbGpmd3NFaG5Qb3FMVFdBLUt2NE8zdnl4TlBxbV9WTEFadERTN0g0S1ZqejZURm9fR0JPbGlaTkZ5OTR0UVV3SGJZY3BoM09RaUJrYkJ5dzV5Mm16RjFyWHlCMlVwZ9IBxAFBVV95cUxOcHlad2g1UzJBek5OZ05YdEtkekYzaGoyZnJISTNtUFd2eEtkTWJfamp3VE5QWGdScEl1Q1pWeFFSR3RnT1M1OG9COWd2ek0zOWhINW45eTFIS3k2Y0FzQndzaUVkS2lkQ0ZtMXQyQUZIcEZYTmwwR2p2OW1lYl9lZXpSOG5Hd3AxbzVwVTVKdHRaUUk5cVdMc09VeXZ4eUNDNWNyVUIwOVlaRFpMY3JJLW9ONV9PdG9pMVNQOUlDbldXamd0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Giant Whale With $405,190,000 in Ethereum Starts Withdrawing ETH From Binance: On-Chain Data - The Daily Hodl",
        "content": "Crypto whales are currently on the move as one large entity with nearly half a billion dollars worth of Ethereum (ETH) was spotted withdrawing coins from crypto exchanges.\n\nFirst seen by blockchain tracking firm Lookonchain, an address beginning with “0x4359” was spotted taking their ETH out of Binance and decentralized exchanges (DEXes).\n\nLookonchain says the whale has accumulated about $405.19 million worth of ETH in less than two weeks.\n\n“This giant whale withdrew 10,119 ETH ($31.85 million) from Binance…\n\nHe has bought 127,388 ETH ($405.19 million) from DEX and Binance since Apr 8th, with an average buying price of ~$3,172.”\n\nOn the same day, another unknown entity was spotted by whale tracking service Whale Alert sending 14,408 ETH worth over $45.745 million to crypto exchange OKX.\n\nWhale Alert also tracked down a wallet that was involved in the initial coin offering (ICO) of Ethereum move 197 ETH worth $622,685. The wallet had been dormant for nearly nine years prior to the latest transfer, according to Whale Alert.\n\nAnother whale was seen attempting to leverage-long Ethereum, after previously losing millions trying to do the same move. Lookonchain identified the entity borrowing USDT from the lending platform Compound (COMP) to long ETH.\n\n“This whale went long ETH again.\n\nHe lost two times while long ETH, for a total loss of $4.5 million!\n\n[On Sunday], he withdrew 8,249 ETH ($26.18 million) from Binance and deposited it into Compound, then borrowed 17.3 million USDT from Compound.”\n\nAt time of writing, Ethereum is trading at $3,222.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQU2M5dVR1WjlGMU51RFdieVRQdzJSb0RKTnU0T05icVk4dURNMnd3S3JZXzdOU2wyQzh4Z1ZIU0lOWDE1RWR5a2FZRUNtVEd1VlNyeGtpVkY5R3psQzFDSFFOa2ZPY1BpZWw1eVlwTXM3QlpySWJyWVNmZGFfUVRFUjgxY1VWV3pMNDBxNl9fWUtqSGZoVVB3NDBZQndzei1EZ2M3SklZTzZobDBOVmZUSnNEak8wNDlNOEpfdTdmaW0xZTF5WlJr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Technical analysis of Ethereum price: ETH consolidates after testing key resistance levels - The Cryptonomist",
        "content": "While the cryptocurrency market continues to navigate a landscape of volatility and transition, Ethereum (ETH) remains a focal point for traders and investors, its price analysis remains constant.\n\nWith the recent price fluctuations, a detailed technical analysis provides valuable insights, especially when examining the 1-hour, 4-hour, and daily charts.\n\nThis comprehensive view provides insight into potential entry and exit points through oscillators and moving averages, guiding short-term and long-term trading strategies.\n\nFluctuations and opportunities in the analysis of Ethereum ETH price\n\nThe 1-hour chart of Ethereum reveals significant price fluctuations, ranging between 3,116 and 3,236 dollars. This variability signals promising opportunities for more agile traders.\n\nA key strategy could involve buying at or near the level of $3,116, which has emerged as a reliable support.\n\nIf the upward trends were to be confirmed, entering here and planning the exits near the resistance of $3,236 – where prices have previously reached the maximum – could optimize gains, minimizing exposure to sudden declines.\n\nSwitching to the 4-hour chart, Ethereum shows an ascending pattern, suggesting a gradual consolidation of recent gains after bouncing from the $2,864 support.\n\nThis broader perspective indicates a bullish momentum aiming for new highs. Traders are advised to monitor a strong recovery from the support level and to set stop-loss orders slightly below it to safeguard against potential declines. These strategies align with a cautiously optimistic outlook, balancing risk with the potential for profitable upward movements.\n\nOn the daily chart, the price movement of Ethereum is confined within a wider range between 2,801 and 3,730 dollars, which marks critical levels of support and resistance. An effective long-term trading strategy could involve entering near the support of 2,801 dollars, especially if a definitive bullish reversal occurs.\n\nOn the contrary, it might be wise to set the exits near the $3,730 resistance, as this level has historically represented a significant challenge for price progression upwards, making it a strategic point to secure gains before potential pullbacks.\n\nAnalysis of oscillators and moving averages and the bullish and bearish verdicts\n\nThe price movement panorama of Ethereum is further complicated by conflicting signals from technical indicators such as the Moving Average Convergence Divergence (MACD) and momentum oscillators. The MACD presents a bearish outlook, suggesting caution, while current momentum indicators appear more bullish.\n\nThis dichotomy requires a balanced trading approach, incorporating signals from both bearish and bullish perspectives on different timeframes to develop a nuanced and effective trading plan.\n\nBullish perspective:\n\nThe market positioning of Ethereum, particularly evident from the sustained lows on the 4-hour chart and positive momentum signals, indicates a bullish future. Traders should consider the opportunity to enter long positions near key support levels, taking advantage of the overall upward trajectory.\n\nThe resistance shown at these support points, combined with potential bullish reversals on the daily chart, supports a favorable outlook for the advancement of the Ethereum price in the short term.\n\nBearish considerations:\n\nDespite the optimistic indications on shorter timeframes, bearish signals such as those from the MACD and longer-term moving averages suggest caution. The resistance level of $3,730 remains a formidable barrier that has repeatedly hindered upward movements.\n\nTraders should beware of a potential drop from this high, which could lead to profitable short positions if Ethereum fails to overcome this critical resistance, indicating a possible price retreat.\n\nIn conclusion, while Ethereum shows potential for both gains and losses, the key to successful trading lies in a balanced and informed approach that takes into account the complex interaction of various technical indicators and market sentiments."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPTDA4WVZwbGt0QzJoX1hoMl9DU2NoOUNwOHM1dHlmTHhOXzd0ekwwVFQ3b1d0SGc2T2ZlSVV4TGdtTm5YUlVmbGNQQUxmLWNDX1k5RUxkWU5vRkRhbVdRZ3NXam5TTUpmQUN0SWtEVGNydWU2bUVNTVk1eEZFWHd4MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: 2 Reasons Why ETH Price is Rising ? - CoinGape",
        "content": "The long anticipated Bitcoin halving is finally completed, after Ethereum (ETH) saw slow growth amid the recent market crash. This was partly fueled by the fading expectation of SEC approving Ethereum ETFs in may. ETH experienced losses by 15% slightly over a week ago, losing ground to Bitcoin. Although there was no immediate reaction to the halving event by top cryptocurrencies including Bitcoin itself, Ethereum (ETH) has since seen an uptick of approximately 0.8% in its market value. As investors and enthusiasts closely monitor the next move of Bitcoin and altcoins, let’s unravel why Ethereum price is rising.\n\nCurrent Market Performance of Ethereum Price\n\nadvertisement\n\nOver the past day, the price of Ethereum has risen by 1.39% to $3,214.11. This increase maintains a favorable pattern for the week, increasing by 2.16%, but exhibits an 8.40% drop over the month. This shows potential volatility and market correction in the long-term\n\nEthereum holds the second position in market capitalization, according to CoinMarketCap, amounting to $385.8 billion. The token has experienced a slight increase of approximately 1.8% in its trading activity, by recording a trading volume of $10.16 billion over the past 24 hours.\n\nETH has been trading between a low of $3,119.55 to a high of $3,210.30, indicating moderate volatility within the day. However, when compared to its all-time high of $4,891.70 it achieved on November 16, 2021, the token has recorded losses of 34.69%, indicating a notable pullback from its highest point.\n\nWhale Activity\n\nThe recent surge in Ethereum’s price is underscored by significant on-chain transactions, particularly one involving a substantial withdrawal of 10,119 ETH from Binance, indicative of a notable Ethereum whale activity. According to Lookonchain investor has been progressively accumulating Ethereum, amassing a total of 127,388 ETH since April 8, totaling around $405.19 million.\n\nNotably, the average purchase price of this whale, standing at $3,172 per ETH, signals a bullish long-term outlook on Ethereum’s potential within the market.\n\nAdding to the rumors is the participation of Justin Sun, the creator of Tron (TRX), a well-known figure in the crypto world recognized for his financial ventures and public remarks. Claims imply that Sun has been buying Ethereum, with evidence suggesting that a wallet reportedly linked to him has been accumulating a substantial quantity of ETH since the start of April.\n\nThis wallet’s activity aligns with a pattern observed from March 31, wherein large sums of stablecoins were moved from Binance to Ethereum, followed by substantial purchases of ETH from both Binance and decentralized exchanges (DEXs).\n\nThe similarities in transaction behavior between this wallet and another previously linked to Justin Sun, which acquired Ethereum in February, further bolster the speculation that Sun may indeed be behind these transactions.\n\nIn total, the suspected wallets attributed to Sun have reportedly acquired 295,757 ETH, valued at approximately $891 million, since February 12, at an average price of $3,014 per ETH.\n\nThese transactions, coupled with the ongoing interest and investments from notable figures like Justin Sun, contribute to the upward pressure on Ethereum’s price.\n\nCurrently, Ethereum is still being traded at $3,206.30, indicating the current market trends and investor feelings towards the digital currency. The participation of powerful people like Sun illustrates the changing interactions within the Ethereum community, emphasizing its importance and possibility for more expansion.\n\nStrong Support Levels and Bullish Technical Patterns\n\nVarious crucial factors can be credited for the recent increase in Ethereum’s price. During the pre-halving consolidation phase in the wider cryptocurrency market, Ethereum successfully held its position above the important $2,875 level. This level aligned with the 38.2% Fibonacci retracement level, giving buyers a strong base to take charge of the market direction.\n\nFurthermore, the strong pullback seen in Bitcoin’s halving phase helped boost Ethereum’s price, driving it to peak at $3,198. Upon further analysis of the 4-hour chart, it is evident that a double bottom pattern has emerged, which is a common technical formation seen at the end of a downtrend, indicating the possibility of a substantial increase in price. This trend, along with the strong market momentum, boosted buyers’ confidence.\n\nWith Ethereum’s price showing positive momentum, there is hope it will exceed the key resistance level of $3,300, boosting buyer confidence and possibly extending the recovery process. If this breakout occurs, Ethereum may reach higher price levels, with forecasts suggesting a potential rise to $3,730, then $4,100.\n\nConclusion\n\nAs Ethereum continues to defy market pressures, its resilience above key support levels and the formation of bullish technical patterns signal a potential uptrend. With buyers eyeing critical resistance levels, the stage is set for further price appreciation in the near term."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOZHE5Ym9GeG5KYmtHQXBVT2pPQzk5NE1vQzhpQjdPQl9oVXNRVlVZUTBBTWlyTEU4cklaa0tCX3ZSQm1xZVVXS003NFZENjU1ZjkyTTdQdTNOR2xBaHVCMThuanpMM21CdThyYmJzaWZ2X2ZiOWNXaldxMnRWb3V3TTA2WXpJUdIBiwFBVV95cUxOd0p2eFhacktSUzNGdzNydmRqZlJoQlFqaDhmWHk1UXZhb1JFX1p3TVlnMkVMVlRPcW1yVTd5NjlieFc3TzhVc0JObHNYaUg0aWdEMUIxejBzVWpTZm10V0hieVh3MHdzSDZNNWNIUkpoQVpfTHcyZ1RkcHRtYk1GczV4OG5nRXFzanNJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price in Q2: 4 Reasons for FOMO and 4 for FUD - CryptoPotato",
        "content": "As the classic weather forecast goes in the Northern Hemisphere, April showers bring May flowers. Will it hold up for crypto exchange markets in Q2 of 2024 after a sharp correction this April?\n\nAnd if the market does recover in May, whose flowers will bloom brightest?\n\nBitcoin price‘s four-year bull run seems imminent, but will Binance, Solana, Cardano, or Aptos lead DeFi gains in the second quarter, or will the king smart contract coin, ETH, fly furthest up the chart?\n\nEthereum prices are up by almost 100% for the trailing 12-month period. Ether is down over 4% from 30 days ago. Meanwhile, ETH prices are up more than 7% over the five days ending Monday.\n\nHere are four reasons in Q2 of 2024 to jump on the fear of missing out (FOMO) bandwagon for Ethereum and four reasons to bail out in fear, uncertainty, and doubt (FUD).\n\nFOMO:\n\nHere’s what Ethereum has going for it after the Bitcoin halving at block height 840,000.\n\n1. Ethereum Price $4,000 Is New Goal\n\nEthereum crushed $3,000 in February, then notched $4,000 on crypto exchanges in March for the first time in 2 years. After a substantial retreat, the asset indecisively tested $3,200 on Monday. If bulls defeat resistance at this level, the next key resistance will be near $3,700 where the market previously peaked throughout the month of April.\n\nThe world’s second-largest cryptocurrency by market cap hit its historic all-time high of $4,808.74 on Friday, Nov. 12, 2021. After blowing past $3,000 last quarter, Ethereum bulls are focused on $4,000 next and potentially $4,800 sometime in 2024.\n\nAs markets closed out Q1, a post on the 2.3 million strong EthTrader subreddit predicted: “ETH has plenty of growth potential and will eventually return to $4k, likely bypassing its ATH as well.” Furthermore, a recent report by USA Today notes: “Artificial intelligence-based websites, crypto traders, and industry analysts have 2025 ethereum price targets ranging from around $6,000 to above $21,000. Industry insiders project the crypto will reach nearly $7,500 by 2025.”\n\n2. Shiba Inu Is Becoming An L2\n\nOne way cryptocurrency investors evaluate the health of a Layer-1 blockchain is by gathering and analyzing metrics of activity and success among its most popular Layer-2 decentralized applications (DApps).\n\nA robust ecosystem with an active user base, high transaction volumes, and sustained growth trends tends to be a safer investment that delivers better returns. As a leading indicator of Ethereum prices in Q2, the success of the meme coin Shiba Inu – an ERC20 token – is a promising look at ETH’s future.\n\nInitially, Shiba Inu started as a joke cryptocurrency like Dogecoin in Aug. 2020. But unlike DOGE, a proof-of-work (mineable) Layer-1 cryptocurrency, SHIB has become a full-fledged Layer-2 Ethereum-scaling ecosystem, with decentralized apps powered by final settlement on the latter’s base chain.\n\nAn important Shiba Inu metric exploded by 1,000% in April, and a major SHIB developer made an important announcement earlier in the month. As a result, many cryptocurrency investors are terrified of missing out on Ethereum gains in 2024.\n\n3. L2 – Polygon, Arbitrum, and Optimism Scaling\n\nIn addition to Shiba Inu, Ethereum’s other Layer-2 scaling chains, like Polygon (MATIC), Arbitrum (ARB), and Optimism (OPT), are showing massive signs of strength in Q2. Perusing their X.com timelines, Monday reveals a flurry of new activity and development on these L2s, a bullish sign for Ethereum prices.\n\nGames are leaving Polygon? Check again. Gaming on Polygon amassed 700k+ Unique users in the past 7 days and 1.3m+ Unique users in 30 days. Total users have grown by 1113% and txns by 1290% over the past 7 days. GameOn 2.0 will take it to the next level ($30k rewards 😮) 1/🧵 pic.twitter.com/3xH6M1YYAW — sanjay.moca (@FlyeKitesJay) April 19, 2024\n\nPolygon Labs recently retweeted a post by a gaming content creator that reported, “Games are leaving Polygon? Check again. Gaming on Polygon amassed 700k+ Unique users in the past 7 days and 1.3m+ Unique users in 30 days. Total users have grown by 1113% and txns by 1290% over the past 7 days.”\n\nMeanwhile, Arbitrum announced, “Fraud Proofs took us to a Stage 1 rollup. Today, with BOLD, we’re on our way to becoming a Stage 2 rollup! BOLD, permissionless validation on Arbitrum, is now live on testnet!”\n\nOn Monday, OP Labs posted, “Yes, interoperability between Superchain L2s. Optimistically coming soon,” in response to the news that developers behind the Celo blockchain have selected Optimism to build Celo’s Layer-2 on Ethereum. Moreover, AltLayer announced on Monday the launch of a new Layer-3 powered by Arbitrum and Eigenlayer.\n\nAltLayer has deployed the testnet for @DODO_Chain, an Omni-trading Layer 3 powered by @eigenlayer & @arbitrum. From Multichain to Omnichain, enjoy a seamless new era of trading with DODOChain’s interconnected liquidity layer! https://t.co/XaKpPJiPB1 — AltLayer (@alt_layer) April 22, 2024\n\n4. Ether TVS On Sharp Uptrend\n\nTotal value locked (TVL) or “total value staked” is the measure of the amount and market value of the tokens locked or staked at any given time for a proof-of-stake cryptocurrency.\n\nBitcoin found a way to prevent double-spending and solve the Byzantine General’s Problem for a decentralized network by using electricity-intensive proof-of-work hash problems and a blockchain of validated hashes.\n\nSmart contract cryptocurrencies solve the same problem by allowing users to stake tokens to participate as a node. The higher the TVL, the better it is for the token’s market value with all other things being equal.\n\nEthereum price may be worth FOMO’ing over based on its TVL metrics. With a week left to go in April, Ethereum TVL is above $53 billion. Meanwhile, its nearest competitor, Tron (TRON), has $8.6 billion in TVL, according to CoinGecko data. Cryptoquant data show a very steady uptrend in Ethereum TVL from April 2021 through March this year.\n\n$29B of that TVL is staked with Liquid Staking using Lido, $14B is re-staked with EigenLayer, and $9B is staked through lending platform AAVE, according to the latest data from DefiLlama.\n\nFUD:\n\nHere are some headwinds working against Ethereum prices in Q2 2024.\n\n5. Prediction: Ethereum ETF Delay At SEC\n\nMany investors are feeling FOMO over the Ethereum price in Q2, but the outlook for the asset is not all rosy. One ongoing threat to Ethereum prices is the U.S. Securities and Exchange Commission (SEC).\n\nThe danger the SEC poses to Ether prices is twofold: 1.) The commission continues to angle to get ETH tokens classified as securities. 2.) In addition, the regulator may delay approving an Ethereum ETF for Wall Street investors.\n\nThat’s a big deal because VanEck thinks Ethereum ETFs could outpace Bitcoin funds once approved. Bitcoin ETF issuers like Fidelity and VanEck have been waiting for an Ether ETF approval but say the SEC will not greenlight one by a late May deadline.\n\n6. SEC Investigating Ethereum As Security\n\nMeanwhile, the SEC is “waging an energetic legal campaign to classify Ethereum, the second-most popular cryptocurrency, as a security,” according to a Mar. 20 report in Fortune Crypto.\n\nThe commission has issued subpoenas to a number of companies to probe their dealings with the Ethereum Foundation, kicking up speculation that the SEC will sue to get ETH tokens labeled a security.\n\nDevelopments related to this possibility represent an ongoing risk to long positions in Ethereum and a headwind for the asset’s prices. Should the SEC ultimately succeed in its campaign, Ether will likely have to overcome serious FUD.\n\n7. Competition From Bitcoin and Other PoW Chains\n\nDeFi is one of the fastest-growing industry sectors in the world by far in 2024, but competition from proof-of-work blockchains like Bitcoin, Dogecoin, Bitcoin Cash (BCH), Litecoin (LTC), Ethereum Classic (ETC), and Stacks (STX) is another reason to be uncertain about investing in Ethereum.\n\nSmart contract meme coins like Bonk Inu, Shiba Inu, Pepe, Floki Inu, and dogwifhat led cryptocurrency gains for the year in 2023. They may do so again in 2024, leading to new peaks.\n\nBut with the Bitcoin halving in the rearview mirror, the focus in 2024 could shift to supply and scarcity, with the benefit going to deflationary, PoW blockchains.\n\n8. Competition From Solana, Cardano, and Avalanche\n\nOf course, there’s also competition from other DeFi blockchains like Solana, Cardano, and Avalanche for Ethereum investors to FUD over. Coin Bureau altcoin analyst Guy Turner recently told his two million YouTube subscribers that he expects a 100% rally soon to $300 for Solana.\n\nMeanwhile, there may be a mega-move ahead in the cards for Cardano (ADA) based on the technical signals on the crypto’s chart. Last month, Avalanche (AVAX) achieved $329 million in daily transaction volume, levels the market hasn’t seen since May 2022."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQdXlDRGx1Z21uMEZzMVBTM0hlREZkR3h5N3JScHNQdU9JT293SEsxTzlOTVVPd2RnLVhEZ25ZcmJweUlvNmRaQXF3VkQtUTNocDdsSU5EV24zaFBFZDZBVjIxYzJCWDdsUVp6Q01ReDk2TF96NTJDS2VpWDFxd2FMVGR0d9IBiAFBVV95cUxQeFc2SVpDcEFJSElXb3dKMk44UHpLVGNjVDNneWU5Y1pCUkxJNjlka3Y1UEhGeFFJTW9zZVJTSlRHckY1alBZVVR2T01NaDl4MTZRY2hVVGZuak5BdUFzVVY0SDRDVGhZYnY1X3M5SHdTcUF3R1NJTUgwM3oxUC1qZGduY0RBSEc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "All about the state of Ethereum after Bitcoin’s halving - AMBCrypto News",
        "content": "Ethereum sees more outflow but fewer new stakes.\n\nETH continued its recovery post-BTC halving.\n\nAs the Bitcoin [BTC] halving approached, altcoins experienced a price decline. Analysis indicated that Ethereum was among the assets that witnessed substantial recovery following the halving.\n\nHowever, the recovery of ETH staking remained elusive.\n\nEthereum daily staking drops\n\nAMBCrypto’s examination of Ethereum’s staking chart showed a significant downturn in the volume of new stakes over the past few days.\n\nThe chart indicated that at the beginning of the previous week, there was an uptick in the volume of staked ETH, peaking at over 115,000 by the 15th of April. However, this volume began to decline.\n\nAt the time of this writing, the volume of new stakes was 31,441, marking a decline of over 80,000.\n\nThough not the lowest daily figure recorded for ETH, if this decline persists, it could set a new record low. Additionally, the total ETH staked surpassed 43.9 million at press time.\n\nDespite an overall increase, a detailed analysis of the chart suggests that the progression has been nearly stagnant, indicating a lack of significant influx in recent times.\n\nOutflows dominate the Ethereum flow trend\n\nExcept for the 20th of April, Ethereum has witnessed more outflows than inflows in recent days.\n\nAMBCrypto’s analysis of the Netflow chart on Glassnode revealed that by the end of the date, ETH experienced an inflow of over 20,000, significantly lower than the volume of outflow.\n\nOn the 18th of April, ETH encountered an outflow exceeding 144,800, marking one of the largest outflows recently.\n\nAt the time of writing, over 14,000 outflows had been recorded, indicating a trend where more ETH is leaving exchanges.\n\nBased on the trajectory of the staking chart, it’s evident that most of the withdrawn ETH is not being staked. This presented a positive indicator for the asset, suggesting that holders anticipated a price increase.\n\nThis sentiment was particularly strong given the recent Bitcoin halving, fostering beliefs that a rally may commence.\n\nETH remains in bear trend\n\nAMBCrypto’s look at Ethereum on the daily timeframe revealed a positive conclusion to the week. ETH experienced a more than 3% increase, reaching approximately $3,157 by week’s end.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIt commenced the week near $3,158 but faced several days of declines after that. At the time of this writing, it was trading at around $3,177, with a rise of less than 1%.\n\nIts Relative Strength Index (RSI) indicated that it dipped below the neutral line on the 11th of April. At the time of this writing, it remained below this line, though there was a noticeable improvement."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNc3FUVGl0XzAwLTR3TzVGLW5COFpFRUt5S1dhSXpXN3ZrZk5JQi1qZjVOS19hblBrZ3hhZnIxTDNJa2xfWE1xQlZUOE1hM21SUlIzN3E2YVNBMzg1Z2ZCMWlGSWtDeWJCWU9LVzZ6OWdkSHZfTEMzQUVKVTF2ZXMxZDZ1RDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Furrever Token Presale ROI Soars, Catching Attention of Bitcoin (BTC) and Ethereum (ETH) Enthusiasts - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 22, 2024 (GLOBE NEWSWIRE) -- As Bitcoin (BTC) and Ethereum (ETH) continue to ride the wave of excitement surrounding their recent halving events, cryptocurrency enthusiasts are eagerly anticipating whether Furrever Token ( FURR ) will seize the momentum and catch the presale hype train. With BTC and ETH experiencing slight climbs post-halving, investors are speculating whether FURR, with its unique approach to infusing cuteness into the crypto space, will capitalize on the current market sentiment to propel its presale to new heights. Join us as we delve into the intersection of traditional cryptocurrencies and the whimsical world of Furrever Token.\n\nBitcoin (BTC) Halving Day and ETF Inflows Surge on 4/20 Caused a Slight Climb\n\nBitcoin (BTC) is currently trading around $65,177.84, marking a 2.5% increase since the halving event that took place yesterday. The timing of this halving has sparked curiosity, as it coincided with the infamous \"4/20\" meme date, leading to a curious alignment observed by Eric Balchunas, an ETF analyst at Bloomberg Intelligence.\n\nDespite a slowdown in inflows for Bitcoin ETFs since their peak in March, BlackRock’s iShares Bitcoin Trust (IBIT) continues to attract consistent inflows, with 69 consecutive days of positive inflows. Other ETFs, including those operated by Fidelity Investments, also saw significant inflows on April 19, signaling a potential return of momentum.\n\nWhile outflows from the Grayscale Bitcoin Trust (GBTC) were modest on the day, recent Form 13F filings have raised concerns about the penetration of Bitcoin ETFs into the mainstream investment landscape. However, Balchunas remains optimistic, likening the asset managers' approach to Bitcoin ETFs to \"hot sauce,\" suggesting that while the number of holders may be relatively small, there is significant potential for growth and adoption.\n\nOverall, the surge in ETF inflows on 4/20 raises questions about the future trajectory of Bitcoin's price and the broader adoption of cryptocurrency ETFs in traditional investment portfolios.\n\nEthereum (ETH) Surges 4% Post-BTC Halving: Whales Return as Investors Seek Alternatives\n\nEthereum (ETH) has surged by 4% to reach approximately $3,163.71 following Bitcoin's halving event and the ensuing market hype. This uptrend in Ethereum's price mirrors the overall positive sentiment across the cryptocurrency market, with total market capitalization rising by 3.5% in tandem. Notably, the gains in Ether versus the U.S. dollar are largely attributed to capital inflows from the Bitcoin market, driving the ETH/BTC pair up by roughly 2.5% to 0.048 BTC on April 21. This ETH/BTC ratio surge, along with the Ethereum Dominance Index (ETH.D) growth of over 1%, reflects a pattern observed after previous Bitcoin halving events. Historically, Ethereum has seen increased capital inflows from Bitcoin investors seeking new growth opportunities post-halving. Furthermore, Ethereum's latest gains coincide with a period of accumulation among its wealthiest investors, as highlighted by the increase in Ether supply held by addresses with significant balances. Technical indicators also suggest strong support for Ether's price, with key support levels aligning closely with Fibonacci retracement lines and moving averages, indicating an attractive entry point for traders.\n\n\n\n\n\nFurrever Token (FURR) Rides the Crypto Resurgence: Presale Momentum and Up to 15X Returns Propel its Charm\n\nIn the midst of the crypto market's resurgence following Bitcoin's halving and Ethereum's notable surge, Furrever Token ( FURR ) emerges as an intriguing contender poised to capitalize on the renewed enthusiasm. Priced at an enticing $0.000564, FURR offers investors an opportunity to partake in a project that transcends the traditional boundaries of cryptocurrency, infusing the space with an irresistible dose of cuteness and charm.\n\nAs FURR continues its journey, it is currently in the midst of its presale phase, which has already garnered significant attention and support from investors. With over $1,000,000 raised thus far and nearing the completion of stage 7 out of 10, FURR demonstrates strong momentum and investor confidence. The presale, with its ambitious target of raising $1.9 million, presents an opportunity for investors to participate in the project's growth at an early stage, potentially reaping substantial rewards in return.\n\nOne of the most compelling aspects of FURR's presale is its offer of up to 15X returns, a tantalizing prospect for investors seeking high-growth opportunities in the crypto market. This generous return potential underscores FURR's commitment to delivering value to its early supporters and incentivizing participation in its presale. Moreover, the absence of buy and sell taxes when trading FURR further enhances its attractiveness to investors, offering a streamlined and cost-effective investment experience.\n\nWith its unique blend of cute cat-themed imagery, engaging community initiatives, and robust tokenomics, Furrever Token (FURR) stands at the forefront of innovation in the crypto space. As it rides the wave of excitement generated by Bitcoin's halving and Ethereum's rise, FURR has the potential to further increase its momentum and solidify its position as a leading project in the crypto landscape. By leveraging its current market momentum, FURR can continue to attract investors, drive community engagement, and deliver on its promise of revolutionizing the crypto space with cuteness and charm.\n\n\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQTkc1NmJBM1IxMDZLVW1KSzlrNWhqUkE3YjQ4Zlpqc25aRWNjZEdwMkJidXVNdVRCajNxNkR1T2ViYkl6bUxRNllzZWdEOTFDcHozWWJ5STgwcEp5TE4tM2wxTFZhbDNEZk1MaTJRZS1JcVdJVE92eHdFb1Rvc0QtNFJCTERFME1kbC1kbVdGVGZzUDdOTkhwTmN5MWlDYTJTWU92bTYwNzFlWG96ZVBLNzFjb1QtelBFWktOY09lZ0xXQdIBxwFBVV95cUxNaDM0ZmlvUGR1WVBIQWJHNHpOUk1wYTAwN2ZWN0kyMnFENWhzX0JkZmd4TE5WdC1Mb1pHYXdlVHFWcEJ3MDYwWGZ0U1dJZElVbmRsbE9DaHJsbjdPOHp4dVAycXVuRkZ2emVwNXJKaDJ6cVhzMVFMTTA0aU1Yb2R0S3lwNzhJTXpLUGRqYmp4VFJiMk1YZ0xyemV1dTY1Q19GZWtOcmhRanp2cDZPdkJwalJrb3VaSzNPN0NNdUcxSmUtQmlDNVFj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "‘This Time for Real’ – Trader Predicts Ethereum Rally, Updates Forecast on Two Low-Cap Altcoins - The Daily Hodl",
        "content": "A closely followed crypto trader says Ethereum (ETH) is gearing up for a rally, and that he’s bullish on two other altcoin projects.\n\nPseudonymous analyst Inmortal tells his 212,000 followers on the social media platform X that ETH is setting up for its “real” rally after bouncing off support near $2,900.\n\n“This time for real.\n\nETH.”\n\nLooking at the trader’s chart, he seems to predict that Ethereum is almost ready to rally toward his target at around $3,600.\n\nAt time of writing, Ethereum is trading at $3,226.\n\nThe analyst is also bullish on Seedify.Fund (SFUND), an incubator and launchpad specializing in blockchain gaming.\n\n“Wow.\n\n> Double bottom\n\n> -50% dip into support\n\nLast time we dipped into this zone price bounced +100%\n\nSFUND.”\n\nInmortal also says once SFUND breaches the $3 level, that’s when the “magic” will happen. At time of writing, SFUND is trading for $3.12 at a $197.841 million market cap.\n\nThe trader also has his radar locked on Radix (XRD), a decentralized finance (DeFi) focused layer-1 blockchain project.\n\nAccording to Inmortal, XRD has gone through more than 500 days of accumulation, implying that a breakout of the range to the upside is overdue.\n\nSays the trader,\n\n“Retesting a +500 days accumulation\n\nJust bought some.”\n\nAt time of writing, XRD is worth $0.055, still more than 91% down from its all-time high of $0.6513.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPV1ViQ1FXbE9ocXY0T2FSSXRtSEYtUVZEb1NiUk5UQUQ5NmlwSHF4Mk9objNDTFluUWJDdjgtOFpqNEpGWTBQQzFFRFg5dE9HczZlNERCSEdrR3hqLWgtMjlGTWs3cVBJQmVjM2NxQWk5RzFZRWRPWm5kOS1uY3FQeUFXMklQY1pQdGtCWdIBlAFBVV95cUxNU1FrbUl4Wk1SMWdWVUdkREY5cjl0ZXo3NU5lVnZ6VHZGeWJEQnNWZFdqaXN5V2o0VFhqT01xaTMxNkdNcFliczVlM2NVTm1YNUp0TDNZNG1pZWJWM0Z2VXM3UTlFM1hubDY4ZF9JWTAyWFYzbzV5TFhPLTFzZFVvQUFZb1JUM2Y4allKdFRnZ09rRXR4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Meme Coin Pepe Surges 16% on Coinbase Perpetual Futures Listing - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe cryptocurrency market is starting the week on a relatively calm note following the buzz around the Bitcoin halving, with the global crypto market cap sitting at $2.56 trillion, a 2.7% change in the last 24 hours according to data from CoinGecko.\n\nBitcoin and Ethereum are both up less than 3% today, and the trend is pretty similar among the biggest tokens in the crypto industry. However, the Ethereum-based PEPE, one of the most popular meme coins of 2024, is defying market trends and is one of the best performers in the top 100 coins by market cap today.\n\nIn the last 24 hours, the price of PEPE went from $0.00000572 to its current price of $0.00000666 for a 16% spike, and a sizable 30% jump in the last seven days. Although it's down nearly 13% in the last 30 days after suffering a major correction, the token's technical indicators suggest that it's recovering and could be bouncing back to a bullish trend.\n\nThe price surge comes after Coinbase International, the global branch of the largest U.S. crypto exchange, announced the listing of PEPE perpetual contracts. This move is significant as it adds liquidity and increases the asset's exposure.\n\nAD\n\nAD\n\n@CoinbaseIntExch will add support for Pepe perpetual futures on Coinbase International Exchange and Coinbase Advanced. The opening of our 1000PEPE-PERP market will begin on or after 9:30am UTC on 23 APR 2024. — Coinbase International Exchange 🛡️ (@CoinbaseIntExch) April 22, 2024\n\nThe opening of Coinbase's 1000PEPE-PERP market was originally planned for April 18, but was delayed for technical reasons. Trading will now begin on Tuesday, April 23.\n\nAnd of course, such an event was met with enthusiasm—and memes—all over Crypto Twitter. Coinbase also announced perpetual futures around Dogwifhat (WIF), a leading Solana meme coin, with trading set to begin on April 25.\n\nIn addition to the Coinbase announcement, PEPE's technical indicators suggest a positive trend. The coin's price trend has finally broken past the EMA55 mark (the average price of the last 55 days), indicating a potential recovery from the previous crash and a possible return to bullish behavior.\n\nAD\n\nAD\n\nThe EMA10 (the average price of the last 10 days) is also on target to surpass the EMA55 mark. This event, known as a golden cross, is usually a confirmation of a bullish phase in which prices tend to go up faster with time.\n\nImage: Tradingview\n\nThe Relative Strength Index (RSI) is currently at 51, suggesting a balanced market with neither bears nor bulls dominating (more accurately, 51% buyers and 49% sellers). The Average Directional Index (ADX) at 20 is also weak, showing that the power of the bearish correction is starting to diminish. The Squeeze Momentum Indicator, which is used to determine which phase the markets are in, suggests that the bearish trend has lost force and the price is compressing in preparation for a bullish impulse.\n\nIn an optimistic scenario, PEPE could continue its bullish momentum and meet a first resistance at around $0.00000754 (for a 14.5% growth) or $0.00000882 (for a 33.6% growth, green line). However, in a pessimistic scenario, PEPE could fail to maintain momentum and test again the support of the last week at around $0.00000468 (for a -29% dip, red line).\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOa0NjRWhSQVhWdlZVaWJ0bGZtRng1dnBBTlNxRXpSb2RuSGE5UE5zcnN0bVJGeHh3bjV1dElWNE44NlVEb3FkN1NLeW1fa1k3dXJrb3lQUU5lWWJBbFJPWGE5d2JxaFlUS1hLWjBKUWJhTGNDVDZlNkpXMk04UUtuckJ4SEg2WkFxMHdrcWhua245STJrdXZSQ0xOZFlIZVF5Ujg00gGoAUFVX3lxTE1YbzdOMnV4WGlObFJyc2s1bXppZF9jT2JjVzlCOGtyS0dWcFFsTmxoU1RCY2xKT1doOFF4aXo5SnVaRklZemdRUUpKSTBiV2NsX08weHZOaHlmdDN0eW1WdDdmaVRLYVVVZFYwbVpiMDJ5Uzh5YXV6enBpS3Uxc3A0dmdkQmcyU1lLV0M1VHhtelRGT3BNdm40bFZKYW90SURPd2Rub0dfNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Over $500M Ethereum (ETH) Left CEXs as Market Prepares for Impulsive Move: Data - CryptoPotato",
        "content": "Data from IntoTheBlock revealed that investors withdrew approximately half a billion ETH from centralized exchanges last week, the highest the asset has seen since February.\n\n$500M ETH Leaves CEXs\n\nThe withdrawal of large amounts of ETH from centralized exchanges signals investor confidence in the long-term price trajectory of the asset. Market participants usually withdraw their cryptocurrencies from centralized trading platforms to hold the assets in their private wallets or cold storage in anticipation of higher prices.\n\nSuch large withdrawals have been considered an indicator of bullish sentiment and holding attitude among investors. Most of the time, ETH has recorded substantial gains in the weeks following large withdrawals from exchanges.\n\nAnticipation for higher ETH prices could be attributed to the approval of spot Ethereum exchange-traded funds (ETFs) in Hong Kong and the just-completed Bitcoin halving event, which has historically triggered bull rallies across the market.\n\nWith huge amounts of ETH leaving exchanges, supply could decline on such trading platforms and high demand from large entities like the spot ETF issuers could propel the digital asset’s price upwards, per the laws of economics.\n\nFutures Market Poised for Impulsive Move\n\nWhile investors reduce their ETH holdings on centralized exchanges, the Ethereum Futures market shows that it is on the brink of a resurgence of long or short positions. A CryptoQuant Quicktake by pseudonymous analyst Shayan disclosed that the Ethereum market may be on the verge of a fresh and impulsive move either northwards or southwards.\n\nShayan explained that futures market sentiment significantly impacts price movements because the intensity of long and short positions, as well as the possibility of large liquidations, acts as a catalyst for volatility. This sentiment can be determined by the state of open interest, which indicates the number of open perpetual futures contracts across several cryptocurrency exchanges.\n\nNotably, open interest in Ethereum declined during ether’s recent plunge to $2,900 amid escalated tensions in the Middle East. The fall suggested a pipedown of activities in the futures market.\n\n“Consequently, the market appears poised for the resurgence of either long or short positions, potentially initiating a fresh and decisive market movement in either direction,” Shayan said."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOYmlSeERwckF0ZWN6bW83Zm42N2FhempNQnlrcUMtOTEtcVZCVXpmbGU0NU01QXhQZ0pzbnVPTlFsNlBiZGNlUS16OXRXWWx3U01JWURDVy1ZdklRaC1BWjBqY2puSnhDdHNqZFRwSzBYU0p4ZDB1d3R1ZjdCZU5fbVphSDNVN0dqQjRZMFVkMENoSkRZU3dSNDN6SC05TEVwYjlaUlZBNNIBrAFBVV95cUxQVEdxRjhqdm1obUpnTkpZZjBIeGVraXBfNkY1YmV1TzhSRXNLaXBDSUl3b3VlUFppd2dkT0pudGtfeFJ0VU9iZWNCbm9xUkhYSEctWUEzeFVVd3cxZlJpNlNCNUJUWm82TW1Fekk0U1RDWGZCRHNkSkVCYmZYaDlUXzRBbDMtdEQxa21hbmV5djBvMUZuQUVvbUZKNlVtaWVNVV9yckVGZ3FsVGpV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ether Coil as Crypto Traders in Limbo After Halving - CoinDesk",
        "content": "Liquidation data from CoinGlass shows that in the last 12 hours, $52.46 million in positions have been liquidated. Ether and BTC positions are the largest, respectively, but there's also $6.86 million in HBAR liquidations – owing to the token's recent surge in volume crossing the $1 billion mark – as well as $1.83 million in PEPE liquidations."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQTW5RNlQxakVLRWxKSzMxeFJNQ2tJamNJM3RkVVRSV3NERDNRSlgyZmpDMEVQUFFzcWhPbWtqbzh0N1cySlA3S0cwVUczYUwyRC1wUGVsVmVDSkYxSUtFZlhCODBTZkpSMmtQNm5ZMEkyYjRmQ1E1MHJyQ1VuMGRFbUdYelpfdmFCc2Q4NWt4NGZ4SkZEZ0JMNzZpSXN0bHVIdHRBaU9ZV1J3Rkd4M19WRDVBam0tajVlbmFxckY0Wk5jb0N2YWNfZ19ERGdDWmdueWg3djRia0ZpU0tkc2tiT1NyejVwSXRiY2h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Grayscale Investments® Files S-3 Registration Statement for Grayscale Ethereum Trust - GlobeNewswire",
        "content": "STAMFORD, Conn., April 23, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager, today announced it filed a registration statement on Form S-3 (the “Form S-3”) with the U.S. Securities and Exchange Commission (“SEC”) to register shares of Grayscale Ethereum Trust (OTCQX: ETHE) under the Securities Act of 1933, as amended (the \"Securities Act\").\n\n\n\nFollowing NYSE Arca's filing of Form 19b-4 for Grayscale Ethereum Trust, Grayscale filed the Form S-3, another key filing requiring regulatory approval in the firm’s effort to uplist ETHE to NYSE Arca as a spot Ethereum ETF*. Grayscale Ethereum Trust intends to list the shares on NYSE Arca under the ticker ETHE, and issue shares on an ongoing basis upon approval of NYSE Arca’s application on Form 19b-4 to list the shares and effectiveness of the Form S-3 to register the shares.\n\nThe offering will be made only by means of a prospectus. A copy of the prospectus, when available, may be obtained by email from Grayscale Investments by emailing info@grayscale.com .\n\nA registration statement relating to the shares has been filed with the SEC, but has not yet been declared effective. The shares may not be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy the shares, nor shall there be any sale of the shares in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\n\n*Grayscale uses the generic term “ETF” to refer to exchange-traded investment vehicles, including those that are required to register under the Investment Company Act of 1940, as amended (the “40 Act”), as well as other exchange-traded products which are not subject to the registration of the ‘40 Act. The Trust is not registered under the 1940 Act and is not subject to regulation under the 1940 Act, unlike most mutual funds or ETFs.\n\nGrayscale Investments, LLC (“Grayscale”) is the sponsor of Grayscale Ethereum Trust (the “Trust”) . Grayscale is not registered as an investment adviser under the Investment Advisers Act of 1940 and the Trust is not registered under the Investment Company Act of 1940. The Trust is subject to the rules and regulations of the Securities Act of 1933.\n\nInvesting involves risk, including possible loss of principal. An investment in the Trust is subject to a high degree of risk and heightened volatility. Digital assets are not suitable for an investor that cannot afford the loss of the entire investment.\n\nThe Trust holds Ethereum; however, an investment in the Trust is not a direct investment in Ethereum. As a non-diversified and single industry fund, the value of the shares may fluctuate more than shares invested in a broader range of industries.\n\nThere is no guarantee that a market for the shares will be available which will adversely impact the liquidity of the Trust. The value of the Trust relate directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors\n\nSmart contracts are a new technology and ongoing development may magnify initial problems, cause volatility on the networks that use smart contracts and reduce interest in them, which could have an adverse impact on the value of Ethereum.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQakhkenducVc0S0d1Wl9nc1hydHEtaU9KcVBqUGx6ZjN3d1FkUjNuV2NHai14TWtKdE5NNm8xeFhmTHRyZU0zbGoxOXFreGFicWNTM1JlZUZDT2w2bFZqUEtyd1RSaS1EMWlmbjlpN3pPeGFINTRacXQ5Y2YyYjFfbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Stabilizes at $66,000 Post-Halving, Ethereum (ETH) Climbs 1.3% to $3,200, Furrever Token (FURR) Nears $1.9M Goal in Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 23, 2024 (GLOBE NEWSWIRE) -- In a week marked by notable movements in the cryptocurrency market, three coins have captured the attention of investors and analysts alike: Bitcoin (BTC), Ethereum (ETH), and Furrever Token ( FURR ) . Each of these cryptocurrencies has demonstrated unique behavior in response to global market conditions and internal developments, from halving events to presale successes.\n\nBitcoin (BTC) Stabilizes at $66,000 Following Halving Event\n\nAfter a period marked by significant fluctuations, Bitcoin's price has found stability early this week, maintaining a position around $66,000 following its anticipated halving event. The adjustment, which occurred over the weekend, resulted in the reward for Bitcoin mining being cut from 6.25 to 3.125 Bitcoin, an essential part of the cryptocurrency's design to control inflation and reduce the rate at which new Bitcoins are introduced into circulation.\n\nThis halving, which takes place approximately every four years, is one of many steps in the long process towards the cap of 21 million Bitcoins. As of the latest event, there are projected to be 29 more such halvings before the final Bitcoin mining rewards are reduced to mere satoshis—the smallest unit of Bitcoin.\n\nLeading up to the halving, Bitcoin experienced weeks of price volatility. However, as of Monday morning, the cryptocurrency appears to be resting on a solid support level. Blockchain analytics firm IntotheBlock reports that Bitcoin is now trading just above a significant demand zone. \"With 1.66 million addresses having purchased Bitcoin at an average price of $64,800, this level may serve as strong support in the face of potential market downturns,\" stated IntotheBlock on social platform X.\n\nIn the immediate aftermath of the halving, Bitcoin transaction fees soared, reaching a record high of $127 momentarily during the weekend, as per data from Bitinfo Charts.\n\nIn related developments, other major cryptocurrencies such as Ether and Solana have also experienced modest gains, each up nearly 1% and trading at $3,100 and $152, respectively, as of Monday morning. The overall crypto market cap has seen a slight increase of 1.13%, climbing to a total of $2.41 trillion according to CoinMarketCap.\n\nThe crypto community continues to monitor these developments closely, considering the potential long-term impacts of Bitcoin's halving on the broader cryptocurrency market.\n\nEthereum (ETH) Experiences Slight Increase Following Bitcoin Halving\n\nETH has successfully regained its footing above the $3,000 mark as of Friday and continued to stabilize over the weekend. Currently, the price of Ethereum hovers just over $3,200, marking a 1.3% increase in the last 24 hours and nearly matching its price level from the same time last week, with only about a 1% difference.\n\nStory continues\n\nIn other positive developments, there is promising news for both Ethereum and Bitcoin as Hong Kong has conditionally approved spot ETFs for these cryptocurrencies. Local firms are optimistic about receiving final approvals to start issuing shares within the month. The initiation of trading is expected to alleviate some of the uncertainties surrounding cryptocurrencies in the region, potentially injecting $25 billion in new liquidity into the market\n\n\n\n\n\nFurrever Token (FURR) Captivates Investors with Successful Presale During Market Surge\n\nIn the dynamic world of cryptocurrencies, Furrever Token (FURR) stands out as a burgeoning favorite, having captured significant investor interest with its successful presale amid an overall market uptick. Furrever Token distinguishes itself by blending the allure of adorable kittens with the technological prowess of blockchain, offering a uniquely engaging and delightful user experience in a sector often dominated by more austere projects.\n\nCentral to the ethos of Furrever Token is the creation of an enchanting crypto ecosystem that prioritizes fun and camaraderie. The platform is designed to be user-friendly and community-focused, incorporating charming cat-themed graphics like stickers, emojis, and visuals. These elements not only enhance user interaction but also build a sense of community through regular social challenges and growth-oriented initiatives, making the crypto experience enjoyable for both seasoned investors and newcomers.\n\nThe financial structure—or tokenomics—of Furrever Token is strategically devised to drive participation and support the project’s expansion. With 65% of the tokens allocated for the presale phase, the project has already raised over $1 million and is rapidly approaching the completion of stage 7 out of a planned 10 stages, with a fundraising goal of $1.9 million set before its expected launch on decentralized exchange PancakeSwap.\n\nThe investment appeal of Furrever Token is bolstered by its promising financial prospects, offering potential returns of up to 15X from its current pricing at $0.000564. This potential for high returns has piqued the interest of investors looking for both profitability and an engaging community experience. To ensure trust and transparency, Furrever Token has implemented comprehensive security measures including smart contract audits, token lock-up periods, and proactive community engagement, all of which reaffirm the project’s commitment to legitimacy and investor reassurance.\n\nAs Furrever Token continues to progress and draw in new supporters, it remains a compelling project poised for further success in the expansive crypto market. Its combination of cuteness, community involvement, and potential high returns continues to attract a broad spectrum of investors globally. For those looking to join this vibrant community, FURR is available exclusively through the official website, furrevertoken.com, where transactions are secure and reliable. The road ahead looks promising for Furrever Token and its dedicated base of crypto enthusiasts.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support(at)furrevertoken.com to avoid potential scams.\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPRF83dGZDRC16MGlSWHZCUS1ydFdhVE5XbWxNZXBkblZjSTBtNlJQQm1DZEtWc0FvMHBCVTZOM0N4V1huZ0p0VFFiaG0wUzljRGdYdkQxTW9VSUJwRFlmTUNZT1dLcHlyeDNKaEY5YVNzVFV3M19UeVprZkRHMmxfcXJWYjdRb3F4LXVSQdIBkgFBVV95cUxNWUYycGlVYS1wb0FWUk5FaHZOU2lZMUF6dUg0cWVlaTR5Uy0xMUY4dEdPMXB1TER0ZTV0MEgxV05vVEduNk1xMVpIOURvTHJrZi1kc0RlYUVhQ1FMbjI0dkxqbko0Z2d4VUR2ajZVOFFFU2tldG9TTGkxQ1hMZWxpbFplVS1lblBEeGVuc04taWs2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: These 2 major factors will help shape ETH’s Q2 prices - AMBCrypto News",
        "content": "Bullish Ethereum whales got liquidated due to highly volatile price movements.\n\nHolders remained unprofitable despite rising prices.\n\nEthereum [ETH] has experienced massive volatility over the past week, causing traders to lose money left right and center.\n\nWhales see red\n\nNot only retail investors, but some whales have also been subject to liquidations over the past few days.\n\nAccording to Lookonchain’s data, a whale, despite previous losses totaling $4.5 million, doubled down on its ETH position, demonstrating confidence in the asset’s potential, and ended up losing money.\n\nThe investor also made a move involving the withdrawal of 8,249 ETH from Binance [BNB], converting it to Compound [COMP], and borrowing 17.3 million Tether [USDT] from the platform to make the sizeable bet.\n\nOther traders got liquidated as well. According to Coinglass’ data, $6.28 million worth of long Ethereum positions were liquidated within a 24-hour window.\n\nDespite these setbacks, the growing number of long positions taken towards ETH grew significantly.\n\nThis suggested a rising optimism among traders, reflecting a bullish sentiment towards Ethereum’s future prospects.\n\nImplied Volatility for ETH also surged in recent days, mirroring the heightened uncertainty and risk prevailing in the market.\n\nEven though a high IV is more bearish in nature and most traders prefer to short an asset during periods of high IV, the overall sentiment towards ETH has remained positive.\n\nLooking at the data\n\nIn the last 24 hours, ETH’s price grew by 3.78% signifying short-term bullish momentum. However, according to AMBCrypto’s analysis of Santiment’s data, the network growth around ETH declined.\n\nThis indicated that new addresses were losing interest in the ETH token.\n\nWhile Network Growth had declined, indicating a potential slowdown in new user adoption, the rise in velocity suggested increased trading activity and liquidity in the market.\n\nRead Ethereum [ETH] Price Prediction 2024-2025\n\nDespite the surge in price, the MVRV ratio for ETH remained negative at press time, signaling that Ethereum holders were yet to realize profits.\n\nThis scenario implied a continued holding pattern among Ethereum investors, potentially supporting further upward momentum for ETH’s price as holders awaited more favorable market conditions."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNcTgwZy14dXM0UDhlWTRRdWNkVGtwOGFJZjRBeUhRZjB2TDVMY3lZRFdxaG9VNFNGTDVTZmIyVDRTXzNucEhic3Z0MXZsQldNb3VGRTRkdl9NVWxvSkNBcExpRVlFMnd3MnBPRmQ0NXNTUWVLVFZrdW1pOV9UeXowOHQ3OUlxcWVKQ2w1QVB2MXUyRXY20gGaAUFVX3lxTE4wT1JrVmlTUklUVXZ1UFpqOG1MX1lOY3RuUTV5cWc4aHdjTXFvUmFScDh1d0w5WC13MWU0X0Q4dzFOemFZWjFLVGNGVmVMWW9TTWIzSmxtcTNpZlRXdndJclkyT2djWVduNGdWVW5JeWgyM09IbGtqcjQyZFgzNTgxUkoxU1JGRzhLazY4Z1diRlJkVTRSOUtFWHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum set for comeback after $3.7K rejection? Metrics suggest… - AMBCrypto News",
        "content": "Ethereum saw a huge drop in Open Interest in April following the rejection at $3.7k\n\nThe on-chain metrics were still healthy, hinting at the possibility of an uptrend\n\nEthereum [ETH] was trading at $3.2k at press time. The $3k psychological level was breached multiple times since the 13th of April on the lower timeframes, and sentiment behind the altcoin king has weakened considerably.\n\nThis was evident by the sheer drop in the Open Interest behind ETH. Combined with the price trajectory of the past couple of weeks, it appeared that a downtrend was possible.\n\nYet, with $3k defended on the higher timeframes, there was also the possibility of a resurgence for the bulls. AMBCrypto investigated on-chain metrics to understand which path is more likely.\n\nSimilarities to Feb 2021\n\nDuring the previous bull run, in mid-February 2021, the price of Ethereum corrected from $1.9k (an ATH at that time) to $1.4k. It was followed by a V-reversal, but it showed that there are many times when the futures market gets overheated.\n\nImpatient bulls want to make a quick buck going long on leverage. This does work, but after a point, the lack of spot demand and the overwhelming longs in the futures market get reset.\n\nThe drop in OI from $10 billion to $7.17 billion in April was likely one more such reset. It is unclear whether a similar V-reversal would commence, given the selling pressure behind Bitcoin also in recent weeks.\n\nUser adoption has fallen alongside prices, sentiment\n\nThe weighted social sentiment had been strongly positive in February and for a couple of days in mid-March. Since then, it has been negative for the most part as prices entered a correction. The sentiment before the price peak could also revolve around the high gas fees on the network.\n\nThe network growth metric also slowed down in the past three months. An uptick would be a sign of growing demand, but it will more likely follow an uptrend than precede it.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe 90-day mean coin age has trended steadily higher since 27th March. This showed a network-wide accumulation of ETH. Meanwhile, the 30-day MVRV ratio has been negative for nearly a month now, showing holders at a loss.\n\nIt presented a good buying opportunity, but some uncertainty remained. If ETH can climb back above the $3.3k resistance, swing traders and investors will be more confident of continued gains."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPSnNZdVZaSW1mYzdITWZDODNjWFVfRkZkQnZMMXA0TzFnN3ZVemtLbVh4MXVRNkJueWhScEk4SzlabUJqU1pnRTBzM3RibnFnR0JlYjl5d0l4U3U2R0NnYXBJSmNVUGw2cWxPQjc2SFBoYUgxQTBVeFFWdmpCdmNyaU9mMnk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum April-End Price Prediction: Can ETH Hit $4,000? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, rising by 1.2% in the last 24 hours. At press time, ETH is trading at $3,216, according to CoinGecko data. ETH is up by 73% year-to-date and has regained the $3,000 level recently.\n\nAlso read: Cryptocurrency: Top 3 AI Coins To Buy For 2X Profit\n\nSource: CoinGecko\n\nEthereum Price Prediction for April-end\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for April end. According to their analysis, ETH is expected to reach a minimum price of $3,049 and a maximum price of $3,151. The average price is expected to be $3,100.\n\nThe prediction reveals that ETH is unlikely to hit the $4,000 level by the end of April. The recent surge in Ethereum’s price has been largely attributed to the pump after the Bitcoin halving. With Bitcoin once again back above $66,000, ETH has renewed its rally.\n\nAlso read: Shiba Inu April End Price Prediction: Can SHIB Delete A Zero?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxOTzEwcjI1amgtMEJEWUtzVlVCR2hGblN2eTNCa1J0Sl9JQ1paWW9vMlF2ZTJQR1R2OU8xUkl4OGMxSmJwNXctX29jOFhDOEYzSkRtcWIxZWdnX0FualpCN1hfSEduSm9HRm9WMGw0Z1Y0VDhnZjJ4TmNTZGJWbEJ5RGFHaklFSV9KY0RrWkE2UVJjYUlrUHdldmVQdlh2N2ExTkYzZklTREM0VlREcjNDOHktUS1qdU9hSncxOG0yeTUwVTh3SWJJdUp6SHJYVW02ZjlESWJRR0xFZ2JUTmtodE4xTDJIMUnSAewBQVVfeXFMTnY0VEtURFFXSk9ldVAxa2IteTBkX3NTamhjWWtDbnJFazJrb0F5Mm5MQlhMX2plT083WGFqTVhLdGQ3a005a1NneFotY2JBUVEyQnFWZGZUTGgtazJiLU93Z3hnaWtQVVpwTWFCWDM5NEdCTzB5M0N3RVJQd2tIWmxGTl9GWEltUUdSRkRzbVhVRkhVdFNWcjlQZjZIY24xZVZFeGhkOE8yRVVjbFBFaVFTQ25aVVNmLU40UkhZY0plLU8xMFpQei02U0w3NjFtXzliaU5uZS1fbnR3Q3FJM1d3cXltZGo0Tmsxc0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC dominance drops as rotation starts slowly - FXStreet",
        "content": "Bitcoin price is likely to suffer rejection as BTC market shows cautious optimism after halving.\n\nEthereum price making a strong close above $3,238 could kickstart a 15% rally to $3,750.\n\nOnly a candlestick above $0.6791 would make Ripple token attractive to buy for XRP bulls.\n\nBitcoin (BTC) price is trading with a bullish bias following a successful halving event that has since renewed optimism in the market. With it, Ethereum (ETH) and Ripple (XRP) prices are showing promise, amid calls of a looming altcoin season.\n\nPost-halving, markets are gathering modest gains. Meanwhile, Bitcoin dominance is going back down after establishing a peak of 57.03%. As it continues to drop, the rotation is slowly gaining steam in favor of altcoins. A drop in dominance below 54% could be a good confirmation.\n\nBTC dominance\n\nAlso Read: Is Bitcoin sucking liquidity from altcoins, or will alt season begin again?\n\nBitcoin price at the cusp of a pullback\n\nBitcoin price is stuck within the lower section of the market range, confronting overhead pressure from the 50% Fibonacci placeholder of $66,727. The market is leaning in favor of the downside, with the Relative Strength Index (RSI) appearing subdued after spending quite some time barely above the 50 mean level and hinting at buyer exhaustion.\n\nThe Moving Average Convergence Divergence (MACD) is in negative territory. While it is above the signal line in the 12-hour time frame, the positions are reversed in the daily time frame, showing a continuation of the bearish sentiment. The Awesome Oscillator (AO) indicator in negative territory accentuates this.\n\nBitcoin price is likely to reverse to $63,284, followed by a subsequent drop to $60,000 before a possible pullback. Notably, there remains some uncollected liquidity below this level, marked by the March 5 low of $59,005 and whose residue needs to be collected for balance.\n\nBTC/USDT 12-hour chart\n\nHowever, if the bulls can manage to breach the $66,727 roadblock and move above the most crucial Fibonacci retracement level of 61.8% at $68,391, it could open the expanse for extended gains, potentially as high as a new peak above $73,777.\n\nAlso Read: Bitcoin price nicks $66K after halving as BTC transaction fees reverse\n\nEthereum price could rally 15%\n\nAmid speculation of an altcoin season, Ethereum price could rally 15% to $3,750, levels last tested around mid-March. This could be driven by an altcoin season, with ETH bulls primed for a rally as showed by the buy signals on both the RSI and MACD indicators, which have already crossed their respective signal lines.\n\nIn a highly bullish case, the Ethereum price could extend a neck higher to $4,093, nearly 30% above current levels.\n\nETH/USDT 12-hour chart\n\nConversely, if traders succumb to their profit appetite, Ethereum price could retract 6%, losing all the gains made over the past few days. In a dire case, the slump could extend to the April 13 low of $2,850, 10% below current levels.\n\nAlso Read: Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies\n\nRipple price must rise 25% before XRP bulls flock the scene\n\nRipple price is bending to the alt season narrative, but XRP bulls will only come in after the price closes above the 78.6% Fibonacci retracement level of $0.6791. With the RSI and the MACD teasing with buy signals and the AO showing a bold resolve by the bulls to recover the market after multiple successive green histograms, the upside potential for XRP continues to grow.\n\nXRP/USDT 1-day chart\n\nConversely, a rejection could send the XRP price south to find initial support at the $0.5000 psychological level or lower at $0.4500. A lower low below $0.4188, however, would invalidate the bullish thesis.\n\nAlso Read: XRP Price Outlook: A breakout or significant price movement may be imminent for Ripple’s token"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOS1R2YlJ5RXY1SGRIemhOTGRSYXpxbjJESDMtVHlPbDVsNENTcWJkM2RCc3VoQkp5aHpJVFJZQ3pCZGQwRFVZZWVVOGd5dElRTU05aDBQN2JBUlAxWTBpNUc3Z0k5bEFGNWZ6dXBBSmZBNWV0c0hSSTg2azhDZ3UtcmRDS3ZRR0FORlRfSWZFeGFsZ0MyOW9TbEJR0gGfAUFVX3lxTE9hYjR0V0tVVlNlclluLVBmeWsyVDVyTERHbU9TaFMxTVV6cFpVS2djc1ZKemZzSnhKSERGeUdGQ1otdmo3cldhdHBaNjZoZjBybjU0b19GdEtWandLWUwweFpFcUhENzlpUHk2c0pmNXVmU0N6V3ZlTEtfSXp1aWxPV0duMlNnSEl3cllzclNMdW9GWFVtWFpuUWJSSmE3NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ethereum price prediction: Buy or sell this summer? - AMBCrypto News",
        "content": "The decline in Ethereum’s network activity has turned Ether inflationary.\n\nDespite recent price troubles, ETH’s long-term outlook remains significantly bullish.\n\nEthereum’s [ETH] supply has become inflationary, as the general market decline in the last month has decreased user activity on the network.\n\nAccording to data from Ultrasound.money, the leading altcoin’s supply has risen by over 4,836 ETH in the past 30 days. In the last week alone, this has grown by 9,000 ETH.\n\nETH’s supply is deemed to have become inflationary when there is an uptick in the number of coins created and added to the circulating supply, thereby increasing the downward pressure on the coin’s price.\n\nThis happens when the Ethereum network witnesses a drop in user activity. On-chain data from Artemis revealed a decline in the daily count of unique addresses interacting with the Ethereum blockchain in the past 30 days.\n\nBetween 23rd March and 22nd April, Ethereum’s daily active address count fell by 22%. This led to a corresponding fall in the network’s daily transaction count. During the period under review, this dropped by 15%.\n\nDuring the 30-day period in question, the network’s transaction fees peaked at $1.3 million on 12th April and initiated a decline. Between the 12th and 21st of April, Ethereum’s daily fees dropped by 8%.\n\nWhen the Layer 1 (L1) network witnesses a decline in fees, it experiences a low burn rate. A reduced burn rate increases the amount of ETH in circulation, making the coin inflationary.\n\nA look into the future\n\nAt press time, ETH exchanged hands at $3,173. Impacted by the general market decline in the last month, the coin’s value dropped by 5% during that period, according to CoinMarketCap’s data.\n\nHowever, despite the recent market headwinds, ETH’s 50-day moving average (MA), which initiated a golden cross when the bull market rally began in October 2023, still lies above its 200-day MA on a weekly chart.\n\nThis implies that the coin’s shorter-term moving average has remained above the longer-term moving average for some time. This is generally viewed as a bullish signal, as it indicates that ETH has experienced a sustained price increase since October 2023, despite a few drawbacks.\n\nMarket participants may interpret this as a sign of continued strength in the asset’s price.\n\nReadings from the coin’s Directional Movement Index confirmed this bullish outlook. The coin’s positive directional index (green), which also crossed above its negative directional index (red) in October 2023, has since maintained this position.\n\nThis crossover is regarded as a bullish signal as it signals a rise in the bullish momentum. If it occurs over an extended period, like in ETH’s case, traders view it as a confirmation of an uptrend in an asset’s price and a signal of a further price rally.\n\nAnother indicator worthy of note here is ETH’s Squeeze Momentum Indicator. It measures an asset’s momentum and tracks the consolidation phase of the market for traders looking to trade in a sideways market.\n\nPrice chart readings showed that ETH’s Squeeze Momentum Indicator has posted green upward-facing bars since November 2023.\n\nWhen this indicator shows upward-facing green bars, the asset in question is experiencing upward momentum.\n\nDespite the multiple declines in ETH’s price in the past several weeks, its Squeeze Momentum Indicator continues to display green upward-facing bars, indicating that the rally will continue in the long term.\n\nAlthough the coin’s outlook remains bullish in the long term, the surge in ETH profit-taking activity since mid-February has led to a decline in some of its key momentum metrics.\n\nAs of this writing, ETH’s Relative Strength Index (RSI) and Money Flow Index (MFI) were 58.77 and 52.01, respectively.\n\nWhile these values rest above 50, they suggest that recent market bearish trends have led to a slight decline in buying pressure.\n\nHowever, a combined reading of ETH’s RSI, MFI, and the indicators assessed above showed that the coin is not in extreme overbought or oversold conditions. It also signals that the current trend may continue to be stable with a slight bullish bias.\n\nETH futures market\n\nIn ETH’s derivatives market, its futures open interest reached a year-to-date peak of $15 billion on 9th April and has since declined by 33%, per Coinglass data. As of this writing, the coin’s futures open interest was $10 billion.\n\nThis decline signaled a fall in trading activity in ETH’s futures market. When an asset’s open interest declines in this manner, it means that market participants are closing out their positions without opening new ones.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nSince the open interest decline began, the coin has closed five days with a negative funding rate, with the latest being on 22nd April. On those days, futures traders placed bets in favor of a decline in the coin’s value.\n\nAt press time, ETH’s funding rate across exchanges was 0.0023%, showing that long traders have regained control."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNaEJZbDJqOHhDT2tYTEZXaHNLU2oyNWxSS1UxekptWVpXeHUwQmVoLTZBbjJrZVhGazl6RDkwMEItbDVKWER0MU1lRkxweklTWHEzb0d6cFM3TFVGTkRVWHFsX3ZCSUd0aXZYalZWTGM5U0ViNXlaN0picWNlS2VxX3Naand2aWo3NUg5XzZzVXlHTTZoNjFWSG00YnVzZEdleEZzN0l30gGrAUFVX3lxTFAtSmhXMzRzZ2R2SlBqZW1kV3pfTkJ3bjBLSVR5ZWtpdENOT2VKNTFMaHphVTBIYTliWlVFOTNnOEM0dE1rRkwyTFNZN1lNeDFZZzZpSDZBVDNROVh2STR5YUpmcFV6ZFBDVUNUMHgwUmFWNm1qRzlPTnRRUjFXdlZRTHc5ci11OFd2TFVqNGk0TjZ3Nnk5TGRjbkRSbEJVb2xMVUhnUXRsQnppcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Justin Sun Reportedly Scooped $890 Million Worth of Ethereum, ETH Price surge Ahead? - CoinGape",
        "content": "In recent developments, questions have arisen regarding whether Justin Sun, the prominent figure in the crypto space, has acquired a substantial amount of Ethereum (ETH). If true, this could further help boost the ETH price gain momentum to $3,500 and above.\n\nJustin Sun Wallet Shows Strong Ethereum Buying\n\nLookonchain, an on-chain data provider, highlights intriguing activities in whale wallets suspected to be associated with Sun. Since April 8, a wallet suspected to be Sun’s has purportedly acquired 127,388 ETH, amounting to $405.19 million.\n\nadvertisement\n\nNotably, this wallet deposited a significant sum of 787 million USDT to Binance on the Tron network starting March 31. Additionally, on the same date, a mysterious wallet emerged on the Ethereum blockchain, withdrawing $96.8 million in stablecoins from Binance.\n\nCuriously, this wallet commenced purchasing ETH from both Binance and decentralized exchanges, accumulating a total of 127,388 ETH valued at $405.19 million, with an average price of $3,172. These actions mirror those observed in a wallet previously linked to Sun, which acquired 168,369 ETH valued at $487 million between February 12 and February 24. If these wallets indeed belong to Sun, his ETH holdings would amount to a substantial 295,757 ETH, valued at $891 million, acquired at an average price of $3,014 from Binance and decentralized exchanges since February 12.\n\nDid #JustinSun buy 127,388 $ETH($405.19M) since Apr 8? The wallet suspected of being #JustinSun has deposited 787M $USDT to #Binance on #Tron since Mar 31. Also on Mar 31, a mysterious wallet was created on #Ethereum and withdrew $96.8M stablecoins from #Binance.\n\nIs this a… pic.twitter.com/OcEovodUrc — Lookonchain (@lookonchain) April 22, 2024\n\nETH Price Action Ahead\n\nAs of press time, the Ethereum price is trading 1.58% up at a price of $3,226 and a market cap of $387 billion. Analysis of the ETH/USD pair’s hourly charts reveals a significant breakthrough, as Ethereum breaches two interconnected downtrend lines positioned at the $3,070 and $3,150 marks.\n\nCurrently, Ethereum’s value exceeds $3,190 and maintains a position above the 100-hour Simple Moving Average, signaling a bullish outlook. Initial resistance is observed at $3,200, with notable barriers at $3,250 and $3,280. Overcoming these obstacles may propel Ethereum towards $3,350 and potentially beyond.\n\nConversely, failure to breach the $3,250 resistance could lead to a downtrend. In such a scenario, critical support is anticipated around $3,150. Further decline below the $3,120 level and the 100-hour SMA could escalate selling pressure, potentially driving prices toward $3,020 and even as low as $2,965.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOeFA1bm45OUVqOG9uWXRrT0hoOXMzN3JmcnlRTUhiSVVJcld3RGZTb0tzMEstYkJuMjROcHN4b0hrczVjb0pXRDBxVlRMa0lIZ2NrN0FhQ2tWS3o2SlhMNklHdUZnQzhIQ1h1bF9lRXlhdFk3LUJ6SVhLOS1jbTVSWkFRbjMxTzhrb0xzR0NHOWJzUFk0SUVkS1BVME82Yk3SAaQBQVVfeXFMT3lVcXZjV2U2SHY0cWphM0VPZXNzbmcxN1d4MGpPZzhBUndiWlhYaklKS2ZYM3VLV1hvdnhwSjV3aXBNUlAtRVk1eThZOHBVdVdoN2tkTXBVeUt4enBQdEtSV2tGOS01eDRTUkZmOEZZdVlOVlVaU0FIQjlEbGQ2bWNVd3JBQWVLdXQ0dGRobFFlc01EREY0Tl9YYllXalFBWXBPZHY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 22: Bitcoin Holds $65K, Ethereum Closer To $3200, XRP & Core Rally - CoinGape",
        "content": "The top crypto prices today continued gaining as the Bitcoin (BTC) price neared the $66,000 level. In addition, the Ethereum (ETH) price inched closer to the $3,200 mark. Moreover, other top altcoins, such as Cardano (ADA), XRP, and Solana (SOL) rebounded notably.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 1.01% reaching $65,777.16 at the time of writing on Monday, April 22. On the other hand, it’s trading volume rose 4.92% to $23.31 billion in the last 24 hours. Whilst, the crypto held a market capitalization of $1.29 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price gained 0.54% to $3,197.07 at press time with a market valuation of $383.77 billion. Whilst, ETH saw its trading volume gained 0.66%, reaching $10 billion. Meanwhile, the Binance Coin (BNB) price was up by 4.14%, reaching $598.19. In addition, its 24-hour trade spiked 40.69% to $995.37 million.\n\nThe Solana price extended above the $150 mark today. The Solana price surged by 0.97%, settling at $151.10. In contrast, SOL witnessed a 11.76% drop in trade volume to $2.36 billion in the last 24 hours. Whilst, the XRP price neared the $0.54 mark. The XRP price recorded a hike of 1.63%, reaching $0.5367. On the other hand, XRP’s trading volume slumped 10.64% to $1 billion.\n\nMeanwhile, the Cardano price gained 0.51% to $0.5095 today. Whilst, ADA recorded a plunge of 31.87% in its 24-hour trading volume, settling at $351.84 million. As the top crypto prices recovered, the popular meme coins defied the trend. The Dogecoin price slipped 1.44% to $0.1613 while its rival, Shiba Inu price dipped by 1.21% and traded at $0.00002728.\n\nAlso Read: Bitcoin Price Upper Limit Set At $4.5M For 4th Halving Cycle\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a popular Solana meme coin, surged significant today. At press time, the Pepe Coin price was up by 8.50% to $0.000006509 with a market valuation of $2.73 billion. In contrast, the 24-hour trade volume for PEPE soared 39.10% to $877.22 million.\n\nCore Rallies 13%\n\nCore (CORE) surged nearly 13% and ranked the top crypto gainer today. The Core price was up by 12.71% to $2.44 at the time of reporting. Moreover, its trade volume skyrocketed 103.73% and stood at $242.91 million. Furthermore, the Core crypto attained a high of $2.58 amid the rally today.\n\nAlso Read: Pepe Coin Price Eyes $0.00001 High As Chart Pattern Hints End-of-Correction Trend\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNZ0dvNUtaa1QyeW1ZQlUyV0xGVm9DUnZ5TXk2Wmt0Qzlvd0hUWjh6aHJzclhwN2pMaUZXekxwTlQ5QzFac3NFMjVOUXhObzV4OTh1NkpFVWtDSTZYUEZPUkVXWWExUkVtT01jajRJTGNLV3BGdmwwZTJHWFBCS1JNZEtkYlRPZ3gyeGJVbDBzVHhHeHRDZUZTT0Fn0gGfAUFVX3lxTFB1c2YtSTY0ZDBJVlpVVGw3NmNvV2dMLV8za01mRnRvVUREMjY5dTQ2NDlfV20ySl9CLUJSRVE3TXkwWFpKcS00clhfOEJaQXBoSzg0SXhTNE1HcTJXRnM1S04xODk1RDNjdkx3RjVNOFhLTGpzWGZWYlNKeTdjWHVpWURPUmE3WHFWMy1KTG5GRnBwbE10TjN1Vk85bE1qaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Solana, Ethereum, Bitcoin Price Analysis — American Roundup April 23 - CoinGape",
        "content": "Bitcoin price analysis: The crypto market depicts a calm environment on Tuesday heading into the American session. Bitcoin, the largest cryptocurrency, jolted upward after halving but the momentum garnered was not strong enough to uphold gains above $67,000.\n\nFor many people in the market, it might be imperative to say that BTC lacks direction, leaving altcoin majors like Ethereum (ETH) and Solana (SOL) oscillating in tight ranges.\n\nadvertisement\n\nEthereum, for instance, steadied above $3,000 but currently pivots around the $3,200 mark. A similar outlook is depicted by Solana which climbed above $150, following the correction to $120, but failed to break above the hurdle at $160.\n\nThe two competitive smart contracts tokens ETH and SOL, are trading at $3,184 and $154 during US business hours.\n\n1. Bitcoin Price Analysis: Assessing BTC’s Future Above $66,000 Support\n\nBitcoin price holds above the $66,000 level at the time of writing, but is seemingly pivotal — suggestive of the inability to find direction.\n\nThe 200-day Exponential Moving Average (EMA) (the line in purple on the chart) provides the next immediate support below the $66,000 level. Slightly under it are the other two key moving averages, the 20-day EMA and the 50-day EMA (the blue and red lines overlaying the chart).\n\nBased on the outlook of the Relative Strength Index (RSI) in the neutral region at 58 bulls may continue with the struggle for a breakout in the short-term. However, sellers do not have a lot of influence, especially with investors likely to be holding onto their coins anticipating a post-halving rally.\n\nBitcoin price has continued to exhibit strong fundamentals, pointing to a parabolic post-halving rally in 2024 and 2025. According to a chart shared by @ali_charts, its available supply shrunk to approximately 4.6 million for the first time ever before the recent halving cycle started.\n\nFor the first time ever, the available #Bitcoin supply decreased to about 4.6 million $BTC before this halving cycle began. Why does this matter? The halving further slashes miner rewards, accelerating the scarcity of new #BTC. As supply tightens, and even if demand remains the… pic.twitter.com/wGVmsW0K8t — Ali (@ali_charts) April 22, 2024\n\nWith miner rewards slashed by half to 3.125 BTC, supply is expected to keep decreasing, further driving Bitcoin’s scarcity. It is this fundamental quality that shrinks supply, as demand remains the same or increases which promises a significant impact on the price of BTC.\n\nBreaking above $68,000 and $70,000 may trigger FOMO and create a clear path to a new all-time high eyeing $80,000 in the short term and $100,000 toward the end of the year.\n\n2. Ethereum Price Hangs At The Edge Of A Cliff\n\nEthereum like Bitcoin, is unable to move past its immediate resistance at $3,250. On the downside, the oscillatory movement at $3,200 shows a lack of direction.\n\nThe confluence support created at $3,160 by the 20-day EMA and the 50-day EMA limits downward movement at the moment.\n\nHowever, with the RSI neutral and retreating toward the midline (50) and the oversold area (below 30), sellers may regain control, and trigger more losses to $3,000 this week.\n\nEthereum price tested support at $2,900 last week as geopolitical tensions thawed in West Asia between Israel and Iran. Such a move cannot be ruled out yet, especially with the expiry of Bitcoin and Ether options around the corner.\n\nOn the upside, breaking above the the yellow resistance band or the 200-day EMA could fuel the next uptick in Ethereum price targeting highs above $4,000.\n\n3. Solana Price As Correction Lingers\n\nThe Money Flow Index (MFI) has about turned on the four-hour chart, hinting at a brewing correction in Solana price. Movement on the upside has been capped under the previous day’s open of $157 and slightly above it is the 200-day EMA.\n\nIt is worth noting that, the presence of the above resistance levels does not imply immediate losses in SOL. Traders should be aware of the 20-day EMA and the 50-day EMA catching up to Solana price and aligning to support and prevent correction below the $150 level.\n\nIf the MFI stabilizes at 60, and bulls take up more long positions in SOL, a recovery may ensue within the American session and continue to Wednesday’s Asian session for a debut above $160.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQalJ5UGphWnAzbncxZzBnaGs3TVFWQzBEdjN4em5idmpEZzYtSElpWmdBQVdYejh1ZHB5b184VWVialpSczV5RFlPZ1BnUWxhTFh6UEg0T0tjb2thYWR5Z3NGT25GOW55ZXZHczc1OVBONnBIVWhLYW5XWEltRDRyVzYzZXdmTnFOV0hYOGRObXo1TUdCM1p0X0FwdG4xS21wQ29pSXZtSGRQZ2hQYW5xOTJOTdIBuwFBVV95cUxPSFYxdXNOSGQ2M3A3dExmM0xBUmJYYnB5WkNNbXlmZXFDa0ZKSkFNa3ltM01ZcUM1eGVaM1BmYXVPMFd0YVJodkVCLWVKblgzMkJDY1BWLU1PMDJfYzAwY2RhSzhPWXdQTWxEcFZ6VVhsbmlhVklTckl0N1Q3YTFwV3FXdXJOYzFXWWlBM2NrSTdIZ0pKVlBzYm1HM2JZRmlnYU1XdVVyME9Nb2U0U2tjSFl3TmpTZTYyRUZj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin price hits $66,000, Ethereum slightly gains after bitcoin halving event - Nairametrics",
        "content": "Bitcoin and Ethereum which experienced some volatility prior to the halving event has since resurged in prices with Bitcoin hitting $66,000 in price and Ethereum slightly gaining too.\n\nAccording to Decrypt, Bitcoin is up 1.6% in the past day hovering around $66,000 and have reached this milestone for the first time in a week.\n\nThe cryptocurrency’s block reward halving, which occurred on Friday, saw the reward paid to Bitcoin miners reduced from 6.25 to 3.125 BTC. This is always a catalyst for a bullish crypto market but the effects are felt immediately.\n\nAnother significant effect of the halving in the crypto space is the change in transaction fees of bitcoin. For a short time over the weekend after the halving the average fee to send BTC soared to an all-time high of $127 according to Bitinfo charts.\n\nCrypto experts at IntotheBlock, a blockchain analytics firm say that Bitcoin is currently sitting at a strong support level which they believe could make it more resistant to downward pressure.\n\n“Bitcoin is currently positioned right on top of a key demand zone, with 1.66 million addresses having purchased it at an average price of $64,800,” they wrote on Twitter.\n\n“This price point could potentially act as a strong support level should the market experience further downward pressure.”\n\nEthereum on the other hand experienced a price surge above $3000 on Friday and have managed to have remained there throughout the weekend. At the time of writing the Ethereum price is sitting just above $3200.\n\nThat’s a 1.3% gain in the last 24 hours and only about 1% shy of its price last week.\n\nBitcoin and Ethereum are two leading cryptocurrencies in market cap and user adoption.\n\nWhat To Know\n\nThe future for Bitcoin and Ethereum looks good as Hongkong conditionally approved Spot ETFs for both assets. Firms there believe they could resume issuing shares before the end of the month.\n\nAnalysts believe the conditionally approved spot ETFs for both Bitcoin and Ethereum will help reduce unease about cryptocurrencies in the region potentially bringing $25 billion worth of liquidities into the market."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4yUHhWbWpyWlAtWWRmWU9faXp1d0V0MHFOaG1oS0dSR0pxZ2FCX0FoT0cybGJnaTZvaDFCaVEyXzB3MkRtdGxYMlAyR3VwenM3azc2cTBvUUtDNG1nZXdzelVJX2VEb2ZzWk9RUlk1Tkx6V2NuaDYtNkVB0gF_QVVfeXFMTlhwZTJKcXNEbzM4VjZGSDk4OUhBSUh0ZHZ3ckZiMjk2a0xBN2ltcUtxX29GWEwyYUVnUU5tTEg3Qmp3X2xER2xjczJ6ckVRbWotaHZFSmtMUDFiVlFPS0ZIOWxtMFZyamFKdnBrczFZRnYwZ3FucFZxRi1PRXl6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 16:02:39 GMT",
        "title": "3 Major Metrics To Watch Out For That Can Impact Ethereum Prices - NewsBTC",
        "content": "The crypto market has been plagued with increased volatility lately, with the second largest crypto token by market cap, Ethereum (ETH), not exempt. This has made it harder to determine Ethereum’s future trajectory. However, certain metrics indicate what direction ETH’s price could head in when this volatility subsides.\n\nEthereum Investors Are Bullish\n\nData from Coinglass shows that most Ethereum investors and traders are still bullish on the crypto token despite recent fluctuating prices. Specifically, most of these traders have continued to open long positions on Ethereum, meaning they are betting on it experiencing significant moves to the upside in the long run.\n\nRelated Reading\n\nThe bullish sentiment towards Ethereum is highlighted by a trader who, having lost $4.5 million while longing ETH, still opened another long position on the second-largest crypto token. This crypto whale went as far as borrowing 17.3 million USDT from Compound just to increase their position on Ethereum.\n\nThese investors’ bullishness on Ethereum is even more commendable, considering that the bulls have suffered the most from ETH’s high volatility. Data from Coinglass shows that over $16 million in long positions have been liquidated in the last 24 hours, compared to the $10 million short positions that have liquidated during this period.\n\nMeanwhile, data from the market intelligence platform IntoTheBlock shows that Ethereum’s Market Value to Realized Value (MVRV) ratio has dropped, indicating that many Ethereum holders are not yet in profit. This could be bullish for ETH’s price as these holders will likely hold in anticipation of further upward price action, thereby providing support against any potential price declines.\n\nMaking A Case For The Bears\n\nWhile the activity in the derivates market and Ethereum’s MVRV ratio paint a bullish outlook for the crypto token, Ethereum’s network growth suggests that ETH could still experience further price declines. Data from Santiment shows that the rate at which new users enter the Ethereum ecosystem has slowed recently.\n\nRelated Reading\n\nWere Bitcoin Miners Behind The BTC Price Crash Below $60,000? 5 months ago\n\nThis declining network growth is also evident in a recent Bitcoinist report, which noted that Ethereum fees have dropped to their lowest since January. Ethereum fees are known to skyrocket when there is increased activity on the network. Therefore, low fees mean fewer new users are currently transacting on the network or even holding the ETH token at all.\n\nHowever, the silver lining is that data from Santiment also shows an increase in velocity, which suggests that existing users on the network are actively trading and injecting more liquidity into the Ethereum ecosystem. This factor could also contribute to potential price surges for the ETH token.\n\nAt the time of writing, Ethereum is trading at around $3,200, which is up in the last 24 hours, according to data from CoinMarketCap.\n\nETH bears pull price below $3,200 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Token Information, chart from Tradingview.com"
    }
]