[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE82bzlPb3REbzhWQWhPUkU2ak1vN0UtaC01NjBTUkpYU2dQenczMVViOEVXLVZzRUdqNERueU9RaXY5YTkxNTRzamdkTXQ5eUF0a3c1QTRzYk85aDVBdjVaM1F5ZEdfcVFFOVlQVGlvbUlrWGE40gF6QVVfeXFMT1U3RTVrb3VVbUlzS3d6bGgtQjdPTlpqS2c5YUZpNlVQWHo2WVV4a2hYeUhJb0h5Q1JXSGFRdDk5elFmcXlSZkExcXJsQ2ItV3hlNGtTYjh0QmhNdC1HQ2ZJOTg1MFFyWmFtbUE2SVpIbk9GaHRtWUlRZXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Solana to $1,000? Ethereum's History Makes It Possible - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nZhu Su , a founder of the infamous Three Arrows Capital hedge fund, recently highlighted the performance of the Grayscale Solana Trust, suggesting it could imply the future value of Solana to $1,000 per SOL.\n\nAdvertisement\n\nThis projection is based on a comparison with the historical performance of Ethereum and the Grayscale Ethereum Trust (ETHE), used as a benchmark.\n\nWhy is no one talking about how Grayscale Solana trust is implying $1k per sol already\n\n\n\nThe numbers are very similar to when eth was $200 but ethe implied $1k, in 2020 Advertisement June 28, 2024\n\nGrayscale's trusts work by allowing investors to gain exposure to digital currencies through a traditional investment vehicle without the challenges of buying, storing and safekeeping digital assets directly.\n\nEach share of the trust represents a fraction of the cryptocurrency held by the trust, and the value of the shares can trade at a premium or discount to the underlying asset's market value.\n\n\"Every four years...\"\n\nThus, four years ago, when Ethereum was trading at around $200, the Grayscale Ethereum Trust implied a value of $1,000 per ETH. This significant premium indicated strong investor confidence and future price expectations.\n\nEthereum's price eventually caught up with these projections, experiencing substantial growth in subsequent years. This pattern suggests a potential roadmap for Solana.\n\nThe comparison of Solana to Ethereum's early days, when it was also emerging as a significant platform, is noteworthy. If SOL follows a similar trajectory, the implied value suggested by the Grayscale Solana Trust could be realized.\n\nWhile past performance is not a guarantee of future results, the historical context offers a compelling narrative of Solana's growth prospects, making the $1,000 target a topic of interest in the community."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNbFJmWkV2T0hFNG92cFR5Z0tiQ0Nxd1VMNjJBM3pnMV9oX2FDUXBYOHZjWG8tTC1jaTVEMHp5NWFGMjNLYnczXy1rYWZ4UElFWjZlVmlYMmZhTmxrek53V3ZrRkdjNjJOMmotYmJEc1R6NjFuaHZaNGlDeV9sNWZ4VG9KQ0JMM1N5dW9iWjh6Y0VidE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum While It's Under $4,000 - The Motley Fool",
        "content": "Ethereum could outperform Bitcoin in the second half of 2024. Here's why.\n\nThrough the first six months of the year, Ethereum (ETH -5.70%) has largely kept pace with Bitcoin (BTC -3.10%). Both are now up about 45% year to date, and the big question on the minds of many investors is which is going to outperform during the rest of 2024.\n\nIn early May, the easy no-brainer answer would have been Bitcoin. But Bitcoin has stumbled of late, and that has opened the door for Ethereum. There are now four compelling reasons Ethereum could soar higher, even if Bitcoin continues to trade sideways.\n\nThe new ETFs\n\nBitcoin, of course, has had spot exchange-traded funds (ETFs) since January. And the introduction of this new investment product has arguably been one of the most important crypto narratives of 2024. But there's a new twist to that narrative. At the end of May, the Securities and Exchange Commission (SEC) finally approved new spot ETFs for Ethereum.\n\nIt is still uncertain how much of a boost these new ETFs are going to provide. The current thinking is that they will start trading sometime this summer and that they could lead to $3 billion flooding into the new ETFs. That's a bull case scenario, though. According to JPMorgan Chase (JPM -1.81%), the bear case scenario is closer to $1 billion. That's barely a blip on the radar compared to the $30 billion that has flowed into the new Bitcoin ETFs. Nevertheless, they are still likely to move the needle for Ethereum.\n\nEthereum as the market leader\n\nEthereum continues to be the clear market leader in every important blockchain sector. Take decentralized finance (DeFi), for example, where Ethereum still accounts for more than 60% of all total value locked (TVL) in the blockchain world. No other blockchain even comes close. So we can start to downplay any notion that a challenger such as Solana (SOL -5.36%), Cardano (ADA -6.00%), or Avalanche (AVAX -7.38%) has any clear-cut path to toppling Ethereum anytime soon.\n\nThe market seems to agree. Ethereum is significantly outperforming all of its peers. For example, Solana is up 35%, and Sui (SUI -2.02%) is up 9%. Other top competitors are reeling. Aptos (APT -2.47%) is down 28%, Cardano is down 32%, and Avalanche is down 33%.\n\nRegulatory clarity\n\nThere's another big reason to cheer on Ethereum, and that is regulatory clarity. Just about anyone who has ever heard of Ethereum considers it to be a cryptocurrency. However, through the first six months of the year, there were rumbles and murmurs about a pending SEC investigation into Ethereum, due to uncertainty over whether it might actually be a security.\n\nBut those rumors now appear to be quashed, with the SEC saying that it is closing down any investigation into Ethereum. That's important because it could turn on the money spigots for risk-averse institutional investors. Crypto is risky enough without the added risk of an SEC probe.\n\nLong-term disruptive potential\n\nAnd, finally, there's the long-term disruptive potential of Ethereum. For the past decade, Ethereum has been a true innovator, pioneering niches of the blockchain world that had never existed before. And, judging by all the tech upgrades that have been made to the Ethereum blockchain over the past two years, this trajectory should continue.\n\nIn fact, investment firm VanEck expects Ethereum to grow dramatically in several key areas, led by DeFi. It's here that the Ethereum blockchain can offer the greatest disruptive potential. It's simply faster, cheaper, and more transparent to manage financial assets on a blockchain. And that could lead to Ethereum gaining market share at the expense of traditional financial rivals.\n\nIn fact, VanEck has run the numbers and determined that Ethereum could soar to a value of $22,000 per token by 2030. That would give Ethereum an implied market cap north of $2 trillion. Given that the top companies in Silicon Valley are now worth anywhere from $1 trillion to $3 trillion, a market cap of $2 trillion for Ethereum is not as unreasonable as it might sound at first.\n\nWhat to look for over the next six months\n\nFrom my perspective, the biggest threat to Ethereum remains the rise of blockchain challengers such as Solana. The economic moat that once surrounded Ethereum seems to be getting smaller and smaller with each passing year.\n\nThat said, Ethereum is shaping up to be one of the best crypto investments you can make in the second half of 2024. If the new ETFs perform as expected, then it could be off to the races for the world's second-most-valuable cryptocurrency."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPU25WZUVyVXE0YVNSdUFSaHhXR01QRUhENnI3VU02Ykk3aF9VRk9ocWF0Rk95R3hveEYzMVZ6MmlhSXBSX0pfYjFzV0tpNWY5U3hxMlplNE5JdjMyM0t3Y25QMGM3WGhQS3o1Mjg0amNfWHQzQUZLT29NZnJWUGdtRzJOdkhNQ3F1cVpUZWVjSVVrcFU4WEN1eVBYVzcyUnRSNFotYjJXdk3SAa4BQVVfeXFMUENpTmp3VzVCN1YyTDM2SlI3OWExTG5BdEl0ODVkd3NaVmlucnlyM2JoS0p3b3NBeXNYSk5fVjZNa2NISk1JMjhrSjlCdXFVSjZMbzhGbFhyQkZoa1ZicWhkUkpjOTR3TzF5VndkWS1FZy0tUnpZS2pET05YTUZ4Zmd4bWZTS3doZEZrY2dLelNSemthZ3FJYjBwOGk3ZU00WTlhanJ1bEdEZ3MxdUV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Crypto company Consensys sued by SEC as regulator continues industrywide crackdown - CNBC",
        "content": "Crypto firm Consensys has been added to the SEC's list of targets, as the regulator continues its industrywide crackdown.\n\nThe Securities and Exchange Commission on Friday sued Consensys in federal court in Brooklyn, New York, over allegations that the company \"engaged in the offer and sale of securities\" and \"acted as an unregistered broker\" through its digital asset wallet called MetaMask.\n\n\"Consensys violated the federal securities laws by failing to register as a broker and failing to register the offer and sale of certain securities,\" the court filing alleges.\n\nIn April, Consensys, which provides blockchain software, tried to preempt the SEC's action with its own lawsuit in Texas, alleging overreach on the part of the regulator. The 10-year-old company said its suit followed three subpoenas issued last year, plus a Wells notice from the SEC that claimed Consensys was violating federal securities laws.\n\nSo far this year, the SEC has sent Wells notices, filed lawsuits, or reached settlements with a host of crypto firms focused on ethereum and decentralized finance, including ShapeShift, TradeStation and Uniswap. The agency is also reportedly investigating the Ethereum Foundation.\n\nLess than two weeks ago, Consensys declared victory in its fight with the SEC.\n\n\"The Enforcement Division of the SEC responded by notifying us that it is closing its investigation into Ethereum 2.0 and will not pursue an enforcement action against Consensys,\" the company wrote in a statement June 18.\n\nA Consensys spokesperson said in an emailed statement Friday that the action is part of an \"anti-crypto agenda\" at the SEC.\n\n\"This is just the latest example of its regulatory overreach — a transparent attempt to redefine well-established legal standards and expand the SEC's jurisdiction via lawsuit,\" the company said. \"We are confident in our position that the SEC has not been granted authority to regulate software interfaces like MetaMask.\"\n\nThe spokesperson added, \"We will continue to press our case in Texas as well as defend this new case in New York.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQU3RYeUR3cWVxRjUwOUljZGJiTXBRbG82R3I4TUFZYUJRV3NWQTBZVXBmVkIzdVc4R0xHSWVFYi13UGNvR3pkTi1ITll1SkFDbzNiN1lTSGNVZ01jYVQzLUw5SUJvRXoxc1FuN0Q5LXNzTGhrOEZhODQ4M0RQeTdJS2VTelJyNnBSUE9JV2xDRHc5cGg2OEVycmxmZkstd00yTENfNXpGOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Set to Launch on July 2nd – Bloomberg Analysts - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1ROFRrdUFiYmZ1OTFZaHE2MWVVWFRlMWI4WUt5QVdKQl9aVkVNYklpTWp2TnRaMlJLcHA2bWpYd01tQzZGb0JBeXVSVktJT1ZvVXBMNjJQOVNLMzFrRDZISXRZWkY0b3FoNmIyb2Q2SnUyWmFaYkk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum NFTs Make a Comeback? - CryptoSlate",
        "content": "Onchain Highlights\n\nDEFINITION: The relative amount (share) of gas consumed by the Ethereum network by transactions interacting with non-fungible tokens. This category includes token contract standards (ERC721, ERC1155) and NFT marketplaces (OpenSea, Blur, LooksRare, Rarible, SuperRare) for trading those.\n\nEthereum’s gas usage by NFTs has exhibited significant shifts over the past few years, mainly as different platforms have gained and lost prominence. Recent data indicates that Blur and OpenSea have consistently dominated gas consumption since early 2024.\n\nThis reflects the increasing activity on these platforms as traders and collectors continue to engage in the NFT market. In contrast, platforms like Rarible and SuperRare show relatively lower gas usage, highlighting their smaller user bases or less frequent transactions.\n\nHistorically, significant spikes in gas usage by NFT transactions correlate with broader trends in Ethereum’s price movements. For instance, the surge in early 2021 coincided with a considerable bull run in the crypto market, driving more transactions and higher gas fees. As Ethereum’s price stabilized in mid-2023, NFT-related gas usage also normalized, illustrating the interconnectedness of these metrics.\n\nThe current landscape suggests that while new NFT marketplaces emerge, established platforms like Blur and OpenSea maintain relative dominance, continually influencing Ethereum’s overall gas consumption patterns. This dynamic plays a crucial role in understanding the operational costs and transaction efficiency of the Ethereum network.\n\nWhile relative usage may be compatible with past cycles, overall NFT gas usage has plummeted since January 2023 as a percentage of overall network activity. At its peak, gas usage broke 40%, with a consistent level above 30%. Current levels are below 4%, partly due to the increasing popularity of layer-2s like Base and side chains like Polygon and an overall downtrend in the NFT market."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTFBwaUtuZkpGX21qWGd6WXdkV0o0Z3RBaHRMTGNMTGdNbnBBMVl6Zm9EcVJpTHJiSnpFenZoZ1ZIeE9yQjRYNmhuRXotSl9nZTNzMlduVnZ0elZicUxEN1pvdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum resurgence and layer-2 boom define crypto Q2: IntoTheBlock - Crypto Briefing",
        "content": "Spot ETH ETFs boost Ethereum as Bitcoin miners increase sell-off.\n\nKey Takeaways Bitcoin's price declined following its fourth halving, despite reduced issuance.\n\nEthereum's price rose following SEC's approval of spot ETH ETFs.\n\nShare this article\n\nThe second quarter in crypto was marked by Bitcoin (BTC) and Ethereum (ETH) trending down, BTC miners selling their reserves at a rapid pace, and layer-2 blockchains activity leaping four times, according to IntoTheBlock’s “On-chain Insights” newsletter.\n\nBitcoin’s price fell by 12.8% following its fourth halving on April 20, and an anticipated price surge caused by a supply shock did not materialize. IntoTheBlock analysts shared that this is likely due to long-term holders taking profits in 2024.\n\nImage: IntoTheBlock\n\nMoreover, miners have offloaded over 30,000 BTC in June alone, which amounts to near $2 billion. Again, the halving could be tied to this movement, as profit margins for miners decreased since then.\n\nIn contrast, Ethereum saw a modest decline of 3.1%, a feat made possible by the approval of spot ETH exchange-traded funds in the US, the analysts highlighted. This event boosted Ethereum’s price by over 10%, as those investment products are expected to attract substantial investment, mirroring the inflows seen with Bitcoin’s ETFs.\n\nAdditionally, Ethereum’s landscape was notably different, with an increase in transactions on layer-2 blockchains like Arbitrum, Base, and Optimism, following the integration of EIP-4844.\n\nCaption\n\nThis development introduced the “blobs”, which significantly reduced transaction fees for layer-2 blockchains and encouraged greater on-chain activity. Therefore, this potentially prepared the stage for long-term network benefits despite a short-term decrease in fee revenue."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQURrakpnbk5QWGluMUZQRFJ5cTlKODhEUk1EMHVzLXFILTdjY1RUenVhSUlVWkZob2lNdnJ0WnFoSkExN2xKNkRSMnRPeGFQODgtQVZxMmwyTENmeVdRSDhTLW5NNGpIT1IxbUQ4UC1TeFdOUkZ3Qk5PR0lZcXpqb9IBiAFBVV95cUxNWXNoVEZjQ1Fja092NnNGR3RnVG9pZEhESDNaWDJ2ckYtNUpPT1NpcnZUNk9idUczYjZxVVRCVmVSLTlwYV9fNm9ZRnM2VVVvQkFMd2ZvN0d2c09CYkNSRnEwRENvQlpHWlJod3lpQ1c0LVVVMzhHSWpBc2draUNlOGUzQjVpRW9U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "What Are Blobs? Improving Ethereum’s Scalability - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOfficially introduced to the Ethereum network on March 13, 2024 in the Dencun upgrade, blobs are a new type of data storage space designed to make rollups cheaper and more efficient.\n\nThe consensus within the Ethereum community is that the best way to scale Ethereum is through rollups, also known as Layer 2s or L2’s, and that the best way to scale rollups is via the introduction of blobs.\n\nBefore blobs, if Ethereum went through a period of congestion, that would also affect the price of transactions on all of its Layer 2s. The introduction of blobs removes the correlation between Ethereum congestion and the cost of transactions on Layer 2s.\n\nWhat are blobs?\n\nBlobs are a new data structure introduced to Ethereum in EIP-4844, more colloquially referred to as “Proto-danksharding”. EIP stands for Ethereum Improvement Proposal—the process by which Ethereum core developers suggest improvements to Ethereum.\n\nProto-danksharding is the precursor to full-danksharding, and sets the foundation for it by introducing blobs. It does so in the same format in which they’ll be used when full-danksharding is implemented, in order to simplify the transition to full-danksharding.\n\nFull-danksharding, or just Danksharding, is an upcoming Ethereum protocol update. It represents what Ethereum core devs believe will be the last step (for now) in making Ethereum a truly scalable blockchain, by making transactions faster and cheaper.\n\nProto-danksharding is a step towards implementing Danksharding—it introduces concepts from Danksharding, such as blobs, to Ethereum. Starting with proto-danksharding and the introduction of blobs, instead of diving straight into full-danksharding, reduces the risk created by introducing drastic changes to a network too quickly.\n\nHow do blobs work?\n\nBefore blobs, when a Layer 2 needed to verify its transactions, it would batch up transactions, and send them to Layer 1 (Ethereum) to verify. The problem was, after the data was verified, it was still stuck on the Ethereum blockchain, taking up blockspace, forever.\n\nAD\n\nAD\n\nThis contributes to state bloat, and makes Ethereum more congested—which, in turn, also made Layer 2s more congested.\n\nWith blobs, when the data is sent to the Layer 1 for verification, it’s sent in a blob, short for “Binary Large Object.” Each blob has 4096 field elements and can hold up to 32 bytes of data per field element, which equates to around 75 MB per blob. You can think of it as a giant table of data, or… a big blob of data.\n\nBlobs improve on the previous method of verifying data in that once data has been verified from a blob, it can be deleted. This way, all the transaction data from every rollup built on top of Ethereum doesn’t have to live permanently on the Ethereum blockchain, taking up valuable space.\n\nBlobs also operate using a separate blob fee market—introducing “blob gas”. Blob gas is independent of gas on Ethereum mainnet, meaning the only things that use blob gas are blobs themselves.\n\nWhat’s so special about blobs?\n\nDespite the funny names involved in Ethereum’s Dencun upgrade, it’s a serious improvement. Blobs help to make Ethereum less congested, and they make rollups cheaper and faster to use.\n\nThis is because the data that’s verified in blobs can be deleted after use. As such, it doesn’t cause state bloat on Ethereum mainnet. “State bloat” refers to the fact that the more data that is processed by Ethereum, the more data lives permanently on its blockchain—and the more intensive maintaining that network’s “state” becomes.\n\nSeparating the blob gas market from the existing gas market is also a marked improvement. Because blobs have a separate gas market, congestion on Ethereum doesn’t affect them. In the past, if there was a large event on Ethereum such as a highly anticipated NFT mint, the congestion caused by this event would leak onto Layer 2s and make transactions there more expensive as well. Separating blob gas markets from traditional ethereum gas markets removes the correlation between Ethereum network congestion and Layer 2 transaction costs and speed.\n\nBlobs also make Layer 2s much more profitable. Before blobs, when gas fees on them correlated with Ethereum network congestion, the cost of operation for Layer 2s, and the Dapps built on top of them, were much higher. Lowering transaction fees make it so that builders and operators are able to run complex smart contracts or products at a fraction of the cost.\n\nAD\n\nAD\n\nBlobs at work\n\nLooking at onchain data from rollup.wtf, we can see that the majority of Layer 2s with the highest transactions per second are already using blobs.\n\nIn a tweet, Jesse Pollak, founder of Layer 2 network Base, revealed that after Dencun, the cost of a simple swap transaction on Base dropped from $0.31 to $0.0005.\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nHowever, it hasn't been all sunshine and rainblobs. Blobs have been slower than anticipated when it comes to actually posting transactions to Layer 1. Creating a new gas market for blobs succeeded in decoupling Ethereum congestion from rollup transaction costs, but the gas market itself needs some fine-tuning before it’s everything it’s been hyped up to be.\n\nIn one example in June 2024, blob transactions became more expensive than their predecessor– but that can be seen as a sign that blob adoption is still in progress, and hopefully, as L2’s become more efficient at using blobs, more block builders start accepting blocks that include blobs, and blob capacity increases— the costs will go down.\n\nVitalik Buterin addressed both of these issues in a March 2023 blog post published shortly after Dencun’s release. In it, Buterin cites two core areas of focus that are needed to continue scaling blobs: “Progressively increasing blob capacity, eventually bringing to life the full vision of data availability sample with 16MB per slot of data space,” and “Improving L2s to make better use of the data space that we have.”\n\nSo while blobs have seen some growing pains, they were for the most part anticipated, and solutions are underway."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNNHNHaU1CUGpPLTdRR1E5cGZreFVvM2lFTjVtTXJNSHZuUUhNNUVFVXpHOXVnZk1Sa1dEV2Zac0liNFB3d1g3WDNhZktlMlBiaUxQU21ITzJRRndfZ1RpZEFYREpWaG9MOEFuQ1J0c25PRE9NZ1F4TFNvY1RiUWpmdGpVcE5PQ2Y0ZHVlWWZYWjY4VTdHZGVpUXpKcVBuUWNtNTdOMDI4QnAya1JSUjJfeE5QV3h5T1l2NnFiUDYyOWx6NmpXbGNMS2dGNkNnSzNwU2hJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Lekker Capital CEO Explains Why Bitcoin Could Reach $100,000 and Ethereum $7,000 by November Elections - The Crypto Basic",
        "content": "Quinn Thompson, CEO of Lekker Capital, forecasts Bitcoin at $100K and Ethereum at $7K by November, citing upcoming catalysts like ETFs and elections.\n\nIn a recent post on the social media platform X, Quinn Thompson, Founder and CEO at Lekker Capital, expressed his bullish outlook on the crypto market, particularly BTC and ETH. Thompson believes that Bitcoin (BTC) and Ethereum (ETH) are currently presenting one of the most attractive buying opportunities in recent memory.\n\nTitle: We are amidst one of the most obvious and attractive crypto buying opportunities of recent memory. Subtitle: While the market has completely reset, the structurally positive election, liquidity and crypto momentum cycles remain intact. Body: In all of my 5 years in… — Quinn Thompson (@qthomp) June 26, 2024\n\n- Advertisement -\n\nHe predicts that Bitcoin will surge to $100,000 while Ethereum will climb to $7,000, both achieving these milestones by the November election.\n\nElection, Liquidity, and ETFs\n\nThompson’s optimism stems from several factors that he believes the market has yet to price in fully. These include the upcoming U.S. presidential election, increased liquidity from the Federal Reserve, and the launch of the Ethereum ETF. Additionally, Thompson points to the Circle IPO and improved Bitcoin miner profitability as further catalysts for growth.\n\nThe CEO’s confidence in the market’s potential for a significant rally is also supported by various metrics. The CME basis for Bitcoin and Ethereum and the percentage of open interest in altcoins are all at cycle lows. Stablecoin supply has begun to grow again, indicating renewed interest and potential for upward price movement.\n\nAccording to the statement, any potential impact on Bitcoin and Ethereum prices resulting from the Mt. Gox or US and German government supply overhangs has already been factored into the market. Therefore, Thompson suggested that such previously known information would not significantly influence the cause of major declines in the prices of BTC and ETH.\n\n- Advertisement -\n\nFrom Bearish to Bullish\n\nThompson argues that current sentiment are overly bearish, and a “slowly then suddenly” dynamic is likely to play out as investors regain confidence and reenter the market. The CEO points out that similar negative narratives are currently being expressed about the potential Ethereum ETFs, echoing the sentiments before the Bitcoin ETFs launch. This perspective suggests that the current pessimism may be overstated and that the market could soon see a positive shift.\n\nThompson’s predictions align with those of other prominent figures in the crypto space. Galaxy Digital CEO Michael Novogratz has previously stated that he believes Bitcoin could reach $100,000 this year. Similarly, “Rich Dad Poor Dad” author Robert Kiyosaki has forecasted a similar price target for Bitcoin by the middle of the year."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBVay04ZXRaUzdkR2RkSGUxNVNnTGRlTDNfLVFuQ2NJYXVUTGVqWTdENDFNekVCU3VqbUhWUUVab3ZucWw2YXF4YXVxdmVSRmlyR3RVU0gxUnJLWVZpUW5xMmVOU3dkWUFJc1MwWWhYLUFwSl9BNFRKS2JIVXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price could go parabolic soon, analysts say - crypto.news",
        "content": "Ethereum price has held relatively well in the past few days as the odds of spot ETF approvals rose. ETH token was trading at $3,455 on Friday, a few points above this week’s low of $3,233. It remains in a correction zone after falling by 13% from its highest point this month.\n\nThe main catalyst for Ethereum is the anticipated spot Ethereum ETF approval by the Securities and Exchange Commission (SEC). As we reported on Thursday, there is a rising possibility that spot Ethereum ETFs will start trading soon.\n\nThe rising anticipation happened after VanEck filed form 8-A, which is an important document in the ETF application process. Eric Balchunas, a senior ETF analyst at Bloomberg believes that these funds will start trading on July 2nd.\n\nVanEck just filed 8-A form for spot Eth, which is just part of process, but.. should be noted that they filed their 8-A for spot bitcoin exactly 7 days before launch. Good sign for our July 2nd over/under (7 days from now). But again, anything poss. Sure we'll hear more soon.. https://t.co/2BlkDnWhrz — Eric Balchunas (@EricBalchunas) June 25, 2024\n\nThe approval of spot Ethereum ETFs would be a big deal. As we saw with Bitcoin, there is a strong demand for cryptocurrencies from institutional investors.\n\nSimilarly, the Grayscale Ethereum Trust (ETHE), which has a management fee of 2.50%, has over $10 billion in assets. As such, lower-priced funds will likely see heavy demand from retail and institutional investors.\n\nEthereum ETFs will also start trading at a time when balances in exchanges continue dropping, as shown below.\n\nEthereum reserves in exchanges\n\nEthereum’s ecosystem is still doing well even as the crypto sell-off continued. The network has over $108.95 billion in total value locked (TVL) and almost $80 billion in stablecoins. It has collected fees worth $1.65 billion, higher than Tron’s and Bitcoin’s combined.\n\nAnalysts are bullish on Ethereum price\n\nSome of the top crypto analysts believe that Ethereum is on the cusp of a bullish breakout. In an X thread, Rekt Finance noted that Ethereum’s open interest in the futures market was rising, which is a sign of institutional demand ahead of the ETF approval.\n\nHe also noted that Ether was a deflationary asset that has constantly been reducing its supply over time. Altogether, he expects that ETH will jump after the ETF approval, then move to a consolidation or pullback as many Grayscale Ethereum Fund holders move to cheaper options, and then it will resume its bullish trend.\n\n🚨 \"ETH IS GOING TO ZERO\" – that's what everyone's saying.\n\n\n\nBut I'll prove them wrong.\n\n\n\nI dug into the data and what I found was shocking.\n\n\n\n🧵: When & why $ETH is heading to $10K (+ trigger altseason) 👇 pic.twitter.com/nnlUDJlbNz — Rekt Fencer (@rektfencer) June 25, 2024\n\nIn another Tweet, Crypto Rover, who has over 700k followers, noted that Ethereum had formed a descending channel that resembles a falling wedge pattern. In most cases, this is one of the bullish patterns that supports upside potential. He expects that the breakout could happen soon."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPN3JxZlA0RGh0enZWd2pKeExGc3NsOHNrWmh5S0hlUGZpbGQzRzFzRjc0Vm1PYkhQV2dibTA5ZHh4eTBnR1pEUXpJSUVjZHlYWXZva04zSGU0ZmVaNnA5MHVsMGp3RG1hSldUMmJPVnI0U1c0UGdXVmJwNGllYXNVT2NTbkJhT2dsc1NVOVNIMThmNUo1alRuY25DbmVFTXNlS2FGQndxOTdDaUlYZXdUSkNvLUNLTkhYRVAzY1ZFMjg1anBlSWFfNWhTMlhoTDkwX21ncGFWblTSAd4BQVVfeXFMTkJNSUhWUWpVak9ZbHlYVXVWX2NEcmpWbmFobmlSZWhMQU1ZLThtb1ZOMjFpZUpCLU5iZnZEeDJVTU5DeVdTTWRmZjF3UnBYTmZYcnBoc2ZkazNJTGFGVjB2VkNFbkx0THNLZElNNmplZnFYV0g5anFCSUF5S0hyMEJnRVF1WGRFT3k4Yi0xUlRDOG0zTWRkLXRrcFBiLWtvcU42cVFVdVlINFFFNUFmVS1KVWVpTWl2MEM5ZE9xaTNIZnNBRWIzS2VCWjRTQ3RxYnlqLS03QW5SZHU3TmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum Rival Is Extremely Undervalued, Maps Path Forward for Bitcoin and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto analyst and trader believes that one Ethereum (ETH) rival is well below fair market value.\n\nCrypto trader Michaël van de Poppe tells his 722,500 followers on the social media platform X that layer-2 scaling solution Polkadot (DOT) could follow ETH’s upward trend.\n\n“DOT is likely going to follow Ethereum in its expansion upwards. This means that the current valuations of Polkadot are extremely low. I expect a lot from the Polkadot ecosystem with all the new segments.”\n\nLooking at his chart, he suggests the possibility of a bullish divergence for DOT on the three-day chart, a metric where a lower low appears on the price chart but then a corresponding indicator shows a higher low.\n\nDOT is trading for $6.20 at time of writing, down nearly 2% in the last 24 hours.\n\nNext up, the analyst predicts that Bitcoin (BTC) will consolidate in the near term around the lower $60,000 range.\n\n“Bitcoin did make a retest at $61,000. I expect this to continue consolidating, where I’m assuming that altcoins will have a higher return than Bitcoin.”\n\nLooking at his chart, the trader suggests that Bitcoin will bounce around $60,000 and soon return to around $64,000.\n\nBitcoin is trading for $60,757 at time of writing, down 1.47% in the last 24 hours.\n\nLastly, the analyst says that leading blockchain oracle service Chainlink (LINK) will likely rally against Bitcoin (LINK/BTC) in the near term as it bounces off a trading range low on the weekly chart.\n\n“Pretty significant start for LINK with this weekly candle of +11% on the Bitcoin pair. It’s still the cycle low and likely the bottom during this period of consolidation.”\n\nLINK/BTC is trading for 0.0002308 BTC ($13.92) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOOXF3ck1scGxOSTFRaC1vZDNtNzladDZ0d1VxVnRUcmpBbjUzeFhxWjRfYnZ0NjFfUVd6M29HSEJBYUpvNUZxRWNpeTY4R282YnF1ZVVSM2NxdkFLaGZDNG1UalZRb2kxdzZNOU1HenlCdktQaEVKaHdxMFZPLThJT0JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "How To Create NFTs On Ethereum - DisruptionBanking",
        "content": "Every non-fungible token (NFT) is unique and serves as a digital record of ownership. It identifies that you are the creator or owner of a certain digital asset. That could be a song, drawing, or any other media and content.\n\nNFTs can be profitable for individuals and businesses. You can create a digital item and sell it to earn money. Companies can sell event tickets or create NFT collections as extra income streams.\n\nEthereum is among the most popular destinations for creating NFTs. The network offers a reliable place to host your NFT and a simple creation process. If you are ready to create your first non-fungible tokens, find the steps to follow below!\n\nWhy You Should Consider Creating an NFT\n\nAccording to our experts, these are the main reasons why to consider creating an NFT:\n\nEnhance digital ownership and provenance . An NFT proves that you are the item’s owner or creator. Even when you sell the token, there’ll be proof of its origin.\n\n. An NFT proves that you are the item’s owner or creator. Even when you sell the token, there’ll be proof of its origin. Explore diverse applications . NFT can represent music or other digital content. It can also serve as proof that you own a physical item. That includes anything from event tickets to selling artwork and even using NFTs in real estate.\n\n. NFT can represent music or other digital content. It can also serve as proof that you own a physical item. That includes anything from event tickets to selling artwork and even using NFTs in real estate. Improve brand awareness and reputation. Many reputable brands, such as Adidas and other shoe creators, launched their NFT collections. Sports teams also designed non-fungible tokens to boost their bond with the fans. NFTs can be an excellent way to develop a brand and improve its awareness and popularity.\n\nStep-by-Step Process of NFT Creation\n\nThe first, and arguably the hardest, step is considering what you want to create. You might be a music creator who just completed an amazing song. Or you made an animated video or used AI to design a unique picture.\n\nThe important thing is that the NFT is unique — that’s where its value lies. And it’s worth noting that you need to be certain you are the rightful owner. Otherwise, you could end up having legal issues regarding the asset ownership.\n\nOnce you are ready to create an NFT on Ethereum, here is how to complete the process.\n\n1. Set Up an Ethereum Wallet\n\nEthereum is the favorite destination for NFT creation. Azuki, Mutant Ape Yacht Club, and Pudgy Penguins are some examples of popular tokens. According to statistics, Ethereum NFTs often reach a six-figure value during sales.\n\nYour first step is to get an NFT wallet. While there’s a huge range of wallets supporting Ethereum, here are your best options:\n\nMetaMask . It offers NFT smart contract support and is compatible with Ethereum and other blockchains. MetaMask is an excellent option for effortlessly storing and managing your NFTs and crypto coins. You can use it via a web browser and on your mobile devices.\n\n. It offers NFT smart contract support and is compatible with Ethereum and other blockchains. MetaMask is an excellent option for effortlessly storing and managing your NFTs and crypto coins. You can use it via a web browser and on your mobile devices. Enjin . If you need a non-custodial wallet that gives total NFT control, Enjin is a good pick. You can use it on the go with a free mobile app.\n\n. If you need a non-custodial wallet that gives total NFT control, Enjin is a good pick. You can use it on the go with a free mobile app. Alpha Wallet. The developers created the wallet on the Ethereum blockchain. The NFT collection is impressive, and the product offers complete control with the non-custodial feature.\n\nHead to the chosen platform to download and set up a crypto wallet.\n\n2. Purchase Ethereum (ETH)\n\nYou will need some Ethereum in your wallet because the network requires gas fees for transactions. The actual charges depend on the moment your listing is published. It should be easy to acquire some ETH coins since most exchanges support this altcoin. It’s possible to purchase it with fiat currencies or trade cryptos already stored in your wallet for ETH. You can use this ETH calculator to learn more about the asset value and potential.\n\n3. Choose an NFT Marketplace\n\nSource: Pixabay\n\nWe suggest picking a popular marketplace with generous existing NFT collections. The reason is that these platforms attract more users, indicating a better chance to sell your token. Some popular options include the following:\n\nOpenSea . The platform has an excellent reputation among traders. You can find art, gaming, photography, music, and other NFTs. They are well-sorted into different categories, and there are helpful sections like current top buys and trending lists.\n\n. The platform has an excellent reputation among traders. You can find art, gaming, photography, music, and other NFTs. They are well-sorted into different categories, and there are helpful sections like current top buys and trending lists. OKX . It’s a decentralized exchange that supports NFT creation on different blockchains. If you are a crypto trader, you might have had previous experience with OKX, which means you’ll be familiar with the interface when creating NFTs.\n\n. It’s a decentralized exchange that supports NFT creation on different blockchains. If you are a crypto trader, you might have had previous experience with OKX, which means you’ll be familiar with the interface when creating NFTs. Rarible. Rarible is a user-friendly marketplace where you can create and sell non-fungible tokens. It has a list of the latest drops in a visible position, so you’ll get some attention from potential buyers right away.\n\n4. Create Your Digital Asset\n\nThe actual steps might vary slightly depending on the chosen marketplace. You begin by connecting the wallet to the platform. After opening the registration page, the platform will ask for your wallet details. It will be necessary to verify your wallet before continuing.\n\nMake a final decision regarding your digital content. Get everything ready, whether it’s a single item or an NFT collection.\n\n5. Mint Your NFT\n\nThe next step of the process is to create a smart contract, which actually means generating your NFT collection. Begin by adding the media to the website. Now, pick the token symbol and use the wallet to sign the contract.\n\nWe suggest double-checking everything and adding as many details as possible. For example, some marketplaces allow inserting an external link with more info about the NFT. In the description field, write some catchy lines to capture the potential buyer’s attention.\n\n6. List Your NFT for Sale\n\nSource: Pixabay\n\nThe non-fungible token should now be in your wallet. Click a “sell” button next to it, and you’ll have the option to pick the token’s price. The sale can be time-limited, so set the desired duration.\n\nIf everything is ready, you can proceed to publish the listing. Your wallet will be used to sign several transactions. Some chains and marketplaces charge listing fees, but these are usually affordable. You can check Bitcoin NFTs if you’d like to explore non-fungible tokens on this blockchain.\n\nConclusion\n\nThe most important part of NFT creation is devising a unique and attractive idea of the digital content that the token will represent. If you have a unique item, creating an NFT shouldn’t take more than a few minutes. Once you have a wallet ready, pick an Ethereum NFT marketplace and sign up to make your first collection.\n\nAfter listing the NFT for sale, consider advertising it on social networks or promoting it in another way you see fit. That will increase the chance of the token getting sold, as well as the fee you receive."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWjlfakZUUFhCZUp3VERmZHlUNm55dFRHT3JJLTR0Q1o3ZThNNnFXdGFCTm5FTDBOUkVyMlY4ZDNLU0NPZEhUWFItWmN4V2RRUmRITlc4ZHdYZmVYV2FjUE9nMzdYa21ycThPVV9RNzZDVTNHYWfSAXtBVV95cUxQNnQ3dVg0UTBvd0wyNzRyekg4SmZCQzFnWUdlQ3JWRHFSaWd2N19WNlZpWGh1LUJfZmxaVlV2b1JubmdxNjBvZWctcHF2VXd1VUo1U1NldFd6d1liN19uV2hWNHdybktrWXgwd1Blbi12QWRldlBQUFJZYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Reach $7,500? Analyst Makes Bold Claim - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDespite the depressing performance Ethereum has been showing us lately, the potential behind it is greater than it may seem. The Glassnode analyst believes we have not yet seen everything Ethereum has to offer.\n\nAdvertisement\n\nA comparable trend that emerged in the early months of 2021 can be seen if we examine Ethereum's past. The current market structure is consistent with this historical pattern, indicating that Ethereum may have a price target of about $7,500. Based on the current structures and 161.8 Fibonacci extension level, the projection has been made by the analyst.\n\nETH to ~7500 USD as a Final Top?\n\n\n\nIf we look to ETH history, we observe how we in early 2021 had similar pattern for ETH developing. See YELLOW MARKINGS!\n\n\n\nWe believe Market moves in structures. And this structure gives us a target at ~7500 as a Final High for #ETH.\n\nThat is the… pic.twitter.com/FID62C9uyt — 𝗡𝗲𝗴𝗲𝗻𝘁𝗿𝗼𝗽𝗶𝗰 (@Negentropic_) June 27, 2024\n\nA similar Fibonacci extension level signaled a notable rally and large price gains in 2021. According to the analyst, the market moves in predictable patterns, and the current pattern indicates that ETH's high will occur at $7,500. Additionally, the chart shows a bull flag pattern, which traditionally denotes the continuation of a bullish trend.\n\nAdvertisement\n\nEthereum might be ready for a big increase in the near future if this pattern continues. Additionally, there is a surge in interest and investment on the larger cryptocurrency market. This situation, along with Ethereum's impending updates and growing institutional traction, may create the ideal conditions for a robust rally.\n\nIn order to reach this goal, Ethereum must overcome multiple obstacles. The $4,000 threshold, which corresponds to the 1.618 Fibonacci extension from the previous cycle, is the first significant obstacle. Achieving this level would confirm the bullish structure and open the door to higher objectives.\n\nAs for potential catalysts and the overall sentiment on the market, we are currently seeing a recovery after the most recent plunge, witnessed a few days ago, when Bitcoin plummeted below the $60,000 level. The best fuel for Ethereum and the market in general would be the approval of the Ethereum ETF and some technological advancements, similar to those we have seen from Solana."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQTEEtUmc3M1d0QjJEcGJvLWJabEt3U0xNb3Y5dldfNkZIT1dNa19HRzlhOTdoVU5BOGo0MDl0a2ZJM2NScGd4cHFOZVZVQ2k2d3lWVUlQTkRUaGVMMkFieUNRTkVON0FoVV9VdC0xdDJZZzkxd3MtYVY3WjFBTVFhbzFsUEpyZlI0TmNwT1Zsb2VBWHozcWkzY0xwc1dLM1M1YXExbW9FNWtoQdIBsgFBVV95cUxPc3VJLURpdmxzWm96eEl2emd0dTBSTk9Zak1lOF8zNV9WYWxVN201LWM1LUJvTnhnQlRRZGd1MkpNM1VPR3pZYllmYk53YTFmUGsza29RcE05SjI1WTJoQkdrb3dCS3FScW1uZkNiN2VZM1FuVVhEYmN1XzJxeHNkb2J2QTJkRFBsS29SUUdOOHJIbFlmUUxoRUVSUjVkemtnWld5cDZJcHVzdjY4NmtPWGZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Grows with Fidelity’s $4.7M; 5thScape’s 2024 ROI to Hit 30,000x - Crypto News Flash",
        "content": "A recent major shift in the entire crypto market has seen Fidelity risk $4.7 million in its place, Ethereum ETF, according to a new filing in the updated registration document. It shows that Fidelity believes Ethereum is slowly shifting the dynamics of the financial system as the world transforms its economy. On the other hand, there is a VR/AR blockchain platform, the 5thScape, which exhibits a massive precedent in tech investment with an estimated ROI of 30,000 by 2024. This growth potential has been unseen in the financial markets. It is a clear sign of significant investment opportunity tied to the marriage of innovative blockchain technologies and emerging digital asset markets that marks a new era of progress for our digital economy and the burgeoning VR/AR business.\n\n5thScape’s Remarkable ROI Projection Amidst Ethereum ETF Growth with Fidelity’s $4.7M\n\nAmidst Fidelity’s substantial investment in the Ethereum ETF, 5thScape stands out with an extraordinary projected ROI of 30,000x by 2024. This VR/AR blockchain platform represents a significant precedent in tech investment, demonstrating unparalleled growth potential. The convergence of VR/AR technology and blockchain innovation positions 5thScape as a high-growth investment opportunity, with its unique features and promising returns making it an attractive choice for investors. While Fidelity’s Ethereum ETF gains traction, 5thScape’s exceptional growth potential underscores the importance of recognizing and investing in groundbreaking technologies within the evolving digital asset market.\n\nBuzz Around 5thScape’s Success\n\n5thScape, a groundbreaking project that merges Virtual Reality (VR), Augmented Reality (AR), and blockchain technology, has made significant strides in its presale. It recently surpassed $6.5 million in funding.\n\nThe project aims to develop proprietary VR hardware and software, including five AAA games, a VR headset, and a motion-support VR chair. Notably, the presale token price has been rising, currently at $0.00285, and is set to increase further.\n\n>>Click Here To Visit 5thScape Presale Page\n\nInvestors worldwide have shown confidence in 5thScape, with active wallets from countries like Poland, Switzerland, Spain, the United States, and Canada.\n\n5thScape’s roadmap includes creating its own VR Ultra Headset, promising precise motion tracking, high-resolution visuals, and intuitive controls. This headset will be compatible with various games and educational resources, extending beyond the 5thScape ecosystem.\n\nBeyond gaming, 5thScape envisions applications in education, healthcare, and enterprise. These include employee simulation exercises, enhanced learning experiences, and medical training.\n\nThe VR industry is rapidly growing, with a current valuation of $67.66 billion. By 2029, it will reach $204.35 billion (CAGR of 24.74%). 5thScape’s focus on developing its hardware and fostering a competitive VR ecosystem positions it well to capitalize on this market growth.\n\nCentral to 5thScape is the 5SCAPE token, built on the Ethereum blockchain. Holders can use it within games, purchase hardware, and access exclusive content. Developers can also contribute by designing new games and models for the ecosystem, earning 70% of subscription fees.\n\nMoreover, 5thScape’s innovative approach, ambitious goals, and market leadership make it an intriguing investment prospect.\n\n5thScape’s Earning Opportunities and Volatility Management\n\nOwning 5thScape tokens (5SCAPE) grants exclusive benefits. These include access to premium content, discounts, and lifetime privileges within the VR ecosystem.\n\nThe native token 5SCAPE plays a crucial role:\n\nUsed for trading within the platform.\n\nRewarded to players in the play-to-earn ecosystem.\n\nTradable like other coins\n\nIts capped market supply adds scarcity, potentially influencing its value.\n\nIndustry experts foresee substantial growth opportunities for 5thScape and similar VR tokens. As virtual reality gains mainstream adoption across gaming, education, and other sectors, demand for specialized VR cryptocurrencies is set to soar.\n\n5thScape’s VR/AR platform positions it at the forefront of revolutionary gaming and crypto integration. Beyond gaming, 5thScape can extend to DeFi (Decentralized Finance) and NFTs (Non-Fungible Tokens).\n\nWhile high-cap assets may yield 100–200% returns in a few months, 5SCAPE, with its smaller market cap, would offer even more significant profits.\n\n5thScape’s immersive virtual reality environment, combined with its strategic roadmap, makes it an enticing investment opportunity.\n\nConcluding Thoughts\n\nThe burgeoning growth of Fidelity’s $4.7 million Ethereum ETF highlights a significant shift in the financial market’s dynamics. Concurrently, the extraordinary projected ROI of 30,000x for 5thScape underscores a remarkable investment opportunity.\n\nBy merging VR/AR technology with blockchain innovation, 5thScape sets a new precedent in tech investments, emphasizing the transformative potential of these emerging digital assets. As both the Ethereum ETF and 5thScape continue to gain traction, they collectively signify a new era of progress and opportunity in the evolving digital economy."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQT25NWTNOZklDQ2oyS2JIOVp5RnBtLTJxUmxwb3htcnZSSjBGTGFWV0ZpbkktcDU1c0w4a2s5RGJRaU5hd1BVVnhUeGJfMTVZWWlyQ0xkTXFwVmtGRUZWSlVVdTBibE92ZVVwWTJHMEYtVm9tNG5Xd2VmY2E3NmlmdXYtNDdlX2NPaG10NTdlaDRqT2otNWhKVEJKaDF6bzhLRWt2SnVCUWFVX2JsMXN2ZDFYYnhhemJpa0JhU1JJZENoYjVkYzBQbWFQOXNaR0s5RVYyV3RqcjNCNWps0gHiAUFVX3lxTE1GYjJSWFBfaF9qTEIyLTE1czRTN09oTkR4NnlhZ0xsU2VpN1p3REJKT3VnN0FLUG9BZ0FQdWxTSEhmZUMwQnRUQjRVRXRGQzRZWmk0b3F6SjVSbWtCX182cUpvZzNKdG1pdl93SnhpSm05OFhSUGtBTFpPbWZ6a3k4d3NkUnFVU0oyNllSM29xbWR6R0NYaWdSTjVPcTVzd3N1My1NM0xMSVN1QXNiQTdnNWZ2UWFiSEhhY3Atc0ZjMDJvWWsxZG9YVm94d0RmWTk5VVR5eU8zeEk1bFFQYnI2ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC struggles around the $62,000 level - FXStreet",
        "content": "Bitcoin price faces pullback resistance at the lower band of the descending wedge around $62,000.\n\nEthereum price finds support at $3,288, the 61.8% Fibonacci retracement level.\n\nRipple price faces resistance at $0.500, its daily resistance level.\n\nBitcoin (BTC) encounters resistance near the $62,000 mark, while Ripple (XRP) mirrors BTC's challenge around the $0.500 level. Meanwhile, Ethereum (ETH) finds solid support around the critical price point of $3,288.\n\nBTC faces resistance at the lower band of the descending wedge\n\nBitcoin's price broke below the descending wedge on Monday, declining approximately 7.5% to retest its crucial weekly support near $58,375 and rebounded by 5.8% on Tuesday.\n\nSince Tuesday, BTC has faced resistance at the lower boundary of the broken descending wedge. At the time of writing, it trades around $61,704 on Friday.\n\nIf the lower boundary of the descending wedge around $62,000 holds as resistance, BTC could decline roughly 5% to reach its weekly support near $58,375.\n\nOn the daily chart, the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are below their respective neutral levels of 50 and zero. This indicates that, according to these momentum indicators, the bearish sentiment prevails, suggesting the potential for further decline in BTC’s price.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes above the $63,956 level and forms a higher high in the daily time frame, it could indicate that bullish sentiment persists. Such a development may trigger a 5% rise in Bitcoin's price, revisiting its next weekly resistance at $67,147.\n\nEthereum price looks promising\n\nEthereum price retested its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27. ETH rebounded by 5% from the 61.8% Fibonacci retracement level and trades at around $3,457, edging up approximately 0.3% on Friday.\n\nIf this support at $3,288 holds, ETH price could rally 8% from its current trading level of $3,457 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are both below their neutral level of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective neutral levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price shows resilience\n\nRipple's price currently trades at $0.476, below the daily resistance level of $0.499. Despite Monday's fall in Bitcoin’s price, XRP has shown resilience in its price action.\n\nIf Ripple's price surpasses the barrier at $0.499, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nIn the daily chart, the Relative Strength Index (RSI) is currently below the 50 mark, indicating neutral to bearish sentiment, while the Awesome Oscillator (AO) remains below zero, suggesting bearish momentum. Both indicators must rise above their critical thresholds of 50 for RSI and zero for AO for a sustained bullish trend. Such a development would bolster the ongoing recovery rally in the market.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT daily chart\n\nHowever, if the Ripple price daily candlestick closes below $0.450, marking the June 7 low, it would invalidate the bullish outlook by establishing a lower daily low. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQODc1RnZ3aGxhekdFUTd5QjJXOWZDQWNBelNiOW9DTjUybVIwSEFNQXpKYnQwMVE3bWlhNDFqSHhOaUM4TnFNcWhPbWRPdTRORm0xWkZIM2Z2N1NYY1NuQW5IOGdNTjNWWVdSejBrSFZ4a3R0TzhxY2VLYTNGS3VQcEN6T1ItN03SAYwBQVVfeXFMT0VFMXNFZ1ZXLWVpRVBLSm5JRFVtSzFMc2FULUhQT1VOSm1LUVpHdlYxbERlWm5Zd1N5dWwtY1NlMVNNcXVuU0pESU9vby1RVDktOHJlUVhjcldiZHlOcm5LNU5fTTJTUmtNbHdQSzlYeTByNEpFbzBzVUpvdHlZa2JTN0V3Y2lnLXowUFA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "PEPE Whale Shifts Focus To Ethereum As ETF Optimism Builds - CoinGape",
        "content": "The latest on-chain insights reveal that a crypto market whale has strategically switched funds from PEPE to ETH amid optimism building up around the launch of an Ethereum ETF. Following the submission of eight S-1 amendment filings, this swap of funds has emerged, portraying optimism for ETH’s future price movements. Meanwhile, it’s worth noting that Pepe coin has also recently emerged as the talk of the crypto town, surging to unprecedented levels.\n\nSo, let’s take a deeper dive into the whale’s strategic investments and what it could mean for future market performances.\n\nadvertisement\n\nWhale Diverts Funds To ETH\n\nAccording to data revealed by EmberCN on June 28, the whale 0x837 has been recorded switching 1.4 trillion PEPE to 2,646 ETH.\n\nThe trader transferred 1.4 trillion PEPE, worth $18.01 million, to Binance. Subsequently, a withdrawal of $9.04 million worth of ETH took place from the same exchange.\n\nIt’s worth noting that these accumulations happened at an average price of $3,416. Also, market sentiments have tilted towards optimistic for Ethereum, primarily with the whale’s massive accumulation.\n\nThe whale activity also comes in light of recent optimism on the ETH ETF. As mentioned above, eight firms, including BlackRock, Fidelity, 21Shares, Grayscale, Franklin Templeton, VanEck, iShares, and Invesco, have submitted S-1 amendment filings.\n\nNate Geraci, ETFstore President, further took the stage to claim that the ETH ETF launch is imminent, expected to be in 2-3 weeks.\n\nMeanwhile, ETH & PEPE prices experienced considerable gains today.\n\nAlso Read: AVAX Price Rally To Surpass Solana Price Surge: Santiment\n\nETH & PEPE Price Performance\n\nWhile writing, PEPE’s price showed a 1.39% upswing to trade at $0.00001244. On the other hand, the ETH price chart showed a 0.86% upswing in value to $3,453.94.\n\nConversely, Coinglass data illustrates a 1.75% drop in Ethereum’s Futures OI to $15.19 billion. The derivatives volume tumbled 6.47% to $19.08 billion. This data flags reduced investor interest in the asset, birthing contrasting market sentiments on future movements.\n\nSimultaneously, PEPE’s OI saw a 3.94% pump to $142.37 million, whereas volume dipped 6.94% to $977.38 million.\n\nAlso Read: Bitcoin Miner Capitulation Ended? On-Chain Data Signals Market Recovery\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSXpDZ2pneWlQM1RIM2xvM0VheFFUSHZ0MHVMYWw4ZFBDV3lSUnhlNExTWTN1Wl95MnZ2aW14Q3NydXVZS3cwdkVTUkRyaHJsNU1VMElEYk1HYm5WUTVwTWdWSlFFUnFVTHpILWc0QTdJZDZBSTNwT1N6VWpOWDE0aTlubFladUt1ekc2eA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Surges 800% This Year, Outpacing Bitcoin & Ethereum - Watcher Guru",
        "content": "Solana (SOL) has shown impressive growth this year, surging by almost 800% and outpacing both Bitcoin and Ethereum. Over the last 12 months, the token has increased by more than 770% according to CoinMarketCap, despite its recent dip to the $141 level.\n\nAlternatively, Bitcoin and Ethereum have grown 100% and 82% in the same time frame, respectively. The development has firmly established SOL alongside both BTC and ETH as the top three cryptocurrencies in the market. That fact has led two firms to file for Spot Solana ETFs this week alone.\n\nSource: Bitcoin.com\n\nAlso Read: Solana June End Prediction: Solana Blinks To Help SOL Cross $180?\n\nSOL Beats Both Bitcoin and Ethereum in Yearly Gains So Far\n\nThroughout 2024 thus far, the US has approved two crypto-based ETFs. That is expected to grow, and Solana has emerged as a favorite to get the investment product, especially as its 800% yearly gains have outpaced both Bitcoin and Ethereum.\n\nA recent report from GSR Markets has said SOL “cemented itself as a part of crypto’s Big Three.” Additionally, they stated that it is “just a matter of time before Solana” gets its own ETF. That would place the three assets in rarified air, but looks more and more like it will become reality.\n\nSource: Decrypt\n\nAlso Read: 21Shares Officially Files for Spot Solana ETF\n\nBoth 21Shares and VanEck have filed for the Solana investment product this week. It speaks as much to Sol’s potential as an investment offering, as it does to the shifting regulatory conversion in the country. Moreover, it could speak to an even greater overarching change taking place.\n\nBloomberg recently said that “Bitcoin’s performance is starting to be overshadowed by Ether and Solana” as ETF hype grows. Additionally, there is the expectation that the latter could get a much-needed boost from the investment product discussions. If it does get approved, the industry, and the token itself, should be massively helped."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQdlpySGswSldrbHpRTGxYM1Z6SVJxekxJNlptSnkzYUJ3a1JCR2Uya2pPVnlzOHBsWDM3eDQtaGJoMmJFWVhOaHBJanZnYTl1Nk1DNGFORzZaaWNXVy03TGpLVTVvOUhhTUpueW9tQVpzNnpsdjhiQUdlbDVtU3A2UlJQWnM0eWlDbm00Rld4VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency: 3 ETH Coins To Stash Before Ethereum ETF Boom - Watcher Guru",
        "content": "The cryptocurrency world is now witnessing a dynamic shift. After Bitcoin ETF approval, Ethereum ETFs are in the queue to embrace the world and have already started to make waves in the current cryptocurrency realm.\n\nPost the Ethereum ETF approval, several analysts have already started to bet on how the phenomenon will help several Ethereum-based altcoins to skyrocket, turning them into a huge investment opportunity to capitalize on and make the most out of. Here are the latest top three ETH-based coins that an investor should stash before they hit big post the Ethereum ETF approval.\n\nAlso Read: Cryptocurrency: 3 Coins Set To Give 2x Returns In July\n\n3 ETH Coins To Stash Before They Skyrocket Post The Ethereum ETF Approval\n\nSource: WatcherGuru\n\nCryptocurrency #1- Floki Inu\n\nFloki Inu is another noteworthy Ethereum-based token that has made significant strides in the cryptocurrency realm. The token boasts a stellar community ecosystem and has been known to have float distinct marketing to tempt users from across the board. Floki Inu has recently launched a telegram bot with the intent to simplify crypto trading for traders and investors. The token is currently ranked 51st largest currency by market cap.\n\nAccording to CoinCodex, the token may surge and spike by nearly 222% by mid-July to trade at a price high of $ 0.00055. Post the Ethereum ETF approval, this figure can further amp up, making it an apt investment choice to explore and entertain. While Floki Inu is currently projected to be in a bearish mode, the cycle may change soon post the ETH ETF approvals.\n\n“The price of Floki Inu is predicted to rise by 225.91% and reach $ 0.00055 by July 28, 2024. Per our technical indicators, the current sentiment is Bearish while the Fear & Greed Index is showing 47 (Neutral). Floki Inu recorded 13/30 (43%) green days with 22.09% price volatility over the last 30 days.”\n\nCryptocurrency #2- Shiba Inu\n\nThe Shiba Inu ecosystem is known to constantly revamp its proceedings to woo investors. The token is currently busy curating a bunch of new product offerings that include launching the Shiba Eternity Blockchain version, as well as Shiba Hub, as new elements embellish its ecosystem. With the Ethereum ETF approval launch, SHIB can gain new price strength, which can help its investors accumulate new profits.\n\nAccording to CoinCodex, Shib may spike by 65% to trade at a new price high of $ 0.00002884. Per CC, SHIB is currently projecting a bearish signal but is bound to recover and heal, as its positive ecosystem upheavals will play a pivotal role in correcting its price valuation.\n\n“The Shiba Inu price forecast for the next 30 days is a projection. It is based on the positive/negative trends in the past 30 days. SHIB will be changing hands at $ 0.00002884 on Jul 5, 2024, gaining 65.31% in the process.”\n\nCryptocurrency #3- Pepe\n\nPepe is another notable cryptocurrency token that has made significant waves in the cryptocurrency sector. The token recently surged by nearly 3000% banking on the recent GME stock surge. Similarly, being an Ethereum-based token, Pepe can avail significant price valuation once Ethereum ETFs gain momentum in the mainstream market.\n\nAccording to CoinCodex, Pepe may surge by nearly 200% in mid-July, claiming an all-time high of $ 0.00003972. The CC buy indicators further project Pepe in the bullish realm.\n\nAlso Read: De-Dollarization Debunked: US Dollar Still King, Study Finds\n\n‘The price of Pepe Coin is predicted to rise by 225.55% and reach $ 0.00003972 by July 28, 2024. Per our technical indicators, the current sentiment is Bullish while the Fear & Greed Index is showing 47 (Neutral). Pepe Coin recorded 11/30 (37%) green days with 11.17% price volatility over the last 30 days."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQenpMOTVnc3FaY3ZaVm05UzZQQnNBRzF2ZV9GRzRCMFBza3FHai1TMWcwSkF6TTNnbXJrLS10cXdyaHU2Nng1RHpWc2toV2JZQ0ZIMEhIRG9VckIxVDFqMGZ3emliSzN1UmF2RW5WU3N4RG05SDNWQWwwTC1PWWR2d205cVVLVnQ2MlRtZFNRWk1RZ0JPM1N3alZmNnDSAaIBQVVfeXFMTnRMVVFOUEFTMnJvczJpY080WFB3OXpXTWEwb1lMZXhNVGt4cDRyazhIMWtBZkRDMFpCLU04clZpd3ZwbV91ckpnTHl1S0h2SlVrbTUtWm10Qkp1N3FIaXlwQWtrWmVNbC1lX2I3c3BRWnN2S0ttVW10T1dCZklBTGt1RjBRSFFyMnBYSjFLaVJjRWt1ZFJKeWVFNmVtWkJzMGtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "$102 Billion in Bitcoin and Ethereum Options to Expire Today: All You Need to Know - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAn enormous $102 billion in Bitcoin and Ethereum options are set to expire, which should push the volatility of the cryptocurrency market upward again - 107,000 BTC worth $6.6 billion and $3.6 billion worth of Ethereum.\n\nAdvertisement\n\nWith their impact on price dynamics and investor behavior, options play a critical role in the cryptocurrency market. A derivative known as an option gives buyers the right but not the responsibility to purchase or sell an asset at a fixed price prior to the contract's expiration.\n\nDue to traders and investors' adjustments to their positions, the volume of options scheduled for expiration can cause large price swings. Understanding these market fluctuations requires a special grasp of the max pain idea.\n\nJune 28 Options Data\n\n107K BTC options are expiring with a Put Call Ratio of 0.5, a Maxpain point of $57,000 and a notional value of $6.6 billion.\n\n1.04M ETH options are expiring with a Put Call Ratio of 0.59, Maxpain point of $3,100 and notional value of $3.6 billion.\n\nToday is… Advertisement June 28, 2024\n\nThe maximum pain is the price at which the greatest number of options contracts (calls and puts combined) will expire, resulting in the greatest possible financial loss for options holders. This target is $57,000 for Bitcoin and $3,100 for Ethereum. Due to market makers' attempts to reduce their payouts, the price of the underlying asset frequently tends to move toward the maximum pain point as the expiration date draws near.\n\nThe crypto market has faced difficulties in June, with a more negative outlook as the prices of ETH and BTC have gotten closer to their respective maximum pain points. Such closeness suggests that many options holders were unprepared for these price levels, thinking them improbable.\n\nWhen traders unwind their positions and market makers hedge their exposures, the expiration of such a large volume of options may cause volatility to increase. Another important metric to take into account is the Put/Call ratio.\n\nThe ratio for Bitcoin is 0.5, meaning that there are more call options than puts. Ethereum exhibits a similar trend with a ratio of 0.59. Despite the recent market correction, these ratios point to a general bullish attitude among traders."
    }
]