[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPNUEtQWRoNkZSalVXSHZTUHhuRFNiN1ZTYldmLUhqZGNFS0xTOWtVUllTQ1dpWUl3WXhoYWRvLThLUkZNMzVCT0pFMWxRZFhoQ05GMVRjMG5wOThPbEVXTFZ1OHhnNGRHN2JOdEp5ZFV3dlE1S1N5VUlDUlNHZlEzRVdUaDdOQ0JfaW10ZlBCZGJ5ck5HbWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Brief History of Cryptocurrency: From Bitcoin to Ethereum and BlockDAG Network - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, June 06, 2024 (GLOBE NEWSWIRE) -- Cryptocurrency has evolved from a niche curiosity into a mainstream financial phenomenon, transforming how we think about money, technology, and business. It began with the introduction of Bitcoin, a digital currency that promised a decentralized, secure, and immutable way to transfer value across the globe. Bitcoin's success paved the way for Ethereum, a platform that expanded the potential of blockchain technology with its smart contracts and decentralized applications. As the crypto landscape continued to evolve, new innovations like the BlockDAG Network emerged, offering scalable and efficient alternatives to traditional blockchain architectures.\n\n\n\n\n\n\n\n\n\n\n\nThis article explores the fascinating history of cryptocurrency, from the inception of Bitcoin to the rise of Ethereum and the cutting-edge developments in BlockDAG Network, providing a comprehensive overview of the journey and the impact these technologies have had on the world.\n\nBitcoin: The Genesis of Cryptocurrency\n\nBitcoin, often hailed as digital gold, revolutionized the financial world as the first decentralized cryptocurrency. The brainchild of a pseudonymous creator known as Satoshi Nakamoto, Bitcoin's white paper was released on October 28, 2008. The document introduced a Peer-to-Peer Electronic Cash System, enabling digital value transfer between parties without intermediaries like banks. This system utilized a blockchain, a chain of transactions stored on multiple computers competing to process and store transactions. This process, known as mining, created new Bitcoin BTC tokens and ensured the network's security and decentralization.\n\nThe first real-world Bitcoin transaction occurred on May 22, 2010, when Laszlo Hanyecz paid 10,000 BTC for two pizzas. At the time, 10,000 BTC was worth $41. As Bitcoin's value surged over the years, reaching peaks like $70,000 in March 2024, this transaction became a legendary story in the crypto community.\n\nBitcoin's journey from a cryptographic novelty to a multi-trillion-dollar asset involved overcoming significant challenges, including regulatory scrutiny and security breaches. However, its decentralized, immutable, and divisible nature made it a revolutionary global financial instrument.\n\n\n\n\n\n\n\nEthereum: Beyond Currency to Decentralized Applications\n\nWhile Bitcoin laid the foundation, Ethereum expanded the possibilities of blockchain technology. Proposed by Vitalik Buterin in 2013 and launched in 2015, Ethereum introduced a decentralized platform for running smart contracts. These contracts are self-executing agreements with the terms directly written into code, enabling trustless and automated transactions.\n\nStory continues\n\nEthereum's unique feature is its Turing-complete Ethereum Virtual Machine (EVM), allowing developers to create decentralized applications (dApps) that run exactly as programmed without downtime, fraud, or third-party interference. This innovation opened the door to numerous applications, from decentralized finance (DeFi) platforms to non-fungible tokens (NFTs).\n\nEthereum's native cryptocurrency, Ether (ETH), fuels the network by compensating miners for computational work and transaction validation. Despite facing volatility and security challenges, Ethereum has solidified its position as the second-largest cryptocurrency by market capitalization.\n\n\n\n\n\n\n\n\n\nBlockDAG Network: The Next Evolution in Blockchain Technology\n\nThe traditional blockchain architecture, used by Bitcoin and Ethereum, operates on a linear sequence of blocks. While effective, this model faces scalability issues, particularly with increasing transaction volumes. Enter BlockDAG Network , a novel approach that aims to address these limitations.\n\nBlockDAG has attracted investor’s attention and capital as a decentralized network structure where transactions are arranged in a graph format rather than a linear chain. This architecture allows multiple blocks to be processed simultaneously, significantly enhancing transaction throughput and scalability. Key characteristics of BlockDAG networks include parallel transactions, enhanced scalability, and improved security.\n\nNow BlockDAG Network has attracted even more attention within the industry with the release of its second keynote video, humorously titled “From the Moon.”\n\nThe project's presale has amassed over $40 million in record time for any cryptocurrency or digital asset initiative. This impressive funding surge underscores the rising interest in BlockDAG Network as a new store of value and passive income generator, akin to Bitcoin.\n\nThe momentum behind BlockDAG Network suggests that the $40 million raised is merely the beginning of what is poised to be a groundbreaking force in the digital market.\n\nThe Evolution of Crypto Assets and Market Dynamics\n\nBitcoin's brief surpassing of $70,000 on Monday marked a peak amidst a fourth consecutive week of inflows into crypto investment products. CoinShares International Ltd. reported $185 million in inflows for the week ending May 31, with $2 billion invested in May alone. This surge underscored the growing institutional interest and mainstream adoption of cryptocurrencies.\n\nEthereum, characterized by its volatility, continues to evolve with significant developments like the transition to Ethereum 2.0, which aims to address scalability and energy efficiency through a proof-of-stake consensus mechanism.\n\n\n\n\n\nConclusion: The Future of Cryptocurrency\n\nThe journey from Bitcoin to Ethereum and BlockDAG Network illustrates the rapid evolution and diversification of cryptocurrency technologies. From enabling peer-to-peer transactions and decentralized applications to enhancing scalability and security, these innovations are reshaping the financial landscape.\n\nThe digital evolution promises not only to disrupt traditional financial systems but also to democratize access to financial services, empowering users worldwide.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\n\n\nPresale: https://purchase.blockdag.network\n\n\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\n\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Brown Williams support at blockdag.network\n\n\n\n"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQbEdMSUNzRWNZdy1GQ0RvNFN3cHdGOGdIWnFTUjdNYXdtZ3drbklDa3BreG9oa19qQ3RyZ3lDUldKa0pFeUhWVFJrd1RRREl2U01OeElOMVd4NHFZN1NmX1A3alBrU2NBdzNZbHBfMTdWQTFIOTZKRklHM0dMRlc4SUMtTE56TVNRN1lQOUNIVEUwaE5XT2Zz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Should Ethereum Layer 2s Urgently Decentralize Their Sequencers? - Unchained",
        "content": "After Layer 2 network Linea halted block production this week, many demanded the sequencers be decentralized. But is it necessary?\n\nThe recent temporary halt of block production on Consensys’ Linea network following a $6.8 million exploit on the Velocore DEX, has renewed the debate about decentralizing sequencers in Ethereum Layer 2 (L2) solutions. Amidst this, on Wednesday, Optimism passed a proposal to implement fraud proofs. Although this wouldn’t help decentralize the sequencer, it would propel the blockchain to what’s referred to as “Stage 1” decentralization on layer 2s.\n\nSequencers\n\nin layer 2 solutions are entities that order and batch transactions before submitting them to the layer 1 blockchain, enabling more transactions per second at a lower cost. However, the centralization of these sequencers has raised concerns about security and censorship.\n\nLearn more: What Are Sequencers in Layer 2 Protocols?\n\nSteven Goldfeder, CEO of Offchain Labs, which develops Ethereum’s top L2, Arbitrum, told Unchained that it’s important to properly contextualize when discussing sequencers: “The term ‘sequencer’ means different things in different protocols.” The sequencer’s role is to order transactions, thus the definition. While this centralized component allows for faster transaction processing, it could censor by delaying transactions, though it cannot alter account balances or post illegitimate transactions. This safeguard is ensured by a network of validators that can challenge any incorrect actions via a fraud-proof mechanism.\n\nTherefore, according to Goldfeder, while the sequencer is centralized, the validation process is not, involving entities like Offchain Labs, Consensys, and even Google. However, Goldfeder highlighted that the “holy grail” is that everyone can validate. To achieve that, in the next couple weeks, they expect to roll out Arbitrum Bold, a new protocol for managing disputes on Arbitrum chains that enables permissionless validation. Goldfeder suggests that while decentralizing sequencers is an important problem, it is a “bit smaller than what a lot of people might expect.”\n\nChristine Kim, VP of research at Galaxy Digital, believes that decentralization is a spectrum and that fault-proof mechanisms alone do not ensure decentralization. “Rollups in general are significantly less decentralized and secure than the base layer, Ethereum.” However, she thinks that having a working fault-proof mechanism does not mean that a rollup is more decentralized than another because “working fault proofs is not the only mechanism that rollups need to achieve higher levels of decentralization and resiliency,” she told Unchained via email.\n\nHaseeb Qureshi, managing partner at Dragonfly, concurs, noting that while Arbitrum has fault proofs, they are currently whitelist-only. “The important thing about sequencers is not decentralizing so much as making the sequencers more robust. That almost certainly comes first,” he told Unchained.\n\nEven though fault proofs are not the only measure of decentralization for L2s, of the top five L2s by TVL, only Arbitrum has a fraud system in place. Optimism, Base, Blast and Mantle, currently lack fraud-proof mechanisms, meaning their sequencers have more power over transaction outcomes. “Basically they have a dictator,” said Goldfeder.\n\n“We need fault proofs on OP Stack, and then we need fault proofs to be reliable enough that anybody should be able to submit them, and move away from security councils and multisigs,” Qureshi said.\n\nKim argues that while optimistic rollups should work towards decentralizing their sequencers, they must also build working fault proofs, robust governance mechanisms, reduce reliance on admin controls, lower fees, and improve interoperability with other rollups. “A decentralized sequencer may be one of the hardest initiatives for a rollup to work towards but certainly not the only important one in the near-term to improve a rollup’s decentralization and resiliency,” she added.\n\nLearn more: A Beginner’s Guide to Ethereum Layers: Data Availability, Consensus, and Execution"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFBzOW0zYUdjSVVxRUxQcXFMbDc2Q21Ca3VGZ05TU2tpNVczNUpRNUE2bVFtcWZqY3h4WEo1cnNvZWJvcWJwYUMteFBLbExVX3FzamZKZU0xT2hsLUJKWHhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Hard Fork: What It Is in Blockchain, How It Works, and Why It Happens - Investopedia",
        "content": "What Is a Hard Fork?\n\nA blockchain hard fork is a change in programming that is incompatible with the old programming. This essentially creates a new blockchain and cryptocurrency. Hard forks generally require all nodes or users who wish to stay on the new chain to upgrade to the latest version of the software.\n\nHard forks may be initiated by developers as part of routine progress or maintenance on a blockchain. They may also be created by a faction of the crypto community that wants to take a different direction with the blockchain.\n\nKey Takeaways A hard fork is an event in which a change to a blockchain results in two branches: one that follows previous protocols and one that follows the new version.\n\nIn a hard fork, holders of tokens in the original blockchain will also be granted tokens in the new fork, but participants must choose which blockchain to continue verifying.\n\nHard forks are not specific to any single blockchain—it is an event that many have gone through.\n\nHard forks occur for several reasons, such as developer disagreements, required updates to a blockchain, or someone attempting to make another blockchain and cryptocurrency they control.\n\nHow Hard Forks Work\n\nA hard fork is when a new blockchain version emerges that is incompatible with the original version. It is not always an adverse event; in fact, many blockchains have undergone hard forks to implement necessary changes.\n\n\n\nBlockchains are basically programs that create and store files of information on a network of computers and devices. There are usually layers of software completing different tasks, some methods for the network to reach an agreement on the blockchain's state, and many network participants. Each layer's underlying programming can be changed as needed, but it has to be accepted by the network's participants to be adopted.\n\nDevelopers cannot force changes on a public blockchain that relies on participation. Public blockchains rely on their participants, so changes must be implemented by them, not forced upon them. Otherwise, they can refuse to accept the changes and keep their preferred version.\n\nBecause blockchains are essentially programs and scripts, they can be affected by errors, bugs, network communication problems, hardware failures, or other issues. Blockchains also rely on a large number of network participants to host versions for security.\n\nWhen developers publish a change to any of a blockchain's functions, one of two things happen: a hard fork or a soft fork. If the change is drastic enough to prevent a participant running the old version from participating in the blockchain's processes, the change is considered to have created a hard fork in the blockchain. Conversely, a change that allows old and new nodes to run is considered a soft fork.\n\nIn a hard fork event, participants are faced with a choice—they can update their software to the new version or not upgrade their software and use the old (and now unmaintained) blockchain.\n\n\n\nImage by Julie Bang © Investopedia 2019\n\nReasons for a Hard Fork\n\nThere are several reasons or even events that cause developers to implement a hard fork. For instance, when the hack on the Decentralized Autonomous Organization (DAO) occurred, the Ethereum blockchain was forked by a nearly unanimous vote.\n\nThe fork rolled back transactions that siphoned off tens of millions of dollars worth of digital currency by an anonymous hacker. The hard fork also helped DAO token holders get their ether (ETH) funds returned. However, some miners kept mining the old chain, which was picked up by OTC desks and given a price discovery order book. Poloniex listed this currency also, and some of the Ethereum community decided to keep this version and created Ethereum Classic.\n\nWhat Is the Meaning of Hard Fork? A hard fork is a change in a blockchain's programming that creates a new blockchain and cryptocurrency. Many projects have hard forked but kept their original names and tokens, with other groups deciding to stay with the original code and change the name.\n\nIs a Hard Fork Good or Bad? It depends on the circumstances and participants' views. Some might believe a hard fork is necessary and good, while others might not.\n\nWhy Do Hard Forks Happen? There are several reasons a hard fork might happen. Code might need adjusting to fix errors or address a weakness, or a group might want to create their own blockchain and cryptocurrency.\n\nThe Bottom Line\n\nHard forks are a change in programming that results in a blockchain split. Sometimes, hard forks are controversial in the community involved in a blockchain; at other times, they are necessary for a blockchain to progress.\n\nIn situations with controversy, participants and users can either upload the updated blockchain and begin processing it or reject it and use the old chain. This is how several blockchains and cryptocurrencies, such as Bitcoin Cash and Ethereum Classic, started.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE94R19pa1RUSm1Rbkt3UlllTV84c0RMbzVFVXQ3ZGJyOGQxdmhxZ0ltS3ZPV3NSTmFka3ZCem9tZmFfZXlFaWhsbzYtanl6VkFTRk1wT0pBWFlyNHpPd0dUazNtaDIwdDRFX2RIMU5zekpiTUxqbEJISjVtZmlpZk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "All of Michael Saylor’s Ethereum predictions were wrong - Protos",
        "content": "Michael Saylor has made a lot of predictions during his career. And because he became a billionaire in the process, many assume that his forecasts are generally accurate. For example, Bitcoiners applauded his support for — and multi-billion dollar purchases of — bitcoin. He invested at the right times and prices and has earned billions in profit. So when Saylor decided to place a bet on the future of Ethereum, millions listened.\n\nUnfortunately, Saylor got all of his predictions about Ethereum totally wrong.\n\nFirst, he predicted that the SEC would classify Ethereum as an unregistered security. At his corporate conference in Las Vegas a few weeks ago, he said, “Sometime this summer it will become very clear to everyone that Ethereum is deemed a crypto asset security, not a commodity.”\n\nSecond, Saylor predicted that US stock markets would never list a spot Ethereum ETF. “It will never be wrapped in a spot ETF. It will not be accepted by Wall Street; it will not be accepted by mainstream institutional investors.”\n\nFurthermore, he claimed that spot bitcoin ETFs would be the first and last type of spot cryptocurrency ETF. Pointing to the Bitcoin logo, he said, “This is the one, universal, consensus-accepted, institutional-grade crypto asset in the world. There won’t be another one.”\n\nEvery one of those predictions turned out to be wrong within five weeks.\n\nRead more: Michael Saylor dumps quarter billion worth of MSTR while hyping bitcoin\n\nSaylor lost all his bets on Ethereum\n\nDespite Joe Lubin’s ConsenSys lawsuit against the Securities and Exchange Commission (SEC) claiming that commissioners secretly classified Ethereum as a security in some redacted document, there’s no public evidence that they have actually done so.\n\nRead more: ConsenSys says the SEC designated ETH a security but won’t say where\n\nFurthermore, the SEC recently approved three 19b-4 exchange rule change requests from three US stock markets — NYSE, NASDAQ, and CBOE — to list spot ether ETFs. With those landmark approvals out of the way, the SEC will soon review and is widely expected to approve associated S-1 filings from up to nine ETF sponsors.\n\nWorse for Saylor, those sponsors include the largest and most mainstream Wall Street institutions imaginable: BlackRock, Fidelity, Franklin Templeton, Ark, and others.\n\nThat sets a final score for Saylor’s three bets on Ethereum at 0-3: no SEC unregistered securities designation (yet, at least), likely SEC spot ether ETF approval, and mainstream institutional investor support.\n\nSaylor lost many bets, then won one\n\nOf course, Saylor has lost other bets during his career. For example, he lost $15 million in his bet that Washington DC wouldn’t notice his $25 million tax evasion scheme. A few days ago, he agreed to pay $40 million to resolve his tax fraud lawsuit.\n\nSaylor also lost $8.5 million in his bet that he would avoid an SEC penalty for declaring false financials during the dot-com mania. He paid $8.2 million in stock plus $350,000 to settle.\n\nSaylor also lost an uncomfortable number of bets about the best corporate strategy for MicroStrategy for two full decades. From late 2000 through 2020, MicroStrategy stock failed to rally anywhere close to an all-time high despite Saylor’s continuous leadership. Finally, in recent months, and thanks to an improved price of bitcoin, shares are approximately two-thirds of their way back to their dot-com highs.\n\nIn all, Saylor got a lot of bets wrong in his career, but only one mattered. His prediction that bitcoin was worth buying on margin has made up for all of his previous and subsequent errors. His company, MicroStrategy, owns 214,400 bitcoins today worth over $15 billion after buying at an average price of $35,180 per coin. With the crypto trading at double that price today, MicroStrategy has doubled its $7.5 billion investment.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBkZHcta0VzNnp3TFFxcnB6OFJFTFZlVVQ0Q2c4YndTTmtaQkQzdFFPa1pSTTE3VW5mdF9QNGtCc3lZbVY4UUZPWGdRYmh1ZkI3T2pqRFBkRlhreHN5WXVpT1dlYXJmbVh1UlppaEpyZy1aZjdFQWJyUFhnZVTSAYIBQVVfeXFMUGkyMzQxX284bEI2LUdWRFMtWEthVlgxZzI5Z2V2a29MZVFDSXExVHk2UnZiQkVLMzI0ZmctT3kwajhpeDJaVGVZcXhrQnVfMkREX3o5Q3hwVkEtQVFlWHdJdDBpeGRBYk1ES0o5WC05X1NGbGVidFRvMFZ6RXBUMzJMQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum: Expert Predicts Doom For ETH's Price - Here's Why - Bitcoinist",
        "content": "Bitcoin maximalist Max Keiser has recently reiterated his stance on Ethereum, predicting a dire future for the cryptocurrency against Bitcoin. Keiser’s latest critique, shared on social media platform X, revives his longstanding view that Bitcoin outshines Ethereum and other altcoins on fundamental levels.\n\nAccording to Keiser, Ethereum is “heading to zero against BTC,” citing fundamental differences in their underlying technologies and legal classifications.\n\nCommodity Status And Decentralization Concerns\n\nKeiser’s argument hinges on the idea that Ethereum is not centralized and lacks the commodity status and a decentralized proof-of-work algorithm that “bolsters” Bitcoin’s appeal.\n\nHe points out that in countries like El Salvador, where he advises President Nayib Bukele on Bitcoin initiatives, Ethereum is regarded as an unregistered security rather than a commodity—a status that Bitcoin has maintained in regulatory circles in the United States.\n\nETH is not decentralized It’s not a commodity (like BTC)\n\nIt’s not proof-of-work\n\nIt’s heading to zero against BTC It’s classified as an unregistered security in El Salvador https://t.co/KQ3oezLHo5 — Max Keiser (@maxkeiser) June 5, 2024\n\nDespite the criticisms from Bitcoin proponents, ETH continues to hold a substantial market position, trading above $3,800 with slight gains of 0.8% in the past 24 hours and 2% over the past week.\n\nWhile Bitcoin maximalists like Kaiser remain critical of the altcoin, many experts maintain a positive outlook, anticipating that ETH could mirror Bitcoin’s historical performance of a parabolic rise.\n\nNotably, ETH’s recent performance comes amid positive forecasts from major financial analysts, including those from investment firm VanEck, which recently adjusted their prediction for Ethereum’s long-term price potential.\n\nContrasting View: VanEck Predicts A Bright Future For Ethereum\n\nIn a recent post updating its forecast for ETH, Investment firm VanEck has offered a more optimistic view, projecting ETH’s price could reach $22,000 by 2030. This bullish outlook is based on ETH’s role in the smart contract platform space, its ongoing development, and its ability to disrupt traditional markets.\n\nThe report from VanEck credits Ethereum’s “robust” framework for developers and its potential impact on finance and Big Tech as pivotal factors for its future valuation.\n\nThe analysts at VanEck also point to the imminent approval of spot Ethereum exchange-traded funds (ETFs) as a key driver for ETH’s adoption and price increase. They argue that such developments will enhance ETH’s accessibility and demand, potentially leading to a significant market capitalization boost.\n\nThe VanEck analysts particularly noted:\n\nDriven by a strong value proposition to entrepreneurs, the Ethereum network is likely to continue its rapid market share growth from traditional financial market participants and, increasingly, Big Tech. Should it do so while maintaining its dominant position among smart contract platforms, we see a credible path to $66B in free cash flow to token holders supporting a $2.2 trillion asset, or $22k per coin, by 2030.\n\nFeatured image created with DALL-E, Chart from TradingView"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1CX0tzZUNNbGNVWmVaRkZqTG54ZWEyTnV2WFo1M2YtR1RiQ04yQnh6UVhMYzdYUmpGejhxeml1WG5tUEpkbXdXNEZWVmVtdG1jMjlUT0thUEdKTTlCUXpoZG9fNTJYaHZS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "VanEck forecasts Ethereum to reach up to $154,000 by 2030 - Crypto Briefing",
        "content": "Ethereum's revenue surpasses major platforms, signaling a shift in digital economy dynamics, says the asset manager in a recent report.\n\nShare this article\n\nAsset manager VanEck projected the Ethereum (ETH) at $22,000 by 2030, according to a recent report. This represents a 487% increase from current levels, and VanEck bases its forecast on Ethereum’s anticipated generation of $66 billion in “free cashflows.”\n\nThe report puts a heavy weight into Ethereum’s stablecoin landscape, as the blockchain settled $4 trillion in stablecoins over the past year, along with the facilitation of $5.5 trillion in these tokens. Additionally, the stablecoin market cap in Ethereum is at over $91 billion.\n\n“Compared to Web2 applications, Ethereum ($3.4B) generates more revenue than Etsy ($2.7B), Twitch ($2.6B) and Roblox ($2.7B) […] Ethereum is a vibrant economic platform that can be considered a “Digital Mall” whose usership has grown ~1500%, and revenue has surged at a 161% CAGR since 2019,” adds the document.\n\nNotably, the recent approval of spot Ethereum exchange-traded funds (ETF) in the US also motivated the asset manager to evaluate their price prediction.\n\nVanEck also recognizes Ethereum’s potential in the artificial intelligence (AI) sector, mentioning the inclusion of the AI end-market in the updated valuation model. The network’s infrastructure is expected to play a crucial role in the burgeoning AI economy, offering unique properties that are essential for the development of AI applications.\n\nVanEck’s Ethereum evaluation framework. Image: VanEck\n\nFurthermore, the asset manager also mentions that Ethereum’s impact extends beyond its financial capabilities, as it enables the creation of more engaging and lucrative applications for entrepreneurs through its permissionless and open-source environment.\n\nAs a result, VanEck estimates Ethereum is projected to derive 71% of its revenues from financial businesses by 2030, with other sectors like AI expected to contribute significantly to its revenue stream."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPVFZOZ09FVUtHVEZNVm9oV2xvbm5NcHJISmpSLXExc291aHg1V24tU242aTJhcXVueDQtNlRWck5FYXlfcXFweHhlcFlndVJjSURoX1FmWUtFTC1nOFhSbU1aN1lvMkZjb0FPaW1GWmZqWHlKYzVHYk0waFl4Vnd2X2VQVdIBiwFBVV95cUxNZVlhUFFXZVl6WnFYRWJ4d05MeEdJUjMzUjIzR240bFh5dm56b1RidHo1QkNxRkJwTTZqYlNQTU9pOXNNNXV6UVFCRndsMTZRbUVGdUozVnE3enFUN1lnTklSTEJWNzE0dmZDRzZEelRxcTF0U0pJYUNTWUdNc2NUUWNhbVBITlNobkZF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price to Hit $22,000 by 2030, Predicts VanEck - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGlobal asset manager VanEck predicted Wednesday that the price of Ethereum will reach $22,000 by the end of the decade, dubbing the cryptocurrency “digital oil” in a new report. That would represent a 468% increase from Ethereum’s current price.\n\nWhile Ethereum has generated $3.4 billion in revenue over the past year, VanEck additionally sees that figure reaching $51 billion by 2030.\n\n“We believe ETH is a revolutionary asset with few parallels in the non-crypto financial world,” the report asserted. “The Ethereum network is likely to continue its rapid market share growth from traditional financial market participants and, increasingly, Big Tech.”\n\nVanEck characterized Ethereum as the centerpiece of its own financial system, as its network already secures over $90 billion in stablecoins, around $7 billion in tokenized assets, and $308 billion in digital assets.\n\nAD\n\nAD\n\nAt the same time, VanEck sees Ethereum making inroads outside of crypto. Based on the size of business sectors that Ethereum-built applications could disrupt, VanEck estimated that the network's total addressable market stands at $15 trillion. Those opportunities lie largely in finance, banking, and payments, VanEck said.\n\nEthereum could also find roles in infrastructure and artificial intelligence, the firm added, as well as marketing, advertising, social, and gaming.\n\nWe've raised our 2030 ETH price target to $22K, influenced by ether ETF news, scaling progress, and our read of onchain data. Additionally, we've analyzed how ETH and BTC perform in both traditional and crypto-only portfolios for optimal returns. @Matthew_Sigel @Patrick_Bush_VE… — VanEck (@vaneck_us) June 5, 2024\n\nThe report highlighted some of Ethereum’s distinct aspects as a network and an asset, from its nature as “programmable money” to a “yield bearing commodity.” Notably, VanEck’s report calls Ethereum an “internet reserve currency,” central to its massive ecosystem and layer-2 networks.\n\nAD\n\nAD\n\nVanEck’s report comes not long after the Securities and Exchange Commission’s approval of spot Ethereum ETFs. Allowing mainstream investors to gain exposure to the cryptocurrency in a traditional brokerage account, the move also had implications for Ethereum’s regulatory status.\n\nFor crypto natives, the concept may be basic, but its significance was underscored by VanEck: In order to send Ethereum or engage with smart contracts, a user needs to spend Ethereum on gas fees, which are then removed from circulation through burning. In essence, VanEck said that this dynamic benefits Ethereum holders two-fold: providing demand while reducing supply.\n\nThe asset manager expects Ethereum will also chip away at established tech giants like Google and Apple as a platform for developers to create consumer-facing applications. While the firms take around 30% of revenue from apps hosted in their respective digital stores, VanEck said Ethereum currently takes around 24% of reventhrough gas fees.\n\n“Compared to data-centric social networking platforms like Facebook, we believe Ethereum may enable more capable and lucrative applications for entrepreneurs,” the report stated. “As more data is generated in public and more commerce is moved off expensive, closed financial rails, business moats will erode.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQQkF1REY2OG9OLWNnaWd0NDJabmVWWDVkTXAtd0IyNUhXUkxhOXdvWGp6WVF3ZjJmalBlNnJWUkUybjhCSnFNNDFwaWxZUXV5cjhHd0dFNjI3NUJ6MXQ2LVRacjNndWFKeWstUXdEXzJfMDlhRENyWDBMdDB6Y1FlcFJ2ZVBTZC1NTEwzOVY1c1ZhSmJBd1lvbzRTcU9sV2pGQXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "The Base Ecosystem and Coinbase: Your Ultimate Guide to the Ethereum Layer-2 - CoinCentral",
        "content": "The Base ecosystem, incubated within Coinbase, is a Layer-2 solution designed to make the Ethereum blockchain more scalable, reduce transaction costs, and improve dApp user experiences.\n\nDespite ties to a centralized exchange, the project aims for progressive decentralization, which is critical for an open cryptoeconomy. Built on the OP Stack, Base ensures security, stability, and scalability for on-chain apps.\n\nLaunched in August 2023, Base has become one of the fastest-growing Layer-2 networks with nearly $2 billion in total value locked.\n\nNote: Base currently has no plans to introduce a new token; it uses ETH as its gas token. Be wary of potential scams offering fake Base tokens.\n\nThe following Base guide explores the ecosystem’s growth metrics & potential, leading projects, and a step-by-step guide to use it.\n\nAbout the Base Ecosystem: The Vibe\n\nBase significantly benefits from its integration with Coinbase’s large user base, which has helped usher in rapid user adoption and project integration.\n\nCoinbase is the largest centralized crypto exchange in North America with nearly 100 million users. The integration with Base has enabled seamless fiat onramps and access to a large user base.\n\nBase operates as a decentralized network, and Coinbase does not intervene in its daily operations. While Coinbase supports the ecosystem, Base maintains its decentralized nature by operating independently, utilizing the OP Stack for scalability and security.\n\nThe benefits of the Base blockchain for developers are numerous. Beyond financial investments, the Base ecosystem fund frequently offers developer grants and organizes hackathons. So far, it has invested in projects like:\n\nAvanti, an oracle-based synthetic derivatives protocol, that allows users to trade crypto and real-world assets with up to 100x leverage and earn yield as a market-maker by providing USDC liquidity.\n\nBSX, a decentralized limit order book, that combines the best of CeFi and DeFi trading experiences, offering features like cross-collateralization, powerful cross-margining, and self-custody.\n\nOnboard , a project that provides an onchain, self-custodial path for users to onramp and offramp crypto in a peer-to-peer manner through their own MPC wallet and smart contracts, focusing on developing markets.\n\nOpenCover, t he first Layer 2 insurance aggregator that works with underwriters to protect DeFi users against onchain risks such as smart contract hacks and oracle failures.\n\nt Paragraph, an onchain creator platform that helps creators publish, share, and monetize their content using permissionless protocols, enabling novel onchain mechanisms like turning posts into collectibles.\n\nTruflation, an onchain financial oracle providing automated, independent daily inflation reporting by compiling data from millions of points and sources, offering a higher fidelity picture of inflation.\n\nBase’s Coinbase link gets its foot in the door with potential partnerships with institutional investors, enterprises, and developer communities. These partnerships could lead to larger-scale projects and collaborations that drive substantial value for the ecosystem.\n\nAbout Base Ecosystem: The Numbers\n\nBase saw its first notable spurt of activity and TVL in September 2023, but its most significant in Q2 2024.\n\nBase’s blockchain total value locked in 2024 is nearly $2 billion as of writing.\n\nBase saw its daily transactions jump from 500,000 in March 2024 to over 3 million in April 2024.\n\nAround the same time, Base broke the $1 billion in total value bridged and currently has about $2.1 trillion of total value bridged, with ETH taking the lion’s share.\n\nBy April 2024, Base had over 400,000 sign-ups and a cumulative trading volume surpassing $1 billion, driven by a memecoin frenzy.\n\nBase Explorer is the recommended chain explorer.\n\nAbout Base: The Tech\n\nBase, like other “optimistic rollups,” assumes transactions are valid initially, reducing computational overhead. Suspicious transactions undergo fraud-proof verification, maintaining low costs.\n\nDefinition: optimistic rollup (noun)– Transactions are initially assumed to be valid, hence “optimistic,” and are later validated on-chain. A fraud-proof mechanism is triggered to verify its validity if any transaction is suspected to be fraudulent. This allows for significant scalability and efficiency improvements while leveraging the underlying blockchain’s security. Several other blockchain projects also utilize optimistic rollups for scaling, including the pioneering Optimism, Arbitrum, and Boba Network.\n\nBase is designed to seamlessly integrate with Ethereum L1, Coinbase, and other chains. Base offers cost-effective EVM features, developer-friendly APIs, and smart contract wallets. As the second core dev team on the OP Stack, Base collaborates with OP Labs to build a robust, interoperable web3 ecosystem.\n\nThe Base RPC Endpoint is here: https://mainnet.base.org.\n\nNetwork information can be found here: https://docs.base.org/docs/network-information\n\nBase is a decentralized Ethereum scaling solution, helping boost transaction speed and reduce costs.\n\nUnlike traditional Layer-1 blockchains (like Ethereum), which handle transactions individually, Base consolidates them into batches, processing them more efficiently and economically before recording them on Ethereum.\n\nHow to Use Base\n\nUsing Base, or any Layer-2, requires jumping through a few hoops. Basically, you’re going to move funds from the Ethereum base layer onto Layer-2.\n\nStep 1 Choose your Wallet: Use MetaMask or Coinbase Wallet.\n\nStep 2: Change/Add Network (top left corner)\n\nYou’ll probably see Base pop up, but just make sure it matches the below criteria:\n\nRPC Endpoint: https://mainnet.base.org`\n\nChain ID: 8453\n\nCurrency Symbol: ETH\n\nStep 3 Bridge ETH: Bridge ETH from Ethereum or other EVM chains to Base once connected.\n\nDefinition: Bridge (noun, verb) – transferring assets, like ETH, from one blockchain network to another. This involves moving your cryptocurrency from its original network (e.g., Ethereum) to a new network (e.g., Base) so you can use it within the new ecosystem. The bridge ensures that the value of your assets remains intact while allowing them to be utilized on different blockchain networks.\n\n💩Note: While the gas fees are significantly lower on Base, you still have to pay ETH’s Layer-1 fees to bridge funds.\n\nBlock Explorer: Https://basescan.org\n\nFor more details, visit https://www.base.org.\n\nMost Popular Base Projects\n\nDeFi\n\nThe most active (based on unique active wallets) dApps in the Base ecosystem are decentralized exchanges like Uniswap V3, Uniswap V2, 1inch Network, SushiSwap V3, and Compound.\n\nAerodrome, a next-generation AMM designed to serve as Base’s central liquidity hub, is a stand-out infrastructure in the Base ecosystem.\n\nMemecoins\n\nMemecoins such as TOSHI, TYBG, NORMIE, and BRETT drive significant trading volumes and transactional activity on Base.\n\nAs of writing, the $BRETT memecoin is having its moment in the sun.\n\nOther Base Ecosystem dApps\n\nDmail Network is a social messaging platform offering email and marketing services; Dmail Network is designed to facilitate secure and efficient communication within the decentralized ecosystem.\n\nParallel is a popular trading card game that integrates social elements.\n\nFrens On Chain is a unique digital pet project featuring dynamic NFTs.\n\nFinal Thoughts: From Coinbase to Base\n\nThe Base ecosystem, while backed by Coinbase, is designed to be a cornerstone for the decentralized future of blockchain technology.\n\nCoinbase is already credited with advancing and advocating cryptocurrency adoption to a mainstream audience, and its contributions have undoubtedly helped shape the United States policy toward cryptocurrency.\n\nBase, a decentralized Layer-2, is an exciting move from the organization and one of its first forays with direct entrepreneurship and incubation in the Ethereum ecosystem. It also launched the USDC stablecoin, an ERC-20, through CENTRE, a Coinbase-founded organization, and in collaboration with Circle.\n\nMuch of the Base hype revolves around memecoins– similar to how Solana’s ecosystem received a significant pump in activity and TVL in Q1 2024. However, given its growth within the Coinbase ecosystem and beyond, the project’s potential shouldn’t be overlooked."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQaW5SWDQtRVZMUmJwZl96cVlnTUpjZ0dudV9JTlRiODUzOVFlMW1TbmxsZTZJN3Uxam5SbHlRMFFoNGtKbS00a2pfSnhLNC1LU0hGZHZkMDR1dEc2NTJpaXNuOW92RVRteWFzakp2SFE4QzdyUnZvOHRscC1DaUpFT0Nn0gGHAUFVX3lxTE0yTDRuSlp2R1RuRFhfaDNZWGMyQU1vdzdfbERyNXlTb3pKNElpa0RRQTc2RGs0WURSMEJxbkJ1MGFDYmN4TWlNdmo5LTJSNmJSS2ZQOFp5QmhMTW8tU1NTbjdpY1VQdlhxNDQwT3NEam04Z3JvbXFCQXJiZVZ6UkVBUWhWX3hNYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whale Moves $33.55 Million in ETH to Coinbase: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAn Ethereum (ETH) whale has transferred 8,710 ETH, valued at approximately $33.55 million, to Coinbase, one of the leading cryptocurrency exchanges. The transaction was highlighted by Whale Alert, a service that tracks large crypto transactions. The transfer has sparked speculation that this whale might be preparing to sell a large portion of their holdings.\n\nAdvertisement\n\nSuch moves are closely watched by the crypto community, as they can significantly impact market dynamics. Given the recent rally in Ethereum’s price, it is plausible that the whale intends to capitalize on the gains. Over the last 30 days, the ETH price has surged by 22.15%, and it is currently trading at $3,849, up 1.20% in the past 24 hours.\n\nMarket context and implications\n\nEthereum’s recent price performance has been robust, driven by a confluence of factors, including market optimism and broader adoption trends. The approval of spot Ethereum ETFs (exchange-traded funds) has been a major catalyst. These ETFs are expected to begin trading in the coming weeks, and many analysts believe that their introduction will further fuel Ethereum’s price appreciation.\n\nThe approval of these ETFs marks a significant milestone for the leading altcoin, providing traditional investors with a new avenue to gain exposure to the cryptocurrency. This could potentially lead to increased demand and higher prices. Analysts are bullish on Ethereum’s outlook, predicting that the price could surge as these ETFs launch and attract more institutional and retail investment.\n\nAdvertisement\n\nWhale transactions , particularly those involving large amounts of cryptocurrency being moved to exchanges, are often seen as precursors to market volatility. Historically, large sell-offs have sometimes led to short-term dips in price, but the overall upward trajectory is driven by strong fundamentals, and increasing adoption tends to mitigate long-term concerns.\n\nAs the crypto community closely monitors this whale’s next moves, the broader market focus remains on the upcoming trading of Ethereum ETFs. The anticipation is high, and many believe that Ethereum is on the cusp of another significant rally. For now, Ethereum stands strong, backed by positive market sentiment and strategic developments that promise to enhance its market position even further."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBkTXJkRlhxMW1LbjdaTC05YklIcXZlWmxpSFpsRGlJbFYwU0NSd2IzZXBkOGsyR1BkOUJ0Ujc3dE1CbmV2by1tU0NDLVRlU0E3Nl9vdTNVeVM4UTRBLWg5cFpZWXc4bzl6V180Ri1uZHJCTWZSbGNjTVN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic: Analyst Predicts Imminent Bullish Breakout For ETC - TronWeekly",
        "content": "Famous for his accurate crypto analysis, Crypto Jack recently provided his forecast, based on which Ethereum Classic (ETC) is expected to have a strong rebound soon. In a recent X post, Crypto Jack notes that based on the various market signs, ETC is expected to make a big surge in the near future and attract the attention of traders and investors.\n\nCrypto Jack also pointed out a formation of a symmetrical triangle, a technical pattern that is usually followed by a breakout. This he says could be established by determining the closing of a bullish candle above the upper trendline of the triangle. This pattern is a significant period of congestion, characterized by a limited price range before a strong move takes place.\n\nAnalyst Predicts Ethereum Classic (ETC) Surge\n\nCrypto Jack is ready to initiate a Long position on Ethereum Classic when there is a bullish candlestick closing above the upper trendline of the symmetrical triangle. His confidence in this next move therefore means that traders can take this opportunity in order to make a good profit from the expected increase in the prices of ETC.\n\nEthereum Classic: Analyst Predicts Imminent Bullish Breakout For ETC 4\n\nAs the anticipation of a breakout has been discussed among the crypto community, many are watching the price of ETC in the hope of this breakout. The aspect of market prediction that Jack is well known for increases the credibility of his current forecast on Ethereum Classic, therefore creating high anticipation for this particular crypto. Some of the previous predictions that he has made have been quite accurate hence making his current explanation hold much ground.\n\nAs the market watches closely and the next few days may become critical for ETC traders. A confirmed breakout would mean that a new bullish trend has begun, and it would present a lot of profit-making opportunities to anybody who is well placed. Thus, the participants in the crypto community and those willing to invest in cryptocurrencies should always be prepared and vigilant to seize the opportunities. Breakout has its advantage and disadvantages and that is why as a trader one has to be on the look out for any opportunity that comes his way."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPNWxDM0QxakVMVjUwcFRKTm40VEdfVlpYQ0lDRlJ4Z19QU0NUYnhYREV0Q3RKR3hwNnpQa0N2eWFTbW1hbXgybkhDa2JVdENGRjRvMlZBMGxaQkZwV1Exck1kX05XYWtJcEQ3TFlONU53T3A5cWFWV0pOZEY1M2JnWm9haVV6aWRNbDd4WA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "VanEck Analysts Predict Ethereum Could Reach $22,000 by 2030 - Yahoo Finance",
        "content": "VanEck Analysts Predict Ethereum Could Reach $22,000 by 2030\n\nVanEck analysts have significantly raised their price prediction for Ethereum (ETH) to $22,000 by 2030. In a post on X, VanEck shared, \"We've raised our 2030 ETH price target to $22,000, influenced by ether ETF news, scaling progress, and our read of onchain data.\" This statement was accompanied by a link to the detailed report authored by Matthew Sigel, Patrick Bush, and Denis Zinoviev.\n\nVanEck is among several Wall Street investment managers aiming to list spot Ether ETFs, following their successful launch of spot Bitcoin ETFs earlier this year. The Securities and Exchange Commission (SEC) approved spot Ether ETFs last month, enabling investors to benefit from Ethereum's price appreciation without directly purchasing the cryptocurrency. This setup also allows ETF sponsors to earn fees as more assets flow into their funds.\n\nThe VanEck analysts expressed optimism about the approval and trading of spot Ether ETFs on U.S. stock exchanges. \"This development would allow financial advisors and institutional investors to hold this unique asset with the security of qualified custodians, and benefit from the pricing and liquidity advantages characteristic of ETFs,\" they noted.\n\nVanEck's base case price target is $22,000, with more extreme bullish and bearish scenarios predicting prices of $154,000 and $360, respectively. The analysts concluded, \"We believe ETH is a revolutionary asset with few parallels in the non-crypto financial world. ETH can be thought of as 'Digital Oil' because it is consumed by engaging in activity on Ethereum.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQNThIOTNLS1BWc2NpVkZhbkE0ZG41SWlTU1B5YktyLWoydnptWVpXSWxDcmVtWkY0b2ttQTVXUkR4NG5YRk5KalFPV1ViVUxuUjBiYTBtQjVTaml1Uk5NblRjRmE3bkh3N3dQZk5VTmdhUnludlV0M1BlVFEwbUM3R2ZaakFWWVpUWXVZT2dkWkNCby10RHVEMFJkVjYtRHgzWlFXbU1MbGs3UktVQmJ4dzYyUm1NOFlvN2xaN3VGSks0bFg5QXlsV0FzS19wR0tnS3Vrb1FhQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Trading Launch Could Be Delayed, Says SEC Chair Gary Gensler - Benzinga",
        "content": "SEC Chair Gary Gensler has signaled that the final approval of spot Ether ETH/USD exchange-traded funds (ETFs) might face delays.\n\nWhat Happened: In a June 5 interview on CNBC, Gensler remarked that the SEC's next steps regarding the approval of these ETFs will “take some time.”\n\nThis suggests a cautious and potentially prolonged approach in approving the S-1 registration statements.\n\nOn May 23, the SEC approved 19b-4 filings from several major asset managers including VanEck, BlackRock BLK, Fidelity, Grayscale, Franklin Templeton, ARK 21Shares, Invesco Galaxy and Bitwise.\n\nDespite these approvals, the actual listing and trading of these ETFs on U.S. exchanges may still be months away.\n\nDuring the interview, Gensler also pointed out that cryptocurrency firms were engaging in activities not permitted for traditional exchanges, indicating that the SEC's stringent enforcement actions would continue under his leadership.\n\nNotably, the SEC has pursued legal action against companies such as Ripple XRP/USD, Coinbase COIN, Binance BNB/USD and Kraken.\n\nHowever, the commission has faced its own challenges, including a court-ordered payment of $1.8 million over misconduct allegations.\n\nAlso Read: Why Bitcoin Might Not Hit A New All-Time High This Month: 10x Research\n\nWhy It Matters: While the approval process for spot Ether ETFs may be slow, the SEC has initiated steps towards their eventual listing.\n\nThe 19b-4 approvals for spot Ether ETFs came about five months after similar approvals for spot Bitcoin ETFs, a first for the industry.\n\nPrior to Gensler’s comments, Bloomberg ETF analyst Eric Balchunas had predicted a July 4 launch date for the spot Ether ETFs.\n\nUnlike the spot Bitcoin ETFs, the decision to approve spot Ether ETFs was made by the SEC's Trading and Markets Division rather than through a vote by the five commissioners.\n\nGensler, who is expected to serve as SEC chair until 2026, did not specify an exact timeline for the final approvals.\n\nWhat’s Next: The regulatory landscape and its impact on digital assets will be a focal point at the upcoming Benzinga Future of Digital Assets event on Nov. 19.\n\nRead Next: Potential Email Vendor Breach Puts Crypto Companies On Alert\n\nImage: Shutterstock"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQRExHRDd0ZFhpOVZQazRVZ0kwal9Mck83TTA3NF9GTEtuSmNQYUZ1Z3dmNmVwRUFMcVVhQWtOR0F0dWxSNEFrWW1YY3Zub2tGdGFPU1UxaHNNVEt4eW1ZQlQzMGxRY2ZuYnpabHhUT2syZEdGWFJ5UEM0cndHMHJKU2NVUFDSAYwBQVVfeXFMTWNLcW5sUjl4ejVuMjJ0cno3RFdCektvV3huYjhyOGJIUEJuZTB1MzQ0R05oX3FLRkhZLUR5MU5kWFFRZXNtYVp0WkVmVVdRRkxEMzFGVkpxc0gtdVZRQ1lJaUluRnltQzctNEdlUjk5MDdJWk9ob1lwWVpjbk9va2pDQzlhZTEwMFhObTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Franklin Templeton Eyeing New Crypto Fund After Ethereum ETF Approval: Report - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWall Street asset manager Franklin Templeton is considering launching a new altcoin-focused crypto fund.\n\nThe private fund would be catered to institutional investors, and may also potentially offer staking rewards, according to a report Thursday in The Information citing people with direct knowledge of the plans.\n\nFranklin Templeton, the American finance behemoth that manages some $1.6 trillion in assets, is no stranger to crypto. The firm has been involved in digital assets since 2018; it launched a spot Bitcoin ETF in January, and will be among the first issuers of recently-approved spot Ethereum ETFs.\n\nBy diving beyond those two blue-chip cryptocurrencies into the realm of altcoins, the Wall Street titan appears to be signaling a comfort with the types of tokens that the U.S. Securities and Exchange Commission (SEC) has long classified as unregistered securities.\n\nAD\n\nAD\n\nBut Thursday's move comes, crucially, in the wake of the SEC’s abrupt approval of spot Ethereum ETFs last month—despite the regulator having allegedly classified Ethereum internally as an unregistered security for over a year. Experts took the about-face to signal the proverbial opening of a floodgate, and predicted that other altcoins will soon become integrated with American financial markets.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5iUGJFRW83Y1ZkblNNTzBPc3ZTWHZVWkNWYl8zQzk5S3lVdWtLMzc5MjJJdlJpLTYwTEN0dE8xQ0tFZ1VIVkJ2ZV8tak0zYlk2YlQ1MzAxMU5JQmZzODEwVG5mU1M1VUJWWnk2bVFEeUFkYklkRDROc0ZldV9CWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs To Attract Over $4 Billion In Inflows, Says K33 Analyst - Yahoo Finance",
        "content": "Ethereum ETFs To Attract Over $4 Billion In Inflows, Says K33 Analyst\n\nIn late May 2024, the Securities and Exchange Commission (SEC) moved the spot Ethereum ETF applications into the next stage of deliberation, opening the door for the funds to begin trading as soon as this Summer. The approvals surprised many, as the SEC had not addressed the issue much after approving spot Bitcoin ETFs in January. With the approvals, many are speculating on what the ETFs could look like once they begin trading. Some predict they could be wildly successful.\n\nDon't Miss:\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nHolding 0.001 Bitcoin could make you a multimillionaire, according to Fidelity director — but for how long?\n\nMany consider net inflows a key metric for determining an ETF’s success. This figure provides a strong indication of the ETF's performance and sustainability over the long term. According to market analytics and brokerage firm K33 Research, Ethereum ETFs could gain up to $4.8 billion in net inflows in the first five months after launching.\n\nThe firm made the prediction using current figures on futures-linked Ethereum ETFs and comparing them to Bitcoin products. Additionally, K33 Research believes Ethereum will begin to outperform Bitcoin and the broader crypto market after the ETFs launch. This would align with Bitcoin’s performance following the approval of Bitcoin ETFs when BTC's price increased more than 60% and reached all-time highs.\n\nJ.P. Morgan also predicted the ETFs would bring in $3 billion in inflows in the first five months.\n\nThe spot Bitcoin ETFs have set a high bar for ETF launches. The 11 ETFs were the most successful in history, accumulating more than $12 billion in net inflows in just over two months. The funds hold over $30 billion in total inflows, netting around $15 billion after accounting for outflows from Grayscale.\n\nMany believe the Ethereum ETFs will be successful, albeit less so than the Bitcoin ETFs. Bitcoin is considered the safest bet among crypto investments due to its size and longevity. While Ethereum has similar characteristics, Bitcoin's greater degree of these attributes makes institutions more open to Bitcoin investments.\n\nDespite Bitcoin's dominance in the crypto market, Ethereum has established itself as a solid #2 token, emphasizing decentralized finance and community-built applications. In the long run, these use cases could potentially elevate Ethereum over Bitcoin, as Ethereum may have more room to adapt to changing market conditions. However, as it stands, Ethereum is still behind Bitcoin, which is expected to be reflected in ETF trading figures.\n\nStory continues\n\nRead Next:\n\nIf you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum ETFs To Attract Over $4 Billion In Inflows, Says K33 Analyst originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5rWWppU2Rnbm1UVFF4UWduNms5amlGdk9ndU10UWQyMHlEZ1QxS0FtNUNmOThhNy03NkcySm83bERoLXpTRnZ0NEt4YXZlVmdnR3pFRHF1OWlSQjRwMDB5VGZzcF9MdW96TXBwNHpKMXB6LUNWNnNoOTc0NEbSAYQBQVVfeXFMUG9JRFZjSG0waUVzdGxIVjZuOENVc2ozODhQR3JUM01yNm9YeEJKd3NXRTNyZGwtYnFyaTVlckluaE5JREtyeVAweHlwNWM2Vl9kTzdjWGpOVVp0S0txeEN5Znd1aUpRc3FfVWNZM2tWMXpPN1lIWG9VNnlxY2g5MHZfT0p0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "'The Sandbox' Ethereum Game Valued at $1 Billion With New Funding - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Sandbox, an Ethereum metaverse game platform, announced Wednesday that it has raised $20 million in convertible promissory notes at a $1 billion valuation. That makes the long-running project the latest crypto “unicorn,” based on the billion-dollar valuation.\n\nThe latest funding round was led by Kingsway Capital and Animoca Brands; Animoca, a prominent metaverse investment firm, is also the parent of The Sandbox’s operating company, Bacasable Global Limited. LG Tech Ventures and True Global Ventures also participated in the round.\n\n\"We are deeply honored by the continuing commitment to the vision of The Sandbox, and we're incredibly excited about the future of composable user-generated content games,\" said Animoca co-founder and executive chairman Yat Siu, in a statement.\n\nWith the new funding in tow, The Sandbox’s development team said that its key priorities include improving creator tools, adding new social and gameplay features, and developing a mobile version scheduled for 2025.\n\nAD\n\nAD\n\nThe Sandbox is one of the most prominent blockchain games, thanks to partnerships with over 400 celebrities and brands—including Snoop Dogg, Gucci, and Paris Hilton—and previously immense demand for in-game land plots sold via NFTs. In fact, someone paid $450,000 worth of crypto for a land plot near Snoop Dogg’s metaverse mansion in 2021.\n\nThe game’s SAND token on Ethereum remains one of the 100 most valuable cryptocurrencies in the world based on market cap, per data from CoinGecko. However, the price of its NFT land plots has fallen sharply since metaverse hype peaked in early 2022—from 3.9 ETH ($11,700) to 0.08 ETH ($300) today.\n\n\"Our mission at The Sandbox is to develop creative tools and technologies that bring fairness and new opportunities for all types of creators in the open metaverse,\" said The Sandbox co-founder and CEO Arthur Madrid, in a release.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward.\n\nAD\n\nAD"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQSW9WUFJfb2s2V1R0bTVrSzdJTFVtaWF2eEg1ZHBJQTZzMkRUSm9vOHpiUzZQRk1IQUNERUh0RkNPa3F2UllWSXdPa191ZXh1UjJXNXItU1hHWDJBMmRiSktqLXpkdjBzbFhXQXVmRXRXYUN1aGYxN3lva21ZV3hFbUZKeG1yRjVNY1FTUmF0VVgySDgybmo5RDdTX1BMQThXSkpZdkFLb0o0eU9jZ0sya0xB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum’s Vitalik Buterin is Unhappy With This Cycle’s Celebrity Experimentation - Unchained",
        "content": "Celebrity memecoins have been the latest craze to dominate the crypto space, but Ethereum cofounder Vitalik Buterin says there needs to be more to these projects than what’s currently on offer.\n\nVitalik Buterin would prefer if celebrity crypto projects more value if they had some fun mechanics that go beyond just trading a token.\n\nIt’s been a few weeks since celebrity tokens broke into the crypto space, with famous personalities like Davido, Iggy Azalea, Rich The Kid, Trippie Redd, and Caitlyn Jenner all launching memecoins that saw large boosts of trading activity.\n\nIn most cases, these tokens associated with celebrities saw wild upswings in price, followed by a sharp and rapid plunge in value. One exception is Azalea’s Solana-based MOTHER token which surged 2,260% after an initial decline and now sits at a market cap of over $100 million.\n\nThe frenzy around the token prompted a Placeholder VC partner Chris Burniske to tweet that if MOTHER breaks into sustainable value creation it would also be “the mother of this cycle’s celebrity experimentation.”\n\nBurniske’s comments invoked a response from Ethereum co-founder Vitalik Buterin, who said he was feeling “quite unhappy with ‘this cycle’s celebrity experimentation’ so far.”\n\nIn order for a celebrity crypto project to gain his respect, Buterin said it would have to offer form of public-good end goal, rather than simply enrich the celebrity who issued the token and early adopters.\n\nIn his view, these projects would have more value if they had some fun mechanics that go beyond just trading a token.\n\n“As much as I dislike token voting DAOs, at least they give *something* for people to do and organize around. The DAO should not fully decide the agenda, but it can have some influence,” Buterin said.\n\n“Make something that lasts 10+ years, rather than bubbling around for a few months and then being forgotten.”\n\nIt is worth noting that Buterin doesn’t have a problem with memecoins itself, saying in a March blog post on the subject that he valued people’s desire to have fun, and would rather the crypto space swim with this current than against it.\n\n“I want to see higher quality fun projects that contribute positively to the ecosystem and the world around them (and not just by “bringing in users”) get more mindshare,” he said at the time.\n\nData from Kaito AI shared last month shows that memes were the most dominant crypto narrative after AI, growing its mindshare within the market by 53% from the start of the year until May."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbkhFSlBzaGk0MXMyczZBenNacUdJRjRtYW1iUHAwaXBLMHNnV0FXYk5Wb3RsYVMwa0p6UjhrSTdmSUdmam1pZ1JIM1haVnRrTThRMGw5aWpzUGVjWWVicmVfVDdsU202VFk0dmkzUGxYOV9qcnpSN242aFpYMTQxSGh1cDc1dmNCSDNJVVVlODdmUUxOazh1V1E0WEs3UU5wV05OV2lDb2xkcnPSAbABQVVfeXFMT3RxT0xhTFZ1R1FhM2xNY2s3dHZQakJIN0g5WU1ULWd3Q2lkemdnelExSUlWZzRNZnZBdXdXaG8tal9BZWVBdFRSU0FvRnk5YTg2UWhvRXFrUnBaUV9BdTlIMzBOemRqalQ2NjVJNmoyWjRoQWpKRE9fNmpPbGRlSVVLQUFkQ2FWUktRaVRlMEFoc0t1aHFXVEltTF9RdjQ0d3JuZVF0UVBVT0dMZ0FUdVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Cathie Wood's Ether ETF Pullback Is Likely Due to Fee War - CoinDesk",
        "content": "Seyffart also believes that Ark made the decision based on the low fees. “It’s possible that the partnership made a ton of sense, particularly with the demand for bitcoin ETFs,” he said. “But after the fees got so low right off the bat, there might simply not have been enough money from fees to go around for both firms, particularly on an Ethereum ETF if they are expecting less demand versus bitcoin ETFs.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNbVdxLURNenRVQjIxMFI0SWphdVBfQzlwQ09qa0MxNjM0ZkMybkZwN211MkhKTG40QUN5T05mWXNTMzdjLUE5bV9NV0dpNzU1WmowT0NMUXFiVFZvTzJvS285X3ZSQ1hxbW5YZDFfeXU5eXJGVmFWa0JqWG1XTEZDSkdpblRKaWdaZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "VanEck predicts ETH will hit $22,000 by 2030 - CryptoSlate",
        "content": "VanEck believes Ethereum (ETH) will be worth roughly $22,000 by 2030, the asset manager said in a comprehensive analysis published on June 5.\n\nThe forecast, developed by the firm’s Digital Assets Research team, led by Matthew Sigel, highlights Ethereum’s strong growth potential within both traditional and cryptocurrency-focused portfolios.\n\nVanEck’s analysis attributes the optimistic price target to Ethereum’s expanding role as a high-growth, internet-native commercial system that could disrupt traditional financial sectors and Big Tech platforms.\n\nThe report emphasized Ethereum’s significant user base and economic activity, noting that the network currently supports approximately 20 million monthly active users, facilitates $4 trillion in annual settlement value, and oversees $308 billion in digital assets.\n\n$2 trillion market cap\n\nVanEck’s valuation model for ETH is based on a forecast of $66 billion in free cash flows — the amount of money generated by a blockchain network — by 2030, with a 33x valuation multiple on those cash flows.\n\nThe model considers Ethereum’s potential to disrupt various business sectors, including finance, marketing, infrastructure, and artificial intelligence (AI).\n\nAccording to the report, the Ethereum network is poised to capture substantial market share from traditional financial markets and technology giants.\n\nIf Ethereum maintains its dominance among smart contract platforms, VanEck sees a credible path to generating $66 billion in free cash flow — the amount of money generated by a blockchain network — for token holders — supporting a $2.2 trillion market capitalization and a $22,000 price per ETH by 2030.\n\nRevolutionary asset\n\nThe company emphasized ETH’s broad use cases, stating:\n\n“We believe ETH is a revolutionary asset with few parallels in the non-crypto financial world.”\n\nVanEck cited ETH’s role as “digital oil” consumed in on-chain use and called it “programmable money and a yield-bearing commodity.”\n\nIt also referred to ETH as an internet reserve currency that prices activity and assets in Ethereum’s $1 billion ecosystem and connecting blockchains.\n\nAccording to the report, Ethereum generated $3.4 billion in revenue over the past year, surpassing some web2 apps like Etsy, Twitch, and Roblox. Meanwhile, its 20 million monthly active users surpass Instacart, Robinhood, and Vrbo.\n\nVanEck added that ETH offers cost-saving features, better interconnectivity for social applications, the opportunity to share earnings with end users, and a basis for AI applications.\n\nInvestment risks\n\nWhile the report is optimistic about Ethereum’s future, it also emphasizes several risks associated with investing in ETH.\n\nOne major concern is Ethereum’s reliance on speculative activities, which could lead to significant downside risk if market sentiment shifts.\n\nRegulatory changes pose another risk, as they could classify ETH as a security, thereby imposing stringent legal requirements on Ethereum-based businesses. The competitive landscape is also a threat, with emerging technologies like Solana challenging its market dominance.\n\nAdditionally, government actions to control non-sovereign financial systems could negatively impact Ethereum’s growth prospects.\n\nMentioned in this article"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTE41LWpYakRJU2M5UXVKWTR4YUs2bFczakxCWnRpX0pPT1JBZ2c3VVlfZC12Q0JXamZKRDJmaVc2aWRpRTg5YWRidE1hWVl1WC1XUy1fTVR3dmw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "What are Spot Ethereum ETFs? (Updated 2024) - Investing News Network",
        "content": "Meagen moved to Vancouver in 2019 after splitting her time between Australia and Southeast Asia for three years. She worked simultaneously as a freelancer and childcare provider before landing her role as an Investment Market Content Specialist at the Investing News Network.\n\nMeagen has studied marketing, developmental and cognitive psychology and anthropology, and honed her craft of writing at Langara College. She is currently pursuing a degree in psychology and linguistics. Meagen loves writing about the life science, cannabis, tech and psychedelics markets. In her free time, she enjoys gardening, cooking, traveling, doing anything outdoors and reading."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE8xSkUwXzJfTTBLNlFWaHNVZU8yWFJjdXNremFXUGFKRXduWWpKZXdaZG5lUjVJT3M4aHIzWG5fWGNWU3dGNElDRDl0NktWRkFrNDZpSDlrWGtiQmk3ai1oUzlnYWh0bm9NcFEyc0Y3cVVpWXVwX21R0gF_QVVfeXFMUEkwTk1TVXRTNmY3aVo4VGFzVG5VRUQyYmFYS3lsT0NjSVFEWWhPaUE1RG5IM3IxOUwtUVRqQkRoMmlNeEJ1LU1zVm5DSWxhclpIbDVDenA2WHhoNDYzUFZjckdfYnNHclY0X0VqME9JUE5odm4temNIeG5FS01zMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Network Ronin Launches ‘Forge’ Program to Onboard More Games - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSky Mavis, the creator of the Ronin sidechain gaming network on Ethereum, announced on Thursday the launch of Ronin Forge—an early access program that will provide grants and support for up to six studios to build “experimental” crypto games on the network.\n\nAdmitted studios will receive a $50,000 grant, access to Ronin's infrastructure, and the ability to tap into its active gaming community.\n\nRonin is the network behind such games as Pixels, Axie Infinity, and the upcoming Ragnarok: Monster World. It’s currently a closed ecosystem, with Sky Mavis deciding which teams can build on the network, but the studio plans to eventually open up the network in the future.\n\n\"Ronin Forge is the next step in further opening up Ronin for builders. By offering grants and access to the Sky Mavis ecosystem, this will serve as an experimental ground for developing the next generation of Web3 games,\" said Sky Mavis co-founder, COO, and Chairman Aleksander Leonard Larsen, in a release. \"We aim to encourage innovation and build network effects, inviting like-minded studios to join on our path towards scaling the Ronin Network.\"\n\nAD\n\nAD\n\nHigh-performing Forge teams may be elevated to \"Studio Partner\" status, receiving advisory support and up to $500,000 in additional funding from Sky Mavis.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOcWhCcDFYcTdrLU9rR2lJUHJiUUFzUl92QTFWMVpHQWJWNXJXY0lTT0hNTWw2TWZzYXNvQlNFYjVRMGFoR2tPSXdKWjdHU0NyblpLbW16LXYzNFZaSF95ZEtrcV9oQ0ZIaXItT0lRRHYzR3BDaFNIVExCOExrd3gwM3dCOHp0Nnc4QW5RQ0w5WkJEREdrQll1bHpUZXNUX1ZHcWxOb0dsc2E0Z2hsd3BhUjNaWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF could be as popular as that of Bitcoin, OKX president says - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nEthereum ETF could be as popular as that of Bitcoin, OKX president says\n\nHong Fang, president of OKX, weighs in on the prospects for cryptocurrencies and a forthcoming Ethereum ETF."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQcWJraFlnaFNBam1XRnJIdkxSNDB6M2t2N04wNEhkWHhhbnJKQlhPQnhYelJGd1E1M200ek56bVBtZFFkaGNmemtncU90T2FvNUtWVVBVMVRFeTI2bXNIdGhPVWE4eHZIYmNiNHhmVzJHcmlNa2VXcGVmN0UtVF9rMzZDSGZiZnhk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Responds To Celebrity Memecoins: 'How Do We Push Things In A Better Direction?' - Yahoo Finance",
        "content": "Ethereum Co-Founder Vitalik Buterin Responds To Celebrity Memecoins: 'How Do We Push Things In A Better Direction?'\n\nWhen Vitalik Buterin helped found Ethereum in 2013, he envisioned using the platform and blockchain technology as a force for good. He envisioned the network as a means to increase social welfare and provide users access to valuable projects. It makes sense, then, that Buterin has criticized the meme coin craze overtaking the crypto community in 2024. Buterin stated he is not a fan of the meme coin frenzy and prefers the community push \"things in a better direction.\"\n\nDon't Miss:\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nHolding 0.001 Bitcoin could make you a multimillionaire, according to Fidelity director — but for how long?\n\nButerin's comments were in response to a post on X regarding the Mother Iggy (MOTHER) token, a project centered on rapper Iggy Azalea. \"If $MOTHER breaks into sustainable value creation, it'll also be the mother of this cycle's celebrity experimentation,\" said Chris Burniske on X.\n\nThe Ethereum co-founder responded, stating he is \"feeling quite unhappy about with [sic] ‘this cycle's celebrity experimentation' so far,\" and that he can respect the means \"if the end is worthy (health care, open source software, art, etc).\"\n\nButerin argues that the creators of these tokens use celebrities' names to attract investors while providing little value in return. He contends this practice detracts funds from more useful projects and contradicts his original vision for Ethereum.\n\nCelebrity memecoins have recently become popular among crypto investors. Tokens centered around celebrities like Donald Trump, Caitlyn Jenner, and Elon Musk have attracted billions in investment without providing much value.\n\nWhile most of these meme projects are antithetical to Buterin's grand vision for Ethereum, he mentioned one project that used its funds to add value, though not to the scale he hoped for.\n\n\"Ashton and Mila’s Stoner Cats was vastly more honorable than anything we’ve seen from this 2024 celebrity memecoin era — at least there was an actual show being funded,\" Buterin noted. The Stoner Cats project featured an NFT collection, which funded an animated show. The project raised enough to hire Mila Kunis, Ashton Kutcher, Chris Rock, and Buterin himself as voice actors.\n\nStoner Cats is an example of how crypto project funds can create valuable content. However, the SEC sued Stoner Cats over its NFT offering, resulting in a $1 million civil penalty.\n\nWith many projects aiming to drive up token prices or make quick money, Buterin asks, \"How do we push things in a better direction?\" It will be interesting to see how projects respond to his call-out.\n\nStory continues\n\nRead Next:\n\nIf you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Co-Founder Vitalik Buterin Responds To Celebrity Memecoins: 'How Do We Push Things In A Better Direction?' originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQZzV2ZkFqcVpaa21tLWpkU0tmbjhuNFNqbmFHV3lqOXhBREx4VlhaNVJKX2NsVkNaSm9XLU51bDBrUEhxRVpyTUpra2x5Z3pxM1pjaTZ3MWhOYkNZcVhlSEFMR254NlVMR0hLUmNQaFowS2dqblhESk5UYUFGVkxrd2YweEh3d2h2QW9nbUttT2FWTGozOHZtd3lHckhoM09ka1l1eWE5dFN6Z0tXSTYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "SEC chair Gensler says spot Ethereum ETF launch timeline depends on applicants’ speed - CryptoSlate",
        "content": "SEC chair Gary Gensler said the timeline for spot Ethereum ETF launches depends on how quickly applicants respond to the regulator’s questions and comment on reasons for approvals.\n\nGensler told Reuters on June 5 that the firms are “self-motivated” to answer SEC comments and can determine their responsiveness.\n\nPast reports suggest that the SEC will comment on recently amended S-1 registrations from eight spot Ethereum ETF issuers. The applicants will then file further amendments before launching each product.\n\nGensler did not say whether the process would take weeks or months.\n\nGrayscale influenced ETH stance\n\nThe SEC chair said Grayscale’s legal win, which paved the path for spot Bitcoin ETF approvals, had also influenced the SEC’s stance on spot ETH products.\n\nGrayscale argued for approving Bitcoin ETFs based on correlations between Bitcoin spot and futures markets, as the SEC approved Bitcoin and Ethereum futures ETFs in previous years.\n\nGensler previously said that the legal outcome led the SEC to approve the spot Bitcoin ETFs in January. He did not connect the outcome to the SEC’s stance on ETH until recently.\n\nGensler told Reuters that market correlations were key to the SEC’s approval of the latest spot Ethereum ETFs. He said:\n\n“[SEC staff] looked at these (ether) filings … the correlations are relatively similar to the correlations in the bitcoin space.”\n\nGensler spoke to CNBC\n\nGensler made comparable comments in a June 5 CNBC interview, saying that spot ETH ETF launches could “take some time.” He did not speculate on a launch date.\n\nGensler also told CNBC that the SEC compared the spot Ethereum market to the Ethereum futures market in its latest decision. Gensler said that ETH futures ETFs have traded on the Chicago Mercantile Exchange (CME) for more than three years.\n\nIndustry experts have speculated on a launch date, with Bloomberg ETF analyst Eric Balchunas predicting that the ETFs could launch by the end of June and called July 4 an over/under date.\n\nPolymarket, which represents community bets based on staked crypto amounts, displays 57% odds that the funds could begin trading by July 4.\n\nMentioned in this article"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNTXY5LTlxRlNTWl91UVhVdnFtNGpCX2RCTWhiMHVtQjF2LU1FVkRxZTF2YmhsRktJYUx3NEhTS0QwNlRsN2JBNUE5cENGWFN2bVNldjVXMF9rV0FvTjlnUlU2ZHRUcVhXa0plQkNDVzFNZGp3ZHNlYm1zMWhqcnkxU1JQWU5FNnktVWfSAY8BQVVfeXFMT2hpeFJYVGpDYXowaDVkcWpHUW5MNHE0TVZGTU5oYTg3eXVIWWFwUTdmOTlERHhtMHU0RFJ6ZnJsa0l5alJDWElmWU84YlJ2TWcwX3JXdmQxeGFEZ21xSUtRVUpURVRXLU1PZEhhYWpWalprYVFMdmZpWGxQbW5fYTN0Zy1FZmdSZTNmZ1p2c0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "VanEck Sees Ether Hitting $22K by 2030 - CoinDesk",
        "content": "\"We anticipate that spot ether ETFs are nearing approval to trade on U.S. stock exchanges,\" according to the report. \"This development would allow financial advisors and institutional investors to hold this unique asset with the security of qualified custodians, and benefit from the pricing and liquidity advantages characteristic of ETFs.\""
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVDVSY3pGZGkyeUJFUHdLTi1vNlB3RmktUHNVWVdJV3UyZ0xpUHo1ejd6ekZUYjdTZ3pBaE1vcEVLSHZaWmdJLTZNTlB2UnhfcHdlZFJDRDZhUHFSdGMtTTh6YlU5M3JiSVdiQ1ByYjk1NnF1ZWlkM2dHRGRPY0VTcjVqYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "3 Top Cryptos Worth Holding Beyond Bitcoin and Ethereum - The Tokenist",
        "content": "Neither the author, Tim Fries, nor this website, The Tokenist, provide financial advice. Please consult our website policy prior to making financial decisions.\n\nAmong thousands of cryptocurrencies, it is clear that Bitcoin (BTC) and Ethereum (ETH) took the public spotlight and are likely to take more capital inflows in the future. So much so that even Ethereum is poised to become an institutional investment vehicle via exchange-traded funds (ETFs), joining Bitcoin.\n\nOut of a total $2.63 trillion market cap, including stablecoins, ETH and BTC make 70% of the crypto pie. Year-to-date, Bitcoin and Ethereum are neck and neck, having gained 60% and 62% value, respectively.\n\nHowever, the larger the market cap, the harder it is to move the price upwards, just like in the stock market. This is why many low-cap memecoins performed well during 2024, driven by speculation and memory.\n\nYet, engaging in memecoins is exceedingly risky. Most traders can’t tell if they are riding from the top to the bottom, holding the devalued bags, or riding from the bottom to the top, enjoying substantial profits. After all, memecoins’ value is inherently unclear, which makes them so speculative in the first place.\n\nTo that end, prospective crypto investors should look into these infrastructure cryptocurrencies, which are backed by developers, funding, and clear goals.\n\nImmutable X (IMX)\n\nImmutable X (IMX) is an investor’s exposure to blockchain gaming. While Ethereum is a blockchain network for issuing tokens and smart contracts to power decentralized finance (DeFi) with dApps, it relies on layer 2 networks to scale. Immutable X is one of those networks.\n\nOwing to StarkWare’s zk-rollups technology, Immutable X facilitates zero gas fees for end-users. This contrasts Ethereum’s expensive and volatile gas fees for even simple token transfers. In turn, this is a game changer for game developers who wish to deploy their products at scale.\n\nFor instance, if a game has tradable in-game assets as non-fungible tokens (NFTs), like cards or collectible creatures, traders don’t have to worry about long confirmation times and heavy transaction fees. This boosts the in-game economy and player experience, paving the way for blockchain gaming.\n\nPresently, there are over 300 games in Immutable’s funding ecosystem worth $1 billion over 20 marketplaces. Previously known as Fuel Games, Immutable is the parent company in charge of the Immutable X framework for developers to launch their projects with low friction.\n\nThe cryptocurrency itself, IMX, is the utility and governance token of the network. Akin to shareholders of companies, IMX tokenholders get a say in the development of the platform with a voting mechanism. Additionally, developers using the platform pay 2% fee in IMX tokens.\n\nFor comparison, game developers deploying their games on Steam suffer a 30% sales cut. The total IMX token supply is limited, just like Bitcoin, but to a greater extent, it has 2 billion IMX tokens, of which 74% are already in a circulating supply.\n\nYear-to-date, the IMX token has gained 12% value after price correction but 393% over the last year. Given that the Immutable X network is Ethereum-adjacent, the token is likely to revisit previous highs with the prospective launch of ETH ETFs. According to Fortune Business Insights, the blockchain gaming market is forecasted for a 21.8% CAGR between 2023 and 2030.\n\nJoin our Telegram group and never miss a breaking story.\n\nAvalanche (AVAX)\n\nEthereum’s software engineering path relies on layer 2 networks to offload the transaction burden from the main network. Avalanche (AVAX) is a competitive, versatile network that picked another approach.\n\nInstead of users having to jump through network hoops with their Web3 wallets, Avalanche itself has a modular design via subnets. Each subnet has its own rules and consensus mechanisms, but they all operate under the high-throughput Avalanche consensus protocol.\n\nIn addition, Avalanche boosts scaling with three interoperable blockchains within the network. X-Chain, C-Chain, and P-Chain tackle different aspects of the network, like staking, smart contracts, and asset creation.\n\nThis leads to a greater unified experience for the end-user, who still enjoys fast execution and low fees. Moreover, Avalanche’s C-Chain ensures compatibility with Ethereum, enabling users to transfer digital assets with Avalanche Bridge via the Core wallet.\n\nAttesting to Avalanche’s approach to blockchain design, several banks used it to test their future tokenization efforts, including Bank of America, Citi and JPMorgan.\n\nPowering the network’s economy, the AVAX token is limited to 720 million, of which 55% is in circulation. AVAX token holders get a say in the issuance of the remaining supply. Year-to-date, AVAX is down 14%, making for a solid entry point after a one-year value growth of 160%.\n\nFetch.AI (FET)\n\nJust as Nvidia (NASDAQ: NVDA) reaped the AI hype, Fetch.AI did the same in the blockchain world. The FET token gained 794% value over one year, or 194% YTD. Moving forward, this is crypto investor’s main exposure to the tokenization of AI projects.\n\nThat’s because Fetch.AI (FET), SingularityNET (AGIX), and Ocean Protocol (OCEAN) will all be under the umbrella of the SuperIntelligence Alliance, with its new universal token ASI, poised to merge the market caps of FET, AGIX, and OCEAN tokens.\n\nAfter the merger into ASI, FET tokens will be limited to a 2.63 billion supply. Mirroring the decentralization efforts of finance to counter banks and central banking, the new network’s purpose is to monetize AI development openly and transparently.\n\nThis includes raising funds for AI projects with ASI tokens, paying transaction fees, using it as a governance token for voting, and using it as a utility for open-source AI development. After the merger announcement in mid-April, the FET price has been moving sideways, having dropped by 3%.\n\nWhich types of tokens do you prefer as your main exposure: sound money, generalist DeFI, gaming, or something else? Let us know in the comments below.\n\nDisclaimer: The author does not hold or have a position in any securities discussed in the article."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPRmIweExRNVBDeGIzMTVDVnBraHQ3Q3FBTndQeU1xUTN1QW5YY3ZJMVRmQ21UU2txNFZyUGZWZmR4dmp5UmktWlYyWW92YXc1Y0RQeVRMRGFQM0FtRVViMWZUUUFpVExwdlJ6V2tIaUpEclFlRDRnbGtFTUJEVE9mRGxVUGxUOFMyNTZiaFVoQ1RCdlEyeFdZZjhUMHFwNE5wYmJTS3gyZ19QSzRVVHZGRWVlV2gwdFlZdVE0eEgzaHhlb3pmZ0R0QVpZaWVmTVh2emhIMU90VkU3aVhuNVhfUjhidWo0T3lL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Could Soar To $22K By 2030, Predicts VanEck — Investment Giant Says Spot ETFs 'Nearing Approval To Trade' - Benzinga",
        "content": "Analysts from the investment management firm VanEck have updated their Ethereum ETH/USD price prediction for 2030, setting a new target of $22,000.\n\nWhat Happened: VanEck, which is currently seeking approval to list a spot Ether ETF, announced the revised forecast on Wednesday. as per a report by The Block. The new price target is based on the potential of Ether ETFs, Ethereum’s scaling progress, and on-chain data analysis.\n\nThe VanEck report authors, who hold positions in Ethereum directly or through private funds, believe that Ethereum’s ongoing market share growth and its leading position among smart contract platforms could bolster a $2.2 trillion asset, or $22,000 per coin, by 2030.\n\nThe $22,000 price target is the authors’ base case price target. The bullish and bearish price predictions were $154,000 and $360, respectively.\n\nWhy It Matters: VanEck is one of several Wall Street firms aiming to list spot ether ETFs in the wake of successful spot Bitcoin BTC/USD ETFs launched earlier this year. The SEC gave the green light to spot Ether ETFs last month.\n\n“We anticipate that spot Ether ETFs are nearing approval to trade on U.S. stock exchanges,” said the VanEck analysts. They estimate that these ETFs could draw between $3.1 billion and $4.8 billion in net inflows during their first five months of trading. The optimism is in contrast to SEC Chair Gary Gensler’s position, who hinted at delays.\n\nThese estimates come on the heels of recent projections by cryptocurrency analyst Flow, who fixed a base price target of $5,294 for ETH by the end of 2024. The bullish and bearish price predictions were $6,730​ and $4,428, respectively.\n\nPrice Action: At the time of writing, ETH was exchanging hands at $3,863.06, following a 1.37% increase in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next: Will Dogecoin’s Price Discovery Follow Bitcoin Like It Did Historically?\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUTF1a29iSHA0OFVMWVVSTUxjNF9OdG45aVE5WS1CSlRwSE0tTm9iUFlQUU1US1g2N1BhQ1J3bFZNMXhyU1ZHMjc5ZVRmdFlIbF9PUXVILXZFTXdZSmJnVUR6bkowT0ZGQ2owM1FEU1dfOGdFeTRvWVFnRXpZYzJESDAtQU1Xdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "VanEck Raises Its 2030 Ethereum Price Target to $22,000 - Watcher Guru",
        "content": "Investment management company VanEck is raising its 2030 Ethereum Ethe (ETH) price target to $22,000, following recent developments around the asset. “We’ve raised our 2030 ETH price target to $22K, influenced by ether ETF news, scaling progress, and our read of on-chain data,” the company wrote in a post to X. “Additionally, we’ve analyzed how ETH and BTC perform in both traditional and crypto-only portfolios for optimal returns.”\n\nJUST IN: $90 billion asset manager VanEck predicts Ethereum will reach $22,000 by 2030. — Watcher.Guru (@WatcherGuru) June 5, 2024\n\nVanEck is one of multiple asset management firms with a Spot Bitcoin ETF and a pending Ethereum ETF application. With the recent approval of Spot ETH ETFs by the SEC, full approval by the regulator is due soon, and thus, the hype around the asset is rising. Due to these updates, many price predictions are now bullish around Ethereum, and VanEck is updating there’s as well, setting a new target for the asset by 2030.\n\n“Driven by a strong value proposition to entrepreneurs, the Ethereum network is likely to continue its rapid market share growth from traditional financial market participants and, increasingly, Big Tech,” VanEck says. “Should it do so while maintaining its dominant position among smart contract platforms, we see a credible path to $66B in free cash flow to token holders supporting a $2.2 trillion asset, or $22k per coin, by 2030.”\n\nAlso Read: NVIDIA Surpasses $3 Trillion Market Cap, Briefly Tops Apple\n\nHow High Can Ethereum Go Following ETF Approval?\n\nSource: iGaming.org\n\nExperts are predicting the Spot Ethereum ETFs to go live this month, a much faster timetable than that of the Bitcoin ETFs previously approved in January. At press time, ETH is trading at $3,867.65, up 3% in the past week and 23% in the past 30 days. Ethereum’s all-time high is $4,891.70, which it reached on Nov. 16, 2021. Many experts predict that following the approval of the ETFs, Ether will follow Bitcoin’s path and surge to new all-time highs upon the debut of its ETFs.\n\nETH reaching $5,000 will be the first step to $22,000 by 2030 if VanEck’s prediction rings true. However, with the growing popularity of Ethereum and other cryptocurrency assets, a six-year timetable to 6x in price is not too far out in left field."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOM3hiVzZPRmd2SVp3ZWt3ekVuSXZ1bUJJTjdHUTdtTEo1Q0w3RVJDd1VPdVNVLVBLVlJJNDNlS0ctRDNZTi1idVJUd1V1ZEtqQXp3NGRaUnpMZHhSUmpWSmJMOFZxWUlFWmpVWktjb2dzZ3pabXVkN3hjNEltaFB4WFpkZnpZaWxLcms0OTM2MHZmSDVIUEVkZXAwZHZld9IBowFBVV95cUxNSGZ6c28wMjlhVVNVcW9OQV9PYXJyNER1Q0RpUjZ2MWpNMWVTalJleUZaanpBM3pINm5DV2RleFdxbGpKQjRaTFZjc2ppaUZzMjZmR1BZX0hWVzdlNTdQS1hpNzVUTmZiZGJoblFmLWdqUlpjbzVaMG9TMXd3X0tYUVpoS0lVM0NRVHE2aV9mcnNaZ1dkWnJUUHdEbnJUU3VaaC00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Buterin denounces celebrity memecoins, urges purposeful innovation - Forkast News",
        "content": "Ethereum co-founder Vitalik Buterin has voiced criticism against the rise of celebrity-endorsed memecoins, calling for a shift towards cryptocurrencies with substantive, long-term goals.\n\nAddressing the crypto community through tweets on Wednesday, Buterin said that a crypto project needs to “have some kind of public-good goal” rather than enriching celebrities.\n\nHe suggests that while financialization is commendable when aligned with noble causes, many celebrity-driven tokens appear to prioritize immediate financial returns over meaningful objectives.\n\nButerin’s comments come amid a wave of memecoins promoted by celebrities, which he argues lack a clear purpose or vision for the future.\n\nOne of the most popular celebrity memecoins launched recently belongs to Iggy Azalea, an Australian rapper who recently launched the token “MOTHER.”\n\nThe token has a market capitalization of over US$135 million, as of 2:30 a.m. ET, according to DEXTools.\n\nAzalea claims that her project will donate to curing koalas from chlamydia, a major disease threat to the population of the endangered animal.\n\nSome alleged scammers have taken advantage of the celebrity memecoin boom to launch suspicious projects carrying a celebrity’s name."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPSk0yaUVGWlhvaEJzWDVPOTdEOFFnWHBKSFJmRlNjTmJiSjFWbWdUVEczMlNvU2ZqMlhJd2NCWnJQdkpySEkzeFF6ZXFiRjFxemxXOWp4dHRrSXEtRnZiWFprV0lnYURmRW05dHhZUUtrNzVjbXFmZGxIaTdlcXhySmJyOTVJNGRWV3BKQW9PNDk2TWZleGs4UlFPUlNyNUtZZmhVMTNOazJDR2w5NF9fY0FjaXRjS2dqRG9hbkVsd05wY2g2c1Zj0gHMAUFVX3lxTFBkSTJhRHlKY25sWFNGVGZkdE1PdERDYzM1d0FNRXlSUDNTSEhUb3Q4d1ZnWVdDaWM5ZUd6SHh6TTZ5bDZ3eDBralRGNkUwbkZmamF1a2xkaVhZTFY1OTY5aThZWHdCVUpNUUI0VGpZTmpYZnRxVDJNNlRoanZhTE9ESDljRlF4MFdORGw1NHppemZGTjV5aWZYMjVIMVZHaXI1RVlEY2dPWGtZZ1JsX1lMUlNpUng3eEtYMXA5NE9WdUNmd0pQMHJKaW91dA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Hinting at Altcoin Rebound Ahead of Potential ‘Super Euphoria’ Phase: Glassnode Founders - The Daily Hodl",
        "content": "The founders of crypto analytics platform Glassnode believe Ethereum (ETH) may break out ahead of a possible “super euphoria” crypto phase.\n\nThe co-founders of Glassnode, who go by the handle Negentropic on the social media platform X, tell their 63,000 followers that Ethereum against Bitcoin (ETH/BTC) may be printing a bullish reversal pattern.\n\nAccording to the analysts, the ETH/BTC breakout could signal big gains are in store for alts in June, which has historically been a well-performing month for altcoin projects.\n\n“Looking ahead: altcoin market moves. Despite Ethereum’s price action, JASMY, RLC and PEPE show strong rallies. The ETH/BTC chart suggests a trend reversal as Ethereum outperforms Bitcoin following the ETH exchange-traded fund [19b-4 forms] approval. Historically, June has been favorable for altcoins. Will the trend continue?”\n\nETH/BTC is trading for 0.0542 BTC ($3,773) at time of writing, down nearly 1% in the past 24 hours.\n\nThe analysts suggest that digital assets may soon be soaring to new all-time highs (ATHs) along with the stock price of tech company MicroStrategy due to its large holdings of Bitcoin.\n\n“Opinion: could we be heading towards ‘super euphoria’ in crypto? MicroStrategy has been betting their entire business on BTC. And has been successful so far. Its share price already exceeds the level from 2021. How much more could MSTR rally? Elliott Wave structure and Fibonacci gives us a possible target above ATHs from year 2000. This will only happen if euphoria keeps building in BTC and crypto.”\n\nLooking at the analysts’ chart, they suggest MicroStrategy could soar to $3,560, more than 118% of the current value, based on the Elliott Wave theory and Fibonacci extensions.\n\nThe Elliott Wave theory states that a bullish asset often witnesses a five-wave surge where waves one, three and five are upside moves and waves two and four are corrective periods.\n\nTraders use Fibonacci extensions in technical analysis to estimate profit targets and price pullbacks. They are based on Fibonacci ratios.\n\nMicroStrategy is trading for $1,631 at time of writing, up 3.6% in the last 24 hours. Meanwhile, Bitcoin is trading for $70,282 at time of writing, up nearly 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQRmVhdG5jUkRmQ3RXaFBOTk5raUZtMFFwR2hCTk10Tk9wWWVPQmJVMWRxczNzcVgwT0tjZGswa2F1Q3BIZ1M3YVRRMV9ZVEZ3c1dWV1lyVW5oLW9FT1B6c0JkUG5qN2ExU0VaMnhXcFAxdjBnT3hoTnc5SFRta18xQTZhb3NyUEtyeUFsdEdNbi1GejRiX3RieHNyWVU4MW0tLW1B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Global X temporarily slashes bitcoin and ethereum ETP fees to zero - ETF Stream",
        "content": "Global Xhas temporarily cut the fee of its bitcoin and ethereum ETPs to 0% until January 2025.\n\nThe firm has lowered the total expense ratios (TERs) on the Global X Bitcoin ETP (BTOX) and the Global X Ethereum ETP (ET0X) from 0.65% to 0% until 3 January 2025 when the fee will increase to 0.29%.\n\nEurope has seen a three-month pause on the flurry of bitcoin ETF fee reductions across January and February after the launch of the 11 spot bitcoin ETFs in the US.\n\nRob Oliver (pictured), head of Global X Europe, said: “As part of our product management, we want to ensure that our products are competitive when it comes to pricing which is why we decided to launch this fee holiday.\n\n“We are pleased to be one of the most affordable issuers for our ETPs and will continue to explore ways to deliver for our investors.”\n\nBTOX temporarily becomes the cheapest physically backed bitcoin ETP in Europe, ahead of the 21Shares Bitcoin Core ETP (CBTC), which has a total expense ratio (TER) of 0.21%.\n\nWisdomTree and Fidelity International made headline fee cuts in January and February, both cutting the TERs of their bitcoin ETPs to 0.35%.\n\nElsewhere, ET0X will now temporarily match the 0% management fee of the CoinShares Physically Staked Ethereum ETP (ETHE).\n\nAfter 3 January, ET0X will become the third-cheapest ethereum ETP on the European market, behind ETHE and the 21Shares Ethereum Core ETP (ETHC), at 0.21%."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOVzdkNEJRdlg3eXdxcUVmMm5TZUFuNzdCSElxUldLdjdKajBJV1Q1SnRYcjFTYTJRY21SQ1FveEQ0RW5qSXUtZlRfVVJtTlY2UGQ0ZnZNZnFidXBxSzNGTWo4ckp1czZWbHB4TEFKMVRPQkx0NkhZRUF1bFd6LVQ4LVdVUks4NVYyNHVQdjhTbzkxQUN4OUI5MXgxbFpGbjdQYlJicFkwRWZNcTRHZVZrd0QzZW1KUWRYUmV1S0hCUW5UaVdiNlVUOVdOb2FaZ9IB0wFBVV95cUxQODVmaHlaR3JqZl9nSDl6MkhpM2JUVjNLaHQ4ODg1MU40QXNnQzRhN3FtWEVaMWRBM2x0QmFrNnVyVmQ2bDEzZnVqYU9Xd3U4aDAxdHIzLThtZVhYQ3oyd3JFWUdnRkxKenJUM1NJR0VYTUV1Y3ByUFVtendpNXM4dWNrMHpqcFVzaUFFc2FVaUdENmJHM1R4NkJxYXRHWGJCdXl5Z0FlaFNpVmE1bURvSVVuR0JFQXdYaV9hdHgxQXNpTXlZTmVJcmswWlB6ZWJncU00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s Prospects for Hitting New All-Time High a ‘Certainty,’ Says Crypto Trader – But There’s a Catch - The Daily Hodl",
        "content": "A widely followed crypto analyst believes Ethereum (ETH) is heading to new all-time highs (ATHs).\n\nPseudonymous crypto trader Altcoin Sherpa tells his 216,900 followers on the social media platform X that ETH will likely have a massive breakout against Bitcoin (ETH/BTC).\n\nHowever, the trader warns that the 200-week exponential moving average (EMA) continues to act as resistance for the ETH/BTC pair and there may be more downside before a breakout.\n\n“ETH: ETH/BTC has underperformed for a while now, interesting to see that the 200-week exponential moving average is still bearish (last time it was bearish like this was March 2021). To be determined if this recent price action is ‘the bottom.’ ETH to ATH is still a certainty, but I think that this is still disturbing to watch.”\n\nETH/BTC is trading for 0.05384 BTC ($3,841) at time of writing, up nearly 1% in the last 24 hours. Ethereum reached an all-time high of about $4,900 in November 2021.\n\nThe analyst also believes that Bitcoin Dominance (BTC.D), which tracks the percentage of the total market cap that belongs to Bitcoin, will continue to be bullish until the fourth quarter of this year, meaning altcoins could lag behind BTC until then.\n\n“You should probably accumulate shitcoins from now until late Q4. Hard to say what the particular timing is but most alt/BTC pairs are going to continue to go down in my opinion. But once Q4 rolls around, expecting BTC.D to come down and for there to be some alt action.”\n\nLooking at his chart, the analyst suggests BTC.D will reach a peak level at around 64%, about 10% higher than the current level.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Warm_Tail"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1yY3N0WnF1VFZFZ3pnaHdwSzBxMFBjdy1QUXZza1psLU8xcjk5V3k2LWRiX2prbWFacjZYUThUQlluMEUxcm9sdDloaTRHN0lsTVVYQWVOelFEamRoY0lmLUxJaUQzbXRMYnlfTmVSTkRsRzV2T0k1YtIBfkFVX3lxTE5EUFNhYV9MSkc2eDRQR3Q3WEV0ZzJvY2JNMXl4YWE0bVJ5NWtHU05KUFo2bkM4bzVYcUYwSXpyMUZLWjBFQ3ZXbkRCQjliVVh3cktnb0lJM1ZQTW9LcW1xWG5mVHFuY3ZVMmQzakxEMnlnSmxnZU1qYzBLM3dLZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "SEC Boss Gary Gensler Breaks Silence on Ethereum ETFs - U.Today",
        "content": "In a recent appearance on CNBC, SEC Chairman Gary Gensler provided insights into the expected timeline for the review of the spot Ethereum ETF S-1 reports. Eleanor Terrett, a reporter at Fox Business, relayed this as an indication that the review process is expected to be lengthy, potentially causing delays in the approval process for Ethereum ETFs.\n\nAdvertisement\n\nAs a reminder, last Friday marked a significant deadline as spot Ethereum ETF issuers, including industry giants BlackRock and VanEck, submitted their initial draft S-1 forms to the SEC. The regulator will now begin the review process, providing feedback and requesting amendments. Industry insiders expect at least two rounds of draft filings before a final decision is made.\n\n🚨NEW: @SECGov Chairman @GaryGensler says the next step in the $ETH ETF approvals “will take some time,” possibly indicating a potential slow-walk of the S-1 approval process. https://t.co/iwfN9vvmt8 — Eleanor Terrett (@EleanorTerrett) June 5, 2024\n\nIn contrast to the relatively straightforward path of Bitcoin ETF approvals, the altcoin landscape appears to be murkier, according to market participants. While unanimous approval would mark a pivotal moment for the market, recent events have created uncertainty. For example, Hashdex's withdrawal of its application for undisclosed reasons has left market participants questioning the overall trajectory of Ethereum ETFs.\n\nAdvertisement\n\nAttention now shifts to the SEC's stance on the crypto market and the ongoing developments in Bitcoin ETFs, as liquidity in traditional financial markets is hundreds of times greater than cryptocurrency. On one side, that does not mean that investors would want to increase their risk by switching to altcoins, and vice versa - they may shift some funds from Bitcoin ETFs in a search of extra profits."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOckRQU0l3LWdfVnFZZXhoeXR2YzBvaVhUMy1lSHVSOXdDSlB5cFpwSjVJSkNqQlEtQ2tiTl84Vi10bXdCcENjSTQyQ2pFbmRLTmY5UjlQTDV0djhiUmFMVDBDWl9RYmJFMVppZ2hOaXZ3RWY5azhnSnlrcmJWcUdMRWtIT2pycGJvZG1N?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Unlocking Potential: Furrever Token’s 25% Bonus Amid Bitcoin and Ethereum’s Success - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 06, 2024 (GLOBE NEWSWIRE) --\n\nAs Bitcoin celebrates a record $886 million ETF inflow and Ethereum prepares for its own potential ETF boost, the spotlight on cryptocurrency has never been brighter. Meanwhile, Furrever Token (FURR) offers a distinct opportunity with its 25% bonus on new purchases, promising a unique blend of fun and high returns. Could this be the key to capitalizing on the thriving crypto market?\n\nBitcoin’s Unprecedented ETF Inflow\n\nBitcoin's recent ETF approval has unleashed an $886 million inflow, catapulting its price and reaffirming its dominance. This monumental surge reflects the increasing acceptance of Bitcoin among institutional investors, driving substantial growth and setting the stage for continued momentum. The influx of capital is not only boosting Bitcoin's market cap but also enhancing its liquidity, making it an even more attractive investment.\n\nHistorically, Bitcoin has been the bellwether of the cryptocurrency market, often setting the trend for other digital assets. The recent ETF approval signifies a major milestone, providing a regulated and accessible avenue for investors to gain exposure to Bitcoin. This has led to a renewed wave of optimism and interest from both retail and institutional investors, further cementing Bitcoin’s status as the leading cryptocurrency.\n\nEthereum’s Anticipated Growth\n\nEthereum, with its robust ecosystem and ongoing transition to Ethereum 2.0, is poised for significant gains. The potential approval of an Ethereum ETF is expected to draw in massive capital, similar to Bitcoin's recent experience. This influx could propel Ethereum to new heights, attracting a broader range of investors and reinforcing its position as a cornerstone of the blockchain industry.\n\nEthereum's unique value proposition lies in its smart contract functionality and its vast array of decentralized applications (dApps). The ongoing transition to Ethereum 2.0 aims to address some of the network's biggest challenges, such as scalability and high transaction fees, by shifting from a proof-of-work to a proof-of-stake consensus mechanism. This upgrade is expected to enhance Ethereum's performance, making it more efficient and sustainable in the long run.\n\n\n\n\n\nFurrever Token: Capitalizing on the Crypto Wave\n\nIn the midst of Bitcoin and Ethereum's impressive performances, Furrever Token (FURR) emerges as an enticing investment with its limited-time 25% bonus offer. Designed around a charming cat theme, Furrever Token combines financial potential with an engaging and community-driven approach. Currently in its ninth presale stage, Furrever Token is priced at $0.000732, promising up to 15X returns.\n\nStory continues\n\nFurrever Token’s unique appeal lies in its playful and whimsical approach to cryptocurrency. By integrating cute cat-themed stickers, emojis, and visuals into its ecosystem, Furrever Token aims to create a fun and enjoyable experience for its users. This focus on community and engagement sets it apart from more traditional, serious blockchain projects.\n\nThe project has already raised over $1.2 million, aiming to reach $1.9 million before its launch on PancakeSwap. This limited-time bonus, available until June 10, 2024, presents an excellent opportunity for investors to enhance their holdings and position themselves for substantial future gains.\n\nRiding the Momentum of Major Cryptos\n\nThe success of Bitcoin and Ethereum paves the way for other cryptocurrencies to thrive. As these giants attract more capital and attention, the overall market sentiment improves, benefiting projects like Furrever Token. The 25% bonus offer provides a strategic entry point for investors to capitalize on this positive market environment.\n\nFurrever Token’s well-structured tokenomics and strong community engagement further solidify its appeal. With 65% of the total 9 billion tokens available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team (locked for a year), the project demonstrates a commitment to long-term growth and stability.\n\nMoreover, the Furrever Token team is dedicated to ensuring the security and compliance of the platform. Regular audits and safety measures are in place to provide a secure and enjoyable experience for all users. This focus on security and community trust enhances Furrever Token's credibility and attractiveness as an investment.\n\nSeizing the Opportunity with Furrever Token\n\nWith the crypto market experiencing unprecedented growth, now is the perfect time to diversify your portfolio with Furrever Token. The limited-time 25% bonus offer not only enhances your investment but also aligns you with a project that promises both financial returns and a sense of community.\n\nDon’t miss out on this opportunity to invest in a promising project while benefiting from the market momentum generated by Bitcoin and Ethereum. Visit furrevertoken.com to learn more and take advantage of the 25% bonus offer before it expires.\n\nInvestors are encouraged to seize this moment, leveraging the dynamic market conditions to maximize their returns with Furrever Token. Whether it’s the robust ecosystems of Bitcoin and Ethereum or the unique charm of Furrever Token, the potential for significant returns is within reach for those willing to take the plunge.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market, their successes create an environment ripe with opportunities for savvy investors. Furrever Token, with its unique approach and limited-time 25% bonus offer, stands out as a promising investment. By capitalizing on the current momentum of major cryptos, investors can position themselves for substantial gains and be part of a growing, vibrant community. Don't miss this chance to diversify your portfolio and invest in Furrever Token today.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5SNFh2V2piX2tWRERKQ1RTOEJMdy1VeVprSVRlbERTZ3V5RHhHQlh1SEVoVGRyQWpYOE9vUWIyaDFKbXVFWkFmazNEWk9OQzV6anNPSGJXQWxUUU5xQW5sSE5OMTBiY2JLZzloSlZSanBPUmIySlNCbU9EONIBgAFBVV95cUxOYUJ4WVdHMTVqU1hRbEU4cnRGRXhkVjFsWkNoYU5lbTdYLTBTcHJfdFBEdnJlTVVBLTlEbWI1aGtWNUVtMVEwLVAzbVpGNkZOSlRKanFILXpCTzNTdF9iWjRmSGhxdEdoWV9NSlNVTXFfMVg5OFdSZGNNMmNPUE90Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum quiet at $3,800: Calm before the ETF boost? - AMBCrypto News",
        "content": "Analyst expects further ETH bullish momentum as options volumes remain high\n\nHowever, divergent views on non-staking ETH ETF demand persisted.\n\nAfter reversing all the losses made between March and May, Ethereum [ETH] has been quiet on the charts, swinging around $3,800 for about two weeks now.\n\nWas it the calm before a spot ETH ETF-induced storm on the price charts? Maybe.\n\nEthereum’s bullish expectations\n\nAccording to Singapore-based crypto trading firm QCP Capital, ETH’s options market volume was higher than BTC’s, underscoring further bullish expectations for the king of altcoins.\n\n“This bullishness is likely to continue as the market waits for the ETH spot ETF to usher in new demand. The options market certainly reflects this, with ETH vols still trading 15% over BTC vols.”\n\nAdditionally, an X user (formerly Twitter), MacroCRG, established that ETH trended higher amidst a weakening US Dollar Index (DXY). Both Bitcoin and ETH are inversely correlated. A weakening DXY always coincides with a rally for ETH and BTC.\n\nETH ETF demand factor\n\nMost market observers eyed massive demand for ETH from spot ETH ETFs. However, there have been divergent views on this, especially after spot ETH ETFs removed the staking option.\n\nOne of the users mentioned that going for a non-staking spot-ETH ETF had ‘an opportunity cost.’\n\n“A non-staking ETH ETF has a distinct opportunity cost in native supply adjusted terms that the BTC ETF does not.’\n\nHowever, on his part, David Hoffman of Bankless rebutted the claim and stated,\n\n‘I think we’re overindexing on how much TradFi cares about this, versus DGAFing and wanting exposure. IMO, the addition of staking will simply be a second-wind for flows.’\n\nIn fact, one of the potential issuers, ARK Invest, dropped from the ETH ETF party, citing that,\n\n“We will continue evaluating efficient ways to provide our investors with exposure to this innovative technology in a way that unlocks its full benefit.”\n\nHowever, Galaxy Digital’s Mike Novogratz recently projected that staking could be allowed within two years after the ETH ETF launch. If the projection plays out, we could see the ‘second wind for flows’ by then.\n\nThat said, a weakening DXY could boost ETH’s short-term price action before spot ETH ETFs launch. However, how demand plays out post-ETH ETFs remains to be seen."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPSlkxV2Eyc0tKMDVsZjF0S2Z5aUFkalp0VGJGUlduVlpkRG1XTU1xQmFDUUpiOEV5aUtEeWVHbFBmTEhaUEFzVVZBVGdhbnY4Nm1fT1ZWaWhyR2pBZ212R0hDRVlGYUNCYVkwZFRtcU9Pcjk3SHI1a3dsejVmVEp3Q3VsaFVDN0hJUkk3R3JpVEdUSFhEdW44SVItb1A1YTlGcS10VWt3eVkxQUxZWm82T1FMdXVmYzRXeG1FMjhRZWxjN09sdC0wVUxXN2ZPZXozRnNNOURoM201YXRw0gHiAUFVX3lxTE9iOXBVb0dESUd2d1FPME1lZmZrb2YzTlFjVlNEMU9GUWM0VkRheDd1ZzZTWGFDOGFoUE1wR3NJREVjRlBvdWVMTzdMS3dHY2VZLThHZGQtelNXY2FPTk5HbGdxWm5XTU9UNGNGVE0yaFZIOGtHVzFxSmtxYjB1cWlQaGs1cUhVMEhiZ1dFMTR1cXZaT1JId0pMaU0zVFd6NWVhMFlCT0hqY3dkT0FXSGZiTEc2NkZ5U0Z1STR6N21tSjl1SkpIQ2JmcDZIdVRzeUZsWm40aG5jNzZzMFRNVnVpN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time - FXStreet",
        "content": "Ethereum ETFs ‘will take some time’ before they launch, according to SEC Chair.\n\nETH's open interest on exchanges surged 50% to a new all-time high after SEC’s U-turn towards ETH ETFs.\n\nNew accumulating addresses holding 10-10K and 10K-100K ETH have grown steadily after ETH ETF 19b-4 approvals.\n\nEthereum (ETH) price hovered around $3,860 on Wednesday following Securities & Exchange Commission (SEC) Chair Gary Gensler expressing his opinion that the launch of spot ETH ETFs may be delayed. Meanwhile, Ethereum derivatives products on exchanges have seen a surge in open interest (OI).\n\nDaily digest market movers: ETH ETFs delay, rising open interest, new accumulating addresses growth\n\nIn an interview with CNBC on Wednesday, SEC Chair Gary Gensler said spot ETH ETFs would \"take some time\" before they go live on exchanges, indicating S-1 approvals are not imminent. He noted that his agency is still working on disclosure measures with exchanges.\n\nRead more: Ethereum leveraged ETFs go live as price fails to react\n\nAfter the SEC's sudden approval of 19b-4 filings from eight issuers on May 23, several analysts expected the agency to respond to S-1 registration statements quickly. The SEC's request for issuers to submit updated S-1 filings on Friday also seemed to have confirmed the expectations of these analysts.\n\nFollowing the filings, Bloomberg analyst Eric Balchunas suggested spot ETH ETFs would launch in July. However, with Gensler's recent comments, it may take longer before the ETFs begin trading.\n\nIn other news, open interest (OI) for ETH derivatives products on exchanges reached a new all-time high, rising by 50.3% to $14 billion, according to CCData Exchange Review for May. Notably, open interest on the Chicago Mercantile Exchange (CME) surged by 59.4% to $1.25 billion.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nMeanwhile, the balance of new accumulating addresses holding between 10 - 10K and 10K to 100K ETH has been growing steadily since the SEC's pivot on ETH ETF, according to data from CryptoQuant.\n\nETH New Accumulation\n\nETH technical analysis: Ethereum to maintain sideways trend until spot ETH ETFs launch\n\nEthereum saw a slight gain on Wednesday, trading near $3,860 and continuing its sideways trend.\n\nETH's 30-day MVRV also aligns with the horizontal move, hovering around 6% in the past week. This indicates that the number of Ethereum addresses that purchased the coin within the last 30 days has seen an average of 6% gains.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin’s momentum poise to propel crypto market\n\nDespite the horizontal trend, whales are still accumulating ETH, and both long-term and short-term holders will likely hold onto their tokens.\n\nETH may continue its horizontal trend until the official launch of spot ETH ETFs. The $3,618 price level remains key support in case of short-term price swings. In the long term, ETH may overtake the $4,093 resistance and flip the $4,878 level to set a new all-time high of around $5,000.\n\nETH/USDT 4-hour chart\n\nQCP Capital analysts also share the bullish view: \"ETH has been lagging on this move, but we expect a catch-up and possibly even outperformance against BTC when the ETH spot ETF begins trading,\" they said.\n\nETH liquidation data shows a total of $23.78 million liquidations, with $13.81 million of liquidated long positions and $9.97 million of shorts, according to data from Coinglass."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOTlNNOG44dWdJSmdSZkFoRklkU2h0eklseHhKZWpya2htd1U5RWZYcXJmOVhDdmhRWXlHOFdXQ3NMYVlEN01GSFRQenc2MHNYUEIwNmI0QTFXRHQ1dGJwMnRfZUgzU1VNV2dQWmd0cmZCYmhqazdHMS1kN1hVWWNZbGtEeDBSZ1XSAYwBQVVfeXFMTTUxQnM5dEp5UWxQNG5hTS14cVlTYXJhU05SSEw2cjN3dzloakxSNmk1Rms4LVd2VlV2b0pYcE1OcXZ5R1dGNjhkbHRZcU5fUVVZckRfN1Z5N2l5VGNZRElheE1aQXM4UU1MSmRFT202U0tNYmRhQmZ6UDRja1J2TXJhVmNOcDNCbjAwOG0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum vs Solana: Which blockchain will dominate in 2024? - AMBCrypto News",
        "content": "Solana outperformed Ethereum in active addresses and trading volume.\n\nDespite Solana’s growth, Ethereum’s network activity and security position it as superior.\n\nMirroring the broader market trend, both Ethereum [ETH] and Solana [SOL] exhibited positive trading activity, with ETH experiencing a 1.4% increase and SOL showing a 4.64% hike in the past 24 hours.\n\nHowever, delving deeper into their performance revealed an interesting insight: Solana has surpassed Ethereum in activity metrics, boasting a higher number of active addresses and trading volume.\n\nSolana’s active addresses surged above 1 million, while Ethereum’s remained stagnant, highlighting a notable disparity between the two networks.\n\nFurther confirming this sentiment, AMBCrypto’s analysis of Santiment data revealed that SOL outperformed ETH in social dominance as well.\n\nWith such key metrics hinting at Solana’s potential to overtake Ethereum, a fundamental question emerges: Which blockchain will emerge victorious in 2024 and beyond?\n\nEthereum vs Solana: The debate\n\nSharing their insights, Ethereum Researcher Justin Drake and Solana Co-Founder Anatoly Yakovenko engaged in a debate on Ethereum versus Solana on the ‘Bankless’ podcast.\n\nShedding light on what’s good about Solana, Drake noted,\n\n“I think what Solana is doing for Ethereum is that it is providing healthy competition. It’s a sort of accelerationism and not only because of good execution but also because of contrarianism.”\n\nIn response, Yakovenko, while praising ETH’s decision to prioritize security over scalability, he said,\n\n“People think Ethereum is moving slowly but if you look at the size of the network, its value…I would be terrified of any changes to Solana if it was at that value.”\n\nHe further went ahead and added,\n\n“Ethereum is at a point which I think every other L1 should be envious of, and try to get there as fast as they can. All of that I think puts it in a class in my mind actually above Bitcoin.”\n\nThis highlights that Ethereum is still the winner in the L1 space owing to the most network effects, liquidity, maturity, and security, making it pre-ordained to surpass Bitcoin and become number one.\n\nHowever, on the other hand, Drake justified that Solana could become the ‘internet of value’, justifying its $100 billion valuation.\n\nHe further added that SOL’s developers are more focused on building user-targeting products rather than infrastructure, which contributes to its success.\n\nSOL a competitor to ETH?\n\nAdding to the fray, Raoul Pal, CEO of Real Vision and Global Macro Investor, drawing parallels with ETH’s 2020 bull run highlighted Solana’s emergence as a strong Ethereum competitor.\n\nHe best put it when he said,"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPb3pJX1B2R0pvTDNTbEFySTZISWhPQ3NFQl9oV01VbUhhdm9Ic1RsQ3VJWlE0Y0M0cV9tajJ3S2pDa2tPdllVQ29rdDl4NEw1UGVQRHlTN0ZPQk54X2kzelJ5XzdPeXpGUENwc1h6VEw0bl9EREhIRGV1NllsdEtpZU02Wk5qRXdBYlpXRm5sM01kUjdIdFVKV2VLVXJQSUc30gGmAUFVX3lxTE15YUpjbzFNTXd4VmxHM1dnNmlicjRmb2xIV2ZHTmQyS0dLSjJrSGozd1ljdjlpbDlpTG01aUpUMkI0QnNDVlk5YWNuMmVsX0d1MUFXWHFQZ1BIZEdreDN1ZzZDbXVfd0JqU3pYc3ZlMEY4LVVkN0tVRk5pbGNIcnM4RlFlR0U3U2oyOUtKZXMyTXRJaFJRbFdGWmI0UURqVTBGeXdrNVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "ETH Supply Can Drop By 1.26 Million In Five Months of Spot Ethereum ETF Launch - CoinGape",
        "content": "All eyes are currently on the SEC’s decision regarding the approval of spot Ethereum ETF S-1 registrations, which could act as a catalyst for a broader market rally. According to a recent report from K33 Research, Ethereum might experience a supply shock, with nearly 1.26 million ETH potentially moving off exchanges within just five months of the ETF launch. This shift could significantly boost the Ether (ETH) price, potentially leading to a new all-time high.\n\nSpot Ethereum ETFs to See $4 Billion in Inflows\n\nAs per the K33 Research, the spot Ethereum ETFs could see a staggering $4 billion in inflows within just the first five months of launch. K33 Research based its forecast by comparing the assets under management (AUM) in existing Ethereum (ETH)-based exchange-traded products worldwide to similar Bitcoin (BTC) products. They also analyzed the open interest (OI) in futures contracts on the Chicago Mercantile Exchange (CME), a key marketplace for institutional investors.\n\nadvertisement\n\nAs of now, Ether’s open interest (OI) on the CME exchange stands at 23% of the size of Bitcoin futures. However, ever since the ETH futures started trading on CME back in 2021, they have grabbed a 35% share of the BTC futures, indicating that there’s been a strong institutional demand for ETH.\n\nWhile comparing these ratios along with the $14 billion in inflows for the spot Bitcoin ETFs, K33 Research predicts that the spot Ether ETFs could see inflows anywhere between $3 billion and $4.8 billion within the first five months of launch.\n\nAs per the current ETH price of $3,800, this could mean that 800,000 to 1.26 million of ETH accumulation will happen through the ETFs. This is nearly 0.7%-1.05% of the total circulating ETH supply.\n\nETH to Outperform Bitcoin\n\nSoon after the spot Bitcoin ETF approval, the BTC price rallied by 60% to record highs. As per K33 Research, if the Ethereum ETFs go live for trading, Ethereum will start outperforming BTC, after nearly two years of underperformance.\n\nMore importantly, in its research report, it noted that the removal of the staking feature from ETFs won’t negatively impact the inflows into the investment product. K33 noted that in Canadian ETH ETFs, 99% of assets under management are housed in funds that do not involve staking, while in European products, the figure stands at 98%.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxORmNKRXNIRGJQZ0k4cVBJd0hVQzFBV1pSRHA4NU5JeG05a1NJRmR2Uy1DSERjZWw0TlpjZlFrVzN3TXZLSld5eHZGdXpWT29vaWZnSnJXN202QzIxX2dIYTVPbEdPQkFpQldmTkxpUXJqR1NpcWY1aW82dkd4Qktnb3Iwc9IBiwFBVV95cUxOdlhrTFB4UVlpQWhMaTMtTUVEZkJjT0t1TElXYXA5WUI3OF96azRUVWd4bjlNQmVDa3lQdlhmWEFtZ2dLSndHaXlvSnFOaDJwQjk2c0Zhc01ScGxuWGQ4Z1dZR1djeW9LWmpJQkpUN3lQMzBOLW5faGoyUGItOXJ6Zl85R3lmNUJuOUE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "F1 Team McLaren Reveals Free Ethereum NFTs With OKX - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency exchange OKX and the McLaren Formula 1 Team announced Thursday that they are launching a new \"Race Rewind\" digital collectible series, offering fans a unique way to commemorate each F1 grand prix this season and a chance to win exclusive McLaren prizes.\n\nStarting Friday at 10 am GMT, fans can mint the first free NFT commemorating the Canadian Grand Prix on the OKX Wallet. The NFT will be minted on OKX’s recently launched Ethereum layer-2 scaling network, X Layer, which is built with Polygon tech.\n\n\"We want to build community and bring new utility to crypto,\" said OKX Chief Marketing Officer Haider Rafique, in a release. He added that the blockchain space isn’t “all about trading and investment,” but also “finding a better way to bring people closer to the things they care about.\"\n\nThe free collectibles combine multimedia and audio, allowing fans to relive the sights and sounds of each race as McLaren chases wins over the course of the F1 season.\n\nAD\n\nAD\n\nLaunching the Race Rewind Collection with @McLarenF1! 🚨​\n\n​\n\nTo reflect the 24 races in the season, we’ll be releasing 24 dynamic digital collectibles, each designed with a signature sound. 🔊​\n\n​\n\nClaim each collectible to unlock exclusive prizes and a chance to win a VIP McLaren… pic.twitter.com/cdcHk2XUJO — OKX (@okx) June 6, 2024\n\nFans who collect the full set for the rest of the 2024 season will be eligible to win a special \"VIP\" prize, including a McLaren Fan Experience at a future race, $2,500 for travel expenses, and a hot lap around a race circuit.\n\nOKX is one of McLaren’s primary F1 sponsors, and one of a wide range of cryptocurrency companies and projects that have embraced the growing racing league via sponsorship in recent years.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward.\n\nAD\n\nAD"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbHNVRGZvbmh3YUhtaHE5YTdCTGR6eklsQnktOG0xdHlyMWUyOEZfLWNENEN5emZiT05sb1E5VE1PZlRzaWJEdGNhNGdUa24xNmNMMGJBeFZ2MkppSmxnNDZwS3lZWndNRHVQQ0w3eVlneThsaXhzVUxVaW95aWdiY0lici1CZWlq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Shiba Inu: How High Can SHIB Go When Ethereum Hits $20,000? - Watcher Guru",
        "content": "Cryptocurrency investors are watching the performance of major coins like Ethereum (ETH) and their potential impact on the broader market. One coin that is in the spotlight is Shiba Inu (SHIB). With Ethereum’s price on the rise, the question on everyone’s mind is: how high can Shiba Inu go when Ethereum hits $20,000?\n\nShiba Inu’s Current Market Performance\n\nIn recent days, SHIB has gained momentum, reaching a low of $0.00002369 and a high of $0.00002577 in the past 24 hours. Currently, SHIB is trading with an 8% surge in its overall performance during this period.\n\nAlso read: Can Solana (SOL) Breach $260 And Hit New ATH in June?\n\nHowever, the meme coin has been down by 10.3% in the last seven days. Despite this temporary setback, SHIB enthusiasts remain confident in the coin’s prospects in the current bull market.\n\nShiba Inu’s Potential Value with Ethereum at $20,000\n\nAt press time, Ethereum is trading at $3,813, reflecting 30-day gains exceeding 20.3%. For ETH to reach the $20,000 threshold, it would need to increase by 427%.\n\nIf Shiba Inu were to mirror Ethereum’s growth and achieve a 427% increase from its current price, its value could skyrocket to $0.0001282. This price level would be a new all-time high for Shiba Inu, breaching its previous ATH of $0.00008845.\n\nAlso read: Ripple: How Many XRP You Need To Make $5 Million If Price Hits $2?\n\nThe Correlation Between Ethereum and SHIB\n\nAccording to IntoTheBlock stats, SHIB has a 69% correlation with the price of ETH, indicating that there is a 69% chance that SHIB will follow ETH if it rises to $20,000.\n\nThis strong correlation suggests that Shiba Inu’s price is heavily influenced by the performance of Ethereum, and a significant surge in ETH’s value could have a profound impact on SHIB’s price trajectory.\n\nAlso read: Shiba Inu Poised to Hit $0.0001 in June, Says Leading Analyst"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNbkJJemRJWWh2Wk10U0tQSXlGZFdseGg2ekRTV0ZDcWlCeGdJemo5RjNRZ1BHTVIyRDRNTWxJd3NUYjFpSjZ1YlVjTTREQk1HbTlCTmI4MTdBc281enNCUGVFRzAxNjlyYUpKR1ZFYmhDS1VkVUpLSDJUX3dQeFJXYTB1dG9NeWIxX3dGdEF4SHZnTkdwU0VneDRTSkFqVlFu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Daily Active Users Grow 9 Times to 2.25M in 4 Years - Crypto Times",
        "content": "Ethereum has seen its daily active users increase almost nine fold in the last four years, reaching over 2.25 million in Q1 2024, according to Bitwise data.\n\nETF or not, the Ethereum ecosystem is growing. Fast. pic.twitter.com/8XLtyN5dv5 — Bitwise (@BitwiseInvest) June 5, 2024\n\nIn Q1 2020, Ethereum and its solutions such as Arbitrum and Polygon had an average of over 250, 000 users daily. Fast forward to Q1 2024, and this number has grown to about 2. 25 million with Layer-2 solutions such as Optimism, Base, and zkSync among others.\n\nThis shift towards layer-2 solutions has seen Ethereum’s mainnet user base reduced to 378,000 active users while Polygon alone has 1. 3 million users, with the other layer-2 networks having approximately 1. 5 million active users in total.\n\nLayer-2 scaling is considered by Ethereum co-founder Vitalik Buterin as an essential component of Ethereum’s development plan, comparing it to the sharding idea from the previous Eth 2 strategy. This strategy is to promote development in several subcultures of Ethereum.\n\nFurthermore, the issuer of one of the most popular crypto ETFs, VanEck, has raised its forecast for the Ethereum price to $22,000 by 2030 due to high revenue per user and the ability to attract financial market players and Big Tech.\n\nEther is currently at $3,862 and with the rumors of spot Ether ETFs in the near future, many people are expecting Ethereum to reach new highs. However, some warn that flows into these new crypto ETFs could be lower than that of Bitcoin ETFs.\n\nThe extensive use of layer-2 solutions on Ethereum has increased the network’s user base by more than 2. 25 million daily active users in the first quarter of 2024, which will significantly change the network’s scale and openness."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPam04aDFjVV9oZFN3WjhCSzB3SS1ZV0VKUnhTVDU3VXpoM28tWG5fR2VsRjNYMDhicFMyc0Qweks2NVA5RExmSER0ODhzVDZfUHFXbEJicEYwMUZ1SXVWMExLOE5uaktZTFlKdGx2d3ZIUjhXNjg3eFRZNE5aMU1fS0ViM3RmSHFSem5SQVgzMUFHQkxkOUg2c092djBOM0lQUEhaSERsUjFMSGhrSDZrb2JtSnBpcE1JTzBsVWJLVkd6T1F1QUVWd2plZVFzOUpfYjVEMURwUnlEYVnSAeABQVVfeXFMTVFEWE9Nd0lzeDhxM1NSSFNjYzdfVkFneVBWQnkyOGVQMGVEUXVyei1NYVBmc3JhemtlQXpRUTZSZHF3bnBFcUJBbEU4d19HR29jUURVdVZSa3RQLVVqWTdGYzVaT1l6R3VMVEdFT0xpUURQbjByWTBvR2EyV05sTG5zSG1Jem9RcUQycC1fMGhGMnVVQVlJdVBoY3FRLS14TzZzT2wwLVJYYV9vdjM5OHZ4SWdQVU5IWnY3c01FWmJBR1YxbUZtWVcyT1ZKYTN6OXhoczJHVVRaaTJLei1JTUI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ecosystem active users spike 55% in Q1, 2x ETH ETF records impressive volume - FXStreet",
        "content": "Volatility Shares 2x ETH ETF records over $15 million on second day of trading.\n\nAverage daily Ethereum ecosystem users spike by more than 55% in Q1'24.\n\nEthereum needs to overcome key resistance before any attempt to flip the yearly high of $4,093.\n\nEthereum (ETH) failed to overcome a key resistance as it resumed its horizontal trend on Thursday. Following the lag, the Volatility Shares 2x ETH Futures ETF showed considerable growth on its second day of trading.\n\nDaily digest market movers: ETHU, daily active users, and fee growth\n\nVolatility Shares 2x Ether Futures ETF (ETHU) volume tripled on its second day of trading, reaching $15 million. It did over $5 million on its first day of trading — more than all ETH futures ETFs did on their first day. Bloomberg analyst Eric Balchunas termed the performance \"impressive,\" considering ETF volume usually slows down after their \"Big Day One.\"\n\nAlso read: Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time\n\nETHU's success was likely triggered by the expectation of spot ETH ETFs after the SEC approved issuers' 19b-4 filings on May 23.\n\nUsers have been marching into the Ethereum ecosystem despite its Q1 price lag compared to Bitcoin. According to Bitwise, the average daily Ethereum ecosystem user growth reached 2.25 million in Q1 2024, a more than 55% increase from the previous quarter. Much of this growth seems to have come from the Base ecosystem, which has racked up over 7 million users since January, according to the Dune analytics dashboard from @watermeloncrypto.\n\nMeanwhile, Ethereum Layer 1 has still outperformed L2s and Solana combined in terms of fees despite the March Dencun upgrade lowering gas fees. Ethereum Layer 1 total fees is about $5.66 million compared to $1.74 million from L2s and Solana combined.\n\nRead more: Ethereum leveraged ETFs go live as price fails to react\n\nETH technical analysis: Ethereum's upward move rejected by key resistance\n\nEthereum is trading around $3,840 on Thursday as long traders continue to lead liquidations. According to Coinglass, ETH liquidations reached $25.95 million in the past 24 hours, with long liquidations leading at $14.63 million and shorts at $11.32 million.\n\nETH/USDT 4-hour chart\n\nETH was rejected by the $3,900 level on Wednesday after a slight gain. It would need to break past this level before an attempt to overcome the $4,093 price level.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nThe bullish thesis is still in view, provided ETH doesn't trade below $3,618 for an extended period. If ETH breaks below this level, it may hover between $3,301 and $3,600 to fill the liquidity void of March 20 and 21."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNQm11TGsxaU9nQlB6d0pEMC1PQXM1eGdDRzVxQVVHbkh3TnlxSlE3cEZOOXh4SlZPV3hWZi1FdXlRcEtlUVpmNFRQaHY0bUpCZzFSMUpsZjZlWXo4RkdyTjZDYldZalhtUENZWXBYUUJmRW9FaUwwRzBzcTU0U056cHB2bmFsdHlJWG45Ul84QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Crypto Chaos: Ethereum ETFs in Turmoil as SEC Hampers Market! - Cointribune EN",
        "content": "Thu 06 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic world of crypto, attention is currently focused on exchange-traded funds (ETFs) based on Ethereum. Recently, Gary Gensler, Chairman of the Securities and Exchange Commission (SEC), indicated that the approval of Ethereum ETFs could be a prolonged process. This statement was reported by Fox journalist Eleanor Terrett, highlighting a methodical and cautious approach by the SEC.\n\nCrypto: the approval of the S-1 form for Ethereum ETFs is not for now!\n\nGensler expressed concerns regarding the practices of crypto exchanges, which, according to him, are conducting operations that current laws would never allow on traditional exchanges like the New York Stock Exchange. These comments highlight the regulatory differences between traditional markets and cryptocurrency platforms and raise questions about how regulators can adapt to these new asset classes.\n\nThe approval of Ethereum ETFs is a subject of great anticipation as it could pave the way for broader adoption of crypto by institutional investors and traditional traders. However, the SEC’s caution suggests that the S-1 form approval process might take longer than some market players had hoped.\n\nThe SEC has already approved ETFs for other cryptocurrencies, such as Bitcoin, but the approval process for Ethereum seems to be different. Unlike Bitcoin ETFs, which were approved by a committee of five members, including the SEC Chairman, Ethereum ETFs were approved by the SEC’s Division of Trading and Markets. This difference in the approval process has piqued the curiosity of the crypto community, wondering why there was a change in the procedure.\n\nThe regulatory implications of the SEC!\n\nThe implications of these statements are vast. On the one hand, they indicate a growing recognition of the legitimacy and importance of crypto in the modern financial landscape. On the other hand, they reveal a regulatory approach that remains cautious and thoughtful in the face of rapid innovation and the potential risks associated with cryptocurrencies.\n\nFinally, although the approval of Ethereum ETFs is a positive development for the crypto industry, Gensler’s remarks remind investors and market participants of the importance of patience and diligence while waiting for regulatory decisions. The SEC, as the guardian of the integrity of financial markets, continues to play a crucial role in balancing innovation and investor protection.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB2OHFMZ1lCZE0tYVF1M0JXRmYyemVYSXVYUmRQQ3NqaGdCSTNaQWt3TEtpUHNtS2ZQQkUtNWNfN04wZlJRMnM2dm9VVXM3X1d1Y0IwQUlMSjhSa2VnS3pPUXB1Y3lUMXJGZlExeDJubGNTT2k5NEVPWm1ZZUzSAYQBQVVfeXFMUGItOWdNbTBNNU5TbHVzS3kzdHMzMXRuQno4V3g5UlpnYTRPclpfYmJydllzTkdNLVVoYzdKUkxhRWZLNG9zb2lMMEVHcVlYdmN2dVh5NHJiODl3eV9LRHRJWmpyWlY5RWwyT0lBVWJfOGJpYlVmbklqUFBHNDFMejdobG5M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Feds Charge UK Nationals With $3 Million ‘Evolved Apes’ Ethereum NFT Scam - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThree UK nationals are charged with orchestrating a $3 million scam related to the “Evolved Apes” NFT collection, the U.S. Department of Justice said on Thursday. Mohamed-Amin Atcha, Mohamed Rilaz Waleedh, and Daood Hassan are accused of wire fraud and money laundering in what authorities called a pump-and-dump scheme.\n\nThe DOJ said the charges stemmed from a 2021 scheme to get NFT collectors to purchase one of “10,000 unique” Ethereum-based NFTs called Evolved Apes that could then be used in an online battle royale game. The defendants made off with 798 ETH, worth around $2.7 million at the time.\n\n“As alleged, the defendants ran a scam to drive up the price of digital artwork through false promises about developing a videogame,” U.S. Attorney for the Southern District of New York Damian Williams said in a statement. “They allegedly took investor funds, never developed the game, and pocketed the proceeds.”\n\nThe DOJ alleges that Atcha and Waleedh aggressively promoted Evolved Apes, including hiring an unnamed social media influencer to shill the project.\n\nAD\n\nAD\n\nThree United Kingdom nationals charged in connection with “Evolved Apes” NFT scam 🔗: https://t.co/PWNHwklVmE pic.twitter.com/TArfjYdR8k — US Attorney SDNY (@SDNYnews) June 6, 2024\n\nA pump-and-dump scheme is when investors are enticed to buy an asset based on misleading information. The fraudster uses early interest to drive up the price of the asset, only to sell everything off and disappear—or “rug pull”—leaving unwitting victims holding worthless tokens.\n\nAccording to case documents, Waleedh identified himself as the lead marketing manager for Evolved Apes when attempting to withdraw funds that had been stuck on an unnamed cryptocurrency exchange that the group was using. When Waleedh was allowed to access the funds, the DOJ alleged, he transferred them to a cryptocurrency address controlled by Hassan.\n\n“Digital art may be new, but old rules still apply: making false promises for money is illegal. As we allege, thousands of people believed these false promises and were tricked into buying these NFTs, including here in the Southern District of New York,” Williams said. “NFT fraud is no game, and those responsible will be held accountable.”\n\nAD\n\nAD\n\nIf convicted, the trio faces a maximum sentence of 20 years in federal prison.\n\nRug pulls are rampant in the cryptocurrency space. Most recently, two rug pulls made headlines, including in May when a purported “mother and son” duo staged a scandalous livestream to pump the “LIVEMOM” token and made off with $300,000. This was followed by another scheme in which a pseudonymous creator shilled the “HANDS” meme coin.\n\n“I don’t have hands, I cannot rug you guys, chill,” the creator said during a livestream on the NoHandsNoRug Twitch channel—only to reveal his hands before selling the 7 SOL accumulated in the scheme, worth around $1,000.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxORm00Sk0zX09INXlDZEdaOFFqaGtBcTdrYy12eWlPcko3aWJLeUlSOXVzdmRidDdDNWpaU2pDYUJmN0x5WTNwQm1CSVlvLV93dU9mLTBIOGNqQm4zamNxRzI5NWZVWTRNWWJYUG9MbFlfUUhCN1dqdXBIUVRta1JfVTJ3Q0I0dnBxNEd3eXpNVHZVWTIyVkQ4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum : Les révélations étonnantes sur la gouvernance de cette blockchain - Cointribune EN",
        "content": "Wed 05 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nThe issue of governance keeps resurfacing in the complex and evolving Ethereum ecosystem. A recent report from Galaxy Digital sheds new light on this topic. Its findings are quite surprising.\n\nThe main actors of Ethereum blockchain governance\n\nThe governance of Ethereum relies on several stakeholders, each playing a distinct role in the decision-making process. Client teams, at the forefront, are responsible for the development and maintenance of the main software essential for the proper functioning of the network. The report highlights their crucial role in proposing, discussing, and implementing changes, notably through Ethereum Improvement Proposals. Meanwhile, validation node operators exert significant influence by voting on which software versions to run, adding a tangible aspect to Ethereum’s decentralized governance.\n\nDecentralized application (dApp) developers are also key players in this governance. They develop features and perform upgrades based on user needs. Furthermore, lively discussions on governance are held in various forums, including Ethereum All Core Developers calls, ETHMagicians, and Discord, illustrating the community’s ongoing commitment to the decision-making process.\n\nOff-chain governance: a delicate choice\n\nThe report highlights Ethereum’s preference for off-chain governance rather than direct on-chain voting by ETH holders. This decision is motivated by the fear of power centralizing in the hands of a small group of token holders, which could undermine the highly valued decentralization. However, this approach also poses challenges, particularly in terms of transparency and objective assessment of the decision-making process.\n\nAlthough the off-chain approach allows for nuanced and diversified decision-making, its lack of traceability can raise concerns about the legitimacy of the decisions made. Despite these challenges, the Ethereum community remains steadfastly committed to maintaining a transparent and inclusive decision-making process, which is the foundation of the decentralized governance characterizing the blockchain.\n\nEthereum’s governance, as revealed by the Galaxy Digital report, illustrates the importance of the off-chain process in making crucial decisions. As the community continues its journey into the future, it is important to recognize the opportunities and challenges inherent in this decentralized approach to ensure the sustainability and robustness of this iconic blockchain.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOSUhZcU5iX21vLWpuWENjNHIzZUZLMTJSdUVwWTBwT1NfeThzTF9rS2VFWFpzWG5aQVNndnpKVXFyckhmM1RNblhPM1BuTmFGY21xSDhGSFlJY0x3MmVWM2lZeUJBT0x3ZEc1aGpOT1BDR04xeUFiZlB3Zk1ETlVBRHVnejJDRzRvZ3VsQXRVbXFnNmtWQ3RqRUtjYl91dHFpQ3dDVUZma3PSAa4BQVVfeXFMT0lVSFpUd2lXNDU1dVpWMjJPb3A1dVk2MkQzYjZ0blgzbmM1Sm1rZk90VG51QV9rN1BnMVlMVklnM3NVbm9VNWRDWDJuNUFjaWlWMTBFZkg4b09oc25rX2wxd1k4NzVhSDU5a1h6LVVnakxjWW0zVjJxNVE2c0tMVVdWYkhvX0xySXMxV0QwVVA1UFphVUl5WXk1MW93ck9DMFhLN2VSOW9oU3JMT2ZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Will Ethereum Price Hit $10,000 On BlackRock ETH ETF? - CoinGape",
        "content": "Ethereum price has been in consolidation for the past few weeks as the market prepares for an S-1 application approval. Ethereum price is currently trading at $3,787, a 0.6% increase in the past 24 hours. On the other hand, Bitcoin broke above $70,000 once more after more than a month of trending below this crucial level and continues its journey to try and break an all-time high.\n\nETH/BTC Price Analysis: Ethereum Price Succumbs to Bitcoin Rally, Can ETH Bounce Back?\n\nadvertisement\n\nETH price against Bitcoin witnessed some downward pressure as Bitcoin bulls pushed its price above $70,000 for the first time in the last 30 days. The majority of cryptocurrencies shed some value against BTC, and Ethereum was not left out.\n\nThe price of Ethereum broke downward from the consolidation zone and is headed toward the 50% Fibonacci retracement level around 0.052 BTC. Based on the Ethereum price prediction, this retracement level may act as a zone of support a bounce back higher toward the 27% Fibonacci extension level around 0.06 BTC.\n\nOn the way up, ETH price may encounter resistance around 0.057 BTC, and $0.058 BTC. Conversely, the support structure around 0.052 BTC may prevent the price of ETH from falling lower.\n\nOn the other hand, Bitcoin price just broke out of a descending triangle in a classic textbook breakout and retest pattern. BTC price may move higher, with a profit target for this kind of setup anywhere around $74,000. This would establish a new all-time high price for the king of cryptocurrencies.\n\nBitcoin price may find some overhead resistance around $72,200 and $74,000, but on the flip side, a key support level around $67,000 may help keep the price up.\n\nETH/BTC Price Future Outlook\n\nAs the Ethereum community awaits S-1 application approval, the Bitcoin community continues to spearhead mass adoption for the number one crypto. El Salvador, the ‘Bitcoin State’ now owns 5,660 BTC worth over $402 million, and is still accumulating.\n\nMoreover, the University of Austin, a private Texas institution, will now accept Bitcoin for tuition and create a long-term Bitcoin fund.\n\nMeanwhile, liquid staking and restaking on Ethereum is only gearing up, and much more liquidity is about to hit the ecosystem, a phenomenon that could pump the price of Ethereum even higher. When including liquid staking, Ethereum mainnet TVL came within 2% of its ATH recently\n\nBottom Line\n\nThe crypto community is optimistic about an S-1 Form approval because BlackRock submitted it. The firm has a clean history of only wins when it comes to ETF applications and the Ethereum community is banking on this to pump ETH price to $10,000.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQWm9UTzgya1dkV3NCZHc4a2R5ZnJZSmlvNFJYdzNVTl9QVldISlFMQTlORmZ4RDBTLWpDcVV6WEpEMW9zeDFzYUlFaXR6aE9nM09NVGtvNVRsR2otbXZiaWVTNF9VTFl0WldnVmZZWmF3cU9zQl8teUxucldLSkZEdUZyeE5NREk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Alchemy Unveils Rollups Tool for Ethereum - Crypto Times",
        "content": "Alchemy, a premier blockchain development platform, has announced the release of Rollups Tool, a groundbreaking scalability solution designed specifically for Ethereum.\n\nToday, we’re thrilled to introduce Rollups.\n\n\n\nScaling solutions like rollups are essential to Ethereum's success in the long run, and Alchemy provides the most-reliable, comprehensive Rollup platform for developers building at any scale.\n\n\n\nHere’s why you should roll with us 😎 pic.twitter.com/jTEU7HEvv3 — Alchemy (@AlchemyPlatform) June 6, 2024\n\nRollups from Alchemy offer developers a dependable and complete framework for building on Ethereum. This change is critical to Ethereum’s long-term viability, particularly given the growing need for decentralized applications (dApps).\n\nIt will provide developers with a full toolbox for rollup-centric development, to streamline the process of designing, optimizing, launching, and growing layer-2 blockchains while focusing on scale, speed, and cost-efficiency.\n\nAccording to product director Monica Garde, Alchemy’s service provides developers with the same “battle-tested infrastructure” that drives some of the most trusted networks in decentralized finance (DeFi). “Running a node is not that difficult; the hard part is doing it reliably, and at scale,” Garde stated.\n\nTo improve the developer experience even more, Alchemy has teamed with industry giants such as Arbitrum, Optimism, and CelestiaOrg. These collaborations seek to provide high throughput, assist Superchain developers, and facilitate permissionless, high-throughput decentralized applications.\n\nRollups, hailed by Ethereum co-founder Vitalik Buterin as critical for scaling DeFi and boosting dapp performance, are intended to reduce congestion on layer 1 networks.\n\nWhen designing rollup-centric chains, developers have the option of using zero-knowledge (ZK) proofs or optimistic systems. “We plan to explore ZK frameworks later this year,” Garde said."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQbTYwajVwMW9xaGFLNFpQLWNsMUN3MWQ4UWZZNElPWmRBMWg5U3ZvQmp0ckl3MzdLajV0bUpkOHh3NnhfUUZRUW1aVzl5S1RKVW5HNmthd1Zqb2dJLVg4VmRLNm82cTBHNnZTYWdSWlZZdC16cTRUTkZyS0pEZnpsRVpVcHdDLU16S2VTekZaNNIBlAFBVV95cUxPRnd6eWVCaXFSeThjblZEUy1lRVZTMmJrZTlDN25hOTIyR2lSOFJ3MEp0UWtWalVxTDhxVFQyMTFxN05OMGIzM01NSk1weUMwRU5PWE9aaTdTWE5Kci1HTHk0ZE5GSEFxbTk5RlN4UVUydGE3S0JoSERBZGlIb0ExaTdQbFAtVGRoMlJfVENrdEpfcnZO?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Hints at Slower S-1 Approval for Ethereum ETFs - CoinGape",
        "content": "The path to launching spot Ethereum ETFs appears to be extending, as SEC Chair Gary Gensler suggests that the approval of the necessary S-1 forms “will take some time.”\n\nThis development follows the recent approval of 19b-4 forms but indicates a potentially prolonged finalization phase for the S-1 forms, essential for the ETFs to commence trading.\n\nadvertisement\n\nGensler’s Comments on S-1 Approval for Ethereum ETFs\n\nIn an interview on CNBC in relation to a digital assets subcommittee hearing, SEC Chairman Gary Gensler said that the further steps for the ETF approval involving Ethereum are not close at hand. This statement has been made amidst the SEC’s instructions to issuers to submit their draft S-1 filings by last Friday.\n\n🚨NEW: @SECGov Chairman @GaryGensler says the next step in the $ETH ETF approvals “will take some time,” possibly indicating a potential slow-walk of the S-1 approval process. https://t.co/iwfN9vvmt8 — Eleanor Terrett (@EleanorTerrett) June 5, 2024\n\nAfter this submission, the SEC should give its first feedback which will in turn prompt more changes to be made. From the insiders of the industry, it is expected that this iterative process may take several weeks or at most several months.\n\nThis was evidenced by the fact that key financial institutions like VanEck and BlackRock filed updated S-1 forms following the approval of the 19b-4 forms on May 23. BlackRock elaborately explained that its ETF would have an initial asset of $10 million, which demonstrates the preparedness and the capital support for these strategies.\n\nEthereum ETF Market Impact and Investor Expectations\n\nThere is much excitement around the ETH ETFs, especially due to the possibility of large amounts of capital flowing into the market. As per a report from K33 Research, spot Ethereum ETFs could fetch $4 billion investments in the first five months of their launch.\n\nThis estimate is derived from comparing the Bitcoin product with other BTC offerings and the increasing institutional demand seen through trading in Ethereum futures on the CME.\n\nIt is anticipated that this inflow will contribute to a large part of the circulating Ethereum supply, which will further decrease the supply in the market. K33 Research also expects that the arrival of these ETFs will lead to a new all-time high in ETH prices because such products have been associated with similar market trends in the past.\n\nRegulatory Steps and Market Readiness\n\nThus, the detailed review process that the SEC is currently using in its interactions with ETF issuers indicates the commission’s prudent approach to regulating these important financial instruments.\n\nThe longer review period also implies detailed consideration, which might be attributed to the intricate structure of the underlying assets and the potential regulatory difficulties related to them.\n\nCompanies like BlackRock have moved swiftly, indicating a strong market demand and readiness among established financial entities to embrace these new investment vehicles. Meanwhile, the withdrawal of proposals by some firms, such as Hashdex, highlights the varying levels of preparedness and strategic repositioning within the industry\n\nRead Also: Bitcoin (BTC) Price Tipped To Hit $500,000 In 2025 By S2F Creator PlanB\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPMlJUODdhd0pvemtraDk1ZUpHdGFFVGlvdEVpRVBvWDJ4RnNrRW5POFdKSE0xajkydlJuSU5HZEtWbGZ2dHA1WnpYVlc2dnBQWi0wUjV5OTk3bElCazlKcndPWG40czlaNEFISHdMZWtyZms5RFRwZFBndVJUbm1obWtFbVJjckV6OE5oZlhvMUwwSnpHd1hOLUZ6X24wcDZ4bGpwX3lLcE1lRDNpczhycE83dXNuY2JDaWdXa3l6MThWNlEwZ0pn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "VanEck Predicts Explosive Ethereum Growth: Could ETH Reach $2.2 Trillion? - TradingView",
        "content": "Ethereum, the world’s second-largest cryptocurrency, is poised for a meteoric rise, according to a new analysis by VanEck, a leading asset management firm. The report predicts that Ethereum could reach a valuation of $2.2 trillion by 2030, translating to a price of around $22,000 per coin. This ambitious prediction hinges on Ethereum’s dominance in the smart contracts arena and its potential to generate a staggering $66 billion in free cash flow by the end of the decade.\n\nTraditional Finance Embraces Ethereum With ETF Approval\n\nA key driver behind VanEck’s bullish outlook is the recent approval of spot Ether ETFs on US stock exchanges. These ETFs allow traditional financial institutions and investors to gain exposure to Ethereum without the complexities of directly holding the cryptocurrency.\n\nThis increased accessibility has broadened Ethereum’s appeal, attracting financial advisors, institutional investors, and even Big Tech firms. The influx of these new players has bolstered Ethereum’s legitimacy and instilled confidence in its long-term potential.\n\nNewsBTC\n\nA Network Powerhouse With Room For Growth\n\nThe Ethereum network boasts a robust user base, processing around $4 trillion worth of transactions and facilitating $5.5 trillion in stablecoin transfers over the past year. This impressive activity highlights Ethereum’s position as a vital cog in the decentralized finance (DeFi) machine.\n\nVanEck’s analysis factors in Ethereum’s ongoing evolution, including the rising adoption of applications built on its platform, the increasing scarcity of ETH tokens due to burning mechanisms, and its potential to capture a larger share of the burgeoning blockchain market. The report estimates the total addressable market (TAM) for blockchain applications to be a staggering $15 trillion, indicating vast room for Ethereum’s growth.Will Ethereum Become The Silicon Valley Of Blockchain?\n\nVanEck’s analysis paints a picture of Ethereum as a potential “Silicon Valley of Blockchain,” a platform that fosters innovation and disrupts traditional industries. The ability to build and deploy smart contracts on Ethereum empowers developers to create new applications and financial instruments that could revolutionize sectors like supply chain management, identity verification, and even voting systems. As Ethereum’s ecosystem flourishes, the value proposition of holding ETH tokens strengthens, potentially fueling the predicted price surge.\n\nNewsBTC\n\nEther Price Prediction\n\nMeanwhile, according to the latest forecast, Ether is expected to rise by 2.13%, reaching $3,861 by July 6, 2024. This projection is supported by a set of technical indicators that currently signal a bullish sentiment. The overall market sentiment for Ethereum is optimistic, with a Fear & Greed Index reading of 78, indicating “Extreme Greed.” This index measures market emotions and sentiment from various sources, and a high level like this often signals that investors are becoming overly confident, which can sometimes precede a market correction.\n\nIn terms of recent performance, Ethereum has experienced 17 green days out of the last 30, translating to a 57% rate of positive daily performance. This indicates a generally upward trend with consistent gains. However, over the past 30 days, Ethereum has shown an 11.30% volatility rate. This level of volatility is relatively high, implying that while the price is expected to rise, it could experience significant fluctuations.\n\nFeatured image from InvestorsObserver, chart from TradingView"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPMHZZZllEelhjZ1I4cXhYNGZCNERCOVlpamZONmJSYm1NSmVHYWstMDYtY1FIQ2x5cFV2SWMzRlhLckNzSEhuR2pkSUV1SjhMVE9uLVVEVzJkUklQQVRwUVNxODNndk50N2xla2pNNllRd0dma3pKRnpsdVNmQjNEd01tcW5GSjMtTklGajR2QWNYbnFVb1BTR2FYRHRsekxhQllkWjBfb9IBrAFBVV95cUxPUzFXU0pCTjdET2FrZ2E0czlJX2lzMmpvcWJvdzVfemZhUEcxbEY5eVZla1FRYWNDNHdnTURZdTl0QTUxS0ZTUkFsSzNJWWlNT0YxcmVYOUlEWnFZSUZabGp1Sy1GSlRKU1RhYzEzVHdKUmxzX2N3Sy0zNmRPYUpYajJkMW5mRVNaRHNmWXQwbkFtWmpPVThac0xWR0ppeERKZmU5UVk4cnRCQlpQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "What Will Happen If VanEck’s Ethereum Price Prediction of $22,000 Comes True? - CoinGape",
        "content": "How huge this will be when the ETH, which is trading below the $4k range, reaches the $22,000 mark. For some, it might be impossible, but analyzing Bitcoin’s performance over the years raises hopes and makes it not necessarily impossible. Moreover, Ethereum is the second biggest cryptocurrency in the market, both in popularity and its market cap, so the prediction might come true. But what is the deal with this Ethereum price prediction, and what will happen if the price reaches the $22,000 mark? Let us discuss that in this blog.\n\nVanEck Claims Ethereum Price To Surge To $22,000 By 2030\n\nVanEck, a famous Wall Street Investment Manager, is an Ethereum enthusiast who believes that,\n\nadvertisement\n\nETH is a revolutionary asset with few parallels in the non-crypto financial world. ETH can be thought of as ‘Digital Oil’ because it is consumed by engaging in activity on Ethereum\n\nBut that’s not all, as he has recently posted on X revealing the Ethereum prediction, which states that the Ethereum price will surge to $22,000 by the year 2030 under the influence of the Ethereum ETF. VanEck and the team are trying to enter the Ethereum ETF market by listing their ETF and are quite enthusiastic about it.\n\nEven before the ETH ETF approval, he had predicted that the ETFs might generate $3.1 to $4.8 Billion in inflows within the first five months of listing. And now, after the approval, he posted a prediction about the Ethereum price considering the influence of the Ethereum ETF.\n\nThe post says “We’ve raised our 2030 ETH price target to $22,000, influenced by ether ETF news, scaling progress, and our read of on-chain data.”\n\nWe’ve raised our 2030 ETH price target to $22K, influenced by ether ETF news, scaling progress, and our read of onchain data. Additionally, we’ve analyzed how ETH and BTC perform in both traditional and crypto-only portfolios for optimal returns. @Matthew_Sigel @Patrick_Bush_VE… — VanEck (@vaneck_us) June 5, 2024\n\nHe further provides a detailed report authorized by Denis Zinoview, Matthew Sigel, and Patrick Bush, explaining how this will be possible. This target of $22,000 is the base price target. The report actually included the bullish and the bearish price targets of $154,000 and $360.\n\nWhat Will Happen If This Prediction Comes True?\n\nEthereum is among the biggest digital economies, where 20 Million monthly users stay active on the network. In a year’s interval, it has processed $4 trillion worth of transactions and the transfers of stablecoins worth around $5.5 Trillion. Moreover, it has a value of $3,849.92 with $462 Billion in market capitalization and $13.9 Billion in trading volume, highlighting its dominance in the market.\n\nIf VanEck’s Ethereum price prediction comes true, it will become an economy worth $2.6 Trillion. This will become even bigger than Bitcoin, which has $1.3 Trillion with a BTC price of $71K. Every trader who holds Ethereum will make six times the value, creating millionaires and billionaires.\n\nFor example, a person who has invested $10,000 to buy Ethereum at the current price, this investment will get around 2.6ETH tokens. Once the price rises to $22,000, the same 2.59ETH will be worth $57,142, making $47,142 in profits. The calculation can continue, and the 20,000 investment will make $94,285 in profits, $50,000 will make $235,714 in profits, etc.\n\nCan Ethereum Price Surge to $22,000?\n\nVanEck’s prediction is supported by multiple factors, including the dominance of Ethereum among all the Smart Contracts platforms. He has also envisioned a way to generate $66 Billion in cash flows, which will generated by the network to support this $2.2 trillion of capitalization after the ETH price hits $22,00.\n\nHe has highlighted that this surge to $22,000 will be driven by many growth factors, including the blockchain’s utility, the growth of digital finance, and AI by 2030.\n\nHowever, some constraints make it a little challenging to envision such huge growth. Ethereum price is almost one-sixth of the $22,000 prediction and has not achieved anywhere closer to that. Though Ethereum is among the highly demanded networks, it will be challenging to surge that high.\n\nMoreover, the continuous fear of being classified as a Security will always be haunting. The SEC has approved the Ethereum ETF, but the classification is still uncertain. If Ethereum gets classified as Security, it will constrain the development and price of the ETH.\n\nContinue Reading Can BNB Price Surge Any Higher Than This New ATH? Analysts Take\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOd0FGWHlfQlF4cG5wYzRIbnhwVklaczJweVRoWGZWT0MtYng3a0lUaE1ZMy1nelFPYXFEZmN6cWxvNlpEaWFiMkFzZU54QWUybHZibUVReTZjSHV6dFlUMFRlVGNjVlZqNjdIVmNfZWY3QW9zSzNBeUY1LW54cElWSXZoZWFiRzZmeTk2UVJ6T1BlUXVGb05tU1NsNl9paDlLdjJR0gGoAUFVX3lxTE1SazBiUF81a0Z2MnVOX1BmSGlVRWxzZm4zaTlWVzl5XzZmd2U4TzdrTXZobmVSRXpDSHVteXdrUEFGc0NEQlR0dnlkSHlzZzBpd1duS0hfbGhrSWNvRVd2bVAydUREckRDSGFJZkZXRkNycmJVMVQ3SW9rM2ZvalF3bXRtaVJkYk5QLTV3VUNmT0lmWE9lRkFwSDVra2VHR1RNRGhuMkxYYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin Price Braces For $74K Peak But Ethereum Shows More Potential: QCP Capital - CoinGape",
        "content": "In a recent market analysis, QCP Capital has highlighted significant bullish momentum in the crypto market, particularly for Bitcoin (BTC) price. However, QCP Capital expects Ethereum (ETH) to grab the spotlight. In their report, they highlighted that Bitcoin Exchange-Traded Funds (ETFs) has experienced a robust 15-day inflow streak.\n\nQCP Capital Prediction On Bitcoin & Ethereum\n\nThe Bitcoin ETFs witnessed an influx of $886.1 million on Tuesday, June 4. This marked the second-largest inflow since its inception. Moreover, this substantial inflow has been accompanied by notable activity in the options market.\n\nadvertisement\n\nFurthermore, QCP Capital observed considerable buying interest in Bitcoin call options expiring in June. Hence, this trend indicates strong bullish sentiment. Moreover, the Bitcoin price is positioning for a potential breakout above the all-time high of $74,000 this month.\n\nThe firm’s analysis suggests that market participants are gearing up for a decisive move, reflecting confidence in Bitcoin price’s continued upward trajectory. However, while Bitcoin has been at the forefront of this recent surge, Ethereum has been trailing behind.\n\nDespite this lag, QCP Capital anticipates that ETH could soon catch up and possibly even outperform the Bitcoin price surge. The rally will particularly be witnessed when the Spot Ethereum ETF begins trading, stated QCP Capital. The firm posits that the introduction of an Ethereum ETF could trigger significant rotations of funds from Bitcoin to Ether, providing additional upward momentum for the latter.\n\nAlso Read: Bull Run: Can Crypto Market Reach $3 Trillion, With Bitcoin Price Above $71,000?\n\nAdvise On Capitalizing ETH Surge\n\nQCP Capital has also proposed a strategic trade to capitalize on this expected Ethereum price rally. They recommend achieving high convexity exposure to an Ethereum price increase in the near term through Zero Cost ETH September Knock-In, Knock-Out (KIKO) options.\n\nThe trade structure involves a short put strike at $3,500 with a knock-in level at $3,000, and a long call strike at $4,000 with a knock-out level at $6,400. This setup offers a maximum payout of 219.55% per annum or $2,400 per Ethereum if the spot price expires just below $6,400.\n\nHowever, the cost of this trade is zero, but there is a downside risk. If the spot price falls below $3,000 at expiry, the investor must buy ETH at $3,500. As of now, Ethereum price is hovering around $3,700, indicating a bullish outlook in line with QCP Capital’s analysis.\n\nAlso Read: Bitcoin At $72K Sets $1.5B Liquidation Cascade, Willy Woo Predicts What’s Next\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOM1M5NnZwcVdqdVVHZ3BKREppdzJWdWlDbzAxVC10UlVhdm5feF82Z25IQlVtUDMwa2UwbVFyWkdPODJkVXdCZzNhTHpLdWl2OW5Ud1pHeE1ZZVFzWHV3TnZCYWM3bHNudElZNXROV1BINE4zRF83b0t3cFJxRjBKLUpTcy11MGc1RVpjaGxlY0FyaldPMW1nUFF2N196RUxSczlndm5taEp0YzAzcXdzRFNR0gG3AUFVX3lxTE0zdmlWLWdXazl0UjhlVklpTHhnUTdlcWZ2Ym9yR2xiSGpCMFBMaTlXTktESEN0WEVGelB1MW5ZVHBuUGVqS05CdEJzcF91Z0d4Z1dsNTR1Q21HZmt5YWhjbEx4T2VraEpqampMTUpuWEdHQjdfVFlaUmlKMUJzWW1hTXR4RFhTSHhHM2tRNEdRb3V5WVAtWm9nSWRXNUFOcWFfZUwzVXFHOWtsYk1vV0MzZlZQcFB1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) on Verge of Hitting $71,000, Ethereum (ETH) Shows Bizarre Activity, Will Solana (SOL) Become Number 1 Again? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin has finally broken through $70,000, setting itself up for further growth. As we can see, there is a good chance it will succeed at it, as the price is moving closer to $71,000 and trading volumes remain elevated.\n\nThis bullish momentum is easily visible on the daily chart of Bitcoin versus the U.S. dollar (BTC/USD). Bitcoin is currently trading around $70,977 with the price action showing a steady climb. A major turning point was reached recently when the market broke above $70,000, indicating fresh interest and optimism. This optimistic view is supported by several important technical indicators.\n\nThe 50-day and 200-day moving averages in particular are positioned in a way that indicates sustained upward momentum. A traditional bullish signal known as a golden cross formed when the 50-day moving average crossed above the 200-day moving average.\n\nVolume analysis supports this optimistic scenario even more. The recent price surge is accompanied by elevated trading volumes, indicating strong market participation and interest at these price points. Maintaining the present upward trend and possibly pushing Bitcoin above $71,000 require this volume support.\n\nAdvertisement\n\nFurthermore Bitcoin remains a favorable investment option given the current macroeconomic climate. Bitcoin's allure as a store of value and safeguard against the devaluation of fiat currencies is still great in light of persistent worries about economic stability.\n\nEthereum's weird position\n\nThe surge toward $3,800 was not expected by the market, yet we are here. However, Ethereum's activity raises a lot of questions as the asset's price is going through an extremely prolonged consolidation phase, and it is unclear whether or not it will come out as a winner from it.\n\nAfter the steep increase to $3,800, the price of Ethereum has been trapped in a narrow range, as can be seen by looking at the daily chart of ETH against the USD. When buyers and sellers are evenly matched, the market is usually in a state of indecision, as indicated by this sideways movement.\n\nEthereum has tested $3,750 several times without breaking below what appears to be the key support level. A number of technical indicators shed light on Ethereum's present situation. A golden cross, or the potential continuation of a bullish trend, could be indicated if the 50-day moving average, which is approaching the 200-day moving average, crosses above it. However, the market continues to be cautious until such a crossover occurs.\n\nFurther more, the fact that trading volumes have been comparatively low during this phase of consolidation suggests that a sizable portion of market participants are holding off until a more distinct trend becomes apparent.\n\nSolana's market position\n\nSolana's path on the market was tough in the last few weeks, but things are changing rapidly, with Bitcoin bouncing toward $70,000 and investors gaining some of that positive sentiment back. However, fundamentally, Solana might not be doing as well as it used to.\n\nSolana shows a gradual but consistent recovery. The 50-day and 200-day moving averages are supporting the modest uptrend that Solana is currently showing at about $172. 92.\n\nThough technical indicators point to a bright future, the larger ecosystem surrounding Solana paints a different picture. The Solana meme coin scene used to be a hive of activity and creativity, but it is not as active as recently.\n\nThere has not been much buying interest in Solana, as seen by the low trading volume. This is concerning because price movements need to be supported and maintained by sustained volume, which is probably the biggest issue for it right now."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE91LVRpZWI1RHB4bExiVnhmLWUyNnBKTUxTOGpDTHpmLW9naFFRTWtEdXdQNklfMWtUa0U4Yk1SRnR1UTFjaFhzaWduenJORWF6bkpxUXMzR2V4UnhoQTFCbW5XLTBINm9iaDJiNnF2VWVkSGtIUEtWN0lzQ2VPWEHSAYQBQVVfeXFMTnFpV1RHSnFDZEQzQVdVNW9OMEdvQll4TkctSEx0ZWVLZjU0UnIzNkpfTjdzV1NhRVNDcWxNSXZYYWRmVjNCVjVHWDNFTmlTdnNCU3Z3bEdQdVNic0o5Smt5anZBbWJWUDhzU0FTcGJxdGIxNlNOMnFVLTF3dl84UmN6U1hF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price to hit $22,000 by 2030: VanEck predicts - AMBCrypto News",
        "content": "VanEck projects Ethereum at $22,000 by 2030, fueled by ETF approval and institutional adoption.\n\nVanEck says ETH could hit $154,000 in a bullish market and fall to $360 in a bearish one.\n\nAfter days of anticipation, Bitcoin [BTC] surpassed the $70K milestone on 5th June. Mirroring this upward trend, Ethereum [ETH] experienced a 1.34% increase at the time of writing.\n\nIncreased institutional interest\n\nAmid the positive market momentum, VanEck, a prominent asset manager, projected that Ethereum will reach $22,000 per coin by 2030.\n\nThis bullish prediction is based on the anticipated approval of spot Ethereum exchange-traded funds (ETFs), expected to take place in July.\n\nElaborating further on the matter, VanEck in its recent blog post noted,\n\n“This development would allow financial advisors and institutional investors to hold this unique asset with the security of qualified custodians, and benefit from the pricing and liquidity advantages characteristic of ETFs.”\n\nSeeing such pros, VanEck updated its financial model to evaluate ETH’s investment case. This potential market shift highlights the increasing acceptance and integration of cryptocurrencies into mainstream financial systems.\n\nWhat are the metrics saying?\n\nThis sentiment was further confirmed by AMBCrypto’s analysis of Santiment data that revealed a hike in total supply in profits. As of the latest update, that number has risen to over 132 million.\n\nThis explains why VanEck views Ethereum as a gateway for investors that can tap into a rapidly expanding digital economy.\n\nThe firm’s analysis of Ethereum’s performance highlights impressive metrics, such as 20 million monthly active users, $4 trillion in transactions, and $5.5 trillion in yearly stablecoin transfers. It further added,\n\n“The centerpiece asset of this financial system is the ETH token, and in our updated base case, we believe it to be worth $22,000 by 2030, representing a total return of 487% from today’s ETH price, a compound annual growth rate (CAGR) of 37.8%.”\n\nThis highlights that according to VanEck’s analysts, the base case prediction for Ethereum is $22,000. They foresee the cryptocurrency reaching up to $154,000 in a bullish market and potentially falling to $360 in a bearish one.\n\nHow is the community reacting?\n\nInterestingly, the community also appeared to be optimistic about ETH’s future, as noted by a well-known trader, Yoddha, who said,"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNUE1pU3diT1dWdlhseFVydHlDU3ZsSWVaMFlickZFbmR1M2x3SW5Ja2RlMmtwUng3NEFJWFRHZ0NGTnA0MWpqSElkbzFpMktwOTh0aGxjV1Mtem40LWJmbkxyeE9lRHV1cGRaT3lYQUpkVjRPeWVUNGNqQ1lLNjFZV3FYejNCdXpveF96bHlNa1IxOVFVVDZRQjJB0gGfAUFVX3lxTFBsQU42cDNJOHFTRktWemdtbGNSR0h6N0RNU0N6THBNQ2J5MDhCNTNiZXM4clBOY1dRUEFhelljUmNiaTk3TkFNZVpVV3JZOWtjeWVFeTQxRjdoc3d3TW10Wi1rQ2tUNGdwLUlVM1FjdmtSZmh2OWFnZHNBUjlFdXQyVk92NUNJdWxnV2JKemxTS2ZqUVBmd1lmS0lqUjFfbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Baby Doge Token Contract Proposal On Ethereum & BNB Chain Passes, Here’s All - CoinGape",
        "content": "Baby Doge, a unique cryptocurrency that draws inspiration from the popular meme crypto Dogecoin, has made a significant announcement, capturing the attention of the broader crypto market. The proposal to renounce ownership of the token contract on both Ethereum & BNB Chain, which was initially suggested on May 29, has been successfully passed today, June 6.\n\nThis momentous event has sent shockwaves through the global crypto landscape, sparking a flurry of discussions in the community. Let’s delve deeper into the development that aims to aid Baby Doge to branch out to Ethereum and BNB Chain.\n\nadvertisement\n\nBaby Doge Multi-Chain Proposal Passes: What’s The Scoop?\n\nZooming past to date, the voting has ended with the odds substantially tilted towards the proposal’s passing. As per insights by ‘snapshot.org,’ the meme coin’s voting results illustrate that the proposal gained 848 trillion votes, worth 99.53%, in favor, while 0.47%, worth 4 trillion votes, were against the development.\n\nThe voting started on May 29 and ended on June 05. According to Baby Doge’s community’s official announcement, this proposal’s primary objectives include streamlining decentralization, security, and community trust, aligning with DeFi’s true ethos.\n\nMeanwhile, the expected time for the renouncement process is approximately 1-2 weeks, ‘including verification and community communication.’ The completion of the process is expected to widen crypto’s user appeal across the global crypto realm, potentially impacting price.\n\nAlso Read: 4 Must-Buy Gaming Crypto For Bullish June\n\nBabyDoge Price Jumps\n\nIn the interim, upon the news surfacing within the market, BabyDoge’s price saw a 1.64% uptick in value in the past 24 hours, reaching $0.000000001968. The token appears to be witnessing an extended consolidation period, looking at broader time frame price charts. Its 24-hour lows and highs are $0.000000001913 and $0.000000001963, respectively.\n\nRenouncing ownership of the BabyDoge token contract on ETH and BNB Chain comes as a strategic mover to achieve complete decentralization and reinforce the crypto’s commitment to transparency and security for users. This could potentially set the stage for significant price gains ahead as BabyDoge further revolutionizes its cryptographic journey.\n\nAlso Read: ECB Cuts Rate Signaling Crypto Rally Ahead, US Fed To Follow Suit?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTld2MlJXU3hHMk5OZjR4ZUxDNzU3U0VPQUlFTDh5dFlhMlFkZ1dwM054MmJ3Y05Lc3dCaTVzMDFmYzQ0UW14eFdtcjhvTnA0dmk5NzJ0VUswb2Y1TUlCWTB3cHpHODNIb0RvQTI1T00xY2IwZkcweXVhcC03UWMzb2wwQ193anhqeDdOZFBJTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "ETF Ethereum: A potential of $4 billion in just 5 months! - Cointribune EN",
        "content": "Thu 06 Jun 2024 ▪ 3 min read ▪ by Ariela R.\n\nApproved on May 24, Ethereum ETFs are about to transform the crypto investment landscape. According to K33 Research, these digital assets could generate up to $4 billion in the next five months.\n\nEthereum ETF Prediction\n\nThe reasons behind the potential of Ethereum ETFs\n\nMany cryptography experts expect Ethereum ETFs to follow the path paved by Bitcoin ETFs. Since their launch, the latter have experienced resounding success.\n\nAccording to K33 Research, this estimate is based on the relative market share of Ethereum assets under management compared to Bitcoin. It currently represents 28%. With institutional funds controlling 3.3% of the circulating ETH supply, K33 anticipates significant inflows. These would reach between $3.1 billion and $4.8 billion, or between 750,000 and 1 million ETH.\n\nDiscover our newsletter This link uses an affiliate program.\n\nComparison with Bitcoin ETFs\n\nEthereum ETFs are directly inspired by the Bitcoin ETF model. Since January, American Bitcoin ETFs have absorbed $13.9 billion. Globally, they control more than one million BTC. This represents over 5% of the circulating BTC supply.\n\nUsing this dynamic as a reference, forecasts for Ethereum ETFs seem promising. Bloomberg analyst Eric Balchunas, for example, anticipates returns between 10% and 20% of what Bitcoin ETFs have generated. “Recovering 20% would be a huge win,” he stated in a tweet.\n\nSuccess of Ethereum ETFs: What impact on the institutional market?\n\nEthereum ETFs are expected to strengthen Ethereum’s position in the institutional market. ETH futures contracts on the Chicago Mercantile Exchange already represent 23% of the size of Bitcoin. This reflects strong institutional demand.\n\nEuropean and Canadian funds also show a growing appetite for Ethereum ETFs. They hold about 1/3 of the assets under management compared to Bitcoin. This positive trend is expected to further stimulate institutional adoption of Ethereum.\n\nWith inflow predictions reaching up to $4 billion, Ethereum ETFs are thus positioned alongside Bitcoin as a pillar of crypto investments.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQaXFTU1BjZWxYaEwxanpoTTFXNGxlbzctWmlMVXgyQzQ1YlBXSE5sV3BobVdGQzZEMC05ai1uMzlBTXN4ZjM3WmpycmU3Z2h4bWdZZkp0ZjBTRko0QlBmLVFFaEpIR0czeEdqS3YtRWpNdDVPVWpjbWlqNl8zZE5mVmp5VWFzSHFfMWIzOV84ckzSAZ4BQVVfeXFMUG1CbjUyYmFHcEZJVVNGNTlQOGNQMU1IVzFISnR6M0lXc1V2UG1uN3NjVGJqQWFFSWQ2alhibHBxeFEzMHpPMDN1c2RPenhjOFQtZG1mdjJzOFRkazk3NVkzbmdfY1E0RUdpTV9NSFVjVXFtZEwtaXdWdWMxbUNrTEJyWEt3WTFhdkhjR1NZUnFlTV84a0s1eTJDTVhsT3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 06, 2024 - Analytics Insight",
        "content": "The continuation of the increase in Ethereum’s accumulation, specifically by wallets in certain holding ranges, has not been mirrored in the corresponding cryptocurrency market price. This could suggest a number of underlying market dynamics:\n\nBroader Market Sentiments: Various social events and news around the world, changes in government policies and rules, and trends in other popular cryptocurrencies , such as bitcoins, affected the cryptocurrency market. Such factors may modify the Ethereum price effect of Ethereum acquisitions.\n\nLiquidity Issues: While there is significant buying activity, more than the liquidity on exchanges might be required to reflect these changes immediately in market prices. If many investors are holding onto their Ethereum rather than trading it, price movements may be less volatile."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOTFN2TFpMcXVBUW96VmNXdjVtRjk5YjFDWmF1b1AzblQxVW9IRlFnUjJLNjJ4UkIwN0E5VmxhVldsS19IM0ZrYWJkbmhqZjVUeGd4b3F6RHFFbGRxZWdxWTI3RjFDTHZSMzl6TDMzamYtYWlCSnByYU5wUEs0T1NSYkgyQWJFNjZXaVBoOUJQVEHSAZ4BQVVfeXFMUFZySUx2Z0ZvM3lpblNpeDVVekxHWXZvQWhudGNySVo5Qlo1NW9TSlJoaXNpNnRDVU1MQUxaQlBKS2hBS0daaTBRX09hQ3Ffb0M3VkdaUDd1M2NwSHFaNUFRaDRoRDRNQjQ3aWtOdWdkLTN5MDNFVlk3MVRLWkpwUVZLNXdPMEo3cldLSWVMN3h5cHREWE84SlRQaFl0cXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 05, 2024 - Analytics Insight",
        "content": "Decline and Recovery: Ethereum price declined below the US$3,760 support zone. However, it found strong buying interest around US$3,720, forming a low at US$3,728.\n\nAttempted Rally: Following the low, ETH attempted to rally, moving past the US$3,800 level but encountering resistance just shy of US$3,840. A high was formed at US$3,836, after which the price entered a consolidation phase.\n\nConsolidation Phase: Currently, ETH is consolidating within a range, trading below the 23.6% Fibonacci retracement level of the recent upward move from US$3,728 to US$3,836."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOYnhCWUhDb2lXalRFZjZMM0VBZUVyUTdrX0NReFE0bzdybENtZEd1d3NIemRMNmRQb3JqMHdCblpaS1RpYlJVZ1hyODdYdXpGTGRfRXBYcjNmSi1rU2xJZkl1S1lQQ29ObW1Td0xEdUg1NGVHdmZ0dGV4ajZXcWdIOFlCSUbSAYoBQVVfeXFMTWJmU0JvY3hKWUIzUldrREpOTE8xUTdDYkRaNFZRUkpiUmpJQWhGQWtFOWRjUkxkeDdkb3pmV0JQbndPaEo1WU4td2ZKS0c0dGxhTTRfUXBJeGQ3U21tX3FzX3hNWFo2N0labllGMmtidVdNRzVOUGZNdHFwUmhvT09LYldKb1JzQUVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum DEX volume loses $2B in 7 days: Bad news for ETH? - AMBCrypto News",
        "content": "DEX volume fell to $1.03 billion, however, indicators revealed that ETH’s price could jump.\n\nThe liquidation levels suggested that the altcoin could leave more shorts in liquidations.\n\nActivity on Ethereum’s [ETH] Decentralized Exchanges has been declining for the past seven days, AMBCrypto confirmed. On the 28th of May, based on data from Messari, the volume was $3.34 billion.\n\nHowever, press time data showed that the DEX volume was down to $1.03 billion— A $2.21 billion decrease. An increase in the volume on DEXes would have implied more liquidity for Ethereum.\n\nSince it fell, it means that on-chain trades involving ETH were no longer as much as they were last week. Another interpretation points to decreased demand for the altcoin.\n\nA “slight” fall is not the end\n\nWith decreasing demand, ETH could find it challenging to experience a major price increase. At press time, the price of ETH was $3,763, representing a 3.50% decrease within the last week.\n\nThe underwhelming price action is one of the reasons some participants share the opinion that Ethereum might not be a significant part of the bull market.\n\nHowever, AMBCrypto found that the opinion was not factual. This was because of the signals shown by the Market Value to Realized Value (MVRV) Z Score. The MVRV has a strong correlation with price.\n\nAs a result, it shows when a cryptocurrency is in bearish or bullish phase. If the score if negative, it means that the asset is in a bear phase. From the chart below, the last time ETH was in such condition was in October 2023, meaning that the token had moved into the bull phase.\n\nAt press time, the MVRV Z Score was 1.63. A look at the peak of previous bull cycles like in 2017 and 2021 showed that the metric hit. 14.19 and 4.76 respectively. If the pattern was to repeat itself, then it mean Ethereum’s price could climb higher.\n\nBut that is for the long term. In the short term, AMBCrypto analyzed the liquidation levels. The liquidation level is the price an exchange forcefully close a trader’s position.\n\nBears beware! ETH looks ready to recover\n\nThe rationale behind this is to prevent further losses. At press time, Ethereum’s large-scale liquidations could take place between $3,882 up to $3,946. This implied that price could move toward the mentioned region.\n\nFurthermore, we checked the Cumulative Liquidations Levels Delta (CLLD). A positive value of this reading implies that there are more long liquidations. A negative reading suggests that short liquidations were dominance.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nLooking at the chart, the CLLD was negative, and short liquidations in the last seven days has been over $59 million.\n\nBut concerning the price, the negative CLLD is bullish for ETH as late short might fail to catch the dip. In this instance, ETH might recover, and the projection to $3,946 could be come to pass."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNQk5LZzlCNUc5djZpcTZoZEZFME5udGVwVlU4c2hQczNJX2FkSnZuQ3h0RXY1ZGhkY3ZxTGhkXzZ5TXVOMzc5U1ItT1pwOVdFMEZScFB2bHoyaVVqSlk2TGhUa2FwX2pOVzZJNTUwc3Z2VG50alpSZjI5eXZTS3pTNlk5QmJyZHk0UjJOU0VGVGrSAZYBQVVfeXFMT3BlZUltcWVFZjllNURVMk4xbzNFc2NWOTNXeVBNZXVBbTlYcEl4bG4wa0xWa0s3dW9XRUNVVV9PVm9XcXlUTnZ0bGF3U3ZQTVVHOGQ5V1ZWelRFbmtBajZiLWtPSDhSSjM0OFk3T2o3UElTY1RwMS1LMXVNUUsyeWNod0pNeTJvLUNMSVc0STlGdnJmWEZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum struggles to rally even as Bitcoin surges past $70,000 - AMBCrypto News",
        "content": "Ethereum was trading in the $3,800 price zone at the time of this writing.\n\nETH was creating a string support for itself around this level.\n\nBitcoin [BTC] recently surpassed the $71,000 price mark, which typically shifts market focus to Ethereum [ETH]. An analysis showed that while ETH experienced a rally of its own, it was short-lived.\n\nEthereum fails to sustain momentum\n\nAn analysis of Ethereum on a daily timeframe chart revealed a slight positive movement at the end of trading on 4th June. The chart showed that ETH saw an increase of over 1%, bringing its price to around $3,810.\n\nAlthough modest, this move pushed ETH into the $3,800 price region for the first time in days and marked its first positive movement in three days. However, as of this writing, ETH has returned to a negative trend.\n\nAnalysis showed that, despite maintaining the $3,800 price range, Ethereum was trading with a decline of less than 1%.\n\nA study of the Relative Strength Index (RSI) indicated that it remained in a bull trend despite the recent poor price performance, with the RSI close to 65 at the time of writing.\n\nAdditionally, the $3,700 price range is emerging as the immediate support level, as the price has been consistently bouncing off this level since reaching it.\n\nEthereum volume shows positive signs\n\nAn analysis of Ethereum’s volume showed a recovery since the start of the new month. Initially, the volume fell to around $9 billion, but it has gradually increased, recently reaching its highest point this month.\n\nBy the end of trading on 4th June, the volume was around $13.5 billion, and as of this writing, it has risen to over $14.6 billion. This increase in volume is a key metric to monitor when predicting the potential direction of Ethereum’s price movement.\n\nWhile the price has not significantly increased yet, the rise in volume indicates heightened activity, which could influence the price movement.\n\nETH in profit sees a slight increase\n\nAnalysis of Ethereum’s volume in profit revealed an increase of approximately 2 million ETH in the last 24 hours.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAccording to Santiment, at the end of trading on 4th July, the number of ETH in profit was around 129.5 million.\n\nAs of this writing, that number has risen to over 131 million. This increase means that the percentage of supply in profit has grown from about 93.4% to over 94%."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNVjF1aXVNRWs1bGFNc3J2alRxd1RTeUVfN1pRcUZxblRkb25pcVdrZWNkUk5paUxpV05QTGhGY3FLUWxoWDEzcGxUZFFZdEpwcXQ1NXhiRTQ2ZTFjQ2wyV21fYVp2dWhSQnlicGl4NlJ5b0o3ZEVJTWlLWS1VZHNhTXZhdTBDYl9jSUpRYWJhcERabUtuUnd4YUdwWHFWZXYxME9CWEtESUtIZ3FnMWwzX3FZcnpET3pyaloxRExJNG5jTG95Y0EwMEpmVVFGVy1MaDg2TUM4UdIB5AFBVV95cUxNODRiNlRSQUh3RzBWd2tZdXpQclpNdnVnRmFUaWo3dEx2ZmNqMlZDTDhBX3hvVjBTY2xZMFVuRFBTaHBsZU13U3dSRnhIeGd0YzVUWXhTeUhVSkt1Q29OdDdtdnFUZjJBS2JnSWhCdnVvT2Z0NWhMTEIyRGxEbm5ja1h0R3ZrcnpSSjhXR0RvaTQxWllPMlREazR2a01IUGRyY3BubUZyTXAzQUVVaUlQNlFnekRQbFJKLWZQZG1sMVZtbHpDdUhXQ001R0oySTVPNmVLYnZIeGJmYWhQdEkwNzk3Nmg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Traders say the launch of spot Ethereum ETFs will trigger a “strong upward move” for ETH price - Analytics Insight",
        "content": "The anticipation and the eventual approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC) fueled a 37% rally in Ether’s price over the same time period.\n\nVan de Poppe added that the pending market launch of Ethereum ETFs will push the ETH price up."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiigJBVV95cUxPWlhIeVRqcnA3dmtGMGE2LXlFcVF5cld3U0lIUndKdXQ3VmEtNnJ6YWVLbVU3Ry03NnBxU1NvbzJHbzQybWZNZk9ha1JJQll4Rld1LTlnb0ZUUzI1bE9vcF9mYU94dmt5SUFEdF9SOTJLejZ1QnI3V2dISlJvQ2dsdDhYSHpDOG1VSXlhLXNHTjVFNG50aGhyY2cxTXpZRXNoT3hBYnNrekxxbjBwc09palVZanJ0bGFrSjJRSDZoVEhkUlRYYzNZUHJMM1czWU0zdWRrVWxSMjJBREdCWUVWMXg3OXpSS0pRNXFWekRxdEZWM3pCUGsySGYyQjVrT1dPeDdLbUluaE9JUdIBjwJBVV95cUxObXNDVk5tRW96V2xrc3JkdGtuaUV6SVhJOVUwZThHS3Eydl9BVEFYVDN1el91Rkxfa0dKY1pIVXBRUXNZWUM0NUZweTJERmhmeWtsRHZzM0VhbEZTMWxDdFpvNFRQNzh5QUxxcWZOSTZ1S18yRF9KcFJfWmkyVHM1b2xMdWVxTGlSN1BGcllIeS1GOUhBQ1BseGlwSXRNVXRLeElFbTByZmY2QTlTQlZubHdYQWd0ZFlNSW9Rdm53NTBVcHQ4TExKaVB5QTdmWEx1YWYtMG84cU9OOEtjY3RIVUEwYWkyLTIzeUVfZWxQREVmX0RvRGVyZlNZejhSYVpPamxvRXc5R1djaU1kUDh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "BlockDAG’s Keynote 2 Drops, How Top-Class Crypto Mining Machines Take On And Win Against Flare Blockchain and Ethereum 2024 Predictions - ThePrint",
        "content": "The approval of the first-ever spot Ether ETFs in the U.S. boosted Ethereum’s market sentiment, pushing its price near $4,000 before a sharp correction. Currently, Ethereum trades at $3,738.32. These factors contribute to the optimistic Ethereum 2024 predictions and underline its potential for growth.\n\nCryptofy Hub forecasts Ethereum reaching $10,000 by the end of 2024, driven by a rising wedge pattern on a multi-year chart. They highlighted converging support levels indicating a strong uptrend, with whale transaction value rising by 7.28% recently. Prominent analyst Ali Martinez noted a significant increase in wallets holding at least 10,000 ETH, suggesting a shift from distribution to accumulation.\n\nOne sign of market recovery is Ethereum’s strong predictions and Flare Blockchain’s new DeFi protocols. Amid these developments, BlockDAG , a layer 1 project, stands out with a stellar presale. BlockDAG recently launched its second keynote, highlighting its technical prowess and crypto mining machines, which could make it one of the top blockchain projects. Following the keynote, BlockDAG’s presale surged to over $42.3 million. This article will compare Ethereum, Flare Blockchain, and BlockDAG, examining their similarities and differences to help readers identify the next big crypto investment.\n\nFlare Blockchain: DeFi Enhancements and Innovations\n\nFlare Blockchain is advancing in the DeFi space with the introduction of Sceptre, a new liquid staking protocol by Rome Blockchain Labs (RBL), now in private beta. Sceptre aims to maximize the yield of FLR tokens by allowing holders to participate in DeFi protocols while still claiming native Flare rewards and monthly FlareDrops. It integrates Flare’s reward mechanisms, enabling users to stake FLR tokens and receive sFLR, which provides liquidity for lending protocols and DEX liquidity pools.\n\nFlare’s co-founder, Hugo Philion, emphasized the community-focused tokenomics, allocating 60% of all tokens to community members through FlareDrops until January 2026. Alexander Elhorst, COO of Sceptre, highlighted the potential for accelerated growth due to liquid staking. These developments underscore Flare Blockchain’s commitment to enhancing its DeFi capabilities and supporting its community.\n\nBlockDAG: Keynote Highlights and Mining Innovations\n\nBlockDAG recently held its second keynote , showcasing significant advancements and its new crypto mining machines. The keynote covered various topics, including the release of the X1 Miner App, updates on the blockchain, and global marketing efforts. BlockDAG has made notable progress, such as launching its mainnet, expanding its ecosystem, and receiving recognition from major publications like Forbes and Bloomberg. The keynote emphasized BlockDAG’s vision of a decentralized world and its commitment to innovation.\n\nThe keynote highlighted BlockDAG’s X series crypto mining machines: X10, X30, and X100. These machines cater to different mining needs, from home-friendly setups to large-scale operations. The X10 miner is compact and efficient, with a 100 MH/s hash rate, suitable for home use. The X30 miner offers a 280 GH/s hash rate, tripling the efficiency of earlier models. The X100 miner, designed for serious enthusiasts, boasts a 2 TH/s hash rate and advanced ASIC technology.\n\nFollowing the keynote, BlockDAG’s presale surged to over $42.3 million. This strong performance reflects investor confidence in BlockDAG’s potential and the appeal of its innovative crypto mining machines. The ongoing presale, currently in its 16th batch, has sold over 10.8 billion coins at $0.001 each. BlockDAG’s roadmap includes a mainnet launch within the next four months, promising significant growth and advancements in the blockchain space.\n\nKey Insights\n\nWhile Ethereum remains a leader in DeFi with a strong growth forecast and significant whale accumulation, and Flare Blockchain enhances its DeFi capabilities with innovative protocols like Sceptre, BlockDAG stands out with its impressive presale performance, technical advancements, and promising projections. BlockDAG’s second keynote highlighted the X series crypto mining machines, underscoring its technical prowess. With over $42.3 million raised in its presale and advanced mining solutions like the X10, X30, and X100, BlockDAG is well-positioned for future success. For investors seeking the next big crypto investment, BlockDAG presents a compelling opportunity.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPQU9QdDNOVDBiT2ZaQ2k0ME1fbFF1aTE1R1FCdE1ZejUtZzVhczF1RVkwQ2c5WkpVMHRVR3Nma3JKeW1FYW16YWxidWtLc1RkTnJnaWFIbU1CbDVMcWpvZWwzTjhRcm1VOFZibXUzM3dhZkJfOXRmQXAtRWpKTHFIZF91UXU1aU5xQ2hheVdpd09CaHh5Vm1pY1NNSjRKQXZ3cGZuR3VfX2VEUzFleHRIV2V2UEVxeUplLXRFdjlNbXZPLWR6WUZaS1dxY0tWa2xLWmpXcmFOeTVQRC1kYURZaEtwSG50c1pnZTgtVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "The Surprise Cryptocurrency to Invest in After Solana and Ethereum: Furrever Token's Special 25% Bonus Offer - Gary Skentelbery",
        "content": "Understanding the complexities of the crypto market can be challenging, with Bitcoin and Ethereum being the most well-known names. However, Furrever Token is quickly gaining popularity as a new meme token. We’ll compare these cryptocurrencies and explain why Furrever Token is worth watching.\n\nSolana Surpasses Ethereum in Active Addresses\n\nSolana has been making critical strides within the crypto world, encountering fast development and broad appropriation. In May 2024, it outperformed Ethereum within the number of dynamic addresses. This noteworthy rise is due to Solana’s lower exchange expenses, faster preparation times, and a solid environment of decentralized applications (dApps). With near to 42 million dynamic addresses, Solana’s DeFi division too saw a 33% increment in addition to esteem locked, coming to £1.28 billion.\n\nThis surge has started to expand and venture in Solana, setting it up as a solid competitor to Ethereum. Examiners have indeed named this period the beginning of a “Solana Summer,” determining proceeded development and potential record highs for SOL.\n\nEthereum’s Potential ETF Approval Poised to Attract £5 Billion, Reinforcing Its Market Dominance Amidst Solana’s Rise\n\nIn spite of Solana’s later victories, Ethereum remains a foundational column of the blockchain industry. The anticipated endorsement of an Ethereum spot ETF by the SEC seems to pull in up to $5 billion in unused speculations, altogether boosting ETH’s cost and advertise cap. This deluge would not as it would strengthen Ethereum’s dominance but moreover emphatically affect the complete cryptocurrency showcase.\n\nEthereum’s continuous developments, counting its move to Ethereum 2.0 and persistent changes in versatility and security, guarantee it remains a major player within the blockchain space. The competition between Ethereum and Solana highlights an energetic and advancing scene where both stages drive each other towards more noteworthy advancement and selection.\n\n25% Bonus on Purchases: Last 4 Days\n\nFurrever Token is in stage 9 of its 10-stage presale, having raised over £1.2 million. The current cost is $0.000732, with projections recommending up to 15x returns. They have started an introductory promotion to buy new Furrever Token right now at a bonus of 25% for a limited time only. To take advantage of this offer, simply use the exclusive bonus code: FURR25.\n\nLimited-Time Offer\n\nThis special promotion begins on Friday, 31/05/2024 at 17:00 UTC and will conclude on Monday, 10/06/2024 at 17:00 UTC. This is your opportunity to make your involvement with the developing digital economy of Furrever Token even more valuable.\n\nHere’s How You’ll Claim Your Reward:\n\nVisit the Furrever Token Buy Page. Enter the bonus code FURR25 during your purchase. Receive 25% extra Furrever Tokens instantly!\n\nIf You Invest £1000 in Furrever Token Today\n\nWith £1000, you can purchase about 1,366,120 tokens. With the 25% bonus, you receive an additional 341,530 tokens, bringing your total to approximately 1,707,650 tokens. Assuming the token price remains the same at $0.000732, your investment would be worth about £1250 by the end of June. This bonus not only increases your holdings but also enhances the value of your investment in the growing Furrever Token ecosystem.\n\nDon’t lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n*This information is sponsored and in no way endorsed by Warrington Worldwide – please seek professional advice before making any investments."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE43X0E3OHRldFBsd2VPb1NzaGt6OWZmZzlWUnBjSE02ME1Ec1h3U2tPR2FFS2RveXB2WFE1d1hwSHY2UkZydDhDalE1SzQzNWxVemxEUUxSRUxDQ0Y3QnliNjhodDRpQ2VlSVBoaHFWaGtxT1pz0gF4QVVfeXFMUGVLT2NMdDlqSkVzZEppQnZ6RUQ1Y3Z3UDViWVdoRmNCVjBfazZoRW96TnlfNmdJejFlVWJ6OXVLaWdJN2Fjc0tSbHlRV0VFWGtfZ29ZQkV2NVl0bFk5eFhGblg4OEN0SFE4TjBycWNuWktPRmZUSVdl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum a Good Investment in 2024? - CoinCodex",
        "content": "Ethereum has a lot going for it as we approach the halfway point of 2024. It's comfortably the second-largest cryptocurrency in terms of market capitalization and enjoys a lot of popularity in the community thanks to its smart contract capabilities and diverse ecosystem. In addition, whether you’re interested in swapping tokens, lending crypto, collecting NFTs or using stablecoins, chances are that the most exciting developments are happening on Ethereum first.\n\nIn addition to the general robustness of the Ethereum ecosystem, another thing that should make Ethereum investors happy is the fact that Ethereum will (very likely) soon be joining Bitcoin as the only cryptocurrency that can be traded via a spot ETF in the United States. This will give it that much more legitimacy among investors and streamline access for institutional investors.\n\nIn this article, we’ll be taking a look at Ethereum from multiple angles to help you determine if Ethereum is a good investment in 2024 or not. First, we’ll begin by listing various reasons why Ethereum might be a good investment in 2024. Of course, we’ll consider some of the downsides of investing in ETH as well.\n\nKey highlights: Ethereum's robust ecosystem and smart contract capabilities make it the second-largest cryptocurrency with broad community support.\n\nThe upcoming potential approval of an Ethereum spot ETF in the US could enhance its legitimacy and attract institutional investors.\n\nDeflationary pressures from reduced ETH issuance post-Merge and the EIP-1559 mechanism enhance its attractiveness as a long-term investment.\n\nLayer 2 solutions are mitigating Ethereum's scalability issues, maintaining its dominance in the smart contracts and DeFi space.\n\nHere’s why Ethereum is considered a good investment\n\nIn September 2022, pretty much every ETH investor and user held their breath as the network underwent its most significant upgrade ever – the transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) consensus algorithm – dubbed “The Merge.” While the price of ETH plummeted ahead of the upgrade, with investors fearing that it could have an adverse impact on the network, the price quickly recovered after it became obvious that the transition was a total success.\n\nNow, with the uncertainty of the Merge ever more distant in the rearview, there are several reasons that make Ethereum a good investment in 2024, including:\n\nThe amount of staked ETH is increasing\n\nDeflationary pressures are making ETH more valuable\n\nLayer 2 solutions are successfully mitigating Ethereum’s scalability issues\n\nEthereum is retaining its smart contract dominance\n\nIn the following sections, we’ll explore the reasons why Ethereum is a good investment in more detail. We’ll also present a case against Ethereum, so that you can get familiar with some of its drawbacks.\n\nA substantial amount of ETH is staked even before withdrawals are enabled\n\nAt the time of writing, 27.6 million ETH, or about 23% of the ETH supply, is locked in the staking deposit contract. This is impressive, given that staked ETH is worth over $100 billion and that users can withdraw it whenever they wish (barring a short queue list). It's worth noting that the ability to withdraw ETH has rolled out with the Shanghai update in early 2023.\n\nThe fact that tens of billion of dollars worth of ETH had been staked even before there was a mechanism to withdraw the coins indicates that Ethereum investors had a lot of confidence in the project’s ability to execute its roadmap. Now, a year later, the total value of staked ETH jumped to over $100 billion, which is an even greater vote of confidence from the market.\n\nThe number of staked ETH. Image source: Nansen\n\nThe fact that you can stake ETH is also one reason that can make Ethereum a good investment. If you’re looking to hold your ETH over the long term, you can currently enjoy an APY of about 3.3% on your staked coins. While these are not earth-shattering gains, it’s better than earning no yield at all if you weren’t planning to sell your ETH anyway.\n\nDeflationary pressure on ETH supply\n\nWhen the Merge was close to happening, much of the discussion in the cryptocurrency community (rightly) revolved around Ethereum moving over to the Proof-of-Stake consensus mechanism. However, there was one aspect of the Merge that perhaps got less attention than it deserves. Prior to the Merge, the Ethereum protocol issued about 13,000 ETH every day in order to reward miners. With the new Proof-of-Stake system, the protocol only needs to issue about 1,600 ETH per day to provide sufficient incentives to Proof-of-Stake validators to secure the network.\n\nThis change, combined with the EIP-1559 mechanism introduced in 2021, has actually turned ETH into a slightly deflationary cryptocurrency. According to ultrasound.money, the supply of ETH has decreased by a total of more than 400,000 ETH following the Merge.\n\nThis deflationary pressure to the supply of ETH has made it a more attractive hold over the long term, as ETH holders effectively no longer need to consider inflation as a factor that could negatively affect the value of their coins.\n\nSource: Etherscan\n\nHowever, it’s important to point out that it’s not a certainty that ETH will remain deflationary, as this will depend on how much demand there is for transactions on the Ethereum mainnet. More demand for transactions equals more burned ETH, as the base transaction fees for each transaction are being burned thanks to EIP-1559. While the deflationary aspect is a nice bonus, Ethereum is one of the best long term cryptos to buy, regardless of whether its tokenomics are slightly inflationary or slightly deflationary.\n\nEthereum layer 2s are making good progress\n\nIt’s not secret that the current iteration of Ethereum has major problems with scalability. In 2021, when the crypto market was in the middle of a raging bull run, transaction fees on the Ethereum network skyrocketed to unprecedented levels. At points, users were paying north of $50 just to make a single transaction on the Ethereum network.\n\nThis is obviously not a sustainable situation if Ethereum is to become a widely adopted network. Thankfully, there are several solutions in sight. The Ethereum protocol itself will receive upgrades in the future, most notably sharding, which will allow it to process more transactions while keeping costs lower.\n\nIn addition to improvements on the protocol base layer, there are also a number of layer 2 scalability solutions that leverage the security of the Ethereum mainnet while processing transactions off-chain to keep costs low.\n\nThere’s already a number of layer 2 platforms for Ethereum available. The most notable examples are Arbitrum One and Optimism, which are both based on optimistic rollup technology and offer much better transaction efficiency for the end user than the base layer.\n\nEthereum continues to dominate the smart contracts space\n\nThere’s a slew of Ethereum competitors available on the market. Many alternative layer 1 chains have adopted the Ethereum Virtual Machine (EVM), while others like Solana, Cardano and Aptos have taken completely different approaches.\n\nIn any case, no other blockchain has come even close to challenging Ethereum as the most popular platform for smart contracts and decentralized applications, which are the main reasons why it tops the list of best altcoins to buy. According to DeFi Llama, Ethereum has a 60% market share in the decentralized finance (DeFi) ecosystem, according to the TVL (total value locked) metric. The next closest competitor, TRON, has a market share of about 7.2%.\n\nDeFi TVL market share among all blockchains. Image source: DeFi Llama\n\nThe demand for using the Ethereum network is also evident based on the total fees paid to use it. As of early June 2024, users are paying a total of $9.6 million in fees daily for Ethereum transactions, according to data from cryptofees.info. Bitcoin is in second place with a daily average of $4.1 million in total daily fees.\n\nETH is still down from its all-time high\n\nEven though ETH kicked off 2024 with a rally, the Ethereum price is still down about 22% from its all-time high. This could make ETH a good investment at the moment, as it has already displayed the ability to reach higher prices in the past. In addition, several other major cryptos, including Bitcoin, BNB, and Toncoin, have managed to clinch new all-time high valuations this year, so Ethereum could be next.\n\nAs a side note, even if Ethereum were to surpass its previous ATH, there is virtually no chance that it could explode by 100x or post similarly impressive gains – its current market cap is just too large and the growth required to post triple or four digit gains is just not feasible.\n\nDespite being constrained from benefiting from 100x price increases, the 5-year Ethereum average return rate would still net investors an incredibly handsome sum in the span of 10 years, mostly due to the magic of compounding interest. Here’s how a $5,000 investment in Ethereum with a monthly contribution of $100 would fare over the next 10 years, if we take the compounded average growth rate (CAGR) of ETH in the past 3 years as a basis.\n\nA $5,000 investment in Ethereum (with a $100 monthly contribution) in 2024 will grow to nearly $33,000 by 2034 if we assume Ethereum’s CAGR over the past 3 years. Source: Ethereum Profit Calculator\n\nWhat are the cons of Ethereum as an investment?\n\nHopefully, we have demonstrated that Ethereum has a lot going for it as an investment in 2024. However, that doesn’t mean that buying ETH is a sure bet.\n\nWhile layer 2 solutions promise to address Ethereum’s scalability woes, they are still in their relatively early stages, with many taking compromises in terms of decentralization. Meanwhile, the Ethereum mainnet is still very expensive to use.\n\nAt the time of writing, a simple token swap will cost about $3.9 in fees, which makes it very difficult to portray Ethereum as a platform that targets a broad audience and enables financial inclusion. In addition, the fees get substantially higher whenever there is a surge in demand.\n\nIn addition, the macroeconomic situation might also not bode well for cryptocurrencies. After all, some economists are predicting a recession to happen in 2024. If these predictions materialize, the cryptocurrency market will be in uncharted territory, as it has never existed amid a global recession—let’s remember that Bitcoin was launched in 2009 and only became a significant asset a few years later.\n\nDepending on the severity of this expected recession, there could be a sell-off in the crypto markets due to investors getting rid of their risky assets, and ETH would undoubtedly also be impacted in such a scenario.\n\nOverall, it’s important to keep in mind that even though Ethereum is among the most established crypto projects, ETH is still a highly volatile asset when compared to traditional investments. Before buying any cryptocurrency, make sure to carefully consider your financial situation and never invest more than you are willing to lose.\n\nEthereum price prediction for 2024: A new ATH brewing on the horizon?\n\nOur algorithm forecasts Ethereum price to increase by +260% and reach a new ATH in early 2024.\n\nAccording to our Ethereum price prediction, the price of Ethereum will see a nice uptick in the second half of 2024. The world’s largest altcoin is expected to start mounting a rally late in July, culminating in a new all-time high of roughly $5,450 in December.\n\nThe Ethereum price prediction is based on the snapshot of technical indicators in early June 2024, with 28 indicators signaling bullish and 2 bearish signals. Keep in mind that the prediction could change considerably going forward if the underlying indicators change.\n\nThe bottom line: The future of Ethereum looks bright, but the macro environment could spoil the party\n\nIf you’re asking yourself, “Should I buy Ethereum?” the current situation might be a good time to do so. As we can see, there are a lot of positive indications for the future of Ethereum that could make it one of the best cryptocurrencies to buy now.\n\nA large number of ETHs are being staked even before the launch of withdrawals. EIP-1559 and the Merge have combined to drastically reduce the issuance of ETH, and Ethereum is continuing to dominate the smart contracts sector. In addition, ETH is trading below considerably its all-time highs while Bitcoin, BNB, and some other top coins are trading at the top, which means the current prices could represent an opportunity to buy the dip.\n\nIn addition, the expected approval of Ethereum spot ETFs in the US in the near term could provide another boost that could push Ethereum above its previous highs.\n\nFor more information, check out our ultimate guide on cryptocurrency investing for useful tips and ideas on how to approach investing in crypto."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFB5M1d4ZjR2T1V4OW5kdS1RNnhXakx3SWo2Njk3QzB3ckw0dlJSM3BnSXJfRUVaandUNlNWQm9KT2JjZ3RucEZZMkRnSG5LOW8xZWx4N3lJRjRaU1FyYnY2TjlaOVlPY2JDSTltUUZLcVNCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "AI sets Ethereum (ETH) price for June 30, 2024 - Finbold - Finance in Bold",
        "content": "As many assets in the cryptocurrency market start to resume their price increases, the sector’s largest altcoin – Ethereum (ETH) – has been one of them, and machine learning and artificial intelligence (AI) algorithms are fairly optimistic about its progress for the next several weeks.\n\nIndeed, Ethereum has been riding the current bullish wave in the crypto sphere, heightened by the exceptionally positive prediction by investment giant VanEck, which sees the second largest asset in the cryptoverse by market capitalization, reaching a whopping $22,000 by 2030.\n\nEthereum price prediction\n\nIn terms of its price prognosis for the near future, Ethereum might hit the level at $3,927.66 by as early as June 30, 2024, according to the advanced AI algorithm deployed by the crypto monitoring and forecasting platform PricePredictions retrieved by Finbold on June 6.\n\n30-day Ethereum price prediction chart. Source: PricePredictions\n\nSpecifically, this would represent an increase of 2.12% from Ethereum’s price at press time provided that the prediction, which takes into consideration technical analysis (TA) indicators, such as relative strength index (RSI), Bollinger Bands (BB), moving average convergence divergence (MACD), and others, comes true.\n\nEthereum price analysis\n\nFor now, Ethereum is changing hands at the price of $3,846.08, which represents a 1.42% gain in the last 24 hours, an increase of 2.83% across the previous seven days while adding up to the 24.06% advance accumulated over the past month, as per the latest charts on June 6.\n\nEthereum price 30-day chart. Source: Finbold\n\nAs a reminder, the $90 billion asset manager VanEck raised its 2030 ETH price target to $22,000, influenced by “ether ETF news, scaling progress, and our read of onchain data,” as well as the analysis of how ETH and Bitcoin (BTC) perform in both traditional and crypto-only portfolios for optimal returns.”\n\nWe've raised our 2030 ETH price target to $22K, influenced by ether ETF news, scaling progress, and our read of onchain data. Additionally, we've analyzed how ETH and BTC perform in both traditional and crypto-only portfolios for optimal returns. @Matthew_Sigel @Patrick_Bush_VE… — VanEck (@vaneck_us) June 5, 2024\n\nIn addition to the AI’s positive short-term prognosis, VanEck’s optimism suggests an overall positive sentiment regarding Ethereum’s future. However, it is important to keep in mind that trends in the crypto industry can sometimes shift, so doing one’s own research is critical when investing.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNOEZuVTRidVhSQnMwVEhiOS1Gb2tsOVhpOEEwd0RnUzJfdHRIMVhlUzhzNTZhbFhqblNEQmItcmF6V1lNNy12VHUxVDNVX2tqT1BWMmdyd3NTYWgxX1R4M2dlSFcwOVVaZkRicEFSOUQ1MGE5YzR2YVlVRXhhSENyMEF1ZENVQkNLQzZaeWtwS2gtbUVKTTJpdFZyWDZlQdIBowFBVV95cUxPWkNrQ3hiWjRrd0EyMXdNZUkweVlmWFEtWG5JckJRdlNxSUtVZ1VGT3otcDc3WExEblRQaDZ3TFBobWtOSGxZREQtTmdPYWs2N1pIMHlka2plN0s5VG5VUVFpdWtrUG5rSlp1cFExMk5PUUpkZ1IzTi15NnZwQzN5NG9DX3FEUmU0clVWa3VTQ29jV2Z2cktVT2dWdjNWWDVXWFRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Signals Fresh Rally: Bulls Getting Ready for a Big Upswing! - CoinChapter",
        "content": "Key Takeaways:\n\nEthereum is holding gains above the $3,700 support zone.\n\nETH/USD cleared a short-term contracting triangle with resistance at $3,800 on the daily chart.\n\nThe price could gain bullish momentum once it clears the $4,000 resistance zone.\n\nEthereum price\n\nNEW DELHI (CoinChapter.com) — Ethereum (ETH) is again moving higher above $3,800. ETH might surge over 10% if it settles above the $3,950 and $4,000 levels.\n\nEthereum Price Eyes More Upsides\n\nAfter a strong rally after the ETH ETF approval, the bears defended more upsides above the $4,000 resistance. Ethereum saw a minor pullback from the $3,975 zone like Bitcoin. The price dipped below the $3,920 and $3,880 levels.\n\nETH tested the 23.6% Fib retracement level of the upward move from the $2,870 swing low to the $3,975 high. However, the bulls were active above the $3,700 zone and the price remained well above the 50-day simple moving average (blue).\n\nEthereum price daily chart | Source: ETH/USD on TradingView.com\n\nRecently, Ethereum started another increase from the $3,700 zone. There was a move above the $3,780 and $3,800 resistance levels. Besides, it cleared a short-term contracting triangle with resistance at $3,800 on the daily chart.\n\nThese are positive signs and suggest a high chance of more upsides. On the upside, immediate resistance is near the $3,900 level. The first major resistance is near the $3,950 level.\n\nThe main resistance could be $4,000. A clear move above the $4,000 resistance could spark another increase. In the stated case, the price might recover and test the $4,080 resistance. The next major resistance is visible near the $4,250 level.\n\nA successful daily close above the $4,250 resistance could send Ether toward $4,400. Any more gains might initiate a move toward the $5,000 zone in the near term.\n\nAnother Downside Correction In ETH?\n\nConversely, Ethereum might start another downside correction. The first major support sits near the $3,700 level. If there is a downside break below the $3,700 support zone, there is a risk of a larger pullback. In the stated case, the price might test the $3,550 level.\n\nThe next major support is near the 50% Fib retracement level of the upward move from the $2,870 swing low to the $3,975 high at $3,420. A downside break and a daily close below $3,420 might call for a test of the $3,300 support and the 50-day simple moving average (blue).\n\nOverall, Ethereum price is holding gains above $3,720 and $3,700. If ETH clears the $4,000 resistance, there could be a fresh surge in the near term."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOQmQ3eHFGRmVEMVNwQTh1Q1hOTVAwLWVEMVBCVG93UlVVdVJsQlhfczA3QkVCWlJ1R1dIcnVMT0xWUHlHS1UyNGhVNHU4NVcwMkdENkRWN2cwcU40SklXbTN6MU1Zd19oVUJ5TmZpVXVkR3dKZURiZWpST2Zkcm5kd0JYNjE1bEVSdjlqSC1NQmJXS1N1cFA4aTFJbm4tandibTJCVk15ZGVmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Co-founder Buterin Unhappy With Celebrity Tokens 5thScape Revolutionizes - Coinfomania",
        "content": "Ethereum co-founder Vitalik Buterin has shared his discontent with the growing popularity of celebrity meme coins, stating that they do not create substantial value. Within this trend, Buterin identifies 5thScape as an essential exception and promises it will revolutionize the world of crypto gaming. While most celebrity meme coins are traditional speculative assets without clear value propositions or social missions, 5thScape provides a meaningful and sustainable value proposition, which has earned Buterin’s recognition.\n\nMore celebrities joining the crypto space means more tokens being launched on the Solana network, and projects like 5thScape are an excellent example of how the cryptocurrency market can evolve and bring actual value.\n\n5thScape’s VR Ecosystem Creating Waves In Crypto Domain\n\nWith the surge of digital currencies, 5thScape emerges as a pioneering force, reshaping the VR/AR sector. The project enhances revenue streams by incorporating cryptocurrency and offers users a more engaging, interactive experience. The ascent of Bitcoin and other cryptocurrencies has sparked innovations across various industries.\n\n5thScape, recognizing this potential, has seamlessly integrated blockchain technology into its VR/AR platforms. This integration ensures secure transactions, fostering a trustworthy environment for users to immerse themselves in captivating experiences.\n\n>>Click here to visit 5thScape Presale Page\n\nWith a successful presale phase surpassing $6.5 million, 5thScape is poised to elevate the VR/AR landscape. It stands as the world’s premier mixed-reality platform to embrace crypto tokenization, enhancing the incentive mechanism for users. Central to its vision is the 5SCAPE token, enabling users to stake for rewards and access a plethora of utility-rich features. 5SCAPE tokens can be staked for two years to avail added benefits.\n\nFor gamers, 5SCAPE serves as the universal currency, facilitating seamless transactions for unlocking a myriad of products and services within the VR gaming domain. The earlier you chip in, the greater your APY will be in the future.\n\nCelebrity Meme Coins: Potential Value Or Mere Hype?\n\nThe rise of celebrity meme coins in the crypto market has been both fascinating and contentious. While some argue that these tokens capitalize on celebrities’ popularity to generate value, others view them as mere hype, lacking substantial utility or innovation.\n\nEthereum co-founder Vitalik Buterin’s recent expression of discontent with celebrity tokens underscores this debate, suggesting concerns about their long-term viability.Meanwhile, initiatives like 5thScape are transfiguring the digital space with innovative approaches.\n\n5thScape’s VR token stands out as a prime example, leveraging virtual reality technology to offer tangible utility beyond mere celebrity endorsement. By integrating VR experiences into their ecosystem, 5thScape provides users with immersive and interactive environments, enhancing engagement and utility.\n\nWhile celebrity meme coins may enjoy short-term attention, projects like 5thScape that offer real innovation and utility will likely stand the test of time. By focusing on technological advancements and meaningful applications, these projects have the potential to generate long-term value and redefine the crypto landscape.\n\nCryptocurrency’s Paradigm Shift Towards VR/AR Industry\n\nThe prevailing market trends suggest a notable convergence of VR/AR elements and cryptocurrency technologies, with 5thScape at the frontline. The company’s innovative strategy of incorporating Ethereum-based blockchain technology into its VR/AR economy not only counters fraudulent activities but also introduces fresh revenue streams.\n\nViewed through an investor’s lens, VR/AR’s potential within the crypto realm appears substantial. 5thScape’s VR/AR crypto venture, which surpassed $6.5 million in its initial presale phase, exemplifies this potential. Investors increasingly acknowledge the value of firms operating at the intersection of these escalating sectors.\n\nThe strides taken by 5thScape have left a significant imprint on the VR/AR market and its competitors. By effectively integrating cryptocurrency into their operational framework, they’ve established a new benchmark for the industry. 5thScape’s competitive edge has prompted other entities to innovate and evolve while the crypto world is poised to witness a paradigm shift within virtual economies.\n\n5thScape: The New Epoch Of AR/VR Ecosystems\n\n5thScape is grabbing eyeballs swiftly; in no time, we will see whales entering its presale event, and its growth will be exponentially boosted. While the future of celebrity meme coins remains uncertain, 5thScape clearly stands tall with its unique features and impressive VR software and hardware. Players and traders both look forward to adding 5SCAPE to their portfolios and maximizing profits this year. The convergence of the best technologies will reshape the future of the crypto industry. Have you bought some 5SCAPE yet?"
    }
]