[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNenBhVS1CRTFxMUd4X0pMSDlyU1IxYjU3YTJvVE1SSFpvSDhpXzVwUnE1cEt4SGhGWVVoTGFqMElyWEl2SXhiRmo2bm15Y3pJUnZoZXoteWFqbjBrdmN3VkEtb2Iwa19LVUIxdG1ITUxEQXNtSDYxeVMxcVZQdU56cFk0NmlnWHAzUGt0bkR2OHBVaUpMOEFn0gGcAUFVX3lxTE9SNzRCelhaTGxLVnBkdS1MWG5SdVktVnk5TzZPLTBRZ0J4N2VzR2k1LWFqbDBCXzRBMS14Y0cwOUN6dDdaQXFGMC1YU3FpY3ItTGNQUnlYb1FwTmwtWmJKaXBRQU1rMEsxVVd0dE9fdEQ2Qno5MjNVOHpiRTB0WlFKVURacWhQaHpwX2tBa2N0cTJKQko1NnY0OXdHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Top Ethereum Contributor Makes Epic U-Turn With Unexpected Gas Fee Statement - U.Today",
        "content": "Hayden Adams, the founder and CEO of Uniswap Labs, recently made a surprising statement about transaction fees on the ETH network. Adams, who leads the largest decentralized exchange on Ethereum, declared that users should never have to worry about \"gas fees.\" This unexpected opinion has added a new dimension to the ongoing debate about Ethereum's high transaction costs.\n\nAdvertisement\n\nAdams' statement comes amid a heated discussion about the expenses associated with Ethereum transactions. Recently, artist Iggy Azalea commented on the issue, questioning how gas fees are used and expressing skepticism about their impact. Although Azalea incorrectly assumed that all fees directly benefit Ethereum's founders, her comments have once again highlighted the issue of high transaction costs.\n\nNo user should ever have to hear the term “gas fee” Advertisement June 8, 2024\n\nThe debate over Ethereum's gas fees has become more intense with the rise of Solana, a blockchain known for its lower transaction costs. Solana's recent performance has led some to speculate about the blockchain's future and its ability to compete with more affordable alternatives.\n\nKey Ethereum developers, including co-founder Vitalik Buterin, have been addressing the gas fee problem for some time. Last month, Buterin introduced EIP-7706, a proposal aimed at optimizing transaction calldata and reducing gas usage. This proposal includes a new type of gas specifically for calldata transactions, with the goal of creating a separate fee market and making calldata more affordable.\n\nAmid Adams' words, Uniswap has continued to succeed, earning over $3.64 billion in total commissions to date. In the past 24 hours alone, Uniswap collected $1.62 million in fees, and over the last month, it amassed $65.95 million."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTDhEaGg1T2NwSWZLYzlmbEdCNUwwb3ROWjJRUUxOVC1fQm5IdzQyMHg5OHowLUhiaGtmMGo0STBRVGJkUEhqekRSaDlua25UbUExaXlYQTJHQXhVTG92eElfZ0ZkMk9veGNoUTN1S3hCQmgzSFRPRWxNdzhqeXZTazFONHZKR0YzYmF3cXdKV0lSS2UtLWI3RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Making Big Moves. 3 Reasons I'm Buying It Hand Over Fist in June. - The Motley Fool",
        "content": "Ethereum is poised for substantial growth not only in June, but for months and years to come.\n\nThe crypto world is buzzing with excitement as the market rides a wave of bullish momentum. While this surge is promising, it also makes choosing the right cryptocurrency to invest in quite challenging, as nearly everything seems to be on the rise.\n\nAmidst this flurry, one cryptocurrency stands out due to its recent developments and long-term potential: Ethereum (ETH 0.18%). Here are three compelling reasons why I'm investing heavily in Ethereum this June.\n\n1. SEC approval of a spot Ethereum ETF\n\nOne of the most compelling reasons to invest in Ethereum right now is the anticipated approval of a spot Ethereum ETF by the Securities and Exchange Commission (SEC). In January, Bitcoin (BTC 0.04%) was the first cryptocurrency to get this approval, and now there is a growing appetite among investors for exposure to the world's second most valuable cryptocurrency.\n\nThe integration of Ethereum with traditional finance through an exchange-traded fund is incredibly encouraging for many reasons. First, since ETFs can be purchased from brokerage accounts, a spot Ethereum ETF will democratize access for many traditional investors who are uncomfortable buying cryptocurrencies on crypto exchanges. This ease of access can attract a broader range of buyers and potentially drive significant price appreciation.\n\nYet, the most important cohort that the ETFs will cater to is institutional investors. Without the ETFs, institutional investors have been hesitant to purchase cryptocurrencies directly, due to regulatory and security risks. A spot Ethereum ETF approval will allow previously sidelined institutions known for their deep pockets to join in on the game.\n\n2. The tokenization of real-world assets\n\nAnother reason to be bullish on Ethereum is its potential for the tokenization of real-world assets (RWA). Tokenization involves converting physical and intangible assets into digital tokens on a blockchain, making them easier to transfer, trade, and manage. This can include anything from real estate and art to stocks and bonds.\n\nThe market for tokenized RWAs is expected to grow to $10 trillion by 2030, and for many reasons, Ethereum is positioned to capture the bulk of this value. The network's robust decentralization, strong security, and established ecosystem make it an ideal platform for institutions looking to tokenize assets.\n\nIn fact, we are already seeing the beginnings of this movement. For instance, in May, BlackRock (the world's largest asset manager) launched a tokenized fund on Ethereum, marking a significant step toward the convergence of blockchain technology and traditional financial instruments.\n\nHighlighting the transformative potential of blockchain technology, BlackRock CEO Larry Fink recently stated that tokenization will be \"the next generation for markets.\" And rest assured, Ethereum will be the blockchain of choice for this revolution.\n\n3. Ethereum's leadership in smart contracts and DeFi\n\nThe beginning stages of tokenization on Ethereum are an example of why it is one of the best cryptocurrencies to invest in. Launched in 2015, Ethereum was one of the first blockchains to introduce smart contracts, making it the first programmable cryptocurrency. This pioneering status has given Ethereum a competitive advantage in terms of experimentation and documentation, two crucial factors developers consider when choosing a blockchain to build on.\n\nOver the years, this experimentation has led to the development of several novel applications of blockchain technology, such as decentralized finance (DeFi). By using Ethereum's smart contracts, DeFi developers can build decentralized applications that allow financial services like lending, borrowing, and trading to occur without traditional intermediaries, enhancing efficiency and accessibility.\n\nTo put it simply, Ethereum is the undisputed leader in the DeFi space, with over 60% of the DeFi economy built on its blockchain. And with DeFi as one of the most prominent and innovative use cases of crypto, as DeFi grows, so should Ethereum.\n\nDeFi is just one (great) example of how Ethereum fosters innovation and experimentation. The recent advancements in tokenizing real-world assets demonstrate Ethereum's capacity to stay at the forefront of blockchain technology. Investing in Ethereum is essentially investing in the future potential of blockchain experimentation and development. As more projects and applications are built on Ethereum, its value proposition will continue to strengthen for decades to come."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPdHQ3UWY4VTUtMnR1eUhhcjVKLWdWU2YtMWo4WmJOd1VXQzlXRE1vcXVHZTBMZmlSWUlIQXoweV9xaTh4Z09EbEVkV2ZMUFNlak9CTnI5RUZBeFRJb3A4WlBMWFo3U0NDQTV3QVVSUXVEUzdGZHFfU0otNXpsTTJmZkpjUGNobHdrZjNtaGRGZGt4bTA5dURvNdIBngFBVV95cUxNTlk2NVZfVTlNb0RmOExWUjRwMFpjQXl1dHQ0andwUWsyZExlcWtRLWtzaTBoZEtpZklFajZ3UWVZMmxaR0VEZDR0NDh2T21Zb1BSVFNBWWMwbGgxOWpFTDRLWWU0a3pmRmdEdHFjVzNVOC1tdENVSUxmRHVMa0NJR2R4UXlSZzJ5dVAtdWR4UFp0M2o5TDdUUlBPcGZPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in June? - CoinGape",
        "content": "Ethereum Price: Over the past two weeks, the second-largest cryptocurrency Ethereum witnessed shrunk volatility carrying a consolidation trend above $3600. The daily chart projecting short body candles and rejection on both sides indicates a lack of direction among market participants. Will the BTC price drop below $70000 push a prolonged correction in the altcoin market?\n\nAlso Read: Crypto Prices Today June 8: Bitcoin & ETH Take Bearish Turn, Wormhole & INJ Pump\n\nadvertisement\n\nEthereum Price Defend Key Support Amid Broader Uncertainty\n\nDuring mid-May, the Ethereum price rebounded sharply from the $2860 support indicating the investor continued to accumulate this asset at market dips. The renewed buying force uplifted the ETH value by 39% to reach a 10-week high of $3975.\n\nHowever, with broader market uncertainty the recovery momentum in Ether stalled resulting in a sideways action above $3630. This support coinciding closely with the 20-day EMA slope and 23.6% Fibonacci retracement level creates a high area of interest for buyers.\n\nThe notable rejection of candle tails at this support indicates the buyers are defending this support. For risk-averse traders, a breakout above the overhead resistance of $4090 will give a better confirmation of a prolonged rally.\n\nWith sustained buying, the Ethereum price prediction hints at a rally to challenge the ATH (All-time-high) resistance of $4880.\n\nOn a contrary note, a breakdown below $3630 will accelerate the selling pressure and may extend the current correction for a week or month.\n\nAlso Read: Crypto Market Selloff: Here’s Why Bitcoin, ETH, SOL, XRP, DOGE Prices Slips Today\n\nHistorical Trends Show June’s Mixed Fortunes for Ethereum\n\nEthereum’s price performance in June has shown significant volatility over the past years, with both notable gains and sharp declines. The largest drop occurred in 2022 with a steep decline of -44.79%, while the highest gain was in 2017 at +26.19%.\n\nOn average, June tends to yield negative returns, with an average of -6.76% and a median of -2.53%. This negative bias suggests that June is often a challenging month for Ethereum. However, the data also hints at the potential for sharp reversals, as seen in the positive return of +8.86% in 2019 following a significant drop of -21.34% in 2018.\n\nThese variations are likely influenced by broader market conditions, including macroeconomic factors and regulatory news. Given this historical performance, investors might approach June with caution.\n\nHowever, with steady development for the launch of Spot Ethereum ETFs, the market is better leaning in buyers’ favor.\n\nTechnical Indicator\n\nExponential Moving Average: The Ethereum price trading above the daily EMAs (20, 50, 100, and 200) indicates the path to least resistance is upward.\n\nAverage Directional Index: The downtick in ADX slope at 33% indicates the current consolidation could assist buyers in recuperating exhausted bullish momentum.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5rM2lpQUl6dWtITFAzTjM3aDlPZWZIem1UMnNhbFFMMy1Ub2FwMkx4ZEZZaUhuV0M3dUtfdjkyWVhOV2oxai1hejBidTNaSWdvbHY1RmlTdXBHMDc4SUp3LVpzYzhEdkFOYU9UeWFsMWE5MTF3T3JfTFhGUVk2d9IBhgFBVV95cUxQa19lbzBIMkNCcVB5YlRtVHMycXpycnBQVW5VYzExa0NKcG5yZDluTUkwU08xSHE1d3VSeC1Mdko1T1NWOVc5QzVvbDA3cEMxbFphazcxZnJORnpCNHZPbGRmWEYxZlNlV1FQRW5jTnhNazdCWk8yMVJKWkdPRlNkRHQ4Ui1qUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Layer-2 Network Taiko Is Spending $100K Daily on Blobs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn Ethereum layer-2 network named Taiko is dominating the market for so-called blobs, or dedicated data storage for Ethereum scalers—but those endeavors are resulting in tens of thousands of dollars worth of costs for the little-known scaling solution each and every day, even topping the $100,000 mark multiple times this week.\n\nThe Taiko protocol, which went live in late May, seeks to offer users cheaper and faster transactions than on Ethereum's mainnet, while borrowing elements of the network's security. Since going live, Taiko has spent a whopping $900,000 on blobs in less than two weeks to funnel users’ transactions over to Ethereum’s network.\n\nMeanwhile, Taiko’s competitors, such as the Optimism network, rarely spend more than $1,000 per day on Blob-related fees. Introduced in March as part of an Ethereum upgrade, blobs were billed as a new resource for layer-2 scaling networks to post Ethereum transactions more cheaply.\n\nThe protocol’s maker Taiko Labs announced in March that it had raised $15 million in a Series A funding round. Leveraging “zero-knowledge” cryptography in its design, Taiko is striving to differentiate its scaling design in an increasingly competitive field that includes dozens of different scaling networks.\n\nAD\n\nAD\n\n“Taiko just launched its mainnet, and there’s a lot to be figured out before it becomes stable,” Taiko Labs CEO Daniel Wang told Decrypt in a written statement. “We knew that we will use more blobs than other layer-2s. This is a design decision, not a bug.”\n\nLayer-2 networks often work by bundling batches of transactions together and processing them on a separate chain before posting receipts back to Ethereum. However, Taiko’s design differs from that formula, where lots of transactions are rolled up into batches elsewhere.\n\nInstead, the process of ordering transactions, known as sequencing, takes place on Ethereum itself. In a blog post, Taiko Labs said this process, dubbed “base sequencing,” is more decentralized than that of other layer-2s that rely on centralized sequencers—which are controlled by a network’s development team and collect a small portion of users’ fees.\n\n“That sounds expensive,” Alexei Zamyatin, the co-founder of Bitcoin layer-2 network BOB, told Decrypt in an interview. “It makes it more secure, but not as secure as [Ethereum], and you’re also much more expensive than most layer-2s.”\n\nAD\n\nAD\n\nA game of tradeoffs\n\nStill, Wang stated that the costs associated with Taiko’s functionality could easily reach the point of break-even if “Taiko is fully utilized by users,” providing a sustainable amount of gas fees.\n\nWang added that Taiko is fully aware of the pros and cons associated with its sequencing method, and he hopes that Ethereum researchers will study Taiko’s on-chain data to explore improvements that could allow Ethereum to better support similar scaling networks.\n\nSome Ethereum researchers, including Justin Drake, believe that Taiko’s team is trailblazing a new form of decentralized sequencing that could solve key hurdles in Ethereum’s ecosystem.\n\n“It is making a leap forward in the decentralization, credible neutrality, and composability of rollups,” he told Decrypt in a written statement.\n\nIf more layer-2 networks shifted the sequencing of their transactions to Ethereum itself, then fragmentation issues holding the entire space back could be solved, he stated. As of now, liquidity and assets are largely spread out across different layer-2s, effectively siloing users and applications within a given scaling solution while all being tied to Ethereum.\n\nWhen it comes to layer-2 networks on Ethereum, the introduction of blobs represented a significant shift in how those protocols interact with the underlying blockchain. Before blobs were available as a separate fee market, layer-2s could only post bundled transactions in the form of Ethereum “calldata,” a space for data to be contained within transactions.\n\nInstead of trafficking users’ transactions in bulk alongside regular Ethereum activity, blobs serve almost as a dedicated lane on a highway, where less congestion can reduce costs. However, the best way to package those transactions before they’re shipped is still up for debate.\n\nBlobs blobs blobs\n\nIn some cases, centralized sequencers can be leveraged to grind a network to a halt, puncturing the veil of permissionless activity that is synonymous with crypto. Sometimes, centralized sequencers can be abused to delay transactions too. However, Taiko’s commitment to decentralization may not be the most efficient, according to one of its community advocates.\n\nAD\n\nAD\n\n“Sadly, it’s kind of expensive,” the pseudonymous crypto researcher arixon.eth said on Twitter (aka X). “Because of based sequencing, we need to post a blob every 12 [seconds], and if there aren't enough [transactions], then we just won't fill the blobs.”\n\nBecause of based sequencing, we need to post a blob every 12s and if there aren't enough txs then we just won't fill the blobs Sadly it's kinda expensive, so we really need based preconfs — arixon.eth (@arixoneth) June 1, 2024\n\nWang of Taiko Labs said changing this pace could be a potential solution enacted soon, stating that Taiko’s community is “considering lowering the block proposing frequency a bit.”\n\nThe constant stream of blobs, regardless of how full they are, has made Taiko a top user of them. On Sunday, for example, Taiko posted 25% of all blobs on Ethereum, according to a popular Dune dashboard. That day, Taiko spent nearly $63,000 on blob-related fees.\n\nOn Thursday, Taiko paid $123,000 in fees for blobs—representing 73% of all costs paid for them across layer-2s—which was its second straight day with a six-figure fee tally. And while most layer-2s pass cost savings onto their users through lower fees, the premium Taiko is paying for decentralization, as of now, isn’t a bill that users need to foot.\n\n“For now, it's partially subsidized by the team,” arixon.eth said, adding that the process could be modified in the future so that “blocks are missed until there are enough [transactions] in the mempool for a proposer to push a block to [Ethereum] profitably.”\n\nAmid the network’s first airdrop on Wednesday of TAIKO tokens, the network’s native cryptocurrency, the layer-2 averaged around 6.42 transactions per second, according to L2BEAT. Meanwhile, Ethereum registered around 13.6 transactions per second itself.\n\nSo far, the performance of Taiko’s token has been turbulent. After crashing 40% an hour after it launched, to $2.27 from $3.80, the token’s price had recovered to $2.45, as of this writing, showing a nearly 3% decrease over the past day, according to CoinGecko.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNNjhzUXpaRkhvTHF5ZFBXS1JOdHQ5NVQwTmpPV3FOUDB5N2VwbDc2ZWhndEx1cXdpQ3RPZWxpeEU5aVVEbnJ4SkFNVXEzb1JZTUFaWUNqMWphamprUEhTTVQ0WXJsdTJxejFmWkw5dVNOck5TVjU1RXkwWHlTZlZfMmhYTmhVMVR5V1ZWZ1hUN1ZzbFdBUm02eldsdmUyZV94bzd6b3F6dy01c3JKaVBXS1VB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) $16 Billion Open Interest hints at $4K Price Rebound - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1XMmJySVNrVDRZMG14dm1ZQlA4TEZraUlFX1NNN0ZPVFJrMWZEcTVlS2V2QUR0MDh5Xzc3U0kzUFF1RGMwTTVobkJDWW52bTgtQ0VSZ3lCOFJwU0Y1SWpFX3paVzhaVFB3cGZmb2lweGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Wintermute CEO questions Ethereum's leadership paradox amid celebrity memecoin controversy - Crypto Briefing",
        "content": "Ethereum leaders faces criticism for trying to merge capitalist and social goals.\n\nShare this article\n\nEvgeny Gaevoy, CEO of Wintermute, said if Ethereum fails in the future, it will not be because of technical shortcomings compared to competitors like Solana. Instead, the core issue is the contradiction in Ethereum’s leadership.\n\n“If ETH fails in the future it [won’t] be because ‘Solana is faster’, it will be because the [ETH] ‘elite’ is still stuck in a massive contradiction,” Gaevoy stated in a recent post on X.\n\nHis remarks come as a response to the controversy that erupted following Vitalik Buterin’s critique of celebrity memecoins. According to Buterin, projects should aim to deliver societal value and leave participants content, rather than focus on enriching celebrities and early investors.\n\nButerin’s stance drew a sharp rebuke from hip-hop artist Iggy Azalea, who recently launched her own memecoin, MOTHER. She posted a meme showing her holding a baby that resembled Buterin.\n\nAzalea’s photo prompted Uniswap Labs co-founder Hayden Adams to defend Buterin’s role.\n\nHe criticized Azalea for downplaying Buterin’s contributions to the crypto community, expressing disappointment that instead of reacting positively and using profits to support social causes, the singer chose to mock Buterin.\n\nNo issues with memecoins or celebcoins – I think there’s value to memetic attention and it’s cool to create markets for it That said, the underlying purpose and value of the tech goes way beyond financial games. And the best builders in the space are motivated by positive social… https://t.co/FQhawNl7GP — Hayden Adams 🦄 (@haydenzadams) June 6, 2024\n\nThat was when the Wintermute CEO jumped into the debate and criticized Ethereum’s leadership. He argued that Ethereum leaders are attempting to create a capitalist blockchain system while simultaneously addressing social issues—a stance he sees as inherently contradictory.\n\n“You are either building capitalism or planned socialism. I’m sorry, you really [can’t] have both,” Gaevoy added.\n\nGaevoy’s comments sparked controversy among crypto members. Many disagreed with his view, saying that being against celeb memecoins does not equate to building a socialist system.\n\nNot sure how Hayden and Vitalik saying how they don't like certain trends means they are against capitalism (or aren't involved in building capitalist systems anymore) They both have a certain vision of crypto, in terms of the types of things people will build and what people… — Mike van Rossum (@mikevanrossum) June 6, 2024\n\nExcuse me, but in what way Vitalik or Hayden are building socialism? Being against obvious rug pulls != building socialism — DeFi Made Here (@DeFi_Made_Here) June 6, 2024\n\nIn response to these disagreements, Gaevoy said it all came down to the underlying principle.\n\nAccording to him, if capitalism is the foundation, integrating features to mitigate its negative impacts is beneficial. However, if the primary goal is “social justice” or creating “only good things,” capitalism should not be an afterthought.\n\nTo me its about the primary guiding principle. If you key guiding principle is capitalism and then you make extra steps to make it less damaging – I'm all for it. If your guiding principle is, idk, \"social justice\" or \"only good things should be built\" and then you attach… — wishful cynic (@EvgenyGaevoy) June 6, 2024"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNNGZEa2dob0VxUU0tTzE0OWNRY2s0OTdsQ1hBZGN1T0FNRzZ5QkpCenB3WTlfMVBOemkxUlhGcW55U3FJZW9abzNJbWlJQ29uRm5Yd2JqMlNlem5fM2VPd185X2F3cElDZ2QwQjhVRmxFWGh0blZGSC03bG5GMERyTUItc0lWTnJxRkVJc3ZNOE4yNndhNHlKT1RjOXlNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg analyst calls for FOIA request into SEC’s Ethereum ETF decision - CryptoSlate",
        "content": "Bloomberg ETF analyst James Seyffart called for freedom of information access (FOIA) requests regarding the SEC’s approval of spot Ethereum ETFs.\n\nIn a June 5 KITCO interview, Seyffart said that public requests should search for “emails, calls, [and] anyone that had conversations with [SEC chair] Gary Gensler” to determine what happened during the SEC’s decision-making process.\n\nHe said unused denial orders could exist due to the agency’s rapid change in stance.\n\nVoting is unclear\n\nSeyffart said the SEC approved the spot Ethereum ETFs through delegated authority, a common approach but a rare choice for the issue at hand.\n\nDelegated authority also means voting records are unclear.\n\nSeyffart said that the choice points to a politically motivated decision, stating:\n\n“Until I have somebody come out and show me smoking gun evidence … this was political.”\n\nSeyffart said the “leading theory” is that a Biden administration member called SEC chair Gary Gensler and influenced the agency’s decision.\n\nA secondary theory posits that someone swung the vote of a Democratic SEC commissioner who previously voted against spot Bitcoin ETFs. The reversed vote could have led the SEC to vote at least 3-2 in favor of spot Ethereum ETFs even if Gensler voted against the funds.\n\nIt is still possible for a commissioner to challenge the decision and force a vote. However, Seyffart said Democratic commissioners are unlikely to gain anything from making the voting record transparent.\n\nHe previously said a challenge is unlikely to influence the actual voting results.\n\nSEC should be less political\n\nSeyffart also discussed the broader impact of politics on the SEC. He argued the SEC should not be wholly apolitical but less political than it currently is.\n\nSeyffart believes that, until recently, the SEC has decided to deny spot crypto ETFs and proceeded to find legal justification for its stance after the fact.\n\nInstead, the chair should choose the issues the agency focuses on and seek legal input from individual commissioners, leading to a decision “based on logic and reason,” Seyffart said.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPb0pZd0wtdVU2UVdOVHVXRzJVSkRFMmpDMUMtdk40Sll3LXN3T2V2QWhDUVZ3V3ppWC1ZOTlQc1hNc2JoTTZGUmM4elhiMGUzMjgxQ2ozZUVMRE9xRUFpZ2N1enVvR1JzMTExSEZRZUcwcTJjTzl1Q2NTa1VZMFd2YU5nN2ZndlHSAYwBQVVfeXFMUGlOaEF2QnRneUpiSEdOMUNEWUJ2MnRJMWZpeEtuTi1iSmVTVGNDWlQxaWpGVC1USlEtN3c0QlBNS3NZOEdyaEZvbXFNRVRtSVhZSDNtVjZ6amt1aUpVZmRadFd4bHRYM2dhalZDYjBWdlRQSGZfM0FGY18wRHBwZE1qRmZKUTU5aGZjVkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s rally halts: Examining ETH’s potential next moves - AMBCrypto News",
        "content": "Ethereum’s current decline signaled a cooling-off from its recent highs\n\nDerivative data pointed to continued market interest.\n\nEthereum [ETH] seems to have come off its ETF hype-induced rally as bulls have started to take a hike.\n\nAt press time, the largest altcoin in the world has seen a decrease of 3.7% over the past day and 2.5% over the past week as the market awaits the approval of the S-1 forms for the ETFs. So, is the rally over already?\n\nAMBCrypto’s analysis of TradingView saw that Ethereum has been unable to maintain its highs and is now consolidating at lower levels.\n\nThe Moving Averages (MA50 in blue and MA200 in red) indicated a cooling-off period.\n\nInitially, the price surged above both moving averages in a strong bullish move but has since declined and is now trading below these key indicators, as we see a shift to bearish momentum in the short term.\n\nThe RSI, sitting around 45, also indicated a lack of strong buying momentum, with values leaning more toward the oversold territory, but not conclusively so.\n\nEthereum’s social volume has also declined significantly, suggesting that public interest in and sentiment toward the altcoin are low.\n\nThis reduction in social engagement could be contributing to the decrease in Ethereum’s price, as less discussion might correlate with reduced trading activity and demand.\n\nInterestingly, the trading volume of Ethereum’s derivatives market has sharply increased by over 70%, meaning there is heightened market engagement.\n\nNotably, the long/short ratio across different platforms also shows more bullish sentiment on platforms like Binance [BNB] and OKX.\n\nWhat Ethereum’s future holds\n\nThe on-chain data for Ethereum presented a predominantly bullish scenario. 89% of holders are currently making money at the present price, indicating a strong upward trend that has benefited the majority.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe significant concentration of the token by large holders (51%) suggested that while there was potential for high volatility due to possible large-scale sell-offs, the market was stable, with these major holders likely maintaining their positions.\n\nOverall, Ethereum bulls seem to be cooling off temporarily, likely due to the latest US jobs data. But the rally is not over yet."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxONzlDaGFndjdJRDNZRFVGemRfZk9Rel9vZjJEN0Z5c19CNXc1cGdKeTlwSjVSRWdXeFk3dDh0VG9ZczBOT2poOUl1ZnM0d2NZMVItdHpBd3lYQ2ticVJEbnl3RWJWTzBSS05KQ19lVW5XYXBXLXpQRWdydGgxS0x2ZjMxbVVSZUo5dTBTSzF3d3NzVlFXQWtSYlFMZktqTkxYZW1rNWcwQ2hjZzdtdEoxWjVCeF9PQ0dMOUtZMFJhUzlzRmh0Z0ZXOFUyNUdwSUFiSDh4ZVd5TERNX2_SAeABQVVfeXFMTnFmNzZQSzlNY3BaU2otWTlMSWY3WUNBUGxERUhFbFpIc1J2RV9oRV9FVXZucC0tRGh0d1B0TDBhalZUaHFUUmdRc1dIc0dlOURSeDRBYy1UVGcwMERkRm8wN0NqR1Z1MDhrS01aSmprYU1obkUwZVd0cXI2X2l0OHJLTHZ4U3NyVTlNUXlHZFlnS2ZGLUd0TlhUcDFrZlRMS3c5Ylh2QmgtVGh4OVZDeE9rcE96cE0tVWFfQUJkbHROSFdReER6WWJ2SGxiQTlMTFlLQVV1Z2FYTUNCN1NzdTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Analyst Says Blue-Chip Altcoin Mimicking Price Action That Preceded Massive Rally, Updates Outlook on Ethereum - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that a top-10 altcoin by market cap is about to soar to new all-time highs (ATH).\n\nPseudonymous trader Kaleo tells his 642,000 followers on the social media platform X that BNB (BNB), the utility token for the BNB Chain ecosystem, is mimicking a 2021 price pattern on the four-hour chart that led to new ATHs.\n\n“When BNB entered price discovery in the Spring of 2021 it initially had a very similar breakout and retest to the one we’re seeing now. Would look to add heavily on this dip, especially sub-$650 if you get the chance.”\n\nCrypto traders and analysts refer to price discovery as a situation where a coin trades at levels never seen before in its history.\n\nBNB is trading for $679 at time of writing, down more than 4% in the last 24 hours.\n\nNext up, the analyst predicts Ethereum (ETH) will break out of a descending trendline against Bitcoin (ETH/BTC), and that could send layer-1 (L1) Ethereum Virtual Machine (EVM) projects soaring.\n\n“Really believe it’s only a matter of time before we see something like this for the Ethereum/Bitcoin ratio. When it happens, be on the lookout for high ETH beta plays including alt L1 EVMs.”\n\nLooking at his chart, the analyst suggests ETH/BTC will soar above 0.10 BTC ($6,926). ETH/BTC is trading for 0.053 BTC ($3,689) at time of writing.\n\nThe trader also says that based on historic precedence, Ethereum is in the earlier stages of the parabolic phase of the market cycle.\n\n“How can you not be bullish here?”\n\nEthereum is trading for $3,686 at time of writing, down 3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOOU9nN3JCTy1CV05rX2FSUWhjLXhkMXo3c0dVTUFhWWhUR2FINC0xOUVlTnNsUmYxcG1nY2JoeFRHZHVHSGc3VTJLUmpDSldhRlllQlpwQ19sLTYzQWJJOUlfTEh5WXA3cEpvVFI4ZS03OHZaZTBzUVp5c2N4RndaTWVhbW9RdHgxT1ZoaTRiZ2dJcURVR3hsZXhLeWU4NnNKZ1Y4RVl2LWZRZUEwbHRLRGVLWlR2WnhKWnNZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Here’s Shiba Inu Price if Ethereum Reaches $22,000 As Predicted by VanEck - The Crypto Basic",
        "content": "Shiba Inu could breach the $0.00014 price level if it trails Ethereum price in the event that ETH clinches the $22,000 target predicted by VanEck.\n\nVanEck Sees Ethereum at $22,000 by 2030\n\nFor context, leading asset manager VanEck recently adjusted its outlook for Ethereum, proposing a possible six times increase in price per unit and a $66 billion cash flow. As reported by The Crypto Basic, VanEck’s latest projection was fueled by the recent approval of spot Ethereum ETFs by the U.S. SEC.\n\nWith these investment products poised to introduce greater capital to the Ethereum market, industry experts believe this development could bolster Ethereum’s price, triggering a spike to greater heights. This phenomenon was recently observed with the recently-introduced spot Bitcoin ETFs, which have seen a cumulative net inflow of $15.69 billion since January.\n\n- Advertisement -\n\nThe inflows to these instruments contributed to Bitcoin’s spike to a new all-time high above $73,000 three months back. Considering these events, analysts at VanEck believe Ethereum could record similar gains. As a result, they project a $22,000 price target by 2030, the next six years.\n\nShiba Inu Price if It Trails ETH Surge\n\nMeanwhile, we recently assessed how much Shiba Inu could rise if it trails Ethereum on the back of this price surge. Notably, data from IntoTheBlock indicates that SHIB boasts some level of price correlation with Ethereum, with a 30-day correlation of 69%, as reported by The Crypto Basic earlier this week.\n\nThis suggests that Shiba Inu could follow Ethereum’s price movements to an extent as ETH journeys to the $22,000 price goal. Remarkably, for Ethereum to reach this $22,000 value, it would have to spike by 494% from its current price of $3,700. Also, this $22,000 price would lead to an ETH market cap of $2.64 trillion.\n\nIf Shiba Inu records similar gains, its price could rally to unprecedented highs. SHIB currently changes hands at $0.00002394, having slumped by 5% over the last 24 hours to break below the $0.000025 support. A similar 494% increase from this point would take Shiba Inu to $0.0001423, leading to a new all-time high for the token.\n\nInterestingly, market analyst Rafaela Rigo already predicted a Shiba Inu rally to this price territory. Last month, Rafaela called attention to a possible repetition of the 2021 pattern, suggesting that SHIB has the potential to reach $0.0001406. At a $0.000014 price, Shiba Inu’s market cap would sit at $83.5 billion, a feasible target."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE56NnE1bzlhVDlqcXN6TG1Pc3ZOTHJ1b25HYzNEdDBrb2ctSnU2ZFlSVkxmbTRjakEwdlBjUi1sSzNxY0xieWZTT0RfMWlKN0ZTcWd5Uk5FRW9ZWTZyTmVCbUJPQWRYY2RDRUxhVlA2SC02Z9IBd0FVX3lxTE80SHUzZE5oUlhxY2diUkZSWEdNS0JuZG5UUmlLcE52MjZUTXlYSDkxdHBxdmMtUzVlVWdwaFg4RG9NcVRkbVBHUXZNRFR5VGc4VUNua2czWUFwMk50STNVWmZ6YVllV2lnblFkQ25ZN1c2SklxTWRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ancient ETH Whale Wakes Up, Moves Money to Kraken - U.Today",
        "content": "Advertisement\n\nYesterday's cryptocurrency prices dropdown was accompanied by activity of ICO era whales. One of them moved 25% of his virtue to the Kraken exchange in a single transaction.\n\nEther whale from 2015 moved 15,000 ETH to Kraken\n\nUnknown Ethereum (ETH) whale who received 67,000 Ethers during its initial coin offering (ICO) back in 2015 initiated a monstrous transfer to Kraken, Chinese crypto journalist Colin Wu says.\n\nThe transaction was registered on June 7, 2024. In total, the account transferred the equivalent of roughly $56.1 million to the large centralized exchange.\n\nAdvertisement\n\nAs of today, the account has $152.3 million worth of Ether (ETH) for selling, the public explorer's data says. It was only the third transaction of this account since 2022.\n\nIn 2020-2021, the account sent to centralized exchanges a gargantuan amount of crypto: In six transfers, it moved over 150,000 Ethers or over $553 million.\n\nAs covered by U.Today previously, Ethereum Foundation might have initiated a dump of 1,000 Ethers (ETH) a month ago.\n\n$50 million in Ethereum (ETH) longs liquidated in 24 hours\n\nA large part of this dump was immediately exchanged for 4.81 million DAI, averaging $2,725 per ETH.\n\nIn the largest liquidation wave in months, yesterday, Ethereum (ETH) traders lost over $50 million in short and $5 million in long positions, Coinglass data says.\n\nBy printing time, Ethereum (ETH) is changing hands at $3,694.04, being 2.89% down in the last 24 hours."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQT0VCSG52aWpsTm1CdlV4cjdnZ1I2ZFQ2QmdhYmx5aHktcjEwR3VrQzN5VDhuVnhJX25GanA4R2psS2lNMjEzNUd1R0RvcFd2Qm1Tdmd5SnlzZERqLWszUGo1SGJpNlZtRGNnQjI3OGdPTW9TWFItRmRPcGpxY1NNeW1YcW9KMF81ZUxFc1dqcmx5d2ctak1N0gGcAUFVX3lxTE9aYVJ3ZHl2bGowbnlTX3o5MUlQZVA1dVpzZDJBb1pBRXVqYXRQMWt5T2taSUVORlFJSWNDOFYyWllQM3l5bXpzM0lfeXlfNVBEVmJabFVkN1lfNXFNZURsOXNMLWluQmg4UFBUb3JNeVVwRExXQ0ZXcUJoTFNVeEZoNURHUURuMlltb2FBTDhTVTFMT05TaGJrejVDRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "VanEck Exec Reveals Next Move In Spot Ethereum ETF S-1 Approval By SEC - CoinGape",
        "content": "In a recent interview, Matthew Sigel, VanEck’s Digital Asset Research Chief, discussed the significant regulatory progress and future prospects surrounding the firm’s Spot Ethereum ETF. On May 23, the SEC approved a rule change that could pave the way for Spot Ether ETFs, marking a “regulatory 180 in recent SEC history.” Moreover, now the VanEck exec has revealed the ETF issuer’s next move in the approval of Ether ETFs.\n\nVanEck Confident On Spot Ethereum ETF Approval\n\nThe recent approval indicates that Ethereum is recognized as a commodity. Furthermore, Sigel described this development as “tremendously bullish for the prospect of innovation happening on open-source blockchains.” In addition, Sigel emphasized that this regulatory shift could herald a new era of blockchain activity.\n\nadvertisement\n\nHe also highlighted that 2024 has already seen record highs in various metrics. These include the number of blockchain addresses interacting, the volume of transactions, and user fees. Sigel noted, “It’s great news. Bitcoin and Ethereum are both up more than 60% this year,” according to a CNBC interview.\n\nMoreover, VanEck has been at the forefront of these developments, being the first traditional ETF issuer to file for a Bitcoin ETF in 2017 and a Spot Ethereum ETF subsequently. Sigel expressed optimism that VanEck’s Ethereum ETF could be among the first to trade among its rivals. He stated, “I still hope and expect that the VanEck Ethereum ETF, if it’s approved, will trade first.”\n\nThe next critical step involves the SEC’s approval of Ethereum ETFs’ S-1 filings. Sigel explained, “To list one of these ETFs, it’s like a nuclear code: you need two keys—the 19b-4 and the S-1. We’ll have to wait and respond to the agency’s comments if there are any, and we’re hopeful that these products can be trading in a matter of weeks.”\n\nAlso Read: VanEck Advisor Slams TradFi Over GameStop Saga, Hails Bitcoin\n\nImplications On Ether & Crypto Market\n\nWhen asked about the broader implications for Ethereum, Sigel revealed a bullish forecast, projecting Ethereum could generate over $70 billion in free cash flow to token holders by 2030, supporting a coin price of $22,000. This forecast reflects a more constructive view of the political landscape and the recent boom in users transacting on the network due to Ethereum’s scaling roadmap.\n\nIn addition, the VanEck exec also touched on the transformative potential of crypto assets. He noted, “This is an open-source app store with the potential to take significant margin away from the big tech platforms and also banking.” The VanEck exec also emphasized the importance of educating traditional market participants about the real-world use cases of these assets.\n\nThe approval of the Spot Bitcoin ETFs earlier this year has already opened up the market to a new class of buyers. These include registered investment advisors and pension funds, which could be a similar case for Ethereum ETFs if approved. Sigel pointed out, “The Spot ETFs have opened up an entirely new class of buyers, and we’re seeing that market share gain continue.”\n\nLooking ahead, Sigel acknowledged the political shift toward a more favorable regulatory environment for crypto, driven by significant industry lobbying efforts. He commented on the recent passing of the Fit for the 21st Century Act by the House. Sigel stated, “It lays the groundwork for a much more favorable environment next year.”\n\nAlso Read: ETH/BTC Price Analysis: Why Ethereum Price Can Break Out to $5000\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUE9Rc3FyMTZUMzVxVlpsejY3QlFaVmM3LXVxR1FTV1huUmhfYnZQNzdWSjV2ajJzVVRvRlBpSDdTSGx2ZEZKWjAtNkp0cmltUGlMQ05UU1dxdFlOV19NckVHdW9YWC1fUW1HNXczRzlKM1pfN2NUZVlXN3hORjd4S1ctUDdlZ9IBjgFBVV95cUxPWmExNGFicWJGUGpEc0EtT0x2cC1TZWstWTdxcjctOHh3Ykx2aV81UFU2emI4UkNHRDU5Y3U1QnI5Q2drQVZqdFgxd1BIbFhtRXZwNXk5TzZicUxzN2RGZXFOM2xLem4zYnk0VjFyY3d3U2tBUWdnejRxZE5FcnBHeE83cmIzeEZGdW1udGJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Pump—Then Dump—Amid Roaring Kitty Rush - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin and crypto investors received a lot of good news this week, even though the market still can’t manage to break free from its highs three months ago.\n\nOn Tuesday, the US Bitcoin spot ETFs absorbed net inflows of $887 million—the second-best daily performance for the ETFs to date. The price of Bitcoin surged above $71,000 in the process, reaching its highest price since March.\n\nThat performance was followed by not one, but two high-profile Bitcoin ETF sponsors assuring investors that a second, much larger wave of institutions was coming to buy Bitcoin through the funds. Bitwise CIO Matt Hougan wrote in a memo that crypto regulatory progress on Capitol Hill was untapped “alpha” for investors, while Franklin Templeton CEO Jenny Johnson said the ETFs had only been touched by their “first wave of the early adopters.”\n\nAD\n\nAD\n\nJUST IN: Franklin Templeton CEO on #Bitcoin ETF adoption says “This is really the first wave of the early adopters. …the next wave is the much bigger institutions.” WATCH👇 pic.twitter.com/G52jWUEetX — Bitcoin Archive (@BTC_Archive) June 5, 2024\n\nAnd at least in the memecoin world, the bull market appeared to be back in full swing. Bitcoin’s very first BRC-20 token, ORDI, surged by over 30% to $60 as of Friday, while PUPS and Bitcoin Wizards (WZRD) more than doubled in value intraweek, according to CoinGecko data.\n\nOther more popular memecoins like PEPE, BONK, and SHIB weren’t as lucky, all posting losses this week.\n\nThe Solana-based meme coin GME seriously spiked, blasting up 467% at its height this week, building on the momentum of its stock market namesake Gamestop (GME). Meme influencer Roaring Kitty—who sparked the Wall Street-confounding GameStop movement back in 2021—gave the stock a second wind with his surprise returns to both YouTube and live streaming, with his net worth briefly edging toward $1 billion—before a Friday cold shower from the game retailer.\n\nPerformance-wise, between Bitcoin and meme coins is Ethereum, which kept pace with Bitcoin’s gains this week as its progressed toward a spot ETF launch. VanEck analysts posted a lengthy report arguing that ETH will reach $22,000 per unit by 2030, after sucking away financial market share from Apple, Google, and big banks.\n\nAD\n\nAD\n\nFinally, with both the Bank of Canada and European Central Bank lowering interest rates this week, BitMEX co-founder Arthur Hayes told followers that it was officially time to start apeing into Bitcoin and shitcoins.\n\nYet his call may have been a tad premature: at the end the week, a liquidation cascade on Friday sent Bitcoin crashing from $71,000 to $68,000, and ETH down from $3,800 to $3,600. Meanwhile, GME—both the stock and the memecoin—cratered by over 35% each.\n\nRoaring Kitty is the greatest business communicator since Steve Jobs. Dude shows up 30 minutes to the livestream. Builds the tension up to 11. Shows up on the livestream in a fake bandage and cast. And the first thing he says is “oh shit”. pic.twitter.com/YlTesdxJGB — Trung Phan (@TrungTPhan) June 7, 2024\n\nBitcoin is trading for $69,335 as of writing, while Ethereum is priced at $3,686. The price of the GME meme coin has once again settled near $0.014.\n\nPrices current as of 3am ET on June 8, 2024. Edited by Ryan Ozawa."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQaFNSRm9FQmR6ZExoMUlweV9LOFdhY1FkaG1iMnpJTmNKRlVLV2JUTjBXS2h6U1JLdllKNHlTcWVja2s3dHVwY1BhRmh3WHU1SFplQXhBZGVLLWVMdEpaUXVWTlJqZW1xMzlYZHJ3VDQzMzNYeV9pbVlVNlFMVlc5ZDNtNTg0aUc1emJ0cDdJeVBOdDNYV2lIaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "The Ultimate Cryptocurrency to Buy With $1,000 in June - The Motley Fool",
        "content": "With a little digging, it's easy to see why Ethereum is a top choice.\n\nIf you've got $1,000 to invest that you don't need for anything else in the short or medium term, and are looking at the cryptocurrency market, there are literally thousands of options. However, based on a combination of fundamentals and recent developments, Ethereum (ETH 0.21%) stands out from the crowd.\n\nThere are several compelling reasons why the world's second-most valuable cryptocurrency is deserving of your $1,000, but three stand out above the rest: regulatory acceptance, its deflationary nature, and its dominance in decentralized finance (DeFi).\n\nRegulatory acceptance looms\n\nThe Securities and Exchange Commission (SEC) recently approved applications from several firms looking to launch the first spot Ethereum exchange-traded funds (ETFs). This paves the way for these firms to submit their S-1 forms, which would then allow the ETFs to go live. These ETFs are expected to become available for trading sometime in late June or July.\n\nHaving spot ETFs is a game changer for democratizing access to Ethereum. It will mean that investors can purchase Ethereum through a traditional brokerage account, eliminating the need to navigate often complex and intimidating crypto exchanges. This ease of access will likely attract a broader range of investors who have been hesitant to enter the crypto market.\n\nThe most significant impact, however, is the potential influx of institutional investors. Until now, many institutional investors have been wary of directly investing in cryptocurrencies, including Ethereum, primarily due to regulatory uncertainties and the lack of a straightforward investment vehicle.\n\nThe approval of spot Ethereum ETFs removes these barriers, allowing institutions with deep pockets to participate in the market. This probable influx of institutional capital could put significant upward pressure on Ethereum's price, similar to what we saw with Bitcoin (CRYPTO: BTC) following approval of spot Bitcoin ETFs early this year. In the months after the spot Bitcoin ETFs launched, they were buying Bitcoin at 10 times the daily production rate, driving its price to a new all-time high. If things unfold in a similar fashion, Ethereum could experience a similarly explosive boost.\n\nDeflationary dynamics\n\nWith a new set of buyers entering the market, Ethereum's price could benefit even more than Bitcoin's thanks to a crucial upgrade the blockchain received in 2021: the London hard fork. This upgrade introduced a mechanism that makes Ethereum deflationary by burning a portion of the transaction fees. Essentially, every time a transaction is processed, a small amount of ether is permanently removed from circulation.\n\nUnlike Bitcoin, which has a fixed supply cap of 21 million coins, Ethereum does not have a supply maximum. However, the deflationary mechanism introduced by the London hard fork means that, under the right conditions, more ether is burned than is created, reducing the overall supply. This burning mechanism is particularly effective during periods of high network activity, as more transactions result in more ether being burned.\n\nBitcoin is often lauded for its low inflation rate, but it is worth noting that Ethereum's inflation rate is currently lower. Since the London hard fork went live, Ethereum's inflation rate is approximately -0.18%, meaning that its supply is actually decreasing.\n\nThe pending launch of Ethereum ETFs could significantly alter the supply and demand dynamics, potentially sending its price even higher. Increased demand from ETF purchases, coupled with the deflationary effect of the burn mechanism, creates a perfect storm for price appreciation.\n\nThe DeFi champion\n\nIf the pending launch of ETFs and the deflationary nature of Ethereum are not enough to persuade you to invest, consider Ethereum's undisputed leadership in the DeFi space. More than 60% of the DeFi market is built on the Ethereum blockchain, which is not just a statistic but a testament to its foundational role in the future of finance.\n\nDeFi represents a revolutionary shift, transforming how financial services are delivered by eliminating the need for traditional intermediaries. Instead of relying on banks or other financial institutions, DeFi platforms offer services such as lending, borrowing, and trading directly through blockchain technology. Ethereum's robust smart-contract capabilities make it the perfect platform for these applications, enabling secure, transparent, and automated transactions without the need for a trusted third party.\n\nThe significance of Ethereum's dominance in the DeFi space cannot be overstated. As more DeFi applications are built on Ethereum, the network's utility and value increase. This growing ecosystem creates a positive feedback loop: The more users and developers who participate, the more valuable and indispensable the Ethereum network becomes. This network effect not only enhances Ethereum's current value but also ensures its long-term potential as the backbone of decentralized finance. As DeFi continues to expand and integrate with traditional financial systems, Ethereum's pivotal role will likely drive substantial and sustained growth."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPWDZIb1p2clhMc2haOEktQU00NkxSeVZlenBGWUtLS2VvSk9Rb2E5U05zQmtvQ2dNUEVKWUxHV3VNeXc1X0NPZlBuTWRTSEdBVTFWOEVQRks5M1A3QUJIRmhSd0x3NnJ1cnJnT2syczZhUGFkN0pxWmRyRzVXSTgtZ3hYN0lNWGVHdkkyWkJQWThXZ9IBlwFBVV95cUxQdnpvdEd4S05WYWZ3VEprbDY3ZzJBc0dMay1ETk1fY3FVMWp4b3Q5NW1POEZ5UUd1eU5SVm9JbGlGWkFhNlpUR0JyWnRCX3lfT2hwTnRxMmFXZUc4VTg2SWxpWXpEQmdJUE03Q1ZSODJoYVlUdHYwMTAyandvSUkzbUxBbVByelJIVUFxaDJwV1dTaHU3OEFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum whale’s $56M sell-off could have THIS impact on the market - AMBCrypto News",
        "content": "A major whale sold part of its ETH holdings\n\nAltcoin’s price fell, while Ethereum’s network growth declined too\n\nEthereum [ETH]‘s price registered a massive hike over the last few weeks, one fueled by news of new spot ETFs for ETH. Despite the optimism around the network, however, a large whale recently decided to sell its holdings.\n\nWhales shy away\n\nOn 8 June, a significant transaction occurred on the Ethereum blockchain. A major whale transferred 15,200 ETH, worth approximately $56.47 million, to Kraken. This particular address received massive holdings of 67,000 ETH directly from the Ethereum Foundation. It is further believed that this same address also received an initial 200,000 ETH during the Ethereum Genesis block, likely signifying participation in the ICO (Initial Coin Offering) that launched the Ethereum network.\n\nHere, it’s worth noting that despite this recent transfer, the wallet still holds a balance of 41,000 ETH – Valued at approximately $151 million.\n\nThis large transaction may be interpreted by some investors as a sign that the whale is losing confidence in Ethereum’s future, prompting it to sell its holdings. This fear-based selling could trigger a domino effect, driving the price down further.\n\nAdditionally, the unknown purpose behind the transfer can spur further uncertainty.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,683.83, with its price down by 3.14% in the last 24 hours. Despite this sudden dip in ETH’s price, however, the overall trend of the price movement looked relatively positive.\n\nAnd yet, the network growth for ETH declined significantly over the last few days, implying that new addresses were losing interest in ETH and were not ready to buy ETH at the current rate. If the price dips further, there may be a chance that ETH may begin to look lucrative to new investors in the future.\n\nCoupled with the declining network growth, the velocity at which ETH was trading also fell materially.\n\nIn terms of overall activity on the network, gas usage on the Ethereum network declined over the last few days. Additionally, the overall NFT trades on the network plummeted as well.\n\nThe lack of activity on the Ethereum ecosystem can be detrimental to both the the network and the price of ETH in the long run.\n\nIs your portfolio green? Check the Ethereum Profit Calculator"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOTTBOdDRiY2JlN3lYdFZTWVd3THZlLUJQUWcxTXNMeXRrbVhyT3RRd2ZLQ2NrTEdTUlR1c0pFTmZJYUF1cDFRTXZiSGctN21wYms5aVpiYnRrRURXYkY2V2xyS0FNN3RINng5UHEycWZfcC1VYm10M2p6WkRlVHRHU09na9IBiAFBVV95cUxQc2NGQkZQQmllcmJBQXp5VE41NElKbjg1OVR6cGx6NWVpbTc5NWFjQVJpbGtMWUJ2RXREdzl6T1hQZHFDWTl4R2UzMlZzQnBwMmpqN3JwVnRrNVoxZVR3LWpzWk1MQlBJcV85QVJKMzJHSFBtVnlVemFtY0V3MVZUSExtWEYxVGl0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Biggest Ethereum (ETH) Hard Fork Coming: Pectra Agenda Announced - U.Today",
        "content": "Advertisement\n\nPrague-Electra (or Pectra) upgrade is going to advance security, scalability and performance developments accomplished by Cancun-Deneb. While its final agenda and activation date are still being discussed, Pectra is expected to be among the most radical upgrades of the Ethereum (ETH) design.\n\nEthereum Pectra upgrade to replace AA and changes game in staking\n\nEthereum (ETH) developers agreed about at least five of Ethereum Improvement Proposals or EIPs that will be included in the Pectra upgrade. The list was shared by Anthony Sassano, independent Ethereum (ETH) researcher and educationist.\n\nEIP-7702 is set to replace Ethereum's (ETH) current Account Abstraction mechanism, ERC 4337. It will advance the way Ethereum (ETH) accounts are performing activity of smart contracts.\n\nAdvertisement\n\nEIP-7594 \"Peer Data Availability Sampling\" will upgrade the scaling opportunities of Ethereum's L2 rollups. EIP-7251 \"MaxEB\" will raise the limit of stake in Ethereum (ETH) PoS and introduce triggerable exits for its participants.\n\nEIP-2537 is set to add functionality to efficiently perform operations over the BLS12-381 curve, including those for BLS signature verification, as per EF main GitHub repository.\n\nLast but not least, EIP-7549 will make consensus voting procedures more efficient by reducing the average number of pairings needed to verify consensus rules.\n\nPectra hard fork expected to be activated in Q1, 2025\n\nSassano added that right now the history expiry function is being considered for inclusion in the next hard fork. Meanwhile, hotly anticipated Verkle Trees will likely be added in Osaka, the first post-Pectra hard fork.\n\nThe Ethereum (ETH) veteran concluded that his particular estimation for the Pectra activation date is Q1, 2025, while in some sources, community enthusiasts also discuss Q4, 2024, as a potential timeline.\n\nAs covered by U.Today previously, Prague-Electra upgrade specifications were introduced to the community in January 2024."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOR0ZnYk5TcUltZm52OWhxTDJyQkdEM2lRWU9qVDRMV2hIU09HVGNIRThPS0poNkI2VkY4aVpvLXlZR1hIbXNjZy1penNPUDExNS11QjAtVi1PYUE4b3VUOXlfVnVRUzk3NmlrZ0h4LVZtcnBxbXBqdmdmeHIxY1h3Zm5ZYnZmSk1jZUZtSlRjNEZfUdIBlwFBVV95cUxPcExsa0hJMWxvaXl2cURVd3h5WVA2by1Tc3RlXzRvcVJQQ1RnOTVnVEhSSmx6VVF2QzQ2cEw4OTJSdU0tc2hWRk13VjNUbWk3eWJneFNHcE9FcDhjSkJMcmZINXFvM0Y0QTBONFBVbWhONllrMHdZLVJfVDZ1UlVXMXQtbU16S0M3d3hIR2IyZ2E3VkVhTWxZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Are Litecoin holders in a better position than Ethereum investors? - AMBCrypto News",
        "content": "Transactions on Litecoin increased across all levels, leaving Ethereum trailing\n\nETH and LTC prices fell in the last 24 hours, but they might surpass major milestones soon\n\nIt is unusual to find Litecoin [LTC] surpassing Ethereum [ETH] at any level. However, on 6 June, the number of active addresses on Litecoin’s network jumped by a mind-blowing 75%.\n\nAccording to data from IntoTheBlock, the difference was over 100,000 in favor of Litecoin. In total, the figure was 602,720 and represented the highest level of activity on the network since January.\n\nAfter Cardano, Litecoin takes Ethereum out\n\nFor context, active addresses measure the number of unique wallets engaged in successful transactions on a blockchain. A few days ago, the coin had registered higher values than Cardano [ADA] on the same front.\n\nHowever, it is important to mention that most of the transactions emanated from wallets with a small balance.\n\nThat being said, those holding LTC worth $10,000 to $10 million were not left out. According to IntoTheBlock’s latest post on X,\n\n“While most of the increase is due to transactions smaller than $10, there is a noticeable rise in transactions of all sizes.”\n\nHere, it’s worth noting that the rise in network activity did not trigger a hike in LTC’s price. At press time, Litecoin was valued at at $83.52, following a fall of 1.8% in the last 24 hours. Ethereum, on the other hand, was trading at $3,791, with the altcoin depreciating slightly too. Additionally, AMBCrypto looked at Litecoin’s market cap to thermocap ratio. This metric measures a cryptocurrency’s valuation relative to the total security spend by miners. When the market cap to thermocap ratio spikes, it means the coin is trading at a premium when compared to miner spend. In this instance, the price could be termed overvalued.\n\nHistorically, as shown below, an extremely high reading of the metric causes a correction. However, at press time, the ratio was 0.00000003. This was a low reading, compared to periods when Litecoin has been overheated.\n\nAre LTC and ETH at a discount?\n\nSimply put, LTC may be trading at a discount . Should the market return to a highly bullish state, the price of LTC could move past $100 from its press time position.\n\nTo confirm this thesis, AMBCrypto examined the Market Value to Realized Value (MVRV) ratio. This metric track the profitability of holders in relation to coin valuation.\n\nAt press time, Litecoin’s 30-day MVRV ratio was 13.35%, indicating that the average holder would make profits if they sell. However, the gains might be high enough to trigger widespread profit-taking.\n\nFor Ethereum, the 30-day MVRV ratio was 4.69%. While this suggested that ETH and LTC may be in similar spots, it also addressed the notion that Litecoin holders might be in a better position than their Ethereum counterparts."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBKNUxXTFZRQUplR2F0Q2ZxWTJERUp1ZVJtdVo0UkJZU0l3bXRGcmtEMHA2TUNTb3d2QXc1NkZaQVZEWUNzdE1tRE5DRkFtaTgzTGRCRDc0MllNaDNKcWpWcmp5eTN3bjA40gFuQVVfeXFMTmwzeVNNbnR4SUlIeUtEOFdSUVVlQ0ZwNU1RWV9wdS1TMnNqa2NyR3BtU2JLN2xUUnZUbUF3SWtrNjZDN00yR1FqR0dtYXVkaENuc1NUSllPZWhxdDNfeUhoTVZrSV8zMGNzMkIzM2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Loses Critical Support Level - U.Today",
        "content": "Ethereum fell below the $3,700 threshold, failing to break through the consolidation channel. With the price failing to surge upward, we might see another period of consolidation where the moving average could catch up with the massive volatility witnessed a few weeks ago and potentially provide some ground for a rally continuation.\n\nAdvertisement\n\nSince this level has been a crucial area of support for ETH, the recent decline below $3,700 is especially raising some concerns and questions. If it breaks below, it may indicate that bulls need to reorganize as bears are becoming more powerful.\n\nSharp swings in price action are characteristic of a volatile asset like Ethereum. Based on the current trend, it appears that ETH is having difficulty keeping up its upward momentum.\n\nEthereum went through a consolidation phase, fluctuating between support and resistance levels, as the chart illustrates following a significant rally. This type of activity typically occurs before a notable change in price either upward or downward.\n\nAdvertisement\n\nA deeper drop toward the 200-day MA, a more reliable measure of the direction of the long-term trend, could occur if it is unable to hold. In the near run, this might entail increased downside risk. An additional important consideration is volume.\n\nHigher-than-average trading volumes were seen along with the recent decline, suggesting that sellers are more active. This could indicate that more traders are cutting their positions, which would put more pressure on the price to decline. The RSI, on the other hand, is circling around neutral. This shows that Ethereum has room to recover if the mood of the market turns around, and it is neither overbought nor oversold."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPMXZSeGxnQXRtNmg0SEZzVjczN1Jrb3V2Sk1aTWhhNE5hYnlpY1NaaWp0NEkwdF95c2hwU0ZJcEEtbjRYSHdzZHI5WkwwcWFiMU4zZTFKeU9rS2hLWjBGNUROQnY2RUh0a056aU91dkc5UnpoUDkzM25EaUJnakVWNEtFbWVQZEgyUlhsZVpzMjhsZFBaSmYzVDNzSWY3d9IBowFBVV95cUxOaTY3aUZRaU0wSGNCU056SHBJYzVRYUhaQlFNY0JKOFlkMXJLX2NzQzdTbTJmZzZjXzZsdHEzY1JUVkc1NTByYzdmSUdBQW5RMTAzLUJSdmtTR2Y3dExFQksxRFhuajRJZGRpV2JEQ0VQcHRHMTVKVmRaMGRBT2lvd3lLbHVRam1NSXA0dWNXR1JXZVpwd0dNQVVPUjJBQVlzQ2ln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s bullish outlook fades; Look out for these key signals now! - AMBCrypto News",
        "content": "ETC’s market structure was bullish at press time\n\nMomentum and volume indicators turned bearish on the charts though\n\nEthereum Classic [ETC] retested the $25-support level and nearly flipped its higher timeframe market structure bearishly. This came after an unfavorable U.S May Jobs Report. Its short-term momentum seemed bearish too.\n\nIn a recent report, AMBCrypto noted that the $28.4-$29 zone could be revisited before a bounce. Ethereum Classic dropped more than expected. Ergo, the question – How do traders react to the recent price action?\n\nThe $29-support level did not hold\n\nThe recent higher low was set at $25.19 on 13 May. The price drop on 7 June, touched $25.07, but did not close a daily session below $25.19. Hence, the bulls seemed to have the upper hand on the higher timeframe, though it appeared tenuous.\n\nThe Directional Movement Index saw the -DI (red) jump above the 20-mark. It was an early sign that the trend could be shifting bearishly, as the ADX (yellow) would also need to climb past 20 to signal a strong downtrend in progress.\n\nThe CMF was at -0.09, indicating significant capital flow out of the market. This selling pressure has been present for a week. It would need to turn around for bulls to regain some hope.\n\nFutures market highlighted intense bearishness\n\nOver the past 10 days, Ethereum Classic has steadily risen from $31 to $28.6. The past 24 hours saw a flurry of selling activity spurred by Bitcoin [BTC] though. Hence, ETC fell by 14.32% in a single 4-hour trading session, followed by a bounce from $25.07 to $27.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe Open Interest also fell sharply alongside the price, showing bearish sentiment and a reluctance to enter positions due to volatility. The spot CVD continued its downtrend too. The volume indicators agreed that selling pressure was firm.\n\nThe bulls would need to change this to re-establish an uptrend on the lower timeframes.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOa2pkWmdKczFkMUhWVjFFT29QMkh3VnVXeFgyZnFHaGxsV1ZBOEM2YW5kMnd2amJJazRrSlFRN1FNWGdRVmIwaDM5QTZ4TWZPOXdQdEh4SEt4cFl6Y1NMeE8wcDdsU280Yk1DVC1oWWpCSFBjS25JQkRwZnVIMnA2bHJUUDc2QdIBiwFBVV95cUxOZmNWdUdqQmtmN0d5N2c2TW1sWVF3MHJsWUxfbC0tcEo0bjcxMS0yYUlHeGE0N0xMbzN6R0x4YjRwVWhlRndfLVd6UzRWa2lKRC1tcFZ6OWxfbzZWcHdTMjB1dHo0NnN5Ry1RNHZFNXUwZm5ocVhhaHRPWlJqZXIwV1g3b3F1eHlwRTUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price: Analyst Predicts ETH To Note 13% Gain, Here’s Why - CoinGape",
        "content": "The Ethereum price, the world’s second-largest cryptocurrency by market cap, saw a steep decline today amid a widespread crypto market selloff. Meanwhile, this drop comes in the wake of stronger-than-expected U.S. job data, which has dampened investor sentiment over a hawkish stance by the Federal Reserve.\n\nHowever, despite the downturn, some analysts are optimistic about Ethereum’s potential for a significant rebound.\n\nadvertisement\n\nAnalyst Predicts 13% Ethereum Price Rally\n\nDespite Ethereum’s recent price dip, a prominent crypto market analyst, known as Mags (@thescalpingpro) on the X platform, anticipates a strong recovery. In a recent X post, Mags compared the current Ethereum price trend to historical patterns, suggesting that the cryptocurrency could experience a significant rally soon. According to Mags, Ethereum is “forming a similar structure” to a previous cycle, after which the crypto has soared 13%.\n\nNotably, Mags’ analysis indicates that Ethereum might reach up to $4,200 if the predicted trend holds true. Currently, Ethereum is trading near $3,700, and this potential rally would represent a 13% increase. This optimistic forecast is based on Ethereum’s historical performance, where similar patterns have led to substantial gains.\n\nMeanwhile, supporting this outlook, Mags shared a price chart showing Ethereum’s current structure, highlighting similarities to past cycles. The comparison suggests that the recent decline might be a precursor to a strong upward movement, akin to previous instances where Ethereum rallied significantly after a similar setup.\n\nAlso Read: Ethereum Foundation Wallet Deposits $56 Million in ETH on Kraken, ETH Price Drop Soon?\n\nPrice Amid Contrastive Views\n\nWhile Mags presents a bullish outlook, not all experts share the same optimism. A recent report from 10X Research has introduced a more cautious perspective. According to their analysis, Ethereum has broken a critical support level of $3,725. This breach has sparked concerns about potential ETH liquidations.\n\nThe 10X Research report highlights the risk of imminent liquidations following Ethereum’s drop below the key support level. Supporting this view, data from CoinGlass shows that Ethereum has experienced significant liquidations over the past 24 hours.\n\nSpecifically, $59.61 million worth of Ethereum has been liquidated, with $52.23 million in long positions and $7.37 million in short positions. This data underscores the market’s volatility and the potential risks associated with Ethereum’s current price level.\n\nHowever, despite that, optimism prevails with soaring optimism over the U.S. Spot Ethereum ETF. In addition, some market experts believe that the recent decline in the ETH price could provide a buying opportunity for investors.\n\nAs of writing, Ethereum price fell 3.21% to $3,683.75, while its trading volume over the last 24 hours soared 40.27% to $18.08 billion. Meanwhile, the Ethereum Open Interest fell 0.95% to $16.54 billion, reflecting the current gloomy sentiment hovering in the market.\n\nAlso Read:\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQaUFpT3hZLWRULXI2bUNncExPZWY4RVRGYVhkaHpQV3lqQ0kxTWpXa010TUNBNkt3eGk5aWkwVVlYSnVPZGR0M0hQOXp6WkUzajRRU1VCci1HVWczSDc5SG5UVjZNWTBOdWhBcnk3VEJybnZ2QmdpRGxwZzczZVllclhCbTFlX0NnbEcwNldB0gGTAUFVX3lxTE1TTFg1b2JqWUJQdnlPcTlLZmpXdzdzcTlSSVp5aDVRNkhsTlJ2SkFvc1FFR2xLb1dlR1VibWFDd0JZa205Y3NzbVJQODBWMnNIdm5LR0tUWnFpYl9fU3RuX0MtNklCbll5NzNSWXVrbGVVMHk0OUxOWlZLUThWOGZRT3FZYXZEZC1Yc0RhaG9hQ0thRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s circulating supply hits 120M: What’s the impact on ETH? - AMBCrypto News",
        "content": "Ethereum’s supply spiked last month.\n\nThis has happened due to a decline in daily active addresses on the network.\n\n46,138 Ethereum [ETH] worth around $176.22 million, at the altcoin’s press time price, have been added to circulation in the last month, pushing the altcoin’s circulating supply to a 30-day high of 120.14 million ETH, data from Ultrasound.money has shown.\n\nThe steady surge in the number of ETH coins in circulation means the altcoin’s supply is currently inflationary. This happens when the network witnesses a decline in user activity.\n\nAMBCrypto confirmed this decline, as data from Artemis revealed a decrease in the daily count of unique addresses interacting with the Ethereum blockchain in the past 30 days.\n\nAccording to the on-chain data provider, as of 5 June, 361,200 addresses completed at least one single transaction on Ethereum. This represented a 14% drop from the 421,000 unique addresses transacting on the network on 8th May.\n\nIn fact, during the period under review, the count of daily active addresses plummeted to a three-month low of 326,200 on 2nd June.\n\nAccording to Artemis’ data, the last time the daily count of the number of Ethereum’s active addresses was this low was on 8th February.\n\nInterestingly, due to the 25% spike in ETH’s value during the period under review, total transaction fees on the Ethereum network did not decline. It rose, even amid the dip in user demand.\n\nOn 5th June, Ethereum’s transaction fees totaled $10 million, its highest since 13rd April.\n\nA look at Ethereum’s DeFi and NFT verticals\n\nWhile the chain has seen fewer users in the last month, its decentralized finance (DeFi) ecosystem has grown considerably.\n\nThe total value of assets locked (TVL) across all DeFi protocols housed on Ethereum has grown by 25.38% in the past 30 days. This makes it the second blockchain, after Arbitrum [ARB], among the top 5 networks by TVL to record the most growth during that period.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAccording to data from DefiLlama, Ethereum’s TVL was $66.33 billion at press time, a year-to-date high and its highest level since May 2022.\n\nEthereum’s non-fungible tokens (NFTs) sector has not recorded the same success during the period under review. According to CryptoSlam, NFT sales volume on Ethereum has cratered by 56% in the past 30 days."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMjBjT0RGc3lzUi1ZbUlTbzZ2TlVJVFJRRjluOW9DSU1lbnZCVkc1TWt4VjNhUjg1SkhDSEROMEJNUkU4YW9SMy1PcTdfZ2lVMGZmUjVzQmtvNjNuZ0VhTG5kVi1QU0tLUTZmaVh5blp1cTZ1anIyX2F6WmUxVTJOWDNMM2hwZEo5c2pr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ancient $21.9m Ethereum Whale Awakens After 9 Years - Crypto Times",
        "content": "A dormant ETH address that had been silent for nearly a decade suddenly came back into action, having $21.9 million worth of ETH. According to the Whale Alert data, this is the first pre-mine Ethereum address to be reactivated in June.\n\nThe awakening of the ancient crypto treasure has caused quite a stir among the Ethereum community on X with speculators wondering who could own such a wallet and what are their intentions with this huge amount of ETH.\n\n💤 💤 💤 A dormant pre-mine address containing 6,000 #ETH (21,962,887 USD) has just been activated after 8.9 years!https://t.co/HlrVyVZ7D6 — Whale Alert (@whale_alert) June 7, 2024\n\nFurthermore, prior to the official launch of Ethereum in 2015, there were pre-mine addresses. Through them, tokens were minted and distributed during Ethereum’s initial sale which allowed early supporters and investors to grab a piece before it was widely known as a blockchain project at the time.\n\nWhile the reasons behind its sudden revival remain unknown, it coincided with when Ether experienced an abrupt dip in price.\n\nLast week witnessed ETH plunge close to an intraday low of $3,642 as the crypto markets reacted to the recent expected U.S. jobs report which reduced optimism about another immediate interest rate reduction by the Federal Reserve."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQeXFLd0RGSFQ5VDZTcmM3bVZhTVZkaGgwcWtJb1JYYjFQazhPMnFtSWlLLW1wYmpzcVlqZDVnQy1YeHRtMFNVN0UyWkNjaGRIMksxb3lJeDRxWElwYXpxeUFoSEM3VENLbC1ZQ1V4c09kcVNiOVpvMU82dFFyTV85VdIBhgFBVV95cUxPbVdCWjJ2emF4TUdUZFdWVWswbkxNV3JqZjhSdS1DWjJ3TDJzQ2xJYlQ3X3U4SFZUTVBFRGlkWjZVSFBoNVhla1ZxRjJNaFlFMUlhSC1MbHlyZFgzUjkydnllajZGWHUzM19xMFE5ZUUwblkwamdjMFBCbE5mNDIyVUdaTTdyZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Uniswap decouples from Ethereum: Will UNI hold onto $9? - AMBCrypto News",
        "content": "Exchange supply for UNI increase while it dropped on Ethereum’s network.\n\nA declining sentiment, set off by decreasing demand, indicated that ETH could slide to $9.20 in the short term.\n\nFor the last seven days, Uniswap’s [UNI] price and Ethereum [ETH] have failed to move in the same direction. At press time, UNI changed hands at $9.98, representing a 2.22% increase in the last seven days.\n\nETH’s price, on the other hand, was $3,687. This was a 2.56% decrease within the same period. However, that is not the major issue at hand.\n\nSomething AMBCrypto observed using on-chain data from Glassnode was that the tides could soon change.\n\nThe correlation goes off\n\nEvidence of this was reflected in the Exchange Net Position Change. According to our analysis, Uniswap’s Exchange Net Position Change was 733,683 on the 8th of June.\n\nThis metric is the total supply of tokens held in exchange wallets. If it is positive, it means that more tokens are going into exchanges, and this could lead to a price decrease.\n\nHowever, a negative reading suggests a surge in withdrawals, which could lower selling pressure. For UNI, the number of tokens held on exchanges has been increasing since the 3rd of June.\n\nTherefore, there is a high chance that the price of the token could lose hold on the $9 region if the supply remains positive. However, it was a different ball game for Ethereum.\n\nAn evaluation of the same metric with ETH indicated an increase in coins taken ofd exchanges. According to Glassnode, about 576,851 ETH was withdrawn from exchanges on the same day 733,683 UNI tokens flowed in.\n\nUNI is set to fall further\n\nTherefore, it is possible to see the price of UNI fall while ETH could be in line for a swift recovery.\n\nIf validated, this could be contrary to the price performance of the cryptocurrencies when the U.S. SEC approved spot Ethereum ETFs.\n\nIn the build-up to the announcement, ETH’s price jumped, and UNI’s connection with the blockchain ensured it followed in the same direction. But how low can UNI go this time?\n\nTo check the possible targets, AMBCrypto analyzed the Weighted Sentiment, which shows the perception market participants have around a project. At press time, the Weighted Sentiment was -0.173.\n\nThis negative reading suggests that most comments about Uniswap tilted toward the bearish side of things. Thus, demand for the token could drop, and could trigger a price decrease.\n\nIn addition, the Market Value to Realized Value (MVRV) Z Score which was 27% a few days ago was down to 23.58%. When the MVRV Z Score is positive, it implies that the token is in a bull phase.\n\nRealistic or not, here’s UNI’s market cap in ETH terms\n\nOn the other hand, a negative ratio suggests that a fall into the bear cycle. However, the recent decrease does not mean that UNI is dropping into a bear phase. But it is a sign that the price could slip down the charts.\n\nBy the look of things, a drawdown to $9.20 seems quite possible."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQb2hDVEQ4czVRR0thQ1VMVWI5NVBET3UtYXluS1ZsTTk0UnFoaGNObE9xWVNnUEZKWE5ISGFrMnE5ZGN2MGhJQ1hkOW5mc21CMzhXVXpJUjJjYngxZlpvQTR4elJMNzJyLUJyRldtcjFqVzA1LVZNWklEWENQUHdOcUNlTHBhV29nRnNpVDY3YXdaZ0xGYzZCNkxPZUlNRVowbWNJdHh30gGrAUFVX3lxTE5qREUwMVAwbW1ORTZuNFc5TGtMZ08wUzlFUW1PMXVoRDdiSFBEVVRRWTNYbmRyV2tkeDdHc010WExhbnBzOW1fNzhneUNrNFlQLU13dHk5Wjg0OHhrSTlya29DWjVMajgwNzZTQXVkLXhNMXk1blcxVDAzaVBENWdrTlR4UkdpbVJMZTlNbXVZUW1TTGk4eTM0Y2RibVZFRS1qcm8wYXQ3OFFlUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Wallet Deposits $56 Million in ETH on Kraken, ETH Price Drop Soon? - CoinGape",
        "content": "The world’s second-largest cryptocurrency, Ethereum (ETH), experienced a significant correction of over 3.5%, with its price falling below $3,700. The ETH price hit an intraday low of $3,620 before rebounding.\n\nEthereum Whale Deposits 15,254 ETH to Kraken\n\nIn a recent update provided by on-chain data provider LooKonChain, it was revealed that amidst the decline in the price of Ethereum (ETH), a wallet associated with the Ethereum Foundation made a significant deposit of 15,254 ETH, equivalent to approximately $56.1 million, into the Kraken exchange.\n\nadvertisement\n\nThis deposit, occurring just 8 hours prior to the announcement, attracted attention due to the origin of the ETH in the wallet, sourced from both an Ethereum Foundation wallet and another wallet that received 200,000 ETH during the Ethereum Initial Coin Offering (ICO).\n\nWhen the $ETH price started to drop, an #EthereumFoundation-related wallet deposited 15,254 $ETH($56.1M) into #Kraken 8 hours ago. The $ETH in this wallet comes from an #EthereumFoundation wallet and a wallet that received 200K $ETH in the Ethereum ICO.https://t.co/j7KPmMt1i8 pic.twitter.com/8Oi5zWMeiC — Lookonchain (@lookonchain) June 8, 2024\n\nA recent report from Whale Alert indicates that a previously inactive pre-mined Ethereum (ETH) address, holding approximately $21.9 million, has become active after nearly nine years of dormancy.\n\nThis marks the first reactivation of a pre-mined Ethereum address observed in June. In May, two similar addresses, one holding $325,535 and the other $5.9 million, respectively, also experienced sudden activity after a prolonged period of dormancy.\n\n💤 💤 💤 A dormant pre-mine address containing 6,000 #ETH (21,962,887 USD) has just been activated after 8.9 years!https://t.co/HlrVyVZ7D6 — Whale Alert (@whale_alert) June 7, 2024\n\nETH Price Action Ahead\n\nAccording to the latest findings from the on-chain data analytics firm, Ethereum’s demand has surged following the approval of spot ETH ETFs in the US on May 20. Since then, the daily acquisition of ETH by long-term holders has surged to an average of 40,000 ETH, a significant increase from the pre-announcement average of 5,000 ETH.\n\nFurthermore, the report highlights a notable uptick in the total holdings of major ETH investors, which now stand at 16 million ETH. This figure marks an increase from the pre-ETF approval level of 15.4 million ETH and the beginning of 2024, when holdings were at 14.9 million ETH\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOQkhzTVpRcDRxUUFsUjBJTGVBVzRkUUxoM0ZySy1DaVd2LW9CTmRpZUp0UTctRWw5QWhJRjBBbWhKNEZBOFNVanFyV0lpTS1EN0FlMERwTURmeVZpbFprQUh1NE9pcEVoaDFfazVlSExBTm1FWThNY1ZVZjBnaVBoaF83VjJQOHB6cGs3NG14dG1mc0oxOGhNVG1seFZZUXNvTHJvSjVfVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum ETFs Are Not Of Interest To Anyone! According To Analysts - Cointribune EN",
        "content": "Sat 08 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic world of crypto, exchange-traded funds (ETFs) represent a significant step forward for institutional adoption and mainstream investment. Recently, attention has turned to Ethereum (ETH) ETFs, which analysts suggest may experience more moderate demand compared to their Bitcoin (BTC) counterparts.\n\nCrypto: Ethereum ETFs Less Attractive than Bitcoin ETFs!\n\nJPMorgan strategists, led by Nikolaos Panigirtzoglou, estimate that Ethereum ETFs could attract between $1 billion and $3 billion in net inflows by the end of the year. In stark contrast to the $15.3 billion amassed by Bitcoin ETFs. This modest forecast reflects a less broad recognition and acceptance of ETH compared to BTC crypto, which saw a rapid 169% increase in its price over the past year.\n\nJames Davies, CPO and founder of Crypto Valley Exchange, highlights that the demand for Ether might be lower due to its relatively less established notoriety. Caroline Bowler, CEO of BTC Markets Pty, adds that “Ether does not have the profile of Bitcoin” and points to BTC’s market value of $1.4 trillion, which is three times that of Ether.\n\nLong-term Prospects of Ethereum\n\nDespite less enthusiastic anticipation, Ethereum ETFs offer unique advantages. “ETH has utility that is mostly absent in the Bitcoin ecosystem, so a large part of the overall crypto ecosystem is tied to ETH,” says Davies, suggesting significant long-term growth potential. Matthew Sigel, head of digital asset research at VanEck, supports this view, stating that “over time, we expect that investors will conclude that the application and innovation potential within the Ethereum ecosystem might be far greater than that of Bitcoin.”\n\nHowever, concerns remain regarding potential sell pressure due to the planned conversion of Grayscale’s $11 billion Ethereum fund into an ETF. Davies warns that the “sell pressure” on Ether resulting from redemptions in Grayscale’s Ethereum fund could be significant. Nevertheless, he also notes that net inflows into BTC ETFs could potentially offset this pressure.\n\nFinally, while the potential demand for Ethereum ETFs appears promising, they are expected to attract significantly less interest compared to Bitcoin ETFs. Factors such as the absence of staking rewards and differences in market perceptions of crypto contribute to this outlook.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNQWtpenpiZy0zNlVEdXJQT1h4YllsSnIyYWZuMC1IajZZdERjNmxBX2c0ejdocHVGdFNvcjJNV25HYVBfQ3VWSEpkMkxadkwzLWpmVXJJbW1wR3d5M0ptTF9tVWlfdEs2NTBsMkdoUUF5ZnpRTkdwYXJqM09hRnFUZlo1Q3VnV280SE9tRFdPM1E2c2pDWDZrRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Should You Buy Solana Right Now While It's Below $200? - The Motley Fool",
        "content": "If Solana can convince investors it's the next Ethereum, it could skyrocket in value.\n\nIn 2023, Solana (SOL 0.81%) was one of the top-performing major cryptocurrencies, up an eye-popping 900%. In 2024, Solana has continued to turn in a stellar performance. At its current price of $165, Solana is up more than 60% through the first five months of the year.\n\nThe problem, however, is that Solana appears to be running into a wall right now. It is down nearly 20% since it hit an intra-year high of just over $200 in March. Should you view this as a potential buying opportunity, or as a warning sign that Solana's impressive recent gains could be coming to an end? Let's take a closer look.\n\nIs Solana the next Ethereum?\n\nThe primary reason to invest in Solana right now is that it could eventually become the next Ethereum (ETH 0.18%). Solana is a direct challenger to Ethereum in the Layer 1 blockchain space, and has been steadily gaining ground in every major niche, from decentralized finance (DeFi) to non-fungible tokens (NFTs). For nearly four years, Solana has been tagged as a potential \"Ethereum killer,\" and now it finally seems to be delivering on its promise.\n\nCathie Wood of Ark Invest raved about Solana last year, calling it a faster, cheaper, and more efficient version of Ethereum. That's backed up by real numbers. Solana, for example, says it can process 50,000 transactions per second. Ethereum, by way of comparison, can only process 15 to 20 transactions per second. To achieve faster transaction processing speeds, Ethereum relies on a confusing mix of Layer 2 scaling solutions that even developers say is becoming too hard to use.\n\nSolana's secret weapon\n\nMoreover, Solana has a secret weapon that Ethereum simply cannot match: A mobile crypto strategy that is finally gaining traction with customers. Solana officially launched its new \"crypto phone\" (the Saga) last year. Early sales were weak, but a clever marketing promotion based around Solana meme coins has led to sales taking off.\n\nFrom the outset, Solana's mobile strategy was designed as a way to onboard new crypto users. The goal was to get a mobile phone into people's hands, give them plenty of apps they couldn't find anywhere else, and design new mobile experiences to make crypto easier to use. That, in turn, could result in people beating down the door to become part of the Solana blockchain ecosystem.\n\nAdmittedly, this might be a very long-term strategy. But it might just work. According to investment firm VanEck, all Solana needs is a single \"killer app\" with at least 100 million users, along the lines of a ChatGPT. If Solana can find a \"killer app\" for its mobile phone, it could be worth hundreds of billions of dollars.\n\nVanEck ran the numbers and determined that, in a bull-case scenario, Solana might be worth over $3,200 by 2030. So, yes, if you buy into this analysis, you should be buying Solana while it's still below $200. At today's prices, you might be able to make a 20-fold return on your investment.\n\nThe case against Solana\n\nHowever, there are a number of reasons to be concerned about Solana. For example, the current bout of meme coin popularity taking over the Solana blockchain seems to be leading to some unsustainable performance. All of the improvement that we've been seeing in Solana's metrics -- such as new users, new unique wallets, and spikes in transaction activity -- might just be a lot of smoke and mirrors.\n\nMoreover, Solana continues to stand in Ethereum's shadow when it comes to exchange-traded funds (ETFs). At the end of May, the SEC granted approval for new spot Ethereum ETFs to begin trading soon. If they are anywhere near as successful as the spot Bitcoin ETFs, they could lead to a huge influx of investor money flowing into Ethereum. That's fantastic for Ethereum holders, but it could act as a negative drag on Solana's price over the short to medium term. Money that otherwise might have gone into Solana will now be going into Ethereum.\n\nHow high can Solana go?\n\nThat being said, I'm taking a long-term approach when it comes to Solana. As Solana steadily gains market share at the expense of Ethereum, and as it continues to build out its mobile crypto strategy, I'm highly confident that it can continue to boost its valuation. Solana is still 36% below its all-time high of $260, which could be a reasonable near-term price target.\n\nIn a best-case scenario, of course, Solana will find the one \"killer app\" that it needs. If that happens, it could skyrocket in value and achieve what many have been predicting for several years now."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE0ybzRrODlqU3NGbTlMb2xMeV9qeklkek50QUVNcHlsZ0NOUWhWQkRtMXVIcnNBRG93NjBNc09UUWxjRjBXT1poWm53R2FKa3ZYMkpwRDY1SDg3VUpJNWd4NHM4VGdCTV9QOEp4RTVLdVdNSlRhbG44UkZlRVlIeUXSAYQBQVVfeXFMUF9kd0l0WVVnU05ST0dBTHZaYi13M2tGTUFNX0pzblpZNXVubFFlbVIxdFVCTDRESE43ekYzN2dRUXhDLTBEbmV6dGJGTTlHVnRjZXNFbXRrdWNCVFhwS2JMdTc1VFFGRDdiZGdiQ0sybHlGZF84dzlsQU9jdkZfV0lLaFVP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Analyzing whether $4.8K is in sight for ETH - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 2% in the last seven days.\n\nA metric suggested that ETH’s price was near its market bottom.\n\nEthereum [ETH] bears dominated the last week as the token’s price dropped. However, this might be the last chance for investors to accumulate more ETH while its price is low.\n\nETH was at a crucial resistance level, and a breakout above it could result in a massive rally in the coming weeks or months.\n\nShould you buy ETH now?\n\nCoinMarketCap’s data revealed that Ethereum witnessed a price correction last week as its value dropped by more than 2%.\n\nAt the time of writing, ETH was trading at $3,687.02 with a market capitalization of over $442 billion. However, this bearish price trend might change soon as ETH is testing a key resistance level.\n\nMilkybull, a popular crypto analyst, recently posted a tweet revealing this development. A breakout above the resistance would spark a massive bull rally.\n\nTherefore, this might actually be the last chance for investors to buy ETH under $3.7k in this cycle.\n\nAMBCrypto then checked ETH’s on-chain data to see whether investors utilized this opportunity to accumulate.\n\nAs per our analysis of CryptoQuant’s data, ETH’s net deposit on exchanges was low compared to the last seven days’ average, reflecting high buying pressure. However, the other datasets suggested otherwise.\n\nFor example, ETH’s Coinbase Premium was red. This clearly meant that selling sentiment was dominant among U.S. investors.\n\nOdds of a bull rally\n\nAMBCrypto then took a closer look at Ethereum’s current state to better understand whether a price increase is possible in the near term.\n\nAMBCrypto’s look at Glassnode’s data revealed that ETH’s price was near its market bottom, as per the Pi cycler top indicator.\n\nThis meant that the chances of ETH gaining bullish momentum in the coming days are high. If that happens, then ETH might soon touch $4.8k, which is optimistic to look at.\n\nWe then took a look at the token’s 12-hour chart to see what market indicators suggested regarding a price uptick in the short term.\n\nAs per our analysis, the MACD looked in the sellers’ favor as it displayed a bearish crossover.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIts Relative Strength Index (RSI) also remained bearish as it was under its neutral mark. These indicators hinted at a continued price decline.\n\nNonetheless, the Chaikin Money Flow (CMF) turned bullish by moving northwards towards the neutral mark in the last few days."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPa0U5VzVrMkZScDZBQnV0a2w0amhySXplUE1oVG5OUmxacmhhX0hpZWNYVDZtckNRelRrdlZIbEhGQTd0ZlM3TENacWZnYklzZUtRQnVTbWlIMnQ5SWQ5XzJkbXh0SXRJZVpFWklwYURGcmJmZDJ1a0RPQ0pXaEZoanRxUUtpQkk2UHhyQl85VVFVUm9iazZDTFhsaGNBZ9IBqwFBVV95cUxPelRCU05XR2U3YjZUWVQycEd0TnowbkNNWmRLR1dORksxeDkwLWpGSkJOZU9rZTlKSzBYRVZvSF9TMFFRV3M3Vnp1QnNGWTNKUTZvaTFOWXhtZGZOeTNEdFliUEJ4ZU9WblhRZ2dRRjZrM1VNSUR6Vm50VXVWLU84SVVvVFVCSHMwcVZUNEtFWDBWVlluaGsyWUhOSzl1VGxMSi1SNldDVWZxQ28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Anticipated Launch Date Raises Excitement - Analytics Insight",
        "content": "As the launch date for Ethereum ETFs approaches, excitement in the cryptocurrency space arises.\n\nThe introduction of an Ethereum ETF allows investors to invest indirectly in a security without having to own it outright. For Ethereum, which ranks as the second-biggest cryptocurrency in terms of market value, an ETF could make it easier and more regulated for both individual and institutional investors to invest in it.\n\nSpot Ether ETFs received a green light for 19b-4 filings, which permitted these funds to be made available on their designated exchanges. Before commencing the trading, the applicants must initially secure the necessary approval for their S-1 registration documents."
    }
]