[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5DWVVaUmVXc1JIa0pmYWl4R096ek9wSVMyYzBacFlQSlVINWZmMGs5QkgxaTJVUWZ6Rzh3Zk5yUkdORUl0YklxWEctU2ZJcWN5eXI0VnM0T3FrUkctbC1US2tmU2Ffa0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "What Does Proof-of-Stake (PoS) Mean in Crypto? - Investopedia",
        "content": "What Is Proof-of-Stake (PoS)?\n\nProof-of-stake is a blockchain consensus mechanism for processing transactions and creating new blocks. A consensus mechanism is a method for validating entries into a distributed database and keeping the database secure. In the case of cryptocurrency, the database is called a blockchain—so the consensus mechanism secures the blockchain.\n\nLearn more about proof-of-stake and how it is different from proof-of-work. Additionally, find out the issues proof-of-stake attempts to address within the cryptocurrency industry.\n\nKey Takeaways Under proof-of-stake (POS), validators are chosen based on the number of staked coins they have.\n\nProof-of-stake (POS) was created as an alternative to proof-of-work (POW), the original consensus mechanism used to validate transactions and open new blocks.\n\nWhile PoW mechanisms require miners to solve cryptographic puzzles, PoS mechanisms require validators to hold and stake tokens for the privilege of earning transaction fees.\n\nProof-of-stake (POS) is seen as less risky regarding the potential for an attack on the network, as it structures compensation in a way that makes an attack less advantageous.\n\nThe next block writer on the blockchain is selected at random, with higher odds being assigned to nodes with larger stake positions.\n\nInvestopedia / Crea Taylor\n\nUnderstanding Proof-of-Stake (PoS)\n\nProof-of-stake reduces the computational work needed to verify blocks and transactions. Under proof-of-work, hefty computing requirements kept the blockchain secure. Proof-of-stake changes the way blocks are verified using the machines of coin owners, so there doesn't need to be as much computational work done. The owners offer their coins as collateral—called staking—for the chance to validate blocks and earn rewards.\n\nValidators are selected randomly to confirm transactions and validate block information. This system randomizes who gets to collect fees rather than using a competitive rewards-based mechanism like proof-of-work.\n\nTo become a validator, a coin owner must \"stake\" a specific amount of coins. For instance, Ethereum requires 32 ETH to be staked before a user can operate a node. Blocks are validated by multiple validators, and when a specific number of validators verify that the block is accurate, it is finalized and closed.\n\nTo activate your own validator, you'll need to stake 32 ETH; however, you don't need to stake that much ETH to participate in validation. You can join validation pools using \"liquid staking\" which uses an ERC-20 token that represents your ETH.\n\nDifferent proof-of-stake mechanisms may use various methods to reach a consensus. For example, when Ethereum introduces sharding, a validator will verify the transactions and add them to a shard block, which requires no more than 128 validators to form a voting \"committee.\" Once shards are validated and a block created, two-thirds of the validators must agree that the transaction is valid, then the block is closed.\n\nHow Is Proof-of-Stake Different From Proof-of-Work?\n\nBoth consensus mechanisms help blockchains synchronize data, validate information, and process transactions. Each method has proven successful at maintaining a blockchain, although each has pros and cons. However, the two algorithms have very different approaches.\n\nUnder PoS, block creators are called validators. A validator checks transactions, verifies activity, votes on outcomes, and maintains records. Under PoW, block creators are called miners. Miners work to solve a hashing problem to verify transactions. In return for solving it, they are rewarded with a coin.\n\nTo \"buy into\" the position of becoming a block creator, you need to own enough coins or tokens to become a validator on a PoS blockchain. For PoW, miners must invest in processing equipment and incur hefty energy charges to power the machines attempting to solve the computations.\n\nThe equipment and energy costs under PoW mechanisms are expensive, limiting access to mining and strengthening the security of the blockchain. PoS blockchains reduce the amount of processing power needed to validate block information and transactions. The mechanism also lowers network congestion and removes the rewards-based incentive PoW blockchains have."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOcDR4RHVwYmIwUlk0RTlRbF9LYU42bGN1Y2N6S0c1S2p2LUVHOUxvSjIwV3NhTDRoYWdRSHM2azVnWVBPTlhORDlxOXFrVElhMXhPOWdnN2dFejluX09IdWRDUTVNSHNvaEFmdVQ1cTdWbnZXb1dvQ0twOVZBUEM2NlhGaGpFSGFvcUJzakpCc29XM1llUWxJekRlNjZINGRoMEx3YUxvNFlzbVZpWVVSSmFqWk5DTkZNWXNIMkQ2TjcwV0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Staking Surges $1.8 Billion as DeFi Investors Anticipate ETF Inflows - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE93R1M1cjd0TVkxUjFjZnl1aWFyeEZxQWw2U2oxb1AzNnVzbUk4TUpwMVJjY3ItWFVLLURtWjdQU0JwRnlFcjJZWXhwOHpCczA2aGdrc3JlLXV5TF9yUE5LOFdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "SEC's Gensler sees Ethereum ETF S1 approval this summer, trading to follow - Crypto Briefing",
        "content": "While the 19b-4 forms have been approved, the S1 forms must also be approved before trading can begin.\n\nShare this article\n\nSEC Chairman Gary Gensler has indicated that the approval of the S1 for an Ethereum ETF could be expected in the coming summer, today during his testimony at a Senate Appropriations Committee hearing.\n\n“Individual issuers still are working through the registration process. That’s working smoothly. And I would envision sometime over the course of this summer,” said Gensler.\n\nGENSLER SEES ETH ETF S1 APPROVAL SOMETIME IN SUMMER Source: DB | Coins: ETH — db (@tier10k) June 13, 2024\n\nThe SEC has approved 19b-4 forms for multiple Ethereum ETF issuers, including VanEck and BlackRock, signaling a change in regulatory stance. However, the SEC must approve the S1 forms before the ETFs can officially debut and begin trading.\n\nBloomberg ETF analyst Eric Balchunas has suggested that the approval process could be expedited due to the swift approval of Bitcoin ETFs earlier this year. He has also proposed a potential timeline of July 4, 2024, for the S1 approvals."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOazdsdk5rNWhGcy1mcHkta3M4ZlhsajFrV0NibURIeFRxZWZRYWx0VEpmYmVRYllzN1B1dEVYaDZMcmtJMVJncVM0VmJDMHJ0Z00wZFdMUVRmMjVPY1ZyR0tFUzU4NWVzODFCb0xpWFQzdTV6QUg3YXI1Skhzcnl6NzBPY3E4SlR6cVF6UzY2SFNjdmk3RDZneHVrSFJ0M3lVUG1kWWg0NDVLdi1t?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Spot Ether ETFs Could Eclipse Bitcoin ETFs' Impact | Cryptocurrency - U.S News & World Report Money",
        "content": "If the Securities and Exchange Commission's approval of spot Bitcoin exchange-traded funds represented a watershed moment for cryptocurrency, the arrival of spot Ether ETFs on Wall Street could be nothing short of revolutionary.\n\nIn a move that caught even the most bullish crypto cheerleaders off guard, U.S. regulators have cleared the way for ETFs for the world's most popular altcoin, Ether (ETH), the native crypto of the Ethereum decentralized blockchain platform.\n\nSEC Chairman Gary Gensler told CNBC on June 5 that spot Ether ETF approvals will take some time, a nuance misunderstood by many investors who believed they would be able to buy and sell spot Ether ETFs in a matter of weeks.\n\nDespite a long-standing belief that the SEC holds a more skeptical stance over crypto, on May 23 the regulator approved 19b-4 filings for eight spot Ether ETFs, including Grayscale Ethereum Trust and Bitwise Ethereum ETF on NYSE Arca; iShares Ethereum Trust on Nasdaq; and VanEck Ethereum Trust, 21Shares Core Ethereum ETF, Invesco Galaxy Ethereum ETF, Fidelity Ethereum Fund and Franklin Ethereum ETF on CBOE BZX. In early June, NYSE Arca also proposed a rule change to allow the listing of ProShares Ethereum ETF. None of these ETFs are available to trade yet, as the SEC still must give the nod to the funds' S-1 registration filings.\n\nSponsored Crypto Exchanges 1 Gemini Account Minimum $0 Fee 0.2% Maker Fee / 0.4% Taker Fee Gemini is well-suited for crypto traders of any skill level and available in all 50 states. Sign up and trade to get $10 in bitcoin. Open An Account 2 Kraken Account Minimum $10 Fee 0% to 0.4% Easy, Fast, Secure Crypto Trading of 200+ Cryptocurrencies. Made for Beginners and Experts Alike. Open An Account View Disclosure 3 Coinbase Account Minimum $0 Fee 0% - 3.99% Get up to $200 in crypto. Open An Account View Disclosure\n\nAlthough spot Ether ETFs are unlikely to emulate spot Bitcoin (BTC) ETFs in terms of inflows upon launch, the weight of the SEC's decision to approve one of the most functional projects in the crypto ecosystem is apparent. Though there are ETFs that offer managed exposure to Ether futures contracts, direct exposure to Ether will be new.\n\nWhile Bitcoin's status as the world's first and oldest cryptocurrency has helped to cement its popularity, more than 10,000 projects have been developed on Ethereum's blockchain, and the approval of Ether ETFs can help to generate far more mainstream acceptance of the cryptocurrency and the many crypto-centric innovations it's helped to grow.\n\nWith this in mind, let's take a deeper look at the contrasts between spot Bitcoin ETFs and spot Ether ETFs and why they shouldn't be seen as two sides of the same coin.\n\nSpot Ether ETF vs. Spot Bitcoin ETF\n\nThere are several important differences between spot Bitcoin ETFs and the spot Ether ETFs investors expect to be formally greenlit in the coming months.\n\nFirst, in terms of assets under management, Bitcoin ETFs are set to far outweigh those of Ether ETFs. As of June 12, the AUM for spot Bitcoin ETFs totaled $59.4 billion, representing an increase of more than double that of Grayscale Bitcoin Trust's $28.7 billion in AUM at the beginning of trading in January.\n\nBy contrast, Grayscale Ethereum Trust's AUM at the end of May were $11 billion. It's also unlikely that spot Ether ETFs will be inundated with the same opening-day inflow of $655.2 million that Bitcoin ETFs experienced.\n\nThis is because Ethereum is a more complex entity than Bitcoin, and is more difficult to value for investors. While Bitcoin's older blockchain framework isn't optimized for functionality in the same way as its younger counterparts, Ethereum is an example of how cryptocurrency can represent far more than a simple store of value.\n\nFor starters, Ether offers annual yield through staking, although this feature won't be available for ETF holders. Furthermore, Ethereum's blockchain has become a highly functional ecosystem for hosting decentralized finance, or DeFi, projects that can focus on peer-to-peer lending and offer advanced blockchain-based open finance services.\n\nEthereum's blockchain has also become a popular framework for the burgeoning non-fungible token landscape, and many NFTs today are bought and sold using Ether.\n\nBoth cryptocurrencies are fundamentally different on a technical level, too. Bitcoin operates on a proof-of-work (PoW) mining mechanism and a capped total supply of 21 million coins to impose a significant level of scarcity that has drawn comparisons to digital gold. Ether has no such circulation cap, and its proof-of-stake (PoS) mechanism for minting new coins requires far less computational power and can mint far more Ether.\n\nAs a result, Ether's market capitalization of $419 billion is far lower than Bitcoin's $1.3 trillion (as of June 13), but the more technical capabilities of Ethereum's blockchain have the potential to draw investor interest as it hosts more innovative DeFi projects that could drive digital transformation throughout the financial sector and beyond.\n\nThe New Spot Ether ETFs Explained\n\nAn SEC memorandum laid out the authorization for NYSE Arca, Nasdaq and CBOE BZX to list spot Ether ETFs. The new arrivals include:\n\nGrayscale Ethereum Trust\n\nGrayscale Investments filed to convert its Grayscale Ethereum Trust (ticker: ETH), one of the first securities solely focused on Ether, to a spot-price ETF. Despite Grayscale withdrawing its application for the Grayscale Ethereum Futures Trust ETF on May 3, the SEC's approval for NYSE Arca to list the Ethereum Trust signifies the institution's foray deeper into the world of crypto, following its Bitcoin Trust ETF, which was until recently Wall Street's largest crypto ETF with $19.1 billion in assets under management. The largest is now iShares Bitcoin Trust (IBIT), with $20.6 billion in AUM as of June 12.\n\nBitwise Ethereum ETF\n\nBitwise Asset Management is a crypto-focused pioneer that already made waves with the launch of its Bitcoin ETF. The institution has built a reputation for supporting next-generation technology, and its launch of a Web3 ETF in late 2022 underlines its commitment to exciting new innovations.\n\nEthereum already has some exposure throughout Bitwise's suite of services, like the firm's 10 Crypto Index Fund (BITW), which has offered investors returns of more than 50% for the first half of 2024 alone. Its Ethereum ETF is set to be listed on NYSE Arca.\n\niShares Ethereum Trust\n\nAfter becoming the world's largest cryptocurrency ETF provider with its iShares Bitcoin Trust ETF (IBIT) in recent weeks, forward-thinking BlackRock Inc. (BLK) is expected to become a market leader when its spot Ethereum ETF launches on the Nasdaq.\n\nThe firm already made amendments to its iShares Ethereum Trust on May 29 ahead of its pending launch, and the spot ETF is likely to be hard to beat for investors.\n\nVanEck Ethereum Trust\n\nThe VanEck Ethereum Trust ETF has been a leader in this field since news of VanEck's intentions broke in September 2023. VanEck has built a reputation for offering access to untapped markets, and its decision to focus on Ether ETFs is a major step toward more Wall Street acceptance of cryptocurrency.\n\nInvesco Galaxy Ethereum ETF\n\nFollowing the Invesco Galaxy Bitcoin ETF (BTCO), the Ethereum iteration will champion the same partnership between global ETF provider Invesco Ltd. (IVZ) and Web3 leader Galaxy Asset Management. The team will use its experience with direct exposure to digital assets to inform the fund's strategy.\n\n21Shares Core Ethereum ETF\n\nThis ETF's initial application was initially sought by two companies, 21Shares and Ark. However, the two companies have decided to end their partnership, and 21Shares has filed an updated application, rebranding from Ark 21Shares Ethereum ETF to 21Shares Core Ethereum ETF.\n\nFidelity Ethereum Fund\n\nApproved to list on CBOE BZX, the Fidelity Ethereum Fund seeks to build on the success of Fidelity Wise Origin Bitcoin Fund (FBTC), a spot BTC ETF with $11.9 billion in AUM.\n\nFranklin Ethereum ETF\n\nAnother CBOE BZX listing is the Franklin Ethereum ETF. As one of the first ETFs to announce its associated fees, Franklin has set a competitive annualized rate of 0.19% of net asset value. Because of its relatively low cost, many analysts have suggested that the firm has sought to spark a fee war by playing its cards early.\n\nLeveraged, Inverse ProShares Ether ETFs Hit the Market\n\nOn June 7, ProShares launched two funds – a 2x leveraged and 2x inverse ETF – tied to the Bloomberg Ethereum Index and listed on NYSE Arca. The leveraged ETF, ProShares Ultra Ether ETF (ETHT), targets a double return of whatever the index does during the day, whereas the inverse ETF, ProShares UltraShort Ether ETF (ETHD), provides the opposite of that. ProShares also makes leveraged and inverse exposure to Ether futures available through two other ETFs, and it offers ETF exposure to a combination of Bitcoin and Ether futures as well, according to VettaFi.\n\nHow Will Spot Ether ETFs Impact Crypto Prices?\n\nBecause Ethereum's blockchain hosts more than 10,000 crypto projects, the SEC's approval of a spot Ether ETF will have a major impact on the many altcoins that make up the cryptocurrency ecosystem.\n\nWith Bitcoin's crypto market share at about 54%, the arrival of a spot Bitcoin ETF carried a significant impact on the ecosystem at scale. The arrival of the spot Ether ETF, however, is likely to have a more profound effect on the remaining 46% of assets that make up the rest of the market.\n\nAcceptance helps deliver more regulatory clarity to the Ethereum blockchain, which in turn drives competition and encourages innovation. This paves the way for more small-cap projects to emerge and generates market momentum, making altcoins more visible to Wall Street and the financial sector, and ultimately supporting higher crypto prices.\n\n\n\nCould Spot Ether ETFs Offer a Boost to Spot Bitcoin ETFs?\n\nThe arrival of spot Ether ETFs is unlikely to have a direct impact on the price of Bitcoin. BTC itself is expected to drive the crypto market higher as a result of its anticipated post-halving event rally, which tends to deliver a bull market every four years.\n\nThat's not to say that Ether ETFs won't help Bitcoin ETFs grow, as crypto ETFs are adopted into the mainstream. Approval of the more technical Ethereum could also help institutions and individual investors understand cryptocurrencies better.\n\nWhy Was Staking Left Out of Updated Filings?\n\nOne major omission from spot Ether ETF filings was the cryptocurrency's staking framework. This comes after plenty of uncertainty over whether Ether is a security or commodity.\n\nEthereum staking works when investors can earn interest by locking up Ether on its blockchain for a predetermined period. This, according to the SEC, would classify staking-as-a-service as the offering of an unregistered security and has previously led to the commission taking out lawsuits against exchanges like Coinbase Global Inc. (COIN) and Kraken for allowing its users to stake their own coins.\n\nGrayscale and other ETF applicants were hopeful that they could add staking features to their ETFs, but they ultimately removed this aspect of their proposals when it became a sticking point for the SEC.\n\nThis core feature of Ethereum has been a popular way for users to build a passive income, however, and investors could be less enthusiastic about embracing spot Ether ETFs without staking.\n\nBuilding on a Landmark Year for Crypto\n\nBecause of Ethereum's greater functionality and more intrinsic link to cryptocurrencies as a whole, the final approval of spot Ether ETFs by the SEC, expected this summer, has the potential to eclipse that of January's spot Bitcoin ETF approval in terms of wider crypto acceptance on Wall Street."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1lUndHN3dfWTJlcmtQTXFNaXNLN3AyZ3FnV1JFNnBNOFZoWEM4QlBhXzRBV1JVc0t6b3FjczF3TzZtWFFjYmcyUHpMNFpOdGd1b1Z4amdYV29vOGtuQ3c4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "The Ethereum ETF is Coming - Bitcoin Market Journal",
        "content": "In my ten years of investing in crypto, we have one of the most interesting opportunities I’ve seen: this is a unique moment in history for buying and holding Ethereum (ETH).\n\nThe reason is that Ethereum ETFs have been approved, but are not yet available to the public.\n\nThis week, SEC Chair Gary Gensler acknowledged in a formal Senate hearing that Ethereum ETFs have been approved, and are just waiting for the final paperwork, meaning they should be available sometime this summer.\n\nThis is like a hotly-anticipated IPO, where excitement is building because everybody knows it’s coming. But here’s the difference: any of us can easily buy and sell Ethereum, right now, before ETH ETFs are open to the masses.\n\nThis is 100% legal and ethical: it’s another one of those unusual investment opportunities that you’ll only find in crypto.\n\nToday I’ll unpack this opportunity and show you how to take advantage of it (TLDR: the strategy is to buy and hold ETH now).\n\nThe Recent History of Bitcoin ETFs\n\n“History doesn’t repeat itself, but it often rhymes.” – Mark Twain\n\nIf you had invested in bitcoin at the beginning of this year – in January! – you would have already increased your investment by 50%. Your wealth would have grown fifty percent, in five months.\n\nThese eye-popping returns have been driven by the insatiable demand for spot bitcoin ETFs, which were approved in January 2024 and have since attracted over $15 billion in investor dollars.\n\nTo give some context, that’s bigger than Rivian’s IPO ($12 billion), Uber’s IPO ($8 billion), and Reddit’s IPO ($750 million).\n\nThe bitcoin ETF, as I explained in The Parable of the Bitcorn, gives ordinary investors access to buy BTC. Instead of using confusing software wallets or meeting strangers in a coffee shop, you can now just buy the ETF in your ETRADE or Robinhood account – and the ETF holds the bitcoin for you.\n\nAfter the bitcoin ETF approval, all that pent-up demand for bitcoin caused the price to surge this year. I repeat: fifty percent growth in five months.\n\nOf course, we don’t know if Ethereum will see the same price pop after the Ethereum ETFs go live.\n\nBut we do know that the bitcoin ETF opened the asset to millions of new investors. The Ethereum ETF will do the same.\n\nThe History of Gold ETFs\n\n“History doesn’t repeat itself, but it often rhymes.” – Mark Twain\n\nPrior to 2004, investing in gold was a hassle. You had to buy gold bars or coins. You had to store them safely. You had to buy insurance. For many investors that wanted to buy gold, all the friction and worry was not worth it.\n\nThe first gold ETF was launched in November 2004, allowing U.S. investors to “own” gold without having to physically hold it. Like the bitcoin ETF, this allowed millions of investors to buy gold as easily as buying a stock – and the ETF bought the gold for you.\n\nThis caused a surge of demand for gold: within the first three days of trading, the ETF saw an inflow of $1 billion, and a few months later the price of gold had soared 20%. Twenty percent gain on a precious metal that had been around since – well, since the Earth was formed.\n\nSavvy investors bought up physical gold before the ETF, which of course was perfectly legal. Then they waited for the masses to pour in, driving the price up.\n\nThe power of these ETFs is they make difficult investments easy. It was a hassle to hoard gold coins, unless you were a troll. It was a hassle to buy bitcoin, unless you were a nerd. And today it is a hassle to buy Ethereum, unless you are Vitalik Buterin.\n\nAll that is about to change: the SEC has approved the Ethereum ETF. We’re just waiting on the final paperwork. Which presents a magnificent buying opportunity.\n\nWhy We Love Ethereum\n\nWe have written extensively about what makes Ethereum a great investment, so here’s the quick summary for those who are new to crypto:\n\nEthereum is the second-largest crypto behind bitcoin . This gives it tremendous market power, resiliency, and trust.\n\n. This gives it tremendous market power, resiliency, and trust. Ethereum is the #1 smart contract platform in the world . I think of it like an operating system that runs crypto apps: like the Windows or MacOS of crypto.\n\n. I think of it like an operating system that runs crypto apps: like the Windows or MacOS of crypto. Ethereum has a huge community . More investors -> more developers -> more apps -> more users, and the flywheel keeps turning. This will likely accelerate post-ETF.\n\n. More investors -> more developers -> more apps -> more users, and the flywheel keeps turning. This will likely accelerate post-ETF. Ethereum has a huge competitive moat . Because of its leading position, it is unlikely to be toppled from its top spot anytime soon (though many L1 crypto competitors are trying).\n\n. Because of its leading position, it is unlikely to be toppled from its top spot anytime soon (though many L1 crypto competitors are trying). Ethereum has a track record of innovation . Ethereum keeps pulling off major upgrades (the massive move to Proof of Stake in 2022 was a huge technological feat, as but one example).\n\n. Ethereum keeps pulling off major upgrades (the massive move to Proof of Stake in 2022 was a huge technological feat, as but one example). Ethereum is energy efficient . Since its move to PoS, its energy use dropped by an astonishing 99%. Today Ethereum consumes less than 0.01% of the energy of bitcoin.\n\n. Since its move to PoS, its energy use dropped by an astonishing 99%. Today Ethereum consumes less than 0.01% of the energy of bitcoin. Ethereum is fully decentralized . Unlike most other crypto investments, no one person controls the network. That is a massive advantage in determining its future legality.\n\n. Unlike most other crypto investments, no one person controls the network. That is a massive advantage in determining its future legality. Ethereum has an unofficial leader . At the same time, co-founder Vitalik Buterin is one of the most thoughtful and hard-working leaders in crypto, providing wise guidance and inspiration.\n\n. At the same time, co-founder Vitalik Buterin is one of the most thoughtful and hard-working leaders in crypto, providing wise guidance and inspiration. Ethereum has a vision and a plan . Unlike bitcoin, Ethereum knows what it wants to be when it grows up. (See the roadmap here.)\n\n. Unlike bitcoin, Ethereum knows what it wants to be when it grows up. (See the roadmap here.) Ethereum has been approved by regulators. The SEC has approved an ETF, a huge stamp of approval that should put all worries to bed: ETH is now really and truly 100% legal.\n\nWhen you’ve got a hot tech stock that’s about to IPO, ordinary investors like us can almost never buy the stock before the public offering. That’s reserved for the company founders and big VC funds.\n\nI’d argue that we are in a unique situation, where ordinary investors can buy into Ethereum, before it becomes “available” to the general public. It’s a situation very much like the bitcoin and gold ETFs.\n\nWe don’t know if history will repeat itself. But, as you may have heard, history often rhymes.\n\nTiming the Investment\n\nLongtime readers know that we’re not big on timing investments.\n\nOur approach remains the same: buy and hold quality crypto assets, making monthly investments regardless of price, and hold for five or more years. (Read more on our approach here.)\n\nBut let’s just say if you’re going to set up such an investment plan, now might be a really good time to do it.\n\nAnd you really, really might want to include Ethereum. Because the Ethereum ETF is coming, and ETH is coming to the masses.\n\nYou can be there first.\n\nDisclaimers: I am not a financial advisor, just a 10+ year crypto investor who’s written two books and several hundred columns on crypto assets. I have been a long-term ETH investor for 8 years, so my opinion may be biased. All investing involves some risk; see our investing approach for how we manage risk through diversification. Never invest more than you’re willing to lose, and see losses as learning."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOOTZFRDc4NDJiR1g5ZDZBTTBKS3Q4cllzSGdldTIxVFhTS05GbmEzcVJxdFYxdFVBNkwxWmc2aEhDZ2stMGQ2dFRTMjhZNktid0x1U1ZTcmtqWW1fTHFmdk1xS3c5LVFrbmM2azgteUNkdTNlWHpsWWNWT0wxRkNVeEN1UTRhRk9jUEk0ZWVFbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "$MAGAA Token Launches on Ethereum - and Celebrates Trump’s Birthday with Airdrop - Yahoo Finance",
        "content": "MAGAA\n\nRecord-Breaking Success in Twitter Spaces Featuring Donald Trump Jr., Dan Bilzerian, Andrew Tate, and More\n\nWashington, DC, June 14, 2024 (GLOBE NEWSWIRE) -- MAGAA is a PolitiFi memecoin launched on the Ethereum blockchain, aimed at representing political movements and ideals in the digital age. Backed by a team of experienced marketers and political insiders, MAGAA seeks to create a cult-like following around shared belief systems and drive significant market impact through strategic influencer engagement and media partnerships.\n\nTo mark and celebrate the birthday of Donald Trump, 10 million $MAGAA tokens are being sent to his ERC-20 wallet, which is currently valued at $15.3 million USD in crypto assets. The 10 million $MAGAA token donation is valued at roughly $360,000 USD, making it the 5th most valued asset in Trump’s public portfolio.\n\nA Record-Breaking Twitter Spaces Event\n\nThe highlight of MAGAA’s launch was a groundbreaking Twitter Spaces event that drew an astounding 273,000 listeners, making it one of the largest in history. The event focused on the impact of memecoins in politics, showcasing the power of these digital assets to drive political discourse and secure financial freedom.\n\nInfluential Figures Join the Conversation\n\nProminent figures such as:\n\nparticipated, bringing a diverse array of perspectives to the discussion.\n\nOne of the most notable moments came when a speaker asked, \"What do you think of political memes coins, like MAGAA, being used as a vehicle to address conservative issues?\" Donald Trump Jr. responded, \"I like what it does (Political meme coins) to create a community, creating momentum and movement - it creates another avenue for people to be vocal.\"\n\nDan Bilzerian added, \"Memecoins are more about a movement - going against the system,\" highlighting the rebellious spirit that often fuels these digital currencies.\n\nMartin Shkreli, known for his controversial past and prison sentence, shared his thoughts on the broader implications of cryptocurrency, stating, \"Crypto is a way to escape the confiscatory government. Every lawyer said to me, 'It's not because of what you did, Martin, it's because you wouldn't kiss the ring.' People don't like Trump because he also won't kiss the ring,\" Shkreli added, \"If the government comes to you and says, 'I want all of your money,' crypto adds an escape valve.”\n\nStory continues\n\nExplosive Financial Success\n\nFollowing the Twitter Spaces event, $MAGAA's market cap skyrocketed from $4 million to an impressive $84 million. This explosive growth underscores the strong support and belief in the token's mission and potential. The influential Reddit community WallStreetBets also joined the $MAGAA movement, further amplifying the token's reach and impact.\n\nThe Power of Memecoins\n\nThe success of $MAGAA illustrates the relevance and power of memecoins and their communities to drive political discourse and achieve financial freedom. Memecoins like $MAGAA are not just cryptocurrencies; they are movements that unite people around shared ideals and create momentum for change.\n\nQuote from the Founding Team of MAGAA\n\n\"We're really excited about these partnerships and relationships with these massive influencers. We're donating a large amount of money to conservative movements, and we will be making an extremely large donation to President Trump’s Ethereum wallet to show our alignment. There are some massive announcements coming, and our community couldn't be more passionate and excited.\"\n\nFor more information, visit https://magaa.io/,\n\nFollow on Twitter at https://x.com/MAGAAtoken,\n\nand join the Telegram chatroom at https://t.me/MAGAAtoken.\n\nAbout MAGAA\n\nMAGAA is a revolutionary memecoin launched on the Ethereum blockchain, aimed at raising awareness for conservative ideals within crypto. Backed by a team of experienced marketers and founders, $MAGAA seeks to create a cult-like following around shared conservative belief systems and drive significant market impact through strategic influencer engagement and media partnerships.\n\nMedia Contact: contact (at) magaa.io\n\nDisclaimer: The information provided in this press release is for informational purposes only and does not constitute financial advice. Cryptocurrency investments are subject to market risks, and individuals should conduct their own research before making any investment decisions.\n\nCONTACT: Xenia Von Wedel President Transform Group xenia (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxORGVydlZTajJQdmZDZWQ0ZlFpcXh4OGpnUnBIOVJvNGg3bHZQLS1VcjZfd3JKbUo5dk1GWGN2MWtvYnk2R3dtMm5EMUFVcVpuRzliWnJ5MmJhZTVNb2VFU3lDaEIyaE1qbndVTUR0akx4UnNZYndSS1pzcVJfejJhSVMyUjhWbzViUlhJR0lMWWJjM1kyNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs will win SEC nod this summer, says Chair Gary Gensler - DLNews",
        "content": "SEC chair Gary Gensler said the spot Ethereum ETFs will be approved in the course of the summer.\n\nThe SEC has already greenlit a crucial batch of documents.\n\nOdds of the ETFs launching on July 4 have plummeted on Polymarket.\n\nSpot Ethereum exchange-traded funds are likely to launch this summer.\n\nThat’s what Securities and Exchange Commission chair Gary Gensler told US senators today during a hearing on the agency’s funding request for 2025.\n\n“I would envision sometime over the course of this summer,” Gensler said.\n\nThe SEC has already greenlit a batch of documents necessary for the launch of Ethereum ETFs, called 19b-4s, but still needs to get a second set of filings, called S-1s, finalised with prospective ETF issuers.\n\nIt’s only once both sets of documents are completed that the SEC can officially approve the ETFs — and subsequently launch the products.\n\n“Individual issuers still are working through the registration process,” Gensler said. “That’s working smoothly.”\n\nEther didn’t react to the news. The second largest cryptocurrency by value is down 4.4% in the last 24 hours, and trading for $3,450.\n\nMarket expectations\n\nOn betting platform Polymarket, odds that the ETFs will begin trading on July 4 have shot down 15% in the wake of Gensler’s comments.\n\nJoin the community to get our latest stories and updates\n\nBettors now believe there’s a 29% chance the products will launch on Independence Day.\n\nAnd two weeks ago Bloomberg Intelligence ETF analyst Eric Balchunas said that there was a “legit possibility” the ETFs could launch by the end of June, though he ascribed more chances to July 4.\n\nApproval process\n\nThe Ethereum ETF approval process has differed markedly from the Bitcoin ETF approval process.\n\nThe SEC started communicating early on with prospective Bitcoin ETF issuers to get both 19b-4 filings and S-1 filings finalised at the same time. The agency then officially approved the funds on January 10, and they launched the next day.\n\nIn the Ethereum ETF’s case, however, prospective issuers only got radio silence from the SEC as a crucial May 23 deadline for 19b-4s loomed closer, leading analysts to believe the ETFs would get rejected.\n\nHowever, on May 20 the SEC began frantically communicating with ETF issuers to get their 19b-4 filings in order before the deadline hit.\n\nThe SEC’s shift was likely politically motivated, Galaxy Digital CEO Mike Novogratz told CNBC at the time.\n\nBut because the agency’s change of heart was so unexpected, its division of Corporate Finance, which takes care of S-1 filings for prospective ETFs, was likely caught off guard. So the S-1 process, which took four months for the Bitcoin ETFs, may have only started three weeks ago.\n\nThe paperwork isn’t expected to take as long for Ethereum ETFs, however, since a lot of the kinks for offering spot crypto ETFs were already worked out when the SEC tackled the Bitcoin ETFs.\n\nNine different ETFs — issued by BlackRock, Fidelity Investments, Grayscale Investments, VanEck, Invesco and Galaxy Digital, ARK Invest and 21 Shares, Hashdex, Franklin Templeton, and Bitwise — will likely launch.\n\nTom Carreras and Jo Wright write about markets and regulation for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com or joanna@dlnews.com"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOWUpLNkRHMzJZckRLdGhpVHZXU3NiT1RqaDE5UlA5RnU1enVKYnJDakhwTk9UTTVVbFZGR08ycGdZejAxOW5jYzNqY0hHMU5PVXNXR3VmWkZOZTJmUkVqeHlPWHdpU0VFeGU5R3FpNDFFS1J5OXhxb1BmYkpnYkN2RWxoTXhUU050Y3FuRmUtb1lfZEc5RnZ3NEZXU29GdFpZ0gGoAUFVX3lxTE9OdXU5cl85dnRRRElSRXZqRVNvWXRQNG1OaWRRT2xSMkFOUXFWeklvdV9LbF9CYjFCSzVJaXJFMU80NWJjMURjOFYzM1l6bGZjaC0wWklpY1VhVGdwa1dsdjdmWmV4MXc0ZHo0cjE2cUdNb2pSMGJwTkVwcGFzaDRfZzBjWHZGVnp0Mm04ZVZxUWVxVnZ1dE02QWpBeExNaHVFSF9WYnZBQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs' Last-Minute Approval Reveals a Massive Shift - ThinkAdvisor",
        "content": "What You Need to Know The SEC approved the funds in late May, but investors can't buy them yet.\n\nThe industry is banking on Republicans winning the White House or gaining control of Congress.\n\nFederal regulations prohibit banks from providing custody services for crypto, but a massive lobbying effort is at hand.\n\nYay.\n\nThe Securities and Exchange Commission approved spot ethereum exchange-traded funds on May 23, so, yeah. Yay. But the way this approval happened is astonishing, portending big implications for crypto come the November elections.\n\nQuick background: Ethereum was invented in 2015 and is known as “programmable money” or “smart contracts” — meaning you can control the timing and conditions of your transmittals. You can’t do that with bitcoin, and this feature explains why ethereum is now the second-largest digital asset by market capitalization.\n\nNowadays, bitcoin is popular mostly for its function as a store of value, while ethereum is valued primarily for its commercial applications. Indeed, many of the world’s biggest brands, including Nike, Google, PayPal, UBS, BlackRock, Tiffany’s, Breitling and Burberry, are building projects on the ethereum blockchain. It is also the primary platform for stablecoins and decentralized finance, each worth more than $150 billion.\n\nThis enthusiasm underpins the excitement over the new spot ethereum ETFs. In fact, Standard Chartered predicts that up to $45 billion will flow into these ETFs within the first 12 months.\n\nBut there’s a catch: You can’t buy them yet, because the SEC has bungled the process. The agency had a statutory deadline to approve or reject the first of the ethereum applications, Van Eck’s, by May 23.\n\nEveryone monitoring the situation was pretty sure that the SEC was going to reject all the applications — with the best evidence being that there had been virtually no communication between the SEC and the eight ETF providers that had filed applications. (Typically, when an application is under consideration, there’s substantial engagement between SEC staff and the fund company.)\n\nThen, just 72 hours before the May 23 deadline, the SEC initiated intense engagement with all the ETF sponsors, not just Van Eck, including requests for urgent amendments to their applications. This sudden activity was quite a surprise and indicated that approval was imminent. Overnight, Bloomberg went from 25% likelihood of approval to 75%.\n\nIndeed, approval came on the Thursday evening before the start of the Memorial Day weekend, the lack of notice leaving the crypto and financial services communities unprepared. And, in the end, the SEC’s last-minute dash left work unfinished; Although all the 19b-4 forms were completed and approved, none of the applicants’ S-1 forms were.\n\nConsequently, the ETFs have not yet entered the marketplace. People I’ve talked to couldn’t recall the last time an ETF approved by the SEC wasn’t able to start trading immediately. The sponsors of these ETFs say it could be months before trading starts.\n\nWhy did the SEC wait so long to work on the ethereum ETFs?\n\nThe answer speaks volumes about a massive political shift on Capitol Hill — with massive implications for the future of crypto.\n\nIf Republicans win the White House or gain control of both houses of Congress, the crypto industry will enjoy explosive growth in the United States. But if President Joe Biden remains in the White House, or Democrats control Congress, the crypto industry might well abandon the United States in favor of countries that are more welcoming — including Japan, South Korea, France and the United Kingdom."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNdXZqLVliMzNTZ3VQN2NCVmpaeTRVelBVWDVqelktMUp3OW9oX0FNcThONk93N3NoajdCcTMwZF91VURieDlmMVZHdm9oWE16SnNwUTNTSkNqbHI4NWNHQXVOaDIwckFaRmJIdGRYNWNEUXZueGZFNTNQN1NTNU45NlVEU1FJLWRUOUpWVTJwQXZFZG1QdXU5RGd5NldqY2hOTTFWUmJLVzFBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Gensler confirms spot Ethereum ETFs will be approved ‘this summer’ during Senate hearing - CryptoSlate",
        "content": "SEC Chair Gary Gensler said the regulator expects to approve the spot Ethereum ETF applications’ S-1 registration forms “sometime over the course of this summer,” which would be the final step before the funds can launch in the US.\n\nGensler confirmed that the ETFs would be able to launch by the end of summer, well before the November presidential elections.\n\nThe watchdog recently approved the related 19b-4 applications filed by stock exchanges in May. However, the approval of S-1 registration forms from individual issuers is still pending.\n\nGensler said during a Senate hearing on June 13 that:\n\n“Individual issuers are still working through the registration process. That’s working smoothly.”\n\nSenator Bill Hagerty commended Gensler on committing to him that the applications would be approved by the end of summer. He added:\n\n“We’ve gotta get this market.”\n\nLaunch timeline, commodity classification\n\nGensler’s timeline aligns with predictions made by industry experts in recent weeks.\n\nBloomberg ETF analysts suggested that the S-1 documents’ approval could take “weeks” to “months” following the 19b-4 approvals. Similarly, others, including JP Morgan, have predicted that the ETFs will begin trading before the November elections.\n\nAt this point, despite the pending S-1 approval, the introduction of spot Ethereum ETFs in the US is seen as inevitable. Furthermore, Ethereum is now considered a commodity by many in the industry, including legal experts, who argue that the SEC’s approval of Ethereum as a single-asset ETF product implies its classification as a commodity.\n\nHowever, when questioned by the Senate, Gensler did not clarify whether Ethereum is classified as a security or commodity. He skirted the question and did not give a clear answer, claiming the agency had only “partially” approved Ethereum ETFs.\n\nMeanwhile, CFTC Chair Rostin Behnam told the Senate very clearly that Ethereum was a commodity and should be supervised by his agency.\n\nConcerns over budget stipulation\n\nGensler also addressed the SEC’s fiscal year 2025 budget request, highlighting the significant growth and changes in the markets. He said:\n\n“Our limited resources contrast against the tremendous growth and change in our markets.”\n\nHe added that the SEC currently oversees approximately 40,000 entities, including more than 13,000 registered funds, 15,400 investment advisers, and 3,300 broker-dealers.\n\nGensler expressed concern over a stipulation in the agency’s fiscal year 2025 funding bill by the House Appropriations Committee, which restricts funds from being used for enforcement actions related to digital asset transactions, except for fraud or market manipulation.\n\nGensler said:\n\n“It would seriously undercut our efforts. While not all cryptos are crypto securities… those that are have an obligation to disclose to the public full, fair, and complete information.”\n\nThe SEC chair highlighted the agency’s critical role in maintaining market integrity and protecting investors. He also emphasized the importance of adequate funding to keep pace with the rapidly evolving markets and technological advancements.\n\nHe told the Senate:\n\n“The SEC is the cop on the beat watching out for the investing public and issuers.”\n\nMentioned in this article"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQYVYxeG03Smh1b0R3WHpnZTc1QWlwOE8tSnNHNHVUY2VzRFNRUlBpQWNpVEwwRzFZR1ZNaUlKTW5nMFhpWklFTEZxY0tVOGlTbkRaQkMwWWRiWTJzRnU3UTVWSTU5S1phcTlleUY1dms4UzdZc0pvRllLcWNTbHd0b2dqZUM0SU9lNUJVM1BkUUkwR3hiTmdhR0xPMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin’s Little Brother: Will Ethereum ETFs Also Boost Ether’s Price? - Unchained",
        "content": "In a recent budget hearing, SEC Chair Gary Gensler told senators that the US spot ether ETF approvals should be completed by the end of the summer, so where does the market see ether’s price going before and after the launch?\n\nUS spot ether ETF registrations are currently being reviewed at \"a staff level\" and could be approved by the end of summer.\n\nWhen the U.S. Securities and Exchange Commission (SEC) approved the 19b-4 forms for eight different spot ether exchange-traded funds (ETFs), the price of ether surged nearly 20% within several hours of the news.\n\nNow ETF applicants are submitting their S-1s, a registration form which needs to be greenlit by the securities regulator before the funds can start trading on exchanges. The SEC’s Gensler alluded to this process being completed by the end of the summer when speaking to the Senate Appropriations Committee on Thursday.\n\nThe registrations are being reviewed at a “staff level,” Gensler said, and will still depend on issuers and how responsive they are to any comments they receive. With the ball in the court of ETF issuers, where does the market see the price of ether going before and after the launch?\n\nInvestment management firm VanEck, whose application for a spot ether ETF was one of the eight to receive approval on their 19b-4 form, recently raised their 2030 price target for ether to $22,000. But Katie Talati, head of research at crypto asset management firm Arca, said in an email to Unchained that as of late “ether has struggled to establish a strong narrative compared to other layer 1 solutions and the emergence of layer 2 solutions.”\n\nETH’s Potential Price in the Short-term (Pre-launch)\n\nShort-term, this lack of narrative could give ether a boost — though likely not as high as $22,000 — as traders were under positioned in the asset when the approval announcement hit.\n\nCoinbase Institutional’s trading desk, “has seen increased buying in ether following the 19b-4 approvals,” said David Duong, Coinbase’s head of institutional research, in an email, “It hasn’t been nearly as aggressive as what we saw in bitcoin before spot bitcoin ETFs launched in the US. That leads us to believe that the market is still under positioned.”\n\nFor bitcoin, it was a “buy the rumor, sell the news” event because there was so much speculation in the lead up to the January approval of the bitcoin ETFs. While in the case of ether, “traders didn’t sell the news—they bought it,” due to the surprise nature of the approvals, said Glen Goodman, author of “The Crypto Trader,” in an email to Unchained.\n\nInvestors should still tread with caution, Katie Stockton’s Fairlead Strategies’ June 10 report states that ether has already given back some of its outperformance to bitcoin since the spot ether ETF news. The analysts foresee bitcoin continuing to outperform ether in the near term, describing their analysis of ether’s weekly MACD and stochastics as neutral, adding that they “will assume a bullish bias once ether clears resistance near $3,925 on a consecutive weekly closing basis.”\n\nWhere ETH Could Go Long-term (Post-launch)\n\nAfter experiencing a pullback post-ETF approval, “bitcoin went on to rally 72% from $39,201 to $67,339, ultimately making a new all-time high price in March of 2024,” said Teddy Fusaro, president at Bitwise, a crypto investment firm that launched a spot bitcoin ETF in the US.\n\nIf this were to happen, ether would have to rally more than 35% percent from its current price to reach its November 2021 all-time-high of $4,867, Fusaro said.\n\nWhile that may be plausible, Arca’s Katie Talati is not convinced that spot ether ETFs will have as substantial of a long-term impact on ether’s price given that institutional demand is not as high for ether as it is for bitcoin.\n\nIn a previous interview with Unchained, Ophelia Snyder, co-founder and president of crypto ETP provider 21Shares, alluded to this, saying that institutional knowledge of ether pales in comparison to that of bitcoin. 21Shares manages the 21Shares Ethereum Staking ETP (AETH) in Europe as well as a spot bitcoin ETF in the US known as ARKB,\n\nTalati also noted that “the Grayscale Ethereum Trust, which has $10 billion in assets under management (AUM), will likely also experience consistent outflows and cause daily selling pressure in the Ethereum market.”\n\nA recent report from crypto research firm Kaiko shared a similar sentiment. “Once the ether ETFs launch, it is reasonable to expect selling pressure on ether from likely outflows or redemptions due to Grayscale’s ETHE, which has been trading at a discount between 6% and 26% over the past three months.”\n\nStill, crypto research firm K33’s senior analyst Vetle Lunde in a recent report anticipated that US spot ether ETFs will attract $4 billion in net inflows in their first five months after launch. In a message to Unchained, Vetle explained that he expects roughly 20% of this $4 billion to come from institutional investors, putting their anticipated AUM at $700-800 million.\n\nWhile some question whether the absence of staking in the ether ETFs will limit investor interest in the funds due to lack of APY (Annual Percentage Yield), Lunde does not see this as an issue, writing that, “99.1% of the AUM in Canadian ether ETFs are held in non-staked products, whereas 97.9% of European AUM sits in non-staked ETPs. This indicates that staking is far from a major issue among ETP investors.”\n\nIn April, the Hong Kong Securities and Futures Commission approved the trading of spot ether ETFs along with their bitcoin counterparts. Using Hong Kong’s market as a point of reference, Crypto Is Macro Now author and economist Noelle Acheson wrote in a recent newsletter that, “when/if the ether spot ETFs eventually launch, we should brace ourselves for a disappointing reception.” Acheson bases this prediction on the fact that since these securities began trading in Hong Kong, ether has accounted for less than 15% of the total spot crypto ETF AUM.\n\nPranav Kanade, VanEck’s digital assets alpha fund portfolio manager, shares this assumption that interest in the spot ether ETFs may not be as explosive as it was with bitcoin, writing to Unchained that “the narratives for bitcoin lined up perfectly, especially in the United States … the stars don’t seem to be aligning as perfectly as they did with the bitcoin ETF.”\n\nDespite this, Kanade said that their bullish 2030 price prediction for ether assumes that ETFs will be a catalyst for further interest into the Ethereum network and its varying applications, such as stablecoins and other tokenized financial assets. “This, in turn, will drive increasing levels of activity on Ethereum or its layer 2 solutions, resulting in a higher amount of ether being burned and a lower overall supply of ether,” Kanade said."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBDSUVhS29FMnhESkZvTUNzOVFIbXY5bFFweEowbWxPM2Z6TjAwYTJXcHBxYnpnanF3ZVBWVk9vaWZvRUFkRjc0bUN6TkpEQjA1TFV1ZWE3QlpRWjhqbkJFQ1BR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum spot ETFs to start trading July 2nd: Bloomberg analyst - Crypto Briefing",
        "content": "SEC's nod to Ethereum ETFs could trigger a 60% ETH price rally.\n\nShare this article\n\nThe highly anticipated launch of spot Ethereum ETFs is expected to occur on July 2nd, according to Bloomberg ETF analyst Eric Balchunas.\n\nBalchunas revealed that the SEC has sent light comments on S-1 filings to ETF issuers, requesting their response within a week. This development suggests a strong possibility that the SEC will declare the ETFs effective the following week, allowing them to begin trading before the holiday weekend.\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nThe SEC has approved 19b-4 forms for eight Ethereum ETF issuers, including BlackRock, Fidelity, VanEck and others. However, the SEC must approve the S1 forms before the ETFs can officially begin trading.\n\nSEC Chair Gary Gensler recently hinted at the potential approval of the S1 for an Ethereum ETF during the summer, as stated in his testimony at a Senate Appropriations Committee hearing earlier this week.\n\nAsset manager VanEck has projected Ethereum (ETH) to reach $22,000 by 2030, based on its anticipated generation of $66 billion in “free cashflows.”\n\nThe launch of spot Ethereum ETFs is anticipated to attract substantial institutional capital, with Standard Chartered’s Geoff Kendrick estimating inflows of $15 to $45 billion within the first year.\n\nSingapore-based crypto trading firm QCP Capital predicts that the approval of spot Ethereum ETFs could lead to a 60% rally in ETH prices, similar to the market reaction seen after spot Bitcoin ETFs were approved in January."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE4tMEJUZWRKLTNaLUxCbHVmanlpN1NFUFdkcVBRY1VjWU8tSVpTaUdLb0NiRk1QVEtPMzBZbG1ZbFVrUkN2MzBLcnFTTTJKX3hYa1BCbHIzM2N2VmxycDUxdVcteDhFQUNvNk5PQUMxclAzX1lVR2NYVlcxS2diQ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Sees Surge in Long-Term Holder Accumulation Amid Price Dip - Yahoo Finance",
        "content": "Ethereum (ETH) Sees Surge in Long-Term Holder Accumulation Amid Price Dip\n\nEthereum (ETH) has experienced a significant boost in long-term holder accumulation, taking advantage of a recent 2% price drop over the past 24 hours. This surge marks one of the largest days for accumulation in the cryptocurrency’s history.\n\nOn June 13, CryptoQuant's head of research, Julio Moreno, highlighted the dramatic increase in Ether demand. In a post on X, Moreno revealed that 298,000 Ether tokens were acquired by accumulation addresses over a 24-hour period on June 12. This accumulation is valued at approximately $1.34 billion at the time of publication.\n\nMoreno noted that this influx was only 6% shy of the record set on September 11, 2023, when long-term holders scooped up 317,000 Ether as the price fell below $1,600 This surge in demand comes amidst a broader 8.49% price decline for Ether over the past week. Initially dropping below $3,800 on June 8, Ether has struggled to rebound but has managed to stay above $3,400, according to data from CoinMarketCap. As of this writing, Ether is trading at $3,503.\n\nIn parallel with these market movements, regulatory developments may provide further context for Ether’s future. On June 13, SEC Chair Gary Gensler indicated that spot Ether exchange-traded funds (ETFs) could potentially receive final approval for trading before the end of September. This forecast was shared during a Senate Banking Committee hearing, where Gensler suggested that the regulator might sign off on the final approvals for listing and trading shares of spot Ether ETFs within three months.\n\nThis follows the SEC’s preliminary regulatory approval on May 23 for spot Ether ETFs in the U.S., approving 19b-4 filings from eight applicants. However, trading can only commence once the S-1 registration statements are also approved."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1XNnpyX1ViZFJjY0lUeFBYRDVtNk96S2FMWVZlb1FtUE1mRXpjZFRPdTl5WXB0Q0xmbndpQXFRcEEwRE4zc0d6ajNzSVVWQjdNX0l1UjNlcXVjYTdyX2hEN3lSQTNGa2RtbkRnbkRYQkhmM2JvbExiUnVR0gGCAUFVX3lxTE1LS1B6ZGVOcWN2TTFaREJULUh3LW1DV0ZORDVQZk1uNGdvbDJmbTlRNXBRZm0zaW9zT0pfOVlxY19hYWE0UkViTzk2RGlndjZoUVhNZ0JhSi1pbVM4M2sxLXJELUxQY3ZObTg3X0E1bl9aYUFZOVlWUWtZMmptcFJhQkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Likely to Launch This Summer, Says SEC's Gensler - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe S-1 registration forms for several spot Ethereum ETF applicants will likely be approved this summer, according to Securities and Exchange Commission (SEC) chairman Gary Gensler.\n\nThis comes after the agency approved 19b-4 applications from stock exchanges in late May to list such products. All that’s needed now is the regulatory nod on the applications from individual issuers, after which a spot Ethereum ETF can immediately go live in the United States.\n\n“Individual issuers are still working through the registration process. That’s working smoothly,” Gensler said during a Senate hearing on Thursday. “I would envision that some time over the course of this summer they’ll be [approved].”\n\nGensler highlighted how Ethereum futures ETFs had already gone live last summer, and that CME Ether futures had already existed for years.\n\nAD\n\nAD\n\nWhile there proved to be very little demand for those futures ETFs, many analysts—including K33 Research—expect the spot products to absorb up to $4 billion in their first five months, representing 20% to 30% of the flows to their Bitcoin-based counterparts.\n\nThe chairman’s projected timeline reflects that of ETF experts at Bloomberg, who said it would likely take “weeks” to “months” before the S-1 documents were greenlit following the 19b-4 approvals. Either way, the arrival of such funds in the U.S. was a matter of “if” not “when.”\n\nDespite his confirmation, Gensler still didn’t directly answer whether Ethereum classifies as a security or commodity when directly asked. Legal experts argue that Ethereum has implicitly been ruled a commodity already by being approved as a single-asset ETF product.\n\nThe chairman also expressed concern over a stipulation recently included in the agency’s fiscal year 2025 funding bill by the House Appropriations Committee. The stipulation requires that “none of the funds made available… may be used to carry out an enforcement action related to a digital asset transaction,” unless related to fraud or market manipulation.\n\nAD\n\nAD\n\n“It would seriously undercut our efforts,” said Gensler. “While not all cryptos are crypto securities… those that are have an obligation to disclose to the public full, fair, and complete information. We’d lose that.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNNEhjMzVJNldxX2Q5Q0xaVFdYcm00NXFmcnRlbm1VcVFRaFZFR3c5bzRIVF84czdvUGpKb2toVnkxNG1RV1dId045SHJDX2RtYTVJUi1JeHdKaklLOC1TZzR6aGI1TlotaENsX292VGtvc3Z3VDBUVkFwSllBQzVpRW5nbi0zb2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "“Crypto-Breakthrough” Bill Could See Bitcoin, Ethereum, and BlockDAG Network Prices Skyrocket “Very Soon” - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, June 14, 2024 (GLOBE NEWSWIRE) -- Bitcoin and other major cryptocurrencies, including Ethereum and XRP, have surged in 2024 after hitting their lowest points in 2022. The Bitcoin price has rebounded to its previous all-time high of around $70,000 per BTC and could potentially surge further to anywhere between $100,000 to $150,000 as traders and analysts are noticing a bullish price pattern. Meanwhile, Ethereum, BlockDAG Network, and other altcoins are preparing for a significant but positive impact from Wall Street.\n\n\n\n\n\nAmid the political landscape, where both President Joe Biden and former President Donald Trump are making moves related to cryptocurrency, a potentially transformative bill has emerged. Passed quietly by a Senate committee, this bill could become the most crucial U.S. crypto policy if it becomes law.\n\nSenate Committee Passes Crypto Provision\n\nThe U.S. Senate Select Committee on Intelligence recently passed its funding package, which includes a little-noticed crypto provision. This provision mandates crypto companies to collect more information about their users or face sanctions designed to prevent terrorism financing. According to Coindesk, this move would \"speed and automate the process to sanction 'foreign digital asset transaction facilitators,' including crypto exchanges linked to users who support terrorism groups.\"\n\nThe Intelligence Authorization Act (IAA) passed unanimously with a 17-0 vote. However, the crypto section was not highlighted when Senator Mark Warner, the Democratic chairman of the committee, announced the vote. Warner emphasized that the bill enhances the U.S. intelligence community's ability to identify and counter technological threats from adversarial nations and designates foreign ransomware organizations as hostile cyber actors.\n\nCrypto Industry Response\n\nDespite the significance of the bill, crypto industry insiders believe the provision might not survive the budget process. Cody Carbone, the chief policy officer for the Digital Chamber, told Coindesk that there would likely be pushback from the industry, potentially leading to its removal from the National Defense Authorization Act (NDAA). This potential removal could ease concerns and further boost confidence and investment in the crypto market.\n\nLast month, the U.S. House of Representatives passed the Financial Innovation and Technology for the 21st Century Act (Fit21). This act splits responsibility for cryptocurrency regulation between the Securities and Exchange Commission (SEC) and the Commodities Futures Trading Commission (CFTC) and has received broad support from crypto companies and pro-crypto lobby groups. Such regulatory clarity and support are likely to attract more institutional investment, driving up the value of cryptocurrencies.\n\nStory continues\n\n\n\n\n\n\n\n\n\nTrump’s Endorsement and Industry Growth\n\nThe Biden administration has softened its stance on Bitcoin and crypto recently, following Donald Trump’s pledge to support the crypto industry. Last week, Trump conducted a crypto-friendly fundraiser in Silicon Valley, hosted by investors David Sacks and Chamath Palihapitiya, raising around $12 million. Trump declared his intention to be the \"crypto president\" and promised that the Biden-Gensler crackdown on crypto would end swiftly if he were re-elected.\n\nTrump's endorsement of crypto and digital assets could mean a significant increase in industry value and individual projects growth as soon as 2025. His support, combined with technological advancements and favorable regulatory changes, creates a positive outlook for the market.\n\nBlockDAG Network: A Revolutionary Technology\n\nIn the evolving world of cryptocurrencies, BlockDAG Network is an emerging revolutionary technology. Unlike traditional blockchain, which relies on a linear sequence of blocks, BlockDAG (Directed Acyclic Graph) allows for multiple chains of blocks to coexist and interconnect. This structure significantly increases transaction throughput and scalability while reducing confirmation times.\n\nBlockDAG Network can handle a higher volume of transactions without compromising security or decentralization, addressing one of the most critical challenges faced by traditional blockchain networks. As cryptocurrencies gain more mainstream attention and political endorsement technologies like BlockDAG Network could play a crucial role in the industry and lead to substantial returns for both new and existing venture capitalists.\n\nThe legislative developments, coupled with favorable regulatory changes and high-profile endorsements, set the stage for a significant market rally. investors should prepare for a potential surge “very soon,” as the bill's positive impact on the crypto ecosystem could trigger a substantial increase in the value of many digital assets including Bitcoin, Ethereum, BlockDAG Network, and other major altcoins, making the industry more robust and appealing to more investors.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nCONTACT: Brown Williams support (at) blockdag.network\n\n\n\n"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPd2d4RWdwbVlNLWZYeThDMDdFN0pkX085b0gzaml4ZkU1TlZUbGZWZk1CeTJ0Y2VTSWp5b0UxTXhYMHFBTVM2Q0tpbUlzSFFEWFlrOW9mVmVsRkR4ekZJcFptN0wwWmtabHdlUC0yT2FIOEt1SllfdXVfcUtzS2RfRlo4blJOdjRBSzhz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Beginner Investors Beware! Why Bitcoin, Ethereum, and Furrever Token Are Must-Have Investments in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 14, 2024 (GLOBE NEWSWIRE) -- As the cryptocurrency market continues to evolve, new investment opportunities are emerging, making it an exciting yet challenging space for beginners. Among the many options, Bitcoin, Ethereum, and Furrever Token are standout investments for 2024.\n\nBitcoin, often referred to as digital gold, has a long-established history as the first and most prominent cryptocurrency. Since its inception in 2009 by the pseudonymous Satoshi Nakamoto, Bitcoin has maintained its market leadership. As of mid-2024, Bitcoin is on a strong upward trajectory, nearing $100,000 per BTC, with a market cap surpassing $1 trillion, solidifying its status as a stable and reliable investment. Adoption of Bitcoin has accelerated, with major financial institutions like Fidelity and BlackRock integrating it into their portfolios. Additionally, Bitcoin ETFs have gained traction, providing investors with easier access to this digital asset. With increasing regulatory clarity and acceptance, Bitcoin's role as a hedge against inflation and a store of value continues to strengthen.\n\nEthereum, not just a cryptocurrency but a decentralized platform enabling smart contracts and decentralized applications (dApps), is another key player. The transition to Ethereum 2.0, introducing a proof-of-stake (PoS) consensus mechanism, promises significant improvements in scalability, security, and energy efficiency. This upgrade is expected to attract more developers and projects, further solidifying Ethereum's position in the crypto ecosystem. Ethereum is the foundation of the booming decentralized finance (DeFi) sector and the non-fungible token (NFT) market. With most DeFi projects and NFTs built on the Ethereum blockchain, its utility and demand continue to grow. The potential approval of Ethereum ETFs by the SEC also signals a positive outlook for institutional adoption.\n\n\n\nFurrever Token (FURR) is emerging as a new player in the meme coin space, offering a unique blend of financial incentives and engaging cat-themed content. Unlike many meme coins that rely solely on hype, Furrever Token integrates tangible value through its innovative features. The token has already raised over $1.3 million in presale stages, highlighting significant investor interest.\n\nOne of the standout features of Furrever Token is its referral system, which allows investors to earn 10% in $FURR Tokens for every deposit made through their personal referral link. This incentivizes community-driven growth and promotes widespread adoption. Currently priced at $0.000732, Furrever Token offers up to 15X returns, making it an attractive option for investors looking to capitalize on early-stage opportunities.\n\n\n\n\n\nStory continues\n\nThe increasing institutional interest in cryptocurrencies like Bitcoin and Ethereum adds a layer of credibility and stability to these investments. Large-scale investments by hedge funds, publicly traded companies, and financial institutions signify confidence in the long-term viability of these digital assets.\n\nThe overall market sentiment for cryptocurrencies is positive, with Bitcoin and Ethereum showing strong performance indicators. Bitcoin’s recent rally towards $100,000 and Ethereum's advancements with Ethereum 2.0 create a favorable environment for both seasoned and beginner investors.\n\nInvesting in Bitcoin, Ethereum, and Furrever Token offers a balanced approach to portfolio diversification. Bitcoin provides stability and long-term value, Ethereum offers exposure to the rapidly growing DeFi and NFT sectors, and Furrever Token presents high-growth potential in the meme coin market. This diversified strategy helps mitigate risks while maximizing potential returns.\n\nFor beginner investors, the availability of educational resources and community support is crucial. Bitcoin and Ethereum have extensive online communities, forums, and educational content to help new investors understand the market. Furrever Token, with its community-centric approach, also offers robust support, making it easier for beginners to navigate the investment landscape.\n\nConclusion\n\nAs the cryptocurrency market continues to mature, Bitcoin, Ethereum, and Furrever Token present compelling investment opportunities for 2024. Bitcoin's market dominance and institutional adoption, Ethereum's technological advancements and market utility, and Furrever Token's unique value proposition and high potential returns make them must-have investments. By understanding these assets' strengths and staying informed about market trends, beginner investors can confidently enter the crypto space and capitalize on its growth potential.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxObVRDSEEwN3VVZG5rSjBxWHk2MFR2NlpxZkozU05FYVByUmpfRnR6T0Exa0pZdldIei1VXzY0MmJrcmZVa3BDWVpmSlJJdURDLUVpMHpQcE90eGVIcWVEaU54N1ZwTnU5ZUpsWWJ2S0FvQ3gxTEsyNGJTa0w4bW5WWUN6WjBOUdIBjgFBVV95cUxOOXlRLXBnX0VmQ1V1aVl2bmttU1VTeEFVYTJMVFZ6a01raElBWTB4TDIwZ1FZNUZ4aW9scjlTaFdpYlJEMVhBdjdfb2x2dEZHRGxXeGdyMzJFcEpqUkdDY2wzbG0zbXNYSnNfT1BrVU5aOV9qNHFvcno3ZFF1NlZ6TlVmTGprZEhVWF83eHJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Are Cooling Off—But Gaming Token Prices Are Down Bad - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the price of leading cryptocurrency Bitcoin cools off, gaming tokens are among the worst-hit tokens over the last week, with one major game’s token dropping 40% during the span.\n\nAfter a broadly strong first half of the year for crypto, Bitcoin has dipped by nearly 6% over the past week to $66,830, while Ethereum has fallen a larger 10% to $3,460 as investors wait for spot Ethereum ETFs to start trading in the U.S.\n\nBut while the crypto market bleeds, the gaming segment has suffered some of the worst casualties. Gaming tokens tend to be highly volatile, like meme coins, due in part to the crypto gaming market still being relatively nascent. And this week, top tokens tied to gaming projects are taking some of the biggest hits of all.\n\nWorst affected among major gaming tokens is Guild of Guardians (GOG), tumbling 40% to $0.105, with Parallel’s PRIME token falling closely behind with a 36% drop to just under $11.\n\nAD\n\nAD\n\nGuild of Guardians launched on Ethereum scaling network Immutable zkEVM in May, earning a positive review from Decrypt’s GG after signing up over 1 million prospective players ahead of the wider release. But as the game plans to roll out a new Guardian, it couldn’t withhold market pressure with its token dropping.\n\nPRIME’s dip comes amid Parallel’s launch onto the Epic Games Store, a move that puts the NFT card-battling game in front of a monthly audience of 75 million active users. Once again, despite this apparently positive move for the game, it was still one of the worst-hit gaming tokens this week.\n\nOther top losers include the layer-3 Ethereum gaming network Xai (XAI), which is down 30% to about $0.63 amid the launch of its Vanguard: Genesis campaign. This initiative will see several new games rolled out on the network in the coming months, on top of fresh rewards up for grabs for players and builders alike.\n\nAfter a successful airdrop campaign earlier this year, Portal (PORTAL) has fallen 30% this week, while Clash of Clans-style mobile game Heroes of Mavia (MAVIA) fell 29%. Prominent Telegram-based clicker game Notcoin (NOT) has tumbled 19% not long after hitting 40 million players.\n\nAD\n\nAD\n\nMost of the gaming tokens in the top 100 overall cryptocurrencies by market cap have seen similarly large drops, including Gala Games (GALA) at a 25% drop, Beam (BEAM) down 20%, and Immutable (IMX) falling nearly 19% over the past seven days.\n\nIn fact, the gaming market has been hit so badly that only six out of the top 100 GameFi tokens, as categorized by CoinGecko, are in the green over the past week. Most notably, real-time strategy game Apeiron (APRS) is up 5% while its esports championship rages on.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQMktrbmthSGZrNEZuMXNFT01jT19IZXpNaVBuc3dJUDdBQ3V0NnI2dE02bDB5TklBWGN5ZVo0N0hMYnJyMnFWZVhlUmN2bDMtQ05fbmZCMHdkMzJPVXlxVTZ1WUVlcDFBWUNMWVZkLXIydFNHdXFTN1p1WFQ3VHZaZ1RDQUZsQ3U0cjE3aXkwM3BwYkZTZENlOU81bmhKMWYybVBsRXRUMThsZ29DUEc0OUZVaFpzcVJRU3RJbTdMVlg2bHNFeXJIVE9GbWtkTV9E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Gary Gensler: Ethereum Spot ETFs Could Start Trading By The End Of Summer - Benzinga",
        "content": "U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler has indicated that the approval process for the highly anticipated Ethereum ETH/USD spot ETF may be completed by the end of this summer.\n\nWhat Happened: “Individual issuers are still working through the registration process that’s working smoothly, and I envision sometime over the course of the summer…” Gensler told Senator Bill Hagerty.\n\nThe summer period in the United States typically spans from June to August, suggesting that the approval could come as soon as late August.\n\nAlso Read: MicroStrategy To Raise $500M To Boost Bitcoin Holdings\n\nThe potential approval of spot Ethereum ETFs represents a crucial milestone for the cryptocurrency market, offering investors a new avenue to gain exposure to Ethereum without directly holding the asset. It expected to attract significant institutional investment and potentially increase market stability, following in the footsteps of Bitcoin spot ETFs, which have already made substantial impacts on the market.\n\nIndustry analysts believe that the introduction of an Ethereum spot ETF could further legitimize digital assets in the eyes of mainstream investors and regulatory bodies.\n\nWhat’s Next: The upcoming Benzinga Future of Digital Assets event on Nov. 19 will provide an ideal platform for industry leaders and experts to discuss the implications of such regulatory advancements.\n\nAttendees will explore how the approval of the ETH spot ETF could shape the future of digital finance and investment strategies.\n\nRead Next: Elon Musk’s Decision To Hide Likes On X: ‘Catastrophic For Crypto,’ Says Solana VC\n\nImage: Shutterstock"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOdE9hU19HNWgxTnRrSWd4bU1Tc1ZPRktnZlY4c3VlX1RMWWc2Q0NMVVhkRm5hcklaeF9rYVRJSjVrMkFyOG9HREJabkNFWGxBcE00Y2VmbEx6eS1RWkQ3SmYzN3pRVTBfdzFTcGtqanUyYmczSzJSd3pIUU5RYmg0eURxNERaZFFUeUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Guide: Bitcoin and Ethereum Lead the Market - Can Furrever Token Join the Ranks with its Referral Bonus? - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 13, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market continues to evolve, with Bitcoin and Ethereum maintaining their positions as the leading digital assets. These two giants have set the benchmark for innovation, adoption, and market performance. However, a new contender, Furrever Token, is making waves with its unique appeal and innovative referral bonus system. This guide explores how Furrever Token could potentially join the ranks of Bitcoin and Ethereum and what makes it a compelling investment opportunity.\n\nBitcoin: The Pioneer of Cryptocurrencies\n\nBitcoin (BTC) remains the most well-known and valuable cryptocurrency. Launched in 2009 by an anonymous figure known as Satoshi Nakamoto, Bitcoin introduced the world to the concept of decentralized digital currency. Over the years, Bitcoin has experienced significant price fluctuations, but it has consistently maintained its position as the market leader. Recently, Bitcoin faced a dip in its price following the Federal Reserve's decision to keep interest rates unchanged, currently trading around $42,590. Despite this volatility, Bitcoin's long-term potential and widespread adoption continue to attract investors.\n\nEthereum: The King of Smart Contracts\n\nEthereum (ETH), launched in 2015 by Vitalik Buterin, has revolutionized the crypto space with its smart contract functionality. Ethereum allows developers to build decentralized applications (dApps) on its blockchain, making it the backbone of numerous blockchain projects. Ethereum’s price has shown resilience, currently on a bullish trend with predictions of reaching significant price targets in the near future. The network’s continuous upgrades and its pivotal role in decentralized finance (DeFi) and non-fungible tokens (NFTs) reinforce its strong market position.\n\nEnter Furrever Token: The New Contender\n\nAmidst the dominance of Bitcoin and Ethereum, Furrever Token (FURR) is emerging as a promising new player in the crypto market. Designed to bring a whimsical and heartwarming touch to the digital currency space, Furrever Token features adorable cat-themed imagery and a strong focus on community engagement.\n\nInnovative Referral Bonus System\n\nOne of the standout features of Furrever Token is its innovative referral bonus system. This system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This not only incentivizes early adoption but also fosters strong community growth. The referral system is a unique strategy that leverages the power of community engagement to drive the token’s growth and adoption.\n\nStory continues\n\nStrong Financial Potential\n\nFurrever Token offers substantial financial potential, promising up to 15X returns for early investors. Currently priced at just $0.000732, Furrever Token is in Stage 9 of its presale, having already raised over $1.3 million, with a target of $1.9 million before its launch on PancakeSwap. This attractive entry point, combined with its innovative features, positions Furrever Token as a noteworthy investment opportunity.\n\nSecurity and Compliance\n\nSecurity and compliance are top priorities for Furrever Token. The project has undergone rigorous audits by Securi Lab to ensure a safe and reliable investment environment. Additionally, the team has committed to locking their tokens for one year, providing reassurance to the community about the project’s longevity and stability.\n\n\n\n\n\nCan Furrever Token Join the Ranks of Bitcoin and Ethereum?\n\nWhile Bitcoin and Ethereum continue to lead the market with their established presence and robust infrastructures, Furrever Token presents a fresh and unique opportunity. Its innovative referral bonus system, strong financial potential, and focus on community engagement set it apart from many other cryptocurrencies.\n\nAs the crypto market evolves, the potential for new players like Furrever Token to join the ranks of established giants like Bitcoin and Ethereum grows. Investors looking for new opportunities in the meme coin space should consider the promising prospects of Furrever Token.\n\nThe Takeaway\n\nBitcoin and Ethereum have solidified their positions as the top cryptocurrencies, but the market is always open to innovative new players. Furrever Token, with its unique appeal and innovative referral system, is well-positioned to capture the attention of investors and potentially join the ranks of these market leaders. Don’t miss out on the chance to be part of this exciting new project. Visit furrevertoken.com to learn more and participate in the presale. Use your referral code to earn additional FURR tokens and contribute to the growth of this vibrant community. Act now before the opportunity passes by, and be a part of the next big thing in the crypto market!\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNZFdMZVBGeFFodTg3TlAwMkRmcEhsZWY4QXAzNUkyeE13RjNTc2pyWkhVMi1wMXBIckd3ZlBzbkhLZnlkMHZMdnR2R1BKYU51YjVhZEZ2RjFUajZGWEc5T3JsaEszT2MxWU1JcWpMYUtjN3pPNFhmUnRGNk5XTXpZQTJJRVJfeC13bnE2VFg3UWlPZ3lla2hCMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s 2% Price Drop Spurs Second-Biggest Buying Day - Crypto Times",
        "content": "Investors strategically capitalized on a 2% price drop in Ethereum over 24 hours, leading to its second-highest day in long-term holder accumulation.\n\nCryptoQuant’s head of research, Julio Moreno, highlighted in a June 13 X post that 298,000 Ether tokens, worth approximately $1.34 billion, were purchased by accumulation addresses on June 12. This amount was just 6% below the record set on September 11, 2023, when 317,000 Ether were bought as the price dipped below $1,600.\n\nEthereum demand has spiked.\n\n\n\nBuying by permanent holders was the second highest on record yesterday: 298K ETH.\n\n\n\nThe record daily buying was last September 11: 317K ETH. pic.twitter.com/0qMVpNU8ht — Julio Moreno (@jjcmoreno) June 13, 2024\n\nThe 8.49% price decline in Ether over the past week drove this buying activity, with Ether trading at $3,472 as per CoinMarketCap data, after dipping below $3,800 on June 8 and struggling to recover while staying above $3,400.\n\nThis price level around $3,500 has historically been a significant resistance point for Ether, with past price action in this range leading to further declines, such as a similar dip below $3,500 on April 11 resulting in a 25% drop to $2,817 by May 2.\n\nDuring a Senate Banking Committee hearing on June 13, SEC Chair Gary Gensler hinted that spot Ether ETFs could receive final approval for trading by the end of summer, with the SEC potentially signing off on the approvals within three months.\n\nThe SEC granted preliminary regulatory approval for spot Ether ETFs on May 23, approving 19b-4 filings from eight applicants. However, trading can only begin once the S-1 registration statements are also approved.\n\nThis surge in long-term holder activity and potential regulatory advancements indicate a pivotal moment for Ether and its investors."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE83TlgzWVNUMWFCdjFfcFJOT1NVN2lISTVYSWtqNEFzMnlRNGNURjNWamloZWtEZXZqY2kxa1U5NUFUVFgzeVhQeXFCNlBjdXR1U1Y4d0ZjQ1V2U3FVRW9fN1R2a2FTQWVyNThQYWlrVHrSAXZBVV95cUxNUDVXYVNqM19lcDU3Rm9ydWREaDY0Q0Qwb0EyMmJKb1YwTXJmeUFLT2xZVWhrQnJNaDdJUEd5Wm5XUDUydjI2U2NvM1JRUGk3bFFMalBiTWJoOTFCZ0dlT2QxTzNaOWJTUmpXVXBkX2RJbGlCOXZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "298,000 Ethereum (ETH) in 24 Hours, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThere is a growing demand for Ethereum (ETH) on centralized trading platforms as the approval of the spot ETF is driving bullish sentiment. According to CryptoQuant’s Head of Research Julio Moreno, Ethereum demand has spiked significantly.\n\nAdvertisement\n\nEthereum buying breaks major record\n\nAs Moreno pointed out, Ethereum buying by permanent holders marked the second highest buying on record on June 13, with a total of 298,000 ETH acquired.\n\nEthereum as a digital currency is not new to intense buying activity overall. Besides this recent spike in buying activity, Ethereum’s highest buying date ever came last Sept. 11, when a total of 317,000 ETH were acquired in 24 hours.\n\nEthereum demand has spiked.\n\n\n\nBuying by permanent holders was the second highest on record yesterday: 298K ETH.\n\n\n\nThe record daily buying was last September 11: 317K ETH. pic.twitter.com/0qMVpNU8ht — Julio Moreno (@jjcmoreno) June 13, 2024\n\nThe explanation for this increased buying momentum is not far-fetched. Prior to the entry of institutional capital that might showcase a high affinity for spot Ethereum ETF, most retail buyers are taking positions as needed. This is a major coping mechanism for the intense liquidity war that might be activated very soon.\n\nThe ongoing accumulation will grant current holders a major headstart should the price of Ethereum make a push toward new highs. One intriguing trend seen in Ethereum is the price slump over the past week.\n\nThe coin is down by 7.60% over the trailing seven-day period, and the June 13 accumulation comes at a time when the coin flashed a major discount. The accumulation has sparked a mild trend reversal, jumping by 0.6% at the time of writing to $3,519.20.\n\nWhat to watch out for in Ethereum\n\nBesides the numerous upgrades the Ethereum protocol has welcomed in the past year, the most important event to watch out for is the approval of S-1 registrations for the spot Ethereum ETF product.\n\nWhile the timeline remains speculative, the commencement of Ethereum ETF trading will mark a new era for the coin and likely open it up to an intense rally."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxNYjB4Z3JjSE91QUYxYjAxNzNwRkVTdE5KZHl0aThpQ0I3S19CQm5oVHZRdkF2WDZ6bm8zM0hmczdQVEFBdXZHaGF2M2Q5a2NPTnJZUmNBYVNZR2tmMGszX25Kc3cyLXFNdk5BelRRY1AzbnZ5MkpuNFUwRTdWQ0NyR3A2eGpyTHRiTEFEYU1CTUZDdDBIcFktZk1saUh0OHc5WWoyelBzNDJGUlB2X1pkR2hfOEVSMGNERGsxX3Noakk3OG1rR2FLQ2paemZkWEFBX1RLTkZQOGVHMDBSZ25vZ0FNcDdvRE1EX1lhUUFHQS1DTHfSAfgBQVVfeXFMUDJraURNRDJ6SFRMT1FiR3p1UUE4djk2Snc0N05nUnFId2xxeGZwVW55Y0VmSFlvbDRmSTJJN3RXR0NmODM4QjBRYU8xT1doS0dPTzRjTHFFeWE2YmQyQjNRWFU2Q093WWFsSVRIYzZDci1oZ2NVWnRhVXBuTldfZE9LVVZIeEZhLXJpMk9SbUE3VkpIdkFNRFJEXzNpWmZtOWg2X3VXUVoxZTRteWVQUm1ISjFmdlphRXB6X1Y2S2JSQlN0a0pBODItdlBCb0xwSlZnXzF5UTlHS2ZrYVFBNl82MXVqeGkxbUJSRHdFbkhRT0FGRkpucWI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair says Ethereum ETF S-1 approvals likely to come over the summer - FXStreet",
        "content": "Ethereum ETF S-1s will likely be approved by the end of the summer, says SEC Chair Gary Gensler.\n\nEthereum exchange reserves have declined by about $4 billion in past two weeks.\n\nEthereum derivatives data reveal divergent sentiment among short-term and long-term traders.\n\nEthereum's (ETH) price was down nearly 5% on Thursday as Securities & Exchange Commission (SEC) Chair Gary Gensler suggested spot ETH ETFs will likely receive approval over the course of the summer. The update was accompanied by mixed sentiment from derivatives traders.\n\nDaily digest market movers: ETH ETF summer launch, declining exchange reserves\n\nEthereum price could see a reversal after the latest development for spot ETH ETFs. Here is the latest news surrounding the top altcoin:\n\nAccording to Fox Business’s Eleanor Terrett, SEC Chair Gary Gensler told Senator Bill Hagerty that spot ETH ETF S-1s will likely be approved \"over the course of the summer.\"\n\nAlso read: Ethereum poised for recovery following increased exchange outflows\n\nThe SEC approved issuers' 19b-4 filings on May 23 but also needs to greenlight their S-1s before spot ETH ETFs go live.\n\nMeanwhile, Framework Ventures co-founder Vance Spencer believes Ethereum is a \"tech-style growth play\" that will become the app store of finance.\n\n\"ETH is at the forefront of the tokenization movement that's really going to define the next few decades of traditional finance,\" he said.\n\n\"People are going to be really surprised at the uniqueness of the scale of business Ethereum is going to generate from the tokenization wave,\" Spencer added.\n\nRead more: Ethereum breaches key support, receives ‘digital oil’ tag from world's largest bank\n\nAccording to data from CryptoQuant, ETH has seen over $1.5 billion in net exchange outflow since June 9. ETH's exchange reserve has also declined by nearly 1.2 million ETH, worth over $4 billion, since May 27. This indicates a bullish outlook for ETH despite declining prices.\n\nETH technical analysis: Ethereum bearish sentiment likely temporary\n\nEthereum is trading around $3,434 on Thursday following a wider market decline after the Fed held interest rates steady on Wednesday.\n\nETH Open Interest (OI) declined by nearly 4% in the past 24 hours following the decline. Moreover, ETH options volume decreased by 51%, which shows options traders exercising caution.\n\nAdditionally, the ETH futures long/short ratio is at 0.88. A ratio below 1 shows the market is tending toward bears. However, this is likely a short-term bearish view, as traders may be looking to profit from the Federal Reserve's conservative outlook on interest rates.\n\nAlso read: Ethereum ecosystem sees impressive Q1 earnings, issuers plan to market ETH as the ‘ultimate app store’\n\nDeribit's options data shows that ETH's put/call ratio (PCR) is at 0.32, indicating strong bullish sentiment from traders. A PCR above 0.7 or exceeding 1 indicates traders are buying more puts than calls, suggesting prevailing bearish sentiment. A PCR below 0.7 and approaching 0.5 is considered a bullish indicator.\n\nAs a result, ETH is likely to see a reversal in the next few days and may steady around $3,730 to $3,900.\n\nETH/USDT 4-hour chart\n\nThe launch of spot ETH ETFs will likely push the largest altcoin to a new all-time high above $4,878. A breach of the $3,300 support will invalidate the bullish thesis."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1SXzh3QVlmQXlQbkN2NERBUk9JY0ZmT1hhVWhFTU82dHJFUlJGQmFqT3dlUnAyYk1LT3FwN3Q2YjhEOEpPZmxlX19RWTk2WDBxTnB6TnQ5aDJYQTJOWUHSAWNBVV95cUxOeWJDa0l5LUtMOW5UWU1sRG93YWszcHNVNWppdUdPclZKak5KVFZvVi1QMF9XanpQdmNsSVc1Rm5hc004WUh5RWwxNVg4TU5wcl9LbEhUWWROYzd1azZ0SVFQRlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 14:36:27 GMT",
        "title": "Solana Founder Reveals SOL Surpasses Ethereum In This Major Metric | Bitcoinist.com - Bitcoinist",
        "content": "Solana founder, Anatoly Yakovenko has declared that SOL has surpassed Ethereum, the world’s second-largest cryptocurrency in a critical metric – the economic barrier for honest nodes to participate in consensus.\n\nSolana Outpaces Ethereum By 10X In This Metric\n\nAccording to Yakovenko, the economic barrier for honest nodes to participate in consensus in Solana is 10 times higher than Ethereum’s at the moment. Typically, blockchains like Ethereum and Solana rely on a distributed network of computers, also known as nodes, to validate and record transactions. This entire process is called a consensus and ensures that all nodes in the network work together to maintain the blockchain’s performance and security.\n\nHowever, Yakovenko suggests that not all nodes are equal and participation in engagement in the blockchain’s consensus process usually comes at a steep price. These expenses are usually inflated by costs of running powerful hardware, and energy consumption.\n\nThe Solana founder also disclosed that SOL’s expensive nodes are primarily due to the investments Ethereum has made in Boneh-Lynn-Sacham (BLS) aggregation for consensus messages.\n\nThe Boneh-Lynn-Sacham is a cryptographic signature scheme leveraged by Ethereum which enables users to verify the level of authenticity of a signer. Notably, the BLS scheme can hold messages independently verified by node validators.\n\nReports from Ryan Berckmans, an Ethereum community member and investor, have revealed just how expensive running a Solana validator is. He disclosed that the Solana Foundation is currently financially supporting the blockchain because running a validator costs over $65,000 per year.\n\nYakovenko has disclosed undefined plans to adopt a more efficient consensus mechanism to address the heightened voting fees. He disclosed that as hardware improves, the lower bound fee to send validator messages to the entire cluster will eventually decrease. As a result, the cost per vote will also decline and Solana’s economic barrier for node participation may drop.\n\nAdditionally, the Solana founder disclosed that establishing voting subcommittees would lower vote fees and potentially reduce the vote load by rotating boxes in and out of the committee.\n\nETH and SOL Witness Slight Pullback\n\nLately, the price of Ethereum and Solana has been witnessing minor declines, underscoring the waning demand for these cryptocurrencies in the crypto market. As of writing, Solana has recorded a substantial weekly decrease of 12.91%, pushing its price down to $150.5.\n\nThe slight pullback in Solana comes amidst the broader market volatility and a slowdown in investor’s demand for the cryptocurrency. Despite its bearish performance, crypto analyst Ali Martinez is optimistic about Solana’s future outlook. Martinez has predicted a potential price surge as high as 53% for the popular cryptocurrency.\n\nOn the other hand, Ethereum has continually witnessed a decrease in its value despite the recent approval of Spot Ethereum ETFs by the United States Securities and Exchange Commission (SEC). As of the latest update, the price of Ethereum is trading at $3,485, marking a significant weekly decline of 9.49%."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1DQWE4WkhQRkdFT2dlV2tYN2x6MnBreDFfUkJ0MnQyZVBvT3dVX2RUWlhjYy1kd2JCV3RuWkloNEtDTFhiaF80SFZhNS1Cc2ZKWmZ4cnFiOXBqMDNzd2ZValhMVGhsWEtkd282LW41NUV4UW9IY3ZQRE1zOFNxUdIBgwFBVV95cUxQUzZQVlNDNG5Meko2TjdGbDYzbThpaGlucFV6aE9NcmJLU0R3WWZ6WEJHMFIzN2M5NTBOeHlJYlJZd2dCZWZ1c1NWSVFvdFVLT2JvRm50cFoySkctX3l1emI5dTZpdmREUkRIc1d0TVJSVl9tUWJ3cUZiRDNONFAxTW9DSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Here's When Ethereum ETFs Will Launch, According to Gensler - U.Today",
        "content": "During a Thursday hearing held by the Senate Appropriations Subcommittee on Financial Services, US Securities and Exchange Commission Chair Gary Gensler told Senator Bill Hagerty (R-TN) that he expects the agency to approve S-1 forms for spot Ethereum exchange-traded funds (ETFs) \"sometime over the course of this summer.\"\n\nAdvertisement\n\nAs reported by U.Today, the SEC unexpectedly greenlit the listing and trading of eight Ether ETFs by greenlighting their respective rule rules changes (19b-4 forms).\n\nHowever, the approval is a two-step process. Before Ethereum ETFs can go live, they have to clear another hurdle. The SEC has yet to approve S-1 registration forms that contain in-depth information about the products that will be offered to the public.\n\nAdvertisement\n\nIn late May, the agency requested updated S-1 forms from prospective issuers. \"Will be interested to see changes in the next batch of amended S-1s. There can't be *that* much work left to do,\" ETF analyst Nate Geraci said.\n\nJames Seyffart, a well-regarded Bloomberg analyst, appears to be confident that Ethereum ETFs will go live this summer. \"July was and is a complete guess. But I was more confident in saying that ETH ETFs will launch at some point this summer. That was sort of a given,\" he said in a post on the X social media network.\n\nAs reported by U.Today , JPMorgan predicted that Ethereum ETFs would attract modest inflows compared to Bitcoin ETFs."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPTTFpaEVDbXY0amxGVXA0N2ZvaWR6WjRvSFp5Y1dfNlRmQnFOMHNHZVg5bmNzdXRfWmh2SzkyT1lBbm1XR2doS0dGcjZCZTZYM2kyd2VDR3pBakpxamd1eXFlMEN0ZFg4bEJPUVROcktZYzlTTmNqQVNRb0JtLTdESGhyeGpOUmdVQXA3NVJMUko1cWduNWhNbnAtZHlCcXB0VHZIZVZ0ZWx4SEluU3FYcVdzYnU3QdIBuwFBVV95cUxQWVR4ekZMXzdfUjVPZnVlQ3c5c2hDMWIyU2RBa1J5ZjdTZ092ZFUwSnFCRXZRbjZEZjF5Vnd0dkxMcGJmSDVQcExvMVdVNnBIbHhuTThaLUJZclZiU1ZheFB0a3ZsZm9yOUotT0drTWdpczJfd0lUbzRGOXdvUExSdm5rTS1DcDd3b0dKdWxkOXM1by1lTS1RY0swMWlKVHdDUU1MZzAzTTJxUVlNVkg3SHNpOWNwMGI3Q2p3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ether ETFs Should Be Fully Approved by September, Says SEC Chair Gensler - CoinDesk",
        "content": "The question is important when trying to seek the proper U.S. watchdog for various tokens. The SEC will oversee securities tokens and the CFTC will have authority over the rest. While Gensler has repeatedly said the vast majority of digital assets should be considered securities, he refuses to identify which ones fit in which basket apart from those his agency has listed in enforcement actions."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQVhzTmRvZFBNUEdRUnVqLVZPWUFzdFB2VmMtT1Z4YWhYVmY3QS1rUGUzYnFqOC1RZ0MyRmVPZkp3WE1fNFhEMUpTWFQ1YWo5NjJNWTB0UXNvaUo2TWtjNlZCM0RZdGRUVEdVZXllY1hkRzJZQmk2cUZCYW5WWEJSRVluVzZxbE9OOFBJM1VrMDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Telegram’s TON blockchain eclipses Ethereum in daily users - Yahoo Finance",
        "content": "Telegram’s The Open Network (TON) has surpassed Ethereum in daily active addresses, marking a notable shift in the cryptocurrency landscape.\n\nAnalytics firm Delphi Digital reports that TON’s daily active addresses have consistently outpaced Ethereum’s throughout June, thanks to Telegram’s 900 million users.\n\nTON’s network activity boost is attributed to strategic initiatives, including the integration of the Tether (USDT) stablecoin and the introduction of Notcoin, a tap-to-earn token that attracted 35 million users in just five months.\n\nNotcoin is not the only Telegram mini apps that have gone viral. More recently, Hamster Kombat announced it surpassed 100 million cumulative users.\n\nWhile TON’s performance is noteworthy, it’s essential to consider Ethereum’s ongoing transition to layer 2 scaling solutions like Arbitrum, Base, and Optimism, which reported 1.3 million daily active addresses on June 11 alone.\n\nEthereum co-founder Vitalik Buterin supports these solutions as part of Ethereum’s scaling strategy, which complicates direct comparisons with TON’s metrics."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPN1drQjY1dXhJdzBDTk56UDBRcmhuY0ZoS0xuUGY3SDZOQTdPQXlnTDBzenFfLUx5OVJNaVgxZ1k2MXNibnRXYUVOelFnWnB0cXdfTXh6TUZ6eTVpbWd3bEt6ZWNtMHRVQ2MtU2ZhZDB5TjhzVG1QemVyVXJrMDZaM2JacFRoM0ZtMnA3Vl9WSDJDckJCT3g2MHBVWUVlN3VaV0JQSVJ1SE10WGtZaXIxYVNxS1VBcTE5RXk2NE5oMjFoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum HODLers Scoop 298,000 ETH In 24 Ahead Of Spot ETF Trading - TradingView",
        "content": "Ethereum is under pressure at press time, tumbling roughly 15% from March 2024. As sellers press on, reversing all gains posted from May 20, on-chain data points to a bullish picture.\n\nEthereum HODLers Scoop 298,000 ETH In 24 Hours\n\nTaking to X, one analyst notes a spike in ETH demand, especially from permanent holders. Most likely, these permanent holders are institutions with deeper pockets and are willing to hang on. Unlike retailers, these entities can often choose to hold for longer and won’t be shaken out by market volatility.\n\nNewsBTC\n\nCiting CryptoQuant data, the analyst said these permanent holders, according to records, are responsible for the second-highest daily purchase. On June 12, when prices briefly rose, they bought a staggering 298,000 ETH. Impressively, this figure just falls short of the all-time high of 317,000 ETH purchased on September 11, 2023.\n\nIn light of this, despite the wave of lower lows clear in the daily chart, the surge in demand points to strong bullish sentiment.\n\nAlso, considering the amount of ETH scooped from the markets, it could signal that institutions, possibly hedge funds or billionaires, are beginning to position themselves in the market.\n\nThey appear to be taking advantage of the lower prices.\n\nAt press time, there is weakness in Ethereum, evident in the daily chart. Even with the bounce on June 12, bulls didn’t completely reverse losses of June 11. The dip on June 13 means sellers are back in the equation, and prices could align toward the conspicuous June 11 bar. www.tradingview.com/x/Vk7s6tvO\n\nFrom the candlestick arrangement in the daily chart, $3,700 is emerging as a resistance level. After the breakout on June 7, ETH has been free-falling to spot rates, actively filling the May 20 gap.\n\nIf the dump continues, it is likely that ETH, even with all the optimism across the crypto scene, will once more re-test $3,300.\n\nSpot ETFs To Begin Trading This Summer: Gensler\n\nWhether prices will recover from current levels or slip towards $3,300 remains to be seen. Overall, the market is upbeat, according to comments from Gary Gensler, the chair of the United States Securities and Exchange Commission (SEC).\n\nAppearing in a senate hearing, Gensler said the spot Ethereum exchange-traded fund (ETF), whose 194-b forms were approved in May, may begin trading at a tentative time in summer. BlackRock has already resubmitted its S-1 filing and is waiting for approval.\n\nIf the product is approved in the next few weeks, it will be a major liquidity boost for ETH. Like spot Bitcoin ETFs, institutions will likely channel billions to ETH, allowing their clients to get exposure."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPMWJfYWRZUVZ6eEkyRXh0WFpEeTJHVGFITXBoSE9FMEE3MmpTanBpR0JiOGREVUZIYVJHWUd5ZkFhOFJLM21KaWhpUmVucmVSMTNrTlV6d05manZCWDNsMFRfWkUzQ0U0d3c4MWNvVTZ2QUNzaWF1Yl94Vm5jbVplR3NEeldDdy1lRjNIWG9Ca2tKR1IxWXhOeDg3WlBkSHpQc1hBUnZNVWpXc2ZER0dObXkzTdIBuAFBVV95cUxNU2NyU1BXTFJLTlN2b3pJakR4eFBZYTdpR0N3cUhELWRHV0hHVHVmT1BnWTR5Q3NOWk85eEh6NHhnemYwWkhPdTE3YW05M0ZMX1dfRjVaN3dqdEc2SDM5b05VcGlvUXIzdjBtMktUcklpWXFZSXpMMm1vR29GMWczOERicGhfXzZ2dGNhNUF0ajdMTzZYcG1INkhMRElWb0dqb0QybklJdkpFY2dwNWZ0bnNrX1NzVno0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) in Critical State, Here's Why Bitcoin (BTC) Can't Reach $70,000, Will XRP Reach All-Time Low? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAlthough Ethereum was beginning to gain traction on the market, the severe and ongoing consolidation that produced virtually nothing and only pulled ETH at about $3,800 was an important signal pointing to the asset's potential future performance.\n\nDespite its early strong momentum, the price action of ETH has surprised a lot of traders. After hitting resistance at about $3,800, Ethereum entered a consolidation phase. The current decline that we have observed, which is frequently an indication of market indecision, was foreseen in this instance by sideways movement. Over the past few days, Ethereum's price has dropped significantly, approaching $3,500.\n\nThe market had been feeling bullish overall, so many people were surprised by this sudden decline. There are several possible reasons for this unforeseen behavior. Initial liquidity issues could be crucial. Furthermore, macroeconomic factors and investor sentiment are always important. Ethereum's performance may have been impacted by recent global financial trends, regulatory news or even bigger sell-offs on the market. It is also critical to keep in mind that fluctuations in Bitcoin (such as the decline below $70,000) frequently have an impact on the entire cryptocurrency market, including Ethereum.\n\nTechnical indicators show that there was a significant sell-off of ETH in a short period of time. Reentry by buyers onto the market may indicate potential for expansion. Moving averages also show another concerning pattern: the shorter-term MAs crossing below the longer-term MAs, which is typically a bearish signal. Despite the recent downturn, Ethereum's fundamentals remain strong.\n\nAdvertisement\n\nBitcoin is struggling\n\nBitcoin is struggling to cross the $70,000 threshold for a number of reasons. The significant lack of purchasing power is one of the main causes. Bitcoin's price previously reached all-time highs due to significant capital inflows.\n\nA decreasing number of new purchasers are nevertheless willing to make these high-level investments, according to the state of the market. The lack of buying interest is making it difficult for Bitcoin to surpass the psychological $70,000 barrier.\n\nThe change in institutional behavior is another important component. Institutions are now shifting money away from Bitcoin ETFs despite the fact that they were crucial to Bitcoin's earlier rallies. This change is partially the result of people looking for better returns in alternative asset classes or new developments in the cryptocurrency industry.\n\nThe potential price of Bitcoin is weakened by diminished institutional support because a significant portion of the buying pressure that raised prices came from these large-scale investors.\n\nFurthermore, strong fundamental drivers that have historically sparked enormous bull runs are absent from Bitcoin at the moment. While the NFT craze played a similar role in 2021, the ICO boom in 2017 propelled Bitcoin to previously-unheard-of heights. There is currently no trend or invention like this propelling investor capital and enthusiasm toward Bitcoin on a large scale.\n\nThe struggles of Bitcoin are also reflected in technical indicators. It appears that neither overbought nor oversold conditions exist as the Relative Strength Index (RSI) has been circling around neutral. This neutral RSI adds to the general sense of indecisiveness and uncertainty on the market, further impeding any meaningful price movement.\n\nXRP in trouble\n\nXRP's current state is really problematic. The asset has lost numerous key support levels like the 50 EMA, psychological levels at $0.5 and others. Such performance certainly puts XRP down on the list of better-performing assets. However, the only question now is: will it reach the yearly low of $0.44?\n\nXRP has been steadily losing value over the last few weeks as it has been in a downtrend. The first real red flag appeared when the 50-day EMA disappeared. After that, XRP dropped below both the critical psychological support level of $0.5, which is represented by the orange line on the 100-day EMA, further deteriorating its technical outlook.\n\nThe annual low of $0.44 is the next significant support level for XRP. The likelihood of reaching this level appears to be growing given the state of the market and technical indicators. There is a long-term bearish trend indicated by the 200-day EMA, which is still significantly above the current price.\n\nThe absence of significant purchasing power is one of the primary causes of XRP's downfall. The asset finds it difficult to hold onto its value, much less increase it in the absence of substantial buy-side interest. Due to investor caution brought on by macroeconomic uncertainties, the overall market conditions for cryptocurrencies are currently not very favorable."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOdHRleDkxNXJkZXNaeU5Ua1g4QjAyUEVrWDFmSWVQT2llQlk0S2ltOVFOTDhTeVN3c3YwZ01oTmFodTNhYTBDdE1odGdIbVY2Y3pYalRsa1U0MFB0ZVV3ZlR5ejMwT2NlNUZEV1NqalR2MWNaU2owZDhMU01pTm1nSWJfVDFyNlFWZDV5ZDJRSGh1azZIQlVHSGR2YllDQ1dHSHQyWW1MYVRFWkHSAbABQVVfeXFMT1NPSEVIMzVibndMUTItdXMtRTFpMEd1VTZ1YldYRFYxVllkc1ExOVlVRGx5NzVjYnVlWUJUcGhGZm9SVDJ6MkZLNnVqaVdNWEJyUWlrMjJMR1lOUG5KYkJWbnFVWFk1VWN4aEt6S2ZaTVhTTk1KUV9rYXRPVUl4bm9hUHZtdERnZDhsSXp3QzRfTlJHbkhHQXVtWENNNkc3M3VVbEgyR1lTcjYxbXFfRmk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "When Will Ethereum Start Rallying Again? Here Are the Latest ETH Price Predictions - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) has declined to around $3,500, but analysts predict potential new all-time highs due to positive technical indicators.\n\nMetrics such as negative exchange netflow and a low RSI suggest reduced selling pressure and possible price recovery.\n\nIs It Time for a Resurgence?\n\nThe price of Ethereum (ETH), similar to many other cryptocurrencies, plunged significantly in the past several days. Currently, the second-biggest digital asset in terms of market capitalization is worth around $3,500 (per CoinGecko’s data), a 9% decline on a weekly scale.\n\nNonetheless, some analysts think ETH will face good days ahead, with some speculating about a new all-time high in the following months. The X users Wolf and Jelle are some examples.\n\nThe former presented a price chart showing that ETH has been on a bullish path since the beginning of 2024. The analyst envisioned enhanced volatility for the asset in the upcoming future, which will eventually lead to a bull run and a new all-time high price of over $5,000.\n\nJelle claimed that ETH “successfully retested the 50-day EMA.” The analyst believes the asset’s valuation could reach fresh peaks once it surpasses the $3,700 zone.\n\nThe 50-day Exponential Moving Average (EMA) is an important technical analysis tool that could suggest a potential price movement. It helps identify prevailing trends in the past 50 days but with a bigger focus on the most recent data, unlike the SMA, and provides insights into potential buy and sell levels.\n\n\n\nWhat Are Metrics Signaling?\n\nSeveral major indicators also hint that an ETH price revival might be in the cards. One example is Ethereum’s exchange netflow, which has been negative in the last four days. A shift from centralized trading platforms towards self-custody methods is considered bullish since it reduces the immediate selling pressure.\n\n\n\nSeparately, Ethereum’s Relative Strength Index (RSI) plummeted on June 11 to a multi-month low of 20.7, currently positioned at 36. The metric has not crossed the 70 mark since May 23.\n\nIt is a momentum oscillator that measures the speed and change of price fluctuations and identifies overbought or oversold conditions in a market. Its value varies from 0 to 100, with a ratio above 70 suggesting a pullback might be imminent."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNclEtXzlCZDg4UXZfRWt1WWZRUThKbHZycU5IbV9MdUVrVlE2ZG43N1BwQk9YdVZxR1lNLUZCdTlNN2lWVUpZU1NQb3J4blN0R3dvN2t0NU9QQ1hqNUZ3UUxMM3UyajhvbXJCczVGVW5BWkJYV2c5TXR0WEM5c1ZTemZuYjVRWVZJbHdvcWhodlU2Z2hQUm9DQ19paHZ5WlR3MklnV2pwZGJLTXlkV0RzX3E3WWxQU0RlY1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum options expiring: a $2 billion earthquake ready to shake the market - Cointribune EN",
        "content": "Fri 14 Jun 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe crypto market is bracing for potential volatility as Bitcoin and Ethereum options with a notional value of $2.06 billion are set to expire on Friday. This massive expiration could cause fluctuations in BTC and Ether prices.\n\nBitcoin and Ethereum Options Surge of $2 Billion\n\nThe crypto traders are in a stir as a true wave of Bitcoin and Ethereum options worth over $2 billion are set to expire today.\n\nAccording to data, approximately 20,276 Bitcoin options contracts representing $1.35 billion, with a very high maximum strike price of $68,500, are set to expire.\n\nSimultaneously, no less than 201,647 Ethereum contracts worth $709.76 million, with a maximum strike price of $3,600, are also due to expire in a timing that is not coincidental.\n\nThe put/call ratios, indicators measuring the balance between outstanding buy and sell options, are at 0.49 for Bitcoin and 0.36 for Ethereum. These levels below 1 suggest a predominance of long positions over short positions, a potentially bullish signal to watch closely.\n\nHowever, savvy investors will remain vigilant, as such massive options expirations generally translate into bouts of market volatility, at least in the short term.\n\nExperts’ Views on the Major Event\n\nAdam, a macro researcher at Greeks.Live, an options trading tool, shared his insightful analysis on the upcoming expiration. According to him, although the week is crucial for macroeconomics, the crypto market has recently experienced disappointing performances, with mainstream coins and altcoins dropping significantly.\n\nHe also noted that the implied volatilities of Bitcoin and Ethereum are currently at relatively low levels, offering buyers a high cost-effectiveness ratio. Adam suggested that traders prepare for the potential approval of an Ethereum Spot ETF by the end of the month, by planning in advance to buy options for the next month.\n\nBitcoin and Ethereum experienced price drops before this major expiration. BTC, which was trading at $71,643 on June 7, briefly fell to $66,254 on June 11 before rebounding to $69,945 on June 12.\n\nCurrently, Bitcoin is trading at $67,064, a 6% drop over the past week. Meanwhile, Ethereum has fallen by 7.8%, trading at $3,519.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1HTWlveXdpUkdlNHJ4bWF4RnlveGRlaU5CeTJqMFpYbkNKTFJEWm9TekFCeVlWU1ZPenhuU0VfWEg1ZDhCMUFwcXVZT3BhcEYyTE5jQm9mWGpUX01QSGhvdS16S29DVmhIY3ZkTmM0eXJTZDgxb1RxMGp6WVjSAYIBQVVfeXFMUFYwWjJDR1EwdktWVlpZdlBOZE9IWlRPdHRRQm9BZGZYRTRaQ2lLMzhZTy1EM3BBeGhHUkl2VFNZVDFVRm9QMlR3cGo5TzhoZmdpb050VEF3MjM5d3BzWmRPR002NVdrVFNhTFRZVEcxZkhPdjdiUlBoZW1qSVdXc0ZLZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs To Make Trading Debut In July - Here’s The Date | Bitcoinist.com - Bitcoinist",
        "content": "Following the approval of the Ethereum spot ETFs (exchange-traded funds), potential issuers have had to wait for the trading debuts of their products. This has led to much commentary and speculation on the possible date for the final approvals of the Ether ETFs.\n\nBloomberg analyst Eric Balchunas is the latest personality to predict when the Ethereum spot ETFs could begin trading in the United States.\n\nWhy Ethereum Spot ETFs May Start Trading By July 2\n\nIn a recent post on the X platform, Balchunas put forward July 2, 2024, as the new projected date for when the spot Ethereum exchange-traded funds could begin trading. This update is based on the Securities and Exchange Commission’s (SEC) response to issuers on Friday, June 14.\n\nAccording to the ETF expert, the SEC made “pretty light” comments to the issuers’ S-1 forms, with no major issues to address. Balchunas also mentioned that the commission expects issuers to reply to these comments in a week.\n\nThe SEC has approved the 19b-4 forms for eight potential issuers, notably BlackRock, Fidelity, VanEck, and Franklin Templeton. The agency would also need to greenlight the S-1 forms for the Ethereum spot ETFs to go live.\n\nBalchunas wrote in his post on X:\n\nDecent chance they work to declare them effective the next week and get it off their plate before the holiday weekend. Anything is possible but this is our best guess as of now.\n\nNote: our previous over/under was July 4th so this isn't major shift but 1) we startted to feel like it would take longer so this is kinda good news and b) we basically decide the over/under on where are most torn 50-50 on where to bet and July 2nd is that date right now. — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nRecently, SEC chair Gary Gensler said to senators during a budget hearing that the final approvals for the Ethereum spot ETFs should be finished by summer. The final launch of these products is expected to attract significant capital inflow into the second-largest cryptocurrency and the market.\n\nEthereum Demand On The Rise Ahead Of ETF Launch\n\nThe latest on-chain data shows that there has been an increased demand for Ethereum, especially from permanent investors. This revelation is based on a significant spike in CryptoQuant’s Permanent Holders Inflows metric.\n\nPermanent holders, or hodlers, refer to participants who can choose to hold a cryptocurrency for longer periods and won’t be taken out easily by market volatility. According to the on-chain analytics firm, this class of investors scooped up 298,000 BTC on Wednesday, June 12.\n\nConsidering the amount acquired by the permanent holders, it is likely that institutions are responsible for this acquisition, as they try to position themselves well in the market ahead of the impending launch of the Ethereum spot ETFs.\n\nETH price approaching $3,600 on the daily timeframe | Source: ETHUSDT chart on TradingView\n\nFeatured image from Bernard Marr, chart from TradingView"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPSUd4aHBUX2tPRW5vSmpzallFNHkwcXhjTVI5Mk1XUXRXbDQxZ2I2Nk1EUUFkR0ZObnhOOUlNVjFhcy1hZlJZS01BcVVfNDhYOUhqa2R3dG9XWUdYQTZ3WHlMNkt6N21BZHdrRVVfYW1XSFFUUnVETmRiOHFsOElqaEdvdFFHTDhTZTRkb0laQ1AxaHZoZVHSAZsBQVVfeXFMUDdVdUFmRDEwcEd4VlBTVG9mSzNHVlBjX0dBci1XUDJRcWJQNFl3azdtTk1XS2RGenVpVEswVVZyQ1FHSUR1d2Q2a19WYkFqdXdHRGJWTVdOcXI0TFVRclhPT0F6ekhPbDlNZm45S2VYZ0kxSVRrbFIyYlJIeVZmeDNSczAwLTBIZ3VFcjRuajNmTUphWDBUbl9WVnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF update: ProShares steps up with S-1 filing as ETH slides - AMBCrypto News",
        "content": "ProShares filed an S-1 to launch an Ethereum ETF.\n\nETH’s price continued to decline along with its network growth.\n\nOver the past few days, Ethereum [ETH] fell victim to the larger bearish sentiment prevailing in the market and witnessed a correction.\n\nIt’s raining ETFs\n\nHowever, financial institutions did not lose any enthusiasm and ETF applications continued to be submitted to the SEC.\n\nETF issuer ProShares took a significant step towards launching its spot Ethereum ETF by filing an S-1 registration statement.\n\nAccording to the filing, Coinbase Credit will act as a critical partner by providing ProShares with a trade credit line.\n\nThis essentially allows ProShares to borrow Ethereum and cash for certain transactions that go beyond their immediate trading balance.\n\nMeanwhile, Bank of New York Mellon (BNY Mellon) will take on the role of transfer agent. This means they’ll be responsible for processing both purchases and redemption orders for the ETF, essentially keeping track of who owns shares within the fund.\n\nThe filing also clarified some previously announced roles. For instance, BNY Mellon will also serve as administrator and cash custodian, while Coinbase Custody will handle the safekeeping of the Ethereum assets.\n\nIt’s important to note that the filing allowed for some flexibility in these roles.\n\nWhile BNY Mellon’s administrator role is initially set for a two-year term with annual renewals, ProShares has the option to make changes after that period.\n\nSimilarly, the ETF can add or remove custodians for both Ethereum and cash, as well as switch prime execution agencies at any time. Interestingly, Coinbase also retains the right to step down from its role as cash custodian.\n\nHow is ETH doing?\n\nDespite the enthusiasm showcased by ProShares, the price of ETH continued to decline. At press time, ETH dipped below the $3,500 mark and was trading at $3,497.81.\n\nEven though the decline in price was significant, the overall trend for ETH looked mostly positive.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nSince the 19th of May, the price of ETH moved upwards while exhibiting higher highs and higher lows, indicative of a bullish trend.\n\nHowever, AMBCrypto’s analysis of Santiment’s data revealed that the network growth for ETH had declined along with the price, indicating that new addresses were losing interest in ETH."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPQTljNEtqd3Zwa3RZdkRXSm5rSnJjYWw1RnNsZ3hwandNU2ItMEd6R2hpdnp3MHVmQl9zMUlJeUE0Z1M5TlZ6Nk84enk3cmJVVFVlbGxDU0pmeWt4cE1MNHotdFRrajJwd1hLcVdyMjIyWHIxMy1HTkQ0NWVCajJTVnVtM1RMZDdvbFpCRVFBUXFaRVVFdDAxRtIBngFBVV95cUxNOUdDVDRsQVVUV1JWcUZodTBLeXVZZW00bHR6NFlSWW5hQjZrSXlPRl93LVJBbGtWZlRZZlVxdmxxZDlXMW5hZHdrbm5tU3JwUVZKajE4MWVRenJ5RjU5SnIxMzVHb2s3OWlyRHY1bTZTRFItMExkQkZOWTVCdnh4R25YMTgydEN4b3JFOWtCNW5vbFdWQXYwWmYtVjlYdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Permanent Holders Scoop 298K ETH In A Day, ETH Price Rally Soon? - CoinGape",
        "content": "All eyes are currently on Ethereum as the U.S. Securities and Exchange Chairman Gary Gensler stated that the approval of the spot Ethereum ETF will happen by the end of this summer. Although this news brought some optimism to the ETH community, it has yet to reflect in the Ethereum price which is trading under $3,500 as of press time.\n\nEthereum Demand Skyrockets\n\nJulio Moreno, the head of research at CryptoQuant stated that there’s a significant surge in the Ethereum demand currently in the market. As per Moreno, the permanent ETH holders bought a staggering 298,000 ETH yesterday, making this the second-highest daily purchase on record.\n\nadvertisement\n\nThe record for the highest daily buying remains on September 11, 2023, as of now, when the ETH holders scooped 317,000 ETF. However, even the current spike in Ethereum demand highlights the growing interest and confidence among long term investors in the crypto market.\n\nThe massive surge in demand for Ethereum has come as the ETH price has corrected more than 9% in the past seven days. However, as we saw, the on-chain metrics continue to show strength for the world’s second-largest cryptocurrency.\n\nAs reported by CoinGape, Ethereum’s withdrawal from the Coinbase exchange surged to a massive 300K, thereby making it one of the largest outflows in 2024. With this, the total value of the Ethereum withdrawal has surged past $1 billion.\n\nETH Price Action Ahead?\n\nDespite the positive on-chain indicators, the ETH bulls haven’t gained enough control to trigger a rally past $4,000. Currently, Ethereum is trading just under its crucial support zone of $3,500.\n\nLast time, the ETH price dropped under $3,500 back in April, it led to a 25% decline hitting the low of $2,814 by May 2. All eyes will be on how swiftly the SEC chair gives a go-ahead to the spot Ethereum ETF to go live for trading. This is likely to infuse major capital inflows as we saw after the approval of the spot Bitcoin ETF.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOWkN4YnVzRUN0aVF0dHNjUVJObmVLelV2RWhJUDdfUTRqdGEwMUJhdkJVM0tuZjZ1UWxodmhNaC1GU1lTZ1ZSeVJ5X3plVGNhRU9FZjdJeVozVExEZHZ5NG1WNWI3V0YyUnZ4RlZFeWpTUlpqMVo1UUxjRnFaTFltU9IBhgFBVV95cUxQVmdvbURIaGNpNTRsYk5zWWJwam9iSVhDQUoxeWVKWTFLcVlKNkJMRmpyLWhfLUx3VC1Cd1hVWVhGZjF3enpOVTNTZ1hMT0F3RkVIcGJveHM2Ty1VOXhyYjRpUE5NVlFGVTd5cFBQLW1WUG80T2lwdWt0UURWTnI3djNvbFp2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Analyzing Ethereum’s recent price drop and $1B outflow - AMBCrypto News",
        "content": "Ethereum recently saw over $1 billion outflow from exchanges.\n\nETH’s price has increased by over 1%\n\nEthereum [ETH] has been experiencing a decline in price over the last few days. However, despite these declines, the exchange outflow and accumulation metrics have been moving in opposite directions. What does this mean for the ETH trend?\n\nEthereum takes hits\n\nAn analysis of Ethereum’s price trend on a daily time frame showed that it experienced its biggest daily decline in over a month on 11th June.\n\nThe chart indicated that its price dropped by almost 4.6%, falling from over $3,600 to around $3,500. This decline marked the peak of the capitulation that had been occurring over the last seven days.\n\nThe analysis showed that these declines pushed Ethereum into a bear trend, as its Relative Strength Index (RSI) fell below the neutral line. As of this writing, the RSI remained below the neutral line.\n\nAdditionally, the price has seen a slight recovery with an increase of over 1%, trading at around $3,500. The short moving average (yellow line) continued to provide support at around $3,300.\n\nWhales continue to accumulate Ethereum\n\nAn analysis of whale addresses on Santiment showed that these addresses have continued to accumulate as Ethereum’s price declined.\n\nThe chart indicated that the number of addresses holding 10,000 to 100,000 ETH rose from 1,040 to 1,049 as of this writing.\n\nAdditionally, the data revealed that whales had bought over 240,000 ETH, worth around $840 million, since the decline started.\n\nEthereum sees massive outflow\n\nAdditionally, the volume of outflows saw a recent spike, particularly from Coinbase, according to CryptoQuant data.\n\nData showed that Coinbase experienced its highest outflow of the year, with over 336,000 ETH leaving the exchange. The value of this outflow was approximately $1 billion.\n\nAn analysis of Ethereum’s netflow showed that outflows have dominated in the last few days, with some notable spikes.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAt the end of trading on 11th June, the netflow was -307,000. As of this writing, the netflow remains negative at around -27,000.\n\nThese metrics indicate that more traders are buying ETH as its price declines."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQeWJvRWlzZ2pfbWFkN25tZTBVb3dRTFoxdnFFTGxUTGRZSjZ4RnJ6OUkxQm16azI0V05MSlQtSmtHX1NxVkEySHZzMkp2dTJjcXhyblc1MmRzTklLdGV3MnVsRlkxZnVuTmdKZWlWZjJ4cHY2R1ZLSkJQcW8ySTR0OUl0SlVsN0dFRzM2OVFjMjVHTWFRdE5OTXowS3N5Rmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum whales activity announces a powerful bullish rally! - Cointribune EN",
        "content": "Thu 13 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum (ETH) ecosystem has recently attracted attention with significant activity from whales. This increased activity coincides with an anticipated rate cut in the United States! These two combined events herald an imminent Bull Run for crypto.\n\nCrypto: The Incredible Activity of Ethereum Whales!\n\nAccording to data provided by Santiment, whales have added more than 240,000 ETH to their wallets! This represents a value of over 840 million dollars in the past 48 hours. Additionally, +336,000 ETH were withdrawn from Coinbase in the past 24 hours, suggesting anticipation of a price increase!\n\nThe activity of Ethereum crypto whales\n\nThese massive capital moves are often the prelude to major bullish trends. Because, crypto whales and institutions are generally well-informed and positioned to capitalize on market fluctuations. Furthermore, the continued decline in Ethereum supply on centralized exchanges, reaching multi-year lows, reinforces the hypothesis of an imminent bull market.\n\nThe Rate Cut in the United States, a Precursor Sign of a Bull Market?\n\nThe analysis of Ethereum prices is all the more relevant as interest rates in the United States could be revised downward. Peter Brandt, a seasoned analyst, indicated that this is not the ideal time to speculate against Ether. Moreover, with the weakening of the US dollar against global currencies and increased crypto speculation, Ethereum could reach new historical highs.\n\nThese developments are crucial for investors and traders who monitor whale movements for market trend clues. The ability of whales to influence crypto market trends and liquidity is well documented. Moreover, their recent activity is a strong signal for those seeking to understand the complex market dynamics.\n\nThe activity of Ethereum whales and the possible rate cut are clear indicators of growing optimism in the market. Institutional investors and whales seem to be betting on a significant appreciation of Ethereum, which could lead to a period of prosperity for ETH holders and market participants.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxOZjIwVEZjVXZkaHp4bTFTczl3TTlyaWJEUENsRmN6RkhmUURLQnluOTFsSVlGUG9UWlQxSG5mX3NpU21JY0E1LTI1YThpRHdkX0hJS28tcXlYZjhTd0p1TVV5dVVBRDlJRllPWjV5SVpDVHA4akVucEhoRTZVbWtaYlpuamVCekFoTl9hWHNVZ2szemFxU1pXUXpSZHFxcWpxeU9BVVhrc2NfVXlmRTBwY0VyX2Vla0NBdEJQYnExRFJCcHAySEFHbVJQdjlOQ2VCekNKZXFadWdnaklUbmk0clBiMU14Z0xtUEd0dWhn0gHzAUFVX3lxTE5CMzRyTFdtaDRkdkpKWEdISlhzSF9TRERaU0NEd0x0OW9CUjBYNTl4VUFsd3JHaGJHTnZVeUE1M3QxaGNWQVZmTHpFN2NJcnh4R2VsV2hleTlzRGVKZ0lqc0hLYkl2M2dOaVNyeDJyMGdsQW85VU00dkdEQ2FnZXB4MEJrUk9IZWlNWnN4dFZjb1R0TG1tSHgzUVZHcUZDdkNhelZTa3hLMlBuS3Y4c0hiR016bzE4Zy1xTmJzWjE0NWdsQVl2Mld6ZXBrazBTVEtVTlZ6eDJzb3NHNkx5a0s2WWdMa1J5NjB2LW5tOTMtXzVScw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin braces for potential short-term correction - FXStreet",
        "content": "Bitcoin price daily candlestick closes below the weekly support level of $67,147.\n\nEthereum price is weakening and could retrace to its immediate support at $3,321.\n\nRipple price fails to close above the 50-day Exponential Moving Average.\n\nBitcoin (BTC) price may initially dip before experiencing a rally, and Ethereum (ETH) and Ripple (XRP) are likely to follow suit, dipping before their potential rallies.\n\nBitcoin price could sink deeper amid corrective mode\n\nBitcoin price daily candlestick closes below the weekly support level of $67,147 on Thursday.\n\nBTC could have a short-to-mid-term downward correction in the coming days, tagging the midpoint level of the price imbalance between $63,118 and $64,602 at $63,813.\n\nThis midpoint level also roughly coincides with the 50% retracement level at $64,240, calculated from the swing low of $56,523 on May 1 to a swing high of $71,994 on May 21.\n\nIf BTC bounces off $63,813, it could rally 12 % to reach its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if BTC breaks and closes below its daily support level of $60,800, the bullish thesis could be invalidated, leading to a 4% crash, its weekly support level of $58,375.\n\nEthereum price gears up for further downward adjustment\n\nEthereum price crashed 11% in the last seven days as it failed to close above $4,000.\n\nETH could have a short-to-mid-term downward correction in the coming days, tagging in the $3,279, the 61.8% Fibonacci retracement level, calculated from the swing low of $2,864 on May 13 to a swing high of $3,984 on May 27.\n\nThe $3,276 level roughly coincides with the midpoint of the price imbalance between $3,146 and $3,498 at $3,321.\n\nIf ETH bounces off $3,321, it could rally by 20 % to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nHowever, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 9% crash to the previous support level of $2,600.\n\nRipple price braces for a correction\n\nRipple price declined 4% on June 7 and made a daily low of $0.450 after failing to close above the 50-day Exponential Moving Average (EMA) at around $0.527.\n\nRipple price could have a short-to-mid-term downward correction to its recent low at $0.450.\n\nIf this support level holds, XRP could rally 1 % to $0.519, the 50-day EMA level.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple daily candlestick closes below $0.450, XRP could crash an additional 7% to its previous support at $0.419."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNXZucUx3VUVKTS1sSVcxOG5MQ0VmX2pYSEVuMHpQV2NKemhONFkxeV9BYUpDVWxva1RCRmV1YzRmRTAtT3hkdGNDMG8tQTRES0dBZnIzanl6R1ZEczVMYVQ1MzVRWDJUc2RNUGFLZXVZRTI2Sy1FZk1FR2RmdXhXblpIYzZ3VkxSQnBZWkxINGRoRDBTOWRUNVYxMjLSAaIBQVVfeXFMTmx6TlRYWVRNTTdhQ3l5cEFkU2JDcmpaQ3lMWUVjckxRcE95NUhQNGNUTkVERk9hNmJLeS16bUdRZVlabmVEUmlmazFjdE5MUzlTMzZDX1FLN2FNY1JJVjhsLS1ZX1ZBRHlOdG9IdG5EZm9RUU9idmhSWTRHU3RnRi00aUt1enB0enliNTdQUDJ0dFJUWTFpM3JpX0NUUnFISy1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Altcoins: Shiba Inu, Chainlink, Ethereum Exchange Reserve Plunges, Price To Recover? - CoinGape",
        "content": "In latest developments, the top 10 exchange wallets for altcoins like Shiba Inu (SHIB), Chainlink (LINK), and Ethereum (ETH) have seen a significant decrease in their holdings since May 27, 2024. To be specific, Shiba Inu’s exchange supply has shrunk by 2.4%, Chainlink by 2.9%, and Ethereum by 8.6%.\n\nMoreover, such reductions in exchange reserves are generally interpreted as bullish indicators by traders. Hence, a potential for price recovery could be witnessed for SHIB, ETH, and LINK. Currently, all these cryptocurrencies are grappling with a downtrend.\n\nadvertisement\n\nShiba Inu (SHIB) Price Analysis\n\nAt the time of writing, the SHIB price was $0.00002175, up by 0.38% on Friday, June 14. This price movement places Shiba Inu at a pivotal point, encountering a significant barrier at $0.000022. If Shiba Inu can surpass this resistance, it may climb to $0.000025, with the possibility of reaching $0.00003.\n\nOn the other hand, increased selling pressure could push Shiba Inu down to $0.000021, and it might fall further to $0.00002 if market sentiment deteriorates. Whilst, technical analysis indicates that SHIB might be entering a consolidation phase. The MACD indicator reveals a convergence towards the signal line, hinting at a possible slowdown or reversal in momentum.\n\nWith the MACD line currently beneath the signal line, it signifies weak bullish momentum. Currently, the Shiba Inu RSI is at 37, suggesting a neutral market stance, as SHIB is neither overbought nor oversold. However, the RSI is nearing 30, which signals a oversold condition is looming. In the aftermath of such conditions, the price generally rebounds.\n\nMoreover, the reduction in Shiba Inu supply due to decreasing exchange reserve and frequent burns could also catalyze a rebound. On the flip side, most oscillators and moving averages on the daily chart are issuing sell signals. The 50-EMA being above the 20-EMA suggests a potential downward trend.\n\nAlso Read: Shiba Inu Coin Bull Run Ahead As SHIB Burn Rate Spikes Further\n\nChainlink (LINK) Outlook\n\nAt press time, Chainlink is traded at $15.32, down by 0.90%. This decline has triggered long liquidations, which account for over 95% of total liquidations, signaling a short-term price decline. However, the diminishing exchange reserve could lead to a rebound in the long term due to a reduced supply.\n\nAs exchange supplies decrease, it often points to accumulation by investors, which can drive prices up as supply dwindles. Moreover, the Chainlink price has sustained a profit of over 14% in the last 30 days despite the recent bearish turn. Hence, it could mirror the momentum for a reversal as the LINK open interest has also surged.\n\nEthereum (ETH) Prospect Following ETF Approval\n\nAccording to Santiment, Ethereum’s exchange supply has seen the most significant reduction among the three cryptocurrencies, dropping by 8.6%. This substantial decrease is viewed positively by bullish traders as it may indicate strong accumulation and potential for future price increases.\n\nRecently, Ethereum’s market narrative is also being shaped by regulatory developments. Crypto analyst Michaël van de Poppe highlighted a statement from SEC Chair Gary Gensler, suggesting that an Ethereum ETF might be listed during the summer. This anticipation signals a final correction before a substantial price surge, according to Poppe.\n\nThe approval of Spot Ethereum ETF S-1 filings is expected to have a profound impact on ETH’s price. It could potentially push the ETH price above $4,000 immediately after the ETF listing. Furthermore, Standard Chartered has projected that this development could even drive Ether’s price to exceed $8,000 by the end of the year. Such optimistic forecasts are underpinned by the expected influx of institutional investment following the ETF’s approval.\n\nAlso Read: Whale Heavily Bags SHIB, ETH, CRV, & Others, What’s Next?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQXB4Zzh6SktUMHJpaXNsZFNWMzlERF9UWkRGSkE0eEp1U3NNRGQ2REtrNnZvVVA4OGs0WmU3d1B2NExjMnk2N2FHeDgtVG1kLUhPR3dsa2pPSnFpWFAzcV85NHJYYms2RU9KdEwyS2N5Mm1MUTFGWWRFU3NCVDFCVTNPOGozd9IBiwFBVV95cUxPN0EzUUlGdHZfbmdiTXNwTG5yNG00SmhJQjhoNmdhclA3cGpKYWtLdHhUZ1FhX2x0STc5dkZEbjZBUkZJV1cwcFh0bUhjaTRkdmprTVBDZGUtYjVYUWdMQTNsSWNjTWpHdjhzaHhwUkVmR1p5QXdZMURpdkZ6OWNtVVBjS285cDh2TVh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum saw long liquidations worth $62M in 24 hours - AMBCrypto News",
        "content": "ETH’s long traders have witnessed significant liquidations in the past 24 hours.\n\nThe coin’s options volume and Open Interest have also declined.\n\nEthereum [ETH] witnessed a spike in long liquidations on the 11th of June, according to Coinglass.\n\nInformation from the derivatives market data provider showed that the altcoin’s long liquidations on that day represented its highest since the 23rd of May.\n\nIn an asset’s derivatives market, liquidations happen when a trader’s position is forcefully closed due to insufficient funds to maintain it.\n\nLong liquidations happen when an asset’s value drops unexpectedly, forcing traders with open positions in favor of a price rally to exit.\n\nOn the 11th of June, ETH long liquidations totaled $62 million, while short liquidations amounted to $7.3 million.\n\nDecline in ETH’s derivatives market\n\nThe past 24 hours have been marked by a decline in ETH’s derivatives market activity. For example, the total volume of trades executed in the altcoin’s options market has dropped by 52%.\n\nDuring that period, options trading volume totaled $321 million.\n\nA decline in an options trading volume suggests fewer participants are buying or selling options.\n\nWhenever fewer trades are completed in an asset’s options market, it becomes less liquid. This often results in wider bid-ask spreads, making it potentially more difficult for participants to execute trades at desired prices.\n\nIn addition, the coin’s Open Interest has also dropped. At $15.73 billion at press time, it has fallen by 2% during the period under review.\n\nAn asset’s Open Interest measures the total number of outstanding contracts or positions that have not been closed or settled. When it declines, more traders exit their positions without opening new ones.\n\nHowever, despite ETH’s price decline in the past 24 hours, the ensuing long liquidations, and a drop in options volume and Open Interest, its Funding Rate across cryptocurrency exchanges has remained positive.\n\nAt press time, the coin’s Funding Rate was 0.0069%. For context, the last time ETH’s Funding Rate was negative was on the 3rd of May.\n\nFunding Rates are used in perpetual futures contracts to ensure the contract price stays close to the spot price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nWhen an asset’s Funding Rate is positive, it suggests a strong demand for long positions.\n\nThis means more traders are buying the coin expecting to sell it at a higher price than those purchasing it in anticipation of a price decline."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOZVJZaDl6cDlweVFCQXdubFhZVEp5OVg4dWlMR0FjVGpzX0Y3aldtM04taUVtTkFmcFhwSGFMZ0J6ZVpNMXVSdEU4UGRENzJ6bU5DMFcxT2V6R29GWmp1aHZ5ck1adjgxVVg3MTVRZDJvWEtoRzdDMkFtN2JGSWZSbXMwR0RQNDctVGpiak10Y2FQTGY4S3pKd3dqbkfSAaQBQVVfeXFMTTFPVGhha2lZM0VZSXdCT3BlSmZVZFZ6OG5vXzQ0aFFUdFdBWHdWeGRnZmhFUzVVSlJKTnZqSGFhdkRadmx1MFRfSFJvSVU2anppSzlSdzRZWVp0dHNDWDJZUmVCUmZ5ekx3NnZGYko2alVDNHZURm1qM1VpeS1tZzVzeEhyZGx3U0FkT0ZyNzNpbnR4ME95Ry1wRXN0d1ljVTJSYlY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Notcoin Posts 10% Gain as TON Daily Active Wallets Match Ethereum Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTelegram-based clicker game Notcoin (NOT) is the top gainer out of the top 100 crypto tokens, after leaping 10% in the past 24 hours. This comes amid The Open Network (TON), the blockchain that Notcoin uses, matching Ethereum for daily active wallets.\n\nNotcoin has racked up a player base of 35 million users, hitting a peak of five million daily active users back in March. But it wasn’t enough for TON to flip Ethereum’s daily active wallets. It wasn’t until May 17 when TON flipped Ethereum for the first time.\n\nThe two networks traded places a couple of times until June 2 when TON led the charge for nine consecutive days, according to Artemis Terminal. Since June 10, the pair have been neck and neck. At the time of writing, TON is currently trailing by only 4,000 daily active addresses.\n\nIn turn, TON is up 5% in the past 24 hours and 5.5% over the past week, according to CoinGecko data.\n\nAD\n\nAD\n\nThe Open Network has had a good 2024. After the success of Notcoin, a slew of new Telegram-based games launched. And the team has said it has plans of releasing a token on the network.\n\nRecently the clicker game Hamster Kombat hit 100 million players, claiming the crown for the single largest Telegram channel. Now the game is planning a tentative token launch in July, which will see players convert in-game points to crypto tokens.\n\nTapswap and Yescoin are two new Telegram games looking to launch tokens on TON. The former, which claims 50 million players, previously offered Solana wallet integration but is now looking to launch its token on TON. While the former, Yescoin, is looking to bring its 18 million users to The Open Network, with over 6 million already connecting their wallets.\n\nThis explosion of new games launching with tokens on the horizon has led to TON becoming the 10th largest crypto token by market capitalization, according to CoinGecko, beating out Cardano for the spot.\n\nAD\n\nAD\n\nEdited by Stacy Elliott."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNWm5uWmphSTBpbG5IRjRheUNSS19lZ3hjWkJaVXlWMncwdVBwNVpCVm1obThFS2s3dEEzNGtTMVpvblFkU3M2MHJyb3RVQ29sbWlzbmtUN1ppeElhclB4TTE4bXVtbDRmMUtmYXZFZ2Y4Yi1oN2gzanU3eEp5UTBnb185eUxidnExeGpPdjZNa3RYVWU4WDEzbXVIOWVTNko0b25OejFWdzg1c05jLXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "L'ICBC élève Bitcoin au rang de l'or et Ethereum à celui du pétrole - Cointribune EN",
        "content": "Thu 13 Jun 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nThe world of cryptos has just taken a new decisive step: the Industrial and Commercial Bank of China (ICBC), the largest bank in the world by assets, has recently compared Bitcoin to digital gold and Ethereum to digital oil. This statement, coming from a leading financial institution, marks an important recognition of the significance and potential of cryptocurrencies in today’s global economy. By highlighting the unique qualities and distinctive roles of these two digital assets, ICBC draws attention to their growing place in an ever-evolving financial landscape.\n\nICBC elevates Bitcoin and Ethereum to the rank of strategic resources\n\nThe Industrial and Commercial Bank of China (ICBC), the largest bank in the world by assets, recently released a groundbreaking report that compares Bitcoin to digital gold and Ethereum to digital oil. This report marks a significant step in the recognition of cryptocurrencies by traditional financial institutions. According to the ICBC report, “Bitcoin retains the scarcity similar to that of gold by mathematical consensus, while solving its problem of being difficult to divide, difficult to identify authenticity, and uncomfortable to transport.” This statement highlights the transformation of Bitcoin, which has evolved from a mere potential currency to a robust and valuable financial asset.\n\nAt the same time, ICBC calls Ethereum “digital oil“, emphasizing its central role in powering Web3 applications and programs. The report states that “Ethereum has continuously upgraded its technology in terms of security, scalability, and sustainability, providing the technical power for the digital future.” This recognition illustrates the growing importance of Ethereum in the global digital ecosystem, serving as a crucial platform for innovations and decentralized applications.\n\nTowards a new era of financial recognition\n\n“The monetary attributes of Bitcoin are gradually weakening, while its asset attributes are constantly strengthening.” The ICBC report also highlights the growing importance of Bitcoin in today’s global financial system. By emphasizing its scarcity and robustness as an asset, the bank shows how Bitcoin has evolved to become a store of value, comparable to gold in the physical world. This analysis confirms the gradual transformation of Bitcoin’s attributes, where its qualities as an asset are constantly strengthening at the expense of its initial monetary attributes.\n\nThe ICBC report also highlights the crucial role of Ethereum in the digital economy. Analysts explain that “the introduction and development of stablecoins provide a bridge for the digital currency market to connect to the real world.” This functionality positions Ethereum as an indispensable platform for decentralized finance (DeFi) applications and non-fungible tokens (NFTs). By facilitating the connection between the digital market and the real world, Ethereum enhances its utility and relevance in the global financial landscape.\n\nEthereum’s innovative technology is also highlighted by ICBC. The report underscores Ethereum’s capability to enable the creation of complex smart contracts via its virtual machine (EVM) and programming language (Solidity). These technical innovations have allowed Ethereum to become the backbone of many decentralized applications, strengthening its role in the future digital infrastructure. By continuously improving its security, scalability, and sustainability, Ethereum positions itself as a robust and reliable platform for future applications.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZzktaW1mR2hRS3dvb0tNaWY1aW5NZjN2Z3dueUlKNjdPLXUtT19ZaC1tUGw1emY5YlEwcGdVWDZkMFd5SnhfZ3hSU2tfU3dCeEFKLWphNW14cmtHOGtDQk5aZDhPUUx6c2ZlWHBHazFsczM1YTd5RzZxVmo3RjdWYUNKME1LUF9DOC0w0gGQAUFVX3lxTE9FajgxdGJyT1N5dzdpR1VQVnNFQVNMeVRCX3ljWGZRWkxpclJ5c1U0YlJxbGViTk9FSUxnMjY0Rl95MHMyZm93c2tRR3BpblRIeE5nLWEwRnRPZkVNektsVklFWWJ4NUFJdXlHcWg0b1V3SXNmc2I0cEtZMEQ4NERMVEw4OHotUnVXa1ZvWFYzRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Toncoin over Ethereum? Why TON could be your best bet in June - AMBCrypto News",
        "content": "Toncoin has seen more daily active addresses than Ethereum since the beginning of the month.\n\nTON’s weighted sentiment was positive for the first time since June started.\n\nToncoin [TON], the blockchain network linked to the popular messaging app Telegram, has seen more demand than the leading Layer 1 blockchain, Ethereum [ETH], since the beginning of June.\n\nAccording to on-chain data provider Artemis, the number of unique addresses that have completed at least one transaction on Toncoin has exceeded that of Ethereum for ten out of the last 12 days.\n\nIn fact, on 3rd June, the daily count of unique addresses on Toncoin surged to a year-to-date high of 568,300, surpassing Ethereum’s 351,400 by 62%.\n\nFurther, due to this, the daily count of unique interactions on both networks has differed considerably. According to Artemis, Toncoin has recorded more daily transactions than Ethereum every day since 12th March.\n\nOn 17th May, Toncoin’s daily transactions count rallied to a year-to-date high of 9 million. On the same day, the number of unique transactions completed on Ethereum totaled 1.1 million.\n\nIn a post on X, research firm Delphi Digital referred to this as the “flippening.” According to Delphi Digital, the surge in the daily user activity on Toncoin over Ethereum has been “fueled by Telegram’s 900M user base.”\n\nTON puts holders in profit\n\nAt press time, TON exchanged hands at $7.65. After plunging to a two-month low of $6.76 on 11th June, the token’s price rebounded and has since surged by 11%.\n\nTON has seen considerable trading activity in the past 24 hours. Totaling $491 million as of this writing, the altcoin’s trading volume during the period has increased by over 100%, according to CoinMarketCap.\n\nThe 9% price spike witnessed in the last 24 hours has led many of TON’s holders to record profits.\n\nAMBCrypto assessed the altcoin’s daily ratio of transaction volume in profit to loss. At press time, the metric’s value was 14.22, the highest level since February.\n\nThis suggested that for every TON transaction that has ended in a loss, 14.22 transactions brought about a profit.\n\nIs your portfolio green? Check the Toncoin [TON] Profit Calculator\n\nFurther, the token’s weighted sentiment was positive at press time, as revealed by data from Santiment. This marked the first time TON had recorded a positive weighted sentiment since the beginning of June.\n\nAs of this writing, the altcoin’s weighted sentiment was 0.75, suggesting that the discussions around TON on social media platforms are predominantly positive."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPQno5eTEyLUgxWVdhMGU2NGJMekN1bXVlbTdhdmJfWFJuZ0w5RFp1NXlWOFc1NFRqQmd3dWRreHA0TnRQTXRNZTMxUENsaDk4YkxYQ2VzOFdxOVUtRGdPaFQ0Zk9ON1NXaHU4LVdnVjh4eElCdnAzWUdOQ2ZCY3FnUmRrcW7SAZIBQVVfeXFMTUtveHc0Ym9qRWVnSmN0OC1hTDBtT0RJeERNekFEYkEzVTlpMWZrMVI1SnI3ZFVHVmJna2ZmY1RNNTRRQWNWWFRmbDUySDh1Zm1qM2RnQ1MzQUM4NkdGNTZEMTBZb1F6YlhZMm5TMzV4VUFuU2szUE5lNkQyMF85YnBxZWZsZ004NzlmWURKV3RzLWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: June 14, 2024 - Analytics Insight",
        "content": "Support Levels: Ethereum found some support at US$3,430. 49 level, to inmates ranging from buyers who always intervene in defence of enormous downward Ethereum price slips.\n\nResistance Levels: The US$3,657 to US$3,713 range continues to present resistance, where selling pressure has capped immediate upside movements."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNcXc1djZrMkJVeG56bkdhdUV1elN5TFZ3X1d0eFE5ZkxGNC1sR3IzUUhXV0RaSUQ3MjJ0RDE3Z0NDYzNTUEZKcnYzR3RZUVkzbnpaZzd4RERSdmloRXlWbDJsX2puN0VRMjd1bUw1dTlsc0s4Nk5GX3JCN1lpNU9FM2x1dzZNSG01QkZyNUpQd9IBlAFBVV95cUxNOGdCV05YWHYwaWlza1A2eDN1NzBINm42bDdndWdTdGxQTE9wMjRPVF9wZ0UwQzJQY2lYay1YN25WZk1hOWpQSkFfeWxxWVVLR0lSUkJ0X1l2bktIWGJlMmN4djNIR3hCV2phSzh4cUtpc2dEdHlrcjFTeXg0YUl5SGFvSy04c2xlWkJubzNJNGZqVDJU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Aethir Ethereum launch sends ATH token soaring 100%, details here - AMBCrypto News",
        "content": "Aethir has launched its decentralized cloud computing network on the Ethereum mainnet.\n\nThe value of its ATH token may plunge in the short term.\n\nAethir, a decentralized physical infrastructure network (DePIN) provider, launched its decentralized cloud computing network on the Ethereum [ETH] mainnet on 12th June.\n\nThe protocol allows users to rent high-performance computing resources needed for training artificial intelligence (AI) and rendering digital content.\n\nThis service is crucial for organizations that require significant computational power as it offers flexibility and scalability for their operations.\n\nAethir’s mainnet launch comes with a native token, ATH.\n\nATH is required for governance and security within the Aethir ecosystem, staking on the Ethereum network, and payment to compute providers through Arbitrum [ARB].\n\nThis mainnet launch comes seven months after its testnet launch on 7th November 2023 on Arbitrum, a layer-2 scaling solution for Ethereum.\n\nIn its announcement, Aethir confirmed that its user base exceeded 500,000 on its testnet, and it completed a $146 million node sale.\n\nATH pursues new lows\n\nFollowing ATH’s launch, its price skyrocketed by almost 100% before correcting. At press time, ATH exchanged hands at $0.073. According to CoinGecko, its price has declined by 14% in the past 24 hours.\n\nIts daily trading volume totaled $261 million during that period, rising by 38%. The opposite movements of ATH’s price and trading volume indicated the presence of significant bearish sentiment in the token’s market.\n\nWhen an asset’s price declines while its trading volume surges within the same period, it signals a spike in selling pressure. This means that most token holders are looking to sell their positions, hence the downtrend in the asset’s value.\n\nAn assessment of ATH’s key technical indicators on an hourly chart confirmed the steady decline in the demand for the altcoin.\n\nFor example, its Relative Strength Index (RSI) and Money Flow Index (MFI) were 44.88 and 34.85 at press time.\n\nThese indicators measure an asset’s overbought and oversold conditions by tracking its price momentum and changes. At these values, ATH’s RSI and MFI suggest that market participants prefer to sell their holdings rather than accumulate new tokens.\n\nThis trend was confirmed by ATH’s Chaikin Money Flow (CMF), which measures the flow of money into and out of its market. As of this writing, this indicator’s value was -0.23.\n\nA negative CMF value is a sign of market weakness. It signals liquidity exit from the market, a precursor to further price decline.\n\nIf ATH’s selling pressure continues to increase, its price might decline toward $0.048.\n\nHowever, if the bulls re-emerge and token accumulation begins to climb, ATH’s value might rally toward $0.078."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONnlSenVEWUlTakxoXzJUUHNTUy1BLWJSbzBPWThLS0hveFhfUEsxUUlhUnlzRGxjTVhidVRrbkd1TmRDcFFFVDhqdkNFQzM4anFaMndqQVpUa1NuOE5NNmRDVXJaTDVPMXZPRzhqSjlCOU4wSjVkY0luNHhlU0ZhY0FMaXLSAZIBQVVfeXFMUEZTcTZfd2dlNGVoX2oybWc0ZnpDZm00RERqTVFveHBLWVVoeXgxM1ZKVXVFV3NRMmxlQkdnYTBsTWxEeUZZdElsRGRGTGVEa2hQU1ZTQUhTOERkQzhOaVNBay1fTGtQUkkyUl9tSlk4SXJ6OHlGSk8wZXB0MzF6bUc2UmJJZGhNdC1IOS0tWnZQYkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: June 13, 2024 - Analytics Insight",
        "content": "The network allows enterprises, data centers, cloud providers, and cryptocurrency mining operators to contribute idle GPU resources to Aethir’s GPU-as-a-service solutions network.\n\nCo-founder Mark Rydon highlighted the significance of the mainnet launch, stressing that it would facilitate more innovation in AI, ML, and cloud gaming.\n\nWith the launch on mainnet, high-quality enterprises gained the opportunity to contribute to the Aethir network , thereby enhancing access to the existing supply of GPUs.\n\nEnterprises and developers could rent compute resources from Aethir's network of providers to support tasks such as training AI models and rendering digital content at scale."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNS1hmSU01Znd0Z2lnRWxmRkZyV012QkVGQ3htNDY5MGZxc3FJaHJIQXdUa3dsX2dZTUhpWkVuSFhBUFNlU2lkTzBXMXRRZDFpYjB2T0tjcFF5Q1owd192aWhUSFBDZWl5SlBwSGRqUVB2bWU4VHNmZTdDU3hYdGJqMzJGY0FHaWFvNkd2b2RlNDNkeEXSAZgBQVVfeXFMTlFaejVFbEdVaV9HbkhZVk5mcERRMWUyTnpNdVFVZnNaVE1zR08zdFlpX2IxZk1VeDBQMnlYZkdmUWFJa1FfLS1uakp6dlktRWxidThxZHRydHdnSnQ1VHFwaF9lSnFqa1phaU5zQTEzNXAtbWE5WXprYVVsVUpVR0lIWm93UDlxeUdaYVhOT3ZSQlZnN0JJZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum staking: How MetaMask’s new offering stacks up against Lido - AMBCrypto News",
        "content": "Lido leads Ethereum staking with over 27%.\n\nMetaMask has launched a new staking feature similar to Lido’s\n\nEthereum [ETH] staking has gained popularity ever since the network transitioned from Proof of Work (PoW) to Proof of Stake (PoS). Numerous platforms have been offering staking services for retail stakers, and recently, MetaMask has joined the fray by providing its staking services.\n\nNew Ethereum staking feature unveiled\n\nIn a recent development, ConsenSys announced that MetaMask is launching a pooled staking feature for its users. This new feature will allow Ethereum holders to stake their holdings without needing the standard volume required of validators.\n\nEthereum staking usually involves locking up 32 ETH, which is currently valued at approximately $112,000.\n\nHowever, MetaMask is not pioneering this feature. Platforms like Lido and Rocket Pool have long provided similar staking opportunities.\n\nLido, for instance, offers stETH in return for staked ETH, allowing holders to use stETH for additional activities. The option was not part of the ConsenSys offering. Also, according to their announcement, this service will not be available in the US and UK.\n\nLido leads Ethereum staking\n\nMetaMask’s pooled staking will be supported by Consensys Staking. According to an analysis of data from Dune Analytics, Consensys ranks 28th among staking platforms.\n\nThe data revealed that it currently manages approximately 101,000 ETH and operates around 3,000 validators.\n\nFurther analysis showed that over 33 million Ethereum has been staked as of this writing, representing 27.56% of the total ETH supply.\n\nThe study also indicated that Lido holds a 28.76% share of the staked volume. This equates to about 9.5 million ETH staked with Lido, supported by around 297,000 validators.\n\nThis makes Lido the platform with the largest share among Ethereum staking platforms.\n\nNew Ethereum stakers drop\n\nAnalysis showed that although the total value of Ethereum staked has been increasing, the number of new stakers has been declining.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAn analysis of new depositors on CryptoQuant showed a notable drop in the last few days.\n\nThe chart indicated that as of 9th June, the number of new daily depositors was over 3,700. As of this writing, the number has dropped to around 540."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE51c3Vsd2NDLUw1dEZQR19mb1g4ZVdOcTl5Y0VLM3A2VFhyYVJTQ1Raa2l2TjE4UDhHa09zSHAxVkFJOW1PTXI2QUJwalBsR2Z2LWNEOU5MT2NZR29KNTBwbk41b1VkWG0weE13N25GOWtSZlHSAXhBVV95cUxQUnhNTEVsYWxDTUpnLU1pemItRE55UjgwOEhuT0ZfVVROc2dNMWNiaXF6Ti1CME5RQmFNdWhvb0tHLS1wS040TGlkT3ZmSHFZbjhEaHJHLWpNUXVGb3pfNzZ3VmVtcDg2WTNXdkQyRHVmSm1aN1lFZFQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 03:29:57 GMT",
        "title": "Ethereum Price Decline: Market Indicators Point to More Dips - NewsBTC",
        "content": "Ethereum price struggled to clear the $3,650 resistance. ETH started another decline and there is now a risk of more dips below the $3,420 support.\n\nEthereum started a fresh decline below the $3,550 support zone.\n\nThe price is trading below $3,540 and the 100-hourly Simple Moving Average.\n\nThere is a crucial bearish trend line forming with resistance near $3,550 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend losses if it stays below the $3,550 resistance zone.\n\nEthereum Price Struggle Continues\n\nEthereum price failed to start a recovery wave above the $3,550 and $3,580 resistance levels, like Bitcoin. ETH remained in a short-term bearish zone and extended losses below the $3,500 level.\n\nThe price declined below the $3,450 support level. A low was formed at $3,428 and the price is now consolidating losses. There was a minor increase above the 23.6% Fib retracement level of the recent decline from the $3,655 swing high to the $3,428 low.\n\nEthereum is still trading below $3,550 and the 100-hourly Simple Moving Average. There is also a crucial bearish trend line forming with resistance near $3,550 on the hourly chart of ETH/USD. If there is a fresh increase, the price might face resistance near the $3,540 level and the 50% Fib retracement level of the recent decline from the $3,655 swing high to the $3,428 low.\n\nThe first major resistance is near the $3,550 level and the trend line. An upside break above the $3,550 resistance might send the price higher. The next key resistance sits at $3,650, above which the price might gain traction and rise toward the $3,720 level.\n\nA clear move above the $3,720 level might send Ether toward the $3,800 resistance. Any more gains could send Ether toward the $3,880 resistance zone.\n\nMore Downsides In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could continue to move down. Initial support on the downside is near $3,420.\n\nA clear move below the $3,420 support might push the price toward $3,350. Any more losses might send the price toward the $3,250 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,420\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNZDVHWE4tc2N6R0Z0X0dheEpjLWFDYUd3Zmg4VDI2Um9uX29nQVZqeFl6dVdhRWhHVDJiT0hiWDNHUmI2M1FJRFJnV2NrZWFFYk5KQVVHTGQ5cHZMaG9CTWxzN0xkT0o1dll5dnE0dXYtSGlZVHZla055Y2tyQ0hvM1FnR1phUWlLcks4QU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "TON surpasses Ethereum in daily active users; What’s next for Web3 - Finbold - Finance in Bold",
        "content": "The Open Network (TON), originally developed as Telegram Open Network to enhance the popular messaging app, has outperformed Ethereum (ETH) in daily active addresses throughout June.\n\nDespite Telegram stepping back due to regulatory issues, an independent community has driven TON’s growth, leveraging Telegram’s 900 million users and integrated crypto wallet.\n\nDelphi Digital highlighted TON’s impressive growth in a recent post on X (formerly Twitter), noting that TON’s daily active addresses have surpassed Ethereum’s.\n\nThe Flippening CT ignores 🔍\n\n\n\nTON's quiet growth, fueled by Telegram's 900M user base, has driven its daily active addresses above Ethereum.\n\n\n\nAt its core, TON is a bet on Telegram's distribution. Though the ecosystem is nascent, its early growth is promising. But is it enough? pic.twitter.com/k2b2SMiQJD — Delphi Digital (@Delphi_Digital) June 10, 2024\n\nThey attributed this achievement to Telegram’s massive user base but questioned whether TON’s growth could be sustained long-term to permanently surpass Ethereum.\n\nTON and Ethereum compete in active addresses\n\nDaily active addresses (DAA) are defined by Artemis as the number of unique wallets engaging in transactions on a blockchain each day.\n\nDaily active addresses and daily transactions in Ton and Ethereum networks. Source: Artemis\n\n\n\nSince May 17, TON and Ethereum have been closely matched. However, TON gained an edge at the beginning of June, surpassing Ethereum on 10 out of the first 11 days.\n\nOn June 3, TON reached a record 568,300 DAAs, a level Ethereum hasn’t seen since September 13, 2023.\n\nDespite these impressive figures, Ethereum has been actively pushing transactions to layer 2 scaling solutions, which have attracted significant user activity.\n\nOn June 11 alone, three of Ethereum’s top layer 2 solutions—Arbitrum (ARB), Base, and Optimism (OP)—boasted a combined 1.3 million daily active addresses.\n\nFactors driving TON’s surge\n\nThe recent surge in activity on TON is driven by an ecosystem of mini-applications, including chatbots and games.\n\nNotcoin, a free game on Telegram with over 35 million users, launched its cryptocurrency NOT in May, reaching a market cap of $2.1 billion. Other popular games like Hamster Kombat and Catizen have nearly 33.6 million and 3.6 million users, respectively.\n\nTelegram also hosts TON-native trading bots like sTONks, which are expected to enhance the user experience for traders. Additionally, the introduction of Telegram Stars, an in-app currency for digital purchases, has further enhanced user interaction.\n\nThe future of TON and web3\n\nThe Total Value Locked (TVL) in TON has grown dramatically from $22.9 million to over $500 million since March, marking an impressive increase within just three months.\n\nBREAKING: $500M Total Value Locked (TVL) 🔥\n\n\n\nThe GDP of a small country is in use across #TON's apps. This incredible achievement is yours, TON Community!\n\n\n\nFrom $22.9M TVL in March 2024 to more than half a billion today – over 2,000% increase. 📈\n\n\n\nIt’s still only the beginning.… pic.twitter.com/bE3xqohACG — TON 💎 (@ton_blockchain) June 13, 2024\n\nThe number of active Toncoin wallets has surged from 1.28 million at the start of 2024 to over 8 million. This growth reflects the network’s expanding user base and the increasing adoption of Toncoin for various financial activities.\n\nIf you are starting on crypto, I will strongly recommend you to have a look at $TON / @ton_blockchain\n\n\n\nSuper early. Super quick. Easy to build.\n\n\n\nMoreover, run by @telegram .\n\n\n\nFew more weeks, you will see $TON over 10$ 🔮 pic.twitter.com/ONRBCFKsmc — Crypto King👑💎.eth.sol (@cryptosanthoshK) June 11, 2024\n\nCrypto influencer Crypto King recently recommended Toncoin to new investors, emphasizing its fast and user-friendly blockchain infrastructure. He noted the credibility of the development team, which also developed Telegram, suggesting that this could lead to a significant price spike for Toncoin, potentially reaching $10 in the near future.\n\nIn a technical analysis, crypto analyst Ali Martinez identified a potential 40% breakout for Toncoin, targeting an ambitious price point of $11.\n\nAt press time, Toncoin is trading at $8.03, reflecting a 6.63% increase over the past 24 hours.\n\nThe rise of TON reflects broader trends in the crypto ecosystem, where platforms that successfully integrate blockchain technology with existing user bases can achieve rapid growth.\n\nWhile Ethereum continues to be a major player with its layer 2 solutions, TON’s success illustrates the dynamic and competitive nature of the crypto market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]