[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQSzhTRjFEQ1dFM3Y1UmpyR0ZOWHdFbXpxTnBxU3BhMHJseW5ZS1VRLThyQ0R4MlNmSlhua2hNQ2dXc203eTdLSlZHMkxvUm15QTM3d2VmcnRLVFZBWi11ZU95T005UktNS3lublV6R20tTFNvVmg1TnJxNFIwdFRJS21uQlFhQjRZeXBJeE1rb285SzhuNHNucV9uTlVNR3dfcmY3alR3eTlyS1FFclFnNzVCT0FueDVZa3ZqOHJDSjVOUjJGYzI0SWk0TEJmQmlCcmNGeWhwNERPYndiQXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Products Face $61M Outflows, While Solana Sees $1.6M Inflows Amid Broader Crypto Market Decline - CryptoGlobe",
        "content": "Cryptocurrency investment products as a whole saw outflows of $30 million over the past week, with Ethereum-focused products seeing their largest outflows in nearly two years over the same period after investors moved $61 million off of these products.\n\nThat’s according to CoinShares’ Digital Asset Fund Flows weekly report, which details cryptocurrency investment products saw their third consecutive weekly outflows over the past week, with most product providers seeing minor inflows that were offset by larger outflows from Grayscale.\n\nTrading volumes, the firm’s report adds, rose 43% week-on-week to $6.2 billion, while remaining below the $14.2 billion weekly average seen so far this year. While Bitcoin investment products saw $10 million in weekly inflows, Ethereum-focused products saw massive outflows of $60.7 million.\n\nMeanwhile, Ethereum rival Solana saw $1.6 million in inflows, while Litecoin saw $1.4 million and XRP $300,000, below Chainlink’s $600,000 inflows. Products offering exposure to multiple digital assets saw $17.9 million in inflows.\n\nAs report, crypto trading firm GSR has taken a long position on the smart contract platform Solana citing its “superior technology,” and suggesting its “likely just a matter of time” before Solana gets a spot exchange-traded fund (ETF) trading in the United States.\n\nIn a recently published note GSR highlighted Solana’s features including its Proof-of-History mechanism and its “ultra-cheap transaction costs” and “wide array of decentralized applications,” as well as its “bustling user and developer communities.” It touted the release of innovations like token extensions over its technology which the firm said “provides a sustainable competitive advantage.”\n\nThe firm acknowledged that Solana’s focus on speed and security may come at the expense of some decentralization, but added it believes this trade-off will become less significant as hardware costs decline.\n\nGSR’s bullishness on Solana coincides with a political twist. The firm suggests that former President Trump’s recent support for the cryptocurrency industry, coupled with a potential softening stance from Democrats in a tight election year, could pave the way for a more favorable regulatory environment. This, in turn, could accelerate the approval of spot ETFs for cryptocurrencies beyond Bitcoin.\n\nCoinShares’ report also details that blockchain-related equities suffered outflows of $545 million this year, a figure that represents 19% of assets under management.\n\nFeatured image via Pixabay."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQWTFUZ05jbk83UGZjeWJ0VkFuX0N1TzRkSFhLdXZaVnhndkNtNlNmQUxZeDM3UVVSRmRTRGZGaklfdmZUUTc3U1ZNZmNWdFhWUTJ1UnNWZEVqOWljaWVkY3VGU09NLU1Tb3owVGE5ZFF5cURkLWxlVnZTcTR0VkMxajJubXR5dGZTQ2pLcUdaS0FhSnFBc3ZUMWFQLXhmSE9FQUNNOTljZFdlVVFtNnhLakdtSdIBuAFBVV95cUxNWktHSzVkSGh3Vmh5S3hyZDlIWExPMVhXYjBVWG4wTDc2N3lkeTBOVUoxb05HRWNvZ0U4SVRKcG1MUC1VM2JaZTc1LVk1bG12ci0xVkJJd3QzaGNzdDNHS05iNUltUTdLY2V4bWZDem5WZkd2TG5ybzA0dzFvUTVaM3IwTUhBM1NKVzBTVklPUm1BUmQtQm5ZYUU3b2lDQmozb1hsRmo2ZXQ5LXliZnphc054ZUE5dms5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Post-ETF Approval: What the Marketing Ethereum Community Needs Now - Finance Magnates",
        "content": "May marked a historic month for the crypto market after the SEC finally greenlit Ethereum exchange-traded funds (ETFs). After years of relentless pushback and tireless advocacy from pro-crypto activists, this approval presented a golden opportunity to market Ethereum in ways that have not been previously anticipated.\n\nThe timing of this approval couldn’t be better. It comes at a moment when global financial markets are increasingly open to on-chain investments, such as the $11.7 billion capital inflow to Bitcoin ETFs since January 2024. This article explores how the Ethereum community can leverage these new circumstances to position ETH as a leading global investment vehicle.\n\nETH Enters the Commodity Market\n\nWith the SEC’s approval of Ethereum ETFs, ETH is now effectively recognized as a commodity. This institutional endorsement has launched Ethereum Ethereum Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Read this Term into a new level of financial credibility previously reserved for assets like gold and oil. Investment giants like BlackRock and VanEck, which have already established sizable positions in Bitcoin ETFs, are now setting their sights on ETH.\n\nThis week, this day, has been a rollercoaster unlike any other I’ve seen. ETH is effectively deemed a Commodity as we’ve always known it to be. I’m proud to be on team @Coinbase, the trusted partner and custodian for many of the issuers who had 19b-4’s approved tonight. pic.twitter.com/nz1HHFbBSQ — paulgrewal.eth (@iampaulgrewal) May 23, 2024\n\nFresh coverage of these new narratives by mainstream media is primed to catapult Ethereum out of its crypto-native niche. Already, ETH is becoming a mainstay in major business news outlets, even as political leaders like Donald Trump have utilized the Ethereum network to launch projects.\n\nGone are the days when Ethereum market sentiment was determined solely by the attention span of crypto communities. We now face a future where Ethereum will be the subject of wider discussion as more attention settles on ETH as the most exciting crypto commodity.\n\nInvesting in the \"World Computer\"\n\nThe massive capital influx into Bitcoin following the BTC ETF approval on January 11, 2024, set a precedent that Ethereum is certain to follow. While Bitcoin is often seen as digital gold, Ethereum offers something uniquely compelling—it powers a decentralized “World Computer.”\n\nBitcoin, by design, is primarily a digital currency meant for value exchange. Ethereum, on the other hand, introduced a new era of decentralized and secure networks powered by ETH, the world’s first programmable crypto.\n\nSince its inception, Ethereum’s smart contracts have advanced computing technology's capabilities, enabling applications in sectors ranging from encryption and trading to data verification and digital wallets. As I often tell people, \"If fiat was a horse, Bitcoin is a train, and Ethereum is an airplane.\"\n\nIn marketing ETH, the Ethereum community should bring these superior traits to the forefront by emphasizing that it is the real key to unlocking real-world applications of crypto technology.\n\nHunter + Dog S1 are timeless. https://t.co/tJ82Ly5dtW — CollectTrumpCards (@CollectTrump) May 31, 2024\n\nEthereum Is Reshaping Global Industries\n\nEthereum’s smart contracts are actively reshaping both traditional and digital industries. In finance, Ethereum has pioneered the decentralized finance (DeFi) sector, which now boasts a market cap of $104.55 billion. We could also discuss how the millennia-old real estate market is being disrupted by the concept of tokenization Tokenization Tokenization represents the process of substituting a sensitive data element with a non-sensitive equivalent, i.e. token, which bears no extrinsic or exploitable meaning or value. In essence, the rights to the ownership of an asset are converted into a digital token. Tokenization can be used to own an entire unit of an asset. For example, one token that represents the ownership of a piece of real estate or to split ownership of a single unity of an asset such as 200,000 tokens, each one represen Tokenization represents the process of substituting a sensitive data element with a non-sensitive equivalent, i.e. token, which bears no extrinsic or exploitable meaning or value. In essence, the rights to the ownership of an asset are converted into a digital token. Tokenization can be used to own an entire unit of an asset. For example, one token that represents the ownership of a piece of real estate or to split ownership of a single unity of an asset such as 200,000 tokens, each one represen Read this Term, which has made housing markets more accessible and secure.\n\nReal-world assets (RWAs) are powered by the smart contract technology pioneered on Ethereum, rewriting the rules on the ownership and trade of landed properties while blurring the lines between virtual and physical items.\n\nEmerging technologies like decentralized physical infrastructure (DePIN) are merging physical and network infrastructures, unlocking new uses for a growing list of applications, including data networks and digital geographical mapping. Additionally, smart contracts are pushing the boundaries of artificial intelligence by enabling decentralized AI computing.\n\nIt’s clear that the diverse applications of smart contracts highlight ETH’s utility, making it a highly sought-after crypto commodity over Bitcoin and even conventional commodities with limited use cases.\n\nScaling Hurdles with Ethereum\n\nL2 networks, one of Ethereum’s biggest criticisms has been its scalability issues. The processing speed and usage costs of the Layer 1 Ethereum network have resulted in challenges to its widespread adoption despite the versatility of smart contract technology. However, the emergence of Ethereum Layer 2 (L2) networks, such as Arbitrum, Base, and zkSync, has mitigated these issues.\n\nThese L2 networks, all powered by the native ETH token, enhance Ethereum’s scalability and efficiency, enabling the type of growth discussed earlier. They operate on top of the Ethereum blockchain, enhancing its efficiency by handling transactions off the main chain before settling them on the main network layer.\n\nThis reduces congestion and lowers costs without compromising on security or decentralization, making Ethereum more accessible and user-friendly.\n\nEther ETF Approved: Why Investing in Ether is Much More Sensible than Bitcoin in 5 Points\n\n\n\nA thread 🧵\n\n\n\n1. Ether is Much Scarcer and Even Deflationary Compared to Bitcoin 📈\n\n\n\nUnlike Bitcoin, transaction fees on the Ethereum blockchain do not go directly to miners (validators,… pic.twitter.com/1xDgWp8KD0 — tobbykitty.eth 🦇🔊 (@TobbyKitty) May 24, 2024\n\nThis adaptability ensures that Ethereum remains relevant as new technologies emerge. Perhaps this is Ethereum's strongest selling point in the post-ETF era: ETH’s ability to efficiently scale while retaining Bitcoin's core crypto values, along with its unique added benefits, makes it a formidable contender in the crypto commodity space.\n\nIf the ETF approval was a validation of ETH’s maturity as an asset class, then it is time to remind the world why Ethereum has made it this far."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1OdHU3U1o3eWRPSERjRk5DTk93UHBlejJtekxPa3Y2T2V2LUdGanV0WDNiR3h5VUlXVmt2Sk52RGdUQmYtMDAteUlZZTdDX0gxMFNaanVZNWZEYjNER3U2NlBHTFJaN3E3eHNLWDZoT3VjVGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Poised For Major Breakout, Analyst Predicts 180% Surge - TronWeekly",
        "content": "Ethere­um, the second-largest cryptocurre­ncy by market capitalization, is poised for a major breakout, with its price­ increasing by approximately 180% soon. Crypto analyst Javon Marks has highlighted this bullish tre­nd, suggesting that Ethere­um is on the­ cusp of an even more substantial bre­akout.\n\n“$ETH (Ethereum) may only be preparing here for the overtaking and surpassing of $4,723.5 which could then open $8,000+!” said Marks.\n\nMarks’s prediction indicate­s a potentially massive surge in Ethereum’s value, projecting it could more­ than double its current price. Marks’ twe­et emphasized the­ critical $4,723.5 level as a pivotal point for Ethere­um’s continued growth.\n\nSource: Javon Marks\n\nThe chart shows Ethere­um’s steady upward trajectory, refle­cting the 180% increase since­ its previous lows. This rally is marked by periods of consolidation and minor pullbacks, which, according to Marks, are­ essential for a healthie­r and more sustainable bull run. These­ pullbacks help to stabilize the price­ and prevent overe­xtension, setting the stage­ for a robust ascent towards higher targets.\n\nMarks’ analysis sugge­sts that surpassing the $4,723.5 mark could trigger a new wave­ of investor interest and marke­t activity. Ethereum’s potential to re­ach $8,000 or beyond is based on its strong technical foundation and the­ current bullish sentiment surrounding the­ cryptocurrency market.\n\nEthereum’s ETF Launch Hope\n\nDespite­ a recent rally, Ethereum’s price is struggling to get back to its all-time high. The­ rush past $3,395 came from spot ETH ETFs approval, still, lacked power afte­r a small dip mistaken for rollback at the beginning of the­ month. Market worries and stronger pe­ssimistic trends intensified the­ pullback.\n\nThe upcoming launch of ETFs may change the game­ and give the same be­nefits of the price of Bitcoin in case­ of its spot ETF’s launch. By indicating greater investor appe­tite through the ETFs, the price­ could return to the north and cross the $3,829 barrie­r, an important target.\n\nThis figure is also the 61.8% Fibonacci Re­tracement leve­l which would pave the way for another le­g up following previous resistance now turne­d to support. It may be that the target is far too high for ETH, but the­ demand is still in place for $4,000 in ETH. Howeve­r, a firm move above this leve­l is more likely to inspire furthe­r bullish sentiments.\n\nHoweve­r, a failure to go through the $4,000 barrier could provoke­ an adjustment below this leve­l. at least 3,700-3,800 the price could go flat. On the­ downside a break under this zone­ would make historians of the bull market.\n\nRelated Reading | Nigeria’s Cryptocurrency Market Surpasses $400 Million, SEC Director General"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOclk4Q1c0dUFYQllOYncwZTFGbWY4cDhaVnZabnk0dk1VSXhTQW1qbmUya052c0hIVFhzaWthOUJQVXRwa200U0pTdV9fa0VsUjIwc2hJQ25KTzhVRUhjZk12NVVtb2hYRjJXUW1xMXJtS19IdmRnLU45aG94dGFQddIBiAFBVV95cUxOUDJ3bHViZWhIY3BVVU5obEFpcTR1MFBaZDVzdlpfZm1MN3duUVh3emVCNjVWZnBWUzZ6UjZIWGdRUUUxRTdSZ1dyb1M0eUFxXzczZ2RmaFAxS0Z6aTNVVk5OcTQtckFGcEhQUmlpdHg2OEFudTZJQmFzMWY0TDc1RkRNbVd2NjRE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ICO Era Whale Moves $24 Million to Kraken - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a surprising turn of events, a whale from the Ethereum initial coin offering (ICO) era has reemerged after more than six months of inactivity.\n\nA wallet that participated in Ethereum's ICO in 2015 and acquired 254,900 ETH at an ICO price of $0.311 per token transferred 7,000 ETH, equivalent to $24.28 million, to the Kraken exchange today.\n\nThis transaction marks the end of a 209-day silence from this notable holder, who still retains a substantial 40,000 ETH valued at approximately $139.5 million.\n\nThis whale's movements have caught the attention of the cryptocurrency community—not only due to the sheer size of the holdings but also because of the potential market implications.\n\nAD\n\nAD\n\nLarge transactions by such early adopters can influence market sentiment and price dynamics, especially when the transfer is to a significant exchange like Kraken. It’s often (but not always) the case that someone transfers to an exchange because they’re selling or preparing for further trading activity.\n\nSimultaneously, another significant transaction involving the U.S. government surfaced.\n\nAccording to blockchain analytics platform Arkham, one of the known U.S. government wallets transferred 3,375 ETH, worth about $11.75 million, to an unknown address, 0x5a...1871, earlier today.\n\nThis address is known to hold the seized funds of Estonian crypto entrepreneurs Sergei Potapenko and Ivan Turogin, who were involved in a high-profile cryptocurrency fraud case.\n\nAD\n\nAD\n\nThe transfer of such a considerable amount of ETH by a government-held address raises intriguing questions about the potential uses of these funds.\n\nThis move follows a previous transaction where another U.S. government address transferred 11.84 BTC to address 3KHnTq...muuso9, indicating a pattern of strategic fund management or liquidation by authorities.\n\nThe timing of this transfer has sparked speculation within the crypto community.\n\nSome analysts suggest it could be a sign of profit-taking, while others view it as a potential redistribution of assets or liquidity provision to the market.\n\nAs both private whales and government entities maneuver large sums of digital assets, the potential impacts on market liquidity, price stability, and overall sentiment are significant.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1KSkpQWVdKQUxONkw0Uk1wajNSZldjcktGUlZjcW5rS3VhUlZoaUUyaDFjdG5VTnZKVXJWMkZEVzRrYW1xXzYtS3o5eV9Od29EWUctSVhucHB6c00wQXYwQVJJNWZhbHNhREo3akJIaEphM2fSAXhBVV95cUxPM3JFZ21PV2dVTW5SMkVCNGFIU0psVXFjYnc5NEdNVXZKS244UzV6WmN4dnR0dk9UeEZrSFRURk1IZVhBNjcwbW83MW40YlhnZkduQVRpY0RHT0xXam5KVV9taUlzbnF1dDlNTmR5d2V1Qy1pUEhlbVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Solana Just Dethroned Ethereum in This Key Metric - U.Today",
        "content": "According to data provided by DefiLlama, Solana has managed to destroy Ethereum in daily DEX trading volume ($1.148 billion and $745 million, respectively).\n\nAdvertisement\n\nSolana-based Raydium, Meteora, Orca, Phoenix and Lifinity are among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap, of course, remain in the lead.\n\nAs noted by Patrick Scott, the founder of Dynamo DeFi, Solana's DEX volume dominance is also on the rise . In fact, it is on track to surpass the 25% level for the first time this June.\n\nAdvertisement\n\nOverall, DEX volume has hit $26 billion over the past seven days, according to data provided by Dune Analytics .\n\nEarlier this year, trading on Solana-based DEXex spiked due to the growing popularity of meme coins.\n\nSOL summer?\n\nThis comes as the \"Ethereum killer\" is benefiting from increasing ETF buzz. As reported by U.Today , New York-based investment firm VanEck filed to launch an ETF for Solana on Thursday; 21Shares followed suit with its own filing for the red-hot altcoin on Friday.\n\nHowever, those who expect this ETF to see the light in the near future should cool their jets. According to leading analysts in the field, the product is now expected to be approved this year.\n\nAfter initially seeing a sharp price spike due to the ETF hype, the SOL price is currently in the red, slipping by 0.2% over the past two weeks.\n\nThe popular altcoin is currently valued at $65.2 billion, according to data provided by CoinGecko. This puts it in the fifth place by market capitalization (behind only Bitcoin, Ethereum, Tether and BNB)."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUm1OdHFyWFIxWEdLU00ycTY2b20teDNyR0MwRU5EQ0l2dnFIajhCYWMxZ1VQOGF3LUMyVFNvNVpobTE5aVpmZWxkSUZ0dk1PM25YTHJwOUNnMDJjMjhDYUZCbmk1OThYUzJzWVM3LXdENEFSaFUtX241b3JOMUpiVG1PTHFuWmRqQzZZWWVEZkhrdHJ0b2fSAZsBQVVfeXFMTVZTQlZxNTFQbk9yVU00VDVYdGR3S2dFdXBSbTFpdkx4b00wUi1oaEV0YmdmYzZKUEkzeDVNOHRocWZnR2NiazduLTI3QXA5dFUtWm95NmlSc2t1NlBDRkszbDB6VWFIREtoTTZLa3oxd1B0bU9MSFI4QXhDcDA5c2tyZXJuWGx3dG1DMkJrM2hFQmlsdEFhV3BYQmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Breaking: US Govt Moves $12M Ethereum, Is Bitcoin-Style Selloff Incoming? - CoinGape",
        "content": "In a notable move that has caught the attention of the crypto community, the U.S. government transferred a massive Ethereum (ETH) reserve on Monday, July 1. The transfer has sparked speculations around a potential ETH selloff, which could mirror the downtrend Bitcoin (BTC) suffered amid selloffs by German and U.S. governments. Moreover, the anticipated launch of Spot Ethereum ETFs this month further fuels such concerns.\n\nU.S. Government Shifts Ethereum Reserve\n\nAccording to Arkham Intelligence, the U.S. government recently transferred 3,375 Ethereum. This reserve, valued at approximately $11.75 million, was shifted to an unidentified address on Monday. The transfer’s timing is particularly significant as it comes ahead of anticipated approval of Spot Ether ETF S-1 filings.\n\nadvertisement\n\nLast week, the U.S. Securities and Exchange Commission (SEC) returned these filings to major applicants including BlackRock, Fidelity, and VanEck. Hence, analysts predict that applicants could submit further S-1 amendments this week. Meanwhile, they have offered a potential approval date for mid-July.\n\nThe movement of such a substantial amount of Ethereum before these key events has led to concerns that the U.S. government might be preparing to capitalize on the Ethereum ETF S-1 approval news. In case the government sells its Ethereum holdings, it could adversely influence the ETH price just like it did for Bitcoin.\n\nThe transferred funds are linked to the U.S. government’s seized assets from Estonian crypto entrepreneurs Sergei Potapenko and Ivan Turogin. Potapenko and Turogin were deceived investors through promises of high returns from their crypto mining operations. The fraudulent activities led to confiscation of significant crypto assets by authorities, including the Ethereum that was moved.\n\nThis Ethereum transfer follows a similar pattern observed last week when the U.S. government moved 4,000 Bitcoin to exchanges in June. The repeated movements of seized crypto assets have led to market speculation about imminent dumps, particularly in light of the upcoming Ethereum ETF decision.\n\nCurrently, the U.S. government holds 50.524K Ethereum worth a staggering $175.46 million. Meanwhile, the Ethereum price just recovered above $3,400 but the trend may be impacted by the latest transfer.\n\nAlso Read: ETH Price Surges 5% Amid Increased Whale Activity Ahead of Ethereum ETF Approval\n\nBitcoin Dump Concerns\n\nThe June BTC transfer by the U.S. government caused widespread fear, uncertainty, and doubt (FUD) in the market. In addition, on Friday, June 28, a notable transfer of 11.84 BTC was also recorded from the same government-held wallet.\n\nAs of yet, the U.S. government holds 213.534K Bitcoin, valued at a whopping $13.41 billion. With speculations of an impending selloff due to the BTC transaction last Friday, analysts have hinted at increased FUD in the market. Moreover, the German government’s BTC selloffs have added to bearish sentiment in the market and among investors.\n\nIn the latest update, the German Government shifted 400 BTC to exchanges including Coinbase, Bitstamp and Kraken. The Bitcoin shifted is worth about $25.28 million. This again hints at an impending selloff by the German government just after the Bitcoin price rebounded above $63,000.\n\nMoreover, in last two weeks, the German Government-associated address has transferred over 2,700 BTC to crypto exchanges. Hence, market participants worry about a potential drop in the Bitcoin price. Moreover, the July rebound expectations are in jeopardy.\n\nAlso Read: Ethereum Network to Get Major Boost With SSF Roadmap, Says Vitalik Buterin\n\nKritika Mehta Kritika boasts over 2 years of experience in the financial news sector. Currently working as a crypto journalist at Coingape, she has consistently shown a knack for blockchain technology and cryptocurrencies. Kritika combines insightful analysis with a deep understanding of market trends. With a keen interest in technical analysis, she brings a nuanced perspective to her reporting, exploring the intersection of finance, technology, and emerging trends in the crypto space.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPM3E5VG1TR0Itc2ZpbV96aEYxNU1GM29zd1Y3Y3RhQndrcFJFbjhxaXRqREZYVFFscTI2ZzlCbE1aUDM2LXRSSzBKOWJrSGxFM2dXdUloeVlINFMzemZiUk1RVFFNT3hrV3kzU2RLSFpvMV9qcG1aLTRIWGkyd0JQRlp6M1pHdDR3dDBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities - Yahoo Finance",
        "content": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities\n\nThe United States Securities and Exchange Commission (SEC) has filed a lawsuit against Ethereum software firm Consensys. The SEC's filing claims that since January 2023, Consensys has engaged in the unregistered offer and sale of securities via its crypto asset staking programs and acted as an unregistered broker through its MetaMask Staking service, allegedly collecting over $250 million in fees.\n\nIn April, Consensys preemptively sued the SEC after receiving notice of the agency's intention to sue over MetaMask’s staking programs. The firm claimed that the SEC had secretly considered Ethereum to be a security for over a year and was quietly assembling a broader case against the crypto asset. Earlier this month, Consensys announced that it had been informed by the SEC that the regulator was closing its case against Ethereum, a development that was celebrated within the crypto industry.\n\nIn the SEC's lawsuit, the agency highlights Consensys's facilitation of ETH staking via third-party services like Lido and Rocket Pool through MetaMask. The SEC argues that these staking programs are offered and sold as investment contracts, and therefore, should be classified as securities.\n\nThis lawsuit emerges during a turbulent period for the SEC and crypto regulation. Earlier on Friday, the U.S. Supreme Court's conservative majority struck down the \"Chevron doctrine,\" a critical piece of American law that had allowed federal agencies, including the SEC, considerable latitude to interpret their regulatory powers. Consensys appeared to reference this Supreme Court decision, forcefully asserting that the SEC lacks the authority to regulate crypto products like MetaMask."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQcWRiTzJMNExQZVUyZHBCM2RSQ2VzWkRCOU03MkJiLXdtUkVOVmlqYm1SVk8wTC1meExtUF9lRnNmdHFxTjB2a1JDUDVDSURXTThodml4NkY5UUV5UFY3eVk5dGRuRXQyU1pRWTlQbnNSQzlRY2NLbjRTbHNXWUJrb1hxWlBBdEtnemhkdVBxbUExLWlaTG1lY3dPbWRFb0xYZTFF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin suggests ways to speed up Ethereum transaction confirmations - CryptoSlate",
        "content": "Ethereum co-founder Vitalik Buterin has suggested ways to help the blockchain improve its transaction confirmation times.\n\nButerin, in a June 30 blog post, explained that Ethereum’s Gasper consensus mechanism uses a slot-and-epoch architecture that contains certain complexities, like bug interactions and a 12.8-minute confirmation time, that makes it “more and more uncomfortable” for user experiences.\n\nSo, he highlighted some of the “practical options” Ethereum has to improve its user experience further.\n\nSSF\n\nButerin stated that the single-slot finality (SSF) mechanism is similar to the Tendermint consensus, as it allows the finalization of blocks as soon as they are produced.\n\nHowever, unlike the Tendermint consensus, Ethereum will keep the “inactivity leak” mechanism to allow chains to remain functional even if a third of the validators go offline. Buterin added that the single-slot finality mechanism also has its faults. Notably, all Ethereum stakers must publish two messages every 12 seconds, overloading the chain.\n\nMeanwhile, Buterin furthered that while there are ideas to mitigate this issue, users may still have to wait 5-20 seconds. He wrote:\n\n“There are clever ideas for how to mitigate this, including the very recent Orbit SSF proposal. But even still, while this improves UX significantly by making ‘finality’ come faster, it doesn’t change the fact that users need to wait 5-20 seconds.”\n\nRollup preconfirmations\n\nRollup preconfirmations aim to improve Ethereum’s Layer 2 (L2) solutions. These solutions process transactions with the same security as the Ethereum base layer (L1) but on a larger scale.\n\nRollups confirm transactions much faster than the current 5-20 seconds, targeting latencies of hundreds of milliseconds. This method divides responsibilities — the L1 network remains stable, censorship-resistant, and reliable, while the L2s offer faster transaction times and address user needs directly.\n\nTo achieve faster confirmations, L2s create decentralized sequencing networks. These networks have smaller groups of validators who quickly sign off on blocks, often within milliseconds, and commit them to the blockchain.\n\nHowever, validators must ensure their commitments are consistent and trustworthy. If a validator signs conflicting blocks, they risk losing their deposits.\n\nBased preconfirmations\n\nBased preconfirmations leverage Ethereum proposers’ advanced capabilities, driven by Maximum Extractable Value (MEV) prospects.\n\nThe concept involves establishing a standardized protocol where users can pay an extra fee for immediate assurance that their transaction will be included in the upcoming block. This service, known as preconfirmations-as-a-service, would assure users of swift transaction confirmation.\n\nProposers who fail to fulfill their commitment or breach the agreement face penalties (slashing). Buterin noted that this framework will apply to L1 transactions and extend to L2 solutions. By treating all L2 blocks as L1 transactions, the preconfirmation mechanism ensures accelerated confirmations throughout the Ethereum network.\n\nButerin noted that Ethereum implementing SSF and rollup or based preconfirmations could significantly reduce transaction confirmation times.\n\nHowever, he pointed out that this would return to the initial “epoch-and-slot architecture” the blockchain was trying to ditch. He stated:\n\n“There is a deep philosophical reason why epoch-and-slot architectures seem to be so hard to avoid: it inherently takes less time to come to approximate agreement on something, than to come to maximally-hardened ‘economic finality’ agreement on it.”\n\nHe suggested that the network developers explore other options that are not as tightly interwoven as Gasper.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNRHQyaHhsNnU3WVRmOXVTeXF3c3prNlkxaDF3WUVBU01mMEc1YUxFdDZnOGQzNFVETWcyd2FnV2l2dTJYcTdfQ0VqMmRyMmpJVHdMUkU0QTlDaU9kb3U1bVlWQmRxNGsyX3pBMnFMcDRzYlZja1lPSlNfQTNHZVF4S1JnTms5TXJjb3VpM3FWcFlDTzg5Nm9tLTBJYUZjZkNjQ3J4cl9KQ29FaGRCcGZrYVI3NVlSMlNWam1KNEtKZ2l0TG1YTExQeFhucGZSQmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Faces $1 Billion Sell Pressure as Bloomberg Hints at ETF Delay by SEC - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxONThCRjk4bHM3NEdWQk5qbDNpZVRUVGpxSWd1WUxiRllLcC0yc2d0b2VFaVN2T3lWanRsN2RRV3lUVEJIc3BQWXllc01jS1JMeTBXaXJWUjU0ZUc0RERsalBLMGUwRkNuVElPRXVqYk00VnZjMnQyTWNWTWdMZmNUMzNralUySUtfc3ZQZFpUY3NQbzN2THhYOFpNLVROZDdKZXlGdXNvRmxqTnpBemxWWE1aWWQzVmMzeFZUajYzZ0dvVEtaMzZLcGR4YUk4V2ZLZWgtTGhZTjRpSE1a?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "How to Participate and Earn Rewards in Ethereum Staking - Ventura County Reporter",
        "content": "You have permission to edit this article.\n\nEdit Close"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPakFtdWpLaUJjNG8yUmpVcWoxTS14djRsd25tVnF2YlZqWlVvTkx4QV9udzdRNHp0R3djY0VVVDRzZVZMQlFOS1F2M0ZQd0ZGWjl3MG5GZEZXVDhTSTdjdWdVV3VqcmdNbnVEdHgxczY4eU5CN1VKcVllQlRPRTRMbC1zRXlNQjJXSWg2Yzg4N2FOUW5rVU9fYUNVdS1oemM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "When will Ethereum ETFs launch? Experts just moved their July 4 target - DLNews",
        "content": "Crypto pundits are changing their bets on when Ethereum ETFs will launch.\n\nSo when can ETFs start to trade?\n\nHere’s what the experts say.\n\nThe crypto industry’s hopes that spot Ethereum exchange-traded funds will launch as early as this week are fading.\n\nIndustry watchers are not so certain that the Securities and Exchange Commission will green light the batch of applications this week.\n\n“We’re gonna have to push back our over/under till after the holiday,” Eric Balchunas, a Bloomberg Intelligence analyst, said on X.\n\nHe previously said that he expected the market watchdog to give a thumbs up before July 4.\n\nBalchunas changed his mind after he’d heard that the regulator had asked prospective issuers to amend their applications. He now says the week of July 8 is more likely.\n\nBalchunas said he expected little movement among regulators this week ahead of Independence Day.\n\nThis is a minor setback for an industry hoping the launch of spot Ethereum ETFs would catapult the stagnant market, similarly to how spot Bitcoin ETFs did at the start of the year.\n\nEthereum exchange-traded products will attract $15 billion in net flows in their first 18 months on the market, Bitwise’s Matt Hougan recently said.\n\nJoin the community to get our latest stories and updates\n\nOn crypto betting site Polymarket, punters put the odds of a spot Ethereum ETF to start trading by July 4 at 4%, down from 77% last week.\n\nThe SEC asked prospective issuers to address some comments in their applications and resend applications by July 8, an applicant insider told The Block on June 29.\n\nThe source noted to the news site that they expect more rounds of back and forth between applicants and the SEC.\n\nDespite the setback, Ethereum surged 3% over the weekend and is trading at $3,450.\n\nEric Johansson is DL News’ News Editor. Got a tip? Email him at eric@dlnews.com."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQbE4wWGpMNVZ1Mlh6Ml9mN1BMXzNTYWxXQVdHek92MlN1T3RMcExWWnJ5T1NfRXZOWHJBU0xaejg5Z05vbEpRYUFqQVFKUVdPal9iaTkxVXQ2aVNJTC1EZlQ1MVdGalBIUDdlSmFUeGVSVFZwMVJudk1oa2kyYVFZWVp2ajVRTldnUGxr0gGQAUFVX3lxTE0yX01URmQ1TktRSHEzaGR0SVlMNmFpM3lVS0pFUWpBMDhjU01vU29Rb1ZBb25pN2RBSnQtTUlWeHJWb1NaRDlnSWVMY2hiSlM3UVRBc0FaQXJpTzJmOWc4UmxBNHhsdV9oWXBhTTJmM1VhNHB2UmRmVjFMczZIQVVTOFBFVDBubGR1Mk1iTmF1Sg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Endgame for Ethereum (ETH) Indicated by Paradigm's Former Andrew Huang - U.Today",
        "content": "Advertisement\n\nAndrew Huang, founder of Paradigm-backed Conduit platform, is sure that Ethereum's L2s should be able to cheaply inherit its level of decentralization. This accomplishment should be the only endgame status for Ethereum (ETH), the entrepreneur stressed.\n\n\"Native currency of Internet\": Andrew Huang on Ethereum's (ETH) endgame goal\n\nEthereum (ETH), the largest smart contract platform, should pursue the goal of becoming a public good that maximizes decentralization. All of its L2s should be able to inherit the same level of decentralization in a cost-effective manner.\n\nAt the same time, creating artificial bottlenecks for L1/L1 interaction or maximizing fee transfer to L1 nodes is \"missing an opportunity\" for Huang.\n\nAdvertisement\n\nMeanwhile, the \"biggest opportunity\" for Ethereum (ETH) remains its unique status as a native currency of the internet, Conduit's founder concluded.\n\nWith the tweet, Huang responded to the analysis of Paradigm CTO Georgios Konstantopoulos. Konstantopoulos highlighted that \"forcing market structures\" and overthinking might not be good for the progress of L2s. Instead, L2 networks should only be focused on optimal upgradeability and accessibility, while \"interoperability\" still looks like a made-up problem to him.\n\nIn this scheme, Ethereum's L1 should work like a data availability layer for EVM networks, the Paradigm CTO added.\n\nArbitrum (ARB) loses L2 dominance, TVL share dips below 40%\n\nEther (ETH) is changing hands at $3,462, up 2% in the last 24 hours. Trading volume jumped by 57% overnight and exceeded $10 billion, CoinMarketCap data shows.\n\nMeanwhile, USD-denominated total value locked in Ethereum's L2s ecosystem is expanding its drop. In the past month, it fell from $49.3 billion to $42.1 billion, per L2Beat.\n\nArbitrum (ARB), an undisputed leader by TVL, is losing its traction: its dominance plunged below 40%, while its closest competitor, Base (BASE), almost reached 17%.\n\nOP Mainnet is attempting to hold above the $15 billion level, while recent newsmaker Blast (BLAST) is responsible for 6.9% of TVL in Ethereum's L2 ecosystem."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPcXNBelNaOFFoMmI0Zk1mZ3hpSFVuS09fUldUaWx2NFhLdGtZRGhSOHViVXNkVlVMUjlxc2I5UTNOQWdsWEY4WFRWWjZVeFVKdXNIbVJKLVZHMmtYQko0REJwbnZBV2JjTWw3dURLYlJQNWlZLWtzV05ocFRnV2FzTGg2RTFIZ1M3ZGfSAZIBQVVfeXFMTXlIZVBHSVk0YnA2cnA1dXZOWEdIN010SGJnMU5CbWZtV1c5Z0pHcjdBeXRmbVdxdnZmQ2gtbktSN2FoYmZlcDF4OHRZV2cxTjlLZnZKUWp4aFFKS3BfbFNGanUtQUo3T3ZEbnVFRDMydm4wdHMtRDRtVEt5MjBhRmtGRzN4ZnBZOGYxb0l1MTFTR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Gains as $20 Million Worth of Shorts Get Liquidated - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum, the leading smart contract layer-1 blockchain, has gained 3.2% in the past 24 hours. ETH touched its intraday high of $3,514 earlier today and is currently trading for $3,488. Derivative traders getting liquidated appears to be the key factor for this upswing in the Ethereum price.\n\nA total of $20.4 million worth of ETH shorts were liquidated in the past 24 hours, which far outweighs the $1.87 million worth of ETH longs were liquidated during the same period, according to derivatives analytics platform Coinglass.\n\nA short is a derivative contract that traders use to be against the price of an asset going up. And a long is what traders use to be that an underlying asset’s price will increase.\n\nAnother key event that the market participants are closely watching is the approval of U.S. spot Ethereum ETFs.\n\nAD\n\nAD\n\nThe U.S. Securities and Exchange Commission (SEC) has asked spot Ethereum ETF issuers to submit revised filings by July 8, according to Eric Balchunas, Senior ETF Analyst at Bloomberg.\n\nThis implies that spot Ethereum ETFs are likely to start trading sometime during mid-July. Initially, analysts estimated that Ethereum spot ETFs would get approved by July 2—but that now seems very unlikely.\n\nSEC Chair Gary Gensler had previously stated that spot Ethereum ETFs would get approved sometime during summer. At the Bloomberg Invest Summit, Gensler stated that the process of approval is going smoothly.\n\nIn a bid to attract institutional investors, some ETF issuers—like VanEck and Franklin Templeton—have already announced fee waivers for their spot Ethereum funds.\n\nAD\n\nAD\n\nETH is not the only asset to have witnessed an uptick in its price. The total cryptocurrency market capitalization has increased 3.6% in the past 24 hours and is nearing the $2.5 trillion mark, according to CoinGecko.\n\nThis is likely due to $81 million worth of shorts getting liquidated across all assets in the past 24 hours. That’s offset by only $17 million worth of longs being liquidated during the same period.\n\nLayerZero and Ethereum Name Service were the top gainers in the top 100 coins by market cap, as they registered gains of 27% and 24%, respectively. On the flip side, Kaspa was the only coin trading at a loss of more than 1%. Kaspa saw a downtick of 4% in the past 24 hours.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPV3BIUVJvYl9McU9TRjBtdlhNem1YTlVJUFc3QWlkUEV1eTR4Szh1RjRPY3VTOHFtMWJOSmRncHhSWFk4VExlak0yNFUtZHpaOU9VTlhpLUN0SW5pQy1qdHN6WlZTR0FTYVdoWHc0UExNSFZ0NDRRbTdob0lJc2g4NmFyc3pVaWJGOFVjRTNVTEZwOWZWMnFUTGMtc1J6YmNQZXRwZExudk1RRXlqUHhDamJFbnY4TExTRXdN0gHAAUFVX3lxTE55UVFRUG0zRGx2R21hN3NqTm5nbXI0YUlSSlBhYzVIbVBrcW96RkRpV013VGJRS3Y4X1NoemFkZ2NiMGQxeU5FY1FudUhRZ2tEZ29SaGx0b25YN0FuelFxaVI1Zm1hT2dGNnFjLWtLeDN6d2lVdzE2MmJRRXMyYjFXX2dqbnJyek1wclJIaE5OYTcxSDl3YTR1ZW0zaG9ZczJoU2dTSDVFR1pvakZxZ2hZUXk1YW5fbFNiMUxNVS1WbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Products See Largest Institutional Outflows Since August 2022: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto products sustained outflows last week for the third week in a row.\n\nIn its latest Digital Asset Fund Flows report, CoinShares says digital asset investment products suffered $30 million in outflows last week.\n\n“Digital asset investment products saw a third consecutive week of outflows totaling US$30m, with last week indicating a significant stemming of the outflows. In contrast to prior weeks, most providers saw minor inflows, although this was offset by incumbent Grayscale seeing US$153m outflows.”\n\nDespite overall outflows, the US, Brazil and Australian regions saw $43 million, $7.6 million and $3 million in inflows, respectively.\n\n“Negative sentiment pervaded Germany, Hong Kong, Canada and Switzerland with outflows of US$29m, US$23m, US$14m and US$13m respectively.”\n\nWhile the leading crypto by market cap Bitcoin (BTC), multi-asset investment vehicles, Solana (SOL) and Litecoin (LTC) brought in $18 million, $10 million, $1.6 million and $1.4 million in inflows, Ethereum (ETH) had one of its worst weeks in years.\n\n“Ethereum saw the largest outflows since August 2022, totaling US$61m, bringing the last two weeks of outflows to US$119m, making it the worst performing asset year-to-date in terms of net flows.”\n\nChainlink (LINK) and XRP also brought in $0.6 million and $0.3 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/phive/Sensvector"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzRV80ajkzbWs5UlAxNURid0FiU0hhYUE4Umcta3ZBdzVzQ1ZFNDFVN3hhbFZLR3FRY2hVSHRuMGEzemlMSm5LMXVGTlUtaTdQZVI2eTQyOVlaM0p3am1tQXZ1RnRzUHljWWRiX3pn0gFzQVVfeXFMUEpUNWEyNllxWjJOMzZrc0FtNUo3ZmlsVGF5aEdCTkQ3VEtaVjR2YlByNE1ZSld1b00zeU5fQ3hvSDlUVi01TlVOSXhGcVFWZ05QYUVvdktwYUd4WHBZM1hZa3lYTS00NmNyTmlxRklxYnFiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Lowest Gas Prices Since 2016 - U.Today",
        "content": "On June 30, the Ethereum network recorded its lowest fees since 2016. According to data provided by Etherscan, the average gas fee is currently sitting at just 3 Gwei ($0.14), according to data provided by Dune Analytics.\n\nAdvertisement\n\nGas fees refer to the cost of various operations on the Ethereum blockchain. By paying gas fees, users help to ensure the security of the network. Apart from incentivizing validators, gas fees are also meant to prevent various spam attacks.\n\nDuring the 2021 bull run, Ethereum's gas fees were exorbitantly high due to high demand in the non-fungible sector (NFT). This prompted some pundits to argue that the network was unsustainable and gave rise to more affordable alternatives such as Solana.\n\nAdvertisement\n\nThis time around, Ethereum gas fees are hitting extremely low levels despite the fact that the network is also experiencing strong transaction activity. In fact, the volume of the leading altcoin is on the same level as it was during the beginning of the year.\n\nThe plunging fees can be explained by a higher level of efficiency of the Layer-1 market due to the combination of Layer-2 volume and the introduction of “blob transactions” with EIP-4844 that helped to significantly boost Ethereum's scalability.\n\n\"We will still see gas spikes above 15 gwei in times of higher activity. It’s just that overall the gas market has been more efficient post 4844. So we’ll have more affordable days than expensive ones,\" Pistachio Fi founder Brian Smocovich said in a post on the X social media network.\n\nBack to inflation\n\nThe massive drop in fees means that Ethereum is no longer a deflationary network since the amount of fees to burn is very small. This flies in the face of those who were pushing the narrative about \"ultra sound money\" prior to the Dencun upgrade.\n\nOver the past seven days, 14,393 ETH has been added to the network, according to data provided by ultrasound.money. This translates into annual supply growth of 0.62%.\n\nThe total supply of Ethereum currently stands at 120,185,061 ETH, which means that it is on track to reach a new 2024 peak."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE5VQllLOUZmR0dESkY2Mm80Qm1VWkxheEhSaWV6QXM2TjQ3YXBaaEIxVmZseUFFWVZ5V2FvOGxJZmpuY2oyMHpEMnNEbktSem1JN0gzUWhTdWFOdGJfZHBEN3NvSGtKeEJ6aS1F?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum is the worst performing crypto in net flows this year - Crypto Briefing",
        "content": "US, Brazil, Australia see crypto inflows as market sentiment improves.\n\nKey Takeaways Ethereum recorded its largest outflows since August 2022, totaling $61 million.\n\nPositive shifts in Bitcoin and multi-asset ETPs suggest changing investor sentiment.\n\nShare this article\n\nCrypto exchange-traded products (ETF) experienced their third consecutive week of net outflows, totaling $30 million. Notably, Ethereum-indexed ETPs saw over $60 million in outflows last week, their largest outflows since August 2022, according to asset management firm CoinShares. This makes Ethereum (ETH) the year’s worst-performing asset in terms of net flows.\n\nAdditionally, ETH’s total outflows to $119 million over the past two weeks. In contrast, multi-asset and Bitcoin ETPs saw inflows of $18 million and $10 million, respectively. The outflows from short Bitcoin positions totaled $4.2 million, indicating a potential shift in market sentiment.\n\nDespite the grim weekly performance for Ethereum ETPs, the rate of outflows has slowed compared to previous weeks.\n\nRegionally, the US, Brazil, and Australia recorded inflows of $43 million, $7.6 million, and $3 million, respectively. Conversely, Germany, Hong Kong, Canada, and Switzerland faced outflows of $29 million, $23 million, $14 million, and $13 million, respectively.\n\nWhile many providers reported minor inflows, these were overshadowed by a significant $153 million in outflows from Grayscale. Weekly trading volumes surged by 43% to $6.2 billion, though this figure is still below the $14.2 billion average for the year.\n\nYet, although a generally positive sentiment towards crypto could be seen this year, blockchain equities have suffered, with outflows reaching $545 million, accounting for 19% of assets under management."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNc0xZWktGb1pLOW1KWlFkSy00TVcwcm01TWNRbkV4NDZvX0pJTktxeXFiYnNjV0dWTEx5UXBoSmw1SHJvbG01OHRxV28xMjFXTmZaY3RwNjcwV3VEODVMWVd1Y0hvUjI5N3VTY2tBbmJPTXV4MkJUVjNMRFc0TTBfQWlkOU1fcm5RbTBzZUU0WDlldUJFc3c2VWh3LUZUME1zWGtnQUcyUlFjQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Pulls 60,000 New Depositors as ETF Launch Nears - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNcUVpNG56ZUd5dFA3MlhkZjFQSU5adEdheHkxYlhtdmdFUU5saHQ5dVhVUzI4N1c5NTdlRUlIcnF5bFdVZGMzdFpTUUl6X2IxMVBVRHFDR3BuaF9EMVA4Ty12M3JqVEp1cHdwLTZ4ei1iV0JfXzZlQVNUbzVfZjJ0aDc5U0xYSHNIV21OOHZDRmFNVE01Tlc4UXJJT3JSb3gxS1E4WUNuUUVsaHlhd3BMRWFQcWh4QnBodDlKNENiMVp2Z9IBxwFBVV95cUxPWUhUNjJSbG4xeGs5RzBGNVhBeno0cm9Ra0RiNlRhcndJbi0xa1lWVTFkTThxdTRNOGM5c3pfdndTZnJjaTUwY1J4Qm9QXzYtazJuNjFpenJ3ZG5hVWdWOUxvdl8wQW5aWlV3RTJ3MGJDM1ZOT25BMm92MFdHOVhSQ1FoLWJNRm9USmI1bTFvdUswSlI4cjB3eEhnV3JyTGpGdUZ6N3VtQ1Q2QTllNENFbjduaVhNNDYwNUw5b0Z6WFI5Y0pZdkU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg ETF Expert Moves Estimated Ethereum ETF Approval Date Following New SEC Comments - The Daily Hodl",
        "content": "An exchange-traded fund (ETF) expert at Bloomberg is moving his estimated date for the approval of spot market Ethereum (ETH) ETFs following recent comments made by the U.S. Securities and Exchange Commission (SEC).\n\nIn a new thread on the social media platform X, Bloomberg ETF specialist Eric Balchunas says that spot ETH ETFs likely won’t be greenlit until after the July 4th holiday weekend, which extends to the 8th, since many SEC staff members will be on break until then.\n\n“Unfortunately, I think we [are] gonna have to push back our over/under till after [the] holiday. Sounds like SEC took extra time to get back to people this week (although again, very light tweaks) and from what I hear, next week is dead because holiday = July 8th. The process resumes and soon after that they’ll launch.”\n\nLast month, Balchunas had predicted that the SEC would approve the ETFs by July 2nd after the SEC responded to several S-1 filings submitted by financial giants.\n\nAt the time, it was found that the regulatory agency sent back the filings to the firms for modifications, hinting that approvals were coming soon.\n\nOver a week later, SEC Chair Gary Gensler indicated that the regulatory body would be approving ETH-based spot market ETF applications, but did not give a specific date. At the time, Gensler said the agency was currently working through the required disclosure statements needed.\n\n“It’s really about the asset managers making the full disclosure so that those registration statements can go effective and those lawyers know what that is.\n\nIt’s something our Division of Corporation Finance handles hundreds, if not thousands of times over anybody’s career. It’s smoothly functioning. It’s really up to the asset managers to make the proper disclosures.”\n\nSpot market Bitcoin (BTC) ETFs were approved by the SEC in January, bringing in billions of dollars worth of inflows to the top crypto asset by market cap. Recently, firms have also been filing bids to create ETFs based around Ethereum rival Solana (SOL).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZHFxYTBydkp1WG01UDlCRWxpSFBLMnliYmR5UHRmOURkQXoxS2s1QVJUS3JJc2V6SWczN05VSDNlQjlaTFBlZjJqejZvcmVvZDJ6a00wSDNIdS1QbldIVV9VbElJeC1IV21jTzBkRzI0ZTgybGRrdnpOUEI3dDMtNVRFR005OXpBY05VRjlSX19pRzRsdVk5YW1PMFBBUzdSWTJNSEZ4UEo5aU1QbHhUVnkybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Analyst Predicts Ethereum ETF Launch In Early July - Benzinga",
        "content": "According to Bloomberg ETF analyst Eric Balchunas, the highly anticipated spot Ethereum ETH/USD ETF might launch as early as July 2. This prediction follows reported comments from the Securities and Exchange Commission (SEC) staff on the issuers’ S-1 filings. The SEC requested revisions within a week, indicating a potential swift approval process.\n\nIn a June 14 post on X, Balchunas noted, “Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend. Anything is possible but this is our best guess as of now.”\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nIssuers eagerly awaited feedback from the SEC's Corporation Finance (Corp Fin) division, which received the filings two weeks ago. The review was delayed due to a last-minute shift in priorities, likely influenced by political factors. SEC Chair Gary Gensler previously suggested that approvals could come \"over the course of this summer,\" while Sen. Bill Hagerty (R-TN) indicated a timeline by the \"end of the summer.\"\n\nMarket Movements and Investor Sentiment\n\nThe digital asset market has been experiencing notable shifts recently. According to CoinShares, the market saw weekly outflows totaling $600 million in mid-June, marking the largest outflow since March 2024. This was primarily driven by a hawkish Federal Open Market Committee (FOMC) meeting, prompting investors to reduce exposure to fixed-supply assets like Bitcoin.\n\nBitcoin alone witnessed weekly outflows of $621 million in mid-June, whereas Ethereum, Lido, and XRP saw inflows of $13 million, $2 million, and $1 million, respectively.\n\nPotential Impact On The Digital Asset Market\n\nAdjusting the Ether ETF launch date could be a new catalyst for market dynamics, potentially influencing investor behavior and market sentiment. The anticipation surrounding the launch highlights the increasing integration of digital assets into mainstream financial products and the evolving regulatory framework.\n\nBalchunas emphasized the importance of this development, noting, \"This is ground-breaking stuff,\" about the SEC's progress on diverse financial products to mitigate risks and enhance exposure to digital assets.\n\nWhere To Learn More\n\nFor those looking to delve deeper into the implications of the Ethereum ETF launch and broader trends in the digital asset market, Benzinga is hosting its Future of Digital Assets event on Nov. 19 in New York City. This one-day event will bring together over 1,000 leaders from the digital asset industry and institutional investors, offering a unique opportunity to gain firsthand insights from experts and industry pioneers.\n\nThe event promises a comprehensive networking experience, with 4,000 one-on-one meetings to connect decision-makers, investors, and strategists. This event explores the future of money and the expanding field of alternative asset classes, providing a platform for significant discussions and deal-making opportunities.\n\nAs the launch date for the spot Ethereum ETF approaches, the digital asset market is set for major developments. The upcoming Benzinga event will further facilitate crucial discussions and networking opportunities, shaping the future of digital assets and their integration into mainstream finance.\n\nRead Next:\n\nImage: Ethereum"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNbWRlSzhHYTNJZHNQVml5VERhY2NVMHFuWmE1Z3A2eF9GQ012LWJwT19icmk1aVJxd0pHV0VDRVRxR1M0UnRSU2htM1JlOHc4TUxXZm5hLWxPN3VIUGRCdS1ueUNRWVBZbnpKM0lqR2d0aXpZdWlyRWFrWEJqbEhZdXo3SURLajlra1dzVXF1eS1Ba1J1aTkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in Daily DEX Trading Volume - Crypto Times",
        "content": "Solana has overtaken Ethereum in daily decentralized exchange (DEX) trading volume, according to recent data from DefiLlama. Solana-based DEXes reported $1.148 billion in daily trading volume, outpacing Ethereum’s $736.62 million.\n\nBREAKING🚨\n\n\n\nSolana just dethroned Ethereum in daily DEX trading volume.\n\n\n\nSolana ETF is also filed.\n\n\n\nSeems like the $SOL summer is here👀\n\n\n\nWhat coins on SOL is the next 100x?👇 pic.twitter.com/pao6OKwX4z — EvanLuthra.eth (@EvanLuthra) June 30, 2024\n\nSeveral Solana platforms, including Raydium, Meteora, Orca, Phoenix, and Lifinity, now rank among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap continue to lead the market overall.\n\nImage Source: Defillama\n\nPatrick Scott, founder of Dynamo DeFi, reports that Solana’s DEX volume dominance is approaching 25% for the first time this June. This increase is partly attributed to the popularity of meme coins on the Solana network earlier this year.\n\nSolana’s DEX volume dominance (red) is still rising, on track to break 25% for the first time ever this month. pic.twitter.com/swUUJbG7Ad — Patrick Scott | Dynamo DeFi (@Dynamo_Patrick) June 28, 2024\n\nDespite the recent trading volume success, Solana’s price has experienced a slight 0.5% decrease over the last 24 hours. According to CoinMarketCap, Solana currently holds the fifth position in cryptocurrency market capitalization at $65.2 billion, following Bitcoin, Ethereum, Tether, and BNB.\n\nThe total DEX volume across all platforms reached $26 billion in the past seven days, according to Dune Analytics, underscoring the growing importance of decentralized trading in the crypto ecosystem."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPMXB6Ml80TklrbWgwMFlYb1hnWGp0Nk00NGFJSm1TaGNSS29JSDEtWVFGNW1qZkJSX3l0NnlJTHVwMUlhMTlTSnFJUElVM2RDb2VHV1ZZYUoxcTU2VG0xaC1ESlNCTGNiZHBVLU9LeTdwbmNKODdhVGpGOHF5TDZiQ2dQVEZ6c1lRVFYycG5FRXlNbXUtZ3FHbVBoLXVPZHFkQXA5bVhDQdIBrAFBVV95cUxQYWpvSjd4SEt4VlBVSHRjalJwd0VwUFpDN0RCUUx6blBMRkdnTkJxWXdiUTZkLWxaTW1wdWlmNnJVQUhnSE1ZdlgtRHQ0ekZucHBPOUhOclFuN05FdTlibVZyalhnbVlwMTNtYWFxZGVVZVFKYV9EMHVBMGYxSjh4bmkzSG9PUV9yNThaNjh0aFY4M3E4YTdtbi1QcEF2WGJPNEE1QVp0OUtWVjdM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch Unsurprisingly Delayed as SEC Returns S-1 Forms - Blockhead",
        "content": "SEC delays and ETFs are becoming synonymous at this point. After countless Bitcoin ETF decision delays, followed by endless Ethereum ETF decision delays, we can hardly be surprised that delays are extending to the launch of ETH ETFs.\n\nExpected to launch on 2 July, the fate of the Ethereum ETF launch has been pushed back after the regulator returned the S-1 forms to prospective ETH ETF issuers.\n\nThe forms were returned with light comments and issuers have been requested to refile them by 8 July. However, this does not mark the final filing as there will be one more round before the products can start trading.\n\nNonetheless, the S-1 forms are the second of the two-part process required for the products to go live.\n\nLast week, VanEck filed its 8-A form for its spot Ethereum ETF, leading many to regard the move as a signal that the products could launch as soon as 2 July. VanEck filed an 8-A form for its Bitcoin ETF one week before the launch, suggesting that 2 July would be the equivalent date for an Ethereum ETF launch.\n\nThe 8-A form is a registration document that companies file with the SEC to register a class of securities for trading on a national securities exchange.\n\nBloomberg ETF analysts Eric Balchunas explained on X, \"Sounds like SEC took extra time to get back to ppl this wk (altho again very light tweaks) and from what I hear next wk is dead bc holiday = July 8th the process resumes and soon after that they’ll launch.\"\n\nUnfort think we gonna have to push back our over/under till after holiday. Sounds like SEC took extra time to get back to ppl this wk (altho again very light tweaks) and from what I hear next wk is dead bc holiday = July 8th the process resumes and soon after that they’ll launch… https://t.co/0ZQR7yiBLt — Eric Balchunas (@EricBalchunas) June 28, 2024\n\nHowever, SEC Chair Gary Gensler said Ethereum listings might not happen until September. Nonetheless, Gensler reassured the market that the process was \"going smoothly.\"\n\nGensler insisted that the launch depends on the applicants, not the regulator. \"It's really about the asset managers making the full disclosure so that those registration statements can go effective,\" Gensler said.\n\n\"It's something our Division of Corporation Finance handles hundreds if not thousands of times over anybody's career,\" he added. \"It's smoothly functioning — it's really up to the asset managers to make the proper disclosures.\""
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQVjEwc1FyV2tQZkhyaTZaa2kyVDZJcTI1SGtxdzFaNkpsSFpmMFpuVTdtUm1Ga2VJRXpNcTF3OXNWel80MDMyRE5VMHIxdlBVU3YxS0pKYkUyQzh6WHk0R2Z6UElxcnpWZ3IwdDVNSkVqTkxGYkk0QXU2a2dCMUZJeXVjaW82aVhfVXVtX2ctM05FRFhk0gGaAUFVX3lxTE1ZYVI4RTJjSFZZblFyWFdxWXNsQnlHbGJUSmZoejdZamY4d3EtTlFWX1lrTTMzcEFHLUpWN1JlUTdVQXhXYmNvOEQ2RDRTOWNONFZGbFdMYnN5aW5pbUlJUDZBaXFCeE1zaHJlbldJS3ZMaUZIbU5Md3ZtQUM3LVkwc1VBb1ZvTzFKdklLejE5ZmgzTTRZWTlqX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "What to Expect for Ethereum Price in July Based on Historical Trends - CoinGape",
        "content": "June Month was notably bearish for the cryptocurrency market with many assets revisiting their monthly support. Amid the market sell-off, the Ethereum price plunged from a high of $3887 to a low of $3232 registering a loss of 16.9%. However, the downfall lies within the healthy retracement of Fibonacci tools indicating a strong could allow ETH bulls to counterattack.\n\nAlso Read: Crypto Market This Week: Ethereum ETF, FOMC Minutes, US Job Data & Trade Deficit\n\nadvertisement\n\nEthereum Price Eyes Stability as 78% of ETH is Held by Long-Term Holders\n\nThe near-term trend in Ethereum price is sideways evidenced by a new lower high formation at $3975 in late May. This reversal indicates the overhead supply is high from market sellers and ETH buyers would need time to recuperate its momentum.\n\nConnecting the overhead peaks with a trendline reveals a potential triangle formation as the altcoin has also received dynamic support from an ascending trendline since October 2023.\n\nThe Ethereum price currently trades at $3389 and holds a market cap of $407.3 Billion. If the supply pressure persists, the coin price could plunge another 5% to seek support at the long-coming trendline.\n\nThe renewed buying pressure from the trendline could uplift the asset by 14-15% and challenge the triangle’s upper boundary at $3860. A bullish breakout from the triangle pattern will signal a better confirmation of uptrend continuation.\n\nAlso Read: ETH/BTC Pair Poised for Breakout as Ethereum ETF Launch Approaches: What’s Next?\n\nIn a recent tweet, the prominent crypto analytics firm IntoTheBlock revealed a striking statistic: 78% of Ether is currently held by long-term holders. Despite the volatility in Ethereum’s price, the proportion of ETH held by long-term investors has steadily increased, indicating a strong belief in the asset’s future value.\n\n78% of ETH is owned by long-term hodlers pic.twitter.com/9vb5kaUIar — IntoTheBlock (@intotheblock) June 28, 2024\n\nEthereum’s price performance in July has exhibited a mix of gains and declines over the past several years, reflecting the broader market’s volatility and investor sentiment. The biggest gain was +56.62% in 2022, while the largest drop was -27.29% in 2017.\n\nOn average, July has a positive return of +6.95%, though the median return is -4.41%, indicating mixed performance.\n\nHowever, with the ongoing development around U.S-listed Ethereum ETFs, anticipated to launch around mid-July, the odds strongly lean on buyers’ favor.\n\nTechnical Indicator\n\nBB Indicator: An upswing in the lower boundary of the Bollinger Band indicator losing bearish momentum and additional support for buyers to rebound.\n\nMoving Average Convergence Divergence : A negative crossover between the MACD and signal line highlights the near-term trend is intact and bearish.\n\nFrequently Asked Questions (FAQs) 1. What role do long-term holders play in Ethereum's market stability? A3: Long-term holders, who currently own 78% of Ethereum, play a crucial role in its market stability. Their sustained investment indicates a strong belief in Ether's long-term value. 2. What impact could the launch of U.S-listed Ethereum ETFs have on its price? The anticipated launch of U.S-listed Ethereum ETFs could significantly influence ETH price by potentially increasing buyer interest and investment. This development is expected to provide easier access for a broader range of investors. 3. How does the \"Fear and Greed Index\" affect Ethereum trading decisions? The Fear and Greed Index measures investor sentiment in the market, which can be a useful indicator for traders to gauge the general mood among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUmk2cExjdGp4SXhOMlZ2RXItQUJfUE5MYWM5eDZqeUxfN2F1aTROaXZHbU9hdTFCWkt0ME5VaTBwSWIzbkpFbXZMTWl3RW5uUkFCbUtPYjlkV2FPeXVkRzkxaUNCOWVNMDFiWmxqV3pTTFV4UXBjSDdDVU9fckdHd2E4T2ZJeVN20gGOAUFVX3lxTE5VT2hab24yU19LUlhKS0IwaWh2enNsSE9GSE4wY3FmLUVGWVNnX0xPd1hJaXl6TEs1c0xUamx2ZjFUNHBxLUx5MmY5b25pZzRjYnVKZFNWM3FsWDEzM1NsVmloeW5rRFRrcjBQRkFnaHVqcHNuVEstNURTSFk3bGI4eDliV2NHVmFSNjJjTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s ‘failed’ breakout – When will ETH’s price breach $3.5K? - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 3% in the last 7 days\n\nA key metric revealed that ETH was undervalued, hinting at a recovery on the charts\n\nEthereum’s [ETH] price action turned bullish on 28 June, giving investors hope for a recovery from their past losses. Unfortunately, this bullish trend didn’t last for long, as the coin recorded a price correction soon after. This led to both its weekly and daily charts flashing red.\n\nEthereum faces rejection\n\nAfter the aforementioned hike in price, ETH’s bears stepped up again and pushed the altcoin’s price down by more than 3%. At the time of writing, the king of altcoins was trading at $3,391.51 with a market capitalization of over $407 billion.\n\nThe worst news was that Ethereum got rejected from the upper limit of a bullish wedge pattern in the recent past. As per a tweet from ZAYK Charts, a popular crypto analyst, the token’s price started to consolidate inside the pattern in late May. A successful breakout could have resulted in a 30% price rise, which might have allowed Ethereum to go past $4k.\n\nInterestingly, a similar pattern had emerged earlier in March, only to break out in May. This allowed the altcoin to hit $3.89k on the charts. However, since ETH got rejected this time, the chances of history repeating itself might be slim.\n\nWon’t ETH recover?\n\nAMBCrypto then took a closer look at Ethereum’s current state to see whether it would fail to break out of the bullish pattern.\n\nWe found that market sentiment around the king of altcoins remained bearish. This was evidenced by the dip in its weighted sentiment after spiking on 28 June. Its network growth also dropped slightly, meaning that fewer addresses were created to transfer the token.\n\nNonetheless, a few of the metrics were in favor of a successful breakout.\n\nFor example, the MVRV ratio has improved over the last few days, which can be interpreted as a bullish signal.\n\nAMBCrypto’s assessment of Glassnode’s data also revealed that Ethereum’s NVT ratio had declined sharply. A drop in this metric usually means that an asset is undervalued – Implying an incoming price hike.\n\nAMBCrypto then took a look at Hyblock Capital’s data to look for immediate support and resistance levels.\n\nAs per our analysis, it would be crucial for ETH to touch and go above the $3.5k-mark in order to sustain a bull rally as liquidations would rise sharply. Generally, a hike in liquidations often results in price corrections on the charts.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOn the other hand, if bears continue to dominate and ETH’s volatility rises in a southbound direction, then it might fall to $3,060."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQMlZ5bjR3RjMyLUpZWFYwWkl1aER6MFFiOVcxX3JlcElkQUpodUZ4N3E3RkxfTXVpSlFsRmpTc2F0Rll6c1V3ejlwcmVBbk1KZzJSbjRjTHNzOEJwaVRKa1c5YXg1bTAtUUxRSGRxcUh5bEFsVjYzTEZKTVM5cWRYVFdkMktZb2FEeEE0N25VMWhnU2ppQWN5Tkw4VjZBYVZHVkJjbzZB0gGrAUFVX3lxTE92NXJDQkFlX1NHTE5Fc3dOQXFLeTRpVUNacnZUWlkwa3htWFRYa3lzLXV3aEpUbUVMN3VabDM2bWlOS2UxVk1hQXhHVDZjNmZ0bE1OQ005OWh0R2Y3NWE0LXF1S2RwdzVJMDIySHBnbkUyRHJiUzJXdWRIS1c3VEJ4YzBoTHZLeUlrVEZ5NC05SU5VZk9XWUEtNkRsSVdPWndQUkJESVFXNVZXbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "XRP to Skyrocket Next Week? Ethereum (ETH) Not Losing $3,370, Will Solana (SOL) Reach $150 Again? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP might have been in a downtrend, but the current state of the asset implies the possibility of a reversal. The current state of XRP is perfectly described by saying that not many people are selling it, but almost no one is buying it either.\n\nThe chart shows that XRP has had difficulty increasing in value over the previous few months. The lack of movement in the price can be explained by the volume profile, which shows minimal trading activity.\n\nGiven the state of the market, it appears that neither buyers nor sellers are willing to take large positions based on the low volume. A spike in volume might be interpreted as a sign of renewed interest and could raise the price.\n\nWith an RSI of approximately 41, XRP is in the lower neutral zone. This implies that there may yet be room for growth before overbought conditions materialize. An increase in buying pressure and the potential beginning of a new uptrend would be indicated by an RSI rise above 50.\n\nAdvertisement\n\nEven with the recent decline, XRP still has solid fundamentals. When the legal dispute between Ripple, the company that created XRP, and the SEC is resolved, it may benefit XRP's price. Further providing a strong basis for future expansion are Ripple's continuing partnerships and technological developments.\n\nEthereum stays composed\n\nEthereum has been actively trading at around the $3,400 price threshold, but it has also been showing some worrying signs, while the 100 EMA is not considered the most reliable technical level for an asset. However, things may turn out better than expected.\n\nBecause it closely resembles the 100-day exponential moving average (EMA) (orange line), the chart indicates that Ethereum has been able to maintain above the $3,370 mark. With the recent market turbulence, this level has served as a support zone, stabilizing the price of ETH. Volume analysis shows inconsistent signals.\n\nEven though trading volume has not increased significantly, the consistency shows that interest in Ethereum at these prices is stable. It is important to monitor this metric, because a spike in volume may indicate a more forceful move in either direction.\n\nEthereum is presently in the lower neutral zone, according to the relative strength index, which is circling 43. This points to potential upward movement before overbought conditions materialize. Additional proof of bullish momentum would be provided if the RSI could move closer to the 50-point level.\n\nIndicators of long-term trends, the 26-day and 200-day EMAs, are also displayed on the chart. As of right now, Ethereum is trading above the 200-day moving average, a bullish indication for the long run. It is still below the 50-day EMA, suggesting some short-term pessimism.\n\nEthereum's price action is heavily influenced by market sentiment. The overall trend is still positive despite a few negative signs. Potential price increases for Ethereum are well-founded due to its strong fundamentals, which include continuous network upgrades and growing user adoption.\n\nSolana struggles on way up\n\nSolana has been actively fighting for the $150 threshold for the last few weeks. However, despite positive fundamental developments that include the introduction of Blockchain links (or blinks), which are a specification that allows a user to complete an on-chain transaction on any website capable of displaying a URL, the price of the asset has not been moving actively.\n\nIn order to verify a bullish reversal and pursue the $150 target, Solana must close above numerous moving averages. Solana has recently found support at the 200-day EMA or roughly $130. Numerous tests of this support level show that there is significant buying interest at this price.\n\nMixed signals can be seen in the volume profile. Although there has been some trading activity, not much to indicate strong bullish momentum has emerged. The market's growing confidence in Solana's price action would be indicated by an increase in volume. For bulls, a move in the RSI above 50 would be positive."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQMGVvT3BaTjdKVXFvUEFmWkNaQ0FYMU9yM01oX29ibENtTnVHVDlfYVhYS2VsdlgwXzlwRHFnSWZLSTU3aFhOcnFSZm10UU5Jall4V1hUb0NJaXEyOXE3Y0U4dkFMQXVzTkJ6Y19yVC1sajBrSlJEbENOdGtXdVNmbi1McEFsTE1nRElpazRzV0JoQV8yWEt6elFzWVRBQXdI0gGmAUFVX3lxTE9rSlhObFV5SlUzbGo4VnI2Zzl1SWVGQ0d4eTBVeTliVTk2MTBfSEVvdE92dF9RZHBDX0hnaTF4UmUxLTgwcEdnbjhsanpwUk9yUnVDanhBNXpFaGhidGJrN3ZGVzl6OHE4Ujc5blIzeURZSFg1NXV5TlZPcmRRMzRjcWJwX3k2ZHNYWG5WOXluczVqX0VENnhSRS1fZFF0TlFDUlpTYWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Bulls Eye $3,500 as Hopes for a Bottom Escalate - CryptoPotato",
        "content": "Ethereum’s price is currently trying to penetrate a key level, and if successful, the recent correction could finally be over.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nAs the daily chart displays, the Ethereum price has been dropping since getting rejected from the $4,000 resistance level back in May.\n\nThe market has since dropped below the $3,500 level, but it is currently testing it from below. If the price is able to reclaim this level, the cryptocurrency could finally rally toward values higher than $4,000.\n\nOn the other hand, in case of a rejection, if the price also loses the long-term bullish trendline and the 200-day moving average located around the $3,000 level, things can get very ugly for ETH.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, some early signs of bullish reversal are surfacing. The price has just broken above the large descending channel pattern.\n\nHowever, it is currently struggling to break through the $3,500 resistance level.\n\nYet, with the RSI indicating that the momentum is bullish, the market might be able to break higher and begin the next upward move. However, this scenario would fail if the price drops back inside the channel.\n\nSentiment Analysis\n\nBy TradingRage\n\nFunding Rates\n\nTo complement the technical analysis above, it would be advantageous to analyze the futures market sentiment metrics. This chart shows the funding rates metric, one of the key sentiment parameters. It shows whether buyers or sellers are executing their futures orders more aggressively.\n\nAs the chart demonstrates, the funding rates have been gradually decreasing since the first price rejection from the $4,000 level back in March. The current funding rate values indicate that the futures market is no longer overheated, and the price could finally begin another sustainable rally higher."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQN2djeGdnZjB0MkVMc2RoVnlwcFp5MWR4NnYzYVhGXzBTX3hPLVFXT3JNY25DRWpYMzlhanZHN0F3RFNUQjB6Rk9rYnl5NmQ4dW9zbEltMjZxWVAwMmUzVEd0WTlaZU9vbE9Wbkl0S3RoNm9mU2V6VnY1WmdCcjBsZ2ZfLWxRR1NfRmYxVW1IZWxMcV9lWlJKRHo3dUfSAaIBQVVfeXFMT0RlVmpfYVpGZzhYbU1hMy16TkFYemRwck5GRUo0RERWN3pSdW52OHgzTVR3RDVxUWZCTVZJWkI5dHVrRmdNNW1Eb1RHVklDSGVYTUJuLVRmY1N4ZnAyU3FfalNmSThMSEdIR1dhX2V5VUFEbVRYb1FlRnBxRU9reV9YcTJLV21UNDZ3RzV4MkNZNjZyVVF1blo0QklQU18zSEh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "ETH Price Surges 5% Amid Increased Whale Activity Ahead of Ethereum ETF Approval - CoinGape",
        "content": "As we say goodbye to a lackluster Q2, the broader cryptocurrency market is experiencing a robust rebound, with Ethereum (ETH) price surging by 5% to exceed $3,500. This surge coincides with increased whale activity ahead of the spot Ethereum ETF launch slated for July 8.\n\nEthereum Whale Activity Spikes, ETH price Jumps\n\nOn-chain data provider Spot on Chain has reported that a significant whale, reportedly Abraxas Capital, has withdrawn a massive 60K ETH, valued at $203 million, from crypto exchange Bitfinex, at a price of $3,387 in the past 24 hours. The ETH price has already rallied 4% since then giving the whale an unrealized profit of nearly $6.5 million.\n\nadvertisement\n\nA massive whale (probably Abraxas Capital) has withdrawn 60K $ETH ($203M) from #Bitfinex at ~$3,387 in the past 17 hours. The whale then lent $ETH to #Spark to borrow $119M in stablecoins and deposited it to #Binance. The $ETH price is up by 3% (17H), suggesting a $6.27M… pic.twitter.com/6oomnzlrSq — Spot On Chain (@spotonchain) July 1, 2024\n\nAs of press time, the Ethereum price is trading 4.19% up at $3,499 with a market cap of $420.7 billion. The daily trading volume for Ethereum has also shot up by 50% to $9.8 billion. For this ETH price rally to sustain, it must give a daily closing above $3,500 so that the bulls can eye the next target levels of $4,000 and above.\n\nAmid the strong excitement around spot Ethereum ETF, whales have been swapping other altcoins for ETH recently. Last week, a PEPE whale converted $18 million of their PEPE coins to Ethereum expecting a major rally going ahead.\n\nAlso Read: PEPE Whale Shifts Focus To Ethereum As ETF Optimism Builds\n\nEthereum ETF Excitement Continues\n\nAs reported by CoinGape, the launch of spot Ethereum ETF faces some delay from the previous timeline of July 4. Last Friday, the U.S. Securities and Exchange Commission (SEC) sent back the S-1 forms to issuers asking them to resubmit them by the 8th of July.\n\nETF Store President Nate Geraci has stated that the S-1 revisions are relatively minor while suggesting that the regulators can approve issuers for trading within the next 14-21 days. While the timeline of the launch still remains uncertain, the SEC has hinted at the possibility by the summer end. This could probably keep the ETH price moving forward amid the investor excitement.\n\nNate Geraci has also made the prediction that the spot Ethereum ETF will be the second-most successful debut in the ETF history, only after spot Bitcoin ETFs.\n\nEarly (& easy IMO) prediction… Spot eth ETFs will be 2nd most successful debut in ETF history, only behind spot btc ETFs. So two most successful ETF launches in 30+yr ETF history will occur this yr. Bitcoin & ether. Paying attention yet? — Nate Geraci (@NateGeraci) June 30, 2024\n\nAlso Read: What to Expect from Ethereum Price In July\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQNXBROXNmd2doeHR0cjhISWRSRGZBSG00ZkROMmZZMFBfS2RBcHNwTW4xRWFDRW1YS0tRdTdhd2d3X2ZlSUpQdTlvWFcwYThmMi1JZEVaUjJ5MjBWb3NsdXdES29qUjlCaHFxLUNaRjZqcGtNVWJLYUQ4MmExcFloN3JlWFZRdnFsTHBfV0VORzYwdTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Major Crypto Whale Swaps $18M from PEPE to Ethereum - Crypto Times",
        "content": "Whales are making waves in cryptocurrency, with notable transactions drawing market attention. Recently, a whale identified as 0x837 converted a substantial $18 million from PEPE to Ethereum, coinciding with mounting anticipation for a potential spot Ethereum ETF.\n\nStrategic Stakes Amid ETF Buzz\n\nThis strategic shift involved staking significant amounts in the Compound protocol, reflecting a tactical approach to yield generation amidst evolving market conditions. The movement of funds by 0x837 suggests a preparation for potential changes in market dynamics due to the ETF speculation.\n\nFurthermore, this activity aligns with a broader market optimism for Ethereum as stakeholders await regulatory nods. Historical precedents from Bitcoin ETF launches hint at a strong institutional appetite for similar products in Ethereum, although projections suggest Ether inflows might measure around 33% of those seen with Bitcoin.\n\nMarket Reactions and Price Adjustments\n\nThe transaction significantly impacted PEPE’s market price, which witnessed a decline amid these large-scale movements. On the other hand, Ethereum has shown resilience and recovery potential in trading sessions, indicating a bullish stance from investors.\n\nThe potential approval of an Ethereum ETF could redefine investment landscapes and bolster Ethereum’s market position. As developments unfold, the crypto community remains vigilant, ready to respond to shifts steered by influential market players like Whale 0x837.\n\nIn this evolving scenario, the interplay between regulatory decisions and whale activities continues to sculpt the cryptocurrency ecosystem’s future. Such dynamics underscore the complex yet pivotal role of major stakeholders in influencing market trends and asset valuations in the digital age."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1BbG9LWVRjUWtxVVNZaFk3MzZGczJKdl82ZVVxMnJCbE9SUW9seUk3TG4wN1VZQ1RWWWt6bjVxWWVTVl9aMktOTzM0M2J4eDlORU1VemctaDJCR3hhVmUtbC1HVzJpaE85a1IyZlRxT180eTdZb1A2bzMtQk1NZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Le lancement des ETF Ethereum encore repoussé. Découvrez pourquoi… - Cointribune EN",
        "content": "Mon 01 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nInitially expected in early July, the launch of Ethereum ETFs has just been postponed by the SEC, plunging crypto investors into palpable uncertainty. This unexpected decision, underpinned by additional requests for reviews of the S-1 forms, highlights the persistent regulatory challenges faced by the adoption of digital assets.\n\nThe SEC’s new decision regarding Ethereum ETFs\n\nThe U.S. Securities and Exchange Commission (SEC) has decided to delay the much-anticipated launch of Ethereum ETFs, initially planned for early July. This decision follows additional comments issued by the American financial regulator on the S-1 forms submitted by potential issuers of these ETFs. Issuers now have until July 8 to resubmit their revised forms, potentially pushing the launch of Ethereum ETFs to mid-July or later.\n\nThis delay is part of a two-step process for the approval of Ethereum ETFs. The first step, involving the approval of form 19b-4, was completed in May. However, the S-1 forms, which represent the second step, do not have a fixed deadline, leaving the issuers dependent on the SEC’s timeline for their review and approval.\n\nMarket Reactions\n\nWhile some crypto industry players remain optimistic about a quick approval following the revisions of the S-1 forms, others worry that this delay signifies deeper regulatory challenges. Analysts estimate that final approval could come within two to three weeks following the submission of revised forms, but the exact date remains uncertain. Crypto investors, who had initially anticipated approval in early July, now need to reassess their short-term strategies.\n\nMoreover, the implications of this delay extend beyond just the launch of the ETFs. It is indeed a critical test for the entire crypto sector. Once approved, Ethereum ETFs could not only gain institutional recognition but also transform the landscape of crypto investments, offering new opportunities for investors and consolidating Ethereum’s position in the global financial market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOUmY1amVoa2tWdjk2MWJhRFVKVGM0cmNEY3JJQUd1T1VTR0g1Tjc3VERfTjc3Z2dBNVVoZFFBVmpXSUdDZlU2VUxYaHVwTDVEUEpvYl9uTXRDTVhybEo3TVJsbTNSNzlfN1NjZG1lN2J0SloweFhVQ2FOZWhueUlHOUtGTHdQaTDSAYwBQVVfeXFMTUJBU2MzaWFnMzNfRzRKckJtRGNMZEd4SkRnX0x0TG9CNWVqQzFRS01YMnQxb2JBaHIxRnBkb0lZRklzWm9fTkQ0MFhnMEhJMEZCc2gyVjZWeXoxVDl2MzZNRmtNNDNfNUZaa1VEZE5zYkRaNXZXWk5QM3hFRVJJVDQyeUdibzl4dExWd24?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Hints at Model to Speed up Ethereum Transactions - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum cofounder Vitalik Buterin has hinted at new technologies that might fuel faster transaction confirmation times for users. As shared in a lengthy blog post, Vitalik Buterin hinted at epochs and slots as the go-to models to help the Ethereum network stay competitive.\n\nAdvertisement\n\nEthereum needs speedy transactions\n\nIn Buterin's view, Ethereum is better off than it was five years ago in terms of transaction finality metrics. The blockchain now averages 5 to 20 seconds for transactions, which compares well with its traditional finance competitors.\n\nEpochs and slots all the way down: ways to give Ethereum users faster transaction confirmation timeshttps://t.co/lfCXrFm6A1 — vitalik.eth (@VitalikButerin) June 30, 2024\n\nHowever, with the slots and epochs architecture, the Ethereum cofounder argued that finality could drop down to 16 seconds. While the protocol has worked hard to pilot this slot and epoch architecture, Buterin noted that more improvement to this tech stack is still needed.\n\nButerin noted that Ethereum has always created an enabling environment for its constituent protocols, like layer 2, to create their own model for transaction confirmation. While this strategy has worked well, with layer-2 solutions proven to be faster, he believes it is time to guarantee efficiency.\n\nHe remains optimistic about the future of the Ethereum blockchain and how advances in transaction speed times on L1 can make the lives of L2 developers easier.\n\nMatching competition\n\nThe layer-1 blockchain space might be considered saturated, however, it has continued to evolve, with each new entrant boasting of enhanced capabilities. Ethereum’s key competitors, including Solana (SOL), Cardano (ADA) and Fantom (FTM), all boast advanced technology in terms of transaction speed.\n\nWhile Ethereum still dominates the DeFi ecosystem, and the new proposals to increase its confirmation speed might only help make it more endearing to users. Overall, if the developers of the Ethereum ecosystem are able to promote this new futuristic architecture, the biggest beneficiary will be ETH.\n\nCombined with the expectations for spot Ethereum ETF trading this month, there might be a massive uptick in price moving forward."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUjVub1Q3R0FlNGdLc3l2TFd0NzN5bWwwN2czWTBUdXlVcE5aVjRsS2ZJc2ZYNTFSbUREMjl0dWdJWXRTYi0tMHFmbkVIUGdCNFdiem9pTXNOVlA5VkwxQXFHWDNLbG52Skk4WVVzSktmRlVqWHdGNVdHdm0ya2JsaENWbHZMZjYxVm1nVlRXaXY4aVBpblHSAZsBQVVfeXFMTnJJSE12YmQ4NUR2c0poaXJBd3ZQS2I5bTF5THg4dzJXZ3ljOE5WblFJbThPemg2dXd5bkZReVlMbTR2ZE9xWFFjQjZ6c0NqYXNUaHlOdDFJY1NqbF83NDJfUjdxYTdZMDlYTWJGYk9qZTRicUJRVkg3SlhMM094MlFCNFY2akNnejJpQUVvX0U0c0RSaDhQMWIwQW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Suffers $61M Outflows, Worst Performance Since August 2022 - CryptoPotato",
        "content": "Digital asset investment products experienced their third consecutive week of outflows amounting to $30 million, although last week showed a significant decrease. While outflows for Ethereum continued, investor sentiment surrounding Bitcoin appears to be slowly changing.\n\nAccording to the latest edition of CoinShares’ Digital Asset Fund Flows Weekly report, most providers recorded minor inflows, but this was counterbalanced by Grayscale, which saw $153 million in outflows.\n\nTrading volumes increased by 43% week-on-week to $6.2 billion but are still well below the yearly average of $14.2 billion, the asset manager said in its report.\n\nOver the past week, multi-asset and Bitcoin ETPs led the inflows with $18 million and $10 million, respectively. Short-bitcoin products experienced outflows of $4.2 million last week, suggesting a possible shift in sentiment. Several altcoins saw inflows, with Solana receiving $1.6 million and Litecoin recording $1.4 million. Chainlink and XRP also witnessed inflows of $0.6 million and $0.3 million respectively.\n\nInvestment products based on Ethereum experienced the largest outflows since August 2022, totaling $61 million, bringing the two-week outflow total to $119 million, making it the worst-performing asset year-to-date in terms of net flows.\n\nDespite positive sentiment towards crypto this year, blockchain equities have faced outflows of $545 million, representing 19% of assets under management.\n\nIn terms of region, the US dominated the charts with inflows of $143 million, followed by Brazil and Australia with $7.6 million and $3 million in weekly inflows respectively.\n\nContrastingly, Germany, Hong Kong, Canada, and Switzerland faced outflows of $29 million $23 million, $14 million, and $13 million respectively during the same period. Sweden also recorded outflows of $4.3 million."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVUFEaUgySlU3Y25YN1BNb1hwdXk5VWd6TElrX0JEOVpuaVhUbzhNeG8zdmxTT3VyOWc3R3AtWWRadGMxbzVYcUM5N1BDREFrWWNXcTUtTzAyaV9WbGdwZUdWWU1ndnZXLVQ1QldWVUI3ak1qNDk4NE9NMGdncVRZY1VmejRESkZZdGs1UWh1MXBGdEXSAZgBQVVfeXFMUEtaM1NsSFlsMGNNVFhtNEo2dVFXWWxRaHdYYTc5bDYwLVFZbzRyUnBTclp6NTdPNkc5SDh6QWtWdFgyLXhZSjNXYm83TVVvdndFNTZkbDV3T3lEYUFVTVdqZUx4OGtlbmVFdzBza2gyakZWT3JSR002YzVlZlVCcEdTRnVQdzN3eTFoc3QzWXBWUWJjR1FiUk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price under pressure? A look at on-chain data suggests… - AMBCrypto News",
        "content": "The number of addresses on the network has been falling for the last seven days\n\nETH supply on exchanges fell, reducing the potential of a sell-off\n\nThough Spot Ethereum [ETH] ETFs would begin active trading in a few days, activity on the blockchain’s network has been discouraging. AMBCrypto found that out after evaluating the project’s network activity.\n\nAt press time, we observed that Ethereum’s active, new, and zero-balance addresses had dropped. By definition, new addresses refer to unique users making their first successful transaction on the network.\n\nActivity falls, but there is a catch\n\nThis metric acts as a measure of traction or adoption. On the other hand, active addresses track the number of users participating in transactions. When this metric rises, it means an increase in the level of user engagement and growth.\n\nHowever, at the time of writing, active addresses had fallen by 15.45%. in the last seven days. New addresses were not spared either with a 6.50% decline.\n\nThis development comes as a surprise considering how close the projected ETF launch is. If this decline lingers, the price of ETH could be affected. This, because a drop in Ethereum’s network activity could mean less demand for the cryptocurrency.\n\nAccording to CoinMarketCap, ETH’s price was $3,379 at the time of writing. This represented a depreciation of 3.35% within the last week.\n\nAnother indicator AMBCrypto examined was the Exchange Supply Ratio. This is the ratio of coins reserved in exchanges, relative to the total ETH supply.\n\nWhen it hikes, it means that the number of coins sitting on exchanges is moving up. A potential consequence of this is a rise in selling pressure which could later on lead a price fall.\n\nHowever, at press time, the ratio seemed to be falling, according to data from CryptoQuant. This decline lowers the risk of a sell-off as holders seem to be comfortable locking their assets for safekeeping.\n\nETH traders are not confident\n\nAs funds move away from exchanges, the potential for a bull run rises. However, for this to affect ETH in a positive manner, buying pressure needs to rise.\n\nIf this is the case, ETH’s price could climb towards $3,600 within the first few days of July. However, if the opposite happens, the value could consolidate between $3,200 and $3,400.\n\nAdditionally, Ethereum’s Open Interest dropped from the value it had on 27 June. OI, which is its short form, refers to the value of open positions in the derivatives market.\n\nAn increase in this metric implies that traders are involved in a lot of speculative activity. On the contrary, when it falls, it means that traders are closing existing positions and taking money out of the market.\n\nWith a value of $13.14 billion, ETH’s OI implied that participants are not refraining from opening positions to capitalize on movements from the price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nShould the value continue to fall, ETH’s price could also follow in the downward direction. However, this prediction might be invalidated if open contracts increase and buying pressure in the spot market follows.\n\nIf this is the case, ETH could begin a hike towards $4,000."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQX09mZlVYY2p6R2QzbzNLS2JlSDBxY25OUS1NRkJJRTU0R3ZQcmFnbkF4N1gtM2dBT2ZPV3pTdUhHV193eENISEFlSGNJUlhjVnd2MHg4LUVoSGpnWmJMdm9ndFU5YVdoY212ODBZUUlwajVMZGU2UC1UMUpVZGlOcWE2eGIzX1ZUVmZIYlVSQTdJZUtyOXVveWhWVFY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Frais de gaz Ethereum au plus bas : Découvrez ce que cela cache vraiment ! - Cointribune EN",
        "content": "Mon 01 Jul 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nOn June 30, 2024, a historic milestone was reached for Ethereum: the network recorded its lowest gas fees since 2016, a piece of news that resonates like an earthquake in the crypto ecosystem. This unexpected phenomenon occurs in a context of high transactional activity, redefining the economic dynamics of the world’s second-largest blockchain. Why this spectacular drop in gas fees, and what are the implications for the future of Ethereum and the crypto sector as a whole?\n\nA historic drop in gas fees\n\nSo, on June 30, 2024, the Ethereum network recorded an average gas fee of 3 Gwei, or about 0.14 dollars, according to Dune Analytics data. This drastic decrease marks the lowest level since 2016, offering a sharp contrast to the exorbitant fees observed during the NFT bubble in 2021. At that time, massive demand in the NFT sector drove transaction fees to new heights, leading some analysts to question the viability of the Ethereum network and explore more affordable alternatives like Solana.\n\nToday, despite sustained transactional activity, gas fees are surprisingly low. This situation is attributable to a series of technological improvements, including increased efficiency of the layer 1 market and the integration of layer 2 volumes. The introduction of “blob transactions” with EIP-4844 also played a crucial role in increasing the network’s scalability. These innovations have smoothed transactions while keeping costs to a minimum, a technical feat that redefines Ethereum’s capabilities.\n\nImplications for the Ethereum ecosystem\n\nFirst, this reduction in transactional costs could revitalize Ethereum’s appeal to crypto developers and users, particularly those who had migrated to more economical alternatives. By making transactions more affordable, Ethereum once again positions itself as a preferred platform for decentralized applications (dApps) and daily transactions, potentially increasing adoption and innovation on the network.\n\nThis development also has significant implications for the network’s security. Historically, high gas fees served as a protective mechanism against denial-of-service (DDoS) attacks by making attacks costly. With the decrease in fees, it is crucial that the scalability and efficiency improvements introduced by recent updates are sufficient to maintain network security against a potential increase in attacks.\n\nFrom an economic perspective, the decrease in fees also means that the second-largest crypto by market capitalization is less deflationary than before. With the amount of fees burned being reduced, Ethereum’s total supply is increasing again, altering the dynamics of supply and demand in the market. This situation could influence investor perception and the long-term strategy of network stakeholders.\n\nIn conclusion, while the decrease in gas fees is positive news for users in terms of cost and accessibility, it demands continued attention to security and economic sustainability issues. The next steps for Ethereum will be to balance these different aspects while continuing to innovate to stay competitive in an increasingly saturated and demanding blockchain environment.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPZjVDS0JfRjAxclpZWHFsVjVTQ3RIMlR2MHQ5TG56cm1zQlZTR0dEQWg1azZ0ekIwMndpbkpWS21Wc09DZlQ3UHdGOVB0SDNkSzNIaFhVTm5pelhDUHh3OEpaeWVHRHhlLV9hOWFYaEpNcnc0dy1xeTlBWVJnQTVaYy1iTGpIZXROdXZj0gGQAUFVX3lxTE14dHo4MnpjQ0YyQVozT1Rrc3J0d2NjU2NqUVJHbG1keDFBcVVnNWhFOTJNOUxrN2U5YXBlT0dLb0x4aDlUS0VOZGd3SHBEWDdUN1hFV1FUOURmSVFYb1ByV3AtdzlsemZmRG5QXzR5ZElfTU9kaUFobFhKMk9FTW5BMUVhMmNQdUZrZkliaEhVUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum to ATH in 2024? Why ETH’s surge has excited investors - AMBCrypto News",
        "content": "Selling pressure on Ethereum was high in the last week.\n\nMarket indicators were bullish on the token.\n\nEthereum [ETH] finally gained bullish momentum at press time. If the latest data is to be considered, then ETH might be getting ready to reach new highs by the end of this year.\n\nLet’s take a closer look at what’s going on.\n\nEthereum to breakout soon\n\nAMBCrypto’s look at CoinMarketCap’s data revealed that ETH’s price increased by over 2% in the last seven days. In the last 24 hours alone, the token’s price surged by more than 3%.\n\nAt the time of writing, ETH was trading at $3,488.88 with a market capitalization of over $419 billion. Thanks to the recent price increase, only 10% of ETH investors were at a loss, as per IntoTheBlock’s data.\n\nThings can get even better for the token as a bullish pattern appeared on ETH’s chart. World of Charts, a popular crypto analyst, recently posted a tweet highlighting a bullish falling wedge pattern.\n\nETH’s price started to consolidate inside the pattern in May, and at press time, it was on the verge of a breakout.\n\nIt was interesting to note that ETH got rejected from the upper limit of the pattern a few times earlier. However, World of Charts mentioned that there were still chances of a breakout.\n\nIf that actually happens, then investors might witness the token touching new highs by the end of this year.\n\nWhat’s there in the short term?\n\nAMBCrypto then planned to take a closer look at ETH’s metrics to better understand what to expect in the short term. We found that selling pressure on the token increased.\n\nAs per our analysis of Santiment’s data, Ethereum’s Exchange Inflow spiked last week. Its Supply on Exchanges also increased, meaning that investors were selling the token.\n\nWhales remained confident in the token, as ETH’s supply held by top addresses increased.\n\nA few other market indicators also looked optimistic. For instance, the MACD displayed the possibility of a bullish crossover.\n\nThe Relative Strength Index (RSI) also registered an uptick and was headed towards the neutral mark at press time.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nMoreover, the Chaikin Money Flow (CMF) followed a similar increasing trend, indicating that the chances of a price uptick were high.\n\nIf that happens, then investors might witness ETH touching $3,895 in the coming days. But if things get bearish, then ETH might drop to $2,877."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBwaGdLNDZ3UE50d0Vkc1o3MnNUU3lrZlNfTF9EUTF0TUs3UFVITElpY2FuM0tVLWlQVEtwYk1rWTNTUWpvYVl2WkxaQkxhUlBPcDk0UUZLYmlFMkxqVnUyNXBnQ1ptSkQxQXE5YnFSNG9NTkJMN0tOajU5SE96Z9IBgwFBVV95cUxQaGstaWhvWkJUVk4zS2pFZV9tQ3ZiVHVIXy1zWnFSdGRyU1VadmtuOUdPallpUFRJVE9vdXM5NEVoTVBMcS1tRUdGNGZzRHJpdnh6WUFOZlc4S2FaSUZOdlJITGJkM2wtS2trRmdMUlgtbVdURDRCN3RQVHIwNUdpVE02TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Here's How Rich Ethereum Founder Vitalik Buterin Really Is - U.Today",
        "content": "Arkham has updated a report detailing the wealth of Ethereum founder Vitalik Buterin, estimating his net worth to be at least $833.83 million.\n\nAdvertisement\n\nButerin's wealth stems primarily from his role as the co-founder of Ethereum, where he received a significant allocation of the altcoin during its launch in July 2015. At its peak in 2021, the value of his holdings briefly pushed him into billionaire status, as ETH surpassed $3,000 per token.\n\nCurrently, Buterin's known crypto holdings amount to approximately 245,278 ETH, valued at $831.2 million. These holdings represent a significant portion of his net worth, which also includes investments in projects such as StarkNet. However, over the years, Buterin's ETH holdings have decreased, in part due to sales and the inflationary design of the network.\n\nAdvertisement\n\nAt the same time, Buterin's ETH holdings have consistently represented a small fraction of the total, in line with his claim to never hold more than 0.9%.\n\nETH to USD by CoinMarketCap\n\nWhen comparing his holdings to other top ETH holders, Buterin stands out as the leading individual holder, while entities such as exchanges and institutional managers dominate the top ranks. Despite fluctuations in crypto prices, Buterin's wealth remains closely tied to his crypto investments, including non-ETH tokens such as KNCL, WETH and DEGEN.\n\nThe estimated net worth of almost a billion dollars should be considered a conservative figure. The existence of undisclosed holdings and potential non-crypto assets could push the actual number higher."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPNlpvTFR3b196MWNGRDkySjc2eWZnZTh1Y1I1T1JXYmZYQTZ4NTE5bUhJLTZlNjlNenRUMHU4RnN2QVRFckNPNFZNNzBvVzRsNlE5Q1FGcktJbmRSekpNQmdzTEhNY2Fmbm1mYjFKeFZiTWhhTFphWXB4QnNyQUx4MjQ1TE16Ml8zZXJmU0xnTDVWLTc1TWhUYllR0gGfAUFVX3lxTFBPOUs3aEp2ajB4TWhDMmwxc1NQcW5WV1JVczdCZUl6WWNodDhqUUE4TUhFN1p3UUhKcEtGWVoteVN6VHJRNmloRWM4ZWJIWlhuejNSdVlMVEIybTFERnZyY2s2Qnpob1N6YUplRGxLUEVmNzFwMEVHQ1NNaGRZbGRja0tadVdMUWdYZE1NYzBPZzBRTFpmS25JenpVOGtGUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ICO Whale Dumps 7K ETH After $60 Million Selloff by Institutions - CoinGape",
        "content": "Despite a considerable upside momentum taken by Ethereum today, July 1, an ICO whale has moved substantial amounts of its holdings to a centralized exchange. A whopping 7K coins were recorded to be dumped amid $60 million weekly outflows in Ethereum, per data by CoinShares.\n\nFurther, Ethereum has recorded the largest outflows since August 2022, raising severe concerns among the ETH market investors. So, let’s dive deeper into the digital asset’s current market statistics and why it has ignited bearish market sentiments.\n\nadvertisement\n\nICO Whale Dumps Amid Massive Outflows\n\nAccording to data by the on-chain tracker EmberCN, the Ethereum ICO whale 0x2Eb08 moved 7000 ETH, worth $24.28 million, to Kraken, an American crypto exchange. This transaction comes after 209 days of dormancy. Also, the whale currently holds slightly above 40K ETH, worth $138.76 million.\n\nConcurrently, a report by CoinShares spotlighted that the transaction emerged amid $60.7 million weekly outflows in Ethereum. Coupled with last week’s performance, the outflows totaled $119 million, positioning the asset as worst performing in terms of year-to-date net flows. The year-to-date outflows totaled $25 million.\n\nCollectively, these stats have raised severe concerns among investors, questioning the asset’s capability for future gains despite its concrete positioning as the second largest crypto by market cap, worth $415.98 billion.\n\nSimultaneously, the US SEC’s recent postponement of the spot ETH ETF launch process by sending back the S-1 amendment forms, instigating a refiling process, has added on to speculations on ETH’s future performance.\n\nNonetheless, ETH price soared considerably today, coinciding with the broader crypto market movement.\n\nAlso Read: German Govt Dumps 400 BTC To Major Exchanges, Transfer Spree Continues\n\nETH Price Springs\n\nETH price trajectory illustrated a 2.20% upswing at press time to trade at 3,463.00. Its 24-hour bottoms and tops were $3,375.41 and $3,513.31, respectively.\n\nFuture price movements remain shrouded in a bearish cloud, primarily driven by the abovementioned factors.\n\nMeanwhile, CoinGlass data showed a 2.22% upswing in ETH Futures OI to $15.21 billion. The derivatives volume spiked 81.12% to $17.07 billion. This data, collectively, underscored the presence of a market uptrend today.\n\nHowever, the RSI rested at 48, hinting at a broader neutral stance for Ethereum. It’s also worth noting that a previous massive dump by an ETH ICO whale caused a significant tumbled price action.\n\nAlso Read: Binance Reveals Major Support For Curve DAO Token Amid CRV Liquidation Crisis\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOVlJLc19ON3NKZ194QmxrWm0tbWdTYXRmQ1ZWRXlhQ09HczFyRnRXM0pCRWZwcDRHOTFNOFd6eE1vclBMdDVia09HeVF3aWZ0TGlOX1RWYm5jbG9ta3d4VEZJa1lLYl8xRGVHMjdvOFVvdFB3cnQtdU1kb05FcmlEaDE0ZzY3cnBT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Vitalik Buterin, His Bold Strategy Unveiled! - Cointribune EN",
        "content": "Mon 01 Jul 2024 ▪ 3 min read ▪ by Fenelon L.\n\nVitalik Buterin, co-founder of Ethereum, has just unveiled innovative proposals aimed at significantly reducing transaction confirmation times on the network. These innovations could transform the user experience and strengthen Ethereum’s position in the crypto ecosystem.\n\nEthereum in search of speed to dominate the crypto market\n\nAlthough Ethereum has made notable advances in recent years, the network still struggles to match the speed of newer blockchains.\n\nWith a block time of about 12 seconds, Ethereum lags behind competitors like Solana, capable of generating blocks in 0.4 seconds. This limitation hinders Ethereum’s adoption for certain applications requiring minimal latency.\n\nTo address this challenge, Buterin proposes several technical innovations. The most ambitious of which is the “single-slot finality (SSF)” or “finality in a single slot”, which would radically simplify the network’s architecture.\n\n“The main challenge of SSF is that, naively, it seems to imply that each participant of Ethereum would have to publish two messages every 12 seconds, which would be a significant load to manage for the chain.” Vitalik\n\nThis approach would eliminate the current system of epochs and slots, which is considered too complex. However, its implementation raises questions about the load supported by the blockchain.\n\nA delicate balance between speed and decentralization\n\nAnother promising path involves “based pre-confirmations”. This mechanism would allow users to pay additional fees in exchange for a guaranteed inclusion of their transaction in the next block. Compatible with layer 2 solutions, it would offer an almost instantaneous experience for demanding applications.\n\nWhile speed is crucial, Buterin insists on the importance of not compromising Ethereum’s fundamentals. Decentralization and security remain absolute priorities.\n\nEthereum’s current block time already represents a significant improvement over Bitcoin (10 minutes). Nevertheless, Buterin believes that some applications require latencies on the order of “hundreds of milliseconds, or even less”.\n\nThe challenge is therefore to find the right balance between performance and network integrity. Buterin’s proposals aim to push the limits while preserving the very essence of Ethereum.\n\nIn short, the forward-thinking ideas of Vitalik Buterin could redefine the standards of the crypto industry. If they come to fruition, these innovations would allow Ethereum to consolidate its leadership position while paving the way for new revolutionary applications in the blockchain universe.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOZkNHbnFOeC11WGtFOE96MnZXbUhUZkZ3bTFtMFR6RGdLNXFOLXl3ajlwd3gxQU85OElVTmRNblU2alo3UDBkemx1cGRyOXZVeHR5OW5pYUZKLVJtWVJIejlncGYyU25FWGlIc0s3NjRoYkxVcDBIS3A4eURXLVZ5d2JTMDVrNU5DTHJiVVhOU3hiYUYwN3BrcWFfQXFmbUdoOW5PM0VtbE8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Stabilizes as Rebound Signal Emerges On 3-Day Chart - The Crypto Basic",
        "content": "Ethereum maintains its price above $3,400 and appears poised for a significant rally as analyst Ali Martinez predicts an imminent surge.\n\nOver the past 24 hours, Ethereum’s (ETH) price has increased by 2.9% to trade at $3,485 amid a 66% surge in daily trading volume to $9.7 billion.\n\nAnalyst Matinez Predicts A surge in ETH Price\n\nThe recent rise in Ethereum’s price aligns with analyst Martinez’s observations on X. He notes that the TD Sequential indicator has signaled a buy on Ethereum’s 3-day chart. This tool, which helps pinpoint trend exhaustion and potential price reversals, suggests a bullish turnaround for ETH.\n\nThe TD Sequential presents a buy signal on the #Ethereum 3-day chart, predicting a rebound of one to four candlesticks for $ETH! pic.twitter.com/hpCS3SvyiM — Ali (@ali_charts) June 30, 2024\n\n- Advertisement -\n\nMartinez predicts that this could lead to a rebound, with one to four candlesticks moving upwards, suggesting that the Ethereum price may continue to rise in the upcoming days.\n\nRecently, Ethereum tried to rally but didn’t have enough bullish momentum to sustain the climb. It couldn’t hold above the $3,700 resistance level and began to decline. The drop went beyond $3,600 and fell below the $3,550 support level, hitting a low of around $3,430.\n\nNow, similar to Bitcoin, Ethereum is showing signs of a breakout that could push its price above $4,100.\n\n- Advertisement -\n\nEthereum Price Could Surge on Bullish Technicals\n\nThe falling wedge pattern has formed, signaling a potential bullish reversal that could prompt optimistic investors to drive prices higher. Presently, the price is above both the 50-day and 200-day simple moving averages (SMAs), with bulls aiming to break out above the wedge pattern to initiate a rally.\n\nThe Relative Strength Index (RSI) shows signs of recovery, hovering around 49, just above the midpoint of 50. This indicates significant buying pressure. A surge in bullish momentum could afford more strength to the bulls, confirming expectations of an impending rally.\n\nMeanwhile, the Moving Average Convergence Divergence (MACD) indicator is bullish. The blue line has crossed above the orange signal line towards neutrality, signaling a shift in momentum from bearish to bullish. Additionally, positive histogram bars indicate momentum in price movement, further supporting the optimistic outlook.\n\nEthereum Price Further Upside Potential: Possible $4,100 Breakout\n\nEthereum’s price is at a crucial point, with bulls fighting to maintain upward momentum and target the $4,100 mark. The presence of a falling wedge pattern supports bullish sentiment, with hopes of pushing towards Ethereum’s all-time high of $4,880.\n\nHowever, if bears capitalize on weakness near the wedge’s upper boundary, they could initiate a downside move toward the $3,450 support level, which is aligned with the wedge’s lower trendline. Traders and investors should closely watch these levels for potential changes in market sentiment and price movements."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPUXlMQzEtUXR4NXFxaHpQQ0dCZlFHYUJUM2NUTUtsZnFwbVk0elJWZm5DelYxMndWeVRPQllxOFB1aUJoa2x2WTVQXy1saHk4cDVYT3h1ODlqeU5XVUhYVm8yOXNlejg1RlVnMldtcHBZRklMSTdnanRUQldyTEp4bktIYUNhMzBXZWtUeERrZmRZMHE0NEVJX9IBngFBVV95cUxQQlQ0dEJDR29aQW9UZWo1VkVPR3ZUNk1ab3RRUzhncGU0Nm1NTFlLNHhpUmp5cXNEQzZMeFhRNlhCcmxBRVM4Mlcxa05PbjVoZWVtbHNnTkYzRGdyd2l0X1JxYzFiaE13UnMwSkVlczJBWGJPM3ZJVVgzZjN6dXkxbTkzR0owRUpEdl9SWmxwZGNzUUp4OUJzQUNITGI5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Network to Get Major Boost With SSF Roadmap, Says Vitalik Buterin - CoinGape",
        "content": "On Sunday, June 30, Ethereum co-founder Vitalik Buterin published a blog post explaining the road ahead for Ethereum and how they might have to part ways with the epoch-and-slot mechanism of its existing rollup-centric roadmap. Buterin proposes a new SSF mechanism to improve the transaction time latencies of the order of hundreds of milliseconds or even less.\n\nEthereum Eyes Single-Slot Finality\n\nCurrently, the Ethereum Gasper consensus employs a slot-and-epoch mechanism wherein validators cast votes in each 12-second slot. Also, all validators get the opportunity to vote once, over 32 slots. Later, a PBFT-like consensus algorithm takes care after two epochs (12.8 minutes), thereby providing a strong economic assurance known as finality. However, there are two major concerns with this approach.\n\nadvertisement\n\nThe complexity and several interaction bugs between the two slot-by-slot voting mechanism as well as the epoch-by-epoch finality mechanism. The 12.8-minute finality period is pretty slow and inconvenient for the users.\n\nTo simplify this, Buterin proposes a single-slot finality mechanism similar to the Tendermint consensus, wherein Block-N is finalized even before the creation of Block N+1. The major difference from Tendermint is the retention of the “inactivity leak” mechanism. This will allow the Ethereum blockchain to continue and recover even if nearly one-third of validators go offline. Vitalik Buterin calls this a “Secure Speed Finality” SSF mechanism.\n\nAlso Read: Vitalik Buterin Spotlights Innovative Idealist DApps in Web3\n\nAddressing A Few Challenges With the SSF Mechanism\n\nVitalik Buterin also highlighted some key challenges associated with Single-slot finality (SSF) in the Ethereum ecosystem. He explained that the naive implementation of the SSF would require every Ethereum staker to publish two messages every 12 seconds, imposing a significant load on the Ethereum network. In his blog post, Buterin said:\n\n“While there are clever ideas to mitigate this issue, including the recent Orbit SSF proposal, it remains a challenge. Although SSF significantly improves user experience by accelerating ‘finality,’ it doesn’t eliminate the need for users to wait 5-20 seconds.”\n\nWhile implementing the SSF mechanism in Ethereum, Buterin suggests implementing Orbit-like techniques in order to reduce the total number of validators signing per slot and address the key goal of lowering 32 ETH minimum staking.\n\n“This approach might cause the slot time to increase to approximately 16 seconds,” added Buterin. However, he added: “Designs like Orbit SSF are very recent, suggesting that the design space of slot-and-epoch designs where something like Orbit SSF is the epoch is still quite under-explored”.\n\nThe Ethereum developers are still figuring out the ideal solution in order to improve the finality. Last month, Buterin shared updates made with Ethereum Layer-2 solutions. The Ethereum L2 activity has touched fresh all-time highs recently.\n\nEthereum is thriving as an ecosystem right now with L2 activity hitting fresh all time highs every other day and the L1 roadmap being executed on with laser precision Meanwhile, crypto twitter is acting like Ethereum is failing and in dire need of an emergency intervention — sassal.eth/acc 🦇🔊 (@sassal0x) July 1, 2024\n\nThe Ethereum Layer-2 Blast recently announced the launch of its native token and BLAST airdrop.\n\nAlso Read: ETH Price Shoots 5% As Whale Activity Spikes Ahead of Ethereum ETF Approval\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNNGRjOHoycl8wU1owOGdiZ3VGcHB6akpLTTJZVnU0djNCbkpFTm5DR1V3aFBFZGJySnNuYTIyN2lfM3NWaEJURXNpVGZxdGVtS3IzbWxyWFR3QjFNc3ZqckhHODAyOUlRNVg3SHlJV3ptTERkR3ZpQkVGUzl0SWpmbERYaUM4YnZPaEZpWF81ZTU0U3VzOV9pMzhVeFZ4NW9lc3RSN1A4WktKeTZPcG9CbU83VVM1YjFER1dCM0ptR3ZwNHhHdzc0MHFuNm5iMFpZOWYtUjNSZG1LSWg4QmZtaWoxU0_SAeoBQVVfeXFMTlF2cHFQOWZ5T0Y3ejNFbGpKTUVFaU10MGxqQXFDdUhEWmhjQjdYbXJydWxlc0c3cDZld0I2M0dFUG0zc0gwQkpvWVRTME9VbHpFclBSZnZQRXcwQTVXTVllQXZJRVJmWXJxWWY1VUNtSjlxLVFSRFBwNGJkSHZtQ0ZKZEZfYndJMzY5bEI3N3lvd1VTQW5IcWduSjhFcjNjakg1b1dNcndUU3c3eHNzNXJBR3R3eEw1X1ZfV3JjZkhDb0tvUlV2ay1FaTZiQVFJRkFhX1ZhUjFaNURZa0xWWFdoUWZGWlY3dWN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin is breaking above the falling wedge - FXStreet",
        "content": "Bitcoin price is breaking above the falling wedge, signaling a potential bullish move.\n\nEthereum price remains supported at $3,288, the 61.8% Fibonacci retracement level.\n\nRipple price still faces resistance at $0.500.\n\nBitcoin (BTC) breaking above the falling wedge pattern on Monday signals a bullish move, with Ethereum (ETH) and Ripple (XRP) poised to follow as they find support at key levels, paving the way for an upside rally in the days ahead.\n\nBitcoin price looks promising\n\nThe Bitcoin price is breaking above the falling wedge on Monday and is trading up by 1.24% at the $63,571 level.\n\nIf BTC's price closes above the $63,956 daily resistance level, it could rise 5% to retest its next weekly resistance at $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are below their neutral levels of 50 and zero. If bulls are indeed returning, then both momentum indicators must maintain their positions above their respective neutral levels.\n\nIf the bulls are aggressive and the overall crypto market outlook is positive, BTC could extend an additional rally of 6% to revisit its weekly resistance at $71,280.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes above the $58,375 level and forms a lower low in the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 3% decline in Bitcoin's price, to revisit its low of $56,522 from May 1.\n\nEthereum price shows potential for an upside move\n\nEthereum price retested its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27 on June 24.\n\nETH rebounded by 6.7% from the 61.8% Fibonacci retracement level and trades at around $3,501, edging up approximately 2% on Monday.\n\nIf this support at $3,288 holds, ETH price could rise 6% from its current trading level of $3,457 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are below their neutral levels of 50 and zero. If bulls are indeed returning, then both momentum indicators must maintain their positions above their respective neutral levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price shows resilience\n\nRipple price currently trades at $0.478, below the daily resistance level of $0.500.\n\nIf Ripple price surpasses the barrier at 0.500, it could rise 7% from $0.500 to $0.532, its previous high from June 5.\n\nIn the daily chart, the Relative Strength Index (RSI) is currently below the 50 mark, indicating neutral to bearish sentiment, while the Awesome Oscillator (AO) remains below zero, suggesting bearish momentum. Both indicators must rise above their critical thresholds of 50 for RSI and zero for AO for a sustained bullish trend. Such a development would bolster the ongoing recovery rally in the market.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT daily chart\n\nConversely, if Ripple price daily candlestick closes below $0.450, marking the June 7 low, it would invalidate the bullish outlook by establishing a lower low on the daily chart. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPZkVKWEkyaE9rYUtVZWFtdHhXa1dxdmo3aG1GU2dMLVNqMVhyS1VERjFSTkNxQTlXdFdnY21UTTdDQVdKT2RUMFNlcmtFYXJjZHFOQWtiWTlDOTBQZ1hnSi05bkk2dDZEajViZVJxT2NPcDJFMDBKTzNFNUJ0aW1reWFnb0pQWTYyWjZYU0lJQTNGSmVSU2xTeG1QU0ZNc0NETnMxS09oam92TXdzeUxJa250LVhYeFoyVlRVaDNMY2g1ejJu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Trigger 40,000% ROI Potential For ETFSwap (ETFS), Filecoin (FIL), And Dogwifhat (WIF) - Techpoint Africa",
        "content": "Ethereum ETFs have received approval from the Securities and Exchange Commission (SEC) and are scheduled to launch on July 4th. The news of this approval has resulted in bullish swings for ETFSwap (ETFS), Filecoin (FIL), and Dogwifhat (WIF). Analysts believe these cryptos will yield up to 40,000% ROIs for investors.\n\nETFSwap (ETFS) Set To Generate 40,000% ROIs As More Investors Adopt Ethereum ETFs\n\nFor weeks, ETFSwap (ETFS) has been the receptor of mass hype and multiple accolades. This coin's integration of the exchange-traded fund (ETF) industry into its utility makes it a must-have token. As the metaverse waits eagerly for the launch of these Ethereum ETFs, investors gear toward ETFSwap (ETFS).\n\nThis crypto's primary aim is to completely revolutionize the current system of trading tokenized ETFs. Borderless ETF trade is possible with the platform’s high-quality AI-powered protocol. This protocol consists of the ETF Tracker and ETF Screener, which offer useful investment recommendations that are in line with market conditions.\n\nExcluding this scheme, Ethereum ETF investors are also dazzled by the platform’s unique perks. ETFSwap (ETFS) investors that contribute to the liquidity pool through staking events will receive an APR yield of 87%. ETFSwap (ETFS). They will also earn progressive trade perpetuals up to 10X via leveraged trading.\n\nThe presale of this token has a myriad of investors from multiple ecosystems, particularly Ethereum ETFs. ETFS is the platform’s cryptocurrency that grants investors access to all governing processes of the network. The token is available on the ETFSwap (ETFS) website for $0.01831, which may yield up to 40,000% when the event ends.\n\nFilecoin (FIL) Price Heads To The Moon As It Eyes $10 Value\n\nAnother cryptocurrency that has benefited from the Ethereum ETFs craze is the DeFi network, Filecoin. Filecoin has enjoyed a smooth ride in Q2, maintaining its green zone. Contrary to its Q1 performance, this altcoin has impressed investors by shaking off the bear's effects extensively.\n\nFilecoin is a blockchain-based storage system that functions as a secure unit for important market data. Its initial aim was to run as a subsidiary layer for IPFS and individual data storage. Filecoin (FIL) is the utility token of this chain that ushers investors into decentralized storage.\n\nAs market participants began to lose faith in its comeback, Filecoin surprised investors with an astonishing surge. Its incredible display has led to presumptions that the Filecoin price can overcome the bear while propping the bull. Filecoin currently trades at $4.46 and has continued to make attempts to recover its 2023 price of $10.\n\nEthereum ETFs Spark Dogwifhat (WIF) Buying Pressure\n\nThe price of the Dogwifhat (WIF) token has revolted against the plunging tide of the metaverse. On June 25th, Dogwifhat (WIF) began to trade above $2, breaking out of its previous descent. Meanwhile, on-chain analysis has disclosed that a likely Ethereum ETF enthusiast has acquired $4.67 million worth of Dogwifhat (WIF).\n\nThis acquisition indicates that a possible rally may be in sight. Evidently, Dogwifhat (WIF) is a forerunner of the 2024 meme coin comeback. Experts believe that this cryptocurrency may drive the revival of the Solana (SOL) marketplace and push it to a new all-time high.\n\nConclusion On The Capability Of ETFSwap (ETFS), Filecoin (FIL), And Dogwifhat (WIF) To Push Investors’ Profits By 40,000%\n\nThe crypto market has made a lot of buzz in the financial industry since Ethereum ETFs made headlines concerning SEC approval. This move has ignited global traffic as traditional investors seek alternative investment opportunities in cryptos like ETFSwap (ETFS). The presale of this token offers investors the opportunity to acquire the ETFS token at a discounted rate before it becomes too late.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOQWNjWDN1dU5JQmFxVTRPS0ZwdUYzaEI2d093MU1FX2hGX1N3T081QWtoTEctbFR0OTMtbnphLWh4RFJvTW1WZFhqc0RmQ2drY2plaHBPX3VYdzdFSjFOUzd6QUN1QUdTZzNCemdJZ1ZheXhLdkJrX2VDZW54ZmdIVGp2RXdRU1dxbkRFcTBmN0wyTWpoQmpiYThGbS1qeEduWVJmclRDMkRqMnI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "BlockDAG’s Presale Surges Beyond $54.9M Amid Ethereum’s Fluctuations and Polygon’s Strategic Advances - The Cryptonomist",
        "content": "SPONSORED POST*\n\nIn the fast-evolving realm of cryptocurrency, BlockDAG emerges as a beacon of innovation and success, with its presale now soaring past $54.9 million. As Ethereum struggles to maintain price stability below $3,500, and Polygon expands with Google Cloud’s recent endorsement, BlockDAG shines brightly.\n\nCurrently in its 19th batch, priced at $0.014 with the upcoming batch set at $0.015, BlockDAG has not only captured the attention but also the confidence of the global crypto community.\n\nEthereum’s Price Challenges Amidst Market Volatility\n\nEthereum’s journey through the crypto market remains turbulent as it struggles to break past the $3,550 resistance mark. Recent trading sessions saw Ethereum dip to $3,385, igniting cautious optimism among investors. The cryptocurrency now wrestles with a key bearish trend line established at $3,465 and trades below the 100-hourly Simple Moving Average.\n\nTechnical analysts suggest that if Ethereum fails to breach the $3,465 and $3,550 resistance levels, it could face potential declines, targeting major support levels at $3,350, with further dips possibly reaching $3,220 and $3,100.\n\nPolygon Pushes Forward with Notable Ecosystem Developments\n\nPolygon continues to stand out as a prominent Layer 2 scaling solution for Ethereum, strengthened by significant milestones such as Google Cloud’s role as a validator. This collaboration not only enhances the network’s security but also boosts its technological robustness, broadening Google Cloud’s involvement in blockchain technology.\n\nThe recent launch of Astar Network’s Astar zkEVM with Gelato, and the introduction of native USDC on Polygon, supported by Circle, marks crucial steps in enhancing liquidity and facilitating institutional transactions. These developments, combined with a vibrant community growth of 29% and an increase in MATIC’s price to $0.5607, underscore Polygon’s expanding influence and innovation in the blockchain space.\n\nBlockDAG Dominates with Robust Presale and Community Engagement\n\nBlockDAG continues its impressive trajectory in the cryptocurrency presale arena. With over $54.9 million raised and maintaining strong sales momentum across 19 batches, BlockDAG’s appeal is undeniable. The presale has successfully marketed over 11.8 billion BDAG coins and over 8250 miners, amassing an additional $3.5 million in fundraising. With a price surge of 1300%, BlockDAG is quickly becoming a formidable force in the cryptocurrency market.\n\nThe robust support from crypto influencers and the broader community amplifies BlockDAG’s market presence, enticing a wider audience to its innovative approach. These strategic endorsements have positioned BlockDAG as the breakout cryptocurrency of 2024, promising substantial returns for early investors. As it progresses toward batch 45, market experts anticipate a potential 30,000x return on investment, illustrating the exciting and lucrative future that lies ahead for BlockDAG.\n\nAt the core of BlockDAG’s impressive performance is its unique Directed Acyclic Graph (DAG) technology, which allows it to handle between 10,000 and 15,000 transactions per second (TPS). This exceptional capacity ensures nearly instantaneous transaction confirmations, crucial in high-stakes, time-sensitive scenarios.\n\nSuch technical prowess makes BlockDAG an attractive choice for investors prioritizing efficient and rapid transaction capabilities. Furthermore, BlockDAG’s commitment to maintaining low transaction fees and high scalability makes it a versatile and powerful platform, suitable for a wide range of applications from microtransactions to large-scale business operations.\n\nAs Ethereum navigates its price fluctuations and technical challenges, and Polygon advances its ecosystem with innovative partnerships and technological integrations, BlockDAG sets a new standard in the presale landscape. BlockDAG’s presale success, characterized by its rapid growth and strong community trust, highlights its potential to not only compete with but potentially outperform established cryptocurrencies like Ethereum and emerging platforms like Polygon.\n\nFinal Analysis: The Rising Star of Crypto Presales\n\nBlockDAG’s journey through its presale phases clearly marks it as a standout performer in the 2024 crypto market. With $54.9 million raised, substantial community and influencer support, and a promising technological foundation, BlockDAG is well-positioned to revolutionize the cryptocurrency presale paradigm.\n\nIts robust performance and promising ROI potential establish it as a prime investment opportunity for those seeking significant returns in the crypto world. For investors and crypto enthusiasts looking for the next big breakthrough, BlockDAG offers a compelling narrative and an even more promising future.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOOVJMM0duUnpXdkJncFNYdm5VeGdBV19mZmk5djUzVUZaSF9zMG1xSlhtay05OFJIQjB3dVYzdjYzLXNCcnhaQ1lFcUZhNTVjTmRvMjIyZVZKVV9GUzVpTk5FdnRwUFQwZmxDNGRZaGt4Zm5DU1FlSk9rU0Z4bHp4eDhBV19FS1FEc2NTeWlOSUxfTkJjVGJrbWhIeDJxX0NVR1HSAacBQVVfeXFMTUdaWTFEWHJ4ODNocDZjT0swX1JVT1NhYTRHLUxDTWk0d09mdmlxZjZrTDRQX2NYZGVhWFU3WXFINi04RHdaNXZIS3h1eS10N3FCdXB3LTFweXVna0JXbDVZRW1RdUhBd285VmJtWlg1OWJfNURsNnQyQlh2MjhJVzlpS3MyMk1BVk1qNUJjSTREY1ZlV0x0b3B4dUVKYTJKSkNEdkhnT28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) Outperforms Major Cryptos in Early July - Crypto News Flash",
        "content": "Ethereum Name Service (ENS) is a leading name in the blockchain industry, with over 2.14 million registered names.\n\nThe upcoming ENSv2 upgrade is eagerly anticipated for its focus on scalability and affordability.\n\nUnbelievably, Ethereum Name Service (ENS) has been one of the top gainers this year. Its token is at its highest level since January 2022, after rising for two weeks running. With the market’s attention on memecoins and AI, it was surprising when ENS rose to the top of the crypto market in early July.\n\nThis year, ENS has grown by an incredible 253%, much exceeding other cryptocurrencies like Ethereum and Bitcoin, which have risen by 57% and 47%, respectively.\n\nCoinMarketCap data show that the ENS price at the time of writing is about $32.53, representing a bullish position over the previous seven days with a 46.01% increase and a 27.41% rise in the previous 24 hours.\n\nUnderstanding ENS and Its Significance\n\nAmong the most well-known names in the blockchain space is Ethereum Name Service. With this site, users may quickly and cheaply register ETH domains to build customized Web3 identities like john.eth.\n\nThis function is essential since it gives the industry a memorable and simple identity in place of the usual random characters.\n\nIn addition, most blockchains—including well-known ones such as Optimism, Solana, Arbitrum, and Base Blockchain—can be used with ENS domains.\n\nOver the years, ENS has gathered 409 integrations and over 2.14 million identities. Its goal of simplifying the Web3 sector has won industry observers, including Vitalik Buterin, co-founder of Ethereum, approval.\n\nAnticipation of ENSv2 Upgrade\n\nA further factor driving up the price of ENS tokens is investor excitement over the impending ENSv2 upgrade. The emphasis of this improvement is on flexibility, cost, and scalability. Presently, developers are focusing on reserve resolution and name resolution enhancement.\n\nThough the roadmap suggests it will take a few months to deploy, the developers have not disclosed a precise timetable for the V2 upgrade."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNZ2xnOGxjcTNOck9IU3dtWGlFbGN3TWJxajV1V1MzU214RnV5aXUxZk9Fa2NkY3dBN0pPd1poLXNmZ0RMa21CaUxVX2NpSFAzb1o1cjBzU0lPSklqdmYydmpwR3Z3NDNrZl9jUmZDQ0Z1T3FsRkttNm85OUluWEFLYmk2WkZaS1FVMTdUaHJCeVhoWGd5aENEN3ZOONIBoAFBVV95cUxPNDJnbHpZU2lGdEtObVFsTTVEcDdGVVdxVWlnZ01IZ2x0dTNyTnlXdUtWYm9HWUMtR0RIM0VlbW9TLTVlSC13bFJmVGhKNEU2LS1Pdm1OcThBZE82X0pkRXcxb1JUcGFDNXR2Zy1nVE1ILVFFNDRtaEFvVnpuXzVTQnNISTh1R3RwTFFxM2drZDM5Wk5xcGV0aDZkU1RldFFh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "What Bitcoin, Ethereum exchange flows say about the crypto market’s future - AMBCrypto News",
        "content": "An exchange flow metric showed that the local bottom might be in for BTC, ETH.\n\nThe market sentiment was not bullish and holder behavior at crucial support levels would be key for the next price move.\n\nBitcoin [BTC] and Ethereum [ETH] bulls struggled to shift the market dynamic in their favor. The large losses of the past ten days meant that the price was back at a support zone where buyers are expected to halt the sellers.\n\nEthereum’s MVRV and NVT ratios showed the asset might be undervalued. The liquidity pocket at $3500 could see a short squeeze, but momentum was bearish otherwise.\n\nMeanwhile, another BTC investigation showed that mining activity had receded and that miners were selling Bitcoin. However, the selling pressure had begun to drop in intensity over the past two days.\n\nAMBCrypto decided to look at the movement of both assets from exchanges to gauge the market sentiment. It revealed that bulls might not have too much to cheer for yet.\n\nWhat does the exchange netflow metric indicate?\n\nThe exchange net flows metric offers valuable insights into the market. When the flows are positive, it shows inflows are greater.\n\nThis in turn is a sign of potential selling pressure on the asset, as it implies participants are sending the crypto to exchanges to sell them.\n\nValues below zero mean that outflows are greater, which is a good sign for buyers.\n\nIt indicates that market participants are withdrawing their assets from exchanges, likely to place them in safer storage, and indicates accumulation.\n\nThe 30-day simple moving averages were used to better understand the exchange flow trends. The ETH inflows were considerable in mid-March and toward late May.\n\nBoth occurrences marked a local top for the price.\n\nIn the past month, the net flow was heavily negative, showing accumulation. Over the past eight days, the outflow has slowed down, but the 30DMA net flow remained in negative territory.\n\nMeanwhile, Bitcoin saw consistent accumulation in February and March. The 30DMA showed that the flow of BTC out of the exchanges continued to dominate.\n\nIn late April and on the 21st of May, there were spikes in the BTC inflow, but they were exceptions to the trend.\n\nAre Bitcoin, Ethereum headed for a consolidation?\n\nAMBCrypto’s examination of the in/out of the money data from IntoTheBlock highlighted key support regions.\n\nThe in/out of money around the price showed Ethereum has a strong bastion of support from $3080-$3180 and $3280-$3381. Similarly, the $3486-$3586 is also a staunch resistance.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nFor Bitcoin, the $59,450-$61,263 is support and $63,148-$64,960 resistance.\n\nThis meant that the current price consolidation of both these crypto market leaders could be confined within these levels and lead to a range formation."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPUFRTT0dQcDZVQmJwa2VkNUZrck94blNfbWhJcXJKM3hiVnNGQXcxNnJKWjhvWEVLSjJJcC0tekdaUllFU3JFNWV0NjVVcWFrLWU3WVJ5YVNrSUV1czR4V0gxVnlpY2M3aDR0cXBMUnplVlNScFVkS3NWUXU5ZktHV0UxYUbSAYoBQVVfeXFMT0RMbUJQX1RTYTR6cDh2eW5HVnRoWV8zZjViWTZfM09xc1FpTU1zaGJLRV9TcFJiSGVtX0NWcW9RM0hfX2pNekIwZkZzMmFqZFVLVXBiZVpoVWtLUGVpVnpoSTJrbkdadmt1bzZWWEQ4OG5hWVJZbjdvN1Brd1JwV2FvYWVaN01TdXZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Why Ethereum and AI tokens could be your best bet in Q3 - AMBCrypto News",
        "content": "Ethereum poised to have a positive quarter ahead according to new research.\n\nAI tokens dominated in the social space and performed positively YTD.\n\nEthereum [ETH] and AI tokens have had a positive run over the last few months.\n\nInterestingly, Grayscale Research believes the upcoming quarter will be heavily influenced by the recent approval of spot Ether exchange-traded products (ETPs) in the U.S. market.\n\nThis is a significant development as the Securities and Exchange Commission (SEC) greenlit Form 19b-4 filings in late May, allowing several issuers to list these Ether ETPs on U.S. exchanges.\n\nETPs to help ETH\n\nGrayscale’s market analysis assumes ETPs will begin trading in Q3 2024.\n\nSimilar to the successful launch of spot Bitcoin ETPs in January, Grayscale Research anticipates these Ether products will attract significant net inflows, albeit likely to a lesser extent than their Bitcoin counterparts.\n\nThis could potentially translate to price support for Ethereum itself and tokens within its ecosystem.\n\nThe launch of spot Ether ETPs is expected to bring additional focus to the unique features of the Ethereum network. Unlike other blockchains, Ethereum utilizes a modular design approach, where different infrastructure components work together to optimize user experience and reduce costs.\n\nFurthermore, Ethereum boasts the largest decentralized finance (DeFi) ecosystem in the crypto space and is a hub for tokenization projects.\n\nIncreased interest and adoption of Ethereum fueled by ETP approval could lead to rising activity and valuation support for specific Layer 2 tokens such as Mantle, prominent DeFi protocols like Uniswap, Maker, Aave, and other crucial assets within the Ethereum network such as Lido, a staking protocol.\n\nOne key factor that could showcase how interest in Ethereum has been growing could be how ETH’s price has remained resilient while BTC’s prices have plummeted.\n\nDespite both ETH and BTC being heavily correlated, recent market drawdowns haven’t impacted ETH as harshly as BTC.\n\nWhile spot Ether ETPs represent a major development, Grayscale Research anticipates other ongoing market themes to remain relevant in the coming quarter.\n\nA key area of focus will be the potential for blockchain technology to intersect with the field of Artificial Intelligence (AI).\n\nAre AI tokens doing good?\n\nAccording to recent data, AI tokens had the largest amount of dominance when it came to the social media landscape.\n\nMoreover, AI based tokens such as RNDR, TAO and FET, outperformed the overall crypto sectors market index as well in terms of year to date price performance. If the hype around AI tokens continues, it could yield positive results for holders."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNeUwwNjhWRE5XcllvZmhIaW5UbUZiT3pwT1ZPc1FlSmRqUTRlaFFsUkZKbE9ZM0ttSWJHTE1JdU9zcWFDeXNJMjBaZW5LVVJEaHotT29ZeE0xbUhFaFpaRFdraExrRklEbGJ5WDNhN3NnYURkeGV4MUNXY0NYR3N2UUtZZWlrdWVJQlRpLVpmLXHSAZYBQVVfeXFMTW4wVExzWlUyNllaUm1oR3JGSWo2WGN3SDZTM0J0aXd5SGRiTVlJdHNVV3k0aTJnMEdISGRBZEFOUVdWblQ0QWhhWmxLYlp0VjBfcUpGUDlldURyNEhGUnlaSktoWFhCd1k1OVJlQTRNWEVPbkl4bHQ2U2h0UWhfMkNLNldhQVgyRjluaFFCV1RYNUZsWlRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Solana vs. Ethereum: Assessing how DEX volume has impacted SOL, ETH - AMBCrypto News",
        "content": "Solana outperformed Ethereum in terms of DEX volumes.\n\nThe price performance of both SOL and ETH tokens were positive over the last 24 hours.\n\nSolana [SOL] and Ethereum [ETH] have been one of the top cryptocurrency networks in the space.\n\nEven though Ethereum has managed to retain its dominance in various areas for the most part, recent developments suggest that Solana could catch up with Ethereum soon.\n\nSolana shows promise\n\nData from DefiLlama showed Solana surging ahead of Ethereum in daily DEX trading volume. Solana captured a significant lead, processing $1.148 billion compared to Ethereum’s $745 million.\n\nThis marks a shift in dominance within the DEX landscape, and could signal a growing preference for Solana’s faster transaction speeds and lower fees.\n\nIt’s worth noting that Ethereum remains the leader in overall DeFi total value locked (TVL), but Solana’s strong showing in DEX volume could help propel the protocol to new heights.\n\nEven though Solana’s TVL was far behind Ethereum, Solana blew Ethereum out of the water in terms of overall activity.\n\nIn terms of daily active addresses, the overall number of addresses on Solana had grown to 1.4 million whereas, the number of daily active addresses on the Ethereum network were 644,000 at the time of writing.\n\nIn terms of daily transactions, Solana showed significant dominance. At the time of writing, Solana 42.9 million transactions that were occurring on its network. Whereas on Ethereum, the number was around 1.1 million.\n\nLooking at the finer details\n\nEven though Solana managed to outgrow Ethereum in terms of activity, it is important to note that Layer-2s have not been taken into consideration while calculating activity.\n\nL2s like Arbitrum [ARB] and Optimism [OP] act as scaling solutions for Ethereum, processing transactions off the mainnet but still leveraging Ethereum’s security.\n\nActivity on these L2s translates to interest in the Ethereum ecosystem as a whole.\n\nHowever, Solana’s impressive numbers raise questions about long-term sustainability.\n\nThe high transaction volume might be partly driven by speculative activity or meme coin trading, which may not translate into long-term value creation.\n\nIt’s crucial to see if this activity translates into building solid DeFi applications and attracting established projects.\n\nMoreover, Solana’s architecture boasts faster speeds and lower fees, but it has faced criticism regarding network congestion and outages in the past.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nIf outages continue to occur on the Solana network, it could thoroughly impact the sentiment around Solana network and may steer some users away from the protocol.\n\nAt press time, both SOL and ETH tokens had benefited from the recent bullish sentiment rising in the crypto markets and grew by 6.6% and 3.4% respectively in the last 24 hours."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPZTMtOGk2TkdNakE5c2dEc1kwN1VfSTlDbFdmRzhqUnQ1VWVhb2tUV195UG1xMEkzdzkwTE44Tk9ualFCZTQ2SzUzLWc2emV4NVZiMnQ1XzM5OE01NnBXSUZfM3oxdGtERmxGTVR0c3pKTm9wb1dURnl1M0VaT0NDdEIzdTZVS2pkRTZpM3I0OVVaWllMNlAyZ3ctWk5qUHJMNmI0S1F6bmx5eXVu0gGyAUFVX3lxTE5KNjI1M25EeEZQS3hWM2VkeTFBYkEwcDRYS1hqTjdBSWhhRXM1WUdEcVFvcUhxOE9nTVhnOVlYRHhXNHJ6d0lJSjF5UU5VY0tyNTJzaURXYmVzNUIyaklNaGFYbmRiQWdhd0JMNXRXWTFzZE9mM01ZSXVwZVp3WkNxc2VTMXRzYTJlSU96Qzc2UW9hOFRoTnNreF80Z19ta0xqWkNiLS1rSTZ2OHVVcnlhWEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Huge $690m Sell-Off Sees Ethereum Dive Below $3,300, As Institutions Turn to Raboo and PEPE - Punch Newspapers",
        "content": "Whispers of institutional investors shifting their focus away from established cryptocurrencies like Ethereum and towards lesser-known altcoins like Raboo and PEPE are swirling around the financial markets. Raboo’s unique innovation along with its current presale seems to be the highlight so far, with analysts predicting a massive upsurge post-launch.\n\nKeep reading to find out more:\n\nEthereum Struggles to Pull rebound after $3,300 price drop\n\nOver a $690 million sell off of Ethereum and Bitcoin caused sharp decline in price, which saw the ETH plummet below $3,300. Ethereum made a minor comeback from its weekly low of $3,249, trading today at $3,347.\n\nAlthough the exact causes of the sell-off are still yet unknown, experts believe that a number of variables, such as possible whale activity and profit-taking by short-term investors, are at play.\n\nThe price behavior of today, nevertheless, points to a possible short-term reversal. The rebound of over $3,300 suggests that there is once again purchasing pressure in the market. This could be a result of investors seeing the decline as a chance to acquire more Ethereum at a discount.\n\nSome experts believe a sustained move above $3,450 could signal a broader market reversal. Others warn that the recent sell-off could be a precursor to a more prolonged bear market, especially if the price falls back below $3,300.\n\nPepe Coin (PEPE) Clings to $0.000012 Despite Ethereum’s Rollercoaster Ride\n\nWhile the second leading altcoin Ethereum grapples with a rollercoaster week, meme coin Pepe (PEPE) appears relatively stable, hovering around $0.000012. PEPE seems largely unfazed with the current market movement.\n\nThis continued bullish run has some analysts predicting a potential rise in the coming months, reaching as high as $0.000058 by year-end. This optimism likely stems from the ongoing meme coin craze and PEPE’s recent momentum.\n\nHowever, others predict a significant drop in the next month, potentially falling below $0.00001. It’s still difficult to predict the more likely outcome. But if the coin’s recent price movement is anything to go by, Pepe holders can expect a positive movement in the remaining days of the month.\n\nInvestors Flock to Raboo Amid Price Drop in Top Coins\n\nWhile top coins like Ethereum seem to be in their bearish phase, analysts are bullish on Raboo with many predicting a staggering 10,000% growth potential. Some experts anticipate a staggering 233% growth during the token presale, which has already surpassed $1.6 million.\n\nThe platform also plans exclusive NFTs and merchandise, offering additional revenue streams and exciting opportunities for holders. For those seeking passive income, Raboo will offer staking options with attractive rewards and its AI-backed meme coin is part of these incentives.\n\nAccording to Bloomberg Intelligence, “the generative AI market is poised to explode, growing to $1.3 trillion over the next 10 years.” Raboo is well-positioned to capitalize on this burgeoning market.\n\nNow in its fourth stage of its token presale, Raboo is attracting attention with its unique features. One of the highlights is Rabooscan, an AI tool that scours social media platforms for the hottest memes, ensuring only high-quality content is circulating.\n\nRaboo tokens are currently going for a presale price of $0.0048 which makes it an attractive entry point for early adopters.\n\nConclusion\n\nWith Raboo’s presale price already exceeding $1.6 million with over 2,500 investors on board, the project looks quite promising.\n\nIts presale has generated a lot of market frenzy and hype as several holders remain keen to invest early in this project.\n\nTelegram: https://t.me/RabootokenPortal\n\nTwitter: https://twitter.com/Raboo_Official"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5CT1dlY0piMGVaV1RTcmxqY3pRSFoyQVg2WHpkUTFXbDctaWl0Z2NxY0FOdF9SdEhpNm9YUk9WZWZQQkhmZlc0a2MxWmZpY0xYSDE1SEpway1yWG5mVmRuMVo1S01MUVFaZVhmQ3BENzdjUW_SAXhBVV95cUxNV2NmZVl2UmU4M1NQVFk1bjJDMzJOQVVPUGJoWHlUU1JFNWNxN2MwUWxpbWRTeS1LOE5ueGFndWkyMTBaXzJYZFdDZGFicVZhVTlrZG0yUjdEVVV4REZoRGxTYkpFWkVydFp3cXJHN3VMcXNfMXlOdUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 03:53:41 GMT",
        "title": "Ethereum Price Bounces Back Yet Lacks Strong Bullish Drive - NewsBTC",
        "content": "Ethereum price is attempting a fresh increase above the $3,450 resistance zone. ETH must settle above $3,550 to continue higher in the near term.\n\nEthereum slowly moved higher above the $3,450 zone.\n\nThe price is trading above $3,450 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key bearish trend line with resistance near $3,415 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair must clear the $3,520 and $3,550 resistance levels to continue higher.\n\nEthereum Price Faces Resistance\n\nEthereum price started a decent recovery wave above the $3,400 level. ETH even cleared the $3,420 level to move into a short-term positive zone like Bitcoin.\n\nThere was a break above a key bearish trend line with resistance near $3,415 on the hourly chart of ETH/USD. The pair even cleared the $3,500 resistance zone. A high was formed at $3,516 and the price is now consolidating gains.\n\nThere was a move below the $3,500 level, but the price remained above the 23.6% Fib retracement level of the upward move from the $3,350 swing low to the $3,516 high.\n\nEthereum is trading above $3,450 and the 100-hourly Simple Moving Average. The current price action is positive and calling for more upsides. On the upside, the price is facing resistance near the $3,500 level. The first major resistance is near the $3,520 level.\n\nThe next major hurdle is near the $3,550 level. A close above the $3,550 level might send Ether toward the $3,650 resistance. The next key resistance is near $3,720. An upside break above the $3,720 resistance might send the price higher. Any more gains could send Ether toward the $3,880 resistance zone.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could start a downside correction. Initial support on the downside is near $3,480. The first major support sits near the $3,440 zone and the 50% Fib retracement level of the upward move from the $3,350 swing low to the $3,516 high.\n\nA clear move below the $3,420 support might push the price toward $3,350. Any more losses might send the price toward the $3,320 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,420\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQR3Rwdi1Gd3VRS2RLSkxtQmNqZ1Jka3hSamxyOERuV3c0Qk90WjBQeEFOS2ZzcG9hUkxld21hN2pFdmVLdGlMUWVtT0YzWjY4eGQwV2xCajlVUmNCTlJ4NXdQWE5uV2hqMzNLaWxobzhBRWZDSktxbEFiYVRmQ3p4dFZwemZXeU1fUnlnY3pta2FlUXBuQmE5cDdOOEx0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Massive Whale Withdraws 60K ETH From Bitfinex Amid Ethereum Price Uptick - Coinfomania",
        "content": "Trending memecoin Shiba Inu started the week in the red zone after a massive 100 billion SHIB tokens were transferred to the Coinbase exchange. Amid the ongoing price corrections experienced by the global crypto market, large investors are moving huge amounts of tokens, sparking speculations about the intent.\n\nToday, May 13, the general crypto market cap has fallen by 0.66% over the last 24 hours to $2.24 trillion. The prices of top cryptocurrencies like Bitcoin and Ethereum have dropped significantly. According to CoinMarketCap data, BTC and ETH are currently trading at $61k and $2,900 respectively. Consequently, the sentiment across the crypto market as measured by the crypto fear and greed index, rests at 52 points, indicating a period of investor uncertainty. Moreover, SHIB whales are carrying out hefty transactions regardless of the state of the market. Let us look at the transaction in detail.\n\nSHIB Whale Moves 100 Billion Tokens to Coinbase\n\nEarlier today, the blockchain transaction tracker, The Data Nerd, reported that it had spotted a mouthwatering amount of SHIB tokens changing hands. According to the provided data, the whale transferred a staggering 100.4 billion SHIB tokens from his wallet to the centralized exchange, Coinbase. Following this, the price of the token has suffered a loss of up to 3%.\n\n7 hours ago, a whale 0x462 just deposited 100B $SHIB (~$2.24M) to #Coinbase. Within a week, he accumulated those tokens with avg entry $0.00002408.\n\nIf sold at current price, he will have a small loss ~$178k. His address:https://t.co/NrkJwBbVb1 pic.twitter.com/cAJ7FZdRXg — The Data Nerd (@OnchainDataNerd) May 13, 2024\n\nThe aforementioned tracker also mentioned that the whale had accumulated the Shiba Inu tokens over the week at an average price of $0.00002408. Notably, if the whale sells the holding now, he will suffer a loss of up to $178,000. With this, it is safe to say that the latest transaction is not intended for sale, but could be a part of a distribution strategy by the investor.\n\nA further look at the whale’s wallet reveals that he has other tokens in holding, however, most of the recent transactions involved SHIB. For example, between May 5,6, and 7, the whale accumulated over 100 million SHIB tokens as revealed by the OKlink tracker.\n\nSHIB Price Dynamics Amid Large Transaction\n\nMeanwhile, this crypto move to the Coinbase exchange has sparked discussion across the SHIB community about the effect on the price of the token. According to CoinMarkeCap data, the price of SHIB has slumped by 3% over the last 24 hours. This is worrisome particularly because the dedicated Shiba Inu community has been anticipating a price rebound. As a result of this, its market cap has plummeted by 2.5% to $13 billion.\n\nConversely, the activities surrounding Shiba Inu, as measured by its trading volume, have witnessed a spike within the recorded time. Per CMC data, SHIB has a 24-hour trading volume of $233.7 million, signifying a 32.11% increase over the last day. Lastly, according to Coinglass data, SHIB’s open interest dropped by 1.68% to $57.99 million, and the number of derivatives increased by 46.46% to $84.39 million."
    }
]