[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5OWHFqSnZENHhINVY2ZWdxam43UjQzcWZDYW50cVNrSWJWQUhRcmVTZG56dk1YMkVJaE9PaGtlWHA4cFlEeG9OVEtocW1yT1BraGJ3TFJxNjJVdzAtajlTeUNINnpxNDh30gFuQVVfeXFMTjFhNXd2eTFhU0ZvamVFV0tMRVB2RWRpSFpCWUZzeGhNM0JlVnZMWHJ4OWNFb1lkem1VSGpIT0FPQUhydmd0TjhLdDI1Q0tybndqZ2kwUl9KUW1xZ2VkM1ZJVlV2YzI1Y2ZYOFQ3aXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "When Will Ethereum Price Recover? - U.Today",
        "content": "Advertisement\n\nWhat's happening?\n\nThis past week, Ethereum has witnessed a massive sell-off crisis, with the price dropping below $2,900.\n\nA recent report by CoinShares highlights that Ethereum has experienced a massive capital outflow, the largest since August 2022, with total losses amounting to $119 million over the last couple of weeks.\n\nSource: CoinMarketCap\n\nThis continues a trend from a week ago, when Ethereum's price dropped from a high of $3,887 to a low of $3,232, marking a 16.9% loss. Even though ETH's price may be stagnating at the moment, a surge in staking indicates that existing users believe in the long-term potential of ETH.\n\nIn wake of ETF launch\n\nAccording to Bloomberg, multiple applicants are supposed to submit their amended S-1 forms before July 8. This could mean that the final approval of S-1 forms is expected to take place by July 12, while the launch could happen somewhere the following week.\n\nAdvertisement\n\nAsset managers are optimistic that the SEC will approve the first U.S. ETFs that invest directly in Ether by mid-July. There was earlier market speculation that approval would come during the July 4 holiday week.\n\nHowever, the SEC has informed Ether exchange-traded fund applicants that they have until July 8 to submit updated paperwork. There might be another round of filings after this date.\n\nSome experts, such as Eric Balchunas, point out to an unnecessary pause on the SEC part.\n\nNo one really knows why the SEC is taking their sweet time with these, given how light comments were, these could have easily been trading by now. Could be one 'problem' issuer slowing down process or just summertime lazy/ppl on vaca. Not sure. That said, all indications launch… — Eric Balchunas (@EricBalchunas) July 3, 2024\n\nThe SEC’s feedback to issuers consisted of minor questions that are now being addressed. In May, the SEC approved a proposal by exchanges to list these products, but a separate approval is needed before they can be launched.\n\nGalaxy Digital’s head of asset management believes that spot Ether ETFs will be approved in “weeks” rather than days but agrees the decision will come sometime in July.\n\nWho's joining in?\n\nAsset manager Bitwise has filed an amended S-1 form for an Ethereum exchange-traded fund ahead of its July 8 deadline, indicating the products are nearly ready for launch. Other firms, including BlackRock Inc., Fidelity Investments, 21Shares and Invesco, also have filings waiting for approval.\n\nMany issuers have yet to disclose the fees on their respective funds, which is necessary before trading can begin.\n\nWill price follow?\n\nEther has underperformed relative to Bitcoin for over a year, with Bitcoin posting significant gains bolstered by over $14 billion in flows to its spot ETFs in 2024.\n\nThe anticipated launch of ETH ETFs on July 8 could be a \"golden egg\" for Ether's price action. However, Bitcoin is expected to face sell pressure as $8.5 billion worth is returned to creditors of the collapsed exchange Mt. Gox starting this week, according to a report by K33 analysts.\n\nSource: TradingView\n\nThe 100 EMA frequently serves as a reliable gauge of the general trend, and a break below it could trigger a large sell-off. Having currently regained the critical $3,000 level, Ether now needs to reclaim the $3,360 support level before July 8. If it fails, the short-term rally might be paused."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPMXgxVE02MDQ0NXFXRnZMOUdpNjRmTlFuSjVqUVl2ZkxQWmhsWXBwZTZaVW5OM0lNSFRCcVpESVNPSzZOMk5EQnpiZ0pKSDlvajhoTGc4Q085Y2ZlSDVWaDByWThEa1lHZ1VNWTkzZ3c4VlI0VzRNSlcwdmFPVHNEVldqZ0FtSkpzQXNvcExBVFk0Y2hLYkYzZEhzUENHaW9BOVJtLW9GdG5TVmJfcXpjbF9HWFBuVmhpN3lpV3VpUnJfZXNDMFIybVhLdGtFOEZGd2tDQzRPN05CNHAyaTl3VC0wbl8zcmRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Could Launch In A Week Or Two, Says ETF Analyst Nate Geraci: 'How Quickly Will SEC Turn These Around?' - Benzinga",
        "content": "Nate Geraci, president of The ETF Institute, predicted that Ethereum ETH/USD-based spot exchange-traded funds could launch within the next two weeks.\n\nWhat Happened: Geraci, who actively tracks developments on cryptocurrency ETFs and shares updates on the same via his official X handle, hoped that modified S-1 filings would arrive on the SEC’s desk by Monday.\n\nHe wrote that from then on, the potential launch dates would be contingent on how soon the regulator does its verification and gives a go-ahead.\n\nSpot eth ETF S-1 amendments supposedly due tomorrow…\n\n\n\nHow quickly will SEC turn these around?\n\n\n\nAgain, main item I'm watching for is fees (which won't be required w/ these amendments).\n\n\n\nOtherwise, assume issuers gearing up for launch in next week or two. — Nate Geraci (@NateGeraci) July 7, 2024\n\nIn a dramatic turn of events, the SEC approved 19b-4 forms for applications of Ether ETFs in May, after weeks of negative sentiment. The SEC asked the ETF applicants to submit the revised S-1 registration statements, the final hurdle before the funds can start trading on U.S. exchanges, by July 8.\n\nSee Also: Crypto Billionaire Justin Sun Offers To Buy Bitcoin Off-Market From German Government To Minimize Price Impact, Lawmaker Slams Authorities For Selling\n\nWhy It Matters: Geraci's forecast was in line with his previous estimate of a mid-July launch last week.\n\nThe eventual launch of spot Ether ETFs could have significant implications for the cryptocurrency market since it would be the second such digital asset fund in the U.S. after the much-talked-about Bitcoin BTC/USD spot ETFs that debuted in January.\n\nCryptocurrency exchange Gemini estimates net inflows of up to $5 billion within the first six months of trading into Ether ETFs.\n\nPhoto Courtesy: Shutterstock\n\nPrice Action: At the time of writing, Ethereum is trading at $2,873.96, down 5.77% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next:"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQOTk1ZTJ2LUE4SmhWRE5aUmxyNW1VREhfdXJORTZZdGhXOGxSSlhBaE41R0JVdHJKSTVNS05scnRwRmd1ZEhZcThUMnRVNEU1S0QtZjktMXcyNklJZWVlNnV4d0RlVTZ1SHZHZjkwdWt0WDdnekliaWdyRC1BeFU2NHU1UV9tN2l0S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum: the clash between titans - The Cryptonomist",
        "content": "In this article, we compare two leading blockchains in the cryptographic sector: Solana vs Ethereum.\n\nBoth have very developed DeFi ecosystems and a wide range of successful applications built within them.\n\nThe two networks work together to create the most thriving web3 environment possible, with the goal of becoming the premier layer of the on-chain future.\n\nThe challenge is also played out on the token level, with ETH and SOL trying to offer the best return on the market.\n\nLet’s see everything in detail below.\n\nSolana vs Ethereum: the main differences on the technological level\n\nWe are talking about one of the most heated and intense clashes on the technological front of the last decade, as well as the most discussed in the crypto landscape: the Solana vs Ethereum war.\n\nEveryone knows by now that these two blockchains have been in conflict for years to win the title of dominant web3 infrastructure.\n\nIn fact, however, they are quite different in many aspects: Ethereum is an EVM network built with the programming language Solidity while Solana is SVM built with C, C++ and Rust.\n\nThis alone is enough to distinguish two poles in which the development of decentralized applications takes place according to different coding rules.\n\nFurthermore, the concept of “account” also changes significantly depending on the context, whether it is used in an Ethereum or Solana environment.\n\nIn fact, on Ethereum the term account is used to describe an entity that owns ether (ETH) and can initiate transactions. It is classified as follows:\n\nEOA (Externally Owned Account): account in possession of a private key, conceptually similar to a wallet;\n\nCA (Contract Account): account for smart contracts not in possession of a private key.\n\nSimplifying, we can say that EOA does not have storage space and therefore cannot be used as a contract for carrying out operations (except for exceptions with ERC-4337).\n\nThe CA, on the other hand, is simply a software program executable by EVM with a code (contract) that distinguishes it. An EOA can therefore execute a call through CA but not vice versa!\n\nOn the opposite front of Solana, however, the concept of “account” is broader and refers to an entity that can always store and save data.\n\nThe state of transactions is therefore saved using accounts in a manner similar to what happens in operating systems like Linux. It is worth noting that Solana natively supports the account-abstraction function, allowing self-calling between programs.\n\nThe accounts in Solana are of two types:\n\nExecutable account (program account): smart contracts called “programs” that store the code;\n\nNon-executable account (data account): entities that can receive tokens or data but cannot execute code.\n\nBelow is a map of the main technical differences.\n\nTwo different approaches for the development of DeFi environments\n\nDescending to a less technical level, we notice that Ethereum and Solana use different marketing approaches for their respective DeFi environments.\n\nAlthough both chains are intent on attracting the widest possible base of capital and users, they focus on different segments.\n\nIn fact, Ethereum presents a more “institutional” character with its main values oriented towards the security of the network and decentralization.\n\nSolana, on the other hand, has a more “smart” personality, oriented towards the scalability of operations and cryptographic efficiency.\n\nThey follow the limits of both blockchains on their own: for Ethereum scalability, for Solana decentralization.\n\nLIVE NOW — Ethereum vs. Solana\n\n\n\nThat’s the debate we’re having today. On Ethereum’s side, we have @Ethereum Researcher @drakefjustin, and on the @Solana side, we have Solana’s Co-Founder @aeyakovenko\n\n\n\nThey give us the good, the bad, and the ugly of each other’s blockchain,… pic.twitter.com/MlCWd4NtOT — Bankless (@BanklessHQ) June 3, 2024\n\nEthereum presents a TVL of 59 billion dollars, much greater than Solana’s 3.5 billion dollars. For this reason, the Foundation uses a softer communication with the public and with less intention to create engagement.\n\nSolana, on the other hand, focuses entirely on innovation, user experience, and transaction throughput. The latest innovations launched, such as the Saga smartphone and the Blinks, speak volumes about the approach the network uses with retail.\n\nWe can say that Ethereum is a less performant blockchain, at times less “convenient”, but more secure and reliable.\n\nSolana is much more “fun” and efficient to use, but less decentralized based on a few clients and less secure.\n\nIf you are high-net-worth individuals with a moderate risk exposure, you will surely appreciate Ethereum more.\n\nIf you are young, fearless, and have a limited budget, you will probably find the features of Solana more appealing.\n\nThe main web3 dapps of the two ecosystems\n\nThe war between the two titans Ethereum and Solana continues uniquely in the creation of the best decentralized web3 applications.\n\nOn Ethereum the largest dapp in terms of TVL is the liquid staking platform Lido: it alone attracts almost 10 times the entire capital absorbed by Solana.\n\nNext, we find successful dapps such as EigenLayer, Aave, Maker, Ether.fi, Uniswap, RocketPool, Ethena, and Pendle.\n\nIn the suite of protocols of Solana, we find Jito as the top-ranked, with a TVL of 1.74 billion dollars. Then the most used applications are Marinade, Kamino, Sanctum, Jupiter, Marginfi, Drift, BlazeStake, Meteora, and Solend.\n\nThe majority of Ethereum dapps are integrated with various layer-2, ensuring greater scalability. At the same time, the differentiation of blockspace requests leads to a fragmentation of liquidity, which is often inconvenient.\n\nFor this reason, Ethereum is often criticized by its detractors because as a Settlement Layer it has to rely on external solutions to grow.\n\nOn the other hand, the competitor is criticized for the absence of a flourishing and secure DeFi ecosystem: almost all the dapps on Ethereum surpass the total TVL of Solana!\n\nIn any case, it is worth noting how Solana is producing very interesting products, such as the recent platform pump.fun.\n\nProposed as a launchpad for memecoin, in a short time it managed to become the most profitable dapp in the entire cryptographic ecosystem.\n\nOn July 1st, it recorded record fees of 2 million dollars, even surpassing the entire revenue of the whole Ethereum blockchain.\n\nChapeau.\n\n🚨Breaking Big: @pumpdotfun Becomes No. 1 Crypto App Across All Chainshttps://t.co/VS31GZ2FXq has surged to the top spot as the leading crypto app, surpassing Ethereum with a staggering $1.99M in revenue generated over the last 24 hours. pic.twitter.com/59euyqCRWp — SolanaFloor (@SolanaFloor) July 2, 2024\n\nA speculative war: Solana with SOL vs Ethereum with ETH\n\nThe Solana vs Ethereum challenge can only conclude with a focus on their respective gas tokens SOL and ETH.\n\nIt is clear that the better these cryptocurrencies perform on a speculative level, the more users are interested in purchasing them and becoming part of the community.\n\nThe metric of active addresses and the volume of transactions, in fact, largely depends on the evolution of the price of SOL and ETH.\n\nBoth networks are interested in pushing the price of their respective coins upwards, both for a boost in on-chain metrics and for obvious economic reasons.\n\nIn 2024 the two coins recorded similar trends, with a growth of about 50% from the January quotations. SOL, however, grew at a faster pace in the last quarter of 2023, attracting more new buyers compared to what Ethereum did.\n\n>>Solana Vs Ethereum in 2024\n\n\n\nSolana is Winning by Huge Data Growth Margin\n\n\n\nGrowth Metrics(%):\n\n\n\n– Price\n\n– Stablecoin Volume/Marketcap\n\n– TVL/Fees\n\n– NFT Trading Volume\n\n– Daily Transactions/ Daily Active Addresses\n\n\n\nEthereum Growth Metrics(%):\n\n\n\n– DEX Trading Volume\n\n– Daily Volume pic.twitter.com/Q8GV7mQ9Jy — hitesh.eth (@hmalviya9) May 30, 2024\n\nAt the moment both SOL and ETH are close to their respective all-time highs, with the latter seeming slightly advantaged.\n\nThe evolution of the prices of the two coins from now until the end of the bull market will be essential to bring more adoption to blockchain technology.\n\nPlaying a decisive role in the coming months will also be the upcoming inauguration of the spot ETFs for the two cryptocurrencies. First that of Ethereum, then (perhaps) that of Solana, will contribute to attracting more capital inflows.\n\nAt stake is the dominance as a settlement layer for the major financial operations of the cryptographic world.\n\nIt is not certain, however, that in the future only one network between Solana and Ethereum will survive, and indeed a coexistence scenario is much more likely.\n\nObviously, there will be a network that will have a larger market share but without precluding the existence of the other\n\nETH vs SOL\n\n\n\nDONT BE A MAXI.\n\n\n\nThe world is gonna be multi-chains!\n\n\n\nStop wasting time arguing about which one is better, and start learning about all the benefits and use cases each bring.\n\n\n\nMore ETFs will grow the pie!\n\nETF products will bring attention and money into the space.… pic.twitter.com/MdtTDdCf7X — Gun (Kingbund.eth) (@KingBund) July 2, 2024\n\nAlthough in a perspective of coexistence, the dispute between the maximalists will continue for many years to come.\n\nAs we can learn from the historical Pepsi vs Coca Cola discount that has been ongoing for over 100 years, the fight for supremacy is always around the corner."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQNGM3M2hOOUNxYWs2YjNBVmZaZGY0STJndjZ1R2VDVUd3Z2VES3FWdTlqejlFaWlGMzg3ZXVEZUg3QmY3NVNQanN6SGxkWkIxM0dTRDU2cjFqVmhuTG43OTQwVHZ5bkgzODQtb0R5YlFHLVVsLXpLSlBPeUNTc09UWjdhYi16RHRjcjJTWDJXN18xNlhlVk95bnhGN05FWS1iZGNicnNEMDNpSkh1bnhKbmpuZDBob0plc1VVU1VIT1dDUjjSAcgBQVVfeXFMUGYzSGZRcUdVVUhJNFZQemhXS1lGREV3WHRwS242R1M3emtKMGx4LXlpQmhfMi1TWWRpNDVaSEU1Q3VJM0hkXzlJZS15ZmtuTmhrNl9zeW9rZkNhQ0ZxX01Nb0NqUzBDNk1GdE5LWGloZWJoUnhDMHJ1VGt2clhxN0drS0tPWlpTRFVLWmxmZ1lnNGlmLVNBYXJVcEYzSnlJY0pheUJCVGNkOUdzWjNHTFZrQzFkRTJTSkJ5cE0za09HNkhhVmJJWjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO Matt Hougan Says Ethereum Cycle Incoming, Outlines Two Massive Tailwinds for ETH - The Daily Hodl",
        "content": "The chief investment officer (CIO) of Bitwise Asset Management, Matt Hougan, is predicting a massive bull cycle for Ethereum (ETH) based on several factors.\n\nIn a new interview with Scott Melker, Hougan says that spot Ethereum exchange-traded funds (ETF) could draw $15 billion within 18 months of their approval, which is expected soon.\n\n“So I think it’s a down-the-middle prediction. We could be higher, we could be a little lower, but I think $15 billion is in the bag.”\n\nHe also believes two additional bullish factors for ETH could send its value soaring: a greater acceptance of crypto by the US government and Ethereum’s recent network upgrade, Dencun, which aims to reduce costs for layer-2 transactions and data availability.\n\n“I think that these numbers overlook the fact that we’re entering what is usually the ETH cycle. They also overlook two huge tailwinds that I see for ETH, which is it had a lot of regulatory uncertainty, and over the last two months, a lot of that has gone away.\n\nNot only did we get movement forward on ETFs, but we also saw Washington generally change its tune on crypto. That’s a massive tailwind for ETH. And then you have the aftereffects of the Dencun upgrade, which I don’t think the market has fully recognized what that will mean for this market.”\n\nEthereum is trading for $2,974 at time of writing, down 3.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOUjlUTHdJNnN6SFd6TTJ5eC1hLVh3cUdoNThfcEVsdXExcHVjZ29HZ3JqZGxEdjg0SGhRV2dWMldOQ0txZzdxeG9FU2RaclBmZ2I0endOSG8tdi1sVFYyRGZQSW1fZzZaVFZsa0NmOFQxMkl3Q0tZSngxdlRzbVNMb2lOMGxwTkRMUUswcEdWNVY4ZHc2R3Q5MXB2b1ByQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Here’s What Shiba Inu Could be Worth if Ethereum Hits $50,000 - The Crypto Basic",
        "content": "Shiba Inu could spike to a new all-time high of $0.0002545 if it follows Ethereum’s trajectory should the leading altcoin reach $50,000.\n\nThe crypto market is now on a recovery path, as most assets look to recoup the losses incurred this week. Shiba Inu is among the best performers in the recovery campaign, currently up 15.22% over the past 24 hours. SHIB has now reclaimed the psychological thresholds at $0.000014 and $0.000015.\n\nShiba Inu currently boasts a position among the 10 biggest 24-hour gainers on the top 100 list of largest cryptocurrencies. For context, Bitcoin (BTC) is only up 4% in the last 24 hours, while Ethereum (ETH) has increased 4.06%.\n\n- Advertisement -\n\nShiba Inu Price if Ethereum Hits $50,000\n\nWith the prospects surrounding Bitcoin and Ethereum currently bullish, market watchers expect a similar effect on Shiba Inu. Notably, when leading assets like BTC and ETH record upsurges, Shiba Inu and other altcoins follow suit. This is due to their close price correlation.\n\nIntoTheBlock’s Correlation Matrix confirms that Shiba Inu boasts a price correlation of 87% with Ethereum over the last month. In addition, SHIB has a correlation of 94% with Bitcoin within this period. This indicates that a rapid price surge from ETH or BTC could trigger a similar rise in Shiba Inu’s price.\n\nConsequently, we recently assessed how much Shiba Inu would be worth if it trails Ethereum upon the completion of one its numerous targets. One such target saw asset manager VanEck predict last May that Ethereum could hit $50,000 by 2030.\n\nIf Ethereum clinches this $50,000 price, it could have far-reaching effects on Shiba Inu. For context, ETH currently trades for $2,989. The altcoin would need to rally 1,572% to hit the $50,000 target. If Shiba Inu sees a similar upsurge, its price would jump from the current $0.00001522 to $0.0002545. This would lead to a new ATH.\n\nSHIB at the $0.0002 Level\n\nNotably, despite its recent encouraging recovery performance, Shiba Inu is still down 66% from its yearly peak of $0.000045. In addition, SHIB has dropped nearly 83% from the all-time high of $0.00008845 attained in 2021.\n\n- Advertisement -\n\nMarket participants and analysts believe SHIB still has more room for growth. While some project a reclamation of $0.000045, others expect a rally to $0.000165, beyond the current all-time high. Several market commentators also predict a surge to an ambitious $0.00045 price.\n\nPredictions to the $0.0002 level have also come up. Last month, crypto trader Valeriya projected a rise to $0.000022. Also, Bitcoin advocate Moataz Elsayad believes SHIB can hit $0.00024. These projections have varying bases, with some citing a broader market uptrend as a possible catalyst. Nonetheless, it remains to be seen if any could materialize."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNaXoyYUV2SnFONm5haUVWWDdwT2hwWVdiQ05haC1tb0NYX2F3UVctSE1maUxMc1dYWDVIREctOVhnaVh0MU1YTFhPdjJuSk1EdHVmNzktUXJ5V2wzdlNPdjVreGRibWNlbnFMVUV3dmN4a2JldEtDNjFIc2lUbVJNdXdOV19kb21wSUt1MDBUbnhEU2t4VmppZkhSaDVEUXNrYXVtWTlNVWtFS1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Drops Despite Growing Interest in ETFs in the United States! - Cointribune EN",
        "content": "Sun 07 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nA recent survey highlights a fascinating trend: Americans’ interest in Ethereum-based exchange-traded funds (ETFs) is on the rise! If the SEC approved the launch of an Ethereum ETF, nearly a quarter of voters would consider investing in this crypto.\n\nEthereum ETF captures the attention of Americans!\n\nThe launch of an Ethereum ETF in the United States could boost investments in digital assets. Although the future of these ETFs is uncertain, their introduction could accelerate the maturity of the crypto market and its widespread adoption.\n\nThe arrival of an Ethereum ETF could broaden the interest in cryptocurrencies beyond Bitcoin. In the crypto market, anticipation is rising around the launch of the Ethereum ETF, likely scheduled for July 15. This crucial step could trigger a wave of investments and mark a historic milestone in the adoption of cryptocurrencies. Experts predict a massive influx of capital, with estimates reaching up to $15 billion in the first few months. If the SEC gives its green light, this event could not only validate Ethereum as a major investment asset but also open the door to a new era of blockchain-based financial products.\n\nETH crypto in free fall!\n\nCrypto is gaining importance among American voters. Since the beginning of the year, a third of likely voters are more receptive to crypto, and 47% believe it will eventually be part of their investment portfolio.\n\nDespite the excitement generated by the imminent launch of Ethereum ETFs, ETH crypto is currently experiencing a significant drop of 1.72% in the last 24 hours and is trading around $3,014. After losing a key support, Ethereum risks falling even further, with short-term forecasts seeing a drop to $2,900.\n\nThe Ethereum ETF represents a major opportunity for the crypto market, attracting the attention of traditional investors and voters. With growing interest in emerging technologies and the anticipation of clear regulation, the future of Ethereum ETFs is promising. It could mark a major turning point in digital investment in the United States.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNYkF3dWt0ZUtJU0Fib09TdzRmbzM1VUZ0QjlTM2tFM204cnZMem1yQnFSR2oteldvWXByenJ0SG5TS0lDXzA4N3k2SUZNR1lBUXd5ZzYzNkUxeHZaTzllTmdjTWNSeFZGTHFMa0dqU0M1cml6ZG9Id0pEcWhHOTBoQXJpWFgtSkhhZGlLaDVVaHZlcHdYcllWOEIwb9IBoAFBVV95cUxNbUZCQkdqeTltcTEyTTJ6NjNLLWI2Q2dDN3ZYSEswS0VQdkF5Vk94U3ctRjA0aGdDajE4NmNjTUY0MlZBWGRmV0lya2ZiaGNDRERwRjJ1RWN4TjdTYWVYeW1YN1dtcG94aGdXMkdZMHBGSnEzdmM0eXpoNDI4REszYW1zQXF0NjYtbDFDQ2txMkxuWHJ2T2lNMkpuaWZHNVRL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Holds at $3K but is Another Crash Imminent? - CryptoPotato",
        "content": "Ethereum has recently experienced increased selling activity, breaching the 100-day moving average and leading to a substantial decline toward the 200-day MA.\n\nNevertheless, the price faces a significant support region, possibly leading to a temporary period of consolidation correction in the mid-term.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA close examination of the daily chart reveals that after an extended period of corrective retracements near the crucial 100-day moving average at $3386, sellers ultimately gained control, leading to a break below this key MA.\n\nGiven that this area was filled with buying interest and demand, the breach caused a notable long liquidation cascade, accelerating the bearish momentum. As a result, the price plummeted toward the substantial 200-day moving average of $3096 and breached it.\n\nThis price action clearly indicates a bearish sentiment in the market, with sellers dominating. However, Ethereum is currently hovering around the crucial and decisive support region of $3K and is expected to undergo a period of consolidation before initiating its next major move. If a pullback to the broken 200-day MA occurs, the continuation of the bearish trend will become more likely.\n\nThe 4-Hour Chart\n\nThe 4-hour chart shows that following a period of sideways consolidation above the $3.3K support, the price ultimately faced aggressive selling activity and breached this crucial support region. This breakout led to a notable impulsive downtrend, indicating a long-squeeze event in the perpetual markets.\n\nHowever, Ethereum has landed on the substantial support region of $3K, which has previously supported the price multiple times. This area is likely filled with demand, potentially halting the downward pressures in the short term.\n\nAdditionally, the RSI indicator has dropped below 30, indicating potential short-term market correction before the next significant move. Hence, consolidation is likely in the short term, allowing the market to rest and regain momentum. In this scenario, the price range between 0.5 and 0.618 Fibonacci levels will be the main target for the corrective movements in the short term.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum has recently seen a rise in selling activity, leading to a significant decline toward the critical $3K support zone.\n\nUnderstanding the key factors behind this rejection is crucial for predicting upcoming price movements. The accompanying chart highlights potential liquidation zones within Ethereum’s price action, providing valuable insights for mid-term strategies by smart money.\n\nThe chart indicates a notable liquidity pool below the crucial $3K. This pool is filled with sell-stop orders from aggressive long positions that contributed to a significant price surge in mid-May. If sellers push the price below the $3K support zone, a massive long-squeeze is expected. This would trigger the sell-stop orders, accelerating the bearish momentum. Traders should closely monitor the price action around the $3K support zone in the upcoming days to determine the cryptocurrency’s trend direction."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNTEpIR0tLUWpNcUJ1ZWVvQ0t2R3J1bGpUQ1dPaUplLXJScXkxS3BiQWpjT3VDaWFvUldLdDFUUWRTQmhSd2V4Z29JenZ3N3hFMnQ5V1VIbGVQY3l4UFBVbVlOazk5bUpEdEFlOVJ3Wno4SVE3eFoyU3V2cGF5cTE0andxMHdMV25DM2xPd0ZYNFrSAZYBQVVfeXFMT2Q5anNDVHBISWFYM09BSHNkdEJsVmRaSXZKcW11cXhSQzUwaXdZQ0oxMjlqZUpoeXpyVHBiNUc5aEhTVkFTNFA0b2RxZDBfQWE4WUJmTTQ0cldNbDRtR0lPZ3g2ajBtd1VxelhXWEduSWxKQW9zeXNReDhJZEJLeEg3d1ViVmNHRHlEeFRuU3BLYTRGUDN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Little hype for ETH? Here’s how Spot Ethereum ETFs can change that - AMBCrypto News",
        "content": "Grayscale’s latest report suggested U.S voters are more likely to buy ETH after ETF approval\n\nWhile ETH’s value surged on the charts, its network growth fell\n\nThe recent market drawdown has affected a host of cryptocurrencies over the last few days. Needless to say, Ethereum [ETH] was no exception, with its price struggling to break past the $3,000-level, at the time of writing.\n\nWill Ethereum finally see green?\n\nHowever, there may be some hope for Ethereum maximalists, despite the altcoin’s falling prices. A new survey by Grayscale has painted a bullish picture for Ethereum’s future.\n\nAccording to the same, when the long-awaited Spot Ethereum ETF goes live, nearly a quarter of potential U.S voters would be more likely to invest in the altcoin. This surge in interest would be in line with the broader trend of crypto adoption too.\n\nThe survey also found that nearly half of all voters, 47% to be precise, now expect to include cryptocurrencies in their investment portfolios – A significant hike from 40% just six months ago. The large scale interest from people in adding crypto to their portfolios could further help ETH in the long run.\n\nSimilar to Bitcoin’s ETF launch, an Ethereum ETF would provide a familiar, regulated way for new investors to enter the market. This influx of capital, particularly from institutions, could drive up Ethereum’s price due to increased demand. This was seen with Bitcoin, where the ETF approval coincided with a significant price rally.\n\nA U.S-approved Ethereum ETF would be a major vote of confidence from regulators, potentially easing institutional concerns about the cryptocurrency’s legitimacy.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $2,987.46 following a 4.19% hike over the last 24 hours. The network growth for ETH declined materially over the period. This indicated that despite low prices, most new investors have been unwilling to buy ETH.\n\nAdditionally, the velocity around the token also fell, implying reduced frequency of trading for ETH.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHence, it’s worth anticipating what the final launch of Spot Ethereum ETFs will mean for the altcoin’s price in the future.\n\nOn the other side of the world, it would seem that Hong Kong might soon welcome Ethereum staking ETFs, and within just 6 months too. This, according to Hashkey Capital’s Vivien Wong. In fact, Wong also claimed that local regulators are now talking to industry insiders over the said proposal."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQb3FxU3MyN3dnQXRLZjRWQ1M4bXB3bjVORVZka0lCOWl5MExyNTFLZlhOUHJYc250UDlpZkVLb2hjYXVsVWlIem9NNkZyVVlnYUJsSTNlNW9ZRnZkVlBiVFdnWE0xNlFwbWpuc1hjZF9uc2pITUZiRkJHekRVRTdHUmNQYVkxRGJDOUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval: A Milestone in the Crypto’s Journey - Watcher Guru",
        "content": "The landscape of crypto investments is changing quite drastically in the last couple of months. Today is no different, as the Ethereum ETF approval will change the financial sector once again.\n\nInvestors must understand the implications of Ethereum ETF approval. This statement is even more valid if we consider that most traditional financial institutions are using crypto assets more every day.\n\nAlso Read: Ethereum ETF: July Launch Expected as Galaxy Predicts More Crypto ETFs\n\nEthereum ETF: A New Era for Cryptocurrency Investment\n\nImage Source: WatcherGuru\n\nHaving the SEC (Securities and Exchange Commission) in the US approve Ethereum ETFs brings a new era in the process of crypto adoption. As would be expected, these changes don’t only affect Ethereum, but cover the entire crypto industry spectrum.\n\nInvestor Brock Pierce had this to say in an interview with TheStreet Crypto:\n\n“Everything starts with bitcoin and once you’ve learned about bitcoin, then you might start looking down the market and understanding what’s after number one, which is Ethereum.”\n\nThe approval of Ethereum ETFs also involves the mainstream acceptance of cryptocurrencies. This change could lead to an increase in investments in the crypto space, but only time will tell.\n\nAlso Read: Ethereum ETFs: $5B Net Inflows Expected in First 6 Months\n\nImpact on the Crypto Ecosystem\n\nEthereum ETF approval will affect the larger crypto landscape. Here are some of the opportunities and challenges that come along with this change:\n\nIt provides a regulated investment path for Ethereum exposure\n\nIt has the potential to increase the liquidity in the Ethereum market\n\nIt could help stabilize Ethereum prices\n\nIt could signal the start of ETFs based on other cryptocurrencies\n\nIntegrates the crypto market with traditional finance\n\nAlso Read: Ethereum: AI Sets ETH’s Price for July 1, 2024\n\nThat said, we must note that the crypto market, including Ethereum, still has a lot of hurdles to jump when it comes to regulatory compliance and risk management.\n\nFor this reason, investors should always consider the ever-changing nature of crypto assets, even if they become more accessible through ETFs."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQNmV5aVBpa2J1MW5vdy1feVNUUUwyUGxfUmd0MmtBSlNKU2kzdS1fRjkzU2FyRFVBdTNnZUpVMmxfOWczb3JqZERFVkxta2M3QkRfaVViS3NTQUFHUkhLRi0zWWRLeVE1SWhJbHhYMm5NUHRzQTRlQlFpYm4zRk4yeTBrUVprN2ZWOE5nZ09OOC1lY09YUFZmVHFuZ0N4NVpLZXdGWTEtZXBKdU9keWJYaVVTcF9nRzA2RzBkendFdlRFQVUtMkVlS3J2bWRPOURCU0Yya3BOR2HSAd4BQVVfeXFMT0VISHVNOUJ2NDJGRjR4VlVrTm9TX2FHQ01mMGtKWlY0dzZwdUFLV2dnSG1yQVVPODQ0amlFdnVVaWJ2Z1V2cDZkMXRSNjFoT1oxa01FSFZJVHpDTi1oaGZwakE4VkdiSzBrUDZIcTViRExra3JfbDR2QjdtV0ltVE9tWmc3Vm95YWt1NDdoU2VUdTd4Z28xR0ZDZEFHSzMtQ19ySlJNZjdjU1NsNGNPeVFzMTcyODhHRWVWT0VOV2RVT1VGNy1ZNFE3VU4tU0ZFTmh0NFFXNzhRVG1QSE93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Ecosystem Suffers $400,000,000 in Losses Year-to-Date, Amount of Crypto Hacks Rise by Over 50%: SlowMist - The Daily Hodl",
        "content": "New research from cybersecurity firm SlowMist reveals that the Ethereum (ETH) ecosystem has lost $400 million in exploits year-to-date as the number of crypto hacking cases sees a 50% rise.\n\nAccording to SlowMist’s 2024 mid-year report, the second largest digital asset by market cap saw the most funds lost due to exploits as an ecosystem, followed by layer-2 scaling solutions Arbitrum (ARB) and Blast.\n\n“From an ecosystem perspective, Ethereum suffered the highest losses, amounting to $400 million. Followed by, Arbitrum incurred losses of $72.46 million, and Blast suffered losses of $70 million.\n\nAdditionally, Binance Smart Chain (BSC) experienced the highest number of security incidents, totaling 57, with losses of approximately $32.12 million.”\n\nThe firm says that based on its research, the digital assets industry saw a total of 223 security incidents during the first half of 2024 that resulted in a combined $1.43 billion worth of losses. The figure represents an increase of more than 50% from the $920 million lost during the first half of 2023.\n\nSlowMist goes on to note that decentralized finance (DeFi) is the most attacked sector in crypto, comprising nearly 71% of all incidents in the first half of the year.\n\n“From the project track perspective, DeFi is the most frequently attacked area. In the first half of 2024, there were 158 DeFi security incidents, accounting for 70.85% of the total incidents, with losses amounting to $659 million.\n\nCompared to the first half of 2023 (111 incidents with losses of approximately $480 million), this represents a 37.29% year-on-year increase in losses.”\n\nAccording to SlowMist, the top two causes of exploits were contract vulnerabilities and exit scams, which accounted for 56 and 50 incidents, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOX0VPS1ZJODBPMXN3Mms5T05zM1lRZmJFSGlydmRVZE9GRnFoRi1wZUZBVHVLU2JqZjFPY0duM0NjTUU0ZDl3TXZIbnNpZFB3WVU5cHAwS1FBNEpTT0tqWjdRNnZaY2VvWHBpM2pxWGExZnNGRnZvSnNVV0xDS0FxNXJ3NjEwelRjM18xRi1n0gGTAUFVX3lxTE5iNzlVLVhWaWlaNkhJZFJCR05ETGFwd2djUTZjek9aSGpuWE94clYxRkpHc21uMVlDdXJPX0p4eG1pbVEyaVJjZ0VhNmF0ZGc5NGRxVXFYUzlvWkp3YVdYNnhhclB0NVljRGNBOWFvX3I2VGx0Zzl4TmtLTGpuaGkwa2N5NlpLYVQ5blJ0ZjFnX3l6VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "ETF Heavyweight Franklin Templeton Unveils Bullish Report on Ethereum - U.Today",
        "content": "Advertisement\n\nFranklin Templeton, a veteran wealth manager with over $1.65 trillion in AUM, shares its bullish take on Ethereum (ETH) as a tech development and economic instrument. Despite savage competition, Ethereum (ETH) remains the backbone of decentralized economy and constantly unlocks new opportunities for the community.\n\n\"Forefront of Web3 innovation\": Franklin Templeton praises Ethereum\n\nGlobal asset management heavyweight Franklin Templeton released its \"Understanding the Value of The Ethereum Network\" report covering the tech impact of the second cryptocurrency. It displays the most important features of the Ethereum (ETH) blockchain, its challenges and opportunities.\n\nImage by Franklin Templeton\n\nThe analysts of the investment giant stressed that Ethereum advanced Bitcoin’s accomplishments to create a robust and accessible tech basis for distributed ledger applications, enabling a comprehensive decentralized economy.\n\nAs the next step, the onset of the Ethereum Virtual Machine (EVM) and its Solidity smart contracts has changed the narrative in app development, making Ethereum the foundation for a wide range of decentralized applications across various segments in B2B and B2C.\n\nAdvertisement\n\nThe report particularly highlights the scaling role of Layer 2 networks in pushing the barriers of Ethereum (ETH) performance metrics and decentralization status:\n\nCollectively, L1 blockchains (Ethereum and others) and L2 blockchains provide the foundations for “Web3,” the new iteration of the World Wide Web (WWW) that enables users’ WWW ownership. The Web3 business models that have emerged are paving the way for a new type of network economy and approach to commercial transactions, creating a protocol-based economy that encourages democratized ownership and rewards participation\n\nAs a result, Ethereum (ETH) managed to establish a vibrant, diversified protocol economy with a diverse array of novel use cases in DeFi, GameFi, NFT, metaverse and other trending segments.\n\nEthereum ETFs: Final call?\n\nAuthors concluded that Ethereum (ETH) stands out as unique combination of a native peer-to-peer payment network, a common developer toolkit and a virtual machine for executing smart contracts that has set a new standard for blockchain technology.\n\nIt should be added that Franklin Templeton is a participant of the Ethereum spot ETF race in the U.S. It filed with the SEC for an ETF approval in February 2024.\n\nAs covered by U.Today previously, major analysts and community participants are sure that Ethereum spot ETFs will be green-lit as soon as this month.\n\nThe final approval of S-1 forms is expected to happen by July 12, said The ETF Store president Nate Geraci. Potentially, this hints at ETF trading launch following on July 15."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOYjlwSjBtNWVlOWhmMVk4VllkVVpHMGxNVWdDWWVUd1VwaEREQ0dxREVvMzIxa1ZFRlBVaTJhZ3FJWUotdHZiMk9ZbVF4cFNvUlAtczN5ZlFtZ0c3ekR1RDJwbm5CbDN0UUtvcFEtbzdCSEVQQllPWjI1MXZGRWNCcEw5dkl5NEZEczFkV21YTWlPMnhtSUVYMDE5TW9XSUR1MXZMSTdtMDJ1VkZCSDlYVXRvZS1DSzd1UGNpbUQ2UXBPdmlsTW95cHlPVVY0bFZRM2RvZXZJNEFTOVhlMXlDQ2hHamRkVmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "While Bitcoin, Ethereum, Shiba Inu Witness A Meltdown, This Solana-Based Memecoin Has Surged 147% In Last Week - Benzinga",
        "content": "In defiance of the market’s downturn, a memecoin built on the Solana blockchain, Billy BILLY/USD, has experienced a significant surge, with its value increasing by nearly 147% in the last week.\n\nWhat Happened: The value of Billy, a memecoin with a dog theme, has surged by nearly 147% in the last week, reaching $0.182. This surge in value comes after several cryptocurrency exchanges, including Bittrue, Bitget, MEXC, and Gate.io, added support for the coin, reported The Daily Hodl.\n\nBilly, which was launched in June, features a puppy image and has outperformed other popular meme coins during the current market consolidation phase, which has led to significant declines across the board, the report noted.\n\nDespite the market’s downturn, Billy’s market cap is currently at $181.8 million, with a 24-hour trading volume of $55.3 million, according to data from CoinMarketCap.\n\nWhy It Matters: Despite their often whimsical nature, meme coins have been gaining traction and demonstrating significant market resilience.\n\nOther dog-theme assets such as Shiba Inu SHIB/USD and Dogecoin DOGE/USD are trading at $0.00001538 and $0.1081 respectively as of the time of writing this article.\n\nOther top-tier cryptocurrencies like Bitcoin BTC/USD and Ethereum ETH/USD have come under selling pressure over the past week – while Bitcoin has fallen over 7%, Ethereum declined by over 11%.\n\nRead More:\n\nPhoto courtesy: @billydogsolana\n\nThis story was generated using Benzinga Neuro and edited by Anan Ashraf."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNbXpsOHBrT2pRV2NSVXVZdVhQbXJpcDJfUV83bVY5VWhaam1LWXNiWHU4NmZxbTdOVG9BN2wzOEctZkJJWUk3d3RiSElkQzIxeENHRGNydUZEeGQ1REpCMGJteXJqT2hndkdYVklmUW91MjdJaDQzTy1LV251V1FCNWxMc2ZtdGRhakxfSE9pelRKS2Vi0gGaAUFVX3lxTFBLYWdtSEd0U3kwd3Qtemh1RlZDR2RWMXhlQzVfWExQakRjN1NHbmtVSHpWZWhTYnBUcERKMUM4dDZIb2NMRnZRNzAxa1laZjFaSWVZeHRKVm5mcmQweUtfN3Z5S2Z6UFluUkJTSzJRZ3p6MVBWT0hVZE5fdkRpZUVfRnFIQlhscERCZFF5SkpZZlZvVjg1NC1QZ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "What Ethereum’s future holds after ETH erases ‘pre-ETF approval’ gains - AMBCrypto News",
        "content": "ETH plunged harder than BTC despite ‘expected’ ETF catalyst by mid-July\n\nMixed views by analysts on how the market will receive the ETH ETF amidst negative sentiment.\n\nEthereum [ETH] wasn’t spared in the ongoing market rout despite a potential ETF launch by mid-July.\n\nThe second-largest digital asset shed over $500 since the 1st of July, dropping from $3.4K to a low of $2.8K, erasing all gains netted after partial ETF approval in May.\n\nHowever, Ethereum educator Sassal claimed that there was ‘no bearish’ factor apart from possible outflows from Grayscale’s ETH trust, ETHE.\n\n“This entire run has now been retraced since the ETFs got approved on May 23rd…The main overhang for ETH right now, in my opinion, is the possible Grayscale ETHE outflows.”\n\nHe added that there were “fundamental reasons to be bearish going forward” and cited possible tailwinds from increasing regulatory clarity and likely Fed rate cuts in later 2024.\n\nETH dropped harder than BTC\n\nDespite Sassal’s optimistic view, the recent dump hammered ETH more than BTC. On the weekly front, as of press time, BTC was down about 11%, while ETH declined 14%.\n\nThe unproportionate decline was unprecedented and baffled some traders, given the expected ETH ETF launch in two weeks.\n\nSome market observers claimed that ETH’s hard dump was due to a lack of a strong narrative. Another user, Evans, suggested that the market was risk-off and that potential ETHE outflows could dent the ETH ETF’s expectations.\n\n“Everyone fears grayscale unlock (more impactful in low-volume summer). The market is risk-off, and everyone expects little to no demand for ETH out of the gate.”\n\nIn the meantime, ETH pullback hit the golden zone at 61.8% Fibonacci retracement level, based on the 2024 lows and highs.\n\nThe 61.8% Fib level ($2.8k) doubled as a daily order block (marked cyan) and has been a crucial support in the first half of 2024. Whether the support hold could depend on Bitcoin’s [BTC] next move.\n\nHowever, investors’ risk-off approach was further reiterated by negative outflows in the derivatives market.\n\nSince the 1st of July, ETH has seen net outflows totaling $4.5 billion, per Coinglass data, underscoring the bearish sentiment and possible lukewarm reception to the ETF launch.\n\nHowever, a recent Bloomberg report noted that crypto market sentiment could only improve if the Fed turns dovish and offers “one or two interest cuts.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNZnhsSVNEUnNqTWpJY2NlSGFCc3ZnYnVybVU3UmRLNmI1eHNwN0hrU0VOMzE1WTJuNDVMWDg2aV9zRUgwY2FpUG14NUdPUU9YSkZnTlB2XzFNdWw0V0tIblNSOTU2eGFZRGtUNlRwTTBOWWs4aWx4YVNMZC12QlhQSWpLM2hjSl9mRjhBZmplMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Here's How Ethereum ETFs Will Disrupt the Crypto Market - Cointribune EN",
        "content": "Sun 07 Jul 2024 ▪ 5 min read ▪ by Mikaia A.\n\nEthereum ETFs are about to get SEC approval, marking a major turning point in the crypto world. Even Gary Gensler, the SEC Chairman, seems to be in favor of this development. Discover how this approval could shake up the crypto markets and what it means for investors, according to John Glover, Chief Investment Officer at Ledn.\n\nInevitable Approval of Ethereum ETFs and Investor Rush\n\nEven Gary Gensler, the SEC Chairman, is not against Ethereum ETFs. This says a lot about the evolution of cryptocurrency regulation. Gensler, known for his caution, recognizes the growing importance of crypto assets in the global financial system.\n\nIt seems that the era of Ethereum ETFs is imminent.\n\nJohn Glover, Chief Investment Officer of Ledn, views this positively. According to him, the approval of ETH ETFs could not only legitimize Ethereum as an investment asset but also catalyze a new wave of institutional investments.\n\nGlover highlights that the approval of ETH ETFs could attract new investors who were previously hesitant to enter the crypto market.\n\nHe also anticipates an increase in liquidity and price stability thanks to a better market structure.\n\nFurthermore, he sees this development as a way to reduce the often-criticized volatility of cryptos.\n\nThis optimistic outlook comes with many expectations and fears.\n\nIf the approval of Ethereum ETFs materializes, it could very well mark the beginning of a new era where crypto assets are more seamlessly and securely integrated into traditional investment portfolios.\n\nJohn Glover’s Opinion, Chief Investment Officer at Ledn, on Ethereum ETFs\n\nThe Potential Impact on the Crypto Market\n\nThe arrival of Ethereum ETFs could significantly shake up the crypto ecosystem. John Glover explains that the impact of these ETFs on the market could be twofold.\n\nFirstly, they could bring a new wave of legitimacy to Ethereum, encouraging financial institutions to invest. Glover compares this situation to the introduction of Bitcoin ETFs, which significantly increased institutional interest and Bitcoin’s price stability.\n\nHe believes that Ethereum ETFs could follow a similar trajectory, stimulating interest and confidence in Ethereum.\n\nSecondly, Ethereum ETFs could improve market liquidity in the crypto space. Glover asserts that this could result in reduced price volatility, a point often cited by cryptocurrency critics.\n\nWith more liquidity, sudden and erratic price movements would become less frequent, making Ethereum a more stable and attractive investment for conservative investors.\n\nAdditionally, the increase in liquidity could facilitate large-scale transactions, making the crypto market more efficient.\n\nFinally, Glover mentions that the approval of Ethereum ETFs could serve as a catalyst for other financial innovations in the crypto sector. For example, we could see the emergence of new financial products based on Ethereum, such as investment funds and more sophisticated derivatives.\n\nThis would help diversify and enrich the crypto ecosystem, attracting even more investors.\n\nGlover’s Optimistic Projections\n\nJohn Glover is adamant: the approval of Ethereum ETFs is good news for the future of Ethereum and the crypto market in general. According to him, this approval could trigger a series of positive market reactions. For instance, K33 Research predicts 4 billion dollars in inflows in just 5 months.\n\nFirstly, it could reinforce Ethereum’s position as a safe haven in the crypto universe. Institutional investors, who have already begun to show interest in cryptocurrencies, might see Ethereum as a viable option to diversify their portfolios.\n\nGlover also emphasizes that this dynamic could attract long-term investments, thereby increasing market stability. He predicts a rise in Ethereum prices in the medium and long term, once the ETFs are launched and adopted by the market. And this despite the recent declines of the crypto prince.\n\nFor Glover, the diversification of financial products based on Ethereum could also pave the way for greater innovation in the sector, with increasingly tailored solutions to the needs of institutional investors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQbEJVNnYzTUJyb3hDQWZpVnVXU016cGlwVW54S1g3UTdKWTRndHFGa21EYV82bldGVVhCWXpJR0lNS3JBQWxEVkZLcHdLVHIzM1dNeEJNUG9manlkYXR3ZndkUjZqQzlzZVkzUER5dmUtRWJOMl82bktKdHMtTkR1SG1KdXZyMnJka2M3c0hGdDlhQdIBlwFBVV95cUxNQmdiRTVjYlZwUnhUdjVoQ3FKdDNkc1pjbnhaTHpod051cTVta3o0VHNicTVlLWVlZE10ZG5VdDd4RTJ0M1VaTDVLLTdYX0htOGx3T3R5SEtQdmFuTnduS21PVnVIVlBaZ0RhU25CSEVjMHJEY2M1S29jNGxyWlZfLXZXdkRSYU9jRGM2bXpKY18zaGRNOFNz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETH Bounce Back as ETF Launch Nears in July? - CoinGape",
        "content": "Weekends are characterized by a drop in market activity until the following Monday. The lower trading volume and reduced liquidity over the weekend caused crypto assets to stabilize after a recent sell-off. The Bitcoin price found temporary support around $55,000, easing the sell pressure on altcoins. Ethereum price also showed renewed demand around $2900. However, with several analysts anticipating the Ethereum ETF launch around mid-July, there is potential for a major reversal in ETH’s price.\n\nAlso Read: Justin Sun Faces $66M Loss As Ethereum Records 10% Fall, Here’s Why\n\nadvertisement\n\nEthereum Price Analysis Hints $3800 Rally Amid Healthy Pullback and Potential ETF Approval\n\nThe current correction in Ethereum price was initiated in late May as the price reverted from $3974. This fresh lower-high formation of the daily chart indicates the buyers lack sufficient momentum to chase new highs, thus shifting the price trajectory sideways.\n\nThe bearish turnaround tumbled the Ether value by nearly 30% to seek support at the confluence of $1815 and 23.6% Fibonacci retracement level. Along with broader market correction, the U.S. SEC’s delay in approving ETH ETF issuers’ S-1 drafts has contributed to bearish sentiment.\n\nOn Thursday, Bitwise filed an amended S-1 for its spot Ethereum ETF ahead of the July 8th deadline. Bloomberg’s ETF analyst Eric Balchunas highlighted that the SEC’s recent comments required minimal updates, indicating a quick turnaround for Bitwise.\n\nHowever, the filing has no fee details yet, which are expected to be revealed next week. Bitwise’s proactive filing suggests they are expediting the approval process for their Ethereum ETF.\n\nAlso Read: Altcoins To Stake Without Hesitation As Bitcoin Goes Burst\n\nMoreover, the President of the ETF Store Nate Geraci, has expressed confidence that spot Ethereum ETFs will start trading within the next two weeks, mostly around the week of July 15th. Geraci also notes that the ETH price has dropped by over 20% since the unexpected 19b-4 approvals in late May.\n\nWill be *shocked* if spot eth ETFs not trading w/in next 2 weeks… Later next week a possibility, but think week of July 15th more likely. Interestingly, price of eth ↓ 20%+ since “surprise” 19b-4 approvals in late May. — Nate Geraci (@NateGeraci) July 6, 2024\n\nIf approved, the ETH price could defy a sluggish market trend/mild selling pressure and rebound 36% to challenge the downsloping trendline around $3800. A bullish breakout from the resistance is crucial to signal renewed recovery in the Ethereum coin.\n\nTechnical Indicator\n\nEMAs: The 200D EMA at $3080 and 100D Exponential Moving Average at $3330 highlight the immediate resistance against buyers.\n\nRSI: The Relative Strength Index (RSI) dived to the oversold region below 30%, which could attract dip investors in the market.\n\nFrequently Asked Questions (FAQs) 1. What does \"Spot Ethereum ETF\" mean? A Spot Ethereum ETF is an exchange-traded fund that directly holds Ethereum (ETH) as its underlying asset 2. What is the Relative Strength Index (RSI)? The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements 3. What is an S-1 filing? An S-1 filing is a registration statement that companies must file with the SEC before going public.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOaXRZaHIyLVQ0bnlOZ3hucmtic08xbkJWY3pMUGdvUGswaE8yMzJfMjZlOG0tUktYRWFYVFFFR2NndUZjS25QVzFTU3E1WXlWUmVYc2hWS1JCVDhWTlhwQ2V1bHE0X2kyQWNCZklLNERmUERQWHJ0eGRPLVFWaTRMMmhVYVTSAYoBQVVfeXFMTXpjWGdLcUttTXY1SUtyOXVZSkc5YzN3MnpoM1FXNlVTTFhOdU9oODVNZVhHSnBjNjU1bDRUREhUM3JhTm9QX0V6aXZKZzdaLWwtRXB1Qy1QNHo3RXA5V3hXU25UcThwT19RZ1JSQzhfVWZ4YWdKN2o3dzFwNUdoYXVHSlc1NWVfXzhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum – Up by 3% after 12% drop, what next for ETH’s price? - AMBCrypto News",
        "content": "While ETH’s price dropped, whales deposited tokens worth millions of dollars\n\nFew metrics and indicators suggested that ETH was undervalued\n\nAs the crypto market witnessed a crash last week, the king of altcoins, Ethereum [ETH], also fell victim to a massive price correction. Because of the price decline, many might have lost confidence in the token. However, the trend changed over the last few hours as ETH’s daily chart soon turned green.\n\nEthereum’s high volatility\n\nCoinMarketCap’s data revealed that ETH’s price had dropped by more than 12% in just seven days. AMBCrypto’s assessment of IntoTheBlock’s data also revealed that ETH’s average balance dropped, which can be attributed to the token’s double-digit price decline.\n\nIn the meantime, Lookonchain posted a tweet sharing an interesting development. According to the same, several whales started to sell ETH as its value fell. To be precise, three Ethereum whales deposited 28,558 ETH, worth over $82.2 million, to Binance. Soon after though, ETH’s price registered a trend reversal on the charts.\n\nIn fact, the altcoin’s price has appreciated by nearly 3% in the last 24 hours alone. At the time of writing, ETH was trading at $2,967.81 with a market capitalization of over $356 billion.\n\nHowever, despite the rise in price, its trading volume dropped by double digits. This suggested that ETH might not sustain its bullish momentum for long.\n\nWill ETH’s bull rally last?\n\nLike the trading volume, a few other metrics also looked pretty bearish.\n\nFor instance, though ETH recorded a price hike, selling pressure on the token continued to remain high. This was evidenced by looking at CryptoQuant’s data, with the same highlighting a rise in ETH’s exchange reserves. Simply put, several investors chose to sell.\n\nNonetheless, other metrics supported the possibility of a sustained uptrend as well.\n\nFor example – ETH’s funding rate has been rising, meaning that long-position traders have been dominant and may be willing to pay short-position traders. Its Relative Strength Index (RSI), as per CryptoQuant, was in the oversold zone too. This might help increase buying pressure in the coming days, which might in turn result in a price hike on the charts.\n\nOn top of that, AMBCrypto’s analysis of Glassnode’s data revealed that EThereum’s NVT ratio dropped sharply. A fall in this metric means that an asset is undervalued, which is generally followed by price hikes.\n\nWe then planned to have a look at ETH’s daily chart to better understand what to expect. We found that ETH’s price touched the lower limit of the Bollinger Bands – Underlining the chances of a rebound.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, its Money Flow Index (MFI) was also about to enter the oversold zone.\n\nHowever, the Chaikin Money Flow (CMF) looked bearish, as at press time it had a value of -0.09."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNNHVzVzJVTlFNaTl2RmlGdmpKaEtqUzlENmVrSWZ3N0g0STkxMEFsWXl5ckFmUnNMcUtlemdOS1NuZjVVSy1LZ1FnWVFINGZuYi1sZVRNNnVxYVltX1lrOENNZFdrRENIWlU0aUlYLUxtZEw2TG9oMEZvdUNhTTlHVnNnRzF6YTlUc1IwQzdzLWlaOS1NQlM40gGcAUFVX3lxTFBIUlhsY3pObWJ2dGR1SkxoNXlab1l3V21EZ1lfUGtaX3hxUHZqZEhreDdYN2dHc1UwUC1UOEJyWFZjWmExUnFGeEpGZ1QwTWtPRVJLbU1uR1lQdDJjZ09TcnRRNjVKMGJaUElFQTV6Y1RLQ1AzUlhac3dIY1Z4Qml3UVJ4LTVHdnQtUlZYNEZZS1Q5cF80T1FnU0NpWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Crypto funding rates take a dip – How will Bitcoin, Ethereum be impacted? - AMBCrypto News",
        "content": "Crypto funding rates for Bitcoin and Ethereum declined significantly over the last few days.\n\nImplied volatility for Bitcoin and Ethereum surged materially during this period.\n\nBitcoin [BTC] and Ethereum [ETH] holders have been severely impacted by the recent market drawdown. However, it wasn’t just holders who had been affected.\n\nLow on funding rates\n\nThe funding rates for both BTC and ETH fell materially over the last few days. Negative crypto funding rates might lead some investors to believe a price decline is imminent, encouraging them to sell their holdings or take short positions themselves.\n\nThis selling pressure can contribute to an actual price drop for BTC and ETH.\n\nWith negative funding rates, holding long futures contracts becomes less attractive. The fees eat into potential profits, making some traders unwind their long positions or be more cautious about opening new ones.\n\nThis reduces overall buying pressure, which can weaken the price support for BTC and ETH.\n\nThe shift in sentiment can lead to higher volatility in the short term. As long and short positions battle it out, price swings for BTC and ETH might become more pronounced.\n\nConversely, a significant and sustained drop in funding rates could be seen as a contrarian indicator by some investors.\n\nThey might view it as a sign of excessive bearishness, presenting a potential buying opportunity for BTC and ETH at what they perceive as a discounted price.\n\nAt the time of writing, traders were slightly bullish around Bitcoin as longs had finally surpassed short positions accounting for 50.7% of all trades.\n\nEthereum witnessed a similar rise in bullish sentiment as percentage of long positions on ETH grew 50.9%.\n\nIV grows as prices fluctuate\n\nThe Implied Volatility for both BTC and ETH also grew during this period. A rise in IV indicates that option traders are pricing in a higher likelihood of significant price movements for BTC and ETH in the future.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nThis suggests growing uncertainty about the future direction of the markets. If the market sentiment sways heavily towards bearish, the negative funding could amplify any price drop due to increased short selling.\n\nIn contrast to that, a sudden positive shift could lead to a more significant price rise due to higher volatility."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOYm5vd2Z1bjdaZUU3ckxqVUd0RWV6NWtvWDJWdHJjTXlBSFl6dXZ1VUN2dEZSb2xwX1ZSQ2J0NWFYUkUzTkppV085aS1ac2ktV0FybnRucDJORDZmV21kckh4MjA1MFNHQTF4YlEyeUhqaTBrMmFUak5keGY2NU1tV21pTnBxVVN5WVFjYlVBZFNUQVHSAZgBQVVfeXFMTmJzMEV6TGhwdFBrYkhJR3FfSnZLY3NlbWtEMFdxRFRtMmd3aXJBaHJTSDV1SV9jUnJJYzdRRjk0YWJhXzFiNmh1YWZxd2dXSFI5NG1fZ09JdnA0UzNONjdxbUJrZVpDZzhQczZSR3J0WGhUWGZWNThVLXpocGVhX3VSOXQ0S1RkY0pFa0JTMnJqS3UxLVcwN1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Why is Ethereum down below $3000 today? Whales, liquidations, and more… - AMBCrypto News",
        "content": "Mt. Gox has begun repaying creditors who suffered losses when it collapsed in 2014\n\nEthereum fell to an intraday low of $2,825 and seemed to be on course for 4 consecutive daily red candles, at press time\n\nBitcoin, the world’s largest cryptocurrency, crashed to its lowest level since February earlier today as the market reacted to news of activity around a Mt Gox-linked wallet. In fact, such was the scale of the crash that BTC fell below $55,000 on the price charts, down over 9% on the weekly charts.\n\nIt wasn’t alone though, with Ethereum taking BTC’s lead. It recorded worse losses too, with ETH dipping below $3,000 to hit an intraday low of $2,820.\n\nWhale activity also contributed to the losses\n\nEthereum’s freefall also appears to have been exacerbated by whales selling significant Ethereum (ETH) amounts to repay debts on their sunk bets.\n\nIn fact, on-chain data resource LookOnChain revealed that ETH’s price declines posed liquidation risks to Ethereum whales who longed ETH via Aave and Compound. For instance, the tool tracked an address selling 26,600 ETH to repay a debt on Aave in a post on X.\n\nLiquidations\n\nAs expected, Friday’s market bloodbath resulted in nearly $650 million worth of cryptos, including $537 million in bullish bets, being liquidated in just 24 hours.\n\nOver $130 million worth of ETH long positions were forcibly closed in the 24 hours leading to press time too.\n\nMeanwhile, total ETH Futures open interest (OI) across top exchanges declined by almost 12% over the aforementioned period too – A sign of funds exiting the market.\n\nFinally, Ethereum’s CME OI fell by 7.59% too, confirming bearish investor sentiment across the board.\n\nETH/USDT technical analysis\n\nETH/USDT losses, now extending to a fourth day, have piled pressure on the pair. Owing to the same, the pair breached key support levels at the height of the slump. ETH’s price slipped below the 50-, 100-, and 200-simple moving averages on the daily chart.\n\nThe last time ETH/USDT fell below all three trend lines on the daily timeframe was in August 2023. At the time, the crypto market saw losses occasioned by reports of Elon Musk’s SpaceX selling its Bitcoin holdings.\n\nETH was last spotted at $2,920, ranging 40% below its all-time high, according to CoinMarketCap. Ethereum’s subdued performance this week has strengthened a bearish outlook in the short term too.\n\nThe ETH/USDT pair is now positioned to face resistance around the $3,200-level, which it previously contended between mid-April and mid-June."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPUW15NER3NHEzSFIwSkFfSVVsZFU2OTBicEpWWUNUMUNXOGs1eWVocTVfVEVCOFM1aXNhSmdraFJVcTItRFNUWE91OXg2ZTFQLW9rRF80dkRudS1XVktBX0NsNG9Pc09TRXp5NTgtdEZuTFo4T0RVV05iOHl1NENqdkd2REg1WFFZLS1ic2lkTDFuTVdRY3RNV3NQcHpCNkFTTlFsRGg3VFJCc01pamdGZ25oRklyNTRrbnE0TVBsNEJXTU5lZkszd3hkZVlvanV3NkxIV2pLcHBtd9IB5wFBVV95cUxPTGhVbEg2dWRueEE4anlIcFRTX1pPa3ZQV2pWTFl5djZzVi1UelVEaklkUmNlM2RiMW9lcUpuR2tDYXV3RExMOWNUN0hieHVucjQyS2lJa2ZQZGJONU9CTVFaeUNUUnRVY0llMzJybFU1Y3hnazdNUElZVkU1NHdlRWNoY0dOYlVCb2pBeUJjdmVkanY1cElyYVRVc1hMeFNfNWhUbG01OUV4ZjBtcWw0ZnlmZnVlRWZnSUIyc2t5T1pNZUtOejM1TkpSS3lDcEZXNzVfRXhNWXVoa09qMVhIMkVfOTZGMjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "3 Best Ethereum DeFi Platforms to Get Early Access to the Solana ETF in 2024 - Analytics Insight",
        "content": "Launched in 2020 by Ava Labs, Avalanche aims to address the limitations of existing blockchain technology by providing near-instant transaction finality, high throughput, and low transaction costs. The platform uses a novel consensus protocol known as Avalanche Consensus, which allows it to achieve a high degree of decentralization and security without sacrificing performance."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRWhQUUtITWRZUThiZmNSYWRBRnYxQVpSeVZYS242U1VVWHdhVjV1REwtMDBUd05TQXp1N1JueFZuTDNyNUhwbnZHNHNwbzkyNUFBOU9ubk5TcnU4V3p6OUFFb0t0eVVGd0hVRXpCNXpDLWJmSUpJTE94WU0zT2pKZGQ4ektIU183TGVPRnVwa0o3b3Rq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Could See 25% More US Investors: Grayscale Survey - Coinfomania",
        "content": "Grayscale’s recent survey highlighted the approval of a spot Ethereum ETF could increase US investor interest in Ethereum by 25%.\n\nThis increase in interest is driven by economic concerns like inflation and worries about financial stability, particularly among younger individuals and minority communities. 40% of voters from the previous year desired to invest in cryptocurrency. Due to economic instability, that percentage has increased to 47% this year, indicating that more individuals are interested in digital assets.\n\nSource: Grayscale\n\nAccording to Grayscale’s survey, many Americans are drawn to cryptocurrencies because they see them as a way to achieve financial stability and manage their expenses.\n\nEconomic worries have historically influenced crypto interest. Bitcoin’s limited supply allows it to function like gold, acting as a store of value. Grayscale found that familiarity with cryptocurrencies increases the likelihood of seeing Bitcoin as a hedge against inflation and other macroeconomic events.\n\nDemographic Ownership Patterns\n\nNearly 70% of people surveyed said they own some form of investment and around 19% own cryptocurrencies. Men, Black and Hispanic voters, and younger people have higher ownership rates. Gen Z respondents, in particular, reported a 31% ownership rate, with many saying they are more interested in cryptocurrencies because of inflation.\n\nDespite the FTX crash, enthusiasm for crypto remains strong in the US. Approximately 40% of investors believe their future portfolios will include Bitcoin.\n\nGrayscale’s data shows that cryptocurrency interest transcends political boundaries. Ownership rates are similar among Republicans (18%) and Democrats (19%). Voters are split on which party is more favorable to the crypto industry, with 30% believing both parties have a favorable stance on crypto policies.\n\nThis balanced interest aligns with recent bipartisan support in Congress for the resolution of SAB 121, enabling banks to serve as custodians for crypto, making it more accessible.\n\nPolitical Views on Crypto\n\nHowever, differences exist in how each party views the importance of crypto-related issues. Republican voters are more likely to prioritize inflation and the economy, with 54% compared to 33% of Democrats. Conversely, Democrats focus more on issues like gun violence, climate change, and income inequality.\n\nMeanwhile, Bitcoin and Ether prices continue to be affected by government sell-offs and Mt. Gox’s repayment. Bitcoin has stabilized around $57,000, while Ether stands at $3,027 as of press time."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNdzFvajBIemFmX1lyZWNHY2Z5Y2RudDloYmNkdVRoZnBtTGM2MXdIRUpiUUM4OUdiSEFIVWpuZTB2MUJKNmpxcUhNYWFQdDZTMGdhTTQ3dndTcE1hY2Roa1RCam9KWnJzc0dPVm5uVGJUM1ByLVF0ZWVxZlZwYWwxdkEtdktaMzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction for July 2024: Will ETH Prices Recover or CRASH Further? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The Ethereum price has experienced significant volatility recently, rebounding from a low of $2,800 to the current critical level of $3,000. This recovery, marked by a +3% increase in the past 24 hours, comes amid broader market fluctuations and an 11% decline over the past week. With the crypto community closely monitoring the market, the key question is: What lies ahead for Ethereum? In this article, we will delve into the latest trends, provide an Ethereum price prediction, and discuss the implications of potential further declines or recoveries.\n\nEthereum Price Prediction: Current Status and Future Outlook\n\nEthereum Price Today: Overview and Analysis\n\nAs of today, the Ethereum price is hovering around $3,000, a crucial level that could determine its near-term direction. This price reflects a modest 24-hour performance increase of +3%, signaling a short-term recovery. However, the past week has been marked by a -11% decline, highlighting the underlying volatility and uncertainty in the market. These fluctuations are common in the cryptocurrency space, making it challenging to provide a definitive Ethereum price prediction.\n\nEthereum Price Prediction: What to Expect Next?\n\nWhen looking at the future of Ethereum, there are two primary scenarios to consider:\n\nRecovery to $3,500: If Ethereum manages to stabilize at $3,200 and continue its upward momentum, it could potentially breach the $3,500 mark. This would signal a strong recovery and could restore investor confidence, leading to further gains. In Euro terms, with a current exchange rate of 1 Euro = 1.08 USD, this would equate to approximately €3,240.\n\nDecline to $2,000: On the other hand, if the Ethereum price fails to maintain the $3,000 level, it could fall back to $2,800 and possibly drop to $2,600. Should market conditions worsen, a further decline to $2,200 or even $2,000 is possible. These levels would be significant support zones that could either halt the decline or lead to more bearish sentiment.\n\nGiven these scenarios, the Ethereum price prediction remains uncertain and highly dependent on market trends and investor sentiment.\n\nETH/USD 30-mins chart - TradingView\n\nEthereum Price: Recent Performance and Trends\n\nOver the past 24 hours, Ethereum has shown a +3% recovery, indicating some buying interest at lower levels. However, the overall 7-day performance reveals an 11% decline, reflecting broader market pressures and potential concerns among investors. This volatility underscores the need for careful analysis and monitoring of market conditions when considering the future direction of Ethereum.\n\nEthereum Price and News: Market Influences\n\nThe Ethereum price is influenced by a variety of factors, including broader market trends, investor sentiment, and news developments. Recent Ethereum news has highlighted the cryptocurrency's resilience despite market fluctuations. For example, Ethereum's recent rebound from $2,800 to $3,000 suggests that there is still strong support at lower levels, even as the market remains cautious. Additionally, news about regulatory changes, technological advancements, and market sentiment can significantly impact Ethereum's price and future outlook.\n\nEthereum Crash: Potential Risks and Concerns\n\nDespite the recent recovery, there are still concerns about a potential Ethereum crash. If the market continues to face downward pressure, there is a risk that Ethereum could experience further declines. The key support levels to watch are $2,800 and $2,600, which, if breached, could lead to a more significant drop to $2,200 or even $2,000. Investors should be aware of these risks and consider them when making decisions about their Ethereum holdings.\n\nETH/USD 2-hours chart - TradingView"
    }
]