[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNY1V6cjRaRGs5STNreHJKNjEzbkxMQmFucHlxeXdxSDladXM2eU9iQlRFY1lxTWxjYWJKRFB2MGZXaHo2MzFBTHlrcmVrY2ZCb1RydkRfdGwxcDNtZlFMQlpwSVFLRGVYcVNNZTBoUWYtSVhIbmpuZHJqZzhnU19WLThIdkV6cmxBZFJXeWdQSll3TjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum’s Cofounder Says SEC Is ‘Gaslighting’ Everyone About Crypto - WIRED",
        "content": "Joe Lubin is in a fight with the Securities and Exchange Commission. Not only is the financial regulator waging war against Ethereum, he claims, but making a grab for jurisdiction over the future of the Internet. So Lubin has decided to punch back.\n\nIn 2015, Lubin was part of the team that created Ethereum, the computer network home to the world’s second largest cryptocurrency, known as ETH. Later that year, Lubin founded Consensys, with the loose ambition to support the development and adoption of Ethereum and built software products on top of the network. In April, Consensys received an unwelcome missive—known as a Wells Notice—from the SEC, informing the company that it was about to be sued. The regulator’s grievance, Consensys was told, had to do with one of the software products in its stable: MetaMask, a crypto wallet that lets users store crypto coins and interact with Ethereum-based apps.\n\nConsensys claims that the SEC notice, which has not been made public, states that MetaMask has made the company into an unregistered securities broker. Specifically, the SEC takes issue with two MetaMask features: one that allows users to trade between different tokens and another that lets them lock up their tokens in exchange for a regular reward, in a process called staking.\n\nOn April 25, Consensys filed a lawsuit of its own against the SEC. The complaint accuses the regulator of an “unlawful seizure of authority over ETH,” which “bears none of the attributes of a security”—the specific type of financial instrument over which the SEC has dominion. The SEC having its way “would spell disaster for the Ethereum network,” the complaint alleges.\n\nIn its Wells Notice, the SEC stopped short of calling ETH itself a security, says Consensys, focusing instead on the MetaMask features. But according to Consensys, the agency has long been quietly conducting an investigation into Ethereum, in the view that ETH should be reclassified as such.\n\nThat’s not fair, claims Consensys, because an SEC director has previously described ETH as a commodity, not a security, and the Commodity Futures Trading Commission, a separate US financial regulator, has made the same contention. “Consensys built its business against the backdrop of this regulatory consensus,” the lawsuit says.\n\nIn bringing the lawsuit, Consensys hopes to drag itself and Ethereum out from underneath the SEC, by clarifying the limits of its jurisdiction, and embolden the rest of the crypto industry to retaliate against what it describes as “aggressive and unlawful SEC overreach.” An SEC spokesperson declined to comment on the specific allegations made by Consensys, saying only that “noncompliance with the securities laws deprives investors of critical protections, including rulebooks that prevent fraud and manipulation, proper disclosures, segregation of customer assets, safeguards against conflicts of interest, oversight by a self-regulatory organization, and routine inspection by the SEC. It’s investors who get hurt and the American financial markets that may suffer.”\n\nThe following Q&A has been edited for brevity and clarity."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE41SkN5bVFjZjRCRzBNdG9TQkltei1xOVdWX0RvakpBYy1BcnUtWGtHUmJ2OVBacElNSUt3Y2x1QkRpZGdZa0Nzbkltdll6amVyT3RlMmdNaDI5ZGNqcHAyTkI4M1RFMFB5Nkp5T0lNTzdOSnNwbzhEdkNkTUQ5N0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "If You'd Invested $300 in Ethereum 5 Years Ago, Here's How Much You'd Have Today - Yahoo Finance",
        "content": "Ethereum (CRYPTO: ETH) prices have historically proven very volatile. It's not uncommon to see its value double or triple in a matter of months. In other months, however, its price has been cut in half or worse.\n\nBut what about the long term? If you had invested $300 into Ethereum five years ago, and held on, you'd likely be very pleased with the outcome.\n\nHow profitable has Ethereum been over the last five years?\n\nIf you had put $300 into Ethereum five years ago, you'd have roughly $5,600 today. That's a 1,770% return, even higher than Bitcoin's 1,000% performance over the same period. The S&P 500, for comparison, increased in value by just 87%.\n\nBut before you jump in and buy Ethereum, there are a few important caveats to note.\n\nFirst, Ethereum was still a young, relatively unknown technology five years ago. The crypto industry has come a long way since then, with far greater utility, adoption, and recognition. It's possible that Ethereum's biggest days of growth are behind it.\n\nSecond, these eye-popping returns were only accrued by investors with so-called diamond hands -- that's crypto terminology for holding tight through extreme ups and downs. If you purchased Ethereum five years ago only to sell it at the start of 2023, for example, you'd only be sitting on a 640% gain. That's still impressive, but far less than what patient investors have earned. Conversely, if you purchased Ethereum at the start of 2022 only to sell one year later, you would have lost two-thirds of your original investment!\n\nEthereum has proven a terrific long term investment, but its short term movements are difficult to predict.\n\nShould you invest $1,000 in Ethereum right now?\n\nBefore you buy stock in Ethereum, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Ethereum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $544,015!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of April 30, 2024\n\nRyan Vanzo has positions in Bitcoin and Ethereum. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nIf You'd Invested $300 in Ethereum 5 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaW1EV0ktLTA0UWNHMzZNUVJGb0s3dnNieW9IWWdNVEQyYi0zYzNzVFk5dHJ4cDZEWGh5X2V1bXdmUlA2MjhwMDg0eWdNRHBHcEZGRF9JeE1xVjJVMVp5VTBmdTdtb1g3ZHltR3RCVlpqR3dWMnZIcE13bFdXV3ppQ3lwQmVYb01pZUg1OU1BdWNqanpyR0lidjJ6Z1ZhYmw5bHNWakkzdTQ3eVdRQllXUGFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Entrepreneurs, Journalists, Researchers: The Ethereum Influencers to Follow to Stay Informed! - hackernoon.com",
        "content": "When Ethereum was conceived in 2013, little did we know that it would become the center of attraction and rally competitors in the crypto space.\n\n\n\n\n\nNevertheless, what about gas fees? Scalability? Network? Competition? Nothing can stop an ETH Maxi from vehemently pushing the narrative of the first-ever smart contract blockchain layer.\n\n\n\n\n\nIn every crypto ecosystem, some undeterred believers passionately promote their native token or cryptocurrency to the masses. Nonetheless, the limitation of the currency or the presence of a better alternative; these influencers are the mainstay.\n\n\n\n\n\nFrom building DeFi to establishing the fortress for Web3, to its transition to Proof of Stake, Ethereum has proven to be a blockchain flexible enough to adapt and perhaps the only true competitor to Bitcoin. Every other chain either measures itself against Ethereum, builds on top of it (as Layer 2 solutions), or claims to be the “Ethereum killer”—a classic anecdote for the crypto saga.\n\n\n\n\n\nHowever, ETH thought leaders will always remain steadfast. So if you’re here looking for the most influential Ethereum influencers to follow and keep an eye on their updates, you’ve come to the right article.\n\nWho Are Crypto Influencers?\n\nWhether you call them Maxis, Thought Leaders, or KOLs (Key Opinion Leaders), this group of crypto personalities advocates for everything related to cryptocurrency and the blockchain industry.\n\n\n\n\n\nTheir responsibilities go beyond merely owning a social media account with a substantial number of followers. They actively create bullish posts about digital assets (including tokens and NFTs) within the ecosystem. Additionally, they provide technical analyses of these assets, share updates about cryptocurrencies, and stay informed about other developments in the complex crypto landscape.\n\n\n\n\n\nThese thought leaders possess a wealth of knowledge and experience, allowing them to break down intricate structures into easily digestible educational content for their followers. Their guidance helps navigate the labyrinthine world of blockchain.\n\nWhy Should You Follow Influencers on Ethereum Blockchain?\n\nIf you were left to wander the vast expanse of Ethereum on your own, you’d feel like a lost puppy trying to find your way out of a maze. Keeping track of influencers provides a glimmer of hope.\n\n\n\n\n\nEthereum offers numerous opportunities in DeFi, NFTs, and Web3. It is the foundation for other blockchains that leverage its layer to create more sustainable networks, enhancing the overall user experience. While most ETH enthusiasts are open to sharing knowledge, there are a few narcissistic territorial maxis who might be an exception.\n\nBest Ethereum Influencers to Follow on Social Media in 2024\n\nInfluencers wield their influence primarily on social media platforms. Several platforms exist where these influencers keep their followers and members of the crypto community informed about the cryptocurrency market. These platforms include:\n\n\n\n\n\nTwitter (X)\n\nBitcointalk\n\nReddit\n\nTelegram\n\nDiscord\n\nPodcasts\n\nTikTok\n\nYouTube channels\n\n\n\n\n\nAmong these options, Twitter (X) stands out as the most reliable and easily accessible channel. However, other platforms may require invitations or access, which can be challenging for crypto enthusiasts to obtain. Some platforms also have complex user interfaces that can be difficult to navigate.\n\n\n\n\n\nNow, how do you identify the Twitter accounts of these influencers? Simply go to Twitter, search for “eth,” and scroll through the results.\n\n\n\n\n\nHowever, be cautious—you’ll encounter a maze of Twitter users masquerading as influencers, promoting scam tokens, or building their social media presence for influencer marketing purposes.\n\n\n\n\n\nTo simplify your journey through the bustling Ethereum world, I’ve curated an A-list of the top 10 Ethereum influencers to follow. These thought leaders range from founders and team members to market analysts, opinion leaders, and crypto news headliners. Following them will help you stay informed and engaged.\n\n\n\n\n\nVitalik Buterin (X: @VitalikButerin )\n\nWe’d have to issue an official apology if we didn’t start by acknowledging the brain behind the Ethereum blockchain.\n\nVitalik Buterin is the initiator and co-founder of Ethereum. This Russian-born Canadian programmer began his crypto journey as a writer for Bitcoin Weekly in 2011, earning 5 BTC (approximately $3) per article. Shortly thereafter, he became a co-founder and writer for the groundbreaking cryptocurrency publication, Bitcoin Magazine.\n\nIn 2013, Buterin conceptualized Ethereum—a “decentralized mining network and software development platform rolled into one.” He published a whitepaper outlining this vision. As the idea gained recognition, he collaborated with other co-founders to bring it to life in 2015.\n\nSince then, Vitalik Buterin has been the primary source of news related to Ethereum—covering its developments, updates, events, and the broader ecosystem. If you want to stay informed about Ethereum, following Buterin is like having a substantial slice of the crypto pie.\n\nButerin’s influence extends beyond the Ethereum ecosystem; he’s a force to be reckoned with in the entire crypto industry. He consistently ranks among the top crypto influencers. Keeping up with his updates and interests will undoubtedly keep you well-informed in this dynamic industry.\n\n\n\nHayden Adams (X: @haydenzadams )\n\nUniswap, the largest decentralized cryptocurrency exchange based on Ethereum, is widely regarded as the godfather of modern DEXes. This exchange played a significant role in ushering in the DeFi era and subsequently fueled the 2020 bull run. And who is its founder? Hayden Adams.\n\nAs a Stony Brook University engineering graduate and former Siemens analyst, Adams pursued Vitalik Buterin’s vision of decentralized applications by creating a DEX (decentralized exchange) powered by code-controlled automated market makers. Uniswap has achieved remarkable success, surpassing $2 trillion in trading volume since its inception in 2017. It’s no surprise that regulatory bodies like the SEC are closely scrutinizing its operations for explanations and tax compliance.\n\nAdams swiftly ascended to an influential position within the Ethereum community due to Uniswap’s achievements. He collaborates closely with Buterin and their team.\n\n\n\nJoseph Lubin (X: @ethereumJoseph )\n\nJoseph Lubin is as synonymous with Ethereum as one can be. He co-founded Ethereum, serves as the COO of Swiss-based EthSuisse, and is the founder of ConsenSys—a private blockchain software technology company. ConsenSys actively collaborates with crypto startups and supports the development of decentralized applications (DApps). Their developer quickstart and tutorial series offer excellent learning resources for training and onboarding developers.\n\nAs a Princeton graduate, Lubin has also actively participated in cross-industry groups with a mission to address governance challenges within the crypto world—a commendable endeavor.\n\nIf you’re looking to stay informed about the latest happenings in the crypto and Ethereum space, visiting his page is a wise choice.\n\nChris Dixon (X: @cdixon )\n\nChris Dixon, an American internet entrepreneur, investor, and cryptocurrency advocate, wears many hats in the tech and crypto world. His diverse roles and accomplishments make him a prominent figure:\n\nBackground: Dixon previously worked at eBay, gaining valuable experience in the e-commerce industry.\n\nHis journey extended beyond eBay as he delved into various investments. Midas List Ranking: In 2022, Dixon secured the top spot on the prestigious Midas List , which recognizes the most successful venture capitalists.\n\n, which recognizes the most successful venture capitalists. His knack for identifying promising startups and disruptive technologies contributed to this achievement. Hunch and Andreessen Horowitz: Dixon co-founded Hunch , a platform that provided personalized recommendations based on user preferences.\n\n, a platform that provided personalized recommendations based on user preferences. As a general partner at Andreessen Horowitz, a renowned venture capital firm, he continues to shape the tech landscape. Authorship: Dixon penned the New York Times Bestseller, “Read Write Own”, which likely delves into the intersection of technology, ownership, and innovation. Crypto Enthusiast: His passion extends to the crypto space, where he closely follows developments.\n\nDixon has a soft spot for the two biggest cryptocurrencies: Bitcoin and Ethereum. Stay Updated: If you’re interested in staying informed about the crypto world, following Chris Dixon is a smart move.This American internet entrepreneur, investor, and cryptocurrency advocate has so many titles he could go by.\n\nJoseph Delong (X: @jose phdelong )\n\nLet’s delve into the world of Joseph Delong, a prominent figure in the Ethereum ecosystem and beyond:\n\nEthereum and Sushiswap: Delong has an impressive track record. He was a former team member at Ethereum —a project that needs no introduction in the crypto space.\n\n—a project that needs no introduction in the crypto space. Additionally, he served as the Chief Technology Officer (CTO) at Sushiswap. Sushiswap, a decentralized finance (DeFi) protocol, gained prominence as a fork of Uniswap v2. Astaria: Currently , Joseph Delong holds the position of CTO at Astaria . He assumed this role in January 2022 .\n\n, Joseph Delong holds the position of . He assumed this role in . Astaria is an intriguing project—an NFT lending platform that aims to revolutionize the NFT space by providing lending services. ConsenSys Connection: Before his involvement with Astaria and Sushiswap, Delong worked as a Senior Software Engineer at ConsenSys from October 2018 to October 2020 .\n\nfrom . His contributions extend beyond ConsenSys; he also served as the Chief Architect at 9th Gear Technologies for a brief period from May 2018 to November 2018. Stay Updated: If you want to keep abreast of developments in the Ethereum ecosystem and other cryptocurrencies, following Joseph Delong is a wise choice. Feel free to explore the exciting world of crypto through his updates!\n\nPéter Szilágyi (X: @peter_szilagyi ) Peter Szilágyi is a core software developer and team lead at Ethereum. That alone should be reason enough to follow him. Let’s enhance the information about him: Peter Szilágyi: As a core software developer and team lead at Ethereum, Szilágyi plays a crucial role in shaping the Ethereum ecosystem.\n\nHis contributions extend beyond coding; he actively influences the technical direction and development of Ethereum. Background: Szilágyi studied at Babes-Bolyai University in Cluj-Napoca , Romania. His academic foundation likely contributes to his expertise.\n\nin , Romania. His academic foundation likely contributes to his expertise. During his intern years, he gained practical experience working with other IT companies, further honing his skills. Stay Informed: If you’re interested in staying up-to-date with the technical intricacies of Ethereum and digital currencies within the ecosystem, following Szilágyi is a wise choice. Remember, the crypto world evolves rapidly, and Szilágyi’s insights can keep you informed\n\nTim Beiko (X: @TimBeiko )\n\nTim Beiko, another core team member of Ethereum, leads the core protocol meetings and provides support for Ethereum. These meetings are public and available on GitHub.\n\nAdditionally, he writes about upgrades to the Ethereum protocol. Beiko is one of the major spokespersons for Ethereum, frequently participating in interviews, press events, podcasts, and conferences to share the Ethereum roadmap with the broader community. If you follow Beiko, you’re definitely on the right track\n\nRyan Sean Adams (X: @RyanSAdams )\n\nMedia is essential, and Ryan Sean Adams is at the forefront of crypto media, advocating for transparency and freedom from mainstream media.\n\nAdditionally, Adams is an open finance maximalist and startup financier, actively promoting the message of financial sovereignty to the masses. He co-founded Mythos Capital, a crypto fund and staking provider for stakeholders, as well as Bankless with his co-founder David Hoffman.\n\nIn his efforts to drive a decentralized revolution, Adams aims to onboard billions of people into the world of cryptocurrency. And what better way to achieve this than through social media?\n\nJustin Drake (X: @drakefjustin )\n\nMeet Justin Drake, an Ethereum researcher. He graduated from Cambridge with a degree in Mathematics and later became a Bitcoin entrepreneur. As the founder of Duo Money, a global payment app that harnesses the power of cryptocurrency for value transfers, Drake has been at the forefront of financial innovation.\n\nIn addition to his entrepreneurial ventures, he is a Fellow at Anthemis Group—an asset management platform that invests in and supports pre-seed to growth-stage startups. These startups integrate finance into their products, services, and operations.\n\nCurrently, Justin Drake actively researches technologies for the Ethereum Foundation. By following him and reading his tweets, you can stay up-to-date with the latest news and insights on what Ethereum is building\n\nNick Johnson (X: @nicksdjohnson )\n\nNick Johnson founded the Ethereum Name Service (ENS), a decentralized naming service that allows users to register and manage human-readable names for Ethereum addresses. Many Ethereum influencers use ‘.eth’ in their profiles, and ENS is the origin of this practice.\n\nNick Johnson has a wealth of experience in software development. He started as a graduate of Computer Science from the University of Canterbury. His journey into the crypto world began when he transitioned from being a Software Engineer at Google to becoming a Software Engineer at Ethereum. Eventually, he left Ethereum to focus on building and developing ENS.\n\nIf you’re interested in DAOs and public goods within the Ethereum ecosystem, I recommend keeping an eye on his timeline.\n\n\n\n\n\nOther Crypto Influencers to Check Out\n\nWhile we often consider Ethereum maximalists as the primary sources for ETH updates, the truth is that several other influential figures identify as crypto evangelists.\n\n\n\n\n\nThese individuals ensure that they share everything happening in the crypto space, whether it pertains to BTC, ETH, LTC, or any other significant blockchain, making waves in the financial world.\n\n\n\nBen Armstrong (X: @BenArmstrongsX )\n\nI’m sure we all know that one guy who’s incredibly enthusiastic, and his energy is contagious. In the blockchain space, that person is Armstrong—he’s fully immersed and unwavering.\n\nPopularly known as BitBoy, Ben isn’t just an overzealous crypto fanboy; he has significant experience in the field. His journey has taken him from humble beginnings to success, and even setbacks. But now, he’s making a strong comeback.\n\nBitBoy hosts the BitBoy Crypto Show, where he explores various cryptocurrencies. If you want to stay updated, following him is a great idea!……\n\n\n\nAnthony Pompliano: (X: @APompliano ) Meet Anthony Pompliano, often known as ‘Pomp,’ the crypto world’s equivalent of a household name. His show, ‘The Pomp Podcast,’ boasts thousands of listeners worldwide.\n\nPompliano is an American entrepreneur and investor with a keen interest in finance, technology, and economics. From the comfort of his home, he manages a family office called Pomp Investments. This firm engages in various private investments and stakes across different businesses.\n\nAnthony Pompliano provides valuable insights into crypto market prospects. As a staunch advocate of cryptocurrencies, his page and podcast delve into these topics, along with his personal opinions on finance and technology. Following him is a smart move, but always remember to ‘DYOR’ (Do Your Own Research)!\n\n\n\nAndreas Antonopoulos ( X: @aantonop ) Antonopoulos’ Twitter(X) profile succinctly states, ‘Bitcoin & Open Blockchains.’ This concise description provides clarity.\n\nAndreas M. Antonopoulos, a British-Greek tech entrepreneur and author, has passionately advocated for Bitcoin and cryptocurrencies since 2012.\n\nHe previously served as the Chief Security Officer (CSO) of Blockchain.com, a cryptocurrency financial services company. Additionally, Antonopoulos is the author of six books, including ‘Mastering Ethereum: Building Smart Contracts and dApps.’\n\nHis unwavering commitment to decentralized financial principles is evident through his participation in various summits, and conferences, his YouTube channel, and his Twitter (X) page. Following him will keep you informed about the latest developments in the crypto world.\n\nPros and Cons of Following Ethereum Influencers\n\nIt is not recommended to take every word from an influencer’s tweets on social media or a podcast and digest them hook, line, and sinker. Just like everything else that exists, there are perks and drawbacks.\n\n\n\n\n\nTo better understand their influential materials, you must learn to differentiate what works from what doesn’t.\n\nPros\n\nReliable Sources: These influencers are often the most reliable references to turn to when you encounter random news about Ethereum. They commit themselves to being the avenue through which others stay updated on recent events in the space. Spreading false information would only tarnish their reputation.\n\n\n\n\n\nStay Up to Date: When Bitcoin ETFs were under consideration by the SEC, those following BTC maximalists were continuously kept informed about the proceedings. Ethereum ETFs have also been hinted to arrive soon. Can you guess where you’ll find this information? Exactly—ETH maximalists.\n\n\n\n\n\nReal-Time Information: Influencers provide real-time updates on various aspects: market volatility, trends, legal challenges, crypto-government conflicts, recent launches, upcoming airdrops, and more. No one reports it better than these maximalists.\n\n\n\nDeep Insights and Content on Cryptocurrency: First, Key Opinion Leaders (KOLs) are the go-to sources for news, updates, and events. But beyond that, they analyze these developments and share market sentiments through various mediums such as social media posts, YouTube videos, AMAs (Ask Me Anything), and blogs. KOLs engage in fact-based speculations, discussions, and provide expert opinions.\n\nCons\n\nInformation Overload: Someone needs to tell influencers to cut us some slack. There are too many influencers, each sharing their individual opinions. It’s overwhelming to take in and comprehend all the updates, analyses, and news that come in droves. We have too little time to make sense of it all.\n\n\n\nMisinformation: Having influence doesn’t guarantee that their content is always accurate, especially for those who are not part of the Ethereum team. To avoid this, follow reputable sources like Vitalik and steer clear of influential farmers.\n\n\n\nMarket Influence and Bias: Predictions and analyses by Key Opinion Leaders (KOLs) can sometimes be wrong. KOLs are not supreme beings with the ability to control the market through their thoughts. Instead, they use sentiments to sway their audience. Occasionally, they spread hate or bias toward other opinions or chains, subtly influencing their followers.\n\n\n\n**False Hope:**Being bullish is fine, but delivering doses of ‘hopium’ to susceptible followers who hang on your every word goes against crypto principles. However, for many ETH maximalists, the hype should remain alive.\n\n\n\nEnd Words\n\nEthereum is the second-largest blockchain after Bitcoin and the most actively engaged blockchain in the history of distributed ledgers. This prominence places the pioneer smart contract network at the center of numerous discussions within the crypto space.\n\n\n\n\n\nAddressing criticisms, making comparisons, and staying updated all require experts who can readily highlight and clarify complex topics. Their insights help followers make informed decisions and take enlightened steps.\n\n\n\n\n\nHowever, it’s crucial to recognize that the term ‘influencer’ doesn’t imply blindly following their investment advice. While influencers play a valuable role, you should never let them entirely dictate your crypto investment decisions. There will always be digital currencies, NFTs to explore, bridges to test, and DeFi projects to consider. But don’t rush into decisions solely because an influencer recommends it. Instead, make your own choices, build a solid rationale, and remember the crypto mantra: DYOR (Do Your Own Research).\n\nFAQs\n\nWho are the best ETH influencers? Vitalik Buterin and every other dedicated Ethereum supporter on social media have everyone’s interests at heart. They are undoubtedly crypto influencers too.\n\n\n\nWill $ETH supersede $BTC? Crypto remains uncertain, leaving room for possibilities. However, $BTC stands strong as the pioneer of crypto, making it challenging for other cryptocurrencies to surpass it.\n\nFrom every perspective, Ethereum’s goal is not to replace Bitcoin but to serve as the decentralized open-source smart contract layer for applications to build upon.\n\nThere’s no direct competition between $BTC and $ETH—only mutual respect (except for the maximalists who might think otherwise).\n\n\n\nWhat impact will the launch of more “Ethereum Killers” have on Ethereum? From my viewpoint, it won’t have a significant impact. Ethereum will continue to thrive. The crypto space operates as an open-source collaborative environment.\n\nEthereum will persistently evolve, while other blockchains may create forks. In the end, survival will favor those who adapt.\n\n\n\nWill the growth of other cryptocurrencies affect the future of the Ethereum Blockchain? Ethereum proudly remains the mother of smart contracts. Most ecosystems either build on it, adopt its architecture, or strive to provide better scalability. Therefore, the growth of these projects cannot undermine ETH, as it plays a crucial role in the crypto industry.\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPeXhwem5oQVJ4bHdRTHVIbU1oNnpCbUdGRndkbVZEQXFKZE8tQi1JYTlhYlBranVFTV91MktTZG45dWNmV2V5TjdCRW15VUFYNE5ETllMTk9nX0tvU3VTS19VQThqVWhTWG52Zjk0T1dNUzJtdmY0RldNMTZRNEQxUXdsbkJzQjZCa2VOdFEwMkd6VHFDbTFoUXFjQjM0dVJmaWF6UVZybVDSAa4BQVVfeXFMUFZhS2ZtckM5Z3FDOUxDTGI0OGRkckJ2NFVicU5rU2dqc3Bad3RVVzROOHdfRkpZckJfTnVVSmtmbThvejhkY1F2ckRra3ZzSmtzZmI2TlVDUkx6ZlJFT19xYU14TkpkRVBYY1o0X3ItREFnRnozOFBaT3VZVVRwTDV1YUZlY2RyUUQ2U0pqNUNIcXhpaW9ZOUFvTDQ4dlo0R3hhb010anpObkFDMmtR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum Developers Target Ease of Crypto Wallets With 'EIP-3074' - CoinDesk",
        "content": "The key difference between EIP-3074 and ERC-4337 is that “the former focuses on getting all the benefits of execution abstraction, and the latter focuses on getting all the benefits of account abstraction on all EVM chains but in a non-native way that is less efficient,” Ethereum Foundation developer Yoav Weiss writes . “Both are steps to get some of the benefits of full native account abstraction.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOOFZkYnNKRUdmakRQNF8yRmM1c3hnQi11ZENaMTdoRmliR0hqdGl5TmFJVndROEZsc0xtbVd2RFJ1TXdsbUNOVElXZFFfT0JJNTBiWTFQU0xpemxNajktcTczOTBLRmVJazN3NXo5X1VMUVFNbnVVTjBBWUxvS09nNnNmSkRNS2pGUXJtRnYzWTZTQmFGRXRWUTRGYjVxMlVTbktnTnU0OFVwR1lGc1BoZHA3ekxIUWtQNDdiUlR4OFVidVNFY1pfYU9VLXNhXzZtTzhVdUhCcm95N1hDSHJKSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "How much could Ethereum be worth in the near future? One cryptocurrency expert makes a bullish prediction. - KTVZ",
        "content": "\n\nleksiv // Shutterstock\n\nHow much could Ethereum be worth in the near future? One cryptocurrency expert makes a bullish prediction.\n\nSilver ethereum coin with conceptual finance chart in background.\n\nWhile Bitcoin has made headlines in 2024 with the approval of spot exchange-traded funds (ETFs) and the upcoming halving, Benzinga looks into how Ethereum (ETH) is potentially positioned to make waves in the coming months and years, according to Ark Invest CEO Cathie Wood.\n\nArk Invest held its Big Ideas event, an annual opportunity to review high-level market trends and potentially disruptive technologies. At one of these events, Wood asserted that Ethereum could reach a market capitalization of $20 trillion by 2032.\n\nThe current market cap of ETH is around $400 billion and has approached $500 billion in 2024. The market cap of the S&P 500 is around $40 trillion to $45 trillion. If ETH were to amass a market capitalization of $20 trillion, the price per token would be around $166,000.\n\nThe Ark Invest CEO believes the mainstream adoption of ETH as a financial tool will be the main catalyst for this price prediction. Ethereum is a way for people to access decentralized finance applications. The applications allow anyone to interact with different financial actions, such as trading, lending, borrowing and staking, without going through a centralized intermediary. If these applications are adopted on a large scale, the demand for ETH — and its price — could increase.\n\nTalks of spot Ethereum ETFs are ongoing. Releasing the ETFs could have an impact similar to that of spot Bitcoin ETFs, which brought in huge amounts of inflows and propelled the price of Bitcoin higher.\n\nBut potential ETF sponsors face several regulatory hurdles, particularly related to the Security and Exchange Commission’s (SEC) classification of ETH as a security rather than a commodity as BTC was classified. Despite this, some are still confident that ETH ETFs could come as soon as this year, which could positively affect the price of Ethereum.\n\nWood is known for making extraordinary predictions about tokens well into the future. For example, at Bitcoin Investor Day in March, she predicted that Bitcoin would reach a high of $3.8 million by 2030. While these predictions may have some merit, they are largely speculative and may be influenced by Ark’s entanglement with the assets. The company was one of several that released a spot Bitcoin ETF (ARKB) and also offers an Ethereum futures ETF (ARKZ). So, Wood could be giving these predictions as a way to increase engagement with her firm’s products.\n\nIf ETH reaches $166,000 per token by 2030, it would create huge gains. Specifically, an investment of $1,000 would be worth $54,330. An investment of $10,000 would be worth $543,300. These huge profits may not come to fruition, but according to Wood, they are a possibility.\n\nThis story was produced by Benzinga and reviewed and distributed by Stacker Media."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5pbEhsUEpkWXgxRWNibUx5OXVzWVh4R0ZZaGU1bHhRS3NUWkNrLWFodTI2WGJoYWRTSHpjcDdLQlJEMWo2dWxmSHlVeDJyWWoxUUhKSldkLVBkT1NRU3RwekE4ZFBvQm9SdExSY09Mc0pJQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Can Tron Overtake Ethereum? - Bitcoin Market Journal",
        "content": "Key Takeaways:\n\nTron: Huge in Asian markets despite regulatory scrutiny, powered by Tether.\n\nEthereum: Favored in Western markets for its compliance and innovation, powered by USDC.\n\nEthereum has a higher market capitalization, while Tron sees greater daily user activity, suggesting different levels of market engagement.\n\nThe potential outcomes for Ethereum and Tron range from one dominating the market, both coexisting, or both being overtaken by a new blockchain.\n\nBefore the advent of radar and satellite navigation, sailors often relied on the flight of birds to determine the presence of nearby land masses. Similarly, in the blockchain markets, the “flight patterns” of stablecoins can often tell you quite a lot about the fortunes of a blockchain project.\n\nAs of this writing, Tron is leading Ethereum in USDT supply, with $57 billion on Tron versus $50 billion on Ethereum. What might this mean for blockchain investors? Can Tron overtake its older, more popular rival as the premier Layer-1 smart contract blockchain?\n\nIn short, which token is the better buy in the long term – ETH or TRX?\n\nIn this guide, we analyze the fundamentals, history, and regional dynamics of both Tron and Ethereum to see if we can find a winner.\n\nThe Fundamentals\n\nBehind bitcoin, Ethereum is the second largest crypto in the world, with a market cap of $386 billion. At just $10.6 billion, Tron is a distant 13th on the table overall (and 9th if you only look at L1 blockchains). Bitcoin towers above them all, with a market cap of $1.24 trillion.\n\nToken Price and Supply\n\nAt the time of writing, ETH was worth $3,169, an increase of 178% year over year and 1557% from its value in Q4 2020. Naturally, this price movement has made ETH a popular option among investors for long-term holding.\n\nTRX presents a study in contrast in many ways. Since its launch in 2017, the token has never ventured above a peak of $0.23 in price. At the start of Q2 2024, 1 TRX is worth $0.120, a 6000% increase since 2017 and 173% year-on-year.\n\nBoth ETH and TRX do not have any limits on the number of tokens that can be issued over time. In both blockchains, a set amount of tokens are regularly burnt off to regulate the available supply and maintain an upward price pressure.\n\nDaily Active Users\n\nOn Daily Active Users, our favorite metric, Tron is comfortably ahead of its rivals. The network has around 1.9 million daily users. After crossing the one million milestone in 2022, the numbers have remained relatively stable, with noticeable spikes in 2023 and early 2024.\n\nOn Ethereum, the number of daily active users is only around 465,000. The graph looks relatively flat over the years, barring a few minor spikes here and there. Although there is a slow upward trend, it is pretty clear that holders of ETH typically use the network less often than TRX owners.\n\nNetwork Fees\n\nHigh gas fees have been a perennial problem for the Ethereum network. This has spawned the development of Layer-2 networks (L2s) and sidechains prioritizing lower transaction costs. L2s like Arbitrum and Optimism and sidechains like Polygon offer lower gas fees than the Ethereum mainnet.\n\nEven in 2024, subject to network congestion and demand, gas fees on ETH mainnet can range from less than a dollar to $70 or more. In contrast, transactions on the Tron network usually cost between $1 - $3, subject to network activity.\n\nFurther, Tron also offers free transactions. Users willing to stake TRX on the network can enjoy transactions without gas fees. The limits can vary depending on the quantity of TRX staked.\n\nIn 2024, Ethereum's annualized fees were around $2.75 billion, with a monthly fee of $226 million. Meanwhile, Tron reported annualized costs of $1.52 billion and monthly fees of $125 million.\n\nReputation and Regional Dynamics\n\nAny discussion of the Tron network would be futile without a look at its controversial founder, Justin Sun. A fugitive from the Chinese government, Sun has been accused of everything from insider trading to market making, tax evasion, various forms of financial fraud, money laundering, and more.\n\nEven sections of the Tron white paper were allegedly plagiarized from white papers written by Protocol Labs, another blockchain organization. Sun, who owns the Tron Foundation, was charged by the SEC in 2023 for fraud and violations of US securities laws related to the sale of TRX tokens.\n\nUndoubtedly, investor perception of Tron has been heavily influenced by the negative press generated by Justin Sun over the years. However, despite its early wobbles, Tron has gained traction in key markets outside the US and the EU.\n\nTwo key developments were responsible for this:\n\nThe addition of USDT to the Tron blockchain as a TRC20 token\n\nPartnership with Binance to support the Tron network on the popular exchange\n\nTron enjoyed the early mover advantage in providing an easily accessible electronic payment system based around a stablecoin, with very low fees and instant transactions. This proved highly attractive in regions that suffered from the following situations:\n\nLack of modern banking systems and high cross-border transaction fees (Asia, Africa)\n\nHigh levels of inflation that rendered the national currency unusable (Latin America)\n\nWestern sanctions blocking international bank payments (Russia, Iran)\n\nIn these regions and China, the users have acute real-world payment needs that Tron effectively meets. Most do not care about Justin Sun's reputation; many users may not even know his existence.\n\nUS regulators have repeatedly targeted USDT and Tron for non-compliance with financial regulations. However, they are both entrenched in the global market due to the early mover advantage—rival options like USDC and Arbitrum arrived much later.\n\nHow Ethereum (and USDC) Compares\n\nRegarding reputation, Ethereum’s equivalent to Justin Sun – co-founder Vitalik Buterin – has had no major scandals or controversies associated with him. He is generally recognized as an innovator and pioneer of blockchain technologies.\n\nEthereum also has a relatively clean reputation, which has aided its adoption as a platform for crypto innovation and investment in Western markets. In tandem, Circle’s USDC stablecoin has emerged as a popular alternative to USDT due to its focus on compliance with US financial regulations.\n\nThe critical thing to note is that while ETH is incredibly popular in the West, it is not widely used for real-world solutions like payments. Crypto is primarily seen as a tool for investment and wealth generation through holding or trading.\n\nIn contrast, Tron and USDT have gained popularity in Asia, Latin America, Africa, and Russia as they offer viable alternatives where traditional banking and payment systems have failed.\n\nApplication Ecosystems\n\nA quick look at Dappradar.com reveals a clear mismatch between the two networks. Ethereum has well over 4,000 apps, with over a dozen showing thousands of unique active wallets (UAWs). Here is a quick look at the top 5 dapps on Ethereum:\n\nXterio: A gaming app with over 67k UAWs and transaction volumes of $716k in 24 hours\n\nUniswap V3: A popular trading and AMM protocol with 32k UAWs and $2.7b transactions\n\n1inch Network: A liquidity and DeFi aggregator with 9.4k UAWs and $225m transactions\n\nEigenLayer: A radical new restaking protocol with 8.8k UAWs and $392k transactions\n\nUniswap V2: The predecessor to V3, with 7.87k UAWs and $137m transactions\n\nFurther, Ethereum has over 236 core developers who made over 1.69k code commits in 30 days. According to DeveloperReport.com, the blockchain attracts the maximum number of active developers, with 2,392 as of December 2023.\n\nTron has more modest stats in comparison. Apart from 8 core developers, the blockchain reportedly has only 16 independent developers. The ecosystem is far from thriving, and developer activity seems dead mainly, although the platform has around 1380 apps and protocols.\n\nPayNet Staking: A high-risk staking app with 743 UAWs\n\nDegree Crypto Staking: Another decentralized staking app with over 500 UAWs\n\nTron NRG: A protocol that allows TRX stakers to rent their energy, with 171 UAWs\n\nBitget Swap: A trading wallet with 157 UAWs and $32.6k transactions in 24 hours\n\nJustLend DAO: A decentralized lending app with 119 UAWs and $277k transactions\n\nThese numbers show that Ethereum is way ahead of Tron in terms of ecosystem evolution and developer activity. The vast majority of Tron users are interested only in its USDT payments feature, which is not bad. It has a niche use case that has gained traction in specific parts of the globe.\n\nHowever, Ethereum is miles ahead when it comes to testing and developing new ways to use blockchain technology. If you are looking for innovative services and apps that could gain mainstream acceptance in the future, you are more likely to find those on Ethereum's ecosystem.\n\nScalability and Other Technical Aspects\n\nEthereum and Tron are highly scalable blockchains, unlike bitcoin, which relies on an energy-intensive proof-of-work consensus model. While Ethereum uses a basic proof-of-stake model, Tron relies on a delegated proof-of-stake consensus mechanism.\n\nEthereum, in particular, has a significant lead when working on scaling solutions. Dutzende of L2 chains and side chains are currently under development. Tron presently has one primary L2 under development linked to Bitcoin.\n\nTransaction Speeds\n\nDue to the delegated PoS, Tron can process transactions much faster than Ethereum, resulting in a claimed average speed of around 2000 transactions per second (TPS). The Ethereum 2.0 mainnet can only handle between 15 and 30 TPS.\n\nThis could change with the addition of newer features like sharding to Ethereum via future updates. Besides, the blockchain already offers faster transaction speeds through sidechains and L2s like Arbitrum (4000 TPS), Polygon (65,000 TPS) and Base (2000 TPS).\n\nProgramming Languages\n\nEthereum is more friendly towards developers as it supports a wide array of programming languages, including Python, Ruby, Rust, Dart, Delphi, Go, Java, and Javascript. In contrast, Tron has adopted a narrower approach, supporting only Python and Solidity.\n\nFuture Prospects: Coexistence or Competition?\n\nGiven the highly chaotic and relatively unregulated nature of cryptocurrency markets, making confident predictions about anything is difficult. On the future of the ongoing competition between Ethereum and Tron, we can see at least three ways in which it can play out:\n\nScenario 1: Winner Take All\n\nEthereum's more likely outcome here is a win. It has wider investor acceptance, and its main weakness is slow and expensive transactions. These issues can realistically be solved via future updates and L2s.\n\nA Tron win is less likely for a multitude of reasons. Apart from the charges against Justin Sun, Tron is also under investigation for using its platform to evade sanctions in Russia and for dangerous activities like terrorism financing in the Middle East.\n\nScenario 2: Coexistence\n\nBoth Ethereum and Tron gravitate towards opposing extremes in the crypto world. Ethereum thrives in highly regulated and developed markets as it can attract and sustain more institutional investors. The SEC approved ETH futures in 2023. Spot ETFs could follow suit, probably after another legal battle in the US courts.\n\nMeanwhile, Tron seemingly thrives more in grey, unregulated financial markets and regions where financial inclusion faces significant challenges. As regulators in the West exert greater pressure on the blockchain industry, Tron and USDT could focus more on markets in Asia, Latin America, and Russia.\n\nScenario 3: Another Blockchain Wins\n\nIn this scenario, either an existing or brand-new L1 could rise and disrupt the entire ecosystem, vanquishing Ethereum and Tron. We already have one such contender, Solana (SOL).\n\nSolana already has faster and cheaper transactions and scalability. It is also the fifth most valuable crypto at the time of writing, with a market cap of $61 billion. It is arguably the top L1 contender that has a reasonable chance to overtake Ethereum in the next decade.\n\nInvestor Takeaway\n\nBoth ETH and TRX present interesting opportunities for crypto investors.\n\nETH is the world’s second most popular crypto with exciting long-term holding prospects, decent staking APY, and significant institutional backing.\n\nTRX offers the chance to earn high APY through staking and the advantages of near-zero transaction fees. However, it is significantly more vulnerable to regulatory action.\n\nThese two cryptos have different evolutionary trajectories, audiences, and potential use cases.\n\nMuch depends on your risk appetite and jurisdiction. For US/EU investors who care about compliance and transparency, ETH and USDC are likely safer alternatives to TRX and USDT. But a savvy investor could always buy both.\n\nJoin us at Bitcoin Market Journal and get the best analysis of the leading projects each week."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOQl9IVzFBZy1wd0VUWXNsZFBOTml6UTczeHprU1hMWVV6aldPOEkyN0R0SDFNbF9nM2U5T21GMC04bnl3c3hET0gwVEdXYVVkYnhaOU1nOFN0XzVfTE5KUk5ubWdMekMxSnMyREY3UTZrdEVjeFV5aWNIcEl4MVYzWW9TbTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Battle for Ethereum ETFs turns messy in the US — what’s next? - crypto.news",
        "content": "Michael Saylor thinks they won’t launch at all, and even some fund issuers think it’s unlikely this year. Meanwhile, other countries are gaining a first-mover advantage.\n\nThe battle to launch exchange-traded funds based on Ethereum’s spot price in the U.S. is heating up — and so far, the journey looks similar to Bitcoin’s long and messy road to approval.\n\nOnce again, the U.S. Securities and Exchange Commission is dragging its heels on offering a definitive answer to the applications already made. A green light matters because it would allow investors to gain exposure to ETH without owning the underlying asset.\n\nGrayscale and Franklin Templeton were both due to receive a response from the SEC in April, but the regulator’s now pushed their deadlines back to June.\n\nFidelity and BlackRock have had similar applications kicked into the long grass as well. VanEck and ARK Invest are due to receive a response later this month, but hopes of approval have been dwindling fast.\n\nWhy? Because there are signs that the regulator believes that Ether is a security, and not a commodity like Bitcoin.\n\nYou might also like: What’s next for global finance?\n\nA growing dispute\n\nBack in June 2023, speaking in front of the House Financial Services Committee, SEC chair Gary Gensler had refused to say whether he believes ETH is a security.\n\nThe lack of a clear answer had spooked the crypto industry — especially considering this contradicted earlier guidance made by his predecessor Jay Clayton.\n\nAnd even earlier than that, around the time of The Merge in September 2022, Gensler had hinted that the staking process may fall under securities rules.\n\nEther’s status matters because it determines which organization holds regulatory oversight in the U.S. — and if it is a security, this could cause big problems for other altcoins.\n\nConsensus recently sued the SEC and leapt to Ethereum’s defense — arguing the commission’s “unlawful power grab threatens to undermine America’s position as a leader of the next generation of the internet.”\n\nThe Case for #Bitcoin on the Corporate Balance Sheet pic.twitter.com/LcZ4V2nqV0 — Michael Saylor⚡️ (@saylor) May 3, 2024\n\nSaylor’s prediction\n\nMicroStrategy’s executive chairman Michael Saylor, a vocal Bitcoin supporter who spearheaded efforts to add hundreds of thousands of BTC to the company’s balance sheet, doesn’t believe that ETFs based on ETH’s spot price will ever see the light of day. Speaking at the annual Bitcoin for Corporations event, he warned:\n\n“Some time this summer, it’ll be very clear to everyone that Ethereum is deemed a cryptoasset security, not a commodity. After that, you’re gonna see that Ethereum, BNB, Solana, Ripple, Cardano — everything down the stack — is just a cryptoasset security unregistered. None of them will ever be wrapped by a spot ETF, none of them will be accepted by Wall Street, none of them will be accepted by mainstream institutional investors as cryptoassets. [Bitcoin] is the one universal, consensus accepted, institutional-grade cryptoasset in the world. There won’t be another one.” Michael Saylor\n\nOf course, you could argue that Saylor was bound to say this — especially considering that he believes BTC is the only cryptocurrency that is technically and ethically sound. Speaking at the Blockchain Economy Istanbul Summit back in July 2022, he had warned that Ether’s continual upgrades “introduce new attack surfaces” that undermine security and reliability.\n\nWhat happens next?\n\nThe bigger challenge now appears to be that there’s a lack of dialog between the SEC and firms hoping to bring an Ether ETF to market. As Barron’s reported last month, applicants aren’t being given “the critical feedback needed to finalize their products.” By contrast, BTC ETF issuers had engaged in a “robust back-and-forth” before their funds started trading.\n\nJan van Eck, whose eponymous investment firm is awaiting a verdict from the SEC, candidly told CNBC in April that he believes the application will “probably be rejected” — while Jean-Marie Mognetti from CoinShares predicted that no approvals will happen in 2024.\n\nWhile the U.S. continues to be paralyzed by regulatory uncertainty, where a lack of clarity on Ether’s status is leaving crypto firms exasperated, other jurisdictions are gaining a first-mover advantage.\n\nAlthough trading volumes were rather tepid on the first day, it remains significant that Hong Kong has now launched an ETH ETF, amid speculation this could one day open the door to investors from mainland China.\n\nAs S&P Global recently noted, funds based on Ether’s spot price have already been approved in Canada, Switzerland, Sweden and Germany — with some offering additional yield by offering staking returns as well.\n\nWith ETFs in other territories now boasting billions of dollars in assets under management, the U.S. risks falling further and further behind."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPc2VETWdQb2V3alhHdnhGazB3cS1pQk16VS1ILTBTR1B3TXZfalc4MWRrakdCU3ZnZUVSVmtXazZjT0MwOHBodjVobktzSnhIblpjdnZpbl92Y09oVE5NcjM2ckt1TVFlcjJqcmxPblVJOXl0WXg4ZGxKb25iaEZUMW11N2thT0ctWGdxTjhVa2g2YUhndWpBTVNLSWttakZJZXh5ag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum bounce back after week of brutal losses — here’s why - DLNews",
        "content": "Crypto markets flipped bullish after last week’s carnage.\n\nFed Chair Powell said rate hike is “unlikely.”\n\nHigh inflation and unemployment worries have passed, says analyst.\n\nCrypto markets have recouped losses after last week’s crash, which saw Bitcoin fall as low as $56,000.\n\nThe renewed bullishness comes amid slowing job growth — a possible sign of easing inflation — and hopes of rate cuts later this year.\n\nToday, the largest cryptocurrency is back trading at just above $65,000. The second-largest Ethereum is up 11% since its low last Wednesday.\n\nOverall, the wider cryptocurrency market added some $200 billion, according to CoinGecko, since Federal Reserve Chair Jerome Powell spoke on May 1.\n\nHe signalled that a rate hike — when the central bank raises interest rates and increases borrowing costs for banks and businesses — would be “unlikely.”\n\nStill, “the coast is far from clear” for the Federal Reserve to begin lowering interest rates soon, according to Noelle Acheson, author of the “Crypto is Macro Now” newsletter.\n\nInterest rates in the United States have risen to record highs as the Federal Reserve combats rampant inflation stoked by the COVID-19 pandemic. High interest rates also increase the amount people earn on their bank holdings, another incentive to keep cash rather than spend it.\n\nRate hikes are thus less beneficial for stocks and riskier investments like cryptocurrencies, as seen in last week’s dramatic drop in Bitcoin and Ethereum.\n\nJoin the community to get our latest stories and updates\n\nIn the first quarter, economic growth in the US slowed to its lowest level in nearly two years. The deceleration was partly attributed to a moderation in consumer spending and a widening trade deficit, or when a country imports more goods than it exports.\n\nWhen rates are higher, business loans become more expensive, which discourages owners from expanding or hiring. The ripple effects can slow the wider economy as well.\n\nRecent employment data released Friday, for instance, revealed the slowest job growth in six months and lower than the average monthly gain over the last year.\n\nStagflation concerns ‘behind us’\n\nHigh unemployment combined with inflation and slowed economic activity would spell even more trouble for Powell.\n\nPowell’s key objective these days is to avoid stagflation, an economic climate in which the economy continues to face high inflation while in a recession.\n\nAccording to crypto venture capital firm Ryze Labs, that situation looks less likely to occur.\n\n“With rate hikes off the table and markets already pricing in little to no cuts for 2024, we think this bodes constructively for risk assets,” Ryze Labs analysts told DL News.\n\n“The worst of stagflationary headwinds might be behind us,” they said.\n\nCrypto market movers\n\nBitcoin rose by 2.6% in the past 24 hours and is trading at $65,200.\n\nEthereum jumped 1.9% to $3,200.\n\nWhat we’re reading\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5jZ2xkZzRSSXpmMlBfZU1KLWJmeE5ia1A2RnpqaG1hSWQ1SGU0bkRJTktiSjVYTU1XazZ0UWJOcm40eXBLeDBnaHhnMU1vaGgybkEySDFWNmRCaWZyUWFpWjd0dm5sSS0xZklQc21CWGNDcldiN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "How High Can Ethereum (ETH) Surge This Week? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few weeks ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $3,000 mark.\n\nETH had recently shown growth, rising by 1.9% in the last 24 hours. At press time, ETH is trading at $3,200, according to CoinGecko data. ETH is up by 64.8% year-to-date and has regained the $3,000 level recently.\n\nAlso read: How High Can Dogecoin (DOGE) Surge This Week?\n\nEthereum Price Prediction for the week\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for the week. According to their analysis, ETH is expected to reach a minimum price of $3,141 and a maximum price of $3,241. The average price is expected to be $3,200.\n\nThe prediction reveals that ETH is unlikely to hit the $4,000 level this week. The recent surge in Ethereum’s price has been largely attributed to the pump after recent market volatility. With Bitcoin once again back above $65,000, ETH has renewed its rally.\n\nAlso read: Shiba Inu Forecasted To Reach 3 Cents: Here’s When\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOMWQ4UlpIYTVVbHJoYWF5Z3VjOW5RYTNCYnhiRWlhNHVFekRSYXhnb3k0VDhJTkhxclFudWtYR1JHaFo3UVY4M2QtdTdyZjFnZUNyQVAzRXRzRzZaVURxN21iQlJZZV9TcXNBUEVoSVh0OW1xdEw2TTd5MFUyT3Z1bktrTTRFdWE5Q2fSAZIBQVVfeXFMUFRzS3RFTVEzTkVJWEw0NGhSSmxna3UtdFo4cFRZT2ZBT2c0aE1HcXBNdDM2WlBoR1lKSkNjelVyS0ZnTlZYaUxvb1hDOWdYc3FYR1QwUy1qY1JjeHREcTk0b2g0OFhGNDlTOWNWNG0wVGppV2JWMUVUNF9peFZzT2ZBbWlHc0dMVFNWSEYxaUhDZUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Game ‘Fantasy Top’ Is Taking Over Crypto Twitter - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhat’s Crypto Twitter buzzing about now? A game built around Crypto Twitter, believe it or not—one offering sizable rewards and incentives for players.\n\nFantasy Top is captivating the crypto faithful by transforming the industry’s biggest and buzziest social media personalities into Ethereum NFT trading cards on scaling network Blast. Players can crush rivals by creating card lineups that have the best real-world Twitter engagement during each competition, and earn crypto and in-game prizes in return.\n\nCrypto’s biggest tweeters have excitedly embraced it, promoting their own in-game cards or sharing their lineups, as well as bragging about how much their NFTs have surged in value in a short period of time. They’re even forming private groups of holders to discuss strategies and incentivize buyers.\n\nLaunched on Blast mainnet on May 1 by pseudonymous creator Travis Bickle, Fantasy Top is effectively Sorare if it were built around outspoken crypto personalities and traders rather than professional soccer players. The influencers in question earn a small cut of each trade of their own cards, along with other perks—but many appear to have invested significantly into building their own lineups, too.\n\nAD\n\nAD\n\nThis is an attention economy And @fantasy_top_ is gamifying it pic.twitter.com/nkN9QYYvY8 — Tenacious (@TenaciousBit) May 6, 2024\n\nThe list of in-game NFT “heroes” includes meme coin trader of the moment Ansem, 9dcc founder Gmoney, Blast founder Pacman, famed weird tweeter Greg16676935420, DeGods creator Frank, whale NFT traders Pranksy and Machi Big Brother, and even Su Zhu—the co-founder of collapsed crypto hedge fund Three Arrows Capital.\n\nMachi just deposited 700 ETH into his @fantasy_top_ wallet Expecting some big sales today pic.twitter.com/lxWtxOcfU2 — Clemente (@Chilearmy123) May 6, 2024\n\nFarokh Sarmad of Rug Radio, which is merging with Decrypt, is another one of the featured personalities.\n\nAD\n\nAD\n\nIt’s about more than just buying the NFTs of crypto traders you like and putting them in a lineup for each competition, however. There are multiple rarity levels to cards, including the ability to trade up multiple lower-level cards to unlock a higher level, which provides a points boost in each competition.\n\nThere’s another curious wrinkle to consider: Scoring is based on your lineup’s actual social media engagement, which raises the question of what counts as quality engagement—and how that could potentially be manipulated.\n\nSome of the most expensive cards in Fantasy Top. Image: Decrypt\n\nOne “hero” in question, content creator Jenn Duong, temporarily put her Twitter account private on Sunday after noticing that one of her Twitter videos had abnormally large engagement numbers. She suggested that users were “botting” her content, or artificially inflating the engagement, which she feared would cause potential issues with her own play.\n\n“People don't want to play fair and I'm not going to risk messing up my X algo,” she tweeted, adding: “Please do not bot my shit. I don't need it. I'm betting on me, and I want to win on my own merit.\n\n“You're fucking up the systems for other creators,” she added.\n\nPlease do not bot my shit. I don't need it. I'm betting on me, and I want to win on my own merit. You're fucking up the systems for other creators. — Jenn (@jenndefer) May 5, 2024\n\nBut the Fantasy Top hype continues unabated, and arguably hit a fever peak early Monday with the announcement of the prize pool for the first “Main Competition” that just began: over $150,000 worth of Ethereum (50 ETH), plus 222,222 Blast Gold that will lead to an airdrop allocation for the network—along with card packs and other in-game rewards.\n\nWhile 50 ETH is no small change for a crypto game that launched last week, the far bigger prize could come from the Blast Gold. Crypto industry observers estimate the value of each Blast Gold above $10, putting that part of the prize pool potentially well above $2 million in total.\n\nAD\n\nAD\n\ntrading volume is on the rise for @fantasy_top_ as we approach main tournament #1 current volume is > 50% of Ethereum mainnet's total NFT volume src: https://t.co/q91HcFqt6A pic.twitter.com/1N8tlxnOFm — hildobby (@hildobby_) May 6, 2024\n\nPlayers scrambled to buy up cards on the Fantasy Top marketplace, generating millions of dollars’ worth of trading on scaling network Blast in the process—equaling more than 50% of the total trading volume on Ethereum mainnet early Monday.\n\nA Flipside Crypto dashboard from analyst Hildobby shows over 7,000 ETH worth of NFT trading volume (over $21 million worth at the current price) and over 31,000 total users this week.\n\nFantasy Top has been a shot in the arm for Crypto Twitter denizens, resuscitating the positive vibes that have been missing in recent weeks amid a market lull. But we’ll see whether a fantasy sports riff featuring Twitter influencers has the depth and intrigue to maintain momentum after the initial novelty and Blast network incentives fade.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNQ3l0NDNWUExRbjZGbzBvNU1fY1k4dDdRTVFUaGsya09DY1J5emlMUGIydVFCZWJIY0V0ZElnOGN2Qng0SnlOUC13NEF6MzZHcDE4TjIzMjd0cHBTUVlpcWZVWXM3Q3lGZ3RJSEg3cnFWLUhfUG1Pb0RuN1ZqV3dpWmNPME5OeUxBMEdGNnZQUkdwWkdlVjRybWpad0NmeTE1ZTdDeGo4M2tUSlB0NTFteDFqbEZyV3M0ZnV0clEwdXlkT2FBSEJJV3JPejBjMUHSAdQBQVVfeXFMT1NWWWhXOEp5TmRBTDlFN2toQlJTMEJRWjVJOW9ZR1h2bHJ0d0JRZC1sNkhQY0J5cUhsZTdVTXg3RGpkSnE2V1ZfRWljeS1Ydm55OUkxbzdYRkJxREh0SHdlVzZGX0ZubnZ1MXF0R1BLcUtTQWJabFhaMWR1MVBwa3ZYV3NSa3N5M0ZWNUsxekY2U2RiSVRobkxWM2xSeTFmRWhBYVVWTVJnVlZJUDlfaWtWbzE1TG9CalF3bFl1emNPUGhoTVZIWWZ6YnFLUFZFV2xYb2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Popular Crypto Wallet MetaMask Rolls Out 'Smart Transactions' to Combat Ethereum Front-Running - CoinDesk",
        "content": "\"We're not going to try to take over Ethereum or something,\" said Linehan, \"but there's no way that this becomes the base layer for the future of the global economy if it's wasting $400 million of its users' money every year on things that literally do nothing for them. That's pure waste.\""
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOdGVjMmJ6YUd0NTVxYWhzLWNvRkg4M3dqNUd1bnFqZk9FSnNaSG5fRENFS0hwR2laR0NDbzVENXJ1SVRVNFE2bWFIaC1RLTdNZDZsMTRjS3pJUUNwMVhPRW5kVTVqdjRTNkJMejdtNlVrTWd1UjdZMUxnTGZwb2NIRlptNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Saw a Huge Surge as Furrever Token Hits $1 Million Presale Milestone, Launches $10,000 Competition - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 05, 2024 (GLOBE NEWSWIRE) --\n\nDespite recent turbulence in the crypto markets, both Bitcoin (BTC) and Ethereum (ETH) have experienced a remarkable surge in prices over the past two days. This unexpected rally comes amidst a backdrop of uncertainty, indicating renewed investor confidence in these leading cryptocurrencies. Adding to the fervor, Furrever Token (FURR) has achieved a significant milestone, surpassing $1 million in presale funding, and has now launched a lucrative $10,000 competition, further igniting excitement in the crypto community.\n\nBitcoin's Resilience Shines as Whales Drive Market Surge: What's Next for Crypto?\n\nAmidst recent market turbulence, Bitcoin (BTC) has emerged resilient, witnessing a remarkable surge driven by whale activity. On May 3, the total market value soared to $2.18 trillion, propelled by a 10% increase in Bitcoin's price to approximately $64,300.75. Notably, over $2.8 billion worth of BTC was accumulated by whales within 24 hours, signaling renewed confidence in the market. Analysts interpret indicators such as the Spent Output Profit Ratio (SOPR) and Bollinger Bands, foreseeing a potential short-term turnaround.\n\nDespite recent corrections, market intelligence suggests key support levels and hints at a rebound, fostering optimism among investors. As Bitcoin trades at $61,721, attention turns to sustaining momentum above $59.7K, with the community eagerly anticipating further market growth and potential milestones.\n\nEthereum's Regulatory Challenges and Price Dynamics: Insights for Investors\n\nAmidst its pivotal role in the crypto landscape, Ethereum (ETH) faces a complex interplay of regulatory hurdles and market dynamics, offering crucial insights for investors. Currently trading at $3,158.07 with a 6% increase since yesterday, Ethereum maintains its position as the second-largest cryptocurrency with a market cap of $373 billion. However, the path to launching Ethereum ETFs remains uncertain, with regulatory approval prospects cast into doubt by analysts like Bloomberg's James Seyffart. Seyffart suggests that approval for spot Ethereum ETFs in 2024 is improbable, potentially delayed until 2025, citing cautious behavior from the U.S. Securities and Exchange Commission (SEC).\n\nEthereum's price trajectory reflects this uncertainty, experiencing fluctuations within a ranging channel, with bullish signals indicating potential for testing new highs. Technical indicators such as the Relative Strength Index (RSI) and Bollinger Bands provide further insights into Ethereum's market momentum and consolidation phase. As Ethereum navigates through regulatory challenges and market fluctuations, its future outlook remains a subject of intense interest, with regulatory decisions poised to significantly impact adoption and integration of Ethereum-based financial products.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR): Pioneering Cuteness in Crypto with $1 Million Presale Success and $10,000 Frenzy Bonanza Competition\n\nFurrever Token (FURR) has rapidly ascended as a darling of the investor community, captivating enthusiasts with its innovative approach and endearing charm. Priced at $0.000648, FURR injects a refreshing dose of cuteness into the crypto space, leveraging the universal appeal of adorable cat imagery to transcend traditional boundaries. This delightful experience fosters a sense of community and shared joy, resonating strongly with users seeking a break from the seriousness often associated with blockchain technology. The project's commitment to creating a user-friendly platform, complete with cute cat-themed stickers, emojis, and visuals, has struck a chord with investors. To buy FURR, investors can visit its official website, furrevertoken.com, where they can also explore the potential for up to 15X returns.\n\nThe success of Furrever Token's presale, which amassed over $1 million in funding within just two months, speaks volumes about the project's traction and investor confidence. This rapid growth underscores not only the widespread appeal of FURR but also the growing appetite for projects prioritizing user experience and community engagement. With 65% of tokens available during the presale and a prudent allocation for team tokens locked for a year to reassure investors of the project's long-term viability, Furrever Token has demonstrated a commitment to transparency and sustainability.\n\nTo celebrate its successful presale progression, Furrever Token (FURR) has announced an exhilarating competition: the Furrever Token $10,000 Frenzy Bonanza Competition! This thrilling event invites Furrever Token enthusiasts to participate in a seven-day competition on the Gleam platform, where completing various tasks earns participants points for a chance to win. With $10,000 worth of FURR up for grabs, three lucky winners will be crowned Bonanza Champions at the end of the competition. First place takes home $5,000 worth of FURR, second place wins $3,000, and third place receives $2,000.\n\nThe competition runs from 02/05/2024 to 09/05/2024, offering participants ample time to secure their spot as one of the ultimate Furrever Winners. Winners will be selected randomly through the Gleam platform, with each winner receiving the prize value in FURR tokens directly to their connected wallet. To be eligible, participants must have a minimum of $10 worth of FURR on the website dashboard. So, get ready to embark on this exciting journey and may the fluffiest members emerge victorious!\n\nIn conclusion, Furrever Token's rapid rise to prominence in the cryptocurrency space is a testament to its innovative vision, strong community ethos, and unwavering commitment to delivering a unique and enjoyable experience for users. As the project continues to evolve and expand its reach, it is poised to make a lasting impact, capturing the hearts of investors and cat lovers alike while carving out its niche in the ever-growing crypto landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:Robert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPNUN0dVZOVklVb2JKa0x1c1U2amg2VHU2OWtTdER5X1ZyenZURnBDbGRab2JucHE4MTZhZjVmQlJqLXlJaGJxNzZyREJVQnJXakc3WUJUYzdFSWZEcFROYTZjdDVGa3dGbWNtRjdKbUMxSXhaRlBtQ0F6UWtid0hrWHF6X0FsSk1yaFRSRFFVUjkxSG9SVzZFT2FwOE1tZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Récap crypto hebdo : MicroStrategy résiste, Binance secoué, Bercy contre-attaque ! - Cointribune EN",
        "content": "Mon 06 May 2024 ▪ 7 min read ▪ by Luc Jose A.\n\nAmid groundbreaking announcements, technological advancements, and regulatory turbulence, the crypto ecosystem continues to prove it is both a territory of boundless innovation and a field of regulatory and economic battles. Here’s a rundown of the most striking news from the past week surrounding Bitcoin, Ethereum, Binance, Solana, etc.\n\nMicroStrategy perseveres despite everything!\n\nMicroStrategy continued to increase its Bitcoin holdings, reaching an impressive total of 214,400 BTC with a recent acquisition of 122 Bitcoins for $7.8 million. Despite a net loss of $53 million in the first quarter of 2024 and a 5.5% decline in revenue compared to the previous year, the company maintains its strategy of massive investment in crypto. These market movements occurred in a context of increased volatility, affecting the value of the company’s digital assets.\n\nThis bold strategy, although risky given the volatility of the crypto market, is a bet on the long-term profitability of Bitcoin. However, this approach has led to significant financial losses and prevented MicroStrategy from joining the S&P 500, a blow to the company’s attractiveness to investors. The future of this strategy remains uncertain, but it demonstrates a firm commitment to the potential of Bitcoin.\n\nLight sentence for Changpeng Zhao despite serious charges\n\nChangpeng Zhao, the founder of Binance, has been sentenced to only four months in prison and a $50 million fine for charges of fraud and compliance failures. This sentence is markedly more lenient than the three years requested by prosecutors and is perceived, by some, as a sign of leniency that downplays the seriousness of the infractions and thus sets a worrying precedent for the industry.\n\nFurthermore, this case highlights the challenges regulators face in an ever-evolving sector and underscores the need for a balance between promoting innovation and protecting investors. Zhao’s case also illustrates the tension between strict regulation and the potential to push key players toward more permissive jurisdictions.\n\nTreasury takes aim at crypto fraudsters in France\n\nIn France, the gap between actual crypto usage and tax reporting is alarming. According to European Central Bank figures, about 5 million French people are crypto users, but only 150,000 tax filings have been recorded. This discovery has prompted Treasury action to take drastic steps to combat tax fraud, partly inspired by the massive fraud already observed in other schemes like MaPrimeRénov, where 400 million euros were misappropriated.\n\nTo combat this scourge, the Treasury decided to deploy artificial intelligence for more effective and targeted surveillance. A new anti-fraud legislative framework, including a crypto-specific component, is in preparation. Artificial intelligence will be used to analyze blockchains and detect suspicious activities in real time, modeling fraud patterns to better track and unravel the most complex money-laundering circuits. This technological approach promises constant vigilance and an increased capacity to respond to fraudulent schemes.\n\nBNP Paribas invests in Bitcoin\n\nMay 1, 2024, is marked by a contradictory event in the world of Bitcoin ETFs, with record outflows of $563.7 million in a single day. Despite this tumultuous context, BNP Paribas, the second-largest European bank, has made a significant move towards Bitcoin adoption by investing approximately $40,000 in BlackRock’s IBIT ETF. While modest, this investment is symbolic of the increasing acceptance of Bitcoin by traditional European financial institutions.\n\nThis move by BNP Paribas could mark the beginning of broader institutional acceptance of Bitcoin as a viable asset class. Until now, this adoption had been mainly by American asset managers and regional banks. BNP’s commitment could encourage other major banks and asset managers to invest in Bitcoin, thereby accelerating its acceptance by the general public and boosting inflows into ETFs and other regulated vehicles.\n\nRippleX revolutionizes XRP with a new feature\n\nRippleX has recently launched an innovative feature, the XLS-68d specification, which aims to simplify and democratize transactions on the XRP Ledger (XRPL). This new specification allows platforms to manage fees and account reserves for their users, significantly reducing the complexity and financial barriers associated with using XRP. Users will benefit from what’s called “sponsored transactions,” where they can include sponsor signatures in their transactions while maintaining full control of their accounts.\n\nThis advancement is seen as a major step toward the mass adoption of XRP, as it enables platforms to cover the costs of transactions for their users, making XRP accessible to a broader audience.\n\nSEC controversy: Accusations of lying about Ethereum\n\nGary Gensler, the chairman of the SEC, is accused of misleading the U.S. Congress about classifying Ethereum as an unregistered security. These revelations, stemming from internal SEC documents exposed during a lawsuit with the company Consensys, show that the agency considered ETH a security for over a year. These actions contradict the public statements of Gensler, who has declined to clarify the SEC’s position on Ethereum during a hearing, avoiding direct questions on the subject.\n\nPatrick McHenry, chairman of the House Financial Services Committee, has openly criticized Gensler for what he considers deception towards Congress. This situation sheds light on the challenges and contradictions in the SEC’s regulation of cryptos. The outcome of these regulatory debates could have significant implications for the legal status of Ethereum and other cryptocurrencies in the United States.\n\nPayPal expands its crypto offerings with MoonPay\n\nPayPal has significantly expanded its crypto offerings through a strategic partnership with MoonPay. This collaboration allows PayPal to offer more than 100 different digital assets to its users, thus simplifying the purchase of cryptocurrencies just like an ordinary online purchase. Similarly, this partnership enhances the compatibility of crypto transactions with traditional banking systems and reduces transaction failures, providing a smooth and secure user experience.\n\nTo conclude, this integration guarantees better protection of customer personal data, who no longer need to provide their information separately to MoonPay for transactions. With the addition of popular cryptos such as Solana, Tether, and Dogecoin, PayPal broadens the possibilities for its users in terms of investment and everyday usage of cryptos.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPNjdZTkRMMHhTdFVoMWxVV1FKOUlpTmIyTjY4blZyTUQ4ZFBVMDVQanM5X1pRelFjNVp5SWRyczV0d1JoX0JYRmJ2RjlzQ3VRZ3dIMUNfZzhIazA3eEFlQWRDNU5vWUtlY1ZtaEQtcmV2U3JqQUhBc2dnaEw4VXBubmgxYlZUTTNScTB6OGtoamxoSFdVT3JfOWdTbU1RTkFWaVVSSDhjb1NUOWZF0gGyAUFVX3lxTE54andWVVVJdjNiRkdQQzJiODRqQUp4bVRycC1mbnZEWVNkMWZSMUo0cVdRZVFtSVJHRGxaQUxXU25hTkM3azI5SHIwX0RtX0Z5bFFRYkFjNFkxblplZ3NzWldwcnAxRjBkaFAtWjdhSWlnZEZDaTk3TEhvZHJIeGNGNEMyZDJOX0s4cDVFZVZvelkxMzM0bVU3b1c2MlRCU3hhMEdUWjh3WHdhWVlEYnJJSUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast As DeFi TVL Jumps To $57B, ETH Poised For $4,000 This Week? - CoinGape",
        "content": "Ethereum price forecast: ETH is nearing its highest level in a little over a week in tandem with a strong crypto rebound from last week’s bottom. Bitcoin, the largest cryptocurrency, upholds the bullish outlook closing in on the $65,000 mark.\n\nLeading altcoins like Binance Coin (BNB), Solana (SOL) and XRP are also in the green, rewarding patient investors. Nevertheless, market doldrums cannot be ignored, especially in light of the many internal and internal factors in play.\n\nadvertisement\n\nExternally, skyrocketing inflation is a hindrance to risk asset classes like crypto. Recently the Federal Reserve left interest rates unchanged amid persistent inflation in the US since January.\n\nThe outlook for the first rate cut in the year has shifted as the Fed battles to bring inflation to 2%. Experts project that the first-rate cut may come late in the year as opposed to June.\n\nThe current Ethereum price forecast shows the leading smart contracts token hovering at $3,122 on Monday, down a modest 0.5% in 24 hours. Ranking #2 in the market, Ether boasts $374 billion — a value backed by $10 billion of trading volume.\n\nEthereum Price Forecast: Does DeFi TVL Impact ETH Technical Outlook?\n\nAccording to data processed and graphically presented by DeFi Llama, the cumulative value of all the assets locked in smart contracts within the ecosystem is back on the move, rising to $57 billion. Although this figure is a pale shadow of the $109 billion record high, persistent increases reduce potential selling pressure.\n\nInvestors show confidence in the long-term value of a coin by staking their holdings to grow their wallets. Staking rewards are distributed daily on an annualized basis, allowing the community to participate in processing transactions and securing the network.\n\nA high total value locked (TVL) reduces the circulating supply and subsequently, the potential selling pressure. Sentiment also improves encouraging more people to buy ETH, thus propping the token for gains.\n\nCan Ethereum Rally To $4,000 In May\n\nInvestors are holding firmly to their positions as the crypto market rebounds in May. April broke several months of a bullish streak ignited in Q4 last year. With major cryptocurrencies waking up strongly this week, aiming for higher levels this week and a rally to $4,000 before the end of May.\n\nThe bullish bet on Ethereum price hinges on the falling wedge seen on the daily chart. Although a bullish pattern, it remains unconfirmed until the price breaks above the upper trendline.\n\nTraders activate their buy orders following this breakout and anticipate a move equal to the distance between the widest points of the wedge — roughly 25%.\n\nOn the sell side, traders cannot ignore the position of the Relative Strength Index (RSI) at 46. A careful examination reveals the indicator stuck below the trend line resistance. Should this trend continue, selling pressure will be a ticking bomb.\n\nEthereum price also sits below two bull market indicators; the 20-day Exponential Moving Average (EMA) and the 50-day EMA. Bulls must reclaim these two key levels to validate their strong grip on the uptrend.\n\nOtherwise, there’s a glaring possibility of another sweep at the $3,000 and $2,800 support areas to collect more liquidity.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOZEpyUDRyaEMwMW14MlBqNG5QeFhudVI4OVBEVGNuVnlTMXFRMVd1MjJScGY3MmNXdFQtNlVHUVFPVERZcktCQXFhM0FiMW9LZXNOVmRfVXFpd1ZvTktkQmp6ejFIdUIwdkJRemNaM2V3OG5PeVR4bDFBWERNeVMyYVo3bVdJQWpiSDBsUU4xQW5MWXVGMzZNM0FNZjh4dG5xWGxwR25lSnZQdGtw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum's strong comeback, a wave of new followers revives speculation - Cointribune EN",
        "content": "Sun 05 May 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe Ethereum network saw a record influx of new users at the end of April, despite a bearish crypto market. This newfound momentum is rekindling hope, but the influence of “whales” raises questions.\n\nThe Rush Towards Ethereum\n\nAccording to Santiment, a company specializing in blockchain analysis, April 28 and 29 saw the creation of 266,600 new Ethereum wallets, a record since October 2022. This surge contrasts with the general gloom of the crypto market.\n\nSeveral factors explain this renewed interest:\n\nThe anticipation of upcoming network updates, aimed at improving its performance and security.\n\nThe recent fall in prices, perceived as a buying opportunity by investors looking for bargains.\n\nHowever, behind this improvement hides a more nuanced reality. According to CoinMarketCap, 97% of Ethereum addresses hold less than $1000 in crypto, while a handful of “whales” concentrate 41% of the circulating supply, according to Clank, a whale tracking platform.\n\nOn average, each whale owns close to 10 million ETH, equivalent to $3.7 million, giving them a considerable influence over the network.\n\nETH Stands Strong Amidst the Storm\n\nDespite concerns related to capital concentration, Ethereum has shown resilience. Its price has risen by 30% since the beginning of the year, while the general crypto market has fallen by 8.75% in one week. Currently, ETH is trading at $2971.73 with a total market capitalization of $352 billion.\n\nThis relative stability reflects investors’ confidence. According to the data available, 74% of Ethereum holders bet on the long term and keep their positions despite the market volatility. This “HODLing” (Hold On for Dear Life) mentality illustrates their belief in the project’s future potential.\n\nThe massive arrival of new users on the Ethereum network sparks optimism, fueled by the anticipation of upcoming improvements and investment opportunities due to the recent drop in prices. However, the concentration of holdings in the hands of a few “whales” remains a matter of concern for the community. Time will tell if Ethereum can maintain this positive momentum and further democratize its ecosystem.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxNSGFONXZkLXJkNG0wTWdBbkNNNnFMUEZjTmVzOGp4NHd5R09XMHh3WUNHbTE4ZUZ2VDQ2WmJET2xBSkQ3NEdsVkt2cUVReUQ4ZVlIT3RXaGVaZTJzdVpNa1g2cnJkRzZUcGo3MC1zWkJjY0JhN2Rzb3hsbHVQNXBqbDBjenYxblhiUktwT29qOHRPejJLdHZwVHM1bnoxOWFlcXQyN1I3azJkTm1KcG1na24yRzhaWUc1UFNOLTA3VC1pb1FMMjcxb01DQWxoVjBtdHNmOFJCOXhhQXhtZWx2Njc2XzcyRlJFdXUtOEN2UWxlUdIB9wFBVV95cUxPQTNxY3ZNaVNNaWNkR2FXQWZmR0d0UElSdlZ1V004eGxGcTc5WEo2c0xGTXBmZ19sMmthOFNsZE45bl9uenFjU1JEZlhJNW0tUmtsMDh0bVFRbzJUQmtDaGpVd185WEtwRzlxelhkR2dIS3Z2Mi1ZQVVVYTVrZkJYVWYwdlRhSVJTM04zQ0tCcWtFRXo4cDNScGRKZXBHVXBxbG5ORWdfX0pHZUlnTnpqNEx5NWwzbEtIVGJpZTBOWVhibG1mOWZBZWdxd1A3cS03WG5CRFFjR2hDZHZnWTF3TV9TTlBkd2VxLVE1bEstSlB1d3J0UnRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins in disarray as BTC conceals directional bias - FXStreet",
        "content": "Bitcoin price must break through either $70,000 or $50,000 to decide next stable directional bias on weekly time frame.\n\nEthereum price action offers bullish reversal play in the cards for 25% upside potential.\n\nRipple price could climb 8% to $0.60 as XRP bulls sustain higher lows.\n\nBitcoin (BTC) price remains devoid of a directional bias on the higher time frames. In the lower time frames, the Relative Strength Index (RSI) on the one-day timeframe shows both bulls and bears have folded their hands. This has altcoins in a state of confusion or disarray.\n\nAlso Read: Addressing the crypto investor dilemma: To invest or not?\n\nCryptocurrency prices FAQs How do new token launches or listings affect cryptocurrency prices? Token launches like Arbitrum’s ARB airdrop and Optimism OP influence demand and adoption among market participants. Listings on crypto exchanges deepen the liquidity for an asset and add new participants to an asset’s network. This is typically bullish for a digital asset. How do hacks affect cryptocurrency prices? A hack is an event in which an attacker captures a large volume of the asset from a DeFi bridge or hot wallet of an exchange or any other crypto platform via exploits, bugs or other methods. The exploiter then transfers these tokens out of the exchange platforms to ultimately sell or swap the assets for other cryptocurrencies or stablecoins. Such events often involve an en masse panic triggering a sell-off in the affected assets. How do macroeconomic releases and events affect cryptocurrency prices? Macroeconomic events like the US Federal Reserve’s decision on interest rates influence risk assets like Bitcoin, mainly through the direct impact they have on the US Dollar. An increase in interest rate typically negatively influences Bitcoin and altcoin prices, and vice versa. If the US Dollar index declines, risk assets and associated leverage for trading gets cheaper, in turn driving crypto prices higher. How do major crypto upgrades like halvings, hard forks affect cryptocurrency prices? Halvings are typically considered bullish events as they slash the block reward in half for miners, constricting the supply of the asset. At consistent demand if the supply reduces, the asset’s price climbs. This has been observed in Bitcoin and Litecoin.\n\nBitcoin price needs a stable directional bias\n\nBitcoin price remains range-bound between $60,660 and $70,000. It is trading horizontally and without directional bias. Based on the volume profiles, both bulls and bears are playing it safe, seeing as there are no spikes within the vicinity of the current price.\n\nHowever, with the RSI above the mean level of 50 and the Awesome Oscillator (AO) in positive territory, the odds lean in favor of the upside. To confirm this directional bias, however, the bulls must haul BTC to close decisively above $70,000 on the weekly chart.\n\nBTC/USDT 1-week chart\n\nOn the other hand, if bears take over the market amid falling momentum shown by the nose-diving RSI, Bitcoin price could drop below $60,660. In a dire case, the dump could send BTC to the $50,000 threshold, below which the bullish bias would be invalidated.\n\nAlso Read: Bitcoin price consolidates as buyer momentum flatlines, but MicroStrategy tops BTC ownership list\n\nEthereum price has 25% upside potential up its sleeve\n\nEthereum price could make a 25% run north if the descending wedge pattern, a bullish reversal technical formation, is activated. For this to happen, either of two scenarios must take place. First, Bitcoin price must give a clear directional bias that bodes well for altcoins, or secondly, altcoins must suck liquidity from Bitcoin price to initiate an alt season.\n\nA 25% climb above the breakout point for Ethereum price will send ETH to $4,250. For this to happen, however, ETH bulls must clear the resistance order block due to the volume spikes near $3,500 where a lot of bearish activity is waiting to descend on ETH.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased selling pressure could send Ethereum price below the $2,900 support. In a dire case where ETH records a lower low below $2,800, the bullish thesis would be negated.\n\nAlso Read: Ethereum could see a brief rally despite Michael Saylor's jab at ETH ETFs\n\nRipple price eyes $0.60\n\nRipple price recorded an intraday high of $0.5703 on Monday with the potential for more gains as XRP bulls continue to show strength. If bulls manage a stable move above the peak of the market range at $0.5715, it would clear the path for a continuation of the uptrend above the 50% Fibonacci placeholder of the larger market range at $0.5847. This could set the tone for Ripple price to test the $0.6000 psychological level, nearly 10% above current levels.\n\nThe RSI continues to record higher lowers, signifying growing bullish strength. A stable move and close above the 50 mean level would confirm the continuation of the uptrend.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if bears take over and profit-booking takes form, the Ripple price could extend its fall. A candlestick close below $0.4952 would encourage more sell orders. For the bullish thesis to be invalidated, however, the price must close below $0.4500 on the one-day time frame.\n\nAlso Read: Ripple lawsuit to see SEC response on Monday, XRP nears 4.5 million mark in liquidity pools"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPU3NXLUttdDhFbzdfS3lESWU4RlcwVHFtTE9sNEVtYmktcjhfV3VSOTN3OWJtVDFwT0V1VlM2QmMwcFNpMURTS3F1UUdrV2RWSUdwNFVsNlpCb3JPSWthSWIxZjRtckhnY1R3dVozQzVUN3BOdktxUVd3Wmg3TGFiVtIBhgFBVV95cUxONU5NRzVrTFFPSWVTd0dJa2hDV3BERV8zaDc1aGxOZzdndU9aMG5ZQUplb3hkbEZEdV9GNFJiT1FiTWtZSjctYW1wNHVLMmR6dWVOelgxUlZzNThIX2JGRGRQTExzRUlhUzVfTFJmUVZrY0t1NGtIUGRtdU42bnloUUNORmN6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "More Bitcoin, Ethereum leave exchanges: What’s going on? - AMBCrypto News",
        "content": "Exchanges see less BTC and ETH.\n\nHolders continued to increase despite the decline on exchanges.\n\nBitcoin [BTC] and Ethereum [ETH] are the two largest assets based on their market capitalizations. But recent data indicates that one of them is becoming scarcer.\n\nBitcoin and Ethereum on exchanges decline\n\nAMBCrypto’s analysis of the Bitcoin and Ethereum Balance on Exchange metric indicated a decline in the availability of these assets on exchanges.\n\nInterestingly, Ethereum’s balance on exchanges has experienced a more pronounced decrease compared to Bitcoin.\n\nAccording to data from Glassnode spanning from March 2023 to the present, the ETH balance on exchanges has plummeted by nearly 6%.\n\nStarting at 16% in March 2023, it has declined to 10.66% as of the latest figures.\n\nConversely, the BTC balance on exchanges has seen a milder decline of almost 2%, dropping from 13% in March 2023 to approximately 11.85% at press time.\n\nThe dwindling balance of Ethereum on exchanges suggested increasing scarcity of the assets available for trading.\n\nTypically, a decline in balance on exchanges implies that holders are withdrawing their assets from trading platforms.\n\nIn the case of Ethereum, it could also indicate that holders are withdrawing and staking their assets for potential returns, further reducing the available supply for trading.\n\nHas it affected the number of holders?\n\nBitcoin and Ethereum’s holders on Santiment revealed a consistent growth trend.\n\nAt the time of this assessment, the number of BTC holders had reached almost 54 million, while Ethereum boasted over 121 million holders.\n\nThis data suggests that both assets have steadily accrued holders over the past few months, indicating sustained interest and adoption.\n\nThe increase in the number of holders also aligns with the declining balance of these assets on exchanges, as observed in previous analyses.\n\nThis trend suggests that holders are actively withdrawing their assets from exchanges, possibly for long-term holding or other investment strategies.\n\nSuch behavior is generally interpreted as a positive sign for the assets, as it reflects confidence in their long-term value and utility.\n\nBitcoin and Ethereum in profit rises\n\nAnalysis of the Bitcoin and Ethereum supply in profit indicated a recent uptrend. As of this writing, the ETH supply in profit was almost 117 million, while BTC registered nearly 18 million.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nThis upward movement aligned with the recent price rebound observed in both BTC and ETH markets.\n\nAs of this writing, ETH was trading at approximately $3,200 with a gain of over 2%, while Bitcoin was priced at around $65,200, also experiencing an increase of almost 2%."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOb2ZtcGRYQ2s4NTN1OGw1eUxWQkZZTGdxQXNydEZrUzMtcG8weGJmMFVVSXNtQ1hyaEFRT1RLdkdKX0NCQWtIU2JhUHg3LTRDY25MMzYzTXkxRkZaNks0VGJ6MGJRbU5OTWFDUGxkNWRBaHpaWnNnVWJoTjFrMnRDQ1BrcGdqSUxES09n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum Breaks Monthly Stablecoin Volume Record in April - Watcher Guru",
        "content": "Following the emergence of one prominent contributor, Ethereum broke its monthly stablecoin volume record in April. Indeed, the network volume last month was a significant increase over any month for the blockchain previously.\n\nIn April, Ethereum saw its monthly stablecoin volume reach a remarkable $1.12 trillion. Moreover, the majority of that landmark figure was contributed by DAI, whose participation in MEV transactions has accounted for a big part of the volume surge that Ethereum has enjoyed.\n\nAlso Read: Ethereum (ETH) Wallet Wakes Up After 8 Years With $5.9 Million\n\nEthereum’s $1.2 Billion Stablecoin Volume in April is a New Record\n\nThe digital asset market has seen a lot of potential in the ever-growing stablecoin market. Indeed, these cryptocurrencies are backed by real assets, typically fiat currencies like the US dollar. Moreover, their prevalence in the industry has been undeniable.\n\nYet, they seem to only be growing in prevalence, as Ethereum broke its monthly stablecoin volume record in April. According to data from The Block, this record-shattering month is connected to the presence of flash loan activity, which catapulted the figure.\n\nSource: Watcher.Guru\n\nAlso Read: Ripple Surges After Stablecoin Announcement: Can XRP Hit $1?\n\nData shows that DAI’s involvement has been a huge catalyst in bringing about a surge in volume for Ethereum. The data shows that a single transaction added nearly a billion dollars in volume on its own.\n\nDAI had been responsible for $636 billion in volume for the month of April. This was undoubtedly the primary stablecoin for Ethereum’s total on-chain volume, whose total reached $1.2 trillion for the first time.\n\nMoreover, those figures are expected to continue to be impressive heading into the month of May. Not only was DAI impressive, but upcoming stablecoins are set to be important in the growth trajectory of the market."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOLUl3LVhyYy1WYmMwZ3dJR3FIV2F1RTlIZTBjenRMeFQweFk1Q3czemZJWmdreW9OcndoMHh2bmtBdzJHeGJoby1mM1I3NHh4NTd3NEhHcFpMN2xOaG55UExOblJwX2UxUGpvaTJSQ205OVU5S21PRm5SbXVXaVluZUpWeExEYy1XQ3VtTzRhTdIBlAFBVV95cUxPVjRiNFZPVklOQ2lldzAzVG1iekdlQmN6VW56cWtmQVVtSWNJV0hQRnhHNzdfamhwVk5oRlI4SWZ0SWk4ZnNURTh1QmYyUnE0RXE3MWRLeUZad3dkWnFLcjgteTNvbjBSY0V4VkRleE1FYzMweHF1eWZUc2dwT1hTNS1HNG9NUXlFeTFGQmI4TnMwZDFh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum price prediction: ETH crosses $3.1K, another 50% gain next? - AMBCrypto News",
        "content": "Metrics suggested that Ethereum was undervalued.\n\nMarket indicators gave ambiguous signals regarding an upcoming bull rally.\n\nEthereum [ETH] came back on track on the 6th of May as its price once again crossed $3.1k. While the token crossed the psychological resistance, it also consolidated inside a bull pattern.\n\nA breakout above the pattern could allow ETH to reach new highs in the coming weeks.\n\nEthereum price prediction\n\nLast week was not in investors’ best interest as the king of altcoins’ price plummeted to $2.8k. However, the token gained bullish momentum on the 1st of May as its price moved up steadily.\n\nAccording to CoinMarketCap, ETH’s price increased by over 1.55% in the last 24 hours. At press time, it was trading at $3,144.11 with a market capitalization of over $377 billion.\n\nIn the meantime, World of Charts, a popular crypto analyst, recently posted a tweet highlighting a falling edge pattern on ETH’s chart.\n\nThe token started to consolidate inside the pattern since the beginning of March. As per the tweet, the correction phase for ETH was over as it was headed towards the upper trendline of the falling wedge.\n\nA successful breakout from the falling wedge pattern could lead to a 45%-50% price rise in the coming weeks. Predicting Ethereum’s price, it might as well surpass its March high if a bull rally happens.\n\nIs Ethereum ready for a rally?\n\nAMBCrypto then analyzed Ethereum’s on-chain metrics to see whether they supported the possibility of a breakout.\n\nNotably, ETH’s Network To Value (NVT) ratio registered a downtick after a sharp increase. A drop in the metric means that an asset is undervalued.\n\nOur analysis of Santiment’s data pointed out a few other bullish metrics. For instance, ETH’s MVRV ratio improved over the last week. Its Network Growth was also high.\n\nThis meant that more new addresses were created to transfer the token, reflecting high activity.\n\nHowever, Lookonchain’s latest tweet pointed towards a sell-off. As per the tweet, a whale sold 7k ETH, which, at press time, was worth over $22 million, according to AMBCrypto Converter.\n\nThis seemed bearish, as it hinted that the whale was expecting a price drop.\n\nTo better understand whether a breakout above the falling wedge pattern was possible, AMBCrypto then analyzed ETH’s daily chart.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAs per our analysis, ETH’s Relative Strength Index (RSI) registered an uptick and had a value of 49.7, suggesting that the chances of an upward price movement were high.\n\nNonetheless, the Money Flow Index (MFI) supported the bears as it was resting below the neutral mark of 50."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQVllBWER0Nk5ITlJHeHk3end3eGo0TThkSWRnSU5lWXllREZLX0U4UnVodkNuMDdaeW1GR1hHVEEzWnZscjlXRWpMcERjTmo5cmUzWU9pUnpvLVhVQk1adDkwLWI3dGVFblBoWnRjN3BRbkR2aWlISUlhdUZFMXQ2UjlKSl90R3Vkb1VDNWZ0eTR3WWxnUVZxNlN1NnhOLU5KLWfSAacBQVVfeXFMTVYwUFVPUVZ4YVc2ZEE4aGlqLVFUemhuczU5YmU5Uzd6NDVyelYwVU13c0h4SmFRbl9FUzkxU2xybUNMODhaSHVYSmZLY19CMjFjNnVUNnQtdjVGakRNaW41NU5sNy1VTVJYb0o0V0ZBR2k4S283bnZOWXNjZjRLUzRvRm95S1Viclh3QzFOUERhSC1OYTY3ZXY2LUNSWnExWTJlQ19kZEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Bitcoin – This falling metric could be the key to Ethereum, Solana price rallies - AMBCrypto News",
        "content": "Top altcoins like Ethereum, Solana, and BNB registered major gains over the last 24 hours\n\nHowever, metrics and technical indicators weren’t all bullish\n\nBitcoin’s last 24 hours have been productive, with the cryptocurrency climbing back above $63,000 on the charts. As expected, most of the market’s altcoins followed suit, with their charts seeing green as well. However, the latter’s performances fueled a fall in Bitcoin’s [BTC] dominance. In fact, it hit such a critical level that a fresh altcoin season could be right around the corner now.\n\nAltcoin season is here\n\nCaptain Faibik, a popular crypto-analyst, recently shared a tweet highlighting an interesting development. As per the same, Bitcoin’s dominance is now moving inside a rising wedge pattern. What this means is that the chances of BTC dominance falling over the coming days are quite likely. This would be a positive sign for altcoins as their market cap is likely to surge then.\n\nMags, another famous crypto-analyst, also shared a tweet mentioning a historical event. The tweet stated that in 2020, the altcoin market was in an accumulation phase. That ended in the second half of the year, kick-starting a massive bull rally.\n\nThe analyst believes a similar trend can be seen this time around, further increasing the chances of an altcoin season soon. If the rally happens, then altcoins’ market capitalization can be expected to hike dramatically.\n\nA look at the top altcoins\n\nTo see whether altcoins are preparing for a rally, what better way than to check the performance of the top alts? According to CoinMarketCap, Ethereum [ETH], the king of altcoins, pushed its price up by more than 4.5% in the last 24 hours. At the time of writing, it was trading at $3,111.72 with a market cap of over $373 billion.\n\nLike ETH, BNB and Solana [SOL] also turned bullish as their values surged by 3.6% and 5%, respectively. At press time, BNB was trading at $586, while SOL’s value rested at $145.2.\n\nHowever, it was surprising to note that despite the recent price upticks, investors’ confidence in these top altcoins remained low. AMBCrypto’s analysis of Santiment’s data revealed that ETH, SOL, and BNB’s weighted sentiments all remained in the negative zone.\n\nHowever, the good news was that Ethereum’s open interest rose slightly along with its price. A rise in this metric is usually a sign that the prevailing price trend is likely to continue.\n\nSOL’s open interest took ETH’s lead as it registered an uptick as well. On the contrary, the same for BNB fell, despite its price recording an uptick on the charts.\n\nAMBCrypto then analyzed ETH’s daily chart to see whether it could sustain its bull run. We found that its Money Flow Index (MFI) went sideways after an uptick, while its Chaikin Money Flow (CMF) moved south.\n\nThese suggested that investors might not see ETH’s price rise explosively in the short term.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nSimilarly, Solana’s technical indicators looked pretty bearish too. Both its MFI and CMF went south, indicating that the token’s rally might not last.\n\nConsidering these data sets, it will be interesting to see how soon a fresh altcoin season comes along."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPYVdkc200RG85ZloybkJPTU4xa0Y0ZnNTckVTQ2J4eThTTGhZTUVaMzFpR3l1NHVSWE5tV1d2OXpYaG5oN2Vkb2J2VUJ0QW91clBwSFFkT2pTLU5DOUs2bldzZVF0eFo1NmdYTFlmWDBmMkZJanYzdVp1ZlYyT0ZRWWQ2MDdaTFQ1YnpSSjNEeHZNTE8wRDlIX3dlbVlIV1Brb0NncWxHU19rZENKQ3JVVFJ4b1I4dzJreXNMenhicDl2SURzRDlOU0F1bXBPa3JuenkwOER2bGhBdWw3NXUzVmJUc2lvRUFX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Lose Ground, Cannot Back Up Friday's ETF Flows Inflows: 'Bitcoin Is The Escape Hatch' - Benzinga",
        "content": "Cryptocurrency markets could not continue their uptrend initiated by surprisingly strong ETF data on Friday.\n\nWhat Happened: Major cryptocurrencies are trading lower at the time of writing:\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.18% $63,119.77 Ethereum ETH/USD -2.5% $3,065.67 Solana SOL/USD +4.8% $153.09 Dogecoin DOGE/USD -3.1% $0.1571 Shiba Inu SHIB/USD -3% $0.00002399\n\nNotable Statistics:\n\nIn the past 24 hours, 66,592 traders were liquidated. Total liquidations tallied $189.94 million, with $158.2 million coming in the past 12 hours.\n\nBloomberg analyst Eric Balchunas points out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.”\n\npoints out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.” Total exchanges outflows witnessed a significant drop from $883.03 million to $453.2 million in single day.\n\nMichael Saylor's MicroStrategy holds 214,400 Bitcoin, worth $13.6 billion, which is more than any country.\n\nNotable Developments:\n\nTop Losers:\n\nCryptocurrency Gains +/- Price Bonk BONK/USD -6.4% $0.00002507 Conflux CFX/USD -5.3% $0.2195 Nervos Network CKB/USD -5% $0.01819\n\nAlso Read: Sell Bitcoin In May And Go Away? Here’s How How You Could Have Pocketed A 1,449% Cumulative Return\n\nAnalyst Notes: Heavily followed Bitcoin expert Max Keiser, in his latest tweet, commented how the U.S. is “killing the dollar” through a Bitcoin speculative attack. He wrote that the U.S. economy is no longer competitive and Bitcoin is “the escape hatch.\"\n\nHow the US is killing the $USD via a #Bitcoin speculative attack.\n\n\n\n1. The US economy is no longer competitive, thanks in part to the presence of #Bitcoin — and the gov is filling that hole with money printing.\n\n\n\n2. Money printing is driving up inflation & interest rates;… — Max Keiser (@maxkeiser) May 6, 2024\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Bitcoin ‘Could Still Have A Correction Down,’ Cautions Lark Davis: ‘Let’s Not Get Ahead Of Ourselves’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBZV3I4elNkVUNqenN0TzRZZGtFMXgyZUtocDhqdEpMWUJIcGJ4aE9jdUVlUzlLdlZpWFpadU5pdVlwRVg0amdROTgyUy05SlFFYVc0M01PMXZZRE9uQWdPbnFZeDE0MWRsTlN6WEhZSmpJcWduSnMwbWhXRznSAYQBQVVfeXFMTlZoMVJJSGduRlRqSVUxWEx0OVFkM0Y1TlRMZkJ1MmZsRHRCMGp2LVJ6TkQ2VmplaVowb2p1Q09PTzNIaGtrazFiTlBaOVlMRDRjdWt4OWN6MWY0OVVEMklUMlhTbG1tX3JkSlVyd01BelhCRkk1dlNIcFd2ZmViY2czWlVa?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Solana Price Jumps Nearly 5% as Bitcoin, Ethereum Lag Behind - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt's been a quiet Monday morning so far near the top of the cryptocurrency charts, as most of the biggest coins by market cap are trading either sideways or slightly down. Solana is the notable exception, rising nearly 5% over the past day.\n\nSolana is currently trading at $154, pushing its weeklong gain to over 12% per data from CoinGecko. Like many cryptocurrencies, Solana has had a rough month, swinging from a high of $184 to a low of nearly $120 during that span. But it's been ticking back up over the last week as gains outpace those of Bitcoin and Ethereum.\n\nThat's true over the last 24 hours as well, with Bitcoin sitting at a price of $63,650, down over 1%, while Ethereum is down over 2% to $3,092 as of this writing. Over the past week, Bitcoin is up by 1.3% while Ethereum remains down by 2.6%.\n\nExpanding out to the top 100 coins by market cap, a couple of the biggest gainers are also deployed on Solana. JUP, the token of decentralized exchange aggregator Jupiter, is up 6% today to a current price of $1.14, while meme coin Dogwifhat (WIF) is up nearly 5% to $3.43.\n\nAD\n\nAD\n\nSolana's recent revival also comes as the network sees a surge in new tokens deployed via the network's SPL standard. On Saturday, 14,648 new tokens were deployed on Solana via data from Solscan, setting a new all-time record, and every day over the last two weeks has yielded at least 10,000 new tokens on the network."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQb3FqU0VnTThMT0xKbXQyWi0xYi1KdjlLbmtqaFJlX0RRN2JoS09iYmtxT2VzOWQ2ZFdnNko2ODJwamt2cW1NYUZ0anJnTUotMU5Oalh2a2c4VWNVNE82VVA4bjd6NGltSm84X0doajlZcDhUUDJ5M3BTcnlzZk1lekJ6eFA5Y3pwODFOVnVXQVNEaE83eUdkNnIwQWdNOXNKLXVLbnZZN1phZ9IBsgFBVV95cUxOcGtIeHVDVHFsdlRRZEllNzQ3blM4UWRRZDJFeWdaaER4NHQ5MFZBMm0zMFY5NjFqMU9JMkxwNEd6WkFEZVFSZ0FzZF9fOHVjVGJyYkZtazJWY2dSMDZKMUp5eWczdWFTTm01aHNHdDJIbFc3RDRaU0l6SW9rc1plTkw4aHBIUV9adUtrS2tjdXEyX055OG4weEFKUFAwUDNuWDdKMjBmRHNfWFg1djVPaVV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum blockchain adds 267,000 fresh wallets beating two year record - Nairametrics",
        "content": "Ethereum has recorded a significant surge in new wallet creations, adding a staggering 267,000 new wallets to the platform. This recent influx marks the highest number of new wallets recorded in over two years, signifying a massive resurgence in interest in the Ethereum ecosystem by crypto users.\n\nAccording to Merkle, the news of the record-breaking number of wallets followed the surpassing of the $3000 threshold by Ethereum in the last twenty-four hours as the crypto asset which is currently the second largest cryptocurrency is trading at $3,133.\n\nIn other news, An Ethereum Initial Coin Offering (ICO) participant woke up from an almost 9-year dormant period to transfer 1,960 ETH, equivalent to $5.87 million, out of their wallet.\n\nNotably, this individual had initially received 1,969.488 ETH, valued at $5.9 million, during Ethereum’s Genesis ICO period, when the price per ETH hovered around $0.31.\n\nThe massive profit and Return on Investment by the Ethereum ICO receiver highlight the positive side of trading cryptocurrencies and the immense wealth that can be created by investing and holding the right coins.\n\nThe development captured the unique nature of the Ethereum ecosystem with significant price movements, record wallet growth, and intriguing wallet activities capturing the attention of market participants and analysts alike.\n\nWhat to know\n\nAn initial coin offering (ICO) is an event where a company sells a new cryptocurrency to raise money. Investors receive cryptocurrency in exchange for their financial contributions. It is a popular method for fundraising capital for early-stage cryptocurrency projects.\n\nThe Ethereum blockchain is unique because it enables building and deploying smart contracts and decentralized applications (dApps) without downtime, fraud, control, or interference from a third party. To accomplish this, Ethereum comes complete with its own programming language that runs on a blockchain.\n\nRecommended reading: Bitcoin and Ethereum resurge as interest rate remains unchanged in US"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTEx4NVhvdFktLXFLRkNPenB1d3NLWWNlQ3VpN2xxaTJQeTNKb2FrUkoxaDd6TEh5SnhvY0ZHTjYtWWJGTEZOdXNuWnIydXdvRFljZkRUemlXd2lvaUQyYi1uRjlDckJZVWdQZ2ZhRlBRQkdnRnlLU3lVQ0JxZFVoTW5tNWtKMlFPUmhfV0l1X29PTXVnekI5M9IBngFBVV95cUxQN054bTRaNGdWN0IyN1VTWF85UTNFYUhmaEdrTlhZOFBNejRuNnJtN1RocVBRZDAxQW5WM09OLWVPU0ZRaUlFZmE2bkh5SFpoSi1PZ2Y2c3p0dmJrV01RSDk2amxRZVVSTlRPMV9pTFlyMXdzbmVEVWNTd19xSFlNZDFlVDJ1TTZHS3VhLW5IRFhIZ1Y2SUkycndMT3RjZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Ethereum’s $35 million shake-up: How ETH’s 7% hike triggered a 2-month high - AMBCrypto News",
        "content": "ETH’s price appreciated by over 5% on 3 May\n\nThis contributed to a hike in the number of short positions liquidated\n\nEthereum’s [ETH] 7% price rally during the intraday trading session on 3 May caused short liquidations on its derivatives market to rally to a two-month high, according to Coinglass.\n\nIn fact, the on-chain data provider went on to reveal that on that day, $35 million worth of ETH’s short positions were liquidated. In comparison, long liquidations totalled just $7.16 million.\n\nLiquidations happen in an asset’s derivatives market when a trader’s position is forcefully closed due to insufficient funds to maintain it. Short liquidations occur when the value of an asset suddenly rises, and traders who have open positions in favor of a price decline are forced to exit their positions.\n\nAccording to Santiment’s data, the altcoin closed on 3 May above $3000 after trading below that price level since the beginning of the month.\n\nDerivatives market traders stay their hands\n\nStill extending its gains at press time, ETH’s price was up by over 5% in the last 24 hours. At the time of writing, the market-leading altcoin was valued at $3,104.\n\nHere, it’s worth noting that Coinglass data also suggested that the price rally has not instigated any significant activity in ETH’s derivatives market. In fact, trading volume in that market grew by just 2%.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nSimilarly, the coin’s Futures open interest recorded a minor 3% hike over the same period. ETH’s Futures open interest was $10.68 billion at press time. Furthermore, ETH’s Options volume cratered by over 50% during the period under review.\n\nOptions trading grants participants the right to buy or sell an asset at a specified date. Generally, when ETH sees a decline in its Options volume, it means that there is less speculation on its future price movements as market participants wait to see where the coin’s market might be heading next.\n\nA combined reading of the minor hike in ETH’s Futures trading volume and its declining Options volume suggests that the coin’s derivatives market participants have adopted a “wait and see” approach. Simply put, they are not placing significant bets on where its price might head next."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQbjFCaE43YjJGMElxYk5sQzRXMUlnUENGeUF5LXQteEdtTHFOMjhwdW12QjVmUnlyazZ6a0xwa2hIQUlpckFkXzdLNEhDTUdoS0ROckEwTklJNGt4Rmt0aEE4QkY4ejZqUndVUTZMMFRfX3hXZndTQ2pfc3M1Yno2YWlSR2N6Sjl1WXdRYkx4em1CUdIBlwFBVV95cUxQTDRodi11Z2VwMEJ2WHhENVAtQnJEbDhCRnNNdTlNbU5OLTV2eFJyNXc5RllDenpjSl8zQ0pKTTVFQVBIbUtXbEZRZkpLM2JyWjMyaFY5ZlZGcVhva05wS3hUV0JuU1lIMWVrSFNXNV9jUEdxbTJrZWtpSXQzdnM3enpDUEhoanVCNHNFckhxZWNhVmRYc29n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Breakout to Trigger 100x Altseason in Q3 2024 - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights The ETH/BTC pair has already signaled an inevitable reversal after recently reaching a multi-year low.\n\nA crypto super cycle is at hand fueling the entrance of institutional investors into the web3, led by Vodafone and BlackRock.\n\nThe debate on whether ETH is a security or a commodity has significantly escalated ahead of the spot Ether ETFs decision.\n\nThe recent approval of spot Ethereum (ETH) exchange-traded funds (ETFs) in Hong Kong has significantly rejuvenated the altcoin bulls. There are reports of possible approval for mainland China’s investors expected to tap into the Hong Kong-based crypto ETFs. Consequently, the total crypto market cap pumped over 2 percent to around $2.5 trillion on Monday.\n\nThe altcoin industry, led by Ethereum (ETH) price, followed Bitcoin (BTC) in a bullish recovery after being trapped in a bearish trend in the last five weeks.\n\nImpressive Preliminary Sentiments\n\nThe past few months have been a bee hive of activity for the crypto industry, led by the recent Bitcoin halving, the sentencing of former FTX boss Sam Bankman-Fried, and the resignation of former Binance CEO Changpeng Zhao.\n\nThe anticipated approval of spot Ethereum ETF in the United States has sparked further debate on the next adoption phase for the crypto and web3 space. Furthermore, the altcoin industry has led in real-world assets (RWA) tokenization, with experts forecasting billions of dollars proliferating into the sector soon.\n\nAccording to market data, venture capital firms raised more than $1 billion in April. Already, BlackRock helped Securitize raise $47 million to build a tokenization platform.\n\nWhat Next for Crypto\n\nETHEREUM PRICE UPDATE\n\n\n\n– Similar fractal as of Q4 of 2020\n\n\n\n– Breakout could happen in Q3 of 2024 as per historical pattern\n\n\n\nOnce it breaks out, the 100x altseason will begin with ETH leading its way towards $15,000. pic.twitter.com/F1Zr6mQeHB — Ash Crypto (@Ashcryptoreal) May 6, 2024\n\nAccording to a popular crypto analyst alias, Ash Crypto, on the X platform, the ultimate altcoin rally will be determined by Ethereum price action. The crypto analyst opined that the ETH price against the US dollar has been forming a similar fractal as the 2020 bullish breakout.\n\nIf Ether’s price reaches an all-time high in the third quarter, the crypto analyst believes the highly anticipated altseason will kick start and pump Ether towards $15k."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPM1JfN2Z5UWhmYklnYlhKcTlvVkh6ejBDSW5SVjlvaWllekcyQU5tNm1ISS1FTGxVOHhvRThzcnFlT0NyemxfSm02cFZoWFFUQ0lSa2hSTXJHX0swTVVxQVI4YU1oelc1VlVkZkhVRWZWdzlCLTRwQU5nMjkwY0MwVzZRd1A2d1hYZG0wbTdyaTNIckdUeDBScFBBS0dldERzeXJCTkh2WEo3eEpLRWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Crypto Price Update May 6: Bitcoin at $63k, Ethereum Crosses $3,100, Solana and TON Surges - Coinfomania",
        "content": "Online gambling is becoming increasingly popular and has ever-expanding capabilities thanks to the Internet. It encompasses a novel approach by utilizing virtual casinos with negligible or no drawbacks. Due to speedy transactions, security reasons, and added incentives, more and more players are preferring the use of Bitcoin. Most of the sites nowadays are bitcoin casinos, … Read more"
    }
]