[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQeTFUdXRTQllXYlRKM1ZpR3NCMHBuOGdEX3lGQ0N1TURBcHFaODJoRnh0QS1kbUdCbm12QXRFc0tDX0JwbDVYSGNuWDNuMkYzRVM1aWNPYWhTVTZ1UlgzWDBkWGRiYVlzOG0ycTNlM2Rwc1N4dk9NejhISGJBZEdSeEtZbGJDTURXZFRKcnlGZWdPSmZzelhuZXlEdFhKcEhFbDdBX0hZckE4WWRDZWNXYm1JT2VrWWJlMVRURjNpZzdwaEh3S1NPZFVhQkgySlRUZ3lpTXhXOGVKYVNSRE1LUzNqdGJMUEtVaUo1RjFXMXHSAfYBQVVfeXFMTkNhanpfWHpJajA3SUM3MWh1VEZTenlFaVhtYTZEVkZicHBsLVlsMXBScEowdnVheDNLUWFmcUpQOUtXRVRCeWJ0dUlVdXFQNnNPLTI3VWRKNkd5RUlYUzJzLVB5VEJQUl9zSmxzdFFvOHBVNmFqdnQya2JWVmpMVWo3a1I5T0M4QlFzQkRYX2swZE9nVS0teExaNFJiV0RzTWdOcmQtMG1Ld1RTcEpsTTZRbjF0dlpzNkEyZUZycUZLbHZmNUN4OTBUNDA1WGd1eVFwQU1tM2ZKZ0pzZk5WZ0xDOGlOZEJILU94QVFNTnQwSWw4Ti13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "‘It Can Be Said With Confidence the SEC Is Investigating Ethereum’: Consensys’ Bill Hughes Talks Crypto Law - CoinDesk",
        "content": "I think they are. It’s hard because the policy space is pretty confusing. The subject matter is pretty confusing. Many people they need to talk to just don't care one way or another. I mean, I'm biased, I'm on the board of Blockchain Association, but it does a really good job of keeping its membership informed, educating them about the Hill and and coming up with smart plans on how to pursue what we view as productive policy ends. Crypto lobbyists aren't some monolith. But there are people who are very effective both because they know the Hill and because they understand fundamentally what the technology is, what it can do and how we can figure out how public policy can be brought to bear to address some of the risks."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE52VEZDOUxoQjdDOHFmakx3b293UHU3QW44VjA5ZjRCMjRtdlVRWWkwVWpGRDNlUzBrbmpOVHRXdDVCOHl6OXoxd1NybjdVcEdMMzcwYnJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "BlobScriptions: A New Type of Inscription on Ethereum - Unchained",
        "content": "BlobScriptions made waves in the Ethereum community as a new type of inscription, similar to Ordinal inscriptions on Bitcoin.\n\nEthereum blockchain underwent the Dencun upgrade in March 2024, introducing a concept called Blobs. Blobs are a novel data storage concept intended to lower transaction costs on layer 2 scaling solutions. While the concept was intended primarily to lower costs, some creators used blobs to develop “BlobScriptions.”\n\nRead on to learn what BlobScriptions are, how they work, and their similarities to Bitcoin inscriptions.\n\nWhat Are BlobScriptions?\n\nBlobScriptions are Ethscriptions that use EIP-4844 blobs to store additional data. Blobs, or binary large objects, were introduced to the network in the latest Ethereum network upgrade in March as a cost-effective solution for storing data on-chain. However, their ‘misuse’ is now dubbed BlobScriptions.\n\nTom Lehman and Michael Hirsch developed the concept by launching BlobScriptions.io, a platform enabling anyone to inscribe data onto a blob.\n\nTheir proposal, ESIP-8, was to use blobs to store data within the Etherscriptions Protocol, enabling data storage and allowing users to access blob data alongside other blockchain data currently utilized by the protocol.\n\nLehman said the idea was a means of democratizing blobs, making them available for everyone. For a fee of about $20, anyone, potentially including bots, can submit a BlobScription since blobs have made data storage on Ethereum 10x to 100x cheaper.\n\nHow Do BlobScriptions Work?\n\nBlobScriptions function similarly to Bitcoin inscriptions, allowing users to store various data types on Ethereum’s blobs, including images, text, and even tokens. Blobs are unique because they don’t interact with smart contracts, and nodes only need to store them for up to 18 days, making them cost-effective.\n\nWhen sharing data using blobs, one requires the content itself and the content type. Initially, data URIs were used to achieve this, but to make BlobScriptions cheaper; its creators implemented CBOR, which natively supports binary data.\n\nOnce the BlobScription payload is prepared, it needs to be split into one or more blobs, each consisting of 32-byte segments. These blobs are then sent as transactions to the Ethereum blockchain.\n\nThe Ethscriptions indexer, Ethereum RPC, and the Beacon API are then used to retrieve blobs. Using their versioned hashes, the blobs can be associated with individual transactions.\n\nAfter retrieving a transaction’s blobs, they can be decoded and concatenated into a single binary value using Viem’s “fromBlobs” method. This decoded data includes the content and content type, forming an “Ethscription Attachment,” also called a BlobScription. The indexer can then serve the attachment content via its API.\n\nRegarding the concern about blobs being removed from storage after 18 days, Ethscriptions indexers and other decentralized data stores retain the data, ensuring that as long as someone has it, the BlobScriptions can still be used.\n\nHow to Create a BlobScription on Ethereum\n\nTo create a BlobScription on Ethereum, follow these steps:\n\nStep 1: Visit the BlobScription Website\n\nYou need to first visit the BlobScription website to begin the process. Click on “Create a burner for me.” This creates a new wallet and imports the private key to a Web3 wallet like MetaMask.\n\nAfter importing, double-check if the displayed address matches your own.\n\nStep 2: Enter the Initial Owner\n\nThe next step requires you to specify the individual or entity credited with creating the BlobScription on the blockchain.\n\nStep 3: Choose a File\n\nYou will then select the data you want to store on the Ethereum blockchain via the BlobScription.\n\nStep 4: Create BlobScription\n\nClick the “Create BlobScription” button to finalize the process, and you have successfully created your first BlobScription!\n\nBlobScriptions vs. Bitcoin Inscriptions: Similarities & Differences\n\nNow, let’s look at the similarities and differences between BlobScriptions and Bitcoin Ordinal inscriptions.\n\nHere are some of the aspects in which they are similar:\n\nData storage purpose: BlobScriptions and Ordinal inscriptions allow users to embed data directly onto the blockchain. This data could include text, images, or any other digital content.\n\nImmutable storage: Once data on BlobSriptions and Ordinal inscriptions is embedded, it becomes part of the blockchain’s immutable ledger. Hence, the data cannot be altered or deleted.\n\nStill, BlobScriptions and Bitcoin Ordinal inscriptions have several differences, as outlined in the tale below.\n\nFeature BlobScriptions Bitcoin Inscriptions Blockchain Ethereum Bitcoin Data storage On Ethereum’s blobs On the Bitcoin blockchain Introduced After Dencun upgrade in March 2024 After Taproot upgrade Transaction type Data is inscribed onto blobs Data is attached to individual satoshis (sats) Cost Cost-effective as blob transactions have lower fees compared to calldata transactions Bitcoin Inscription fees depend on the size of the data being inscribed Permanence Data is temporary on Ethereum’s main network and may be preserved by external indexers Data remains on the Bitcoin blockchain indefinitely\n\nFinal Word\n\nMany Ethereum enthusiasts anticipate that the hype and use of BlobScriptions will be short-lived.\n\nAccording to Jim McDonald, co-founder of Ethereum staking provider Attestant, there’s an expectation that the pricing of blobs for layer 2 solutions will become more reasonable for their intended purpose over time. This could render Ethereum too costly for those seeking to utilize it merely as a “graffiti wall.”\n\nHowever, if BlobScriptions continue to gain traction or remain stable, the price of layer 2 solutions, significantly reduced by the March software upgrade, might increase more rapidly than anticipated. This could necessitate the development of new tools, and additional upgrades could be needed to lower the prices."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQcndPQi0yd2FnY0NXbm5xTVFFblJ1Rnl1U3doOWhjc0thRjk1SGxZN2JpaGdkUjdwSVEzaEVIdW92bzdSdDBQQ1Z0OVlfbU9DNFVmb1pHSnIyTGJFbTc4Y0lrY2pRdUs3ODRPWVlyc010QXhaekN2YlJBRkRaNGhUUnVBVTZWV0lwLUg3X3oxb3ZtZ09fNGtR0gGcAUFVX3lxTE9yWkxzcmV6LW1EdHRzTnFtcjVMUDc1ZklBZUp6eGVaTHhnaldMM3h2bTBXckhBZHR6a3lvMFpsNmdOQ1ZQZ0dYeDA3Qjk2UDJQSHdHQ1RGMzh4QU10d1RPSllVZEMySVBkSm5vaUI0WDA0bXhQMDFTY0o4cmNCNXczSC1jb18tWU45clM2WDZXV2J1Mk42ZGtobVhZeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Network Generated $370M in Profit in Q1, as ETH Reclaims $3K - CryptoPotato",
        "content": "It may sound counter-intuitive that a decentralized network can generate a profit, but that is exactly what Ethereum has done so far this year.\n\nAccording to an April 18 Token Terminal report, the Ethereum blockchain generated a $369 million profit in the first quarter of 2024.\n\nIf this level of profit is sustained, the blockchain could generate around $1.5 billion for the year.\n\n🚨 BREAKING: The Ethereum blockchain generated a $369.08M profit in Q1 ‘24. Wait, what?! How can a *blockchain* like @ethereum be profitable? Let’s go through Ethereum’s business model step-by-step: 1. Fees. All users on the Ethereum blockchain pay transaction fees in ETH… pic.twitter.com/gHAoNbRf48 — Token Terminal (@tokenterminal) April 18, 2024\n\nEthereum Blockchain Profitable\n\nToken Terminal explained that Ethereum’s revenue model is based on network fees, which are the gas users pay for making transactions. Gas costs spiked in early March but have now fallen back to yearly lows.\n\nMoreover, a portion of the ETH is burned and removed from circulation for every transaction. This accrues to the economic benefit of existing ETH holders since issuance becomes deflationary during times of high demand.\n\nThere are also ‘expenses,’ which is the issuance of new ETH to the network’s validators and stakers as an additional economic reward.\n\n“The difference between the daily USD value of the burned ETH (revenue) and the newly issued ETH (expenses) represents the daily earnings for existing ETH holders,” it explained.\n\nCrypto investor and Etherean Ryan Sean Adams said that Ethereum wasn’t like other blockchains. Over the past 18 months, Ethereum generated almost $1 billion in earnings, he added.\n\n“This puts Ethereum in the top 20 entities globally in terms of buyback yield at 0.23%. Ethereum is only 9 years old. ETH should be over $10k based on this alone.”\n\nNo, ethereum isn’t like the other chains. Ethereum is profitable. Over the past 18 months Ethereum generationed almost $1 billion in earnings. These earnings were distributed in a permanent token buy-back program called “the burn”. This puts Ethereum in the top 20 entities… pic.twitter.com/ZaGn3C6XVS — RYAN SΞAN ADAMS – rsa.eth 🦄 (@RyanSAdams) April 18, 2024\n\nOn April 19, venture capitalist Tomasz Tunguz told his 98,000 X followers that Ethereum “was the most profitable software company in Q1 2024.”\n\nEthereum generated $370 million in profit on $825 million in revenue for about a 45% net income margin, he added.\n\n“If Ethereum were to trade on the New York Stock Exchange or the NASDAQ, it would top the net income margin (%) charts, with Microsoft, Adobe and Veeva thereafter.”\n\nETH Price Slides\n\nNevertheless, ETH markets were getting no love last night, with the asset dropping below $3,000 for the first time in two months.\n\nHowever, the trend started to change in the following hours, and ETH, alongside the rest of the market, bounced off to about $3,100 as of now.\n\nStill, the asset has now retreated almost 25% from its 2024 peak and remains down 38% from its 2021 all-time high."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPejl0Y21LRENFaG9XQmloS3hqTDBTci1rSUJUb1ZCazhpaXhtWDZlRGN5dnBDZks5Z3hCcHBQU3RscE1hT0hMTFRYMGhLa2FnY1RqMElmV0dua19uV19oUUJaYVlJRTJXLVZ5S0c5X2p5SXdXRDZ3aVFmaXdpRk1lLUlLUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin vs. Ethereum vs. Dogecoin: Top cryptocurrencies compared - Yahoo Finance",
        "content": "After a rough 2022 and much of 2023, cryptocurrencies are booming again. Some of the most popular digital currencies include Bitcoin, Ethereum and (perhaps surprisingly) Dogecoin.\n\nWhile cryptocurrencies typically have a few things in common, what are the differences between these three popular cryptos? Quite a lot actually, and here are some of the biggest distinctions.\n\nWhat cryptocurrencies have in common\n\nCryptocurrencies are built using what’s called blockchain technology, which uses a distributed ledger to produce, track and manage a digital currency. Think of it like a running digital receipt of all the transactions in the currency, including a list of who owns what and how much.\n\nThis “receipt” is being constantly verified by a decentralized network of computers, helping to prevent fraud and ensuring the proper functioning and accounting of the currency.\n\nThe idea is to eliminate the role of a traditional central bank in the creation, distribution and transfer of currency.\n\nCryptocurrency is “mined” by powerful computers called miners that perform complex math calculations to create coins. They also earn coins by processing transactions of the currency.\n\nThousands of cryptocurrencies exist, and literally any number could be created using similar blockchain technology. Cryptocurrencies allow the user to move money semi-anonymously, though the FBI and IRS are getting better at tracking transactions and freezing accounts.\n\nKey differences among Bitcoin, Ethereum and Dogecoin\n\nWhen you first start learning about crypto, three names come up constantly: Bitcoin, Ethereum and Dogecoin. People invest in each coin for different reasons, and it’s a mistake to lump the three most popular cryptocurrencies together into a single homogenous group.\n\nThe table below sums up some key differences among Bitcoin, Ethereum and Dogecoin.\n\nBitcoin Ethereum Dogecoin Symbol BTC ETH DOGE Year developed 2009 2015 2013 Initial purpose Created to be used as a currency or store of value Created to sell processing power of the decentralized network Created as a joke spoof of Bitcoin and the doge meme Approximate market capitalization* $1.3 trillion $388.8 billion $23.5 billion Number of coins* 19.68 million 120 million 143.9 billion Maximum number of coins 21 million Unlimited, but issuance is fixed Unlimited, but yearly issuance limited to 5 billion coins\n\nPurpose of the cryptocurrency\n\nEach of these three cryptocurrencies was created for a different purpose. Notably, Dogecoin was a satire on the rising popularity of Bitcoin and the doge meme featuring a charismatic Shiba Inu. Meanwhile, Bitcoin and Ethereum were created for more quixotic and serious purposes, including laying the foundation and framework for the entire cryptocurrency ecosystem and facilitating transactions.\n\nStory continues\n\nMarket capitalization\n\nThe market capitalization of each consists of the total extant coins multiplied by the current trading price, and there’s a wide divergence. Bitcoin is the largest, with Ethereum trailing a distant second and Dogecoin among the top 10, according to CoinMarketCap. Traders cluster around the most popular cryptocurrencies and volume drops significantly below the top 20.\n\nWhile these currencies may be among the most popular for traders, Bitcoin is the one that’s emerged among the mainstream. It’s becoming easier to access Bitcoin, with multiple ways to purchase or store the currency including the recent approval of a Bitcoin ETF, which lets investors get exposure to the cryptocurrency inside a traditional brokerage account. Of course, traders can also turn to popular apps to buy many cryptocurrencies, too.\n\nCoin issuance\n\nIt’s also useful to note how many coins can be issued in each cryptocurrency. Many traders have flocked to Bitcoin because of its hard limit on issuance, just 21 million. If money continues to flow into Bitcoin and demand rises, this fixed limit virtually ensures that the price will rise over time. While that may be good for traders, the volatility makes Bitcoin harder to use as a currency.\n\nIn contrast, Ethereum’s issuance is unlimited, but it has a fixed issuance schedule, which may slow the production of new coins. Meanwhile, the production of Dogecoin is unlimited, which is part of the joke. That unlimited issuance didn’t seem to stifle the currency from skyrocketing in 2021, rising from about a half-penny a coin on Jan. 1 to more than $0.60 in May. However, the coin trended downward through the course of 2021 and well into 2022.\n\nBottom line\n\nIf you’re considering trading cryptocurrencies, it’s valuable to understand that they’re not all created equal. Some features such as Bitcoin’s limited issuance may make a currency more attractive than others, at least over a longer period of time. But in the short term cryptocurrency is driven by sentiment, so even something created as a joke and with unlimited issuance may rally hard if a swell of interest sweeps in. “Much wow,” as a famous doge meme might say.\n\n— Bankrate’s Rachel Christian contributed to an update of this story."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQNHJCdDJvcEtpU2lzMWM3V2xLaWpDS0pLTFJ1NXBzeUFYRUNsZklhTy0tcHpTMk1SV0JLTWxpUFBFUlozTjN3c191V3cwQzB3eFBYcU1WX2RKbUg2RWxIb3lWNGhUM1pwdTFmb3JhTmh3MHZNYkJka0gwMThIdFM4eHpWTVVOcW5NMEVoMHJEQWsxNlhXRHluQW1FbzY4MTNUaW9zMGlOclJTazMyRGdreUdva9IBuAFBVV95cUxOVklNQ0hGdVVBX2J6a3VuNEI2aXZ5SHp0OWRXQ1c1dkVvaklXZE9WYjZOYU5fRURuZ3RIU1V6LVJpUFQyZmVkVFVxSnJZUjk0YlFhUkM4Z3l5Tl9TMDNaWXpFeEYwbURvS2IyWkVtOFgtWmJIQkhhVUIzbmpfaVZlallHN0ZDRG8weDhTaF9hTml6YktrQzJJNU9PRUVQalhEVGVsZ3dLcVZjVnJvMzVRNGZoV2E0Tmg4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Drops Below $60,000, Ethereum (ETH) Says Goodbye to $3,000, Solana (SOL) Strength Disappears: Is Bull Market Over? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe Bitcoin roller coaster has taken another dive, breaking below the $60,000 mark and unsettling the market. This recent dip sees the cryptocurrency dipping its toes into the $58,000 territory, the least-expected move by the market. The fall through what many considered a solid support level at $60,000 is causing some panic.\n\nThis unsettling movement could have been seen as a dark cloud, but there is a silver lining that has the crypto faithful watching the calendar: the Bitcoin halving. Slated for around April 20, this event is historically known for shaking up the market in unexpected ways. The halving could tighten supply and potentially swing the pendulum back in favor of higher prices.\n\n\n\nLooking at the charts with a magnifying glass, we can see that Bitcoin's next support test lies at $58,572, just a stone's throw from where it is currently. If it fails to hold this line, the descent might continue toward the $50,319 area, where the next safety net lies.\n\nBut let's not write off Bitcoin just yet. If it can rally back and crack through the $60,000 ceiling again, it might just push back to its recent comfort zone. The first sign of recovery will be reclaiming ground above this critical level, with eyes then set on the $68,789 marker — a formidable resistance that could block the path to its previous highs.\n\nAdvertisement\n\nEthereum's farewell\n\nEthereum's slide below $3,000 is more than just a number — it is a signal. It tells us that the confidence that was pushing prices up is shaky. The drop has been steep enough to make even the staunchest supporters a bit nervous about what's coming next.\n\nWe have spotted some levels that could tell us where things might head. Right now, Ethereum is testing the waters below the $3,000 line. If it does not climb back up soon, the next floor might be around the $2,800 mark, a point that could offer some resistance to the fall. On the chance that Ethereum finds its feet again, watch out for the $3,200 ceiling — it is the next battle to win for recovery hopes.\n\nThere is a real chance that ETH could keep dropping, especially if it does not get back above $3,000 quickly. But with the halving in play, it is too early to count it out. A surge of inflows to the market might change the situation in favor of bulls quicker than anticipated.\n\nSolana remains suppressed\n\nSolana, the cryptocurrency that has been on many investors' watchlists, is showing signs of strain. After a period of growth, SOL has slipped through what was a strong support level at around $130, and now folks are worried. If prices keep heading south and pass below the $100 mark, it could spell real trouble.\n\nKey indicators that many traders look to for signs of healing, like RSI and moving averages, have been breached. Currently, Solana struggles to find a proper footing for the price.\n\nThe situation looks tense. With the support at $130 now a thing of the past, the next checkpoint is at $100.\n\nYet, not all hope is lost. There is still a chance for a turnaround. Growth could be around the corner if Solana manages to rally and break through resistance levels, particularly around $150, which could act as a ladder to climb back up from its current position.\n\nThe future of Solana is not set in stone. If it finds strength and pushes above these resistance levels, it might just regain its previous momentum. But if it continues to fall, the drop below $100 could be a hard reality check for the coin and its investors."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNWVl6N2JsU2dyRWpCMlo4Z1JDTVk0OFlXUFE3WTlUbXNDaDlTeDhKTUZuOE9GMnB3aHBJYkYzZ2dmQXpFRHVwZ3puZmtfWGVvOEJYM2FEakg2Z1MzYzdPNHczTFk3cXZyWUdDbkRtVHgtcG9pd09iVUFiSkJtZHBsbFJycV8ySndGaExVZS1TemVNZ9IBmgFBVV95cUxQeERlS3hnV2tCekF2SVJiQ0h4eER4VkVwSVNWc281bV9jcTJBa1VwZjdlWmJKYVgtdHd2Z2lfMUdWRTN5M1RHR0Y5dHA3VkpCVVVsOGRwbDdxMVlsOTJkdllncjZNSXhmQkJzaUw1WjRydElXbTdtcFBMaU1mVk5wd2pKSVM3NHd3bkFTQll6dTdCVzlkb29DSzJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Peter Thiel-Backed Ethereum Layer-2 Launches Liquidity Program - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLayer N, an Ethereum layer-2 network backed by Peter Thiel's Founders Fund, has launched a new liquidity program for apps built on its StateNet architecture.\n\nLayer N first came out of stealth in September 2023, when it announced it had closed a $5 million funding round backed by Founders Fund. Now Layer N says its new liquidity program marks a milestone in efforts to introduce sustainable and robust liquidity into the DeFi space, targeting protocols at their nascent stages to aid in their market entry.\n\nDigital finance firm Amber Group will be the first participant in this program, contributing a significant $20 million to help empower partners within the Layer N ecosystem. This collaboration underscores the program's intent to furnish developers with the necessary tools and funds to innovate and rival traditional financial institutions.\n\nDima Romanov, CEO and co-founder of Layer N, hailed the launch as a pivotal moment for the company and the broader DeFi landscape.\n\nAD\n\nAD\n\n\"By providing seamless access to liquidity and equipping developers with essential resources, we are setting the stage for a new era of innovation and growth in the DeFi sector,\" he said in a press release.\n\nSteven Shi, investment partner at Amber Group, said he regards Layer N as the premier architecture for DeFi applications because it is \"merging top-tier crypto infrastructure with high-performance capabilities without compromising Ethereum's security or fragmenting liquidity.\"\n\nHe emphasized Amber Group's commitment to supporting Layer N in fostering liquidity and expanding the ecosystem.\n\nThiel's Founders Fund has had a busy 2024. The fund participated in a $280 million Series D round for Neuralink, an Elon Musk-backed startup that's focused on brain hacking.\n\nAD\n\nAD\n\n“Excited to support Neuralink’s next chapter of helping human patients in need,” Scott Nolan, partner at Founders Fund, subsequently posted to Twitter at the time. “The team has been working for seven years to make this possible, pulling off technical breakthroughs that feel like science fiction.”\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Stacy Elliott."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOR2xSY3lfX3QzZkozU2VqMEVvSGlXbEhuQzRjTlVrX0RUbEFCNVBYX0MzZnFDUURoZ3pWZU9aNEJXYUVLZnQ0eW5GOG1TMVdaVWMxT0ZyMVFIVUdzVm1zeFRsQTl4bTg0VWpDSWc4dS1JZkFSUmZncHYxcHNRTV9yajh0Yi1JQmJSbGVTOTNkTXdKbzJqcTVDT25rbkJwNzUzbTREdHR5UG5UV0RzUUFtRnZGVFd5TEJNZGlwTEc1OUNzc0k5T1JSOFRIZDR1T054c0JsV2RZWl_SAd4BQVVfeXFMUEZtamFmaXhnMVdLOWg2OTVqUzZ4eS0zUEFhMk01RDNMR0NaeGZQMDBOSV9HQXRTUGZoamZudVNCQ3phd19LZi14djVGVnl0Ynl6QzJoQjdOODk4X1dFRGNWRHVSQjgxNEc4TDJVLUlBZmlEX0k5cVFLWk5Db215M0Z5UFBKUnROTU41ZWJnTkxpWnRBNU5YczhlVi0yMXZGQnI3V2piZDlqLVFaQTltd21VQWE2cTljTlk5czFJeW44d25QNUdETFhUXzQwUWlvS25xUlBCUkp5Z05lMkpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Primed To Bleed Against Bitcoin for Longer Before Bull Phase Sets In, Says Benjamin Cowen – Here’s Why - The Daily Hodl",
        "content": "Cryptocurrency analyst Benjamin Cowen is expressing bearish sentiment on Ethereum (ETH) relative to Bitcoin (BTC) over the short to medium term.\n\nIn a new video, Cowen tells his 799,000 YouTube subscribers that the Ethereum/Bitcoin (ETH/BTC) pair has further room to fall.\n\n“My base case at this point in time is that Ethereum/Bitcoin bottoms this summer, Ethereum/US dollar bleeds a little bit longer and then at some point later this year or early next year the Federal Reserve will turn the money printer back on. And then you will see a bull phase for the Ethereum/Bitcoin valuation. But I don’t think we’re there yet. I don’t.”\n\nAccording to Cowen, the ETH/BTC pair could fall by up to 38% from the current level as Bitcoin’s dominance level rises.\n\nETH/BTC is trading at 0.04869000 BTC ($3,070) at time of writing.\n\nOn when exactly the ETH/BTC pair could bottom out, Cowen says,\n\n“June, at the earliest, is my guess that Ethereum/Bitcoin bottoms out. June at the earliest. About mid-June…\n\nBut it’s also going to be dependent on monetary policy. If we get to June and the Federal Reserve is still not cutting rates and they’re still not going from quantitative tightening to quantitative easing, then it might go on longer.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPQnVKaDFKeU9OZVp5Z2lQMXZTeDN6TnQ5OGhIUFNNdzBfak5GQ3AwR0hlUDNsaURQRnh6STZ6ME9ualhHOWo1U2FkbXZhaG53M2p4cWRUdFgyWWR1ZVZTMUxtWFJ3LV9fbnR4ZldRMkpnMlhHdW91MjFhczZJNVNzYklVaWw3dXBrcU00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "The DeFi Report Releases the Ethereum Network’s Q1 Earnings Results - Yahoo Finance",
        "content": "BOSTON, April 18, 2024--(BUSINESS WIRE)--The DeFi Report released the Q1-24 Issue of The Ethereum Investment Framework today in collaboration with Artemis Analytics and invites investors, analysts, web3 natives, and other interested parties to download the document and listen to the quarterly \"earnings call\" via The Signal Podcast on Thursday, April 18.\n\nAll interested parties can download the Q1-24 issue on The DeFi Report website, thedefireport.io, by clicking on The Ethereum Investment Framework link on the homepage. The Q1-24 \"earnings call\" can also be accessed via thedefireport.io on Thursday, April 18 at 2pm EST.\n\nAbout The DeFi Report\n\nThe DeFi Report, headquartered in Greater Boston, provides industry-leading research, market insights, and onchain data informing fundamental analysis of crypto networks and protocols.\n\nAbout The Ethereum Investment Framework\n\nThe Ethereum Investment Framework is a flagship quarterly report distributed to thousands of investors, analysts, asset managers, financial service providers, and web3 natives globally. The report provides comprehensive coverage of Ethereum and its surrounding ecosystem from a data-driven perspective — and is written in a non-technical, approachable way that traditional investors can appreciate.\n\nReaders can expect to gain insights on Ethereum’s value proposition, business model, financials, operating metrics, valuation metrics, historical performance, use cases, correlations, and much more.\n\nAbout Artemis\n\nSince launching in 2022, Artemis has emerged as a premier institutional data platform for digital assets. Delivering insights across 25+ blockchains, Artemis stands out as the definitive data science layer for crypto fundamental information. From sector-specific metrics to real-time developer engagement insights, Artemis ensures that users are equipped with the most comprehensive and customizable digital asset data available. With its wide availability of data ingestion choices, from Excel integrations to Snowflake Data Shares, Artemis is the data platform of choice for global financial institutions and investors.\n\nGiven that large asset management firms have begun issuing tokenized funds on Ethereum and the potential for an ETH ETF in 2024, now is the time for investors and service providers to learn about the Ethereum Network’s potential as a new asset/accounting ledger for global finance.\n\nDownload the Q1-24 issue of The Ethereum Investment Framework here.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240417358783/en/\n\nStory continues\n\nContacts\n\nInvestor & Analyst Contact:\n\ninquiries@thedefireport.io\n\nMedia Contact:\n\nMichael Nadeau\n\ninquiries@thedefireport.io"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQUjN0RVd2ZC11RG5GblgzeC15X3NVeDQwbXZfMGF6QXJBdmNma1FPTWs5dTQ1UXgzLTFBaU9CSnk0SU5rck8tWDVKNEZXd2JJNE11Q3k1SWV3RDY3ejYwNHVtbzl0QXNFWHE0dElMbXA0aDRBcFJrTG5iWm1SV3pFcnluSlhMRHVWN0x0NkM4THByRVHSAZsBQVVfeXFMUHdGbzN4cUJZS0tkbTQxc3RJS2RWVEdsQWNrUW1MR3VicG9PSGJHaklaSG9ZYjNoYm1oWWdFMnBKeVBkYV8tZk9VWG1SOUpiVnhnRGdxS2hhZG11eDA4V25ZMWQ4QUcxQmlWSU1vOThQTUhqd09yd3ZvMTFhR0RFWHItcmJLbFJ3RFI3YWs4Ni16V3pibDFMdzlhaEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum ETFs in Hong Kong Could Lead to 'More Progressive' Policies in China: OSL - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAt the start of the week, spot Bitcoin and Ethereum ETFs were conditionally approved in Hong Kong. Alongside this news, digital assets platform OSL announced it will be a “sub-custodian partner” for both the China Asset Management, also known as ChinaAMC (HK), and Harvest Global Investment ETFs.\n\nLooking forward, OSL's CEO believes that these ETFs could lead to a wave of “more progressive” regulation in China and potentially cause a ripple effect across the region.\n\n“[It] is likely to set a precedent for other financial markets in Asia,” Patrick Pan, Chairman of the Board and CEO of OSL, told Decrypt. “For China, this development in Hong Kong solidifies Hong Kong’s place as a unique financial center for innovations and may influence future regulatory considerations and market openness towards crypto, potentially leading to more progressive policies aligned with global standards.”\n\nChina has a long and rocky history with cryptocurrencies—effectively banning crypto multiple times.\n\nAD\n\nAD\n\n“Presently, there are rigorous regulatory controls over cryptocurrency transactions, expressly prohibiting the operation of cryptocurrency exchanges within its territory,” Thomas Zhu, the ChinaAMC (HK) head of digital assets and head of family office business, told Decrypt.\n\nBut with Hong Kong's status as a Special Administrative Region controlled by China—which has been called a ‘testing ground’ for China—its financial decisions may set the table for future movements on mainland China.\n\nLooking at the wider continent, both firms see the approval of spot ETFs as a catalyst for regulatory evolution.\n\n“It may prompt regulators to accelerate their own frameworks to accommodate such products, which may lead to a broader acceptance and deeper integration of cryptocurrency into the Asian financial landscape,” Zhu said, “potentially setting the stage for a new era of digital asset trading and investment in the region.”\n\nAD\n\nAD\n\nHowever, crypto-friendly countries like Japan, South Korea, and Singapore could be the first to be influenced, Zhu suggested.\n\nThe United States approved spot Bitcoin ETFs in January—11 years after the first application for a U.S. Bitcoin ETF was filed. This is a stark contrast to Hong Kong’s process, which OSL said has only taken four months.\n\n“In the U.S., where the legal framework and regulatory landscape have been highly fragmented—and at times, vulnerable to highly polarized political cycles—the journey for spot crypto ETF products has been far more arduous.” Pan told Decrypt. “Hong Kong’s framework has managed to prove once again that it can be mobilized quickly to innovate, while ensuring robust investor protection, setting a benchmark for crypto-related financial products in Asia.”\n\nDespite this, the U.S. still beat Hong Kong to the punch. That means Hong Kong regulators and potential ETF issuers have been able to study the impact that spot crypto funds might have on the market. One primary lesson: ETFs significantly drive demand. The firms that spoke to Decrypt think it will be no different this time around.\n\n“We anticipate a similar uplift in Hong Kong,” Pan said. “Given the structured and familiar investment mechanism of these ETFs, akin to those in traditional finance, they are likely to facilitate education and adoption among local investors. This positions the Hong Kong market to potentially experience substantial growth, tapping into a deep well of enthusiasm and capital.”\n\nWith Hong Kong’s population a fraction of the size of the U.S., its impact on the wider crypto ecosystem is likely to be less pronounced than January’s spot ETF approvals. But the ripple effect it could have on China and the rest of Asia may dwarf anything the U.S. could muster.\n\nEdited by Stacy Elliott and Andrew Hayward"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNcHZhYlZKOXVjMTNMdktIRG90MklwRE5tOFU2LUtDLXF5SGM2TkpoeEQ2dzNZaVJtOHVGNTZfWkFiaGdZc1dsb2RqWEd2a0Q3SW9wVnZuTHd0LXhZb2ZMOXQtanRkTzNHU2hPMk9CZUpPN0xxdjg5MDZsdHRKZDhhaEZVUnVRdThMSEpoVXE0SGdKMnJFdVVJb1JiQU44T1RKNGVvVlNySjJuYmlGSkVkUXhoMk03UVRPM2tJ0gHAAUFVX3lxTE1McEtJMzlPTHpIT0hkOVRBanZrb0RfRTBaMGpaZ3dUa1E3c1hhSFRIcTg4YnhqTGNNYkp2UGxJdG9ZZzJpNkJ2dHQ4SlpnRFlyTGpGaEpNa25QZkE5UjVZWjl4a3p2QW5MamxlTVJUVXFLaDNFQlpSb2t2VXRzX2ZfLWF1N3g1b19fVUl6WmdpWHFSNnVkNWhKU3dzX2hxUjJ1UXNka3l6bFdzTkd1b0Y5SVUwX1B5MTVxRE5MZWhiSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Whale Who Bought Ethereum at 2022 Bottom Sends 5,000 ETH to Kraken: Lookonchain - The Daily Hodl",
        "content": "A crypto whale that bought $151.42 million in Ethereum (ETH) near its market cycle bottom in September 2022 appears to be taking some profits, according to the digital asset tracker Lookonchain.\n\nLookonchain notes that the whale withdrew 96,638 ETH from Coinbase at an average price of $1,567 between September 3rd and Sept 7th, 2022.\n\nIn early March, the trader deposited 15,000 ETH worth around $57.3 million to Kraken, and on Tuesday, they sent another 5,000 ETH worth $15.4 million to the exchange.\n\nThe whale still holds 76,638 ETH worth roughly $230.5 million. Between realized and unrealized gains, the trader has profited nearly $152 million on their initial $151.42 million ETH investment.\n\nETH is trading at $3,005 at time of writing. The second-ranked crypto asset by market cap is down nearly 15% in the past week.\n\nLookonchain also notes that Tron (TRX) founder Justin Sun withdrew 196 million of the top stablecoin USDT from the crypto exchange HTX and deposited it into Binance on Tuesday.\n\nIn February, Sun revealed publicly that his HTX account held 28,613 Bitcoin (BTC) worth about $1.62 billion at the time.\n\nHTX is the rebranded name of Huobi, the Seychelles-based trading giant that Sun says he’s an “advisor” for.\n\nIt remains unclear whether Sun has an actual ownership stake in HTX, though he’s reportedly used hundreds of millions of dollars of his fortune to back the exchange.\n\nSun said he revealed his BTC holdings in response to critics accusing him of not being an active user of HTX.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQdWoyeS0xSk52cHdBYkRKbUNUaDdMa3pUMy1tblROSFhUeGJnTlZncTBBamljX0ZaOW5zUEhENlgtZzRFU1FwdXJFdk5XaW1lRk1pNEtlaElIVTRqOGg5elB6MHNYU3N3MFl2c1FxY1ZwR1lxbDRTNmxhd1p3UExOQ0hsQlZZdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Faces Uncertain Rally, Ethereum (ETH) Dips Amid Whale Moves, Furrever Token (FURR) Offers Up to 15X Returns - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 19, 2024 (GLOBE NEWSWIRE) -- As the cryptocurrency landscape constantly evolves, investors and market observers are closely monitoring several key developments that could shape the sector's future. Among these are Bitcoin's upcoming halving event, Ethereum's current price fluctuations due to significant whale activity, and the rise of new players like Furrever Token (FURR), which seeks to carve out a niche with its unique approach and potential high returns.\n\n\n\n\n\n\n\n\n\nJPMorgan Cautions Against Expecting a Bitcoin Rally Post-Halving Event\n\nAs the cryptocurrency community braces for this year’s Bitcoin halving event, scheduled around April 19-20, JPMorgan has issued a less than optimistic forecast. Contrary to the significant price surges that followed previous halvings, the banking giant predicts that Bitcoin might not only fail to rally but could potentially see a decline in value.\n\nIn the past, Bitcoin halvings have been pivotal moments that typically led to bullish market behavior. The process involves halving the reward for mining Bitcoin transactions, thereby reducing the rate at which new Bitcoins are generated. This mechanism serves as a counter to inflation within the Bitcoin ecosystem. Historically, such events have boosted the cryptocurrency's market price significantly within a year of occurrence. For instance, after the 2012 halving, Bitcoin's price increased from $12 to $135 over the next 300 days.\n\nHowever, this year's scenario presents a unique backdrop. According to JPMorgan’s analysis, the current market conditions are \"overbought\". Bitcoin's price, hovering around $61,200, is well above the $45,000 mark when adjusted for volatility in comparison with gold. This elevated baseline, combined with the peak price reached a month before the halving—a first in Bitcoin’s history—suggests a different outcome might be unfolding this time around.\n\nAdding to the cautious outlook, Goldman Sachs has also advised prudence. The firm highlighted the unpredictable macroeconomic factors currently at play, which could influence Bitcoin's performance differently compared to past cycles. Despite previous patterns of price appreciation post-halving, Goldman Sachs warns against assuming similar outcomes this year, given the distinct global economic conditions.\n\nThis tempered expectation marks a significant shift in sentiment among financial giants regarding the crypto market's behavior following the halving. As the event nears, the cryptocurrency community and investors are keeping a watchful eye, prepared for a range of possibilities that diverge from the historical norm.\n\nEthereum Price Volatility Continues as ICO Whale Offloads Significant ETH Holdings\n\nThe Ethereum market is currently experiencing heightened volatility, underscored by a recent 4% drop in price amid broader crypto market fluctuations. This latest dip has triggered a wave of speculation about the future price movements of Ethereum.\n\nKey to the current market unrest is the activity of an ICO whale who has significantly reduced their holdings, selling off 2,000 ETH for 6 million USDC at a rate of $2,997 each. This move comes after additional transactions where the same whale offloaded 5,110 ETH on various platforms, with the price per ETH approximately at $2,545. Despite this large-scale sell-off, the whale still possesses about 29,700 ETH, which currently values approximately $89.4 million, held primarily across staking platforms.\n\nAdding to the market’s unease, Whale Alert has flagged more Ethereum moving towards exchanges. Notably, an unknown wallet transferred 10,806 ETH to Coinbase, worth roughly $32.13 million, followed by another transaction of 10,726 ETH to the same exchange, valued at around $31.90 million.\n\nThese substantial movements to a major exchange like Coinbase are raising alarms about potential further increases in Ethereum’s price volatility. However, amid these concerns, some analysts maintain a cautious optimism, buoyed by positive developments such as the recent approval of Bitcoin and Ethereum ETFs in Hong Kong, which may indicate a rebound or stabilization in the market soon.\n\nMoreover, with the cryptocurrency community looking forward to the upcoming Bitcoin Halving event, there is anticipation that this might also spur positive movements in Ethereum's price.\n\nAs the situation develops, Ethereum's current trading price stands at $2,978.31, marking a decrease of 3.45% from the previous day, with a trading volume that has risen by 10.77% in the last 24 hours. Despite this, Ethereum's price has seen a substantial 16% decline over the past week and an 18% drop over the last month, highlighting the ongoing uncertainty and the speculative nature of the crypto market.\n\n\n\n\n\n\n\n\n\nFurrever Token Emerges as a Strong Contender Against Established Cryptocurrencies\n\nIn the competitive world of cryptocurrencies, Furrever Token (FURR) is carving out a niche for itself with a current price of $0.000564 and promising features that could potentially outperform major players like Solana (SOL) and Toncoin (TON). What sets Furrever Token apart is its unique appeal rooted in the universal love for cute kitties, aiming to create a delightful and engaging experience for its users.\n\nThe charm of Furrever Token extends beyond its cat-themed aesthetics, encompassing a range of stickers, emojis, and visuals that enhance the user interface. This strategy not only enriches the community experience but also strengthens the bond among its members, fostering a welcoming and inclusive environment.\n\nOperating on the BNB-20 blockchain, the Furrever Token is designed with favorable tokenomics. About 65% of its tokens were made available during the presale, with the remainder distributed between decentralized exchanges (DEXs) and the development team. This distribution strategy promotes fairness and ensures the longevity and stability of the project.\n\nFinancially, Furrever Token is not just about the novelty; it offers significant return potential, boasting up to 15X returns which highlights its attractiveness as an investment. To secure its platform and user investments, the token has undergone rigorous audits, emphasizing its commitment to security and compliance.\n\nThe project’s dedication is further evidenced by its active community engagement and transparent communication, critical factors that contribute to its growing legitimacy and appeal as an investment.\n\nAs Furrever Token continues to evolve and attract attention in the crypto market, its innovative integration of fun elements with serious financial prospects positions it as a formidable alternative to well-established cryptocurrencies like Solana and Toncoin. With strong community support and distinctive features, Furrever Token is poised to make a significant impact on the future landscape of cryptocurrency.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNSjl1bkNBdDlNc3BaelJLN0xHTHRBeWx1em9mUXFKZkpuVVhvNjhvWi13RFZNbWo5NGtCWmxncUdDa1haVW5aZ0tIaE9XZXloYl80WmhaN25qU2tEMm5PV1o3YXlpdkNxU29jYV9sQU5vdDhvWmhkSmxObW15OHAtYUVVV01sSUdfMXlBZVg4VDR0VlhRaFRN0gGcAUFVX3lxTFBYcDg3SGh6Zlhwb1F3UE1ZNEI3aVI0ejZOcWxtZ210TWFDckxiVUdKdVVyR2F5TGJNcDJZeFNocDVBTFZJRTFVaWdwSm1PN0I4S0ZOZExiMFFfTVB2VFE1Y3BaRFdWTkJHZ29UUndGTjQ1cmxIU25BS3NJSVhaQ08wRV8tSWVoMmR0U2k0UjVfVVhLSFZfQlZ6QkRlbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Gas Fee Crashes to Three-Month Low, ETH Price Recovers to $3,100 - CoinGape",
        "content": "Earlier today, amid news of the escalating geopolitical tensions and the Israel-Iran conflict, Bitcoin and the broader cryptocurrency market faced severe selling pressure. However, this dip once again met with a strong buying interest from investors. With the Ethereum price dropping to $2,877 earlier today, bulls are staging a strong recovery once again to $3,100.\n\nEthereum Gas Fee Drops to 3-Month Low\n\nRecent data from on-chain analytics firm Santiment reveals a notable decrease in transaction costs on the Ethereum network. The cost of conducting a transaction on Ethereum has plummeted to $2.07, marking a significant reduction from the $15.21 recorded on March 4th during a period of heightened demand.\n\nadvertisement\n\nAnalysts at Santiment suggest that transaction fees on the Ethereum network often reflect prevailing sentiments within the cryptocurrency market. During periods of extreme bullishness, characterized by the belief that crypto assets are poised for significant price increases (“To the Moon”), transaction fees tend to peak. Conversely, during phases of pessimism when sentiments lean towards the belief that cryptocurrency markets are in decline (“Crypto is Dead”), transaction fees typically revert to lower levels.\n\nThis pattern of transaction fees mirroring market sentiment underscores the cyclical nature of cryptocurrency markets. Peaks in transaction fees often coincide with price tops for Ethereum, while periods of low transaction costs are observed around price bottoms.\n\nOn the other hand, Ethereum Layer-1 competitors like Solana have witnessed a huge surge in DeFi activity along with the recent meme coin frenzy. This competition has also led to network decongestion on Ethereum thereby keeping the gas fee on the lower side.\n\nETH Price Action Ahead\n\nEthereum made another attempt at recovery but encountered resistance near the $3,100 mark, reminiscent of Bitcoin’s struggles. Despite stabilizing above $3,000 initially, a bearish sentiment prevailed, pushing the price below this support level to briefly dip below $2,900. The bottom was established at $2,867 before a rebound ensued.\n\nCurrently, Ethereum is in the process of recovering from its losses, having surpassed the 23.6% Fibonacci retracement level of the recent downward movement from $3,278 to $2,867. However, it continues to trade below $3,100 and the 100-hourly Simple Moving Average (SMA).\n\nThe immediate hurdle for Ethereum lies near the $3,020 level, followed by a significant resistance zone around $3,070, coinciding with both the 100-hourly SMA and a key bearish trend line forming on the hourly ETH/USD chart. Further resistance is anticipated around $3,120, aligned with the 50% Fibonacci retracement level. A successful breach above $3,120 could pave the way for a potential upswing towards the $3,200 mark.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPaUlCbVg0bFZGRDBrbnczb0tUeUYtM3J1ZDRra3llR2tXVi00X2xmRE1nMTJFTjRxd1JPSnNNSHNGSXNPWnM5bTdmeG1ERkJDLTVOTGo3N0U1WEVXY3hJOXlaSXphU2dJamkzYkNMd1BwQmZvYUNYUGloeU5nMGVBU3FvdzlLajE2OWpNUmk5eVZ5MVZSYmM3OUs5d3VGaW9UazNteG9mdDBYYk1FT2s0T2tkTmNITmxxSlFRekRwQl9VanZkdE5DLdIBzgFBVV95cUxQRWp6QjhVQkZuMXZNOGxaSkhqblZ1eHVXRkdld2poTHhaRFF5YjBiT1UxZEE5QjBTNGVIMHpsdHZ6ZjBKRHRwWll0ZzFvTFI4UFdhdlpCRGs4UndpZzNvM05LWVFpbG1ST1lTRDR6cFhYZGltM19ramgycERqLTJIWEhQTmVnU1QtU2dXeFhZc2o1UXR4NWpmNHdmdGxxa09pT1MzT3FGdXd3WGV6V21WOVhIZnJHbHdmZ2NIa3F3ZXpmT2wxakFJRUlDQl80QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Ethereum aims for $1 billion annual profit as DeFi gains momentum in Q1 - Forbes India",
        "content": "\n\n\n\nEthereum is on track to reach a $1 billion annual profit, driven by the surge in decentralised finance (DeFi) activities and the network's robust performance in the first quarter of 2024. In a report by Michael Nadeau, an analyst at The DeFi Report, released on April 17, Ethereum's Q1 income reached an impressive $365 million, representing a 155% year-on-year quarterly revenue growth and a remarkable 200% increase compared to the $123 million profit recorded in Q4 2023.\n\n\n\nEthereum's fee revenue, generated through user transactions, reached a notable milestone of $1.17 billion in Q1, marking a 155% increase from the same period in 2023 and an 80% upswing from the previous quarter.\n\n\n\nMichael Nadeau highlighted key insights from the Q1-24 issue of The Ethereum Investment Framework, stating, “ ETH available on exchanges is at its lowest level since 2016, and ETH in smart contracts is at its highest level ever”.\n\n\n\nThis year, Ethereum's daily transactions have exceeded last year's figures and are nearing the peak observed in 2021. Over 1.15 million average daily transactions were recorded in 2024, showing a slight increase from the 1.05 million seen last year and coming close to the peak of 1.25 million transactions observed in 2021.\n\n\n\nSince its launch in 2015, Ethereum didn't achieve profitability until 2023, when it earned $623 million. Despite this milestone, its revenues were 75% lower than the peak of $9.9 billion recorded in 2021. Nadeau explained that this decline is largely attributed to the transition to proof-of-stake consensus in September 2022, resulting in an approximately 80% drop in token incentives paid to miners, now known as validators.\n\n\n\n“In terms of token economics, the network’s average daily issuance in Q1 was 2,498 ETH. This was offset by an average of 3,665 ETH burned/day resulting in deflation of -.09% for the quarter (annualised to -.38%)”, Nadeau further stated in the recent report.\n\n\n\nAdditionally, as of today, due to Israel-Iran tensions, Ethereum's price has continued to drop to $2865 overnight, posing a challenge to the $3000 resistance level. Over the past seven days, Ethereum has experienced a decrease of 12.17%, but today, before noon, it has seen a 4.42% increase, with ETH now standing around $3,100.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNbEdmb2Rva1Z0VUxVdGgyMlMwWDF5OXZLWTdVM25SSEI0M29JZ295S3RVR0FmeU4yRGpNeEIzczdWY19CaFlOSDc4b2hOeXBCTHJoT01CWS1ZNU9EVUZ5UG1GWTU4ZnBoSXNOSEI2QTMtQmNLYUtrdmFZWkJYTXlQOHNhMzlBYmVleVY3aDV0cXR2Zkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Liquid Restaking Drives DeFi TVL to $100B in Q1 2024 - Blockchain.News",
        "content": "Ethereum Liquid Restaking Drives DeFi TVL to $100B in Q1 2024 Luisa Crawford DeFi TVL nearly doubled in Q1 2024, reaching $98 billion, partly due to Ethereum's liquid restaking initiatives. However, a recent crypto market pullback has led to a decline to $86.6 billion.\n\nWhen compared to the previous quarter, the total value locked (TVL) in decentralised finance (DeFi) approximately doubled during the first quarter of 2024, indicating that DeFi has witnessed tremendous growth from the previous quarter. It is possible to ascribe, at least in part, this spike to Ethereum's liquid restaking activities, which have been the driving force behind the expansion of DeFi TVL prices. Protocols such as Lido and EigenLayer have been essential in this growth, since they have contributed to the widespread adoption of liquid staking and restaking.\n\nRecent study indicates that DeFi TVL experienced a significant increase from a low of $36 billion in the fourth quarter of 2023 to a high of approximately $97 billion in the first quarter of 2024. This is an increase of 81% and marks a high point for DeFi TVL that has been reached in the last two years. There was a modest rise in the TVL data that Messari gave, and he said that the amount of DeFi collateral climbed by 65.6% from the previous quarter to reach $101 billion. A number of factors, including the rise in the values of underlying assets and the implementation of liquid restaking, have contributed to the expansion of TVL.\n\nBoth asset price appreciation and liquid restaking were the primary factors that contributed to the increase of Ethereum's total value of assets (TVL), which was roughly 71% higher than before. Lido and EigenLayer are two examples of protocols that have played a significant role in the revival of DeFi TVL since its inception. On March 13, liquid staking TVL achieved an all-time high of $63 billion. This result was mostly driven by the Ethereum liquid staking protocol Lido, which now controls a market share of 62% of the liquid staking ecosystem. In addition, during the first three months of 2024, the liquidity restaking protocol known as EigenLayer seen a significant increase in both its popularity and its utilisation. The total value of EigenLayer's TVL reached $12 billion at the conclusion of the quarter, representing a stunning 990% rise. EigenLayer makes it possible to stake Ethereum several times, which results in increased returns.\n\nIn addition to liquid restaking activities, user activity also played a big influence in the expansion of DeFi TVL. This growth was not just contributed by liquid restaking initiatives. In the most recent quarter, QuickNode recorded a significant increase in user activity of 29.1% compared to the previous quarter, which has spurred expectations of a second \"DeFi Summer\". Despite the attempts of the SEC to regulate the decentralised finance area, there are indications that expansion and a paradigm change are on the horizon.\n\nHowever, the current retreat in the cryptocurrency market has resulted in a decrease in the value of DeFi TVL that has been seen. As this article is being written, the value of DeFi TVL has dropped by 11%, reaching $86.6 billion. The entire value of assets that are locked in DeFi protocols has been negatively impacted as a consequence of the larger market slump, which has cause this reduction.\n\nImage source: Shutterstock"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBOZHNveWVYVlBlcXNzTE1CTS1PUE9ubzcyb0F0TUZJdkxiaklFb0xYdHhWTmwxV1BsRHdiZzRnYzBEbEp4LVBWZWpJNE5MWno0Q2toTGM2T1Z4bk5Sd1J2ZGVSMmdkMjhVTFlrTnFlRVdyeDZCdWZoR3V30gF_QVVfeXFMTUp2MWlvUklxa3RDR2d2S1JfRGRRV1dpSEdRUFZqSnFHbjItUTNyU2hLQmtFd050eE5mQk50QmhqMG5UbTNBOVRfUnF6M3RYaVlJb28tamRQaE5NWlJaNVNKTVFHWm1ZWkFDNUlxNnNFTWk5U3NtNFhHSk5PNUFlUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Outranks S&P 500 Giants in This Key Metric - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) is leaping beyond its primary role as the second-largest digital currency by market cap as it is outpacing some S&P 500 firms in a unique metric. According to an update from crypto analytics platform Token Terminal, Ethereum is currently ranked 16th in terms of buyback yield.\n\nAdvertisement\n\nAccording to the list shared by the platform, Ethereum outshines some big names on the list, including Elon Musk’s electric car manufacturing giant Tesla Inc and multinational banking giant JPMorgan Chase. This feat shows Ethereum goes beyond just its role as a smart contracts enabler; it also has what it takes to compete when profiled as a finance-based tech entity.\n\nOne intriguing observation pointed out by Token Terminal regarding the impressive stat is that compared to the average age of firms on the list, which is 44 years, Ethereum is only about nine years old. While firms like JPMorgan Chase went live way back in 1799, Ethereum made its emergence in 2015.\n\n$200B plus finance & tech companies ranked based on buyback yield\n\n\n\nethereum ranks #16\n\n\n\nethereum is only 9 years old, when the median age of the other S&P 500 companies on the list is 44 years\n\n\n\ngoes to show how scalable & profitable Internet-native businesses can be at best pic.twitter.com/Brl0Uws60r — Token Terminal (@tokenterminal) April 18, 2024\n\nWith this difference, Token Terminal pointed out how lucrative internet-native business can be, especially when their respective innovations are allowed to gain free expression.\n\nEthereum changes Web3 game\n\nEvery company on the buyback yield list has something unique they bring to the table. The same holds for Ethereum. While JPMorgan is regarded as the biggest bank in America, Alphabet Inc., the company that tops the chart, is a tech and Cloud Services giant.\n\nEthereum operates as a smart contract enabler, pioneering a move for innovators to build decentralized applications that have helped it grow its decentralized finance (DeFi) Total Value Locked (TVL) to $92.74 billion.\n\nBesides Bitcoin (BTC), Ethereum is the second-most-backed crypto project in terms of whale holdings. While it is the de facto leader in Web3 adoption, it has a series of upgrades to enhance its functionalities in the market overall."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPcFBfTlpnTENsRWlfME9GTlAweGdCcWhLRXpWbXI0T2NteXdvZUxFc2UtUHFma0Q5MXRiWlhnMFozVVRNMEVkSHFhS0luanpLbmlKWTZZWVN3Sjk0a1FLdTlFM0x3Vlktc3poYTdhVE5Vb0o4TFlXQWZoUEZJZWJlU2dDU3dQbDNja1lvWlBZbjRLQmxGeHNTcXJGWk9NdTd2X292ZEdzQzJ5dWIxVjd4LW10ZVlnemxmak5iSlVxUdIBxwFBVV95cUxOV2RGcW1XM1lDelplWURFeS1JMkttTVAwWi1Pelo1MnA0RmpPaFdHLW5JU1lyZE9HYll5Ul9FNWZRX0l5ajloaTZDV1J6MmdsbEtoRzM5QWUyMldMajJsR09OVzduVjE3MTg0RE1MVnItT3cxOVNRLVh6N243aHFpdnhWc0k2XzJXWHllanpWTmNCRUZPNlNhMW9VMS01cWhMLUlBMDlnRmxMX001Nk1iSlRicjNkUzdPSDFWajVIbFVfV3RIWFJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Eyes All-Time High: Changelly Analysis Predicts Surge After Bitcoin Halving - Crypto News Flash",
        "content": "Despite Hong Kong’s ETF approval, Ethereum sees increased liquidations and bearish sentiment, with shorts rising by 54%.\n\nEthereum faces price volatility due to geopolitical tensions and regulatory concerns, dipping below $3,000 briefly this week.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, faced significant price volatility this week, briefly dipping below the $3,000 mark. This downturn followed a combination of geopolitical tensions and market sentiments surrounding regulatory developments.\n\nTensions between Iran and Israel contributed to market jitters, suppressing the positive impact of Hong Kong’s approval of a spot Ethereum Exchange-Traded Fund (ETF) as previously reported by Crypto News Flash. Investors exercised caution across the cryptocurrency landscape, with Bitcoin and other altcoins also experiencing losses. Notably, Ethereum saw a 20% decrease in risk reversals on Tuesday, indicating heightened nervousness among investors.\n\nData from Santiment revealed a surge in Ethereum liquidations, totaling over $81.9 million within 24 hours. Long positions accounted for the majority of liquidations, totaling $67.4 million. The largest liquidation, valued at $6 million, stemmed from an ETH-USD swap. Moreover, discussions surrounding Ethereum intensified after the Hong Kong ETF was approved, making it the most trending token among traders. However, bearish sentiment persisted, as evidenced by a 54% rise in ETH shorts.\n\nEthereum Foundation’s Issuance Reduction Proposal\n\nDespite recent developments, the Ethereum Foundation’s proposal to reduce ETH issuance garnered attention. Glassnode’s report highlighted ongoing criticism of the proposal despite clarifications emphasizing its aim to maintain Ethereum’s status as a form of currency and balance governance power within the network.\n\nGlassnode also addressed the rise of restaking and liquid restaking tokens, impacting Ethereum’s inflation rate and holders. These tokens, offering significantly high yields, facilitate a wealth transfer from non-staked ETH holders to staked counterparts. Consequently, there is a potential shift in the “real yield” and the role of money within the Ethereum ecosystem, potentially favoring projects issuing derivative tokens.\n\nAccording to a recent analysis conducted by Changelly, a prominent cryptocurrency data provider, Ethereum could experience a notable surge in price following the Bitcoin halving. Changelly predicts that on April 21, 2024, just one day after the halving event, Ethereum could reach a price of $3,171.61. This forecast has sparked optimism among Ethereum investors, who eagerly anticipate the potential for significant gains.\n\nChangelly’s analysis extends beyond the immediate aftermath of the Bitcoin halving, offering a bullish long-term outlook for Ethereum. By June 2025, Changelly suggests that Ethereum could surpass its previous all-time high and reach an impressive price of $4,964.07. Such a milestone would mark a new record for the cryptocurrency, signaling continued growth and potential for further appreciation.\n\nEthereum Struggles to Break Key Resistance\n\nETH’s price trajectory has been marked by challenges in surmounting key resistance levels, particularly the $3,200 mark. The cryptocurrency remains below this critical threshold, along with the 100-hourly Simple Moving Average, signaling persistent bearish pressure. Additionally, a notable bearish trend line has formed with resistance at $3,120 on the hourly chart of ETH/USD, sourced via Kraken.\n\n\n\nFollowing a brief period of consolidation, Ethereum experienced a minor recovery attempt, briefly surpassing the $3,000 resistance zone. However, this upward momentum was stifled as bears asserted control near the $3,280 resistance zone, resulting in a subsequent downturn. The price retraced below the 23.6% Fibonacci retracement level of the upward move from the $2,536 swing low to the $3,278 high, underscoring the prevailing bearish sentiment.\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQX3BFTm02VWNLTXU4QVI2aGYzYzZnZ0RmU0FMN0tBR0VQU1BNNTExdW8xUmZ5V0Y2cEtjMHhZQXVxdDIyX1BuaHB5LW1vcXRlUzBLZGNocXhKZ2NJY01XeV96S25mQm91eW5aS0pkWHNRR2RqM2p0WkRJbW5YVlFzdFhDeGpUNUZoSGpmTjRReUhya091aGpJR29Uam1TeEl0NWVhSi1ncC1DeklieGI1SXJqcHNYMm9vWm5uMVgwRzM4SEhBWm5POVNjMi1wQkJuQXpZM1JEWnpiOVB3eUdtZ0Z1UFJidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Jim Cramer Recommends Buying Ethereum Or Bitcoin Instead Of This Stock: 'Let's Not Fool Around' - Markets Insider",
        "content": "On CNBC’s \"Mad Money Lightning Round,\" Jim Cramer recommended buying either Ethereum (CRYPTO: ETH) or buy Bitcoin (CRYPTO: BTC), in case you want to own Marathon Digital Holdings, Inc. (NASDAQ:MARA). \"Let’s not fool around,\" he added.\n\nOn April 10, JPMorgan analyst Reginald Smith maintained Marathon Digital with an Underweight and raised the price target from $16 to $16.50.\n\nWhen asked about Exxon Mobil Corporation (NYSE:XOM), he said, \"Parabolic move, my friend. We don’t like parabolic moves, that’s a very good example.\"\n\nOn April 15, Exxon Mobil awarded a large contract to TechnipFMC plc (NYSE:FTI) for its Guyana’s Stabroek Block. TechnipFMC will supply subsea production systems for the Whiptail project.\n\n\"When it comes to data centers, I am inclined to say that no power company is going to make money off of it. Better to buy Vertiv (NYSE:VRT) or Eaton (NYSE:ETN).\"\n\n\"That’s the way to do it,\" the \"Mad Money\" host said when asked about NuScale Power Corporation (NYSE:SMR).\n\nOn March 14, NuScale Power reported fourth-quarter FY23 sales growth of 35.3% year-on-year to $4.60 million, missing the analyst consensus estimate of $9.975 million.\n\nPrice Action:\n\nExxon Mobil shares fell 0.1% to settle at $118.63 on Wednesday.\n\nMarathon Digital shares gained 0.2% to close at $14.63 on Wednesday.\n\nNuScale Power shares fell 0.8% to settle at $4.93 during Wednesday’s session.\n\nRead Next: Investor Sentiment Decreases Further, S&P 500 Falls For Fourth Straight Session\n\nImage: Canva"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPSGxpbnBUYWZ0ZzNuWEU1Q0VTRGxSdmFvZVo1ZHRiQmRwekh6MEJraHhmT3hkMko0RTdPQ1VnZjRrUzdEWmlIYk1vUmc5ZHhMUEVJYy1IQVFoSnpuQy0yTElRMmQwdDRfb2x4R1Q1MTRNQzhJclIyb09ucjI5S21iYUdjVXBrcVpwQmFtZEtpdHJadDU0UWpKMUtFWGvSAaIBQVVfeXFMTkxUSXNaRDlaTWx2aVpCN0Jwd1MwYXMyOExxeWtfa0Z1cjYtM1p0bFpLb0cyRE5vMG0wOWItZl9TVGVsMWxKeGotMXNLUFVPN1hFdHVsaEw5NkdOaXRIcGZaZnpNMXJfM3paSlZGM2RSRDBiSHJnZnd2VXhNZDJOQlZhejBYdklFQ0NmX1ZBR2Jxc21XaEFlNUZiRTk3RW9Od2ln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum’s bottom in? Key indicator makes this prediction for ETH’s price - AMBCrypto News",
        "content": "Ethereum transaction fee fell to a four-month low on the charts\n\nThis could be a sign of a decline in user activity on the network\n\nAccording to Santiment’s latest update, Ethereum’s [ETH] transaction fees have fallen to their lowest level since January.\n\nSantiment revealed that the average fee per transaction on the Proof-of-stake (PoS) network was $2.34, at press time. This represented an 84% decline from its year-to-date (YTD) peak of $15, recorded on 5 March.\n\n? #Ethereum's network costs just $2.07 to make a transaction, a far cry from the $15.21 that it cost back on March 4th when demand was excessively high. The market historically moves between sentimental cycles of feeling that crypto is going \"To the Moon\" or feeling that \"Crypto… pic.twitter.com/OKjhmHnYQE — Santiment (@santimentfeed) April 18, 2024\n\nDecline in network activity\n\nThe drop in Ethereum’s network fees is attributable to the fall in user activity on the blockchain over the past month. According to Artemis’ data, Ethereum has seen a decline in daily demand and activity over the last 30 days.\n\nFor example, the daily count of unique addresses interacting with Ethereum since 19 March has cratered by 7%. Due to this, the number of unique on-chain interactions with the network has dropped. With 1.2 million transactions completed on Ethereum on 17 April, the network has recorded a 14% drop in daily transaction count in the last 30 days.\n\nThe drop in user activity on Ethereum impacted the performance of its non-fungible token (NFT) and decentralized finance (DeFi) sectors too.\n\nRegarding NFT activity on Ethereum, sales volume on the network has fallen significantly over the past month. According to CryptoSlam, NFT sales volume on the PoS network totalled $288 million in 30 days – Logging a 57% decline.\n\nAn indicator of decline in the network’s DeFi vertical is its total value locked (TVL). According to DefiLlama’s data, Ethereum’s TVL at press time was $49 billion, declining by 14% since its YTD peak of $57 billion.\n\nDue to the drop in Ethereum’s network activity, ETH’s supply has turned inflationary. This means an uptick in the amount of ETH coins that are being created and added to the circulating supply, adding to the downward pressure on the altcoin’s price.\n\nIn fact, according to data from Ultrasound.money, ETH’s supply has risen by over 2,667 ETH over the past week alone.\n\nETH local top reached?\n\nIn its post, Santiment opined that the decline in Ethereum’s network fee may suggest that its price is near its bottom and that a rally may be on the horizon. To determine whether a price bottom is in, observing ETH’s Age Consumed metric is key. This metric tracks the movement of previously idle coins.\n\nWhen the coin’s Age Consumed rallies, it suggests that many long-held and idle coins have begun to change hands. This indicates a strong shift in the behavior of long-term holders.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nOn the other hand, a dip in ETH’s Age Consumed metric suggests that long-held coins remain in wallet addresses without being traded.\n\nThe metric is a good marker for local tops and bottoms because long-term holders rarely move their dormant coins around. Therefore, whenever this happens, it results in major shifts in market conditions.\n\nAccording to Santiment’s data, ETH’s Age Consumed rose significantly on 18 April, confirming that a bottom might be in.\n\nHowever, a cursory look at the past few times the coin’s Age Consumed recorded similar highs revealed that these episodes were followed by price declines – A sign that tops were reached. This may yet be the case for the world’s leading altcoin.\n\nAlso, current market sentiment remains significantly bearish, with the Bitcoin halving event less than 24 hours away. And, readings from the coin’s price chart suggest that it may already be priced in."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTWxmQVVtSmgyT2RQQTZPWThKUFBuNFBjVXVsbkVteGI5T2tYbkxlZnQwSGV6RWlrd0FEdm82UHhMeUlDaHM4cHlscFVIeXlua1duNlcwbmx4bXp1RFc0RDF1OGt6azFnbl9qd3E5dG81QjJuVDZ4NnJBd3l4Qm9QMS1EaTZYTWhHakJLSURNU25JVkJmQURkd3JzMTNFdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Degen Chain Tops Ethereum TPS Charts with 37.12 TPS in 24 Hrs - Crypto Times",
        "content": "An Ethereum layer-3 blockchain, Degen Chain, broke the record for transaction per second (TPS) rate by achieving 37.12 TPS in the last 24 hours, surpassing its base blockchain’s 30.81 TPS. This 68.56% increase resulted in processing 3.2 million transactions in a day, according to L2BEAT data.\n\nETH Transaction Per Second Chart | Source : L2BEAT\n\nDespite its high TPS, Degen Chain saw low trading volume at $819,600, with an average transaction value of $0.27, contrasting sharply with Ethereum’s $1,867 and Base’s $170 averages.\n\nExperts caution against overreliance on TPS as a scalability metric, noting its failure to consider transaction complexity. Degen Chain’s success is attributed to its Degen (DEGEN) token, initially a tipping token on Farcaster.\n\nThe platform now boasts $4.1 million in locked value, with the DEGEN token’s market cap at $345 million. Degen Chain is hailed as an ultra-low-cost layer 3 blockchain, leveraging Arbitrum Orbit and Base’s settlement layer for scalability.\n\nDegen Chain’s success, despite low trading volume, showcases the potential of its DEGEN token and its innovative approach to layer-3 blockchain technology."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNcVRPNGhUa0xLbnE3c0taVWxNQzR6blYwYm54M0RqTllmSlU1OTBKUzYzejFuZXNRc1NScTNhRVJZcktJNDNvYmpVVWlrTS1GNVA1TlBPT0RBNW5vWThIeUhieXh2M2NVWVZQNzQ3R2xENXdmZDFNNEFYVTdvZWpCdzZxTmtSb2JfQlAyRDNCRnI0c0dC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Introducing Scroll Sessions: Native zkEVM Layer 2 for Ethereum - Blockchain.News",
        "content": "Introducing Scroll Sessions: Native zkEVM Layer 2 for Ethereum Luisa Crawford Scroll has unveiled Scroll Sessions, a groundbreaking native zkEVM Layer 2 solution for Ethereum that aims to enhance scalability and reduce transaction costs. This article provides an overview of Scroll Sessions and its potential impact on the Ethereum ecosystem.\n\nScroll, a prominent player in the blockchain space, has recently announced the launch of Scroll Sessions, a native zkEVM Layer 2 solution designed specifically for the Ethereum network. This innovative technology aims to address the scalability and high transaction costs associated with the Ethereum blockchain.\n\nWith the rapid growth of decentralized applications (dApps) and the increasing popularity of the Ethereum network, scalability has become a pressing issue. The current limitations of Ethereum's Layer 1 infrastructure have resulted in congestion and skyrocketing gas fees, hindering the seamless user experience and adoption of dApps.\n\nScroll Sessions introduces a unique approach to scalability by leveraging zero-knowledge proofs (zkSNARKs) technology. By incorporating zkEVM, a native Layer 2 solution, Scroll aims to significantly enhance Ethereum's throughput, allowing for faster and more cost-effective transactions.\n\nThe integration of zkEVM enables the execution of Ethereum smart contracts off-chain, while maintaining the same level of security and trust as the Layer 1 Ethereum network. This off-chain execution reduces the computational burden on Ethereum's mainnet, resulting in improved scalability and reduced gas fees for users.\n\nOne of the key advantages of Scroll Sessions is its compatibility with existing Ethereum smart contracts. Developers can seamlessly migrate their contracts to Scroll Sessions without the need for any modifications, ensuring a smooth transition to the Layer 2 solution.\n\nIn addition to enhanced scalability, Scroll Sessions also offers privacy features through zkSNARKs technology. This allows users to maintain the confidentiality of their transactions and data, further enhancing the overall security of the platform.\n\nThe introduction of Scroll Sessions has garnered significant attention within the blockchain community, as it has the potential to address the scalability challenges faced by Ethereum. By providing a seamless and cost-effective Layer 2 solution, Scroll aims to unlock the full potential of the Ethereum ecosystem, enabling greater adoption of dApps and facilitating a more efficient blockchain experience.\n\nAs the development of Layer 2 solutions continues to gain momentum, Scroll's native zkEVM Layer 2 technology holds great promise for the future of Ethereum. With its focus on scalability, cost-effectiveness, and privacy, Scroll Sessions could pave the way for a more scalable and inclusive blockchain ecosystem.\n\nImage source: Shutterstock"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOUlV5bVdKbTV3dGRWX3pjaVNiUng4c3ZBQzBCM3EzQlBNWVJ4SHh3NGtFY2tHcENocU43QVlFelJZV0piMWZ0eHhtNWtLVjl2TWQ2VW16UGV0d2thQU9zVDVKdC1GZGhGQ25mRlAyRW5keDFSRFpEZXo0a252NWFTalk5YXBGSU9iUU1RbnNsbmt2LW96YUF2Ul9kczB3RVYzd1U1Uy1mMk1tNi1lZnMxVEd4MG1JM3B3SG55ckxNdnM0Ykdm0gHKAUFVX3lxTE96SVVYbV9oRjd3SzhkcVhZdktkd3JnTTNzeUxiamsyWDJpOG5iSlBaY3VFM2g0RzlpNXdDSGFheVprTWUzQmJyd295UmxTWDN2eG42S1BsRkNRQkpOSnBqRTlONWg5XzhONmc4YVlENFl3UnZIUm9ucHgtSW42b0kybGxXMnZ3ZUVDMVZ6bk5Qa3BJNnFsSkE5b3BUeXA5YWJqbGZFSE1EOFZsVzdtbUE0VV8yLUpjaUt0ZnJPSWtaN2V1LUdtZl81N3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Coinbase's Former Executive Nana Murugesan Named President of Ethereum Scaling Firm - Finance Magnates",
        "content": "Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights\n\nRelive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more!"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxOam00RkhzM2FtdEFzVU5NMGx4SUhZWFM2US1PblRSODBrTERweXNfM2pDU1FlUnR0bllYeHZEcHpJdjdxal93MHdmUXV2akprcTRLeDZHNUZTMkd2M2RmbmgzcXhtb3dMOHRzdHNKemhJMWg0Nl8xSGFJalpzSUVyYS10VmFZNXkxTnhMMkY1ai1QV1BoaUQxX1lYTEQ0SGpYNmFRWGNFdmNKRFVzWUc5QUxBWkNaVjBDSVRsTlNKSnJpdFNSUXNDeE8tT1dxR3NsS29YN2E2bThXZGhvUVpNTHpPdFpfNllBZHg1NmhFMTZic2J5NDZQVDlxaWoxVS1SZ2tRYUh6Z9IBjAJBVV95cUxNcENIcEJXekl6RlBhdDBwc0M0NFdjdWQwbkpOTmlYX2RNZ3FERXIzX1N3cE82ZTdteTFNU3E0WjFqOTNQcDFMbWc4NlBxTm16cWJQdWt2Sm5MMmdMR25raGtGRmY5eG5BNk9zZi1NdTM4SUNNSWpSUkV2Yl85c1l0QlNtc3Y1TlNkVkUzNS1xclhjbFFhXzRsNTdIRTlsdEdvQTh0enMyeTViMnVTSnl1Q3JsOHFwMkVBS2xNLU1IbjU2RFhrQVRVV3hPbzgtVzBhdXdlY0xaaWx6bGdPWVFsUnFOMXd6Rk9lQlJDSENabkI4aF83cVg5ZzM1NXljSVlMTUZ5Q3BWX0h5YTlS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin surges amid rising geopolitical concerns; Ethereum and Altcoins experience mixed performance - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMajor crypto tokens were trading mixed on Friday amid reports that Israel attacked Iran in a continuing series of assaults that have increased concerns of a wider Middle East conflict.As of 10:36 am IST, Bitcoin was trading 0.9% higher at $62,200. Meanwhile, Solana (3.8%), Toncoin (13%), Chainlink (1%), and Internet Computer (4.3%) were also trading higher.On the other hand, Ethereum was down 0.4% at $3000. BNB (-1.1%), XRP (-1.5%), Cardano (-1%), Shiba Inu (-0.7%), and Avalanche (-1%), Tron, Polkadot were also trading in the red.Edul Patel, CEO of Mudrex, said, \"With increasing geopolitical tension between the two countries investors are moving risk-off sentiment in financial markets seeking safer investments. Additionally, US Fed Chair Jerome Powell signaled delayed interest rate cuts further adds pressure.\"Meanwhile, CoinDCX Research Team, said, \"Market sentiment is volatile due to updates on the Iran-Israel conflict, so traders should exercise caution.\"Also Read: How does Bitcoin Halving impact the Bitcoin price? Currently, the total volume in DeFi stands at $7.01 billion, representing 7.15% of the total 24-hour volume in the crypto market. Concurrently, the volume of all stablecoins amounts to $91.99 billion, constituting 93.88% of the total 24-hour volume in the crypto market, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency , rose to $1.22 trillion. Bitcoin's dominance is currently 53.97%, according to CoinMarketCap. BTC volume in the last 24 hours increased 4.5% to $44 billion.Shivam Thakral, CEO of BuyUcoin, provided insight, stating, \"Over the last few hours, $34.03 million in Bitcoin long positions have been liquidated. But the overall sentiment remains bullish as on-chain metrics show that over $1.7 billion worth of BTC have been accumulated by holders in the last few days.\"The technical analysis reveals that Bitcoin is facing challenges, with a pivot point at $62,216 and resistance levels at $64,606, $67,695 and $70,959. Support levels are at $59,418, $56,271 and $53,182.The Relative Strength Index (RSI) at 40 indicates potential oversold, while the 50-day EMA at $65,415 acts as resistance. Bitcoin outlook remains bearish below $62,216 with a possible shift to bullish sentiment if this line is breached."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPSkVyWDI4RDVZaDYzS1RtaGY0Z1VmbnNVLW1qQ3d6eV9vbHdTUUxsbVdTWkVjYkVYV1p0Vi1veWwwbmZEaWlhUGNkSHBKQzdBa3NNeTQ5N1IyN3MtU1FsRlFDdWRSVGNEVDRnZGhpU0JPc1ZIWlExR2c3Zy1tbnBKRkEwaU1hamdDVUZDUUtOQUY0cFN4VWhMaGZXaWRoUTVJRG9tTkFXakVwb0llX3B1d0d6cWllbkFsUTF6c1lhZFRIaVZMMGVmMHRFdnE3cFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Telos Partners with Ponos Technology to Develop Hardware-Accelerated Ethereum L2 zkEVM Network - CryptoSlate",
        "content": "Chainwire Telos Partners with Ponos Technology to Develop Hardware-Accelerated Ethereum L2 zkEVM Network Telos collaborates with Ponos Technology to create a hardware-accelerated Ethereum Layer 2 network, aiming to significantly enhance scalability and data protection through innovative Zero Knowledge technology integration. Chainwire · · 3 min read\n\nDisclaimer: This is a sponsored press release. Readers should conduct their own research prior to taking any actions related to the content mentioned in this article. Learn more ›\n\nDubai, United Arab Emirates, April 19th, 2024, Chainwire – The Telos Foundation today announced that it will work with Ponos Technology, the leading Zero Knowledge Proof (ZKP) research and development firm, to develop an end-to-end optimized, hardware-accelerated Ethereum Layer 2 network featuring SNARKtor, the Telos-developed decentralized recursive proof aggregator. The teams will take a hardware-software co-design approach that will help unlock new possibilities in terms of massive scalability, greater data protection and trustless interoperability for Ethereum users globally.\n\nPonos Technology provides end-to-end optimized solutions for ZK proving, which is essentially achieved by leveraging FPGA acceleration, thus maximizing business value streams through cost-performance optimized computation by matching hardware-software co-designed modules and dedicated execution environments. The team includes a unique blend of experienced scientists and highly skilled industry experts that have accumulated deep technical knowledge on all aspects of ZKPs.\n\n“Zero Knowledge technology is going to become increasingly mainstream and can open the door to increased efficiency and security across so many industries,” said Slobodan Lukovic, CEO and co-founder, Ponos Technology. “Similarly to AI, steady enhancements in algorithms coupled with advancements in underlying hardware infrastructures will enable commoditization of ZKPs and result in the technology being widely adopted in the near future.”\n\nTelos will also be working with several other new partners during the development cycle, including:\n\nDigital M.O.B. – One of the strongest Ethereum developer teams in the world, having worked on projects including MetaMask, MakerDAO and Gnosis, among others.\n\nATKA – A Paris-based end-to-end Web3 incubator that has helped incubate world class projects such as Morpho and Mangrove, and whom Telos announced a strategic partnership with in March 2024.\n\nCometh – An award-winning dev team led by ETH France President Jerome de Tychey, who joined Telos as a technical EVM advisor also in March 2024.\n\nTelos Executive Director John Lilic, who helped lead pioneering teams at Consensys and Polygon in addition to maintaining his role as a Top 50 Web3 angel investor, will help coordinate and support the transformation. He will work closely with Alberto Garoffolo, Head of ZK technology at Telos and co-author of the SNARKtor whitepaper, and Jesse Schulman, CTO and Head of Engineering at Telos.\n\n“Fundamentally, Ethereum will need to take a hardware-software co-design approach in order to realize zkEVM performance at tremendous scale,” said Lilic. “That’s the approach we’re taking with Ponos Technology and our growing partner network as we build a hardware-accelerated zkEVM L2. We believe that this formula, alongside the exciting work our team is doing with recursive proofs via SNARKtor, is going to offer compelling services to the Ethereum community and beyond.”\n\nTelos was created in 2018 through a fair drop network launch that did not include an ICO nor token sale. Over the past six years, the Telos Foundation has helped steward the development of two primary networks – Telos EVM and Telos Zero – and will now also focus on building a highly performant and succinctly provable L2 zkEVM.\n\nAdditional details on the Telos L2 will continue to be announced in the lead up to EthCC in July, for which Telos is a primary sponsor. Live in Brussels from EthCC, the Telos team plans to broadcast its first-ever demo of SNARKtor to the world as a precursor to the official launch of the Telos L2.\n\nAbout Telos\n\nTelos is a decentralized blockchain ecosystem that includes Telos EVM, which tested as the fastest Ethereum Virtual Machine globally, and its high-speed consensus layer, Telos Zero. The project is also focused on expanding its capabilities with novel Zero Knowledge technology through the development of a hardware-accelerated Ethereum Layer 2 network powered by SNARKtor, which promises to enhance privacy and scalability for global use cases. Telos is overseen by The Telos Foundation, an ownerless foundation dedicated to advancing the Telos blockchain network and its community.\n\nContact\n\nThe Telos Foundation\n\n[email protected]\n\nShare"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNYVpUZzJxR0hlNDRMemR5MVhwaDZLLVpDWlJWdF9GTVYtTXItdWhzYTJUaHlXNElHS180R29TVzdvSzU1TGZ2X05aX25JV0dCNDFIYUwzb3YxLVRUYjlsV3FEb05sa0xKN3JwcGZ6b05QeHNoVFFaVU4tMGpzOExMV1dB0gGHAUFVX3lxTE9ua0cwNUtPcmNMWUhMUnJvREZjRE9QMXo1ZTBITjVTSDc3WFhTdXRJRWZjSDhqWFptWGVfT2JyTDJ4cHVXMXhWdjh0SHdJdU9Md3BMYkhZbFNIaE5Lb0d4QkZpSUFrS1RKNF9yVzRxeGJ6SFRlcXJudHdHa0k1UWN6RDZkOTN0MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "318M USDT flow into Ethereum: Good news for ETH’s price? - AMBCrypto News",
        "content": "Massive amounts of USDT flowed from Tether to Ethereum exchanges.\n\nActivity on the network remained stable as the price of ETH declined.\n\nEthereum [ETH] has witnessed massive price volatility over the last few days. However, Tether’s [USDT] recent behavior could help improve sentiment around ETH.\n\nUSDT gets into the mix\n\nAccording to Lookonchain’s data, over the past 18 hours, a significant amount of USDT, specifically 318 million dollars worth, has moved from Tether’s treasury wallet to exchanges on the Ethereum network.\n\nThis outflow has significantly reduced Tether’s holdings on Ethereum. Their treasury held only 124 million USDT at press time.\n\nTo meet potential demand, it’s expected that Tether will soon mint another 1 billion USDT on Ethereum.\n\nTether has a history of minting large amounts of USDT, often corresponding with periods of increased cryptocurrency activity. This doesn’t necessarily guarantee a surge in Ethereum usage.\n\nWhile Ethereum is the dominant platform for USDT, other blockchains like Tron could also be used for the same purposes.\n\nAt press time, the gas usage on the Ethereum network had remained the same over the last few days. However, the NFT trades occurring on the network had declined significantly.\n\nThis suggests other types of activity are picking up the slack. DeFi transactions, stablecoin swaps, or general token activity could be contributing to the steady gas usage.\n\nOn the NFT side, a market correction or declining public interest may be playing a role.\n\nHow are holders doing?\n\nEven though activity on Ethereum was consistent, the price movement of ETH wasn’t showing signs of green. At press time, ETH was trading at $3,000.70 and its price had declined by 2.74% in the last 24 hours.\n\nIf the price continues to decline further, it may cross the $3,000 level for good, which could further cause panic in the markets.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nDue to this massive decline in the price of ETH over the last few days, the MVRV ratio for ETH fell considerably. This indicated that the most holders not profitable at the time of writing.\n\nHowever, the volume at which ETH was trading at had grown by 11.79% as well during this period."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPZ3pTVUYwQ2NZNzlxRzBRWFZTWWkyOVNtejJZMm4wUHFrcm90a0RTdEZneW1nV0hMZVdkOE90MXVsOWlRSENFTXA3Z0JNU0RUT1NTX21IQTB5X0lMNGdDUkc3VUxmSE04YVd0RDVSamVoNUxPTkFBQWRiQXJtN042RVE2OHE0X2h0SnZIZ3U5djdoaXYxODFPWTZwTDhhM055Rzg4aEZfZDZyV1paZ0l0bkFUZDZNaGVzeGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Famous Analysts Predict Dogecoin and Ethereum Bull Run, As KangaMoon Hits Over $4.8M In Presale - The Cryptonomist",
        "content": "SPONSORED POST*\n\nRecent data released by on-chain analytic firms indicates that Ethereum (ETH) holders have been scooping massive amounts of this leading crypto. The massive accumulation spree was due to the highly anticipated bull market run for the crypto. In the meantime, crypto analyst Mikybull Crypto has predicted a potential Dogecoin (DOGE) bull run, as KangaMoon (KANG), a unique altcoin, recorded an impressive over $5 million during the last presale stage.\n\nMikybull Crypto Analysis Indicates a Dogecoin Bull Run\n\nDogecoin (DOGE) is a popular altcoin that has been making significant gains in March. The price of Dogecoin surged by more than 90% to reach the $0.20 level. However, despite Dogecoin’s impressive stand last month within the altcoin market, Mikybull Crypto, in his recent Dogecoin analysis, said that the real bull run for DOGE is about to kick off.\n\nBased on the expert’s analysis, the price prediction for Dogecoin is aiming at the $0.30 mark. If Dogecoin manages to break past this level, then it might extend its gains even past the next few coming weeks. Other analysts seem to be backing this sentiment, highlighting the possibility of the Dogecoin price breaking above the $1.00 mark within this bull cycle.\n\nEthereum (ETH) Whales Set on An Accumulation Spree\n\nContrary to Dogecoin, Ethereum (ETH) has had quite a rough month, with the Ethereum price dropping by at least 13% in March. As per LookOnChain records, several of the top Ethereum coin holders took advantage and increased their ETH portfolios as the prices dropped.\n\nAccording to LookOnChain, a wallet reportedly owned by Matrixport managed to move over 22,250 Ethereum tokens, currently worth around $80M, off Binance. A similar wallet also withdrew at least 3,092 ETH worth $11.12M from the same exchange. Such a huge purchase is a clear indication that the price prediction for Ethereum might be anticipating a huge rally.\n\nKangaMoon (KANG) Nears $5M\n\nKangaMoon (KANG) is standing out as a unique altcoin to invest in 2024. With a sensational presale that has managed to lure lots of investors with a unique approach and those who believed in early received gains of up to 290%, KangaMoon continues to hit new milestones, surpassing the $5 million during the presale, nearing the $5.5 million mark by next week. On the other hand, KangaMoon is set to achieve the $7 million milestone by the end of April.\n\nLots of investors have been investing in KangaMoon due to its upcoming P2E game, which is set to be launched. In the game, players will have the chance to utilize KANG tokens as the primary in-game currency. The platform also plans to realize different regular challenges for KANG holders to participate in and get rewarded with extra tokens as well as different in-game assets.\n\nWith a community-driven approach, KangaMoon has managed to attract over 20,000 registered members within the platform. KangaMoon also rewards its most active members with free KANG tokens by just commenting, sharing and retweeting KangaMoon’s social media posts.\n\nThe current price of the kang tokens stand at just $0.196 in its stage five presale. This is such a significant price compared to its original price of just $0.005. With such success, KangaMoon boasts over 5,800 token holders, positioning itself as the best new coin in 2024.\n\nConclusion\n\nThe recent purchasing spree for Ethereum indicates a positive sign, as the whale accumulations normally precede a market rally. Moreover, Dogecoin and KangaMoon stand out as the best altcoins to invest in.\n\nDiscover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!\n\nWebsite: https://KangaMoon.com/\n\nJoin Our Telegram Community: https://t.me/KangaMoonofficial\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPNHZPNTJ3TXNWRDNleVozZWJEamJ1WUNMY2EtT2NnUFhhR0pzellWOHF5Y1ZWS2laVlIwSTZCNjVKOTJuVmVtUFRocEdoUVRKYkVOQ0lvbnVqaWFQUW9FYjBwdDdLWG5TeVBPRFZqeWVhZVZnY2hjSE9LZkgwbXd1a2haMEl3MGdLQ01xYi1DWXhTV0xZQWfSAZsBQVVfeXFMUFhodWVEMXZLNUE0VmdOd2VKWWlEVmVMV3hmSE54UTFCMjZIRk83Ry0tUUdTanJwRWVmc2hOdWRuQmR0dmFqRmQyMnI5bVpfUXowcHRYZFU4aWNfX05KdWFwOUIzcDdRcHJzYjRDTng5U2J5Q2xmajdXSEp5NllJa2k3N3c2NXN6SGtNS3V2c3AzbWw2OVY4d2JIWGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Ethereum – A buy opportunity ahead of Bitcoin’s halving could emerge IF… - AMBCrypto News",
        "content": "Ethereum could fall under the $3k psychological support zone soon\n\nMetrics flashed a strong buy signal, but there’s more that investors need to consider\n\nLately, Ethereum [ETH] has seen bearish sentiments strengthen behind it. In fact, a Santiment post on X (formerly Twitter) revealed that both Bitcoin [BTC] and Ethereum saw a hike in bear posting ahead of the halving.\n\nNegative engagement on social media saw a positive change on 18 April when BTC bounced to $64.1k and ETH to $3,094. AMBCrypto analyzed other metrics to understand if investors should be buying ETH now.\n\nDrop in gas fee could be a disguised threat\n\nAMBCrypto noted that the Open Interest behind Ethereum has slid dramatically over the last ten days. It fell from a peak of $7 billion on 9 April (Ethereum priced at $3638) to $4.6 billion, at press time (Ethereum priced at $2997).\n\nThe sharp decline in OI meant speculators feared going long and lacked bullish conviction. It conveyed bearish sentiment. The 1-day RSI was also below neutral 50 for the most part since 18 March. This implied that momentum has favoured the sellers for a month now.\n\nThe average fees on the network have also been in decline. A recent AMBCrypto report highlighted that although it is a positive for users, it also points to a drop in demand for transactions on the blockchain.\n\nAddressing the buying opportunity\n\nThe $3k psychological support zone would have been a fantastic buying opportunity a month ago. It still might prove to be. The 90-day MVRV ratio was below zero at press time, showing an undervalued asset and holders at a loss.\n\nHowever, the mean coin age has adamantly trended higher for three weeks. Together, they signalled investors to buy Ethereum.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nAnd yet, the dormant circulation saw a massive spike on 18 April. This highlighted a flurry of token movements and could foreshadow a wave of selling. Moreover, Bitcoin was barely hanging on to the $61k support zone at the time of writing.\n\nPatience and prudence could be extremely beneficial for investors. The likelihood of another sell-off is still high. The possibility of another month or two of consolidation following the halving, in light of recent overheated market conditions, is high too."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE0yb1JxTllQUkFUNWtoX2NtQ1VXT05DTmllUHlrV2FsQ2dnR2E4VHpJX1lUbTFFczBlNlRfSHZ0OTVvc2V6UzJteF9XbG5qYmNfLUpfQUFxRmgxVmpCUUdnRUZQalU5bUFONFRidHFIY1VZSWFZRXF6SGx2MXY0WWvSAYQBQVVfeXFMTzZZLTBuUnh5djJFa3FzdU5TdnZrZGhoaUswSmNIa1QyUElObG9BczhwRkVNMzRsYnNaWlNqdWpRQTJBQjRzbmpGVzRHUkxOOE5icU9HQ2VoZWRod3hEVm5lVFJtRV8tTHR1NUdteDZNV01MZ0ExbnFYTURNZTYyeWZEUXBU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: ICO Whale Dumps ETH, A Further Dip Ahead? - CoinGape",
        "content": "The Ethereum price faces turbulence as it witnesses a decline of nearly 4% amid the broader crypto market fluctuations. Meanwhile, the recent dip in the ETH price has fuelled discussions in the crypto market, with investors speculating over the potential price movements in the coming days.\n\nNotably, the recent whale activities, especially from an ICO whale, have heightened speculations about Ethereum’s future trajectory, adding to investor concerns.\n\nadvertisement\n\nWhale Activities Sparks Concerns Over Ethereum Price\n\nThe Ethereum price has witnessed a notable decline over the last few days, especially after the U.S. SEC potentially delayed approving the Ethereum ETF approval. In addition, the investigation by the U.S. SEC over Ethereum’s security status has further dampened the investors’ sentiment.\n\nMeanwhile, amid the topsy-turvy scenario in the market, Spot On Chain, an on-chain data provider, revealed significant activity from an Ethereum ICO participant. This participant sold 2,000 ETH for 6 million USDC at $2,997, indicating a sizable offload of Ethereum assets.\n\nNotably, the whale, who initially acquired 33,213 ETH during Ethereum’s Genesis ICO in 2015, has already deposited 5,110 ETH to Kraken or sold via DEX at approximately $2,545. However, despite this sell-off, the whale still holds approximately 29.7K ETH, valued at $89.4 million, across three wallets, primarily within staking platforms.\n\nIn addition, Whale Alert reported additional Ethereum transactions suggestive of potential whale dumps. An unknown wallet transferred 10,806 ETH, worth $32.13 million, to the Coinbase exchange, while another whale moved 10,726 ETH, valued at around $31.90 million, to the same exchange.\n\nThese sizable transfers to the leading crypto exchange have intensified concerns among investors regarding increased volatility in Ethereum’s price trajectory. However, amid these worries, analysts are cautiously optimistic about a potential market resurgence, driven by anticipation surrounding the upcoming Bitcoin Halving event.\n\nAlso Read: Cardano’s Charles Hoskinson Believes RFK Jr Is The Best Presidential Candidate\n\nPrice Performance & Market Sentiment\n\nIn a noteworthy development, the recent approval of Bitcoin and Ethereum ETFs in Hong Kong has injected optimism into the market. This regulatory milestone has uplifted sentiment among market participants, offering a glimmer of hope amid the current market turbulence.\n\nWhile uncertainties loom over Ethereum’s short-term performance due to whale activities, the broader crypto market remains buoyed by positive developments such as regulatory approvals and anticipation of significant events like the Bitcoin Halving. It’s worth noting that several analysts have also warned about potential short-term volatility during the Halving event.\n\nMeanwhile, as of writing, the Ethereum price traded at $2,978.31, down 3.45% from yesterday, while its trading volume over the last 24 hours rose 10.77% to $18.58 billion. Notably, the Ethereum price has plunged over 16% over the last seven days, while noting a monthly decline of around 18%.\n\nAlso Read: Bitcoin’s L2 Merlin Chain Unleashes Half of MERL Airdrop Tokens at TGE\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPblRIRDF0ZGEweGdkTWlvYU1YYVBKZzF3SFhaU1RKZExrRU92QnhMdzFCMkNSZDdYWkRSODdzSW5RZVh4TjlQTDZLdkV3WmxTZExyNlctTHdrY1JQUnkzYVN6UEM2bGJJU094ZEtHZkxiMTZTbm11UkNWYXA4bjRORlVnS1oyZTgtQ2FxUDFYcUlXbTlOMTR6S2hVS2lQQWPSAaQBQVVfeXFMUDhFWGlmOTlVSE1WU1BtVUdtOU5QaHdOZkxFZDB1U1VoS0hJQTdDbWdTWmhuR2RRSkFPNDhqQUM0TmxDSVgxdjFfLWNDTW5zZkdRLXNoZDRFbUtEU3NLbkhBb0FTNUhRRFl1SC14eWpjdE40Q0tsZThOZjRMUU5JX3ZFVlAyby1yam9TbXpBZ015RHhOa0JFMGdXRHVTOS04blFrY2o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 19: Bitcoin At $62K, Ethereum Nears $2900, SOL Recovers - CoinGape",
        "content": "The top crypto prices today witnessed a mixed action as the Bitcoin (BTC) price surged past the $62,000 level. In contrast, the Ethereum (ETH) price struggles to sustain above the $3,000 mark. Meanwhile, other top altcoins, such as Cardano (ADA) and XRP plunged notably while Solana (SOL) rebounded.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 1.25% reaching $62,413.84 at the time of writing on Friday, April 19. On the other hand, it’s trading volume surged 3.66% to $43.90 billion in the last 24 hours. Whilst, the crypto held a market capitalization of $1.22 trillion.\n\nadvertisement\n\nTurning to altcoins, the Ethereum price lost 0.42% to $3,003.80 at press time with a market valuation of $360.53 billion. Whilst, ETH saw its trading volume hike by 1.53%, reaching $18.39 billion. Meanwhile, the Binance Coin (BNB) price was down by 1.17%, reaching $543.42. On the contrary, its 24-hour trade soared 2.91% to $1.53 billion.\n\nThe Solana price inched closer to the $140 mark today. The Solana price gained by 3.80%, settling at $139.66. In addition, SOL witnessed a 9.77% jump in trade volume to $5.29 billion in the last 24 hours. Whilst, the XRP price failed to sustain the $0.49 mark. The XRP price recorded a dip of 1.62%, reaching $0.4883. On the other hand, XRP’s trading volume slumped 1.16% to $1.81 billion.\n\nMeanwhile, the Cardano price was down by 1.10% to $0.4451 today. Whilst, ADA recorded a plunge of 3.11% in its 24-hour trading volume, settling at $488.66 million. As the top crypto prices added experienced volatility, the popular meme coins followed suit. The Dogecoin price plummeted 0.55% to $0.1477 while its rival, Shiba Inu price dropped by 0.81% and traded at $0.00002197.\n\nAlso Read: Bitcoin Halving Party: Celebrate With Crypto Enthusiasts Globally\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a hyped Solana meme coin, rebounded slightly today. At press time, the Pepe Coin price was up by 1.07% to $0.000004979 with a market valuation of $2.09 billion. In contrast, the 24-hour trade volume for PEPE slumped by 1.15% to $623.20 million.\n\nToncoin Rallies 12%\n\nToncoin (TON), the native crypto of the Telegram blockchain platform, gained over 12% and ranked the top crypto gainer today. The Toncoin price was up by 12.30% to $6.80 at the time of reporting. Moreover, its trade volume spiked 46.79% and stood at $592.99 million. Furthermore, the TON crypto attained a high of $7.00 amid the rally today.\n\nAlso Read: Omni Network Price: Is OMNI Worth Investing Before Bitcoin Halving?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNSVowTUdvYVFyZHdqM0FQZ1NKa2VOMm5VX09keDhSbk9PQklwYy1FczFReXh0ald5ZEZ3YzdXMlNYWU9HSzdXMmo0YTBOc09Sd2F3RGxVeFA4THR6R1kzTUdJZlJpTmw5NHUtMms1eFdkblVrODZKYUVIc3pHSlVwZkZQMXBldGxB0gGOAUFVX3lxTE5NcU5sdEtRMThFOFRPWUpxckJpY054YVA4ODZhR3FZYzZuNDM3YXdQemlYSFF3c3BIT1FoTUZhSS1abkVkYlgyN2tvSzdQYzNFd2VsM2Z5NDBoRFlsZS1qRlhaRVhfR2pCamlaeFEyME5IdHlHNWdVU3NiVTgwSnU0M2IzaGRPUkcwbU1nM3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "After $3K, can Ethereum’s price fall to $2000 next? - AMBCrypto News",
        "content": "ETH has corrected as much as 17% over the week, and could fall further below $2,400.\n\nThe market sentiment for ETH was neutral as of this writing.\n\nEthereum [ETH] dipped below $3,000 in the last 24 hours, following a 3.24% fall in its price, according to CoinMarketCap.\n\nThe second-largest cryptocurrency has corrected as much as 17% over the week, as bulls struggled to overcome the downward volatility in the broader market.\n\nHowever, market participants seem to be reacting differently to the ongoing slump, with some profit-taking on their investments while others accumulating ETH at lowered prices.\n\nTo buy or to sell?\n\nAccording to on-chain tracking data platform Lookonchain, a whale known for dip-buying, purchased 3,279 ETH, worth $9.75 million at prevailing prices, on Wednesday.\n\nThe influential investor has been doubling on their ETH investments lately, and held a whopping 86,457 ETH tokens as of the 17th of April.\n\nTo the contrary, a whale who was an active participant in the initial coin offering (ICO) in 2o15, sold 2,000 ETH at a selling price of $2,997, data from Spot On Chain showed.\n\nThe whale received 33,213 ETH as part of the ICO, at a price of $0.31. The latest sale, therefore, multiplied their returns by orders of magnitude.\n\nHow did the broader market react?\n\nTo better understand the market reaction to ETH’s slump, AMBCrypto examined Santiment’s whale metrics.\n\nNotably, the two whale cohorts — 1,000 to 10,000 and 100,000–1 million — increased in number over the week, suggesting that they were accumulating.\n\nHowever, the wallets holding between 10,000–100,000 ETH dropped in the same time, a sign of sell-offs.\n\nThe aforementioned indicators strengthened the “mixed” reaction narrative made earlier in the article.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nGauging ETH’s next moves\n\nThe Ethereum Fear and Greed Index alluded to the deductions made above to some extent. According to the last update, the market sentiment for ETH was neutral, with no clear bias towards buying and selling.\n\nAMBCrypto previously reported that ETH was at the risk of falling further to the $2,000 — $2,400 level."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNRHlMWlBQZko1aXU3NkJjQk9yQll1Q3daaWUtQm50cEZBUDVzV1lPNHc3elUtZkJ4RFY2MXNFNDBjX2ZlTV9UZ3ZRaXJ3TVlYWlZHeGFGc2pHMlh0X090X1AyQVpsb1Q5Vm11OU9Ca0ZRam5HdVZGY1k0VU85c0pLcmIwd0xBZ3AtRFcwTkVMSGkyRGR5NFBLOGkyWTJqNmxzdWlHd25iSThoUUw1X2N5bTY2R3pDZnlpNHBWTkIwRURCMGQ1cWRXaHFHTFBqRnIzUE5oRkFXa0c5bzDSAeABQVVfeXFMTmgxZFdCS3lfTU96UWozdW9HT092X1lONUxrZTVCOEliVkNMVU5DNGJxQUxQVjBTcXU4a2VoNk1uZll4TnJvQkNCb3RyRk9BNGVZel9JRmNtWlppRExPVWdMdTlBX29kc0VIVnhLdjJ0Y1RuY2s2YzhIaTJQRm90SjBFb016M2N1cUM4cmtXMm5JMmRzS0k2d2dJR1l2ekE0UDV3WnNQMDBQU3pWaEFRaXZmbXVQN0EyLXhISzVfWW16TWkzOG1lYk9UdHk0S2RDSEdTUEg0aFlBNFBocGJwTF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & Chainlink — American Wrap 18 April - FXStreet",
        "content": "Chainlink $LINK a cryptocurrency and technology platform that enables non-blockchain enterprises to securely connect with blockchain platforms. It’s acting as a bridge between the real world and the crypto universe to facilitate the connection between the two. In today’s article, we’ll dive into the daily cycle taking place and explore the potential path based on the Elliott Wave Theory.\n\nBitcoin (BTC) price is borderline strong and weak with the brunt of the weakness being felt by altcoins. Regarding strength, it continues to close above the $60,000 threshold for seven weeks in a row.\n\nEthereum's (ETH) price continued a sideways movement on Thursday as the market still awaits a trigger. Ethereum isn't alone in this horizontal trend; several major index funds have also traded sideways, underscoring ETH's positive correlation with the traditional financial market.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOallWSndoY2E5V05wS3lsN1NWVW9Ua0R3Q2xUaGl3R1NsQVd4bWVLbjFpcXVvSHJiRW5PV1VFSkJSWU4yNHV0MHZfMEc4YmlRaHY3dzJOMjRHcGZZSlpKSmVFM25lUnhVWWRUZE9sTVVtOW9UeWtDOUJ0NVJvV1RyYWNPbXJEU3FuX0FoTGg3US1lOVB6cW51WGpxNmFGMjlwTWlFUUM2eHUzNlA0TktEaDJyTHJBUdIBuwFBVV95cUxNVmd6VkJtc05DbFdEVG1CemdNNkVTY0M4YVJRdXJVM09meXlBbjRtRDlzWVhSNjYtdXhVZWV0QWlkSDJKNkkyNGtQNHhrcFpZVkM1V1JIcG9xUVhZZmd1c1ozUFF5a3JVVTBoazVaMkFUeElHZTRnZE8xWlR5Vm9WM3FseFhqbmwycUo2S2ZhR3Fkb2ZFU0ZxaTBwZEF5bk9ULUZwcEdOamNoWkQyVUhpX3ZjcDJEdXltWFBF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Price Update: BTC Halving Changes Altcoins Outlook, Ethereum, Solana On The Move - CoinGape",
        "content": "Bitcoin price update: After taking investors on a rollercoaster for the last two weeks, the crypto market started to move up on Friday, hours before Bitcoin halving. Investors who had been anxiously waiting for the green light rallied behind BTC price and also the altcoins, most of which are witnessing modest gains.\n\nEthereum, the second-largest cryptocurrency network, is up 1.6% in the last 24 hours and trading at $3,105. Similarly, Solana moved in tandem with the rest of the market, with its value rising by 6.5% to $145.\n\nadvertisement\n\nSolana plummeted to $120 last weekend as geopolitical tensions ravaged through the market, leaving behind liquidations in billions of dollars and investors counting losses.\n\nThe cumulative market cap has gone up by a staggering 5.4% to $2.47 trillion in just a day, underscoring the bullish outlook in the wider market. Select altcoins moved in double-digits like Toncoin’s 17% surge to $7.20 and Internet Computer’s 11% increase to $13.\n\nBitcoin price Update: Is The BTC’s Sudden Move Topping $65,000 Sustainable?\n\nAs Bitcoin halving approaches, the buzz in the market catches momentum, encouraging investors to bet on further movement toward the $70,000. From a 24-hour low of $59,651, Bitcoin price sits above $65,000 toward the end of the European session on Friday.\n\nA sizeable 15% bump in the volume upholds the improving sentiment and rising interest among traders. Another 5% surge in the market cap to $1.28 solidifies BTC’s position as the leading cryptocurrency.\n\nBased on the Relative Strength Index (RSI) applied to the four-hour chart, the ongoing movement seeking higher support above $65,000 could be sustainable in the short term, especially if the hype around the halving continues.\n\nMeanwhile, the 50-day Exponential Moving Average (EMA) is in line to prevent BTC from correcting significantly below $65,000. However, it is wise to prepare for a short-lived sweep for fresh liquidity at the black ascending trend line.\n\nA daily close above $65,000 would signal another confirmation of the uptrend eyeing $70,000 post-halving. The red band on the chart represents potential selling pressure and may delay the rally.\n\nBitcoin ETF Net Outflow Volume Shrinks\n\nRising net outflows in the Bitcoin ETF have been putting pressure on the price and the market, adding to the uncertainty due to the tensions in West Asia. Iran for the first time in history directly attacked Israel, sending over 300 ballistic missiles in its airspace.\n\nIf the war in West Asia escalates due to Israel’s potential retaliation to Iran’s attack, the global risk asset markets including crypto could suffer even more.\n\nHowever, SoSoValue shows that the total daily net outflow volume in the ETF market declined to only $4.39 million on Thursday. Grayscale is still posting the highest outflow volumes, with $89.99 million withdrawn from GBTC ETF on April 18.\n\nThere has also been a shift in the best-performing ETFs, with Fidelity leading the net inflow with $37 million and BlackRock coming second with $18.76 million.\n\nThe Bitcoin price rally in Q1 to a new ATH of $73,737 as seen on CoinGecko was mainly fuelled by growing demand for the ETF.\n\nExperts say that demand for the ETF coupled with the impact of Bitcoin halving on the supply of the scarce digital asset would be the ingredients like to make the next bull run. Bitcoin price is expected to peak above $100,000 by the end of 2024.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQTDduRzJWM1pzVVhiblo5UlRHeFkyc2FyWFkwQVcweEFYTEVfT2lsYzNkcUtOWnVEc1ZKR2dpM2tLbUo1VUd3dVFsc29BT2hlUGVRa3ZRMEUwbl9DbGtnMDR6Yi1zM0NJS3ZKakpMaWJ2M2I3SFJvZThWMlJsRklaQ1dn0gGHAUFVX3lxTE1qb3llcVpaVDBuczRSVW9GVG9sNDN3clZ6dEMyenNieHpWMTJMb3BtcG8zRklnYlJWemhreDA4a0NmOHVCOEVkT0ljMFEtLS1fR1FSc2Q1bTlxaTA3YWR4NGUtOUt1UkhVRzYyZGhCV2MyeXVQOURFcU56TUctempUS01HS0RTYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "5,000 Ethereum transfer amid ETF buzz: What happens now? - AMBCrypto News",
        "content": "Ethereum whale sends 5,000 ETH to an exchange.\n\nSpot ETF approval is yet to impact the ETH price trend.\n\nAn Ethereum [ETH] whale recently transferred around $15 million worth of assets to an exchange. This action occurred shortly after news emerged of ETF approvals in Hong Kong.\n\nHas the whale’s transfer affected the price, and has the ETF approval also influenced the price?\n\nEthereum whale takes profit\n\nData from Lookonchain reveals that an Ethereum whale recently moved 5,000 ETH to the Kraken exchange, valuing over $15.4 million at the time of transfer.\n\nFurther analysis showed that the same whale withdrew 96,638 ETH from Coinbase back in September 2022. At this time, ETH was valued at around $1,567, bringing the value of the withdrawal to over $151.4 million.\n\nThis suggests that the recent transfer was likely made to realize profits, given ETH’s surge to over $3,000. Presently, the whale wallet holds 76,638 ETH, now valued at over $233.5 million.\n\nEthereum continues decline\n\nAn analysis of the Ethereum daily timeframe chart reveals a recent lack of profitability. Over the past three days, ETH has experienced a consistent downward trend following a 4% increase on the 14th of April.\n\nDespite these declines, it has retained the initial 4% gain from the beginning of the week.\n\nAs of the time of writing, ETH was trading at around $3,080, marking a decrease of less than 1%.\n\nFurthermore, these declines have intensified ETH’s bearish trend, evident from its Relative Strength Index (RSI) hovering around 40 and its Moving Average Convergence Divergence (MACD) indicating a trend below zero.\n\nThese metrics collectively indicate a strong bearish momentum for ETH, despite earlier positive news from Hong Kong earlier in the week.\n\nAs of press time, Ethereum’s netflow data indicated a trend of increased ETH leaving exchanges.\n\nHowever, by the end of trading on the 16th of April, there was a positive netflow, with 10,230 ETH flowing into exchanges. Nevertheless, as of press time, over 27,000 ETH outflows have been recorded.\n\nETF approval yet to impact the ETH price trend\n\nMultiple reports have stated that Hong Kong recently approved several spot Ethereum ETF proposals alongside spot Bitcoin ETF proposals.\n\nSurprisingly, the approval hasn’t stirred any notable reaction in the Ethereum price. This lack of response could be attributed to the absence of an official statement from the SEC regarding the approval.\n\nInvestors should be cautious about celebrating prematurely, considering the past occurrence of fake news regarding spot BTC ETF approvals.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nEven upon official confirmation, the impact on the market might be insignificant due to lower trading volumes.\n\nDifferent from the substantial ETF volumes witnessed in the United States for BTC, the volume anticipated from the Hong Kong market might not suffice to drive significant market movements."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZEVESlZfLVp2Q2MzX29sV0d3clpBOXpIamliSnR0a0d5aGV0T1FVTHZJMDhQZUF2ek9tMzR1S3hYOWhFVWlLVjE0T0tqV1VfV2ZJcWt3VG1fWnIzQ3JuTTNyZ25JdUp3VVMzT0VyaWdJdGdsQ3lzR1JXREhhcmdlX2JqS0I1Y1FUaVp6Y3J3cnRnZ2xPQl9TcQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "You Might Be Surprised By the 2 Cryptos That Billionaire Mark Cuban Is Buying for His Portfolio - The Motley Fool",
        "content": "The search is on for cryptocurrencies with real-world utility.\n\nFor many investors, billionaire Mark Cuban may be best known as one of the investors on the popular ABC program Shark Tank. But for crypto enthusiasts, Cuban is best known as a champion of Bitcoin, Ethereum, and Dogecoin during the previous crypto bull market rally.\n\nSo what is Cuban buying during the recent crypto bull market? The names might surprise you. He's expanding beyond just the two big cryptocurrencies -- Bitcoin and Ethereum -- in search of utility coins that promise to deliver real-world use cases. Let's take a closer look at what he's adding to his portfolio.\n\nPolygon\n\nPolygon (MATIC -2.23%) is a Layer-2 scaling solution for Ethereum, helping it to run cheaper, faster, and more efficiently. You can think of Polygon as a secondary blockchain that sits on top of the core Ethereum blockchain. By doing so, it can mitigate some of the pricing and congestion issues typically faced by Ethereum users.\n\nThat's a clear example of utility, and it's easy to see why Cuban is all aboard the Polygon train. After Ethereum co-founder Vitalik Buterin laid out the blockchain's strategic roadmap for 2024, he made it a point to highlight the growing role played by Layer-2 scaling solutions. Right now, the future growth story for Ethereum is all about enabling these Layer-2 scaling solutions to do even more. So if Polygon can hitch its growth to that of Ethereum, it should be good news for investors.\n\nThe bad news, though, is that the Layer-2 blockchain niche has become especially crowded during the past 12 months. As a result, Polygon hasn't seen the types of price gains initially expected by investors. Around the time of Ethereum blockchain update knowns as The Merge in 2022, Polygon was trading near the $1 mark. But in the 18 months since, Polygon has dropped below $1 . It is currently trading for less than $0.70, and is down more than 30% for the year. Nonetheless, with a $6.6 billion market cap, it remains one of the top 20 most valuable cryptocurrencies in the world.\n\nInjective\n\nInjective (INJ 2.62%) is a Layer-1 blockchain that was purpose-built for decentralized finance (DeFi). In theory, core DeFi activities -- such as being able to create new DeFi lending protocols, or swapping tokens on decentralized exchanges -- should be faster, cheaper, and easier on Injective than on rival blockchains. In terms of utility, Injective is the blockchain you use if you want to build new financial applications or participate in DeFi.\n\nAnd, indeed, as measured by one important metric, total value locked (TVL), Injective is gaining ground in the DeFi world. In February, Injective set a record with more than $110 million in TVL, suggesting that more and more crypto users are embracing Injective as an on-ramp to DeFi. Right now, there are more than 100 projects on the Injective blockchain, and a reported 150,000 community members.\n\nBut, as with Polygon, the results just haven't been there this year for Injective. After soaring in price from $1.25 in January 2023 to over $50 in March 2024, Injective is now down about 35% year to date. With a $2.4 billion market cap, though, Injective still ranks as a top 50 crypto in terms of valuation.\n\nThe ongoing search for utility in crypto\n\nDuring a January AMA (\"Ask Me Anything\") on X (formerly known as Twitter), Cuban shared an important insight about investing in crypto: \"I hate the speculation but love when there is utility.\" Like many longtime crypto investors, he's seen the extreme volatility in the crypto market, and has warned against believing too much in the hype and speculation surrounding certain coins.\n\nTo mitigate some of that risk, one option is to focus on utility. If you don't understand what a crypto does, or what purpose it serves, it might just be that there is no purpose. If that's the case, then you probably shouldn't be adding it to your portfolio. Trying to chase a speculative meme coin may be fun, but it will rarely be profitable. There's no guarantee that you will be profitable with utility coins either, but understanding the core use cases of a crypto can help you make smarter long-term investment decisions."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPS1F5ajZmSV9QVHo0dWRkSUdIbmN5YVk4S0E0TkIzNllva0MwMEtvSVdQSHFteFNmVURfN191SEZCekZnSnhVWjRBWURkbVVDV1dLbjZCbHRnX0VLaEZUd2lBXzNkd2JIbURBSldYc05oaWN4SE90R1lodjEwWTAybGw5cG0ySV9iVHFv0gGQAUFVX3lxTE1aY254c2lqQ0RibEl0UVB1c3RwOEJ0dWx0UWtmRElvSDZheF9nRTVQUXZ0LXNaZWlqZmFqY1B4X2FPTEZsaV9CZ2U1clJtWVVORWlIVkxCVFZTWEM5WXhQWDNoLWU5dWpaZlZqdG5uSUJIOVo4Y0Z6d3F0MkJfdTMxLXhCNUZ1V1RDOUs3am85Rg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum again: ‘Small blocker argument’ returns - AMBCrypto News",
        "content": "Ethereum’s disregard of L1s raises questions once again.\n\nLayer 2 security concerns challenge Ethereum’s decentralization commitment.\n\nAmidst the ongoing crypto bloodbath, Ethereum [ETH], the leading altcoin, mirrors Bitcoin’s [BTC] downward trajectory, with its daily and weekly charts awash in red.\n\nWhile it records a modest 3% dip in one day, the past week has seen more significant losses, with double-digit declines exceeding 16%.\n\nHowever, amidst these volatile swings, an unexpected question arises: Does Ethereum’s architecture hold the top spot?\n\nConcerns surrounding ETH’s architecture?\n\nIn a recent article, David Hoffman, co-owner at Bankless, highlighting the lasting impact of the Bitcoin block size wars on today’s crypto community said,\n\n“A lot of people’s arguments about how you should build crypto or what crypto should look like can be characterized as like a big blocker or a small blocker argument.”\n\nInterestingly, outlining the modern-day scenario he added,\n\n“Solana is the big blocker and Ethereum is the small blocker.”\n\nThis underscores the ongoing debate wherein Solana [SOL] advocates for L1 scalability, aiming for instant, free transactions. While Ethereum prioritizes L1 decentralization, emphasizing L2 scaling.\n\nFurthermore, delving into the concept of block complexity, comparing blockchains with and without a virtual machine, Hoffman said,\n\n“All chains before Ethereum were missing this key element, and instead tried to add functionality as individual op-codes, rather than a fully expressive virtual machine.”\n\nAdditionally, reiterating the importance of finding a balance between scalability and decentralization, Vitalik Buterin, in his 2019 article noted,\n\n“Keep layer 1 simple, make up for it on layer 2″ is NOT a universal answer to blockchain scalability and functionality problems.”\n\nButerin said this because this approach fails to consider that L1 blockchains themselves must have a sufficient level of scalability and functionality for this ‘building on top’ to be possible”.\n\nWhat’s more to it?\n\nNeedless to say, this has resulted in ETH becoming less affordable for individual users but more suitable for entities like chains, exchanges, and funds.\n\nRemarking on the same, @RyanSAdams highlighted,\n\n“’Ethereum is too expensive’ is a really bad take.”\n\nAdditionally, comparing Ethereum L2 solutions with the Cosmos chains, Sam Hart noted,\n\n“Cosmos isn’t a technology or an ecosystem, it’s the choice to build a sovereign application that seeks to interoperate with others.”\n\nIn fact, recent allegations of top Layer 2 solutions potentially mishandling user funds have raised doubts about Ethereum’s commitment to decentralization, echoing concerns voiced by Justin Bons,\n\n“ETH gives decentralization lip service, but actions speak louder than words.”\n\nAll this brings forth a question: Does Ethereum’s architecture need a revamp?"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNbGNkbWlxcWszT2w4eEVoTTJYY29lYjg1T2R2azQ5MTVBSENKYkVhQTJPeTFjWWFudFJsMmViMUo5MGlLdTNzWFVhZTJyS0g5UGNSMTF4OXlmbGFucV9OWFRrWlZKMVh2M1ZsUnB4YnJadUREY1MwaTd1SDVQM2hLRDZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Degen Chain L3 leads Ethereum TPS rankings - CryptoTvplus",
        "content": "In comparison to Ethereum and Base, where the average transaction values are $1,867 and $170, respectively, Degen Chain sees a notably lower average transaction value of $0.27.\n\nOver the past 24 hours, Degen Chain, a recent addition to the Ethereum ecosystem, has achieved the highest transaction per second (TPS) rate among Ethereum layer-3 networks.\n\nOn the last day, Degen’s transaction per second (TPS) count surged by over 68% to reach 37.12 TPS, surpassing its underlying blockchain, Base, which stood at 30.81 TPS, as reported by L2BEAT\n\nArbitrum One, Ethereum, and zkSync Era completed the top five rankings.\n\nWith Degen’s 35.7 TPS multiplied by 86,400 seconds in a day, the memecoin chain handled a total of 3.08 million transactions during that period.\n\nDespite its high transaction throughput, Degen Chain recorded only $846,191 in trading volume over the last day, ranking it 41st out of 66 blockchains tracked by CoinGecko.\n\nDespite its widespread use in measuring a blockchain’s scalability limits, transactions per second (TPS) is considered by many industry leaders as a flawed metric.\n\nThis is because TPS fails to account for the computational size of each transaction, which can vary significantly and impact the network’s overall performance. This oversight suggests that TPS alone may not fully represent a blockchain’s capacity or efficiency.\n\nThe Degen (DEGEN) token, which was initially conceived as a tipping token for users engaging with Degen’s channel on the Farcaster platform, has evolved beyond its original purpose.\n\nIt now serves as the primary currency of a memecoin that has transitioned into its own blockchain ecosystem.\n\nAccording to CoinGecko, Degen Chain currently holds $4.1 million in total value locked, while the DEGEN token, which is only three months old, commands a market capitalization of $326 million.\n\nDegen Chain, regarded as an ultra-low-cost, application-specific layer 3 blockchain, was constructed using Arbitrum Orbit and utilizes Base’s settlement layer, an Ethereum layer-2 scaling solution.\n\nRead also: Sora Ventures & Metaplanet partner for ‘Asia’s Microstrategy’"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQMW9weS1wNTNzdllCb1Nrd18zazhJRl9vRldiMkxuUXRnbGlzZnUweWpXWldYYVkzTzZmWWVZM2tCOE9DV2dUV3BZRHI5WFhab1VlWFZFam1MOEZYTURDRVlBcnliQ285T0JTQ2lTUHZTZ25tSkFsTEtiREIzNVZDSnBQekUwamRKRmczaGx6bFc2NWRQbmtlWTB4aFR2RklwUXd3aGZGVW9wRklaOTlqWE1YMkTSAbwBQVVfeXFMTkROMTIzSG0ydzAxTmRnLTU3NWU0Zm5ic2M4SE5fdEVadjZnWTdLQjBhMGs2UzlBT25XZ0ZvOE9nVWM5cFlsSTNBSENtSWZCb0pDcVVjd28yZ3lwcE1LdktVdmxWZFhSWjJ0aHQtQTJlWDQxYUFYZGd1Ny1RYmVKcFNRcm1XZnFDMHhVdHVzUjM4dk5CeEFjTlctSGpDNWRQWnhnRTVpS19rVm56SEt3TjRmOFFQc2tmNmNyQzc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin (WLD) Makes Waves: World Chain Set to Debut as Ethereum Layer 2 Solution - Crypto News Flash",
        "content": "Worldcoin is launching World Chain as a Layer 2 solution on Ethereum to enhance transaction efficiency and cater to a growing user base.\n\nIncorporates Proof of Personhood for secure and private user verification, offering incentives like WLD tokens for verified identities.\n\nWorldcoin is poised to unveil its Ethereum-based Layer-2 solution, known as World Chain, this summer. Created by Worldcoin Foundation, this platform is designed to prioritize real human users over bots by offering them priority in block space allocation and complimentary gas allowances. This innovation not only bolsters the Worldcoin ecosystem but significantly enhances transaction speed, cost-effectiveness, and reliability for its users.\n\nAs I shared in my recent tweet, Worldcoin, envisioned by OpenAI CEO Sam Altman, is gearing up for the summer launch of World Chain. This platform is set to enhance scalability within the Superchain ecosystem and will operate under the security framework provided by its role as an Ethereum Layer 2 solution.\n\n#Worldcoin, the brainchild of# OpenAI CEO Sam Altman, is gearing up to unveil World Chain this summer! 🌍🔗 This innovative project is set to be safeguarded by #Ethereum as an L2 solution and designed for scalability within the Superchain ecosystem. It's going to be… pic.twitter.com/9lZ7cw4JZ8 — Marcel Knobloch aka Collin Brown (@CollinBrownXRP) April 17, 2024\n\nThis initiative emphasizes Worldcoin’s commitment to open-source development and its ambition for community-led governance in the future.\n\nEnhancing User Experience with World ID\n\nAccording to a recent YouTube video from CNF, World Chain will further integrate with World ID’s Proof of Personhood, which uses iris scans to verify individual identities, subsequently rewarding verified users with WLD tokens. Amidst increasing regulatory scrutiny, Worldcoin is also enhancing privacy protections. These enhancements include more robust personal data management options and the implementation of zero-knowledge proofs to ensure network integrity without compromising privacy.\n\nScaling and Interoperability Advancements\n\nAs highlighted in a recent TradingView post, World Chain is engineered to expand capacity and streamline transactions, reducing congestion and lowering transaction costs. The integration of World ID allows users to anonymously prove their identity, securing priority processing and even complimentary gas.\n\nIn alignment with a recent CNF post, Worldcoin has introduced an “unverify” function aimed at giving users greater control over their personal data. This feature, which was developed in response to heightened regulatory scrutiny, allows users to manage their data privacy proactively. Despite these changes, Worldcoin (WLD) has managed to maintain a stable market position.\n\nFurthermore, the blockchain community, including the Optimism team, has expressed enthusiasm for the introduction of World Chain. Notably, Coinbase’s Layer 2 network, Base, also utilizes the OP Stack, underscoring the growing acceptance and implementation of these advanced scaling solutions within the broader blockchain ecosystem.\n\nThe project’s success could serve as a pivotal moment for Ethereum’s Layer 2 solutions and their role in broader blockchain adoption. Current trading data shows Worldcoin (WLD) at $4.83, marking a 3.73% decrease over the past day and a 27.30% drop over the last week, reflecting the volatile nature of cryptocurrency markets.\n\nNo coins selected\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQNm8yNGQ2Rko3ZkNDMmc2aDFmN190OVhXcmRsTU16aW5Iek95cTFadlN2c0N5VWNka05vZ2VWZjFkaHJ2c3BocUF4UFA2b0hJRWo5Ul9FUWhoMHhvbGZodHNiV3hra2l1dDJFU182OFJQdVNkaTBxWFpGUWxlUEw0UUk2TWZGb3dzQ1VVM3h0RE56Y3ltcE5taktyR1JYVFFLMkJHaHlGaEdaTDZZMGp0RTVPQlZ0UE9UQkVNVVU1dTZORVlHelHSAdMBQVVfeXFMTS1xemJkVUpJaFNFNHN1blNtMzNoT0VjRGozeHZDbm9OVWZ0d3JvVXNVNTBBclhid2dVTnJfZmV4VE5BS0IxeFVlUVRlSEtTTHl0eEM4d185dW9wV280UU9CTFRNazBZS2NXRTFDS3RUV0gyV0llajZmcVNzcnVZWmtYVlhuX25xWjN0VlpRclllaGJBaTJfTDZzRTVHVlNNOWx5T1J3VFdlbVVod25SZGFxaG8tRC1MTy1uWnhhYS0yLWFMdGIzUDNHbFdvM19SNEJrcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Loses Crucial Support at $3K – How Low Can ETH Go? - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOSXo5SmxMUUdvelhYd1V2YzJqVUwyc3FTd3Y5ZW56UjlnUkx3cC13SUFwa0V3RjhMVmVQSmRkZ0Z3LVc0U2hmdWlVbGtzRkNCMzEwb3J1SlhLVUd5R3Z2bDNyZkR4SlpvczN5dmFtd3JHR1hMSll1Yl9vWUFGMWJMSmdaUdIBiAFBVV95cUxOSGVFMVZhR25IMU9NZmZyRUpVR2c4cUh1TjZ4Q3Z1SjZ2ejFfaFpPdUY5cEMxbGVQb1dET1JsSG0waVhaR3VYRUlXekVwTGY4U3dqWDFRY3NVVkdHYTJBT2M3OXVuVUpSS1REaHFsckU0Q2gtSnM4ZG1LanpaX2FqWXgxWHBfS2Jf?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin’s halving will be better for Ethereum, XRP, BNB price predictions - AMBCrypto News",
        "content": "Ethereum’s metrics remained bearish.\n\nXRP and BNB looked bullish, however.\n\nWhile all eyes remain on Bitcoin [BTC] halving, altcoins might silently take the cake as they were planning a bull rally.\n\nAs per the latest data, the Altcoin market capitalization had reached a level that was historically followed by price upticks.\n\nTherefore, AMBCrypto checked top alts like Ethereum [ETH], BNB, and XRP to see whether history would repeat itself.\n\nAltcoins are preparing for a rally\n\nBitcoin is expected to undergo its fourth halving soon. Once executed, it will reduce the mining reward by 50%, decreasing from the current 6.25 to 3.125 bitcoins.\n\nThe previous halving happened back in 2020, when BTC’s block reward was reduced from 12.5 to 6.25. At a time when everyone had a keen eye on BTC, altcoins acted interestingly.\n\nTitan of Crypto, a popular crypto analyst, recently posted a tweet highlighting altcoin market capitalization. As per the tweet, the Fibonacci retracement level was at 61.8% on the monthly chart.\n\nIf history is to be considered, each time the metric reached that level, altcoins began bull rallies in the following days. To be precise, similar incidents happened in 2021 and 2016.\n\nWill ETH, BNB, and XRP lead?\n\nAt press time, altcoins were having a tough time. To see whether the trend could change, allowing them to start a bull rally, AMBCrypto first analyzed ETH’s state.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was high compared to the last seven-day average, suggesting buying pressure was weak.\n\nIn fact, selling sentiment among funds and trust investors was high, as evident from its red Funds Premium. Derivatives investors were also selling ETH as its taker buy/sell ratio turned red.\n\nNext, let’s take a look at how XRP has been doing. According to CoinMarketCap, XRP was down by over 20% in the last seven days. The price drop triggered accumulation as buying pressure surged.\n\nAMBCrypto’s analysis of Santiment’s data revealed that XRP’s exchange outflow spiked. The fact that buying pressure was high was also proven by its supply on exchanges, which dropped last week.\n\nInvestors were also confident in XRP, as its positive sentiment graph remained high.\n\nThings for BNB also looked pretty optimistic. While most cryptos bled, BNB held its ground well, as its value surged by 1.3% in the last 24 hours.\n\nRead Binance Coin’s [BNB] Price Prediction 2024-25\n\nWhile the coin’s price rose, its Open Interest also increased. A hike in the metric suggests that the ongoing price trend might continue further.\n\nLooking at the bigger picture, if XRP and BNB’s metrics translate into bull rallies, then they might lead the next altcoin season while post-Bitcoin halving."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQMjI5YWFwbXVGdmg3eWhmZ2MwTVJ1enBPN3E5NjNTUElzdk9YakRYUUt3OUV0ZmJ1Smo1LS1pM24zZVQ1T0tvOWlvdWZwM1IxRzg0dzRBd1g4RnZxdjJ3WmphNTF3c0R1TmVZcHp4Mksza21Ia1A0Z1hzcG9obkFIMktfaU9jVnowRDZLYnRESk5XeTlkcHFnRUNCZUpTWUhfYlFoOXBHaGVaT1FqVlJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum, Solana, and Other Notable Blockchains Endorse a Massive Airdrop - Cointribune EN",
        "content": "Thu 18 Apr 2024 ▪ 3 min read ▪ by Mikaia A.\n\nThe Saga team is weaving a bold plan to dazzle cryptocurrency enthusiasts. Indeed, they are gearing up to launch an airdrop campaign, promising an abundance of eponymous tokens and NFTs. But that’s not all. Heavyweights such as Ethereum, Avalanche, and Polygon stand ready to applaud this generous venture. Stay tuned to not miss out on the bounty this benefactor is about to unleash.\n\nSaga launches a massive crypto airdrop campaign: Power-Level Over 9000!\n\nBeware, do not be fooled by appearances. This Saga in question should not be confused with Solana’s Saga smartphone, that technological gem whose value on eBay surpasses that of the iPhone 15 Pro. No, it is rather a layer 1 blockchain, bringing a ray of hope to the dark universe of cryptocurrencies. Get ready, the Saga saga is just beginning.\n\nThe spotlight is on Saga, the layer 1 blockchain shaking up the gaming world. Their latest announcement? An airdrop campaign so massive that they’ve named it: Power-Level Over 9000! A subtle nod to “Dragon Ball Z,” which now stands as a symbol of the phenomenal magnitude of this initiative, according to Decrypt.\n\nIn partnership with over 100 projects and games, Saga promises epic rewards to those who stake their precious SAGA cryptos. The winners will receive batches of tokens and NFTs to be distributed in the coming months, according to the announcement.\n\n« At Saga, we are immensely proud to promote collaboration and unity within the Web3 gaming community. With partners from various ecosystems, including Ethereum, Solana, Cosmos, Polygon, and Avalance, our airdrop campaign serves as a testament to our unwavering commitment to bringing together the Web3 gaming community. »\n\nEach airdrop is a treasure in itself, offering a variety of prizes from several partner crypto projects. Gaming heavyweights such as Avalanche’s Shrapnel, Ethereum’s The Sandbox, and Ethereum’s Wilder World are already on the list, with more expected to be revealed in the coming days.\n\nA network in full boil\n\nSaga, a layer 1 network, is ushering in a universe where developers deploy their own chains, dubbed “chainlets”. This innovative concept supports an internal dynamic of support among chainlets within the Saga ecosystem.\n\nRenowned for its prolific airdrop campaigns, Saga has set records with 13.4 billion dollars staked on Binance to get SAGA cryptos. Its recent listing on the largest crypto exchange, coupled with its mainnet launch, marks a major milestone for the platform.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQTHVyV1k5c09PaWZydTBHNU15UjFTX2I1OUhIQ3phN0lxTFVzczhhaW80V3BOLVlWbWN5MGVpSlk0WmFBamd6dlhvdVF3UTRDMUljSlV0RjdDMm5lY2xBYjBMT1ZZTHBkVkFWdzM4TENnR2thbFdQUlN0ZGVfU1NEVDRjMkRpSzdMN0ZXZVZYYUNMTFpsRkY2WFNRZzF0M25iT3QwZDJ6UnBZT1FBblFYemRfWEV4TjN0MFFZai1hM3JNcXd1a24yVEtNTVVaenVrVmxGSVNVS0paLXIxUjdlZVZHZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "BTC/USD: Bitcoin Briefly Dips Below $60,000 as Crypto Market Sheds $200B in Broad Pullback - TradingView",
        "content": "Illustration by TradingView\n\nBears are taking over the week with major tokens getting hurt badly. Solana nurses a 20% loss. Ethereum is down 15%.\n\nKey Points:"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVGhhdjNXMXp5ekZPX0E0ZzA3QUFRS0RlVURId0tvUTFtcTlFNzNlYmx1bWNnNnpLMzNKdHJWankxbXJoSUNRS2hEV05CZS1GclFPVHl0RXEySUg3Y1pES21lcEh0NUIzZFBTOGowRHNXakRpY2VfMmVPMDNUUDl4WnBMVWc0akhpRWlGbVVPNnBSa1VYQzk1THVOX2VVLTFPUTBQT0ktUW3SAa4BQVVfeXFMUDNXaExSUjF2R2J5emRIclZ5bUU5c2dYX1R4MFdHTHI1RDYzT3RuREpoTkpfUHdjX19GNnVFaUlCbW85Q21SRWJhbnJRUXhPMVVtOWpocU1hdE4taHprQkR1Vjk5aURzYTZfNkJvejFWYTI3aHc4RHloVGxfTDcwejFmWVlSRzFMX2R2S0dCUEc2QmFESzhJbFV3LWVGc1VuRUZsbERpTzkyODFBNlhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Eprex Review 2024: Legit Crypto Platform? - Fact-Checked! - mid-day.com",
        "content": "Ethereum Eprex is a trading platform designed to cater to all trading needs and help traders experience seamless trading.\n\nEthereum Eprex is a new trading bot that is said to have changed the outlook of crypto trading and helped traders conduct trading effectively and efficiently. Traders have also found the platform to be simple and safe to use and it is said to help them identify the right trading opportunities. The creator of this trading platform also claims that it provides an easy way for novice traders to step into crypto trading. The platform also provides a personalization option, where traders can select the cryptocurrencies they want to invest in and set the parameters according to their trading goals.\n\nADVERTISEMENT\n\nVisit Ethereum Eprex\n\nMany questions arise, such as why Ethereum Eprex has become one of the most popular trading bots in such a limited time, how it has helped traders identify the right opportunities and make huge profits, and if it is safe to use as claimed by the creator.\n\nSo, in this Ethereum Eprex review, we will delve deeper and reveal whether these claims are valid and answer all these important questions. For this, we will take a look at the features of this trading bot, how it works, how to register on this platform, and figure out whether it is worth a shot.\n\nSo, keep reading to learn more about the Ethereum Eprex trading system.\n\nEthereum Eprex - Quick Facts Overview\n\nTrading Platform Ethereum Eprex Platform Type Web-based platform Version AI Version Registration Fee None Verification Required Yes Minimum Deposit $250 Assets Supported Stocks, CDFs, Forex, and various cryptocurrencies Payout Time 24 hours Deposit Method Supports different deposit and withdrawal options Customer Support 24/7 Official Website Click Here\n\nWhat Is Ethereum Eprex?\n\nEthereum Eprex is a trading platform designed to cater to all trading needs and help traders experience seamless trading. This platform is designed using advanced technologies such as advanced algorithms, artificial intelligence, and analytics. With the help of these technologies, this platform enables traders to get real-time data and other valuable insights into the market and helps them make informed decisions.\n\nTraders can also customize their trading prospects according to their trading requirements and goals. They can set parameters such as entry and exit points, stop-loss, and take-profit orders. The Ethereum Eprex platform is integrated with top-grade resources, such as brokerage services where various deposit and withdrawal methods are available, and offers traders 24/7 customer support.\n\nLet’s look into more prospects of this trading platform in the coming sections of this review.\n\nStart Trading With Ethereum Eprex For Free\n\nEthereum Eprex Key Features\n\nThe creator of the Ethereum Eprex platform claims that several technologies and tools have been used to enhance the functionality and working of this platform. So, here we will look at the main features of this trading bot.\n\nIntegrated With Advanced Technologies\n\nThe Ethereum Eprex platform has been integrated with the latest and advanced technologies such as artificial intelligence, algorithms, and analytics. Using these technologies, trading boundaries are expanded and upgraded to enhance the overall trading experience.\n\nThe Ethereum Eprex platform has been integrated with the latest and advanced technologies such as artificial intelligence, algorithms, and analytics. Using these technologies, trading boundaries are expanded and upgraded to enhance the overall trading experience. Generates Precise Trading Signals\n\nUsing advanced technologies, the Ethereum Eprex trading platform gives traders insights into the current market conditions. It also generates accurate trade signals using mathematical algorithms based on market performance. From this, traders can identify the right time to buy or sell a crypto.\n\nUsing advanced technologies, the Ethereum Eprex trading platform gives traders insights into the current market conditions. It also generates accurate trade signals using mathematical algorithms based on market performance. From this, traders can identify the right time to buy or sell a crypto. Customization\n\nUsing the Ethereum Eprex trading system, traders can set the trading parameters according to their trading goals and experience. They can get a complete personalized experience through this platform. All the important parameters such as entry and exit points, take-profit and stop-loss, and others can be set through this system.\n\nUsing the Ethereum Eprex trading system, traders can set the trading parameters according to their trading goals and experience. They can get a complete personalized experience through this platform. All the important parameters such as entry and exit points, take-profit and stop-loss, and others can be set through this system. Manage Portfolio\n\nAnother advantage of Ethereum Eprex is that traders trade in different cryptocurrencies and other assets from this single platform. They can manage the collection of crypto assets through this system. This provides an opportunity for traders to efficiently control their inventory and analyze the performance of each currency or stock.\n\nAnother advantage of Ethereum Eprex is that traders trade in different cryptocurrencies and other assets from this single platform. They can manage the collection of crypto assets through this system. This provides an opportunity for traders to efficiently control their inventory and analyze the performance of each currency or stock. User-friendly Interface\n\nThe important aspect of any system or platform is that it should have an intuitive and user-friendly interface. This can enable the users to navigate the platform without difficulties. It allows Ethereum Eprex users, experts, and novice traders to get a seamless experience.\n\nThe important aspect of any system or platform is that it should have an intuitive and user-friendly interface. This can enable the users to navigate the platform without difficulties. It allows Ethereum Eprex users, experts, and novice traders to get a seamless experience. Safe And Secure Trading Experience\n\nThe Ethereum Eprex platform follows all the safety and security protocols and offers safe transactions. The system is also integrated with two-factor authentication and the latest encryption technology, and stores every data securely. Every trader has autonomy over their invested money and assets.\n\nTry Ethereum Eprex For Free\n\nHow Does Ethereum Eprex Trading System Work?\n\nHow does Ethereum Eprex work? This is a popular question among many people looking for the perfect platform that not only helps them achieve immense profits but also offers them a safe and secure trading environment. So, let’s look at how this platform works.\n\nThis system collects real-time market data from authentic sources. Traders can view the in-depth data presented in the form of charts, histograms, and other data flow diagrams. All the information, such as prices, trading volumes, and other crucial metric data is given. Traders can also track the performance of their assets and the total asset value in the current scenario using the portfolio system. Traders can improve their decision-making by analyzing all the valuable market insights.\n\nEthereum Eprex has a risk-management system that can help traders identify potential risks and give accurate predictions about how a particular asset or currency will perform in a year or a month.\n\nWith the help of such a system, traders can grab profitable opportunities and minimize any risks. They can also personalize the different aspects by setting up the parameters such as entry and exit trading, and other similar ones. Traders can shift between automatic and manual trading options according to their needs. Even beginners can step into trading through this platform, with the help of the free demo mode, which can give you first-hand experience in trading without having to make any real investments.\n\nThereby, the Ethereum Eprex platform offers a seamless trading experience.\n\nHow To Register On Ethereum Eprex?\n\nThere are only 3 simple steps to follow to register on Ethereum Eprex. Let’s go through the steps involved.\n\nStep 1 - Free Registration\n\nThe first step is to register yourself on the Ethereum Eprex platform. You can visit the official page, click on Register, and fill out the registration form. Basic details such as name, date of birth, phone number, email address, and other details should be filled out.\n\nWhen you submit the form, your details will be verified by the Ethereum Eprex verification team. After your details have been found authentic, they will send a confirmation email. Thus, your profile registration is completed and you don’t need to pay any registration charges.\n\nStep 2 - Invest\n\nTo start trading on the Ethereum Eprex platform, you need to invest an initial capital of $250. The initial investment can be increased according to your trading experience and goals. There is no need to pay any deposit charges or any maintenance fee. You will have full autonomy over their investment and the assets they have invested.\n\nStep 3 - Start Trading\n\nOnce you complete the initial investment, you can start trading through the Ethereum Eprex system. You can set the parameters such as entry and exit points, pricing, and other factors. The platform also gives you valuable insights into the market performance and you can identify potential opportunities.\n\nRegister On Ethereum Eprex For Free\n\nEthereum Eprex - Pros and Cons\n\nHere we will look at the potential advantages and disadvantages of the Ethereum Eprex trading system. Noted below are some of the pros and cons of using this platform.\n\nPros:\n\nNo registration charges or maintenance fees\n\nUser-friendly and intuitive interface\n\nSimple to use trading system\n\nCustomization options are available\n\nIntegrated with the latest and advanced technologies\n\nGenerates accurate trade signals\n\nFree demo mode\n\nSupports different assets and cryptocurrencies\n\nSimple portfolio management\n\n24/7 customer support\n\nCons:\n\nA few countries such as the United States, Cyprus, France, Iran, and Israel have strict trading laws and as a result, the Ethereum Eprex trading platform cannot be accessed in these countries.\n\nEthereum Eprex: Minimum Cost and other deposits\n\nEthereum Eprex is a free trading system. You do not have to pay any registration fees or make any sort of payment such as maintenance fees. To start trading through this platform, you should make an initial deposit of $250 after you complete the registration process. You can increase the initial deposit as per your trading goals and expertise. The platform supports various payment and withdrawal methods. You have overall control over your assets and the money invested and it can be withdrawn at any time.\n\nEthereum Eprex: Cryptocurrencies\n\nThe Ethereum Eprex platform supports a wide range of cryptocurrencies and other assets such as forex, CDFs, stocks, and others. Mentioned below are the crypto assets supported by this platform.\n\nBitcoin (BTC)\n\nBinance Coin (BNC)\n\nEthereum (ETH)\n\nEthereum Classic (ETC)\n\nDash (DASH)\n\nCardano (ADA)\n\nRipple (XRP)\n\nDogecoin (DOGE)\n\nMontero (XMR)\n\nLitecoin (LTC)\n\nYou can view the full list of cryptocurrencies and assets supported on this platform on the official website.\n\nTry Ethereum Eprex For Free\n\nEthereum Eprex: Customer Support\n\nThe Ethereum Eprex customer support is available 24/7. Experts lead the team, and they can help resolve any issue, at any point of the day. You can contact them to resolve any technical issues or clear any of the platform-related doubts, and they will be available to solve any of the issues that you are facing. Ethereum Eprex users have said that the team has resolved issues such as glitches and transaction issues, and cleared doubts in just a couple of minutes.\n\nIs Ethereum Eprex a Legit Platform?\n\nSeveral factors of the Ethereum Eprex trading system prove that it is a legitimate platform. The most crucial aspect is that using this platform does not cost a penny. Users do not have to pay any registration or maintenance fee, and no hidden charges are levied. In addition to this, all the safety measures are integrated into this platform to ensure that no foul play takes place. This is especially true when it comes to transactions, the latest encryption technology has been used to prevent any money leakage. All users are verified by the Ethereum Eprex verification team before they start using the platform.\n\nThe creator of this platform aims to give traders a simple and hassle-free trading experience. For this, the latest technologies such as artificial intelligence, algorithms, and analytics are integrated into this platform, which not only gives you real-time market performance but also helps to manage all the risks and reduce losses. The Ethereum Eprex technology has a high user success rate and has been receiving positive feedback from its users. So, these factors prove that Ethereum Eprex is a legitimate trading platform.\n\nEthereum Eprex Review - Final Verdict\n\nIn this Ethereum Eprex review, we have covered all the important aspects of the trading platform and we can conclude that it is a safe and genuine trading platform. With the help of top-notch technologies, the system can help traders in their every move. The latest technologies that have been integrated with this platform give a seamless trading experience to the users. Traders who have used the platform have said that the accurate market performance and access to real-time data have helped them make the right decisions and consistent profits. This system also provides a safe and secure trading environment for all its users and both novice and experienced traders can benefit from this platform. This is a free-trading platform and does not charge any registration fee, maintenance fee, or transaction fees. Users have also said that it is a safe and secure platform that guarantees to protect user data.\n\nEvaluating all the information, the Ethereum Eprex trading bot does seem to be worth a shot.\n\nTrade With Ethereum Eprex For Free\n\nEthereum Eprex - FAQs\n\n1. Is there a registration fee for Ethereum Eprex?\n\nNo, Ethereum Eprex is a free trading platform. Users do not have to pay any registration or any other fee to use the platform.\n\n2. I have no prior experience in trading. Is the Ethereum Eprex platform perfect to jumpstart my trading career?\n\nThe Ethereum Eprex trading platform is perfect for both novice and experienced traders. Novice traders can start by using the free demo mode to get familiarized with the trading.\n\n3. Is there an age limit for using Ethereum Eprex?\n\nIndividuals who are above 18 years of age can use the Ethereum Eprex trading platform. Individuals under 18 years of age are restricted from using this platform.\n\n4. I am currently residing in Singapore. Is the Ethereum Eprex system legal in this country?\n\nYes, the Ethereum Eprex trading system is available in most of the countries. However, due to some trading restrictions, it cannot be used in some countries such as the United States, Iran, Israel, Cyprus, and France.\n\n5. Can I access my Ethereum Eprex account on my mobile phone?\n\nYes, Ethereum Eprex is a web-based system supported on different devices such as mobile phones, desktops, and laptops.\n\nVisit Ethereum Eprex For Free\n\n“Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.”"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPMEcyY1hEQ1dxcV9Hc09RcERhemdrN2x5ZlcyakJpZ0JteTlpcEhuT3RDbmpwbE9kV0lzYkQyWnhuQmlFVVpHQUpCOUdCa3RycFJfNzJMVXZGN2MxWHJ6RDFteXZsSDNPSDlOc1g2bERfRUN5eDVSdHg2TDd1bHFGNWlwdHZXMVVX0gGOAUFVX3lxTFBnaFpIYVVxVnBnVmhTclpaSlFZQXJaUmJWaHFhcS1BSFF4b3FCNXNDWEo3eDZ6VjVpRWFtU3UyakF3Ym13RlRuRlc3LTMyVi1TYk9VZVRxY0NLRVB6MHpZOV9zVXZWY21vaXR3OTFDUVBqU1J4Vk5sS01rRks0bkU2ZmlNTmJvVXBRS0I0TXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin becomes part of Ethereum L2: Will WLD rally again? - AMBCrypto News",
        "content": "Worldcoin to get its L2.\n\nWLD has remained in the $4.7 price zone despite the latest announcement.\n\nWorldcoin [WLD] has a knack for the dramatic, and this trend continued with its recent announcement.\n\nFollowing the controversy surrounding iris scanning, the platform has announced plans to launch its Layer 2 (L2) solution. Did this latest announcement move the price of WLD in any way?\n\nWorldcoin’s Layer 2\n\nIn its announcement on the 17th of April, Worldcoin revealed the launch of what it termed the “World Chain.” This new platform is described as a Layer 2 solution built on the network.\n\nNotably, the World Chain will be secured by Ethereum [ETH]. The announcement also mentioned the presence of bots on the platform, with some deemed necessary.\n\nTo address potential network congestion caused by unnecessary bots, Worldcoin plans to leverage World ID to distinguish between bots and human users.\n\nAdditionally, the post highlighted the prominent role of WLD, Worldcoin’s native token, which will be utilized for gas fees alongside ETH.\n\nDid Worldcoin react?\n\nThe latest announcement from Worldcoin introduced a new utility for WLD, yet it failed to prevent the observed decline.\n\nAnalysis of the daily timeframe chart reveals that WLD concluded the day with a negative performance despite the announcement.\n\nBy the end of the trading session on the 17th of April, WLD experienced a decline of over 6%, trading around $4.7.\n\nAt the time of writing, it fluctuated between gains and losses, exhibiting a less than 1% increase while still trading around $4.7.\n\nThe long Moving Average (blue line) currently acts as support around $4. Still, a breach below it could initiate a more significant decline.\n\nFurthermore, the Relative Strength Index (RSI) confirmed a bear trend, with the RSI below 40, indicating a strong bearish sentiment.\n\nThis trend suggested that WLD had its trajectory, and the recent announcement failed to generate any positive impact.\n\nActive addresses show reduced activity\n\nBesides the price movement, analysis of the 24-hour and 30-day active addresses metrics indicated a lack of excitement surrounding Worldcoin.\n\nRead Worldcoin’s [WLD] Price Prediction 2024-23\n\nAccording to Santiment, the 24-hour active addresses metric shows no significant change between the 17th of April to press time, with a slight decline observed.\n\nAt the time of this writing, there are 321 active addresses. Additionally, the 30-day active addresses metric reveals significant declines over the past few weeks, with only 6,483 active addresses at the time of writing."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQcm9waE91MURuZTlzSDFMdGxXUkMyMktrRjFEMmE5cHBRdV9sOTRFRmdDRlRMUVlKNHAzN2lKTG8zTWlyZWF6MG5pOWxiZUxhMGNQVktscnU5U2RyZmhkbWJDdXh3YjROdGxoa1N3ZldzU24xTVoyOTQ0YmpSYTVyY2RJUDVqQTh1MHZnMjJ30gGOAUFVX3lxTFByb3BoT3UxRG5lOXNIMUx0bFdSQzIyS2tGMUQyYTlwcFF1X2w5NEVGZ0NGVExRWUo0cDM3aUpMbzNNaXJlYXowbmk5bGJlTGEwY1BWS2xydTlTZHJmaGRtYkN1eHdiNE50bGhrU3dmV3NTbjFNWjI5NDRialJhNXJjZElQNWpBOHUwdmcyMnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Dogecoin20 Witnesses 100% Surge on Uniswap Debut - - Disrupt Africa",
        "content": "Dogecoin20, an Ethereum-based alternative to Dogecoin, skyrocketed over 100% on Uniswap debut.\n\nDogecoin20 (DOGE20), an Ethereum-based token positioned as an alternative to Dogecoin (DOGE), experienced a rapid surge in value, rallying over 100% within an hour of its listing on the decentralised exchange (DEX) Uniswap.\n\nThe surge in trading activity was primarily attributed to the anticipation surrounding Saturday, 20 April 2024, a day significant within the crypto community due to the scheduled Bitcoin halving and International Doge Day celebrations.\n\nOriginally slated to conclude on 20 April, the DOGE20 token claim went live at 10am UTC following a successful initial coin offering (ICO) that raised over $10 million throughout March.\n\nThe decision to conclude the ICO earlier than planned was driven by the substantial demand observed and the strategic alignment with Doge Day.\n\nUpon its listing on Uniswap, DOGE20 witnessed a remarkable price surge, climbing by 101% to reach $0.0003632 USD within a 45-minute timeframe.\n\nSubsequently, the token experienced a slight retracement as early investors capitalised on profits, although it maintained a trading level above its initial launch price, consolidating for potential future fluctuations.\n\nBUY AND STAKE $DOGE20 TODAY AND JOIN THE BULL RUN!\n\nDOGE20 distinguishes itself from Dogecoin by leveraging the Ethereum network’s ERC-20 token standard, allowing for the implementation of smart contracts and enabling various decentralised finance (DeFi) applications.\n\nEthereum’s infrastructure provides efficiency and cost-effectiveness compared to networks using older technologies like Bitcoin’s Proof-of-Work (PoW) consensus mechanism.\n\nA notable feature of DOGE20 is its staking mechanism, offering a substantial annual percentage yield (APY) of 41% for participants who engage in token staking. This aims to incentivise long-term holding and community engagement, with a significant portion of tokens already staked, reflecting strong commitment among holders.\n\nAdditionally, DOGE20 maintains a capped total supply of 140 billion tokens to ensure scarcity and potential value appreciation.\n\nDespite its relatively modest market capitalisation of less than $30 million, DOGE20 has attracted over $1 million in liquidity on Uniswap, facilitating seamless trading for investors seeking exposure to this emerging Ethereum-based meme coin.\n\nTRADE $DOGE20 ON UNISWAP\n\nAs Doge Day approaches, investors are presented with an opportunity to participate in the DOGE20 ecosystem, leveraging its listing on Uniswap to access the token’s trading liquidity.\n\nIn conclusion, DOGE20’s rapid surge on Uniswap underscores growing interest in meme coins and Ethereum-based tokens. The project’s listing on a prominent DEX provides accessibility to traders seeking exposure to innovative projects within the crypto space.\n\nWith Doge Day coming up, this will be the investor’s last chance to buy $DOGE20 at its current low price."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQTTgyZEpaeUdJdzctV1AtU3hEN3hzOEtoTHhCbldUVlZPNGNhRDZtTXUtYjM0eXB0SU1PQm1YMG5vYUQ0aDdyM3pSWnVGdjR0SDU0QlI2bHlHV1ZkWS1ZaV83OWI3aVozTVJaT1QxVEJaRXUwVTVWTzg0blZVWFFpakw3eWJnRHRYdUJGSENWbWFDdV93RWtPMG1KV2RhT0Uydkl5QzgzVDRWb2_SAbABQVVfeXFMTzdyVXEtdWQ0TzlqaFkwRGxNR3BzRmxPZVFnLW9NampvdUNtNkRoQ2xsYXJ6ZHhrbWl4bHh4RFdTdkVyaDB5OE14b01Qc3RDZWZYMG5tcUVBcHk1LUI1Vnhmb0tReFhqNklUVG00U2lKMkowdXNJUTFxWi1yUkdJSExBbE5DZFRfbFEzLW9vOGhDZmZMVmkyUXBianVwVkg2TUhXUEQxQWthNnJMNVpHcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Should You Hold or Sell Ethereum? Expert Insights Ahead of the SEC’s ETF Decision - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nShould You Hold or Sell Ethereum? Expert Insights Ahead of the SEC’s ETF Decision\n\n\n\nAs the deadline for the SEC’s decision on spot Ethereum ETFs approaches, investors are questioning whether to hold or sell their Ethereum holdings. Experts weigh in on the potential impact of the expected rejection and its implications for the broader cryptocurrency market.\n\nExperts and their Insights\n\nAnalysts anticipate that the SEC will likely reject spot Ethereum ETF applications by the end of May. Bloomberg ETF analyst Eric Balchunas has revised his approval estimate from 70% to 25%, signaling a bearish sentiment.\n\nSimilarly, decentralized prediction markets suggest bleak probabilities of approval, with figures as low as 18%.\n\nLark Davis’s Perspective\n\nRenowned crypto investor Lark Davis believes that the market has already priced in the anticipated rejection. He states, “At this stage, I think the rejection is priced in. No one is expecting an approval right now.”\n\nDavis emphasizes that while there may be short-term volatility after the announcement, the overall impact on Ethereum’s price is likely minimal.\n\nDavis references the efficient-market hypothesis, asserting that current asset prices reflect available information. He notes that an unexpected approval would significantly impact Ethereum’s price more, signaling new demand vectors.\n\nAssessing the Impact on Bitcoin and the Broader Market\n\nBitcoin and Ethereum often move in tandem, with a correlation of about 62% as of April 11. Given their substantial market capitalizations, any significant movement in either cryptocurrency can influence the entire crypto ecosystem.\n\nWhile experts anticipate a rejection, they believe it won’t significantly affect Ethereum’s price or the broader market. Davis argues that Ethereum’s performance without an ETF has been robust, citing a 45% year-to-date increase.\n\nAlso Read : Ethereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here’s Why\n\nLong-Term Outlook and ETF Approval\n\nDespite the expected rejection, experts foresee eventual approval over the long term. Comparing Ethereum’s utility to Bitcoin’s, analysts highlight Ethereum’s focus on decentralized applications and technological innovation.\n\nWhile the approval timeline remains uncertain, analysts believe it won’t occur in May. Nevertheless, they anticipate no significant price decrease in Ethereum post-rejection.\n\nAs the SEC’s decision on spot Ethereum ETFs looms, investors grapple with whether to sell or hold their Ethereum holdings. Expert opinions suggest that while the rejection may cause short-term volatility, Ethereum’s long-term prospects remain bullish, irrespective of the outcome."
    }
]