[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5sdFp6UmR3TE1JRWRfR1p3TzgyYUtISVlvN2RvQWVzTlBlQjE2QlNJVjQybGZkcC16cVhIZldkamluN1FURU9rQzlGTXUzdi1aZ0VzTWF4YjYwZFJERl9kUnd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "What Is Ethereum And How Does It Work? - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOY3V1UU9IanBvLUdHNjFLRHROaVJ0MGVVeEs2LUZJaWVTNXhMN19kaGl4R3Z3RGlYMU5fWnhQTVZGaVdUWFJtVFZyZXRrZjhfdHNFa2xuRGpDNnV4ZlFTOW0talNmZkNxT2JiMXlydExQTDJ2c25yTkR2Vm5QNHVrcjBsem5fekloa2M3TkZrV1RDTndNOVNJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "SEC approval of Ether ETFs acknowledges Ether is a commodity - Ledger Insights",
        "content": "Yesterday the U.S. Securities and Exchange Commission (SEC) approved the listing of eight spot Ether ETFs in a bulk order. However, there is another formality before they can be sold to the public, which may take a few months. A key aspect of the order is that each ETF is considered a ‘Commodity-Based Trust Share’. Several years ago the SEC classified Ether as a commodity, but that changed over a year ago without any announcement. It concluded that Ether had become a security following the migration to Ethereum 2.0, which adopted Proof of Stake. This came to light due to Ethereum development house Consensys suing the SEC over claims that Ether is a security.\n\nTherefore, the ETF’s recognition of Ether as a commodity marks a significant reversal. There’s considerable debate about the reason for the abrupt shift. With Congress passing the FIT 21 crypto Bill this week with the backing of many Democrats, the politics around crypto is shifting. That’s particularly in the run up to an election where the Biden administration’s crypto stance might be viewed as a potential vote loser.\n\nInterestingly, the SEC Commissioners did not directly vote on the ETFs, unlike the Bitcoin ETFs. Instead, they delegated the authority to the Division of Trading and Markets. While delegation is a common practice, it’s notable that this decision would not have been made without the majority of the Commissioners’ approval, as highlighted by Bloomberg’s James Seyffart.\n\nThe eight ETFs are from Grayscale, Bitwise, BlackRock’s iShares, VanEck, ARK 21shares, Invesco Galaxy, Fidelity and Franklin Templeton.\n\nConsensys to continue its fight\n\nMeanwhile, Consensys has vowed to continue with its litigation against the SEC. “Today’s approval signals that the SEC views that ETH is a commodity and not a security – contrary to the position it continued to take prior to the events of this week, as described in our recent lawsuit against the SEC,” the company wrote on X. “We will continue to fight for definitive regulatory clarity in our case.”\n\nIt added, “this seemingly last minute approval is yet another example of the SEC’s troublesome ad hoc approach to digital assets.”\n\nIt’s not just the crypto community that’s been unhappy with the SEC. Both Congress and the Senate voted in favor of a resolution to overturn an SEC accounting bulletin (SAB 121) that effectively blocks banks from providing digital asset custody. It is the first digital assets-related law passed by both legislative branches, yet another sign of the changing political tide. However, the White House has vowed to veto it."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE9uWHR5SXNrTzd0RUJDNVJ5Q2NfUVpzNDNJNjc3RGdPZTV5N0xTQlBWWWQtdzBVR1prZXdOdVl4NzRwbktMNjdZYlVOX2hDYmM5c0d6VF9jVWlNOVVUcmxRZDN5bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "How To Short Ether - Investopedia",
        "content": "Short Selling Ethereum\n\nShort selling Ethereum (ETH) involves borrowing ether and immediately selling it, with the plan to buy it back when prices drop. This strategy is used by traders with a bearish outlook on the market to take advantage of declining prices.\n\nA successful short provides a profit of the difference between the sale and repurchase price, less any fees. But it's a strategy that offers the potential for unlimited losses. ETH is a notoriously volatile asset, and losses can mount quickly. To cite an example, on May 21, 2024, the price of ETH spiked 22% in 24 hours on news of a potential ETH exchange-traded fund (ETF), causing over $280 million in losses marketwide on short selling.\n\nBelow, we take you through several ways to short the cryptocurrency.\n\nKey Takeways Short selling ether is borrowing ETH, selling it, and repurchasing it after prices drop.\n\nShort selling ether generally requires a margin account on a cryptocurrency exchange.\n\nShorting ETH allows traders to potentially profit when the price falls. This can be a way to hedge other crypto holdings or capitalize on bearish market sentiment.\n\nWhile it offers the potential for high rewards, shorting ETH carries the risk of unlimited losses.\n\nTraders can use alternative strategies instead of short selling ether, such as buying short ether ETFs.\n\nHow Shorting Ethereum Works\n\nShort selling refers to when an investor borrows an asset—in this case, ETH—and sells it on the open market, planning to repurchase it later for less. The exchanges that allow you to short ETH often require you to hold a margin account. These accounts allow you to borrow money to buy assets, in this case, ETH. What's borrowed, called \"margin,\" is often used to augment your buying power and potentially amplify your gains.\n\nIn May 2024, the Securities and Exchange Commission gave NYSE Arca, Nasdaq, and Cboe BZX the approval to list Ether Spot ETFs. These instruments are similar to the Bitcoin Spot ETFs approved earlier in the year.\n\nSimilar to shorting a regular ETF, once the SEC approves an ETH ETF, you can borrow shares from the broker, sell them immediately, buy them back when prices fall, and then return the shares.\n\nSuppose you think ETH is due to drop in price soon, and you have $10,000 in your margin account, which allows you to trade up to twice what you have in the account. The price of ETH on crypto exchanges is about $4,000. Here are the steps:\n\nBorrow on margin: You decide to use the maximum leverage allowed and borrow an additional $10,000 from your broker, giving you $20,000 to trade. Shorting ETH: You use the entire $20,000 to short sell five ETH. This means you're selling five ETH you've borrowed from the broker, expecting to buy them back later at a lower price. Price drop: As you predicted, the price of ETH plummets to $3,000. Close the position: You buy back five ETH at the new, lower price of $3,000, spending a total of $15,000. Profit time: You return the five borrowed ETH to the broker and walk away with a $5,000 profit (minus any fees or interest).\n\nUsing ETH Futures ETFs\n\nEther futures ETFs began trading in October 2023. If you have a margin account that allows short selling, you can sell short one or more of these Ether ETFs to profit from falling ETH prices.\n\nIf you don't have the desire to sell ETH futures ETF shares short, another option is to purchase a short cryptocurrency ETF, like the Proshares Short Ether Strategy ETF (SETH). This ETF attempts to return the inverse of the Bloomberg Galaxy Ethereum Index."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9TRE1sUXl2TFRrZ3pST0NhNTFnSGJWekxkQ2ZVN2xnQVJ2MlcxeVJ4bEQwRGl3RTdVV19ZVXA3cTBNaHU5aG5MQWxpMXowVlVEZVdQM1FOZzVoNUFWWGgyYUhfeFhUUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum heats up over key ETF decision. Here's what you need to know. - Mashable",
        "content": "Ethereum, the nerdy cryptocurrency that was lately overshadowed by Bitcoin, is in the news again, and the price is pumping. What gives?\n\nWell, only one of the most important developments in Ethereum's history, anon. An Ethereum spot ETF (Exchange Traded-Fund) might get approved in the U.S. today — that's Thursday, May 23.\n\nUPDATE: May. 24, 2024, 11:51 a.m. CEST The first Ethereum ETFs indeed got the nod from regulators on Thursday, though there's more steps and hoops to jump through (see part on the S-1 form below) before they can actually start trading.\n\nBefore we get into all that, here's a very short primer on Ethereum or ETH. Launched in 2015 by programmer Vitalik Buterin and others, Ethereum is the second largest cryptocurrency by market cap, behind Bitcoin, and it has been so for the better part of the past five years or so.\n\nWhat is this Ethereum thing you speak of?\n\nEthereum is a very different beast from Bitcoin. The latter is a digital currency and a public ledger of transactions that uses a network of computers (miners) to securely verify every transaction in the system, as well as create new coins through a computing-intensive process called proof-of-work.\n\nEthereum is a blockchain platform for decentralized apps. Unlike Bitcoin, it uses proof-of-stake to power and secure the network, meaning there is no environmentally unfriendly mining, with validators using a stake of their ether or ETH (the underlying currency of the platform) to validate transactions. Also, unlike Bitcoin, which is all about the secure sending and receiving of bitcoins and fairly little else, Ethereum is a platform for other decentralized apps (also called smart contracts) to run on.\n\nAs you can imagine, this makes Ethereum more powerful than Bitcoin in a sense, but it also makes it more complicated, both in terms of usage and implications. These days, basically everyone — the likes of large banks and pensions funds included — understands Bitcoin to be a largely decentralized digital asset, which can be bought, securely stored and sold, akin to a digital version of gold. Ethereum is a lot more complicated, with the U.S. SEC (Securities and Exchange Commission) not being entirely clear on whether ETH is a security or not.\n\nAn ETH ETF is now a very real possibility\n\nThis leads us to the part about ETFs. In January 2024, after receiving the SEC's blessing, Bitcoin spot ETF funds started trading in the United States. This had immense implications as to who can buy Bitcoin; suddenly, a U.S. state pension fund or an investment fund was able to easily get exposure to Bitcoin without worrying about breaking some rule. And the \"spot\" part, in contrast to a futures ETF, means that the Bitcoin spot ETFs must buy actual Bitcoins when someone buys their product.\n\nMashable Light Speed Want more out-of-this world tech, space and science stories? Sign up for Mashable's weekly Light Speed newsletter. Loading... Sign Me Up By signing up you agree to our Terms of Use and Privacy Policy Thanks for signing up!\n\nThe interest was record-breaking, with more than $13 billion flowing into BTC via spot ETFs since their inception. And unsurprisingly, the price of Bitcoin soared from around $42,000 in early January to roughly $69,500 at writing time.\n\nMany of the same entities — large investment companies such as BlackRock, VanEck, and Ark — also filed for a spot Ethereum ETF, with deadlines for SEC's approval or denial starting on May 23. And up until a few days ago, analysts largely believed that the ETFs would be denied, given SEC's previous reluctance to provide clear guidance over whether ETH is a security or not.\n\nThis has changed. According to Bloomberg senior analyst Eric Balchunas, there was \"chatter\" that the SEC has completely reversed its stance on Ethereum, followed by a slew of potential ETF issuers submitting amended 19b-4 forms to the SEC, signaling that there's a very good chance that the ETFs are on their way for approval.\n\nWe know, the sheer mention of something like a 19b-4 form made you fall asleep instantly. But we mention it because there's another set of forms that need to be approved, the S-1 forms, and those are key for actual ETF approval.\n\nIn practice, this means we could get a very good indication that one or more (probably more) Ethereum ETFs are coming, but it might take weeks or months before they actually start trading.\n\nAs a result of these filings, the price of Ethereum rose from around $3,100 to $3,800, where it's trading at writing time.\n\nOf course, nothing is official or set in stone. The Ethereum ETF applications could still get denied, though the consensus among experts is that it's now a question of when, not if, it will happen. A denial would surely be a cold shower for Ethereum's price, at least in the short term.\n\nThis is one of the most important developments for crypto, period\n\nThis is not just about Ethereum's price. This sudden change of sentiment by the SEC could mean that the U.S. government is suddenly far more open to everything crypto related. Indeed, an important crypto bill was just passed by the U.S. House of Representatives, despite the SEC head Gary Gensler having some very stern words about it.\n\nPerhaps the simplest of implications of this approval is other crypto spot ETFs getting the nod in the future. But with BlackRock launching a tokenized version of its money-market fund on Ethereum, it's getting easy to envision a future in which a big chunk of global finance exists on the blockchain. In other words, your nerdy, crypto-mining neighbor who told you that one day all of finance will roll into crypto, may have actually been right.\n\nWhat now?\n\nWell, unless you're a trader looking to capitalize on price moves, you don't really have to do anything. Regardless of whether the Ethereum spot ETF is denied, approved, or delayed today, Ethereum and its ecosystem of apps will keep trudging along.\n\nBut it is important to consider that a potential approval fully legitimizes an entire new class of crypto assets. Institutions, funds, banks, perhaps even pension funds, will be looking to get in on the action, and it could spark a thriving period for Ethereum, as well as the apps and assets that reside on it. After a bit of a lull in the past couple of years, the crypto space could once again become very exciting over the next couple of years."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOVEsybnV2N0RJMnpwZHUzVWJrdklZRUNaUzYtR2VweXVOX0JmQWhoVk5RVXNySjg4amd2bEVMWGYwR0tadktMY2xPUGN2UmhRS2hrTVJ1SjVWYUhrYUZBTkpWWUE2WjlSd3B2SlJfRk1SLWJqUTgtUmwyMHBJZDJqOEJGXzFidlZRVkRVc0tRdGFaYjlMSlh3cGFVQXcwaTVzYXdGUTE2Q1d3VUlhLV9yUXd3UUViak5YYWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC completes abrupt U-turn to approve Ethereum ETFs in ‘politically driven’ move - Fortune",
        "content": "The Securities and Exchange Commission has green-lighted the listing of eight spot Ether exchange-traded fund on U.S. stock exchanges, approving the asset manager’s 19b-4 form on Thursday afternoon. “It’s one of the biggest regulatory 180s in recent SEC history,” VanEck’s head of digital asset research, Matthew Sigel, told Fortune in a statement. Issuers include BlackRock, VanEck, Fidelity and Grayscale, among others.\n\nThe agency’s relative silence over the pending applications in recent months led many in the cryptocurrency industry to regard an approval this year as a pipe dream. Bloomberg analysts were predicting the odds of approval to be as low as 25% as late as Monday afternoon. But then, in a sudden turn of events, on Monday, CoinDesk first reported that the issuers were “abruptly” asked by regulators to update their 19b-4 filings on an accelerated basis. Since then, at least eight of the nine issuers have done so—and Bloomberg’s experts raised their projection to 75%. The price of Ether has soared 25% since Monday, trading at $3,855 as of 5:13 p.m. EST.\n\nThe SEC will not be commenting on the order, a spokesperson told Fortune.\n\nThe updates requested by the SEC on Monday remain undisclosed, but Eric Balchunas, Bloomberg’s senior ETF analyst, told Fortune he knows “for a fact” that staking will be prohibited. Indeed, Fidelity this week updated its S-1 filing with the staking component omitted.\n\nBut for trading of the financial products to begin, the SEC must next approve the issuers’ S-1 filings. These forms outline to potential investors and the SEC the structure of the asset, how it will be managed, and, in this case, how it plans to mirror the performance of the underlying asset—Ether tokens. But it’s also understood that the approval of these forms is a case of “when not if,” Bloomberg’s James Seyffart wrote on X.\n\n“We can’t recall anytime there would be S-1s not approved after a 19b-4 approval. I don’t think a precedent exists,” Balchnaus added. He estimates the forms will take about two weeks to be approved, as he expects there to be only one round of comments from the SEC. That’s because the spot Bitcoin ETFs already did a lot of the “trailblazing,” so in this case, the applications will require minor “fine-tuning.” In the case of Bitcoin ETFs, each round of comments required two weeks to complete.\n\n“At Grayscale, we appreciate the opportunity to engage constructively with regulators as they review spot Ethereum ETFs, and we remain optimistic about the potential of bringing Ethereum further into the U.S. regulatory perimeter in the ETF wrapper,” a Grayscale spokesperson said in a statement.\n\nThis is a “key step” to offering U.S. investors “easier access, higher protection, and safeguards,” an Invesco spokesperson said.\n\n‘A legitimate voting block’\n\nIt’s the question erupting throughout crypto: Why did the SEC change its tune? Experts told Fortune it was likely a political, top-down order. The approval on Thursday is “proof that the crypto crowd is a legitimate voting block,” says VanEck’s Sigel.\n\nA bipartisan group of crypto-friendly House lawmakers urged the SEC and Chairman Gary Gensler to approve the ETFs in a letter on Wednesday. “The current digital asset regulatory landscape presents various risks to consumers, investors, and market participants,” they wrote. An approval would offer investors access to crypto in a safer, more transparent and regulated format, they argued.\n\nAdmittedly, although the letter is unlikely to have tipped the scale, it does add to a building consensus in Washington that the elusive crypto vote may have weight.\n\n“Politics is powerful, and especially in an election year. What we’ve heard inside is that this was politically driven. The Democrats do not want to see Donald Trump and the Republicans win on this issue, and lose votes from single-issue voters,” says Balchunas.\n\nA survey published this week by the Federal Reserve reveals that just 1% of Americans used crypto to buy something in 2023, but in a razor-thin election, with Trump polling just 1% ahead of President Joe Biden, even 100,000 votes or so could make the difference.\n\n‘Very gratifying’\n\nAs a result, the crypto community appears to be a growing priority in Washington, D.C. On Wednesday, the House of Representatives voted in favor of a landmark piece of regulation that would establish a supervisory framework around the “market structure.”\n\nThe Financial Innovation and Technology for the 21st Century Act, or FIT21, outlines the separation of powers between the Securities and Exchange Commission and the Commodity Futures Trading Commission, as well as creating rules for pivotal questions such as commingling and custody. While the bill was supported by 208 Republicans, at first it was only favored forward by a handful of stubborn, crypto-friendly Democrats. But over the last month, support accelerated, resulting in 71 Democrats voting in favor, with support also coming from Senate Majority Leader Chuck Schumer and former House Speaker Nancy Pelosi.\n\n“It is very gratifying that effective communication by the crypto community changed the politics in Washington to the point that elected Democrat leaders are now voting yes to laws that reverse the regime’s hostile approach to this new asset class,” Sigel says.\n\nFIT21 passing through the House flew in the face of Gensler’s attempts to warn Democrats off it. “[FIT21] would create new regulatory gaps and undermine decades of precedent regarding the oversight of investment contracts, putting investors and capital markets at immeasurable risk,” Gensler said in the statement released Wednesday.\n\nMoreover, over the past month Trump has also doubled down on his pro-crypto stance. On Tuesday, his presidential campaign said it would start to accept donations via any crypto asset accepted through Coinbase. “Biden surrogate Elizabeth Warren said in an attack on cryptocurrency that she was building an ‘anti-crypto army’ to restrict Americans’ right to make their own financial choices,” the campaign said in the announcement, in reference to a reelection ad Warren posted on X last year. “MAGA supporters, now with a new cryptocurrency option, will build a crypto army moving the campaign to victory on November 5th!”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNX2ZVNkpvb3BpeTNCZWE5NTJGS3hsQXVaZFJpTEJnZEh4ZDZJRVNHVTlEdzF3VENmS0xIZlV0aUJBeEZpMTlYblljUmkyMDU3MlpLNDlMWHJ2elJPaXE2Y1hxUUwzdUZWV2d0SjBLWXVoRFVkUktmMHY4dm11NWJnSWhNRi1GM2dMN0pRY1huV09xQks0WVE2eHRreHBzaTJvb25OdDdWT0hyZXhJT205eFNRNDU4RmpIZm9HdnNud193Ykl6WHpF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "MIT Brothers Charged With Exploiting Ethereum to Steal $25 Million - Dark Reading",
        "content": "Many cryptocurrency traders play fast and loose with the systems in place to empower decentralized finance (DeFi), using a variety of hacks to gain an advantage in their trades — from sandwich attacks to rug pull scams — and losses typically run into the tens of millions of dollars per month.\n\nYet, two traders — brothers who both graduated from the Massachussetts Institute of Technology — took their scheme too far, exploiting a vulnerability in a common component used by traders on the Etherium blockchain to score nearly $25 million in an attack that lasted 12 seconds, the US Department of Justice charged on May 16. The two brothers — Anton Peraire-Bueno of Boston and James Peraire-Bueno of New York — discovered the software flaw in 2022, prepared and planned the attacks for months, and then executed the theft in April 2023, law enforcement alleges.\n\nThe attack worried traders and technologists, calling \"the very integrity of the blockchain into question,\" Damian Williams, US attorney for the Southern District of New York, said in a statement from the Justice Department announcing the indictment.\n\n\"The brothers, who studied computer science and math at one of the most prestigious universities in the world, allegedly used their specialized skills and education to tamper with and manipulate the protocols relied upon by millions of Ethereum users across the globe,\" he said. \"And once they put their plan into action, their heist only took 12 seconds to complete. This alleged scheme was novel and has never before been charged.\"\n\nCryptocurrency has gained legitimacy over the past decade and a half, but continues to — in many ways — be a Wild West. In 2023, more than $24 billion in transactions ended up in illicit cryptocurrency wallets or addresses — although more than half of the total belonged to sanctioned organizations and nations, and the total rate of fraud is only 0.34%, according to Chainalysis, a blockchain intelligence firm.\n\nWhile ransomware gangs prefer Bitcoin, Ethereum has seen its fair share of attacks, from the $60 million DAO hack in 2016 that led to a hard fork — a rewriting of the Ethereum ledger — to the more than $600 million in Ethereum stolen from game players on the Ronin Network.\n\nIn many ways, the ecosystem behind cryptocurrencies is undergoing the growing pains that the Internet faced over the past three decades, says Oded Vanunu, chief technologist for Web 3.0 and head of product vulnerability research at cybersecurity firm Check Point Software Technologies.\n\n\"It's crazy, because we are seeing tactics that are being done already in Web 2 platforms that are taking a different shape in the Web 3 protocols,\" he says.\n\nOf Mempools and Maximal Extractable Value\n\nCryptocurrency transfers, the proposal of a smart contract, and the execution of smart contracts are all transactions that are recorded on the blockchain — in Ethereum's case, a public distributed state machine. However, before being recorded, every transaction is placed in a memory pool, or mempool, pending its validation and execution, which typically takes a few steps.\n\nA participant in the ecosystem known as a \"block builder\" will create a bundle — or block — of transactions and get paid by the originator of each transaction for completion, while a \"block proposer\" chooses blocks based on the fees advertised by the builder, validates them, and sends those transactions to its peers on the blockchain network. Typically, a builder is attempting to structure blocks based on a strategy of maximal extractable value (MEV), seeking to maximize profits.\n\nDividing participants into proposers and builders — what's called a proposer-builder separation (PBS) — splits the responsibility of validating transactions to limit the monopolization of the process by large traders who could order transactions in specific ways to drive profits. MEV bots help traders identify and create bundles of transactions that maximize their profits from a transaction.\n\nYet, there is still a lot that traders can do to tilt the playing field. In a sandwich attack, for example, the trader profits from the natural price increases or decreases caused by large cryptocurrency transactions. When a large buy order appears, a builder could place a buy order for the cryptocurrency in front of the order, and a matching sell order after, profiting from the price change caused by the original buy order.\n\nFor many DeFi participants, MEV traders are little better than the equivalent of modern ticket scalpers, but they do serve a critical role, says Adam Hart, product manager at Chainalysis.\n\n\"To many, MEV strategies look like hyper-sophisticated, deep-pocketed traders using their resources to profit by forcing less sophisticated traders to take worse prices,\" he says. \"However, others argue that MEV is inevitable in an open, transparent blockchain network, and that MEV traders play a positive role by ensuring that arbitrage opportunities are exploited quickly so that asset prices remain aligned across protocols.\"\n\nAn Attack on MEV Traders\n\nThe Peraire-Bueno brothers discovered a vulnerability in an open source component of a common tool, known as a MEV-Boost relay, according to a postmortem analysis of the incident. MEV-Boost is a protocol for limiting the centralization of the two components of the Ethereum blockchain — proposers and builders — and the monopolization of profits, which historically could have resulted in a few players dominating the blockchain process.\n\nA key criteria of the MEV-Boost protocol is that the proposer commits to validating a block based on price, before knowing its contents. The brothers allegedly found that signing the header gave them the information in the block, even if the signature was invalid, the postmortem stated.\n\n\"The attack ... was possible because the exploited relay revealed block bodies to the proposer, so long as the proposer correctly signed a block header,\" the analysis stated. \"However, the relay did not check if the block header that was signed was valid.\"\n\nWhile the vulnerability could have continued to cause problems for traders, this was not an attack on the Ethereum network or its validators directly, but rather on a specific — albeit, common — third-party component, says Mario Rivas, blockchain security global practice lead at NCC Group.\n\n\"The attack exploited a vulnerability in the relay's code, which caused the relay to send private transactions to the block builder when it signed a block with invalid headers,\" he says. \"This vulnerability was promptly addressed, mitigating the risk of similar attacks unless other vulnerabilities are identified.\"\n\nLaw Enforcement Tallies Up a Win\n\nThe investigation and indictment, however, is a win for the DOJ. US law enforcement is increasingly cracking down on cryptocurrency scams, hacking, and other questionable practices. In August, for example, the US Securities and Exchange Commission charged a correctional officer for creating a worthless cryptocurrency and selling it to other members of law enforcement.\n\nYet, other attacks have remained below the threshold for legal action. In a 2021 attack, for example, one trader acknowledged selling a non-liquid token to a rival — in something referred to as a Salmonella attack — and making money off his rival's automated system buying the worthless coin, according to a Forbes report.\n\nThe alleged attack by the two brothers stands apart from those contentious tactics, says Check Point's Vanunu.\n\n\"In essence, while both types of attacks are harmful, the MIT brothers' actions were explicitly illegal due to their direct and unauthorized exploitation of vulnerabilities to steal funds, whereas [a] Salmonella attack leverage[s] market manipulation and deception, staying within the murkier boundaries of legality in the crypto world,\" he says.\n\nThe investigation of the scheme and subsequent indictment underscores that government officials and their private partners are keeping pace with the latest innovative attacks. Despite the sophistication of the exploit and laundering of the proceeds, the investigators traced the funds, identified two suspects, and made their arrests, Chainalysis' Hart says.\n\n\"The Peraire-Bueno brothers' exploit is an incredibly innovative, technically sophisticated attack, and it represents the first time a bad actor has managed to abuse the MEV system widely used by Ethereum block builders in this way and to this degree,\" he says. \"That’s what makes this indictment so impressive, and a promising sign for the future in the fight against cryptocurrency-based crime.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5DWFpLcmhIeEpGS0ZTLWVxODYwaFNMUnNEUGdYSlNYNmtyMU01SHNZY28xMVZBbXhmYThKZDdMcHJuUVhYb0VGUVhzYTE3UFZxcXdNYzJkamY2b2tISzBQZ3R2ZzVXRzJjUDJsUXlJNVo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC paves way for ethereum ETFs in boost for crypto - Financial Times",
        "content": "Print this page\n\nThe US Securities and Exchange Commission has paved the way for the potential launch of eight exchange traded funds tied to the world’s second-largest digital coin, following the regulator’s approval of the first bitcoin ETFs earlier this year.\n\nThe regulator on Thursday approved rule changes in support of ETFs that invest in ether, the native cryptocurrency of the ethereum blockchain, for several groups including BlackRock, Fidelity, Invesco and Ark Invest. A second round of approvals will be needed before the products can launch.\n\nWidespread anticipation of the approvals has sent ether’s price soaring more than 20 per cent since Monday and more than 60 per cent year-to-date.\n\nIt is a significant regulatory shift for the SEC after months of silence on the issue. On Monday the SEC suddenly gave feedback to issuers and exchanges on the pending applications, sparking a flurry of paperwork and revisions. The SEC had faced deadlines of Thursday and Friday to respond to ether ETF applications from VanEck and Ark, respectively, according to data from Bloomberg Intelligence.\n\n“This is a key step to offering Ethereum access through the ETF structure, which will offer US investors easier access, higher protection and safeguards,” Invesco and Galaxy, a digital assets group, said in a statement on Thursday evening. “We hope this approval indicates a willingness by the SEC to approve the launch of these products.”\n\n“I think most of us were resigned to a disapproval order coming down the pike,” said Katherine Dowling, general counsel for Bitwise Asset Management, one of 11 US bitcoin ETF issuers and which has filed to launch an ether ETF.\n\nIt is unclear if and when the SEC will grant the second round of approvals needed before the products can launch.\n\nSEC chair Gary Gensler on Thursday morning explained his reticence to allowing crypto investment products to launch on the US market at an Investment Company Institute conference. He alluded to the myriad fraud cases that have affected the crypto industry, such as that of FTX founder Sam Bankman-Fried, who in March was sentenced to 25 years in prison in connection with the billions of dollars that went missing from his cryptocurrency exchange.\n\n“It comes down to the rampant non-compliance with US law,” Gensler told ICI chief executive Eric Pan. “It comes down to the frauds and scams. This is a field where some of the leading lights of the field are either now in jail, awaiting jail, awaiting extradition.”\n\nThe SEC last year lost a court battle with Grayscale Investments over the asset manager’s push to convert its flagship bitcoin trust into an ETF. After that decision, the regulator — with apparent reluctance — approved Grayscale’s bitcoin product and 10 other new ETF launches earlier this year."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE5YUHE5NmM0TDF6UVZkaHl3UnlIS0FVdFdoOXlYblZVOUN4ZnNWbTczcWMxRGZ5MW9BaTR6eERLWVFFREpqN0dMeHVPZzF5MUQ2WDBzd04tNEdWeFpPa1MtR0NqbENIZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "BlackRock's Ethereum spot ETF listed on DTCC under ticker $ETHA - Crypto Briefing",
        "content": "The Ethereum ETF still awaits SEC's S-1 filing approval.\n\nShare this article\n\nBlackRock’s spot Ethereum ETF has been listed on the Depository Trust and Clearing Corporation (DTCC) with the ticker symbol $ETHA. The listing follows the US Securities and Exchange Commission’s (SEC) approval of eight spot Ethereum exchange-traded funds (ETFs).\n\nBlackRock’s spot Ethereum ETF on DTCC\n\nThe SEC filings list eight Ethereum ETFs from VanEck, Fidelity, Franklin, Grayscale, Bitwise, ARK Invest & 21Shares, Invesco & Galaxy, and BlackRock’s iShares Ethereum Trust, proposed for listing on Nasdaq, NYSE Arca, and the Cboe BZX Exchange, as reported by Crypto Briefing.\n\nAlthough the SEC has approved the 19b-4 forms associated with these ETFs, trading will remain on hold until the SEC approves each ETF’s S-1 filing. The timeline for this approval process varies, with estimates ranging from a few weeks to several months.\n\n“This does not mean they will begin trading tomorrow. This is just 19b-4 approval. Also needs to be an approval on the S-1 documents which is going to take time. We’re expecting it to take a couple weeks but could take longer,” Bloomberg ETF analyst James Seyffart shared.\n\nThe SEC has reportedly begun discussions with ETF issuers regarding S-1 forms. Seyffart suggests that the SEC’s approval of the S-1 filings could take up to five months, after which trading of the spot Ethereum ETFs can commence.\n\n“Typically this process takes months. Like up to 5 months in some examples but [Eric Balchunas] and I think this will be at least somewhat accelerated,” he added.\n\nAn SEC spokesperson declined to comment on the recent approval.\n\nBriefly after the approval, asset manager VanEck submitted the amended S-1 form to the SEC. The firm also released a 37-second advertisement to celebrate the landmark approval, inviting viewers to “Enter the ether.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPbXkzUEtBb2xMajdBX2pjWlptWGg3cTRYNDJoY080eEljZF9pdkQyQjVSWHV3ODEyb0l4bGFEV0lVeHIwd2cxbkdlZWdPLVBSZ0ZRMVUxMU56MS1iMk8yYWN4QTRIVzFyYnQxV05rYnphbk1peThfUzk0emRiaVBHUDE2Z0x1OVFwaEY0VEotaDZMWHAtYlowR1FsaHJTRlBL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum L2 Networks Reach Record High of 7 Million Distinct Addresses - Unchained",
        "content": "The growth in distinct addresses on Ethereum L2s shows that Ethereum’s scaling strategy is working.\n\nLayer 2 networks, widely known as rollups, aim to improve the scalability capacity of Ethereum.\n\nThe number of distinct addresses for Ethereum layer 2 blockchain networks has climbed to an all-time high last week, a sign that the rollup-centric roadmap is coming to fruition.\n\nAccording to L2 analytics platform GrowThePie, the number of distinct addresses interacting with at least one layer 2 blockchain network between May 13 and May 19 stood at over seven million, more than double the amount since the last week of 2023.\n\nThe top layer 2 blockchain network by distinct wallets last week was Arbitrum with 3.7 million, making it responsible for 52% of all the addresses that interacted with one or multiple L2s. Base, the L2 that was incubated by dominant U.S.-based exchange Coinbase, took second place with nearly 815,000 addresses.\n\nThe base layer of Ethereum, in contrast, had 2.1 million active addresses.\n\nThe rollup-centric roadmap entails a shift of activity from Ethereum’s base layer to its layer 2 networks. “Currently, users have accounts on L1, ENS names on L1, applications live entirely on L1, etc. All of this is going to have to change,” wrote Ethereum co-founder Vitalik Buterin in Oct. 2020. “We would need to adapt to a world where users have their primary accounts, balances, assets, etc entirely inside an L2.”\n\nThe sustained growth of addresses interacting with layer 2 networks highlight the ongoing improvements in the Ethereum ecosystem’s scalability, or ability to handle more transactions.\n\nRead More: ​​Why ETH Isn’t Moving Higher After SEC Approves Key Filings for Spot ETFs\n\nThe number of distinct addresses on Ethereum L2s hit the new record high before the U.S. Securities and Exchange Commission approved the 19b-4s filings of several spot ether exchange-traded funds yesterday. While the move is a step closer to the rollout of ETFs directly investing in ETH, the native gas token for the Ethereum blockchain, trading of spot ETH ETFs still awaits a further SEC approval.\n\nThe SEC has to approve S-1 forms, registration documents needed for a firm to offer shares of an ETF to the public.\n\nThe price of ETH has rallied about 20% in the past seven days but has decreased 2.5% in the past 24 hours to trade at $3,720 at the time of writing, data from CoinGecko shows."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVFM3SktRcDhaZlBITUdqano5ODVPMWtMVXRSbXN0WUptdGx4ejhVS1hjMXhDRnhUcllHOEFCTXJ1UGs5VFhGaWI4RWFLTk9qWERhZ21xb0h2R3EtUHJDdHZOdng3Vmd0QlNCY2NObmNJWl9iYXhIZzdBZjB2NHFkNGwwT3VCNWVwZGtz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Remains Flat Following Historic Spot ETF Approval - Yahoo Finance",
        "content": "Ethereum Price Remains Flat Following Historic Spot ETF Approval\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced relatively minor price movements, gaining 0.80% over the past 24 hours, following the surprising approval of eight spot Ether exchange-traded funds (ETFs). After the news of the ETF approvals broke, Ethereum's price briefly surged to $3,935, according to CoinMarketCap data, before settling down at $3,794. Although Ethereum has experienced a 28% surge in the last week, it remains 22% below its all-time high of $4,878, reached in November 2021.\n\nThe sudden approval of these ETFs by the SEC represents a momentous decision that paves the way for Ethereum trading to take place on Wall Street. The approved funds include the Grayscale Ethereum Trust, Bitwise Ethereum ETF, iShares Ethereum Trust, VanEck Ethereum Trust, ARK/21 Shares Ethereum ETF, Invesco Galaxy Ethereum ETF, Fidelity Ethereum Fund, and Franklin Ethereum ETF.\n\nThe availability of these ETFs allows everyday investors to purchase shares that trade on stock exchanges and track the price movements of Ethereum. This simplifies the process of buying, selling, and storing Ethereum for traditional investors who may find the world of digital coins and tokens daunting. ETFs are widely recognized and regulated investment vehicles that provide an accessible entry point into the crypto space without requiring extensive technical knowledge.\n\nThe approval of Ethereum ETFs marks a significant turn of events, as the U.S. Securities and Exchange Commission (SEC) had been silent on the matter for several months, leading many industry experts and analysts to anticipate a rejection. In a similar turn of events earlier this year, the SEC reluctantly approved 11 spot Bitcoin exchange-traded funds, leading to a surge in the price of the largest cryptocurrency to all-time highs of $73,750."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPekhaZkFwemZWQTlLTmFaQkJHcXJ1VENORTVZaEp0bDgtSDFPaUNCNFdodTB3QjF0ZDA4Yk1FX3RMcjJXNWJuYS0yaXZVMEVWNDYyZ3FhZzFmcDBfZUxWOC1DR05TU19GMjljbFBTM1NuZU16NVNPaDRodXBwc0ptdjR5SG9SRWtTX2gwd0NFN0pIT3RpaTFRWVB4S3ZuU2VTNDdN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Why ETH Spot ETFs Could Benefit Stakers and Make Ethereum More Resilient - Unchained",
        "content": "Mounting excitement around the approval of spot Ether (ETH) exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) comes with a caveat: the issuers will likely not offer staking as part of the ETF, which could be beneficial to ETF stakers and Ethereum overall.\n\nRead more: ETH ETFs Will Be Approved. But Could Grayscale Outflows Depress the Price of ETH?\n\nETF applicants like Fidelity and BlackRock have decided to exclude staking in their filings, implying what the industry already sensed: the SEC is not willing to allow ETF issuers to include staking in their products.\n\nMatt Hougan, CIO of Bitwise (which will issue an ETH spot ETF), said on Unchained that he would have expected the SEC to go this route. “The first shot on goal will be let’s get to 90%, which is without staking and then let’s worry about the complications later and down the road,” he said.\n\nRead more: After ETH, Which Crypto ETF Will Be Approved Next?\n\nETFs With No Staking Mean More Returns for Stakers\n\nWith the likely exclusion of staking from ETH ETFs, investors who buy these ETFs will miss out on staking rewards, currently around 3% APY, depending on the provider, per Staking Rewards data. These rewards, instead, will go to those who stake their ETH directly or with staking services such as Lido or Rocket Pool.\n\nRead more: Could the SEC Have a Case Against Liquid Staking Protocols?\n\nThis setup would amount to a transfer of value from non-staking ETF holders to direct stakers. Staking rewards are a significant component of the potential returns from holding ETH, and by not participating in staking, ETF investors are effectively being diluted, as is every holder of vanilla ETH. This value transfer benefits those who engage in staking, enhancing their returns at the expense of non-stakers.\n\nFidelity is the only ETF issuer that has so far clearly stated in its filing that “Neither the Trust, nor the Sponsor, nor the Custodian, nor any other person associated with the Trust will, directly or indirectly, engage in action where any portion of the Trust’s ETH becomes subject to the Ethereum proof-of-stake validation or is used to earn additional ETH or generate income or other earnings.” However, it is expected that none of the issuers will engage in such activities given the regulatory uncertainty.\n\nIf they did, they would have “the most profitable ETF in the world to run,” according to Global Macro Investor CEO Raoul Pal.\n\nRead more: ​​Why ETH Isn’t Moving Higher After SEC Approves Key Filings for Spot ETFs\n\nETFs Could Mitigate Staking Ratio Concerns\n\nThe exclusion of staking from these ETFs could also alleviate a growing concern in the Ethereum community about the rapidly increasing ratio of staked ETH. High staking ratios have raised fears of centralization and reduced liquidity. By not incorporating staking, these ETFs will likely help maintain a more balanced ratio of staked to non-staked ETH by sucking up ETH liquidity.\n\nAs Ethereum researchers have pointed out\n\n, a high staking ratio can lead to centralization risks and inflationary pressures on non-stakers. Because the ETFs will effectively lock up large sums of ETH that are not staked, they may help mitigate these risks, ensuring a healthier balance within the network and addressing community apprehensions about an excessive amount of ETH being locked in staking contracts.\n\nRead more: Why the Ethereum Community Is Up in Arms Against a Proposal to Change the Monetary Policy\n\nHowever, this will depend on the SEC never approving staking to be offered as a part of spot ETH ETFs. Given the fast-moving nature of crypto politics in Washington, that’s difficult to predict with any confidence."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE9IZDFsbDZpa2hFX1RlMjFfTGd0Rk9VV3BKeXIyUWwzSHhod1FTUW9vbFBBUkVwNXdJMU13bUFDb0RWS0YzSHpIdE5iSDVXNzdwWTlzQzVhV0JpeFNPZ1VXRmszVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "BREAKING: Ethereum spot ETFs approved by SEC - Crypto Briefing",
        "content": "Ethereum ETFs expected to attract billions in institutional capital.\n\nShare this article\n\nThe US Securities and Exchange Commission said it has approved the launch of spot Ethereum ETFs for accelerated launch, according to a document uploaded to the agency’s website.\n\n“After careful review, the Commission finds that the Proposals are consistent with the Exchange Act and rules and regulations thereunder applicable to a national securities exchange,” the document states.\n\n@EricBalchunas and I cant see it on the front facing website yet but Phoenix is always right in my experience. https://t.co/xI37RVXqRo — James Seyffart (@JSeyff) May 23, 2024\n\nThe SEC filings list eight Ethereum ETFs from VanEck, Fidelity, Franklin, Grayscale, Bitwise, ARK Invest & 21Shares, Invesco & Galaxy, and BlackRock’s iShares Ethereum Trust, proposed for listing on Nasdaq, NYSE Arca, and Cboe BZX Exchange.\n\nEthereum ETFs face a weeks-long process of finalizing S-1 registration statements, a form required by the SEC for ETFs to list securities, and establishing exchange agreements through multiple rounds of SEC communication.\n\nThe move is expected to bring a substantial influx of institutional capital into the Ethereum market, with Standard Chartered Head of Digital Assets Research Geoff Kendrick predicting inflows of $15 to $45 billion in the first 12 months.\n\nTo address SEC concerns, potential spot ETH ETF issuers, including Fidelity, Franklin Templeton, Ark, Invesco, Grayscale, Bitwise, and VanEck, have updated their filings to confirm they will not stake ETH for yield.\n\nEarlier this week, Bloomberg analysts Eric Balchunas and James Seyffart have increased the odds of a spot Ethereum ETF being approved this month from 25% to 75%.\n\nThe approval of Ethereum ETFs and the passage of the FIT21 crypto bill suggest a shift in the Biden Administration’s stance on crypto, following former President Trump’s pledge to support the industry and foster a business-friendly environment in the US.\n\nThe approval comes just five months after the SEC gave the green light to 11 spot Bitcoin ETFs, marking a significant shift in the regulatory landscape for crypto in the US."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1XNlBzd2F6N3FxbHhjeDBjcUZkelY1eU8tN0NsTmk1YkJFcVB4OHk0S1d0c0RCOXlVNVdPNEJKd2dMZTExU0tuRXVKUUViOVZIRUxVUE9xd2pwTHR5aW5JWEtXbFFlTTBZRVVTTlp5ZEg1M0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC Sets the Stage For the Launch of Spot Ether ETFs - Investopedia",
        "content": "Update, May 23, 2024: This story has been updated with additional information about the approvals.\n\nKey Takeaways The Securities and Exchange Commission approved a rule change allowing for the listing and trading of eight spot Ether exchange-traded funds.\n\nThe approval doesn’t allow the ETFs to immediately begin trading, as the SEC will still need to review individual applications from asset managers for each of the eight ETFs that were given initial approval Thursday. That process could take several weeks.\n\nThis is a win for the crypto industry, which has been hoping for the approval of ether ETFs since a similar product for bitcoin was approved at the beginning of the year.\n\nThe Securities and Exchange Commission on Thursday approved applications for the listing of eight spot Ether (ETH) exchange-traded funds, though further approvals are necessary before you can start trading them.\n\n\n\nWhen Will Ether ETFs Begin Trading?\n\nAccording to a memo from the regulator, NYSE Arca has been authorized to list the Grayscale Ethereum Trust and the Bitwise Ethereum ETF; Nasdaq will list the iShares Ethereum Trust; and CBOE BZX will list the VanEck Ethereum Trust, the ARK 21Shares Ethereum ETF, the Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund and the Franklin Ethereum ETF.\n\nVanEck immediately followed the SEC's announcement with an S-1 filing, indicating that their product was ready to launch. The S-1 approval process, in which regulators will look at the specific ETFs themselves, could take weeks but some analysts say that process may be fast-tracked.\n\nSEC Comes Around Despite Concerns\n\nConcerns around whether ether is a security and staking were two major reasons why the SEC was reluctant to give a green light to ether ETFs. While many market participants say today's decision indirectly implies ether is not a security, the issues around staking were resolved when ETF issuers removed it from their applications.\n\nSome analysts said the White House's softened stance on crypto helped move the SEC toward approval. Additionally, a bipartisan group of lawmakers urged the SEC to approve the ETFs in a letter to the regulators.\n\nSince the January approval of spot bitcoin (BTC), markets have closely watched the approval process for similar funds for the native cryptocurrency of the Ethereum network. That has created a runup in the second-largest cryptocurrency, which is up 60% year-to-date. Ether was up almost 2% on the day as the SEC made its announcement.\n\nCORRECTION: This article has been updated with the correct number of spot Ether ETFs that have been approved for listing."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBHcFo3c0NCRlJ5aDdfZmt4MjVmSkFFNjIwQWEzdG5uUXBZTkx2VHRDbktnNUNnZ2YwSUpRblM0Yi02MWFoVmF6a0wzaldFQW1xajNXMmdXRXNIT2tlZWRoaFpneHMwdlZVZ0xrbU1PWkF4MmlZS0NyeGx3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC engages with Ethereum ETF issuers on S-1 forms - Crypto Briefing",
        "content": "SEC may approve 19b-4 filings today and work on S-1 forms over the next few weeks.\n\nShare this article\n\nFox Business journalist Eleanor Terrett said on Thursday that the US Securities and Exchange Commission (SEC) started talks with Ethereum exchange-traded fund (ETF) issuers regarding their S-1 registration forms. She cited sources who said there is still “work to do” on those forms.\n\nThis could be seen as a positive development, but it suggests there might have been a previous delay in communication.\n\n🚨NEW: Hearing that conversations concerning the S-1’s have now started happening between @SECGov staff and issuers with the conclusion being that there’s “work to do” on those. — Eleanor Terrett (@EleanorTerrett) May 22, 2024\n\nIn a separate post, Terrett indicated the SEC might approve the 19b-4 filings today, followed by collaboration with issuers on S-1 forms in the coming weeks or months.\n\nCommenting on Terrett’s post, Bloomberg ETF analyst James Seyffart said with significant effort, S-1 applications for spot Ethereum ETFs could be resolved within a few weeks. However, he noted that the SEC may need additional time to complete the S-1 review process.\n\n“I think that if they work extremely hard it can be done within a couple weeks but there are plenty of examples of this process taking 3+ months historically,” Seyffart suggested.\n\nMost ETF issuers, including major players like Fidelity, Bitwise, Grayscale, VanEck, Ark 21Shares, Franklin Templeton, and Invesco, submitted their amended 19b-4 filings earlier this week. Nasdaq also refiled BlackRock’s proposed Ethereum ETF yesterday.\n\nThe clock ticks down as the market braces for the SEC’s verdict on spot Ethereum funds.\n\nBloomberg analyst Eric Balchunas suggests a timeframe of around 4:00 PM ET for the SEC’s announcement on the fate of these ETFs. The decision on spot Bitcoin ETFs previously arrived slightly earlier on the designated date.\n\nMy best guess is we hear from the SEC around 4pm tomorrow. For spot btc they dropped it at 3:45pm, some others in past were slightly after 4pm. Anything poss tho https://t.co/MzTOcsmTnJ — Eric Balchunas (@EricBalchunas) May 22, 2024\n\nMeanwhile, Ethereum’s price has surged 25% over the past seven days, trading at nearly $3,800 at press time, according to CoinGecko’s data.\n\nExperts expect that a potential spot Ethereum ETF approval could trigger a sharp price increase. However, whether Ethereum can replicate Bitcoin’s price action after the spot fund approval remains uncertain."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPYnFQdGtmNm41YkM1NmpOcEJ6TEJqcjIwSEVTVkNRdkRrTlphRXFiZlVCQ2dROHI0bjF3VW5OaWRWMXRfQURLakRBeGhkTkFwNllFcXNzRmFHT1lzRkJsV3ViOE8xQTZMNnlvZTJZa3ZCbjN6TF9OWmVuc1JRTlVHdGRDanV2NnlEcXfSAZIBQVVfeXFMTlVfUy1tWE9nVmx0X0t1UVhXMXlJS2oyUUdxMkNsRnE0ZG1vMHQ4blJmRi1lWWFkSk9XcmVmZ1diVFFCRVJabHZFb1NMZGFwTkg4Vk5VNG9HNVN1ZEVFOEdDN1VQSUMtNWk1a2N4VEpOWkozVGhBeEE1Sm55UEhQVWhZbnEtQXE0OFIyem5YTjZ1R0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Barely Budges After SEC Green Lights ETFs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of Ethereum has has largely remained flat following the historic approval of eight spot exchange-traded funds (ETFs) that give investors exposure to the second-biggest digital asset by market cap.\n\nEthereum's price hit $3,856 within minutes of the confirmed approval, per data from CoinGecko, then dipped down to $3,771. It's up to $3,825 as of this writing, but so far, the moves have been relatively minuscule.\n\nETH is up a little more than 1% on the day, but over the past seven days, the asset is up a massive 30%.\n\nThe U.S. Securities and Exchange Commission (SEC) had been quiet on the products for months, leading industry observers and analysts to expect the regulator to say no to them.\n\nAD\n\nAD\n\nBut things changed this week when rumors dropped claiming that the SEC was expected to say yes to the funds. Fund managers started refiling paperwork and making amendments to important forms—signs that the products were about to be approved.\n\nAnd today, they got the green light. The products allow ordinary investors to buy shares that trade on a stock exchange and track the price of the digital asset.\n\nEthereum—and other digital coins and tokens—can be daunting for traditional investors to buy, sell, and store. Popular, recognized, and regulated investment vehicles like ETFs simplify the process and allow people to get involved in the crypto world without being tech savvy.\n\nThe SEC in January reluctantly gave the green light of 11 spot Bitcoin exchange-traded funds. The historic launch of the products have led to the price of the biggest digital coin to surge as cash fast enters the space from previously excluded investors.\n\nAD\n\nAD\n\nDespite Ethereum's rise, the coin is still 22% below its November 2021 all-time high of $4,878.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNSHdzMjlQRm9sN1ZtS1RZaXZMOGhRTm5meVlWMk5LVGtkbFBZOXg5Tl9hRWhtWWo0bV9UVTlFMlRzcE5LN0NDYVpXYTMyR0kwOUJaR01FcXVUenJXV3Z3QXlLMGxIa1FFUDRLUnlDRGk4SWpYSXVFRHU4WlIyVGZ0Wmw5Vk4waU5rRGfSAZIBQVVfeXFMTXJPdFlVVDBxalhnX1ZJZkY5bV82MW0zYXhadjBaUWxfUXF3WXB2VTBxR3JKVVhhMWRCSGpiYXRsdlV5VDVOUk9pNHJOTy1PWFBtb202bkYwZ2xfalhMOUwxQmtiQmF1S090Vkg1QWVWUUFvaDI4eFQxbjFjcTJacmhzbzB5ZEU5UDNPeV9jRjdueXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approvals Mean Tokenizing Assets Now 'Completely Safe': Securitize CEO - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing Thursday’s approval of spot Ethereum ETFs, a cryptocurrency linked to the tokenization of real-world assets (RWAs) is marching past its previous all-time highs—and the CEO of a BlackRock-backed RWA firm tells Decrypt that the approval is bullish for the premise of tokenizing assets on Ethereum.\n\nOndo Finance’s governance token has surged 16% to $1.10 over the past 24 hours—leading the crypto market’s top 100 coins by market cap in terms of daily gains, as of this writing, per CoinGecko.\n\nThe project specializes in offering institutional-grade financial products and services, such as tokens offering U.S. dollar yield or exposure to U.S. Treasuries. In 2022, Pantera Capital and Peter Thiel's Founders Fund led a $20 million Series A funding round in the project.\n\nApparently affirming Ethereum’s regulatory status as a commodity, the approval of several spot ETFs has massive consequences for firms focused on building digital representations of assets that trade on-chain and via associated infrastructure, Securitize CEO Carlos Domingo told Decrypt.\n\nAD\n\nAD\n\n“The most important thing here is not that you can trade an Ethereum ETF,” he said of Thursday’s approvals. “Ethereum, at least from an institutional perspective, is [now] completely safe to use because there’s no risk that the gas token, ETH in this case, is actually a security.”\n\nIn March, Ondo said it would move $95 million worth of funds backing its U.S. Treasury-backed token (OUSG) to BlackRock’s tokenized BUIDL fund. Established through Securitize, shares of BlackRock’s BUIDL fund are represented by an Ethereum-based token, pegged to the price of $1, and subscribers of the fund receive a yield through the form of more tokens.\n\nFun fact of the day👇$ONDO alone has contributed $195M of BUIDL's $448M AUM. To put this into perspective.. Blackrock's first onchain fund, has seen nearly 50% of its growth come from Ondo's efforts. There's levels to this and your size isn't size. — JTrades⚔️ (@_JTrades_) May 24, 2024\n\nOndo’s shift to BlackRock’s BUIDL fund was all about efficiency, Domingo said. The CEO explained that previously, while backing its OUSG token with BlackRock's iShares Short Treasury Bond ETF, managing the product was comparatively clunky.\n\nAD\n\nAD\n\n“They didn't have good control over the underlying asset in terms of fast issuance, fast redemption, [and] on chain visibility—that the money's there,” Domingo said. “One of the use cases for BUIDL is that it becomes a base layer for people to build products on top of it.”\n\nOndo did not immediately respond to a request for comment from Decrypt.\n\nBlackRock CEO Larry Fink has highlighted tokenization as the “next generation for markets” since 2022, believing that crypto tech could provide financial market participants “reduced fees” and “instantaneous settlement.”\n\nDescribing Ondo as “very innovative,” Domingo said Ondo’s use of BUIDL collapses five distinct steps—between broker-dealers and custodians that safeguard assets—in the redemption of Ondo’s products. Before, he said, it would take them “two or three days to get the money.”\n\nIn light of the approval of spot Ethereum ETFs, Domingo said he expects more staid financial firms to branch into the tokenization space with a cloud of regulatory jitters recently dispelled.\n\n“In my opinion, [this] is more relevant for tokenization than the Bitcoin ETF,” he said. “As I mentioned, it makes very clear that [Ethereum is] not a commodity, and therefore, using the public Ethereum blockchain is safe from a regulatory perspective.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPVHUtbDdmT3RCV2Y4U2NrZ0tfLUh5dWl3bk05cDg3LWZVT25CZVVYbXI1ek4wSW1RTEtDQloybm42WU93b2JHU0xVRTN2SG10dG9DSjl3T3o1dmZMRGFpNkdhTFREV1l6M2NweDk4Q0ZlQllQdEY4VUtIc1ZEQTJjZUUwQdIBiwFBVV95cUxNeFB0dG85OUJxcGJqemduY195Y2xsLU5QSTJvTmNac3BQaE9vTHJzN003cnF5Y3RUR0JaN1lKYnZuRW1FWjdrWHZhMzU5TFB0clNtZ2R4YUxrbjVvMTg5NmJXR1plMzBGdFJwN1plNHpSdTVTSmY0YVVlaG40RGVmREJMcVgySHYyTGJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Responds to EigenLayer Conflict of Interest Controversy - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ethereum Foundation says it’s readying an update on how it plans to address questions of ethics after two members of its core developer team took roles at a staking protocol—and were rewarded with valuable tokens.\n\n“We are aware of the current conversation about potential conflicts of interest, and share the community’s concerns,” tweeted Aya Miyaguchi, Executive Director of the Ethereum Foundation, on Friday.\n\n“It is clear that relying on culture and individual judgment has not been sufficient, and we have been working on a formal policy to address this problem for a while now,” she added.\n\nThe Ethereum Foundation’s credible neutrality is critical for us to perform our role in the ecosystem. We are aware of the current conversation about potential conflicts of interest, and share the community’s concerns. It is clear that relying on culture and individual judgment… — Aya Miyaguchi (ayamiya.eth) (@AyaMiyagotchi) May 24, 2024\n\nAD\n\nAD\n\nThe Ethereum Foundation is the non-profit responsible for funding and steering Ethereum’s early development and still bears major influence over the direction of the protocol today. In addition to Miyaguchi, the Foundation’s board of directors includes Ethereum co-founder Vitalik Buterin.\n\nButerin was questioned by popular crypto trader Jordan Fish last week over the financial relationship between the Foundation’s core developers with other projects building within the Ethereum ecosystem. Fish specifically called out connections to EigenLayer, a protocol for re-staking Ether to secure Ethereum layer 2 blockchains, which now holds $18.1 billion in TVL, according to DeFiLlama.\n\nDays later, Ethereum Foundation researcher Justin Drake confirmed that he’d established a multimillion-dollar advisory relationship with EigenLayer, for which he’s received “a significant EIGEN token incentive” worth millions of dollars, comprising close to half of his net worth.\n\nFellow researcher Dankrad Feist also confirmed a similar relationship.\n\nAD\n\nAD\n\nOnline critics have worried that accepting money from EigenLayer could influence the experts’ analyses of re-staking risks (which trended cautious) or possibly influence his work on the core Ethereum protocol.\n\nIs an Ethereum core dev working for EigenLayer the same thing as the US Secretary of Defense working for the largest private defense company? Is that acceptable? Genuinely asking what the best analogy is here. — Quinn Thompson (@qthomp) May 19, 2024\n\n“[The Ethereum Foundation] are some of the highest integrity people I know and I don't see the 1% of [members] formally involved with EigenLayer compromising their morals,” Drake argued last week. To his knowledge, he said that three of 300 people at the Ethereum Foundation are formally involved with EigenLayer.\n\nFeist also said his token allocation won’t “change or influence my positions on how the core protocol should be developed.”\n\nIn an interview with Decrypt, Ethereum co-founder and Consensys CEO Joseph Lubin said he wouldn’t “restrict anybody in the Ethereum Foundation or in the ecosystem from supporting more projects.”\n\nLubin noted that his own company, a leading Ethereum wallet infrastructure provider, has had many of its members move on to other ecosystem projects for financial compensation. Consensys is fine with such relationships, he said, so long as they are disclosed and there is no conflict of interest regarding Consensys-related decisions. (Consensys is one of 22 investors in Decrypt.)\n\n“There will be so many opportunities for building good or great things or for corrupting things,” he noted. “We need to be vigilant.”\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMingJBVV95cUxQVHFYLW9IU1NVOTdJM2pOOG5JVTBTSldyWXY4WVIybmZZeVBxMkRCajhlaFk1RDZabzdIS0FZRU5ET09uNDgxSHVma1p3YURHWTU2TXdEU0JnbWl0YkZPS0EtcmszU2RiN0xHTC1ZR2dWNkh5c01NZm9mRVc0d0dxS01wVGhnSG9PVFZON1puWUQwS1ZrS0p5TlBOR05OS0pqd2NuWEVHTjcyVmg4T3lJUVYtcnBMZXdpUHgzc1dHdzlwNndveGY0LTc3U1Q0XzVlOFpwY0JzZFhZS2xGSVNkTE1WWlZSZXNEUkxFYTRsU3RJcGZJeDhtYVJseVZXdjR4Rkk0T0ExRDgwbjhSVTdCWFhIdEJ1ODdfenRERGh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "“This is the Time to Get In ” – Bitcoin and Ethereum on the - GlobeNewswire",
        "content": "London, UK, May 24, 2024 (GLOBE NEWSWIRE) -- Bitcoin, Ethereum, and BlockDAG Network are all making significant moves in the market. This is what’s happening;\n\n\n\n\n\n\n\n\n\nBitcoin surged over $70,000 per BTC on Wednesday, nearing its all-time high of $73,500 reached last March. Meanwhile Ethereum has seen a 20% rise to nearly $4,000 per Ether, as the crypto market anticipates a pivotal vote in Washington.\n\nThe rally follows the U.S. Securities and Exchange Commission (SEC) requesting updates from entities applying to issue spot Ethereum exchange-traded funds (ETFs). Analysts foresee approval triggering a $4.2 trillion price surge, especially after the SEC's communication with potential fund managers, suggesting accelerated approval may be imminent.\n\nETF analysts have increased approval odds, citing the political climate and potential impact on Ethereum's value. The decision is expected this week on VanEck's and Ark/21 Shares' ETF applications, with analysts anticipating a significant market response akin to Bitcoin's ETF approval in January.\n\nThe potential approval of spot Ethereum ETFs is predicted to propel the Ethereum price to $8,000 by 2024 and $14,000 by 2025, impacting Bitcoin positively as well. With spot Bitcoin ETFs reporting record inflows and continued growth since their launch, analysts anticipate further market highs, aligning with projections of a $150,000 Bitcoin price by 2024 and $200,000 by 2025, amounting to a combined near-$4.2 trillion valuation for Bitcoin and Ethereum.\n\nIn the meantime, BlockDAG Network is revolutionizing the cryptocurrency landscape, emerging as the fastest-growing community in the crypto world and hosting the largest Initial Coin Offering (ICO) of 2024. With over 120,000 holders already on board, up $31 million in record time and a goal of $600 million within reach, BlockDAG is not just a network but a whole movement.\n\n\n\n\n\n\n\n\n\n\n\nBlockDAG Network stands out with its cutting-edge Directed Acyclic Graph (DAG) architecture, which allows it to achieve unmatched transaction speeds of 10 blocks per second. This high throughput positions BlockDAG as an ideal solution for both everyday transactions and institution-level decentralized finance (DeFi) protocols. The platform’s commitment to technological excellence ensures a seamless and efficient user experience.\n\nBlockDAG introduces a unique mining system designed to provide passive income opportunities. The newly launched X1 mobile miner allows users to mine cryptocurrencies on their smartphones without significant data or battery usage. This innovation means anyone can earn money virtually anywhere and everywhere, making mining more accessible and convenient than ever before.\n\nJoining the BlockDAG Network means becoming part of a vibrant, global community of enthusiasts dedicated to making this project the best in crypto-history. With tens of thousands of members, the community is the backbone of the project’s extreme success, driving innovation and growth through continuous engagement and collaboration.\n\nBlockDAG Network is on an ambitious journey to “the moon,” with every milestone bringing it closer to the ultimate goal of revolutionizing the digital space.\n\nThe BlockDAG presale is the fastest growing in crypto history, offering an unmatched opportunity to join a burgeoning journey. Expert analysts predict incredible potential for BlockDAG, with $BDAG tokens projected to reach $10 in 2025.\n\n\n\n\n\n\n\n\n\nIn the midst of Bitcoin and Ethereum's market surge, BlockDAG Network emerges as the fastest-growing community and the largest ICO of 2024.\n\nAnalysts project BlockDAG's $BDAG token to reach $10 by 2025 from its current $0.0085 price, marking an unprecedented rise. As the BlockDAG presale gains momentum and rises upwards from the $31 million already raised, it's clear: in this time BlockDAG Network will redefine the future of cryptocurrency.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOa1dyX1ExTThFWmV5Nm1GMUhxU3dKd3dndEFFUFp1dDhzaTVOc2FtMGF2dFpOUUstUnBZN3F4RFREdVNSQlp1eWlvYkk2dFlwVnJVbUZJeEJtV2tvM0JhblRSLTc2SmpXWmhhWFpiMGdhX3htWklFSjc2UEhnVlhZbU9nRDI0LVhSS0R4bXdGWWF6Y1d5aFI3LUt5T1B1Nlgwb0M1NjluR0YzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Is Ethereum a security or commodity? Why does it matter and will an ETF change this? - CryptoSlate",
        "content": "The ongoing debate over Ethereum’s classification in the United States is garnering significant attention at the moment due to actions by the SEC and a possible ETF approval. The distinction between commodities and securities holds substantial implications for the regulation and future of crypto. If Ethereum were officially recognized as a commodity, the crypto landscape could witness transformative shifts in regulatory oversight, market participation, and investment vehicles.\n\nCommodity vs security definitions\n\nIn the US, a commodity is generally defined as a basic good used in commerce that is interchangeable with other goods of the same type. This category includes items like gold, oil, and agricultural products. The Commodity Futures Trading Commission (CFTC) regulates commodities, focusing on market stability and fraud prevention. Conversely, a security represents an ownership position in a publicly traded corporation via stock, a creditor relationship with a governmental body or a corporation via bond, or rights to ownership as represented by an option. The Securities and Exchange Commission (SEC) oversees securities, emphasizing investor protection and disclosure requirements.\n\nEthereum’s classification has been a contentious issue. In 2018, the CFTC asserted jurisdiction over Bitcoin and other virtual currencies, classifying them as commodities. The SEC, however, has historically been more cautious. In 2018, SEC Director William Hinman suggested that Ethereum, which had initially been funded through an Initial Coin Offering (ICO), might not be a security due to its decentralized nature. Despite this, the lack of a definitive classification has left Ethereum in a regulatory gray area.\n\nHow would classifying Ethereum a commodity change things?\n\nThe potential recognition of Ethereum as a commodity would have several implications. Firstly, it would place Ethereum under the purview of the CFTC, which could lead to more consistent regulatory guidelines. This shift could reduce the regulatory uncertainty that currently hampers some institutional investors, thereby encouraging broader participation in the Ethereum market. Moreover, it could pave the way for new financial products, such as Ethereum futures and options, thereby enhancing market liquidity and stability.\n\nA significant development that could influence Ethereum’s classification is the approval of an Ethereum Exchange-Traded Fund (ETF). ETFs are investment funds traded on stock exchanges, much like stocks. They hold assets such as stocks, commodities, or bonds and typically operate with an arbitrage mechanism designed to keep trading close to its net asset value, though deviations can occasionally occur. In the context of Ethereum, an ETF would provide a regulated and familiar investment vehicle for institutional and retail investors alike. The approval of Bitcoin ETFs in the US has already set a precedent as it is designated a commodity ETF.\n\nThe approval of an Ethereum ETF could bolster arguments for its classification as a commodity. The successful launch of a Bitcoin ETF has demonstrated to regulators that digital assets can be integrated into traditional financial systems in a regulated and secure manner. An Ethereum ETF would likely undergo rigorous scrutiny, ensuring that all compliance and security measures are in place. This process could further validate Ethereum’s status as a commodity by showcasing its stability and maturity as an asset class.\n\nRecognizing Ethereum as a commodity would not only clarify its regulatory status but also enhance its appeal to a broader range of investors. Institutional interest in crypto is growing, driven by the desire for portfolio diversification and hedging against inflation. Clear regulatory guidelines would mitigate the risks associated with regulatory uncertainty, making Ethereum a more attractive investment.\n\nAdditionally, this recognition could spur innovation within the Ethereum ecosystem. With regulatory clarity, developers and businesses could engage in more ambitious projects without the fear of unexpected legal repercussions. This could accelerate the development of decentralized applications (dApps) and smart contracts, further solidifying Ethereum’s role in the broader digital economy.\n\nUltimately, the official recognition of Ethereum as a commodity would mark a pivotal moment for the crypto industry. It would streamline regulatory oversight, enhance market participation, and foster innovation. The potential approval of an Ethereum ETF could play a crucial role in this process, demonstrating Ethereum’s viability as a stable and mature asset. However, it would not be an official settle the debate regarding Ethereum being a commodity unless additional specific classifications were issued by the SEC."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9aRmFuSUJUb3h4dnQ5QXExMm5EUXFIZ2ZFRFlfeUZrZHpRMlR2R1JhSko2dVdUejJKTXpZUzJyOVNDZjdXRE1mcnpnT0tmZlBrcWphSFNKeWxXQ01jcHJ4SVRyRXdWOW5sT1RGbmtfNDhLVm56NUE2LQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs are the wrong solution to the right problem - Blockworks",
        "content": "Numbers don’t lie — spot bitcoin exchange-traded funds (ETFs) have been a boon for the market. The first day of trading in the US saw over $4.6 billion in volume. Within a month, bitcoin rose above $50,000 for the first time since the bear market and hit $70,000 in March for the first time ever.\n\nBut this bitcoin ETF liquidity boost does not address any of the underlying issues in today’s crypto user experience, nor does it offer investors empowerment through self-custody.\n\nIn the case of ethereum ETFs, the outcome will likely be the same. Rather than rely on regulatory approval of such financial products to welcome traditional investors onboard, our industry needs to reimagine how we approach digital asset management so that users don’t need to choose between convenience and financial freedom.\n\nWhat interest in ETFs really tell us\n\nThe appeal of ETFs is exposure to the crypto market without the hassle of digital asset custody. With over 900,000 ETH forever lost due to user error, it’s understandable that investors would look for easier ways to tap into the value created in this space.\n\nBut using old-world instruments to address crypto’s user experience challenges goes against what this industry set out to do — transform existing financial infrastructure to empower the little guy.\n\nAfter years of being looked down on by Wall Street, ETFs are tacit acknowledgments by traditional investors that the crypto sector is something worth opening the floodgates of retail and non-crypto money into. Supposing that ethereum ETF approval generates further interest in the crypto space — be that bullish interest from Larry Fink at BlackRock, opposition from ECB director generals, or just curiosity from the trainer at my local gym — the opportunity lies in shepherding these new investors toward full ownership of their assets.\n\nThe ETF wrapper is one means of entry into crypto as an asset, but removing the wrapper brings us to the real treat — true ownership.\n\nNewfound industry attention, now to trust ourselves\n\nWhy should individuals care about self-custody and financial freedom? While the answer may be obvious to those deeply embedded in the crypto community, trusting traditional banks is the norm, and the convenience brought by these institutions outweighs the risks of crypto for many individuals.\n\nWhen the Bitcoin white paper was published 15 years ago, the manifesto envisioned a peer-to-peer network without financial intermediaries. Ethereum then brought new functionality to the digital asset space and created the foundation for DeFi innovation. For the first time, individuals could harness digital ownership and exchange assets globally online while preserving personal privacy and autonomy.\n\nRead more from our opinion section: BlackRock and other bitcoin ETFs rob bitcoin of its room to grow\n\nThe challenge now is to get people of all investment experience and levels involved directly through self-custody of their assets. Products like ETFs, which mirror instruments in the traditional finance space, may have a positive market impact. However, they do not push individuals to reconsider traditional financial hierarchies and take ownership into their own hands. Only by directly engaging in self-custody platforms will we see crypto values influence mainstream audiences.\n\nWe’re only as good as our infrastructure\n\nSelf-custody is important, but how are we going to convince the next billion users to value freedom over convenience? It’s obvious that seed phrases and hardware wallets are not going to unlock digital ownership for mainstream users. In a time where payments can be made with a tap of a phone or a watch, the crypto industry needs usable features to appeal to traditional investors and everyday users.\n\nThat’s why Vitalik and other leaders in the Ethereum space are calling for a transition to smart accounts. By abstracting away the complexities of digital asset management, smart accounts enable features like crypto recovery, self-custodial debit cards and email login. In addition to smart accounts, improvements in scaling tools like zero-knowledge (zk) rollups have increased the capacity and throughput of DeFi applications, overcoming bottlenecks and preparing the industry for mainstream adoption.\n\nBetter features and scalability have paved the way for new use cases in crypto. Self-custody is no longer limited to individual asset management. With multi-signature accounts, for example, organizations and businesses can co-manage assets with ease. Further, developments in zk have reduced transaction fees, making it feasible for projects to facilitate large batches of transactions cost-effectively.\n\nThe crypto industry needs to continue building momentum\n\nBitcoin and ethereum ETFs have captured the zeitgeist, and now the crypto industry needs to capitalize on the mindshare introduced by this regulatory milestone. In the same way that football’s popularity grew in my German hometown in the aftermath of Germany’s 2014 FIFA World Cup victory, this newfound interest among conventional investors allows us to push self-custody to the forefront and showcase the opportunities unlocked by digital ownership.\n\nETFs encourage adoption; true crypto ownership encourages autonomy. Simplifying crypto user experience should be championed above simple ETF wrappers and commodity baskets. Bolstered with new liquidity, the industry needs to use this pivotal moment as a catalyst to revamp user experience across the board. Improving crypto-native platforms progresses the movement for digital ownership, which will outlast any market trends in the coming years.\n\nJulian Grigo is the Head of Institutions at Safe. Before joining Safe, Julian led the Digital Assets Business Unit at Solaris. As Head of Digital Banking at Bitkom, Julian contributed to the publication of a whitepaper on Decentralized Finance and provided industry insight in the German Parliament on crypto regulation.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBRWnVKeXZhMk5pRFJ3cXo0TWZ2R1F6d3I4dWN4NHY4WWFzNlpfNmJzN3pURDdIbExDSzdWNW44dHU0YlZjR3RCTFdmNTFja24xM1lleG5GNWgzTllSUEFmUGF4c3ViUXlNVlZ5U0FacWhuOEg4SmR5ejdR0gGCAUFVX3lxTE9QMDd5aWRObktEbUxzVzJqMkRORzJSRWFTUDNYVTYyd1hfdmFpWVRmOGdtNUxmX1JBSFlnOEoxZkVvWWk4REtWVjA1aFJRQzR6SW1HVm9IRDg1OW1ZVUdlOUU3cFlmT1lkWUdqMnAzNW9LLTZwUUdHa3hKQ0Q5SVpGQ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Approved in Abrupt SEC Policy About-Face - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a stunning reversal, the U.S. Securities and Exchange Commission (SEC) announced on Thursday that it has approved eight applications for spot Ethereum ETFs, effectively green-lighting Ethereum trading on Wall Street.\n\nThe following funds were approved in the filing: the converted Grayscale Ethereum Trust, the Bitwise Ethereum ETF, iShares Ethereum Trust, VanEck Ethereum Trust, ARK/21 Shares Ethereum ETF, Invesco Galaxy Ethereum ETF, Fidelity Ethereum Fund, and Franklin Ethereum ETF.\n\nWhen will the spot Ethereum ETFs begin trading? It won't be tomorrow. Bloomberg ETF expert James Seyffart suggested in a tweet that it could be a \"couple weeks\" before the fund managers' S-1 documents are approved to enable trading.\n\nGoing to add here. Typically this process takes months. Like up to 5 months in some examples but @EricBalchunas and I think this will be at least somewhat accelerated. #Bitcoin ETFs were at least 90 days. Will know more soon. — James Seyffart (@JSeyff) May 23, 2024\n\nAD\n\nAD\n\nJust one week ago, most financial experts and crypto industry leaders had written off such an outcome as increasingly unlikely. For one, the SEC had offered little indication that it planned to move forward with any spot ETH ETF applications prior to a looming May 23 deadline.\n\nWhat's more, just weeks prior, a lawsuit filed by Ethereum software company Consensys against the SEC alleged that the regulator has secretly considered ETH to be an illegal, unregistered security for over a year. (Disclosure: Consensys is one of 22 investors in Decrypt.) If the SEC formally labeled ETH a security, then Ethereum ETFs would need to be approved via a different process than the one currently underway.\n\nThus, in approving spot ETH ETFs today, the SEC has tacitly conceded that ETH is not a security in and of itself. Such an outcome is a major victory for crypto advocates, given ETH’s crucial role in underpinning the Ethereum network—upon which many of the industry’s most prominent projects and services are built.\n\nCrucially, however—in a bid to get over the finish line—several ETH ETF issuers dropped language from their applications this week regarding the staking of customer ETH. Ever since Ethereum transitioned to a proof of stake system in September 2022, ETH holders have been able to deposit their funds with the network to accrue rewards. The SEC has long taken the view that when a financial intermediary offers staking services, it is engaging in an illegally unregistered securities scheme.\n\nAD\n\nAD\n\nSpot Ethereum ETFs—unlike ETH futures ETFs, which track derivatives contracts and were approved by the SEC in October—involve issuers actually buying and storing ETH on behalf of their clients. Now that spot ETH ETFs have gained approval, traditional financial institutions and investors will soon be able to gain exposure to ETH without holding any crypto themselves.\n\nToday’s historic action follows the SEC’s approval of eleven spot Bitcoin ETF applications in January. Since then, spot Bitcoin ETFs have attracted nearly $13 billion in net in-flows.\n\n“I always called the spot Bitcoin ETF approvals, Bitcoin’s IPO,” Cody Carbone, chief policy officer at the crypto lobbying group Digital Chamber of Commerce told Decrypt. “This is ETH’s IPO. That is a massive stamp of approval.”\n\nEdited by Andrew Hayward\n\nEditor's note: This story was updated after publication with additional details."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbmRDVHJvVHc0NmJpUnJzT1VqY1hJUGotbWlMOExZTy1MN0Fnem5reVlfRUExLWVsd1ZpSXFjaFJOVWU2VzlCTXNWUHh6eFBqbGkzamhFV2ZfT0xCdzNRRThURnZzcmx0MWg1aEd4cl9MR2dlQzFNT3lLcFhxSHk2dnV2eUZiSTZGVF9vSldfeTRpREZ4VWVwbHBxQXJZY1ZWNUwwanNFeUh6Mm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Delta Blockchain Fund CEO: Ethereum Has Been Reliable - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1yaUF5bjh3VXJJbDcwYWFDQzZlX0Y1TDlzYnhDaFplVmtYbjBQc3JFaG5FTzVWWUtqYnBiQnFNaXRDbW1PRmgwdHhTYWtWdG14UDdpbGV0N0phZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum price crash attributed to MEV manipulation: Report - Crypto Briefing",
        "content": "Ethereum drops nearly 5% in an hour, suspected MEV manipulation by Symbolic Capital Partners.\n\nShare this article\n\nEthereum (ETH) faced a nearly 5% crash in one hour this Thursday, despite the anticipation around the approval of spot Ethereum exchange-traded funds (ETFs) in the US. The X user identified as ai_9684xtpa pointed out that this was likely a market manipulation movement by the trading firm Symbolic Capital Partners.\n\n“The agency sold 6,968 ETH in one minute at 20:56, worth $27.38 million, with an average selling price of $3,930; one transaction sold 3,497 ETH on the chain at one time, and the bribe cost was as high as 90 ETH,” explained ai_9684xtpa.\n\nSuch transactions are known as MEV, short for “maximal extractable value,” which consists of using on-chain resources to profit. The payment of 90 ETH suggests a hurry to sell the position at a higher price to make it crash, possibly to buy it again at a lower price.\n\nETH price fluctuation after Symbolic’s transaction. Image: CoinGecko\n\nSince the crash, Ethereum has ranged in and out of the $3,800 price level and is priced at $3,803.37 at the time of writing, nearly 22% away from its previous all-time high.\n\n“It’s happening”\n\nAs shared by Bloomberg ETF analyst James Seyffart, an approval of spot Ethereum ETFs is happening this Thursday. Despite the low odds given to this scenario until last Monday, Seyffart and his fellow Bloomberg analyst Eric Balchunas boosted the chances to 75% after the SEC started contacting the issuers.\n\nSince then, various asset management firms presented amends to their 19b-4 filings, and VanEck’s Ethereum spot ETF even got listed on DTCC under the ticker $ETHV. The first final deadline is today, as the US regulator must decide on VanEck’s application.\n\nMoreover, according to Balchunas, the SEC’s decision on spot Ethereum ETFs might come at 4 pm (EST). Although a positive outcome is expected, it doesn’t mean immediate permission for trading."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNTU13eEZSbEVDZXkwNUlQY2JGSjJMSERlNU5FUEw1cXhmbVB5b2NjSndXWW1vbUNfQ0JSMUFqTlUzYXRjR0xaNTRtdzhRWVhZWjdFVVVHRnNIMjRVZFMyLWVwTmkxZl84dUlpRzZEODVDdmxTOXN2Vmpaa0xuUXV1RmRvTXk1NU00T3BxbGNCM2JyTXVXOE14c3lHc09GYjQ5LWZsZGEwUEVnWVhhVDAxanRvQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC Opens the Door for Spot Ether ETFs in Major Crypto Victory - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNdmRKLV9PZ0tqekNNWV9ic0FsY0VsQW84TExoczJ4S2lqbXlFTXFULUhsSXRKQnR1NzFPTW9vcy1ibnVqTXY1S2trMkhBejZIRXh6aUVJSHlWeUxZRU5odGx1dGxfOTJzaVhmVXNUSEhUaGtiTTVDTk16NW5DbnVORGgzOUE1TVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Why staking was removed from Ethereum ETFs to get SEC approval - CryptoSlate",
        "content": "The removal of staking from Ethereum ETFs has been driven by regulatory pressures from the US Securities and Exchange Commission (SEC). Issuers amended their ETF filings to exclude staking provisions prior to the approvals on May 23. This strategic shift aims to align with the SEC’s regulatory expectations to allow the approval for their Ethereum ETFs.\n\nIs staked ETH a security?\n\nStaking, which involves locking up crypto to validate transactions in exchange for rewards, is a significant feature of Ethereum’s proof-of-stake (PoS) mechanism. However, the SEC views staking services as potentially constituting unregistered securities offerings. This perspective has led to actions against major crypto platforms like Coinbase and Kraken for offering staking services and alleging violations of federal securities laws. Consequently, ETF issuers removed staking from their proposals to avoid similar legal challenges.\n\nThe SEC’s classification of staked ETH as a security hinges on applying the Howey Test, which determines whether an asset qualifies as an investment contract. According to the SEC, staking involves investing money when users lock up their ETH in exchange for potential returns, satisfying the first prong of the Howey Test. The second prong, a joint enterprise, is met as stakers contribute to a shared ecosystem and rely on the collective efforts of network validators and developers to secure and maintain the network. The third prong, the expectation of profits, is fulfilled as stakers anticipate rewards in additional tokens. Finally, the SEC argues that these profits are derived primarily from the efforts of others, such as the validators and developers who ensure the network’s functionality and security. This interpretation aligns staking with the characteristics of an investment contract, thereby subjecting it to securities regulations.\n\nWhy staked ETH is not a security\n\nOpponents contend that staking should not be classified as a security because it fundamentally differs from traditional investment contracts. Staking involves locking up tokens to support network operations and earn rewards, which is more akin to a technical service than an investment scheme. The rewards from staking are derived from the network’s protocol and market conditions, not from the managerial efforts of a third party, which challenges the application of the Howey Test’s “efforts of others” prong.\n\nThe SEC’s enforcement actions against staking services, such as those involving Kraken and Coinbase, have been criticized for lacking clear guidance and creating a climate of regulatory uncertainty. Critics argue that the SEC’s reliance on enforcement rather than providing explicit regulatory frameworks leaves crypto firms and investors in a precarious position, unsure of how to comply with the law. This approach is considered inefficient and unfair, particularly in an emerging industry that requires clear and consistent regulations to foster growth and innovation.\n\nMoreover, the decentralized nature of many staking activities complicates the SEC’s assertion that stakers primarily rely on the efforts of others. In decentralized networks, validators and stakers operate independently, and the network’s security and functionality are maintained through a collective effort rather than centralized management. This decentralization challenges the notion that staking constitutes a joint enterprise under the Howey Test.\n\nAdditionally, critics argue that the SEC’s actions could drive staking activities offshore, reducing the United States’ influence in the global crypto market and potentially compromising investor protection. By pushing staking services to jurisdictions with more favorable regulations, the SEC may inadvertently encourage less oversight and more significant risks for US investors.\n\nFinally, the SEC’s stance may hinder blockchain technology’s broader adoption and development. Staking is a crucial component of proof-of-stake networks, designed to be more energy-efficient than their proof-of-work counterparts. By imposing stringent regulations on staking, the SEC could limit the potential benefits of DeFi and other blockchain-based innovations.\n\nStaked ETH and Ethereum ETFs\n\nThe SEC’s approval process for Ethereum ETFs involves submitting 19b-4 forms for listing on exchanges and S-1 forms detailing fund management. While the SEC has approved the 19b-4 forms, the S-1 forms are still under review. The exclusion of staking from these filings is necessary to meet the SEC’s regulatory requirements and facilitate the approval process.\n\nThe removal of staking from Ethereum ETFs has sparked debate within the crypto community. Many investors highly value staking for the yield it generates, and its absence in Ethereum ETFs could significantly diminish its attractiveness compared to direct purchases of Ethereum, where invhttp://stakingestors can engage in staking activities. Brian Rudick, a senior strategist at GSR, highlighted the “immediate opportunity cost” of holding Ether in an ETF that does not offer staking.\n\nDespite these concerns, the potential benefits of the Ethereum blockchain remain a topic of interest. Eliminating staking from ETFs could lead to broader implications for supply, network security, and decentralization due to less staked ETH.\n\nIn contrast to the U.S., Hong Kong’s Securities and Futures Commission (SFC) is considering allowing staking for Ethereum ETFs. This approach aims to enhance the attractiveness of these ETFs by offering passive income opportunities through staking, potentially boosting investor interest and supporting Hong Kong’s ambitions to become a global crypto hub.\n\nUltimately, the removal of staking from Ethereum ETFs directly responds to the SEC’s regulatory concerns and legal actions against staking services. This strategic adjustment by ETF issuers aims to align with regulatory expectations and get approval despite potentially reducing the attractiveness of these ETFs compared to direct Ethereum investments.\n\nWill staking be enabled further down the line? Time will tell, and all eyes will be on the SEC and its decision to classify Ethereum and staked ETH in the coming weeks and months."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOT1daRXBMa04wNklQNXBFSHhGRlQ4QlBIZkZsTndPaVYwajM4SkpmdmZlVjhncGNyQ3lsajlRYXdoQWxubjVwNmRvRzhhMGMxX19tbUFTUUtZdVI2b3puUHAwVTBlOUFYaDJKd3NmRlFvay1kR0RRYXVsX0dZbFVDUmVjLU14bHVmbjZCY2hHS0tQeXFTejdPWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum Witnesses $139 Million in Liquidations Post-ETF Approval - Crypto Times",
        "content": "Following the approval of an Ethereum ETF, the cryptocurrency market witnessed a surge in liquidations, with Ethereum’s liquidation hitting a remarkable $139.41 million within a mere 8 hours.\n\nThis surge in liquidations includes the largest single liquidation order on Binance, totaling $12.41 million in ETHUSDC. Despite these fluctuations, Ethereum’s market capitalization remains strong at $455.1 billion.\n\nImage Source: Coinglass (Liquidation Heatmap)\n\nSurprisingly, despite the ETF’s approval, Ethereum’s price experienced a modest increase, standing at $3,777. Notably, within 24 hours, Ethereum saw $92.20 million in long liquidations and $47.21 million in short liquidations, totaling $139.4 million in Ethereum. The market’s total liquidations reached $367.86 million, affecting 101,172 traders.\n\nImage Source: CoinMarketCap (Ethereum price chart)\n\nThe trading volume saw a remarkable surge of nearly 95% within just 24 hours, reaching a staggering $46.07 billion. These events highlight the ever-changing dynamics of cryptocurrency markets and how regulatory decisions can greatly influence investor behavior.\n\nIn the same timeframe, Bitcoin experienced liquidations totaling $69.39 million. This included $54.61 million from Long positions and $14.78 million from Short positions.\n\nImage Source: CoinMarketCap (Bitcoin price chart)\n\nAs of now, Bitcoin is valued at $67,288.05, boasting a market capitalization of $1.33 trillion. Its 24-hour trading volume has surged by almost 40%, standing at $42.92 billion.\n\nThe surge in liquidations following the approval of an Ethereum ETF underscores the inherent volatility of the cryptocurrency market. Despite Ethereum’s resilient market capitalization and a modest price increase, the significant liquidation figures reveal heightened trader activity and potential market uncertainty. How might ongoing regulatory developments and investor sentiment shape Ethereum’s trajectory amidst this evolving landscape?"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPcWpPcG1sNEEwQWI3NFlVaXRkV055dnVibEdhZDNHT3Y1bk01NnBDdFZxRVlVaS1PUXVndlRRWmdZNTNmTzRxY1NVOXpKRHVUOVNEQk5meFoyWGl4VlhTY1V3eGNnLXhRaFZGRVluZUJfc3RYSWNiSmFmN3RZZWRXRGNvNFpLdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs Finally Approved by US SEC: A New Era for Institutional Investing - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQUVFraXVNUWdzek41UHdqUkk3VGwzbmwySnJlc212V0pJcWFFcGMxcDY0V0FSX0pyckdRSklmSFpDOGxQblhYX2Q0TVBJR0JvZ3dNVUhtY21uNmZnaUVvUGxJaWxmYVdFY3VJeWppZk8yTm1hWFA1Q3hBdFhaN3Q0X0lwV1JVcWw2OU5PWm5zaUg3bHNtM0d0Z3J0ZDBkQTBQT0dxSFRiOUVnQTdkUnR4bm9sdWlZc1I3eUI4QzUyZzZZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "What Would Ethereum ETF Approval Mean For The Price Of ETH? - Benzinga",
        "content": "As the financial world closely watches the developments around the Ethereum ETH/USD Exchange-Traded Fund (ETF), market participants are gearing up for significant price movements.\n\nWhat Happened: According to QCP Asia’s report on May 23, the impending ETH ETF decision has created a buzz, with implied volatility for Friday exceeding 100%, indicating that the market is bracing for substantial fluctuations.\n\nKey players such as BlackRock Inc. BLK and five other issuers have recently amended their ETF filings with the Securities and Exchange Commission (SEC), and VanEck's ETF has already been listed by the Depository Trust & Clearing Corporation (DTCC).\n\nThis has led analysts to believe that an approval is highly likely, with trading expected to commence as early as next week.\n\nMarko Jurina, CEO of Jumper.Exchange, said, \"If the BTC ETF approval was any indication, we could see a similar 60% rally from here.\"\n\nQCP Asia’s trade idea further supports this optimistic outlook.\n\nThe likelihood of ETH ETF approval under SEC Chair Gary Gensler‘s tenure appears strong.\n\nBoth Jurina and James Davies, co-founder and CPO at Crypto Valley Exchange, note that recent regulatory developments, such as minor requested changes to 19b-4 forms, suggest that approval is imminent.\n\n\"Everyone sees that ETH ETFs will pass very soon,\" said Davies. \"The SEC is following its pre-approval process, asking submitters to make minor changes to their applications, which they would not do if this was clearly not passing.\"\n\nIn the event of a denial, the most probable outcome would be a series of lawsuits, similar to the reaction following the initial rejections of spot Bitcoin ETFs.\n\nApplicants would likely challenge the SEC’s decision in court.\n\nDavies explained, \"If BTC ETF approval story is informative, we will likely get ETH ETF approval as a result of legal challenges.\"\n\nAlso Read: Bitcoin Spot ETFs Notch $154M Inflows As Popular Bitcoiner Slams Ethereum: ‘A Speculative Platform For Gambling’\n\nWhy It Matters: The approval of ETH ETFs holds significant relevance as it would enhance the credibility of the cryptocurrency industry.\n\n\"ETFs increase the level of credibility of the industry, given that the SEC is giving a stamp of approval,\" noted Jurina.\n\nThis would attract larger funds and institutional investors who have been hesitant due to regulatory uncertainties, potentially leading to substantial capital inflows and bolstering Ethereum's market position.\n\nWhile the approval of ETH ETFs could pave the way for other crypto asset ETFs, analysts like Davies believe that Ethereum’s unique status in the industry makes it an outlier.\n\n\"The broader adoption of ETFs for other digital assets would require significant market infrastructure development,\" said Davies.\n\n\"We need to see places to instantly hedge other tokens in a cost-effective manner, with depth, to enable ETF providers to manage risks.\"\n\nIf ETH ETFs are approved, the repercussions for the ETH token price could be substantial.\n\n\"The market is not anticipating a rejection,\" Jurina commented, indicating that political ramifications could also arise if the SEC were to deny the applications at this stage.\n\n\"Household names have filed for ETFs and committed significant capital to their building. If the SEC were to reject at this late stage, it would be a shock and create political repercussions, which it is apparent Biden would not want to see at the present moment.\"\n\nWhat’s Next: For those looking to stay ahead of these developments and gain deeper insights into the future of digital assets, Benzinga’s Future of Digital Assets event on Nov. 19 will be a crucial gathering.\n\nIndustry leaders and investors will converge to discuss the regulatory landscape, investment strategies, and the evolving digital asset market, providing a comprehensive overview of what lies ahead in this dynamic field.\n\nRead Next: VanEck’s Spot Ethereum ETF Listed On DTCC As SEC Decision Looms\n\nImage: Shutterstock"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNGtPb0FGM2E4Z1lpc1NSam5wamhxRWZMbGVjcWdNT1JFTUMtWlhneFR1eE5SMVAzWVN5MzUzUzd0Smpnc01uNld5U2g2QkNueFZrS013TzBld21FZXpSUTFETng5SmFvdmxRcXkzMU8zUjBOUTBHU1JVUDBwaUtyU3k4VDVIS0piRFJ2enplc0dIWk45bGNHNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Surged Higher This Week - The Motley Fool",
        "content": "These three megacap tokens are moving higher on the heels of a big potential catalyst.\n\nIt's been a wild ride in the cryptocurrency world this week, but it's mostly been a ride higher for investors in the largest blockchain projects. Bitcoin (BTC -1.37%), Ethereum (ETH -0.02%) and Dogecoin (DOGE -4.66%) have seen some remarkable moves higher over the past week, surging 3.3%, 28.7% and 5% over the past week, as of noon ET on Thursday.\n\nThe story this week that appears to be providing the rising tide lifting the boats of all large-cap digital assets is the expectation that a ruling should be forthcoming this week as to whether the Securities and Exchange Commission (SEC) will approve spot Ethereum ETFs.\n\nBitcoin went on a run heading into the ultimate approval of spot ETFs for that crypto, and there was a flood of capital into this asset. This is a clear and meaningful catalyst for the overall sector and could lead to other similar products down the line.\n\nLet's dive into each of these tokens and what to watch in the week ahead.\n\nAre spot Ethereum ETFs coming?\n\nSome level of uncertainty remains on the ultimate decision from regulators for both the VanEck spot Ethereum application (due sometime later today) and the ARK 21Shares ETF application due tomorrow. Earlier this week, expectations were that we wouldn't hear anything until next week at the soonest. Accordingly, with the timeline moved up, investors will soon see whether these bullish bets were correct.\n\nPotential capital flow into Ethereum could disrupt inflows into Bitcoin-focused spot ETF funds. Thus, the price action we're seeing with Bitcoin heading into this announcement isn't surprising. Ethereum's gain should (at least somewhat) be Bitcoin's loss, though it's worth noting that Bitcoin has still trended positively on this news, since it's good for the broader sector.\n\nDogecoin's price action appears to be relatively detached from the top two cryptocurrencies by market capitalization. That said, expectations of greater liquidity in this space courtesy of institutional investors have traders ramping up on more-speculative bets to capture the maximum amount of upside today.\n\nWhere to go from here\n\nPersonally, I think the safest place to be right now when it comes to these top digital assets is on the sidelines. Yes, there's some major upside potential should the SEC rule in favor of spot Ethereum ETFs. But I think the downside risk of a \"no\" could outweigh any future gains (and to be sure, a lot has already been priced in).\n\nVarious regulators have displayed different levels of enthusiasm for these spot Ethereum ETF products, so the outcome remains uncertain. Until we have an approval on the books, this is a catalyst I don't think is worth trading on right now."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxORE51WjA0R2wySzVaYkRwLWhPaTdZMlBHWGVkSVZ2azZ4Q2JsejdvZTNsX1V6NG0xMlltZmV6b2lBVUc4QWVRTUd4NTN0ekhNaGNDLVJwWmxSWGxuT2xENjZlSkxwUzlrV1ZyckE3OE43NDhxQjhHS25tZVJxaDkwV3pPOVFyZkdVdHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum Records Largest Daily Gains In 3 Years, Flips Mastercard And LVMH In Market Cap - Yahoo Finance",
        "content": "Ethereum Records Largest Daily Gains In 3 Years, Flips Mastercard And LVMH In Market Cap\n\nOn Monday afternoon, news broke that the probability of the SEC at least partially approving a spot ethereum ETF had vastly increased. This immediately led to massive buying activity for ETH, sending the price from less than $3,100 to over $3,800 in 24 hours. This marked the largest daily move for ETH since May 2021.\n\nDon't Miss:\n\nHolding 0.001 Bitcoin could make you a multimillionaire, according to Fidelity director — but for how long?\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nThe move followed a post on X from Eric Balchunas, a Bloomberg ETF analyst, who has been covering crypto ETFs for several months. The post detailed how he is raising the \"odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they’d be denied).\"\n\nThe post has amassed nearly five million views at the time of writing and was one of the first to start the frenzy surrounding the spot ETH ETFs. The announcement was highly unforeseen, as many had written off the ETFs due to the SEC's lack of comment on the issue and final deadlines for a decision looming later this week.\n\nTrending: According to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nThis news further enabled ethereum to reach a market cap of over $450 billion, making it larger than all but 20 companies worldwide. Here are some of the companies that ethereum surpassed after the news:\n\nMastercard (MA)\n\nLVMH (LVMUY)\n\nProcter & Gamble (PG)\n\nSamsung (KRW)\n\nBank of America (BOA)\n\nHowever, approval of ETFs is not as black and white as a simple \"yes\" or \"no\" from the SEC because two forms must be approved for the ETFs to go live. The 19b-4 form allows the funds to list the ETFs, while the S-1 form is a detailed account of how the ETFs would work. According to ETF analyst Nate Geraci, the SEC could greenlight the 19b-4 forms but delay a decision on the S-1s. This would give them time to take a closer look at the individual applications from different sponsors to understand what a launch would look like.\n\nIf this were to happen, it would be a positive for the spot ETFs and ethereum. It would allow the applications to move into the next stage of the process and one step closer to launch. Additionally, the possibility of full approval of the 19b-4s and S-1s is still on the table.\n\nMany crypto enthusiasts believe that a spot ETF approval would propel ETH to a price above $4,000, with some predicting that ETH could set new ATHs above $4,900. Given that Bitcoin hit new highs after the approval of its ETFs, a similar trend could occur for ethereum.\n\nStory continues\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Records Largest Daily Gains In 3 Years, Flips Mastercard And LVMH In Market Cap originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOZjV5ZVFlUUxGSUdTbG1UTGpNN0xJMW8xOVhEZEdJbmUtNkVWZEc4OUZuamlMTExqNWgtNER5Ymd6cFNhX05sdnM1SVJENWJEWFA0cFlLcDZ6aW1DeFhDdTIxcDRIa0ZyVGpSN3ZycmdhNDhHMWQ3YWdUUnlUSlNRckY5Si1KZ00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "SEC Changes Ethereum Rule, Sets Stage for ETF Approval - Yahoo Finance",
        "content": "SEC Renders Decision on Spot Ethereum ETFs\n\nThe Securities and Exchange Commission on Thursday approved a rule change that sets up proposed spot Ethereum ETFs for final approval.\n\nThe SEC must still approve the S-1 registration statements, but observers of the process have said such approvals are generally a formality.\n\nThe announcement on Thursday on the agency's website seemed unlikely barely a week ago and underscores the growing demand for cryptocurrency-based investments.\n\nThe decision affects funds proposed by VanEck, BlackRock, Fidelity, Bitwise, Ark 21 Shares, Grayscale. These new products will be based on the ongoing price of ether the native cryptocurrency of the smart contracts Ethereum blockchain. Existing ether-based ETFs are based on futures contracts.\n\n\"This approval order is based on all of the Exchanges’ representations and descriptions in their respective amended filings, which the Commission has carefully evaluated,\" the SEC said in the filing. \"For the reasons set forth above, including the Commission’s correlation analysis, the Commission finds that the Proposals are consistent with the requirements of the Exchange Act and the rules and regulations thereunder applicable to a national securities exchange\n\nEther fell about 5% since the announcement, to about $3,710 this morning after was recently trading hands at about $3,820 shortly after the SEC statement last night, according to crypto markets data provider CoinMarketCap. The second largest digital asset behind bitcoin in market capitalization has risen more than 30% over the past week with much of the gains coming after the SEC signaled a willingness to approve the rules change. In the days before Thursday's announcement, the agency asked issuers to amend the 19b-4 forms to address concerns about investor protections and regulatory oversight.\n\nThe updated applications have eliminated staking rewards, a high-risk strategy in which investors use ether as collateral to validate transactions on the blockchain.\n\nVanEck, Ark 21/Shares September Filings\n\nVanEck and Ark/21 Shares filed their spot Ethereum proposals on Sept. 6. Seven other issuers filed their applications in the ensuring seven months, including Grayscale, BlackRock, and Fidelity, whose slightly more than four-month-old spot bitcoin funds are the largest by assets under management. The 11 spot bitcoin funds have generated about $13 billion in inflows.\n\nDespite the spot bitcoin funds' success, investors and analysts doubted that the SEC would greenlight VanEck's and other spot ether-based funds—at least any time soon.\n\nStory continues\n\nThe agency had been concerned that spot Ethereum ETFs are vulnerable to market manipulation and fraud, which agency Chairman Gary Gensler has argued plage digital assets, and which presented an obstacle to spot bitcoin approvals. But amid robust demand and shifting political winds that have seen once crypto-shy Democrats join Republicans in support of digital asset-related investments, the SEC seemed to become more receptive to the products based on ether's price.\n\nGrayscale praised the decision in a statement.\n\n\"At Grayscale, we appreciate the opportunity to engage constructively with regulators as they review spot Ethereum ETFs, and we remain optimistic about the potential of bringing Ethereum further into the US regulatory perimeter in the ETF wrapper,\" a company spokesperson said.\n\nBut in a note to etf.com, Peter Eberle, president and chief investment officer of Lafayette, Calif.-based digital asset fund manager Castle Funds, wrote that he was \"surprised\" by the SEC decision and was uncertain about investor interest in the products.\n\n\"As a long-term investor in ETH, we stake our ETH, which earns us about 3%,\" he wrote. \"These ETF’s will not be allowed to stake.\"\n\nHe added: \"I also don’t believe that institutional investors need to add ETH to their portfolio since it is highly correlated to BTC. If they allocate 1-3% to crypto, do they really need both BTC and ETH? I am bullish on ETH despite my skepticism of ETH ETFS.\"\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTDliYkhySmlnWWwtVzY2bkVQZVFmVHBOdzJfYVppb3VQX29qVXBXOFNXTjQ2NktwNTBFYzYxRFRnYktGZ2hjaUxVSUFLeTloNjJmYmJuLTl1MUtJSWVEWjgwYUZ5YjEwRFVxRU5aUVlZRGROV2hpUlQyRFU1RXVqNHZYQnhnTlBYalNVUzZFRTAyOXFLbXZBVtIBngFBVV95cUxQbDlHdG5HdXUtZUtvbVJUWFI2R0Q0MW5oX3BSMzdMaFRPNFVMUWpVWVQ4b0N5d0FORGpoWDhqcktKODZEdGRydnZWcWExYUQ3MFNOSXhwb0lETm1lUVpiM000RlJQVWJ2LW1HWXdFS0ZFMF9qd0tFcW55N0FRaVVyLUhIYmxjOHFZM3ZkazlDM0xTOFk0Vy1NN2F3YlhCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC approves rule change to allow creation of ether ETFs - CNBC",
        "content": "A representation of cryptocurrency Ethereum is placed on a PC motherboard in this illustration taken on June 16, 2023.\n\nThe SEC has approved a rule change Thursday that would pave the way for ETFs that buy and hold ether , one of the world's largest cryptocurrencies.\n\nThe decision comes less than six months after the Securities and Exchange Commission approved bitcoin ETFs. Those funds have proven to be a big success for the industry, with net inflows already surpassing $12 billion, according to FactSet.\n\nLate May had long been pegged as a potential decision date for the ether funds since it coincided with a deadline for the SEC to decide whether the VanEck Ethereum ETF could proceed.\n\nMany of the companies that sponsor bitcoin ETFs — including BlackRock, Bitwise and Galaxy Digital — have also started the process of the launching an ether fund.\n\nThe price of ether rose just 2%, although it follows a 20% surge from earlier in the week in anticipation of Thursday's decision. Some investors may also be on pause, as the SEC's rule change approval does not guarantee that all the funds will launch.\n\nSpecifically, the SEC's order approves applications from various exchanges to list eight different ether funds. The order technically does not approve the funds themselves or set a date for the ETFs to begin trading.\n\nEther ETFs are expected to be smaller, at least initially, than their bitcoin counterparts. The Grayscale Ethereum Trust currently has about $11 billion in assets, much smaller than what the firm's bitcoin fund was before its conversion.\n\nThe approval of the ether ETFs is a sign that the SEC's stance toward crypto may be softening after a series of legal fights. The agency lost a lawsuit against Grayscale in 2023 that spurred the approval for the bitcoin products.\n\nThe SEC's push to regulate crypto has also come under scrutiny by politicians. The Senate last week passed a resolution to withdraw an SEC staff bulletin about accounting rules for digital assets.\n\nEther is the second largest crypto asset and has become something of a blue chip coin along with bitcoin, although its value proposition is distinctly different. While bitcoin is seen primarily as a long-term store of value, an investment in ether is considered more akin to an investment in early stage technology. The ether token fuels the Ethereum network, which powers different applications, like decentralized finance (DeFi) projects, nonfungible tokens (NFTs) or the tokenization of real world assets like commodities, securities, art, real estate and more.\n\nThe applications approved Thursday do not apply to other crypto projects on the Ethereum network, said Richard Kerr, a partner in the law firm K&L Gates.\n\n\"If and when an ether product is approved, it won't mean that a similar product for other digital assets on the Ethereum platform would be approved,\" Kerr said.\n\nEthereum also provides opportunities for staking, which is a way for investors to earn interest on their ether holdings by locking up tokens on the network for a period of time — although ether ETFs in the U.S. may not participate. The SEC has alleged in lawsuits against Coinbase and Kraken that staking-as-a-service offerings are unregistered securities. Ark, Fidelity and Grayscale updated their filings this month to remove staking from their proposals.\n\nThe lack of staking in the ETF products is another reason why ether ETFs may see less demand than their bitcoin counterparts, said Steven Lubka, managing director at Swan Bitcoin and head of Swan Private.\n\n\"These numbers are not going to match the bitcoin ETF inflows, and there are some structural differences in the product that just make it less attractive overall,\" Lubka said."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQV19Fek5TbDBsMmctTHNSWk5FSWhJVU5wQ2F6RFFYRHJ5V1p3T2NteXJTcXB6V0dCbkFiM1hTSGFBUGNMNzNlUXc2MjdkSzR2TVgtcHJmNjIxYVRTdjh2S1pYdGIxTThjNVBmeXJwTjNSR2JuZEpTeDVrZXFYQloxMjJ4Rm5CM0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Decision Recalls Spot Bitcoin Launch - Yahoo Finance",
        "content": "Cryptocurrency\n\nRemember the spot bitcoin ETF launch?\n\nAs the spot Ethereum ETF approval drama unfolds, investors and exchange-traded fund industry observers can recall parallels between this case and events leading to the eventual approval and unveiling of spot bitcoin ETFs.\n\nIn both cases, the Securities and Exchange Commission (SEC) initially exhibited caution toward approving spot ETFs for these cryptocurrencies. However, pressure from various stakeholders, including issuers, investors and the maturing crypto market, spurred a potential shift toward approval.\n\nBoth decisions reflect growing recognition of the maturing cryptocurrency market and rapidly increasing institutional interest in these assets.\n\nThe presence of spot bitcoin ETFs and the potential approval of an ether-based ETF suggest the SEC is considering the growing demand from investors for regulated ways to gain exposure to these cryptocurrencies.\n\nA key difference between the two cases is that the Ethereum ETF approval process may be faster than bitcoin's due to the legal precedent set by the August 2023 Grayscale court case, which effectively reversed the SEC’s initial rejection of the asset manager's spot bitcoin ETF application.\n\nBoth cases highlight the complex path to approval and greater receptivity toward well-structured spot cryptocurrency ETFs.\n\nIs a Dogecoin ETF Next?\n\nIn the first two days of trading this week, the popular cryptocurrency Dogecoin (DOGE) jumped 9% as investors began to speculate that the largest meme coin by market cap could be the next for a spot ETF approval.\n\nCrypto trader Andrew Kang tweeted to his 244,000 followers on X Tuesday, “the odds for a DOGE ETF look brighter than ever.”\n\nWhile speculation over more spot ETFs is not surprising, it would be surprising if a spot DOGE ETF was next in line.\n\nCryptocurrencies with clear and demonstrably valuable use cases beyond speculation might be viewed more favorably. Additionally, a well-developed ecosystem with robust infrastructure for secure storage and transactions could be a plus. Widespread acceptance, measured by larger market capitalization (total value of all outstanding coins) and higher trading volume (liquidity) may also be considerations.\n\nFor example, there are five cryptocurrencies other than Bitcoin and ether that have larger market caps than Dogecoin, according to data from CoiMnarketCap.com.\n\nBehind Bitcoin and Ethereum, these are the largest cryptocurrencies on the market:\n\nTether USDt (USDT): This stablecoin, with a market cap of roughly $111 billion, is pegged to the U.S. dollar and is a popular choice for investors seeking stability within the crypto market.\n\nBNB (BNB): The native coin of the Binance ecosystem, BNB, has a market cap of around $91 billion and is used for various purposes within the Binance exchange and its blockchain applications.\n\nSolana (SOL): Solana, known for its fast transaction processing speeds, currently has a market cap of approximately $80 billion.\n\nStory continues\n\nOverall, the spot Bitcoin ETF launches and increasingly likely spot Ethereum approvals are positive developments, but they don't guarantee a flood of spot ETFs for more cryptocurrencies. The SEC will likely continue cautiously, prioritizing established cryptocurrencies with well-structured ETF proposals.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNRjZwZnN2bWxoUkc2M1FOWlFPaG14SlE4VTExNnhzakFJWUV2THlVYkhhNXVobW1kZFRqSW1sUkFCT09KVFZVZDc0YnZzOG5lUXBEUUs4OUxLUlZ4UndNUXh3T19zQjZvSXVKd0xGeVRwQzhZSkNZV1BJandZWFplSUZ1TVRicWxzaTFLWUlwWEZETHQzejJMYUV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC Starts Talks with Ethereum ETF Issuers on S-1 Forms - Crypto Times",
        "content": "The U.S. Securities and Exchange Commission (SEC) has initiated discussions regarding S-1 registration statements with potential Ethereum ETF issuers. This development comes as amended 19b-4 forms have been submitted, although progress on S-1 forms has been minimal.\n\nA senior executive at an issuing firm revealed that these discussions are in the early stages. “It feels like the Division of Investment Management was somewhat caught off-guard by this shift. So, it’s just starting,” the source commented. Still, there is cautious optimism that the Ethereum ETF will move forward.\n\nFor Ethereum ETFs to be approved, the SEC is supposed to approve the 19b-4 forms, followed by the S-1 registration statements becoming effective. Only then can trading start. Typically, these forms undergo multiple amendments before final approval.\n\nWhile there has been significant movement on the 19b-4 forms, only Fidelity has recently filed an amended S-1 form. With discussions now beginning on the S-1s, further amendments are expected.\n\nThe SEC faces a crucial deadline today to approve or deny VanEck’s Ethereum ETF 19b-4 form. Bloomberg ETF analyst Eric Balchunas anticipates a decision around 4 p.m., noting that past announcements have varied slightly in timing.\n\nHowever, even with 19b-4 form approvals, the S-1 forms take a long time to complete and approve for use, which can result in a slight delay in trading. Recently, BlackRock and Grayscale submitted their 19b-4 amendments and products related to the spot Ethereum ETFs."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOOHpJQ2xXYndEMnBXR0lGSVAzQUhQb1VIbzFsR0p2TE44NzZza2FOMmpMVzdGWm1lT2R6ZkkwUzgzbWxxejZEcWh4VGUxZU9wX2RCRkpnN1RMRFY5ZGtONHFvRGRsRmlEdmRhMnpkc0N3LVppamNBUGJSOU1mbzR4RTZqaGstUXVuMXBSX29EMk9HSm4yZDhOWkJfcV9qZlFkLVBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "With Ethereum ETFs poised to rock the US market, Europe asks ‘what took you so long?’ - DLNews",
        "content": "Europe has many crypto exchange-traded products on the market.\n\nThe UK launched an Ethereum ETP this week.\n\nEuropean investors aren’t that interested in crypto ETPs.\n\nIn the US, the crypto industry is buzzing in anticipation ahead of an expected approval of spot Ethereum exchange-traded funds.\n\nBut nations across the Atlantic are already miles ahead with similar crypto investment products.\n\nThe London Stock Exchange, for one, will begin handling Bitcoin and Ethereum exchange-traded products for the first time by the end of May.\n\nNumerous ETPs\n\nAnd in Europe, there are already multiple Ethereum financial products, or ETPs, on the market. They include exchange-traded notes and exchange-traded commodities, which operate in similar ways to ETFs.\n\nBut the products, which have been on the market for years, haven’t caught much steam. That’s because Europeans are less keen on risky investments and prefer stability, experts say.\n\n“If we’re talking about where’s the alpha going to come from, it’ll be the place with the deeper capital markets and more eager investor base driving the inflows to push these things upward,” Erwin Voloder, head of policy at the European Blockchain Association, told DL News.\n\nDigital asset investment firm 21Shares launched its Ethereum Staking ETP in 2019, and Ethereum ETPs from VanEck and CoinShares made their debutsin 2021.\n\nBut inflows are relatively small.\n\nJoin the community to get our latest stories and updates\n\nThe 21Shares’ Ethereum ETP has over $307 million assets under management, and VanEck’s has a total net assets of $175 million.\n\nMeanwhile, in the US, institutional investors are already prepared to pour $500 million into Ethereum ETFs over the next week if they are approved, according to an analysis by the OKX exchange.\n\nEnthusiasm in the US\n\nThe products follow the price of Ether and allow investors a way into crypto through a bank or investment firm without having to open a crypto wallet or an account with a crypto platform.\n\nFor proponents, crypto ETFs and ETPs provide digital assets with validation and a bridge to broader financial markets.\n\nThe US Securities and Exchange Commission approved 11 Bitcoin spot ETFs in January. The two biggest funds, launched by BlackRock and Fidelity Investments, have vacuumed up more than $30 billion between the two of them as of Thursday.\n\nBut there are stark differences between Europe and the US.\n\nEurope has “more of an ecosystemic approach” to innovative finance, according to Voloder.\n\nWith legal frameworks for crypto assets starting to come into effect this year and other investment guidelines from regulators, lawmaking sets the foundations.\n\n‘Even if Europe has the regulations, our investor base has always lagged behind America.’ — Erwin Voloder\n\n“EU regulators are more proactive and US regulators are more reactive which is why you see broker dealers launching digital asset structured products in Europe,” Voloder said.\n\n“Regulations enable innovation and experimentation,” he added. This is what allows financial institutions to test tokenised financial instruments.\n\nBut still the size of the capital markets is reflected by that underlying divergence.\n\n“Even if Europe has the regulations to enable innovation, our investor base has always lagged behind America,” Voloder said.\n\nCrypto ETPs beyond Ethereum\n\nCardano Staking ETP by Liqwid began trading on Deutsche Börse exchange group on Wednesday. The product is domiciled in Switzerland.\n\n“Switzerland is at the forefront, as staking is regulated here, allowing us to build products incorporating staking—something not yet possible in the US,” Florian Volery, co-founder of Liqwid Finance, told DL News in an email. He is hopeful that the US will eventually catch up.\n\nThe DeFi entrepreneur expects to see actively managed ETFs that include other crypto assets like Bitcoin or Solana in an investment strategy.\n\n“This development is a game changer for the crypto industry, making it mainstream and a dedicated investment category within the asset and wealth management industry,” Volery said.\n\nInbar Preiss is a Regulation Correspondent at DL News. Contact her at inbar@dlnews.com."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNZEVmajdfdUVfUGFBZ3lZVGw2WUlTSmNVcF9ra1F4NVFzWWN3bERMZ3Z1bDdIb20wXzdoNlMxeUpMYlJSaG9QTVl1RXd2OVJuRC15MERvWWs1QWN0NWgzeFJ3WW5mUjNpalR4LWFLeHBHMjZpMWlrNmNFTFloSWpnNUlXcHBEcFV4RUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum Leverage Trading: Long or Short ETH with Up to 50X Leverage on HUX - Yahoo Finance",
        "content": "Margin Trade Ethereum and Other Top Crypto with up to 50x Leverage Directly from Crypto Wallet\n\nDUBAI, UNITED ARAB EMIRATES / ACCESSWIRE / May 23, 2024 / HUX , a leading platform in the decentralized finance (DeFi) space, has recently upgraded its offerings, introducing the ability to trade Ethereum, Bitcoin and other top crypto's with up to 50X leverage. Hux caters to both seasoned traders and newcomers, providing sophisticated tools to amplify trading strategies all directly from your crypto wallet.\n\nEthereum Leverage Trading: Long or Short ETH with Up to 50X Leverage on HUX\n\nHow to long Ethereum with Leverage?\n\nLeverage trading allows traders to increase their exposure to Ethereum without needing the full amount of capital typically required. On HUX, traders can choose how much leverage they wish to apply, up to a maximum of 50 times their actual investment. This means that for every dollar, a trader can hold a position worth up to fifty dollars in Ethereum. To initiate a leverage trade, a trader selects their desired level of leverage on the trading dashboard, inputs the amount of ETH they wish to trade, and executes the order, closely monitoring the market for fluctuations.\n\nUnique Trading Features of HUX for Crypto Leverage Trading\n\nBeyond the basic leverage mechanisms, HUX Finance offers several unique features that enhance the trading experience:\n\nDirect Trading from Wallet: HUX allows users to trade directly from their cryptocurrency wallets, bypassing the need to transfer funds to the platform. This feature enhances security and convenience, as traders can maintain control over their funds until the moment of trade.\n\nLimit and Stop-Loss Orders: Traders can set limit orders to execute a trade at a specific price point and stop-loss orders to automatically close a position at a predetermined price. This functionality is crucial for managing risk and securing profits without needing to monitor the market continuously.\n\nOne-Click Trading: For those looking to execute trades quickly, HUX offers a one-click trading feature, which simplifies the trading process. This is particularly useful in volatile market conditions where speed is of the essence.\n\nThese features, combined with high leverage options, make HUX a robust platform for trading Ethereum, catering to both novice and experienced traders by providing tools that facilitate effective trading strategies and risk management.\n\nHow to Short Ethereum on HUX?\n\nShorting Ethereum is a strategy used by traders who anticipate that the price of ETH will decrease. On HUX, to short ETH, traders select the 'Short' option, effectively selling ETH at the current market price with the expectation to buy it back at a lower price in the future. This is done using leverage to increase potential gains from small price movements. Establishing a short position involves specifying the amount of ETH to short and the level of leverage. Traders also have the option to set limit orders to enter the market at a specific price, and use stop-loss orders to manage risk by specifying a price at which the position should be automatically closed to prevent significant losses.\n\nStory continues\n\nRisk Management and Auto-Deleveraging\n\nNavigating high leverage and short positions comes with significant risks, particularly from volatile market movements that could lead to rapid gains or losses. HUX's risk management tools are designed to help traders manage these scenarios effectively. The platform includes features like real-time liquidation alerts and auto-deleveraging (ADL), which helps maintain market stability by automatically reducing leverage in overly exposed positions, ensuring the market's balance and integrity. Trading Ethereum on HUX involves certain fees, which are clearly outlined in the platform's fee structure. These include fees for opening and closing positions, as well as fees based on the trade's impact on the market's liquidity. Additionally, HUX offers different market types - fully backed and synthetic markets, each catering to different trading strategies and risk levels.\n\nWith the introduction of up to 50X leverage for Ethereum trading, along with the ability to long/short ETH, HUX is setting a new benchmark in the DeFi trading space. These tools enhance the trading experience by providing flexibility, extensive market exposure, and effective risk management mechanisms, making HUX an attractive platform for Ethereum traders aiming to capitalize on market trends and volatility.\n\nMedia Contact\n\nCompany Name: HUX Finance\n\nEmail: contact@hux.finance\n\nWebsite: https://hux.finance\n\nFollow on Twitter: https://x.com/huxfinance\n\nSOURCE: Hux Finance\n\n\n\n\n\nView the original press release on accesswire.com\n\n\n\n"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB6LXkyTkoyd3M0SVdfVGVqVTdKc1lLclplVzJzZS15QXhNVnlvQ1A4bzd6MFdzNU5NRzJMQ1NPekJKbGJtTFdVNzR4QlNCeEJOdzJxYkZRaVBtZkRnaFFaMUt5QU44ckFtU3ZCaUg2Ym9nQnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Buterin's Ethereum Transfer Sparks Crypto Frenzy: $300K Surge For Privacy Shield - TronWeekly",
        "content": "Vitalik Buterin, cofounder of Ethereum, made a notable move in the cryptocurrency space today by transferring 80 ETH, valued at approximately $300,000, to the privacy-focused coin mixer Railgun. This transaction marks the latest in a series of monthly transfers Buterin has made to Railgun over the past six months.\n\nRailgun, renowned within the crypto community for its robust privacy protocols, offers coin mixing services designed to protect user anonymity and prevent malicious activities. Buterin has been an outspoken advocate for Railgun’s privacy pools protocol, which he argues significantly bolsters user privacy by complicating efforts to trace transactions back to their origin. “Privacy is normal,” Buterin has previously stated, underscoring the critical role of privacy in cryptocurrency transactions.\n\nThe privacy pools protocol employed by Railgun uses advanced cryptographic techniques to ensure transactional anonymity, addressing mounting concerns about privacy breaches in the crypto ecosystem. This innovative approach has made Railgun a favored platform for users seeking heightened security and confidentiality in their crypto dealings.\n\nEthereum Navigates Privacy Imperatives\n\nButerin’s consistent use of Railgun reflects a broader industry trend towards prioritizing privacy in cryptocurrency transactions. As regulatory scrutiny of cryptocurrencies intensifies globally, platforms like Railgun, which emphasize privacy, are increasingly viewed as essential for maintaining transactional confidentiality while complying with regulatory requirements. This trend is particularly significant for Ethereum, which continues to see growing adoption and an evolving regulatory landscape.\n\nThe timing of Buterin’s latest transfer coincides with a bullish phase for Ethereum’s market performance. Recent data shows ETH trading at $3,740, a 2.06% increase over the past 24 hours and a significant 29% rise over the past week. This surge in Ethereum’s price is fueled by community anticipation around potential approvals of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC).\n\nButerin’s strategic move underscores the importance of privacy-focused solutions like Railgun in the rapidly evolving cryptocurrency market. As Ethereum continues to gain traction and regulatory landscapes shift, the role of platforms like Railgun in safeguarding user privacy is set to become increasingly vital."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE14SlpFRVpsekVFVVFMc1pHdVROdmJ0dFBmOFdIWS0zQzd5SWZaNGVPcW1iUXBtVHRMc2lqWm5jblNxZUhJOGxGcVpYVjVqVVlkNzZ4NXo3SHZHTWJkY21wUG5MY0ZFV3h4YjdTM0RR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC Approves All Spot Ethereum ETFs - Watcher Guru",
        "content": "The culmination of a tumultuous journey has finally arrived, as the US Securities and Exchange Commission (SEC) has approved the issuance of Spot Ethereum ETFs. Indeed, the decision arrived just five months after the agency granted similar approval to the Spot Bitcoin ETFs to start the year.\n\nThe decision marks the approval of the country’s second crypto-based ETF. Moreover, it represents a monumental shift in the overall accessibility of the second-largest cryptocurrency to institutional investors.\n\nBREAKING: 🇺🇸 SEC officially approves all spot Ethereum ETFs. May 23, 2024\n\nThe official filing was published briefly by the SEC, but it was taken down shortly after by the regulator, possibly due to being leaked early. The filing has since been republished. The SEC initially looked to delay the approval decision as long as they could due to previous sentiment against cryptocurrencies, but now the ETF market will include both Bitcoin and Ethereum. Issuers will still have to wait for their individual filings to be approved.\n\nAlso Read: SEC Chair Gary Gensler: ‘Stay Tuned’ on Ethereum ETF Decision\n\nSpot Ethereum ETFs Approved by SEC\n\nFollowing the approval of Spot Bitcoin ETFs at the start of 2024, the market anticipated what cryptocurrency could be next. Naturally, all eyes are directed toward Ethereum. Although it appears likely, the overall sentiment of the SEC has diminished optimism that such an approval could take place.\n\nThat changed significantly at the start of May’s second to last week. Seemingly out of nowhere, Bloomberg increased the approval odds from 25% to 75%. Thereafter, the market began anticipating the impending arrival of the Ethereum-based investment offering.\n\nNow, that anticipation has been rewarded as the SEC has approved all Spot Ethereum ETFs. The landmark decision means that the United States now features crypto-based ETFs for the two most prominent digital assets in the world. Moreover, it is a critical part of a greater transition for the country’s perspective on the assets.\n\nAlso Read: Top 3 Cryptocurrencies To Buy For 5X Gains In Anticipation Of Ethereum ETF Approval\n\nConversely, applications for the Ether-based ETFs have been submitted by a plethora of issuers. Specifically, VanEck, ARK21 Shares, Hashdex, Invesco Galaaxy, Franklin Templeton, Fidelity, and the world’s largest asset manager, BlackRock. Of those firms, VanEck faced the most immediate approval deadline.\n\nWhat Is The Next Step For Spot Ethereum ETFs?\n\nNow that Ethereum ETF 19b-4 forms have been approved, issuers must wait for their S-1 forms to be approved before trading of the assets can commence. These forms are necessary to offer new securities publicly. This process may take more time for the SEC to process for each filer, especially if the regulator still holds any dissatisfaction for Ethereum ETFs. Based on the timeline for the Bitcoin ETFs, this process could take anywhere from weeks to months.\n\nAll eyes are on how the situation could affect the market as a whole. Bitcoin’s offering led the asset to reach an all-time high in just three months. Many experts predict similar developments for Ethereum, with building anticipation of the ETF leading the asset to increase almost 30% over the last 7 days, according to CoinMarketCap."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQa2ZDMVIzeGtQcnBVNGd6VmFDdVZ1c1d0VVRPZGU0OGg5SkJjbVBBaC1zSHR3NjY5S3BGTkNIUWZkYk42MGJWTjI0NVduc1JQUmZmMjY3aGt1TjI4VlhWYkRvR1JFTFdVVmRDekVicWk4bG9aUUhOUTIwNlpzNmdOelBsNkl0SG9lUmZN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF deadline approaches tonight - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nEthereum ETF deadline approaches tonight\n\nCNBC's Bob Pisani joins Halftime Report with the latest on SEC's decision on Ethereum ETF."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNaF82d0pYUlA3X0Z3c0dfTGloUm5YTVFtUDN4bjBuM2NTbWVZSmRHV0hqMTRyOU9lU2U0NWFQMkpoTnc4THNJX2FkaG52YTJndFRyNWxmVGxyRVZvaUpqNmxHWFhhaWtvRno2b21naWtTRlFueWJFYTdLZEpmNGtmMFhPXzNiUktLbWVUbWpYTElMUVJpWktuUG9nY3JHWHhyTDk3cThxN1lVcW82V3ZZTlREbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum’s powerful new ‘EigenLayer’ promises a wave of innovation. But is it a threat to the blockchain? - Fortune",
        "content": "Ethereum has spent the current bull market living in the shadow of Bitcoin, but two recent developments could thrust the world’s second-biggest blockchain back into the spotlight. The first is the Securities and Exchange Commission’s surprise move to greenlight Ethereum ETFs. The second is a popular but divisive new investing feature called EigenLayer, which has received $100 million in backing from Andreessen Horowitz (a16z) Crypto.\n\nEigenLayer is a new protocol, or set of instructions, that sits atop the main Ethereum blockchain. It offers a way for those who have already invested tokens by means of staking—a blockchain feature that rewards those who lock up their tokens to secure the network—the ability to “restake” those tokens. The term is what it sounds like. By restaking, users take Ethereum tokens they have already invested and then invest them again. But instead of receiving a reward from the Ethereum network, as happens with staking, those who restake get paid by other projects piggybacking off the blockchain’s existing security pool.\n\nRestaking has existed for some time but EigenLayer is seeking to turbocharge the process by adding a lot more participants. The protocol aspires to be something akin to an Amazon Web Services for cryptoeconomic security.\n\nThe implications of this are “profound,” a16z wrote in a blog post about the company, noting that EigenLayer has the potential to accelerate innovation on Ethereum “100x faster.” While this appears to be a promising development for the blockchain, EigenLayer has yet to be tested at scale. And while it could result in a burst of innovation for Ethereum, some point to a major potential drawback: a new concentration of risk that, in a worst-case scenario, could harm both users and the broader blockchain ecosystem. Should Ethereum users view EigenLayer with excitement, fear, or both?\n\n‘Opens up a wormhole’\n\nThe arrival of EigenLayer is a boon both to investors, who can now more easily earn an additional slice of yield, and for developers who can more quickly add a trust layer in the form of collateral. The issue, however, is that using the same pool of collateral to secure multiple aspects of the blockchain creates new vulnerabilities.\n\n“It opens up a wormhole,” Rushi Manche, cofounder of Ethereum layer 2 Movement Labs, told Fortune. Manche raised a troubling hypothetical posed by EigenLayer critics: What happens if there’s a hack or a bug in the restaking smart contract? How does that affect the wider ecosystem which is also relying on this single deposit?\n\nAt the same time, Manche noted that proponents say “an entire new design space has opened up” for developers thanks to EigenLayer, allowing the same asset to be stretched much further and achieve much more. From this view, the rewards far outweigh the risk. It’s also worth considering the drawbacks if tools like EigenLayer are not available.\n\nSpecifically, in the absence of restaking, decentralized applications built on top of Ethereum must create their own proof-of-stake token—a high bar of entry for any startup. With restaking, protocols can dip into the main blockchain’s almost $95 billion of staked Ether for security. To revisit the cloud computing analogy: If hackers want to attack small businesses, they have to get past the likes of Google Cloud or AWS on which those businesses rely. EigenLayer proponents make the same case: Hackers need to get past a security system created by Ethereum, which has worth more than triple the market cap of Nike.\n\nBut, what happens when the same collateral gets reused again and again?\n\n“EigenLayer reminds me of the 2008 recession: undercollateralize, overleverage. That’ll go well,” one X user posted—just one of the industry onlookers who have drawn parallels with the financial crash, where banks rehypothecated subprime mortgage loans.\n\nAustin Campbell, the former head of portfolio management at Paxos, told Fortune that the comparison isn’t trivial. “At the core of every levered system is the simple truth that the more leverage you use, the less stable your system is,” he said.\n\nThere is a risk of “cascading failures” if one project fails, agrees Omid Malekan, an adjunct professor at Columbia Business School. But he and many experts were also quick to offer nuance to the 2008 parallels: Restaking doesn’t involve rinse-and-repeat borrowing and lending. Instead, it’s taking a locked-up asset, and locking it up again. Think of it more like reusing the security deposit on an apartment to secure further apartments, suggests Jack O’Holleran, CEO of Skale, an Ethereum layer 2.\n\nBut then what if you trash both apartments?\n\nOne scenario of so-called apartment trashing would be if those operating the restaking services—known as AVS for “actively validated services”—choose to devalue the restaked tokens. “There could be this ‘house of cards’ effect, but backwards,” says O’Holleran.\n\nThe debate is analogous to the criticism of liquid staking provider Lido, which currently accounts for 28% of all Ethereum being staked. In theory, Lido introduces a “centralized point of failure” which is “obviously concerning,” Tekin Salimi, founder of dao5 Capital and seed investor in EigenLater, told Fortune. But in his view, rather than barring this innovation, diversifying the liquid staking providers is the solution.\n\nNoting these concerns, EigenLayer says on its website that it includes a “veto committee” to contain slashing—the term used in the Ethereum world for destroying the collateral of validators who fail to fulfill their duties—and to prevent contagion to the mainnet or other protocols. It will serve as a “doubly-trusted intermediary between AVS and staker.” So, slashing conditions fall to each AVS, instead of the overall protocol’s discretion. But what this will really look like in practice, is unclear. To that effect, slashing risks remain “the most real and yet the most undefined” of all those raised, thinks Vance Spencer, cofounder of crypto venture capital firm Framework Ventures.\n\n‘Don’t overload the system’ Ethereum founder warns\n\nEigenLayer has given rise to specific security concerns, but also to a more broader existential one: What fraction of staked tokens can be concentrated on a separate protocol on Ethereum, which holds up decentralization as its paramount value? According to O’Holleran, empowering EigenLayer amounts to the Ethereum community giving considerable leverage and power to another system. Furthermore, copycat restaking services are also popping up, such as Karak, which announced a $48 million Series A raise last month. In addition, an unnamed but similar version is soon coming to market, sources close to the matter told Fortune.\n\nVitalik Buterin, Ethereum’s founder, raised concerns about EigenLayer in a blog post last May. “Be wary of application-layer projects taking actions that risk increasing the “scope” of blockchain consensus to anything other than verifying the core Ethereum protocol rules,” he wrote. Buterin warns of the “slippery slope” of the underlying network’s “fragile” social consensus losing credibility. His message was clear: Don’t overload the network’s consensus.\n\nOne of the concentration risks of top concern to Buterin is overloading the system’s security.\n\nThe strength of Ethereum’s security system is directly correlated to the economic value of the network—it would be prohibitively expensive for hackers to muster the resources to defeat the consensus system that protects the network. “We agree that Ether is being used to secure the main net network, and that is the only purpose thereof,” says Campbell. But if you are using your staked tokens to secure Ethereum and other networks, then the surface of things that Ether is being used to secure grows. So, the value resting on any single point gets larger, explains Campbell, which may provide more attractive incentives for hackers.\n\nThe second concentration risk concerns decision-making. Let’s say 40% of Ethereum’s tokens eventually becomes restaked and EigenLayer’s smart contract experiences a hack or bug. It’s unclear when there would be consensus to rollback Ethereum to release it, explains Tom Schmidt, partner at crypto venture capital firm Dragonfly. “I don’t know where that threshold is,” he admits."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOUVJfcUpGT2RxYW0xeFZZc1dzVWJJYk0xeDlxcjl6RE1hdFdRZFpvUGR5VTBvNHlCb3hFQ1VDMFcwcVZmYlZzNHZZaFhybG40bHRIYmM4T0NYNWJFVUpUaU1WU2pvWVBjY3JMQmFtR0EyZk5vV25GOFF1elBieXVHLVRlUE4tZ0lUY0R2M0dLcmJkazNzOWZmSWI1VTdwV1R1VEVGLXdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC approves Ethereum ETFs, aligning ETH closer to commodity in industry win - CryptoSlate",
        "content": "The US Securities and Exchange Commission (SEC) has approved the first spot Ethereum exchange-traded funds (ETFs) 19b-4 filings, marking a significant milestone for the crypto industry. The decision, announced today, allows Ethereum ETFs from asset managers such as Grayscale, Fidelity, and Bitwise to be listed on their respective exchanges.\n\nEthereum rose 2% on the news and was trading at $3,900 as of press time, based on CryptoSlate data.\n\nThe approval follows a rigorous application process and extensive market analysis. Grayscale’s Chief Legal Officer, Craig Salm, previously highlighted that the SEC had already addressed key issues during the approval of spot Bitcoin ETFs, which are applicable to Ethereum ETFs as well. These issues include creation and redemption processes, cash versus in-kind transactions, and custody concerns. Salm emphasized that the SEC’s prior engagement with Bitcoin ETF issuers laid the groundwork for Ethereum ETFs, noting the strong correlation between ETH futures and spot prices as a compelling factor for approval.\n\nThe SEC’s decision comes after a period of uncertainty and skepticism among market analysts. Bloomberg analyst Eric Balchunas had previously estimated a 25% chance of approval by May 23, citing the SEC’s lack of engagement compared to the Bitcoin ETF approval process. However, the approval of spot Bitcoin ETFs earlier this year, Hong Kong’s ETH ETF approval, and recent crypto wins in Congress had raised hopes among crypto proponents despite the SEC’s historically cautious stance under Gary Gensler’s leadership.\n\nThe approval process included a public comment period, during which the SEC sought feedback on various aspects of the proposed ETFs, including custodianship of funds, creation, and redemption models, and sponsor fees. This phase mirrored the approach taken with spot Bitcoin ETF applications, encouraging feedback from US citizens and organizations.\n\nThe approval of spot Ethereum ETFs is expected to have a significant impact on the digital assets market. Hong Fang, president of crypto exchange OKX, noted that while Ethereum’s price has risen this year, it has lagged behind Bitcoin’s gains, a disparity likely influenced by market anticipation of the SEC’s decision. The approval is anticipated to boost investor confidence and increase market liquidity.\n\nSeveral issuers filed applications to list their ETF on the NYSE Arca exchange, with Coinbase Custody serving as the custodian. Bitwise’s analysis demonstrated a strong correlation between the ETH spot market and the CME ETH futures market, a critical factor in meeting SEC requirements to monitor potential market manipulation.\n\nDespite the positive outcome, some industry insiders had expressed concerns about the SEC’s approach. Participants in recent meetings with the SEC described the talks as one-sided, with agency staff withholding substantive comments on the proposals. This contrasted with the detailed discussions that preceded the SEC’s approval of spot Bitcoin ETFs.\n\nThe approval also comes amid ongoing regulatory scrutiny of Ethereum’s classification as either a security or a commodity. Reports suggest that the SEC is investigating Ethereum’s regulatory classification, which added uncertainty to the approval prospects. However, today’s decision indicates a favorable stance towards Ethereum-based financial products and a potential indication that Ethereum can be considered a commodity.\n\nThe approval is a landmark event for the crypto industry, reflecting the growing interest in crypto-asset financial products among traditional investment firms. As the market reacts to this development, stakeholders will closely monitor the performance and impact of these newly approved ETFs.\n\nEthereum Market Data At the time of press 9:59 am UTC on May. 27, 2024, Ethereum is ranked #2 by market cap and the price is up 3.33% over the past 24 hours. Ethereum has a market capitalization of $469.45 billion with a 24-hour trading volume of $18.15 billion. Learn more about Ethereum › Ethereum $3,907.61 3.33% Crypto Market Summary At the time of press 9:59 am UTC on May. 27, 2024, the total crypto market is valued at at $2.57 trillion with a 24-hour volume of $68.69 billion. Bitcoin dominance is currently at 52.53%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPdkZCY2Zwb21NVEk2LXhXaXZkSkVtb21YdmZST19faFp0azFOMFpSMWhsMDF2akE3MUh6OE9JaTh0WkJsemxtbEFWWnZiQ1gzZDU5cE45YVBSVmZhMDgwWmFKY0F2eVl1Rk5LVnllUWRpU1lUekcwWl94SzdJTE12ZmExU0ZhVy1NX1M0QkNWYWI1OEluN1lsbG1BaWZZSXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Eager investors will pour $500m into Ethereum ETFs in opening week, OKX says - DLNews",
        "content": "The crypto industry is expecting Ethereum ETFs to be approved Thursday.\n\nInvestors anticipate a rally like the one following the rollout of Bitcoin ETFs.\n\nEthereum ETFs pose new challenges for crypto exchanges.\n\nInstitutional investors are ready to pour $500 million into Ethereum ETFs over the next week if they are approved Thursday, according to analysis by OKX, the crypto exchange.\n\n“It’s probably just as, if not more, important as the Bitcoin ETF approval,” Lennix Lai, OKX’s global chief commercial officer, told DL News.\n\n“The potential approval of Ethereum to be traded as a proxy under a traditional framework could bring about the next wave of institutional demand,” Lai said.\n\nFever pitch\n\nAnticipation is building to a fever pitch after the US Securities and Exchange Commission appeared this week to drop its long-held resistance to approving a spot price exchange traded fund for Ethereum.\n\nEthereum has soared 24% since Monday and boosted the proof-of-stake sector — Lido Staked Ether, for instance, is up 27% in the last seven days, according to CoinGecko.\n\nSeveral applicants — such as BlackRock, Invesco Galaxy, Fidelity, and Franklin Templeton— are eagerly awaiting the SEC’s decision.\n\nAsset manager VanEck is, however, first in line to get either a thumbs up or down from the regulator.\n\nWhile Van Eck’s head of digital assets research said on Wednesday that it expects the SEC to respect the queue, any approval will likely be extended to other applicants to avoid the agency being seen as kingmaker.\n\nJoin the community to get our latest stories and updates\n\nInvestors expect Ethereum ETFs to follow a similar course to the rollout of Bitcoin funds in January.\n\nTen such products have been trading at volumes exceeding $1.5 billion since January.\n\nRecord rally\n\nThe advent of Bitcoin ETFs and Wall Street’s embrace of the asset class spurred a record rally across crypto. This year, the sector’s market value has skyrocketed 50% to $2.7 trillion.\n\nAn Ethereum counterpart could excite animal spirits even more. Bernstein analysts’ predicted this week that Ether will surge to $6,600 if the funds are approved.\n\n“Ethereum could potentially surpass its all-time high soon after a potential ETH ETF approval,” Lai said.\n\nAn Ethereum ETF will make it easier and cheaper for retail investors to buy exposure to the second most valuable cryptocurrency.\n\n“Like the Bitcoin ETF before it, an Ethereum ETF will be a significant milestone for the industry,” Jean-Baptiste Graftieaux, CEO of Bitstamp, told DL News.\n\nCost for exchanges\n\nYet there may be a cost for crypto exchanges such as Coinbase and Kraken.\n\nETFs enable traders to access the asset class without using digital wallets or industry-native exchanges. Going mainstream, in other words, has many effects.\n\nYet Lai downplayed the long-term risk for exchanges and said the ETFs will provide a gateway for newcomers to crypto.\n\n“It may actually expand the overall market size, including volume and participants, meaning it’s complementary rather than cannibalistic,” he said.\n\nCrypto market movers\n\nBitcoin is down 1% over the past 24 hours to $69,550.\n\nEthereum is up 2.5% to $3,830.\n\nWhat we’re reading\n\nEric Johansson is DL News’ News Editor. Got a tip? Email on eric@dlnews.com."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQMFZXejJMV0oyOVo1VGpBWkx5eThEYWtxeGJnNXB6NlJHZC1NRUZOLTN2T2FqOGZERm94dFB6Ti05MmdjQXlHeU5NaXVBSG02UGhYeTZ1dy0tSkVKcnBXYThkWmZDRWQ3NFdHQW1kN0JtMC16TzZBRENwanB0SWpDajVJYTItenhZMUFpNVJ3eFUyZmR3Y3NIc1dOdzRDNXlXdHY0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Coinbase-Funded Reps in Congress Urge SEC to Approve Ethereum ETFs - Sludge",
        "content": "The cryptocurrency exchange is expected to be a major beneficiary if the Security and Exchange Commission approves pending applications for Ether ETFs.\n\nIn a stunning reversal, the Securities and Exchange Commission (SEC) is expected to approve applications for exchange-traded funds (ETFs) that track the price of Ether, effectively allowing investors to transact in the cryptocurrency on traditional stock exchanges.\n\nEarlier this week, Bloomberg analysts James Seyffart and Eric Balchunas increased their odds of the ETFs being approved from 25% to 75%. “Hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied),” Balchunas wrote on X .\n\nThe SEC approved Bitcoin ETFs in January, but industry observers had been growing increasingly pessimistic about the chance for Ether ETFs to be approved because the agency had not been communicating with the companies that had applied for them. SEC Chairman Gary Gensler had in the past said that he believed Ether and so-called altcoins to be unregulated securities. Ether, the second-largest cryptocurrency by market valuation, is the cryptocurrency of the Ethereum blockchain.\n\nTo help push the ETFs across the finish line, this morning five members of the U.S. House of Representatives, a mix of Republicans and Democrats, sent Gensler a letter urging him to “maintain a consistent and equitable approach” to the Bitcoin ETF applications and approve the pending Ether ETFs.\n\nThe letter was led by French Hill (R-Ark.) and signed by Tom Emmer (R-Minn.), Mike Flood (R-Neb.), Josh Gottheimer (D-N.J.), and Wiley Nickel (D-N.C.). Hill is the chairman of the Subcommittee on Digital Assets, Financial Technology and Inclusion of the House Financial Services Committee, and Emmer is the third-ranking Republican on the panel.\n\n“Specifically, the Commission should apply the same principles set forth in the approval of the spot bitcoin ETPs [exchange-traded products] as it evaluates the pending ether ETP applications as the legal considerations pertinent to bitcoin also apply to ether,” the lawmakers wrote. “With the Commission’s actions earlier this year, it seems a natural progression that would not only demonstrate consistency in the Commission’s application of its standards but would also affirm the legal reasoning that facilitated the spot bitcoin ETPs decision. We encourage the Commission to continue enabling and embracing financial innovation while ensuring the full protection of the federal securities laws for investors,”\n\nFour of the signers of the letter have been among the top six recipients in the House of campaign funding in the 2024 election cycle from employees of Coinbase, the cryptocurrency exchange that has been selected to act as a custodian for several of the proposed ether ETFs.\n\nAccording to The Information , “At least six out of the nine investment firms that plan to issue ether ETFs have picked Coinbase as a custodian, meaning the crypto company will safeguard ether for giants including BlackRock, Invesco and Franklin Templeton. Judging by the success of bitcoin ETFs, which launched in January, Coinbase could soon oversee billions of dollars worth of ether and entrench its position at the center of the crypto ETF boom.”\n\nHill has received more Coinbase money than any other House member so far this election cycle, according to OpenSecrets . Federal Election Commission records show that his campaign and leadership PAC have received a combined $35,600 from the company’s employees since the beginning of last year, including $11,600 from its CEO Brian Armstrong."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOb1o0SUR2VFFpYlJMR1RBRm1BUWJoMXM5U2hQdzkwTXBWVGpjRElGRzRBRDBDZnozdHBMc0huMDhKSzZFN2FBNFVJVm5lckMxOWdjM29PTkNPdnRQRndHRG82ZjVQcXI1cTFtYWNpSENOUEJkWDZJVkRBMXVfRXBrYThra0h3Y2dr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Crypto Roundup: Bitcoin Stays Steady, Ethereum Jumps 23%, and Furrever Token's 15X Returns Capture Attention - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 23, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market is buzzing with activity today, marked by notable developments in Bitcoin, Ethereum, and Furrever Token. As Bitcoin holds steady on Bitcoin Day, maintaining its value from yesterday, Ethereum has captured significant attention by surging 23% in just one week. Adding to the excitement, Furrever Token has caught the eye of many investors with its potential for up to 15X returns, making waves in the crypto community. These dynamic shifts highlight the ever-evolving landscape of digital currencies and the diverse opportunities they present for traders and investors alike.\n\nEthereum Surges 23% in a Week Amid Record ETF Trading Volumes\n\nEthereum (ETH) is currently trading around $3,750, nearly unchanged from yesterday but up 23% over the past week. This surge is driven by growing anticipation of spot Ethereum ETF approvals from the U.S. Securities and Exchange Commission (SEC).\n\nOn Tuesday, Ethereum futures ETFs hit a record daily trading volume of $47.75 million, a 40% increase from the previous peak in March. ProShares' Ether Strategy ETF (EETH) led the way, accounting for $43.14 million of the volume, followed by VanEck's Ethereum Strategy ETF (EFUT) with $2.6 million and Bitwise's Ethereum Strategy ETF (AETH) with $2.01 million.\n\nDespite this new record, Ethereum futures ETF trading volumes remain far below those of spot Bitcoin ETFs, which saw $2.16 billion in trading on Tuesday, dominated by BlackRock’s IBIT with $1.12 billion. Grayscale's Ethereum Trust (ETHE) also saw a significant increase, reaching $684.44 million in daily trading volume, the highest since May 2021.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart have increased the likelihood of spot Ethereum ETF approvals from 25% to 75%, citing a possible shift in the SEC’s stance on crypto regulation. This optimism has further fueled Ethereum's recent gains.\n\nAs the market awaits potential SEC approval for spot Ethereum ETFs, the increased trading activity and positive sentiment continue to bolster ETH's price, positioning it for further growth.\n\nBitcoin Holds Steady at $69,400 Amid Market Uncertainty\n\nBitcoin (BTC) is currently trading around $69,400, maintaining a stable position from yesterday but up by 5% over the past week. The slight drop in Bitcoin’s price on Wednesday came as traders cashed in on recent gains fueled by optimism over a potential spot Ether ETF approval.\n\nEther, the world's second-largest cryptocurrency, also experienced a pullback after reaching a two-month high earlier in the week. This movement was driven by reports of progress towards the approval of spot ETFs by the U.S. Securities and Exchange Commission (SEC), which is expected to make a key decision later this week.\n\nStory continues\n\nDespite the optimism surrounding the spot Ether ETF, broader market sentiment remains cautious due to ongoing concerns about U.S. interest rates. Persistent inflation and warnings from several Federal Reserve officials about the need for more evidence of decreasing inflation before rate cuts can begin have kept traders wary.\n\nAttention is now focused on the minutes from the Fed's late-April meeting, which could provide further insights into the central bank’s plans regarding interest rates. High interest rates generally have a negative impact on crypto markets, as they reduce the attractiveness of high-risk and speculative assets like cryptocurrencies.\n\nThe cautious sentiment in the market underscores the delicate balance between optimism over potential regulatory approvals and concerns over macroeconomic factors affecting the crypto landscape. As traders await further cues from the Fed, Bitcoin's price stability reflects the broader uncertainty in the market.\n\nFurrever Token's 15X Return Promise Attracts a Wave of Investors\n\nFurrever Token (FURR) has captured the crypto community's attention with its promise of up to 15X returns for presale investors after its official launch. This enticing potential has sparked a significant influx of investors eager to capitalize on the opportunity before the presale concludes.\n\nThe Furrever Token presale has been a roaring success, with over $1.1 million raised in just three months. Currently in stage 8 of its 10-stage presale, Furrever Token aims to raise a total of $1.9 million. The current token price is $0.000648, and investors can purchase FURR exclusively from the official website, furrevertoken.com.\n\nFurrever Token's mission is to create a fun and heart-warming crypto ecosystem centered around adorable cat imagery. The project integrates cute cat-themed stickers, emojis, and visuals, fostering a warm and friendly community. This unique approach has resonated with many investors, contributing to its organic growth and engaged community of nearly 4,000 members on Telegram.\n\nThe legitimacy of Furrever Token is bolstered by a smart contract audited by Securi Lab, no buy/sell tax, and a team committed to locking their tokens for a year. These measures reassure investors of the project's long-term viability and security.\n\nWith the presale nearing its end, now is the perfect time to invest in Furrever Token. The potential for significant returns, combined with the project's innovative and community-focused approach, makes FURR an attractive investment opportunity. Don’t miss out on the chance to be part of this exciting journey. Visit furrevertoken.com to invest in Furrever Token before the presale ends and join a community that celebrates the lighter side of crypto.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nJoin $20,000 Furrever Token Giveaway\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNdnNwOXFLSkVMQ0FrZ3g2ekFjQXVseTFCbTZhZGZqRHV3cU9kVjVmeUZUTzBQcWNGcDJPN2Y4RGxxdHltQVk4YmMzOENIeXg0aDR2NEJCV1ZhcWNqSDMyNEwtU21JaDNBN0RuYUVsNncyZ0o0aFc0VllLZDlXT1JPcG5HcGpaSV90TVZRZWZyTlFKWS1lV3hTbkRnQTNBNTJjMmhIa0lLSTR1QUhyMmNZdm5OcEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation considering formal conflict of interest policy after community backlash - CryptoSlate",
        "content": "Ethereum Foundation (EF) is considering implementing a formal conflict of interest policy following backlash over two prominent developers joining EigenLayer as advisors.\n\nExecutive director Aya Miyaguchi addressed the issue in a social media post, emphasizing the importance of maintaining credible neutrality within the organization. She said the foundation shares the community’s concerns and is committed to maintaining trust.\n\nMiyaguchi said:\n\n“It is clear that relying on culture and individual judgment has not been sufficient, and we have been working on a formal policy to address this problem for a while now. We will be accelerating this work and will share an update soon.”\n\nControversy\n\nThe controversy began on May 18 when prominent crypto trader Jordan Fish, known as Cobie, publicly questioned Ethereum co-founder Vitalik Buterin about the ethics of EF developers receiving significant financial incentives from projects built on the network.\n\nCobie’s tweet specifically used EigenLayer as an example and sparked widespread discussion on social media about potential conflicts of interest. He wrote:\n\n“How do you feel about Ethereum Foundation core developers or researchers taking life-changing packages from projects built on Ethereum to become ‘advisors,’ when those projects may have conflicted incentives with Ethereum, either now or in the future? For example — purely theoretically, of course — let’s say, EigenLayer.”\n\nFollowing Cobie’s tweet, Ethereum Foundation researcher Justin Drake disclosed his advisory role at EigenLayer on May 19. Drake revealed that he received a substantial incentive in Eigen tokens, estimated to be worth millions of dollars over a three-year vesting period.\n\nThe disclosure heightened concerns about transparency and potential conflicts of interest between EigenLayer and the Ethereum Foundation. Drake also stated that the information had been public since May 3, and the timing of the disclosure with Cobie’s tweet was a coincidence.\n\nOn May 21, another Ethereum Foundation researcher, Dankrad Feist, also disclosed his advisory role at EigenLayer. Feist, known for his work on “danksharding,” confirmed he had also received a significant allocation of EIGEN tokens and assured the community that his advisory role would not influence his positions on the development of EigenLayer.\n\nConflict of interest concerns\n\nThe disclosures have raised questions about potential conflicts of interest, especially given the systemic risks EigenLayer might pose to Ethereum. EigenLayer is a platform that allows users to deposit and “re-stake” Ether from various liquid staking tokens to secure third-party networks or validated services.\n\nMany blockchain experts have expressed concerns about the potential centralization and additional load imposed on stakers by running restaking services.\n\nDrake assured the community that he would reinvest or donate all proceeds to worthy projects within the Ethereum ecosystem and pledged to end the advisorship if EigenLayer’s direction conflicted with Ethereum’s interests.\n\nFeist, in his disclosure, emphasized that he would take contrarian views on EigenLayer to focus on risks and decentralization. He wrote:\n\n“I am taking this position personally, not representing the Ethereum Foundation, and with a focus on risks and decentralization. I do receive a significant amount of tokens from this position. I do not believe that they will change or influence my positions on how the core protocol should be developed, but I believe that the community should know about this so that they can keep me accountable.”\n\nThe Ethereum Foundation’s move to formalize a conflict of interest policy marks a significant step in addressing the community’s concerns and maintaining trust within the ecosystem. The foundation is expected to provide further updates on the policy soon."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOanFCZEtYTi1wbGY2cE4zN1FGdG5qSGdKSnd6SWdEVm5NZTh4UDE3U2ZGVjc5YU5QZFNCODB4bGZ6Y3FxWFV2M1JSUlhEaUFfeXphOVBKOHhXcFBadzk1MkRmY09hdUF2T19KTXNFRG9aTmEzU1lmS0ZUci1nVndiR1JRaUtsNGZnNWVNVnVhdlIwZGtvbzV4WTA2NU91VlB2aWg4anJaWUtuNTc5YjN6ZEIybVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "With Ethereum ETFs Approved, Why Is ETH Not Going Up? - Benzinga",
        "content": "Ethereum ETH/USD enthusiasts were left scratching their heads this week after the long-awaited approval of a spot Ethereum ETF failed to ignite the anticipated price surge.\n\nWhat Happened: While many expected a repeat of Bitcoin‘s BTC/USD rise following similar ETF approval in January, ETH prices have remained relatively flat.\n\nThe SEC’s approval of the 19b-4 forms is a crucial step in the regulatory process but does not fully clear the path for ETF trading.\n\nThe S-1 registration statements, which provide detailed information about the ETFs to the SEC, must still be approved for trading to commence.\n\nThis approval is often seen as a formality, but the current political climate has added uncertainty.\n\nHowever, new information suggests the approval process might not be as straightforward as initially believed.\n\nGabriel Shapiro, co-founder of MetaLeX Labs, explains that only the 19b-4 forms were approved, not the S-1 registration statements.\n\nThis limited approval was made by the SEC’s Division of Trading and Markets under “delegated authority,” allowing any commissioner to challenge the decision within ten days.\n\nShapiro suggests this procedural move indicates an attempt to obscure the political nature of the vote.\n\nShapiro hints at a broader political strategy, suggesting the SEC’s actions are part of a “horse trade” to secure environmental, social, and governance (ESG) rules before a potential challenge by Donald Trump if he wins the 2024 election.\n\nThis complex backdrop contributes to the uncertainty surrounding the approval of the S-1 forms, which Shapiro believes are unlikely to be approved soon.\n\nHe describes the situation as “political progress” for crypto, similar to the Financial Innovation and Technology (FIT) Act.\n\nAlso Read: EXCLUSIVE: All You Need To Know About The FIT21 ‘Crypto Bill’\n\nMarket Reactions\n\nEric Balchunas, Senior ETF Analyst at Bloomberg, offers a counterpoint, expressing confidence that the S-1 forms will eventually be approved and downplaying the likelihood of significant challenges.\n\nHe attributes the lack of a price spike to the fact that the ETF approval was already anticipated by the market following earlier news.\n\n“S-1s will be approved, don't be silly… It prob didn't moon IMO bc approval was baked in already based on Monday's bombshell news,” Balchunas tweeted.\n\nScott Johnsson of Van Buren Capital questions the SEC’s strategy, arguing that using crypto regulations as leverage for ESG rules undermines the commission’s credibility and political strategy, especially if they fail to achieve their ESG objectives.\n\n“This is tough to square…they don’t get ESG rules and also lose all credibility that they actually intend to govern reasonably in a Biden second term,” Johnsson stated.\n\nStaking and Market Dynamics\n\nPranav Kanade, Investment Partner at VanEck‘s Digital Assets Alpha Fund, highlighted another crucial factor: the nature of ETH staking in the approved ETFs.\n\n“The ETH ETFs approved on May 23rd do not currently include staking, and all of the ETH held in these ETFs will remain unstaked. However, even if this were to change (via new staked ETH ETFs), the risk of staking concentration would be largely mitigated by three factors,” Kanade explained.\n\nHe pointed out that regulatory and compliance requirements would likely prevent U.S. ETF issuers from staking with dominant players like Lido.\n\nAdditionally, emerging staking protocols are already reducing Lido’s market share, and Lido itself is diversifying its node operators, minimizing concentration risks.\n\nLooking Forward\n\nThese developments highlight the intricate interplay between regulatory actions and political considerations affecting Ethereum’s market dynamics.\n\nInvestors remain cautious as they await further clarity on the full approval process.\n\nFor a deeper dive into the implications of these regulatory shifts and the future of digital assets, industry leaders and investors can join Benzinga’s Future of Digital Assets event on Nov. 19.\n\nThis event will provide valuable insights into the evolving regulatory landscape and investment strategies within the digital asset space.\n\nRead Next: Bitcoin Spot ETFs Record $108M Inflows While Ethereum ETF Potential Remains Uncertain\n\nImage: Shutterstock"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPVkszSzJJbHRsdklCVDF6YjZUQWowc21Oc29UbzJYSzhfdWdpVjZTckpuN29MQy1ab3BvYVYwSV9MMXZHcmdWM3VzX0s1U01waWhaRUNTZ3JBcW14eUUwWEowMXFPUC1Fdm1WMUVpRm45RUlrQzhiMlNUWlJPRTdEcS1UaUNSZlNySkc5VHc2YklPSVNDZmR6NTVQN2JXdmVZWTBGWVZPVUlDbTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval fails to ignite crypto market, sparking $400 million in losses - CryptoSlate",
        "content": "The broader crypto market experienced significant volatility during the past day as the US Securities and Exchange Commission approved several spot-based Ethereum exchange-traded funds (ETFs).\n\nCryptoSlate data shows that the top 20 digital assets by market capitalization, excluding stablecoins like Tether’s USDT and Circle’s USDC, saw losses exceeding 3% each. Bitcoin and Ethereum, the top two digital assets by market capitalization, fell to $67,051 and $3,671, respectively.\n\nSeveral market analysts have suggested that the ETH ETF approval was a “sell-the-news” event. Investors who anticipated the approval had already positioned themselves accordingly. During the past week, ETH’s price had risen by more than 20%, with CryptoSlate observing that the Ethereum futures market hit a one-year high of 3.6 million ETH.\n\nJulio Moreno, head of research at CryptoQuant, noted:\n\n“Seems like the market has already priced the Ethereum spot ETF approval. Grayscale’s ETHE discount to ETH has significantly narrowed in the last few days. The same happened between GBTC and Bitcoin as the Bitcoin Spot ETF approval was nearing.”\n\nSome experts also pointed to the ETFs’ delayed launch as one of the reasons for the muted market performance. The SEC has only approved the ETFs and has yet to grant them the clearance to launch, which requires an approved S-1 filing, though this is more of a formality.\n\nBloomberg’s ETF analyst James Seyffart explained:\n\n“This is just 19b-4 approval. Also needs to be an approval on the S-1 documents which is going to take time. We’re expecting it to take a couple weeks but could take longer.”\n\nOver $400 million liquidated\n\nOver 107,000 crypto traders suffered losses exceeding $400 million due to the market’s subdued performance.\n\nCoinglass data reveals that ETH long traders, who expected the ETF news to boost the digital asset price, bore the brunt of these losses, totaling around $107 million. The largest single liquidation was a $12.4 million long bet on Ethereum on the Binance exchange.\n\nMeanwhile, Bitcoin traders lost approximately $75 million during the same period.\n\nMentioned in this article"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNbk54cmh3ZmtEYklTT1g4LUcyUllWVmRzLUtZa2hVR1dydlFwX01jZ1FIVDJmbDg1TkdQemE0N2wtMzVYZmFKcV9GTjQ0NzUzdjc0cDFpVWpLaGNKTkM4UkRNM3pvQU9NWGRqMHJsYlZoVWNjNlBXcXI4ZFdxSGhFbzR5Qm9iN2E3cDRpLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Bipartisan push for Ethereum ETF gains momentum in Congress - CryptoSlate",
        "content": "A bipartisan group of US lawmakers advised the Securities and Exchange Commission (SEC) in a May 22 letter to approve spot Ethereum exchange-traded funds (ETFs).\n\nThe letter signatories included Financial Committee Vice Chairman Rep. French Hill, House Majority Whip Tom Emmer, and Representatives Josh Gottheimer, Mike Flood, and Wiley Nickel.\n\nEthereum ETF\n\nIn the letter addressed to SEC Chair Gary Gensler, the lawmakers urged the regulator to apply the same principles it used for spot Bitcoin ETFs to Ethereum ETF applications. They argued that this would demonstrate regulatory consistency.\n\nThe letter noted that the launch of Bitcoin ETPs provided a regulated and transparent investment vehicle for American investors. It also highlighted the SEC’s commitment to investor protection and acceptance of modern financial markets — arguing that approving an Ethereum ETF would reinforce this commitment.\n\nThe lawmakers added:\n\n“With the Commission’s actions earlier this year, it seems a natural progression that would not only demonstrate consistency in the Commission’s application of its standards but would also affirm the legal reasoning that facilitated the spot Bitcoin ETPs decision.”\n\nThe legislators also stated that the SEC’s market surveillance and enforcement measures would mitigate concerns about market manipulation and that transparency and reporting requirements would enable investors to make informed decisions.\n\nThe support for Ethereum ETFs comes amid a shifting regulatory landscape for crypto in the US. Recently, the industry has been at the center of conversations and debates, leading to the passage of bills to create regulatory clarity for the emerging industry.\n\n‘Stay tuned’\n\nThe SEC Chair hinted that a decision on the pending ETH ETF applications is imminent, advising market observers to “stay tuned.”\n\nSeveral industry experts anticipate the approval of these financial instruments later today, on May 23.\n\nAfter weeks of minimal engagement, the SEC recently asked exchanges supporting the ETF applications to refile their 19b-4 forms with standardized language. Additionally, the SEC seems to be engaging directly with potential issuers, as companies like Grayscale have filed updated S-1 forms this week.\n\nMentioned in this article"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOS0ZoLXIwOGFTd2gybGxUYXl5LUwzdWx5elUwMk9ZM3FyR0pyMlhVX3F5Y0FoQmVCR2pQWEp4cHE5Qm5BT2xGdElta1RIdE5oUGpMb3UtZEhoMHlTU1d2NmxURmozeXd0QUxwVS1FandGUjJwSlMwODliTEZ4X2x6T0xhbkNHanE2eHdB0gGTAUFVX3lxTE1pcnc5d2hMWFNTVkp3ZU1FbFNrQk94VF8zTUsydDR4cVRrbGZ0NnhubWh4SXhoa3FBeHA2RVUzeFNxR0ZReFhEc1RBdVFiT2U0SE5IM0ZpYTNhWjcxbnZrTVNhelRwQVR4Q3g1WThyc1RqSk1wbW9OeFdfbUR2MnJGd3pYMXZLSjB5YWNmY0lTY1kxOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "River Protocol Takes on Slack, Discord With Messaging Apps on Ethereum L2 Base - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWith big tech companies like Google and Meta pumping potentially unwanted AI features into their messaging platforms, there is a growing call for decentralized and encrypted alternatives that don't rely on the centralized heavyweights.\n\nOne company that aims to provide this service is Here Not There Labs, creator of the Towns social app and the newly launched River Protocol. River aims to offer an alternative to chat platforms like Slack and Discord, powered by blockchain tech and both customizable and private for creators.\n\n“You see a lot of social media products that are decentralized, but you don’t see a lot of social media protocols,” Here Not There Labs co-founder and CEO Ben Rubin told Decrypt. “I do not know of a social media [app] that is owned and operated by the participants of its network that have a means to create trust between one another in a way that is permissionless.”\n\nCreated in 2023, River Protocol is designed to allow developers to build decentralized, real-time messaging applications using an Ethereum Virtual Machine (EVM) compatible layer-2 blockchain, off-chain nodes, and smart contracts on Ethereum scaling network Base.\n\nAD\n\nAD\n\nA screenshot from Towns, which is built on River Protocol. Image: Here Not There Labs\n\nAccording to the River Protocol website, the project is governed by the River Association, a decentralized autonomous organization or DAO, that allows RVR token holders to participate in the protocol’s future.\n\nRiver Protocol joins a growing number of decentralized applications offering secure communications and social media including Farcaster, BlueSky, Nostr, and Blockscan Chat. But while many social media protocols are aiming to take on Twitter, River Protocol is more focused on teams, companies, and projects who need their own dedicated server.\n\n“Each group is represented as a space, and each space is its own smart contract that is being deployed on-chain,” Rubin said. “What the smart contract does is allow the group to issue membership into the space, and also program the entitlement of who can read and write, and under what conditions.\"\n\nAccording to Rubin, this type of setup works best for large groups with specific roles assigned to members like moderators, or who need to set restricted access to channels in the group.\n\nAD\n\nAD\n\nRiver stores content off-chain and uses on-chain roll-ups. A bespoke appchain handles messaging to maintain speeds to provide a similar experience to Telegram or WhatsApp. This separation, Rubin added, ensures robust security for permissions while optimizing messaging to be fast and user-friendly—yet maintains user control and decentralization.\n\n“While our main deployment is on-chain, you can read on [Ethereum] mainnet, Polygon, or across any other chains to compose rules together,” Here Not There Labs co-founder and CTO Brian Meek added. “All of that creates a trust route for the messaging, which is happening in the River protocol. But you can cryptographically verify that what is in the River protocol is what is allowed based on what's on-chain.”\n\nOther potential user cases for River Protocol besides messaging apps, Meek added, include connecting players of decentralized video games.\n\n“Everything benefits from communication,” he said. “You can compose their protocol together into your game, into your app, or into whatever other decentralized experiences you have, and bring in a real-time provable, verifiable, end-to-end encrypted communication experience.”\n\nAdditional reporting by Sander Lutz.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOdHlVMU5xTmdSM3k4ZVNjMTJnQ0k3QjJSd1ZrS0VILWZoVGNscW55Y2gyY0RQdDFmTjdQX1U4cjRIUXZuRU9VdUI4a3Zjb3UyQVNyazM1SHdlUHprNkxpdk9qXzBuZXFrM0c2MnlOYzRFMENPTGFvZHU1MVRENkl4UTltT3A3VEN6Vi12a0RWeDFJR1NfOXVXanNLTdIBowFBVV95cUxOLWdfeGhYc1hPMENaeWZGRUtMUmk3UG5lRm5KRExOVEhyUFk1TFlBWDR2SkRyYV9KTi1GbGF3b211d0E0YnhLSDFzdXVudG4zQU10X3FQTi1MOU0tb0xXbFBMY1JFVDNib1VNSnZnZmNGajRIWldLUlZ5Z3E3dFNQanJzbFJtS3JhQl9LMHhybTRGMFBocDlZNmtlWEJITjFCa053?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Is Likely Say Sources Close to SEC: Report - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt's Ethereum ETF deadline day for the Securities and Exchange Commission. Now sources close to the SEC are saying the regulator has shown signs of warming to the idea of allowing spot Ethereum ETFs to trade.\n\nUnnamed sources told Fox Business that the commission has been taking cues from recent court rulings and its past decision to allow ETH futures ETFs to trade as it considers whether to grant permission for nine funds to begin trading.\n\nMost pressing for the SEC is making a decision on the filings from Cboe exchange to list the VanEck Ethereum ETF and the Ark 21Shares Ethereum ETF.\n\nBut that's not all. Counting VanEck and Ark Invest with 21Shares, there are nine total applicants. The rest include BlackRock, Fidelity, Grayscale—which wants to convert its Grayscale Ethereum Trust (ETHE) the way it did its Grayscale Bitcoin Trust (GBTC)—Hashdex, Franklin Templeton, Invesco with Galaxy Digital, and Bitwise.\n\nAD\n\nAD\n\nAt the time of writing, the Ethereum price is north of $3,800—that's 2% higher than it was this time yesterday.\n\nTrading volume swelled to $45 billion in the past 24 hours as hype for a potential Ethereum ETF has surged. For reference, that's just $4 billion shy of the amount of Bitcoin that changed hands in the past day, according to Coinglass.\n\nWhat's more, Ethereum open interest has grown by another 4% to $16 billion. That's also come with some bad news for Ethereum derivatives traders. In the past day $43 million worth of Ethereum futures positions have been liquidated, which is nearly double the value of Bitcoin futures positions liquidated in the past 24 hours, according to Coinglass.\n\nMeanwhile, Gensler faced tough questions in a letter from the House Financial Services Committee yesterday.\n\nAD\n\nAD\n\nRepublican lawmakers, including HFSC Chairman Patrick McHenry (R-SC), were curious about the regulator having recently given digital asset firm Prometheum the green light to begin offering an Ethereum custody service.\n\nThe fact that Prometheum is an SEC-regulated firm and got permission from the commission to offer the service seems to imply that the commission is treating ETH like a security—even though it has countless times refused to share its position on the matter.\n\nAs a footnote: An unredacted version of the Consensys lawsuit against the SEC over its treatment of Ethereum says that an internal memo circulated last year instructed commission staff to treat ETH like a security."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPTm5PandKWGxSWGs1Vi1XWmZtMzI0RjJ6UkFaaGtLX090dF92VHQ4V1E5Q1FHM3lzY2oxV3FleXI3QW9uTDF5bWYwVzFGZzBoUjc3aTk0M0E5bVdjWWlXY0JFd0lpcFVGb1dIVlJqc1RDV3VZbi1RbXBNdk5MOXVadVduSGY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "VanEck's Ethereum ETF Ticker “ETHV” Listed on Clearing Firm DTCC’s Website - Yahoo Finance",
        "content": "VanEck's Ethereum ETF Ticker “ETHV” Listed on Clearing Firm DTCC’s Website\n\nThe Depository Trust and Clearing Corporation (DTCC) has listed global investment manager VanEck's spot Ethereum exchange-traded fund (ETF) under the ticker symbol \"ETHV.\" The DTCC, a prominent American financial market infrastructure provider, offers services such as clearing, settlement, and transaction reporting to participants in the financial markets. This listing is considered a crucial milestone before obtaining final approval from the United States Securities and Exchange Commission (SEC).\n\nAlthough VanEck's ETF is currently listed as inactive on the DTCC website, indicating that it cannot be processed until it receives regulatory approvals, it is worth noting that it is not the first Ethereum ETF to be listed by the DTCC. Franklin Templeton's spot Ethereum ETF secured a listing on the platform a month ago.\n\nThe DTCC's ETF list comprises both active ETFs that can be processed and ETFs that are currently inactive and awaiting regulatory clearance. Additionally, reports suggest that SEC officials have reached out to major exchanges like Nasdaq, the Chicago Board Options Exchange, and the New York Stock Exchange to update and modify existing applications for spot Ether ETFs.\n\nThe final deadline for the SEC's decision on VanEck's spot Ether ETF application is May 23. The SEC's request for financial managers to amend and resubmit their 19b-4 filings for proposed spot Ether ETFs was seen as a positive sign by some analysts, increasing the potential likelihood of approval from 25% to 75%"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9GNVU5NF9zMXEydy1SVHRVTG1PYXpOLV9nQU9yM2xQTHhlQ1pBYUgxdGZTQWs1SnlpVkdDREFnQmF5ZjFqSXd1ZUptR1NzNmg5WWotS01aMHRzUG9xNURxa2FDb0VMeUs0UDA0TnFxNNIBd0FVX3lxTE1HTEZIU1lpTDNEclZEZFFQN0U0YUthc2xvc3E4MzhsV1I2WE5YbmsxeWlsQkpUM0tjNW1weHMxNFNib2E4RlFja0pfQ1R4WHQ5WHd6M19jblQ3R2FQd29ZT2Y0VmNTMjhPa2tsdWw0ckpTNENfaUhz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Could Lead to 'Serious' Security Risks, Say Experts - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nExperts are warning of the looming threat that the newly approved U.S. spot Ethereum ETFs could pose if staking is ever introduced.\n\nIn a crucial bid to push the approval process over the line, Ethereum ETF issuers dropped language regarding the staking of customer ETH.\n\nWhen the network transitioned to a proof of stake consensus in September 2022, it required ETH to be locked up in a process called staking. The staked ETH belongs to validators who help to secure the network. They’re rewarded for staking their ETH, but can be penalized if they don’t verify transactions on time.\n\nCentralization concerns have arisen in the past when single validators gained control of large portions of staked ETH. At time, people have even compared liquid staking provider Lido to a \"cartel\" when it swelled in size.\n\nAD\n\nAD\n\n“Removing staking language from ETH ETF applications was a move to appease the SEC. But this short-term solution could cause a long-term problem.” Ganesh Swami, CEO and co-founder of blockchain data analytics company Covalent, told Decrypt, “If multiple ETFs use the same custodians, this type of centralization would cause concentration to increase, exposing the network to operational risks such as malicious collusion.”\n\nTaking a look at the U.S. spot Bitcoin ETFs, we can see that Coinbase is the custodian for 90% of the total assets. While this poses an obvious centralization risk already, adding staking to the equation, well, ups the stakes.\n\n“Staking ETH ETFs are not a new concept, they exist in other countries, but clearly the U.S market brings a much larger scale,” Andrew O’Neill, analytical lead on digital assets at S&P Global, told Decrypt. “The risk in that case is that if ETFs are concentrating their stake with a small number of custodians, this could create validator concentration risks in the consensus mechanism.”\n\nCoinbase, which is already the second largest Ethereum validator, is currently set to be the custodian of at least six out of the nine firms planning to launch an Ethereum ETF. If we see similar interest as we did with the U.S. spot Bitcoin ETFs, which as a group currently have a market capitalization of $54 billion, this concentration of power could pose a security risk.\n\nAD\n\nAD\n\n“You can measure concentration risk by the number of nodes a single entity would need to control the chain. The lower that number, the higher the central point of failure.” Mona El Isa, CEO and co-founder of institutional DeFi company Avantgarde Finance, told Decrypt, “If any party amassed that much control, they could potentially alter the state of the blockchain itself. That poses serious risks to security.”\n\nIt appears that staking was removed from Ethereum ETF applications due to the SEC’s view that staking is equivalent to a securities service. It’s not without precedence. The SEC has sued companies, like Kraken and Coinbase, to stop them offering staking services to U.S. customers.\n\nAs staking is currently not allowed for ETF providers or custodians, there are no guidelines put in place to reduce the potential centralization and concentration risks that could be looming.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOZWhqX05qdFJCa29JVERLOG82X3R0bFB6eWVHME9lcU9Qam5EYnBjVjY5aWpjb1N2eWtLVFpMMmZISjBqVXRJVzNWRW9GVy1lVkpEM2pzVWVBeldxZVRzdzBYc2N2eDhFb3pwY3lhVmhzQ3NBRlZHbDFRcEQ1QzNFbUtkN0Q4TVpqclRKbmFkby1ISjROTFYwX3packFhU2NFeWx4dEtyb0kwWXJvVU5BdVJlNFJsdVIzMmt2bnBHR21zeHVQc0RkVNIBzgFBVV95cUxQd0tyUzJKemVDcV82Q0xfcTZYRFZ6Rl84WWpGNnY5TU14U3VMTzJRWlIxWUJzZEFIQmpXOGdXemJEYVRJZlo1M2ozM0YybzdNTGRXa3ZsZUhfd3luM0RnUzkzN1RCbkFVUElDdVl6UXFBVm5NZ0pvblczRURQTEQzUHVHR3kzQzdMUjJOR2FTNVAyMkJmZnpVamJHM0FZWVgyM3ljTV9acXJRRGFyU04tcm9vaGVVWG5DZEVMTXFoaFMyQWc0c25IelB6cU5ZUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum To Hit All-Time Highs ‘Very Very Soon’ Should ETF Be Approved, Says Economist Alex Krüger - The Daily Hodl",
        "content": "Closely followed economist Alex Krüger believes approval of a spot Ethereum (ETH) exchange-traded fund (ETF) could quickly send the top altcoin to new all-time highs (ATHs).\n\nIn a new Unchained “Bits + Bips” podcast, Krüger says the market has yet to price in a spot ETH ETF approval.\n\nHe predicts an approval will send Ethereum soaring against Bitcoin (ETH/BTC) to at least .070 BTC ($4,865) within months.\n\n“If the ETF gets approved, which seems like it’s likely now, it’s kind of clear that with an ETF approval, we’re going to see all-time highs very, very soon. Because the market is not positioned for it. You were saying 25%. I would even think that the market had priced in almost like 0% probability or as close as it gets to no chance whatsoever.\n\nETH has been one of the most hated coins, if not the most hated coin of this cycle, and it’s reflected on price. ETH/BTC is like .052 BTC. So it does make sense for that to go all the way up to at least .070 BTC ($4,865) in the next couple of months. These things happen usually rather fast.”\n\nKrüger also believes there are institutions that would move to invest in an ETH ETF product.\n\n“I think there’s a lot of demand out there.”\n\nETH/BTC is trading for 0.05362 BTC ($3,731) at time of writing. ETH reached an all-time high of about $4,900 in November 2021.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPNFZFV05LTm16bF9mTnVYMjNGN2RDeF9ScU5Bd0FSVWczcGc2em9HWXJfMkpHZUl4R2JGMTNRX1ROV0luanprbkhxc185dTRCa3BpcnMxZ3ItbWN0Z3Z6SGZDRGdNTWFVR3FJRk16MW1CTURhMzNoY1hGN0d5RGZHRmJlcVU4R016X2ViTzZfUk1OMmZxZVBLVzlaZ9IBoAFBVV95cUxQakt2THJBMUhFVGRPd0tadVJPaUQ0NEExSEhYR2RrRExHNlI3bFFIaFVDM2NoZ0NuejNLdFE2akliZUZVQ1IwWEoxSDhCbW5lcEo1NUFaYlhFeFZhWmpGTlFrQVBxQTdFRlY3ZG1kSHVacmwwR1VFdEZrR2cxRnVDUjUtWWYwcmdKMFNla2JTa2pLeE5SN2lxNVFYLWtRaHF5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "3 Questions About the SEC’s Abrupt ETH ETF Approval - CoinDesk",
        "content": "Well first off, the launch of spot ETH funds means that there may soon be a lot more institutional interest in the second largest cryptocurrency. Not only did the move act as a sort of stamp of approval, it will also create a familiar on-ramp for buying the asset for anyone from mom and pop investors looking to diversify their 401(k)s to hedge funds, much in the same way ETFs did for bitcoin."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNdDN0dTAtWHpLRzRyekE5ajh5QmNGSDZsWTZ3Q1lES212M3ZEbzE3bFJ2OFM5T29tYk5PR1FiVDduNlRNUTgtWFROZFpabXVVUUYxN3VhYnZyQjdCUlFZU21kX3FpUF9QMXBtRG55YUxFU0JyTWY0OXRQQ0Q2N0trStIBiAFBVV95cUxOZnppQzE4NFJOZ1ZLUXpwZUh0WHhITTRqWVY2dk9yRTBIbHBJaEtaWmd0N1A4dGU0MXU5ZVBod0tMSmZyMEJzcFpzUkVjU3RUZXRxX1VxWldMajdEM05TX1h2OHVxaEF5elFGNzZFU1k2MzMtbWxYY3hINTc1bDRaR3ZFNGtvQUNU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "What Ethereum ETF Approvals Would Mean for US Crypto Policy - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhen the U.S. Securities and Exchange Commission (SEC) indicated earlier this week that it was suddenly open to the prospect of approving spot Ethereum ETFs, after months of stubborn signals to the contrary, the about-face didn’t just catch Crypto Twitter by surprise.\n\nIt also shocked the nation’s top crypto lobbyists, who spend their days tracing minuscule shifts in Washington’s mood on the industry.\n\n“It is a remarkable pivot,” Kristin Smith, CEO of the Blockchain Association, a prominent crypto lobbying group, told Decrypt. “It is one that I did not foresee.”\n\nHow did the pivot come to pass? And after years of relentless hostility against the crypto industry, might the development indicate that the SEC, and the U.S. government more broadly, are changing their tune on crypto?\n\nAD\n\nAD\n\n“I think we've absolutely turned a corner,” Smith said. “It marks a complete shift in understanding about the political importance of crypto.”\n\nCrypto industry lobbyists who spoke with Decrypt attribute the SEC’s sudden tack to a recent change of political winds in the nation’s capital. Most agree the series of events that prompted the change kicked off last week, when President Joe Biden issued a forceful threat to veto a pro-crypto bill.\n\nThe bill, which sought to repeal an SEC rule dubbed SAB 121—which discourages American banks from holding crypto—later passed in the Senate with a surprising amount of support from Biden’s own party. Twelve Democrats supported the bill, including Chuck Schumer, the Senate Majority Leader.\n\nThat degree of Democratic support was not anticipated on Capitol Hill. And it undoubtedly sent a message to the White House, the Blockchain Association’s Smith believes.\n\nAD\n\nAD\n\n“To have that many [Democrats] break away from the Biden Administration after it already put out a veto threat on it,” she said, “that is significant.”\n\nExacerbating matters is the fact that, in recent weeks, Republicans including former president Donald Trump have begun embracing crypto more explicitly than ever before—creating the impression among crypto industry leaders that only one political party is on their side.\n\nCody Carbone, Chief Policy Officer at the Chamber of Digital Commerce, another crypto lobbying group, believes the pressure recently applied by Republicans on crypto, in tandem with the open dissent Biden is now facing on the subject from leaders within his own party, led the president to make a calculated decision to back off crypto—at least for now.\n\n“The Administration is seeing, in a very tight election that can be swung by a few million votes, that this is not the hill to die on,” Carbone told Decrypt.\n\nThat evolution in Biden’s thinking could already be seen Wednesday, when the president issued a statement regarding another crypto-related bill up for a vote this week—FIT21—which seeks to create a federal framework for regulating crypto. While Biden objected to the bill’s passage, he crucially did not threaten to veto it, as he did last week with the repeal of SAB 121.\n\nOn Wednesday afternoon, FIT21 easily passed a vote in the House, 279-136, with support from 71 Democrats including former Speaker of the House Nancy Pelosi.\n\nJi Kim, chief legal and policy officer at lobbying group Crypto Council for Innovation, sees the events of the last week as proof that crypto has now—albeit suddenly— graduated into a topic of consensus within U.S. politics.\n\n“What this all means is that crypto is absolutely a bipartisan issue,\" he said, \"and that members of Congress are further realizing crypto is absolutely here to stay.\"\n\nAD\n\nAD\n\nFor the same reasons the White House is now tacking on crypto to save face, the SEC is too, crypto lobbyists say—especially given that the unexpectedly popular, bipartisan repeal of SAB 121 singled out the policies of SEC Chair Gary Gensler.\n\nRubber-stamping spot Ethereum ETFs—which would allow Wall Street firms to buy and store ETH on behalf of their clients—might prove the most visible way for Gensler to take some heat off his back, the Blockchain Association’s Kristin Smith estimates.\n\n“I think this is his sort of peace offering, to show that he is open to this space, and he realizes now that the political winds are against him,” she said.\n\nBut crypto lobbyists disagree on what the move would mean for the SEC’s long-term crypto policy moving forward.\n\nSmith is optimistic the change of heart would mark a major shift in how Gensler and the SEC might police crypto from now on.\n\n“I think he's going to have no choice but to back down,” she said of the SEC Chair. “That doesn't mean he goes back and undoes all the actions that he's initiated—but he's going to have to think twice before doing something aggressive against the crypto industry.”\n\nThe Chamber of Digital Commerce’s Cody Carbone, however, has a less cheery outlook. He figures spot Ethereum ETF approvals would represent nothing more than a cold and calculated political maneuver on Gensler’s part. A meaningful change in the SEC’s outlook on crypto? Far from it.\n\n“I don't think you're going to see him dropping any of these cases or stop fighting,” Carbone said of Gensler. “I just don't think you'll see any more headlines. Most of his decisions are driven by PR.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNNkFoSGxWWXFacmh0Q2FrOUVJd2JvcHQ5OTJtNGl6eUtzN0V2U19EMV8tLVM3cEdEY0JsQlJSUTB2TEdvTXNtalJSVktiY2xBR1BqWGhXQlE2OHdRRlh5S2k5TklVMjNkdC1odkw0Z2t3OHFDejExTHIyR0xjRFhIa29BWmVOZ3Mzb285TTF0SEprUTc5cnRIdjh5TEh0dF9Dc3JhYWdici14eHBvVzUtbGJELXBwMi02by1vTUtTQXZtc3I5WG5IeUZkQWFpZ9IB0wFBVV95cUxQVVhKcWRFc0Vvd0ZrZml0ckwwMi1GaFEzZjFiMEdPSVFOb2w0Z256NUlBdEFucG1MMk9qR25ieVJ6U2UwTDk4NUQyQXBDUC1UVnZRWlp0WGZTM190Sm1iWGw1dVRYMnZLZzI1V1hTQ2k1WEs1cUk4TTRMMHlGeGNiWUplWWtmdTR0WWo3MWxiYVBfZ0ZRVEVyTmR4ZGF4R0xVako0VTNsV2k4aTdNZGt3ODN6T1ZEek1SVThlQ0p4d3ZkbS1STWlCQW1za0JOYWFqZk1v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Top Ethereum Challenger Could Skyrocket by Over 2x, According to Crypto Analyst Michaël van de Poppe - The Daily Hodl",
        "content": "A widely followed crypto analyst believes one Ethereum (ETH) competitor could more than double in price.\n\nCrypto trader Michaël van de Poppe tells his 718,900 followers on the social media platform X that interoperability blockchain Polkadot (DOT) is poised to rally due to major network advances.\n\nHe also says DOT is likely to see a boost from ETH’s upward momentum as well.\n\n“Polkadot did a retest at the crucial levels and wakes up slowly. Given their Polkadot 2.0 release and the JAM ( Join-Accumulate Machine) white paper and the correlation with ETH, I’m expecting a lot from them. Next target is likely $18.”\n\nPolkadot is trading for $7.14 at time of writing, up more than 4% in the last 24 hours.\n\nThe analyst also believes the broader altcoin market is entering a bullish phase after correcting.\n\n“The altcoin market capitalization has finished its correction. The next step: reaching all-time high, which is ~60%-70% from here. I think Ethereum is likely reaching that in the next two-four months.”\n\nHe says alts could outperform Bitcoin (BTC) in the months ahead.\n\n“The altcoins are still heavily undervalued. Most of them are down 70% against Bitcoin. That doesn’t mean we shouldn’t be having any correction, but feeling fear of missing out (FOMO) here is the wrong emotion to have. In the coming months, I expect altcoins to do way better.”\n\nLastly, the analyst says he is bullish on Bitcoin but expects the crypto king to retest the $68,000 level on the 12-hour chart before continuing upward.\n\n“Bitcoin slowly consolidating. Expecting a retest at the $68,000 mark, before a continuation upwards. The trend is clearly upwards.”\n\nBitcoin is trading for $67,553 at time of writing, down more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOeGxoY19YaVpHcTh6LUxFanM5ZVFSWkFlX0xpR2xiVVctbG1hanR0ajdFSjQ1U2Y5TWlBZ2h0NlN1S1hJT0tHNzZEOU1PTHNJeFl0SXp1M1pWanB1UUJqZlZDYktBYnJJQlhocVJyT0dLVWFBdmY0N2l1WmxIdnlBd0hWWmlDeFYtXy1IaUo2dGtPMHN1Y0x6SWd2V0JlbmUzYVl0SldYS3EtLTlGQW130gG0AUFVX3lxTE8zcng0NEx1WEtYdFVBUjN1RVNjYVlaZWhjQm5JQll5MXBQM3pTWWlPZExBMV8ydnpGU0I4YW82S2NHd1NxWEtJZUdlU1pid2plc2pPMHZVekJxY1hfV3Y3YlJxS29WZWtwM1kzYlBlc3JoSDlJVF81Y2NRMGs5UVd1bmU4ZnJrajBvQzFXUUhJVDE4aTZIWmNEVjdEcXJpSkJBbHdfNXRKRXFBYkV1dXMzcFREdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ether Rally Cools Following U.S. Ether ETF Listing Approval - CoinDesk",
        "content": "The U.S. Securities and Exchange Commission (SEC) on Thursday approved key regulatory filings tied to ether ETFs, a historic milestone for the second-largest cryptocurrency. They are not, however, cleared to trade. Although the SEC approved the 19B-4 form that allows for the offering and listing of ETFs, it must still green light the funds' S-1 filings before investors can buy them."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQZm5CeFlxcWtEZXNGZGRmTWxKV0hVTTRuMkJHV3Z5V2JUY3F0NlkwNTlpYXJDVll0bDdhdG1zeHo3aFBWQUR6NE11VDEwa0JKR0ZsdVQ0MXNaOWI1bFEtSk5QSVhYdjN4VEttMWt5TEJwRS1XTU5JQXNiVkotQmtqQ3hfQ2Q3OVNCcjhzaUFhZlBSSVRXWEN6RlhESQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Why one analyst thinks Ethereum ETFs will be ‘disappointing’ - DLNews",
        "content": "Institutions gobbled up Bitcoin after the approval of spot Bitcoin ETFs.\n\nThey might not show the same interest in Ethereum, according to researcher Noelle Acheson.\n\nBitcoin hit new highs just weeks after the US Securities and Exchange Commission approved spot Bitcoin exchange-traded funds.\n\nThe move let institutions gobble up more than $12 billion worth of the original cryptocurrency, according to data from pseudonymous analyst Hildobby.\n\nEthereum investors might not be so lucky.\n\nSeveral indicators suggest institutional interest in Ethereum is much lower than it was for Bitcoin, according to researcher Noelle Acheson, former head of market insights for Genesis Global Trading.\n\nShe isn’t the only pessimist.\n\nBloomberg Intelligence ETF analyst Eric Balchunas expects Ethereum ETFs to be “10-15% of the assets of the BTC ETFs.”\n\nThe SEC had long fought against the approval of spot crypto ETFs, arguing they were vulnerable to manipulation.\n\nAfter losing a lawsuit filed by crypto asset manager Grayscale Investments, the SEC capitulated in January with the approval of 11 spot Bitcoin ETFs.\n\nJoin the community to get our latest stories and updates\n\nStill, it had signalled it would deny applications for spot Ethereum ETFs.\n\nThat changed this week, amid a flurry of pro-crypto developments in the US.\n\nOn Monday, Balchunas and his colleague James Seyffart updated their odds of spot Ethereum ETF approval to 75% from 25%.\n\nThat approval came Thursday, but the actual launch may be weeks or months away. And whether it drives Ethereum to its own all-time high is another matter.\n\n“When/if the ETH spot ETFs eventually launch, we should brace ourselves for a disappointing reception,” Acheson wrote in her newsletter, Crypto is Macro.\n\nThat’s in part because institutional investors have shown little interest in existing Ethereum-based products.\n\nIn Hong Kong, which approved spot Bitcoin and Ethereum ETFs last month, Ethereum accounts for less than 15% of the assets under management, Acheson notes.\n\nIn the US, meanwhile, investors already have access to Ethereum futures ETFs. And they aren’t that interested.\n\n“The [assets under management] of the leading ETH futures ETF (EETH) is around 4% that of the leading BTC futures ETF (BITO),” Acheson writes.\n\nAs for the spot Ethereum ETF itself, available data suggests institutional interest might be lacking there as well.\n\n“The CME is the largest BTC derivatives platform in the market, in terms of open interest,” Acheson writes.\n\n“But it ranks only fifth in ETH derivatives. US institutional investors are maybe just not really into the ETH narrative?”\n\nTo be sure, open interest in Bitcoin was highest on Binance, with CME taking the top spot just before the approval of spot Bitcoin ETFs in January.\n\nThere’s evidence that’s already happening with Ethereum: CME was in the sixth spot at the beginning of the week.\n\nAnd Wall Street executives have repeatedly said they see potential in Ethereum.\n\n“Remove the regulatory uncertainty around proof of stake and watch how Wall Street runs to ETH,” investor Jim Bianco wrote on X, referring to the method Ethereum uses to confirm transactions and create new coins.\n\n“It is an entire ecosystem with borrowing, lending, insurance, tokenomics, staking (yield), stablecoins, NFTS, primitives, L2s, and on and on. Plenty for them to work with here as opposed to hodl-ing one coin,” he said.\n\nCrypto market movers\n\nBitcoin is down 3.2% at $67,297 over the past 24 hours.\n\nEthereum is down 3.4% at $3,679.\n\nWhat we’re reading\n\nAleks Gilbert is a DeFi correspondent based in New York. Have a tip? You can contact him at aleks@dlnews.com."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPSEdZa0gxUWRiclFjSXYwY3BMTzFocDlPTUlrWWdmekI1MDE3c2hwNTNWN0FTdEJoSC1QVGVYaS1heWxmVFFqSWpMdEktdTRwcGZSVHBRYlQ0WHMxMnl1MWdwWGVxeG9ESUhyTzdjYU5XM21GXzNQS0hXdWlvQ0JTbnF2NkJRQmh3RHMxWmNGOHhpSzVhNWlzWU1MQXdPS0paTGdNRmxSNWZRWGF5VHdRMnJQM283Nk96eW5xaWhqeU85UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "First Bitcoin, now Ether: SEC opens door to Ethereum ETFs - Business Today",
        "content": "In a landmark decision, the US Securities and Exchange Commission (SEC) has signalled its approval for the potential launch of eight exchange-traded funds (ETFs) linked to ether, the world's second-largest cryptocurrency. This move follows the SEC's approval of the first bitcoin ETFs earlier this year, marking a significant shift in the regulatory landscape for digital assets.\n\nRelated Articles\n\nThe SEC's approval on Thursday involved crucial rule changes that pave the way for ETFs that directly invest in ether, the native cryptocurrency of the Ethereum blockchain. Applications from prominent financial groups such as BlackRock, Fidelity, Invesco, and Ark Invest received the green light. While this represents a major step forward, a second round of approvals will be necessary before these products can officially launch.\n\nThe anticipation surrounding these approvals has fueled a surge in ether's price, which has climbed more than 20% since Monday and over 60% since the beginning of the year. This reflects the growing confidence among investors regarding the mainstream acceptance of cryptocurrencies.\n\nThe SEC's decision comes after months of silence on the matter. On Monday, the regulator unexpectedly provided feedback on pending applications to issuers and exchanges, triggering a flurry of paperwork revisions and submissions. This swift action was likely prompted by approaching deadlines for responses to ether ETF applications from VanEck and Ark Invest.\n\nWhile the SEC's Thursday approval marks a significant milestone, the timing of the second round of approvals and the subsequent launch of ether ETFs remains unclear.\n\nCommenting on the development, Sergey Nazarov, co-founder of Chainlink stated: \"The Ethereum ETF approval is a second large step forward for the crypto industry... The attention and adoption around the Ethereum ETF also proves the long-term thesis we have been building around, that the capital markets will be the next large source of adoption for the cryptocurrency industry, essentially being the key force that is driving it to new heights.\"\n\nNazarov highlighted the potential of the approval to shine a spotlight on Ethereum's smart contract and decentralised application capabilities, which are attracting growing interest from major financial institutions.\n\nSumit Gupta, Co-founder of CoinDCX commented, \"The US Securities and Exchange Commission (SEC)'s green light for spot Ether ETFs is a watershed moment for the crypto industry. It builds on the success of Bitcoin ETFs, offering a secure and regulated way for investors to access Ether. This broader acceptance will fuel mainstream adoption and reflect a maturing regulatory environment, paving the way for further legitimising the entire digital asset space.\"\n\n\"Ethereum plays a pivotal role in the decentralised ecosystem, and this regulatory progress will be instrumental in shaping the future of Web3 and the ongoing digital revolution. The SEC decision is particularly important, as earlier media reports suggested the SEC was investigating the Ethereum Foundation, coupled with the ongoing debate about Ethereum’s native token, ether (ETH), and its potential classification as a security,\" Gupta added.\n\nMeanwhile, Himanshu Maradiya, Founder & Chairman of CIFDAQ Blockchain Ecosystem India Ltd said, \"The SEC's approval of Ethereum ETFs marks a watershed moment in digital finance, poised to catalyse a sustained bull run while tempering volatility to align with traditional asset classes. This monumental achievement not only validates the mainstream acceptance of cryptocurrencies but also sets the stage for widespread institutional and retail involvement. Regulated investment vehicles for Ethereum will bolster investor confidence and ignite further innovation within the blockchain sphere.\"\n\nMaradiya added, \"In the Indian market, this development heralds a new era of global digital asset integration, offering invaluable insights for our regulators. Indian investors stand to benefit from expanded portfolio diversification and enhanced access to global crypto markets. This pivotal juncture has the potential to accelerate cryptocurrency adoption in India, fostering a more inclusive and dynamic financial ecosystem. Moreover, it presents retail investors with a unique opportunity to harness the power of this asset class for wealth creation.\"\n\nThis landmark decision by the SEC could potentially usher in a new era for cryptocurrencies, further solidifying their integration into traditional financial markets."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQN0tBMUFnNkxrNEhKakpLM3U1Y1FweUZiX1dVY1RDS0FmekEzcGtWTkZ4RlZ5VXBabGFyVzdOYUZoZWdKcTlCVkVGaTRHNkhJUXpoOTdfVm1pMkVnQ3dVaDdmeV9wTmwtb3RaemdQeThKcFZlNWJyMk9LNm5ZcmJFclBNYVlWOWFrd09Cd3lqSGhOa2hRZElmRHNRdkladGNtRkhodnpTczcwaHpDZFpGNnY2MHZWaGRab1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "US regulator approves 3 exchanges to list spot Ethereum exchange-traded funds - Anadolu Agency | English",
        "content": "Necessary Cookies\n\nThis cookie is used to distinguish between humans and bots. This is beneficial for the web site, in order to make valid reports on the use of their web site.\n\nFunctional Cookies\n\nRemembers the user's selected language version of a website.\n\nPerformance/Analytical Cookies\n\nRegisters a unique ID that is used to generate statistical data on how the visitor uses the website.Used by Google Analytics to throttle request rate.\n\nAccept Reject\n\nAdvertising/Marketing Cookies\n\nThis cookie is used to collect information on consumer behavior, which is sent to Alexa Analytics. (Alexa Analytics is an Amazon company.)"
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQVTMyQUMxUW9qTF9rY1AyYm51TC1ZNHR0WkNUSjl5SzVZd3dhLWZCeGNQUzRBaTJUcjA2NzNvUzBpUUs5UzNVQk1VOGJSSFVkcG44VC15MG9MSXNnanZTNFNRbnZ3Y1BUNC1CTEc0MWtrQUpmbjh3U1VrTDlVX29YMGl0a1N0N2hIbmtyWVY0dU5Wd3dYc1RDSGt0ZkpUcUtBMDYybkV0MEQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Bitcoin Price Flashes $1.2 Billion Signal after Ethereum ETF Approval -Here’s What to Expect - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNMWF0X01keFBTX2tHaXpyOTMyajB6SjhLS1hTSHpDUldQbEhrUnRQM25vNjd3YkdXNW5oWHdUa1gyQ1Q2ZXFpX1FhN3RtVDAtUUpGc1I0MGhKNldIcXo5VTBfUjNxRGZscGVaQjVmazF5dW1OTlBTNGRIMml4cjdXUzNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "House members urge SEC to approve Ethereum ETFs - Yahoo Finance",
        "content": "U.S. House members have appealed to Securities and Exchange Commission Chair Gary Gensler to sanction spot Ethereum exchange-traded funds (ETFs).\n\nThe SEC’s decision on the VanEck Ethereum ETF proposal, due today, could influence the cryptocurrency market’s trajectory.\n\nThe lawmakers’ request follows the SEC’s earlier approval of Bitcoin ETFs, setting a precedent for Ethereum, the world’s second-leading cryptocurrency in market capitalization.\n\nThe group of lawmakers called for the agency to apply the same legal framework to Ethereum as was used for Bitcoin ETFs.\n\nEarlier this week, Bloomberg analysts Eric Balchunas and James Seyffart revised their approval probability from 25% to 75%, citing a rise in discussions about expedited 19b-4 filings, a critical step for ETF launches.\n\nEther traded as high as US$3,937 ahead of the SEC’s decision on Thursday, according to CoinGecko data."
    }
]