[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNNDZmdDUxeEFBYzBtWmFILWVydEpVNDMzaFNXVWFuT1Yza25OUnVvNDlHSlJGVENjMnRNTVJqbENuSlM0NnJvTDhiQS0zNGFlOG5TaG93TURSUWtERnRNVkpBMm5PV0V5cXBpdXptN2dja0hlZXR4RXVpcEFWbUtMN283Z3RFY2U1dkg1SmFuZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Attacking Ethereum Costs More Than an Attack on Bitcoin: CoinMetrics - Unchained",
        "content": "The cost to attack Bitcoin ranges from $5 billion to $20 billion, while it would cost over $34 billion to attack Ethereum, according to CoinMetrics. Even then, researchers found no way for the attacker to profit and the network would still survive.\n\nBitcoin and Ethereum could now be resilient to 51% attacks,\n\nBitcoin and Ethereum could now be resilient to 51% attacks, according to new research from on-chain analytics firm CoinMetrics.\n\nA 51% attack refers to an attack on a blockchain by a group of miners or malicious actors that control more than half the network’s mining hash rate in a Proof-of-Work (PoW) environment or nodes in a Proof-of-Stake (PoS) setting, putting them in control over the network.\n\nOf course, the bigger the network is, the harder it becomes to control the majority of hashing power, and now it appears it might be too difficult to execute an attack on the two largest blockchains – Bitcoin and Ethereum.\n\nResearchers quantified the Total Cost to Attack (TCA) of these blockchains and found that it’s more expensive to carry out a malicious act like this than to participate in the network honestly.\n\nLucas Nuzzi, CoinMetrics’ head of research and development, shared excerpts from the academic paper’s findings on X. By the researchers’ estimates, in order to attack Bitcoin, someone would have to buy 7 million ASIC miners – the cost of which would likely be higher than $20 billion, based on how the market would react to a relentless buyer.\n\n4/ But these ASICs are not for sale! How do you buy 51% of them? One way to do that is to simulate using historical ASIC market data (thanks to https://t.co/C4YC0XjzxI) to see how that market would react to a relentless ASIC buyer In one scenario, that cost alone is close to… pic.twitter.com/fnS6DrLSY8 — Lucas Nuzzi (@LucasNuzzi) February 15, 2024\n\nEven if a nation-state attacker had the financial resources to manufacture their own ASICs for the attack, the only model that could be reverse engineered would be the Bitmain AntMiner S9, which also has a manufacturing cost of over $20 billion.\n\nMeanwhile, the researchers estimate that the total cost to attack Ethereum would be more than $34 billion, with an ETH price of $2,279 (the current price of ETH is $2,830), the total amount of ETH staked at 28.8 million, and a validator count of 899,840. This would also take more than six months due to the churn limit preventing stake from being deployed all at once\n\nOne major concern that industry watchers have raised over the years is the potential threat from Liquid Staking Derivatives (LSDs) provided by staking services like Lido and RocketPool. Lido, in particular, controls 31% of staked ETH, close to Ethereum’s economic security threshold of 33%, meaning that network finality could be disrupted if these nodes colluded.\n\n“Contrary to popular belief, an attacker could not leverage LSDs to buy access to block templates,” said Nuzzi.\n\n9 We also find no ways for a nation-state attacker to continuously run a 51% / 34% attack if the goal is to destroy these networks. The possibility of retaliation techniques makes ideologically driven attacks costly at each retaliation round. In the end, the network survives. — Lucas Nuzzi (@LucasNuzzi) February 15, 2024\n\nUpdated on Feb. 16, 2024, at 6:34 am EST: A previous version of the article misstated the cost to attack Ethereum as $34 million rather than $34 billion. Unchained regrets the error.\n\nUpdated on Feb. 16, 2024, at 7:30 am EST: Change the title from “51% Attacks on Bitcoin and Ethereum Impossible: CoinMetrics” to “Attacking Ethereum Costs More Than an Attack on Bitcoin: CoinMetrics”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQXFnZVRaUWx6ek5seEhWZVptRUNYYTFHUU8xcmJyWkZpa1hyRzBiOGxyWDd4eEcyNXhHa2NsMExrZFVxaGpRWm1oM2dVU1hVejllNjBhQzNqZDdJZ0hhSDZqME16V19fTkdoVGFGMzVLc09VRnZTSVFXVEFPM0kxeUMyN0lINDNjX1RPMDNOOEVwREszaWlv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Solana All Jumped Double-Digits This Week - The Motley Fool",
        "content": "Bitcoin jumped again this week as investors flooded into the crypto industry.\n\nThe crypto market came to life this week as Bitcoin (BTC -0.33%) passed $52,000 and the $1 trillion market cap level. As of noon ET on Friday, Bitcoin is up 10.2% over the past seven days and is holding strong.\n\nBitcoin isn't the only winner in crypto. Ethereum (ETH -0.67%) is up 12.2% to $2,784 per token and high-throughput blockchain Solana (SOL -0.19%) is up 4.7%, although it was up over 10% for the week just a few hours ago.\n\nWhat's driving the crypto market\n\nThe simple driver of crypto right now is the flow of funds into the industry. BlackRock's iShares Bitcoin Trust has seen hundreds of millions of dollars of inflows this week alone and now holds over 100,000 Bitcoins. That's enough to inflate the entire market.\n\nBitcoin's rise is particularly interesting given competing forces in the market. A strong U.S. dollar and rising interest rates have typically correlated to Bitcoin declining, but that trend is being offset by tech and growth stocks rising, which Bitcoin is directly correlated with.\n\nTraders have speculated that Bitcoin has become a safe haven for international investors or there's an increased pool of buyers because of new Bitcoin exchange-traded funds (ETFs), but the reality is money is coming into Bitcoin at a much faster pace than it's going out and that's driving the price.\n\nEthereum and Solana keep up\n\nEthereum is up in part because traders are expecting it to be the next crypto ETF. That would be the natural next step, although the Securities and Exchange Commission (SEC) hasn't said it will allow any ETFs beyond Bitcoin's.\n\nSolana could be another ETF candidate, but it's up in part because of airdrops in the ecosystem that has brought more liquidity and value, some of which is flowing back to the Solana token.\n\nIt's not unusual for tokens like Ethereum and Solana to climb alongside Bitcoin and that's at least one of the drivers of the tokens this week.\n\nWhat's ahead for crypto?\n\nOutside of just token values rising, Coinbase Global's earnings release this week showed optimism about crypto exchanges and also crypto use cases. Coinbase is seeing more adoption among institutions and developers and is also pushing for regulatory clarity about what's a security and what isn't in crypto.\n\nAs the industry leader in the U.S., Coinbase's position and activism are very important to the crypto industry and when it's reporting healthy financial results that bodes well for the industry.\n\nI think all of these factors working together are very bullish for cryptocurrencies in general and even exchanges and development companies like Coinbase. But it'll be a bumpy ride and the gains earned this week could evaporate next week. So, prepare for the volatility ahead -- any dips could be a buying opportunity for investors."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNSE11VG5SUG05Wk1IMWNlWmdDZUlSRGhOc1VZa3hrOGMyc0VDblBjVS1HQVhBeC1Dd0EzellNTm0zdlhWd3BGcVJZdnJrazhCRUhOQngxNE5vaHJDa1JjUHBXRHJZZlVWRktjLTdITVhYNDZoVHluTDBmZ005V2xMcUJWX1U0elEzUGpzQ0JHQWdmSGJDVW1ySnBIcVlkTDFVZUcyc0JMVVFDVWtLcnNGSzJfR0hCek12NWRNRGJCRWsxUTNJVWtkdWJoemhHU3g5VHg0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Raoul Pal Predicts Massive Rally for Ethereum And Solana In Current Bull Cycle - TradingView",
        "content": "ZyCrypto\n\nRenowned macro-investor and Real Vision founder Raoul Pal has predicted a massive rally for Ethereum (ETH) and Solana (SOL) in the ongoing bull cycle.\n\nSpeaking during a recent podcast with Anthony Scaramucci, founder of global alternative investment firm SkyBridge Capital, Pal discussed the factors driving the growth of cryptocurrencies and their potential to save economies from a monetary meltdown.\n\nPal explained that the current debt cycle and the debasement of currency by central banks are driving the adoption of cryptocurrencies. He believes that people are looking for alternative investments due to the fear of a potential global economic meltdown caused by excessive debt and the devaluation of fiat currencies. He also mentioned that the rapid growth of decentralized finance (DeFi) and non-fungible tokens (NFTs) is creating new use cases and driving up the adoption of cryptocurrencies.\n\nWhen asked about his confidence in the growth of Ethereum and Solana, Pal stated that he believes ETH will reach a price of between $15,000 and $20,000 in this bull cycle. The pundit further underscored that SOL will reach a price of $750 and $1,000 in the same period.\n\nHe emphasized that he is very aggressively positioned in crypto as he believes that the issues of printing of money and excess debt will be the feature of the next two years and crypto will be the best-performing asset class.\n\n“I’m actually 100% of my liquid net worth in [crypto] and I have been actually for since 2020. And I use the bear markets to add into because I think we are in a once in a lifetime wealth accumulation opportunity for everybody be rich or poor,” said Pal.\n\nNotably, the pundit did not provide a specific timeline for when he expects the crypto market to reach its peak. However, many experts are closely monitoring the upcoming Bitcoin halving event. It is worth noting that the Bitcoin bull market has historically started around 12 to 18 months after a halving event. If this pattern were to repeat itself, the next bull market peak would likely be in the third or fourth quarter of 2025.\n\nPal also discussed the role of gold and silver in the current economic climate, stating that while they have always played a role as a global store of wealth, they do not work as well in a digital age. He emphasized he prefers crypto over the two assets, as it offers the same benefits and has the added advantage of a technology super-cycle behind it.\n\nAt press time, Ethereum was trading at $2,790 after a 7.73% surge in the past 24 hours. On the other hand, SOL was exchanging hands at $110, reflecting a 3.51% gain over the same period."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxPdWtwZ2JvbzBPazhtVVZYamg5cEkxRmNqNUZVRXF5ZnhYTHhfRmxCWklzM3pKVUM1UkszU2RFYkdrWlEyV3V4enJfLU1WbXp1bTJTbmk0UXdVZThfQ3JyNjJCODJ5QkhkeUF6TlJOTUFhTWlqME5YVzVZOXh6SXZXREdhRFVkQW5La05WMlFjcVYydzRZeml6ZU9hNDVqd1dmMzMydHhWZ2VwZ0lXTnpLRHNzRHNhTnZPZnBYMFB4T2I3bkFaT3JrdFM2b2NRU3N4M2RpLVdGVzVLQ1BmYXhuQ2RGMVNlUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Coinbase Named As 'Custodian In 5 Of 8 Ethereum ETF Applications,' Says CEO Brian Armstrong - Benzinga",
        "content": "Coinbase Global Inc COIN CEO Brian Armstrong spoke about new ventures in Ethereum ETH/USD based products during a Thursday earnings call.\n\nWhat Happened: He said, “We’ve been named as the custodian in 5 of the 8 ETH ETF applications.”\n\nCoinbase reported a 45.2% jump in net revenue, hitting $905 million in the fourth quarter and exceeding the estimated $825 million. The quarter marked a turnaround to profit with a net income of $273 million, a stark contrast to the $2 million loss in the previous quarter and the first profitable quarter since Q4 2021.\n\nTransactional activity was central to Coinbase’s income, with consumer crypto trading pulling in $493 million—a near doubling from the third quarter—and institutional transaction revenue increasing twofold to $36.7 million. The exchange processed over $29 billion in consumer trading volume, a 164% rise from the previous quarter.\n\nSubscriptions and services also contributed notably to revenues, generating $375.4 million, a share of which was derived largely from stablecoin and blockchain rewards, amounting to $171.6 million and $95.1 million, respectively.\n\nArmstrong added, \"For anybody worried about cannibalization, ETFs have been positive for the industry, which has been additive for Coinbase. We’re seeing elevated engagement and net inflows across both retail and institutional Q1 to date.”\n\nThe cryptocurrency trading platform CEO said that more big financial organizations are starting to use cryptocurrencies. “Every institution is now starting to hold crypto, the asset class will be a standard part of every diversified portfolio. The financial system is officially adopting crypto. This is really good, and Coinbase is the most trusted partner here.\"\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: Armstrong also said ETFs were a \"win-win for Coinbase.”\n\n\"The Bitcoin ETFs are breaking records. And when gold launched in November 2004, it took one year to get to $3 billion. These ETFs did that in a few weeks. And so this is really an incredible start,\" Armstrong noted.\n\nPrice Action: At the time of writing, Bitcoin was trading at $52,354, up 0.12% over the past 24 hours, as reported by Benzinga Pro. Coinbase shares were up approximately 150% over a one-year period heading into the print. The stock was up 8.41% after hours at $179.45 at the time of publication, according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQTWdhaTdmaVNaN2hsbGxQRFBfdFlDQ1VyallfNVBqTW1yNmduN0ZZWGZ6a3d3THRKZGg3UTkwc2pOeHowWnN4ZlpMSlNlcjNnM2llcU1SNWV5UjlZWGZGN2ZwclBWa1VscS1NMF9VNTBFMGY0RS0xQXRzR0lTSldTQmRUZEdmSXZRZGFSdUdxRWpoQURvV1pqR2lqZEs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "This Ethereum DeFi trader turned $30k into $1.1m in just five days — or did they? - DLNews",
        "content": "A DeFi trader's apparent $30,000 to $1.1 million gain from trading Pandora was largely due to receiving tokens via Sablier, not just market buys.\n\nSablier is a DeFi platform used by projects to distribute tokens on a payroll or as part of a token vesting schedule.\n\nThe apparent success of a DeFi trader turning nearly $30,000 into $1.1 million in five days has sparked widespread fascination.\n\nThe anonymous trader, who owns the Ethereum wallet 0x88, invested in Pandora, a buzzy Ethereum token and NFT hybrid. And DeFi users keen on monitoring onchain data — DeFi trading is transparent thanks to public blockchains — noted their purported $1 million earnings.\n\nThe tale of instant riches inspires hope in many punters of DeFi.\n\nBut a closer examination by DL News suggests the situation is more complex than initially thought.\n\nAnalysis of the trader’s wallet history shows that they didn’t market-buy all the Pandora tokens they eventually sold; rather, they received more than half of the tokens from Sablier.\n\nSablier is a DeFi platform used by projects to distribute tokens on a payroll or as part of a token vesting schedule. Generally, tokens are only vested if there was a token pre-sale or a similar arrangement.\n\nBut according to messages seen by DL News on a Telegram channel run by the Pandora team, a pre-sale was not conducted. Pandora did not immediately respond to DL News’ request for comment.\n\nPandora emerged last week as the first implementation of the new — untested and experimental — ERC404 token standard that exists as both a token and an NFT.\n\nJoin the community to get our latest stories and updates\n\nIn order to hold the NFT a user must buy at least one whole fungible token. If they then sell that token, or a fraction of the token, the NFT is burned, or removed from the supply.\n\nOpening Pandora’s box\n\nThe mysterious trader held a total of 78 Pandora tokens worth $2.5 million at the token’s peak. Although the trader did purchase tokens in the project early, their gains did not all come from market purchases. Most of the gains came from the tokens received via Sablier.\n\nThe story began on February 4 when the Pandora project gave them what’s called a Sablier Lockup NFT, which represents ownership of 45 Pandora tokens.\n\nAfter receiving 45 Pandora tokens via Sablier, the mysterious trader also made a series of token purchases. They bought 33.59 Pandora tokens at an average price of $889, before spreading their sales over 35 transactions as the token rallied some 3,500%.\n\nThe 0x88 wallet sold 77 Pandora tokens across 35 transactions. (Dexscreener)\n\nThe trader’s wallet had direct interactions with a few other wallets, which indicates they may be connected in some way, either the same individual controls them all, or the wallets are part of a larger group of individuals.\n\nThe first, wallet 0x22, seems to be a transit wallet without any special features. Another wallet, 0x0d has a balance of $172,000 and is actively airdrop-farming on protocols like Manta, Blur, and Blast. Lastly, wallet 0x2c, which is only two days old, already holds almost $1 million — coming directly from the trader’s Pandora wallet.\n\nPandora's price\n\nSince launching on February 2, the project has done over $550 million in trading volume on decentralised exchanges and over $3 million in volume on NFT marketplaces on Ethereum.\n\nThe success of Pandora has also led to dozens of other projects launching ERC404 collections, resulting in gas spikes on Ethereum mainnet and numerous suspected rug pulls.\n\nThe total market value for ERC404 projects sits at $151 million, with nearly $21 million in total trading volume in the last 24 hours.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQZ2YwU1k5by1NcC1NR0h0cHNicXkyRE1xMW9GbEs2eXpoQUJMdmNJMWk5Tmppbk1mZ0hqWVBnWXRrRlR6MWxxQVRrMU9DUnlEb3p0RzdJX3V3VVZxODlBdUpDQ3Q0cGV5dGs3bUFSN2xvRjdpUTRSZng1allhTzNPejFXeG1hT19vMEc1UmZGcG5XYnRtck02SHlrRlpFbWd3U2x1TVFGcnZTM1NOcV9lZHBHdEtwaDBZTFh5Ynl5NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Everything is ready for Uniswap v4: launch expected after the Ethereum Dencun update - The Cryptonomist",
        "content": "According to the Uniswap Foundation, the long-awaited version 4 of the decentralized exchange Uniswap will arrive in the third quarter of 2024, following the implementation of the Dencun upgrade of the Ethereum blockchain, scheduled for March 13th.\n\nUniswap v4 introduces the concept of “hooks” that allows for efficient liquidity management within the protocol and enables a wider range of use cases for smart contracts.\n\nAll the details below.\n\nThe v2 version of the decentralized exchange Uniswap coming after the Ethereum Dencun update\n\nUniswap Foundation, the decentralized autonomous organization that supports the Uniswap cryptographic exchange protocol, has announced that it will release version v4 of the platform in the third quarter of the current year.\n\nFirst of all, the founder of the project Hayden Adams and all the developers working on the DEX want to wait for the Dencun update of the Ethereum blockchain to run its course and be successfully executed.\n\nIn particular, Dencun, whose implementation is expected on March 13th, will help make the network more scalable by compressing block data and storing part of it separately.\n\nAll of this will open the doors for Uniswap to explore new functionalities within its own platform, expanding connections with the Ethereum network and offering more efficient products.\n\nThe Uniswap team has revealed the roadmap for its upgrade to version 4, explaining that at this moment the work is in the “Code Freeze” phase, where they are completing the main code, conducting tests, optimizing gas, improving security, and finalizing the periphery.\n\nThe next phase will involve testing their own infrastructure with preliminary checks at specific auditing companies, along with a community audit contest.\n\nIn this moment, the v4 of Uniswap will be distributed in testnet, and eventually small modifications will be made to the code.\n\nFinally, the last phase concerns the actual launch, accompanied by the related promotion and marketing initiatives.\n\nNow that the launch of Dencun on Mainnet has been scheduled for March 2024, we're excited to provide an update to the community! 🎉\n\n\n\nUniswap v4's launch is tentatively set for Q3 2024.\n\n\n\nFrom community-built Hooks (https://t.co/WyaGr1Ti1t), to events, to Twitter Spaces, the… — Uniswap Foundation (@UniswapFND) February 15, 2024\n\nThe new version of the industry-leading DEX will leverage the recent Ethereum improvement proposals (EIP, specifically EIP-4788, EIP-1153, and EIP-4844) for a more efficient utilization of liquidity in the platform’s pools.\n\nWith v4, the concept of “hook” will be introduced for the first time in DeFi, which allows the injection of custom logic at specifically designated points for pools, swaps, fees, and other LP positions.\n\nThis amplifies the use cases of Uniswap and explores new solutions for smart contract engagement, with significant reductions in gas fees and always immediate interactions, combined with better resource management for end users.\n\nThe positive effects of Dencun on the Ethereum blockchain\n\nWhile Uniswap awaits the implementation of Dencun on the Ethereum blockchain, the community of the world’s leading smart contract platform is buzzing with excitement for one of the most significant updates ever witnessed so far.\n\nDencun was previously launched on January 17th on the Goerli testnet (with some difficulties and a 4-hour delay) specifically to test some new features.\n\nOn January 31st, it was then the turn of the Sepolia testnet, and finally on February 11th, the Holesky testnet, completing the final preparations before the arrival in mainnet.\n\nNow the official launch to the general public, as highlighted by the blockchain research company “Nethermind”, is scheduled for March 13th at 13:55:35 UTC, at block height “8626176”.\n\nThe Ethereum developers have decided on the official launch date unanimously during the so-called consensus level call 127 after the success of Holesky.\n\nEthereum's Dencun upgrade is set for March 13.\n\n\n\nIt introduces several key changes, including EIP-4844, EIP-1153, and EIP-4788.\n\n\n\nHow will Dencun affect L2 valuations, and what does this have to do with Uniswap?\n\n\n\nSubscribe and read to find out.https://t.co/0fHx7Y3Zd7 — Blockworks Research (@blockworksres) February 15, 2024\n\nFrom a technical point of view, Dencun will enable a new type of transaction called “proto-danksharding” that will help reduce transaction costs on Ethereum’s rollups, with obvious benefits also for DEXs like Uniswap.\n\nMore precisely, the “proto-danksharding” is a preliminary measure of the technical functionality of “danksharding”, which opens the doors to future implementations on the L1 backbone infrastructure.\n\nFor now, Dencun will be responsible for compressing the transaction data contained in the rollups and storing part of it in an external storage, helping to reduce the weight of the blocks and thus reducing fees for the end user.”\n\nIn addition, the same update will help reduce the cost of data available on Ethereum, creating advantageous conditions for projects such as Celestia, Avail, and EigenDA.\n\nWith the L2 market on Ethereum experiencing strong growth, as reported by the increase in the overall TVL of this sector, we expect Dencun to revolutionize the aspect of network scaling by bringing greater efficiency and a larger influx of new users."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQQ2h5NS1FaW91S1JaN2RsbDExUVFiSk1Gc2g1LWZNV2w1RUJNVEJyZkNvM1poT2QxMzJyU3VCU2xUXzJLUnFqZkZJajNMNWhGdW5OWHEwX1JqeFgtYlVBUVAtdFNNWTNhaVItYmkwbVNicm1QbzJDdV9TaUM5VnU1dm82WTRhbm5pVDZ4d29kaVZ4OENOWnM5dGhzUHJEWmpHQXBhMERtRlhtRE1OQUI5azlR0gG3AUFVX3lxTFBYaXo4R0s5T24ybkdUNFc1bXpKMzF2UHNHUmJmZXBNMXU1QmROT1RVUERXbFBCbVZXelh0djNUelpYX2ZveUNUX0pPRm9XNE1tXzcxclJrNUlxTHdteXFqcTJxTzRCdlVfVFlvc0NaeV9zLVdfRGs1SEFwbVI4NmR3WUMxRWNUU2I2TGJnVUZzN29CaGY2VHE0SVRhU0FERy1qSXF2eXRvZy1Ja2E3OGRJZTRYZkwzRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "This Is How Much You Would Need to Spend to Execute 51% Attacks on Bitcoin and Ethereum - CryptoPotato",
        "content": "A 51% attack occurs when a single network miner or group of miners controls more than half of a blockchain network’s hash rate. Theoretically, this would enable the attacker to block transactions from taking place in the blockchain, alter the sequence of new transactions, and potentially revert past transactions (referred to as “double spending”) by tampering with blockchain data.\n\nHowever, a recent study indicates that executing such attacks is financially unviable within the current security setups of Bitcoin and Ethereum.\n\nAttacking Bitcoin and Ethereum Not Worthwhile\n\nWith reference to December 31, 2023, and considering an Ethereum price of $2,279, a total staked ETH amounting to 28.8 million ETH, and a validator count of 899,840 validators, CoinMetrics’ calculations suggest that an attacker would need around $34.39 billion to execute a 34% attack on the network.\n\nIf the assault were to commence on December 31, 2023, it would require the attacker until June 14, 2024, to breach the 33% threshold to gain control over the network.\n\nAttacking Bitcoin would also prove to be equally far-fetched. Researchers estimate that the attacker would face production expenses of over $20 billion, as they would need to manufacture nearly 40 million units of the S9.\n\nUsing the most powerful ASIC available, like the upcoming Bitmain S21, would cost around $5.6 billion by December 2023, roughly a quarter of the expense of using the S9. This estimation is based on a unit cost of $2,240 and a production volume of 2.5 million machines.\n\nWhile more cost-effective than the “naive” approach, the research asserted that manufacturing at this efficiency and scale would require cooperation with the manufacturer. However, the attacker would probably encounter supply chain issues and potential retaliation.\n\n“Our findings suggest that the current state of security in Bitcoin and Ethereum makes attacks economically unfeasible and provides empirical evidence of Nash Equilibrium in these networks.”\n\nThe study concluded that the security measures of Bitcoin and Ethereum have reached a level where the costs and dangers linked with 51% attacks significantly outweigh the potential benefits. It indicates that hostile actions become less appealing when compared to alternative strategies like honest engagement in the network or refraining from attacking.\n\n51% Attack Risks Extend Beyond Leading Blockchains\n\nThe assessment may be true for top blockchains like Bitcoin and Ethereum, but the same cannot be said for many other networks that have surfaced in the past decade.\n\nBitcoin SV, a blockchain formed as a split from Bitcoin Cash and championed primarily by entrepreneurs Calvin Ayre and Craig Wright, experienced three instances of 51% attacks in 2021. Similarly, the lesser-known privacy-focused crypto Firo, previously known as Zcoin, faced a similar ordeal. Even Ethereum Classic wasn’t spared by rogue actors."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPVTJrbUZ1U1FKTUdmb1FCNWxqSVRsekt2dkJKTmItM0s0b09qeFFCSDNBVlFWam5LRVp2QUxNUExTdlI4LTIyRGhEbHBfRk1ueUNnckJ2eW5mWHJ0TXFmRVY0REwzWWxUVENabm5pSzN3cWNxSFJzZUt3Nm1sSnF3RUdoQ3RkRDlxNEdpZEJKM2pENkladU5JcGkzbUJxWS1JVUVMQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "XRP Can Rise To $5.53 if it Captures Ethereum Market Cap of $299B - The Crypto Basic",
        "content": "The XRP price is currently struggling to retain $0.52, with commentators dubbing the token undervalued, but what could this price be if XRP captured the $299 billion market cap of Ethereum?\n\nXRP retained the spot as the second-largest crypto asset at some point, only below Bitcoin (BTC), the firstborn cryptocurrency, in market capitalization. The crypto asset overtook Litecoin (LTC) in market cap in 2015 and held the second spot until 2016, when Ethereum (ETH) stole the show.\n\nXRP Battled Ethereum for Second Spot\n\nXRP battled Ethereum for the second spot from 2016 to 2018, eventually reclaiming it in December 2017 when its market cap soared to $95.8 billion while Ethereum remained at the $70 billion mark. ETH retook the spot after a brief period, but the supremacy battle lingered until late 2019.\n\n- Advertisement -\n\nEthereum has continued to hold the second spot since then, with the SEC lawsuit, which came up in December 2020, exerting more bearish pressure on XRP. While Ethereum’s market cap soared to a high of $575 billion in November 2021 during the bull run, XRP only had a valuation of $60 billion.\n\nOver the years, XRP has also relinquished the third and fourth spots to Binance Coin (BNB) and Tether (USDT). Most recently, it gave up the fifth spot to a rallying Solana (SOL), whose market cap has now skyrocketed past $47 billion amid the reclamation of a $100 price.\n\nXRP now sits sixth among the largest crypto assets by market cap, with a valuation of $28.5 billion at the time of reporting. Meanwhile, USDC, Circle’s stablecoin, boasts a market cap of $27.9 billion despite its woes last year.\n\nXRP Price at $299B Market Cap\n\nSeveral XRP proponents have bemoaned the asset’s underperformance over the years, as it goes from a competitive stance against Ethereum to relegating itself to the sixth position among the largest cryptocurrencies by market capitalization.\n\nWhile some market analysts predict an imminent comeback from XRP, these projections remain speculative at this time. However, if XRP had followed a similar growth trajectory to Ethereum’s, what would its price be right now, considering its current circulating supply?\n\n- Advertisement -\n\nEthereum currently has a market cap of $299 billion at the time of reporting. Meanwhile, XRP’s circulating supply comes in at 54.5 billion coins, per CoinMarketCap (CMC) data. If XRP had imitated Ethereum’s growth to reach the $299 billion valuation, its price right now would be $5.53.\n\nNotably, this price would represent a new all-time high for XRP, which currently trades for $0.5227. XRP would need to skyrocket by a massive 957% from its current value to clinch the $5.53 price.\n\nIf XRP achieves a market capitalization of $1 trillion like Bitcoin, XRP price would be approximately $18."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPY1d3c0stb3o0VUZVanM2emoydEZULV94dWpsYThpbWZWVXVqdDlHYjlBRlQzaUVSVE9UQVRvajhELW5VM19SelNHbHBqVjB1MnloTW0tcW5tdm5sSkFFNFZyNVlxRkdtZ19TTVJzVzZneWhyZlJnM1VmaGFsdllYNzMzYlBRZDN6NkJ4Z0JrbmYxY1ZYbnhoRzR2ZlY4OWtzbzVyRG03TjQzeUVW0gGyAUFVX3lxTE9vQXBWalRLWTRQbzlFS3RYZTd6M1U3Zjh2bTd5X3FMa0wxQUJfamxnVXlmcFplbUJwdl9USE1Tdng0a0xGanJXdkNlOFFQa0ZKSEl3WWVpZVp1cTVJcHZ6OUlEc2hYOTJCMGFTUnZTYXJ1WTc4V0ZUUzU2RGdibWNqVHhpY1d0NC1KWjVLZFhpUnZlY0U3U3JVYngwRm5FV2xtaklkTmxYZGZ6TEl6aWxqUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) $3,000 Mark Confirmed, Solana (SOL) Fails Unexpectedly, Dogecoin (DOGE) Reaches Nemesis Resistance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's recent price action suggests that the $3,000 mark is within reach. This level is not just a psychological barrier but also a significant milestone that reflects the growing confidence of investors in the asset's long-term value proposition.\n\nUpon reviewing the latest price chart, Ethereum has been on a remarkable upward trajectory. The digital asset has persistently held above the 50-day and 200-day Exponential Moving Averages, which are often looked at as indicators of bullish sentiment when the price is above them. The 50-day EMA, in particular, has provided strong support during the recent uptick, currently residing around the $2,500 mark.\n\nEthereum's surge past the $2,800 level has been met with increasing volume, indicating solid interest in sustaining higher price levels. Resistance is anticipated as ETH approaches the critical $3,000 threshold. This is due to the expected profit-taking by traders who view this round number as an opportune moment to realize gains. However, the strength of the current trend suggests that any pullback might be short-lived.\n\nIf Ethereum faces selling pressure at $3,000, the $2,800 level may serve as the first line of defense against a significant retracement. A further drop could see the $2,500 zone, aligned with the 50-day EMA, acting as a more substantial support level.\n\nAdvertisement\n\nOn the flip side, if Ethereum breaks the $3,000 resistance, we could see an extension of the bullish run, with potential targets moving into uncharted territory. Such a move would confirm Ethereum's bullish stance and could trigger a new wave of speculative interest in the asset.\n\nSolana loses momentum\n\nSolana has encountered an unexpected stall in its price momentum. The asset, which has been the main choice of bulls during this bull run, has struggled to breach the $120 resistance level, a barrier that has proven to be a significant challenge.\n\nAn in-depth analysis of the price action reveals that SOL's movement has been constrained, with the $120 mark acting as a ceiling to its growth. This level is not just a technical resistance but has become a psychological one, with each approach being met with selling pressure that pushes the price back down. The inability to push past this point has led to a period of consolidation, with the price oscillating between this upper bound and support levels beneath.\n\nThe immediate support for Solana is observed around the $100 zone, a level that has been tested several times and has so far held firm. A break below this could open the door to further losses, with the next significant support level at around the $90 mark, where the 200-day Exponential Moving Average lies.\n\nThe lack of upward momentum in Solana's price can be partly attributed to broader market conditions, where increased transaction fees on the Ethereum network have led investors to explore alternative platforms. While this could potentially benefit Solana, the network itself has yet to showcase substantial growth factors that could catalyze a new wave of adoption and investment.\n\nSolana's recent outages and network instability have dampened the sentiment around the project, causing concern among potential users and investors about its reliability. These technical challenges need to be addressed for Solana to regain its footing and become a viable competitor to Ethereum once more.\n\nDogecoin faces fierce resistance\n\nDogecoin has encountered what may be considered its nemesis resistance at the $0.08 level. This price point has proven to be a formidable barrier and acted as a point of reversal during the previous run.\n\nDogecoin’s price chart indicates that while the asset has encountered resistance at $0.08, it has shown a commendable ability to break through previous resistance levels. The resilience of Dogecoin’s price can be seen in its recent approach to this threshold, as it edges closer to a potential breakout. The momentum behind Dogecoin, supported by an increase in volume, suggests that the asset may indeed possess the strength to push past this key resistance level.\n\nSupport for Dogecoin is currently established at the $0.075 level, where the cryptocurrency previously found buying interest. If a reversal were to occur, this support zone could be the first to be tested. A breach below this could see further support at lower levels, potentially around the $0.07 mark, where the 50-day moving average lies.\n\nThe Dogecoin network and community are experiencing a resurgence of activity, partly due to the celebration of Dogecoin's 14th birthday, which has historically been a catalyst for increased interest and speculative trading. Additionally, the potential implementation of Dogecoin on various payment platforms, including X payments (formerly known as Twitter) might become a strong growth factor."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxPU2trQjJ3eGlwbDR2VFJYOVVuQmZxSFE2U1JpMW5tY0JJUUNNc1pqN290NXI3RUpZYW5ZV25vT2VLMlJ0VlRPcHcweDlDY3JvNGZhbXBMTU1pWjAtTE5rbFRVN2dWUWFidlhOa1c1MDV1VUQ0UUk3MGNPU2djTWVkMVFneFdkT25DTXlGVndfWTdLMjI3Nk9QVlh0bE5OSEx5WlowVUI2XzR0SlJCRHk4UUZsMFFmZEN1azRIekpxNTI1UzdSNkFhNFlOUzBBOFh5QnhRdmF1WVJVR2k0MUg4OTFFVzBEeGlXOHZTN1RUQU7SAfYBQVVfeXFMTWw2b2k1dHBTT3lnTE11MTNPZlhfcDh6UVJ2M3ZxczhQVHJsTS1OcUtLM3NXaHktdHgwbmp6djJzdnFyeTJRY3pTc3BIbWdCVWFiLUprZ3ZqVkFmU1Qtbjg1YTdRWmNQNnFoXy1JN2xCNXFnVlVobXVJem1WMEg5VUoteXBOeTFxeFM4UXRvVmFKR0xrZGozNjZxdGRneURraTlTT29jMUJzSjlBa3JPTVAyX2FIbkM1TmIxWElpeXJfMzlWM2VoWUdQZHItcmdtS3VhdlZZOGplcGhwUDAxY20yV2tzMkJYemt4aEZ1bWRsTDVDWmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC prepares the stage for a slowly bleeding weekend - FXStreet",
        "content": "Bitcoin (BTC) price continues to lead the market north, with Ethereum (ETH) and Ripple (XRP) prices following the intermediate trend. However, as the apex cryptocurrency faces a formidable blockade, the market could correct soon before the next leg up. Low trading volumes characteristic of weekends is one factor to consider, and volatility is likely to increase over the next two days.\n\nAlso Read: Bitcoin Weekly Forecast: BTC eyes $60,000 but correction looms\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies.\n\nBitcoin price could correct as weekend volatility settles in\n\nBitcoin (BTC) price has made three successive attempts to shatter past the upper boundary of the ascending parallel channel at $53,000. However, the efforts have been futile, likely because of buyer exhaustion as BTC is already overbought, indicated by the Relative Strength Index (RSI) position above 70.\n\nAmid low trading volumes characteristic of weekends, increased volatility could see Bitcoin price drop 5% to the $49,170 support level. In a dire case, the drop could extend to the confluence between the midline of the channel and the upper boundary of the supply zone at $46,760. A break and close below the midline of this order block at $45,554 would confirm the extension of the fall.\n\nBTC/USDT 1-day chart\n\nConversely, with the bulls still having a strong presence in the BTC market, evidenced by the large volumes of green histogram bars in positive territory, Bitcoin price could shatter the $53,000 barricade. In a highly bullish case, the gains could extrapolate 5% to the $55,000 level.\n\nAlso Read: Bitcoin Price Prediction: $55,000 in sight despite overbought state as BTC adversary turns coat\n\nEthereum price to provide another buying opportunity\n\nEthereum (ETH) price is likely to retract, giving sidelined investors another buying opportunity and delaying the $3,000 milestone for a while. The likely target for the drop is the confluence between the horizontal line and the midline of the channel at $2,689, around 7% below current levels.\n\nIn a dire case, Ethereum price could pivot around the $2,600 support, levels last tested on Valentine’s Day.\n\nETH/USDT 1-day chart\n\nOn the other hand, with bulls still at play, Ethereum price could extend the gains to clear the range high at $2,867. In a highly bullish case, the Proof-of-Stake (PoS) token could extend a neck north to the $3,000 psychological level, a milestone last tested on April 5.\n\nAlso Read: Ethereum follow as BTC shows no signs of stopping\n\nRipple price faces strong overhead pressure\n\nRipple (XRP) price is suffering the weight of growing overhead pressure due to the 100 and 200-day SMAs at $0.5889 and $0.5671, respectively. Resistance due to the upper boundary of the descending parallel channel has reinforced the pressure.\n\nIf XRP bulls show weakness, Ripple price could drop to lose support due to the 50-day SMA at $0.5510. An extended fall could send the payments token to the $0.5368 support, or in a dire case, retest the midline of the channel, which coincides with the Parabolic SAR at $0.5000. Such a move would denote a 10% drop below current levels.\n\nXRP/USDT 1-day chart\n\nMeanwhile, with XRP bulls still maintaining a presence in the market, as seen by the MACD position in positive territory, Ripple price could foray north, shattering the roadblocks to hit the $0.6000 psychological level. In a highly bullish case, the XRP price could extend to the $0.6421 resistance level, last tested on December 28.\n\nAlso Read: XRP price could climb to $1 target if Ripple scores another win in SEC lawsuit"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVVZtWWlQUHBOcEMzTVBWZ2VpYWNYQlJacnFOX0gzMFc2MXJIU2U3a0VCZjJSb2xSOXBOR0cxeVJQR21GNld0Nm5val9WTldMMzY5OE1hMmZ4YTNERzJnanRaaWJsTHZBWWRjaF9EWXZvbFNCampYazYwQ19SWFV1dDd3NHo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: Here’s When ETH Could Reclaim The $4000 Level - Watcher Guru",
        "content": "Ethereum (ETH) is following the market-wide rally, surging above $2.8k for the first time since May 2022. ETH has rallied 2.7% in the daily charts, 16.3% in the weekly charts, 23.8% in the 14-day charts, and more than 11% over the previous month. Moreover, ETH’s price has surged by 68.4% since February 2023.\n\nAlso Read: Ethereum Weekend Price Prediction; ETH Eyes $3,000\n\nETH is currently following Bitcoin’s (BTC) trajectory. BTC’s latest rally could be due to increased inflows into spot BTC ETF (Exchange Traded Fund) investment vehicles. However, ETH is still down by over 40% from its all-time high of $4878, which it attained in November 2021.\n\nWhen will Ethereum (ETH) reclaim its all-time high?\n\nAccording to CoinCodex, Ethereum (ETH) will breach the $3000 level by next week. The platform anticipates the second-largest cryptocurrency to hit $3078.45 on Feb. 22, 2024, a rise of about 7.9% from current levels. However, CoinCodex predicts ETH to fall below $3000 soon after.\n\nAlso Read: Ethereum Shock: $113K Gas Fee Spree Leads to Crypto Catastrophe\n\nChangelly anticipates Ethereum (ETH) to reclaim its all-time high in 2025. The platform predicts ETH to hit a maximum price of $6,263.37 next year, a rise of nearly 120% from current levels.\n\nTelegaon, on the other hand, anticipates Ethereum (ETH) to reclaim its all-time high in 2024. The platform predicts ETH to hit a maximum price of $5,054.04 in 2024, a rise of over 77% from current levels. However, the platform does not clarify which month ETH could reclaim its all-time high.\n\nHowever, there is a possibility that ETH could reclaim its 2021 peak very soon. There is a lot of talk about the US SEC (Securities and Exchange Commission) approving a spot ETH ETF later this year. A spot ETH ETF, along with BTC’s halving in April, could usher in a bull run for the crypto market."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWGFzdW52dnMwRHVmNTZpZE5FcGpBSmFjbFZSNEFyQVllU0dWUG5pVUtDX2wtQlVFdkpuS1otUkdENHRyWEIzZkZzbkhWV1FQRDJoWlZrUFJsLUlUMTY1WFJlUGU0bmhSVlRVZVlUMG9sbVZ0RHQzTmRKOEhQNUktTTNPWXNtUXpoZHkyOHp30gGTAUFVX3lxTE41bG13YzBVVHhFVGhqc1g5VkFpcTF3UEZYcWlCamItM1N5SHdpWjRfeDhfYzByU3Jnc3lIQ0ZtY2ZoSTk2V3pINGtKX28yU2hLSGlNMWhvOXpldFF4VUY4SVVCb3JlS0NXblhvODZDZWI1OUZBSzVnVm5aVzNTNTVRZjdwQlg2OFNEU184SWdmLWV0cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Ethereum to $2.5K or $3K? What ETH price predictions suggest - AMBCrypto News",
        "content": "The unique active addresses metric was yet to break out of a two-year downtrend.\n\nAnalysis of the liquidation levels showed ETH bulls could be in for a surprise.\n\nEthereum [ETH] has traded within a range since mid-December. This range extended from $2116 to $2614, and its mid-point at $2365 has served as a significant horizontal level over the past ten weeks.\n\nOn Monday, the 12th of February, Ethereum bulls achieved a daily trading session close at $2659, above the range highs. Since then, short liquidations have also increased as prices continued to soar.\n\nAnalyzing whether the active address count spurred this rally\n\nA massive uptick in unique active addresses accompanied the 2017 and 2020-21 bull run. Moreover, beyond November 2021, when the active address count began to decrease, ETH bulls made an attempt to push prices past the $4k mark. They were met with failure.\n\nThe current rally that Ethereum is on stretches back to October 2023. The 7-day Simple Moving Average (SMA) of the active addresses shows a gradual uptrend, according to data from CryptoQuant.\n\nHowever, considering the past two years, the metric has not set a series of higher lows and higher highs. Therefore, a true uptrend on the higher timeframe was not yet established for the active addresses metric.\n\nYet, ETH prices reached a high not seen since May 2022. This suggested that the coming months and years could see users flock to the Ethereum network alongside an enormous increase in demand, and subsequently, price.\n\nThe derivative markets showed intense bullish sentiment\n\nAMBCrypto analyzed the Open Interest (OI) data of the past three years from CryptoQuant. The higher timeframe uptrends have been accompanied by a sustained uptrend in the OI, showing bullish sentiment amongst speculators.\n\nSince October 2023, the 7-day SMA of the OI rose from $1.7 billion on 1st October to stand at $6.74 billion on 15th February. The climbing OI alongside the rally meant bullish conviction remained strong in the futures markets.\n\nThe Liquidation Levels Heatmap from Hyblock was examined to understand where the next areas of interest lay. AMBCrypto noted that the $2730-$2835 pocket was breached. This zone was estimated to have multiple liquidation levels measuring anywhere from $10 billion to $15 billion.\n\nETH would likely face a rejection near the $2900 mark after sweeping these giant liquidity pockets. The liquidity near $3000, based on the six-month look-back chart above, was scant. A deep retracement back toward the $2000 zone to take out the liquidations there made sense.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt was unclear if this bearish move would materialize, given the strength of bulls in recent weeks.\n\nA move below $2500 would be necessary to give credence to expectations of a drop to $2000. Until then, a drop toward the $2500-$2600 region would present a buying opportunity."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQN1ZfbG5kU1QtbEhOYzR3bVFxYTIzem9XLW1LTlEwZ2EwQ2xDUmNVQnZBempTLWt4Vy1XeWZvLWRma1ZxTkFJSnNpS20xeTNrRUJzdHVIQV8yNGtQZldfaXdEZVVlLTdxV1RuWUQ3N0cyaDc1a0NrWG1USzllZzJJaHNPaUdOUlczbEEweC1vS2V6ZFF0Tklj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "BTC and ETH safe from 51% attacks, Coin Metrics cites using cost barriers - crypto.news",
        "content": "Crypto intelligence firm Coin Metrics has revealed in its latest research that it has become impractical for nation-states to dismantle the BTC and ETH network through 51% attacks, given the prohibitive expenses involved.\n\nA 51% attack involves gaining majority control over a network’s hash rate in proof-of-work systems like Bitcoin or staking in proof-of-stake networks such as Ethereum, allowing for possible manipulation of the blockchain.\n\nThe study, conducted by Lucas Nuzzi, Kyle Waters, and Matias Andrade of Coin Metrics, introduces the “Total Cost to Attack” (TCA) metric to estimate the expenses involved in such malicious activities. Their findings suggest that attacking either Bitcoin (BTC) or Ethereum (ETH) would not be financially feasible or profitable for attackers, essentially nullifying the incentive for such actions.\n\n9 We also find no ways for a nation-state attacker to continuously run a 51% / 34% attack if the goal is to destroy these networks.\n\n\n\nThe possibility of retaliation techniques makes ideologically driven attacks costly at each retaliation round.\n\n\n\nIn the end, the network survives. — Lucas Nuzzi (@LucasNuzzi) February 15, 2024\n\nFor Bitcoin, the attempt to gain control would necessitate acquiring around 7 million ASIC mining rigs, an investment of about $20 billion. However, the market lacks the availability of such a vast number of ASIC rigs, and even if a potential attacker decided to manufacture them, the cost would still exceed $20 billion.\n\nProducing S9 mining rigs would incur costs exceeding $20 billion | Source: Coin Metrics\n\nThe scenario renders the attack not only impractical but also economically inefficient, with the most advantageous double-spend attack yielding a mere 2.5% return on a hypothetical $40 billion expenditure to gain $1 billion.\n\nYou might also like: Coinbase limits Zcash trading as ViaBTC poses risks of 51% attack\n\nEthereum faces a similar situation with its transition to a proof-of-stake model, where the report evaluated the feasibility of a 34% attack by Lido validators. The analysis concluded that any attempt to compromise the Ethereum network using Liquid Staking Derivatives (LSDs) would be both costly, exceeding $34 billion, and time-consuming, taking up to six months due to the churn limit, which restricts immediate stake deployment.\n\nAttacking Ethereum with LSDs would cost over $34 billion | Source: Coin Metrics\n\nAdditionally, the logistical challenge of managing over 200 nodes and incurring significant expenses, such as $1 million on Amazon Web Services, further diminishes the plausibility of such an attack.\n\nNic Carter, a partner at Castle Island Ventures, commended the report for providing a detailed and empirical examination of the impracticality of 51% attacks on these leading cryptocurrency networks.\n\nHe noted that previous analyses lacked the concrete, data-driven approach seen in Coin Metrics’ research, marking it as a pivotal contribution to understanding the security and resilience of Bitcoin and Ethereum against potential nation-state-level threats."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOd2piak55UzZ4ZGt3RWR6UWxXLUw4bzllRXAwTGxCR0NvQWdIdTNoSGtpX2JxOFdVUFJzdDZVc2wyc2RaVnhyZmljdGNfcFlvTG82a20wbjBUbEZKOWNnNG5ENTdKbzFPMENqdjJCaU5uRGFaRmF1TEJrUjRlZGxTOFJyVVJHMGVIR2paS1QzbXBXSHdzdUZyZDVEN1ZqUG4yZ1VQb3cySVlYSmhW0gGyAUFVX3lxTE1QNVZBbGtPVWtlcVRhRG9iandKbGFuY0o4bWN2RUVoNUViOHUtcFRuQzh5V0t3cl9WeGttU19NUHNua1VJcElHdVZ0eHhvU1FxR081bnViM1M0SkRQZDUxSEJDdTZXdFJHTFB2czA2S05RUWVmeFRBaUkwRVg2aEZNTmRySVgxLThoZzFaTkdDaVR4ajRIUEdWNmtLTW5hTEl1TG1KYlpHc0JMYWNuM20yMFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Beyond ETFs: Crypto Is Going Mainstream with Big Partnerships - Finance Magnates",
        "content": "There’s plenty of talk recently about crypto going mainstream, triggered especially by events around spot bitcoin ETFs in the US. These products were approved and launched in January, which is significant in itself, but what has followed is a hugely impressive start, which has seen net flows for all BTC ETFs cumulatively surpass $3 billion, while two of the funds (IBIT and FBTC) are already–despite being only around a month old–in the top ten funds for year-to-date flows.\n\nBitcoin Spot ETF Flows\n\nThe ETFs are center stage and demand has been relentless, but there are further indicators suggesting that crypto is coming in from the cold, with a series of recent announcements regarding tie-ups between crypto products and mainstream, well-known companies.\n\nEthereum Name Service and GoDaddy\n\nEthereum Name Service (ENS) has been around since May 2017, and is a domain name service operating on Ethereum Ethereum Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Read this Term. What that means is that an Ethereum wallet address (which looks like a long, random string of numbers and letters) can be mapped to a readable, ownable domain name on the Ethereum blockchain Blockchain Blockchain comprises a digital network of blocks with a comprehensive ledger of transactions made in a cryptocurrency such as Bitcoin or other altcoins.One of the signature features of blockchain is that it is maintained across more than one computer. The ledger can be public or private (permissioned). In this sense, blockchain is immune to the manipulation of data, making it not only open but verifiable. Because a blockchain is stored across a network of computers, it is very difficult to tamp Blockchain comprises a digital network of blocks with a comprehensive ledger of transactions made in a cryptocurrency such as Bitcoin or other altcoins.One of the signature features of blockchain is that it is maintained across more than one computer. The ledger can be public or private (permissioned). In this sense, blockchain is immune to the manipulation of data, making it not only open but verifiable. Because a blockchain is stored across a network of computers, it is very difficult to tamp Read this Term. Up to now, though, ENS domain ownership has been relatively niche, with distinctive .eth domain names common in crypto circles (or among Ethereum devotees, at least), but still–from a wider perspective–limited in adoption.\n\nAs such, it looks significant that ENS has now partnered with GoDaddy, one of the biggest names in regular (non-crypto) internet naming services and web hosting. With over 20 million users, GoDaddy is highly recognizable, and so a shift towards crypto–and Ethereum specifically–is worth noting, keeping in mind also that applications for spot ETH ETFs are currently being processed by the SEC.\n\nAdditionally, it's important to remember that ENS was never a direct competitor to GoDaddy and similar services, since the Ethereum-based product was not intended to supersede the standard Domain Naming Service (DNS). Rather, the intent was to work in parallel alongside regular mechanisms, and the ENS/GoDaddy collaboration underlines this ambition, providing easy inter-connection between Ethereum and established web architecture.\n\nDNS has been the internet's backbone for 40 years, but blockchain-based identifiers face limitations. Can supporting them with DNS create a more secure and integrated solution? Find out here:#DNS #Blockchain #InternetEvolution\n\n\n\nhttps://t.co/QmjiUaKdE7 — GoDaddy (@GoDaddy) February 10, 2024\n\nThrough GoDaddy, users will be able to connect a standard DNS domain name with an Ethereum wallet address (just as ENS provides a connection between ENS domain name and wallet address). What’s more, Ethereum gas fees (which vary and can at times be very expensive) are cut out of the equation through a mechanism called Gasless DNSSEC, which may be a critical factor, since excessive gas fees can be an obstacle to bringing on board new Ethereum users.\n\nMetaMask and Robinhood\n\nWhen it comes to crypto hot wallets, browser-based MetaMask–with well over 22 million downloads since it launched in 2016–is the dominant product, allowing users to hook up permissionlessly with DEXes, NFT marketplaces, and anything else web3-related.\n\nAnd when it comes to online stock trading aimed squarely at retail participants, Robinhood is among the most dominant platforms, with around 11 million monthly active users. Since 2018, Robinhood has also supported crypto trading, and so it now follows coherently that the trading platform has announced a partnership with MetaMask.\n\nWhat makes this connection stand out is that MetaMask is a self-custodial wallet option, meaning that users are holding their own assets without the need for a third party. By integrating with MetaMask, Robinhood is allowing users to buy crypto assets through Robinhood itself, but to custody them in their own wallets, creating a crossover between the centralized platforms of the regular web, and the more self-reliant ethos that is central to web3 and crypto.\n\nAnd again, as with the ENS/GoDaddy partnership, we’re seeing crypto-native products seeking not to replace existing companies and ways of operating, but rather to work alongside them and establish connectivity.\n\nThe MetaMask/Robinhood partnership also establishes further on-ramps from traditional finance and fiat currency, to web3 products and crypto, potentially enabling broader crypto adoption. However, viewed alongside the new BTC ETFs, there’s a key difference at play, as the ETFs enable exposure to bitcoin without needing on-ramps, while Robinhood and MetaMask are making it easier for users to actually hold their own crypto, which can then be put to use in decentralized applications.\n\nTransak and Visa\n\nIt was reported at the end of January that global payments giant Visa is entering into a partnership with crypto payments firm Transak. Again, this collaboration works to provide accessible connections between fiat and crypto, easing friction around off-ramps, and in the process solving a recurring concerns around crypto ownership: the need to be able to cash out easily when required.\n\nThe Transak/Visa partnership will enable real-time card withdrawals (from crypto to fiat), and remove complication around local crypto regulations, due to Transak’s compliance with rules and regulations around the world, and its multiple licenses allowing operations in a variety of global regions.\n\nHere again, then, we have traditional finance and crypto (or, perhaps, web2 and web3) each playing to their respective strengths while moving towards integrated cooperation. This appears to be mutually beneficial for both sectors, and in that case, we shouldn’t be surprised if there are further partnerships still to come between traditional firms and crypto products."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOYkxhYkRvb3FhQTNfeE9xRmZKN2xBenBabkhubE9BVDZucDJzNzN5MTQxX19HdWhSaVBiSkJnaXhtcEg2SE8wZ2hkWEh6SUhQV2hnN25SaG5yN0pzelRkbVJGTmVUSV9hSWtrX2RkM2lCTl9sX284Z2lfSzAza2Exak11SlFvbjNoa25POHJHVUFGbUx2ajFXZGxJajZwbDhoek96cg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Loses Its Strong Momentum Heading into the Weekend - FX Leaders",
        "content": "eth-usd\n\nFriday is the first day Ethereum (ETH) has been down all week, and the crypto coin is falling 1.93%.\n\nETH is now down to $2766.92 (ETH/USD) after a week of going strong. The token is still up 10.82% for the week, but it has started to lose some of its gains, dropping from $2,841 to its current level in a matter of four hours. In that period, the token lost 2.6%.\n\nThis rapid drop could mean that Ethereum is in for more decline over the rest of the day and perhaps into the weekend as well.\n\nOn Monday, Ethereum started to gain momentum and moved from $2,824 up to 2,854 at its peak this week. The coin’s high point was Thursday, and it held onto its gains into Friday morning until the bears got ahold of Ethereum. It appears that those ETH gains are now being cashed in. As the price declines, ETH’s trade volume is dropping rapidly, down 21% over the last 24 hours.\n\nBitcoin’s Strong Performance\n\nBitcoin (BTC) also dropped today, after a strong week that parallels Ethereum’s performance week in a lot of ways. That leading coin started to climb sharply Tuesday as well, though the bulls were already busy with it Saturday.\n\nBitcoin climbed high this week, starting off Sunday at around the $48,000 level and going as high as $52,706 before the gains started to slow and the momentum tapered off. Bitcoin has been erratic today, moving between highs and lows as investors wait to see what will happen.\n\nBecause of its recent strong performance, many industry insiders are expecting Bitcoin to move higher very soon. They may just be in for a flat or declining weekend first.\n\nBitcoin had a rough January but has been on the rise through most of February, indicating that it could be headed to a much higher level very soon."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOQzAxRWw4bnBLZHhVbkhjeWsxRkZCMzFUV3FGUU9xR2NLMFF4NGNxTVZLUlNuVmZuc0dkdVdJR05LUTFYRVkwcHAyWldnY3dtWWNBMmszSDVyXzlNWERHQ1lkUlEtMXpPN3N0V2ZDaG5GSnBQT3RqYlRlanJIYXctVjlJSGFGU1FKblNtNHNLZGxidm1DNWR2RFRWbmtWOU9NVldiODVoUS0tT0htTVlZQmstUXA2Szhhb3NrSTN30gHLAUFVX3lxTFBadUh1dWVvdjhqSlhKMkxLRF9NX00yQlBCNXpiREVaY3pRRE5MT1ZVZ2YzMUZFY2dYWWFpejYxOUstMmFteG5fR2VXRFZYNXpvcUlNS1ZZLXhVZ1h3UncwUVZoQ2VYNWdWb1AyRTBTc2ItaU5QSWxib3l3b2dwSXIwSHNMLUMxSnJrOHp5ZkowdW43NnBURWFjODVLMTJUNy15XzEzUGRUdjVGVHMyVWNUc3c2OG4zNG9XX2FUeEVKcklJNzA1andsbHdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Rises Above $2,800: What’s Driving the Rally? - Analytics Insight",
        "content": "The bullish sentiment surrounding Ethereum (ETH) is being driven by several key factors, with one of the most prominent being the increasing popularity of ETH staking. As Ethereum 2.0 gains momentum, more investors are choosing to lock their ETH into staking contracts. This not only allows them to earn passive income but also reduces the available supply of ETH in the market, creating scarcity and driving up the price."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPbXlwRTJtRXNZeVgtRjF1S2ZZUkE2blJRRzhkaDFZX2wzdmNrWVJ5dVJORlI3QktQQ3pEQ1hyVGJyTDJDWENMcmdaakR4dFl3Rk5jTlJIRFJ3b3A1TGVFVy0yZzFCaFV1MThuck1pajVoeWJYRWRCa0FxWFZ6bC1LajV0X3ZTN0pHS0s4TUxqaXUxQlkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: This is how this blockchain skyrocketed DeFi's TVL! - Cointribune EN",
        "content": "Fri 16 Feb 2024 ▪ 7 min read ▪ by Luc Jose A.\n\nThe Total Value Locked (TVL) in the context of decentralized finance (DeFi) defines the total value of assets locked in DeFi protocols and smart contracts. In other words, it measures the total amount of cryptocurrencies locked and utilized in various decentralized financial services. These services include liquidity pools, borrowing and lending protocols, decentralized exchange platforms (DEXs), among others. TVL is often seen as an indicator of the popularity and adoption of different DeFi protocols. It acts as a barometer of this crypto ecosystem. Indeed, according to recent data, DeFi’s TVL is at the peak of its form thanks to the dynamism of Ethereum. This article explains the ins and outs of this trend.\n\nDeFi at its Highest Level in 20 Months Thanks to Ethereum!\n\nDeFi is experiencing a robust resurgence, marked by a substantial increase in its total value locked (TVL). This is shown by recently published data by crypto platform DefiLlama. According to it, the DeFi’s TVL has exceeded $69 billion, reaching its highest point in the last 20 months.\n\nThis resurgence is not limited to any specific blockchain, as various protocols from different networks contribute to the upward trend. Most notably is Ethereum. In just the past month, Ethereum’s TVL has jumped an impressive 37 %, reaching about $41 billion at present.\n\nThis increase can be attributed to the influential role played by protocols such as EigenLayer, which have contributed to a significant influx on the Ethereum network. Concurrently, Ethereum’s native crypto, Ether (ETH), has witnessed a remarkable rise, with bullish sentiments aiming for the $3,000 mark as the next target. A spike that coincides with the announcement by Franklin Templeton of its plans to launch an Ethereum Spot ETF, reinforcing the positive trend prevailing in the market. But then, what are the blockchains that are positively impacting DeFi’s TVL, besides Ethereum?\n\nThe Key Role of Solana and Arbitrum in DeFi’s TVL Rise\n\nAccording to data, Solana and Arbitrum have played a major role in increasing DeFi’s TVL by attracting significant attention and substantial investment flows.\n\nIn February, for example, Solana experienced a remarkable increase in its TVL, which reached $1.90 billion. It’s Solana’s highest TVL since mid-2022. This increase follows a substantial upward trajectory. Solana’s TVL soared by 47 % in the month of January alone and over 500 % since October 2023.\n\nThe dynamism can be credited to platforms like Jupiter, Kamino, and Jito. They are indeed the key catalysts that have attracted considerable capital into the Solana ecosystem. Not to mention, the phenomenon of airdrops has triggered fervor within the crypto community, further consolidating the inflow of funds into Solana-based projects.\n\nSimilarly, Arbitrum, a layer 2 scaling solution designed for Ethereum, has seen a notable rise in its TVL. It reached a record level of $2.9 billion. This increase is attributed to the involvement of key protocols such as GMX, Hyperliquid, and Camelot, which have significantly contributed to Arbitrum’s growth.\n\nThe simultaneous rise of Solana and Arbitrum underscores the increasing importance of level 1 and 2 solutions in the crypto landscape. Indeed, these platforms not only offer scalability solutions but also provide a fertile ground for the development of innovative projects and decentralized applications (dApps). Interestingly, even the Bitcoin network has played a role in the increase of DeFi’s TVL.\n\nThe Unexpected Contribution of Bitcoin to the Surge in DeFi’s TVL\n\nTraditionally, the Bitcoin network is not associated with decentralized finance. However, its influence on the recent dynamism of DeFi’s TVL is noted by experts. Over the past month, the TVL of Bitcoin-based DeFi has experienced a remarkable increase, reaching $927.5 million. This represents an impressive rise of 182.9 %. An increase attributed to the emergence and adoption of protocols such as Merlins Seal, Lightning Network and Thorchain.\n\nThe expansion of DeFi’s TVL across various blockchain networks highlights something significant. Namely, that this segment of crypto is experiencing sustained evolution, marked by a transition towards a multi-chain paradigm. This development underlines the growing importance of interoperability within the blockchain ecosystem and indicates the broader acceptance and integration of DeFi principles.\n\nFurthermore, the remarkable growth of DeFi’s TVL across the Bitcoin network is revealing of the burgeoning relevance of BTC. This goes beyond its role as a store of value or means of exchange. While it is commonly regarded as an autonomous crypto, the integration of BTC into DeFi highlights its versatility and adaptability within the crypto ecosystem.\n\nMoreover, the success of Bitcoin-based DeFi protocols signals a paradigm shift in the perceived utility of the leading crypto. BTC is no longer just seen as a digital currency. It is now recognized as a viable platform for decentralized financial applications. This contributes to the diversification and expansion of the DeFi ecosystem as a whole.\n\nConclusion\n\nIn conclusion, analyzing the dynamism of Ethereum and its impact on DeFi’s TVL reveals a positive evolution in the crypto ecosystem. The recent increase in TVL, marked by the essential contribution of Ethereum, Solana, Arbitrum and even the Bitcoin network, demonstrates the emergence of a multi-chain paradigm in decentralized finance. The increasing integration of Bitcoin into DeFi also underlines its versatility and relevance beyond its traditional role. This phenomenon sheds new light on the perception of the Bitcoin blockchain as a viable platform for decentralized financial applications, which serves to contribute to the diversification and expansion of the DeFi ecosystem in its entirety.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPa3pBSWpCTV9QX3lwRjd6ZWpPUjl3QlV1OXRMMHVZUUtkajVWOEFpU2J2ZkFPazlIX3Jid1RYbi1BYWd3MWhpWUpTdHF2NmRzaXRXUjN3Umo2QzlHTFllUGFNdk5SRnFYM0Y1dzhBUFJLN2FjQTM3UElvVWVxZUhSZHJxOEplUkV4WnFDSUVR0gGTAUFVX3lxTE92aDdWNTdTYlgzalVxbDR1OGJqNl9xRks2YXVYSVc1TldDU29rMUd5YmU2b2hOT2pMSFJQUExMSzBXY0hKODZMWjVoaTQtZWxjcmRZYzh4YmFqckxiR0t6MVA1LWd3Uzdhcmt5Z0M4UVBRbEFWSlk4dENvdnRFQjBqQ2xnQklEV0lNTXEzR3RPS0s2bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Ethereum gas fees hit $84M last week, thanks to the ERC-404 hype - AMBCrypto News",
        "content": "Gas price paid per transaction bounced to levels last seen during the memecoin frenzy of May 2023.\n\nETH witnessed a minor retracement in the last 24 hours, dropping below $2,800.\n\nTransaction costs on Ethereum [ETH] rose to a 9-month high, spurred largely by the hype in the experimental token standard ERC-404.\n\nUsers make a beeline for ERC-404 transactions\n\nAs per on-chain analytics firm IntoTheBlock, the network collected a total of $84 million in gas fees the past week, marking a 61.5% jump from the week before.\n\nIn fact, average gas price paid per transaction bounced to 71 Gwei on the 9th of February, according to AMBCrypto’s analysis of Glassnode’s data. Such levels were last seen during the May 2o23 memecoin frenzy that saw the emergence of Pepe [PEPE] token.\n\nThe spike came in the days following the launch of the first functional ERC-404 project, Pandora, which has seen extensive demand lately. As of this writing, the Pandora token was up 270% since its launch, according to CoinMarketCap.\n\nFor the curious, ERC-404 is a unique token standard, which combines the properties of ERC-20 (fungible tokens) and ERC-721 (non-fungible tokens). As a result, tokens under this standard are both fungible and non-fungible at the same time.\n\nA special use case of this not-yet official token standard is that it can be broken down into fractions, effectively allowing multiple users to collectively own a single NFT.\n\nAn X user with a pseudonym PopPunk, who also happens to be a co-founder of gas auditing firm, stated that an average ERC-404 transaction required three times the gas required for an average NFT transaction. It was evidently clear that ERC-404 tokens were costing users a bomb.\n\nMeanwhile, AMBCrypto also observed a spike in daily on-chain transactions over the week, to the tune of 17%. In fact, about 1.15 million transactions were settled on the 16th of February, the highest for the month.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nETH pulls back but market appetite grows strong\n\nAs of this writing, the second-largest crypto was exchanging hands at $2,790, according to CoinMarketCap. ETH witnessed a minor retracement in the last 24 hours, dropping below $2,800.\n\nThe broader market sentiment was one of “extreme greed”, as per the reading from Ethereum Fear and Greed Index, suggesting substantial FOMO among market participants."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimgJBVV95cUxOak1kc2xpTUJ3Tkd6RUEwekdKbnlzRDRpZkVvalk5MVh2X09GT2wzM1FhNTM1VVBSajJ6SFYxX2NVakx2VVRlSk01OWh4WDR4M1pGQmo5bWhIdXFQakptZGdyY3hPVF83V1hRcGhKOFdkRTJMZllUT3NNVHM2UDdhdHplVFJoNkFFTnd5YVhWN2pVRlB6cTJsOW1oR1c4QzRiakVRVHRnZnYxZXFJUTJ5cWlNck5wZTdwODc0OTJ2X3VwckRlODdxeXU0ZjJQdFhLQzdOczFwdjl6aExLcnFTS2dIYVNQZVN0RzZmSmc2eExENzVVYmJoajV0cFdwMllkd2RfLVFxYzcta3YzZm5wN1JpMldGN21kbEHSAacCQVVfeXFMTWUwSUhNMTRKbXhKTzdVMmZBOHU5eV9KWkplX3dlNlhkZndpNW0tWW9FN2tOYzQzak9TRGpwaWF6dDZJV0VsNWJ5aS1WemJiU2hyNXp2dUZ1YU95TEk1WXhsMG5za3ItaTlRa0t4amhxeTU3RGhJUEl4WUZpemhrU2dWZlhhLVNYa2tuS3UxQlpuT21BaGZjNGY2bG9QZm1seWxBUEZndUtfT3ZITTdKWXZZQzdXdkZ4VFU2TllpY2l2RVpRdXZBX1lyZnQ5b3FDMUxNM3pLekdXUzBGZGRzbEkxS0ZRWFlUY1lJRUdsUXJOSXc1ZWM1clNKbXluTDlJNTFyb0VIdVExSWVXRUNKUFNqWThyNmR4RnlqeE5odHdmb1dQdDEzVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Prominent analyst says $100,000 for Bitcoin (BTC) is guaranteed, placing Ethereum (ETH) north of $6000 and Retik Finance (RETIK) at $18 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxONzQ4MFVPWlVEY1ZHU3dfLTJTWm4tSDkwV09UOG4xMzBVOEZzb1JZZE9qNk9sRVlQZEtRR3BiZDF4cTdDNE45bXZVekExNkg2QzBlVzRnd21fY0VGNno1RWp4c1R0Y0NUaWdLVDlHZnl4UXhDWDgxTU1WWlVLc3BSZkxkQ0U1Q3h5SGNRbERjbUhYQjhQQ3V4RnFGY3ZSemtlMXk0SHlKUUtLb3FLQjdsVk4tTmFxTXlNbkExeFpB0gHEAUFVX3lxTE1OWm5MeDRjazM3VWFXUXpSSEwzc242WTBnMXpuMWVZSXc2Q2hiZGxXbC1oNGxRVzRZcklSc1Rmak9URklCa0tESWpTbnRPcTdJOVVSR2Y5N1ZuYVdLd3I2T05FQWx4RlVxZ0JZMTM1Y21hOHp3VENGTWFKbUE5MHM1OGVyMFFSNDhtQ1BveTZIY3J5TUhjQUdnUHlYSlA3RXpwZEpFUGRaUW5lY0tCdV9oNWkwNEU0S09CRktlZGljQmxlV1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Battle of the blockchains: Can SOL challenge ETH? - The Financial Express",
        "content": "By Rajagopal Menon\n\nWhen David Hoffman, an ETH maximalist, narrated his experience of being at a Solana conference on Bankless, he casually emphasised that “Solana is not Ethereum, and it’s tiny”. Of course what he referred to was the market size of Solana vis a vis Ethereum, thus discounting the bullish narrative around SOL which according to him, is a community-built scenario on X(formerly Twitter). It sort of begs the response which was also a famous quote from the TV series Game of Thrones – “a very small man can cast a very large shadow.”\n\nBitcoin has minimalist functionality. It was designed for store of value and transfer of value. To overcome these limitations, a 19-year-old Russian developer Vitalik Buterin, wrote a new language and developed a new programmable blockchain called Ethereum. Blockchains become programmable when equipped with highly expressive programming languages that are nearly Turing-complete. Expressive languages facilitate the creation of code that is easily comprehensible. Turing completeness implies a system in which a program can be formulated to find solutions, allowing the program to execute a wide range of tasks using its codebase. Presently, Ethereum stands out as the most widely adopted programmable blockchain. With an early mover advantage, it was one of the first blockchains to facilitate and spread awareness of building applications and utility for crypto. It’s no surprise that Ethereum’s total value locked (TVL) has surpassed $20B at the moment.\n\n\n\nAs soon as applications started being built on blockchain, the Twitter community backing Vitalik’s visionary crypto project was present to remind anyone and everyone that Ethereum network was the place to be. Even today if a newbie considers building a product on blockchain, they would do their research on Ethereum before getting spooked by the high gas fees that have created hurdles for the network. This would then prompt them to look for more cheaper options, and the ever active messaging platform X, with Shib and Doge armies would make him/her consider Solana. It’s like your elders advising you to put your money in the same retirement fund that they invested in versus your peers encouraging you to go for low ticket investments which could bring high returns without putting a dent in the pocket.\n\n\n\nSolana’s TVL of $600M seems miniscule compared to Ethereum and might not look like an apple to apple comparison. However, we must remember that Ethereum started out like Solana when Bitcoin was the OG Crypto and eventually made its way up to the top of the charts, second only to BTC. As of now, Solana has secured its position in the top 5 tokens by market capitalization. This is a more constructive insight compared to TVL since it indicates a steady interest in capital inflows on Solana network in the last three years. While most have been attributed to the success of memecoins, frequent airdrops, robust community building and engagement, its price movements have also shown signs of promise. It pierced the 2% dominance mark on the charts in December 2023, an indicator of a bullish phase according to historic patterns.\n\n\n\nSolana seems to have cracked the code in terms of scalability and network efficiency with high TPS and low gas fees. This has largely contributed to building traction among developers who want Web3 to live up to its hype and produce dynamic results with exceptional capabilities, resulting in over 100 dApps being built on Solana. It could have been higher if the FTX fiasco didn’t occur at all. Solana is now boasting around 2500 active devs monthly, with a retention rate of 50%.\n\n\n\nIn 2023, Ethereum’s rollups saw success with the implementation of new frameworks by Layer 2 solutions like OP Stack, Arbitrum Orbit, and Polygon’s CDK. These helped the launch of new chains, functioning as either Layer 2s or Layer 3s. While Ethereum has more than 500 dApps running on its network, with over 5000 devs, it could see a contender emerge in Solana because of the new age DeFi apps being built, lucrative for crypto enthusiasts and their need for an instantaneous avenue for products they choose to engage with. Ethereum’s transaction fee of $1.149 is quite steep not just for developers but traders as well. Even though interest on the network continues to grow especially after the transition to Proof of Stake, it is slowly starting to look like a network for crypto veterans as compared to the new entrants.\n\nAlso Read Mumbai Local Train Update: Indian Railways working to increase frequency of trains, set to reduce wait time from 3 to 2.5 minutes Centre may sell part of residual stake in HZL in FY25; Move follows promoter Vedanta’s recent OFS Mumbai-Ahmedabad Bullet Train project: Over 175,000 noise barriers installed on 87.5 km viaduct Indian Army’s Bold Mission: Using Veterinary Care to Defuse Ethnic Tensions in South Sudan\n\nThe fact that Solana has reached the top 5 token list on the chart and also presents a potential for catching up with Ethereum’s market cap, indicates immense scope of its price increase in the next couple of years. But if Ethereum is too worried about Solana touching its tail, it has ETFs coming its way which could further boost its price and market cap, giving them some respite from all the buzz around SOL.\n\nVitalik has been the bigger person in blessing Solana with success in the past but it could also have been a gross underestimation of its potential which the industry couldn’t have foreseen. The colossal growth of Solana in 2023 has drawn developers en masse. With transaction fees as low as $0.00025 per transaction, it’s the go-to for launching fresh blockchain projects and DeFi apps. New devs with limited resources lean towards Solana for its enhanced transaction speed, lower gas fees, and superior scalability – the golden trio for any web3 dev. Solana is the ‘new age’ blockchain, offering amenities for NFTs, in-app transactions, and seamless payment settlements.\n\n\n\nEthereum, holding the second-largest market cap, often masks certain network drawbacks like gas fee and less scalability. Ethereum loyalists argue its matured ecosystem can weather volatility and security issues, making it the choice for stablecoins and real-world tokenized assets. Ethereum is quite omnipresent in the crypto ecosystem, especially for DeFi and metaverse stakeholders who somehow find themselves directly or indirectly in contact with ETH.\n\n\n\nIn the upcoming bull run, amid positive developments, both networks stand to gain. Solana could host new projects appealing to crypto newcomers, backed by solid sustainability plans and ample capital from improved VC funding sentiment. Institutional crypto investments, boosted by ETF launches, will see TradFi institutions building more use cases on blockchains. While Solana and Ripple have secured remarkable partnerships, Ethereum’s trust and credibility positions it as a major contender for the new wave of products in collaboration with traditional institutions. Solana isn’t poised to ‘kill’ Ethereum with the current state of events. But, never say never.\n\nThe author is vice-president, WazirX\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiigJBVV95cUxNYnBHWkc0cl9uYVFhMUVFWWhGd3Fva3NZT0R4VmZYVWY3dHBOZENISXZOdUNoRC1oMExSTi1DUmVoV0I0XzBVY3FoTDZvaXRmSnF3Zm1oOW84ZFo0T0g2WmM1RllTRG5ITkU3a2FrSXd0eXlWM2J0M2h2dkNGM1E5R1E1S3Jrc1Y5ZkRHak9DVXJmSklhM2tFci10SDZVNFllS0VtSXlMdUhfYUpIUnhSRm1GVDlidVFWLUFNT2VpY1FOOEptMjhnRG1IRGFsYUE3cEt2S2NUX2lSTnhKTjlrWWEyX3J5YTJSbTRnU1JPY0plS0h4a3B3YldIcVpNeFdMTm05dXd6d3ZfQdIBlwJBVV95cUxNQUMxQlZXbWpPQ1NYcTRCdzVZYUFNYlhOOTEwR0VjZUdOYnFpLUpIdVBtVVdEZm5RNjJNYy01WkNTSFU1SDk2SGRXT1hnUFR2V3MwS1F4ZXRFRjJNTVVQbGY1aDZuT3dsTFpiaDZ2cWkwb09TYmI5cG5xdUNMMFR3eW41eUtwbXl1cHUtMWVHSFpsZFp2blF2ejFzVUVIV3dLLU13MnZ1a281aFFBSVhzNkZNT3dwbGloR1FJT1RDaWZDR2hQQi1PM3prTGVEaU9SQ29za2Fpal9vamtlTHJBRklEQi1aLVhRYTNzNkQwQmY0SThHUzNmVlNlcHNKNG1iVU9tZWVlSkF4VlJ3SjZJa3Q0d2VWcXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Predictions for Bitcoin, Ethereum, Ripple – BTC Aiming for $48,000 Amidst the Lunar New Year of the Dragon! - Analytics Insight",
        "content": "In crypto circles, there has been a lot of buzzing that around the Lunar New Year of the Dragon, it would be wise to keep an eye on tokens that have a Chinese narrative, and in that case, the young Smog Token ($SMOG), a dragon-themed meme coin pops out as an ideal candidate! Also, at this time, it would be wise to grab some of the low-cap altcoins such as Sponge Token V2 ($SPONGEV2) and Bitcoin Minetrix ($BTCMTX), which have been predicted to achieve astonishing success throughout the year!"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPQzhQNGVuUzNLN2ZRUDUtMzYzMGdoZzdLcGtZeUQ0d25hYy1tbzZxYi1PWGh0NUZyWUZFM1E1eVpjUGNZLVphWU9XV3pjQ1FaUFBiczFjTzUxdUc2cl9EQjVnZDJ4LXdwLVJvZXU2TjR5d3pwOTZXRnFhcm9ETHlmRU9nRmNMU1o4aUpMTjVzWGtOV0NSX1hmVllqaUJoT1ZndjYyYWFjNHNxLWFCckJxb2pQSUhNOXdxUVJnRUVnMnhEN1JSUUFUSThtU1B0d1FWNWxDbFVR0gHbAUFVX3lxTE5sOUtLaGpmcXdRM3RaVzY0eWxzU0RVemJkRmZxaFJmWmdXd0ZLWHFVUW1MbWl4dmI0ZmdoVHlfTWMtNTlPeHhOekN4T3MwYXNmdGhRcXg2aG94ZTIwZS1QZllsRklSZTlMMnVBUmNZTzVuV0ZtaXhuMU9rSUNzbUJWU2l2eFhoYWVHSUx1ek1tQ2NnT0xPVWt0QzFHc0FXa05xUXhKdUlzd3J5NHBKaG5XUHJMaTdKalpveVZjeVYwZUZua2JUcG1hN1ZJT2FMdU1iUWtXZFlTSTF3Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 07:25:00 GMT",
        "title": "Pushd (PUSHD) Striking Perfect Balance Between Ethereum Classic’s (ETC) Stability and Optimism’s (OP) Breadth - NewsBTC",
        "content": "Crypto platforms that not only innovate but redefine how we interact with digital assets are increasingly capturing the attention of crypto investors. Pushd (PUSHD), emerging as a revolutionary force, is poised to write the next chapter in the crypto saga, building on the foundational work of Ethereum Classic (ETC) and expanding into new territories explored by Optimism (OP).\n\nEthereum Classic (ETC): The Pillar of Stability\n\nEthereum Classic (ETC) has stood the test of time as a testament to the original vision of the Ethereum (ETH) blockchain, emphasizing “Code is Law.” Despite its origins from a divisive hard fork, Ethereum Classic (ETC) has maintained a steadfast commitment to immutability and decentralized governance, factors that have cemented its position as a beacon of stability in the volatile crypto world.\n\nHowever, as the blockchain space evolves, Ethereum Classic (ETC) faces the challenge of expanding its utility beyond just a secure platform for smart contracts and decentralized applications. The need for adaptation is crucial as new technologies emerge, pushing Ethereum Classic (ETC) to innovate while preserving its core principles to remain relevant in a rapidly changing digital landscape.\n\nOptimism (OP): Broadening the Horizon\n\nOptimism (OP), a Layer-2 scaling solution for Ethereum (ETH), represents a leap forward in making blockchain technology more accessible and efficient. By addressing Ethereum’s (ETH) limitations regarding speed and transaction costs, Optimism (OP) has opened the door for a broader range of applications, from decentralized finance (DeFi) to complex dApps, thus enriching the ecosystem. Optimism (OP) leverages optimistic rollups to ensure transactions are faster and cheaper, yet secure, demonstrating the platform’s commitment to innovation.\n\nHowever, to remain at the forefront, Optimism (OP) must continually evolve its offerings to keep pace with the ever-changing demands of the market. As the DeFi landscape grows and user expectations rise, staying innovative and adaptable will be key to maintaining its competitive edge and driving further adoption within the Ethereum (ETH) ecosystem.\n\nPushd (PUSHD): Striking the Perfect Balance\n\nAmidst this backdrop, Pushd (PUSHD) emerges, capturing the essence of both Ethereum Classic’s (ETC) stability and Optimism’s (OP) breadth of innovation. By creating a decentralized Web3 marketplace, Pushd (PUSHD) directly connects buyers and sellers, eliminating traditional e-commerce barriers like high fees and cumbersome KYC processes.\n\nPushd’s (PUSHD) stage 5 presale, priced attractively at $0.094 has not only attracted attention but also underscored its potential to revolutionize digital commerce and governance. Offering features such as instant deposits and withdrawals, a rewarding incentives program and decentralized governance, Pushd (PUSHD) is not merely a cryptocurrency but a holistic ecosystem designed to enhance digital commerce and participation.\n\nConclusion\n\nIn an evolving digital landscape, Pushd (PUSHD) is setting a new standard by blending Ethereum Classic’s (ETC) proven stability with Optimism’s (OP) innovative breadth. As it carves out a unique niche in the decentralized marketplace, Pushd (PUSHD) is poised to redefine the future of blockchain technology and digital commerce.\n\nFind out more about the Pushd presale at their official website."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQUTd0NlJOMGc2VklabGZYLVloaWsxR0VVaVFBNk1pZEhCUFQ0elh0dlAxODNObHBfLUtrc3JPQ0hPaEM0NkxjSHRlX3NYd0Q5T0Nud3V2S2RWSkEzUnM5eTl6Rm9haGJnZFRsRUZLaTZGTUJYZXdCSUhSdmRlNkpUck1zaDY4R1ZmWXFEY09WcUZtVldCT0ZUU3FDWTJ1VXBkeF84?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Is XRP Really Undervalued? Deep Dive Into the Price and Market Cap Potential - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nIs XRP Really Undervalued? Deep Dive Into the Price and Market Cap Potential\n\nStory Highlights Many believe XRP is currently priced lower than its potential, with some predicting a 957% surge if it matched Ethereum's market cap.\n\nXRP once challenged Ethereum, but legal issues and competition pushed it down to 6th place among crypto assets.\n\nAnalysts offer potential price projections if XRP rebounds, but uncertainties remain.\n\nXRP, currently battling to maintain the $0.57 mark, is considered by many as an undervalued token in the cryptocurrency market. The big question circulating: What if XRP could match Ethereum’s substantial $299 billion market cap?\n\nXRP’s Rise and Fall\n\nXRP once stood as the second-largest cryptocurrency after Bitcoin and held its position until Ethereum surged in 2016. The battle for supremacy continued until December 2017, when XRP’s market cap soared to $95.8 billion, surpassing Ethereum’s $70 billion. Ethereum regained the second spot, and the battle continued until late 2019.\n\nThe SEC lawsuit in December 2020 cast a shadow, impacting XRP’s standing. Despite Ethereum hitting $575 billion during the November 2021 bull run, XRP lagged at $60 billion. Now, it sits at the sixth spot among crypto assets, valued at $28.5 billion.\n\nLosing ground to Binance Coin (BNB), Tether (USDT), and Solana (SOL), XRP faces challenges. Formerly a rival to Ethereum, it now strives for relevance. Analysts speculate on a potential XRP comeback, but uncertainties persist.\n\nProjected XRP Prices\n\nIf XRP were to mirror Ethereum’s market cap at $299 billion, each XRP coin could be valued at $5.53. A staggering 957% surge from its current $0.5727, this hypothetical price would rewrite the token’s narrative, marking a new all-time high.\n\nDreaming big, if XRP reached a $1 trillion market cap like Bitcoin, its potential price could be around $18 per coin. A bold move, this scenario hints at substantial growth for the resilient token.\n\nLooking Ahead\n\nWhile these projections are speculative, they fuel discussions about XRP’s potential and its ability to reclaim a more prominent position in the cryptocurrency market.\n\nCan XRP rise again, reclaiming its historical glory, and find a lasting place in the crypto realm? Keep an eye on this space."
    }
]