[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFA4cWxhX1o4M1FraHplcC1DUDhzOE5ZeTI5MUdBUGxsb190QjRTY1JqN2ZBWlpYZFN0VkU4ZVV2Rl9tQUVNZjdNWXE0OERMWVVkOVJvT3RyY0dyLXljbGtIb2praXdUeWd4ZzhieUtJOWd0emJyeVNReDZtQdIBgwFBVV95cUxOaUxSUVo3QXV2OG43azMtd0p4M3JmMVp3MVhkdGxld2ttTXJ5Tm5RdFpyeGszX3B5V3dJSE0tZHgzdzRZeDNvanh0S3hFTFdsREJyQ3drWjg5UWl2bEpXU2tFZGFqaDJvWkdoNjZ6ZDFoVGlFb3JHLTRFNjF3RE1aeTJKdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "SEC Is Dropping Its Investigation Into Ethereum, Consensys Says - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLeading Ethereum developer Consensys announced late Tuesday that the U.S. Securities and Exchange Commission is “closing its investigation” into the cryptocurrency.\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0,” the company posted on Twitter. “This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nAfter the SEC approved Ethereum spot ETFs last month, Consensys said it sent a letter to the SEC noting that the funds “were premised on ETH being a commodity,” asking how the decision would affect the agency's investigation. (Disclosure: Consensys is one of 22 investors in Decrypt.)\n\nETHEREUM SURVIVES THE SEC. Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nAD\n\nAD\n\nConsensys attorney Laura Brookover separately posted the SEC's notification letter and the company's full statement on the SEC's move to Twitter.\n\n“Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development,” Brookover wrote. “After more than a year, the Ethereum investigation is finally over with no charges against anyone.”\n\nThe SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development. After more than a year, the Ethereum investigation is finally over with no… — Laura Brookover (@laurabrooksie1) June 19, 2024\n\nThe SEC's correspondence, however, included standard language that disclaimed that the notice that it concluded its investigation “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the staff’s investigation.”\n\nAD\n\nAD\n\nWhen contacted by Decrypt, an SEC spokesperson said “the SEC does not comment on the existence or nonexistence of a possible investigation.”\n\nIn April, Consensys went on the offensive, filing a lawsuit against the SEC that claimed the regulator was trying to “seize control over the future of cryptocurrency\" and that it was planning to designate Ethereum as a security. In fact, the unredacted lawsuit revealed, Consensys alleged that the SEC had internally decided on the status of Ethereum a year prior.\n\nThe lawsuit was triggered by a Wells Notice—a precursor to regulatory action—Consensys said it received for its popular MetaMask wallet.\n\nOn Tuesday, Consensys made clear that it would continue to press its case against the SEC.\n\n“In our lawsuit, we also seek a declaration that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws,” the company said. “It should not take a lawsuit to provide the much-needed regulatory clarity to allow an industry that serves as the backbone to countless new technologies and innovations to thrive.”\n\nWhile celebrating the SEC's decision to back off, the company remained staunchly critical of the agency's approach to crypto regulation.\n\n“The closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under SEC’s unlawful and aggressive crypto enforcement regime,” Consensys added."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOblFyU1N5RjJpaTNXYjhCNFVlbjAyQkY4UDdFMVNNUEoxRzQ2MW9abGVhbVRpQ0NGRkxZRlEwd0lsZThSUU9YdU1GTUxjaFRENFhlUFdHeFMzQzN6emZtV01jNGtRVFdyTTNURG95dGJGbUNsQW53QVN3N3dQREg5M0gwOEdwYjJlWFVDSWRUQ2NZSTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "3 Reasons to Buy Ethereum While It's Below $4,000 - The Motley Fool",
        "content": "Is Ethereum on its way to a new all-time high? These three factors say yes.\n\nIn the first half of 2024, Bitcoin (BTC -2.22%) captured the imagination of crypto investors. But don't sleep on Ethereum (ETH -4.27%). Up 54% year to date, it has largely kept pace with Bitcoin, and it has one new catalyst in place that could send it soaring in the second half of the year.\n\nSo this could be the time to put Ethereum on your investment radar. There are three good reasons why it could soar past the $4,000 mark on its way to a new all-time high.\n\nThe new ETFs\n\nThe big catalyst, of course, is the imminent launch of the new spot Ethereum ETFs. If they enjoy anywhere near the same success as the spot Bitcoin ETFs, they could send the price of Ethereum soaring. During the first six months of the year, the spot Bitcoin ETFs pulled in $30 billion from investors, and that is what led to Bitcoin skyrocketing in price by 60%. The current thinking is that the new spot Ethereum ETFs could pull in as much as $3 billion in their first six months.\n\nThe only question, really, is when the new ETFs will start trading. The original consensus was the end of May. That was then pushed back to the end of June. And now SEC head Gary Gensler says it will be sometime before the end of the summer. Maybe by the time you're back from summer vacation, you'll be able to buy them.\n\nEthereum's market dominance\n\nOne underappreciated fact about Ethereum is just how dominant it is in many niches of the blockchain world. From decentralized finance (DeFi) to gaming, web3, and the metaverse, Ethereum is the clear market leader. Its blockchain technology powers so many of tomorrow's most powerful and interesting apps. That means more users, more developers, more active wallets, more transactions, and more cash flows than any other blockchain ecosystem.\n\nCase in point: In the world of DeFi, Ethereum currently accounts for 60% of all total value locked (TVL), one of the most important metrics for blockchain performance. By way of comparison, its chief rival Solana (SOL -4.85%) has only a 4% market share. Other up-and-coming rivals -- such as Sui and Aptos -- barely show up as blips on the radar. Thus, this group of \"Ethereum killers\" could pose less of an existential risk to Ethereum than originally feared.\n\nNew blockchain upgrades\n\nI can't think of another cryptocurrency that gets more attention for its blockchain upgrades than Ethereum. It has followed up The Merge (a massive blockchain upgrade) with a number of smaller technical upgrades meant to make its blockchain faster and cheaper to use. Last year, we had Shapella. Earlier this year, we had Dencun. And now the buzz is building for the next upgrade, known as Prague-Electra.\n\nThere are two reasons these stepwise upgrades are so important. First of all, they make it easier for Ethereum to fend off its rivals. Yes, Solana might be faster and cheaper to use right now, but Ethereum is doing everything in its power to narrow the gap. The ultimate goal is the ability to process 1 million transactions per second, and each new upgrade brings Ethereum closer to this target.\n\nAlso, each new upgrade helps to build confidence in Ethereum's roadmap for the future. Unlike other cryptocurrencies, which often seem to have a helter-skelter feel to their overall development, Ethereum lays out a roadmap at the start of every year and patiently explains how all the steps in this roadmap fit together. I've always viewed this process as similar to the way that publicly traded corporations give guidance about upcoming results.\n\nHow high can Ethereum go?\n\nGiven these three factors, I think there's a reasonable chance that we could be talking about a new all-time high of $5,000 for Ethereum sometime by early 2025. That's a 40% gain from today's price of $3,500.\n\nBut $5,000 may be entirely too low a future projection for Ethereum. It's not hard to find analysts predicting a price of $10,000 for Ethereum. And investment firm VanEck thinks Ethereum is on a rocket to $22,000 by the year 2030.\n\nIn many ways, this depends on how well those new spot Ethereum ETFs perform. If the end of summer comes and they still are not trading, or if new investor inflows disappoint, then it might be time to tamp down expectations. If you are comfortable with assuming that risk, it could be time to start thinking about investing in Ethereum while it's still trading below $4,000."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQUm8zZi0zLVotNW9MX0pxSzlrLUNZYU52ajVXZ2h4cE1ENXp4V0plWUUyWFdTLXV4SmZoRFhwMUFCNVFYcGFwRXZselNxS3g4QUtsdWVxWndPX0RpbnhqTHJieVhKMVkzWGpPdHdndU41cmdudzEyVm5QOFNqdkdhQVZWd1gxb2FtODNEMVd1allPYTBrUm5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "When can investors buy Ethereum ETFs? Here are four clues - DLNews",
        "content": "Eric Balchunas has updated his odds on when spot Ethereum ETFs will start to trade.\n\nBut it’s not the only sign that the funds may start to trade very soon.\n\nUS spot Ethereum exchange-traded funds are almost here.\n\nWhile the official launch date isn’t yet set by the Securities and Exchange Commission, options traders, bettors and analysts offer clues suggesting that they may begin to trade over the next two weeks.\n\n“The general market consensus is that these ETFs will be launched sooner rather than later,” Jamie Sly, communications manager at crypto data firm CCData, recently told DL News.\n\nThat’s huge for the crypto community.\n\nEthereum surged 35% to $3,900 in May after the regulator green-lit the first stage of the applications.\n\nMarket watchers hope the upswing was just the start of a bigger wave.\n\nThe bet is that the final approval will enable the cryptocurrency to break its $4,800 all-time high from 2021 — replicating the success of the spot Bitcoin ETFs launched in January.\n\nSEC’s Gary Gensler\n\nSEC Chair Gary Gensler delivered the first clue during a Congressional hearing last week.\n\nJoin the community to get our latest stories and updates\n\n“I would envision sometime over the course of this summer,” he said.\n\nProspective issuers are working through the final step of the application process.\n\n“That’s working smoothly,” Gensler said.\n\nBloomberg’s Eric Balchunas\n\nFollowing Gensler’s comments, Bloomberg Intelligence analyst Eric Balchunas estimated spot Ethereum ETFs will launch by July 2.\n\n“Decent chance they work to declare them effective the next week and get it off their plate before holiday weekend,” Balchunas tweeted, referring to US Independence Day on July 4\n\nBettors\n\nBettors are also becoming more bullish.\n\nOn betting platform Polymarket, odds that the ETFs will begin trading on July 4 have jumped from 28% last week to 76%.\n\nElsewhere, JPMorgan analysts suggest that spot Ethereum ETFs will start to trade around July and August ahead of the US election as crypto becomes a political issue.\n\nTraders\n\nTraders have poured nearly $240 million into bets that Ethereum will reach an all-time high of $5,000 before the June 28 expiry.\n\n“This positioning is being driven by traders front-running the launch of spot ETH ETFs,” Jake Ostrovskis, OTC Trader at Wintermute, recently told DL News.\n\nCrypto market movers\n\nBitcoin is down 2.1% over the past 24 hours to $65,270.\n\nEthereum is down 2.5% to $3,500.\n\nWhat we’re reading\n\nEric Johansson is DL News’ News Editor. Got a tip? Email at eric@dlnews.com."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13amR4SzFmSDZXZFA2RlVYaUpFdGhpcjVlZmZfVHRUd3B4NXRweklqWEpaU18waWJfNEpXYUJtVW4zdGp2akZGeWlKd3liOGtEcFVNVk1wdi1tSVJiemNTVEtqTU1nY2NvdGlsc1RWUFBLOFZvbHl6aFBoN0w2S1XSAYQBQVVfeXFMUHM3a2pWbHc0SDZnWVBQVHFiZFlJZm55YTFrU2pRcVVtSTE2ZENOTzNmaVUtS1FFTkJ2MzAtNGJZUi1FWG44RVMyV2JzMnQtMDkxaXVpLVdoQ0VTOWZMSTVsV3BTOXViakc5bkxHU0gxWDVidTdCdF84ZTFmQkZsVDNMTTVv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Hit $5,000 After Major Move, Says Top Analyst - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a bold prediction that has captured the attention of the crypto community, prominent analyst Jelle has forecasted Ethereum (ETH) to reach an all-time high of $5,000 by the end of the year. This comes on the heels of ETH successfully turning the $3,500 level into solid support, a milestone Jelle highlighted in a recent tweet .\n\nAdvertisement\n\nCurrently, Ethereum is trading at $3,540, reflecting a slight decline of 0.33% over the past 24 hours. Despite this minor dip, there has been a significant increase in trading volume, which has surged by 22.88%, amounting to $12,881,843,193. This uptick in trading activity signals growing investor interest and potential momentum for Ethereum in the near term.\n\nAnalyst optimism amid market trends\n\nAlthough Ethereum has experienced a slight bearish trend recently, market analysts remain optimistic about its future performance. Jelle’s prediction is based on recent price action, where ETH turned the $3,500 level into a critical support zone. This technical development is seen as a positive indicator , suggesting that Ethereum has the potential to push higher in the coming months.\n\nA major catalyst for Ethereum’s projected rise is the anticipated launch of spot Ethereum exchange-traded funds (ETFs). Expected to start trading within the next couple of months, these ETFs are likely to attract substantial institutional investment, providing a significant boost to Ethereum's price. The introduction of spot ETFs is seen as a pivotal moment for ETH, potentially leading to increased adoption and market confidence.\n\nAdvertisement\n\nHowever, Ethereum’s journey to $5,000 is not without challenges. The crypto market is inherently volatile, and various factors, including regulatory developments and macroeconomic trends, could influence its trajectory. However, the underlying fundamentals of Ethereum, coupled with its growing ecosystem and the upcoming launch of spot ETFs , provide a strong foundation for potential growth.\n\nIn addition to the technical analysis, Ethereum’s development continues to progress. These advancements are expected to enhance the network's scalability, security and sustainability, further solidifying Ethereum’s position on the market. As the market evolves, all eyes will be on Ethereum to see if it can achieve this new milestone and redefine its place on the cryptocurrency landscape."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNFA4OElPOUJvaDlBUmNQUHFRcnBMX2hUVjZIZ2R6VnBSUlFHcURmNnhzeXZRTU5zMW43eWNweDNpcU5JRGlEc2piRkFlMXUzeVBqN0JWTmpnTGFBVHFOOFA4WXV5MmMwSGR6MFlxMDBSdVZzbmkzalBxZjc3eGpGWVJpczJUZmx3YmpJOGYwamFvUGRrbkhxRVJCbkctV3dkQm1rNDBnN0ItOE04Wmk1TXZqdW9GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "ETF on Ethereum: Bloomberg’s forecast on the launch is anticipated to July 2nd - The Cryptonomist",
        "content": "The Bloomberg analyst, Eric Balchunas, continues to update the general public on the highly anticipated launch of spot Ethereum ETFs in the USA, moving his prediction to July 2.\n\nETF on Ethereum: Bloomberg’s forecast for their launch is now July 2nd\n\nThe latest update from Eric Balchunas, analyst at Bloomberg, states a new forecast for the launch of spot Ethereum ETFs in the USA for July 2.\n\nThis is an anticipation compared to what was previously stated, which was July 4th.\n\nMakes sense. What I heard: issuers still waiting to get comments from Corp Fin on S-1s which they handed in 2wks ago. Corp Fin is just looking at these docs for first time (why? bc of the (highly likely) political last min 180 (remember they were as surprised by this as anyone… https://t.co/N32N6jFXBv — Eric Balchunas (@EricBalchunas) June 13, 2024\n\nUPDATE: we are moving our launch date for the Ether Spot ETF to July 2, having heard that the Staff sent comments on the S-1s to issuers today, and that they are quite light, nothing major, asking them to return within a week. There is a good chance they are working to declare it effective the following week and get it out of the way before the holidays. Anything is possible, but this is our best guess at the moment.\n\nIn practice, the new forecast date for the launch of spot ETFs on Ethereum, by Bloomberg’s analyst, is based on the comments from the staff of the United States Securities and Exchange Commission (SEC).\n\nSuch comments are addressed to the issuers of the Ethereum spot ETFs, who are awaiting a response on their S-1s, for which it seems there is a good chance that the SEC will work on them for implementation as early as next week.\n\nEthereum spot ETF and Bloomberg forecasts: the new launch date is July 2\n\nJust the day before the publication of this update, Balchunas di Bloomberg had shared something quite different.\n\nIn fact, the issuers of spot Ethereum ETFs had not yet received a response, and for this reason, the analyst had postponed his previous forecast of July 4th.\n\nThe journalist from FOX Business, Eleanor Terrett, had also published the details on this topic. Basically, it seems that Gary Gensler, Chairman of the SEC, would have stated “during this summer” and Senator Bill Hagerty “by the end of this summer”.\n\nIt was May 23 when the SEC had approved the eight 19b-4 filings for the listing of spot ETFs on Ether in various US exchanges. Unfortunately, however, the real launch on the stock exchange can only occur when there are approvals for the S-1 registration statement.\n\nMark Cuban’s thoughts on the SEC Chairman\n\nIn the meantime, Mark Cuban, the pro-bitcoin and crypto billionaire investor, has publicly stated his thoughts on the SEC Chairman, Gary Gensler.\n\nIn practice, Cuban sees that Gensler’s actions are an obstacle for Joe Biden’s election to the presidency of the USA.\n\nThis is because the President of the SEC continues to act against crypto, leaving that the young crypto holder voters will pass their vote to other candidates.\n\nOn the contrary, in fact, there is Donald Trump who seems to use the crypto sector as an integral part of his election campaign, declaring himself in favor of its growth."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQeDlwajFYX2RxTEQ4TVhKV1FnYnVKbFRqM2E1WnJBNWZTaHpCWUdZcTNNR3g2OUNBcEpaUHhTaW1vR3dUc0dLblQyRmo5QXBiVUEtMjlSRVhOYXhRd1hDZV9EWXNfSk5SS0ZpdTlLQjE0LXhaY2VJb2d6S1R6SHQtRzJUY0hNc2ItTnc5WDdjNWN1WXN1aFo2d1pQVHI2UVRaYzhGRTJaWTBzckZWLXBfZExwZlNJUVV0bEF2aWViS3doeE1pLXFGVVhaMW5oT2pUOEdXX1FtTF9lVk41TUFxTzAtRlN3ZnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Biggest News in Crypto This Week: Michael Saylor Buys more BTC | Ethereum ETFs Launch | Paradigm to Invest $850M - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPdjM0MzZuRWUtaEcxTGNqM0FLNEV2SXBIaWwyRnp6dWFGdW45eWRxOW9QYUJZTUpQNmpLM2NpQmRYNHBlZ1Q0ZFNYZ0VqTi1XUHQwMlB3eHRMc3ljOGV4Tl8zT0I5aXhRWkl2aVVKWENVSHdWRkNFUzBWQXhZRnlTQ3JtN1FTaUxLOGpNaGZacEZxTmRPMEJPVTNMRjhDS3JhM2N6MzJNRlZ2TWxkbjRr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Rising Ethereum futures open interest highlights impact of SEC’s ETF approval - CryptoSlate",
        "content": "Onchain Highlights\n\nDEFINITION: The total amount of funds allocated in open futures contracts.\n\nEthereum futures open interest has shown substantial volatility throughout 2024, significantly influenced by recent regulatory developments.\n\nFollowing the approval of spot Ethereum ETFs by the US Securities and Exchange Commission (SEC), open interest in Ethereum futures surged, reaching new highs.\n\nOn June 17, futures open interest across all exchanges neared 4.0 million ETH, coinciding with a price movement towards $3,600 per ETH.\n\nThe SEC’s approval of Ethereum ETFs marked a significant milestone, signaling increased regulatory acceptance and boosting investor confidence. The introduction of these ETFs has driven notable market activity, particularly in the derivatives sector, with futures open interest hitting record levels due to heightened speculative and institutional involvement.\n\nThis development highlights the strong interplay between regulatory actions and market trends, with the approval of Ethereum ETFs not only enhancing market legitimacy but also potentially setting the stage for further growth in Ethereum’s market infrastructure."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9ReGFPQno5Wnp5bFJOUzYzeV9GYWdiOUpoZ1JBUXE1VUhLUHlCQVVsMWhhazZURGJ1dkRRRExfWHpRZ0R5a2M2cXkxOFU4VmNzTlhHZlEyRVA1cHg4SkdOTGZ1YXZFUmx0MktaZFdMdGJFX3M0UTkyTnZnTFVOdEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum a Millionaire Maker? - The Motley Fool",
        "content": "Ethereum still has upside potential. But does it have enough to make you a millionaire?\n\nThere's no denying that Ethereum (ETH -4.16%) has been one of the best crypto investments of the past decade. At its current price of $3,500, Ethereum is up more than 10,000-fold from its initial price of just $0.31. As a result, an investment of just $100 in 2015 would have likely been enough to make you a crypto millionaire today.\n\nBut we're moving into Ethereum's second decade now, and it's no longer a slam-dunk certainty that you can become a crypto millionaire by investing at today's prices. If you are thinking about investing in it for that purpose, here are three important questions to ask yourself.\n\n1. Does Ethereum still have 1,000x upside?\n\nLet's assume for a moment that you have $1,000 to invest in Ethereum right now. For that initial investment to grow to $1 million, it would need to increase in value 1,000-fold. A decade ago, that was certainly possible. But what about today?\n\nRemember: In 2015, Ethereum had the all-important first-mover advantage. It was literally the first smart-contract blockchain platform, and that opened up all kinds of new opportunities that even Bitcoin (BTC -2.10%) couldn't match.\n\nSo Ethereum went on to create, define, and control entire sectors of the blockchain world. From decentralized finance (DeFi) to blockchain gaming and non-fungible tokens (NFTs), it was not just the first to market. It was also best to market.\n\nUnfortunately, Ethereum no longer has the first-mover advantage. There are plenty of new challengers, and plenty of blockchains that can offer exactly what it can offer, if not more. So it only makes sense that the explosive growth that characterized the early years of Ethereum might no longer be possible. That's bad news if you're expecting 1,000x upside.\n\n2. How long can Ethereum remain the market leader?\n\nThere are now three direct Ethereum challengers -- Solana (SOL -4.76%), Avalanche (AVAX -6.54%), and Cardano (ADA -4.85%) -- that rank among the top 15 cryptocurrencies in market cap.\n\nThe appearance of these new challengers means that Ethereum's dominant market share in the various niches is slowly being eroded. So even if it is able to create entirely new blockchain niches (as it has for the past decade), the share of the market it will capture will likely continue to shrink over time.\n\nOf even more concern, some of these blockchain rivals are being viewed by investors as potential \"Ethereum killers.\" This poses a clear existential threat.\n\nWhen it comes to choosing blockchains, users and developers have a choice. And if the new Ethereum rivals continue to claim much higher speeds, enhanced throughput capacity, and lower fees, which blockchains do you think users are going to choose?\n\n3. What will be the effect of the new ETFs?\n\nLastly, there's the question of just how much of a lift the new spot Ethereum exchange-traded funds (ETFs) are going to provide. Just about everyone agrees that there was much more demand and hype for the new spot Bitcoin ETFs.\n\nThe spot Bitcoin ETFs have pulled in more than $30 billion in customer funds. However, JPMorgan Chase thinks that the new spot Ethereum ETFs will pull in only $3 billion.\n\nAs a result, the spot Ethereum ETFs are likely to be much less impactful than many people think. If you're expecting the price of the crypto to soar as soon as these new ETFs start trading, you might be disappointed.\n\nSetting realistic expectations\n\nThis might be tough to acknowledge, but Ethereum might only have 10x upside over the foreseeable future. And even that could be too optimistic. Given its current market cap of just over $400 billion, a 10-fold increase in value would imply a new market cap of $4 trillion. That's significantly more than Nvidia, which now has a lofty $3 trillion market value.\n\nA $4 trillion valuation might have been possible back when Ethereum had a clear economic moat to keep away potential challengers. But the barbarians are now at the gate, and some of them are crossing the drawbridge.\n\nFor that reason, I'm unconvinced that Ethereum is still a millionaire maker. Unfortunately, if you are really serious about becoming a millionaire, you might need to find \"the next Ethereum\" -- an undiscovered crypto with 1,000x upside that you can buy for mere pennies. And that, as we all know, is a lot harder to do than it sounds."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9GNHFBV19JYmFkMWRnNmtXbXpoWEN5T2twYnpOV2ZhNXBLY0tEZ21uMUsyRXR1X2QzMU9rcVZLX0pJcGxOaHV3Vm9MRkROUnJQcjllTTB4SVgtX19fMlpxd0Z1aUFaNlV2Zm9zY0RGYk15MzVnb1RnZmFzQjBLZ2PSAYQBQVVfeXFMTUp3eDRuMHJRT3ozeDg5em5ZQ2pwNGdUdTNOQUdWa295emNRQzliTGJFXzU0SXo3LVJXM3ByWVJUbGJScXVtcjlpQzFlTXUwcGUyT1hnN2JQUGhMWmZDQ0RnNFp2Z2tjV2EyZWliY1c1Q1lpX20xbGpMNG5Ccm1fdVFHbFYz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs May Be Approved by July 2, Top Expert Reveals - U.Today",
        "content": "The approval of Ethereum ETFs could be just around the corner, with top experts suggesting a possible date of July 2. As reported by U.Today recently, SEC boss Gary Gensler hinted that the agency could approve S-1 forms for spot exchange-traded funds on major altcoins \"sometime this summer.\"\n\nAdvertisement\n\nThe SEC has already taken steps to allow the listing and trading of eight Ethereum ETFs by approving rule changes. However, S-1 registration forms, which contain detailed information about the products, are still needed before they can go live. The SEC asked issuers for updated S-1 forms in late May, indicating that the process is still moving forward.\n\nEric Balchunas, senior ETF analyst for Bloomberg, has predicted that the regulator could approve these forms by July 2. He noted that SEC staff recently sent issuers minor comments on the forms and asked for responses within a week. The expert believes there is a good chance the commission will finalize its decision before Independence Day weekend, making July 2 a likely date for approval.\n\nAdvertisement\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nNate Geraci, another ETF analyst, also sees this as a positive sign, suggesting that there is not much left to do before final approval.\n\nThe potential approval of Ethereum ETFs may become a pivotal event for the crypto market as it could open up new investment opportunities and drive further adoption of digital assets. While the SEC nears its final decision, the community is watching closely, anticipating the impact on both institutional and retail investors."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPVGQzZ0pETDFsWUlJWl9SZ0RieERPa1RocmJHSklETlQxZlVjRmxHQlhnTThWRUhGcE93eWJ1UHl3b2c2cFlKcTdrcU9FMG0zcGlFb3BCTHI0UkswTmgxLWdmTXU3WWs4aWNDa0hHRFZ5TElMMGYyZXpTZ3k5ZWVsOE1lNllpUUlXc1FoU2JiRV_SAZgBQVVfeXFMTXRocjRoWWFfMXdIcmVRY2xncGszdG9hc0ZoNC1rMmtDUmpPck01UWdQU3UzMFo0RUR2V0gya3IyRkVXbzFadEFFR0dsOXRSbFpqTUJxQldId0V0TVNISEdRNmVyVGoyYVpBbzF3Q2xpLTN6LVBoNXF0cDhCQ08yRzZuVVBnNlV2cFQ0SGd0cm92VXpzclJqYTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Dogecoin, and Ethereum Volatility Drive $290 Million in Liquidations - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nVolatility in the prices of Bitcoin, Ethereum, and Dogecoin today didn’t substantially affect most traders, as each of the three cryptocurrencies ended up roughly where they started by Monday evening. But price spikes along the way appear to have triggered a wave of crypto liquidations—over $290 million worth across the market.\n\nEthereum led the pack, with about $58.9 million worth of liquidations triggered by ETH’s price movement in the last 24 hours, per data from CoinGlass. The majority of ETH-related positions liquidated on Monday were longs.\n\nWhile ETH only fell 2% overall on Monday, the token did briefly fall below $3,500. Though that dip was tiny (ETH only fell $12 below $3,500 at its lowest point today), and the token soon recovered, the crossing of that line may have triggered a wave of liquidations.\n\nDogecoin experienced a similarly minor but significant drop today. The world’s top meme coin only briefly fell below $0.13 today, before recovering in a matter of minutes. But that dip appears to have triggered a massive wave of long position liquidations for the token. Over $44 million worth of DOGE long positions have been liquidated in the last 12 hours alone.\n\nAD\n\nAD\n\nDOGE is down 3.6% on the day overall.\n\nBitcoin, meanwhile, was crypto’s third-biggest target for liquidations today—with short positions constituting a thin majority of positions liquidated.\n\nIn the last 24 hours, some $21 million worth of BTC short positions—and $19.86 million worth of long positions on the coin—have been liquidated.\n\nThough the price of the world’s top cryptocurrency has ended up, at writing, almost exactly even from where it stood a day ago, BTC briefly shot up past $67,000 on Monday afternoon, in an unfortunate development for those betting on the token’s downward trajectory. BTC now sits, at writing, at $66,376.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQYmFYUWtLcUR0aXZGYll1NHE4WGl6Q3JNcW1tVFA1X2JyNGVWQmpQZE5SX05aa0UxSkZVTlJpZWZBSklyTmxTUzc4Rkx6eUs5alRzT3FzR3c4VlZ2Y3ZoMFV5QUJGZy1WSHVqLUdJVlNoWXhWd0VFVGZsYVhfV1ZzUnB1YVpVZDZaSTQxdkRBWGR3dUpJOVdJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "New scaling milestone for the Ethereum (ETH) blockchain - The Cryptonomist",
        "content": "In recent days, an important milestone has been reached regarding the scaling of the Ethereum (ETH) blockchain and its layer-2 and layer-3.\n\nJust yesterday, in fact, the all-time high of the number of daily transactions recorded overall on Ethereum’s layer-1 and all its upper layers was registered.\n\nAccording to the data from L2BEAT, the average daily TPS on Ethereum’s layer-1, that is, its actual blockchain, has settled at a modest 13 tx/s, but the overall figure, which also includes the upper layers, has approached 246 tx/s.\n\nJust think that seven days ago the average TPS on layer-1 was practically the same, but with the upper levels it was just 123 tx/s, or about half. At the beginning of the year, it was only 73 tx/s, while the one on layer-1 has always been more or less around 13.\n\nThe second layer and the scaling of the Ethereum (ETH) blockchain\n\nWhat is making the most difference is the layer-3 Xai, a scaling solution for gaming created by Offchain Labs, the company behind Arbitrum One.\n\nJust yesterday it recorded a TPS of over 101 tx/s, followed far behind by layer-2 Base at about 33 tx/s.\n\nIt should be noted that there are two other upper layers that have recorded a higher daily average TPS than Ethereum, namely Arbitrum, with more than 20 tx/s, and Proof of Play Apex with almost 16.\n\nMoreover, both Taiko and Blast are also recording interesting numbers, because they are both above 11 transactions per second.\n\nL2BEAT monitors as many as 74 chains, including layer-1 (Ethereum), layer-2, and layer-3, although for about ten of these it is not managing to collect data.\n\nIn the last twelve months, the daily average TPS of Ethereum has remained more or less constant around 12 or 13 tx/s, while the overall TPS was just 30 tx/s, which is slightly more than double that recorded on layer-1.\n\nAs recently as February of this year, the overall TPS was still only at 40, but after the Dencun update in March that reduced fees on the upper layers, it skyrocketed first to 100 and then recently well beyond 200 tx/s.\n\nThis makes it very clear that by now the majority of transactions within the Ethereum ecosystem do not occur on layer-1 (the native Ethereum blockchain), because there they are relatively slow and expensive, but on the upper layers where they are faster and above all much more economical.\n\nThe fees\n\nThe average cost per transaction on the Ethereum blockchain yesterday was over $2. Five days ago, however, it was over $6, and a good ten days ago it had risen to almost $9. Not to mention the fact that on March 5th it skyrocketed to over $30.\n\nInstead, according to the data from L2BEAT, yesterday on Base the average cost per transaction was 0.4 thousandths of a dollar, or 0.0004$.\n\nOn Optimism it was 1 thousandth, and on Arbitrum slightly above 2 and a half thousandths.\n\nThe difference is truly remarkable, and this is due to the fact that on layer-1 it is not possible to reduce costs by increasing TPS, while the upper layers can scale much more easily.\n\nIt should be remembered that the average cost of a single transaction depends on the level of network congestion, so a network that supports higher TPS can clear the queue of pending transactions much faster, greatly reducing congestion.\n\nInstead, on layer-1 like Ethereum and Bitcoin it is not possible to increase the number of validated transactions per second, making it very difficult to reduce congestion in case of many requests.\n\nThe price of ETH\n\nThis remarkable increase in on-chain activity has not, however, had positive effects on the price of ETH, also because ETH is used to pay the cost of transactions on layer-1.\n\nAbout ten days ago it had risen above $3,800, but starting from Friday, June 7, it began to fall.\n\nFirst it went back to $3,600, and then it dropped below $3,500.\n\nIn particular, last Friday for a brief moment it had also dropped below $3,400, but at that point, it recorded a quick rebound that in fact then brought it back around $3,500.\n\nThe current price levels are in line with those of mid-April before the early sell-the-news on Bitcoin was triggered about a week before the halving.\n\nAt that time, the price of ETH dropped to $3,000, and then fell below $2,900 during the month of May.\n\nIt then recovered after the news of the possible approval of spot ETH ETFs in the USA (which later happened), but since we are still waiting for their actual debut on the stock exchange, there is still a lot of calm and uncertainty at the moment.\n\nIt is worth noting that the current price of ETH is still 28% lower compared to the all-time highs of late 2021, while for example that of BTC is -% from the all-time highs of March."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNeUdWNGNycjJGSlZ1Z1Q5OUJZRjR3ZWR5bTNsX1ZTVVgzTWh3RVJRVmhEQkZRQkk1R1ptUXZiaUppam5kaENOVWlZODc5UHRFdm9ZOTFmdzc0bTRyaXJiOE1HRzZWN01vUUxYaEpjU3ltUld6Ni1TNi1BYWxJeXR3Nl9Vc0pQd9IBjgFBVV95cUxNY2gzREhnSWhWS0VldVQxSnowb04ySXg3aVBEQXQyLVYzZUxQVkJRaERGUEkwTFZCOXg4NFIwdWpaNld6Ql9XcmV5dS04VFVUWS02SmxSWjZQM0cxbnYxaXNaSU5pelZzRXdMRVU3emhST21BNmp0OXJRRlY2YkplMnNReU5xYzhjbmxHSHlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Dive as Crypto Liquidations Near $500 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the prices for Bitcoin, Ethereum, and other cryptocurrencies stayed in the red late Monday, investors saw nearly half a billion dollars in positions liquidated in 24 hours. Of $489 million in liquidations, the vast majority—over $432 million—slammed long positions, according to aggregated crypto market data from CoinGlass.\n\nMost of the day's liquidations came in the past 12 hours, as the price of Bitcoin fell as low as $64,548 late Monday and the price of ETH dipped to $3,384, leaving both down more than 5% over the prior seven days.\n\nThe overnight figures continued a flood of liquidations observed yesterday, vaporizing $290 million in mostly long positions.\n\nAbout 200,000 traders were liquidated over the last day, per CoinGlass. Per the site's metrics, the largest single liquidation order happened on Binance, a $6.4 million long bet on Ethereum.\n\nAD\n\nAD\n\nEthereum led the overall liquidation flood, with $92.5 million in positions rekt over the past 24 hours, as of writing, with CoinGlass showing Bitcoin with $72.8 million in liquidations and Dogecoin (DOGE) with $60.3 million. Shiba Inu (SHIB) and Solana saw $22.9 and $19.8 million in liquidations, respectively, over that same span.\n\nThe volatility of crypto—even with massive institutional investor interest in the case of Bitcoin—often leads to forced liquidations as its fluctuating price defies the expectations or hopes of holders.\n\nA price spike in Bitcoin and Ethereum drove over $300 million in short position liquidations in May, for example, followed by an equally sizable surge for long positions a few weeks later.\n\nEdited by Andrew Hayward\n\nAD\n\nAD\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBiSDIxbEJmMXFQcjl1aG8tUk1nS1AzSXVYVmhCUFJxVXNZbldNYjVfUGpqc2dmSU1hcW5ELU1vR0lRUjVJOEF5d0tqdFFtY3h3WnlmRGpReXg3SG1ycTZlVjZFWm84azlMWDZ5Q3ZnTVcweVFqQlZpajQ2NjNlM0HSAYQBQVVfeXFMUFN0dHZhU1JBMm1kWTRXcGxXQWxPVEhETTNfOEdyUllPY1lJUHpHMlYxMFVEQzFTbFpqMlpSeGhlQmQ2SnNmcXM0UDNaMDhiOUFPamJ4Q1M5ZG04bG1GM1AybXkxdm1Yd3pTeDV4Y0dfcHBfT2J5R2tmVUI2bk5nanoyYzdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 13:17:19 GMT",
        "title": "Ethereum Whales Scoop up $2.45 Billion Worth of ETH in Weeks - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to data provided by cryptocurrency analytics platform Santiment, Ethereum whales have scooped up more than 700,000 ETH tokens (roughly $2.45 billion) over the past three weeks.\n\nAdvertisement\n\nDespite this buying spree, Ethereum is struggling to regain its bullish momentum. The flagship altcoin is currently trading at $3,562 on the Bitstamp exchange after reaching an intraday low of $3,360 on June 14.\n\nEarlier this week, CryptoQuant analyst ShayanBTC noted that Ethereum's bearishness might persist in the near future due to aggressive selling by futures traders.\n\nIt surged in tandem with Bitcoin on Wednesday due to better-than-anticipated U.S. inflation data.\n\nAdvertisement\n\nHowever, cryptocurrencies retraced together with other risk assets after some hawkish comments made by Federal Reserve Chair Jerome Powell called into question the possibility of several rate cuts this year.\n\nWill Ethereum ETFs be bullish catalyst?\n\nLast month, the U.S. Securities and Exchange Commission unexpectedly approved several 19b-4 forms for Ethereum exchange-traded funds (ETF), triggering a major rally. On May 27, Ethereum came close to reclaiming the $4,000 level due to investor exuberance. However, this excitement quickly dissipated as soon as market participants realized that the SEC was yet to approve S-1 registration forms that would make it possible for these products to start trading.\n\nAs reported by U.Today , SEC Chair Gary Gensler said that the final approval of Ethereum ETFs would take place over the course of this summer during a recent congressional hearing."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPRVZOTllNM0lvcTltM0pmMlZSZjl2SndlS1I3aTZ2b3VrMmRoNUxtamNYY3RhLVdKb0lpV3M2TjNsT2pHcGExNHp1dVBEUjJtNmtWam5wZVFhazVfVElwdWNuNGxfTE5rbE82YmNOUHZ2LUZJbzN5dUp1VFJVenhDT2pHM0tsZmJmTDBnajAyY3gtUFB2SEZ0RzNTMEhiSVZRT3fSAaoBQVVfeXFMTzFIWmtXd3BBb3NGU0M2WmNRMDFlYlVpQ3pBR0JCY0JFSmMwcTlsSXVRM0k4bzlLSEtBNDMyMVZfREVLX0xfRkxYeTQ2Rzg3dFVTXzJoZW5XbmlmQmVCTjBoY2RYM3ZpZU9zSUpkd3JIS0c0QjVzYVF2ZDFyQzF0M0NzY0dWRUE1dU5zUEhEZnBuUzJwaEF1VFl2ODVnZHl6MU1ON0dIdnJkRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "‘Wall Street Is Greedy’: Tether Co-Founder Predicts Next ETFs After Bitcoin, Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDon’t expect crypto ETF momentum to slow after the approvals of spot Bitcoin and Ethereum funds in the United States: Wall Street's “greed” will bring more and more such products, Tether and WAX co-founder William Quigley told Decrypt this week.\n\nQuigley predicted a proliferation of ETFs for other leading cryptocurrencies like Solana and Cardano, driven by Wall Street's relentless pursuit of profit.\n\n“Wall Street is greedy,” he said. “Every time Wall Street packages a new product to sell to consumers, if that product is successful, you can guarantee there will be copycats. There would be no ETFs if the Bitcoin ETF had failed.”\n\nHe added that Wall Street loves the “next hot new thing” because it’s something it can talk to its consumers about and sell their products. But should the momentum eventually cool, Quigley expects that ETF providers will shift focus to the next big trend.\n\nAD\n\nAD\n\n“We will continue to see new ETFs launching until there's a big pullback,” he added. “Then, you’ll see some of those ETFs shut down by the firms who launched them due to lack of demand.”\n\nThe SEC’s long-awaited approval of spot Bitcoin ETFs in the U.S. in January marked a significant milestone in integrating cryptocurrencies into mainstream financial markets. They allow investors to gain exposure to Bitcoin without directly holding the cryptocurrency, thus providing a more accessible and regulated investment vehicle.\n\nThis approval sparked significant interest and investment inflows, highlighting the growing acceptance and institutional interest in digital assets.\n\nThe success of the Bitcoin ETF has paved the way for further crypto-related financial products, and the market has been keenly awaiting similar developments for other such products.\n\nAD\n\nAD\n\nThe anticipation for Ethereum ETFs has been particularly high, especially following the positive signals from regulatory authorities. The funds received initial approval in late May, but will not start trading until funds’ S-1 registration forms are approved.\n\nSEC Chairman Gary Gensler on Thursday indicated that the approval process for Ethereum ETFs might be completed by the end of the summer.\n\n“Individual issuers are still working through the registration process that's working smoothly, and I envision sometime over the course of the summer,” Gensler said during a Senate hearing Thursday.\n\nTradFi butts in\n\nDespite the added mainstream attention coming with ETFs, Quigley expressed dissatisfaction with the increasing involvement of traditional finance in the crypto space.\n\n\"I was happy with crypto without Wall Street,” he said. “Would it be smaller? Of course. But I didn't feel the need to keep growing the size of crypto now.”\n\nHe warned that Wall Street's aggressive marketing of crypto products could lead to significant risks, especially if institutional investors pull out during market downturns.\n\nDespite his reservations about Wall Street's involvement, Quigley acknowledged that a significant capital influx is essential for substantial market growth.\n\n\"If you want a massive amount of capital, then yes, you have to do things like ETFs,\" he conceded.\n\nAD\n\nAD\n\nWhile ETF hype was partially credited with Bitcoin hitting a new all-time high price above $73,700 in March, alongside anticipation for April’s quadrennial halving event, BTC has yet to seriously challenge that mark again in the months since—and is down this week at a current price of just under $67,000.\n\nBut Bitcoin’s price typically climbs six months or more after the halving, which constrains the expanding supply, as the impacts of that event start to be felt. Quigley believes that historical patterns will continue along that path as well.\n\n\"It can't go higher because it's not the right time,\" he said, predicting a significant price increase ahead.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ManJrQzFMS1QxQXJTWE1hemZkcEFkaGk2QXRPb3Vma2NFdmRkc21wUzc2Wk9seXBDZllJbGlONDQzNnFaN09pXzB1VEhNeVVlb2VvQ1JGcmY0UU1tYmVrcEVuYnhYWjRDOWhCMlctd3RKdHg2MXZWUHFVNFI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum To Surge 50% This Year Against Bitcoin - Watcher Guru",
        "content": "Ethereum is poised for a huge surge this year of up to 50% to rival Bitcoin, according to a new analysis of chain data. According to a technical setup called the inverse-head-and-shoulders (IH&S), Ether is expected to boom over the next few months, mimicking a similar bullish pattern to 2021 where it competed with BTC in terms of growth.\n\nThe IH&S pattern is characterized by the formation of three troughs below a common neckline resistance. These formations are the middle trough (head), which comes to be deeper than the other two troughs (shoulders), which are roughly of the same length.\n\nIf the IH&S pattern resolves when the price breaks above the neckline resistance after the formation of the right shoulder, the price rises by as much as the maximum distance between the head’s lowest point and the neckline resistance. In simpler terms, Ethereum’s growth between 2019 and 2021 followed this pattern. In that period, it competed with Bitcoin in terms of the best-growing cryptocurrency.\n\nAlso Read: Bloomberg Analysts Move Up Expected Ether ETF Launch to July 2\n\nEthereum And Bitcoin To Flip This Summer Following Ether ETF Approval?\n\nOn Monday, the ETH/BTC pair flipped as the head trough appeared. To begin this surge, it will next need to reach the common neckline resistance level at around 0.061 BTC. Upon doing this, Ethereum will be in business and will need to retest the neckline before a breakout commences. This breakout may see ETH boom to new highs in the coming months. You can see these patterns forming on Ethereum’s price chart.\n\nFollowing the latest approvals of Spot Ethereum ETFs, the Ether community is as bullish as ever. The news of the asset being on its way toward public trading fuels its battle against Bitcoin. While BTC remains the biggest cryptocurrency by market cap, Ethereum has always been close behind in terms of trading volume. Many bullish price predictions expect Ether to reach all-time highs next month, as soon as the SEC fully approves ETFs. When trading commences, the asset will possibly see a similar boom to Bitcoin in January 2024."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxNLUVJZE40QWRpVkJzdEYwUGpOYms1OHU4ZTItUHZRZ1JhMmVseC1EQ05NQ1E2QWFPaGQwZ0RKbG5JYWtSYzFEakdvdlhNQnA4dEh1MVRHeGVjOGNnZ3o3dUJWMU1GLTNZWkNMdENBSjF3Qkg1dTAtd1FoalhYWmpHWXdfX2w1TjFvd0FGcVpzSl9yUmdGMjhvdldEX3Y5RTdya1BCV0doREZnVVY4X0pnZGFJNmtWXzZHUGxNdDV4VTJGWjBHTFdpQlpnQUwyLUxwcDFKSENXRmpLVGNUbEZv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Mean reverting Trading System on cryptocurrencies: a strategy to exploit the false breakouts of Ethereum (ETH) - The Cryptonomist",
        "content": "In order to diversify the basket of systematic trading strategies, this article will attempt to evaluate whether it is possible to approach trading on Ethereum (ETH) with a “mean reverting” strategy based on false breakouts. Like most cryptocurrencies, Ethereum has historically shown a predominantly “trend following” behavior, therefore seeking trend reversals might seem like a counterproductive choice.\n\nWith the recent evolution of the crypto market, it might be useful to consider incorporating a strategy into your portfolio that takes advantage of the “mean reverting” trend, which seems to be increasingly present in this market as well, fueled by growing liquidity.\n\nTo do this, an attempt will be made to define a trading system that can take advantage of false breakouts at the previous session’s low levels, which increasingly often result in rebounds rather than downward trend extensions. Upon breaking the previous day’s low, the condition will be met to enter long if the price returns to the just-broken low level.\n\nStructure and initial results of the mean reverting trading system on Ethereum (ETH)\n\nThe strategy, which will be built only on the long side, assumes entering after bearish market movements with the idea that breaking the previous day’s low could lead to a rebound.\n\nThe session is calculated using the exchange’s time (normally Greenwich Mean Time, GMT) from midnight to 11:59 PM, considering a historical data series from 2016 to today (May 2024). A fixed amount of $10,000 per trade is set, with an initial stop loss of $3,000.\n\nPositive results are obtained right from the start, with a growing equity line. In the following figures, it can be seen how the total profit of the system exceeds $71,000 in just 75 trades, with an average trade of $1,100. These results might seem overly positive, but in reality, they indicate a still rough strategy, given the few very long-duration trades, as confirmed by the high value of the average trade.\n\nAlthough it provides interesting metrics, the low number of operations makes the statistic not very robust, in addition to being not very applicable in real trading given the long duration of many trades.\n\nIt is therefore appropriate to limit the duration of the trades, perhaps finding a compromise between average trade and number of operations through an optimization of the parameters used.\n\nFigure 1. Equity line of the mean reverting trading system on Ethereum (ETH).\n\nFigure 2. Average trade of the trading system mean reverting on Ethereum (ETH).\n\nFigure 3. Summary of the performance of the mean reverting trading system on Ethereum (ETH).\n\nOptimization to determine the ideal duration of trades\n\nAs a first step, we will try to limit the duration of the trades by imposing closure after a certain number of days. By optimizing between 5 and 120 days, the values in figure 4 are found. As noted from the graph in figure 5, around 55 days there is an area with good values of average trade and net profit on drawdown. This is still a rather long duration compared to the event that generates the market entry (false breakout of the previous lows), but the optimization shows that it is not possible to achieve noteworthy results with shorter duration trades. Therefore, as an example, we will choose to close the trades at most after 55 days.\n\nFigure 4. Optimization of trade duration (expressed in days).\n\nFigure 5. Chart of the main results of the optimization.\n\nThe total profit of the system has dropped to about $46,000 with an average trade of $130, values lower than the previous ones, but definitely more realistic considering that they are obtained in 354 operations, a number that makes the statistics more robust and the trade time horizon more sustainable. However, there might still be room to improve the metrics and get closer to a strategy that can be considered for live trading. For example, one could filter the entries with price patterns, trying to operate only when there are ideal conditions.\n\nAnalysis of price patterns to improve the results of the mean reverting trading system on Ethereum\n\nIn this regard, a proprietary list will be used that brings together many price combinations, different from each other, which will serve to understand in which situations Ethereum (ETH) seems to work best with the logic of false break out being tested.\n\nFigure 6. Optimization of price patterns to improve the effectiveness of trades.\n\nThe case “PtnNeutYes=4” (figure 6) identifies the days following a session with little conviction. These are days in which the “body” of the daily candle (open-close) was not greater than 75% of the total range of the daily candle (high-low). Therefore, one would want to avoid those situations where the “body” is greater than 75% of the total range of the session.\n\nIt is noted how in fact MyPtn number 4 manages to increase the average trade (152$) and the net profit (49,209$). The drawdown also decreases and stands at -6,697$. A good improvement, also visible from the shape of the equity which is decidedly more regular (figure 7).\n\nFigure 7. Equity line of the mean reverting trading system with the application of Pattern 4.\n\nFigure 8. Average trade of the mean reverting trading system with the application of Pattern 4.\n\nThese good results are certainly far from those that would have been achieved with the simple “buy & hold” of Ethereum (ETH) from 2016 to today (figure 9) in terms of absolute profits. But it must be considered that the fluctuations of the “buy & hold” are not comparable to those experienced by the trading system, making the former a definitely less sustainable approach. In addition to this, it should be noted that the trading system uses a fixed size, while applying the “buy & hold” is like reinvesting the profits obtained.\n\nFigure 9. Buy & hold of Ethereum (ETH) since 2016 with $10,000.\n\nFinal considerations on the mean reverting trading system on Ethereum\n\nIn conclusion, it has been shown how it is possible to operate with a mean reverting approach even on an instrument like Ethereum, typically trend following, which with the general growth of the mercato crypto presents more and more opportunities for reversal. The trading system developed in this article is certainly not ready for live trading, but the reader is left with the task of further experimenting and optimizing this idea to refine it and transform it into a real operational strategy.\n\nSee you next time and happy trading!\n\nAndrea Unger"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPSmZwT3BOVzQ5QXJObm5idkp1d2RINlY2NnpOT0ptaTh0MTNlX1RIbE5SNE5fdXJlam5sUjRxTTJoSVdGQ1JvNUhJYjYxVWxVRG80Y2VTbHowOHcwSVpFa2NRWkQ5S3pPMUZXMXZ6dWVQT0RuWUxfejhwdVF5cThPdm5RaklsQdIBiwFBVV95cUxQb1FkZGRkbTB3RHQtdVRaVDBpeVNaQXVHR1V4ek1sWWhzaDViOTVJNVZXbWtHeFVfM3FCbUZiMlhuZ1IyeDZYU05WcGFRak9vbUFCN2JNc0VlMHYxci10MmdudFFhQjg0bm13TEN2TkFCQlh6M1I1QV8zRHNFeEtDVkx6SVFOQUFkampZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Hints Major Reversal as Whales Buy 700,000 ETH Amid Market Dip - CoinGape",
        "content": "The first half of June was notably bearish for the crypto market as Bitcoin price hit a low of $65000 amid several unfavorable updates. The FUD surrounding macroeconomic development, Bitcoin miners capitulating, the ETFs outflow, and whale distribution combined to fuel the recent correction in the majority of major cryptocurrencies including Ether. The Ethereum price dropped to a three-week low of $3362 on Friday but has now witnessed an ease in selling pressure amis stable the weekend.\n\nAlso Read: Crypto Headlines of The Week: Bitcoin & ETH Ride Rollercoaster, XRP & LUNC Make Waves\n\n\n\nadvertisement\n\nSEC’s Potential ETF Approval and Whale Investments Boost Ethereum Price\n\nDuring the recent market downturn, Ethereum formed a new lower high at the $3950 resistance level on the daily chart. The coin buyers failed to surpass the last high indicating an initial shift in market sentiment where traders prefer to sell on bullish bounces.\n\nOn June 14th, the coin’s price peaked at $3,887 before experiencing a significant drop of 13.5%, bringing it down to a low of $3,364. This price level coincides with the 100-day EMA, which has now begun to stabilize the declining Ethereum price, aiding its recovery to $3,509. Concurrently, the market capitalization has increased to $431.2 billion.\n\nThis surge is likely triggered by SEC Chair Gary Gensler’s recent statement to lawmakers, suggesting that the agency could finalize the approvals for listing and trading spot ETH exchange-traded funds (ETFs) over the summer.\n\nMoreover, in a recent tweet, renowned trader Ali (@ali_charts) highlighted a significant trend in the Ethereum market. According to his analysis, Ethereum whales have made substantial investments over the past three weeks, purchasing more than 700,000 ETH, which amounts to approximately $2.45 billion.\n\n#Ethereum whales have bought over 700,000 $ETH in the past three weeks, totaling approximately $2.45 billion! pic.twitter.com/sfmXnkqD49 — Ali (@ali_charts) June 15, 2024\n\nThis notable accumulation by large holders despite the ongoing correction indicates strong confidence for the Ethereum price to rebound.\n\nAlso Read: Ethereum Permanent Holders Scoop 298K ETH In A Day, ETH Price Rally Soon?\n\nIf the broader market correction persists, the ETH price may dive to $3200 and seek support from the long-coming support trendline. As per the past record, the Ethereum coin rebound thrice from dynamic support indicates a high accumulation for investors.\n\nThat said, the daily chart indicates a new resistance trendline forming above, suggesting that Ethereum might enter a sideways trading pattern. A breakout above this barrier is needed for buyers to regain control, and bolster a rally to $3900.\n\n\n\nTechnical Indicator:\n\nExponential Moving Average (EMA): The 100-and-200-day EMAs as dynamic support preventing ETH price from a major correction\n\nMACD: A bearish crossover between the MACD (blue) and signal (orange) indicates a seller as the key driving force behind the current price movement.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5qZ1NTajZjTTlGNTZxdHlBc2dhQXpIcGN5cEY3YVRsT0Q5TW1RQS1HcG5IVlNCdkcwLWdGOVFBa1hwMlF3emd0REFfeWdmMzNaSlZSaDJTZmx1ZHNubElDVnhmN0dGRkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Fhenix raises $15 million Series A to bring confidentially to the Ethereum blockchain - CTech",
        "content": "Fhenix, which develops confidentiality-enabling Layer 2 blockchain powered by fully homomorphic encryption, has announced the close of a $15 million series A fundraising round led by Hack VC with participation from Dao5, Amber Group, Primitive, GSR, Collider and Stake Capital, among others. This brings the project’s total funding to date to $22 million. The company plans to use these funds to support the initial stage of its open testnet, dubbed Helium, which will enable developers to deploy smart contracts to the Fhenix network for the first time.\n\nFully homomorphic encryption (FHE) is a novel form of cryptography that allows data to be computed blindly without ever needing to be decrypted. Fhenix is the first blockchain to natively integrate FHE in order to deliver an EVM-compatible smart contract platform that allows developers to encrypt all or part of their Solidity-based applications using familiar tools without any prior knowledge of FHE encryption.\n\n1 View gallery Blockchain. ( Photo: Shutterstock )\n\n\"My life's work has been research into secure computation with the goal of bringing confidentiality onchain. After exploring every available technical solution to this problem I came to the conclusion FHE is the best possible solution. The launch of the Fhenix testnet is an important step towards bringing encrypted computation onchain,\" said Guy Zyskind, co-founder of Fhenix.\n\nFhenix recently announced a technical partnership with EigenLayer around the development of FHE Coprocessors, which enable host chains–whether that be Ethereum itself, L2s, or L3s–to offload specific computational tasks to a designated processor, enabling developers on any EVM-compatible chain to integrate encrypted computation into their application logic."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPb0owNWJLbnVTZXduV2Q5dlZKVFFjQWpJUVZEa3lHaEtlZVgwMzdONHJlcklHUmpEZkxQa0hsTnU3QUZRc3pZZmxNYXQ0bFYtUDlBNFhVbUpNMWZvcnJ6LUZZYlRUdFBFQUlpZ0hDd2dpY2tpdDl1Qks1aWpCZEhfeHpIVWYwanZZd1lvUWliZGpJVk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "CryptoHeap Launches New Pooled Ethereum Staking Service for Global Users - Yahoo Finance",
        "content": "CryptoHeap\n\nMiami, FL, June 17, 2024 (GLOBE NEWSWIRE) --\n\n\n\n\n\n\n\nCryptoHeap, a leading platform in the cryptocurrency staking industry, proudly announces the launch of its innovative pooled Ethereum staking service. This new service aims to provide users worldwide, excluding those in the U.S. and U.K., with the opportunity to participate in Ethereum staking without needing to meet the high minimum requirements individually.\n\nSalvage Warwick, spokesperson for CryptoHeap , highlighted the significance of this development. \"The introduction of our pooled Ethereum staking service marks a significant milestone for CryptoHeap. This service is designed to democratize access to Ethereum staking, allowing more users to benefit from staking rewards without the need for substantial initial investments,\" Warwick stated.\n\nComprehensive Staking Packages\n\nCryptoHeap’s new pooled Ethereum staking service complements its existing range of staking packages, designed to cater to various investment levels. These staking packages provide daily rewards, capital return, and significant referral bonuses, making them highly attractive to investors. Here are the detailed packages available:\n\nArbitrum: $100 USD staking for 1 day; $2 USD daily and total rewards. Toncoin: $200 USD staking for 1 day; $4 USD daily and total rewards. Sui: $600 USD staking for 6 days; $6 USD daily, $36 USD total, and $6 USD referral rewards. Polygon: $1,500 USD staking for 8 days; $16.50 USD daily, $132 USD total, and $18 USD referral rewards. Cardano: $5,000 USD staking for 12 days; $60 USD daily, $720 USD total, and $70 USD referral rewards. Ethereum: $8,000 USD staking for 16 days; $104 USD daily, $1,664 USD total, and $128 USD referral rewards. Tron: $10,000 USD staking for 20 days; $130 USD daily, $2,600 USD total, and $170 USD referral rewards. Solana: $15,000 USD staking for 25 days; $210 USD daily, $5,250 USD total, and $300 USD referral rewards. Bitcoin: $30,000 USD staking for 30 days; $480 USD daily, $14,400 USD total, and $690 USD referral rewards. Chainlink: $50,000 USD staking for 40 days; $950 USD daily, $38,000 USD total, and $1,650 USD referral rewards. Cosmos: $100,000 USD staking for 50 days; $2,100 USD daily, $105,000 USD total, and $3,800 USD referral rewards. Uniswap: $150,000 USD staking for 55 days; $3,750 USD daily, $206,250 USD total, and $6,750 USD referral rewards.\n\nPooled Ethereum Staking: An Inclusive Approach\n\nThe new pooled staking service allows users to combine their Ethereum assets with others to meet the staking requirements collectively. This innovative approach lowers the barrier to entry, making it easier for more people to participate in Ethereum staking and earn rewards.\n\nStory continues\n\n\"Ethereum staking typically requires a minimum of 32 ETH, which can be a substantial amount for individual investors. Our pooled staking service removes this barrier, enabling users to stake smaller amounts and still benefit from the rewards,\" explained Warwick.\n\nExclusion of U.S. and U.K. Users\n\nWhile CryptoHeap is committed to providing accessible staking solutions globally, the new service will not be available to users in the U.S. and U.K. due to regulatory considerations. Warwick addressed this decision, stating, \"We understand the regulatory complexities in these regions and have decided to exclude U.S. and U.K. users from this particular service to ensure compliance and maintain the integrity of our platform.\"\n\nAdvantages of CryptoHeap’s Pooled Ethereum Staking\n\nCryptoHeap’s pooled Ethereum staking service offers several advantages, making it one of the best crypto staking platforms available today. Users can enjoy lower entry barriers, reduced risk, and the potential for higher returns through collective staking.\n\n\"We believe that pooling resources is a powerful way to enhance the staking experience. By joining forces, users can participate in Ethereum staking with smaller investments and still enjoy significant rewards. This service truly embodies our commitment to inclusivity and innovation,\" Warwick added.\n\nThe Future of Crypto Staking\n\nWith the rise of digital currencies and the growing interest in decentralized finance (DeFi), crypto staking has emerged as a popular investment strategy. CryptoHeap’s exclusive packages and pooled Ethereum staking service are a testament to its commitment to offering the best staking options in the market. These packages are especially attractive for investors looking to stake the best crypto to stake in 2024, including Ethereum and other prominent altcoins.\n\n\"CryptoHeap is dedicated to providing a seamless and profitable staking experience. Our platform is equipped with the latest technology and security measures, making it one of the best crypto staking websites in California and beyond,\" Warwick added.\n\nSecurity and User Education\n\nCryptoHeap prioritizes the security of its users' investments. The platform employs advanced encryption protocols, multi-factor authentication, and real-time monitoring to safeguard assets. Additionally, CryptoHeap offers extensive educational resources to help users understand the nuances of crypto staking, including the best ethereum staking platforms and whether staking ethereum is a good idea.\n\n\"Security and education are at the core of our platform. We want our users to feel confident and informed about their investments. Our comprehensive resources cover everything from basic staking principles to advanced strategies, making CryptoHeap a trusted platform for staking enthusiasts,\" Warwick explained.\n\nStrategic Enhancements and Future Plans\n\nCryptoHeap is continuously innovating to enhance its platform and provide users with the best possible experience. The introduction of advanced analytics tools, automated investment strategies, and user-friendly interfaces are part of the platform's ongoing efforts to stay ahead in the competitive crypto staking landscape.\n\n\"As one of the best staking crypto platforms, we are committed to delivering value and ensuring that our users can achieve their investment goals. Our focus is on continuous improvement and innovation, and we are excited about the future developments we have in store,\" Warwick concluded.\n\nWith the introduction of pooled Ethereum staking and a range of exclusive staking packages, CryptoHeap is well-positioned to meet the growing demand for crypto staking. The platform’s commitment to security, education, and innovation ensures that users can navigate the complex world of crypto investments with confidence and success.\n\nInvestors and crypto enthusiasts are encouraged to explore the exclusive staking packages and other features available on CryptoHeap’s platform. For more information about CryptoHeap’s services and upcoming enhancements, visit the official website at https://cryptoheap.com/ .\n\nMedia Contact Details\n\nContact Name: Salvage Warwick\n\nContact Email: salvage@cryptoheap.com\n\nAddress: 250 NE 25th St Apt 910, Miami, FL 33137, USA\n\nCity/Country: Miami, FL, USA\n\nWebsite: https://cryptoheap.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nCONTACT: Salvage Warwick salvage at cryptoheap.com\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQc0tXYnRZMjdYeDNSYk9pVTRQWVh2U2xNa0xzM0VqZ0FLeTVWdk5tS0M5TGhib0lDR18wMHZPcm5RSFRiOGFMUnBEeGdHWDZwVTktdFdtWHRSQjloamhSaFkxUzVaanBLdmRnNGlDUXhfa1pYVWpfZDhaUFd4NE53TmEtR0dkTjkyS0ZYN1lodmZtVHJVRV9J?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bonne nouvelle : La SEC pourrait approuver les ETFs Ethereum dès le 2 juillet ! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nAccording to leading analysts, the final approval of Ethereum ETFs could be made official as early as July 2, just before the Independence Day weekend. This news is important not only for crypto investors but also for the global financial market. The approval of these ETFs could mark a decisive step towards the legitimization of digital assets, opening the door to new investment opportunities and speeding up the adoption of cryptos on an unprecedented scale.\n\nA decisive step towards the approval of Ethereum ETFs\n\nThe SEC could mark a turning point for cryptos by approving Ethereum ETFs as early as July 2, according to leading experts. “July 2 could be the fateful date,” said Eric Balchunas, senior ETF analyst at Bloomberg. Gary Gensler, the SEC Chairman, recently indicated that the agency could approve S-1 filings for exchange-traded funds on major altcoins “by this summer,” highlighting the significant advancement of the process.\n\nThe steps to enable the listing and trading of eight Ethereum ETFs have already been initiated by the SEC, particularly through the approval of required rule changes. However, the S-1 registration statements, which contain detailed information about the financial products, still need to be finalized before their official launch. Last May, the SEC requested issuers to update these forms, a sign that the process is making significant progress.\n\nA turning point for crypto investments?\n\nNate Geraci, another ETF specialist analyst, shares this optimism. “The last steps before approval are often the most critical, but everything indicates that the SEC is ready to move forward,” he said. According to him, only a few minor adjustments remain before the final approval is granted, an encouraging sign for the cryptocurrency market.\n\nThe approval of Ethereum ETFs could have major repercussions for institutional and retail investors. By facilitating access to Ethereum through regulated financial products, this decision could not only bolster the credibility of cryptos but also attract a significant influx of capital. This new liquidity could increase market stability and reduce volatility, making cryptocurrencies more attractive to a broader audience.\n\nIn the long term, this approval could serve as a catalyst for other regulatory initiatives favorable to cryptocurrencies worldwide. Regulators in other countries are closely monitoring the SEC’s actions, and approval could prompt other jurisdictions to adopt similar measures. This could accelerate the global adoption of digital assets, driven by increased investor confidence and continued innovation in the sector.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQRFZFNGRvSS12RWs1a1VXTWRlSHlNTm9vMHRaVGJUZ1hHYks1ZHE2MkxFdVJrQzMzYk5HT0lIbHpVWHlyNC1jRjZlU3FrTldyc2NEMHZKTFd4WE9lbl9LS1U1Z2hKTS1PR0NPd2lYdFlqcGtHTmFsS3NjcjYwNnZVcndQdWI4Q0hZcFZrejZ5Vm9FWTQ5UWfSAZsBQVVfeXFMT2xIcUpFLVBsUmNvci1PSHFlOUx6ZVNhY2dHQzYzQkdOWWViMC04dllfa1V3VUtWNVFRcjMyRVVQNDM0RTlCdGxTdjNsMG40MHJCSmdwdHVRSlRmdHBPZGhHT0QydnhtSE5IWGZwQ3hJMDBoSEdHYklCTkI4UVMwNDl1OEtkRUZGTUZYNzhuTDlJMDNOMVY2NTQtU00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "$64.4 Million ETH Allegedly Withdrawn From Ethereum Foundation: What's Going On? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRecent reports by crypto journalist Colin Wu reveal a significant transaction involving Ethereum (ETH), worth $64.4 million. The funds were moved from an account previously associated with the Ethereum Foundation, identified as \"0x8e23,\" to a newly created address, \"0x8798.\"\n\nAdvertisement\n\nThe original transaction in which the Ethereum Foundation sent 44,167 ETH, then worth $40,930, to \"0x8e23,\" took place nine years ago on Nov. 20, 2015. As of now, this amount of Ethereum is equivalent to $154.58 million.\n\nThis is not the first time that one of the key entities associated with the major altcoin token may have sold its ETH. However, it is one of the largest in recent times, with previous recent cases not exceeding 100 ETH, or $350,000.\n\nAdvertisement\n\nAt one point, Vitalik Buterin, the founder of Ethereum, justified these sales with the need to cover the operating costs of the organization, or charity. Whether the possible sale of ETH worth tens of millions of dollars is justified by such a need remains a question.\n\nEthereum (ETH) price outlook\n\nMeanwhile, the price of the main altcoin continues to torment traders in the range of $3,400 to $3,900, and it still will not update its all-time high at $4,868.\n\nETH to USD by CoinMarketCap\n\nUncertainty is added by the low-liquidity summer market and confusion with the dates related to the approval of spot Ethereum ETFs. However, experts expect the situation to be resolved soon."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVGQzdEVuWkdoSHBGMzAtMjJNazhSZl9PNzlpRnFsM2dRWnlqekdKQU1tdW9FcUZEbXZQcW9PY0NZV2FYd25uNTczYVpvNWlVRjhBUzAtdjNBRkFuanFNSHB0VmJCbE5WOXJrZFpSX2lheUpUQzA1U0RGQ09IemFUQmdIajRldlZsb3A3cF9lNDc5bk9Iek5uSWJMamp0NnZOZUp6RHZzZEl1V0hiU09DUGt4eDNSdzY1SzR1ZW5ublNxYVlxak5Kbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "BlockDAG X1 Beta App Pioneers in Crypto Mining Amidst Ethereum vs Solana Rivalry and XRP Price Increase - FinanceFeeds",
        "content": "BlockDAG is making headlines with the launch of its X1 mobile mining app. As Ethereum and Solana battle for blockchain supremacy and XRP strives for a market recovery, BlockDAG is carving out its niche with innovative solutions that simplify and democratize crypto mining. The X1 app, designed for both iOS and Android, transforms any smartphone into a powerful, energy-efficient mining device. Its user-friendly features, including easy sign-up and rewarding referral systems, make it an attractive option for both new and experienced miners.\n\nEthereum vs Solana: A Battle for Supremacy in 2024?\n\nThe ongoing competition between Ethereum and Solana is intensifying, with both blockchains showing robust growth. Solana has recently eclipsed Ethereum in terms of active addresses and trading volume, boasting over one million active addresses and climbing, challenging Ethereum’s market dominance.\n\nAlthough Solana is advancing, Ethereum maintains a strong position due to its comprehensive security measures and network activity. Industry experts believe that Ethereum’s dedication to security and scalability will help it retain its leading role. As this rivalry deepens, the crypto community is eager to see which blockchain will lead beyond 2024.\n\nXRP’s Market Recovery Post-SEC Legal Battle\n\nXRP has encountered notable hurdles, particularly following the SEC’s lawsuit against Ripple, which caused it to fall from the third to the seventh position in digital asset rankings. Despite the ongoing legal battles providing some clarity, Ripple faces unresolved regulatory issues that continue to affect XRP’s market performance.\n\nCrypto enthusiast Bill Morgan pointed out that XRP is lagging behind its peers. For XRP to experience a price recovery, it needs to overcome these regulatory challenges and secure key support levels. The future of XRP is filled with uncertainties, leaving the community watching closely to see if it will regain its previous stature.\n\nRevolutionising Mobile Mining: BlockDAG’s X1 App\n\nBlockDAG’s X1 app is transforming the mobile mining landscape with state-of-the-art features that ensure efficiency and simplicity, positioning BlockDAG at the forefront of the crypto mining industry. The app provides an energy-efficient mining process that doesn’t drain mobile devices, making it ideal for novice and experienced miners.\n\nAvailable for iOS and Android users, the X1 app offers an intuitive mining experience, democratising cryptocurrency mining. The app also features an easy sign-up process, a unique referral system, and rewards for daily activity, allowing users to boost their mining rates by participating regularly or inviting others.\n\nBlockDAG has made a splash at major tech events in Shibuya, Las Vegas, and Piccadilly Circus, showcasing its technological advancements and drawing significant investor interest. Notable events, such as the keynote at Shibuya Crossing and displays in Las Vegas and London, have emphasised BlockDAG’s commitment to innovation and its global influence.\n\nThese showcases celebrated the launch of DAGpaper V2 and its listing on CoinMarketCap and enhanced the project’s visibility and credibility. With over $50.4 million raised in pre-sales, more than 11.4 billion BDAG coins distributed, and $3.2 million from miner sales, BlockDAG has cemented its status as a major contender in the crypto space.\n\nKey Takeaway\n\nBlockDAG’s X1 beta app, equipped with cutting-edge technology and user-friendly features, is reshaping the landscape of crypto mining. As Ethereum and Solana vie for dominance and XRP works through its legal dilemmas with hopes of a price rebound, BlockDAG continues to draw substantial investments, underscored by its $50.4 million pre-sale achievement.\n\nThe app’s seamless mining experience and strategic marketing in major global tech hubs position BlockDAG as a significant player in the cryptocurrency industry. For those looking to invest in the next big thing, bypassing traditional Bitcoin mining calculators and exploring BlockDAG’s X1 app offers a lucrative opportunity.\n\nInvest in the BlockDAG Presale Now:\n\nPresale: https://purchase.blockdag.network\n\nWebsite: https://blockdag.network\n\nTelegram: https://t.me/blockDAGnetwork\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nThe subject matter and the content of this article are solely the views of the author. FinanceFeeds does not bear any legal responsibility for the content of this article and they do not reflect the viewpoint of FinanceFeeds or its editorial staff.\n\nThe information on this page does not constitute advice or a recommendation on any course of action and does not take into account your personal circumstances, financial situation, or individual needs. We strongly recommend you seek independent professional advice or conduct your own independent research before acting upon any information contained herein."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxON3kxdGZXRno1LWsyS3p5cG9tU01JTGdWVm9yWXlkd2tGV09GMFZSRm5mQ1pQU0JCSWRlSGEyVE9QRTRpLUM0WHdlTHlpendmY3N3RmFkSFJSQVJSX1RtcExrUjJUczktblg2UDM3Z3hXem4xSnB2elQ5OHl1YjBsenZUdnl3YUhfTXJlcm9PajhXelJXa09leUp3S196MV8ta3NjOXhkSnB6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whales on $2.45 Billion Buying Spree Amid Market Volatility - Crypto Times",
        "content": "Ethereum whales have been on a massive buying spree lately. In just three weeks, they scooped up over 700,000 ETH worth a whopping $2.45 billion according to On-chain analyst Ali Martinez\n\nThis accumulation happened during a period of wild swings in crypto prices that triggered over $215 million in forced trader liquidations, with $50.61 million coming from bets on Ether.\n\n#Ethereum whales have bought over 700,000 $ETH in the past three weeks, totaling approximately $2.45 billion! pic.twitter.com/sfmXnkqD49 — Ali (@ali_charts) June 15, 2024\n\nThe whales’ huge Ether purchases coincided with a volatile stretch for Ethereum, the second-largest crypto. ETH prices plummeted to $3,368 on June 14th before recovering to around $3,500 in the following days. The price movements crushed traders on both the buying and selling sides by automatically closing out their positions when they ran low on funds to back their bets.\n\nThough Ether is still up 2.31% over the last day to $3,565 at press time, it had suffered a 2.96% weekly decline prior. Derivative markets had been bracing for further falls before last Friday’s options expiration based on bearish trading data.\n\nWhile the market turmoil caught many off-guard, blockchain metrics suggest things may be steadying. A key indicator tracking investor profits being cashed out spiked before flattening, which analysts see as a potential sign of selling pressure letting up between $3,400 and $3,600.\n\nAdding to the long-term bullish outlook, a spot ETF for Ethereum could launch on July 2nd, according to Eric Balchunas."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPSXVCbmtVbE1mVlhYcTRGVEd3dXR6WHNZUjF2eXVLSjJEQ1ZidzE0blA3cGVXNzFvdlV5cGxnVzhlOWlqVjNqWEV0NXAxRGVPTjNKV3hPU0xpSnhhc0ZfdkJZbkk1ZTJCcGdMZW1yekNRSkczdHRYTlhpNWlsdHU1WjJyc09lUmPSAYwBQVVfeXFMTjc4YTRVSnRVTWY1YW9oZE1KNDhhbmJ4dUVRanpIUklydk5GbnFHbjZEbTh1a29HQ2k0eFFxYXFsVlE4RDRBN29QT09QSUE2eDZHeFhKTy1uUjRjUHNkdmZSYnBPTnQ3Ukt6Ri1UbXdNd2dzMVd6SkRTNWRiaGVxQWE3STNMaXBwLXFsY3g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: When Is Ethereum Price Poised Reach $4,200? - CoinGape",
        "content": "Ethereum price jumped 8% over the weekend as the asset experienced renewed investor interest. The price dipped to $3,362 before beginning an uptrend throughout the weekend. By Monday’s European business hours, ETH hovered around $3,586, marking a 1.2% increase in 24 hours but a 2.7% drop over the past 7 days. Meanwhile, Bitcoin’s price remained in a consolidation zone, with an anticipated directional move expected soon.\n\nEthereum Price Prediction: Bulls Take Advantage of Major Support\n\nadvertisement\n\nETH price witnessed an 8-day continuous fall last week, going from $3,878 to $3,362. In the drop, the asset broke a critical support level responsible for holding it above $3,650. Bears took advantage of the ensuing panic to drive prices even lower.\n\nThe bulls eventually utilized another stronger support structure between $3,400 and $3,250 to bounce Ethereum price action back into an uptrend. The asset may have entered another consolidation zone between $3,600 and $3,300, but it is too early to tell. The bulls’ main challenge lies in breaking above the $3,600 support-turned-resistance. If they succeed, ETH price may rise to $4,216, with some resistance around $3,800 and $3,900.\n\nMeanwhile, Bitcoin is at a crucial place on its daily chart, trending around a key support level ($65,000). On Friday, bears managed to push the price below the support level, but they were met with hostile rejection from the bulls. A clean break below this level would result in a further downside to $57,000. On the flip side, this support level is strong and has been tested three times before. A bounce from here may result in a BTC price surge to $72,500. A break above this might easily launch Bitcoin to new all-time high prices.\n\nSpot ETF S-1’s Will Likely be Approved by the End of Summer\n\nGary Gensler, Chair of the Securities and Exchanges Commission (S.E.C.), hinted at a likely Ethereum ETF S-1 approval by the end of summer. This news may have likely caused the reversal in Ethereum price over the weekend.\n\nMeanwhile, Ethereum blob usage has been trending up for about 5 weeks now as rollups continue to see more and more activity. Blobs improve the efficiency of Layer 2 (L2) transactions, reducing congestion and potentially cutting down on gas fees.\n\nBottom Line\n\nSpot ETFs for crypto assets have historically been great price boosters. As summer approaches an end, the crypto markets watch closely for Ethereum Spot ETF approval. By releasing this information, Ethereum investors are now in a buy-the-rumor phase that may last until the eventual approval of the ETF.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPM0x6TE5tMWI3VER3SU5aVEdzcDlTTDFkVm1BTDdHNkZrc2FlWkVPZVJLbWU0TU9BOTdyLXQ5MGw3UnVjeU05R000R21MV0VDc3VTQl9uQ2JPdlV1VlNVYXQ5aF9YVWZjc1A3M2x0bU5ET1djQ0VLQ1dycUNFUjJHaGxDSHbSAYoBQVVfeXFMUE5WckQ5eUNKMjlPSjBQYkFGWm92N0dnQV9UdE1ibFN5UTVaRzJfdG9laGMwbGx6YXlZMGNER2s3dlVzTzdDWnVxMTl3Vi1pZDBIRlNXUU5zUUtqblFUMFM1OUt1Si05N0VjNTRLN2YtcWRicGJWdDA0Q2xQODQ0ZE0xa0p0WnR2S0J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Will the price of Ethereum grow as whale interest rises? - AMBCrypto News",
        "content": "Whale accumulation of ETH grew, according to recent data.\n\nNetwork growth and velocity of ETH fell materially.\n\nEthereum’s [ETH] recent dip in price did not reduce the optimism that traders and investors had in the slightest.\n\nEthereum whales start to buy\n\nRecent data showed that Ethereum whales, or large-scale investors, have accumulated over 700,000 ETH in the past three weeks, representing a total of approximately $2.45 billion.\n\nThis significant buying spree suggested that these whales believe in the long-term potential of Ethereum and view the recent price dip as a buying opportunity.\n\nTheir actions could be a sign of confidence in Ethereum’s future, potentially keeping the cryptocurrency’s price stable.\n\nAt press time, ETH was trading at $3,569.40. After slightly going below the $3,400 levels, the price of ETH bounced back, presumably due to the eagerness of the whales that accumulated ETH.\n\nEven though this uptick was significant, it wasn’t profound enough to break the bearish trend that was established by the price after the 27th of May.\n\nAfter the price exhibited the double top pattern during this period, the price of ETH witnessed multiple lower lows and lower highs.\n\nThe price of ETH would need significant bullish momentum for it to break out and reach new highs. Unfortunately for ETH, the CMF (Chaikin Money Flow) was observed to be declining.\n\nThis meant that the money flowing into ETH had decreased. A declining CMF paints a bearish picture for ETH’s future.\n\nIn contrast to the CMF, the RSI (Relative Strength Index) for ETH had grown materially over the last few days, indicating that the bullish momentum around ETH was rising.\n\nIf this bullish momentum continues to grow, ETH may test the $3,607.30 level again and weaken that resistance. Moreover, the possibility of a reversal would also grow, if this ends up happening.\n\nLooking at on-chain data\n\nAMBCrypto’s analysis of Santiment’s data revealed that the Network Growth for ETH had declined.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nThis meant that the number of new addresses showing interest in ETH had significantly fallen over the last few days. This indicated that new addresses weren’t willing to buy ETH even at the current discounted prices.\n\nMoreover, the velocity of ETH also fell, implying a decline in ETH trades, which is also not a positive sign."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxNeVlFeHYtTTlXVGdqc28zb0ppcTRKek02dVN6bzZGOWZzbU9mb3NkTDdDN2FWN3lMRlNXRzQyU2pkN29pOXN3RFNMUE9pRmhUWE9ENlVVWF9GUjVFNl9SbGJYaW54SFdxUDBvaDRoTjdfRUd3ZFJxYldjUzdoNXBRQ0FTbFhiOEtDSmY1YndqX2JCQkRXWFpiZmROUmluLTZTZFZNMWFBVVNjRktwY3RjdkdsZEVXWXNnTWZzZkJYY25QLTNHRHNXSWgwYmkwOHJvSmY1QzF5R0s2LXRRQVF0UDhSSW5URHBWeU45ZEZvMlRLU2JqYUh0REVPVkNfYmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Heats Up: Ethereum ETF, Bitcoin's $85K Prediction, and Furrever Token's Referral Rewards - GlobeNewswire",
        "content": "New York City, NY, June 17, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is buzzing with excitement as several key developments take center stage. Ethereum's anticipated ETF approval, Bitcoin's potential rise to $85K, and the growing interest in Furrever Token's unique referral rewards are capturing the attention of investors worldwide.\n\nEthereum ETF Anticipation\n\nEthereum is on the brink of a significant milestone with the potential approval of its Exchange Traded Fund (ETF) by the U.S. Securities and Exchange Commission (SEC). Market analysts predict that this approval could occur as soon as July 2, marking a crucial step forward for Ethereum. An approved ETF would offer a regulated investment option for both institutional and retail investors, likely leading to a substantial influx of capital into Ethereum.\n\nRecent comments from SEC Chairman Gary Gensler have fueled optimism, suggesting a favorable stance towards ETFs. Bloomberg's Eric Balchunas notes that the final approvals may follow minor adjustments between issuers and the SEC. This development could pave the way for a significant market event, boosting Ethereum's price and solidifying its status as a mainstream investment option.\n\nBitcoin Targets $85K\n\nBitcoin (BTC) is poised for a potential surge to $85K, driven by increasing mining costs and historical price patterns. The relationship between rising mining expenses and Bitcoin's price suggests that BTC could reach new heights as miners seek profitability. Historically, Bitcoin's price has often increased to match or surpass mining costs, indicating a potential rise to $85K.\n\nThis upward trajectory is supported by growing institutional interest and favorable market conditions. Analysts forecast that Bitcoin's price could exceed $85K, driven by heightened demand from both retail and institutional investors. The strong fundamentals and increasing mining costs create upward pressure on Bitcoin's price, making this prediction plausible.\n\n\n\n\n\nFurrever Token's Delightful Rise with Referral Rewards\n\nFurrever Token, a cryptocurrency themed around cats, is making a notable impact with its innovative approach and engaging referral system. Designed to create a joyful and engaging experience, Furrever Token aims to build a whimsical crypto ecosystem centered around delightful cat imagery and community involvement.\n\nThe token's referral system is a key feature, offering users a 10% bonus in $FURR tokens for every deposit made through their personal referral link. This incentive has significantly driven community growth and engagement, allowing users to earn additional tokens and actively participate in the ecosystem. Currently priced at $0.000732, Furrever Token offers presale investors the potential for up to 15X returns post-launch.\n\nHaving raised over $1.3 million in nearly three months, Furrever Token is in stage 9 of its presale, with a goal to raise $1.9 million. The anticipated launch on PancakeSwap is expected to draw considerable interest due to the token's unique appeal and innovative features. Furrever Token's mission to foster a fun and vibrant crypto community sets it apart in the crowded market, attracting both new and experienced investors.\n\nConclusion\n\nThe convergence of Ethereum's potential ETF approval, Bitcoin's expected surge to $85K, and Furrever Token's engaging referral rewards is creating an exciting landscape for crypto investors. As Ethereum moves closer to regulatory approval, Bitcoin aims for new highs driven by rising mining costs, and Furrever Token offers unique community-driven opportunities, this period marks a significant turning point in the digital finance narrative.\n\nInvestors looking to capitalize on these dynamic developments may find substantial rewards in the coming months. Whether you're interested in Ethereum's ETF-driven growth, Bitcoin's bullish outlook, or Furrever Token's charming and profitable ecosystem, now is the time to explore these opportunities and potentially realize significant gains. The crypto market is heating up, and these developments are set to make waves across the financial landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5NOFlFdGY3Y3lVYVc0MmMyWFZXMlgzQnNWdnc5MG1TS0lvQ2Q1czN0LWxsZXl0bkJjOEl2YUJHbzVUeG9zT0gyRklkbUxiY243Sjl1dFlLblFfb0otbklMSXR2REU3NUtKUkZwNjl6UXFLejM4cGRaM25zWdIBgAFBVV95cUxPY3BIWjdTUG40Yk9Jd25WNFpkaWtFOU9RYUdvLWRySmxxOEFmMjhnN3otTm1uT2o5NlhqdmNZNU1mWkdTMDJUdGRtOVhTcTVSWVpOZkloUHU2M0xYVGFxdGJaVURfZ2I5bFhDVGQ1am1QcjBhY3VFbkVjbHdqdjhmRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Open Interest gains by $1B – Impact on ETH? - AMBCrypto News",
        "content": "While Open Interest increased, Funding Rate stalled.\n\nThe price of the altcoin might keep swinging between $3,400 and $3,600 in the short term.\n\nOne day after Ethereum’s [ETH] Open Interest dropped to $13.14 billion, it added another billion to its value. At press time, the Open Interest (OI) was $14.10 billion, according to data from Glassnode.\n\nOI is the value of outstanding futures contracts in the market. Whenever it decreases, it means that traders are closing positions related to the cryptocurrency. However, an increase suggests otherwise.\n\nSpeculation is a ticket to a new high\n\nThus, the rise in Ethereum contracts indicates increased speculative activity regarding the altcoin. In many instances, an increase in OI offers strength to the price direction.\n\nFor ETH, it might not be different. As of this writing, ETH changed hands at $3,563, representing a slight 1.10% increase within the last hour.\n\nBy the look of things, this could be the start of a significant uptrend for the cryptocurrency.\n\nHowever, the trading volume had decreased by 35.36% in the last 24 hours. The decline in trading volume is a sign that activity involving ETH was lower in the spot market.\n\nIf spot market activity continues to drop while trading in the derivatives market increases, ETH’s price might stall around the $3,500 to $3,600 region.\n\nBut if buying pressure in the spot market increases, the altcoin might jump in the $3,800 direction.\n\nSkepticism lingers\n\nDespite the outlook, Ethereum’s Funding Rate has remained stagnant since the 8th of June. Funding Rate is the cost of holding an open position in the derivatives market.\n\nIf funding is positive, it means the contract price is trading at a premium to the spot price. In a situation like this, longs pay short to keep their positions open.\n\nOn the other hand, a negative funding implies that shorts are paying longs. Also, the contract value of the cryptocurrency is at a discount.\n\nFor ETH, the low Funding Rate and high price means that spot volume might soon begin to pick up.\n\nIf this is the case, the reasonable inference could be a bullish move for Ethereum. Nonetheless, the price of the cryptocurrency might fail to hit $4,000 in the coming week.\n\nIn addition, AMBCrypto looked at the Taker Sell Ratio. To get this ratio, we need to divide the sell volume by the total perpetual swaps.\n\nWhen the ratio is lower than 0.5, it means that selling pressure has decreased. However, a value higher than 0.5 indicate the selling is dominant in the market.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs of this writing, Ethereum’s Taker Sell Ratio was 0.50, according to data from CryptoQuant. If the condition remains the same, ETH’s price might struggle to close in on $4,000 as mentioned earlier.\n\nIn the coming week, the value of the cryptocurrency might trade between $3,400 and $3,600 as it did in previous weeks."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZmtHaHBoeEMxdUdVUjM4cWh0eWhYZXA5YWc2bE1jZmJtdkVNVnVmajB4eWRNZVdlYXl2UkRPXzR4dHJqWGhmTzZkV1VMRERPbmZfejJLa3lqUTdjMUdHaktOcFVTTDgybkRhallaWmswYWtBVkJiLTZSYl9MSk91Wi0ybWg2V0NNRjdZeDZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Unleashes a Huge Wave of Liquidations! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nTurmoil reigns again in the crypto markets, shaken by a violent financial storm. Indeed, a sudden surge in position liquidations has swept across the ecosystem in the past 24 hours. This unexpected tidal wave has brought Ethereum to the forefront, potentially marking a decisive turning point in the evolution of crypto investment trends.\n\nStaggering Figures Galvanize Crypto Investors\n\nAccording to the data, total liquidations jumped 78.8% in one day, surpassing 75 million dollars, even as total open interest declined by 0.35%, to 66 million. In detail, 43.9 million long positions and 31.6 million short positions were liquidated.\n\nHowever, it is Ethereum that dominates, with over 19 million in liquidations, including 5.6 million in longs and 13.5 million in shorts. This amount is significantly higher than Bitcoin’s, at 8.2 million. This feverish surge undeniably propels Ethereum to the forefront of the crypto scene.\n\nCrypto Liquidations\n\nA Rebalancing of Forces on the Chessboard?\n\nThe main platforms concentrate most of the movements, with Binance capturing 38.7 million in liquidations and OKX 23 million. Beyond the figures, this episode could mark a major turning point in crypto strategies. The increased volatility of Ethereum, combined with its potential, could indeed prompt many investors to reconsider their allocations.\n\nA dynamic of capital redistribution in favor of Ethereum and promising altcoins thus seems to be emerging. This show of strength could initiate a lasting paradigm shift, where diversification and calculated risk-taking become the new watchwords.\n\nThese jolts may be only the beginnings of a profound reconfiguration of balances in the crypto universe. By taking the lead in this surge of liquidations, Ethereum appears to send a powerful signal in favor of increased diversification of investment portfolios. A new era might thus dawn, where wise risk management and the exploration of varied opportunities become the new niches for success in these turbulent markets.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQejdOZW85ci13WU1PUGJlQV9YaVNUYzI3eVNKVnFsazRIZVVZZWJXYzM0alBERmJzdEQ0UEt2VjZHSjVNTVM1czVqaHJVMmlLZ3NtcXI1RThnZDVhU0hvbEdYbUZpMkJtYjFfaTc4WlIzOHRBNTJDUE9BakhtdThuYlJ6b1R1eDhIcFgzYTZlSm9sTWRFY0xSZWNURjBMcjVPUjdnSkpVUlNZQUI5LTRSRlN2ejBRMmxFR0ROYmdDYUdTNVRYdWRCbzZtYUcweFJndzdqelBMNTFlZkoxRFpIMm9uUGt0UdIB6wFBVV95cUxNWFRwcWR1ZUFCdEtpTDBCWjhXT25xclhmdVhHVDYydTdYLVg4WWpfSnpGNC11REJDSjhOX1VhTldyVGI3TUlMRWdEem5NdlBBLWYxUjNaUVFYRi0tRHlTbnNkalR4WGpibWIzTXV2bDNJSFFNLTdnbHk5bWx3MTdPN2l5RWdXRjF6Rl9vLTRYLWNpaEdGYzJuMkVtOEpLOWpjUWZlOFZFeGJDTzVkams0NVpxeGswUFNXQkdQSDBvN0pzOVdyOE5XczExZnhya1FwWEllbXdfdnFPaVUzRUZJc29LSkQzX1h5RFlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin retesting its major resistance level - FXStreet",
        "content": "Bitcoin price is retesting its weekly resistance level of $67,147.\n\nEthereum price finds support around $3,321, the price imbalance between $3,146 and $3,498.\n\nRipple price faces rejection due to the key resistance level of $0.499.\n\nBitcoin (BTC) and Ripple (XRP) prices are poised for short-to-midterm corrections, while Ethereum (ETH) hints at a potential rally.\n\nBitcoin price faces resistance at a major level\n\nBitcoin price daily candlestick closed at $66,043 on Friday and is currently moving upward toward its weekly resistance level of $67,147.\n\nIf BTC breaks above this weekly resistance level and flips it into a support zone, then it could rally 6% from the point of breakout to reach its previous resistance of $71,280.\n\nHowever, if BTC fails to break above the $67,147 level, then it could have a short-to-midterm downward correction in the coming days, tagging the midpoint level of the price imbalance between $63,118 and $64,602 at $63,813.\n\nThis midpoint level also roughly coincides with the 50% retracement level at $64,258, calculated from the swing low of $56,523 on May 1 to a swing high of $71,994 on May 21.\n\nIf BTC bounces off $63,813, it could rally 6% to reach its previous resistance level of $67,147.\n\nIf the bulls are aggressive and the overall crypto market outlook is positive, then BTC could extend an additional rally of 6% to reach its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if Bitcoin price breaks and closes below its daily support level of $60,800, the bullish thesis would be invalidated, leading to a 4% drop to its weekly support level of $58,375.\n\nEthereum price poised for a rally\n\nEthereum price bounced 7% from a low of $3,362 on Friday to its current trading at $3,614.\n\nThe $3,362 level roughly hovers around the 61.8% Fibonacci retracement level and the price imbalance midpoint between $3,146 and $3,498.\n\nIf this support holds, ETH price could rally 10% from its current trading price of $3,614 to tag its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,279 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,864.\n\nRipple price is set for a correction\n\nRipple price faces resistance at its daily resistance level at $0.499.\n\nIf this resistance level holds, XRP could experience a 7% short-to-midterm downward correction from its current trading price of $0.488 to its recent low of $0.450.\n\nIf the bears are aggressive and the overall crypto market outlook is negative, then XRP could extend an additional decline of 7% to reach its previous low of $0.419 from April 13.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the Ripple daily candlestick closes above $0.499, XRP could rally roughly 7% to its previous high of $0.532 on June 5."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNNWdtcmhPV2Y5SGJ5clM4YXNyVE9mTW1raERDZE5OU3ZMMGtIVjFVSk9taFp1NHNZRllGU1FHeW1KS09JQXp4NHBxcExZa2VfcGRTcTI0UGEtRGtpS1NYQUFzcWJqMkwtc1VCdGdLSGtod1diWmhFajY4ek9kWXZsYnpzd21DMU1YNmNpMXVZSk15Y3BJT1dQUm9iQlXSAaIBQVVfeXFMT1VVSUU3aWVGelgzZWdnckNuRWt2NjhPX2F5dEJwc1h3clJkaWhDazMwQ2doTWNub3JrRmp1Q3NWbXpjY2dhVWhFUm1wbVFvT3ZVY241Yi1FWDNaTmhpVjgzd205aVRaQ0I5T1pzR1VNRTZkRk94UWRuWnQ4RVRxbWY3R0NKLURRZ1BiYlAxdkxmWDJ5dlR6MVFpMXBKN0E4ZzZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum continue to see green as self custody rises and whales sell? - AMBCrypto News",
        "content": "Many Ethereum addresses withdrew their holdings on a considerable scale\n\nOverall interest from new addresses in ETH declined\n\nEthereum [ETH] recorded a major correction in price on the charts, despite the anticipation associated with spot ETH ETFs and their impending launch.\n\nEthereum self-custody on the rise\n\nIn fact, Santiment’s data revealed a shift in the distribution of Ethereum holdings. There’s a trend of users moving their ETH away from exchanges.\n\nOn the one hand, the top 100 exchange wallets recently dipped below their May 2018 all-time low. They are now currently holding only 8.41 million ETH – Implying a fall in the concentration of Ethereum on exchanges.\n\nOn the other hand, the top 100 non-exchange wallets were at an all-time high of 68.39 million ETH, signifying a rise in self-custody. This means that more users are now taking control of their own holdings by storing them in wallets they control directly, rather than keeping them on exchanges.\n\nIf this trend continues, it could help Ethereum’s claim to decentralization. A more distributed network, with less reliance on centralized exchanges, aligns with the core principles of blockchain technology.\n\nHowever, reduced liquidity on exchanges, caused by a decline in ETH holdings, could lead to higher price volatility for Ethereum. With fewer coins readily available for buying and selling, price swings could become more significant in response to market changes.\n\nEven though higher self-custody could be seen as a positive development, there are other concerning factors for ETH too. For instance, some large addresses have been selling a significant amount of their holdings, without accumulating.\n\nThis could impact ETH’s price negatively in the future.\n\nIt’s worth noting, however, that retail investors continue to show interest in ETH, despite the dip in price.\n\nRetail interest declines\n\nAnd yet, even though retail investors have been showing interest in ETH, it hasn’t been significant enough to move ETH’s price. Additionally, the network growth for ETH also declined over the past month.\n\nThis meant that the number of new addresses showing interest in ETH reduced. A declining network growth also means that the accumulation of ETH was being done by pre-existing holders.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, the velocity at which ETH was trading also fell over the last few days. Simply put, it implies that the frequency with which ETH was being traded declined significantly."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxON0xodHBfSnVmRG9iMGVDRnVIQ01mZ1AzUjIxdkFtQTBLZUcxOVF6bVpMaEdCN2dtck1hTlUxdHM2dmZtRW1HYTNrMUJPSHl0clBwWHVqcGU4ZFhEaWRHbjNCVEZNaUZ0NXUxX3I5aHpKa20xV19WS1ZYSVAzU1dxSV9DQXBnNWp6NkxDUUNBUXBfbXNUeFZXTWVHem0xLWhiU1p2aVJvTDZEOVRGZndIejY3dDdJY2l2Z1Vr0gHAAUFVX3lxTFBQR1VlaTFhOEdwcTR0MURodE5CTlRDZ3Rvd1lpT085eEZoS3VWUmZacDM0MFBWVW1aUFQ2S3k2WE5lN2ljbF9GUHI5NVd2MFdibC1OVHdPUHE5WEY1NGFLMTdLbjFQOGRFLWNLalRHYXQ1UjJCM2FDand0NE5IWm1KRkFQTDljWmZtRlZGQmdQS2t1dkRQSWZuRXdVYTBLdHN5Z3VNX2xrZFdJMXRpTEpDYmRNbER1d3BzVWhzaW5GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Watch now: ETF Edge on India, Ethereum & Gamestop... Plus, Kyla Scanlon on her \"Vibecession\" - CNBC",
        "content": "[The stream is slated to start at 1:15 PM ET. Please refresh the page if you do not see a player above at that time.]\n\nCNBC's ETF Edge is dedicated to the fastest-growing trend in investing right now: ETFs. Every Monday, Bob Pisani will be joined by a panel of top market participants to offer educational and actionable advice to help you build your best portfolio."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBaV2Jrb20zU28xdl8yUlA1VEhPUzVhQlBXc1AtQi15OThPc3pfdXg0UGtFcUpoVGFtRTVmcTdjdnhyblBpWEd2d2NCaHBBam5Gb0RBOHJuZEd4cTRuemlOQnBPOUloVExFZmFXMW5EUk1Jd1FoYVdLWm1vQ1DSAYIBQVVfeXFMTzlTdGtjNVpkQXNmY3lXbHRYMHBrWV9ZQWFQSHZkcE1EYnBIZzd2U2NoTkV5WjBydXV3aVlZMzNwTnFhaDBNNWpRaTgtRnFqQW95WWdFQkRyZXprakJUdXRVVFJkbmlQS3BFZmJ2SEFobnNDR3JEeXB3MEZEcXR1Vk8zdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s big hint: Last chance to buy ETH at $3,500? - AMBCrypto News",
        "content": "Ethereum’s price declined by more than 3% in the last 24 hours.\n\nA key indicator suggested that ETH was near its market bottom.\n\nEthereum [ETH] bears continued to dominate the market as the token’s weekly chart remained red.\n\nHowever, the entire situation can change, as the latest data revealed that this might be the last stage of the accumulation phase for altcoins.\n\nSince Ethereum is the world’s largest altcoin, the chances of ETH gaining bullish momentum seemed likely.\n\nLast chance to buy ETH\n\nCoinMarketCap’s data revealed that ETH’s price dropped by more than 3% in the last seven days. At the time of writing, the king of altcoins was trading at $3,553.33 with a market capitalization of over $426 billion.\n\nMeanwhile, Milkybull, a popular crypto analyst, posted a tweet highlighting how altcoins were following its 2020 trend, which resulted in a massive altcoin season then.\n\nIn 2020, the altcoin market cap broke out of a pennant pattern, initiating a bull rally. A similar pattern has once again emerged, hinting that this might be the last opportunity to buy alts, including Ethereum, at a lower price.\n\nHowever, AMBCrypto’s analysis of Santiment’s data revealed that investors were not capitalizing on this opportunity.\n\nWe found that ETH’s exchange outflow declined over the last week. Additionally, its supply on exchange also increased, meaning that selling pressure on the token was high.\n\nIs Ethereum awaiting a rally?\n\nSince Milklybull’s analysis hinted at a bull rally, AMBCrypto then analyzed ETH’s on-chain data to see whether it supported the possibility of a price increase.\n\nEthereum’s Pi Cycle Top indicator revealed that ETH was resting near a market bottom, hinting at a price uptick.\n\nIf that happens, then ETH might soon reach $4.92k. For starters, the Pi Cycle indicators are composed of the 111-day moving average and a 2x multiple of the 350-day moving average of Ethereum’s price.\n\nThe possibility of ETH gaining bullish momentum seemed high, as at press time the token’s fear and greed index had a value of 38%, meaning that the market was in a “fear” phase.\n\nWhenever the metric reaches that level, it indicates that the chances of a bull rally are high. We then took a look at ETH’s 12-hour chart to better understand what to expect from the king of altcoins.\n\nThe technical indicator MACD displayed a bullish crossover.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the rest of the indicators looked bearish. For instance, the Relative Strength Index (RSI) registered a downtick.\n\nThe Chaikin Money Flow (CMF) also followed a similar declining trend, suggesting that it might take a bit longer for ETH to begin a bull rally."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNblZ6R05wNFl0VUhwYzhzMmZtS3RYVzAtWXEyMkptckhGX2ZhWkktWmZ6OHU0d3hyUjZBQ3p2el9QTnlsYk56cW9qZ2JpZnBHbG9VVEtjTDNoRFlwa0hxakJSSEY3QnFnUDdidXlCMFctclBHS1hBLUFZMzVBTmN1TF83U0c1Ni1STVlRN2lR0gGTAUFVX3lxTE96WHdzSU1BS0VtNkdlYjZfVVlidmxnbkpDclJ2N2lGR0Z2eThmdmdjNjlVRlVTTnVqSjFhN0hNSW9SSlFJWHU1WFJxX2tlLUpGYkRTcFVWUTFzWGhja1hRMVZmZ1gzb0JVa3U3TGdsU003MkdvNzdOZUJNU2tycVRodkFqZWxSVmFuX0JRN3M2Sjlnaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Solana beats Bitcoin, Ethereum on THIS front: Will SOL also rise? - AMBCrypto News",
        "content": "SOL’s monthly NFT transactions were much higher than Bitcoin, Ethereum.\n\nETH’s weekly sales volume increased, while SOL and BTC dropped.\n\nSolana [SOL] continued to dominate the NFT ecosystem last month, followed by stalwarts like Bitcoin [BTC] and Ethereum [ETH].\n\nLet’s dive deep into these blockchains’ performances in the NFT space to better understand who is actually leading the market.\n\nSolana takes the cake\n\nCoin98 Analytics recently posted a tweet highlighting the performances of multiple blockchains in the NFT space.\n\nAs per the tweet, SOL was the market leader last month in terms of the total number of unique traders, as its number touched 308k.\n\nSolana was followed by Bitcoin and Ethereum, which had 129k and 74k unique traders, respectively. Polygon [MATIC] and Aptos [APT] completed the also made it to the top three of the same list.\n\nSolana also outshines the rest with a whopping 5.2 million monthly NFT transactions. On the other hand, BTC and ETH’s numbers stood at 550k and 437k, respectively.\n\nAMBCrypto’s look at DappRadar’s data revealed that STEPN, Mad Lads, and Famous Fox Federation were the top 3 NFT collections on Solana in the last 30 days.\n\nNodeMonkes, Bitcoin Puppets, and RuneStone were the top three BTC collections.\n\nMeanwhile, Bored Ape Yacht Club, Milady Maker, and Mutant Ape Yacht Club sat in the top three positions on the Ethereum blockchain.\n\nIt was interesting to note that despite topping the chart, Solana’s monthly NFT sales volume dropped by more than 40%. AMBCrypto reported earlier how BTC outshines ETH in terms of monthly NFT sales.\n\nHowever, a similar decline trend was also noted on BTC and ETH’s NFT sales volume, as they fell by 62% and 52%, respectively.\n\nNonetheless, SOL’s number of buyers and sellers increased by double digits, reflecting high activity.\n\nThings changed in the past seven days in terms of growth as ETH outperformed the rest. CRYPTOSLAM’s data revealed that ETH’s NFT sales volume increased by 17% last week.\n\nIn the meantime, SOL and BTC’s numbers dropped by 18% and 37%, respectively. Notably, ETH also had the highest sales volume of over $40 million, while SOL’s number was the lowest as it stood at $14 million.\n\nSOL, BTC, and ETH’s state\n\nWhile the NFT market witnessed a change in trend last week, all the cryptos’ prices turned bullish.\n\nOn one hand, BTC and ETH’s prices dropped by 4.4% and 3.4%, respectively, and on the other hand, SOL dropped by nearly 10%. At the time of writing, BTC was trading under $67k.\n\nAs per CoinMarketCap, at press time, ETH and SOL were trading at $3,558 and $144, respectively.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe bearish price actions also took a toll on these cryptos’ social metrics.\n\nAMBCrypto’s analysis of Santiment’s data revealed that SOL, BTC, and ETH’s Weighted Sentiments dropped, meaning that bearish sentiment around them was dominant in the market."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFByTm8wNmQzQWhaZnhwRGVMMk5qUV8yV1B2UzREU21fUWNtWGNtcUFaSXk0SjZUZlJubmh5SGdKcGlsR2FTSW9KSWFOenJYRGRKRGtZMTFleDhvWFdZS1dV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "What Is ZKsync (ZK): Ethereum Scalability With Zero Security Compromises - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNMHJsck5LMjNpVEFqMHZBNUllQkFmY0FrSW1GQ2VLWm1SY0JtcVU5d3RXd0NmOVJQWjYweUFHdTdfZWFIZjdwS2xnTEFuRnVvRG1jYjRkZzlCdXNoZ1huZlAyUkltTklqQ1FfUGJxWU05ZlFPRm5MaW8tRU5QQmRxd01CYTVTWGZZWTRBenQ4bGhTQ2tSVTA5OE80YUR4elhNdFJnNFZKbXBQNUVabmJLanMxZlFUdzk5SDI2cl80SkowWHRfeFhmRnJJT1haYnpma2xRemRjSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "RCO Finance Takes Crypto and Ethereum DeFi By Storm, 3 Key Features that Make It Unique - The Portugal News",
        "content": "The crypto and Ethereum DeFi space is currently witnessing the emergence of an exceptional player, and astute crypto investors can't keep calm! RCO Finance (RCOF) has made advanced AI technology accessible to all, raising a storm in the crypto world with this unprecedented solution.\n\nBy Advertiser, in Crypto · 17 Jun 2024, 12:00 · 0 Comments\n\nWe'll explore the three key features that have everyone raving about RCO Finance (RCOF) in this article and its presale opportunity poised to turn modest capital into substantial returns!\n\n\n\n\n\nRCO Finance Makes A Firm Stand With Three Key Features\n\n\n\n\n\nRCO Finance (RCOF) is not your typical DeFi project. It has quickly gained traction as a comprehensive platform for everything decentralized finance, especially with these three key features;\n\nAutomated Market Making (AMM): Unlike traditional investment platforms and even some DeFi protocols that require manual trade execution and constant monitoring, RCO Finance (RCOF) has developed a fully automated DeFi trading platform that uses advanced AI and machine learning technologies to eliminate human errors and emotions, leading to better investment outcomes and more consistent returns.\n\nReal-World Asset Integration and Tokenization: One of the biggest challenges in the crypto space has been the divide between digital and real-world assets. RCO Finance (RCOF) addresses this by enabling users to invest in stocks, bonds, and real estate using their cryptocurrencies and bypassing the hassle of converting to fiat currency.\n\nAI-powered Robo Advisor: Many market experts argue that this is RCO Finance's (RCOF) best feature yet and one of the best AI trading tools in the entire crypto industry. This intelligent system uses historical price data, live price movements, trends, and news events to create tailored investment strategies based on individual financial goals and risk tolerance.\n\nBy continuously analyzing market conditions, the Robo Advisor adjusts portfolios accordingly, helping investors of all levels to make sound and profitable investments.\n\nWith these three key features, RCO Finance has risen above the competition, providing ease of investing, a bridge between traditional and digital finance, and dynamic investment strategies. Yet it has more to offer; keep reading to explore them!\n\n\n\n\n\nRCO Finance: A Gift That Keeps Giving\n\n\n\n\n\nRCO Finance (RCOF) continues to outpace many top cryptocurrencies by leveraging AI to ensure that even novice investors can benefit from sophisticated investment strategies once reserved for professional traders. Its user-friendly interface ensures a seamless investment experience as investors can easily navigate all its features.\n\nFurthermore, RCO Finance (RCOF) equally prioritizes privacy and security by conducting thorough, regular smart contract audits. It does not require any KYC procedures, ensuring that investors maintain anonymity while complying with necessary regulations.\n\nGiven its high leverage options of up to 1000x, RCO Finance (RCOF) enables investors to diversify their portfolios extensively and maximize their potential returns, even with smaller initial investment capitals. Besides, they also benefit from the tokenization of real-world assets.\n\n\n\n\n\nTurn $100 To $3000 On The RCO Finance Presale\n\n\n\n\n\nIf you've been wondering how best to take advantage of RCO Finance’s (RCOF) diverse offerings, consider investing in the project's ongoing presale. With the coin expected to officially launch at $0.4, a simple investment of $100 can yield up to $3000 if you purchase RCOF tokens at its current Stage 1 price of $0.01275.\n\nMoreover, RCO Finance's choice to build on the Ethereum blockchain has attracted many investors. Many experts view it as the next promising Ethereum token with substantial and sustained growth potential. This sentiment is driven by RCO Finance's impressive tokenomics, deflationary mechanisms, and a clear roadmap.\n\nInvestors are also encouraged to stake their RCOF tokens for rewards that amount to one of the highest APYs in the crypto industry. This approach has driven demand and stability for the token.\n\nHolding RCOF tokens grants access to community rewards surpassing $100,000 and enables investors to have a say in key decisions within the RCO Finance (RCOF) ecosystem.\n\nFor more information about the RCO Finance Presale:\n\nVisit RCO Finance Presale\n\nJoin The RCO Finance Community"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPUFBYamlVeTlzUVgxazBWZk85ZTJUb3hSVEF5aGZKRXpZTFpEZ2tHbXM0Tk9fQU9QTDNTWUdqU1dDSV9RVDBOQldRVkl1VC1uWEh3dUlGRlMxQmJ5VkJrdjJIUHZfN2Q0TjhkRUFfclBmb2xOLXg0X0FfTC1razZvMVN1RGFpQTl4TlVRMkQxbVPSAZ4BQVVfeXFMTmtVT0xSSEJIWU5ldzRLemN5LWdjcXB0eC1rY0tQT2NMYjJ6b0lMNkZVekRqNlR1blI3OWl3STFGTkZYLWVKeXp1VXR3d1RhcHlHc0pOVlRYdl8zM2pMWFFSQWptblprTEVpV25vRWJWZEptcmN3cnZFSmJ3WUxfc1dmUl9DcWNUZGlPWldZZ0ZzUTZBTDF0WnJYcHZyWGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 17, 2024 - Analytics Insight",
        "content": "1. 50-Day Moving Average: The 50-day moving average for Ethereum is trending upward, indicating a medium-term bullish momentum. This suggests that buyers have been relatively strong in the past few months, maintaining the price above this moving average.\n\n2. 200-Day Moving Average: Similarly, the 200-day moving average shows an upward trend, supporting a long-term bullish outlook. The Ethereum price staying above the 200-day MA signifies a positive long-term trend."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNUi1jdDBuTjJ3b1RQbUROYkRRZ0JFZkFiR05YSmRpaU9jTEJ0UE1SODRBemhtaWxoZ1ZHbDN5anhmaDRZdTZsenZCX1c2blVBWlVJSjIxdVAzVkRjTWdvUTJzcXV6ejQtZnI1ZnkwczBQVktXSmhPeFRBV1pBMzY3Qkw2ZXUyRE51OTJ4OWZNVVVCN2MtMXRZUUdIYWtwZ2JBb3U2Rl9OV1hSdFl0cTNfQ3ZFYlpWQzhleW00VUl0UGZTaUVhSXhTZtIB1gFBVV95cUxOVThjTmJVd29hRHBMY2dDbGl1OUlPWERIcm9qTmpITWpKRGNGZTZBazVYdTdqeWREMGwyOXFRcFpDR25sR09TdjgwN001bGE2QlcxRnI2Z1BRdVcyR2h5bnJHMTl1RVF3b011V29FcDFHVjg5WUY1aDJBY1hRcTJMemNvX0g2Tks5LWRpUG83T3dqNW1iM2RBYThtdlBlbkxFMXVEcjU2anZQT0J0b1R3R1lVOUpqd1NDVkd0LTYwV0lONmRuSTlocENxOUNGcEtDVGVxNHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Price Rallies Amid Whale Activity and Spot ETF Anticipation - Analytics Insight",
        "content": "There has been a lot of changes in the price of Ethereum in the recent past. ETH price fell to $3,368 on June 14 before rising to $3,512 and remaining above $3,500 at the time of writing. At the moment, ETH is trading at over $3,548, which has risen by 0.34% in the last day even as it fell by 2.96% in the past week. These price movements have been felt in both the long and short positions in the market.\n\nOther on-chain metrics include changes in ETH’s realized profit, which is the total value of all coins that have been moved and sold at a price lower than the current market value. The realized profit for ETH was $55.18 million on June 12 and increased to $104.58 million by June 14.\n\nThis increase may therefore be an indication of the holders taking profits which if the pressure is sustained may lead to a price drop. Nevertheless, if the profit taken hits the market at $3,400 – $3,600 levels, it might trade between this range in the coming days."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQX2JCeFA0SkRMUmJYRDAxQUJxNDJuckNDdnAwVU5taEFNeEVFWENpVjF2ZDVuSzRvempLY3NvSTEwMnY5NldXdExDdUt3Rm5mSW5Icjc5Mi1aWXpLV19TT01sbXlfR3c3YXpSNmprYVZFSER5V2R5bEd4YmdWQksxSll3RVRXNXhId0JERkhCZ9IBlAFBVV95cUxOTzlIZ0JxaUtlTHh6WG43b0VQZmwyQkR5bVRJSXZRSnFPMjRsTnU1cVZQc3BMNmRFNTFaUVJMVUZDNzctS3ViTkRZOEN5anRaZEZicDMzLXRqdk1oTGgtcDNRcm9kWHBvZF9veWlicEZ3Rmk2cmpoQTlBQThyX1dxUkhCOXZWZWgxYVRNUFI5VzY1Wl9V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Notcoin’s price surge – Here’s how it outperformed Bitcoin, Ethereum - AMBCrypto News",
        "content": "NOT followed TON’s price direction as demand pushed the volume to $1.37 billion\n\nToken seemed overbought, pointing to a possible fall to $0.016 on the charts\n\nNotcoin [NOT] defied the broader market “red period” as the price climbed by 7.22% in the last 24 hours. According to CoinMarketCap, this happened at a time when Bitcoin [BTC] slid to $65,103 before slightly recovering above $66,000.\n\nEthereum [ETH] also registered a decline to $3,381 around the same time. The performance underscores Notcoin’s next-to-nothing correlation with the top two cryptocurrencies.\n\nAt press time, NOT changed hands at $0.020. On 14 June, however, the token had initially tapped $0.022 on the price charts.\n\nNOT sentiment bullish, goes with TON\n\nHowever, Notcoin is not alone in its rise as fellow Telegram-linked project Toncoin [TON] joined in too. A few weeks ago, AMBCrypto had reported how NOT did not follow the same trend as TON.\n\nOn the back of the latest price hike, it would seem now that the two have aligned.\n\nFrom an on-chain perspective, we also found that sentiment around Notcoin has been incredibly bullish. Using the Weighted Sentiment metric, for instance, AMBCrypto observed that the reading was 0.178 on 13 June. However, at press time, the same metric had hit 0.617.\n\nThe notable hike within a short period implies that online comments about NOT were much more positive than those that were bearish about the token.\n\nApart from the price hike and bullish sentiment, Notcoin’s volume surpassed the $1 billion mark. The increase in volume constituted a 131% hike in the last 24 hours.\n\nTrading volume is crucial for a cryptocurrency’s price and direction. It indicates if market participants are interested in a token.\n\nHeavy movement of the volume, alongside a price increase, suggests an increase in buying pressure. On the other hand, if the spike comes with a price fall, it implies a hike in selling pressure.\n\nNotcoin’s price may go down later\n\nFor NOT, it was the former. However, it is unlikely that NOT’s volume would hit $4 billion like it did when the price hit an all-time high of $0.029 on 2 June.\n\nEvidence of this was reflected in the Relative Strength Index (RSI). The RSI is an oscillator that measures speed and changes in price movements.\n\nA value of over 70 indicates that an asset is overbought. When it is less than 30, it means that it is oversold. In Notcoin’s case, the RSI on the daily chart had a reading of 74.27.\n\nSimply put, the token was overbought. Thus, the price might begin a slow reversal down the chart. If this happens, the price of NOT might fall to $0.016 within a few days.\n\nHowever, this prediction would be invalidated if the broader market condition changes. Assuming prices across the board begin to move north, NOT might follow suit.\n\nRealistic or not, here’s NOT’s market cap in BTC terms\n\nShould this be the case, the value of the token might jump to $0.022 once more. Besides that, market participants should be on the lookout for developments or announcements around the project as this could also impact the price."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZjhiMGowaThlbmFtclJsTl9BZmltSjdnNXZuNjdzcnY0Q3ZyNWd0dGZtSVRVdFpUOGswMjN1eUk3VnVHcTZpekxCU3FzcC1LTUhpeEI0ek1oNm1XdG9sVFF4ZHRMTk5NOFNvNzRRMHhaU0FXZTFxbU9OV2pkcVZIZkVGdmc4dUXSAYwBQVVfeXFMTkQxV1BYT3IxeWFnSy1MX0dUYWRKNlQ2cFdsN0FpT04tdjBfbjFseHVGVXF4V2RURjJMYWpGTUlHOXBsMnRmNTh1ZE0xUnlOVW1wa0JGbE9JVklhajNYSk41YzJJNGxfM3RHVy02NkxyOTM2Y1ZmVk1YaU1sb2h0VDU0bmhuN0tXWXNLVlg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s $50M liquidations – Here’s what traders should know - AMBCrypto News",
        "content": "Both longs and shorts experienced a turbulent time after ETH’s price went up and down\n\nRealized Profits increased, indicating that the value may fall below $3,400\n\nThe high volatility in the market caused liquidations in the market to hit $215 million. Out of this, Ethereum [ETH] contracts accounted for $50.61 million, according to data from Coinglass.\n\nLiquidations occur when a trader does not have a sufficient margin balance to keep a position open. The forceful closure is necessary to avoid further losses.\n\nStormy season for the market\n\nFor ETH, the high liquidations could be linked to the cryptocurrency’s price. A look at the price action revealed that it dropped to $3,368 at some point on 14 June. Later on, the value rose to $3,512, before settling above $3,500 at press time.\n\nAs a result of these price swings, both longs and shorts were not spared. Longs refer to traders betting on the price of an asset to hike. Shorts, on the other hand, are traders with stakes on a price decline.\n\nHowever, traders seemed to expect the depreciation in price. This, because of the Put/Call ratio before Friday’s options of expiry. According to Deribit, the derivatives exchange, Ethereum’s Put/Call Ratio was 0.37.\n\nSince the ratio was below 0.50, it meant that expectations have been bearish. However, it did not seem the participants anticipated the high level of volatility.\n\nIn terms of the price, AMBCrypto looked at the Realized Profit too. As the name implies, this denotes the total of all moved coins whose last price was lower than its press time value.\n\nETH plans to swing between $3,400 and $3,600\n\nOn 12 June, ETH’s Realized Profit was $55.18 million. By 14 June, the value had risen to $104. 58 million. An increase in this metric implies that holders are booking profits, and this could lead to a price fall on the charts.\n\nHowever, if the metric stabilizes itself, selling pressure reduces across the market. For Ethereum, Realized Profit seems to have settled around the aforementioned value. Therefore, it might be likely for the altcoins to trade between $3, 400 and $3,600 over the next few days.\n\nAMBCrypto also analyzed Exchange inflows and outflows to assess ETH’s next movement. Exchange inflows track the number of coins sent into exchanges.\n\nIf this increases, it means that holders are planning to sell. When this happens, the price of a cryptocurrency usually decreases. Exchange outflows, on the other hand, measures the number of coins sent out of exchanges.\n\nAt press time, ETH’s Exchange inflows were $34,400 while the altcoin’s outflows were 24,100. The difference in the flows implied that there were more ETH up for sale, than those retired to cold wallets.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nIf this continues, the price of the cryptocurrency might drop below $3,400 like it did on 14 June. On the other hand, a fall in selling pressure could halt this decline and ETH might keep consolidating on the charts."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9URzJyTWI2YWtwd1VTbG1mc203ZEJCWXV6MjRUSmNZZERXU21FX0JuMmZPUThUVS1KZ3RORjFBcjh6V0VpMzZaZnZVcnN1WmFYOWg2eTA1NndhZ3FiTmlDLXZmTnMxamxiRGhvS3ktRVVib1BMc2c4NWt3MNIBgAFBVV95cUxQazRDWnNVZTVjWExhT2hJM093alprZjZHVUdWQzJTNzY2RTNTQXl2RDJZQk9xc1JfbUpIaDMzR0VEV0VUbWNUQy0xM1JBWFVhRkw2NkpsX0FuYUl0TXBwUzBnR3ZoSVhIRzBNSVFNU2tWWUdjU2NXNE5yTkRGMGZRSg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 05:32:36 GMT",
        "title": "Ethereum On The Rise and Outperforms Bitcoin: Signals Indicate Fresh Increase - NewsBTC",
        "content": "Ethereum price started a fresh increase from the $3,365 zone. ETH outperformed Bitcoin and might aim for a move toward the $3,800 resistance zone.\n\nEthereum started a recovery after the bulls appeared near the $3,365 zone.\n\nThe price is trading above $3,550 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key bearish trend line with resistance near $3,550 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend gains if it stays above the $3,550 pivot level.\n\nEthereum Price Outperforms Bitcoin\n\nEthereum price extended losses below $3,550 and $3,500 resistance levels. However, ETH bulls took a strong stand near the $3,350 zone. A low was formed at $3,364 level and the price started a fresh increase, outperforming Bitcoin.\n\nThere was a move above the $3,450 and $3,550 resistance levels. There was a break above a key bearish trend line with resistance near $3,550 on the hourly chart of ETH/USD. The pair even climbed above the $3,600 level and tested the $3,650 resistance.\n\nA high was formed at $3,649 before there was a pullback below $3,620. The price declined below the $3,600 support level and the 23.6% Fib retracement level of the upward move from the $3,364 swing low to the $3,649 high.\n\nEthereum is now trading above $3,550 and the 100-hourly Simple Moving Average. If there is a fresh increase, the price might face resistance near the $3,620 level.\n\nThe first major resistance is near the $3,650 level. An upside break above the $3,650 resistance might send the price higher. The next key resistance sits at $3,720, above which the price might gain traction and rise toward the $3,800 level.\n\nA clear move above the $3,800 level might send Ether toward the $3,880 resistance. Any more gains could send Ether toward the $3,950 resistance zone.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,620 resistance, it could continue to move down. Initial support on the downside is near $3,550. The first major support is at $3,500 and the 50% Fib retracement level of the upward move from the $3,364 swing low to the $3,649 high.\n\nA clear move below the $3,500 support might push the price toward $3,420. Any more losses might send the price toward the $3,365 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now near the 50 zone.\n\nMajor Support Level – $3,550\n\nMajor Resistance Level – $3,650"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5MRlNwSG9FcjlkWFhTYk1zRjJ2aGc4cVc2WUc4OFUyeXg0ekR1aDRrcHd6U0xiQ2xQUVB6cElabzJaTkUyOU9uY3c2aTkydzJBSXJic1lNRzR0dXpQVjJ1eGpPeWk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 22:39:27 GMT",
        "title": "Ethereum (ETH) Price - NewsBTC",
        "content": "The Rapid Ascent of Ethereum\n\nAs the potential of its technology became apparent, Ethereum’s price began to rise. The Ethereum price chart started to show significant activity as ETH price USD climbed steadily. By 2017, Ethereum had become a key player in the ICO boom, which fueled its price to new heights. The Ethereum price live became a critical resource for investors tracking the volatile shifts in ETH to USD.\n\n2017 was also transformative for Ethereum, with its price reaching nearly $1,400 at its peak, largely due to the ICO craze where Ethereum’s blockchain was the leading platform. This surge brought Ethereum into the limelight, much like Bitcoin’s earlier ascents, with significant media coverage and burgeoning investor interest turning its price chart into a steep climb."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE95cUF3VXh2MzNUb1pKTDA2MXNSR3hieXZ0NlpxNjNpVFY0TVpCZlBZbGdnaGtmc21pcnY3OUhyR0t5anNtZW9lVlpPRXBKMzdwOTRXV0ZiRkc3Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Down: Why is ETH Price Crashing? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "With Bitcoin (BTC) experiencing a week-long downward trend, Ethereum's price has also felt the impact of this market pressure, mirroring the current volatility in the cryptocurrency market. Ethereum (ETH) has seen a notable decline in its price lately. This fluctuation highlights the ongoing instability and interconnectedness of cryptocurrency prices. Yet, Why is Ethereum price crashing? Let's take a look at this in more detail.\n\nHow has the Ethereum Price Moved Recently?\n\nETH/USD Daily Chart- TradingView\n\nAs of today, Ethereum is priced at $3,561.84, with a 24-hour trading volume of $12.75 billion, a market cap of $427.91 billion, and a market dominance of 17.63%. Over the last 24 hours, ETH has seen a slight decline of 0.30%.\n\nEthereum hit its peak price of $4,867.17 on November 10, 2021. Its lowest price was $0.420897, recorded on October 21, 2015. Since reaching its all-time high, the lowest price ETH has dropped to is $897.01. The highest price it has reached since this cycle low is $4,094.18. Currently, the sentiment for Ethereum price predictions remains neutral, with the Fear & Greed Index showing a reading of 71, indicating a state of greed.\n\nThe circulating supply of Ethereum stands at 120.14 million ETH. Over the past year, the supply has decreased by 0.24%, equating to a reduction of 292,161 ETH.\n\nWhy is Ethereum (ETH) price down?\n\nThe decline in Ethereum's price can be attributed to several key factors. First, the anticipation of an important Federal Reserve interest rate decision and the release of U.S. inflation data are creating uncertainty in the market. Investors often react to such economic indicators with caution, leading to a decrease in buying activity.\n\nFurthermore, there is a noticeable shift in the behavior of Ethereum's largest holder groups. These major stakeholders are showing a reduced tendency to accumulate more ETH, which is contributing to increased selling pressure in the market. This combination of macroeconomic concerns and changes in accumulation sentiment among significant holders is driving the current downward trend in Ethereum's price.\n\nWill Ethereum Reach $4000?\n\nThe potential for Ethereum to reach the $4000 mark is supported by several key indicators and market dynamics. Over the past year, Ethereum's price has increased by an impressive 106%. This significant growth showcases robust demand and strong investor confidence in ETH. Such a substantial annual performance suggests a positive trajectory that could potentially drive the price towards $4000.\n\nIn addition to its overall growth, Ethereum has outperformed 50% of the top 100 crypto assets over the last year. This relative strength indicates that Ethereum is not only growing but also maintaining a competitive edge in the broader cryptocurrency market. This competitive position often attracts further investment and interest, contributing to price appreciation.\n\nFrom a technical perspective, Ethereum is currently trading above its 200-day simple moving average (SMA), a widely followed indicator used to assess the long-term trend of an asset. Trading above the 200-day SMA suggests that Ethereum is in a sustained uptrend, providing a favorable condition for reaching higher price targets like $4000. Moreover, in the past 30 days, Ethereum has experienced 16 green days, accounting for 53% of the time. This positive momentum reflects consistent buying interest and bullish sentiment among investors, which, if sustained, could support further price increases.\n\nHigh liquidity, backed by Ethereum's substantial market cap, ensures that large trades can be executed without significantly impacting the price. High liquidity is crucial for sustaining price increases, indicating a healthy market where buying and selling activities can occur smoothly. This liquidity, combined with the other positive indicators, provides a solid foundation for Ethereum's potential rise to $4000.\n\nWhile the path to $4000 is not guaranteed and depends on multiple factors, the current indicators and market conditions suggest that it is possible. Investors should stay informed about market trends and macroeconomic factors while considering both the opportunities and risks involved. Continued positive market sentiment, stable or improving macroeconomic conditions, and ongoing technological and ecosystem developments within Ethereum can significantly bolster its chances of reaching this price level."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPWmVNSlgwbDNKNENUVzY0M0phUWM2VldRMFY2NlRDZ1JqRHVNQmlZYllMbU9tTnl5OUd1REpNVWxvT1ZHNFpIN0lucVZqaVFFUHI1eGxtcGpUYU5ybHVEZ25pVm5INEdvc28yUUkydVZueVJoZHJia0FuQ2RVcmFqYTVyVkpaMnZCbnNIQXYtWjBnSTkyOUJYajJmLWdYMVlMTWF3adIBqgFBVV95cUxOdEpvOG1TNUNOX1kwQjE4cG05UXBsTk9QYmVoakZOZ3NDc09Kb2tSQXZRUTVnblNCN0tqVGVzVGVoaVFkNUFNUnhRYXhHZ0NrQng5d2hCcmsyV3JJaW9LTUp2ejV1Z08wS3hicGVTZC0wN3RzYTZXaDZhdU9JOXRxTFg0UGtZSnI1OUp0a1hQZHVpWFlqUlRhTnFsckNMbUhZSG9xQ2FfbnJydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, And XRP Price Prediction: Is The Bull Rally Over? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe crypto market continues to record significant price volatility, highlighting increased price action in the crypto space. However, top tokens display a negative influence, indicating a rising disinterest of investors in it.\n\nMoreover, elite cryptocurrencies such as Bitcoin, Ethereum, and Ripple fail to hold their respective price above their important support levels. This escalated the concerns of investors about their investments in these crypto tokens.\n\nDive in as, in this article, we have covered the market sentiment and price analysis of the top 3 cryptocurrencies and mentioned their respective possible targets for the month.\n\nBTC Price Breaks Its Important Support Level:\n\nDespite a bullish jump post-CPI data release, the Bitcoin price has failed to regain momentum, resulting in the market leader erasing all its gains. Furthermore, the BTC token has plunged below the $67,000 mark, highlighting an increase in the negative influence in the crypto space.\n\nTradingView: BTC/USDT\n\nThe Cross EMA 50-day displays a bearish crossover in the 1D time frame, suggesting an increase in the negative sentiment for the BTC price in the crypto market.\n\nOn the other hand, the technical indicator, MACD, shows a rising red histogram, highlighting increased selling-over-buying pressure. Furthermore, the averages record a negative price trend, suggesting the Bitcoin price will continue trading under a bearish influence over the weekend.\n\nIf the bulls regain momentum, the price of Bitcoin will retest its resistance level of $67,775 during the upcoming week. However, if the bears continue to dominate the market, the BTC coin price will plunge toward its support level of $600,820 this month.\n\nETH Price Continues To Hover Above Its Crucial Support Of $3,400:\n\nWith the rising bearish sentiment in the cryptocurrency market, the Ethereum price has failed to hold its price above the important support level of $3,730. This resulted in the altcoin experiencing a significant correction in its portfolio over the past few days.\n\nTradingView: ETH/USDT\n\nThe ETH price has added approximately 1% with a trading volume of $16.20 Billion, a jump of 15.63% within the past day. Moreover, the altcoin has lost 4.17% within the past week but has added 17.84% over the past month, indicating a mixed sentiment for the crypto token in the market.\n\nThe Relative Strength Index (RSI) shows a bullish reversal in the price, indicating increased bullish sentiment for the altcoin leader in the crypto space. Moreover, the average trendline shows a potential bullish convergence, suggesting a bullish outlook for the ETH coin price in the coming time.\n\nIf the market continues to trade under a bullish sentiment, the Ethereum token will prepare to test its resistance level of $3,730 this month. Conversely, if the bulls fail to regain power, the ETH crypto will retest its support level of $3,400.\n\nXRP Token Breaks Down Its Crucial Support Level:\n\nDespite recording a jump of approximately 1% within the past day, the Ripple price continues to display a weak price action by recording a correction of 3.45% within the past week and 4.18% over the past 30 days. Moreover, the altcoin has a YTD of -22.02% in valuation.\n\nTradingView: XRP/USDT\n\nThe Simple Moving Average (SMA) constantly acts as a resistance to the price chart, highlighting a negative price sentiment for the XRP coin price in the crypto space.\n\nThe RSI indicator continues to hover close to its oversold range, indicating a weak price action for the Ripple token in the market. Furthermore, the averages display a constant decline, suggesting uncertainty for the altcoin in the crypto market.\n\nIf the market pushes the Ripple price above the resistance level of $0.480, the bulls will regain momentum and prepare to test its upper resistance level of $0.5340. However, bearish price action could pull the price toward its lower support level of $0.420 in the coming time."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSUNFQnZZeHBneWRrRHFCUDc3Q1pCSGx6RGhBa0dodlJITlhBS1dSNFpyb1BLY3NxNEFzcDhTcndlMUhCYUlHUktpWXRqZWtrd2NrMFQzaDdRYURWZ3dYdGo4aGJuVDNIVDVGWmtoYlZkNVFkRW9NdnRfQmxsd1NUakRvdThCeWJPNTRybVpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Opportunity? ‘Most bullish altcoin’ Ethereum signals imminent surge - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has once again captured the spotlight with its recent price movements and the emergence of a bullish pattern on its charts.\n\nThis pattern, often seen as a precursor to further price increases, has ignited discussions among investors and analysts about Ethereum’s potential to revisit previous highs.\n\nOver the past week, Ethereum has experienced notable volatility, marked by a 7% decline in its price. The cryptocurrency’s performance in the previous month was characterized by a strong uptrend that significantly boosted its price.\n\nHowever, a recent correction has tempered short-term investor optimism. Despite this performance, analysts believe that Ether still remainsone of the altcoins displaying the most upside potential at the moment. Ethereum’s underlying fundamentals and market indicators suggest a potential upward trajectory.\n\nAnalyst perspectives and historical trends\n\nProminent analyst Yoddha has highlighted that historically, Ether’s return above yearly highs has often preceded exponential price growth. He suggests that if history repeats itself, ETH could embark on a parabolic uptrend with an upside target set around $20,000, making it “one of the most bullish” cryptocurrencies.\n\n#Ethereum is one of the most bullish Altcoins right now. It's already trading above the previous yearly high. pic.twitter.com/UrViL9dY1V — Yoddha (@CryptoYoddha) June 13, 2024\n\nEther’s bullish outlook is further supported by the data from CryptoQuant which shows an increased investor accumulation and significant outflows from centralized exchanges.This accumulation activity may be driven by bullish events on the horizon, such as the anticipated debut of a spot Ether exchange-traded funds (ETFs).\n\nEthereum outflow from centralized exchanges. Source: CryptoQuant\n\n\n\nAnalyst Ali Martinez noted increased whale activity, with large holders taking advantage of recent price dips to accumulate more Ether. On-chain data from Santiment shows the top 10 exchange wallets saw an 8.6% drop in ETH holdings as traders moved assets to private wallets\n\nThis high demand-side pressure, combined with reduced supply on exchanges, is likely to create a supply deficit that could push Ether’s price above $4,000 and into a parabolic uptrend.\n\nMoreover, according to data, over 200,000 ETH options recently expired, and the crypto community eagerly awaits the direction of the Ethereum price.\n\n14 June options delivery data\n\n20,000 BTC options expired with a Put Call Ratio of 0.49, a maximum pain point of $68,500 and a notional value of $1.35 billion.\n\n200,000 ETH options expired with a Put Call Ratio of 0.36, a max pain of $3,600 and a notional value of $710 million.… pic.twitter.com/42ruZLLtqc — Greeks.live (@GreeksLive) June 14, 2024\n\nThe majority of the expiring ETH options are call options, meaning buyers are betting the price will rise. At the same time, the put-call ratio is at 0.36, indicating that market participants are currently buying more call options than put options.\n\nMarket indicators and analysis\n\nIn addition to the outflow from centralized exchanges, fundamental and technical indicators offer insights into Ethereum’s current market dynamics and future potential.\n\nA decline in Ethereum’s exchange reserves indicates a reduction in available supply, suggesting strong buying pressure from investors.\n\nAn increasing funding rate in the derivatives market shows that long-position traders are willing to pay premiums to hold their positions, typically favoring upward price movements.\n\nHowever, on-chain data from Santiment shows a high Ethereum Network Value to Transaction (NVT) ratio, which compares market capitalization to transaction volume, suggesting that Ethereum might be overvalued relative to its on-chain activity.\n\nEthereum NVT ratio. Source: Santiment / Finbold\n\nThis high NVT ratio implies that despite strong market interest and price performance, the on-chain transaction volume does not fully support Ethereum’s current valuation, indicating potential caution for investors.\n\nCurrently, Ethereum is trading at $3,562.24, with a 24-hour increase of 0.23%. Demand for Ethereum is spiking, signaling that traders expect the price to continue rising in the near term.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]