[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQVFEwaktMd2daOGVWMHB6dDdNNEVUOF8tSHotdjN0RnVab0tSM2dldUMzNDE1MFZYTTQ1ZHBEcUg5d0xvSHF6Wm12dGxYRV9pQkhRWVJmTE9lN2l1cExEVEJSUnlBVDVTZW5lT3c3OHJCU1M1OHpZSXZNYVlDUVRSRi1vVzVVUVF1VnhhS0RTT01Fa3k4cVotZWJGZFNXd0hRMkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "BlackRock, other issuers update S-1 filing for spot Ethereum ETFs, raising expectations for July launch - CryptoSlate",
        "content": "Seven spot Ethereum ETF applicants amended their registration statements with the SEC on June 21, leading to increased expectations of a trading launch in early July.\n\nFranklin Templeton, VanEck, Invesco Galaxy, BlackRock, 21Shares, and Fidelity submitted updated S-1 registrations for their respective funds.\n\nGrayscale submitted an amended S-3 registration for its Ethereum Trust and an additional amended S-1 statement for its mini Ethereum Trust. Bitwise did not amend its registration statement.\n\nBloomberg ETF analyst Eric Balchunas continued to predict July 2 as an over/under date for the funds’ launch following the latest filings, saying:\n\n“Anyway that’s basically a wrap. Ball in SEC’s court now.”\n\nHe also maintained his view that Ethereum ETFs are unlikely to attract more than 20% of the AUM Bitcoin ETFs have attracted.\n\nFees disclosed\n\nFranklin Templeton disclosed a 0.19% sponsor fee in the updated filing. The firm will waive the fee for the first $10 billion assets for six months. Meanwhile, VanEck disclosed a similar 0.20% sponsor fee, which it intends to waive for the first $1.5 billion assets until an unstated date in 2025.\n\nBalchunas believes the low fees will pressure BlackRock to announce sub-30 basis point sponsor fees for its fund as well. Notably, both BlackRock and Fidelity have yet to disclose sponsor fees for their ETFs.\n\nExperts believe BlackRock’s fee, in particular, will be a key detail that could lead to heightened competition among the firms. Balchunas said the asset manager’s fee is the most important missing detail other than the launch date.\n\nAccording to the analyst:\n\n“[BlackRock’s] fee is the sun that the rest will need to orbit around.”\n\nThe launch of spot Bitcoin ETFs in January notably led to a “fee war” among issuers, each vying to offer competitively low fees. Currently, spot Bitcoin ETF fees largely range between 0.19% and 0.39%, though Grayscale’s GBTC has a higher 1.5% fee.\n\nSeed investments\n\nInvesco Galaxy disclosed a $100,000 seed transaction on June 17 in which the seed investor purchased 4,000 Shares at $25 per share.\n\nGrayscale disclosed a $100,000 seed share purchase for its mini Ethereum trust. On May 31, the sponsor purchased 10,000 shares at $10 per share.\n\nFidelity said its seed capital investor, FMR Capital, purchased 125,000 shares at $37.99 per share on June 4, contributing $4.7 million to the trust.\n\nMeanwhile, BlackRock previously reported $10 million in seed funding for its ETF.\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9VVG5jdE5UWkE3QUVaV2IyRVhNUFBrZzZMc19xRlp5bUx0ek5TMDhIRGxqRl93R1Q4R3ExbzU1WVN5UklYbXVRLUxrYmRBdHVxdUFuMUtyQ1NTOWcyaS1adzEtbjc3b2xXZFVseUdXS3FfR3RYeDB1OTh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "SEC Approves Spot ETH ETP's - JD Supra",
        "content": "On March 23, 2024, the Securities and Exchange Commission (the “SEC”) formally announced its approval of eight “Ether-Based Exchange Traded Products” (the “ETPs”).1 This announcement comes a little over four months after the SEC approved Bitcoin ETPs. The eight approved ETPs include (1) the Grayscale Ethereum Trust, (2) the Bitwise Ethereum ETF, (3) the iShares Ethereum Trust, (4) the VanEck Ethereum Trust, (5) the ARK 21Shares Ethereum ETF, (6) the Invesco Galaxy Ethereum ETF, (7) the Fidelity Ethereum Fund, and (8) the Franklin Ethereum ETF.2\n\nEther (“ETH”) is the native token of the Ethereum Network, the second largest cryptocurrency by market cap after Bitcoin.3 Approval of the ETH ETPs is another step towards mainstream recognition and adoption of cryptocurrencies. The adoption of ETH may be more significant than that of Bitcoin as the Ethereum Network provides users the ability to build and scale protocols on its network with a vast number of potential use cases, whereas Bitcoin is mainly used as a store of value. Increased exposure to ETH will inevitably lead to greater exposure for Ethereum products. As of May 24, 2024, the Bitcoin ETPs saw over $272.28 billion in overall trading volume.4 It remains to be seen whether the ETH ETPs can replicate such volume, though it is likely that they will not, at least not at first. Asset allocators and institutions took many years to get comfortable with Bitcoin’s value proposition (scarcity, immutability, sound money, etc.), not to mention the many years of ETF applications and rejections. The simple fact is that such institutions and managers are not as familiar with Ethereum now as they were with Bitcoin in January. In the long run, however, Ethereum’s turning complete features make it a much more powerful form of “programable money” and it would not be surprising if institutional and retail investors ultimately see as much, or more, value in the asset.\n\nOn the other hand, some may argue that these ETPs are inconsistent with the decentralized nature of cryptocurrencies. A similar concern was raised when Lido was responsible for almost one-third of the staking taking place on the Ethereum Network.5 Decentralization helps ensure that the Ethereum Network is not controlled by a few users. Conversely, the ETPs require these large asset managers to accumulate huge quantities of ETH. For now, these asset managers cannot stake their ETH or participate in the governance of the Ethereum Network, however, if given such opportunities, these asset managers could theoretically threaten the decentralized nature of the Ethereum Network and/or place the entire network under the control of the US government.\n\nAs these ETPs are brand new, we will have to wait to see how their adoption impacts cryptocurrencies and traditional finance."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9DdkVlYXdvNExldTlVQ2Q5OWpaR0hsLVFweWhJUzFld0xKNnNhUHV3SHdPQ0VTZVN2dU5fRkxaNlRfMTgwR0ItNnk3MUE1YUdNRDhSdUJZWU56Nm50azcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Launch date for Ethereum ETF in the US reiterated as July 2nd by Bloomberg ETF analyst - Crypto Briefing",
        "content": "SEC's approval of S-1 forms crucial for Ethereum ETFs' public trading.\n\nShare this article\n\nThe initial date for spot Ethereum exchange-traded funds (ETF) trading in the US is still July 2nd, according to Bloomberg ETF analyst Eric Balchunas. In an X post, Balchunas doubled down on this date, highlighting that “a bunch of amended S-1 Forms” for those ETFs might be filed today.\n\n“Then ball’s in SEC’s court to let issuers know about any final changes and effectiveness (aka final approval),” added the analyst. On June 14th, he predicted the launch date for the first time, as reported by Crypto Briefing.\n\nOn May 23rd, the US Securities and Exchange Commission (SEC) approved the ETF filings for eight Ethereum ETF issuers, including BlackRock, Fidelity, VanEck, and others. However, only the 19b-4 forms were approved, which acts as permission for the exchange-traded product to be created.\n\nNotably, the S-1 form, which is an initial registration required by the SEC before a security can be publicly traded, still needs approval. The first amended S-1 form came a few minutes after Balchunas’ post, with Fidelity presenting the document with the adjustments ordered by the SEC.\n\nThe asset managers are not including their ETF fees on the S-1 forms, and the Bloomberg analyst assessed that they might be waiting for BlackRock to disclose “to see what they need to orbit around.”\n\nMoreover, Balchunas’ fellow ETF analyst James Seyffart also expects all the remaining S-1 forms waiting to be amended to be filled today."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNdzhxUTQwMzZ6NzhEaDFRMWxzOS1BQTVTSnViV0lCMnE3a2tkdjNnczBoRGwxRUVaTUVQSVVtQlV1QjY5cnY1RWl4ZWNVRXo5ZGhjV2NaVUJqUUU3SG5MZmNmLTZraVRmMFl6RXBEeVN4b190bXNyNkpUOTBNQnhGSGFCNU9VOEF3RDVSaUVnbVNqeXBRODNNV1JIMzE5Z2QtR2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum wins a major battle, but its war with the SEC is far from over - Fortune",
        "content": "Consensys, the maker of the popular MetaMask crypto wallet, announced this week that the Securities and Exchange Commission has backed off its unpopular campaign to investigate developers who use Ethereum. The move is in line with the growing legal consensus that Ethereum is a commodity, not a security, which puts it outside the agency’s jurisdiction. The announcement, however, also contained a dark lining that reveals SEC Chair Gary Gensler’s crusade against Ethereum is far from over.\n\nYou may recall that things between Consensys and the SEC came to a head when the company took the bold step of suing in April, asking a federal judge to force the agency to back off. The lawsuit came as a preemptive strike after the SEC had telegraphed it was on the verge of filing charges against the company after a year-long campaign of issuing subpoenas to developers who use Ethereum.\n\nThe SEC’s legal position became tenuous after the agency, under growing political pressure, approved Ethereum ETFs—an acknowledgement the currency is indeed a commodity. In response to an enquiry from Consensys, the SEC then informed the company it was “closing its investigation into Ethereum 2.0.” The “2.0” phrase appears to be a reference to the blockchain’s new proof-of-stake system that went into effect in 2022.\n\nAll of this came as good news to the market, and the price of Ethereum jumped around 3%. But one line in Consensys’s announcement hinted that all was not quite as well as it seemed—namely that its lawsuit with the SEC was ongoing. This seemed strange given that, if Ethereum is not a security, the SEC has no jurisdiction and there is nothing to hash out in court.\n\nI asked Consensys’s lawyers what is going on and they told me the SEC is still going after MetaMask because it can be used to swap tokens on the DeFi market, and also because it offers access to staking—a key element of Ethereum that pays users to help secure the network. Here is how the lawyers put it:\n\n“The SEC’s theory is that, because the Swaps offering allows users to trade various tokens using DeFi platforms, it is a securities broker due to at least some of those tokens being securities. They also assert that providing a user interface to two liquid staking protocols is also brokerage activity, and that it also constitutes offering unregistered crypto asset securities. The closing of the Ethereum 2.0 investigation doesn’t resolve those issues.”\n\nThe SEC, in other words, is trying to argue that Consensys—and by extension other firms—is an unlicensed brokerage engaged in the securities trade. This is likely a losing argument too, but it’s on brand for Gensler, who has treated the process of crypto regulation like a personal vendetta, to dig in to the bitter end. The upshot for the crypto industry is it has won another battle, but the war goes on.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe Commodity Futures Trading Commission is investigating Jump’s crypto trading activities. (Fortune)\n\nS&P wrote that Ethereum restaking, carried out by EigenLayer and others, could become akin to an “internet bond market.” (Bloomberg)\n\nWorldcoin has resumed iris-scanning in Kenya after regulators dropped a year-long privacy probe that had halted operations. (TechCrunch)\n\nThe price of private shares of crypto firms like Kraken, Circle, Chainalysis, and Ripple have jumped this year amid rumors the bull market will lead to long-awaited IPOs. (Bloomberg)\n\nBitcoin is down around 10% this month as the price fell below $64,000, though some technical analysts predict a rally is on the way. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nWhat could go wrong?"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOSjZ5RGNQeHE5N2ZnTXhuajBfUmYzMkdOcGZPLUxLWWJwb0hKVW45aWV2THg4bHpFVy1hbklUcTJ1aDFKSXhWMmFzWUFSNHlYQ3VScklnNDNlN2Y4LUlVM0VwMS1VeG5ZNU1zMTFNVU4tWDQ2aTZpZDhzSmNLLUxsXzA4c04ySlNMUjgzQlRrekY1YzdiQmJaTklORkl6bDFmclZsdXFFdkQwZnExd2w3RlFzc9IBuAFBVV95cUxPVDUzdTh6UGVJd1NHWE5YRHBBaVgyakFoNGhIV0hPclBObU1fTEJrcDRISGUyVndBbF9DTzZRQUY5bFNtMXJPZjFicjg0RGlOdExYaE5VbGJYYmZRMENlemYyaVc0SHl1eUVRd3dBSWRzdnBZenRjd2hTd3E5cDJHS2tVY3VaVTllRDNHdE5ST2t2RGIwaW10Z1FnU04xNmNWUVVyaENxbmFGRUh6UXFoYy1IR05IQTI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) to $70,000 Imminent? Solana (SOL) to Pump Ethereum: Here's How, Cardano (ADA) Bounces Around $0.3, But for How Long? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin is finally entering reversal mode, with the price of the first cryptocurrency sliding in above the $65,000 zone. However, it is still moving below key support levels like the 50 EMA and is currently consolidating at the 100 EMA. The most decisive factor for a recovery would be momentum that is not present at this exact moment.\n\nIt is critical that Bitcoin maintains above $65,000 for the near future. Strong support has been seen at this level, which might serve as the basis for a reversal. If Bitcoin is able to overcome the immediate resistance at the 50 EMA or roughly $67,000, traders are hopeful of a possible rebound.\n\nAdditionally, the RSI which is centered on 47, shows that Bitcoin is neither overbought nor oversold, pointing to a period of consolidation prior to any notable movement. The macroeconomic environment as a whole is one factor influencing Bitcoin's current performance. Investor sentiment in a variety of markets, including cryptocurrency, has been influenced by worries about inflation and possible interest rate increases by central banks.\n\nBitcoin's long-term prospects are still promising despite these obstacles because of its growing institutional adoption and ability to act as an inflation hedge. Given its continued institutional interest and widespread adoption, Bitcoin's long-term prospects appear bright.\n\nAdvertisement\n\nSolana's questionable position\n\nWhile Solana clearly gained some respectable strength back in May, the situation for the asset has changed, and it has been going down steadily for the past 20 days. The SOLETH chart, often used for gauging market volatility, is clearly exhausted and might provide us with some growth in the future.\n\nThe Solana vs. Ethereum chart, which contrasts the two most powerful altcoins available, is an important comparison. This comparison makes the relative strength and possible volatility of the altcoin market easier for traders and investors to understand.\n\nA positive outlook for altcoins overall is frequently indicated by Solana's strong performance versus Ethereum and vice versa. Because SOLETH captures the growth and performance dynamics of two significant cryptocurrencies that are not Bitcoin, it is regarded as a barometer for market volatility. In the domains of NFTs and decentralized finance (DeFi), Solana and Ethereum are renowned for their strong ecosystems and noteworthy use cases.\n\nSignificant movements in these two assets may point to more general trends on the cryptocurrency market. Ethereum frequently serves as a benchmark since it is the bigger and more well known of the two. Conversely, Solana stands for more recent quickly expanding blockchain initiatives. It is possible to infer market sentiment regarding innovation and growth in the cryptocurrency space from the interaction of these two assets on the SOL/ETH chart.\n\nCardano's unexpected bounce\n\nCardano somewhat bounced from a local support level at approximately $0.35, with the potential to fight with the 26 EMA for momentum in the next few days. This bounce is a small but crucial step toward breaking an aggravating downtrend that has plagued the cryptocurrency for months.\n\nHolding above $0.35 is critical for Cardano in the near term. This level has provided a lot of support and might provide the groundwork for a future upswing. Cardano may indicate the start of a recovery phase if it can muster enough momentum to test and possibly break above the 26 EMA.\n\nAn RSI of about 37 indicates that ADA is in oversold territory, which may draw in buyers searching for cheap points of entry. But Cardano has not exactly performed well over the long haul. Even with the community's strong support and the project's lofty objectives, ADA has had difficulty holding onto its value. Cardano has experienced a protracted decline and has not been able to return to its prior highs since hitting its all-time high in early 2022.\n\nNumerous reasons contribute to this subpar performance, including the general mood of competition from rival blockchain platforms and slower-than-anticipated development progress. Although anticipated by many investors, the Cardano ecosystem has not yet produced the ground-breaking applications.\n\nAlthough the deployment of smart contracts on the Cardano network was a big step forward, neither the number of dApps nor user adoption has increased significantly as a result of it. Some investors have become frustrated with ADA's slow development, which has made them doubt the company's long-term prospects."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQSjlKYjlNY1RmVDZaT0VOMjc4VFdWWmMzNmVUb2FUQ3llWDNpQWJvNHh0N0s2c3lER3FFdWFvUmt2U1hLZnowS2pKVlh2TW15clFOVHV5SVdPenAzY195eXRDcy1XbXVoUXhfc2pEZjZUOTBPV2EwSVRESXJBRTB3Q2Vna1VJQkF2MWfSAY8BQVVfeXFMT1M5QWpTd084UnNKWi0wRk1WMzYzZ1BWT2V3aVZnSERZV2JQQTZ2bmRXd0lPZzRZbFlEeUxuNlJiR19ldTVkempMMkN4TGxSRjhqQU9OSWdQdHRWYWttOUpac1hVd0pGVjNhMEhoVU51MlRLR2t6eEJhWnZhWEV5R2NqaVVyNm1TUFlpMktPdkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "‘Fight isn’t over,’ despite SEC closing Ethereum 2.0 probe – Exec - AMBCrypto News",
        "content": "SEC concluded its 14-month Ethereum 2.0 probe without charging Consensys\n\nConsensys asserts that the fight continues, with two more SEC probes being contested\n\nThe long-standing legal battle between the United States Securities and Exchange Commission (SEC) and Consensys, the firm behind the MetaMask wallet, appears to have finally come to an end.\n\nFor nearly 14 months, the SEC had been investigating Ethereum [ETH] 2.0 and Consensys.\n\nFor context, Ethereum 2.0 refers to the post-Merge era when the network transitioned from Proof of Work (PoW) to Proof of Stake (PoS). However, according to Consensys, the battle is far from over.\n\nImpact of SEC ending the investigation into ETH 2.0\n\nThis development has sent ripples through the entire crypto community, raising the crucial question – What impact will this have on the broader industry?\n\nCommenting on the issue, Laura Brookover, Head of Litigation & Investigations at Consensys, told CNBC,\n\n“Well, we were very pleased, to receive the letter noting that the investigation into Ethereum 2.0 has been concluded, and that it was concluded without charges against Consensys.”\n\nShe added,\n\n“It’s the right result, it’s the result that should have happened, a year ago. But of course, the fight isn’t over yet.”\n\nBrookover also emphasized that the Ethereum investigation is just one of three separate probes that Consensys is currently challenging in its lawsuit in Texas.\n\nShe pointed out that these investigations are a significant part of the legal action they have undertaken to protect their operations and the broader Ethereum ecosystem.\n\nThe story so far…\n\nThis all started way back in 2018 when the SEC alluded that Ether was not a security. However, in 2023, the SEC quietly changed its position, asserting authority over Ether as a security and launching an investigation into Ethereum.\n\nThis prompted Consensys to file a lawsuit against the SEC on 25 April 2024, with an aim to protect the Ethereum ecosystem. The plaintiffs sought a court order to halt the investigation, arguing that Ether is a commodity and thus outside the SEC’s jurisdiction.\n\nThis legal action spurred significant concern from policymakers, including members of Congress and the general public about the SEC’s investigation into Ethereum 2.0.\n\nIn fact, on 7 June, Consensys sent a letter to the SEC asking for confirmation that May’s ETH ETF approvals, which classified Ether as a commodity, would end the Ethereum 2.0 investigation.\n\nResponding to the same, the SEC in an 18 June letter claimed,\n\n“We do not intend to recommend an enforcement action by the Commission against your client, Consensys Software Inc., with respect to this investigation.”\n\nThe fight isn’t over yet\n\nDespite the SEC’s decision to close the investigation, however, the letter lacks the transparency the industry needs. It fails to explain why the SEC closed the investigation and how this decision impacts other ongoing investigations and enforcement actions.\n\nThis leaves many questions unanswered and underscores the need for clearer regulatory guidelines in the rapidly evolving cryptocurrency landscape. Expanding on the same, Brookover concluded,"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQNE5jVXhoOHJPdmJfMGFnWVJmMm1PWnlDLTVjcWNGb1JlZmdSR2lSbmtTdWdyZk96M25XM1RQQ1ZRQWF4YnpRWGwybkJGbnI2anQ3QlJkVVRQSGt4Rkh1ZTFyX3BxalBBcExxQzlvcHNhTWMtMWg4QlFheDgtUmEzM0lwcHY5OUp1bDEyLW5LM0VhRFhWVlowNldYWnRndldmZkRvaW8zeV9BN0xWZnJmMTJR0gG6AUFVX3lxTE1HMGxmeGxVS0ZYOWg0OXRMSk5QLXE4RWVCWWl5U2JaSWE2SXNVUHhzMW9MLWdpUWJaTk1weHhFTnhhZF9lUDlNcGxmMU9MdXJJdjloWmVBM3luLUZzeGJ2OUdBRHhsTjFtQ1dMLU5QNUFycjBzYXVkQzZBMG13V01vRGxOQlRZYTBkQ05NN0pPVloyY3JoNkhzY2hleU9PRlZVR2tscW5pWjZERGFQMkp6a0txQjB4ME5xZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Trust Faces 'Comparative Disadvantage' Without Staking: SEC Filing - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGrayscale, the world's biggest digital asset manager, is currently grappling with the limitations of its Ethereum Trust (ETHE) in the era of Ethereum staking.\n\nGrayscale recently updated its ETHE disclosures, adding: \"The current inability of the Trust to use its Ether in Staking and receive such rewards could place the Shares at a comparative disadvantage relative to an investment in Ether directly or through a vehicle that is not subject to such a prohibition, which could negatively affect the value of the Shares.\"\n\nThis addition comes on the heels of Ethereum's successful Shanghai upgrade in April, which enabled stakers to withdraw their locked ETH and rewards—thus making staking a more attractive proposition for many investors. With annual staking yields ranging from 4-6%, ETHE investors are missing out on potential returns.\n\nIf the Grayscale Ethereum fund were ever to allow staking, the firm noted, it would first need to amend its Trust agreement with the SEC. And NYSE Arca—the exchange where ETHE shares trade—would need to apply for an SEC rule change. The firm wrote that it \"may seek\" approval to do so in the future, but made it very clear that it can't stake any of the Ethereum backing the fund's shares now.\n\nAD\n\nAD\n\nGrayscale's frustration is understandable, especially given its ongoing efforts to convert ETHE into an ETF.\n\nIn a March SEC filing, the firm argued for the benefits of being able to \"stake the Ethereum held by the Trust\" as part of its push for an ETH spot ETF. However, the SEC has repeatedly denied Grayscale's ETF applications, leading to a legal battle between the firm and the regulator.\n\nGrayscale is not alone in navigating these regulatory challenges. Other prominent ETF applicants, such as Fidelity and Ark Invest/21 Shares, have recently removed staking language from their filings in what appears to be a temporary concession to the SEC's concerns.\n\nUnder Chair Gary Gensler, the SEC has taken a cautious approach to Ethereum staking, arguing that staking services may constitute securities offerings. The regulator has emphasized the need for clear disclosures on how staked crypto is handled by companies, including whether funds are commingled.\n\nAD\n\nAD\n\nWhile the SEC seems open to approving spot Ethereum ETFs, the staking issue remains a point of contention. Some experts have warned of \"serious security risks\" associated with Ethereum ETFs, noting that large, centralized holdings could make the network more susceptible to attacks or manipulation.\n\nFor Grayscale, the staking limitation is one of several challenges facing its Ethereum Trust.\n\nETHE has consistently traded at a discount compared to its underlying ETH value, a gap that has widened to nearly 50% in recent months. Converting to an ETF structure could potentially help close this discount by enabling share creation and redemption.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORHJWTHhlNXBWUVBjdVdkN2VZdy1DUm1kSjI5X1Q5Wm13bXNOazA3MWhYQ3dLYmpOaG42d0lDWmRuU0lWTnhCVnFEVzFYZndTOC04OFNDbThfeHRoNVRtS0ZIdThpMXVqSDlvM2JqUWlVMVBVWUpMN2hkTWRUVG83MXZsczc0bXlyaGh1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Altcoin Watch: Ethereum and Solana Maintain Strength, Furrever Token Offers High Referral Bonuses - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 21, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is energetic and ever-evolving, with certain tokens standing out due to their special advancements and promising prospects. As we move through 2024, Ethereum, Solana, and Furrever Token rise as the must-watch cryptos, each advertising unmistakable focal points and openings for financial specialists.\n\nEthereum and Solana: Balanced for a Major Upward Move?\n\nLater market examination by Jason Pizzino demonstrates that the cryptocurrency market is right now in a stealth zone, characterized by expanded fear and diminished market intrigued. This period regularly leads to littler extended bars after beginning alarms, with key levels just like the 50% mark holding relentless and lows remaining marginally higher. These patterns suggest the market may well be equipping up for a critical upward move within the coming months.\n\nEthereum's Resilience In the midst of Market Declines\n\nEthereum (ETH) has appeared relative quality by keeping up its position over the significant 50% level of its extent, set up amid the May low. This period coincided with Bitcoin's crest taking after ETF news excitement. Later advancements, such as the SEC dropping certain cases, have encouraged Ethereum's price soundness, in spite of broader market decreases.\n\nWhereas the majority of the market has seen significant drops, Ethereum has managed to hold its ground. In case Ethereum breaks down to around $3,400, Pizzino proposes that $3,200 might be a secure level to observe. In any case, on the off chance that it falls below $2,829, it might flag that the ETF news isn't as positive because it shows up. This level of strength shows a bullish structure for Ethereum, proposing potential for a slow recuperation over the coming months.\n\nSolana's Bullish Positioning\n\nSolana (SOL) is in a comparable position to Ethereum, remaining over the 50% mark of the whole bear market range. As of now exchanging over $138, Solana includes a drawback support around $109. This situation indicates a bullish structure, with Solana putting in higher lows and keeping up quality inside its cycle. Previous corrections in Solana extended from 37% to 52%, recommending that a redress down to 50% would be steady with past designs.\n\nSolana's capacity to remain over these key levels despite market instability highlights its potential for a major upward move. The bullish structure of Solana, coupled with its historical correction designs, recommends that it is well-positioned for recuperation and development within the close future.\n\n\n\n\n\nStory continues\n\nFurrever Token: Earn 10% With Referral Program\n\nIn the midst of the major players like Solana and Ethereum, Furrever Token presents a revival and locks in turn to the crypto showcase. Outlined with a charming cat-themed environment, Furrever Token points to supply a delightful user involvement whereas advertising considerable monetary openings.\n\nThe continuous presale of Furrever Token has as of now raised over $1.3 million, with the extent as of now in arrange 9, pointing for an add up to of $1.9 million. The project's commitment to security, approved by an audit from Securi Lab, assists in enhancing its credibility.\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPOE1mZHpIRHpqRVR4Mk1oenpjc0g3ckozMkFBTUlnWTJ6UElzN1JUS3lGRWh4MUV5Uks0LTlna0hfc3lZVFVKZS1FNTNULWtmOEsyTEF4M09MTXR0emI3eEZMZWI0R1ZkWFhpckljZ2kwS1NERFFxSjFCOU5qcUlYSVFoWDZ5RVo2UDU2Y3RR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Applicants File Updated S-1 Documents With SEC - Watcher Guru",
        "content": "Multiple Spot Ethereum ETF applicants have filed updated S-1 documents with the SEC for approval of their ETF products Friday. As the last step before launch, The SEC requested that issuers file new ones to speed up the process of reviewing the ETF products.\n\nJUST IN: The following applicants filed an updated version of their S-1 spot Ethereum ETF application:\n\n\n\n• Bitwise\n\n• Fidelity\n\n• VanEck\n\n• Franklin\n\n• 21Shares\n\n• Grayscale\n\n• BlackRock — Watcher.Guru (@WatcherGuru) June 21, 2024\n\nBlackRock; Grayscale; VanEck amongst others submitted their S-1s today. The SEC must now review the forms and let issuers know of any final changes needing to be made before ultimate approval. These forms are necessary to offer new securities publicly. This process may take more time for the SEC to process for each filer, especially if the regulator still holds any dissatisfaction for Ethereum ETFs. However, the prediction for a July 2nd launch still looks possible.\n\nFor context, Ethereum-based Exchange-Traded Funds (ETFs) are a type of investment fund that holds Ethereum like stocks, commodities, or cryptocurrency. The ETFs trade on stock exchanges similar to stocks. The first round of Spot Ethereum ETF approvals came at the end of May 2024.\n\nSpot Ethereum ETFs To Come This July?\n\nSource: Altcoin Buzz\n\nEthereum Price Prediction: Can ETH Hit $4K After SEC Decision?\n\nThroughout this year, ETFs have dominated the digital asset sector. The industry’s landmark approval arrived in January, with Spot Bitcoin ETFs launching. The impact was near-immediate, as BTC would reach an all-time high just three months after its debut. The launch of Ethereum ETFs is expected to do the same for Ether upon launch. Already at press time, Ethereum is up 50% since the start of the year. Despite a bearish past month, July and August will be interesting in dictating the future of the asset’s price.\n\nThe hype around Ethereum ETFs is even spreading in Europe. UK-based multinational bank Standard Chartered is officially launching a Spot Bitcoin and Ethereum trading desk. Bloomberg reports that the $820 billion bank’s STAN will be used for buying and selling both BTC and ETH directly"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNamFEWFgyT01qMlVWZmVuVWF1NTF3Tks3YWdZUmFNbDJxV0xsb0lITmU1V1Q1WEVGcS1HOGdpWFRUcG9SZEpxVVRzcnpjYWJqejlDbHFEMDkyT1M2eFZwS0loN213TjJLeGNpU2JaRi1mZDhsNlZQUjFDaFZNRm5wYWFCRzRPWElTZzhLNTUyU2FOZ3ByOXVIbjZkazUwNGhSRFBDN1JSMHVhWncteTZzOFM2dkhhVUFfLUJQcWNmMERqOXNkZU9LckxXRGI4bGQ2dTA5dXJ5VdIB3AFBVV95cUxNMDdVMDRhV0o4VElXYzJ5VFZjcnY2dldLUEl5a1N1S1JFSDVMUVFkb1o0WG5QY0tET3RMQ1dqdHFqby0xeV85ZllKcU83dXhweDZpQm4wRDVtNE51aVpRTVNxQXphWTFyWFRldGpYRm1YZVRwRC1KZnBCWjdzZzBLSWlCcERXekIxZHU2Y2VJcHR5dmVOcEItNGRPM2s4THU5d3d5d1ZkRXhVQkdwelZZUnlfWGRRX0R6WE43bzFtVzNZWlE5S0V4bVZWWDdIWElDdzMxRWg2czRhV0h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "One Ethereum Indicator Is Signaling Altcoin Season Will Start Early, According to Quant Analyst Ki Young Ju - The Daily Hodl",
        "content": "The CEO of blockchain analytics platform CryptoQuant, Ki Young Ju, is updating his outlook on altcoins ahead of a potential approval of spot Ethereum (ETH) exchange-traded funds (ETF) by the U.S. Securities and Exchange Commission (SEC).\n\nYoung Ju tells his 348,500 followers on the social media platform X that Ethereum’s Market Value to Realized Value (MVRV) metric is flashing a bullish signal.\n\nThe MVRV indicator, which is used to assess whether a particular crypto asset is undervalued or overvalued, is the ratio of market capitalization of Ethereum, or any other crypto asset, relative to its realized capitalization (the value of all ETH at the price they were bought at).\n\n“We’re entering early altcoin season.\n\nETH MVRV is rising faster than Bitcoin (BTC) MVRV, suggesting ETH market is heating up relative to its on-chain fundamentals.\n\nGiven the current ETF situation, this might be an ETH-only season. Historically, when ETH surges, other altcoins tend to follow.”\n\nTurning to altcoins, the CryptoQuant CEO says that memecoin dominance is on the wane after reaching a 15-month high in March. Memecoin dominance is the proportion of the total market capitalization of memecoins relative to the total market capitalization of altcoins.\n\n“Crypto Twitter would be shifting from gambling to focusing on fundamentals, similar to a few years ago.\n\nPack it up lads, it’s over.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOS0Z3SkR3Q1RVUHFfZ2duZl9GV2NCeTl5NTJyLUxUSDBfemdNd0hzMmNhX2I1RWc0QVNfcXp6SWw3Y0NKY2RKQWNNN09xRkRVcTEtQVFqRzAwRmJ0RjdXaS14SVc3YjRpYnI2VmVjeXNrRTZHbnQ0Tm5ZdDE0ZEJiYlhYYW1yQ05OUTlhaHVmMi02MkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Investigation closed: SEC clears Ethereum - Yahoo Finance UK",
        "content": "In a significant turn of events, the U.S. Securities and Exchange Commission (SEC) has closed its investigation into Ethereum 2.0, opting not to pursue any enforcement actions.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nIn a significant turn of events, the U.S. Securities and Exchange Commission (SEC) has closed its investigation into Ethereum 2.0, opting not to pursue any enforcement actions. This development has been hailed as a major victory for Ethereum developers and the broader cryptocurrency community.\n\nThis decision follows the SEC’s recent approval of Ethereum-based exchange-traded funds (ETFs). In a letter sent earlier this month, ConsenSys, a leading blockchain technology company, argued that the approval of these ETFs implied Ethereum should not be classified as a security. The company behind the MetaMask Ethereum wallet had urged the SEC to close the investigation based on this premise. The SEC’s decision to stand down has led to a significant impact on Ether (ETH). Its price saw a surge, breaking $3,500 in the minutes after the announcement, showing renewed market confidence.\n\nThis closure of the investigation marks the end of a contentious chapter in Ethereum’s history. The SEC had previously considered ETH a commodity but changed its position, leading to regulatory uncertainty and a lawsuit from ConsenSys. The lawsuit, filed in April 2024, aimed to halt the SEC’s investigation, arguing that Ethereum is a commodity and should not be under SEC jurisdiction.\n\nThe views and opinions expressed in this article are those of the authors and do not represent those of City AM, its affiliates, or employees.\n\nConsensys views the SEC’s latest decision as the beginning of a new era. In a recent blog post, the company declared: “Today’s development marks the beginning of a new path forward.” This outcome is a testament to Consensys’ persistent efforts, including legal battles, to protect the Ethereum ecosystem. However, despite this victory, Consensys has stated it will continue its lawsuit against the SEC, alleging regulatory overreach.\n\nThe SEC’s regulatory approach has been a point of discussion within the cryptocurrency community. While the Ethereum investigation has ended, other regulatory threats persist. For instance, the SEC has issued a Wells notice to Uniswap, indicating potential enforcement action. Similarly, Coinbase faces ongoing legal battles, and the XRP community continues to criticize the SEC for its perceived bias following Ethereum’s favorable treatment.\n\nThe crypto industry remains at odds with regulatory bodies, seeking clearer rules and fair treatment. The SEC’s recent decision is a positive step, but the journey toward regulatory harmony is far from over. As the landscape evolves, both crypto developers and regulators will need to work together to put in place a balanced framework that fosters innovation while ensuring compliance.\n\nThe views and opinions expressed in this article are those of the authors and do not represent those of City AM, its affiliates, or employees."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBZMWpwWWx5ZEN0R1RaVWY0TkVvZmliTnAtQ1Q5UnNOTjlYNzdWR0VSTUhwWmlTYXVjektvcFZMOEpocjRaUEd1MmhVSEJWTm9JRW9UQzBOOHVncGx5cF9LZXMzSEJxemU3SDZSckZvcFJaaWZ2bk00UkNMUTM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered set to debut spot Bitcoin, Ethereum trading platform - Crypto Briefing",
        "content": "The bank will place the new desk under its FX trading division.\n\nShutterstock cover by Willy Barton\n\nShare this article\n\nStandard Chartered is launching its spot trading operations specifically for Bitcoin (BTC) and Ethereum (ETH), Bloomberg reported on Friday, citing people familiar with the matter. The new offering will expand the bank’s suite of digital asset services, including crypto custody and OTC trading.\n\nStandard Chartered’s FX trading division will handle spot trades for the two leading crypto assets. The new desk, based in London, is expected to launch operations soon, as reported.\n\nWhile banks like Goldman Sachs Group have offered crypto derivatives, direct dealing in the assets has been limited due to stringent regulations. The Basel Committee on Banking Supervision’s proposed rules have made profitability challenging by requiring a high-risk weighting for crypto exposure.\n\nStandard Chartered is working with regulators to address concerns and meet the demand from their institutional clients who want to trade Bitcoin and Ethereum.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” a representative from Standard Chartered stated.\n\nThe launch will make Standard Chartered among the first major banks to establish a spot crypto trading desk, paving the way for wider institutional adoption."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1mZ1VuSE5fRUxTc3doNEphZUpXUFRuUHo3c0JYSFpCcmhlNGZXMkpmX1RjU1JTVWFPSnBlcmdhM2xMYmYydVc3VER4WmFHQjBpZzdiX0s2UXZtSV9wZ05ISzdQOW1OSU5oTHJhTWt4bmQ4Y3c0NVB6R0QySQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Could Holding 6 (ETH) Still Make You a Millionaire? Cathie Wood's Ether ETF Pullback And Her $20 Trillion Market Cap Prediction - Yahoo Finance",
        "content": "Could Holding 6 (ETH) Still Make You a Millionaire? Cathie Wood's Ether ETF Pullback And Her $20 Trillion Market Cap Prediction\n\nEarlier in the year, Bitcoin dominated financial headlines thanks to its recent halving and the emergence of spot exchange-traded funds (ETFs) boosting its demand. However, Cathie Wood of Ark Invest made a bullish prediction that Ethereum (ETH) may soon catch up to Bitcoin and potentially offer investors significant returns in the years ahead.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nDogecoin millionaires are increasing – investors with $1M+ in DOGE revealed!\n\nSpeaking at Big Ideas, an investor conference hosted by Ark Invest, Wood shared her optimistic outlook on Ethereum. She projected that Ethereum’s market capitalization could soar to $20 trillion by 2032. Given Ethereum’s current supply of approximately 122 million tokens, this projection translates to a staggering per-token price of over $166,000. Moreover, since the Ethereum Foundation continues implementing token burns, this price could rise even further.\n\nAt the hypothetical price of $164,000 per token, holding six ETH would equate to a value of just under $1 million. In comparison, the current price for six ETHs is roughly $21,000. To put this into perspective, the total market capitalization of the S&P 500 is approximately $40 trillion, while the global value of above-ground gold reserves is estimated at around $16 trillion. While reaching a $20 trillion market cap is theoretically possible for Ethereum, such a milestone is likely far off, if it happens at all.\n\nWood’s optimistic forecast is primarily grounded in Ethereum’s potential for mainstream adoption. Today, Ethereum is mainly used to interact with decentralized finance (DeFi) applications, which offer services ranging from borrowing and lending to storing health records.\n\nHowever, in 2024, DeFi remains predominantly focused on small-scale financial platforms. Wood argues that if Ethereum can expand its use cases to provide substantial user benefits, broader adoption could follow, potentially driving up the token’s price.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nWood’s projection, while ambitious, may partly be intended to generate excitement among investors about Ethereum’s future. Despite the optimism, her forecast might not materialize as predicted. It’s crucial to note that Wood has a vested interest in Ethereum’s success. Ark Invest, her firm, already offers an Ethereum futures ETF (ARKZ).\n\nHowever, it was reported by Bloomberg that Ark Investment withdrew from issuing an Ethereum exchange-traded fund (ETF). Previously, Ark had submitted an application for a spot in Ether ETF in partnership with 21Shares, but Ark’s name has now been removed from the filing. Despite this withdrawal, Ark’s official statement emphasized the company’s continued belief in Ethereum's transformative potential and long-term value. Bloomberg analyst Eric Balchunas suggested that the decision might have been influenced by the ongoing \"fees war\" in the market, which complicates profitability for issuers.\n\nStory continues\n\nThough many believed that the introduction of spot Ethereum ETFs would bring a boost to ETH prices, when the U.S. Securities and Exchange Commission (SEC) made a surprising move to approve the sale of spot Ether ETFs last month, ETH continued to slump, nearly dipping under $3,000 per token earlier this month. We've seen an incredible bounce back earlier this week, peaking at nearly $4,000 before hovering at $3,500 again.\n\nAn increase in Ethereum’s trading volume would benefit Wood, particularly in relation to Ark Invest’s financial products. Despite this potential conflict of interest, many investors remain optimistic about ETH’s future. As cryptocurrency adoption continues to grow and the possibility of spot Ethereum ETFs looms, there is considerable potential for ETH to achieve new price milestones.\n\nThis story was previously published on Benzinga and has been updated.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Could Holding 6 (ETH) Still Make You a Millionaire? Cathie Wood's Ether ETF Pullback And Her $20 Trillion Market Cap Prediction originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNd1pnWGRJZk90NVZCd2J2cTMxeUVfSzZaUHloVTJLZGNkUU9JOTRNdlE3cUsydVUwblBYc3lIZE11T0QxMXNtcGx1RmMzUVpxV095Rnp3TmVJekFJWWZLRUNHODRrOEtBUTR3VzdEZUVoSGV0UWdqbTZyNHRiVFNmQ1NqUXdUSTRNbDNMRURud1ZMUF9TeG40czlNOVZyOS1uNjBWMENyYnFibFFSWEU2LW95eXNxcDBNQVdkd3RDWXNsU2h3UHlrRXFZT052V2tPSEdOeGUzTVVlWWta0gHiAUFVX3lxTFBibWFHVTFuNUJIVmZHZWtoNFpfZlctQXVGWWgzNExyUHpGNGdlWmhvWWlTOERiRXV6ekJMbzNhc1pFSkNGcGtVemNHd1VsMlRKTU1hX0thRzRhLUprTmlmdDg3dENXbGtLZUdNX1c0eFdNOGhSVzNrX0tFZHREUko5STNVTjBZSGctdXpsdDk3bGtndUVuY3Z3cUhmS2d6b2NsbTY1ZG1MU21UWDV5eEpkamZNcm4zeXpPdXQ1R0FrR1NfUjBpNE81VHBqUFdTQmtnVlFuX2Z3Nk8xNklfYnVsd3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum On-Chain Metric Suggests Potential for Altcoin Market Rallies, According to Analytics Firm CryptoQuant - The Daily Hodl",
        "content": "An Ethereum (ETH) on-chain metric suggests the altcoin market could be primed for a price surge, according to the digital asset analytics firm CryptoQuant.\n\nThe firm says on the social media platform X that Ethereum’s Market Value to Realized Value (MVRV) indicator is rising faster than Bitcoin’s (BTC) MVRV.\n\n“This suggests that ETH’s market is heating up. Historically, when Ethereum surges, other alts tend to follow.”\n\nMVRV is the ratio of a digital asset’s market capitalization relative to its realized capitalization (the value of all the assets at the price they were bought). It is used to assess whether the token is undervalued or overvalued.\n\nETH is trading at $3,514 at time of writing. The second-ranked crypto asset by market cap has largely traded sideways this week.\n\nCryptoQuant also notes that Bitcoin is trading below the critical support level of $65,800, which the firm says suggests a potential 8%-12% correction toward $60,000.\n\nBTC is priced at $64,148 at time of writing. The top-ranked crypto asset by market cap is down nearly 1.5% in the past 24 hours and more than 3% in the past week.\n\nJulio Moreno, CryptoQuant’s head of research, says on X that the Bitcoin market is currently at its least bullish point since September 2023, based on its bull market cycle indicator.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNT1docF9SMTdLRE5yUTNHdmdRVERaVHdFOWlIQU9KbGgtSXd6WHRvM3M1aXY4clVoU0tTbVpUTW9nS21wbl9rbUtJUzRMTkxtNkZuMDA0dUREbzhKRWhxdEFHMDA3TVZ0TW0xZ25qaWNnLVFzNkJjQUhJUjBPbVEwME0tQkVpQl9KbVlWbmVR0gGTAUFVX3lxTE9jZmpxbFl3UzQ0VkZ5cmdaZ2ZZcmVyNEFLTElkTlh4cEoxZVNLZkFfWU0zNGFvWkozZEtrNHlMblk0LXFaUjdNYXRkZTh6Qi1xWkJqbm9uWWpLZ2wzbGh5aHVGUWlGY0hHRG85cVdsT1FSMEl2dVFFQVJ6LUN6TWhyOHZDNmlTN0s2dnZUbFhVbHdpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Updated Filings Submitted by Applicants: Hot Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nPopular Chinese crypto journalist and blogger Colin Wu has reported that senior ETF analyst of Bloomberg Eric Balchunas revealed documents showing that the spot Ethereum ETF applicants have updated their S-1 filings.\n\nThose applicants include BlackRock, Fidelity, Grayscale and VanEck giants.\n\nEthereum ETF filings updated\n\nAccording to the aforementioned documentation submitted by the companies, Franklin has set its Ethereum ETF fees at 0.19%, and as for VanEck, this figure is set at 0.2%, as was announced on Friday.\n\nBesides, BlackRock, the world’s largest money manager, made a disclosure of a $10 million seed investment as a major undisclosed investor acquired $10 million worth of its future ETF (ETHA) shares.\n\nAdvertisement\n\nEric Balchunas believes that the likely date of the spot Ethereum ETF approval is July 2.\n\nDocuments released by Bloomberg analyst Eric Balchunas show that eight spot Ethereum ETF applicants, including Bitwise, Fidelity, VanEck, Franklin, 21Shares, Grayscale, BlackRock, and Invesco, have submitted updated versions of their S-1 documents. Franklin set its fees at 0.19%… https://t.co/bal52OEs6C — Wu Blockchain (@WuBlockchain) June 22, 2024\n\nEarlier this year, in January, the same companies had their spot Bitcoin ETF filings finally approved by the Securities and Exchange Commission (SEC). Once trading started, the ETFs began accumulating large amounts of BTC on a daily basis.\n\nBTC ETF outflows rise to major negative record\n\nAnalytics X account @spotonchain spread the word about yet another day of outflows faced by spot Bitcoin ETFs. According to a recent tweet by this entity, these ETFs have been seeing negative inflows for the entire past trading week.\n\nOverall, on Friday, the exchange-traded funds that track the spot Bitcoin price saw $545 million withdrawn from them. Grayscale faced a $34.2 million withdrawal, and BlackRock’s IBIT ETF just had a zero netflow on Friday.\n\nStill, @lookochain reports that BlackRock did have an inflow of 23 BTC, and Invesco Galaxy Bitcoin ETF acquired 229 BTC. According to the same source, Fidelity and Bitwise saw outflows of 787 BTC and 485 BTC, respectively.\n\nEthereum scores victory against SEC\n\nAs reported by U.Today, earlier this week, Consensys reported that the SEC had finally ended its investigation into Ethereum 2.0. This was a major victory for the Ethereum team and ETH holders since the regulatory agency announced that it did not find any grounds to label ETH as a security.\n\nThis propelled the ETH price up by approximately 5%, as the coin’s price soared above $3,500.\n\nOn Thursday, the second largest cryptocurrency surpassed the $3,600 level. However, since then, ETH has seen a plunge, going down to $3,486 by now."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZXRXVk1ZaFBvNzhXMVFaVFdPT2pJMXpQemtmWmszYWpNc2ZKTTRSZUhRU3B6dzg3LS1EZUdvcE5FVVVnUW1kaGRDbU04eWJfRjRoZzhyeWhiUkJHQXczQTNhQk5oaXpnQU1wOXA4ZzludFVVU2NiVHVJLWxHcUdsbNIBiAFBVV95cUxPWTFZVHVfbmpDVGV1V3p4amF6ODBuQUhPZ3Z5QTFGamN3VnFiTDNZYUJMc1dWUzZVVm40cFV5blJSdFlycG1qTWZJVmJpX2NkT1RYblhJbnFkcHZSNVZEWm9kbjNncjg5Um5YMXBIRTV3X1dMdmRXRTZEdHJIQzhLeTdDSGlIOW84?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Derivatives Traders Are Deploying an Iron Condor Strategy - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum has fallen to $3,480, a 3% slip in the past 24 hours. Traders at Wintermute told Decrypt that ETH appears to be range-bound between $3,200 and $3,400 as derivatives traders are likely profiting from an Iron Condor strategy. The firm added that Bitcoin has been similarly range-bound between $63,000 and $65,000.\n\n\"Market consensus is these areas take importance as 'lines-in-the sand',\" an analysts from the firm's trading desk told Decrypt, \"and I'm seeing traders lean on them to define risk.\"\n\nAn Iron Condor is a direction-neutral options strategy where traders benefit from the underlying asset staying range-bound until the expiration of options.\n\nIt’s a relatively low-risk strategy that’s suitable for traders who expect low volatility in the Ethereum price. But because it involves buying and selling four different options contracts with the same expiration date, it requires precise timing to pull off.\n\nAD\n\nAD\n\nThe Wintermute analysts highlighted that the price range is an important area for derivatives traders, and a major swing in either direction could have a drastic impact on the price of ETH.\n\nEthereum’s open interest dropped to $11.5 billion this week, which indicates that traders believe major price swings in the asset are unlikely. That's for the short-term. But there are signs that traders expect upward movement in the coming months.\n\nThe analysts noted that yesterday, a large trader bought Ethereum options with a $4,000 strike price while paying a $12,054,100 premium. The expiration date for these option contracts is September 27. The trader could potentially profit to the tune of approximately $107 million if ETH witnesses an upswing, especially if it crosses the $4,000 mark.\n\nThe expiration date of these contracts is important, as the U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler has stated that U.S. spot Ethereum ETFs will go live sometime this summer.\n\nAD\n\nAD\n\nOption contracts expiring between June 28 and July 5 have witnessed an increase of 6-8% in their implied volatility (IV). High IV indicates that buying options contracts is more expensive and poses a greater risk for the buyer. Additionally, these contracts are likely being bought in anticipation of commentary from the SEC regarding U.S. spot Ethereum ETFs.\n\nEthereum has seen some major positive developments over the course of the week.\n\nIn the past 24 hours, Bitwise has released a TV commercial for Ethereum ahead of spot ETFs. The firm minted the video as an NFT on the Ethereum blockchain.\n\nEarlier this week, leading Ethereum developer Consensys announced that the SEC had closed its investigation into Ethereum 2.0 without filing any charges.\n\nThere are also signs that even without a start date for Ethereum ETFs to begin trading, institutional demand is starting to gain steam.\n\nPantera Capital Management LP is planning to invest $100 million in the Bitwise Ethereum ETF, the issuer noted in an SEC filing. A report based on data from research firm K33 indicates that Ethereum ETFs could potentially attract $4 billion in inflows within five months of their launch.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1ZaDJTdURzc3JFTmZSLTAwcXdzRGJrYjRQZGRYMVNMU3dlTmczTEVxYzl6S2dLMEFnTXNaWEFtUFBEOUx4bTJnVTV4djJMYzg4ejJzcHhSMExCeHFTZVVfMVQzQk5oMS1VVXRIbTZ4MEUyNDRZYkHSAXtBVV95cUxNaEdCOHlNQjRaZFlKUUdfblIxOV9ZOHdmUE1tLVI2V00zcUNndDMzNGdVelVqeGFqMVc4aVNMRVFDZ1YyT1NWT0preHBOdUNtNFEteXhjNldHclZLS1p0U2lVcXRVcEVlaHhIZ2lrMkJYb2ZoT3BtV3VRdkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Big Break Coming for Ethereum (ETH) DeFi, Here's Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe decentralized finance (DeFi) sector within the Ethereum network is poised for a major breakthrough. This projection is based on recent observations within the ecosystem and the broader cryptocurrency space. Renowned analyst and cofounder of Syncracy Capital, Ryan Watkins, asserts that the current setup for Ethereum DeFi is the strongest it has been since 2020.\n\nAdvertisement\n\nDeFi’s strong revenue growth and low valuations\n\nThe optimism lies in several factors such as the volume of revenue, upgrades in technology and the pending spot Ethereum exchange-traded-funds, ETFs, awaiting the final nod by the United States Securities and Exchange Commission (SEC).\n\nPer Watkins' analysis, DeFi leaders are seeing record-high revenues, while their valuations are at historic lows. This combination of high revenue and low valuation presents a compelling opportunity to investors.\n\nThe setup for Ethereum DeFi is the strongest its been since 2020.\n\n\n\nDeFi leaders are generating all-time high revenues across the board, yet valuations are the cheapest they've been in history.\n\n\n\nBetter yet, these revenues will likely accelerate from here as DeFi leaders rollout… pic.twitter.com/WmaajQIpxI — Ryan Watkins (@RyanWatkins_) June 20, 2024\n\nSome of the leading DeFi applications on the Ethereum network, such as Lido, MakerDAAO, Uniswap and Aave have recorded progressive increases in revenues, surpassing their 2022 peaks. Aave's annualized revenue for 2022 was just over $500 million. However, in May 2024, it reached an all-time high of $750 million.\n\nFurthermore, this revenue is expected to grow even more as DeFi leaders implement major upgrades, such as Maker's Endgame and Uniswap V4.\n\nAdditionally, the introduction of the Ethereum ETF is anticipated to spark renewed interest in the Ethereum economy. Despite facing a challenging regulatory environment since \"DeFi summer,\" the sector is gradually seeing improvements. Although there are no major policy changes expected in the near term, the overall narrative is becoming more favorable.\n\nMarket momentum and future prospects\n\nWatkins insists that as long as the long-term bullish trend continues, DeFi should benefit from positive momentum, given its highly cyclical nature. Market experts are optimistic that more and more users will be attracted by the DeFi offerings, further fueling growth.\n\nAlthough Uniswap is yet to generate any revenue, Watkins maintains that the potential for activating the fee switch seems imminent."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQRE4zNTFGWUJ3aDhoYm4yOGZsZ2o4bWg2T3A2dElZQ1JVQTR4VWZKenBlcl93Y3h4aXhKZnZIOW0tTE9zdXRHT2VjZW80SFh3RW84bVlaRFhkaUhaWG44OGU5eUJhZXpDSDFuTmRMVzgyUllfeUJ6NDdfQk5LYUVyVWVjX2JDVUJVNXdCeTRpb0hFVkpCbFBtUVlmMjkzZkxkTHE2T0tZdHBHZV9Za1pMSHdxU1pqUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum L2 Blast Posts All-Time High in Daily Transactions and Users Ahead of Airdrop - Unchained",
        "content": "Airdrop season continues as Blast’s token generation event is set to occur on June 26, about a week after interoperability protocol LayerZero and rival blockchain network ZKsync opened up claims to their airdrop\n\nAhead of next week’s airdrop, Blast has a total value locked of about $2 billion, more than Base’s $1.6 billion.\n\nBlast, an Ethereum layer 2 blockchain network, recorded all-time highs in daily transactions and active users on Thursday, ahead of its airdrop scheduled for June 26.\n\nAccording to data from blockchain analytics firm Artemis, the number of wallet addresses active on Blast, a rough proxy for active users, more than doubled from roughly 73,500 addresses at the start of June to about 168,400 as of June 20.\n\nThe increase in active addresses coincided with an uptick in daily transactions as well. Users generated 640,1000 transactions on the first day of June. Since then, the number of transactions has grown almost 72% to 1.1 million transactions, per Artemis’ most recent data.\n\nRead More: What Is Blast on Ethereum? A Beginner’s Guide\n\nThe all-time highs in daily transactions and users come as those in the Blast ecosystem are gearing up for the protocol’s airdrop, set to occur in less than one week. “Dapps must distribute all Gold and Points to users by June 25, 8 a.m. ET in order for it to be counted,” wrote the Blast team on X two days ago.\n\nHalf of the Blast airdrop is allocated to points, which are earned by users based on the balance of their wallets, while the remaining 50% has been earmarked for “Gold,” which is for decentralized applications building natively on Blast. According to Blast’s protocol documents, “Gold is meant to be used as incentives for Dapp growth. This means that Dapps should give 100% of any Gold they earn to their users.”\n\nBlast’s record levels prior to its airdrop also comes in the same week interoperability protocol LayerZero and rival layer 2 blockchain network ZKsync opened up their airdrop claims, aiming to reward their contributing users.\n\nSybils\n\nThe increased network activity in addresses and transactions for the months-old layer 2 blockchain network is a sign of Blast’s popularity among users. But it is also safe to assume that a number of these addresses and transactions stem from Sybil techniques, in which one person acts as many users by employing more than a single wallet.\n\nThe goal of a Sybil attack is to simulate the kind of activity rewarded in an airdrop, distorting the on-chain picture of user activity so the attackers can, in this case, claim a larger share of the airdrop. Attempting to identify and disqualify addresses engaged in Sybil activities has become a common practice during a protocol’s preparation in conducting its token generation event.\n\nLow-scale Sybil activities would mean a relative handful of Blast addresses were duplicates, while professional Sybil farmers may use thousands of wallet addresses to generate transactional activity on the network."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQbVNTQ2kzOFc4MkM1UGtUUlBpNkVROHNZd0lBaklmM3RHVnlNRnU1SVZ2R01BOW1DczZKOTgtMUFmWlVTZFJMcWhxTnd6VkR0WFhycjI3ODRjRXVkQWRwTXNqd0ZNSzVTTkM4bTdUcTZqSjA2WHE3TUFERnEzTEpJN1lublR1cWVMRGc2d9IBkgFBVV95cUxNWHlzUXFQb2hOQlJuNm1VV19yMHpUbFJaSDZYZkxJbHdseklwdU9NSnl5OFFHajNtS29GT0ktUHFlU2FBMkQzQWFSYXVMTGVxVWszdkFTdnpmT2lhQlJjS3BKRU4zOEhETC1KdHNqdDd3Y3BQZG5tWjJRdGxKLTNhb1JLUldmUHVJbVFUUzlYLTd6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: VanEck, BlackRock file their S-1’s and that means… - AMBCrypto News",
        "content": "S-1 filings were sent by firms such as VanEck and BlackRock to the SEC\n\nETH’s price action has remained the same, with network growth recording an uptick\n\nEthereum’s [ETH] price has been clinging on to the $3,500-level for quite some time now. However, recent progress in the ETF space could lend the world’s largest altcoin some much-needed respite on the charts.\n\nS-1 filings on the rise\n\nInching closer to launch, eight applicants for spot Ethereum ETFs, including major players like Bitwise, Fidelity, VanEck, and BlackRock, filed updated versions of their registration statements with the SEC ,according to Bloomberg analyst Eric Balchunas. These S-1 filings mark a key step in the approval process for these ETFs.\n\nFranklin and VanEck have already disclosed their expense ratios, with Franklin setting its fee at 0.19% last month and VanEck following suit on Friday at 0.2%. BlackRock, on the other hand, revealed a $10 million seed investment in its proposed ETF.\n\nThe SEC will now review the updated filings and provide any feedback to the issuers before a final decision is made. This development is a positive sign for investors who have been eagerly awaiting the launch of other spot Ethereum ETFs, potentially opening up easier access to Ethereum for traditional investment portfolios.\n\nBalchunas also offered a tentative date of 2 July as a target for the launch of these Ethereum ETFs. While this is not an official confirmation, it does provide a clearer timeframe for investors who are eagerly awaiting access to these ETFs.\n\nHere, it’s important to note that the SEC still needs to review the filings and potentially request changes before final approval is granted. However, Balchunas’ prediction suggests a potential launch window in the coming weeks, if the SEC’s review process progresses smoothly.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,502.74, with its price down by 0.29% in the last 24 hours. Despite the decline in price, however, its network growth surged significantly over the last few days. A hike in network growth indicated that the number of new addresses interacting with ETH had grown materially.\n\nAs interest from new addresses grows, the chances of ETH rising to its previously-claimed highs also increase.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nCoupled with the hike in network growth, the velocity of ETH also surged. This implied that the frequency with which ETH was trading at had risen significantly over the last few days."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOTzBDam10Y1lBNWpvVndkdW5DMGR3Y0hwVVA2d3pwbmJvZEc1TXd4UmM5N1hPUV9yVWNiZ0FRWXd6OVdWY201VXlDZDZ1aV9vdjZ5ZFZZMjlOMXYwX2x3SFVCVHZMTmdEeGpob0s5ZWhWV2hacGpKSGZlaERCLVluWXdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Bullish sign for Ethereum as exchange balances drop - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNb0wzSnlqdTlYMTl5X2NTY1dUZ0lKbTBBS2tWUTZEdlkxRklPNEdJaHBCbWNLS0FzeVZia1BXdUYtMmtIRllYUHZSQWxmeWtFMGFmdXJzVWRSV3BTR1FzcXFrdGN2RDA3c1BIZUk2UWZKbnVrYUtjRzB5enhzVjVrMTdIWEYzNWM0RFpCWlZ4OXdTZlc2V0dEdWNRd3VYVVdGQXlaQlRR0gGrAUFVX3lxTE1ES3hxbzNseG9pRlIwRC1FRERJeXZ0UEE5dmxKODhzajQ5aUhIRjlsRDVsWnEzcm9DZmlGTDE3WXBlT1ZJb1BFdHlZbVdWY3o1VE5hYXFzQjdReTdrU2pUVURtajV1VllaYXlGdlpyY3ZROWJkZHlxaHIwWnhWczhCcHRpR0hNOVhSeU5HaEhoQjlJVFJfa3A5S3Jqc3laT2ZuN0QyRThONVdYSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Eyes $3900 Rebound as On-Chain Data Favors Ethereum Over Bitcoin - CoinGape",
        "content": "The second largest cryptocurrency Ether witnessed medium volatility for the past two weeks, hovering above $3360. The prolonged correction in Bitcoin and development around spot ETH ETF are fueling the uncertainty sentiment in this asset resulting in sideways action. However, with the broader trend bullish the Ethereum price shows growth in on-chain data indicating a potential for bullish reversal.\n\nAlso Read: S&P Global: Ethereum Restaking Can Give Birth to ‘Internet Bond’ Market, Will SEC Approve?\n\nadvertisement\n\nKey Support Levels In Ethereum Price Amid ETF Updates\n\nEthereum coin entered the current correction trend in late May as the price reverted from the $3975 level. With Bitcoin price leading a downward trend, the ETH price of 15.5% to seek support at $3360, concising with the 100-day EMA.\n\nThe long-tail rejection candles at this support indicate the intact demand pressure likely bolstered by the development in Spot ETH ETF. Six companies have updated their SEC applications for Ethereum ETFs, as highlighted by Satoshi Club.\n\n📜Six companies have submitted amended applications to the SEC for the registration of spot Ethereum ETFs. Two of them disclosed the commission fees of 0.19% and 0.2%. Three companies indicated the initial investment volume, which is significantly lower than that of… — Satoshi Club (@esatoshiclub) June 22, 2024\n\nTwo firms disclosed fees of 0.19% and 0.2%, while three revealed initial investment volumes significantly lower than BlackRock’s. With the recent success of Bitcoin ETFs, the U.S. listing of spot ETH is anticipated for a major impact on Ether price.\n\nAccording to CryptoQuant, Ethereum’s Market Value to Realized Value (MVRV) ratio is outpacing that of Bitcoin, suggesting an uptick in market activity for Ethereum. This increase is often a precursor to broader market movements, historically leading to rallies in other altcoins following Ethereum’s lead.\n\nThus, even if the overhead supply pressure persists, the ETH price may likely fall 6% before witnessing high demand pressure at the ascending trendline. This dynamic support intact since November 2023 bolsters a series of higher lows maintaining a buy-the-dip sentiment.\n\nIf the support holds, the ETH price could take the next recovery leap targeting the $3900.\n\nHowever, for buyers to regain better control of this asset, a breakout from the above overhead trendline (blue line) is crucial which could assist the ETH price prediction to target ATH at $4842.\n\nTechnical Indicator:\n\nPivot Levels: With the ETH price projecting a potential for a new high, the Pivot indicator highlights potential resistances at $5371, followed by $6000.\n\nRSI : A daily Relative Strength Index slope wavering around the 50% mark indicates a neutral sentiment among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQSHp3aFo5RlZnSmNwOFA3dG8tOExuQmhSbmRfaHA4M09aeGRYQUs5Y3gzd2U2RlV0WFJsb1l1WXk2U0x0bHZ6UHRSMmQxZk5fZ3VsR1EtLUd5MmprNDFQUWhjRnFDNTBSbU5OVFVXbGwtVEV2cGs2eVAzWGxVeHJSWEdIay1VN1V2Q3d0bEpKc9IBlAFBVV95cUxQampzNWx5UGZwREdqWVM1bXJpcnkyTXhNZHJfcXZxSjFyZy1VTWNXQk8tcEhwajFUb0NSLWFaZ0pvZG1XbUhIRmhpemdXYmgzaU9JVm1XNEs2eXhnb1BTMG9IdEhCbHNNcG1DbWQ3Z2JidUh4RDJNUVlTR3djQUtwTWE3V3hqQjhWV25lbHFiSjdsaHZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "From Ethereum to Polkadot: The Journey of Gavin Wood - Crypto News Flash",
        "content": "Gavin Wood co-founded Ethereum and wrote its first implementation, pioneering smart contracts.\n\nWood founded Polkadot, enhancing blockchain interoperability, and later transitioned to Chief Architect for innovative focus.\n\nGavin Wood’s journey into the world of blockchain began using LEGO bricks rather than a computer. Self-described as a “technologist at heart,” Wood’s early interest with creating intricate constructions gradually moved from actual blocks to digital ones. This love of innovation and problem-solving made his later activities in the blockchain sector possible.\n\nBitcoin was the first cryptocurrency that Wood came into contact with. Thanks to the Silk Road online black market, his discovery was, in a sense, accidental.\n\nEnticed by the mathematical approach of human cooperation and interaction found in Bitcoin, Wood recognized the possibility of establishing whole new social systems. In little time at all, this interest became a professional possibility.\n\nThe Birth of Ethereum\n\nWood had a meeting with Vitalik Buterin and other trailblazers engaged in the ambitious Ethereum project in 2014. Once Wood joined this team, he was instrumental in turning Ethereum from a white paper into a working blockchain.\n\nWith the creation of the initial Ethereum implementation, he introduced the world to smart contracts—a ground-breaking idea that made decentralized, programmable transactions possible.\n\nWood wanted to create a platform that might propel social change as much as a new coin. Ethereum seemed to him like a means of creating a new planet that would propel human development for the remainder of the century.\n\nHis Ethereum work established the foundation for a significant force in the blockchain space that would upend established financial and economic institutions.\n\nMoving Beyond Ethereum: The Creation of Polkadot\n\nWood made major contributions to Ethereum and then focused on addressing some of the shortcomings he observed in the state of blockchain technology. As a result, Polkadot, a technology meant to facilitate smooth interoperability between several blockchains, was developed.\n\nThrough its special architecture, Polkadot addresses the scalability and governance problems that single-chain networks encounter by enabling several blockchains to run concurrently.\n\nood just presented a significant Polkadot update at the Token2049 conference: the Join-Accumulate Machine (JAM). By enabling multi-core computing and improving network flexibility, this new protocol seeks to offer a more modular and minimalistic design.\n\nFrom Polkadot’s current Relay Chain, the JAM protocol marks a dramatic change that will solve present constraints and advance the ecosystem toward its lofty objectives.\n\nWood resigned from Parity Technologies, the business that owns Polkadot, in October of 2022. He is still very much a part of Polkadot’s technical and conceptual components as Chief Architect, even if he is no longer CEO. This change enables him to spend more time on the creative improvements and projects that still define his profession.\n\nThe Broader Impact of Gavin Wood’s Work\n\nWood made more than just Ethereum and Polkadot contributions to the blockchain space. His concept to build decentralized platforms with blockchain technology has impacted a great deal of initiatives and businesses.\n\nThrough enabling interoperability between several blockchains, Polkadot has created new opportunities for both developers and companies, encouraging creativity and teamwork throughout the ecosystem.\n\nFrom a LEGO fanatic to a blockchain visionary, Gavin Wood’s path demonstrates his unwavering quest of technical innovation. Beyond what blockchain technology can do, his work has encouraged a new generation of developers and entrepreneurs to go outside the box.\n\nThe tale of Wood is proof of the ability of creativity and vision to propel technological advancement. Key elements in his success have been his commitment to finding solutions to difficult challenges and his ability to predict the promise of blockchain technology.\n\nWood’s story emphasizes for would-be entrepreneurs and engineers the value of remaining inquisitive, accepting obstacles, and never stopping to get better.\n\nThe future of distributed technology seems bright as long as Gavin Wood keeps leading and innovating in the blockchain field. His efforts with Polkadot and the JAM protocol are expected to completely change the way blockchains communicate, strengthening and expanding the ecosystem.\n\nRecommended for you:"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUndSbVNhbXJGam5fWDlRajdpMzdHUEZuZVRHQUtLME03MEppcDczbzI2MHRoZzk4Yl9CUjhRQXhaWjVtRWVHbFhxU2FwN253QTVLUmhHTVJrOXFQX1dJejlISVA2aDdTdV9aWDFrd3ZFZEtKcXZfZjY4VXR3ZnE3dEt30gGKAUFVX3lxTE81T1hPRmpIX2RPZFhMREVHSW9TQmJudTZ3Tk15YXhFeXdxZFVWbW1TUWJ6T3FSN0lKSjlGZnZESm5KTnR2RTEwMXN4bFNhOWNBT2NhLTBKc3pxbUVON09uRDhMTExVbTFKUEtzT21NUVBZWWF2YXZlOWtDX3RBRVZHdUFIQVF2a2tnQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Ethereum Stays Afloat as Crypto Market Sinks - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt’s been another uninspiring week for Bitcoin, with the top crypto asset chopping sideways to enter the weekend below $64,500, notching another 2.6% loss in the last seven days.\n\nIt's extra disappointing given how MicroStrategy bought another $786 million in BTC this week, which the company’s founder says it never plans to sell. Still, MicroStrategy’s demand was overpowered by an onslaught of sell pressure from other long-term Bitcoin whales, including the German government.\n\nCryptoQuant noted that the broader crypto market is starting to lose momentum due to a lack of new investor demand. It follows, thenn, that most momentum-based meme coins like PEPE, DOGE, SHIB, and WIF are all down 5%, 9%, 13%, and 25%, respectively, on the week.\n\nAD\n\nAD\n\nToncoin also lost some of its momentum from last week, dropping 10% after previously rising to all-time highs on hype from projects within its gaming ecosystem. It remains a top ten crypto by market cap, and is only $300 million away from overtaking Dogecoin.\n\nDefying the market’s momentum to some degree is Ethereum. Its trading at $3,492 as of writing, hovering within a percent of its price seven days ago as Ethereum spot ETFs inch closer to reality. Multiple asset managers have now unveiled the fee on their ETFs, and Bitwise even published a commercial advertising ETH to old-school TV audiences.\n\nSolana—Ethereum’s top smart contract competitor—was less fortunate, sliding another 6% this week to $134.92.\n\nOne of the network’s high-flying Trump-based memecoins, DJT, amassed a $110 million market cap this week, and made headlines on rumors that it may have been launched by Trump’s team itself. One of the ex-president’s legal consultants later confirmed that the coin wasn’t launched by Trump nor his offspring.\n\nEven crypto stocks couldn’t retain momentum this week. Coinbase (COIN) fell 8%, MicroStrategy (MSTR) fell 1.96%, and DeFi Technologies (DEFTF)—which soared after buying Bitcoin earlier this month—has cratered 29.9% this week after crypto reports spread doubt about the company online.\n\nAD\n\nAD\n\nAll the negative momentum from altcoins this month has many analysts saying the crypto bull market may already be over. Still, BitMEX co-founder Arthur Hayes doubled down on his bullish thesis this Thursday that now is the time to ape into shitcoins and “buy the fucking dip” – before global money printers go brr.\n\nPrices as of 3am ET. Edited by Ryan Ozawa."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPa085cXVBV0Vjb3JfNllmMzRWYUNUUE5FZXdheUZIaW9uMGhrdjFVNnNMenZrbFJEbkNwU0tiSkdVQmJicEl6cUxfRzR2UG1nUmkxSDAtM0hDSkVhb0hJdllZa1hIZXpQNVdXcWVKZnVnZDVDZTJOai0xSHlvOWZfSTF30gGHAUFVX3lxTE5VZVoyMkl1S01qVkhncXp6aW80MlZGSXZrNklQY2ppRm03RTJYb0JvUFNKa2NkaHlNREs1TUMxczhwWjJFcW9qUTV3Y3A0WnFJZXVObE50dWtEUUJhOVZsbzRKeGFJN2I5MDRhTFlVS0NyZFlKaHlDUkFucy00SXpzTWo0OEZEOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) vs. Ethereum (ETH): Which Will Win Q3 2024? - CryptoPotato",
        "content": "The world’s number one and two leading cryptocurrencies by market capitalization, daily transaction volume, and crypto exchange volume have almost perfectly tied for ROI from Jan. 1 through the middle of June.\n\nFor comparison, the S&P 500 Index notched up nearly 15% over that same period. But that’s more than the broad stock market benchmark usually makes in an entire year.\n\nSo even during an unusually good two quarters for U.S. stocks, Bitcoin and Ethereum delivered investors four times more ROI. In other words, Bitcoin broke the government’s investment planning tool. Again.\n\nThe average annualized ROI for Bitcoin and Ethereum price performance since Jan. 1 is aces. The top two cryptocurrencies are pacing for a +116% year.\n\nThat’s a return so high that the compound interest calculator tool on Investor.gov does not even allow users to enter interest rates above 100%.\n\nBy the way— if you enter $100 a month into the calculator for 15 years at an estimated interest rate of 15% (above average for the S&P 500), with a daily compounding frequency, you end up with $68,815 in 15 years for capitalizing your country’s economy with a total of $18,100 in contributions.\n\nIf you do the same exercise with Bitcoin or Ethereum profits, and just enter 99% for the interest rate – the result is a little different (more like a bajillion dollars).\n\nQuestion is which cryptocurrency will outdo the other in Q3, or will Bitcoin and Ethereum come remarkably close again to earning the same amount of profit for crypto investors in the next half of the year?\n\nHere are six salient factors that may be worth considering. Some are more bullish for BTC, some for ETH, and some are a wash between the two blockchain network giants.\n\n1. Fed Dollar Inflation (Advantage Bitcoin)\n\nThe center of gravity for the entire global financial system is the U.S. federal funds rate. It represents the cost for Federal Reserve banks to borrow cash from the ultimate lender in the economy.\n\nThe Fed interest rate calibrates the dollar interest rates for loan products all the way down the food chain to store credit cards and pay day lenders. When it goes up or down, so does the rest of the financial economy with it.\n\nBut when it goes up that’s a big headwind that puts downward pressure on prices for stocks and cryptocurrencies. However, when it goes down, there’s a big tailwind for investment products that tends to put upward pressure on their market prices.\n\nIt looks like there will be one interest rate cut for the U.S. dollar later this year. “If all of it happens to be as forecasted, I think one rate cut would be appropriate by year’s end,” said Philadelphia Fed President Patrick Harker on Monday. After the Fed left rates unchanged last Wednesday for the seventh FOMC meeting in a row, Investopedia reported:\n\n“A bevy of tamer-than-expected inflation numbers over the past week has supercharged expectations that a Federal Reserve rate cut is ahead, but Fed officials themselves are proceeding with caution.” “What we’ve been getting is good progress on inflation, with growth at a good level and with a strong labor market,” said Fed Chair Jerome Powell. “Ultimately, we think rates will have to come down to continue to support that. But so far, they haven’t had to.”\n\nMeanwhile, other central bank economies, like those in the United Kingdom and South Korea, are getting antsy to cut rates.\n\nNot if, but when the Fed eventually begins to trim rates back down again, it will be a tailwind for crypto, but especially for Bitcoin – because of its deflationary tokenomics, with a hard supply cap of only 21 million BTC tokens to ever be issued by the blockchain network.\n\n2. DeFi and DApps (Advantage Ethereum)\n\nBitcoin is like digital gold, but Ethereum is like the automotive economy that burgeoned in the 20th Century as a result of the Industrial Revolution. Bitcoin is scarcity in the digital world of cyber abundance.\n\nIt turns out that a world without scarcity is missing something useful. Meanwhile, Ethereum is a vehicle to bring different parts of the economy closer together so they can engage in smart financial markets.\n\nMetaMask, Oasis App, MakerDAO, and Uniswap usage statistics continue to wow in 2024. In February, MetaMask announced a 55% surge in users from 19 million to 30 million in a matter of four months.\n\nThe numbers are almost as high as the 2022 peak for MetaMask installations now. The company behind the Ethereum wallet says those 30 million users manage 100 million accounts with MetaMask.\n\nOasis App is a decentralized app (dApp) built on Ethereum. According to data hosted by BitDegree the app’s balance was worth some $1,769,996,160 in market value Thursday and the dApp had executed 308,620 transactions in the last 30 days (a 100% increase over the prior month).\n\nEthereum MakerDAO is one of those beefy, serious DeFi dApps making the Ethereum vision happen. The decentralized app’s native cryptocurrency, the stablecoin DAI, is a small economy unto itself, with a market capitalization this week exceeding $5.4 billion.\n\nMeanwhile, Uniswap continues to impress. The leading decentralized exchange (DEX) for cryptocurrencies absolutely dominates other DEXs, ranking in fees almost as high as $100 million in total over the previous 30-day period.\n\nThe only Web3 apps to generate more fee revenue in the past month were: Bitcoin, Ethereum, Tron, and Lido.\n\n3. Institutional Adoption (Advantage Bitcoin)\n\nBlackRock CEO Larry Fink noted in March how the Bitcoin exchange traded fund was the fastest growing ETF in history.\n\nBlackRock CEO Larry Fink says the $IBIT Spot #Bitcoin #ETF is the fastest growing ETF in history\n\npic.twitter.com/NOsDlFgROi — Simon Dixon (@SimonDixonTwitt) March 27, 2024\n\nAgainst every other cryptocurrency, Bitcoin and Ethereum both have an advantage in regard to regulatory approval. But against each other, Bitcoin still has a clear advantage going into Q3 2024. Hundreds of millions of dollars flow into and out of the Washington-regulated Bitcoin ETFs daily.\n\nFormer U.S. President Donald Trump now has the confidence to promote cryptocurrency to voters on the campaign trail. Before the last presidential election in 2020, Trump said he was anti-Bitcoin and crypto.\n\nThat is a strong signal of institutional and mainstream crypto adoption for Bitcoin and Ethereum. Trump recently said he wants all Bitcoin to be mined in the United States and he thinks it can help win the AI arms race.\n\nMeanwhile, VanEck announced Thursday that it will be launching the first Bitcoin exchange-traded fund in Australia.\n\n4. Prague Electra (Pectra) Update: (Advantage Ethereum)\n\nThe Dencun Update – the most recent major upgrade to Ethereum – was a massive boon to Ether’s market value on crypto exchanges. Ether price went parabolic buying the news from Jan. 24 until the upgrade happened on Mar. 13.\n\nEthereum devs plan to ship the Pectra upgrade by early 2025, maybe in Q4 2024, so this will be a bullish tailwind supporting ETH price in the background for the medium term.\n\nPectra is short for the Prague-Electra update.\n\nThe Wall Street stock analysts over at TipRanks recently praised the Pectra upgrade in an article featured on Nasdaq for the update’s enhanced rollups and new staking limit for ETH validators: 2,048 ETH.\n\n5. Meme Coins (Advantage Ethereum)\n\nEthereum is still dominating meme coins, but the emergence of fungible token issuance on Bitcoin through the UTXO function using a technique branded Runes and some big hits in Q2 – like Dog Go To The Moon (Runes) – shows Bitcoin is a relevant player in this niche as well.\n\nThrough the Bitcoin Ordinals technique, BTC-minted NFTs remain popular and transacted in volumes of five and ten million dollars daily in June, according to Dune Analytics data.\n\nThe Ethereum meme coin economy, however, is a multi-billion dollar concern that continues to drive capital inflows to Web3 like the world’s gone mad.\n\n6. Competitive Analysis (Advantage Bitcoin)\n\nThe competitive landscape is an important factor in the horse race between BTC and ETH. These are far from the only two cryptocurrencies in the world in 2024.\n\nEthereum grows faster because of motivation from its competition, but it has far more competitors than Bitcoin. Market share in a competitive landscape is a real issue for this currency. It’s not just a technology, toy, or platform; it’s a business.\n\nWhile BNB, Solana, Cardano, Avalanche, Aptos, and a hundred others compete with Ethereum for DeFi market share, there is only one Bitcoin with only 21 million BTC. The Web 2.0 dons, Messrs Jack Dorsey and Mark Zuckerberg, both know the Web3 competition for those oranges is about to get fierce."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNV2VTRlZLaEJlOTliMjVpa2tUWDBNbmpUbE1CX0NlLVZRdU5xdTRUMjBqczM4OHUxaVNSNXVaYzN4TW5ncG0tUzFSUHVWWXZyRTZXT2hucGxKRGNvSmNlb1I2b3NvOUhNVzRwQl80ZzJZMFk2NzRKQkVwNGNUaXNQR1N5LTNkSUk4X0xLMXZvSkNVM1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered to Launch Spot Bitcoin & Ethereum Trading Desk - Watcher Guru",
        "content": "UK-based multinational bank Standard Chartered is officially launching a Spot Bitcoin and Ethereum trading desk. Bloomberg reports that the $820 billion bank’s STAN will be used for buying and selling both BTC and ETH directly. The institution becomes one of the first global banks to offer a trading service for the two leading cryptocurrencies.\n\nThe report notes that that desk will begin trading rather soon, according to sources. Although other banks have offered crypto derivatives trading, the decision places Standard Chartered in a league of its own regarding activity in the digital asset space.\n\nJUST IN: $820 billion Standard Chartered Bank to establish a spot trading desk for buying and selling #Bitcoin and Ethereum. June 21, 2024\n\nAlso Read: Bitcoin To Hit $100K Before US Elections: Standard Chartered\n\nStandard Chartered Announces BTC and ETH Trading Desk\n\nSource: Blockchain Reporter\n\nIn 2024, the United States approved two crypto-based ETFs, in what is a revolutionary move for the asset class. The decision heavily impacted Bitcoin, with the leading cryptocurrency reaching a landmark price of $73,000 in March of this year.\n\nNow, global institution Standard Chartered Bank is set to launch a Spot Bitcoin and Ethereum trading desk. In an emailed statement, the company noted its work to help support the growing demand that the firm has seen from clients.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum,” Standard Chartered said. The decision isn’t their first foray into the sector. They have backed crypto custodians Zodia Cusotry and its exchange, Zodia Markets.\n\nSource: CNBC\n\nAlso Read: Standard Chartered: Solana & XRP ETFs Could Launch in 2025\n\nThe bank has also launched a tokenization platform, Libeara in November of this year. The project tokenized government bond funds that use the Singaporean dollar, and showcase another venture into the Web3 sector for the bank.\n\nThe decision is a byproduct of the aforementioned demand from institutional clients. Although no launch date is announced, sources say that the “crypto desk is close to starting operations.” Additionally, sources confirm It will run out of the firm’s London office."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNUGd4aVpFUXNyc0NQTzN1NFloWGZRRVBnVlFfNmtkQWVfWmVWR1l4NmpGak1xYVkySkhud3FSUGljT3lUYjRzOF92SlNnT0treUc3ZzE1cmNjbU9qWkR2S0lLSnRwMk9mSGM0OFdJb1J6dWxKN2F2Zkk1WnUwNldYZ0RPT091RDNBTng0elRKRUZZd0VuZUo5czFtTdIBoAFBVV95cUxOYzBaMkppV1czdTlyNzM4VkdYY0dib0ZRaDNQTVB0eTdkQ0RtMklod3pkR1Y0aGNTdHd6X1JSNW5hM3Jtb0tFeEhrcFp5Y0U2SlF4VW8yeVNORXNkZ0VCV1BfQS1ja0E4NzRVMHotT2hXdDVkQWJTNGtVUVhGdjhBT2ttYU5MdnRTQ2hrcXhvMy0tMElqS21DT082dEx3eGxW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "PEPE’s correlation with Ethereum might play out THIS way for the memecoin - AMBCrypto News",
        "content": "Data revealed that the memecoin’s strong ties to ETH could stall further growth\n\nHigh exchange outflows might help PEPE\n\nFrog-themed memecoin Pepe [PEPE] was one of the few top-50 cryptocurrencies to register gains in the last 24 hours. At press time, PEPE was trading at a value of $0.000011, following a 3.35% hike its its value on 21 June.\n\nHowever, AMBCrypto found that the uptrend might not last. One reason for the same may be the memecoin’s correlation with Ethereum [ETH]. According to IntoTheBlock, PEPE’s correlation with ETH was. 0.91 at press time.\n\nETH has strong links with PEPE\n\nThe aforementioned figure was far above the correlation it shares with Bitcoin [BTC], which stood at 0.60. Values of the correlation ranges from -1. to +1. When the reading is close to -1, it means that prices hardly move in the same direction.\n\nHowever, if the reading is close to +1, it means that prices head in the same direction most times. And that was the case with ETH and PEPE.\n\nBut unlike PEPE, ETH did not appreciate on the charts. Instead, it moved sideways, trading at $3,502 at press time.\n\nShould the price of the altcoin continue to consolidate or encounter a decline, PEPE’s price could retrace too. Beyond that, only a few memecoins also jumped, meaning a lot of capital was not flowing into the category to kickstart a rally.\n\nOn the contrary, exchange flows seemed to suggest that ETH might not be able to halt the uptrend. At press time, PEPE’s exchange inflows were 845,000.\n\nMemecoin is in a tight spot\n\nInflows measure the number of tokens being sent into exchanges. When this number is high, it means that selling pressure could be intense, and could probably lead to a price decline.\n\nOn the other hand, Santiment data revealed that the exchange outflows were much higher at 131.07 million. The rise in the outflows means that those accumulating the token are refraining from keeping them on exchanges.\n\nInstead, participants are keeping them in non-custodial wallets. Should this activity continue, PEPE might overlook its strong ties with ETH, and the price could appreciate on the charts.\n\nIf this is the case, the value of the token could hit $0.000013 in the short term. However, traders might not need to be cautious.\n\nThis, because of the holdings distribution data. Consider this – Addresses by holdings revealed the 30-day change of the number of participants buying more of a token at a certain threshold.\n\nIn most cases, the retail cohort rarely impact prices like large investors. At press time, the number of addresses holding $1,000 to $10 million worth of the token had fallen.\n\nConsidering the most recent sell-offs across the market, PEPE might now struggle to keep up with its former bullish momentum.\n\nRealistic or not, here’s PEPE’s market cap in ETH terms\n\nIf this happens, the prediction to $0.000013 mentioned above could be invalidated. Therefore, PEPE’s price could move at the same pace as ETH, and its price might remain around the $0.000011 zone."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tSUQ0cEUxY0ZkZy1IY2dOb3kzUU9zYkVXSWFkRXNmd3JrMV84VHp4WTcwakt4RWFKYXo3cnduLUFYYncwMGN0Y0k2Y1dnNWZaeWhOSXM4Y3lKaGhhV0dFV0ItRl9qX1JZRTNrVklRVVRpc29CVm15UFpSbDFSWnfSAYcBQVVfeXFMUEFpWnNSTHc1S3BHRGNpY0NfSVNiMmVtWTBrWHlpOEY0dFZNUTlmUEs2OG5lblh4RjMyYUd0YVVGUVNtRDV0aDFaQzVTT1MxR29XOUlWeWg0dnozbnNQWnczNjVsYlBOb29ZbWl3bnF6U0RQbGhNeWMzZ25mdXJDODlvMHFsUURZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered Is Creating a Bitcoin and Ethereum Trading Desk in London - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational bank Standard Chartered is creating a Bitcoin and Ethereum trading desk in London, according to a report from Bloomberg.\n\nThis will make it one of the first global banks to enter spot crypto trading, in the wake of spot Bitcoin and Ethereum ETFs being approved in the U.S.. Standard Chartered’s new crypto desk will begin trading soon, two people told the outlet, and will be part of the Forex trading unit.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” Standard Chartered told Decrypt, echoing the statement it made to Bloomberg.\n\nBut Standard Chartered declined to respond to Decrypt’s request for further comment.\n\nAD\n\nAD\n\nThe bank part-owns institutional crypto custodian Zodia Custody and has backed institutional digital asset trading firm Zodia Markets. Now setting up its own spot crypto trading desk shows clear intention to move deeper into the world of digital assets, after dipping its toes through investment.\n\nOther banks have traded crypto before, but due to regulation they have had to trade in derivatives rather than the actual asset itself. For example, Goldman Sachs began trading Bitcoin futures in 2020, then opened its Bitcoin derivative trading desk in 2021.\n\nThe Basel Committee, an organization that sets global standards for banks, recommended in a 2022 report that banks should apply a 1,250% risk weighting when trading crypto assets. This term refers to the amount of capital a bank should have in reserve to counter the risk of the investment. Industry experts have noted that this incredibly high weighting makes it hard for banks to turn a profit on crypto trading.\n\nStandard Chartered has been bullish on crypto recently. In May, it predicted Bitcoin and Ethereum to hit all-time highs after spot Ethereum ETFs were approved in the U.S.. Soon, the bank predicted that Solana and XRP ETFs would be next to be approved in the States.\n\nAD\n\nAD\n\n“Albeit this is likely a 2025 story not a 2024 one,” Geoffrey Kendrick, Standard Chartered’s head of crypto research and emerging market foreign currencies, said.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOQkFqb1JWZmF3Z1NPdWNTLURrbUFJeFFJTE1kQ2NmdUtmM2ZjTGY1Uk5jNnpPR1lQUDBTdHJacThtN25nQmN4TVR5RFl2ZHRzeFNkQWgxc0J2VUE4eTg0TGJQYVpBMlFwTTdZeHZFUzVlQmsxNEc5WWNtUlpyU3B5N1ZOUV9hcGUxcmNJdmd2XzgxNkxCWUkzMkNhS3VEaTNic3VLendJY3Jxd9IBrwFBVV95cUxNYm1ROURGT2xsV2dpTU15VS1oM0NoV29mWHVxTWFzdUR3S2lIQ3A0WXpndVRad1BoMjVFaFBnMXduNnVtVHJHSmhnUHc1RVU1VlQtakpwLXRORkRQamVqdzgtSzl3YjMzaDY1YVFTU0RUc29DNUFPWGFrSmVfaFpOWHZvbWNyNWtidC1QcTlvc1Z2R0RFZWFtTFJLWVdiRC0ybFBNMTlWSTg4dHRsRjNv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "S&P Global: Ethereum Restaking Can Give Birth to ‘Internet Bond’ Market, Will SEC Approve? - CoinGape",
        "content": "S&P Global Ratings recently published a report stating that the Ethereum restaking services offering an additional yield are gaining prominence and could lead to a solid “internet bond” market in the long term.\n\nSimilar to the bond market, holders of Ethereum earn additional yield by either pledging or staking their ETH coins to help with transaction verification on the Ethereum blockchain. Similar to lending out securities in fixed-income markets, ETH restaking reinvest the staking rewards and provide compounding returns to investors. Ethereum restaking platforms like EigenLayer have been much in the limelight recently. Amid this popularity, EigenLayer went live on the crypto exchange Coinbase recently.\n\nadvertisement\n\nThe Rise of Ethereum Restaking\n\nIn a report published on Wednesday, Andrew O’Neill, S&P Global’s digital assets analytical lead, highlighted the importance of restaking in order to enhance economic growth within the crypto market.\n\nO’Neill also stated that restaking allows Ethereum node operators to validate new services by using established tokens thereby eliminating the need for these services to create their own validator with their own, illiquid, and volatile tokens.\n\nAs of now, there are only a few active restaking services popular as “actively validated services”. The report by S&P Global also notes that the total value of ETH restaked in the EigenLayer has surpassed 5.3 million Ether, valued at a staggering $19 million. Earlier this week, EigenLayer opened the Phase 2 claims for the EIGEN airdrop.\n\nRisks Associated with Restaking\n\nThe risks associated with restaking are primarily operational and specific to each actively validated service (AVS), though financial risks could emerge due to market speculation.\n\n“We do not currently foresee significant ecosystem-level financial risk as staking and restaking are generally non-custodial and there is no rehypothecation of the collateral,” O’Neill writes. “The impact of restaking on system-level leverage must be monitored, particularly through borrowing and leverage metrics on decentralized finance (DeFi) lending protocols”.\n\nEver since the EigenLayer launch in April, the protocol has gained strong traction within no time. This could inspire more players in the market to bring restaking services.\n\nHowever, the bigger question is whether the US SEc would allow more restaking protocols in the market. Another doubt is whether the SEC will allow restaking protocols to mature into “internet bond” market without proper regulations.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNaXBQLXlNbVE2anRaejVlS3VPMEZha2ZTQ0pIY0V0RFhSWlpBM0tsdkVfbGp0V25EQ2VJQ1VmZndxN0xYN09vNzUycmtiVEZDWmhKcUlCZVFrcjV6RmF0RERDQ2tNenpNdWt3QW5lS1NLUHZobXZqWG5Jc0dCZFFYaVlMYXlQSFh4THowYWZKMk8wRnfSAZgBQVVfeXFMTmRCZUd4V3A2NUZ6ZzQ1QkhxN2NQT3o2RFRWMktWOUlOWUtBVGk0RndRdTZOc1NzZFRKN3ZjUnYtTFg3eXRCbGd2akk0RndseG5SRXRScW11eHdWcm5uZmZaUnVsN3F5eDU1ektqYnBfU0ZKNDVxM2piVGZNVFRYVThLZ2lYNnhEOUIwVzVCUWsxeV8xZ2E4emo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s 2024 – Here’s what you should expect from its price - AMBCrypto News",
        "content": "Ethereum Classic (ETC) flashed a general downtrend with decreasing price highs and lows, coupled with diminishing trading volumes\n\nA bearish ‘death cross’ suggested a potential long-term downtrend\n\nEthereum Classic (ETC) has been a staple in the cryptocurrency market, but never expected to go 100x. Still, 2024 is widely anticipated to be a very bullish year for the market, even more so than it has already been. However, things have slowed down recently, and markets have tumbled.\n\nSo, what about ETC? What’s its fate for the rest of the year?\n\nSince late May and into June, the trend has appeared generally bearish as ETC’s price made lower highs and lower lows – A classic indication of a downtrend. This recent decline in price can be coupled with diminishing trading volume – A sign of a reduction in investor interest and market fatigue.\n\nTypically, low volume during a downtrend might suggest a lack of conviction in the sell-offs, but it could also mean that fewer buyers are present to push the price back up.\n\nA hike of +5.56% means heightened trading activity in ETC derivatives, which can be speculative buying or selling. In fact, the notable spike seemed to align with a peak in ETC’s price line, possibly pointing to a speculative rush that was not sustained and led to price retraction.\n\nDeath Cross signals prolonged downtrend\n\nThe 50-day moving average recently crossed below the 200-day moving average, indicating a bearish ‘death cross.’ This pattern typically is a sign of a long-term downtrend.\n\nThe price peaked at around $35 in March, followed by a sharp decline. After that, it consolidated around the $30-mark before breaking below the 200-day moving average.\n\nPrevious support levels can be observed around the $25-level, which have now been breached and may act as resistances if a price recovery attempt occurs. The next key support is likely around the $20-level, which could be tested if the prevailing bearish trend continues.\n\nIn conclusion, the hike in selling volume plus the breach of prior support levels tells us that the bears are here to stay."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcGtGaFl4amUzclpoV0QzSGFOeF9vSWxBVzRJZ2xveFdvbnozQ1l0R1dWSGNGWG9Zc1VlY0M5MV9VWUNMczRLcXlDcERNSnJiSVBKbHk0WGR2MDk5VTlJeDZUbTMtTHhwTnNNWFQyb0NTQ3ZBZzJTbDFubndPWlZXUkVNQ0lYNEduN1h0MklqUXk5cmcydHpFMUt6c1NnTUdVV2o3ZVdGM2N4d2ZXanlBU3ZYcmo3RVQ2cnNWVmFhUDFQOXJYSjViZlJn0gHPAUFVX3lxTE5LSE9LWFR5cktWTzkzaHZfeV9zMlEzLVJtMUR1QS16SDFtbGFqaUQyZGZfc1BEY2ItMlZQSmJPVXF0TzAtYXV0MGxMYzV2a0JOMW51YVlLR2Z1NG1VZU9pNEp3aTBEdzhuRXVCcTRkaEhEa3FPblF5NEQtVS1NNV9ROTVjWmZGbEN1bEhWcUh6akJ3ZWdfTDQ1TjNSdjJjeTc0Vm95aWxENkJmbER0ZWZMZ1ZEd1Q0RDV3c0JROFBUVGVLX3B3MDR2Tm9VbXkycw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Banking Giant Standard Chartered To Launch London-Based Bitcoin and Ethereum Trading Desk: Report - The Daily Hodl",
        "content": "British banking titan Standard Chartered is reportedly going to roll out a Bitcoin (BTC) and Ethereum (ETH) trading desk based in London.\n\nAccording to a new report by Bloomberg, anonymous sources familiar with the matter say that the financial services giant is venturing into the world of spot market crypto trading.\n\nThe sources say that the new desk is close to launching, though no specific date was mentioned, and that it will be part of the bank’s foreign exchange trading service.\n\nAs stated by Standard Chartered to Bloomberg in an email,\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability.”\n\nLast year, Standard Chartered launched Libeara, a blockchain platform that aims to assist firms with real-world asset tokenization.\n\nEarlier this year, analysts at Standard Chartered raised their price prediction for the top crypto asset by market cap in 2025 by 50% due to the success of spot market Bitcoin exchange-traded funds (ETFs), which were greenlit by regulators in January.\n\nAt the time, analyst Geoff Kendrick said in a note to investors that the bank is raising its 2025 price target for the crypto king from $100,000 to $150,000.\n\nBitcoin is trading for $64,132 at time of writing, a 1.55% decrease during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQdmxLZWJpVVhNeFFuLTZHSG5oSnQ0a2ZoMGdqNnNrbTc5SXdpb3lvVnBObjZzcXdYaVlYenBSZjk5T096bkdGcnFNMmxOcmVITkc4RzBza0lCejNmTTZnWDQ3OFVxTVpNLWlIaWwxMEFIQ2J1ajh3azJ6MjVhN2ZXZC1Ia1NvbWFtRWNDVk5VYXNDYlZGMUZZaVhMMnVRRFXSAaQBQVVfeXFMT0ZwZERqcDRmUWxBQUxOdUNrcUdqZXBycXptcFU5bmJNWWNtWmVQemgtdDlNaGNBSDB6THFRNkRqdFcxb3BnOGVka2FFWGplV0MyYWVieTVXV2VmcUNtaEFISjdpYjA1TFpBbVdaWGtYaEZHS2NpRjU3QjRfREV5R3JGZHl5ejZjYmdwVHBQNWFOMU85bW50SllFTnJ2YVRwV2laUDQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "YieldMax Applies For Ether Options ETF Amid Spot Ethereum ETF S-1 Amendments - CoinGape",
        "content": "YieldMax, a popular ETF issuer, has recently submitted a filing with the US Securities and Exchange Commission (SEC) to introduce an Ether Option Income Strategy ETF. The ETF will be listed on the New York Stock Exchange (NYSE) Arca, as detailed in a June 21, 2024 filing. Moreover, this strategic move comes just before the potential launch of Spot Ethereum ETFs in the United States.\n\nYieldMax’s Ether Option Income Strategy ETF\n\nThe proposed ETF from YieldMax will employ a synthetic covered call strategy. It will be designed to leverage the volatility of underlying Spot Ethereum ETFs for generating profits for investors. Moreover, by selling call options, holders of Spot Ethereum ETFs can earn additional income and manage their risk exposure effectively.\n\nadvertisement\n\nMeanwhile, it’s important to note that the fund will not consider direct investments in Ethereum or any upcoming Spot Ethereum ETF. Instead, Tidal Investments will be actively managing the Ether Option ETF, with ZEGA Financial providing sub-advisory services. For context, ZEGA Financial is an investment advisor registered with the U.S. SEC and specializes in derivatives-based trading.\n\nFurthermore, this new filing follows the previous launch of YieldMax’s Bitcoin Option Yield Strategy ETF (YBIT) last year. The YBIT ETF is also listed on NYSE Arca and carries an expense ratio of 0.99%. Meanwhile, there is significant activity around Spot Ethereum ETFs.\n\nAccording to latest filings, all eight applicants recently submitted S-1 amendments to the SEC. Moreover, these amendments provide more details on fees and seed investments. The applicants include prominent names such as BlackRock, 21Shares, Fidelity, Grayscale, Franklin Templeton, VanEck, Bitwise, and Invesco.\n\nAlso Read: Breaking: Fidelity Files Updated Spot Ethereum ETF S-1\n\nApplicants Submit Amended S-1 Filings For Spot Ethereum ETFs\n\nBlackRock, VanEck, Invesco Galaxy, Franklin Templeton, Grayscale, and 21Shares submitted a new round of amended S-1 filings to the SEC on Friday. Earlier, Bitwise and Fidelity had also submitted their amendments. As of now, only Franklin Templeton and VanEck have disclosed their fees, which are set at 0.19% and 0.20%, respectively.\n\nFurthermore, Eric Balchunas, a senior ETF analyst at Bloomberg, commented on the competitive fee pricing. In a post on X, he stated, “VanEck’s fee of 0.20% is quite low, putting pressure on BlackRock to keep their fee under 30bps.”\n\nThe SEC has already approved the 19b-4 forms for these ETFs last month. However, the registration statements need to be finalized before trading can commence. Whilst, some firms have also disclosed the seed capital invested in these ETFs. This highlights their commitment to the funds and providing the initial capital necessary for trading.\n\n21Shares US LLC, the sponsor of the 21Shares Core Ethereum Trust ETF, has made a seed investment of $340,739 by acquiring 20,000 shares. Moreover, Franklin Templeton and Invesco Ltd. have each disclosed initial capital investments of $100,000 for their respective Ethereum ETFs. Meanwhile, BlackRock, demonstrating significant commitment, disclosed a substantial seeding payment of $10 million.\n\nThe market is now keenly awaiting the SEC’s final decision, with the launch date rumored to be July 2. The SEC’s rigorous review process ensures that all disclosure and regulatory procedures are thoroughly completed before ETFs can begin trading. Hence, the S-1 amendments suggest continuous discussions between the SEC and applicants.\n\nAlso Read: Breaking: Standard Chartered Becomes First Bank to Launch Spot Bitcoin, Ethereum Trading\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxONkN2bjhoREJmQWR6ZDFpck1VUnhNYlhFWG5qXzduX0ViS1NIMlJVdnMtTE56NlBoRU1hWUR4cGFJZHBfenhzMHVBMlc0c1ZDRGNUQjJRRHBTSDJ2UDF0RlY3aG9DbW9WVzFXYm1uVUk1YTBFa2pQb2FpOUJxZjZlV0ZUY3hoR1haQWJaRFlmM3FUTzRJaFNCNElSMkF1OGRiZjFEeFphem1VNm1FS3VN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered to Launch Spot Trading Desk for Bitcoin and Ethereum - The Crypto Basic",
        "content": "Standard Chartered, a British multinational bank, is reportedly planning to launch a spot trading desk for two of the world’s largest cryptocurrencies- Bitcoin (BTC) and Ethereum (ETH).\n\nBloomberg, citing sources familiar with the matter, reported today that the upcoming spot trading desk is close to starting operations under the bank’s FX trading unit in London. Consequently, the move would make Standard Chartered one of the first global banks to venture into spot crypto trading.\n\nAccording to the report, the spot trading desk will cater to institutional investors seeking direct exposure to BTC and ETH.\n\n- Advertisement -\n\nCollaboration with Regulators\n\nIt bears mentioning that several multinational banks, like Goldman Sachs, have been offering crypto derivatives trading for institutional clients. However, stiff regulations have prevented these banks from dealing directly with the underlying assets.\n\nIn particular, the Basel Committee’s proposal on Banking Supervision requires banks to apply a high-risk weighting of 1,250% to unhedged crypto exposure. This requirement makes it challenging for banks to make profits via spot trading.\n\nNonetheless, the sources suggest Standard Chartered is determined to launch its spot trading desk for BTC and ETH.\n\nIn an email statement sent to Bloomberg, Standard Chartered disclosed it is collaborating with the relevant regulators to meet its institutional clients’ crypto trading demands.\n\nAccording to Standard Chartered, the upcoming trading desk aligns with its broader strategy across digital assets, encompassing access, custody, tokenization, and interoperability.\n\n- Advertisement -\n\nStandard Chartered Expands Involvement in Crypto\n\nAmid the growing interest in crypto among institutional investors, Standard Chartered has been expanding its presence in the crypto market. Previously, it invested in two crypto companies: Zodia Markets and Zodia Custody.\n\nLast year, it established Libeara, a blockchain unit focused on helping institutions tokenize traditional assets. The Singaporean government is leveraging the unit to develop a tokenized bond denominated in Singaporean dollars.\n\nWith Standard Chartered planning to launch a spot trading desk for BTC and ETH, the bank would further expand its involvement in the crypto market.\n\nStandard Chartered’s latest foray into the spot trading sector comes amid massive volatility in the crypto market. At the current price of $63,571, BTC is down 8.8% in the monthly charts. Similarly, ETH, which is priced at $3,460 at press time, has plummeted by 6% in the same timeframe.\n\nMeanwhile, the bank forecasted that ETH could be priced at $8,000 if BTC eventually hits the projected target of $150,000 by 2024 ending."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPSXpYcDZSNnEyS3JreGtxUkx6RzhsaFBXY0w2a2RTc1ZHOGdkcERFUjJSY3VtZGc0aGFrQWp4dktrT2pSNFYzNkFCSjI5blJtY0lwWjdsMWQ2a3pPcUF0NW95c0U0ZnFfVzRTZzQzbTFHSmE3WVJaMDg3aVg1UjgwR3ZYOW9CZ9IBiwFBVV95cUxNZGZrcFptdHM1ZFdsMHJjbkEwVk4xRVFmdC1sV3RrRk5DdWRWd3R0dUx2TWoxSm5ycTFKM2ozbFFvWmZUVVc4WERMUUk0c2s5TFlZUEtpZ3hOZUYxTjljR2dLTlFCTzMteFY5OEhJczNZbkV5elotbmJUUUZXWUM3YXE4YzFIUFFuVGYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Top 5 Reasons Why Ethereum Price Is Poised For A Reversal - CoinGape",
        "content": "The Ethereum (ETH) price has recently shown remarkable resilience amidst a broader market downturn. Currently, the ETH price is sustaining above $3,400. Moreover, several factors indicate that a price reversal might be on the horizon for ETH. Here are the top five reasons why Ethereum is poised for a comeback.\n\n1. Surge In Ethereum Active Addresses\n\nEthereum has seen a significant increase in active addresses, reaching a three-month high of 617,170. This spike in activity is a positive indicator of growing user engagement and network utilization. Increased active addresses often correlate with higher transaction volumes and stronger market sentiment. As more users interact with the network, it could drive demand for Ethereum, potentially boosting its price.\n\nadvertisement\n\n2. ETH/BTC Ratio Remains Strong\n\nThe ETH/BTC trading pair has remained above the crucial 0.05 BTC level. Michaël van de Poppe, a well-known market analyst, emphasized the importance of this threshold. “As long as $ETH stays above 0.05 BTC, everything is fine, and a reversal in the trend is on the horizon,” he noted. Hence, maintaining this level indicates relative strength against Bitcoin, suggesting investor confidence in Ethereum’s performance.\n\nAlso Read: YieldMax Applies For Ether Options ETF Amid Spot Ethereum ETF S-1 Amendments\n\n3. Spot Ethereum ETF S-1 Amendments\n\nThe filing of S-1 amendments by prominent financial firms for Spot Ethereum ETFs is another significant development. Companies like BlackRock, Fidelity, Grayscale, and VanEck have submitted detailed amendments to the SEC, indicating their commitment to launching these funds.\n\nThe approval of these ETFs could attract substantial institutional investment into Ethereum. Moreover, Bloomberg analyst Eric Balchunas underscored the competitive pricing, which could drive further optimism in the market. He stated, “VanEck’s fee of 0.20% is quite low, putting pressure on BlackRock to keep their fee under 30bps.”\n\nMoreover, the anticipation of ETF approval is creating a positive buzz around Ethereum. The latest S-1 amendments signal a positive shift as applicants are expected to be engaged in regular discussions with the U.S. SEC. This could lead to an imminent approval of these ETFs, which could bring significant capital influx into the market.\n\n4. Introduction of Ether Option ETF\n\nYieldMax has recently filed for an Ether Option Income Strategy ETF. This proposed ETF will employ a synthetic covered call strategy to generate income by capitalizing on the volatility of underlying Spot Ethereum ETFs. Furthermore, the Ether Option ETF aims to provide additional income via selling of call options.\n\nWhile it will not directly invest in Ethereum, it signifies a growing interest in derivative products linked to ETH. Such innovative financial instruments can attract more investors and provide new avenues for trading and income generation.\n\n5. Growing Institutional Adoption\n\nStandard Chartered, an international banking giant, recently announced plans to open a trading desk for spot Bitcoin (BTC) and Ethereum. This move marks the bank as the first to enter spot crypto trading. Standard Chartered’s new crypto-focused operations will be part of its FX trading unit and run from London.\n\nThe bank’s involvement is a testament to the increasing institutional adoption of cryptocurrencies. Binance CEO Richard Teng welcomed the move, noting that it “indicates the mainstream adoption of crypto is picking pace.” Institutional participation can significantly impact market liquidity and investor confidence, potentially driving up the Ethereum price.\n\nAlso Read: Breaking: Fidelity Files Updated Spot Ethereum ETF S-1\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPOTRuTXMyanR0N2ttT2tCMHBBbmlEWDBvZFQyQUx5N1g1QWY3NURsQlpaR2RSSU1kVWpRYjVkRWhtNF9YOTRLelVDeElUbi12UDYzLU1kbHNjcWgxcFRJdjFNV2pxSFYyVmo0cURyMkFMQ1hOQUJuV0lnajVmSzR0NE4wN2xMSlF6X3hhM2FnVU7SAZgBQVVfeXFMT0phVk1YTzZRWWpLNEVWTFFHYUVrdXJ0VlZzbzlHZXFtUTdsbG9hdUk5VUhvSV9CRml3SFdfSlU0WnZfY0JBOVh6M0RUY1pxUHl4RkN2SlFBeWNqTFQ2N2VTSnpzc3RjU0RLUkVNS1JmamY3T3ZYOXVVejN3aEo0dlcwWjNqUFA2cmExdU03cmRxUkpCYWlXT1o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Consensys Predicts Ethereum ETF Approval Within Days - Crypto News Flash",
        "content": "Blockchain startup Consensys has predicted that spot Ethereum ETF S-1 registrations will soon be approved.\n\nAnalysts are projecting a an early July approval timeline for trading to commence.\n\nBlockchain software technology company, Consensys has predicted that the SEC could approve S-1 filings for spot Ethereum Exchange Traded Funds (ETFs) in a matter of days. Collin Brown, a renowned blockchain researcher commented that the prediction portends a bullish signal for Ethereum, the second-largest cryptocurrency.\n\n🚀 Ethereum ETF approval on the horizon! Consensys predicts SEC could give the green light within days. Bullish signal for $ETH! 🌐💼 #Ethereum #ETF Are your bags filled? 🚀🚀🚀 pic.twitter.com/aF91qMIXsv — Collin Brown (@CollinBrownXRP) June 21, 2024\n\nSentiments for Ethereum’s ETF Approval\n\nJimmy Ragosa, product manager at Consensys believes the wait for spot Ethereum ETFs trading in the U.S. might be nearing its end. Ragosa’s optimism stems from a recently amended S-1 document, submitted by Bitwise Asset Management to the Securities and Exchange Commission (SEC) on June 18.\n\nHe pointed out that compared to the previous version, Bitwise’s update omits details on the fee structure and initial investment. He added that the bulk of the SEC’s feedback centered around risk factors, legal and regulatory statements, contact information, and the distribution plan. Ragosa, therefore, projects an imminent approval from the SEC, based on the areas requiring revision.\n\nThis optimistic outlook aligns with recent comments from Bloomberg ETF analyst Eric Balchunas. He confirmed that the SEC’s feedback to prospective Ethereum ETF issuers earlier this month was “pretty light,” focusing on minor revisions.\n\nBalchunas even revised his initial prediction for the launch date, moving it up from July 4 to July 2 based on the expedited S-1 approval timeline. Last month, the SEC approved eight 19b-4 documents from exchanges requesting to list Ethereum ETFs, as previously reported by Crypto News Flash. With that hurdle cleared, the S-1 approval stands as the final regulatory step to Ethereum ETF trading in the US.\n\nMeanwhile, VanEck is another investment manager who believes approvals for spot Ethereum ETFs could happen in the coming weeks. As previously reported by Crypto News Flash, VanEck’s Matthew Sigel says the firm is accumulating Ethereum in anticipation of the launch.\n\nSEC Concludes Ethereum Sales on Consensys\n\nAdding to the positive sentiment surrounding Ethereum ETFs is the recent conclusion of the SEC’s investigation into Consensys’ ETH sales. The investigation, which focused on whether these sales constituted security offerings, cleared the way for Ethereum by not recommending any enforcement action.\n\nConsensys disclosed in an earlier report shared by Crypto News Flash that the victory follows a battle of regulatory challenges and a lawsuit filed by the firm. Notably, this development eliminates a potential hurdle for Ethereum ETF approval.\n\nDespite this victory, the SEC appears not to be giving up on its crypto enforcement actions. In response to Consensys victory, the SEC’s correspondence gave a disclaimer that the closure of the investigation should not be interpreted as an exoneration.\n\nETH, the native digital asset of Ethereum appears to be reacting negatively to these developments. At press time, ETH is trading at $3,481, demonstrating a 3% decrease over 24 hours. However, the trading volume increased by 11% to $15.9 billion, demonstrating renewed interest from investors."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPLUlWcjEtRlVnalJhOUZ4aUVYTk9OX2RCYzluRVhYOHpLcnR6c3loSTRCUnp3M1duVlJjcmxnSlRrT3o4azA5Mm5Rd19FRlVmQ2N1SWRmN2dtMkg1ODhRcVQyY1lhbVl6OXRycUMtcXhWSnYwQmx6eENZdnVSaHpBYXdSTEoxVlpRS2FzajdXQUFLaXFuQU9tTlhsVEFWVV9HUG1OUFRhU2w0QjRvMGhLSGRfU0hGSkdkSHNCNjYwSTg3NTN4bDl3NzNBV0dZaFBIdzJXTTlPT3NFd9IB3wFBVV95cUxONlRxVk1mTk91THJ2MDRpbDFSQUdxSld5ZFl0NGRnaFNicmRWSXNVMi1Sb21zMEpxMlZYSUtKbXNCT3RISmdlX1BGTHRqU3NDV1hEaXQtYXV4WEI3ampmU05KUG05YmE2RjFJbG1WN2pISFRQUlBuSWtJdXNRdllTZTZkMHlxU2tCN29LUDBjQ1gzT1gtaFo3TjM5dWJWblRZUEo3LWV2cTMtZFd5dEozTlBHVVFtRnhCVElVb0Vmam9ud1NYUVdBNGxRbWM3Z1l0OHpkMmdrSVdCcGxjS1BB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin retraces to crucial support - FXStreet",
        "content": "Bitcoin price faces rejection at the weekly resistance level of $67,147.\n\nEthereum price stabilizes near the $3,362 support level established on June 14.\n\nRipple price is encountering a barrier at $0.515, which aligns with its 50-day Exponential Moving Average (EMA).\n\nBitcoin (BTC) price encounters resistance at weekly highs before retracing to seek support at a crucial level, while Ethereum (ETH) and Ripple (XRP) align closely with Bitcoin's movements, gearing up to surpass resistance barriers and embark on upward rallies.\n\nBitcoin price encounters major resistance\n\nBitcoin price was rejected by the weekly resistance level of $67,147 on Monday and is currently trading inside a descending channel. The descending channel is drawn, joining multiple swing high points and swing low point levels between early June and mid-June, as shown in the one-day chart below.\n\nIf BTC continues to decline, it could find support at $62,451, the 61.8% Fibonacci retracement level drawn from a swing low of $56,523 on May 1 to a swing high of $71,994 on May 21.\n\nIf the $62,451 support holds and BTC breaks above the descending channel, it could rally 7.5% to reach its previous resistance level of $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective mean levels of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nThis development would provide additional momentum to the ongoing recovery rally.\n\nIf bullish sentiment prevails and the overall cryptocurrency market shows optimism, BTC may extend its rally by 6% from $67,147 to retest its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if Bitcoin price breaks and closes below its daily support level of $60,800, the bullish thesis could be invalidated, leading to a 4% crash, its weekly support level of $58,375.\n\nEthereum price outlook is optimistic\n\nEthereum price finds support around the June 14 low at $3,360. On Wednesday, the US Securities and Exchange Commission (SEC) granted it a free pass, currently trading at $3,523—the $3,360 low roughly hovers around the 61.8% Fibonacci retracement level at $3,279.\n\nIf this support holds, ETH price could rally 5% from its current trading price of $3,523 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) in the daily chart struggles to close above its mean level of 50, while the Awesome Oscillator (AO) trades below its mean zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nIf ETH closes above $3,717, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,292 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,864.\n\nRipple price shows promise\n\nRipple price faced resistance at $0.515, its 50-day Exponential Moving Average (EMA) on Monday, and is currently trading at $0.490.\n\nIf the ripple price breaks above the 50-day EMA at $0.512, it could rise 7% from $0.499 to $0.532, its previous high of June 5.\n\nThe Relative Strength Index (RSI) in the daily chart is below the 50 mean level, while the Awesome Oscillator (AO) is below its zero line. If bullish momentum persists, both momentum indicators must remain above their respective thresholds of 50 and zero. This would provide further support to the recovery rally.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT 1-day chart\n\nConversely, if Ripple's daily candlestick closes below $0.450, marking the June 7 low, establishing a lower low on the daily chart would invalidate the bullish outlook. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPLUlob0xlY2NBU3pFZjZDdkV0VVFUZ3NFaFBZM2lnc3MzZE16anRad1NPRDQ2TFpfVXhWTU5xN3VPRFlHLXNvd3JxTnhHZGhaeEZxVnQ3eFRvQXloQzNKclJ6bEpRZFVPUGpNV0lRODlRbGF5aWZuZ0tPU0pMRFRwUDlXQml3Q2R4WUNoZmpIRkF3RGg5d0FrNGdvT2XSAaIBQVVfeXFMTmtIOGo3SVB2UDdYRlJIMVN4YVFaUnkzaHJValI5OV9ta2MzQVY0X1BfSkluMDFVOGtxMC1FanAxU3dHQnU5V3h3X2hFQ1hVajQzUkwySTdhc1hOM2t3a2JWczI3SnJ0Z1hLV3hDMXE1cmhPMjBfVjVKSng3MFBYWEo1bkhWZUctRjFESWdGbjRCSDZ5MUhVbGxwR3JrallCSjRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Breaking: Standard Chartered Becomes First Bank to Launch Spot Bitcoin, Ethereum Trading - CoinGape",
        "content": "Global banking giant Standard Chartered deepens crypto push and announces plan to open trading desk for spot Bitcoin and Ethereum. As a result, it has become the first bank to enter spot crypto trading.\n\nRecently, Mastercard and Standard Chartered Bank Hong Kong successfully completed their first live experiment on the tokenization of deposits using the Mastercard Multi-Token Network (MTN). The company making a stronger push into different crypto-related fields.\n\nadvertisement\n\nStandard Chartered Enters Spot Crypto Trading Space\n\nIn a major crypto development, Standard Chartered on June 21 said it is close to starting a trading desk for Bitcoin and Ethereum. The new crypto-focused operations will be part of the bank’s FX trading unit. The trading desk will be available to run from London, reported Bloomberg.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” said Standard Chartered.\n\nThe move was welcomed by crypto industry leaders including Binance CEO Richard Ten as it indicates the mainstream adoption of crypto is picking pace. Standard Chartered through its owned companies Zodia Custody and Zodia Markets has offered crypto-tailored solutions including crypto custody and institutional crypto trading.\n\nZodia Custody has also announced expanding the list of supported digital assets for comprehensive custody solutions. It has added USDe to its custody platform today.\n\nAlso Read: Ripple Lawsuit Referred To Magistrate Judge For Settlement\n\nBitcoin and Ethereum To Rally?\n\nTraders reacted immediately to the news, bringing some upside momentum to both Bitcoin and Ethereum prices.\n\nBTC price rebounded 1% after the news but still down 2% in the past 24 hours, with the price currently trading at $64,151. The 24-hour low and high are $63,529 and $66,451, respectively. Furthermore, the trading volume has increased by 37% in the last 24 hours.\n\nMeanwhile, ETH price also reversed upside after dropping to a low of $3,446. The price currently changing hands at $3,514, down 2% in the last 24 hours. Also, the trading volume has increased by 15% in the last 24 hours, rasing speculation of a recovery in the crypto market.\n\nAlso Read: Shiba Inu Coin Burn Rate Spikes 530%, Will SHIB Price Rally?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQY0RPeU9Vai1hdVNDQXhCaFk5d1FQVlRGRFRGeU9JNk5DNjlyOWYzU281dTJRQVlqaTlYOVVwMEJLeGVrVGFzRDM2VGxVZlZrQnY5SHlKa0hjMHp4VkdIY3duWkNwVmo4Y2lYV0w2YXJtY0tmNkhPbjJkZUh5NktpXzRSY1V2QTNNNTl4eE02SHNncXfSAZgBQVVfeXFMTWotcjNhaXlTdEI2S2tzcHl4d052NzM4VEIzVWpNaHVLd1NiUmsxZlJCWDdZWER5bWxIZUxFTzdKMUlTNEVPM1pHNzhyc1lRd0V5eTBqZHRwd0Vpa05idWl4YU1sQ0Vkd1VJRVlMaUoyZ09FZjdUYk1YaC1WdENOTDlBOVRjZ2lCR0JWa1hjOGRZZVRQd3pNai0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "BNB Chain follows Ethereum with latest upgrade: Any impact on price? - AMBCrypto News",
        "content": "Data showed that the latest upgrade could tank BNB Chain’s revenue.\n\nBroader trader sentiment was positive, suggesting that BNB’s price can retest $600.\n\nOn the 20th of June, BNB Chain, the decentralized blockchain ecosystem released a major update. According to the chain, through BEP 336, users on the network can make transactions with a 90% fee reduction.\n\nThe disclosure is synonymous with Ethereum’s Dencun upgrade, which brought about a decrease in gas fees. Interestingly, BNB Chain did not deny that the EIP4844 inspired it. Concerning this it explained that,\n\n“BEP 336 significantly lowers the cost of transactions on the BSC network by eliminating the need for permanent storage of certain data types.”\n\nWill this affect revenue?\n\nHowever, it is important to mention that the development could affect BNB Chain’s revenue. At press time, AMBCrypto observed that the project’s revenue decreased from what it was on the 19th, according to Artemis data.\n\nNotably, fees gotten from transactions contribute a major quota to the revenue. Therefore, a further reduction could lead to another drop. BNB’s price is another metric that the development could influence.\n\nAt press time, BNB changed hands at $585.37. This was a notable decrease from the all-time high it reached weeks ago.\n\nHowever, reduced transaction fees could mean increased demand for the BNB cryptocurrency. Should this be the case, the price of the coin might be able to approach its all-time high of $720.67 again.\n\nRegardless, it is important to assess what is happening on the network. As of this writing, AMBCrypto looked at the development activity.\n\nDevelopment improves while traders plan to take advantage\n\nDevelopment activity measures the work done in public GitHub repositories of a project. If the metric increases, it means that developers are committing more codes to ensure shipping of new features.\n\nHowever, a decrease implies that commitment to polishing the network is not at its peak. According to. data from Santiment, BNB ‘s development activity jumped to its highest level since the 6th of May.\n\nThis implied an improvement in developer dedication. For the price, this rise could be bullish for the coin. Another indicator to evaluate is Funding Rate.\n\nThe idea behind assessing this indicator is to see if traders view the upgrade as a catalyst to drive a price increase or not.\n\nAccording to Coinglass, BNB’s Funding Rate was 0.0020%. Positive values of the indicator implies that the contract price is trading at a premium to the spot price. In this case, trader sentiment is bullish.\n\nOn the other hand, a negative reading implies that the perpetual price is at a discount. Therefore, the broader trader sentiment is bearish.\n\nThus, the Funding Rate at press time, implies that longs are paying shorts a fee to keep their position open. Hence, the average trader expects BNB’s price to increase.\n\nRead Binance Coin [BNB] Price Prediction 2024-2025\n\nBut for the price to increase, buying pressure in the spot market has to be increase.\n\nIf this happens, BNB’s price can surpass $600 in the short-term. But if invalidated, the price of the coin might drop to $570."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPaTdySDA5M3ViQWpIRlRER09wQ3h2RGxPWmI3ZVNDbE5jRngzR0dINkVscFcta2NwbWptbE9wWFRSbmsxNGhyVFJWbUJMU1FPcm1MM1gxOXphTDlsXzhiaHVJMl85b1VSV1owcnp6WEdWOXhtS0V5MjhxbTlYcmhKYVZleWtxTmxnSDc1SS1rU3JfQdIBlwFBVV95cUxOVWNSc1lnOE4tc0xPbEJlTmxNNDhIRG1TMVU5WURhcXdaSDF0cHNMRkpGYWl4d1JBZFRIb2Jfd0Z5VTJWcnpURHp1MUcweVRyMTV3Q2VBSTRaRkZtOGZOdnJSeldNTHZxWTN1UnJ0T1V6cjlKYk9zb3dqdWZNOW13WWhLOGFrc0wzaTd2b1pQYzdKQmlRbmlj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Drops Below $3,500 as Whales Transfer $79M to Coinbase - CoinGape",
        "content": "Ethereum (ETH) price has been in bearish momentum in the last 24 hours, swaying between an intra-day high and low of $3,536.84 and $3,447.94, respectively.\n\nThis 24-hour low was hit after Whales shifted Ethereum coins worth around $79,167,723 as of press time.\n\nadvertisement\n\nEthereum Whale Activity Amid Market Dip\n\nWhale Alert, an onchain tracking platform, has identified two significant ETH transactions in the last three hours. According to the report, the whales moved 13,166 ETH worth around $45,888,084 and 9,485 ETH worth $33,279,639, respectively, to Coinbase and Coinbase Institutional. These large transfers mostly lean toward potential sell-off pressures, indicating a shift in market sentiment toward the bears.\n\n🚨 🚨 13,166 #ETH (45,888,084 USD) transferred from unknown wallet to Coinbase Institutionalhttps://t.co/a5M791DY2D — Whale Alert (@whale_alert) June 21, 2024\n\nAccompanying this trend, ETH’s market capitalization and 24-hour trading volume fell by 1.53% and 5.97%, respectively, to $425,200,317,554 and $15,311,427,759. This dip in the trading volume suggests a declining interest among traders. If this bearish momentum persists, the following support to monitor would be $3,460 and $3,440.\n\nHowever, bulls would need to close above $3,500 for a bullish reversal. According to Coinglass, this potential reversal is supported by a slight increase in open interest by 0.78% to $15.79 billion.\n\nIs ETH Price Poised For a Bullish Recovery?\n\nDespite being bearish in the last 24 hours, Ethereum’s price has been bullish over the previous seven days, rising 3% in anticipation of spot Ethereum ETF trading approval. Last week, according to Coingape, Bloomberg analysts updated their approval timeline to July 2.\n\nConsequently, with the issuers expected to file updates to their spot Ethereum ETF S-1 registration form today, ETH’s bullish momentum may be looming. So far, the issuers that have submitted their S-1 updated filings are Fidelity Investments, Bitwise, and BlackRock.\n\nThese ETSs are expected to impact the Ethereum price due to the potential of increasing demand for ETH. Moreover, according to a report by K33 research, the ETFs may attract over $4 billion in inflows in the first five months, projecting that the price may hit $5,500 by August.\n\nSource: CoinMarketCap\n\nIn addition, with the SEC having dismissed its 14-month investigation of Ethereum, analysts project that Spot Ethereum ETF trading approval may be imminent. Despite this, Ethereum was exchanging hands at $ $3,477.36, a 1.51% decline from the intra-day high at press time.\n\nRead Also: 9 Crucial Ethereum (ETH) Tailwinds Spotted By Bitwise CIO\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOcU41SDBkODIxZFFKakJ1ek9mQVF3VTZqU3p2Zi1ENUlPbm91Mm5PZWxfbk9jTThMRVN0c21lQWQwLWJiMlVxUktZSTVOVW9tdk5ZS2drUDBYVWFUeFVhYmxiYnFMbDF5NFJOUFdla0F1QXpiZUNPUlF2NUxpUWVMV25WaHBTNGU0eHV4TE12bUpNUTJXS09hLVBGOGFpcVU0YnZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "VanEck sets 0.20% fee for proposed spot ethereum ETF - ZAWYA",
        "content": "Investment management firm VanEck plans to charge a fee of 0.20% on its proposed spot ethereum exchange-traded fund, according to a U.S. Securities and Exchange Commission filing on Friday.\n\nThe SEC approved applications from Nasdaq, CBOE and NYSE last month to list ETFs tied to the price of ether, potentially paving the way for the products to begin trading later this year.\n\nNine issuers, including VanEck, ARK Investments/21Shares and BlackRock, hope to launch ETFs tied to the second-largest cryptocurrency after the SEC in January approved bitcoin ETFs in a watershed moment for the industry.\n\nA spot ethereum ETF allows investors to gain exposure to the price of ethereum without the complications and risks of owning ethereum directly.\n\n(Reporting by Pritam Biswas in Bengaluru; Editing by Vijay Kishore and Shilpi Majumdar)"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNc0lwSFlSaFNnT2UzYnJkQjdFVGctdWY4N18wTWNUR3BIZXpIRXFNRHd5S0I4RXEyYV9QZE1La2U2aXRTMDFDUUkxMmQyUjJSOEd2ZV9ZVnZ0eHpiZWhsUXZxWGRQSjRfMUd0eEx3dlFtOWREUlNqckdqYXc2XzZscm04VWpRRTQyNUszZ0ZINHXSAZ4BQVVfeXFMTXlvQ1RvdWdtVnZ6VlZvY1R4eEthWGpBeUhreEljdENTUkxISWRpbFBVeFhhcVdmMUNwckY1dFd4S0N1bGNQeXRXb3NISUdkcVplWjBOeGZfUk1yTTk5bU1xcFdVNlNTclhSLTVIYWdBUXAySHhnMnhMMmFpTTFmYkJMQjFUMS1MVDAxdFd3NXlnaFJweWVCLV9RM2R5eHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 21, 2024 - Analytics Insight",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by market capitalization, continues to be a focal point in the crypto market due to its robust platform and widespread adoption.\n\nAs of June 21, 2024, Ethereum price has seen significant activity, reflective of broader market trends and specific factors impacting the Ethereum ecosystem. This article delves into the current price of Ethereum, its market performance, and the underlying factors influencing its valuation."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQTFM4OWRwNnFrWGRtLXVWTktNNjZkMlhrTWE2VmIxWFVTZFVhUTFCUTZLRGg0MWtGaG9kXzJ6eHQycncwY1RpMXdKSUd2cy1SZVMwSG9ZUGhOUmdXZG9INmlwTnRQYnMwdThKbUhOWHBJVEtydnlSU0pMVkZkd1hReld6TXJpNEw5RE1YM0ZsdU1TakRxamhTblJwZFNlcFhZVmQzaVRiYllQcVQzcnlXbTViUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "VanEck sets 0.2% fee for proposed spot Ethereum ETF - The Business Times",
        "content": "INVESTMENT management firm VanEck plans to charge a fee of 0.2 per cent on its proposed spot Ethereum exchange-traded fund (ETF), according to a US Securities and Exchange Commission (SEC) filing on Friday (Jun 21).\n\nThe SEC approved applications from Nasdaq, CBOE and NYSE last month to list ETFs tied to the price of ether, potentially paving the way for the products to begin trading later this year.\n\nNine issuers, including VanEck, ARK Investments/21Shares and BlackRock, hope to launch ETFs tied to the second-largest cryptocurrency after the SEC approved bitcoin ETFs in a watershed moment for the industry in January.\n\nA spot Ethereum ETF allows investors to gain exposure to the price of Ethereum without the complications and risks of owning Ethereum directly. REUTERS"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNXpLWERJbWR6cjdXSkxneEtNRkFUUTVKRUFCOHk0ZWQtYzdKdEZaaWEwQno4N1YwMUtibkE1emZ4RGRYcmdOcHdfMHp5RWpWbl91a2NxUTF0amthell0U3NVcXYxMVlyQnJlTDczVWNWZ1MxNW85dWJJWlI3eEgwNnBhWXBJalM3THNlZlo3aER6dEhBeWhYOHM0N3czU0nSAaQBQVVfeXFMTkRudExJOXVQcGJRMTlHdFY3NkNNSUgyREVzMkpFUnlYd01aNmNZRDFWNnhuTVRhTXVEMG9sNlk4cGtsa1UwbUJEb2s2SUI1TlZDTFA3N200SzU0TndwdTZKYjBzV1RLdTYxX092T0l6d1pXQzhSeEkwOWdGbVkzdXVzNUVXd2dTS2JqMVgwNmJDWE9yUlRzSEo0SlZNYTZvZ19JV2Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Records Surge In Active Addresses – Incoming Price Rebound? - NewsBTC",
        "content": "Ethereum (ETH) is currently down by 0.75% as its price continues a range-bound movement seen all week. However, in its monthly timeframe, the most prominent altcoin displays a concerning performance with a reported loss of 6.40% according to data from CoinMarketCap.\n\nHowever, popular crypto analyst Ali Martinez has picked up a notable development on the Ethereum network which could spell good fortunes for price action in the coming days.\n\n\n\nRelated Reading\n\nEthereum Price Retreats: Market Sentiment Slowly Shifts Bearish 3 months ago\n\nEthereum Active Addresses Soar To 3-Month High At 617,170\n\nIn an X post on June 22, Martinez reported a significant spike in the active addresses on the Ethereum blockchain. Using data from blockchain analytics company Santiment, the crypto analyst noted there were 617,170 active Ethereum users on June 21, marking the highest value for this metric in the past three months.\n\n#Ethereum just saw its largest spike in active $ETH addresses in three months, reaching a total of 617,170 active #ETH addresses. pic.twitter.com/CSqBOnQhEr — Ali (@ali_charts) June 22, 2024\n\nThis development has sparked much speculation in the Ethereum community as a rise in active addresses often signifies an increase in network activity which is quite important following Ethereum’s overall negative performance in the last month.\n\nIn theory, this is a positive omen for ETH’s price as higher activity corresponds with a rise in user transactions thus driving higher demand for the cryptocurrency and ultimately producing a price rebound. Many Ethereum enthusiasts would likely hope that this turns out to be the case when the altcoin breaks out of its current condition between $3,400 and 3,600.\n\n\n\nRelated Reading\n\n3 Reasons To Invest In Ethereum, 1 To Stay Bitcoin-Only: Bitwise CIO 3 months ago\n\nETH Propped For Major Rebound\n\nIn other news, another crypto analyst Michaël Van De Poppe has also added to Ethereum’s chances of staging market recovery. Using the ETH/BTC price chart, van De Poppe stated that as long as ETH trades above the 0.05 price mark, the token’s downtrend is set to undergo a reversal soon.\n\nCurrently, ETH trades around $3,504.42 with a 1.56% decline in the past week. Notably, the token’s daily volume is down by a staggering 52.93%, presently valued at $7.50 billion.\n\nIf the bulls are able to mount massive pressure forcing an upward breakout, ETH may return to the $4,000 last seen in March. However, if the bears retain market control, Ethereum could fall as low as $3000, representing a potential 14% decline from its current price.\n\nIt’s worth stating that all predictions are merely speculations and offer no guarantee. Investors are admonished to conduct proper research before buying any asset.\n\nETH trading at $3,511 on the daily chart | Source: ETHUSDT chart on Tradingview.comFeatured image from, chart from Tradingview"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPUDA3RlZSeGdsNk1pd0ljdEtWMFllZkRuSTNVQkdQdVVWa2VrUzc1V3Rpc2h1LWNqSjdBempfTmlNeXZGc3hoSC1XeTAwY1pwdnU5aEpuOGZCclRfNjIxd2tLM2Q3MzNMN0lIaS00b3R5RVNlXzJjOVBrTDVEODJsd0RFQklCR1VDb2Q4WnVtMmvSAZYBQVVfeXFMTnZZTzZzcGduSWhhWVBMS3V6X1phTXI2MlJuVEluT1RRanF5cmxhLUxPNEJnQUxjYU1jSkR4Q1pXemlxMGd1VTZZNHhtNE83UU02YWxVM21hbzlrbEpHUjZ3X09OcUVoZmJHY1RMd0kzMGtGNkhBTXdlYmY5LXMxbE16SmNPcFA2a1JjYUxidjctRERzUTNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 08:01:07 GMT",
        "title": "3 Reasons To Invest In Ethereum, 1 To Stay Bitcoin-Only: Bitwise CIO - NewsBTC",
        "content": "In a recent commentary shared on X, Matt Hougan, Chief Investment Officer at Bitwise Asset Management, which ranks as the world’s largest provider of cryptocurrency index funds, detailed why investors should consider diversifying their cryptocurrency portfolio by adding Ethereum (ETH), alongside maintaining a position in Bitcoin (BTC). Hougan offered three compelling reasons for investors to embrace ETH, while also presenting a critical viewpoint for remaining invested solely in BTC.\n\nEthereum Vs. Bitcoin: 3 Reasons Pro-Ethereum\n\nHougan began by emphasizing the importance of diversification within crypto investments. Drawing an analogy to the early days of the internet, he pointed out how difficult it is to predict which technologies or companies will dominate over the long term. “It is very hard to predict the future with precision,” Hougan remarked, referring to investors who bet on early internet companies like AOL and Pets.com, which failed to maintain their initial promise despite the internet’s overall growth.\n\nRelated Reading\n\nEthereum At A Crossroads: Big Move Coming After Consolidation Phase? 3 months ago\n\nApplying this lesson to crypto, Hougan advised a diversified approach to hedge against similar uncertainties. Ethereum’s current market capitalization stands at approximately $420 billion, which is substantial but still only about one-third that of Bitcoin’s $1.3 trillion market cap. Given these figures, Hougan proposed a default starting allocation of 75% Bitcoin and 25% Ethereum for investors seeking broad market exposure.\n\nHougan’s second point delved into the functional differences between Bitcoin and Ethereum. He described Bitcoin as primarily “a new form of money,” highlighting its design choices aimed at enhancing its utility as a robust monetary system. “Every design choice the Bitcoin ecosystem makes is designed to make Bitcoin the best form of money that has ever existed,” he stated, underscoring Bitcoin’s targeted development toward optimizing its use as a currency.\n\nConversely, Ethereum is characterized by its role as a foundational technology for building new applications that leverage its capability for programmable money. This includes everything from issuing stablecoins to enabling complex decentralized finance (DeFi) ecosystems.\n\n“Ethereum’s primary function is making money programmable,” Hougan explained. He argued that the ongoing development within the Ethereum ecosystem provides a broader exposure to the potential applications of blockchain technology, which is still in its nascent stages.\n\nRelated Reading\n\nThe third argument for Ethereum centered on historical performance data. Hougan pointed out that historically, portfolios that included Ethereum along with Bitcoin showed better performance metrics, both in absolute terms and when adjusted for risk, across full crypto market cycles.\n\n“My favorite thing about that table is that the +ETH portfolio has both higher returns and a lower maximum drawdown,” he highlighted. This historical analysis suggests that Ethereum could offer better downside protection and higher potential returns, though Hougan cautioned that “past performance is no guarantee of future returns” and noted that in shorter, recent periods, a Bitcoin-only strategy would have outperformed.\n\nCounterpoint: Why a Bitcoin-Only Strategy May Be Preferable\n\nAddressing the other side of the coin, Hougan discussed why many investors might prefer a Bitcoin-only strategy. This perspective is especially relevant for those concerned with macroeconomic issues like the degradation of fiat currencies and inflation.\n\nHougan posited that Bitcoin’s dominant position and its community’s focus on becoming a new form of money make it likely to continue leading this space. “It has a large lead, and size matters in money,” he stated, supporting the idea that Bitcoin’s simplicity and focused use-case as digital gold could be more appealing for certain strategic investments.\n\n“Money is a massive market. There’s plenty of space for BTC to run if it succeeds. […] My view, in a word: If you want to make a broad bet on crypto and public blockchains, you should own multiple crypto assets. If you want to make a specific bet on a new form of digital money, buy Bitcoin,” Hougan concluded.\n\nAt press time, ETH traded at $3,514.06.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPYUdJMG9mREZ4SjRpODk0UXNYUVJaaDBvREZpVGFPaGdiMjdINzRTR1dMZTRsMHU1Y2ZJb243eXFJS0JFV2dYTnVzMnF0LXh4RVB2aFVNVFUzX0V1UmtoRE1rbnNwTXFWeGhzRnVqX3pJRmFlam92S09vNU5iUmg5aDlSeEVPYlhCSnY3U2lzWnpyam56b2dpSGU1bXdZaUYybENFR2JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum or Silver? We asked ChatGPT-4o which asset is a better investment for 2024 - Finbold - Finance in Bold",
        "content": "As the broader cryptocurrency market faces a downturn, Ethereum (ETH) has demonstrated notable resilience, maintaining its value above $3,400. At the same time, silver (XAG/USD) is holding firm at a key support level of $29.00, rebounding as US bond yields come under pressure.\n\nThe evolving economic environment has led investors to reevaluate their strategies, comparing the benefits of Ethereum as a leading digital asset with the crucial role of silver in emerging technologies and its responsiveness to industrial demand fluctuations.\n\nEthereum: The innovator’s choice vs. Silver: The steady performer\n\nEthereum’s potential for aggressive growth and high volatility makes it an appealing speculative investment. Its foundational role in the decentralized finance (DeFi) ecosystem and smart contract functionality offers significant upside potential.\n\nAdditionally, Ethereum’s continuous technological advancements, such as the transition to Ethereum 2.0 and growing institutional interest, add to its attractiveness as a high-reward investment. Standard Chartered, an international banking giant, recently announced plans to open a trading desk for spot Bitcoin (BTC) and Ethereum, enhancing Ethereum’s market presence.\n\nEthereum’s flexibility and innovation within blockchain technology provide a hedge against traditional financial market instability and inflation, positioning it as a forward-looking investment choice.\n\nSilver, on the other hand, provides stability and growth potential tied to emerging technologies and global sustainability trends. Unlike Ethereum, silver is less volatile and benefits from its dual role as both an investment and an industrial commodity.\n\nIts sensitivity to industrial demand cycles and use in high-tech solutions position it for steady appreciation. Silver’s traditional role as a hedge against inflation and economic downturns makes it a reliable choice for more conservative investors.\n\nChatGPT’s analysis: Ethereum vs. Silver investment prospects\n\nAccording to ChatGPT-4o, the decision largely depends on individual investment strategies and risk tolerance.\n\nInvestors looking at Ethereum should be comfortable with higher risks and the potential for high rewards. This includes tech enthusiasts captivated by blockchain innovations, long-term believers in the future of decentralized finance (DeFi) and NFTs, and institutional investors seeking advanced digital assets.\n\nEthereum’s recent resilience, growing user engagement, and potential ETF approvals make it a compelling choice for those aiming for significant growth.\n\nChatGPT Ethereum investment prospects. Source: Finbold and ChatGPT\n\nOn the other hand, silver suits conservative investors who prioritize stability and steady growth. Silver’s extensive use in electronics, solar panels, and medical devices ensures ongoing demand, making it a reliable industrial commodity.\n\nAdditionally, silver serves as a traditional hedge against inflation and economic downturns, appealing to those who prefer tangible, physical assets. Its role as both an investment and an industrial commodity makes silver a sound choice for those seeking a balanced and secure addition to their portfolios.\n\nChatGPT Silver investment prospects. Source: Finbold and ChatGPT\n\nUltimately, diversification with both Ethereum and silver can be a way to manage risk and potentially benefit from the growth of both major assets. The choice between Ethereum and silver should align with individual investment goals, risk tolerance, and interest in the technological aspects of cryptocurrencies.\n\nEthereum and Silver recent price performance\n\nEthereum and Silver 6 months performance. Source: TradingView\n\n\n\nAs of 2024, six months performance for Ethereum and silver presents a clear contrast in investment returns. Ethereum has seen a significant rise, with an increase of 39% in six months, showcasing its volatile yet high-growth nature with its current price at $3,505.\n\nIn comparison, silver has gained 30% in six months, with its current price at about $29.5 per ounce.\n\nIn conclusion, both Ethereum and silver offer unique investment opportunities suited to different risk profiles and market perspectives.\n\nEthereum’s innovative edge and high-growth potential make it an attractive option for those willing to embrace volatility and technological advancements. In contrast, silver’s stability and industrial applications provide a safer, more conservative investment route.\n\nDiversifying with both assets could offer a balanced approach, allowing investors to capitalize on the strengths of each while mitigating overall risk.\n\n\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNVklVUTBJM3FfbzRiYVhzZnRVUFBxaHVubnkya0RveTlVREd5MjNIbXVoT2lmNk9wVDkweE1ZenZZcnBoRU10aDV0bzlvbnE4SWdfZ3FMU2s5SlRqdzZMdGtzaEk5ZS1jWGFBUTRENGY5aDFMaUZkbGN5dFNybXlOTjV4dVo5OFJtUk9yVEdsczVtbG1LVy1jZ1F4Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "ChatGPT-4o sets Ethereum price as $800 billion bank enters ETH spot trading - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has been conquering traditional finance attention, especially among relevant institutional players. Now, Standard Chartered, a banking giant with over $822 billion in assets under management (AUM), has also made its move.\n\nAccording to a Bloomberg report, Standard Chartered plans to offer Ether and Bitcoin (BTC) in a new crypto trading desk. If accomplished, the move will make StanChart the first major global bank to offer this service.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” the bank said in a statement.\n\nFurthermore, the bank already holds stakes in crypto-focused firms like Zodia Custody and Zodia Markets. Standard Chartered launched Libeara, a blockchain unit, to help institutions tokenize real-world assets, a use case leveraged by Ethereum’s network.\n\nThe bank remains bullish on the crypto sector, predicting Bitcoin will hit $150,000 in 2024, as reported by Finbold. In this context, we asked ChatGPT-4o for a price prediction on Ethereum, considering the recent support from Standard Chartered.\n\nChatGPT-4o Ethereum price prediction with Standard Chartered spot trading\n\nNotably, OpenAI‘s flagship product, ChatGPT-4o, mentioned that increased institutional adoption is a driving factor for Ethereum’s demand. The artificial intelligence (AI) chatbot provided three scenarios addressing a bullish, a moderate, and a bearish outlook.\n\nFirst, ChatGPT forecasts ETH to trade between $6,000 and $9,000 by mid-2025. This forecast assumes positive regulatory developments, successfully launched Ethereum spot ETFs, and increased institutional adoption.\n\nA more moderate scenario puts Ether, the native token, between $4,500 to $6,000 by mid-2025, considering a sustained but not explosive influx of institutional funds. Meanwhile, Ethereum could remain at its current level between $3,000 to $4,000 if things do not play out as expected.\n\nChatGPT-4o Ethereum price prediction. Source: NanoGPT\n\nEthereum (ETH) price analysis\n\nAs of this writing, Ethereum trades at $3,496 per token, showing strong momentum in the one-year price chart. The leading Web3 cryptocurrency has gained 86% year-over-year, getting its launchpad ready for a significant surge if everything goes favorably.\n\nA rally to the AI targets would result in up to 157% gains from current prices.\n\nEthereum (ETH) one-year price chart. Source: Finbold\n\nHowever, ChatGPT-4o can make mistakes, and ETH’s success depends highly on the demand that its network can attract. Cryptocurrencies continue to be developed, some offering remarkable competitive advantages over Ethereum. Investors must be cautious and actively do their research to keep up-to-date with the market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOdGQ1ODlvYXZhc3k3LUdyb3d2RjlGSDlvQzZrZ05SNHdTcUxYZ1JqcUtfSHZBUkwtcGlheTRPSEZwOFhrRFBXbm8zS28xWS1lNVRONUc3WlJrSzY3T0F0dGdhLWFCX2VaV0JCTUt5UjFIZlNhRXFHNDhJdzNjMkltYVpfd0EzSnRMalN4ZFRodw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Fidelity Makes $4.7 Million Play on Ethereum ETF in SEC Filing - Coinfomania",
        "content": "The United States Securities and Exchanges Commission (SEC) Chairman, Jay Clayton revealed in a Monday interview with CNBC that there is now an increased chance of seeing a Bitcoin exchange-traded fund (ETF) go live for U.S investors soon.\n\nClayton made the revelation while answering questions regarding how far crypto market participants seeking the listing of a Bitcoin ETF have satisfied concerns expressed by the SEC regarding such a product.\n\n“Yes, but there’s work left to be done,” said Clayton who had in the past mentioned perceived market price manipulation on unregulated exchanges and unreliable custody as the primary reasons why the SEC hasn’t blessed any of the Bitcoin ETF proposals it has received so far.\n\nOnce again, the SEC Chairman highlighted those concerns as tough questions, before saying,\n\n“Now, progress is being made, but people needed to answer those hard questions for us to be comfortable that this was the appropriate type of product.”\n\nUndoubtedly, the latest comments made by the SEC Chairman raises hopes that there is yet a possibility of seeing the first Bitcoin ETF launch later this year or at least sooner than many had envisaged.\n\nAs Coinfomania reported last month, the SEC must now rule on whether or not to approve proposed rule changes to list Bitcoin ETFs submitted by Bitwise and VanEck/SolidX. These filings were published in the federal register in February kickstarting a 240-day waiting period for a final decision by the SEC.\n\nHowever, the regulator has delayed deciding on three occasions and must now rule on October 13, 2019, whether or not to approve the Bitwise ETF application, and make a similar decision regarding the VanEck/SolidX on October 18, 2019.\n\nIt is also vital to note that there is a possibility that the SEC decides against approving the current proposals [with only roughly a month remaining] since Clayton also mentioned that “there’s work left to be done.”"
    }
]