[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT3JFWTFBSWpjNE84T09xUTRTTThQMTI3ZEh0dHlUaEIzZXNhV3Q3UFdld2dDN0liY3J3Qmppel92OEhMb2lwTGppVnFfVlViMWVEdlpESGlRcFB3WnFmcGFzLUxqaEJZOVJsVlVNbXVSMTY0TDZrYmpmbk1lOFJRT2JsLWNta09JZlRoVk1kRWVjTzV3SGRyem1DdnBJdFdrRUlR0gGrAUFVX3lxTE5kWHZiekZnZXhHR3RXdExLSnFIeER0dmhxaFBTXzlwTDhMdnRCblFFazdEb1BRM3FhU01Uemh0S2R4aHYtSnMyeWN5YUsweE1tbXIydkdDT3NkRVQ4cGsyVUlwM1pLdGw3NWhrNFE4RWJyRFdMd1dXNTNoTmstd3BLTENhVVRZNmhENWUzMjlrYjVEMlZSZjQtUGk5NERaUktJWnloVEZTMFVMWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Could Top $14,000 Next Year Alongside Bitcoin Boom: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational Standard Chartered isn’t just bullish on Bitcoin—Ethereum is also going to the moon, its analysts say.\n\nA Monday report from the bank claimed that the second-biggest digital asset could hit $8,000 by the end of this year, and $14,000 is possible by the time 2025 is up.\n\nIf, that is, spot Ethereum exchange-traded funds (ETFs) get approved, Geoffrey Kendrick, head of forex and crypto research at the firm, said in the note.\n\nThe price of Ethereum is currently hovering slightly above $3,500 per coin, CoinGecko data shows.\n\nAD\n\nAD\n\nSeveral high-profile fund managers have filed paperwork with the Securities and Exchange Commission (SEC) to release Ethereum ETFs. Such investment vehicles would expose traditional investors to the cryptocurrency via shares that trade on a stock exchange.\n\nKendrick wrote in the note that the bank expects the ETFs to get the green light from the SEC by the summer.\n\n“Ethereum is currently between two important events that we see driving price upside,” wrote Kendrick. “It has just had a structurally significant upgrade, and U.S. regulatory approval of ETH ETFs is expected in May.”\n\nKendrick also said that the network’s recent Dencun upgrade could be the reason for Ethereum shooting up rapidly.\n\nAD\n\nAD\n\nThe network behind the second-biggest cryptocurrency was upgraded last week. Developers say the improvement will make transaction fees on the blockchain super cheap.\n\nKendrick added that the upgrade and lower costs on the network make Ethereum “more competitive.”\n\nStandard Chartered said in a different research note Monday that Bitcoin could hit $150,000 per coin by the end of this year if the newly approved ETFs continue to be popular.\n\nIn January, the U.S. Securities and Exchange Commission approved 11 of the investment vehicles.\n\nThey have so far been hugely popular with investors—and the massive inflows have pushed the price of Bitcoin up significantly.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5ueHpLMGU5WlA0UjZKN1FTLXZkd3JzQUxJM0hVamZhcXVWTUgwWXdMWGhLWTh3TnIxRExkWllnZzRQRkNQcjRxNTdyVDVBTTVKdGFkTHhYZVRlQXZjbFNXNnhKc3ZOb3pEQ2p2UUZVd0lXLVBkLVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "2024 Ethereum Facts & Figures for Nonprofits - The Giving Block",
        "content": "What is Ethereum, exactly? It’s one of the oldest and most popular blockchains in the crypto sector. Ethereum is also the name of its native token, which is abbreviated as “ETH.”\n\nA growing number of nonprofits know that donating ETH is a popular way to give back—making ETH donors a major force for good in the Crypto Philanthropy movement.\n\nAs the crypto bull market picks up momentum, there’s never been a better time to ask for ETH donations. Since “crypto” can feel overwhelming at first, we’ve gathered up some essential facts and stats about Ethereum for fundraisers and nonprofit professionals."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTkFjSVUySnhTNmNaSHJuazVQazhpYzdrb0JLTFBOSGI4dnFLUjNTZzQ4cUpMVk9EX2pwd0lyTWQ5VFRTcjJRYnFsVjdhenhsd3J5RFhUR3RFT2RaZFdxZngyV0N5ZFFQVkRmOWNjLUF2QVN6UFZLSGVXUzZtOVlNZ0hkVGFGRnRCc0NuYVBvTjFXWG4tQk80?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Could Ethereum Hit a New All-Time-High of $5,000 by the End of 2024? - The Motley Fool",
        "content": "Ethereum has two solid catalysts in place for 2024, but will they both deliver as planned?\n\nNow that Bitcoin (BTC -0.63%) has hit a new all-time-high, could Ethereum (ETH -1.03%) be next?\n\nCurrently, Ethereum is trading at just under $4,000, within striking distance of its all-time-high of $4,891.70. Given that Ethereum is already up about 70% for the year, it wouldn't seem to require much for Ethereum to rise another 25% before the end of 2024.\n\nAnd indeed, there are two potentially major catalysts in place this year. If Ethereum is going to soar to an all-time-high of $5,000, it's likely that both of these are going to be needed. Let's take a closer look.\n\nNew tech upgrade\n\nThe first major catalyst is a brand-new tech upgrade (Dencun). It is the biggest change to the Ethereum blockchain since The Merge, which took place nearly 18 months ago. So understandably, analysts are getting excited about what this new upgrade might mean for Ethereum's growth prospects.\n\nThe Dencun upgrade has two major goals: to improve the scalability of the Ethereum blockchain (which can still suffer from congestion and slow throughput times), and to lower the costs of transactions within the Ethereum ecosystem. If Dencun can deliver on both, it would help to cement Ethereum's role as the preeminent smart contract platform in the world. Even better, Dencun is setting the stage for Ethereum's next upgrades, all of which have been carefully laid out by Ethereum co-founder Vitalik Buterin in the blockchain's latest annual roadmap.\n\nSo far so good, right? You have a tech upgrade promising major performance enhancements, and you also have a roadmap for future growth. But not so fast. A number of blockchain analysts are taking issue with the Dencun upgrade.\n\nAs they see it, Dencun is not a long-term fix because it relies too much on third parties (known as Layer 2 scaling solutions) to make all the performance enhancements work. In a worst-case scenario, reliance on these Layer 2 scaling solutions could lead to all kinds of interoperability issues, fragmentation within the Ethereum ecosystem, and a loss of cohesion among Ethereum developers.\n\nSpot Ethereum ETFs\n\nThe second big catalyst is the potential launch of new spot Ethereum exchange-traded funds (ETFs) as early as May. Given all the enthusiasm and excitement around the spot Bitcoin ETFs, it's easy to see why a new spot ETF investment product could send Ethereum soaring.\n\nAs in the case of Bitcoin, it would become remarkably easy for any investor to buy Ethereum. If these investors decide to allocate even 1% of their portfolios to Ethereum, that could send the crypto soaring.\n\nThe only problem, from my perspective, is that analysts seem to be vastly overstating how easy this process is going to be. As they see it, the Securities and Exchange Commission (SEC) has already bought into the idea of spot ETFs for cryptocurrencies, and thus, new approvals are going to be coming on a regular basis from here on out.\n\nBut what they fail to take into account is that the spot Bitcoin ETF process took years to achieve, and only after very specific milestones had been met. Even up until final approval in January, there were serious doubts about the SEC finally approving them.\n\nAnd we're starting to see the same thing with the spot Ethereum ETFs now. The probability of an SEC approval taking place in May has recently been lowered from 70% to 30%, according to a top Bloomberg analyst.\n\nThat's because the SEC has maintained what can only be described as radio silence ever since the spot Ethereum ETF applications were filed. There has been no outreach to the investment firms trying to bring them to market, and no indication that regulators are now ready to sign off on other cryptocurrencies beyond Bitcoin.\n\nIs the glass half-full or half-empty?\n\nIf you're an optimist and see the glass as half-full, the new Ethereum tech upgrade in 2024 is worthy of the same type of acclaim as The Merge was back in 2022. You probably also think that a fresh batch of spot Ethereum ETFs are on their way before the start of summer.\n\nHowever, if you're a skeptic and see the glass as half-empty, the new Dencun upgrade is at best a temporary fix for problems that have been plaguing Ethereum for years: high transaction fees and slower transaction processing speeds compared to many other blockchains. Moreover, you're probably also thinking the SEC will take its time with the spot Ethereum ETF approvals, much as it did with the Bitcoin ETF approvals.\n\nMy concern right now is that the optimistic scenario has already been baked into the price of Ethereum. How else to explain the fact that Ethereum is up just as much as Bitcoin this year?\n\nThus, if either of these two catalysts fail to deliver as expected, we could see a pullback in the price of Ethereum. For that reason, I'm taking a wait-and-see approach with Ethereum right now."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPQ2tfRVdfSEtLNk5XMGRZTGVBOTFLallFSXpDQVZfZFdyclRHeC1WQWJaOWxibGZpamJTZkFIWUlzeFgxd2JiYTM0dTZjRndIbnRVRWxYU29xdGoyRjBON2lKVmRNQVBLaDV5VFBJOG9GUVVhdlZmNHUyRXF6OVpZaGczOFpVSF8tUkJITkRTWTJqNHFZZ0h5V1ZCQkowanps?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s CREATE2: A Double-Edged Sword in Blockchain Security - Check Point Research",
        "content": "By Oded Vanunu, Dikla Barda, Roman Zaikin\n\nEthereum’s CREATE2 function is being exploited by attackers to compromise the security of digital wallets, bypassing traditional security measures and facilitating unauthorized access to funds.\n\nThe attack method involves tricking users into approving transactions for smart contracts that haven’t been deployed yet, allowing cybercriminals to later deploy malicious contracts and steal cryptocurrencies.\n\nThis vulnerability highlights the need for enhanced security measures in wallet security products to adapt to the evolving tactics of cybercriminals, ensuring the safekeeping of digital assets in the face of innovative exploits.\n\nIn the digital realm of blockchain and cryptocurrency, Ethereum stands out as a platform of innovation and versatility. Its capacity for adaptation and development makes it a critical player in the tech space. However, the very features that make Ethereum remarkable also expose it to potential vulnerabilities. One such feature is the CREATE2 function, which, while showcasing Ethereum’s advanced technological capabilities, has unfortunately also opened the door to new security threats against digital wallets.\n\nThe Intricacies of CREATE2\n\nIntroduced in Ethereum’s Constantinople upgrade, the CREATE2 function has been hailed for its ability to deploy smart contracts with deterministic addresses even before the creation of the contract’s bytecode. This function significantly enhances the predictability and efficiency of smart contract interactions, offering a boon for the complex ecosystems of decentralized applications (dApps). It allows for the pre-orchestration of interactions between multiple contracts, a feature critical for the seamless operation of dApps.\n\nThe Security Concern\n\nHowever, the innovative CREATE2 function also presents a significant security loophole. Cybercriminals have quickly leveraged this function to bypass conventional wallet security measures, creating a new method for exploiting unsuspecting victims. The core of the vulnerability lies in CREATE2’s ability to deploy a smart contract at a known address in the future, enabling attackers to deceive users into approving transactions with a contract that doesn’t yet exist. Once the user grants approval, the attacker can deploy a malicious contract to that address, hijacking the transaction and draining the victim’s cryptocurrency wallet.\n\nA Closer Look at the Attack Mechanism\n\n1. The attacker begins by convincing the victim to approve or increase the allowance for a yet-to-be-deployed contract.\n\n2. Since the contract hasn’t been deployed at the time of approval, it evades detection by security solutions, which cannot identify potential threats in non-existent contracts.\n\n3. After securing the victim’s authorization, the attacker deploys the malicious contract, exploiting the victim’s funds.\n\nThis method not only underlines the creative misuse of Ethereum’s features by malicious entities but also highlights a critical challenge for security products. Most security solutions are calibrated to analyze and validate transactions based on existing contracts and known behaviors. CREATE2, by facilitating interactions with future contracts, effectively bypasses these security frameworks, leaving digital assets at risk.\n\nThe Technical Side of CREATE2\n\nDelving into the technical aspects, CREATE and CREATE2 are both opcodes in Ethereum blockchain development that support the deployment of smart contracts. They differ primarily in how the address of the new contract is determined. While CREATE bases the contract’s address on the creator’s address and a nonce, CREATE2 allows for a more flexible approach by incorporating a user-specified salt, the creator’s address, and the contract’s initialization code into the address computation.\n\nIn the context of Ethereum blockchain development, both CREATE and CREATE2 are opcodes that facilitate the deployment of smart contracts, but they differ in how the address of the new contract is determined.\n\nThe CREATE opcode generates the address of the new contract based on the address of the creator (the sender of the transaction) and the nonce. On the other hand, CREATE2 offers a more flexible approach by allowing the contract’s address to be determined based on a user-specified salt, the creator’s address, and the contract’s initialization code.\n\nThe address of the contract in CREATE2 is computed by using 4 parameters:\n\nkeccak256(0xff + sender_address + salt + keccak256(initialization_code))\n\nConstant prefix – A fixed prefix that is part of the hashing process, which is 0xff. This is used to differentiate CREATE2 addresses from those created with the CREATE opcode. Sender’s Address – The address of the account creating the contract, typically a smart contract itself when using CREATE2. Salt – A 32-byte (256-bit) value chosen by the creator. The salt allows the creator to deploy multiple contracts with the same initialization code to different addresses. Initialization Code – The bytecode of the contract being created. This includes the bytecode that results from compiling the smart contract source code, along with any constructor arguments encoded into it.\n\nTo demonstrate how CREATE2 can deploy another contract with a deterministically computed address, we will use the below simple example that includes two Solidity contracts: Factory and Child. The Factory contract uses the CREATE2 function to deploy the Child contract to a specific precomputed address.\n\nBy deploying the Factory contract to the testnet and using 123456 as a salt, we will be able to precompute the child contract address:\n\nFactory Contract Address is (https://goerli.etherscan.io/address/0xb74025567acdc922507821516014dc5fe659483f):\n\nNow by using computeChildAddress function, we will be able to precompute the child address which is\n\n0xe41Ba18D5e667b0B391b33b848520FA6F041C092:\n\nThis address does not exist yet because we didn’t deploy the contract:\n\nNext, the attacker will try to trick the victim into approving this contract as a spender for a specific token he wants to steal, and because the contract has not been created yet, this transaction evades all forms of wallet security measures the victim possesses, which rely on the historical record of the contract address.\n\nAfter the attacker tricks the user to sign the approval request, he will be able to deploy the contract by using the same salt 123456 in the function deployChild:\n\nAn Example from the Wild\n\nA stark illustration of this vulnerability in action involved a user losing $3.5 million due to such an exploit. The victim approved a transaction for a contract that hadn’t been created yet. The contract was deployed shortly after the approval, and the attacker executed a function to transfer the victim’s funds to their own address.\n\nAt the time of the transaction, the contract a01dee645e4dbaaa8aa2089cc4b1cc34d36fa71c which is approved for the allowance had not been created yet:\n\nhttps://etherscan.io/tx/0xb5f03259859c10243a85f7a9ca27d8b45e67ce6463800193634d27718ba162a0\n\nThis transaction executes an unverified function that performs various checks and then creates the approved contract address by using CREATE2 as we demonstrated before:\n\nTarget – Which is, in this case, SUPER token\n\ncallData – This is the bytedata of the function the attacker wants to perform.\n\nin this situation, the attacker performs the transferFrom function and uses the allowance from before to transfer the balance from the victim to the following address 0x8f9278aab84290fe6e78515b7938b3136b89a1e2:\n\nSecuring the Digital Frontier\n\nThe exploitation of the CREATE2 function underscores the ongoing battle between innovation and security in the blockchain space. As Ethereum continues to evolve, so too must the security mechanisms designed to protect users from such sophisticated attacks. Awareness and education are the first steps in safeguarding digital assets against emerging threats. Blockchain developers and users alike must remain vigilant, continuously updating their knowledge and security practices to navigate this ever-changing landscape securely.\n\nThe Threat Intel Blockchain system, developed by Check Point, continues to accumulate valuable information on emerging threats, and this intelligence will be shared in the future. In this collaborative effort, we aim to empower investors with the knowledge needed to navigate the crypto space securely and protect themselves from potential pitfalls. For more information contact us at: [email protected]"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQTVJvc2tuWUF0bldWdVlZbERWemZ2Q2R1ZzhsVGx6WXFEZVFoVWo2c2ExZUlSVnMyZWhicTNWdE5ZUWRiT2xpMmdwYmVzUDEyVG5JRzVxWE44YVgxaThNWlE4alVmeHNYWDJHWVNIRG14ZTJXc2FibW1NdmtEWG1BNU5waFZUMVVnOXZfSTVsbzI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Fidelity Updates Ethereum ETF Application To Include ETH Staking - Yahoo Finance",
        "content": "Fidelity Updates Ethereum ETF Application To Include ETH Staking\n\nFinancial services giant Fidelity plans to stake a part of the ETH if its spot Ethereum exchange-traded fund (ETF) application gets approved. This would allow investors in the ETF to earn additional income from staking rewards.\n\nIn an amendment to its ETF application filed with the U.S. Securities and Exchange Commission (SEC), Fidelity stated that it may stake part of the fund's assets through one or more staking providers. Fidelity did not disclose which staking providers it would use.\n\nStaking is a process that allows cryptocurrency holders to earn rewards by locking up their coins. Staking helps to secure the blockchain network and validate transactions.\n\nFidelity's move follows similar announcements from other fund issuers, including Ark 21Shares and Franklin Templeton. All three firms are seeking to launch spot Ether ETFs that would allow investors to gain exposure to ETH without having to buy and store the cryptocurrency themselves.\n\nThe SEC has yet to approve any spot Ether ETFs. However, Fidelity's application is one of eight that are currently under review by the agency. The SEC has a final deadline of May 23 to approve or deny these applications."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMGI4MVNmMWxxbXlXUU85NGg2WnFCQkJDRGQySURBUkpoQi1yZk1CQ0xHeVpBZEMtUGU4ZjFFOGp6WDBzX1hWaHI5WmxKTlRhdUdDWXZodENEa3p6TmRPRk5zdnFVWnRxQlVQNk8zYlR0X0drM29jekhCSkZEelBtSkVobHNHbnkyZnJpa0hmNU9qRF85cXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock launches $100 million tokenized asset fund using Ethereum - CryptoSlate",
        "content": "BlackRock, the world’s largest asset management firm, has created a new tokenized asset fund, according to a March 19 SEC filing.\n\nThe initiative — dubbed the BlackRock USD Institutional Digital Liquidity Fund — is registered in the British Virgin Islands and developed in partnership with San Francisco-based Securitize, a company focused on asset tokenization.\n\nThe technical details of the fund and which asset classes it aims to tokenize were not disclosed in the filing and remain unclear. On-chain data shows the fund has been seeded with an initial capital of $100 million USDC on the Ethereum blockchain.\n\nThe companies have yet to make a public announcement and did not respond to a request for comment as of press time.\n\nRWAs\n\nThe establishment of the BlackRock USD Institutional Digital Liquidity Fund is reflective of the increasing interest in the tokenization of real-world assets. This emerging sector aims to combine the capabilities of digital assets with traditional finance to streamline the settlement process and enhance transactional efficiency via blockchain technology.\n\nThe market responded positively to the announcement of the fund, with a notable increase in the value of ONDO, the native token of Ondo Finance, a platform that facilitates the tokenization of real-world assets.\n\nThe token was trading at $0.5 as of press time, up 12% over the past 24 hours despite the wider market crash, according to CryptoSlate data.\n\nWith this new venture, BlackRock has positioned itself at the forefront of integrating digital assets with traditional financial services, potentially setting a trend for more institutional investments in blockchain technology.\n\nBlackRock’s crypto journey\n\nThe Digital Liquidity Fund is the latest step in BlackRock’s broader journey in the digital assets industry, following the introduction of its spot Bitcoin ETF — IBIT — in January. The ETF has seen record-setting performance since its launch and rapidly attracted over $15 billion in assets under management.\n\nThe firm also has an Ethereum ETF application in the pipeline and is considered to be bullish on both crypto and the underlying blockchain technology that allows tokenization.\n\nBlackRock CEO Larry Fink recently highlighted the strategic importance of BTC and ETH ETFs as precursors to wider adoption of tokenization in the financial industry. He said these products would open the door to a significant shift towards incorporating digital assets into conventional financial practices.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE55b1NxTktDREdTNzNvZzBkYzVEM3dNRmNqSTVuamNmdHdkRTluQUctdHhpTkZRdTNyVmxXMm9aUUdldjJ4SW91ekx1ejRtb1czMG5ETzRkbVBWQ1BzWF9DMGFTV3A5NGRIc0hrSTRFc0FaUi1VQi1lNnBBQ0ZMUdIBgwFBVV95cUxNUE1HVGlILTVuemF2X2R4aTZCZFQwTFUxN0hGU3RVNEc3cndEeWwxcHZyMGI4Q0ZKelVnWWI0Qi13eFltZ1REUWw4Tmp6VHFvMUljLW8yeHlfM1lZYWx2Y2cwY1hsODRuVmtGTFhKaTFrTlRoT2Y1TXJCS0tNQk1kZnBRbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "ETH Whales Cashing out Massively Amid Ethereum Price Drop - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAmid a tumultuous week for the crypto market, ETH whales have made substantial moves, cashing out millions before Ethereum's price downturn. In the past four days of market downtime, three smart traders have offloaded a staggering 26,946 ETH, equivalent to a jaw-dropping $95.7 million. Their combined profits stand at an impressive $39 million, according to data from Spot On Chain.\n\nAdvertisement\n\nThe first trader, identified as \"0xb82,\" executed a strategic move, selling 7,300 ETH for $24.4 million in stablecoins via Binance, netting a handsome profit of 22.7%, which is equivalent to a remarkable $4.59 million. Not far behind, \"0xebf\" deposited 8,870 ETH, valued at $33.1 million, onto Binance on March 16, reaping an estimated total profit of $25.3 million, an impressive 55.8% gain.\n\nLastly, \"0xa43\" sold 10,776 ETH for $38.2 million on March 15, realizing a notable $9.14 million profit, equating to a 31.5% gain.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nThese moves come against the backdrop of Ethereum's price plummeting over 11% since the start of the week. After reaching a two-year high of $4,093 last week, Ethereum faced a significant sell-off, driving its price down to $3,200 per ETH.\n\nCoinGlass reports that within the past 24 hours, positions totaling $120 million were liquidated, with an estimated 85% of them being long positions, suggesting a wave of sell-offs and profit-taking among investors.\n\nThe mass cash-outs by ETH whales amid the price drop raise questions about the future trajectory of Ethereum and the broader cryptocurrency market. Whether the main altcoin finds a foothold will largely be both the cause and the consequence of how events develop further."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUUgxM1pacTFsSW9OSVRMak9lNklaN1E0Z2F1di14MWRSeFBYdnVFX0NVMkFRbzJrSzI2eHhpMW5NTFFfOEtjU01yTzk4Yy1qb3hFd2xWakpYbGZmLVNDM2Y1YWpadDFHLVc0Rm5qd2dKTXdLMXV2bVgzUkhlcDhkTnQ4Q1BiazlXRnNJTE9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’ - Yahoo Finance",
        "content": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’\n\nThe Solana network experienced a surge in activity over the weekend, surpassing Ethereum in total trading volume. However, the network struggled to keep up with the influx, leading to frequent transaction failures and delays.\n\nSolana's 24 hour trading volume reached nearly $3 billion on March 17, beating out Ethereum's daily volume of $2.04 billion. The network also reached a new record of $3.79 billion in trading volume on March 15. The surge in activity was driven by a speculative frenzy for new Solana-based memecoins. Book of Meme (BOME) rallied from near-zero to a market capitalization of $1.45 billion in just 56 hours.\n\nThe surge in trading activity overwhelmed the Solana network, causing ping times to spike and transaction failures to increase. According to data from Solana Validator, Solana's ping time ran as high as 46 seconds on March 18, resulting in approximately 30-40% of transactions failing.\n\nHowever, this hasn’t stopped the price of Solana (SOL) rallying to $203, up 8.69% over the past 24 hours and 45% in the last week alone. Solana's market capitalization also reached a new all-time high of $89.3 billion, overtaking BNB (BNB) to become the fourth-largest cryptocurrency by market cap."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNaHZMUE94Z3NYQUkxT1NZdEdmN1JJMnJKcjVNNUNXZ29nWWxpNXVKWE5CZEhJbzNoamZGVWExdWROWnFpSk5kUjNteDhiRzVVdXYzQUhDanRLUWNON2RwT1NCYWVnRlZYYV91M3hRLTh3ZGZaUGxSQ1YtTk1qZ2RCdjVYRUN2SWo0TGNSNmtKbnBaMTdCb3h1ZWVaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Fidelity adds staking to Ethereum ETF application amid mixed reception - CryptoSlate",
        "content": "Fidelity Investments has amended its application for an Ethereum (ETH) spot exchange-traded fund (ETF) to include a staking feature, according to a regulatory filing.\n\nThe amendment was filed with the US SEC on March 18 and has stirred significant interest in the industry, but market analysts and observers have mixed feelings. It introduces the possibility for the ETF to engage in staking activities, a core aspect of Ethereum’s functionality following its shift to a Proof of Stake (PoS) model.\n\nThe amendment comes days after US politicians wrote to the SEC to block further crypto-related ETFs due to concerns over the risk posed to retail investors.\n\nETF with staking\n\nThrough the proposed amendment, the ETF could allocate a portion of its holdings for staking through designated staking providers, which may include affiliates of Fidelity.\n\nStaking involves participants locking up digital assets to support the network’s security and operations in return for rewards in the form of additional crypto. Fidelity’s move aims to explore the income-generating potential of staking within the framework of a regulated financial product.\n\nAccording to the document:\n\n“In consideration for any staking activity in which the Fund may engage, the Fund would receive certain network rewards of ether tokens, which may be treated as income to the Fund as compensation for services provided.”\n\nThe SEC has historically been highly cautious toward crypto-related financial products and, notably, rejected spot Bitcoin ETFs for years before finally relenting after a court ruled against its decisions.\n\nThe regulator has yet to decide on the Ethereum ETF applications and is expected to either approve or reject them by a May deadline. Experts were initially optimistic about the approval but have since revised the odds to roughly 35%.\n\nMixed feelings\n\nThe inclusion of staking in Fidelity’s ETF application raises intriguing questions about the SEC’s reception and the future regulatory landscape for digital assets. The move has caused mixed reactions within the industry but failed to shift sentiment toward optimism.\n\nBloomberg analyst James Seyffart remains skeptical about the SEC’s willingness to greenlight an Ethereum and said the amendment has not changed the base case for approval, which remains negative.\n\nHe added:\n\n“To be clear — I don’t think they *should* be denied. But at this point I think they will be.”\n\nMeanwhile, Zack Guzmán, a former Yahoo Finance reporter, suggested that Fidelity’s decision to add staking to its ETF application could either be a strategic move to align more closely with the SEC’s expectations or a potential point of contention that might complicate approval.\n\nAs the SEC reviews Fidelity’s amended Ethereum ETF application, the decision could set a precedent for future crypto ETFs, especially those seeking to incorporate staking or other native blockchain functionalities.\n\nThe outcome will be closely watched by investors, regulatory bodies, and the digital assets community, as it could mark a pivotal moment in integrating traditional financial products with the innovative features of digital assets.\n\nMentioned in this article"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPb1J4Wl81dEh0d2Jna29KUUNBX1BsSWJrbmtGUHFkUTMyY0d2QzVlMS12blpaelNCaWJwTEVEdVpZRUtaLWlkNGpDY2pjb2ppN0FIYWhSX2JZM2pBbEZ6NnlXcXhlUGF2T01jUEpiRkdOdkIxT2FlZ1NDbjJ2R1pVeTNXRHo5amlZc1FOMThFcnlzdEFQcVEzeA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Are Losing Ground Today - The Motley Fool",
        "content": "These three top tokens are seeing selling pressure build, as capital flows affect investor sentiment.\n\nToday's price action in the cryptocurrency world has been choppy, with many of the top tokens that investors watch closely seeing big declines over the past day. As of 3:30 p.m. ET on Tuesday, Bitcoin (BTC -0.63%), Ethereum (ETH -1.11%) and Dogecoin (DOGE -4.23%) had declined 3.9%, 4.9%, and 5.3%, respectively, over the past 24 hours.\n\nThese moves appear to be the result of a shifting narrative in the crypto world. With more investors now focused on the flow of funds into this asset class, more recognition is being placed on the supply and demand of capital flows into this sector.\n\nAccordingly, the capital inflows into spot Bitcoin ETFs, such as the Grayscale Bitcoin ETF (GBTC 1.49%), have become a much more pertinent focal point for Bitcoin and the entire sector in general.\n\nReports today that this particular spot Bitcoin ETF (and others) saw big capital outflows appear to be driving the majority of the move in these three top cryptos. The Grayscale ETF led the way lower, posting a $643 million outflow on Monday, with more expected to be reported today.\n\nLet's dive into this particular catalyst, as well as some other concerns that investors are pricing into Ethereum and Dogecoin right now.\n\nWhy the sentiment shift?\n\nCapital flows into spot ETFs aren't the only story, but they're the major one in the crypto space right now. With various spot Bitcoin ETFs such as Grayscale's seeing record inflows in such a short time, anticipation around a budding supply/demand dislocation in the Bitcoin market forced other speculative retail capital into the sector. For higher-risk assets such as Dogecoin, this led to what can only be described as a hype-driven rally.\n\nThere were also some recent comments from Elon Musk about potentially integrating Dogecoin further into the Tesla purchase ecosystem. We'll have to see whether that plays out or not, but it's clear that Dogecoin's primary purpose is to be a speculative trading vehicle for those willing to take abnormally large risks. In this market, that's worked out well for bulls.\n\nFor Ethereum, anticipation around pending deadlines for the Securities and Exchange Commission to review spot ETF applications from the likes of Grayscale and others continues to be a driving factor for this token.\n\nThat said, if capital outflows from spot Bitcoin ETFs continue, this catalyst could be moot. Thus, investors are undoubtedly going to get ahead of the catalyst by pricing-in expectations, and we'll likely see Ethereum trade somewhat in line with Bitcoin until a decision is handed down.\n\nWhere to go from here\n\nInvestors who decided to jump on the crypto bandwagon before this flood of speculative capital surged into the sector have certainly done well for themselves. And while we have seen some recent capital outflows from the likes of the Grayscale Bitcoin ETF and others, it's also true that these ETFs have assets under management that many thought they wouldn't at this point in the cycle. So, it's really a matter of perception right now with respect to how the Bitcoin market is finding its balance.\n\nFor Ethereum and Dogecoin, I expect to see similar correlation with Bitcoin for some time, until we see the impact of the upcoming Bitcoin halving and potential approvals of spot Ethereum ETFs. Until then, buckle your seat belts -- it's likely going to be a thrilling ride."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQdk8xbndIVHlwNkh3QUtDZ0NrREpoWHhNSWRoRWtpR1owUm1YZUZBdW5rb2RaRG5ueGpadWxSbWlhYXdyd1E0S1VRVzlDNDJtNmpGcHBvQ3hFNm1ZYzFBNkRucW9Cd2NqNjBlNkhtSjBoWWpUeEkyc2FCRkt0bWRLTmJXemk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Standard Chartered: ETH Could Hit $14,000 if ETF Gets Approval - Yahoo Finance",
        "content": "Standard Chartered: ETH Could Hit $14,000 if ETF Gets Approval\n\nStandard Chartered has predicted that Ethereum (ETH) could reach $8,000 by the end of this year and $14,000 by 2025. In a research note, the bank's analysts believe that the approval of spot Ethereum exchange-traded funds (ETFs) will be a major catalyst for the cryptocurrency's price.\n\n\"Ethereum is currently between two important events that we see driving price upside,\" wrote Geoffrey Kendrick, head of forex and crypto research at Standard Chartered. \"It has just had a structurally significant upgrade, and U.S. regulatory approval of ETH ETFs is expected in May.\"\n\nKendrick also noted that the network's recent Dencun upgrade could be another factor driving up the price of Ethereum. The upgrade is expected to make transaction fees on the blockchain much cheaper. Standard Chartered's prediction is in line with other bullish forecasts for Ethereum. In January, JPMorgan predicted that ETH could reach $5,000 by the end of the year.\n\nSeveral high-profile fund managers, including BlackRock and Fidelity, have filed with the Securities and Exchange Commission (SEC) to launch Ethereum ETFs. Standard Chartered expects the SEC to approve the ETFs by the summer."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOWm90Y0RGNzhmY29uMUxvTkR1Z19raUdvWWxiNllrTW53SFpMRmxUQXdUZjdNV0V1WkxKckdEQS0tUjdQM3pNY3BhYWgzUndOVlc1b2J5Mlp0bUpLY0gteWFnRTdpaXBrc1lzUmU0dzhLNHRRYkE2c0lkb1liNGJSb0hWUUlwZHp6T2NKVm9nUzBKZWgtUDJZeThxWngwNEpGaDFXQlEwUURMdHdqd3NtZnZzbEowQm03U3JrOTZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Enterprise Ethereum Alliance Announces New Leadership and Vision - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--The Enterprise Ethereum Alliance (EEA), the leading global community for enterprise blockchain, today announced the appointment of new leadership and a renewed vision for the future of the alliance at the intersection of the Ethereum ecosystem and enterprise. The announcement was made at the Momentum Event, an in-person gathering of EEA members, partners, and industry leaders, co-hosted by EEA, NYU, EY and Microsoft.\n\nThe Momentum Event kicked off with opening remarks by Yorke E Rhodes III, EEA Board Member for Microsoft, who introduced the event’s co-hosts and agenda. Rhodes expressed the goals for the convening, which showcased the latest developments and innovations in the Ethereum for enterprise blockchain space, as well as to foster collaboration and engagement among the EEA community.\n\nPaul Brody, EEA Board Member and EY Global Blockchain Leader, was announced as the new Chairperson, and Karen Scarbrough, EEA Alternate Board Member for Microsoft, as the new Executive Director. Vanessa Grellet is also joining as a new EEA Board Member.\n\nRhodes praised Paul, Karen and Vanessa for their expertise, vision, and dedication to the EEA and the enterprise blockchain industry.\n\n\"I am honored and excited to take on the role of Chairperson of the EEA, and to work with Karen and the rest of the board to lead the alliance into a new era of enterprise blockchain innovation,\" said Brody. \"The EEA has been a pioneer and a catalyst for the adoption and standardization of Ethereum-based solutions for enterprises, and I look forward to building on that legacy and expanding its reach and impact in the global market.\"\n\n\"As the new Executive Director of the EEA, I am thrilled to join forces with Paul and the EEA community to revitalize and energize the alliance and to deliver value and benefits to our members and partners,\" said Scarbrough. \"The EEA has a unique opportunity and responsibility to shape the future of enterprise blockchain, and to foster collaboration and interoperability among the diverse and dynamic ecosystem of Ethereum-based solutions. I invite everyone to join us and find a way to engage and contribute to the EEA and the enterprise blockchain movement.\"\n\n“I am excited to join the EEA Board to help bridge the gap between public blockchains and the enterprise world and drive adoption of blockchain applications in financial services and consumer use cases. The EVM ecosystem is open for business,” said Grellet. Vanessa will be sharing her perspective at the Digital Asset Summit and Pay 360 conference in London this week.\n\nBrody and Scarbrough also expressed excitement about the journey forward, given the recent surge of energy and interest in the enterprise blockchain space, driven by the second annual EEA Ethereum Business Readiness Report, the expected launch of several Ethereum-based exchange-traded funds (ETFs), and the growing demand for tokenization and decentralized finance (DeFi) solutions among enterprises.\n\nThe Momentum Event continued with a series of presentations, panels, and workshops, featuring EEA members, partners, and industry experts. They shared their insights, experiences, and best practices on various topics related to enterprise blockchain, such as scalability, privacy, security, governance, compliance, interoperability, use cases, and business models.\n\nAbout the EEA\n\nThe EEA is the industry's leading global community for enterprise blockchain working with an open, standards-based architecture and specification to accelerate the adoption of Enterprise Ethereum. The EEA's world-class team brings clarity to enterprises across an ecosystem of multiple vendors of choice and many innovative startups. For additional information about joining the EEA, please reach out to membership@entethalliance.org or visit https://entethalliance.org/become-a-member/\n\nFor more information about the EEA Momentum Event please visit: https://lu.ma/6ts0ta1l\n\nFor more information about the upcoming EEA Career Day please visit: https://lu.ma/rxnj8ye5"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQdGhPYTMzaDROQ0hsc2Nqc3JYTTBQRk1lTzNPaEM5Qlk1ekJtZlpFNXBaNHA1YzNXOGx4RU9ibUtyM2hkbHUzLVUwR1NFd3MtZ2JMMDh3cFVyOUpmLTlEODREdDY1dWlNUWVSMi1zUExTdUFreENodWxnSVVtMjkzM21GVG00bkJNMTZPY1hJOHlwU0J1TW1keG9Hd0o2REhuVGJxWFlyVnlDaVlEZ0JnTFZCWGUwT2VORTNoRTln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Cryptocurrency Market News: Bitcoin and Ether Prices Fall After Dencun Upgrade - Investopedia",
        "content": "Key Takeaways Bitcoin hit another high to start last week, but ended it sharply lower.\n\nFees on various Ethereum Layer 2 networks fell dramatically last week after the Dencun upgrade, but ether prices also declined.\n\nGovernment prosecutors in the trial against Sam Bankman-Fried recommended up to 50 years in prison for the former FTX CEO.\n\nDigital asset manager Grayscale filed for a second bitcoin exchange-traded fund (ETF), to use the BTC ticker.\n\nThis week, analysts are tracking the inflows into bitcoin ETFs, and the numbers from March already have dwarfed those from January and February.\n\nWhat Happened in Crypto Markets Last Week?\n\nLast week proved to be a roller-coaster ride for bitcoin (BTC) investors, as the largest cryptocurrency by market capitalization topped another lifetime high of $73,000 to start the week but fell below the $65,000 mark by Sunday after a sell-off. Ethereum's Dencun upgrade fulfilled its intended goal by lowering fees on various Layer 2 networks but ether (ETH) prices also weakened at the end of the week.\n\nElsewhere, prosecutors recommended that former FTX Chief Executive Officer (CEO) Sam Bankman-Fried receive up to 50 years in prison for charges related to fraud and money laundering. Additionally, digital asset manager Grayscale Investments has filed for a second spot bitcoin ETF in an effort to offer lower its management fees.\n\nDencun Upgrade Leads to Lower Fees on Ethereum Layer 2 Networks\n\nFollowing the Dencun upgrade on Ethereum's mainnet on March 13, Ethereum Layer 2 (L2) protocols have experienced a remarkable reduction in transaction fees, with some protocols slashing fees by as much as 99%. Dencun, hailed as a pivotal scalability-focused upgrade, is being called one of Ethereum's most significant advancements since The Merge.\n\nProminent L2 protocols have marked an impressive 99% decrease in gas fees post-upgrade, with current fees for some like Starknet plummeting to 2.7 cents. The introduction of data blobs through EIP-484 during the Dencun hard fork has improved transaction data processing, offering faster and more cost-effective transactions for L2s.\n\n\n\nProsecutors Recommend Up to 50 Years for Former FTX CEO Bankman-Fried\n\nFederal prosecutors are advocating for a substantial sentence of up to 50 years for the disgraced cryptocurrency prodigy Sam Bankman-Fried, according to court documents unveiled on Friday. Bankman-Fried, the former CEO and co-founder of the failed cryptocurrency exchange FTX, was convicted of multiple criminal charges including wire fraud and money laundering.\n\nThe prosecution contends that his actions warrant a sentence commensurate with the scale of his offenses, emphasizing the necessity for justice in the face of widespread harm and flagrant disregard for the law. As the March 28 sentencing date approaches, the severity of the recommended punishment stands in stark contrast to the comparatively lenient request put forth by Bankman-Fried's legal team.\n\nGrayscale Files for New Bitcoin ETF with BTC Ticker\n\nDigital asset manager Grayscale Investments made headlines last Tuesday by filing for a spin-off of its Grayscale Bitcoin Trust (GBTC), a move aimed at providing investors with more cost-effective exposure to bitcoin.\n\nThe spin-off, designed to reduce fees associated with GBTC, comes in response to investors' preference for lower-cost alternatives, particularly as GBTC's fees have been comparatively higher than its competitors'. Grayscale plans to introduce the Grayscale Bitcoin Mini Trust—which will hold a portion of the bitcoin currently held by GBTC—with existing GBTC shareholders receiving shares in the Mini Trust in exchange.\n\nDespite bitcoin's surge to record highs, GBTC has experienced significant capital outflows of more than $11 billion since January, versus inflows at competing ETFs such as BlackRock's iShares Bitcoin ETF (IBIT) and Fidelity Wise Origin Bitcoin Fund (FBTC). While Grayscale has yet to finalize the fees for the Mini Trust, the spin-off signals a strategic move toward independent operation for both GBTC and the Mini Trust after regulatory approval earlier this year, marking a significant development in the evolving landscape of bitcoin investment opportunities.\n\nWhat To Expect in The Markets This Week\n\nSpot bitcoin ETF volumes in March already are much larger than they were in January and February. In addition, BlackRock has accumulated more than 230,000 bitcoin via its IBIT offering. That said, inflows appear to be slowing after peaking at more than $1 billion on March 12, according to data from Farside Investors. This week, analysts will be watching to see if inflows into these ETFs continue to slide."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPNUtfNUZSb195b0F0UUVYcDZ3aGhOa3N5bkY4dlloSnMxajVEWlh0ZDNEWkpJMTBmdksxajVMLW95VjMzUmtJUTJDVzF3UEpIYXRFLWlINi1LLWhYXzNydGtrY215SEhaUXdVd0pNVWtlTTBDWk5paXpXZ0g4ek5tT2VqdHJLeWNwTXlBYVVnY3NfZk0tVWNVNlJrSDJXeWMxbS1iWndXc3owRngxNk9lLUcxRzVRYzNFMDVGWmhza1LSAcYBQVVfeXFMTjQxUlpjMGFVcmlRYzl6bFJJOFZZYnAwR3Rnd2FiS3U1NjR2RmxVdnFmTVNrOGkwNGozTnhPRFNaTDRZM25EQ3hwWVYxaFlqaWdGY3RZSVVkeTJsS0JJVVpIdVRMajFKVzRFSlZuZkJkN3prZHp4NUV6Vm8xc0czZGhJTlBjSlc1dXhaS0E2RGdsZVh0ZVVOMmdkck01c19Bb1lnR3ZJSTBFbWZQSlNhdkNqeTNMZVVvQ2dUdFhOc2VNZmZISHVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price plummets as large investors take profits - FXStreet",
        "content": "Ethereum’s price loses nearly 7% on the daily time frame, adding to the almost 20% weekly decline.\n\nThree Ethereum whales sold $95 million in Ether, taking nearly $40 million in gains since Friday.\n\nETH price could sweep the $2,900 level for liquidity before attempting a rebound.\n\nEthereum (ETH), the second-largest crypto asset by market capitalization, is currently in a state of decline. ETH price is down 7% on the day and almost 20% on the week, wiping out recent gains. On-chain data insights reveal that large-wallet investors, popularly known as whales, are shedding their Ethereum holdings and taking profits, increasing the selling pressure on ETH.\n\nAlso read: Grayscale amends Spot Ethereum ETF filing, ETH trades sideways below $3,700\n\nEthereum price crumbles under rising selling pressure\n\nData from crypto intelligence tracker Spotonchain shows that three large-wallet investors have taken profits on their Ethereum holdings in the past four days. The three Ethereum whales sold 26,946 Ether, worth $95.7 million, and took $39 million in profits. The transactions took place on Binance between March 15 and 19.\n\nAs whales shed their Ether, the altcoin’s supply on exchanges has increased. Between March 15 and 19, ETH reserves on exchanges are up from 13.92 million to 14.43 million. An increase in supply on exchanges implies there is a higher volume of Ether available to sell.\n\nAs seen in the Santiment chart below, Ethereum price declined alongside this supply increase, supporting the thesis that profit-taking has partly driven the drop in Ether’s price.\n\nSupply on Exchanges. Sources: Santiment\n\nEthereum price could sweep $2,900\n\nEthereum price is strongly correlated to Bitcoin. Therefore, the price decline seen in BTC likely helped Ethereum’s price to drop as well alongside factors like profit taking and whale activity.\n\nETH price is on the verge of dipping into the range between $2,717 and $3,200, represented by the Fair Value Gap (FVG) on its monthly chart. Once the altcoin collects liquidity in this zone, its price could rebound towards resistance at $3,500 (represented by R1 in the chart below).\n\nThe ETH/USDT 1-day chart shows that bears are taking over as the Moving Average Convergence/Divergence indicator flashes red bars. The Relative Strength Index (RSI) is at 42.05, close to the neutral zone, meaning ETH is not currently oversold. Should the RSI for ETH drop into the oversold zone, it would give a buy signal for sidelined buyers to step in.\n\n\n\nETH/USDT 1-day chart\n\nA daily candlestick close below $3,200 (the upper boundary of FVG) would result in a steeper correction that could send ETH price towards support at $2,166."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQUjZJeG1pNlBnWk1kUGVQaUVKSDZsSmp4Z3pXVUtYbGQyX2pqYTlxa1dYd3ZaUGZYeVplVlBPS1JoNU0zZ2dOU2NGZHlsRUkwWndOWGpfNmYySVpVUnRvdkFGTURCeVhTc0xJN29valdmckYzV1pOalRHcWwxRXlSYjd2aXFTR2RKMDNPUEU1c3I1ZmRULWR1b1hmeVpSc3hFbll0RmN2QWNvcjNXRFlmbXppWHBxeFN00gG-AUFVX3lxTFBicGYzVWRBbUJOMlhrUjZWVjgweDRqZ2drZzFEeS0xeWk3RklEZlVBbTVubzlNbzJacDJWOW0zVTNuYWZlMExRT3ZWMW9VSzQ4a3NSUGFJSW8yLWYzbFZPaXVlT1lTZVlyN2RxdHE5U05BUXZTSXpVSHBZcmFNSTFlcm5taHFjOEZyeXA5Qjc3ekVXamNuR0VaZTRNY0hEOU5KMkV4NGhKQ2Nlb2xHNm9pZUJtTUpKNG9xZzRoNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana Meme Coin Slerf Clocks Higher Trading Volume Than All of Ethereum - CoinDesk",
        "content": "SLERF came into existence following a token presale , during which it raised $10 million from users. It quickly went viral on social platform X after its developer said they accidentally sent all the money raised to a burn address, a crypto wallet address that’s not controlled by anyone, thus losing access to the funds."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOdWpRXzU1SlFveHJWMDkwRUwwblhTc3E0Q2Z1QjVDTnprTGdON0toRzFaNTJuLTlUM2FsTUI5YjQ0V2o0eHpIRjY2ZGpGX2JKSGNBbXdDMmd2SG5JZi10OGJ6MGUyV1YwZzlpVFM2eG1Cc1haeWxiN181akE0M2JqV3pWTjlDaGtwb1lXNXkyQmdtX211Znd6cml0LUU4bnBYQ0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "The decline of the supply: analysis of Ethereum price activity - The Cryptonomist",
        "content": "The price activity of Ethereum is reducing the supply of the crypto to the lowest levels recorded since August 2022. Furthermore, the decline in ether supply has marked its fastest decrease since May 2023.\n\nAt the same time, several on-chain metrics are approaching or even reaching new twelve-month highs. Let’s see all the details below.\n\nThe rapid decline in Ethereum supply and price trends\n\nAs we know, the latest Dencun update of Ethereum was implemented on March 13th.\n\nHowever, it was the previous major update that significantly impacted the total availability of ether.\n\nMid last week, the total amount of ether dropped to the lowest level recorded since August 2022, as indicated by data provided by CryptoQuant and reported by CNBC.\n\nIt is precisely during that period that Ethereum introduced its most significant upgrade to date, moving from proof-of-work to proof-of-stake, known as The Merge.\n\nFurthermore, the rate of decrease in the supply of ether is currently the fastest since the beginning of May 2023.\n\nIn the recent 30 days, the supply of ether has decreased at an annual rate of 0.872%, according to data from ultrasound.money. For comparison, since the Merge itself, the rate of decrease has been 0.246%.\n\nJulio Moreno, head of research at CryptoQuant, highlighted that the high activity on the Ethereum network has led to high transaction costs and, consequently, to a greater amount of ether being burned.\n\nIn concrete terms, over 1.56 million ether have been burned by the Merge, while less than 1.12 million ether have been issued.\n\nThis has caused a sharp decrease of over 446,000 ether, equivalent to almost 1.62 billion dollars at current prices.\n\nActivity record and on-chain transparency\n\nAlthough the focus is mainly on activity on the Solana network, the Ethereum ecosystem continues to show distinctive signs of vitality.\n\nA seven-day moving average of transactions on Ethereum is approaching its annual peak recorded in January, with 1.26 million transactions recorded just yesterday, according to recent data.\n\nJulio Moreno highlighted that “total daily transactions are at record levels, not seen since May 2023”, pointing out an increase in network fees, an increase in burned fees, and a reduction in the total supply of ether.\n\nAt the same time, the number of active addresses on Ethereum is at its highest since the beginning of the year and for the past 12 months, with approximately 540,000 active addresses registered just yesterday.\n\nFurthermore, the number of new addresses on the Ethereum network is also at its highest since the beginning of the year and for the past 12 months, with more than 120,000 new Ethereum addresses.\n\nFinally, the on-chain volume of Ethereum has reached new highs since the beginning of the year and for the past 12 months, with over $7 billion in volume recorded just yesterday, according to data from The Block.\n\nBearish correction for Ethereum: potential recovery towards $4,000?\n\nThe price of Ethereum has started a correction lower below $3,650, but is currently attempting a decent recovery wave in the short term.\n\nThe correction of Ethereum has crossed the levels of $3,800 and $3,700, following Bitcoin, and then dropped below the key support at $3,650, entering a temporary bearish phase.\n\nThe price has even exceeded the critical threshold of $3,500, touching a minimum of 3,414 dollars, but now shows signs of recovery. Ether has recovered above 3,500 dollars and the Fibonacci retracement of 23.6% from its high to low.\n\nCurrently, the price of Ethereum is below $3,700 and the 100-hour simple moving average, with immediate resistance around $3,650 and a clear downtrend line at $3,660.\n\nFuture prospects indicate a possible recovery towards $3,750 or a 50% Fibonacci retracement at $3,830, beyond which it could gain momentum towards $3,925 and, eventually, $4,000."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTERxbXVmemRfVnVSejRrUVA5UDJYRmZLUVlsQUZKNHBaR1VXYm9DUlRQNnhmaDV3REh6cnhPTHJHb0hmV25JNk1Ua2MwbW10N2lwc1c1dDc4NFE0TkxyNUwtM0xSTlNCdWROVWJkb0E4b2NhVDhleGxESGlOYWtUUlRjMjFxYklGR1k2VVYtS0dYNnVh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Digital Asset Fund Backed by $100M on Ethereum - Watcher Guru",
        "content": "Asset management company BlackRock is launching a tokenized digital asset fund, a new SEC filing on Tuesday shows. In turn, BlackRock seeded the fund by depositing $100 million in USDC stablecoin on the Ethereum Network.\n\nJUST IN: BlackRock launches digital asset fund and deposits $100 million $USDC on the Ethereum network. — Watcher.Guru (@WatcherGuru) March 19, 2024\n\nThe BlackRock USD Institutional Digital Liquidity Fund was incorporated in the British Virgin Islands and will be launched in partnership with Securitize, a tokenization firm. According to wallet data from Etherscan, BlackRock deposited Circle’s USDC stablecoin into a wallet on the Ethereum Network.\n\nBlackRock is continuing its journey into the digital asset industry following its Spot Bitcoin ETF launch earlier this year. The company’s Bitcoin ETF has been one of the best-performing Bitcoin products out of the field of new launches in 2024. Additionally, BlackRock also has a pending application for a spot Ethereum ETHER (ETH) ETF, which the SEC is putting off approval of.\n\nMANHATTAN, NEW YORK, UNITED STATES – 2021/05/25: BlackRock offices in New York City. Founded in 1988, BlackRock, Inc. is an US multinational investment management corporation. The corporation is the world’s largest asset manager, with $8.67 trillion in assets under management as of January 2021. (Photo by Erik McGregor/LightRocket via Getty Images)\n\nBlackRock Continues Its Mission For Tokenization\n\nIn a January interview with CNBC, BlackRock CEO Larry Fink said that BTC and ETH ETFs “are just stepping stones towards tokenization, and I really do believe this is where we’re going to be going.” Now, we are seeing the asset manager shift towards tokenization with a major step.\n\nAlso Read: Solana (SOL) Market Cap Predicted to Reach $1 Trillion\n\nFurthermore, BlackRock’s digital asset fund also represents a major milestone for the tokenization of real-world assets. Tokenization is a growing sector in the intersection of digital assets and traditional finance. It involves placing traditional assets on blockchain rails in pursuit of faster settlements and higher efficiency."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9LRy1PcjZhQml1clN4VFFlTVQzX1hhUXJxV3Q3TDNFNmNmRUZOYXdPb2o0Nmt1X1FWdzhlUjhPX0FsYzhjTTM4aDVJRm5VMDVPOV9TSTlJdmIzZFNuZXhCYlE3UTBGRGJQaG5vanBzNNIBdEFVX3lxTFBLenNwbl8yTTFDV1JBcjRGSWFzQmdyZFVhOWxBbjF0b2JRbG1CTTdEZE41WlVoek1XMUp0N01INHFIVm5Scm1FekF6b0RoWUVyR2xyWGtVakR0eGlZTjcyOU1SV19pb1E0WUc3LVBqMWpUbDI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Fidelity's Ethereum ETF Offering Gets Amendment - U.Today",
        "content": "Advertisement\n\nFinancial behemoth Fidelity has submitted an amended Ethereum (ETH) exchange-traded fund (ETF) proposal, adding staking to its application.\n\nAccording to the filing, it would be possible to stake a portion of the fund's assets with the help of a trusted staking provider.\n\nSimilarities with Bitcoin ETFs\n\nThe amended filing references the approval of multiple approvals of spot Bitcoin ETFs. The financial giant argues that it makes sense to greenlight the same product for the largest altcoin due to the high correlation between Ethereum and Bitcoin futures issued by CME.\n\nSince the SEC expects the CME's surveillance to be useful for assisting in detecting possible instances of fraudulent and manipulative practices, Fidelity claims that the same rationale should be applied to spot Ethereum ETFs.\n\nAdvertisement\n\nIt is worth mentioning that Fidelity's Bitcoin ETF has managed to end up among the most popular ETFs of this year so far after attracting almost $7 billion since its launch in January.\n\nIt occupied the top spots alongside BlackRock's Bitcoin ETF, which continues to shatter records.\n\nLow approval odds, high price targets\n\nAs reported by U.Today, Standard Chartered recently made a stunning prediction about the Ethereum price potentially reaching the pie-in-the-sky $8,000 target if the SEC were to approve a spot Ethereum ETF this May.\n\nHowever, such a scenario remains unlikely according to various experts. Political pressure appears to be the main impediment as of now, with the SEC facing some backlash in Congress following the success of spot Bitcoin ETFs.\n\nThere are varying opinions about the possible impact of a spot Ethereum ETF. Investment firm VanEck, for instance, believes that a spot ETF could end up being an even bigger deal than similar Bitcoin products. However, Eric Balchunas, a senior Bloomberg analyst, recently downplayed the impact of such an ETF, comparing it to an opening act trying to follow a headliner."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOYzRLRTJhcy1aSkZZT2tfaVFBZ1lNNXFEUTZnTlNvNGlrUzduXzZFYlQ1ODR2ZEI0eWswd2JOYjlCNVN1Um5nbEJzem4taXVMNWhldDl5amh5X29lY2VIOVdaaGZnOHdtNUxZakcyc0R1dWE3NklPWktfMHZvdXlyVV9pNVl1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Slumps Below $3400: Can ETH Hit $4000 This Week? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, surpassing $4,000. However, the coin has since experienced a decrease in value along with the broader cryptocurrency market. As of press time, ETH is trading at $3,391, which represents a 6.1% decrease in the last 24 hours. Despite this recent decline, ETH remains up by 89% year-to-date and is still the second-largest cryptocurrency by market capitalization.\n\nAlso read: Cryptocurrency: Top 3 Coins That Could Hit ATH In The Coming Week\n\nEthereum Price Prediction for the week\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for the week. According to their analysis, ETH is expected to reach a minimum price of $3,637 and a maximum price of $3,726. The average price is expected to be $3,680.\n\nThe recent surge in Ethereum’s price has been largely attributed to the growing expectations of ETH exchange-traded fund (ETF) approval. However, the current market sentiment, coupled with Bitcoin’s struggle to push further highs, has dampened the likelihood of ETH surpassing the $4,000 mark this week.\n\nAlso read: Can Shiba Inu (SHIB) Hit $0.00005 This Week?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks.\n\nWhile the recent drop in Ethereum’s price following the Dencun upgrade may be disappointing for some investors, it is essential to view the cryptocurrency market’s volatility in the context of its long-term potential.\n\nAlso read: Solana Breaches $200, But Analyst Warns Investors To Stay Out of SOL\n\nEthereum’s fundamental strengths, including its large developer community, robust ecosystem, and commitment to sustainability, position it well for future growth and adoption."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPR2FnOHFQZWFVWUNrVFNuNUUwWFNTTkFaSHNtWnd0b1ZZeUhZb1pmT2RDck8zQXhTTnRsa29lcmQxVGZxcTRwNk1DMkloQ2dwUE50a0dtWEhYUXhjMnoza1JFNjdmb1l1ZjBJa0xRWWFZd0RkMG5hOHZjd3FSQ1BhQ3BSMU9xWmdKSjVfNlBveFpfYjc1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum will become the backbone of a new financial system - Yahoo Finance UK",
        "content": "Looking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called 'Layer 2s.'\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nWhen cars first started to appear in the 19th century, they were a truly ridiculous sight. Clunky, noisy and big, it was hard to imagine for most contemporaries that these machines would ever be good for anything. Worst of all? There just was not much use for them. After all, most roads were not in a state to support cars. Fast forward 100 years and the picture had changed.\n\nLooking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called ‘Layer 2s.’ While the upgrade itself was a major milestone, it also shows that the Ethereum roadmap is progressing towards scalability, security and decentralisation. In the public perception of many, blockchains may live somewhere between memecoin gambling and vaporware. This is similar to how cars were seen before the advent of infrastructure designed to support them. But some of the best computer scientists and cryptographers in the world are busy building these roads.\n\nLooking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called 'Layer 2s.'\n\nThe endgame for blockchains seems to be a so-called modular approach: different Layer 2s with their own setups provide varying degrees of speed and decentralisation. Corporations might gather around ‘permissioned’ Layer 2s where participants have to go through KYC. Specific applications that require large throughput might use their own Layer 3, a so-called ‘app-chain.’ Ethereum’s Market Cap of close to $500 billion provides substantial economic security for this ecosystem. It will also be built around Ethereum’s ethos of credible neutrality and permissionless-ness at Layer 1. Eventually, the ability to have finance ‘natively’ built into the digital world will allow use-cases that we cannot even imagine today. From machine-to-machine payments, a more equitable global financial system and hundred times lower cost of trade finance and cross-border payments, the transition to blockchain-based finance will happen slowly, then suddenly.\n\nThe main challenge on the way is to ensure that all these blockchain ‘modules’ keep the main benefits of the system. These are the shared liquidity that enables financial use-cases on a large scale. It is also the composability that allows programmers to connect with applications across all platforms. But as Dencun’s successful launch shows once again, Ethereum is quietly executing on its roadmap."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNQ2EwbUtFWWgwd1FEV0dVbmhxRkJ0RWdWMDF3eEE4MWZlcTB0dlZLM2JwVFdQY29ldGlFNDlwOE9RdkF1clV5SEh6akpEcXFsWjFTUmFrU3dCRW5wNjRhczdCVFhyN09PNXZhZlZ3djNjRVVvT2ZUM09NMVQ1eVZ2a25Jb0YwZzhFaTZQcTV6RnJmREw4RGhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "This layer 2 is the biggest winner from Ethereum’s Dencun upgrade so far - DLNews",
        "content": "Base's user metrics soared following the Dencun upgrade, achieving record low transaction costs and an all-time high of 855,000 daily active users.\n\nThe upgrade slashed Base transaction fees by 99.9% from the fees on Ethereum.\n\nThe upcoming Coinbase smart wallet may further boost Base's growth by making it easier for users to gain access to decentralised apps and assets.\n\nUser metrics on Base, an Ethereum layer 2 network that was incubated by centralised crypto exchange Coinbase, have surged since Ethereum’s Dencun upgrade went live on March 13, lowering transaction fees on layer 2 networks by as much as 98%.\n\nDencun was a series of nine different Ethereum Improvement Proposals, or EIPs. The most important was EIP-4844, which dramatically cuts the cost of transacting on layer 2 networks.\n\nEIP-4844 introduced “blobs,” which are a unique transaction format that segregates layer 2 network transactions from standard network activity on the Ethereum mainnet, reducing congestion and transaction fees.\n\nThanks to Dencun, the median transaction cost on Base hit the lowest level of any layer 2 network. The cost to swap on popular decentralised exchange Uniswap now costs only $0.0018, and the cost to transfer Ether between wallets is only $0.004.\n\nMedian gas price to perform different transaction types on top layer 2 blockchains (GasFees.io)\n\nA swap on Base is now 99.9% cheaper than it is on Ethereum, and it’s 98% cheaper than it is on Arbitrum, the largest layer 2 network by total value locked,\n\nUser metrics on Base surged following the upgrade, most notably, on March 16, when the number of daily active users hit an all-time high of more than 855,000.\n\nDaily active users on Base (Dune: Watermeloncrypto)\n\nThe number of transactions in a single day hit an all-time high of more than 2.1 million on March 16, and as of today, there is $709 million of crypto assets deposited on the blockchain, another all-time high.\n\nThis makes Base the 11th-largest blockchain in terms of total value of crypto assets deposited and the fourth-largest Ethereum rollup.\n\nJoin the community to get our latest stories and updates\n\nAerodrome, a decentralised exchange, is the top protocol on Base by total value of crypto assets deposited, with over $310 million deposited and $482 million in weekly volume, both all-time highs. The native token, AERO, is up 19% in the last seven days.\n\nCoinbase’s new wallet\n\nStill, some users think that Base has even more room to grow because of the release of the Coinbase smart wallet.\n\nJesse Pollack, founder of Base, introduced the wallet to social media on March 1, saying it is the last piece to bringing billions of people onchain.\n\nThe wallet is still in a testing phase, but once it is live, it will enable traders on Coinbase to use their Coinbase balance to trade onchain.\n\nThat would significantly enhance the user experience for Coinbase users, because they would be able to access decentralised apps, tokens, and NFTs that aren’t available on the centralised exchange without having to use different wallet apps.\n\nFor protocols, once the wallet is released, it potentially opens the door to an influx of new users who may have not conducted transactions onchain before.\n\nGiven the close ties between Base and Coinbase, some believe Base will be the biggest beneficiary of this new change.\n\nGot a tip about DeFi? Reach out at ryan@dlnews.com."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPTUpJSzJ1N0dMdHEtVnNmLVFNWWtXYmJwVTlZbTRXLTNrdkh6TzJYWHY5bDBEbEZtNmhyTkhaMzNMWG90aDFtekxFcFlIcFdxb0VNSzF6MlJyVGJFMnJVNExIRGtRS2xCbEV6dWxQcFZzTG5MTDJjYTJRTW1GSUlpZHhHQXhWZ0VUMkhZeTBDNDZuMHdUTE9ES1RvSDltYWdZb2hNajlvT2owcUHSAbABQVVfeXFMTTl1dWUtaDBYSWFiMEJjbDd6a21ldFpaRG0tbnFHZEdMaHJ2MWxiZjdhM2hCaHJobk1pWF81NC00bjJXa3FDYWxCMTFFclMxTHFDbkpfRGVIeFRoX1BFNzctd1d0WXU3d2xjODhkaW5RTy1RVVJaUExfR2ZvUndyeTh1b0VlbHo5Rm9Zd1FoaHVqc0I2Z1hJUnNva1dIRGw5SUJ4U3FiS3ZyU2NqWEotSFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin Rebounds But Concerns Mount as Ethereum’s Perpetual Funding Turns Negative - CryptoPotato",
        "content": "Over the past weekend, the crypto market experienced a tumultuous blend of emotions, characterized by fear and greed, as Bitcoin plunged to lows of 64,500. However, it swiftly rebounded, with the leading asset surging back above the 67,000 mark.\n\nWhile Bitcoin has exhibited significant resilience, the same cannot be said for Ethereum.\n\nEthereum’s Rocky Road Amidst Bitcoin’s Resilience\n\nThe heavy selling of BTC put options indicated a dissipation of fear among investors, who seemed eager to capitalize on the dip.\n\nInterestingly, amidst this sentiment shift, there’s a notable inclination towards greed, evidenced by the increasing interest in long-dated Sep and Dec BTC calls targeting lofty price levels of $100-150k. According to the latest analysis by QCP Capital, this optimism reflects a bullish outlook despite recent volatility.\n\nThe Singapore-based digital assets trading firm said Ethereum presents a contrasting narrative as concerns loom as perpetual funding rates turn negative and risk reversals portray a “downside skew,” signaling apprehension within the market about a potential downturn in the crypto asset’s price despite the continuing rally in alts.\n\nDespite Ethereum reaching a peak of over $4,000, its highest value in two 3years, QCP previously observed a change in market sentiment, evident in the negative risk reversals. These reversals indicate the contrast in implied volatility between call and put options, a shift likely attributed to the decreased chances of a spot Ethereum ETF approval in the US in the near future.\n\nFollowing the long-awaited Dencun upgrade, which QCP had anticipated, the crypto asset saw a decline to under $3,500 over the weekend amid a market-wide slump.\n\nIs Ether Overvalued?\n\nA different analysis by CryptoQuant revealed that ETH’s total supply is diminishing as a result of heightened network activity and the utilization of transaction fees for burning. The subsequent uptick in staking participation was also observed, with over 31 million ETH staked, indicating growing confidence in the asset’s long-term prospects.\n\nIts network also witnessed a notable surge in activity, characterized by increased daily transaction volumes and ETH transfers. However, the current elevated MVRV Ratio implied that ETH might be overvalued.\n\n“The current high MVRV Ratio suggests that ETH might be overvalued, which calls for a cautiously optimistic approach. Despite these challenges, the Dencun upgrade reinforces Ethereum’s strong fundamentals. Yet, the market’s recent preference for SOL over ETH signals that we might see some adjustments ahead.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPcGRqV2U3VDJYa3VsWW42X3JyVjFmYzRLV3hOUWJXVXpIQVJnVENWSDY0X3RhOHh3cjNWOF9tbl9yU0xPdmZPRk40M3REXzdlWXVKb3F1dkxFY0hjOHVrZDQtTHFXRlhpR0M4RnBQR3k0UTRXN3cwb1FYaEltTUpfUVBKSHo5bDMwNjBYMEpqNjJmSmlubW92R0VWNFNUV2ZxaktENkh3Xzh2UzJFSzF4Nk5Sb9IBuAFBVV95cUxOdjVIaFRpejZLaVRYeFE0YzIyQU1Kd0thellVaFc4dzB6c2lvWDFPSVRvbWJDVko4QlQ5eU5hb3gxeEFTaVEwR2ZISldPWVg3bG9nRWFLTVQ2VWY3UzdqY240Y0lZU29VUkVTMEVOVHlOWVlhQkVmVFJ1XzlhaHdvNlNuTXpqTi1hc0dPamtya3BzWUl1N1BpMUd1c242ZVhXdzg0aGR5TDRNSHpaWTlwN01tR0tvdVBa?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Plummets Below Crucial Levels, XRP on Verge of Catastrophe, Solana (SOL) Is Only Bullish Asset on Market - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe cryptocurrency market is in a problematic state, with key players Ethereum and Ripple facing significant downtrends, while Solana emerges as a beacon of bullish momentum. This divergence in performance offers insights into the current market sentiment and potential future movements.\n\nEthereum has recently slipped below critical support levels, challenging the resilience of the bullish structure established over the preceding months. After reaching all-time highs, ETH has encountered substantial selling pressure, leading to a stark retraction in price.\n\nCurrently grappling with the $3,500 level, Ethereum's next significant support lies around the $3,300 mark, closely aligned with the 200-day moving average. If Ethereum fails to reclaim its position above this threshold, the asset could see further losses, potentially testing the $3,000 psychological level.\n\nResistance for Ethereum is now forming at $3,800, where the asset must break through to reverse the prevailing bearish sentiment. The volume profile shows thinning out at higher prices, which could facilitate a more rapid recovery if buying pressure increases.\n\nAdvertisement\n\nXRP's precarious position\n\nXRP's situation appears even more tenuous as it teeters on the edge of what some analysts are calling a catastrophe. After enduring a series of legal battles that have left investors wary, XRP is struggling to maintain support at the $0.58 level. A breach below this could trigger a sell-off, driving prices toward the next support at $0.50. On the resistance front, XRP faces a hurdle at $0.65, where previous attempts to rally were quashed by bears.\n\nThe moving averages on XRP's chart are converging, which could either signify consolidation before an upward move or prelude further declines if the price action remains negative. Traders are closely monitoring the $0.60 level, as a sustained closing below this could signal a bearish trend in the making.\n\nSolana's bullish outlier\n\nContrasting sharply with its counterparts, Solana stands out as the market's bullish outlier. Amid the market correction, SOL has been charting an impressive upward trajectory. With local support established at $150, Solana's price action suggests a strong buy-in from investors at these levels. The immediate resistance lies at $190, and a breakout above this could set SOL on a path to retest its recent highs.\n\nSolana's ascent is underpinned by robust on-chain metrics, indicating growing adoption and a healthy ecosystem. The price has been consistently finding higher lows, a bullish indicator in technical analysis. Furthermore, the RSI for SOL is now approaching overbought territory, signaling strong buying momentum that could sustain further price increases.\n\nCurrent sentiment in nutshell\n\nThe divergence in performance among these three assets is a reflection of broader market sentiment. While Ethereum and XRP suffer from bearish pressures, Solana's strength is indicative of the market's appetite for risk and volatility. This sentiment is compounded by the move toward NFTs, DeFi and other blockchain applications, areas where Solana has established a competitive edge.\n\nAs Ethereum and XRP navigate turbulent waters, Solana's relative stability could be a sign of the market's shifting priorities. However, the interconnected nature of the cryptocurrency market means that a reversal in the fortunes of larger assets like ETH could have cascading effects on the entire ecosystem, including SOL.\n\nHistorically, when Ethereum has led a market rally, many alternative coins have followed suit. However, the decoupling of Solana's performance from Ethereum's suggests that the market is starting to differentiate between blockchain projects based on the amount of risk those can offer instead of fundamental value.\n\nWhile Ethereum and XRP are showing signs of struggle, they also present opportunities for high-risk, high-reward strategies, should the market conditions shift favorably. Solana's resilience and bullish momentum position it as a hedge against the volatility of its larger counterparts."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNakRwYnZUWF9VWnZaMGoxaldET3hHN19ldEFZeWVTSWxRbG1HQkFMVE45ZHlJRzRqdmVVUURYQ3NHVHdHR1dSeVI1c3NpVnJXSXVDc2Z3bmJfWEVSdnpoeFlxZExfbzdacmRrVVhQLWpEUkVaVHZ6b0VjTXBQLXlKR1IwNWVjSVVCN0lpVDZ3Rjc3TlJRdDctbUdfdUM2dTFjUl90RTdiU3BKdFc3ZTdZUUJWRHFxa0dOSmtUSnVyV25ZSEt4azhsaFNUcGNvcTNRYV9xd2JsNNIB3AFBVV95cUxPV19LZkZZYVZGOXBpZDlRV1JyVklfZ0ozNHNyVmo3TkZva0oyczY1RkFxemFjb0NqNWxyOEZ3ZVctZXV2d1VobUExaDk3LTFlYmFodWtiRkNxUjEyNDNCaUlPOUE1eWpBYVZ3ay1uN3d2RXFZTW1BcndpMUhOeHAzNmVReTJfaXZXa0hVa3piRXZxa0F4UWNIdi1BWlZXWEtmUWlrekRzWFdJVTJZN1VIdThJYTR6V0UzNXdERjZRN0NGal9mM0ZXWnJZdkRxbktWTm1VR3FPS2dSejda?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC stuck under $65K ahead of FOMC - FXStreet",
        "content": "Bitcoin price could make a 12% drop to the weekly imbalance zone before reclaiming its ATH.\n\nEthereum price likely to drop 10% before ETH becomes attractive for buyers.\n\nRipple price could extend the fall with a bearish divergence in play, amid a hidden continuation pattern.\n\nVolatility has increased in the market ahead of Fed interest rate decision.\n\nBitcoin (BTC) price slipped below the $65,000 threshold on Tuesday, bringing down with it Ethereum (ETH) price as well as Ripple (XRP) price. Volatility levels have also increased, as markets await Wednesday Federal Open Market Committee (FOMC) policy meeting.\n\nNevertheless, with expectations of an interest rate pause, and further interest rate hikes off the table, crypto market participants have reason to expect a rally in Bitcoin and altcoins. A pause would hint at the Fed taking a more accommodative stance toward the economy, potentially leading to increased risk appetite among investors, which would be bullish for crypto.\n\nAlso Read: Bitcoin price draws further away from its all-time high of $73,777 with BTC halving one month away\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies. Bitcoin price could drop 12% to the weekly imbalance area\n\nBitcoin price has formed a Head-and-Shoulders pattern on the daily timeframe, forecasting a 12% drop if the technical formation plays out. The market is leaning towards the downside, with the Relative Strength Index (RSI) nose-diving to signify momentum is falling.\n\nThe Awesome Oscillator (AO) is also edging towards the mean level with its histogram bars flashing red. If the bears have their way, BTC price could drop into the weekly imbalance, stretching from $52,985 to $59,005.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls are able to flip the neckline of the Head-and-Shoulders pattern into support, Bitcoin price could extend north to negate the bearish thesis above the $69,000 threshold.\n\nAlso Read: Bitcoin price provides yet another lower buying opportunity 30 days to BTC halving\n\nEthereum price eyes a 10% drop\n\nEthereum price has slipped below the most critical Fibonacci retracement level, 61.8% at $3,365, with eyes now peeled on the 50% Fibonacci placeholder at $3,137.\n\nWith the RSI nose-diving below the mean level as momentum falls fast, coupled with the AO histogram bars drawing towards negative territory, Ethereum price could drop 10% to find inflection around $3,013 before ETH is attractive for buying.\n\nETH/USDT 1-day chart\n\nConversely, if the bulls increase their buying pressure at current levels, Ethereum price could pull north, breaching resistance due to the 78.6% Fibonacci retracement level of $3,691.\n\nA flip of this roadblock into support would motivate the late bulls to buy ETH, with the ensuing buying pressure sending ETH price north to record a higher high above the peak of the market range at $4,105. This would constitute a 25% climb above current levels.\n\nAlso Read: Ethereum L2 bridge deposits skyrocket after Dencun Upgrade\n\nThis bearish divergence could send XRP price lower\n\nRipple price has recorded higher lows, while the RSI has produced lower lows, culminating in a potential weakening momentum or a trend reversal. It suggests the bullish momentum in XRP price is losing strength as the RSI is showing lower levels.\n\nIncreased selling pressure could see Ripple price descend below the ascending trendline, potentially going as low as $0.5500, or in a dire case, extend a leg lower to test the $0.5368 support level. This would constitute a drop of around 11% below current levels.\n\nXRP/USDT 1-day chart\n\nConversely, a recovery by the bulls could see XRP price restore above the 50% Fibonacci placeholder at $0.6152. Enhanced buying pressure above this level could see the price confront the 61.8% Fibonacci retracement level of 0.6460, where stiff resistance is expected.\n\nOvercoming this level would be the signal the skeptics might need to come in en masse and push XRP price further north. This could send XRP price to the peak of the market range at $0.7457, denoting a 24% climb above current levels.\n\nAlso Read: XRP trades with modest losses below key $0.60 level"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT3lEelN6T2M0UDVsUEkzUjhMQWtweFEwQzl0ZjNuWmlBOGl3S1d6YWhXdThVSjZLWWtWXzE0T18wYXlzSzYwYlcyWnlCVjhITUhFekRIV3VsQXk0M01zSDBlbWZLWkYxN0h2cUFpWWh4MTNkRFZDTVZRaDhXOTlYYWdlLU9vTV9fVEJWcWNCX3BxanpjUXFoREdrNnBlN2ZMOHNv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana volume leapfrogs Ethereum as memecoin frenzy seen sending price to $415 - DLNews",
        "content": "Memecoins drove Solana trading volume surge past Ethereum’s over the weekend.\n\nNow, one analyst expects it to reach a new all-time high of $415.\n\nOne analyst predicts Solana will reach a record $1,000 price after another memecoin frenzy pushed its weekend trading volumes higher than those of rival cryptocurrency Ethereum.\n\nSolana generated over $6.3 billion in total trading volume on March 16 and 17 compared to Ethereum’s $4.4 billion, according to DefiLlama.\n\n“Solana has effectively become the ‘people’s coin,’” with the potential to reach $415, and even as high as $1,000, Pav Hundal, lead market analyst at crypto exchange Swyftx, told DL News.\n\nA similar rally on March 3 saw higher trading volume on Solana than on Ethereum.\n\nThe cryptocurrency achieved an all-time high of $260 in November 2021.\n\nSolana trading volume\n\nMemecoins are cryptocurrencies inspired by internet jokes or memes.\n\nThey often become popular quickly due to social media and celebrity endorsements.\n\nThe expectations around Solana is another sign the bull market is gathering momentum.\n\nJoin the community to get our latest stories and updates\n\nEven so, the Solana network is still haunted by repeated outages while Ethereum’s recent Dencun upgrade is expected to make the rival digital asset much cheaper to use.\n\nThis development could become a drag on Solana and prevent it from overtaking Ethereum.\n\nMemecoin frenzy\n\nSolana-based memecoins like dogwifhat, and Ethereum’s “very high gas fees” have catapulted activity to higher levels, Hundal said.\n\n“The market is raining down liquidity on Solana at the moment,” Hundal said. “Ethereum has been brought to heel by its own gas fees and that this, in turn, [is] pushing users into the Solana ecosystem.”\n\nDex Screener, an analytics platform monitoring trading on decentralised exchanges, showed that the top five memecoins by volume in the last 24 hours on Solana were SLERF, SNAP, BOOK OF MEME, NOSTALGIA, and dogwifhat.\n\nSolana is up 103% from January 1 and is trading at $208 on Monday morning, London time.\n\nThe surge has driven Solana past Binance’s BNB token to becoming the fourth biggest cryptocurrency by total value, CoinGecko data shows.\n\nHowever, its total market value of $89 billion still trails the total values of Tether, Ethereum and Bitcoin, which clock are $103 billion, $430 billion and $1.3 trillion respectively.\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBXVjJzdzB6QXBGeXNUcFBYNng5RDJfMUxNUTVrN1R2RTN2RUFaYW9oTWJySGxGdU9XVmpqVmVDTUt3dG1DT1Z4ZFFOSnczbkpydmR1QmhVT2dXRXhpaEpMRk9xNk51VUh1X0dJbmJWSHp5X1BzLWp1aXQ0NGg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price: Can ETH Price Cross $8K in 2024? - CoinGape",
        "content": "The Ethereum price has been a victim of the crypto market crash having experienced a drop in its value. ETH’s market performance chart shows a red pattern over the past week with an 18.88% decrease. With an increase of 86% in its value year-to-date the market seems optimistic for the token to hit $8,000 by the end of the year. Let’s find out how possible this is.\n\nFactors Driving Ethereum Price to $8,000\n\nThe Standard Chartered Bank has mentioned the approval of ETH ETFs and the recent Dencan upgrade as possible drivers of Ethereum price to $8,000 by end of 2024.\n\nadvertisement\n\n1. Ethereum Price Dencun Upgrade\n\nThe Standard Chartered Bank believes that Ethereum’s recent Dencun upgrade will enhance its competitiveness by reducing transaction fees on Layer 2 networks. He predicts that the importance of the “bridge” category will increase as a result of this upgrade.\n\nAdditionally, the bank foresees Ethereum’s future use cases shifting towards gaming and tokenization, which will create a substantial demand through NFT and DeFi channels. It emphasized that this will serve as proof of concept for real-world industries to leverage Ethereum’s advantages over their current systems.The bank expects significant advancements in these areas by 2025-26.\n\n2. Ethereum spot exchange-traded fund (ETF)\n\nThe Standard Chartered Bank has also forecasted that if a spot exchange-traded fund (ETF) is approved in the US, Ether could potentially reach $8,000 by the end of this year. It asserts that the ETF inflows are likely for Ethereum (ETH) as it benefits from being considered the “big tech” of digital assets.\n\nThe bank anticipates that the US SEC will approve ETH ETFs on 23 May, which is the final deadline for the first batch of applications. This timeline aligns with the SEC’s previous approval of Bitcoin (BTC) ETFs in January 2024.\n\nStandard Chartered bullish on Bitcoin and ETH. Bitcoin TP:\n\n2024: $150k\n\n2025: $200k – $250k ETH TP:\n\n2024: 8k\n\n2025: 14k pic.twitter.com/Ahfc2KKVOY — bearishbiasjedi (@FinBizJedi) March 18, 2024\n\nAdditionally, the London Stock Exchange (LSE) in the UK has announced that it will accept applications for ETH and BTC ETFs, increasing the chances of US approval.\n\nThere is an expectation of a significant influx of ETH through ETFs, similar to what was seen with BTC ETFs after their approval. Standard Chartered Bank estimates suggest that spot ETFs could bring in approximately 2.39-9.15 million ETH within the first year of approval, equivalent to around USD 15-45 billion. This inflow as a percentage of market cap is comparable to the previous estimates for BTC ETFs, which have proven to be accurate.\n\nIf ETH ETFs receive approval in the US on 23 May as anticipated, there will be greater potential for price growth than previously thought. ETH is expected to keep pace with BTC, maintaining the current 5.4% price ratio throughout 2024. Considering the bank’s projection of BTC reaching USD 150,000 by the end of 2024, this would imply a price of USD 8,000 for ETH.\n\nWill spot Ethereum ETFs Be Approved?\n\nVarious scenarios are showing that Ethereum ETFs approval is unlikely.\n\n1. Analysts’ Lowered Expectations\n\nMany analysts have become less hopeful about the idea due to regulators’ apparent lack of communication on the matter. The current prediction markets on Polymarket suggest that there is a 28% chance of a spot ether ETF being approved by the end of May. This is a notable decrease from the 74% odds on Polymarket back on January 10, when spot bitcoin ETFs were given the green light.\n\nBloomberg Senior ETF Analyst Eric Balchunas has revised his prediction for the approval of a spot ether ETF to 30%, down from 70% in January. Balchunas stated, “We are now at 30% odds.” In contrast, his colleague James Seyffart had previously estimated a 60-65% chance of approval. Seyffart expressed his growing pessimism, stating that the current situation for an Ethereum ETF approval feels opposite to the odds for a bitcoin ETF approval. With only approximately 73 days left until the deadline, there appears to be minimal progress or development.\n\n2. Political Pressure on the SEC\n\nIt is unlikely that Ethereum ETFs will be approved this year due to increased political pressure on the Securities and Exchange Commission to only allow ETFs for Ethereum.\n\nSenators Jack Reed and Laphonza Butler have urged SEC Chairman Gensler to refrain from approving more cryptocurrency ETFs to protect investors. They argue that the approval of Bitcoin ETFs in January has opened the door for Wall Street to sell risky crypto investments to the public. The senators believe that allowing more crypto ETFs would expose investors to fraud and manipulation in thinly traded markets.\n\nThey express concerns about proposed Ethereum ETF applications and the possibility of other altcoins being approved. Reed and Butler emphasize the risks retail investors would face from ETPs, which could be susceptible to fraudulent schemes. They call for greater regulatory oversight on BTC ETF brokers and advisors to safeguard investor interests.\n\nThe success of the BTC spot products clearly ruffling some feathers on the Hill. @SenatorJackReed and @Senlaphonza write to the @SECGov urging:\n\n-no further ETPs for other tokens\n\n-make life difficult (i.e. examinations/reviews) for brokers and advisers that recommend BTC ETPs pic.twitter.com/enxdumC02N — Alexander Grieve (@AlexanderGrieve) March 14, 2024\n\nBalchunas believes the success of the Bitcoin ETF has caused regret among Democrats, impacting the approval chances of an ETH ETF. Balchunas noted the Senators’ focus on correlations between ETH futures and spot prices as a potential indicator of future actions by the SEC. He speculated that the SEC may have provided information to the Senators. The analyst also pointed out the technical term “ETP” for 33 Act funds and suggested SEC involvement in drafting the letter. Overall, he sees the letter as a sign of potential rejection of spot ETH ETFs.\n\nETH Price Current Status\n\nEthereum price is currently at $3,266.05 having decreased by 9.00% over the past day. The token is below its all-time high of $4,891 it achieved on November 16, 2021, which investors are hoping it will hit and surpass during this bull run year. There is quite substantial activity going on in the market regarding ETH as demonstrated by a 63% increase in the 24-hour trading volume. It still holds the second position according to CoinMarketCap, boasting a market cap of $392.18 billion and a circulation supply of 120 million ETH.\n\nPrice Forecast: Will Ethereum Price Hit $8,000?\n\nETH is likely to encounter a lot of obstacles in reaching $8,000 by the end of the year, based on the current technical indicators. The 200-day EMA and MACD signals show a strong bearish sentiment, indicating that the price may face more downward pressure. Although there might be temporary recoveries, the overall trend seems difficult for a significant price rise. Traders and investors should keep an eye on important support and resistance levels, as well as the general market sentiment, to accurately assess ETH’s future path."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQRTBtRzFhU2gwQnFQakg0d21JazhRdVZRUVBYdjBBc2xOMG5aVThMalF4Q080bGYxbDhCWFJCNWRKU1RmdWZtcTl1OTdneUI2MjYxbW5RTmhvbjJzTkJ1b2hwdGZ6YkVMVlU4UWhNRnRqZUFoZGU1MFUyX2JoQkZ0Q21XV1dfZDdBcnoyT19RS1owdTlfZnfSAZsBQVVfeXFMUDloRnZzQklBdjZEaVZsTHpYQVJMeTV3eGU2RXpQbHNqclpjMnN1NDc2T1NlaEUwSlNUdmlKajJud3BhM2pFRW04ZDQwRHRFeG8yN0oza1ZWb2ZTWUZjWDlubUxZQW5kVmZnRmc1ckFUUmVrS1hxVjhYTGE5SGlaclhUa0VGUGVhTm5PaHZSWW4zUXJoSGg0UFJiWTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "What Will Come First for ETH: $3,000 or $4,000? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has finally reached a significant obstacle following months of rallying. Yet, there are still reasons to be optimistic that the market can climb higher.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been rejected from the $4,000 resistance after rallying consistently since the beginning of February.\n\nThe price has dropped to the $3,600 support level, which is currently holding. If ETH rebounds from here, the market might be able to rise above $4,000 and make a new all-time high in the coming weeks. On the other hand, a breakdown can lead to a decline toward $3,000.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, the price has seemingly experienced a shift in structure. The market has been making lower highs and lows since its rejection from the $4,000 resistance zone.\n\nWhile the $3,600 support level might still hold, ETH might break lower, as the Relative Strength Index is showing values below 50%. Therefore, a pullback toward the $3,000 level might be expected in the short term.\n\nOn-Chain Analysis\n\nBy TradingRage\n\nEthereum Exchange Reserve\n\nEthereum’s price has been rallying aggressively over the last few weeks. Yet, the recent drop below the $4,000 level has shocked market participants and caused panic selling by some holders.\n\nThis chart displays the exchange reserve metric, which measures the amount of Bitcoin held in exchange wallets. A rise in the metric typically indicates a rise in supply, which could lead to a decline in price.\n\nAs the chart demonstrates, the exchange reserve has risen above its 30-day moving average. This points to the fact that many holders are depositing their coins to the exchanges with the intention to sell them. A continuation of this trend can be detrimental, as it could result in a further price decline in the coming weeks."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNc0RySzNFblBvM29xVEJUQzdGUjZwb1VQZVV2T3ZsenpCX3lScFJMYlVwUW1RRXpGUlVIZFNHdDR3SnBEVEI3VHcyQVZiR3RrOWZmY2NJVWVwcG5mQndMeFBBSlY0Z1NPckZ2X0hDWVlpNFo2YW50dTE3dXgyVTJSUURKNDHSAYoBQVVfeXFMTnZQVHdGVnBMNWtLeUh2ZHBBS1N0U2NpemEzX2VfYUt5RGo4WHpJTnVvX2Y1blJWNW5mdTZRLV9tMnZIcWFkMl9sWE9HX0NyZTFtdHNqZWQ0eXBVOFdyTktLSi1qaENUN1dlMXdTWm9oNnY1eGFNWURQQXljbzJ5Q1k4Wi0tQlhvTnlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum: All factors that will dictate when ETH crosses $4K again - AMBCrypto News",
        "content": "U.S. investors were crazy about Ethereum earlier this month.\n\nDespite the recent pullback, user activity and demand remained high.\n\nEthereum [ETH] was trading above the $4K mark for close to 48 hours in total in 2024. On the 12th and 13th of March, ETH poked its head briefly above this psychological level.\n\nAMBCrypto reported that supply on exchanges was low, meaning investors need not fear an intense wave of selling pressure.\n\nNew demand for ETH was at a YTD high and the Dencun upgrade went live on the 13th of March.\n\nThis upgrade was branded as the “first step in a long-term strategy” to make the network scale to “hundreds of thousands of transactions per second” by Jesse Pollack, the creator of Base and Head of Protocols at Coinbase.\n\nThe Coinbase Premium grew to highs not seen since the first week of May 2023. This indicated an influx of demand from investors in the United States. However, this was affected by the recent pullback.\n\nU.S. investors were no longer entranced by Ethereum\n\nThe Coinbase Premium is the percentage gap between the Ethereum prices on Coinbase Pro (ETHUSD pair) and Binance (ETHUSDT pair). This metric has trended higher since the 24th of February.\n\nIt has a ceiling at the 0.05 reading since June 2023, but in March, this trend was flipped.\n\nThe index rose as high as 0.23 on the 8th of March. Since then, it has taken a nosedive and fell to -0.1 on the 17th of March.\n\nThis showed that U.S. investors had been enamored by Ethereum earlier this month, but quickly snapped out of it as prices plunged below the $4K level.\n\nIn May 2023, ETH was in a longer-term downtrend when the index shot skyward. This time, Ethereum has embarked on a move that could potentially break its ATH.\n\nHence, the retreat by U.S. investors might pan out differently this time.\n\nSantiment metrics pointed toward strong demand\n\nThe active addresses count trended upward in the first half of March, just surpassing the January highs. It has fallen a bit since then but still maintained a lofty position.\n\nThis uptick in user demand for the network was a bullish development.\n\nThe Open Interest noted a decline alongside the prices to signal short-term bearish sentiment in the market.\n\nThe Funding Rate had been highly positive a week ago but retreated in the past few days, once again underlining a shift in sentiment.\n\nETH wallets with more than 10k tokens booked profits on their holdings earlier this month. This was seen by the swift drop in the supply distribution % figure for the 10k-1M ETH.\n\nThose holding less than 10k ETH did not change dramatically.\n\nThe whales deciding to cash out as prices approached the $4K mark indicated that studying whale behavior could help traders and analysts enormously.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nIn conclusion, some on-chain metrics indicated a bullish outlook. The price trend of Ethereum would remain bullish until we dive below the $3.1k level.\n\nTill then, bulls could treat these dips as discounted buying opportunities."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5hc1ZxcndJRnVaaDRmamt6Y3BzVEY2RDAwaHZlRDlpTHBRSVJ6bGZfR0d4bFhyQjRRV3M2RVNDSEIxVUY3NnI2eDFvQU9obWszV2Z1dGJwSUNQdTI2c0hUYzlpcVJyWFVDckpIWmwwb3BXOTlBTlNmak5R0gGCAUFVX3lxTE8tUjVKQjBHTjJwTldzNHJ6VE1SdTVnUXlFXzNLSHRxOW5TN2gzT0ZnNWxlY3E5clZpNGJqdDUycVNvZ19BQW04eGlVYVRCZG1FcXY2TTRjdlNNcnBQcUZ1Z3pMWU8xcV9jVElGZXIxMlRzc3ZaMkM4Uk9GeHNUVHpsNkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum See Red as Crypto Market Boom Turns to Gloom - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMarkets are seeing red early Tuesday morning as Bitcoin drops 7% and Ethereum lags 10%.\n\nThe global crypto market cap has contracted by 8% since yesterday, having dropped below $2.5 trillion after last week getting within 5% of matching its all-time high market capitalization crypto markets last saw in early November 2021.\n\nAt the time of writing, the Bitcoin price is $63,142.39 after having briefly dropped below the $63,000 mark, according to CoinGecko data. It's been a rapid change of scenery for Bitcoin traders. BTC set a new all-time high by inching above $73,000 last week.\n\nAD\n\nAD\n\nEthereum has fared even worse than Bitcoin.\n\nEarly Tuesday morning, the Ethereum price was $3,230.05. That's a 10% drop since yesterday and 20% lower than it was this time last week, when the Ethereum community was ramping up for the Dencun upgrade to go live on mainnet.\n\nThe stark Bitcoin and Ethereum price drops mean that a lot of long positions opened by optimistic traders have been liquidated, according to CoinGlass. In the past day, more than $500 million worth of long and $100 million worth of short positions have been liquidated across digital asset contracts.\n\nWhen a trader opens a long position, it's essentially bet that an asset will increase in price by a certain date. Ideally for investors, they only sell the asset once they've realized some gains and want to take profit. But in extreme cases, an exchange or brokerage can force a trader to liquidate because the asset has seen a big drop in price.\n\nAD\n\nAD\n\nMeanwhile, many of the meme coins that were stealing the show a few weeks back have seen even larger losses. That's usually the case for meme coins. When the market's largest assets, like Bitcoin and Ethereum see price movement, memes can especially volatile and see outsized gains and losses.\n\nSolana meme coins Dogwifhat (WIF) and Bonk (BONK) have dropped 22% and 19% respectively in the past day. And Floki Inu (FLOKI), one of their Ethereum-based Shiba Inu-themed meme coin competitors, has shed 20% since yesterday.\n\nEven Jupiter, the Solana DEX that yesterday pledged to help out the Slerf presale buyers who just lost $10 million, has seen its JUP token drop 16% since this time on Monday."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQeTJpdjMwcDcwalV0NTVnQ0FmNng1MXR3b1V6a1pxMUdOLVBxNDFwS25vQWlEdkRRcFdmRWFsQzc2aEFyRGo0cVlfZmxmWWVKT21mRmdTVkFfWTlPd3diVkNqcUtuY3V5bkdsSHdFemdUeXhBRWJ3Y1N2bDYwb3diYUk1bGRaR0FTMzBxR2xOWG1BZWltcjNVTWJvTVBDM0hG0gGmAUFVX3lxTE5oalBmOE85dUlYYnlRbFV1d0lTVkNsX1U2elpnRGNBX0lXRnhMMG93c1ZvZGFQZ0s2eWFYZVNzXzlZeEpSNlN1eTltel92aEFEUFJXU1ZGam1ETl9pZ0U4VG54LUVNVnVyc1ZvZ1dtWmUyMmw1d3B1RnphZmo0M3BUMl9fNGFpSFpIX29pT0ttbHVEdXoxMEF4XzFGN1JtRXRmZkY2aFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Reversal Unlikely Soon As Majority Holders Still In Profit - CoinGape",
        "content": "Despite the successful implementation of the Ethereum Dencun Upgrade last week, the ETH price witnessed strong selling pressure correcting over 10% as it failed to hold the $4,000 resistance. As of press time, the Ethereum (ETH) price trades at $3,574 with a market cap of $430 billion. While Bitcoin witnessed some bounceback during the last weekend, ETH continued to remain in the grip of the bears.\n\nMajority of ETH Holders Are Profitable\n\nIn recent trading sessions, the Ethereum (ETH) price experienced a notable decline, slipping over 10% from their recent peak of $4,000. Despite this downturn, a significant portion of ETH holders, comprising 89% of the network, are still in profit, underscoring resilience amidst market volatility.\n\nadvertisement\n\nKey on-chain data from IntoTheBlock reveals potential support levels for ETH’s price trajectory. Notably, the largest concentration of on-chain sell volume is observed around the $3.7K mark, where approximately 991,000 addresses collectively acquired 4.35 million ETH. This suggests a formidable barrier to further price appreciation, with market dynamics poised to pivot around this critical level.\n\nAs market participants closely monitor ETH’s price movements, attention remains focused on key support and resistance levels, with the $4,000 range emerging as a significant psychological benchmark.\n\nEthereum Price Action Ahead\n\nEthereum’s price trajectory finds it currently trading below the $3,700 mark and the 100-hourly Simple Moving Average (SMA). In the immediate term, resistance looms near the $3,650 level, with a notable bearish trend line forming, presenting a challenge at $3,660 on the hourly chart of ETH/USD.\n\nLooking ahead, significant resistance hurdles emerge near the $3,750 level, representing the 50% Fibonacci retracement level of the recent downward move from the $4,084 swing high to the $3,414 low. Beyond this, the next major resistance lies at $3,830, potentially catalyzing bullish momentum if breached.\n\nIn a bullish scenario, Ethereum could eye a rally towards the $3,925 level. Further upside may lead to a test of the critical $4,000 resistance, with the potential for further gains toward $4,080.\n\nConversely, failure to surpass the $3,650 resistance may trigger a fresh decline. Initial support is anticipated around the $3,520 level, followed by a more substantial support zone near $3,500. Should selling pressure intensify, Ethereum may target the $3,420 support zone, potentially extending losses towards $3,350 and $3,250 levels.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE45Q2ZObGFXSkZWU2wzelg5akRTWTdiOVFLdG1hMjBSVUdZbWNxTzNvRVlwZmlFMC1Id0c4NTNCdjJWcjVqcUNBSTFSZDJDd0s3c0ZSbldwMGYwUWp5ajdxbXNhQnBra2s4UFZDRFQzWnNJV0I2c0RrdVhhLUTSAYIBQVVfeXFMUFRXcnpMZEMxMTMtTlYxZlllVGdGV3lHbHBoZTRXWlVBOUswYm43SEZkbTJsZWxGdmc5RDk3ems1ZlBVR3VlRE1XaDhwRWhnN2JCTWptXzQ4a0M1Q3BGbVJvaW9ucUI5Nk5KUFRZZHhhMTRlZURNMkNpbEtSWlFyTzZNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Crypto wallet providers urged to rethink security as criminals drain them of millions - The Register",
        "content": "Infosec researchers are noting rising cryptocurrency attacks and have encouraged wallet security providers to up their collective game.\n\nCheck Point specifically cites the growth of attacks that abuse Ethereum's CREATE2 opcode, dubbing it a \"critical issue in the blockchain community\" that's seeing millions of dollars worth of assets being drained from victims' wallets.\n\nIntroduced in 2019, CREATE2 is seen as a significant advancement for Ethereum, allowing for more efficient deployments of smart contracts – the technology that validates transactions on the blockchain.\n\nCREATE2 is also the function that's being exploited by attackers to drain tokens from victims' wallets.\n\nOne of its key capabilities is being able to deploy smart contracts to pre-determined addresses, making the entire process more predictable for the blockchain when dealing with multiple contract interactions across the ecosystem of decentralized applications.\n\nBy pre-determined, it means that an attacker can create temporary, single-use addresses to receive a victim's assets. New addresses can be used for each attack, and this is crucial because wallet security providers rely on previously held data to flag potentially malicious transactions. If the address has no dodgy history, it's likely the transaction will evade these detections.\n\nThe fact that attackers can set up a contract before deploying it (before it even exists), using a wallet address that doesn't have a history of malicious activity, means that if they can get the victim to approve a contract they can drain their funds.\n\nOf course, this requires some social engineering hijinkery to pull off, but we've all heard about the real-life scam stories that sound too wild to be true, but are. This attack works, and has facilitated huge single-transaction scams in recent times.\n\nThe researchers highlighted one fraud in January that saw attackers make off with $3.6 million worth of SuperVerse tokens in one fell swoop as an example of how serious these incidents can be for victims.\n\nRemember: with blockchains, there is no legal recourse and no customer helpline to recover funds. Once they're sent and signed, that's it – tokens are gone for good.\n\nHow they work and why they work\n\nThe attack flow is as follows. First, an attacker needs to get a victim to approve a contract that hasn't yet been deployed – the bit that requires social engineering. They then use CREATE2's ability to generate new contract addresses to receive the funds and deploy the malicious contract, complete with the victim's authorization, in turn draining the victim's wallet.\n\nThe key part here is the generation of a new wallet address, one that has no history of being reported for criminal intentions. CREATE2 generates this using a calculation that includes four parameters: the attacker's wallet address, a constant prefix, a salt, and an initialization code.\n\nThis address will be created only when the victim approves the contract, meaning it's never been used before for any illicit dealings, and won't be used again, thereby bypassing the security protections that usually monitor such transactions.\n\n\"The exploitation of the CREATE2 function underscores the continuous battle between innovation and security in the blockchain sphere,\" said Check Point researchers Oded Vanunu, Dikla Barda, and Roman Zaikin.\n\n\"As Ethereum continues to evolve, so too must the security mechanisms designed to protect users from such sophisticated attacks. Awareness and education are the first steps in safeguarding digital assets against emerging threats. Blockchain developers and users alike must remain vigilant, continuously updating their knowledge and security practices to navigate this ever-changing landscape securely.\n\n\"This vulnerability highlights the need for enhanced security measures in wallet security products to adapt to the evolving tactics of cybercriminals, ensuring the safekeeping of digital assets in the face of innovative exploits.\"\n\nThe big business of crypto attacks\n\nTowards the back end of 2023, we saw a string of high-profile wallet-draining attacks netting cybercriminals hefty sums, and the attacks weren't localized to just the Ethereum blockchain either.\n\nJustin Sun, founder of the Tron Foundation and owner of Poloniex, a crypto exchange that was drained of circa $120 million in November, offered a reward for the attackers at the time to return the funds they stole.\n\nThe Monero Project was also mysteriously drained of nearly half a million dollars just days before, and 5,000 Atomic Wallet users were drained earlier in the year – just a few of the high-profile incidents that took place in 2023.\n\nWhile not all of these have been directly attributed to CREATE2 exploits, researchers told The Register that it seems like North Korea's state-sponsored Lazarus gang may have been behind a sizable proportion of them.\n\nThe web3 anti-scam solution provider ScamSniffer analyzed a series of CREATE2 incidents between May and November 2023, concluding that almost $60 million had been stolen from around 99,000 victims. ®"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNOHlzYzhGYThsUWZLZDZGLUh4N0RIbS1GcjdMT3RXMEZJVnBKc1ZxSUhrcHotYkN2WFVta1R5Zl9IUmh4cGZFaXJiZnYtLTl5REFLQVdTSWREMDF2MkwzQWxGWldHSjl1QVA0dnppMWxHMGZuV3hSV3dqcU0xZmlCbnMtWVJrQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Owners of Shiba Inu Behind Dogwifhat Meme Auctions NFT on Ethereum - Yahoo Finance",
        "content": "Owners of Shiba Inu Behind Dogwifhat Meme Auctions NFT on Ethereum\n\nA South Korean Instagram user announced that the Shiba Inu featured in the \"Dogwifhat\" meme, named Achi, was their pet. To celebrate, they planned to auction an NFT of the original photo of Achi wearing a woven beanie on the Ethereum blockchain.\n\nThe user's Instagram profile has consistently posted photos of Achi in various woven clothing for the past five years. They also posted the famous \"Dogwifhat\" photo itself in December 2018, almost a year before it went viral online. Partners of the Achi NFT auction have confirmed that the user has been verified as Achi's true parent. At writing, Dogwifhat (WIF)'s market capitalization is almost $3 billion, while the current bid for the Achi NFT is 55 ETH, around $197,800.\n\nSeveral members of the WIF community and other Solana users expressed disappointment that the Achi NFT auction was not partnered with the WIF team. The new Achi NFT is minted as an Ethereum NFT and is currently up for auction on the Ethereum NFT platform Foundation.\n\nAchi's parents previously attempted to work with the Solana community, partnering to launch a memecoin called ACHI, but the experience ended in a rug pull. As a result, they opted to partner with Feisty DAO for the NFT auction.\n\nDespite the community's frustration, it appears that the WIF community has done little to reach out to Achi's family. WIF launched in December, and as of a few weeks ago, Achi's parents had reportedly never heard from anyone in the community. Path, the Feisty DAO member behind the NFT auction, said he is open to re-minting the NFT on Solana if there is interest. However, he has not yet received any inquiries from WIF community members."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOVGRTQjVTb3hJby1XcFpta056UG5ybk1vV1p2ZEtjLTVWYnJKN1JLcW9CSmxReFppYUh2ZkpONHowQWc3Q19iWkFvVWlMMG40YzRNZHZDZGlhSHUyS2NwOTJlZGZoUndjRGkxLVVtdjBFS2NqTFNVNXlKemV0Ni1IME03YXlHd3BvNVRIdlNIYlVXX09FNHd5OGZQQV_SAaIBQVVfeXFMTVJGOUs4TTRWbGpyaHZmTktFOGdvXzdKbmdxQzE1Mmx5ZGZJLWhGbjloVkRySERjZTJiSF9JZzlLalRpb29kckFjUWZtQmR2Y1c5a0NjQ19neHZqZGE2TUZiazBpamdrcUpMY2U0cHYxbFBLdTBZRDJzQ29YZVBuZmJrLVd5V0tMTEp3VzBTamV2M19FVzhCS2tjc2Z3OXRlaVFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Risks $24M Collateral Liquidation If ETH Falls To This Level - CoinGape",
        "content": "The decentralized finance (DeFi) ecosystem found itself on shaky ground as liquidations soared. In the last 24 hours, the DeFi ecosystem witnessed more than $5.4 million in collateral liquidations of which Ethereum (ETH) held a massive share. This comes amid the Ethereum price drop to $3,200 after it neared rhe $4,100 mark earlier this month.\n\nEthereum Price Drop Risks Massive Collateral Liquidation\n\nThe DeFi sector witnessed $4.27 million collateral liquidations tied to Ethereum alone, according to Parsec data. Moreover, amid the Ethereum price volatility, the data suggest massive collateral liquidations if ETH nosedived to $3,008. At this level, an enormous $24 million worth of ETH in collateral would be liquidated.\n\nadvertisement\n\nAdding fuel to the fire, on-chain derivatives exchanges, including GMX, Kwenta, and Polynomial, have collectively triggered liquidations surpassing a staggering $52 million in the same period. As Ethereum’s price dipped to $3,200 from its recent $4,100 peak, short traders realized their profits by buying back their positions.\n\nHowever, long position holders indulged into panic selling to minimize their losses from the recent ETH price crash. According to Coinglass, Ethereum registered $120.27 million liquidations in the last 24 hours of which a staggering $103.54 million was liquidated by long players.\n\nWhilst, short traders accounted for $16.73 million liquidations. The significant long liquidations could lead to a further ETH price slump. In addition, the heightened Ethereum collateral liquidations could add to the bearish turn. Furthermore, Ethereum open interest fell 3.49% to $12.52 billion as derivatives traders pulled their money out.\n\nAlso Read: Ethereum (ETH) Price Reversal Unlikely Soon As Majority Holders Still In Profit\n\nETH Price Plunges 9%\n\nThe Ethereum price crash over 9% today amid increased sell pressure. At press time, the ETH price plummeted 9.53% to $3,230.82 on Tuesday, March 19. Whilst, the crypto boasted a market cap of $387.84 billion.\n\nOn the contrary, the ETH 24-hour trade volume spiked 64.25% to $28.97 billion owing to the recent liquidations and whale selloffs. Earlier this month, the Ethereum price peaked at $4,092.28 but couldn’t surpass $4,100 owing to the recent bearish turn.\n\nMoreover, the Federal Open Market Committee (FOMC) meeting scheduled for Wednesday, March 20, has spurred volatility in the crypto market. Moreover, weak inflows into Spot Bitcoin ETFs fuelled the bearish sentiment, which also affected the entire market, including Ethereum.\n\nAlso Read: Ethereum (ETH) Price Reversal Unlikely Soon As Majority Holders Still In Profit\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOUW9sNUtHTnNuSkNWcFVScVhxQlI1TmthejVjUUtiSDVGVGRsNmMxNVJDVFpOUmlJUnhfV1RhWk1idmZNZFR5cEZic0IzVXF5TUhWZzhPMW5vRFoxdW5RQVNvdnhxLUtUVy1ZbVZCT3Fpd0l6amVpUmxZV1RoN3p2em9LSFBhNFnSAYwBQVVfeXFMTXUxQjZ5ZkJuTXRUWHF1ZnBiNnF4NE5aRFMyUzF1bXJIQmlrSXhwSkxlcnlNRV80SkhIWk5iV3NfSXpfY3d3YUNYZXY4blRVNVZBYURFTFdkamlYMVFYR3YySk40UUNURWNTVm1RSDBUR3JxWW9iOUhGdzBzQnBURXRYZWljeFJ1TXZ4U0g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Breaking: Bitcoin to Hit $150K, Ethereum $8K in 2024 – Standard Chartered - CoinGape",
        "content": "The financial giant Standard Chartered on Monday revised its price target for Bitcoin (BTC) and Ethereum (ETH) for this year and 2025.\n\nStandard Chartered now predicts BTC price hitting $150,000 by the year-end and $250,000 in 2025. Moreover, the bank also predicts ETH price to reach $8,000 if a spot Ether ETF is approved by the U.S. SEC.\n\nadvertisement\n\nStandard Chartered Raises Bitcoin and Ethereum Price Targets\n\nStandard Chartered raised its year-end Bitcoin price target to $150,000 from $100,000 after BTC price hit a fresh all-time high. The move comes in response to gold analogy, massive inflows into spot Bitcoin ETF, and portfolio optimization.\n\nThe bank also revised its target price for 2025 from $200,000 to $250,000. Thus, the bank increased its year-end and 2025 target price by $50,000 mostly due to rising interest in spot Bitcoin ETFs. Standard Bank is more confident about its BTC price target for 2024.\n\n“We believe that both of these comparisons are still relevant and provide insights into how the Bitcoin price might develop,” says Standard Chartered’s head of digital assets Geoff Kendrick.\n\nOn the other hand, Standard Chartered kept its Ethereum price target, but believes ETH price could hit $8,000 in 2024 instead of 2026. ETH price currently trades at $3,568.\n\nStandard Chartered cites the Ethereum Dencun upgrade and expected spot Ethereum ETF approval as primary reasons behind the bullish price target for ETH price. The bank expects the U.S. SEC to approve a spot Ethereum ETF in May, which could bring $15-45 billion in inflows in the first 12 months.\n\nMoreover, the London Stock Exchange (LSE) has announced accepting applications for BTC and ETH ETFs. Also, “In 2025, we see the ETH-to-BTC price ratio rising back to the 7% level that prevailed for much of 2021-22,” which gives ETH price target of $14,000 in 2025.\n\nAlso Read: Ethereum (ETH) Price Reversal Unlikely Soon As Majority Holders Still In Profit\n\nBTC Price Predictions\n\n“Rich Dad Poor Dad” author Robert Kiyosaki has a new target of $300,000 for Bitcoin price as the crypto asset hits an all-time high. Wall Street and crypto experts such as Standard Chartered, Fundstrat’s Tom Lee, and Michael van de Poppe have predicted that BTC price can at least hit $100K in 2024.\n\nWilliam Quigley, co-founder of Tether, predicted BTC price to hit $300K in a commentary on CNBC’s ‘Squawk on the Street’. Quigley explained the fundamental analysis of money flows into Bitcoin amid rising institutional and retail investment within the crypto market.\n\nBTC price currently trades at $68,166 and total BTC futures OI across exchanges has hit a high of $34.65 billion. Bitcoin futures OI on CME is $11.43 billion, a rise of over 1.5% in the last 24 hours.\n\nAlso Read: MASK Price Skyrockets 30% As Mask Network Launches Staking and Rewards\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNbkk5M3NVV1g0ZXN0M0VzQVBFU2N0QTkyWGJYV2ZJc09maXZmU2hYbVN4ODBoSUswcnVEeTAxZlBETGx0aVRZenFxMmhuUGRxTHNGSF9KRUpfVHByd01aNXFGOWlGeHlTLWNfWmQxdG55WWxKOWV2MzZIOEpQY3NqY09FUjVrMzBJbGRnR1VSS0EwRm41Sl9XMHc5WllDcmhIZmxvdGpGaVJ2V0k0ZUJhcFhydHEyWktrVGk1d0JOMDhaTC13dkRIdklaYUc4WnBCMk1rYkFTQmZ4NlBXbE1HT2ZBTU0xdDJkdHlzN3pSbEpRYUJwb2VPZEE3NlUxbXhqcVVwQ3drdGhjVERoWGJFTlBUYmRmUlHSAZwCQVVfeXFMTXBoc19EMXd1c1pScVJ6VVJhWl9yd3J3M3RfTG81aTZYSzZKYTRhUjUxd2x2c1Rka3NrOW9ZNVVuNXY3RVBVZ1pDbmxBY1NzXzhTSmZhVHo5eGVkRWRMbnVZaklBNEZWdnVWME9xRXQwV243eU9uUGNRWTV5VUU0dVRMVjEyZmMzZ2dqbE9OQ3QtSDVOZUJLYjVjUlo3bTJoNWJNYXZQUmtNVDczRTkxYXNLT2lpQ1VwQkx4WjdqdkNSenJ3NkVmSGdybk41ajhINGtUZkFHNTZaNHYwMXRuQ3VBVVE1c3JBdnJQVFN6aFJ4RUxwTEhjYXIyeUswT2ZwbEdyZXRTV0IzU29KbmFoY19IMEM5VGRveGZCRVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Polkadot (DOT) and Ethereum (ETH) surges as KangaMoon (KANG) exhibits impressive presale performance - The Times of India",
        "content": "KangaMoon (KANG): A promising Ethereum-based Meme Coin reinvigorates the Play-to-Earn landscape\n\nPolkadot (DOT) price outperforms expectations, attracting Institutional Interest\n\nEthereum Token (ETH): Poised for $5,000 or Headed for a correction?\n\nDisclaimer: The above content is non-editorial, and TIL hereby disclaims any and all warranties, expressed or implied, relating to the same. TIL does not guarantee, vouch for or necessarily endorse any of the above content, nor is it responsible for them in any manner whatsoever. The article does not constitute investment advice. Please take all steps necessary to ascertain that any information and content provided is correct, updated and verified.\n\nThe recent market surge has propelled numerous tokens to new heights in a remarkably short period. This resurgence of the bull market appears to be stronger than previous cycles. In this article, we will delve into the performance of top crypto coins like Ethereum (ETH), Polkadot (DOT), and a new market entrant, KangaMoon (KANG). KangaMoon is particularly witnessing an impressive growth during its ongoing presale phase, experiencing a surge of 125% in value to position itself among the top meme coins to invest in.Based on Ethereum Network, KangaMoon (KANG) is generating significant buzz within the cryptocurrency community during its ongoing presale. Having already surpassed the $1.6M funding milestone, KangaMoon is poised to tick the next $2M milestone before the end of March. This robust presale performance, however, underscores KangaMoon's potential to disrupt the meme coin market as well as capture the attention of crypto and meme coin enthusiasts worldwide.KangaMoon places a strong emphasis on building a vibrant community and fostering creativity. Their platform is designed to empower users, allowing them to participate in exciting battle contests and unleash their imagination by designing unique in-game characters.Setting itself apart in the meme coin market, KangaMoon seamlessly combines elements of Social-Fi and GameFi's Play-to-Earn (P2E) dynamics within a unified ecosystem. The platform's reward system is designed to incentivize active participation across various activities. Users not only earn rewards for playing games but also for completing challenges and engaging on KangaMoon’s social media platforms.During its presale phase, KangaMoon has already demonstrated impressive growth, with its value surging by 125% from $0.005 to $0.01125. At this rate, analysts are optimistic about its future prospects, anticipating further upward momentum. With the potential to reach $1 by Q2 2024, KangaMoon is expected to gain wider traction, especially upon its listing on major Tier-1 cryptocurrency exchanges.Surpassing the performance of established cryptocurrencies like Litecoin and Cardano, Polkadot (DOT) has demonstrated impressive returns recently. Its performance since the beginning of the month not only surpasses these well-known cryptocurrencies but also signals growing institutional interest beyond them. The lower price-to-sales (P/S) ratio of Polkadot serves as a value indicator, suggesting that Polkadot may be undervalued, potentially attracting the attention of institutions seeking untapped opportunities.Furthermore, Polkadot's recent price movements have generated a bullish sentiment, indicating a reversal from a downtrend to an uptrend. With the completion of this bullish formation, the price of Polkadot has already achieved half of the anticipated 31.3% growth, approaching the expected target price of $12. However, the future growth of Polkadot hinges significantly on consistent market support and the ability to surpass the critical $11 level.Ethereum (ETH), the world's second-largest cryptocurrency, has been holding steady above $4,000, fueling speculation of a potential rally to a new all-time high of $5,000. After an impressive 51% surge in February, Ethereum bulls carried their momentum into March. On March 8th, Ethereum triumphantly surpassed the $4,000 resistance level for the first time in three years, marking a significant 20% increase within the first week.As anticipated, this surge triggered a short-lived sell-off, leading to a 3% retracement that brought the price down to around $3,900 within the next 24 hours. However, over the past week, Ethereum continues to trade at a weekly price range of $3,828 - $4,049. Despite the price pullback, a majority of current Ethereum holders appear to be maintaining a bullish stance, suggesting continued confidence in the cryptocurrency's long-term potential.Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!Website: https://KangaMoon.com/ Join the Telegram Community: https://t.me/KangaMoonofficial"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5LZVdaSTViNHVsSUlidXNLbGZqelJYM0MxUFQtNHdLSU9aRkxwbTJoSlZ0bHFXaWd1ZHJwR053UGt0UzkxVDUxSUloY1FHQjFzX3NrdmRFXzl2RWdBR2Y0ckp4aGdsLVFkYmJvbll30gFzQVVfeXFMTlJqa1hyemI4U2I3Vi1tTW1TbDJYRXNmRFplZjZyMnZGR05YNlg1UW1wWFVrZDBLU3M2TFJaaUV1dlVHb1RHMDBTd0VCN1oxamdpb2xtV3d4Q3VtSnRsNXY0Mzh2d21LZUJ4ZUNzaWdnd3Vidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price prediction and strategy for a $4K comeback - AMBCrypto News",
        "content": "A close above $3,700 could help the price back to $4,000.\n\nThe Pi Cycle Top indicator revealed that the ETH might rally.\n\nEthereum [ETH] seemed to have become a shadow of its former self after the price collapsed from $3,633 to $3,22o in the last 24 hours.\n\nDespite the decline, AMBCrypto agrees that the value of the altcoin might retest $4,000. However, this prediction might not come cheap or easy.\n\nThis is because of the number of addresses that accumulated ETH around $3,700. This has made it a key resistance zone.\n\nAccording to IntoTheBlock, ETH’s previous rise above $4,000 placed 89% of its holders in profit.\n\nWho decided what’s next?\n\nHowever, the recent decline meant that there was a sell wall at $3,700 where 991,000 ETH addresses purchased 4.35 million coins.\n\nWith ETH trading below the region, the holders have an opportunity to break even if the price climbs.\n\nIf the participants decide to book profits, the altcoin might find it challenging to revisit the psychological $4,000 mark.\n\nOn the other hand, if buying pressure outweighs the on-chain sell volume, then ETH might cruise above $3,700.\n\nBut whether the cryptocurrency would continue to languish in the red does not depend on the on-chain outlook alone.\n\nTherefore, AMBCrypto gauged the price action from a technical perspective. According to the 4-hour ETH/USD chart, the Exponential Moving Average (EMA) depicted a short-term bearish trend for the altcoin.\n\nAt press time, the 20 EMA (blue) crossed below the 50 EMA (yellow). With this trend, the price of the cryptocurrency might drop by another 7.30%. Should this happen, the value could hit $3,112.\n\nA look at the Aroon Indicator also reinforced the bearish bias. As of this writing, the Aroon Down (blue) was 100% while the Aroon Up (orange) was 35.71%. This indicates that sellers were in control of the price action.\n\nETH is oversold\n\nFurthermore, an assessment of the Supertrend indicated that ETH has not yet flashed a buy signal. But there was an earlier sell signal at $3,780.\n\nMeanwhile, the Relative Strength Index (RSI) was in the oversold region. If the reading continues to decrease, then the chances of a harder bounce might also increase.\n\nIn a highly bullish case, ETH might climb to $4,500 when the market turbulence fizzles.\n\nWhile the short-term outlook looked gloomy for ETH, the Pi Cycle Top indicated otherwise for the mid to long-term.\n\nHistorically, the indicator tells when a cryptocurrency is close to the bottom or has hit the market top.\n\nHow much are 1,10,100 ETHs worth today?\n\nIf the 111-day moving average (MA), in green hits the same region as the 350-day MA (purple), then Ethereum would have hit the top of this cycle.\n\nBut that was not the case, as the 111-day MA was lower than its opposite number. Thus, the price of ETH might have a lot of upside potential over the forthcoming months."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOemRyUFZpTmd2SXRVYmR2UkZ3REtoMlRaRlVZUG9TZHZncWxoWXdaMWthdkpIVTJGNUZhQVpXSEhNU3FFUEhwdFBtLUdCRzhxenVjUzlkZWZ5YUl4WFFlZVZkRlRCV1djaVI2SW1NcEwtdk1hS1lDbVhvcFE0MkJMM2tnUVZ6enUyYzJGMEQ3SWp0VlM4X0thMVRmVS1WaDA4WmRjbjEzRkQ4bXJ5ajJPZDNJNUN3QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Hyperledger launches Besu blockchain financial services working group as Citi joins - Ledger Insights",
        "content": "Today the Hyperledger Foundation, the enterprise grade blockchain ecosystem, announced two new members, Citi and Brazilian Development Bank (BNDES). Additionally, it unveiled a new Hyperledger Besu Financial Services Working Group. Besu is the popular Ethereum blockchain client that targets enterprise users and works with public and private Ethereum blockchains.\n\nNew members\n\nLast year, Citi unveiled its tokenized deposit offering, Citi Token Services, and later revealed that it used a private Ethereum blockchain infrastructure. However, it has also been experimenting with other technologies, such as Avalanche.\n\n“We’re not just looking to the future; we’re shaping it, aiming for the next generation of financial solutions to be built on a foundation of trust, safety, soundness, and technological innovation powered by the global community,” said Biser Dimitrov, Global Head, Distributed Ledger Technology Center of Excellence at Citi. “We look forward to being a part of this cutting-edge community.”\n\nWith the addition of BNDES, numerous regional blockchain development networks now use Besu, including LACChain (IDB), Europe’s EBSI and Spain’s Alastria network.\n\nAnother Brazilian institution, Banco Central do Brasil, uses Besu as the foundation of its wholesale central bank digital currency (CBDC) project, DREX.\n\nHyperledger Besu Financial Services Working Group\n\nThe central bank is one of the members of the new finance working group led by the DTCC. Others include Accenture, Consensys, Citi, Japan Securities Clearing Corporation (JSCC), Kaleido, LACNET, Mastercard, Santander, Visa, and Web3 Labs. Recent Blockdaemon research found that 44% of 92 institutions it explored used Besu.\n\n“The number of enterprise users of Hyperledger Besu in the digital assets space is rapidly increasing, underscoring the need for establishing a collaboration space for the financial services industry to align on development priorities,” said Carlos Vivas of the DTCC, and Chair of the working group.\n\nHyperledger already has a special interest group (SIG) for the financial services sector. However, the SIG’s focus is on general financial services use cases and is not linked to one of Hyperledger’s 13 projects. In contrast, the new Besu Financial Services working group is a technical working group that will influence the Besu roadmap.\n\n“It’s creating an open forum for anyone to participate. You don’t have to be a member of the Foundation,” said Daniela Barbosa, Executive Director of Hyperledger Foundation. “But many of our founding members, including our newest one, Citi, are taking leadership roles in that working group. And it is a place for the end users and the engineers at those financial services companies to work on requirements to help the maintainers of Besu understand the critical features that need to be implemented and moved forward in the Besu project.”\n\nEyes on public blockchain\n\nA key driver in Besu’s popularity is the potential for institutions to use public blockchain now or migrate some functionality in the future. Besu is the third most popular Ethereum software client, used by about 9% of public mainnet and especially by institutions. In January the second most popular client, Nethermind, had a bug that caused an outage, highlighting the importance of diversifying clients.\n\nThat could be a pro and con for Besu. On the one hand, it could help drive further adoption on public blockchain. But there’s also an argument that Besu could become overly dominant for permissioned Ethereum instances. Hence, a bug could influence several institutional infrastructures. One counter argument is that permissioned chains have greater control, so the risks are not as significant."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNa1lzQ3FsYXJIUlJ4dGhxOGlqaWNNLU1CVkgwVmJlWEpaM0IwSkY3UVZNVFYzeUlvSTM5dlV2YzdJQ25tMzBiQlAxOFMySXNDRlhZTGF0WUZzdDdUaWxmN21RN0ZUU2tPVFFDN1RrWjVTWTB6TzdfOXRJNjFfYjNBX0xJUTfSAYoBQVVfeXFMTTNvc2puREVubUNxLUd1TTVPODR0dkdfOWYtODVpQWVmUEV2N01fWkNJNjhkaXB5SzJVaE5ROFFEeVBSSmZNSHFzblJiQWdhdzdkdmFzVGFqZ0xWTVlJTW8wM1JzUEs0ZXVfS2I1MWZNZklrdW1XM01GOHV6RG5ZSENPMUpvQk1JSXFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF: Fidelity Adds Staking In Latest Filing - CoinGape",
        "content": "The serial delay of the United States Securities and Exchange Commission (SEC) on spot Ethereum ETF has done little to deter Fidelity Investments as the firm just added the Staking option to its filing.\n\nFidelity To Add Staking to Spot Ethereum ETF\n\nIn November 2023, the American investment management firm applied to list its Ethereum spot ETF product with the SEC. This made it the 7th firm in the U.S. to gravitate towards the product after the likes of BlackRock, Hashdex, Invesco, and Grayscale Investments.\n\nadvertisement\n\nThe spot Ethereum ETF, if approved, will trade in compliance with the BZX Rule.\n\nOrdinarily, the SEC is expected to decide on the rule change within 45 days of its publication for public comment. However, the decision from the agency did not come as expected even after the request for public comment was made in the first week of December. Rather the SEC announced a 45-day extension, pushing its decision on the Fidelity spot Ethereum ETF to March 5.\n\nFIDELITY ADDS STAKING TO THEIR ETH ETF APPLICATION IN AMENDMENT Source: DB | Coins: ETH — db (@tier10k) March 18, 2024\n\nIt is already way past the expected date and no decision has been made by the SEC on Fidelity’s spot ETH ETF or that of any other applicant. As it continued waiting for the SEC, Fidelity decided to add staking for the cryptocurrency. Precisely, the asset management firm is looking to stake a portion of the fund’s assets through one or more trusted staking providers.\n\n“In consideration for any staking activity in which the Fund may engage, the Fund would receive certain network rewards of ether tokens, which may be treated as income to the Fund as compensation for services provided,” Fidelity stated in its amended spot Ethereum ETF filing.\n\nDeadline Fast Approaching\n\nIn the meantime, the duo Ark Invest and 21Shares are still anticipating a decision for their joint spot Ethereum ETF by May. Also, industry observers are closely watch the May 23 deadline for VanEck’s filing, a make or mar point for the product.\n\nConsidering how much the regulator has consistently extended the date for its decision, it is not certain that the SEC will stick to the next deadline. Top industry players like JPMorgan already doubt the possibility of the SEC’s May approval for Ethereum ETFs.\n\nStill, the recent move from Fidelity Investments to amend its filing suggests that these spot Ethereum ETF applicants are doing their best to keep hope alive.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZXlWMzF4MWtueWVxTGM2Q3hWOVpBX0MzMU1yNmlVSjhrY3lfRXBpVkE3dXJNMUZuWFN4V0JmSnF4d3FrWGlhVGppc3hFZF9EOEVsb1UybFd3TUZtSDIzdlJCbGNFTkNWOEI2LXQ5R21aOXhNR1FHZUloVzQyN0RuVGNVT3AwLXlN0gGOAUFVX3lxTFA4VWlYM2JyaDh1dVdPZ3VBYVktUm42d1V5WVNobFZMNE9WZFhDZWQ2N2lINlY3UGhKMUxpbXpvUDNveXJ3azc1VU1zSnpSeU81bDhUSEFoc0MyS0pyNkZGR290OWZCaTNVLXRtQ2owUmxvYTlyWnlJeS05bHFUdXFHSlBTQW5yZG5wTTgzX2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana’s 22x hike from 2022’s low flips BNB – Is Ethereum next? - AMBCrypto News",
        "content": "Solana beat Ethereum in DEX volumes for the second straight day.\n\nFees on Solana hit an all-time high on the 17th of March.\n\nIn a significant achievement, Solana [SOL] leapfrogged Binance Coin [BNB] to become the fourth-largest cryptocurrency by market capitalization, presenting a compelling case for inclusion in investment portfolios.\n\nAccording to CoinMarketCap, the altcoin, which underpins one of the largest smart contract networks, increased by more than 10% in the last 24 hours. It reached $200 for the first time since October 2021.\n\nAt press time, SOL was 22x higher than the lows of the 2022 crypto winter.\n\nNetwork activity imparts value\n\nThe increasing on-chain activity was likely boosting the coin’s value.\n\nSolana logged the highest decentralized exchange (DEX) volumes for the second straight day, surpassing Ethereum [ETH] and all its associated layer-2 (L2) networks, AMBCrypto noted using DeFiLlama’s data.\n\nAs evident below, Solana’s weekly DEX volumes have been growing steadily over the past month, reaching an all-time high (ATH) of $17.5 billion last week.\n\nHigher engagement with DEXes meant a higher number of transactions, and therefore higher fees. Solana recorded its highest on-chain fees on the 17th of March, totaling $3.82 million.\n\nEthereum’s on-chain fees have declined in recent days, while Solana’s have increased. If the trend holds, Solana could flip Ethereum as the chain with the highest fees.\n\nSince the network burns a percentage of the fees earned in SOL, such high levels of network utilization indirectly aided the coin’s upward climb.\n\nIncreased profit-taking a worry?\n\nEven whales found it tough to resist the temptation, seeing SOL’s rally. According to Lookonchain data, large investors started offloading their SOL holdings to make profits.\n\nHow much are 1,10,100 SOLs worth today?\n\nOne particular whale moved a whopping 200k SOL coins, worth $40 million at press time, to cryptocurrency exchange Binance over the past two days.\n\nWhile this may reflect profitability now, a sustained period of whale sell-offs could apply brakes on the ongoing rally."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUEUwUFlpU00tZ1gwMmVObTg3ZXQwTEtuQlRxQXJoYnQ2c2Y3Nm1QNHBRSkVYZzFHTF9vTTJWRUNPUmNiajFDVXI0aW5IUVptbW1rMUthX0Z3UFJhVmJwbE9weWxFSy1fZi0wcXN1WTNxN010RmsxblpkM0NDcHlmaGM5ZVJsQld3UHlFX2RoVFI4VVph0gGaAUFVX3lxTFA3Xzh0NzZncEIySzI4cGlNQXZCUGVXR0o2UnlGUUl5eDMyZThfWXJ0MEthWVRCY2Ffa2U1NlNLMjJJWG1ZVlc1MHRpNkFjNGp3aXhWY3A5VXVzUVZjQk5mN0xibTdnZEhNUjREQWItRHhaamxMcDZ5Q0c1RHZyZ0d4TnZYRENsT0ZpdUppMHIzTjBFcWV1MjY5MHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana a better version of Ethereum? Arthur Hayes has this to say… - AMBCrypto News",
        "content": "Solana’s recent performance has revived the old ‘Ethereum-killer’ debate again\n\nComparisons arose after SOL flipped BNB recently\n\nThe Ethereum vs Solana debate took a renewed twist in the third week of March after Solana hit crucial milestones.\n\nFor starters, Solana’s [SOL] search interest on Google Trends surpassed Ethereum [ETH]. This indicates a spike in retail attention to SOL compared to ETH.\n\nAdditionally, SOL flipped BNB based on market cap and climbed into the top 3 in the DeFi ranking.\n\nCrypto influencer Anthony Pompliano recently interviewed Arthur Hayes, a serial investor, co-founder, and former CEO of BitMEX.\n\n\n\nHe asked for his thoughts on the ETH vs. SOL debate, and Hayes offered his candid opinion.\n\n“I don’t think anything is going to be ETH.”\n\n\n\nHowever, he added that Ethereum is the home of DeFi and hosts most of the first versions of dApps (decentralized applications) before they launch on other networks.\n\n“If you think of primitives of DeFi and dApps, the first version is always on Ethereum. It’s not on Solana, AVAX, Cardano, or any other blockchains.”\n\nHowever, Hayes highlighted why DeFi applications might migrate to other networks like Solana.\n\n“Maybe there are reasons like network bloat, gas fees; then they move over to Solana or other chains.”\n\nHe added,\n\n“But you’re not seeing a new primitive emerge on a non-ETH chain first. If I start seeing that happen, I may have to change my mind on my maximalist position on ETH.”\n\nSolana is great if you “missed” discounted ETH\n\nInterestingly, Hayes confirmed that he trades most L1s but categorically highlighted Solana as a great opportunity for anyone who missed cheap ETH.\n\n“Solana is a better version of ETH; I disagree, but that’s what they believe. It could trade to $5K-$10K in this cycle. So buying it at $140 is a great asymmetric risk profile.\n\nAdditionally, he highlighted Solana’s UX/UI as the best in the ecosystem and easy to use. Hayes believes these conditions could make Solana the best performer in this cycle.\n\n"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9TNHJVYVNZMXdEQ0hxc2RZY1RlaXRiWFZ4Y1FWY1FKRFhWblkzc0VCOUxHbmF1STdEZFRJcGpQNzFmN2I5MlRXUWJjdk5JbGxIMGtFcFBRR1dKbGNjMmFFazFrcURVXzRiWjBJVEFqN0dxQ1Ns0gF8QVVfeXFMTmhiQ3V5Y25adGNMTEYxY1BBdm9BTktFY25jV3o4eFhOT2gtN2VuN3FHYTBTRlZ3ZWk0aVpuajVVRjIyT0Z2T3BEYjJySWZFUENjNENTcE1aUlgwNlhDRUowUkpMV1ZoUzNTR3VvRUV1dW9JYWYtYVpuWFZycg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Memes Have a New Top Dog: Dogwifhat Ethereum NFT Sells for $4.3 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn Ethereum NFT photo of the original Dogwifhat meme—which inspired one of the hottest Solana meme coins of the moment, WIF—was sold for a whopping $4.3 million worth of ETH early Monday, narrowly surpassing the previous record held for most expensive meme NFT ever sold.\n\nThe on-chain image of a Shiba Inu puppy in a knit beanie sold for 1,210.759 ETH early Monday, a sum worth $4,311,234 at the time of the transaction. The NFT sold to GCR, a prominent pseudonymous crypto trader, via an auction on the digital art platform Foundation.\n\nJust two hours before the auction concluded this morning, the Dogwifhat NFT had only secured a top bid of 55 ETH, worth about $195,000 at writing. Then, a furious bidding war ensued between GCR and Memeland, an NFT venture collective from the team behind social media platform 9GAG. Memeland bid as high as 1,100.69 ETH before GCR secured the piece with a final offer north of $4.3 million.\n\nThat figure officially—if ever so slightly—makes today’s Dogwifhat NFT acquisition the most expensive meme NFT sale of all time. The record was previously held by the original Doge NFT, which sold to the collective PleasrDAO on June 11, 2021, for 1,696.9 ETH—a sum then worth $4.234 million.\n\nAD\n\nAD\n\nCongrats, Achi! On Nov. 17, 2018, Achi's owners captured him in an endearing hat on camera. On Mar. 18, 2024, that photo, Achi, dog wif hat, became our second highest auction, collected by @GiganticRebirth for 1,210.759 ETH ($4.3m USD). pic.twitter.com/KrAeQ5WMVm — Foundation 🌐 (@foundation) March 18, 2024\n\n“It went for far more than expected,” Path, the pseudonymous facilitator of the Dogwifhat NFT sale, told Decrypt. “I think it’s great for the entire category [of memes] and the concept of provenance. WIF is definitely more crypto-native than Doge.”\n\nThe NFT was put on sale by two South Korean pet owners who took the original photograph from the viral Dogwifhat meme back in 2018—one featuring their Shiba Inu, Achi. Achi’s parents will now receive the entirety of the proceeds from today’s sale, Path said, after Foundation takes a 5% platform fee.\n\nWhile a $4.1 million payday for a photo taken of a dog in a beanie is certainly nothing to scoff at, the haul pales in comparison to the amount of money that’s been made on Achi’s likeness in the last few months.\n\nAD\n\nAD\n\nWIF, a viral Solana meme coin inspired by the Dogwifhat meme, has skyrocketed since its creation in December. On Friday, the token reached a record $3 billion market capitalization. It then fell off slightly over the weekend, before climbing another 25% in the last 24 hours.\n\nIn one sign of the meme coin’s absurd success, several WIF community members raised nearly $700,000 last week to plaster Achi’s face on Sphere, the massive LED screen-covered arena in Las Vegas.\n\nYet so far, it appears that none of WIF’s spoils have made their way back to the family of the dog who inspired the meme coin’s meteoric rise.\n\nMonday’s NFT sale has done something to rectify that incongruity.\n\n“The rightful photographer and owner of the adorable Dogwifhat puppy… has been rewarded directly,” Smoke, who works for the organization that bought the original Doge NFT from its photographer, the Japanese kindergarten teacher Atsuko Sato, told Decrypt.\n\n“In this way [Monday’s sale] is very similar to the original Doge NFT auction,” Smoke continued, “where Atsuko Sato benefited directly, thanks to the power of blockchain technology.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxQamtJRjFBbU9wUzk2OUVfZnFFdnF0RnNtYVVYdFY1U3c4TFZxWjBXSlAxVm9Ec2JJTzF4RkhHM3o0MzItNTM3V3JTZDhOZ1A0eHdFa1lkdnhMU1R6SnR3N1kyelAxVXVFNTFTMTVlUm9xZ1c0Q1FMdEtpcFFnT2R3b0hxTm9jSEs5ZjZIUXNhQjdqbjhPX0p3eG1HRnc5V2ZZQ3BOZTBzVnZEY3NJM0JqNkYxUDJoRkh3TV9RbWQyY0Y5OTdqVW10ZE9YWlZrWlpWb0hXdXlTUzZjcnV3enVBY1QyMnjSAeoBQVVfeXFMTzFGNzdsM1Jhc2RqVm50T2I0dXdjc0NwWkZacEZTRlNnQlRyT19XSlFzRlYxY3R3LWc0aFhMVmtVbzhNdmxYLWhMbExzQTlwdzVoYkx4aTF4cnBJX1U5dnlLWkx6YUp0VHI2bUlxQXZmQ3U0UXJwdjNlaHpITGpzczg1eG5MWnpud3BfRnVxSlBBQVNqdGQtYTcyRVdhQ1dOT2VLM016Q1NxRkcxLVpESDNpRDJKVTRDWURCcVI1RllnSnBCMUVhWjk5SWhBcDNoOVFWd0F4UXhyZ3dxcDdFdXY3cTh3WFNHY2JB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Top 3 Altcoins That Will Dwarf Ethereum Gains In 2024: Shiba Inu (SHIB), Retik Finance (RETIK), Dogecoin (DOGE) - ThePrint",
        "content": "New Delhi [India], March 18: The quest for the next big thing in the cryptocurrency market is relentless. While Ethereum has long been a dominant force in the market, poised for steady gains, there are three altcoins on the horizon that promise to dwarf the gains of even the mighty Ethereum in 2024. Shiba Inu (SHIB), Retik Finance (RETIK), and Dogecoin (DOGE) are primed for a massive rally, fueled by unique factors that set them apart in the crypto sphere.\n\nShiba Inu (SHIB): A Resilient Meme Token\n\nShiba Inu (SHIB) emerged as a frontrunner in the meme token craze that swept the cryptocurrency world in recent years. Initially dismissed as a joke, SHIB has defied skeptics, establishing itself with a dedicated community and resilient market performance. In 2021, SHIB surged in popularity, riding the wave of meme coin frenzy. Despite initial doubts about its utility, SHIB has continued to thrive, displaying bullish projections and signaling potential for higher prices. In just the past week, SHIB’s price soared by 50.13%, marking its largest weekly gain since February and reaching $0.00003355. Several factors contribute to SHIB’s recent surge. Positive sentiment within the community, coupled with optimism surrounding the approval of Bitcoin exchange-traded funds (ETFs), has fueled renewed interest and momentum in the token. As SHIB continues to demonstrate resilience and attract attention, it stands poised for further gains that could dwarf even Ethereum’s gain in 2024. With its ability to captivate investors and defy expectations, SHIB exemplifies the unpredictable yet exciting nature of the cryptocurrency market, cementing its position as a force to be reckoned with in the meme token landscape.\n\nRetik Finance (RETIK): Igniting Frenzy in DeFi\n\nRetik Finance (RETIK) made an explosive entrance onto the cryptocurrency scene during its presale phase, witnessing a remarkable surge of 4x that thrust the project into the spotlight. Garnering an impressive $32,050,000 during presale, Retik Finance captured the attention of investors, highlighting its compelling value proposition and instilling widespread confidence in its vision. The overwhelming response to Retik’s presale underscores its appeal within the decentralized finance (DeFi) community. Analysts are now closely monitoring Retik’s trajectory, projecting a potential 24x increase in its valuation. Central to these forecasts is the anticipation surrounding Retik’s forthcoming exchange listings, expected to catalyse further growth and liquidity. As Retik gains traction and cements its position in the DeFi landscape, it emerges as a formidable contender poised to dwarf Ethereum’s gains in 2024. With its innovative approach and robust community support, Retik Finance is positioned to make a significant impact on the evolving DeFi landscape, offering investors an enticing opportunity for substantial returns in the coming year. With its potential to disrupt traditional financial systems, Retik Finance (RETIK) embodies the spirit of innovation and possibility within the cryptocurrency space, promising a bright future for those who choose to invest in its vision.\n\nDogecoin (DOGE): From Joke to Serious Contender\n\nOriginally conceived as a lighthearted joke, Dogecoin has evolved into a significant player in the cryptocurrency world. With its recent surge in price, including a sustained an astonishing 113.88% surge in the past 30 days, DOGE is garnering attention from investors across the spectrum. Ranked 9th among cryptocurrencies with a market cap of $24.5 billion, Dogecoin has demonstrated remarkable staying power and potential for further growth. Supported by a robust level of $0.17 and a significant spike in trading volume, DOGE is positioning itself as a lucrative opportunity for investors As Dogecoin continues to exceed expectations and assert its presence in the market, it represents a compelling option for investors seeking substantial gains that could potentially dwarf the Ethereum gains in 2024. With its newfound legitimacy and growing popularity, DOGE has transformed from a joke into a serious contender in the ever-evolving landscape of cryptocurrency.\n\nConclusion\n\nIn the dynamic realm of cryptocurrency, opportunities abound for those willing to venture beyond established giants like Ethereum. Shiba Inu, Retik Finance, and Dogecoin stand out as three altcoins poised for monumental gains in 2024. With unique strengths, dedicated communities, and bullish projections, these altcoins are on track to dwarf even Ethereum’s ascent, captivating investors and reshaping the crypto landscape in the process.\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nTwitter: www.twitter.com/retikfinance\n\nTelegram: www.t.me/retikfinance\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by VMPL. ANI will not be responsible in any way for the content of the same)\n\nThis story is auto-generated from a syndicated feed. ThePrint holds no responsibility for its content."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWkhDeWFEZTVXNmhVRFF5VWgzaGp3ZUxFQTJnUnZYZVlFY2NpQ282aERCTklvUEI4OXBKeXY2MUtTLUJGTmRQLW00X1B6cVNDdkV2V1hVVGNxWU1DbVVtcjM5NWZiNTNpTXBRSTUwVTBDYmxuVV9ocmhKZVY3RTVZTmNFYnJCQ1UzbEs2WVpuNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Crypto: Approval Odds for Ethereum Spot ETFs Stand at 85% - Cointribune EN",
        "content": "Tue 19 Mar 2024 ▪ 3 min read ▪ by Ariela R.\n\nThe potential approval of Ethereum Spot ETFs by the SEC will certainly mark a turning point for Ethereum as well as the cryptocurrency market. What changes would this imply for the Ethereum ecosystem and crypto investors?\n\nCrypto Weekly Roundup: Ethereum Dencun, Market Dumps, & More\n\n\n\nAfter weeks of Bitcoin dominating the crypto news, Ethereum has chalked up another significant milestone – the launch of its much-awaited Dencun upgrade, which went live on March 13.https://t.co/yUkS2PTIfy — Crypto Daily™ (@cryptodailyuk) March 17, 2024 Following the Dencun update, the crypto community is eagerly awaiting the approval of the Ethereum ETFs\n\nThe Ethereum Spot ETFs: A Hope for May\n\nFor several months now, speculation has been rife about the approval of Ethereum Spot ETFs and its impacts on the crypto market. According to My Betting Edge, applications for Ethereum Spot ETFs have an 85% chance of being approved by the SEC in May.\n\nThis anticipation is already generating considerable interest within the cryptographic community. Indeed, it could signify a new era of institutional investment in Ethereum crypto. “Ethereum Spot ETFs could transform the crypto market in May,” highlights the analysis. It sheds light on the potential impact on market liquidity and diversification.\n\nThe approval of these crypto assets would indeed be a significant step forward. It would offer professional investors a direct way to invest in ether, without going through the ether futures contracts listed on the CME.\n\nThe SEC and Ethereum ETFs: A Decision Highly Anticipated by the Crypto Community\n\nThe decision of the SEC is crucial, as it will influence not only investors but also the overall perception of cryptocurrencies. The SEC’s delay in the decision on spot ETF projects and the request from Grayscale Investments has created suspense.\n\nIf approved, the Ethereum Spot ETFs could attract a new wave of cryptographic investors. Above all, it would strengthen Ethereum’s position as a leader in the crypto sector. This could also promote:\n\nincreased diversification of the Optimism (OP) ecosystem,\n\nbetter availability of ZK-Rollups applications.\n\nWhile the Dencun upgrade was a success, the crypto community is eagerly awaiting the SEC’s decision regarding Ethereum Spot ETFs. According to some cryptography experts, the My Betting Edge analysis may have been generated by a chatbot. Nonetheless, all projections are worth considering!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOM0FCdXo5QUJfSnNhWUJVZXNGeGV4RVp4WnVlNWtkVDVjSGFsQnV1ZXpCRjVvZXJaei10SXFBT1h1TmJOUFBtOGkySXVmaFZqNlZ6c2l1QkY5bDhqOVl2VUFiQmZYXzQ5VGtISWxsdjV6VDVLOFgwSVdRb0gwblJJSkdVNmIyaHhDOGNRRNIBkgFBVV95cUxQb0MyNzZ0MDNJWGdXOXU0czRBMGtuOFFnTE8wSmJTUE5ZVlJCVF8tU1Q2Skk0OTQwN0JNM2F6aUJjZVlEQkZRVXpLQnhGTUtxNF96T3dhZi1VRENCd2dCazctLVIyMXpIUHpBWDZnOU9EWjViZDRhaUJVWlZXZEotVW43RkJlODZPOUthOVUxa1F3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin-based collections have an edge over Ethereum NFTs – Here’s why - AMBCrypto News",
        "content": "NodeMonkes logged the second-highest sales volume in the last 24 hours.\n\nBitcoin was the top-ranked chain in NFT sales over the last week.\n\nThe non-fungible token [NFT] market has been known for its ebbs and flows through its brief history, with exciting projects popping up at different stages to pique the interest of enthusiasts.\n\nNodeMonkes makes waves\n\nThe latest sensation happened to be Bitcoin [BTC]-based NodeMonkes.\n\nAs per AMBCrypto’s analysis of CoinGecko’s data, its floor price surged by over 50% in the last 24 hours, propelling it to become the second-largest NFT collection at press time.\n\nA floor price is the lowest price that an NFT can be sold for. In recent years, it has become the gold standard for evaluating the growth of a collection. The higher the floor price, the better.\n\nAs of this writing, NodeMonkes’ floor price was 0.82 BTC, worth over $55k, placed just below the blue-chip powerhouse, CryptoPunks, whose floor price was above $177k.\n\nThe highlight of the surge was how NodeMonkes surpassed the other giant, Bored Ape Yacht Club [BAYC].\n\nThe Bitcoin-based collection also logged the second-highest sales volume in the last 24 hours, totaling over $4 million. This represented a jump of 106%.\n\nA product of the now-popular Ordinals technology, NodeMonkes are a collection of 10,000 unique monkey-inspired digital artworks.\n\nThe NFT grabbed the attention of the market earlier this month, when one of its sales topped $1 million.\n\nNote that this sale came alongside a sharp uptick in Bitcoin’s price, which likely contributed to the USD figure.\n\nOrdinals power Bitcoin’s NFT ecosystem\n\nBut NodeMonkes wasn’t the only Ordinals-based collection making waves in the market.\n\nRunestone, a project led by Ordinals developer Leonidas, saw a 40% spike in its floor price in the last 24 hours to top 0.04 BTC.\n\nThe success of these collections reflected a paradigm shift in the broader NFT landscape.\n\nEthereum [ETH] NFTs have dominated this sector ever since they burst onto the scene in 2021.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nHowever, the introduction of Ordinals has altered the dynamics significantly, causing Bitcoin to become the most-favored network for NFT transactions.\n\nAccording to AMBCrypto’s analysis of CryptoSlam’s data, Bitcoin was the numero uno chain in NFT sales in the last week, followed by Ethereum and Solana [SOL]."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxPcWVnNU1aZjJRNWZnZ0pBcmxDTlZWNkJVVXJpRi14cHRUa0lzc1ZUd2hEQ2xMaEdDQ2xycUtwY3h6R3NoNkVoVC14ZTJIcmZUMnJIOHVuYzR4OV82TVQtVXZqTU9CTG1tbGlERFdncV9qeUlhbTRVN3BFVkNfQ2FGMUJRVGJjYlNNRnlwNUFva2dtVTA1Zldtemp1b3Z4bVBpdlZMRS1LTXpaN1BodFI3dFVYZmEtTTJPbjZIQlJYWVZ4ckMtS2o4UktNazIzU3NaYTJKSWRWLThUQ3BUTUFhMk15SFd5WjZuSVFRV24xbDA0d0c5X2lfS3lSTnTSAYoCQVVfeXFMTWp4NVhIdjlGRDZaOW5nMFhIX3J3S18zTlN0TnkxYmpibGpfZlZFUVpqZlhBWG5mazFfOUdpZy00ZDhkVlV6X0xka0dlNUhRSVVNZTNGaXAyaFl4bFRXMkxITGlSaFI0NXlESnhPXzljeHg4RnZ5UFFCVjZkQXE5UTBDcDBzVWE5VHJheEhKVzhzaWtHY3gtREJ0bkpKejRncFc2bkxxVk5sM3M0b1ptZWJ4WkUydVY1dWVXcHVlaUd2a2NEZWFVV1B0R1hHVFkyZlA3YzZSQnBsZzFKQkNqcmZuMW9UX0tfbnVUczVBTVBUTlVZYi12XzREa0FDZGNOd0RTdnQzUVRhYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Raffle Coin (RAFF) Draws Ethereum (ETH) and Chainlink (LINK) Supporters, Setting Stage for Impressive Returns - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPWGY4Z0tOcm80bGhHOVdlYkYyLVpEU0k4ZkowNnM5d3lnWGRING5Jdnh4NGU1aXlZRXhIUTVlUTFlQURjN0lLSWdEcEtpRXJBTXBvcHNpa2tjbzVVdmY5SmZHN29wdVl4Vno3ek9IWXEzZXlhdnFGek9Wc2g4UEVVamJKLUtQMVhRaDNLOWk0MWdmQ1VoUWplWTA0b1o3Yzk1Sk1EdTdPTGtueUVIdzM0NEoxSzZXOHFqdGxheGZzYWHSAc4BQVVfeXFMTnVJdUdTdUVCSHl1SXAtendyRnNNWi1XZHJzaDNPM1JnNUV1RHlFUEV0SG9pQjV6M0hUYlMwZzdCdG1GVU9tTU1hclJxaDdOeHVjcFNrZlRBdW92cngyTkc3YkJRSlVfdFNjSWpnZ3YxYlM0YU0wa3Z6aGV0YkdtMzg2MjAxUDk3SWxRRzB6VWlzUnNMclBrQmFyblBLQmdrWGI3ai1QbnNOMURYdFdvZTJOWE9kMTBWMmFwTllqVzdWZEt1QU15ekNMdGxuTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s Price Adjustment: Understanding the 5.08% Decline - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1uYV9IMzdWX2RHX183Snc2REdSZDVRUFI1YzZ2UUdQWkNFNjVHVUc3S19ESkxFek9TdW1mQmRXZ2VRYzFUd3BnTHNwQnNOUFFaRVFNc2lINW4xdVBXTGQ5TE9mSzBRZ9IBakFVX3lxTE05alNaNE5qUy1fenVBN3BkUlkzTi1YNzVJVUZtS3FtczFnRTZ5dG9ELTVsRDZFZHpJOUZqVnBXLXdYb3daZTF4cDFyTGhjRTZySE5SQU9wYUFDUUI4UExySGR0bVVaY1phSFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum: Which Smart Contracts Blockchain Should You Pick? - CoinCodex",
        "content": "Solana and Ethereum are among the most important blockchain projects on the market today, and are the go-to platforms for anyone who’s looking to build or use decentralized applications.\n\nWe’ll be comparing Solana vs. Ethereum in several categories to help you understand the most important differences between these two leading blockchains, as well as the areas where they are similar.\n\nKey highlights: Ethereum and Solana are currently the leading blockchains with smart contract capabilities.\n\nThe Ethereum ecosystem is substantially larger than the Solana ecosystem, although Solana has been seeing a resurgence since late 2023.\n\nSolana currently offers much lower fees and faster transactions than Ethereum.\n\nEthereum is primarily looking to improve its scalability through layer 2 platforms, while Solana developers are focused on layer 1 improvements.\n\nETH is currently deflationary due to EIP-1559 token burns, while SOL is designed to have a long-term 1.5% yearly inflation rate.\n\nSolana vs. Ethereum – Comparing the two leading smart contract platforms\n\nNow, let’s get right into our analysis of the differences and similarities between Solana and Ethereum. We’ll be taking a quick look at the projects’ histories, approach to scalability, consensus mechanisms, smart contract capabilities, and more.\n\nHistory\n\nEthereum was first conceived in 2013 by Vitalik Buterin, who also authored the Ethereum whitepaper published in 2014. The project successfully raised $16 million in an ICO in August of 2014. Besides Buterin, the Ethereum project was also co-founded by Gavin Wood, Joseph Lubin, Charles Hoskinson and Anthony Di Iorio.\n\nThe initial development of Ethereum was led by a Swiss non-profit called the Ethereum Foundation, which continues to play an important role in the Ethereum ecosystem today. The Ethereum mainnet launched in July of 2015.\n\nSolana was initially proposed in 2017, but the network itself made its debut in 2020. Solana was created by Solana Labs, an organization founded by Anatoly Yakovenko and Raj Gokal.\n\nPrior to the launch of the Solana blockchain, the project raised funds for development through private token sales and a public sale on the CoinList platform. In 2021, Solana Labs raised a $314 million funding round, which eclipsed all the project’s previous capital raises. This funding round included investments from leading crypto venture capital firms such as Andreessen Horowitz, Polychain Capital and Multicoin Capital.\n\nSmart contracts\n\nAlthough Ethereum and Solana have significant differences in how they operate under the hood, they are both decentralized blockchain platforms with general-purpose smart contract capabilities.\n\nTherefore, they can both be leveraged for use cases such as custom tokens, NFTs, decentralized exchanges, lending protocols, prediction markets and on-chain governance systems.\n\nEthereum smart contracts are written in a custom programming language called Solidity, which is influenced by popular programming languages such as C++, Python and JavaScript. Due to the popularity of Ethereum, Solidity has become a well established language for smart contract development and there is a robust ecosystem of development tools specifically designed for it.\n\nMeanwhile, smart contracts in Solana are written in the Rust, C and C++ programming languages, which are mature programming languages that many developers are already closely familiar with.\n\nConsensus mechanisms\n\nBetween its launch in July of 2015 and September of 2022, Ethereum used a Proof-of-Work consensus mechanism. Ethereum mining was commonly performed with GPUs (graphics processing units), although there were also ASIC miners available for the Ethereum’s Ethash algorithm.\n\nIn September of 2022, Ethereum successfully underwent a transition to a Proof-of-Stake consensus mechanism. This has significantly reduced the environmental impact of the Ethereum network, and has also opened the doors for certain scalability improvements, which wouldn’t have been possible under Proof-of-Work.\n\nSolana developers the Proof-of-History protocol to provide reliable and fast synchronization between nodes and validate transactions reliably. However, it’s important to understand that Proof of History is not a stand-alone consensus mechanism – it’s a protocol that supports Solana’s Proof-of-Stake consensus mechanism.\n\nETH vs SOL\n\nThe native asset of the Ethereum blockchain is called Ether, and it’s commonly referred to with the ticker ETH. All transactions on the Ethereum blockchain require a fee paid in ETH – this is required to dissuade spam transactions and provide an incentive for validators to continue securing the network.\n\nThe supply of ETH doesn’t have an upper limit. In practice, the supply of ETH has actually been slowly decreasing since September 2022, when the Ethereum network moved over to Proof-of-Stake consensus.\n\nThis is because the number of ETH that’s being burned through the EIP-1559 mechanism is greater than the number of new ETH that’s being created to reward validators. This could change in the future – if demand for transaction on the Ethereum network drops substantially in the future, it’s possible that the Ethereum supply could begin inflating again.\n\nThe base unit of ETH is called wei. One ETH consists of 10^18 wei (1,000,000,000,000,000,000). Since wei is such a small unit, it’s not used very commonly to refer to prices. Ethereum gas prices are typically expressed in gwei, which equals 10^9 wei (1,000,000,000).\n\nSolana’s native asset is SOL, and performs a similar role as ETH does on Ethereum. A fee paid in SOL is required for any transaction on the Solana blockchain, and Solana validators are rewarded with SOL for securing the network.\n\nThere is no maximum limit to the SOL supply, and the supply of SOL is actually designed to gradually increase over time. The initial SOL inflation rate was 8% per year, although it is designed to gradually increase until it reaches the long-term target of 1.5% per year.\n\nThe base unit of SOL is called a lamport. One SOL consists of 100 million lamports.\n\nScalability\n\nEthereum’s scalability on the base layer is quite limited, and the Ethereum ecosystem has been focusing on improving scalability through layer 2 solutions that rely on the Ethereum mainnet for security while offering cheaper and faster transactions to users. This is achieved through various means – for example, layer 2s that use “rollups” bundle multiple transactions into one transaction, which is then posted to the Ethereum mainnet.\n\nIn terms of improving layer 1 scalability, Ethereum developers are working on sharding. Through the implementation of sharding, the Ethereum mainnet will be split into smaller, interlinked networks known as \"shards.\" These shards will independently process transactions and execute smart contracts in parallel with one another, which is expected to provide a big boost to the amount of transactions the Ethereum network will be able to process and significantly reduce transaction fees.\n\nMeanwhile, the Solana ecosystem is focused on scaling directly on the base layer instead of relying on layer 2 solutions. Solana is already one of the cheapest cryptos to transfer, but could deliver even better scalability in the future. Here, we should mention Firedancer, a Solana client that’s being developed by a team from the high-frequency trading firm Jump Trading.\n\nBuilt from the ground up, Firedancer aims to optimize networking, consensus rules and runtime processing in order to overcome current software bottlenecks.\n\nAccording to revealed benchmarks, Firedancer can already handle over 1 million TPS per core in testing environments. Once validators running Firedancer come online, the Solana mainnet could see dramatic leaps in throughput and efficiency. The client diversity also improves decentralization and resilience.\n\nDecentralization\n\nThe Ethereum network is viewed as being much more decentralized than the Solana network, although Solana has perhaps been treated a bit unfairly in regards to decentralization.\n\nPer data from Ethernodes, there are 7,292 nodes active on the Ethereum network at the time of writing this article. These nodes are spread out across more than 50 countries, although there is a relatively concentration of nodes in Europe and North America.\n\nWhen it comes to client diversity, there are 4 main Ethereum clients in use today: Geth, Nethermind, Besu and Erigon. Reth, which is an Ethereum client written in the Rust programming language, is also seeing some adoption.\n\nAccording to data from Solana Compass, there are 2,919 active nodes on the Solana network at the time of writing this article. These nodes are spread out across 211 different cities in 31 countries.\n\nIn terms of clients, Solana node operators currently have two options: a client developed by Solana Labs and a client developed by Jito Labs. Firedancer, which is being developed by Jump Crypto, will provide another alternative once it sees its mainnet launch sometime in 2024.\n\nSolana has seen considerable criticism due to several incidents where the network experienced downtime. The most recent Solana network outage came on February 6, 2024, when the network was down for roughly 4 and a half hours. Other major Solana outages happened in October 2022 and February 2023. You can view a comprehensive history of Solana’s uptime and outages on the Solana status page.\n\nValidators\n\nBoth Ethereum and Solana are permissionless networks, which means that there is no whitelisting requirement for anyone to join the network as a validator. However, operating a validator is not particularly accessible in practice when it comes to both Ethereum and Solana.\n\nIf you want to operate your own validator on the Ethereum network, a stake of 32 ETH is required. Based on the ETH price at the time of writing this article, this translates to just over $118,000, which is an amount of capital that most ETH holders simply don’t have or can’t afford to invest into a volatile cryptocurrency.\n\nETH holders who don’t have 32 ETH but still want to participate in staking can do so through cryptocurrency exchanges or liquid staking protocols. You can learn more about this in our article exploring Ethereum staking.\n\nWhen it comes to Solana, the main bottleneck for participating in the network as a validator is not the required amount of SOL, but rather the hardware requirements for running a Solana validator successfully.\n\nPer the hardware recommendations provided by Solana Labs, you’ll need a CPU with a base clock speed of 2.8GHz or higher with at least 12 cores / 24 threads, 256GB of RAM, and ample storage to run a Solana validator. On top of that, you’ll need a fast internet connection. The cost of putting together such a setup is substantial, but is actually more accessible than obtaining 32 ETH to run an Ethereum validator.\n\nSOL holders who don’t want to run their own validator can delegate their tokens to an existing validator, and receive a portion of the earned staking rewards. This can be done easily with any Solana wallet that supports staking – the Phantom and Solflare wallets are great examples.\n\nAdoption and ecosystem\n\nCurrently, Ethereum has a stronger ecosystem than Solana overall. Ethereum has a more active development community, larger DeFi protocols, tokens with larger market capitalizations and more valuable NFT collections.\n\nAccording to data from DeFi Llama, the decentralized finance ecosystem on Ethereum has a total value locked of $51.89 billion, which is over 5x larger than the second-placed Tron. Solana is currently in fourth place, with a TVL of roughly $4.32 billion.\n\nThe top 10 blockchains by TVL (total value locked) in decentralized finance apps. Image source: DeFi Llama.\n\nWhile Ethereum remains dominant in the smart contract platform sector, Solana has been making large strides in terms of adoption since late 2023. After seeing a precipitous drop in 2022 and stagnating for the majority of 2023, Solana’s DeFi ecosystem has started seeing impressive growth once again.\n\nThe TVL (total value locked) on Solana-based decentralized finance apps since March 2021. Image source: DeFi Llama.\n\nWe should also mention that Solana is currently a hotspot for meme tokens, with Solana-based meme projects like Dogwifhat and Bonk displaying large gains and igniting a speculative mania for meme tokens.\n\nSolana vs. Ethereum – The bottom line\n\nEthereum and Solana are both top-tier blockchain platforms with support for smart contract. They can both be used to build an almost infinite variety of decentralized applications, and both projects will likely stay relevant over the long term.\n\nOne of the biggest differences between Solana and Ethereum is that the Solana ecosystem is looking to scale the platform further through improvements on layer 1, while the Ethereum ecosystem is mostly focused on scaling through layer 2 solutions that rely on the Ethereum layer 1 for security.\n\nEthereum currently has a more robust ecosystem and a larger number of developers, although Solana has certainly been making strong progress in the last year to become a truly worthwhile competitor to Ethereum.\n\nIf you’re interesting in more comparisons between top blockchain platforms, make sure to check out our article tackling the topic of Cardano vs. Solana."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQM242NkFGaXViVW9TLTIyT0hBZFFvVUcwQ1hueWFEMEpzb0N5X2JNb19kSHV1VGFuNnU5dmRDOHV2Z0dFd2J6STE4TkdjUWJLNzJQVnpLZ3NIeHJFV1JNMndiVVNpRERSVUpIOVBGNThrcGNFU2M2cWdvenVoWTJMdW80clZRam41ektDd0liSENsVFhwcW5ybkN2aHFmOVBFbU1SRWpWWjJBS1JLOFBF0gG0AUFVX3lxTE5rbi0xRVl5SGVxTjVFNUlwcUJENVdOOHFuQ2sxVnIxLU1lRXZCX1JqWGw0MjBYWksxR2c1amdkOFE5djlqdFRSSWlQRGU1bXZOTGs5RkR5Y1lkLUdiWWNWZ3pzSDBpcmw3OHZ1eHB4NzV0ejkzMTBVeXJMcS1IUWJHUnJyVXBkQ25rcVhFMWlnRkF3R2xMRWNCWDFTYVl6c3pzOEtrT1A1SGVNYndZMnh6Sml3TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Standard Chartered’s 2024-25 Bitcoin and Ethereum Price Prediction - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nStory Highlights Standard Chartered raised their Bitcoin price target to $150,000 by year-end 2024.\n\nStandard Chartered maintained their Ethereum price target of $8,000 by year-end 2024, but predicts a higher price of $14,000 by 2025.\n\nStandard Chartered's forecast is more bullish than Binance CEO's prediction of $80,000 for Bitcoin by year-end 2024.\n\nWith all the volatility in the space right now, big financial players in the U.S. are updating their forecasts for top digital coins. One such player, Standard Chartered, a global banking titan, has recently lifted its price forecasts for Bitcoin and Ethereum, reflecting the dynamic nature of the crypto world.\n\nLet’s take a deeper look into the details here.\n\nStandard Chartered’s Optimistic View\n\nAccording to Standard Chartered’s latest projections, Bitcoin’s price is expected to hit $150,000 by the end of this year and a whopping $250,000 by 2025. This positive update comes right after Bitcoin broke its previous all-time high, reaching over $73,000 last week.\n\nThe reason behind the bank’s revised forecasts is quite interesting. Analysts at Standard Chartered have compared Bitcoin exchange-traded funds (ETFs) to their gold counterparts, noting the significant influx of funds into the market through these ETFs and portfolio adjustments.\n\nGeoff Kendrick, Standard Chartered’s digital assets head, emphasizes the importance of these comparisons in understanding where Bitcoin’s price might go.\n\nEthereum Price Outlook\n\nWhile Standard Chartered has raised its Bitcoin forecast, it’s keeping its year-end target for Ethereum unchanged. The bank predicts Ethereum could hit $8,000 in 2024, but this depends on whether the U.S. Securities and Exchange Commission (SEC) approves spot Ether ETFs.\n\nWith Ethereum currently trading at $3,568, its potential for growth looks promising, especially with some upcoming improvements.\n\nUpcoming Boosts\n\nThe excitement around Ethereum’s future is fueled by recent events, like the Ethereum Dencon upgrade in March 2024 and the possible approval of a spot Ethereum ETF by the SEC. These developments could lead to significant investment flowing into Ethereum, similar to what we’ve seen with Bitcoin ETFs, which is expected to reach $15-45 billion in the first 12 months post-approval.\n\nRead More: Greenlight for Grayscale’s Ethereum ETF? NYSE Arca Listing Awaits SEC Nod\n\nLooking Ahead to 2025\n\nStandard Chartered predicts a resurgence in the ETH-to-BTC price ratio, aiming for a $14,000 ETH price by 2025. Standard Chartered’s forecast highlights its confidence in Ethereum’s long-term growth prospects supported by developments in its ecosystem and the potential capability of the coin.\n\nHowever, not everyone shares this bullish outlook. Richard Teng, the new CEO of Binance, predicts Bitcoin will hit $80,000 by year-end, falling short of Standard Chartered’s projections. Teng believes supply dynamics and sustained demand will drive growth, but perhaps not to the extent forecasted by others.\n\nSeizing the Opportunity\n\nWith major players like Standard Chartered adjusting their predictions, investors have a prime opportunity to capitalize on the potential of cryptocurrencies. The rise of Bitcoin ETFs and regulatory progress in the crypto world indicate a thriving market, attracting both traditional and crypto-savvy investors.\n\nRead More: VanEck Predicts Ether ETFs May Surpass Bitcoin ETFs in Popularity"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBjRVhqeHhscV9aZ2wtOXhpLVhzMEZMVTFnNkR3am1DOV9SZEhyUjNMUlZ3UFo2VERybmZxaEpSUWhiNXJNeEVQazVmb0RUSDJrTWgzZmFtSlg1REd0VmVDcm1BX3jSAWhBVV95cUxOcEotTlgyTDQzWm1DQ2RJemxtdjhBZ1NZWFVlUjQwVUsxcXEtOGNwcF9kTWtnQ1p2X1RUYndDS2R6aFVuc0JuOWNKNzJZQ3ExSlg5S0hlUEhLWkxNbDBxRjV0emZtUkpYbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Cardano Vs Solana: Which Is the Potential ‘Ethereum Killer’? - CoinCodex",
        "content": "Cardano and Solana are among the smart contract platforms growing in popularity the most. The term \"Ethereum Killer\" is often used to describe blockchains that are trying to provide a better alternative to Ethereum. In most cases, this means providing similar smart contract functionality while offering better transaction throughput and lower costs.\n\nIn this article, we will compare the Cardano and Solana blockchains in terms of TPS, consensus mechanisms, market caps, technologies they have, and more. We will attempt to determine which of these two “Ethereum Killers” is more worthwhile to invest in.\n\nKey highlights: Cardano, founded by Charles Hoskinson, uses a novel consensus mechanism called Ouroborus, which is up to 1.6 million times more efficient than Bitcoin.\n\nSolana, developed by Anatoly Yakovenko, is known for its Proof-of-History model combined with Proof-of-Stake, offering high transaction speeds and low costs.\n\nCardano's ADA and Solana's native coins have both seen significant price increases, with Cardano prioritizing decentralization and Solana focusing on high transaction speed.\n\nWhile Cardano excels in decentralization and real-world applications, Solana leads in NFT and DeFi sectors with its fast and cost-effective network.\n\nThe choice between Cardano and Solana depends on individual needs and interests, with both offering unique advantages in the blockchain space.\n\nWhat is Cardano?\n\nCardano is a blockchain project founded by Charles Hoskinson, who also played a role in the early days of the Ethereum project. The native coin of the Cardano blockchain is called ADA. The consensus mechanism that Cardano uses is Proof-of-Stake, which consumes less energy than Proof-of-Work.\n\nThe Cardano mainnet was launched in September 2017. The project’s goals include providing financial services to people who have difficulty accessing the banking system, decentralizing financial services, and expanding the benefits of blockchain use. The Cardano project has been especially active in the African market. For example, it has collaborated with the government of Ethiopia.\n\nThe Cardano mainnet gained smart contract capability with the Alonzo upgrade in 2021. This enabled DeFi protocols to be built on the Cardano network and enabled the network to host new building blocks of the Web3 ecosystem, such as new dApps and P2E (play-to-earn) games. One of Cardano's goals is to be the most sustainable and eco-friendly blockchain platform. When Ouroboros is improved with an upgrade called Hydra, the scalability of the network is expected to increase significantly.\n\nOuroboros consensus mechanism\n\nThe Ouroboros consensus mechanism, created by Cardano developers as a result of peer-reviewed and academic research, is a more efficient Cardano-specific implementation of Proof-of-Stake. According to Charles Hoskinson, this model is 1.6 million times more energy efficient than Bitcoin. Using a combination of combinatorics, mathematical game theory, and cryptography, Ouroboros supports a sustainable, provably secure, and integrated community node network.\n\nCardano pros: Cardano has a fairly large network of validators, leading to relatively strong decentralization\n\nThe network is energy efficient and has been running reliably so far\n\nHas a strong ecosystem backing it with entities like the Cardano Foundation and Emurgo Cardano cons: Cardano’s smart contracts are based on Haskell, a niche programming language that not many developers are familiar with\n\nThe project is known for its “slow and steady” approach, which can be a negative in the fast-moving blockchain space\n\nStill requires some upgrades before it can meaningfully compete with platforms like Ethereum\n\nWhat is Solana?\n\nSolana is a blockchain project founded by former Qualcomm software engineer Anatoly Yakovenko. The feature that puts Solana in an advantageous position against Cardano and other competitors is the blockchain based on the Proof-of-History model.\n\nThe Proof-of-History combined with Proof-of-Stake has brought the ability to process transactions at much higher speeds and lower transaction costs compared to the consensus mechanisms of other blockchains. In fact, Solana has achieved a network that is fast enough to compare with the speeds of huge payment firms such as MasterCard.\n\nLaunched in 2020, Solana hosts thousands of dApps in many different categories, primarily DeFi, on the blockchain. The project, which managed to increase its market cap very quickly in 2021, is notably supported by FTX, one of the major cryptocurrency exchanges, and by many venture companies.\n\nProof of History (PoH)\n\nSolana developers have developed an innovative timestamp format to provide reliable and fast synchronization between nodes and validate transactions. Proof-of-History provides a reliable method for nodes to validate transactions on the network.\n\nProof of History is not a stand-alone consensus mechanism; it is a protocol that supports a Proof of Stake (PoS) consensus mechanism.\n\nSolana pros: Solana offers the lowest transaction fees compared to its competitors\n\nSolana is the second most used blockchain after Ethereum when it comes to NFT marketplaces, NFT trading, and new NFT collections\n\nSolana is also environmentally friendly, and the Solana Foundation aims to make this network carbon neutral Solana cons: The Solana network has had numerous outages, leading to reliability concerns\n\nRunning a Solana validator requires expensive computer hardware\n\nSolana vs Cardano: Which is better?\n\nIn the Solana vs. Cardano comparison, we should know that both blockchains offer many useful alternatives to real-world problems and Ethereum's problems. Both blockchains contain very advanced technologies, and their native coins saw major price increases in 2021.\n\nIn terms of decentralization, Cardano currently appears to have the upper hand, as becoming a validator on the Solana blockchain is much more difficult.\n\nCardano Solana Mainnet Launch September 2017 March 2020 Price $0.665 $205 Market Cap $22.5 billion $91 billion Number of Active Wallets 67,250 1.4 million Total Value Locked (TVL) $535 million $6.75 billion\n\nData collected on March 18, 2024\n\nAnother thing to consider in the SOL vs ADA comparison is that the Solana network has experienced outages more than 7 times since launch. Solana users had to wait for hours to complete their transactions multiple times.\n\nAlthough Cardano is developing projects for the adoption of the use of blockchain in the world, the concrete steps taken in this regard are quite limited. Although the goals of both blockchains are very good, the speed at which they’re reaching their goals leaves a lot to be desired.\n\nCardano vs. Solana is a comparison that should be evaluated under two different categories. If you are interested in DeFi, NFT, and P2E dApps, the Solana ecosystem is the right choice for you.\n\nIf you are more interested in use cases like storing credentials, supply chain management and the use of blockchain in administration processes, then Cardano is probably more interesting to look at.\n\nTransactions per second (TPS)\n\nCardano Solana Current TPS Limit 477 65,000 Theoretical TPS Limit 1 million 700,000 Transfer Time <1min 5 seconds Average Fee $0.22 $0.005\n\nData collected on March 18, 2024\n\nAccording to developers, the Solana blockchain could theoretically reach the capability of processing 700,000 transactions per second. Cardano, on the other hand, could process up to 1 million transactions per second after the Hydra upgrade.\n\nWhile the theoretical limits can be interesting to discuss, Solana is currently much faster than Cardano. The Solana TPS (transactions per second) is currently around 65,000, while the Cardano TPS tops out at around 477.\n\nOn Solana, the average transaction fee is $0.005, and the transaction latency is around 5 seconds, while on Cardano, the average transaction fee is roughly $0.11, and the transaction latency is less than a minute (but can take up to 20 minutes in some cases).\n\nIs Cardano a good investment?\n\nCardano's work to increase blockchain adoption has made it one of the most used blockchains for solving real-world problems. IOHK's appetite for developing this blockchain and the perseverance of the community could make Cardano a good investment.\n\nBefore making a Cardano price prediction, it’s important to consider the factors that are affecting the broader cryptocurrency market. A few conditions need to be met for the crypto market to start a new bull rally. Improvement in macroeconomic conditions will be achieved by decreasing inflation and gradually lowering the interest rate. With the Bitcoin halving approaching, the Cardano price could see a significant increase after the next crypto bull run takes off.\n\nIt's worth noting that ADA has been a rather poor performer in the past couple of months. While Bitcoin, Ethereum, and especially Solana showed 100%+ rallies over the past year, ADA has been on a more modest uptrend. Meanwhile, the ADA currency gained about 80% in the past 12 months, which is less than virtually every other major crypto. This has caused ADA to slip in rankings, currently sitting as the 9th largest crypto asset by market cap (down from 5th in 2021).\n\nIs Solana a good investment?\n\nThe Solana ecosystem, which is one of the biggest actors in the market, especially in the NFT and DeFi sectors, continues to increase its market share in both sectors. The fact that Solana has always been in the top 10 most valuable cryptocurrencies since August 2021, when it started to show its potential, has made it a good investment.\n\nThe Solana price prediction will also be impacted by the same conditions that apply to Cardano and the rest of the crypto market. A new alt season could push the Solana price back to its 2021 ATH. In fact, we've recently seen Solana break the important psychological barrier at $200, which was last reached during the 2021 bull run.\n\nIt's difficult to say how much higher Solana could go in the future, given that it already sits as the 4th largest market cap crypto. However, with the growing popularity of Solana coins, increasing DeFi volume, and impressive on-chain stats, Solana could still have room to grow in the future.\n\nSolana vs. Cardano: Here's the bottom line\n\nBoth Cardano and Solana have an advantage over each other in terms of certain features. Solana is a notable smart contract platform for its unique PoH protocol and its place in the NFT industry, while Cardano stands out for its strong decentralization, long history, and real-world uses.\n\nCardano leverages peer-reviewed academic research and pioneers’ decentralization. Solana is both faster and cheaper, but its effective level of decentralization could certainly be improved upon. When choosing one of the two cryptocurrencies, you can decide according to your experience, needs and belief in the projects.\n\nIf you want to see more blockchain comparisons, feel free to take a look at our Solana vs. Avalanche comparison."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBRS1VjSEtnZFlrR1R0QVEtTlZZb0c3eWcwZDZqcVlQRmtRLWpxVDVRaWtEdzBZV3ZyVVBNdTE3QWhtaU5XbF9qdGFNalZNeW1aY00zQXRhRWdKQlhHdVB3SUluNlJnenJ6OW9RaC1fd9IBdEFVX3lxTE1CRHhUSW9vVm9nNF9INFE1MlRnU1dsNEtJcXlOZzNXeVFtb0ZhT2ZNSkktQUVYNXRWOE0yZ3BLellFUUFId05felAwb1RjWlVGRkl3YjcyTzlxTGZIejRXeUJ2TXZLdzBIVFJlQVd1RExSRFNG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 19:03:20 GMT",
        "title": "Solana Surpasses Ethereum In Major Metric Amid Surge Above $200 - NewsBTC",
        "content": "Solana has recently become one of the trendiest cryptocurrencies in the space, capturing the interest of both crypto investors and enthusiasts in the space. The popular cryptocurrency has witnessed a significant surge in network activity, surpassing even that of Ethereum, the world’s second-largest cryptocurrency.\n\nSolana Outpaces Ethereum Network Activity\n\nOn March 16, Solana experienced a major increase in its overall network activity, pushing its capacity to its limits amidst the growing demands. The network had surged past Ethereum’s total trading volume and exceeded its daily trading volume by more than $1.1 billion, according to data by DefilLama.\n\nRelated Reading\n\nCrypto Analyst Predicts Further Upside For Shiba Inu, Here’s The Target 6 months ago\n\nSpecifically, Solana’s 24-hour trading volume had recorded almost $3 billion, surging past Ethereum’s daily volume of $2.04 billion. During the surge, the network witnessed an unprecedented amount of trading activities, which resulted in failed transactions and a surge in ping times.\n\nAs highlighted by Solana Validator, the cryptocurrency network’s ping time on March 18, had jumped to a staggering 46 seconds, causing about a 30% to 40% failed transactions. The validator’s report also revealed a steady and rapid increase in Solanan’s transaction count, recording over 276 million transactions at the time of writing, with about 2,107 transactions per second.\n\nThis rise in Solana’s network activity has been attributed to the surge in interest in Solana-based meme coins. On Thursday, March 14, degens eagerly sought after a new meme coin called Book of Meme (BOME), which had experienced an unprecedented bullish spike that triggered its market capitalization to rise from almost zero to a staggering $1.45 billion.\n\nDuring these periods, the price of Solana also rallied alongside, witnessing an unexpected price surge that propelled it by more than 30% in the past week. The cryptocurrency has been on a steady momentum since the beginning of the year, displaying slight price corrections before continuing on its upward trajectory.\n\nSOL Price Rides The Bullish Wave\n\nAmidst Solana’s burgeoning popularity and rising transaction volumes, the cryptocurrency saw a price increase to more than $200, reflecting a daily surge of approximately 8.9%, at the time of writing. The cryptocurrency’s market capitalization is also up by 11.10%, recording over $89 billion and steadily closing towards the $100 billion mark.\n\nRelated Reading\n\nDue to its overwhelming network activities and growing popularity, Solana has successfully gained the position of the 4th largest cryptocurrency by market capitalization, overtaking BNB Chain (BNB) by more than four billion, according to CoinMarketCap.\n\nMoreover, the cryptocurrency has reached peak levels globally in terms of Google search interest, hitting a new all-time high. This surge has been attributed to the increasing interest and demand for the popular digital asset.\n\nSOL price crosses $200 | Source: SOLUSD on Tradingview.com\n\nFeatured image from LinkedIn, chart from Tradingview.com"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTFBCRGZmWm1oZnUwLVhnLVFoQVNHX2ZaMW5PR093WnlRYzlqNVhUZG1fRWVNWTQ3X3ZyTVpsc2pmVU5UOS1DZDc4OUY3RXl5WEdxYzJxTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "5 Best Ways How to Stake Ethereum With Ease in 2024 - Latest Cryptocurrency Prices & Articles",
        "content": "Crypto has come a long way since 2009, when Bitcoin was launched. So many things have changed, and thousands of new cryptocurrencies have been developed. Users now have endless options regarding crypto, blockchain, Web3, NFTs (Non-Fungible Tokens), mining, staking, yield farming, and many more. Even mentioning those crypto-related terms can show how much crypto has grown.\n\nWhile so many crypto projects are on the market, some remain in the spotlight thanks to their features, the years they have been traded for, and the security and safety they provide. Among them is Ethereum, one of the cryptocurrencies that progressed the most and revolutionized many concepts in the crypto industry.\n\nSo, if you have been around for the littlest of time, you might have considered purchasing Ethereum. Are we right?\n\nAnd you may have also asked yourself what it takes to earn more by staking those ETH coins. Well, you are in the right place. This article will discuss Ethereum staking, its main requirements, and the best ways to stake your ETH.\n\nAbout Ethereum\n\nOfficially launched on July 30, 2015, by a team of 5 founders, Ethereum is the 2nd largest cryptocurrency by market cap after Bitcoin. Unlike some may think, Ethereum was not conceived with fast transactions in mind.\n\nHowever, the network’s initial developers, Vitalik Buterin, Jeffrey Wilck, and Gavin Wood, aimed to develop an ecosystem that can store decentralized applications (dApps) and help the DeFi industry evolve as much as possible.\n\nThe whitepaper of Ethereum, published in 2013, explained what dApps are, how they work, and how they can rely on the Ethereum blockchain. Currently, Ethereum is home to numerous decentralized applications and many other types of crypto projects, being the most developed blockchain.\n\nThe Ethereum Merge Update\n\nOver the years, Ethereum has passed through plenty of updates and new launches, but the most significant remains The Merge. While Ethereum first worked based on a PoW (Proof-of-Work) consensus mechanism, on September 15, 2022, the network switched to PoS (Proof-of-Stake), thus moving from mining to staking.\n\nThe Merge was a major change for Ethereum and came with various significant benefits, including reduced energy consumption. After switching from PoW to PoS, Ethereum’s energy consumption was reduced by approximately 99.95%, a tremendous decrease in carbon emissions.\n\nThe Ethereum Dencun Upgrade\n\nThe Dencun upgrade took place on March 13 and is the latest update that starts the surge, Ethereum’s phase, in which it addresses certain scalability limitations. As Vitalik Buterin said, they aim to hit 100,000 transactions per second and beyond.\n\nAs a result, the new update consists of nine Ethereum Improvement Proposals (EIPs), including EIP-4844 or proto-dank sharding, which aims to introduce temporary storage called data blobs for Eteherum L2 networks to use.\n\nThese blobs will increase the capacity of the availability of data, whereby L2 rollups can use the extra space to submit the data to the mainnet, thus reducing L2 gas fees.\n\nI don’t think there will be an immediate reduction (on March 13), I don’t know how far along the L2s are with rolling out their blob support, but I would suspect that it takes them a few days/weeks to fully support EIP-4844 and not post their data as CALLDATA but switch to blobs – said Marius van der Wijden, software developer at Geth, and Ethereum.\n\nBut what does this update mean for Ethereum staking?\n\nThere isn’t a direct impact on the Ethereum staking core process; the locking up of 32 ETH remains unchanged. However, the effect is more on the broader picture: the more transactions the network supports per second, the busier the network will become. Thus, it could make Ethereum staking even more appealing, increasing activity on the network.\n\nEthereum Staking\n\nOnce The Merge was completed, the Ethereum network moved to Ethereum 2.0, or the 2nd version of the blockchain. This way, users can stake their ETH to earn staking rewards based on the amount of ETH they lock up and the lock-up period.\n\nStaking ETH implies using your coins to verify, secure, and validate transactions on the Ethereum network. Once a transaction is verified, you can receive a reward. That reward is the network fee required by the blockchain to complete that transaction.\n\nHowever, with the new Dencun upgrade, the network will cater to more secure interactions between various blockchains through EIP-4788, improving cross-chain bridges and stake pools.\n\nWhere and How to Stake Ethereum\n\nSince Ethereum switched from Proof-of-Work to Proof-of-Stake, crypto enthusiasts can now stake their ETH coins. It is widely known that the staking process is a little less complex than mining. Furthermore, you need less powerful (and expensive) hardware for staking than mining.\n\nSo, many crypto investors were eager to start staking Ethereum once this was possible.\n\nCurrently, there are multiple ways to stake ETH, and you have to choose the most profitable and accessible to complete, depending on your needs, holdings, and knowledge.\n\nThe most popular Ethereum staking options include solo staking, staking pools, staking through a centralized crypto exchange, or even SaaS (Staking as a Service).\n\nWe will take them one by one and highlight their features and advantages.\n\n1. Staking Ethereum on Crypto Exchanges\n\nHundreds of cryptocurrency exchanges are on the market, each with new or improved features and products. Most of them also support Ethereum, among other cryptocurrencies, and some also allow users to stake their ETH tokens to improve the Ethereum network and earn extra coins.\n\nStaking on a crypto exchange is easier than you think. First, you must sign up on a platform if you still need an account. Then, you should purchase ETH or move it from another platform. Afterward, you must select the amount of ETH you want to lock up and start staking it.\n\nBinance\n\nBinance is the largest cryptocurrency exchange by trading volume, with over 168 million registered users. The platform is user-friendly but most suitable for crypto investors with at least a little trading knowledge.\n\nBinance supports over 350 cryptocurrencies, including Ethereum (ETH). Furthermore, the platform allows users to stake their ETH coins. The minimum required amount is 0.1 ETH, and the reference APR varies but is approximately 3.5%. At the moment of writing, the reference APR was 3.22%.\n\nStaking ETH on Binance is as straightforward as possible. You do not need extensive crypto knowledge to do this, and Binance is here to help its users stake their Ethereum coins by explaining the process on its official website.\n\nStep 1: Sign up on Binance\n\nFirst, if you do not have a Binance account, you should sign up. To do this, you will have to provide an email address, your phone number, and other similar information. However, Binance will never ask you to provide too much information, as it only requires what it needs to create your account.\n\nStep 2: Click on “Earn”\n\nOnce you are registered and signed in, you can go to the staking page. To do this, you will have to click on “Earn” from the top of the screen.\n\nStep 3: Click on Ethereum\n\nThen, you should see multiple cryptocurrencies available, each having a dropdown. Click on “Ethereum.”\n\nStep 4: Click on “ETH Staking”\n\nThen, you will see the staking option.\n\nStep 5: Start Staking Ethereum\n\nAfter you click on “ETH Staking,” you will be able to stake your Ethereum coins as desired. You will also notice the reference APR, the conversion ratio, and the total value staked on Binance.\n\nOf course, it is essential to note that you must hold ETH to stake it on Binance or any other platform. So, if you do not hold it yet, you can purchase it directly on Binance.\n\nCoinbase\n\nCoinbase is the 2nd largest crypto exchange on the market, available almost worldwide and offering numerous trading services. Coinbase allows users to buy, sell, and trade over 250 cryptocurrencies through 2 leading platforms: Coinbase Simple Trade and Coinbase Advanced Trade .\n\nStaking on Coinbase is pretty straightforward. The platform is user-friendly, and the staking feature is not significantly more complicated than other processes supported by the Coinbase exchange.\n\nOnce you have some ETH coins in your account, you can start staking it and earn ETH staking rewards. The estimated reward rate for Ethereum staking is 3.49%. Thus, depending on your holdings and the amount you lock up, you can earn approximately 3.49% of the amount of staked ETH.\n\nKraken\n\nKraken is one of the most trusted cryptocurrency exchanges, allowing users to buy, sell, and exchange over 220 cryptocurrencies, including the most popular, Bitcoin and Ethereum.\n\nAlthough the staking feature is a little affected at the moment by a lawsuit filed by the SEC against Kraken at the beginning of the year, the crypto exchange still offers staking for various cryptocurrencies, such as Ethereum (ETH), Cardano (ADA), Cosmos (ATOM), Polkadot (DOT), Polygon (MATIC), Solana (SOL), Tezos (XTZ), or Tron (TRX). However, it is essential to note that the feature is still not available for US citizens.\n\nStill, if you want to earn rewards by staking ETH, you can use Kraken, as the platform is extremely intuitive, so the process should not take too much. The yearly rewards for Ethereum staking range between 3% and 6%, depending on the amount of staked ETH and the period you decide to lock up your coins.\n\n2. Stake Ethereum on Crypto Wallets\n\nStaking Ethereum through crypto wallets is as easy as with crypto exchanges. Things are similar, and the main requirement is to hold some ETH coins in your account. Numerous wallets allow users to stake ETH, some of the most popular being MetaMask and MyEtherWallet.\n\nMetaMask\n\nMetaMask may be one of the most popular cryptocurrency wallets on the market. It is available as a web browser extension (available on Chrome, Firefox, Brave, Edge, and Opera) and a mobile app (available on Android and iOS devices), and users usually praise the wallet for its user-friendliness. MetaMask allows you to stake crypto on both its extension and app.\n\nIn the app, for instance, you have to go to the “Explore” section and search for “MetaMask Portfolio.” Afterward, all you have to do is access the MetaMask dashboard and tap on “Stake.” Then, you can select Ethereum and choose a platform.\n\nYou can choose from Lido and Rocket Pool. The rewards differ, too. Lido offers rewards of up to 3.83%, while Rocket Pool has a reward rate of approximately 3.65%.\n\nMyEtherWallet\n\nMyEtherWallet is one of the best Ethereum wallets on the market, supporting all ERC-20 and ERC-271 tokens. On MyEtherWallet, users can buy, sell, swap, and exchange crypto seamlessly, thanks to the company’s user-friendly platform. The wallet is free to use, and investors must support network fees.\n\nMyEtherWallet also allows users to stake ETH on the platform, offering 2 types of staking. Users can run a validator node or stake smaller amounts of ETH through pooled or liquid staking.\n\nUsers can check their rewards on the MyEtherWallet platform, available on web and mobile devices. The rewards vary depending on the amount of staked ETH and the lock-up period.\n\n3. Solo Staking\n\nAlso called “native staking,” solo staking brings you the most significant rewards, but there is a catch: to be a solo staker, you have to get your own validator node, and this requires 32 ETH. Such crypto may be too much for some users, considering that ETH exceeded $2,000.\n\nHowever, solo staking is quite profitable, and the hardware required for this type of staking is not that expensive, especially compared to the hardware you need to mine crypto.\n\nIf you decide to stake ETH alone, you must do all the work. Solo Ethereum validators will have to wait a bit more to earn rewards, as they also have to go through an activation process enforced by the protocol. The process might take a few days, but in some cases, it can also take a couple of weeks.\n\nOverall, solo staking is considered the least risky option, assuming you have complete control over your staked ETH and validator rewards.\n\nStaking as a Service (SaaS)\n\nIf you hold at least 32 ETH and want to earn native block rewards but do not want to get directly involved with the staking process, you can choose SaaS (Staking as a Service). Specific staking platforms can manage the validator on your behalf.\n\nOf course, if you choose to do this through such staking services, you must pay a little commission to the company managing your validator. All in all, staking-as-a-service is an excellent option for those who aim to earn crypto through staking but need more time or the proper hardware to do it themselves.\n\nOf course, once you give your ETH to a SaaS platform, the entire staking process becomes a little less safe. However, just like with any other crypto-related process, we strongly advise you to research the platforms available and choose the safest option.\n\nWith so many crypto platforms, you will find a trustworthy platform to manage the staking process.\n\n4. Pooled Staking\n\nIf you do not have 32 ETH, you can join a staking pool, where users’ ETH coins are combined to get the total required for running a staking node. Pooled staking platforms offer many users the opportunity to join the Ethereum ecosystem without the burden of having to purchase 32 ETH (approximately $70,630).\n\nWhile the Ethereum network does not directly support pooled staking, various platforms allow you to join staking pools in no time. That platform will activate and deactivate validators according to deposits and withdrawals. Furthermore, they must manage and ensure that it supports the pool.\n\n5. Liquid Staking\n\nLiquid staking is similar to pooled staking, but some differences are worth considering. This staking method implies staking your coins into a pool, but the reward part is entirely different.\n\nIn liquid staking, users receive rewards based on their percentage ownership. However, you will not receive tokens; you will receive transferable receipt tokens (also called liquid staking tokens). These tokens will prove ownership and allow you to withdraw your funds.\n\nRemember that many consider liquid staking one of the riskiest methods, as it implies counterparty risks with the transferable receipt. However, once you get the ETH staked to a safe place, everything should be under control.\n\nPros and Cons of Ethereum Staking\n\nEthereum staking brings pros and cons to the table, so in the following chapters, we’ll find out which are which and how to harness this process in your favor.\n\nETH Staking Pros\n\n1. Staking Rewards\n\nBy now, it’s clear that when you stake Ethereum, you are rewarded with the ETH for your contribution and securing the network. The amount depends on how much you staked and for how long.\n\n2. Assist the Network\n\nThe staking process heavily contributes to the Ethereum network security and decentralized principles, as all stakes, with no exception, are responsible for validating the transactions.\n\n3. Maintaining the ETH Ecosystem\n\nAs we’ve seen in the Ethereum update for PoS, staking is more eco-friendly as it doesn’t require high computational power, as seen in PoW or mining Bitcoin.\n\n4. Being Part of The ETH Governance\n\nAll validators have an essential role within the governance network, and since they are doing the hard work to keep the network secure, they have the power of the decision-making process.\n\nETH Staking Cons\n\nRegarding the downsides of staking Ethereum, the first and foremost is the technical risk, which means a network attack and losing your ETH.\n\nOverall, ETH staking is an excellent way of getting rewarded, yet it is essential to take into consideration all factors, good and bad.\n\nFinal Thoughts\n\nStaking Ethereum is a great opportunity to earn passive income by locking up the coins you hold for as long as you want. With so many staking options, it may seem hard to choose the best option for your funds.\n\nSolo staking requires more advanced hardware and a minimum of 32 ETH to become a validator. However, with pooled or liquid staking, things get a whole lot easier.\n\nFurthermore, if you hold 32 ETH, you can choose staking-as-a-service, and a staking provider will manage your funds and complete the staking process.\n\nBesides, you can always consider staking through a crypto exchange or wallet, as many such platforms also provide staking services. On exchanges and wallets, things get a lot easier, but there is a possibility that the rewards will decrease once you choose such a staking method.\n\nShare this Post Twitter\n\nLinkedin\n\nFacebook\n\nReddit\n\n* The information in this article and the links provided are for general information purposes only and should not constitute any financial or investment advice. We advise you to do your own research or consult a professional before making financial decisions. Please acknowledge that we are not responsible for any loss caused by any information present on this website."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE15ZFUyZ3Jxa1B4bEh4dnI5X2dpVVEzT29hSngydkNzODJST0Jaa3dYMXFNMkJrUVpwNUNWUW9QS1NId1dLVmZuUU54M0NxbWRmVUhpVnh1d1FrUVhmb2FyZXkxYVVGM2tsdlNrVTFFb1M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum L2 Base Explodes, Crossing 1M Active Addresses in a Day - Coinfomania",
        "content": "The Solana blockchain has continued to witness impressive numbers in recent months. According to The Block, the high-speed Layer-1 blockchain has set a new record for new and active monthly addresses during December.\n\nA New High\n\nPer the report, the number of active addresses on the network surged to 15.6 million in December. This metric represents a 50% increase compared to November, surpassing January’s 15.2 million active users.\n\nFurthermore, the network has set a new record for the number of new addresses for the month. In December, the number of new addresses created topped 6.8 million, surpassing May’s 6.6 million.\n\nThese metrics suggest a continuous influx of fresh participants entering the Solana ecosystem. Moreover, it signifies the growing popularity of the network among market participants. Solana’s speed and lower transaction cost have made it more attractive to users when compared to its competitors, including Ethereum.\n\nHowever, one vital metric, non-voting transactions, hasn’t yet shattered previous records. These transactions are unique to Solana, as they contribute to network validation and perform typical functions like sending money or executing smart contracts.\n\nTheir lower numbers than November raise questions about whether the current boom is driven by real user activity or other factors.\n\nTop Performer\n\nNevertheless, the Solana ecosystem remains one of the top performers amid the recent market rally. Recently, the high-speed network achieved a significant milestone by flipping Ethereum in decentralized exchange (DEX) trading volume.\n\nAccording to DefiLlama, DEX volume on Solana surged to $10.1 billion over the past week compared to Ethereum’s $8.8 billion.\n\nSolana’s impressive performance coincides with the surge in its native token, SOL. The token has risen by 61% in the past week and more than 90% since the beginning of this month. At press time, SOL was trading at $113.\n\nRecently, Coinfomania reported that SOL flipped BNB to become the fourth-largest cryptocurrency by market cap. SOL’s market cap currently stands at $48.1 billion compared to BNB’s $40.8 billion."
    }
]