[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQcEFzYVF1bDgwYi1sckR6T3duUk1taXdYeWFhdUYyNG5hYzIzbE1odWRKa0ZjdWxIYklGV2VMNm1JQnRmMDNhdHJCSTMtUWlOVlBiRnJHSXVvZUZ2YlIxM1h1SVEybE9Ybm1OVE1zb25fMlRzQVVwOUIzbHduaU1oT2RhNmZnblBITnJoeGFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "SEC hints at last-second approval of Ethereum ETFs, but ‘no issuer is ready’ - Fortune",
        "content": "It was looking like an all-but-certain rejection from the Securities and Exchange Commission, but just hours before a May 23 deadline to rule on VanEck’s application to launch a spot Ethereum exchange-traded fund, it appears that the SEC may be reconsidering.\n\nCoinDesk first reported on Monday that the nine would-be issuers that filed to list and trade shares of the ETFs were “abruptly” asked by regulators to update their 19b-4 filings on an accelerated basis. A 19b-4 form is what an exchange like the NYSE requires for the introduction of new products—in other words, the applicants and the exchange are asking the SEC for permission to add the ETFs to their platforms.\n\nSince rumors began swirling on Monday afternoon, the price of Ether has shot up nearly 20%, trading near $3,750 around 1:30 p.m. ET on Tuesday.\n\nIt's hard to believe this SEC would do us any favors like approving the spot ETH ETF.\n\n\n\nBut policy is politics, and crypto has been winning the political battle for months.\n\n\n\nMaybe the Biden camp saw how many voters Trump could win with one pro-crypto comment and decided to pivot. — Jake Chervinsky (@jchervinsky) May 21, 2024\n\nAs VanEck is the first exchange to have filed an application, it receiving approval hypothetically would be a green light for others waiting to hear about their own 19b-4s. As chatter began to circulate on Monday that the applications were evolving, Bloomberg analysts updated their odds of an approval from 25% to 75%.\n\nBut the news has left issuers scrambling. Each issuer that James Seyffart, Bloomberg’s ETF analyst, has spoken with has been “caught off guard by the SEC’s 180-degree pivot,” he told Fortune. The agency reached out to filers with comments and requested updates just three days before the deadline, he explained.\n\n“This is not standard operating procedure, and everyone from issuers to exchanges to lawyer, to market makers, and more, are scrambling to be ready for a potential approval—and to meet the SEC’s requirements,” Seyffart adds. The rushed nature of the pivot suggests it was likely a “political move,” the result of a “top-down decision” from the Biden administration, he speculates. “No issuer is ready,” he wrote on X.\n\nIt's hard to believe this SEC would do us any favors like approving the spot ETH ETF.\n\n\n\nBut policy is politics, and crypto has been winning the political battle for months.\n\n\n\nMaybe the Biden camp saw how many voters Trump could win with one pro-crypto comment and decided to pivot. — Jake Chervinsky (@jchervinsky) May 21, 2024\n\nSo far, Grayscale is the only would-be issuer to post an updated 19b-4 to the New York Stock Exchange’s website, for its application to transfer over its Ethereum Mini Trust ETF. Meanwhile, Fidelity has dropped its plans to stake the Ether in its ETF, according to an S-1 update filed to the SEC early Tuesday. In previous filings, the firm said it intended to “stake a portion of the trust’s assets” to “one or more” infrastructure providers, but now it will “not stake the Ether” stored with the custodian.\n\nStaking involves committing Ether to secure the network in return for yield, which is currently at about 3%, according to data from staking service Lido. Ark and Franklin Templeton also have considered staking in their applications. In today’s updated 19b-4 from Grayscale, the firm confirmed it will not participate in staking. Both Grayscale foregrounding this and Fidelity omitting it suggests the SEC may have requested staking be prohibited. Vance Spencer, cofounder of Framework Ventures, told Fortune he estimates that the SEC’s last-minute requests included guidance on staking.\n\nStaking the underlying Ether in the ETF has been a regarded as a reason why the SEC could reject applications, as Chairman Gary Gensler voiced concern last March that digital assets using staking protocols could be considered securities under federal law. Staking could be “a significant complication,” Bitwise CIO Matt Hougan previously told Fortune.\n\nHowever, even if the SEC approves VanEck’s 19b-4 on Thursday, it doesn’t guarantee authorization, as the exchanges will need issuers’ S-1 applications before products begin trading. When applying to launch a new security, an S-1 is the form that outlines to potential investors and the SEC the structure of the asset, how it will be managed, and, in this case, how it plans to mirror the performance of the underlying asset—Ether tokens.\n\nBut S-1s could take “weeks to months” to approve, Seyffart wrote on X. “That said, if we’re correct and we see these theoretical approvals later this week. It should mean that S-1 approvals are a matter of ‘When’ not ‘If.'”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOdFlHSTFvNWtXb0FTaU1aRmJBRklHdTNDbXlSNUVaT1ZheFVpMjEycTNQQ19uSVMyMkk3azhyeFZiRnlucTFvdDhYWVFtT3otc2tqMGJyQXQ4SEpCR24yTTB3a3FrT29OZTlZNk53NTRWUE56MUtsQi1iYzJRVG9EMHlrTG9NY1RjbUNjMnRIOEwzY1Njb2VxLTB1aEVpSGJ3c1J5MG9wcFh2OWtJd1lYcjBOekxDVldVXy10TEpSbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum surges 22% on speculation ETFs could be approved as soon as this week — and a new bitcoin record might not be far behind - Markets Insider",
        "content": "Ethereum has jumped over the past 24 hours as odds of an imminent ETF approval have soared.\n\nPositive signs have come from the SEC, which needs to make a final decision on two proposals this week.\n\nThe approval could also be a catalyst for bitcoin to hit new records, according to Standard Chartered.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nEthereum rocketed 22% higher on Tuesday on surging confidence that ETFs pegged to the cryptocurrency could be approved as soon as this week.\n\nJust as was done for bitcoin in January, efforts have been underway to establish an ethereum spot exchange-traded fund, making the cryptocurrency available to a wider array of investors.\n\nThough investors have long anticipated regulatory pushback, the Securities and Exchange Commission recently asked potential issuers to update their filings, Bloomberg reported. That's a positive sign ahead of decision deadlines for at least two spot ETFs, one from VanEck and the other from Ark 21Shares.\n\nThe odds of approval, according to Bloomberg Intelligence ETF analyst Eric Balchunas, jumped to 75% from 25% in a single day on Monday. Meanwhile, odds of approval by May 31 have risen to 61% from 10% on the Polymarket betting platform.\n\nAdvertisement\n\nAccording to Standard Chartered Head of FX Research Geoff Kendrick, ETF approvals would cement ether's chances of reaching $8,000 by this year's end.\n\nThe bullish forecast is one he's held since March, arguing that the funds' approval would drive $15 billion to $45 billion worth of inflows into the token. Eventually, ether could hit $14,000 by end-2025, he reiterated in new research on Tuesday.\n\nFurther, the ETFs would largely avoid the same situation as bitcoin funds, which have seen outflows and considerable price swings after an initial boom period, he added.\n\nFor one, Kendrick says inflow volatility will be minimal because ether lacks investment alternatives that could compete with the ETFs, such as a Microstrategy equivalent. This company's massive hoard of bitcoin means that its stock move in line with the token.\n\nAdvertisement\n\nSecondly, big outflows are also less likely to be an issue for ether, Kendrick pointed out. This was a challenge for bitcoin after its ETFs hit markets, as the funds became as major competitor to the pre-existing Grayscale Bitcoin Trust, leading to a bout of selling.\n\n\"The ETH Grayscale trust is smaller in percent of market cap than the BTC one was, so any forced selling as occurred with BTC post ETF approval should be less important,\" Kendrick said in written commentary.\n\nOnce ether funds are established, the price highs that it can achieve bode well for bitcoin, Kendrick added. Already, the apex token has jumped as much as 6.7% this week on the back of ether's gains.\n\n\"An ETH ETF approval will further legitimise the sector and therefore be BTC positive as well. I would expect a fresh all-time high in BTC by the weekend (through the 14 March USD 73,798 level),\" Kendrick wrote."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBLVzhhejNEclJHUURvMXExUEFEOENWOTBTSHlRSWxzMk8xYzVRRHhob196N0xaUGNmbVZDdjNmZFJ4aVo5dWNxTlRrdnJqX0JJc3ZMNlBHTUlObXFQdVZjTk5jWE8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum is too hard to use - Blockworks",
        "content": "Anyone else think Ethereum is difficult to use these days?\n\nYeah, there’s a bunch of cool stuff on Ethereum — meme tokens, NFTs, DeFi, degens — it’s all there. But over the years as the blockchain evolved, it has become more expensive and more complicated — as in, an already complex technology for users has become even moreso.\n\nNot only do users need to understand crypto basics like wallets, irreversible transactions and addresses, they also now have to contend with getting to know different chains. You can’t just send Ethereum chain ETH to Optimism chain ETH, or Optimism chain ETH to Polygon chain ETH, unless of course you use a bridge which means that this system might be getting a little complex for many users.\n\nEthereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.\n\nHow did we get here?\n\nI wouldn’t say there’s anyone in particular to blame for this; it’s an ecosystem problem as a whole. When Ethereum launched almost 10 years ago, nobody was using it. At that time, any usage at all was welcomed.\n\nNow, it’s 2024 and there is usage. But there’s also expensive layer-1 fees. Average transaction fees on the layer-1 Ethereum blockchain are at $0.94. If a user wants to interact with a smart contract, like a DEX, fees are averaging $4.70.\n\nSome might say, “Well, maybe it’s time to examine fees themselves.” Problem is, fees are what secure the network. If validators were not being incentivized by staking and reaping fees, what would be the point?\n\nOkay, yeah, but there’s the layer-2 options, right? There are. And Arbitrum and Optimism have both transaction and smart contract fees at less than $0.02. We’re securing the bottom layer, enabling lower fees on the second.\n\nBut as a Coinbase report from late last year noted, there are so many of these layer-2s that fragmentation now exists between all of these different chains. And mainstream users, aka those who could enable mass adoption, want financial apps that don’t make things complicated.\n\nThe sandbox\n\nThe point is clearly that Ethereum is just one big-ass financial experiment. I actually wrote about this way back in 2016, about Ethereum being a fintech sandbox.\n\nAnd it has been one. When I wrote that piece, ICOs were only slowly gaining traction, DEXs were in their infancy and there wasn’t even an NFT token standard yet — just Plain Jane ERC-20s.\n\nRead more from our opinion section: BlackRock clearly wants to take crypto seriously. Too bad it’s forever silly.\n\nTimes have certainly changed. Ethereum’s “world computer” concept, the idea that people could build programmable monetary systems on a verifiable blockchain, has been a success. The Ethereum Virtual Machine, or EVM, is a standard for smart contract development — even outside the Ethereum ecosystem.\n\nThen, there’s the 2022 move to the proof-of-stake model, which to Ethereum’s credit, was pulled off with remarkable execution.\n\nYet I’ve heard of people working on Ethereum layer-3 projects now. That’s an abstraction of two layers — can anyone come up with something comparable for so many layers in technology? Maybe the OSI model? It has seven layers. But it’s used for data in networking, all running at the same speed. And there’s no fees. It’s just categorizing data.\n\nOkay, well, blockchains are just data. So then we arrive back at the fee conundrum. But blockchains are decentralized, so there has to be some incentive to support the network, right?\n\nA fee quagmire\n\nFees secure the Ethereum network, rent the computing power to do things and also limit spam. With that in mind, I suppose there have to be fees in the system — I’m not proposing some grand, new fee-less Ethereum design, that’s for the Vitalik Buterins of the world.\n\nThere are rollups, and that’s promising because they can batch process transactions off of Ethereum while lowering fees with the same level of security. Or maybe some smart startup can somehow increase interoperability — instead of reducing it by having users dig through layers like a Stouffer’s Italiano.\n\nI just am not convinced of the feasibility and long-term viability of so many bridges, some of which have been compromised. It feels like too many vulnerabilities in the margins. Perhaps a standardization of bridges is needed, and many wallets do warn users about interacting with bad smart contracts, so some safeguarding is happening.\n\nBut I’m still trying to coincide my recent experiences with Ethereum as something…\n\nVery.\n\nLasagna-like.\n\nTasty for the taste buds as a food, yes.\n\nBut isn’t it a bit complex for people to use as a blockchain? People want apps that offer free flow of money, not restrictive layers. Hopefully, Ethereum can evolve past this lasagna stage.\n\nDaniel Cawrey has been involved full-time in the crypto space since 2013, including as an editor at CoinDesk. He is author of 2020’s “Mastering Blockchain” and 2023’s “Understanding Crypto” books, both available on Amazon.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPWEM3MEV6VDJsXzBVSThkMXptWWNrM0NremVoZlMxOEFCM2VLZklVVEhzVDd6Smt3bE5SY1d5VFpMbEp0MC1BNlNLTjJjQ1dIbGRQeXd1d004U0NGQWE5djZUVml1N1pXeFVpcUxCUDVaNnR2MTBlWmFJbUQtdTZLT1c3Z3BsUWNtNkxmVXRBYjBLajhITVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Soars As SEC Reconsiders Spot Ether ETF Approval - Brave New Coin Insights",
        "content": "Ethereum Soars As SEC Reconsiders Spot Ether ETF Approval\n\nThe price of Ethereum jumped 18% as the SEC reconsiders its position on the approval of an Ethereum Spot ETF.\n\nOn Monday, new developments suggest that the U.S. Securities and Exchange Commission (SEC) might be rethinking its stance on spot Ether (ETH) exchange-traded funds (ETFs). Bloomberg ETF analysts James Seyffart and Eric Balchunas have indicated a shift in the SEC’s approach, raising the odds of approval from 25% to 75% after “hearing chatter” about the financial regulator’s internal discussions.\n\nAnalysts Adjust Predictions\n\nOn Monday Seyffart and Balchunas posted on X to update their predictions regarding the SEC’s decision on spot Ether ETFs. “The SEC might be doing a 180 on their expected denial of spot Ether exchange-traded funds this week,” wrote Balchunas. This new perspective is based on various signals, including recent SEC filings, public statements from SEC Chair Gary Gensler, and insider reports suggesting that the commission might be leaning towards approval following political pressure on Democrats to reverse course on crypto.\n\nSeyffart echoed this sentiment, mentioning that the issue had become “increasingly political.” He hinted at a surge of related filings in the coming days if their sources were correct. “Never gonna hear the end of this from the [Ether] people in my replies if this turns out to be true,” Seyffart remarked, highlighting the potential impact on the cryptocurrency community.\n\nUpcoming Deadlines and Broader Implications\n\nThe SEC’s decision on VanEck’s spot Ether ETF is due by May 23. This decision is critical as VanEck’s application is the first in a series of pending spot Ether ETFs, including those from ARK 21Shares, Hashdex, Invesco Galaxy, BlackRock, and Fidelity. The SEC has already delayed VanEck’s application as long as allowed under regulatory guidelines, setting the stage for a potentially groundbreaking decision.\n\nEthereum soared to $3,636 on the news\n\nIn an April interview, VanEck CEO Jan van Eck expressed skepticism about the SEC’s approval of his company’s ETF application in May. This skepticism seemed justified when Grayscale withdrew its application for an Ether futures ETF on May 7, followed by CEO Michael Sonnenshein’s resignation announcement on May 20 (Cointelegraph).\n\nPolitical and Regulatory Dynamics\n\nThe evolving political landscape could also influence the SEC’s decision. Recently, U.S. lawmakers in both the House of Representatives and Senate voted to overturn an SEC rule impacting banks dealing with companies holding digital assets. This congressional resolution’s future remains uncertain, pending President Joe Biden’s decision to either veto or sign it into law.\n\nFurthermore, the SEC has requested exchanges to update their 19b-4 filings, suggesting a potential move towards approving these applications. This request has led to speculation that the SEC might be progressing towards an approval decision. However, even if the 19b-4 filings are approved, the ETFs would still need their S-1 applications cleared before trading could commence, a process without a defined timeline.\n\nIndustry Reactions and Future Prospects\n\nOne company in talks with the SEC reported a more optimistic outlook, feeling that the regulatory body was no longer dragging its feet. This optimism is bolstered by the reassessment from Seyffart and Balchunas, who increased their approval odds based on new information and insider sources\n\nThe SEC’s investigation into whether Ether qualifies as a security continues to add complexity to the situation. This investigation, launched after Ethereum transitioned from a proof-of-work to a proof-of-stake consensus mechanism, could influence the SEC’s final decision. A recent development from Prometheum, which launched its Ether custody service with plans to offer services for other digital assets considered securities, might also play a role in shaping the SEC’s view.\n\nAs the May 23 deadline approaches, the financial and crypto communities are on high alert. The SEC’s decision could significantly impact the market, setting a precedent for future cryptocurrency ETF approvals, taking crypto centre stage for the upcoming election cycle, and shaping the regulatory landscape for digital assets in the United States."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOWjU4Tkp0S215RFBWOEFqTzZMcTV6NWtCT1VkUDFkZnlWMjRmeWl5MEtON2ZiVkphcVRQVTFGZ2phSWcyanU5VVpGSGRrWS1GQ2tKeXFEYVdkV0g5ZlRjbVFnS0JlY0NXQTJFb3B6cWtRa1E3dVlwNnlQS0p6QmVwQUplVE1BbjVqMVo4MkJhQmtRSi1kSDkxcDVSLUd2ZzVZc2Q5ZDNMONIBrAFBVV95cUxPR01FQlFIbXo4bk55RTdWWGtpSjg1SXNQdlFINVRvc3dUNm9PN3RidEphOC12ZVZKYU1DdVBnb1VVXzI5bV8wN1hsdi1BbVdianJYZ2ZYX0R2bDY3d1FlYnEtWnp4STRvNnJTS1lmSTA5NFB3czEyM0cwc2R6OUV3cks5NkVLUHVxMU9zSEhVeFJCcWR6THhFTTZQX040LW5xMUgyMzFjS2pnUU9h?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Uniswap fights back against SEC as the ethereum crackdown continues - CNBC",
        "content": "watch now\n\nFor years, the Securities and Exchange Commission has been cracking down on the crypto sector writ large, but in the last few months, the agency appears to have trained its sights on ethereum , in particular. Some of the biggest names in decentralized finance are now fighting back. In a 40-page filing Tuesday, Uniswap Labs — which builds decentralized finance infrastructure including a popular DeFi crypto exchange that enables users to custody their own coins — detailed to the SEC all the reasons why the agency shouldn't pursue legal action against them. It comes a few weeks after the commission issued Uniswap a Wells notice, warning the company that it identified potential violations of U.S. securities law. \"The SEC's entire case rests on the false assumption that all tokens are securities. Tokens are in fact, simply a file format for value,\" said Uniswap's chief legal officer, Marvin Ammori. \"The SEC has to essentially unilaterally change the definitions of exchange, broker and investment contract in order to try to capture what we do,“ Ammori said. A Wells notice is typically one of the final steps before the SEC formally issues charges. It generally lays out the framework of the regulatory argument and offers the potentially accused an opportunity to rebut the SEC's claims. So far this year, the federal regulator has sent Wells notices, filed lawsuits, or reached settlements with a host of crypto firms, and the SEC's legal challenges are increasingly focused on ethereum and players working in decentralized finance, including ShapeShift, TradeStation, Uniswap and Consensys. It also comes as the agency is reportedly investigating the Ethereum Foundation. CNBC reached out to the SEC about the recent batch of Wells notices sent to crypto firms, and an agency spokesperson declined to comment. In April, Consensys tried to preempt the SEC's action with its own lawsuit, alleging overreach on the part of the regulator. The 10-year-old crypto firm said its suit followed three subpoenas issued last year, plus a Wells notice from the SEC that claimed the company was violating federal securities laws. \"This action is about the almost certainty that we hold that the SEC is trying to slow or kill ethereum, decentralization, disintermediation and disintermediated technology in the U.S., and probably wouldn't stop there with its long arm,\" said long-time ethereum veteran Joseph Lubin, who went from co-founding the blockchain to launching and running Consensys. \"It might influence other nation-states to do similarly draconian things,\" continued Lubin.\n\nSecurity vs. commodity\n\nThe recent spate of actions targeting major names working in the ethereum ecosystem comes ahead of a long-awaited decision on whether the regulator will approve or deny applications to launch spot ether exchange-traded funds. To date, the agency's stance on ether's classification as either a commodity or a security remains uncertain. \"We think big banks like the way things are organized. We think certain factions of the U.S. government like the way they operate,\" said Lubin. “Without explicitly stating their intentions, without public discussion and clear rulemaking, the SEC seems to have decided to reclassify ether as a security without being able to utter that that's what they're doing.\" The industry argues if ether — the native token of the ethereum blockchain — gets classified as a security, it could throw the future of the ethereum network and many adjacent crypto firms into question. Exchanges, both centralized and decentralized, would be forced to choose between registering with the SEC, or delisting ether altogether. \"If the SEC, in fact, does take the position that ethereum is a security, pretty much everyone in this business that is using or providing services of the ethereum blockchain, they're going to be on notice that they might need to be registered,\" said digital assets attorney Christopher Gerold, who previously served as the chief of the New Jersey Bureau of Securities. \"Whatever protections they thought they had before are no longer going to be there, and we're going to see a shift in the industry,\" continued Gerold.\n\nwatch now\n\nThe head of litigation and investigations at Consensys told CNBC that the firm's been alarmed that the SEC has been targeting developers. \"They asked for a list of the names of any Consensys developers who contributed any coding to the merge,\" said Laura Brookover. The so-called merge was a years-in-the-making systemwide upgrade to the ethereum blockchain that took effect in September 2022 and changed the way transactions are verified. The proof-of-stake model, which replaced the proof-of-work model, requires volunteers on the network to put up their ether tokens, or \"stake\" them, in order to secure the network. Brookover says the agency has explicitly asked for the identities of public and private Consensys software developer code repositories. \"Those are very strange requests from a financial regulator,\" continued Brookover. \"I can speak to that, because I used to be in the CFTC's enforcement division and investigated cases myself.\" Multiple coders and industry executives have told CNBC that it is possible the SEC could be taking more of an interest in ethereum, because the regulator thinks its native token functions more like a security after the merge. Brookover told CNBC that the Consensys suit asks the court to declare both that ether is not a security and that the SEC lacks jurisdiction to investigate ethereum. Ultimately, the regulator will have to respond to the Consensys complaint in a legal filing. \"They're going to be hard pressed not to say in their answer whether they think ethereum is a security or not,\" said Gerold, adding that he suspects that the agency will take the position that it is a security because of the proof-of-stake change that took effect two years ago. One thing the SEC has been clear on is its classification of bitcoin as a commodity. With ether, the narrative has changed. In 2018, when Bill Hinman was still the director of the Securities and Exchange Commission's Division of Corporation Finance, he told CNBC that, \"When we look at bitcoin or if we look at ether and the highly decentralized nature of the networks, we don't see a third-party promoter where applying the disclosure regime would make a lot of sense.\" \"So we're comfortable ... viewing these as items that don't have to be regulated as securities,\" continued Hinman. In April 2023, when Rep. Patrick McHenry, R-N.C., asked SEC Chair Gary Gensler whether ether was a commodity or a security, Gensler demurred.\n\nwatch now\n\nSEC vs. crypto\n\nGensler has, in multiple interviews, repeatedly shared that he believes much of the industry already belongs under its jurisdiction, and its lawsuits are simply bringing the industry under compliance. Crypto firms argue that the recent legal battles haven't given the regulatory clarity the industry has been seeking for years. With the Uniswap Wells notice, for example, a source at the company told CNBC that dealing with the SEC was akin to \"talking to a wall.\" For two years preceding the Wells notice, Uniswap described the protracted interactions with the agency as an opaque process that involved responding to multiple requests, including giving testimony and sending several documents to the agency, without getting much feedback about the regulator’s concerns around potential wrongdoing. This source also told CNBC they had not heard from the regulator at all in 2024 until the agency told them in a half-hour phone call that they would be receiving a formal notice.\n\nwatch now\n\nBoth Consensys and Uniswap suggest the SEC's broad approach to classifying securities may be outdated. \"The SEC is arguing that the Uniswap protocol is an unregistered securities exchange, and that the Uniswap interface and wallet are both unregistered broker brokers,\" Ammori said. But Uniswap argues that the protocol itself is a general purpose computer program that anyone can use and integrate. \"So the protocol is not an exchange also, because under the law, it would have to be specifically designed for securities trading, and it is not,\" continued Ammori. Uniswap argues in its response to the SEC that the majority of its trading volume is obvious nonsecurities, like ether, bitcoin and stablecoins. \"It's not run by a group, as the definition requires, but as autonomous software no person or group controls,\" added Ammori. \"The SEC knows that the current definition of exchange does not cover the protocol, or anything we do. That's why as we speak, there's a pending rulemaking, for the SEC is trying to redefine about a half dozen words in their own regulations to try to capture us,\" continued Uniswap's chief legal officer. Alma Angotti, partner and global legislative and regulatory risk leader at the consulting firm Guidehouse, cautions that it is less clear whether decentralized exchanges function like an alternative trading system, or a market maker — or whether they really are just a technology that does not act as a broker-dealer. Meanwhile, as the SEC ramps up its focus on decentralized players in the crypto ecosystem, centralized players also remain under scrutiny by the regulator. In May, investment platform Robinhood announced it received a Wells notice for the company's crypto operations. The SEC has also sued Coinbase and Binance. With multiple pending legal challenges from the regulator and enduring uncertainty about the future of crypto regulation in the U.S., multiple crypto businesses have said they are considering decamping from the country altogether. \"We've got companies that are wasting resources trying to figure out, 'Am I a broker-dealer? Are these assets securities?'\" said Binance's former chief compliance officer, Christina Rea. \"We're already having a hard enough time trying to get them to be compliant with other important laws — anti-money-laundering laws, anti-bribery and corruption laws.\" On Thursday, the commission will issue a decision on whether to approve one of the spot ether ETF applications after a multimonth delay. Many are waiting to see whether the regulator will offer clarity on its stance on ether. — CNBC's Jordan Smith contributed to this report."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9nX2pJdno5TU5JemxNOEdsazRDV0FZQ2JaTVhlRkZtVHlyU1VRVVFYSjlTWnVNR2c3bEVBRmNfeW9aUUl6RWF2aGN5cXBfSXlPS2FWbUZDYTQzSWFkb3Q1dFlpTG10dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-7022 Proposal on Ethereum? - Unchained",
        "content": "EIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs.\n\nEthereum co-founder Vitalik Buterin and a team of developers are spearheading a new Ethereum Improvement Proposal (EIP). EIP-7702 will significantly improve smart contract functionality on Ethereum by temporarily merging it into externally owned accounts (EOA), thus simplifying and improving user experience.\n\nRead on to learn about the EIP-7702 proposal on Ethereum, how it works, its potential impact, and its benefits and drawbacks.\n\nWhat Is EIP-7702?\n\nThe EIP-7702 proposal was introduced as an alternative to EIP-3074, which was approved for inclusion in the Pectra upgrade scheduled for Q4 2024.\n\nEIP-3074 was designed to refine account management within the Ethereum protocol by allowing Externally Owned Accounts (EOAs) to assign control to smart contracts, paving the way for more advanced transaction strategies. EOAs are a type of Ethereum account controlled by users rather than code\n\nThe proposal would achieve this by introducing two new opcodes, AUTH and AUTHCALL, enabling EOAs to transition smoothly into smart contracts without deploying new ones. This would improve transaction efficiency and flexibility in interactive scenarios and complex operations.\n\nHowever, EIP-3074 faced some limitations, including technical issues and security challenges. These issues became evident in practical applications, especially when dealing with high-value or large-scale transactions. Vitalik Buterin, alongside Ansgar Dietrichs, Matt Garnett, and Sam Wilson, developed EIP-7702 in response to these issues and as an alternative to EIP-3074.\n\nEIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs. The proposal will enable EOAs to behave momentarily like smart contracts.\n\nSimply put, EIP-7702 will inherit and expand some of the functionalities of EIP-3074, such as batch processing, lowering privileges, and transaction sponsorship.\n\nHow Does EIP-7702 Work?\n\nThe proposed EIP-7702 will provide a new method for EOAs to interact within the Ethereum blockchain. Externally owned accounts will be temporarily able to operate as smart contract wallets during transactions before returning to their initial state after the transaction.\n\nThis technique improves the functionality and security of Externally Owned Accounts without launching new opcodes, making assimilation more efficient than EIP-3074. Moreover, removing opcodes from the process helps decrease complexity, compatibility difficulties, development resources, and potential security flaws linked to them.\n\nEIP-7702 has been developed to be forward-thinking, given its compatibility with ERC-4337. ERC-4337 is an account abstraction standard on the Ethereum network that aims to improve security and user experience by launching smart contract functionality in wallets. This integration can help externally owned accounts attain features such as multi-factor authentication, the potential for people to transact using any token, and social recovery.\n\nEIP-7702 can significantly reduce transaction fees by batching transactions, making the Ethereum network more efficient. The proposal promotes financial inclusion by introducing transaction sponsorship, where one user can offset the transaction fees for another user. It also makes the platform more accessible, lowering the barrier to entry.\n\nEIP-7702 also includes downscaling privileges. Accounts can limit their privileges for certain crypto transactions, boosting the platform’s security against fraudulent and phishing activities.\n\nThe Potential Impact of EIP-7702 on the Ethereum Network\n\nThe new Ethereum proposal, EIP-7702, if included in the Pectra upgrade scheduled for Q4 2024, is expected to impact the Ethereum network positively. Although currently in the discussion stage, EIP-7702 offers a robust solution to enhancing Ethereum by introducing account abstraction.\n\nAccount abstraction makes it more flexible for users to program their security better while enjoying an enhanced user experience. Lowering the barrier to entry for Ethereum enhances accessibility, potentially boosting its adoption in the Web3 ecosystem. In addition, smart contracts can provide better safety features, such as recovering funds in case private keys are lost.\n\nTransaction sponsorship also means that users can easily get started with the Ethereum network as they don’t have to worry about buying ether for gas fees.\n\nThe proposal introduces greater flexibility in the design of smart contract wallets for developers. They can customize their verification logic, incorporating features such as emergency recovery techniques, multi-factor authentication, and spending limits. This opens up new opportunities for developers to explore smart contract wallets.\n\nBenefits and Drawbacks of EIP-7702\n\nWhile still in discussions, EIP-7702 has some benefits and drawbacks linked to it. Below are some benefits of the proposal:\n\nBatched Transactions: The Ethereum network can become much more efficient through the batched transaction feature, which can also reduce transaction costs.\n\nERC-4337 Compatibilit y: The EIP-7702 is a forward-thinking proposal compatible with the ERC-4337 standard on Ethereum, which can enhance the user experience and security of the Ethereum blockchain while advancing blockchain technology.\n\nTransaction Sponsorship : If successfully implemented, EIP-7702 will enable users to cover the transaction fees of other users, making the platform more accessible for everyone.\n\nWidespread Ethereum Adoption : By lowering the barrier to entry for users, more people will be able to access and use the Ethereum platform, leading to its widespread adoption.\n\nWhile there is optimism surrounding EIP-7702, it’s not without its drawbacks. Below are some challenges with the EIP-7702 proposal:\n\nAdjusting Gas Costs : It’s still unclear how EIP-7702 will scale the gas fee costs associated with its transactions.\n\nRevocation of Transactions : Implementing EIP-7702 would mean that users relinquish the control of their externally owned accounts to smart contract codes, which, albeit need to be trusted, can be prone to malice. Therefore, the Ethereum team must ensure users can revoke and revert transactions signed using malicious code.\n\nThe Bottom Line\n\nThe introduction of EIP-7702 is expected to benefit Ethereum. Still, its implementation will depend on its developers finding solutions to the raised issues and getting consensus from the Ethereum community.\n\nAnsgar Dietrichs, one of the researchers at the Ethereum Foundation, suggested implementing EIP-7702 to the Pectra upgrade first and tracking it for several weeks before deciding whether to replace EIP-3074 with EIP-7702.\n\nIf incorporated, it remains to be seen how EIP-7702 will revolutionize the Ethereum blockchain."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOd3AzUFNuX0l1Zko5aEdCb3UzVGt2c2RUYVNLOHR6VHRoTUJmTXNRcE5KTy10a3pueEppbDg3NUpLajhQV1FwRDg4TTFSUmcyOWFEQlcxM2ttT09kbXdpNUh3OUw4UnVuQjQwMFZBbl9QZlV5VkFXU0NsY2tueEFIMDdfM2doYmttT1RaTjI5VXJTdlZOUjYtSGItM2FUZElKcDFOR3RBVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum co-founder on why the ETFs will create a supply crunch - DLNews",
        "content": "The SEC looks poised to approve spot Ethereum ETFs.\n\nA significant portion of Ether is locked in staking, DeFi protocols, and DAOs.\n\nThe asset could experience a supply crunch.\n\nAfter months of radio silence, the Securities and Exchange Commission looks poised to approve spot Ethereum exchange-traded funds after all.\n\nThe resulting “floodgate” of demand for Ether will likely lead to a supply crunch, Joe Lubin, co-founder of Ethereum and founder and CEO of crypto infrastructure firm Consensys, told DL News.\n\nInstitutions that have already gained exposure to Bitcoin through the asset’s freshly launched ETFs “will most likely want to diversify into that second approved ETF,” Lubin said.\n\n“There’s going to be a pretty large amount of natural, pent-up pressure to purchase Ether” through the ETFs, he said, but there will be less supply to accommodate that demand than when the spot Bitcoin ETFs were approved in January.\n\nIn Bitcoin’s case, authorised participants — the firms contracted to buy Bitcoin on behalf of the ETFs every day new shares are created — could simply purchase idle coins on exchanges or through over-the-counter counterparties.\n\nBut onchain data shows that more than 27% of the total supply of Ether is already being staked across the Ethereum network. It’s locked in contracts and earning a yield for its owners.\n\n“Much of the Ether is put to work in the core protocol, DeFi systems, or in DAOs,” Lubin said, referring to decentralised autonomous organisations.\n\nIn other words, not only is Ether’s market value lower than Bitcoin’s — making Ether’s price more reactive to inflows — but a significant portion of its supply is unavailable for ETF consumption.\n\nJoin the community to get our latest stories and updates\n\nOn top of that, renewed activity on Ethereum will cause the network to burn a substantial amount of the existing Ether supply over time, constraining supply further.\n\nEven in Bitcoin’s case, banks were so desperate to purchase coins for the ETFs that they reached out to at least one major Bitcoin mining outfit to acquire some of its Bitcoin holdings, DL News learned. The supply crunch for Ethereum ETFs might be even bigger.\n\n“This could be a pretty profound watershed moment” for Ethereum and the crypto industry as a whole, Lubin said.\n\nTom Carreras and Liam Kelly write about markets and DeFi for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com or liam@dlnews.com"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5USmxlOVZUcWZfX1FJbHFBNUkteWdIY0otVEZEX3pPTFdtNG5zTTNKVnhrWllmZVFzWnBoeVg3N3ItTHMzbnRxQkdUMndnaHRMYW1mR0lMS2laN0ZWdW9FYVR3Y0c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval odds surge to 75%, ETH price jumps 8% - Crypto Briefing",
        "content": "Bloomberg ETF analysts change their predictions as background noises from the SEC start.\n\nShare this article\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart increased to 75% their odds of a spot Ethereum exchange-traded fund (ETF) being approved in the US. The previous odds were 25%. As a result, Ethereum (ETH) leaped 8.3% after the news.\n\nPreviously, both analysts explained that the low odds were related to the lack of background noise made by the SEC asking players about the ETF approval. However, due to political issues, Balchunas stated on X that the US regulator will “be doing a 180 on this.” Moreover, the odds at 75% are substantial, since Seyffart and Balchunas are still waiting on filing documents to boost it higher.\n\nSeyffart joked on X about being criticized by Ethereum bulls since he and Balchunas were previously quenching their hopes up until now.\n\n“Never gonna hear the end of this from the .eth people in my replies if this turns out to be true. But it’s what we’re hearing from multiple sources. Should see a bunch of filings over coming days if we’re correct,” he posted on X.\n\nThe first deadline for an ETF approval is on May 23, when the SEC must decide on VanEck’s Ethereum ETF filing. On the following day, the deadline for the ARK21 Shares Ethereum ETF also expires. The last deadline for this month is set for May 30, when the regulator must decide on Hashdex Nasdaq Ethereum ETF filing.\n\nAs reported by Crypto Briefing, not even notorious fund managers were expecting a spot Ethereum ETF approval in the US this week. Katherine Dowling, general counsel for ETF applicant Bitwise, said that “most people are universally expecting a disapproval order.” VanEck CEO Jan van Eck also predicted a likely denial during a CNBC interview.\n\nIn the last 24 hours, nearly $150 million in short positions were liquidated in crypto derivatives, according to data aggregator Coinglass. Of that total, $35.3 million were related to positions shorting ETH."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1EaEhLMUhOYUxmYk5uaXV4SnpENVNPUVNmVUNlU3J5WGM4MlZwazdRU2xTdVNCdW5fYVJESVF3ZzhMa3dRcWNwRWY2dGllX1ItbEN4WkZQUTc3OU5uenFmZ0dOZTZXdnNTdU4w0gFwQVVfeXFMT3BZTXpwUDFzVWpod1NfNzV2RXJjLUhSaWlGLXpGMi1yYkFYV1pZVEtCTzg5bmR6OTQyMWRUOVBuQVV0ZVQ2SkM3dEI3UWJPcDNvUnBtejlOdVktU2d4c3R2LXJFMlFHdFBwMi1qNEhReQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Surpasses Mastercard by Market Cap - U.Today",
        "content": "Ethereum, the second-largest cryptocurrency, has now surpassed payments giant Mastercard by market capitalization ($440 billion and $427 billion, respectively).\n\nAdvertisement\n\nThis comes after the U.S. Securities and Exchange Commission made an apparent U-turn regarding the approval of spot Ethereum exchange-traded fund applications.\n\nAs reported by U.Today , Bloomberg analysts suddenly increased the approval odds to 75% despite previously capping them at just 25%. The reassessment was based on some chatter about the SEC rapidly changing its stance. Just days ago, the consensus was that VanEck's ETF filing was going to be shot down by the SEC due to the lack of engagement.\n\nAdvertisement\n\nAccording to Eric Balchunas, Bloomberg's senior ETF analyst, the SEC has asked exchanges to swiftly update their 19b-4 filings. The SEC could approve an Ethereum ETF as soon as this Wednesday.\n\nAlex Thorn, head of research at Galaxy Digital, claims that the SEC would recognize the underlying as a non-security while staked Ether would be considered to be a security. \"That would be somewhat congruent with their various court cases, as well as with reports about their various investigations, and perhaps allow SEC to approve Ethereum ETFs while maintaining their previously stated/arguing opinions,\" he added.\n\nThe price of the largest altcoin surged by as much as 16.2% over the past 24 hours, according to CoinGecko data . The price of Bitcoin has also added 6%, peaking at $71,650 earlier today.\n\nETH is still down 25.4% from its all-time high of $4,878 which was achieved two years ago."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOcUYyZHRvbG1oT05nY3poaDRBZmRadjVwSmt2YUlFWXlKZEk1RzY3am43OTVZU1ItSzJRUi1rU1hORW8wVjNhVXF6Q0tuZnI2ckxqQjdBcVNYYkJWc3lQTmNqdVZSa0p6eGtTMzJrZ1BDbHRLQ2luLXFONDNnM1BlQldPOHN2dnBDMWtxWThmX2ZScFNuTGNPWXozM0Z4dFJ5OVFaMjVxTVRSSWNWa1ptVlRNQzB0cWtMWm5B0gHAAUFVX3lxTE91bDZqWndnT1BoSVlabmFyT3dwMkVQWDNQUkhFY19UT1lvR0ZiNV9BcHBxUUswOVhWeEhVZUhkY29BTmhsN0F0MFExX01QU3NMTXJLdHpkb1pSNUNTdWQ0elhWdEoxOTVEZjZTMXgtUGltem8xYTBkYmNReTFwNWVzOG83Y3NrR2R2Sk9rc3VIRlg4T3UyVnpmSXQ1cmVkNTh1Z0s3NDBtWTM1NFZyOXdkaWhIQ3IxQ204UHAybjczUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ether Rally Prompts Over $300 Million ETH Inflow to Crypto Exchanges: Nansen - CoinDesk",
        "content": "Tuesday was also the third day in a row of inflows, marking a break from the general trend of decreasing ETH balance on exchanges, Nansen data shows. The last time ETH experienced consecutive days of inflows to exchanges was in March, near this year's peak in crypto prices."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPTlV6c0JhcV93Y3pRR2NLVXcyOFVjMzNrVnJDc3RTTW9WZktOd29aclhHQ3hLVzNJamh6ZXJDV0N2OGEtbzJEOTdXQV9hVi1FR1QwWURncHZyR2FibUo5eUlGWjZGRzhDVHpORndUbnpBU0hVRE1hZExaWWZfSEJwMWRuRmR3c24t0gGQAUFVX3lxTE9ob09pNGFHQ3M0V0hHakJVSC1hUmthenZjenpfT25BXzNSelpJU0dQQVR3ak9CcDA1VDNtakNiZXNsU2NjTW9GWUVzcEpQWmRaUjFFcVpWRUNSSkRMdFpJUzhsRUJLanotcXllRW9ZUFJfY3RjeDhadHpWRXhnbUJ3czJvZVVQRGhVWVZBZF84Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Solana, Avalanche Soar as Ethereum Price Tops $3,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum are up big today—with the latter soaring on rumors that an ETH-based exchange-traded fund (ETF) could soon hit the U.S. market.\n\nThe price of Bitcoin touched $70,000, triggering a flood of liquidations, while ETH is trading over $3,500 as of writing. But the top two coins by market cap aren't the only ones seeing big gains. The entire crypto market is up, with Solana and Avalanche the top gainers.\n\nSolana, the fifth biggest coin by market cap, is up over 8% in the past day and is now trading hands for $184.17, according to CoinGecko.\n\nAD\n\nAD\n\nThe coin isn't as close to breaking records like Bitcoin is, though—it still has to rise in value by another 29% to hit its 2021 all-time high of $259.\n\nElsewhere, Avalanche is also riding high: of the top 20 coins and tokens, it's doing the best, having shot up by nearly 9% in 24 hours. It is now priced at $38.24.\n\nThe coin, which runs on a network used by developers to build decentralized apps, is the 12th biggest digital asset by market cap and last year made headlines when J.P. Morgan announced that it had used its blockchain to tokenize investment portfolios.\n\nFurther down the list of top cryptocurrencies by market cap, price surges have also hit Uniswap (UNI), Pepe, and Lido DAO (LDO) with 24-hour gains of over 18%, 20%, and 21%, respectively.\n\nEthereum, the second biggest cryptocurrency, is currently up 14% in the past day, coming in priced at $3,511. The asset shot up on news that Wall Street's biggest regulator, the Securities and Exchange Commission, could be close to approving a spot ETH ETF.\n\nAD\n\nAD\n\nSuch an investment vehicle would give people exposure to the second biggest digital currency by market cap via shares that trade on a traditional stock exchange.\n\nThe SEC approved 11 spot Bitcoin ETFs in January but has been coy on the issue of approving an ETH equivalent.\n\nA long-list of big Wall Street firms have filed paperwork to release a spot ETH ETF, including BlackRock, Grayscale, and VanEck. Up until the latest rumors, the prospects of approval seemed dim.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5BLU5aMlctaC0tSWU1M3diQXZObHlBRWYtV2JjeDJ3V2E0YXhBdFpIbjg2dnZvZXJ5RV9VSGRONzJ5em1lWVE2cUhRQjdUenJrOWxYWnNIZ1F4S0VTVFdNbW9jOXprazDSAWxBVV95cUxOQnZpMHlFSVRFblQzMTVkVUlZcVp6V1NOT1dxbXdjT1l3bnBxNUo1QWUzOFg3RnJrQlhXOHVWLVBmWTV2bE95ekpZUWRYejV2YnBJWVUtZDZKbHI4bHQxYjlfT2xhcS1WckVxOU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ether jumps more than 20% in two days on renewed optimism for an ETF - CNBC",
        "content": "In this article HOOD\n\nCOIN\n\nBTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nOmar Marques | Lightrocket | Getty Images\n\nCryptocurrencies rose Tuesday amid a late surge in optimism around the U.S. Securities and Exchange Commission's decisions on spot ether exchange-traded funds applications, the first of which is due this week. Ether led the rally, rising more than 20% over two days to $3,710.31, according to Coin Metrics. Earlier, it rose as high as $3,835.43. \"This sudden flip in expectations is an unexpected boon for [crypto] investors who have been crying out for a driver after the [Bitcoin] halving passed and bitcoin ETFs were launched in the U.S. and Hong Kong,\" said Antoni Trenchev, co-founder of crypto exchange Nexo. \"If the spot ETH ETFs are approved, altcoins should take off as ether is often a leading indicator for the rest of the crypto market.\"\n\nStock Chart Icon Stock chart icon Ether rallies on ETF optimism\n\nThe rally began suddenly on Monday, amid reports that the SEC has requested key document updates from potential ETF issuers and exchanges. A spokesperson for the SEC said the agency does not comment on individual filings. Now, investors are considering the odds that the SEC might greenlight spot ether ETF applications. The previous consensus was that the agency was unlikely to approve the funds, based on the lack of engagement by the agency on the filings. By contrast, in the weeks leading up to approvals for bitcoin ETFs, the SEC was reported to be engaging actively with fund issuers. Final decisions on applications by VanEck and Ark Invest are due this Thursday and Friday, respectively. BlackRock, Fidelity, Invesco, Grayscale and Bitwise Asset Management also have applications awaiting decisions this year. Ether futures ETFs hit the U.S. market for the first time in October, just a few weeks after courts ruled against the SEC in a landmark case brought by Grayscale that paved the way for spot bitcoin ETFs and may have set a precedent for spot ether ETFs. The court said the SEC's denial of Grayscale's proposal to convert its popular bitcoin trust into an ETF was \"arbitrary and capricious,\" and that the agency failed to adequately explain why it approved the listing of two bitcoin futures exchange-traded products, or ETPs, but not Grayscale's proposed bitcoin ETP. Bitcoin hits the brakes As ether rallied for a second day, bitcoin and crypto stocks lagged. The flagship cryptocurrency was little changed Tuesday, holding on to a 7% gain from the previous day that pushed it above $70,000 for the first time in more than a month. Bitcoin has been rising since last week's April CPI reading showed inflation eased from the previous month, which could open the door again to lower interest rates in the U.S. Crypto-related equities initially rode the wave higher, but also pulled back on Tuesday. Coinbase and Robinhood , both plays on the trading of cryptocurrencies, were little changed, building on gains of 8% and 9%, respectively, from the previous session. MicroStrategy , which is more of a proxy for the price of bitcoin, fell 4%.\n\nStock Chart Icon Stock chart icon Bitcoin initially jumped with ether on Monday but has since pulled back"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOS1BZUFpYaF9KYXBrMGdHb3YzcnNyMXBZOEYzRmhjTUNOaVZqLUUySGFwNXVta2ZtOE5ySXhFaXZlSWZ6dlFhV090MGhtLVdEak9lT25COFVUalEyOHBhdThHXzR3ME9ZY2Q1dFhpdEJobGF2VnRCZnBlWWd0anhDdVdqSDBUU1RnUFkxTkkyYllGYkNDdEFQN2pRajBEdEZOdDN2bUstaHlhZDJRU2IwZk9ScE4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum rises 18% and Sen. Elizabeth Warren sinks in latest D.C. crypto drama - Fortune",
        "content": "Crypto markets got a jolt on Monday on news that the Securities and Exchange Commission has gone back to would-be issuers of Ethereum ETFs, asking them to update their filings. The move was widely interpreted as a signal the agency had suddenly gotten cold feet about its widely anticipated plan to reject the ETFs. In response, Ethereum rose from around $3,100 to over $3,700 by midnight, a gain of nearly 20% that also gave a boost to crypto prices across the board.\n\nThe reports of the request for new filings came three days before the SEC faces a final deadline to approve or reject an Ethereum ETF application from VanEck, one of the 11 companies that launched a first-of-its-kind ETF for Bitcoin in January. Those Bitcoin ETFs brought about a speculative frenzy that pushed the currency to an all-time high and, by all appearances, it looks like the markets are betting the good times will start up all over again, this time with Ethereum as the band leader.\n\nTo be clear, that SEC approval is far from a sure thing and, in any case, this week’s VanEck decision only concerns a request to change agency rules to allow an Ethereum ETF—even if the application is approved, VanEck and others will have to wait for weeks or months for the SEC to sign off on their corporate paperwork. But it’s easy to forgive the crypto crowd for feeling optimistic and a little giddy given what else has happened in the last few days.\n\nFor starters, Monday also saw the Chairman of the FDIC, a powerful crypto opponent, resign in the wake of a scandal over a culture of toxicity and sexual harassment at the agency. Meanwhile, crypto boosters are still jubilant after a dozen Democrats in the Senate, including Majority Leader Charles Schumer, bucked their own party’s position and voted for a bill that would make it easier for banks to hold crypto. While President Joe Biden said earlier that he would veto the bill, not everyone is sure about that following the Senate vote and a dawning realization among his party that crypto is more popular than people once thought.\n\nIf pro-crypto forces are the clear winners of this surprising series of developments in Washington, D.C., there is also an obvious loser: Sen. Elizabeth Warren (D-Mass.). The senior senator from the Bay State is not only the leader of her party’s progressive wing, she has also long enjoyed an arrangement with the president that lets her dictate wide swaths of financial policy—including its ferocious opposition to crypto. But in the past week, the Senate vote on the crypto bill shows her hold over policy is weakening. At the same time, she lost an important ally with the resignation of the FDIC chair—whose job she fought to save. Warren’s influence in her party is waning.\n\nOr if you prefer a shorter version of all this drama out of D.C., in the words of a crypto bro, the week can be summed up as “long Ethereum, short Warren.”\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nLongtime Grayscale CEO Michael Sonnenshein is stepping down to be replaced by Peter Mintzberg, head of strategy for asset and wealth management at Goldman Sachs.. (Fortune)\n\nA bankruptcy court's approval of a $3 billion wind down of Genesis Global includes a $2 billion settlement between Genesis and New York state that will be used to compensate investors. (CNBC)\n\nA U.K. judge wrote that fake Satoshi Craig Wright lied to the court “extensively and repeatedly,” prompting Bitcoin developers sued by Wright to suggest they might seek criminal perjury charges. (CoinDesk)\n\nIn the latest sign the crypto venture capital market is back, blockchain-focused New Form Capital said it is raising $100 million with a focus on trading markets and payments. (WSJ)\n\nDating app giant Match announced a new coalition with Meta, Coinbase, and other crypto firms to combat romance and pig-butchering scams. (Fortune)\n\nMEME O’ THE MOMENT\n\nWarren opponents take a preliminary victory lap:"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxOc1R0NEotRHhsMUd1TTRNT1V5Szl1NWk3VS1CYUR0bTFaUk9UQ1kxMmhUZ3NCdlZQZDdyWUx6RFpSWDRTRHpCYkVPYUtyMmhEY092LVZRc2NxVGhfVklJTUhLMVdIbEhFbDJ0Z2pfblh5NXR1WkJ4ODJMdGtvdDdUTXptSHBmVlkzQmsyc0RqX3Z0LW1td05Td3JDMUNObURXb1d6UDhyVm0tdW5vZXVlWklieTVhTDM4RjVtR3FtcVZDeURpY0RaZFJ4aDFtOUpSV3liWW55cG9nR3VrNml3SnJwNkZqVW8zdWRzTm1jaHQzLUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Controversial blockchain firm Prometheum launches long-awaited Ethereum custody - Fortune",
        "content": "The U.S. crypto industry has complained loudly about a lack of regulatory clarity, but one firm sees it differently. Digital assets platform Prometheum has taken the contrarian view that a clear legal path already exists to trade crypto—a stance that has drawn the ire of others in the industry.\n\nOn Friday, the New York–based company put its theory to the test by launching its long-planned custody services for Ethereum. The move is notable because Prometheum is doing so in a way that classifies the token as a security under the supervision of the Securities and Exchange Commission. The custody launch appears to validate the position of agency chair Gary Gensler, who has countered the broader crypto industry’s position by saying the existing regulatory regime is adequate and effective.\n\n“It eliminates a lot of the arguments that things can’t be done under existing laws,” said Aaron Kaplan, the co-CEO of Prometheum Inc., the parent company of the entity launching Ether custody. “It marks the first time that…an investment contract digital asset security is being custodied and treated under the securities laws.”\n\nThe wager\n\nFounded by the brothers Aaron and Benjamin Kaplan, Prometheum existed in relative obscurity before bursting onto the crypto scene in mid-2023 with the announcement that it had procured a first-of-its-kind broker-dealer license that would allow firms to custody digital asset securities.\n\nWhile much of the blockchain industry argues that the vast majority of cryptocurrencies should not be treated as securities under the jurisdiction of the SEC, Prometheum made a novel alternate claim. It argued that its special-purpose broker-dealer distinction—along with a license for a separate entity to operate an alternative trading platform—would allow it to offer trading for cryptocurrencies under existing SEC regulations.\n\nPrometheum’s wager, along with a contentious appearance by Aaron Kaplan at a House Financial Services Committee hearing on digital assets, drew withering critique from industry leaders, who argued that Prometheum’s approach would not work, and that it would not be able to launch products or find customers.\n\nFor months, Prometheum declined to name which crypto assets it would treat as securities and offer on its platforms, until February, when it announced that it would soon make Ethereum available for custody. While the launch does not constitute its full trading offering, custody is a necessary first step to facilitating trading, as customers need to have a venue to hold the assets they buy and sell. By operating both the custodian and the trading system under separate entities with approval from the SEC and the Financial Industry Regulatory Authority (FINRA), an independent industry oversight body, Prometheum claimed it had found a compliant path where competitors like Coinbase had failed.\n\nAgain, the announcement was met with vitriol, with crypto advocates fearful that the launch would mean the SEC viewed Ether as a security—a position the agency has not yet made, but has repeatedly telegraphed, and that would have far-reaching consequences for the sector. Those worries were exacerbated when the SEC issued a Wells notice against the Ethereum developer Consensys in late April that seemed to confirm the industry’s fears.\n\nPrometheum’s launch of Ether custody services, however, was delayed beyond its target of March—until Friday. Kaplan told Fortune that Prometheum Inc., the subsidiary of Prometheum that holds the broker-dealer license, soft-launched the product with a small group of companies and planned to fully launch custody services by the first week of June. Full trading, he said, would come within a quarter. He declined to provide further details on the companies included in the pilot.\n\nAfter months of threatening to upend the crypto industry’s long-held belief about the possibility of trading Ether under SEC guidance, Prometheum’s custody launch represents the first test of the company’s strategy.\n\n“It took a little longer than we anticipated,” said Kaplan. “But we didn’t really have the option of doing it a different way.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9vaGV6eDhoU0d3cHVlcG5oMklpMDRiRlVYUnVhYzJzYVB3Yk5vOXl1UlBZTDFncXpDbjNZTDg1N0paMExkOTBILUlYZGRSMEd4bWpqWG1PemFfVVBEVU9pMkF0dmtpQmtVZHViQUN5QkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Will Ethereum Reach $5000? - Crypto Times",
        "content": "As the overall crypto market begins to show signs of strength, Ethereum, the largest altcoin, sees an overnight increase in price. The bullish resurgence takes back the psychological $3,500 mark as the underlying demand increases in tandem with the improving sentiment surrounding the approval of the Ethereum ETF.\n\nAdditionally, Ethereum’s bull run is further fueled by the market’s recovery rally, which is being supported by Bitcoin’s surge above $70,000. What’s the deal, then? Will the price of Ethereum surpass $5,000?\n\nHere is an overview of Ethereum:\n\nETH Price Prediction For May 2024\n\nThe Ethereum price is $3,813.68, a change of 23.79% over the past 24 hours as of 8:20 p.m. The recent price action in Ethereum left the token’s market capitalization at $453.80B. So far this year, Ethereum has a change of 66.09%. The recent price jump comes along with high volume as it has surged 335% in the last 24 hours.\n\nTechnical Analysis of Ethereum\n\nFrom a technical standpoint, Ether’s current gains are part of a falling wedge breakout.\n\nA falling wedge forms when the price moves within a descending channel with two converging trendlines. Meanwhile, as a rule of technical analysis, the pattern resolves when the price breaks above its upper trendline and rises to its peak height.\n\nEthereum Technical Analysis | Source: Tradingview\n\nToday, the price surged passed the 50-day EMA (Exponential Moving Average), as it moves toward $4000, expected as the initial target of the falling wedge breakout.\n\nEther open interest, funding rate rise sharply\n\nEther’s price increase coincides with a sharp increase in its open interest (OI) and funding rates.\n\nOn May 21, Ether Futures OI increased by more than $3 billion, and jumped to $14.68 billion, while the funding rate reached a one-month high of 0.567% per week.\n\nA high OI typically indicates increased investor interest and confidence in the asset, implying that traders are preparing for possible price movements.\n\nMeanwhile, a high funding rate indicates that more traders are betting on Ether’s price rising (long positions) than on it falling (short positions). This suggests that traders are bullish and willing to pay a premium to maintain their long positions.\n\nCan Ethereum Reach $5,000?\n\nWhile the current market conditions favor Ethereum, reaching $5,000 depends on several factors, including:\n\nOverall market trends: Continued strength in the broader cryptocurrency market would benefit Ethereum.\n\nContinued strength in the broader cryptocurrency market would benefit Ethereum. Regulatory developments: Approval of an Ethereum ETF could trigger a significant price increase.\n\nApproval of an Ethereum ETF could trigger a significant price increase. Ethereum-specific developments: Progress on Ethereum’s upgrade to Ethereum 2.0 could further boost investor confidence.\n\nOverall, the technical indicators and rising investor sentiment paint a bullish picture for Ethereum. However, external factors will ultimately determine whether the token can reach the $5,000 milestone."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOalVwUUhSQ2hWanRELTJfTlpheWtTT2FCNF9STXU0RUZIa21fRXdabDdLakt4YTB6b1VUVHBzN2xsQ1JKQThHdXlvUl82NU1ieEd3a19pR2J2NUFnNnJHQWVBa3gwbEZtOUZlSi1uV1hQNXhlM3JqSDN1OTlYcnFKYVd3OEQzY1hHUGdmcWxCUmQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF approval could send ETH price to $5k, analysts say - crypto.news",
        "content": "Analysts at crypto trading firm QCP Capital say the unexpected approval of spot Ethereum ETFs could propel ETH price to $5,000 “later in the year.”\n\nThe price of Ethereum‘s ETH native cryptocurrency might target the $4,000 mark as a “natural short-term target” should the U.S. Securities and Exchange Commission (SEC) approve spot Ethereum exchange-traded funds (ETFs).\n\nEthereum price in USD | Source: TradingView\n\nIn an analytical update on May 21, analysts at the Singapore-based trading firm stated that the second-largest cryptocurrency by market value could eventually hit $5,000 later this year if the SEC surprises the market with its approval. However, if the financial regulator rejects applications for the ETFs, the market should expect an “ugly move back” to $3,000, where ETH has multiple times demonstrated strong support at the $2,900 level.\n\n“This uncertainty has resulted in higher volatility, but the better trade might be spot-futures basis which is now yielding above 10% again.” QCP Capital\n\nYou might also like: Bloomberg analyst: Ethereum ETF approval unlikely\n\nFollowing rumors of a potential approval, Ethereum’s price surged nearly 20%, reaching $3,650 on Tuesday. QCP Capital previously cautioned that a “resounding lack of interest” in the market combined with the approval of spot Ethereum ETFs could “easily” boost ETH back to recent highs. The analysts cautioned that an unexpected approval might trigger a short squeeze, pushing ETH to new heights.\n\nHowever, the SEC may still have a card up its sleeve by introducing a nuanced distinction between Ethereum and staked Ethereum, classifying the latter as a security. According to Alex Thorn, head of research at Galaxy Digital, this strategy would align with the SEC’s ongoing legal battles and investigations, allowing the commission to approve Ethereum ETFs while maintaining its established regulatory stance."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1GR2xDUzJSTXh1dmRqQUFwS09KVE16Ml9pb1lKVW5NQ1NSb0l1SFZaNzJ2QktCc3dCbmdMSGRpT3JrbkVQWUlfNDlHZ1RtV00xMW5oWlVHTnB1YXh2TjFpeUt6MDdQYVJydWpCLUNGOTRsd9IBd0FVX3lxTE0zWTA3QkVlQW9PX0JyUVYwMEpCYmxSeXpuOURySnFIWHpFUGk1a0hnY1NicFVpb0hrSkJseFhaUHlNUzBZNGR0OVpoYVBNVFVidGoxbk5oZk5idmd3OWFQMVJCMThQbzNvcHRobnNPcVRHdlJZMG5v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Nears Key Breakout, Eyes $4,000 Target - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, is on the verge of a significant breakout, according to prominent crypto analyst Jelle. In a recent tweet , Jelle highlighted a potentially bullish setup for Ethereum, noting that ETH was close to breaking out from a falling wedge.\n\nAdvertisement\n\nThe analyst mentioned that after reclaiming the 100-day Exponential Moving Average (EMA), ETH only needed a little push to break out from the multi-month continuation pattern, with a target of over $4,000. The falling wedge pattern, a technical analysis tool, is typically seen as a bullish indicator, suggesting that a significant price movement could be imminent.\n\nReclaiming the 100-day EMA is a crucial step for Ethereum, as it often acts as a support level, reinforcing the potential for an upward breakout. If ETH successfully breaks out of the falling wedge, it could target the $4,000 mark, a significant psychological and technical level for the cryptocurrency. This potential move could attract more investors, further driving up the price and trading volume.\n\nBullish signals emerge for ETH\n\nAs of the latest data, Ethereum is trading at $3,101, experiencing a slight decline of 0.28% in the past 24 hours. Despite this minor drop, the ETH price has shown a positive trend over the past week, gaining 4.07%. This upward momentum is reflected in the increased trading activity, with the 24-hour trading volume surging by 35.51% to reach $11.17 billion.\n\nAdvertisement\n\nMoreover, technical indicators further support the bullish outlook for the Ethereum price. The Relative Strength Index (RSI) stands at 51.93, which is indicative of bullish sentiment on the market. Notably, the Moving Average Convergence Divergence (MACD) level is at −26.25, signaling a buying opportunity for investors."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBJSkg5aXZvWnkzNUVFWTRuNldFT3dWaGpaLTBoTXA3Yi1LLXpfdmVNNFhYeEhrZzBiQjlGYll6YXZsYl9UVWVjVjlSa2Z0bFJLaWM3RVZLZTJGYV8yUnVDaXlhUWNFQWx2a0xwSGhXT2NhYXNwc2JHdXhSN3k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Obol Network to fund ‘sustainable’ Ethereum development - Blockworks",
        "content": "As the price of ether increases, the cost of running a full solo staking node — with 32 ETH now worth $115,000 — moves further out of reach for all but the most hard core hobbyists.\n\nOne of the social goals that Oisin Kyne and Collin Myers, founders of Obol Network, care about most is enabling people that don’t have that kind of capital to participate in Ethereum consensus.\n\nThe pair looks forward to the day when the number of entities and locations validating the network will rise tenfold from its current crop of single-digit thousands of operators.\n\nThat includes a fellow in a Kenyan village who, according to Kyne, participates in a distributed validator cluster via EtherFi, running his hardware off a Starlink and a generator.\n\n“It certainly feels good to have people that are staking — that have the technical ability and are really into it, but either weren’t in early or don’t have, you know, bags — that can actually decentralize Ethereum and quite happily do it from the middle of nowhere,” Kyne told Blockworks.\n\nObol has spent the past few years proving out the technology to decentralize projects like Lido, its launch partner, and to enable more solo stakers as well as new paradigms like squad staking.\n\n“We worked with [Lido] to integrate the technology into their stack, and now we’re progressively opening the code base, decentralizing the community, and in the future plan to incentivize the community and bring everyone together around this contribution based mindset,” Myers told Blockworks.\n\nAs a first step, Obol has announced the “1% For Decentralisation” funding model for the DVT middleware provider.\n\nUnder the plan, Obol’s distributed validator (DV) clusters will contribute 1% of their staking rewards “toward projects that add value and impact at the Ethereum consensus layer, including technology partners, researchers, community educators, node operators, and more,” according to a blog post published Tuesday.\n\nThe initiative piggybacks off the EasyRetroPGF — or Retroactive Public Goods Funding — system pioneered by GitCoin.\n\nWhereas public good funding from the Optimism Foundation focuses on the execution layer and user adoption, “there needs to be a more concerted focus around the validator, infrastructure area, the consensus integrity, that whole side of the network,” the Obol founders say.\n\nMiddleware provides an interface between Ethereum’s consensus layer and software further up the modular stack.\n\n“The creation of middleware enables add-on use cases to your existing experience,” Myers explained. “Without middleware, it’s just a boring old validator — you can’t do anything.”\n\nMEV Boost is one example in wide use alongside Obol today, that enables the little guy to earn similar staking yields as large professional operators. And soon validators will be able to participate in EigenLayer Actively Validated Services (AVS) or similar offerings on top.\n\n“All of this is an extension of the validator as a world-class citizen of Web3,” Myers said.\n\nEthereum is sometimes criticized for the complexity of its design, or for tolerating centralizing influences in certain areas, such as block building and the scaling of the execution layer.\n\nBut Myers feels those attacks are misplaced.\n\n“From where I sit, two years ago we went from bad rent extraction, client centralization, a completely monolithic software stack, and now we’ve moved to modular, a bit more decentralized, open source, multiple options, lots of funding, good debate — and for me that’s progress,” he said.\n\nWhile there is some movement in the direction of ossifying the base consensus layer, he pushes back against the notion that the roadmap is decreasing innovation at layer one. Rather, “they are just enabling it to exist elsewhere through decentralization…and DVT is a living example of that,” he said.\n\nThe “stage” framework used by L2beat is a useful gauge of decentralization progress, and Osin agreed with Vitalik’s commitment to push “layer-2s” as such to reach the Stage 1 level by the end of the year.\n\n“It’s an interesting social showing, of people being like, ‘no, we’re not going to tolerate a sidechain masquerading as an L2, unless you can permissionlessly exit back to L1,” Osin said.\n\nLido is backing the new Obol funding approach, with contributor Will Shannon, calling it “a fantastic approach to strengthening the resilience and decentralization of the Ethereum protocol.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNOFhKa1g3WHptcmdpVm1UWlVUQ0ZqLXBLa1A3a2gxTHByam5uZ1liWkFHOGRsZ1cwVmJvaUN6YlR4eGhmMHF0bEhLY3ZfSFp4d1ktZU1wak8xSGZyM1BtRlEyaU05dGhrX05qZzd1S0p5NU9oMHB3VXI5akF1blVQTUx5M3VHSlh2dUgyM2ZVWHlDdFBqVHhKUHRybDZaYmFf?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "StanChart reaffirms Ethereum’s potential to hit $8000 following ETF approval - CryptoSlate",
        "content": "Standard Chartered reaffirmed its projection that Ethereum (ETH) will reach $8,000 by the end of the year, following heightened anticipation of ETF approvals.\n\nStanChart’s head of crypto research, Geoffrey Kendrick, said in a note shared with CryptoSlate that recent developments reflect heightened investor optimism and increased market activity.\n\nKendrick’s statement comes after Bloomberg analyst Eric Balchanus significantly increased the likelihood of spot Ethereum ETFs being approved this week.\n\nBalchanus raised the odds from 25% to 75%, citing changes in the Biden administration’s stance on the approvals. Polymarket similarly revised the approval odds to over 60% from 10%.\n\nThe announcement has had a ripple effect across the crypto market, influencing both trading platforms and asset prices.\n\nKendrick also highlighted that the net asset value (NAV) discount on the ETH Grayscale Trust (ETHE) narrowed significantly over the past day, jumping from -25% to -12% — signaling increasing optimism in the market.\n\nEthereum prices have responded robustly, climbing 18% to $3,700. This rise has positively impacted the broader crypto market, with several digital assets experiencing similar uptrends. The focus now shifts to the US SEC, which is expected to make a decision on the spot ETH applications by Thursday.\n\nBalchanus recalled the SEC’s approval of Bitcoin (BTC) ETFs on Jan. 10, which came shortly after a report from the hacked SEC Twitter account the previous day. Market participants are watching closely for a similar timing pattern in the ETH ETF decision.\n\nIn a March research note, Kendrick projected that the approval of ETH ETFs could lead to inflows ranging between $15 billion and $45 billion within the first year. He maintains this forecast, emphasizing the potentially greater impact of ETH ETF flows compared to BTC ETFs.\n\nHe argued that the relative lack of alternatives for ETH positions pre-ETFs and the perception of Ethereum as the ‘big tech’ of digital assets will drive significant investor interest.\n\nKendrick has set ambitious price targets for Ethereum, forecasting it to reach $8,000 by the end of 2024 and $14,000 by the end of 2025.\n\nHe also noted the positive implications for Bitcoin, expecting a fresh all-time high for BTC by the weekend, surpassing the previous peak of $73,798 set on March 14. He reiterated his year-end price targets of $150,000 for 2024 and $200,000 for 2025 for Bitcoin.\n\nThe impending decision on ETH ETFs could further legitimize the crypto sector, potentially driving significant capital inflows and boosting market confidence. Investors and market watchers await Thursday’s decision, which could mark a pivotal moment for Ethereum and the broader digital asset market.\n\nMentioned in this article"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOU1QSENDM0FFR2YycG5XX2NObzdvMnBnMnlYUjVTLV9rSURkMW5zQ3haR1gxLWRoc3VYV2M0eHpMMHd3b0ROZlg1RXdiZnpWTml1MGVpVHdvdjRxOFBjWG5PU19KeFFjZHdvdG1pY0VwNWloclNONEZYUmo5R0FIUkVYa1pBR1luUW50dQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week? - Yahoo Finance",
        "content": "Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week?\n\nOn Monday, May 20th, Bloomberg ETF analyst Eric Balchunas posted on X, raising his chances of a spot ETF approval from 25% to 75%. Within an hour, the post received over one million views. Balchunas is regarded as one of the most trusted sources in the crypto ETF space after playing a role in news coverage of the spot Bitcoin ETFs, which were released in January 2024. The update from Balchunas made waves in the crypto markets, causing the price of ETH to skyrocket over 10% within minutes.\n\nDon't Miss:\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today ?\n\nIf you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nBalchunas said that he is \"hearing chatter this afternoon that SEC could be doing a 180 on\" spot Ethereum ETF applications. The SEC has been largely quiet about Ethereum ETFs over the past several months, mainly looking to make a decision on whether ETH should be classified as security or a commodity. Because the SEC has been so quiet, many have taken it as negative for the chances of a spot ETH ETF approval. However, with a final deadline for multiple ETFs on May 23rd and 24th, there is seemingly pressure on the SEC to make decisions before the deadline.\n\nTo add more context to Balchunas' post, he alluded to another tweet from Nate Geraci, a crypto ETF expert. Geraci's tweet noted that the \"SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch. Technically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here).\"\n\nEssentially, the SEC could give a partial greenlight to the ETFs, giving them time to take a much closer look at S-1s, which would allow them to better vet the applications to see how compliant they would be. This seems to make the most sense, as the SEC has been in the midst of a large debate surrounding the ETFs that could take more time than previously thought to conclude.\n\nTrending: According to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nAnother point of context is that ARK and 21Shares recently amended their application to remove staking. The move was likely made in an attempt to make their application more appealing to the SEC. While removing staking is obviously a negative for the ETF, it could play a role in increasing the odds of approval.\n\nThe buzz that Balchnas is hearing must be significant. Less than a week ago, he posted saying that he believes the odds of a spot ETH ETF are \"slim to none\", but has since raised his prediction to 75%.\n\nStory continues\n\nThe path of the Ethereum ETFs does share some similarities with the approval of the spot Bitcoin ETFs, as the SEC was largely quiet in the weeks and days leading up to the approval. While the situations are largely different, it does show that it is entirely possible that the SEC could approve spot ETH ETFs later this week despite relative silence from the SEC.\n\nA spot Ethereum ETF would be a huge milestone for crypto adoption, allowing a whole cast of new investors to access the token and could potentially send ETH to new ATHs above the $4,900 level.\n\nRead Next:\n\nHow much Bitcoin did Michael Saylor says you need to become a millionaire? The number may shock you.\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOYXFqcWxDZTVXdXdiNU1fQ293UmxHWlo4eXh1cUpseUdsbUlFb01tcGxKa1piWVJnNWNuZTBjZFhCckZlZGVXX2VRMjlqYzc5NTFOWFhKc0ZHZ3RpTFVDLS1WVzMwbnpJOW80YURDWmFTUGVDQlJlQUhmNm9JWDc0ZXRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Surges Above $3K Mark Amidst Unforeseen Court Ruling - Yahoo Finance",
        "content": "Ethereum Price Surges Above $3K Mark Amidst Unforeseen Court Ruling\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced a notable price rally over the past 7 days, with a 5.36% increase that brought its price close to the $3,100 level. Analysts attributed this surge to stalling retail sales data in the United States for April, raising expectations of a potential interest rate cut by the U.S. Federal Reserve to stimulate economic growth.\n\nETH's surge was also influenced by a court ruling and a U.S. Department of Justice indictment. The indictment, unsealed on May 15, accused two individuals of wire fraud and money laundering through the manipulation of the Ethereum blockchain. The court document emphasized that Ethereum operates as a decentralized blockchain without the need for a trusted intermediary, boosting confidence among ETH investors.\n\nThis came after the U.S. Securities and Exchange Commission issued a Wells notice to Robinhood, a trading platform, over alleged securities violations related to crypto listings and custodian operations. The verdict contradicted regulators' classification of ETH as a security, as it highlighted the absence of management or entrepreneurial efforts by others within the Ethereum network.\n\nThe U.S. SEC is expected to announce its final ruling on VanEck and ARK Invest’s spot Ethereum ETF request on May 23 and May 24 respectively. While analysts predict approval odds below 35%, the case for classifying Ether as a security instrument has weakened, contributing to the rally above $3,050 on May 17."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNZ19yT3k0Z2ZPQmNWYmZLYUJHVzhSSnJsU0VIUkF2VE1YSzZvb09hV0lIOUtXYlFmNTEyaVNFTUVSUkpEVkZJQmNvMmppc1A1d0RmcGJncTNVSVhTY0dfQWR0NnAyZnMxTWt4b3dtNC10VWxCb19uSUhIMGhSZ2ZMbWw4UjFSR0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Fidelity adjusts Ethereum ETF plan, excludes staking rewards - Yahoo Finance",
        "content": "Fidelity Investments has revised its Ethereum exchange-traded fund (ETF) proposal, now excluding staking rewards.\n\nThe updated filing with the U.S. Securities and Exchange Commission (SEC) arrives just days before the May 23 deadline for the ETF’s approval decision.\n\nThe amendment to Fidelity’s S-1 registration statement, which now omits references to staking rewards, appears to be a response to the SEC’s enforcement actions, particularly the June 2023 case against Coinbase for offering staking services, which was deemed a securities law violation.\n\nThe removal of staking from Fidelity’s ETF strategy could alter the product’s attractiveness to investors, particularly those interested in the additional yield from Ethereum’s validation process.\n\nHowever, SEC approval could signal a major step in integrating cryptocurrencies into mainstream finance, with analysts predicting strong investment inflows, akin to the initial success of Bitcoin ETFs.\n\nMeanwhile, the SEC may be leaning towards approving spot Ether ETFs.\n\nBloomberg analysts Eric Balchunas and James Seyffart on Monday revised their approval probability from 25% to 75%.\n\nEther has since surged in value, trading as high as US$3,818 on Tuesday, according to CoinGecko."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPT0ZFNTJMMVZFbmlFb3NZX2VGM3BxcTlBSkM4N3l0eXdJTnhuWHNfbm5SRE42b3BIbkhhREVJQmU0TWJ3Q2oyVDl3eWxBd2k1RkZValB0dnRWWHFjTE13NlBwWEhUQWFSY2xxVzJRLWRsZUlyLUoxWnpzcWpMX0JXNlBSMS1qQldGVlhmTjR5OXpYVU9IZEF0ZNIBoAFBVV95cUxPQ3VMRzJqNWtSeWVfWng1UDR3QXdLUkZyb1I0VFVwUzlvTnVOYWczMDBHMWtGRnNNQUxQNnM3cm5iZnVTa2t0eVBfQTZVc0NwUTZDQS1nR09VYWRCc042bFdfeVBuNVFPQ3FhM3pjeEJhRHo4NnY4ejlpa3IxV2dZZU1YV0ZmQUs0aGtKejM4UHZqWlFVZGt5X2YzcWxXdDBl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Will Hit All-Time Highs Amid ETH ETF Approval: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) exchange-traded funds will get approval from the Securities and Exchange Commission this week, Standard Chartered believes—and the prices of both ETH and Bitcoin (BTC) will rocket upwards as a result.\n\nThe British multinational bank’s digital assets researcher Geoff Kendrick wrote Tuesday that if the SEC approves ETH exchange-traded funds (ETFs) on Thursday, as expected, the price of the asset could rocket—and hit $8,000 by the end of the year.\n\nETH is currently trading at $3,770, according to CoinGecko, having shot up 22% in 24 hours after rumors swirled yesterday that a spot Ethereum ETF could hit the U.S. market sooner rather than later.\n\nBut the price of ETH isn’t the only thing that could benefit: Kendrick added that Bitcoin could face big upwards pressure, too. “The ETH news, if correct, comes at an opportune moment for BTC,” he said.\n\nAD\n\nAD\n\n“An ETH ETF approval will further legitimize the sector and therefore be BTC-positive as well,” he continued, adding that he “would expect a fresh all-time high in BTC by the weekend.”\n\nBTC’s price now stands at $70,314 per coin. It touched an all-time high of $73,737 in March, but had remained well below the $70,000 mark for much of the last month.\n\nEthereum is the network behind the second biggest digital asset, ETH. Many prominent asset managers have filed paperwork with the SEC to release a spot ETH ETF in the United States.\n\nSuch a fund would give everyday investors the ability to buy shares that trade on a stock exchange and track the price of ETH via brokerage accounts. VanEck, BlackRock, and Franklin Templeton are among the firms hoping to gain approval.\n\nAD\n\nAD\n\nThe SEC reluctantly said yes to 11 BTC ETFs in January, and they've since received record inflows—pushing the price of BTC up as a result.\n\nBut the regulator has been quiet on the process of approving the ETH ETFs, leading industry analysts in recent weeks to expect a delay on the process. That changed Monday, when analysts from Bloomberg said that they now expect imminent approval—a statement now echoed by Standard Chartered.\n\nStandard Chartered predicted in April that BTC would hit $150,000 per coin this year, and that ETH could hit $8,000 this year and then $14,000 per coin by the end of 2025.\n\nThe bank reiterated that claim in today’s report.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE05b2xabWFlcnBwUzVSbFl5SzdtLXI2ZkhtQVBUTjREOHpwTnRqbURGNXZVc0hYWVg1NjJ6Qkt5NGRVWWR0blJ2MEhWSFJ2OFE0ZlI3NTJqeUd0ekRnOXpSNWMxcTJWUTdTcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "“It’s happening”: Ethereum ETF approval is imminent as issuers amend 19b-4 filings - Crypto Briefing",
        "content": "Bloomberg ETF analyst James Seyffart confirms the amendments.\n\nShare this article\n\nBloomberg analyst James Seyffart shared on X that the movement to approve spot Ethereum exchange-traded funds (ETF) in the US “is happening.” According to Seyffart, at least five of the potential Ethereum ETF issuers have submitted their Amended 19b-4s in a 25-minute timespan.\n\nUPDATE: It's happening. We have at least 5 of the potential #Ethereum ETF issuers that have submitted their Amended 19b-4's in the last ~25 min.\n\nFidelity, VanEck, Invesco/Galaxy, Ark/21Shares, & Franklin all submitted via CBOE. pic.twitter.com/pHGt8iRWi8 — James Seyffart (@JSeyff) May 21, 2024\n\n“Fidelity, VanEck, Invesco/Galaxy, Ark/21Shares, & Franklin all submitted via CBOE,” he added. The 19b-4 Form is one of the mandatory documents that need to be filed before the SEC can approve an ETF.\n\nHowever, even with the spot Ethereum ETFs approved in the US, Seyffart highlights that this doesn’t mean an immediate launch. Notably, it can take up to months after the approval of Ethereum ETFs before they can be officially traded.\n\n“But these filings prove that all of the rumors and speculation and chatter have been accurate. Need to actually see SEC approval orders on all the 19b-4s AND THEN we need to see S-1 approvals. Could be weeks or more before ETFs launch,” added the Bloomberg analyst in another post.\n\nMost likely a political decision\n\nCommenting on a The Block article about the motivations behind the sudden pivot to a spot Ethereum ETF approval, Seyffart agreed with undisclosed sources that stated this is “a completely unprecedented situation, which means it’s entirely political,” and that “they’re not even internally coordinated yet, which is why this is most likely a political decision.”\n\nJames’ fellow Bloomberg ETF analyst Eric Balchunas already suggested this in a Monday X post, saying that rumors around the SEC shift in stance pointed to “political issues.”\n\nSeyffart concludes his series of posts on X by admitting that he was wrong about a spot Ethereum ETF approval not happening this week, but so was the entire market.\n\nNotably, as reported by Crypto Briefing, not even notorious fund managers were expecting a spot Ethereum ETF approval in the US this week. Katherine Dowling, general counsel for ETF applicant Bitwise, said that “most people are universally expecting a disapproval order.” VanEck CEO Jan van Eck also predicted a likely denial during a CNBC interview."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQazVmWmUxeEtzSEJEWjFzbmQyLVZUUWJMTTNCeXZSQkxFd3VibTlwMWwxeFpFdUJXbVlOeVJmaGtOQVMxanIxaVEtSjFuM0dib3ozbWljaFNFZEFBdzhmLWF0dzVFbU9rZWhTdEhkQTlxWC1BQXViQW1RLTdHalJ3QV9rREFab1BwZk5UbHd1cXlzajA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "$114.47 Million Liquidated in Ethereum Amid 17% Pump - Crypto Times",
        "content": "Investors are abuzz with excitement as Ethereum, experiencing a 17% surge within 24 hours, reaches $3,645, igniting a frenzy in the cryptocurrency market.\n\nThe asset leads in liquidations, totaling $114.47 million, with $29.98 million in Longs and a significant $84.50 million in Shorts. This dramatic rise highlights Ethereum’s volatility and market dominance.\n\nImage Source: Coinglass (Liquidation Map)\n\nOn Monday, Ethereum (ETH) surged to an intraday peak of $3,691 per coin, driven by swirling rumors on social media and forums about the potential SEC approval of several spot ETH ETFs. According to various reports, sources revealed that exchanges were allegedly instructed by the SEC to expedite their 19b-4 filings.\n\nBloomberg analysts Eric Balchunas and James Seyffart significantly raised their approval predictions from 25% to 75%, adding to the market excitement. As a result, ETH saw a substantial increase, rising from $3,140 at 3 p.m. Eastern Time (EDT) on May 20 to a high of $3,691 per coin by 6:30 p.m. EDT.\n\nEthereum (ETH) has seen a significant increase, rising 17.96% against the U.S. dollar and adding $551 to its value in just a few hours. This surge has pushed Ether’s dominance in the cryptocurrency market to 17%, giving it a total market valuation of $438 billion, and the 24-hour trading volume surged a staggering 254%, valued at $37 Billion.\n\nThe total crypto market liquidations reached $340.35 million, with $77.26 million Longs liquidated and $263.34 million in Short. Over the last day, 78,944 traders faced liquidation, totaling $340.61 million. The largest individual liquidation occurred on Huobi, with an ETH-USDT value of $3.11 million.\n\nThe upcoming decision on the Ethereum ETF has stirred up a lot of interest in the weekly and monthly ETH options expiries. On Deribit, the top derivatives exchange, the open interest for Ether options is substantial: $867 million on May 24 and an impressive $3.22 billion on May 31.\n\nThe call-to-put ratio on Deribit heavily favors call options, suggesting that traders are more inclined towards buying options than selling them."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPQk9WZjJuejZFZnljbENyNnowQVlkcVlIQUFONFNFeGNRVS11aVctRXdob2JzN3BRZVRCaXg1ZFRYYVoweHlSV1NPYWVWZTRXSDFFLTcyRno5ZUxaLVlycG5vRFoxNFFjWHBLZkpLdGlVRXpZYjZBYkdPYk5YN3NudVRORmZNbDRlYnhic1pEa3paVFdfV2VtVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "BTC surges 6% to touch $70k as Ethereum ETF rumors cause market frenzy - CryptoSlate",
        "content": "Bitcoin (BTC) surged past the $70,000 mark on May 21, marking a significant milestone driven by a flood of investment into spot Bitcoin exchange-traded funds (ETFs) and a broader market rally.\n\nBitcoin’s price climbed to $70,325, a 6% increase over 24 hours, before settling at $68,700 as of press time, based on CryptoSlate data.\n\nEthereum (ETH) arguably led the rally over the past couple of hours — experiencing a staggering 14.5% rise within an hour on Monday amid speculation that the US SEC might approve spot Ethereum ETFs.\n\nETH climbed from $3,143 to $3,518 as of press time.\n\nRenewed interest\n\nThe renewed interest in Bitcoin ETFs follows weeks of outflows, with nearly $1 billion flowing into these funds, providing investors with exposure to the leading digital asset.\n\nThe surge has led to significant liquidations in the market, with over $235 million in positions closed in the past 24 hours, including $63 million in Bitcoin short positions alone, according to CoinGlass.\n\nAnalysts indicate that most on-chain metrics suggest the beginning of a bull market despite some showing signs of potential peaking. The recent bounce near $60,000 has sparked renewed interest, with Farside Investors reporting approximately $950 million in inflows last week, a level not seen since March.\n\nBitcoin’s 51% year-to-date gain reflects investors’ anticipation of US monetary expansion, evidenced by the M2 monetary base surpassing $21 trillion in April 2024. This increase in circulating money suggests rising inflationary pressures despite a period of company and individual spending hesitancy.\n\nMeanwhile, the Federal Reserve’s efforts to manage inflation and avoid a recession could affect liquidity and the attractiveness of assets like Bitcoin.\n\nScarcity\n\nBitcoin reached a new all-time high of $73,737 in March and is now just 5% below that level. The recent run appears to be largely driven by the new Bitcoin ETFs, which trade on traditional stock exchanges and allow investors to buy shares that track the price of the asset.\n\nSupporting the bullish sentiment, Bitcoin reserves on major exchanges have dropped to a seven-year low. Data from CryptoQuant shows only 1,918,417 BTC available on major trading platforms as of May 19, a significant decrease from the previous year.\n\nThis scarcity, coupled with the recent halving event that reduced the potential new supply from miners, makes a bearish outlook on Bitcoin increasingly difficult to justify.\n\nThe crypto community continues to watch closely as Bitcoin’s price action unfolds, with many wondering whether the digital asset will continue its ascent or face a significant correction in the coming weeks.\n\nBitcoin Market Data At the time of press 11:11 pm UTC on May. 20, 2024, Bitcoin is ranked #1 by market cap and the price is up 4.93% over the past 24 hours. Bitcoin has a market capitalization of $1.37 trillion with a 24-hour trading volume of $38.97 billion. Learn more about Bitcoin › Bitcoin $69,608.54 4.93% Crypto Market Summary At the time of press 11:11 pm UTC on May. 20, 2024, the total crypto market is valued at at $2.57 trillion with a 24-hour volume of $102.43 billion. Bitcoin dominance is currently at 53.41%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQZ3F4V3ZsR05EOXNtYVNwZXlXWVgxai1XaFVUbnNvX29KQW5PeWlnMERkaldGckhKcmNuZVZNV2lpV014LXd6UkdSby1EZklsd0tXYWlPbXYyOU1SUFowUGgwQ24wMkRMWTNtRFR2V2JLQ1R0NnJhZzU5bHhXUXNyZGI0djBkR0FVcmdtWTZBSHFpQ0dhbF9fLXdZQjlVZlhpYjdnaGY0cEFsY1E0bWdqYjYtZlpUTmha?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF approval possible tomorrow keeping BlackRock 10 year approval streak alive - CryptoSlate",
        "content": "The SEC could approve a spot Ethereum ETF as early as this week, marking a significant shift in regulatory stance. Bloomberg analysts Eric Balchunas and James Seyffart have increased their odds of approval to 75%, up from 25%, citing recent chatter and the SEC’s request for revised 19b-4 filings by 10 am Tuesday. This rapid development has led to a scramble among applicants, including major players like BlackRock, Grayscale, and Fidelity.\n\nBlackRock, the world’s largest asset manager, has a strong track record with the SEC, having only one ETF application denied in 2014. That ETF, the BlackRock Total Return ETF, was initially rejected due to concerns over transparency and alignment with its net asset value (NAV). However, an updated version of this ETF, addressing the SEC’s concerns, went live in December 2023, just a month before the approval of Bitcoin ETFs. This history emphasizes BlackRock’s ability to navigate regulatory challenges successfully.\n\nThe SEC’s decision on Ethereum ETFs has been eagerly anticipated, with deadlines for various applications approaching. Data from Bloomberg Terminal shared by James Seyffart lists the ETFs awaiting approval, including those from VanEck, ARK 21Shares, Hashdex, Grayscale, Invesco Galaxy, Fidelity, Franklin, and Bitwise. These applications have faced multiple delays, but the recent push for revised filings suggests a potential breakthrough.\n\nGrayscale and BlackRock have been proactive in updating their applications. Grayscale filed an S-3 registration statement to convert its existing Ethereum Trust to a spot ETF and an S-1 for a mini Ethereum ETF. BlackRock’s Nasdaq amendment to its 19b-4 filing proposes cash-based creation and redemptions, aligning with other Ethereum ETF applications and previously approved Bitcoin ETFs.\n\nThe SEC’s cautious approach has been influenced by concerns over market manipulation and the need for comprehensive market data on Ethereum. However, the approval of spot Bitcoin ETFs earlier this year, following a court victory by Grayscale, and the launch of spot Ethereum ETFs in Hong Kong, has raised hopes for similar products for Ethereum. The SEC’s recent interactions with ETF issuers have been described as one-sided, with agency staff withholding substantive comments, leading to speculation about potential rejections.\n\nDespite these challenges, the crypto community remains optimistic, with Ethereum rising 17% in the past 24 hours. The approval of a spot Ethereum ETF would provide a regulated and accessible way for investors to gain exposure to Ethereum, potentially increasing market liquidity and stability. The involvement of prominent asset managers like BlackRock and Fidelity adds credibility to these products, which could attract institutional investors and drive further adoption of cryptocurrencies.\n\nWhile not guaranteed, BlackRock’s storied history of overcoming regulatory hurdles and having products approved suggests the odds are in their favor this week. An Ethereum ETF greenlight would mark a new era for crypto’s mainstream integration.\n\nMentioned in this article"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOcGZtR3V3c2RyTzRPYUd4UHdPVDl1T3dVRHZyNEFMQ1VqMGtJRjhjOTVJNGZMR24yN0dHM1ItNTZFN2IxTnFyNm02cjNMZ2o4WWZRLUxZS01PSXRvRVlab1NlNjhzaS1zVVBsM3NReUczcXVscVV0M01LUUcxcS1POE5UbzViWjI2NGZMXzhkeVQxcGhaZHBBdk9rV3V4bzZJYnprQUQzTFd2VHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Standard Chartered Predicts Ethereum ETF Approval This Week; Sets ETH Price Target - Watcher Guru",
        "content": "Standard Chartered Bank has expressed high confidence in Ethereum ETF approval this week. Geoff Kendrick, Head of FX Research and Digital Assets Research at Standard Chartered, stated that he is “80% to 90%” sure that Ethereum ETFs will receive the green light from the regulatory body.\n\nThe first round of spot ETH ETF deadlines is rapidly approaching, with VanEck’s application set for May 23 and Ark Invest/21Shares’ following on May 24.\n\nAlso read: Cryptocurrency: Top 3 Meme Coins That Can Double Your Investment In 2024\n\nPotential Inflows and Ethereum Price Targets\n\nAccording to Kendrick, the approval of spot Ethereum ETFs could drive substantial inflows into the cryptocurrency. Standard Chartered estimates that these ETFs could attract between 2.39 million and 9.15 million ETH in the first 12 months following approval. This equates to roughly $15 billion to $45 billion in U.S. dollar terms.\n\nKendrick also noted that these projected inflows are similar to Standard Chartered’s estimates for Bitcoin ETFs, which have proven to be accurate thus far.\n\nIn an analysis note sent to The Block on Tuesday, Kendrick further elaborated on Standard Chartered’s price targets for ETH. If spot Ethereum ETFs receive approval this week, the bank expects ether to keep pace with Bitcoin, maintaining the current 5.4% price ratio for the remainder of 2024. Given Standard Chartered’s projection of bitcoin reaching $150,000 by the end of 2024, this would imply an ETH price of $8,000.\n\nAlso read: Ethereum (ETH) Forecasted To Hit $10,000: Here’s When\n\nLooking further ahead, Standard Chartered has reiterated its ETH price target of $14,000 by the end of 2025, based on the bank’s estimated BTC price level of $200,000 by that time.\n\nThe prospect of ETH ETF approval has already had a notable impact on the market, with ETH’s price surging by over 22% in the past 24 hours. At press time, ETH is trading at $3,767."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE45NWpzYjZTR3hHZTJXMFNuOEctaDZqNC1HNXUxd19JX0lDVjRkZF9LSHFNTVJBQVh4MGRYd0p1cHB6MHUwWE52OG5YMjE2MzFqR3ptVjU2aVVtTUktUFZtRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "SEC asks updated spot Ethereum ETF filings from US exchanges: Report - Crypto Briefing",
        "content": "Ether sees significant gains as SEC reviews ETF applications.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC) reportedly asked exchanges that would list spot Ethereum (ETH) exchange-traded funds (ETF) in the US to update their filings, said Joseph Edwards, head of research at Enigma Securities, to Reuters.\n\n“Opposing the ETH ETF after the BTC one was approved always seemed like an odd case for the SEC to try to push, unless they were willing to open up questions on Ethereum’s securities status more broadly, and it’s likely that the call has come in somewhere to not take that fight,” added Edwards.\n\nTo Reuters, an SEC spokesperson said they did not comment on individual filings.\n\nOn May 20, Bloomberg ETF analysts Eric Balchunas and James Seyffart raised the odds of a spot Ethereum ETF approval from 25% to 75%, mentioning that the US regulator is motivated by “political issues.”\n\nThis development was enough to raise ETH’s price by 22.5% in the last 24 hours and also propelled the crypto market as a whole.\n\nThe SEC has two decisions on spot Ethereum ETFs this week related to filings from VanEck and ARK Investment Management. As it happened with spot Bitcoin ETFs in the US, analysts expect a blanket approval, which means that if the regulator gives the green light, all spot Ethereum ETFs will have permission to be traded in the country.\n\nClose to an all-time high\n\nBitcoin raised 96% within two months before its first spot ETF approval in the US and registered different all-time highs in the two following months after the SEC permitted this investment product trading.\n\nAt the time of writing, Ethereum is 23% away from its all-time high of $4,878.26, according to data aggregator DefiLlama. If a similar move ensues, ETH might hit a new price peak at the beginning of Q3.\n\nHowever, due to the market expectations around the Ethereum ETF, a refusal from the SEC might have a significantly negative impact on the crypto market."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQV1BqdjJUaDRaSnhyT1lJMF9nVERCcFpMeVR4MUF0Tk1fUDkzUFhXNnNNVFZ0V0lmcklMSVJOY1BEaDZnS04wQVJCMW9VdDB5TGZjcGdsaXBpS215MTFndml4NWNLREpZOGx2TmNxaE9Ic3JWZE5zdGkwRWUyX1BlTldFTUxJNnM4bnI1Vy14eUFmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval likelihood increases with SEC’s positive signals - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) appears to be leaning towards approving spot Ether exchange-traded funds (ETFs), prompting a surge in Ether’s value.\n\nEther traded as high as US$3,710 in the past 24 hours, according to CoinGecko.\n\nBloomberg analysts Eric Balchunas and James Seyffart have revised their approval probability from 25% to 75%, citing a rise in discussions about expedited 19b-4 filings, a critical step for ETF launches.\n\nThis potential regulatory shift has not only elevated Ether’s price but also spurred a wider market rally, with Bitcoin trading above US$70,000 for the first time since April.\n\nThe price jump and market optimism coincide with the SEC’s upcoming deadline to rule on VanEck’s spot Ether ETF application by May 23.\n\nWhile the market reacts positively, Seyffart warns that the necessary S-1 registration statements could still face delays.\n\nThe SEC’s evolving stance is influenced by expectations of a potential shift in crypto policies, including a recent cryptocurrency-supportive legislation."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQVC1oM1MwMTEyWjNlSXUzb281LU02R003M2tWR1AzT3c4emRDMTRNdjRkRUVoZUpvN3VLeWl6Ynk5U0x6a3VhZWI1WThfUDl5OGZjTGh3WFZCcEFFY1JWUnBtV2FMTjZJN25aVjlSVG1CYjNCaXdwWjMwbzdQYkxDQmJpNjZfMlIwUS1hSzVYX1l2TFRoQm1Zb2hicTFpOUhDQ1FUcmVHUWFhXzVMOFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "The Approval of Spot Ethereum ETFs Is Not Going as Planned - FX Empire",
        "content": "Understanding Spot Ethereum ETFs\n\nBefore discussing the features of spot Ethereum ETFs, it is essential to emphasise that they have yet to be approved for trading in the U.S.—but futures Ethereum ETFs have been available for quite some time. Therefore, it is essential to understand the difference.\n\nIn a spot market, assets such as commodities, currencies, and securities are exchanged for immediate delivery. The same is true for the much-anticipated spot Ethereum ETFs, as they offer a more straightforward and transparent approach than futures ETFs, which buy derivatives without directly owning the asset. By purchasing cryptocurrency directly, the fund tracks the price of the benchmark cryptocurrency more accurately. Due to the more straightforward purchase process, such an investment offers greater profitability and lower management costs. This is the reason for the public excitement around the approval of the spot Ethereum ETF, scheduled for 23 May 2024.\n\nSo What About the Approvals?\n\nThe U.S. Securities and Exchange Commission (SEC) remains concerned that cryptocurrencies are often involved in fraud, which may cause speculative bubbles and cause investors to start considering this currency type safer after approval. Spot Bitcoin ETFs were only approved after the U.S. Court of Appeals ruled against it in August 2023, which essentially forced it to take action.\n\n‘As a basis, we have that the U.S. SEC is still conservative in its views,’ said Kar Yong Ang, the Octa broker’s financial market analyst.\n\nAt the time of writing, the editing process for the filing cases is transparent. The 10 May 2024 updated filing for the spot Ethereum ETFs shows that Ark Invest and 21Shares have opted out of staking, meaning the funds are adjusting to the regulator’s requirements. Roughly the same thing is happening with other applications. In late April, the commission postponed its review of Franklin Templeton’s application with a deadline of 11 June. In May, the SEC postponed a decision on Invesco and Galaxy’s application. Before that, the agency extended the review period for a similar application from BlackRock. May 2024 is the deadline for proposals from VanEck and Grayscale.\n\n‘After the decision on VanEck’s application, investors will be able to understand what will happen to the other investment companies that have applied,’ commented Kar Yong Ang, the Octa broker’s financial market analyst.\n\nBreadcrumb Trails Lead to Launching Funds\n\nDespite scepticism on the legal side of the issue, two factors indirectly report increased investor interest in the second most crucial cryptocurrency.\n\nGrayscale Investments has withdrawn its application to create an Ethereum-based futures ETF. According to the speech of its CEO Michael Sonnenshein, Grayscale Investments will focus on converting its Ethereum trust—the world’s largest—to spot exchange-traded products.\n\nTraders are getting rid of Hong Kong Bitcoin ETFs and Ethereum ETFs. So, on 13 May 2024, a record was set for capital outflows from the funds: derivatives lost $39.3 million in one day, BTC-backed assets lost $32.7 million, and ETF-backed assets lost $6.6 million.\n\n‘It’s clear that the outflows are not only due to the correction in the Bitcoin price during this period’ said Kar Yong Ang, the Octa broker’s financial market analyst. ‘Such ETF flows suggest investors are looking at more interesting and profitable funds,’ he added.\n\nThe future of spot Ethereum ETFs looks promising due to the recent success of spot Bitcoin ETFs. However, it still depends on the regulator’s decision and the actions of investment fund representatives. The decision to approve spot Ethereum ETFs may likely be postponed, which does not cancel its approval. In our opinion, there is potential for growth in these two cryptocurrencies in the combination of such factors and in the conditions of local correction in Bitcoin and Ethereum quotes.\n\nAbout Octa\n\nOcta is an international broker that has been providing online trading services worldwide since 2011. It offers commission-free access to financial markets and various services already utilised by clients from 180 countries with more than 42 million trading accounts. Free educational webinars, articles, and analytical tools they provide help clients reach their investment goals.\n\nThe company is involved in a comprehensive network of charitable and humanitarian initiatives, including the improvement of educational infrastructure and short-notice relief projects supporting local communities.\n\nOcta has also won over 70 awards since its foundation, including the ‘Best Educational Broker 2023’ award from Global Forex Awards and the ‘Best Global Broker Asia 2022’ award from International Business Magazine."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5kUWQxQjRuZzB4X1d3ekltQjNmcHYtNlVsa1lMYmdwaXc5RWxLT2FCYkExd2JZRmg1T0xkR2YzaldpRXBxR1lfODRQV0ZSbWlrSHdPWTQ5LUZOcF95b2NLWkg1S05UdFoxaVdoTlJn0gF2QVVfeXFMTUY0TU1FLWNlbXlsaFBzNURHdzVIMWtZdEFxNE52R0g4QS1kRExUX19HLVU2YUNZZkcxVXRhMlJQNE0zQ0RWb3BLS2FTV2o0dVU5RThEdVBCaTI2ZVJLeVlxbkZsMFAySnM2TWI3WFI4T1RFSWVqdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Spikes 9% Within Minutes on ETF Approval Rumors - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of Ethereum spiked by 9% in a matter of minutes Monday afternoon amid speculation from analysts that the United States Securities and Exchange Commission will indeed approve spot Ethereum exchange traded funds (ETFs).\n\nEthereum jumped from a price of $3,143 to $3,428 in a span of approximately 20 minutes, per data from CoinGecko. Its 24-hour jump sits at 11% as of this writing, based on the current price of $3,410.\n\nBloomberg analysts Eric Balchunas and James Seyffart now say they're 75% sure that the SEC will approve applications starting this week, following a previously bearish streak that saw them estimate the chances at 25%.\n\n\"Hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone [is] scrambling (like us, everyone else assumed they'd be denied),\" Balchunas tweeted.\n\nAD\n\nAD\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nPrior to Monday, analysts had pinned their pessimistic outlooks on a lack of meaningful engagement between the SEC and nine asset managers that had filed applications for spot Ethereum ETFs, including BlackRock, Fidelity, and Ark Invest/21 Shares.\n\nThe Wall Street Journal reported that the SEC asked the asset managers on Monday to submit amended 19b-4 forms in the days ahead, fueling speculation that the agency indeed plans on taking action towards potential approval of spot Ethereum ETFs.\n\nFiling with the regulator last year, VanEck expects a decision on its application by Thursday. The next day, the agency will be due to respond to an application from Ark Invest/21 Shares, which removed language regarding the staking of the ETF’s funds earlier this month.\n\nAD\n\nAD\n\nEven though the SEC could approve so-called exchange rule changes that give an exchange, such as the Nasdaq, permission to list a spot Ethereum ETFs, each asset manager would need its registration statement approved for the ETFs to launch, said investment advisor and ETF Store President Nate Geraci on Twitter.\n\nThe process through which Ethereum tokens are delegated to the network in exchange for rewards has come under fire in lawsuits brought by the SEC. The agency has alleged that some companies, such as Coinbase, are in violation of securities laws by offering staking services to customers because they allegedly resemble securities as so-called investment contracts.\n\nThat said, Coinbase denies that its staking services are a securities offering. Still, the Ethereum software giant Consensys claimed that staking is core to the SEC’s internal view that Ethereum is a security, as alleged in a lawsuit filed by the company against the SEC last month. (Disclosure: Consensys is one of 22 investors in Decrypt).\n\nAs Ethereum surged Monday, momentum shifted instantly on the blockchain-based betting site Polymarket. Skyrocketing from a 13% chance the day before, traders penciled in a more than 50% chance that spot Ethereum ETFs would be approved by month’s end, as of this writing.\n\nHowever, the figure was below a 76% chance traders foresaw in January amid the launch of spot Bitcoin ETFs. But optimism towards the potential approval of spot Ethereum ETFs was reflected in existing products that already offer exposure to Ethereum’s spot price.\n\nShares in Grayscale’s Ethereum Trust (ETHE), for example, traded at a 20.5% discount relative to the funds’ crypto holdings, according to data from YCharts. Tightening over the past month-plus, the discount had widened as far as 26% in April after narrowing to 8% in March.\n\nETHE’s discount stems from the product’s structure as a closed-end fund, where shares can’t be redeemed by financial-market participants to keep its price in line with Ethereum’s. A similar discount that plagued Grayscale’s Bitcoin Trust evaporated after the product was uplisted into a full-fledged ETF in January.\n\nThe SEC has recently faced bipartisan pressure over a crypto-custody rule that lawmakers voted to erase last week. Sitting on President Biden’s desk, the measure received support from high-ranking democrats, such as Senate Majority Leader Chuck Schumer (D-NY).\n\nAD\n\nAD\n\nCompared to anti-crypto politicians like Elizabeth Warren (D-MA), the move to correct the SEC’s policy represented a break. It followed an event hosted by former President Donald Trump, where he slammed the SEC’s toughness on crypto and vowed to support the industry in front of holders of his NFT collection at Mar-a-Largo.\n\nEditor's note: This story was updated with additional details after publication.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPei1ob0NIc1h2SW56MUhmQ2w2bkpOUUNfcUctaFpRQjAwTi1telZWdjBXOXREa1RxOTBRaFkxNnIySWY1aHJoZ2VCR00yZFFDcVNrdUdheTlfR0hXWWFFTTlBLWpwZVZPM1FHZlRkVmNKcXdxWlNESVNZRmNWYnM0SGJrNnhJdkJEWUxneGtCR01UdHFlR3psTmI0U3BXUFdOaXU2alU2WFY4NTJUTHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF: Bloomberg says 75% Chance of SEC Approval This Week - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQX1U0ci1RT0o2ZFVDbmdYcWROZHo2T1M4YWhqLVBOYlZIVTM3U2d4bTc5S3FBd3A4bE9nY2NRSDJISDFJbjVpeE0tV3NhaXUwQV9iQmVJNWU0T3hPdzl3RDd0NWZ1RHRCSkVuXzVFZWwtTjU4MFZYTUM3enRQR0JUYVFMWndVMGxpRW9oYmtvdVlNbTdqS0dEV2Y2OUJXQmY4bW9OVnR4U3ZiMjlKUnhPStIBtgFBVV95cUxPMWxnNGdVLWZlRXp2R3hmSFYySGExZWFfblVsbXJ1ZXRFaVNTeE12b3l2cmVMR2tiWXBnb2pTQ3B3SnlqZWxHb2hHUFlnYUdFWWZ1Z0FjTEZPVC1LMVl1eXh0TmVYUjdjaFZWZE45R19YY25OdThwaDdaSVlHQllVcXFKMlFlcFV2Nm1odUJKTUFTdGkyYjlsa3dTdEdLUW1lN0FsN3dSc3kxampPZ0lId0dvSF9Udw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "How Ethereum Danksharding Will Impact Decentralized Finance - Finance Magnates",
        "content": "The Ethereum network has encountered significant challenges regarding scalability. The current mainnet can only handle 20 to 30 transactions per second (TPS), significantly lower than traditional payment systems. The high transaction fees on Ethereum have deterred users and restricted network accessibility. Initially, during the early stages of Ethereum 2.0, the leading scaling solution proposed was sharding, splitting the Ethereum network into “shards\" for parallel transaction processing.\n\nHowever, due to concerns about complexity and security risks related to cross-shard communication, sharding became less favored over time. Before danksharding, other solutions, such as sharding and layer-2 scaling methods, such as rollups, were suggested to address Ethereum's scalability problems. These alternatives also had limitations in scalability and complexity, leading to the development of danksharding as a solution for scaling the Ethereum network.\n\nWhat is Danksharding?\n\nDanksharding is a highly technical solution that works with Ethereum’s layer-2 scaling solutions, such as roll-ups, to improve scalability and efficiency on the Ethereum network. Ethereum’s danksharding solutions aim to improve the efficiency of the Ethereum blockchain by handling more transactions. This approach, part of the Ethereum 2.0 upgrade, is crafted to outperform traditional sharding methods. In essence, danksharding segments the blockchain into fragments known as shards to process transactions and data simultaneously, enabling improved data processing without causing network congestion or increased fees.\n\nUsing larger data segments, danksharding boosts transaction capacity, enhancing the blockchain's performance. Danksharding aims to reduce transaction expenses and improve throughput by expanding block space and refining data availability. The Dencun upgrade was officially rolled out on the Ethereum mainnet on March 13, 2024. Expert analysts believe that the Dencun upgrade, which includes proto-danksharding, could be a “bullish catalyst” for the Ethereum price prediction in the second half of 2024, with Bed Baddow projecting the highest value the coin could reach by the end of the year is over $6400. This upgrade will impact Ethereum's price, potentially positively driving prices upwards towards this value.\n\nWhat Is the Difference Between Danksharding and Traditional Sharding Methods?\n\nThe main difference between danksharding and traditional sharding methods for Ethereum is the approach to scaling. Traditional sharding aimed to increase Ethereum's transaction processing capacity by dividing the network into multiple “shard chains.” This created a security issue for Ethereum since the multiple shards would share security at a consensus level. For instance, if the network was divided into ten shards, each shard became vulnerable to malicious attacks due to validators being spread out.\n\nTo address the security concerns with traditional sharding and the shift in Ethereum's scaling roadmap towards lay-2 solutions, danksharding was developed as a more secure and efficient scaling solution. This streamlined process is designed to simplify transactions within the network’s shards, providing a more efficient path for Ethereum’s scalability.\n\nHow Will Danksharding Impact the Decentralization of Ethereum?\n\nThe impact of danksharding on the decentralization of Ethereum is a mixed bag, with potential benefits and drawbacks:\n\nPotential Benefits of Decentralization\n\n● Reduced hardware requirements for nodes: Ethereum nodes will only need to store and process data for their assigned shard rather than the entire blockchain history. This reduction in hardware and storage requirements could make it much easier for more nodes to participate in the network, potentially increasing decentralization.\n\n● Improved scalability and efficiency: Dankshanding is expected to improve Ethereum’s scalability and transaction processing efficiency significantly. This could potentially make the network more accessible and attractive to a broader range of users and developers, which could expand decentralization.\n\nPotential Drawbacks\n\n● Vulnerability of smaller rollups: Unlike traditional sharding, danksharding moves the validation of transactions off-chain, with the Ethereum mainnet acting as a data availability layer. However, this shift away from on-chain validation has raised concerns about the network’s overall decentralization, mainly because the validation has become more centralized.\n\n● Shift from on-chain to off-chain validation: Danksharding’s reliance on rollups might expose less popular rollups to security risks due to their limited number of validators. This could consolidate power and influence within well-established rollups, ultimately threatening decentralization.\n\n● Increased validator concentration: Danksharding could lead to block builders and an increase in validators receiving a larger share of Maximal Extractable Value (MEV) profits. This concentration of power among smaller groups of validators can affect the overall decentralization of the network.\n\nIncreased Transaction Processing Capacity\n\nDanksharding is designed to allow Ethereum to process transactions much faster than it currently does. Ethereum transactions using danksharding have the potential to process over 100,000 TPS. This will dramatically improve Ethereum’s scalability, making it more compatible with traditional payment systems.\n\nAdditionally, this allows DeFi applications to handle a much larger volume of transactions, potentially reducing congestion and delays. The increased transaction processing capacity could help reinforce Ethereum’s competitiveness and decentralization in the future.\n\nCompatibility with Layer-2 Solutions\n\nDanksharding is specifically designed to work with Ethereum’s layer-2 scaling solutions. This integration is expected to improve the efficiency and cost-effectiveness of layer-2 networks, making them more competitive with alternative layer-1 blockchains. One of the biggest benefits of danksharding is its ability to reduce transaction fees up to ten times for layer-2 solutions.\n\nChallenges of Danksharding\n\nFull danksharding will take years to implement. The transition from the initial sharding proposal to the danksharding approach required a massive shift in Ethereum’s scaling roadmap, adding to the complexity of implementation.\n\nThe biggest concern and challenge of danksharding is that it compromises Ethereum’s security in the long run. Many see the shift from on-chain validation as a security risk, making the network vulnerable to potential attacks. Ethereum’s use of smaller rollups that handle blob-carrying transactions is seen as vulnerable due to Ethereum’s mainnet’s weaker protection mechanism. Ensuring the security and integrity of the network as it scales will be critical, and Ethereum would need to address this.\n\nFurthermore, the decentralization risks associated with danksharding are from its reliance on layer-2 rollup solutions, which may result in larger and more established rollup providers gaining more influence and power. Maintaining the overall decentralization of the Ethereum network is a vital consideration as the network scales and evolves.\n\nFinal Thoughts\n\nDanksharding is a positive step in the right direction for decentralized finance on the Ethereum network. It can significantly improve scalability, efficiency, and user experience on DeFi applications. This could lead to increased adoption and growth of DeFi platforms, as the reduced costs and increased efficiency make them more attractive to institutions like crypto exchanges, wallets, blockchain gambling and gaming, and metaverse platforms."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPbjR3UGJlZE1JckNUOW00VnllcHJveFMzejBheGtWSkk3REZTV0Y3bnF1cGZvcG5yZG1IaEREbmdOcmVFc1g3cVZfNjFUSWxiVE5HSFJvdDdkeHp3c1FHbWxaSFpwSFVHbl9pWnRFaFdzdGRBZUhHdHRLN3oxWk1rYWM5MFloNk1iZUc4TEFQMHY2d9IBmgFBVV95cUxPVmRjbldtS2dwNGxtRTFuRHBhelFxV3RYODVBNTBWSHFBU3ZteUhzbkJ5dEg3SVprZlpjdHpSQ3lvdW9DejdBMi0yOElCcHFVRjdIbzZDeEowZzdzZGN2QU03cmVtWnA2V3Z5eFEzVnVSSVdrNVZEMzVfYzhDRUxFbmFPRElSVEY1YnZMenJaYW5lWHZURC01MndR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Applicants Ditch Staking Language in 'Temporary Concession' to SEC: Analyst - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the Securities and Exchange Commission (SEC) mulls applications for spot Ethereum ETFs—with analysts expecting approval as soon as this week—amended filings from several asset managers have dropped their language around staking.\n\nStaking refers to the process through which users delegate Ethereum tokens to the network in exchange for rewards. It became a core component of Ethereum’s security model with the network’s long-planned shift to a proof-of-stake consensus model in 2022.\n\nFidelity dropped language regarding the staking of customer funds in its proposed ETF, submitting an amended filing on Tuesday. The measure mirrored a similar move made by Ark Invest/21 Shares, which erased staking mentions earlier this month from its application, which the SEC is due to decide on this week.\n\n“Spot Ethereum ETF filers bent the knee by removing staking language to appease a recently humbled SEC,” 3iQ Head Of Research Mark Connors told Decrypt. “We see the removal of staking language as a temporary concession.”\n\nAD\n\nAD\n\nIf spot Ethereum ETFs get a regulatory green light, then that could mean a significant portion of Ethereum’s supply rests idled in any approved funds. As of this writing, about 27% of Ethereum’s supply—or 32 million ETH—is staked, according to a Dune dashboard.\n\nThough the SEC appears open to approving spot Ethereum ETFs, as the regulator engages meaningfully with asset managers, staking has emerged as a contentious aspect of Ethereum over the past two years. In lawsuits, the regulator has alleged that Ethereum staking services constitute securities offerings on behalf of several firms.\n\nSEC Chair Gary Gensler spoke specifically about staking services in an agency video a year ago, arguing that investors deserve certain disclosures on how crypto is handled by companies when staked, such as if funds are commingled.\n\nIn other regions, such as Canada, funds that hold staked Ethereum have shown that it can be done. Two of 3iQ’s exchange-traded products, for example, began offering customers the benefits of Ethereum staking in 2023.\n\nAD\n\nAD\n\nConnors said the change in the SEC’s posture must be due to political pressure the agency faces over SAB 121, a crypto-custody rule that lawmakers voted last week to erase.\n\n“The SEC’s regulation by enforcement method is clearly under assault,” he said.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOWmxETUVQN0hUQmp1MlVFS2Vuei15TngtTzFrOVlzNXpRWVlNUTRtSnFIYUcxSjdTeTB3amxvbkNKdmxaeThjTGgzU3FLTDlvTDFzc0hMWmNzNjM2cDU5QlFmZlduQXV1aEJORlB1Tkwtc0RiNjlxSmxIMjljNm1oempCRlBGak5YZjJhQ2RYRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Tether mints $1 billion USDT on Ethereum amid ETF anticipation - CryptoSlate",
        "content": "Stablecoin issuer Tether minted $1 billion USDT tokens on the Ethereum blockchain, capitalizing on a market upswing driven by hopes that the US Securities and Exchange Commission (SEC) might approve a spot ETH ETF for trading this week.\n\nWhale Alert first reported the minting, which was later confirmed by Tether CEO Paolo Ardoino, who wrote:\n\n“PSA: 1B USDt inventory replenish on Ethereum Network. Note this is an authorized but not issued transaction, meaning that this amount will be used as inventory for next period issuance requests and chain swaps.”\n\nInventory replenish\n\nMarket analysts suggested that Tether’s new minting is a strategic move ahead of a potential market rally triggered by an ETH ETF approval. Ivan Sherbakov, CEO of Cryptorobotics, said this minting “will be used as liquidity to pump the market ahead of ETF news.”\n\nThis analysis aligns with data showing a correlation between the increasing supply of USDT and a broader upward movement in the crypto market, leading to higher volumes and a more dynamic environment for digital assets.\n\nUsually, Tether’s inventory replenishment involves creating new USDT tokens in anticipation of heightened customer demand. These tokens, held in Tether’s treasury, are classified as “authorized but not issued,” meaning they are not yet in circulation or included in USDT’s current total market cap.\n\nAccording to Tether’s Transparency page, there were $87.8 million worth of such USDT on Ethereum as of May 21. Over the past year, Tether’s market cap has grown significantly, surpassing $110 billion and controlling around 70% of the market, according to CryptoSlate’s data.\n\nThis growth can be attributed to several factors, including the successful launch of spot Bitcoin ETFs in the US. Moreover, Tether has seen varying degrees of success in its other endeavors, which include diversifying its operations beyond its flagship USDT stablecoin product into other sectors like Bitcoin mining.\n\nMentioned in this article"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSXFZTDVsNEliTUpoOGcwVUNReXp6Wm1kS2REX3AyWFVVRG9scUZkUEFaMWp0MzFXbG9qY1JEUzNMekJXdGpEMDM3dmVneWtJbUJqUmVkWHpJeW1qRmhkZGE1enh0dDdZV2h1b05mN0hWbWRpMFZwSWJvRmQ5aUNyOXJ0eHVmZFpJLXNGLWFPN2xXeU5IamdydkhGMHNaYjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum soars as odds of ETF approval jump to 75% — ‘SEC could be doing a 180’ - DLNews",
        "content": "Bloomberg Intelligence ETF analyst Eric Balchunas says the odds of the SEC approving the Ethereum ETFs have greatly improved.\n\nThe SEC's sudden change of attitude is leaving everyone scrambling, Balchunas said.\n\nHe upped his odds of approval to 75%, from 25%.\n\nThe odds that the Securities and Exchange Commission will greenlight Ethereum spot exchange-traded fund applications have just increased.\n\nBloomberg Intelligence ETF analyst Eric Balchunas, long bearish on the products’ odds, posted on X that chances of approval have shot up to 75% from 25%.\n\nBalchunas said he was “hearing chatter this afternoon that the SEC could be doing a 180 on this (increasingly political issue), so now everyone is scrambling (like us everyone else assumed they’d be denied).”\n\n“It’s what we’re hearing from multiple sources,” Bloomberg Intelligence ETF research analyst James Seyffart said. “Should see a bunch of filings over coming days if we’re correct.”\n\nEthereum soared 8% off Balchunas’ tweet, recently trading at $3,400.\n\n“If the spot ETH ETF is approved, it will be a true shock to everyone I know in DC who’s close to this process,” Jake Chervinsky, chief legal officer at Variant fund, posted. “It means approval could signal a major shift in US crypto policy after the SAB 121 vote, perhaps more important than the ETF itself.”\n\nLast Thursday, the Senate voted on a resolution to repeal a controversial accounting guidance from the SEC, called SAB 121, which critics say has deterred investment banks from offering crypto custody at scale.\n\nPresident Joe Biden indicated that he would veto the provision if approved. Prominent Democrats, however, have sided with their Republican colleagues against the rule, raising speculation that the White House may back down.\n\nJoin the community to get our latest stories and updates\n\nDeadline\n\nIf the SEC wants to approve the Ethereum ETF products, it will have to be fast about it. The deadline for VanEck’s Ethereum ETF application is on Thursday — and the SEC is unlikely to approve some of the filings ahead of others in order to avoid playing the role of a kingmaker.\n\nNate Geraci, president of ETF Store, said that even with the tight deadline, it would be possible for the SEC to approve one set of important filings, called 19b-4s, before the deadline, and then “slow play” the second set of filings, called S-1s.\n\nThe SEC must approve both set of filings before the ETFs could come to market.\n\nBalchunas had previously told DL News that in light of the reported lack of engagement from the SEC with prospective issuers, Ethereum ETFs were unlikely to get approved before the end of 2025.\n\nIf the ETFs are rejected, issuers will likely wait until after the US presidential election to file again, because a victory for presumptive Republican nominee Donald Trump would probably mean a change of leadership at the SEC — perhaps in favour of someone less antagonistic toward crypto than current chair Gary Gensler.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSnNCeEtKYi1WeDJIbnhfNWJucDh0ZDltVWQybThnUm9iLWwtUTF0VVFrQS1uaHhpWlhrWEhjcE9HLVRmTnUzU3RYNU1ZbUJmY2Z4RXE2TE1kRWFmNTJkNlBJU3BRZXM1R05sOENKNXhtZWtVQmQ5dkh0ZG5rNHFtUzh2VzVqLTlaZ25WNV8tUFhybF91dGZVOW1EbW9LeFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Funds See $23 Million Outflows Amid ETF Speculation - Crypto Times",
        "content": "Investors poured $932 million into digital asset products this week, but Ethereum (ETH) crypto funds bucked the trend, experiencing outflows exceeding $23 million, according to CoinShares, an asset management firm. Analysts attribute these outflows to growing concerns about the US Securities and Exchange Commission (SEC) approving a spot Ethereum exchange-traded fund (ETF).\n\nInvestors favored Bitcoin, with $942 million flowing in, and minimal short positions, indicating positive sentiment. Altcoins like Solana, Chainlink, and Cardano saw inflows of $4.9 million, $3.7 million, and $1.9 million. However, the weekly trading volume was only $10.5 billion, significantly lower than March’s $40 billion.\n\nImage Source: CoinShares (ETF Flows by Providers, Asset & Country)\n\nIn terms of regions, the US led the way this week with inflows of $1 billion. Grayscale, after experiencing significant outflows totaling $16.6 billion since its ETF launch in January, saw its first inflows of $18 million in a notable shift. Following the US, Switzerland and Germany also saw minor inflows, amounting to $27 million and $4.2 million, respectively.\n\nBlockchain equities have had a tough year, with outflows recorded in 14 of the 20 weeks so far, resulting in a cumulative outflow of $512 million.\n\nThe SEC’s potential disapproval of an Ethereum (ETH) exchange-traded fund (ETF) reflects its cautious approach towards crypto regulation. Concerns about market manipulation, investor protection, and the underlying infrastructure of Ethereum may influence their decision.\n\nAdditionally, the lack of clear regulatory guidelines for cryptocurrencies creates uncertainty, making it challenging for the SEC to greenlight such products. Until comprehensive regulatory frameworks are established, the approval of an ETH ETF remains uncertain, impacting investor sentiment and market dynamics."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNQWpQandtT21ZQjlPcDEtS01MM2N0ZDZ1TExMX1VmWWJibEdVUy1EMXp2TkJ1d2JMYUY1YWt1ekZJaE1DZ0E4TmZMSEtzbU9ydWppOXNEZFVabWR4enNwem5ETjVGbTZEZHdfQ2g4cDIxUVNTcG9fRkdSRWdudU5TMXYxNU5EdzBQQXQ0X0Q3eU14Zl9aRFd2bWFWWFBwS1dnZDNWUmZOeXVBWF9KR2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum price forecast amid possible ETF approval - Investing.com",
        "content": "Cryptocurrencies surged higher on Tuesday amid growing optimism about the SEC's upcoming decisions on spot exchange-traded fund (ETF) applications, with the first decision expected this week. In the wake of the reports, analysts are voicing their expectations on how a potential approval would affect Ethereum prices.\n\nEthereum ETF saga sees new developments\n\nThe crypto rally on Tuesday was chiefly led by Ether, with the world’s second-largest crypto asset surging more than 22% to $3,781.\n\nAdding to the speculation was a report by CoinDesk, which, citing sources familiar with the matter, said that the SEC had asked exchanges to update their 19b-4 filings on an accelerated basis, signaling potential approval of these applications ahead of a key deadline on Thursday.\n\nHowever, this does not guarantee the authorization of Ethereum ETFs, the report added.\n\nIssuers must also have their S-1 applications approved before the products can start trading. The SEC can take an indefinite amount of time to approve the S-1 documents, as it is not bound by a deadline, per the report.\n\nOne company in discussions with the SEC reportedly suggested it might be on the right track for approval, a notable shift from weeks earlier when it felt the SEC was delaying.\n\nBloomberg Intelligence ETF analysts hiked the odds of spot Ethereum ETF approval to 75% from 25% after hearing that the SEC might be adopting a more favorable stance toward the applications.\n\nThe broader crypto market tracked Ethereum price gains. climbed 6% on the day, while , ADA, and DOGE jumped 5.8%, 6.9%, and 10.3%, respectively.\n\n“This sudden flip in expectations is an unexpected boon for investors who have been crying out for a driver after the [Bitcoin] halving passed and bitcoin ETFs were launched in the U.S. and Hong Kong,” said Antoni Trenchev, co-founder and managing partner of Nexo.\n\n“If the spot ETH ETFs are approved, altcoins should take off as ether is often a leading indicator for the rest of the crypto market.”\n\nIf the reports are true, it marks significant progress from previous expectations as many expected the SEC to deny Ethereum ETF applications this week due to concerns over the complexity and regulatory challenges associated with Ether compared to Bitcoin.\n\nThe lack of a legal precedent similar to Bitcoin's ETF approval further complicates the issue, with SEC Chair Gary Gensler recently stressing the need for investor protection and compliance with securities laws.\n\nEthereum price forecast\n\nIn their comments on the aforementioned developments, Bernstein analysts said Tuesday that given Bitcoin's 75% rally since the ETF approval, they would expect a similar surge in Ethereum prices. Moreover, they note that ETH's free float and supply appear even more attractive than Bitcoin's.\n\n“ETH since its transition to proof of stake, has been deflationary. Further, 38% of ETH is locked in staking, financial smart contracts and layer 2 chains - feature unique to programmable ETH and not seen with Bitcoin,” Bernstein analysts said.\n\n“66% of ETH supply has not moved in last 1 year (similar holding behavior as Bitcoin) and supply on exchanges is at all-time-low. Thus, ETH supply remains constrained by sticky investors and utility locking supply in financial smart contracts,” they added.\n\nEarlier this year, Standard Chartered (OTC: ) analysts said they expect the SEC to approve Ethereum ETFs on May 23, aligning with the timeline for Bitcoin ETFs approved in January 2024.\n\nThe bank predicted significant inflows for the crypto asset, estimating 2.39-9.15 million ETH, which amounts to between $15 and $45 billion, in the first year post-approval.\n\nIf approved, Standard Chartered anticipated that Ethereum prices would keep pace with BTC, maintaining the current 5.4% price ratio through 2024. Given their projection of BTC reaching $150,000 by the end of 2024, this implies an Ethereum price of around $8,000."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNYnFNMU9IOHFLMlhDSmRENFhWczVRNmdBQWd1bDBSeTg4SGRWQVg1b0JOYWNTQk9YeGRib2J3X2h5dEJ3LXhCR3phaGI5TU1aWndxanZUdkRiZUs1dnhWSVdldVBPUnFfc2RxM3d6X0I3ZG8xZ0xMcjVPdWVYYTNHY3Y1YWhkM0FUZUFWTXFkR0dzTmFReE1RdmVLak9fZksyX1RyTm5pWjFjWGlMYzFGVWVQNkhKU3hQcEdHN1UtUTdGa0tvWFRQZzZDcXRPemF6YWx1VGtyU3ZIdjdJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "EXCLUSIVE: Ethereum ETFs Could Drive 'Mass Adoption' — What Investors Need To Know Now - Benzinga",
        "content": "The U.S. Securities and Exchange Commission’s (SEC) recent request for revisions to Ether ETF applications has sparked a wave of optimism in the cryptocurrency industry.\n\nBenzinga talked to experts, who believe a potential green light for these ETFs could attract new investments and accelerate the mainstream adoption of Ethereum and other alternative cryptocurrencies.\n\nWhat Are Ethereum ETFs?\n\nEthereum ETFs would function similarly to any other ETF you might find on the stock market.\n\nIt would be a basket of investments that tracks the price of ether ETH/USD, the native cryptocurrency of the Ethereum blockchain.\n\nInvestors could buy shares in the ETFs just like they would buy shares of a company, gaining exposure to Ethereum’s price movement without needing to directly own or manage the cryptocurrency itself.\n\nWhy Are Ethereum ETFs Important?\n\nThe approval of Ethereum ETFs would be a significant milestone for the cryptocurrency industry. Here’s why it’s generating so much buzz:\n\nIncreased Accessibility: ETFs offer a familiar and regulated investment vehicle for mainstream investors who might be hesitant to dive into the complexities of cryptocurrency exchanges. This could lead to a significant influx of new capital into the Ethereum ecosystem, potentially driving up its price.\n\nETFs offer a familiar and regulated investment vehicle for mainstream investors who might be hesitant to dive into the complexities of cryptocurrency exchanges. This could lead to a significant influx of new capital into the Ethereum ecosystem, potentially driving up its price. Enhanced Legitimacy: A green light from the SEC would be a major vote of confidence for Ethereum, signifying its acceptance as a legitimate asset class. This could attract institutional investors who have so far remained on the sidelines due to regulatory uncertainty.\n\nA green light from the SEC would be a major vote of confidence for Ethereum, signifying its acceptance as a legitimate asset class. This could attract institutional investors who have so far remained on the sidelines due to regulatory uncertainty. Potential Price Impact: Analysts at Standard Chartered predict a surge in ether prices to $8,000 by the end of 2024 if an ETF is approved. The influx of new capital, combined with the increased legitimacy, could fuel a significant price rally.\n\nJohn Patrick Mullin, Founder and CEO of MANTRA, emphasized the relevance of ETH ETFs, noting that they represent a substantial opportunity for institutional investment.\n\n“Given the innovative nature of Ethereum’s tech, including smart contracts and a wide range of dApps, ETH ETFs might attract significant interest from investors who are keen on more diverse crypto exposures,” Mullin stated.\n\nThe approval of ETH ETFs could potentially lead to massive inflows of capital.\n\nMullin believes that ETH ETFs could see similar or even greater inflows compared to Bitcoin ETFs due to Ethereum’s versatile technology.\n\nOn the other hand, Andrey Stoychev, Head of Prime Brokerage at Nexo, estimated that Ether-based ETFs might see volumes roughly 30% lower than spot Bitcoin ETFs, reflecting Bitcoin’s pioneering status.\n\nCould It Lead To Other Altcoin ETFs?\n\nApproved ETH ETFs could set a precedent for other altcoin ETFs. Cryptocurrency traders have even suggested a Dogecoin DOGE/USD ETF is not out of the question.\n\nMullin suggests that once regulatory bodies are comfortable with Ethereum, it could lead to broader acceptance and recognition of other cryptocurrencies.\n\n“This could diversify the market further and provide more investment opportunities,” he said.\n\nStoychev echoed this sentiment, stating that the success of an ETH ETF could streamline the approval process for future altcoin ETFs, provided they meet the SEC’s requirements.\n\nWhat Does This Mean For The Price Of Ethereum?\n\nThe approval of ETH ETFs is expected to have a significant impact on Ethereum’s market dynamics.\n\nMullin believes that approval would initiate a virtuous cycle of stable liquidity and trust-building, potentially leading to more ETFs and increased adoption.\n\n“Mass Adoption. It's happening due to ETF approvals,” he affirmed.\n\nIn contrast, a denial could lead to a temporary drop in ETH’s price due to negative sentiment, although the long-term impact might be less severe if the broader crypto market remains positive.\n\nStoychev noted that if approved, ETH could experience a price increase similar to Bitcoin’s 50% rise post-ETF approval.\n\n“ETH could potentially rise to above $4,000,” he suggested, while also warning of a temporary lull and a potential drop back to $3,000 if the ETF is not approved.\n\nAlso Read: Top House Democrats Will Not Rally Party Against Crypto Bill Despite Opposition\n\nWhat Do Experts Think About Ethereum ETFs?\n\nRoy Hui, Co-Founder and CEO of LightLink, highlighted Ethereum’s expansive ecosystem and its role as a pivotal infrastructure for the global digital landscape.\n\n“The ETH ETF stands out amid other crypto ETFs due to Ethereum’s expansive ecosystem, robust economy and leading market capitalization,” Hui said.\n\nAlvin Kan, COO of Bitget Wallet, pointed out that the approval of Ethereum spot ETFs could lead to increased investment, funds, and liquidity from the U.S. stock market, supporting ETH’s price.\n\n“This may mimic the impact of Bitcoin, where external liquidity significantly increases its price, leading to a new historical high in a relatively short period of time,” Kan explained.\n\nWhat Happens Next?\n\nThe approval process for Ethereum ETFs faces several challenges, especially from the SEC.\n\nUnder Chairman Gary Gensler, the SEC has shown a preference for cryptocurrencies that adhere to Bitcoin BTC/USD like standards, posing special challenges for Ethereum due to its security and securitization risks.\n\nKan also noted that the approval of an Ethereum ETF could set new standards for other cryptocurrencies and provide them with examples of applying for their own ETFs.\n\nConversely, a rejection could imply that only cryptocurrencies following Bitcoin-like standards would be considered for ETFs, excluding those based on proof of stake (PoS).\n\nThe potential approval of ETH ETFs represents a critical juncture for the cryptocurrency market, with significant implications for Ethereum and other digital assets.\n\nAs the industry waits with bated breath, the decision could either propel Ethereum into a new era of institutional adoption or prompt a temporary market correction.\n\nThe future of digital assets and regulatory trends will be further explored at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nIndustry leaders, investors, and policymakers will gather to discuss the evolving role of digital assets in the global financial landscape, offering valuable insights into the impact of regulatory decisions like the potential approval of Fidelity’s spot Ether ETF.\n\nRead Next: Bitcoin Fear And Greed Index Turns Bullish: 10x Research Highlights Key Trade Strategy\n\nImage: Shutterstock"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQeXh0V3R6MzVVZjlqbFptMjk2T05xdG9yLWJnTzVPOVRSRnF2MEZSVTdLQXRYUncxOEJrb1l4VVJia3QxSzJBOEZfQVFPT241TXNBRTQ4NDVOeFEzdVpYc0kzOVRfSjVmYlFxcG9UNTZPVmxTYnlyM2x1VUVDbThObUJuZk5tLVlPalRmSURlTVBYNklDRHRhd3ZuYkdPR2fSAaQBQVVfeXFMTkJHbkh0RWRiSUw1QWs3RDVZZmFZcFBFOUZhUi1zcjBHc3VnOENDOXlxRktKN0xJMUxjek50SFpkMVl4THlrMmZyQnhoSzFBOHJJSUxEWGlYNW8wN2ZnN0dmemFvMElaR1FGSFVyenZIUVpHRVZMV2FCb3pQcEdERmR2MW1kNkRSTnpVRldUNm9raUJCVExjdW1TNHZKRnRzLW5vTm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Meme Coins MOG, PEPE Rocket as Traders Search for Ether Beta Bets - CoinDesk",
        "content": "The focus on meme coins as a way of betting on growth isn't unique to Ethereum. Several Solana-based meme coin tokens surged from December to March as the network’s SOL tokens took off – contributing to ecosystem growth and attention. Also in December, the Avalanche Foundation, a non-profit that maintains the Avalanche blockchain, said it would invest in meme tokens built on the network in recognition of the online culture and memetic value that such tokens can drive among investors."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOY0xRakpQaXUwMDNfVmZkTHFmZFdDWkZDQkRCajBiVS1XWHpBU3ZJaHQzOXM5YmVNc0NzaFZLMWE4LXEtV2ExVm5iZWxaempjZHVVVzBRQ3B0Wm5zTGNoZFozZWR2eTVWLTR2RkFrWWFJaVNGOUdQb3ZNa3VWNFlfbG44TjctQ3QyNFN1SVNUSlEzVVpoODJJaGFXdHUtVE4wVVlzcGxPdTRwYU1NbDA5dG55dTN6VWIwRGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Crypto News Today: Ethereum (ETH) Eyes $4,000 on Spot ETF Approval Hopes - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOQ0J1c0pvNlRmaS1OVF9vTjRwWG5OUlBFZEJnLWNPRjNjemtJZkpieW9Ic3UyZDB5MUl2dTN4blVObHBmSmZKMmhSUnpmaUwyWU1oZExWTGtCc2dwUktieTVkLTI5eDdMUjNFeHQxcGZ5MzJPOV9ESDVYRGFkRTNSVVdQUjlIUVI1bFV4RHJyWEZUcklhSkxLdnp2SdIBoAFBVV95cUxNa2NnbnA2aVFzUlJESVc5V0Yxd2twQlJ0LTRUckMybG9Gc2o2ZnlYb3ZOOFpsMU1YbUpUbm1JM1g1aUE3d3BjelpwTDllaFhodXhZaG1QT3RLMm9pbEotZ0FNRU5Ja0lDNE1SdFA1QkNDc21ORnBYVG1BYjhiVjJxQmRta0tfNDZJcUYwakxwZXU4MzVPT2FHMldKWm9WdEpS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "SEC signals possible approval of anticipated Ethereum spot ETFs - Fox Business",
        "content": "The Securities and Exchange Commission is moving closer to approving a highly anticipated 'spot' Ethereum exchange-traded fund as soon as this week, FOX Business has learned.\n\nAccording to sources close to the Commission, the SEC and its Chairman Gary Gensler are taking cues from recent court rulings and prior guidance on Ethereum futures ETFs to grant nine issuers permission to offer products that track the daily price of the world's second largest cryptocurrency.\n\nSEC CHAIRMAN GENSLER'S STATEMENT ON SPOT BITCOIN ETFS\n\nWhile approval isn't certain, SEC staff have been signaling they're warming up to the idea of at least partially green lighting these products as soon as Thursday, which is the deadline for the agency to decide whether to approve so-called 19b-4 applications filed by the CBOE exchange, requesting to list Ethereum spot ETFs from VanEck and Ark Investments in partnership with 21 Shares.\n\nApproving the 19b-4 applications is the first in a two-part process where the SEC would also have to approve issuers' registration statements, known as S-1s - a process that could take several weeks - meaning the ETFs may not officially launch until later this year.\n\nCONSUMER ETFS SHOWING THE REAL INFLATION PICTURE\n\nBut an SEC blessing would be yet another significant development in the maturation of the $2 trillion crypto industry.\n\nMany had given up hope the SEC would smile on an Ethereum spot ETF, given the lack of engagement on applications and the uncertainty surrounding the Commission's thinking about Ethereum's status as a possible security.\n\nBut on Monday the SEC began actively engaging with issuers and national exchanges ahead of Thursday's deadline, which is what it did before approving eleven ETFs that tracked the daily price of Bitcoin in January.\n\nLIVE CRYPTOCURRENCY PRICES: HERE\n\nThe SEC, through a spokesman, declined to comment.\n\nPotential ETF issuers who spoke on the condition of anonymity tell FOX Business they were surprised by what appeared to be a sudden change of heart by the agency.\n\nMany industry participants have attributed the abrupt SEC engagement to the increasing bipartisan support for the digital assets industry from Congress and former President Trump, who has said he would embrace the use of crypto and end the Biden Administration's regulatory \"hostility\" towards the industry if elected.\n\nOn Tuesday, the Trump campaign updated its website to accept donations in cryptocurrency.\n\nStill, sources familiar with Gensler's thinking say he has been looking at other factors such as the court ruling involving crypto asset manager Grayscale and the Commission's prior green lighting of Ethereum futures ETFs, which came to market in October.\n\nBITCOIN'S BOUNCE IN EARLY INNINGS\n\nLast summer, a federal appeals court rejected the SEC's decision to deny Grayscale's petition to convert its GBTC Bitcoin Trust into a spot ETF, saying the agency failed to make convincing arguments the bitcoin spot ETF was materially different to the futures ETF which had been trading since 2021. The Grayscale ruling laid the groundwork for the rollout of the bitcoin spot ETFs, and now, possibly the Ethereum spot ETFs as well.\n\nAccording to paperwork filed today by issuers, it appears the SEC's main sticking point for approving an Ethereum spot ETF is the so-called \"staking,\" which allows investors to earn passive income by staking their Ethereum as collateral and earning a return. In an ETF format, it may allow for investors to receive greater returns as opposed to the ones they may receive with an ETF that solely tracks the daily price of Ethereum.\n\nIt's staking by which the SEC believes it may have a case that \"Ethereum 2.0\", or Ethereum issued since the blockchain's merge to a so-called \"proof-of-stake\" consensus mechanism in 2022, may qualify as a security.\n\nIndeed, if the SEC approves the Ethereum ETFs on Thursday without the staking component, it doesn't negate the fact that Ethereum issued on today's proof-of-stake network may be a security in the eyes of the Commission. FOX Business reported in April that the SEC's Enforcement Division has been investigating Ethereum, its merge, and companies and individuals associated with it for at least a year.\n\nWhile the SEC maintains outside political factors do not influence it, there's no doubt crypto has become an increasingly political issue in recent weeks.\n\nSPOT BITCOIN ETFS: HOW TO INVEST AND WHAT IT MEANS\n\nThe Biden Administration, including Senate Democrats such as majority leader, Chuck Schumer (D-New York), appear worried that Republicans and GOP presidential candidate Donald Trump could seize on the growing popularity of digital assets, particularly among young voters, and use the administration's crypto crackdown to win votes and take the White House and possibly the Senate.\n\nLast week, Schumer led a group of twelve Democrats to vote to repeal a controversial SEC rule that would limit the ability of crypto companies to get fair access to the banking system. The 60-38 vote to repeal was widely regarded as a breakthrough moment for the industry, who until recently, has grappled with a Democratic party that's shown unwavering support for Gensler and his regulatory crackdown on crypto.\n\nOn Wednesday, the House is scheduled to vote on a first-of-its-kind bill that would establish a comprehensive regulatory framework for digital assets, a base for establishing clarity for crypto companies and investors."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBLNkp1bU41M01aNExQcURCVTZWMWFnS1ZrR0xCWlAzVm5XQ3U2bDd6b3QzTlVabnJjbnRqYjJfTHZXSzBoZHdyeUF2LVZramxPd3YzTHhFQWJZbkFtNDltWXpjUjJZX2VwSE03Qlg1eGNyY0NTc1dzQtIBgAFBVV95cUxQRUNHQUJhTERKWlJBYjdINkFja3BtNEhsZzhTNmR4NU9VYVNMTUhKYVZNZDhsOXd4OVc3ZVk3bTcyUFVCTXdCYXlaM1p5eHUzR2V0b2d4eUJoM2I1RE9yM2lGdF9ZZEJRNU52S25JblBYc3czOHRJZHVnWHl2N0NxZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Futures Market Breaks Record as ETF Euphoria Ensnares Traders - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOpen interest for Ethereum futures contracts hit $15.5 billion on Tuesday following rumors that the Securities and Exchange Commission was closer to approving ETH exchange-traded funds this week.\n\nThe sudden blast of optimism has fueled a rush of upward movement across markets, and CoinGlass data shows that open interest on all crypto exchanges was at a record of 4.13 million ETH—surging by 32% in 24 hours.\n\nDeribit CEO Luuk Strijers told Decrypt that the trading volume was “unprecedented.”\n\nAD\n\nAD\n\n“This surge [in futures trading] reflects the heightened market activity and interest as traders and investors position themselves to capitalize on the potential approval,” Strijers said.\n\nIn the derivatives market, futures contracts are an agreement to buy or sell an asset at a specific price at a later date. They allow traders to speculate on movements in an asset’s price.\n\nIt’s a marked turnaround for the second largest cryptocurrency after months of hand wringing. Until this week, it was expected by industry observers and analysts that the SEC would not approve a spot ETH exchange traded fund (ETF) by the May 23 deadline.\n\nBut yesterday, ETF analysts at Bloomberg said that they had heard Wall Street’s biggest regulator would go ahead and give the green light to the funds after fund managers started updating paperwork for the potential products.\n\nThe price of ETH has rocketed as a result: ETH is currently trading at $3,752, according to CoinGecko, having shot up 19% in 24 hours.\n\nAD\n\nAD\n\nAnd it isn’t only ETH that is doing well: almost every other coin and token is up. Bitcoin, the biggest and oldest cryptocurrency, yesterday rocketed to over $70,000 per coin. It’s since dropped and is priced at $69,753.\n\nMeme coins and tokens have also surged, as have altcoins like Solana and Avalanche.\n\nLots of top asset managers have filed paperwork with the SEC to release a spot ETH ETF in the United States.\n\nIf approved, ordinary investors could get exposure to ETH by buying shares that track the price of the cryptocurrency, which is the second biggest by market cap.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQN1JwUS1KcnZ6Nks4Zm92UEd3a1ZyNEhXVVFxWHlYMHZjT2psU2pSWVJNOHQtTUY1cnVZT1R5b21QOGI2M3ZLb2dBU3FGa1pqSXNZekpmazkyRWNES0pPUkQxaWRSSThES0RuTm02NTJxSmdLV2MyRVZWdFpWdkU3bm16dkJWZzFIX09tRGlPRjlpLXVualpzZmo1ZHJ3d3ZF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "SEC Approval for Spot Ethereum ETFs Depends on 19b-4 Filings - Crypto Times",
        "content": "The President of the ETF store, Nate Geraci, offers insights as the SEC’s decision on spot Ethereum ETFs nears, with approval depending on the SEC nod for 19b-4s (exchange rule changes) and S-1s (registration statements).\n\nSEC decision deadline this week on spot eth ETFs…\n\n\n\nSEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch.\n\n\n\nTechnically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here). — Nate Geraci (@NateGeraci) May 19, 2024\n\nSpot Ethereum ETFs directly hold Ether as assets and trade like stocks on exchanges, requiring a crucial 19b-4 filing for listing on NYSE or Nasdaq and seeking SEC approval. The S-1 registration offers detailed insights into the ETF’s structure, management, and Ethereum replication strategy.\n\nThe SEC must approve both filings for public ETF sales. The statutory review period is typically 45 days, extendable to 240 days. However, delays are possible, especially in S-1 approvals, reflecting caution amid crypto complexities.\n\nApproval could propel Ethereum adoption, offering regulated investment avenues. Conversely, a delay or denial might signal ongoing regulatory concerns. Ethereum’s price saw a partial rebound to $3,100 over the weekend as the decision nears.\n\nThe SEC’s cautious approach amid crypto complexities may prolong the approval process, impacting market sentiments and mainstream Ethereum adoption."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQcU9DUHJPSURGdmN0b19DaE44cndVVWVjbVNxUTdRQ2pjblhFS0ltUVRza0l2V1p0QlliVjhqQjRkaTRBMWQ5VUUwbzllc3F5MHFxenRLUl9QVGVuQllhOUpHNFFSeTVJQ3pYeXRRTXZKRnBHbTl0MGFMTUxUM1UwdGRpX1kxY1R0ZTZ1Uw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation blasted for EigenLayer conflicts of interest - Protos",
        "content": "Two Ethereum Foundation researchers have disclosed advisory roles at restaking protocol EigenLayer’s EigenFoundation, raising concerns over potential conflicts of interest within Ethereum’s core development team.\n\nOn Sunday, Justin Drake announced his advisorship via X (formerly Twitter), stating the “community deserves transparency.” Two days later, Dankrad Feist also disclosed his role at EigenLayer, “on the same conditions” as Drake.\n\nBoth state that their involvement comes with significant token allocations, but that their work will be specifically focused on the protocol’s risks.\n\nDrake states that he will reinvest or donate the proceeds to ‘worthy projects’ and that he had previously posted about the role in response to an Orbholder’s question, over one month prior. Feist plans to focus on risks and decentralization. “I am therefore fully expected to take contrarian views on Eigenlayer,” he says.\n\nDrake’s disclosure came the day after a post from influential crypto trader Jordan Fish, aka Cobie. Replying to Ethereum founder Vitalik Buterin’s celebration of the community’s ‘ideal of ‘open discourse,’ Fish’s tweet, visible only to followers, reads:\n\nRead more: Ethereum centralization is becoming a serious problem\n\nConflicts of interest?\n\nEigenLayer ($18 billion) is the second largest decentralized finance (DeFi) protocol by total value locked (TVL), after liquid staking platform Lido ($35 billion), according to data from DeFiLlama.\n\nRestaking has long been seen as potentially dangerous for Ethereum’s consensus model, with Buterin authoring a blog post titled Don’t overload Ethereum’s consensus precisely one year ago.\n\nAs EigenLayer’s documentation explains, restaking ‘enables the reuse of ETH on the consensus layer.’ By depositing ETH or liquid staking tokens, such as Lido’s stETH, other projects can piggyback on Ethereum’s underlying proof of stake (PoS) consensus mechanism to benefit from what EigenLayer calls ‘pooled security.’\n\nHowever, using Ethereum’s consensus layer for anything other than block validation could prove dangerous.\n\nThe major concern is known as the ‘principal agent problem,’ which Feist explains results from mismatched incentives in which a protocol’s ‘operator is not necessarily the same as the person providing the capital.’\n\nA similar set of risks is posed by liquid staking protocols, which free up staked ETH to be used as collateral on DeFi lending platforms via a wrapper token. The aforementioned Lido has often come under criticism for capturing up to almost a third of staked ETH (currently 24%), and rejecting a governance vote to self-limit.\n\nDrake addresses this in his post: “As a researcher, I feel I did too little too late with regard to liquid staking. This is an opportunity to not repeat the mistake with restaking.”\n\nBacklash\n\nAside from the potential dangers of EigenLayer itself, many have voiced their concerns over the nature of the disclosures. Firefox’s Taylor Monahan pointed out that the timing wasn’t ideal.\n\nDanger, the pseudonymous creator of TodayInDeFi claimed it’s naive to expect the Ethereum community to believe that financial incentives won’t result in a conflict of interest.\n\nRead more: Here’s why Ethereum 2 staking is risky and increases centralization\n\nAnd Rotki developer and open-source advocate Lefteris Karapetsas underlined the importance of “credible neutrality” within the Ethereum Foundation.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNeGZhU1RhVXg5S2QxRDBsN0llQ09UbF9iUkFfOGtKYWlyRTg1dXlIWUtGRmkxMEpSZlVLLUhWSXpMVmhvR0JUdUlLbk1fdlVoVVRERzdtWEFOaTNfSUcyVEFoNko4REgxUXRVR3A0Nm1WWEFVQ3VONnQxRlQzSEhxd2doZG9xSWx5ZU1Obi1iYll6NHRoeG9QWWJrcE1jWTJ1Z1hMUXgtd3ZWRWpsdnFZVE9jUm1zaFE2Qi1pQlZ6OFZ1bERoMF9qT1V3cUg1VUcxZEHSAdcBQVVfeXFMTUd1dkJ2bEhJekVTNUQxS0JXSk9GbmI0RjNaOFA5b2xGcWdLMTZYOXFxNlUzb1ZySTNXNC1IM2l1WmxuenVJTzNmZVYyRTZHTG5Fa3VhRlozNHBadWtGLVU2cnIwS3FGMTJGUmkxMVVuMHZ1bjFGMHhBODJSSWxPOGNvazJTTm5yc0xmZ1ZpRWFyM3RpOUR6aUtyWHBWY3JRLVJqemFFZEJTVHhuaDltdlJfNHp4aXh1RjI4bF9NeTZHQUxjUU55NFlUSUVVdm5PMFhSVzBMRHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Economist Alex Krüger Says ‘Base Case’ Is Ethereum at New All-Time Highs, Bitcoin Much Higher by Year End - The Daily Hodl",
        "content": "Closely followed trader and economist Alex Krüger believes Ethereum (ETH) is headed to new all-time highs (ATHs) due to one key catalyst.\n\nKrüger tells his 175,400 followers on the social media platform X that a possible approval of a spot ETH exchange-traded fund (ETF) as early as this week could send the top altcoin soaring.\n\nThe odds for an ETH ETF approval by the U.S. Securities and Exchange Commission (SEC) suddenly increased this week, and ETH rallied by more than 20% in the past day.\n\nHe also believes Bitcoin (BTC) will be “much higher” before the end of 2024.\n\n“My base case scenario has been:\n\nBitcoin much higher into year-end.\n\nEthereum underperforming due to an ETF rejection.\n\nEthereum over-performing from the US elections onwards, as elections would lead to a [SEC Chair Gary] Gensler removal and subsequent ETF approval in 2025.\n\nAn ETH ETF approval this week would push everything forward. [May 21st’s] move was just the market repositioning and shorts closing (see open interest chart below), as almost nobody had been expecting an approval. Then would come the inflows, which would push ETH into ATHs. Do not fade an approval. It is not even remotely priced in. The market would likely shift back into ‘you really are a genius mode.’ With ETH leading for a while. Even after today ETH/BTC is still red year-to-date. Time for it to continue much higher.\n\nNote: even if now unlikely, if the ETF gets rejected, we are in for a world of pain. Keep alerts on during US hours until the 23rd.”\n\nEthereum is trading for $3,809 at time of writing, up more than 22% in the last 24 hours. ETH reached its ATH of about $4,900 in November 2021.\n\nKrüger suspects the SEC is facing political pressure to approve the ETH ETF applications due to the politics around the US presidential election in November.\n\n“Many will disagree but I do believe the SEC’s seeming change in stance was politically driven, coming from the top of the Democratic party and with elections in mind. Possibly triggered by Trump’s sudden support of crypto, forcing the Dems hands.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQYkJFNnhGeXVjYXEzN0wxVFQ5LUliMXpWUHh4VkduZUpEdEtDclRLblhYNW5GSUlpckdIdUNsNFZxS3YtcWtkamxXX3E3MUpqa2hkWUVYZEt1d19aMUtTZmVWRFAwdVdDMnBQOFA2UGdRZ1ZNZVVKWC0tdXRqNGt0TGF2MnRJaHBpMnd3WHhXek9nTTRZQXJjZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Why Ethereum, Solana, Avalanche, and Chainlink Are Soaring - The Motley Fool",
        "content": "A potentially historic decision is benefiting Ethereum and several other cryptocurrencies.\n\nOver the past 24 hours, Ethereum (ETH 0.13%) surged more than 25%, rising from just $3,000 to more than $3,700 at one point. This bullish momentum is primarily driven by growing anticipation surrounding the potential approval of a spot Ethereum exchange-traded fund (ETF), a development that could have profound implications for the broader cryptocurrency market.\n\nThe SEC's shift and expedited revisions\n\nFor a long time, the approval of an Ethereum ETF seemed like a distant possibility. Many analysts and market participants believed that the Securities and Exchange Commission (SEC) wouldn't greenlight such an ETF, as they believed it to be a security and not a commodity like Bitcoin (BTC -1.56%), which received its own spot ETF approval in January this year.\n\nHowever, sentiment has shifted dramatically. Rumors are swirling that the SEC has requested several applicants to expedite their revisions to their 19b-4s. These applications, which are essential for listing new ETFs, must be corrected, allowing for the final approval with an S-1 application and thereby pave the way for the ETFs to start trading.\n\nImpact on Ethereum\n\nThe prospect of an Ethereum ETF is significant for several reasons. First, it would provide investors unfamiliar or uncomfortable navigating crypto exchanges and digital wallets an easy way to invest. If approved, then investors can buy the Ethereum ETF off their preferred brokerage, just as with any other stock.\n\nYet the most important aspect of a potential approval comes in the form of institutional investors. Currently, institutional investors face several hurdles when attempting to invest in cryptocurrencies directly, including custody concerns, regulatory uncertainties, and market volatility. An ETF would alleviate many of these issues, making it easier for institutional capital to flow into the Ethereum market.\n\nWith easier access, it is expected that the deep pockets of institutional investors could cause Ethereum's price to soar. The Bitcoin ETFs were already some of the most successful ETFs ever launched, and if Ethereum follows a similar path, it could result in a significant price surge.\n\nRipple effect on other cryptocurrencies\n\nWhile the focus is primarily on Ethereum, the positive sentiment has spilled over into other cryptocurrencies. Solana (SOL -1.43%), Avalanche (AVAX -0.59%), and Chainlink (LINK -1.45%) have all seen their prices rise by more than 25% in the past 24 hours.\n\nThese cryptocurrencies, often referred to as \"altcoins,\" have been subject to heightened scrutiny lately because of their similarities with Ethereum, namely their proof-of-stake consensus mechanisms. Many agency officials believe proof-of-stake cryptocurrencies are closer to a security than to a commodity. But with a potential Ethereum ETF approval this opinion might be changing and could give a boost to other proof of stake cryptocurrencies.\n\nAnalysts' predictions and timelines\n\nWhile the approval of an Ethereum ETF is not yet guaranteed, analysts currently estimate a 75% chance of approval. This optimistic outlook is based on the SEC's recent actions and the growing recognition of Ethereum's importance in the cryptocurrency ecosystem.\n\nIf all goes according to plan, the earliest the ETFs could start trading is around the end of June. Applicants will need to revise and correct their applications, a process that typically takes several weeks.\n\nThe potential approval of an Ethereum ETF represents a monumental shift in the regulatory landscape, offering a more accessible and secure investment vehicle for both retail and institutional investors. While the final decision is still pending, the current sentiment is overwhelmingly positive, and the approval could mark a new era of growth and adoption for the cryptocurrency market."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNMEIyeENSLTFUOHBMZkN1WW8xdDRkaFVzOGpWODk3MTk4NmlHWkFoczk1RW00RU0zRXFjRmxNQWphM0dwOWthblRxd3VQc2QwWEVoSDBuNUVqNGdJSmNyYUQ2ZUl6S2lZNWJYRVVhN0xXZDJUYVQxRTBRbERDNGFkYWdFQ24xMUxsOG9jbGstbzlhWFhWZ1lGWTdfV29GcElwcVl4RW5fUWNQcmxDQy1JMjRfNXBaVU9JV0N2Zk10YmIwUjJ6ckE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "The price of Ethereum flies to $3,700 thanks to the news of the ETF: attention to Wednesday! - The Cryptonomist",
        "content": "Yesterday, at 9.00 pm, the price of ETH soared registering an hourly candle of +9.2% following the news leaked on X regarding an approval by the SEC of Ethereum spot ETFs on Wall Street by Wednesday.\n\nAccording to reports from Bloomberg and Coindesk, the chances of an imminent introduction of this investment product on US exchanges have suddenly increased from 25% to 75%, fueling wild speculation on the cryptocurrency.\n\nNow ETH has continued its bullish run up to 3,700 USD and could soon pay another visit to the 4,000 USD area: volatility coming in the next few days.\n\nEverything you need to know below.\n\nThe chances of SEC approval for the ETF ETH are increasing\n\nUntil a few hours ago it seemed like just a mirage, now instead the chances of seeing the Ethereum spot ETF approved on Wall Street have increased dramatically after the latest breaking news arrived on X yesterday evening.\n\nAs publicly reported by Eric Balchunas, senior ETF analyst at Bloomberg, suddenly the Securities and Exchange Commission seems to be strongly inclined to definitively approve both form 19b-4s and the S-1s registration statement for the requests of several investment funds in relation to the fillings submitted in recent months to the US market watchdog.\n\nAs confirmed also by colleague James Seyffart, and by ETFStore president Nate Geraci, at the center of this change in perspective by the federal agency there seem to be political motivations, with President Biden who seems to want to appear more crypto-friendly in view of the US presidential elections in November.\n\nSuddenly the odds of approval for the Ethereum spot ETF by the May 23 deadline have jumped from a mere 25% to 75% (Bloomberg Odds).\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nJust an hour after the news spread by Balchunas, the information portal Coindesk published an article reporting some rumors from 3 different sources close to the SEC, according to which Gary Gensler and company would be asking requesting funds to quickly update the 19b-4 documents by Wednesday.\n\nThis in itself does not necessarily imply approval by the deadline date, considering that in addition to 19b-4 the SEC must carefully review the S-1 documents, and it may take longer than expected before giving a final response.\n\nCoindesk also reports that a company in negotiations with the federal entity believes that the market is on track for an imminent approval, and that ETH will not be considered as security.\n\nThe soap opera of crypto ETFs continues, started at the beginning of the year after the fake news emerged about a supposed approval of Bitcoin exchange-traded funds, then denied by the SEC and finally confirmed a couple of weeks later.\n\nIn this case, given the reliability of the sources, we exclude the hypothesis fake news but remain on alert until the actual communication from the SEC.\n\nWe do not exclude a postponement, precisely for the reasons mentioned above regarding the S-1 document theme, and consequently a negative market reaction, with the price of ETH that could be strongly affected downwards.\n\nAll eyes are on the next two days, especially on the date of Thursday, March 23, deadline for the request of the ETF by Vaneck, even if as Bloomberg analysts affirm, the official announcement could arrive as early as Wednesday.\n\nEthereum price rises by 20% in one day thanks to the news on ETFs: local peak coming\n\nFollowing the news on the ETF ETH, with the chances of approval drastically increasing from one moment to the next, the price of Ethereum has increased sharply in just a few hours.\n\nFrom 9:00 pm yesterday until now, ETH has grown by 17.81% going from 3,150 USD to the current 3,714 USD.\n\nIn the last 24 hours, the price evolution has an impact of 20%, with volumes exploding by +255%: we are talking about one of the most extreme pumps in the last years in the history of Ethereum.\n\nHourly chart of the price of Ethereum (ETH/USD), Coinbase market\n\nAs user X “bx1core” points out, in less than a day about 70 billion dollars of market capitalization have been added, almost as much as the entire market value of Solana.\n\nThis highlights how investors are bullish on the second largest cryptocurrency in the sector, and how their short-term sentiment depends on decisions regarding the approval or rejection of the spot ETF.\n\nIndeed, the news of an approval could bring, as happened analogously with Bitcoin, a strong inflow of institutional capital with consequent increase in the price of the underlying asset.\n\n$ETH literally added Solana’s entire marketcap in one single candle\n\n\n\nSit down the king is home pic.twitter.com/eDziukrHw1 — bx1 (@bx1core) May 21, 2024\n\nIn a blink of an eye, the market outlook of Ethereum changes completely: with the latest rally, the chances of a breakout of the local high at 4,090 USD also increase in the coming days and of a subsequent breakout of the historical high set at 4,860 USD.\n\nIf the ETF is approved definitively, we could celebrate an event that will be remembered for a long time, whose effects will be visible even in the next 10 years.\n\nNow, however, maximum attention to short-term manipulations: those who know the crypto market well know that these are tempting opportunities to generate extreme volatility, perfect for making stellar gains or printing solemn losses.\n\nDO NOT BETRAY the EVENT: despite the news emerged, betting on the rise or fall at the same time as the deadline date is like flipping a coin.\n\nInstead if the goal is to accumulate ETH, a winning strategy could be to place a buy order in the price range from $3,200 to $2,900.\n\nOpen eyes and eye on market volatility: stay safe traders!"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9yRXpjMEhVYk9talpuNVg3YmVTT2ZnMFZLRXN0aXlNQTZMVU4tNVo1YUZBNlA5WlY4X2pUWVlqdTI3QnNTMmo5ZkNIOFZpbHJVcXNhM3pfeGFSTVBZc2hJcFB1SzJVbmllOC15cTFqUWo2OXQ5Q19F0gF_QVVfeXFMTmNEMW1oZGNNOUk4UzctcjdnQkhJalBEdkxVRy1XU3lUeEhJR0Qyek16QTBwQU0zdlNaVE55RW43Y2tOVDNOLTN5TGUydlk3SXM2dnkxSEhFVHMtUTJTaUlLMkcwQTdwTnZqOFRYdDBXNXJjWHR4c0YzQ1hWUDgybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Soars 20%, Lifting Arbitrum and Optimism - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRumors of a potential approval of Ethereum spot ETFs have fueled a full day of gains for the Ethereum ecosystem, with the price of ETH skyrocketing 20% intraday to just shy of $3,700—trading at $3,687 at time of writing—and sister tokens Arbitrum (ARB) and Optimism (OP) both notching gains of 18% on Monday.\n\nThe optimistic mood had already spread to other cryptocurrencies, including Solana (SOL) and Avalanche (AVAX), which are peaking above $40 and $188 respectively, as of this writing, representing more than 25% gains over the last seven days for both.\n\nThe sudden rally to start the week was sparked moments after two Bloomberg ETF analysts—Eric Balchunas and James Seyffart—revealed their joint prediction that the Securities and Exchange Commission “could be doing a 180 on this increasingly political issue” and approve Ethereum spot ETFs when its first major deadline comes later this week.\n\nThey increased their estimated odds of approval to 75%—a huge upgrade from their prior estimate of 25%, which was already more pessimistic than other analysts who placed the chances at 50-50 earlier this year.\n\nAD\n\nAD\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nCrypto oddsmakers are certainly shifting their views, with the collective probability of an Ethereum spot ETF approval by the end of the month leaping from 10% yesterday to 61% on Polymarket, as of this writing. Optimism had been declining steadily since the betting option appeared in January at 76%, when Bitcoin spot ETFs were unleashed.\n\nAs with the long and meandering Bitcoin spot ETF approval process, the SEC has systematically delayed making a decision on the Ethereum equivalents. Hopes for approval had dimmed, with fears peaking that this week's deadline would prompt the federal regulator to outright declare Ethereum a security, decisively separating it from the commodity status enjoyed by Bitcoin.\n\nLate last week, however, a debate on Capitol Hill prompted many Democrats to join Republicans in defiance of Pres. Joe Biden's pro-SEC stance, a significant battle in a broadly partisan war over U.S. crypto policy.\n\nAD\n\nAD\n\nI don’t think people appreciate how huge that vote was. Warren had a strangle hold over financial policy under the Dems. This is showing the WH and Senate Dems are starting to realize that’s toxic to their election odds. They also realize there are *a lot* of moderates,… https://t.co/w8gsmw6BIn — Adam Cochran (adamscochran.eth) (@adamscochran) May 20, 2024\n\nMeanwhile, leading cryptocurrency exchange Coinbase said it saw Ethereum spot ETFs as an eventuality—if not immediately approved on May 23.\n\nAll of this came as top coin Bitcoin was in the middle of its own rally, the price of BTC clearing $70,000 earlier in the day amid massive short-position liquidiations—heights not seen since April 12, and approaching the $73,737 all-time high set in March.\n\nThe good mood was contagious, and by late Monday, the top 25 cryptocurrencies by market cap were all green for the day—and for the prior 7 days.\n\nAmong meme coins, Bonk and Pepe are both up more than 20% in the last 24 hours."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQaFJ5UUZfc2pISWhLd1pfbFY0eTdmdnhqQmRMQnpQOFNJREJheHNGR3A0UzZDUG8wVU1QUjBWQkFxZmtNNHdWU25uRGdkcWlLRV9DbUtfOGFfdFJhUkV6N3h0NkQ3WjU2dl9td0l4NVJaVXZ5dVhEZ29hOEdfaFBTNEhUVEU0Wl9tdjNjb3Nqc0ZBYUZuRFRMNzlGbm9jT0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF U-turn shakes up markets — here’s where traders are piling in - DLNews",
        "content": "The revised odds of an Ethereum ETF approval have buoyed Ethereum-correlated assets.\n\nInvestors in Grayscale's Ethereum Trust have bought up its discount in anticipation of an ETF approval.\n\nEther-correlated assets are surging after a surprise turnaround on the likelihood of an Ethereum spot ETF approval from Bloomberg Intelligence analyst Eric Balchunas.\n\nWhile Ether itself rallied 22% to $3,800, several other assets have outpaced it.\n\nGrayscale’s Ethereum Trust has in recent months become a gauge among traders for the likelihood of an Ethereum spot ETF approval.\n\nThat’s because the investment product, which launched in 2017, cannot be redeemed for the Ether tokens that back it. The lack of redemptions has meant that the trust has traded below its net asset value — or NAV — for most of the past two years. It traded at a steep 20% discount on Friday.\n\nIf the SEC approves spot Ethereum ETFs, however, Grayscale can convert its trust into an ETF. That’s what happened with GBTC, Grayscale’s Bitcoin Trust Fund.\n\nBecause ETFs can be redeemed for their underlying assets, that would allow traders to quickly arbitrage the discount to NAV, as they did when Grayscale converted its Bitcoin trust to an ETF in January.\n\nAfter the recent rally, the Grayscale Ethereum Trust now trades over the counter at %2.7 premium to its backing, indicating that traders believe a conversion into an ETF is likely a done deal.\n\n‘Ethereum betas’ rally\n\nLiquid staking protocol Lido’s LDO governance token is among the biggest gainers, rising 31%.\n\nJoin the community to get our latest stories and updates\n\nLido's LDO token surges on Ethereum ETF hype.\n\nOther popular Ethereum DeFi tokens, such as Uniswap’s UNI and Aave’s AAVE, have also jumped, but not as much as Ether or Lido.\n\nAs the biggest DeFi protocol on Ethereum with $35 billion of deposits, traders often look to Lido as Ethereum beta — a trading term for assets that react more sharply to price moves in a correlated asset, in this case, Ether.\n\nAnother popular Ethereum beta is memecoin PEPE, named after comic artist Matt Furie’s popular Pepe the Frog character. It’s the second-biggest memecoin on Ethereum after Shiba Inu.\n\nPEPE gained more than 34% on the revised ETF odds, hitting a new all-time high. It now has a market value of over $5.3 billion.\n\nRevised odds of an Ethereum ETF approval send PEPE to an all-time high.\n\nOther Ethereum-related assets, such as crypto asset manager Grayscale’s Ethereum Trust, have also benefited. After a 31% gain, it’s now trading above its net asset value per share of $32.56 for the first time since March.\n\nThe moves upward comes after Balchunas revised his odds that the Securities and Exchange Commission will greenlight an Ethereum spot exchange-traded fund this week to 75% from 25%.\n\nIn an X post, the analyst said he was “hearing chatter this afternoon that the SEC could be doing a 180 on this (increasingly political issue), so now everyone is scrambling (like us everyone else assumed they’d be denied).”\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQek5DbVNueXB0ZFlEV29sMDdJaDNzbzQ0cUljZk1CRlBaN004VjdvdGQzenFpcUJfdnBBZzVDejNjY2FYRTUtcS1KcWc4VjlwQm9hbUpHSnBVeDBZcENQSTZFSEZGWkpPaThheDMtcFIxQWVNMHJUeDY3cXhhM25DVVdKZG5DRFVUcnFUUXJYSlZTczRBeU9LSWJIcktKeHBRT1NWdnRGV1c2VGRzanVRYm11cTJBR3B3emJlb9IBwgFBVV95cUxNaDNaS3hxWDA2c1FVRzJhaEVDdDRJT2ZKZUFISzVxT0FmckQzME1zNjlFT1A3Y0xia1k3dHktb0JhbkZWQmtkcEo5VjA4SDNkX25ucGlmSUpJV1FTNVM3c2w3YjhSZVJnSFVPeURka1Iyc2RqbU8zbGFMWkJoOE40S2R5ck5wOEtRMmctWFBGWkt5azZFMTVhX3pUVG5HR3VIY3FFcmlLNEhMS09SM0FiU2tpWGRBV21HTnMwWTg2WUNwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Second Ethereum Foundation Researcher Acknowledges Advisory Deal Paid in EIGEN - CoinDesk",
        "content": "\"I am taking this position personally, not representing the Ethereum Foundation, and with a focus on risks and decentralization. I am therefore fully expected to take contrarian views on Eigenlayer,\" Feist wrote in his post. \"I do receive a significant amount of tokens from this position. I do not believe that they will change or influence my positions on how the core protocol should be developed, but I believe that the community should know about this, so that they can keep me accountable.\""
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPamwteWpZU3d1TnZKMzhGQWVZS25tOVNQTDVTeVE4Z19MUU10TzQ4WkZ0ZFVBZmJFRGlMNjdMdXdKWXdLdGFTNFFKcWc2cVJKbzVZQzBNdlJSUkRiMldkbHc1LVY2UFdWQ3F4UHlfMUlUSjNXalU2RWs3bVNkUng4WWVXZzJ6OGpQNElEalBqZWhBY0R3aEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum is shining brightly: Crypto analysis of May 21, 2024 - Cointribune EN",
        "content": "Tue 21 May 2024 ▪ 4 min read ▪ by Family Trading ▪\n\nWhile Ethereum seemed on the brink of oblivion, its price rebounded by nearly 20%. Let’s examine the future prospects for ETH together.\n\nEthereum (ETH) Price Situation\n\nAfter facing downward pressure that pushed it down to $2,900, the Ethereum price stabilized at this price level. It took waiting until the week of the final deadline for the approval of Ethereum spot ETFs by VanEck, 21Shares & ARK, for the cryptocurrency’s volatility to increase. Fortunately for Ethereum, expectations that became more optimistic on Monday, May 20, allowed the cryptocurrency to appreciate by over 20%. Thus, Ethereum reached a resistance level of $3,700, as noted in the analysis of May 9, 2024.\n\nAt the time of writing this article, one Ether is worth $3,650. It seems that the cryptocurrency is now stabilizing below its resistance level. These recent bullish fluctuations have allowed ETH to position itself again above its 50-day moving average, which could reassure investors about the cryptocurrency’s trend. On the side of Ethereum’s momentum, a notable recovery can be observed, as evidenced by the oscillators and the price of Ethereum itself. All these elements thus seem encouraging for the continuation of this movement.\n\nETH/USD Chart (1D)\n\nThe current technical analysis was conducted in collaboration with Elie FT, an investor and passionate trader in the cryptocurrency market. Today, he is a trainer at Family Trading, a community of thousands of proprietary traders active since 2017. There you will find Lives, educational content, and mutual support around financial markets in a professional and warm atmosphere.\n\nHypotheses for Ethereum (ETH) Price\n\nIf the Ethereum price remains above $3,400, we could anticipate a breakthrough of $3,700. The next resistance to consider would be $3,900, or even $4,100. If the bullish movement continues, a new high at $4,400 could be marked. If Ethereum’s momentum accelerates, it would not be impossible for Ethereum to reach its all-time high around $4,800. At this stage, it would represent an increase of over 31%.\n\nIf the Ethereum price fails to stay above $3,400, a return around $3,100 could be considered. The next support to consider, if the bearish movement continues, would be in a price range around $3,050. At this stage, it would represent a decrease close to -17%.\n\nConclusion\n\nFollowing a period of decline, Ethereum has experienced a remarkable recovery, supported by optimistic expectations related to the approval of Ethereum spot ETFs. This positive momentum, illustrated by reaching a key resistance level and a regain of confidence among investors, suggests an encouraging trend for the cryptocurrency. However, we will have to wait for official announcements to confirm the acceptance of these ETFs and, consequently, the continuation of enthusiasm for the cryptocurrency. Thus, it will be crucial to closely observe the price reaction to different key levels to confirm or refute the current hypotheses. It is also important to remain vigilant in the face of potential “fake outs” and market “squeezes” in each scenario. Finally, let us remember that these analyses are based solely on technical criteria and that cryptocurrency prices can also evolve rapidly based on other more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOU0RFUnlYZ0xPQnhWVlFvSGxHWERrX21LSlViaWVOeU1PX296eUgtRk8zb2RSQjFXeHJrU1BSUENiREVQMi1kaXJHaHliR29LeVlid3B2T1BhWlNnVVk4UzFrMHFVXzRjcm5VbmRDMGZaXzV5SlJoMndQeE1QZWJhWHJ2bFhHZ0FpNWfSAZIBQVVfeXFMTnVlMXpaeUo4ZVVzOWowNXk1UXZkTUpaRzRPNkJ5VHVBeXphaF9Yb1V3b19yblZQLU9NdkdBYlBRWDNEenJ4cDQ0bktLRkpqTEhudkdjS1kwN25rQzFGUGlidnc3S1dFLUNLRGE5VFhuZjVudnA0QVhRMFhMRl8wVU5xbDBOa3VDREFDSHhCWS11aHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Gala Games Attacker Returns Ethereum After $240 Million Token Exploit - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe as-yet-identified attacker behind Monday’s $240 million Gala Games token exploit has returned the Ethereum (ETH) gained from selling some of the tokens, as Gala reckons with the fallout from the attack and how to address lingering questions.\n\nApproximately 5,913 ETH, or about $22 million, was sent back from the attacker’s wallet to a Gala wallet on Tuesday morning, representing the funds earned from selling 600 million GALA tokens on decentralized exchange Uniswap shortly after Monday’s exploit.\n\nIn Gala’s Discord server Tuesday, CEO Eric “Benefactor” Schiermeyer said that the firm will “probably buy and burn” GALA tokens using the recovered ETH—a move that could potentially drive up the price of the token following Monday’s dip.\n\nOn Monday, Schiermeyer wrote in a Discord announcement that the crypto gaming startup believed it knew who was behind the attack, and said it was working with authorities to bring the attacker to justice. The person in question has yet to be publicly identified, and Gala Games would not comment further beyond published statements.\n\nAD\n\nAD\n\nGala published a blog post recounting the attack and the firm’s countermeasures on Tuesday. A wallet with administrative access to the GALA token minting contract minted 5 billion GALA tokens on Monday, or about $240 million worth at the time of the exploit, and then proceeded to start selling them on the open market.\n\nAfter about 45 minutes, Gala was able to block the wallet from making any further sales thanks to a function built into its v2 contract upgrade from last fall. The attacker was able to sell 600 million GALA tokens before that happened, and the price of GALA plunged by 20% during that span as the market contended with the flood of tokens.\n\n“We want to assure our community that the minting capabilities of $GALA on GalaChain remain secure and uncompromised,” the post reads. “Our internal controls and multisig security protocols are designed to protect against such incidents, and we are continuously enhancing them to stay ahead of potential threats.”\n\n📢 Important Update We recently detected and addressed a security incident involving $GALA tokens. Thanks to our network’s robust security, the situation was quickly under control. Your GalaChain assets and $GALA Ethereum contract are secure.https://t.co/O3himruM4E — Gala Games (@GoGalaGames) May 21, 2024\n\nAD\n\nAD\n\nHowever, while the firm claimed that the contract is secure, Schiermeyer previously wrote on Monday that Gala had “messed up” in regards to access to such functions.\n\n\"We messed up our internal controls... this shouldn't have happened and we are taking steps to ensure it doesn't ever again,\" he wrote Monday.\n\nWhat about the other 4.4 billion GALA tokens? That’s nearly 9% of the total supply of 50 billion GALA tokens, and they currently sit frozen inside of the attacker’s wallet. On Monday, Schiermeyer wrote that they would be considered “effectively burned,” as they’re inaccessible and can’t be spent.\n\nIn other words, the Gala ecosystem would consider them removed from circulation. But now, it appears that Schiermeyer’s classification was premature, and the community of Gala network node operators will have the opportunity to vote on the question.\n\n“A new Founder’s Node ecosystem governance vote will soon decide if the blocklisted GALA will be considered burned as it relates to GALA’s dynamic supply distribution model as described in the Gala Ecosystem Blueprint,” the post reads.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9lejJkYUNPcDdITTRwSlI1OWtzZmtrdGI5VlVUM3NHQ0xLanYxdmlWZ0pRQ2pNNHVoTDJzTHFOV3FydmlMM1Y3RGllckdRZmprcFFmbmYzSnB0UXVmakk5NGZmZTJDVGxLd1JxOVpTODE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ether jumps 16% on US ETF approval speculation - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nThe price of ether has jumped more than 16 per cent on speculation that US regulators will give the green light to stock market funds that invest in the world’s second-biggest cryptocurrency.\n\nThe sharp rise, which began last night, caught many traders by surprise as most had expected the Securities and Exchange Commission to delay or reject the first ether exchange traded fund by a Thursday deadline. Bitcoin also rose 6 per cent overnight to just over $71,000.\n\nThe renewed pressure on the SEC comes after the agency in January gave approval to exchange traded funds that invest bitcoin, giving way after years of delays. The spot bitcoin ETFs have drawn more than $10bn into funds run by assets managers such as Fidelity, BlackRock and Ark Investment Management, and helped fuel bitcoin’s rise to a record high of more than $73,000 in March.\n\nEther hit a six-week high of $3,700 after several media reports said issuers had been asked by the SEC to file amended applications for their spot ether ETFs.\n\n“Given the radio silence and lack of [SEC] engagement on the filings, consensus was that an ether exchange traded fund would be denied,” said Gautaum Chhugani, an analyst at Bernstein.\n\nThe first decisions, on funds run by VanEck and Ark Investment Management, are due on Thursday and Friday respectively.\n\nBut analysts said this first stage of the approval process might not mean investors could shortly start trading the funds. Nate Geraci, president of The ETF Store, a financial adviser, said on social media site X that the SEC had no deadline to sign off the second, final stage.\n\nChhugani said the political dynamics around crypto in Washington were shifting, after 18 months of regulatory crackdowns and Democrat-led blocks to regulation.\n\nHe noted that former president Donald Trump had hosted an event for crypto enthusiasts and last week Congress agreed to overturn a controversial accounting rule that penalised banks wanting to hold digital assets for customers.\n\n“All of these, in our view, have likely caused a last-minute change of heart in the incumbent administration, perhaps realising the anti-crypto stance may turn out to have a political cost,” he said.\n\nEther is the cryptocurrency linked to the ethereum blockchain, which is widely used as the platform for building new cryptocurrency projects. Its technology can hold assets and enables programmers to code functions for buying and selling into smart contracts.\n\nSeveral other asset managers also have filed applications with the SEC for ETFs that invest directly in ether, including Fidelity and BlackRock.\n\nGeoff Kendrick, an analyst at Standard Chartered, said he expected the price of ether to rise to $8,000 by the end of the year as “once investors realise ETH is the ‘big tech’ of digital assets they are likely to embrace it”."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOLTBpN3NyYjhXNW1XV2NlS1dsRHdPUXZVeEdyNUJLSEluT0k5QUNLTHB2aFlrWWIzY2otWFIxU0I5Q08wUGVYdGNBa1FnUmhJRGkzTlNlc2NDaDc3THVoeWFuenp0Y2FYSksyYjJpeUpoa01KSDA2NnhRQXI4UW01QVJlc9IBiAFBVV95cUxQMDI0M0ZKMlNOXzIzTzRlUEY3X0xlcXBiN1hHR09zWEdlTEdLZllGeXM1VGxjclZYaERDQXF2Z0x0YlBLVnliV2E2dzU3NDIwZnVjamI1UmRSUzI2ZU9RMi05N0hpQndOcmdhVl8zaDJ2SGxVcm5PNl9ocklzQlA4YnJDOHhXcy1C?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Raoul Pal Delivers Epic Prediction for Ethereum All-Time High - U.Today",
        "content": "The crypto space is buzzing as the deadline for the SEC's decision on the spot Ethereum ETF looms this week, with a decision expected as early as May 23. Adding to the excitement, top industry analysts have increased the probability of approval from 25% to 75%. This optimistic outlook has already had a notable impact on the market, with Ethereum's price surging more than 20% in just one day.\n\nAdvertisement\n\nProminent cryptocurrency expert Raoul Pal has weighed in on the potential of this development. He highlighted a scenario where substantial demand for the ETF, coupled with the fact that 30% of Ethereum remains staked and ongoing burning processes make supply deeply negative, could create what he describes as a \"banana zone squared.\"\n\nThis term refers to a period of exponential growth and market imbalance driven by rapid crypto adoption and significant increases in market capitalization.\n\nAdvertisement\n\nOne more thing I've been talking about for a while... what the hell happens to the price of ETH if there is big demand for the ETF and 30% remains staked (off market) and burning makes supply deeply negative as activity rises.... that could create a banana zone squared... — Raoul Pal (@RaoulGMI) May 21, 2024\n\nAccording to Pal, if these conditions come to fruition, Ethereum could see unprecedented price increases. He suggests that this scenario is already unfolding and predicts that non-fungible tokens (NFTs) will experience a massive boom once ETH reaches a new all-time high.\n\nETH to USD by CoinMarketCap\n\nThis prediction is particularly noteworthy given Ethereum's previous peak of $4,868, achieved on Nov. 8, 2021. With the altcoin's price currently less than 29% away from this ATH, the stage seems set for significant market activity.\n\nPal's forecast adds a layer of excitement to the already heated discussions surrounding Ethereum and its potential. As enthusiasts eagerly await the SEC's decision, the prospect of a new ATH and subsequent NFT explosion is fueling fear and greed within the crypto community.\n\nIf Pal's predictions hold true, the coming weeks could mark a historic period for Ethereum and the broader digital asset market."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOUUdweGhfajduRzA4Wk9NbTN0Uk9uV0lTZkxuNlN2dWZXWWdRMlJRNGdsbUZxTXVCdTlNSnM3VUVDdkUzR1ZidjFYbm95ZXNxMDMtcUdEaDN5Nk9SZDBnYkVaLUpRQ0JuSGVlNWpUVkhtZVR1U3ZsRTVNeURWNzd3dNIBiAFBVV95cUxQZlNVTE5FZmVETGh3NDdoRWN6UWZvWEhDNi1Bck5GMkJOME5WSlBxRF9ReXhBeFJFVzNVc3MtaHJZVG4yX3FTdkRaZXN2YUF6aUtoUkxpVDFldlA4cE1BdUQtY3VSUnd0MW5QamRaSkZYVnFmS0s5cWtzYW5yY0ZVNG96SUZNNnFW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Isn't 'Unified' Enough Amid Layer-2 Expansion, Says Vitalik Buterin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nVitalik Buterin, the prominent co-founder of Ethereum, took to Twitter (aka X) to call for better interoperability between Ethereum layer-2 networks, suggesting that the ecosystem isn’t “unified” amid a growing pack of networks that attempt to scale ETH in various ways.\n\n“The L2-verse doesn’t feel enough like a unified Ethereum,” Buterin said on Twitter. “It's much better than a year ago, but still far from perfect.”\n\nThe Canadian programmer is calling for an “open, decentralized, operator-free, governance-free protocol” that will allow assets to be seamlessly bridged from one layer-2 network to another. This protocol should then be natively integrated into wallets, Buterin added.\n\n“Get the basics done before getting too committed to any fancy toys,” he said, in response to someone calling for more advanced optimizations of Ethereum scalability.\n\nAD\n\nAD\n\nWe need an open decentralized (operator-free, governance-free) protocol for quickly moving assets from one L2 to another, and for that to be integrated into wallets' default sending interface. Get the basics done before getting too committed to any fancy toys. — vitalik.eth (@VitalikButerin) May 21, 2024\n\nCurrently, bridge options—such as Optimism’s Superchain—are being built to allow assets to be moved from one chain to another. But that’s just for chains building on the OP Stack. Buterin believes that having multiple solutions is damaging.\n\n“We need to get serious on doing this Ethereum-wide,” he explained on Twitter. “If there are five separate solutions for five sub-ecosystems, that's needless fragmentation.”\n\nHow could this be achieved? Buterin believes that alongside the Protocol Guild—a collective of Ethereum contributors working to maintain and evolve the protocol—the community should create a “Basic Infrastructure Guild.”\n\nAD\n\nAD\n\nThis new collective should aim to accelerate cross-layer-2 bridging solutions, develop zero-knowledge Ethereum Virtual Machines (zkEVMs), and work on other “public good” infrastructure solutions.\n\n“Set the standard that these things are ecosystem-wide public goods, and not products of individual companies,” Buterin said on Twitter. “Though like Linux, individual companies should absolutely be welcome to participate and even take initiative.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE13YVFsTVl1SlhYTlFYTzRrOXRkRHNfYmxQZm9Ua0lPd0xNUkhtNTNrazUwQ0JuVmhqdjNCUjNJWUFJMkxEY19iQzlCX05UejBPa29lWjByeklHRmZROEpLWmZ3aDR4LUZIQXdBWGZ2SGkyUdIBekFVX3lxTE05YUJyZGplVEVjUkY0RjF3bXNselBSelI2R0xxSzFSQ3VfSEF6a3FTZTZPUTM1aHNMSmJrcHlfSkVVWWZORkd1R3FINjBnaWt5SlJ1cEtRVFNtZXZuU3o0M0xFWW8zMV9mdVc2Z3ptdDdHSVBHS1hqVjdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Still Above $3,600 as ETF Approval Hopes Swell - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum took a big leap last night and early this morning on reports that the Securities and Exchange Commission has asked spot ETF applicants to submit revised 19b-4 filings.\n\nThe 19b-4 filings are what firms use to propose rule changes to the SEC. In this case, applicants would need the regulator to change their rules to allow for Ethereum spot ETFs to trade on exchanges.\n\nWhen this happened for spot Bitcoin ETF applicants in January, the industry was just days away from an historical approval of all 11 spot Bitcoin ETFs. There's no guarantee, of course, that things will play out quite the same as they did then. But sentiment around this week's upcoming deadline has taken a big swing and sent ripples throughout the market.\n\nAt the time of writing, the Ethereum price is holding above $3,600 and has seen volumes increase 219% in the past 24 hours, according to Coinglass.\n\nAD\n\nAD\n\nStablecoin Open Dollar founder Joseph Schiarizzi noted on Twitter last night that Ethereum increased its market capitalization—now $439 billion—in 3 minutes by as much as half that of Ethereum competitor Solana.\n\nETH just added half of Solana's market cap in 3 minutes. — JOSΞPH 🍩 (@CupOJoseph) May 20, 2024\n\nDelegate Labs and Clusters founder Foobar noted on Twitter that the spike in price had created the largest ETHUSD daily candle in history as the price went from $3,070 to $3,661.\n\nMeanwhile the open interest, or open ETH futures contracts, has swelled 26% in the past day to $15 billion. And call options—which are opened by optimistic traders who think the price of an asset is going to increase—outnumber put options almost 2:1, according to Coinglass.\n\nAD\n\nAD\n\nThere's now $3 billion worth of open interest in Ethereum options that expire at the end of May and June.\n\nThe potential approval, or at least a step towards it, has gotten analysts wondering how the SEC could grant an approval while also fighting court battles over ETH's status as a security.\n\n\"If the speculation about a 180 from SEC on the Ethereum ETFs is true, I would guess they try to thread a needle between 'ETH' NOT being a security and 'staked ETH' (or even more flimsily, 'staking as a service ETH') as BEING a security,\" wrote Alex Thorn, head of research at Galaxy Digital, wrote on Twitter.\n\nif the speculation about a 180 from SEC on the ethereum ETFs is true, i would guess they try to thread a needle between “ETH” NOT being a security and “staked ETH” (or even more flimsily, “staking as a service ETH”) as BEING a security. that would be somewhat congruent with… — Alex Thorn (@intangiblecoins) May 21, 2024\n\nJust a month ago, Ethereum software giant Consensys filed a lawsuit against the SEC over its attempts to regulate ETH like a security. It was only a few weeks ago that court filings from that lawsuit revealed that a leaked internal memo from the SEC showed that the regulator has considered Ethereum to be a security for more than a year.\n\nIf the SEC does approve spot Ethereum ETFs to begin trading, Singapore trading firm QCP Capital predicts ETH could quickly close the gap to $4,000 and rise as high as $5,000 before the end of the year.\n\n\"⁠If not approved, we could expect an ugly move back to 3k,\" the firm wrote in a blog post. \"This uncertainty has resulted in higher volatility, but the better trade might be spot-futures basis which is now yielding above 10% again.\"\n\n(Disclosure: Consensys is one of 22 investors in Decrypt)\n\nAD\n\nAD"
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxORUI5SllFTG1STnlaQTk0dnU3WEFNRTF0OHJSdHh4clFTNHVXVFpvaGVVaHgxaE82bmdyUXRvU0VUcHh0X21SVG8tUS1vWEtNc29Gdm51dHFOdHZpcGhzalptM2xFUTNHVjgwVHBBVG5xcV9zRHNfOXQtQUxwSHdpRkVjNy00WWp1TDFFcEhkYklfd2d3WU8wTllDRDJFNlJhVndCTlgxSlV3Uy10c05BRUdLNzdQRm5MWTVHX2hmaUI5dmQycmRiRllDUTUwRkQzV19ZdUVNU2VQbGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Rises 20%, Futures Open Interest Hits Record $15B As ETF Approval Odds Jump To 75% - Markets Insider",
        "content": "The open interest in Ethereum (CRYPTO: ETH) futures has reached an all-time high of $15.1 billion, reflecting a surge in investor interest. This spike is attributed to the growing optimism surrounding the potential approval of spot exchange-traded funds in the U.S.\n\nWhat Happened: The notional open interest, which represents the dollar value locked in active ether futures contracts, has risen by 29.79% in the last 24 hours, as per data from Coinglass. The previous all-time high of $13.2 billion was reached on Mar. 15.\n\nThis surge comes amid a significant price increase in the second-largest cryptocurrency by market cap, which has seen an 18.06% rise to $3,659, according to the data from CoinMarketCap.\n\nThe recent bullish trend has been further reinforced by Bloomberg’s ETF analysts, who have increased the likelihood of the U.S. Securities and Exchange Commission approving spot ETH ETFs from 25% to 75%.\n\nThe SEC has also requested exchanges seeking to list and trade potential spot ether ETFs to expedite their 19b-4 filings, indicating a potential acceleration of the approval process.\n\nSee Also: Bitcoin Price Predicted To Rise Due To ‘Demand And Supply Dynamics,’ Says Analyst As King Crypto Rebounds 10% In Last 7 Days\n\nWhy It Matters: The surge in Ethereum futures interest follows a series of events that have significantly impacted the crypto market. On Monday, the SEC’s Trading and Markets Division instructed asset managers to revise their 19b-4 filings for the first U.S. ETFs holding Ethereum, leading to a surge in crypto prices.\n\nThis shift in sentiment has led to speculation within the crypto community that the SEC may indeed approve a spot ETH ETF, signaling a broader positive regulatory stance towards crypto. The SEC is expected to make a decision on the VanEck spot ether ETF on May 23.\n\nThese developments have had a significant impact on the market, with the Bitcoin Fear And Greed Index turning bullish and the SEC Chair Gary Gensler facing criticism for his stance on Ethereum as a security.\n\nPrice Action: Ethereum is trading at $3,719.68, up 19.85% in the last 24 hours and 28.7% in the last 7 days.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Shoot Up On One Of The Best Days For Crypto In 2024 Amid Ether ETF Approval Buzz: Analyst Flags ‘Robust’ US Investor Demand for King Crypto\n\nPhoto by Tomasz Makowski on Shutterstock\n\nEngineered by Benzinga Neuro, Edited by Kaustubh Bagalkote\n\nThe GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQMGtpZm9mbExMZ2Jkb2toZkhGX0lKWGlma0FNZ2FjOHNpVF9ySEUxZHROa0lkVlo3MUVRZE9TcjB6TktNUkRyTEtBalFzTmx4TFBHeFBNRkVYUkVudGFiS0g3aWFDR1MySzU3a0E5NWZKVmN5d05UMDR0QUp1R0UxcTNpazFEc1lMT085RHdnV0VsWU42OUI5dXMxTjNGYjIzVnhMNkduRDNvX2JkNS16Mkx0S29jTlpTNjBIRTlhSm1Nek9Yal9KZnN3c2RYWGlaMG5QbWp30gHbAUFVX3lxTE5ISDdKeDE3dzNON1lRVm9RRnlHeXotWjl1TzVwWFIydmR5UUdpNHdNb1NBdTZxY0VlRjZSVlgycW56WFh2QXhlY2JYbzN5WkVpVlJfR0FRZEJXTEZxXzZsT1BpNXV0RTFaSlhhZzhxcmh0bmgtU2U2RDFvd0c1Qkx3UzZ1R2xlU29ZNi1PZWZhWUZyU00tbmV4eDUwYy1XdWE1WVpjRWd3UXF2R21vbzBvd0lsbVBBRVZLVVo3QnB0VmdjaEVTQUpCYmxwb01ZNWNMQlBIekpGYmFNUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum skyrockets 22% amid speculation of ether ETFs approval - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe world's second-largest cryptocurrency , Ethereum, surged 22% to $3,772 in the last 24 hours by 7:30 pm IST on Tuesday. This upward movement propelled Ethereum 's market cap to $453.2 billion.The surge in the cryptocurrency comes amid speculation about the outcome of applications for US spot exchange-traded funds ( ETFs ) tracking the world's second-biggest cryptocurrency.This week, the U.S. markets watchdog is set to deliver its decision on several spot ether ETF applications. Analysts and investors speculate that Tuesday's surge may be attributed to rumours suggesting that the Securities and Futures Commission could approve these products, contrary to earlier expectations of rejection.\"Ethereum has surged by ~20% overnight by registering its biggest candle in 5 years after positive developments on its spot ETF decision. US SEC has requested Ethereum spot ETF applicants to update their 19b-4 filings - indicating that they are likely to be approved this week,\" said Vikram Subburaj, CEO of Giottus \"If ETH ETF is approved, we anticipate Ethereum to surge towards $4,000 in the upcoming days,\" Subburaj said.Over the past seven days, Ethereum has experienced a significant increase in value, rising by 32%. The volume of Ethereum traded in the twenty-four hours leading up to the time of writing surged to $46.98 billion, marking a 329.6% increase.Meanwhile, Bitcoin surged by 5.8% to reach $70,734 in the last 24 hours, contributing to a nearly 9% increase in the global cryptocurrency market cap, which now stands at around $2.63 trillion.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, increased to $1.393 trillion. Bitcoin's dominance is currently 53.25%, according to CoinMarketCap . BTC volume in the last 24 hours rose 158% to $58.4 billion.Other major crypto tokens such as BNB (8%), XRP (6.4%), Dogecoin (12.9%), Shiba Inu (8.9%), Avalanche (8.9%), and Cardano (8.3%) also surged.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQSk1lbFhvSVNHb2U1YXhVRFlaVkwwWTJMTzNNLXJkdFJ2N0NtMkpTODc3a2RaWFZJbEM1NUZmWm9EaVkxWlhvYzNFR29ucEltc2hqTmJHZEx4Um1RZ0JjbHkwQ2N3YU0yaVB5Qks5STFUSkx2d1F6ZW1aVTl3UnRmbzBBZUdBOUpZS0RGZ3ZRektNbzIxVGEyeWJiVkE0cmUyOGRjWl8wdWtfN1Y5UUhmVnhDNElOeGdONmRCUnhtZkFLRVd3LVZYbGlRYm54anfSAdQBQVVfeXFMT2R4V1NXU2VUTE9NYlNoNTVSS01UdFVHcXVKS0s0dmlNUDZBZk90aDlscG1MLUJYWW15VUNJV1B0bnRaUVRVd1V6bEdoU1VXWHQ1NUhnaGVmajhXakV1ZlVsWHRSZjFDTW5HN3RLY0RIQ2dhd3YzR1piYU44bVl2cGplNVY1alYxZEFsbm5OTkRQbjlldVBJeEt5d0cwZjZfSkNRZXhEZmFwbHYxQ1kxdl8wOXRaNFdhNFFTSTBuM2FLdUU1QzlLaXZuamdjSzVHbUFaeks?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Predicts Ethereum Season, Says Solana Following in Footsteps of ETH’s 2021 Market Cycle - The Daily Hodl",
        "content": "A popular crypto analyst says that it’s likely Ethereum’s (ETH) time to shine and that its biggest rival is in for a parabolic run.\n\nPseudonymous trader Inmortal tells his 213,900 followers on the social media platform X that Ethereum will rally and leave many traders on the sidelines.\n\nThe analyst lays out an initial target of about $4,000 with a chart suggesting that ETH found support at around the $2,800 level.\n\n“ETH season about to start.\n\nFueled by disbelief, as all the other times.”\n\nAt time of writing, Ethereum is trading for $3,107.\n\nThe analyst also has his eye on Ethereum rival Solana (SOL). According to Inmortal, Solana has so far resembled Ethereum’s 2021 market cycle, and if SOL were to continue, it could be trading well above the $360 mark later this year.\n\n“ETH 2021 vs SOL 2024”\n\nSOL is trading at $177.54 at time of writing.\n\nLooking at Bitcoin (BTC), Inmortal says that the crypto king is currently in a range between $74,000 and $56,000. If BTC manages to convincingly hold the $66,000 level, the trader says that another run-up to all-time highs is possible.\n\n“BTC KEY levels.\n\nPrice rejected at first level of resistance (mid-range)\n\n> IF price manages to reclaim mid-range, THEN range high ($74,000) is on the table.\n\n> Below blue box = bad\n\nVery simple.”\n\nAt time of writing, BTC is trading at $67,024, slightly above Inmortal’s mid-range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5hVWYyU2UxR3pXUnFoOU0wMnlicUZBdml6d1hTeG9YMGlZUk5VOFBBZXZ5Y0RGTnl1c3NSUDFFOEpKeS1zVnlsVmZPTUNuRzgwSW5uZUFHZzFIRzFjcEtrci1JUTQ0bFJiN1U2Y2ZtLXVMZ2tnU2fSAXtBVV95cUxNRWYtUzFqUHdEUTZHMjVGLTdPbDVFZVRPNFVqNHBtU2hRb1ZleW1qSS16U1dSdWpDY2RzcXJ5UHNrMjJTVTJ4UkRrazdVNHhqWlN2OVFHMFNHbUlGUTFsb0gzN2l6UkVSYzlSV1ZCZU9tUjRTYnBzWG83dUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Odds Suddenly Surge. Here's Why - U.Today",
        "content": "Bloomberg analysts James Seyffart and Eric Balchunas have increased the odds of spot Ethereum approval to a whopping 75% in what appears to be a last-minute reversal.\n\nAdvertisement\n\nAccording to Balchunas, there is some \"chatter\" that the SEC might be doing a 180 on this issue (which might be due to political pressure).\n\nPrior to this, the industry consensus appeared to be that these ETFs would be denied due to the lack of engagement between ETF issuers and the SEC. The Bloomberg analysts claimed that the probability of these products being greenlit by the regulator was just 10%. However, former Grayscale CEO Michael Sonnenshein said that he was \"optimistic\" ahead of the Ethereum ETF approval deadline.\n\nAdvertisement\n\nFollowing the latest developments, Seyffart and Balchunas have now capped the approval odds at 75% until they see possible filing updates.\n\nAccording to Fox Business reporter Eleanor Terrett, things are currently evolving \"in real time.\"\n\nJake Chervinsky, a popular cryptocurrency analyst, has noted that the approval of spot Ethereum ETFs would be \"shocking\" to everyone he knows in DC. If the SEC actually makes such a move, it could signal a major shift in US crypto policy following the bipartisan SAB 121 vote.\n\nAs reported by U.Today , the SEC is expected to announce its final decision regarding the VanEck ETF proposal on May 23.\n\nThe price of Ethereum has now surged over 8% over the past hour alone, touching the $3,400 level. In the meantime, the Bitcoin price is approaching $70,000.\n\nEthereum open interest has increased by $1 billion in just a single hour, with traders \"aggressively\" opening long positions.\n\nAccording to GlassGlass data, more than $86 million worth of shorts has been liquidated over the past hour alone."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQbDZvckp3N3hVTGF0bWpnd2J1ZzMwUmt1aFFVQW5WdF8xZE1yMzVGZjlnbm9VZlBENVo5dWVlMXpKSVZpbmZvcU9jM1BUbkUxMzg5QVNEamlwM1o1UE5NX0gzcVF0dVdFb0U3aWl3R25xRDN4bTRHVXFvZWhIdlFhc1NsMmgxTWd4WEtjR3JYRWVOMy05cUVsUnN5dko1MFlVS3RZOHVvWHo2LVpza00zZDhwQ081N3RKTjJvaGtJSWdPcktVM0ZteUFrT3N2UkxISEN3RjRuREkwWXExYl9ZaFBzWDVHY19o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "SEC Chair Gary Gensler Mocked By Popular Crypto Analyst After Spot Ethereum ETF Progress: 'His Meltdown Would Be Historic' - Benzinga",
        "content": "Prominent crypto market observer and founder of venture fund Cinneamhain Ventures, Adam Cochran, took a dig at SEC Chair Gary Gensler over the latter's stance on Ethereum ETH/USD being a security.\n\nWhat Happened: Cochran, one of the fiercest critics of Gensler, took to social platform X mocking the SEC Chief's duplicitous position on categorizing cryptocurrencies as securities.\n\nHe wrote, \"I'd love to see @iampaulgrewal ask @GaryGensler in court to explain the difference between ETH (a non-security) and the countless assets he claimed are securities in their cases.\" Cochran went to the extent of saying, \"His meltdown would be historic.\"\n\nI really want to see one of the other SEC cases accelerated now.\n\n\n\nI'd love to see @iampaulgrewal ask @GaryGensler in court to explain the difference between ETH (a non-security) and the countless assets he claimed are securities in their cases.\n\n\n\nHis meltdown would be historic. 🫡 — Adam Cochran (adamscochran.eth) (@adamscochran) May 21, 2024\n\nCochran mentioned Paul Grewal, Coinbase’s Chief Legal Officer — an outspoken critic of Gensler himself who has maintained throughout that Ether is a security. He had previously remarked that the regulator has “no good reason” to deny the ETF applications\n\nWhy It Matters: Cochran's remarks come as the SEC reportedly moved forward with the spot Ether ETF applications, asking issuers to revise their 19b-4 filings.\n\nThis move, combined with Bloomberg analysts boosting their odds of a spot ETH approval, has prompted experts to assume that the SEC no longer considers ETH security.\n\nSeveral reports in recent months have alleged a planned move by the SEC to brand the cryptocurrency as a security. Gary Gensler has tiptoed around the issue, leaving an element of uncertainty regarding the SEC's actual position.\n\nImage from Shutterstock and Third Way Think Tank on Flickr\n\nPrice Action: At the time of writing, ETH was exchanging hands at $3,648.03, following a 16% bounce in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next: Big Ethereum Whale Adds On To Bullish Long Position As Spot ETF Approval Probability Jumps — Swaps Wrapped Bitcoin Worth Over $25M For ETH"
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNZjNUZWlPWXU0clkwODVSdVJkZWtEeEZReDEybDlrYjdaS2dmanJaYTNJa25MZzZSY3hvZ3l4cU9GRVlkQnU2SlVmblBSaGZCQ3g5UE8wRE9zTkYxZ0lzSjI5dU9JZ1NwOC1fMTdZZno2TmxEU1ZNUlotcld6TUM5azlBcEhYXzJUaU51OC10THA1ZER0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum en hausse après une annonce de la SEC - Voici ce que vous devez savoir ! - Cointribune EN",
        "content": "Tue 21 May 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nThe recent announcement by the United States Securities and Exchange Commission (SEC) regarding the possible approval of a spot Ethereum ETF has triggered a real price surge for Ether. This news, which could mark a decisive turning point for Ethereum, has sparked massive investor interest and propelled Ethereum to new heights. But that’s understandable, considering the stakes: a spot ETF would allow Ether to be traded on traditional markets, thus paving the way for broader adoption and potentially significant revaluation.\n\nEthereum up 18% following ETF news\n\nLike Bitcoin, Ethereum (ETH) experienced a spectacular 14% increase in value, reaching $3,540 in just a few hours. This rise occurred after a series of tweets from influential figures in the financial analysis sector. Eric Balchunas, senior ETF analyst at Bloomberg, announced an increase in the probabilities of the SEC approving a spot Ethereum ETF, raising this estimate from 25% to 75%. This optimistic update followed a tweet from Nate Geraci, president of ETF Store, thus highlighting the growing optimism regarding this approval.\n\nAccording to Balchunas and his colleague James Seyffart, the SEC might reconsider its position on this increasingly politicized issue. They noted that the general expectation was rather for a rejection of the applications for the spot Ethereum ETFs. Geraci explained that the SEC’s approval process for spot Ethereum ETFs involves two steps: the approval of exchanges’ 19b-4 rule changes and the approval of S-1 registration statements. Although the SEC might approve the 19b-4 rule changes, it could delay the approval of the S-1s, potentially postponing the actual launch of the ETF.\n\nThe market responded sharply to this announcement, leading to a rise not only in Ethereum’s price but also in Bitcoin’s (BTC), which increased by 6%, and other cryptocurrencies saw equally spectacular gains. Furthermore, QCP Capital shared unconfirmed information that the SEC may have asked cryptocurrency exchanges to update their 19b-4 filings as soon as possible. This move could signal an upcoming approval of the Ethereum ETF, although this decision remains uncertain and far from guaranteed 100%.\n\nIf the spot ETF is approved…\n\nThe approval of a spot Ethereum ETF would have major implications for the cryptocurrency market. This decision would allow investors to buy and sell shares of Ethereum on traditional exchanges, thereby increasing the accessibility and legitimacy of the cryptocurrency. Such an approval could stimulate demand and lead to a significant increase in Ethereum’s value.\n\nRecent activities of Ethereum whales, who bought more than 110,000 ETH in 24 hours, show strong confidence in the future of the crypto. This massive accumulation suggests that institutional investors anticipate a future price rise linked to the ETF’s approval. Additionally, the surge in transaction volume, which increased by 185%, indicates renewed interest and increased liquidity in the market.\n\nSimilarly, if the SEC were to approve the ETF, it could set a favorable precedent for other cryptocurrencies and encourage broader adoption of crypto ETFs.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQWko0QnJTODVWVkFOZDQtRkJnTHZwSkhMWnJMSW1GdXlEVVlob2NVdnFxYUxBeW9DXzZiU3AtTWhZZmZmazhHemY0YWliZjBUcTdrOXRycUlBMzExN1B3dnVBd1hTREhVVmZWU19fVTFjb2tGZk1hOWJGcDZEWjFGNUp3Uk94Y3RGalBNeXo1TnFjekR4amZnRUlKX0ZmRE5lYTBSZDliLURKeVhlakc5WlN4bms3YTYxbEdZdVFYY25aVmdOb04wRTVxcGlaMVRyaTV6eGRWbU5xS1RtVzQ00gHkAUFVX3lxTE9qdVV6YUN3ZzBnZnIxWlJmdEdrdlRwMGZTeTFZdC1XRnhCaFphNG05OFlZakZaZDVJUmxiN2tGREVYREhPaS1rVnF0OE81S2NUQUUtTC1LZjdtYVZfZkFkcHd0YnkyY2RkZ1VBdWlqVzY2V3h0Y0FiZkc1dzREWXFheTdwdi1sUDNMXzRkQnJyak9kRi1RQkMybm1uT2FYVGkzTVJwU2RpMzctck93TExTNFkyRjgxSDVTMUN6bWh2YTVENmRxbVRkVU9tRjdOamlMdHhkT1BSY1N0SWVWQkdGa2dYNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Trader Predicts More Rallies for Surging Ethereum Rival, Updates Outlook on Chainlink and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto strategist says he’s bullish on one Ethereum (ETH) competitor that surged by as much as 43% last week.\n\nPseudonymous trader Altcoin Sherpa tells his 216,300 followers on the social media platform X that Fantom (FTM) will see more rallies in the coming months.\n\n“FTM is going to $1-ish before any pullback and should go even higher in the next six months, in my opinion. Interesting upgrades/pivots coming here, and I have a bag. This looks strong in the short term.”\n\nAt time of writing, FTM is worth $0.856.\n\nLooking at the native asset of the decentralized oracle network Chainlink (LINK), the trader says the altcoin is in a position to ignite a breakout rally.\n\n“LINK goes to $20 if it can break past this $16 mark, in my opinion.\n\nStill wouldn’t personally buy here though.”\n\nAt time of writing, LINK is trading at $16.53.\n\nNext is the memecoin dogwifhat (WIF), which the analyst says is approaching a potential bounce level.\n\n“WIF: $2.30 should provide a bounce area. Thought it would break past the range high but definitely was wrong. Could also see the wick tapped again, too, around $1.80. Those should be good short-term bounces overall.”\n\nAt time of writing, WIF is worth $2.54.\n\nThe last altcoin on the trader’s radar is the native asset of the Solana (SOL)-based decentralized exchange (DEX) aggregator Jupiter (JUP). According to Altcoin Sherpa, JUP is currently in the process of carving a bottom.\n\n“Some of these charts look pretty good overall. JUP for example. expecting some sort of slow grind up after forming some sort of short-term bottom.”\n\nAt time of writing, JUP is trading for $1.18.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    }
]