[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBLVzhhejNEclJHUURvMXExUEFEOENWOTBTSHlRSWxzMk8xYzVRRHhob196N0xaUGNmbVZDdjNmZFJ4aVo5dWNxTlRrdnJqX0JJc3ZMNlBHTUlObXFQdVZjTk5jWE8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum is too hard to use - Blockworks",
        "content": "Anyone else think Ethereum is difficult to use these days?\n\nYeah, there’s a bunch of cool stuff on Ethereum — meme tokens, NFTs, DeFi, degens — it’s all there. But over the years as the blockchain evolved, it has become more expensive and more complicated — as in, an already complex technology for users has become even moreso.\n\nNot only do users need to understand crypto basics like wallets, irreversible transactions and addresses, they also now have to contend with getting to know different chains. You can’t just send Ethereum chain ETH to Optimism chain ETH, or Optimism chain ETH to Polygon chain ETH, unless of course you use a bridge which means that this system might be getting a little complex for many users.\n\nEthereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.\n\nHow did we get here?\n\nI wouldn’t say there’s anyone in particular to blame for this; it’s an ecosystem problem as a whole. When Ethereum launched almost 10 years ago, nobody was using it. At that time, any usage at all was welcomed.\n\nNow, it’s 2024 and there is usage. But there’s also expensive layer-1 fees. Average transaction fees on the layer-1 Ethereum blockchain are at $0.94. If a user wants to interact with a smart contract, like a DEX, fees are averaging $4.70.\n\nSome might say, “Well, maybe it’s time to examine fees themselves.” Problem is, fees are what secure the network. If validators were not being incentivized by staking and reaping fees, what would be the point?\n\nOkay, yeah, but there’s the layer-2 options, right? There are. And Arbitrum and Optimism have both transaction and smart contract fees at less than $0.02. We’re securing the bottom layer, enabling lower fees on the second.\n\nBut as a Coinbase report from late last year noted, there are so many of these layer-2s that fragmentation now exists between all of these different chains. And mainstream users, aka those who could enable mass adoption, want financial apps that don’t make things complicated.\n\nThe sandbox\n\nThe point is clearly that Ethereum is just one big-ass financial experiment. I actually wrote about this way back in 2016, about Ethereum being a fintech sandbox.\n\nAnd it has been one. When I wrote that piece, ICOs were only slowly gaining traction, DEXs were in their infancy and there wasn’t even an NFT token standard yet — just Plain Jane ERC-20s.\n\nRead more from our opinion section: BlackRock clearly wants to take crypto seriously. Too bad it’s forever silly.\n\nTimes have certainly changed. Ethereum’s “world computer” concept, the idea that people could build programmable monetary systems on a verifiable blockchain, has been a success. The Ethereum Virtual Machine, or EVM, is a standard for smart contract development — even outside the Ethereum ecosystem.\n\nThen, there’s the 2022 move to the proof-of-stake model, which to Ethereum’s credit, was pulled off with remarkable execution.\n\nYet I’ve heard of people working on Ethereum layer-3 projects now. That’s an abstraction of two layers — can anyone come up with something comparable for so many layers in technology? Maybe the OSI model? It has seven layers. But it’s used for data in networking, all running at the same speed. And there’s no fees. It’s just categorizing data.\n\nOkay, well, blockchains are just data. So then we arrive back at the fee conundrum. But blockchains are decentralized, so there has to be some incentive to support the network, right?\n\nA fee quagmire\n\nFees secure the Ethereum network, rent the computing power to do things and also limit spam. With that in mind, I suppose there have to be fees in the system — I’m not proposing some grand, new fee-less Ethereum design, that’s for the Vitalik Buterins of the world.\n\nThere are rollups, and that’s promising because they can batch process transactions off of Ethereum while lowering fees with the same level of security. Or maybe some smart startup can somehow increase interoperability — instead of reducing it by having users dig through layers like a Stouffer’s Italiano.\n\nI just am not convinced of the feasibility and long-term viability of so many bridges, some of which have been compromised. It feels like too many vulnerabilities in the margins. Perhaps a standardization of bridges is needed, and many wallets do warn users about interacting with bad smart contracts, so some safeguarding is happening.\n\nBut I’m still trying to coincide my recent experiences with Ethereum as something…\n\nVery.\n\nLasagna-like.\n\nTasty for the taste buds as a food, yes.\n\nBut isn’t it a bit complex for people to use as a blockchain? People want apps that offer free flow of money, not restrictive layers. Hopefully, Ethereum can evolve past this lasagna stage.\n\nDaniel Cawrey has been involved full-time in the crypto space since 2013, including as an editor at CoinDesk. He is author of 2020’s “Mastering Blockchain” and 2023’s “Understanding Crypto” books, both available on Amazon.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9nX2pJdno5TU5JemxNOEdsazRDV0FZQ2JaTVhlRkZtVHlyU1VRVVFYSjlTWnVNR2c3bEVBRmNfeW9aUUl6RWF2aGN5cXBfSXlPS2FWbUZDYTQzSWFkb3Q1dFlpTG10dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-7022 Proposal on Ethereum? - Unchained",
        "content": "EIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs.\n\nEthereum co-founder Vitalik Buterin and a team of developers are spearheading a new Ethereum Improvement Proposal (EIP). EIP-7702 will significantly improve smart contract functionality on Ethereum by temporarily merging it into externally owned accounts (EOA), thus simplifying and improving user experience.\n\nRead on to learn about the EIP-7702 proposal on Ethereum, how it works, its potential impact, and its benefits and drawbacks.\n\nWhat Is EIP-7702?\n\nThe EIP-7702 proposal was introduced as an alternative to EIP-3074, which was approved for inclusion in the Pectra upgrade scheduled for Q4 2024.\n\nEIP-3074 was designed to refine account management within the Ethereum protocol by allowing Externally Owned Accounts (EOAs) to assign control to smart contracts, paving the way for more advanced transaction strategies. EOAs are a type of Ethereum account controlled by users rather than code\n\nThe proposal would achieve this by introducing two new opcodes, AUTH and AUTHCALL, enabling EOAs to transition smoothly into smart contracts without deploying new ones. This would improve transaction efficiency and flexibility in interactive scenarios and complex operations.\n\nHowever, EIP-3074 faced some limitations, including technical issues and security challenges. These issues became evident in practical applications, especially when dealing with high-value or large-scale transactions. Vitalik Buterin, alongside Ansgar Dietrichs, Matt Garnett, and Sam Wilson, developed EIP-7702 in response to these issues and as an alternative to EIP-3074.\n\nEIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs. The proposal will enable EOAs to behave momentarily like smart contracts.\n\nSimply put, EIP-7702 will inherit and expand some of the functionalities of EIP-3074, such as batch processing, lowering privileges, and transaction sponsorship.\n\nHow Does EIP-7702 Work?\n\nThe proposed EIP-7702 will provide a new method for EOAs to interact within the Ethereum blockchain. Externally owned accounts will be temporarily able to operate as smart contract wallets during transactions before returning to their initial state after the transaction.\n\nThis technique improves the functionality and security of Externally Owned Accounts without launching new opcodes, making assimilation more efficient than EIP-3074. Moreover, removing opcodes from the process helps decrease complexity, compatibility difficulties, development resources, and potential security flaws linked to them.\n\nEIP-7702 has been developed to be forward-thinking, given its compatibility with ERC-4337. ERC-4337 is an account abstraction standard on the Ethereum network that aims to improve security and user experience by launching smart contract functionality in wallets. This integration can help externally owned accounts attain features such as multi-factor authentication, the potential for people to transact using any token, and social recovery.\n\nEIP-7702 can significantly reduce transaction fees by batching transactions, making the Ethereum network more efficient. The proposal promotes financial inclusion by introducing transaction sponsorship, where one user can offset the transaction fees for another user. It also makes the platform more accessible, lowering the barrier to entry.\n\nEIP-7702 also includes downscaling privileges. Accounts can limit their privileges for certain crypto transactions, boosting the platform’s security against fraudulent and phishing activities.\n\nThe Potential Impact of EIP-7702 on the Ethereum Network\n\nThe new Ethereum proposal, EIP-7702, if included in the Pectra upgrade scheduled for Q4 2024, is expected to impact the Ethereum network positively. Although currently in the discussion stage, EIP-7702 offers a robust solution to enhancing Ethereum by introducing account abstraction.\n\nAccount abstraction makes it more flexible for users to program their security better while enjoying an enhanced user experience. Lowering the barrier to entry for Ethereum enhances accessibility, potentially boosting its adoption in the Web3 ecosystem. In addition, smart contracts can provide better safety features, such as recovering funds in case private keys are lost.\n\nTransaction sponsorship also means that users can easily get started with the Ethereum network as they don’t have to worry about buying ether for gas fees.\n\nThe proposal introduces greater flexibility in the design of smart contract wallets for developers. They can customize their verification logic, incorporating features such as emergency recovery techniques, multi-factor authentication, and spending limits. This opens up new opportunities for developers to explore smart contract wallets.\n\nBenefits and Drawbacks of EIP-7702\n\nWhile still in discussions, EIP-7702 has some benefits and drawbacks linked to it. Below are some benefits of the proposal:\n\nBatched Transactions: The Ethereum network can become much more efficient through the batched transaction feature, which can also reduce transaction costs.\n\nERC-4337 Compatibilit y: The EIP-7702 is a forward-thinking proposal compatible with the ERC-4337 standard on Ethereum, which can enhance the user experience and security of the Ethereum blockchain while advancing blockchain technology.\n\nTransaction Sponsorship : If successfully implemented, EIP-7702 will enable users to cover the transaction fees of other users, making the platform more accessible for everyone.\n\nWidespread Ethereum Adoption : By lowering the barrier to entry for users, more people will be able to access and use the Ethereum platform, leading to its widespread adoption.\n\nWhile there is optimism surrounding EIP-7702, it’s not without its drawbacks. Below are some challenges with the EIP-7702 proposal:\n\nAdjusting Gas Costs : It’s still unclear how EIP-7702 will scale the gas fee costs associated with its transactions.\n\nRevocation of Transactions : Implementing EIP-7702 would mean that users relinquish the control of their externally owned accounts to smart contract codes, which, albeit need to be trusted, can be prone to malice. Therefore, the Ethereum team must ensure users can revoke and revert transactions signed using malicious code.\n\nThe Bottom Line\n\nThe introduction of EIP-7702 is expected to benefit Ethereum. Still, its implementation will depend on its developers finding solutions to the raised issues and getting consensus from the Ethereum community.\n\nAnsgar Dietrichs, one of the researchers at the Ethereum Foundation, suggested implementing EIP-7702 to the Pectra upgrade first and tracking it for several weeks before deciding whether to replace EIP-3074 with EIP-7702.\n\nIf incorporated, it remains to be seen how EIP-7702 will revolutionize the Ethereum blockchain."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5BLU5aMlctaC0tSWU1M3diQXZObHlBRWYtV2JjeDJ3V2E0YXhBdFpIbjg2dnZvZXJ5RV9VSGRONzJ5em1lWVE2cUhRQjdUenJrOWxYWnNIZ1F4S0VTVFdNbW9jOXprazDSAWxBVV95cUxOQnZpMHlFSVRFblQzMTVkVUlZcVp6V1NOT1dxbXdjT1l3bnBxNUo1QWUzOFg3RnJrQlhXOHVWLVBmWTV2bE95ekpZUWRYejV2YnBJWVUtZDZKbHI4bHQxYjlfT2xhcS1WckVxOU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ether jumps more than 20% in two days on renewed optimism for an ETF - CNBC",
        "content": "In this article HOOD\n\nCOIN\n\nBTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nOmar Marques | Lightrocket | Getty Images\n\nCryptocurrencies rose Tuesday amid a late surge in optimism around the U.S. Securities and Exchange Commission's decisions on spot ether exchange-traded funds applications, the first of which is due this week. Ether led the rally, rising more than 20% over two days to $3,710.31, according to Coin Metrics. Earlier, it rose as high as $3,835.43. \"This sudden flip in expectations is an unexpected boon for [crypto] investors who have been crying out for a driver after the [Bitcoin] halving passed and bitcoin ETFs were launched in the U.S. and Hong Kong,\" said Antoni Trenchev, co-founder of crypto exchange Nexo. \"If the spot ETH ETFs are approved, altcoins should take off as ether is often a leading indicator for the rest of the crypto market.\"\n\nStock Chart Icon Stock chart icon Ether rallies on ETF optimism\n\nThe rally began suddenly on Monday, amid reports that the SEC has requested key document updates from potential ETF issuers and exchanges. A spokesperson for the SEC said the agency does not comment on individual filings. Now, investors are considering the odds that the SEC might greenlight spot ether ETF applications. The previous consensus was that the agency was unlikely to approve the funds, based on the lack of engagement by the agency on the filings. By contrast, in the weeks leading up to approvals for bitcoin ETFs, the SEC was reported to be engaging actively with fund issuers. Final decisions on applications by VanEck and Ark Invest are due this Thursday and Friday, respectively. BlackRock, Fidelity, Invesco, Grayscale and Bitwise Asset Management also have applications awaiting decisions this year. Ether futures ETFs hit the U.S. market for the first time in October, just a few weeks after courts ruled against the SEC in a landmark case brought by Grayscale that paved the way for spot bitcoin ETFs and may have set a precedent for spot ether ETFs. The court said the SEC's denial of Grayscale's proposal to convert its popular bitcoin trust into an ETF was \"arbitrary and capricious,\" and that the agency failed to adequately explain why it approved the listing of two bitcoin futures exchange-traded products, or ETPs, but not Grayscale's proposed bitcoin ETP. Bitcoin hits the brakes As ether rallied for a second day, bitcoin and crypto stocks lagged. The flagship cryptocurrency was little changed Tuesday, holding on to a 7% gain from the previous day that pushed it above $70,000 for the first time in more than a month. Bitcoin has been rising since last week's April CPI reading showed inflation eased from the previous month, which could open the door again to lower interest rates in the U.S. Crypto-related equities initially rode the wave higher, but also pulled back on Tuesday. Coinbase and Robinhood , both plays on the trading of cryptocurrencies, were little changed, building on gains of 8% and 9%, respectively, from the previous session. MicroStrategy , which is more of a proxy for the price of bitcoin, fell 4%.\n\nStock Chart Icon Stock chart icon Bitcoin initially jumped with ether on Monday but has since pulled back"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5USmxlOVZUcWZfX1FJbHFBNUkteWdIY0otVEZEX3pPTFdtNG5zTTNKVnhrWllmZVFzWnBoeVg3N3ItTHMzbnRxQkdUMndnaHRMYW1mR0lMS2laN0ZWdW9FYVR3Y0c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval odds surge to 75%, ETH price jumps 8% - Crypto Briefing",
        "content": "Bloomberg ETF analysts change their predictions as background noises from the SEC start.\n\nShare this article\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart increased to 75% their odds of a spot Ethereum exchange-traded fund (ETF) being approved in the US. The previous odds were 25%. As a result, Ethereum (ETH) leaped 8.3% after the news.\n\nPreviously, both analysts explained that the low odds were related to the lack of background noise made by the SEC asking players about the ETF approval. However, due to political issues, Balchunas stated on X that the US regulator will “be doing a 180 on this.” Moreover, the odds at 75% are substantial, since Seyffart and Balchunas are still waiting on filing documents to boost it higher.\n\nSeyffart joked on X about being criticized by Ethereum bulls since he and Balchunas were previously quenching their hopes up until now.\n\n“Never gonna hear the end of this from the .eth people in my replies if this turns out to be true. But it’s what we’re hearing from multiple sources. Should see a bunch of filings over coming days if we’re correct,” he posted on X.\n\nThe first deadline for an ETF approval is on May 23, when the SEC must decide on VanEck’s Ethereum ETF filing. On the following day, the deadline for the ARK21 Shares Ethereum ETF also expires. The last deadline for this month is set for May 30, when the regulator must decide on Hashdex Nasdaq Ethereum ETF filing.\n\nAs reported by Crypto Briefing, not even notorious fund managers were expecting a spot Ethereum ETF approval in the US this week. Katherine Dowling, general counsel for ETF applicant Bitwise, said that “most people are universally expecting a disapproval order.” VanEck CEO Jan van Eck also predicted a likely denial during a CNBC interview.\n\nIn the last 24 hours, nearly $150 million in short positions were liquidated in crypto derivatives, according to data aggregator Coinglass. Of that total, $35.3 million were related to positions shorting ETH."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxOc1R0NEotRHhsMUd1TTRNT1V5Szl1NWk3VS1CYUR0bTFaUk9UQ1kxMmhUZ3NCdlZQZDdyWUx6RFpSWDRTRHpCYkVPYUtyMmhEY092LVZRc2NxVGhfVklJTUhLMVdIbEhFbDJ0Z2pfblh5NXR1WkJ4ODJMdGtvdDdUTXptSHBmVlkzQmsyc0RqX3Z0LW1td05Td3JDMUNObURXb1d6UDhyVm0tdW5vZXVlWklieTVhTDM4RjVtR3FtcVZDeURpY0RaZFJ4aDFtOUpSV3liWW55cG9nR3VrNml3SnJwNkZqVW8zdWRzTm1jaHQzLUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Controversial blockchain firm Prometheum launches long-awaited Ethereum custody - Fortune",
        "content": "The U.S. crypto industry has complained loudly about a lack of regulatory clarity, but one firm sees it differently. Digital assets platform Prometheum has taken the contrarian view that a clear legal path already exists to trade crypto—a stance that has drawn the ire of others in the industry.\n\nOn Friday, the New York–based company put its theory to the test by launching its long-planned custody services for Ethereum. The move is notable because Prometheum is doing so in a way that classifies the token as a security under the supervision of the Securities and Exchange Commission. The custody launch appears to validate the position of agency chair Gary Gensler, who has countered the broader crypto industry’s position by saying the existing regulatory regime is adequate and effective.\n\n“It eliminates a lot of the arguments that things can’t be done under existing laws,” said Aaron Kaplan, the co-CEO of Prometheum Inc., the parent company of the entity launching Ether custody. “It marks the first time that…an investment contract digital asset security is being custodied and treated under the securities laws.”\n\nThe wager\n\nFounded by the brothers Aaron and Benjamin Kaplan, Prometheum existed in relative obscurity before bursting onto the crypto scene in mid-2023 with the announcement that it had procured a first-of-its-kind broker-dealer license that would allow firms to custody digital asset securities.\n\nWhile much of the blockchain industry argues that the vast majority of cryptocurrencies should not be treated as securities under the jurisdiction of the SEC, Prometheum made a novel alternate claim. It argued that its special-purpose broker-dealer distinction—along with a license for a separate entity to operate an alternative trading platform—would allow it to offer trading for cryptocurrencies under existing SEC regulations.\n\nPrometheum’s wager, along with a contentious appearance by Aaron Kaplan at a House Financial Services Committee hearing on digital assets, drew withering critique from industry leaders, who argued that Prometheum’s approach would not work, and that it would not be able to launch products or find customers.\n\nFor months, Prometheum declined to name which crypto assets it would treat as securities and offer on its platforms, until February, when it announced that it would soon make Ethereum available for custody. While the launch does not constitute its full trading offering, custody is a necessary first step to facilitating trading, as customers need to have a venue to hold the assets they buy and sell. By operating both the custodian and the trading system under separate entities with approval from the SEC and the Financial Industry Regulatory Authority (FINRA), an independent industry oversight body, Prometheum claimed it had found a compliant path where competitors like Coinbase had failed.\n\nAgain, the announcement was met with vitriol, with crypto advocates fearful that the launch would mean the SEC viewed Ether as a security—a position the agency has not yet made, but has repeatedly telegraphed, and that would have far-reaching consequences for the sector. Those worries were exacerbated when the SEC issued a Wells notice against the Ethereum developer Consensys in late April that seemed to confirm the industry’s fears.\n\nPrometheum’s launch of Ether custody services, however, was delayed beyond its target of March—until Friday. Kaplan told Fortune that Prometheum Inc., the subsidiary of Prometheum that holds the broker-dealer license, soft-launched the product with a small group of companies and planned to fully launch custody services by the first week of June. Full trading, he said, would come within a quarter. He declined to provide further details on the companies included in the pilot.\n\nAfter months of threatening to upend the crypto industry’s long-held belief about the possibility of trading Ether under SEC guidance, Prometheum’s custody launch represents the first test of the company’s strategy.\n\n“It took a little longer than we anticipated,” said Kaplan. “But we didn’t really have the option of doing it a different way.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPTlV6c0JhcV93Y3pRR2NLVXcyOFVjMzNrVnJDc3RTTW9WZktOd29aclhHQ3hLVzNJamh6ZXJDV0N2OGEtbzJEOTdXQV9hVi1FR1QwWURncHZyR2FibUo5eUlGWjZGRzhDVHpORndUbnpBU0hVRE1hZExaWWZfSEJwMWRuRmR3c24t0gGQAUFVX3lxTE9ob09pNGFHQ3M0V0hHakJVSC1hUmthenZjenpfT25BXzNSelpJU0dQQVR3ak9CcDA1VDNtakNiZXNsU2NjTW9GWUVzcEpQWmRaUjFFcVpWRUNSSkRMdFpJUzhsRUJLanotcXllRW9ZUFJfY3RjeDhadHpWRXhnbUJ3czJvZVVQRGhVWVZBZF84Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Solana, Avalanche Soar as Ethereum Price Tops $3,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum are up big today—with the latter soaring on rumors that an ETH-based exchange-traded fund (ETF) could soon hit the U.S. market.\n\nThe price of Bitcoin touched $70,000, triggering a flood of liquidations, while ETH is trading over $3,500 as of writing. But the top two coins by market cap aren't the only ones seeing big gains. The entire crypto market is up, with Solana and Avalanche the top gainers.\n\nSolana, the fifth biggest coin by market cap, is up over 8% in the past day and is now trading hands for $184.17, according to CoinGecko.\n\nAD\n\nAD\n\nThe coin isn't as close to breaking records like Bitcoin is, though—it still has to rise in value by another 29% to hit its 2021 all-time high of $259.\n\nElsewhere, Avalanche is also riding high: of the top 20 coins and tokens, it's doing the best, having shot up by nearly 9% in 24 hours. It is now priced at $38.24.\n\nThe coin, which runs on a network used by developers to build decentralized apps, is the 12th biggest digital asset by market cap and last year made headlines when J.P. Morgan announced that it had used its blockchain to tokenize investment portfolios.\n\nFurther down the list of top cryptocurrencies by market cap, price surges have also hit Uniswap (UNI), Pepe, and Lido DAO (LDO) with 24-hour gains of over 18%, 20%, and 21%, respectively.\n\nEthereum, the second biggest cryptocurrency, is currently up 14% in the past day, coming in priced at $3,511. The asset shot up on news that Wall Street's biggest regulator, the Securities and Exchange Commission, could be close to approving a spot ETH ETF.\n\nAD\n\nAD\n\nSuch an investment vehicle would give people exposure to the second biggest digital currency by market cap via shares that trade on a traditional stock exchange.\n\nThe SEC approved 11 spot Bitcoin ETFs in January but has been coy on the issue of approving an ETH equivalent.\n\nA long-list of big Wall Street firms have filed paperwork to release a spot ETH ETF, including BlackRock, Grayscale, and VanEck. Up until the latest rumors, the prospects of approval seemed dim.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1GR2xDUzJSTXh1dmRqQUFwS09KVE16Ml9pb1lKVW5NQ1NSb0l1SFZaNzJ2QktCc3dCbmdMSGRpT3JrbkVQWUlfNDlHZ1RtV00xMW5oWlVHTnB1YXh2TjFpeUt6MDdQYVJydWpCLUNGOTRsd9IBd0FVX3lxTE0zWTA3QkVlQW9PX0JyUVYwMEpCYmxSeXpuOURySnFIWHpFUGk1a0hnY1NicFVpb0hrSkJseFhaUHlNUzBZNGR0OVpoYVBNVFVidGoxbk5oZk5idmd3OWFQMVJCMThQbzNvcHRobnNPcVRHdlJZMG5v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Nears Key Breakout, Eyes $4,000 Target - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, is on the verge of a significant breakout, according to prominent crypto analyst Jelle. In a recent tweet , Jelle highlighted a potentially bullish setup for Ethereum, noting that ETH was close to breaking out from a falling wedge.\n\nAdvertisement\n\nThe analyst mentioned that after reclaiming the 100-day Exponential Moving Average (EMA), ETH only needed a little push to break out from the multi-month continuation pattern, with a target of over $4,000. The falling wedge pattern, a technical analysis tool, is typically seen as a bullish indicator, suggesting that a significant price movement could be imminent.\n\nReclaiming the 100-day EMA is a crucial step for Ethereum, as it often acts as a support level, reinforcing the potential for an upward breakout. If ETH successfully breaks out of the falling wedge, it could target the $4,000 mark, a significant psychological and technical level for the cryptocurrency. This potential move could attract more investors, further driving up the price and trading volume.\n\nBullish signals emerge for ETH\n\nAs of the latest data, Ethereum is trading at $3,101, experiencing a slight decline of 0.28% in the past 24 hours. Despite this minor drop, the ETH price has shown a positive trend over the past week, gaining 4.07%. This upward momentum is reflected in the increased trading activity, with the 24-hour trading volume surging by 35.51% to reach $11.17 billion.\n\nAdvertisement\n\nMoreover, technical indicators further support the bullish outlook for the Ethereum price. The Relative Strength Index (RSI) stands at 51.93, which is indicative of bullish sentiment on the market. Notably, the Moving Average Convergence Divergence (MACD) level is at −26.25, signaling a buying opportunity for investors."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOU1QSENDM0FFR2YycG5XX2NObzdvMnBnMnlYUjVTLV9rSURkMW5zQ3haR1gxLWRoc3VYV2M0eHpMMHd3b0ROZlg1RXdiZnpWTml1MGVpVHdvdjRxOFBjWG5PU19KeFFjZHdvdG1pY0VwNWloclNONEZYUmo5R0FIUkVYa1pBR1luUW50dQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week? - Yahoo Finance",
        "content": "Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week?\n\nOn Monday, May 20th, Bloomberg ETF analyst Eric Balchunas posted on X, raising his chances of a spot ETF approval from 25% to 75%. Within an hour, the post received over one million views. Balchunas is regarded as one of the most trusted sources in the crypto ETF space after playing a role in news coverage of the spot Bitcoin ETFs, which were released in January 2024. The update from Balchunas made waves in the crypto markets, causing the price of ETH to skyrocket over 10% within minutes.\n\nDon't Miss:\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today ?\n\nIf you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nBalchunas said that he is \"hearing chatter this afternoon that SEC could be doing a 180 on\" spot Ethereum ETF applications. The SEC has been largely quiet about Ethereum ETFs over the past several months, mainly looking to make a decision on whether ETH should be classified as security or a commodity. Because the SEC has been so quiet, many have taken it as negative for the chances of a spot ETH ETF approval. However, with a final deadline for multiple ETFs on May 23rd and 24th, there is seemingly pressure on the SEC to make decisions before the deadline.\n\nTo add more context to Balchunas' post, he alluded to another tweet from Nate Geraci, a crypto ETF expert. Geraci's tweet noted that the \"SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch. Technically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here).\"\n\nEssentially, the SEC could give a partial greenlight to the ETFs, giving them time to take a much closer look at S-1s, which would allow them to better vet the applications to see how compliant they would be. This seems to make the most sense, as the SEC has been in the midst of a large debate surrounding the ETFs that could take more time than previously thought to conclude.\n\nTrending: According to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nAnother point of context is that ARK and 21Shares recently amended their application to remove staking. The move was likely made in an attempt to make their application more appealing to the SEC. While removing staking is obviously a negative for the ETF, it could play a role in increasing the odds of approval.\n\nThe buzz that Balchnas is hearing must be significant. Less than a week ago, he posted saying that he believes the odds of a spot ETH ETF are \"slim to none\", but has since raised his prediction to 75%.\n\nStory continues\n\nThe path of the Ethereum ETFs does share some similarities with the approval of the spot Bitcoin ETFs, as the SEC was largely quiet in the weeks and days leading up to the approval. While the situations are largely different, it does show that it is entirely possible that the SEC could approve spot ETH ETFs later this week despite relative silence from the SEC.\n\nA spot Ethereum ETF would be a huge milestone for crypto adoption, allowing a whole cast of new investors to access the token and could potentially send ETH to new ATHs above the $4,900 level.\n\nRead Next:\n\nHow much Bitcoin did Michael Saylor says you need to become a millionaire? The number may shock you.\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPQk9WZjJuejZFZnljbENyNnowQVlkcVlIQUFONFNFeGNRVS11aVctRXdob2JzN3BRZVRCaXg1ZFRYYVoweHlSV1NPYWVWZTRXSDFFLTcyRno5ZUxaLVlycG5vRFoxNFFjWHBLZkpLdGlVRXpZYjZBYkdPYk5YN3NudVRORmZNbDRlYnhic1pEa3paVFdfV2VtVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "BTC surges 6% to touch $70k as Ethereum ETF rumors cause market frenzy - CryptoSlate",
        "content": "Bitcoin (BTC) surged past the $70,000 mark on May 21, marking a significant milestone driven by a flood of investment into spot Bitcoin exchange-traded funds (ETFs) and a broader market rally.\n\nBitcoin’s price climbed to $70,325, a 6% increase over 24 hours, before settling at $68,700 as of press time, based on CryptoSlate data.\n\nEthereum (ETH) arguably led the rally over the past couple of hours — experiencing a staggering 14.5% rise within an hour on Monday amid speculation that the US SEC might approve spot Ethereum ETFs.\n\nETH climbed from $3,143 to $3,518 as of press time.\n\nRenewed interest\n\nThe renewed interest in Bitcoin ETFs follows weeks of outflows, with nearly $1 billion flowing into these funds, providing investors with exposure to the leading digital asset.\n\nThe surge has led to significant liquidations in the market, with over $235 million in positions closed in the past 24 hours, including $63 million in Bitcoin short positions alone, according to CoinGlass.\n\nAnalysts indicate that most on-chain metrics suggest the beginning of a bull market despite some showing signs of potential peaking. The recent bounce near $60,000 has sparked renewed interest, with Farside Investors reporting approximately $950 million in inflows last week, a level not seen since March.\n\nBitcoin’s 51% year-to-date gain reflects investors’ anticipation of US monetary expansion, evidenced by the M2 monetary base surpassing $21 trillion in April 2024. This increase in circulating money suggests rising inflationary pressures despite a period of company and individual spending hesitancy.\n\nMeanwhile, the Federal Reserve’s efforts to manage inflation and avoid a recession could affect liquidity and the attractiveness of assets like Bitcoin.\n\nScarcity\n\nBitcoin reached a new all-time high of $73,737 in March and is now just 5% below that level. The recent run appears to be largely driven by the new Bitcoin ETFs, which trade on traditional stock exchanges and allow investors to buy shares that track the price of the asset.\n\nSupporting the bullish sentiment, Bitcoin reserves on major exchanges have dropped to a seven-year low. Data from CryptoQuant shows only 1,918,417 BTC available on major trading platforms as of May 19, a significant decrease from the previous year.\n\nThis scarcity, coupled with the recent halving event that reduced the potential new supply from miners, makes a bearish outlook on Bitcoin increasingly difficult to justify.\n\nThe crypto community continues to watch closely as Bitcoin’s price action unfolds, with many wondering whether the digital asset will continue its ascent or face a significant correction in the coming weeks.\n\nBitcoin Market Data At the time of press 11:11 pm UTC on May. 20, 2024, Bitcoin is ranked #1 by market cap and the price is up 4.93% over the past 24 hours. Bitcoin has a market capitalization of $1.37 trillion with a 24-hour trading volume of $38.97 billion. Learn more about Bitcoin › Bitcoin $69,608.54 4.93% Crypto Market Summary At the time of press 11:11 pm UTC on May. 20, 2024, the total crypto market is valued at at $2.57 trillion with a 24-hour volume of $102.43 billion. Bitcoin dominance is currently at 53.41%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQVC1oM1MwMTEyWjNlSXUzb281LU02R003M2tWR1AzT3c4emRDMTRNdjRkRUVoZUpvN3VLeWl6Ynk5U0x6a3VhZWI1WThfUDl5OGZjTGh3WFZCcEFFY1JWUnBtV2FMTjZJN25aVjlSVG1CYjNCaXdwWjMwbzdQYkxDQmJpNjZfMlIwUS1hSzVYX1l2TFRoQm1Zb2hicTFpOUhDQ1FUcmVHUWFhXzVMOFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "The Approval of Spot Ethereum ETFs Is Not Going as Planned - FX Empire",
        "content": "Understanding Spot Ethereum ETFs\n\nBefore discussing the features of spot Ethereum ETFs, it is essential to emphasise that they have yet to be approved for trading in the U.S.—but futures Ethereum ETFs have been available for quite some time. Therefore, it is essential to understand the difference.\n\nIn a spot market, assets such as commodities, currencies, and securities are exchanged for immediate delivery. The same is true for the much-anticipated spot Ethereum ETFs, as they offer a more straightforward and transparent approach than futures ETFs, which buy derivatives without directly owning the asset. By purchasing cryptocurrency directly, the fund tracks the price of the benchmark cryptocurrency more accurately. Due to the more straightforward purchase process, such an investment offers greater profitability and lower management costs. This is the reason for the public excitement around the approval of the spot Ethereum ETF, scheduled for 23 May 2024.\n\nSo What About the Approvals?\n\nThe U.S. Securities and Exchange Commission (SEC) remains concerned that cryptocurrencies are often involved in fraud, which may cause speculative bubbles and cause investors to start considering this currency type safer after approval. Spot Bitcoin ETFs were only approved after the U.S. Court of Appeals ruled against it in August 2023, which essentially forced it to take action.\n\n‘As a basis, we have that the U.S. SEC is still conservative in its views,’ said Kar Yong Ang, the Octa broker’s financial market analyst.\n\nAt the time of writing, the editing process for the filing cases is transparent. The 10 May 2024 updated filing for the spot Ethereum ETFs shows that Ark Invest and 21Shares have opted out of staking, meaning the funds are adjusting to the regulator’s requirements. Roughly the same thing is happening with other applications. In late April, the commission postponed its review of Franklin Templeton’s application with a deadline of 11 June. In May, the SEC postponed a decision on Invesco and Galaxy’s application. Before that, the agency extended the review period for a similar application from BlackRock. May 2024 is the deadline for proposals from VanEck and Grayscale.\n\n‘After the decision on VanEck’s application, investors will be able to understand what will happen to the other investment companies that have applied,’ commented Kar Yong Ang, the Octa broker’s financial market analyst.\n\nBreadcrumb Trails Lead to Launching Funds\n\nDespite scepticism on the legal side of the issue, two factors indirectly report increased investor interest in the second most crucial cryptocurrency.\n\nGrayscale Investments has withdrawn its application to create an Ethereum-based futures ETF. According to the speech of its CEO Michael Sonnenshein, Grayscale Investments will focus on converting its Ethereum trust—the world’s largest—to spot exchange-traded products.\n\nTraders are getting rid of Hong Kong Bitcoin ETFs and Ethereum ETFs. So, on 13 May 2024, a record was set for capital outflows from the funds: derivatives lost $39.3 million in one day, BTC-backed assets lost $32.7 million, and ETF-backed assets lost $6.6 million.\n\n‘It’s clear that the outflows are not only due to the correction in the Bitcoin price during this period’ said Kar Yong Ang, the Octa broker’s financial market analyst. ‘Such ETF flows suggest investors are looking at more interesting and profitable funds,’ he added.\n\nThe future of spot Ethereum ETFs looks promising due to the recent success of spot Bitcoin ETFs. However, it still depends on the regulator’s decision and the actions of investment fund representatives. The decision to approve spot Ethereum ETFs may likely be postponed, which does not cancel its approval. In our opinion, there is potential for growth in these two cryptocurrencies in the combination of such factors and in the conditions of local correction in Bitcoin and Ethereum quotes.\n\nAbout Octa\n\nOcta is an international broker that has been providing online trading services worldwide since 2011. It offers commission-free access to financial markets and various services already utilised by clients from 180 countries with more than 42 million trading accounts. Free educational webinars, articles, and analytical tools they provide help clients reach their investment goals.\n\nThe company is involved in a comprehensive network of charitable and humanitarian initiatives, including the improvement of educational infrastructure and short-notice relief projects supporting local communities.\n\nOcta has also won over 70 awards since its foundation, including the ‘Best Educational Broker 2023’ award from Global Forex Awards and the ‘Best Global Broker Asia 2022’ award from International Business Magazine."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSXFZTDVsNEliTUpoOGcwVUNReXp6Wm1kS2REX3AyWFVVRG9scUZkUEFaMWp0MzFXbG9qY1JEUzNMekJXdGpEMDM3dmVneWtJbUJqUmVkWHpJeW1qRmhkZGE1enh0dDdZV2h1b05mN0hWbWRpMFZwSWJvRmQ5aUNyOXJ0eHVmZFpJLXNGLWFPN2xXeU5IamdydkhGMHNaYjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum soars as odds of ETF approval jump to 75% — ‘SEC could be doing a 180’ - DLNews",
        "content": "Bloomberg Intelligence ETF analyst Eric Balchunas says the odds of the SEC approving the Ethereum ETFs have greatly improved.\n\nThe SEC's sudden change of attitude is leaving everyone scrambling, Balchunas said.\n\nHe upped his odds of approval to 75%, from 25%.\n\nThe odds that the Securities and Exchange Commission will greenlight Ethereum spot exchange-traded fund applications have just increased.\n\nBloomberg Intelligence ETF analyst Eric Balchunas, long bearish on the products’ odds, posted on X that chances of approval have shot up to 75% from 25%.\n\nBalchunas said he was “hearing chatter this afternoon that the SEC could be doing a 180 on this (increasingly political issue), so now everyone is scrambling (like us everyone else assumed they’d be denied).”\n\n“It’s what we’re hearing from multiple sources,” Bloomberg Intelligence ETF research analyst James Seyffart said. “Should see a bunch of filings over coming days if we’re correct.”\n\nEthereum soared 8% off Balchunas’ tweet, recently trading at $3,400.\n\n“If the spot ETH ETF is approved, it will be a true shock to everyone I know in DC who’s close to this process,” Jake Chervinsky, chief legal officer at Variant fund, posted. “It means approval could signal a major shift in US crypto policy after the SAB 121 vote, perhaps more important than the ETF itself.”\n\nLast Thursday, the Senate voted on a resolution to repeal a controversial accounting guidance from the SEC, called SAB 121, which critics say has deterred investment banks from offering crypto custody at scale.\n\nPresident Joe Biden indicated that he would veto the provision if approved. Prominent Democrats, however, have sided with their Republican colleagues against the rule, raising speculation that the White House may back down.\n\nJoin the community to get our latest stories and updates\n\nDeadline\n\nIf the SEC wants to approve the Ethereum ETF products, it will have to be fast about it. The deadline for VanEck’s Ethereum ETF application is on Thursday — and the SEC is unlikely to approve some of the filings ahead of others in order to avoid playing the role of a kingmaker.\n\nNate Geraci, president of ETF Store, said that even with the tight deadline, it would be possible for the SEC to approve one set of important filings, called 19b-4s, before the deadline, and then “slow play” the second set of filings, called S-1s.\n\nThe SEC must approve both set of filings before the ETFs could come to market.\n\nBalchunas had previously told DL News that in light of the reported lack of engagement from the SEC with prospective issuers, Ethereum ETFs were unlikely to get approved before the end of 2025.\n\nIf the ETFs are rejected, issuers will likely wait until after the US presidential election to file again, because a victory for presumptive Republican nominee Donald Trump would probably mean a change of leadership at the SEC — perhaps in favour of someone less antagonistic toward crypto than current chair Gary Gensler.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSnNCeEtKYi1WeDJIbnhfNWJucDh0ZDltVWQybThnUm9iLWwtUTF0VVFrQS1uaHhpWlhrWEhjcE9HLVRmTnUzU3RYNU1ZbUJmY2Z4RXE2TE1kRWFmNTJkNlBJU3BRZXM1R05sOENKNXhtZWtVQmQ5dkh0ZG5rNHFtUzh2VzVqLTlaZ25WNV8tUFhybF91dGZVOW1EbW9LeFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Funds See $23 Million Outflows Amid ETF Speculation - Crypto Times",
        "content": "Investors poured $932 million into digital asset products this week, but Ethereum (ETH) crypto funds bucked the trend, experiencing outflows exceeding $23 million, according to CoinShares, an asset management firm. Analysts attribute these outflows to growing concerns about the US Securities and Exchange Commission (SEC) approving a spot Ethereum exchange-traded fund (ETF).\n\nInvestors favored Bitcoin, with $942 million flowing in, and minimal short positions, indicating positive sentiment. Altcoins like Solana, Chainlink, and Cardano saw inflows of $4.9 million, $3.7 million, and $1.9 million. However, the weekly trading volume was only $10.5 billion, significantly lower than March’s $40 billion.\n\nImage Source: CoinShares (ETF Flows by Providers, Asset & Country)\n\nIn terms of regions, the US led the way this week with inflows of $1 billion. Grayscale, after experiencing significant outflows totaling $16.6 billion since its ETF launch in January, saw its first inflows of $18 million in a notable shift. Following the US, Switzerland and Germany also saw minor inflows, amounting to $27 million and $4.2 million, respectively.\n\nBlockchain equities have had a tough year, with outflows recorded in 14 of the 20 weeks so far, resulting in a cumulative outflow of $512 million.\n\nThe SEC’s potential disapproval of an Ethereum (ETH) exchange-traded fund (ETF) reflects its cautious approach towards crypto regulation. Concerns about market manipulation, investor protection, and the underlying infrastructure of Ethereum may influence their decision.\n\nAdditionally, the lack of clear regulatory guidelines for cryptocurrencies creates uncertainty, making it challenging for the SEC to greenlight such products. Until comprehensive regulatory frameworks are established, the approval of an ETH ETF remains uncertain, impacting investor sentiment and market dynamics."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOYXFqcWxDZTVXdXdiNU1fQ293UmxHWlo4eXh1cUpseUdsbUlFb01tcGxKa1piWVJnNWNuZTBjZFhCckZlZGVXX2VRMjlqYzc5NTFOWFhKc0ZHZ3RpTFVDLS1WVzMwbnpJOW80YURDWmFTUGVDQlJlQUhmNm9JWDc0ZXRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Surges Above $3K Mark Amidst Unforeseen Court Ruling - Yahoo Finance",
        "content": "Ethereum Price Surges Above $3K Mark Amidst Unforeseen Court Ruling\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced a notable price rally over the past 7 days, with a 5.36% increase that brought its price close to the $3,100 level. Analysts attributed this surge to stalling retail sales data in the United States for April, raising expectations of a potential interest rate cut by the U.S. Federal Reserve to stimulate economic growth.\n\nETH's surge was also influenced by a court ruling and a U.S. Department of Justice indictment. The indictment, unsealed on May 15, accused two individuals of wire fraud and money laundering through the manipulation of the Ethereum blockchain. The court document emphasized that Ethereum operates as a decentralized blockchain without the need for a trusted intermediary, boosting confidence among ETH investors.\n\nThis came after the U.S. Securities and Exchange Commission issued a Wells notice to Robinhood, a trading platform, over alleged securities violations related to crypto listings and custodian operations. The verdict contradicted regulators' classification of ETH as a security, as it highlighted the absence of management or entrepreneurial efforts by others within the Ethereum network.\n\nThe U.S. SEC is expected to announce its final ruling on VanEck and ARK Invest’s spot Ethereum ETF request on May 23 and May 24 respectively. While analysts predict approval odds below 35%, the case for classifying Ether as a security instrument has weakened, contributing to the rally above $3,050 on May 17."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5kUWQxQjRuZzB4X1d3ekltQjNmcHYtNlVsa1lMYmdwaXc5RWxLT2FCYkExd2JZRmg1T0xkR2YzaldpRXBxR1lfODRQV0ZSbWlrSHdPWTQ5LUZOcF95b2NLWkg1S05UdFoxaVdoTlJn0gF2QVVfeXFMTUY0TU1FLWNlbXlsaFBzNURHdzVIMWtZdEFxNE52R0g4QS1kRExUX19HLVU2YUNZZkcxVXRhMlJQNE0zQ0RWb3BLS2FTV2o0dVU5RThEdVBCaTI2ZVJLeVlxbkZsMFAySnM2TWI3WFI4T1RFSWVqdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Spikes 9% Within Minutes on ETF Approval Rumors - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of Ethereum spiked by 9% in a matter of minutes Monday afternoon amid speculation from analysts that the United States Securities and Exchange Commission will indeed approve spot Ethereum exchange traded funds (ETFs).\n\nEthereum jumped from a price of $3,143 to $3,428 in a span of approximately 20 minutes, per data from CoinGecko. Its 24-hour jump sits at 11% as of this writing, based on the current price of $3,410.\n\nBloomberg analysts Eric Balchunas and James Seyffart now say they're 75% sure that the SEC will approve applications starting this week, following a previously bearish streak that saw them estimate the chances at 25%.\n\n\"Hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone [is] scrambling (like us, everyone else assumed they'd be denied),\" Balchunas tweeted.\n\nAD\n\nAD\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nPrior to Monday, analysts had pinned their pessimistic outlooks on a lack of meaningful engagement between the SEC and nine asset managers that had filed applications for spot Ethereum ETFs, including BlackRock, Fidelity, and Ark Invest/21 Shares.\n\nThe Wall Street Journal reported that the SEC asked the asset managers on Monday to submit amended 19b-4 forms in the days ahead, fueling speculation that the agency indeed plans on taking action towards potential approval of spot Ethereum ETFs.\n\nFiling with the regulator last year, VanEck expects a decision on its application by Thursday. The next day, the agency will be due to respond to an application from Ark Invest/21 Shares, which removed language regarding the staking of the ETF’s funds earlier this month.\n\nAD\n\nAD\n\nEven though the SEC could approve so-called exchange rule changes that give an exchange, such as the Nasdaq, permission to list a spot Ethereum ETFs, each asset manager would need its registration statement approved for the ETFs to launch, said investment advisor and ETF Store President Nate Geraci on Twitter.\n\nThe process through which Ethereum tokens are delegated to the network in exchange for rewards has come under fire in lawsuits brought by the SEC. The agency has alleged that some companies, such as Coinbase, are in violation of securities laws by offering staking services to customers because they allegedly resemble securities as so-called investment contracts.\n\nThat said, Coinbase denies that its staking services are a securities offering. Still, the Ethereum software giant Consensys claimed that staking is core to the SEC’s internal view that Ethereum is a security, as alleged in a lawsuit filed by the company against the SEC last month. (Disclosure: Consensys is one of 22 investors in Decrypt).\n\nAs Ethereum surged Monday, momentum shifted instantly on the blockchain-based betting site Polymarket. Skyrocketing from a 13% chance the day before, traders penciled in a more than 50% chance that spot Ethereum ETFs would be approved by month’s end, as of this writing.\n\nHowever, the figure was below a 76% chance traders foresaw in January amid the launch of spot Bitcoin ETFs. But optimism towards the potential approval of spot Ethereum ETFs was reflected in existing products that already offer exposure to Ethereum’s spot price.\n\nShares in Grayscale’s Ethereum Trust (ETHE), for example, traded at a 20.5% discount relative to the funds’ crypto holdings, according to data from YCharts. Tightening over the past month-plus, the discount had widened as far as 26% in April after narrowing to 8% in March.\n\nETHE’s discount stems from the product’s structure as a closed-end fund, where shares can’t be redeemed by financial-market participants to keep its price in line with Ethereum’s. A similar discount that plagued Grayscale’s Bitcoin Trust evaporated after the product was uplisted into a full-fledged ETF in January.\n\nThe SEC has recently faced bipartisan pressure over a crypto-custody rule that lawmakers voted to erase last week. Sitting on President Biden’s desk, the measure received support from high-ranking democrats, such as Senate Majority Leader Chuck Schumer (D-NY).\n\nAD\n\nAD\n\nCompared to anti-crypto politicians like Elizabeth Warren (D-MA), the move to correct the SEC’s policy represented a break. It followed an event hosted by former President Donald Trump, where he slammed the SEC’s toughness on crypto and vowed to support the industry in front of holders of his NFT collection at Mar-a-Largo.\n\nEditor's note: This story was updated with additional details after publication.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObmN6enI2SXpqc3lXOW9BS1pEOVdIWWFiRjZsa2VJT3c5aWhpcjhjeUtxTTFNTnlZTllEV1JhYUNrenZSUkM5WkNtaUJneXRjc0RiVHh1RmMzR2V4cWlyLXRyRXItVlEzUnFFbktldVRSenIySGlaSVpWV1N3WjJYNmYyd1ZEa213OFV1Qm5WNHpMNVRZd3JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "IBC to Ethereum: Building the interconnected Internet of Blockchains - CryptoSlate",
        "content": "Since the advent of Bitcoin in 2009 and the explosion of innovation that followed, the web3 industry has faced many challenges. Beyond dealing with regulators, improving UX, and weeding out bad actors, blockchain engineers continue to tackle two major hurdles: scalability and interoperability.\n\nWhile many Layer 2s are working to scale Layer 1s like Bitcoin and Ethereum by improving throughput and reducing transaction fees, protocols like Union enable both—interoperability at scale.\n\nThe need for blockchain interoperability\n\nWhatever your opinion on the WEF, its 2020 whitepaper on blockchain interoperability hit the nail when it stated, “Organisations do not want to find themselves on a blockchain platform that may limit their options for external collaboration in the future.”\n\nTo elaborate further on that point, imagine having a Gmail account, sending a message to a Yahoo account, and being unable to exchange communications. The internet was able to develop as quickly as it did because it factored in interoperability from the early days, and blockchains must do the same.\n\nA notable player in the interoperability space is Cosmos, whose flagship Inter-Blockchain Communication (IBC) protocol has enabled a host of sovereign chains to connect, transact, exchange, swap tokens, and perform other actions without compromising sovereignty. Map of Zones shows 91 zones now connected via IBC transacting more than $2.1 billion over the last 30 days in more than 8.7 million transactions.\n\nIBC isn’t limited to Cosmos chains, either. The trustless interoperability protocol has broadened its scope to include EVM-compatible chains such as Ethereum, Polygon, and Avalanche. However, most bridging solutions so far have been offered by centralized providers, meaning users must trust the bridging protocol.\n\nUnion provides a permissionless bridging protocol that connects modular blockchains and rollups trustlessly, without depending on trusted third parties, oracles, multi-signatures, or MPC, using advanced zero-knowledge (ZK) cryptography.\n\nAlready connecting several ecosystems, Union recently announced a partnership with L2 developer Polygon Labs that will tap into Polygon’s AggLayer “to facilitate message passing and asset transfers between the Polygon ecosystem and IBC-enabled chains,” bridging two of the largest blockchain ecosystems: Polygon and Cosmos.\n\nPermissionlessly bridging Polygon, Cosmos, and beyond\n\nUnion founder and prior CTO at Composable Finance Karel Kubat told CryptoSlate, “It’s not just a Cosmos to Polygon bridge but anything that’s IBC-enabled, which includes Scroll, and soon Arbitrum, Berrachain, Movement Labs, M2… They can build and connect into the Agglayer using Union,” permissionlessly tapping into the liquidity of one of the largest blockchain Layer 1s, Ethereum.\n\n“Right now it’s very interesting because we have big L1 ecosystems that really only have permissioned centralized bridges or something in between. You need to go to the bridge provider to get support for a small ecosystem. What Union does, is if you’re building a new Cosmos chain or a new rollup that’s IBC enabled, you don’t need to go to a centralized provider to get support. You just open the connection to Ethereum and you’re done… So we’re going quite quickly from a world with only 200 to 300 ecosystems to a world with thousands and thousands.”\n\nThis type of seamless interoperability isn’t possible with centralized solutions because the “wait queue” is too long. Every chain wanting to connect needs to request the bridging protocol’s permission.\n\nWith Union, chains can permissionlessly open a channel with Ethereum, enabling a seamlessly interconnected future… of potentially millions of chains. Karel gives the example of dYdX, one of the largest decentralized exchanges that began as a smart contract on Ethereum and moved ecosystems to become a sovereign Cosmos app chain.\n\n“We all went into crypto for sovereignty,” he says. “Any successful smart contract is contemplating going to their own L2 or app chain.” This means the total addressable market for Union is potentially vast. “It isn’t anyone that wants to build a blockchain. It’s any existing app on Ethereum and Solana that could benefit from making this move.”\n\nUnion’s IBC to Polygon bridge should be completed by the end of this year and you can keep up with the latest developments by following Union on X.\n\nMentioned in this article"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQN1JwUS1KcnZ6Nks4Zm92UEd3a1ZyNEhXVVFxWHlYMHZjT2psU2pSWVJNOHQtTUY1cnVZT1R5b21QOGI2M3ZLb2dBU3FGa1pqSXNZekpmazkyRWNES0pPUkQxaWRSSThES0RuTm02NTJxSmdLV2MyRVZWdFpWdkU3bm16dkJWZzFIX09tRGlPRjlpLXVualpzZmo1ZHJ3d3ZF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "SEC Approval for Spot Ethereum ETFs Depends on 19b-4 Filings - Crypto Times",
        "content": "The President of the ETF store, Nate Geraci, offers insights as the SEC’s decision on spot Ethereum ETFs nears, with approval depending on the SEC nod for 19b-4s (exchange rule changes) and S-1s (registration statements).\n\nSEC decision deadline this week on spot eth ETFs…\n\n\n\nSEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch.\n\n\n\nTechnically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here). — Nate Geraci (@NateGeraci) May 19, 2024\n\nSpot Ethereum ETFs directly hold Ether as assets and trade like stocks on exchanges, requiring a crucial 19b-4 filing for listing on NYSE or Nasdaq and seeking SEC approval. The S-1 registration offers detailed insights into the ETF’s structure, management, and Ethereum replication strategy.\n\nThe SEC must approve both filings for public ETF sales. The statutory review period is typically 45 days, extendable to 240 days. However, delays are possible, especially in S-1 approvals, reflecting caution amid crypto complexities.\n\nApproval could propel Ethereum adoption, offering regulated investment avenues. Conversely, a delay or denial might signal ongoing regulatory concerns. Ethereum’s price saw a partial rebound to $3,100 over the weekend as the decision nears.\n\nThe SEC’s cautious approach amid crypto complexities may prolong the approval process, impacting market sentiments and mainstream Ethereum adoption."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9yRXpjMEhVYk9talpuNVg3YmVTT2ZnMFZLRXN0aXlNQTZMVU4tNVo1YUZBNlA5WlY4X2pUWVlqdTI3QnNTMmo5ZkNIOFZpbHJVcXNhM3pfeGFSTVBZc2hJcFB1SzJVbmllOC15cTFqUWo2OXQ5Q19F0gF_QVVfeXFMTmNEMW1oZGNNOUk4UzctcjdnQkhJalBEdkxVRy1XU3lUeEhJR0Qyek16QTBwQU0zdlNaVE55RW43Y2tOVDNOLTN5TGUydlk3SXM2dnkxSEhFVHMtUTJTaUlLMkcwQTdwTnZqOFRYdDBXNXJjWHR4c0YzQ1hWUDgybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Soars 20%, Lifting Arbitrum and Optimism - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRumors of a potential approval of Ethereum spot ETFs have fueled a full day of gains for the Ethereum ecosystem, with the price of ETH skyrocketing 20% intraday to just shy of $3,700—trading at $3,687 at time of writing—and sister tokens Arbitrum (ARB) and Optimism (OP) both notching gains of 18% on Monday.\n\nThe optimistic mood had already spread to other cryptocurrencies, including Solana (SOL) and Avalanche (AVAX), which are peaking above $40 and $188 respectively, as of this writing, representing more than 25% gains over the last seven days for both.\n\nThe sudden rally to start the week was sparked moments after two Bloomberg ETF analysts—Eric Balchunas and James Seyffart—revealed their joint prediction that the Securities and Exchange Commission “could be doing a 180 on this increasingly political issue” and approve Ethereum spot ETFs when its first major deadline comes later this week.\n\nThey increased their estimated odds of approval to 75%—a huge upgrade from their prior estimate of 25%, which was already more pessimistic than other analysts who placed the chances at 50-50 earlier this year.\n\nAD\n\nAD\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nCrypto oddsmakers are certainly shifting their views, with the collective probability of an Ethereum spot ETF approval by the end of the month leaping from 10% yesterday to 61% on Polymarket, as of this writing. Optimism had been declining steadily since the betting option appeared in January at 76%, when Bitcoin spot ETFs were unleashed.\n\nAs with the long and meandering Bitcoin spot ETF approval process, the SEC has systematically delayed making a decision on the Ethereum equivalents. Hopes for approval had dimmed, with fears peaking that this week's deadline would prompt the federal regulator to outright declare Ethereum a security, decisively separating it from the commodity status enjoyed by Bitcoin.\n\nLate last week, however, a debate on Capitol Hill prompted many Democrats to join Republicans in defiance of Pres. Joe Biden's pro-SEC stance, a significant battle in a broadly partisan war over U.S. crypto policy.\n\nAD\n\nAD\n\nI don’t think people appreciate how huge that vote was. Warren had a strangle hold over financial policy under the Dems. This is showing the WH and Senate Dems are starting to realize that’s toxic to their election odds. They also realize there are *a lot* of moderates,… https://t.co/w8gsmw6BIn — Adam Cochran (adamscochran.eth) (@adamscochran) May 20, 2024\n\nMeanwhile, leading cryptocurrency exchange Coinbase said it saw Ethereum spot ETFs as an eventuality—if not immediately approved on May 23.\n\nAll of this came as top coin Bitcoin was in the middle of its own rally, the price of BTC clearing $70,000 earlier in the day amid massive short-position liquidiations—heights not seen since April 12, and approaching the $73,737 all-time high set in March.\n\nThe good mood was contagious, and by late Monday, the top 25 cryptocurrencies by market cap were all green for the day—and for the prior 7 days.\n\nAmong meme coins, Bonk and Pepe are both up more than 20% in the last 24 hours."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE96LU9TZGpyNXFRQ0ZWMmFGeVF3bXFJbGhCMnU4cTVUalJhSVJUWkpmclR3QVZtaGpxaXdfRWxVTWZDalVDeFo2Y3ZrT0pKN3pwNUJWNVpXeG5xSzRuQUMyWW930gFnQVVfeXFMUFFZYWN6dm9CanU2a2Jqc3RpdWkyNjdYUTdGcXJGajhZSUZVZ1dhX1FjXzlCRVFWazN0dnhFYng1RUJ3WF9oRGdnY1Qxd2dSZ2xrajMzei15cndLbWNiV3c5Z01ZbHhudw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Why Is ETH Price Falling Despite SEC Approving All Spot Ethereum ETFs? | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum’s (ETH) price has failed to make any significant rally following the Securities and Exchange Commission’s (SEC) approval of the Spot Ethereum ETFs. This is undoubtedly surprising, given that the approval was expected to spark a massive price surge for the second-largest crypto token.\n\nWhy ETH’s Price Has Failed To Rally\n\nEthereum’s price may have failed to rally because the crypto token was already priced into the news about a potential approval. It is worth noting that ETH’S price rallied by almost 20% earlier this week when Bloomberg analysts Eric Balchunas and James Seyffart increased their approval odds from 25% to 75%, suggesting that approval was almost likely.\n\nTherefore, this could have turned out to be a typical ‘sell the news’ event, with many traders currently taking profits from their earlier ETH investments. NewsBTC reported that Ethereum whales had bought over 110,000 ETH ($341 million) between May 19 and 20 as they positioned themselves ahead of any news regarding a potential approval of these funds.\n\nMeanwhile, historically speaking, this could have been expected from ETH’s price, considering that Bitcoin (BTC) experienced a significant drawdown following the approval of the Spot Bitcoin ETFs.\n\nHowever, it is worth mentioning that unlike the Bitcoin ETFs, which began trading immediately, these Spot Ethereum ETFs won’t start trading just yet. The SEC only approved the exchange filings (19b-4s) and will still have to approve the registration filings (S-1s) for these funds to begin trading.\n\nThe fact these Ethereum ETFs won’t begin trading just yet could be another reason why ETH’S price hasn’t reacted positively to this development. As such, approval of the registration filings, which may take weeks or months, may be needed to spark another rally for Ethereum and other altcoins by extension.\n\nA key positive is that ETH is up by over 28% in the last seven days, which is a big deal considering that the crypto token has lagged for a while now and failed to match up with other major-cap crypto tokens.\n\nAnother Reason To Be Bullish On Ethereum\n\nThe approval of the Spot Ethereum ETFs is a clear indication that the SEC doesn’t consider ETH a security, contrary to earlier reports that the Commission might have held this belief for some time now.\n\nTuongVy Le, a General Counsel at Anchorage Digital, noted in an X (formerly Twitter) post that funds whose assets are 40% or more securities may not register through a form S-1 but through Form N-1A or N-2.\n\nTherefore, if the SEC considered ETH a security, it would have rejected the S-1 filings made by the various fund issuers like BlackRock since these Ethereum ETFs will hold ETH as their major assets.\n\nAt the time of writing, ETH is trading at around $3,803, according to data from CoinMarketCap.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQSk1lbFhvSVNHb2U1YXhVRFlaVkwwWTJMTzNNLXJkdFJ2N0NtMkpTODc3a2RaWFZJbEM1NUZmWm9EaVkxWlhvYzNFR29ucEltc2hqTmJHZEx4Um1RZ0JjbHkwQ2N3YU0yaVB5Qks5STFUSkx2d1F6ZW1aVTl3UnRmbzBBZUdBOUpZS0RGZ3ZRektNbzIxVGEyeWJiVkE0cmUyOGRjWl8wdWtfN1Y5UUhmVnhDNElOeGdONmRCUnhtZkFLRVd3LVZYbGlRYm54anfSAdQBQVVfeXFMT2R4V1NXU2VUTE9NYlNoNTVSS01UdFVHcXVKS0s0dmlNUDZBZk90aDlscG1MLUJYWW15VUNJV1B0bnRaUVRVd1V6bEdoU1VXWHQ1NUhnaGVmajhXakV1ZlVsWHRSZjFDTW5HN3RLY0RIQ2dhd3YzR1piYU44bVl2cGplNVY1alYxZEFsbm5OTkRQbjlldVBJeEt5d0cwZjZfSkNRZXhEZmFwbHYxQ1kxdl8wOXRaNFdhNFFTSTBuM2FLdUU1QzlLaXZuamdjSzVHbUFaeks?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Predicts Ethereum Season, Says Solana Following in Footsteps of ETH’s 2021 Market Cycle - The Daily Hodl",
        "content": "A popular crypto analyst says that it’s likely Ethereum’s (ETH) time to shine and that its biggest rival is in for a parabolic run.\n\nPseudonymous trader Inmortal tells his 213,900 followers on the social media platform X that Ethereum will rally and leave many traders on the sidelines.\n\nThe analyst lays out an initial target of about $4,000 with a chart suggesting that ETH found support at around the $2,800 level.\n\n“ETH season about to start.\n\nFueled by disbelief, as all the other times.”\n\nAt time of writing, Ethereum is trading for $3,107.\n\nThe analyst also has his eye on Ethereum rival Solana (SOL). According to Inmortal, Solana has so far resembled Ethereum’s 2021 market cycle, and if SOL were to continue, it could be trading well above the $360 mark later this year.\n\n“ETH 2021 vs SOL 2024”\n\nSOL is trading at $177.54 at time of writing.\n\nLooking at Bitcoin (BTC), Inmortal says that the crypto king is currently in a range between $74,000 and $56,000. If BTC manages to convincingly hold the $66,000 level, the trader says that another run-up to all-time highs is possible.\n\n“BTC KEY levels.\n\nPrice rejected at first level of resistance (mid-range)\n\n> IF price manages to reclaim mid-range, THEN range high ($74,000) is on the table.\n\n> Below blue box = bad\n\nVery simple.”\n\nAt time of writing, BTC is trading at $67,024, slightly above Inmortal’s mid-range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5hVWYyU2UxR3pXUnFoOU0wMnlicUZBdml6d1hTeG9YMGlZUk5VOFBBZXZ5Y0RGTnl1c3NSUDFFOEpKeS1zVnlsVmZPTUNuRzgwSW5uZUFHZzFIRzFjcEtrci1JUTQ0bFJiN1U2Y2ZtLXVMZ2tnU2fSAXtBVV95cUxNRWYtUzFqUHdEUTZHMjVGLTdPbDVFZVRPNFVqNHBtU2hRb1ZleW1qSS16U1dSdWpDY2RzcXJ5UHNrMjJTVTJ4UkRrazdVNHhqWlN2OVFHMFNHbUlGUTFsb0gzN2l6UkVSYzlSV1ZCZU9tUjRTYnBzWG83dUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Odds Suddenly Surge. Here's Why - U.Today",
        "content": "Bloomberg analysts James Seyffart and Eric Balchunas have increased the odds of spot Ethereum approval to a whopping 75% in what appears to be a last-minute reversal.\n\nAdvertisement\n\nAccording to Balchunas, there is some \"chatter\" that the SEC might be doing a 180 on this issue (which might be due to political pressure).\n\nPrior to this, the industry consensus appeared to be that these ETFs would be denied due to the lack of engagement between ETF issuers and the SEC. The Bloomberg analysts claimed that the probability of these products being greenlit by the regulator was just 10%. However, former Grayscale CEO Michael Sonnenshein said that he was \"optimistic\" ahead of the Ethereum ETF approval deadline.\n\nAdvertisement\n\nFollowing the latest developments, Seyffart and Balchunas have now capped the approval odds at 75% until they see possible filing updates.\n\nAccording to Fox Business reporter Eleanor Terrett, things are currently evolving \"in real time.\"\n\nJake Chervinsky, a popular cryptocurrency analyst, has noted that the approval of spot Ethereum ETFs would be \"shocking\" to everyone he knows in DC. If the SEC actually makes such a move, it could signal a major shift in US crypto policy following the bipartisan SAB 121 vote.\n\nAs reported by U.Today , the SEC is expected to announce its final decision regarding the VanEck ETF proposal on May 23.\n\nThe price of Ethereum has now surged over 8% over the past hour alone, touching the $3,400 level. In the meantime, the Bitcoin price is approaching $70,000.\n\nEthereum open interest has increased by $1 billion in just a single hour, with traders \"aggressively\" opening long positions.\n\nAccording to GlassGlass data, more than $86 million worth of shorts has been liquidated over the past hour alone."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQWko0QnJTODVWVkFOZDQtRkJnTHZwSkhMWnJMSW1GdXlEVVlob2NVdnFxYUxBeW9DXzZiU3AtTWhZZmZmazhHemY0YWliZjBUcTdrOXRycUlBMzExN1B3dnVBd1hTREhVVmZWU19fVTFjb2tGZk1hOWJGcDZEWjFGNUp3Uk94Y3RGalBNeXo1TnFjekR4amZnRUlKX0ZmRE5lYTBSZDliLURKeVhlakc5WlN4bms3YTYxbEdZdVFYY25aVmdOb04wRTVxcGlaMVRyaTV6eGRWbU5xS1RtVzQ00gHkAUFVX3lxTE9qdVV6YUN3ZzBnZnIxWlJmdEdrdlRwMGZTeTFZdC1XRnhCaFphNG05OFlZakZaZDVJUmxiN2tGREVYREhPaS1rVnF0OE81S2NUQUUtTC1LZjdtYVZfZkFkcHd0YnkyY2RkZ1VBdWlqVzY2V3h0Y0FiZkc1dzREWXFheTdwdi1sUDNMXzRkQnJyak9kRi1RQkMybm1uT2FYVGkzTVJwU2RpMzctck93TExTNFkyRjgxSDVTMUN6bWh2YTVENmRxbVRkVU9tRjdOamlMdHhkT1BSY1N0SWVWQkdGa2dYNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Trader Predicts More Rallies for Surging Ethereum Rival, Updates Outlook on Chainlink and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto strategist says he’s bullish on one Ethereum (ETH) competitor that surged by as much as 43% last week.\n\nPseudonymous trader Altcoin Sherpa tells his 216,300 followers on the social media platform X that Fantom (FTM) will see more rallies in the coming months.\n\n“FTM is going to $1-ish before any pullback and should go even higher in the next six months, in my opinion. Interesting upgrades/pivots coming here, and I have a bag. This looks strong in the short term.”\n\nAt time of writing, FTM is worth $0.856.\n\nLooking at the native asset of the decentralized oracle network Chainlink (LINK), the trader says the altcoin is in a position to ignite a breakout rally.\n\n“LINK goes to $20 if it can break past this $16 mark, in my opinion.\n\nStill wouldn’t personally buy here though.”\n\nAt time of writing, LINK is trading at $16.53.\n\nNext is the memecoin dogwifhat (WIF), which the analyst says is approaching a potential bounce level.\n\n“WIF: $2.30 should provide a bounce area. Thought it would break past the range high but definitely was wrong. Could also see the wick tapped again, too, around $1.80. Those should be good short-term bounces overall.”\n\nAt time of writing, WIF is worth $2.54.\n\nThe last altcoin on the trader’s radar is the native asset of the Solana (SOL)-based decentralized exchange (DEX) aggregator Jupiter (JUP). According to Altcoin Sherpa, JUP is currently in the process of carving a bottom.\n\n“Some of these charts look pretty good overall. JUP for example. expecting some sort of slow grind up after forming some sort of short-term bottom.”\n\nAt time of writing, JUP is trading for $1.18.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOQUMxZVJfeHJUZ0hQNDA3RXhuZVZPb0QzVUdTYWIydGZjUjBNNzBwZHBEdWw1X0JDN1ZHZjAtTzN3WWZQWXc2UVhlbTJOM0ZpYm8wVEY4cDBIQ3NOVnkyYW9oZTZMbE5odEdVbzRZQm1uejdRNXdOcVJMTGVVUmdhLWUwZXpuaXIyX1RjalB0S2NKVFRwMVg0cVhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Cryptocurrency: Crucial decision this week for the Ethereum ETF - Cointribune EN",
        "content": "Mon 20 May 2024 ▪ 5 min read ▪ by Evans S.\n\nThe crypto sphere is buzzing as the SEC is set to make a pivotal decision regarding an Ethereum ETF this week. Nate Geraci, president of the ETF Store, recently stated that the SEC will evaluate a spot Ethereum ETF, a decision that could have major implications for the adoption and regulation of this cryptocurrency. Let’s explore the details of this decision and its potential implications.\n\nThe Approval Process: 19b-4 and S-1\n\nTo launch an Ethereum ETF, the SEC must approve two essential elements: the 19b-4 and the S-1. The 19b-4 are filings submitted by national securities exchanges when they wish to amend their rules or introduce new products.\n\nIn this context, it means that platforms like the NYSE or the Nasdaq are seeking permission to add Ethereum ETFs to their offerings. This approval is crucial as it would allow investors to buy and sell ETFs of this crypto in the same way as ordinary stocks.\n\nThe S-1, on the other hand, are initial registration statements necessary for new securities offered to the public. These documents provide the SEC and investors with detailed information about the fund’s structure, management, and how it aims to replicate the performance of the ETH crypto. Without S-1 approval, the ETFs cannot be legally marketed to investors. Even with 19b-4 approval, this restriction persists.\n\nThe SEC’s decision-making process is meticulous and can take several months. The Commission has a legal deadline of 45 days to make an initial decision on a 19b-4 filing. This period can extend up to 240 days. This time allows the SEC to deeply evaluate the proposals and ensure they meet all necessary regulations.\n\nChallenges and Risks\n\nEven if the SEC approves the 19b-4, it is possible that it will slow down the approvals of the S-1, especially considering the lack of participation observed so far. This dilatory tactic could indicate a cautious approach by the SEC, reflecting concerns about the complexity and risks associated with cryptocurrencies.\n\nThe slow pace of approvals also reflects an attempt by the SEC to better understand the crypto market conditions. It also seeks to analyze the specific structures of Ethereum ETFs before allowing their launch. This caution may be justified by the historical volatility of cryptocurrencies and the ongoing concerns about their stability and security as investments.\n\nFor investors, these delays can be frustrating. However, they offer the SEC an opportunity to ensure that Ethereum ETFs launch under a robust and secure regulatory framework. The diligence of the SEC in this process is essential to maintain investor confidence and ensure safe and sustainable widespread adoption.\n\nImplications for the Crypto Market\n\nSEC approval of an Ethereum ETF could transform the investment landscape in crypto. An ETF offers a regulated and accessible way to invest in Ethereum, which could attract new institutional and retail investors, thereby increasing liquidity and market stability.\n\nFurthermore, approval of an Ethereum ETF could set a precedent for other financial products based on cryptocurrencies, opening the door to a broader range of regulated investments.\n\nThis could also encourage increased adoption of cryptocurrencies in traditional portfolios, marking an important step toward integrating digital assets into the global financial system.\n\nHowever, a rejection or significant delay could signal continued reservations by regulators regarding the viability and security of crypto investments. This could dampen investor enthusiasm and slow the adoption of these digital assets, while highlighting the need for more robust regulatory frameworks.\n\nA High-Stake Decision in the Crypto Sphere\n\nThe SEC’s decision regarding the Ethereum ETF is eagerly awaited by investors worldwide. It could represent a major turning point for the adoption and regulation of cryptos. By approving the ETF, the SEC could pave the way for broader adoption and a more secure investment environment for Ethereum and other cryptocurrencies.\n\nHowever, the SEC’s caution in this process underscores the importance of regulation in the crypto sector. Regardless of the outcome, this decision highlights the challenges and opportunities that come with integrating digital assets into the traditional financial system.\n\nUltimately, the evolution of this situation could well define the future of crypto investments, marking a crucial step in their acceptance and regulation on a global scale. Investors and market observers eagerly await the SEC’s decision, aware that the implications will be profound and long-lasting.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNcmFOTWNzVWxkREwyX3drM3N1SU80aEVtVTJCenhmTVRCRnFIOE9jVWV0WkdlZjAtdV9SZWVKdm1pWmVZd29lVHlhUDFLUUhVUDRXYnVkZ21pT2RHbUIwV3NvSkhoaVNTTzZKS0hfTG9FekVMcFVXWGN0Z1o3YU9HSkxBU0VJMklRZ1HSAY8BQVVfeXFMUDNfYWRWdjhuWlJnMXFCNldsN0stV3JFTHlWY3FDUnFlUkNfR3ltdFU0Y0tENFBWT1hOcWtyQVFVN1J4WFcyc25RYnEyVHFJWGNlMEYwci1kdGxoTWg3T2lwUVM2bWpQdDI2YlBQbE9wVEVVSVlVU0N6VHZBN2RBTk02aEo0b1ZDVG56RHJlZlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "U.S. SEC To Approve 19b-4 for Spot Ethereum ETF, What It Means? - CoinGape",
        "content": "With the spot Ethereum ETF decision pending this week, Nate Geraci, President of the ETF Store, offers insights into the potential outcomes for the week ahead. Approval from the SEC for spot Ethereum ETFs to trade on Wall Street hinges on the clearance of both the 19b-4s (exchange rule changes) and S-1s (registration statements).\n\nSpot Ethereum ETH Approval\n\nAs we know, the spot Ethereum ETF will directly hold Ether as its underlying asset, and will trade on the stock exchanges just similar to stocks. However, for them to trade on exchanges, they must receive the SEC nod for both – 19b-4s as well the S-1 filings.\n\nadvertisement\n\nSEC decision deadline this week on spot eth ETFs… SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch. Technically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here). — Nate Geraci (@NateGeraci) May 19, 2024\n\nRule 19b-4 refers to the filing that a national securities exchange, such as the NYSE or Nasdaq, submits to the SEC when proposing to change rules or introduce new products. For Ethereum ETFs, the exchanges need SEC approval on these filings to list the ETFs. Essentially, this process involves the exchange requesting permission to add these new Ethereum products to their trading platforms.\n\nThe S-1 is the initial registration form required for new securities offered to the public. It provides the SEC and potential investors with detailed information about the company’s business operations, financial condition, and management. For ETFs, this document details the structure of the fund, its management, and how it intends to replicate the performance of Ethereum.\n\nThe SEC must approve both the 19b-4 filings and the S-1 registration forms in order to legally sell the ETFs to the public. The SEC typically has a statutory timeframe of 45 days, extendable up to 240 days, to make an initial decision on the 19b-4 filings. Approval of the 19b-4s permits the ETFs to be listed on exchanges. However, without approval of the S-1s, the ETFs cannot be legally sold to investors.\n\nChances of A Delay\n\nEven if the U.S. SEC approves the 19b-4s, it can go slow with the approval of the S-1s. This also means that the regulator can take even longer in order to review and approve these documents. Also, the lack of engagement between the issuers and the SEC highlights that the regulator could undertake a more cautious approach due to the complexities and risks involved with crypto products.\n\nThe decision on Ethereum ETFs is crucial, as approval could boost mainstream adoption of Ethereum and offer a more regulated and secure investment environment for those interested in cryptocurrency. Conversely, a delay or denial might indicate ongoing regulatory concerns about the stability and security of cryptocurrency investments.\n\nAs the decision looms around, the Ethereum price has given a partial bounceback to $3,100 over the last weekend.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNcWZnTHNNNHAwUURCZ2tCMjAzbG5RTzMzbEsxU0xpNjhReGF1SHlsV0ZhdDhVZlFvbkFXWWEtaGtDNE91UjgxWGN5czA4LW1uMWZiVWN4MG9ueUNRZHN4RlNlM282Vjh3WTB1Y2stbEZJOUJOZG9tMmdudXhQUDQtQTJFb1N4dVZvZlN2UWlpTGx4QU9JQnc5NVdLUTYxSWtpSmx2MzNjTEZYQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin is concerned about the decentralization of Ethereum - The Cryptonomist",
        "content": "In a recent blog post, Vitalik Buterin expressed his opinions on three key issues regarding the decentralization of Ethereum: MEV, liquid staking, and node hardware requirements.\n\nButerin explained that many of the concerns related to the centralization of Ethereum can be addressed through smart protocol designs and updates, some of which are already being implemented.\n\nLet’s see below all the details.\n\nDecentralization of Ethereum: Vitalik Buterin’s response\n\nAs anticipated, Vitalik Buterin, co-founder of Ethereum, responded to the criticisms directed at the blockchain in a detailed blog post, analyzing three fundamental issues for the centralization of Ethereum.\n\nMEV (Miner Extractable Value), liquid staking and hardware costs for managing a single node are the three key points.\n\nButerin has observed that concerns about the design of Ethereum in these three key areas are “widely shared” and added:\n\n“These are concerns I have personally had on many occasions.”\n\nHowever, according to Buterin, these problems might not be as difficult to overcome as some argue.\n\nIn his post, published on May 17th, Buterin first addresses the issue of MEV, which is the financial gain that sophisticated node operators can obtain by reordering transactions within a block.\n\nButerin distinguishes two approaches to MEV: “minimization” (reducing MEV through the design of intelligent protocols, like CowSwap) and “quarantine” (attempting to reduce or eliminate MEV altogether through in-protocol techniques).\n\nAlthough the MEV quarantine may seem like an appealing option, Buterin notes that this perspective carries some risks of centralization:\n\n“If builders have the power to completely exclude transactions from a block, attacks can easily arise-”\n\nHowever, Buterin has supported builders working on MEV quarantine through concepts like transaction inclusion lists, which “take away the builder’s ability to completely exclude transactions from a block.”\n\n“I think that the ideas in this direction – really pushing the quarantine box to be as small as possible – are really interesting, and I am in favor of going in that direction.”\n\nButerin: reducing barriers for solo stakers, a crucial step\n\nVitalik Buterin has addressed the issue of the low number of solo stakers on Ethereum.\n\nIn particular explaining that many prefer to use centralized staking providers like Coinbase or decentralized solutions like Lido and RocketPool.\n\nThis choice is due to the complexity, hardware requirements, and the minimum of 32 ETH needed to run an Ethereum node independently.\n\nWhile acknowledging the progress made in reducing the costs and complexity of managing a single node, Buterin emphasized that “there is still more that we could do.”\n\nSuggesting the possibility of reducing the time required to withdraw ETH in staking or lowering the minimum requirement of 32 ETH to become a solo staker, as stated:\n\n“Incorrect answers could lead Ethereum down a path of centralization and ‘recreation of the traditional financial system with additional steps’; correct answers could create a shining example of a successful ecosystem with a wide and diversified set of individual stakers and highly decentralized staking pools.”\n\nHigh hardware requirements for nodes: the civil debate\n\nRegarding the high hardware requirements for nodes, Buterin admitted that the issue is more complex.\n\nHowever, he acknowledged that with the implementation of Verkle Trees and the upcoming EIP-4444, “the hardware requirements of a node could plausibly eventually decrease to less than one hundred gigabytes, and perhaps almost to zero if we completely eliminate the responsibility of storing the history (perhaps only for non-staking nodes).”\n\nButerin concluded his post urging the Ethereum ecosystem to confront difficult questions rather than avoid them:\n\n“… We should have a deep respect for the properties that make Ethereum unique and continue to work to maintain and improve those properties as Ethereum grows.”\n\nIn a post on X, Buterin added that he is happy to see a civil debate among community members:"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB1UGJJZFFqc3dQaEhsblBOb1R5aWZ4UzRNRzJOYjFsb2pGNXdHNWJqbENhYXRpR0FVNmR4VFlOLWFKWnF0aWhaRTRNcDJqamZ6MXdKbjE5b210Tmp5cEoyS3JoUzI2dFJJd3loQVoySzdlWklsMjhJNVZsYU4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Altcoins Outperforming Bitcoin Today - CoinGape",
        "content": "Today, the global cryptocurrency market is facing a slight decline, however, certain Ethereum-based altcoins are standing out with impressive performance compared to Bitcoin amid volatility. While Bitcoin has seen fluctuations between $65,937.18 and $67,694.30, with a slight 0.02% rise in the last day and a 10.12% increase in the past week, some cryptocurrencies are making notable progress. This article will delve into Ethereum altcoins outperforming BTC, and their performances.\n\n1. Pendle (PENDLE)\n\nadvertisement\n\nPendle (PENDLE) is gaining attention for its distinctive method of tokenizing yield. Pendle is now priced at $5.26, showing a 6.55% increase in the last 24 hours and a remarkable 31.39% rise in the past week. This event increased its market value to $809.1 million, with a strong trading volume of $108.2 million in the past 24 hours.\n\nPendle is a protocol that allows for the tokenization and exchange of future yield. By introducing a new AMM that allows assets with time decay, Pendle empowers users to have greater influence over future yield through offering choices and chances for its use.\n\n2. Gnosis (GNO)\n\nGnosis (GNO) is also one of Ethereum altcoins showing notable gains. Trading at $307.83, the token has appreciated by 2.11% in the past 24 hours and 9.65% over the past week. This growth brings its market cap to $797.16 million with a trading volume of $18.9 million in the last 24 hours.\n\nGnosis, (GNO) is focused on building decentralized infrastructure on Ethereum for the Ethereum ecosystem. Founded in 2015, it initially focused on prediction markets but expanded to create supporting infrastructure like Gnosis Safe.\n\nOperating as a decentralized autonomous organization (DAO), Gnosis provides infrastructure for decentralized applications and products to guide ecosystem governance. In November 2021, the xDAI and GnosisDAO communities voted to merge, creating Gnosis Chain, an Ethereum companion addressing scaling challenges through strong engineering.\n\nThe recent price increase of GNO can be attributed to the launch of their updated deposit UI. This new interface includes features such as an auto claim function, expanded support for additional wallets including WalletConnect and Coinbase\n\nWallet, and compatibility with both Chiado and Gnosis Chain. The update, along with the UI rebranding, has likely boosted investor confidence and interest in Gnosis, driving up the price.\n\n3. Chainlink (LINK)\n\nChainlink (LINK) is surpassing Bitcoin in performance with a price of $16.94 at the moment. The token has experienced a 2.10% growth in the last 24 hours and 28.86% gains in the previous week. Chainlink has a market capitalization of $9.9 billion and an 24-hour trading volume of $738.9 million.\n\nChainlink is a blockchain platform that connects smart contracts to external data sources, events, and payment methods through a decentralized oracle network. It enables complex smart contracts by providing off-chain information.\n\nChainlink is supported by an open-source community of data providers, node operators, developers, researchers, and auditors, ensuring decentralized participation for all users in the network.\n\nLINK experienced a surge in price following the release of the DTCC Report. The largest settlement system in the world, the Depository Trust and Clearing Corporation (DTCC), along with blockchain oracle Chainlink, have finished a pilot program with multiple major U.S. banks, to boost the tokenization of traditional finance funds.\n\nConclusion\n\nWhile Bitcoin’s performance remains steady, Ethereum altcoins like Pendle, Gnosis, and Chainlink are capturing the spotlight with their impressive gains. These tokens exemplify the dynamic and rapidly evolving nature of the cryptocurrency market, offering investors diversified opportunities beyond Bitcoin."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNSGZJbENhSjMwSmxZZGh5cHpYQTlEcGMxbFVhUjg4UlZyV0NzTWZLR3p1ZnBlVC1PbzktUlhCbHYxYkxmek53ZFlfcW56YXhjLTYwTW9CUjI0bHhfdlIzRlU5RHQwcmhsdWtuVkdWS0pqdzF2VEM0allQalJkX0Q1RHh0ck1aOXNNRDlORDNWTnhPdXBTaS1uStIBngFBVV95cUxQUWZHSEhoOU5PQndTOEV6d3BGU3hFYTlmcDhPdVByQmFfQUExQjB4QVluY3FJY2ZzQmtFb1BWZ1d2YVltX21Pc3FUdlhnRkNDRjVHX183VnRVUHEycVJ6dnAxQ1h4NmhCQmt4LTlVTDI1ZFVWSDhBaEVLNFp1OVEzV0NRVnhmT0c2THhYdmZna3oxQ2ptYk5oalVxV0p1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Here’s Why the Ethereum (ETH) Price is Rising Heavily - CoinGape",
        "content": "Ethereum has made a shocking recovery as the token gained a 30% surge in the last few days, pushing the value to the highest of the month. At the time of writing, Ethereum price is valued at $3,758.22 with a market capitalization of $451,726,002,955. Moments before surging, ETH price was shallow around the $31K mark, but within 34 minutes, the price jumped to $34K, with a big surge in its number of transactions. Because of that, the trading volume jumped 253% yesterday, pumping the value to $ 33.2billion.\n\nadvertisement\n\nSo, why the Ethereum price is rising so much? Let us look into that.\n\nWhat’s Behind The Ethereum Price Rally?\n\nAfter creating history for being the most preferred cryptocurrency network, ETH hit its peak in 2021 when it surged to its ATH of $4,891.70. But with the declining market conditions, Ethereum was laying low for years before witnessing a surge in March 2024. And now after weeks of break, Ethereum price has started to rise again with a major pump in the last 48 hours solely because of two factors related to the market recovery and new updates on Ethereum ETF.\n\nBullish Market Conditions\n\nAfter weeks of neutral sentiments restricting the market conditions, finally, bulls appeared in the market with a 68/100 score on the fear and greed index. This along with the rise in overall market cap to $2.6 Trillion and the trading volume of $120.57 Billion confirms the bullish market conditions today. As a result, all the cryptocurrencies, including Ethereum have recovered after gaining decent gains in the last 48 hours.\n\nMoreover, Bitcoin price targeting the ATH target of $73,750.07 after rising to $69,822.46 also pushing the altcoins up.\n\nEthereum Spot ETF Approval\n\nThe SEC’s decision over Ethereum ETF will be out on Thursday but one thing has changed, making it the main reason behind creating a surge. After the SEC portrayed disagreement with Ethereum, the investors lost hope of hearing positive news on the result day. Also, the analysts presented a very low probability of approval of Ethereum Spot ETF due to the issues of Ethereum status between Commodity and Security. However, finally, the analysts have presented a 75% approval rate in the ETH ETF case, much higher than the prior 25%.\n\nBloomberg ETF analysts, Eric Balchunas and James Seyffart openly announced the approval ods rising to 75% based on the SEC advising the exchanges to update their 19B-4 filings on an instant basis for Spot ETH ETFs. This single move changes the trajectory of people’s opinions about the SEC approval, including these Bloomberg analysts.\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they’d be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nHow High Ethereum Price Can Go?\n\nEthereum is still under the bullish sentiments and might continue to surge more. Agreeing with the same, crypto analyst Oliver Isaac said that the Ethereum price charts are forming the biggest daily Ethereum candle of the five years which is almost equal to the entire market cap of Solana (SOL). He further predicted the Ethereum price to hit $10K next.\n\nLargest daily Ethereum candle in 5 years$ETH is up almost the entire mcap of $SOL today If they approve the Ethereum ETF, they are approving the entire industry. ETH to $10,000 next target pic.twitter.com/3KLgjUu7Xe — Oliver Isaacs (@oliverzok) May 21, 2024\n\nRegardless, the ongoing hype around the Ethereum ETF is supposed to be behind the Ethereum bull run, pushing the value to a $4K mark easily. The Fibonacci level indicates an upsurge in the Ethereum price, where if the trend continues the value can surge up to $4749 by the end of the month. Moreover, the Ethereum Spot ETF approval can push this value even harder to $6K.\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOSFE4T0pYcG1INlZ6XzhYWkhWd2xNWDJQNGxNbjRNVm83SkdGaW1CeEZiN0JzdkQ4NV9jeWdPSHBKWklEcHpRd1oydzgxVjdUZFdRMDExUjMxQUV3ZnJVdWN1MVllRXB6dGhENTVJSGVjeW1neWZPazNOX3EzN2JmNGpLNFdkendKS081MkQ4RzBQRENQaEpZdXZYaHJoRkHSAaQBQVVfeXFMTUJNNUdJU3dtQTM4LWlkY0VqWWJvYWcwaXo0RjY1M2ZiajVIaUlQdXoxdXFLNFBDb2dKdkJLZnZlcThmTUdMQ1dYazJadUhrNXdQVTJyMzZkSXM4djIzdUlldjlqVllNM1VnRklNZlhuSjVoMGM3UEtTOTlIZ2RDX1hKYUgyTXd1MmZuZFd5dUFQbUJERTBBZFR6YjZuZkRKbl9FbTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "ETH Soars Past $3K But Will the Sellers Come Back? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has faced challenges breaking below the critical $3K support region, with a recent bullish rebound driven by heightened demand near this level.\n\nHowever, a substantial resistance region looms ahead, potentially halting the current momentum.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nAn analysis of the daily chart shows that Ethereum sellers have been attempting to push the price below the crucial $3K support region, which aligns with the 0.5 ($3133) and 0.618 ($2906) Fibonacci levels.\n\nDespite these efforts, ETH recently experienced a bullish rebound due to significant demand around this key threshold, reaching the upper boundary of a multi-month descending wedge and the crucial 100-day moving average at $3.2K.\n\nA sudden breach of this critical resistance zone could trigger a surge, with the next target being the $3.4K resistance region. However, the $3.2K resistance region has the potential to halt the upward momentum, as it includes a notable amount of supply. If a bearish rejection occurs, a plummet toward the wedge’s lower boundary becomes imminent.\n\nThe 4-Hour Chart\n\nA closer look at the 4-hour chart reveals a multi-week range-bound phase, with Ethereum consolidating between the significant support at $2.9K and the critical resistance at $3.2K. Recently, the price saw a notable surge near the $2.9K threshold, retracing towards the wedge’s upper boundary, which corresponds to the $3.2K resistance region.\n\nThis indicates a slight increase in market demand.\n\nIf buyers successfully breach the wedge’s upper trendline at the $3.2K resistance level and the bullish momentum strengthens, a strong bullish trend could emerge in the mid-term. However, if buyers fail to push the price above this threshold, a reversal may occur, leading to the continuation of the current sideways range phase towards the $2.9K support.\n\nSentiment Analysis\n\nBy Shayan\n\nAmid Ethereum’s recent sideways consolidation and uncertain price action, investors are closely watching futures market behavior to gauge potential sentiment shifts. The accompanying chart displays the Ethereum Open Interest metric, which measures the number of open perpetual futures contracts across various cryptocurrency exchanges.\n\nHigher values suggest potential market volatility and trend sustainability, while lower values indicate a cooling off in the perpetual markets.\n\nThe chart shows a significant surge in Open Interest following a short period of sideways consolidation, highlighting increased futures market activity and more aggressive long or short positions. Depending on the direction of these positions, this suggests a potential notable price move in the short term. If the funding rates metric also rises, the market could be set for renewed bullish trends in the mid-term. However, heightened volatility may accompany this activity, so traders should exercise caution."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQcF85b2xYTVpCcmJndTMxQk5UelNaMlJYVnRsSmVpNW52UW5NNXZ6MmdDcXJTOGwxN1lsVFRMc01SVjZQWFRWSE5uRExqMjFEN1E5Vm9CLWhUUVBMZkNpZk9lNF9TX2NPY3hHZ0xCaldMMnptaWRjNlVtTmFiOVoxanRFQTR6cGw2dWRVeVpWeUZqSWNlNnNKcEItYTZoWXN2d3kw0gGoAUFVX3lxTFBjZ1BPWFN5cWZQRk9fak5vMElDdXctUzRKYk4xMnc1aEF5Qk43VUt6ZVBzWjhjY3Y0UnhxaUFqbWFxbGlZNjVmWXFKWUxXQXdRWXhtM0k4ckpxWVlJWnF3M0NBdjJJWW44ZzZkd2dHQ2k5Mmk0WEhBa2NfY0lTWFNCTmZfXzNOMVJZZ29zbXJ1cWRnMGtaZmd0TFdScFNHTl9LaXhUNDV3TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH To $4,000 While Ethereum ETF Approval Beckons? - CoinGape",
        "content": "A brief rally last week increased the hope of a market-wide rally buoyed by an improving macro environment. Bitcoin and Ethereum prices increased modestly, topping $67,000 and $3,100. Based on the Ethereum price analysis, a major breakout is beckoning towards the coveted $4,000 level.\n\nWill The SEC Approve Ethereum Spot ETF This Week\n\nThe US Securities and Exchange Commission (SEC) is expected to decide whether to approve or reject spot Ethereum ETFs.\n\nadvertisement\n\nSeveral high-profile fund managers are keenly watching for this critical decision, starting with VanEck, whose application’s deadline falls on May 23.\n\nSubsequently, two applications by Cathie Wood’s ARK Invest and 21Shares have deadlines on May 24. Other major players like BlackRock, Galaxy Digital, Franklin Templeton, Fidelity, Bitwise, and Hashdex are also in line to operate spot Ethereum ETFs.\n\nHowever, the general outlook in the industry is that the agency will reject the applications. ETF applicants say that they have not seen as much engagement with the SEC compared to weeks before Bitcoin ETFs were approved on January 10.\n\nSome of the factors that could drive the decision to reject the ETF include the lack of sufficient data, according to Matt Hougan, an executive from Bitwise. Moreover, the SEC is yet to clear Ethereum’s status, with some like Scott Johnson, a legal expert saying the regulator could label Ether an unregistered security.\n\nLabelling Ethereum as an unregistered security could have far-reaching implications for the token and the crypto industry at large. For instance, the hope for a spot Ethereum ETF may go up in flames, at the same time, changing how Ether is traded in jurisdictions like the the US.\n\nOn the other hand, an approval could immediately change the asset’s outlook for new record highs. The approval would ignite a broader market trend and set a precedent for more digital assets ETFs.\n\nEthereum Price Analysis: Poised For Wedge Pattern Breakout?\n\nEthereum price sits above $3,100 and changes at $3,110 during US business hours on Monday. There are signs of a bullish momentum making a comeback in the new week, thanks to optimism for the approval of spot ETFs.\n\nThe formation of a falling wedge pattern on the daily chart reinforces the bullish grip on ETH. A breakout above the 50-day Exponential Moving Average (EMA) could drive the price higher toward $4,000.\n\nBacking the uptrend is a buy signal from the Moving Average Convergence Divergence (MACD). Traders will consider placing buy orders slightly above the upper falling trendline, aiming for a sharp move to $3,400 and $3,800 this week.\n\nEthereum price should hold above the 20-day EMA (in blue) to affirm the bullish grip. Otherwise, it might be too early to assume a bullish outcome to $4,000.\n\nLosing this level of support would put Ethereum price at risk of falling below $3,000 again. In such an occurrence, traders may focus on $2,800 and $2,600 as areas to apply new buy entries.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPdWV6MkwzWFJWQ1NSVHVjaFpVMXI1UEhOamdSaU9rLV9wTGJHTWpqX3QtZjZxS0NxQmgwREFSX01ybnZYa0ctbkJ5QXN3WjFFcDlOdmRWU2dlbFlTSGI3QzluLTZLUElwNU1xWkdUSmY2WkpOZkRVMTlCRzlMaTc0MERiTDB2dUF4a0dYZNIBkgFBVV95cUxNMF9oZFRXQS0wTm95dXNzTWZNbkxfdVVwdERLTm9CZjBXQzZocTh1Q1k5OFppR0Q2ZDZZMTU1eUhaZTJ5UklLNlFJcGh4MXdkUzE2UllRNEZoc1R0SDJDVzhCM0sxWlEyVUNCRlhHQUJnaDB2b3FLbXR2eHJMT3RUSFRySWZoMjJFRlpjNjJDZHdyUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whale Moves $46M ETH Amid Price Rally, What’s Next? - CoinGape",
        "content": "Ethereum (ETH) has once again captured the attention of investors and enthusiasts alike within the broader crypto market. Following a notable price rally observed over the past week, the token has emerged as a focal point of activity, with on-chain data signaling heightened engagement among large-scale investors. This resurgence in Ethereum’s price has catalyzed a flurry of whale activity, marking a significant development within the crypto landscape.\n\nEthereum Whale Activity Sparks Market Speculation\n\nEthereum (ETH), the second-largest cryptocurrency by global market cap, has once again attracted attention with a significant price recovery observed in the past 24 hours. Amid this resurgence, on-chain data has revealed notable activity by large holders, commonly referred to as whales, suggesting potential shifts in the market landscape. One such instance involves a whale identified as 0x7f1, who recently deposited 15,000 ETH, valued at over $45.98 million, into the Kraken exchange at a price of $3,065.\n\nadvertisement\n\nhttps://x.com/spotonchain/status/1792375721928839544\n\nThis sizable transaction has prompted speculation among crypto enthusiasts regarding the future trajectory of ETH’s price. The influx of such transactions has stirred mixed sentiments within the market, reflecting the ongoing debate between investors who view Ethereum as a lucrative investment opportunity and those who may be capitalizing on recent price movements to realize profits. Notably, the same whale had earlier moved 120,874 $ETH from Kraken at an average price of $1,645 in early Sep 2022. Currently the whale holds 105,874 $ETH worth $326M with a total profit of $173M depicting a whopping +87%.\n\nAlso Read: U.S. SEC Can Approve 19b-4 for Spot Ethereum ETF, What It Means?\n\nAnalyzing Ethereum’s Price Movement and Market Dynamics\n\nEthereum’s price has experienced a modest increase of 0.51% within the past 24 hours and a more substantial uptick of 7.23% over the past week. At present, ETH is trading at $3,126, with its price range oscillating between $3,135.70 and $3,056.20. Market data from Coinglass indicates a marginal 1.55% decline in ETH’s open interest, accompanied by a notable 51.55% decrease in options volume.\n\nThese fluctuations in trading activity could potentially contribute to the volatility observed in Ethereum’s price action. However, despite market uncertainties surrounding regulatory issues and the delayed anticipation of an ETH exchange-traded fund (ETF), Ethereum continues to navigate through challenges with cautious optimism.\n\nThe Relative Strength Index (RSI) currently stands at 57.35, suggesting an increasing bullish sentiment, which could exert upward pressure on ETH’s price in the near term. Additionally, as the broader cryptocurrency market awaits the potential resurgence of altcoins following the Bitcoin halving event, Ethereum remains positioned to capitalize on future market trends.\n\nAlso Read: Shiba Inu Coin: SHIB Burn Rate Spikes 500%, Price Rally Imminent?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOQTBaX3kyM3A4S3k3eXNmVEZVWkRJaUhFSko3T1l2djNmUmRucFBOQ3hZcVB6YWtqb1RLdHRCaGVnTEdYcm9SZlFhYzdXeS1rMDRMemRiRTBrNXlVdkpnRFhtV0pTVGl5aWpZRHJyTUFVM2RDck5Edll5d2RCemRYMGFNSEJ4R0NnZk1rLXAzRdIBlAFBVV95cUxOcXYyNEZ4cURiLUphdks2WlJST1B6c002blhFS19oLUJUU3VJMkF3SFhMa29WTXZsQzlvSkJGOTV6RENoQm5LbDY0dnV5bkVHNVdMLVRzSm5uT1MxUmZwckExQ0RXekc1dTc2MjYxbS1kMjRyaVg2VFA3enY3Q21GY1lBUFpFYUg1WjhGYS1hRm9xZURq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Predicting how ETH will react IF the SEC approves Ethereum ETFs - AMBCrypto News",
        "content": "Coinbase analyst sees a 30-40% chance of approval for Ethereum ETFs.\n\nEthereum’s dominance and performance are at a low, suggesting a need for positive development soon.\n\nIt is generally believed that the U.S. SEC will not approve any applications for the spot Ethereum [ETH] ETF due to several factors pointing to the fact that the agency’s new crypto enemy is Ethereum.\n\nBut still, no real confirmation has been gotten from the agency itself on what it’s planning. So there is still a chance, no matter how slim, that the SEC would approve these ETFs.\n\nHowever, if they do, is the market ready for that impact? How would Ethereum’s price react?\n\nApproval odds for Ethereum ETFs\n\nCoinbase institutional research analyst David Han suggests there could be a surprising upside.\n\nIn Coinbase’s monthly outlook report published on the 15th of May, Han mentioned that the odds of approval are between 30-40%.\n\nBloomberg ETF analyst Eric Balchunas has similarly set his approval odds at 35%. Meanwhile, the crypto community took a survey from Polymarket and the general estimate is 7% odds of approval.\n\nLarry Fink, CEO of BlackRock, echoed the somewhat optimistic sentiment during an appearance on CNBC, saying that the SEC might approve spot ETH ETFs even if it does consider Ethereum a security\n\nWhat does the data tell us?\n\nShould the SEC approve an Ethereum ETF, the market could see an unexpected surge. However, Ethereum’s dominance and recent performance are trending toward their lowest point ever.\n\nIts SEC-proclaimed status as a security has negatively impacted investment sentiment.\n\nNo one expects an approval, so Ether prices could likely see very little action in the near future.\n\nBitcoin’s [BTC] price hardly reacted to its ETF approvals earlier this year. And the community were actually looking forward to it.\n\nRecently, the Funding Rate has been relatively low or negative, which could imply a cooling off of bullish momentum or increased caution among traders, especially during price dips as it happened in mid-April.\n\nMoreover, the increase in Open Interest despite lower trading volumes suggests that traders might be preparing for significant price moves ahead, as positions are being built up.\n\nBut Ethereum’s trading chart shows a consistent bullish trend over a two-day period. The highest price point just above $3,160 could act as a short-term resistance level.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nWatching how the price reacts upon retesting this level could be critical for short-term investment strategies.\n\nGiven the strong upward momentum and successful price recovery post-retraction, if the market maintains its bullish sentiment, Ethereum could potentially break through the current resistance level."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQdFd3SHZfQm5xWXROQTN4SnpMUllwQ3pNV0Y0UlJ0M2p6VjVUeGp1Q0QyZzdnRkZxaHdiOG00R3JQTmRxcTQ1TEpsM0p4eFNDdjRJdTlpdjNPQkJUVnotaHFZTnFoMVBLOWhySVVRM2lLQnBSSUVGU28tSmRxaDYxY1hFTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Coinbase: Ethereum ETF has 30%–40% Chance for Approval - Watcher Guru",
        "content": "Cryptocurrency exchange Coinbase has recently stated its expectation that proposed Spot Ethereum ETFs have a 30%–40% chance of approval by the end of this month. Indeed, the exchange issued a report upgrading the investment offerings’ approval odds.\n\nThe US Securities and Exchange Commission (SEC) is facing a critical impasse concerning Spot Ethereum ETF applications. Specifically, the President of the ETF Store, Nate Geraci, has recently revealed that the agency is set to make a decision on the Ether ETF this week.\n\nAlso Read: Coinbase to Tap Into Australia’s Billion Dollar Pension Sector\n\nCoinbase Says Ethereum ETF Approval Has Up to 40% Chance\n\nThe digital asset sector has undergone a massive shift since the start of the year. Indeed, the SEC had approved spot Bitcoin ETFs for the first time in the United States. Subsequently, the sector saw a massive surge in assets across the board. However, it was led by BTC, which reached an all-time high of $73,000 in March.\n\nAll eyes then shifted toward what asset could receive a similar investment offering. Naturally, experts looked to the second-largest cryptocurrency as the most prominent candidate. Despite the ongoing rumblings of the agency committed to rejecting the proposals, there is still a chance things will change.\n\nNow, crypto exchange Coinbase has recently stated that Spot Ethereum ETFs have a 30%–40% chance of receiving approvals by the end of the month. Specifically, the exchange issued a new report sharing the updated odds from the platform’s institutional research analyst, David Han.\n\nSource: Bitcoinist\n\nAlso Read: Coinbase Sees $500 Million Bitcoin Exodus, What’s Behind It?\n\nHan focused his prediction on the catalyst that paved the way for Spot Bitcoin ETF approval. That factor was the correlation that exists between a CME futures product and spot exchange rates. Moreover, Han stated that the same avenue could direct the agency toward approval for Ether’s Spot investment offering.\n\nHowever, Han did note that the SEC’s silence has brought about some valid concerns. Moreover, the platform did note that continued delays in the process were not out of the question. However, many experts assure that a decision could come in a matter of weeks.\n\nThe SEC has recently been accused of engaging in a legal campaign to ensure the security status of ETH. If that process continues, they will develop their own grounds for which to deny applications. Conversely, Coinbas assures that such a fate is no certainty."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPamxqLWV3YXQtWFAxZXl1WWJ1ZFA0dEppc0U3S1pycC0ySGxsNExrOGJ6WWtDRDZGRXJXbDJVVGl5V1hxVXBPQm5GR3MyeFFfTC1tbm96VXE4cnZmMlNkS0FvWEg0eXppaVlfOUROd19Fal8zR1JZczZ4SWNEWVMtanJvMWJJU3h5dWlhd3RwSGR2WXFVbWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "SEC Asks Exchanges To Update 19B-4 filings For Spot Ethereum ETFs - Watcher Guru",
        "content": "The SEC is now asking Exchanges to update their 19B-4 filings for their Spot Ethereum ETFs. According to a Coinbase report, the SEC is abruptly telling exchanges interested in ETH ETFs to update their filings on an accelerated basis. This suggests the SEC may move to approve the ETF applications ahead of a key deadline this Thursday.\n\nJUST IN: 🇺🇸 SEC asks exchanges to update 19B-4 filings on an accelerated basis for Spot Ethereum ETFs, CoinDesk reports. — Watcher.Guru (@WatcherGuru) May 20, 2024\n\nThis is huge news for the future of Ethereum, indicating it may soon follow in the footsteps of Bitcoin in establishing its own ETF. However, before the ETFs can go live, applicants will need to have S-1 applications approved as well. The SEC has previously been adamant on delaying their decision on both Bitcoin and Ethereum ETFs. However, reports early on Monday indicated a potential swift change of heart by the regulator. Now, the process of Ethereum ETF approval is accelerating, as we may see Ethereum ETFs on the market soon.\n\nHow Long Until Ethereum ETFs Hit The Market?\n\nFor the Ethereum ETFs to be approved, the SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements). Only after both are approved will we see the first ETH ETFs on the market.\n\nAlso Read: Ethereum ETF Approval Odds Increase To 75% From 25%: Bloomberg\n\nFor context, Ethereum-based Exchange-Traded Funds (ETFs) are a type of investment fund that holds assets like stocks, commodities, or cryptocurrency. The ETFs trade on stock exchanges similar to stocks. In January 2024, the first cryptocurrency ETFs were approved for Bitcoin, the leading cryptocurrency by market cap. Shortly before and after that approval by the SEC, applications for Ethereum exchange-traded funds came flying in.\n\nThe news is especially bullish for Ethereum which is up over 11% at press time in the last 24 hours to $3,413.17. Upon approval of the ETH ETFs, Ethereum may skyrocket similarly to Bitcoin upon BTC ETF approval in January. Furthermore, the approval of Spot Ethereum ETFs may also generate more buzz in the overall cryptocurrency market. Having two crypto-based ETFs available on the stock market will be huge for crypto innovation and popularity amongst investors."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNRGNOMmtyMUYycUE4SnkwVlVMVDlzSFFkdG5FQjhCN2QtN1luLWxhb1o3aVFZSGxQbzZ4cDNGMlJDRXNHTW9uRlRRcklYOFlxQW5GT2JHMHMzeGlJT3AyOWNfc1BrRnJnODF4QW13NlBRV0xjem9yTGFWcV9GaHFJaWhEWjhsMlhwQTdNNTJDVTJFMWNNT29VSTBaQ1ZGUdIBowFBVV95cUxNWGRqeEJTcGlYQ1ZlSEU4dnZ5VWdqT0tUNGtnVXlwX2h1MGZjRXdaRDB0OGYtWFU4R1hDdm1USGRTUFRPVDdVbkZodGxvYXNWTnVYRkFYbndkNEE4UTUyQ3BZX3BpMmhjc2hBaEx5ZDNYc05hZGk1VEtPby1pcGhqc2Y3dmlZLVdLX3hncGNILXlNV3Q3VmI4SWNvSExlVjd3aGF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Price Taps $67K, Ethereum (ETH) Climbs Above $3.1K (Weekend Watch) - CryptoPotato",
        "content": "Bitcoin’s most recent run continued in the past 24 hours as the asset’s price climbed to its highest price in over a month at just over $67,400 yesterday.\n\nEthereum has also joined the party at last, having surged past the coveted resistance line of $3,000 and jumping above $3,100.\n\nBTC Sees 5-Week Peak\n\nBitcoin suffered a lot at the start of May as it dumped to a multi-month low of under $57,000. It began to recover some ground in the following week when it soared past $65,000 on May 6 but quickly reversed its trajectory and saw its price dropping to under $61,000 on May 10.\n\nThe bulls intercepted the move at this point and didn’t allow any further declines. Just the opposite, BTC maintained its ground last weekend and started climbing on Monday to just over $63,000. Another brief correction came on Tuesday to $61,200, but the lowering inflation rates in the US, which were announced on Wednesday, sent the cryptocurrency flying.\n\nIn a matter of hours, BTC skyrocketed by several grand and jumped past $66,000. Although there was another brief retracement, the growing Bitcoin ETF inflows meant more price gains for the underlying asset, which charted a 5-week high of over $67,400 yesterday.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nDespite losing some ground since then, BTC still trades around $67,000 now. Its market cap has increased to $1.320 trillion on CG, but its dominance over the alts is slightly down to 51.6%.\n\nETH Goes Beyond $3.1K\n\nThe second-largest cryptocurrency was among those who trailed behind in terms of gains, as reported earlier and was losing ground to BTC. This was because ETH couldn’t reclaim decisively $3,000 despite several challenges in the past few weeks.\n\nHowever, that resistance level finally gave in yesterday, which allowed Ether to shoot up above $3,100 for the first time in over a week.\n\nMost other larger-cap alts are also in the green, with gains of around 1-2%. In contrast, Toncoin has retraced by more than 3%, and so has HEAR, which is down by 4%.\n\nThe total crypto market cap has added around $20 billion overnight and is now at $2.560 trillion on CG."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPVVR0QXI2QVB3MGJYMDlNRHMzTGR2OGdVUm5Fa1otX05fa2JHd1VrOGdnamRFVWhfNnJaSDFKTDZ0RDFtaUxCdW1vdGNyUGYwMVcyWXhjNUQyeTI0cXpKYWV6SjV2ZXZXMndjWkZFMnlweFg4Qno5Q2FkQkF1LWhjUlVGRzJkMW_SAYwBQVVfeXFMTnpkR2U0aDl3ZVAwd2V5MUhES1MtZFFWQ1NIR1hnandNLWNJMU0yX1BzUlItSUQzbWtSVnZjbjlQY1QyQVZPOUFNZENHYUs4dmx1bjZUQkhlcUlyUktmS0xSOGR6MTdiaFVWbTNMWnotVS03UW5uMzdPUEdSekJESE1sUVZ2N3oyc2RnTjI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF D-Day Approaches, Where Will ETH Prices Go? - CryptoPotato",
        "content": "The final deadline for the first spot Ethereum ETF is Wednesday, May 23. This is when the SEC will approve or deny VanEck’s application.\n\nThe Ark 21Shares spot ETH ETF application deadline is on the following day, Thursday, May 24, but what happens Wednesday will set the tone for the rest of the issuers.\n\nOther issuers waiting for a decision from the US regulator include Hashdex, Grayscale, Invesco Galaxy, BlackRock, and Fidelity.\n\nApproval Odds Not Looking Good\n\nOn May 20, ETF Store President Nate Geraci observed that the SEC must approve both the 19b-4s (exchange rule changes) and the S-1s (registration statements) for ETFs to launch.\n\nHe added that it was “technically possible” for the regulator to approve the 19b-4s and then “slow play” the S-1s, especially given the lack of engagement with issuers.\n\nSEC decision deadline this week on spot eth ETFs… SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch. Technically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here). — Nate Geraci (@NateGeraci) May 19, 2024\n\nA 19b-4 is the filing that a national securities exchange, like the NYSE or Nasdaq, submits to the SEC when it wants to change rules or introduce new products, such as spot ETH ETFs.\n\nThe S-1 is the initial registration form required for new securities offered to the public that provides the agency and potential investors with detailed information about the company’s business operations and products.\n\nSEC delay tactics can be used to “further evaluate the market conditions or the specific structures of these ETFs without outright denying the applications,” explained industry observer “Gronky” on X.\n\nJust five SEC Commissioners are set to vote on whether to approve or deny VanEck’s ETF on Wednesday. Gary Gensler, who voted in favor of approving spot Bitcoin ETFs in January, is among them.\n\nThe other four are crypto-friendly Commissioners Hester Pierce and Mark Uyeda and anti-crypto Caroline Crenshaw and Jaime Lizárraga, so it could come down to Gensler’s vote again.\n\nETH Price Outlook\n\nIf the SEC approves the VanEck fund on Wednesday, ETH prices are likely to pump in the short term. However, the general consensus is that the SEC will reject them.\n\nOne analyst said that the Ethereum bottom was already in and eventually spot ETFs will be approved even if they are denied this week.\n\n$ETH monster run incoming? Ethereum ETF decision on the 23rd May. I expect it to get rejected ✖️ BUT I think the $ETH bottom is already in\n\nEthereum will get an ETF and the market knows it. We are going to see a crazy run in Ethereum in the coming months as $BTC halving is… pic.twitter.com/gzzq3Xbr68 — Dippy.eth (@dippy_eth) May 19, 2024\n\nFellow analyst “Mister Crypto” said that the bearish rejection scenario was already priced in, a sentiment echoed by other crypto traders and analysts.\n\nA surprise approval could catch people off guard, however. ETH prices are slightly down now to just under $3,100. SEC approval could result in a quick upside move to resistance at $3,500 and potentially beyond."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxOTlh2R043cnZTUC16cTVYcXJuMlp3UTFuMmNUdllzTG5wek5LRVl3d1VWQ24tSEZqa2x6S1dLaDdNTXV2dEJwOWN2NHhLNXlrYnpQWnpraExWUENESzV3R2oyZ3AxMy1DMTk2WjNyVUp1OWtocnIyZ1U4N1ZnWDhPYW00T0puUHlzSWxmR010d1M1T2xsSVVHQ3pSVlMtZnBHRDNXSXMyanU1UjREdnU5eHBiaDFBc1hVd2RrX2REc1c0WWhEdVBvY094TXByX0hNZlR0MDY5RXpzMFQ4S2JKSVFoanp5a2k1RVpsMldKNUJGQ3BYZXFsdGF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bitcoin Climbs 10%, Ethereum 5%, and Furrever Token Promises 15X Returns: How Will the Market React? - GlobeNewswire",
        "content": "New York City, NY, May 20, 2024 (GLOBE NEWSWIRE) --\n\nInvestors are happy with this week as most cryptos surged during this period. Bitcoin climbed by an impressive 10%, and Ethereum followed suit with a 5% increase, signaling a strong bullish sentiment across the market. Amid these gains, Furrever Token has captured significant attention with its promise of up to 15X returns post-launch. As these developments unfold, the crypto community is abuzz with speculation on how the market will react to these exciting prospects.\n\nBitcoin Surged 10% in 7 Days: Optimism Amidst Market Momentum\n\nLast week proved remarkably optimistic for cryptocurrencies after a prolonged period of uncertainty. Despite higher-than-expected Producer Price Index (PPI) data, US inflation for April was reported lower, offering relief to risk markets previously jittery over fears of additional Fed interest rate hikes. Now, attention turns to upcoming data releases, particularly on employment and other economic indicators, until the June 12 meeting.\n\nLabor market figures are weakening, while the latest wage growth data has been supportive for risk markets. Overall, with inflation figures gradually softening over the past few months, the likelihood of further Fed tightening and prolonged peak interest rates diminishes.\n\nOn the front of spot Bitcoin ETFs, this week's data has been supportive for Bitcoin. We're now seeing inflows rather than outflows in the GBTC space, pushing ETF total value above $12.4 billion. If we witness renewed inflows in IBIT and FBTC spaces totaling hundreds of millions of dollars, it could signal a more impressive resurgence akin to the rapid ascent witnessed until mid-March.\n\nEthereum’s 5% Surge Caught Attention: Thrilling Market Outlook and Potential Catalysts\n\nEthereum (ETH) is presently valued at approximately $3,098.41, showing a slight decrease of 1.2% from yesterday while experiencing a notable increase of over 5% from the previous week. Despite Ethereum's recent performance, it has trailed behind Bitcoin throughout 2024, indicated by the ETH/BTC ratio hitting a three-year low of 0.044. However, following Ethereum's transition to proof-of-stake (the Merge), its correlation with Bitcoin has witnessed a decline of 45%, diminishing the probability of the much-awaited \"flippening.\"\n\nNevertheless, despite encountering hurdles, market sentiment remains cautiously optimistic. Analyst Michael van de Poppe suggests Ethereum is primed for an upward trajectory, particularly amidst adverse market conditions. Coinbase shares this positive outlook, emphasizing Ethereum's minimal supply-side pressures and the potential approval of a spot Ethereum ETF. Regulatory clarity, especially regarding the SEC's decision on the ETF, holds significant importance. While initial rejection is plausible, Coinbase contends that legal action could potentially reverse it.\n\nThe approval of a spot Ethereum ETF would signify a milestone, likely attracting increased institutional interest and investment in Ethereum, potentially elevating its price. The current ETH/BTC ratio, at a three-year low, indicates potential for growth should Ethereum narrow the gap with Bitcoin. Overall, market sentiment displays cautious optimism, with analysts anticipating Ethereum's resilience, particularly amidst potential regulatory advancements.\n\nFurrever Token Sparks Excitement in the Crypto Industry\n\nIn the midst of the recent market upswings observed in prominent cryptocurrencies such as Bitcoin and Ethereum, a fresh contender has entered the scene, drawing attention from the crypto community due to its distinctive allure and auspicious prospects. Furrever Token, characterized by its endearing feline-themed identity and intuitive interface, has swiftly garnered enthusiasm and intrigue among both investors and enthusiasts.\n\nFurrever Token stands out in the crowded crypto space by offering a whimsical and heart-warming experience that goes beyond traditional use cases. Its mission to integrate cute cat-themed stickers, emojis, and visuals into its ecosystem has resonated with a broad audience, making crypto engaging and fun. This light-hearted approach, combined with strong fundamentals, has helped Furrever Token carve out a niche in the market.\n\nThe tokenomics of Furrever Token are strategically designed to ensure growth and stability. With a total supply of 9 billion tokens, 65% allocated for presale, 25% for DEX allocation, and 10% for team allocation (locked for a year), the project demonstrates a commitment to security and longevity. The recent presale success, raising over $1.1 million and nearing the final stages, highlights the growing investor confidence.\n\nAdding to the excitement is Furrever Token's promise of up to 15X returns, a compelling proposition for those looking to capitalize on new opportunities. The ongoing $20,000 Highest Total Buys Competition further incentivizes participation, fostering a vibrant and engaged community. This competition ends on 27/05/24 at 12:00 UTC, giving investors a limited time to join the race for significant rewards.\n\nWith its current price at $0.000648 and exclusive availability on its official website, furrevertoken.com, Furrever Token is poised to make a significant impact. As the crypto industry buzzes with anticipation, all eyes are on how this charming newcomer will perform in the dynamic market landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOSVZkNmVCUFpIbXJmbHZGVnBZeTRMNnZNbnNwWmZsUm8wUE9HcDRxUklwdDlUR2NrOXN4YTQ4eUVlamc1S3BVOXdtS1d5anFIUWZrN3h3ZmtYM2hqX2dWdlBXMkdTZHV6UkhuQVBCS2phV0NhUlpNa2xJUHlndTZsd2tVU01DSUVGMl8wRkdR0gGTAUFVX3lxTE8zSHlBX2o3Vk1DNHFXMVJtMG85dWkzdmp5MWg3ZkhHNlhlVXlHa1prc1dBUnNCOXc0TzZCM2xBX1NfOG0yRVZCNVJfQmxYSXdoUmh5WnBrNDQwTnNXOVZiazBOZzYzeFZqVC1Mc3F3VFVIcWlfb0E2MmtXcXYzWnlkTlk3ZVpuU1NreHBDNWU4bEVxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Ethereum sets sights on $4K: Will THIS spark a new rally for ETH? - AMBCrypto News",
        "content": "ETH was up by more than 6% over the last seven days.\n\nA few of the metrics suggested that the bullish momentum might not last.\n\nEthereum [ETH] caught investors off guard as its price gained bullish momentum on the 17th of May.\n\nWhile the token’s price moved up, it broke above a bullish pattern that could allow the king of altcoins to touch $4k in the coming days or weeks.\n\nEthereum eyes $4k again\n\nCoinMarketCap’s data revealed that ETH investors enjoyed profits last week, as the token’s price had surged by more than 6%.\n\nThings heated up in the last few hours as ETH’s value increased by over 2.6% over the last day. At the time of writing, ETH was trading at $3,108.31 with a market capitalization of over $373 billion.\n\nThe bullish price action had a positive impact on the token’s social metrics, as its Social Volume remained high last week.\n\nIts Weighted Sentiment also entered the positive zone, meaning the bullish sentiment around ETH became dominant in the market.\n\nThanks to the price uptick, ETH broke above a bullish pattern that hinted at a price rise towards $4k.\n\nWorld Of Charts, a popular crypto analyst, recently posted a tweet highlighting that ETH broke out of a falling wedge pattern.\n\nThe pattern appeared on ETH’s chart during the beginning of March, and since then, ETH has consolidated inside it.\n\nThe tweet mentioned that the breakout could result in a 50% price rise, in turn allowing Ethereum to reclaim $4k once again.\n\nWhat to expect in the short term?\n\nAMBCrypto then analyzed ETH’s metrics to see whether they support the possibility of it touching $4k anytime soon.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was low compared to the last seven days’ average, signifying less selling pressure.\n\nAnother positive metric was the Coinbase premium, as it indicated that buying sentiment was dominant among U.S. investors. However, not everything looked bullish for the king of altcoins.\n\nAMBCrypto’s look at Glassnode’s data revealed that ETH’s Network To Value (NVT) ratio registered a sharp uptick. A rise in the metric suggests that an asset is overvalued, hinting at a price decline.\n\nEthereum’s Money Flow Index (MFI) also indicated a possible price correction as the indicator registered a decline. Nonetheless, the MACD displayed a bullish crossover.\n\nThe Chaikin Money Flow (CMF) also supported the bulls as it went northward.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nTo see what targets it might reach if its bull rally sustains, AMBCrypto analyzed Hyblock Capital’s data. We found that ETH’s liquidation would rise near the $3.2k zone.\n\nA successful breakout above that would allow it to reach $3.5k in the coming days before it targets $4k. However, if ETH’s price turns bearish, then its value might plummet to $2.85k."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxPUEZLcWJib0pYNDRpekUwVVRWb3VCeU9RT2pkNVFDYzRGZFZncDMwVUdGT0hxQUNqSWNZa3RCTFV1amRBbGFyYUVCaDJHajl4Qk1keXdybkNlNHVENFRDY2hrUjN6MkRzSjhBclJIM093UU9kVE1aVDBmeVVLM3NkYkNYRkdncEg5dWJqeDFGMm5Pc1ZTVGVoZlJCYW00TjBrb2NTZV9PczJCcXRLTTZxeWlXeFRIMk5DYXJXQTdUN1B1MnN2clV2cnBFR0hVZmFMRF9Ma2hEUUFlUk9ueFVKUHlhM1FkOGFrUUdpWXdoQdIB9AFBVV95cUxNX3VwVnY5OVBqamhxNGhDWnpTX0Q2NFpKMHVHaEM0STBDX25wNEZxLTJTZ2tnR25KWUhYdXIwRU0xRmJZQWItX2hpQTVLM3JZZjFKZURKXzZVOVZPVVRNRWdpWnkwNlZCMmRBdWhaV1pMY0VoSjZqcG9FaUM1SEh1WTdOZzRGMUdOeXRVdmE0NFNFV0hPTmZJVjg1Q1FWeUZDQzR2Mi13Q1BjcE9nODc3T2l5M3k1bE44b0FEbEgtUEk1SXFRZUFzaFhRaG5lQlQyLXE4SnEySFgtRV9XWS12Yms1bzlaOWUyZ0VDZTM4YlJlQXkt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum sees a 16% spike as Bloomberg analysts surprisingly increase approval odds to 75% - FXStreet",
        "content": "Ethereum ETFs may see approval as Bloomberg analysts increase their approval odds from 25% to 75%.\n\nGrayscale CEO confirms resignation with only a few days left before SEC decides on spot Ethereum ETFs.\n\nEthereum may test key support levels if spot ETH ETFs are denied.\n\nEthereum's (ETH) price gained over 16% on Monday as Bloomberg analysts updated their odds for spot Ethereum ETF approval to 75%. Grayscale’s CEO stepping down from his role days before the Securities & Exchange Commission (SEC) decides on the ETFs has also added complexity to the predictions of analysts.\n\nRead more: Ethereum rallies 5% as Vitalik Buterin responds to criticism from community amid Coinbase ETH ETF prediction\n\nDaily digest market movers: Ethereum ETF approval now in limbo\n\nEthereum is expected to experience increased volatility this week as the market anticipates the SEC's response to spot Ethereum ETF applications. SEC must decide whether to approve or deny Van Eck's spot Ethereum ETF application on May 23 and the Ark 21Shares Ethereum ETF application on May 24.\n\nEthereum is expected to experience increased volatility this week as the market anticipates the SEC's response to spot Ethereum ETF applications. SEC must decide whether to approve or deny Van Eck's spot Ethereum ETF application on May 23 and the Ark 21Shares Ethereum ETF application on May 24.\n\nIn an interesting flip of position, Bloomberg analysts Eric Balchunas and James Seyffart have upped their odds for Ethereum ETF approval from 25% to 75%. According to Balchunas, the SEC “could be doing a 180” due to increasing political pressure.\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nThis comes after US presidential candidate Donald Trump made several pro-crypto statements in a campaign earlier in May. Many have speculated that President Joe Biden may make a pro-crypto move also to gain support from the crypto community.\n\nMeanwhile, in an X post, Nate Geraci, President of the ETF Store, gave insight into the SEC approval process of ETFs and how it would affect the upcoming decisions. He stated that the SEC must approve both 19b-4s (exchange rule changes) and S-1s (registration statements) for an ETF to launch.\n\n19b-4s is the filing that national exchanges like NASDAQ or the New York Stock Exchange (NYSE) submit to the SEC to seek approval for listing a new product on their trading platforms. In the context of ETFs, S-1s refer to the initial registration forms detailing how a fund would be managed and track the underlying asset's price.\n\nGeraci says it's \"technically possible for SEC to approve 19b-4s & then slow play S-1s,\" considering their reported lack of engagement.\n\nHowever, Bloomberg analyst James Seyffart has said that if 19b-4s are approved, it would only be a matter of \"when\" not \"if \" before S-1s applications are approved. He also clarified their approval odds only apply to 19b-4s filings.\n\nThat said, if we're correct and we see these theoretical approvals later this week. It *should* mean that S-1 approvals are a matter of 'When' not 'If'... — James Seyffart (@JSeyff) May 20, 2024\n\nThis follows a report from CoinDesk that exchanges have been asked to update their 19b-4s filings on an accelerated basis.\n\nAlso read: Ethereum drops below $3,000 again, spot ETH ETF sparks debate in crypto community\n\nMeanwhile, Grayscale CEO Michael Sonnenshein has stepped down, according to a report from The Wall Street Journal. Peter Mintzberg, head of strategy for Goldman Sachs's asset and wealth management division, will take over as new CEO in August.\n\nSonnenshein also confirmed his departure from the digital asset management firm in an X post on Monday. This follows Grayscale's withdrawal of its application for a futures Ethereum ETF earlier in May.\n\nI leave @Grayscale with deep gratitude for everyone who has been on this incredible rocket ship journey. @BarrySilbert, thank you for taking a bet on me and for your partnership these last 10 years. To the Grayscale Leadership Team - thank you for your dedication, loyalty, and… — Sonnenshein (@Sonnenshein) May 20, 2024\n\nWith both events coming only a few days before the SEC decides on Ethereum ETF applications, many crypto community members earlier reduced their odds for an approval. But with the recent update from Bloomberg analysts, things may turn out positive for Ethereum.\n\nETH technical analysis: Ethereum may test key support levels\n\nEthereum is trading around $3,566 on Monday seeing more than a 16% increase on the day. With the SEC's decision on Van Eck's spot ETH application coming on Thursday, investors should watch out for high volatility.\n\nThe $3,029 support may prove key in the next few days before the event. A dip below the support indicates a high bearish sentiment from expectations that the SEC will deny the application. However, with recent price movement, ETH is aiming for the $3,730 resistance as expectations have switched bullish for spot Ethereum ETFs.\n\nRead more: Week Ahead: Ethereum and DeFi to come under spotlight this week\n\nAccording to QCP, \"Given the resounding lack of interest in the market, the risk is to the topside with a surprise approval catching everyone off guard, triggering a short squeeze taking us easily back to recent highs.\"\n\nETH/USDT 4-hour chart\n\nA denial of spot ETH applications may trigger a wide dip following the fair value gap on Monday. However, ETH may not sustain any decline below the $2,914 to $2,852 range as it has shown strength in weathering dips within the past three months."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOajFFeWNmNEo4XzhjbTJSeUtIRXBPNmFTZTZXeFQxZkkzRVBxTE1aM0dpZGg0b2FfWmV0ZHV4S0ZhamxrZlIyaG9qYUVUcHRwaUFXUkFXSkxjTDgtUm1HUFNWdGxJSVY3STQtMFBPenRrLTdzTlUzNGc0M20yWXI4VG5LenN4c3R3ZncwZklFTVd1NFZ0Rll6UE9kZlExdlJwTkhBNlFlSjM4MHdPVnd2ZjhpZzRRUGZJeHRQUUVZRXpaSGQxNzNCMjBKV1dxZXVDeHI40gHYAUFVX3lxTE9WZDZBRDdVdjFkTUpZTGJhbl9KdDJaQWdxZXZjUnJMdGJGMUZYdGEtLVZFd0VzTnhrX3lFb2YxM1hJY0c5NWpmbGxHa1FzQnNOWmUtSzF3dnNSdDNsbmM1dTdMcFU5b0dqYmJJdnY0WWhndU9nTnByZUN6bU5PeXlENDZ6aDBLZ1BGdzY4a1ZjSV83NUsyRHd4VzVjTFhHU0ZpV0pNdjktczJrejQyeEJ5d2FzZ01scU9NMjF5UDdkdnVraXYzaG9MMDVha0UtX3BpX243TDRXSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Analyst Says Markets ‘100% Underestimating’ Odds of Ethereum ETF Approval, Warns Top for Memecoins in Sight - The Daily Hodl",
        "content": "A closely followed crypto analyst thinks that market participants are too pessimistic about the odds that regulators will green-light a spot Ethereum (ETH) exchange-traded fund (ETF).\n\nPseudonymous analyst Altcoin Psycho tells his 501,800 followers on the social media platform X that people are not bullish enough on ETH right now.\n\n“Markets 100% underestimating odds of an ETH ETF.\n\nIt’s also underestimating the price impact it’ll have.\n\nBuying ETH under $3,000 pre-ETF will eventually be an obvious hindsight trade. Just like how it’s now obvious you should have bought Bitcoin pre-ETF.”\n\nData from the Ethereum-based prediction market platform Polymarket shows that only 13% of traders believe that an ETH ETF will be approved by the end of the month.\n\nLooking at the broader digital asset market, Altcoin Psycho thinks that market participants will eventually rotate their capital to blue-chip crypto projects at the expense of memecoins.\n\n“At some point all this scattered attention will narrow via a flight to quality, which also means a memecoin sell-off. I don’t think the cycle top is in but I think the memecoin top is not far away. Memecoins are a gateway drug not the end game, study past cycles if you disagree.”\n\nAs for the emerging artificial intelligence (AI) sector, the analyst says that while many are calling for the AI bubble to burst, he thinks it’s still in its earlier stages and set to become one of the biggest speculative manias ever seen.\n\n“Most say the AI bubble will soon burst, I’ll be the contrarian and say the bubble’s just starting.\n\nIt’s my highest conviction take since saying SOL at $15 was a must-buy…\n\n99% of AI startups will fail. When this happens, naysayers will prematurely claim victory. But once the dust settles, the surviving 1% will be so valuable that they’ll alone carry the bubble beyond any other bubble we’ve seen.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOdWY1YWJVUm5YWkk4VzVXU0JMN2FneUtaZEVwWjhDZHhVcTNEd3ZRMTJYcF9GeGxFTGQ4a2tlWm9SRmNoYndLdnJfdlhKbjZhSDlxaHZ5blJzM0Eyb1dNM1MwVG5iQVZRN21BTEV3d19reHItSFlOd3RHd1dxZzdmVnV5MnNlS2dJRWNMdW9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Odds Increase To 75% From 25%: Bloomberg - Watcher Guru",
        "content": "Spot Ethereum ETF approval odds have increased to 75% from 25%, according to Bloomberg ETF analysts. Several spot Ethereum ETFs are currently awaiting approval by the SEC. Bloomberg ETF analysts James Seyffart and Eric Balchunas previously gave the Spot ETH ETFs a 25% chance of approval, but now have upped their prediction to a 75% chance.\n\nIn a post to X (formerly Twitter), Eric Balchunas shared that he and Seyffart received inside information that there is chatter in the SEC that the regulator is changing their stance on the ETFs. The two analysts are awaiting filing updates to fine-tune their predicted odds, however, now everyone who previously thought the ETFs would be denied is “scrambling.” Seyffart also added in a post that we “should see a bunch of filings over coming days.”\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om May 20, 2024\n\nAlso Read: Ripple Unveils Its Total XRP Holdings in Q1 Report\n\nWhat Are Spot Ethereum ETFs?\n\nEthereum-based Exchange-Traded Funds (ETFs) are a type of investment fund that holds assets like stocks, commodities, or cryptocurrency. The ETFs trade on stock exchanges similar to stocks. In January 2024, the first cryptocurrency ETFs were approved for Bitcoin, the leading cryptocurrency by market cap. Shortly before and after that approval by the SEC, applications for Ethereum exchange-traded funds came flying in.\n\nFor the Ethereum ETFs to be approved, the SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements). Upon approval of both, all of the ETF applications will likely be approved at the same time, allowing the funds to go live. It took a significant amount of time for the US regulator to approve Bitcoin ETFs, and the same is expected for the Ethereum ETFs.\n\nSource: btcmanager.com\n\nAlso Read: Coinbase: Ethereum ETF Has 30%–40% Chance for Approval\n\nThe SEC could approve the 19b-4s & then slowly look over the S-1s to prolong the process of approval. However, the odds of approval are still increasing regardless of how long the process will take. The news is especially bullish for Ethereum which is up over 11% at press time in the last 24 hours to $3,413.17. Upon approval of the ETH ETFs, Ethereum may skyrocket similarly to Bitcoin upon BTC ETF approval in January.\n\nFurthermore, the approval of Spot Ethereum ETFs may also generate more buzz in the overall cryptocurrency market. Having two crypto-based ETFs available on the stock market will be huge for crypto innovation and popularity amongst investors."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOeVJiMzJ6aWFhRUJTcUtld1lueDRfWWF0U3R1ZjRQLW5SRHhwUFJvTGp3OVVXYWhQNDMtbldhdXhSVTljTjV5bkNFUHRHdlJ1ZlhUNEp4Yk1LNFMtVHY2MC1mZm1ub3AzMXp6LUZlaGQ1dTA4azQ0c2lLNzZkSGlDWnZ0anBaQnc5N1lleEk3SljSAZYBQVVfeXFMTS1FSWJNUzkyVWhpcUJOaFhaX1lEUEIxalk3SkM2RGE0ZVMxOU45SjVlbHJfb24yaFRPb0lVUzgwbjNJWXdOdlcwbWJHWUx4MEtuMFpqSDE2RFI1WTVzNC15anlxY1Z0dkJFYVA1YWhOWWJpMmJjYjA3NmV4ZVgxRVVaSDBrVEVacGtNdmViSWdlYWVINWpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum whale accumulates 15K ETH: Will this finally help prices? - AMBCrypto News",
        "content": "Ethereum whales increase holdings, but network growth slows.\n\nETH gains slightly, but investors hold out for a $4k milestone.\n\nEthereum[ETH] witnessed a significant uptick over the last few days, despite the rumors of a possible rejection of its Spot ETF approval.\n\nWhale interest on the rise\n\nOne factor contributing to the surge in ETH’s price was the activity of large holders.\n\nAccording to Lookonchain’s data, a significant whale possessing 120,874 ETH, valued at $370.6 million, deposited 15,000 ETH worth $46 million into Kraken on the 20th of May.\n\nThis same whale withdrew 120,874 ETH valued at $199 million, priced at $1,647 each, from Kraken between the 31st of August 2022, and the 9th of September 2022, leaving 105,874 ETH valued at $325.3 million.\n\nConsequently, the investor’s profit amounted to $171.5 million.\n\nProblems ahead\n\nThe significant whale accumulation could further push the price of ETH to new levels. The price may be able to reclaim $3,500 soon if bullish momentum persists.\n\nHowever, there may be some challenges that ETH could face going forward.\n\nAt the time of writing, the Network Growth for ETH had plummeted, which meant that new addresses were slowly losing interest in the altcoin.\n\nEven though this may help ETH’s case in the short term, ETH needs to be able to attract new addresses for long-term growth.\n\nCoupled with that, the velocity of ETH had also fallen, which implied that the frequency with which ETH was trading at had also declined.\n\nHow are holders doing?\n\nDespite the price surge, most ETH holders were unprofitable at press time. This was indicated by the MVRV ratio of ETH, which had declined.\n\nA negative MVRV ratio meant that ETH still had room to grow before profit-taking could take place and a slight surge in price could be expected.\n\nHowever, the Long/Short ratio for ETH had fallen significantly, showing that the number of long-term holders accumulating ETH had fallen.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nA prevalence of short-term holders could result in a surge in volatility for ETH in the future as they are more likely to sell their holdings in times of uncertainty, whereas long term holders are more resilient.\n\nAt press time, ETH was trading at $3,107.09 and its price had grown by 0.67% in the last 24 hours."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQY3IxU3lwNEJEc2xIM2dUY3RMdnNyU2RRd2prWVFZTXJmbDBwWUNxci1QMDdUaG1CMVNzcUFCeGdyQ0xxa2VQSlV5a1JMay1BcmR6eVlncWVXSGFXM0p5NmEtanNDcWlxUGR6MzNNRVpielQ5T0xxZUFLd0d5WkwxY1VoVE5uVTdDZS1LWGNTYW8tNk10a2NKVXMzTzNZdEw5QjQ2QmFJakFWM0g1YXI4RUh5aUVBUzdvME9fc25TbXJSdkdpM1hFeC14MldRY3EtdEt4cXVLUFBjaTJtLW1wX2NTMWM1T0dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bonk, Pepe Outstrip Gains Of Bitcoin, Ethereum Amid Searing Hot Rally — Beat Biggies Dogecoin And Shiba Inu In Trading Volumes - Benzinga",
        "content": "Memecoins took center stage on one of the best days for the cryptocurrency market, with the likes of Pepe PEPE/USD and Bonk BONK/USD turning out to be the highest gainers.\n\nWhat Happened: The market rallied on higher expectations of an Ethereum ETH/USD spot ETF approval by the SEC, resulting in the highest market cap growth in three months, according to Santiment.\n\nPrice Action: While the rally was spurred by developments around Ether, memecoins stole the highlight yet again, as popular coins like PEPE and BONK grew by 27% and 23% respectively, according to data from Benzinga Pro.\n\nEthereum ETH/USD-based PEPE rose to an all-time high of $0.000011, while the Solana SOL/USD-based meme coin BONK bumped to a two-month high of $0.000031. The rest of the meme coin market also reported significant gains.\n\nCryptocurrency Gains +/- Price (Recorded at 10 p.m. EST) Bonk BONK/USD +27% $0.000031 Pepe PEPE/USD +23% $0.000011 Floki FLOKI/USD +10.48% $0.000211\n\nPepe's trading volume surged to $2.16 billion in the last 24 hours, exceeding bigger coins with larger market caps like Dogecoin DOGE/USD and XRP XRP/USD, Bonk clocked a volume of $850 million, trumping Shiba Inu SHIB/USD\n\nWhy It Matters: The latest rally reflected a strong appetite for meme coins, the class of cryptocurrencies that has witnessed significant gains in the year.\n\nSocial analytics platform LunarCrush highlighted bullish social media discourse around the two coins, with 82% of all BONK posts, and 80% of PEPE posts being positively weighted.\n\nSuch degrees of optimism could potentially help sustain the rally for the two meme coins.\n\nImage via Shutterstock\n\nRead Next: Bitcoin, Ethereum, Dogecoin Shoot Up On One Of The Best Days For Crypto In 2024 Amid Ether ETF Approval Buzz: Analyst Flags ‘Robust’ US Investor Demand for King Crypto"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQOGRwVmdMSnRTVTJDX1c4X3NaMGVjVXl1bEJXY1VHRWh3X2p5YWdnYjF3ejN6ODAzUTZwZmJhcXRKU0JQZ0pwSzZIRTdJbi1OMmtoV1lGeFFjLVdjQi1JLTlMcktmODFfY29sUGV5NFQ1MWtjTHFMQV9LMmxnbkJsTExzcDFlNXdicWFmNV9xcFRiZDJ4eDc1NlkwamkwQ0swX3VVUWVnYkJNLWRBS3lsWGNBTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Coinbase Reveals Optimistic View on Ethereum ETF Approval, Expert Weighs in - Crypto News Australia",
        "content": "Coinbase analysts are optimistic about Ethereum’s future, citing strong demand drivers and unique scaling advantages despite current underperformance.\n\nThey believe Ethereum maintains key strengths such as its Solidity community, EVM platform use, and crucial role in DeFi, supporting a strong case for the approval of spot ETH ETFs.\n\nDespite challenges, the potential for regulatory and market acceptance of ETH ETFs remains high, with a 30-40% chance of approval noted amidst growing political attention to crypto.\n\nDespite Ethereum’s relative underperformance compared to Bitcoin and the overall crypto market, Coinbase analysts hold a positive view toward the second largest crypto. They anticipate ETH could surprise investors with a better-than-expected performance later in the cycle.\n\nDavid Han, research analyst for Coinbase Institutional, wrote that they “believe that Ethereum has some of the strongest persistent demand drivers in crypto, and retains unique advantages to its scaling roadmap”.\n\nRelated: Analyst Who Sold All His Bitcoin Says He Hasn’t Lost Faith In BTC, Makes Bold Bet On Altcoins\n\nHan added that ETH can draw from its historical trading patterns, which indicate its dual benefit as both a “store-of-value” and a “technology-token”.\n\nAdvertisement\n\nDespite Solana being a potential threat to Ethereum and the potential for a Spot ETH ETF rejection in May, Coinbase still believes in the long-term outlook of the network.\n\nWe continue to believe that Ethereum’s long-term positioning remains strong and that it has important advantages that meaningfully distinguish it from other smart contract networks. David Han, Coinbase David Han, Coinbase\n\nHan adds that the strengths of Ethereum include the well-established Solidity developer community, widespread adoption of its EVM platform, the role of ETH as crucial DeFi collateral, and the robust decentralisation and security of its mainnet.\n\nAdditionally, upcoming advancements in tokenisation are expected to benefit ETH more than other Layer 1 blockchains in the near term.\n\n30-40% Chance of Approval, Says Analyst\n\nHan further believes that the approval of spot ETH ETFs is likely due to their potential to offer regulatory clarity and access to new capital, similar to previously approved BTC ETFs.\n\nThese ETFs would allow ETH to access the same capital pools as BTC, significantly benefiting its market position. The rationale behind the BTC ETF approvals, based on the correlation between CME futures and spot rates, is applicable to ETH as well, supporting a strong case for approval, the analyst wrote.\n\nWe believe the odds of approval are close to 30-40%. As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial. David Han, Coinbase David Han, Coinbase\n\nDespite uncertainties, such as the SEC’s current non-committal stance and the unique challenges posed by Ethereum’s proof-of-stake mechanism, Han remains optimistic. Market indicators and political dynamics could sway the SEC towards approval, with potential reversals of initial rejections through litigation also likely, he concluded.\n\nMatt Hougan: Bitcoin ETFs Opened Doors for Crypto\n\nBitwise Asset Management’s Matt Hougan agrees with that analysis, saying the Spot Bitcoin ETFs have opened the door for crypto ETFs. Hougan told CNBC that the United States’ outdated securities laws don’t fit with the digital asset world – but in the end what everyone wants is a “safe, secure platform where investors are protected, and innovation is protected”.\n\nHougan added:\n\nWe’ve entered the ETF era for crypto. We’ve seen the Bitcoin ETFs come to market. We’ve seen the great things they’ve done for investors: lowering costs, improving regulation, improving sort of safety, security and peace of mind. I think we will get there on Ethereum as well. Matt Hougan, Bitwise Asset Management Matt Hougan, Bitwise Asset Management\n\nGet the most important crypto news delivered to your inbox by subscribing to the CNA newsletter"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxONXBzeThmR0RRVkExaUhOTkYxRlo3RXhwUG9vNWN1aU02VTZhbzdZLW1Ia0JJYUs1TEZHTEUtczI0eTl4M0NEczBERW5uc0JZdHhzX1hSLUtNNFIzRmdFS3hWUkxOWE5FZzR3bU15WmNkUXRUVzNFZFVMNGc2YUJHZDlyUGU3OGwwZHJwcWh5OHhPcHJfTENvMjd4MzZnNVlVcURV0gGwAUFVX3lxTE9zNmZTRzNjdmxoODNuazFzcXl0M3JqS3dzWHFXUVNWSHdhZmZMeHBIS1VXd2l1ZG1Jc0ZkSjNQQTQ3emlFTmdvSXowc0Q2ZnVDSGZpUktDX3ZnbG41cHRBVVJiaHZpbjMya090VWMwVXp2cGJ0b2dXb0NkSVZzSzJmalI1UWFzVVlnZDBRakE3TklfVUo3RkZCVzlSZGIxa0E0QXkxUkd5R3MzQUJETFVI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis May 20, 2024 - Analytics Insight",
        "content": "The regulatory environment continues to be a crucial factor in the cryptocurrency market. Developments such as the SEC's decision on the Ethereum spot ETF and regulatory changes in key markets like the US, Europe, and Asia can significantly impact investor confidence and market stability.\n\nEthereum's price on May 20, 2024, reflects a dynamic market environment influenced by significant on-chain activities, key developments, and broader market factors. The large transactions by whales, the involvement of key figures like Justin Drake in emerging projects, and the anticipated SEC decision on an Ethereum spot ETF are pivotal elements shaping Ethereum's market landscape.\n\nWhile short-term volatility is expected, Ethereum's overall trend remains positive, supported by strong technical indicators and ongoing innovation within the ecosystem. Investors should continue to monitor these developments closely, as they provide critical insights into Ethereum's future performance and potential opportunities for strategic investments."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNRHV4c3lrNnJWaThZRTVDcU9VaWFmMTRYUDhqbWNYY2JhNHlpazJCOFRLWXlWWlBfZ3czX2dFLVpxQnNBblhKWUV6dVJ0cTl4ZGpJUXV4dzR6VmZpSUMtTTFYY3M4REFEOHhPQ0RKRUdEX2J0eWJvZmZ5ZDd6M1RScFo2ZFFXV190eG9aYnE1cGTSAZYBQVVfeXFMTzRoeVQ5Q2JOb0hqT3VBcXZCVjNCeF9sQ194dGdlVFlsQmk4dzBUbzVyX1BqZl8xdmZxRHluYnEzcDl3Z2NzWmJEZjBhUmd2VElJRkl1ZVlKdHU3NVJRWnNydDdwSG1qbFZ5TUhhLUhkU0xGT2pkWHRiTUtaSGh0bktucEN5RzlpVHJQcW9DSzlJNnU0V2ln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Ethereum’s transaction size falls 54%: Why it’s not bad news for ETH - AMBCrypto News",
        "content": "ETH could be close to its bottom after the transaction size failed to spike.\n\nWhile the price might slip, traders are convinced of a quick recovery.\n\nOn the 19th of May, AMBCrypto observed that Ethereum’s [ETH] average transaction size had fallen to $2,767. This was a 54.13% decline from the metric when the month began.\n\nAt that time, the average transaction size was $5,893, according to data from IntoTheBlock.\n\nFor the uninitiated, the average transaction size checks in dollar terms the mean transaction value for an asset on a particular day.\n\nHistorically, spikes in this metric signal high user activity—Especially from large investors and institutions. But when it decreases, it implies an absence of institutional interaction.\n\nInstitutions out, retail in\n\nAs such, the recent state of Ethereum implies a presence of more retail users. Apart from that, this indicator identifies potential tops and bottoms.\n\nFrom the value mentioned, it was obvious that ETH seemed closer to its bottom than the top. At press time, ETH’s price was $3,106, indicating that it had swung around the same range in the last 24 hours.\n\nGoing by the analysis above, the price of the cryptocurrency could be set to hit a higher value in the short term. However, other metrics need to be considered.\n\nAs a result of this, AMBCrypto looked at the Ethereum Exchange Net Position Change. According to data obtained from Glassnode, the Exchange Net Position Change has been in the negative region for most of the last 30 days.\n\nETH gets set for a big move\n\nThis metric tracks the 30-day change of the supply held in exchange wallets. A positive value indicates that more coins are in exchanges.\n\nOn the other hand, a negative value indicates increased withdrawals from exchanges.\n\nOne thing we noticed was that the metric suddenly became positive on the 18th of May. As of this writing, the ETH net position change was 81,715.\n\nThis increase could be a sign that Ethereum participants are taking profits off the 6.50% increase within the last week.\n\nIf this number continues to increase, then ETH’s price might decrease below $3,000 before the potential rally happens.\n\nHowever, if exchange withdrawals intensify once more, the price might begin a slow increase toward $3,500. In a highly bullish situation, an increase to $4,000 could be an option.\n\nOn Friday, the 17th of May, AMBCrypto reported how options traders were expecting ETH’s price to hit $3,600 between May and the end of June.\n\nAt press time, Glassnode data showed that the sentiment had not changed. This is because of the signals from the Put/Call Ratio (PCR).\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nIf the PCR is over 0.70, it implies a bearish sentiment and there are more puts than calls.\n\nHowever, a reading below 0.50 implies otherwise. At press time, Ethereum’s Put/Call Ratio was 0.35, meaning that most traders expect the value of the cryptocurrency to increase in the coming weeks."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOXh6TXFHRDU1TlFrZWw5eDNRSkxCQlFkYy1HU3Y5LU9RX29XRUxQUFY0MmdsYXA0Qzl2UWloRWdxRmhHR1dXTkJMZ01aZmkxdW1pbUVjZWk5cDlDZFdBUVE1Vmk1WGMyYVoxOU5UaFJlNFYxNmNFNUVKRklUM043VUZZVHNqOThobDhNNW8xOUdIZHlOLWFaeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Could Investing $10,000 in Solana Make You a Millionaire? - The Motley Fool",
        "content": "Could Ethereum's rival generate major multibagger gains?\n\nSolana (SOL -1.70%) has minted a lot of millionaires since its launch in 2020. The cryptocurrency started trading at $0.95 and hit its all-time high of $260.06 on Nov. 6, 2021 -- which would have turned a $10,000 investment into $2.74 million.\n\nSolana was widely seen as an alternative to Ethereum (ETH -0.02%) for the development of decentralized apps. Solana's blockchain was faster, more scalable, and had lower transaction costs than Ethereum. It accomplished that by using its unique proof-of-history (PoH) mechanism to accelerate the proof-of-stake (PoS) mining method used by Ethereum.\n\nHowever, a series of network congestion and security failures caused Solana to lose its luster, and rising rates subsequently crushed the cryptocurrency market. To make matters worse, failed crypto exchange FTX hastily liquidated its Solana tokens in several huge auctions to raise more cash to pay off its creditors. As a result, Solana's price dipped below $10 by the end of 2022.\n\nYet Solana bounced back, reaching $163; your original $10,000 investment would still be worth $1.72 million. It was tough for investors to stick with Solana through those wild swings, but it's now the world's fifth largest cryptocurrency with a market cap of $71 billion. Could it keep growing and turn a fresh $10,000 investment to $1 million again?\n\nWhat's next for Solana?\n\nSolana's powerful recovery suggests it will remain a formidable rival for Ethereum as a platform for the development of decentralized apps and tokens. Its network has already been used to produce a wide range of meme coins, including notable ones like BONK (BONK 5.68%) and WIF (WIF 2.21%), as well as decentralized exchanges like Jupiter and Orca. The expansion of that ecosystem could make it a fertile environment for more crypto projects.\n\nNew decentralized wallets and financial apps could also help Solana (and Ethereum) disrupt traditional financial institutions. The introduction of Solana Pay, which was integrated into Shopify last year, marked a major step in that direction. Visa also started to run its stablecoin settlement program on Solana, while Circle recently added native Solana support for its EURC stablecoin.\n\nSolana Labs' subsidiary, Solana Mobile, even launched its own Saga smartphone last December. The Android device is still a niche gadget, but it targets Web3 enthusiasts with its integrated digital asset management and Solana blockchain tools.\n\nSolana's rapid expansion is impressive, but Ethereum is scrambling to match Solana's speed and scalability with its own network upgrades. In a recent essay, Ethereum's co-founder and chief architect, Vitalik Buterin, proposed the introduction of \"multidimensional gas fees\" which sound similar to Solana's variable project-by-project user fees across its \"local fee markets.\" If Ethereum closes that gap, it could throttle the long-term growth of Solana's blockchain ecosystem.\n\nHow much higher can Solana soar?\n\nSolana seems to have overcome its initial growing pains. It resolved the congestion issues caused by the market's feverish interest in non-fungible tokens (NFTs) in 2021, survived FTX's large liquidations, and still processes transactions faster than Ethereum. Developers are still launching new apps on Solana and promoting their new tokens with airdrops.\n\nHowever, it's tough to tell how much larger Solana's blockchain can grow as long as it's overshadowed by Ethereum's larger network. For now, CoinPedia estimates that Solana's price could hit $500 by the end of the year and $1,672 by 2030.\n\nYou should take those estimates with a grain of salt, but they imply that Solana will remain one of the world's top cryptocurrencies as it attracts more developers and becomes more widely adopted for mainstream payments. But even if Solana's price hits $1,672 by 2030, it would only turn a new $10,000 investment into about $100,000.\n\nTherefore, Solana might still have a lot of upside potential -- but it probably won't make you a millionaire by the end of the decade. It could also easily be cut in half before it generates bigger gains, so investors should brace for a lot of volatility."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOYnRHUjM2M0ZuMGF3S1dCQ1ZsbTBsX19zWkVBYnV0TUgtVmZZX0t5b3ZmdWE4YjBDQXRpQ3p4TERvc2JhcXFkUE1YcUJ4dUxiak5GcEZQVWpqdXZJMVZjU29QdXpBQnQzcFUwRHA0Q2RuLUdNdkFCeEFXcWpqbmNVZE1TS01qSmvSAYwBQVVfeXFMTzRicVl3bDJnNm9RWUg4enBBRTQtR0hxc1dkaDkxMzdoV1NHenEyNHg4a2FHQk5sblMwNktrQWRWeFkxQnlwbWFvUk1uaXMwbm1sQi1LU21LUzlXSTg1WTFLc3JWS2hNck0wR2tTa05OdjZXcXhya2VfdUhycEZ2aWk3c3VSMkZUdmxoNG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum clears THIS key hurdle: What’s next for ETH’s price? - AMBCrypto News",
        "content": "Ethereum’s price only moved marginally in the last 24 hours.\n\nMarket indicators hinted that Ethereum’s bull rally might resume soon.\n\nEthereum [ETH] successfully broke above a bullish falling wedge pattern a few days ago. Since then, the king of altcoins has been on track and has earned investors profit.\n\nIf the trend lasts, then ETH has a long way to go.\n\nEthereum bulls are slowing down\n\nWorld Of Charts, a popular crypto analyst, recently posted a tweet highlighting how ETH managed to break out of a falling wedge pattern.\n\nThe token’s price has consolidated inside the pattern since March and finally broke out a few days ago. Since then, ETH seemed to be on the right track, as its price increased by almost 5%.\n\nHowever, this gain could just be the beginning, as the breakout has the potential to push ETH’s price by 45%. However, the last few hours showcased less volatility, which somewhat paused ETH’s gaining spree.\n\nAccording to CoinMarketCap, ETH’s price only moved up marginally in the last 24 hours. At the time of writing, ETH was trading at $3,131.77 with a market capitalization of over $376 billion.\n\nTo see whether this sluggish 24-hour price action could lead to a price correction, AMBCrypto checked Ethereum’s on-chain metrics.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was low compared to the last seven days’ average.\n\nThis meant that selling pressure on ETH was low. Additionally, both its Transfer Volume and Active Addresses remained high, which was an optimistic sign.\n\nTroubles still persist for Ethereum\n\nThough the aforementioned metrics looked promising, a few of the others raised concerns. AMBCrypto’s look at Glassnode’s data revealed that ETH’s NVT ratio had increased sharply over the last few days.\n\nFor the uninitiated, the NVT ratio is computed by dividing the market cap by the transferred on-chain volume, measured in USD.\n\nA rise in the metric meant that ETH was overvalued, which indicated a possible price correction soon.\n\nApart from this, another key indicator looked bearish. Ethereum’s fear and greed index had a value of 83% at press time, meaning that the market was in an “extreme fear” phase.\n\nWhenever the metric hits such levels, it suggests that an asset’s price has high chances of dropping.\n\nTherefore, AMBCrypto planned to check ETH’s daily chart to better understand whether a price correction was around the corner.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe MACD displayed a bullish crossover. Additionally, ETH’s Relative Strength Index (RSI) registered an uptick from the neutral mark. Its Money Flow Index (MFI) also followed a similar trend.\n\nThese indicated that the chances of a major price correction were slim."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNVVpJLTdXb1pQUl9iSk1KUXR1cENNZmpRLThmUXAtMTFtZ1R3M25rMTJubkt3NVQyRXNCXzFrblFRMXNGYjFrNEs3bnd6eHMxcFlSQ1lKT0VHNUJFZS1vZ2J1S1cxc2JWY2ZmbnlrRW5nX0t2bGc1dEVyVGMyX0Z5UmhOUDhsTndvSUJvdUhoSmhHRmZKdU56NC1WSFVkRE91akw3ZHVLR19BYWtTNTBwQ2toM1h3T2JWVTNyMVh4VlVtVTF1YWU5dU5XOHl0RnJtSHRVZmlMNHNGbzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "BlockDAG's Enhanced Dashboard and Strategic Roadmap Drive $28.3M in Presale, Outshining Ethereum and Polkadot - Techpoint Africa",
        "content": "As Ethereum and Polkadot face market struggles, BlockDAG is currently a standout in cryptocurrency, thanks to its cutting-edge dashboard features and articulated roadmap. This approach has successfully captivated investors, culminating in a substantial $28.3 million in presale.\n\nThe platform’s innovative dashboard, which includes features like current rankings and a leaderboard, provides critical insights and encourages competitive interaction among users. In contrast, Ethereum faces uncertain price predictions, and Polkadot continues to develop its smart contract capabilities. These elements position BlockDAG as a premier Layer 1 cryptocurrency with significant return potential.\n\nEthereum Faces Price Instability Amid Market Trends\n\nEthereum (ETH) is trading at $2,904, marking a slight decline over the past day. Ethereum remains trapped within a bearish pattern despite some bullish attempts, potentially indicating further drops. From a recent high of $4,000 in March, Ethereum has fallen by 31%, with the price stabilizing around $2,870—a critical support level now contested by bulls and bears.\n\nThe outlook for Ethereum remains uncertain as both the 50-day exponential moving average and the Relative Strength Index (RSI) appear to lean toward a bearish sentiment. A break below $2,870 could depress prices to $2,800 or even $2,200, making it crucial for investors to watch these levels closely.\n\nPolkadot Advances with New Smart Contracts\n\nPolkadot is enhancing its blockchain framework by integrating smart contracts through the ink! language, which facilitates the creation of robust, DOT-compatible applications. This move is set to tackle one of Polkadot’s significant limitations and drive its platform forward. With the Pop Network’s solution already operational on the Paseo testnet, Polkadot is preparing for its next development phase, including features to improve network efficiency and scalability.\n\nBlockDAG’s Dashboard and Roadmap Accelerate Market Impact\n\nBlockDAG's updated dashboard provides many features that enhance user interaction and offer valuable insights. Users can view their current ranking and the necessary purchases to advance, fostering a competitive spirit through a leaderboard that showcases top investors. Additional tools like transaction previews, referral tracking, and detailed personal profiles simplify investment tracking and enhance user engagement.\n\nMoreover, BlockDAG's ambitious roadmap is meticulously laid out in four distinct phases: initial development, expansion through strategic partnerships, the launch sequence, and finally, the closing of the presale leading to the mainnet launch. A key highlight of this roadmap is the X1 Miner app, designed to be user-friendly with functionalities such as a wallet, send/receive options, and a performance leaderboard. The app is geared towards easing the mining process and enhancing community involvement with dedicated sections for user interaction and streamlined onboarding.\n\nThese enhancements to the dashboard and roadmap have greatly appealed to investors, propelling the presale quickly through its phases. In Batch 13, priced at $0.008, the presale has successfully raised $28.3 million, demonstrating strong investor trust and the potential for significant returns.\n\nBlockDAG Sets a High Standard in the Crypto Market\n\nWhile Ethereum struggles with price volatility and Polkadot develops its smart contract infrastructure, BlockDAG is making significant strides with its innovative dashboard and comprehensive roadmap. These developments not only boost user engagement but also enhance BlockDAG's investment appeal, positioning it above established players like Ethereum and Polkadot. With a robust $28.3 million presale and over 9.2 billion BDAG coins sold, BlockDAG offers a promising investment opportunity in the blockchain space, poised for substantial future growth.\n\nJoin BlockDAG Now!\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPYVAxLUJXYnh5cG9DRXdJZjRoQkV1Rk5xUFZmdzQ0NGJ1RklFbnZMSENGMk51a0JrSHFRMkU1WEJ4RHlnR0t2c082Xzd3LTZ0Mm9zMGowQmRULXFqckZIaDVrcTg0d2NjRk0yT2wtdG42Y3BqRDd2X1o5Z1ZFb2Vhcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "BREAKING NEWS: Did the SEC Approve Ethereum ETF? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The cryptocurrency market is experiencing a significant surge as prices skyrocket, fueled by the anticipation of a potential game-changing regulatory approval. Over the past 24 hours, the crypto market has seen a remarkable gain of more than 6%, driven by reports that the SEC is poised to legalize spot ETH ETFs. This development has investors and enthusiasts buzzing with excitement and speculation.\n\nWhat is an ETF?\n\nAn Exchange-Traded Fund (ETF) is a type of investment fund that is traded on stock exchanges, much like stocks. ETFs hold assets such as stocks, commodities, or bonds and generally operate with an arbitrage mechanism designed to keep trading close to its net asset value, though deviations can occasionally occur. ETFs provide investors with a diversified portfolio of assets, which can be bought and sold throughout the trading day at market-determined prices.\n\nWhat is a Spot ETH ETF?\n\nA spot ETH ETF would be a fund that directly holds Ethereum as its underlying asset, rather than derivatives or futures contracts. This means that the ETF would track the actual price of Ethereum, providing investors with direct exposure to the cryptocurrency's performance. Such a product would offer a more straightforward and potentially safer way for institutional and retail investors to gain exposure to Ethereum without having to manage the complexities of owning and storing the cryptocurrency themselves.\n\nBreaking News: SEC to Approve ETH ETF?\n\nThe buzz around a potential SEC approval stems from recent actions by the regulatory body, which has requested exchanges to update their 19B-4 filings on an accelerated basis for a spot Ethereum ETF. Form 19B-4 is a filing that exchanges must submit to propose new rules or rule changes, including the listing of new financial products like ETFs. The accelerated review process indicates that the SEC is prioritizing the consideration of these proposals, suggesting that approval could be imminent."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPR2g5bFdEbWtxUm5HVnJ2WmRZamJSNnFSTC1ZSF81eEZ3b3hoUGt0dmI2VDFZcHBDQkRxcVhLSzdvdlhFQzdoclJWbkI0VjJ0OVR1MFJTNkt4eUZPUE1rTm9uVDhDWVpCTUR5NjJVYmlpa014eGtEREpGQWNhRTIwYUxnaTdFdllqS01XXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Experts Forecast Ethereum to Surge to $10,000 Before Year-End - Coinfomania",
        "content": "2024 started with an incredible upswing for crypto tokens, like Bitcoin (BTC) and Ethereum (ETH), creating enthusiasm among digital asset users.\n\nHowever, Bitcoin’s anticipated Bull Run is not going as expected. As of August 31, 2024, BTC price is currently trading at $58,872.26, representing a 1.16% decrease in the last 24 hours, down 2.89% in the last 7 days, and an 11.59% decrease in the last 30 days. It is currently trading below the $63,500 support level, which it had held in the past few days.\n\nThe current decline can be attributed to macroeconomic pressure and reduced activity of the Bitcoin network. The US home price increase outpacing inflation and wages is adding pressure to the economy ahead of the election season.\n\nDeclining Bitcoin network usage due to a decreased investor interest is also another cause of the current BTC price plunge. In the last two months, the number of BTC active addresses has reduced to their lowest levels, signaling decreased retail activity. Although institutional investors and whales could be on the buying spree, data shows that there is a decreasing adoption by the broader audience.\n\nWhy Rajagopal Feels Optimistic\n\nCrypto enthusiasts are questioning how much further Bitcoin value might drop if it fails to find its $61,000 support levels. Cryptocurrency experts believe that if BTC maintains the $45,000 level and above, it could surge to $60,000 by the end of the year.\n\nRajagopal Menon, the vice president of India-based cryptocurrency exchange WazirX, believes that, amid current consolidation, Bitcoin is eyeing a breakout. Bitcoin eyes to rise past the $60,000 mark, before it enters the “parabolic phase” of another bull cycle, potentially pushing towards the $100,000 mark by the end of 2024. According to Rajagopal, if Bitcoin successfully breaks out from this level in the next few weeks, the flagship cryptocurrency could propel its way to $90k-100k. The $90,000 threshold is a significant milestone, as it is logical for BTC to pause around 90k, potentially surging above the level but hovering below 100k.\n\nDespite Bitcoin losing its steam to soar to greater heights, Perplexity AI, an AI-powered bot, recently stated some factors that could propel the token to experience another bullish trend by the end of the year.\n\nRegulatory developments and market sentient\n\nIn March, Bitcoin experienced a massive price rise due to its tremendous demand. The recent Bitcoin halving and approval of BTC ETFs led to increased optimism that the 2024 bull run would be remarkable and could eventually trigger the crypto to surge to the $100,000 target.\n\nWhile Bitcoin reached a new all-time high of $74,000 in March, it experienced a price decline in May and early June and consequently dropped under $50,000 in early August.\n\nAccording to Perplexity AI, Bitcoin could overcome the current slowdown on the condition that overall investor confidence and market sentiment improve.\n\nOn the other hand, Perplexity AI admitted that global regulators have continued to bring in tighter oversight of crypto assets across the world. The AI bot is optimistic that things could change after the upcoming US elections, especially if a pro-crypto candidate enters the White House.\n\nAdoption and the Global Economy\n\nPerplexity AI also believes that continued growth in Bitcoin adoption for transaction purposes and its integration into financial services and products could create a robust foundation for a bullish trend.\n\nLastly, the AI chart acknowledged that macroeconomic conditions, like interest rates and inflation, have historically affected the entire cryptocurrency market. The AI bot believes that a favorable economic condition could trigger an increased interest in alternative investments, like Bitcoin, to experience another bull run."
    }
]