[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQOWhvVkxvdW15LXVnMjBBYW14T3k0M2FWZU1rV19PZzhrY1dCYUJRSmx0ZkRJY0hrTkFXX3pfWDJreFBDZFZQSG1tYWd0d0RsVUlsNWwwckNWOTlRbENMYUhnSW5NVEhXa2E1bkVrTEZ2X2Nkbm1IWTl5Wno4Z3FiS1E4U094ejlqUVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Michael Saylor Changes Tone On Ethereum (ETH): Will Saylor Buy Ethereum ETFs? - Yahoo Finance",
        "content": "Michael Saylor Changes Tone On Ethereum (ETH): Will Saylor Buy Ethereum ETFs?\n\nMichael Saylor, Chairman of MicroStrategy, has been a strong proponent of Bitcoin, frequently discussing its benefits across various platforms. MicroStrategy owns more than 1% of the entire Bitcoin supply and Saylor's personal holdings. Despite his focus on Bitcoin, Saylor recently began speaking about Ethereum.\n\nDon't Miss:\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true .\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nSaylor appeared on the \"What Bitcoin Did\" podcast at the end of May to discuss his views on Bitcoin and crypto. \"Bitcoin was going to be the only asset securitized and offered as a spot ETF by the Wall Street establishment—and it was going to spread as the one legitimate crypto asset,\" Saylor noted.\n\nSaylor was alluding to the recent advancement of spot Ethereum ETFs to the next approval stage, which occurred just days before the interview. Although the outlook for approval was initially bleak for much of 2024, the SEC is now taking a closer look at each application. Speculation suggests that trading could begin by the end of the summer.\n\nThe advancement of the Ethereum ETFs surprised everyone, including Saylor. Previously, Saylor believed that Bitcoin was the only crypto asset worthy of investment, with other cryptocurrencies merely imitating Bitcoin's success. However, the approval of the ETFs arguably legitimizes Ethereum in the eyes of institutional investors.\n\nTrending: If you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nFor years, Saylor has focused on Bitcoin's limited supply and its use of blockchain for transactions. However, during the interview, he acknowledged the advantages of Ethereum, noting that ‘digital art, NFTs, tokens,...DeFi' are all part of ‘an entire range of use cases' for crypto.\n\nDespite recognizing Ethereum's benefits, Saylor still believes Bitcoin will remain the leader in crypto. He noted that institutional investors might ‘allocate 5% or 10% to the crypto asset class, but Bitcoin will be 60% to 70% of that.' The Ethereum ETFs could attract new crypto investors who will also buy Bitcoin.\n\nThis raises the question of whether Saylor will invest in the Ethereum ETFs. Based on his interview comments, his top crypto choice remains Bitcoin. While he acknowledges some benefits of Ethereum and other tokens, he believes these benefits will attract more people to Bitcoin. \"I think that we are politically much more powerful [when] supported by the entire crypto industry,\" he said. Given this perspective, it seems unlikely that Saylor will make significant investments in Ethereum ETFs, though it is not entirely out of the question.\n\nStory continues\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Michael Saylor Changes Tone On Ethereum (ETH): Will Saylor Buy Ethereum ETFs? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVUMzZFhOQVRMeElad0FSNHVualZVdGw1Vjg4WFMxZ0lSeWVGdGMyZnRxSHJEeXdkOFJhSW9oMnVqTDhVOXhfMExsT0k1VFdmdll5NlkxTVplVUFteHcyX1RZWHlwRndBTExqNUpWTGZIRFo1XzBYcF9iOTZuZ0xoOUpmN244STNvQWJtNVlnREV4bk3SAZgBQVVfeXFMTWdqenMyUGFHaFAzeWVuNFpDSVVFTGticmlSRU1hX29iNFFGbHhRQmo3bDNfSXZZNEZqdm04elZyQVJlTXMwdC1oSHZfb2FyWVN3TTlvZ1hnRmF1NnRtaGtZVjVJa0FQb2ZFc1o2ZjBzU1FiWmJscGhmMDV4WjhocDZLdWVPeFpCVnhPLVZZc1BzTjB6UDJOcW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ancient Pre-Mine Ethereum Address Suddenly Activated as ETH Price Plunges - U.Today",
        "content": "According to a recent update from Whale Alert, a dormant pre-mine address containing roughly $21.9 million worth of Ethereum (ETH) has sprung back to life for the first time in nearly nine years.\n\nAdvertisement\n\nThis is the first pre-mine Ethereum address that has been activated this June so far. In May, two such addresses containing $325,535 and $5.9 million, respectively, experienced sudden awakenings.\n\nIn April, only one address that was created before the launch of the genesis block was activated. For comparison, three such cases were recorded in March. In February, as many as five pre-mined addresses sprung back to life after years of inactivity. In January, there were two newly activated addresses from the pre-mine era.\n\nAdvertisement\n\nEthereum organized a major sale back in 2014, making it possible to buy pre-mined tokens that were created before the network's launch.\n\nEthereum plunges\n\nThe most activation came after the Ether price slipped to an intraday low of $3,642 earlier this Friday, according to CoinGecko data.\n\nThe cryptocurrency took a nosedive after the most recent US jobs report greatly exceeded analysts' expectations. The persistent refusal of America's labor market to cool down does not bode well for those who are desperately waiting for the U.S. Federal Reserve to start cutting rates. The odds of a rate cut in 2024 have dropped substantially following the release of the blowout jobs data.\n\nNearly $49 million worth of Ether positions has been liquidated over the past four hours alone, with longs accounting for nearly 93% of the sum."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxORU5tN0lUNVFaNE5md0ktaldKdkZBamJIYXNKeDJ6NjhfMUxFWmlOVW1VYWhJRUJnOE9ZbkNXTEFVbHl2cXpQS0hDZVctVmRZT0d2MTJGNDR1a19zRE5YajlyWlMzUHh3UWw1RTFLQ0czeVc3N1U1Xy1DTG03Y0E3cW8wSUpYTjFDaGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Why ARK Invest dropped out of the billion-dollar Ethereum ETF race - DLNews",
        "content": "ARK Invest won’t issue a spot Ethereum ETF alongside 21Shares.\n\nThe two firms’ Bitcoin ETF is a top performer.\n\nARK could be hesitant because of the price tag — or waiting for the SEC to approve staking.\n\nAlmost a dozen firms are competing to launch spot Ethereum exchange-traded funds. But crypto heavyweight ARK Invest isn’t one of them.\n\n“ARK believes in its transformative potential and the long-term value of the Ethereum blockchain, but, at this time, ARK will not be moving forward with an Ethereum ETF,” an ARK spokesperson told DL News.\n\nARK Invest issued a spot Bitcoin ETF in January alongside 21Shares, a firm that specialises in launching crypto investment products. And the two firms seemed ready for another round, filing for an Ethereum ETF jointly.\n\nNo surprise there: The massive success of the Bitcoin ETFs suggests Ethereum ETFs could quickly accumulate billions of dollars in assets with even a fraction of the demand.\n\nBut a recent filing showed that ARK has dropped out of the partnership and that 21Shares will pursue a spot Ethereum ETF on its own.\n\nExpensive products\n\nThere are a couple reasons why ARK may have changed its mind.\n\nFor one, launching an ETF is expensive — and in the case of the spot Bitcoin and Ethereum ETFs, the fees are so low that issuers don’t always make a profit.\n\n“Although Bitcoin ETFs have done well in terms of assets, the issuers face profitability challenges due to fee compression and the relatively high costs of the crypto-related fund service providers,” Will Cai, managing director of indices of Kaiko, a crypto data and research firm, told DL News.\n\nJoin the community to get our latest stories and updates\n\nARK and 21Shares’ Bitcoin ETF is one of the most successful funds out of the 10 that launched in January. Coming in third behind BlackRock and Fidelity, it has vacuumed up almost $3.5 billion in assets in five months — an impressive performance by normal ETF standards.\n\nEven so, with fees at 0.21%, it may be hard for ARK and 21Shares to break even on the product. They still must pay their Bitcoin custodian — in this case, Coinbase — as well as administrative fees, their cash custodian, and other things like transfer agents.\n\n“This could well put pressure on the terms of the partnership when there isn’t much profit to go around,” Cai said.\n\nWaiting for staking\n\nThere’s also the possibility that ARK is waiting for the Securities and Exchange Commission to greenlight spot Ethereum ETFs that also provide staking services.\n\n“We will continue evaluating efficient ways to provide our investors with exposure to this innovative technology in a way that unlocks its full benefits,” the ARK spokesperson told DL News.\n\nIn their current design, the ETFs will provide pure exposure only to Ether’s price, without the roughly 3% yield that investors can earn by staking their Ether.\n\nIn other words, not only will investors have to pay a fee to ETF issuers for the exposure to Ether, they will be missing out on opportunities to grow their holdings in Ether terms.\n\n“There’s one massive idiosyncratic factor with ETH that will affect demand and that’s staking,” Adam Morgan McCarthy, a Kaiko analyst, told DL News.\n\n“Even paying 0.20% fees without the staking element seems like a nonstarter to me,” he added.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about ARK or Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPdHQ3UWY4VTUtMnR1eUhhcjVKLWdWU2YtMWo4WmJOd1VXQzlXRE1vcXVHZTBMZmlSWUlIQXoweV9xaTh4Z09EbEVkV2ZMUFNlak9CTnI5RUZBeFRJb3A4WlBMWFo3U0NDQTV3QVVSUXVEUzdGZHFfU0otNXpsTTJmZkpjUGNobHdrZjNtaGRGZGt4bTA5dURvNdIBngFBVV95cUxNTlk2NVZfVTlNb0RmOExWUjRwMFpjQXl1dHQ0andwUWsyZExlcWtRLWtzaTBoZEtpZklFajZ3UWVZMmxaR0VEZDR0NDh2T21Zb1BSVFNBWWMwbGgxOWpFTDRLWWU0a3pmRmdEdHFjVzNVOC1tdENVSUxmRHVMa0NJR2R4UXlSZzJ5dVAtdWR4UFp0M2o5TDdUUlBPcGZPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in June? - CoinGape",
        "content": "Ethereum Price: Over the past two weeks, the second-largest cryptocurrency Ethereum witnessed shrunk volatility carrying a consolidation trend above $3600. The daily chart projecting short body candles and rejection on both sides indicates a lack of direction among market participants. Will the BTC price drop below $70000 push a prolonged correction in the altcoin market?\n\nAlso Read: Crypto Prices Today June 8: Bitcoin & ETH Take Bearish Turn, Wormhole & INJ Pump\n\nadvertisement\n\nEthereum Price Defend Key Support Amid Broader Uncertainty\n\nDuring mid-May, the Ethereum price rebounded sharply from the $2860 support indicating the investor continued to accumulate this asset at market dips. The renewed buying force uplifted the ETH value by 39% to reach a 10-week high of $3975.\n\nHowever, with broader market uncertainty the recovery momentum in Ether stalled resulting in a sideways action above $3630. This support coinciding closely with the 20-day EMA slope and 23.6% Fibonacci retracement level creates a high area of interest for buyers.\n\nThe notable rejection of candle tails at this support indicates the buyers are defending this support. For risk-averse traders, a breakout above the overhead resistance of $4090 will give a better confirmation of a prolonged rally.\n\nWith sustained buying, the Ethereum price prediction hints at a rally to challenge the ATH (All-time-high) resistance of $4880.\n\nOn a contrary note, a breakdown below $3630 will accelerate the selling pressure and may extend the current correction for a week or month.\n\nAlso Read: Crypto Market Selloff: Here’s Why Bitcoin, ETH, SOL, XRP, DOGE Prices Slips Today\n\nHistorical Trends Show June’s Mixed Fortunes for Ethereum\n\nEthereum’s price performance in June has shown significant volatility over the past years, with both notable gains and sharp declines. The largest drop occurred in 2022 with a steep decline of -44.79%, while the highest gain was in 2017 at +26.19%.\n\nOn average, June tends to yield negative returns, with an average of -6.76% and a median of -2.53%. This negative bias suggests that June is often a challenging month for Ethereum. However, the data also hints at the potential for sharp reversals, as seen in the positive return of +8.86% in 2019 following a significant drop of -21.34% in 2018.\n\nThese variations are likely influenced by broader market conditions, including macroeconomic factors and regulatory news. Given this historical performance, investors might approach June with caution.\n\nHowever, with steady development for the launch of Spot Ethereum ETFs, the market is better leaning in buyers’ favor.\n\nTechnical Indicator\n\nExponential Moving Average: The Ethereum price trading above the daily EMAs (20, 50, 100, and 200) indicates the path to least resistance is upward.\n\nAverage Directional Index: The downtick in ADX slope at 33% indicates the current consolidation could assist buyers in recuperating exhausted bullish momentum.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOOFRhMWJtNFEtRXdNZy1tY3dXYkhLODI3YUpkUlZ2ZjlXd2lZMFpqUGU1ZXZwYzFHREVwbnhqMUFrdHBWMVV5aS1fb0NwcFlSWVEtT1dGU3FoNjZhaHVwMW1NMjFZcGM5VmxXcW1hTmtkUVNsM3Frdkp0UnMwbmt6eEljcUNSb1FNakhJUVF0WXJOLXotbWM1eFlpakZDT1d4TjA3VUViZWR5LWZ6WUtkNXQ1bG9VdU85UnhJVWpKNTMxcTRnN0hjZWRMY9IB0AFBVV95cUxQMGFjRXJhbmdiUTN5SFRBYy1wWnY3SDZKWnBQUk94SmNrMmswazdNYVVzSnVuS0xkcVlZYTA1d3FRY2VnZUNaeG9UdnlaWnRkV1lyS2R4cERiOG51TUo1TmluNlQ2enRBSHVqanhXZ0I0azZzTmxzZ211WjUyLXQ4bFBad1lJQUVRa0dFTDNwMkNaMHpmZVowVnVCUVFFOW90VWxRRmUwU1pKSGhQYVZDTGZoX01RRXRJb2JhTS1HMW83NFlkNkhmaGZSOE51TENi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Could Skyrocket by up to 3,805%, According to $101,900,000,000 Asset Manager – Here’s the Timeline - The Daily Hodl",
        "content": "Giant investment manager VanEck believes that Ethereum (ETH) could hit a five-figure price over the coming years.\n\nIn a new research report, VanEck says that its 2030 base case target for Ethereum is $22,000, a gain of 472% from the current price, while its bull case target for the same period is $154,000, a 3,905% rally from the current level.\n\nThe global investment manager says that Ethereum’s potential price rally will be driven by an increase in its free cash flows – the amount of ETH available from the Ethereum network’s operations after subtracting all network costs such as gas fees used for transactions and smart contracts.\n\n“Ethereum is a successful digital economy that attracts approximately 20 million monthly active users while settling $4 trillion in settlement value and facilitating $5.5 trillion in stablecoin transfers over the last twelve months. Ethereum secures over $91.2 billion in stablecoins, $6.7 billion in tokenized off-chain assets, and $308 billion in digital assets. The centerpiece asset of this financial system is the ETH token…\n\n…We project ETH’s 2030 valuation based upon a forecast of $66 billion in free cashflows generated by Ethereum and accruing to the ETH token.”\n\nEthereum is trading at $3,845 at time of writing.\n\nVanEck, which currently boasts $101.9 billion in assets under management, says that Ethereum currently generates more revenues per user than some major household brands.\n\n“Ethereum monthly active user generates $172 in annual revenue, comparable to Apple Music, $100; Netflix, $142; and Instagram, $25. We categorize Ethereum as a platform business similar to the Apple App Store or Google Play.”\n\nAccording to the global investment manager, some of the downside risks facing Ethereum include regulatory ones.\n\n“a. Depending upon regulation. ETH or many of the assets within its ecosystem may be classified as securities. This could cause many Ethereum businesses to have to register with the SEC or face serious legal consequences.\n\nb. The largest financial firms have substantial lobbyist presence as well as former employees appointed to the highest levels of most governments around the world. These former employees could create regulatory moats that disfavor disrupters like Ethereum.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Cristina Conti/Inky Water"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA5ODExT1JrdlhiaWVnSkFKcjRHaVpENzZQR2l5cER3OU9sM3VXc0pRX1hiV1dfWmw5MjN6eTloNkRaNUs1THdZUk5xWF90R1BCRFZUa2ZrQjJ3QkQ4emkxOUtDUW5LVjZlN2x1R0Q3Vl9fR2R1bmJodzJjWGVJRVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "VanEck's Ethereum Prediction: $2.2T Asset By 2030 - TronWeekly",
        "content": "Prominent asset management firm VanEck has released a new analysis on Ethereum, the second-largest crypto in the world. Following the approval of spot Ether ETFs on U.S. stock exchanges, the token has gained widespread traction across the broader financial market. Now financial advisors and institutional investors can hold Ether with the security of qualified custodians, benefiting from the pricing and liquidity advantages characteristic of ETFs.\n\nVanEck, in its latest analysis, has reevaluated the fundamental investment case for the altcoin focusing on how Ether interacts with Bitcoin [BTC] in a traditional 60/40 portfolio, as well as the tradeoff between risk and return. Per the AUM, Ethereum’s ETF approval positioned the network favorably in the eyes of crypto entrepreneurs, traditional financial market participants, and, Big Tech firms. If the leading altcoin continues its stronghold among smart contract platforms, a credible path to $66 billion in free cash flow to token holders supports a $2.2 trillion asset, or $22,000 per coin, by 2030.\n\nEthereum: VanEck Sees $4T Settled and $66B in Free Cash Flows\n\nWith around 20 million monthly active users, the Ethereum network has settled $4 trillion in value and facilitated $5.5 trillion in stablecoin transfers over the last twelve months. VanEck’s 2030 valuation of ETH is based on a forecast of $66 billion in free cash flows generated and accruing to the ETH token, with an estimated 33x valuation multiple on those cash flows.\n\nVanEck's Ethereum Prediction: $2.2T Asset by 2030 3\n\nThe analysis begins by estimating the market size of business sectors that blockchain applications will disrupt, leading to a total addressable market (TAM) of $15 trillion.\n\nWe project ETH’s 2030 valuation based upon a forecast of $66B in free cashflows generated by Ethereum and accruing to the ETH token. We estimate 33x valuation multiple on those cashflows. As Ethereum is a platform for applications, we begin our valuation by estimating the market size of business sectors that blockchain applications will disrupt. We estimate the total addressable market (TAM) to be $15T based on annual revenues in these industry verticals\n\nAs Ethereum evolves and expands its applications, the model incorporates increased ETH supply burn, greater market capture, and higher take rates on economic activities. These changes reflect the network’s growing fundamentals, recent innovations, and shifting regulatory landscape in the U.S."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxORjhiaGRsLWVsSUpGcVJqTGQ5bnNRZXl4TTFuV1dZTERlRlBQMjVoRTQ1cFNsbXdFczhNd3U4UmNJbXhTOWFUUUFmTXpVOWJDeWZmYWdJeTdoTGg4V2tzUlYzMWZBT3JzZnE4TGViY3JUVzVRem5iSmJiSnowU0pTYlViZnJlX0RKa3A5SW9BT1piekRRc1NCNVBsSkNRT0dhZ3lz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Hong Kong May Approve Staking for Spot Ethereum ETFs This Year - Crypto Times",
        "content": "Hong Kong asset management regulators may approve the integration of staking into their spot Ether exchange-traded funds (ETFs) this year, according to Animoca Brands Chairman Yat Siu. This move would allow these ETFs to include staking incentives.\n\nYat Siu said in an interview that Hong Kong is currently discussing staking and that the chance of staking being legalized in Asia before the United States is nearly certain.\n\n“In terms of how quickly, there’s an optimistic side of me that wants it to happen within the year,” said Siu. “If we don’t get much movement on staking within the year, then I would say the election outcome will be the other determinant in terms of how quickly that could happen in the U.S.”\n\nHashKey, which manages bitcoin and ether ETFs in Hong Kong alongside Bosera, intends to implement ether staking. CEO Livio Weng indicated that the approach attempts to gain rewards without increasing risks, with additional information to follow.\n\nWeng stated that they hope to move forward with some studies in this area [of ether staking] in a compliant and controlled manner without increasing risks.\n\nBlockdaemon, a blockchain infrastructure provider, is also in talks with Hong Kong ETF issuers and custodians about delivering ETF staking services, according to Glenn Woo, Blockdaemon’s APAC head of sales.\n\nBlockdaemon is in discussions with Hong Kong ETF issuers and custodians to offer staking services, according to Glenn Woo, head of sales for APAC. Woo noted a positive outlook for ether staking approval based on recent talks.\n\nWoo noted that industry participants intend to approve the staking function this year, as it is the most significant missing element. He is hoping for swift approval, pointing out that Blockdaemon currently provides staking for various European exchange-traded instruments."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5rM2lpQUl6dWtITFAzTjM3aDlPZWZIem1UMnNhbFFMMy1Ub2FwMkx4ZEZZaUhuV0M3dUtfdjkyWVhOV2oxai1hejBidTNaSWdvbHY1RmlTdXBHMDc4SUp3LVpzYzhEdkFOYU9UeWFsMWE5MTF3T3JfTFhGUVk2d9IBhgFBVV95cUxQa19lbzBIMkNCcVB5YlRtVHMycXpycnBQVW5VYzExa0NKcG5yZDluTUkwU08xSHE1d3VSeC1Mdko1T1NWOVc5QzVvbDA3cEMxbFphazcxZnJORnpCNHZPbGRmWEYxZlNlV1FQRW5jTnhNazdCWk8yMVJKWkdPRlNkRHQ4Ui1qUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Layer-2 Network Taiko Is Spending $100K Daily on Blobs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn Ethereum layer-2 network named Taiko is dominating the market for so-called blobs, or dedicated data storage for Ethereum scalers—but those endeavors are resulting in tens of thousands of dollars worth of costs for the little-known scaling solution each and every day, even topping the $100,000 mark multiple times this week.\n\nThe Taiko protocol, which went live in late May, seeks to offer users cheaper and faster transactions than on Ethereum's mainnet, while borrowing elements of the network's security. Since going live, Taiko has spent a whopping $900,000 on blobs in less than two weeks to funnel users’ transactions over to Ethereum’s network.\n\nMeanwhile, Taiko’s competitors, such as the Optimism network, rarely spend more than $1,000 per day on Blob-related fees. Introduced in March as part of an Ethereum upgrade, blobs were billed as a new resource for layer-2 scaling networks to post Ethereum transactions more cheaply.\n\nThe protocol’s maker Taiko Labs announced in March that it had raised $15 million in a Series A funding round. Leveraging “zero-knowledge” cryptography in its design, Taiko is striving to differentiate its scaling design in an increasingly competitive field that includes dozens of different scaling networks.\n\nAD\n\nAD\n\n“Taiko just launched its mainnet, and there’s a lot to be figured out before it becomes stable,” Taiko Labs CEO Daniel Wang told Decrypt in a written statement. “We knew that we will use more blobs than other layer-2s. This is a design decision, not a bug.”\n\nLayer-2 networks often work by bundling batches of transactions together and processing them on a separate chain before posting receipts back to Ethereum. However, Taiko’s design differs from that formula, where lots of transactions are rolled up into batches elsewhere.\n\nInstead, the process of ordering transactions, known as sequencing, takes place on Ethereum itself. In a blog post, Taiko Labs said this process, dubbed “base sequencing,” is more decentralized than that of other layer-2s that rely on centralized sequencers—which are controlled by a network’s development team and collect a small portion of users’ fees.\n\n“That sounds expensive,” Alexei Zamyatin, the co-founder of Bitcoin layer-2 network BOB, told Decrypt in an interview. “It makes it more secure, but not as secure as [Ethereum], and you’re also much more expensive than most layer-2s.”\n\nAD\n\nAD\n\nA game of tradeoffs\n\nStill, Wang stated that the costs associated with Taiko’s functionality could easily reach the point of break-even if “Taiko is fully utilized by users,” providing a sustainable amount of gas fees.\n\nWang added that Taiko is fully aware of the pros and cons associated with its sequencing method, and he hopes that Ethereum researchers will study Taiko’s on-chain data to explore improvements that could allow Ethereum to better support similar scaling networks.\n\nSome Ethereum researchers, including Justin Drake, believe that Taiko’s team is trailblazing a new form of decentralized sequencing that could solve key hurdles in Ethereum’s ecosystem.\n\n“It is making a leap forward in the decentralization, credible neutrality, and composability of rollups,” he told Decrypt in a written statement.\n\nIf more layer-2 networks shifted the sequencing of their transactions to Ethereum itself, then fragmentation issues holding the entire space back could be solved, he stated. As of now, liquidity and assets are largely spread out across different layer-2s, effectively siloing users and applications within a given scaling solution while all being tied to Ethereum.\n\nWhen it comes to layer-2 networks on Ethereum, the introduction of blobs represented a significant shift in how those protocols interact with the underlying blockchain. Before blobs were available as a separate fee market, layer-2s could only post bundled transactions in the form of Ethereum “calldata,” a space for data to be contained within transactions.\n\nInstead of trafficking users’ transactions in bulk alongside regular Ethereum activity, blobs serve almost as a dedicated lane on a highway, where less congestion can reduce costs. However, the best way to package those transactions before they’re shipped is still up for debate.\n\nBlobs blobs blobs\n\nIn some cases, centralized sequencers can be leveraged to grind a network to a halt, puncturing the veil of permissionless activity that is synonymous with crypto. Sometimes, centralized sequencers can be abused to delay transactions too. However, Taiko’s commitment to decentralization may not be the most efficient, according to one of its community advocates.\n\nAD\n\nAD\n\n“Sadly, it’s kind of expensive,” the pseudonymous crypto researcher arixon.eth said on Twitter (aka X). “Because of based sequencing, we need to post a blob every 12 [seconds], and if there aren't enough [transactions], then we just won't fill the blobs.”\n\nBecause of based sequencing, we need to post a blob every 12s and if there aren't enough txs then we just won't fill the blobs Sadly it's kinda expensive, so we really need based preconfs — arixon.eth (@arixoneth) June 1, 2024\n\nWang of Taiko Labs said changing this pace could be a potential solution enacted soon, stating that Taiko’s community is “considering lowering the block proposing frequency a bit.”\n\nThe constant stream of blobs, regardless of how full they are, has made Taiko a top user of them. On Sunday, for example, Taiko posted 25% of all blobs on Ethereum, according to a popular Dune dashboard. That day, Taiko spent nearly $63,000 on blob-related fees.\n\nOn Thursday, Taiko paid $123,000 in fees for blobs—representing 73% of all costs paid for them across layer-2s—which was its second straight day with a six-figure fee tally. And while most layer-2s pass cost savings onto their users through lower fees, the premium Taiko is paying for decentralization, as of now, isn’t a bill that users need to foot.\n\n“For now, it's partially subsidized by the team,” arixon.eth said, adding that the process could be modified in the future so that “blocks are missed until there are enough [transactions] in the mempool for a proposer to push a block to [Ethereum] profitably.”\n\nAmid the network’s first airdrop on Wednesday of TAIKO tokens, the network’s native cryptocurrency, the layer-2 averaged around 6.42 transactions per second, according to L2BEAT. Meanwhile, Ethereum registered around 13.6 transactions per second itself.\n\nSo far, the performance of Taiko’s token has been turbulent. After crashing 40% an hour after it launched, to $2.27 from $3.80, the token’s price had recovered to $2.45, as of this writing, showing a nearly 3% decrease over the past day, according to CoinGecko.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPSmptUTFzc0JSQUpfcU1yVGJ6ZGwyZUtIX1d6MGlHWHI3aV8wZVlETFZRNE9BR0xkY1hFUlBwM1ZHMjZZejJPOWFOSHZkQ1duZ2xGS19hakZQOW12Qy0yZUR2SHh2U3BNbC1fQU90VWI1M1hlXzZ5eXVZaDEyRGM2WWNJLXlUUlgzMEhlanFEM3dpdVR2QUNwcW9oTlJmTjZTXzU4Q21VQzUyYTdf?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin set for new all-time high next week but Ethereum holds it back – 10x Research - CryptoSlate",
        "content": "Crypto research firm 10x Research has warned that a sharp decline in Ethereum prices could prevent Bitcoin from reaching a sustainable new all-time high of over $83,000, according to a June 7 analysis shared with CryptoSlate.\n\nDuring the past week, ETH’s price has considerably struggled compared to Bitcoin’s price. The second-largest digital asset fell by around 1.2% during the period, while BTC’s price rose by more than 3%. While not explicitly explained in the note, 10x Research believes Ethereum could hold Bitcoin back from a sentiment perspective.\n\n10x Research, citing Ethereum’s future position, noted that traders were more willing to punt on BTC. Additionally, the firm predicted that demand for ETH exchange-traded funds (ETFs) would fall short of expectations.\n\nIt stated:\n\n“Positioning in Ether futures is already stretched, and as SEC Gary Gensler said this week, it might take a while until those (S-1) ETH ETFs are approved. Futures positioning increase in ETH has lagged this week at $0.3 billion as traders prefer to buy Bitcoin exposure at this point, [recording] $2.2 billion. The numbers speak for themselves.”\n\nHow BTC can reach new ATH\n\nMeanwhile, the firm believes Bitcoin may hit a new all-time high of $83,000 soon if it breaks a key technical pattern as early as today, June 7, or by Wednesday, June 12.\n\nMarkus Thielen, the CEO of 10x Research, said:\n\n“It’s only a matter of time until Bitcoin hits a new all-time high. The head-and-shoulders formation indicates a rally toward $83,000 soon, with the resistance line likely breaking within the next few days.”\n\nThe firm attributed its bullish outlook to recent global economic activities, including interest rate cuts in Canada, Denmark, and Europe. The prediction also considers a weaker US employment market and a potential decline in inflation as factors supporting the new ATH.\n\n10x Research further explained that it typically takes about $800 million or $8 billion in inflows to increase Bitcoin’s price by 1% and 10%, respectively. These inflows come from various sectors, including Bitcoin ETFs, which recently accounted for 35% of total Bitcoin flow.\n\nSo, to achieve a weekly Bitcoin rally of 5%, the market would need $4.2 billion in inflows, with Bitcoin Spot ETFs seeing $1.7 billion. However, to reach its projected new all-time high of $83,000, 10x Research expects Bitcoin to require over $13 billion in inflows across all sectors. It added:\n\n“A breakout above the $71,600 trend line will naturally result in more upside buying through multiple products, but $13 billion [in inflows] requires quite some commitment. Nevertheless, we think this is possible as a weaker US employment market (unemployment rate at 4.0%) and lower inflation data next week (3.3%) will likely provide the macro backdrop for new all-time highs.”\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOQkdoU0RWQlIyNm9wUjFLOGxZZ0kyUkxsYVpyNFFxMUtqZnhPRWlwVjZ5VGdQSXZieEIyYzJxQzU1eUU0QWtSU2FXcDNMWnEzeEZOZ3pRRzlnTUtRVnc3VHdmVFpLN2dSaVVJWVNRV2d4VFNTeEZ4VmY1U0pSc1VWX3dXQm1tMlZ1VFFheTl3WGN6SW5aczAyUXA0dUZNdmZhQlZKYWJZR1RIdlBva3NKdVhHdU9LTnI3dVFiRTdWc1d2ZWJDdFVsOWpHSmhLQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Demand May Be Muted Compared To Bitcoin ETFs, Analysts Say - Benzinga",
        "content": "The highly anticipated launch of Ethereum ETH/USD exchange-traded funds (ETFs) in the United States may see a more subdued response compared to the initial excitement surrounding Bitcoin ETFs, analysts predict.\n\nWhat Happened: JPMorgan strategists, led by Nikolaos Panigirtzoglou, estimate that Ethereum ETFs will attract a modest $1 billion to $3 billion in net inflows by the year’s end, a stark contrast to the $15.3 billion garnered by Bitcoin ETFs, according to a Bloomberg report.\n\nEthereum’s 109% price increase over the past year lags behind Bitcoin’s 169% surge.\n\nJames Davies, CPO and founder of Crypto Valley Exchange, told Benzinga that analysts are expecting lower demand for Ether ETH/USD as its prominence relative to Bitcoin is not as broadly known and accepted by the public.”\n\nCaroline Bowler, CEO of BTC Markets Pty, concurred, noting, “Ether doesn't have the profile of Bitcoin,” and emphasized Bitcoin's BTC/USD market value of $1.4 trillion, which is three times that of Ether.\n\nSEC Approval Process\n\nDavies is optimistic about the approval process under SEC Chair Gary Gensler, stating, “Everyone sees that ETH ETFs will pass very soon.”\n\nHe added that denial of these ETFs would likely lead to lawsuits, mirroring the legal actions seen with Bitcoin ETFs.\n\nMarko Jurina, CEO of Jumper.Exchange, also expects approval, saying, “Chances of issuance are imminently favorable,” given recent regulatory developments.\n\nLong-Term Advantages Of Ethereum ETFs\n\nDespite the expected lower demand, Ethereum ETFs offer unique benefits.\n\n“ETH has utility mostly not present in the Bitcoin ecosystem, so much of the overall crypto ecosystem is tied to ETH,” Davies noted, suggesting significant long-term growth potential.\n\nVanEck's Head of Digital-Asset Research, Matthew Sigel, supported this view, stating, “Over time, we expect investors to conclude that the potential for application and innovation within the Ethereum ecosystem could be much larger than that of Bitcoin.”\n\nAlso Read: JPM - Benzinga\">JPMorgan: US Crypto Regulations Signal Opposition To CBDCs And Non-Compliant Stablecoins\n\nPotential Selling Pressure And Market Dynamics\n\nConcerns remain about selling pressure from Grayscale's planned conversion of its $11 billion Ethereum fund into an ETF.\n\nDavies warned, “The potential ‘selling pressure’ on Ether from redemptions in Grayscale’s Ethereum fund could be significant.”\n\nHowever, he also noted that net inflows to BTC ETFs could potentially offset this pressure.\n\nBroader Investor Sentiment\n\nEther continues to trade below its all-time high of $4,866, with global investors showing less enthusiasm compared to Bitcoin.\n\nByteTree Asset Management's Charlie Morris observed, “Global investors have been less enthusiastic about Ether, which they have had access to through Europe and Canada for years.”\n\nThe implications of these developments and broader trends in digital asset investments will be a key topic at the Benzinga Future of Digital Assets event on Nov. 19.\n\nIndustry leaders will provide valuable insights into how these strategic moves and regulatory changes are shaping the future of the cryptocurrency market.\n\nRead Next: Is Robinhood’s Crypto Exchange Deal Really ‘Massive’ And The ‘First Domino To Fall?’\n\nImage: Shutterstock"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPT1BQdFlsYkwtZVlTT2pMdHJTV3Z0WnZGNlJNZ1EwQTlWa2VEQURWYzFoQlZIWVZZcHZHa0U1b0JDTXVOR2E3cHc0a0pzSzVkU2JaaVV5X2luTU1JLWNhVFEweENNWjhMNzJFQXdJaUZlNjYwLTBLSG56TDFDLW9BUXI5cVBQajJYV2RKcTFVcjNUZ0VBdXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Shanghai Upgrade: How High Can Ethereum (ETH) Go? - DisruptionBanking",
        "content": "Ethereum, a leading blockchain platform for decentralized applications (dApps) and the giant behind the world’s second-largest cryptocurrency by market cap has always been a frontrunner in innovation from the get-go.\n\nThe Shanghai upgrade, also known as “Shapella”— a coinage of Shanghai and Capella, Ethereum’s execution and consensus layers, respectively—implemented on April 12, 2023, marked a major leap forward by finalizing Ethereum’s full transition to a more energy-efficient proof-of-stake (PoS) network. But this is also changing the staking and liquidity of ether (ETH) as we know it.\n\nETH’s adoption growth was mainly driven by the Shanghai upgrade, which allows withdrawals of staked $ETH, and the popularity of liquid staking. pic.twitter.com/iepA0hCHh3 — Crypto.com (@cryptocom) January 26, 2024\n\nThe Technical Side of the Shanghai Upgrade\n\nThe Shanghai upgrade is a “hard fork” that introduced several Ethereum Improvement Proposals (EIPs), with EIP-4895 being the most notable. This proposal introduces a new system-level operation to streamline the process for validators to withdraw their staked ether (ETH), allowing for more freedom and flexibility. Gone are the days of the manual process, as EIP-4895 automatically funnels withdrawals from the Beacon Chain to the Ethereum Virtual Machine (EVM) once they’re eligible.\n\nValidators have staked about 16 million ETH to secure the network. Since September 2022, when Merge shifted Ethereum’s consensus mechanism from proof-of-work to proof-of-stake, validators have played a critical role. Under the new rule, by staking 32 ETH, validators can participate in block validation, with each staked ETH increasing the chance of earning block rewards. However, the Merge required validators to lock up their ETH and rewards until a future update.\n\nEIP-4895 simplifies this process by automatically checking accounts for eligible excess balances every few days instead of requiring manual requests.\n\nIn a nutshell, validators, as key players in Ethereum’s PoS mechanism, stake ETH to secure the network and validate transactions. Each staked ETH acts like a golden ticket, which enhances the odds of being chosen to propose the next block and earn rewards. Before the Shanghai upgrade, staked ETH and rewards were locked. Still, the upgrade now allows validators to withdraw their assets, which has considerable implications for Ethereum’s liquidity and the staking dynamics.\n\nImpact on Staking and Liquidity\n\nThe Shanghai upgrade fundamentally changed the game for stakers.\n\nThe #Shanghai upgrade allows validators to withdraw staked $ETH locked in the Beacon chain\n\n\n\nAfter one year from that, explore the $ETH supply among the top LSD entities since the Shanghai upgrade\n\n\n\nNotable top 3\n\nLido: + 3.47M\n\nBinance: + 896K\n\nRocketPool: + 291K $LDO $RPL $ANKR… pic.twitter.com/5dY26Ob4Tw — Layer2Gather (@layer2gather) April 12, 2024\n\nWith staked ETH now unlocked, validators can freely withdraw their holdings or stakes and claim rewards freely. This newfound liquidity is a win-win for both investors seeking staking rewards and the Ethereum network itself, which benefits from increased security through staking.\n\nMoreover, liquid staking providers, which offer staking services to users with smaller ETH holdings, may see increased usage due to the ability to unlock staked ETH. These platforms, which charge a fee on staking income, could become even more popular.\n\nMarket Position and Ripple Effects\n\nThe Shanghai upgrade caused quite a stir in the crypto market at the time. The release of unlocked ETH potentially tipped the scales for Ethereum’s position and price, as multiple reports have shown.\n\nIn all, during Ethereum’s transition to PoS, ETH’s price hovered around $1,800. Right after “Shapella,” ETH’s price rose slightly, trading 1.4% higher within 24 hours. It jumped more than 6% immediately after the upgrade, crossing $2,000 for the first time in nearly a year.\n\n📰#DidYouKnow that Ethereum staking APY hit 8.76%, a historical high.\n\nAnd $ETH net deposit saw daily growth after Shanghai Upgrade.\n\n\n\n👀Will the fact that the more staked $ETH & the less circulating pump $ETH price soon?\n\nStay close: https://t.co/OfKehFd4Vu pic.twitter.com/Fr5zZ927D5 — Gate.io (@gate_io) May 16, 2023\n\nCrypto trading advisor Laurent Kssis of CEC Capital predicted short-term volatility as traders who bought ETH in anticipation of the upgrade sold their holdings to cash out. Kssis suggested that this selling could lead to a strong supply of ether flooding the market, potentially causing the price to drop. At the time of his prediction, ETH was trading near $1,875, and he speculated that it could drop below $1,700 for the first time in two weeks as investors take profits.\n\nDespite short-term fluctuations, at the time, the long-term impact of the upgrade could be positive, particularly if institutional investors are attracted by the increased security and stability of the PoS system. This could boost institutional demand for Ethereum, potentially driving its price in the long run.\n\nMoreover, the Shanghai upgrade wasn’t just about validator rewards. The upgrade also included proposals to address Ethereum’s major weaknesses: slow transaction speeds and high fees. These issues have been a thorn in the sides of DeFi and NFT applications. The surge in DeFi activity has significantly increased the total value locked (TVL) on the Ethereum chain, and the NFT boom from 2021 to early 2022 has further exacerbated these problems, leading to poor user experiences and high transaction costs.\n\nProposals EIP-3855 and EIP-3860, part of the upgrade, address these issues to make transactions faster and cheaper. This could reignite interest in DeFi and NFTs on the Ethereum network. While EIP-3855 should help address transaction speeds, and EIP-3860 hopes to reduce transaction costs, their broader effect on ETH transactions remains to be seen.\n\nEIP-4895: enables validators to withdraw their stake of 32 $ETH from the staking contract on the Ethereum blockchain since the transition to Proof-of-Stake (PoS).https://t.co/x1mGqv9ZZR — IQ (@IQWIKI) April 3, 2023\n\nThese improvements might encourage ecosystems affected by high gas fees and slow transactions, which had moved to other chains like Solana or Ethereum layer-2 solutions like Polygon, to consider a comeback.\n\nThe Shanghai upgrade is a watershed moment for the platform itself and the entire crypto landscape. By enabling validator withdrawals, the upgrade has not only boosted Ethereum’s liquidity but also has the potential to shape its market position. As Ethereum progresses on its innovative path, it will be interesting to see how these developments shape the future of decentralized finance and digital ownership and ultimately influence the future of the entire crypto landscape.\n\nAuthor: Ayanfe Fakunle\n\nThe editorial team at #DisruptionBanking has taken all precautions to ensure that no persons or organisations have been adversely affected or offered any sort of financial advice in this article. This article is most definitely not financial advice."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE56NnE1bzlhVDlqcXN6TG1Pc3ZOTHJ1b25HYzNEdDBrb2ctSnU2ZFlSVkxmbTRjakEwdlBjUi1sSzNxY0xieWZTT0RfMWlKN0ZTcWd5Uk5FRW9ZWTZyTmVCbUJPQWRYY2RDRUxhVlA2SC02Z9IBd0FVX3lxTE80SHUzZE5oUlhxY2diUkZSWEdNS0JuZG5UUmlLcE52MjZUTXlYSDkxdHBxdmMtUzVlVWdwaFg4RG9NcVRkbVBHUXZNRFR5VGc4VUNua2czWUFwMk50STNVWmZ6YVllV2lnblFkQ25ZN1c2SklxTWRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ancient ETH Whale Wakes Up, Moves Money to Kraken - U.Today",
        "content": "Advertisement\n\nYesterday's cryptocurrency prices dropdown was accompanied by activity of ICO era whales. One of them moved 25% of his virtue to the Kraken exchange in a single transaction.\n\nEther whale from 2015 moved 15,000 ETH to Kraken\n\nUnknown Ethereum (ETH) whale who received 67,000 Ethers during its initial coin offering (ICO) back in 2015 initiated a monstrous transfer to Kraken, Chinese crypto journalist Colin Wu says.\n\nThe transaction was registered on June 7, 2024. In total, the account transferred the equivalent of roughly $56.1 million to the large centralized exchange.\n\nAdvertisement\n\nAs of today, the account has $152.3 million worth of Ether (ETH) for selling, the public explorer's data says. It was only the third transaction of this account since 2022.\n\nIn 2020-2021, the account sent to centralized exchanges a gargantuan amount of crypto: In six transfers, it moved over 150,000 Ethers or over $553 million.\n\nAs covered by U.Today previously, Ethereum Foundation might have initiated a dump of 1,000 Ethers (ETH) a month ago.\n\n$50 million in Ethereum (ETH) longs liquidated in 24 hours\n\nA large part of this dump was immediately exchanged for 4.81 million DAI, averaging $2,725 per ETH.\n\nIn the largest liquidation wave in months, yesterday, Ethereum (ETH) traders lost over $50 million in short and $5 million in long positions, Coinglass data says.\n\nBy printing time, Ethereum (ETH) is changing hands at $3,694.04, being 2.89% down in the last 24 hours."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVVpEczZUd1RQVXNLVGNSUlVwUmJwVVVEaE42dFRxMWdrRzZMZS16bFlOTUxNcjE2OXhYT2FGV3V6azlqeEhfYnVjUDI3cHpwQW51ZE03elBuNEtvRHlydFdoQUtqbkdzdDhPUFF1OHcxdmJwWi03a1VhRmRVMlRpczBHaDVzbWJ4V1Zz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Robert Kiyosaki Predicts Bitcoin to $100K: How Ethereum and Furrever Token Fit into the Picture - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 07, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market is buzzing with excitement following a bold prediction from Robert Kiyosaki, the renowned author of \"Rich Dad Poor Dad.\" Kiyosaki forecasts that Bitcoin (BTC) will reach $100,000 by June 2024. This bullish outlook has sparked widespread interest and speculation within the crypto community, highlighting Bitcoin's potential and drawing attention to other significant cryptocurrencies like Ethereum (ETH) and Furrever Token (FURR). Here's a detailed look at how these three cryptocurrencies fit into the evolving market landscape.\n\nBitcoin: The Path to $100K\n\nKiyosaki’s prediction is grounded in several key factors that suggest a strong upward trajectory for Bitcoin. As of early June 2024, Bitcoin is trading near $68,500, with technical analyses indicating a symmetrical triangle pattern that could push its price to between $74,000 and $75,000. This bullish continuation pattern, coupled with a surge in Bitcoin ETF inflows and the post-halving supply dynamics, supports a potential breakout.\n\nMoreover, Kiyosaki's forecast is backed by historical trends and macroeconomic conditions. He has emphasized Bitcoin as a hedge against inflation, taxation, and stock market manipulation, urging investors to trust in assets like gold, silver, and Bitcoin. The recent approval of Bitcoin ETFs has further fueled market optimism, attracting substantial buy-side demand and reinforcing the cryptocurrency’s upward momentum.\n\nEthereum: Riding the Wave of Innovation\n\nWhile Bitcoin garners headlines with its dramatic price predictions, Ethereum remains a cornerstone of the cryptocurrency market due to its versatile blockchain technology and widespread adoption. Ethereum’s recent price movements and potential ETF approvals are significant developments that could impact its market performance.\n\nIn late May 2024, BlackRock updated its Form S-1 for the iShares Ethereum Trust, signaling a likely approval of Ethereum ETFs by late June. Such a development would boost investor confidence and likely lead to increased demand for ETH, mirroring the positive effects seen with Bitcoin ETFs. Ethereum’s utility in decentralized applications (DApps) and smart contracts continues to drive its adoption, positioning it as a critical player in the crypto space.\n\nMoreover, Ethereum’s transition to a proof-of-stake (PoS) consensus mechanism through the Ethereum 2.0 upgrade has significantly reduced its energy consumption and increased its scalability. These advancements are expected to enhance Ethereum's appeal to both institutional and retail investors, further solidifying its market position alongside Bitcoin.\n\nStory continues\n\nFurrever Token: A Charming New Contender\n\nAmid the buzz around Bitcoin and Ethereum, Furrever Token (FURR) is making waves as an emerging meme coin with a unique proposition. Launched with the aim of creating a heart-warming crypto ecosystem centered around adorable cat imagery, Furrever Token has quickly attracted attention from investors seeking high returns and community engagement.\n\nCurrently priced at $0.000732, Furrever Token’s presale has already raised over $1.2 million. The project offers a 25% bonus on new purchases until June 10, 2024, providing a compelling entry point for new investors. With its potential for up to 15X returns, Furrever Token appeals to both seasoned crypto enthusiasts and newcomers.\n\nSeveral factors contribute to Furrever Token's potential success. Its engaging community initiatives, regular challenges, and exclusive content are designed to foster loyalty and active participation. The token’s focus on cuteness and fun sets it apart in a market often dominated by technical and financial considerations, offering a refreshing alternative for investors.\n\n\n\n\n\nThe Synergy Between Bitcoin, Ethereum, and Furrever Token\n\nThe interplay between these three cryptocurrencies highlights the diverse opportunities within the crypto market. Bitcoin’s role as a store of value and hedge against macroeconomic risks, coupled with its significant market movements, sets the stage for broader market trends. Ethereum’s ongoing innovations and potential ETF approval underscore its critical role in blockchain technology and decentralized finance (DeFi).\n\nFurrever Token, while distinct in its approach, leverages the growing interest in meme coins and community-driven projects. Its unique appeal and structured incentives make it an attractive investment, especially in a market environment where investor sentiment can be significantly influenced by novelty and engagement.\n\nConclusion\n\nRobert Kiyosaki’s prediction of Bitcoin reaching $100,000 by June 2024 has undoubtedly intensified interest in the cryptocurrency market. As Bitcoin continues its bullish trend, Ethereum's technological advancements and potential ETF approval position it for significant growth. Meanwhile, Furrever Token offers a unique and engaging investment opportunity with its charming community-focused approach.\n\nFor investors, this trio represents a balanced portfolio: Bitcoin for stability and long-term growth, Ethereum for innovation and utility, and Furrever Token for high-risk, high-reward potential. As always, thorough research and consideration of individual risk tolerance are essential when navigating the dynamic world of cryptocurrencies.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNNGZEa2dob0VxUU0tTzE0OWNRY2s0OTdsQ1hBZGN1T0FNRzZ5QkpCenB3WTlfMVBOemkxUlhGcW55U3FJZW9abzNJbWlJQ29uRm5Yd2JqMlNlem5fM2VPd185X2F3cElDZ2QwQjhVRmxFWGh0blZGSC03bG5GMERyTUItc0lWTnJxRkVJc3ZNOE4yNndhNHlKT1RjOXlNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg analyst calls for FOIA request into SEC’s Ethereum ETF decision - CryptoSlate",
        "content": "Bloomberg ETF analyst James Seyffart called for freedom of information access (FOIA) requests regarding the SEC’s approval of spot Ethereum ETFs.\n\nIn a June 5 KITCO interview, Seyffart said that public requests should search for “emails, calls, [and] anyone that had conversations with [SEC chair] Gary Gensler” to determine what happened during the SEC’s decision-making process.\n\nHe said unused denial orders could exist due to the agency’s rapid change in stance.\n\nVoting is unclear\n\nSeyffart said the SEC approved the spot Ethereum ETFs through delegated authority, a common approach but a rare choice for the issue at hand.\n\nDelegated authority also means voting records are unclear.\n\nSeyffart said that the choice points to a politically motivated decision, stating:\n\n“Until I have somebody come out and show me smoking gun evidence … this was political.”\n\nSeyffart said the “leading theory” is that a Biden administration member called SEC chair Gary Gensler and influenced the agency’s decision.\n\nA secondary theory posits that someone swung the vote of a Democratic SEC commissioner who previously voted against spot Bitcoin ETFs. The reversed vote could have led the SEC to vote at least 3-2 in favor of spot Ethereum ETFs even if Gensler voted against the funds.\n\nIt is still possible for a commissioner to challenge the decision and force a vote. However, Seyffart said Democratic commissioners are unlikely to gain anything from making the voting record transparent.\n\nHe previously said a challenge is unlikely to influence the actual voting results.\n\nSEC should be less political\n\nSeyffart also discussed the broader impact of politics on the SEC. He argued the SEC should not be wholly apolitical but less political than it currently is.\n\nSeyffart believes that, until recently, the SEC has decided to deny spot crypto ETFs and proceeded to find legal justification for its stance after the fact.\n\nInstead, the chair should choose the issues the agency focuses on and seek legal input from individual commissioners, leading to a decision “based on logic and reason,” Seyffart said.\n\nMentioned in this article"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOTTBOdDRiY2JlN3lYdFZTWVd3THZlLUJQUWcxTXNMeXRrbVhyT3RRd2ZLQ2NrTEdTUlR1c0pFTmZJYUF1cDFRTXZiSGctN21wYms5aVpiYnRrRURXYkY2V2xyS0FNN3RINng5UHEycWZfcC1VYm10M2p6WkRlVHRHU09na9IBiAFBVV95cUxQc2NGQkZQQmllcmJBQXp5VE41NElKbjg1OVR6cGx6NWVpbTc5NWFjQVJpbGtMWUJ2RXREdzl6T1hQZHFDWTl4R2UzMlZzQnBwMmpqN3JwVnRrNVoxZVR3LWpzWk1MQlBJcV85QVJKMzJHSFBtVnlVemFtY0V3MVZUSExtWEYxVGl0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Biggest Ethereum (ETH) Hard Fork Coming: Pectra Agenda Announced - U.Today",
        "content": "Advertisement\n\nPrague-Electra (or Pectra) upgrade is going to advance security, scalability and performance developments accomplished by Cancun-Deneb. While its final agenda and activation date are still being discussed, Pectra is expected to be among the most radical upgrades of the Ethereum (ETH) design.\n\nEthereum Pectra upgrade to replace AA and changes game in staking\n\nEthereum (ETH) developers agreed about at least five of Ethereum Improvement Proposals or EIPs that will be included in the Pectra upgrade. The list was shared by Anthony Sassano, independent Ethereum (ETH) researcher and educationist.\n\nEIP-7702 is set to replace Ethereum's (ETH) current Account Abstraction mechanism, ERC 4337. It will advance the way Ethereum (ETH) accounts are performing activity of smart contracts.\n\nAdvertisement\n\nEIP-7594 \"Peer Data Availability Sampling\" will upgrade the scaling opportunities of Ethereum's L2 rollups. EIP-7251 \"MaxEB\" will raise the limit of stake in Ethereum (ETH) PoS and introduce triggerable exits for its participants.\n\nEIP-2537 is set to add functionality to efficiently perform operations over the BLS12-381 curve, including those for BLS signature verification, as per EF main GitHub repository.\n\nLast but not least, EIP-7549 will make consensus voting procedures more efficient by reducing the average number of pairings needed to verify consensus rules.\n\nPectra hard fork expected to be activated in Q1, 2025\n\nSassano added that right now the history expiry function is being considered for inclusion in the next hard fork. Meanwhile, hotly anticipated Verkle Trees will likely be added in Osaka, the first post-Pectra hard fork.\n\nThe Ethereum (ETH) veteran concluded that his particular estimation for the Pectra activation date is Q1, 2025, while in some sources, community enthusiasts also discuss Q4, 2024, as a potential timeline.\n\nAs covered by U.Today previously, Prague-Electra upgrade specifications were introduced to the community in January 2024."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNMU9wNkxiUGJ6dVFKQ0s0YVpVZldkNzgzTVdPb1IwMm96RHNGOVNzY21OanhITTh5Z3ItazY4RUQ1U0l2SXY1VEZnbVZQcmFuRWJMbjZxaFJ4WklhVTZ1V05aa1NiRWtrT2ZmTVptNmp6MHpQcHpmVUJtRndWajR6THE3dzRiOG9NTnBKYk9udDdjRVdya2t1NtIBngFBVV95cUxQeWdDLURjNHV6bzdlenBzSnRRSVRwNzhzblRSUUNHdTFFb2JxTHNUSjlycmlVYVF3UGJJQjMzalllSXA2TUFibXg0enVJNWJKOU5EZW84MGpSWUJ3aUhGb1JSOEtxYlRic1NDdGx4MWgzX0M5UWcwbWpsQ3JYZ0xZeTdiN3pRLVdyanVxMjBMcW4yLUpqOXVicW9JTGlxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Analysis: Why Ethereum Price Can Break Out to $5000 - CoinGape",
        "content": "Ethereum price has been consolidating amid a bigger market structure—the bull flag. Investors are watching closely for when the price of Ethereum decides to move higher, as 30% gains may be at stake if they miss the move. In the meantime, Bitcoin adoption continues to soar as BTC price seeks to break the previous all-time high price.\n\nETH price hovered around $3,811 during European trading hours on Friday, a 1.3% decrease in 24 hours and a 1.4% increase in 7 days.\n\nadvertisement\n\nETH/BTC Price Analysis: Ethereum Price Creeping Up Channel, May Breakout in Less than 1 Week\n\nEthereum price has been stuck in the current consolidation zone for the past eight days. Nevertheless, this chart pattern is part of a previously formed bull flag with massive profit implications if it breaks out.\n\nThe price of Ethereum is trending above the 50-day and 200-day simple moving averages (SMA), signaling bullish sentiment among investors.\n\nAdditionally, ETH price action has been creeping up an ascending channel, which indicates a short accumulation phase before a breakout.\n\nExtending the channel shows ETH price may try a breakout in about 4 days if all factors remain constant. However, fundamental news can either make or break the current Ethereum market structure.\n\nOn the other side, Bitcoin price is also sporting a bull flag, but in a 4-hour timeframe. The price is also trending above the 50-day and 200-day SMA, a bullish signal for the asset. BTC price is currently en route to testing the upper boundary of the range.\n\nIf it manages to break out, we may see a $74,000 Bitcoin price in the coming days. $72,300 may push some resistance, but if the bulls are strong enough, they may slice through this barrier easily. On the flip side, strong support exists around $67,000 that may hold up the price.\n\nETH/BTC Price Future Outlook\n\nEthereum price went from $2,800 to $3,900 in one candle, and it is currently holding up well at $3,700 to $3,800. All this is happening before the S-1 applications are approved and an ETF is launched.\n\nWhile Bitcoin grinds up slowly, ETH price holds the keys to big gains after $4,000 with the ETF launch. The market is eagerly waiting for S-1 clarity as the 10-day window to revoke the ETF has elapsed.\n\nOn the other hand, Bitcoin’s open interest hits a new high at 520,000 BTC, exceeding March’s all-time high. Meanwhile, Bitcoin ETFs are thriving with $488.1 million inflows.\n\nBottom Line\n\nThe crypto markets are full of speculation, which often proves accurate. The Bitcoin ETF represents the best-case scenario. As investors speculate on the ETA of the Ethereum ETF, there is a general sentiment that the SEC is stalling and that ETF approval is inevitable. Investors eagerly await the outcome of this ETF struggle.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxPeF9mdmlOX0dvcHpZSkdjMFkxbjZOOHdGbzE0Q3ZjUlREZmZfUlVhaWhMRUhmQUpRZWcyeUwtYmRLeGVCRWV4bGNVQU9tRnd4M0F0ZTdRb1I2dy0tUXg2U1g2WUhSS21fYmVodHpiYUtRYmo4aVdSRmduNUEtWDlsb3FLUW1aWDVyZ3hHNy1GQW5DODR2YThKQXhiMndwczJuSldpYklXV2llSHAyVFFnQlczeHQ3YzRmb3M5QkJKdFpiZFZ2bDJQdGtJbU1kWTVLOVFkTlNmWTBqMHNHbnVNcVVR0gHnAUFVX3lxTE0yZndfb1ZQekFKdlcySkU5cU5EaExqVy1wWGk2ME9PQ3JBaUFGZDZJWVBydmtWWDc1dUFoQlhBVHVwOEw0eXRmWjdqQ1R3Q2VnNGZsVHZ6Y3ZvNzgxUDVrNGdFdEhGNVowbmNJMC1QUzhZUF9VVFdWeTBxS2pLQVE0R1UtVHRGcXFiUThQRmVPNzVnUFlZUmUxbXVJZFZrRXRoMHk0WUloWFBia19HVzRfbmtYemNVb0pySjBaMFZ5d3p5SGZkNFhCOUxwbi0wc1d4cVhwT2hMZmxjbmo3eGNHOGNGU1pONA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's price suffers slight decline amid Hong Kong's plan to allow staking in ETH ETFs - FXStreet",
        "content": "Hong Kong issuers are allegedly working toward incorporating staking into their ETH ETFs.\n\nProShares submits 19b-4 application for spot ETH ETF.\n\nEthereum will likely continue its range-bound movement over the weekend.\n\nEthereum (ETH) is down more than 3% on Friday following news that Hong Kong will allow issuers to integrate staking features into their spot ETH ETFs. ProShares also submitted a 19b-4 application for a spot ETH ETF with the Securities & Exchange Commission (SEC) on Thursday.\n\nDaily digest market movers: Hong Kong ETFs, ProShares join the train\n\nEthereum ETFs are the main subject of discussions surrounding the number one altcoin. Here are the latest market movers:\n\nHong Kong asset managers are allegedly working toward incorporating staking features into their spot Ethereum ETFs, according to Animoca Brands co-founder and Executive Chairman Yat Siu. Hong Kong crypto ETFs have struggled to garner investors' attention despite the excitement surrounding their initial launch.\n\n\n\nHowever, with the added rewards of staking, Hong Kong ETH ETFs could be attractive to investors worldwide, especially as the SEC has signaled that it won't permit issuers to offer staking if/when spot ETH ETFs launch in the US.\n\nRead more: Ethereum ecosystem active users spike 55% in Q1, 2x ETH ETF records impressive volume\n\nAsset manager ProShares submitted a 19b-4 form with the SEC on Thursday, stating intentions to issue spot Ethereum ETFs on the New York Stock Exchange (NYSE). The move puts ProShares as the latest member in the list of prospective spot ETH ETF issuers.\n\n\n\nThe SEC earlier approved the 19b-4 filings of eight issuers on May 23, including Van Eck, Bitwise, BlackRock, Fidelity, Franklin Templeton, Invesco & Galaxy, Grayscale and 21Shares. Following the approval, issuers submitted updated S-1 registration statements with the SEC, which the agency must approve before the ETFs go live.\n\nAlso read: Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time\n\nSEC Chair Gary Gensler told Reuters on Wednesday that the timing for spot ETH ETFs to launch depended on how responsive issuers are to the SEC's comment on their S-1s.\n\nETH technical analysis: Ethereum to sustain range-bound move over the weekend\n\nEthereum is trading around $3,781 as it continues its range-bound movement on Friday. The ETH long/short ratio is skewed toward shorts, with a 48% to 52% difference in the past 24 hours, according to data from Coinglass. This indicates a slight bias towards a bearish view, especially as ETH's long liquidations are at $52.14 million compared to $7.37 million of short liquidations.\n\nRead more: Ethereum leveraged ETFs go live as price fails to react\n\nConsidering current market conditions, Ethereum will likely stay above the $3,730 support.\n\nETH/USDT 4-hour chart\n\nHowever, higher bearish sentiment will see the $3,618 support become the next key price to watch out for. ETH may sustain the horizontal move over the weekend and before beginning another attempt toward the $3,901 resistance.\n\nA successful move above the resistance will see ETH begin a move to tackle the $4,093 yearly high before aiming for a new all-time high.\n\nA daily candlestick close below the $3,300 level will invalidate the bullish thesis."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUE9Rc3FyMTZUMzVxVlpsejY3QlFaVmM3LXVxR1FTV1huUmhfYnZQNzdWSjV2ajJzVVRvRlBpSDdTSGx2ZEZKWjAtNkp0cmltUGlMQ05UU1dxdFlOV19NckVHdW9YWC1fUW1HNXczRzlKM1pfN2NUZVlXN3hORjd4S1ctUDdlZ9IBjgFBVV95cUxPWmExNGFicWJGUGpEc0EtT0x2cC1TZWstWTdxcjctOHh3Ykx2aV81UFU2emI4UkNHRDU5Y3U1QnI5Q2drQVZqdFgxd1BIbFhtRXZwNXk5TzZicUxzN2RGZXFOM2xLem4zYnk0VjFyY3d3U2tBUWdnejRxZE5FcnBHeE83cmIzeEZGdW1udGJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Pump—Then Dump—Amid Roaring Kitty Rush - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin and crypto investors received a lot of good news this week, even though the market still can’t manage to break free from its highs three months ago.\n\nOn Tuesday, the US Bitcoin spot ETFs absorbed net inflows of $887 million—the second-best daily performance for the ETFs to date. The price of Bitcoin surged above $71,000 in the process, reaching its highest price since March.\n\nThat performance was followed by not one, but two high-profile Bitcoin ETF sponsors assuring investors that a second, much larger wave of institutions was coming to buy Bitcoin through the funds. Bitwise CIO Matt Hougan wrote in a memo that crypto regulatory progress on Capitol Hill was untapped “alpha” for investors, while Franklin Templeton CEO Jenny Johnson said the ETFs had only been touched by their “first wave of the early adopters.”\n\nAD\n\nAD\n\nJUST IN: Franklin Templeton CEO on #Bitcoin ETF adoption says “This is really the first wave of the early adopters. …the next wave is the much bigger institutions.” WATCH👇 pic.twitter.com/G52jWUEetX — Bitcoin Archive (@BTC_Archive) June 5, 2024\n\nAnd at least in the memecoin world, the bull market appeared to be back in full swing. Bitcoin’s very first BRC-20 token, ORDI, surged by over 30% to $60 as of Friday, while PUPS and Bitcoin Wizards (WZRD) more than doubled in value intraweek, according to CoinGecko data.\n\nOther more popular memecoins like PEPE, BONK, and SHIB weren’t as lucky, all posting losses this week.\n\nThe Solana-based meme coin GME seriously spiked, blasting up 467% at its height this week, building on the momentum of its stock market namesake Gamestop (GME). Meme influencer Roaring Kitty—who sparked the Wall Street-confounding GameStop movement back in 2021—gave the stock a second wind with his surprise returns to both YouTube and live streaming, with his net worth briefly edging toward $1 billion—before a Friday cold shower from the game retailer.\n\nPerformance-wise, between Bitcoin and meme coins is Ethereum, which kept pace with Bitcoin’s gains this week as its progressed toward a spot ETF launch. VanEck analysts posted a lengthy report arguing that ETH will reach $22,000 per unit by 2030, after sucking away financial market share from Apple, Google, and big banks.\n\nAD\n\nAD\n\nFinally, with both the Bank of Canada and European Central Bank lowering interest rates this week, BitMEX co-founder Arthur Hayes told followers that it was officially time to start apeing into Bitcoin and shitcoins.\n\nYet his call may have been a tad premature: at the end the week, a liquidation cascade on Friday sent Bitcoin crashing from $71,000 to $68,000, and ETH down from $3,800 to $3,600. Meanwhile, GME—both the stock and the memecoin—cratered by over 35% each.\n\nRoaring Kitty is the greatest business communicator since Steve Jobs. Dude shows up 30 minutes to the livestream. Builds the tension up to 11. Shows up on the livestream in a fake bandage and cast. And the first thing he says is “oh shit”. pic.twitter.com/YlTesdxJGB — Trung Phan (@TrungTPhan) June 7, 2024\n\nBitcoin is trading for $69,335 as of writing, while Ethereum is priced at $3,686. The price of the GME meme coin has once again settled near $0.014.\n\nPrices current as of 3am ET on June 8, 2024. Edited by Ryan Ozawa."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQT0VCSG52aWpsTm1CdlV4cjdnZ1I2ZFQ2QmdhYmx5aHktcjEwR3VrQzN5VDhuVnhJX25GanA4R2psS2lNMjEzNUd1R0RvcFd2Qm1Tdmd5SnlzZERqLWszUGo1SGJpNlZtRGNnQjI3OGdPTW9TWFItRmRPcGpxY1NNeW1YcW9KMF81ZUxFc1dqcmx5d2ctak1N0gGcAUFVX3lxTE9aYVJ3ZHl2bGowbnlTX3o5MUlQZVA1dVpzZDJBb1pBRXVqYXRQMWt5T2taSUVORlFJSWNDOFYyWllQM3l5bXpzM0lfeXlfNVBEVmJabFVkN1lfNXFNZURsOXNMLWluQmg4UFBUb3JNeVVwRExXQ0ZXcUJoTFNVeEZoNURHUURuMlltb2FBTDhTVTFMT05TaGJrejVDRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "VanEck Exec Reveals Next Move In Spot Ethereum ETF S-1 Approval By SEC - CoinGape",
        "content": "In a recent interview, Matthew Sigel, VanEck’s Digital Asset Research Chief, discussed the significant regulatory progress and future prospects surrounding the firm’s Spot Ethereum ETF. On May 23, the SEC approved a rule change that could pave the way for Spot Ether ETFs, marking a “regulatory 180 in recent SEC history.” Moreover, now the VanEck exec has revealed the ETF issuer’s next move in the approval of Ether ETFs.\n\nVanEck Confident On Spot Ethereum ETF Approval\n\nThe recent approval indicates that Ethereum is recognized as a commodity. Furthermore, Sigel described this development as “tremendously bullish for the prospect of innovation happening on open-source blockchains.” In addition, Sigel emphasized that this regulatory shift could herald a new era of blockchain activity.\n\nadvertisement\n\nHe also highlighted that 2024 has already seen record highs in various metrics. These include the number of blockchain addresses interacting, the volume of transactions, and user fees. Sigel noted, “It’s great news. Bitcoin and Ethereum are both up more than 60% this year,” according to a CNBC interview.\n\nMoreover, VanEck has been at the forefront of these developments, being the first traditional ETF issuer to file for a Bitcoin ETF in 2017 and a Spot Ethereum ETF subsequently. Sigel expressed optimism that VanEck’s Ethereum ETF could be among the first to trade among its rivals. He stated, “I still hope and expect that the VanEck Ethereum ETF, if it’s approved, will trade first.”\n\nThe next critical step involves the SEC’s approval of Ethereum ETFs’ S-1 filings. Sigel explained, “To list one of these ETFs, it’s like a nuclear code: you need two keys—the 19b-4 and the S-1. We’ll have to wait and respond to the agency’s comments if there are any, and we’re hopeful that these products can be trading in a matter of weeks.”\n\nAlso Read: VanEck Advisor Slams TradFi Over GameStop Saga, Hails Bitcoin\n\nImplications On Ether & Crypto Market\n\nWhen asked about the broader implications for Ethereum, Sigel revealed a bullish forecast, projecting Ethereum could generate over $70 billion in free cash flow to token holders by 2030, supporting a coin price of $22,000. This forecast reflects a more constructive view of the political landscape and the recent boom in users transacting on the network due to Ethereum’s scaling roadmap.\n\nIn addition, the VanEck exec also touched on the transformative potential of crypto assets. He noted, “This is an open-source app store with the potential to take significant margin away from the big tech platforms and also banking.” The VanEck exec also emphasized the importance of educating traditional market participants about the real-world use cases of these assets.\n\nThe approval of the Spot Bitcoin ETFs earlier this year has already opened up the market to a new class of buyers. These include registered investment advisors and pension funds, which could be a similar case for Ethereum ETFs if approved. Sigel pointed out, “The Spot ETFs have opened up an entirely new class of buyers, and we’re seeing that market share gain continue.”\n\nLooking ahead, Sigel acknowledged the political shift toward a more favorable regulatory environment for crypto, driven by significant industry lobbying efforts. He commented on the recent passing of the Fit for the 21st Century Act by the House. Sigel stated, “It lays the groundwork for a much more favorable environment next year.”\n\nAlso Read: ETH/BTC Price Analysis: Why Ethereum Price Can Break Out to $5000\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQaFNSRm9FQmR6ZExoMUlweV9LOFdhY1FkaG1iMnpJTmNKRlVLV2JUTjBXS2h6U1JLdllKNHlTcWVja2s3dHVwY1BhRmh3WHU1SFplQXhBZGVLLWVMdEpaUXVWTlJqZW1xMzlYZHJ3VDQzMzNYeV9pbVlVNlFMVlc5ZDNtNTg0aUc1emJ0cDdJeVBOdDNYV2lIaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "The Ultimate Cryptocurrency to Buy With $1,000 in June - The Motley Fool",
        "content": "With a little digging, it's easy to see why Ethereum is a top choice.\n\nIf you've got $1,000 to invest that you don't need for anything else in the short or medium term, and are looking at the cryptocurrency market, there are literally thousands of options. However, based on a combination of fundamentals and recent developments, Ethereum (ETH 0.21%) stands out from the crowd.\n\nThere are several compelling reasons why the world's second-most valuable cryptocurrency is deserving of your $1,000, but three stand out above the rest: regulatory acceptance, its deflationary nature, and its dominance in decentralized finance (DeFi).\n\nRegulatory acceptance looms\n\nThe Securities and Exchange Commission (SEC) recently approved applications from several firms looking to launch the first spot Ethereum exchange-traded funds (ETFs). This paves the way for these firms to submit their S-1 forms, which would then allow the ETFs to go live. These ETFs are expected to become available for trading sometime in late June or July.\n\nHaving spot ETFs is a game changer for democratizing access to Ethereum. It will mean that investors can purchase Ethereum through a traditional brokerage account, eliminating the need to navigate often complex and intimidating crypto exchanges. This ease of access will likely attract a broader range of investors who have been hesitant to enter the crypto market.\n\nThe most significant impact, however, is the potential influx of institutional investors. Until now, many institutional investors have been wary of directly investing in cryptocurrencies, including Ethereum, primarily due to regulatory uncertainties and the lack of a straightforward investment vehicle.\n\nThe approval of spot Ethereum ETFs removes these barriers, allowing institutions with deep pockets to participate in the market. This probable influx of institutional capital could put significant upward pressure on Ethereum's price, similar to what we saw with Bitcoin (CRYPTO: BTC) following approval of spot Bitcoin ETFs early this year. In the months after the spot Bitcoin ETFs launched, they were buying Bitcoin at 10 times the daily production rate, driving its price to a new all-time high. If things unfold in a similar fashion, Ethereum could experience a similarly explosive boost.\n\nDeflationary dynamics\n\nWith a new set of buyers entering the market, Ethereum's price could benefit even more than Bitcoin's thanks to a crucial upgrade the blockchain received in 2021: the London hard fork. This upgrade introduced a mechanism that makes Ethereum deflationary by burning a portion of the transaction fees. Essentially, every time a transaction is processed, a small amount of ether is permanently removed from circulation.\n\nUnlike Bitcoin, which has a fixed supply cap of 21 million coins, Ethereum does not have a supply maximum. However, the deflationary mechanism introduced by the London hard fork means that, under the right conditions, more ether is burned than is created, reducing the overall supply. This burning mechanism is particularly effective during periods of high network activity, as more transactions result in more ether being burned.\n\nBitcoin is often lauded for its low inflation rate, but it is worth noting that Ethereum's inflation rate is currently lower. Since the London hard fork went live, Ethereum's inflation rate is approximately -0.18%, meaning that its supply is actually decreasing.\n\nThe pending launch of Ethereum ETFs could significantly alter the supply and demand dynamics, potentially sending its price even higher. Increased demand from ETF purchases, coupled with the deflationary effect of the burn mechanism, creates a perfect storm for price appreciation.\n\nThe DeFi champion\n\nIf the pending launch of ETFs and the deflationary nature of Ethereum are not enough to persuade you to invest, consider Ethereum's undisputed leadership in the DeFi space. More than 60% of the DeFi market is built on the Ethereum blockchain, which is not just a statistic but a testament to its foundational role in the future of finance.\n\nDeFi represents a revolutionary shift, transforming how financial services are delivered by eliminating the need for traditional intermediaries. Instead of relying on banks or other financial institutions, DeFi platforms offer services such as lending, borrowing, and trading directly through blockchain technology. Ethereum's robust smart-contract capabilities make it the perfect platform for these applications, enabling secure, transparent, and automated transactions without the need for a trusted third party.\n\nThe significance of Ethereum's dominance in the DeFi space cannot be overstated. As more DeFi applications are built on Ethereum, the network's utility and value increase. This growing ecosystem creates a positive feedback loop: The more users and developers who participate, the more valuable and indispensable the Ethereum network becomes. This network effect not only enhances Ethereum's current value but also ensures its long-term potential as the backbone of decentralized finance. As DeFi continues to expand and integrate with traditional financial systems, Ethereum's pivotal role will likely drive substantial and sustained growth."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPV0dsdU02Z0F5TlZqTTc1TXVEYUNfaW5EV0pBTVI5SFRjUkRQRWcyUVZYd090RGZ1ZjRMMjhoMDB1Y1ROWDhWZ1JCMmRfU3NPSlVLbHRkRU5wOWxmNkk3SWNEdjh6MWVqWlpyUEFGSndaNTF4UFpOODJsQTFUSEZUTGk4WDJ5dVdfMndYc1hadksxMzFOd21hRWZIeXJlWTRkcHFDQ21tcTF0UjlHaTZrTkZDbnZnZkVsYmtOSmRsV2czVHZsX2RVUlZBZ3pzNVppcDBNVVFB0gHbAUFVX3lxTFBDSUNvRS1YZFBCWXdMOWZubnozQlE0VnhQZVYta3JvUHBIc1VzcUZfMjc2REFHSHJ1cVJWYlQ2bXlLUkU3THF3QUlpdWNITlh4YU5tdWRDaGVoUGFLZ3diRE0xbjJkbEMtemlZSE8taElWUDVsdjNoSGVxbjZmUXduem9abC1GdUppNXVBbGRuZFRzZjE4aEpSU1JoWGhrcFk5eTB6Q2NtNDA3SDViel9PNU9iSGNGdndhcU1ybDJYMmptYzY1dk5jdmtZUUUzcXNiNjlhOFVVU3dhYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "‘Quiet Before the Storm’ – Trader Says Top Ethereum Rival Mirroring 2021 Price Action That Preceded 700%+ Rally - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that one Ethereum (ETH) rival is gearing up for a massive gain.\n\nPseudonymous trader Kaleo tells his 641,800 followers on the social media platform X that Avalanche (AVAX) may be about to mirror a 2021 bullish pattern against Bitcoin (BTC).\n\n“AVAX/BTC: I still wouldn’t sleep on Avalanche here. Chart looks like it’s at a spot similar to where it was in July of 2021. Big gains to start the year, followed by months of bleeding out before it started to rip. Quiet before the storm.”\n\nLooking at his chart, the trader suggests that AVAX/BTC may breakout of a descending channel to 0.0014 BTC ($99.87) similar to how the trading pair soared from around 0.0003 BTC in July 2021 to about 0.0025 BTC in December 2021, a gain of 733%.\n\nAVAX/BTC is trading for 0.0005105 BTC ($36.42) at time of writing, down slightly in the last 24 hours.\n\nNext up, the analyst predicts that memecoin Dogecoin (DOGE) will have a parabolic breakout against Bitcoin (DOGE/BTC).\n\n“DOGE/BTC: you just have to bullieve.”\n\nLooking at his chart, the trader suggests DOGE/BTC could soon soar beyond 0.00000380 BTC ($0.27). DOGE/BTC is trading for 0.00000227 BTC ($0.16) at time of writing, down slightly in the last 24 hours.\n\nThe trader believes altseason will officially kick off once Ethereum breaks through the key resistance level against Bitcoin (ETH/BTC) currently around 0.054 BTC ($3,852).\n\nETH/BTC is trading for 0.05370 BTC ($3,798) at time of writing, down 1% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPX2xFLVI0QlJ0UXNkd2V6RlVYUllGd3Q0anJ6R2RkdFpMYnhwTmg3QWV2RHdtTDlTeGtsTU1GVmV2WGFsRTRqOHhQb204dVpGaWhjQ1FuN1JMNmwtSThvYmVFQ0RRdmpuaWRQSGFuRHkwTmQzTXhmWUd0UDM4SV9OdzJsLVd2ck5rWnfSAY8BQVVfeXFMTVNVMVVmZkNZUFR6eERlOGQtNlBmUnYzRUkwTTJkR0EtOEdGS0hqbV9WWWN1Tk42UTFrMzVuM2Q4aTVnbXM0Y0pueVF5bDBubXIzYzdmNDZYS0daek9hdmhNUFRXaF9kT3laaXBBdndWSlFSd2Y4X19JOXlINTFKSTc5bUJLd3ZlM3JtRDR0Tk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Litecoin (LTC) Outperforms Ethereum (ETH) as Transactions Hit New High - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a remarkable turn of events, Litecoin (LTC) has surged ahead of Ethereum (ETH) in terms of daily transactions and active addresses. According to a tweet by IntoTheBlock , the number of active Litecoin addresses surged by an impressive 75% yesterday, marking the highest activity level since January.\n\nAdvertisement\n\nThis surge has pushed Litecoin to surpass Ethereum by over 100,000 active addresses. The tweet highlighted the significant spike in Litecoin's activity, stating that the number of LTC transactions hit 426,000 yesterday. While the majority of the increase is attributed to transactions under $10, there has been a noticeable rise in transactions across all sizes.\n\nLitecoin's surge\n\nThe data indicates that Litecoin is experiencing a significant uptick in usage and popularity. The number of LTC transactions hitting 426,000 in a single day is a notable milestone, reflecting growing confidence and interest in the cryptocurrency. This surge can be attributed to several factors. For instance, Litecoin has been steadily gaining traction as a preferred cryptocurrency for transactions due to its lower fees and faster transaction times than Bitcoin (BTC) .\n\nThis has made it a popular choice for small transactions and everyday use. Moreover, Litecoin's network efficiency and lower transaction costs have made it an attractive option for users looking for a reliable and cost-effective means of transferring value. The recent surge in smaller transactions under $10 suggests users increasingly turn to Litecoin for microtransactions.\n\nAdvertisement\n\nAdditionally, the Litecoin ecosystem has expanded, with new developments and partnerships that enhance its usability and adoption. These include integrations with payment processors and wallet providers, making it easier for users to transact with LTC. The recent surge in activity is a positive indicator of LTC’s potential for continued growth and adoption. Litecoin's focus on transaction efficiency and lower fees positions it well to attract a broader user base."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPWDZIb1p2clhMc2haOEktQU00NkxSeVZlenBGWUtLS2VvSk9Rb2E5U05zQmtvQ2dNUEVKWUxHV3VNeXc1X0NPZlBuTWRTSEdBVTFWOEVQRks5M1A3QUJIRmhSd0x3NnJ1cnJnT2syczZhUGFkN0pxWmRyRzVXSTgtZ3hYN0lNWGVHdkkyWkJQWThXZ9IBlwFBVV95cUxQdnpvdEd4S05WYWZ3VEprbDY3ZzJBc0dMay1ETk1fY3FVMWp4b3Q5NW1POEZ5UUd1eU5SVm9JbGlGWkFhNlpUR0JyWnRCX3lfT2hwTnRxMmFXZUc4VTg2SWxpWXpEQmdJUE03Q1ZSODJoYVlUdHYwMTAyandvSUkzbUxBbVByelJIVUFxaDJwV1dTaHU3OEFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum whale’s $56M sell-off could have THIS impact on the market - AMBCrypto News",
        "content": "A major whale sold part of its ETH holdings\n\nAltcoin’s price fell, while Ethereum’s network growth declined too\n\nEthereum [ETH]‘s price registered a massive hike over the last few weeks, one fueled by news of new spot ETFs for ETH. Despite the optimism around the network, however, a large whale recently decided to sell its holdings.\n\nWhales shy away\n\nOn 8 June, a significant transaction occurred on the Ethereum blockchain. A major whale transferred 15,200 ETH, worth approximately $56.47 million, to Kraken. This particular address received massive holdings of 67,000 ETH directly from the Ethereum Foundation. It is further believed that this same address also received an initial 200,000 ETH during the Ethereum Genesis block, likely signifying participation in the ICO (Initial Coin Offering) that launched the Ethereum network.\n\nHere, it’s worth noting that despite this recent transfer, the wallet still holds a balance of 41,000 ETH – Valued at approximately $151 million.\n\nThis large transaction may be interpreted by some investors as a sign that the whale is losing confidence in Ethereum’s future, prompting it to sell its holdings. This fear-based selling could trigger a domino effect, driving the price down further.\n\nAdditionally, the unknown purpose behind the transfer can spur further uncertainty.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,683.83, with its price down by 3.14% in the last 24 hours. Despite this sudden dip in ETH’s price, however, the overall trend of the price movement looked relatively positive.\n\nAnd yet, the network growth for ETH declined significantly over the last few days, implying that new addresses were losing interest in ETH and were not ready to buy ETH at the current rate. If the price dips further, there may be a chance that ETH may begin to look lucrative to new investors in the future.\n\nCoupled with the declining network growth, the velocity at which ETH was trading also fell materially.\n\nIn terms of overall activity on the network, gas usage on the Ethereum network declined over the last few days. Additionally, the overall NFT trades on the network plummeted as well.\n\nThe lack of activity on the Ethereum ecosystem can be detrimental to both the the network and the price of ETH in the long run.\n\nIs your portfolio green? Check the Ethereum Profit Calculator"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxONzlDaGFndjdJRDNZRFVGemRfZk9Rel9vZjJEN0Z5c19CNXc1cGdKeTlwSjVSRWdXeFk3dDh0VG9ZczBOT2poOUl1ZnM0d2NZMVItdHpBd3lYQ2ticVJEbnl3RWJWTzBSS05KQ19lVW5XYXBXLXpQRWdydGgxS0x2ZjMxbVVSZUo5dTBTSzF3d3NzVlFXQWtSYlFMZktqTkxYZW1rNWcwQ2hjZzdtdEoxWjVCeF9PQ0dMOUtZMFJhUzlzRmh0Z0ZXOFUyNUdwSUFiSDh4ZVd5TERNX2_SAeABQVVfeXFMTnFmNzZQSzlNY3BaU2otWTlMSWY3WUNBUGxERUhFbFpIc1J2RV9oRV9FVXZucC0tRGh0d1B0TDBhalZUaHFUUmdRc1dIc0dlOURSeDRBYy1UVGcwMERkRm8wN0NqR1Z1MDhrS01aSmprYU1obkUwZVd0cXI2X2l0OHJLTHZ4U3NyVTlNUXlHZFlnS2ZGLUd0TlhUcDFrZlRMS3c5Ylh2QmgtVGh4OVZDeE9rcE96cE0tVWFfQUJkbHROSFdReER6WWJ2SGxiQTlMTFlLQVV1Z2FYTUNCN1NzdTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Analyst Says Blue-Chip Altcoin Mimicking Price Action That Preceded Massive Rally, Updates Outlook on Ethereum - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that a top-10 altcoin by market cap is about to soar to new all-time highs (ATH).\n\nPseudonymous trader Kaleo tells his 642,000 followers on the social media platform X that BNB (BNB), the utility token for the BNB Chain ecosystem, is mimicking a 2021 price pattern on the four-hour chart that led to new ATHs.\n\n“When BNB entered price discovery in the Spring of 2021 it initially had a very similar breakout and retest to the one we’re seeing now. Would look to add heavily on this dip, especially sub-$650 if you get the chance.”\n\nCrypto traders and analysts refer to price discovery as a situation where a coin trades at levels never seen before in its history.\n\nBNB is trading for $679 at time of writing, down more than 4% in the last 24 hours.\n\nNext up, the analyst predicts Ethereum (ETH) will break out of a descending trendline against Bitcoin (ETH/BTC), and that could send layer-1 (L1) Ethereum Virtual Machine (EVM) projects soaring.\n\n“Really believe it’s only a matter of time before we see something like this for the Ethereum/Bitcoin ratio. When it happens, be on the lookout for high ETH beta plays including alt L1 EVMs.”\n\nLooking at his chart, the analyst suggests ETH/BTC will soar above 0.10 BTC ($6,926). ETH/BTC is trading for 0.053 BTC ($3,689) at time of writing.\n\nThe trader also says that based on historic precedence, Ethereum is in the earlier stages of the parabolic phase of the market cycle.\n\n“How can you not be bullish here?”\n\nEthereum is trading for $3,686 at time of writing, down 3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOOU9nN3JCTy1CV05rX2FSUWhjLXhkMXo3c0dVTUFhWWhUR2FINC0xOUVlTnNsUmYxcG1nY2JoeFRHZHVHSGc3VTJLUmpDSldhRlllQlpwQ19sLTYzQWJJOUlfTEh5WXA3cEpvVFI4ZS03OHZaZTBzUVp5c2N4RndaTWVhbW9RdHgxT1ZoaTRiZ2dJcURVR3hsZXhLeWU4NnNKZ1Y4RVl2LWZRZUEwbHRLRGVLWlR2WnhKWnNZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Here’s Shiba Inu Price if Ethereum Reaches $22,000 As Predicted by VanEck - The Crypto Basic",
        "content": "Shiba Inu could breach the $0.00014 price level if it trails Ethereum price in the event that ETH clinches the $22,000 target predicted by VanEck.\n\nVanEck Sees Ethereum at $22,000 by 2030\n\nFor context, leading asset manager VanEck recently adjusted its outlook for Ethereum, proposing a possible six times increase in price per unit and a $66 billion cash flow. As reported by The Crypto Basic, VanEck’s latest projection was fueled by the recent approval of spot Ethereum ETFs by the U.S. SEC.\n\nWith these investment products poised to introduce greater capital to the Ethereum market, industry experts believe this development could bolster Ethereum’s price, triggering a spike to greater heights. This phenomenon was recently observed with the recently-introduced spot Bitcoin ETFs, which have seen a cumulative net inflow of $15.69 billion since January.\n\n- Advertisement -\n\nThe inflows to these instruments contributed to Bitcoin’s spike to a new all-time high above $73,000 three months back. Considering these events, analysts at VanEck believe Ethereum could record similar gains. As a result, they project a $22,000 price target by 2030, the next six years.\n\nShiba Inu Price if It Trails ETH Surge\n\nMeanwhile, we recently assessed how much Shiba Inu could rise if it trails Ethereum on the back of this price surge. Notably, data from IntoTheBlock indicates that SHIB boasts some level of price correlation with Ethereum, with a 30-day correlation of 69%, as reported by The Crypto Basic earlier this week.\n\nThis suggests that Shiba Inu could follow Ethereum’s price movements to an extent as ETH journeys to the $22,000 price goal. Remarkably, for Ethereum to reach this $22,000 value, it would have to spike by 494% from its current price of $3,700. Also, this $22,000 price would lead to an ETH market cap of $2.64 trillion.\n\nIf Shiba Inu records similar gains, its price could rally to unprecedented highs. SHIB currently changes hands at $0.00002394, having slumped by 5% over the last 24 hours to break below the $0.000025 support. A similar 494% increase from this point would take Shiba Inu to $0.0001423, leading to a new all-time high for the token.\n\nInterestingly, market analyst Rafaela Rigo already predicted a Shiba Inu rally to this price territory. Last month, Rafaela called attention to a possible repetition of the 2021 pattern, suggesting that SHIB has the potential to reach $0.0001406. At a $0.000014 price, Shiba Inu’s market cap would sit at $83.5 billion, a feasible target."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNMzItTlIyS2h4NFV4NXRsS2ctM2I3SHlPMDhQNnJfdHRFVVlNejByWTZVdC1aaGFDQkhFQkxIdGN2VUpGM1QzWUhUdm1TeWlrSjJ5QzJva3NTQzY1QjI3YzNIN011Y0t6Y2ZRalV3Tm9XdW85MlBHX1RELVVtaHN5VVRzTU5YYlZtTzhfWVVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency: 3 Coins To Buy Now Before Ethereum Hits $5,000 - Watcher Guru",
        "content": "Cryptocurrency investors are always on the lookout for the next big opportunity. With Ethereum, the second-largest cryptocurrency by market capitalization, expected to reach $5,000 in the near future, investors are exploring alternative coins that could potentially offer significant returns.\n\nIn this article, we will discuss three promising cryptocurrencies that are worth considering before Ethereum hits this milestone: PEPE, Optimism, and Arbitrum.\n\nAlso read: Cryptocurrency: 3 Top Coins To Watch As BNB Hits New ATH\n\nPEPE\n\nDespite its lighthearted name, PEPE has shown impressive price performance, currently trading at $0.00001456, up 1.79% in the past 24 hours.\n\nThe coin’s 24-hour low and high stand at $0.00001422 and $0.00001518, respectively, indicating a healthy level of volatility that could lead to significant gains for investors who time their entry and exit points correctly.\n\nAlso read: Shiba Inu Becomes The Most Traded Crypto in India\n\nOptimism\n\nOptimism, with its native token OP, is a Layer 2 scaling solution for Ethereum that aims to improve the network’s scalability and reduce transaction costs.\n\nBy utilizing optimistic rollups, Optimism enables faster and cheaper transactions while maintaining the security of the Ethereum mainnet. OP is currently trading at $2.51, up 0.18% in the past 24 hours, with a 24-hour low of $2.47 and a high of $2.55.\n\nAs Ethereum continues to grow and more users adopt Layer 2 solutions, Optimism is well-positioned to benefit from this trend, making it an attractive investment option.\n\nAlso read: Ripple: Can XRP Hit $0.6 This Weekend?\n\nArbitrum\n\nArbitrum, another Layer 2 scaling solution for Ethereum, has been gaining traction among developers and users alike. By leveraging optimistic rollups, Arbitrum enables faster and cheaper transactions while maintaining compatibility with Ethereum’s ecosystem.\n\nThe platform’s native token, ARB, is currently trading at $1.11, down 0.26% in the past 24 hours, with a 24-hour low of $1.10 and a high of $1.14. As more decentralized applications (dApps) and users migrate to Layer 2 solutions, Arbitrum’s adoption is expected to grow, potentially leading to an increase in the value of ARB.\n\nIt is crucial for investors to identify promising opportunities beyond the well-established players like Ethereum. PEPE, Optimism, and Arbitrum represent three cryptocurrencies with potential for growth, each offering unique value propositions and use cases."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQYVU2WC1ZVXFQZkx2N0VVeTQ5LWhWQ1RaRGVvYU1CRlM5MnAwQi02UXljZHk4ZmFzUEYwWVNqNHEtcmZ3eHZoZVEzaG90MGxMZUlHZWpkWFoxNzF5dzdWZkhjMTVVQ1M3SzVyUVNOd0YtYWZxYnFXenIxRkZrWmdtcm1mVjhrUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Vous n’en croirez pas vos yeux : Ethereum atteindra cette valeur en 2030 ! - Cointribune EN",
        "content": "Fri 07 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nEther (ETH) at $22,000 by 2030? This is the impressive forecast by VanEck for the native crypto of the Ethereum blockchain. This ambitious estimate draws the attention of experts and investors worldwide. But what justifies such an evaluation?\n\nVanEck sees big for Ethereum\n\nCurrently, ether is trading around $3,852, a value that may seem modest compared to VanEck’s ambitious forecasts. The investment company, in its recent report, envisions a future where ether would reach the staggering sum of $22,000 by 2030. This prediction highlights the enormous growth potential of this crypto and its disruptive capabilities in the global financial landscape.\n\nVanEck, renowned for its sharp analyses and bold forecasts, anticipates a major transformation of the market thanks to Ethereum. This projection, though spectacular, is supported by current trends and notable advancements in the Ethereum ecosystem, positioning its native crypto as a key player in the evolution of the digital economy.\n\nThe arguments put forward by VanEck to justify this explosive growth\n\nOne of the main growth drivers for ether, according to VanEck, is its revolutionary aspect. Ethereum offers a robust platform for decentralized applications (dApps) that can transform various sectors, including traditional finance, digital payments, and even artificial intelligence. This capacity to disrupt and innovate positions Ethereum as a potential leader in the new era of the digital economy.\n\nAnother key factor is the development of ether-based ETFs. According to VanEck, the approval and widespread adoption of Ethereum ETFs will facilitate institutional investors’ access to this asset. This opening to large investors could significantly increase the demand and liquidity of ether, thereby consolidating its market position.\n\nFinally, the on-chain data analysis conducted by VanEck reveals promising financial indicators for Ethereum. The report highlights significant cash flows estimated at $66 billion and sustained network activity, reinforcing the robustness and long-term viability of the Ethereum blockchain. These observations enable VanEck to justify its optimistic prediction of $22,000 per ether by 2030.\n\nThe future of ether according to VanEck looks promising with a bold forecast of $22,000 by 2030. It remains to be seen whether these predictions will materialize in an ever-changing crypto market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQU0t3UWYya2hOSlpReVJyLXlESXo3VmFta3pHZ3hoSFR6VjRsOFVOcDhxQXk4djV4V01zcmZJNmRlalNTbHBETXJ5LTBSLXJKWVpSZlFiZ2NzRUIyanZEWVBqcWlFREpLeXR0ZzdhU1RKMlRJYXlwUy1BVXlzM1VkNWlxMWIwcktIaV9nZnJKM2QxVG9C?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Experiences Significant Correction and Rebounds - Blockchain.News",
        "content": "Disclaimer\n\nDisclaimer: Blockchain.news provides content for informational purposes only. In no event shall blockchain.news be responsible for any direct, indirect, incidental, or consequential damages arising from the use of, or inability to use, the information provided. This includes, but is not limited to, any loss or damage resulting from decisions made based on the content. Readers should conduct their own research and consult professionals before making financial decisions."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQUVZYZ2NSZERIWG1zblNOcGRhT3FBQWdQTHJHVWFrVS1HQm1NdG9HdWhGdkNhYzlncUxWcDZCcE1sNFR1ZW9hbUctaUEtYlFGZFN2TDVsMXZ0X1Fwa2lVeTNfa3RuRUtaSkVXdGVnbG9GeUp6YWtCOEtESlVSUm5fX3A0a1ktSU95aHfSAY8BQVVfeXFMTUVNdjVrVXRab2k0TVNDV0d2WWtqbmZDNnFrVVBSZWRNVTNNSXc4M2FUUGhLY0toUF83V3R0NGMzMmpXdnJ3UUVaN0hLOFVuLUtoZS0zRlZIaV9adTYtWkoxa0x3ekZOOUNUTWZDYnQxcm5peHpOcElJMEhrejJydGFIamtlVnpvNkRzMXpNWVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Gensler discusses Ethereum ETFs: SEC to fast-track approvals? - AMBCrypto News",
        "content": "Gensler’s remarks on Ethereum ETFs evoke speculation on SEC’s review pace.\n\nSEC’s approval of ETH ETF listing requests hints at an evolving stance.\n\nThe cryptocurrency community is abuzz with speculation following recent comments by SEC Chair Gary Gensler.\n\nIn a report by Reuters, Gensler indicated that the approval process for spot Ethereum [ETH] exchange-traded funds (ETFs) in the United States hinges on the responsiveness of issuers to the SEC’s feedback. He said,\n\n“These registrants are self-motivated to be responsive to the comments they get, but it’s really up to them how responsive they are.”\n\nThis development has sparked optimism among many who feared prolonged delays, suggesting that the SEC may be moving towards a more accelerated review process.\n\nHowever, in a separate conversation with the CNBC Squawk Box, Gensler said,\n\n“The underlying exchange trade products still need to go through a process to have the disclosure about that. Now, that will take some time but they are working on that right now.”\n\nSome interpreted this as a sign that the commission might take their time approving the S-1 Forms.\n\nThis juxtaposition raises questions about SEC’s stance on the industry.\n\nWhen discussing the broader crypto market, Gensler said,\n\n“Exchanges like the New York Stock Exchanges (NYSE) get properly regulated to protect against fraud regulation and they don’t trade against you. And these crypto exchanges are doing things that we would never allow NYSE to do.”\n\nHow did ETH react?\n\nThese diverging remarks caused notable fluctuations in ETH prices. At the time of writing, ETH was changing hands at $3,819.16, reflecting a 0.70% drop in the past 24 hours.\n\nThe technical indicator Relative Strength Index (RSI) remained above the 50 mark, indicating significant buying pressure.\n\nGrayscale’s role in Ethereum ETF\n\nThe SEC’s change in tone on spot Ether ETFs before the deadline remains unexplained.\n\nHowever, in discussions with Reuters, Gensler hinted that this decision may have been influenced by Grayscale’s legal challenge regarding Bitcoin ETFs from the previous year.\n\nGrayscale had argued that since the SEC approved Bitcoin futures ETFs, there was no reason to deny spot Bitcoin ETFs. Gensler said the case was similar with Ethereum as ETH futures have been trading since last year."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOR0ZnYk5TcUltZm52OWhxTDJyQkdEM2lRWU9qVDRMV2hIU09HVGNIRThPS0poNkI2VkY4aVpvLXlZR1hIbXNjZy1penNPUDExNS11QjAtVi1PYUE4b3VUOXlfVnVRUzk3NmlrZ0h4LVZtcnBxbXBqdmdmeHIxY1h3Zm5ZYnZmSk1jZUZtSlRjNEZfUdIBlwFBVV95cUxPcExsa0hJMWxvaXl2cURVd3h5WVA2by1Tc3RlXzRvcVJQQ1RnOTVnVEhSSmx6VVF2QzQ2cEw4OTJSdU0tc2hWRk13VjNUbWk3eWJneFNHcE9FcDhjSkJMcmZINXFvM0Y0QTBONFBVbWhONllrMHdZLVJfVDZ1UlVXMXQtbU16S0M3d3hIR2IyZ2E3VkVhTWxZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Are Litecoin holders in a better position than Ethereum investors? - AMBCrypto News",
        "content": "Transactions on Litecoin increased across all levels, leaving Ethereum trailing\n\nETH and LTC prices fell in the last 24 hours, but they might surpass major milestones soon\n\nIt is unusual to find Litecoin [LTC] surpassing Ethereum [ETH] at any level. However, on 6 June, the number of active addresses on Litecoin’s network jumped by a mind-blowing 75%.\n\nAccording to data from IntoTheBlock, the difference was over 100,000 in favor of Litecoin. In total, the figure was 602,720 and represented the highest level of activity on the network since January.\n\nAfter Cardano, Litecoin takes Ethereum out\n\nFor context, active addresses measure the number of unique wallets engaged in successful transactions on a blockchain. A few days ago, the coin had registered higher values than Cardano [ADA] on the same front.\n\nHowever, it is important to mention that most of the transactions emanated from wallets with a small balance.\n\nThat being said, those holding LTC worth $10,000 to $10 million were not left out. According to IntoTheBlock’s latest post on X,\n\n“While most of the increase is due to transactions smaller than $10, there is a noticeable rise in transactions of all sizes.”\n\nHere, it’s worth noting that the rise in network activity did not trigger a hike in LTC’s price. At press time, Litecoin was valued at at $83.52, following a fall of 1.8% in the last 24 hours. Ethereum, on the other hand, was trading at $3,791, with the altcoin depreciating slightly too. Additionally, AMBCrypto looked at Litecoin’s market cap to thermocap ratio. This metric measures a cryptocurrency’s valuation relative to the total security spend by miners. When the market cap to thermocap ratio spikes, it means the coin is trading at a premium when compared to miner spend. In this instance, the price could be termed overvalued.\n\nHistorically, as shown below, an extremely high reading of the metric causes a correction. However, at press time, the ratio was 0.00000003. This was a low reading, compared to periods when Litecoin has been overheated.\n\nAre LTC and ETH at a discount?\n\nSimply put, LTC may be trading at a discount . Should the market return to a highly bullish state, the price of LTC could move past $100 from its press time position.\n\nTo confirm this thesis, AMBCrypto examined the Market Value to Realized Value (MVRV) ratio. This metric track the profitability of holders in relation to coin valuation.\n\nAt press time, Litecoin’s 30-day MVRV ratio was 13.35%, indicating that the average holder would make profits if they sell. However, the gains might be high enough to trigger widespread profit-taking.\n\nFor Ethereum, the 30-day MVRV ratio was 4.69%. While this suggested that ETH and LTC may be in similar spots, it also addressed the notion that Litecoin holders might be in a better position than their Ethereum counterparts."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOdFdKbmdFZnZfemRTX1BJbHlJeUtSR29iaVhHQXJQeXBPS0FhMWQzMnlFcWViR2JtdFl0eVM0NnhFOXNhc2RhR21pVkpkdVlkTkNmcUJJazZ3VGZkMmxMQTJoRTVtd3NKODczZGNhaTFYVWhkMXFmUS15V0lwUGZBeEFOY0Y3NDNSQWx5OWptNTBHT19rMjJad3BWXy1RVDg5WUlhWElmSEVDaXVPZEFVZGtpbkFUbF9HV1QwNUN6ZUQyamotcVVZLUhvenVRWnRmZ2wtNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "StakingFarm CEO Highlights Impact of Staking on Ethereum Liquidity - GlobeNewswire",
        "content": "London, England, June 07, 2024 (GLOBE NEWSWIRE) --\n\n\n\n\n\nStakingFarm, a prominent player in the cryptocurrency staking industry, has released new insights from its CEO, Klajdi Toci, on the significant impact that staking has had on Ethereum (ETH) liquidity. According to Toci, staking has emerged as a major liquidity sink for ETH, a phenomenon that has drawn the attention of analysts and market observers alike.\n\nDespite the surge in Ethereum prices since Q4 of last year, the three-month circulating supply of ETH has not seen a meaningful increase. This stagnation in circulating supply, as noted by StakingFarm's analysts, underscores the profound effect that staking has on the availability of ETH in the market. As more investors lock their ETH in staking contracts to earn rewards, the overall liquidity of Ethereum decreases, influencing market dynamics and price movements.\n\n\"The surge in ETH staking has created a unique situation where a significant portion of the asset is effectively removed from circulation,\" said Klajdi Toci, CEO of StakingFarm. \"This reduction in liquid supply can have various implications for the market, including potential price volatility and changes in investor behavior.\"\n\nStakingFarm, known for its innovative staking solutions and user-centric platform, has observed these trends firsthand. The platform offers a range of staking opportunities, allowing users to lock their ETH and other cryptocurrencies in return for rewards. This practice not only supports the security and operation of blockchain networks but also provides a source of passive income for investors.\n\nHowever, the growing popularity of staking has led to a substantial amount of ETH being locked up, thereby reducing its availability in the open market. This trend highlights the dual-edged nature of staking: while it benefits individual investors through rewards, it also impacts overall market liquidity.\n\n\"Understanding the liquidity implications of staking is crucial for both investors and the broader market,\" Toci added. \"At StakingFarm, we are committed to providing our users with the information and tools they need to navigate these complex dynamics effectively.\"\n\nStakingFarm's analysis aligns with broader industry observations. Analysts have noted that the reduced liquidity resulting from increased staking activities can lead to heightened price volatility. As the circulating supply of ETH remains constrained, even minor market events can trigger significant price fluctuations, creating both opportunities and risks for traders and investors.\n\nIn response to these developments, StakingFarm continues to enhance its platform, offering advanced tools and insights to help users make informed decisions. The platform's commitment to transparency and user education ensures that investors are well-equipped to understand and manage the liquidity dynamics associated with staking.\n\nAs the Ethereum network and the broader cryptocurrency market continue to evolve, StakingFarm remains at the forefront of innovation, providing solutions that cater to the diverse needs of its users. By staying attuned to market trends and investor behaviors, StakingFarm aims to foster a more resilient and informed staking community.\n\nFor more information about StakingFarm and to explore Ethereum staking opportunities, please visit https://stakingfarm.com/.\n\nFor media inquiries, please contact:\n\nName: Klajdi Toci\n\nPosition: CEO\n\nEmail: info (at) stakingfarm.com\n\nWebsite: www.stakingfarm.com\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\n\n\n"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPMXZSeGxnQXRtNmg0SEZzVjczN1Jrb3V2Sk1aTWhhNE5hYnlpY1NaaWp0NEkwdF95c2hwU0ZJcEEtbjRYSHdzZHI5WkwwcWFiMU4zZTFKeU9rS2hLWjBGNUROQnY2RUh0a056aU91dkc5UnpoUDkzM25EaUJnakVWNEtFbWVQZEgyUlhsZVpzMjhsZFBaSmYzVDNzSWY3d9IBowFBVV95cUxOaTY3aUZRaU0wSGNCU056SHBJYzVRYUhaQlFNY0JKOFlkMXJLX2NzQzdTbTJmZzZjXzZsdHEzY1JUVkc1NTByYzdmSUdBQW5RMTAzLUJSdmtTR2Y3dExFQksxRFhuajRJZGRpV2JEQ0VQcHRHMTVKVmRaMGRBT2lvd3lLbHVRam1NSXA0dWNXR1JXZVpwd0dNQVVPUjJBQVlzQ2ln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s bullish outlook fades; Look out for these key signals now! - AMBCrypto News",
        "content": "ETC’s market structure was bullish at press time\n\nMomentum and volume indicators turned bearish on the charts though\n\nEthereum Classic [ETC] retested the $25-support level and nearly flipped its higher timeframe market structure bearishly. This came after an unfavorable U.S May Jobs Report. Its short-term momentum seemed bearish too.\n\nIn a recent report, AMBCrypto noted that the $28.4-$29 zone could be revisited before a bounce. Ethereum Classic dropped more than expected. Ergo, the question – How do traders react to the recent price action?\n\nThe $29-support level did not hold\n\nThe recent higher low was set at $25.19 on 13 May. The price drop on 7 June, touched $25.07, but did not close a daily session below $25.19. Hence, the bulls seemed to have the upper hand on the higher timeframe, though it appeared tenuous.\n\nThe Directional Movement Index saw the -DI (red) jump above the 20-mark. It was an early sign that the trend could be shifting bearishly, as the ADX (yellow) would also need to climb past 20 to signal a strong downtrend in progress.\n\nThe CMF was at -0.09, indicating significant capital flow out of the market. This selling pressure has been present for a week. It would need to turn around for bulls to regain some hope.\n\nFutures market highlighted intense bearishness\n\nOver the past 10 days, Ethereum Classic has steadily risen from $31 to $28.6. The past 24 hours saw a flurry of selling activity spurred by Bitcoin [BTC] though. Hence, ETC fell by 14.32% in a single 4-hour trading session, followed by a bounce from $25.07 to $27.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe Open Interest also fell sharply alongside the price, showing bearish sentiment and a reluctance to enter positions due to volatility. The spot CVD continued its downtrend too. The volume indicators agreed that selling pressure was firm.\n\nThe bulls would need to change this to re-establish an uptrend on the lower timeframes.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOa2pkWmdKczFkMUhWVjFFT29QMkh3VnVXeFgyZnFHaGxsV1ZBOEM2YW5kMnd2amJJazRrSlFRN1FNWGdRVmIwaDM5QTZ4TWZPOXdQdEh4SEt4cFl6Y1NMeE8wcDdsU280Yk1DVC1oWWpCSFBjS25JQkRwZnVIMnA2bHJUUDc2QdIBiwFBVV95cUxOZmNWdUdqQmtmN0d5N2c2TW1sWVF3MHJsWUxfbC0tcEo0bjcxMS0yYUlHeGE0N0xMbzN6R0x4YjRwVWhlRndfLVd6UzRWa2lKRC1tcFZ6OWxfbzZWcHdTMjB1dHo0NnN5Ry1RNHZFNXUwZm5ocVhhaHRPWlJqZXIwV1g3b3F1eHlwRTUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price: Analyst Predicts ETH To Note 13% Gain, Here’s Why - CoinGape",
        "content": "The Ethereum price, the world’s second-largest cryptocurrency by market cap, saw a steep decline today amid a widespread crypto market selloff. Meanwhile, this drop comes in the wake of stronger-than-expected U.S. job data, which has dampened investor sentiment over a hawkish stance by the Federal Reserve.\n\nHowever, despite the downturn, some analysts are optimistic about Ethereum’s potential for a significant rebound.\n\nadvertisement\n\nAnalyst Predicts 13% Ethereum Price Rally\n\nDespite Ethereum’s recent price dip, a prominent crypto market analyst, known as Mags (@thescalpingpro) on the X platform, anticipates a strong recovery. In a recent X post, Mags compared the current Ethereum price trend to historical patterns, suggesting that the cryptocurrency could experience a significant rally soon. According to Mags, Ethereum is “forming a similar structure” to a previous cycle, after which the crypto has soared 13%.\n\nNotably, Mags’ analysis indicates that Ethereum might reach up to $4,200 if the predicted trend holds true. Currently, Ethereum is trading near $3,700, and this potential rally would represent a 13% increase. This optimistic forecast is based on Ethereum’s historical performance, where similar patterns have led to substantial gains.\n\nMeanwhile, supporting this outlook, Mags shared a price chart showing Ethereum’s current structure, highlighting similarities to past cycles. The comparison suggests that the recent decline might be a precursor to a strong upward movement, akin to previous instances where Ethereum rallied significantly after a similar setup.\n\nAlso Read: Ethereum Foundation Wallet Deposits $56 Million in ETH on Kraken, ETH Price Drop Soon?\n\nPrice Amid Contrastive Views\n\nWhile Mags presents a bullish outlook, not all experts share the same optimism. A recent report from 10X Research has introduced a more cautious perspective. According to their analysis, Ethereum has broken a critical support level of $3,725. This breach has sparked concerns about potential ETH liquidations.\n\nThe 10X Research report highlights the risk of imminent liquidations following Ethereum’s drop below the key support level. Supporting this view, data from CoinGlass shows that Ethereum has experienced significant liquidations over the past 24 hours.\n\nSpecifically, $59.61 million worth of Ethereum has been liquidated, with $52.23 million in long positions and $7.37 million in short positions. This data underscores the market’s volatility and the potential risks associated with Ethereum’s current price level.\n\nHowever, despite that, optimism prevails with soaring optimism over the U.S. Spot Ethereum ETF. In addition, some market experts believe that the recent decline in the ETH price could provide a buying opportunity for investors.\n\nAs of writing, Ethereum price fell 3.21% to $3,683.75, while its trading volume over the last 24 hours soared 40.27% to $18.08 billion. Meanwhile, the Ethereum Open Interest fell 0.95% to $16.54 billion, reflecting the current gloomy sentiment hovering in the market.\n\nAlso Read:\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNWmFTN0lkeFl3T1QwV2ljby1pTWtsOGJoZkw4LVlvVWJjTmtOcWFrUGQxdGxXU0hHNk1oSXg3Q3lGYy0yOW9Ja1o1aEpwS2M5cjFQYVZHRTRlT3AtQmNrQVBlMHRFNUpQWTRlTFNQcGNPRHd5c0xDYm55U2U1amtkRWpPTW9OLXBBQk12cTRPZlhpdHNfaElqbzFOUU9NN0XSAaQBQVVfeXFMT2ZtYzIxVU5BWldMbkJSdUxfXzBDV2FURUg5ZllfUlMyVVJucTU5RVNGLVh0cU9QejlpRmJXOF9CVWNCNS1yblQ5WWRQeUNIMHNYcGJObVdLTE1EUGIwM2dyOVpVNGRJSW1jakxEWS1KZ05fY0V6b0doSE1fODJGaHBITFNIcllEbzA5R1oybkhrdHliaTJZdUxxTGZOd04zMlhQUzc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum (ETH) Going to Lose $4,000? Solana at $170: Was It Fakeout? XRP Remains Stable - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum is kind of losing it. It is likely that you have already seen the recent price action near the $4,000 mark. Unfortunately, Ether has failed to move past this mark or even reach it and gain a foothold there.\n\nEthereum has been trading in a narrowing range. Usually, this pattern indicates a phase of consolidation preceding a possible breakout. Here, the important levels to keep an eye on are roughly $3,900 on the upper side and $3,626 on the lower side.\n\nIt has been tested a few times recently, and the immediate support is currently at $3,626. Conversely, any bullish continuation would require a strong breach of the resistance leveled at $3,900.\n\nAnother important factor is volume. A lack of strong buying pressure may be the reason for the lower trading volumes we have seen recently. Since ETH is neither overbought nor oversold and has room to move in either direction, the Relative Strength Index (RSI) is circling 65.88.\n\nAdvertisement\n\nA further drop toward the 50-day moving average, which is currently at $3,298, may occur if Ethereum breaches the $3,626 support level. But ETH might return to the $4,000 region and higher if it breaks above the $3,900 barrier.\n\nSolana pushes to new heights\n\nSolana has indeed climbed toward the $170 threshold and might be actively conquering it in the foreseeable future.\n\nSolana has been moving within a narrow range on the daily chart. The green line indicates the $165.84 support area, where the price appears to be holding steady after reversing below $170. The blue line at $156.52 and the orange line at $151.66 are important support levels to keep an eye on. Historically, these levels have provided a lot of support.\n\nThe levels of immediate support are $156.52 and $165.84. Should these levels hold, SOL may try to make another push for $170.\n\nThe important resistance level is still $170. If SOL breaks above this, it might rise higher.\n\nIf Solana is able to sustain support above $165.84, another attempt to break $170 may occur. Nevertheless, a decline toward $150 or less may be indicated if it closes below $156.52, which would signal a bearish trend.\n\nLong-awaited XRP stability\n\nLately, XRP has been remarkably stable, consistently trading at or near $0.52. Let’s examine the chart to see what is causing this stability and what to look out for going forward.\n\nXRP has been in a consolidation phase on the daily chart. The $0.50 support level, indicated by the green line, has been maintained by the market. Approximately $0.55 (orange line) and $0.57 (black line) are the resistance levels to be aware of.\n\nApproximately $0.50 is the closest support. Strong buying interest is indicated if XRP remains above this level. The $0.55 and $0.57 levels are important resistance points. If these levels are broken, a bullish trend might be indicated.\n\nMoving averages offer more information. Acting as support, the 50-day moving average is situated below the current price. The 200-day (black line) and 100-day (orange line) moving averages are both above the current price level, offering solid resistance levels for the future.\n\nAs always, volume is important. Consistent trading volumes in recent times indicate steady interest. With XRP’s Relative Strength Index (RSI) at 51.89, it is clear that the asset is neither overbought nor over sold, which does not offer much insight but shows that things are relatively steady.\n\nThe $0.55 resistance level may be broken by XRP if it maintains its hold above the $0.50 support level. If the break is successful, XRP may move up to $0.57 and higher. But if it drops below $0.50, that could indicate a bearish trend."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPTHJPWldCWk81VjFqSElPSGxNN3YtTVZkNW9kOXdjUWwwRTJqSFczY2lxT0ppbW5LbVBadGJOUktycXBRNEh4VjlVY1otc3VXSGswVWRQS21FckxFb3RSMTRXd1h1QW1ET3J6TDc1cXE1RmJLa3lQYndwNjVDNnExSzUyem44WVnSAYwBQVVfeXFMT2EyTklFa1BCNnc1LXdWUWlUNV8xaGNPWkhIN0tHRERPbzlHU09wMnQ0aUtXRmxMU21ndjhlODh1Rmx5MXB2UHJEdTVoYkljYnFiOGdNbnhhTExVaTgzaUNQQ3VPb1RYYlZMQ3Q1LVpqeDdfRHhaN25FcWxiUml5RFQ0T0ZWMWpKM285WEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Pectra Upgrade Expands With 2 EIPs, ETH Road To $5K? - CoinGape",
        "content": "Christine Kim, the Vice President on the Research team at Galaxy just took to the X platform to highlight the latest task that Ethereum (ETH) developers are undertaking regarding Pectra upgrade. The X post comes after the blockchain’s All Core Developers Execution Call (ACDE) on June 6.\n\nEthereum Developers to Expand Pectra With 2 EIPs\n\nAccording to the Galaxy Researcher, Ethereum developers agreed to further expand the scope of the Pectra upgrade yesterday with the inclusion of EOF and EIP 7702 to the Pectra upgrade. The All Core Developers Execution (ACDE) Call #189 held over Zoom and was chaired by Ethereum Foundation (EF) Protocol Support Lead Tim Beiko.\n\nadvertisement\n\nThe simultaneous integration of both solutions is likely to trigger delays in multi-client testing for the upgrade. Hence, the protocol developers plan to activate EOF on later-stage devnets. The developers are also considering conducting the activation on a different activation epoch from other EIPs, just like how developers plan on testing PeerDAS.\n\nThe feedback pooled from various EL client teams and the EF DevOps team suggest that they are in support of the integration of EOF on Pectra.\n\nEL EIPs CONFIRMED FOR PRAGUE:\n\n– EIP 2537\n\n– EIP 2935\n\n– EIP 7685\n\n– EOF\n\n– EIP 7702 pic.twitter.com/uGf6Fm6eFs — Christine Kim (@christine_dkim) June 6, 2024\n\nThere was only one opposition view from Geth. Guillaume Ballet, one of Geth’s developer said, outline notable fears bothering on Verkle functionality.\n\n“My fear is that the more we wait, the longer the Verkle translation will take. Is EOF really that urgent? I don’t think so. I’ve read several the arguments for shipping it in Prague. The more I read those arguments, the more I realize, no, there’s nothing that really justifies EOF,” he said\n\nA significant percentage of the Ethereum protocol developers disagreed with this stance. One “Kamil Sliwak” noted that EOF would be “a huge improvement” particularly for users interacting with the compiler for Ethereum’s smart contract programming language Solidity.\n\nDevelopers Decide on the Integration of EOF\n\nIn the meantime, discussions are ongoing about the preferred approach for integrating EOF. Beiko’s recommendation is that they aim to ship all Pectra EIPs including EOF in one client release. For the present purposes of testing, he encouraged developers to consider the use of devnet to stage the implementation of these code changes.\n\nFor these developers, the inclusion of EIP 7702 is as a replacement to EIP 3074, although there are still certain issues with the specifications for EIP 7702. Ethereum protocol developers are putting efforts and resources in separate breakout room to fix these challenges.\n\nThis potential additions could impact on the price of Ethereum. Noteworthy, the altcoin has been showing bullish signs since the United States Securities and Exchange Commission (SEC) greenlighted spot Ethereum ETFs. Ethereum is currently trading at $3,790.62 with a 1.29% dip within the last 24 hours. Investors are hopeful that it would break through to $5,000 in keeping with projections from top analysts.\n\nRead More: Customers Bank Reportedly Debanks Crypto Hedge Funds Amid FDIC Alert\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQaUFpT3hZLWRULXI2bUNncExPZWY4RVRGYVhkaHpQV3lqQ0kxTWpXa010TUNBNkt3eGk5aWkwVVlYSnVPZGR0M0hQOXp6WkUzajRRU1VCci1HVWczSDc5SG5UVjZNWTBOdWhBcnk3VEJybnZ2QmdpRGxwZzczZVllclhCbTFlX0NnbEcwNldB0gGTAUFVX3lxTE1TTFg1b2JqWUJQdnlPcTlLZmpXdzdzcTlSSVp5aDVRNkhsTlJ2SkFvc1FFR2xLb1dlR1VibWFDd0JZa205Y3NzbVJQODBWMnNIdm5LR0tUWnFpYl9fU3RuX0MtNklCbll5NzNSWXVrbGVVMHk0OUxOWlZLUThWOGZRT3FZYXZEZC1Yc0RhaG9hQ0thRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s circulating supply hits 120M: What’s the impact on ETH? - AMBCrypto News",
        "content": "Ethereum’s supply spiked last month.\n\nThis has happened due to a decline in daily active addresses on the network.\n\n46,138 Ethereum [ETH] worth around $176.22 million, at the altcoin’s press time price, have been added to circulation in the last month, pushing the altcoin’s circulating supply to a 30-day high of 120.14 million ETH, data from Ultrasound.money has shown.\n\nThe steady surge in the number of ETH coins in circulation means the altcoin’s supply is currently inflationary. This happens when the network witnesses a decline in user activity.\n\nAMBCrypto confirmed this decline, as data from Artemis revealed a decrease in the daily count of unique addresses interacting with the Ethereum blockchain in the past 30 days.\n\nAccording to the on-chain data provider, as of 5 June, 361,200 addresses completed at least one single transaction on Ethereum. This represented a 14% drop from the 421,000 unique addresses transacting on the network on 8th May.\n\nIn fact, during the period under review, the count of daily active addresses plummeted to a three-month low of 326,200 on 2nd June.\n\nAccording to Artemis’ data, the last time the daily count of the number of Ethereum’s active addresses was this low was on 8th February.\n\nInterestingly, due to the 25% spike in ETH’s value during the period under review, total transaction fees on the Ethereum network did not decline. It rose, even amid the dip in user demand.\n\nOn 5th June, Ethereum’s transaction fees totaled $10 million, its highest since 13rd April.\n\nA look at Ethereum’s DeFi and NFT verticals\n\nWhile the chain has seen fewer users in the last month, its decentralized finance (DeFi) ecosystem has grown considerably.\n\nThe total value of assets locked (TVL) across all DeFi protocols housed on Ethereum has grown by 25.38% in the past 30 days. This makes it the second blockchain, after Arbitrum [ARB], among the top 5 networks by TVL to record the most growth during that period.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAccording to data from DefiLlama, Ethereum’s TVL was $66.33 billion at press time, a year-to-date high and its highest level since May 2022.\n\nEthereum’s non-fungible tokens (NFTs) sector has not recorded the same success during the period under review. According to CryptoSlam, NFT sales volume on Ethereum has cratered by 56% in the past 30 days."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMjBjT0RGc3lzUi1ZbUlTbzZ2TlVJVFJRRjluOW9DSU1lbnZCVkc1TWt4VjNhUjg1SkhDSEROMEJNUkU4YW9SMy1PcTdfZ2lVMGZmUjVzQmtvNjNuZ0VhTG5kVi1QU0tLUTZmaVh5blp1cTZ1anIyX2F6WmUxVTJOWDNMM2hwZEo5c2pr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ancient $21.9m Ethereum Whale Awakens After 9 Years - Crypto Times",
        "content": "A dormant ETH address that had been silent for nearly a decade suddenly came back into action, having $21.9 million worth of ETH. According to the Whale Alert data, this is the first pre-mine Ethereum address to be reactivated in June.\n\nThe awakening of the ancient crypto treasure has caused quite a stir among the Ethereum community on X with speculators wondering who could own such a wallet and what are their intentions with this huge amount of ETH.\n\n💤 💤 💤 A dormant pre-mine address containing 6,000 #ETH (21,962,887 USD) has just been activated after 8.9 years!https://t.co/HlrVyVZ7D6 — Whale Alert (@whale_alert) June 7, 2024\n\nFurthermore, prior to the official launch of Ethereum in 2015, there were pre-mine addresses. Through them, tokens were minted and distributed during Ethereum’s initial sale which allowed early supporters and investors to grab a piece before it was widely known as a blockchain project at the time.\n\nWhile the reasons behind its sudden revival remain unknown, it coincided with when Ether experienced an abrupt dip in price.\n\nLast week witnessed ETH plunge close to an intraday low of $3,642 as the crypto markets reacted to the recent expected U.S. jobs report which reduced optimism about another immediate interest rate reduction by the Federal Reserve."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOMkhBVkI1ME1HQVctd0M3Q2hFS0NmMmtJSFFjdDJWMTFjSWJRWG5iQXBSaDFwLThQZmNXbDJuaGtSejJwNGVVSWJEWFBScGYzWTJmUm9pT2xvY3hoeUlaeWtBYkhYZFYzeEIxS3FmTU1MUGZlY0pQbWpMOXVJZi1lck0wd0twbTVWc2wxWXZGU3VhcjhvRkF0LWNuM1J6QdIBqwFBVV95cUxObGd4MV9HT19iaTF5NEZrRGU2Rld5eGxyZmdHWlBqY1lKNk9oWXRYS0pPVFlqZ2c0djZObXdqa3FaZDd5X1BLdlBIYzNDcG8ybzRQd3hXZGlReElqZk5faFNHaWFKS1d6aHBjYlJvTHVVaXpjOURlNUFSM3pjNUxYWlpFcVliWUI5YkVuYlNlLVBJWUpjSUlrQXFvZWxQdGpnY0RqcFl6bVpXNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Code | Official Website | Latest Review Updated 2024! - Outlook India",
        "content": "Ethereum Code - Minimum Deposit\n\nEthereum Code is a free trading system and when we compare this platform to other trading systems, we can see that the former is quite affordable. There is no need to pay a registration fee while registering on this platform. No other fees like platform fees, deposits, or withdrawal charges are levied from the users. Users should deposit an initial amount of $250 to begin live trading. The amount can be increased according to individual choices. Users can also withdraw this fund at any time. It is important to note that customers are not charged any hidden charges or transactional fees.\n\nTry Ethereum Code For Free\n\nEthereum Code - Supported Cryptocurrencies\n\nTraders can diversify their portfolios through the Ethereum Code trading system. They can invest in a wide range of cryptocurrencies through this single system. Some of the mainstream cryptocurrencies supported on this platform are Bitcoin (BTC) Ripple (XRP), Ethereum, Binance Coin (BNC), and so on. Apart from these, the platform also supports Forex pairs, CFDs, and other asset classes. Some of the cryptocurrencies supported on this platform are noted below.\n\nBitcoin (BTC)\n\nEthereum Classic (ETC)\n\nEthereum (ETH)\n\nRipple (XRP)\n\nBinance Coin (BNC)\n\nCardano (ADA)\n\nPolkadot (DOT)\n\nDash (DASH)\n\nMontero (XMR)\n\nRipple (XRP)\n\nYou can visit the official page, to view the complete list of cryptocurrencies supported on this platform.\n\nEthereum Code - Customer Support\n\nEthereum Code has an efficient team of customer support, who can help resolve any issue, such as technical, transactional, or trading doubts. The team is available 24/7 and users can reach out to them by calling their toll-free number or sending an email. The team consists of experts in resolving any issue and they also can help clear any doubts. You can view the Ethereum Code customer support details on the official website.\n\nEthereum Code - Countries Available\n\nThe Ethereum Code trading system is available in most countries across the world, except in some, where strict trading laws are implemented. So, here are the countries where Ethereum Code is available and traders can use it to make profits.\n\nMalaysia\n\nSingapore\n\nJapan\n\nHong Kong\n\nVietnam\n\nUnited Kingdom\n\nGermany\n\nBelgium\n\nSweden\n\nNetherlands\n\nFinland\n\nNorway\n\nSpain\n\nMexico\n\nBrazil\n\nPoland\n\nSwitzerland\n\nSlovenia\n\nSlovakia\n\nTaiwan\n\nThailand\n\nEthereum Code - Customer Support\n\nSo far Ethereum Code has received positive responses from its users. By consistently using this platform many of them have made a lot of profits. They have also said that what made the platform efficient in terms of making higher profits is its user-friendliness, overall market analysis, and the integration of advanced technologies. With the help of this platform, users can identify the right trading opportunities. Authentic reviews are available on different platforms, such as Reddit, Quora, and X. From the Ethereum Code customer reviews, we can understand that it is a genuine and efficient trading system.\n\nIs Ethereum Code Legit?\n\nWe have already discussed different factors about the Ethereum Code system in the previous sections of this review. One of the important factors among these is that this platform is free to use. Users do not have to pay any charges to use this platform. The minimum amount required to start trading is $250 and can be increased according to one’s trading goals. The important thing here is that users have full autonomy over their funds and can withdraw the amount at any time.\n\nWith reviews on Sitejabber, the platform has a total rating of 4.4 out of 5. Most testimonials say the same thing: Ethereum Code is a legitimate platform.\n\nStrict and safe encryption systems have been integrated into this platform to protect user privacy and data. Technologies such as two-factor authentication and other code systems are used to prevent data breaches and external attacks. In addition, Ethereum Code users have testified that the platform has helped them make high profits and expand their trading portfolio. Ethereum Code is a legitimate trading system and worth trying.\n\nEthereum Code Review - Bottom Line\n\nThis Ethereum Code review has discussed all the major factors of the trading system. Here is an overview of what we have talked about so far.\n\nEthereum Code is a free trading system aimed to help traders identify trading opportunities and make more profits. The system has been designed using advanced technologies, like artificial intelligence, algorithms, and analytics. It is said that the system generates accurate trading signals that come into use when searching for profitable times. The technologies make the platform highly efficient and many users have reported that it has helped them to make higher profits. Risk management tools are also integrated into this platform to identify the risks and automatically stop orders.\n\nOverall Rating - 4.6/5\n\nEthereum Code offers a comprehensive and user-friendly platform that excels in multiple critical areas. Its seamless design, extensive educational materials, reliable customer support, robust security measures, and empowering user control make it a top choice for investors of all levels. By focusing on providing a supportive learning environment and empowering users, Ethereum Code stands out as an invaluable tool for anyone looking to navigate the complexities of cryptocurrency trading and investment.\n\nEthereum Code is a secure trading system because all the safety measures, such as two-factor authentication and secure codes are used to protect it from external breaches. Evaluating all these aspects, Ethereum Code looks like a legitimate trading platform and is worth a shot.\n\nTrade With Ethereum Code For Free\n\nEthereum Code - FAQs\n\nCan I use the demo mode to test strategies?\n\nYes. Demo mode provides a free practice session for traders. They can practice trading and test strategies as they want.\n\nI am new to crypto trading. Is Ethereum Code suitable for me?\n\nTrading experts and a novice trader can use the Ethereum Code platform. Newbies can practice in the demo mode to test their skills.\n\nHow long does the registration process take?\n\nThe Ethereum Code registration process only takes about a few minutes. The verification will verify your details and send the confirmation mail immediately.\n\nIs Ethereum Code expensive?\n\nWhen we compare Ethereum Code with other trading systems, it is clear that the former is quite affordable. Users must not pay any charges or fees to use the platform. Only $250 is required to start trading.\n\nIs Ethereum Code available on mobile phones?\n\nYes. Ethereum Code is a web-based platform and can be opened on any browser on your mobile phone.\n\nVisit Ethereum Code"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQb2hDVEQ4czVRR0thQ1VMVWI5NVBET3UtYXluS1ZsTTk0UnFoaGNObE9xWVNnUEZKWE5ISGFrMnE5ZGN2MGhJQ1hkOW5mc21CMzhXVXpJUjJjYngxZlpvQTR4elJMNzJyLUJyRldtcjFqVzA1LVZNWklEWENQUHdOcUNlTHBhV29nRnNpVDY3YXdaZ0xGYzZCNkxPZUlNRVowbWNJdHh30gGrAUFVX3lxTE5qREUwMVAwbW1ORTZuNFc5TGtMZ08wUzlFUW1PMXVoRDdiSFBEVVRRWTNYbmRyV2tkeDdHc010WExhbnBzOW1fNzhneUNrNFlQLU13dHk5Wjg0OHhrSTlya29DWjVMajgwNzZTQXVkLXhNMXk1blcxVDAzaVBENWdrTlR4UkdpbVJMZTlNbXVZUW1TTGk4eTM0Y2RibVZFRS1qcm8wYXQ3OFFlUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Wallet Deposits $56 Million in ETH on Kraken, ETH Price Drop Soon? - CoinGape",
        "content": "The world’s second-largest cryptocurrency, Ethereum (ETH), experienced a significant correction of over 3.5%, with its price falling below $3,700. The ETH price hit an intraday low of $3,620 before rebounding.\n\nEthereum Whale Deposits 15,254 ETH to Kraken\n\nIn a recent update provided by on-chain data provider LooKonChain, it was revealed that amidst the decline in the price of Ethereum (ETH), a wallet associated with the Ethereum Foundation made a significant deposit of 15,254 ETH, equivalent to approximately $56.1 million, into the Kraken exchange.\n\nadvertisement\n\nThis deposit, occurring just 8 hours prior to the announcement, attracted attention due to the origin of the ETH in the wallet, sourced from both an Ethereum Foundation wallet and another wallet that received 200,000 ETH during the Ethereum Initial Coin Offering (ICO).\n\nWhen the $ETH price started to drop, an #EthereumFoundation-related wallet deposited 15,254 $ETH($56.1M) into #Kraken 8 hours ago. The $ETH in this wallet comes from an #EthereumFoundation wallet and a wallet that received 200K $ETH in the Ethereum ICO.https://t.co/j7KPmMt1i8 pic.twitter.com/8Oi5zWMeiC — Lookonchain (@lookonchain) June 8, 2024\n\nA recent report from Whale Alert indicates that a previously inactive pre-mined Ethereum (ETH) address, holding approximately $21.9 million, has become active after nearly nine years of dormancy.\n\nThis marks the first reactivation of a pre-mined Ethereum address observed in June. In May, two similar addresses, one holding $325,535 and the other $5.9 million, respectively, also experienced sudden activity after a prolonged period of dormancy.\n\n💤 💤 💤 A dormant pre-mine address containing 6,000 #ETH (21,962,887 USD) has just been activated after 8.9 years!https://t.co/HlrVyVZ7D6 — Whale Alert (@whale_alert) June 7, 2024\n\nETH Price Action Ahead\n\nAccording to the latest findings from the on-chain data analytics firm, Ethereum’s demand has surged following the approval of spot ETH ETFs in the US on May 20. Since then, the daily acquisition of ETH by long-term holders has surged to an average of 40,000 ETH, a significant increase from the pre-announcement average of 5,000 ETH.\n\nFurthermore, the report highlights a notable uptick in the total holdings of major ETH investors, which now stand at 16 million ETH. This figure marks an increase from the pre-ETF approval level of 15.4 million ETH and the beginning of 2024, when holdings were at 14.9 million ETH\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOQkhzTVpRcDRxUUFsUjBJTGVBVzRkUUxoM0ZySy1DaVd2LW9CTmRpZUp0UTctRWw5QWhJRjBBbWhKNEZBOFNVanFyV0lpTS1EN0FlMERwTURmeVZpbFprQUh1NE9pcEVoaDFfazVlSExBTm1FWThNY1ZVZjBnaVBoaF83VjJQOHB6cGs3NG14dG1mc0oxOGhNVG1seFZZUXNvTHJvSjVfVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum ETFs Are Not Of Interest To Anyone! According To Analysts - Cointribune EN",
        "content": "Sat 08 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic world of crypto, exchange-traded funds (ETFs) represent a significant step forward for institutional adoption and mainstream investment. Recently, attention has turned to Ethereum (ETH) ETFs, which analysts suggest may experience more moderate demand compared to their Bitcoin (BTC) counterparts.\n\nCrypto: Ethereum ETFs Less Attractive than Bitcoin ETFs!\n\nJPMorgan strategists, led by Nikolaos Panigirtzoglou, estimate that Ethereum ETFs could attract between $1 billion and $3 billion in net inflows by the end of the year. In stark contrast to the $15.3 billion amassed by Bitcoin ETFs. This modest forecast reflects a less broad recognition and acceptance of ETH compared to BTC crypto, which saw a rapid 169% increase in its price over the past year.\n\nJames Davies, CPO and founder of Crypto Valley Exchange, highlights that the demand for Ether might be lower due to its relatively less established notoriety. Caroline Bowler, CEO of BTC Markets Pty, adds that “Ether does not have the profile of Bitcoin” and points to BTC’s market value of $1.4 trillion, which is three times that of Ether.\n\nLong-term Prospects of Ethereum\n\nDespite less enthusiastic anticipation, Ethereum ETFs offer unique advantages. “ETH has utility that is mostly absent in the Bitcoin ecosystem, so a large part of the overall crypto ecosystem is tied to ETH,” says Davies, suggesting significant long-term growth potential. Matthew Sigel, head of digital asset research at VanEck, supports this view, stating that “over time, we expect that investors will conclude that the application and innovation potential within the Ethereum ecosystem might be far greater than that of Bitcoin.”\n\nHowever, concerns remain regarding potential sell pressure due to the planned conversion of Grayscale’s $11 billion Ethereum fund into an ETF. Davies warns that the “sell pressure” on Ether resulting from redemptions in Grayscale’s Ethereum fund could be significant. Nevertheless, he also notes that net inflows into BTC ETFs could potentially offset this pressure.\n\nFinally, while the potential demand for Ethereum ETFs appears promising, they are expected to attract significantly less interest compared to Bitcoin ETFs. Factors such as the absence of staking rewards and differences in market perceptions of crypto contribute to this outlook.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPR3dYSVc3SFhESDAzNVFJUThtbFhDNk1NS25hU19HTWRwUXc5OFJwSjA1UGZEcV9SSUNpenN4Q2tGekdNdm5tODRvdjI4aFU5c1ZwbTdGUll2SHpPNFlxUlpFbm03eUV3Wm9sRXNWSjV2TUVLdXVCaUd3cHlUQ0gzQXVJUXZTaXVMTWlwZjU0WEJjQUd6bUpoT3JvS0tHaUo1MFJJVTR0TkY4UnVyREtDSklvSVdDZnI2R0JEaDBndmp1cEFTeGVGa1ppQWhRc1NC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Meme Coin Mom Vs. Ethereum Dad: Did Iggy Azalea Just Shade Vitalik Buterin? - Benzinga",
        "content": "Rapper and composer Iggy Azalea, who launched the MOTHER MOTHER/USD token on the Solana SOL/USD blockchain, recently took a jab at Ethereum ETH/USD co-founder Vitalik Buterin.\n\nWhat Happened: Azalea posted a meme depicting herself holding a baby with Buterin's face, along with the caption, \"he was just hangry (sic).\"\n\nHe was just hangry pic.twitter.com/AlTwEtfIKd — IGGY AZALEA (@IGGYAZALEA) June 5, 2024\n\nThis mockery came in response to Buterin’s critical remarks about the trend of celebrity meme coins, where he expressed his disapproval of the “financialization as a final product” premise driving many of these projects.\n\nCommenting on Azalea’s post, Hayden Adams, CEO of Uniswap UNI/USD said, “No issues with memecoins or celebcoins – I think there's value to memetic attention and it's cool to create markets for it. That said, the underlying purpose and value of the tech goes way beyond financial games. And the best builders in the space are motivated by positive social change. Iggy could have responded positively and used profits to donate to a social cause or something. Instead, she condescends the best builder in the entire space, proving his point.”\n\nAlso Read: Bitcoin Could Reach $150K By Year-End If Trump Wins: Standard Chartered\n\nOver the past week, the MOTHER token has experienced a dramatic surge, increasing in value by 1305.7% and reaching a market capitalization of over $200 million.\n\nThis significant growth highlights the ongoing fascination and investment in celebrity-backed cryptocurrencies despite skepticism from industry veterans like Buterin.\n\nWhat’s Next: These developments and their implications for the broader digital asset market will be key discussion points at the upcoming Benzinga Future of Digital Assets event on Nov. 19.\n\nIndustry leaders and experts will delve into the evolving dynamics of cryptocurrency investments and the impact of celebrity endorsements in this rapidly changing landscape.\n\nRead Next: Is Robinhood’s Crypto Exchange Deal Really ‘Massive’ And The ‘First Domino To Fall?’"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOcmgxOGl6T1BFSVZOSzhDLWZkMzd0b3VLblJscF9DU2szbkt2WllYVUdHSHQzSWVnYkhNTHZRMmY1ai13ZmM2WkVqOE5iMFp4NTZONUhGQ0swbXZlcHgxcGxjQ08wTjhxTTdjOTlMaFE5SElyTGhxQkhPamQyS3BSUUNUZGvSAZIBQVVfeXFMUHJqMDF1QzdTc2VsbUdkVUZOS1BZSlNqOEN5WUNXOFBXbjNFSThiNTh0YzNSdm44dFY1TlJveTMtelVzZlFZUkJQSm5JNU9tRjRHOGFwQUZzN0pFS01KdExaZ21aWjVvYlhJTnBRQnhQNFQ3MnJCQk1NWjEzaHJuMV9Kbmh6alZOOXk5X2dxYWJBdVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: June 07, 2024 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    }
]