[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNenBhVS1CRTFxMUd4X0pMSDlyU1IxYjU3YTJvVE1SSFpvSDhpXzVwUnE1cEt4SGhGWVVoTGFqMElyWEl2SXhiRmo2bm15Y3pJUnZoZXoteWFqbjBrdmN3VkEtb2Iwa19LVUIxdG1ITUxEQXNtSDYxeVMxcVZQdU56cFk0NmlnWHAzUGt0bkR2OHBVaUpMOEFn0gGcAUFVX3lxTE9SNzRCelhaTGxLVnBkdS1MWG5SdVktVnk5TzZPLTBRZ0J4N2VzR2k1LWFqbDBCXzRBMS14Y0cwOUN6dDdaQXFGMC1YU3FpY3ItTGNQUnlYb1FwTmwtWmJKaXBRQU1rMEsxVVd0dE9fdEQ2Qno5MjNVOHpiRTB0WlFKVURacWhQaHpwX2tBa2N0cTJKQko1NnY0OXdHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Top Ethereum Contributor Makes Epic U-Turn With Unexpected Gas Fee Statement - U.Today",
        "content": "Hayden Adams, the founder and CEO of Uniswap Labs, recently made a surprising statement about transaction fees on the ETH network. Adams, who leads the largest decentralized exchange on Ethereum, declared that users should never have to worry about \"gas fees.\" This unexpected opinion has added a new dimension to the ongoing debate about Ethereum's high transaction costs.\n\nAdvertisement\n\nAdams' statement comes amid a heated discussion about the expenses associated with Ethereum transactions. Recently, artist Iggy Azalea commented on the issue, questioning how gas fees are used and expressing skepticism about their impact. Although Azalea incorrectly assumed that all fees directly benefit Ethereum's founders, her comments have once again highlighted the issue of high transaction costs.\n\nNo user should ever have to hear the term “gas fee” Advertisement June 8, 2024\n\nThe debate over Ethereum's gas fees has become more intense with the rise of Solana, a blockchain known for its lower transaction costs. Solana's recent performance has led some to speculate about the blockchain's future and its ability to compete with more affordable alternatives.\n\nKey Ethereum developers, including co-founder Vitalik Buterin, have been addressing the gas fee problem for some time. Last month, Buterin introduced EIP-7706, a proposal aimed at optimizing transaction calldata and reducing gas usage. This proposal includes a new type of gas specifically for calldata transactions, with the goal of creating a separate fee market and making calldata more affordable.\n\nAmid Adams' words, Uniswap has continued to succeed, earning over $3.64 billion in total commissions to date. In the past 24 hours alone, Uniswap collected $1.62 million in fees, and over the last month, it amassed $65.95 million."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTDhEaGg1T2NwSWZLYzlmbEdCNUwwb3ROWjJRUUxOVC1fQm5IdzQyMHg5OHowLUhiaGtmMGo0STBRVGJkUEhqekRSaDlua25UbUExaXlYQTJHQXhVTG92eElfZ0ZkMk9veGNoUTN1S3hCQmgzSFRPRWxNdzhqeXZTazFONHZKR0YzYmF3cXdKV0lSS2UtLWI3RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Making Big Moves. 3 Reasons I'm Buying It Hand Over Fist in June. - The Motley Fool",
        "content": "Ethereum is poised for substantial growth not only in June, but for months and years to come.\n\nThe crypto world is buzzing with excitement as the market rides a wave of bullish momentum. While this surge is promising, it also makes choosing the right cryptocurrency to invest in quite challenging, as nearly everything seems to be on the rise.\n\nAmidst this flurry, one cryptocurrency stands out due to its recent developments and long-term potential: Ethereum (ETH 0.18%). Here are three compelling reasons why I'm investing heavily in Ethereum this June.\n\n1. SEC approval of a spot Ethereum ETF\n\nOne of the most compelling reasons to invest in Ethereum right now is the anticipated approval of a spot Ethereum ETF by the Securities and Exchange Commission (SEC). In January, Bitcoin (BTC 0.04%) was the first cryptocurrency to get this approval, and now there is a growing appetite among investors for exposure to the world's second most valuable cryptocurrency.\n\nThe integration of Ethereum with traditional finance through an exchange-traded fund is incredibly encouraging for many reasons. First, since ETFs can be purchased from brokerage accounts, a spot Ethereum ETF will democratize access for many traditional investors who are uncomfortable buying cryptocurrencies on crypto exchanges. This ease of access can attract a broader range of buyers and potentially drive significant price appreciation.\n\nYet, the most important cohort that the ETFs will cater to is institutional investors. Without the ETFs, institutional investors have been hesitant to purchase cryptocurrencies directly, due to regulatory and security risks. A spot Ethereum ETF approval will allow previously sidelined institutions known for their deep pockets to join in on the game.\n\n2. The tokenization of real-world assets\n\nAnother reason to be bullish on Ethereum is its potential for the tokenization of real-world assets (RWA). Tokenization involves converting physical and intangible assets into digital tokens on a blockchain, making them easier to transfer, trade, and manage. This can include anything from real estate and art to stocks and bonds.\n\nThe market for tokenized RWAs is expected to grow to $10 trillion by 2030, and for many reasons, Ethereum is positioned to capture the bulk of this value. The network's robust decentralization, strong security, and established ecosystem make it an ideal platform for institutions looking to tokenize assets.\n\nIn fact, we are already seeing the beginnings of this movement. For instance, in May, BlackRock (the world's largest asset manager) launched a tokenized fund on Ethereum, marking a significant step toward the convergence of blockchain technology and traditional financial instruments.\n\nHighlighting the transformative potential of blockchain technology, BlackRock CEO Larry Fink recently stated that tokenization will be \"the next generation for markets.\" And rest assured, Ethereum will be the blockchain of choice for this revolution.\n\n3. Ethereum's leadership in smart contracts and DeFi\n\nThe beginning stages of tokenization on Ethereum are an example of why it is one of the best cryptocurrencies to invest in. Launched in 2015, Ethereum was one of the first blockchains to introduce smart contracts, making it the first programmable cryptocurrency. This pioneering status has given Ethereum a competitive advantage in terms of experimentation and documentation, two crucial factors developers consider when choosing a blockchain to build on.\n\nOver the years, this experimentation has led to the development of several novel applications of blockchain technology, such as decentralized finance (DeFi). By using Ethereum's smart contracts, DeFi developers can build decentralized applications that allow financial services like lending, borrowing, and trading to occur without traditional intermediaries, enhancing efficiency and accessibility.\n\nTo put it simply, Ethereum is the undisputed leader in the DeFi space, with over 60% of the DeFi economy built on its blockchain. And with DeFi as one of the most prominent and innovative use cases of crypto, as DeFi grows, so should Ethereum.\n\nDeFi is just one (great) example of how Ethereum fosters innovation and experimentation. The recent advancements in tokenizing real-world assets demonstrate Ethereum's capacity to stay at the forefront of blockchain technology. Investing in Ethereum is essentially investing in the future potential of blockchain experimentation and development. As more projects and applications are built on Ethereum, its value proposition will continue to strengthen for decades to come."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPWnRneEI0NDB0LTF1aF9HVmZETVE4eGhtSVhGUExrUW1oME1tenVaYXFhaWl5LWYtWlk5aTc4Sk4xcmJSYzNmVU01LXRXVEZ1NUp0MHhWVUNzZGlJV0EwZFFvdUxib2toaG5lNEFPdHNCeEJKWTNKenNidU1JbXEzeTBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Beyond Bitcoin and Ether: 10 cryptocurrencies you need to know - Quartz",
        "content": "Created as a joke by software engineers Billy Markus and Jackson Palmer in 2013, Dogecoin features the likeness of the Shiba Inu dog popularized in the Doge meme. But what initially began as a joke would transform into one of the world’s most valuable cryptocurrencies.\n\n\n\nAdvertisement\n\nThe credit for Doge’s success goes to the GameStop saga that began in January 2021. The meme stock reached its peak when a group of small investors, encouraged by the Reddit community WallStreetBets and helped along by an Elon Musk tweet, skyrocketed the price of individual GameStop shares to $86.88 in January 2021.\n\n\n\nOn Reddit, investors later discussed what cryptocurrency is equivalent to meme stock GameStop — and the answer was Dogecoin. That’s how Dogecoin came into the limelight, and just as GameStop reached its peak, Dogecoin started to gain traction, peaking in May 2021 at $0.74 per coin.\n\nDogecoin had a market capitalization of $23 billion as of June 5, 2024, making it the eighth-largest cryptocurrency."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNNjhzUXpaRkhvTHF5ZFBXS1JOdHQ5NVQwTmpPV3FOUDB5N2VwbDc2ZWhndEx1cXdpQ3RPZWxpeEU5aVVEbnJ4SkFNVXEzb1JZTUFaWUNqMWphamprUEhTTVQ0WXJsdTJxejFmWkw5dVNOck5TVjU1RXkwWHlTZlZfMmhYTmhVMVR5V1ZWZ1hUN1ZzbFdBUm02eldsdmUyZV94bzd6b3F6dy01c3JKaVBXS1VB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) $16 Billion Open Interest hints at $4K Price Rebound - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNUE5ybmg5QTQ0X2FpNWZYSlFReGk2ZWVvc1ZvYmNXNFNWbDdVTXFoUnE4SjBCeGY4Tl8wNWNtTzhMSmsyNnVfcmlOTVRMR3ZqdDU4OHpITzRmMUxHWWdkeU9Qb25BdGl5dU85ZzhjVWZXYnk3a0F5VVNyaEhWQWwxYkJBWkx4ZklXVDhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Expected to Capture 20% of Bitcoin ETF Flows - Watcher Guru",
        "content": "Following the recent approval of the Spot Ethereum ETFs last month, one analyst has predicted that the investment vehicle will capture as much as 20% of Spot Bitcoin ETF flows. Indeed, cryptocurrency exchange Bitfinex’s head of derivatives, Jag Kooner, predicted the performance of the ETH offering.\n\nBoth Ethereum and Bitcoin represent the only two crypto-based ETFs in the United States. Moreover, since its approval in January, BTC has had one of the most successful exchange-traded products in the country’s history. Now, there is the expectation that Ethereum could capture a fifth of the flows going into the Bitcoin offering.\n\nSource: Watcher.Guru\n\nAlso Read: Can Ethereum ETFs Garner High Demand Like Bitcoin ETFs?\n\nEthereum ETF to Capture 10%–20% of Bitcoin ETF Flows\n\nWith the midpoint of 2024 fast approaching, the year has seen the digital asset sector climb to the forefront. Dominating discussions within finance, crypto-based ETFs have been a massive part of the ongoing discourse. As the second such opinion prepares to go live, the market is observing what its debut could look like.\n\nMoreover, they are beginning to question what effect its debut could have on the cryptocurrency industry as a whole. With Bitcoin proving to be immensely successful just five months after its launch, the presence of a secondary offering has undoubtedly become a point of interest.\n\nAccording to one expert, the recently approved Spot Ethereum ETFs could capture a significant portion of Bitcoin ETF flows. Specifically, Bitfinex Jag Kooner noted that the offering could acquire as much as a fifth of the overall flows into the digital asset investment offering.\n\nSource: Blockchain Reporter\n\nAlso Read: $438B Asset Manager Susquehanna Buys $1.3B In Bitcoin ETFs\n\n“Forecasts show that spot Ethereum ETFs could capture between 10 and 20% of the flows that have been going into spot Bitcoin ETFs,” Kooner told The Block. “The launch of gold ETFs offers a historical parallel, as when new gold ETFs were introduced, they attracted significant investment,” Kooner added.\n\nThe debut of those new gold ETFs, historically, affected the inflows in investment products that already existed. Kooner remarked, “Similarly, the introduction of Ethereum ETFs could see fund managers reallocating resources to balance their exposure to both Bitcoin and Ethereum.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1XMmJySVNrVDRZMG14dm1ZQlA4TEZraUlFX1NNN0ZPVFJrMWZEcTVlS2V2QUR0MDh5Xzc3U0kzUFF1RGMwTTVobkJDWW52bTgtQ0VSZ3lCOFJwU0Y1SWpFX3paVzhaVFB3cGZmb2lweGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Wintermute CEO questions Ethereum's leadership paradox amid celebrity memecoin controversy - Crypto Briefing",
        "content": "Ethereum leaders faces criticism for trying to merge capitalist and social goals.\n\nShare this article\n\nEvgeny Gaevoy, CEO of Wintermute, said if Ethereum fails in the future, it will not be because of technical shortcomings compared to competitors like Solana. Instead, the core issue is the contradiction in Ethereum’s leadership.\n\n“If ETH fails in the future it [won’t] be because ‘Solana is faster’, it will be because the [ETH] ‘elite’ is still stuck in a massive contradiction,” Gaevoy stated in a recent post on X.\n\nHis remarks come as a response to the controversy that erupted following Vitalik Buterin’s critique of celebrity memecoins. According to Buterin, projects should aim to deliver societal value and leave participants content, rather than focus on enriching celebrities and early investors.\n\nButerin’s stance drew a sharp rebuke from hip-hop artist Iggy Azalea, who recently launched her own memecoin, MOTHER. She posted a meme showing her holding a baby that resembled Buterin.\n\nAzalea’s photo prompted Uniswap Labs co-founder Hayden Adams to defend Buterin’s role.\n\nHe criticized Azalea for downplaying Buterin’s contributions to the crypto community, expressing disappointment that instead of reacting positively and using profits to support social causes, the singer chose to mock Buterin.\n\nNo issues with memecoins or celebcoins – I think there’s value to memetic attention and it’s cool to create markets for it That said, the underlying purpose and value of the tech goes way beyond financial games. And the best builders in the space are motivated by positive social… https://t.co/FQhawNl7GP — Hayden Adams 🦄 (@haydenzadams) June 6, 2024\n\nThat was when the Wintermute CEO jumped into the debate and criticized Ethereum’s leadership. He argued that Ethereum leaders are attempting to create a capitalist blockchain system while simultaneously addressing social issues—a stance he sees as inherently contradictory.\n\n“You are either building capitalism or planned socialism. I’m sorry, you really [can’t] have both,” Gaevoy added.\n\nGaevoy’s comments sparked controversy among crypto members. Many disagreed with his view, saying that being against celeb memecoins does not equate to building a socialist system.\n\nNot sure how Hayden and Vitalik saying how they don't like certain trends means they are against capitalism (or aren't involved in building capitalist systems anymore) They both have a certain vision of crypto, in terms of the types of things people will build and what people… — Mike van Rossum (@mikevanrossum) June 6, 2024\n\nExcuse me, but in what way Vitalik or Hayden are building socialism? Being against obvious rug pulls != building socialism — DeFi Made Here (@DeFi_Made_Here) June 6, 2024\n\nIn response to these disagreements, Gaevoy said it all came down to the underlying principle.\n\nAccording to him, if capitalism is the foundation, integrating features to mitigate its negative impacts is beneficial. However, if the primary goal is “social justice” or creating “only good things,” capitalism should not be an afterthought.\n\nTo me its about the primary guiding principle. If you key guiding principle is capitalism and then you make extra steps to make it less damaging – I'm all for it. If your guiding principle is, idk, \"social justice\" or \"only good things should be built\" and then you attach… — wishful cynic (@EvgenyGaevoy) June 6, 2024"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQWFVyS1hFVFAwWWZwNW41bUVEYWw0Y1lQWk5iU0VNbWt3M2ZLS1RWVW11YXV3cXB3RVRTc05jcGFybmMtVmNjd1VCMzFodGJ3cU5YWnJsRmpNNjNSUVhpYnFVZm4yS1A0aEVtR09QQ2RCUVNvcS02NnptQ1lyMG12ci1nR29IejQtUnF6NlZuZC1BZzd5U2w2alRmNjV2N0VRWmZaTtIBqgFBVV95cUxON2dOb3ZNNkhCdUhlY1l6cklMZVVEYmJXdmNacEZrSTEwQ3RoaUlKZHdNSHNNdmxkUXNXbXBNRDZVb3oyS29QYjBVZTVKWFFMWnY2bWh4dUk1ZXljbzVRS2czMTJnNU1Ob0QyQThFdnMzTTJDQzR1R1djYmlDMjctZzUzZjFPa0RzY21ZdnVFTDJkdXUzamlBc0pPcW1XRzMwS1hnUFhXTks4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Institutional Money Pours Into Ethereum, Addresses Holding Over 10K ETH Surge - CryptoPotato",
        "content": "All eyes are on spot Ethereum ETFs. SEC’s surprising turn of events last month has prompted a surge in addresses holding large amounts of ETH during the period.\n\nSuch a trend could potentially hint at a much-needed revival for the world’s largest altcoin, which has been struggling to surpass the $4,000 resistance level.\n\nWealthy Investors Accumulate ETH\n\nThere has been a 3% rise in the number of Ethereum addresses holding 10,000 or more ETH over the last three weeks. This metric is seen as an indicator of rising institutional investment and accumulation by Ethereum whales and high-net-worth individuals.\n\nPopular crypto analyst Ali Martinez tweeted,\n\n“The number of #Ethereum addresses holding 10,000+ $ETH has increased by 3% in the last three weeks, signaling an important spike in buying pressure!”\n\nAs such, a spike in addresses with large ETH holdings suggests increasing buying pressure and demand from deep-pocketed investors. This could potentially be an upcoming bull run for Ethereum as whale accumulating supply is often a precursor to an uptick in asset prices.\n\nThis comes a month after the US Securities and Exchange Commission (SEC) reached a landmark decision to approve spot Ethereum ETF. The financial watchdog granted permission for a total of eight separate ETF products tracking Ethereum proposed by Grayscale, VanEck, ARK Invest, Franklin Templeton, Fidelity, BlackRock, 21Shares, and Invesco Galaxy.\n\nThese listings will enable traditional investors to gain exposure to the cryptocurrency through regulated investment vehicles and are also expected to unlock new capital inflow while simultaneously boosting its mainstream accessibility and liquidity. Hence, whales are bullish on the development as evidenced by the resulting accumulating activity.\n\nEthereum Scarcer Than Bitcoin on Exchanges\n\nFurther validating this trend is Glassnode data, which shows that centralized exchanges are experiencing a supply crunch for both Bitcoin and Ethereum. Only 11.73% of Bitcoin’s total supply and an even lower 10.56% of Ethereum’s supply remain on major exchanges.\n\nThis indicates that investors are withdrawing and holding their cryptocurrencies off exchanges, further signaling an accumulation trend.\n\nWhen supply on exchanges dries up, it can create upward price pressure as the remaining liquidity gets absorbed by buyers. Interestingly, Ethereum appears to be even scarcer than Bitcoin on exchanges currently."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9zZHdCTENnS3h3NV9fMzgwZjJUV0FicFJRQUVMaFNPTjB1eURQTWtodDkyamllVnEtSGg0LWtNQlJxR0wtWVdlSFIwazZ6UEdmY1FhS0VBTGdteWw4VzY1QUd6SWl5ZWRZc095eWpkZHZDaTBJV1VZTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum exchange balances at 4-year low - crypto.news",
        "content": "Bitcoin and Ethereum user balances have dropped to levels not seen since 2020.\n\nGlassnode data revealed that user balances of Bitcoin (BTC) and Ether (ETH) on centralized exchanges reached a four-year low as investors held out for higher prices in a bull market.\n\nBTC balances dipped to below 2.3 million coins, valued at around $160 billion, while ETH balances have dropped below 16 million, amounting to less than $59 billion.\n\nBitcoin and Ethereum exchange balance at 4-year low | Source: Glassnode\n\nWhy Bitcoin and Ethereum exchange levels dropped\n\nThe amount of BTC and ETH on exchanges has been in a downtrend since before July 2020, per Glassnode. Data confirmed that users continued to withdraw assets from these platforms following the pandemic, through the previous 2021 peak, during the 2022 Terra-FTX contagion, and even after spot BTC ETFs were approved.\n\nThe four-year pattern suggests that crypto users have adopted a bullish long-term outlook, expressing confidence in the future appreciation of these assets regardless of market cycles.\n\nAfter the COVID-19 crisis in 2020, inflation also rocked world economies and incentivized investors to station capital in technologically sound vehicles. Bitcoin’s hard-capped supply and immutable design bolstered its status as an inflation hedge and sovereign nations like El Salvador have adopted the cryptocurrency as legal tender.\n\nYou might also like: Bitcoin ETFs see significant inflows despite market fluctuations\n\nThe bullish thesis is perhaps solidified even further as Wall Street behemoths like BlackRock and Fidelity drove institutional demand through spot BTC ETFs. Companies like MicroStrategy under BTC maxi Michael Saylor have also parked billions in the top digital asset.\n\nAs the second-largest crypto and top altcoin asset, ETH commands its own bullish thesis as the leading substitute for BTC. The token powers the biggest decentralized finance (defi) ecosystem worth nearly $70 billion per DefiLlama.\n\nIn 2020, developers launched the Beacon chain, which kicked off the eventual transition from proof-of-work (PoW) to proof-of-stake (PoS). The move unlocked Ether staking, a process of locking up ETH for network security and passive yield.\n\nAt press time, over 27% of Ethereum’s supply was staked. In other words, users have deposited over $119 billion worth of ETH in staking providers like Coinbase, Lido, and EigenLayer.\n\nThe hype around spot ETH ETF approvals, defi growth, and staking surges has culminated in a positive outlook for the cryptocurrency and has further encouraged users to hold on for dear life, otherwise known in the crypto community as “hodl.”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQ2FlbkdveHVOVDFseWpWeHZJZ1ZXLVRxMkliaXVnRWlYRWlocVZ5NURUbFloaVZGNUJqcDMtZDBGdzgtYjZVeHF0Wng3SzNrU2lEeTdtdWpBSDNqT25POGtYTm9vUkpuakg2OGJfdlc0OWxEcHVzTWJfbXNFcTF3WV9Dd2RRWS1MaWRRMmJuUFRLYjVtTERvZnZxQ0FESXBIT3lHTk5XU1RMTzNfWURHSDVtekR2NUo1Z3hoZ3QtZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "World's largest bank ICBC praises the evolution of Bitcoin, Ethereum as innovative financial assets - CryptoSlate",
        "content": "The world’s largest lender, Industrial and Commercial Bank of China (ICBC), recently published an in-depth analysis highlighting the rapid evolution and growing diversity in digital currencies, where it compared Bitcoin to gold and deemed Ethereum “digital oil.”\n\nThe report emphasizes the human capacity for imaginative belief, as noted by historian Yuval Noah Harari, as a driving force behind the exponential growth in digital currency types and applications.\n\nVanEck head of digital assets research Matthew Sigel noted:\n\n“Chinese SOE banks keep writing love letters to Bitcoin and Ethereum.”\n\nThe ICBC report outlines the divergent development paths of various digital currencies, each addressing unique needs within the financial ecosystem.\n\nThe love letter\n\nAccording to ICBC’s report, market demand has fueled innovation in the digital currency sector, from the birth of Bitcoin (BTC) to advancements in Ethereum (ETH) and the exploration of central bank digital currencies (CBDCs).\n\nICBC said that Bitcoin has managed to retain a scarcity similar to gold through its mathematical consensus mechanism. The flagship crypto has resolved issues related to divisibility, authenticity verification, and portability. The report added that despite Bitcoin’s waning monetary attributes, its status as an asset is solidifying.\n\nMeanwhile, Ethereum provides “technical power for the digital future” and is establishing itself as “digital oil” capable of powering myriad applications across the web3 ecosystem.\n\nEthereum, distinct from Bitcoin, incorporates Turing completeness through its proprietary programming language, Solidity, and its virtual machine, EVM.\n\nThis feature allows developers to create and manage complex smart contracts and applications, positioning Ethereum as a critical platform for DeFi and NFTs. The report also acknowledged Ethereum’s potential to extend its influence to decentralized physical infrastructure networks (DePin).\n\nDespite the potential, Ethereum faces several practical challenges, including security vulnerabilities, scalability issues due to high computational demands, and significant energy consumption.\n\nEthereum developers are exploring various solutions to address these challenges. The introduction of the Proof of Stake (POS) consensus mechanism and sharding technology in the Ethereum 2.0 upgrade aims to enhance network throughput and sustainability. Additionally, developers are working on Layer 2 solutions such as state channels, side chains, and rollups to improve scalability.\n\nStablecoins and CBDCs\n\nThe report also highlighted the crucial role of stablecoins in bridging the gap between the digital currency market and the real world. Stablecoins, which peg their value to traditional assets like fiat currencies, offer stability in the volatile crypto market.\n\nICBC said that stablecoins facilitate seamless transactions and provide a reliable store of value, making them an essential tool for everyday financial activities and a bridge for integrating digital currencies into the global financial system.\n\nFurthermore, CBDCs represent a significant innovation in the modern monetary system. By digitizing fiat currencies, central banks can improve the efficiency of payment systems, reduce transaction costs, and enhance the effectiveness of monetary policy.\n\nAccording to the report, CBDCs can streamline cross-border transactions, reduce reliance on intermediaries, and offer greater financial inclusion by providing access to digital financial services for unbanked populations.\n\nThe report noted that the development and implementation of CBDC infrastructure requires careful consideration of privacy, security, and regulatory implications to ensure their success and widespread adoption.\n\nThe report concluded that while the development vision for each digital currency varies, all aim to enhance financial inclusion, security, and payment efficiency. As digital currencies continue to evolve, developers and policymakers need to focus on balancing sustainability, security, and efficiency.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxObmd3dEU4RXg4RFBXZkZPcDlvOFpkaXRhZ3hXTTFKOW4zN19HVHUtbEowVnVtWEZrbXcwUERsVlZYQ3FtQk5UVzdlaUYxM1YxckRCLWhRalBMTE82MGtNSDF1eFFxRW80UURlSWlDSEpybTZSWGJuWUJIX0N3d2FuclRoM2ViVUswbkRYd3ZuU2JrenlaOE9ocNIBngFBVV95cUxPdkJaMUFPRGwtVi1PTmhtRlMyNEplUUlCWXRGenc0ZFBhcEZDNVpCTUNTU2ZEOEI2UENLTU1RalNRMGNVR3d5QlJjMUgwdWZhMDlYN0F1SUVtYnp6OWo5N3ZJTXlXUmYteHB3WWl2cl91ZnczZ1ZtSzZWeU1Md056Z3RFWXhTM2xWc3NBaDBPLURxemlfa0NMb3BXbDNiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s sentiment takes a hit after ETF nod, but it’s not all bad news! - AMBCrypto News",
        "content": "Ethereum’s funding rate has remained positive despite recent declines.\n\nThe ETH trend has also remained bullish despite the price declines.\n\nAfter the news of the Ethereum [ETH] spot ETF approval subsided, its weighted sentiment declined as well. Despite this decline, other metrics suggest that Ethereum might be poised for a positive run once spot trading resumes.\n\nEthereum’s sentiment and social volume declines\n\nAn analysis of the Santiment sentiment chart showed a decline in Ethereum’s sentiment. The chart indicated that weighted sentiment spiked to over 6% on the 20th and 21st of May.\n\nIt then briefly declined to around 2% before spiking over 6% again on 23rd May. This spike coincided with the news of the ETH spot ETF approval, reflecting heightened conversation and sentiment during that period.\n\nHowever, after that spike, there have been declines in the weighted sentiment, which has now turned negative. As of this writing, the weighted sentiment is around -0.4.\n\nThis indicates that negative sentiment now outweighs the positive sentiment that Ethereum enjoyed a few weeks ago.\n\nAdditionally, an analysis of the social volume showed spikes corresponding to the increases in weighted sentiment. The chart indicated that social volume surged to 4,197 during those periods.\n\nHowever, similar to the weighted sentiment, it has since declined significantly. As of this writing, the social volume was around 415.\n\nEthereum’s trend of new addresses continue\n\nAn analysis of the new addresses chart on Glassnode revealed that new addresses have continued to flow in despite the weak sentiment. As of this writing, the number of new addresses exceeds 105,000.\n\nAlthough there were declines at the beginning of the month, an uptrend is now evident. This indicates that more addresses are being created even before the spot ETH trade gets underway.\n\nThe number of addresses could further increase once trading starts.\n\nEthereum remains positive on the derivative side\n\nAn analysis of Ethereum’s weighted funding rate on Coinglass showed that it has remained positive despite recent declines.\n\nThe chart indicated that the funding rate was around 0.092% as of this writing. This suggests that buyers dominate the market, and there is a strong belief in a future rise in Ethereum’s price.\n\n– Read Ethereum (ETH) Price Prediction 2024-25\n\nETH sees slight increases\n\nAs of this writing, Ethereum was trading at around $3,690 after a 0.4% increase. AMBCrypto’s analysis of its daily time frame price trend showed slight increases over the last two days.\n\nThese slight increases followed an over 3% decline on 7th June, which brought Ethereum down from the $3,800 price range."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdWpGYjg2NGlfWmV6aGRKZTlFelpaU3hYa0hwaWFmV2d0UFNWZ2RYUzFGdzkzekRCQXU2b1MxQ215NUprd0VRc0FXUzFJdjdQQTJCN1FXMllhalA2TFRvUlRwOEYzVld5SE5XVVYyQlpSaC11cXl6TmdOZFNZNTZ3QXp5Z9IBiAFBVV95cUxPaWVHQncyazQtV2pLTUExQlBwSjVjeWF0N1FGa1ZvSlVTSnBSdXN6X3JQbW5odDBKZVBLT3BCYVo5RmF2SGhxa3d1djJFUlN2VExCSjcycml0eVhVV3VNRkxiQ3RSenc4ejd0TVVEYmJlR1lOR2RLZ3lfSEVRYnd1M1FTeEQwWTk1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Generated More Revenue Than Robinhood and Etsy in Q1 - U.Today",
        "content": "Ryan Rasmussen, a senior researcher at Bitwise Asset Management, has noted that Ethereum, the second-largest blockchain network, managed to generate more revenue than major public companies of the likes of Etsy, Yelp, and Reddit in the first quarter of 2021 .\n\nAdvertisement\n\nEthereum generated more revenue than Robinhood, Etsy, Yelp and Reddit in Q1 2024.\n\n\n\nProbably nothing. https://t.co/OYYWrYvdZx — Ryan Rasmussen (@RasterlyRock) June 10, 2024\n\nAccording to data provided by Coin98 Analytics, Ethereum achieved record transaction fee revenue of roughly $1.2 billion. This marked a 79% increase compared to the previous quarter.\n\nEthereum's transaction fees recorded a significant uptick in March due to the major market rally that took place during that month. Bitcoin hit its current all-time high of $73,737 while the flagship altcoin also approached its all-time peak of $4,878 which was logged more than two years ago.\n\nAdvertisement\n\nEther is likely to end the second quarter on a high note as well due to the approval of spot exchange-traded funds in the U.S.\n\n$22K by the end of the decade?\n\nAmerican investment management firm VanEck recently predicted that the price of the leading altcoin could potentially reach a whopping $22,000 by the end of this decade.\n\nFor Ether to achieve this pie-in-the-sky target, the network has to become cheaper and more efficient.\n\nLast year, VanEck predicted that Ethereum's revenue could potentially grow to $51 billion on an annual rate in 2030, which is its base case. Its bull case is $136 billion.\n\nThe company counts transaction fees, including the tip fee, as a revenue line.\n\nVanEck has also predicted that Ethereum could end up becoming a store-of-value asset, evolving beyond merely a transactional currency. This could potentially add “Security as a Service” (SaaS) as a new revenue item."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMklFNW85TG5wRUZpOThaZzV5Z2w3TXVTRXVTRi1fR3g3eUtIR09QNHV3VTJNNnJNazUzZDlRSFZ2WGNzUEhET3I1dVJjSFRjcHk3VVd2MVo1NVVHMk5pOHRqVFNibFlSdGhkWDZpVDJjOGpidUxvVF9JaWhvLWR0SDJXTTBGMjZ2a3hndElxWXg1Z9IBlwFBVV95cUxQSkI0dTMxcjFrbjMtd2dDR1JIQW5nV09HUDluR05YdERoaFI1SUkwNkNhLWl1azN5MDJtcG9wVnpoeUlLNlFjNjFMeXdYVFRpVHVwODh4TFRfRVNNdEc1VFd1cHhvZ1NYVHM3NVdxZW9RNFNTU2V2OXBoT1ZQX0NxTUxMbVdudENReHJPbVY4bjdJNkdtc1VN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Emerges as Crypto Darling After SEC’s Spot ETF Nod - CryptoPotato",
        "content": "Ethereum witnessed its strongest week in terms of capital inflow since March, with total inflows amounting to $69 million over the past week, as per the latest stats by CoinShares. The latest influx can be attributed to the surprise decision by the US Securities and Exchange (SEC) to allow spot Ether ETFs.\n\nAs a result, Ethereum’s YTD inflows surged to almost $81 million.\n\nThe improvement in investment products based on Ethereum had a significant impact on other digital asset products, attracting a staggering $2 billion. This subsequently resulted in the recent 5-week streak of inflows to $4.3 billion.\n\nBitcoin Still King with $1.97B Weekly Inflow\n\nEthereum products may have overshadowed Bitcoin for the past few weeks, but the latter remained the main attraction, with weekly inflows of $1.97 billion. On the other hand, short-Bitcoin investments experienced outflows for the third consecutive week, recording $5.3 million.\n\nAltcoins also saw a minor uptick in activity. Investment products based on Solana, Litecoin, and Chainlink witnessed $0.7 million in weekly inflows each. Meanwhile, XRP and Fantom stood out with inflows of $1.4 million and $1.2 million over the past week.\n\nTrading volumes in exchange-traded products (ETPs) soared to almost $13 billion for the week, representing a 55% increase from the previous week. According to the latest edition of CoinShares’ Digital Asset Fund Flows Weekly Report, inflows were observed across almost all providers, coupled with a continued deceleration in outflows from established players.\n\nThis turnaround in sentiment is believed to be a direct response to weaker-than-expected macroeconomic data in the United States, which has brought forward expectations for monetary policy rate cuts. Positive price movements led to a rise in total assets under management (AuM), surpassing the $100 billion mark for the first time since March of this year.\n\nUS Leads $2B Global Crypto Inflow\n\nRegionally, the US experienced the highest inflows last week, registering $1.98 billion. In fact, CoinShares found that the first day of the week marked the third-largest daily inflow ever recorded. The iShares Bitcoin ETF now comfortably exceeds the incumbent Grayscale, with $21 billion in assets under management.\n\nHong Kong, Canada, and Switzerland followed suit with inflows of $26.1 million, $12.7 million, and $10.6 million, respectively, whereas Brazil, Germany, and Australia settled with $9.5 million, $2.5 million, and $1.7 million in inflows, respectively. Sweden, on the other hand, recorded a weekly outflow of $9.2 million."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNVVltSWVfbjhYMnRBaF9ZSE9nQy0zWEdILTU4TVpzUnVlT01BbFhlVVNNWThmaWZQMVhNOWE2SlhUQmRvSGNuamdXcUUzVER1OW9icXhqR2EtYjBfeVo2ci0wRmN2QnIzdDVMZFRLQmRPdkNnSnFBOWlYTWJZYU8xVU9aMk12SGhtVkk2NUhiSWFHQUtmNWEyZ0Fsc1dKT3VrTWZDX2pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "The price of Ethereum in Bitcoin is still falling, but not in USD - The Cryptonomist",
        "content": "In recent days in the crypto markets, an interesting dynamic is occurring regarding the price of Ethereum in Bitcoin and in USD.\n\nThe thing is curious especially because by the end of the month, or at the latest by the first week of July, the final listing of spot ETH ETFs in the USA is expected, but despite this at the moment Ethereum appears clearly subordinate to Bitcoin.\n\nThe price of Ethereum and Bitcoin in USD\n\nRegarding the price trend in USD in recent days, there is not much to say about either Ethereum or Bitcoin.\n\nAfter the sudden movement on Friday, when the price of BTC dropped almost abruptly from around $72,000 to around $69,000, over the weekend it did nothing but move sideways just above $69,000.\n\nAmong other things, the current level is perfectly in line with that of last Monday, so Friday did nothing but burn the gains accumulated during the week.\n\nIndeed, at the beginning of June it was below $68,000, so the current level should still be considered very good, being in fact only 6% lower than the historical maximum.\n\nA similar argument can also be made for Ethereum.\n\nThe current price is below $3,700, and it is in line with that of the last decade of May.\n\nCuriously, however, it is still at -25% from the absolute highs of 2021, but last week it had not risen much.\n\nAfter the boom of May 20, when the news of the possible imminent approval of the applications for the issuance of a spot ETH ETF in the USA came out, it rose only until the end of the month, then started June above $3,700 and in fact has been lateralizing until now.\n\nFriday had reached just above $3,800 before the drop that brought it back below $3,700.\n\nDuring the weekend, it did not move from this last level.\n\nThe dynamics of this morning\n\nThis morning, however, there was some small movement, although not significant.\n\nThe price of Bitcoin has moved from $69,700 to $69,200, as if it wanted to start a small bear trend, but once it reached this last level, it recorded a rebound that seems to have averted further declines, at least for now.\n\nThe price of Ethereum went from $3,715 to $3,655, but only to bounce back and return above $3,670.\n\nThese are dynamics that only serve to liven up the markets a bit, but they are not decisive in any way, not even in the short term.\n\nHowever, it cannot be ruled out that tomorrow or the day after tomorrow this period of lateralization may end, even if it is not yet clear in which direction it might go.\n\nThe Ethereum/Bitcoin ratio and the relationship with the price in USD\n\nThe only truly interesting dynamic is that of the relationship between Ethereum and Bitcoin.\n\nFirst of all, you can analyze the price trend of ETH expressed in BTC.\n\nAt the beginning of June, one ETH was worth about 56 thousandths of BTC. However, already on June 2, this price started to drop.\n\nIn particular, on June 3rd it had dropped to 54 and on June 5th to 53.\n\nAfter Friday’s drop, it ended up falling below 53 thousandths of BTC, so now it is still below.\n\nIt is worth noting that at the end of May it had also risen above 57 thousandths, so this is a decline that has been going on for more than two weeks now.\n\nConsidering instead the ratio between the market capitalization of BTC and that of ETH, today it has risen to 3.1, after being below 2.9 at the end of May.\n\nHowever, these are not very high values, given that before the news of the probable approval of spot ETH ETFs it was almost 3.6.\n\nWhat matters most at this moment is that from Friday’s drop this ratio has risen, albeit slightly, indicating that Bitcoin is holding up better than Ethereum in these days when financial markets seem a bit worried about the Fed’s restrictive monetary policy.\n\nThe dominance of Bitcoin\n\nThe picture for altcoins becomes even bleaker if we analyze the dominance of Bitcoin.\n\nAt the end of May, according to Trading View data, it had dropped to 53.7%, and since then it has started an almost constant rise.\n\nJune started above 54%, and last week it had already risen above 54.7%.\n\nThe most interesting thing, however, was the reaction to Friday’s drop, with Bitcoin’s dominance suddenly jumping from 54.6% to 55.5%, although it then fell to 54.9% over the weekend.\n\nThis morning, however, it rose again, returning to 55.5%, before slightly correcting to 55.4%.\n\nIf we take as a reference the 51.9% at the beginning of the year, it is evident how in this 2024 it is precisely Bitcoin that dominates the crypto markets, although there are occasionally some small exceptions.\n\nAmong other things, the maximum peak of the dominance of the year was 56.3%, which is not much higher than the current levels. This gives a good idea of the fact that altcoins as a whole are not going through a good moment at all. Just think that the current levels are similar to those of the second half of April 2021, that is, in the midst of a great bull run.\n\nIn summary, despite the fact that in theory the attention at this moment should be focused on Ethereum, it is still Bitcoin that dominates the crypto markets, with the altcoins that for now are limited to suffering while waiting for better times,"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBKNUxXTFZRQUplR2F0Q2ZxWTJERUp1ZVJtdVo0UkJZU0l3bXRGcmtEMHA2TUNTb3d2QXc1NkZaQVZEWUNzdE1tRE5DRkFtaTgzTGRCRDc0MllNaDNKcWpWcmp5eTN3bjA40gFuQVVfeXFMTmwzeVNNbnR4SUlIeUtEOFdSUVVlQ0ZwNU1RWV9wdS1TMnNqa2NyR3BtU2JLN2xUUnZUbUF3SWtrNjZDN00yR1FqR0dtYXVkaENuc1NUSllPZWhxdDNfeUhoTVZrSV8zMGNzMkIzM2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Loses Critical Support Level - U.Today",
        "content": "Ethereum fell below the $3,700 threshold, failing to break through the consolidation channel. With the price failing to surge upward, we might see another period of consolidation where the moving average could catch up with the massive volatility witnessed a few weeks ago and potentially provide some ground for a rally continuation.\n\nAdvertisement\n\nSince this level has been a crucial area of support for ETH, the recent decline below $3,700 is especially raising some concerns and questions. If it breaks below, it may indicate that bulls need to reorganize as bears are becoming more powerful.\n\nSharp swings in price action are characteristic of a volatile asset like Ethereum. Based on the current trend, it appears that ETH is having difficulty keeping up its upward momentum.\n\nEthereum went through a consolidation phase, fluctuating between support and resistance levels, as the chart illustrates following a significant rally. This type of activity typically occurs before a notable change in price either upward or downward.\n\nAdvertisement\n\nA deeper drop toward the 200-day MA, a more reliable measure of the direction of the long-term trend, could occur if it is unable to hold. In the near run, this might entail increased downside risk. An additional important consideration is volume.\n\nHigher-than-average trading volumes were seen along with the recent decline, suggesting that sellers are more active. This could indicate that more traders are cutting their positions, which would put more pressure on the price to decline. The RSI, on the other hand, is circling around neutral. This shows that Ethereum has room to recover if the mood of the market turns around, and it is neither overbought nor oversold."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTlJkVGhvUDBldUgwTEtmNlExWGRRT0ZZLWxNeUR0TnE5dU9uYUdDMmFaaW5tcXhTQ3FNdWp4LUU2aGVaM1RmRVZZQnF3bDlkc05DbGpqcS1jRE9sV2ZaTzR4RWhIZl9rcy1vT0dMaTBkUVdtT1FXY3UyZUowbEZCZVhKc3JxNUVvUVc0Nk1CaThlUENLYWIydTVJdGxCMm_SAaQBQVVfeXFMTmswN056eDdub2ttMzJtR3BKLWVINzg1YWhEX09NdnA5ZmlkSDBzbUUwcC15WGdoWHFRaUlNN0ktSG1RbHZ0RGhnaVVjT2N3S0laX1ZTSlJmXzcwWTJyV3ZUQ0VoekpOT2J3LUJVZHljbS1VYmhNN2R3YXJXSkNtYjBnaENoQ0FxY0R4WHRjeVluZzVrQW51ZF9FdS1MQU1WZlZyc0s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Mega-Whale Addresses Surge In Three Weeks, 83% ETH Price Rally Likely - CoinGape",
        "content": "After facing some selling pressure last week, the Ethereum (ETH) price seems to be stabilizing around $3,700. On the other hand, the Ethereum on-chain indicators continue to show strength hinting at buying pressure on the upside.\n\nSurge in Ethereum Whale Addresses\n\nCrypto analyst Ali Martinez has highlighted a significant rise in the number of Ethereum addresses holding 10,000 or more ETH, which has increased by 3% over the past three weeks. This uptick signals a notable spike in buying pressure for Ethereum.\n\nadvertisement\n\nOn-chain data from Santiment reveals that enthusiasm for Ethereum surged following the SEC’s approval of Ethereum ETFs. Despite this initial excitement, social sentiment has now stabilized, which is considered an ideal state ahead of the commencement of trading for these new Ethereum financial products.\n\nETH Price Action Ahead\n\nOn the other hand, some market analysts believe that the ETH price is forming chart patterns similar to that in 2021, after which it rallied by a staggering 83%. In a recent analysis, noted analyst Caled Frazen drew attention to the striking similarities between Ethereum’s current price action and its performance in 2021.\n\nWhile cautioning against expecting an exact repetition of historical patterns (“history rhymes, but it doesn’t repeat”), Frazen emphasized the significance of the observed parallels. Frazen noted that in the 2021 cycle, the “red zone” served as a crucial level. Although it wasn’t flawless support, it proved significant enough. Following a failed breakdown, Ethereum witnessed a remarkable rally of +83% within 50 days.\n\nBased on the Coinglass chart depicted above, Ethereum (ETH) open interest witnessed a decline from $16.97 billion recorded on June 6 to reach $16.35 billion as of the latest update on June 9, marking a decrease of $620 million.\n\nDespite ETH’s price experiencing a 7.38% dip from its weekly peak on June 6, the reduction in open interest was comparatively moderate, contracting by only 3.65%—almost half of the price decline.\n\nA deceleration in open interest reduction relative to price decline amid a market downturn can potentially be interpreted as a bullish recovery signal for two significant reasons.\n\nIn the event that Ethereum ($ETH) breaches the support threshold at $3650, there’s a possibility of a downturn toward $3152, marking the previous Fair Value Gap (FVG).\n\nShould Ethereum manage to hold steady at the $3650 mark, it could signal a potential upward trajectory towards $4000. Furthermore, surpassing the resistance barrier at $4000 might instigate a robust bullish surge targeting the $6000-$7000 range.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPb0pZd0wtdVU2UVdOVHVXRzJVSkRFMmpDMUMtdk40Sll3LXN3T2V2QWhDUVZ3V3ppWC1ZOTlQc1hNc2JoTTZGUmM4elhiMGUzMjgxQ2ozZUVMRE9xRUFpZ2N1enVvR1JzMTExSEZRZUcwcTJjTzl1Q2NTa1VZMFd2YU5nN2ZndlHSAYwBQVVfeXFMUGlOaEF2QnRneUpiSEdOMUNEWUJ2MnRJMWZpeEtuTi1iSmVTVGNDWlQxaWpGVC1USlEtN3c0QlBNS3NZOEdyaEZvbXFNRVRtSVhZSDNtVjZ6amt1aUpVZmRadFd4bHRYM2dhalZDYjBWdlRQSGZfM0FGY18wRHBwZE1qRmZKUTU5aGZjVkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s rally halts: Examining ETH’s potential next moves - AMBCrypto News",
        "content": "Ethereum’s current decline signaled a cooling-off from its recent highs\n\nDerivative data pointed to continued market interest.\n\nEthereum [ETH] seems to have come off its ETF hype-induced rally as bulls have started to take a hike.\n\nAt press time, the largest altcoin in the world has seen a decrease of 3.7% over the past day and 2.5% over the past week as the market awaits the approval of the S-1 forms for the ETFs. So, is the rally over already?\n\nAMBCrypto’s analysis of TradingView saw that Ethereum has been unable to maintain its highs and is now consolidating at lower levels.\n\nThe Moving Averages (MA50 in blue and MA200 in red) indicated a cooling-off period.\n\nInitially, the price surged above both moving averages in a strong bullish move but has since declined and is now trading below these key indicators, as we see a shift to bearish momentum in the short term.\n\nThe RSI, sitting around 45, also indicated a lack of strong buying momentum, with values leaning more toward the oversold territory, but not conclusively so.\n\nEthereum’s social volume has also declined significantly, suggesting that public interest in and sentiment toward the altcoin are low.\n\nThis reduction in social engagement could be contributing to the decrease in Ethereum’s price, as less discussion might correlate with reduced trading activity and demand.\n\nInterestingly, the trading volume of Ethereum’s derivatives market has sharply increased by over 70%, meaning there is heightened market engagement.\n\nNotably, the long/short ratio across different platforms also shows more bullish sentiment on platforms like Binance [BNB] and OKX.\n\nWhat Ethereum’s future holds\n\nThe on-chain data for Ethereum presented a predominantly bullish scenario. 89% of holders are currently making money at the present price, indicating a strong upward trend that has benefited the majority.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe significant concentration of the token by large holders (51%) suggested that while there was potential for high volatility due to possible large-scale sell-offs, the market was stable, with these major holders likely maintaining their positions.\n\nOverall, Ethereum bulls seem to be cooling off temporarily, likely due to the latest US jobs data. But the rally is not over yet."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQcGRqbGFGSS1lYUh4M0JYSmFBWGFfNTFRT3Y2bE5lalE1NDFxTXVHSWJvcE82QXVnLU5ESGZhTXRMcDdVNExTM21RZkwtZVdieE42RlpaNkFUN2dYaVdlZzhNejVIam8zMEd0X2pEdGlMU2kzUTNwTURpbjMxUVA4YmIzQnBteDRaNkk3d2h0X2xtYnd6MlN2RTFyTm9sNEtWMl9hN2lTdko0RFpnZjBKMlFxYWM1ZFhxT0NyUTVyMmliRFBEWUo3dkJleUVqeUUyaVFMTFozLWJwbENqOUlSTFA5VmswcHPSAewBQVVfeXFMUHVHZzh5STNDUWJ5X3h2SUUwV0k4TzVuR2lsMGRGb3M4UU1RZEctR3VRdGc2TGx6OVVoYTMwdzhSZHRxSS0zWXJFdlRvd0tmYnlIeVlFdC1lV2NlY3FKQ1Q2WWJITDJhM1AxZGpubU1CX2U2V0JSbkhPN1FEVnRyTXRyMzZkY010bFF2V0dxM2t1b1R1cU9YcE9QOFpiWk9HQjFQMXZsdnZ3dmZMakQ1Q0lnSi1KaU94X0Rjd2ZIVDQycGEzeXYzRlZGZDMwYk92ZDZ0LXRaZm1FeGpCbVViNEZsQmRiRVBrWlVsa0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC likely to take markets on a rollercoaster - FXStreet",
        "content": "Most recent article: Top 3 Price Prediction Bitcoin, Ethereum, Ripple – Bitcoin could see high volatility due to US CPI\n\nBitcoin price broke out of a symmetrical triangle pattern and remains above throwback support.\n\nEthereum price is likely to have a pullback into its major support area between $3,400 and $3,200.\n\nRipple price holds the daily support level at $0.467.\n\nBitcoin (BTC) price is trading with a bullish bias following a successful breakout and retest of a symmetrical triangle pattern. Ripple (XRP) also follows in BTC’s footsteps as it continues to hold on to its major support level. Ethereum (ETH) price, on the other hand, shows signs of an impending correction.\n\nBitcoin price eyes for a 7% rally\n\nBitcoin price broke out of the symmetrical triangle pattern on June 4, which was formed by connecting the three lower highs and three higher lows, formed since May 19 using trend lines. The breakout, however, was rejected by the weekly resistance around the $71,280 level.\n\nCurrently, BTC finds support around the upper boundary of the symmetrical triangle pattern around the $68,500 level.\n\nIf this support holds, then BTC could rally 7% to its all-time high of $73,777.\n\nBTC/USDT 1-day chart\n\nHowever, if BTC breaks below the lower boundary of the triangle and closes below $67,147, the bullish thesis could be invalidated, leading to an 8% crash to its daily support level of $61,293.\n\nEthereum price looks promising\n\nEthereum price broke above a falling wedge pattern on the daily chart on May 20, leading to a 21% rally. However, it is encountering resistance from a bearish order block established on March 12, which ranges from $3,980 to $4,093, posing a challenge for ETH bulls.\n\nInvestors considering buying ETH should watch the following levels:\n\nThe 50% retracement level at $3,424, calculated from the swing high of $3,984 on May 27 to the swing low of $2,864 on May 13. The 61.8% Fibonacci retracement level at $3,279 from the same movement.\n\nIf the conditions mentioned above play out, then the Ethereum price could revisit its previous resistance level at $4,000.\n\nETH/USDT 1-day chart\n\nConversely, if Ethereum's daily candlestick closes below the $2,864 level, it would create a lower low and indicate a disruption in the market structure. This development would negate the previously discussed bullish outlook and could potentially lead to an additional 9% decline, reaching the prior support level of $2,600.\n\nRipple price finds support on a major level\n\nRipple price bounces off from its daily support level of around $0.467 on Friday.\n\nIf the daily support at $0.467 support holds, XRP could move to the upside and retest its previous resistance level at $0.571.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple daily candlestick closes below $0.467, then XRP could crash an additional 10% to its previous support at $0.419."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPUGtCc0FUS1hJbkN2b3BTd3pEeGZEUWlkTGpFRUpUSEczREhOUjRNMXUxTWVEbDhMM05TaHI0NE52cFV6TFhKSFcwbzVva0JsZURGZm1NZmZWbC1LLS01bjZmMm1sdnRjQUttUzZJd1NBUmRDTnU0dVo5UV9Calp2cHBvT0xzZlR6ajRubkpaMi1tUVdveVZwWDhKUW13WWY2SGhCa3pZSXJRNUVnNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Downward Drift: Decline Resumes Again - TradingView",
        "content": "Ethereum price failed to clear the $3,720 resistance. ETH declined again and is now at risk of more losses below the $3,550 support zone.\n\nEthereum started a fresh decline from the $3,720 resistance zone.\n\nThe price is trading below $3,650 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $3,680 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend losses if there is a close below the $3,550 support.\n\nEthereum Price Dips Again\n\nEthereum price attempted a decent increase above the $3,650 resistance zone. ETH even spiked above $3,700 but the bears were active. A high was formed at $3,710 and the price started a fresh decline. There was a sharp decline below the $3,660 and $3,650 levels.\n\nA low was formed near $3,565 and the price is now consolidating losses, like Bitcoin. Ethereum is now trading below $3,650 and the 100-hourly Simple Moving Average.\n\nIf there is a fresh increase or a recovery wave, the price might face resistance near the 23.6% Fib retracement level of the downward move from the $3,710 swing high to the $3,565 low. The first major resistance is near the $3,640 level.\n\nThere is also a key bearish trend line forming with resistance near $3,680 on the hourly chart of ETH/USD. The trend line is close to the 61.8% Fib retracement level of the downward move from the $3,710 swing high to the $3,565 low.\n\nNewsBTC\n\nAn upside break above the $3,680 resistance might send the price higher. The next key resistance sits at $3,720, above which the price might gain traction and rise toward the $3,750 level. If the bulls push Ether above the $3,750 level, the price might rise and test the $3,800 resistance. Any more gains could send Ether toward the $3,880 resistance zone.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $3,650 resistance, it could continue to move down. Initial support on the downside is near $3,550. The next major support is near the $3,520 zone.\n\nThe main support sits at $3,500. A clear move below the $3,500 support might push the price toward $3,320. Any more losses might send the price toward the $3,250 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,550\n\nMajor Resistance Level – $3,650"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNUEgyeXZ6SEk4aEZFaVJreTNtWDczWUNFTFZfVnExcktPblZqVldGbWZpS0sxRy1udFF2RFZ3a3hjUFJCYUF3bE9ZVmVyODZFcTYwTzR0SUNpVlZzX2lsU3dyb3RwLXFfeXhUeXJuLUYxbmRRTU9wb0liMHpjVEVlS3M3QzdVNEhVeTlrTVJ4ZDE0VGxmVlFpYUpKWkxORDVsRGtQY29vUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Investors are accumulating Ethereum ahead of the next price surge - Cointribune EN",
        "content": "Mon 10 Jun 2024 ▪ 3 min read ▪ by Fenelon L.\n\nAs the price of Ethereum oscillates around a crucial resistance level, savvy investors are seizing this last opportunity to accumulate the crypto before a potential surge in its price. Indicators converge to suggest that a powerful bullish rally could start soon.\n\nA crucial resistance level to overcome\n\nThe crypto market frequently offers exceptional opportunities to the most astute investors. This is precisely what is currently unfolding with Ethereum (ETH).\n\nAlthough the crypto is currently experiencing a pullback of around 2%, this correction phase could represent the last window to position oneself at a lower cost before a potential major rebound, according to the latest analyses.\n\nIndeed, if Ethereum’s price manages to break through the key resistance around $3,700, it could trigger a powerful bullish rally, according to renowned analyst Milkybull. The expert even points out that this price zone could constitute the last opportunity to strengthen one’s position in ETH at relatively low levels during the current bullish cycle.\n\nTechnical indicators seem to corroborate this scenario with signals increasingly supporting a strong latent buying pressure. Supporting this thesis, the Coinbase Premium indicator for Ethereum shows a sustained bearish trend, suggesting low selling pressure among American investors, often considered a reliable barometer of upcoming trends.\n\nEthereum positions itself for a major rally\n\nDriven by a series of favorable factors in 2024, Ethereum has already recorded an impressive gain of nearly 67% since the beginning of the year.\n\nIn the wake of these major developments, many analysts now expect a dizzying potential appreciation for Ethereum. A target of $6,000 by early July is frequently mentioned, fueling investor enthusiasm for this crypto.\n\nCryptoQuant data has also corroborated this underlying bullish dynamic. Between May 23 and June 2, investors withdrew no less than 797,000 ETH, representing a colossal value of $3.02 billion, from the reserves of major centralized exchange platforms. A strong signal indicating that crypto investors are in a phase of massive accumulation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQeXFLd0RGSFQ5VDZTcmM3bVZhTVZkaGgwcWtJb1JYYjFQazhPMnFtSWlLLW1wYmpzcVlqZDVnQy1YeHRtMFNVN0UyWkNjaGRIMksxb3lJeDRxWElwYXpxeUFoSEM3VENLbC1ZQ1V4c09kcVNiOVpvMU82dFFyTV85VdIBhgFBVV95cUxPbVdCWjJ2emF4TUdUZFdWVWswbkxNV3JqZjhSdS1DWjJ3TDJzQ2xJYlQ3X3U4SFZUTVBFRGlkWjZVSFBoNVhla1ZxRjJNaFlFMUlhSC1MbHlyZFgzUjkydnllajZGWHUzM19xMFE5ZUUwblkwamdjMFBCbE5mNDIyVUdaTTdyZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Uniswap decouples from Ethereum: Will UNI hold onto $9? - AMBCrypto News",
        "content": "Exchange supply for UNI increase while it dropped on Ethereum’s network.\n\nA declining sentiment, set off by decreasing demand, indicated that ETH could slide to $9.20 in the short term.\n\nFor the last seven days, Uniswap’s [UNI] price and Ethereum [ETH] have failed to move in the same direction. At press time, UNI changed hands at $9.98, representing a 2.22% increase in the last seven days.\n\nETH’s price, on the other hand, was $3,687. This was a 2.56% decrease within the same period. However, that is not the major issue at hand.\n\nSomething AMBCrypto observed using on-chain data from Glassnode was that the tides could soon change.\n\nThe correlation goes off\n\nEvidence of this was reflected in the Exchange Net Position Change. According to our analysis, Uniswap’s Exchange Net Position Change was 733,683 on the 8th of June.\n\nThis metric is the total supply of tokens held in exchange wallets. If it is positive, it means that more tokens are going into exchanges, and this could lead to a price decrease.\n\nHowever, a negative reading suggests a surge in withdrawals, which could lower selling pressure. For UNI, the number of tokens held on exchanges has been increasing since the 3rd of June.\n\nTherefore, there is a high chance that the price of the token could lose hold on the $9 region if the supply remains positive. However, it was a different ball game for Ethereum.\n\nAn evaluation of the same metric with ETH indicated an increase in coins taken ofd exchanges. According to Glassnode, about 576,851 ETH was withdrawn from exchanges on the same day 733,683 UNI tokens flowed in.\n\nUNI is set to fall further\n\nTherefore, it is possible to see the price of UNI fall while ETH could be in line for a swift recovery.\n\nIf validated, this could be contrary to the price performance of the cryptocurrencies when the U.S. SEC approved spot Ethereum ETFs.\n\nIn the build-up to the announcement, ETH’s price jumped, and UNI’s connection with the blockchain ensured it followed in the same direction. But how low can UNI go this time?\n\nTo check the possible targets, AMBCrypto analyzed the Weighted Sentiment, which shows the perception market participants have around a project. At press time, the Weighted Sentiment was -0.173.\n\nThis negative reading suggests that most comments about Uniswap tilted toward the bearish side of things. Thus, demand for the token could drop, and could trigger a price decrease.\n\nIn addition, the Market Value to Realized Value (MVRV) Z Score which was 27% a few days ago was down to 23.58%. When the MVRV Z Score is positive, it implies that the token is in a bull phase.\n\nRealistic or not, here’s UNI’s market cap in ETH terms\n\nOn the other hand, a negative ratio suggests that a fall into the bear cycle. However, the recent decrease does not mean that UNI is dropping into a bear phase. But it is a sign that the price could slip down the charts.\n\nBy the look of things, a drawdown to $9.20 seems quite possible."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOaGwtOTQtNzhQcUxVa01wVGxxYUJuVFdaa0J4anhSRFhKODFLMGZBQ1VjRTRhWGNEY3N5SHNPTVlkZEY5dGthaDB6U1loNjd4elNvTWJ3c3hkZGVHOFpxWlp4RkQxYTBqaUhIUDF6ejE2T0Rud0k1dFFDM3B2UHN0c1hpcjZvd9IBiwFBVV95cUxNSnVkdTd2ejgzU0xDdEl1U0lBOFRMTXlaaXdCY1A3OWtwUnVpWE9QUUs3Z19GVjRpbXROTzdVQkE5cjREaFZXenBLWjAtZjdvSG5TWTN2WWktckNKUVFnVXR5YmdRUE5naHozU3ExNFVFQk5PUE1PTW5DMXktZU1UOG9TQ2xtdDg4Y2FJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Why a rise in Ethereum staking has not helped ETH’s price - AMBCrypto News",
        "content": "The amount of staked ETH has increased significantly over the past few weeks.\n\nETH’s price continued to move sideways.\n\nEthereum [ETH] has remained stagnant around the $3600 level for quite some time. But despite the sideways movement, optimism around the cryptocurrency has remained high.\n\nThis was indicated by the rising interest in ETH staking over the last few weeks.\n\nEthereum staking on the rise\n\nAccording to recent data, 32.5 million ETH had been staked on the network.\n\nEven though the number of stakers increased, which can typically drive up rewards, both the reward rate and inflation rate for staking ETH saw a decrease.\n\nThe reward rate refers to the annual percentage return a user gets for staking ETH. It’s essentially the interest a user earns to help secure the network.\n\nThe inflation rate, on the other hand, reflects how quickly the total supply of ETH increases. New ETH is created as staking rewards, and this contributes to inflation.\n\nA declining reward rate means a user will earn a bit less new ETH per staked token in the short term. However, a declining inflation rate suggests the total supply of ETH is growing at a slower pace.\n\nIn the long run, this could actually be a positive sign for the value of ETH. If demand for ETH stays strong while the supply grows slower, it could push the price of ETH up.\n\nAt press time, ETH was trading at $3,669.67. After surging past the $3,600 level after the ETF announcement, the price has moved between the $3,979 and $3,607 level.\n\nThis recent correction in ETH’s price could be attributed to profit-taking done by short term holders after the sudden uptick in price.\n\nThe RSI (Relative Strength Index) for ETH had declined significantly over the last few days, implying that the bullish momentum for ETH had slowed down.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAdditionally, the CMF (Chaikin Money Flow) for ETH had also diminished, implying that money flowing into ETH had declined. If bearish sentiment prevails, ETH may retest the $3,607 levels before moving upwards.\n\nEthereum’s Network Growth also declined materially over the last few days. This implied that new addresses showing interest in ETH had fallen, which may cause problems for the altcoin in the long run."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZFhkd0VsQkRBUHBPQVZlMHBuVVhMYThSS3ZjOEc2R2xVVUY5cUJYTXBTMmhEZGJ4SUl2NUxrMkRwYS1PNTUyZkpuNmRILWE4ZjhUOEZtQjNGeFVIaGdJaURET2g4VXJjY2JJSjNlRlVoNGdqYmo2Vi05ZHprQWdzbDNDM2p5TkdKYVHSAY8BQVVfeXFMUE80T1d6c3V2NVpNUTFVY0NHS2RCQzdZeG5jdTZfX1k0LTc2WVlSN3VuT1RNcnRzb1JVVDlXRGhpQ0wwRXR0S3VORnlxVzd1c0oxaFpDRkNpaHFvY3JQdFUyeGJDUGlHbmhvUDhZQXR2Sl9STUtxVUZBdjlpNkNWaWsxVW8tS0V3aG1wRGlCdk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum reserves hit 8-year low: Is a price explosion close? - AMBCrypto News",
        "content": "Ethereum reserves on exchanges are at an eight-year low, setting the stage for a price surge.\n\nCurrent bearish indicators suggest there might be room for further decline before a rebound.\n\nThe amount of Ethereum [ETH] held on exchanges has reached its lowest point in eight years. With the imminent launch of its spot ETFs, we could see a huge supply shock, and it might lead to a dramatic increase in Ethereum’s price.\n\nBut let’s check out what the data is telling us.\n\nEthereum ETFs to cause a stir?\n\nIf the spot ETFs garner the huge interest everyone expects, the initial rush to buy Ether could drive prices up rapidly, followed by possible corrections as the market adjusts to the new demand and supply dynamics.\n\nEthereum’s price is below both the 50-period and the 200-period moving averages, trending downward. This alignment generally indicates a bearish sentiment.\n\nThe RSI is around 43, which is below the neutral 50 mark but not yet in oversold territory (below 30).\n\nThis means the price could decline a little more before reaching oversold conditions, which often come right before a price rebound.\n\nA significant 89% of Ethereum holders are in profit at the current price, which is a strong indicator of a healthy market.\n\nWith 51% of Ethereum held by whales, there’s a huge concentration of Ethereum in the hands of a relatively small number of wallets.\n\nThere has been a large volume of transactions exceeding $100K, totaling $32.81 billion over the last seven days, highlighting massive institutional or large-scale investor activity. In other words, investors of all kinds are currently bullish on Ether.\n\nRecent downward trends in the MVRV ratio might suggest that Ethereum is entering a zone where it is less overvalued, aligning with a potentially more sustainable price level or even undervaluation.\n\nThis cooling-off could be a healthy market correction, providing a more stable foundation for the bull run.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAs it stands, if Ethereum can sustain above the recent support at $3,670, it might attempt to break the $3,733 resistance.\n\nA successful breach above this could push the price towards the next psychological barrier at $3,800."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOQ0ZORVFOUkQ3Z0NsYWdIQWhTZC01SndyeUlzeC13V3ZwYXZ2V2JVWGltbEtCU0dTS19zbXNsUTdqOVdQMFB3NFk3SnFORGpEMWV4R0UtcUZFNU4xMkhFNnhzdTZzTnpyTjZOU0t6RFp5Ykw3VGN4STZDenNIb2dsY2JUaFhmVFF40gGWAUFVX3lxTE54Y1h1N1B6V1pmbUVpWHM3M3FfYUM1djNFYnFDSEo1UzV5V2pmTURyUURsVUZwSmVSQ1lGWTdLVDJwQThKNWV1SEZxVW1SaTd1SmJmSUJnN0swV01RZ01uYTFuaUp3VmtJN2s3dE14ZGZaN21Xelo2WFdPZUZ4bGVPTzZGVGZ4dWxQUXBOWEVhVWxoZHotdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 10, 2024 - Analytics Insight",
        "content": "Specific comments from the leading personalities of the crypto industry, such as Hayden Adams, the founder and CEO of Uniswap Labs, recently fueled concerns regarding Ethereum transaction fees. Adams went on to say something that I considered shocking: users should not have to think about “gas fees,” which are the cost rendered for performing transactions within the Ethereum network. This statement has sparked controversy, especially regarding the ability of Ethereum to support stable high transaction fees, which is why measures to address the concern must be taken into consideration.\n\nAdams’ comments follow the Ethereum community being threatened by high charges on transactions. Recently, the artist Iggy Azalea spoke about gas fees, or reprocessors, wondering about their need and doubts about their usage. Even if Azalea’s assumptions about splitting may not be correct, her comment has raised concerns regarding the tendency to increase transaction fees and the impact the situation has on Ethereum users."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNQWtpenpiZy0zNlVEdXJQT1h4YllsSnIyYWZuMC1IajZZdERjNmxBX2c0ejdocHVGdFNvcjJNV25HYVBfQ3VWSEpkMkxadkwzLWpmVXJJbW1wR3d5M0ptTF9tVWlfdEs2NTBsMkdoUUF5ZnpRTkdwYXJqM09hRnFUZlo1Q3VnV280SE9tRFdPM1E2c2pDWDZrRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Should You Buy Solana Right Now While It's Below $200? - The Motley Fool",
        "content": "If Solana can convince investors it's the next Ethereum, it could skyrocket in value.\n\nIn 2023, Solana (SOL 0.81%) was one of the top-performing major cryptocurrencies, up an eye-popping 900%. In 2024, Solana has continued to turn in a stellar performance. At its current price of $165, Solana is up more than 60% through the first five months of the year.\n\nThe problem, however, is that Solana appears to be running into a wall right now. It is down nearly 20% since it hit an intra-year high of just over $200 in March. Should you view this as a potential buying opportunity, or as a warning sign that Solana's impressive recent gains could be coming to an end? Let's take a closer look.\n\nIs Solana the next Ethereum?\n\nThe primary reason to invest in Solana right now is that it could eventually become the next Ethereum (ETH 0.18%). Solana is a direct challenger to Ethereum in the Layer 1 blockchain space, and has been steadily gaining ground in every major niche, from decentralized finance (DeFi) to non-fungible tokens (NFTs). For nearly four years, Solana has been tagged as a potential \"Ethereum killer,\" and now it finally seems to be delivering on its promise.\n\nCathie Wood of Ark Invest raved about Solana last year, calling it a faster, cheaper, and more efficient version of Ethereum. That's backed up by real numbers. Solana, for example, says it can process 50,000 transactions per second. Ethereum, by way of comparison, can only process 15 to 20 transactions per second. To achieve faster transaction processing speeds, Ethereum relies on a confusing mix of Layer 2 scaling solutions that even developers say is becoming too hard to use.\n\nSolana's secret weapon\n\nMoreover, Solana has a secret weapon that Ethereum simply cannot match: A mobile crypto strategy that is finally gaining traction with customers. Solana officially launched its new \"crypto phone\" (the Saga) last year. Early sales were weak, but a clever marketing promotion based around Solana meme coins has led to sales taking off.\n\nFrom the outset, Solana's mobile strategy was designed as a way to onboard new crypto users. The goal was to get a mobile phone into people's hands, give them plenty of apps they couldn't find anywhere else, and design new mobile experiences to make crypto easier to use. That, in turn, could result in people beating down the door to become part of the Solana blockchain ecosystem.\n\nAdmittedly, this might be a very long-term strategy. But it might just work. According to investment firm VanEck, all Solana needs is a single \"killer app\" with at least 100 million users, along the lines of a ChatGPT. If Solana can find a \"killer app\" for its mobile phone, it could be worth hundreds of billions of dollars.\n\nVanEck ran the numbers and determined that, in a bull-case scenario, Solana might be worth over $3,200 by 2030. So, yes, if you buy into this analysis, you should be buying Solana while it's still below $200. At today's prices, you might be able to make a 20-fold return on your investment.\n\nThe case against Solana\n\nHowever, there are a number of reasons to be concerned about Solana. For example, the current bout of meme coin popularity taking over the Solana blockchain seems to be leading to some unsustainable performance. All of the improvement that we've been seeing in Solana's metrics -- such as new users, new unique wallets, and spikes in transaction activity -- might just be a lot of smoke and mirrors.\n\nMoreover, Solana continues to stand in Ethereum's shadow when it comes to exchange-traded funds (ETFs). At the end of May, the SEC granted approval for new spot Ethereum ETFs to begin trading soon. If they are anywhere near as successful as the spot Bitcoin ETFs, they could lead to a huge influx of investor money flowing into Ethereum. That's fantastic for Ethereum holders, but it could act as a negative drag on Solana's price over the short to medium term. Money that otherwise might have gone into Solana will now be going into Ethereum.\n\nHow high can Solana go?\n\nThat being said, I'm taking a long-term approach when it comes to Solana. As Solana steadily gains market share at the expense of Ethereum, and as it continues to build out its mobile crypto strategy, I'm highly confident that it can continue to boost its valuation. Solana is still 36% below its all-time high of $260, which could be a reasonable near-term price target.\n\nIn a best-case scenario, of course, Solana will find the one \"killer app\" that it needs. If that happens, it could skyrocket in value and achieve what many have been predicting for several years now."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE0ybzRrODlqU3NGbTlMb2xMeV9qeklkek50QUVNcHlsZ0NOUWhWQkRtMXVIcnNBRG93NjBNc09UUWxjRjBXT1poWm53R2FKa3ZYMkpwRDY1SDg3VUpJNWd4NHM4VGdCTV9QOEp4RTVLdVdNSlRhbG44UkZlRVlIeUXSAYQBQVVfeXFMUF9kd0l0WVVnU05ST0dBTHZaYi13M2tGTUFNX0pzblpZNXVubFFlbVIxdFVCTDRESE43ekYzN2dRUXhDLTBEbmV6dGJGTTlHVnRjZXNFbXRrdWNCVFhwS2JMdTc1VFFGRDdiZGdiQ0sybHlGZF84dzlsQU9jdkZfV0lLaFVP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Analyzing whether $4.8K is in sight for ETH - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 2% in the last seven days.\n\nA metric suggested that ETH’s price was near its market bottom.\n\nEthereum [ETH] bears dominated the last week as the token’s price dropped. However, this might be the last chance for investors to accumulate more ETH while its price is low.\n\nETH was at a crucial resistance level, and a breakout above it could result in a massive rally in the coming weeks or months.\n\nShould you buy ETH now?\n\nCoinMarketCap’s data revealed that Ethereum witnessed a price correction last week as its value dropped by more than 2%.\n\nAt the time of writing, ETH was trading at $3,687.02 with a market capitalization of over $442 billion. However, this bearish price trend might change soon as ETH is testing a key resistance level.\n\nMilkybull, a popular crypto analyst, recently posted a tweet revealing this development. A breakout above the resistance would spark a massive bull rally.\n\nTherefore, this might actually be the last chance for investors to buy ETH under $3.7k in this cycle.\n\nAMBCrypto then checked ETH’s on-chain data to see whether investors utilized this opportunity to accumulate.\n\nAs per our analysis of CryptoQuant’s data, ETH’s net deposit on exchanges was low compared to the last seven days’ average, reflecting high buying pressure. However, the other datasets suggested otherwise.\n\nFor example, ETH’s Coinbase Premium was red. This clearly meant that selling sentiment was dominant among U.S. investors.\n\nOdds of a bull rally\n\nAMBCrypto then took a closer look at Ethereum’s current state to better understand whether a price increase is possible in the near term.\n\nAMBCrypto’s look at Glassnode’s data revealed that ETH’s price was near its market bottom, as per the Pi cycler top indicator.\n\nThis meant that the chances of ETH gaining bullish momentum in the coming days are high. If that happens, then ETH might soon touch $4.8k, which is optimistic to look at.\n\nWe then took a look at the token’s 12-hour chart to see what market indicators suggested regarding a price uptick in the short term.\n\nAs per our analysis, the MACD looked in the sellers’ favor as it displayed a bearish crossover.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIts Relative Strength Index (RSI) also remained bearish as it was under its neutral mark. These indicators hinted at a continued price decline.\n\nNonetheless, the Chaikin Money Flow (CMF) turned bullish by moving northwards towards the neutral mark in the last few days."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPa0U5VzVrMkZScDZBQnV0a2w0amhySXplUE1oVG5OUmxacmhhX0hpZWNYVDZtckNRelRrdlZIbEhGQTd0ZlM3TENacWZnYklzZUtRQnVTbWlIMnQ5SWQ5XzJkbXh0SXRJZVpFWklwYURGcmJmZDJ1a0RPQ0pXaEZoanRxUUtpQkk2UHhyQl85VVFVUm9iazZDTFhsaGNBZ9IBqwFBVV95cUxPelRCU05XR2U3YjZUWVQycEd0TnowbkNNWmRLR1dORksxeDkwLWpGSkJOZU9rZTlKSzBYRVZvSF9TMFFRV3M3Vnp1QnNGWTNKUTZvaTFOWXhtZGZOeTNEdFliUEJ4ZU9WblhRZ2dRRjZrM1VNSUR6Vm50VXVWLU84SVVvVFVCSHMwcVZUNEtFWDBWVlluaGsyWUhOSzl1VGxMSi1SNldDVWZxQ28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Anticipated Launch Date Raises Excitement - Analytics Insight",
        "content": "As the launch date for Ethereum ETFs approaches, excitement in the cryptocurrency space arises.\n\nThe introduction of an Ethereum ETF allows investors to invest indirectly in a security without having to own it outright. For Ethereum, which ranks as the second-biggest cryptocurrency in terms of market value, an ETF could make it easier and more regulated for both individual and institutional investors to invest in it.\n\nSpot Ether ETFs received a green light for 19b-4 filings, which permitted these funds to be made available on their designated exchanges. Before commencing the trading, the applicants must initially secure the necessary approval for their S-1 registration documents."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOX3B6LTRhRVBGWlVFM2dyaWhMVW5vUVJuSGZMMWFvVVJqRE96ZlRmZG13eFBwQlludE9lM0stdHNWZU84TnN1cEJ4dlJOQ1d2Q2pCQ1ZFbE1VTUlXdlhFdWlOWDVVU0ZNVFlpbmc2VXBDVXgxNjFPWWdidlRKOHFvenZ0bG03R0Y3OXhHM2RyVTRib2FFcVlGSEdGOGxYQTZoRnVDbWVQSlgzcERja2wtRGtqRl90WHRFV1FYLUx6a1FVN3ZFSHlnWF9fcWJYVjhoMVZZMEtB0gHjAUFVX3lxTE9lU1Njakh2M2sxQVZxRnlMNTRGTG5jLWY4Rmk5Q0VCZHptWHlpUXIzVUV2VE1NdnRjUWx6TGtNVjRDSDlkYlBsT3ptSVVYejVDT2Z0NjczXzVSd1o2WWxRZS1fRGxOUFM2Q3N4dXlWa3FibXJsMGs0REFtMUN3NmZhM0xyLURJbG9TaXpMbXhMQUoxaXlvMHFNTmpUeFhldlRDOU9rbDVxb1RXSkZ3TUttMG1iUmtlQlQ5THhVanJSSGJLRGw1bFMzbnJXeGFucTZmUGZyZGRydFFOWVBrSUJ3UFlJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin & Ethereum Prices Drop, Solana Turns Red As Traders Await CPI Data - Analytics Insight",
        "content": "After a sharp sell-off on Friday, Bitcoin price is trading sideways on Monday. Ethereum and Solana prices are also exhibiting a similar trend as the investors await key CPI data for May. Nevertheless, XMR, QNT and CHZ emerged as the biggest gainers during the first trading session of the week.\n\nThe hotter-then-expected US jobs data has jolted the traditional markets. Consequently, at press time, the S&P 500 and Nasdaq 100 index were down 0.10% and 0.15%, respectively. Friday’s report showed that the US employers added $272,000 jobs in May which was much higher than the market expectations.\n\nAs a result, BTC price fell below $68,420 before recovering back above $69,600. ETH price also dropped significantly and bottomed out at the fresh monthly lows of $3,600."
    }
]