[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9oNDh3cUkyVjNFam1rckdUUkdJYzNiVkZ4b01mVVhwSkZTNDdyQXBpMEhWeVFwRVNrRmh1ZkVKaWV4MmctOXNJWl9oa2RSaWlvSFpwc2UxOFBqZzZEcmswZlJMRlV0czNobVU0d0lzSdIBdEFVX3lxTE1yS01Oa0tPTGxfMk9sZ0NzTUFBbUdENi1nTG0zOUs0OFZXalBoQnc2TUdyQ2xadzB6WFdJeWhybzlNLXBaNGlGb0NiTkpaNGlLOWNJSF93UEhxZXNadkFNSEx1ZzA3QWZ0am9jdUFDeVNUakw0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "How two brothers allegedly swiped $25M in a 12-second Ethereum heist - The Register",
        "content": "The US Department of Justice has booked two brothers on allegations that they exploited open source software used in the Ethereum blockchain world to bag $25 million (£20 million).\n\nThe pair – computer scientists Anton, 24, of Boston, and James Pepaire-Bueno, 28, of New York – are accused of carrying out what deputy attorney general Lisa Monaco called a \"technologically sophisticated, cutting-edge scheme they plotted for months.\"\n\n\"The defendants' scheme calls the very integrity of the blockchain into question,\" added United States attorney Damian Williams.\n\n\"The brothers, who studied computer science and math at one of the most prestigious universities in the world, allegedly used their specialized skills and education to tamper with and manipulate the protocols relied upon by millions of Ethereum users across the globe. And once they put their plan into action, their heist only took 12 seconds.\"\n\nSome background\n\nCryptocurrency blockchains, including the one behind Ethereum and its native coin Ether, are pretty much a decentralized append-only log file of transfers, and use cryptography to maintain the integrity of the log. That makes a blockchain essentially a public ledger of every single transaction that takes place, and users can only make transactions with money they actually have. These transactions are grouped onto blocks that are chained together, hence the name.\n\nAnd a whole load of cryptocurrencies – from stablecoins such as Tether that's pegged to one US dollar apiece, to roller-coaster meme-coins like Shiba Inu and Pepe – use the Ethereum blockchain; it's not just Ether.\n\nThe stewardship of the Ethereum blockchain is entrusted to validators, which are typically automated systems directed by human operators. As the name suggests, validator bots attest that proposed blocks of Ethereum transactions are valid and send those blocks to a committee of fellow validators to approve by vote and securely add to the chain.\n\nGenerally speaking, validators must each stake 32 Ether (equivalent right now to $100,000). When randomly picked to propose a new block for the chain, a validator has roughly 12 seconds to complete that operation and offer a valid block to its peers to verify and accept for the chain. If validators misbehave, they face losing their stake; if they perform as expected, they are rewarded.\n\nIt does get a bit more complicated in practice. Where do these proposed blocks mainly come from? Well, while awaiting confirmation on the blockchain, pending transactions sit in a public staging area called the memory pool or mempool. Bots called searchers rifle through those pending transactions, and using fun algorithms assemble bundles of transactions for builder bots to package together into blocks for validators to consider for the chain. In fact, builder bots can also use interesting algorithms to combine and optimize bundles from multiple searchers to craft these proposed transaction blocks.\n\nThe builders stand to receive a reward in terms of fees and other sources when their proposed blocks make it onto the chain, and the validators approving the blocks get a cut of that income.\n\nIt's in the interests of the validators to pick the blocks that are the most profitable, it's in the builders' interests to construct blocks that look attractive to validators, and the blockchain's users pay fees to get their transactions picked up. The builders and their searchers get to order the transactions in the blocks as they see fit; the transactions execute in that order when the block gets the green light.\n\nThe builders offer their proposed blocks to validators via relays. The relays only provide just enough info to the validators for those bots to determine how much they stand to gain from accepting a particular block, and not the specifics of the transactions; when a validator accepts a block for processing, it gets the full details from the relay to analyze and attest. Nine out of ten validator bots use an open source program called MEV-Boost to communicate with multiple relays to select the most-rewarding block from a whole range of builders competing for a payout.\n\nThis design is supposed to be resilient to manipulation and other shenanigans while ensuring all these bot operators get paid for keeping this decentralized system going. However, according to an indictment [PDF] unsealed on Wednesday, the brothers exploited a weakness in the MEV-Boost project's code to make off with millions in crypto.\n\nThe MEV in MEV-Boost stands for Maximum or Maximal Extractable Value, and is fairly complex, but essentially it's what the validators, builders, and their searchers stand to make from crafting, proposing, and attesting a block of carefully picked and ordered transactions from the mempool buffer. And as we said, there are various ways these participants can make money off this validation process.\n\nFor example, there's nothing stopping mempool searchers from doing currency arbitrage. A searcher bot can clock from the mempool transactions that users are buying up a particular cryptocurrency, which will increase the market value of that token. The searcher can form a bundle of transactions that begins with the bot's operator acquiring that cryptocurrency, then includes other people's pending mempool transactions for that coin, and finishes with the bot selling the coin. If that carefully arranged bundle makes it into an offered block, and is picked by a validator and accepted onto the chain, the transactions execute in order, and the searcher stands to make a profit from selling the coin at a higher price than it was bought at as the market value increased during the process. The searcher can offer to pay block builders to use its bundle knowing it will still make a profit.\n\nSearchers and builders set the order of transactions in a proposed block, but so can validators: A validator chosen by the system to provide the next block can go it alone and offer its own block for committee approval. That's why relays usually withhold the full details of proposed blocks until a validator promises, using a digital signature according to the US Dept of Justice, to attest a chosen block. Otherwise, a validator could look through all the proposed blocks, pick a profitable one, and then create its own block based on that offered one, and pass it to the committee to accept, screwing over the searchers and builders by taking the rewards.\n\nPulling off a '$25M heist in 12 seconds'\n\nProsecutors claim the pair found a flaw in the MEV-Boost project's relay code that could be exploited to release the full details of a proposed block prematurely. Thus, the duo allegedly set up validators that exploited a relay to hand over a complete proposed block too early, rejigged the transaction list to their advantage, and sent the block off for committee approval, netting them a hefty windfall.\n\nThe complaint claims a shell company called Pine Needle Inc was set up in December 2022 by the brothers to perform their banking and cryptocurrency exchange activities. In particular, they didn't want to do business with crypto-exchanges that had a \"know your customer\" policy, and performed online searches for \"how to wash crypto\" and \"cefi exchanges with no kyc,\" court documents state. The men also carried out a bunch of transactions to observe how searchers operated by three particular traders reacted, it's claimed.\n\nBetween February and March the following year, the complaint alleges, the sibling duo sent 529.5 Ether coins (worth $880K at the time) to the Ethereum network and used 512 of them to stake 16 validators at 32 Ether apiece.\n\nOn April 2, they decided to carry out the exploit, prosecutors said. First, the duo waited for one of their validators to be randomly selected to provide the next block for the Ethereum chain. Once that had happened, they then put in eight orders for particularly illiquid cryptocurrencies, it's said.\n\nThe three traders' automated searchers took the bait, it's claimed, and offered bundles of transactions to block builders that aimed to achieve the following: Buy up $25 million of those illiquid cryptocurrencies using stablecoins and other liquid assets, run the brothers' transactions, and then sell that cryptocurrency at a higher price and pocket the difference.\n\nThat proposal reached the brother's validator via a relay, it's said, and the validator allegedly exploited that relay – by sending it a dodgy digital signature – that caused it to reveal the full contents of the proposed block. The validator then allegedly altered the transaction list to: Let the traders buy up that illiquid cryptocurrency; and sell off all of the brothers' holdings of those illiquid coins – the ones just bought as bait and the ones from the aforementioned observations.\n\nThe allegedly altered block was sent off for verification by committee vote and accepted onto the chain. It effectively, we're told, caused the traders to buy the illiquid cryptocurrency from the duo, who got $25 million in stablecoins and other liquid assets in exchange. The traders, meanwhile, got a mountain of now highly illiquid coins that were suddenly pretty worthless; the Feds said the liquidity pool for the cryptocurrency had been drained.\n\nThat $25 million went right out of the traders' hands in just 12 seconds, it's said. As far as the Ethereum world was concerned at the time, the deal was all above board. Details of the alleged exploit were not disclosed by the Feds, and we're looking into whether the hole, as described, has been patched yet.\n\nI'm feeling unlucky, Google\n\nThe day after the alleged heist, James Peraire-Bueno is said to have asked one of the shell company's banks for a safety deposit box big enough to fit a laptop. The next day, the Feds claim, he also asked the operators of a website that hosted the source code for MEV-Boost for its policy on logging IP addresses of visitors.\n\nMeanwhile, the complaint alleges, Anton Peraire-Bueno searched online for \"top crypto lawyers\" and asked things like \"how long is us statue [sic] of limitations\" for crimes like wire fraud and money laundering.\n\nIf true, it would mean the brothers crafted a far from foolproof scheme, despite allegedly being able to take advantage of a multi-million dollar exploit.\n\nThe complaint goes on to claim that a victim of the trade, his lawyer, and an Ethereum project representative attempted to convince the Peraire-Bueno brothers to give back their gains. It goes on to allege that, rather than come clean, they proceeded to launder the money through several different channels. About $3 million was allegedly frozen by foreign law enforcement.\n\nMeanwhile $20 million was eventually funneled into another shell company, Birch Bark Trading LLC, the complaint alleges. From there, the pair would have needed to move it into their brokerage account. According to the Feds, they didn't know how to do this, nor what the consequences would be. The court docs claim their Google searches included things like \"money laundering\" and \"does the united states extradite to [foreign country].\" By December 8, $19.6 million had made its way into the brokerage account, we're told.\n\nProsecutors announced the pair's arrests this week. Both men – charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering – face potential jail time of up to 20 years for each of the three counts. They will also have to repay any ill-gotten gains if convicted. ®"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQb0g4cUFMUDAzZEFKbGs1UXZOaFVVQ0s4NHNsanVxZm1BbllTZ1FxVk8wNXJnOU9rVzlyb2NaZnpBbHFwcE52ei1WZWhraFRQMjJvVFhZbUZUanl0RFMyZ29KdEQ1eWZndm91SldJcFpVcHViZUprWGhvV2hUbXJwQVdfMmpKSDJBcGRvUNIBlAFBVV95cUxQeVdRWGFfVkpoTVNyZ3BlTzVqc1V3YWdvb0c0ZFl3Z2t6YWRVMU5HTEwwcnVPN3RjUHEtbnRXYi15aGtrOHZuLUNjNEtRWXNCQWUwcHRQTG9kSEs3TkdJQm9Rei1Uc2tzUWRyMGhnQ3Y4RmNmWGpDa1NOU2pSV0FucWNnNHdSX1Jfdi00enZsSHdCdjdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Crypto Is Getting Political—Ethereum Giant Consensys Wants to Stay Out of It - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs crypto emerges as an increasingly partisan issue in the 2024 presidential election—what with Donald Trump making overtures to the industry, and President Joe Biden threatening to kill legislation intended to protect it—American crypto companies have begun feverishly spending to aid the campaigns of pro-crypto candidates across the country.\n\nIndustry mainstays like Coinbase, Andreessen Horowitz, and Ripple Labs have already dedicated tens of millions of dollars to influencing key Senate and House races this year. Meanwhile, crypto leaders have begun openly embracing Trump in a manner unthinkable four years ago.\n\nBut amid the crypto industry’s rise as a force in American election fundraising, one of the country’s most valuable crypto firms has opted to stay out of partisan politics altogether.\n\nConsensys, the $7 billion Ethereum software giant, has notably refrained from backing crypto-friendly candidates in the 2024 election. To the company’s founder and CEO, Joe Lubin, this is a deliberate choice intended to ensure the crypto industry’s long-term success (disclosure: Consensys is one of 22 investors in Decrypt).\n\nAD\n\nAD\n\n“Politically, we've liked to remain neutral,” Lubin told Decrypt. “It doesn't make sense for us to choose one broken party over another.”\n\nRelying on one political party or faction to support crypto is not as sustainable a long-term strategy as solidifying the industry’s legality via the judiciary, the Ethereum co-creator believes.\n\n“The way through all of this, the way that we land… is to rely on the courts,” he said.\n\nLast month, Consensys filed a preemptive lawsuit against the U.S. Securities and Exchange Commission (SEC), arguing that the regulator has no legal authority to classify ETH as a security—a position it has secretly held for over a year, the suit revealed.\n\nAD\n\nAD\n\n“The lawsuit with the SEC is a good platform for us to help people understand the benefits of the technology,” Lubin said. “I don't think we need to be politically partisan or make political donations in order to be a very clear and loud voice on this topic.”\n\nThat’s not to say, though, that the entrepreneur has eschewed politics altogether—far from it. Lubin says that Consensys regularly has closed-door conversations with politicians and regulators about the importance of crypto to America’s future.\n\nWhat’s key, though, is that those conversations are aimed at creating broad—forgive the pun—consensus around crypto.\n\n“We may not be visible,” Lubin said of Consensys’ political machinations, \"but we are certainly doing things.\"\n\nEdited by Andrew Hayward"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOZjFqNkFlckdwSEkxeWc4ZXUzaW1veFNUT2hIaGYwYy1XalE4Q1lQTDNRZGhIbmVuWkZFUWI0Qk5ocjFueEFQTHRZcFhhWmpuX1FEMTI1b1MwYmRLUHZXdjlFTmgyZnRfT2szUVVlQnlyelVHQmd1S0ZRR3E4V2o5bUdIdTdEWWRmUFk2b09uT2xkdS1uMkN4Nm1uM0kyd1JXcUpvSWROQzVGX0FwWnhQRVpmTnBmVHljSTdPeHY5Wlo2UTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Volatility ahead as ETH 2.0 Withdrawals Spike 4,000% - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOZmpDMGloOXEzUWxsLV9oOXZpTWpIY0o4WG16dFZMYkhSNzl2RmtST0FNSC1yaE5HSVAyWWIzNnBTYkVXQ0pwTHp2ckJGRFB4WmluN0ppV0gyR1NRNjk0QjRXNHlQSTdvSzVUYWU1ZTROWlA2OWNOdVpfa1A0aHJwcGtHazNwREtvZW9N0gGQAUFVX3lxTE45SWRDQ3VDVmdWaXl1cTFiS01nUG85eXZFNmNlSWh2SDJIMUx6bFZNZkQ1Q0owenBYRXdOODFHeGdlbXdHYW1EZ2gtOVdVSVdGeTBlRkc5XzI4QTk3ak85SHp2S1pjT3ludkVmN1JQZlp2eFNSTU05TERNZTRwYmxnNXh0UHpJZ3NBbWx6UURUMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Finally Breaks Crucial $3,000 Resistance, What Comes Next? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAfter one very long ride, Ethereum (ETH) has finally breached the psychologically important $3,000 price mark. While this calls for celebration, investors are advised to exercise caution as headwinds lie ahead.\n\nAdvertisement\n\nEthereum market headwind not cleared\n\nDespite its strong correlation with Bitcoin, Ethereum’s price outlook in this current bull cycle has been somewhat disappointing. While Bitcoin soared to its all-time high (ATH) and set a new one above $73,000, Ethereum traded above 40% below its ATH.\n\nThe $3,000 price level has been a major bane for Ethereum over the past month. From at least April 17, Ethereum has made at least six attempts to surpass the $3,000 resistance but was always rejected at each point.\n\nAt the time of writing, the coin is changing hands for $3,051.63; however, it is down by 1.27% in the past 24 hours.\n\nFrom a low of $2,925.09, Ethereum outwitted the bears to attain its current level, a point that might not hold now. The general market optimism surrounding Ethereum is bearish, with the trading volume down 11.92% to $13,653,971,007.\n\nOn thin ice\n\nEthereum is passing through a major litmus test that might either make or mar its valuation moving forward. While it remains unclear what triggered the shoot-up in the price, the drawdown is explainable.\n\nThis is because the United States Securities and Exchange Commission (SEC) plans to designate Ethereum as a security. This is projected as the basis for which the regulator might deny several applications for spot Ethereum ETFs.\n\nThe industry is currently divided on the likely disposition of the U.S. SEC regarding this offering; however, experts’ general consensus is that the approval odds are reasonably down. If the SEC says no to an Ethereum ETF, it might trigger a ripple effect in a price slump overall."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxObVBEYVhVMVFsTF9TRWVxTEZ2eHpQa3JQVE41R2d6T01QRkJsWnFrM29ubWhEMy1zcmZZTTlCdzZSMERwd21RUjlhWWIwaXE0VmZtZnROZmJvT0JmNFJPWmUwbHJCRmk5cUdRWmZJMDVNWC01VllBZkVfdFo5T0o4WkZDZ0d3MmJ1Tnhza012NHFrZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Trades Above $3,000 Price Mark, What’s Next? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nEthereum (ETH) has posted strides today with a few erratic price swings. With the bulls staging a comeback, ETH has exceeded the $3,000 price mark.\n\nHowever, while ETH shows moderate gains in the 24-hour timeframe, it has yet to recover its losses in the past weeks. Ethereum price reflects a 1% decline in the last seven days and 1.5% in the past month.\n\nBut the bulls are fast at work, vying to push Ether to higher highs. With ETH already above $3,000, what’s the next target?\n\nPrice Analysis:Ethereum (ETH) Faces Key Resistance Level at $3,059\n\nEthereum (ETH) trades at $3,032, inching closer to a significant resistance level of $3,059. This $3,059 level has previously acted as a support, so a decisive break above it is crucial for further ascent.\n\nA successful breach of the $3,059 resistance would solidify Ethereum’s bullish momentum and push it above the bearish channel, restraining its upward trajectory.\n\nFurther, Ether holds a Relative Strength Index (RSI) of 51, indicating a slight bullish momentum in the market.\n\nThe Moving Average Convergence Divergence (MACD) indicator is above the signal line, further reinforcing the positive sentiment surrounding Ethereum. However, Ethereum (ETH) is still below the 50-day SMA indicator. However, from all indications, it could break above this level soon.\n\nThe alignment of these technical indicators suggests that Ethereum could be poised for an upward movement, provided it can decisively conquer the $3,059 resistance level.\n\nMassive ETH Movements by Whales Hints at Potential Price Surge\n\nSeveral crypto whales have moved significant amounts of Ethereum (ETH) from the popular exchange Coinbase to unknown wallets. The transactions involved the transfer of 7,563 ETH, worth approximately $22 million each time.\n\nThe first whale, identified as 0x091d, moved 7,563 ETH worth $22,215,383 from Coinbase to an unknown wallet. Another whale, 0xd26e, also transferred 7,563 ETH, valued at $22,210,308, to an unidentified wallet.\n\nAdditionally, whale 0xfe73 shifted 7,563 ETH worth $22 million from Coinbase to an anonymous wallet. In the final transaction, whale 0xf627 moved 7,563 ETH, valued at $22.19 million, to an unknown destination.\n\nThese substantial whale movements often signal their intention to hold their Ethereum holdings for an extended period. By transferring their ETH to unknown wallets, they are likely preparing to accumulate more coins or hold their existing positions, anticipating a potential price increase.\n\nGiven Ethereum’s bullish technical indicators and recent price action, these whale movements could indicate impending upward pressure on the coin’s price.\n\nThe whales may be positioning themselves to capitalize on a potential breakout or rally in the Ethereum market. However, market participants should exercise caution and consider all relevant factors before making investment decisions.\n\nAI-Powered Meme Coin, WienerAI, Soars Past $2 Million in Presale\n\nArtificial intelligence (AI) and meme coins are two of the hottest trends in the cryptocurrency market. WienerAI, a newly launched project, combines these powerful narratives into one exciting offering.\n\nCurrently, WienerAI is holding a presale event, during which investors can purchase the project’s native token, $WAI. The presale has already raised over $2 million, demonstrating strong interest from the crypto community.\n\nInvestors can buy $WAI tokens at $0.000708 during the presale. However, this price will gradually increase as the presale progresses. The earlier investors participate, the lower the price they can secure.\n\nWienerAI: The Meme Coin with Serious Utility for Crypto Traders\n\nWienerAI isn’t just a meme coin; it offers much more practical utility than regular coins. Behind its fun nature lies a powerful trading bot designed to enhance the experience of decentralized finance (DeFi) users.\n\nWienerAI’s trading bot provides free, instant token swaps across various decentralized exchanges (DEXs), such as Uniswap, Bakeryswap, and Pancakeswap.\n\nThis feature helps eliminate the frustration of lengthy waiting times typically associated with buying cryptocurrencies. Additionally, the bot resists miner extractable value (MEV), ensuring users are not front-run by malicious bots.\n\nBy offering seamless and secure token swaps, WienerAI aims to bolster the overall DeFi user experience, making it more efficient and accessible for traders. This innovative utility has generated excitement within the crypto trading community, as many see the potential benefits WienerAI can bring to their trading activities.\n\nMeme Coin Goes Big on Community: WienerAI Allocates 60% of Tokens to Presale, Staking, and Rewards.\n\nWienerAI’s token allocation plays a central role in the project’s operation. A significant portion (30%) is allocated to the ongoing presale. Another 20% is reserved for staking rewards, incentivizing long-term holding and participation.\n\nAnother 20% is designated for community rewards, while 10% of the tokens are allocated for exchange liquidity. Finally, 20% is dedicated to marketing efforts, fueling the project’s growth and raising awareness.\n\nIn true meme coin spirit, this distribution puts the majority of tokens into the hands of the community. At the same time, it ensures resources are available for sustained growth and development.\n\nCurrently, staking rewards for WienerAI offer incredible returns of over 487%. This opportunity is available on a first-come, first-served basis. The annual percentage yield (APY) will gradually decrease as more tokens are staked.\n\nAlready, the community has staked over 2 billion $WAI, showcasing their eagerness to accumulate more tokens. Those seeking to maximize their upside potential should act swiftly before the presale ends.\n\nTo stay updated on the latest news and developments regarding WienerAI, follow the project on X (formerly Twitter) or join its Telegram channel. Alternatively, visit the official website to purchase tokens and begin staking immediately.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNbG1tN3BkWmxKZDlXcENKTkdyY1dicnBqaWhEVzFTQUFkcGcya2xhX2dGVk1tLTJhOENNOEQ4YkhmWEI1R3FnNEJtbXFYRnU4a252TWdaRjlWMkdmcWFnNmktblBlNXA1MS01OWtzTTdNVWtSdWFpbnE4akRTdGlvSjNDc25EZlpvWEtCb09mc3pVZnJJNVFFRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Missed Out On Ethereum? This Little-Known Cryptocurrency Could Be On Track For a Big Move - The Motley Fool",
        "content": "Crypto investors hope that Sui can become the proverbial next Ethereum.\n\nSince its launch nearly a decade ago, Ethereum (ETH -0.07%) has skyrocketed in price from around $0.30 to about $3,000, making it one of the most successful crypto investments of all time. On its path to the top, Ethereum has gained a dominant market share in just about every niche of the blockchain world and now ranks as the second most valuable crypto in the world, with a huge $354 billion market valuation.\n\nThose are difficult footsteps to follow, but there's one cryptocurrency that is starting to remind me a lot of what Ethereum looked like in 2015. You've probably never heard of Sui (SUI 7.69%), but it has very quietly become a Top 50 crypto, as ranked by market cap. It may still be early, but there are several good reasons it could be ready for a major move.\n\nWhat is Sui, and why should you care?\n\nThe first thing you should know about Sui (pronounced \"swee\") is that it is a Layer 1 blockchain, just like Ethereum. But it claims to be much faster, efficient, and cheaper to use than Ethereum. In theory, at least, Sui offers the potential to handle 297,000 transactions per second, with record-breaking low latency (lag time) and 100% uptime, which measures reliability. That makes the blockchain a great fit for both decentralized finance (DeFi) and Web3 gaming.\n\nThe cryptocurrency also has a world-class founding team, with top executives and developers from Facebook (before it was rebranded as Meta). While at Facebook, these technologists worked on blockchain projects such as Diem, which was Facebook's initial stab at a worldwide digital currency. Given this pedigree, venture capitalists have been more than willing to invest over $300 million into Mysten Labs, the company behind Sui.\n\nJust keep in mind, the Sui blockchain officially launched in May 2023, so it's still very early innings here. Ethereum has literally had an eight-year head start, and it's going to be difficult wrangling away market share in key blockchain niches such as DeFi. But there is no denying that Sui is a new blockchain challenger that needs to be taken seriously, if only because of all the money and top talent behind it.\n\nSui has a mobile crypto strategy\n\nSui also has a fantastic catalyst for 2025: The launch of a new handheld gaming device that will be completely integrated with the Sui blockchain. The new device, known as the SuiPlay0x1, is still in the developmental phase, and won't be available until next year.\n\nIn terms of appearance, this new device has been compared to both a PlayStation Portable and a Steam Deck. In terms of cost, it will likely be priced around the $500 mark, so it won't be cheap. And in terms of which games will be available to play, it will include games from Sui, as well as several other gaming partners.\n\nBut will this new product be a hit? That might be a question that only teenagers and young adults will be able to answer. My best advice is to create a list of all games coming to Sui, show them to any young adults or teens in your household, and ask them what they think. Early reviews on social media have been positive, but there are a lot of unknowns.\n\nHow high can Sui soar?\n\nBack in July 2015, when it officially launched, Ethereum traded for less than $1. By March 2016, it reached the $10 mark. By May 2017, it reached the $100 mark. So, in just its first two years, Ethereum skyrocketed in value by more than 100-fold. And that was just the start, as Ethereum eventually went on to hit an all-time high of $4,892 in 2021.\n\nCould we see the same phenomenon with Sui? Right now, Sui trades around the $1 mark. If people think that its new mobile crypto strategy is going to be a hit, Sui might start to make a move to the $10 level, if not higher. But think really big -- what if Sui starts taking market share away from Ethereum in key areas such as DeFi? The sky's the limit for how high Sui might go.\n\nOf course, we've heard this story before when it comes to cryptocurrencies claiming to be the next Ethereum. Nobody has been able to topple the market leader yet, so maybe it's unlikely that Sui will be able to succeed when others have not. But if you missed out on Ethereum the first time around, Sui might be worth a closer look."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMingJBVV95cUxPZGkzUFU2QVRJVVltN1VmX2hSa3JvRms1UEoyY0lNelA2a1laa1MyRlctUlFrbk1hdVNLYUtJMEtlQ2dEbERiLTE4elVLNm1pVDNYaFdzYzV6eW1iQVE5MW95T3BJWWI4ZmdNRHR2b1NVZWZsdVBjUjlmMDlaVUFEeEtkRmRqV1hXY0szTWZLUHdxUGZZc0hpNjBVTGpfalZNWXJpSGZuMGlCTDlBcFVxTy1kSExxa2E1WFBXbk5NWl9IYzRzZERTT2ZsX3JwakdFRzVoRDUySGJfMVJtd1NMSkFWS1lHXzZsdWUzNXcwMTNweVB4UXEzX1Z1TnpYendHZTlVU1o0UWdDQ043U2JVdEwzSGhjcnRVSlN5U3Fn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Brothers charged with stealing $25 million in Ethereum in 12 seconds — Cryptocurrency heist exploited transaction validation process - Tom's Hardware",
        "content": "In what U.S. prosecutors are calling the first case of its kind, a pair of brothers have been charged with stealing $25 million worth of cryptocurrency in just 12 seconds. They're now charged with wire fraud and money laundering for the April 2023 heist.\n\nAnton Peraire-Bueno, 24, and James Peraire-Bueno, 28, were reportedly educated at the Massachusetts Institute of Technology (MIT) in mathematics and computer science. Using the skills they learned at MIT, prosecutors say the duo found a way to exploit the Ethereum transaction validation process.\n\nThe brothers allegedly used that exploit to gain fraudulent access to pending transactions on the Ethereum blockchain, a public ledger that records and validates cryptocurrency payments.\n\nThe pair was arrested on May 14 on the indictment handed down from the United States District Court of the Southern District of New York. The indictment against the brothers was unsealed (PDF) on Wednesday, May 15, 2024.\n\nInvestigators say the brothers altered enough transactions in 12 seconds to redirect $25 million in cryptocurrency to themselves instead of the intended recipients.\n\nIn a press release, U.S. Deputy Attorney General Lisa Monaco stated that the brothers used \"a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds.\" She also explained that agents from the Internal Revenue Service (IRS) played a crucial role in solving the riddle of where the cryptocurrency went.\n\nA representative for Ethereum confronted the Peraire-Bueno brothers, but they refused to return the funds. Instead, they worked to launder and hide their ill-gotten gains, prosecutors allege.\n\nStay On the Cutting Edge: Get the Tom's Hardware Newsletter Get Tom's Hardware's best news and in-depth reviews, straight to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nU.S. Attorney Damian Williams stated the exploit \"calls the very integrity of the blockchain into question.\" Even though this theft was the first of its kind, prosecutors are prepared to uncover any other new forms of cybercrime. \"As cryptocurrency markets continue to evolve, the Department will continue to root out fraud, support victims, and restore confidence to these markets,\" Monaco pledged.\n\nThe Peraire-Bueno brothers face one count each of conspiracy to commit wire fraud and conspiracy to commit money laundering. If convicted, they each face more than 20 years in prison."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE55dDhBZElYaDhWSGhiVk5mZmlUZjFaNnhWclQxX2RhRzl1cDlYUzNxYzhuWWtlXzZScXVKU19IWFY2Vi1mdVAyZmFtQ1Qxamlsa3B4RnJMTjBDOEUwal9Kc01EMzdxZmpMTm1VQUNGeDFkMDN0R21zbU5KMFlxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Bitcoin Rises 1.5%, Ethereum's Breakthrough to $5,000, and Why Furrever Token Is the Next Big Thing - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 17, 2024 (GLOBE NEWSWIRE) --\n\nThe crypto market is buzzing with excitement as Bitcoin experiences a 1.5% rise, signaling strong momentum for the leading cryptocurrency. Meanwhile, Ethereum is on the cusp of a significant breakthrough, with analysts predicting it could soon reach the $5,000 mark. Amid these developments, a new and captivating player, Furrever Token, is emerging as a potential game-changer in the crypto space. Combining the charm of cat-themed content with blockchain technology, Furrever Token offers a unique investment opportunity with the promise of astronomical returns. As Bitcoin and Ethereum continue to capture headlines, don't overlook the irresistible appeal and innovative potential of Furrever Token—the next big thing in cryptocurrency.\n\nBitcoin Surges 2%: Institutional Investments in Bitcoin ETFs Skyrocket\n\nBitcoin (BTC) is currently trading at around $65,738.46, experiencing a nearly 2% increase since yesterday. Over the past week, more than 600 firms have disclosed substantial investments in spot Bitcoin exchange-traded funds (ETFs) in their 13F filings with the United States Securities and Exchange Commission (SEC).\n\nAccording to the filing data, professional investment firms have reported owning $3.5 billion worth of Bitcoin ETFs. Major players include Morgan Stanley, JPMorgan, Wells Fargo, UBS, BNP Paribas, Royal Bank of Canada, and hedge funds like Millennium Management and Schonfeld Strategic Advisors.\n\nMillennium Management leads the pack with $1.9 billion invested across various Bitcoin ETFs, including BlackRock’s iShares Bitcoin Trust (IBIT) and Fidelity’s Wise Origin Bitcoin Fund (FBTC). Schonfeld Strategic Advisors follows with a $479 million investment, primarily in BlackRock’s and Fidelity’s funds. Boothbay Fund Management and Pine Ridge Advisers have also declared significant holdings in spot Bitcoin ETFs.\n\nMorgan Stanley stands out with a $269.9 million investment in the Grayscale Bitcoin Trust (GBTC), making it one of the largest holders. Other notable investors include Aristeia Capital, Graham Capital Management, CRCM, and Fortress Investment Group, each with substantial investments in IBIT.\n\nSpot Bitcoin ETFs, which launched in January, saw massive demand in the first three months. Despite a recent slowdown in inflows, the sustained interest from hundreds of financial institutions underscores the growing institutional confidence in Bitcoin’s potential. As Bitcoin’s price continues to rise, these substantial investments highlight the increasing mainstream acceptance and adoption of the leading cryptocurrency.\n\nStory continues\n\nEthereum's Potential Surge Amid SEC Decision Anticipation\n\nEthereum (ETH) currently trades at around $2,950.80, down 0.5% from yesterday but poised for a potential short-term bullish surge after a five-day stagnation. This momentum is fueled by discussions on declining revenue on the ETH Mainnet and the looming SEC decision on spot ETH ETFs.\n\nOpinions are divided on the SEC's verdict for VanEck's spot ETF application due May 23. Nate Geraci of ETF Store believes rejection is unlikely, citing past ETH futures ETF approvals and staking option removals. However, some speculate denial due to ongoing Ethereum security classification investigations.\n\nSEC scrutiny began in April 2023, yet ETH futures ETFs were approved in September, highlighting regulatory complexity. Ethereum now aims to surpass $3,000, facing resistance at $3,103 and $3,161. Short-term bullish sentiment is evident, with ETH long liquidations decreasing, open interest rising to 1.97%, and anticipation of increased price volatility pre-SEC decision.\n\n\n\n\n\nFurrever Token: Analysts Predict the Next Big Thing in Crypto\n\nFurrever Token (FURR) is capturing the attention of the crypto world, with analysts predicting it could be the next big thing. Built on the BNB-20 blockchain, Furrever Token stands out by combining blockchain technology with the universal appeal of cute cat imagery. This unique approach transforms everyday crypto interactions into delightful experiences, featuring charming cat-themed stickers, emojis, and visuals that enhance user engagement.\n\nOne of the key features driving interest in Furrever Token is its engaging community challenges. These regular events encourage users to share their love for cuteness and participate in fun activities, fostering a warm and inclusive community atmosphere. The project also promises future exclusive content, ensuring that the community remains excited and engaged with new and delightful surprises.\n\nSecurity and compliance are top priorities for Furrever Token. The smart contract has been audited by Securi Lab, providing a safe and trustworthy platform for all users. Additionally, the team’s tokens are locked for a year, demonstrating a commitment to the project’s longevity and stability.\n\nFurrever Token's impressive tokenomics include a total supply of 9 billion tokens, with 65% allocated for presale, 25% for DEX allocation, and 10% for the team. The presale has already raised over $1.1 million, nearing the end of its stages and aiming to raise $1.9 million. With a current price of $0.000648, Furrever Token offers an attractive entry point for investors.\n\nMoreover, Furrever Token has launched a $20,000 Highest Total Buys Competition, where 10 lucky winners will share the prize. The competition runs until May 27, 2024, providing an additional incentive for new investors to join the community.\n\nFurrever Token has gained organic growth with nearly 4,000 members in its active Telegram channel. This growing community and the project's innovative approach position Furrever Token as a promising investment opportunity, blending the charm of cats with the potential of cryptocurrency for unparalleled rewards. Don't miss out on being part of this adorable revolution in the crypto world!\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nJoin $20,000 Furrever Token Giveaway\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMWxhdWk0RV9kWHpQdmVWWmxMYjVBVkxJMXhOdG9yM2dOeUliTmZ3M1lBdEs4YllReVV2UmVRa3NQZ0FKbGM5T0Vfd0dHS1Ewbm9lazNjMTBfb0JVdzNjeWdQREtISEtmTFFnVUxZbzJIa2N4WFg2dzYyMnRIcWdNQzlqbHRIS2hxQUpHYmVaVHNuQ0JQQmxaejZBQlNmX3VWb3U3VmVlanl5WFdxT05sQk1ac3XSAboBQVVfeXFMUEhfVDRHd2h6cXBRRWdyVlRDY05yTTAwSWNBeWtZeV9BVlZDX2hkTENDcDZMSEVWRFdMdkdVR0tpc19RRHRFUHFjQVBCT2hhdTNJLTgxdm1zbGwyT3ZEVGFadGpqZ2tDRnJhSmN6ai1UNHFwa0VPSDBkZFFnanVpQUt4aU9pUHhYSGZyVmtRWjl0X1VVd3ZpNjJhanEtMlVVbFhJbWVMNG9XTUJ1ZzRjaGpaaU9PVjJPWkJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ether Could Surprise to the Upside in the Coming Months, Coinbase Says - CoinDesk",
        "content": "Ether Could Surprise to the Upside in the Coming Months, Coinbase Says\n\nThe cryptocurrency does not have major supply-side overhangs such as token unlocks or miner sell pressure, the report said.\n\nBy Will Canny May 17, 2024 at 10:04 a.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPT2FuZTBHci13SlAydGVEWmdPYWM4M2VIeG5kQ2ZpemtweHp6RFA5RFVLM0lxWi1SY2pZRXVtclRYQnFET3ZhWDE0dVpHVkhTV01qRlNUZVJfTFV0ZjFhanJQZ1MwN1F5eEo4T0loRjdZLUtTTTBiMXlYaWgwckVwQlBLeXUzckFG0gGQAUFVX3lxTE11R2hKWEp2WkNacEUwMjcyb2NVTDF2THVNTW5GNGFWUFQySnJ5YkRMaGl2ajBTYVRfaFBDdml1ODJfOWxqUmdEZ01KY0ZURFQzYVk4UGwydlZNWXBzUDNVaUdzNXBMT2UzVWJOTE5HYlB6aHhCUXBvWHBsMFdRNjhXblFmWkhpX0pqVVFxSkpDMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Coming Sooner Rather Than Later, Says Coinbase - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA spot Ethereum exchange-traded fund (ETF) could hit the market sooner than expected, says Coinbase, despite growing industry observer pessimism.\n\nIn a note this week, America’s biggest cryptocurrency exchange said that “while there is uncertainty around a timely approval given the SEC’s apparent silence with issuers,” it’s only a matter of time before such a product hits the market.\n\nThere’s a long list of top asset managers—including VanEck, BlackRock, and Franklin Templeton—who have filed paperwork with the Securities and Exchange Commission to release an Ethereum ETF.\n\nSuch a product would give investors exposure to ETH, the second biggest digital coin by market cap, via shares that trade on a stock exchange.\n\nAD\n\nAD\n\nBut Wall Street’s biggest regulator has been slow to give a response to applicants, and has pushed back decision deadlines, echoing its earlier approach to spot Bitcoin ETF approvals before finally pulling the trigger in January.\n\nThis is usually normal in the ETF application process, but the SEC’s reluctance to talk about the investment vehicles has led analysts from the likes of Bloomberg and CoinShares to say that such crypto funds would not get the green light by the May deadline.\n\n“As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial,” wrote David Han, institutional research analyst at Coinbase.\n\n“Even if the first deadline on May 23, 2024 encounters a rejection,” he added, “we think there is a high likelihood that litigation could reverse that decision.”\n\nAD\n\nAD\n\nLast year, crypto fund manager Grayscale won an appeal against the SEC to convert its Bitcoin fund into a spot ETF in a high-profile case.\n\nThe SEC then reluctantly said yes to 11 Bitcoin ETFs on January 10. The investment products have since been massively successful, taking in billions of dollars of inflows.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOV0VyQWxySUtveGFYRlIwWkdCV09DMzhYOERfRGVRUGlBNUF0bGcxZUdGOGctakRnTzgyaHlzTDlyTHBYQUhzcFFXSjVzakRUVzlmUGt1aVdic0xheTZnUDY2TkpKbHVzdVBDa05nWkxBNXBvZFdhVUxWYUd6R2ZWTTJtVU3SAYoBQVVfeXFMUFl6djJxRkgyNjJ5OEQ1NENQTlhKZ0RsSlBKaGcweUswM0tUT2RXbU10Z1l2U2ZqS1A0MTlyWVBFZk50a3llR1Y4VnFnV1RNNmxTeHhtQzlRT01IdGJKb05kMnY2Z0pCaGZ4YUxpZzM2OGsxUkstY0xIYjE2cGZSM09jdGpoNVI1VVln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Addresses Major Concerns by Ethereum Community - U.Today",
        "content": "Advertisement\n\nVitalik Buterin has published a new article outlining upcoming Ethereum improvements, particularly focusing on PeerDAS, the Verkle tree transition and decentralized methods for storing history as proposed in EIP-4444.\n\nGrats @dankrad @peter_szilagyi you got me to interrupt my work on EIPs and make a twitter response that turned into an unscheduled poast 😀https://t.co/mmVaiEV68K — vitalik.eth (@VitalikButerin) May 17, 2024\n\nEthereum's founder emphasized the importance of decentralization, a key element of ETH's unique development strategy. He also addressed issues like Maximal Extractable Value (MEV) and the balance between minimizing and quarantining it.\n\nThe article was inspired by a series of tweets from long-time Geth core developer Peter Szilagyi, who expressed concerns about MEV.\n\nAdvertisement\n\nMEV became an issue, so instead of trying to find solutions against it, we've glorified it and are now catering the protocol and infra around it to proprietary MEV builders instead of local block producers. It's futile to fight against MEV os might as well lean hard on it, right? — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) May 16, 2024\n\nButerin noted that many of these concerns are already being addressed by ongoing protocol features and that additional issues can be resolved through realistic adjustments to the current road map.\n\nMEV\n\nButerin discussed Ethereum's approach to managing Miner Extractable Value (MEV), which emerged around 2020 when miners started using complex strategies to gain extra revenue from DeFi activities. This development compromised the fairness of block proposing, favoring larger actors.\n\nTwo strategies address MEV: minimization and quarantining. MEV minimization involves creating alternatives like Cowswap and using encrypted mempools to reduce exploitable information.\n\nMEV quarantining accepts MEV but limits its impact by separating block proposing from content selection. Validators focus on proposing blocks, while specialized builders choose block contents via an auction protocol.\n\nButerin supports a mix of both strategies, acknowledging that MEV will not disappear entirely and emphasizing the need to reduce the potential harm from builders to maintain decentralization.\n\nDecentralization\n\nButerin also emphasized the importance of making Ethereum nodes accessible, a central issue in blockchain decentralization. He highlighted EIP-4444 and Verkle trees as key technologies to reduce node hardware requirements, potentially to under 100 gigabytes or even near-zero by offloading history storage.\n\nButerin acknowledged concerns about centralization if responsibility for state maintenance and proofs is offloaded, suggesting an alternative: storing old history in a peer-to-peer network where each node holds a small portion of the data. This would ensure robustness with thousands of copies and potentially use erasure coding for added reliability.\n\nHe stressed that while Ethereum Layer 1 should support Layer 2 projects, it must maintain scalability and the unique properties that make Ethereum distinct, ensuring continued decentralization and security."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQVmg1MWJSNHhfTzFFd3FfeTB3VXZDYzU3R2YzUkgyUm41ZlltbUtndF9uMF9ERmgxUkRYZy1JVzJuT2d2RjQteEFmTDRUS1BPLW10X3RJczktVXdiZ1EwNnh5VkFQUDFVTExna1JuSU9FN21mS2VIb2VSTDJYSW5EZUdONzlMYWdjVm5udEwyVdIBlAFBVV95cUxPX1ZvTk9mMXhhc0hlRWlfOGhJYlZsTjBTQ3Mza0JESkdBQUJ5aGVnQmNtekhUVnR2Ym5QZGE3enZpWEJMMmlueFVldFlqT3V2dUZiQk9WMmpSRnkyYjBxbTFKMElqX29pRjY2aVFocDNVVFk4YnZZaXNUdzZuc29aaDRmLVZXdlhjbjBab3JXSGlpaWVG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ancient Ethereum Wallets Unload a Lot of ETH Amid Major Price Breakout - U.Today",
        "content": "In an eye-catching development, ancient wallets connected to Vitalik Buterin, the cofounder of Ethereum (ETH), have resurfaced amid the current surge in ETH prices.\n\nAdvertisement\n\nReports indicate that 200 ETH, equivalent to a staggering $600,000, originating from the very wallets that once funded Buterin's ventures, have recently been traced to a transaction with the U.S.-based cryptocurrency exchange, Kraken.\n\nThe saga began nine years ago when an address known as \"0x5eD\" initially funded Vitalik Buterin's wallets. Just two days after this historic transaction, a substantial amount of 2,000 ETH was swiftly transferred from \"0x5eD\" to another address labeled \"0x2FE.\" Remarkably, these ETH holdings remained dormant within \"0x2FE\" for nearly a decade, until they were abruptly sent onward to \"0x9D2.\"\n\nAdvertisement\n\n200 ETH ($600K) from the address that originally funded Vitalik’s wallets has just been sent to Kraken.\n\n\n\n0x5eD, after funding Vitalik's wallets 9 years ago, sent 2,000 ETH to 0x2FE - only 2 days later.\n\n\n\nThis ETH was held for 9 years in 0x2FE before being sent on to 0x9D2, an… pic.twitter.com/Ytq0FcSX2K — Arkham (@ArkhamIntel) May 17, 2024\n\nThe most recent twist in this enigmatic narrative unfolded mere hours ago, when \"0x9D2\" deposited 200 ETH back into Kraken.\n\nEthereum (ETH) price outlook\n\nThe timing of these transactions is particularly noteworthy, occurring against the backdrop of a significant uptrend in the price of ETH.\n\nETH to USD by CoinMarketCap\n\nDuring today's trading session, the price of Ethereum is up almost 6%, reaching a high of $3,110 in the last week and a half. Importantly, over the past three days, the price action has almost completely reversed the decline of the previous nine days.\n\nAs a reminder, the deadline to accept or deny an Ethereum spot ETF is coming in less than a week and is the first of its kind among altcoins.\n\nWhy old wallets associated with the founders of Ethereum are sending tokens to the exchange while the price of ETH is rising, and all this is happening a week before the decision on the Ethereum ETF, is perhaps the biggest question in the crypto world right now."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPYWNRNU5pQ0lURmRoNFBEWnRmMGliWTYtM1hLMXdTVWFJbkRES25UZ3R3SkdrNWNhTXQ3eFc0ZXVxU0JxZm9QYmRXcG10c3liU0tUN1FUbWpmcnVHU2VRUlNUbVJFdUttTXl3MmkzbGtabWwxSEQzM1FnQUpYanJtZjFXM1hrckItd3ZpM0pidEExdDJEVlFKS0VLZ093bHpEQjRJVlNaN1lCM1hZX21NSlVtVFhXZFpUUU9ia3hfNXN4VkU2OUxlUTVKOHJJYjhYMVNycmduMNIB3AFBVV95cUxPZ3RGTlE0YkFsLTVGcXBWTGNBSXZLUUpabkcwMG5HaUpyUVR6cnFHMW1UWVczRUF3ZzNlZnNadDgwZy1XSEdFbllpdDZxbFBIZGktU0FBMHVxYXBLclV2NldQTkl6cDdhNlR5dzdRVUJYRmNMc3pUaFlVYmxsNVhWMjZtT0hXZEdOT0ZVWnZhSnc0dEM0SF85SWhLaTd6NGIxc2lkZmN0VzlQUUVHaVNJQ3o2ekRUTWhBS3ZtQUpXbnA4a1MwQ1pjdW9ENzE4MThST1hXM2Nha2Fqcmtl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum rallies 5% as Vitalik Buterin responds to criticism from community amid Coinbase ETH ETF prediction - FXStreet",
        "content": "Coinbase analysts expressed confidence that spot ETH ETFs would be approved.\n\nVitalik Buterin has responded to criticisms labeled at Ethereum developers, stating how they have been addressing some of the concerns of community members.\n\nEthereum could see a further rise as it outperforms Bitcoin for the first time in May.\n\nEthereum (ETH) saw a quick rally on Friday, posting a 5% gain as its co-founder, Vitalik Buterin, responded to recent criticisms from the crypto community. Coinbase analysts have also expressed confidence that spot ETH ETFs would debut in the market soon.\n\nRead more: Ethereum drops below $3,000 again, spot ETH ETF sparks debate in crypto community\n\nDaily digest market movers: Processing speed, Buterin's response\n\nCoinbase analysts have said that spot Ethereum ETFs would debut in the market despite the silence from the Securities & Exchange Commission (SEC) towards issuers. \"As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial,\" said Coinbase analyst David Han.\n\nHe added that if the first deadline on May 23 sees a rejection from the SEC, \"there’s a high likelihood that litigation could reverse that decision.\"\n\nMeanwhile, following Ethereum's slow price growth compared to Bitcoin and Solana, many crypto community members on X have targeted core Ethereum developers through a series of criticisms.\n\nMany criticized Ethereum's \"acceptance of MEV\" after the Department of Justice arrested two brothers for an MEV-related exploit on the number one smart contract blockchain. Others complained that Ethereum folks need to post more about the protocol and its updates.\n\nRead more: US Department of Justice charges brothers for alleged 12-second MEV fraud\n\nOne X user, @chainyoda, shared his plight:\n\nEthereum has a very bad case of cosmos infection. Last cycle the ethereum discourse was human usable apps like uniswap and aave. This cycle all the ethereum devs and investors speak only PhD eg based sequencer, shared sequencer, intercontinental rollup... and one else gives a fk — chainyoda (@chainyoda) May 17, 2024\n\nMore importantly, Geth core developer Peter Szilagyi expressed dissatisfaction with the several upgrades the Ethereum network has undergone in a short while. \"My criticism is that you (Ethereum developers have) [...] have abandoned due process and rushed to hotfix things.\"\n\nPrivate transactions. Check.\n\nProprietary settlements (MEV). Check.\n\nStaked Ether issued by central auth. Check.\n\n\n\n0 local miner tips will nuke local stakers.\n\nGigagas hardware reqs will nuke local nodes.\n\n\n\nVoila, the banking system recreated. All privately held and operated. — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) May 16, 2024\n\nThe increased concerns sparked a series of posts from several Ethereum core contributors, including Josh Stark, Tim Beiko, Dankrad Feist and Ethereum co-founder Vitalik Buterin.\n\nButerin gave a detailed response to these criticisms in a blog post, stating that the concerns raised by community members are valid and \"are already being addressed by protocol features that are already in-progress.\"\n\nHe also stated that several other concerns from the community can be \"addressed by very realistic tweaks to the current roadmap.\" Buterin addressed three major areas that he believes form the majority of the concerns raised:\n\nMEV and builder dependence\n\nLiquid staking\n\nHardware requirement of nodes\n\nHe discussed how Verkle trees, EIP-4444, robust solo staking, and a peer-pressuring development process for MEV reduction can solve these issues.\n\n\"There is a near-unlimited number of blockchain projects aiming for the niche of ‘we can be super-fast, we'll think about decentralization later.’ I don't think Ethereum should be one of those projects,\" said Buterin.\n\n\"We should have deep respect for the properties that make Ethereum unique, and continue to work to maintain and improve on those properties as Ethereum scales,\" he added.\n\nETH technical analysis: Ethereum could attempt to break $3,251 resistance\n\nEthereum posted a 5% gain on Friday after it broke the $3,103 resistance. The rise follows a general appreciation of assets in the crypto market. However, Ethereum notably outperformed Bitcoin in the past 24 hours after several community members highlighted the ETH/BTC ratio was nearing a bottom.\n\nAlso read: Ethereum shows slight bullish signs, SEC faces several hurdles in attempts to deny spot Ethereum ETFs\n\nAs a result, ETH short liquidations are outpacing longs for the first time. With a total liquidation of $24.5 million in the past 24 hours, short liquidations sit at $17.54 million compared to $6.76 million long liquidations, according to data from Coinglass.\n\nThe recent ETH rise has also caused a spike in ETH open interest, which increased by 6.6% in the past 24 hours. This signifies renewed investor interest in ETH, meaning it may see less sideways movement in the coming days.\n\nETH/USDT 4-hour chart\n\nIf renewed confidence prevails, ETH could attempt to break the $3,161 resistance and, if successful, move past the $3,251 mark. However, it's important to watch out for volatility in the days leading up to the SEC's decision on spot ETH ETFs on May 23."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPVXdfRkg1MzBNa2JzX01KSjJxMEZDVlRXRnh2UnBHVVBvQmFtWjFtNU52Q3ZGNVBNZkNxMEZjeV92RTVJM3l2R01qYXR0cU1xaFd0cUlOaVRiblpiWXZwTkVuR0t6RkY5bWlmdU5hOHE5NFlLVlBEcERQYUhUZEwwdG5R0gGHAUFVX3lxTE5iNjZ4OWtfTnlwa0JKUW81QjNMcmR0TDZud1dKZ1lsazRkYVVkNzUyV2xIUThxa21uUWRQbEtnTmlTU0VSN3FIQUlNTDRES2ZycUpOY0FOYVZDbDRBUTdBWnJpVlVvcVotVFdReEtybHFqXzNpdUl1c2k1NVplZWMxTDVpZndxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Reveals Future of Ethereum and 'Free Internet?' - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVitalik Buterin, the cofounder of Ethereum, recently engaged in a discussion on X (formerly known as Twitter), shedding light on the future of Ethereum and the ambitious goal of building a free and open internet. This interaction, initiated by a tweet from Josh Stark, showcased a diagram illustrating different mindsets in the crypto community, ranging from definite optimism to indefinite pessimism.\n\nAdvertisement\n\nJosh Stark’s diagram categorizes mindsets into four quadrants: definite optimism, indefinite optimism, definite pessimism and indefinite pessimism. Stark labeled \"Crypto Twitter\" as oscillating between indefinite optimism and pessimism, which perfectly highlights the bouncing sentiment in the community that relies on most minor moves in the industry. In response, Buterin emphasized the importance of definite optimism, particularly within the context of \"crypto farcaster\" and \"Lens.\"\n\nCrypto farcaster is definite optimism. Lens too.\n\n\n\n2x points if you used a non-warpcast client at least once.\n\n\n\nNever lose sight of the ultimate goal: to build a free and open internet that is also trustworthy.\n\n\n\nCan't do that with theory and larping, need to actually use the tech. pic.twitter.com/RlVXMH0S2S — vitalik.eth (@VitalikButerin) May 16, 2024\n\nCrypto farcaster and Lens are platforms that embody definite optimism by actively working toward a decentralized and open internet.\n\nAdvertisement\n\nButerin’s message is clear: the ultimate goal of the crypto movement is to create a free and open internet. He cautioned against getting lost in theoretical discussions and emphasized the need for practical application of blockchain technologies. We have already seen the technology perform as a tool of decentralization in various digital fields. With Ethereum's role on the market declining, Buterin's call could be a signal for developers to amp up their attempts to build useful applications for users.\n\nHowever, Ethereum's recent performance has been somewhat challenging. Despite Bitcoin reaching new all-time highs, Ethereum has struggled to break through its previous ATH. The second-largest cryptocurrency by market cap has faced resistance and volatility, reflecting broader uncertainty on the market. This struggle highlights the importance of Buterin’s message: the need for continuous innovation and practical applications to drive the ecosystem forward."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPM2xQckJlV0R4MFMySmJQZHFXb2dIX3JNOF81d0liNF9taGxFX3g0SXhsb0V1dE14TG00NWQ2VDg2eklzUEt0YmF4bDE4LTF2YlhJQlZJVHJuc0dQcHRuLVBnX2dTOVVack1OYjFGN2Q4RVl1UFZCMnFHZlJqLXZGVkEwUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "MAOCAT Unveils Plan to Become the Next Top Ethereum-based Memecoin - Yahoo Finance",
        "content": "Maocat\n\nMAOCAT is a project that seeks to contribute to changing the memecoin crypto niche.\n\nHong Kong, May 17, 2024 (GLOBE NEWSWIRE) -- The MAOCAT project has officially stated its strategy to become the next big thing in Ethereum-based memecoins. With unique features like fixed staking, launchpad, and NFT marketplace, MAOCAT aims to offer a diverse ecosystem for cryptocurrency enthusiasts.\n\nAfter years of dog domination in the memecoin world, cats finally get to shine with MAOCAT's promising growth potential. The ongoing presale is just the beginning of this ambitious project, with more developments and features to come.\n\nHow This Team Plans to Launch the Next Big Ethereum-based Memecoin\n\nThe project's team believes MAOCAT could be the next big Ethereum-based memecoin to explode in popularity and value. Some hints of its potential already exist, such as the outstanding success of its current presale.\n\nAt the time of this writing, MAOCAT had already sold over 60% of its pre-sale allocation. Considering how fast the team reached this threshold, the growth indicates a high demand for this project.\n\nThe team's roadmap is divided into different phases. Specifically, Stage 1 includes:\n\nThe launch of MAOCAT.\n\nStaking opportunities for $MAO.\n\nThe creation of various social media accounts to connect with the community.\n\nIn Stage 2, users can claim their $MAO tokens and see them listed on exchanges. Additionally, the team aims to expand its presence on bigger and better exchanges while working on game development. The team is also excited to reach the milestone of having 10,000 holders of $MAO.\n\nFinally, Stage 3 will see the launch of the highly anticipated MAOCAT game and 10,000 NFTs. These unique NFTs will go live on the popular OpenSea platform and an NFT marketplace created by MAOCAT.\n\nThe Growing Ecosystem of MAOCAT: From SWAP to Launchpad to NFTs\n\nThere are four elements that make up the exciting and rapidly expanding ecosystem of MAOCAT. These elements include the MAO CAT NFT collection, an NFT Marketplace on ETH, MAO SWAP (DeFi 2.0), and MAO GAME.\n\nThe upcoming NFT marketplace will be a platform where users can buy and sell their unique MAO CAT NFTs. With NFTs' growing popularity, MAOCAT aims to provide its users with a seamless and secure marketplace experience.\n\nThe NFT collection will find its home in this marketplace. This feature will offer NFT holders a range of rarity tiers and unique benefits. Whether owning a rare or legendary MAO CAT NFT, users have multiple ways to be part of this exclusive community.\n\nStory continues\n\nThe ecosystem also includes MAO SWAP, a DeFi 2.0 platform allowing efficient and flexible trading through its innovative liquidity mechanism. With MAO SWAP, users can farm and stake their tokens to earn a fixed APR and other rewards.\n\nLastly, the upcoming MAO GAME will offer an interactive gaming experience with collectible NFTs as in-game assets. This particular mix of features goes beyond the typical memecoin project and focuses on token utility. The $MAO token lets users access all ecosystem elements and join various events, creating a great experience for MAOCAT supporters.\n\nAbout MAOCAT\n\nAt its core, MAOCAT is a project that seeks to contribute to changing the memecoin crypto niche. This sector is often entirely about dogs, which can surprise many, considering how popular cats are on the internet.\n\nBeyond the cat-based project, there's a rather large ecosystem in place for the MAOCAT community. This ecosystem will offer its users a range of benefits and opportunities, such as staking, trading, NFTs, and gaming.\n\nMAOCAT is gaining popularity and has already sold over 60% of its pre-sale allocation. In more practical terms, early investors bought over $300,000 worth of tokens in this phase.\n\nThe team behind MAOCAT has a clear roadmap for bringing this project to its full potential. The project's website is a great source for learning about MAOCAT's features and progress. As always, the social pages below let anyone connect with the community and stay updated on all things MAOCAT.\n\nX (Twitter) | Telegram | Instagram | YouTube\n\n\n\nDisclaimer: This is a press release and does not contain any financial advice. Readers should do their own research before taking any actions related to the company mentioned. You are solely responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. Cryptocurrency is volatile.\n\nCONTACT: James L. team at maocatcoin.org\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPaFJGb1E1N21TWllQTzVmZkpraWpjOHBFT0ZiLU1WSVptdGVvRjgzTE5NMlRwWHo4bU9ueTk1bDhfVTFISVFoODc4VWxGTjNWYzhCZFo3NzNNb0Z6X18yTXRUU0h1SVRVc2lxQWpuMXhhVjVuYlBYTzJwTFE5THJnNHRkMlFxMTJubUJMZDF0b0pCWVUxcm40dGJLQkFBQy1R0gGmAUFVX3lxTE9mNGJ0c2J4c3prR0lZLW41andGLUhkNWZ0UE9KeFU1emRxSFpkUm9sNjMyc1dJcHA4eWpUNllKM2tzaHI3TWtYYnZNUE10M2owMkJFZHBEaG8zc1F3a3dIc2ZFYnB2cGhZUmtqNGVkRkdWaXFhUVl5TXU5REZzZ2dDaldRMFgxN3hwZ1FrbGVZdkQwQnMzQ0FPUGJoVHdtNGdPeU9xRVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Sees End-of-Correction With This Resistance Breakout - CoinGape",
        "content": "Ethereum Price Analysis: Ethereum, the second-largest cryptocurrency by market cap entered a fresh rally in mid-week and rebounded from $2860 monthly support. This renewed buying interest bolstered by the Bitcoin price jump to $67000 on Friday has surged the ETH price to an 8.7% gain. However, an analysis of the daily chart shows the rising Ether price is heading to a crucial resistance indicating an upcoming pivot momentum for this asset.\n\nAlso Read: Here’s Why Ethereum Charts Might Turn Bullish Now: ETH Targets $4k?\n\nadvertisement\n\nETH Poised for Rebound as Falling Channel Pattern Nears Break\n\nIn the daily time frame chart, the Ethereum price shows the formation of a falling channel pattern. The two parallel trendlines acting as dynamic resistance and support have plunged the ETH value from $4084 to $2864 support indicating a nearly 30% loss.\n\nWhile the BTC price rally bolsters a new recovery sentiment in altcoin, the ETH price could remain trapped in a correction until the chart setup is intact.\n\nHaving said that, the Ether coin is heading higher to challenge the upper boundary of the Channel pattern. After a 3% upswing, the coin buyers escape the range of this pattern, signaling the end-of-correction trend.\n\nAccording to Ki Young Ju, CEO of CryptoQuant, Bitcoin (BTC) is currently in the middle of its bull cycle. Ju highlighted that Bitcoin’s market cap is growing faster than its realized cap, a trend that historically lasts around two years.\n\nIf this pattern continues, the current bull cycle might extend until April 2025. The accompanying chart from CryptoQuant illustrates the growth rate difference between Bitcoin’s market cap and realized cap, showing similar cycles approximately every two years.\n\nThis potential uptrend significantly influences the altcoin market bolstering top assets like Ethereum (ETH), Solana (SOL), Cardano (ADA), and XRP to lead to higher rallies.\n\nThe ETH price breakout from the channel pattern will accelerate the buying momentum and assist buyers in rechallenging the $4080 high.\n\nTechnical Indicator\n\nExponential Moving Average: The dynamic resistance of the 50-day EMA prevents the ETH price from breaching the channel pattern.\n\nAverage Directional Index: The ADX slope falling below 18% hints the prevailing bearish momentum is weakening.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNaU45WjBlYmNDYzFQaFVJckI4dmZ4ODVwUWNUdC10LWc4eHRLTjlVOTRrR2NheEx4ZWNTU0JGRThLa1I5MGd6OXZ4UHIwVGxBRUM3WmhxbGxPODl5QUJmMnZ5ZkJ3WDVQeXl2YzFJQXpzWG1PamY5U0lYaGJObFFkNHFJZFRaalJ1bGl3S0czLVZLbUc0aUMycjh4X0VsV2s3RDNlQmlCUGw2RWxXdUVN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "$10,000 Ethereum (ETH) by Year-End? Analyst Makes Bold Price Prediction - CryptoGlobe",
        "content": "Prominent cryptocurrency analysts have recently expressed bullish sentiment on Ethereum ($ETH), the second-largest cryptocurrency by market capitalization, with one suggesting it will surge to over $10,000 by the end of the year.\n\nMichaël van de Poppe, a cryptocurrency analyst with over 700,000 followers on the microblogging platform X (formerly known as Twitter), expressed optimism, suggesting ETH is on track to reach a higher support level and added that the “good times are there in a few weeks time” after noting ETH is “at end stage of the correction.”\n\n#Ethereum is at the end stage of the correction.\n\n\n\nThere's around 10% more to be going down on it, as then we're reaching a higher timeframe support level.\n\n\n\nThe good times are there in a few weeks time. pic.twitter.com/21mZeSUAxx — Michaël van de Poppe (@CryptoMichNL) May 15, 2024\n\nEthereum is at the time of writing trading at $2,975 after losing around 2% of its value over the last 24-hour period and being flat over the past month, and while it significantly underperforms when compared to the flagship cryptocurrency Bitcoin ($BTC), which dropped 0.3% over the past 24 hours after moving up 8% over the last 30-day period.\n\nNevertheless, another cryptocurrency analyst, CryptoYoddha, took an even bolder stance and suggested Ethereum is set to surge past the $10,000 before the end of the year.\n\nAs reported, another popular analyst, Ali Martinez, has recently noted that the TD Sequential is presenting a “buy signal” on Ethereum’s daily chart and suggested the cryptocurrency could “see a rebound of one to four candlesticks” on its daily chart.\n\nThe TD Sequential indicator is a popular tool among traders and analysts for identifying potential buy or sell signals in the market. Developed by Tom DeMark, the indicator is designed to forecast the timing of price points where a trend could exhaust itself and reverse.\n\nIt does this through a series of numbers (sequentials) plotted on price charts, which are based on specific criteria related to the closing price of an asset over a set number of periods. When the indicator signals a “buy,” it implies that the asset’s price is likely to increase, making it an opportune time for investors to consider entering the market.\n\nFeatured image via Unsplash."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPTGRWVjFPYlBfblNPc2QyVDVZQmFDYjVqbTNRbGlaR1dYeThSeG1uODU0T2w3NGpKbTk1VVVDRm1kZ285SkJoN3F4ZGJEQWxBTlZrcFAxRDlFdXA5Q1B4QU5YZlVuRGcyQjhpVHRubXlIeGpkUi1ZdTk0UngyVmdfQXZ6dE5QU0VlR3R30gGQAUFVX3lxTFBqQ2F1dy1IYTJYX2lTNlFNUjkxMVhkazJRYm5XR1BpUXZGTWlJY2hGMEFuY290Y2xmbFZWSU1MZzZxSVNtdE9RaXJ2YjF3alNwVEVkRHdDU1JMRm5JSEg2SkcwQVpCc2V4WnZzMzFYdlhQN0Y1QkJiTC16UmI0dEVBbUpMckFCbWpKNml3bW1INA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Jumps 5%, This Breakout Can Trigger Bull Run - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) is posing a strong recovery in the market jumping over 5% and shooting past $3,100 levels. After facing strong selling pressure for a few weeks, the ETH bulls are once again taking up the charge with the SEC decision on the spot Ethereum ETF approval just a week from now.\n\nEthereum (ETH) Price Breakout\n\nEthereum (ETH) price is currently trading around $3,087. It has recently broken out of a falling wedge pattern on the daily timeframe. If the price manages to close above this breakout level, we can anticipate a bullish momentum for Ethereum, as the falling wedge pattern is typically a bullish indicator.\n\nadvertisement\n\nHowever, one must note that Ethereum has severely underperformed Bitcoin throughout this year in 2024 so far. The ETH/BTC price ratio reached a three-year low on Thursday at 0.044. Since the Merge, the correlation between BTC and ETH has decreased by 45%, diminishing the likelihood of “the flippening” occurring in the near future.\n\nETH Can Suprise on the Upside\n\nWhile Ethereum has continued to stay under constant selling pressure, popular market analyst Michael van de Poppe believes that ETH could be gearing up for a strong surge on the upside. He wrote: “Coming weeks are going to be big for Ethereum and the whole ecosystem and markets are super negative”.\n\nIn its latest research report published last Wednesday, crypto exchange Coinbase stated that Ethereum could surprise investors on the upside. Ether could potentially see an upside surprise in the coming months,” the report stated, highlighting that the cryptocurrency lacks “significant supply-side pressures” such as token unlocks or miner sales.\n\nFurthermore, Coinbase believes that one must not understate the importance of spot Ethereum ETF. “We believe the market may be underestimating the timing and likelihood of potential approval, leaving room for upside surprises,” Coinbase stated.\n\n“Even if the first deadline of May 23, 2024 encounters a rejection, we think there is a high likelihood that litigation could reverse that decision,” the note said.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPYkpxVFFvdGRlcEFWdksxRmhXNGxEbmFkcks5eFZSZHJFNlpGSHl1MFRjdnU3UFItdnFFbU1GRjNtcEs0cEI3WVF0UllsWGg4cXFkazFtWHN6Y3NXQ0xBUG5Ld3N4TDE2Ni1MRFBoeUdjUXRvUFVPX09YMzZObThzUGlhU21zNUIwYWdMbVJKdmc1M0x4YklGVnRUQ2Z0bXZDYjd2SEN0NDk5bmVWV3k3X9IBvgFBVV95cUxPQ2ZJNnQ5MmdEWU9KSDA1eENPT2s2dmtUcjZ1cWNTcUM5cmZMUjRzemYxWjVDMVNXQS0yNG41Qlc5eFpiRmtWaDh2WHVaQW1ncWEzYVVFTkR6VVI4T2x1X0tUN0luaXNITF9JS1pYd2Y5YUw0VV91ZEhwQTBHVUJaeVBxMi1yNnpwMEVFS2VEWXRMMk15ZzFKZXJPdDkyUng5Vk81c0ZwcDdaTHJHV1VldjFPMm9ReGtBdktXY1pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum Code Review 2024: Is It Legit Crypto Platform? - Customer Feedback! - Outlook India",
        "content": "Step 1 - Registration\n\nThe first step is to register on Ethereum Code. You can visit the official website and click on Register. Fill out the registration form with basic information, such as name, date of birth, phone number, and email address. After you submit the form, the Ethereum Code verification team will verify all your information and will send a confirmation link to your email. You can click on the link and move to the next step.\n\nStep 2 - Fund Your account\n\nThere is no need to pay any registration fee while opening an account in Ethereum Code. The system is free of charge. However, users have to invest in their trading accounts. The minimum deposit required is $250 and it can be increased according to individual trading goals, risk tolerance, and other factors. This platform supports different payment methods, such as Credit/Debit cards, net banking, and wire transfers.\n\nStep 3 - Start Trading\n\nOnce you complete the registration process and fund your account, you can now start real-time trading. Select the cryptocurrencies or assets you want to invest in and set the parameters according to your trading goals. The system will automatically do the rest of the tasks based on price performance, risks, and market conditions. You can take charge if you want to handle things by yourself.\n\nRegister On Ethereum Code\n\nEthereum Code: Pros and Cons\n\nIn the last sections, we have discussed different aspects of the Ethereum Code trading system in detail. Here we will discuss the pros and cons of this system. It will help you gain a better understanding of whether investing in Ethereum Code is right for you. So, here are some of the pros and cons of Ethereum Code.\n\nPros:\n\nFree trading system\n\nSupports multiple assets\n\nUser-friendly and intuitive interface\n\nNo registration fee\n\nCustomization options are available\n\nThe latest technologies have been used\n\nOpportunity to diversify the portfolio\n\nFree demo mode\n\nAutomated trading\n\nSafety and security features\n\nProvides accurate market data\n\n24/7 customer support\n\nCons:\n\nA few countries, such as the United States, France, Cyprus, Iran, and Iraq have strict trading policies. As a result of this, Ethereum Code cannot be used in these countries.\n\nEthereum Code - Minimum Deposit\n\nEthereum Code is a free trading system and when we compare this platform to other trading systems, we can see that the former is quite affordable. There is no need to pay a registration fee while registering on this platform. No other fees like platform fees, deposits, or withdrawal charges are levied from the users. Users should deposit an initial amount of $250 to begin live trading. The amount can be increased according to individual choices. Users can also withdraw this fund at any time. It is important to note that customers are not charged any hidden charges or transactional fees.\n\nEthereum Code - Cryptocurrencies\n\nTraders can diversify their portfolios through the Ethereum Code trading system. They can invest in a wide range of cryptocurrencies through this single system. Some of the mainstream cryptocurrencies supported on this platform are Bitcoin (BTC) Ripple (XRP), Ethereum, Binance Coin (BNC), and so on. Apart from these, the platform also supports Forex pairs, CFDs, and other asset classes. Some of the cryptocurrencies supported on this platform are noted below.\n\nBitcoin (BTC)\n\nEthereum Classic (ETC)\n\nEthereum (ETH)\n\nRipple (XRP)\n\nBinance Coin (BNC)\n\nCardano (ADA)\n\nPolkadot (DOT)\n\nDash (DASH)\n\nMontero (XMR)\n\nRipple (XRP)\n\nYou can visit the official page, to view the complete list of cryptocurrencies supported on this platform.\n\nEthereum Code - Customer Support\n\nEthereum Code has an efficient team of customer support, who can help resolve any issue, such as technical, transactional, or trading doubts. The team is available 24/7 and users can reach out to them by calling their toll-free number or sending an email. The team consists of experts in resolving any issue and they also can help clear any doubts. You can view the Ethereum Code customer support details on the official website.\n\n\n\nTry Ethereum Code For Free\n\nEthereum Code - Countries Available\n\nThe Ethereum Code trading system is available in most countries across the world, except in some, where strict trading laws are implemented. So, here are the countries where Ethereum Code is available and traders can use it to make profits.\n\nMalaysia\n\nSingapore\n\nJapan\n\nHong Kong\n\nVietnam\n\nUnited Kingdom\n\nGermany\n\nBelgium\n\nSweden\n\nNetherlands\n\nFinland\n\nNorway\n\nSpain\n\nMexico\n\nBrazil\n\nPoland\n\nSwitzerland\n\nSlovenia\n\nSlovakia\n\nTaiwan\n\nThailand\n\nEthereum Code - Customer Reports\n\nSo far Ethereum Code has received positive responses from its users. By consistently using this platform many of them have made a lot of profits. They have also said that what made the platform efficient in terms of making higher profits is its user-friendliness, overall market analysis, and the integration of advanced technologies. With the help of this platform, users can identify the right trading opportunities.\n\nThe system has a Trustpilot rating of 4.6 / 5 and a Sitejabber rating of 4.3/ 5. So, the user responses and ratings suggest that Ethereum Code is legitimate.\n\nAuthentic reviews are available on different platforms, such as Reddit, Quora, and X. From the Ethereum Code customer reviews, we can understand that it is a genuine and efficient trading system.\n\nIs Ethereum Code A Scam?\n\nEthereum Code is not a scam\n\nWe have already discussed different factors about the Ethereum Code system in the previous sections of this review. One of the important factors among these is that this platform is free to use. Users do not have to pay any charges to use this platform. The minimum amount required to start trading is $250 and can be increased according to one’s trading goals. The important thing here is that users have full autonomy over their funds and can withdraw the amount at any time.\n\nStrict and safe encryption systems have been integrated into this platform to protect user privacy and data. Technologies such as two-factor authentication and other code systems are used to prevent data breaches and external attacks. In addition, Ethereum Code users have testified that the platform has helped them make high profits and expand their trading portfolio. Ethereum Code is a legitimate trading system and worth trying.\n\nEthereum Code - The Verdict\n\nEthereum Code is a free trading system aimed to help traders identify trading opportunities and make more profits. The system has been designed using advanced technologies, like artificial intelligence, algorithms, and analytics. It is said that the system generates accurate trading signals that come into use when searching for profitable times.\n\nEthereum Code is a top-rated (4.5 stars!) investment platform that makes learning about investments accessible and understandable. It stands out with its smart use of technology, providing accurate market analysis and tools that are easy to use.\n\nEthereum Code stands out compared to other crypto trading platforms in terms of its user-friendly interface, advanced features, and high success rate of 85% this web-based system seems legitimate\n\nThe technologies make the platform highly efficient and many users have reported that it has helped them to make higher profits. Risk management tools are also integrated into this platform to identify the risks and automatically stop orders. Ethereum Code is a secure trading system because all the safety measures, such as two-factor authentication and secure codes are used to protect it from external breaches. Evaluating all these aspects, Ethereum Code looks like a legitimate trading platform and is worth a shot.\n\nTry Your Trading Potential With Ethereum Code\n\nEthereum Code - FAQs\n\nHow does Ethereum Code ensure accurate market analysis?\n\nEthereum Code ensures accurate market analysis by using advanced technologies and algorithms.\n\nIs prior trading experience required to use Ethereum Code?\n\nNo. Prior experience is not required to carry out trading on Ethereum Code as the platform is user-friendly and offers an automated mode.\n\nCan Ethereum Code be accessed on any operating system?\n\nYes. Ethereum Code can be accessed on any operating system. This is a web-based platform that requires stable internet connectivity and a reliable web browser.\n\nWhat about the Ethereum Code customer support?\n\nEthereum Code has a trusted and dedicated customer support team that is available round-the-clock to assist in your trading journey on the platform.\n\nCan funds be withdrawn at any time from the Ethereum Code account?\n\nTraders can withdraw funds from their Ethereum Code trading account at any time. The funds can be transferred directly to their e-wallet.\n\nVisit Ethereum Code\n\nDisclaimer: The above is a contributor post, the views expressed are those of the contributor and do not represent the stand and views of Outlook Editorial"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPd0h0aTFyYS1feER5WkpfUjBYOE5rSU5CMEJTRE5uUmpLMENSTk4tMXBiSjNMNjgxajBiQzlObXZBc3dTUy1laGdRR1FNVE5PUUg4Wi1RMkhrTFZER1A3OTNENGFhWm5pRDRiMEo4UU1FU1pLNklPdldwbnhDeU91S0pheHlWZUp4Q0UyLVA4NFpPM2ZkYjFlOUx3bUVNMkJXRkYwU0dOVU5MMjNqVlVWdlpMTHNXdUUwV284elZ2SFMwZThrakhMUjk4c1ZldnpCbFlSUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Crypto Watch: Market consolidates as Bitcoin, Ethereum decline slightly - Business Today",
        "content": "In the past 24 hours, Bitcoin (BTC) hit a high of $66,750 before falling to $65,408, marking a 0.82 per cent decline. This surge caused a wave of liquidations, yet the overall outlook for Bitcoin remains optimistic. Despite a potential short-term pullback, analysts anticipate new record highs for the cryptocurrency.\n\nRelated Articles\n\nEthereum (ETH) has managed to surpass its 20-day Exponential Moving Average (EMA) but is struggling with Bitcoin's volatility. According to Rajagopal Menon, VP, WazirX, the social sentiment around ETH is cautiously positive. However, the Elder-Ray Index signals a buyer's market. He suggests ETH faces potential bearish trends, with a significant drop to $2,864 possible. He said, “ETH is trading within a descending triangle, signaling potential bearish trends. A significant drop to $2,864 is possible. Breaking the upper trend line could target $3,100. Next week's SEC decision on ETH ETFs is crucial.”\n\nParth Chaturvedi, Investments Head at CoinSwitch Ventures, highlighted that the overall crypto market has been relatively stable, trading in a narrow range despite the U.S. Senate voting against an SEC accounting rule. President Joe Biden has indicated he might veto the resolution.\n\nBitcoin and Ethereum are currently trading around $65.4k and $2.9k, respectively, down 0.8% and 1.9%. He said, “Trading around $65.4k and $2.9k, BTC and ETH are down by 0.8% and 1.9% respectively. While the broader market is in the red, a clear outlier amidst the leading cryptos is LINK (+13.6%). The Depository Trust and Clearing Corporation (DTCC) in the U.S., along with Chainlink and major US banks, completed a successful pilot to accelerate the tokenization of funds. This collaboration is a step further towards the adoption of blockchain technology in the traditional asset management sector.”\n\nHe further said that on the policy front, both Turkey and India have made strides in developing crypto regulations. The Securities and Exchange Board of India (SEBI) has proposed the appointment of multiple regulators to oversee crypto trading, moving towards a more structured regulatory framework. This recommendation has been submitted to a government panel advising the finance ministry on policy formulation.\n\nShivam Thakral, CEO of BuyUcoin, noted that recent Consumer Price Index (CPI) data shows signs of cooling inflation, which has sparked optimism in financial markets. This optimism has been fueled by the possibility of a rate cut by the US Federal Reserve if inflation continues to decrease. He said, “ The crypto market reacted immediately as BTC touched the $66,000 mark while ETH is hovering around the $3,000 mark. As per the media reports, India’s market regulator SEBI also suggested crypto trade oversight which brings us a step closer to regulated crypto trading in one of the major digital asset markets in the world.”\n\nDisclaimer: The information provided on the website does not constitute investment advice, financial advice, trading advice, or any other sort of advice and you should not treat any of the website's content as such. Do conduct your own due diligence and consult your financial advisor before making any investment decisions."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbUlVOUZmRWFuWTNCbko4UjFEN2FleXR6SWk1UnoxLWxVY3ZsTlFhTUNEcllyYWRuM01zRHl6VmRnTkkydFM0Uk1JNzhNTlhTdDE5WWVpVVVBM1BEeXJReUNrOWM4Nm9yX2dBWUpwZGdEbmhTNFEwLU1kY1EzeGVnRWdJTVk2QWE3U0o1cXdKNXLSAZYBQVVfeXFMT0NwWkdra3FqQXpMX1dSQzYyYUZ6VmJoRDgtcjNSYjg5YVZYMEJGaVRsY0lUUlBHUjIyeE93Vm42aWpISjBNWDBnczdfbFFXR1M5cGU3RFd0LVV2SEc2dDk0OGljSTJjTFFpdENSMWxYX3ZYYlBvQXUtRG8td1JiV2djMjlIQU5lSE56ZVZsUFBCZUt5eGV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Names One Thing He Loves About Ethereum Ecosystem - CoinGape",
        "content": "Crypto industry innovator Vitalik Buterin recently took to the X app on Saturday to highlight one of the things he appreciates about the Ethereum ecosystem.\n\nEthereum Promotes Open Discourse\n\nThe Ethereum co-founder likes the fact that the Ethereum ecosystem does not have a culture that impedes free speech. Buterin claimed that Ethereum does not stop its community members or any members of the public from speaking their minds on any matter.\n\nadvertisement\n\n“……..even when they have very negative feelings toward major things in the protocol or ecosystem,” Ethereum co-founder added.\n\nWhile the concept of “open discourse” may not mean much to some sects, Buterin highlighted that others take it seriously. Noteworthy, Vitalik’s statement does not appear to be a direct jab at any protocol but it suggests that he might have discovered a trend amongst digital assets ecosystems.\n\nProbably a case of some self-acclaimed top developers downplaying the opinion of their community members or that of “smaller” developers. The statement from Vitalik Buterin mirrors his stance on the matter of free speech and Ethereum’s part in achieving it.\n\nThe Ethereum co-founder never fails to laud the capabilities of the ecosystem or its superseding performance over its counterparts. Only a few days ago, he unveiled a groundbreaking proposal aimed at addressing the pressing challenges faced by the Ethereum network.\n\nIn one of his articles, Buterin advocated for the adoption of ‘Multidimensional Gas Pricing,’ a concept designed to revolutionize the management of network resources. He believes that Ethereum can enhance efficiency and scalability by pricing different resources separately.\n\nHe sees the capacity for this addition to pave the way for a more robust and sustainable network infrastructure. This was after Buterin requested that quantum resistance, a new proposal that will bring longer-term sustainability to the protocol’s smart contract push, be added to Ethereum.\n\nCrypto Community Expects Spot ETH ETF Decision\n\nDespite these multiple developments and advancement, Ethereum is still facing regulatory challenges with the United States Securities and Exchange Commission (SEC). The Chairman of the Commission Gary Gensler has remain fixated on categorizing the second largest cryptocurrency by market cap as security.\n\nThis classification seem to have negatively impacted on the possibility of receiving approval for the spot Ethereum ETF applications made by top investment asset management firms like BlackRock and Fidelity.\n\nWith a mix of optimism and pessimism, the broad crypto community have their fingers crossed waiting patiently for May 23rd, the decision date for VanEck as scheduled by the SEC.\n\nRead More: XRP Lawsuit: Pro-XRP Lawyer Reveals Dates For Lawsuit Conclusion\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbzJNLXRlRGJvVjRyaHo2TVBLa2hvM09BbElzM0NIdWVrdGVFNUgwd1lNSVVLZi1iaWdLNU5neWxXdl9nT1pENW1MQ1l4TDA0UlRYR0lneHZEczZjdm5WRk1nbkRMaEpLZ2lVeWI2bElDNFphNU1aWG92TWMwMWs1YUtZZzJvT05xMkpMVXp0QXVvSGtlcnVGVVF0UdIBoAFBVV95cUxNT3IzNW5OYlV6YzB0SDZWMVNWWWtOR1NkVHhLRG1MakdrLUVDZ3ktY3Q4UnZLWloyUGlIQ2FHVnlUX2FTZ19JNXJmWnFOX0oyNWR5LW53Q1lFTGs3VlN5SHp2eHo1cWlPYlFCTzB2eERuNmVlbzZJbFpOb1VKOTc5dU9xUHIwdDNlNDY1a0NkQ1BPMlFzY1RqRXRGbDM4WnNJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 18: Bitcoin Nears $67K, Ethereum Tops $3100 As SOL & XRP Surge - CoinGape",
        "content": "The top crypto prices today recovered as the Bitcoin (BTC) price inched closer to the $67,000 mark. In addition, the Ethereum (ETH) price rallied past the $3,100 level. Moreover, other top altcoins, such as Solana (SOL), XRP, and Cardano (ADA) mirrored the positive sentiment and extended gains.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price surged 2.21%, reaching $66,903.49 at the time of writing on Saturday, May 18. On the other hand, it’s trading volume plunged 8.66% to $27.32 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.31 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price soared 5.18% to $3,109.70 at press time with a market valuation of $373.42 billion. Whilst, ETH saw its trading volume spike 21.91%, reaching $14.82 billion.\n\n3. Solana Price\n\nThe Solana price extended above the $170 level, marking a crucial milestone today. The Solana price surged 6.34%, settling at $172.65. In addition, SOL witnessed a 9.76% gain in trade volume to $3.40 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price crossed the $0.52 mark again. The XRP price recorded a hike of 1.21%, reaching $0.5238. On the other hand, XRP’s trading volume dropped by 13.79% to $943.78 million.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price rallied 4.16% to $0.4838 today. Whilst, ADA recorded a gain of 16.67% in its 24-hour trading volume, settling at $421.30 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price rose 3.75% to $0.1557 while its rival, Shiba Inu price was up 2.25% and traded at $0.00002491.\n\nAlso Read: 3 Meme Coins With 100X Potential Today\n\nTop Crypto Gainers Today\n\nOndo (ONDO): The ONDO crypto price surged 17.06% and traded at $1.03.\n\nThe ONDO crypto price surged 17.06% and traded at $1.03. Gnosis (GNO): The Gnosis price rallied 14.43% to $304.50.\n\nThe Gnosis price rallied 14.43% to $304.50. Pendle (PENDLE): The Pendle price soared 14.20% to $4.96.\n\nThe Pendle price soared 14.20% to $4.96. Ordi (ORDI): The ORDI price rose 13.70% to $41.86.\n\nTop Crypto Losers Today\n\nImmutable (IMX): The Immutable crypto price plunged 3.56% to $2.40.\n\nThe Immutable crypto price plunged 3.56% to $2.40. Floki (FLOKI): The FLOKI crypto price slipped 3.25% to $0.0002079.\n\nThe FLOKI crypto price slipped 3.25% to $0.0002079. Toncoin (TON): The TON price lost 3.18% to $6.46.\n\nThe TON price lost 3.18% to $6.46. Beam (BEAM): The Beam price dipped 1.46% to $0.02471.\n\nEthereum Classic (ETC), Sui (SUI), Jupiter (JUP), and Fantom (FTM) also gained significantly today. Moreover, some cryptocurrencies that experienced a in the last 24 hours also witnessed a recovery in the 1-hour frame. The rebound in Bitcoin’s price followed the robust Spot BTC ETF flows. On Friday, May 17, these ETFs clocked a notable influx of $221.5 million.\n\nAlso Read: Chainlink Price Analysis: Whale Accumulation Positions LINK for $20 Breakout\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNbndVQTV2UEJHYnJsMm1hanFPWU0tRm5SZEFMRVpkTjVjWEFLcGE2OGlsemJxQmphejZNTjVCVXYxSjlFbEE4aFlMaUw1Z0hSc3lab3daY18zNnllV3VKaTRQRlZsZnNiSGh3WENtQnhxYm15d1Y4X2JPc3YzZ255a1Z5YkpWNnhZMGVUQ25vUVVCNnVfbHloeUt2bEJ3QdIBowFBVV95cUxQcWsyYWp3QjRWZjRpOXhUQjl2MHlPaDZlLUZ5UmlHTlc2TVVCaVY4dmNhNFB1SWdOLURabTl5ZUVLdlQ1c3NnSDQ1VEZydkl5d0Uwa0xrenFPNWlmcENHTjFGbm1nR1V0RGNQcThWaUZuYWx1SFFPVTB5Z2hHblRiNllmbzZnZ1ZOTWZLRDlRTVR4aFRqeGtjc2I0OC1kaVJlaDBV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 17: Bitcoin & Ethereum Retreat, Chainlink Bags Top Gainer Crown - CoinGape",
        "content": "The top crypto prices today registered declines, however, Bitcoin (BTC) price managed to sustain above the $65,000 mark. Whilst, the Ethereum (ETH) price extended lower than the $3,000 level. In addition, other top altcoins, such as Solana (SOL) and XRP also witnessed a modest drop while Cardano (ADA) gained.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price dipped 0.52%, reaching $65,499.97 at the time of writing on Friday, May 17. On the other hand, it’s trading volume plunged 28.74% to $29.90 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.29 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price lost 1.92% to $2,949.67 at press time with a market valuation of $354.32 billion. Whilst, ETH saw its trading volume plummeted 21.86%, reaching $12.15 billion.\n\n3. Solana Price\n\nThe Solana price sustained above the $160 level and dipped slightly today. The Solana price was down 0.25%, settling at $162.13. In addition, SOL witnessed a 26.47% drop in trade volume to $3.10 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price slumped below the $0.52 mark again. The XRP price recorded a dip of 0.23%, reaching $0.5175. On the other hand, XRP’s trading volume dropped by 8.10% to $1.09 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price rallied 1.11% to $0.4645 today. Whilst, ADA recorded a plunge of 9.75% in its 24-hour trading volume, settling at $361.14 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price slumped 4.09% to $0.15 while its rival, Shiba Inu price tumbled 2.94% and traded at $0.00002436.\n\nAlso Read: Smart Money Has An Eye For 2 Crypto To Buy For 10X-50X Potential In 2024\n\nTop Crypto Gainers Today\n\nChainlink (LINK): The Chainlink crypto price surged 13.25% and traded at $15.78.\n\nThe Chainlink crypto price surged 13.25% and traded at $15.78. Immutable (IMX): The Immutable price soared 6.72% to $2.50.\n\nThe Immutable price soared 6.72% to $2.50. Arweave (AR): The AR price rallied 5.77% to $46.21.\n\nThe AR price rallied 5.77% to $46.21. Hedera (HBAR): The HBAR price rose 3.47% to $0.1136.\n\nTop Crypto Losers Today\n\nBook Of Meme (BOME): The BOME crypto price slipped 9.45% to $0.01149.\n\nThe BOME crypto price slipped 9.45% to $0.01149. Stacks (STX): The STX price lost 8.16% to $1.97.\n\nThe STX price lost 8.16% to $1.97. Wormhole (W): The W crypto price slumped 5.25% to $0.5353.\n\nThe W crypto price slumped 5.25% to $0.5353. Ethena (ENA): The Ethena price dipped 4.93% to $0.6919.\n\nPolygon (MATIC), Sui (SUI), and Fantom (FTM) also gained significantly today. However, the broader market trend remained bearish.\n\nAlso Read: 3 Top Reasons Why Catcoin (CAT) is trending Today\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE82UFM4RFhvTC03UVRPR2NUaGptczZndDNKTmFZWnlkdHFmLWFMWkVHRnlkTkVPV2pnckMxZFYtWWZRVV9wTFJ1b2d2NFJTYlE5d1Q3VHVXbzR2QUhFaXI4bU5LOFBlX0JXU1RWeGt4ejZiTkpSbkUyd1Y1Tndlc1XSAYQBQVVfeXFMUDlFQWJpTnphbHRwRDBIYkpKYnBGTlNhdHh0UEVjT1NFZlNNUkl5R01rdXQ0ZU05Uk40UXNKenBRWlNVNEpiVTh0cXllOFlodmw1TjVDUm0ycUJfUW9mb21XdHNRSXRCX2wzTk5UbHpvUG9UYVBlOXAtcTZrcm53WWJrN1o0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum nears $3,200, jumps 10%: Bullish breakout ahead? - AMBCrypto News",
        "content": "ETH wants to break above resistance.\n\nThe bulls supported the coin’s uptrend with a number of markers spotted on a daily chart.\n\nLeading altcoin Ethereum [ETH] is poised to breach the upper line of its descending channel, suggesting a decline in selling pressure.\n\nAt $3,100 at press time, the coin’s value has risen by almost 10% in the last week, according to CoinMarketCap. This growth mirrored the uptick in the general crypto market in the last seven days.\n\nAccording to CoinGecko, global cryptocurrency market capitalization has surged by 9% during that period.\n\nWill ETH make it?\n\nA descending channel is formed when an asset’s price continues to make lower highs and lower lows, indicating a broader downward trend.\n\nETH began to trend within this channel on the 12th of March, causing its price to decline by 20% since then.\n\nWith the coin making its way toward the upper line of the channel, which has formed a resistance level since March, the market witnessed a surge in new liquidity inflow.\n\nConfirming this was ETH’s Chaikin Money Flow, which recently crossed above the zero line and was in an uptrend at press time. This indicator measures the flow of money into and out of the coin’s market.\n\nWhen an asset’s CMF climbs this way, it suggests more buying pressure than selling pressure in the market. This is often due to the asset’s price making new highs because of a surge in trading volume.\n\nIn the last seven days, ETH’s daily trading volume has risen by 40%, per Santiment’s data.\n\nSignaling the rise in bullish presence, ETH’s positive directional index (green) crossed above its negative index (red) on the 17th of May.\n\nSuch readings made from an asset’s Directional Movement Index (DMI) indicate a bullish rise in the market.\n\nFurther, the value of the coin’s Elder-Ray Index was positive at press time.\n\nThis indicator measures the relationship between the strength of buyers and sellers in the market. When it returns a positive value, it means that bull power dominates the market.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nShould ETH bulls succeed and break above the upper line of the descending channel, the coin’s next price point will be above $3200.\n\nHowever, if selling pressure mounts and a downtrend is initiated, the price is expected to fall to $2775 toward support."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOQ1BTVTdqcXRRbXRSVUZKSHVxWGtDaHAxVzJtUEJMd005b3NXb1lXVmhrOVJmMzh4X2hlc2x4RkR3MWViX0RlTkNyNzV2OTR6SmQ1MWtTNUlwRFB0bm1WM2hrcXpmR013SmJabTQySUROSU1HQjFXMlFSaUhCZWlzUVcwQlUxQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum price corrects technically after the rise - CryptoNewsZ",
        "content": "Ethereum is currently testing its $2,925 support, and it anticipates a massive price hike in the coming days. After the bears defended $3,040, ETH entered a downside correction stage.\n\nAccording to recent market reports, the Ethereum price trades below $2,960, as does the 100-hourly Simple Moving Average. The recent market trend is linked to a bearish trend line, and the pair is hopeful of a new price increase. The crypto world was amazed after learning about the price dip in Ethereum.\n\nLike Bitcoin, Ethereum saw a fresh increase above the $2,950 and $2,960 levels, and its price noted a shortcoming correction very recently. According to crypto experts, bulls hover around the $2,925 support level. The immediate resistance of the Ethereum price is estimated to be near the level of $2,960, coupled with a bearish trend line. The first major resistance level is calculated to be near $3,000, and any increase in gains will escalate Ether toward a very high resistance zone.\n\nAdvertisement\n\nEthereum prices will continue to dip if It can’t clear the $2965 resistance. The downside initial support is around $2925. Ethereum’s upcoming major support is around the $2900 zone, and a move below that level will lead to a price hike. Experts predict that Ethereum prices will persist at low levels in the near future, and Ethereum’s modified price will test the Fibonacci support.\n\nThe potential impacts of the Ethereum price dip include a downward trend and bullish reversal, among others. The current crypto market trend is a transformative phase for Ethereum, and the current Ethereum price is approaching noteworthy Fibanocci support levels.\n\nThe prospects of Ethereum reaching a low level depend heavily on market conditions and buyer sentiment. In the coming days, an Ethereum price trend reversal and upward movement is possible. After a fresh price hike, the price of Ethereum has declined by around 31.34%.\n\nThis recent development coincides with a negative trend in the MACD histogram, and Ethereum is currently experiencing a Fibanocci support level of approximately $2866. The upcoming Fibanocci support will be around $2,100, and maintaining a high position will pave the way toward sustaining the current trend.\n\nAs far as the Ethereum price is concerned, it is certain that the upcoming days will see a bullish trend. It is anticipated that a return to the upward trajectory will occur as the Ethereum price potentially switches back to $2,866. The downward trajectory of Ethereum against Bitcoin exists even now, and the RSI (Relative Strength Index) continues its neutral stance despite the recent developments. It is a fact that the Ethereum price is at risk of breaking down from an escalating trend line.\n\nAdvertisement\n\nThe Ethereum price swing will be a deciding factor in predicting the market trends of the upcoming days. Bearish market trends and short-term breakdowns impact Ethereum’s future growth trajectory. There is a minute possibility of the correction deepening in the upcoming days, and Ethereum is known as an asset characterized by high risk and lucrative rewards."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQanlVbFhqZHVzNEpPZjg2TlRPTWxlMXNmN09BVnRvcFdUQXlvakhTbjU1cFBZQnN4SzE1TFprQTVyWUxfd3NXNXRhdG5SdklRdUstOVBncEJZaDFSNmZxS1J3UEhXUXdvOFo1ZjhwMm5fakdUUHVvZTdCMEtpNmY1UzRrZ0pmNllHdHpBejF3eHhMMnloTXfSAaMBQVVfeXFMTzBXRWF0Z1Q5MEhDMG92YUY3X2RDMFFKOXVzRlp6akVlQUlfQjNtZWNDb1A1Uks2VlVBZFViUjBqM25QR2l4dTdnZTdBaEdQTW15bWVCQUtkVk15eVJrbTVVRl93T3lXVU50cDZyMUY1R1lKRVNFV1Y2djNDWnlyNzhua24yYWF6a0c5Q1lfQ3NfbVZXRlJIMC1NOHZFdVZvZ24ydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum Price on May 17, 2024: A Detailed Analysis - Analytics Insight",
        "content": "Investors should remain cautious in the short term, keeping an eye on critical support and resistance levels. As the market navigates through regulatory challenges and technological developments, Ethereum is well-positioned to maintain its status as a cornerstone of the blockchain ecosystem. Whether you are a short-term trader or a long-term investor, understanding these dynamics is crucial for making informed decisions in the ever-evolving world of cryptocurrency."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxONDhYTTJRVUVXcllnbElHNThyRS0yQm1ycGJoUmxrTDBXWWJ3anl3VVZaejVreV9vWTVVZXBMeGlLVHlyeTNDZXZHNVFQVm9LS1B6NExPWW1KVGdodUxYMC01c0hqbVFyZXhtbFJoMW1OQ3ptQlJ2YTk3SHVRWks5YXVPWjBIOXBOYXVwRUxmVk1IOEE5NXhFQlA1MDFKU0HSAaQBQVVfeXFMTjZwTlpiMS1lZmliZUZhZmQ1YmpaY3BIMm1UVkNORFRrWmZMNzk2S2VnRGZvendKcUdncXU4dHVHOGNCMDdiLU9ySDlZRUpyUldGMHE3YlI3SW1Tb1Z0QjJWdW91MVFWdTlKZ0REWlQxZENJSHJ4RHROQXVpbzNubzU1amx6Q21ET1pnUXllQ2FQWWxmemJxR3JNaE93SzVncy04Sy0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Market watch: Bitcoin, Ethereum traders on the spot with $2.13B options expiry - AMBCrypto News",
        "content": "Bitcoin maintained a balanced Put/Call Ratio ahead of the deadline\n\nETH traders face potential losses as its price was close to the maximum pain point\n\nAccording to data from Deribit, the market-leading derivatives exchange, Bitcoin [BTC] options with a notional value of $1.18 billion will expire on 17 May.\n\nAlso, Ethereum [ETH] contracts, valued at $950 million, would expire on the same day. At press time, the Put/Call Ratio for Bitcoin was 0.61 while the maximum pain point was $62,500.\n\nWhere do both BTC and ETH stand?\n\nIn trading options, a put means that a trader has placed a position to place a contract up for sale. In this case, the expectation is that the price of the asset decreases so the position can make gains.\n\nOn the other hand, a call implies a purchase, indicating that the bet is for a price hike. If the reading of the Put/Call Ratio is 0.70 and above, it means that traders are buying more puts than calls.\n\nConversely, a reading of 0.50 and below implies a bullish sentiment in the market. For Bitcoin, the ratio revealed that the number of put and call positions was close, indicating a balance between bearish and bullish positions.\n\nFor ETH, the Put/Call Ratio was 0.21 – A sign that most of the bets were bullish. ETH had a maximum pain point of $3,000. If the cryptocurrency trades at this level or below by the end of the day, a lot of traders might face huge financial losses.\n\nIt would be the same for Bitcoin if the price hits $62,500 or drops below it. At the time of writing, the price of Bitcoin was $66,443, indicating that it might be difficult for the crypto to cause a lot of pain.\n\nHowever, at the same time, ETH was valued at $3,018. The closeness of this to the maximum pain point leaves ETH traders at a big risk of losing.\n\nETH’s weakness has not deterred future bets\n\nIn addition, Greeks.live, an options trading repository, commented on the matter. The handle agreed with AMBCrypto’s analysis for Bitcoin via X. For Ethereum, it noted,\n\n“Btc is more balanced between long and short, while the ETH price is weak leading to continued weakening of the market confidence, and selling calls have become the absolute main deal.”\n\nHowever, data from Deribit revealed that traders expect ETH to recover from its struggles going forward. Based on AMBCrypto’s observations, there has been an increase in bets targeting $3,600 between the last week of May and June.\n\nOne of the reasons for this prediction could be the looming SEC decision on the numerous Ethereum ETF applications. A nod on this front could drive ETH’s price higher, and traders might gain from the same.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nOn the other hand, delay or rejection could force the price of the altcoin further lower. Should this be the case, traders might have to deal with huge financial losses."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBfQ2tONmJPcEF4UWlWQkE3dDFSdjQ3QUhKa1JicjNuMXhURmJKY0ZXeDh2UFM5UVpBVElqTVZKMjJqa2tXYTBZcW9vdmVuMXU5UjZCWWRacklFNFZWdXNSSlNWcUVHLUFmUC1IVWtteXctb1dlMEJV0gF8QVVfeXFMTWdRNk4xT2FnUlo5aDQxTDIwMVN6S1V2Ny1pR1d4dy1POVh6ZG9zYXBqMF9OLXJJWktoX1I0MzNYb0JaRUI5MmJfRFExTjlEekp4UndWOXJ5VWFfdVgzMU1TS2lBYXNQQVd3OUNWT1lGdjFsSlVSaEE3YjJfbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 17:02:55 GMT",
        "title": "Expert Sets Timeline For When Ethereum Price Will Begin Rally To $10,000 - NewsBTC",
        "content": "A crypto analyst has made a daring prediction for Ethereum (ETH), setting the timeline for when the world’s second-largest cryptocurrency would embark on a significant rally to new all-time highs above $10,000.\n\nHere’s When Ethereum Will Reach $10,000\n\nA crypto analyst identified as ‘Yoddha,’ on X (formerly Twitter) has announced the timeline for Ethereum’s ascent above $10,000. According to Yoddha, Ethereum is expected to rally massively after a period of accumulation and decline, continuously rising above $10,000 by the end of the year.\n\nRelated Reading\n\nWhy Did The Bitcoin Price Rise Above $66,000 Today? 4 months ago\n\nThe analyst’s ambitious predictions are based on historical trends exhibited by Ethereum from 2016 to 2024. He shared a chart depicting Ethereum’s price action over these years, highlighting periods of accumulation, interim peaks and volatility.\n\nYoddha disclosed that from 2019 to 2021, Ethereum witnessed a period of accumulation marked by multiple price fluctuations, including long declines and short rallies. Following this, Ethereum surged significantly, reaching a peak of $4,867 towards the end of 2021. This price range aligns with the cryptocurrency’s all-time high of $4,878, achieved during the previous bull market cycle in 2021.\n\nBased on these historical trends, Yoddha identified a similar accumulation phase in Ethereum’s price movements during this current market cycle. The analyst noted that from 2022 to early 2024, Ethereum experienced an accumulation and slightly bearish phase.\n\nPrior to reaching a record high of $4,088 on March 12, 2024, Ethereum had experienced a bearish trend in 2022 and 2023. The cryptocurrency also faced declines on several occasions in 2024, especially around April and May.\n\nYoddha has indicated that Ethereum has successfully concluded this accumulation and bearish period and is on track to witness a massive rally towards $15,346, extending into the end of 2024.\n\nAnalyst Says ETH Could Start Altcoins Season\n\nIn another X post, Yoddha indicated that Ethereum could start the upcoming altcoins season. The crypto analyst has consistently emphasized the impending launch of the highly anticipated altcoins season in 2024.\n\nHe revealed that altcoins will begin to gain more attraction once the hype surrounding meme coins diminishes. Additionally, Yoddha revealed that 2024 could issue the biggest altcoins season, encompassing healthy pullbacks and new all-time highs.\n\nRelated Reading\n\nEnd Of The Road For BNB After 200% Surge? Mounting Resistance Threatens Rally 4 months ago\n\nPresently, the price of Ethereum is trading at $3,024, reflecting a 1.58% decline over the past month, according to CoinMarketCap. A surge above $10,000 will require the cryptocurrency to jump by more than $7,000, fueled by a notable uptick in investor demand and interest in the cryptocurrency as well as the potential introduction of an Ethereum Spot ETF in 2024.\n\nCrypto analyst, Ali Martinez has revealed that currently, Ethereum’s TD Sequential is presenting a “buy signal” on ETH’s daily price chart. He predicts that Ethereum could witness a rebound of one to four candlesticks from its recent price drop.\n\nChart from Tradingview.com"
    }
]