[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM2F4VjlyRUh2M2xRcUFkUTRVWXRZN1N2a21TRklGbnBEWThrOWRzZldqYzdVSU5nZHNKeDlYZXl2SE0wdjdOc0NPelhuRjVVSmFzQzB4aFFiRjNPYmZxenpzb2RZUEpqRUY0UnpmalNaNTgzTWx4TFZ0a1loOXpYemZiV3hDQTRMLUJOcXNFZVJyc3RYcXpzbUg5a19falE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "SEC may be forced to declare Ethereum a security after controversial new launch - Fortune",
        "content": "Prometheum plans to announce on Wednesday the launch of custodial services for Ether, the native cryptocurrency of the Ethereum blockchain, whose $280 billion market cap is second only to Bitcoin’s. The move may be part of a larger strategy by the crypto firm to get regulators to identify Ether as a security—a position widely unpopular among industry peers.\n\nSo far, the Securities and Exchange Commission has avoided taking a position on Ethereum’s legal status even while declaring more than a dozen other popular cryptocurrencies to be securities. The latest gambit by New York–based Prometheum, which claims it has discovered a compliant path for crypto within existing laws, could force the agency’s hand.\n\nLegal experts have told Fortune that Prometheum’s plan to launch its custodial service may compel the SEC to resolve the long-running Ethereum question. If the agency does indeed proclaim Ether to be a security, Prometheum could be in a pole position when it launches its planned trading platform next quarter—even as the rest of the industry insists crypto can’t be viable without new laws.\n\nA controversial new player\n\nLongtime crypto exchanges like Coinbase and Kraken offer trading platforms in the U.S., allowing users to buy and sell popular cryptocurrencies like Bitcoin and Ether. While many of the firms have been around for more than a decade, they still operate outside the regulatory framework of the existing financial system, which has led lawmakers to propose new rules for the industry.\n\nSEC Chair Gary Gensler, who has stepped up enforcement after the disastrous collapse of FTX, has said existing rules are sufficient and filed lawsuits against exchanges for failing to register with the agency. In response, companies like Coinbase have argued that the existing rules are outdated.\n\nWhile much of the U.S. crypto industry has sided with Coinbase, Prometheum has taken a different—and contentious—approach.\n\nFounded by two brothers, Aaron and Benjamin Kaplan, Prometheum received regulatory approval in 2021 to operate an alternative trading platform—similar to a stock exchange—where users can buy and sell different securities. The company went on to gain widespread attention in mid-2023 when it announced a first-of-its-kind approval from the Financial Industry Regulatory Authority (FINRA)—an industry oversight body that’s independent of the SEC—to operate as a special purpose broker-dealer for digital asset securities. The SEC first created the designation in 2021, but no other firm has succeeded in obtaining a license, though others, including Robinhood, have tried.\n\nPrometheum’s claim to have found a compliant path for crypto trading immediately drew condemnation from legal figures in the crypto industry, who argued that even if the SEC and FINRA approved Prometheum’s structure, it would not have any assets available for trading. That is because, skeptics argue, the SEC has jurisdiction over securities, while cryptocurrencies like Solana and Ether are more like oil or gold—assets that don’t fit the legal definition of a security and so can’t be registered.\n\nThe Kaplan brothers, in contrast, agree with the SEC’s assessment that most cryptocurrencies are securities. They argue that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144, which is used to trade restricted stocks, and that they can use blockchain data to determine whether the assets have been in circulation for more than a year—a key factor for the exemption. As an alternative trading system (or ATS), Prometheum will not have to work directly with the issuers but instead can choose which assets to list.\n\nPrometheum’s claims have not only riled the crypto industry but Republican lawmakers, who have argued that Gensler had propped up the little-known firm to further his own regulatory agenda. In a June appearance on CNBC, for instance, Gensler touted Prometheum’s registration as a special purpose broker-dealer as an example of a compliant path for the industry. And last June, the company received a prized invitation to testify at a congressional hearing about crypto despite having virtually no presence in the industry.\n\nThe debate over Prometheum’s proposal has until now been theoretical, but Wednesday’s announcement of Ether custodial services, which are slated to launch by late March for institutional clients, means the company is on the cusp of becoming the first crypto exchange to compliantly offer assets like Ether for trading.\n\n“We want to work with the crypto industry,” Benjamin Kaplan said in an interview with Fortune. “Our goal is not to destroy, it’s not to harm, it’s not to undermine—it’s to help build.”\n\n‘Move the ball forward’\n\nIn the traditional world of stock markets, the various steps that make up a trade are divided among different firms. For instance, a retail trader visits a broker like Fidelity to buy a share of Apple stock, leading Fidelity to turn to a broker-dealer like Citadel Securities to fill the order. Next, a firm called the National Securities Clearing Corporation, a subsidiary of the Depository Trust and Clearing Corporation, figures out who owes what in all the trades the broker has made that day—a process known as clearing.\n\nAt this point, another DTCC subsidiary called the Depository Trust Company steps in to oversee the funds and securities moving from one party to another—a process called settlement. Finally, an institution—either the original broker or a firm like State Street or BNY Mellon—serves as the custodian, meaning it holds the actual securities on behalf of the investors.\n\nOne of the reasons for separating these various functions is to prevent conflicts of interest. If Citadel, for example, was serving as both an exchange and a broker-dealer, it could digest customer trade information and front-run orders. Separating brokers into distinct entities also prevents markets from having a single point of failure, as happened with FTX.\n\nJames Angel, an associate professor at Georgetown focused on financial regulation, told Fortune that much of the separation is also historical—a convention that the crypto industry is seeking to disrupt with the help of blockchain technology.\n\nFirms like Coinbase offer clearing, settling, custody, and trading services under one roof, an arrangement that provided partial fodder for the SEC’s lawsuit against the exchange. The agency’s primary complaint, though, was that Coinbase and others had not registered with the SEC to offer any of these services—even as it sold what the agency deemed to be securities.\n\nPrometheum, meanwhile, believes it has found a way to sell crypto without triggering any of these objections from the SEC, in part by dividing itself into two entities.\n\nOne, the alternative trading system, is a member of FINRA and registered with the SEC, and will provide a front-end platform for investors to buy and sell crypto assets. The other entity, Prometheum Capital, is the company that received the special purpose broker-dealer license and a final go-ahead from FINRA in January to offer the clearing, settling, and custody services necessary to complete the trades.\n\nThe upshot is that, while firms like Coinbase have been battling with the SEC, Prometheum has been getting approvals from FINRA, which is nominally independent of the agency but also works closely with the SEC and is ultimately subject to its oversight. It is also notable that, while other firms have applied to receive the special purpose broker-dealer license—the one created by the SEC in 2021 and issued by FINRA—Prometheum is the only one to receive it.\n\nNow, Prometheum’s custodial services for Ether announcement suggests the company is on track to offer the popular cryptocurrency for trading to institutional investors later this spring. More consequentially, by offering custodial services for Ether, Prometheum is claiming that Ether is a security—a critical question that the SEC has yet to decide on—and doing so as a FINRA- and SEC-regulated business.\n\n“You have to be able to custody before you trade,” Aaron Kaplan told Fortune. “This is hopefully going to move the ball forward.”\n\n‘It’s a gamble’\n\nFortune spoke with four lawyers and academics with expertise in digital asset regulation who agreed that Prometheum’s custody launch could lead the SEC to finally rule on Ethereum’s legal status, especially because Prometheum prominently displays its registered status with the two organizations on its website—a decision that Boston University lecturer Mark Williams described as “marketing.”\n\n“It’s a gamble,” Williams told Fortune. “Maybe it’s part of their business strategy to force the hand of the SEC.”\n\nWilliam Brannan, vice chair of the crypto practice at Lowenstein Sandler, said that Prometheum would be creating “unnecessary controversy” by announcing Ether as the first asset it would custody, given the SEC’s reluctance to take a stance on it.\n\nEven though Prometheum’s primary regulator is FINRA, which operates separately from the SEC, Brannan said FINRA likely would be working with the SEC on the question of Prometheum’s launch of Ether custodial services, owing to the decision’s magnitude.\n\n“My hunch would be that, particularly for these types of issues, FINRA is in very close contact and consultation with the SEC, and would likely be liaising with them and seeking to get some clarification on their position,” Brannan told Fortune.\n\nAccording to a company spokesperson, since Prometheum received the special purpose broker-dealer license from FINRA, it doesn’t require further approval to make assets available for custody, but it has informed FINRA of its plans to offer services for ETH.\n\nSpokespersons from FINRA and the SEC both declined to comment when reached by Fortune.\n\nIf the SEC took action to stop the offering, it would likely come after Prometheum launched its custodial services for Ether. Still, Ron Geffner, a partner at Sadis & Goldberg and a former SEC enforcement attorney, said that he does not expect the SEC to block Prometheum’s approach given Gensler’s stated desire to find a company that can operate under the SEC’s preferred guardrails. “The SEC, given their position on crypto being a security, wants successful registrants in the marketplace that are complying with federal securities laws and supporting their position,” he told Fortune.\n\nThe question remains whether Prometheum can draw investor interest—and whether its approach will survive subsequent SEC administrations. The Kaplan brothers argue that creating a compliant approach will drive institutional participation in the crypto industry, although they haven’t specified if the trading platform has potential clients lined up. Williams expressed skepticism that Prometheum would pull off its bold move. “They’re not market-tested, so I would just have some caution in regard to their ability,” he told Fortune.\n\nBut even if Prometheum can’t drum up demand, or running the operation proves too expensive, a successful launch could upend the industry’s argument that crypto is incompatible with existing securities laws. And that clarity, Brannan said, wouldn’t be the worst thing.\n\n“There’s a certain degree of value,” he told Fortune, “in just knowing exactly what the rules of the road are.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOS2VLTmNsNV8yRzVScmhCYWlmc3Z0bUZ1TG91aE9SZGdIRmpvc3JNVDdMdFdwWm44M2dhUUh2VUJ5X2tvZlZTTnBnS01JVGdwUm11WGpZUUlUWkpJSC1DdjNEcFcwQm1yRUd3MUk4N2lFT012T1dyYmZjMlg1Y0ZvLTB2VElkR2xDRmFLU1pYR3BodWRZcHhxQ0NMcjNhLW9NS3l0ZGhJSF9LVDVxNVlHOFpSNVdab0ty0gG-AUFVX3lxTE1uSkJNRDZfYkRlUGJ5V0xNSl84NFlHYTRGUmNlOU9FZUJBUW91bHdQOVdPdWpMbVlNV2gxVjk4cm43TE5vc1o0UU1ReC1KMjVlemwycHdkWjBzSnpWUGlUXzU0MW9RRVJaX3VUV3AzeTVNMXJmQXhDT3g5bGJkbzVJUEg5bUFUUDJPLWVMTDNuZDRGT01LdnRrYnZ5eXd3VTRTTWhsM1IwNldEN20tYVNPUkJWS3Qwd3haa1NZUUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Developers Target March 13 for Milestone 'Dencun' Upgrade on Mainnet - CoinDesk",
        "content": "The inked-in date for Dencun means that the upgrade will go live later than the developers had initially planned for. They originally targeted it for the end of 2023, but due to technical delays, the upgrade was pushed to early 2024."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbUcxMFpBQmtDc2NmV0E3UEYyVjJnT1lwaVBDVU1NZkZBcHRsUE9kQUR0bGFjMnRBMUlXTUpsZGpyOHVwSWkxLUZIc0NDLUFHOFVqck1OWklEMHlDMjY3QXVUdDU5X1FPSGxZWXBmN1hQTEswWi1mS2NrYjdVNktIam1XQVB3RUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Expected In May: How Will ETH Price React? - Yahoo Finance",
        "content": "In early 2024, the Securities and Exchange (SEC) approved the launch of over 10 spot Bitcoin exchange-traded funds (ETFs) in a landmark decision. In the months leading up to the announcement, the price of Bitcoin rose dramatically, going from less than $30,000 in late October to above $48,000 in early January. Additionally, the ETFs attracted tens of billions in investment.\n\nThough this decision was limited to Bitcoin, the ruling opened the door for the possibility of other spot ETFs. Perhaps the most anticipated is Ethereum, the second-largest cryptocurrency by market capitalization.\n\nIn 2023, Ethereum had a strong year, appreciating nearly 100%. However, these gains are much smaller than Bitcoin, which appreciated over 150%. Some believe that the hype surrounding the Bitcoin ETFs, as well as other factors, propelled both Bitcoin and Ethereum higher and higher throughout 2023.\n\nDon't Miss:\n\nHowever, the price of Bitcoin dropped off sharply after the approval of the ETFs. While it has begun to slowly recover, it is still far from the highs it saw on the first day the spot ETFs traded. While this fall in price could be for several reasons, most believe it to be a sell-the-news event, as the approvals were largely known and there was some profit taking on certain ETFs, such as Grayscale Bitcoin Trust (GBTC).\n\nEthereum ETFs could also be a possibility soon. According to Standard Chartered, the ETFs could be approved on May 23. This is the final deadline for the first wave of applications. This is notable as the Bitcoin ETFs were approved on the final deadline.\n\nTo support its case, Standard Chartered looked at the SEC's stance on ETH. The SEC has not classified ETH as a security in other filings. Additionally, the Chicago Mercantile Exchange (CME) has a listed and regulated ETH futures contract.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nWhile this seems to be positive for both the potential approval of an ETF and ETH in general, there is no guarantee that it will be approved.\n\nAnother interesting piece to consider is the planned Ethereum upgrades, expected to go live in the first quarter of 2024. The upgrades are set to focus on scalability, speed, security and a whole host of other features. The last upgrade was in April 2023 and provided a slight boost to the price.\n\nStory continues\n\nCombining the different variables of the potential for ETF approval and price a runup ahead before May, as well as the planned Ethereum upgrades, it is hard to say exactly where the price of ETH will go. Drawing from the outcome of the Bitcoin ETFs, it might not be unreasonable to see a sharp price increase over the next several months before a sell-off in May. Standard Chartered predicts that the price of ETH could increase to $4,000 by May 23.\n\nOn the other hand, the market may look back at the Bitcoin ETF saga and change the second time around. In this case, a starkly different situation than with the Bitcoin ETFs could occur.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum ETF Approval Expected In May: How Will ETH Price React? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZXkwSHd2T3d3TmVmTF8tc3NqSEQtd1VmUzhOZUxNMEl4eHRzb1JLX0ZWTnJIbkk1RGJBM1lMdEJmcHB2dWR2WGZYWFMyUmVOUU5FVWF6S0s0d1ZWbTdtU0U5NWtsUjRlQ1cxQmlwZ3N3UDdyUElubjA3Skp2WE92aGM5UkZqQXVKelA4SDRtOV84eGE5ZWF5d2F1U1lQa2k3WndwQTVSbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Developers Set March 13 for Ethereum’s Major ‘Dencun’ Network Upgrade - Unchained",
        "content": "Dencun, which will introduce “proto-danksharding,” is the most substantial update to Ethereum since last April’s “Shapella” upgrade.\n\nDencun will introduce a new feature that is expected to reduce the cost of transacting for layer 2 rollups.\n\nEthereum developers have set the activation of the next network upgrade called “Dencun” for March 13. Dencun will introduce a technical feature called “proto-danksharding” and stands as the most substantial update to Ethereum since the “Shapella” upgrade last April that allowed people to withdraw their previously locked staked ether for the first time.\n\nRead More: Battle of the Blocks: PoW vs. PoS\n\nA hard fork for the second-largest blockchain by market capitalization, Dencun, if adopted by the majority of node operators, will irreversibly change the underlying code of Ethereum. The name Dencun combines “Deneb,” the name of a star in the Cygnus constellation, with “Cancun,” where Devcon 3 took place.\n\nOne of the most widely-discussed changes is the upgrade’s “proto-danksharding” feature which introduces a new type of transaction involving “blobs,” a memory space for storing transaction data. The advent of blob-carrying transactions is expected to reduce the cost of transacting for layer 2 rollups like Arbitrum and Optimism.\n\nRead More: What Is Proto-Danksharding?\n\nSoftware developers decided on the date on Thursday morning at their biweekly Zoom meeting focused on coordinating changes to the blockchain’s consensus layer, the component of Ethereum dedicated to establishing agreement among network participants over the state of the network.\n\nThe announcement comes one day after Ethereum developers successfully triggered the upgrade on a test network named “Holešky.” Test networks are instances of blockchains where developers and users can experiment with changes to the functionalities of the network without affecting the real, live network.\n\nThe price of ETH, the native cryptocurrency of the Ethereum blockchain, has increased 2% in the past 24 hours to $2,435 at the time of publication, data from CoinGecko shows."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9EVGtDbjZVN1JIY1dTQ1ZfZFBnYVkxSXdHMXlyc0FNWElwZmgySFBiR0gtbVZuVWhjelRXdHVDRTJTSHRtRHBSRlF2MzVzS2pud2NEcC15SGFNS2QyTUZrWW14VDhXUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 19:18:33 GMT",
        "title": "Ethereum’s Dencun is now live on the Holesky testnet - Blockworks",
        "content": "Ethereum’s Dencun upgrade, featuring “proto-danksharding,” has successfully run on the Holešky testnet.\n\nHolešky replaced Ethereum’s Goerli testnet, widely used to test validating and staking, in September last year, though it did not officially enter its “end of life” status until January this year.\n\nTestnets refer to a copy of the blockchain network which are used by developers to test smart contracts and protocols before they deploy on mainnet.\n\nRead more: Ethereum’s Holešky testnet launch hits a speed bump\n\nPrior to running on Holešky, the Dencun upgrade also ran on Ethereum’s Goerli testnet and Sepolia testnet.\n\nFollowing the successful fork of each of these different testing environments, Ethereum’s development team is now figuring out a time to run the Dencun upgrade on Ethereum mainnet.\n\nLoading Tweet..\n\nWhat’s so special about the Dencun upgrade?\n\nThe Dencun upgrade will enable proto-danksharding — introduced in Ethereum Improvement Proposal (EIP) 4844 — to the Ethereum blockchain.\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nNikolay Angelov, head of blockchain at Nexo, told Blockworks that EIPs carry enormous, potentially institutional weight in the digital asset space.\n\n“Over the years, Ethereum has accommodated thousands of projects that utilize the network and its specific layers to create a diverse ecosystem of some of the most founding projects in the industry, [like] Tether,” Angelov said.\n\nHe notes that changes and enhancements to this foundational layer would require technological precision and synchronization across deployment.\n\n“In that sense, the testnets’ role is to mirror the mainnet’s functionalities by encouraging and committing to public testing of the deployment is a testament to the magnitude of Ethereum Upgrades,” he said.\n\nIn the case of EIP 4844, Ethereum will be introducing a new transaction type, which involves “blobs,” or sharded data, that can live on the beacon node for a short period of time.\n\nEthereum rollups today must put raw transaction data onto Ethereum using something called “calldata.”\n\nWith the introduction of EIP 4844, rollup block submitters will instead be able to put this data into blobs. This will guarantee data availability and will also be much more affordable than calldata.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nData availability in blockchain refers to the process of storing data for a set period of time to ensure that all network participants will be able to access and retrieve it so that they can challenge whether or not the data is accurate.\n\nRollups only need this data to be available once and for a set period to give honest participants enough time to construct the rollup state and verify its accuracy.\n\n“While Ethereum has rightfully suffered from criticism over fees and processing times, the\n\nDencun concepts of proto-danksharding and “data blobs” have the mission to address and overcome those,” Angelov said.\n\nHe notes that should the upgrade on mainnet be successful, Ethereum will be able to manage data throughput and network costs much more efficiently, giving it a competitive advantage over other layer-1 solutions.\n\n“Ultimately, it is the ability to onboard new protocols into a much freer-flowing environment and move capital at lower costs that will ultimately enhance cryptocurrency adoption by delivering a more economically feasible, highly-scalable on-chain solution,” he said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4xb0s1blJOMV9qempyYlZXNWk5Y0NFbWpnNEpBbG5OQmpreHM1YzluVFFLbXhseVB6ZjBMeHhxYlBEby1oVGFHRC1uZVg4cElKOUFnXzAwYWV4SEI5b3ZIQ2daQjg2TDllU0Nocy1idjNyY0ZN0gF8QVVfeXFMTnd3QlVtZ1dvTDVMY1prLXZqWmtoT3lXYTV5U0ktVHVCVDJqamRmTmQ1eHV1Tno0V0pQOEJ3V1RtdXl6cUc5cGJCV3lGMkJrRDlYMkItQ19hbk5aNjh0Sm1WVkphcldhRjdIdXFIUHhSVkdjV1YtZ3JoaHkxRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Staking Booms, With 25% of All ETH Locked Up - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA quarter of all Ethereum (ETH) in supply is now being staked, data shows. According to figures from blockchain data firm Nansen, over 30 million ETH—or about $74 billion worth of the cryptocurrency—has been locked up.\n\nStaking is the process of “locking up” digital coins or tokens to help keep a blockchain network running. Proof-of-stake assets like ETH require users to pledge their coins to the network by sending it to a specific blockchain address. Those who stake earn token rewards in the process.\n\nLast year, the Ethereum network was upgraded, allowing users to easily withdraw staked ETH. Since then, liquid staking protocols have boomed—allowing users to seamlessly lock up and withdraw their crypto.\n\nAs ETH enthusiasts eagerly await the approval of an exchange-traded fund (ETF) that brings the second-largest digital asset to Wall Street, applicants are talking about staking in their proposals. Yesterday, investment firm Ark 21Shares amended their spot ETH ETF S-1 to mention the practice.\n\nAD\n\nAD\n\n“The sponsor may, from time to time, stake a portion of the trust’s assets through one or more trusted staking providers,” the filing read.\n\nStaking is controversial with regulators, though: The U.S. Securities and Exchange Commission has fined major crypto companies—such as digital asset exchanges Kraken and Coinbase—for allegedly selling unregistered securities via staking services.\n\nThe Ethereum network is in the process of an upgrade, too. Developers this week finalized the Dencun upgrade on a testnet. It is now expected to go live on the mainnet by March 13.\n\nDevelopers claim that Dencun will solve the scalability problem of the network behind the world’s second-biggest cryptocurrency—which is slow and expensive—so that it will potentially be able to process over 100,000 transactions per second in the future.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5xRXgwaHdIUWlnM0FHY2FacFpxMXUwdTR3R1VXSmdTMmJnMVlnUHhRUlZSa1BEejJLZndoZnZOd0tLd042RzZDZUY5amNtV1luYWRyNzNHcTFZSkVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Avalanche Vs. Ethereum (2024 Edition) - Securities.io",
        "content": "Every day, more investors show interest in the smart programmable blockchain sector. These networks enable developers to create immersive and unique Dapps to service the market. As such, they are incredibly popular. Both Avalanche and Ethereum are major contenders in this field. Here's everything you need to know regarding Avalanche (AVAX) vs Ethereum (ETH).\n\nWhat is Avalanche?\n\nAvalanche is an advanced DeFi (decentralized finance) enabled protocol. The network leverages a multi-chain approach to reduce fees and improve programmability. Avalanche was built to help alleviate many of the problems Ethereum developers encounter, including scalability issues. As such, it has specific features geared towards onboarding developers from Ethereum to the Avalanche system.\n\nAvalanche was created by Ava Labs, which is led by Cornell researcher Emin Gün Sirer. The project's mainnet officially launched in September 2020. The team behind the Avalanche project went to great lengths to ensure the protocol had far superior scalability than Ethereum and was easy for users to navigate and leverage.\n\nWhat is Ethereum?\n\nEthereum changed the crypto market forever as it was the first second-generation blockchain to enter the market. This protocol was revolutionary as it demonstrated the concept of smart contracts. As such, Ethereum has been a pioneering force in the market. It has helped to drive innovation with the launch of the ERC-20 token standard and more.\n\nToday, Ethereum operates as the largest and most diverse DeFi ecosystem in the world. It’s also the largest Dapp network in use. These facts make Ethereum one of the most important blockchain in the market.\n\nWhat Problems Was Avalanche Built to Alleviate?\n\nAvalanche was built to reduce many of the problems faced by Ethereum users. The protocol combines 3 separate blockchains to accomplish this task. As part of this strategy, the network introduces a multi-language approach to programming. Specifically, Avalanche developers can program smart contracts using multiple virtual machines.\n\nAnother problem that Avalanche helps to alleviate is Ethereum’s lack of support for compliant Dapps. Compliant Dapps are protocols that follow complex rule sets. These rule sets are usually a part of some regulatory requirement. The Avalanche network enables developers to determine how each asset is traded, shared, and hosted for the project's life, making it ideal for Dapps servicing highly regulated industries.\n\nWhat Problems Was Ethereum Built to Alleviate?\n\nEthereum was designed to fight centralization. The network was the first to support smart contract programmability and Dapp creation. As such, it has served a vital role in demonstrating how decentralized networks improve on their centralized counterparts. The system was designed to be flexible from day one. Developers can create Dapps using multiple programming languages, including C++, Java, JavaScript, Python, Ruby, and more.\n\nHow Does Avalanche Work?\n\nAvalanche combines three separate blockchain networks to achieve superior scalability and functionality. The protocol operates as a frictionless payment system, cryptocurrency, and DeFi ecosystem. The 3 blockchains, the X-chain, C-chain, and P-chain all serve different roles in the network. Together they empower Avalanche developers to create more robust Dapps.\n\nX-chain\n\nThe X-chain is the network that is responsible for the issuance of new digital assets. This network supports the creation of new tokens, NFTs Non-fungible tokens, stablecoins, and more. Users can utilize AVAX to collateralize these assets.\n\nC-chain\n\nThe C-chain is designed to improve Ethereum developer onboarding. The developers describe this network as a conversion chain. It features a bunch of protocols to help Ethereum developers seamlessly convert their Dapps to Avalanche.\n\nP-chain\n\nThe P-chain is responsible for monitoring and validating the state of subnets. These Avalanche-powered blockchains can be set up to meet nearly any need. P-chain is also responsible for hosting many of the network's DeFi features such as its staking protocols.\n\nHow Does Ethereum Work?\n\nEthereum operates as a layer one blockchain. Notably, Ethereum isn’t a cryptocurrency, as many believe. It's the network that Ether (ETH), the network's utility token, resides on. It leverages a network of participants known as nodes to compute smart contract equations and host data. For their efforts, these nodes receive rewards in the form of ETH based on their contribution level.\n\nAvalanche Consensus\n\nAvalanche integrates a Proof-of-Stake consensus mechanism. PoS systems are far more energy-efficient than PoW systems because they don't rely on miners to remain valid. Instead, users stake their AVAX to qualify as Validator nodes. These nodes run virtual machines and add blocks of transactions to the blockchain.\n\nAvalanche (AVAX) vs Ethereum (ETH)\n\nPoS systems are more democratic than PoW systems because they don’t require users to purchase expensive mining equipment or compete against each other to earn rewards. In a PoS system, users simply stake their tokens in a network wallet to help ensure the system remains secure.\n\nEthereum Consensus\n\nWhile Ethereum originally utilized a Proof-of-Work (PoW) mechanism known as the Ethash algorithm, it has since transitioned to become a Proof-of-Stake (PoS) network. This event, which occurred in 2022, was viewed as a major upgrade, often referred to as the launch of Ethereum 2.0. It marked Ethereum's shift towards greater energy efficiency, scalability, and security.\n\nValidators are now responsible for processing transactions and creating new blocks, requiring a stake of 32 ETH for participation or the option to join a staking pool. This transition signifies Ethereum's commitment to sustainability and long-term scalability improvements. As such, users can stake their Ethereum to become Validators. To become a validator on Ethereum, you need to stake 32 ETH. If you don’t have this much ETH, you can leverage mining pools to combine your tokens with others and split the rewards.\n\nScalability\n\nIn terms of scalability, Avalanche is the clear winner. The network's multi-chain design provides excellent linear scalability. The protocol is capable of sub-second transaction times. According to company bench tests, Avalanche can support up to 6,500 transactions per second and can scale to millions.\n\nEthereum can handle around 15-45 transactions per second (TPS) in its current state. It takes 35 network confirmations to finalize Ethereum transactions. By transitioning to PoS, Ethereum has opened the door to advanced features like sharding, that will, in time, vastly improve its TPS ability.\n\nFees\n\nIn terms of gas fees, Avalanche wins again. The network provides developers and users with some of the lowest fees of any programmable network. Users pay minuscule fees for minting new assets and creating blockchains. These fees are then sent to a burn address. These actions help to bolster the price of AVAX as they reduce the total supply of the token in circulation, which helps drive up demand.\n\nThe Ethereum network fees increase when it becomes busier due to the technical structure of the protocol. Ethereum is set up to increase fees alongside congestion as a means to reduce spam posts from the blockchain. However, the recent explosion in DeFi protocols has meant that the majority of traffic on the Ethereum blockchain isn't spam but rather legitimate platforms. As such, this system has become counter-productive.\n\nDeFi Features\n\nAvalanche provides users with full DeFi functionality. The protocol supports all the latest features, including peer-to-peer lending, staking, farming, and more. All DeFi rewards are paid out in AVAX, which can then be added to the primary staking balance to improve returns. In the end, you create a wealth-generation cycle using this approach.\n\nEthereum is the largest DeFi network in the world. Despite its technical limitations, Ethereum has managed to support every DeFi service created. The network enables users to interact within the entire ERC-20 ecosystem in a seamless manner. All ERC-20 compatible apps can leverage the growing number of DEXs, DeFi lending protocols, staking, farming pools, and more.\n\nAvalanche (AVAX) vs Ethereum (ETH)\n\nTokens\n\nAVAX is the main utility token for the Avalanche ecosystem. This flexible token can be used to pay fees, send value globally in a frictionless manner, and collateralize new assets and blockchain. Avax features superior scalability when compared to ETH. The token can also be staked to secure low-risk rewards.\n\nETH is the primary utility token of the Ethereum network. This token's purpose is to pay for instances of the EVM (Ethereum Virtual Machine). ETH is one of the most popular tokens in the market. It's listed on nearly every exchange and is among the most popular tokens in the world. You can use ETH to participate in ICOs (initial coin offerings). It's also used to compensate validators for their support.\n\nHow to Buy Ethereum (ETH) and Avalanche (AVAX)\n\nCurrently, both Avalanche (AVAX) and Ethereum (ETH) are available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong..\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry with over 9,000,000 users, and over $207 billion in quarterly trading volume.\n\nThe Kraken exchange offers trading access to over 190 countries including Australia, Canada, Europe, and is a top exchange for USA residents. (Excluding New York & Washington state).\n\nUpdated Tech vs. a Massive Community\n\nThe battle between Avalanche and Ethereum is nowhere close to over, and both networks have bright futures. For now, both of these projects are a smart addition to anyone’s portfolio.\n\nLearn More\n\nTo learn more, visit our Investing in Avalanche and Investing in Ethereum guides."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9EVm9TVlNVbGlJemJjSWtVZnJoeGlsd19OZ0JBeVlkNUQwUVlJeURRZ3BjcTMzUnVDZ2w0cmlPNXdpT3dwanBqbXpfVDdCc0RtNEpwY1E0Qy0xemZSYVBRQnJQZk94Z3FGOTlOaUlyVHRycFZ3ZHR3aW5Jenlndw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "UBS issues tokenized warrant on Ethereum blockchain - Ledger Insights",
        "content": "Today UBS announced the issuance of an investment-grade tokenized warrant in Hong Kong on the Ethereum public blockchain. It used the UBS Tokenize issuance solution. It was a call warrant on Xiaomi stock and was sold to OSL Digital Securities.\n\n“The introduction of the UBS tokenized warrant reinforces the bank’s position as the leading derivative products issuer in Hong Kong,” said Winni Cheuk, Head of Sales, APAC Public Distribution, UBS Global Markets. “Created natively on a public blockchain in a permissioned environment, this innovative product enhances transparency, reduces transaction fees, streamlines settlement processes, and allows for more flexible trading hours.”\n\nUBS has long been active in the institutional DLT space – it was cofounder of the institutional payment system Fnality. Recently it has been flexing its muscles in web3.\n\nUBS’s expanding tokenization initiatives\n\nIn late 2022 UBS Wealth Management issued $50 million in digital debt securities to Asian high net worth individuals. That was followed last year by the Bank of China Investment (BOCI) issuing digital structured notes on Ethereum using the UBS Tokenize platform.\n\nAdditionally, UBS participated in multiple public blockchain trials as part of Singapore’s Project Guardian. One involved a pilot for a tokenized money market fund issued on Ethereum. Another was for cross border repo – the sale and repurchase of a natively issued digital bond on a public blockchain. SBI and DBS partnered for the experiment, which spanned Japan, Singapore, and Switzerland.\n\nBeyond public blockchain trials, UBS is in production with intraday cross border repo. It was one of the first banks to adopt Broadridge’s Distributed Ledger Repo (DLR), a permissioned blockchain infrastructure. A few months before the Project Guardian repo, UBS used DLR for a cross border intraday repo involving an Asian bank.\n\nIn related news, UBS is one of the five banks participating in Hong Kong’s second government digital green bond issuance. Goldman Sachs’ tokenization platform was used for the first bond, with HSBC’s Orion for the second. Hence, UBS Tokenize could be used in a future issuance."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4TVI1bXdxQUhaMlJ3cTlzVm1LNUtDQXdzeElvTUloRjlrLU1XLVBPeWpaNlpLa2RLNUg3V1F3VEhQUDV2c28zN0NyaVlaWmVXRVVVTlhYakRtNmloM01lSVp6NVlOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "What is Ethereum fragmentation? - Crypto Briefing",
        "content": "Share this article\n\nEthereum’s evolution is marked by the adoption of Layer 2 scaling solutions (L2s), designed to alleviate the network’s congestion and high transaction fees.\n\nL2s operate on top of Ethereum (Layer 1 or L1), processing transactions more efficiently before finalizing them on the main chain. However, this has led to a new challenge: each L2 functions in its isolated environment, creating silos that hinder interoperability—a state we refer to as fragmentation.\n\nWhat is Universal Synchronous Composability (USC)?\n\nThe core issue with fragmentation is the loss of “universal synchronous composability” (USC), a feature allowing different applications to interact with each other seamlessly in real time. Imagine Ethereum as a bustling city where roads (L2s) connect buildings (applications).\n\nFragmentation is akin to having roads that don’t interconnect, forcing you to take a long detour to move from one building to another.\n\nThe proposed solution, “shared sequencing,” is like establishing a city-wide transit system that links all roads, enabling direct travel routes between any two points without detours.\n\nTo further simplify, consider shared sequencing as the internet of Ethereum. Just as the internet allows different computers to communicate directly regardless of their physical location, shared sequencing enables different L2s to interact seamlessly. This system removes barriers, allowing for immediate transactions across the network, akin to sending an email from one side of the world to the other in seconds.\n\nTechnical Explanation of Shared Sequencing\n\nShared sequencing coordinates the order of transactions across all L2 solutions on Ethereum. It uses a centralized mechanism to sequence transactions identically across different L2s without requiring major infrastructure changes.\n\nShared sequencing leverages Ethereum’s existing data availability capabilities. It proposes adding functionality for L2 solutions to sequence transactions in a unified manner. By sequencing transactions in the same order everywhere, shared sequencing enables instant interactions between L2s across Ethereum.\n\nPotential Use Cases for Shared Sequencing\n\nAdopting shared sequencing could revolutionize Ethereum. It would enhance liquidity and reduce transaction costs by enabling seamless communication between L2 solutions. This would eliminate the need for complex bridging between L2s.\n\nShared sequencing could enable more robust decentralized applications (dApps) and services that integrate across L2s. This would improve user experience and accessibility. By restoring composability across L2 solutions, shared sequencing would strengthen Ethereum’s network effects and dominance as a platform for blockchain applications.\n\nThe Road Ahead for Ethereum’s Ecosystem\n\nWhile Ethereum’s journey through fragmentation may resemble a challenging phase of growth, the horizon holds promise for a unified and efficient ecosystem. Shared sequencing represents a leap towards realizing this vision, offering a roadmap to re-establish Ethereum’s composability and network effects.\n\nAs we look to the future, continued innovation and collaboration within the Ethereum community will be pivotal in overcoming current limitations and unlocking the platform’s full potential. Through these efforts, Ethereum can evolve into a more interconnected and powerful platform, paving the way for the next generation of blockchain applications."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE03NERqTmVuaThtelZZVUw5bGxRb0RYVU5rZ1FsLTl4R0xmZ25KNXFKWnl3bE5McEMwalpOM0RObVlXNmpyVnFzaEdKVjhoTjk3S2JMUXZ3VXFnZzViUGtoQ2Y5QjVoMW5kSGJ0T193Vk01dlRqZ05Tam5Sb9IBgAFBVV95cUxOa2puU3JLNzlfdjhKTC0xN1VMNW9MQmk1NTI3ZzJISDRYM1BINHVpZ1hTZjEtNmdaczV3NUNtSUVaSWwtdUJaMDRMZnA3UXlXNVRlOEVRNkhEZURKZ3hvTDNDLXVjd3dwV3Jmc3FOMGRJZ0Vtc0JpN0Vua0lpUzNpSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Key Reason Why Ethereum Might Be Classified as Security - U.Today",
        "content": "Advertisement\n\nPrometheum plans to offer custodial services for Ether, aiming to comply with existing laws and potentially influence regulators to classify Ether as a security. This contrasts with the SEC's current stance on Ethereum.\n\nPrometheum's strategy could lead to the Securities and Exchange Commission (SEC) refining its stance on Ethereum, potentially giving Prometheum a competitive advantage in the marketplace, as reported by Fortune.\n\nA different approach\n\nPrometheum, a new player in the crypto industry, has taken a unique approach to regulation by obtaining approval to operate an alternative trading platform and as a special-purpose broker-dealer for digital asset securities.\n\nThis approach marks a departure from the perspectives of major cryptocurrency exchanges such as Coinbase and Kraken, which are advocating for amendments to the prevailing regulatory frameworks.\n\nAdvertisement\n\nPrometheum's plan to offer Ether custody services may force the SEC to decide on Ethereum's legal status. While controversial, the move showcases regulatory compliance. Hence, Prometheum's success could redefine industry regulations, providing much-needed clarity.\n\nGensler's ambiguous stance\n\nThe stance of SEC Chair Gary Gensler on this matter has been somewhat enigmatic. In a recent interview, Gensler hinted that Ethereum (ETH) might fall under the category of a security, which marks a shift from his earlier tentative positions on the subject.\n\nGensler stressed that most cryptocurrencies, excluding Bitcoin, are often developed by entrepreneurs who employ various mechanisms to market their tokens and attract investment, with the expectation of profits derived from the efforts of others.\n\nAccording to Gensler, this aligns with the characteristics of securities, thus placing them within the regulatory scope of the SEC. This perspective stands in contrast to the views of Commodity Futures Trading Commission (CFTC)."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOcy1vRkpxYkdKLUFIYl85dXhCQUpqMl85eHBxNFB0Z3FGQzlyeTF2R0NhdEhKaHB1RlhSc1cxMVBocnFRb0Fkdk1nMmRZaVF2MnRjM3I4a29UaFZwRFdfemJFeF9RYVJxQmFLS2h3UDZDSTBWZnFGOXpNTmRYYUFEenZBODM1NjR6dG5odDUxNjlTN2FXbUF5MmhwR0dISk9rd2lHVTZQeGFPT0Z1R2kzbDJDSm5NVzdoRUJ3SWRzV0JLQzBQ0gHKAUFVX3lxTE9sZzR0alY4eUZzZXd0LWhIQ0g2UTdBRmltYkNPRElvM1JVcGxGUmpTVWJUWmkyODBKY1FQVlJ2ZlJjN3YtMHN3UU5zYW5MQUJCMVJKMUlVWE1raEdIYXlDaHpQOTluUWRDRHdjd1BVSjM3Z3BCYmxyVDN5WW1QbWdYdEZUWmZEbHRraHdpb2JNQm80bXNzRTBBdFkwb3FuQ1JlZnd0UFl0Zkg4dUJJRVRFdmxoSlotMU8wbXRRRV9KaTl6cU9LT2NZaGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Prometheum, the Only U.S.-Registered Crypto Platform, Picks Ether as Its First Product - CoinDesk",
        "content": "At that point, the company will either be proving the claims of its executives that crypto can be handled in the U.S. in a way that appeases the securities watchdog, or proving the naysayers who argue that it's impossible to meet the SEC's expectations. The stakes aren't just high for Prometheum and the rest of the industry, but also for the government agency that has claimed for years that there's a proper way for crypto firms to \"come in and register\" to do business in the U.S.; Prometheum came in and registered but what happens next is unclear. And while it tests these murky waters, it may also help establish whether the SEC intends to view ETH as a security."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOQWdDdjFEMlJzRXA5UG4zTnhWWU5JUDZ5OVI2SHMwTVlva25XeXJuSFZaSUFqLTJzY2dpRkh2a0c3WE5SemR5SW5Bdmt2eHZjS0ozOURsRmttX2tYbjd6ZHZQSGp2OWhkMjlPMmk4c2F2VGRzNF9CTzZpcmZFMXdram9nS2xNdXNPZzVRYmV6WHlUeXBBVlA4QWdlUHJwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "The plot to make Ethereum a security—and what happens next - Fortune",
        "content": "Regular readers of this newsletter know I am no fan of Prometheum, the off-brand crypto firm that claims to have found a “compliant” way to offer popular cryptocurrencies under existing securities regulations. Operated by two brothers with a dubious legal pedigree, Prometheum took another step this week in its cockamamie scheme to get Ethereum declared a security and become the only authorized dealer for it. The crazy thing is that the scheme just might work—for a minute at least.\n\nThe latest development is that Prometheum just announced it will begin to custody Ethereum. This is hardly unusual—lots of firms custody crypto assets—but for the fact that is the only company to possess a special license that lets it hold and transact in digital assets. The legal gymnastics are complicated (Leo Schwartz has an excellent rundown), but a very simplified version is that Prometheum also has a license to operate a trading platform, and that, by combining the two licenses, it can legally sling Ethereum as a security—and is hoping regulators have no choice but to recognize the designation.\n\nAll of this goes against the legitimate claims of the crypto industry, which argues that blockchain is a new technology that obviates the need for the division of functions that exists in traditional securities regimes. It’s also ironic that would-be crypto pioneer Prometheum doesn’t appear to have spent a lick on technology, but reserved its entire outlay for legal and PR expenses. Still, if you squint your eyes, you can sort of see why the combination of the company’s two licenses amount to a legal right to offer Ethereum as a security.\n\nThe question, though, is how it came to get one of those licenses—in particular the special custody one—in the first place. The answer is that the self-regulatory body called FINRA gave it to them. FINRA is nominally independent but still ultimately beholden to the SEC, which created the special license in the first place, and this is where the plot gets thicker.\n\nThe special crypto license, you see, was created right before current SEC Chair Gary Gensler arrived on the scene—it wasn’t Gensler’s idea. That’s probably why, during Gensler’s tenure, the subordinate FINRA refused to grant the license to anyone, until suddenly Prometheum got its hands on one at a very convenient time—right before firms were to testify before Congress on the futility of current crypto regulations. And wouldn’t you know it, Prometheum received a plum invitation to testify. This resulted in one of the brothers giving canned testimony that echoed Gensler-style talking points about how it is possible to operate within the regulations.\n\nHmmm. I don’t think it’s crazy to surmise that Gensler, in his scorched-earth legal campaign against the crypto industry, leaned on FINRA to give Prometheum the special license it had denied to every other firm, including publicly traded Robinhood. Having Prometheum out there selling Ethereum as a security would suit Gensler’s purposes, and it’s also telling that FINRA has stayed conspicuously silent about this new “compliant” crypto firm born under its watch. Sure, it might sound conspiratorial to think the wily Gensler is pulling all the strings here. But first read this thread and tell me everything is on the level.\n\nThe question now is what happens next. If Prometheum actually goes ahead and starts hosting a platform where popular cryptocurrencies are securities, the whole thing is going to be short-lived. The crypto industry will find every way it can to attack the flimsy legal theory on which Prometheum is premised, and get Gensler’s SEC rung up in court again for being “arbitrary and capricious.” Meanwhile, it’s unclear where Prometheum is going to find customers to use its jerry-rigged platform—especially with Ethereum ETFs on the way. The most likely outcome is that the company soon blows away and with it the Prometheum brothers’ 15 minutes of crypto fame.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBaakt, the ill-starred crypto venture launched by stock exchange giant Intercontinental, says it is almost out of cash while its share price is barely above $1. (CoinDesk)\n\nRansomware criminals extracted $1.1 billion of crypto payouts in 2023, a record amount after law enforcement actions the previous year resulted in an unusual decline. (Chainalysis)\n\nBitcoin surged close to $45,000, its highest figure since the ETF launch on Jan. 12, in a rally driven by whale purchases. (CoinDesk)\n\nDCG filed an objection to Genesis Global’s plan to exit bankruptcy on the grounds that its effective date doesn’t account for a jump in Bitcoin prices, and will shortchange equity holders. (WSJ)\n\nChinese Bitcoin miners are flocking to Ethiopia, lured by a friendly government and some of the world’s lowest energy prices, even as half the country lacks access to electricity. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nSad but true:"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBXYkZTUnFHVGZvWWZBWVRaYXlzVDN3RWU1YWJWT0l1aThZUTg5cXExQXVkcGFyNWxPeHlVTEFpZTF4VkxzOEp0OE1GUTFTbUtkRjl4MnVocTVCUUVDckg3NU9vZ2VKbXVVLXU40gFzQVVfeXFMT0xvbDVWdFpBekJrNHotRjFLYVR0RDgzeEhfOWpMY3RXZHVtVzluYkJxeW1TTGRqUFVFaTlnODlab3hnLUZCV2FLSnNIMXJWdi1hMWwyQVIyeDRfTDVKVE9BRHMyS3VqWW1tYXROT213d1NLdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Set for Boost as Dencun Upgrade Gets a Date - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nProto-danksharding is nearly upon us.\n\nAfter successfully performing a suite of test runs, Ethereum’s core developers announced Thursday that they plan to deploy the network’s landmark Dencun upgrade on or around March 13—finally ushering in a set of tools that could dramatically increase the speed and affordability of Ethereum transactions.\n\nProto-danksharding, known by the bureaucratic shorthand EIP-4844, is the marquee feature of Ethereum’s upcoming Dencun upgrade. The development, which has been anticipated for years and stalled repeatedly, is a preliminary version of danksharding, a process that will streamline how data is verified on Ethereum’s layer-2 networks. Instead of verifying large swaths of data on Ethereum rollups, danksharding will sample and verify tiny pieces of that information.\n\nKey to the initial proto-danksharding feature to be released in Dencun are “blobs,” which temporarily store data off-chain to minimize storage and processing costs on Ethereum.\n\nBlobs are coming to mainnet at slot 8626176 .oO — timbeiko.eth ☀️ (@TimBeiko) February 8, 2024\n\nWhile Ethereum has long dominated crypto as the leading network for decentralized apps (dapps) and NFTs, the network has been plagued by steep gas prices and lagging transaction speeds. Layer-2 scaling networks like Optimism and Arbitrum sidestepped those issues by building atop the Ethereum mainnet, but “rolling up” many transactions into a unit that is presented to Ethereum as a single transaction.\n\nProto-danksharding will make layer-2 networks even more efficient and affordable. Developers anticipate that eventually, after danksharding’s full implementation, the Ethereum ecosystem will be able to cheaply handle over 100,000 transactions a second.\n\nDencun’s introduction of proto-danksharding constitutes the most substantial upgrade to the Ethereum ecosystem since last April’s Shanghai upgrade, which allowed Ethereum stakers to withdraw funds deposited with the network.\n\nAD\n\nAD\n\nWhile that development was obviously meaningful due to the billions of dollars worth of capital it unlocked, Dencun’s implementation will, by all accounts, have a particularly substantial impact on the day-to-day functionality of the Ethereum ecosystem.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNeXRjUnpSTjNvNWdQN1VmVmpTLUZ2YW1BUFJfSUEtWjZhc1ozWGNsS2piNEdFNnM1YTZQMTEzWlk1N0lkMy1mbllpNXprd2xtaThqang2eXNoWjhHQmd2TnhOV1ppRjk2aHdLQk1vN2NsamI5Sng2czFEMVN4dWFZbTBta3phV2MwajVKODdZMjhZUnRhWHB1dkJXUERnWGtzN0hhRUFOWm1BenA0ZmxQVHpKaW8tV1luaVRJUlhMM0p1UdIBxwFBVV95cUxOeElRNFpLTTFGQUIzQ2xvVW9TNGJmWDVnU2N1NndDQVcwa2s2bEo2N1BfZTBya3dXOWw0dVMwb2FlVXFSQ1JyR0IxTGdzWHUxZkt0YnhXcFJ4SlNUV2p4SDBrSTZJRVp2NFIxNVlXMUpOUnZJbUtnSGtVb0VfaC03ay04VTZMcFdSaWFQUnRydHV0MEZfbGtZVTBiLWdSYkZRME4zQV92Y003V2lIcG12d2tJYjMzYm5Pd2kzNTkyMnVJOC1Hak5j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Polygon Releases 'Type 1 Prover,' Claiming Milestone Set by Ethereum's Vitalik Buterin - CoinDesk",
        "content": "Vitalik Buterin, the co-founder of the Ethereum blockchain, has previously written about the different types of provers, arguing that the benefit a Type 1 prover is that it is perfectly compatible with Ethereum, while the disadvantage is that there’s a lot of computation power that goes into producing ZK-proofs that are compatible with Ethereum, taking up to hours to produce."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxONEV6U05SQldPNW8wSzVUZVJMYmhJZmJKd2xJdER4OG5QQ0IwM09MeFRXNDA1WHZIR2NiTmlYUzRxWmxYX2gtTE9RZWpkdXM5WExaOVBzRjZwQVdDMnNfTXFvTkJLZjVjd1ZwMGpkWmwxSkFmZHRMd05tVUd3LUgxSDRSamNBVTBZZ3VXNG5YS08zWHlCMkdJMWtRa1JrUFNzQkNoUTV6WWpZbW5sTXJZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "SEC-registered Prometheum to offer Ethereum custodial service for institutional investors - Crypto Briefing",
        "content": "The offering may push the SEC to classify Ethereum as a security.\n\nShare this article\n\nPrometheum, a crypto trading platform approved by the Securities and Exchange Commission (SEC), is set to offer custodial services for Ethereum, initially targeting institutional clients, according to a press release published today.\n\nThe new move follows Prometheum’s acceptance as a Special Purpose Broker-Dealer (SPBD) by the Financial Industry Regulatory Authority (FINRA), which allows the company to custody, clear, and settle digital asset securities.\n\nAs reported, institutional clients, including asset management firms, hedge funds, Registered Investment Advisors (RIAs), banks, and other financial institutions, can sign up for Prometheum’s custodial services. The official launch of its custodial services is expected to come this quarter.\n\nETH will be custodied at a FINRA member firm and an SEC-registered broker-dealer. Prometheum also intends to broaden its custodial portfolio to include leading security tokens and utility-driven coins, with more details to be announced soon.\n\nAaron Kaplan, Co-CEO of Prometheum, emphasized the compliance and regulatory rigor behind this initiative.\n\n“Prometheum Capital’s custodial services, starting with ETH, are tailored to meet the stringent regulatory and compliance standards promulgated by the Federal Security Laws,” Kaplan stated. “Our unwavering commitment to compliance and investor safeguarding drives this milestone, signifying substantial progress towards establishing a new paradigm for blockchain-enabled market infrastructure.”\n\nFurthermore, Prometheum plans to expand its offerings to include trading, clearing, and settlement services for retail and institutional clients within 2024, aiming to create a one-stop shop for all market participants.\n\nRegulatory crossroads\n\nPrometheum’s new services spark speculation about Ethereum’s classification as a security. Fortune suggests it could be a strategy to pressure regulators, as the SEC hasn’t directly defined Ethereum’s legal status, unlike other cryptocurrencies. By operating within existing laws, Prometheum’s approach might compel the SEC to finally make a definitive ruling on Ethereum.\n\nThe launch of Prometheum’s custodial service could force the SEC to finally address the long-standing ambiguity surrounding Ethereum’s classification, Fortune cited legal experts."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPSl9BWjhYaGlkZ1dKVGdUeEJIUHpScDVqUkxkVVZnQW5TdmVmWnB5ZmJudnBJcUlGY0t4XzJEQnRreVNpSjJ6RDlONDNpN0lCZ25nLVdJc252Z0lFVFRsX1hhSmc4VHlMOHFfZEtGUzBkelZvSGR5T1FmT2YtbGJoaWdTbFhOamgtMHJJTC1aSl9DYkROTFVXUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum schedules Dencun upgrade for network efficiency, Layer-2 support - crypto.news",
        "content": "The Ethereum network is set to undergo the Dencun upgrade on Mar. 13, introducing key scalability enhancements.\n\nEthereum developers have set the deployment of the Dencun upgrade for slot number 8626176, aiming to enhance the network’s functionality.\n\nScheduled for activation in one month’s time, the upgrade introduces the proto-danksharding feature with EIP-4844, according to Tim Beiko of the Ethereum Foundation.\n\nBlobs are coming to mainnet at slot 8626176 .oO — timbeiko.eth ☀️ (@TimBeiko) February 8, 2024\n\nYou might also like: ARK 21Shares revamps Ethereum ETF proposal with cash creation model and staking plan\n\nThe feature brings blob transactions and transient storage to improve Ethereum’s support for Layer 2 networks like zkSync, Optimism, and Arbitrum. This allows for more transaction data without extending block processing times.\n\nIncorporating of “data blobs” through EIP-4844 is a significant step towards addressing data storage needs, facilitating the inclusion of additional data in Ethereum transactions.\n\nThe Dencun upgrade has undergone a series of test deployments on various testnets, including Goerli on Jan. 17, Sepolia on Jan. 30, and Holesky on Feb. 7, ensuring its readiness for the main network.\n\nEthereum’s (ETH) price has seen a notable rise, with an increase of 6.44% in the past week, which brings the price to $2,425.38 per ETH,"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxObGZSeGx1SWxJNVhmMVRLQkVPZVZxSzlwd253MlY0Q1RzRW1vNEp0YkNLcG44dEU5VnBpam91eTYzckk3U0k4T3VJQURmN09YTndoOEVvOUpGWVY0TS1FUFZaa1kybzl6YkI1dXAtQXQ0VG9rRnVPWjlwb3Rod1laRmlHOUI4aEpNdUVmMTZZXzV5TzJ5NVJXWTBzNkQzSjBieWFsS0dicUhlM2JmcC05c1BYNlR0UHowZFZkQWdhYzZPVFF6bHhPcNIBzgFBVV95cUxNVlp3WVYtOENhVXdyd3NISGlISWRiLVBGOEdxeWJkMjhNUG5OdHlTanh2Ympqal8wTnp0bnJBTmxZQUI2TExOSmJsUlhwblRaUzB6U3B0SndVT2hkbm9SY0lWbUxmV1FGclh5YWhja3JNSkpuYXRQT0Y3WDU5QVdHRUVaYl96Yzdia3lOMF9ab3lGV1dMcEtnM0JZZDhYWDhOckpnc1BsMk5JVldaTlZSbmlqTVVKSTBuLTgybm9pU0NZdGtSbkJrRWs1YmtiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade Reaches Final ‘Holesky’ Testnet, Starting Countdown to Data 'Blobs' - CoinDesk",
        "content": "Holesky was the last of three testnets to run through a simulation of Dencun, and was the most anticipated, since Holesky is the newest of all three testnets , with a validator set larger than Ethereum’s own network."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxORE1xX2llQ1dKTUJXbUcxNjBtRjB2U3dlU242cFI4N2hLYV96OVc1d3RHVkNkTWhuNmxtMkZDcUxrVFIxNnpZRDExSFJCaVQtN25KQlB2WTk2aG9ITXFWSXZoQzY4dzV5RlhoeUM1Y2FsWm5STVN1Tklic3p4VHRqTmdBaGszRFgt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? - Yahoo Finance",
        "content": "EigenLayer is a new liquid restaking platform for Ethereum. The protocol allows users to stake the same amount of Ether (ETH) across multiple projects simultaneously to earn additional rewards. Proponents of the technology say that it will increase capital efficiency and spur innovation. Those against the technology believe that it could cause overleveraging and is susceptible to slashing.\n\nThough the new technology is causing a debate among ETH enthusiasts, it is impossible to deny the project’s popularity. Initially, EigenLayer put a 200,000 ETH cap on each protocol so that it could test the concept without extreme amounts of volume. The limit was removed on Feb. 5. Within 24 hours, over 700,000 ETH, or over $1.6 billion was deposited into EigenLayer. According to data from DefiLlama, this brought EigenLayer's total volume locked (TVL) to nearly $4 billion, which is over 1% of all Ethereum in circulation. For comparison, EigenLayer had less than $300 million in TVL for most of December 2023.\n\nDon't Miss:\n\nWhile the limit on deposits has been temporarily removed, a new limit will be put in place on February 9th. While the exact limit is unknown, it will likely be close to the TVL on February 9th. However, the project has also stated that it hopes to eventually remove any deposit limits, though this will likely happen some time in the future, if it happens at all.\n\nOn February 5th, ETH appreciated more than 3.5%, causing its market cap to approach $300 billion. Despite the strong day, ETH was still down more than 1% over the previous 7 days.\n\nTo make the project even more enticing, EigenLayer has begun showing EigenLayer Points, which are a calculation consisting of the time spent restaking, volume restaked, etc. to formulate a numerical value. While there is no guarantee that this could lead to an airdrop, other staking platforms have used a similar system in the past to mete out tokens in the event of an airdrop. One example from recent memory was the Jito (JITO) airdrop on the Solana chain. This project also used a point system, which allowed users to be placed into tiers that gave different amounts of JITO on the day of the airdrop. Again, there is no guarantee that EigenLayer will use the points system for an airdrop, but it has been used in the past.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nEigenLayer and restaking is certainly an interesting system, especially considering the potential for spot Ethereum ETFs and Ethereum chain upgrades potentially coming soon. As the protocol continues to grow and we start to see its use cases, we will gain a better understanding of where liquid restaking could potentially play a role in the future of blockchain.\n\nStory continues\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNVkIzbjNfdExkSm1iWUU2MWREVURRSDVERWtVaVA5ZHZQd0NwSUc3alJldFhIeGpfcWdKVmFvVEhPY05VRVFCZG4wRjZ0aUZ4SzY5ZmtPcG9oUW1ZWVpHLWlJYnRmb3ZrV3YyRGVjb1hZdGhyQzk1Rk96M3dSbjNtaW56cTNUVWU3YlVVcVhXUDNqcTJ3dG1rVlJVWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "EigenLayer has gobbled up nearly 1.5% of the total Ethereum token supply - DLNews",
        "content": "EigenLayer reopened deposits and saw its market size double to $4 billion in just two days.\n\nUsers are rushing to the protocol to position themselves for any whiff of a possible airdrop.\n\nThe restaking protocol is currently sitting on top of 1.5% of Ethereum’s total available supply.\n\nEigenLayer is becoming a black hole for Ether liquidity.\n\nInvestors are rushing to deposit their staked Ether after the protocol reopened deposits this week.\n\nThe restaking protocol has rocketed to $4 billion in deposits, almost double the value of locked-in investments before its latest deposit resumption.\n\nEigenLayer has been periodically raising its deposit limit as part of its staggered launch, which began in June.\n\nThis week’s growth now makes it the sixth-largest DeFi protocol by investor deposits and a mere $142 million from overtaking decentralised exchange giant Uniswap.\n\nEigenLayer deposits soar to $4 billion\n\nEigenLayer’s $4 billion market size comes from the almost 1.8 million Ether amassed by the protocol thus far — about 1.5% of Ethereum’s total circulating supply worth $284 billion.\n\nEigenLayer is the biggest player in the niche restaking market, which is attracting significant interest as DeFi’s latest meta.\n\nInvestors are also pouring in on hopes of future rewards in the form of an airdrop.\n\nJoin the community to get our latest stories and updates\n\nEarly depositors to EigenLayer earn points for restaking on the protocol. Many expect these points will be converted to airdrop rewards if EigenLayer launches a native token.\n\nEigenLayer deposits come in natively-staked Ether and several forms of liquid-staked Ether. The former refers to Ether staked directly on the Ethereum network, while the latter applies to Ether previously locked in several liquid staking protocols such as Lido, Rocket Pool and Swell.\n\nRestaking is an extension of the popular liquid staking market which currently worth $35.3 billion, according to DefiLlama.\n\nLiquid staking emerged as a convenient alternative to staking Ether directly to the Ethereum network. Instead, after depositing your holdings with a liquid staking provider – like Lido or Rocket Pool – you get a token in exchange. This token acts like a receipt of your staking deposit and is pegged to the price of the original-blend Ethereum.\n\nImportantly, this staked version of Ether – also called an LST – can be reused in DeFi to continue earning yield or as collateral to mint stablecoins.\n\nRestaking adds another step to this process. LST holders can stake those deposit tokens in a protocol like EigenLayer and potentially rake in yet more yield.\n\nRestaked Ether provides pooled security that extends Ethereum’s security architecture across more Ethereum apps and even other blockchains.\n\nLiquid staking wars heat up\n\nJostling for points and potential airdrops on EigenLayer has also triggered competition among the litany of liquid staking protocols on Ethereum.\n\nEigenLayer previously accepted liquid-staked Ether deposits from Lido, Rocket Pool, and Coinbase. But the protocol has expanded this deposit set to include nine others.\n\nMarket values of liquid staking protocols\n\nLido’s staked Ether, represented by stETH, is the most popular LST deposit on EigenLayer at 579,062 stETH, worth $1.3 billion — almost a third of the pool — almost as much as the natively restaked ETH in the protocol.\n\nOthers like Swell’s swETH and Stader Labs’ ETHx hope to attract deposits using incentives such as boosted EigenLayer points. These two are the largest after Lido in terms of EigenLayer deposits, with $431 million and $206 million, respectively.\n\nA burgeoning related sector is called liquid restaking. Puffer Finance launched with much fanfare earlier this week, joining ether.fi, Kelp DAO, Renzo and Eigenpie. And that may all be just the beginning for a fast-growing sector in DeFi.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxQd2tFMFFGQ0FyaFFkWmtXbFRzbFJBTjBoQVIxLTBaMFJTcmxkX0YxbW1aTFp0Z2FWcFpwcmZyYTFfU1FVSVlBZm1ablZzRHZKZld0S3JqTHNqNVFacUh1R3BHTDQ4Wjl3ME83RHZfekg5YTQxMFMxOEUyZkdBZDhsdm9DVGh5NUFnZzVDNTBaUTRvZGFWbVBVcGE1a2xfdG1uM0hhZUMzRjBJOS13emxZVXZkV3RqMDUwSEEtV1dLQlNDemRCNHpUMzZUTUVxZXlDdlJjeHJSdVlMS1FwemdTY3hkUXF1V093bUVoZ1B6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Prometheum Announces Custodial Services for Ether (ETH), Opens Account Sign Up For Institutional Clients - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--Prometheum Inc., today announced that its subsidiary Prometheum Capital LLC will initially provide custodial services for Ethereum’s ether (ETH) token. This development follows the company’s recent approval of its membership application from the Financial Industry Regulatory Authority (FINRA) as a Special Purpose Broker-Dealer (SPBD) permitted to custody, clear, and settle digital asset securities.\n\nPrometheum Capital has opened its signup process for institutional clients encompassing asset management firms, hedge funds, Registered Investment Advisors (RIAs), banks, and financial institutions, in anticipation of the platform’s custodial services launch in Q1 2024.\n\nETH will be custodied at a FINRA member firm and a SEC-registered broker-dealer for the first time, setting a precedent for the digital asset sector. Prometheum Capital plans to introduce additional digital assets for custody, with further announcements forthcoming.\n\n“Prometheum Capital's custodial services, starting with ETH, are tailored to meet the stringent regulatory and compliance standards promulgated by the Federal Security Laws,” Prometheum, Inc. Co-CEO Aaron Kaplan said. “Our unwavering commitment to compliance and investor safeguarding drives this milestone, signifying substantial progress towards establishing a new paradigm for blockchain-enabled market infrastructure.”\n\nPlans are in place to extend trading, clearing, and settlement services to both retail and institutional clients in 2024, fostering an inclusive and accessible platform for all.\n\nTo inquire about Prometheum’s custodial solutions, please contact business@procustody.com.\n\nAbout Prometheum\n\nFounded in 2017 by a group of Wall Street attorneys, Prometheum provides an end-to-end, blockchain-enabled ecosystem for the trading, clearance, settlement and custody of digital asset securities.\n\nPrometheum, Inc. Disclosure\n\nNon-solicitation\n\nThis press release is issued for informational purposes only and does not constitute an offer to sell, a solicitation of an offer to buy, or a recommendation of any security or any other product or service by Prometheum Inc., Prometheum ATS, and Prometheum Capital (collectively “Prometheum’’), or any other third party regardless of whether such security, product, or service is referenced in this press release. Furthermore, nothing in this press release should be construed as a recommendation to buy, sell, or hold any investment or security or to engage in any investment strategy or transaction. Prometheum does not represent that the securities, products, or services discussed in this press release are suitable for any particular investor.\n\nForward-looking statement\n\nStatements herein that are not historical or current fact are “forward-looking statements” that are based on the Company’s beliefs, assumptions, and expectations of future events, taking into account the information currently available to the Company. These forward-looking statements are subject to numerous uncertainties and factors relating to the Company’s proposed business and operations, as well as uncertainties relating to capital markets, some of which are difficult to predict and many of which are beyond the Company’s control. Any forward-looking statements herein are based upon information available to the Company on the date this was first sent by the Company. The Company does not undertake to publicly update or revise its forward-looking statements even if experience or future changes make it clear that any statements expressed or implied therein will not be realized."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOOEozTzJlZXVyeU9IWl9XOV85SUdhOWhpZTE2ZVlzV0huSlpITVFPYmhPemlwNWx2R1pjeFFUQldkX1NKRkU1U2RTU0RxeDRkdG1uQmFJVTdMR09PbF9vTFVJZ1pJMmJwWkNfdmRUSi1LU0VXd3dZRjFNdll0WnJ3dmtwejc4VExTalJOZkdSdGFPQ0JWbGIyMtIBoAFBVV95cUxPdEpwd2dKTzROSjNkOVNESWJFbThpNnBhektKLUNJYTZZOXQ3VzR0N0VrQ3JIX1U2OFFkRVM4cU1WRFhLVXhLa1lTeFY4VUc3ZUE0VmN3aG1GVTlQMmZmS2RtSUJXYVdua2NlVjNQcnc1TDVZOHh5MmplOTkwZEo3cTFtWUhtQzFvTV94UmxmYjFYUzBDNHp1ZnFFc2lxX3Zx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Blast Layer-2 Solution: Enhancing Ethereum's Scalability and Yield - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlast, an Ethereum layer-2 scaling solution, aims to address the Ethereum network's scalability challenges. It has attracted significant interest by securing a total value locked (TVL) of over $1.4 billion and fostering a growing ecosystem of applications and users.\n\nBlast differentiates itself with features including native yields for ETH and stablecoins, facilitated by auto-rebasing mechanisms and collaborations with real-world asset protocols.\n\nBlast’s testnet went live in January 2024 ahead of a planned mainnet launch in February.\n\nAD\n\nAD\n\nKey features and innovations\n\nNative Yields: Blast is distinctive for offering native yields on ETH and stablecoins, a feature uncommon among layer-2 solutions. This is achieved through an auto-rebasing mechanism and integration with protocols involving real-world assets, which aims to enhance the value and efficiency of assets within its ecosystem.\n\nBlast is distinctive for offering native yields on ETH and stablecoins, a feature uncommon among layer-2 solutions. This is achieved through an auto-rebasing mechanism and integration with protocols involving real-world assets, which aims to enhance the value and efficiency of assets within its ecosystem. Auto Rebasing for ETH : By leveraging the Ethereum network's post-Shanghai upgrade capabilities, Blast allows for the automatic increase of ETH balances by directly transferring yields from L1 staking to users on L2. This feature aims to ensure that ETH holdings in Blast continuously grow, reflecting L1 staking yields.\n\n: By leveraging the Ethereum network's post-Shanghai upgrade capabilities, Blast allows for the automatic increase of ETH balances by directly transferring yields from L1 staking to users on L2. This feature aims to ensure that ETH holdings in Blast continuously grow, reflecting L1 staking yields. T-Bill Yield for Stablecoins: Offering an auto-rebasing stablecoin, USDB, Blast provides stablecoin holders with a unique yield sourced from real-world assets through MakerDAO’s T-Bill protocol.\n\nBlast airdrop and tokenomics\n\nBlast’s planned airdrop in May 2024 aims to incentivize community interaction and development within the Blast ecosystem. Significant portions of the airdrop are reserved for developers participating in the Big Bang Competition and for community engagement, promoting liquidity and user base expansion.\n\nDeveloper incentives and ecosystem growth\n\nBig Bang Competition : Encourages developers to create applications on Blast, offering exposure to its large user base and TVL. Winners receive token rewards and the promotion of their apps to the Blast mainnet.\n\n: Encourages developers to create applications on Blast, offering exposure to its large user base and TVL. Winners receive token rewards and the promotion of their apps to the Blast mainnet. Guidance and Mentorship: Participants receive personalized guidance from investors and mentorship, enhancing project success and integration into the Blast ecosystem.\n\nStrategic backing and user engagement\n\nWith $20 million in financing from major backers including Paradigm and Standard Crypto, Blast is looking to establish itself as a leading layer-2 solution. The platform also introduces referral bonuses and potential for airdrop rewards to engage users and build a community.\n\nConclusion\n\nBlast’s entry into the Ethereum layer-2 space introduces unique yield mechanisms and a community-driven approach. Its features, including auto-rebasing for ETH and T-Bill yields for stablecoins, provide a novel option for developers and users. Its focus on fostering community engagement through initiatives like the Blast Airdrop and the Big Bang Competition underscores its potential to contribute to Ethereum's scalability and DeFi innovation.\n\nHowever, Blast has faced some pushback from crypto users and developers following its initial launch in November 2023. Early investor Paradigm criticized Blast’s decision to launch its bridge before the L2, and blocking withdrawals for three months, as setting “a bad precedent.” Blast co-founder Tieshun “Pacman” Roquerre has rebutted these complaints, calling them “misunderstandings.”\n\nRoquerre previously founded Blur, which quickly catapulted ahead of OpenSea to become the top NFT marketplace in early 2023 thanks to its trading incentives; Blur has given out more than $800 million worth of tokens to traders. Blast aims to build on that momentum with a similar airdrop model, in the hopes of rapidly becoming a prominent Ethereum L2.\n\nAD\n\nAD\n\nEditor's note This article was written with the assistance of AI. Edited and fact-checked by Stephen Graves. The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice.\n\nEditor's note: Originally published on February 8, 2024. Last updated with new information on February 14."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUnVaTklKNG9BTUN6bHlCdWRzZnNOV3dwTzNUOUNlVEZiZldqc2ttblJsazZFRndJSHExak43c1VuUXVWYnB4dUJlczhmU29qZmVwZmc2aU1wWTE3ZkJxZnB1NDdrSW9lS0phanJrZHdKVGlWOU5tTWhybDU2Nml2ZDNjZ0Z2Z2NjSHc3TEVGeTlwVnBNMjV4cDFSaWNtYVA5bWlrYjJfMFFPTEdEa3hXUTluUWHSAboBQVVfeXFMTXNMVnRMSG9tWmhRb1EybXJiOTJNb1NwblVWQjloOGlIT250bklsTVlad2JINE84UmRYWUlDUkttc2hBekZRR180QmNLU0wxMnlFTXdyY1htcWw1YlZBX0J3em1LRFNDNTdEWmtCYVJxQ1plRm04TzVjRGc2bjBuVkE5dzRTNzlTTmdFdGV1a25wNTRSZ090OHlCUU9oS3Zzckd5OHA2Q3hBejhzTHVZeE40Q2R3ZkRZTkRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ether Tops $2.4K as Cathie Wood's Ark, 21Shares Amend Spot ETH ETF Filing - CoinDesk",
        "content": "ETH's price advanced nearly 2% within an hour from when the news appeared, breaking above $2,400 for the first time since January 22. The second-largest crypto by market cap was up 2.4% over the past 24 hours and outperformed the broader cryptocurrency market, with the CoinDesk 20 (CD20) index that tracks the largest digital assets being up 1.2% and BTC gaining 0.4%."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPS1loZ0VGaHpCSlVNQzBPNlJYdWhfX3NjUklVTFl5SjdWbVVRbFhfdjNnbFFwOS1keGVDc2kybXUzb3k5SXROa0pycEZqRVhSZlBKUDJSOU4ydnBjdXBjdzl3cWVWOUVaeFRlQmRzelhrVjNFeEtDVVpjV2FwTW5xN2FUcTc5czktUzFUWXJZcndKQTBaVFdGS0xzVElfOEdocTdfb2ctc3l1Z9IBrwFBVV95cUxNMFdhWkxEWWZFeGJveUM4bHVmdEFoU3dvUUtRM2w2aDFCbWhqZVVKOTQ2WVBRaDQwc1NzS0NQNll1b19EWW1DSHAzREJmLS1PM2pOU21EcGpSTC1GUEFxemc2WDJlNF9DcmI1blVBdDZjOFRQd2cxbGJVbHE3UGgxdF9wN1V4VzNFal9lZWZtSFVmcmlnX3hEelFKblhucmpuUFpHNEpmQkgtVmdXbWhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "UBS Launches Investment-Grade Tokenized Warrant on Ethereum Blockchain - The Tokenizer",
        "content": "UBS has introduced Hong Kong’s inaugural investment-grade tokenized warrant on the Ethereum public blockchain network. Leveraging the on-chain issuance product framework provided by UBS Tokenize, the bank’s in-house tokenization service, this groundbreaking product is a call warrant featuring Xiaomi Corporation as the underlying stock. Notably, the tokenized warrant marks the first natively issued warrant on a public blockchain and was successfully sold to OSL Digital Securities Limited, a licensed virtual asset platform operator and wholly-owned subsidiary of OSL Group (formerly BC Technology Group).\n\nWinni Cheuk, Head of Sales, APAC Public Distribution at UBS Global Markets, highlighted the significance of the UBS tokenized warrant, reinforcing the bank’s position as a leading issuer of derivative products in Hong Kong. This innovative product, created natively on a public blockchain in a permissioned environment, brings enhanced transparency, reduced transaction fees, streamlined settlement processes, and flexibility in trading hours.\n\nPatrick Pan, Chairman and Chief Executive Officer at OSL Group, expressed pride in collaborating with UBS, simulating the entire product life cycle of an equity-linked structured product token. From token minting through simulated secondary market transactions to token burning at maturity, the transaction represents a major milestone in Hong Kong’s regulated virtual asset landscape.\n\nKey features and benefits of tokenized warrants include improved accessibility, leveraging blockchain technology for better access to digital structured products and extended trading hours. The utilization of smart contracts facilitates automation, streamlines trading and administrative processes, and lowers handling costs, contributing to increased efficiency compared to traditional channels. The transparency provided by blockchain technology ensures that all transactions and ownership records are securely stored on a decentralized ledger.\n\nThis tokenized warrant is part of UBS’s ongoing effort to advance its tokenization services. Since 2015, UBS has been at the forefront of blockchain technology and digital assets, exploring various opportunities with a focus on developing institutional-grade infrastructure for tokenized assets. UBS Tokenize, an integral part of UBS’s broader work in tokenization services and global distributed ledger technology, supports opportunities across origination, distribution, and custody, with an initial focus on tokenization of bonds, funds, and structured products. In 2022, the bank achieved another milestone by issuing the first-ever USD 50 million tokenized fixed-rate note, sold to Asia Pacific clients through the UBS Tokenize platform.\n\nImage by pat pat from Unsplash\n\nRead other stories: Bitfinex Securities Expands to El Salvador\n\nWhat investor protection measures are suggested when dealing with security tokens or other digital assets?"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxONXh1YnB3Wk00V1pvVmltN1NkN1pHRUJ6c0ZuTlZtb2J6VndVdV9zUU1RTUluMFB0SklBdmtaQnZlUEZ5ZnhkYVVmN1k3U3FidEs4M1U5OXYxQzlRXzdvV0tOSkxVZjBiSW5ZdGoxZG1CUV9GVHFJSkI4MnhzZVlHcmdZVWg0bEVLY0NLRWQ2ZHJDSVN4dHl0M1d6OHY2ZWszNjVPYUZVSTAwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "UBS launches Hong Kong’s first-ever tokenised warrant on the Ethereum network - The TRADE News",
        "content": "UBS has launched Hong Kong’s first-ever investment-grade tokenised warrant on the Ethereum public blockchain network.\n\nThe new product utilises the on-chain issuance product framework offered by the bank’s in-house tokenisation service, UBS Tokenize, and is a call warrant with Xiaomi Corporation as the underlying stock.\n\n“The introduction of the UBS tokenised warrant reinforces the bank’s position as the leading derivative products issuer in Hong Kong,” said Winni Cheuk, head of sales, APAC public distribution, UBS Global Markets.\n\n“Created natively on a public blockchain in a permissioned environment, this innovative product enhances transparency, reduces transaction fees, streamlines settlement processes, and allows for more flexible trading hours.”\n\nThe tokenized warrants’ key benefits include increased accessibility through access to digital structured products, improved efficiency through the use of smart contracts, and better transparency through the use of blockchain technology.\n\n“OSL is proud to be working with the team of blockchain and product experts at UBS. We are simulating the whole product life cycle of an equity-linked structured product token, from token mint, through simulated secondary market transactions, and finally to token burn at maturity,” said Patrick Pan, chairman and chief executive at OSL Group.\n\n“Hong Kong’s regulated virtual asset landscape has just crossed another major milestone with this Investment grade tokenised financial product issuance.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOakg2UXJ1UDkxN3B0czk5VFNLdjR1RXhhaVdJWUd3UE04bzViS3p2T2x5ZURicC05VjFocml3QlBVV1ZpNTB1ZUJ4c09PSjRPV2Nfb2dKc1A0MmNJWWtpaUJOM2hrTTdyOW1STDQ5OHVNbm41VlA5UU9CY05WVDRZa0JMR2xaN29G?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Top 9 smart contract platforms to consider in 2024 - TechTarget",
        "content": "Smart contracts let users write executable code that encodes business logic and runs on a blockchain or other type of decentralized ledger. Depending on your goals, there are many ways to use smart contract platforms to push these powerful apps into production.\n\n\"Smart contract platforms are decentralized systems that enable self-executing contracts on a blockchain,\" said Sanjiv Maewall, CTO of blockchain and digital assets at Deloitte Consulting. These platforms support secure, transparent and tamper-proof execution of predefined conditions, according to Maewall, which makes them ideal for trustless applications such as finance, supply chain management and voting systems.\n\nThere are four main kinds of smart contract platforms: large blockchain platforms; smaller ones optimized for improving smart contract execution speed or cost; private smart contract frameworks; and specialized tools for crafting and managing smart contracts across trusted partners.\n\nThese tools were selected based on their prominence across the various smart contract platforms; conversations with industry experts; and, in the case of the public smart contract platforms, their market cap and trading volume.\n\nWhat are smart contract platforms, and how do they work? Before diving deeper into the different types of smart contract platforms, it's helpful to define what a smart contract is and what it does. Lata Varghese, digital assets and blockchain practice leader at Protiviti, said she likes to think of a smart contract as \"a digital form of a traditional contract where contractual agreements between counterparties are inscribed as a piece of code.\" A smart contract is a self-executing program that automates the actions required by an agreement when predetermined terms and conditions are met. It ensures trust between the involved parties without needing a central authority. A smart contract platform is a blockchain-based decentralized platform that lets users create and execute smart contracts. A blockchain is not in and of itself a smart contract platform. Developers must extend it with tools to store smart contract code in a secure and tamper-proof form. They also add tools that enable decentralized and autonomous execution of smart contract code correctly, securely, transparently and deterministically. It's also important for the state transition from smart contract code execution to be verified by consensus of the nodes in the blockchain network before recording the state change in the blockchain ledger. The blockchain-based cryptocurrency Bitcoin supported the first digital, permissionless and tamper-proof smart contract, but it was of limited scope. Varghese said the major breakthrough came when the developers of the Ethereum blockchain added support for programmable smart contracts. They also introduced the Ethereum Virtual Machine (EVM) as the computation engine that manages the state of the blockchain and enables smart contract functionality. \"Ethereum continues to be the most popular platform for smart contracts due to its highly decentralized security as well as a large community support,\" Varghese said. One caution for enterprise users is that smart contracts are not legally binding. Within the Web3 community, the term is used differently than enterprises looking to automate contract processes in a traditional sense. In parallel, lawyers and governments are developing frameworks for what are called smart legal contracts, which might or might not use decentralized ledger technology. Automated procurement platforms, such as SAP Ariba and B2B marketplace platforms, can sometimes be used to automate contractual processes through ERP integrations. Contract lifecycle management platforms (CLMs), such as the DocuSign Agreement Cloud, are also exploring ways to integrate smart legal contracts into enterprise workflows.\n\nLayers and levels of smart contract platforms Several blockchain technology platforms have been used for executing smart contracts. They're usually characterized as Level 1 (L1) or Level 2 (L2) platforms. L1 platforms are blockchains on which smart contracts are executed directly on the main core platform. Prominent examples are Ethereum, Solana, Cardano and BNB Smart Chain. L2 platforms execute the smart contracts on a parallel space so they can run more efficiently and quickly; they then roll up changes to the core platform. Examples of L2 platforms include Ethereum ZK-Rollups, Ethereum Optimistic Rollups and Polygon. Many of the newer offerings support both L1 and L2 capabilities. \"There is continuous innovation occurring in these technology platforms to address blockchain scalability challenges and become the platform of choice to build Web 3.0 applications,\" Varghese said, referring to the future blockchain-based generation of the web, often called Web3. The newer blockchain platforms almost uniformly have support for smart contracts, she said, and many are EVM compatible. That means a decentralized application (DApp) that runs on Ethereum can also run on them. Other prominent platforms Varghese has explored include Avalanche, Tezos, Algorand, Polygon, Cosmos, Polkadot, Tron, Near and Cardano. In addition, some blockchain platforms, such as Avalanche, Cosmos and Polkadot, are being adapted for private, permissioned smart contract implementations. Several smart contract platforms, such as Hyperledger Fabric, R3 Corda and Hyperledger Besu have supported enterprise blockchain implementations for at least five years. Purchasers should investigate a platform's protections against these smart contract security risks.\n\nKey factors to consider in a smart contract platform When choosing a smart contract platform, Maewall suggested examining a platform's security features, track record, scalability potential, performance, cost and strength of the associated developer community. \"Each platform has its unique offerings and tradeoffs, so choose one that best aligns with your project's requirements,\" he said. These platform elements also come with compromises. For example, Ethereum has the strongest developer community, but it also has the highest cost per transaction -- called gas in the blockchain community -- Maewall said. Similarly, some platforms are Turing complete. They can simulate every function of a Turing machine, a mathematical model of computation, which means users can write more expressive applications. But this flexibility comes at the expense of security vulnerabilities that must be addressed.\n\nUnderstanding the different approaches In some ways, smart contract infrastructure is comparable to that of cloud computing, which has many nested and sometimes overlapping platforms. On one level are the large infrastructure platforms such as AWS, Microsoft Azure and Google Cloud. The application software layer includes Salesforce, ServiceNow and other platforms. In addition, private clouds enable enterprises to deploy workloads running on Docker containers that can move across public and private cloud infrastructure. Similarly, in the smart contract arena, Ethereum is like AWS before Microsoft and Google came along. Several newer competitors, including Cardano, Solana and Tron, provide alternatives to Ethereum. Another tier of platforms that includes Hyperledger Fabric, Corda and Tezos mimics private cloud infrastructure. Development management platforms, such as Kaleido and Casper Labs, are designed to make it easier for partners to create and manage their own smart contract infrastructure. Additionally, CLM platform vendors are extending their tooling to support smart legal contract development management capabilities that span decentralized ledger and CLM capabilities, such as DocuSign Smart Agreements. There are nuances in how the various platforms approach the problem of smart contract development and deployment. For example, apps might run on EVMs, low-level VMs, Docker containers or other infrastructure. It's also important to consider your reasons for building decentralized apps before choosing a smart contract platform. Differences in platform features and capabilities can determine what an app can do and what users can accomplish by using it. For example, platforms such as Ethereum and Solana make it easier to incentivize infrastructure creation with cryptocurrency tokens. However, private trading partners might be happy to build or rent their own infrastructure. They are more motivated to streamline transactions and improve transparency. Much like in the cloud industry, there are dozens of smart contract platforms, and the field is evolving rapidly. Rather than surveying all of them, it's more helpful to focus on the top categories and the biggest or most interesting players. With this in mind, let's look at some of the top smart contract platforms across key categories.\n\nTop tier Ethereum Ethereum pioneered flexible smart contracts when it was launched in 2013. It supports Solidity, a variant of the JavaScript programming language that was immediately accessible to front-end developers and quickly grew a massive base of developers and financial supporters. Ethereum also pioneered the EVM, which has become a standard for other smart contract platforms. Ethereum's stock market capitalization is far and wide above competitors. In early 2024, it was $277 billion -- several times more than all the other smart contract platforms combined. The main benefit of a large market cap is that successful smart contract apps have the potential to grow faster in a much larger virtual economy. Ethereum is the top choice for developers who want to game the largest smart contract ecosystem with a bright new idea. Some observers say Ethereum's performance is not as fast as some of the upstarts. Smart contract mistakes can be expensive and difficult to unwind; in some cases, this can require a fork, a usually temporary split in the Ethereum network to allow major technical upgrades or changes. The blockchain has also been undergoing a constant pace of forks, merges and upgrades. The Shanghai upgrade in mid-2023, called Shapella, supported a more efficient proof-of-stake consensus mechanism and faster transaction processing.\n\nSecond generation The success of Ethereum smart contracts revealed some fundamental disadvantages of the platform. For one thing, it's not particularly fast compared to modern transaction processing infrastructure -- a few dozen transactions per second compared to 24,000 for the Visa payment network. Hackers also discovered new security bugs in Ethereum smart contracts that were difficult to resolve. For example, a hack of the first Ethereum distributed autonomous organization, a type of management structure built on a smart contract, resulted in the DAO losing a third of its value. Eventually, Ethereum was hard forked -- permanently split in two -- to undo some of the damage. A second generation of open blockchain networks has sprung up to address such shortcomings. BNB Smart Chain The BNB Smart Chain is built on the BNB coin. It was previously the Binance Coin by Binance and was migrated to a separate Smart Chain in 2019 to create a native coin. In early 2024, the BNB coin had a market cap of about $47 billion. The platform supports a proof-of-stake authority consensus mechanism architected to optimize speed and keep transaction costs low. The network currently supports a million daily users and more than 2,000 active DApps. It is also popular among the gaming community, with over 287,000 weekly active gamers. The platform supports several popular development languages, including Solidity, Go, Java and Swift. One potential concern for developers is that Binance, the company behind the chain, has suffered legal problems that could impact the rollout of smart contract apps in the U.S. In November 2023, Binance pleaded guilty in U.S. federal court to failing to maintain an effective anti-money laundering program and agreed to pay over $4 billion in fines. Solana The Solana blockchain ecosystem has recently grown to be the third largest public smart contract platform with a market cap of about $44 billion as of early 2024. Some experts consider it more efficient than Ethereum and many other public blockchains. Factors contributing to the speed include support for a low-level virtual machine for deploying smart contracts as well as the use of C and Rust programming languages for writing them. That makes it a good bet for developers looking to combine high transaction rates with the economic opportunities available on a public blockchain. Cardano Cardano was introduced as a more energy-efficient alternative to Ethereum in 2015 by Charles Hoskinson, who also helped start Ethereum. In 2021, it introduced its Plutus feature for building smart contracts. The community has also created several programming languages for creating smart contracts on Cardano, including Marlowe, Aiken, OpShin and plu-ts. Cardano is a newer platform with less functionality and fewer developers than others on this list. However, it has the fourth-largest market cap at about $19 billion, making it an interesting option for developers who want to take advantage of a large token economy outside of Ethereum.\n\nPrivate blockchains Private blockchains are similar to open source cloud development platforms, such as Cloud Foundry, OpenShift and Cloudify but for smart contracts. The code itself is open source; a variety of expert service firms provision it on private hardware in data centers or on top of cloud services. Private blockchains are a good fit for businesses and government organizations that want to streamline transactions between trusted partners. They're a good choice for improving the efficiency of things enterprises already do, with mechanisms to update contracts or roll back transactions when problems are discovered. The most common use of private blockchains is scaling trust across enterprise boundaries. Hyperledger Fabric IBM developed Hyperledger Fabric and then handed it off to the Linux Foundation to create an enterprise-grade blockchain platform with modular architecture and various consensus mechanisms. It enables fine-grained control of data visibility and confidentiality so only authorized people can access data. It also supports multiple programming languages, including JavaScript, Go and Java, and is designed to handle high transaction volumes. Hyperledger Fabric is a permissioned blockchain network. That means only authorized individuals or devices can participate in transactions, which is important from a trust, compliance and regulatory perspective. Corda Corda was created to model and automate real-world transactions in a legally enforceable way. Private channels let participants transact directly to improve the confidentiality of transactions. Numerous integrations have been built for the finance, healthcare and supply chain industries."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFB5bUEybnhkRldPREc5MG5YSUdOamtKYzZpVEx5RjRjWXFwLVlMUGJXX0FvdFRoelNKRl9XS25tRENsQXduTEc3Q1l1N0pNb0J3d3k4YjJyU3d4dWgtcTkwZ3pZajh5UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade: The Impact on ETH Prices - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcFg3d1VfMW90cXNUMjJmVzZFTUswVGRKYjBsSnVsYXQ3ZjBabzhEa0JQN29QdU45RFAzQ2NZTDlXMVBQVXZfcFZhVC10LWJkNmdTU0dWSjhwN1c0Y1AtUXQtRzZjclZld1RzWk1PYTdzUDVmLUliMTlvRnYySXUtRWdNQUtadHlUcVhuNkZTSkxOT0dtSl9TcUlRNUJSTXZVUEFSai1uRmJtLWpGWXZpSUNpV3VzTWo5S0hCN0pzS0hvLVJrb1BTMG9n0gHPAUFVX3lxTFBNUU9YZTZjUV9UTmVpVkllSEhaaXVHaDNLM2dhX1VJWlk3dTc0WENqbHJGLXVCX3RSd0Nrb0hkZ0lLUTBCMVRfLTNPTHhfNHRuS2g4c1lCbFdKMDllS1JQeXEzZDB2YjZCVkgzbFlyVC1FQnNiMGFERXM0bkY1MzN5X2lqYVI5b2lKaHlKR2RFLTZucFNrbnJJUTVMeUhEVEtPYVI3Y2Q3OVJWVllEd2VUblpGZzlEOURuV05zZFdXNWVycDd6bVpOZUJ1Q0dBVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "ERC-404 – Ethereum’s new experimental token standard and ETH implications - FXStreet",
        "content": "Ethereum’s ERC-404 is a new token standard that has taken the market by storm.\n\nThe new experimental standard combines the best of fungible and non-fungible tokens standards, ERC-20 and ERC-721, respectively.\n\nPandora, the first token that uses ERC-404, has skyrocketed 5.400% since its launch on February 2.\n\nEthereum (ETH) price has remained lull despite the Ether ETF applications. But the launch of ERC-404 could be a key catalyst that kickstarts a rally for ETH.\n\nAlso read: Ethereum price poised for gains as Dencun upgrade goes live on the testnet\n\nWhat is ERC-404?\n\nERC-404 is an experimental token standard built on the Ethereum blockchain that aims to combine the functionalities of ERC-20 tokens (fungible tokens) and ERC-721 tokens (non-fungible tokens, or NFTs) into a single standard. This means that ERC-404 tokens can be both fungible and non-fungible, depending on the specific implementation.\n\nIn a nutshell, ERC-404 is a new way of defining digital assets like tokens or collectibles on the internet.\n\nERC-404 key features breakdown:\n\nHybrid functionality: ERC-404 tokens can represent both fungible and non-fungible assets, offering flexibility for various use cases.\n\nNative liquidity: Unlike traditional NFTs, ERC-404 tokens have built-in liquidity mechanisms, allowing for easier trading and fractional ownership.\n\nProgrammable scarcity: The supply of ERC-404 tokens can be dynamically adjusted through code, enabling innovative tokenomics models.\n\nHow does ERC-404 work?\n\nOne NFT of the underlying project is awarded to the wallet that has a full ERC-404 token. When the token is sold, the NFT is automatically burned. Both the tokens and NFTs can be traded independently.\n\nIs ERC-404 safe?\n\nERC-404 is not vetted, hence an experimental standard. Its development has not followed the traditional route – Ethereum Improvement Proposal (EIPs). Additionally, it has not undergone a full external audit, but it has been tested extensively.\n\nThe only similarity ERC-404 and other ERC standards like ERC-20 or ERC-721 share is the name “ERC,” which stands for Ethereum Request for Comments.\n\nProjects using ERC-404 token standard\n\nPandora and DeFrogs are the only two projects that have implemented the ERC-404 token standard. The latter project’s token, DEFROGS price, is up 21% in the last hour, according to data from CoinGecko.\n\nCtrl, the team behind the launch of the experimental token standard, has also launched Pandora. PANDORA token started trading on February 2 at $212 and is currently trading at $21,000.\n\nPANDORA/WETH 4-hour chart\n\nAlso read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nWill ERC-404 push Ethereum price higher?\n\nIt is unlikely that the launch of projects based on ERC-404 standards will push Ethereum price higher. Since Ethereum is the second-largest cryptocurrency by market capitalization, it is highly correlated with Bitcoin price and is unlikely to be influenced by the new narrative.\n\nBut with the tides turning bullish for Bitcoin price, the outlook could get optimistic for not just Ethereum but ETH-related altcoins as well.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto markets primed, await directional bias from BTC"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQT1BEVm5sNTJUMEg3al9EVEp6SU0wZnhBNlp4d2FIS0lvYVNPTGdXdFYyRTdFbmpZYlVoMTk2dEJQMTE2ZkUyYWU5d0hKcmthZWRMajJFaTN2YW0tbzkzUXRDOTY3czc2bUlGWkNwZGV3a2pla29vbTk4OXpIbmlBMTZkbk5xaHNQYmNmNVNVQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Morpho unseats Compound to become second-biggest DeFi lender on Ethereum - DLNews",
        "content": "Morpho has overtaken Compound in total value borrowed on Ethereum.\n\nThe novel approach of matching borrowers and lenders peer-to-peer offers attractive rates for Morpho borrowers.\n\nMorpho has just surpassed incumbent lending protocol Compound on Ethereum in the total value of borrows. In terms of total value of crypto assets deposited, however, Morpho still has an uphill battle against Aave and Compound.\n\nMorpho crossed $903 million in total value borrowed on February 7, surpassing the $865 million in total value borrowed on Compound, according to data from DefiLlama.\n\nSince its inception, DeFi lending has been dominated by two protocols — Aave and Compound — which operate similarly to one another.\n\nUsers deposit funds into a lending market that other users can then borrow from, for a fee. Morpho operates similarly, but it also matches users peer-to-peer when possible, offering better rates for both borrowers and lenders.\n\nAlthough Morpho tops the total borrow value chart, the protocol sits at the sixth spot for the top lending protocols by total value of crypto assets deposited.\n\nTotal investor deposits in Morpho ($)\n\nAave currently has over $7 billion total crypto assets, and Compound has over $2.2 billion, while Morpho still only has $1.6 billion.\n\nWhat makes Morpho different\n\nGenerally with lending protocols, lenders will deposit their assets into a lending market from which users can borrow from.\n\nAlthough that method is popular, one disadvantage is that all that money deposited in a lending market sits idly, meaning a majority of the capital in these pools is not actively lent out, therefore, it is not generating yields.\n\nJoin the community to get our latest stories and updates\n\nMorpho is built on top of Aave and Compound so it can take advantage of the same rates and assets within either protocol. But, it also tries to match users peer-to-peer to reduce the amount of idle capital and provide more attractive borrowing rates.\n\nWhen a peer-to-peer match cannot be made, it simply routes to the underlying lending markets; Aave or Compound.\n\nThis creates a scenario for Morpho users where at worst they will receive the same rates they would as using a conventional lending market, or at best, they receive the improved peer-to-peer rate.\n\nThe rates for DAI, a popular stablecoin, on Compound are 5.75% for lenders while borrowers pay 8.34%. On the other hand, the rate for borrowers and lenders when matched peer-to-peer on Morpho is 6.61% which is better for both parties.\n\nAlthough it may not seem like a big increase, for investors with a lot of money often called whales, these percentages can mean a lot. If a user opened a $10 million loan for stablecoin DAI and held it for a year, they would save over $173,000 by using Morpho.\n\nUsers are also rewarded with MORPHO tokens, but these tokens are strictly used for governance as they cannot be traded.\n\nThese tokens may hold financial value in the future, as the Morpho documentation states that token holders may vote to enable trading at any point.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQQ2lqTURGQTBOaG9BSFA2NUQxM0dVVldFek9pUUZjV3RubFVQaS1WbldXUWQyZGVGNXVpSGZCYU5ZdzdxQVNFRTdzSWJPY0pMU2NFaVRacExqSE9wT0haOTB6QUFWNDZpR2E1cFgxZjJKbWV2Q2dMUFF1LVBpTGFGVXNWRDB2VHYzaVk4ZHNMVTJzdkUyc1dLUFBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ERC404 tokens bring innovation — and some unwanted consequences - DLNews",
        "content": "ERC404 tokens have exploded on Ethereum, led by Pandora's $230 million volume.\n\nThe top three ERC404 projects contributed 12% to Uniswap’s 24 hour volume on Ethereum.\n\nThe frenzy has raised concerns about rug pulls and high gas fees.\n\nLess than a week since the creation of ERC404, trading volumes on Ethereum are now dominated by these hybrid tokens.\n\nThe top ERC404 collection, Pandora, has experienced over $230 million in total volume since launching on February 2.\n\nThe PANDORA/WETH liquidity pool on decentralised exchange Uniswap is now the number three pool by volume, only behind stalwarts USDC/ETH and USDC/USDT.\n\nThe top three ERC404 projects — Pandora, MNRCH and DeFrogs — have registered a combined $113 million worth of trades over the past 24 hours, accounting for 12% of Uniswap’s Ethereum trading volume.\n\nERC404 is a token standard on Ethereum that combines characteristics of both cryptocurrencies and NFTs. It greatly improves the liquidity — availability of funds — for NFTs, which are typically highly-illiquid assets.\n\nWhen a user holds at least one token of an ERC404 project an NFT is automatically minted. The user can then either sell the token, thereby burning the NFT, or they can list the NFT on a marketplace like Opensea.\n\nBut the frenzied trading around ERC404 tokens comes with consequences.\n\nThere have already been a number of rug pulls — situations where the address that created a token pulls liquidity leaving investors with nothing — and rising gas costs on Ethereum mainnet.\n\nJoin the community to get our latest stories and updates\n\nThe ERC404 frenzy\n\nAs traders flock to the ERC404 token standard, some have started to take advantage of the frenzy. On Wednesday, a token trading under the name Punks, rose from $350 to over $20,000 in just two hours. Now, it’s almost worthless.\n\nThat’s because the wallet that created the token used a malicious contract that allowed the creation of an infinite number of Punks tokens. Shortly after Punks hit $20,000, the wallet’s controller executed the contract, minting thousands of tokens which were then sold into the PUNKS/WETH Uniswap pool.\n\nUsers who invested in this token lost everything while the creator’s wallet walked away with a gain of 42 Ether — or about $100,000.\n\nSimilar incidents occurred with four other ERC404 collections using variations of the Punks name in the last two days.\n\nERC404′s are also contributing to rising gas costs on Ethereum. Given the standard is so new, it has not yet been optimised for gas costs.\n\nEthereum gas fees spent trading the Pandora ERC404 token. (Chocolate Chungus)\n\nGas fees on Ethereum are payments made by users in order to send transactions. Ethereum is designed to increase the cost of transactions during busy periods to protect the network from spam attacks.\n\nThe founder of the Pandora collection recently stated in the project’s Telegram chat that the next ERC404 improvement should reduce gas costs by 300 to 400%.\n\nThis will likely be welcomed by Ethereum mainnet users. Gas fees on the network have averaged 53 gwei over the past 24 hours, while the average for the previous seven days was 29 gwei.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQN2NZNWowaXhwVE1Eay1OcWo3Z1g5YXVMcXdxTzkwX2tPRVBMdlRoVkE2SDVkUUp4WmRiRzA4eExyak5oUUJnVWF2LUdCYjFGZU5KN1RoV0cyaUdXZG45WnVTUkpYY3dTcl8xdzBNX3pQaEVNUUZKVUZpOWhyVDBUN0lEN2lCUk1tdF80b2xJSWRkTzFCOEpyR2g5Ylc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Latest Ethereum price predictions: $5,000 by the end of 2024. - The Cryptonomist",
        "content": "In this article we see the latest forecasts on the future price of Ethereum offered by the fintech company Finder, which conducted a survey with 40 experts in the cryptocurrency industry in January 2024.\n\nThe emerged results speak clearly: the majority of experts are super bullish on the price of ETH, with predictions for the next 6 years talking about figures higher than four zeros.\n\nFrom a technical analysis perspective, Ethereum could experience a real rally as soon as it breaks the long-term downtrend, which has been ongoing since August 2022, in the chart against Bitcoin.\n\nLet’s see all the details below.\n\nFinder’s predictions on the future price of Ethereum\n\nAccording to a panel conducted in January 2024 by the analysis company Finder, in which 40 fintech market specialists were interviewed, the price of Ethereum could soon skyrocket if it were to meet the announced forecasts.\n\nAccording to the average of the responses obtained from the participants, by the end of the year ETH could reach $5,000 per token, approaching $4,887, thus increasing its current value by over 100%.\n\nThere are even those who have gone so far as to imagine a fiery scenario for Ethereum, hypothesizing a price of $17,000 by the end of 2024. At the same time, there are also those who, going against the tide, support the crypto market bears and predict a price of $1,333.\n\nApproximately 23% of the interviewed speakers believe that the price of ETH will rise in the range of $4,000 to $4,999 at its maximum before the end of 2024, while another approximately 23% believe that we will see the price of ETH within the range of $3,000 to $3,999 in the same time frame.\n\nExpanding our horizons, we see that forecasts indicate a potential growth of the cryptocurrency that could reach $7,492 in 2025, while by 2030 we could reach $19,190.\n\nThese numbers, obtained as a simple average of the responses provided by industry experts, are significantly higher compared to those recorded in a similar survey conducted by Finder in October 2023.\n\nThe analysts interviewed by Finder also contributed to explaining the reasons for their bullish or bearish biases, providing technical support to the market forecasts provided.\n\nIn particular, we see how Damian Chmiel, senior analyst and editor of Finance Magnates, believes that the fate of Ethereum largely depends on the performance that Bitcoin will record:\n\n“The price of Ethereum will reflect what happens with Bitcoin. If I believe in a historical high by the end of 2024 around $70,000 for BTC, I also believe that ETH will reach its historical high, testing the $5,000 level.”\n\nEven Jonathan Hababou Solomon, co-founder and co-CEO of ARIA Algorithmic Ratings & Investment Analysis, agrees with Chmiel’s thesis. He notes a very strong correlation factor between the two assets, but emphasizes that the second largest cryptocurrency by market capitalization could have the upper hand this year:\n\n“Given the strong correlation between bitcoin and ether, it is likely that ether will benefit from bitcoin catalysts such as spot ETFs [bitcoin] and [the halving]. However, I believe that ether has greater potential due to its current market price. There is a general perception that ether offers a better opportunity for higher multiple profits compared to bitcoin.”\n\nAccording to a slightly less optimistic forecast by Ruslan Lienkha, head of markets at YouHodler SA, the price of ETH is expected to increase in 2024 without breaking any previous highs.\n\nAccording to his vision, Ethereum’s infrastructure will capture a lot of value in the coming years due to its advantageous technology, but at the same time, competitors will grow alongside it:\n\n“In the long term, the price of assets will increase because Ethereum is the main ecosystem for blockchain projects. However, competition with other blockchain ecosystems will intensify.”\n\nTechnical analysis of ETH-USDT and ETH-BTC charts\n\nAt this point, to complete the overall picture of the future price predictions of Ethereum, let’s take a look at the ETH-USDT and ETH-BTC charts to identify potential starting points for the next predicted increases in the asset’s value.\n\nCurrently, the cryptocurrency is priced at $2417, well above the 50-period moving average on a weekly time frame, with the macro trend reversing after the declines of 2022 and becoming clearly bullish since January 2023.\n\nIn recent weeks, Ethereum has had some difficulty in surpassing the $2500 mark, never managing to close candles above the fateful level.\n\nOn multiple occasions, Ether has attempted to break out against the dollar, but without managing to surpass the $2800 high.\n\nTo give more space to the optimism of the bulls, it will be necessary to break the $2500 mark as soon as possible, trying to break into the area around $3000 as well. The volumes have not yet returned to 2020 levels but are gradually growing.\n\nThe RSI indicator is at a medium-high level in the channel but leaves fertile ground for other potential bullish climbs.\n\nWeekly chart of Ethereum price (ETH/USDT)\n\nAs for the ETH-BTC chart, we notice that the situation is quite different.\n\nPrices are currently below the 50-period moving average on a weekly time frame, indicating a more bearish outlook.\n\nSince August 2022, the currency of the world’s most famous smart contract platform has recorded a downward trend against the market king Bitcoin, losing about 40% from the highs to the lows of the last 2 years of trading.\n\nBy the end of 2023, Ethereum has consolidated within the range of 0.05-0.055, increasing the chances of a trend reversal and fueling positive predictions on the price of the crypto.\n\nIf the bottom has really been reached in recent months, then we can expect a year of strong rebounds both for ether and for many altcoins, which will benefit from the loss of power of BTC.\n\nCurrently, the most optimistic scenario involves a recovery of 0.07 by mid-2024, with the remaining 6 months of the year in which we could witness an attempt to remove one zero from the chart and bring ETH back to one-tenth of the value of BTC.\n\nThe most important resistance is located at 0.085 zone, which has acted as a peak in the chart for the past 5 years, preventing any return to the crazy levels reached during the bull run of 2017.\n\nWe are waiting to find out ETH’s next move towards BTC, in order to update price forecasts and identify the most likely targets."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPYTZPQkQxWWNLNVhBcUxDd3ZuNTh6d0hlTjVxZUJ6SkIxbDd2V0I3azFJRGhybVd4OGxNVlZ2SDNBNmxlNHE4UEZxejN3NXZJNkdqYTU3OWVJTzBSUWRBRFJEazV2aV91aU5OZTJLN1FpUEg4ZFN4WUFVWFU1ZkVpdTA2RUVPbmozM3Rv0gGQAUFVX3lxTE54QThLTGN3T3hFVGdaejBlXzlZcE5nVGdMcFh2SFhicTRrRk1taFJPd3AyYmxScmtqV1N4WjFJWXR3dGhmXzF4dXBPQ01kbVd4V19KNXpxVExrYVJMX2JRZGZHTTBjV2xRMXpKLTg4YmhZUDl5eDZEd3ZBMjdRSkpqd2g3NDRHbExKeWlleUR6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Rallies Toward $2400 As Dencun Upgrade Goes Live - CoinGape",
        "content": "The Ethereum crypto has witnessed a notable rally, with its price soaring towards $2400, buoyed by the excitement surrounding the imminent deployment of the Dencun upgrade. Ethereum’s core developers recently implemented the Dencun upgrade on the Holesky testnet, marking the final phase before its expected mainnet rollout in early to mid-March.\n\nThe integration of EIP-4844, a key feature of Dencun, is anticipated to revolutionize Ethereum’s scalability and cost-effectiveness, particularly for Layer 2 rollup chains. Notably, the Ethereum price rally today also sparked curiosity, despite the SEC delaying the spot Ethereum ETF approval from Invesco and Galaxy Digital.\n\nadvertisement\n\nEthereum Dencun Upgrade Live On Holesky Testnet\n\nDespite market consolidation, Ethereum has experienced a surge in price, fueled by optimism surrounding the upcoming Dencun upgrade. The successful implementation of Dencun on the Holesky testnet, as confirmed by Ethereum Foundation developer Parithosh, signifies a crucial milestone before its anticipated mainnet deployment.\n\nThis upgrade, featuring EIP-4844, notably promises significant enhancements to Ethereum’s scalability and transaction cost reduction, positioning the network for further growth and adoption in the evolving crypto landscape.\n\nMeanwhile, the Ethereum Dencun Upgrade underscores Ethereum’s dedication to ongoing advancement and innovation. With a focus on scalability through proto-danksharding, improved security measures, and enhanced network efficiency, Dencun is poised to strengthen Ethereum’s standing as a premier blockchain platform substantially.\n\nEthereum Price To $3,500?\n\nIn a recent analysis, prominent crypto analyst Michael van de Poppe highlighted the imminent uptrend for Ethereum (ETH), particularly as a focus on the Dencun upgrade. Van de Poppe predicts that the Ethereum price surge is imminent, with a target set at $3,500.\n\nExpressing confidence in Ethereum’s potential, van de Poppe emphasized that the market is currently undervaluing the significance of ETH. He further disclosed his strong preference for the Ethereum ecosystem, foreseeing it as a major driving force in the months ahead.\n\nMeanwhile, Bloomberg Intelligence analyst James Seyffart stated that he continues to expect more delays in spot Ethereum ETF approval in the coming months. According to Seyffart, the focal point for Ethereum spot ETFs currently revolves around May 23rd, which marks the final deadline set by VanEck, another ETF issuer seeking approval from the SEC.\n\nAccording to a study by Coingecko, Europe leads the global Ethereum (ETH) ETF market, holding an 81.4% share. The region boasts 13 ETH-backed ETFs, covering both spot products and futures funds, with assets under management (AUM) totaling $4.6 billion.\n\nCanada also plays a significant role in the ETH ETF market, holding a 16.6% share with $949 million in AUM. ETFs have emerged as a popular entry point into the crypto space for many Canadian investors.\n\nAs of February 2nd, the total global AUM for ETH ETFs reached $5.7 billion, spread across 27 ETFs offering both spot and futures funds\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcXJxQmVGU0VfTUh4X01TV2V1YW8xaFVDa2dQQWoyUlJsTnlXMldfVXJIV2RiVWJUYlpXUmo4VHE0ZHVTUTFVMzdkd092azN2NGVDS01uRVFUMjNRVF9PTDRyRm01cFhtaFJUMXpRSlpfcjhqRlBOT2NTYjJ1VUIzbERoSHZsUjjSAYwBQVVfeXFMT0ZxdEpTOE93N2FLaFJFYWRSVHM0b2JQMU4tRnhvaXZBM3FxbzAzeFc3NDlBcVFHNW5nMGR5aGgtelNYSjdoZW9sZjVHTEdIeTI5MTRLMWtSUlYweDNFNjQ5MGxxTzVIRjhTRDRqVkhIUTdMZjVIaGhySkZYcC1LWVAzalVjLXJ0emFIbUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Trader Pockets $166K Profit With Smart Moves: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a stunning display of trading acumen, an Ethereum (ETH) trader managed to secure a profit of approximately $166,000 within just two days, starting with an investment of merely 0.26 ETH (equivalent to $613). This remarkable feat was achieved through strategic transactions involving DeFrogs (DEFROGS), a new cryptocurrency that has recently captured the attention of the market.\n\nAdvertisement\n\nAccording to details shared by Lookonchain, a blockchain analytics platform, the trader embarked on this lucrative journey by initially investing 0.08 ETH ($190) to purchase 100 DEFROGS tokens. This transaction was executed despite the high gas fees at the time, which amounted to 0.178 ETH ($423). The decision to bear such significant transaction costs early on underscores the trader's confidence in the potential of their investment.\n\nIn just 2 days, this trader made $166K with only 0.26 $ETH($613)!\n\n\n\nThis trader spent only 0.08 $ETH($190) to buy 100 #DEFROGS using a high gas of 0.178 $ETH($423), then sold 60 #DEFROGS for 27.8 $ETH ($67K).\n\n\n\nHe currently has 40 #DEFROGS($100K) left, the total profit is ~166K! pic.twitter.com/g0VtlKoKGM — Lookonchain (@lookonchain) February 8, 2024\n\nThe strategy began to bear fruit when the Ethereum trader sold 60 of their DEFROGS tokens for a staggering 27.8 ETH, translating to approximately $67,000. This sale not only recouped the initial investment and associated costs but also yielded a substantial profit. As of the latest update, the trader still holds 40 DEFROGS tokens, valued at around $100,000, bringing their total profit to the vicinity of $166,000.\n\nMeme coin craze\n\nThis trading success story coincides with a significant surge in the value of DeFrogs (DEFROGS). The cryptocurrency has experienced a remarkable 111.91% increase in its value over the last 24 hours, with its price currently standing at $3,335 per token. This surge has propelled the trading volume of DEFROGS to $28.8 million and boosted its market capitalization to $34.27 million, highlighting the growing interest and confidence in this new digital asset.\n\nDeFrogs is part of the burgeoning meme coin sector , drawing inspiration from the Pepe (PEPE) crypto project. Launched on Feb. 7, DEFROGS is touted as a token based on the novel ERC-404 standard. This standard is designed to blend the features of cryptocurrencies with those of non-fungible tokens (NFTs), offering a unique value proposition in the digital asset space.\n\nThe story of this Ethereum trader's success serves as a testament to the potential rewards of strategic and informed trading within the volatile cryptocurrency market. It also underscores the importance of staying abreast of emerging trends and technologies in the digital asset space, where innovative projects like DeFrogs can offer significant opportunities for growth and profit."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOTVpOS2l3WjFPTUFrZjdoZmZiTHBhWFp0RDZ4MlR3RWM1QlRrOVYwdkZBVEtLZVdQZDNYZzY3ZnE5SXoyaThoT2NMQVBBUmIxSWt1YW8tMV9ua01lbEFsUTRPenc2ZF9TaGtoQkJDVlVZWVNMX1RfVnpjYXlPMS1rZ1RhMFZXN2N0Qk5jdmZNSUpzSWh0SGVncGZrQzJ6X1RGUE8xaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ark and 21Shares amend spot Ethereum ETF with cash creation/redemption policy - CryptoSlate",
        "content": "Ark Invest and 21Shares amended their joint application for a spot Ethereum exchange-traded fund (ETF) in a Feb. 7 S-1 filing.\n\nAccording to one section, financial firms that are allowed to purchase and redeem ETF shares will only have access to cash creations and redemptions. They will not have access to in-kind creations and redemptions involving ETH.\n\nThe relevant section reads:\n\n“Authorized Participants will deliver only cash to create shares and will receive only cash when redeeming Shares. Further, Authorized Participants will not directly or indirectly purchase, hold, deliver, or receive ether as part of the creation or redemption process or otherwise direct the Trust or an Ether Counterparty [in that respect].”\n\nCash creations and redemptions were key to recent approvals of spot Bitcoin ETFs, and as such, the same should be expected for spot Ethereum ETFs. Though it is unclear why the U.S. Securities and Exchange Commission (SEC) ultimately insisted on cash-based methods, some reports suggest that it is difficult for participants to handle crypto under current U.S. regulations.\n\nUpdate also puts forward ETH staking\n\nThe latest filing also suggests that the ETF issuers intend to engage in Ethereum staking. The filing states that 21Shares US LLC, the sponsor, “generally expects to stake ether tokens from the Trust’s Cold Vault Balance.”\n\nThe filing additionally notes that although staking may generate rewards, which are to be treated as income, staking also comes with a risk of loss.\n\nStaking is not guaranteed in the final proposal. Scott Johnsson, GP at Van Buren Capital, noted that this section is bracketed and uncertain. Bloomberg ETF analyst James Seyffart believes that the SEC will ultimately not allow staking.\n\nAmendment may be good news for ETH ETFs\n\nArk and 21Shares’ amendment is a relatively positive development for spot Ethereum ETFs. The SEC recently extended deadlines for several other ETH ETFs, including those from BlackRock, Fidelity, Grayscale, and Invesco Galaxy. By contrast, today’s amendment suggests some degree of progress.\n\nHowever, none of those developments change the fact that the SEC must decide on a spot Ethereum ETF by May 23. The agency must approve or reject VanEck’s proposal on that date and will likely decide on other similar funds simultaneously.\n\nExpectations around the approval of a spot Ethereum ETF are mixed. One Polymarket prediction market reports 43% odds of a May approval. Seyffart believes there is a 60% chance of approval, while one JP Morgan member believes there is a 50% chance. Standard Chartered Bank expects an approval in May, while TD Cowen does not expect an approval in 2024.\n\nWhile it is unclear whether the latest news has affected investor sentiment, Ethereum (ETH) has gained slightly more than the 24-hour market average. ETH is up 1.9%, the crypto market is up 1.5% and Bitcoin (BTC) is up 1.3%.\n\nEthereum Market Data At the time of press 8:45 pm UTC on Feb. 7, 2024, Ethereum is ranked #2 by market cap and the price is up 2.07% over the past 24 hours. Ethereum has a market capitalization of $292.25 billion with a 24-hour trading volume of $9.42 billion. Learn more about Ethereum › Ethereum $2,431.69 2.07% Crypto Market Summary At the time of press 8:45 pm UTC on Feb. 7, 2024, the total crypto market is valued at at $1.69 trillion with a 24-hour volume of $47.65 billion. Bitcoin dominance is currently at 51.18%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNMWdHLXNyVjQ1QzNlQkxUMXBxN3Vsa04wVDZKWTJ4b3lXQ2dPeU1XRVpIeS00cERpcll5WTRKbEQzQVhaWFlZSjdPNWZEOEJ6U09JbmJPQ3kwdFlRTmVvZEs2ZXZKNWFjTnZ5TVV4OWMyQTFSZlk5SVZrZzBhRjB5TTRnLXVSNDN3dGVPMzRoa2c0ZVlpcEJHSEtqejJzQ0Y3UjhWMnRKWUU3MHPSAbABQVVfeXFMTjI5dk1ZbVJac3d0dXFGX082ZjNaUTJnVjdUTWJseGFsbFFhX1pqTFRwUVk4Z2RVX1Vyc0wtTHl6QkJkOTJ2VzFzSkk0ZzZ1cG1RdDFKUVQwVllUc3BicGtFVk55TW1iYmRNTDdfU1cyU0t5ZDVIY2p2d2l4cXF5Y0gzZTBOeXdBamdBMC1CRUs5Z0kyeEJESDBUZ0xLWXdsbWV6aklLT0xXdHlkYm9TdHQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Lost Critical Support, Ethereum (ETH) Gains Momentum, XRP's Volatility Disappears - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nShiba Inu token has recently slipped below a critical support level at $0.000009. This drop signifies a potential pivot point for the asset, with the next critical support level now in the spotlight, highlighted by the stark blue line on the trading chart.\n\nThe loss of the $0.000009 support level is implying a shift in market sentiment from bullish to bearish. Traders often view such breaches as a signal for a potential downward trend, leading to increased selling pressure. The market seems to be in a precarious position, where the demand at the subsequent support level must hold to prevent further declines.\n\nFor SHIB, the next critical support level is now set around $0.0000087, highlighted by the blue line. This level represents a psychological and technical threshold, which, if breached, could intensify bearish momentum. The resistance level to watch is currently at $0.0000095, a boundary that SHIB needs to surpass to negate the current bearish outlook and potentially signal a reversal.\n\nAdvertisement\n\nIn a bullish scenario, if SHIB can consolidate above the current support and break through the resistance at $0.0000095, it could lead to a relief rally, attracting buyers back into the market. This could be driven by positive news, market sentiment or broader crypto market recovery. In this case, a move toward the next resistance at $0.000010 could be in the cards, potentially rekindling investor interest and speculative trading.\n\nEthereum gains confidence\n\nEthereum has seen a resurgence of momentum, possibly catalyzed by the recent outage on the Solana network. Investors are increasingly favoring stability, and Ethereum's uninterrupted service during Solana's downtime may have reinforced its position as the go-to platform for developers and investors seeking reliability.\n\nThe Ethereum network has maintained its operations without significant issues, which stands in stark contrast to the outage experienced by Solana, often touted as an Ethereum competitor. This reliability has not gone unnoticed. Amid fears of potential future outages, Solana's instability has inadvertently highlighted Ethereum's robustness, possibly triggering a shift in investor preference toward Ethereum.\n\nA look at the Ethereum price chart suggests a bullish trend, with the asset recently rebounding off the 50-day EMA, currently at around $2,331. The next resistance level to watch is around the $2,367 mark, which, if surpassed, could pave the way for further gains.\n\nThere has been speculation in the past that individuals with significant market influence, such as Sam Bankman-Fried, have contributed to network instabilities to benefit their trading platforms. While these rumors have been persistent, the recent Solana incident appears to be the result of a genuine surge in activity, rather than any malevolent interference.\n\nAs Ethereum continues its climb, support levels have solidified, particularly around the $2,206 line, aligning with the 100-day EMA. This level is crucial for Ethereum to maintain its current momentum and avoid a retracement toward lower supports.\n\nXRP's issues with volatility\n\nXRP is now facing a period of stagnant volatility and waning interest. With the ongoing SEC case showing no signs of progress and market participants shifting their focus elsewhere, XRP's trading volume and network activity have significantly dwindled.\n\nA glance at the XRP price chart reveals a constrained trading range, with the cryptocurrency struggling to make decisive moves. Currently languishing around the $0.50 mark, XRP finds itself trapped between the immediate support level at $0.49 and a faint resistance near $0.56. This tight range indicates a lack of enthusiasm from traders, with minimal volume to suggest any forthcoming change in this dynamic.\n\nThe decreasing volatility is symptomatic of broader market sentiment toward XRP. Without substantial developments in its legal challenges or breakthrough use cases that rekindle interest, XRP remains in a state of limbo. The once vibrant and highly speculative asset now sees days of minimal price change."
    }
]