[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTk04ZkktSF9VTU80d0w5VmtWRkx6RUt5YWNsSGc2dGVkYm1mbkhUODhWZld0OTNFVHByTlZmQ1hZanRyOEM2TFAwVzVwaG9kaVZqSXF5MmR3ZVBnT0lKZ3RUX2Q4Qmg2V0xhblRpWlJwSlN1dWxQV3pZN0pPRjZKYQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Breaking Down Ethereum's Big Move and Why History Says It Will Do This Next - The Motley Fool",
        "content": "Ethereum is getting an ETF (or several) and it could lead to a major price surge.\n\nIt's been a wild ride for Ethereum (ETH 0.17%) over the last few years. Since launching in 2015, the cryptocurrency has grown by nearly 128,000% thanks to its novel smart contracts and dominance of the decentralized finance (DeFi) economy. Yet, as impressive as the last decade has been, its story might just be getting started.\n\nOn May 23, the Securities and Exchange Commission (SEC) paved the way for approval of a spot Ethereum exchange-traded fund (ETF). When completed, this process essentially opens up the cryptocurrency to a new set of buyers and puts additional demand on its deflationary supply. Here's why the decision is so historic and what it could mean for the world's second-most valuable cryptocurrency.\n\nA landmark decision\n\nJust a few weeks ago, the chances of a spot Ethereum ETF approval looked slim. Many analysts estimated there was only a 25% chance, but on Thursday, May 22, things took a turn for the better as rumors began to swirl that the SEC had had a change of heart.\n\nThe following day, it was officially announced that the SEC would approve all eight 19b-4 applications, paving the way for Ethereum ETF approval. It's not exactly the same thing as full approval, but that final step is almost guaranteed at this point. On the current timeline, the SEC is expected to approve the S-1 applications (the official documents that allow the ETFs to go live) sometime in the mid to late summer.\n\nThe reason an ETF is so significant comes down to its ability to democratize access for investors. With the ETFs, now investors can gain Ethereum exposure by simply buying shares like they would with a stock on a brokerage. Gone are the days of navigating crypto exchanges or managing digital wallets.\n\nIn addition, and perhaps most importantly, the approval of an ETF means institutional investors can join the game. Without an ETF, these investors were hesitant to get in on crypto because of a lack of regulatory guidance and custodial issues. That's why not only Ethereum's, but all of crypto's, ascent over the years has been driven by retail investors.\n\nBut ETFs provide an easy and accessible way for institutions to buy. And that's a great thing because institutional investors are known for their vast resources and deep pockets.\n\nCharting the future trajectory\n\nTo quantify the impact an Ethereum ETF holds, we can look back at Bitcoin's spot ETF journey. In January, Bitcoin became the first cryptocurrency to get a spot ETF, marking a landmark event in the world of crypto adoption and evolution. The 11 initial Bitcoin ETFs were a massive hit and quickly became one of history's most successful ETF launches. In just four months, they attracted more than $38 billion and at one point were buying up 10 times the daily supply of Bitcoin, effectively introducing a supply shock that sent Bitcoin's price to an all-time high.\n\nWhile it's unlikely that Ethereum ETFs will be as popular as Bitcoin ETFs simply because Bitcoin is the most well-known crypto asset, Ethereum still stands to benefit significantly. This is because Ethereum's market cap is smaller than Bitcoin's. In other words, it will take less capital to move Ethereum's price than Bitcoin's.\n\nWe can even speculate just how much Ethereum's price might move (emphasis on speculate). Since the Bitcoin ETFs launched, around $425 billion was added to its market cap. Not all of this was the direct result of the ETFs buying Bitcoin, but we can use it as a proxy to measure the effect of the ETFs.\n\nIf Ethereum ETFs were to be half as successful as the Bitcoin ETFs, then it would add $212 billion to its market cap, or roughly a 45% increase. If this were to occur, Ethereum's price would soar to $5,300, a new all-time high.\n\nThe road ahead\n\nWhile we can only speculate about the exact demand the Ethereum ETFs will generate, one thing is certain: Ethereum is about to be unlocked to a new class of deep-pocketed investors.\n\nThe impact of these ETFs will unfold over time, as institutional investors typically require extensive research and due diligence before making allocations. However, considering the success of Bitcoin ETFs and the recent trend of institutions revealing Bitcoin holdings, it's arguably not a question of if, but when these investments will materialize.\n\nIn the meantime, Ethereum presents a compelling investment opportunity. Despite its current price being around 25% below its all-time high, Ethereum's fundamentals have never been stronger. As we approach full ETF approval, expect increasing demand for the world's second-most valuable cryptocurrency."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOWDBXYTV1RTVWa1pCQ3lybnNiNkVjNkg2dWFfVUhta056cmVZdk9vZVNhUEZ6anMyREIwbnU2bU5QYk56bzJ0WjMxU1hsNGtPa0ViaVoxbUxsMXFpX1M0MmZ2bXE4ckF1Qk5DMC1BZWRPSjJvUjhYYndmZTVuNkJpZ20wTlBCdkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock Amends Spot Ethereum ETF Proposal with SEC, End of June Launch Possible - Yahoo Finance",
        "content": "BlackRock Amends Spot Ethereum ETF Proposal with SEC, End of June Launch Possible\n\nBlackRock has updated its filing with the Securities and Exchange Commission (SEC) for its proposed spot Ethereum exchange-traded fund (ETF). The May 29 amendment to the iShares Ethereum Trust marks a crucial step toward making an ETH-based ETF available to the market, following last week's surprising approval of a similar financial product.\n\nEric Balchunas, a Bloomberg analyst, suggested that other applicants are likely to follow BlackRock's lead. He added that if the SEC provides another round of detailed feedback swiftly, spot Ethereum ETFs could potentially launch as early as next month. “End of June launch a legit possibility, [although] keeping my over/under date as July 4,” Balchunas posted.\n\nBlackRock's proposed ETF, which will trade under the ticker symbol ETHA, clarified that it will not engage in Ethereum staking. This means the returns from the ETF will differ from those that would be obtained by directly purchasing and holding Ethereum.\n\nThis week has been monumental for the cryptocurrency sector. In Washington, D.C., a rare instance of bipartisan support emerged for a crypto regulation bill, culminating in the SEC’s unexpected approval of spot Ethereum ETFs. Joe Lubin, Ethereum co-founder and CEO of Consensys, views these developments as a pivotal shift in the regulatory landscape for cryptocurrencies in the United States.\n\nBlackRock initially filed an S-1 form for its spot Ethereum ETF with the SEC in November, joining other heavyweights like ARK Invest, Fidelity, and VanEck. Crypto custodian Grayscale is also in the race, seeking to convert its Grayscale Ethereum Trust (ETHE) into a spot Ethereum ETF, a move similar to the one that paved the way for spot Bitcoin ETFs."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNX2RJRy1tNWlpUEYxSGlYdE9ySzg3b3dSN1hpekcwakx2Qmt4VU1fTDhpN2RrU2I5TnJKaGJEaHBGUEstZlFhWEVoZmZaNjlkeHJvWFBFdmlycnFPUTlPcFI3eGN4T3JUc1JJVllJbVN0SWhHMDEzWHpTZ3BYLVRmcnNhYTlUdGFlRWNFWWZrQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Likely Protect Ether From the SEC. But What About Staked ETH? - Unchained",
        "content": "The SEC’s approval for Ethereum spot ETFs may help clarify ether’s commodity status, but it still leaves room open for the agency to put staked ether, and staking, in its crosshairs.\n\nFrom the day Ethereum switched to proof of stake, Gary Gensler, the chairman of the SEC, has been hinting that staking could violate securities laws.\n\nThe recent approval to list spot Ethereum ETFs in the US has brought some clarity to the question of whether ether is a security or a commodity, since the issuance order for the funds lists them as “commodity-based trust shares.”\n\nAs Unchained recently reported, the issuance order, which places ether’s status as a commodity, could provide a strategic advantage to any crypto companies caught in legal battles with the U.S. Securities and Exchange Commission (SEC) regarding ether. Yet many of those battles surround staking and staked ether, which the agency is yet to provide any clarity on. From the day Ethereum switched to proof of stake, Gary Gensler, the chairman of the SEC, has been hinting that staking could violate securities laws.\n\n“From the coin’s perspective…that’s another indicia that under the Howey test, the investing public is anticipating profits based on the efforts of others,” he said in an interview with the Wall Street Journal in September 2022, not referring to any one specific cryptocurrency at that time.\n\nThe Significance of the Merge\n\nIn March, Fortune reported the Ethereum Foundation had been under scrutiny by the SEC since Ethereum transitioned to a proof-of-stake model in September 2022. This transition, according to sources familiar with the SEC’s investigation, provided the agency “with a new pretext to attempt to define Ethereum as a security.” Software firm Consensys received a Wells notice from the agency regarding MetaMask staking, which partners with liquid staking providers Lido and RocketPool. Crypto exchanges Kraken and Coinbase were also sued by the agency in relation to its staking services among other allegations.\n\n“The change in Ethereum’s consensus mechanism to proof of stake (and the way in which staking was determined to work, as a result) was certainly a moment in time when the facts surrounding the protocol (or aspects of the protocol) changed,” said Zachary Fallon, a partner at law firm Ketsal, in an email. “And it seems to me that the SEC has viewed this change as potentially material and worth exploring for purposes of its potential oversight.”\n\nRegulatory Uncertainty Remains Around Staked ETH\n\nPrior to the approvals of the spot Ethereum ETFs, the ETF issuers who intended to offer staking were asked to remove that detail from their filings, which means the ether ETF approvals do not put staked ether in the clear in the same way it does for ether’s security status. However, several ETF experts previously told Unchained that it was unlikely that staking would be included in the initial approval of the funds because it was not “the status quo” across all applications.\n\nAnd while the issuance order brings some more clarity to ether’s security status, Sam Enzer, a partner at Cahill Gordon & Reindel, previously told Unchained that the commission could still revisit that determination. An SEC spokesperson declined to comment on the status of ether or staked ether.\n\n“The SEC has, I think, … reserved room to argue that ether staking is securities activity,” said Enzer. “Whether they will press that argument remains to be seen.”\n\nThe Consensys lawsuit against the SEC seems to indicate that the SEC views liquid staking tokens as securities, with passages such as, “[O]n September 21, 2022, Consensys received another letter from the SEC staff advising that the agency was conducting an investigation into certain staking protocols on the Ethereum network.”\n\nElsewhere the lawsuit stated, “The SEC staff also stated its view that Consensys, in connection with its MetaMask Staking program, violates both Sections 5(a) and 5(c) of the Securities Act by engaging in the offer and sale of unregistered securities and violates Section 15(a) of the Exchange Act by acting as an unregistered broker-dealer.” The liquid staking tokens available on MetaMask Staking in the US include tokens from Lido and Rocket Pool.\n\nIs Staked ETH a Security?\n\nAlex More, head of litigation at Carrington, Coleman, Sloman, and Blumenthal, previously told Unchained that it would be tough to argue that a user who is staking is participating in a securities transaction because there is no managerial efforts, they are just protecting the integrity of the network. The challenge is when an entity — decentralized or centralized — aids the user in the staking process, he said. If the entity does something to manage those staked assets then the SEC might have a stronger case that it’s a securities offering, he added.\n\nEnzer agrees with More’s assessment, noting that he doesn’t believe staked ether itself is a security nor is Gensler going to sue someone who holds staked ether. Tokens are not securities, he added.\n\n“I think [Gensler] thinks the Ethereum Foundation is a centralized issuer and the security they are offering is a staking program,” Enzer said. “The staked ether, you could say, is the object of that transaction.”\n\nThe foundation, staking providers and developers of staking protocols could all be in danger of being characterized as operating an investment contract scheme by the SEC, he added.\n\nThe Ethereum Foundation did not respond to a request for comment from Unchained regarding the status of staked ether or regarding the reports of an investigation by the SEC.\n\nWhere the SEC Could Go From Here\n\nThe SEC already won one case in relation to staking. It charged crypto exchange Kraken with failing to register the offer and sale of its staking-as-a-service program. The SEC alleged that Kraken touted benefits derived from the exchange’s efforts on behalf of investors. Kraken settled with the SEC, closing down its staking program in the US and paying $30 million in civil penalties.\n\n“Kraken was his first case against a major exchange, but it wasn’t an attack on the entire exchange’s platforms. It’s one little thing, then he sues Coinbase, Binance, Kraken. Whether he would go after the Ethereum Foundation or Lido or any of these other providers in the ecosystem that relate to staking, I think it depends on what happens as cases are making their way through the courts — if he wins certain rulings in some pending cases,” Enzer said.\n\nIf a case is brought against Uniswap and MetaMask, which have both already received Wells notices, then those could touch on issues that could set a precedent that would be relevant for whether he would want to pursue a case against staking protocols or the Ethereum Foundation, he added."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPanVtV05KNkZKSzdLSGNqb1o3cUxkajRhVnlrLWpVTmRIVjNMbHYtRmR0VjhFV2tDV3RXUUZua3VOenp5OEp5by1lU0ltVHVCN0N0blF4MUVYd1I2OHZhX0E4dHBDY3FOUDdVdXlCSDdBWkRoaHNENHc5UDRiM0UtRTdWVDdMc1FydFdTdkhCNDB0eXRyXzc1bjhGZjdmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Blackrock updates S-1 filing for Ethereum ETF, marking step toward launch - CryptoSlate",
        "content": "BlackRock amended the S-1 registration statement for its spot Ethereum ETF in a May 29 filing, marking a step toward approval.\n\nThe filing builds on BlackRock’s original registration statement, which was initially filed in November 2023.\n\nBloomberg ETF analyst James Seyffart called the filing a step toward launch after the SEC approved 19b-4 listing rule changes on May 23.\n\nHe said:\n\n“This is almost certainly the engagement we were looking for …”\n\nSeyffart reaffirmed his belief that the S-1 statements could gain approval in the coming weeks, leading to spot Ethereum ETF launches, but admitted that the “norm is months.”\n\nPlaceholder data filled\n\nThe S-1 filing fills several placeholder fields, including details about seed funding.\n\nAccording to the filing, the fund has generated $10 million in proceeds via a seed capital purchase by BlackRock Financial Management of 400,000 shares at $25 per share.\n\nThe sponsor, iShares Delaware Trust Sponsor, may collect up to $500,000 in fees per annum. The latest filing does not calculate a percentage-based sponsor fee.\n\nThe trust will issue and redeem shares only in blocks of 40,000. The fund’s ticker is ETHA.\n\nWilmington Trust, National Association will act as the Delaware trustee. Bank of New York Mellon will act as trust administrator and cash custodian.\n\nIn-kind redemptions considered\n\nThe new S-1 also reintroduces the possibility of in-kind creation and redemptions, which would allow for crypto rather than cash transactions among authorized participants.\n\nIt acknowledges that approval of in-kind transactions is not guaranteed and that timing is uncertain.\n\nBlackRock’s original S-1 statement mentioned the possibility of in-kind creations and redemptions in passing. However, an amendment notice to Nasdaq’s 19b-4 filing in April said that authorized participants would rely solely on cash when creating and redeeming shares in the fund.\n\nThe latest S-1 also explicitly states that BlackRock will not engage in ETH staking, aligning with Nasdaq’s second May 22 19b-4 amendment on behalf of BlackRock.\n\nAll other ETH ETF issuers have also removed the possibility of staking from their applications.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxORUNSbXk4YTlPSzM0MDZET0puMjdNUFdsVTNWdHIyU1BEY1Y0aW50QTJuMDRYVFdKdTZFeXV1cnpDXzhZeUR4czhqRWdmMnlpYmVONW5qTFRiY0hyUGZBZV9ZNUhucjliWUE2YkRDOHZoalV1a19XcXNWcG0tN0RtU0hiSUhlRnl1OW1leUU3LV9JZVJVTUg0Zm1nYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin reveals five ways he’d rebuild Ethereum from scratch - DLNews",
        "content": "Ethereum's architect shares thoughts on smart contracts, EVM, and other features.\n\nButerin says Ethereum developers should have shipped Proof of Stake sooner.\n\nEthereum is going mainstream with advent of ETFs.\n\nWhen 620 weary developers emerged after three days of nonstop coding at this year’s ETHBerlin event last week, few expected Vitalik Buterin to be speaking on stage.\n\nThe co-founder and prime architect of Ethereum was a surprise guest.\n\nWhat was even more surprising were some of his reflections on building the industry’s second-largest blockchain. Buterin described some of the regrets he had about the initial design of Ethereum in detail.\n\nFor many in the audience, his discourse not only evoked the halcyon days of the network’s birth in 2014, but it also helped fill in the road map for what comes next for a cryptocurrency now worth $448 billion.\n\nThe US has just approved a spot Ethereum exchange-traded fund, and BlackRock, the world’s largest asset manager, has launched its own tokenised fund on the blockchain.\n\nThe Ethereum network has spawned a sprawling ecosystem of developers and financial applications worth more than $63 billion, and it has become a byword for decentralised finance.\n\nList of things\n\nStill, Buterin, a 30-year-old Canadian-Russian programmer, said he has a list of things he would have done differently. They range from the development of Ethereum’s Virtual Machine to smart contracts to the Proof of Stake consensus mechanism.\n\nAnd he remarked that even as Ethereum goes more mainstream, it’s still misunderstood.\n\nJoin the community to get our latest stories and updates\n\n“Bitcoin has a simple narrative which is digital gold,” Buterin said. “But like with Ethereum, it’s like ‘Whoa, what the heck is Ethereum?’”\n\nETHBerlin04 in numbers 🧮\n\n\n\n- 802 super humans in total\n\n- 627 hackers\n\n- 83 project submissions\n\n- 56 volunteers\n\n- 40 experience hosts\n\n- 33 judges\n\n- 18 mentors\n\n- 15 core team\n\n- 13 speakers\n\n- 20ish dogs — ETHBerlin04 (@ETHBerlin) May 26, 2024\n\nETHBerlin04 in numbers 🧮\n\n\n\n- 802 super humans in total\n\n- 627 hackers\n\n- 83 project submissions\n\n- 56 volunteers\n\n- 40 experience hosts\n\n- 33 judges\n\n- 18 mentors\n\n- 15 core team\n\n- 13 speakers\n\n- 20ish dogs — ETHBerlin04 (@ETHBerlin) May 26, 2024\n\nSeated on comfy couches on stage with ETHBerlin organisers Afri Schoedon and Franziska Heintel, Buterin opened his chat by sharing his fondest memories of the German capital over the years — hacking in the old office with Ethereum co-founders Gavin Wood and Jeffrey Wilcke, launching Devcon Zero, and celebrating the Merge upgrade in 2022.\n\nThen Schoedon popped the question.\n\n“With everything you know and everything you learned over the last 10 years, how would you build Ethereum differently today if you could start from scratch?” Schoeden asked.\n\nVitalik Buterin (centre) discussed Ethereum's vision, then and now, in a discussion at ETHBerlin. Photocredit: Liam Kelly/DL News.\n\nToo many bits, too early\n\nButerin’s first qualm concerns Ethereum’s Virtual Machine, which is key to making the network function as a kind of decentralised mega crypto computer.\n\nHe explained that Ethereum’s original EVM design used 256-bit processing instead of 64- or 32-bit.\n\nIn computer architecture, the size of computing is measured in bits, with larger bits offering better efficiencies and processing more data. But 256 bits is very inefficient for most operations, and can create a lot of bloat on a blockchain, even for simple tasks.\n\nFor a network in its early days, Ethereum didn’t need to optimise for this.\n\n“The original design was way too overfitted for 256-bit,” Buterin told the audience.\n\nOptimise smart contracts\n\nSecond, Buterin said the early Ethereum developers should have focused on making it easier to write smart contracts with fewer lines of code.\n\nThe reason? Added transparency.\n\nWith fewer lines of code, he said, “people can properly see and check what’s going on inside of them.”\n\nVolunteers and developers playing music at a hackathon in Berlin. Photocredit: ETHBerlin.\n\nSwitch to a ‘crappier’ version of staking\n\nInstead of custom-built computers — called miners — running nonstop to secure a blockchain network, Ethereum switched to a different model.\n\nEthereum’s switch from a Proof of Work consensus mechanism — the way nodes in a blockchain like Bitcoin’s agree on the state of transaction data — to Proof of Stake in 2022 should have happened much earlier, Buterin said.\n\n“When we switched to Proof of Stake, we should have been willing to switch to a somewhat crappier version of Proof of Stake earlier on,” he said. “We ended up wasting a lot of cycles on really trying to make Proof of Stake perfect.”\n\nInstead of miners, Ethereum is now secured by validators who have staked 32 Ethereum, worth roughly $124,000, to do the same thing — and be rewarded for it. If they misbehave by validating fraudulent transactions, for example, they are penalised.\n\nIn sum, the switch swapped out raw, energy-intensive computing power with economic incentives.\n\n“We could have saved a huge amount of trees if we had a much simpler proof-of-stake in 2018,” Buterin said.\n\nIssue logs from day one\n\nFrom big-money token transfers to backdoor honey pots, users can follow the money quite easily in crypto. That’s thanks in part to automatic logging.\n\nBut as the industry advances, notably moving from externally owned accounts like MetaMask to smart wallets like Safe, certain aspects of that crucial logging are lost.\n\nNotably, automatic logs for Ether transfers.\n\n“It should have been in there from the beginning,” Buterin said. “It could have been like 30 minutes of coding from myself, Gav and Jeff. Instead, it’s an EIP.”\n\nEthereum Improvement Proposals are formal proposals made by developers to change certain aspects of the Ethereum network.\n\nEIP-7708, which Buterin submitted on May 17, would make this precise change.\n\nAmeen Soleimani, strategic advisor at 0xbow and co-founder of MolochDAO and Reflexer Finance, discussing the Tornado Cash case. Photocredit: Liam Kelly/DL News.\n\nDrop Keccak\n\nButerin also said he would have used SHA-2 for Ethereum’s hash function rather than the current function called Keccak.\n\nTo understand the difference, one must dig into a bit of cryptography lore, specifically about how SHA-3 became a standard. Remember, before crypto became synonymous with celebrity memecoins and nine-figure initial coin offerings, it was about complicated math.\n\nWhen Ethereum was being built, the hash it used was in a “hash function competition” — yes, that’s a thing.\n\nThe National Institute of Standards and Technology organised the competition to create a new hash standard alongside SHA-2.\n\nPrevious standards had been attacked and debunked. But SHA-2 was unscathed and the NIST simply wanted a safe alternative. After all, variety is the spice of life (and apparently cryptography).\n\nKeccak was just one of several contestants that entered the competition. During the competition, the team made some minor changes to its algorithms, eventually leading to them being crowned the winner. In other words: SHA-3.\n\nThe early Ethereum team had, however, already implemented a non-standardised version of Keccak. Essentially, Ethereum is using a pre-SHA-3 iteration.\n\nCo-founder and CPO of ChainSafe Gregory Markou and founder and CEO of Phylax Systems Odysseas Lamtzidis speaking on stage at ETHBerlin. Photocredit: ETHBerlin\n\nBig whoop, right?\n\nWell, this meant that Ethereum developers needed a custom library — collections of reusable code that needn’t be rewritten from scratch — to accommodate both SHA-3 and Keccak.\n\n“We’re not compatible with other systems using SHA-3,” Marius van der Wijden, a core Ethereum developer, told DL News. “We have to support both algorithms in the EVM.”\n\nIt’s essentially been solved. Today, big libraries support both encryption mechanisms.\n\nSo, yeah, big whoop indeed.\n\n“It doesn’t matter in the grand scheme of things, and current development is definitely not impacted by it,” said van der Wijden.\n\nEthereum’s crack team\n\nDespite the list of minor design misses, Buterin said it’s inevitable for any project to have a few.\n\n“I’m just really happy that I feel like our core devs and their execution capacity feels like it just keeps increasing with each passing year,” he said.\n\n“We’re in a position to effectively and safely correct some of these mistakes.”\n\nLiam Kelly is a DeFi Correspondent at DL News. Got a tip? Email at liam@dlnews.com."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNMXZBMDdvNFVJTTdnZlNPTURnSTdCOVYzQXIxLXlURTl6c0ZERmtIQmhTNDJIQ1hxUHF2THh2ZVRSbkVQdTRlMWh6cThPeGstOVZHQVN6ZG9oWUV6d1M1bVh5WEJaU2YwTExmZDZ5eTFTaWNjTVdSdFdOSDZxSXJfSFNweFllcjl6T2dzWXZKOEtNMkdiNzFkeQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum’s Rally to $5000 Should be Underway - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNeFluTXZWanJ6Rm5TME1aaEtZRW96RGVhMndJd0Q2YkR2TmJieVZQeU51LWE3QnBudlpsUGJfUmQ3UXVkaDBVM3JOU0gzWjByRVRrcTJ3Q1NSdS1lVVhzbFFiVWZvYzdnUFZFbzRwZVRKOFpGODAzYVdTVUlaMUVGLVlCc0dNX3EwR3JiNVBscFpTTWtCYXZlNXpRUnBBQ1N2SnhuZDMwTTVQbkYzbXdaUzRjb3JSWWN6UmlNRGhOaGVWQVlq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Could Outperform Bitcoin, Reaching Nearly 15K per ETH, Explains Analyst - CryptoGlobe",
        "content": "Michael Nadeau, a prominent crypto analyst, recently provided an in-depth analysis of the current and future state of the cryptocurrency market, with a particular focus on Bitcoin (BTC) and Ethereum (ETH).\n\nMichael Nadeau is a well-regarded crypto analyst known for his work at The DeFi Report, where he provides in-depth research and analysis on decentralized finance (DeFi) and blockchain technology. Nadeau is particularly noted for his insights into the performance and valuation of blockchain networks like Ethereum.\n\nAccording to ETF experts at Bloomberg, ETH ETF flows are expected to represent about 10-20% of BTC ETF flows. This prediction is based on several factors:\n\nLower institutional interest in ETH compared to BTC.\n\nGreater complexity in understanding ETH.\n\nLower trading volumes in ETH futures compared to BTC (10-20%).\n\nLower spot trading volumes of ETH relative to BTC (about 50%).\n\nETH’s market cap being approximately one-third of BTC’s.\n\nGiven that BTC ETFs have seen about $13 billion in net flows since their launch, Nadeau suggests that if ETH achieves 10-20% of this figure, it would result in $1.3-$2.6 billion in net inflows for ETH ETFs.\n\nNadeau draws a parallel between BTC’s price surge after the US-listed spot Bitcoin ETFs launched and potential movements in ETH. BTC saw a 75% gain from $40,000 to $70,000 shortly after its spot ETFs started trading, leading Nadeau to expect a similar performance from ETH, potentially pushing it past its previous all-time high of $4,800.\n\nSeveral factors could contribute to ETH’s outperformance:\n\nETH validators do not have the same “structural sell pressure” as BTC miners, who need to sell a portion of their mined coins to cover operating expenses.\n\nA significant portion (38%) of ETH supply is “soft locked” on-chain, earning yield in staking contracts, DeFi applications, or as collateral.\n\nETH balances on exchanges are at their lowest since 2016, suggesting less sell pressure.\n\nETH’s reflexivity could amplify price movements, with price action leading to more on-chain activity, more ETH burned, and further narrative-driven price increases.\n\nNadeau envisions ETH not just as a cryptocurrency but as a technology play on the growth of Web3, offering a larger addressable market than BTC, which is viewed as “digital gold.”\n\nNadeau extends his analysis to the broader crypto market, expressing a highly bullish outlook. He anticipates favorable conditions driven by several cycles:\n\nInnovation Cycle : Continued advancements in blockchain technology and DeFi.\n\n: Continued advancements in blockchain technology and DeFi. Macro/Liquidity Cycle : Favorable economic conditions and increased liquidity.\n\n: Favorable economic conditions and increased liquidity. Election Cycle : Political developments influencing market sentiment.\n\n: Political developments influencing market sentiment. Bitcoin Halving Cycle : Historical patterns showing price increases post-halving.\n\n: Historical patterns showing price increases post-halving. ETF Approvals: Increased accessibility and interest through BTC and ETH ETFs.\n\nHe points out that regulatory concerns have lessened, particularly with the market no longer fearing aggressive actions from regulators like Gary Gensler.\n\nUsing a hypothetical $10 trillion market cap for crypto, he makes the following predictions:\n\nBTC at 40% of the market cap would reach $4 trillion, translating to a price of $202,000 per BTC.\n\nETH at 45% of BTC’s market cap would reach a $1.8 trillion market cap, implying a price of $14,984 per ETH.\n\nHe points out that this assumes no change in supply from current levels. He also mentions that even more conservative estimates suggest significant price increases for both BTC and ETH."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPelg2Vk1ESVlqb2ZaYm1nNFgtOVh0T1A3T19YanNTUTN3N2toeFd5VWRjUE53TmY3cktmTFJRaGRZVmc2QTBTXzlQWGhYbGF3cmxxczRoS3lrV0JNNkVLOE9leWxLTlY1d3c0T0M0M3g0TXVnTjh1VU55NDdoSVZhVVFCbV9scXl1d3p5Y3JiVTZqUWJtdFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "5 Things to Know About Ethereum's First Spot Price ETFs - The Motley Fool",
        "content": "The SEC has finally cleared the way for the first Ether spot price ETFs.\n\nOn May 22, the U.S. Securities and Exchange Commission (SEC) approved the first eight applications for Ether (ETH 0.17%) spot price exchange-traded funds (ETFs) from Grayscale, Bitwise, iShares, VanEck, Ark Invest, Invesco, Fidelity, and Franklin Templeton. Ether is the world's second largest cryptocurrency and the main coin of the Ethereum Network.\n\nThat announcement came just four months after the SEC cleared the first spot price Bitcoin (BTC -0.37%) ETFs for trading. But should investors assume these planned ETFs will set a firm floor under Ether's price and become compelling long-term investments? Let's review the five key facts to decide.\n\n1. The first Ether ETFs won't start trading anytime soon\n\nThe SEC approved the initial regulatory filings for the eight Ether ETFs, but they won't start trading until the agency approves their S-1 filings. That process could take several months. For reference, the SEC approved the S-1 filings for the first Bitcoin spot price ETFs approximately three months after clearing their initial regulatory filings.\n\n2. The decision turns Ether into a commodity\n\nIn the past, the Ethereum and Bitcoin blockchains both used an energy-intensive proof of work (PoW) mining method to produce coins. But in 2022, the Ethereum Network switched to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced the network's energy consumption by 99.95% and made it deflationary -- which meant more Ether was being burned than produced.\n\nHowever, the SEC initially claimed The Merge made the Ether coin and Ethereum-based tokens more similar to securities than commodities. The move made a radical change to how Ether coins are created and managed. Regulators then repeatedly declared that Bitcoin was the only cryptocurrency that could be classified and pinned to spot price as a commodity, since it was digitally mined like a precious metal through the PoW method.\n\nTherefore, the SEC's decision to approve the first Ether ETF filings implies the coin can now be classified as a commodity instead of a security. That shift might clear the way for smaller Ethereum-based tokens such as Shiba Inu -- as well as independent PoS-driven cryptocurrencies like Solana -- to get their own spot price ETFs.\n\n3. Ether ETF investors can't stake their holdings\n\nAnother key difference between Ether and Bitcoin is the process of \"staking,\" which allows investors to earn interest by locking up their Ether coins on the network for a period of time. The SEC, which argues that staking-as-a-service solutions should be classified as unregistered securities, previously sued cryptocurrency exchanges including Coinbase (COIN -6.83%) and Kraken for allowing users to stake their own coins.\n\nGrayscale, Ark, and the other firms originally wanted to add staking features in their ETFs, but they removed those proposals in their updated filings last month. That change could make their ETFs less appealing than the actual digital coins.\n\n4. The SEC approved the filings probably to avoid more litigation\n\nLast year, the SEC lost a lawsuit against Grayscale, which had sued the agency for trying to block the conversion of its popular Bitcoin trust into an ETF. That loss softened the SEC's position and cleared the way for the first Bitcoin ETFs.\n\nEarlier this year, blockchain company Consensys sued the SEC for its refusal to recognize Ether as a commodity, while Grayscale and its peers were widely expected to sue the SEC again if it didn't approve their regulatory filings for spot price ETFs. So for now, it seems the SEC has backed off on tightly regulating Ether to avoid more legal battles.\n\n5. The Ether ETFs should attract less attention than the Bitcoin ETFs\n\nGrayscale currently holds nearly $11 billion in assets in its GrayScale Ethereum Trust (ETHE -3.95%), which it's attempting to convert into a spot price ETF. However, that's a lot smaller than the Grayscale Bitcoin Trust before its conversion into its spot price ETF, which now hosts more than $20 billion in assets.\n\nThese new Ether ETFs might attract some attention from mainstream and institutional investors, but they probably won't gain as much momentum as the Bitcoin spot price ETFs earlier this year. Ether also doesn't have any major near-term catalysts that are comparable to Bitcoin's halving, which halved the rewards for mining, earlier this year.\n\nShould you buy the Ether ETFs?\n\nThe Ether ETFs might not attract as many investors as the Bitcoin ETFs, but they might represent an easy way for investors to gain exposure to Ether without directly buying the coins. But investors should still be mindful of the fees, see if they actually match Ether's spot price, and realize they won't be able to stake their holdings.\n\nTherefore, investors shouldn't rush to buy the Ether ETFs once they hit the market. Instead, they should wait and see if the convenience of owning these ETFs in a brokerage account outweighs the advantages of owning Ether in a crypto wallet."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOd0tYMF83dHdUR1hWa2Jfd0RQV1B1aHhhb3BEYVRycmdjZW5oVmlPNk5peFRxYm1fTldZcFZpM3ZpdnNld1BQcXZ6ZFFCcl8zLTY0clVHSDFXeWpwSF81MmFseXZ1bWptZkE5bTRQNzc2c0FOdFlVTE1BZjJWMHJLSDFfZkdhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "21Shares Lists 4 Bitcoin and Ethereum ETNs on LSE - Yahoo Finance",
        "content": "Bitcoin - Crypto - UK Flag\n\n21Shares has listed its first cryptocurrency exchange-traded notes (ETN) with bitcoin and ether exposures on the London Stock Exchange (LSE) after the Financial Conduct Authority (FCA) greenlit professional investor access to ETNs in March.\n\nEther is the native cryptocurrency of the Ethereum smart contracts blockchain.\n\nThe 21Shares Bitcoin ETN (ABTC) and the 21Shares Ethereum Staking ETN (AETH) have total expense ratios (TERs) of 1.49% while the 21Shares Bitcoin Core ETN (CBTC) and 21Shares Ethereum Core ETN (ETHC) have TERs of 0.21%.\n\nAll products are available in U.S. dollar and sterling exposures.\n\nRead More: SEC Changes Ethereum Rule, Sets Stage for ETF Approval\n\nOphelia Snyder, co-founder of 21Shares, said: “The U.K. is one of the deepest, most-liquid capital markets in the world.\n\n“As institutional interest in cryptocurrencies grows, it is only natural that London Stock Exchange hosts responsible, properly constructed funds offering access to these markets.”\n\nWisdomTree Also Lists ETPs\n\nWisdomTree, which received approval from the FCA to list its bitcoin and Ethereum-based exchange-traded products on the LSE earlier in May, also listed them on Tuesday.\n\nElsewhere, Cboe U.K. became the second exchange following the LSE to accept bitcoin and Ethereum ETNs in March.\n\nTo list in the U.K., ETNs must be physically backed, non-leveraged and limited to bitcoin or ether exposures.\n\nRetail investors remain banned from accessing crypto ETNs as the U.K. watchdog still deems them \"ill-suited.\"\n\nThis article first appeared in etf.com's sister publication, ETFStream.com.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOUVpqQ0E2aVBhQUlwU1ZkOHIzeTJaeG1xbmN5RW9yLWVHRHpTbklHbUtkQnVOZ1VaTnZhajhWU0JnVUtNemphTGw1UE5GZnRTREFyOTJvSUluODBzcHdENmJ2NFAzYWhDSUdkekQzQmFHVVdrbFJDU08xSHVwRUxpMVVfQ1EyZEVzNTM4SklPLS1WRnBGWnJMQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "3 Little-Known Facts About Why Ethereum ETFs Could Be Mega-Bullish for Coinbase - The Motley Fool",
        "content": "An Ethereum ETF would significantly boost Coinbase's business and could catapult its stock.\n\nIt has been quite the year for Coinbase Global (COIN -6.83%). Crypto is back in a bull market, the Securities and Exchange Commission (SEC) approved spot Bitcoin (BTC -0.37%) exchange-traded funds (ETFs), and Coinbase posted its first profitable quarter in more than two years. As a result, its stock has risen more than 275% in the last year.\n\nAnd as is common in bull markets, the good news keeps on coming. Rumors are swirling that the SEC will green-light a spot Ethereum (ETH 0.17%) ETF soon. Not only is Coinbase going to be the custodian for some of these ETFs, but a pending approval will also create a domino effect of benefits for the company as interest in Ethereum grows.\n\nHere are three little-known facts about why the Ethereum ETF approval will give the company a major boost.\n\n1. It will increase volume on the platform\n\nWhen the spot Bitcoin ETFs were approved in January, many believed they would deal a blow to Coinbase. Since investors could now gain exposure to the cryptocurrency through an ETF trading on the stock market, why would they use Coinbase?\n\nWhile the concerns were valid at the time, we can now see that the approval of the ETFs generated massive trading volumes on Coinbase. The exchange saw volume on its platform increase by 300%.\n\nYou can probably see where this is going. Ethereum is the second-most-traded cryptocurrency on Coinbase. And since the exchange generates revenue from trading fees, if a similar outcome arises after the approval of an Ethereum ETF, then Coinbase will be raking in some serious profits. The more trading that happens, the more money it will make.\n\n2. Staking should get a boost\n\nOne of Coinbase's most popular products is its staking service. When buying Ethereum on its platform, the company allows users to easily stake it and earn passive income with just a few button clicks. For providing this service, it takes a 25% cut of the staking rewards it pays to users.\n\nShould Ethereum's price follow a similar trajectory to that of Bitcoin after it got its spot ETF approval, then that 25% cut will grow significantly. Imagine the difference this will have when considering that Coinbase manages billions of dollars of staked Ethereum.\n\nWe can see the impact that rising Ethereum prices could have on Coinbase's bottom line just by looking at last quarter's earnings report. From the fourth quarter of 2023 to the first quarter of 2024, Coinbase saw a 59% increase in its Blockchain Rewards (staking) revenue as Ethereum's price jumped 60%.\n\nWhile this is only one quarter, the increase in staking revenue corresponds nearly directly to the increase in Ethereum's value. If the crypto's value jumps 50% as Bitcoin's did in the three months after it received spot ETF approval, Coinbase's Blockchain Reward segment should see a similar increase or a jump of roughly $75 million.\n\n3. The first company built on Ethereum\n\nThe last benefit that an approval of spot Ethereum ETFs will have for Coinbase is slightly abstract, but it might be the most lucrative. The company has two main products that are uniquely Ethereum-based: Base and USDC (USDC 0.01%).\n\nLaunched In August 2023, Base is Coinbase's very own blockchain. The technical matters of this are a conversation for another day, but what is important is that Base is compatible with Ethereum, and for every transaction that occurs on Base, the company gets a cut.\n\nSince the beginning of March, Base produced nearly $35 million in profits as users flocked to the blockchain in the wake of Ethereum's Dencun upgrade, which lowered fees on Layer 2 blockchains like Base.\n\nIf activity stays on its current trajectory, Base could produce somewhere around $200 million on an annual basis. That's not bad when considering that Coinbase posted net income of $95 million in all 2023.\n\nThen there is USDC. Coinbase leverages this stablecoin in several ways to generate revenue, including interest income from reserves; transaction and conversion fees; custody services; and through its partnership with Circle, the creator of the stablecoin. In the first quarter of 2024, Coinbase raked in roughly $197 million in revenue from USDC.\n\nSince USDC and Base are both based on Ethereum, an ETF approval could produce serious benefits. There is no easy way to quantify it, but if the Bitcoin ETF approval sparked increased activity on Bitcoin, then it is plausible to assume an ETF approval for Ethereum will lead to a surge of interest and activity for that crypto, inevitably trickling over into Coinbase's Ethereum-based services.\n\nThe bottom line\n\nThe most obvious benefit for Coinbase and the approval of spot Ethereum ETFs is that it will be the custodian for five of the eight ETF applicants. This will produce additional revenue, but a deeper understanding of Coinbase's Ethereum-centric business model shows that just being a custodian for the ETFs will pale in comparison to the ripple effect across its revenue streams.\n\nTo put it simply, what is good for Ethereum is good for Coinbase. Best of all, we are only in the beginning stages of greater acceptance and interest in Ethereum and its unique role in the digital economy.\n\nHow much of a catalyst this will be for Coinbase's stock remains unknown, but rest assured, it will make the company much more valuable than it is today."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPNTkzMW5lMU42cnJkY21ZLVphSVZ6NWpIN2s2UERYdVBUWFRoSFBpU2JKZF9LWGhLYjJvTkd2N2ZYdHpnS1pYTkRVQWtjWHhuSGhqZzJqVzVscWlMSlc0SG9Fc3FwaGt5VmFyS21MdnlTNnQzUTltMFJzQ1pGdlctUnQ3c3JsdWoxWFBWeGd4b3ZTX3NFTkx1M0tpWlhCLWVzTV9ucThGTHhpOVBES1VLR2NPS2ctZzNRTURyVkVkMU8zZ3hnQ1ZscERnZVVkaFE3WkZZemlR0gHbAUFVX3lxTE1YaldrVGRTYXplVm4yX0pYZS1nb2VZNF9wRm1Zck5uSGRNUTRrVl92NzRFbGpVZlFCS2l3NjVqay0zMFF0T0hGdTQxMW9wN3hPRXZXR3AxQkQ1RUxSU0xZZjdNRE02dXFHb1hvV2dqV1k0NGpfcE1uaWNsSnBKd1p3ZzhVMWdZQnhRQWN0NFBDa0FSd3lFRW1SaUl3TmF1ZGttMG52eHFhSVVxZVpvTjN5aHJiNVc0R0VQT09WYW8yaDg2NHozck5WUGJtRzlIQkhMYnAyQzE1ei14TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum Could Witness Supply Shock and Sharp Upturn in Price When Fed Pivots: CoinShares Head of Research - The Daily Hodl",
        "content": "A top executive from digital asset manager CoinShares believes market conditions could soon send Ethereum (ETH) soaring.\n\nIn a new interview with Scott Melker, CoinShares’ head of research James Butterfill says a likely upcoming Fed pivot could be bullish for both Bitcoin (BTC) and ETH.\n\nButterfill says Ethereum could see additional upside momentum around the time the Fed starts cutting rates from the potential launch of spot market ETH exchange-traded funds (ETFs) and a supply crunch due to investors already staking a large amount of the top altcoin.\n\n“If you look at the futures market, interest rate expectations is saying first rate cut [is] not to be until December. I do think the first rate cut will be bigger than expected and later than expected, i.e. a knee-jerk reaction…\n\nIt would be actually very bullish for something like Bitcoin, which is massively sensitive to interest rate expectations…\n\nCertainly on the Ethereum side, it’s interesting. The amount of circulating supply of Ethereum is quite low because a lot of people are staking. Now the new ETFs, they won’t be able to stake when they’re launched in July, most likely, so there could well be a bit of a squeeze going on, a supply squeeze, and that could lead to some quite sharp uprises in prices.”\n\nEthereum is trading for $3,761 at time of writing, down more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxONG5obHF2blJXNlNkSXhISjdHaHQ1c2EwSGY4LVoxTUtiRm9sSmFzSmM2d3N1LXc4Zk5pcElCRWJhQmtXZHNObDNUVnpZSU9BTnRnM0xaR081WEtUUERZWmRGT250VS0zcGtlV1FINnQ0WHIwSU5kcGZJQ1ViY1g4NnlQQjJYLTlSbG94Y2tpNHRrVy1DRGg4ZW9QRWpTbkt5SDRtQXl1WGt0LWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Solana — why Ethereum's lesser-known rival is steadily rising - Yahoo Finance UK",
        "content": "Solana claims its blockchain platform offers faster transactions for a fraction of the cost compared with ethereum. (NurPhoto via Getty Images)\n\nSolana has long been heralded as the main contender to knock ether (ETH-USD) from its perch as the world’s pre-eminent network for decentralised finance.\n\nThe Swiss-developed “high-performance, permissionless” blockchain was launched in March 2020, by lead designer Anatoly Yakovenko.\n\nIts sol (SOL) token has soared in value by more than 88% since the beginning of this year, now trading at $168.46 (£132.35). However, this is still significantly lower than the token's all-time-high of $260 (£204.27) on 7 November 2021.\n\nApproximately 63% of sol is staked on the solana blockchain — this limits the supply of the token and has acted as a tailwind on the price. The market capitalisation for the blockchain has grown to over $77bn, ranking fifth in terms of cryptocurrency market cap, just behind Binance's BNB (BNB-USD).\n\nRead more: Ether price rallies on spot-ETF launch speculation as solana surges\n\nThis week, PayPal (PYPL) announced that its stablecoin PYUSD would launch on the solana network, nearly a year after debuting on the ethereum blockchain. PayPal senior vice-president of blockchain, Jose Fernandez da Ponte, praised solana's cost and speed efficiencies, stating: \"Ethereum works well enough, but if you’re interested in retail payments as we are, basically you need at least 1,000 transactions per second and you need transaction costs in the pennies, not in the dollars.\"\n\nThe ability of solana to handle large-scale blockchain movements is key to its value proposition. Solana can average 65,000 transactions per second (TPS). When compared with Ethereum’s 30 TPS, it becomes evident that the Swiss-developed blockchain is a major challenger to Vitalik Buterin’s brainchild, Ethereum.\n\nEthereum founder Vitalik Buterin. (John Phillips via Getty Images)\n\nSolana has many key innovations that could see its native SOL flip Binance's BNB token, which is next in line in the market capitalisation rankings. However, Solana is more decentralised than Binance, with over 1,000 validators, compared to only 21 validators on the BNB smart chain (BSC). The lack of decentralisation on the BSC leaves it vulnerable to manipulation or even a blockchain-wide hack, which in the long-term makes institutional players wary of deploying smart contracts on it.\n\nThus, the real target for solana is ethereum and it is expected to continue munching away at large chunks of ethereum’s market share because of its advanced transaction speed, lower transaction costs and attractive programming language.\n\nEase of use for application development accelerates the wider adoption of a blockchain by users and developers, a key factor in long-term success.\n\nStory continues\n\nRead more: Bitcoin price dips ahead of FTX and Mt Gox bankruptcy payouts\n\nThe developers of the solana blockchain have a mechanism for validating transactions called \"proof of history.\" This involves a cryptographic time-stamping mechanism that speeds up the settlement of on-chain (recorded on the main blockchain) transactions. This fundamental innovation in solana’s blockchain validation method, where every block is time-stamped, allows a multitude of transactions to be processed simultaneously.\n\nThe Solana Foundation’s website states that it maintains “a single global state as the network scales and never deals with fragmented layer two systems or sharded chains.” Thus, it does not need a layer two solution as its main blockchain can settle transactions at high speeds and with a fraction of the costs required on the ethereum network.\n\nRead more: What is a spot bitcoin ETF and why has it sparked a crypto rally?\n\nEthereum must rely on layer two solutions to handle large-scale transactions, as its layer one main network, where monetary settlements are recorded, experiences crippling congestion when a large number of transactions need to be verified. Layer two solutions can handle transactions at high speeds and with a fraction of the usual gas-fees, but are settled 'off-chain.' and then validated on the main blockchain network in a singular bundle at a later time.\n\nYahoo Finance asked Austin Federa, head of communications at Solana Labs, to explain why solana’s transaction speeds are faster than ethereums.\n\nHe said: “Solana is a proof of stake blockchain whose architecture unlocks network speeds and transactional capacity comparable to NASDAQ. It leverages proof of history, a decentralised clock before consensus, to timestamp incoming transactions, allow for faster block finalisation and increased transaction throughput.”\n\nFedera described how solana’s 'proof of history' consensus mechanism has a low energy requirement when compared to the 'proof of work' method used to validate bitcoin settlements. He said that: “Solana's consensus mechanism is greener because it doesn't use energy and it allows for the next generation of optimisations in technology improvements to make these networks much faster and scalable.”\n\nThe programming language that solana is based upon is attractive to developers — a key factor in accelerating the rate of blockchain adoption.\n\nIf many decentralised applications are developed for a blockchain, then the proportion of users who flock to the network will appreciate.\n\nRead more: What are bitcoin runes?\n\nFedera described solana as being “built on Rust, one of the most-loved programming languages by developers. It can be used to create smart contracts on solana using a universal coding language that possesses a powerful toolkit of community resources developed by Google (GOOG), Amazon (AMZN), and Facebook (FB). Combining these tools with Rust’s compiler means developers can use less energy thinking about technical errors and spend more time focusing on smart contract logic, so it’s easier to write safe code for DeFi.”\n\nAnother reason why capital is pouring into Solana is because the platform has exploited the growing interest in non-fungible tokens (NFTs). Purchasing these one-of-a-kind digital artefacts on solana is much cheaper than the gas-fees that must be forked out to buy equivalents on the ethereum network.\n\nThe ethereum network has average gas fees of $16 per transaction. On the solana network, the average gas fee is $0.00025 per transaction.\n\nRead more: Crypto live prices\n\nSome critics of ethereum suggest that Vitalik Buterin’s network is hanging on solely because of its first-mover advantage, which has seen it consolidate the majority of all known DeFi applications (dApps). But there are reasons to hesitate before concluding that solana will supersede its older rival.\n\nLast December, Yakovenko, the co-founder of Solana Labs, took to X.com to shoot down any descriptions of the solana network as an \"ethereum killer.\" He doesn’t “see a future where solana thrives and somehow ether dies.”\n\nHe wrote on X.com: \"Don’t bring back last cycle 'eth killer' bs. It’s lame. Pareto-efficient technologies can have overlapping features and will compete, but that’s all ok. I am such a techno-optimist that I am certain that eventually danksharding will have enough bandwidth for all of solana’s data.\"\n\nAlso, hardware costs to run a solana node could see a diminishing number of validators on the network over time, making it less decentralised and at a higher risk of network weaknesses long-term.\n\n* This story is an updated version of the original article published in November 2021.\n\nWatch: What London Stock Exchange debut of Bitcoin ETNs mean for Europe's crypto market\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOYXpPTHpjSWpKcjc4WE0tUU5MMmhrNlZEQnZxQTRlaTRWT0g0QnUwaDBaT1NZYU0ya2ZZRTR1c3psQXAtd3BEbjJ6SjR2bjJfcjBIU0I2Y0RNR24waDZaUUpMbTBQQzRfWkR1UGlVcUlKOFExNTE2OWd1T3JIR2F3bVFqSm94bGkyVy02bTBvLUc0RGtHaWNoUFY5cmN3dGxwV1ltVE5aSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum’s rollup model comes with risks, Vitalik Buterin warns - DLNews",
        "content": "Ethereum's decision to scale through complementary blockchains has created a diverse community, co-founder Vitalik Buterin writes.\n\nBut developers risk echo chambers or monoculture if they don't work to protect this pluralism.\n\nEthereum’s much-debated “rollup-centric road map” was the right call, but comes with its own set of pitfalls, according to the blockchain’s co-founder, Vitalik Buterin.\n\nEthereum has ambitions of serving as a “world computer” — the rails on which a new set of leaderless, user-owned businesses and organisations will run.\n\nBut the blockchain is slow and expensive.\n\nIn their quest to build a blockchain that can serve billions of users reliably and affordably , Ethereum’s team of developers decided the blockchain should expand through many complementary blockchains rather than through improvements to Ethereum itself.\n\nDoubling down on these complementary blockchain s— called layer 2s or rollups, in crypto-speak — was the right call, Buterin argued in his influential blog last week.\n\n“This is powerful, and enables a lot of creativity and independent innovation,” he wrote.\n\nThe rollup model has created a diverse community that is still united by a shared set of values, he said.\n\n“Layer 2s allow subcultures to emerge that are armed with substantial resources, and a feedback loop that forces them to learn and adapt in order to be effective in the real world,” Buterin wrote.\n\nJoin the community to get our latest stories and updates\n\n“In general, every Ethereum layer 2 has a unique ‘soul’: some combination of Ethereum’s culture, together with its own particular twist.”\n\nBut this happy status quo shouldn’t be taken for granted, he said.\n\nCoordination is difficult, with little incentive for competing layer 2 blockchains to collaborate, according to Buterin.\n\nDanger of “monoculture”\n\nLayer 2 blockchains and their communities could “start acting like separate universes, with little cross-pollination between them,” he wrote.\n\nAlternatively, some layer 2 blockchains might come to dominate, snuffing out Ethereum’s pluralistic ethos for a “monoculture.”\n\n“Whether due to shared human biases or shared economic incentives (or too strong of a unified Ethereum culture), everyone ends up looking in similar places for what applications to build and perhaps even what technical choices to make,” he wrote.\n\nButerin suggested layer 2 blockchains coordinate by subsidising the development of shared infrastructure\n\n“There is a lot of value in trying to expand on these ideas, and keep working to make the best of Ethereum’s unique advantage as a pluralistic ecosystem.”\n\nLayer 2s booming\n\nLayer 2 blockchains have boomed in recent years.\n\nAccording to crypto research site L2BEAT, almost 100 layer 2s are active or in development.\n\nExisting layer 2 blockchains have processed almost twice as many transactions as Ethereum itself over the past year, according to data collected by Jack Gorman, a data scientist at venture capital firm Variant Fund.\n\nAleks Gilbert is a DeFi Correspondent at DL News. Got a tip? Email him at aleks@dlnews.com."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQcDMyRzZJazRSem9FNlJNRnV1d3hpS2tlUFUwbEZIU2YzZEVFeTdadWZWeVZqdDlCbUZZOXVjSjVfN0RwYTJDYUpYOXlYbmpGQUNHSXVtUWpocGpLQmdkenlmR1ZUTGxlQ2k5LWo0SkRmcHJ5d3hURF9kMEFOUEMtd2Jha0NKdFA0cjdEMFpiSWlBclJLMTFibzktVHdndGhKWWgwZFQ1VFhTQzV0RVhuN2pFY3N5VXNQbnZIODdJbDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: ETH Charges toward $4k after Donald Trump Said This - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBXb1hqZXhocUtXeGdiODZiVlUydFVlTFh3c2lqYXJyVWZOSXdjRVR1YkpqNXJWc1RFTFJibUw5OXIyOFFZLXkzU1lUbGo0RjVxOVVOaVUxNnFQbm9kc0M3ZDJOMC02eUszaE13NDAtTFFFNWxXd1ZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum ETFs still off the table for Vanguard – it's not surprising - Crypto Briefing",
        "content": "Vanguard has a history of avoiding trendy investments but for most options, the firm was right.\n\nShare this article\n\nFor Vanguard, crypto assets like Bitcoin and Ethereum are “more of a speculation than an investment,” and chasing speculative assets will never be the fund’s investment philosophy. No doubt Vanguard constantly says no to Bitcoin exchange-traded funds (ETFs). There is no exception for Ethereum ETFs.\n\nEarlier this month, Vanguard reportedly appointed ex-BlackRock ETF head Salim Ramji as its next CEO. The transition, slated for July, sparked speculation that the fund might be close to revising its stance on crypto-related investment products.\n\nHowever, Ramji made it clear that the fund would not file for a Bitcoin ETF and refused to offer any Bitcoin ETF on its brokerage platform.\n\nThe firm’s view was reiterated after the SEC’s approval of spot Ethereum ETFs in the US. On Wednesday, Vanguard confirmed to the public that no spot Ethereum fund would be available for purchase.\n\nCommenting on Vanguard’s recent statement, Bloomberg ETF analyst Eric Balchunas said Vanguard’s stance could be frustrating, but it would be better to accept it and “move on” because it is not a typical asset manager who seeks to maximize revenue.\n\n“They [are] more like a co-op, and they’ve taken in nearly billion a day for over a decade, and so they [are not] envious of other people’s hit ETFs,” Balchunas stated.\n\nThe expert added that Vanguard could be overprotective when it comes to restricting investors from buying crypto ETFs.\n\n“It seems like they [are] playing Nanny role. Their investors are the smartest money on the planet IMO, they are not easily misled children, they can handle having choices,” Balchunas wrote.\n\nWill history be on Vanguard’s side?\n\nOrganizations each have their own implicit and explicit values and norms. For Vanguard, its products need to meet investors’ long-term needs. The fund prioritizes investor protection even if it means sacrificing short-term gains.\n\nLooking back, avoiding trendy investments was Vanguard’s right decision. In the past, the fund refused to chase “hot” options like government-plus funds, tactical-allocation funds, or internet funds, which all crashed and burned.\n\nIts commitment to a sound investment philosophy pays off in nearly all cases. If it still contributes to the firm’s success, an abrupt shift may not be necessary.\n\nIt remains unknown if Vanguard will change its judgment on Bitcoin in the future. Bitcoin may need to prove itself as a true store of value, like gold, to get a place in the fund’s portfolio.\n\nPerhaps there’s a glimmer of hope there."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPMG9YelFLRDM5S2djTXVBbGcyN1N4cDBXbmtEMG42MzU5eHVvanB6QlNqYU5rZmhoMzk5V1V6b2NmQjJIdnZuUEF0WTBETUl0b1h5aWFuY09nTlRmMzJPNG1xd3NYaUZzLTIyTm1fVkxpVWFuMFp2QkxWdnB2VVEwTmdaN0ZVODdTMTloVTY1TTMtQ241dW9RUlpZV1JzQUM1dGQyMnRWTmllYU5OMjQ1Vlp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Babylon Raises $70M To Bridge Bitcoin And Ethereum - Benzinga",
        "content": "Babylon, a crypto startup co-founded by Stanford University engineering Professor David Tse, has raised $70 million in its latest funding round.\n\nWhat Happened: The round was led by crypto venture capital firm Paradigm and included investments from Polychain and Bullish Capital, the company announced on Thursday, according to a Bloomberg report.\n\nThis follows an $18 million raise in December from investors such as Hack VC and Framework Ventures.\n\nAlthough Babylon did not disclose its current valuation or investment details, a representative confirmed that the funds will be used to expand staff and further research and development.\n\nThis latest investment highlights a renewed interest in Bitcoin-focused projects among venture capitalists.\n\nTraditionally, Ethereum ETH/USD and other blockchains have been favored for software development, particularly in decentralized finance (DeFi) applications.\n\nHowever, the success of Ordinals, a type of nonfungible token (NFT) on the Bitcoin blockchain, has sparked renewed interest in building within the Bitcoin ecosystem.\n\n\"So Bitcoin is kind of really undergoing a renaissance in the sense that now there's a new wave of projects building on Bitcoin,\" Tse said.\n\n\"Historically, Bitcoin was the first blockchain, but over the years the developer community has shifted away from Bitcoin BTC/USD to new chains…Recently, for multiple reasons, there has been a shift of attention back to Bitcoin.\"\n\nThe increased interest also follows the approval and launch of Bitcoin exchange-traded funds (ETFs) in the U.S. earlier this year, as well as the Bitcoin \"halving\" event in April, which reduced the mining rewards by half.\n\nThese developments have contributed to a growing focus on Bitcoin projects.\n\nAlso Read: Robinhood Unveils Crypto Trading API For Advanced US Users\n\nWhy It Matters: Babylon’s primary aim is to enable Bitcoin to be used as a staking asset to secure other blockchains.\n\nStaking, a mechanism used by proof-of-stake blockchains like Ethereum, involves locking up cryptocurrency deposits to validate transactions and secure the network, earning rewards in return.\n\nBitcoin, traditionally a proof-of-work blockchain, uses miners to solve complex puzzles for transaction validation.\n\nBabylon seeks to allow Bitcoin holders to participate in transaction validation on proof-of-stake networks, thereby earning yields on their idle Bitcoin.\n\n\"You can think of our project as analogous to Ethereum's staking, but for Bitcoin,\" Tse explained.\n\nFor Babylon and its investors, making Bitcoin a staking asset presents a significant opportunity, as many Bitcoin holders have long sought ways to generate yield from their assets.\n\nEthereum’s recent transition to a proof-of-stake model, known as the Merge, has increased the appeal of staking as a revenue-generating activity in the digital asset sector.\n\n\"In our mind, in the crypto Web3, a very important value is security,\" said Tse.\n\n\"So it is this security that drives this underlying decentralized world that we're building. And so what we're trying to advocate is that Bitcoin being such a large asset can sort of underwrite the security layer for essentially the entire Web3 ecosystem.\"\n\nStaking remains one of the most lucrative areas in decentralized finance.\n\nAccording to data tracker DefiLlama, Lido Finance and EigenLayer, two of the top three DeFi projects by total value, fall under the staking category.\n\nUsers have collectively sent over $50 billion in cryptocurrencies to these platforms to generate returns.\n\nWhat’s Next: These developments and their implications for the digital asset market will be key topics at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nRead Next: BlackRock Moves Closer To Launching First Spot Ethereum ETF"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9UdEJucnhWNXJEVFRSQXRBT0IzaWs1ZlpQQVROQjlXdVRULWo0Z3oxVDdfZzFFYmEyckJTeUwxNXktLUs1VmhNa2t5ZVFsUFdtQUVETnV1cE16eHFZd0NQX0tsSE1jS2N3azhBUTZXTkJtZ1drVkcxMdIBfkFVX3lxTE83WDNNaWtyYl9zWnVSNjVROEwxdFRGelBFSG1fMFdpYi1CeXkxSTI4b1NCanpMbjMtdUxrLURHSDluV1oySnJXeG1BTmdMT194M196cWFWOG5PVVhFSnJjTGhCTkZpeXNobzhjU2Y4UHRxdFctUm94cHJHWTY3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "$8 Billion of Ethereum (ETH) in 24 Hours: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nWith the Ethereum ETF craze covering the cryptocurrency market like a fog, the activity of large holders is through the roof. More than $8 billion worth of ETH has been transferred between whales, which creates an interesting situation: the activity is here, but the price is not moving for now, consolidating at around $3,900.\n\nAdvertisement\n\nThis amount of large transactions is remarkable. There have been more than 6,780 large transactions in the past 24 hours and a seven day high of 9,790 transactions, But for all the activity, the price of ETH has been relatively unresponsive.\n\nThe chart reveals that there are extremely high levels of transactions being offered up, amounting to an incredible 2.14 million ETH in the past day. This level of transactions is in line with the current hype over an ETF, since institutional interest tends to drive whale behavior.\n\nThe seven-day high for transaction volume was 3.21 million ETH, while the low was approximately 981,530 ETH. The implications of this volatility are that there is an extremely fluid market in which large holders are very much on the move and shaking about, presumably in the hope of signaling impending price movement.\n\nAdvertisement\n\nOddly, though the transactions are high in the number of units and in value in many cases, there is relative moderation in price volatility. The volatility index lists a 30-day high of 62.38% and a low of 40.72%, and that means the market, with all of its transactions, is not experiencing big price swings.\n\nIf the ETF story continues to play out and more institutional money comes into the ETH space, a breakout higher than $4,000 may become a reality in the future. But, if this action is simply a reprieve to profit, or a redistribution in the face of weakness being perceived below the surface of the market, it may have trouble keeping up its courage."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE85b2pPdmphU29UMVNnVHZZSU1zbGR4Wmhsc2VCMDhoVVZjbXF3Z2NOSk1wSnBSMEpuM29zM0NFbDVSeVJGbEE4VDlsYVBNOEhPeUZEMktHVm15ZnJoVi1TY2hqQ0dXTjBUWXJPRHRsM1Zsc19BX2tjMNIBfkFVX3lxTE5kdVhFaHpTaEJOWWh4WXBlMmdMSUdrY05IWHF6cnQ2T1RNMkg4WXVrLUhuUTBYLU5hSUVRazlSSmVXRGV4OFNzSUpCOHhpVllUVE14aFNVeW4yYW1GX052LTRRQlF4aEU4d1B1WUdRak9zWlhJdy05Z0pXMDhtUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Solana (SOL) Dominates Ethereum (ETH): Glassnode Cofounder - U.Today",
        "content": "According to Glassnode cofounder Yann Allemann, capital rotation within the cryptocurrency market has begun .\n\nAdvertisement\n\nAllemann has noted that Solana (SOL) is currently dominating Ethereum (ETH). His assessment comes after the former gained roughly 10% against the latter since May 27.\n\nThe SOL/ETH pair experienced a significant decline following the approval of several spot Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) earlier this month. On May 27, the price of Ethereum peaked at $3,973 on the Bitstamp exchange. However, the excitement surrounding the SEC's much-coveted nod quickly dissipated, with ETH shedding 7% in several days. The SEC is yet to approve S-1 registration statements for these ETFs to go live.\n\nAt the same time, Bitcoin's market dominance has collapsed more than 4% since May 6 after breaching the 56% mark.\n\nAdvertisement\n\nOnce a certain cryptocurrency rallies, it tends to cool off, while traders take profits and place bets on other assets. Capital rotation within cryptocurrencies can also take place internally, meaning that the same cryptocurrency gets acquired at different prices.\n\nDespite its recent weakness, Bitcoin is still neck-and-neck with Ethereum on a year-to-date basis. The two cryptocurrencies are up 77.71% and 79.38%, respectively.\n\nSolana ETF?\n\nAfter Bitcoin and Ethereum have benefited from the ETF hype, analysts are now eyeing other potential cryptocurrency contenders.\n\nAs reported by U.Today , CNBC contributor Brian Kelly has predicted that Solana could end up being the next major digital asset to get its own ETF. This view is also shared by American financier Anthony Scaramucci and British bank Standard Chartered .\n\nAt the same time, the Chicago Mercantile Exchange (CME) recently shut down rumors about potentially launching Solana-based futures."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQRDdYblhrcWtXdU1aSDl0LWU1TWlkTVBudEVMTUVoOGNmM3l2Xy11SGxOSmxiUlZIU0ItOTVucUM4aGNqN19kSXBXcE0zRXc0RUZ2VFdEUTZMWmVwOUhTSWVUMVhjeXJ1bEVQOUN4X0NBcm1rN0NULThpWmhCR1VacmtMenVoMzU0ckhXU0ZNQ3hZYzQ1TlBTMmZueF96SDdsLVd5WWhadmxyR2xOaVlrRzFCOWxJWlV6QXFhaU8yY2ZoYkhJOUJtbkpFTDZVcWdz0gHWAUFVX3lxTE5xd2pwTTlqODVTVjVvWlVpc1cxY080c2Z2Sm1RZVUzZHl0ZHI4SlFKN1JuNzA5UFlCbzZmQXRXRWd1T2M1Z3lwVG03SVNCN211YVE1U0R1RWt3d1IyQjMweTh6ajlac3FyZlhqRzNCR2ZhdHVzWDBFSE55RFpJVUxTT0c0YjQ2MExucHBVV1hTM0o5eVBFcFR1UFZXRV9icW1UTXY2TnI4UC1NUVRRQWNSWmJUY092d1docDEyQ1dmMURYc1JfYUp0N1ZKY3NWZFp1LTA5TXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "BlackRock Amends Ethereum ETF Application; Bloomberg’s Balchunas Sees ETF Going Live By June - CoinDesk",
        "content": "BlackRock’s bitcoin ETF has proven to be a success so far for the company so far. On Tuesday, it became the world’s largest publicly traded bitcoin fund, flipping Grayscale, with nearly $20 billion in assets under management ."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPcHFJUHRfeEpLanlLYWJNNExReUhqMmRURTkyMzNQMFJ5aEx4MTNOVDBQYk5QaXFEWGRVNmpLSDJwMFowNUlHUXZxRmJkeWZQRzBlVDRDZFYtOUZITVhKOXh1RGtYSmd1RzVOLXdVcXliM2lMZFRFQy1SVVN0bVlVTzV2UdIBiAFBVV95cUxOZk56cm1jeUh3RGRiemFxN3FNbWtFX0d6S1Rxb0lnVzlDaWgxU0tTR2ZxcXVGRzJ5bFVYOHpKZEJkRFdMVG52eXB2bHNWVFBwQ0pVUjg1REVmTkNCamI1bjcwVXRpdnB1UURsMnZCbXN2X3loQktkTXJlRGE5TTZGR1BFakVVdmh5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Break $4,100 as Falling Wedge Pattern Plays Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH), the world's second-largest cryptocurrency by market capitalization, is poised for a significant price breakout. Crypto analyst Jelle recently indicated that ETH is continuing to follow the falling wedge pattern, as anticipated. He mentioned that there might be a few more days of fluctuations below the current local highs before the next upward movement. Jelle also suggested that potential ETF news in the coming week could propel ETH beyond $4,100, with all-time highs being a possibility.\n\nAdvertisement\n\nAt the time of writing, Ethereum is trading at $3,725, experiencing a slight dip of 1.76% over the last 24 hours. However, the cryptocurrency has shown impressive resilience, boasting a 21.68% increase over the past 30 days. This bullish sentiment is further fueled by recent regulatory developments in the U.S. concerning Ethereum spot exchange-traded funds (ETFs).\n\nEthereum spot ETFs\n\nLast week, the U.S. Securities and Exchange Commission (SEC) approved applications for Ethereum spot ETFs, a landmark decision that could have significant implications for the cryptocurrency market. Analysts suggest that these ETFs could be launched by late June, following crucial updates from major financial entities.\n\nOn May 29, BlackRock, the world's largest asset manager, updated its Form S-1 for the iShares Ethereum Trust (ETHA) with the SEC. This update came nearly a week after the regulator approved its 19b-4 filing, both of which are necessary for the ETF to commence trading. This move has been seen as a positive indicator by market observers and analysts alike.\n\nAdvertisement\n\nBloomberg ETF analyst Eric Balchunas commented on this development in a May 29 X post, stating that this was a good sign. Balchunas elaborated that there would likely be another round to fine tune the SEC comments but maintained that the end of June launch is a legit possibility. He noted that while the approval odds around July 4 are more realistic, earlier approval would be a long shot.\n\nGood sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4th https://t.co/WymshkTvat — Eric Balchunas (@EricBalchunas) May 29, 2024"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNblNpQ01sYnlBbWVLT1F3bjRmeWd0d1dmWVBQSGtucnlIQ2JSeGxqQi1tQ0QxeklZZVBQRnZwbl9ad0VibkYwY0ZONTNNZ3p1T25JbUdnMHhMZnN0aWh1TU5Vcm1CbmpLY0tQWWpSS1NfWFVrXzVDMl9LdTZ1TWNIMTRxM2lSV1pHUHA0dUliZWpzSy1uZVBIVElUSdIBowFBVV95cUxORXVQNC1sX2s0cWdSb0NOYzFreUxveDcyNVBVQlVva1ZqcjI5QUg4aHVoU1lMQVgyb0ZjVEdBSHRJWWJPQm4xUF9ENDRHbzV0aFdORldJdXE1TUFXcWpobEJGS2E5SHdteXBHNzBMSElGcWpjTGIxVkdSbDlMMlRFSl9WTUM1TnVNcE1RNjNFcUNTUGdlYmV3TC1XVVVBaE54V1JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Bitcoin Startup Babylon Raises $70 Million to Bring BTC Staking to Ethereum and Solana - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA crypto startup seeking to use Bitcoin for native staking on other blockchain networks has secured $70 million in fresh funding to fuel its ambitious goals.\n\nBabylon, which is aiming to do something never accomplished before, secured the cash from lead investor Paradigm, a prominent crypto venture capital firm. Other contributions came from Bullish Capital and Polychain Capital.\n\nThe startup wants to use Bitcoin, the biggest cryptocurrency by market cap, as a resource for staking. Previously, the firm told Decrypt that it’s building infrastructure to use Bitcoin staking to validate nodes on networks such as Ethereum and Solana.\n\n“This funding will accelerate our mission to make Bitcoin the security backbone of proof-of-stake systems,” Babylon founder David Tse said in a statement. “Our team is dedicated to advancing the utility of Bitcoin beyond its traditional roles and enhancing the security of the entire blockchain ecosystem.”\n\nAD\n\nAD\n\nCurrently, Bitcoin runs on a very different system to staking protocols because it uses a system called proof-of-work.\n\nProof-of-work requires lots of computing power—in the form of miners—to process transactions. It’s an expensive and energy intensive process.\n\nBut with proof-of-stake, anyone can participate by “locking up” their assets to power a crypto network. Staking networks include the likes of Ethereum, Solana, and Cardano.\n\nBabylon wants those holding Bitcoin to be able to earn a yield by pledging their coins to staking networks. It’s a bold challenge, but the startup—led by a Stanford professor and a former Dolby engineer—says it has found a way. Last year, it raised $18 million from investors.\n\nAD\n\nAD\n\nIf it does achieve what it wants, those sitting on satoshis (aka the smallest denomination of Bitcoin) will soon be able to earn yield.\n\n“Babylon will be the catalyst that redefines the utility of BTC and paves the way for a new era of Bitcoin-native applications,” said Luke Pearson, General Partner at Polychain Capital, in a release.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPZEpyQ3hLR013bjlJYzQ3QXlrN1prd3VhQVE1VjFtNHNGS1pFdUIyRFRIUzJMRTJRcUxOcElXTzJmS3A1dHh2RnE1cUkwU0ZtbGl3eGZhelhzQ085bWlMdExXYkJiV09QQnhjS1ZVbDNqbEtzQ2ZDMU91czZQNTROWk56MXNDZktJR0xuUHRIRnRHU2NjYlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval is a game changer, believe experts - Economy Middle East",
        "content": "It could be a paradigm shift, not just for Ethereum, but cryptos in general\n\nIndustry insiders believe the approval of Ethereum ETFs could see a slew of othger crypto-based ETFs\n\nLate last week, the US Securities and Exchange Commission (SEC) cleared the way for the approval of spot Ethereum ETFs.\n\nThe SEC approved 19b-4 forms for the ETFs from BlackRock, Fidelity, Grayscale, Bitwise, VanEck, Ark, Invesco Galaxy and Franklin Templeton.\n\nThe approval takes Ethereum-based ETFs one step closer to reality. Once available, traditional investors will be able to buy shares that track the price of the second-biggest cryptocurrency.\n\n“Ethereum (ETH) is currently in the spotlight as the SEC asked applicants for the ETH ETF to update their filings this week, increasing the odds of approval,” says Hao Yang, head of financial products at crypto exchange Bybit. “Although ETH has faced challenges in recent months, this move suggests a potential turnaround for the second-largest cryptocurrency.”\n\nThe surprise approval is sort of a volte-face at the SEC. In fact, virtually everyone was expecting the SEC to decline the applications.\n\n“The green light for Ethereum ETFs is a landmark decision that highlights Ethereum’s status as a non-security,” says Zina Ashour, founder, Women in Crypto Arabia.\n\nRead | Cryptocurrency market set to surpass $5 trillion in 2024: Ripple CEO\n\nShe explains that this distinction is pivotal “as it exempts Ethereum from the strict regulations that govern traditional securities, thereby broadening the avenues for both institutional and retail investment”.\n\nBroader impact\n\nAshour believes the SEC’s move could set a precedent for the classification and regulation of other cryptocurrencies in the future.\n\n“The SEC’s endorsement of Ethereum ETFs marks a significant turning point not only for Ethereum but also for the wider cryptosphere,” says Ashour.\n\nShe argues the approval will drive the entry of institutional investment into Ethereum. The Ethereum ETFs, Ashour explains, will take away the complexity of directly purchasing and storing the crypto. Secondly, they’ll also offer a regulated and familiar path for investors to buy the crypto. This leads Ashour to believe that Ethereum ETFs could potentially have a positive impact on Ethereum’s price.\n\n“Moreover, the Ethereum ETFs could amplify market liquidity by drawing in more participants,” says Ashour. “Enhanced liquidity could stabilize prices and temper volatility, rendering Ethereum a more attractive investment proposition.”\n\nShe also points out that there are over 20,000 altcoins in Ethereum’s ecosystem. “The approval of Ethereum ETFs could indirectly influence these altcoins, potentially sparking increased interest and investment in them,” argues Ashour.\n\nOpen the floodgates\n\nSECs approval of the Ethereum ETF forms follows approval of spot Bitcoin ETFs back in January. These spot Bitcoin ETFs now collectively hold more than 1 million Bitcoin, worth over $70 billion.\n\nRead | Bitcoin ETFs approval: A game-changer for cryptocurrency market\n\nAs the news of the approval made its way into the markets, the price of Bitcoin and Ethereum actually dropped. Experts believe this was the classic case of traders selling the news after buying the rumor, earlier in the week.\n\nWhile the price of both cryptos has gone up since, Yang believes the prices will continue to fluctuate until the ETF decision is finalized.\n\nInterestingly, market analysts believe the approval of Ethereum ETFs could open the door to more crypto-based ETFs. In a note last Friday, Geoffrey Kendrick, Standard Chartered’s head of crypto research and emerging market foreign currencies, speculated that Solana and XRP might soon get their own ETFs.\n\nChanging political winds\n\nThe SEC approval of the Ethereum ETFs is just the first step of a long-winded process. Experts estimate that could take weeks, or even months, before the actual ETFs land on the trading floor.\n\nThe Ethereum ETF approval is being hailed as a symbolic victory for crypto. Looking at the bigger picture, many believe SEC’s change of heart has everything to do with politics in the US.\n\nRead | Economy Middle East Guide: Regulated crypto exchanges\n\n“The broader political landscape also favors a friendlier regulatory environment for crypto, driven by younger voters’ preferences, which could lead to improved crypto-government relations,” says Yang.\n\nA recent survey by Harris Poll bodes well for crypto going forward. It finds that a third (33 percent) of US voters will evaluate a candidate’s position on crypto before voting. An overwhelming majority (77 percent) think a U.S. presidential candidate should know crypto.\n\nReportedly, even Ethereum co-founder Joe Lubin believes the approval of the Ethereum ETFs, and the crypto-friendly political environment in the US is a “game changer”.\n\nFor more technology news, click here."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNd3dCZVlRMnA2NFNjSExyTkdldzlWbkRVLUpTck1xVkplckFlWWphVUY3cVpIWjFUbG5QY0ZTcDFvemo3YTRBc1pIdjU5VkRwdTFjOHhZZDhLNzVrMkIzSGdtdlE5bFhZVGtOTXpiQ1RydUhYNHkyYlM2YVBWbVEtNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Whale Stakes $580M ETH In One Epic Move - TronWeekly",
        "content": "Ethereum whales have once again reinforced their faith in the smart contract network. Onchain data revealed that over half a billion dollars worth of ETH was staked in a single transaction. Etherscan captured the transaction worth a whopping 146 ETH, valued at over $580 million. This is likely the record for the most amount of ETH staked in a single transaction, one market observer noted.\n\nThis colossal move is a testament to the growing trust and interest in Ethereum’s staking mechanism, especially as the upcoming Ethereum 2.0 upgrade is on the horizon.\n\nEthereum Whale Stakes $580M ETH in One Epic Move 3\n\nMoreover, whales, individuals, or entities that hold large amounts of cryptocurrency have been the key players, as their significant stakes highlight the evolving landscape of decentralized finance [DeFi] and the increasing role of Ethereum as a foundational layer for various DeFi applications.\n\nDigging deeper, the amount of 146,110 ETH was staked via Lido, as revealed by the Lido DAO Bot on social media. The whale’s contribution through Lido not only boosts the total value locked [TVL] in the platform but also highlights the growing trend of using liquid staking solutions to maximize returns while retaining flexibility.\n\nIn a decentralized staking solution such as Lido, users can earn staking rewards while maintaining the liquidity of their assets through stETH, a tokenized form of staked ETH. This dual benefit is that it attracts whales, entities, or individuals with substantial holdings, to contribute large amounts to the staking pool.\n\nEthereum Fork In Q1 2025\n\nAs reported by TronWeekly, core developers announced their plan to implement the Pectra upgrade by the first quarter of 2025. This decision emerged from a recent execution layer meeting, marking Pectra as the next pivotal advancement for ETH, following the successful Dencun upgrade of March 2023.\n\nPectra is slated to bring several critical enhancements, led by the integration of the Ethereum Virtual Machine Object Format [EOF]. The EOF will bring forth approximately 11 improvement proposals aimed at refining the ETH Virtual Machine [EVM] code on both Layer 1 and Layer 2 levels. These enhancements are expected to optimize the efficiency and functionality of the EVM, which is the backbone of ETH’s smart contract operations."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNjZYTU0zVjA0OVFOWFF3Z0d6LUktc1VSQ0o5bndjYUw5eWxPTGZGTGplWkVrUWYxY0Nad1F5OFFRV1cxRW1mUnhoTDhGZlRrcHpVOWEtV0ZQVWJZMWdGUXdvU2prNTdFbkdIRFViWkkzT1BsajRlREgwdWxaU3ZQSUh3R0VvZklDQ0VNRklVU1g4S3M0OXM3UDZkaXlDVHJXODFNbEN30gGrAUFVX3lxTE5OcU9GWlVxWDFIekpWdkQyQy1INkxKek11QjI1MHVnTERWeU1nMDFJdl9tejRiRENmdjgxbWcteEIyLUM4ek9xM3kwWV9rejJkVmlzMF9ncG1BUnZxQ1Q2OVYzd1daSmlERFVPMmxhUmFMeVB2cExuTnU2bXM5VzBwTkZxNjZPNmx6alJza20yY2lla3kxVXRDZ0xZSm04TWk3Rmd1N2ZEMkRrYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Here’s When BlackRock’s Spot Ethereum ETF Could Launch After Updated S-1 Filing - CryptoPotato",
        "content": "BlackRock has submitted a revised registration statement for its proposed spot Ethereum ETF. The updated S-1 filing also included details about the company’s seed capital investor.\n\nNow, analysts suggest that U.S. spot Ether exchange-traded funds (ETFs) could launch by late June.\n\nBlackRock Reveals Seed Capital Investor Information\n\nThe world’s largest asset manager submitted an amended S-1 registration statement nearly a week after the U.S. Securities and Exchange Commission (SEC) approved 19b-4 forms for eight Ethereum ETFs, including its proposed iShares Ethereum Trust. Both filings need approval before the ETF can begin trading.\n\nIn the updated one, BlackRock disclosed information about its seed capital investor, who committed to acquiring $10 million worth of shares on May 21, 2024. The investor ultimately received 400,000 shares priced at $25.00 each. The asset manager also said the shares will be listed and traded under the ticker symbol “ETHA.”\n\nEric Balchunas offered insights on the development, expressing optimism about its significance. He anticipated others to follow soon, likely accompanied by another round of fine-tuned comments from Staff. While Balchunas suggested an end-of-June launch as feasible, he emphasized higher approval odds around July 4, regarding an earlier approval as a “long shot.”\n\nGood sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4th https://t.co/WymshkTvat — Eric Balchunas (@EricBalchunas) May 29, 2024\n\nBloomberg ETF analyst James Seyffart remarked that BlackRock’s updated S-1 is “almost certainly the engagement we were looking for on the S-1s following the 19b-4 approvals. Issuers and SEC are working towards spot Ethereum ETF launches.”\n\nHashdex Withdraws Spot Ethereum ETF proposal\n\nThis development comes the same day as a filing showing Hashdex recently withdrew its proposal for a spot Ether ETF, a day after its competitors, including BlackRock and seven other issuers, received approval for it.\n\nNo information has been provided regarding the reasons for Hashdex’s decision or whether it plans to resubmit its proposal. According to its initial September 2023 filing, Hashdex’s proposal for a spot Ethereum ETF combined spot Ether holdings with Ether futures contracts within the same product to reduce potential manipulation risks.\n\nHashdex also aimed for its spot Ether ETF to reflect daily changes in the Nasdaq Ether Reference Price to address regulatory concerns about market manipulation.\n\nCompetitors like Fidelity, ARK 21Shares, and Franklin Templeton have focused solely on spot-based Ether ETFs, making late amendments such as removing support for ETH staking in response to SEC feedback."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWXA3eXc0Z2xTLURYLVJGc2dPTC1SdVNNd1c1cUk1TzZhR3VaRkpHMEhaS05XQkJrT1J0a0tXM2J3LW93VzRDYkdtcjZ1R3pfeWFZWDFXN3puN05kdy1HTERDOF9QZnh0S0s0dkVwclpCNWV3SHlNd1Z1T05UXzdqdHl3T1ZXWE9Eb2VhLUd3UnTSAZgBQVVfeXFMTlUxc3FSNERoVjRrWnI2LU5acFBPYnhwakRNZXF0ekUzdkpYNXdsVkg2MU5oV3VkbDhoZ21VRGJub194ZjNfWldqcWVXcmhsejdnUnFoaW5HdmxvTVN4a3pNRmpld2NPV25UTUs4N29BLVJSUkN5ZDYtcUh2NFhiQXFWdUtmM3JZVEJQYWxtQzZvU3FOTU1IQjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Caitlyn Jenner Solana Meme Coin Crashes After Launching Ethereum Token to Support Trump - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCaitlyn Jenner’s recently launched Solana meme coin has dived 66% in price over the past 24 hours after the former Olympian announced a new token on Ethereum—this time with the goal of donating a share of fees to support Donald Trump’s presidential campaign efforts.\n\nEarlier this week, media personality Jenner announced her Solana meme coin JENNER, with many crypto observers initially assuming that her account had been hacked. But that wasn’t the case, and she was actually behind the project in tandem with crypto promoter Sahil Arora. Jenner claims that she didn’t have custody of any of the tokens and that Arora owes her “lots of money” after he went “radio silent.”\n\nJENNER spiked in value and led to a growing wave of celebrity-backed meme coins, including from rapper Iggy Azalea and musician Davido, but Jenner's own token took a dive on Wednesday after she tried to expand upon that initial success.\n\nLate Wednesday, the decathlon gold medal winner launched a new version of the JENNER token on Ethereum, but with some tweaks to the formula. Investors apparently didn’t like this move, with the Solana token's price dropping 58% in the two hours that followed the announcement, and now 66% over the past 24 hours.\n\nAD\n\nAD\n\n$Jenner on $ETH\n\nNO team tokens.\n\nNO Dev tokens.\n\nNO founder tokens.\n\nOfficial contract address here: 0x482702745260Ffd69FC19943f70cFFE2caCd70e9 pic.twitter.com/fwXW4Cb2gS — Caitlyn Jenner (@Caitlyn_Jenner) May 30, 2024\n\nArora, who has since launched other celeb-themed tokens, confirmed to Decrypt that he had no part to play in this new token. “She’s a greedy granny,” he said via Telegram DMs.\n\nAn hour later, Jenner took to Twitter Spaces to announce that her new coin has a 3% tax applied to all transactions which, once a $50 million market cap is achieved, will be donated to support Donald Trump’s presidential campaign via a Super PAC.\n\nWhen $Jenner on $ETH hits $50m market cap we will donate to @realDonaldTrump from the tax revenues! We have to protect crypto! It’s ULTRA MAGA! — Caitlyn Jenner (@Caitlyn_Jenner) May 30, 2024\n\nAD\n\nAD\n\nHer previous Solana token peaked at a $42 million market cap, according to DEX Screener, amid the industry-wide confusion that followed its launch. However, her new Ethereum project topped out at a $4.75 million market cap a few hours after it launched, according to DEX Screener. Now, less than 24 hours later, the token is sitting at a $2.4 million market cap—far off its $50 million Trump inspired goal.\n\nJenner has also slowed down tweeting since the heyday of her Pump.fun token. And when she does post, she’s often met with criticism and abuse, now that the Solana version of JENNER has plunged 81% since its Tuesday peak.\n\n\"Give Solana the love back!” one Twitter user replied.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9TcnZHN3p2cVVNTGg0RWI1MjFwUHlKLXBJS1hpVE8wcU0xb2x1R2tYVWJaTDFwQU5xUGJ2bXRKSHRtYlJjOTlac0Q1cEt3cmVhcDlMOHR0TjVkdjJPX3p3ZG1kNjZFY1o1dndJS0x5SS1Ea241V1ZYTEp6SXM4SW_SAYQBQVVfeXFMT25CRlE0ckROS0wxV1RqSHA0c29ZVG5FYzdWNWZCbXR6YzRfS3dWa3ZULWEtSDQwdGhLZkhaalliQ0RmOWlRVmw1NzJTZklJSDdoVFdNMmF0QlF3c2stVVhHbkZHZ2VtQ19jQmlEalJjYmdyQ010Mlk4ZlNzRDk2TVAxVURB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum: Can a retracement to $3.7K propel ETH’s price to $4000? - AMBCrypto News",
        "content": "Etherium to retrace to $3.7k to retest a support zone before a price surge to $4k.\n\nMost metrics hinted at a price correction in the near future.\n\nEthereum [ETH] is retracing to $3.7k, the resistance zone that turned to support before retesting to surge to a target high of $4k. This support zone could lead to a surge towards the target high of $4k.\n\nHowever, the fair value gap below $3.7k might act like a price magnet, pulling the price lower and potentially breaking this support. If the bearish momentum pulls the price past the support zone a retest at the upward trendline support is likely.\n\nAs of writing, CoinMarketCap data shows a 2.24% decrease in price over the last 24 hours and a 2.16% increase over the last 7 days. The overall Ethereum performance is on a bullish move as investors keep eyes on the $3.7k support level.\n\nIs a bullish surge to $4k possible after the retracement?\n\nAMBCrypto analysed Santiment’s Social Volume chart, it showed several periodic spikes in the mid-May, correlating with significant price movements. The retracement to 3.7k aligns with increased social activity indicating a potential price direction.\n\nAMBCrypto further analysed the IntotheBlock In/Oot of the Money chart and it indicated that 61.87% of addresses valued at $11.06 million are in profit while 37.38% of addresses valued at $6.68M are at a loss.\n\nAdditionally, it indicated that 135k addresses are breaking even. It showed that the key prices ranges from $3.3K to 3.6K in profits and $3.9 to $4k in losses.This distribution indicates a significant support and resistance levels based on the holders profitability.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe Bollinger bands in the daily chart widened, indicating a high volatile market that could steer a slight bearish pressure to the support zone at around $3.7k and break out to surge to $4k target.\n\nThe stochastic RSI (89.69) shows an overbought reading suggesting a short term retracement before continuation of the overall bull run."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPZWNWcy1HeGtjRWdKMWNnWVdLVnB0VGFrN25IekhuSFhNLXBYdnJsTXN5eEQ5SlVIb2tncWt6ekxmdkszTkFBWTd4NW11T2todHl4dTZraDR2S3l1S3JjUVIwaTBIamR0MDhzZjhTdklXZlByN2NKM1dEdEFQa2VkbF9lUmlRcFFpbVA3ZG5JWW1zV0lUR1Q5X2xDMGdsTUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Everything You need to Know about Ethereum ETF🔔 for BINANCE:ETHUSDT by pejman_zwin - TradingView",
        "content": "The information and publications are not meant to be, and do not constitute, financial, investment, trading, or other types of advice or recommendations supplied or endorsed by TradingView. Read more in the Terms of Use"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQcHVvaER6R0tSZUVKS25NeFZUdDlNY0x5Umd3bUJmVmFjOFBURU1lQTVHbjk3OVZsMWJHWVRJNURSR0Y0R0NBT2NQRVNmdkNYS1VzSEQtMHozeWRhVGhLVV9XMkVJUVpRbjZ5eGFhZXdBRllrTHRRbFotQ2FrSkp3Rm96V09wUmJ5OGY0R0dneUdIUFhTSElfM3FibFlUQXVxb0ZpZXdJc3VkOUdjQ0I1OFdpeGV4SG9RUmx2V0x3dWxPRUNwaWlCM3lZQjhFa2NKS21POHpBQVBvalV6VUVZ0gHkAUFVX3lxTE1DekEyZ2ZycjV0cnZwUFF6alZXeFF2ai1YbGZXWFNyWFlPanF1aGFwQ1prRWlSVW9jdjl0LUk2cEhjZnNTSFE0dGJBQnRkaHZNai0wTmx5eHZZekVWa3U5TGdSTjkxQkJNQUtMd0EtbFB2V1EyNmxYWWQ2aDkxVVpHWnBzc1JndWJTVWlYWWdJREtNS1N4Z1NvN0xlSVNRVHlBQlNNRHVKa1RCZUctdUxrSjdiUXpHZlMxdmwzcFFWbC1tVVZHdlhUc25IbXZndnFXd2c0MFZTd0FhTW1LOVFSR0xmNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum may continue outperforming Bitcoin as 'programmable money' may be ETH's new slogan - FXStreet",
        "content": "Ethereum transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) mechanism in an event christened “The Merge.” The transformation came as the network wanted to achieve more security, cut down on energy consumption by 99.95%, and execute new scaling solutions with a possible threshold of 100,000 transactions per second. With PoS, there are less entry barriers for miners considering the reduced energy demands.\n\nStaking is a process where investors grow their portfolios by locking their assets for a specified duration instead of selling them. It is used by most blockchains, especially the ones that employ Proof-of-Stake (PoS) mechanism, with users earning rewards as an incentive for committing their tokens. For most long-term cryptocurrency holders, staking is a strategy to make passive income from your assets, putting them to work in exchange for reward generation.\n\nEthereum uses decentralized blockchain technology, where developers can build and deploy applications that are independent of the central authority. To make this easier, the network has a programming language in place, which helps users create self-executing smart contracts. A smart contract is basically a code that can be verified and allows inter-user transactions.\n\nEthereum is a decentralized open-source blockchain with smart contracts functionality. Serving as the basal network for the Ether (ETH) cryptocurrency, it is the second largest crypto and largest altcoin by market capitalization. The Ethereum network is tailored for scalability, programmability, security, and decentralization, attributes that make it popular among developers.\n\nEthereum is trading around $3,837 on Tuesday as it enters a sideways movement. While current price movement suggests bulls may be running out of steam, it may also indicate a temporary slowdown until the market receives clarity on conversations surrounding the spot ETH ETF S-1 approvals.\n\nEthereum (ETH) followed a sideways trend on Tuesday as the crypto community seems to favor the term 'programmable money' as ETH's one-liner. Meanwhile, whales have continued accumulating ETH despite profiting from the recent price spike.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNSVhNcUtTYjRZSTlPNy1aM1A2VWdEQmc4LTBNX3g4UXcwMG9qYTZCb0tsTG0yOHJJUUI3aHk2cXdBRzljX1ZuaklWMzQ5LUI3dHpZYW1JTTlEMGJpN2djSEs0d1g2WFduU2txZjdLNFFwSFJwNFFjZDQ0YkVDN3Eybkxtd2dmRjE4SHRGTW9pQl92WEM3REZvOGNtLUZ0Y3k0Z1FWaXFKWDFVNkdQSi1EZXFWRjNkSVEzcld5S2p5VEN0bGJlQjdLb2tCTXgwOHNrVHQyU1JxYVNXRVQ1VFHSAeMBQVVfeXFMT1lPVzhFTmkyRFFJaWNfTlJhcm5Hd3RCeDdkNUZ3c2NfR3VjTUpZc002VmpRc2dkQ0J5QWdMUWIyMnZJdEFpanVmWkxycWNZRmtFSnhIdkRDX1ViX3VzOWV6bmttUnJEYUF6Mmd0bkxIWkIwdFFGekcyZ2wzeUZRTUdDbTBsSzJUMjhSUXNaYmxpaWZmOFhid25yVVZYd2dNaTNiUDZLNmt4R2lFZzFWUk9vUzlKaHNJMzlKaXRrejIyM1F1VjBzaDJlUlNibWhqUVBuM2Q2TFJRMnJMNzJzTEw2UUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Facing correction after ETFs led rally - FXStreet",
        "content": "Bitcoin price is unable to overcome the $69,712 to $71,907 area of resistance.\n\nEthereum price will likely pullback into the major support level of $3,360.\n\nRipple price could end the consolidation between $0.463 and $0.572 range.\n\nBitcoin (BTC) price continues to consolidate in a range that offers a buying opportunity, while other major cryptocurrencies, such as Ethereum (ETH) and Ripple (XRP), look set for a potential price correction. ETH and XRP rallied 10% and 5%, respectively, right after the US Securities and Exchange Commission (SEC) approved Ethereum’s spot Exchange Traded fund (ETF).\n\nBitcoin price eyes for a rally\n\nBitcoin price rallied 8% on May 20, but such an impulsive move could lead to a retracement. As seen in the chart below, BTC is currently being rejected by the order block between $69,712 and $71,240, which also harbors the weekly close at $71,280.\n\nSideline investors looking for buying opportunities could do so at the following levels:\n\nThe volume profile high node range that extends from $67,090 to $66,035. The 100-day Exponential Moving Average (EMA) is currently at $62,533, coinciding with the bullish order block range between $62,985 and $61,427.\n\nIf BTC bounces off the $62,533 level, it could rally 10% to the local top formed at $69,712.\n\nThe Relative Strength Index (RSI) and Awesome Oscillator (AO) indicators support the aforementioned bounce, which are firmly present above their respective mean values of 50 and 0, suggesting that the bulls are in control.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if Bitcoin's price closes below $58,271, it would invalidate this bullish thesis by producing a lower low in the higher timeframe, leading BTC to crash an extra 10% and hitting the previous support level of $52,400.\n\nEthereum price wants to move higher\n\nEthereum price broke above the falling wedge pattern and the 50 EMA level at $3,144 on May 20 and rallied 21%. Currently, ETH is being rejected by the bearish order block of March 12, ranging from $3,980 to $4,093.\n\nEthereum price could rally upwards in two ways:\n\nA break out above the daily bearish order block, extending from $3,980 to $4,093, flipping it into a support zone. ETH could pullback into the major support zones of 50-day EMA at $3,558, which roughly coincides with the bullish order block, stretching from $3,393 to $3,119.\n\nIf the conditions mentioned above are to play out, then the Ethereum price could revisit its all-time high (ATH) of $4,868.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 8% crash to the previous support level of $2,600.\n\nRipple price likely to end its consolidation phase\n\nRipple price is currently consolidating between $0.572 and $0.463 after a major 33% fall in mid-April. This 46-day consolidation has seen XRP forming higher lows in the daily time frame, indicating a decrease in selling pressure.\n\nIf Ripple price breaks above the $0.561 —$0.572 range, it could rally 8% to revisit the 61.8% Fibonacci retracement level at $0.621.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple price breaks below the range of $0.463, then XRP would crash an additional 10% to its previous support at $0.419."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPa3BDQndMNXBtZnRUXzFhRUdOaWVhX085NW9kcWFrcWFBRllTMXFIQzBzN2NRM2ZRTU9xMXUxNk1yN0V2Z0ZscjFCZ080b19Xa1lScTN3em5FX2E4V0V0ZFdWZkMzeFFBcEszanpMZTZXakd3ZjBRSE1fYmRReU5ocNIBiAFBVV95cUxPZDNJYmdPNExGckRQQ1gtcG9uOHF6MmpJalZmeHJkSEN6VWg5bFhWZ2lndlY3WHVaaWMzeFlyaDJzVnhMWlhJdjNvN0J3MnEzb0VSWXBnbUxON0M1SjNENTV6X0xvamttdUpDT3RfXzRHS2Z2Y0V2S0NKME92dXhLQ2VyMG1FaVJ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Singapore Bank DBS Says It Isn't an Ethereum Whale - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt would have been awfully bullish for Ethereum if DBS, the largest bank in Singapore, were a whale with $650 million worth of ETH on its balance sheet.\n\nBut that's not the case, according to the bank.\n\n\"In relation to the post, DBS does not have this position on our books,\" a bank spokesperson told Decrypt in an email.\n\nThe post they were referring to is one from blockchain analytics platform Nansen. The firm said on Twitter early Thursday morning that they had linked an Ethereum wallet to the bank.\n\nAD\n\nAD\n\nWe've identified this $650m $ETH Whale holding 173.7k ETH as DBS, the largest bank in Singapore with assets totaling S$739 billion as of 31 Dec'23 This address has made over $200m by holding ETH... 🤯 Track the address on Nansen here: 0x9e927c02c9eadae63f5efb0dd818943c7262fb8e pic.twitter.com/2rkM3cZ6gJ — Nansen 🧭 (@nansen_ai) May 30, 2024\n\n\"We have it under good authority, via several independent sources, that DBS owns the private key of this wallet and these assets are most likely a part of their custody solution,\" Edward Wilson, a Nansen analyst, told Decrypt. \"This may be similar to how we see institutions, both crypto native, like exchanges such as Binance or Coinbase custody funds on behalf of their users and how non-crypto native funds custody digital assets for their clients. The institution may be the custodian and responsible for managing the security of the funds.\"\n\nWhen asked if the wallet is instead one that the bank uses to custody funds on behalf of its crypto clients, the spokesman declined to comment.\n\nIt's not totally implausible that DBS would hold Ethereum—even if only on behalf of its clients. It's got a long track record as a crypto early adopter.\n\nAD\n\nAD\n\nThe Singapore bank has seen its market capitalization grow substantially since the start of the year, from $63 billion to $75 billion at the time of writing. It added support for China's CBDC, the e-CNY, last summer. And in 2020, when many banks were still blocking crypto transactions, the Singapore firm launched its DBS Digital Exchange.\n\nAnd when the exchange proved popular with its clients, the bank added a custody service as well.\n\n\"In 2022, DBS reported an 80% increase in the volume of Bitcoin traded on its DBS Digital Exchange,\" the bank wrote last year. \"Capitalizing on this momentum, the bank expanded its services to include digital asset custody, which resulted in a doubling of the number of Bitcoins under custody.\"\n\nAt the time of writing, DBS's shares are trading for $35.85 Singapore dollars, or approximately $26.55 in U.S. dollars. And Ethereum is currently trading for $3,756.96. That's a 1.5% drop since yesterday, but a 25% gain since last week when the U.S. Securities and Exchange Commission approved Ethereum spot ETFs to trade on exchanges."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNbEh6V0F1WUhjend5NzUwaTl4UGJiOTZSa2luSEZYZzBRdXQtTFNWbkVBY2EtRVY0ZUpyMi1JWVNwR1RnclFJN0RhY05LV1Y2dnR2WnlJNDh1NmU5ZC03OVZSV3FuZ19oaUtZeUxPM2hRSjJQLVFEQXhrNG5ESGZoNXhmbnZKZEZZR3FCMkc4eDlpbzZQREt1eHZfcnYtbzhKQzB6cmNSa3JQQnppMVA0cUsxRm1rT1g4dEVFZnZKYnJVUEtIWmpsT3lzcTlYaU1vdU02TXdGLTV1RWx6RVl0TkNwZHpWaW5Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Cathie Wood Of Ark Invest Believes Ethereum ETF Approval Linked To US Politics, Sees Likelihood Of A Solana ETF As Well - Benzinga",
        "content": "ARK Invest CEO Cathie Wood has stated that cryptocurrency has become a significant political issue in U.S. elections, leading to the unexpected approval of key Ethereum ETH/USD ETF filings.\n\nWhat Happened: Wood made this remark at Consensus 2024, as reported by CoinDesk, attributing the sudden approval of Ether ETF filings to the growing importance of cryptocurrency in U.S. election debates.\n\nWood expressed surprise at the approval, stating, “The read was it was not going to be approved. It was absolutely not going to be approved.” She further explained that the sentiment around the Financial Innovation and Technology for the 21st Century Act (FIT21) evolved in the House, leading to its recent bipartisan approval.\n\nWood also pointed out former President Donald Trump’s increasing comfort with Bitcoin and other cryptocurrencies, including his recent decision to accept campaign donations in crypto, as a factor that has drawn attention to the sector.\n\nSee Also: Shiba Inu, Dogwifhat Post Double-Digit Gains As Memecoins Shrug Off Dips In Bitcoin, Ethereum: What’s Goi\n\nWhile Wood suggested that a Solana SOL/USD ETF could be approved, she deemed meme coin-focused funds unlikely, stating that large brokerage firms and investment advisory companies would not accept more than “the majors.”\n\nWhy It Matters: Wood’s comments come in the wake of her earlier predictions about the potential of cryptocurrencies, especially Bitcoin ETF/USD. In April 2024, she raised her Bitcoin prediction by $2.3 million, suggesting that a $1,000 investment could be worth a significant amount by 2030.\n\nDespite Ether’s recent spotlight due to the ETF approvals, Wood maintained her bullish sentiment on Bitcoin, stating, “Bitcoin, hands down. No question about it. It is a global monetary system. It is a technology, and it is a new asset class.”\n\nEarlier this week, she also highlighted how El Salvador’s push for Bitcoin and AI could potentially increase its GDP 10X in five years.\n\nARK 21Shares Bitcoin ETF ARKB attracted inflows of $4 million on May 29, and around $ 3 billion since the ETFs started trading in January, according to SoSo Value.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Edge Lower As Inflation Fears Grip Investors: Less And Less Of King Crypto Available For Masses, An ‘Enormous’ Bull Market Inevitable, Says Analyst\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiggJBVV95cUxQMmM1UVpBMlZaNFR2aFFBTjBfQ1dNV2pfRUU3THhMcC1VREJrYUw4ek1naFQ5MzhLUFpJSTYxWUNBRmcyYTNZUFBiTHJOYXdoa3FEYTJFS29TOU5yVkpVN2xjZjR5SVdHT21WUng0cUVNWEJWTTFlcFpZZ2ltOWkwS2M4UnpDQUlEckZabXVndFhwb3pjSVVRdVBEak1YUUh2dUlJYWpMWXhUNjJmcHVEOTBaWDJjUGpkVjVZNmUzZVVDbTFxSDlHZ2l5OFUweUdOWDFadWtkZFdpLTI3WUQyWU83dDAzRHIxTVJWU3RzWDBRdGttaTgyeUlKYXhVQ3d6N0HSAYcCQVVfeXFMT0FZNkFWLVFUdVRMTzZsV0ZvczY0SUM5Q0lZcmxMbEJmejVsSENRTmxlRVdpUV9XT0g1Ykl2VUxNTUtnNGVlaDZJb2tremJTX0NtREYzd2E1Wmp5SkpSNUJmSEpRdjREVTB6OGtJaGllNHI2Y0o3RmVPbVJXdjZDM1FIRjlXclJwWU1lMHg1bVVzN3JzOWJvdHJ4U2VVYnJWQ2Nvb1RlTVF5ZHZhWHhoUmxXemlqT1JlZ0VseFlJRVlFNHFRZm0wb1VvZjMwQ3hvblFLeHlfSFN5NHVPNHF5VEZuby1zcGtnR2pRTEEya2p0VEs2VXZac0psNy1ZdzAtUXNlVTIyaGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock’s Ethereum spot ETFs listed on DTCC: Five cryptos to diversify with and capitalise on this trend - The Economic Times",
        "content": "KangaMoon (KANG) raises over $7.2 Million and reaches 32,000 Users\n\nNear Protocol crypto on the rise as network surpasses $200M in issued USDC\n\nEthereum Classic Price at an uptrend following latest updates\n\n\n\nEthena (ETA) rises 27% – How far can it climb in 2024?\n\n\n\nBlackRock’s spot Ethereum ETF has been listed on top of the Depository Trust and Clearing Corporation (DTCC) with the ticker symbol ETHA.This listing follows the SEC’s approval of a total of eight spot Ethereum Exchange Traded Funds (ETFs). Following this major move for ETFs in the Web3 space, traders have begun to diversify their holdings in order to get the most out of the market. Out of the thousands of available altcoins, five have stood out the most as cryptos that can surge in value immensely, and these include KangaMoon (KANG), NEAR Protocol (NEAR), Ethereum Classic (ETC), Chainlink (LINK) and Ethena (ETA). Let’s take a look at these cryptocurrencies:KangaMoon ( KANG ) will revolutionise the meme coin landscape through the construction of a sustainable ecosystem that fosters significant token utility, one that transcends hype-driven trends. This is achieved through a strategic fusion of Social-Fi elements and Play-to-Earn (P2E) mechanics, which cultivates long-term value beyond just hype.In addition, the token’s blockchain ICO has garnered significant traction, as the project now boasts a user base surpassing 32,000, while the token has experienced a growth of 400%. The presale itself also secured over $7.2 million in funding, which further solidifies investor confidence, as it is projected to break past $8 million by the end of the month. Moreover, KANG’s initial price point was at $0.005 but now trades at $0.025 during the bonus presale stage.Not only does this reflect significant growth but the round also represents a limited-time opportunity to get KANG at a discount before it explodes in value. In addition, KangaMoon has already established its presence on prominent platforms such as CoinMarketCap and CoinGecko, facilitating investor analysis, and will soon get listed on BitMart, a major CEX. As a result, analysts are now projecting a 100x price increase following its launch.NEAR Protocol (NEAR) surpassed $200 million in natively issued USDC , which is a major milestone that can send the ecosystem demand and utility further. This will also have the effect of increasing demand for the NEAR Protocol crypto, which can result in a price uptrend.The on-chart metrics for the crypto are now bullish, as the NEAR Protocol price has found support at $7.70 after briefly passing the $8 price barrier. Now, the RSI and MACD data showcase a positive price momentum, and according to the NEAR Protocol price prediction, it can end Q4 of 2024 at $11.46.Ethereum Classic (ETC) is also experiencing an upswing in trader interest following its most recent integrations. For example, now anyone can mint the Ethereum Classic crypto through the usage of the F2Pool The on-chart metrics for the Ethereum Classic price are bullish, as the weekly price increase was by 20%, further solidifying it as a major contender. Based on the Ethereum Classic price prediction, by Q4 of 2024, the crypto can end the year at $45.71. Chainlink (LINK) expands services in nine different blockchainsChainlink (LINK) is consistently expanding the offering of its ecosystem, as within the past week, it saw 12 integrations of six chainlink services, all across nine different blockchains, including Arbitrum, Base, Ethereum, Linea, Metis, Optimism, Polygon, Scroll and zkSync.The Chainlink crypto has also increased in value as its weekly chart suggests a 10% uptrend, and could soon result in further gains. Based on the Chainlink price chart, it recently surpassed the $17 price barrier, indicating that $20 marks a major resistance point that it now needs to pass in order to reach new heights. According to the Chainlink price prediction however, the crypto can end Q4 of 2024 at $25.08.Ethena (ETA) is also at an uptrend as it experienced a 27% price increase during the past week fueled by ecosystem expansion. The team recently announced that USDe is the first integration, with the new UX layer of DeFi , Infinex. As a result, anyone can now deposit USDe and earn from Ethena while also earning Infinex governance Points (GP). The Ethena crypto could see a major uptrend as a result, further appealing to traders.According to the Ethena price chart, it broke above the $0.90 price barrier, and is closer than before to passing even above $1. According to the Ethena price prediction, it can end Q4 of 2024 at $1.33.With Ethereum ETFs being approved, the race is now on for more cryptocurrencies to get the same treatment. Out of the many cryptocurrencies available, the key ones that stood out the most include NEAR Protocol, Ethereum Classic, Chainlink and Ethena.However, the biggest growth was seen with KangaMoon as it's up 400% on the charts, and it has raised over $7.1 million so far. With a unique blend of Play-to-Earn (P2E) features, Social-Fi elements, and a community-driven approach, it is poised to dominate the charts in 2024 . Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today! Join the Telegram Community:The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNZ3ZPM3hwYXlYUDF4VWFiRmhyOFZuY0JvN2Z1YmEzVUMwNE02TTZRbEdoVnhBdUJFYkozR1UtNy1xekptdW5aRkx3NmdCOEZYLUVSSGVMOWV5bTdGR0JHTWdDckU2ajNfZzRnQ0o0RjVfcTZXZi1aajVmaDdBYVlwWExreUNCNXlGZmhCYmRjMXdxOTJQTzNHaUJyZnk5ZzVsblB3OGktTVdCSl9kOUZhTEgzYzA3WU9UcnBHWHo5YUNWc1VVcVlkMDY0YUFlNjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum due for new all-time high as countdown to Ether ETF nears end - TradingView",
        "content": "Ether ETHUSD may surprise crypto markets to hit fresh all-time highs before Bitcoin BTCUSD reenters price discovery.\n\nIn some of his latest market analysis, Michaël van de Poppe, founder and CEO of trading firm MNTrading, forecast a \"likely\" move by ETHUSD to come.\n\nAnalyst sees altcoin focus boosting ETH price\n\nEther is the next cryptocurrency in line to beat its current all-time highs, new analysis says.\n\nAs Cointelegraph reported, crypto traders anticipate strong Bitcoin price action in response to another landmark ETF moment — the launch of spot ETF products on Ether in the United States.\n\nThese, while not yet fully approved to start trading, have received a notional green light from regulators after a surprise U-turn.\n\nAt the same time, the move could reduce Bitcoin’s share of the overall crypto market cap — something which some see giving altcoins more room to gain.\n\n\"The Bitcoin dominance has likely peaked this cycle at 58%,\" Van de Poppe argued at the weekend.\n\n\"The valuations of altcoins are super low compared to Bitcoin. Likely the next all-time high is going to be reached for Ethereum.\"\n\nCointelegraph\n\nETHUSD traded at around $3,850 at the time of writing, per data from Cointelegraph Markets Pro and TradingView — still a considerable way below its record $4,900 set in late 2021.\n\nIBIT becomes world's biggest Bitcoin ETF\n\nThe Bitcoin ETF battle saw a symbolic milestone on May 28 as BlackRock’s IBIT beat the Grayscale Bitcoin Trust (GBTC) in BTC holdings for the first time.\n\nAccording to inflows tracked by sources including crypto reviews portal Apollo, at the close of Wall Street trading, IBIT had accrued 288,670 BTC versus GBTC’s 287,450 BTC. Cointelegraph\n\nThis “flippening” had long been on the cards for market observers. Since its conversion to a spot ETF in January, GBTC has steadily shed its assets under management as investors shift their funds.\n\nAt the outset, GBTC held nearly 620,000 BTC, with the tally now down 53%.\n\n“Biggest news: Blackrock now holds more BTC than GBTC,” popular commentator WhalePanda wrote in part of a response on X (formerly Twitter).\n\nWhalePanda also made reference to upheaval at Grayscale itself, with CEO Michael Sonnenshein announcing that he would be stepping down earlier this month.\n\nBitcoin ETF operators have seen a resurgence in interest in recent weeks, with inflows now net positive for ten consecutive days. Cointelegraph\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOc0ZsZFJ2ZV94bG5QdlMxdHpQbzBCMTZtN09VOEhxcnVRcXZtN3IzWU5KNVJ2VHI4R3UxNWtfajNFM1JTamR4ZGRJLTlvQ2loVHRoNVU0Sk11aWZUVkU3bnRXT1J0SmxVRnhBQ0RFU0pkeTZJT2YxXy1GRmZuMEtUenRsVEIxN1hSeUZ4SVl3a0NrQmRtSlBQdlF2SFBHU1VFOVhDRFBzN090eHZMbExxUjdabHhRck1RNk5iejYzVThtd0tKVERtNUJUNzliQ0xtSFBvZmozakI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s Impending Halving and Stellar’s Protocol 21 Upgrade, BlockDAG Takes the With Promising Future - Blockchain Magazine",
        "content": "Ethereum Classic’s Impending Halving and Stellar’s Protocol 21 Upgrade, BlockDAG Takes the With Promising Future\n\nNavigating the ever-evolving landscape of cryptocurrency can be daunting, but the latest developments from Ethereum Classic, Stellar, and BlockDAG are turning heads in the blockchain community. As Ethereum Classic approaches a pivotal halving event and Stellar rolls out significant upgrades with its Protocol 21, BlockDAG is making waves with its groundbreaking smart contracts platform.\n\nThis blog dives deep into these developments, exploring how they are reshaping the investment opportunities in the blockchain sphere and why BlockDAG, with its impressive fundraising and innovative platform, stands out as a top investment choice for 2024. Join us as we unpack the potential impacts of these critical updates and what they mean for crypto enthusiasts and investors alike.\n\nEthereum Classic’s Anticipated Halving\n\nScheduled between May 27 and June 11, Ethereum Classic’s halving event will slash the mining rewards in half, influencing the supply and potentially boosting the cryptocurrency’s value.\n\nLaunched in July 2016 as a divergence from Ethereum due to a security breach, Ethereum Classic remains committed to the Proof-of-Work (PoW) consensus, emphasizing its dedication to decentralization and security, unlike Ethereum’s shift to Proof-of-Stake (PoS).\n\nStellar Enhances Its Network with Protocol 21\n\nStellar has recently upgraded its Testnet to Protocol 21, paving the way for smart contract capabilities, a significant stride toward enhancing its functionalities beyond mere payment transactions. Key forthcoming milestones include stable releases of Stellar Core and Horizon, a Testnet reset on June 11, and a Mainnet upgrade vote on June 18. This move, backed by the network’s validators in February, positions XLM for substantial benefits, especially within the Decentralized Finance (DeFi) sector.\n\nBlockDAG’s Revolutionary Smart Contracts Platform\n\nBlockDAG’s presale is experiencing significant growth, with total contributions now surpassing $37 million. This increase is propelled by robust investor interest and strategic improvements to the platform. One of the key upgrades is the redesigned dashboard, which enhances user interaction through new features like an announcements section and a notification tab, keeping users well-informed about the latest updates.\n\nThe recent enhancements to BlockDAG’s dashboard underscore its commitment to transparency and empowering its users. The updated interface allows investors to monitor their rank, transactions, and referral bonuses effortlessly. This intuitive design keeps investors well-informed and optimizes their potential earnings, making BlockDAG an attractive option for experienced traders and those new to the market.\n\nFurther innovating in the blockchain space, BlockDAG’s low-code, no-code smart contracts platform transforms how blockchain development is approached.\n\nThis platform enables individuals without deep programming skills to easily create and deploy smart contracts using predefined templates for various applications, such as utility tokens, meme tokens, or NFTs. This accessibility is lowering the barriers to entry and fostering wider participation in the blockchain ecosystem.\n\nBlockDAG’s innovative platform is poised to draw diverse developers and innovators, thereby enriching the decentralized nature of the blockchain industry. With the increasing adoption of BlockDAG’s tools, the network’s ecosystem is poised to expand significantly, leading to robust growth and a thriving crypto community.\n\nFinal Tak\n\nThe evolving crypto market continues to offer unique investment opportunities. Ethereum Classic’s halving could shift its market dynamics, enhancing its value. Stellar’s upgrades suggest broadening capabilities, potentially elevating XLM’s status in the DeFi landscape.\n\nMeanwhile, BlockDAG’s innovative platform and significant fundraising underscore its potential for remarkable growth. As these projects advance, they collectively underscore the current blockchain ecosystem’s dynamic nature and investment potential.\n\nJoin BlockDAG Presale Now:"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNVFNEOXduSlJMLVU5UWh3UzNuQmRSNmZiZWtCZjV3LUlQT0pRWTI1SFh0a3BnYkNqLUd1Tldib1V1VmFROUF4SDlwNUg0M3ZpQWZFT3k0eTJ2OGplZFU4Q3FXUUF6VWxlazMzaWFBTEJEWjNyU0NSRll5ZjQ1SENyWUVOOG91cmxocXFpZmp5a244UlXSAZgBQVVfeXFMTy1Vbmd3al9tM1dRWTlfUFJiRjU3U3ZfSVFEMk5RS1p0VU5lbFNsYVQ5STloN1plMVNLdVlrM3hyOEJVakVoUlY0X19nM3FmRjZrclk4N05aZEtSR0dpQXpKb0Nlbl9mWEh6N2gzYUtOUHctb21rbUNTTGZCdWpzTFE3NTBSaVFQMllEZ0lsVWJ6M0F3dFlqNV8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Vanguard Receives Backlash Over Ethereum ETF Ban But There’s A Catch - CoinGape",
        "content": "Vanguard Group, one of the leading investment advisors in the USA, is facing significant backlash for its refusal to allow Spot Ethereum ETFs on its platform. This decision comes despite growing interest in cryptocurrency assets and recent regulatory developments. Earlier, the firm provided a similar stance on Spot Bitcoin ETFs.\n\nVanguard Attracts Criticism For Not Offering Spot Ethereum ETFs\n\nEric Balchunas, Bloomberg’s Senior ETF analyst, expressed his disappointment on social media. In a post on X, he vehemently criticized Vanguard’s stance on Spot Ethereum ETFs. Moreover, he called the move “silly” and suggested that the firm is playing a “Nanny role.”\n\nadvertisement\n\nBalchunas sarcastically argued that Vanguard’s investors are “the smartest money on the planet” and are capable of making informed decisions about their investments. “Crypto was able to shift the stance of some in the highest rungs of government but not Vanguard, who maintains their platform ban for Ether ETFs which are ‘not aligned’ with building a well-balanced, long-term portfolio,” Balchunas wrote on X.\n\nDespite his critique, Balchunas seemed to understand Vanguard’s cautious approach on Ethereum and Bitcoin ETFs but still found it excessive. Moreover, the analyst acknowledged that Vanguard operates differently from other asset managers. He noted that the company functions more like a co-op, focusing less on hunting for revenue.\n\n“They’ve taken in nearly a billion a day for over a decade, and so they’re not envious of other people’s hit ETFs,” he added. The investment advisor’s decision comes shortly after the U.S. Securities and Exchange Commission (SEC) approved the 19b-4 filings from several issuers for Spot Ethereum ETFs.\n\nHowever, these ETFs are not yet available for trading. The SEC still needs to clear the S-1 registration statements from fund issuers. Most expect the launch of these products by July 4, 2024, as predicted by the Bloomberg analyst previously.\n\nIn a statement to Blockworks, a Vanguard spokesperson clarified the company’s position. “While we continuously evaluate our brokerage offering and evaluate new product entries to the market, Spot Ether ETFs will not be available for purchase on the Vanguard platform,” the spokesperson said.\n\nAlso Read: Alike Bitcoin, Vanguard Has A Clear NO For Spot Ethereum ETFs\n\nBloomberg Analyst Hints At A Ray Of Hope\n\nThe firm has consistently distanced itself from the crypto world, labeling it an immature asset class. The spokesperson reiterated, “We believe that cryptocurrency products are not aligned with our [offerings] focused on asset classes such as equities, bonds, and cash, which Vanguard views as the building blocks of a well-balanced, long-term investment portfolio.”\n\nBalchunas highlighted a potential silver lining in the form of Vanguard’s new CEO, Salim Ramji. Ramji, a former BlackRock executive, played a significant role in launching BlackRock’s Bitcoin ETF (IBIT). Moreover, he is believed to have contributed to BlackRock’s ETHA Ethereum ETF as well.\n\nHence, Balchunas speculated that Ramji’s crypto-friendly background could influence Vanguard’s future stance on cryptocurrency products. “The only hope at all is that their new CEO…is clearly into crypto. Will he be able—or even try—to move the needle on this internally or just opt to bury that part of himself? Answer unknown,” Balchunas pondered.\n\nAlso Read: BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOZlJSenVvWldHckhSak8zc2lET0VrMk9UNHdvNTlQekpiUlBYMU16Y19TWXBNOXdPZnZyTjRlZkdsVDdaSTFvX190blR4MGV5WGpTOFFkaUk4QlJvRHlVYVBUcmNBN1ZXekVZTFB0azF4a3llZnUtRzFxcm9nLVA5YWlBMFN2RXNvcnFiSFN3Y3dJTzFldzZNN1BGcEQ2SHZZQ3hPUXc3eFVaeDlYa1p0U0Y3ZzJWWDUyVVRPWTBaMkVlVGN6bGRkQ3N4bmExNXZqckFKZVJwNXp6RTE0UXROV9IB5gFBVV95cUxPQVVlMUtTNE1oQ0QtUEZ6NFprS0hLSURmaEV6WDVBSDRYZmVXNDREU1UxRkxDLW1xU3luQ01ZVWE2RktWQ1FHMzJ1VWV3bnBOQWxEQnhuNWZUWGcwa1VFNjJDbVl6TVNlSl9DYms5TjJtLWE0aFFwV2FfdHJHV1FncVA4d3Y0ek5yZEN3VDBrN19Ka3I5Q08wNnJGZmVxSm04bHVDaFQxNGlxY1UtcUpiMXNiT19mMExuMUNKVkVZSUZaMXdjTUVPRjhhVmVVQXdMUWh4QXh5LUlrN291WC1mU0syNldQQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum price lags, investors potentially reallocating capital after BlackRock's updated S-1 filing - FXStreet",
        "content": "Ethereum ETFs will likely begin trading soon after BlackRock filed its updated S-1 application.\n\nVanguard won't offer Ethereum ETFs on its platform.\n\nEthereum investors may be reallocating capital to benefit from the potential larger upside of smaller-cap DeFi tokens.\n\nEthereum (ETH) price shows neutrality despite positive updates of BlackRock's spot ETH ETF updated S-1 application and the Securities & Exchange Commission’s (SEC) engagement with issuers. A key reason for the price lag may be a potential capital reallocation from investors to DeFi tokens in hopes of a larger upside if the launch of spot ETH ETFs spurs a rally.\n\nDaily digest market movers: BlackRock S-1 filing, Vanguard says no to Ethereum\n\nBlackRock filed an updated S-1 for its spot Ethereum ETF on Wednesday, according to updates on the SEC's website. The recent filing comes after the SEC approved 19b-4 applications of eight issuers — including BlackRock's iShares Ethereum Trust — on May 23.\n\nNational exchanges like the NASDAQ or the New York Stock Exchange (NYSE) submit 19b-4 filings to the SEC to seek approval for listing new products on their trading platforms. On the other hand, S-1 refers to the initial registration form detailing how a fund would be managed and how it would track the underlying asset's price.\n\nThe SEC must approve S-1 applications before the ETFs can launch officially.\n\nRead more: Ethereum slightly tilts toward bears, may only see 20% of Bitcoin ETF flows following silver comparison\n\nThe filing revealed the iShares Ethereum Trust's ticker as ETHA and mentioned key details about its seed capital investor.\n\n\"On May 21, 2024, the Seed Capital Investor, an affiliate of the Sponsor, subject to conditions, purchased the Seed Creation Baskets, comprising 400,000 Shares at a per-Share price equal to $25.00,\" said BlackRock in its filing.\n\nAdditionally, BlackRock updated the APs for the ETF, replacing JP Morgan with BMO Capital Markets Corp.\n\nAn AP is a financial institution — often a bank — that provides liquidity to facilitate the creation and redemption of ETF shares.\n\nAccording to Bloomberg analyst James Seyffart, BlackRock's latest filing confirms that the SEC and issuers are working toward spot ETH ETF launches.\n\nAlthough several analysts have expressed that an S-1 approval usually takes months after 19b-4 approvals, Bloomberg analyst Eric Balchunas suggested that spot ETH ETFs may only take weeks.\n\n\"Good sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4,\" said Balchunas.\n\nAlso read: Ethereum may continue outperforming Bitcoin as 'programmable money' may be ETH's new slogan\n\nHe also noted that BlackRock may update its S-1 again as it lacks information on fees and other key data. So far, Van Eck and BlackRock are the only issuers to have submitted updated S-1 filings to the SEC.\n\nThe Block also reported that two sources confirmed that the SEC asked issuers to turn in their updated S-1 filings by Friday after which the SEC will give its first round of comments before further amendments.\n\nMeanwhile, Vanguard has said it won't offer spot ETH ETFs on its brokerage platform, according to Blockworks. \"While we continuously evaluate our brokerage [offering] and evaluate new product entries to the market, spot ether ETFs will not be available for purchase on the Vanguard platform,\" a Vanguard spokesperson told Blockworks. The company also declined to offer Bitcoin ETFs on its platform when it launched.\n\nCrypto was able to shift the stance of some in the highest rungs of government but not Vanguard, who maintains their platform ban for Ether ETFs which are \"not aligned\" with building a well-balanced, long term portfolio. https://t.co/0JjiWzvxBX — Eric Balchunas (@EricBalchunas) May 30, 2024\n\nHowever, many expect the asset manager to eventually soften its stance toward crypto assets, especially after appointing former BlackRock executive Salim Ramji as its new CEO. Salim Ramji was instrumental in BlackRock's foray into digital assets like Bitcoin and Ethereum.\n\nFidelity also listed its spot ETH ETF on DTCC under the ticker FETH, according to PhoenixTrades.\n\nETH technical analysis: Ethereum investors potentially reallocating capital\n\nEthereum traded around $3,776 on Thursday after bouncing from the $3,710 support. ETH's current price action suggests a mix of profit-taking and buying from investors. This is also confirmed by a series of large exchange ETH inflows and outflows, according to Whale Alert. Ethereum liquidation data also aligns with $11.94 million of liquidated long positions and $10.92 million of shorts.\n\nRead more: Week Ahead: Checking the health of Bitcoin’s bull run\n\nConsidering the positive news surrounding ETH ETFs and the potential rally that may occur from their launch, it may seem strange on the surface that some investors are taking profits. However, these investors may be reallocating capital in small portions to DeFi tokens, considering their potential bigger upside during a rally.\n\nETH/USDT 4-hour chart\n\nETH will likely see more price gains as other issuers update their S-1 applications. Hence, it may tackle the $4,093 resistance, which has proven hard to break in the past few days. The $3,605 support may hold strong in case of a decline."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPaWlQQ3JOWXpPUnc1c0hPSndxSHBZdnZBZUFXZkllMkl5eGE0aGhsRV9PTXl1ZlloNDRPX28yQ1NYNW9hcUNBYktpa3lOSlp0V1RESEJhQzZrbnU0XzJzZE1OUnZHbHZYWjI1OHlfcy15clZMcWp0MEM4Rk93S19PT0VJS1NYYTk5SkdPeXln0gGTAUFVX3lxTE41SUhFWEhKbmZKd2ZhaXhDT3Z5ZmhQdWtaNF9wSVI3WmIyMW5tYWxqUmRiZ3hNUkMwYW92TUtVc2FRa1lBWlM0U3pkME1PcXBvaTJ1c0lpZDc4UmRzdnlfSDg1bWlHTEJFZ2dBcEc5bzdwamlQZ0dPaVpNNGNYOF9IdUlTZ3hHVGhzazlwRUJfOHY1bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs could ‘grab 20%’ share of BTC ETFs: Analyst predicts - AMBCrypto News",
        "content": "US ETH ETF could attract less capital flows compared to US BTC ETF products\n\nThe analyst based his projection on ETH vs. BTC futures ETFs and Silver vs. Gold.\n\nThe much-awaited launch of US spot Ethereum [ETH] ETF (exchange-traded funds) may struggle to replicate the success of the Bitcoin [BTC] ETF. According to Bloomberg ETF analyst Eric Balchunas, the much-hyped spot ETH ETFs might grab about ‘20%’ of the BTC ETF’s market share.\n\nPart of Balchunas’ analysis read,\n\n“I’d at least divide by 5 when it comes to expectations around the Ether spot ETFs re-flows/volume/media/everything relative to spot bitcoin ETFs. That said, grabbing 20% of what they got would be huge win/successful launch by normal ETF standards.’\n\nEthereum ETF vs. Silver ETF\n\nThe analyst’s 20% of the BTC ETF market share was based on the current market share on the futures market. ETH ETF instruments are already available in various jurisdictions as futures ETF offerings.\n\nBased on the futures market share between BTC and ETH, Balchunas showed that ETH only commanded about 20% on average, a likely scenario that could happen to spot ETFs, too.\n\n“The poor showing of the eth futures is a big part of my calculus. That said, the stronger showings in Europe have me splitting the difference with the final prediction of 20% share.”\n\nAdditionally, the analyst equated BTC to Gold and Ethereum to Silver and made another analysis and assumption Gold vs Silver ETF basis. Per Balchunas, Silver ETF currently has only 15% of Gold ETFs’ market share. He stated,\n\n“Many won’t feel the need to go beyond bitcoin/gold for their crypto/precious metals allocation.”\n\nAs of 28th May, the US spot BTC ETFs had $13.7 billion in total flows. Based on Balchuna’s projection, that could equate to $2.7 billion of ETH ETFs over the same period.\n\nHowever, from a Hong Kong perspective, especially based on the leading ETF funds from Bosera, BTC flows were twice as much as ETH flows for the spot products.\n\nAccording to Farside data, Hong Kong’s Bosera spot BTC ETF saw total inflows of $15.3 million, compared to its ETF product’s $7.5 million. That translates to about 50% of BTC ETF flows for Bosera spot ETH ETF.\n\nHowever, according to CoinMarketCap data, ETH’s $454 billion spot market cap was 34% of BTC’s $1.3 trillion.\n\nThat said, the US spot ETH ETF products could launch in July, with some analysts expecting the ETH price to hit $4.5K before they start trading."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPZ1RwdjVqRDVMTU9JSmc2UzFQYkZUMlNxNl90Ny1RVkd0SW9VV2dGa0Q1SWxKZi1Ib0Q0aFlRajhmaHNaUkVqUHNMc2xiVl9LZEN3ZE05S3NNRkF5cXlBcFpySFI5ZkVaZHVPNDBPQWVFb0RwTmlBd29JTkNfTlYwS1ZUMNIBiAFBVV95cUxNWXpBb3pKYlU1WXNVcVltdEpQS2tmZ0FKdk51RkhfNFhoVk9hY3pGbFFaQ2JiQ1loTnlCRjd2UWZRV085c2wyZXBwcTJyVENkdl93bXFBa1VFSkhSV0U4N2ZvMmxjaG44aFJLdW1SVjdJTTBidkZVYXpINndCcjJzZVFBZF9OUjFX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Why Ethereum’s crypto whale holdings increased 27% in 14 months - AMBCrypto News",
        "content": "The past few months have been marked by an uptick in ETH whale activity.\n\nSince the SEC approved ETH spot ETF, there has been a rally in daily whale transfers.\n\nEthereum [ETH] has witnessed a surge in whale activity in the past few months, Santiment noted in a newly published report.\n\nAccording to the on-chain data provider, the recent uptick in whale activity has been fueled by rumors and the eventual approval of spot Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission.\n\nOn the 23rd of May, the regulator approved 19b-4 forms for the ETF applications filed by BlackRock, Fidelity, Grayscale, Bitwise, VanEck, Ark, Invesco Galaxy, and Franklin Templeton.\n\nThis approval came unexpectedly after an extended refusal to communicate with issuers.\n\nETH whales take charge\n\nPer Santiment’s report, over the past 14 months, whale wallets that hold at least 10,000 ETH coins have increased their cumulative holdings by 27%.\n\nThis cohort of ETH holders bought 21.39 million ETH, valued at $83 billion, at current market prices during that period.\n\nAccording to Santiment,\n\n“Ethereum has even gained on Bitcoin (by percentage) over the past month after the rumors and eventual approval of the first Spot ETH ETFs were announced by the SEC. So it’s no surprise to see that the whale accumulation has not come to an end.”\n\nRegarding daily whale transactions involving ETH, the on-chain data provider noted that after last week’s spot ETF approval, the number of ETH whale transactions exceeding $100,000 and $1 million surged to YTD highs.\n\nOn that day, the number of ETH transactions valued above $100,000 reached 7,649, while those exceeding $1 million totaled 1,252.\n\nThis surge was due to an uptick in profit-taking activity among the coin’s large holders. Santiment noted,\n\n“This was clearly an opportunity that whales saw to profit take. However, prices may continue to outperform Bitcoin as long as these 10K+ ETH wallets are still moving north instead of south through this volatility.”\n\nETH holders book gains\n\nAmid the growth in whale activity since last week’s approval, daily transactions involving ETH have been profitable.\n\nAMBCrypto assessed the daily ratio of the altcoin’s transaction volume in profit to loss (using a seven-day moving average) and found that it was 1.87.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThis meant that for every ETH transaction that ended in a loss in the last week, 1.87 transactions returned a profit.\n\nAt press time, the altcoin exchanged hands at $3,865, according to CoinMarketCap’s data."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOSGcwbEpiUWN4eERqTlhjMnV3VVBybmF3N0VtelI2dUJrNENMWVpLQi1SeF9PODU3ZGIxUUF5UF94akJNenpKd05TeVp0N0pPWUxWVnZsdk82dGE1MGhPdmprRXRCZUkwUTIwV3d3TEZDU2JnOXlEdnhCOVAwS2QzSlpscS1yZHfSAYwBQVVfeXFMT1ZvTUJGSFo2TG92T28ybE5mcl9PS1o4eUYyMzFkMEc5dkFzSTlpSW5JdURDOUxOdFdMWE1UQlBmdUlWc1hPYnN0elp3bE1MOXdiU3ZUVnNRaTk1UFZJMVpJN0VnVDhJdGtpT2xveDlPYk9INkFBd0NnY3JYUndzWEVBWTVqelNPVXpLRGw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum: THIS can majorly impact ETH’s $5K price prediction - AMBCrypto News",
        "content": "Exchange inflow reached January highs, putting the ETH’s price at risk.\n\nThough the reward ratio dropped, a key indicator suggested that ETH could rally above $4,700.\n\nAlmost six months since it last hit the highest exchange inflow, Ethereum [ETH] is back in the same situation, sparking speculations that the price could swing lower.\n\nAt press time, ETH’s price was $3,874. According to data from IntoTheBlock, the exchange inflow was as high as 140,660 on the 25th of May.\n\nWhile the inflow has not shed much, AMBCrypto’s deep-dive into the rabbit suggested that the bullish prediction might not come as fast as market participants expected.\n\nIs a new low coming?\n\nThis is because the high flow of cryptocurrencies into the exchange is a sign of increased selling pressure. As such, it might be challenging for Ethereum to hit a higher price unless the pressure slows down.\n\nAMBCrypto’s investigation showed that the rise in the sale of the altcoin could be linked to its recent price increase. A few days ago, ETH’s value was over $3,900. This was a 16.82% rise in the last 30 days.\n\nThe approval of the Ethereum spot ETFs fueled this hike. But the asset was not trading live yet. However, many opinions suggested that ETH’s price could rally past $4,500 or hit $5,000 once the ETFs go live.\n\nIf selling does not stop by that time, this prediction could slip away from the heavyweight in the short term. To assess this, AMBCrypto looked at Ethereum’s Sharpe Ratio.\n\nThis ratio shows the risk-adjusted performance of an asset. If the reading of the Sharpe Ratio is negative, it means that the asset involved is producing bad returns for holders.\n\nBetween 1 and 1.99 is considered a good risk-to-reward ratio. Should the reading rise above 3, it means that the cryptocurrency is offering good returns relative to the risk of investment.\n\nAccording to Messari, the metric hit a ceiling of 3.62 on the 27th of May. But at press time, the ratio has declined to 2.98, indicating the returns were no longer excellent but at a moderate pace.\n\nThe bull phase might start from $4,713\n\nShould the reading continue to fall, so will ETH’s price. However, the long-term potential of the cryptocurrency remained extremely promising.\n\nAMBCrypto gathered this after examining the Pi Cycle Top indicator. This metric uses the 111-day Simple Moving Average (SMA) and 350-day SMA to check if prices have hit an overheated point.\n\nFor Ethereum, using Glassnode’s data, the 111 SMA (green) was below the 350 SMA (purple). This suggests that the price has the potential to trade higher.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nAssuming a crossover of the shorter SMA over the longer one appeared, it would have spelled doom for ETH.\n\nIn addition, the indicator revealed that ETH’s price could hit $4,713 once the selling pressure fizzles out. Should this forecast come to pass, then the value could attempt testing $5,000."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQdGhvOC1rYlZTS1lwVzUtaG9ocmp1Rlo2OG1YcjFSN0Z2OU0tcmJrSFBUVnJGalJPbTlRWDZiQmVaUWdEbHBhWVIwREZUY1pzd2hKU2dfUDhuU1RvWkFnWllEVkMwV1pHeGpPSHdZTFdtbE1GcEJjZEwtN29QX29fMXB1dFJLaFNDUmlyb25zVjVzaVlzU2Etc9IBngFBVV95cUxOS2ROZ1pra0ZjdGF2QXNsZlV6RTBYN0tNTGVTakpwWUNWNkhubmstUU92U0VHUWF4S2t0UGRpSlhXV0hDNEFLdk0tR0I2ZzdaQnVpUGlodF91MUVibE1rVTA4TlRDa3dDMmdSUlBHWjhGOGUwVzZYSWl3NGJOTXM2NWtDekwzZXgwM3FUXzdET1Myd0VsRHZEQ05faW5SZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Wall Street Sees Ethereum Hitting $14,000 in 2025 - OilPrice.com",
        "content": "A month and a half after we first observed that the world's largest bitcoin fund, Grayscale's GBTC, had lost more than half of its assets since the approval of spot bitcoin ETFs in January in what was the year's first, and far less memorable \"halving\" event...\n\n... and just over a week after Grayscale CEO Michael Sonnenschein unexpectedly resigned amid persistent, relentless outflows (courtesy of GBTC's 1.5% in fees), the flipping has officially taken place.\n\nWith today's ETF flows now in the books, the inevitable has finally happened, and after GBTC saw $105.2 million, or about 1530 bitcoin, withdrawn in its biggest one-day outflow in more than two weeks, while BlackRock's IBIT added $101.9 million, the latter has now surpassed the former, and Blackrock's IBIT has dethroned GBTC as the world's largest ETF with $19.795 billion in bitcoin, equivalent to roughly 288,670 bitcoin, vs $19.758 billion for GBTC.\n\nAnd so having taken over the crown as the world's largest bitcoin ETF, Larry Fink can focus on the one asset he is truly after in his pursuit of financial tokenization - ether - which just got spot ETF approval late last week, and which Blackrock will very soon dominate as the 2nd largest cryptocurrency sets off in its trek to hit $14,000 some time in 2025 with Larry Fink's blessing.\n\nBy Zerohedge.com\n\nMore Top Reads From Oilprice.com:"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOV0hKUTU3ZWdyN09mWkxYZXRKb05RdnY5NnJjX09mRjRSRzVZS2VSQ29vbXk5VkFsYVhnMjR4NGx1MTl1dk1lbl9KM3J5VGZiU1NQVjllV20zNUE3bXFzZ1NkYmtVY2VjT3FudnptSS1BdURybHNzVjdOQUZJSFVqb3JBOTdNNm5RaWo4NTRrQ0NjOVBWMFMyTi1zQ0g5VmJwSEJ0V2VQUDNUUWItX1plS0tCTXNhaXgxdTU4MmZzX1V2cjVYbVYweXRSUGZrbWZRMUhabDBybXk5dHVtSnBNWUJoenNGdFF4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Telegram-Associated Notcoin, Sam Altman-Founded Worldcoin Outshine Bitcoin, Ethereum On A Weak Day - Benzinga",
        "content": "Telegram-linked cryptocurrency Notcoin NOT/USD and Sam Altman-founded Wordlcoin WLD/USD raked in major gains on a day when market heavyweights slipped lower.\n\nWhat Happened: NOT accumulated double-digit gains to emerge as the best-performing cryptocurrency in the last 24 hours. The coin, which is backed by top executives from Telegram, has more than doubled in value over the week, according to CoinMarketCap.\n\nNOT logged a trading volume of $928 million in the last 24 hours, with its market cap surpassing $1 billion.\n\nThe rally outstripped the broader market's performance as Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD traded lower as of this writing.\n\nCryptocurrency Gains +/- Price (Recorded at 10:00 p.m. EDT) Notcoin NOT/USD +17.06% $0.01071 Worldcoin WLD/USD +4.75% $4.89\n\nAlongside, biometric-based cryptocurrency, Worldcoin, rose significantly in the last 24 hours, with trading volume more than doubling to $525 million.\n\nWhy It Matters: NOT's exponential growth comes as users hop on to mine the cryptocurrency through the play-to-earn Web3 game hosted on Telegram. The game's cryptocurrency offerings have grabbed the attention of Telegram's massive user base.\n\nMeanwhile, WLD's gains snapped a losing streak, as the project launched by OpenAI Chief Sam Altman, faces opposition over privacy concerns. Worldcoin was asked to shut down operations in Hong Kong recently.\n\nCapital flows to altcoins indicated a healthy market trend in a year where Bitcoin’s market dominance has increased.\n\nIn an X post Wednesday, popular cryptocurrency analyst Michaël van de Poppe noted that Bitcoin was in a consolidation phase, while altcoins are bracing for their breakout.\n\nWhere are we in the cycle?\n\n\n\nWe're at the stage where #Bitcoin consolidates and #Altcoins are waiting for their breakout to come.\n\n\n\nTo me, the trigger is going to be the listing of the Ethereum ETF.\n\n\n\nFrom there, it could be going quite fast in a positive sense. — Michaël van de Poppe (@CryptoMichNL) May 29, 2024\n\nPhoto by stockphoto-graf on Shutterstock\n\nRead Next: BlackRock’s Bitcoin ETF Dominates Market with Nearly $20B in Assets: Report"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNcm5SeFpvZDBIZ3Y2ZEF5dzlTQVZXWnlOS29DVkZvQXdJWjNaUHFiajNKTzhyRjVwOFF5VXVtTzFraXRzVG9KbDFDc3dyT005cHg3RFlnRXJXNXQ2VjVWRHhpN3dra2pYdlZhWGhVUU5Ha0tXSXZjZlo1Y3BnVEZOUDZwNG15N0kxRzhFZ9IBkgFBVV95cUxNbm5WZUVqTzBiN0J0ZWdrS2pQemZPdVRRQzQ3QW5aLWN2RnNQTVNsRnBlOVdtZkJBRXVTLS1jWDZXVFNvNjJqc29QM2RMMEZCRXFKZUNDTFh3c1h5d1hSRi1LbUdVY0liS2JUSVpyQ2lIYjRhaXl3dWlXcnhHV2stNG5VelNzNG1XSzlLQTI2ZDZaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF - CoinGape",
        "content": "BlackRock has submitted an updated S-1 filing for its iShares Ethereum Trust, signaling a robust move towards the launch of a spot Ethereum ETF. This follows the Securities Exchange Commission’s (SEC) initial approval of Form 19-b last week.\n\nBlackRock Leads with New Ethereum ETF Filing\n\nThe SEC recently approved spot ether ETFs from major financial entities, including VanEck, Fidelity, and others, with BlackRock‘s iShares Ethereum Trust at the forefront. The amended S-1 document, a crucial step after the initial nod, has garnered attention for its detailed disclosures and BlackRock’s commitment.\n\nadvertisement\n\nThis update is pivotal as it comes amid preparations for a possible launch at the end of June or early July. James Seyffart from Bloomberg views this as a clear indicator of the ongoing collaboration between issuers and the SEC, emphasizing the market’s readiness for these financial products.\n\nErick Balchunas, a senior ETF analyst, also remarked positively on the developments. He noted on social media that the updated filing is a “good sign” for the industry, suggesting a sequence of events leading to the likely introduction of these ETFs in the market soon.\n\nHashdex Retreats from Ethereum ETF Race\n\nBlackRock has not only demonstrated its leadership during the Bitcoin ETF era but is now setting significant benchmarks with Ethereum as well. The recent filing details include information about seed capital investments, which are crucial for the ETF’s initial phase.\n\nOn May 21, 2024, an affiliate of BlackRock, referred to as the Seed Capital Investor, acquired 400,000 shares at a price of $25.00 each. This substantial investment underscores BlackRock’s confidence and readiness to lead in developing Ethereum-based financial products.\n\nThe company has announced that these shares will be listed under the ticker symbol “ETHA,” enhancing the accessibility and transparency for investors interested in cryptocurrency investments. This move is expected to strengthen BlackRock’s position in the market, offering a new avenue for investors to engage with digital assets through a regulated framework.\n\nHashdex recently withdrew its proposal for an Ethereum ETF, a day after its competitors received approval. The reason behind Hashdex’s decision remains undisclosed, highlighting the unpredictable and competitive nature of the ETF landscape.\n\nAlso Read: Solana Congestion Issues Poked As CME Puts Out SOL ETF Hopes\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxONW45RG1qXzkwWFhLYV9iUHFieDUzSm1pTjZ2Ty05dlhoZjEyUzBvY1FjS2RiSlQ5Z1M1Y193X0pKNmFLaHRaMGhqeEdOVmNuam55aWY4TGxoTXdhTlR6aEthVXZROHZXdUd1OWlRUExPOUhGMU1iMXg4cHJOWFkwRnVjZl9GeTVDdFM3eHpuTFk5c2hNTmhDczllaHBwaF9BWThwVVVB0gGrAUFVX3lxTFA4ZFFwanhXREtlUl9CRUk4blVnNTNlcTlOWVRFcHV3STdjZE1pVmF0YW12V3l5YWhOb1FvdGFfWmRobkJadTVTY2lzYTVuSWo1WEJqalJJc1prdmZpc0l5RWZneWxrM1VWbS1EYmdwUjRjREt3dWRhT3F0emNfRzRsUmpwMkVmU29TVndkb2dQRnBmR1REalM3VjlyV2RlWUoyR0RSQ24tVnRGZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Singapore’s Largest Bank Revealed as Ethereum Whale Holding $650M in ETH: Nansen - CryptoPotato",
        "content": "Blockchain analysis firm Nansen has identified DBS Bank, one of Singapore’s largest banking institutions, as a cryptocurrency whale.\n\nAccording to Nansen, a crypto wallet reportedly owned by DBS Bank holds 173,753 Ether (ETH), valued at around $650 million at the current market price.\n\nDBS Sitting on a $200M Profit?\n\nNansen’s analysis states that the address, flagged on May 30, has already generated a paper profit of $200 million from its Ether holdings.\n\nWe’ve identified this $650m $ETH Whale holding 173.7k ETH as DBS, the largest bank in Singapore with assets totaling S$739 billion as of 31 Dec’23 This address has made over $200m by holding ETH… 🤯 Track the address on Nansen here: 0x9e927c02c9eadae63f5efb0dd818943c7262fb8e pic.twitter.com/2rkM3cZ6gJ — Nansen 🧭 (@nansen_ai) May 30, 2024\n\nWhile DBS Bank has not officially confirmed ownership of the ETH, a community member suggested that the assets might belong to its digital exchange, which caters to accredited investors. They speculated that the bank holds the ETH on investors’ behalf rather than it being direct bank assets.\n\nDBS Bank is no stranger to the cryptocurrency sector. It offers various services, including digital asset custody, a trading exchange for security tokens, and a portfolio management app that integrates traditional and crypto assets.\n\nIn 2020, DBS Bank launched a crypto trading and custody service and a platform for conducting security token offerings. At the time, the bank emphasized that it would not hold any assets on the exchange but would provide custody services for investors. “All digital assets are kept at DBS Bank, which is globally recognized for its custodial services,” the bank stated. The services supported major cryptocurrencies, including Bitcoin, Bitcoin Cash, Ethereum Classic, and Ether.\n\nDBS’s Digital Currency Initiatives\n\nSince then, DBS Bank’s crypto sector has witnessed significant growth. In 2022, it reported a four-fold increase in Bitcoin purchases on its digital exchange, doubling total trades between April and June 2022. In 2023, it reported an 80% increase in Bitcoin trading volume, attributing this growth to the market instability following the crypto collapses of 2022.\n\nDBS has broadened its digital currency efforts beyond cryptocurrencies, engaging in government-related Web3 projects in Singapore like Project Guardian. This initiative successfully acquired tokenized Singapore dollars using tokenized Japanese yen.\n\nAdditionally, DBS is involved in Project Orchid for government vouchers and conducted a cross-border e-Chinese yuan transaction test for shipments between Singapore and India.\n\nFurthermore, its Chinese subsidiary, DBS Bank China, introduced an e-CNY merchant solution for businesses to accept payments in the central bank digital currency (CBDC). The bank also provides trading exchanges for security tokens and a portfolio management app catering to traditional and DeFi assets."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQMkN2OGNYTXE4S3BMWXA5T1FiSEM3MWU4aUt2R3ZyVUhERG9xaXRKTDNpdTBTSEN6em5rN1FFM0RwME1oMlNkMV9GdzZfMmlqXzQ3R2QyMlk2dTlfT2Y1Yl9DZ1ZRaDNJVmV5M2RyNzRXeTdqNjd5MEZ1LVBfblJVeFZnWHlQeXNKZHYyUV9jblc3UXFxb0FMLVRtcVdjc05oWU5r0gGoAUFVX3lxTE5OWVlOa1h1OHBvUnRYeEZrTHpTU1ZpM3AtMGgwdjlZNHJwd1IxQzVlcEE4SDRGcTFqVXJoVFVJc0oxSnhFQ1dTc2RCYm9tc2tkR0RDXzNldm1hQWViSzVOM1lueHB5dXBXdGU2alJHS2V4MVpvRkVEU2t1V0lZVDJMWHJWa1BMeGxVd2tEeTRDLXRDOWRhc0V6WjVIU1V0TjVoMV9EQ0o0bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum News: Largest Singapore Bank Bags $200M Profit With Major ETH Investment - CoinGape",
        "content": "The largest bank in Singapore, DBS Bank, has been identified as a significant player in the Ethereum (ETH) market, according to on-chain analytics firm Nansen. The bank holds nearly $650 million worth of ETH reserve. Moreover, it has made a gigantic profit of $200 million during the recent ETH price dally.\n\nDBS Bank Emerges As Ethereum Whale\n\nNansen spotlighted the news in a post on X as they identified the Ethereum whale to be DBS Bank. They highlighted that a blockchain address linked to DBS, holds an impressive 173,753 Ether. Furthermore, the analytics firm underscored that the reserve is valued at approximately $647 million.\n\nadvertisement\n\nThis revelation underscores the bank’s deepening involvement in the crypto investment space. The substantial holdings not only signify the bank’s confidence in Ethereum but also reflect its strategic investment in digital assets. In addition, Nansen highlighted that the DBS-associated address has generated over $200 million in profits from its Ethereum holdings, marking a notable success in the bank’s crypto investment strategy.\n\nMoreover, Singapore’s DBS that boasts an AUM of $546 billion (S$739 billion) has been steadily expanding its footprint in the cryptocurrency sector. The bank offers a comprehensive range of services, including digital asset custody, a trading exchange for security tokens. Furthermore, it has rolled out a portfolio management app that caters to both traditional and crypto assets.\n\nThis diversified approach positions DBS as a forward-thinking institution embracing digital transformation in the financial industry. The recent news of significant accumulation of Ethereum by DBS aligns with broader trends observed in the market as ETH whale accumulation has soared.\n\nIn a post on X, crypto analyst Ali Martinez noted that there has been a “notable increase” in the number of Ether addresses holding over 10,000 ETH. Martinez pointed out that the number of mega whales, defined as entities with holdings exceeding 10,000 ETH, has surged to 10, signaling a major spike. Moreover, this shift from distribution to accumulation indicates growing institutional interest and confidence in Ethereum’s long-term potential.\n\nAlso Read: Ethereum Price Forecast: $5,000 Target Impeding as BlackRock Submits S-1 Statement\n\nSpot Ether ETF S-1 Approval\n\nThe latest Ethereum adoption news came on the heels of the expected Spot Ether ETF S-1 approval. Earlier, on Thursday, May 23, the U.S. Securities and Exchange Commission (SEC) offered a regulatory nod to the 19b-4 filings for eight Ethereum ETFs, including those by BlackRock and VanEck.\n\nFurthermore, BlackRock recently updated its S-1 filing for the iShares Ethereum Trust on Wednesday, May 29. This signals a strong commitment to launch a Spot Ethereum ETF. Moreover, this move is significant as it aligns with the anticipated launch time frame of late June or early July.\n\nBloomberg’s James Seyffart interprets this update as evidence of the ongoing cooperation between ETF issuers and the SEC. It implies that an S-1 approval for these ETFs could be granted soon. Additionally, Bloomberg’s Senior ETF analyst Eric Balchunas also commented positively on this development.\n\nBalchunas shared on social media that the updated filing bodes well for the industry. He also hinted at a sequence of steps that could lead to the imminent introduction of these ETFs into the market. Earlier, the analyst spotlighted Ethereum ETF S-1’s potential approval date of July 4.\n\nAlso Read: Vanguard Receives Backlash Over Ethereum ETF Ban But There’s A Catch\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOSEtwNEwzXzk0ZVpCVjdRbWZXaEcwZm5IUDA2aVE2VUMtaURvQlFoNDlla2FjdFVLcnB0VlVLM29wOHotSk1JTHdIMU45TDNWRXRtMGY0Y0FCV0VnVnZzN0p3S1lVRGhvSzl3aE1waGJpbGhZb2NFZl92SUM2UERNeGp5Z2VZMmUxdFMwNW5nS04wUUdKRmdRMVpBTTNDTklxQ0JLSTY4cUs0OTl6Nm13R0lFd2RRXy0tLXFNM3dB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) propone di espandersi e di lanciare il proprio layer-2 - The Cryptonomist",
        "content": "Yesterday, ENS Labs, the company responsible for managing the decentralized service Ethereum Name Service, presented a governance proposal where it invites the community to expand its dapp into a layer-2 network.\n\nWe still don’t know anything about the prototype of the network that ENS aspires to migrate to: all we know is that as a fundamental criterion the new chain must be EVM compatible, censorship-resistant, decentralized, and open source.\n\nAnche il money market Aave e la piattaforma di restaking Etherfi stanno pensando di tuffarsi nel panorama dei layer-2 lanciando una rete proprietaria.\n\nLet’s see all the details below.\n\nENS wants to launch its own layer-2 blockchain\n\nEthereum Name Service (ENS), protocol for the creation of domini on the Ethereum blockchain, is considering migrating to a layer-2 to address some technical limitations and improve the end-user experience.\n\nQuesto è quanto riportato da ENS Labs, organizzazione non-profit situata a Singapore che si occupa dello sviluppo della piattaforma ENS, che con una proposal di governance ha condiviso ieri l’idea con la community del progetto.\n\nWithout revealing too many details, the company emphasized the potential benefits that would be brought to the protocol, such as improved scalability with reduced gas fees and the introduction of new advanced features.\n\nIl nuovo layer-2 dovrà essere necessariamente compatibile con lo standard EVM, oltre che resistente alla censura, decentralizzato e open source.\n\nIntroducing ENSv2: The Next Generation of ENS 🎉🎉🎉\n\n\n\nENS Labs is excited to announce our proposal to extend the ENS protocol to a Layer 2 network. This move isn't just about migrating parts of the protocol; we're re-envisioning the architecture from the ground up! pic.twitter.com/3xM6owTpKk — ens.eth (@ensdomains) May 28, 2024\n\nIn the world of finance, the terms “bull” and “bear” are often used to describe market trends. A “bull” market is characterized by rising prices and investor optimism, while a “bear” market is marked by falling prices and investor pessimism. Understanding these concepts is crucial for anyone looking to navigate the financial markets effectively.\n\nSince 2017 ENS has established itself as the leading platform for on-chain domain registration, effectively becoming the bridge between traditional internet and the decentralized web.\n\nWith the passage of time, however, the ambitions of this protocol have also changed, which now in order to truly become mainstream aims to offer lower gas costs than Ethereum fees and faster transactions.\n\nThe Ethereum blockchain is indeed excessively expensive to use when there is too much congestion, skyrocketing the commission costs to execute a simple transaction or approve a smart contract.\n\nIf the proposal is accepted by the community, the domain registration phase will move to layer-2, which will become the new platform for user interactions in all respects.\n\nWith the update, a new hierarchical system is also proposed for more effective management of domini, where the holders of these resources will have access to a unique register, where they can check the subdomains and configure the resolvers.\n\nFurthermore, the transition to ENSv2 implies the improvement of l’interoperabilità multi-chain, with the functions of ENS that will also be brought within other cryptographic ecosystems.\n\nWe still do not know the timing of this fundamental transition in the history of Ethereum Name Service, but it is likely that the migration could take place in 2025, provided the proposal passes.\n\nRegarding the news Eskender Abebe, Product and Strategy Manager at ENS Labs, reiterated how the release of Ethereum Improvement Proposal (EIP) 4844 which introduced the function of BLOB in Ethereum rollups with Dencun, was a factor of enormous importance that motivated the team to evaluate the transition to layer-2, effectively making transactions on these second-level networks cheaper. These are his words:\n\n“The release of EIP4844 has made Ethereum-based layer 2 networks much more convenient and scalable, which has been a major driving factor for the ENS proposal.”\n\nAave and Etherfi also consider a proprietary layer2 network\n\nENS non sarebbe l’unico top protocollo della blockchain di Ethereum a pensare ad una migrazione presso un layer-2 più scalabile: dopo il recente successo del trend delle soluzioni di ridimensionamento zk-rollup e degli optimistic rollup, con il TVL di questa nicchia che ha superato i 47 miliardi di dollari, sempre più entità puntano a lanciare la propria chain con appoggio su Ethereum.\n\nOne of these is Aave, a very famous lending protocol that should soon complete the upgrade to Aave V4 with the platform aiming to introduce a unified multi-chain liquidity layer, becoming much more efficient in all respects.\n\nThe founder of the project, Stani Kulechov, in a recent post on X informed his community that after the V4 Aave could launch its own layer-2 network expanding its DeFi ecosystem towards new horizons.\n\nWe remind you that Aave represents the third largest dapp on Ethereum after EigenLayer and Lido, with a TVL of 13 billion dollars: if it landed on an L2, it would effectively become the largest secondary network on Ethereum, even beating the industry leader Arbitrum.\n\nIt would simultaneously also be the third largest chain in the entire Defi sector, behind Tron and obviously the parent company Ethereum.\n\nWe do not know the technical details of the new product but we know that the official launch is scheduled for 2025.\n\nThis is not a drill, Aave Network is planned to come after V4. https://t.co/a43nNlT114 — Stani^ (@StaniKulechov) May 27, 2024\n\n“`html\n\nAnche EtherFi, noto protocollo di restaking di ultima generazione con un TVL di 6 miliardi di dollari, ha in programma di costruire un layer-2 proprietario in futuro.\n\n“`\n\nAfter achieving enormous results in the market, such as the introduction of native restaking on L2s, the launch of its own token as an airdrop, and the release of a debit card to collateralize the balance in the protocol by borrowing USDC, now EtherFi aims for the next step.\n\nEven here, the details of this step are not known, except that it could likely happen in 2025, contributing to making user transactions much faster and cheaper.\n\nThe objective for the protocol is to improve the user experience and expand its connections with the DeFi landscape, aiming to attract as many resources and liquidity as possible."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOeTZPX0dMT3B1YkNSbE5yTHF3cXpVb3N1NEZLQno0WjJXXzh0VVRwY3hud1JtY05QVHFWMzczNmJSUDA3MG55V2t6ckVWc1BYMjlKVkhKbHRSSUszOVZ6djEyOFVGcGdLS3pBUUgzZWVWLXNqazZoS2F0YjFNY0tNNWxEV1NpWFJnQjBKNjFQRHPSAZYBQVVfeXFMUHNLcGlSaEtBdW91eHV4dzh4eHdBbzFLOUVfZHZ0MEJ3VFdvaU1BZHlDOG9mSGlrSVlaVE9xcVVpc2xxcXBCSGlUS21LRklDZVZWMGNWLVlnZkFNeF9pYTk0Qm1KdGhUNF91MGMyY1VyaFdPMGhZM1VyU1Njcm01azJROUJxTHRLc3BWNG9oZEpmRmJLMjlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 30: Bitcoin & Ethereum Prices Ride Rollercoaster While NOT Continues To Soar 18% - CoinGape",
        "content": "The crypto prices today have continued to raise eyebrows across the broader industry. Bitcoin (BTC) & Ethereum (ETH) have again shown a volatile price movement, while altcoins too majorly traded in the red. The global crypto market cap was down 1.40% to $2.54 trillion in the past 24 hours. Further, the total crypto market volume over the past day saw a 9.30% decrease to $82.63 billion. However, Notcoin (NOT) has continued to pump, defying broader market expectations.\n\nHere’s a brief report on the top cryptos and their price action for today, May 30.\n\nadvertisement\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe flagship crypto, BTC, showed a trading session primarily in the red today. BTC’s price rested at $68,037.54, a 0.98% decrease from yesterday. Its 24-hour lows and highs are $67,101.49 and $68,852.23, respectively.\n\nBesides, Bitcoin’s dominance at press time is 52.68%, an increase of 0.16% over the day.\n\nEthereum Price\n\nMeanwhile, Ethereum’s price continued to show a period of sideways trading in the broader time frame chart, dipping 1.51% in the past 24 hours to $3,786.83. It’s worth mentioning that the token’s 24-hour lows and highs are $3,742.04 and $3,880.65, respectively.\n\nDespite the recent spot ETH ETF approval by the U.S. SEC, the global crypto community awaits Ethereum’s much-anticipated rising price action.\n\nSolana Price\n\nIn the interim, amidst talks of a potential SOL ETF next in the pipeline surfacing in the crypto community, Solana witnessed a 1.53% dip in its price in the past 24 hours, reaching $169.54. Its 24-hour lows and highs are $167.32 and $173.64, respectively.\n\nXRP Price\n\nThe cryptocurrency brought by American blockchain payments giant Ripple Labs, XRP, continued to showcase a rollercoaster ride and traded at $0.526, slipping 0.46% over the past day. The token’s 24-hour lows and highs were $0.5201 and $0.5321.\n\nDOGE & SHIB Prices\n\nIn the meme coins sector, Dogecoin (DOGE) tumbled 2.49% over the past day to reach $0.00002788. Shiba Inu (SHIB), Dogecoin’s rival, fell 0.13% over the past day to $0.00002791.\n\nIt’s noteworthy that prominent meme-themed cryptos such as Bonk and PEPE also dipped remarkably, emerging in the top losers list.\n\nTop Crypto Gainers Today\n\nNotcoin (NOT) price soared 18.73% to $0.01107.\n\nBitget Token (BGB) price jumped 7.75% to $1.32.\n\nArweave (AR) price rose 6.09% to $40.72.\n\nORDI price saw a 3.99% increase to $43.22.\n\nAlso Read: RWAs Get A Date In Court Next Week Amid Push For ‘Efficient Markets’\n\nTop Crypto Losers Today\n\nBonk (BONK) price corrected 11.78% to $0.00003734.\n\nPepe coin (PEPE) tumbled 7.96% to $0.00001507.\n\nBook Of Meme (BOME) saw a 9.43% decrease to $0.01427.\n\nOndo (ONDO) fell 7.03% to $1.18.\n\nUpon looking at the hourly timeframe charts, it can be seen that BTC & ETH rebounded 0.33% and 0.30%, respectively. Meanwhile, despite the recent turbulent performance of the crypto sector, U.S. Sen Cynthia Lummis asserted that crypto assets remain poised to become an essential part of the nation’s economy should people not fail to capitalize on the emerging market.\n\nAlso Read: BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTV9tMmhBVEJoYTlRdXFfMHZqLUtuOUVOd1BoSUtrRU5KZjh3UldSd3pENm9IN3pvdzFaSWYwXzhWdE9qMGtyRlpYSEdOaWJITWw0c19UcHV2Mlg2REwyTUlidm9WZnFWNEh3VHhicmRMbW45bnFZZlB1QWltTnJqekxLQmNCNTdKR213Nmd0OEU3OS0xTFBvUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "WisdomTree lists physically backed Bitcoin and Ethereum ETPs on LSE - Funds Europe Magazine",
        "content": "WisdomTree has listed its WisdomTree Physical Bitcoin and WisdomTree Physical Ethereum ETPs on the London Stock Exchange ( LSE), making it one of the first issuers approved for listing crypto ETPs on the LSE.\n\nThese ETPs come with a management expense ratio of 0.35%, making them among the “one of the lowest fee levels for institutional-grade Bitcoin and Ethereum ETPs that are 100% backed by the underlying assets”. However, these ETPs are currently available exclusively to professional investors.\n\nBlackRock reports record fixed income inflows in 2023 global ETP market\n\nThe WisdomTree Physical Bitcoin ETP, launched in 2019, is designed to offer a straightforward, secure, and cost-effective way to gain exposure to bitcoin’s price. It ensures easy investor access, tradability, transparency, and institutional custody solutions within a robust structure. Similarly, the WisdomTree Physical Ethereum ETP provides secure and low-cost exposure to Ethereum, allowing investors to access ether and receive staking rewards through a transparent and risk-managed approach.\n\nWisdomTree launches megatrends ETF for thematic investing\n\nAlexis Marinof, head of Europe at WisdomTree, remarked: “As an FCA-regulated business, we have over 250 ETFs and ETPs listed on the LSE. Listing our Bitcoin and Ethereum ETPs is a natural evolution of our offerings and underscores our commitment to supporting UK investors. With rising interest in the asset class among European investors, particularly due to the new fee environment and the launch of US spot bitcoin ETFs, we foresee this development as a pivotal moment for Crypto ETPs in the UK.”\n\nMarinof highlighted that the asset manager’s expertise, combined with robust and scalable business managing over $100 billion in global assets, allows it to “offer highly competitive fees without compromising security or risk management.”\n\nWisdomTree’s European crypto ETPs are now available for sale in multiple countries, including Austria, Belgium, Denmark, Finland, France, Germany, Italy, Ireland, Luxembourg, Poland, Netherlands, Norway, Spain, Sweden, Switzerland and the UK."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQYVAtYVNfSmp6SzlWbnk3anV0YWl0WUozV3JhcEd5dmZrYjgxZGoyZnR6M19MOVZSTlJQX0V2ZTd5STJ4YmJkUjFRdFlwczBWZFB0SnJtb0I5ZGNNM3FrWDYtN0pNaWFFWDRMdkY1cW85MW1Jdm14clF6TVRtdEpjNGJKbHRkSk1W0gGOAUFVX3lxTFB4VTVsTktiVFJXOXRESk5PTHFfTllKX1FOSlNFUHNzTGFMUXByMV9xSngwYllfS2VzWUxEbUsxUFNxRzk0WHQ1blFXdUY2SFFwUDhFY1JfSjFIYmNhYUVPV3BNYW5uSnF2Y25tMUJ2LUNISjl4SEprSmNRZklwZVVBd0c1ZkZGY1hTbjdnREE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF speculations rise: A June debut on the horizon? - AMBCrypto News",
        "content": "BlackRock leads Ethereum ETF approval by updating Form S-1, marking significant progress.\n\nHashdex and Vanguard have either withdrawn their applications or decided against launching spot Ether ETFs.\n\nJune could see the final approval of Ethereum [ETH] exchange-traded funds (ETFs) as BlackRock becomes the first to update a key filing necessary for launch.\n\nThe United States Securities and Exchange Commission (SEC) issued a directive for various institutions interested in launching their Ethereum ETFs, to update their 19b-4 and S-1 filings.\n\nPreviously, the SEC approved the rule 19b-4 forms for eight Ether ETF applications, including those from BlackRock (BLK), Fidelity (FNF), Grayscale, ARK Invest, VanEck, Invesco Galaxy, and Franklin Templeton.\n\nBlackRock’s bold move\n\nOn the 29th of May, BlackRock finally updated its Form S-1 for its iShares Ethereum Trust (ETHA) with the SEC, nearly a week after the regulator approved its 19b-4 filing.\n\nCommenting on the same, Eric Balchunas, Senior ETF analyst at Bloomberg, noted in his recent post on X,\n\nAdding to the fray was James Seyffart, research analyst at Bloomberg, who said,\n\n“This is almost certainly the engagement we were looking for on the S-1’s following the 19b-4 approvals. Issuers and SEC are working towards spot Ethereum ETF launches.”\n\nHowever, not everyone took a step forward in the ETH ETF approval process. Hashdex, another issuer seeking approval for a spot Ether ETF, withdrew its application shortly after the SEC’s approval.\n\nA similar pattern was observed with Vanguard, as highlighted by Nate Geraci, President of The ETF Store in his latest tweet. He said,\n\n“No surprise, but Vanguard will NOT be offering spot eth ETFs on its brokerage platform…”\n\nWhat’s the price situation?\n\nAmid hopes of Ether spot ETF approval, ETH was trading at $3,769, reflecting a 2.45% decline at the time of writing.\n\nThis was further confirmed by AMBCrypto’s analysis of Santiment data on investor sentiment. The results indicated that negative sentiment was rising while positive sentiment was decreasing.\n\nOptimistic outlook persists\n\nDespite prevailing negative sentiments around Ethereum, Jaret Seiberg from TD Cowen’s Washington Research Group recently noted,\n\n“This (ETH ETF approval) comes about six months faster than we expected…yet this decision was also inevitable once the SEC approved crypto futures ETFs.”\n\nHe added,\n\n“The next step could be an ETF with a ‘basket of crypto tokens’.”\n\nTherefore, as we await the full and final approval of the ETH ETF, it will be interesting to watch the shifts in sentiment within the SEC, especially regarding SEC Chair Gary Gensler, who’s known for his anti-crypto stance."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPWTNLTDVLbmF1eG1xb3dVSTZST3VIdUN5a2xZV29LM2c4THRfT3BLU3lzZ0lNb3RBc2luNmMwRllIVWUzVFdNcnVWZ2ZLejZmRW4yRlRLNVlWb3VlZjVoS0pVNUl3TmF6djZqUlpRWm5ab2N6U2kxOE9QN3Z5alJWM2d6RjNtZTllSnVnZk45ZU40aVZNeVF4aVlwX3d5S1J0QklrU0xSQy1rUm5CMDBoMklKU2NSY1pDSHk1LVo5bjB1NVJqSElUWHNuRUI2aWs5b0hHUnI5MUpyYXA20gHiAUFVX3lxTE5VNWtUUFB6UWZMQlFjLTN2czFDa2RZMm9vLTJvT2hMSjJuc0dOQnVFbVREcUZ1QUJyaFBwNDlaQk9kd2pWeHlJYkM5dGtsaUNrYXJBZmxqTXZVeUFwYng2WjRhZkIyU2lQcmp6NFVmNzl1RGhQclVyeFlpUTlVMnZkZVIyejRtM3JybkxSeERrRmdCVjd5Z29Odk9jWHVxTVdWVW45ejBqb0VySnZhRF9ZWDljWVBuVVRrV0dkOW1acmo5b0o2RlUyZ1RWX2RVSHcwWloxUzBYMUZObE1yVllGd0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval boosts Bitcoin, says Michael Saylor; Raboo Presale soars - The Economic Times",
        "content": "The legitimisation of Bitcoin Exchange Traded Funds (ETFs) has had a positive effect on cryptocurrencies. So, it’s not surprising that an Ethereum ETF approval is towing the same line. It ushered in an influx of new investors, which boosted crypto token prices.Raboo ($RABT), a new kid on the block, is one of the biggest beneficiaries of this boost. Now, in presale, Raboo has raised an astonishing $1.5 million, which has been up 40% since its launch. Industry watchers expect $RABT to make a 100x gain before the end of the presale. That’s why investors are rushing it.Crypto enthusiasts always believed that ETFs would boost crypto adoption. They allow traditional investors to get exposure to the tokens without directly owning them.The SEC took almost a decade to okay the first Bitcoin ETF application. But once approved, it boosted crypto prices. Ethereum ETF applications didn’t take as long, and as expected, they’ve had a positive impact on the market.Crypto prices have soared significantly in response to this development. ETH itself appreciated by 12% and drew near $4,000, which is remarkable. The Ethereum ETF approval is expected to spur the market on, with ETH set to appreciate further.To Michael Saylor, Ethereum ETFs are good news for Bitcoin. According to him, they ‘serve as another line of defense for Bitcoin,’ and would make the blue-chip asset more stable price-wise.Michael Saylor also thinks the development would accelerate institutional adoption of Bitcoin. Going by history, this would further boost crypto prices. Bitcoin has been trading around $70,000 in the last seven days. . It’s a considerable increase when compared with its price action last year. The general feeling is that BTC will appreciate further and hit new all-time highs before the year runs out.Raboo is an enterprising new project primed to make substantial price gains, thanks to the Ethereum ETF approval. It infuses artificial intelligence with meme culture, birthing a dynamic space filled with engaged users. In essence, it provides a platform where crypto meme lovers connect, earn, and prosper.The ecosystem boasts NFTs, AI-generated memes, exclusive merchandise, and other mouth-watering rewards. Even more, the smart contract has been examined by leading crypto audit firm Solidproof. This guarantees security, eradicates worries, and puts investors' minds at ease.These unique offerings put Raboo ahead of the pack. Since it’s still in presale, there’s a decent chance it will appreciate significantly when it launches on exchanges. That’s why experts say it's poised to hit a 100x profit once the presale ends.As Michael Saylor fancies a BTC boom following recent Ethereum ETF approval, Raboo is primed for huge price gains. That’s because it offers several benefits for investors and has significant moon potential. It’s still in presale, and for $0.0042, you can partake in this movement and benefit from the impending 100x price gain.The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQR01NSVVHS0V3eUttSTBUWUM0cHRha0hHLUVBclRZc2huMzc1Y2NaN1FYR3BmS3kzVGhUdVpiSDUtUTV2eW02by1vSUJjQWg2ODZHNVYxRlBpdFJNMHVMU0picU92XzdfazRaUHdGVjdieV9Ndlp2ZWRCUk9QRjJmeUJsZHQzSEhqUWVwel93VTdoc0Q4Vkp30gGcAUFVX3lxTE5MOVlyODJFZ09sbnpQanVJQmM4XzlvX2VsdlhKbHRjSW0xNjFXaUR4aDNQU3VUZGdzeU8xQzhRaUxkZnRtd0x4bHZSMENJVXBKa29wQ2dlM0g5dndqYnhqc2wya3VRdEVuZ3BsbGdVdGdoQW5USHZHeEotMUZpVUFnNmZwTkR3ZmNSRWhXQVRVM0VGV2R0TU1kTmk1WA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Shibarium TVL Soars 17% Amid Expedited BONE Token Transfers To Ethereum - CoinGape",
        "content": "Bone ShibaSwap token trading volume is up 15% after recent Shibarium bridge enhancements that have reduced BONE transfer time significantly.\n\nBONE Transfers To Happen In 45 Minutes On Shibarium Bridge\n\nThe Bone ShibaSwap token holders will be able to move their BONE holdings in a record 45 minutes. It marks a significant upscale, reflecting Shibarium’s resolve to embrace technological advancement. It also reflects a broader commitment to delivering streamlined operations and more efficiency.\n\nadvertisement\n\nAccording to the Shiba Inu development team on TheShibDaily post, users had to endure a seven-day wait before their BONE tokens could move from Shibarium to Ethereum. During the week-long wait, the BONE tokens would be subjected to a lock-in period meant to elongate the length of time users would interact with the Layer 2 (L2) solution, Shibarium.\n\nThis interactive period was seen as a possible driver for the Bone ShibaSwap price. The improvement is also bullish for the Bone ShibaSwap price, marking a strategic transition from an era leveraging interaction time to influence price. Instead, the network is prioritizing user experience, network efficiency, and ecosystem stability as possible market value drivers for BONE.\n\nShibarium and the Shiba ecosystem technology and marketing specialist, Lucie Sasnikova revealed the improvement in a post on X (formerly Twitter).\n\nShibarium Bridge Enhancements Decrease BONE Transfer Time from 7 Days to 45 Minutes – The Shib Daily https://t.co/2yH964q8uI — 𝐋𝐔𝐂𝐈𝐄 | SHIB.IO (@LucieSHIB) May 29, 2024\n\nHenceforth, ecosystem participants would enjoy more seamless processes for the convenience of community members and network inhabitants.\n\nThe dominance of the Shibarium L2 is also primed to benefit from this upscale among Decentralized Finance (DeFi) protocols.\n\nData according to DefiLlama shows that the Total Value Locked (TVL) of Shibarium has soared by 17% in five days, from $2.11 million on May 24 to $2.47 million at press time.\n\nBONE Token Transfers Under New System Of Operation\n\nThe development team highlights that based on the new system, there will be a checkpoint for all BONE token exits from the Shibarium ecosystem. Under the new system:\n\nBONE holders will be able to manage their assets faster\n\nProject builders can develop complex and urgent applications on the L2 chain.\n\nNotably, this enhancement will only apply for current transfers, meaning those that had been initiated before the upgrade would be subject to the seven-day wait.\n\nBONE price is up almost 2% in the past 24 hours to trade for $0.6865 as of 21:05 GMT, on trading volume that surged 15%.\n\nAlso Read: Terra Luna Classic Takes Down LUNC Burn Once And For All\n\nLockridge Okoth Lockridge transitioned from a career in Molecular and Cell Biology to pursue his interest in the chaos of the crypto and financial markets. He is a cryptocurrency journalist and market analyst with over 3,000 articles to his name. Conducting on-chain analysis, breaking down market-triggering events, and publishing Op-Ed pieces, he finds gratification in diving deep into the crypto space, earning himself significant knowledge and experience. Aside from ATZCrypto, Blockster and InsideBitcoins, Lockridge’s works can also be found on FXStreet.com. Outside work, you can find Lockridge watching movies or horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQcE5Fa09pLWZ0RUJiZW55eER4YVJFTVpGV0E1OFU5dFIwdEoxVzJBNjg0R2VEc1N0SWFCZDBLdk9CS2JrQ3cyZnJtWS05azhTR3hGUU9KeWY0anJsX3V5VVc1aXgxNkljQW1xdjJvSk0zNTc3WGJhTkp2ZmhBdzhwRjR0UzBpNklNcUVxaUluSFBOS1FEN1ZIX1Q3WmJpWGRFbFd5SHE0ZUp0Nms4UXRNT3Z6RGdtQ0UtZm0zQ3E2QUsyTXRTQWd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Traders Rush to Invest in Ethereum (ETH), DTX Exchange (DTX), and Gala (GALA) as Inflows Hit Market - Techpoint Africa",
        "content": "Investors are getting excited about the crypto market again as it nears the highs again, especially with Ethereum (ETH), DTX Exchange (DTX), and Gala (GALA) drawing a lot of attention. As these coins grow, traders are eager to take advantage of their rising values. This wave of investment shows that people are gaining more confidence in these cryptocurrencies and believe they could bring in big returns, making them popular topics among traders.\n\nETH is trading near its high again and could be ready for the next leg. However, the Gala (GALA) is significantly down from the high; any fundamental changes can change the direction of the price. DTX Exchange is the leading emerging coin revolutionizing the trading and investing landscape.\n\nEthereum (ETH) Sees Inflow as ETF Approved\n\nThe recent approval of an Ethereum ETF (Exchange-Traded Fund) marks a significant milestone in the cryptocurrency market. The approval allows investors to gain exposure to Ethereum without buying the cryptocurrency directly. It is a crucial step towards integrating cryptocurrency into the broader financial system, offering more opportunities for individual and institutional investors to participate in the crypto market.\n\nAfter the approval, ETH surged more than 19% in a day and is now trading at $3,810. Currently, the RSI stands at 66, which is in the upper band, and MACD is also above the middle line, indicating strength.\n\nGala (GALA) Taking Support Near The $0.04 Zone\n\nGala is a crypto created for the Gala Games platform, focusing on blockchain-based gaming. It allows players to truly own their in-game items, giving them the freedom to buy, sell, and trade these assets. Gala's goal is to decentralize the gaming world by putting players in control of their gaming experience and digital belongings. As the platform expands, Gala is gaining popularity among gamers and investors, who are excited about the growing trend of play-to-earn games.\n\nIn the mini bull run that started in early February, Gala moved more than 300%. It showed a significant upmove that benefitted investors. However, in the recent correction, it is down more than 50%, now trading near the $0.045 zone. The immediate support is the $0.04 zone; the price has taken support from this level many times. The next strong support is $0.035 and the upside resistance is $0.05.\n\nDTX Exchange: A Potential Competitor To Traditional Exchanges\n\nDTX Exchange (DTX) is becoming a strong competitor to traditional exchanges and is gaining popularity for trading and investing. People are drawn to DTX because it offers lots of features and benefits. It has over 120,000 financial options, including cryptocurrencies, foreign exchange, stocks, and CFDs. This means traders can find everything they need in one place.\n\nOne big draw of DTX is its decentralized nature. This means users have full control over their money, unlike centralized exchanges, where there's a risk of someone else having control. DTX also attracts traders with its zero-commission policy, which means no extra fees for any trades.\n\nDTX is also known for being accessible and inclusive. It has low fees and welcomes traders of all levels of experience. This makes it appealing, especially for newcomers to the world of cryptocurrency.\n\nRight now, the presale of these tokens is in the second stage, and they're selling for $0.04 each. They've already gathered over $500,000 from investors in just a short time. So, if you're considering investing, now might be the perfect moment because, in the next stage, the price is expected to hit $0.06.\n\nLearn more:\n\nVisit DTX Presale\n\nRead Whitepaper\n\nJoin The DTX Community"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNzdpVGdOUDNQd2FRUVVhSXdPaFRpT3UxQ2ZaS2tPWFFtZHU1cVpzMnh4OTVGVDdGWGM3aHNUQlZKOXFBeTFIc080ZXltTG5QQS1iSUdHMUxrMktpMDZ2VzcxQ1JNZUFVWlVqX0NrMWFYUS1aZVptV05wZG52dVRtc1RRSHJneEd2a3M2WnBYYVF1ckpVUzgwN0Vn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction Post-SEC ETF Approval – Will 5thscape Step Up? - Coinfomania",
        "content": "Sandbox (SAND) has grabbed much attention by charging the existing financial sector’s development through its growth in the crypto gaming category. Analysts are predicting an economic upturn in July 2024 due to the anticipated adoption of the 5thScape project. These markets are also expected to bring the use of Sandbox to a new level in virtual environments, which will excite investors. They should also learn more about the charts before investing and follow every trade cautiously. Now, with 5thScape out front, Sandbox is set to transform the future of the play-to-earn category in crypto games.\n\n5thScape’s Ethereum-based virtual reality (VR) ecosystem is bringing a change into the world of blockchain gaming. Its immersive content and native broad-utility cryptocurrency token “5SCAPE” has crypto investors and entertainment-seekers excited about the future possibilities of the platform. As 5thScape is about to reach its $7 million presale raise in its 6th of 12 presale stage, it is receiving substantial global attention. 5thScape’s brand value is set to outshine the Sandbox platform.\n\nA Look Into 5thScape’s VR Ecosystem\n\nThe 5thScape platform has different types of VR-compatible content including VR games, VR movies, learning videos, VR animations, and more. It lets platform users explore their choice of entertainment options in a new and immersive way. The ERC-20 token “5SCAPE” gives 5thScape’s users unlimited access to its content hub.\n\n>>Click Here To Visit 5thScape Presale Page\n\n5thScape’s team is working on turning it into a “mixed reality” platform by adding augmented reality features.\n\nFurthermore, they plan to enter new categories in their VR content options as well, like medical training, enterprise training, and a marketplace for VR content developers where they can offer their creations. The developers will be able to earn the platform’s “5SCAPE” tokens for their content, which can be exchanged for real money. 5thScape’s team has divided the project’s launch into 4 phases. Each quarter of 2024 has something new for the platform users and investors of “5SCAPE tokens”.\n\nSince we are now in the 3rd quarter of the year, we can expect the project to surprise us with many new announcements. 5thScape recently made an announcement on their X handle (@5th_scape) about a new feature – a leaderboard for investors of the 5SCAPE token. Its spin-the-wheel feature to get an extra discount on the token’s purchase is a piece of thrilling news for new investors.\n\nVR Blockchain-Gaming: A Revolution by 5thScape\n\nThe platform’s latest gaming launch – the “Cage of Conquest” MMA fighter VR game has helped it get attention in the online gaming community. Its other gaming titles, “Thrust Hunter,” “Epic Cricket Arena,” “Archery Master,” and “Immersive Kickoff”, are currently in the pipeline and will be slowly rolled out. Gamers can use the “5SCAPE” token as a digital currency within the VR games available on the platform to get in-game content and exclusive upgrades. These upgrades and contents can make their gaming experience better.\n\nThis is one of the reasons why regular gamers who are not active cryptocurrency investors have chosen to become one so that they can enjoy the VR gaming experience of 5thScape. Investing $500 or more in 5thScape’s presale stage can give you lifetime free access to its gaming zone. There are more bonus rewards on investments made in multiples of $500.\n\nFuture of 5SCAPE & VR Technology’s Growth Momentum\n\nExpert crypto investors consider 5thScape’s presale as the perfect opportunity to make an investment in the future of immersive entertainment. VR technology’s user adoption is growing fast. While currently, only 1 in 5 Americans have access to VR accessories, the ratio will soon increase as VR headsets become easier to purchase. The 5thScape project itself has launched two important physical VR accessories: the “Ultra HD VR headset” featuring high-resolution visuals and perfect movement tracking and the “SwiftScape VR Gaming Chair” for maximum comfort.\n\nA reputed organization – Grand View Research predicted the CAGR of VR technology to jump to 27.5% in 2030 from 2023. There is no doubt that 5thScape will use its first-mover advantage and its large VR library to grab a large share of this modern technology’s new user base.\n\nBoth Sandbox (SAND) and 5thScape (5SCAPE) projects will give high returns to their current investors in the coming times as VR technology’s usage becomes more common. Those looking for a way to build wealth through the growth of the VR industry should add these two projects to their cryptocurrency watchlist.\n\n5thScape will be a more prominent leader in this space as the Sandbox platform’s virtual universe has become a bit boring for gamers. The VR ecosystem of 5thScape is going to attract a larger audience base due to its variety of content options and secure Ethereum-based blockchain network that promises privacy and transparency with transactions. Get ready for lucrative returns with 5SCAPE once the project gets listed on the famous crypto exchange. The crypto gaming sphere will not be the same once the 5thScape project’s gaming titles are popularized within online gaming communities."
    }
]