[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQNF9lbXViZkk1RG16Z01Jb0pDOGxIMUNyRGxnNXZZc3JVdFp2cDd2UVAxV3NjUE5Qbks0QnVucTlBOUZWZDZwUzNXRDYyN0dmVVpmekM5Y0UwMU5Kd05nX0U1X0ZoN2tiWE43MDh2SS1UX0M5azNFRDlMNHlVU3VPVnVzT0h0MmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "US Spot Ethereum ETFs Could Launch on July 4: Report - Unchained",
        "content": "A lawyer for one of the prospective issuers said that the approval process for a spot Ethereum ETF was “down to the finishing touches.”\n\nThe U.S. Securities and Exchange Commission (SEC) is reportedly in the final stages of reviewing offering documents from prospective Ethereum ETF issuers.\n\nAn early July launch date for spot Ethereum exchange-traded funds (ETFs) looks increasingly likely, according to statements made by industry executives to Reuters on Wednesday.\n\nThe U.S. Securities and Exchange Commission (SEC) is reportedly in the final stages of reviewing offering documents by prospective issuers. Two executives from these firms said that only “minor” issues in these filings were still being ironed out.\n\nIn light of these talks between the securities regulator and asset managers reaching the closing stages, people with knowledge of the matter told Reuters that they expect a spot Ethereum ETF to be launched as early as July 4.\n\nA lawyer for one of the issuers also said that it was “down to the finishing touches,” relaying optimism that the fund’s launch was no less than a week or two away.\n\nBlackRock, Fidelity, VanEck and Franklin Templeton are among the eight issuers hoping to launch a spot Ethereum ETF next month, and have been laying the groundwork for their approval over the last few months.\n\nEarlier this week, VanEck filed a form 8-A with the SEC, which is one of the standard filings that must be submitted before securities can be offered on an exchange. On the same day, SEC chair Gary Gensler noted that the process of reviewing issuer documents was “going smoothly.”\n\nIndustry watchers had largely mixed views on how a spot Ethereum ETF would affect the wider narrative around ether as an asset class. Some argued that the news was already priced in to the market, while others claimed that the event would trigger positive price momentum for the second largest digital asset.\n\nEthereum has recently turned inflationary after the fee-reducing Dencun upgrade took effect, leading to a lower amount of fees burned and a higher number of tokens in circulation. One area that market participants will likely be watching closely is the impact spot Ethereum ETFs will have on ether’s supply and demand dynamics."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbVFlUmdrTUhYdkVmWXhkdlRUX0RQOWRuZWY4SGFEQ2JvMmZ6dkNMaWJKemNxcFczQlpOOWlzSmJheW9fTW5vWlJ3MlBiNnBCUTlQRVVKMFBKVmpQbHZ3NjQwa0ZPQ1E3N2ticDVZRHQ3WnA5eXBLaVA5aHAteDVhYXk0VGFjUWtU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Could Skyrocket to $22,000 by 2030 - The Motley Fool",
        "content": "Ethereum continues to be a tech disruptor. But will it really be worth over $2 trillion by 2030?\n\nThrough the first six months of the year, Ethereum (ETH -5.65%) is up 50%. That's right in line with the performance of Bitcoin (BTC -3.04%), which is also up 50%. At its current price of $3,500, Ethereum is within striking distance of its all-time high of $4,891.\n\nBut the best may be yet to come. Investment firm VanEck recently predicted that Ethereum could hit a price of $22,000 by 2030. That might sound overly aggressive, but VanEck has some solid data to back up its prediction. So will it be right or not?\n\nEthereum's disruptive ability\n\nFor the better part of the past decade, we've seen Ethereum disrupt the tech sector. Ethereum was the first smart contract blockchain platform. It pioneered entire sectors of the crypto world -- such as non-fungible tokens (NFTs) and decentralized finance (DeFi) -- that had never existed before. VanEck is counting on Ethereum's ability to remain a tech disruptor over the next five years to warrant such a hefty valuation.\n\nMost importantly, VanEck sees Ethereum making further inroads into the finance, banking, and payments sectors. And VanEck also sees Ethereum building value in sectors ranging from blockchain gaming to artificial intelligence (AI). The key to disruption will be Ethereum's ability to provide solutions that are cheaper, faster, and better than those currently available from market leaders.\n\nThe $15 trillion opportunity\n\nThat's where things get interesting, because VanEck digs into the numbers to estimate the total potential market opportunity (which it refers to as total addressable market, or TAM). That number could be as high as $15 trillion. The lion's share of this value ($10.9 trillion) will come from finance, banking, and payments. And there is a growing market opportunity ($1.4 trillion) that could result from artificial intelligence.\n\nThe logic here is simple but powerful: Ethereum will continue to roll out disruptive solutions that make it possible to win market share from entrenched incumbents. And the big push will be in DeFi, where a rich, vibrant ecosystem already exists. Just think of how upstart decentralized cryptocurrency exchanges are winning market share from centralized cryptocurrency exchanges such as Coinbase Global (COIN -7.39%).\n\nWhen you consider key future trends such as asset tokenization (which involves moving real-world financial assets onto the blockchain), it's possible to understand just how big the DeFi opportunity might be. Cathie Wood of Ark Invest, for example, has suggested that smart contract networks such as Ethereum could be generating fees of $450 billion by 2030.\n\nThe new ETFs\n\nAnd, finally, there's the matter of the new spot Ethereum ETFs. These recently won approval from regulators and are expected to start trading soon. Once they do, they could lead to a huge influx of new money into Ethereum. VanEck now predicts that the impact of these new ETFs could be greater than that of the spot Bitcoin ETFs.\n\nThat's highly debatable, though. As one of the firms that will be launching a spot Ethereum ETF, VanEck may be overestimating the potential impact of these ETFs. In comparison, JPMorgan Chase (JPM -1.81%) predicts these new ETFs might only attract $3 billion in new investor money. That's about one-tenth of what the new spot Bitcoin ETFs have attracted.\n\nA $2 trillion asset?\n\nVanEck provides three different scenarios for the future value of Ethereum. In the base case scenario, VanEck predicts a price of $22,000. In the bull case scenario, VanEck predicts a price of $154,000. And, in a bear case scenario, VanEck predicts that the price of Ethereum could collapse to just $360. Yikes!\n\nThat's a wide range of outcomes to work with, and that's what makes investing in Ethereum potentially so risky. Yes, Ethereum could soar to a price of $22,000, giving it a massive $2 trillion market cap. But it could also lose nearly 90% of its value and be banished to the dustbin of history.\n\nKeep in mind that Ethereum is not the only blockchain going after that $15 trillion market opportunity. There are plenty of other blockchain competitors, each one promising solutions that are cheaper, faster, and better. So if you're thinking about investing in Ethereum, make sure you do your due diligence and have a good grasp of the assumptions being used to predict a price of $22,000."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE82bzlPb3REbzhWQWhPUkU2ak1vN0UtaC01NjBTUkpYU2dQenczMVViOEVXLVZzRUdqNERueU9RaXY5YTkxNTRzamdkTXQ5eUF0a3c1QTRzYk85aDVBdjVaM1F5ZEdfcVFFOVlQVGlvbUlrWGE40gF6QVVfeXFMT1U3RTVrb3VVbUlzS3d6bGgtQjdPTlpqS2c5YUZpNlVQWHo2WVV4a2hYeUhJb0h5Q1JXSGFRdDk5elFmcXlSZkExcXJsQ2ItV3hlNGtTYjh0QmhNdC1HQ2ZJOTg1MFFyWmFtbUE2SVpIbk9GaHRtWUlRZXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Solana to $1,000? Ethereum's History Makes It Possible - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nZhu Su , a founder of the infamous Three Arrows Capital hedge fund, recently highlighted the performance of the Grayscale Solana Trust, suggesting it could imply the future value of Solana to $1,000 per SOL.\n\nAdvertisement\n\nThis projection is based on a comparison with the historical performance of Ethereum and the Grayscale Ethereum Trust (ETHE), used as a benchmark.\n\nWhy is no one talking about how Grayscale Solana trust is implying $1k per sol already\n\n\n\nThe numbers are very similar to when eth was $200 but ethe implied $1k, in 2020 Advertisement June 28, 2024\n\nGrayscale's trusts work by allowing investors to gain exposure to digital currencies through a traditional investment vehicle without the challenges of buying, storing and safekeeping digital assets directly.\n\nEach share of the trust represents a fraction of the cryptocurrency held by the trust, and the value of the shares can trade at a premium or discount to the underlying asset's market value.\n\n\"Every four years...\"\n\nThus, four years ago, when Ethereum was trading at around $200, the Grayscale Ethereum Trust implied a value of $1,000 per ETH. This significant premium indicated strong investor confidence and future price expectations.\n\nEthereum's price eventually caught up with these projections, experiencing substantial growth in subsequent years. This pattern suggests a potential roadmap for Solana.\n\nThe comparison of Solana to Ethereum's early days, when it was also emerging as a significant platform, is noteworthy. If SOL follows a similar trajectory, the implied value suggested by the Grayscale Solana Trust could be realized.\n\nWhile past performance is not a guarantee of future results, the historical context offers a compelling narrative of Solana's growth prospects, making the $1,000 target a topic of interest in the community."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPU25WZUVyVXE0YVNSdUFSaHhXR01QRUhENnI3VU02Ykk3aF9VRk9ocWF0Rk95R3hveEYzMVZ6MmlhSXBSX0pfYjFzV0tpNWY5U3hxMlplNE5JdjMyM0t3Y25QMGM3WGhQS3o1Mjg0amNfWHQzQUZLT29NZnJWUGdtRzJOdkhNQ3F1cVpUZWVjSVVrcFU4WEN1eVBYVzcyUnRSNFotYjJXdk3SAa4BQVVfeXFMUENpTmp3VzVCN1YyTDM2SlI3OWExTG5BdEl0ODVkd3NaVmlucnlyM2JoS0p3b3NBeXNYSk5fVjZNa2NISk1JMjhrSjlCdXFVSjZMbzhGbFhyQkZoa1ZicWhkUkpjOTR3TzF5VndkWS1FZy0tUnpZS2pET05YTUZ4Zmd4bWZTS3doZEZrY2dLelNSemthZ3FJYjBwOGk3ZU00WTlhanJ1bEdEZ3MxdUV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Crypto company Consensys sued by SEC as regulator continues industrywide crackdown - CNBC",
        "content": "Crypto firm Consensys has been added to the SEC's list of targets, as the regulator continues its industrywide crackdown.\n\nThe Securities and Exchange Commission on Friday sued Consensys in federal court in Brooklyn, New York, over allegations that the company \"engaged in the offer and sale of securities\" and \"acted as an unregistered broker\" through its digital asset wallet called MetaMask.\n\n\"Consensys violated the federal securities laws by failing to register as a broker and failing to register the offer and sale of certain securities,\" the court filing alleges.\n\nIn April, Consensys, which provides blockchain software, tried to preempt the SEC's action with its own lawsuit in Texas, alleging overreach on the part of the regulator. The 10-year-old company said its suit followed three subpoenas issued last year, plus a Wells notice from the SEC that claimed Consensys was violating federal securities laws.\n\nSo far this year, the SEC has sent Wells notices, filed lawsuits, or reached settlements with a host of crypto firms focused on ethereum and decentralized finance, including ShapeShift, TradeStation and Uniswap. The agency is also reportedly investigating the Ethereum Foundation.\n\nLess than two weeks ago, Consensys declared victory in its fight with the SEC.\n\n\"The Enforcement Division of the SEC responded by notifying us that it is closing its investigation into Ethereum 2.0 and will not pursue an enforcement action against Consensys,\" the company wrote in a statement June 18.\n\nA Consensys spokesperson said in an emailed statement Friday that the action is part of an \"anti-crypto agenda\" at the SEC.\n\n\"This is just the latest example of its regulatory overreach — a transparent attempt to redefine well-established legal standards and expand the SEC's jurisdiction via lawsuit,\" the company said. \"We are confident in our position that the SEC has not been granted authority to regulate software interfaces like MetaMask.\"\n\nThe spokesperson added, \"We will continue to press our case in Texas as well as defend this new case in New York.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOWk04YVU4eU5GVU5kaUJpOEhaaURxRFhJRHhJN2FHeHNwMlVCOHpxaW1taDlVVzZUYnlGQWptaWkzbUpJU1ZPUGhXS1hEQmxuc091Wi13d0JLZmhKOXVDV2hNNURDNTV4UFdEWUVQOXFNT3NCMjNWdjh6bmJFVTVmOFlMODhmZXZ0bjhfMnRLaV9mcUVJb1hhemg3RVBkaU1CRHZrUTIwOFVMSkZ1UmhwYkEweHhCYWcyd3ljZHBOemtFMW5JS0lfVnFJcjZCcHVmYlRsUk13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Inflows Could Be Up To 50% Of Bitcoin ETF Inflows: Galaxy Research - Benzinga",
        "content": "The cryptocurrency market is bracing for a potential influx of new investment as Ethereum ETH/USD spot exchange-traded funds (ETFs) near trading launch in the United States.\n\nWhat Happened: A new report by Galaxy Research suggests these new financial products could attract substantial capital, potentially reshaping the Ethereum ecosystem, Coindesk reported.\n\nAccording to Galaxy analyst Charles Yu, “We expect the net inflows into ETH ETFs to be 20-50% of the net inflows into BTC ETFs over the first five months, with 30% as our target, implying $1 billion/month of net inflows.”\n\nThis projection underscores the significant interest anticipated in Ethereum ETFs once they become available to U.S. investors.\n\nThe path to Ethereum ETF trading has been cleared following the Securities and Exchange Commission’s (SEC) approval of applicant filings last month.\n\nHowever, the final hurdle remains the approval of S-1 filings, which is necessary before these products can begin trading.\n\nGalaxy’s report draws parallels between the expected demand for Ethereum ETFs and the successful launch of Bitcoin spot ETFs in January.\n\nThe research suggests that independent investment advisors and broker/dealer platforms will likely drive new demand for these Ethereum-based products.\n\nAlso Read: Uncle Sam On The Move: US Government Transfers Millions In Bitcoin To Coinbase\n\nWhy It Matters: Interestingly, the report highlights Ethereum’s unique market dynamics, suggesting it may be more sensitive to ETF inflows than Bitcoin BTC/USD.\n\nThis sensitivity is attributed to the significant portion of ETH supply locked in staking, bridges, and smart contracts, coupled with lower holdings on centralized exchanges.\n\nHowever, Galaxy also notes potential challenges for Ethereum ETFs.\n\n“Galaxy cautioned that spot Ethereum ETF demand may be limited due to the lack of staking rewards,” the report states, highlighting a key difference between holding ETH directly and through an ETF.\n\nThe conversion of the Grayscale Ethereum Trust ETHE into an ETF is expected to influence market dynamics. Galaxy estimates that “these negative flows could be about 319,000 ETH per month or $1.1 billion.”\n\nHowever, the report suggests that the impact may be less severe than what was observed with the Grayscale Bitcoin Trust GBTC conversion.\n\nWhat’s Next: As the cryptocurrency market eagerly awaits the potential approval of Ether ETFs, which could come as soon as July 4 according to a recent Reuters report, investors and industry professionals are keen to understand the implications of these new investment vehicles.\n\nFor those seeking deeper insights into the future of Ethereum and the broader digital asset landscape, Benzinga’s Future of Digital Assets event on Nov. 19 promises to be a crucial forum.\n\nRead Next: U.S. Offers $5M Reward For Information On Crypto Fraudster Ruja Ignatova\n\nImage: Shutterstock"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOaDRRTDVacnUtYWp2R0JoZV8zaWItc0syajlFTkVZZjRPc1hjNVpaQnRwQ2I2U2VpYmpldjNFeXVHamU1OFR0ODNsQU02T3R4UDNpcWVOaEdJRjBZZnNvd1E5M0FiQk41MTdqdzZ2c21IdlhiWktQVXd2N1I2ZnRwdTM3eEtmZ0lvalI4eU5LaVFZdkdsdWRVcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ether to $7,000? Six experts on how Ethereum ETFs will unleash a ‘floodgate’ of demand - DLNews",
        "content": "The launch of spot Ethereum ETFs are expected any day now.\n\nSome market watchers expect the price to surge to $7,000.\n\nOthers are more cautious.\n\nThe launch of Ethereum spot exchange-traded funds is imminent.\n\nBloomberg Intelligence analyst Eric Balchunas said on Tuesday that issuer VankEck’s 8-A form submission was “good sign” for a July 2 launch date.\n\nIndustry executives told Reuters that the ETFs could launch before July 4.\n\nAs excitement builds, demand for futures bets on Ether via the Chicago Mercantile Exchange surged 105% to $1.32 billion — close to the exchange’s all-time high Ether open interest of $1.35 billion.\n\nBut what do the experts say? We found out.\n\nLekker Capital’s Quinn Thompson\n\nThe way Quinn Thompson sees it, being bearish has never been so cool amongst crypto investors as it is now — and that’s bullish.\n\nIn a Wednesday X post, Thompson forecasted a period of calm as sellers tire before a “slap in the face” type moment shows them their outlook is too bearish.\n\nThat could look like positive spot Ethereum ETF flows upon launch, or even something as simple as competition among ETF issuers to offer the lowest fees, he said.\n\nJoin the community to get our latest stories and updates\n\nVanEck has already said it won’t charge a fee for its spot Ethereum ETF.\n\nThompson finished with a bold price prediction: “Ether will reach $7,000 and Bitcoin will make its first attempt at $100,000 by the election in November.”\n\nBitwise’s Matt Hougan\n\nEthereum exchange-traded products will attract $15 billion in net flows in their first 18 months on the market, Bitwise’s Matt Hougan said in a recent X post.\n\nHougan based his prediction on data from Europe and Canada, where crypto ETFs have established markets.\n\nWhile $15 billion is significantly less than the $56 billion investors have piled into US Bitcoin ETFs, he still said such a figure would be a “historic success.”\n\n“Only four ETFs launched since January 2020 have gathered $15 billion in flows,” he said, adding that he believes Ether’s best days are ahead of it.\n\nHougan’s analysis came with a caveat, though.\n\nHe said there’s a “good chance” of initial net outflows from Ethereum ETFs after their launch as traders who played the discount-arbitrage game redeem out of Grayscale’s Ethereum Trust.\n\nQCP\n\nSingapore-based QCP is also looking at the Bitcoin ETF launch for clues.\n\n“If the Bitcoin ETF approval was any indication, we could see a similar 60% rally from here,” the firm said in a Monday note.\n\nWith today’s prices, that would translate to Ethereum trading at around $5,430 in the months after its ETF launch.\n\nQCP also spotted a market mismatch that could boost Ether’s price in the short-term.\n\nBased on VanEck’s S-A filing, and the fact that its ETF is already listed by the Depository Trust and Clearing Corporation, QCP said trading for the ETFs could start as early as next week.\n\nThe firm noted, however, that the Ether options market for July doesn’t appear to have reacted.\n\n“If there is a substantial breakthrough in the approval process, it could catch the market by surprise,” QCP said on Wednesday.\n\nConsensys’ Joe Lubin\n\nExpect a “floodgate” of demand for Ether, which will likely lead to a supply crunch and drive prices higher, says Joe Lubin, co-founder of Ethereum and founder of crypto infrastructure firm Consensys.\n\nInstitutions that have already gained exposure to Bitcoin ETFs “will most likely want to diversify into that second approved ETF,” Lubin told DL News.\n\nBernstein\n\nSpot Ethereum ETFs will drive a 75% surge to $6,600, according to analysts at research firm Bernstein.\n\nThey extrapolated that number by looking at how the SEC’s approval of spot Bitcoin ETFs in January spurred a 75% rally in the following weeks.\n\n“We would expect similar price action for ETH,” Gautam Chhugani and Mahika Sapra said in a recent report.\n\nCrypto market movers\n\nBitcoin is down 0.1% over the past 24 hours to trade at $61,141.\n\nEthereum is up 0.6% to $3,398.\n\nWhat we’re reading\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTFBwaUtuZkpGX21qWGd6WXdkV0o0Z3RBaHRMTGNMTGdNbnBBMVl6Zm9EcVJpTHJiSnpFenZoZ1ZIeE9yQjRYNmhuRXotSl9nZTNzMlduVnZ0elZicUxEN1pvdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum resurgence and layer-2 boom define crypto Q2: IntoTheBlock - Crypto Briefing",
        "content": "Spot ETH ETFs boost Ethereum as Bitcoin miners increase sell-off.\n\nKey Takeaways Bitcoin's price declined following its fourth halving, despite reduced issuance.\n\nEthereum's price rose following SEC's approval of spot ETH ETFs.\n\nShare this article\n\nThe second quarter in crypto was marked by Bitcoin (BTC) and Ethereum (ETH) trending down, BTC miners selling their reserves at a rapid pace, and layer-2 blockchains activity leaping four times, according to IntoTheBlock’s “On-chain Insights” newsletter.\n\nBitcoin’s price fell by 12.8% following its fourth halving on April 20, and an anticipated price surge caused by a supply shock did not materialize. IntoTheBlock analysts shared that this is likely due to long-term holders taking profits in 2024.\n\nImage: IntoTheBlock\n\nMoreover, miners have offloaded over 30,000 BTC in June alone, which amounts to near $2 billion. Again, the halving could be tied to this movement, as profit margins for miners decreased since then.\n\nIn contrast, Ethereum saw a modest decline of 3.1%, a feat made possible by the approval of spot ETH exchange-traded funds in the US, the analysts highlighted. This event boosted Ethereum’s price by over 10%, as those investment products are expected to attract substantial investment, mirroring the inflows seen with Bitcoin’s ETFs.\n\nAdditionally, Ethereum’s landscape was notably different, with an increase in transactions on layer-2 blockchains like Arbitrum, Base, and Optimism, following the integration of EIP-4844.\n\nCaption\n\nThis development introduced the “blobs”, which significantly reduced transaction fees for layer-2 blockchains and encouraged greater on-chain activity. Therefore, this potentially prepared the stage for long-term network benefits despite a short-term decrease in fee revenue."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNay0yaGF2MVp4M1k2bGFaQ0hLcjFiWlg1b0locVNtSDJfTkdTRXVRaHpzc2ZMRC16SmdwOWMyU095RmRtUGF2SWVmTFFyb1FaNGdrNGJOMXM3Wmp1Vl9yRnQtQkptSlhIdGdKYlR1WDBxQWJoYWxfUkVIYzc5djFQZEhCSHB1dUU4ZEpFT3NVSFFZRGsxS3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 13:04:59 GMT",
        "title": "US court sets ‘crypto = security’ precedent, spelling trouble for Ethereum - CoinGeek",
        "content": "Homepage > News > Business > US court sets ‘crypto = security’ precedent, spelling trouble for Ethereum\n\nGetting your Trinity Audio player ready...\n\nThe U.S. Department of Justice (DoJ) is celebrating a fraud conviction that definitively labeled ‘crypto’ tokens as securities for the first time, leaving Ethereum bigwigs wondering when that axe might fall on them.\n\nOn June 25, the DoJ announced that U.S. District Judge Patricia Seiz had sentenced both Shane Hampton and Michael Kane to nearly three years in prison for “manipulating the price of a security and scheming to defraud investors in connection with the purchase of Hydrogen Technology’s cryptocurrency, HYDRO.”\n\nThe pair were among five individuals charged in April 2023 with wire fraud, wire fraud conspiracy, and securities price manipulation. Kane was the Florida-based Hydrogen Tech’s co-founder/CEO, while Hampton was its chief of financial engineering. Kane pleaded guilty last November, while a federal jury convicted Hampton on February 7. Two other co-conspirators, Andrew Chorlian and Tyler Ostern, pleaded guilty in May 2023.\n\nThe scam involved using trading bots to manipulate HYDRO’s fiat value on an unspecified U.S.-based digital asset exchange. Between October 2018 and April 2019, the scammers ensured their bots made around $7 million in ‘wash trades’ and placed over $300 million in ‘spoof trades’ to convince retail investors that HYDRO was a winner. The scam netted its principals over $2 million in profits.\n\nNicole Argentieri, Principal Deputy Assistant Attorney General and head of the DoJ’s Criminal Division noted that “in this case, for the first time, a jury in a federal criminal trial found that a cryptocurrency was a security and that manipulating cryptocurrency prices was securities fraud.”\n\nArgentieri warned other would-be manipulators that the DoJ “will not hesitate to use all tools at its disposal—including the federal securities laws—to protect the integrity of cryptocurrency markets.”\n\nIn October 2022, the Securities and Exchange Commission (SEC) filed civil charges against Kane and Hydrogen Tech for violating U.S. securities laws’ anti-fraud provisions through the same manipulative efforts. The SEC won a $2.8 million judgment the following April, forcing a settlement with Ostern, the CEO of South African market-maker Moonwalkers, for participating in the scheme.\n\nThe SEC noted at the time that the HYDRO tokens issued by Kane et al. “were offered and sold as investment contracts, and therefore were securities whose offer or sale required registration with the SEC unless an exemption from registration was available.” No registration was sought, nor was any exemption granted.\n\nConsensys v SEC\n\nIn a June 25 Bloomberg interview with Annmarie Hordern, SEC chairman Gary Gensler appeared unmoved by cries of inconsistency in his approach to regulating digital assets, saying, “There’s nothing inconsistent about crypto securities and the securities laws.”\n\nNot everyone shares this view. Under Gensler, the SEC has brought numerous civil suits against ‘crypto’ operators, be they token issuers, digital asset exchanges, or decentralized finance (DeFi) platforms. This hasn’t endeared him to the sector’s leading lights, who tend to view any encroachment on their (allegedly) God-given right to do as they please as tantamount to heresy.\n\nThe sector also doesn’t buy Gensler’s consistency claims, so they were popping champagne corks earlier this month when the Consensys blockchain software firm announced that the SEC’s Division of Enforcement “notified us that it is closing its investigation into Ethereum 2.0 and will not pursue an enforcement action against Consensys.”\n\nIn late April, Consensys announced that it had filed a pre-emptive suit against the SEC over the regulator’s (alleged) plan “to regulate ETH as a security.” The complaint filed by Consensys sought to compel the SEC to declare that ETH isn’t a security and thus the company’s ETH sales weren’t violating any securities laws.\n\nThe SEC didn’t publicly respond to the Consensys complaint, but a June 18 letter written by SEC Enforcement Assistant Director Kristin Pauley to Consensys’s attorneys did indeed state that her office wouldn’t be recommending an enforcement action against Consensys at this time.\n\nHowever, Pauley added that the SEC didn’t agree with Consensys’s “legal conclusions” (that ETH was a commodity) and that the letter “must in no way be construed” as a suggestion that Consensys “has been exonerated or that no action may ultimately result from the staff’s investigation.”\n\nETFs don’t make ETH a commodity\n\nThe day after Pauley’s letter, Joe Lubin, Consensys founder and co-founder of Ethereum, told Fox Business journo Eleanor Terrett that his company would continue its litigation against the SEC “because we are intent on achieving more legality for all.”\n\nLubin appears convinced that the SEC is still mulling legal action against Consensys based on the belief that its MetaMask Swaps software is an unregistered broker-dealer and its MetaMask Staking product involves the offer and sale of unregistered securities.\n\nRegardless, Ethereum backers were cheering on May 23 when the SEC’s Division of Trading and Markets approved rule changes to permit eight ETH-based exchange-traded funds (ETF). Reuters reported this week that formal approval of the eight applicants could come as early as July 4.\n\nEthereum fans took the ETF policy shift as further evidence that the SEC now viewed ETH as a commodity rather than a security. However, approving an ETF doesn’t require a declaration that ETH is a commodity, and the SEC has made no such declaration, regardless of how furious Lubin might try to spin that into reality.\n\nThe SEC was simply following the same path as its January approval of BTC spot-based ETFs—namely, that since both tokens were already traded on the Chicago Mercantile Exchange futures market, there was sufficient data to ensure oversight of possible fraud or market manipulation.\n\nBut make no mistake about it: ETF or no ETF, ‘Ethereum 2.0’ is even more of a security than the original product. (And don’t just take it from us: here’s an epic video thread of Ethereum ticking the boxes on the Howey Test.)\n\nAll the tokens, all the time\n\nEthereum 2.0 refers to the network’s September 2022 transition from a consensus mechanism based on proof-of-work to one based on proof-of-stake (PoS). The latter requires individual validators to stake 32 ETH (currently ~US$108,000) to participate in the PoS system and earn additional ETH via block rewards and transaction fees.\n\nThis system was custom-designed for ETH whales, a clear case of the ‘rich getting richer.’ Given Ethereum’s origin story, it’s not hard to see how the members of the Ethereum Foundation decided this was the way to go.\n\nThe initial ETH pre-sale in 2014 saw as much as 40% of the available tokens go to a handful of insiders, as there was little to no policing of the purported 12.5% cap on tokens sold to any one buyer.\n\nA couple of years ago, former Ethereum developer Lane Rettig estimated that as much as 60% of all ETH was still the product of this pre-mine. Rettig also fingered Lubin as “probably the largest holder” of ETH at the time of the pre-sale. Rettig eventually quit the project when he began to suspect that his primary role was “pumping Joe Lubin’s bags,” something he concluded was “just not what I want to do.”\n\nFor years, Lubin and other Foundation whales have relied on a 2018 speech by Gensler’s SEC predecessor, William Hinman, that claimed Ethereum started out centralized and thus qualified as a security but had magically decentralized over time and thus no longer qualified as a security.\n\nHinman was a deeply conflicted individual, having had meetings with Lubin and other Consensys executives prior to that 2018 speech. During his stint running the SEC, Hinman also received millions from a law firm that was a member of the Ethereum Enterprise Alliance, prompting concerns from the SEC ombudsman regarding Hinman’s “full financial conflict” with the firm, which Hinman promptly rejoined after leaving the SEC.\n\nIn other words, Hinman’s speech—which was never formally enshrined as SEC policy—wasn’t worth the paper it was printed on.\n\nConsent of the governed\n\nThe ETH token is by no means the only aspect of Ethereum that’s overly centralized. A recent report by Mike Novogratz’s Galaxy (formerly Galaxy Digital) blockchain/AI-focused investment group sought to determine whether Ethereum’s end users have any say in the evolution of the network or if everything is simply dictated by a shadowy group of insiders.\n\nProtocol changes occur off-chain, “spearheaded by the Ethereum Foundation, and conducted through online forums such as Discord, GitHub, Ethereum Magicians, and Zoom.” Rank-and-file holders of the network’s ETH token don’t get to vote on proposed changes, nor do decentralized autonomous organizations (DAOs).\n\nGalaxy’s VP of Research Christine Kim notes that this off-chain scenario prevents (most) ETH whales from exerting undue influence via the size of their bags, nor can bad actors hijack governance-related smart contracts to skew the results. However, off-chain voting is “difficult to audit and objectively evaluate because processes are intentionally opaque, subjective, and unstructured.”\n\nIn an interview with CoinTelegraph, Kim appeared to suggest that Ethereum was in a bind, as “the risks of Ethereum being governed by off-chain forums and processes are not unlike the risks that exist even with on-chain forms of governance.”\n\nThis dilemma is compounded by the fact that many of the same whales are among the most important voices in making off-chain decisions. As Kim puts it, “I think some improvements can be made to Ethereum’s off-chain governance model, particularly concerning the Ethereum Foundation’s role in the Ethereum ecosystem.”\n\nThe Foundation, a ‘non-profit’ established in Switzerland a year prior to the network’s 2015 launch, cannot unilaterally dictate what changes are made to Ethereum’s protocol. But its founders include Vitalik Buterin, Lubin, and others who are deeply involved in many of the other entities that decide the network’s future direction.\n\nThe Foundation’s size and scope remain a mystery, as it hasn’t issued any reports regarding its operations or finances since April 2022. Its only three publicly identified members are Buterin, Aya Miyagushi, and Patrick Storchenegger.\n\nMaking the centralized sausage\n\nEthereum Improvement Proposals (EIP) can be proposed by anyone but the Galaxy report identifies four specific groups of stakeholders involved in the EIP vetting process: the Foundation; validator node operators, who process transactions under Ethereum’s PoS consensus mechanism; decentralized application (dapp) developers, who provide feedback on their users’ needs; and execution/consensus client software teams.\n\nKim calls the client teams “arguably the most important decision-making in the EIP process.” That importance potentially poses a major problem, as the dominant execution layer GETH is funded exclusively by the Foundation.\n\nSeveral other clients have been the recipients of Foundation grants. Still other clients were developed by Lubin’s Consensys. Buterin funded another client, which also received a Foundation grant.\n\nIn other words, while there may be ten client teams, even those that aren’t currently controlled by the Foundation and/or Ethereum’s co-founders owe much of their origin story to those same parties. All of these suggest the ‘invisible hand’ of Ethereum’s inner circle appears capable of exerting greater influence over the EIP process than is immediately apparent.\n\nKim says that “in theory,” validators “have the final say over what code changes are implemented” because they have the “agency to implement or reject code changes that have been made to Ethereum software by client teams.”\n\nGiven the 32 ETH hurdle for participating in the PoS system and the tiny handful of whales who hoovered up all that ETH via the initial distribution, validators are yet another possible example of the few governing the many.\n\nKim summarizes that “while the interests of each focus group, that is client teams, validator node operators, and dapp developers, are distinct, the individuals that comprise these groups often overlap, making the stakeholders involved in the Ethereum governance process difficult to neatly categorize or define.”\n\nYou’ve tried the rest\n\nEthereum’s overly centralized model is the dictionary definition of an unregistered security while also subjecting the network to the whims of those who just can’t seem to stop tinkering under its hood. Ethereum has undergone so many backward-incompatible ‘upgrades’ that they actually had a dedicated hard fork coordinator (until he was drummed out by the mob for making a joke about the upcoming transition to PoS).\n\nEthereum’s primary challenge is scaling to handle a sufficient number of transactions to live up to its self-imposed ‘world computer’ designation. But rather than build a strong and secure main network, those governing its operations incessantly tinker with various bolt-on appendages in a failed bid to reduce its transaction bottleneck and lower its occasionally astronomic fees.\n\nContrast Ethereum’s Rube Goldberg-worthy dead-end detours with the BSV blockchain, which can not only handle a volume of transactions that Visa (NASDAQ: V) would envy, but can do so securely on its original layer, with a fee structure measured in fractions of a cent. And unlike Ethereum, BSV has a locked protocol that ensures all smart contracts will remain valid regardless of when they were established.\n\nBSV was named the digital asset least likely to be labeled a security for these and other reasons. So go ahead and clean house, Gary G. It’s time to take out the trash.\n\nWatch: Teranode is the future of the Bitcoin network"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNNHNHaU1CUGpPLTdRR1E5cGZreFVvM2lFTjVtTXJNSHZuUUhNNUVFVXpHOXVnZk1Sa1dEV2Zac0liNFB3d1g3WDNhZktlMlBiaUxQU21ITzJRRndfZ1RpZEFYREpWaG9MOEFuQ1J0c25PRE9NZ1F4TFNvY1RiUWpmdGpVcE5PQ2Y0ZHVlWWZYWjY4VTdHZGVpUXpKcVBuUWNtNTdOMDI4QnAya1JSUjJfeE5QV3h5T1l2NnFiUDYyOWx6NmpXbGNMS2dGNkNnSzNwU2hJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Lekker Capital CEO Explains Why Bitcoin Could Reach $100,000 and Ethereum $7,000 by November Elections - The Crypto Basic",
        "content": "Quinn Thompson, CEO of Lekker Capital, forecasts Bitcoin at $100K and Ethereum at $7K by November, citing upcoming catalysts like ETFs and elections.\n\nIn a recent post on the social media platform X, Quinn Thompson, Founder and CEO at Lekker Capital, expressed his bullish outlook on the crypto market, particularly BTC and ETH. Thompson believes that Bitcoin (BTC) and Ethereum (ETH) are currently presenting one of the most attractive buying opportunities in recent memory.\n\nTitle: We are amidst one of the most obvious and attractive crypto buying opportunities of recent memory. Subtitle: While the market has completely reset, the structurally positive election, liquidity and crypto momentum cycles remain intact. Body: In all of my 5 years in… — Quinn Thompson (@qthomp) June 26, 2024\n\n- Advertisement -\n\nHe predicts that Bitcoin will surge to $100,000 while Ethereum will climb to $7,000, both achieving these milestones by the November election.\n\nElection, Liquidity, and ETFs\n\nThompson’s optimism stems from several factors that he believes the market has yet to price in fully. These include the upcoming U.S. presidential election, increased liquidity from the Federal Reserve, and the launch of the Ethereum ETF. Additionally, Thompson points to the Circle IPO and improved Bitcoin miner profitability as further catalysts for growth.\n\nThe CEO’s confidence in the market’s potential for a significant rally is also supported by various metrics. The CME basis for Bitcoin and Ethereum and the percentage of open interest in altcoins are all at cycle lows. Stablecoin supply has begun to grow again, indicating renewed interest and potential for upward price movement.\n\nAccording to the statement, any potential impact on Bitcoin and Ethereum prices resulting from the Mt. Gox or US and German government supply overhangs has already been factored into the market. Therefore, Thompson suggested that such previously known information would not significantly influence the cause of major declines in the prices of BTC and ETH.\n\n- Advertisement -\n\nFrom Bearish to Bullish\n\nThompson argues that current sentiment are overly bearish, and a “slowly then suddenly” dynamic is likely to play out as investors regain confidence and reenter the market. The CEO points out that similar negative narratives are currently being expressed about the potential Ethereum ETFs, echoing the sentiments before the Bitcoin ETFs launch. This perspective suggests that the current pessimism may be overstated and that the market could soon see a positive shift.\n\nThompson’s predictions align with those of other prominent figures in the crypto space. Galaxy Digital CEO Michael Novogratz has previously stated that he believes Bitcoin could reach $100,000 this year. Similarly, “Rich Dad Poor Dad” author Robert Kiyosaki has forecasted a similar price target for Bitcoin by the middle of the year."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBVay04ZXRaUzdkR2RkSGUxNVNnTGRlTDNfLVFuQ2NJYXVUTGVqWTdENDFNekVCU3VqbUhWUUVab3ZucWw2YXF4YXVxdmVSRmlyR3RVU0gxUnJLWVZpUW5xMmVOU3dkWUFJc1MwWWhYLUFwSl9BNFRKS2JIVXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price could go parabolic soon, analysts say - crypto.news",
        "content": "Ethereum price has held relatively well in the past few days as the odds of spot ETF approvals rose. ETH token was trading at $3,455 on Friday, a few points above this week’s low of $3,233. It remains in a correction zone after falling by 13% from its highest point this month.\n\nThe main catalyst for Ethereum is the anticipated spot Ethereum ETF approval by the Securities and Exchange Commission (SEC). As we reported on Thursday, there is a rising possibility that spot Ethereum ETFs will start trading soon.\n\nThe rising anticipation happened after VanEck filed form 8-A, which is an important document in the ETF application process. Eric Balchunas, a senior ETF analyst at Bloomberg believes that these funds will start trading on July 2nd.\n\nVanEck just filed 8-A form for spot Eth, which is just part of process, but.. should be noted that they filed their 8-A for spot bitcoin exactly 7 days before launch. Good sign for our July 2nd over/under (7 days from now). But again, anything poss. Sure we'll hear more soon.. https://t.co/2BlkDnWhrz — Eric Balchunas (@EricBalchunas) June 25, 2024\n\nThe approval of spot Ethereum ETFs would be a big deal. As we saw with Bitcoin, there is a strong demand for cryptocurrencies from institutional investors.\n\nSimilarly, the Grayscale Ethereum Trust (ETHE), which has a management fee of 2.50%, has over $10 billion in assets. As such, lower-priced funds will likely see heavy demand from retail and institutional investors.\n\nEthereum ETFs will also start trading at a time when balances in exchanges continue dropping, as shown below.\n\nEthereum reserves in exchanges\n\nEthereum’s ecosystem is still doing well even as the crypto sell-off continued. The network has over $108.95 billion in total value locked (TVL) and almost $80 billion in stablecoins. It has collected fees worth $1.65 billion, higher than Tron’s and Bitcoin’s combined.\n\nAnalysts are bullish on Ethereum price\n\nSome of the top crypto analysts believe that Ethereum is on the cusp of a bullish breakout. In an X thread, Rekt Finance noted that Ethereum’s open interest in the futures market was rising, which is a sign of institutional demand ahead of the ETF approval.\n\nHe also noted that Ether was a deflationary asset that has constantly been reducing its supply over time. Altogether, he expects that ETH will jump after the ETF approval, then move to a consolidation or pullback as many Grayscale Ethereum Fund holders move to cheaper options, and then it will resume its bullish trend.\n\n🚨 \"ETH IS GOING TO ZERO\" – that's what everyone's saying.\n\n\n\nBut I'll prove them wrong.\n\n\n\nI dug into the data and what I found was shocking.\n\n\n\n🧵: When & why $ETH is heading to $10K (+ trigger altseason) 👇 pic.twitter.com/nnlUDJlbNz — Rekt Fencer (@rektfencer) June 25, 2024\n\nIn another Tweet, Crypto Rover, who has over 700k followers, noted that Ethereum had formed a descending channel that resembles a falling wedge pattern. In most cases, this is one of the bullish patterns that supports upside potential. He expects that the breakout could happen soon."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNbFJmWkV2T0hFNG92cFR5Z0tiQ0Nxd1VMNjJBM3pnMV9oX2FDUXBYOHZjWG8tTC1jaTVEMHp5NWFGMjNLYnczXy1rYWZ4UElFWjZlVmlYMmZhTmxrek53V3ZrRkdjNjJOMmotYmJEc1R6NjFuaHZaNGlDeV9sNWZ4VG9KQ0JMM1N5dW9iWjh6Y0VidE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum While It's Under $4,000 - The Motley Fool",
        "content": "Ethereum could outperform Bitcoin in the second half of 2024. Here's why.\n\nThrough the first six months of the year, Ethereum (ETH -5.70%) has largely kept pace with Bitcoin (BTC -3.10%). Both are now up about 45% year to date, and the big question on the minds of many investors is which is going to outperform during the rest of 2024.\n\nIn early May, the easy no-brainer answer would have been Bitcoin. But Bitcoin has stumbled of late, and that has opened the door for Ethereum. There are now four compelling reasons Ethereum could soar higher, even if Bitcoin continues to trade sideways.\n\nThe new ETFs\n\nBitcoin, of course, has had spot exchange-traded funds (ETFs) since January. And the introduction of this new investment product has arguably been one of the most important crypto narratives of 2024. But there's a new twist to that narrative. At the end of May, the Securities and Exchange Commission (SEC) finally approved new spot ETFs for Ethereum.\n\nIt is still uncertain how much of a boost these new ETFs are going to provide. The current thinking is that they will start trading sometime this summer and that they could lead to $3 billion flooding into the new ETFs. That's a bull case scenario, though. According to JPMorgan Chase (JPM -1.81%), the bear case scenario is closer to $1 billion. That's barely a blip on the radar compared to the $30 billion that has flowed into the new Bitcoin ETFs. Nevertheless, they are still likely to move the needle for Ethereum.\n\nEthereum as the market leader\n\nEthereum continues to be the clear market leader in every important blockchain sector. Take decentralized finance (DeFi), for example, where Ethereum still accounts for more than 60% of all total value locked (TVL) in the blockchain world. No other blockchain even comes close. So we can start to downplay any notion that a challenger such as Solana (SOL -5.36%), Cardano (ADA -6.00%), or Avalanche (AVAX -7.38%) has any clear-cut path to toppling Ethereum anytime soon.\n\nThe market seems to agree. Ethereum is significantly outperforming all of its peers. For example, Solana is up 35%, and Sui (SUI -2.02%) is up 9%. Other top competitors are reeling. Aptos (APT -2.47%) is down 28%, Cardano is down 32%, and Avalanche is down 33%.\n\nRegulatory clarity\n\nThere's another big reason to cheer on Ethereum, and that is regulatory clarity. Just about anyone who has ever heard of Ethereum considers it to be a cryptocurrency. However, through the first six months of the year, there were rumbles and murmurs about a pending SEC investigation into Ethereum, due to uncertainty over whether it might actually be a security.\n\nBut those rumors now appear to be quashed, with the SEC saying that it is closing down any investigation into Ethereum. That's important because it could turn on the money spigots for risk-averse institutional investors. Crypto is risky enough without the added risk of an SEC probe.\n\nLong-term disruptive potential\n\nAnd, finally, there's the long-term disruptive potential of Ethereum. For the past decade, Ethereum has been a true innovator, pioneering niches of the blockchain world that had never existed before. And, judging by all the tech upgrades that have been made to the Ethereum blockchain over the past two years, this trajectory should continue.\n\nIn fact, investment firm VanEck expects Ethereum to grow dramatically in several key areas, led by DeFi. It's here that the Ethereum blockchain can offer the greatest disruptive potential. It's simply faster, cheaper, and more transparent to manage financial assets on a blockchain. And that could lead to Ethereum gaining market share at the expense of traditional financial rivals.\n\nIn fact, VanEck has run the numbers and determined that Ethereum could soar to a value of $22,000 per token by 2030. That would give Ethereum an implied market cap north of $2 trillion. Given that the top companies in Silicon Valley are now worth anywhere from $1 trillion to $3 trillion, a market cap of $2 trillion for Ethereum is not as unreasonable as it might sound at first.\n\nWhat to look for over the next six months\n\nFrom my perspective, the biggest threat to Ethereum remains the rise of blockchain challengers such as Solana. The economic moat that once surrounded Ethereum seems to be getting smaller and smaller with each passing year.\n\nThat said, Ethereum is shaping up to be one of the best crypto investments you can make in the second half of 2024. If the new ETFs perform as expected, then it could be off to the races for the world's second-most-valuable cryptocurrency."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFB5QkdTcGI3a0NOd2RTU3NzQTBWZ1gwbExJamIxX05SNjVhNWtYdEQ0dmdvVlkzbFhscFREOFU1WkVRUjgtM1NuVFdIczk2VUFsVHJZQjJaQ2ttajE1aHRLVXR2UnFZT3FBLVpsN054blZ0UDlNWUHSAXtBVV95cUxPSkktUkU2YjNtYVotdUl3bGVPYXdzUC1NMFNqWjhCT0FYeVJxQTQ4RFZWRzA1M2NLNW4tbWJuTmRNcFR2NzRad2J5OHIxN29KM2lnODl4aFpjRGVpWG9BTTV2RGN0dXl2Y2tmTUF6VlZwUlhhVlFGSEhEZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Major Bullish Sign Against Bitcoin - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) might finally be ready (BTC) to gain some ground against Bitcoin.\n\nAdvertisement\n\nAs noted by prominent trader Josh Olszewicz, the ETH/BTC pair has managed to close above the two-day Ichimoku cloud for the first time in 525 days.\n\nfor the first time in 525 days, ETH/BTC has closed above the 2-day Cloud pic.twitter.com/ihwRBF6uY1 — #333kByJuly2025 (@CarpeNoctom) June 27, 2024\n\nHis analysis suggests that the pair has likely bottomed after nearly two years of underperformance.\n\nAdvertisement\n\nThe flagship altcoin is currently changing hands at 0.055 BTC on the Binance exchange.\n\nAfter peaking at 0.061 BTC back in January, the ETH/BTC pair experienced a substantial downtrend, plunging all the way back to 0.044 BTC in May. However, Ethereum managed to gain as much as 28% against the largest cryptocurrency during the same month following the unexpected approval of several 19b-4 forms for Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission.\n\nThe approval process is now going \"smoothly,\" according to SEC Chair Gary Gensler , and it seems like these products will be able to start trading in the near future.\n\nEarlier today, Reuters reported that Ethereum ETFs would likely go live by July 4. According to the anonymous sources cited by the outlet, the talks between prospective ETF issuers and the regulator have advanced to the \"final stages.\" Now, only \"minor\" issues have to be resolved.\n\nEven though the expected launch of Ethereum ETFs could be a major bullish catalyst for the leading altcoin, it remains to be seen whether inflows will be impressive enough for the market. Morningstar's Bryan Armour has noted that Ethereum ETFs would be unable to generate the same level of excitement as Bitcoin ETFs."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9YZFdDaHRCOG4wVWFNbTF4aHliOXBlWVo0a0hHdVctQ1ptR2pFaThTX0kyZ2pUbzhsYkpMekV4UldaQ0xQTGY1SDFEeEw5dzdHbG56dy1ZVTRRU0R5dWlydEhraVQzeDFI0gFuQVVfeXFMT1R0VmxYbGtHSVRMSzhneGgyMG1kd2tXR2o2YVIwRnFJT3VNbjQ1QkpuVGZleGVFczQxbGJHQUdWRHZNVGNJNE5qY0lSUmZzSGdEQngxczMwcHdCbVVmZnJ4ZVhmMUJDemhvR3Y5cGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Cardano Boosts Connectivity with Ethereum - U.Today",
        "content": "The Cardano Foundation, the non-profit organization behind the popular proof-of-stake blockchain, has boosted the level of interoperability by integrating the Inter-Blockchain Communication protocol.\n\nAdvertisement\n\nThe integration now makes it easier for developers to Ethereum Virtual Machine (EVM)-based applications on Cardano sidechain.\n\nThe standardized protocol, which was originally introduced back in 2019 by Cosmos Network, makes it possible to bridge several heterogeneous blockchains by sending information via special channels. Data can be easily transferred by blockchain with different consensus mechanisms. No direct communication between them is required in order to ensure the validity of certain information.\n\nAdvertisement\n\nWith Cardano, for instance, enterprises that rely on the ICB protocol can still take advantage of the network's deterministic fees and other advantages while working with other chains. \"With the implementation of IBC on Cardano, businesses benefit from a framework for developing and deploying scalable, secure, and interoperable blockchain solutions,\" the foundation said.\n\nA governance controversy\n\nIn other news, the foundation recently stirred some controversy with its voting decision earlier this week.\n\nDuring a bootstrapping phase, which will take place between the two stages of the hard fork's implementation, the foundation will become a member of an Interim Constitutional Committee (ICC).\n\nIt has already taken part in the ICC election, placing The Cardano Atlantic Council at the top of its ratings. When voting for candidates, it takes into account such factors as the level of engagement, technical expertise, transparency, and so on.\n\nHowever, the foundation faced some pushback from some members of the community who believe that it had to rule itself out from the entire ICC voting process. \"I think it is wrong that Cardano Foundation should put their thumb on the scales,\" one user commented."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE55QURxZVR0S0VKUzM2eUNxUG1nUFIxamxJVG9uZy1WcmkwQ0lsOGQwa1VIaFJhOUxLUzVXNlY4UTdOOGdqUVQwUGRSUk11R2NBX3BsandVZ3htQmFYNzc3ajhjTW1SSTJIZXhQSFhSUVRURElvWTI0c2FFZ2XSAYIBQVVfeXFMTUxwaGFsQXhSS09YSFJsVmp5Rm80dlZweUU4MG9OS3VPZ1RIcElZdjF1MFk5N2tOOWI2UkhjM0FUMWpRTmRsdl9SMzFSYjR2YkRLQkVOSWJYUjUyZ1BsOVpCdjBIRENRenVKaWlOcDRFQm1ia1FvUXVKSm5kRHdIMnJpZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Major Investment Firm Moves $65.59 Million in Ethereum (ETH) - U.Today",
        "content": "Paradigm Capital has moved a substantial amount of Ethereum (ETH) to the institutional-grade custody platform Anchorage Digital, per data from Arkham . At precisely 8:53 a.m. UTC+8 today, Paradigm Capital, identified by the address 0x11...c3cD, deposited 19,504 ETH, valued at approximately $65.59 million, into Anchorage Digital.\n\nAdvertisement\n\nThis transaction marks a notable occurrence in Paradigm's recent activity. Over the past three months, the firm has established a pattern of depositing Ethereum into Anchorage during the latter half of each month. However, today's deposit is exceptional for two reasons: it is the second deposit this month and the largest single deposit Paradigm has made in the past three months.\n\nThe movement of such a large volume of ETH by Paradigm Capital shows the firm's strategic approach to asset management and security. Anchorage Digital, known for its robust security measures and institutional-grade custody services, has become a preferred platform for major financial players seeking to safeguard their digital assets.\n\nThis significant deposit may also highlight Paradigm's growing confidence in the stability and potential of Ethereum as a valuable asset. It also reveals that the broader trend of institutional investors is gravitating toward reliable custody solutions to manage and protect their holdings.\n\nAdvertisement\n\nEthereum sees rising institutional confidence\n\nThe recent deposit by Paradigm Capital aligns with a growing trend of institutional interest in Ethereum. As the second-largest cryptocurrency by market capitalization, ETH has attracted considerable attention from traders due to its diverse use cases, including DeFi, smart contracts and more.\n\nInstitutions like Paradigm Capital play a key role in legitimizing and stabilizing the market. Their involvement not only brings substantial capital into the ecosystem but also enhances market confidence. By opting for trusted custody solutions like Anchorage Digital, these institutions set a standard for security and trustworthiness in the handling of digital assets."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWjlfakZUUFhCZUp3VERmZHlUNm55dFRHT3JJLTR0Q1o3ZThNNnFXdGFCTm5FTDBOUkVyMlY4ZDNLU0NPZEhUWFItWmN4V2RRUmRITlc4ZHdYZmVYV2FjUE9nMzdYa21ycThPVV9RNzZDVTNHYWfSAXtBVV95cUxQNnQ3dVg0UTBvd0wyNzRyekg4SmZCQzFnWUdlQ3JWRHFSaWd2N19WNlZpWGh1LUJfZmxaVlV2b1JubmdxNjBvZWctcHF2VXd1VUo1U1NldFd6d1liN19uV2hWNHdybktrWXgwd1Blbi12QWRldlBQUFJZYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Reach $7,500? Analyst Makes Bold Claim - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDespite the depressing performance Ethereum has been showing us lately, the potential behind it is greater than it may seem. The Glassnode analyst believes we have not yet seen everything Ethereum has to offer.\n\nAdvertisement\n\nA comparable trend that emerged in the early months of 2021 can be seen if we examine Ethereum's past. The current market structure is consistent with this historical pattern, indicating that Ethereum may have a price target of about $7,500. Based on the current structures and 161.8 Fibonacci extension level, the projection has been made by the analyst.\n\nETH to ~7500 USD as a Final Top?\n\n\n\nIf we look to ETH history, we observe how we in early 2021 had similar pattern for ETH developing. See YELLOW MARKINGS!\n\n\n\nWe believe Market moves in structures. And this structure gives us a target at ~7500 as a Final High for #ETH.\n\nThat is the… pic.twitter.com/FID62C9uyt — 𝗡𝗲𝗴𝗲𝗻𝘁𝗿𝗼𝗽𝗶𝗰 (@Negentropic_) June 27, 2024\n\nA similar Fibonacci extension level signaled a notable rally and large price gains in 2021. According to the analyst, the market moves in predictable patterns, and the current pattern indicates that ETH's high will occur at $7,500. Additionally, the chart shows a bull flag pattern, which traditionally denotes the continuation of a bullish trend.\n\nAdvertisement\n\nEthereum might be ready for a big increase in the near future if this pattern continues. Additionally, there is a surge in interest and investment on the larger cryptocurrency market. This situation, along with Ethereum's impending updates and growing institutional traction, may create the ideal conditions for a robust rally.\n\nIn order to reach this goal, Ethereum must overcome multiple obstacles. The $4,000 threshold, which corresponds to the 1.618 Fibonacci extension from the previous cycle, is the first significant obstacle. Achieving this level would confirm the bullish structure and open the door to higher objectives.\n\nAs for potential catalysts and the overall sentiment on the market, we are currently seeing a recovery after the most recent plunge, witnessed a few days ago, when Bitcoin plummeted below the $60,000 level. The best fuel for Ethereum and the market in general would be the approval of the Ethereum ETF and some technological advancements, similar to those we have seen from Solana."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNNnU4U01ZeHU4MF9jUGdiR1dCRXNza21Ud0YwRks5NFpFdkNpNi12eEZNU1o3QkYtTDFmQjNEeFhPNkhQUmlfTS1UZ3I0Q1JNSU5HXzJKSlNfVXUwcTZ5clZfRVFuRnY2bHp6LXBjZnk4QkNwaElHc0JSb2hpOHpHTXZaREFfdElzVm5lRHdqbGtpRTNXVGpYVDNBNGJBdXFqdWdxVy1EYzRhbzJScERj0gG0AUFVX3lxTE5lOWJNNUd1cmxFNXJURE9XRGhlSlVUMWlob3U3WVNUdGV5V0lHc0JYRVI4S0c2T0Q4cWlnU1JURGxhd3RZOXFta3luQlc3WjZwZ2o5MXpWclpyaWkzUUFWdWNpaEl3dkZZOGh2Z0ZENWNleEdJUEk2czlMYVdxV2I4ck40SXg2cTNCM29MdFNodUpmOWlTaXpFS3NGalM4UVcydVRpQzFpdndDak40RnlEbmU1Wg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "MegaLabs, Behind the 'Real-Time' Blockchain, Raises $20M, Led By Dragonfly - CoinDesk",
        "content": "According to a press release, MegaETH achieves its scaling in two ways: through its “heterogeneous blockchain architecture, which boosts performance by allowing network nodes with different hardware configurations to specialize on specific tasks,” as well as a “hyper-optimized EVM execution environment that pushes throughput, latency and resource efficiency to hardware limits.” An EVM execution environment is a blockchain operating system compatible with Ethereum's programming standard."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOOXF3ck1scGxOSTFRaC1vZDNtNzladDZ0d1VxVnRUcmpBbjUzeFhxWjRfYnZ0NjFfUVd6M29HSEJBYUpvNUZxRWNpeTY4R282YnF1ZVVSM2NxdkFLaGZDNG1UalZRb2kxdzZNOU1HenlCdktQaEVKaHdxMFZPLThJT0JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "How To Create NFTs On Ethereum - DisruptionBanking",
        "content": "Every non-fungible token (NFT) is unique and serves as a digital record of ownership. It identifies that you are the creator or owner of a certain digital asset. That could be a song, drawing, or any other media and content.\n\nNFTs can be profitable for individuals and businesses. You can create a digital item and sell it to earn money. Companies can sell event tickets or create NFT collections as extra income streams.\n\nEthereum is among the most popular destinations for creating NFTs. The network offers a reliable place to host your NFT and a simple creation process. If you are ready to create your first non-fungible tokens, find the steps to follow below!\n\nWhy You Should Consider Creating an NFT\n\nAccording to our experts, these are the main reasons why to consider creating an NFT:\n\nEnhance digital ownership and provenance . An NFT proves that you are the item’s owner or creator. Even when you sell the token, there’ll be proof of its origin.\n\n. An NFT proves that you are the item’s owner or creator. Even when you sell the token, there’ll be proof of its origin. Explore diverse applications . NFT can represent music or other digital content. It can also serve as proof that you own a physical item. That includes anything from event tickets to selling artwork and even using NFTs in real estate.\n\n. NFT can represent music or other digital content. It can also serve as proof that you own a physical item. That includes anything from event tickets to selling artwork and even using NFTs in real estate. Improve brand awareness and reputation. Many reputable brands, such as Adidas and other shoe creators, launched their NFT collections. Sports teams also designed non-fungible tokens to boost their bond with the fans. NFTs can be an excellent way to develop a brand and improve its awareness and popularity.\n\nStep-by-Step Process of NFT Creation\n\nThe first, and arguably the hardest, step is considering what you want to create. You might be a music creator who just completed an amazing song. Or you made an animated video or used AI to design a unique picture.\n\nThe important thing is that the NFT is unique — that’s where its value lies. And it’s worth noting that you need to be certain you are the rightful owner. Otherwise, you could end up having legal issues regarding the asset ownership.\n\nOnce you are ready to create an NFT on Ethereum, here is how to complete the process.\n\n1. Set Up an Ethereum Wallet\n\nEthereum is the favorite destination for NFT creation. Azuki, Mutant Ape Yacht Club, and Pudgy Penguins are some examples of popular tokens. According to statistics, Ethereum NFTs often reach a six-figure value during sales.\n\nYour first step is to get an NFT wallet. While there’s a huge range of wallets supporting Ethereum, here are your best options:\n\nMetaMask . It offers NFT smart contract support and is compatible with Ethereum and other blockchains. MetaMask is an excellent option for effortlessly storing and managing your NFTs and crypto coins. You can use it via a web browser and on your mobile devices.\n\n. It offers NFT smart contract support and is compatible with Ethereum and other blockchains. MetaMask is an excellent option for effortlessly storing and managing your NFTs and crypto coins. You can use it via a web browser and on your mobile devices. Enjin . If you need a non-custodial wallet that gives total NFT control, Enjin is a good pick. You can use it on the go with a free mobile app.\n\n. If you need a non-custodial wallet that gives total NFT control, Enjin is a good pick. You can use it on the go with a free mobile app. Alpha Wallet. The developers created the wallet on the Ethereum blockchain. The NFT collection is impressive, and the product offers complete control with the non-custodial feature.\n\nHead to the chosen platform to download and set up a crypto wallet.\n\n2. Purchase Ethereum (ETH)\n\nYou will need some Ethereum in your wallet because the network requires gas fees for transactions. The actual charges depend on the moment your listing is published. It should be easy to acquire some ETH coins since most exchanges support this altcoin. It’s possible to purchase it with fiat currencies or trade cryptos already stored in your wallet for ETH. You can use this ETH calculator to learn more about the asset value and potential.\n\n3. Choose an NFT Marketplace\n\nSource: Pixabay\n\nWe suggest picking a popular marketplace with generous existing NFT collections. The reason is that these platforms attract more users, indicating a better chance to sell your token. Some popular options include the following:\n\nOpenSea . The platform has an excellent reputation among traders. You can find art, gaming, photography, music, and other NFTs. They are well-sorted into different categories, and there are helpful sections like current top buys and trending lists.\n\n. The platform has an excellent reputation among traders. You can find art, gaming, photography, music, and other NFTs. They are well-sorted into different categories, and there are helpful sections like current top buys and trending lists. OKX . It’s a decentralized exchange that supports NFT creation on different blockchains. If you are a crypto trader, you might have had previous experience with OKX, which means you’ll be familiar with the interface when creating NFTs.\n\n. It’s a decentralized exchange that supports NFT creation on different blockchains. If you are a crypto trader, you might have had previous experience with OKX, which means you’ll be familiar with the interface when creating NFTs. Rarible. Rarible is a user-friendly marketplace where you can create and sell non-fungible tokens. It has a list of the latest drops in a visible position, so you’ll get some attention from potential buyers right away.\n\n4. Create Your Digital Asset\n\nThe actual steps might vary slightly depending on the chosen marketplace. You begin by connecting the wallet to the platform. After opening the registration page, the platform will ask for your wallet details. It will be necessary to verify your wallet before continuing.\n\nMake a final decision regarding your digital content. Get everything ready, whether it’s a single item or an NFT collection.\n\n5. Mint Your NFT\n\nThe next step of the process is to create a smart contract, which actually means generating your NFT collection. Begin by adding the media to the website. Now, pick the token symbol and use the wallet to sign the contract.\n\nWe suggest double-checking everything and adding as many details as possible. For example, some marketplaces allow inserting an external link with more info about the NFT. In the description field, write some catchy lines to capture the potential buyer’s attention.\n\n6. List Your NFT for Sale\n\nSource: Pixabay\n\nThe non-fungible token should now be in your wallet. Click a “sell” button next to it, and you’ll have the option to pick the token’s price. The sale can be time-limited, so set the desired duration.\n\nIf everything is ready, you can proceed to publish the listing. Your wallet will be used to sign several transactions. Some chains and marketplaces charge listing fees, but these are usually affordable. You can check Bitcoin NFTs if you’d like to explore non-fungible tokens on this blockchain.\n\nConclusion\n\nThe most important part of NFT creation is devising a unique and attractive idea of the digital content that the token will represent. If you have a unique item, creating an NFT shouldn’t take more than a few minutes. Once you have a wallet ready, pick an Ethereum NFT marketplace and sign up to make your first collection.\n\nAfter listing the NFT for sale, consider advertising it on social networks or promoting it in another way you see fit. That will increase the chance of the token getting sold, as well as the fee you receive."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQVXppMnA5VUNRZUxOYktHbnBGQUlkOU14OGkwemtkazJ1by0tZE8zaHhyX0d1SzJZU29IU2J2UlZVV0hadDF6bENDLXRHZDhZbElJSTlRTDEtaDN1MG9Vb0RNYnQzRWp3RDdzOHNYMkFUV0RlUjFEeE5RZmkzbnNBd3lxTWpCNW5fVXRSemgxLXJkOEpo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Exploring Blast (BLAST): A Yield-Bearing Ethereum Layer 2 Solution - Blockchain News",
        "content": "Exploring Blast (BLAST): A Yield-Bearing Ethereum Layer 2 Solution Darius Baruo Discover Blast (BLAST), an Ethereum Layer 2 protocol offering yield on ETH and stablecoins. Learn about its features, tokenomics, and how to buy BLAST.\n\nBlast, an Ethereum Layer 2 solution, is making waves in the crypto community with its unique integration of native yield for ETH and stablecoins. According to blog.bitfinex.com, this protocol distributes yield from decentralized sources like ETH staking and on-chain T-Bill protocols directly to users, offering a 4% yield on ETH and a 5% yield on stablecoins.\n\nKey Features of Blast\n\nBlast operates as an EVM-compatible, optimistic rollup, making it easier for users and developers to benefit from higher baseline yields without altering the familiar Ethereum experience. A standout feature is its auto-rebasing mechanism, which adjusts balances in user accounts to reflect accrued yield. This mechanism is applied natively for Externally Owned Accounts (EOAs) and can be optionally enabled for smart contracts, allowing seamless integration with existing Decentralised Applications (DApps).\n\nThe yield generation is facilitated by Ethereum’s Layer 1 staking rewards, particularly through protocols like Lido, which automatically transfer yield to Blast users via the rebasing mechanism. Additionally, users who bridge stablecoins to Blast receive USDB, a stablecoin whose yield is derived from MakerDAO’s on-chain T-Bill protocol. This ensures users benefit continuously from competitive yield rates, whether they hold ETH or stablecoins.\n\nGas Revenue Sharing Model\n\nAnother notable feature of Blast is its unique gas revenue sharing model. Unlike other Layer 2 solutions that retain gas fee revenue, Blast redistributes this revenue back to DApps programmatically. This allows DApp developers to either keep the revenue or use it to subsidize gas fees for their users, promoting a more cost-effective and attractive environment for DApp usage.\n\nWhat is the BLAST Token?\n\nThe BLAST token serves multiple pivotal roles within the Blast ecosystem. It is essential for governance, allowing token holders to participate in decision-making processes regarding protocol upgrades and yield strategies. This decentralized governance model ensures the community has a significant say in shaping the platform’s future.\n\nBLAST tokens are also crucial for staking within the ecosystem. Users can stake their tokens to secure the network and earn rewards in return. This staking mechanism incentivizes users to contribute to the network’s security and helps maintain the ecosystem's overall health and stability.\n\nAdditionally, BLAST tokens facilitate various transactional activities within the ecosystem, such as paying for transaction fees on the Blast Layer 2 network. This ensures operations are cost-effective and efficient, given the high gas fees often associated with transactions on the Ethereum mainnet. The transaction fees collected in BLAST tokens are redistributed within the ecosystem, supporting further development and incentivization.\n\nBLAST Tokenomics\n\nThe Blast airdrop initiative rewards early adopters and participants within the ecosystem. Users can earn Blast Points and Blast Gold through activities like maintaining balances in ETH, WETH, and USDB, or participating in DApps on the platform. Points are distributed automatically based on the balance held in users’ wallets or smart contracts, and users can earn multipliers by engaging with highlighted DApps.\n\nDespite the active engagement through the airdrop, detailed information about the tokenomics of BLAST is still pending. Users are encouraged to join the Blast community to stay informed about the latest developments, including updates on the airdrop and detailed tokenomics.\n\nHow to Buy BLAST\n\nTo buy BLAST with cryptocurrency, log in to your Bitfinex account, go to the Deposit page, choose the crypto you plan to buy BLAST with, generate a deposit address on the Exchange wallet, and send the crypto to the generated address. Once the funds arrive, you can trade them for BLAST.\n\nTo buy BLAST with fiat, log in to your Bitfinex account, get full verification, go to the Deposit page under the Bank Wire menu, choose the fiat currency for your deposit, check your email for wire details, send the funds, and once they arrive, you can use them to buy BLAST.\n\nBlast also offers mobile options for on-the-go purchases.\n\nBLAST Community Channels\n\nFor more information and updates, visit the Blast website, follow them on X (Twitter), or join their Discord community."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQSHltS01yc0pETTIzcFFJVG5NNzBHUTF6RGxiMlJUUkpvNEt2UlIwdjZYQmpURFkxc0c5bTViZXJ5dzhPX3JXQWFiWS02Z3J3S3NuZk02RE9Xa0Q5cUtuT1ZBaTNGaktIMVNMU0paWU1vTFFBRTQtNWx0alpWNHhBSllZaVZCWlBhRERteFJNeFNrS1B5bVFkLUZfemcwaHpScWlZQ3E4aXQweFlWQ1F6S1pWY0lJamNHM1FhUXFWdlM0bnFtaHV2c283cmNYR2hkQWg2WDNfVzJqQkVobncxN2xYN1lqcmoz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Top Trader Is Long Bitcoin, Ethereum, Short Litecoin, Cardano...And Thinks Shiba Inu's Time Has Passed - Benzinga",
        "content": "Crypto researcher Trade The Flow on Thursday offered trading ideas to navigate the current sideways price action in the crypto markets.\n\nWhat Happened: Trade The Flow suggested that long/short pair trading could be an effective strategy in these choppy conditions and offered several trade ideas.\n\nAmong his suggestions were long positions on Bitcoin BTC/USD and Ethereum ETH/USD, paired with short positions on Litecoin LTC/USD and Cardano ADA/USD, respectively. He reasoned that BTC and ETH are leading the market and have potential catalysts ahead like the Ethereum ETF, while LTC and ADA lack network effect and real activity.\n\nAmong his many strategies, he suggests longing Pendle PENDLE/USD, and shorting Ondo Finance ONDO/USD. Although both have similar narratives there are huge discrepancies in their protocol metrics.\n\nIn the meme coin universe, he includes longing Pepe PEPE/USD and shorting Shiba Inu SHIB/USD, as the former is the most established meme of crypto culture that continues to catch a lot of market attention. Shiba Inu's time has passed in his opinion.\n\nMeanwhile, on the PEPE/ETH pair, the trader stated, \"If you see PEPE as a high beta for ETH, then this pair trade can smoothen a bit your drawdown if the market is down, but you still have a lot of upside if it goes up.\"\n\nAlso Read: Here’s How Bitcoin And Altcoins Will Behave ‘Until Fed Cuts Rates,’ According To Veteran Crypto Analyst\n\nWhy It Matters: Trade The Flow’s insights provide a unique perspective on the current market conditions and potential trading strategies. His suggestions for long/short pair trading could help traders navigate the market’s volatility and potentially generate profits even in a bearish market.\n\nHowever, as with any trading strategy, traders need to do their research and consider their risk tolerance before making any trades. As Trade The Flow himself noted, \"There are infinite combinations of pair trade, and this is just a glimpse of some of them.\"\n\nThe trader added that these types of trades enable to be more market neutral and smoothen profit & loss to the downside and build a bigger position.\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Raoul Pal Foresees Crypto Boom In Election Year’s Q4, Names It ‘Banana Zone’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQMXNDekJNR3RhMXRlTWdnTVMtMTB4NDVMY3RMZUlGcElfRF81Y0xpNGpQYW90MVlHQnBxamQ4MTdNU05ZWkVuczJYSmZVS0M0OXRKOTJQMThralpwazRHQkhvWUstSTduemlBbzU5Zlg2bW9VWkZKaFZtYVdRNWZZQ0hrS2JIVTR0ZGRwR1U5WHg0QUJtck9KUEFhd0F5OGxpd3ZQRFNtRTNEWXpGVkdhbDcxZG45NjhvV0N3WUN1cTBPaUJENG5Od19YeVFhbk4wR1dKVkx2SdIB1wFBVV95cUxQMXNDekJNR3RhMXRlTWdnTVMtMTB4NDVMY3RMZUlGcElfRF81Y0xpNGpQYW90MVlHQnBxamQ4MTdNU05ZWkVuczJYSmZVS0M0OXRKOTJQMThralpwazRHQkhvWUstSTduemlBbzU5Zlg2bW9VWkZKaFZtYVdRNWZZQ0hrS2JIVTR0ZGRwR1U5WHg0QUJtck9KUEFhd0F5OGxpd3ZQRFNtRTNEWXpGVkdhbDcxZG45NjhvV0N3WUN1cTBPaUJENG5Od19YeVFhbk4wR1dKVkx2SQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Dogecoin, Solana, And Cardano ETFs Could Follow Spot Ethereum ETFs – How The Crypto Market Will React - Blockchain News",
        "content": "Could Dogecoin ETFs, Solana ETFs, and Cardano ETFs follow on the heels of Spot Ethereum ETFs? Industry experts believe so. Meanwhile, ETFSwap provides the most secure platform for trading Spot Ethereum ETFs.\n\nNotable figures in the crypto space predict that the approval of Spot Ethereum ETFs will launch an avalanche of proposals for Dogecoin ETFs, Solana ETFs, and Cardano ETFs. Meanwhile, ETFSwap (ETFS) is garnering increasing attention from traders for its unique offering of diverse ETFs on a user-friendly platform equipped with industry-leading AI trading tools.\n\nWhy Traders Say They Have “The Best Trading Experience” Trading Spot Ethereum ETFs On ETFSwap (ETFS)\n\nETFSwap (ETFS) is a platform for trading and investing in tokenized exchange-traded funds (ETFs) listed on the blockchain. It enables investors to diversify their portfolios with secure, legitimate tokenized assets backed by real-world securities purchased from traditional financial markets. This is possible because ETFSwap (ETFS) works with MiCa-compliant regulated investment banks to deal in securities and crypto trading.\n\nETFSwap (ETFS) offers traders the potential to earn heightened profits with up to 10x leverage on all trades, 50-60x leverage on perpetual futures and options trading, as well as optimal liquidity. The platform also provides the tools and support to manage leveraged trades effectively so traders can take advantage of opportunities while mitigating risks.\n\nUsing advanced AI-powered tools like the ETF Screener and ETF Tracker, ETFSwap (ETFS) investors are empowered to make better-informed trading decisions. With artificial intelligence, these tools analyze large amounts of market data to identify trends and provide insights into the best assets to invest in for maximum profits.\n\nETFSwap’s (ETFS) responsive, easy-to-use interface has drawn praise from traders using the platform. They say they always easily access the features and screens they need, whether they are executing trades, checking their portfolios, staking ETFS, or trading perps.\n\nSpot Ethereum ETFs Approval Could Pave The Way For Dogecoin ETFs, Solana ETFs, And Cardano ETFs\n\nFollowing its declaration of Ethereum (ETH) as a commodity, the SEC announced it should fully support the Spot Ethereum ETFs by the Summer of 2024. Industry experts say this could open the doors for Dogecoin ETFs, Solana ETFs, and Cardano ETFs to enter the crypto market.\n\nCanadian firm 3Qi has filed a proposal with securities regulatory authorities in Canada to approve what could be North America’s first Solana ETFs. If granted, US Solana firms could start filing proposals for Solana ETF approval with the SEC, and Dogecoin ETFs and Cardano ETFs may follow.\n\nCardano ETFs may also enter the crypto market before long. Cardano (ADA) is the 10th largest cryptocurrency on the planet by market capitalization and boasts a more secure and scalable blockchain than most others. With its oft-intense competition with bigger blockchains, Cardano ETFs could receive approval soon after Solana ETFs.\n\nDespite Dogecoin’s (DOGE) status as a meme coin without much utility, gaining approval for Dogecoin ETFs is not impossible. Dogecoin (DOGE) is currently ranked 9th among the biggest cryptocurrencies in the world, one place above Cardano (ADA). So, it is well-positioned to lead meme coins to an age of institutional usage with a Dogecoin ETF. When the proposals start pouring in, Dogecoin ETFs could be among the first to receive approval.\n\nHow Dogecoin, Solana, And Cardano ETFs Will Impact The Crypto Market\n\nFollowing the approval of Bitcoin ETFs earlier this year, Bitcoin (BTC) saw a price rally of up to 75% as Whales poured 2,212 BTC into US Bitcoin ETFs. A similar trend is expected for Dogecoin ETFs, Solana ETFs, and Cardano ETFs once they gain approval.\n\nAlthough bearish market conditions have since sunk Bitcoin’s (BTC) price, tokenized assets are receiving favorable attention. According to Rajagopal Menon Vice President, WazirX, about $2 billion was invested into Bitcoin ETFs over the last week. Ethereum (ETH) also saw a 22% price surge following the SEC’s approval of Spot Ethereum ETFs.\n\nConclusion\n\nDogecoin ETFs, Solana ETFs, and Cardano ETFs will inevitably follow the SEC’s approval of Spot Ethereum ETFs. Till then, investors can trade Spot Ethereum ETFs on ETFSwap (ETFS) and earn heightened profits by investing in ETFSwap’s native cryptocurrency ETFS, which analysts believe will make over 200000x.\n\nThe token is currently on presale at $0.01831 and more than twenty-six million tokens have been sold. Investors can accumulate more tokens with the ongoing 20% promo to maximize their returns.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQT25NWTNOZklDQ2oyS2JIOVp5RnBtLTJxUmxwb3htcnZSSjBGTGFWV0ZpbkktcDU1c0w4a2s5RGJRaU5hd1BVVnhUeGJfMTVZWWlyQ0xkTXFwVmtGRUZWSlVVdTBibE92ZVVwWTJHMEYtVm9tNG5Xd2VmY2E3NmlmdXYtNDdlX2NPaG10NTdlaDRqT2otNWhKVEJKaDF6bzhLRWt2SnVCUWFVX2JsMXN2ZDFYYnhhemJpa0JhU1JJZENoYjVkYzBQbWFQOXNaR0s5RVYyV3RqcjNCNWps0gHiAUFVX3lxTE1GYjJSWFBfaF9qTEIyLTE1czRTN09oTkR4NnlhZ0xsU2VpN1p3REJKT3VnN0FLUG9BZ0FQdWxTSEhmZUMwQnRUQjRVRXRGQzRZWmk0b3F6SjVSbWtCX182cUpvZzNKdG1pdl93SnhpSm05OFhSUGtBTFpPbWZ6a3k4d3NkUnFVU0oyNllSM29xbWR6R0NYaWdSTjVPcTVzd3N1My1NM0xMSVN1QXNiQTdnNWZ2UWFiSEhhY3Atc0ZjMDJvWWsxZG9YVm94d0RmWTk5VVR5eU8zeEk1bFFQYnI2ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC struggles around the $62,000 level - FXStreet",
        "content": "Bitcoin price faces pullback resistance at the lower band of the descending wedge around $62,000.\n\nEthereum price finds support at $3,288, the 61.8% Fibonacci retracement level.\n\nRipple price faces resistance at $0.500, its daily resistance level.\n\nBitcoin (BTC) encounters resistance near the $62,000 mark, while Ripple (XRP) mirrors BTC's challenge around the $0.500 level. Meanwhile, Ethereum (ETH) finds solid support around the critical price point of $3,288.\n\nBTC faces resistance at the lower band of the descending wedge\n\nBitcoin's price broke below the descending wedge on Monday, declining approximately 7.5% to retest its crucial weekly support near $58,375 and rebounded by 5.8% on Tuesday.\n\nSince Tuesday, BTC has faced resistance at the lower boundary of the broken descending wedge. At the time of writing, it trades around $61,704 on Friday.\n\nIf the lower boundary of the descending wedge around $62,000 holds as resistance, BTC could decline roughly 5% to reach its weekly support near $58,375.\n\nOn the daily chart, the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are below their respective neutral levels of 50 and zero. This indicates that, according to these momentum indicators, the bearish sentiment prevails, suggesting the potential for further decline in BTC’s price.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes above the $63,956 level and forms a higher high in the daily time frame, it could indicate that bullish sentiment persists. Such a development may trigger a 5% rise in Bitcoin's price, revisiting its next weekly resistance at $67,147.\n\nEthereum price looks promising\n\nEthereum price retested its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27. ETH rebounded by 5% from the 61.8% Fibonacci retracement level and trades at around $3,457, edging up approximately 0.3% on Friday.\n\nIf this support at $3,288 holds, ETH price could rally 8% from its current trading level of $3,457 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are both below their neutral level of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective neutral levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price shows resilience\n\nRipple's price currently trades at $0.476, below the daily resistance level of $0.499. Despite Monday's fall in Bitcoin’s price, XRP has shown resilience in its price action.\n\nIf Ripple's price surpasses the barrier at $0.499, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nIn the daily chart, the Relative Strength Index (RSI) is currently below the 50 mark, indicating neutral to bearish sentiment, while the Awesome Oscillator (AO) remains below zero, suggesting bearish momentum. Both indicators must rise above their critical thresholds of 50 for RSI and zero for AO for a sustained bullish trend. Such a development would bolster the ongoing recovery rally in the market.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT daily chart\n\nHowever, if the Ripple price daily candlestick closes below $0.450, marking the June 7 low, it would invalidate the bullish outlook by establishing a lower daily low. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQT21lVmlnNng2QVgyZ3JXbzA0UlZSYUlFMnNNVmptZGFrODNRajBQcGlYQzJKWmFvY2FfWDh0VlJkR1J6Q0pxbDV0S0JMMUs0WkthNGVXM01kMXBtc3V0NktjTThIQlhOMjZXUGoyYlh0dHVvd3B0dlB2QnZmMzlWWGU1UENaeXRtcks4WmFldElHLWdHODhkaVZ2WFdkM2N2UzNnaUdwUFHSAa4BQVVfeXFMUFZoNkxwNmNQYU1nQW5jNXFleU1PUGhYZjJKcWJSVGtjSHZ4eHZMclFmTnJ3bVowMU95RHk2MXo1TGZnLW9yQnVfSmJHMDBHTS1ycjZaS1laanowT0F2RG1FTFBnb0NMc0ZEcVFpekxNeG1aZXhjZWdFdEVENkNxN2Q2YS1vMktfSTFZOWRBLW14VE54M2lnSkoxVnNVN0FTZjBrZERVZE43VC00WGtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "ETH Increases Toward $3.5K, Erases Much of Earlier Losses (Ethereum Price Analysis) - CryptoPotato",
        "content": "After a bearish correction phase, the price has now reached a crucial support zone, defined by the 100-day moving average and the 0.5-0.618 Fibonacci levels.\n\nGiven the strong demand at this juncture, a mid-term bullish rebound is looking likely.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA detailed examination of the daily chart reveals that Ethereum has entered a significant support zone following a corrective pullback. This zone spans the price range between the 0.5 ($3421) and 0.618 ($3289) Fibonacci levels, coinciding with the critical support of the 100-day moving average ($3387).\n\nThis area is poised with potential demand, where market participants might be inclined to open long positions.\n\nConsidering these factors, an increase in demand is expected, leading to a mid-term bullish reversal targeting the $4K resistance. However, if the price drops below this support, the next significant defense line for buyers will be the 200-day moving average.\n\nThe 4-Hour Chart\n\nThe 4-hour chart clearly shows Ethereum’s recent corrective move, with the price forming a bullish continuation flag pattern.\n\nIf the price breaks out from the upper boundary of this pattern, it signals a potential continuation of the bullish trend. Currently, the cryptocurrency is near the lower boundary of this flag, aligning with the critical support of around $3.3K.\n\nIf buyers re-enter the market and demand rises, the price is expected to break above the flag’s upper boundary at $3.6K, leading to a strong uptrend towards the $4K resistance.\n\nConversely, if sellers push the price below the $3.3K support, a drop toward the substantial $2.9K support will likely follow. In the mid-term, the price is expected to remain within the $3.3K-$3.6K range until a breakout occurs.\n\nSentiment Analysis\n\nBy Shayan\n\nWhile Ethereum currently rests in a critical support region with significant potential demand, analyzing the future market sentiment is essential for forecasting its next moves.\n\nThe following chart highlights the Ethereum funding rate metric, which indicates whether buyers or sellers are executing orders more aggressively. Positive funding rates suggest bullish sentiment, whereas negative rates imply bearish sentiment.\n\nThe funding rate metric recently showed a notable increase after a period of slight declines, which coincided with a corrective phase in Ethereum’s price.\n\nThis uptick suggests that demand is present near the crucial support level of $3.3K, potentially halting further downward pressure and initiating a bullish reversal. If the funding rate metric continues its upward trend, it indicates that the futures market sentiment is turning bullish, making a mid-term bullish reversal more likely."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQODc1RnZ3aGxhekdFUTd5QjJXOWZDQWNBelNiOW9DTjUybVIwSEFNQXpKYnQwMVE3bWlhNDFqSHhOaUM4TnFNcWhPbWRPdTRORm0xWkZIM2Z2N1NYY1NuQW5IOGdNTjNWWVdSejBrSFZ4a3R0TzhxY2VLYTNGS3VQcEN6T1ItN03SAYwBQVVfeXFMT0VFMXNFZ1ZXLWVpRVBLSm5JRFVtSzFMc2FULUhQT1VOSm1LUVpHdlYxbERlWm5Zd1N5dWwtY1NlMVNNcXVuU0pESU9vby1RVDktOHJlUVhjcldiZHlOcm5LNU5fTTJTUmtNbHdQSzlYeTByNEpFbzBzVUpvdHlZa2JTN0V3Y2lnLXowUFA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "PEPE Whale Shifts Focus To Ethereum As ETF Optimism Builds - CoinGape",
        "content": "The latest on-chain insights reveal that a crypto market whale has strategically switched funds from PEPE to ETH amid optimism building up around the launch of an Ethereum ETF. Following the submission of eight S-1 amendment filings, this swap of funds has emerged, portraying optimism for ETH’s future price movements. Meanwhile, it’s worth noting that Pepe coin has also recently emerged as the talk of the crypto town, surging to unprecedented levels.\n\nSo, let’s take a deeper dive into the whale’s strategic investments and what it could mean for future market performances.\n\nadvertisement\n\nWhale Diverts Funds To ETH\n\nAccording to data revealed by EmberCN on June 28, the whale 0x837 has been recorded switching 1.4 trillion PEPE to 2,646 ETH.\n\nThe trader transferred 1.4 trillion PEPE, worth $18.01 million, to Binance. Subsequently, a withdrawal of $9.04 million worth of ETH took place from the same exchange.\n\nIt’s worth noting that these accumulations happened at an average price of $3,416. Also, market sentiments have tilted towards optimistic for Ethereum, primarily with the whale’s massive accumulation.\n\nThe whale activity also comes in light of recent optimism on the ETH ETF. As mentioned above, eight firms, including BlackRock, Fidelity, 21Shares, Grayscale, Franklin Templeton, VanEck, iShares, and Invesco, have submitted S-1 amendment filings.\n\nNate Geraci, ETFstore President, further took the stage to claim that the ETH ETF launch is imminent, expected to be in 2-3 weeks.\n\nMeanwhile, ETH & PEPE prices experienced considerable gains today.\n\nAlso Read: AVAX Price Rally To Surpass Solana Price Surge: Santiment\n\nETH & PEPE Price Performance\n\nWhile writing, PEPE’s price showed a 1.39% upswing to trade at $0.00001244. On the other hand, the ETH price chart showed a 0.86% upswing in value to $3,453.94.\n\nConversely, Coinglass data illustrates a 1.75% drop in Ethereum’s Futures OI to $15.19 billion. The derivatives volume tumbled 6.47% to $19.08 billion. This data flags reduced investor interest in the asset, birthing contrasting market sentiments on future movements.\n\nSimultaneously, PEPE’s OI saw a 3.94% pump to $142.37 million, whereas volume dipped 6.94% to $977.38 million.\n\nAlso Read: Bitcoin Miner Capitulation Ended? On-Chain Data Signals Market Recovery\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQSjdmWUpOUUVKeGpxakU3TjNQc0dBQ0RTdWZOa3VIX2RNblVxTTRubEFJQVJweDFXRDJSanM0LWZzRUtCdE1GVTJWM19lM0kxS2R5NU8xX1FKaVlkN3dRc0phQUtkY1dGY0x6YjhJS1hvcHRXNGZQdHNzUXVRcFphNGJTREYzcHV1dkRBeUVmQ2tOS09OTkxvSTUzUVJaYXg2Y2x2YXZXakQwQjdHYlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Artificial intelligence (AI) sets the price of Ethereum (ETH) for July 1st - The Cryptonomist",
        "content": "In the midst of the media campaign for the approval of Ethereum ETFs, artificial intelligence (AI) has ventured some price predictions for ETH.\n\nToday, ETH experienced a brief recovery, reaching a high of $3,418. However, this rise was followed by a significant drop, bringing the price to $3,355.39 with a daily decrease of 1.84%.\n\nThe price movements of Ethereum (ETH) and the use of AI as an evaluation tool\n\nThis volatility has sparked the debate on what the price of ETH (Ethereum) could be in the near future, and the use of artificial intelligence (AI) to predict such movements is becoming increasingly popular.\n\nArtificial intelligence is revolutionizing many sectors, including financial markets. AI algorithms can analyze enormous amounts of data in real-time, identifying patterns and trends that might escape the human eye.\n\nThis makes AI a valuable tool for predicting the price movements of cryptocurrencies like Ethereum.\n\nOne of the main methodologies used by AI for price prediction is sentiment analysis. This process involves collecting and analyzing data from social media, forums, financial news, and other online sources to assess investors’ sentiment towards a particular asset.\n\nFor example, a general positive sentiment could indicate an increase in price, while a negative sentiment could predict a decrease.\n\nAnother common approach is technical analysis, which uses historical price data to identify trends and patterns. AI algorithms can analyze this information much faster and with greater precision compared to humans, providing more accurate predictions.\n\nFor Ethereum, technical analysis might include the study of recent price fluctuations, trading volumes, and other technical indicators to predict future price movements.\n\nIn addition to sentiment analysis and technical analysis, AI can also incorporate macroeconomic and market factors to provide more comprehensive forecasts.\n\nFor example, the impact of regulations, technological development, and the adoption of Ethereum’s blockchain can all influence the price of ETH. AI algorithms can aggregate and analyze these factors to offer a more holistic view of the market.\n\nThe price predictions of ETH\n\nFor July 1, 2024, the price predictions for Ethereum based on AI vary depending on the model used and the data considered.\n\nSome models predict a price increase thanks to the introduction of ETH ETFs, which could attract a greater number of institutional investors and increase demand.\n\nOther models, however, indicate that the current global economic difficulties and market volatility of criptovalute could continue to exert downward pressure on the price of Ethereum.\n\nFor example, if the introduction of ETH ETFs were to lead to a wave of institutional investments, the price of Ethereum could rise significantly, potentially surpassing historical highs.\n\nHowever, if macroeconomic conditions were to worsen or if new restrictive regulations were to emerge, the price of ETH could continue to fall.\n\nConclusions\n\nIn conclusion, the use of artificial intelligence to predict the price of Ethereum offers a powerful tool for investors.\n\nHowever, it is important to remember that, despite the advanced analytical capabilities of AI, predictions are never 100% certain. Cryptocurrency markets are notoriously volatile and influenced by a wide range of factors.\n\nTherefore, investors should use AI-based forecasts as one of the many tools in their decision-making arsenal and continue to closely monitor market conditions."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQenpMOTVnc3FaY3ZaVm05UzZQQnNBRzF2ZV9GRzRCMFBza3FHai1TMWcwSkF6TTNnbXJrLS10cXdyaHU2Nng1RHpWc2toV2JZQ0ZIMEhIRG9VckIxVDFqMGZ3emliSzN1UmF2RW5WU3N4RG05SDNWQWwwTC1PWWR2d205cVVLVnQ2MlRtZFNRWk1RZ0JPM1N3alZmNnDSAaIBQVVfeXFMTnRMVVFOUEFTMnJvczJpY080WFB3OXpXTWEwb1lMZXhNVGt4cDRyazhIMWtBZkRDMFpCLU04clZpd3ZwbV91ckpnTHl1S0h2SlVrbTUtWm10Qkp1N3FIaXlwQWtrWmVNbC1lX2I3c3BRWnN2S0ttVW10T1dCZklBTGt1RjBRSFFyMnBYSjFLaVJjRWt1ZFJKeWVFNmVtWkJzMGtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "$102 Billion in Bitcoin and Ethereum Options to Expire Today: All You Need to Know - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAn enormous $102 billion in Bitcoin and Ethereum options are set to expire, which should push the volatility of the cryptocurrency market upward again - 107,000 BTC worth $6.6 billion and $3.6 billion worth of Ethereum.\n\nAdvertisement\n\nWith their impact on price dynamics and investor behavior, options play a critical role in the cryptocurrency market. A derivative known as an option gives buyers the right but not the responsibility to purchase or sell an asset at a fixed price prior to the contract's expiration.\n\nDue to traders and investors' adjustments to their positions, the volume of options scheduled for expiration can cause large price swings. Understanding these market fluctuations requires a special grasp of the max pain idea.\n\nJune 28 Options Data\n\n107K BTC options are expiring with a Put Call Ratio of 0.5, a Maxpain point of $57,000 and a notional value of $6.6 billion.\n\n1.04M ETH options are expiring with a Put Call Ratio of 0.59, Maxpain point of $3,100 and notional value of $3.6 billion.\n\nToday is… Advertisement June 28, 2024\n\nThe maximum pain is the price at which the greatest number of options contracts (calls and puts combined) will expire, resulting in the greatest possible financial loss for options holders. This target is $57,000 for Bitcoin and $3,100 for Ethereum. Due to market makers' attempts to reduce their payouts, the price of the underlying asset frequently tends to move toward the maximum pain point as the expiration date draws near.\n\nThe crypto market has faced difficulties in June, with a more negative outlook as the prices of ETH and BTC have gotten closer to their respective maximum pain points. Such closeness suggests that many options holders were unprepared for these price levels, thinking them improbable.\n\nWhen traders unwind their positions and market makers hedge their exposures, the expiration of such a large volume of options may cause volatility to increase. Another important metric to take into account is the Put/Call ratio.\n\nThe ratio for Bitcoin is 0.5, meaning that there are more call options than puts. Ethereum exhibits a similar trend with a ratio of 0.59. Despite the recent market correction, these ratios point to a general bullish attitude among traders."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOWVZfUlhHbndPbzZHTkRjbnAxODA1U2d5VExkel90cFlkSW1LVzJaY3N6YzV3ZWJmNkdaMjlTcHRsNlg5V0c3MkVZOE0ySXpoclRwRkpBRkpYWXFETkgzX2dVdjNCN2p1YlRiMjhtLXlJZ1c5MFo3b1RLb3RMQ2xscEcxMzFfeU1iamdaMlpWMGxiSGE0NXg3VmJvVHBxeEZ0Yk5Uc19GS3k1Y3Zp0gGyAUFVX3lxTFBWQnhDUDJiZUFiaWhMMFU4alEyUUpiNm1vZElKT3lDbUNYV0xZM0pyOUVaZElpb2tOZmN6a2JBSjdyUld4dHVEd05VRWZTNExpUzd0Tjg3cE5IODBPbGlqZGNRV25nWGRoNlJ0NE5EOUxDc1RxcDU4RUlPZUd3MWdBM21jZzQtWUcwdldIbTlEazBaVG5ZaDdIakhNR2pFT0Y0cWg3MTBYbE1KdTZrTzZaN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Is Ethereum Price Poised For $4000 As Spot ETF Trading Nears? - CoinGape",
        "content": "Ethereum has defended support at $3,200, subsequently keeping at bay calls for an extended correction to $3,000. In light of the spot Ethereum ETF trading in July, sentiment in the market is bound to improve and propagate a rebound to $4,000 and higher in the same month.\n\nA 20% Ethereum Price Breakout Could Happen Before End of June\n\nadvertisement\n\nETH price action is interesting as inside the giant ascending triangle, a falling wedge is forming. In fact, the falling wedge has formed for the last month, and room for price action movement is thinning out. Falling wedges are generally bullish market structures since they have a higher probability of breaking to the upside.\n\nThe Ethereum price action is trending below the 50-day but above the 200-day simple moving average (SMA), indicating a tussle between the bears and the bulls.\n\nIf the price of Ethereum breaks above the falling wedge, it could trigger a 20% move that restores the asset back above $4,000. On the flip side, Ethereum has robust support at around $3,000 to hold the price up.\n\nThe lag in ETH price (despite the increasingly positive fundamentals) may be instigated by Bitcoin, which has left many market participants in a state of panic as it encroaches near a dangerous support level.\n\nBitcoin price dropped 1.59% yesterday and closed the day at $60,807. While today the price is slightly up, it still doesn’t constitute good news.\n\nThe whole region between $60,198 and $62,252 is a danger zone as a close below this range could result in a larger price drop to the $50,000 support level.\n\nOn a positive note, if Bitcoin price manages to bounce off this level, we may witness a surge to $70,000 soon after.\n\nEthereum Price Lags Despite Positive Fundamentals\n\nEthereum price action is setting itself up for a break to the upside in anticipation of the approval of an Ethereum ETF by July. U.S S.E.C Chair Gary Gensler told a Bloomberg Invest audience that the Ethereum ETF approval process was “going smoothly”. In a separate interview with the Financial Times, Gensler signaled that the ETFs would begin trading soon. These developments have Ethereum investors at the edge of their seats for what could be the biggest ETH and altcoin run in the history of crypto.\n\nBottom Line\n\nBTC is experiencing downward pressure, with ETH showing promises of a significant breakout. As Bitcoin approaches the critical $60,000 support level, this price action may signal a short-term bearish sentiment in the broader crypto market, warranting caution and strategic decision-making.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxPcjVobXVmRGtybm9DWUxwT0FsNWg0T2wxQ09VZmlwUW9Ka2FYbktEX0dMa2xYSmI3cGZoZ3pxV05jN09EYy01YWh3NHc0WTNaaGJnYlpaUGxKTnNmTGpxNW1FbXpzbFY1S1c0SXlzRFZRWGFIOXIxSzZBeENDbFlUaVJ4UUwxclp2YndZdmtqbThieS0xalR0RV85ZWlKOEVPLTR4S2NRdzRvTVVTRWpzc2Zzc0FtUHhqZHpaYmFkdUk0YWJ6dURrRjh2UUIzRlNpbEp3WjJ0RlAtN3BXZlFVYlY0bEZ4djVoalNDbFhkbWVFWldiRE1yN0o5YmU4MU1XaWtGbkVNVzRBS095b1HSAZMCQVVfeXFMTzU2Vi1RbzFuTVZvWFRmci1wcXkxcGhjaVhBVkQ1ZlBsUF9XV0VHVVMtWjB4MmlEcmJQTlZteFZlTnRaYU9NNHNORzgxRHEyamEwTHRsN1hZLVFGUmZUWDcxcWRXVzdCd1pRMkVrV2pzTnNhSThoTnZLeXd3Z0l2cTZ3N3R2cDJPTlRzMWNOc21XLXBiTlEyMXRsYmxyUG5DakZKcWJ5NV9hVVJoQU95cWhVNmxsTllUWThaUHJVb3ZGY29aTC1tcFpMdDlzc1ppQWtOelVfN1NnaXoxRE5Mc25DOGE2QUNsbFBYeWtqVGpIb3VDRGFibDlYY0FVMTY2YUIzTWJLRWx4YkYwNGVDbTBtVnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $60k but down 1.5%. Ethereum, BNB, Solana, Dogecoin, others fall u - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOOXZaN2NpNU5RTzJ0TWlrSnR3WVBRUG9FSmwxc1RCYzc1aUVwQWhiN2hvNXJBeC1jemVKcUhTeUJkY1RnbjFyb2x6dUpVd0NRam9KdmNMVHE4SHM2VGdlcFJINi1WM2VoRWh2Z1lfQl9XWDJDY0Q3VzkzSkNhckZ3cXphdFZiYnVkTFc3cE9RTUlfRE5za3BSNEc1V1h1VTUydS00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Gears Up for Takeoff as ETF Approval Rumors Swirl - FX Leaders",
        "content": "eth-usd\n\nEthereum (ETH), the world’s second-largest cryptocurrency, is poised for a potential breakout as whispers of a long-awaited Ethereum ETF approval by the US Securities and Exchange Commission (SEC) intensify. This news has sparked a wave of optimism among investors, with analysts predicting a significant price surge for ETH in the coming months.\n\nSEC Nearing Green Light for Ethereum ETFs?\n\nAccording to a recent Reuters report, industry insiders close to ongoing discussions between asset managers and regulators believe an ETF approval for Ethereum could be imminent, possibly as early as July 4th. This news comes after SEC Chair Gary Gensler indicated a smoother approval process for such investment vehicles.\n\nWhat Impact Will ETFs Have on ETH Price?\n\nThe launch of Bitcoin ETFs in the US earlier this year proved to be a massive success, attracting billions of dollars in investments. However, experts anticipate a more muted response for Ethereum ETFs due to its smaller market size compared to Bitcoin.\n\nAnalyst Predictions: Ethereum Headed for $7,500?\n\nDespite some cautious outlooks, several prominent figures in the crypto space are brimming with bullish sentiment. Quinn Thompson, CIO of Lekker Capital, believes the current market conditions present a prime buying opportunity for ETH, with a potential price target of $7,000 by the US elections in November. Additionally, the co-founders of Glassnode, a blockchain analytics firm, have presented a technical analysis suggesting a similar target of $7,500 for ETH, mirroring historical patterns.\n\nEthereum Price Responds Positively\n\nThe recent ETF rumors have already had a positive impact on Ethereum’s price. At the time of writing, ETH is trading at $3,460, reflecting a 3% increase over the past 24 hours. This upward trend is further bolstered by a general improvement in market sentiment and a stabilizing Bitcoin price.\n\nETH/USD Technical Analysis Hints at Further Uptrend\n\nSeveral technical indicators suggest a potential acceleration in Ethereum’s price movement. A breakout above the $3,500 resistance zone could trigger a larger rally, attracting more investors seeking to capitalize on the momentum. This positive outlook is fueled by a combination of factors, including:"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPeWJGNEhVZ1FjMFlrWXRjSF90dEdIZkJPNXJtVWNCWm43TkJLakREalNIaWphM0VXTkpuYko5WHZRUlgyUFlHaldXa29xYXQwY19PYmVKYlZiQVh2NGRUZVdSbHdyTVY4NWNGTVJPLTdNVGlSOFFoY19LNkhaQzFLR2JTZ09FTU1nRFlTcDRkcU1UY0szRENHTkhfdWw5dS1ZcTFhZEJxVGE4X1A1Ml9TMGxFSFl4di1ZcHROY3RFWHZZdEpaUDNnUVdjWkhRWmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ready To Leverage The Spot Ethereum ETFs FOMO? Experts Say These Crypto Presales Are Your Best Bet - Techpoint Africa",
        "content": "With Gary Gensler, the Chairman of the US Securities and Exchange Commission (SEC), recently hinting that spot Ethereum ETFs could be fully approved by September, the FOMO psychology in the crypto market gets even stronger. Hence, major crypto experts say that ETFSwap (ETFS), WienerAI (WAI), and CYBRO are the best bets for anyone looking to leverage the prevailing spot Ethereum ETFs FOMO.\n\nETFSwap (ETFS): The Crypto Investor’s Perfect Bet\n\nETFSwap (ETFS) is poised to pull in massive liquidity from new ether assets upon the full approval of spot Ethereum ETFs as this ecosystem is the only ERC20 provider of exchange-traded funds (ETFs) assets. ETFSwap (ETFS) utilizes the Ethereum (ETH) blockchain to host high-liquid real-world assets like coal gas, oil, gold, and many more on-chain. Users, especially traditional traders, then get to trade these assets via bountiful leverages up to 100X.\n\nWith ETFSwap (ETFS) launching its beta platform in less than 30 days and spot Ethereum ETFs expecting full approval in September, ETFSwap (ETFS) is tipped to be at the forefront of of a revolutionary Web3 era by establishing the first decentralized protocol that provides direct access to leveraged, fixed-income, cryptocurrency, and commodity ETFs. ETFSwap (ETFS) provides all investors with compounded profit-making strategies as they can stake, swap, and buy multiple ETFs across various markets and also earn up to 87% APR.\n\nMore so, ETFSwap (ETFS) bolsters the chances of its users with its custom ETF screener and tracker, which utilizes AI-powered algorithms to provide accurate big data analysis. Crypto experts then say that now is the time to buy into its ongoing presale, which is still selling at a low $0.01831 price - there most likely won't be a better price to make millions.\n\nWienerAI (WAI) Could Be A Good Investment\n\nMajor crypto experts have also tipped WienerAI (WAI) to be a crypto presale that brings bountiful returns upon launch. WienerAI (WAI) is already gaining massive popularity in the crypto space, and the launch of spot Ethereum ETFs is another major boost to the native WienerAI (WAI) token. WienerAI (WAI) combines innovative intelligence technologies with a unique approach to contemporary issues, making it one of the high-potential crypto presales — just like ETFSwap (ETFS).\n\nWiener (WAI) focuses on developing advanced AI solutions to create technology that can be applied in various fields acrrloss all financial borders. Littler wonder crypto experts say that WienerAI (WAI) could be a good investment for when the spot Ethereum ETFs FOMO pervades the entire crypto space, with its presale alreading raising millions.\n\nCYBRO’s Marketplace Set To Boom\n\nCYBRO is another crypto presale tipped to leverage the spot Ethereum ETFs FOMO with its hold-to-earn marketplace. CYBRO is powering an AI-based yield aggregator platform on the Blast blockchain and it is already gaining massive adoption with its ongoing presale rounds experiencing massive buy ins.\n\nWith CYBRO, non-professional crypto investors get to leverage multiple investment vaults and strategies tailored to their investment preferences. More so, holders of CYBRO tokens will receive spacial rewards including airdrops, APR yields, cashbacks, and lower trading fees. It's no surprise then that the ongoing CYBRO presale is expanding daily with new investors as its investment strategies advance both DeFi and CeFi (centralized finance).\n\nConclusion On The Crypto Presales To Leverage The Spot Ethereum ETFs FOMO\n\nETFSwap (ETFS), CYBRO, and WienerAI (WAI) have emerged as the best bets for leveraging the spot Ethereum ETFs FOMO as their ecosystems are well placed for integrative DeFi and CeFi into high-liquid financial investment hubs.\n\nThe ETFS presale is still underway at just $0.01836, and major crypto experts are saying that all crypto investors should not miss this massive opportunity as the ETFSwap (ETFS) ecosystem is the best placed to leverage the spot Ethereum ETFs FOMO.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQOHZjRFd4RTlieGwwd3htYjAyS2VxeTBTRWtJX25uWU8xZHNLeGlGRW93eFVlaGFuWmQzZWVrSUNrektyb3NQZWZGbF9JY1hOYktDLVE2SjhNT3NVVGJKZGRVLWpwOHJ4X0ZZLU5fNlp4dFA2VmUtVDNPaFdpWVAybGwtWmdzcGlTQk5F0gGQAUFVX3lxTE8yVWlYSlpjSXN0TlVsUHVyMDBYWTJmOGkzOXBrVEdLdnNaVkE4enZnVE5CZ29rZjRRMnd4NkRES1ZILTdEdF9CNHlFRm9UMmhaa2V1c0lfZjVmajNVa0kwck5mdmV5LW1GUXZtSTFqZ3ZVQkh1NGhZSlpyRmlUUnlmWHlsaW1FVHdxcGRwb1JLYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum faces inflationary pressure: Will ETF approvals help? - AMBCrypto News",
        "content": "Ethereum has seen an increased inflationary trend recently.\n\nETH was trading at around $3,300 as of this writing.\n\nEthereum [ETH], previously recognized for its deflationary trend, has shifted towards a more inflationary pattern in recent months.\n\nWhile the mechanism to burn ETH—part of its transaction fee model introduced in EIP-1559—has continued, the overall supply of Ethereum has still increased.\n\nThe hope among investors and market observers is that demand for ETH will increase with the finalization of approvals for exchange-traded funds (ETFs).\n\nEthereum becomes more inflationary\n\nThe inflationary trend in Ethereum’s supply has reportedly reached its highest level since 2022, particularly following its recent network upgrade in March.\n\nAccording to data from Ultrasound Money, the total supply of ETH has expanded by over 112,000 ETH in the past four months.\n\nThis increase in supply is largely attributed to the effects of the upgrade, which took place on 13th March.\n\nThe upgrade, part of ETH’s ongoing development and improvement protocol, has had a significant impact on the network’s economic model.\n\nEthereum not easing up on burns\n\nDespite the recent inflationary trends observed in Ethereum’s supply due to the upgrade, the overall balance since the implementation of the Merge remains deflationary.\n\nAccording to Ultrasound Money, over 1.7 million ETH have been burned due to transaction fees, while the total new supply added since the Merge is over 1.3 million ETH. This results in a net reduction of over 344,000 ETH being removed from circulation.\n\nThe ability of this mechanism to outweigh the supply increase from the upgrade maintained ETH’s appeal as a deflationary asset.\n\nSuch dynamics are crucial for its long-term valuation, as the reduction in supply, assuming steady or increasing demand, can lead to an appreciation in ETH’s market price and make it an attractive hold for investors.\n\nEthereum ETFs imminent\n\nThe prospects for the launch of an Ethereum ETF appear more promising, as highlighted by Bloomberg ETF analyst Eric Balchunas.\n\nHe noted that VanEck, a significant player in the ETF market, has taken a crucial step by filing an 8-A form for their Ethereum Trust on 26th June.\n\nThis form is essential for corporations looking to issue securities on national exchanges, signaling a readiness to proceed with the ETF.\n\nEric Balchunas pointed out the strategic timing of this filing, drawing a parallel to VanEck’s previous actions with their Bitcoin spot ETF, which was filed exactly seven days before its launch on 11th January.\n\nThis pattern suggests that the ETH ETF might be following a similar timeline, potentially indicating an imminent launch.\n\nHow it could impact ETH\n\nThe introduction of Ethereum ETFs could significantly impact the market dynamics for ETH.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nBy facilitating broader and more regulated access to ETH for institutional and retail investors, these ETFs could increase demand for ETH.\n\nThis heightened demand, coupled with Ethereum’s existing deflationary mechanisms, could absorb excess supply and enhance Ethereum’s deflationary trajectory."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNdll1ci1WWnFOTm1sd0wzQThPNkNiOVBZQmJ4NGtyZkphTm1JUmtkMGZaVW5BYktheTlLcmdjcmF1cDNkd1RCeXFUQU5RZXZUeTNrX3E5eUJmNm02RjdOVEIxeUhlamJ0V1dRZW1KcE1weHVhaVo5UTZwdFVtYXk5bDhZcFROdkJpRG9Ka1VxM2pLLUly0gGaAUFVX3lxTE8xX2hoUGU3Y3h0YUhoODFCWjdLQzZXZ0c2Qy1ZbjhiVHcxazlqRDk3bWVycktsZ1czUVdOLWh0NHdWdFZCT3d0UkgyaXd6OGtBektOcTJrSkl6V3ZsbkN5VkprXzhiYVc1TXFITUVOamtzR2ozakFiSGtMalhBdEZSeVZJdjMwQUpiVUNDbHBleFF4Qk1DbzVPX0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum bulls have a tough battle ahead: Will these key levels help? - AMBCrypto News",
        "content": "Data of holders in/out of the money provided valuable insights into where Ethereum could halt its downtrend.\n\nTwo network metrics showed increased selling pressure behind ETH in recent weeks that has not yet let up.\n\nEthereum [ETH] bulls were in a pickle after failing to defend the $3.6k demand zone earlier this month.\n\nThe $3600-$3650 region had served as resistance back in March and the first half of April but was breached and flipped to support in late May.\n\nThe Ethereum ETF hype was building for July, but with Bitcoin [BTC] set to face selling pressure from miners and Mt. Gox and a general lack of demand, ETH bulls might have an uphill battle ahead.\n\nA price drop toward the next support zone is anticipated- but where will the correction likely halt?\n\nMajor support and resistance zones\n\nAMBCrypto observed that the in/out of money around the price data from IntoTheBlock showed a large amount of ETH was bought in the $2970-$3171 zone, amounting to 2.28 million Ethereum.\n\nAs the price approaches this level, the amount of holders at the money would increase, which means this region would be hard to break down.\n\nSimilarly, any price bounce would struggle to climb above $3.5k, since many of the holders would be near breakeven at that price and would look to sell due to the fearful conditions.\n\nTherefore, in the coming weeks, the $3.1k and $3.5k levels are the ones to watch out for.\n\nActive address count reflects positively on network health\n\nThe daily active addresses have trended upward in June even though prices have fallen lower. Rising active addresses is a good sign for network usage. But the other metrics were bearishly biased.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe mean coin age has dramatically trended downward over the past month. This showed token movement across the network and distribution. The MVRV ratio also fell below zero to highlight holders at a loss.\n\nTogether, they were a strong sign of further bearishness. The MCA has to begin trending higher to hint at price recovery."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOOE5ucWQyaWE1STFXWFZxdkE0bnFZOUptam5yOXFVaWJEREFuZ1Myd0h4SzY4cFczd3o2R0N4ZDJyamNLVEZiWWNyenQyVzVwZXFUemlFbkc1SWZaZXNIb0o1MzFYMm0xMnZ1eWVzdkhWRlVHYmNkV2g5ang5S0JGbDlJVWQyOHFINjRHaDQzWVNjei0zT1lhV1ZUZVhXa01VcTZCWDhfaEVZTVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Analysts Forecast $15 Billion in Net Inflows to Ethereum ETFs by 2025 - Crypto News Australia",
        "content": "US spot Ethereum ETFs are anticipated to start trading on July 2, following a VanEck filing.\n\nBitwise CIO Matt Hougan projects US$15 billion in net inflows to Ethereum ETPs within the first 18 months.\n\nAnalysts predict the ETF launch will boost Ether’s short-term price, with investor focus shifting from Bitcoin to Ether.\n\nSpot Ethereum exchange-traded funds (ETFs) are expected to launch soon in the United States. Bloomberg analysts have chalked in July 2 for a trading start, which is seven days after a VanEck filing concerning these funds.\n\nInterestingly, with the Spot BTC ETFs we saw trading commence exactly seven days after a VanEck filing.\n\nRelated: VanEck Files for Ethereum ETF, Could Start Trading Next Week\n\nBut what impact might these funds have on ETH? A significant one, according to Bitwise Chief Investment Officer (CIO) Matt Hougan.\n\nAdvertisement\n\nCIO Optimistic About ETF Inflows\n\nIn a post on platform X, the CIO said he believes the money coming into these funds over the following months will be substantial.\n\nEthereum ETPs will attract $15 billion in net flows in their first 18 months on the market. Matt Hougan Matt Hougan\n\nHougan expects investor allocations to BTC and ETH exchange-traded products (ETPs) to align with their market caps: BTC holds 74% of the market at US$1,266bn (AU$1,905bn), while ETH comprises 26% at US$432bn (AU$650bn).\n\n3/ U.S. investors have $56 billion invested in spot Bitcoin ETPs. I suspect this will reach $100 billion by the end of 2025, as these ETFs mature and are approved on platforms like Morgan Stanley. By this logic, spot Ethereum ETPs will need $35 billion in AUM to reach parity. — Matt Hougan (@Matt_Hougan) June 26, 2024\n\nBesides considering factors like market cap comparisons between BTC and ETH, Hougan thinks investment in Bitcoin ETPs, and the structure of international crypto ETP markets will drive adoption.\n\nHis projection is based on the current investment distribution, expected growth in Bitcoin ETPs, and the conversion of Grayscale’s Ethereum Trust. Hougan adjusts his estimates considering the absence of a staking-related “carry trade” in Ethereum, similar to what exists for Bitcoin, leading to a conservative inflow estimate for Ethereum ETPs.\n\nI don’t expect the flows to come in a straight line. In fact, I think there is a good chance we see net outflows from the ETH ETP complex at points after their initial launch, as traders who played the discount-arbitrage game aggressively redeem out of ETHE. Matt Hougan Matt Hougan\n\nETF Launch to Drive Short-Term ETH Price: Analysts\n\nMeanwhile, analysts at crypto exchange BloFin believe that the ETF launch will have severe short-term ramifications for the price of Ether as investors shift their focus from Bitcoin to ETH. In a note shared with CryptoSlate, citing “options skewness, portfolio adjustments, and whale holdings”, the analysts said ETH is expected to see price increases.\n\nThe relative strength of BTC has lasted for several months, but investors are changing their views: they seem to believe that the performance of ETH will strengthen for some time with the listing of the spot ETH ETFs. BloFin BloFin\n\nRelated: Over Half of Japanese Investment Managers to Adopt Cryptocurrencies, Survey Reveals\n\nBloFin’s analysis reveals a recent shift in investor sentiment, now favouring Ethereum over Bitcoin in the short term, driven by Ethereum’s potential for higher returns in a lower interest rate environment and the expected approval of these spot Ethereum ETFs.\n\nAdditionally, on-chain data indicates that ETH whales are holding onto their assets, further boosting Ethereum’s bullish outlook relative to Bitcoin.\n\nGet the most important crypto news delivered to your inbox by subscribing to the CNA newsletter"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOMUNrMG82b1FpVkxYNWxYTkg2aDdoUV8wM1BSVVl2eGpDNm5zWWx2M3ppZ0pTX0ZPaEZFU1JGaFF0Wnd4bUdxSFJLWkpKWkNJOHNqQ1dULW9nNkhPRnJzanNhUERmMFRXc09BMGFPaHZlWHVrNEQ5dDBoYkhZZEpabU1kT0VDVnFSd3dOLTRiQ015NllvWWRxV1VscUdNdXl60gGuAUFVX3lxTE9HNGN2bDRDLTljVHk0YWxvcWJWNDk0TW14NVd4RjN6UmtxbkdTU0w0QUYwaHJLdlBPUmRzQmQyM1lWLWhPcGFFUjBOOVo4R19yV2tlUXJIV0daSHl4ZVEycl83V19BTU1QZXZYT3R5X0lGS1I1a1ZnTktvVThDRFdPMVJVQUUtbllzeHlzblVZaEl5M3BZNGRoRmtWQmZ0YmktSWV2cFNzdkloYkgwUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Surges: Trading at US$3,447 with 2% Gain - Analytics Insight",
        "content": "Ethereum’s present value is US$3,446.5 is slightly lower than in the past 24 hours and significantly lower than in the past week.\n\nThe values of support and resistance are important for getting information on possible price lows and highs, as well as for defining the most effective points of entering and exiting crypto trading .\n\nThe position of the RSI at 45.70 can be interpreted to mean that the market is in a neutral to slightly bullish state while the MACD is at -14.9 indicates bearish momentum.\n\nIn conclusion, despite frequent fluctuations, high volatility, and a predominantly bearish trend in Ethereum price at the moment, many indicators signal that demand is high and able to support and strengthen Ethereum at the current levels."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxONkJZbWszeW5YRkRqZTZiVnpHNWJVUmhYYWgweHBXQ3ZkcTR5eXJVZHc3a20tci1Nby1jcFFXNVhRMFp5elRyTV9XcGNuRk5kS0RVSXdXdktJallCNWFCeDJaRVVEWEl3VVM2M0M3RFFxMWZZay1ZOW0yeTVVcFZ5QUVfY3Vjc1F0R3RuTmUtdi15OEVTdjBkYW56bGstUC0wQjg5OWpqMW9DeTRNcXFIRFJ2OUV4ZmZReDh4R3Y4Ni1SM2VEVU8zSklZZEwwNlJseUpiNG5Ub0x6Sm5QLW5qWEV6MUk0UnBTam0yZEg4bFJSQ1lwcWRjVmszRmwtWmZ0Z0lUT2FoODJJekdvakRWY2hYWE96dGhw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Who Knew The SEC Closing The Ethereum Investigation Would Be Bearish For ETH and Altcoins; Here Is A Crypto Gem To Make It All Back With - The Portugal News",
        "content": "The recent closure of the investigation initiated by the SEC had a major unexpected drawback on Ethereum (ETH) and several other altcoins including Solana (SOL), Cardano, and Polygon.\n\nBy Advertiser, in Crypto · 27 Jun 2024, 09:31 · 0 Comments\n\nMany analysts and traders expecting a bullish outcome based on the data results were shocked as these altcoins trended downwards, with investors leaving to find more stable investments. Despite these negative trends, a top DeFi token, Rollblock (RBLK), has emerged to help investors regain their losses in the crypto market.\n\n\n\n\n\nThe Impact of The SEC Investigation On Ethereum (ETH)\n\n\n\n\n\nOn June 20, 2024, after the SEC closed its investigations, Ethereum (ETH) saw a brief uptick in price to $3,608.25. However, to the dismay of investors, this wasn’t a lasting growth as the price immediately fell to $3,502 and has since trended downwards, now sitting at $3,403.\n\nThis Ethereum price drop led to greater market instability, with cryptocurrencies like Bitcoin Cash (BCH) and Ethereum Classic (ETC) also trending downward. Investors looking for the best altcoins to invest in are now more cautious about their investment and seek promising investments that don’t display heightened volatility.\n\nThis market reaction to the SEC update underscores the importance of having stable cryptocurrencies with high growth potential in every investor’s portfolio. It also shows how major assets like Ethereum can upset the balance of the entire market. With innovative tokens connected to high-growth industries, investors can experience stable portfolio growth unaffected by changes in major coins like Bitcoin (BTC) and Ethereum.\n\n\n\n\n\nRollblock ($RBLK) Stands Out As a Potential Henge Against Crypto Volatility\n\n\n\n\n\nRollblock (RBLK) is a new protocol that aims to disrupt both the GambleFi and casino industry. This project, built on Ethereum, has a live casino and allows $RBLK token holders to receive a percentage of revenues generated by its casino, which will result in a steady increase in investor profits as the platform grows. To guarantee a growing crypto platform, Rollblock has designed several initiatives capitalizing on the $540.3 billion gambling industry.\n\nThe traditional online gaming industry has struggled with transparency and trust when placing bets. With no desire to risk their funds on rigged games, many players now refuse to place bets, negatively impacting the industry's growth. Rollblock provides a solution to this by using blockchain technology to secure all transactions. All users are guaranteed a secure bet, and bets can’t be changed once placed.\n\nWhile playing games, Rollblock will reward users with the $RBLK tokens which they can then use to play more games, win, and grow their funds. The platform has seen a huge influx of users, 100s daily, in just two months due to its easy-to-access system, requiring no KYC from gamers before accessing hundreds of games on the platform. Users only need to open an account with an email or crypto wallet, deposit from a selection of over 20 cryptocurrencies, and start playing different games with instant wins and payouts. This has accounted to Rollblock currently having 3000+ registered users already.\n\nAs the platform grows, Rollblocks price is expected to soar a massive 720%. This is huge for investors, who can not only profit from price increases, but also Rollblocks revenue share model.\n\nUp to 30% of the casino revenue will be used to buy back the RBLK tokens from the open market. 50% of purchased tokens will be allocated for rewards, and 50% will be burned to increase token value.\n\nIn addition to the Rollblock revenue share model, players on the platform can also stake their $RBLK to earn more rewards and bonuses. Any $RBLK earned can be converted into other cryptocurrencies or fiat at low transaction fees and fast processing times.\n\nInvestors struggling to find the best token to invest in and those looking to regain the money they’ve lost from Ethereum (ETH) and other altcoins have a huge opportunity with the Rollblock ($RBLK) presale. Currently in stage 3 of the presale with a price of $0.014, analysts have already predicted that Rollblock could see an 800% rise in the next few weeks before the presale is over. Investors who get in early enough could not only enjoy these profits, but could see an additional 100x rally once RBLK is listed on major exchanges.\n\n\n\n\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino\n\n\n\n"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQWVBLQXdlQkUxVXBrdGltaHdhd2VzX1dCdDl4alZKTXBqYzRHeTYtWVhXLWhyQkhYbEpVZDZDdk9xNXhmVEJsZEhTdUl2RFNYMVBwWTdkQTBNOEp5YlVrckE2SVhxekFNc1B3bkpNcWcxa3o0WWRnVGlLSUJRcFdsX3pTZXJwYnJVb2lfYk1lV0w5VWkyWXfSAZsBQVVfeXFMTTBYTk5uSVJuV0VXT3B5Y19xd25UOEJuTVRuTXZkdVFfODFTR3Zfd1FqQXBJQUtEQ1E3M3hSelJTZkFFUlo1NjAyN21tc18tUWtqSWRBUm95UzAyMkRJY183dE1ndnlVUjF2bUdWbDJlNmdqaXdfdFpHUHd5TEFScGhHR29UV1BwVHlQTV9QOG5EYThBazJyeEFTT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Litecoin beats Bitcoin, Ethereum in usage, so why is LTC still bearish? - AMBCrypto News",
        "content": "Despite high network activity, LTC was down by nearly 15% in the last 30 days.\n\nMost metrics and indicators hinted at a continued price decline.\n\nLitecoin [LTC] has failed to earn investors profits as it continues to drop on the list of the top 30 cryptos. However, the coin did manage to excel on a particular front.\n\nIn fact, Litecoin outshone both Bitcoin [BTC] and Ethereum [ETH], which looked pretty optimistic for the blockchain’s future.\n\nLitecoin surpasses Bitcoin, Ethereum\n\nLitecoin recently posted a tweet pointing out an interesting development. As per the tweet, LTC continued to dominate BTC and ETH in terms of authentic active addresses.\n\nThis closely signified the rise in LTC’s adoption and high network usage over the past months.\n\nIn fact, AMBCrypto’s analysis of Santiment’s data also revealed a similar picture. Litecoin’s daily active addresses remained high throughout the last 30 days, as the number exceeded 858k on the 6th of June.\n\nLTC bulls take the back seat\n\nThough the blockchain’s network activity and usage were commendable, the same can’t be said for LTC’s price action. CoinMarketCap’s data revealed that LTC’s price dropped by nearly 15% in the last 30 days.\n\nAt the time of writing, LTC was trading at $70.61 with a market capitalization of more than $5.27 billion, making it the 22nd largest crypto.\n\nThings for LTC can get worse in the coming days as a key metric hinted at a price correction.\n\nAMBCrypto’s look at Glassnode’s data clearly revealed an increase in the coin’s NVT ratio. Usually, a rise in the metric hints that an asset is overvalued, increasing the chances of a price drop in the following days or weeks.\n\nFor the uninitiated, the NVT ratio is computed by dividing the market cap by the transferred on-chain volume, measured in USD.\n\nTo see whether the bears would continue to dominate, AMBCrypto then analyzed Litecoin’s daily chart. We found that most of the market indicators were in the sellers’ favor.\n\nFor instance, the MACD displayed a bearish advantage in the market. The Chaikin Money Flow (CMF) registered a downtick and was headed towards the neutral mark.\n\nA similar declining trend was also seen on the Relative Strength Index’s (RSI) chart, hinting at a continued price drop.\n\nNonetheless, LTC’s price had touched the lower limit of the Bollinger Bands, hinting at a possible recovery soon.\n\nRealistic or not, here’s LTC’s market cap in BTC terms\n\nOur analysis of Hyblock Capital’s data revealed that if the price decline continues, investors might witness LTC dropping to $67 in the coming days.\n\nHowever, in the event of a trend reversal, LTC might first eye $81.4 in order to begin a full-fledged recovery."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPYWhVLS1jcVBhSi12N0JfeUk5TDdIQ2hfTVRqZnE2OGxWZjNqRlhlU2FUNTEwbjltYzFLQ2xuTGhHeXRiVzRROWZDNVhDZVUtUXVzNENWbDQ1c294dlF1YlhrSklVb0NkRWowVW5oaHZpcnpNQTYwenQxNGpIU2JFQm43SnZPVXU5M3ZReHRZQ0xBcExsMVpCVHRRRTY3eEJkVlk2bNIBsgFBVV95cUxQekRHR3hnQmVfYndCdkhzclk2cWpZWEdkeG9RLUc1MktrWXhxMWdZUXlvOFU0X05DbHJRc1h3YVhIbTYzRi15WnpsdmQwMXRxOXdpRllfRHpfSjMyYnltdDA1N3FYMWRRTHZzbmJsN1F6T1FXVE9uY2w2STljOW84aXZkNVNmamhaSjBJNkRJSjk0R0JaSDZGU2kwZHpRRGNGRnp4Q0FVYk4tTkdXdk1oLVBR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Ascends: Hovers Around US$3,372 on June 27 - Analytics Insight",
        "content": "The U.S. Securities and Exchange Commission (SEC) is set to approve several exchange-traded funds (ETFs) that will track the spot price of Ethereum, reportedly by July 4.\n\nThis advancement follows final discussions with leading asset managers such as BlackRock and Grayscale Investments.\n\nThe introduction of these funds marks a significant milestone in the maturation of crypto markets and their adoption by mainstream investors.\n\nWhile initial reactions and the long-term performance of these ETFs remain speculative, the strategic initiatives by top asset managers suggest a strong belief in Ethereum's potential.\n\nAsset managers are looking to build on the success of January's spot Bitcoin ETFs, which attracted US$14 billion in inflows.\n\nGrayscale, in particular, aims to transform an existing trust into a spot Ethereum ETF , reflecting a strategic move to broaden crypto investment options.\n\nAnalysts have mixed views on the potential inflows, with some cautioning that Ethereum ETFs may not generate the same level of excitement as their Bitcoin counterparts. Others, like Bitwise's Matt Hougan, are more optimistic, predicting US$15 billion in net flows within the first 18 months. Once approved, the new Ethereum ETFs could begin trading within 24 hours."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQcjdxNHFxbDlUSEx1N21ibXozdWNMVWNPNkgyZkFoaEV2ZU1CMVIwY2NJMTRIYVVLdTgtN0oyOWFkUjIwem1aVnctbGk0YzdodUZrNHFxQVZOclEzaXBYU0xsNnlsWUdPRURYVkhyS09SNWpRYkktaU0zcUNQc3cwRlFxYUNZVDMxM09zeGR4Q29XMFg0YW8tdmpB0gGfAUFVX3lxTE1ycVN4NGwtdnp0eFFybW9ILVc0R3FRUWdkdjAwRDMzWmRqT0FVNHpxaDFrMzlCalZxaEVKZ09UOG5NSjlfZngyMTVMbVVqWE9zeG56Uy1jWXJDMDVHM1pQUndjZTJVWUpLbzRUV1VtS3pFQWo5S18xa2VuMlh0bl92UWtnc3V2ZXFmaWprUWVBYnRxV1dQSmNndWVjS0pobw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Name Service to halt at $27? What ENS investors need to look for - AMBCrypto News",
        "content": "The ENS price action showed that bears might force another rejection.\n\nAMBCrypto found one metric that could be key for traders to time a bullish breakout.\n\nEthereum Name Services [ENS] witnessed a strong rally that began on the 12th of June and continued to go strong. At press time, ENS had gained 9.82% and could go higher.\n\nThe good times might not last for the bulls, as ENS fast approached a resistance level that was unbeaten throughout 2024. Will this fourth attempt be lucky, or should bears prepare to enter short positions?\n\nPrice action shows bulls might struggle to make new highs\n\nThe $27.5-$28.5 zone has been a persistent resistance zone throughout this year. The first rally in January saw prices rebuffed to the 61.8% retracement level at $16.34.\n\nHowever, the subsequent breakout attempt in early March also met with failure.\n\nThe retracement thereafter took ENS to $10.67, and the bulls fought through April and May to defend the 78.6% retracement level at $13.29.\n\nThroughout this time, the OBV has trended higher. The steady buying pressure might pay off this time and force a breakout.\n\nNetwork Growth was another positive sign\n\nSince the 15th of June, Network Growth has trended upward to denote hundreds of unique addresses created on the network. The Daily Active Addresses has also trended upward.\n\nTogether, the rising adoption might fuel demand.\n\nThe mean dollar invested age continued to trend upward. This showed the network was becoming less active and older tokens were sticking to the same addresses.\n\nIs your portfolio green? Check out the ENS Profit Calculator\n\nA drop in the MDIA metric could rejuvenate the market and spark a breakout.\n\nAs things stand, bulls should be cautious of buying ENS at such a strong resistance zone. However, the $27.5 region is broken and the MDIA metric begins to trend downward, investors might want to bet bullishly.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPMVZ4eThteDhpNDJQck1Mb21mVmhtdm94UGN2TGZIWklFMzgzek5FejQtUlpwUncxS0p2bDVHZjZ1WVJHUWlyQ2FfS0J1ZFM3bHNKS051Tm9ReDBuSzN3UjVrYWZuemJGZjdCQVIzXy1kdXV3c2IyNS12ODhWeVBmdFJpOUJYbERuX1F4T1N1Y1pDaDQ5VzFzUktQM2ZnUkgwWG9ZUmx0SFdyeXlLdWlJUHNmNzB4MFQyRndpSTZta2JJbU9BckcwMTBPb3JRMGNRQmdBQmk3MUxndw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "MegaLabs Secures $20 Million in Seed Funding for MegaETH, Endorsed by Ethereum Co-Founder Vitalik Buterin - Crypto News Australia",
        "content": "An exciting new Ether-based scalability project, MegaETH, secured a handsome US $20m in funding.\n\nThis figure puts the team’s “fully-diluted token valuation” at over US $100m.\n\nKey investors in the seed round included Ether co-founder Vitalik Buterin, ConsenSys CEO Joseph Lubin and VCs like Dragonfly.\n\nMegaLabs intends for MegaETH to provide “real-time” transaction finality, the first Eth-compatible network to do so.\n\nThere isn’t much higher praise in the crypto industry than that which comes from Vitalik Buterin. Barring perhaps Satoshi Nakamoto themselves, the founder and co-creator of Ethereum is one of the most esteemed members of the blockchain community. When he talks, you listen.\n\nRelated: Celebrity Memecoins: The Rising 2024 Crypto Trend and Its Significant Risks\n\nButerin’s glowing praise of the new blockchain project MegaLabs speaks volumes about the team’s potential and direction. And it couldn’t have come at a better time, with MegaLabs – developing their native MegaETH network – performing a seed round.\n\nThanks in part to the endorsement (and investment) from Buterin himself, the MegaLabs team managed to secure approximately US $20m (AU $30m) in about five months.\n\nAdvertisement\n\nOther major investors included Dragonfly, Figment Capital, the CEO of ConsenSys Joseph Lubin and the founder of EigenLayer Sreeram Kannan.\n\nVitalik Buterin backs new blockchain MegaETH as it raises $20 million at '9-figure' token valuation https://t.co/vFI2FaoL5H — The Block (@TheBlock__) June 27, 2024\n\nMegaETH to Revolutionise Ethereum Virtual Machine Scalability\n\nAs its name suggests, MegaETH is slated to be an Ether-based network with a twist. MegaLabs contends that their protocol will be the very first “real-time blockchain” that works alongside Ethereum virtual machine (EVM). In this instance, “real-time” means the blockchain can process transactions “as soon as they arrive.”\n\nTo manage such lofty goals, the network uses unique blockchain infrastructure that can reportedly handle up to 100,000 simultaneous transactions per second (TPS).\n\nRelated: Whale Alert: US Government Transfers 3,940 BTC to Coinbase Institutional\n\nAs a key founder of Ethereum, Buterin is naturally invested in the blockchain’s future and knowledgeable about the projects built atop it. When prompted on his interest in the MegaETH project, he was clear in his approval.\n\nCreating hyper-scalable EVM implementations is a key prerequisite for truly scaling Ethereum. I am excited to see brilliant developers taking on this challenge. Vitalik Buterin Vitalik Buterin\n\nMegaLabs is headed by co-founder Shuyao Kong and is targeting a September–November release date."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5aLWI0QzluU29uME5yTmRnTVdva19RZmJNLS1nXzhleVhBSkMwV2tGMU45eUpXQUpGNVZGUmhROWhpdjZSMEZtQ2F4X3RkRWUtWEFjcmdtaUJpNS1zM1Vkal9Dcm9jQjBHV3FWRGVyWDl4UdIBd0FVX3lxTE8xOF9LNE96YldjTjlqVlJGV2NTVTZmQ25zWi03RTlCUmN3aVZ1ejRObV93VnYxS0hkTnVWMGE1eHAwaTFlczVjalNlY2FlQTc2QmRSS0NKelptQkhEel9Ub1ZHZi1uc09vS1o5T3JlVUU1aWM5TmJZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 03:30:24 GMT",
        "title": "Ethereum Price Hints at Upside: Analyzing The Bullish Signals - NewsBTC",
        "content": "Ethereum price is attempting a fresh increase above the $3,420 resistance zone. ETH is now struggling to clear the $3,480 and $3,520 resistance levels.\n\nEthereum slowly moved higher above the $3,420 zone.\n\nThe price is trading above $3,400 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $3,390 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair must clear the $3,480 and $3,520 resistance levels to continue higher.\n\nEthereum Price Recovers Slightly\n\nEthereum price started a decent recovery wave above the $3,350 level. ETH even cleared the $3,400 level and outperformed Bitcoin. There was a break above a connecting bearish trend line with resistance near $3,390 on the hourly chart of ETH/USD.\n\nThe pair even cleared the $3,450 resistance zone. A high was formed at $3,482 and the price is now consolidating gains. There was a move below the $3,450 level. The price dipped below the 23.6% Fib retracement level of the upward move from the $3,328 swing low to the $3,482 high.\n\nThe bulls are now trying to protect more downsides below the $3,420 level. Ethereum is trading above $3,400 and the 100-hourly Simple Moving Average.\n\nOn the upside, the price is facing resistance near the $3,480 level. The first major resistance is near the $3,500 level. The next major hurdle is near the $3,520 level. A close above the $3,520 level might send Ether toward the $3,550 resistance.\n\nThe next key resistance is near $3,620. An upside break above the $3,620 resistance might send the price higher. Any more gains could send Ether toward the $3,740 resistance zone.\n\nAnother Drop In ETH?\n\nIf Ethereum fails to clear the $3,480 resistance, it could start another decline. Initial support on the downside is near $3,420. The first major support sits near the $3,400 zone and the 50% Fib retracement level of the upward move from the $3,328 swing low to the $3,482 high.\n\nA clear move below the $3,400 support might push the price toward $3,320. Any more losses might send the price toward the $3,240 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,400\n\nMajor Resistance Level – $3,480"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVmtsTWV6NTVGRVFhTW5ibnFEdG5Za0dRMHZrVXpkNExqd05kQTlpUkpUTWJ2WmtRTmNSdmwtNW9lXzIteUIyOEktMlRWWjh5SDFjVHpjTDRBWjZJRk4yNDBocEQyaTRmSG9XblJJdU9Qc1lLVjMwMU1ldXV2WkVhUmpyQTc0RGdQYkh0YkJIWjViZ2NkMTJ5Rzl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Surpass 4K Before The End Of June? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has shown promising signs of gaining ground against Bitcoin. This development, coupled with fluctuating prices and new positive signals, could mark a significant shift in the cryptocurrency market dynamics. With these signs, can Ethereum break the 3K level and surpass 4K?\n\nEthereum's Bullish Sign Against Bitcoin\n\nEthereum (ETH) has been lagging behind Bitcoin (BTC) for nearly two years. However, recent analyses suggest a potential turnaround. A prominent trader recently highlighted that the ETHBTC pair has closed above the two-day Ichimoku cloud for the first time in 525 days. This technical indicator often signals a bullish trend, suggesting that Ethereum might have bottomed out after a prolonged period of underperformance.\n\nCurrently, Ethereum is trading at 0.055 BTC. After reaching a peak of 0.061 BTC in January, the ETHBTC pair faced a significant downtrend, falling to 0.044 BTC in May. However, Ethereum rebounded, gaining 28% against Bitcoin in May following the U.S. Securities and Exchange Commission's (SEC) unexpected approval of several 19b-4 forms for Ethereum exchange-traded funds (ETFs).\n\nThe approval process for these ETFs is progressing smoothly, according to SEC Chair Gary Gensler. Reuters reported that Ethereum ETFs might go live by July 4, with talks between prospective ETF issuers and the regulator reaching the final stages. While the launch of Ethereum ETFs could be a major bullish catalyst, analysts cautioned that they might not generate the same excitement as Bitcoin ETFs.\n\nEthereum Price Prediction and Analysis\n\nEthereum (ETH) Current Price Fluctuations\n\nAs of today, Ethereum's (ETH) price fluctuates around $3,4K, showing stability above this level. This stability is accompanied by positive signals from stochastic indicators, suggesting a potential bullish wave.\n\nEthereum Price Prediction: What is The Expected Scenario?\n\nThe bullish wave is expected to target $3,493.00 initially, with the potential to rally towards $3,641.82. However, if the price breaks below the $3,360.31 support level, it could halt the bullish trend and subject Ethereum to correctional bearish pressure. With these numbers, predictions highly doubt that Ethereum could ever surpass 4K, at least not by the end of June. However, with the launch not far away, expectations and predictions can drastically change.\n\nEthereum Price Analysis: What is The Main Trading Range?\n\nTo sum it up, the expected trading range for Ethereum lies between a support level of $3,280.00 and a resistance level of $3,530.00. Investors should monitor these levels closely to gauge Ethereum's next moves.\n\nEthereum is showing signs of a potential bullish trend against Bitcoin, supported by technical indicators and the forthcoming launch of Ethereum ETFs. However, Bitcoin's price fluctuations and market dynamics require careful monitoring to capitalize on these opportunities."
    }
]