[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1GQUhxLWtySE45bEtTRFFxb1JUVEJLV0d0RDBwVnRwSVU2aGRjcTJKNDNDeS1ibHJBOGk5QmtKSHllbmpYV1J4LTFhdUFxMkFWaEhNVGIzVm5pajJSampkdC1MLTFYVWhac19VTzY3bDFtbllvc1ZwWdIBgAFBVV95cUxOeFZiR1hQajQ0VjVtNGNMcklEVkFVNC01bWY4dzBZYXQ1bFduRmtSQm5YLS1qLU5XUTNXSkkyNndYck4ta0phZDF6TVFFZXc0dTZMNE82RzVRVkpYek9JbjhSX0hCbGt6elRzS2JURk1USlZVU2dxV3FMaWdVWWFxUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Coinbase Met With SEC Over Grayscale's Proposed Ethereum ETF - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAmerica's biggest cryptocurrency exchange met with the Securities and Exchange Commission last week over Grayscale's proposed spot Ethereum (ETH) exchange-traded fund.\n\nPublicly-listed Coinbase gave a presentation to Wall Street's top regulator where it talked about Grayscale's proposed product, documents filed on Wednesday from the regulator show.\n\nIn October, Crypto fund manager Grayscale filed an application with the SEC to convert its Grayscale Ethereum Trust (ETHE) into a spot ETH ETF. The proposed ETF would give investors direct exposure to the second biggest cryptocurrency; it would trade on a stock exchange—allowing investors to buy shares that track ETH's price.\n\nAD\n\nAD\n\nCoinbase's presentation showed that the crypto exchange had spoken about potential market manipulation and how the exchange would have a \"comprehensive surveillance-sharing agreement with the Chicago Mercantile Exchange will assist in surveilling for fraud and manipulation.\"\n\n\"Spot markets for ETH are highly indicative of a market resilient to fraud and manipulation,\" the presentation said, adding that the cryptocurrency has \"mechanisms that significantly limit ETH’s susceptibility to fraud and manipulation.\"\n\nIn January, the SEC gave the green light to 11 spot Bitcoin (BTC) ETFs to start trading. After a decade of denials, the investment vehicles now trade on stock exchanges, and have been a roaring success, with huge inflows.\n\nGrayscale was one fund manager that received approval; it converted its popular Bitcoin Trust into a spot Bitcoin ETF.\n\nNow, along with other reputable financial institutions, it is trying to get approval from the regulator to do the same with ETH, the second biggest digital coin by market cap.\n\nAD\n\nAD\n\nCoinbase analysis shows correlation b/w ether futures & spot markets every bit as strong as w/ bitcoin markets… Add-in that SEC approved CME-traded ether futures ETFs and I’m not sure what grounds for disapproval of spot ether ETFs would be. — Nate Geraci (@NateGeraci) March 8, 2024\n\nBritish multinational bank Standard Chartered last month said in a report that it expected ETH ETFs to get approval from the SEC by May—and that the asset price could soar as a result.\n\nOn Friday, ETH hit $4,000 per coin for the first time since 2021. The price of ETH stands slightly below that at $3,948, per CoinGecko data.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNX1JDVU1Nd3p1aDlma09qVXdFWUFKTDhkdEpJNFNoamhxczRsX0FTdTl4c1Z1WVFZOXQtOGNlOFFuQkVTUllyM1R4bGF5OThyX3A0alpOa1RudVRwdXJXUERYVWJBZFVwT2V2UkpaaThVVl9FaG50ckxZQThzSFZwNlMzNndhOUpsSjVka1pCb2xHNW1QNkVlRHN2R0ppdlpPdEVTXzF0SzNiZGp2UDBtRVJIb1NCRENNUURMZFdQTTItcFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Bullish $34 Billion Signal Appears after $4k Rally - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQVXoweUFVRHIzZW5kRzlSY2hJSzZlbWFDbHRuNUFKQ2dSUGI4bExWcGtRcFhyTzVYVUJPcG53dVVtMkxiLVFfM3ZpODkyV1F0NDNiSV8tVTU1Z2JHZjg5VnVuYzJZMWNLV3RNc25BdEVMNDdDeEtYT0RDeG1OM0lSckluOTMta1lQWTZKYzVFM2lQWHJpZHlyWW5FakhTQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes a Quantum-Resistant Hard Fork for Ethereum - Blockchain.News",
        "content": "Vitalik Buterin Proposes a Quantum-Resistant Hard Fork for Ethereum Jessie A Ellis Vitalik Buterin proposes a hard fork strategy for Ethereum to protect funds against quantum computer attacks, sparking a community-wide discussion on quantum security.\n\nEthereum co-founder Vitalik Buterin has proposed a hard fork strategy. This preemptive measure is designed to protect user funds in the event that quantum computers become capable of breaking current cryptographic defenses.\n\nThe proposal, outlined in a discussion on the Ethereum Research forum, highlights the urgency of preparing for quantum computers' ability to solve problems like the discrete logarithm, which underpins the security of many current cryptographic algorithms including those used by Ethereum.\n\nThe proposed hard fork would entail the following steps:\n\nReversion of all blocks following the detection of large-scale quantum attacks. Disabling traditional externally owned account (EOA) transactions to prevent further vulnerability. Introduction of a new transaction type for smart contract wallets, in line with the anticipated RIP-7560 standard. Implementation of a new transaction type or opcode allowing users to submit STARK proofs, demonstrating the knowledge of a private preimage and a public address derived through approved hash functions. The user's account code would then be replaced with a new, quantum-resistant validation code.\n\nThe conversation in the Ethereum community is informed by a range of expert inputs. One participant shared a visual aid to help understand the proof statement, while others discussed existing quantum-secure fallbacks for wallets and the integration of preimages into ECDSA signature nonces to create fail-stop signature schemes.\n\nSome community members have cautioned that if quantum computers capable of cracking Ethereum wallets are already in malicious hands, it might be too late to differentiate between legitimate owners and attackers. They suggest that instead of relying on stateful post-quantum algorithms, Ethereum should use NIST standardized ones in hybrid mode with a classical algorithm, like combining Dilithium with ed25519. This would, however, increase block sizes due to the large signature and public key sizes of current post-quantum schemes.\n\nOthers have proposed the development of machine learning systems to monitor and detect abnormal transactions as an early warning system to trigger a fail-safe fork.\n\nThe community's response underlines the importance of staying ahead in the security arms race against quantum computing. Innovations such as Lamport signatures and ERC 4337-based quantum-resistant smart contract wallets are already in development, as is the integration of quantum-safe cryptographic measures in other digital signature applications.\n\nThis initiative by the Ethereum community reflects the broader blockchain ecosystem's commitment to resilience and adaptability in the face of emerging technological threats. As quantum computing advances, the blockchain sector's proactive stance on security promises to be a critical factor in its long-term viability and trustworthiness.\n\nThe Ethereum team and community's proactive approach to quantum security demonstrates a clear recognition of the challenges ahead and a willingness to address them head-on. This ongoing conversation will likely shape the future of Ethereum's infrastructure and set a precedent for other blockchain platforms."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOVG8tOFRJS1dVWW96Q1pVOEkwS0ZQSWZ4TnRHekxQM0hQbUtYTVVkQjl3aTNmZURUbVZOMGltN2ZYeVJsLTBYSzN3Z2U3Yi12RW9LdkM2YW5zVndSdzkzSXF5ZV9RNXp0bHJMTkMwTnZUTldyS1dmOTdWU1pQRDZmUtIBhgFBVV95cUxQQmp0V05jaW52QXZLYXplZkdiSzZVQmtUZ1BrZWpwVlRhM0wtOHN0MHlYeElvOVNmSUNoaWRjMW95Mi12VmRaTmltQWo3dzFkaDlnbFk2REhtLUktZTc2WXdDdE9lV1M3VUtlYlRBd245cXVQeGFRakJQWHdXM1F4UDJPMU5mdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum is surging – Does that mean alt season is finally here? - AMBCrypto News",
        "content": "Capital is rotating into other altcoins led by ETH.\n\nEthereum’s TVL increased by 73.78%, indicating high altcoin interaction.\n\nEthereum’s [ETH] rise above $3,900 could be the catalyst that changes the market dynamics and helps altcoins climb higher than they have.\n\nEver since Bitcoin [BTC] hit a new all-time high, ETH has been outperforming it. This brought about the notion that Bitcoin’s dominance might have taken a step back.\n\nWhenever this happens, ETH’s price performs better. But the second most valuable cryptocurrency is not always the only beneficiary of this flipping. Most times, profits gained from ETH and BTC increase flow into other altcoins.\n\nETH is set to kickstart the ride\n\nAMBCrypto analyzed on-chain data from Santiment to check if it was the case this time. According to our analysis, we observed that capital has been rotating into other cryptocurrencies. Some of these include Render [RNDR], Fetch.ai [FET] and Fantom [FTM].\n\nWe arrived at this conclusion after assessing the whale transactions valued over $100,000. At press time, these large transactions have been occurring since the 5th of March.\n\nBut the ones recorded in the last 24 hours have been enormous, indicating that the much-anticipated altcoin season was here.\n\nAltcoin season is a terminology used to describe a market boon when other cryptocurrencies outperform Bitcoin. But something AMBCrypto noticed about the aforementioned cryptocurrencies was that they were all ERC-20 tokens.\n\nFor those unfamiliar, ERC tokens refer to fungible assets created on the Ethereum blockchain. Therefore, one can conclude that there was high interest in ETH and other assets linked to the network.\n\nIf capital continues to flow into these assets, other tokens built on Ethereum might follow. How about the Total Value Locked (TVL)?\n\nAssets locked proves that it’s time\n\nAccording to DeFiLlama, Ethereum’s TVL was $55.30 billion. This value represents a 73.78% increase in the last 30 days.\n\nThe TVL is an indicator of a protocol’s health. When it decreases, it means the protocol lacks an inflow of liquidity. This could also mean that market participants do not trust the blockchain enough to produce good yields.\n\nOn the other hand, an increasing TVL suggests that participants perceive the project to be trustworthy. Thus, the network enjoys a wave of capital flow which improves its health. This was the case with Ethereum.\n\nIf participants continue to bridge assets into Ethereum, the TVL might close in on its previous all-time high.\n\nRealistic or not, here’s FET’s market cap in ETH terms\n\nA rise toward $106 billion could also affect ETH’s price. Should this be the case, ETH could rise past $5,000 at the peak of the bull market.\n\nAlso, other altcoins might not be left out. For instance, FET, which has seen a 377% 90-day increase might trend higher. FTM’s price might also rise in the $3 direction while RNDR’s price could also swing upwards."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOYzhBZ1FxeHRwMXhXdFFmcDZ4LTIzd3g1WVRCdVNEV1d6aFQ2NzFnRGltUkR5bHp6d3hEeXNFSnBYWFZTTkV2VnJyYlEzS19GNTZ2eEgwV1lpZ3EwRWRwYmdHeE9mM3EzVEU2YTBSYjNmQ2s1MTNidUNUYzRocDB3SmNPSW5qXzdFWWZGQ3F3eUllTXBRN3dKTjlNSUVIdTBUZ1NyRVlxUWh1MkI3OFBwemtCbUxPVmN2a3FUQUNkX09qdjdudFh5NEJwX2dNU0N0YkxSYVE2RnRXcXRaZF9iT0dXSkFlMlQz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin Vs. Ethereum Vs. Shiba Inu Vs. Doge: How Much You Would Have Now If You Had $1,000 Invested In Each Of The Crypto At Start Of Current Bull Run - Benzinga",
        "content": "Cryptocurrencies have been on a tear since late last year, as buying interest perked up in anticipation of a regulatory nod for spot Bitcoin BTC/USD exchange-traded funds. Although the rally stalled after the SEC approval came through in early January, it resumed after the lull.\n\nWhich of the widely owned and popular cryptos generated better returns for investors?\n\nStratospheric Climb: After a forgettable 2022, most cryptocurrencies began to take off in 2023, with most of the upside taking place toward the back half of the year. The upside is in part due to bargain hunting as investors looked past scandals and general risk aversion improved. But much of the buoyancy came on the back of optimism over the spot Bitcoin ETF approval and the impact it would have on the space.\n\nA spot Bitcoin ETF was perceived as a way for investors to gain more exposure to digital assets without having to directly own them, which could encourage wider adoption of cryptocurrencies.\n\nBitcoin ended 2022 with a loss of over 64% at $16,547.50. The crypto began a slow and steady recovery in 2023, and the rally began to accelerate only after the apex crypto broke above a key resistance around $30,000 in late-October. After moving sideways for much of January, the Bitcoin rally reaccelerated in February.\n\nDespite warnings from skeptics about a potential correction, crypto investors appear to have thrown caution to the winds and continued buying.\n\nSee Also: Best Online Cryptocurrency Brokers\n\nReturns From Investment: Bitcoin is trading just shy of the $70,000 mark after pushing past the level last week. The performance of Ethereum ETH/USD, the second-biggest crypto, has been a silent performer.\n\nMeme coin Shiba Inu SHIB/USD, though late to the party, has made strong gains this year. Dogecoin DOGE/USD, another favorite, has also gained traction.\n\nAssuming a hypothetical scenario in which an investor made a $1,000 bet on each of these cryptos, here’s how much return it would have generated now.\n\n$1,000 invested in Bitcoin at the end of October would have fetched 0.029 Bitcoin. It would be worth $1,975.87 now (based on Saturday’s closing price). This translates to a return of about 98% in little over three months.\n\nThe same $1,000 invested in Ethereum at the end of October would have fetched 0.55 of the crypto. This would be worth about $2,150, a return of about 115%.\n\nIf the investor had put in the dollars in SHIB, the $1,000 would have got him 125,000,000 SHIBs. The same would be worth $4,250, a 325% return.\n\nIf the investor had opted to plow in $1,000 in DOGE at the end of October, he would have received 14,646 of the meme coin. At Saturday’s closing, the holding would be worth $2,623, a gain of 162%.\n\nAt last check, Bitcoin rose 1.61% at $69,472.43, Ethereum was up a modest 0.31% at $3,906.97, while SHIB fell 4.61% to $0.000034 and Doge slipped 3.25% to $0.174072, according to Benzinga Pro data.\n\nRead Next: ‘May Be I Should Buy Some Bitcoin,’ Says Bill Ackman As He Weighs In On Energy-Guzzling Crypto Mining, MicroStrategy’s Saylor Says He Would Like To Discuss 1-On-1\n\nPhoto: Shutterstock"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOQmNjb0w1SVRhaUZ2QXBxdzVNOGNsOHBjLUNza1dmTGRfWWFpYXJXcjlvUUF3R0tYWUtLVUpSYmtuSmQtdkZZY3pSSG56bHdNRTZSTXU3d1BoVkJmdHQ2SnFPd0szQVpxOUlucjM0QW5nTEpMX0l5LUFFZ1ZIYzAzZGs2S0lnSmJvX0RWeG9SSUZJcEhkSmpGcHFCZWpXNWg5TTJTWG92SWRZNHVTa3h6QnZxbkZUVG82TzhFZG9CbmU3UWh6NzRaVnpUbDl0S3prbW5xRmd6cHdBaEVnb05VRlBpQnZUcFU5eUZ0R2FSZ0XSAfYBQVVfeXFMUFlKMlF1SkpvYkQtY0cyYXpJRzVhN3Jqb3BmQ19sV3B4YWFwWVZnX3BhMzNsWE91WW9EWmJtdnliLTBuMnNNTEM1ZnFsa0UxeEkwbnNGUDV5bDI1MlNlS0owTjA1b1V6QS0tWUZ2UGZVODFWX3FOOWJ0c0QxMllqbHlvUHhGZGQtbG9Qb0tnSnpjUU9Lc042TDczdzVxS2liMmJGdDhVU2dYbm5aalZBenNfRldKUXRNVF9pbVh1YnlvXzdzUmMwVHQtampqRnFNS3dsVFN0a3pWYWdzQWxucmhrQ0E0Ti1PVmdObC0zbDJERzdhU1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Over half a billion dollars in Ethereum has been burnt in the past month, ETH holders await Spot ETF approval - FXStreet",
        "content": "Ethereum worth $583.94 million has been burnt in the past thirty days, slashing the altcoin’s circulating supply.\n\nEthereum hit a new high at $4,012 on Binance, ahead of the upcoming Dencun upgrade.\n\nETH holders await Spot Ethereum ETF approval by the SEC, attorney comments on likelihood of approval.\n\nEthereum price hit a new high of $4,012 for the first time since late December 2021, marking a key milestone for the altcoin ahead of its key upgrade. Ethereum holders are awaiting the upcoming Dencun upgrade, the most significant development since the altcoin’s migration to Proof-of-Stake.\n\nAlso read: Ethereum price tags $4,000 on Coinbase for the first time since 2021\n\nEthereum burn picks up pace closer to Dencun Hard Fork\n\nEthereum has been under the spotlight since the altcoin hit a new high on Friday, crossing the $4,000 level, on Coinbase and Binance. The altcoin made a comeback above this level for the first time since late 2021.\n\nEthereum had a major developmental milestone when it migrated from Proof-of-Work consensus mechanism to Proof-of-Stake, marked by the Merge. The next major milestone is the introduction of proto-danksharding, through EIP-4844, one of the improvement proposals included Dencun Hard Fork, scheduled for March 13.\n\nData from ultrasound.money shows that nearly half a billion dollars in Ether have been burned in the past thirty days. This metric has significance for ETH holders since it supports the reduction of the altcoin’s circulating supply and reduces the selling pressure on Ether.\n\nEthereum burned in 30 days. Source: Ultrasound.money\n\nEthereum price gains are supported by the bullish developments in the altcoin. The next target in Ethereum’s uptrend is likely $5,000, close to the December 2021 peak of $4,936. The Moving Average Convergence/ Divergence (MACD) indicator and the Awesome Oscillator (AO) support Ethereum’s uptrend and signal that the altcoin could rally higher.\n\nETH/USD 1-day chart\n\nA daily candlestick close below the 38.2% Fibonacci retracement of Ethereum’s climb to its 2024 high, at $3,307 could invalidate the bullish thesis for ETH. The altcoin could find support at the psychologically important $3,000 level if a correction ensues.\n\nSpot Ethereum ETF approval likely?\n\nAttorney Jake Chervinsky commented on the status of Ethereum as a commodity. The attorney states that the Securities and Exchange Commission (SEC) is less likely to follow through on its classification of the altcoin as a security, since this would conflict with the Commodity Futures Trading Commission’s authority. The CFTC has labeled Ethereum a commodity and the two entities are less likely to engage in a “civil war” like situation, says Chervinsky.\n\nThe status of Ethereum as a security or non-security has a direct impact on whether the SEC approves a Spot Ethereum ETF in May, the last deadline for the applications. Ethereum holders are anticipating an approval, and a similar impact on institutional capital inflow and is likely to act as a catalyst for the second-largest asset by market capitalization.\n\n(This story was corrected on March 10 at 04:33 GMT to say that Ethereum price hit a new high of $4,012, not a new all-time high.)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQUHlRa2pMOWItWHNqODh3aTdSMWlGazdRem0wNzUwOTZJN2pOM0JicXpCcFlrOWwyLV9mWnFBS1VwNTJ3TV9Fc3pmQ3F6SEJFSmZ5TUlvVHE5eW9jckFxdl9KcksxQ0E2SGlGUkoxNVUxaTRIbFNadWpzYTBUUWRtMC1MXzNhUVlXbU5HMHA4ZXQtaUN40gGaAUFVX3lxTE1DSVR1cFdacFA1a0FBQmlNZHc5UG5fVlhqRDZpcUpqWlcxakpCUjFlcHRWMDVZZWQ5cGtpU3RNalJONXBJa1llaElUb1lKMFlNQkdKQnJPdktzNVgxWEdyQ2Jna0xZbVJ2UWpWNi1mQ3FlMW82UW8xNndDT3BHVmdzZEppZ1A4UWRpMVljUXdiMXNDSVlBRjI3REE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Set to Drive Near-Zero Transaction Fees - CryptoPotato",
        "content": "The forthcoming Ethereum Dencun upgrade scheduled for March 13 offers a chance for near-zero transaction fees for layer 2 (L2) solution users, possibly drawing in more new ones, as per a research report by Fidelity Digital Assets.\n\nThe forthcoming upgrade marks the initial step in Ethereum’s rollup-focused roadmap. This advancement will empower the network to function as a resilient database, enhancing the efficiency and cost-effectiveness of data storage for layer 2 blockchains.\n\nDencun Upgrade to Reduce Costs for L2 Blockchains\n\nAnalyst Max Wadington wrote that the Dencun upgrade would provide the necessary scaling capability to accommodate millions of users on layer 2 blockchains, positioning Ethereum as a more suitable distributed database for other blockchains. These enhancements are anticipated to attract significantly more users to the Ethereum ecosystem and broaden the network’s total addressable market (TAM).\n\nMoreover, the upgrade is poised to reduce costs for layer 2 blockchains to store data on the main network. This cost reduction is expected to be transferred to users through lower fees.\n\nLayer 2 solutions are separate blockchains constructed on top of layer 1, or the base layer, to alleviate scalability issues and efficiently manage data. However, the upgrade is not expected to benefit Ethereum users significantly, as the fee reductions promised to layer 2 users will not extend to those transacting on the base Ethereum blockchain.\n\nWadington explained that in the short term, users seeking to capitalize on this fee adjustment would need to compromise some decentralization and security by conducting transactions on layer 2 solutions instead of directly on the Ethereum network. Hence, it will likely encourage more users to bridge assets to other platforms.\n\nThe report added that conducting transactions on Ethereum for application-specific purposes would remain the preferred choice in the medium term, especially as layer 2 platforms mature.\n\nEthereum Price Surges\n\nEthereum surpassed the $3,000 mark and surged to over $3,900 earlier this week, reaching its highest value in almost two years.\n\nInvestor sentiment reflects optimism regarding the forthcoming Dencun upgrade and the potential approval by the U.S. Securities and Exchange Commission (SEC) of Ethereum exchange-traded funds(ETFs). Additionally, on-chain data reveals that nearly $200 million worth of ETH was burned in the past week, reducing the altcoin’s circulating supply and potentially fueling further price appreciation.\n\nAccording to CoinGecko data, Ethereum is trading at $3,789, up 8% in the last week. Notably, the second crypto by market cap has surged over 60% over the last month."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPWHdSaG5nb1BET3RXVElISDFGUzhma0trSnRCM3FpXzVlbk1EWnM3alhLMFNzSVVvMlRKc3N0QV9JbjNSTWpLbXRKS0lHbGFaMFJseE8tZ1IzSkhaazFVOWtobXBSbU94T1FsajdXR0JpU2hpM2pYRXJsRnJKVjJmYlY5RG8tR2FYY3YzeUZOZkRIR2U0S21uN3RwQURJTTZVXzd2cEpVS1ZWOVl3dDNSWDBucThwWFZrT1QtQWdZWE4waThScEJCTmk2MWNNeFFxNnBUcNIB2gFBVV95cUxOV0xHcC1DWWctdjFIdjYxOFJ2dEpBYVhGTlIwckcwNFRKd0hEb2lIWVVxY09jcDk5R3ZPWTgxS2VXamRYZnd2Nll6TjNXS2RhNTlnazA0X3puMVBFaWJ1S3ltT19fYmJzV3VQWk5iZFdKc2dONmxaQ2ZvY2RGbjQtNVFjSEdIR2F3b0I1d1JWdnU4OEhvZ05hSF9OYzlBbVJpTTZKbU9JM0MzWXN3NW5rcFNvdlhWczRoMXh6MjZJME9JcTdDOW56bFZ1TVM1X0hOVjNZb25GMDdWUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "In bitcoin's shadow, another cryptocurrency, Ether, stages its own rally - The Economic Times",
        "content": "New York, Mar 10, 2024 -Bitcoin has captured the limelight in recent weeks as it surged to a new record high, yet another major cryptocurrency , Ether, has been enjoying its own meteoric rise.Launched in 2015, Ether, also known as Ethereum , is by far the second-largest digital currency in terms of total value, now estimated at over $460 billion.Along with other cryptocurrencies including Solana and Dogecoin, it benefited from the regulatory approval in the United States of a new bitcoin investment product, the exchange traded fund -- or ETF -- in mid-January, said James Butterfill of the investment company CoinShares.These ETFs allow investors to profit from any change to the price of cryptocurrencies without having to buy them directly, while also letting them sell at any time.The launch of crypto ETFs has led to an influx of new money, sending bitcoin to a fresh record on Friday of $70,085.Bitcoin's rise has been well-documented, but Ether's has been even more impressive, surging almost 72 percent year to date in comparison to bitcoin's 61 percent rise.This strong performance is largely due to \"expectations that an Ethereum ETF could be approved in the United States,\" according to Dessislava Aubert of research firm Kaiko.Several asset management companies have applied for authorization from the US financial markets regulator, the Securities and Exchange Commission (SEC), to market these Ether investment products.The SEC must rule on the first such applications, from VanEck and Ark 21Shares, by May 23 at the latest.\"Ethereum has started to wake up as investors are anticipating a potential approval,\" Michael van de Poppe of MN Trading told AFP, adding that \"people are rotating from Bitcoin to Ethereum as a potential investment opportunity.\"Beyond the ETF effect, the digital currency dreamed up by Russian programmer Vitaly Buterin has several other cards up its sleeve.For Simon Peters of cryptocurrency exchange eToro, Ethereum is also buoyed by the prospect of \"Dencun,\" a major upgrade to the technology underlying this digital currency, scheduled for March 13.This major change will improve transaction processing capacity and cut transaction costs, but also has the potential to unleash the growth of an ecosystem with multiple applications.\"Bitcoin's primary use is as store of value, while Ethereum has much more potential use cases,\" Peters told AFP.For example, it is the destination of choice for non-fungible tokens -- or NFTs -- the certificates of digital authenticity that caused such a stir three years ago.The two cryptocurrencies are not in direct competition, according to van de Poppe from MN Trading, because Bitcoin is \"hard money,\" while Ether \"is basically an investment for the entire blockchain and smart contract ecosystem.\"Ethereum has already successfully negotiated two major technical transformations in recent years, including the switch to a less energy-intensive system in September 2022.James Butterfill said there is \"increasing optimism\" that a \"Dencun\" upgrade will \"go without a hitch,\" which would reinforce the currency's credibility.He added that Ether, by the very nature of its operation, offers the \"added benefit\" of interest generated by its holders.The mechanism for creating this currency involves owners putting up existing Ether coins as collateral in a process known as \"Proof of Stake,\" which differs from bitcoin's energy-intensive method involving highly complex calculations, known as \"Proof of Work.\"Ether investors who agree to put up some or all of their holdings receive a fee of a few percent a year, in addition to any potential capital gain if the currency appreciates in value.The \"Proof of Stake\" process adopted in September 2022 has significantly increased the amount of Ether used as collateral, notes Simon Peters, currently at 21 percent compared with just 10 percent 18 months ago.\"There is less Ethereum in circulation,\" he said, adding: \"If demand increases, given the squeeze in supply, then price should follow.\"\"I think that Ethereum is going to be outperforming Bitcoin,\" said Michael van de Poppe, adding the total market capitalization of Ethereum could end up exceeding that of bitcoin."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQaFdXa1pITFRnTElCc0lWZW1HRG1PVHpVc1E4dTlyR2Y2WUplalNJSkRsdkNRZ1M2cUVxNWZaTmEzZDRUNzVjei1NYlVtZ1doRTR3Q2NFbkc4NkZCNWdhYXF6TUwyaEtmTGM0dnctb3VlcWF3T3pnNlZVX2J5bzVDQjR4MDJGUnRUQ0QwY0dGdEp5bWFX0gGaAUFVX3lxTE1QUlFRaVFFSUZFZVFaSTh3QmRMb1BBVW1EMnAyeV9GemZJcDg2U3d2MkZGSEFrVDB2T2hXVndKdzVhT0VjaTBQd3JoZ0NzWHRMaE9vRk1xblJ3OEdteVl3RGpYdldvaE8tWVppWGZnYWtxd21hN21Eb1NTMTdJbE1ybEJaTDNmaHcwVTZySVlrczRSQmFCYW9zN3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Braces For $5000 Rally With No Major Pullback On Horizon - CoinGape",
        "content": "The world’s second-largest cryptocurrency by market cap, Ethereum (ETH) ,surged past $4,000 on Friday, March 8. However, the ETH crypto faced a minor pullback. At press time, the Ethereum price was trading at $3,933 with a market cap of $472 billion.\n\nEthereum (ETH) Price To See All-Time High Soon\n\nCrediBULL crypto, a prominent crypto analyst, has weighed in on the current market dynamics, particularly focusing on Ethereum (ETH) following Bitcoin’s recent achievement of tagging its previous all-time high (ATH).\n\nadvertisement\n\nAccording to the analyst, there’s widespread anticipation within the crypto community that Ethereum is the next in line to surge, given Bitcoin’s ATH milestone. Those who have remained on the sidelines are reportedly eyeing a potential pullback to the $3600-$3700 range, a sentiment echoed by many participants in the market.\n\nHowever, CrediBULL crypto suggests that such a pullback might not materialize immediately, as the demand for Ethereum remains strong. The analyst says he wouldn’t be surprised to witness Ethereum’s price surge by another 25% or more before any significant correction occurs.\n\nOn the other hand, Ethereum continues to outperform Bitcoin as we move ahead in 2024. Over the last week, Bitcoin (BTC) price gained by 10% while ETH added 15% gains in the same period.\n\nBoosted by the imminent Dencun upgrade and a bullish atmosphere from Bitcoin’s profit recirculation, Ethereum, the second-largest cryptocurrency, is gaining momentum. Analysis of the ETH/BTC chart indicates that altcoins are nearing a breakout point.\n\nAll Eyes on Dencun Upgrade\n\nIn the next week, the Ethereum blockchain will undergo its much-awaited Dencun upgrade bringing significant improvements to the network. The upcoming Dencun upgrade scheduled for this month will reduce transaction costs on layer 2 networks, stimulating increased activity and potentially drawing mainstream consumer interest to Ethereum.\n\nAnother catalyst is the pending regulatory decision on spot Ethereum ETF applications, expected in May. Although the approval odds are less certain compared to spot Bitcoin ETFs, it still brings excitement to ether, according to the Bitwise analyst.\n\nAccording to IntoTheBlock data, ETH mainnet’s revenue from network fees surged to $193 million this week, marking the highest level since May 2022 and reflecting a 78% rise from the previous week. This notable increase in on-chain activity was primarily fueled by heightened speculation involving meme coins.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQQWpOOTZhREZVQ0tiQU93Nm5peld6UzFSTG5kcTB5cEROb1hqd21IQWd2TGdnRmIzNVI2QzRpX0JuNXRQNExKVXNmOVczakpRSGw4UmRkT2dzU1YtM0FJMlFIU0FKWHVNUjd1QjdnT0dUQzYzWDR5U3Bxd185c1V2b05BX2FVUmxKM3dUbVdITlVVcGh4TlU2U3VzVUViOEdCVmlUNGQtT1dHdXhmVDhnU3ZNSnA4QVN0dW13alhUNDdfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Starts Consolidation – Why Pullbacks Could Be Limited - TradingView",
        "content": "Ethereum price is still struggling to clear the $4,000 resistance zone. ETH might consolidate for some time above $3,600 before the bulls gain strength.\n\nEthereum traded to a new multi-month high above $3,980.\n\nThe price is trading near $3,850 and the 100-hourly Simple Moving Average.\n\nThere is a short-term breakout pattern forming with resistance at $3,950 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $3,950 resistance zone.\n\nEthereum Price Revisits $4K\n\nEthereum price extended its rally above the $3,900 level, like Bitcoin. ETH cleared the $3,950 level and traded close to the $4,000 resistance zone. It traded to a new multi-month high above $3,990 and recently started a consolidation phase.\n\nThere was a pullback below the $3,920 level. The price tested the 23.6% Fib retracement level of the recent wave from the $3,211 swing low to the $3,9983 high. Ethereum price is now consolidating near $3,850 and the 100-hourly Simple Moving Average.\n\nThere is also a short-term breakout pattern forming with resistance at $3,950 on the hourly chart of ETH/USD. If the pair stays above the $3,800 level, it could attempt another increase. Immediate resistance on the upside is near the $3,900 level.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is near the $3,940 level. The next major resistance is near $4,000, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $4,120 level. If there is a move above the $4,120 resistance, Ethereum could even rise toward the $4,220 resistance. Any more gains might call for a test of $4,350.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,950 resistance, it could start another downside correction. Initial support on the downside is near the $3,800 level.\n\nThe first major support is near the $3,600 zone or the 50% Fib retracement level of the recent wave from the $3,211 swing low to the $3,9983 high. The next key support could be the $3,400 zone. A clear move below the $3,400 support might send the price toward $3,250. Any more losses might send the price toward the $3,120 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,800\n\nMajor Resistance Level – $3,950"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOU2I2Q0tQQkhVX3NwT20wZ0t5ZC1Bb3FJMVVqakFXYUFydko4dWpxWjdzNGZLVUdUVHVScTgxbXhJRVlzeWp6ejJTUl9CWExPQ093WHpMd1k3VmZaaWVrUVVRbTBoT2R5T0s2U2VLLWp0Mno3WWV4TDc5X01Beng5OTlQLTl6NGI3cF9mLTNwZmdleVZVYVNIYzYwcEQwQTE1ZVEyNHpjMzg4TnpLZjBtYVlIcFk0UGtoSFpyWnFNMTRqRFJCQXhWSzdDVWJQQdIB0wFBVV95cUxPdTFmaEJtSERSRUp1REh3dTQzQUViZE05VV93UjdabW1ZVzZNMFFXQ1NWT0F2U1ptY3o1eFBvdjA3U1JXRzhtY2lSLTF5TmpEd01GWDJodHdRemlGRDloMEN6d29YMTVEZjdGV2t3R01BVDFXY19nbktjSTc0NUd3UDRrc2RxOU9vX1VjVUozOGNnM2V2Sm9DOEgxSndtNTFNM1ZFdDE1bkxqOG5hdEd2a21CUlVvQ0gzUUktS3AwQ0hLZDhXV1lKZ1ZfbDRSeGhKYy1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,900 As Experts Believe NuggetRush Could Be A Potential Leader In Coming Altcoin Run - Crypto News Flash",
        "content": "Ethereum (ETH) is nearing the $4,000 milestone following Bitcoin’s recent surge. Altcoins like Dogecoin and Shiba Inu have also experienced significant gains, contributing to a bullish market sentiment.\n\nNuggetRush (NUGX) is an emerging token positioned in GameFi, DeFi, impact gaming, and play-to-earn (P2E). Still, in the ICO phase, it introduces a P2E game with governance tokenomics and deflationary features.\n\nIn the dynamic cryptocurrency landscape, Ethereum (ETH) is surging towards the significant psychological milestone of $4,000.00, propelled by the recent ascent of Bitcoin (BTC). On the other hand, NuggetRush (NUGX) emerges as an advanced token strategically positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Here are reasons why Ethereum investors believe NuggetRush could lead the upcoming altcoin run.\n\nEthereum (ETH) Surges Toward $4,000 Amidst Bullish Crypto Landscape\n\nEthereum (ETH) is constantly heading towards the psychological $4,000.00 milestone after Bitcoin’s (BTC) rise to $68,537.15 on March 4, 2024. Multiple altcoins, including Elon memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB), have seen remarkable triple-digit gains, strengthening the current bullish sentiment in the market.\n\nCoinMarketCap data reflects a massive surge in Ethereum’s (ETH) liquidity and trading volume, hitting $33 billion, while its market cap has surged past $450 billion. These figures highlight the massive fundamental factors helping propel the current Ethereum (ETH) rally, especially the imminent Dencun upgrade set for March 13.\n\nThe upcoming Ethereum (ETH) Dencun upgrade, preceded by three successful test introductions, promises many boosts for Ethereum’s (ETH) ecosystem. Prominent aspects include decreased transaction fees on layer-2 protocols and easing network congestion, accomplished by raising the block size to 25 MB, up from the existing 12.5 MB.\n\nThe implementation of proto-danksharding will enable Ethereum (ETH) to resolve scalability issues efficiently.\n\nThe Dencun upgrade, combined with optimistic market sentiment fueled by Bitcoin’s surge to its all-time high and the potential for a spot exchange-traded fund (ETF), has strengthened Ethereum’s (ETH) upward momentum.\n\nOn March 7, 2024, Ethereum (ETH) was valued at $3,936.27, up 14.71% in the past week. Analysts say ETH will rise to $4,050.00 by the End of March, supported by increased bullish momentum in the crypto space.\n\nNuggetRush (NUGX): Unveiling an Advanced GameFi Token with Deflationary Features\n\nNuggetRush (NUGX) is an advanced token perfectly positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Since it is still in the early stages of development, it is still available as a blockchain ICO.\n\nIn that context, NuggetRush (NUGX) will introduce a play-to-earn (P2E) game while blending tokenomics, consisting of a governance token. Interestingly, the token has a deflationary mechanism and characteristics. The rapid growth of an active community and massive interest in NuggetRush (NUGX) in its presale is subject to different factors and elements.\n\nThe main factors include community-driven progress, advanced technology, and a vision that supports decentralized finance (DeFi) non-fungible token (NFT) and gaming enthusiasts to engage with and derive considerable value from NuggetRush’s (NUGX) “ecosystem of rewards.”\n\nAlthough it is a relatively new project, NuggetRush dominates the crypto space. Its mission goes beyond its presale phase, and the team plans to help push NUGX toward a crypto market cap of $100 million. The significant target and many use cases confirm a growing momentum that may help NuggetRush (NUGX) become the best GameFi crypto.\n\nAdditionally, no taxes were charged on transactions executed in the presale space. On that note, NuggetRush has become attractive for most investors. The project has sold over 211 million NUGX tokens and raised over $2.7 million.\n\nCurrently, NUGX is valued at $0.019 in the Launchpad round of its presale. At the end of this round, NuggetRush will rise to $0.020, its mainstream listing price. The many utilities and growth potential make NUGX the best crypto investment today.\n\nVisit NuggetRush Presale Website\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPcUtSTXFwYWFob25qNi1VY1Y2RnFQbFY5Sks3aE9sVkcxcDIxNjB6YVJSMk9YT19aaVRhTHh5UFJhRjV5dEpiakI0SU9KSVBweG8yVjQ0ZGdiWjh6Ulk4V1BOakZmSGVONEoxTTFZbE9zSlZJcHZTenRVYVRRRThGVGNpRG16NkhmUW5EVmpEbmctTFN4a3hydjJzRzQyOG90MUNQd0tUSzFzaDEyX2xXQk5POA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "PEPE Price Rallies 300% as Ethereum Crossed $4k: More Gains Ahead? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQaV9UTVZkUkZzNGpnRjVqdTQ0TXd6amExajNrMTNzYjBTTVZwX1F2WVZ2R0Q4T0RPTm9leEpyeVlHanFtSm5QNGdYcU5mUVZPbXVpTWJOS2ZoNGRPWGZncl82YjducldYSFBkSUhCd2doNlZ6eENHQzZTcTRRQWZoaXlsWE80WXPSAYwBQVVfeXFMT2FqQXN5UHhIZHoweTY5cU10aTBRX3Vqb201SUV0WGl4M0pYakdDSW5NdG1BcjY4czlDcEZmU2xicFd5NUt0eHliVGI4MkNSUTBYdEdqb1d5Y243YzBJdGN3bWxaRlhMa1JzUTNwamM0T04tWHdvM25UdUpaOUE4UEpWbjZfdEtUWUdFa2U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Why Ethereum’s rally above $4K may not be good news for you - AMBCrypto News",
        "content": "ETH briefly exchanged hands above $4000 on the 8th of March.\n\nThe past two weeks have seen a spike in validator exits.\n\nLeading altcoin Ethereum [ETH] faces a potential short-term pullback after it traded briefly at a three-year high on the 8th of March.\n\nThis decline may be due to the overheated nature of the coin’s Futures market, which historically precedes a sharp fall in its value.\n\nAccording to data from Coinglass, ETH’s Futures Open Interest has crossed $13 billion, and, at press time, sat at its highest level since November 2021.\n\nAn assessment of the coin’s historical performance revealed that on the 16th of November 2021, the bull run caused investors to pile into Futures contracts.\n\nThis led to an inflation of ETH’s price to the barely sustainable level of $4891, which now represents its highest price point in the altcoin’s history.\n\nOn that day, ETH’s Futures Open Interest peaked at $14 billion before experiencing a significant crash, lowering the coin’s value as a result.\n\nIn the six months that followed, ETH chased new lows and even exchanged hands below $1,100 by June 2022.\n\nFurther, the recent hike in ETH’s value has resulted in a surge in positive Funding Rates across crypto exchanges. This, paired with rising Open Interest, puts the coin at risk of declining.\n\nHigh Funding Rates increase the risk of severe long liquidations, which may result in high market volatility and unpredictable price swings in either direction.\n\nValidators do not want to be left out\n\nAMBCrypto’s look at Ethereum’s on-chain activity revealed a recent increase in validators’ voluntary exit from the Proof-of-Stake (PoS) network.\n\nThis comes amid the new yearly highs recorded in ETH’s price and the desire of validators to profit from them.\n\nAccording to data from Glassnode, the number of validators who have left the Ethereum network, observed on a seven-day moving average, has increased by 42% in the last two weeks.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis has resulted in a brief decline in the network’s participation rate. Per Glassnode’s data, the participation rate on the PoS network was at a two-week low of 99.46% as of this writing.\n\nThere were 999,660 active validators on the Ethereum network during this time, each staking over 32 ETH in the network’s 2.0 contract."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5LdmlscEV3OGYwUWdvZlljcW81YWV4NkdoMjhoX0FBUW5CVHc4QVp2c2RiMDVxd0g0VzVONDBYX3Nka3NFWlhzMW5KS2VyZnBJOXQxR1Q0Q1NhaEkzMFhlbzU4NGpYR2psVkZrMlZ4ZnJBUm1FblB3ZTdR0gF_QVVfeXFMTnlwTzhJWVI4V3lQaS1qQjVpY1JDNmhMbk5vNmQ1RXA1OG5KVnVXLTF2akRJMl9jekJ6QnFVZDFGc1AyUGNnYXhBQ3M3Y2RoMUFNT25IeVA5TEpUVEtLcDZoWlk0STdUdEFWNWFrM3NlbWZJWE9QUTdJM09STUZjOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "How memecoins helped Ethereum’s transaction fees - AMBCrypto News",
        "content": "Ethereum’s weekly fees hit a 22-week high on the meme coin hype.\n\nETH’s supply on exchanges increased, prompting concerns of a correction.\n\nEthereum’s [ETH] bullish run on the price charts brought it to $3,949 at press time, setting it for a likely breach past the magical mark of $4,000.\n\nThe second-largest cryptocurrency was up nearly 15% over the week, according to CoinMarketCap.\n\nThe soaring prices got traders excited, as daily trading volumes hit multi-year highs of more than $20 billion, as per crypto market data provider Kaiko.\n\nEthereum blockchain gets busy\n\nApart from the impressive show in the market, the blockchain was also experiencing heightened demand for its blockspace.\n\nAccording to on-chain analytics firm IntoTheBlock, Ethereum validators collected over $190 million in fees over the week, the highest since May 2022, representing an increase of 78% from last week.\n\nWith this, Ethereum’s annualized fee rate surged over $10 billion for the first time since early 2022.\n\nThe high network demand was attributed to the ongoing meme coin bull market.\n\nTop Ethereum-based coins such as Pepe [PEPE], Shiba Inu [SHIB], and Floki [FLOKI] have been pumping this week, as retail investors returned to the cryptocurrency market.\n\nETH burn rate spikes\n\nThe fee spike also accelerated the rate at which ETH was moving out of circulation. Note that a set amount of ETH is burned for each transaction.\n\nThis corresponds to the minimum amount required for a transaction to be considered valid, i.e., base fee.\n\nAccording to AMBCrypto’s analysis of ultrasound.money data, more than 33K ETH were burned over the week, taking the annual deflation rate to 1.45%.\n\nAs per the supply-demand factors, such deflationary pressure might have a positive impact on ETH’s long-term economic dynamics.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA cause for concern?\n\nETH’s rapid price gains over the week pushed the total supply in profit to over 95%, as per AMBCrypto’s analysis of Santiment data.\n\nInterestingly, nearly 320,000 ETH coins were transferred to exchanges in the week. This raised alarms that traders might look to profit-take in the days to come, causing a correction."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOMjl5OGxxOTFwdFJ1ZkFYRUhGOW1NeVQ5U08wVmc2dlRudkxPZ0J6NXlVWmc4S1F1U3J1RHM0a29yeWFIcXU3bl9XbnNjZU1nUDlubUg3NEpfMnBJV2s4dy1DcW41eHJtdXdNMHpXdzdib3M5RTg0XzJJRGFQaHBDeDBOZ2FMRFnSAYwBQVVfeXFMTjBfRlg3aXJ6T2VSWHMzZ3BzWWk5ZWR0NnhmZ2wxamRLZEdFQllIMC05Z0dTVlFHOGJNQkdsR3FXYldSbWhMdXkwdzJzbGJROEM5dFhsaVRfQU5GYTJHRjROYkdRVkR1X2U3YjR6OGpDc0RJNUdqRnVObEIxOW4ybEhvQlQ1YU5QeWFEZHo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Here’s what’s going on with Bitcoin, Ethereum, and the S&P 500 - AMBCrypto News",
        "content": "Bitcoin increased by 10% and Ethereum rose by 14.7% in the past week.\n\nBTC and ETH were trending over the S&P 500 at press time.\n\nBitcoin [BTC] and Ethereum [ETH] have displayed strong price performances in recent weeks, surpassing some previous all-time highs.\n\nThese upward trends in the prices of these crypto assets have caused them to diverge from the S&P 500. What implications could this have for the crypto assets?\n\nBitcoin and Ethereum trend above traditional assets\n\nAMBCrypto’s analysis of Santiment showed that the crypto asset class, comprising Bitcoin and Ethereum, exhibited stronger growth than the S&P 500 in the past week.\n\nThere was a 10% increase for BTC, a 14.7% increase for ETH, and a modest 0.5% increase for the S&P 500. Thus, the crypto asset classes yielded a more positive return for the week.\n\nAnalyzing Bitcoin’s trend\n\nAMBCrypto’s analysis of the daily timeframe trend of Bitcoin on the 8th of March showed a 2% increase, maintaining the $68,000 price range.\n\nNotably, the significant aspect of the price trend on that day was a surge to the $70,000 price range during the trading session.\n\nThis marked the first time in over a year, instilling hope for a potential sustained rise to that level.\n\nAs of this writing, Bitcoin was trading around $68,450 with a less than 1% increase and continued to exhibit a strong bull trend.\n\nEthereum remains in a strong bull trend\n\nAMBCrypto’s look at the price trend of Ethereum on the 8th of March, similar to Bitcoin, revealed a significant high point. Despite a slight increase of 0.42%, ETH tested the $4,000 price level on that day.\n\nAt the time of this writing, it was trading at around $3,900, reflecting a 0.7% increase.\n\nEthereum continued to maintain a strong bull trend at press time, as indicated by its Relative Strength Index.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nThe current trends in the S&P 500, Bitcoin, and Ethereum suggest a lack of correlation between equities and crypto assets. This divergence raises the likelihood of a sustained bull market.\n\nThe ongoing bull trends in BTC and ETH over the past few weeks serve as an indicator that the market could potentially be transitioning into a full-fledged bull market soon."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQU1NaUjlfaTh3R2YzYURrR3hTZUx2bFlTYklHbjBFV1RyZTVLazRadzFPelZobW9tcDhZZk9pSGpBWUd4ejY4MmNPOTh5aEJwam40NGdTZDM4Skk2T01oTkVuZ2Q2eUU5LUpxNll5NEhrR0xDNHlxeVNuMGJoT3FubHRvUTNoM2VQVWNRZ19MOTVZbDBtTTlzRjRZRUxxRzA0WjJlNENzLVVOeUFYbFVSVmVB0gG3AUFVX3lxTFBxdE9OZ2Y0WERLY1hTazFmZm9VWVFPOVhMaXk4MUNFQzZNSFM5SUowNkxJWkl0TmUzZWE3OXlsSU1tNjZZODVtOUxGbkJqc0lYdkl6MDFMTDZrTXhCUHNGVjU5Z3pmMjc2cEhBLW51bmlqakdkaTZERXNFTUlyMnJ5eExOUzM4SzZZV3NlaDUwUzFzLTlYUmdXUmhmbkxaaXpNQTUycDJJMVg5U3MwZGYxTkxBNFJ1Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 09:55:27 GMT",
        "title": "Ethereum Wallets Overflow: Over 90% Addresses In Profit, Ether To Retest ATH - NewsBTC",
        "content": "Cryptocurrency enthusiasts are celebrating a bullish weekend for Ethereum (ETH), the world’s second-largest cryptocurrency by market capitalization. With a price surge of 4.31% in the last day, ETH is inching closer to a critical resistance point: $4,000. This climb comes amidst a wave of optimism surrounding the Ethereum network, fueled by a confluence of factors.\n\nRelated Reading\n\nBitcoin Bulls On Alert: Top Analyst Anticipates A Big Spike In The Cards 6 months ago\n\nEthereum Whale Activity, On-Chain Buying Signal Potential Rally\n\nMarket analysts are attributing the recent surge to a significant rise in Ethereum accumulation. According to data from blockchain tracking company Spot On Chain, wallets linked to PulseChain and PulseX have been aggressively buying ETH, accumulating a staggering 163,295 ETH in just four days. This substantial buying pressure, totaling nearly $621 million DAI, suggests a strong foundation for a potential price increase.\n\nFurthermore, more than $10 billion whale trade volume recorded overnight indicates a shift in sentiment among major investors. This hefty trade volume is seen as a bullish signal, suggesting that whales are accumulating ETH in anticipation of a price upswing.\n\nEthereum Investors Buoyed By Profitability, Approaching ATH\n\nAdding fuel to the fire, over 94% of ETH addresses are currently in profit. This translates to a significant number of investors holding onto their ETH, creating low selling pressure and potentially paving the way for a price increase.\n\nData from IntoTheBlock (ITB), a cryptocurrency analytics platform, indicates that at this point, ETH is at its best level in nearly a year, but it is clearly trailing the upward trend that Bitcoin experienced once its spot Exchange-Traded Fund obtained approval.\n\nSource: IntoTheBlock\n\nMoreover, the excitement surrounding Ethereum is palpable as the price approaches its all-time high (ATH) of $4,890. With minimal resistance anticipated, a retest of the ATH seems like a realistic possibility in the near future. This prospect is further amplified by the dwindling number of addresses holding ETH at a break-even point or at a loss.\n\nDencum Upgrade And ETF Speculation Stoke Investor Confidence\n\nBeyond the immediate price action, the Ethereum community is buzzing with anticipation about the upcoming Dencum upgrade. This highly anticipated upgrade is designed to address scalability issues, reduce transaction fees on layer networks, and decongest the Ethereum network.\n\nA successful Dencum upgrade is expected to significantly improve the overall user experience and potentially attract new investors, bolstering confidence in the long-term viability of the Ethereum network.\n\nTotal crypto market cap is currently at $2.5 trillion. Chart: TradingView\n\nAdding another layer of optimism is the ongoing speculation surrounding a potential Ethereum ETF. While regulatory approval from the SEC is still pending, the very possibility of an ETF has buoyed investor sentiment. An ETF would allow traditional investors to gain exposure to Ethereum without the complexities of directly owning and managing cryptocurrency, potentially leading to a wider investor base and increased demand for ETH.\n\nA Look Ahead: Ether Trajectory Hinges On Multiple Factors\n\nWhile the outlook for Ethereum appears bright, there are still factors to consider. The price of ETH remains roughly $1,000 shy of its ATH, and the success of the Dencum upgrade and the approval of an Ethereum ETF are not guaranteed. As with any investment, conducting thorough research and maintaining a cautious approach is crucial.\n\nRelated Reading\n\nDon’t Miss Out: XRP Bull Flag Signals Explosive Price Movement 6 months ago\n\nHowever, the confluence of rising on-chain activity, whale accumulation, and a profitable investor base paints a promising picture for Ethereum. With the Dencum upgrade on the horizon and the possibility of an ETF, Ethereum appears poised for a potential price rally in the coming months.\n\nFeatured image from Pexels, chart from TradingView"
    }
]