[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPYkxOS05VN1FDaFp1akRWNEM5Y2tiZFdNY3NXQTQ4NXFuUC1zYjZWakNSQ1poRWJEcUhSYTNlZDJBYjN5RDdUQklJZUJNVjFzVkN6ZkdpMVBBX0hfTENqb2N6WTE0NlNBeVZ1bUhpcWFHWXNXQ20zUW8ta2JVMmoxZVNNc1J6R1BNV1p4UXk4WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Top 15 Ethereum Competitors and Alternatives in 2024 - Yahoo Finance",
        "content": "In this article, we will discuss the top 15 Ethereum competitors and alternatives in 2024. If you want to skip our analysis about some of the key players in the cryptocurrency market, you can proceed to the section highlighting the Top 5 Ethereum Competitors and Alternatives in 2024.\n\nThe Global Cryptocurrency Market and a Comparison of Giants\n\nAccording to a report by Grand View Research, the global cryptocurrency market was valued at $4.67 billion in 2022 and is projected to grow at a compound annual growth rate (CAGR) of 12.5% from 2023 to 2030, to reach $11.71 billion by the end of the forecasted period. You can also take a look at 15 Best Blockchain and Bitcoin ETFs.\n\nBitcoin and Ethereum are the two most traded cryptocurrencies in the world. Both Bitcoin and Ethereum utilize blockchain technology, however, they have different purposes and technical architectures. Bitcoin was introduced in 2009 by the mysterious Satoshi Nakamoto as a decentralized digital currency primarily tailored for peer-to-peer digital transactions without the involvement of financial institutions. Bitcoin emphasizes security, and scarcity with its blockchain optimized primarily for monetary transactions. Bitcoin is powered by the energy-intensive Proof-of-Work (PoW) consensus mechanism and operates on the SHA-256 hash algorithm, Bitcoin has the highest market capitalization among all cryptocurrencies, valued at over $1.3 trillion on April 14. However, its smart contract capabilities are limited compared to Ethereum. You can 15 Countries Where Bitcoin is Legal and Illegal.\n\nEthereum on the other hand was launched in 2015 and is a global, open-source platform for decentralized applications that empowers developers to build decentralized applications (dApps) and execute smart contracts, which are self-executing agreements encoded in code. Examples of decentralized apps that can be built on Ethereum include tokens, non-fungible tokens, decentralized finance apps, lending protocols, and decentralized exchanges. Tokens are interchangeable digital assets that represent value on a blockchain. Non-fungible tokens (NFTs) are unique, non-interchangeable tokens that represent ownership of digital items such as art, collectibles, or virtual real estate. Decentralized finance (DeFi) apps are blockchain-based financial applications that operate without centralized intermediaries, Lending protocols are DeFi apps that allow users to lend and borrow cryptocurrencies, which often use NFTs as collateral and Decentralized exchanges (DEXs) facilitate the trading of cryptocurrencies in a decentralized manner, without any intermediaries. As of April 14, Ethereum has a market cap of over $386 billion.\n\nStory continues\n\nEthereum charges a fee for transactions and smart contracts on its blockchain network known as Gas which is paid entirely in Ethereum coins. Gas is measured by the amount of computational effort required to execute an operation or a smart contract, the more complex the execution operation is, the more Gas is required to fulfill that operation, and can vary from time to time depending on the network’s demand. Gas fees for Ethereum transactions can range from $0.0001 to over $100, depending on the blockchain’s demand.\n\nKey Players in the Cryptocurrency Market\n\nCompanies offering user-friendly cryptocurrency exchange platforms and providing services such as trading, lending, and wallets have contributed significantly to the growth of the cryptocurrency market and have also established themselves as key players in the digital finance industry. Some of the largest companies offering platforms and wallets for the cryptocurrency market include Coinbase Global Inc. (NYSE:COIN), Robinhood Markets, Inc. (NASDAQ:HOOD), and Block, Inc. (NYSE:SQ).\n\nCoinbase Global Inc. (NYSE:COIN) operates a cryptocurrency exchange platform and is the largest cryptocurrency exchange in the United States in terms of trading volume. On April 3 Coinbase Global Inc. (NYSE:COIN) announced that it had obtained registration as a Restricted Dealer by the Canadian Securities Administrators (CSA), making it the first and largest international cryptocurrency exchange registered in Canada. The registration marks a significant milestone in Coinbase Global Inc.’s (NYSE:COIN) commitment to the Canadian market, following its Enhanced Pre-Registration Undertaking in March 2023 for regulatory compliance and formally launching its services back in August 2023. Coinbase Global Inc. (NYSE:COIN) plans to establish partnerships with local financial institutions and stakeholders in Canada to encourage the adoption of digital assets and promote economic development. On April 11 Coinbase Global Inc. (NYSE:COIN) announced the launch of margined Bitcoin Cash and Litecoin futures contracts by Coinbase Derivatives, making it the first CFTC-regulated exchange to offer such contracts. Dogecoin futures contracts are also expected to launch later this month. Coinbase Derivatives aims to improve access to digital asset trading by reducing upfront capital requirements and ensuring regulatory compliance.\n\nRobinhood Markets, Inc. (NASDAQ:HOOD) provides a user-friendly platform that can be used to trade stocks and cryptocurrencies. On March 19, Robinhood Markets, Inc. (NASDAQ:HOOD) announced its official launch in the United Kingdom and offered key features and benefits for investors including options trading, 5% AER (Annual Equivalent Rate) on uninvested cash, access to over 6,000 global companies, commission-free trading, and no foreign exchange fees on trades, in comparison to the significant fees charged by other UK brokers. On February 29, Robinhood Markets, Inc. (NASDAQ:HOOD) announced its collaboration with Arbitrum, a Layer 2 scaling solution that will give Robinhood Wallet users access to Arbitrum swaps through decentralized exchanges. Robinhood Wallet users can now benefit from reduced transaction fees and faster transaction speeds on some of the most prominent networks in the cryptocurrency market. Over the next few months, Robinhood and Arbitrum will also collaborate to facilitate access to cross-chain swaps and other initiatives that are aimed at lowering the barriers to using web3 on Robinhood Wallet. Commenting on the event, Johann Kerbrat, General Manager of Robinhood Markets, Inc.’s (NASDAQ:HOOD) Crypto Divison said:\n\n“Ethereum gas fees are an essential part of securing the network, but these same fees can hinder adoption, Layer 2s like Arbitrum, which is currently the leading chain by total-locked value, help solve this problem for our users. Accessing and transacting on L2s has historically been difficult to non-crypto natives, but Robinhood Wallet now helps strip away the complexities to help onboard those new to web3.”\n\nBlock, Inc. (NYSE:SQ), formerly known as Square, Inc. is a global technology company with a focus on financial services and owns Square, Cash App, TIDAL, and TBD. On December 07, 2023, Block, Inc. (NYSE:SQ) launched Bitkey a self-custody cryptocurrency wallet in over 95 countries across six continents that consists of three components: a mobile app for seamless transactions on smartphones, a hardware device for securely storing cryptocurrencies offline, and a set of recovery tools in case customers lose their phone, hardware, or both. Unlike traditional self-custody wallets, Bitkey uses three keys to secure cryptocurrencies: one integrated into the mobile application, another in the hardware device, and the third stored on Bitkey’s server. Any two keys can be used to move cryptocurrencies or approve other security-related actions such as initiating recovery or modifying security settings. Bitkey has also partnered with prominent platforms like Coinbase and Cash App, enabling seamless transfers of cryptocurrencies from exchanges to the Bitkey wallet.\n\nEthereum's decentralized platform not only facilitates digital transactions but has also transformed the landscape of decentralized applications as they operate on a distributed network of servers and are not prone to censorship and fraudulent activities. As the cryptocurrency market continues to evolve, innovations in blockchain technology will further expand the possibilities within the cryptocurrency industry. With this context, let’s take a look at the list of the top 15 Ethereum competitors and alternatives in 2024. You can also take a look at the best day trading tips for beginners.\n\nTop 15 Ethereum Competitors and Alternatives in 2024\n\nnick-chong-0bO235Rhqec-unsplash\n\nOur Methodology\n\nTo come up with the top 15 Ethereum competitors and alternatives in 2024, we employed a consensus approach. We consulted more than 10 articles on the internet to find the top Ethereum competitors and alternatives in 2024. Of them, we picked cryptocurrencies that appeared in 50% of our sources and ranked them according to their market cap as of April 14, 2024. Here are the top 15 Ethereum competitors and alternatives in 2024.\n\nTop 15 Ethereum Competitors and Alternatives in 2024\n\n15. Filecoin (FIL)\n\nMarket Cap as of April 14: $3.42 billion\n\nFilecoin (FIL) is an open-source, public cryptocurrency and digital payment system made by Protocol Lab. Filecoin (FIL) allows users to rent out their unused storage space and earn tokens in return and creates a decentralized marketplace where one can store information securely and efficiently. Filecoin (FIL) ranks 15th on our list of top 15 Ethereum competitors and alternatives in 2024.\n\n14. Polygon (MATIC)\n\nMarket Cap as of April 14: $7.31 billion\n\nPolygon (MATIC), formerly known as Matic Network, is one of the top Ethereum alternatives in 2024 for processing transactions faster and cost-effectively. Polygon (MATIC) provides a solution for the Ethereum blockchain by offering a way to process transactions off the Ethereum blockchain and then commit them back to the main blockchain. Polygon (MATIC) plays a pivotal role in facilitating transactions and decentralized applications as Ethereum’s blockchain can be slow and expensive to use.\n\n13. Chainlink (LINK)\n\nMarket Cap as of April 14: $8.58 billion\n\nChainlink (LINK) is a decentralized oracle network designed to connect different networks and protocols. Chainlink (LINK) enables smart contracts to securely interact with external data sources, APIs, and payment systems to expand their capabilities. Chainlink (LINK) supports data movement between all blockchains worldwide and is one of the top 15 Ethereum competitors and alternatives in 2024.\n\n12. USD Coin (USDC)\n\nMarket Cap as of April 14: $9.69 billion\n\nUSD Coin (USDC) is a stablecoin pegged to the US dollar on a 1:1 basis. USD Coin (USDC) is issued by regulated financial institutions and is fully backed up by reserved assets. USD Coin (USDC) is commonly used for trading, investing, and transferring value on blockchain networks. USD Coin (USDC) ranks 12 in our list of top 15 Ethereum competitors and alternatives in 2024.\n\n11. Tron (TRX)\n\nMarket Cap as of April 14: $9.87 billion\n\nTron (TRX) is a blockchain and peer-to-peer (P2P) network that enables content creators to sell their content directly to consumers without any intermediaries and transaction fees. Tron (TRX) is developed by the Tron network and is used for various purposes, including transactions, smart contracts, and voting on network governance. As of 2024, Tron (TRX) is one of the top competitors and an alternative to Ethereum.\n\n10. Polkadot (DOT)\n\nMarket Cap as of April 14: $9.98 billion\n\nPolkadot (DOT) is a scalable, secure, and decentralized multi-chain network for the next web and is built on the Substrate framework. Polkadot (DOT) allows independent blockchains to share information and assets securely and creates an interconnected and scalable ecosystem. Polkadot (DOT) is one of the top Ethereum competitors and alternatives in 2024, developers can use the Polkadot (DOT) infrastructure to create custom blockchains with larger design spaces for decentralized assets and applications.\n\n9. Avalanche (AVAX)\n\nMarket Cap as of April 14: $14.10 billion\n\nAvalanche (AVAX) is a blockchain platform that offers tools for creating decentralized finance (DeFi) applications, financial assets, and enterprise-scale financial solutions and is one of the top competitors and alternatives to Ethereum in 2024. Avalanche (AVAX) is also compatible with Ethereum and its network is designed on multi-chain linear scalability which can process over 4,500 transactions per second.\n\n8. Shiba Inu (SHIB)\n\nMarket Cap as of April 14: $14.21 billion\n\nShiba Inu (SHIB) is a meme-based cryptocurrency inspired by the Dogecoin community and is one of the top competitors and alternatives to Ethereum in 2024. Shiba Inu (SHIB) creates a decentralized ecosystem for artists, creators, and developers to collaborate and build projects. Shiba Inu (SHIB) is the native token of the ShibaSwap decentralized exchange and is used for various purposes including as a peer-to-peer digital payment system.\n\n7. Cardano (ADA)\n\nMarket Cap as of April 14: $17.65 billion\n\nCardano (ADA) is a decentralized Proof-of-Stake (PoS) blockchain that requires less energy to operate compared to the Proof-of-Work (PoW) mechanism. Cardano (ADA) was developed by Ethereum’s co-founder Charles Hoskinson as a platform for Web3 applications. As of 2024, Cardano (ADA) is one of the top competitors to Ethereum.\n\n6. Dogecoin (DOGE)\n\nMarket Cap as of April 14: $23.95 billion\n\nDogecoin (DOGE) started as a joke based on the popular \"Doge\" meme and since then has gained a significant following and community. Dogecoin (DOGE) is a decentralized cryptocurrency that can be used for peer-to-peer transactions, tipping, and charitable donations and is one of the top 15 Ethereum competitors and alternatives in 2024. Dogecoin (DOGE) is known for its strong community spirit and has been supported by various celebrities and influencers.\n\nClick to continue reading Top 5 Ethereum Competitors and Alternatives in 2024.\n\nSuggested Articles:\n\nDisclosure: None. Top 15 Ethereum Competitors and Alternatives in 2024 is originally published on Insider Monkey."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPYkUtaGQ3UUNLX2dlQzJZV29WbXpyRk9xdlN2Nk1yYUl3VXROY1dZNHFsT0tBSkI2ZXlNTG4zaEhWc1VLTHJ6NURVRlpUajF2emlXUnVDNHpRcXNFc2dpVlFNZmJ4RTFWemkwdW1pR2FvZWJCdGJFZ2JMM0ZON3RoRVI0Zmg3WG1sYWtLVVE4UUZOcnYxOUYzM3JxY3M5MVdiOVlLWVFFMjFmVm1nbGwtSjUzcUM4WnFCZi1pWHI3dnpaXzDSAcgBQVVfeXFMTzlYRW9KT3lzci1qRE5IYWZDT2kwLTNJekFDc2N0SzVUMTd6UzU0bHhYUi1CM0ZucHR2MEhFeGdJNnBHMV9vSngtQndmNEptajBQTkNYVlVkR2lVOHNFMlRlZ2pFM1VINW8yTl95SkJLd0RpMEV3ZHJ3SG83aEZ4SkxBWF91bHlTOTVCd1dyZVRsemN5V3luczE3NjVuUkhwaXl3RDBJLVpOWWJaTjlBTXgyalloUFBrSUlMMFJFUHVBOURjbWxfVDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "New court filings show SEC, Chair Gensler believed ethereum was a security for at least a year - Fox Business",
        "content": "EXCLUSIVE: The Securities and Exchange Commission and its chairman, Gary Gensler, appear to have believed for at least a year that the second largest cryptocurrency, ethereum, may be an unregistered security trading out of compliance with current federal regulations, FOX Business has learned.\n\nThe revelation comes following the filing of an unredacted complaint against the agency by ethereum software company Consensys. The company filed the redacted version of the lawsuit in a Texas federal court last Thursday in response to a so-called Wells notice it received detailing the SEC’s plans to sue the firm for failing to comply with federal securities laws.\n\nThe new documents, filed Monday morning, have yet to be reported. They provide insight into the timeline behind the SEC’s thinking regarding ethereum's alleged status as a security, and shed light on what has been perhaps the biggest question facing the $2 trillion digital asset industry about the regulatory status of a cryptocurrency that is held by millions of investors.\n\nIt should be noted that formal investigations are considered an early step in an SEC investigation and are not necessarily indicative of the wider views of the Commission. An SEC spokesman declined comment.\n\nCRYPTO INDUSTRY FIGHTS BACK AGAINST GOVERNMENT CRACKDOWN\n\nConsensys made waves in the crypto world last week when it filed a lawsuit against the SEC claiming the agency is attempting an unlawful power grab by seeking to classify ethereum as a security.\n\nAccording to the new filing, on March 28, 2023, the head of the SEC's Division of Enforcement, Gurbir Grewal, approved a formal order of investigation into ethereum’s status as a security, authorizing enforcement staff to investigate and subpoena individuals and entities involved in the buying and selling of the ethereum token.\n\nConsensys, established by one of the ethereum blockchain founders, Joe Lubin, was among a handful of firms associated with ethereum to receive a subpoena from the SEC around this time, according to a source familiar with the matter.\n\nCOINBASE DUNKS ON TRADITIONAL PAYMENT METHODS IN $15M NBA AD SPEND\n\nThe filing says the \"Ethereum 2.0\" investigation, as it was called, was based on the SEC's belief that \"possible offers and sales of certain securities, including, but not limited to ETH,\" had occurred since at least 2018. If the Gensler SEC finds ethereum to be a security, it would contradict prior SEC guidance under Chairman Jay Clayton; in June of that year, then-Director of Corporation Finance Bill Hinman stated in a speech the SEC's position that ethereum, alongside bitcoin, was not a security.\n\nHinman had no immediate comment.\n\nThe price of ethereum jumped 10% following Hinman’s speech, which he gave at the Yahoo Finance All Markets Summit, as the crypto industry understood the SEC would not be regulating ethereum or bitcoin because, according to Hinman, they were both \"sufficiently decentralized.\" A year later, the Commodity Futures Trading Commission announced ether to be a commodity that falls under its jurisdiction.\n\nConsensys stated in its lawsuit that it built its business against the backdrop of this regulatory unanimity.\n\nSEN. WARREN CHALLENGER GOES TO BAT FOR COINBASE, CRYPTO INDUSTRY IN SEC LAWSUIT\n\nThe new filings show that the five-member commission approved the Division of Enforcement's \"Ethereum 2.0\" investigation on April 13, 2023, just five days before Gensler appeared before the House Financial Services Committee, where he refused to answer repeated questions from committee Chairman Patrick McHenry, R-N.C., on whether the SEC believed ethereum to be a security.\n\nIn launching the investigation, enforcement staff moved with what securities lawyers say is unusual secrecy. Sources with direct knowledge of the matter tell FOX Business that subpoena recipients were instructed by the SEC to sign confidentiality agreements in order to receive information about the progress of the probes. A source who received a subpoena compared the interaction with the SEC to signing a non-disclosure agreement.\n\nIt's unclear why the SEC sought to keep the unfolding inquiry under such tight wraps, but one motive could be the far-reaching implications for the crypto market if the number two cryptocurrency, with a market cap of nearly $400 billion, is deemed a security.\n\nEven before his testimony, Gensler's reluctance to give a definitive answer on ethereum’s regulatory status raised red flags for the crypto industry. Many speculated that ethereum's September 2022 merge to a so-called \"proof-of-stake\" consensus mechanism – where validators \"stake\" their ethereum holdings to secure the network and create new tokens – made the crypto more like a security than it did on the original \"proof of work\" consensus mechanism that bitcoin runs on.\n\nGensler made comments alluding to this notion shortly after ethereum’s merge, saying that the nature of proof-of-stake tokens could trigger the so-called Howey Test, a Supreme Court ruling courts use to determine whether an asset qualifies as an investment contract and thus a security.\n\nConsensys' lawsuit reveals that the SEC made numerous document requests over the past year asking for more detailed information regarding the company’s role in the merge to proof-of-stake as well as its acquisitions, holdings and sales of ethereum. It also shows the SEC may believe that sales of ethereum pre-merger, as early as 2018, are securities.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe investigation has escalated in recent weeks, with Consensys receiving its fourth document subpoena in March and a Wells notice on April 10, stating the agency’s intent to bring an enforcement action against the firm for allegedly acting as an unregistered broker-dealer offering unregistered securities, including ethereum, through its MetaMask wallet.\n\nThe complaint would mirror ones brought against exchanges Coinbase and Kraken and cross-border payments company Ripple.\n\nConsensys hopes the court will ultimately settle the dispute over ethereum’s regulatory status."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBHUUY3bW80ZENGODNQbmdRZjhPWXFvVlY0NmVJbG4tQURwbk5Od0VicXd1MzY4ZGstMy1XZTA5LXZFbUZwOTgyNzVDRzN4YkI1U0dfdUhsNlJXQW5zbWJ1bzNVSUhYYm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC considered Ethereum unregistered security for at least a year: FOX Business - Crypto Briefing",
        "content": "Ethereum's legal status is questioned amid SEC's intensifying scrutiny.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC), led by Chairman Gary Gensler, has been operating under the belief that Ethereum (ETH), the second-largest crypto, is an unregistered security. This perspective has been held for at least a year, FOX Business reported on Monday, citing recent court filings.\n\nThe filings emerged from a lawsuit filed by Ethereum software company Consensys last week, which is challenging the SEC’s attempt to classify Ethereum as a security. Consensys’ legal action follows a Wells Notice from the SEC, which signaled the agency’s intention to sue the firm for not complying with federal securities laws.\n\nAccording to FOX Business, the documents reveal that the SEC’s Enforcement Division, under the direction of Gurbir Grewal, initiated a formal investigation into Ethereum’s status as a security in March 2023. This investigation, referred to as the “Ethereum 2.0” investigation, aims to explore transactions and activities related to Ethereum dating back to at least 2018.\n\nSources familiar with the matter told FOX Business that the SEC sent multiple document requests and subpoenas to firms associated with Ethereum, including Consensys. MetaMask’s parent company reportedly received four subpoenas from the SEC and a Wells Notice.\n\nThe SEC’s current position appears to contradict previous guidance from 2018 when then-Director of Corporation Finance at the SEC Bill Hinman stated that Ethereum was not considered a security due to its decentralized nature. Comparatively, the Commodity Futures Trading Commission later classified ETH as a commodity.\n\nConsensys’ legal action against the SEC aims for the court to resolve the dispute over Ethereum’s regulatory status, a case that could have wide-reaching implications for the crypto industry, akin to previous cases against major platforms like Coinbase and Kraken."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOQk5rekwyYXhLeFVvSU56M21MRmVxS3dqVzVrdXZCelhVX1kteFpRSmJMTHpxRVFOOEFBaFNHTEVaektNZEpjUmRoR2Y4LTFNdVNvc2h5OGVBeGd1Z0pudDdvelhPSjhWZTYzNTh2NkRWd1JWUmhuM1hObldaNnZseUZXRWlCQ3Y4cDVWcdIBlAFBVV95cUxNVlVnQ3I4a2VrS3k1ZjlGOHBzQmhXM3RMN2lXUThBcWhmYzNxY2xCLUxzaHFMUkh3ZEhxMzB6NFBNT0FZNXJKam1lbjd3MGJjMVBsLXFESnVXOFpJX2swYzZzX1VZNHVBcjZVZ1ZxZXJzeHNSUFJWQ2RUZVYxUkNjbjBuSXRkdDVleWZqeUR3OTFYajQ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC Has Secretly Considered Ethereum a Security Since 2023, Says Consensys in Unredacted Lawsuit - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission (SEC) has internally considered Ethereum to be a security for over a year, according to previously redacted portions of a lawsuit filed by software giant Consensys against the SEC that were revealed this morning.\n\nPer Consensys’ complaint, Gurbir Grewal, the Commission’s Director of the Division of Enforcement, issued an internal Formal Order on March 28, 2023, announcing an investigation into “Ethereum 2.0,” authorizing employees of the regulator to investigate and subpoena parties involved in the buying and selling of ETH.\n\nThe order, which Consensys says was approved by the Commission on April 13, 2023, explicitly refers to Ethereum as a security in and of itself, as it authorizes the investigation of “certain securities, including, but not limited to ETH, as to which no registration statement was or is in effect… and for which no exemption was or is available.”\n\nThe revelation that the SEC has officially considered ETH to be a security for over a year is a remarkable one. SEC Chair Gary Gensler has repeatedly deferred when asked explicitly regarding the agency’s stance on the matter. As recently as last month, Gensler refused to state the SEC’s position when it comes to ETH.\n\nAD\n\nAD\n\nAn SEC spokesperson told Decrypt that the regulator declines to comment on the matter.\n\nEthereum, which had already been sagging with the rest of the market on Monday, was trading for $3,143.69 at the time of writing—marking a 5% slip from this time yesterday, but only 1.5% lower than this time last week, according to CoinGecko data.\n\nFor years, the crypto industry has held out hope that Ethereum—the second largest cryptocurrency in the world after Bitcoin, and the foundation of the massive Ethereum ecosystem—might be considered a commodity in the American government’s eyes, paving the way for ETH’s integration into the American economy on a trajectory similar to Bitcoin.\n\nThe head of the Commodity Futures Trading Commission (CFTC) has explicitly declared Ethereum to be a commodity in the past.\n\nAD\n\nAD\n\nIt would appear that the SEC’s scrutiny of Ethereum escalated after the blockchain’s September 2022 merge event, which transitioned it to an energy-efficient proof of stake consensus mechanism. That new structure now allows users to stake ETH with the network to help it function—and accrue rewards in the process—a financial incentive the SEC clearly takes issue with.\n\nIn the year following the SEC’s reported internal Formal Order regarding Ethereum, the agency has steadily ratcheted up its offensive against entities involved with the cryptocurrency. In February, the Ethereum Foundation, the Swiss non-profit that supports the Ethereum ecosystem, was subpoenaed by an unnamed “state authority.” Several American crypto companies have received subpoenas related to their dealings with the Ethereum Foundation.\n\nAnd last week, Consensys, perhaps the largest Ethereum-focused American company, filed a preemptive lawsuit against the SEC, arguing that it does not have the grounds to regulate Ethereum, as the asset should not be classified as a security.\n\nEditor's note: This story was updated to reflect the SEC's decision not to comment on the unredacted lawsuit and to clarify the process of ETH staking.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE40NHdhWFRTekIzUnI2RGs4Qnk0SGVQV1VrakZmMGR0T1M3d3kyWm1aZ0N5el9ZcndJVnpIYUp4U0cyNjRCbXRKYlV1WTROQ2p4VkxVVFdhNk5tb2NUdWtGR1V4MUE1cDNCbGd0Wk5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: How to Trade ETH After Approval of Spot ETFs - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNMWE4OTdzRVh6ZWhCem1NLVFmYkI5WmFVOVJEVGRLOFdiR0hGSm9WcEhXTUhKSDFyeGtNU3dGTUFtR1ZVMU53eU1DMjA1Zy1hRzVGTWZwbTQ3U0p1STc3QVA1dGw5OTY3eU5fa0dzSmJxdmZiMkg4ZlJpeVdUT1VwcEpsckV1dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC has considered Ethereum a security for extended period - crypto.news",
        "content": "The U.S. SEC and its Chairman, Gary Gensler, have considered Ethereum a security for at least a year.\n\nAccording to FOX Business, Consensys, which develops Ethereum software, filed an unredacted complaint against the agency after this was revealed.\n\nThe document states that the Ethereum 2.0 investigation was based on the SEC’s belief that possible offers and sales of certain securities, including but not limited to ETH, had occurred since at least 2018.\n\nThe Consensys lawsuit shows that the SEC has made multiple document requests over the past year asking for more details about the company’s role in the proof-of-stake (PoS) update and its acquisitions, holdings, and sales of Ethereum. Documents also show that the SEC may believe that sales of Ethereum even before the 2018 merger were securities.\n\nYou might also like: Spot Ethereum ETFs reportedly facing potential SEC denial\n\nThe SEC’s belief that Ethereum is a security contradicts the previous guidance under the chairmanship of Jay Clayton. Additionally, in June of 2018, then-CFO Bill Hinman stated in a speech the SEC’s position that Ethereum, along with Bitcoin, is not a security.\n\nEven before Gensler’s testimony, the chairman’s reluctance to give a definitive answer on Ethereum’s regulatory status raised alarm bells for the crypto industry. Many speculate that Ethereum’s Merge has made the cryptocurrency more security-like than the original consensus mechanism.\n\nConsensys initiated legal action against the SEC to keep the regulator from overseeing the Ethereum blockchain.\n\nConsensys said its action against the SEC followed the April 10 Wells notice indicating the regulator was preparing to take enforcement action against the company regarding its MetaMask wallet services. The company emphasized that MetaMask is not a broker and “does not store clients’ digital assets or perform any transactional functions.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPeFBUS1BHVEJiNFEzeEVKWTlqV21VbHVrdVcwOGV2WTdXNmxibUpvdTZMazJQaU9sbi1WUFRoSHU1R2FSOE1YaUVOZjduVWVSX09NTWtlUVQtajdWMTdLMFBkQ1V6aVA2Tjlwa2JDWnhYMFo3dUhES1NoRXhheERFVGpyQUh5NjZJRmVuajhUZkgzTmU1YkRwRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum, Dogecoin, and Bitcoin Cash Are Slumping Today - The Motley Fool",
        "content": "These three large-cap tokens are seeing various regulatory pressures impact their valuations today.\n\nMany of the closest-watched large-cap cryptocurrencies are seeing significant selling pressure in the market today. Ethereum (ETH -1.79%), Dogecoin (DOGE -5.49%) and Bitcoin Cash (BCH -2.13%) have dropped 4.5%, 5.8%, and 3.8%, respectively, over the past 24 hours as of 2:30 p.m. ET.\n\nThese moves come despite relatively strong price action in the stock market, with a number of more speculative meme stocks surging today. With cryptocurrencies associated closely with these assets (particularly when we're talking about meme tokens such as Dogecoin), one needs to ask the question -- what's going on here?\n\nIt does appear some uncertainty around this week's upcoming Federal Reserve Open Market Committee meeting is leading to declines among major tokens, driving uncertainty with the macro backdrop in this space. But there are also some key token-specific fundamental factors that also appear to be in play. Let's dive into what's causing today's turmoil among these three top tokens.\n\nMacro/regulatory uncertainty remains\n\nEthereum's status as the world's second-largest cryptocurrency means it's a top digital asset of focus for many conventional investors looking to diversify into this space. What it also means is that regulators tend to pay greater attention to this token, particularly with an upcoming decision on spot Ethereum ETFs looming. Uncertainty around these ETF approvals in the U.S. continues to remain high, despite other jurisdictions already approving exchange-traded products aimed at Ethereum.\n\nAdditionally, a lawsuit filed against the SEC by Ethereum developer Consensys has generated significant attention in recent days. This lawsuit aims to prevent what the developer calls an \"unlawful seizure of authority,\" a move many in the crypto community are applauding, ahead of key regulatory decisions in this realm.\n\nOther regulatory impact of various moves from exchanges such as Coinbase (COIN -5.55%) to list Dogecoin futures, among other products, remains to be seen. For now, these three tokens will likely receive outsized scrutiny on this front, with investors clearly taking a more cautious approach to these assets in today's session.\n\nThis slate of regulatory concerns can be capped off by news that a recent payment update on claims tied to Bitcoin Cash and other tokens for those impacted by the Mt. Gox debacle years ago has been provided. This update indicates a completion date for claims has been put forward, leading to likely selling pressure for Bitcoin Cash, at least over the near term.\n\nWill this bearish momentum continue?\n\nFor now, there are plenty of regulatory-related headwinds investors appear to be pricing into the crypto sector. These three tokens have perhaps the most unique and noticeable headwinds, though it's also true that the Securities and Exchange Commission has continue to drive home a hawkish narrative on the space. That could mean continued uncertainty over the near term, which often leads to the kind of volatility we're seeing today.\n\nIt remains to be seen if we'll see an immediate bounce-back from this selling pressure. The crypto market continues to see impressive attention, and while capital flows into digital assets appears to be slowing, these projects are worth considering. Thus, for now, I'm going to keep these projects on my watch list and provide updates as they come."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNQVVsYkhmcHBZMndoV2RwNXR0ZjdaWGswUkdpRWlQWmtKTS1mT08wU3ZxTldJRlVNc1RZdkhPaUkzNUx4aWNJVU0zczVPN0M4UDdpd3VUZWgtelh5djJ4NUZKMGVXMmZ0QTQ4elg1cmJneU9odml5RGk3UUtuWUlSOTRkSzZ1XzJHb1lRN29KRDQwNzgwOWVIbFVHdTk0andocHN4ZzB1bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC suspected Ethereum was a security since 2018, new Consensys documents reveal - CryptoSlate",
        "content": "The Gary Gensler-led Securities and Exchange Commission (SEC) began investigating Ethereum’s security status last year, according to an April 29 court filing by Consensys.\n\nThe filing disclosed that Gurbir Grewal, the Director of the Division of Enforcement, sanctioned the Formal Order of Investigation concerning ‘Ethereum 2.0’ in March 2023. This Formal Order conferred broader authority upon SEC staff to investigate and subpoena individuals and entities involved in ETH transactions.\n\nIt added:\n\n“The Formal Order predicates this delegation on the SEC’s information showing possible offers and sales, since at least 2018, of ‘certain securities, including, but not limited to ETH, as to which no registration statement was or is in effect . . . and for which no exemption was or is available.'”\n\nSubsequently, the SEC has issued subpoenas to numerous individuals and entities with investments in Ethereum, including Consensys.\n\nNotably, this revelation emerged a few days after Consensys lodged a legal action against the SEC on April 25. The company contended that the SEC’s attempt to classify Ethereum as a security represented regulatory overreach, warning that such a designation could stifle innovation and adversely affect developers, investors, and entities utilizing Ethereum’s decentralized infrastructure.\n\nEthereum’s regulatory status\n\nEthereum’s regulatory status has been a persistent issue for the SEC in recent years.\n\nIn 2018, Gensler stated during a lecture at the Massachusetts Institute of Technology that ETH is not considered a security.\n\nHowever, Gensler’s stance seems to have shifted, particularly following Ethereum’s transition to proof of stake. Despite this, he has refrained from definitively addressing ETH’s status, despite numerous inquiries from stakeholders, including members of Congress.\n\nWhile Gensler has remained silent on the matter, proponents in the crypto community have cited remarks from former SEC officials like Bill Hinman, as well as legal filings from financial regulatory bodies such as the Commodities Futures Trading Commission, to argue that Ethereum does not meet the criteria for classification as a security.\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxONENycUgxUG9jZF9GNzhSS0JBanMtRFVzMlN0VDNtYjJuSFlJTHVwQVJleGs5a1owX2s3VERuX3dBR1VheG1NTzIyR3l5S0JwS2xqVjNpMXk2QlVFU0NsNmh1ZWdyNjdNenRZQklCWVpwQk9sXy03TDNTSl9CVy1UZmd5Nm4yV09pX3VSR1k2UFVYbERfODZmSHU5Q3FTOGtpbldRWnVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Forecast: Imminent Rebound to $3,500? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFAxM0djNFY5Ylo2ZGRFX0VlcGpndmx1ZkZxNkRuSU1LU2w3eXRCR2gyTE94SFQ4UGdmeWU5QWVaR0JhWnhIR3lOdzgzN2VkZUlkUXRiYl9UeDRWbS1maWFwUnVOVGNYRlpSM0c2YTc5SDlzRzAybE10bmlB0gF_QVVfeXFMTUFhMGM0ODJvbTJqRFNYOWUtb2JXTDlzeWswaWpNN2NfMG5HS1NWeEJtOXRwTk9WeE9GQUM0dG1kY2hlNnJtRl9ZWmM3THdHUWJXY29vVjkwbkNhaXZ2dnV5ZDEzMldrcm1iR0dRZEl5bk5wU1dheTNLWXlUdG1vdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Binance Seeing Ethereum Whales Outflow: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBinance has experienced significant outflows: 14,146 ETH, valued at approximately $46.74 million, within 24 hours. Notably, a fresh wallet also extracted 95.67 million USDT along with 7,402 ETH, equating to around $23.3 million. The activity mirrors the withdrawal patterns of two other wallets known for moving large quantities of ETH and stablecoins off the platform.\n\nAdvertisement\n\nThe smart money tracking service Lookonchain even raised a question: Could these transactions be linked to Justin Sun, known for his substantial funds movements, or are they simply routine redistributions? While the identity of the wallet owners remains unconfirmed, the movement of such large sums is not necessarily an alarm signal. It is often a simple transfer of funds.\n\nRecently, Binance has been witnessing continuous outflows and a dip in market share. This could suggest a trend of whales gradually reducing their presence on the exchange. It is important to consider these movements within the market's current tendencies.\n\nEthereum price chart suggests the second-biggest currency is currently in a mixed position. Ethereum's price appears to be consolidating with current support at the $2,900 level. If there is a potential growth scenario toward resistance at $3,400, ETH would need to maintain the current pace. A break beyond that could see Ethereum challenging higher levels, possibly around the $3,650 mark.\n\nAdvertisement\n\nHowever, if support at $2,900 is breached, Ethereum might face a slide toward the next support region near $2,800. Whales' actions, like those possibly associated with Justin Sun, can influence market sentiment, but the price chart suggests a steadiness that may not be easily swayed by individual transactions, regardless of their size.\n\nWhile the outflows from Binance and market share reduction could be part of a funds redistribution by large-scale investors, Ethereum's technical indicators and support levels remain mixed."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbkRDemVjb1ZRZ0NDblBQdHRUS09yTEVOME90UjYwckxOMURqb01WSGJ3X1RqQ2lQT1o0RWFncFlnckkxeEJwM3BBb2VoRkxHYS1WR2wxZ2Y1dzYxcGoyR2RabnI5c0liX01zMEViNExiS0VWb195aHlmYmhFa2daZll2Ul9ZQTI3SUIzR1hPcm5CM2N3WWVXSjU2VzVWOFdnOENZMVZVa1NxWENMRzZ5VzNoTTE0eGd5SzJGNjNHVTVnMzJFVnZ3WGM4TUV4UmRm0gHWAUFVX3lxTE11NDRHeUtnSXl5U3RuSFg5VENjZWFkd0F3YmRCbjU2YWs4azB0ektDSDRnMWZwdDVfNzIwYXI5R3dmNkxiMzMtYmtHeTJZVWp0UXJOUEhzX0RhTlM5Y0wzZE1LUWNyZExSRU9USThid29WS3plNEt0VW5WdDdLLWloODlWbkR0dE12b3hPZnpyVm8wSElaU3pTMVNjX29zVkhJSTEzbGQ4ckhlMVNiYm1Qakh1Mk5zRUtoY3dQWEliMmFxeEY3bkxCeGxqeHM2Tmx5bUVpUnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Tron Founder Justin Sun Accumulates Over $559,000,000 in Ethereum (ETH) Amid Crypto Correction: Lookonchain - The Daily Hodl",
        "content": "New data from blockchain-tracking service Lookonchain reveals that the founder of Tron (TRX) is gobbling up hundreds of millions of dollars worth of Ethereum (ETH) as the crypto market goes through a correction.\n\nIn a new thread on the social media platform X, Lookonchain says that Justin Sun, who founded Tron in 2017, has accumulated a total of 176,117 ETH worth $559.7 million since April 8th, at an average price of about $3,170 per token.\n\nLast week, Lookonchain spotted a wallet address possibly associated with Sun withdrawing thousands of ETH from the crypto exchange Binance.\n\n“0x4359 (possibly Justin Sun) withdrew 7,128 ETH ($22.34 million) from Binance again… and he had bought 154,570 ETH ($492.23 million) at $3,177 since Apr 8th.”\n\nThe on-chain surveilling platform also previously noted that another address possibly associated with Sun withdrew about $96 million worth of the stablecoin Tether (USDT) and $23.3 million worth of Ethereum from Binance on April 27th.\n\n“Did Justin Sun change [to] a new wallet? A fresh wallet withdrew 95.67 million USDT and 7,402 ETH ($23.3 million) from Binance… This is similar to the previous transaction behavior of two wallets that withdrew large amounts of ETH and stablecoins from Binance.”\n\nEthereum is trading for $3,204 at time of writing, a 3.4% decrease during the last 24 hours.\n\nIn February, Sun revealed that he’s sitting on 28,613 Bitcoin (BTC) worth over $1.622 billion at the time on the crypto exchange HTX, formerly known as Huobi, in response to critics saying that he is not an active user of the platform, which he helped rebrand.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE02a3V5bFlwNjZQdi1SSFRmemZieS04YnUyS2VQcFdDZjJNSzk4QzVRQl9ubS05UGF5Z0dFemxGTEkxdzd0dVNOelRKcmJFdzN2OU5QV3FHWTI3OVhpcE9Wb19sUWZOMVFGNlhwbmNUY255ZncyVEtfSlZURF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Solana Vs Ethereum : Will Solana Take Over Ethereum By End of 2024 ? - CoinGape",
        "content": "Amid crypto market crash following Bitcoin halving, Solana and Ethereum show different levels of performance. Solana’s annual increase of 480.53% contrasts with Ethereum’s decrease of 66.68%. During the previous week, Solana had a drop of 12.05%, whereas Ethereum had a smaller decrease of 1.06%. This article will analyze their most recent market performance, evaluating their potential paths in the current crypto environment and examining if Solana is positioned to surpass Ethereum.\n\nSolana vs Ethereum: Current Price Market Performance\n\nadvertisement\n\nIn the continuous battle between Solana and Ethereum, the market performance illustrates two powerful entities maneuvering through the unpredictable world of cryptocurrency. Solana’s native token SOL is currently at $135.08, showing a 4.50% decrease in value in the last 24 hours. Nevertheless, taking a broader perspective reveals a more detailed story, with SOL undergoing a 12.05% decrease in the week and a significant 27.45% drop in the month.\n\nEven with some temporary obstacles, the token has seen a remarkable increase of 480.53% in the last year, showing its ability to bounce back and remain popular among investors.\n\nIn comparison, Ethereum, along with its famous token ETH, holds a higher value of $3,164.16. However, similar to its opposite, it is dealing with recent changes, showing a 3.84% drop during the day. Nevertheless, Ethereum’s overall trend indicates a more stable path, with only a 1.06% drop in the week and a 10.75% decrease in the month.\n\nSignificantly, ETH has shown a 66.68% decline in value in the last year, highlighting the difficulties encountered in the cryptocurrency market as a whole.\n\nDigging further, Solana’s market capitalization of $6.4 billion places it in the 5th position among cryptocurrencies, according to CoinMarketCap. On the flip side, Ethereum boasts a market cap of $386.2 billion, establishing itself as the second biggest cryptocurrency by market capitalization.\n\nEven though they have different market capitalizations, both platforms show strong trading activity, with Solana seeing $1.98 billion in 24-hour volume and Ethereum reporting $13.5 billion.\n\nAnalyzing price movements, Solana’s recent changes had it moving between $133.96 and $143.78 in a day, whereas Ethereum traded within the range of $3,152.95 to $3,351.18. Both tokens reflect their highest values in the past, with Solana reaching $260.06 two years ago, showing a decline of 48.24%, and Ethereum peaking at $4,891.70, currently experiencing a decrease of 35.54%.\n\nWhat is Ethereum?\n\nEthereum is the second-largest cryptocurrency by market capitalization, operating as an open-source blockchain system with its own digital currency called Ether (ETH). Founded by Vitalik Buterin in 2013, Ethereum allows for the execution of Decentralized Smart Contracts. The project was funded through a public crowd sale in 2014, leading to the official launch of the blockchain in 2015.\n\nEthereum aims to be the global hub for decentralized applications (Dapps), enabling programmers to create and run software without censorship or downtime. The concept of “smart contracts” was pioneered by Ethereum, with co-founder Gavin Wood envisioning it as “one computer for the entire planet.” Recent upgrades like the London Hard Fork and the Dencun Upgrade have brought scaling efficiencies and lower transaction costs to the platform.\n\nWhat Is Solana?\n\nThe Solana project, initiated in 2017 and formally launched in March 2020 by the Solana Foundation, is an open-source platform leveraging blockchain technology for cost-effective DeFi solutions with a focus on speed. Its protocol supports DApp development through smart contract deployment on its blockchain, aiming to enhance scalability with a mix of PoH and PoS consensus mechanisms.\n\nWith SOL crypto priced at $104.69 on March 2, 2022, and reaching an ATH of $260.06 on November 6, 2021, Solana’s efficient model enables swift payment verification at low costs, providing a USP in the crypto industry. The innovative hybrid consensus ensures accessibility for all traders, aligning with the Foundation’s goal of broadening decentralized finance access.\n\nSolana vs Ethereum: Key Features\n\nSolana’s unique Proof-of-History (PoH) consensus mechanism, combined with Proof-of-Stake validation, allows it to process significantly more transactions per second than Ethereum. The platform provides each node with its clock and decision-making ability. The Byzantine Fault Tolerance (BFT) algorithm protects the system from disruptions, ensuring overall functionality. Solana supports multiple smart contracts running simultaneously, enhancing platform efficiency and versatility within its ecosystem.\n\nOn the other hand, Ethereum features smart contracts encoded into code for self-execution, enabling the creation of decentralized applications on its blockchain. Its native crypto is used for transactions and rewarding miners. With a Turing-complete virtual machine, Ethereum executes smart contracts for various applications and allows for the formation of DAOs, governed by code and consensus.\n\nSolana vs Ethereum: Latest News\n\nA potential spot Ethereum ETF could be on the horizon now that spot Bitcoin ETFs are no longer the focus, expected in May. Nevertheless, the schedule for this has not been determined yet, as the SEC has remained silent about the matter.\n\nAdditionally, the Ethereum Dencun Upgrade was successfully launched on the mainnet on March 13, 2024, following its deployment on all the Ethereum testnets. This is a significant advancement in the Ethereum network and a crucial step towards Ethereum 2.0.\n\nOn the other hand Solana received the Crypto of the Year award for its SOL token from CoinMarketCap, recognizing its growth and resilience. This milestone showcases its success among other notable projects in the industry.\n\nFurthermore, Solana-focused devshop Anza has released an update to fix the intermittent congestion issues and expects a sound recovery in the Solana ecosystem.\n\nConclusion: Will Solana Overtake Ethereum?\n\nBoth Solana and Ethereum are significant players in the world of cryptocurrency. Ethereum, the second-largest cryptocurrency, continues to advance with upgrades like the Dencun Upgrade. Meanwhile, Solana has quickly gained recognition, even winning the Crypto of the Year award. The question remains whether Solana will surpass Ethereum by 2024. Solana’s scalability and capabilities make it a strong competitor, but Ethereum’s established environment and continuous updates suggest it will maintain its dominance. The competition between Solana and Ethereum is expected to continue as new technologies, market factors, and regulations evolve."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPdTN4TnJteVpNR2ZRbmJYYkZienlJN3ljMUJ6bVBDcm1wdHkzLWpzNXVDN1ZlNm1SdnRBU2ZzQ000NmdNQzBVckZNdURmMURmal9TR2xQN0c2a184cjdSckRuWmJJVHdqdURVM2REZmRSM2pUQzFMaFZLbkloSmtfelNrMWktMWFRRmfSAY8BQVVfeXFMTkswUDMxazBrN1VxN0N3Nmp4a2xlclV2TGxaV2djNmFtU0kzbkdNNlFWUkF6Yk8wUUpmOW1FR1g2Z3c0S2J0U2NhRnZUUGpxUVJJeTB5bWdhNXVGOS1Hb2tsNGJCNFRpR0p4cHc3RUdQV2RfTld2YTNsMzJnaDBEeldlblJzU1B3TWVsUUJaNmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC Boss Has Long Viewed Ethereum as a Security, New Filing Reveals - U.Today",
        "content": "According to an unredacted version of Consensys's lawsuit against the U.S. Securities and Exchange Commission, SEC Chair Gary Gensler viewed Ethereum, the second-biggest cryptocurrency, as an unregistered security a year ago.\n\nAdvertisement\n\nGurbir Grewal, who is currently serving as the Director of the Division of Enforcement for the SEC, greenlit a formal probe into Ethereum's security status back in March 2023. The investigation involved sending subpoenas to various individuals and entities that have dealt with the Ethereum token.\n\nThe Fox Business report says that the SEC was adamant about making sure that the investigation remained a secret, with one source comparing their experience to being forced to sign a nondisclosure agreement. The parties that received the subpoenas were supposed to remain mum about them if they wanted to get further information about the probe.\n\nAdvertisement\n\nUnsurprisingly, Consensus, the key Ethereum backer, was among the firms that had to deal with subpoenas from the SEC.\n\nAfter filing its lawsuit against the SEC, Consensys revealed that it had received a Wells notice from the regulator earlier this April.\n\nAs reported by U.Today, SEC Chair Gary Gensler has repeatedly refused to answer whether or not Ethereum is an unregistered security. He also dodged this question from Congressman Patrick McHenry during a congressional hearing back in April 2023. Notably, the SEC voted to approve the investigation into Ethereum just days after the hearing took place.\n\nThe SEC's hostile stance toward Ethereum does not come as a surprise. In a recent interview with New York Magazine, the SEC boss hinted that the token could be classified as an unregistered security.\n\nGensler previously recognized Ether as a non-security during his MIT days, but Ethereum's long-awaited transition to the proof-of-stake consensus mechanism likely dramatically altered his view."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE02SEoxWHJGNzN1bDRJWjlHZlpsVklISFQ1VTFRdW4wYndreGVVYkdZd1FYTGk4Zk5FV2FNQ0FnQmt5WmtsSnE0WXFKdkRMOXdPUWJ1OGx4bzltdUdMQ25NY083eDg5Z3RKdDZmXzA1aFJ3c0ZVT0ww0gF8QVVfeXFMTjNvbjJ6MkVWN3dOXzMxOXdueTZXZkFSb0Y2UmhrbDhWTndKTUE5OWJHUHhzWWE3c0U4amhkc2owSTNTRmZXUURFZXo2dTJvR0MwM1VWY3hheEtCTlU4QzlLMGE0TTRKc3pGNG1aT09abnRQZzVJaktSV3d3WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Crushing Bitcoin (BTC) with 6% Price Spike - U.Today",
        "content": "Advertisement\n\nThe price of Ethereum , the second-largest cryptocurrency, has surged more than 6% over the past 24 hours.\n\nETH is currently trading at $3,320 on major spot exchanges, according to data provided by CoinGecko .\n\nBitcoin's dominance is currently sitting slightly above the 50% level.\n\nThe ETH/BTC pair is currency sitting at 0.051 BTC after peaking at 0.052 BTC earlier today. The pair is now up nearly 13% over the past two weeks alone. However, the pair is still down 15% from its 2024 peak of 0.061 BTC that was achieved on Jan. 12.\n\nAdvertisement\n\nA major resistance level\n\nAccording to the 100eyes Crypto Scanner account, the second-largest cryptocurrency has now approached a key horizontal resistance at the $3,300 level.\n\nThe largest altcoin came close to surpassing this resistance level on Apr. 24. However, this attempt resulted in a significant correction.\n\nMajor headwinds\n\nEthereum's price recovery came despite the fact that Consensys, the key backer of the second-largest cryptocurrency network, recently sued the U.S. Securities and Exchange Commission after receiving a Wells notice from the regulator.\n\nThe SEC wants to expand its jurisdiction by classifying the flagship altcoin as a security, the firm alleges.\n\nConsensys has already hired some of the best lawyers from Manhattan-based firm Watchtell, meaning that the industry is about to witness another contentious legal battle.\n\nMoreover, some analysts believe that the SEC could potentially face another lawsuit from Grayscale over its refusal to approve a slew of spot Ethereum ETFs in May."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE10RW5wc3ItYVJablh6XzdsRk83a0g1bmZZUkhfSEhJOE9wekt1UGJhb1lNcTdYVlVOdkJMYmxHTVJQNS1zVkJQd2k2NFJwS1R4UkktOWhWMDVLS2ZnS2sxYTZMU2tuMWtmS2tlTEpHblVqbkZuaWRBeA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC Has Been Investigating Ethereum (ETH) Since March 2023 - Watcher Guru",
        "content": "Amid the ongoing regulatory question regarding the second largest cryptocurrency, new court filings reveal that the US Securities and Exchange Commission (SEC) has been investigating Ethereum since 2023. Indeed, the filings show that chairman Gary Gensler and the agency have been seeking to challenge the asset’s security status for a year.\n\nEthereum software firm Consensys filed a lawsuit against the SEC last week. However, they paint an interesting picture of how the agency has viewed the cryptocurrency. Specifically, they note that it has been building a case against the asset since early 2023. Conversely, development is vital as the agency is facing a plethora of Spot Ethereum ETF applications.\n\nJUST IN: 🇺🇸 SEC has been investigating Ethereum since March 2023, new court filing reveals. April 29, 2024\n\nAlso Read: Ethereum May Price Prediction: Can ETH Hit $4,000?\n\nSEC Has Been Seeking to Challenge ETH Security Status Since 2023\n\nThe digital asset market has faced an ever-changing regulatory landscape. Indeed, United States investors have struggled with a lack of clarity in this area regarding the industry. This is in large part due to the SEC and its ongoing enforcement-first approach to regulation.\n\nNow, revealed court filings show that the SEC has been investigating Ethereum since March 2023. Specifically, the agency has reportedly been building a case to challenge ETH’s security status for more than a year.\n\nAccording to reports, the SEC director of the Division of Enforcement, Gurbir Grewal, approved an investigation order in March of last year. That allows the agency to investigate both the buying and selling of Ethereum. The presence of a formal order of investigation allowed the SEC to issue subpoenas and gather witness testimony under oath.\n\nSource: Bloomberg\n\nAlso Read: SEC Sued Over Ethereum, Prosecutors Say ETH Isn’t A Security\n\nThe revelation explains why Gensler had previously refused to answer if Ethereum was a commodity or security at a recent Congressional testimony. According to Consensys, Gensler “did not want to admit that his SEC had already secretly cemented its power-grab” through the investigation order.\n\nThe SEC has been known to target specific digital assets by referring to them as securities in filed lawsuits against cryptocurrency exchanges. In 2023’s lawsuits against Coinbase and Binance, more than ten assets were named security. However, ETH was not included among them."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPakludWU5V3htZ3hqX0xHdUpicEliNjlHSGdzRTBSZjJLSW9PVGNib0tvV3czVUlaUkRFR0FVU1NPa0cwMHBCbTJKS0pkQXN4V2o5UzlvRGZNSnRyY3ZOVTJ1MllvTW9SaVJJZk1PWmFsNHVzc3lQeFF4eTFMN2VnWmtRUFNBRlJxS2VYZGVCYkYySnhXM2tERnJ1LUllZzIyMVd1TtIBrAFBVV95cUxOY3p2LXlYWjVIYVpoTkxrUGMtM1o3d3hpMHdTd21aaDBCRmY5Ykl5QjJwOGhwRFlFd08tT2kxTzkwZ3VlQjkzWW9QS0YxSzVOczBGbDdpYk1taUFXamVMUlRFcUNneFJWTkQwQjU2cUgzQjVZQTI2d0I3b2lHZUxNMFRidXhQT2tLMXNXYnB6VVFKUFNkS2gtNllOTG0yakdxeElBLXpabFV5OUV6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "This Week on Crypto Twitter: Bitcoin Runes Mania and More Ethereum Legal Drama - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt\n\nCrypto Twitter this week was dominated by the industry’s new hottest topic, Bitcoin Runes—plus a steaming hot serving of legal drama in the form of a preemptive lawsuit filed by Ethereum software giant against the U.S. Securities and Exchange Commission (SEC).\n\nEver since Bitcoin’s latest halving, Runes—a new Bitcoin-based protocol that can support fungible tokens like meme coins—has surged in popularity. DOG, a new Runes meme token, was airdropped on Wednesday to holders of the Runestones Ordinal project. The distribution to tens of thousands of wallets immediately made DOG the most popular Runes token yet created.\n\nCheck your wallets! 100,000,000,000 $DOG has been successfully airdropped to Runestone holders. Shoutout to giga-chad volunteer community member @gm7t2 for flawlessly executing it. The journey to $1 has begun 🐕🚀🌕 pic.twitter.com/XPL7q6m7VG — Leonidas (@LeonidasNFT) April 24, 2024\n\nAD\n\nAD\n\nRunes fever took such hold over the cryptosphere this week that activity on the protocol quickly surged to dominate the entire Bitcoin network.\n\nBREAKING: Runes accounted for 72.7% of all Bitcoin transactions in the past 24 hours — Ord.io (@ord_io) April 24, 2024\n\nSome crypto users bemoaned the spike in Bitcoin network fees caused by the Runes frenzy. But other protocol supporters remained steadfast in their conviction that hype around the new class of tokens was only just beginning.\n\noverwhelmed by the number of absolute mid curve takes from people who are fading runes. “sit on your hands for now see how it goes” “all these tickers suck” “the fees are too high for meme coins” bruh you will be buying rune 1 from me for 100x sooner than you think. EZ game. — faXx 🎈| 824.eth (@faxx_eth) April 24, 2024\n\nOver on Ethereum, bullish news was found this week in the eye-popping, multi-million dollar sale of yet another CryptoPunk NFT. Punk #635, an ultra-rare Alien Punk, sold on Thursday for a whopping $12.38 million to an anonymous collector.\n\nAD\n\nAD\n\nThe sale marked the third occasion within weeks that an Alien Punk had traded hands for north of $11 million.\n\nCryptoPunk 635, the Alien originally owned by Larva Labs and sold at the Christie’s Contemporary Art Evening Sale in May 2021, has just been acquired by an anonymous collector in a deal brokered by Fountain. We’re honored to have played a small role in this sale. Congratulations… pic.twitter.com/glisy3MZpv — Fountain (@Fountainxyz) April 25, 2024\n\nIt wasn’t all smiles for everyone in the Ethereum NFT ecosystem, however. On Friday, Yuga Labs, the multi-billion dollar company behind the once-dominant NFT collection Bored Ape Yacht Club, laid off an undisclosed number of employees. In a message to employees, the company’s CEO and co-founder, Greg Solano, conceded that the company has “lost its way.”\n\ngm, really tough day today. I am hellbent on transforming yuga and getting us back to our roots, and that means making hard decisions. by far the hardest is saying goodbye to some talented team members. here was my message to the team this morning. pic.twitter.com/gBkoNf2iK3 — Garga.eth (Greg Solano) 🍌 (@CryptoGarga) April 26, 2024\n\nThe biggest bombshell of the week, however, came on Thursday, when Ethereum software giant Consensys revealed in a proactive lawsuit against the SEC that the federal regulator is allegedly seeking to sue the company and potentially declare Ethereum to be a security in the process.\n\nToday, Consensys filed a lawsuit against the Securities and Exchange Commission. The goal behind this is to ensure that Ethereum remains a vibrant and indispensable blockchain platform and to preserve access for the countless developers, market participants, and institutions… — Consensys (@Consensys) April 25, 2024\n\nIndustry leaders immediately took to Twitter to vocally support the suit, castigating the SEC for potentially attempting to effectively outlaw Ethereum after several other American government entities have indicated that ETH is not within the SEC’s jurisdiction.\n\nI know ETH is a commodity. You know ETH is a commodity. The CFTC knows ETH is a commodity. It's time for the SEC to admit that it still knows ETH is a commodity too. No more games. Thank you to @Consensys for standing up against the SEC's unlawful expansion of authority. https://t.co/8w7A4PBwUK — paulgrewal.eth (@iampaulgrewal) April 25, 2024\n\nAD\n\nAD\n\nHayden Adams, founder of decentralized exchange (DEX) Uniswap, likened the suit to a battle cry for the crypto industry to finally take an aggressive, collective stance against the SEC in a Lord of the Rings-esque battle. Uniswap revealed earlier this month that it, too, is being sued by the SEC for alleged securities violations.\n\nSue the Exchange Commission Thanks @ethereumJoseph and @Consensys for fighting back and defending our industry We're tired of the overreach and harassment https://t.co/yDTjjiaJWl pic.twitter.com/vtWxqKxv9n — hayden.eth 🦄 (@haydenzadams) April 25, 2024\n\nDisclosure: ConsenSys Mesh is one of 22 investors in Decrypt. Edited by Ryan Ozawa."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE94LWFZMEN3UDBBb3ViQzdJZXlWOHI3SW9RRnB0ZzJfTXFXSk4tVEc4em1SZlBlLUUzLVBuc3h3em93dmY5Zm1XUmtId3JKWkR4S3JUNWpQNlVfR2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum is in 'regulatory never neverland': Charlie Gasparino - Fox Business",
        "content": "Log in to comment on videos and join in on the fun."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE44VXprYjdDNVJDVEhTZlZWUS1iMjdhU0tOUXZ2VGVjMjJfY01RMmx2LXVPZzhhMHd0NmZfNlY2c0V2RWtLcThvRDlxbzJhd3hoUi1CbkRTR3JJTWd4T0lwUjk1QnRHT2xiMkwwRkJSNDd3cDVRLXdxZlFKc9IBgAFBVV95cUxPWkNIR3pwLTVIQ0tZbElCN1ZHZ1JTeFhFd19HdGxCa01nell0MFFaNEZLQUxHU2ZFRHo2NTE1V2d5azYwWmtETnJRdlZWUFdwOUtiOWt1U0JnM0ZBaTZsZGNIRDRHR05fNlZqNzNvcG9RNWVPNW1mV0lrdVlFaDk3MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Whale Triggers $38 Million Sell-Off: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent development that has sent ripples across the crypto market, a notable Ethereum (ETH) whale has reportedly initiated a sell-off of a significant amount of the digital asset, totaling a staggering $38 million. The event, highlighted by Lookonchain via X, sheds light on the intricate dynamics within the crypto space, particularly concerning market sentiment and the actions of influential investors.\n\nAdvertisement\n\nAccording to the tweet by Lookonchain, the whale's decision to offload 11,892 ETH, equivalent to $38 million, onto the Binance exchange for sale, has sparked widespread attention and speculation. Notably, this move follows a series of trading activities by the whale, who had previously taken long positions on Ethereum futures. However, the recent deposit for sale marks a significant reversal in their trading strategy, suggesting a shift in sentiment or a reevaluation of market conditions.\n\nAfter the price of $ETH dropped, the whale gave up on long $ETH and deposited all 11,892 $ETH($38M) to #Binance for sale, making ~$217K.\n\n\n\nThis whale has gone long $ETH 3 times since Mar 20, 2 of them were losses, with a total loss of ~$4.63M.https://t.co/SCUoiUoFvz pic.twitter.com/egDBflIHgd — Lookonchain (@lookonchain) April 29, 2024\n\nThe tweet further elucidates the whale's trading history, revealing that since March 20, the individual had undertaken long positions on Ethereum futures on three separate occasions. However, two of these instances resulted in losses, amounting to a cumulative deficit of approximately $4.63 million. This sequence of events underscores the volatility inherent in cryptocurrency markets and the inherent risks associated with trading strategies, even for seasoned investors.\n\nAdvertisement\n\nEthereum price struggles continue\n\nMeanwhile, the broader Ethereum market has been grappling with its own set of challenges. As of the latest data available, Ethereum is currently trading at $3,178, reflecting a decline of 3.86% over the past 24 hours. This downward movement in price underscores the prevailing bearish sentiment that has gripped the crypto landscape in recent sessions, with Ethereum mirroring the broader market trend."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOQTJkTmJMdWN4dHprMVhZX2VBeTBBenlOQnFCQnVjWE5NeEVvelh4alA5Tnd4WUhxS1otRy1icTgweGFtWlJDNWxwZmtUdUVjVkI0LWY3OWowR0J1MHFpMkVrT2NRd0p0Qm95V2hJUnRjQ1o5RlFEOXpxMktwQ0M4aUpqYjMycHpWM2RhOEJnRExpZVRKcVlKNDZFTExBc3pZQkF5VHpaZ1c2V2hWdVNTSkhaNzNaaEx1WFUtVjB0SFB2MFhHbmpUYTNxQkNRYVXSAdQBQVVfeXFMT3JzWGE3d3B2S2dMc29SMmdfb3RidzZmM2xtUlVueEtKV0ozelk1T3JPZ1VRamtuSE1aMWFsam5maFBncmRWNS1WcDZ2cXJLNm51bHh3bW9YdklwRGNaU0NrOG5kNDlGTXdrMmR0TFFCSjBGMkhGdnYtZE1IaXVlNGY0amxaNXNjVFJjckRhdG9yVm8tVWhjUzFvSWdKSVlVdTNzOVVVQVpvN1QzN2V2WEFnM2VSTzF2cmhyN2Z3RUlTREdTR1hldUtKVFI2azB0VXhQVk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum fees drops to lowest level since October, ETH sustains above $3,200 - FXStreet",
        "content": "Ethereum supply is inflating despite relatively high throughput.\n\nAverage fee has nosedived to $1.12 per transaction, lowest since October.\n\nEther sustained above $3,200 on Sunday, up 4% in the past seven days.\n\nEthereum’s high transaction fees has been a sticky issue for the blockchain in the past. This led to Layer 2 chains and scaling solutions developing alternatives for users looking to transact at a lower cost.\n\nThe issue seems to have de-escalated with Ethereum’s average fee level dipping to $1.12 per network transaction. This is one of the lowest levels noted since October 18.\n\nEthereum transaction fee declines\n\nData from Ultrasound Money shows that Ether’s circulating supply has surged, climbing to the highest level witnessed since March. A little over 120 million Ether is in circulation now and the sharp increase in supply can be attributed to the consistent decline in burn rate, in the past two weeks.\n\nGas fees is currently 7.19 Gwei, up from a low value of 4.48 Gwei, as seen on Ultrasound.money. Gas fees is currently $0.62, as seen in YCharts, down from the May 2023 peak of $3.788.\n\nEthereum gas fees\n\nThe Ethereum supply chart shows inflation, and the recent increase sprung on ETH holders as a surprise, after five months of steady deflation. The ETH supply chart below shows the sudden increase in supply.\n\nETH supply\n\nThese catalysts have failed to have a significant impact on Ether price. The altcoin has sustained above $3,200 on Sunday, after relatively less significant moves since the Bitcoin halving. ETH holders are awaiting the Securities and Exchange Commission’s (SEC) decision on Spot Ether ETF and this is likely to emerge as the most significant catalyst for Ethereum."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxORHNFclhpQ0dKYjRyTG9GS3BSNW9oRWJaSlNyekp5LTY5b1EzcllfdFUyVnY3dnlZR3N3d3VEcmlpc3VIc1FXVXRMTGxQbVQxMl9lMkc5U28yY2puQXVtbnRpeVRDT0RUbzNCNEZ4S2dQVmRidzBlN1dPYXYzSlFyM1lfMknSAYoBQVVfeXFMUFp6aUV5d2dQT3gzZUdJNW5qTkFlUnRZS0FXRlpiQkEzMmpYaXJNNnBCbnVDaVN1T29TYVdaSThwNXRONkZIdVhCOGxubS1melBLT1dBWjVnMnZxSFJlbG5IMG5SUkc2blhsTDZ4T1puTkh0OGk0Y0JlaThmblRWU2htRGZQbHJoUl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum responsible for the delay in altcoin season? - AMBCrypto News",
        "content": "The Altcoin Season Index at 35 suggested that the many tokens were not out of depression.\n\nA decline in ETH’s network growth and volume might hinder the upswing.\n\nIf there is one phrase that has been trending in the market for months without almost nothing to show, it’s “altcoin season.”\n\nFor the anticipated period to come to life, Ethereum [ETH] and other non-Bitcoin [BTC] cryptocurrencies have to outperform BTC.\n\nBut that has not happened. In fact, AMBCrypto’s analysis of Blockchaincenter.net revealed that the time was not close. According to the platform, the Altcoin Season Index was at 35.\n\nAlts fails to sustain the preview\n\nTo confirm an altcoin season, the reading has to be at 75. Interestingly, the index hit this height in the last week of January, and the first week of March. But it melted away within days.\n\nA look at tokens like ETH, Cardano [ADA], and Ripple [XRP] showed that their prices decreased in the last 90 days. Unless 75% of the top 50 cryptos outperform BTC, there will be no altcoins season.\n\nConsidering the press time circumstances, one can assume that the period was not close. Apart from the index, one factor that could determine is ETH.\n\nIn 2021, the surge in Ethereum was one of the first movers that activated the price increase that many altcoins experienced.\n\nNotably, less than 20 altcoins out of the top 50 have outperformed Bitcoin in the last 90 days.\n\nBut ETH was not part of them. Furthermore, the cryptocurrency has not been able to make the kind of moves it did in the last bull market.\n\nETH dashes the hope\n\nHowever, if demand for ETH surges, the condition might change, and the price of the token might climb to test its all-time high. For this to take place, a lot of new addresses have to come into the Ethereum network.\n\nTo track this, AMBCrypto looked at network growth. At press time, network growth on Ethereum was 3131, suggesting that the adoption of the cryptocurrency has been unimpressive.\n\nIf the metric continues to decline, ETH’s price might find it challenging to move northward. In this case, altcoin season might continue to be delayed.\n\nOn the other hand, a surge in network growth might spark a rally for the cryptocurrency and other top tokens. In the meantime, an assessment of the volume showed that it was $10.31 billion.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAt the beginning of ETH’s rise to its all-time high, the volume was over $40 billion. Rising volume indicates interest in a cryptocurrency. If consistent, it could lead to higher prices.\n\nWith the low volume, a notable price increase for the altcoin could be unlikely over the next few weeks. In addition, altcoins might need to look away from waiting for ETH before going on months-long rallies."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNR0VaVnJVb0NBUmpLb3BwRXhtMzg4SnBiNDVsTjRzdTVobVFFMXhRR2xNM3o3N0ZoMU1VMkFZTGtOakFZWXBHNHRvOER6cEI4d1dDZFpoekVCRERMX01RMzlRdnJ6dWw5WXJwVGJxLUdpQXZNTkwxWWgyaVJISjhTWV9zV2lqY2kybkJtTFN6bldQSWPSAZsBQVVfeXFMTnJPem1LUkg3V3hnZWJ5alR1UU9pODQ5ZHVsQjNhU2RmMDN0bkVoVjdRTjExRGtCY0dDbDktSE9NSWpnQTFkUFpZSldxRTBWRlZ3SnZ6Ql9HN1lJdDc2cGtjWEE2SXhoc2ptOTZ0aTk5ejZiN1dzVWpHX3RrcmxpWjh2X01UZkF1ekZVaVZ5WmNwZktMZERFNG1Wb1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Restaking Protocol EigenLayer Reveals Token and Airdrop Plans - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Eigen Foundation, which supports the Ethereum restaking protocol EigenLayer, published details about its upcoming token airdrop on Monday.\n\nIn cryptocurrency, staking refers to locking up crypto holdings to support a blockchain's security, integrity, and efficiency by helping to validate transactions. EigenLayer facilitates Ethereum (ETH) “restaking,” which is the ability to use a single stake across multiple blockchains.\n\nBased on a snapshot of eligible wallets taken last month, the Eigen Foundation said the EIGEN token airdrop will take place between May 10 and September 7, spanning 120 days. The initial \"stakedrop\" allocates 5% of the total token supply to users who engaged in staking activities as of March 15.\n\nEligibility for the drop includes people who staked directly with EigenLayer or through liquid restaking tokens (LRTs). The first “Season 1” airdrop, the Eigen Foundation said, consists of two phases, with 90% of tokens going to users who meet the initial eligibility requirements and remaining allocation distributed in a later phase.\n\nAD\n\nAD\n\n“The remaining 10% is for people who interacted with EigenLayer in more complex ways, where determining the appropriate EigenLayer end-user was either not possible or required an opinionated decision,” the group wrote, later posting additional details to Twitter.\n\nClarifications with respect to the Season 1, Phase 2 allocations of 10% (approximately 7.77M EIGEN), Pendle, and certain other unresolved (DeFi) contracts. – Users of Pendle or any unresolved (DeFi) contract are not penalized in the distribution.\n\n– 10% is an approximate… — Eigen Foundation (@eigenfoundation) April 29, 2024\n\nThere are also restrictions, however. The EigenLayer airdrop terms of service disclose that certain regions will be excluded from participating in the drop, enforced through IP address blocks for regions under international sanctions or “deemed high-risk,” including the United States, Canada, China, Cuba, North Korea, Iran, and Venezuela.\n\n“To avoid circumvention of our geo-location controls, the organization has implemented proxy and VPN detection and blocking controls, which are designed to prevent Eigen claims by any person detected to be using VPN and similar proxy technologies,” EigenLayer wrote.\n\nAD\n\nAD\n\nAfter the initial EIGEN drop, 15% of the total supply is reserved for future drops, the foundation explained.\n\nIntroducing the Eigen Foundation, EIGEN token, and Season 1 Stakedrop! pic.twitter.com/lxEVSbRfVB — Eigen Foundation (@eigenfoundation) April 29, 2024\n\nThe Eigen Foundation did not immediately respond to Decrypt’s request for comment.\n\nEigenLayer was founded in 2021, led by former University of Washington data science professor Sreeram Kannan. In February, the total value locked (TVL) on EigenLayer surpassed $3 billion. $560 million of the deposits to EigenLayer were stETH, the liquid staking token created by Lido Finance.\n\nThe newly launched Eigen Foundation will support research and development on the EigenLayer protocol by funding grants, providing third-party evaluations, and “stewarding continued progress toward greater decentralization.”\n\n“The new EIGEN token introduces a complementary mechanism that is designed to specifically address ‘intersubjective’ faults—faults that are not possible to address via ETH restaking alone,” the foundation said. “Intersubjective faults are instances of misbehavior that cannot be objectively identified onchain, yet any two reasonable observers would agree that a penalty is deserved.”\n\nThe news of the stakedrop coincides with the release of EigenLayer’s whitepaper that details the structure and tokenomics of the Eigen ecosystem.\n\n“In the initial phase, the EIGEN token will be non-transferable and non-forkable,” the Eigen Foundation said. “We believe this approach will best support the long-term growth and maturity of the EigenLayer ecosyste\n\nAD\n\nAD\n\n“Upon completion of this phase, the full functionality of the token, including forkability and transferability, will be enabled,” it continued.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUnhhYWJZN21kSDJuU2dFYlNHQXZOMzVpMGx6TGJBUHNDZERnZnpXR2J0eS1DejBNRE82dlhFNkxRSlhzbXpMNEs4dGZCd0NDTzl3OFRGaXJRaDZzV1JUZDRmTDlya0ZWUnQyYmkxMllPenRuTlZjelVRZlRmOWFoR3JFN1lCY0ptYTlrYnVB0gGTAUFVX3lxTE5BUGRwaWdWTnlXTXZXb3lqZFBjNTNKMThHaTU5ZEFqRUZkQl9vMkJpWVlNX2VCNE85NXhwWi1WNVdxTWdTTWQ1Z0Y0S0laa3hNRGVMSDlVVUdXR09LbEdTQlZfcEtSYmFRNU4xMll3RlpXTXNLUVpWelVYZVQtcHpQMVZfdHIwX2liMkhyNWR2ZWxadw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Breaking: SEC, Gary Gensler Considered Ethereum As Security – Court - CoinGape",
        "content": "A new report suggests SEC Chairman Gary Gensler believes Ethereum (ETH) was a security for the last 12 months. An April 29 Fox Business report states that Gensler believed for at least a year that Ethereum was an unregistered security. This is in contrast to the previous positions of the Securities and Exchange Commission (SEC) regarding Ethereum’s status as a commodity.\n\nAccording to the report, a new court document filed today may provide more insights into the timeframe behind the Commission’s alleged grouping of Ethereum as a security. If the newly launched investigations point to Ethereum as a security, it contradicts previous statements by the financial regulator.\n\nadvertisement\n\n“The new documents, filed Monday morning, have yet to be reported. They provide insight into the timeline behind the SEC’s thinking regarding Ethereum’s alleged status as a security, and shed light on what has been perhaps the biggest question facing the $2 trillion digital asset industry about the regulatory status of a cryptocurrency that is held by millions of investors.”\n\nConsensys At The Center of New Filings\n\nAfter the receipt of the SEC’s Wells Notice, Consensys filed a lawsuit in a Texas court alleging a shift from the Commision’s previous position amongst others.\n\nThe company alleged the SEC trying to seize control of the cryptocurrency industry. In 2018, the SEC noted that the second-largest cryptocurrency was not a security. This opened up claims of favoritism in the aftermath of the Ripple saga with the Commission.\n\nConsensys claims this position led individuals and firms to take new ventures which would be unfair to make a switch. Furthermore, the company argued this move will bring the blockchain industry to a halt in the United States.\n\nHow Ethereum Saga Can Affect Crypto\n\nETH is the second largest asset by market capitalization while the Ethereum blockchain hosts the largest amount of smart contracts and decentralized applications.\n\nWith a surge in DeFi numbers, a move by the SEC on Ethereum could cripple the industry’s growth. The effects on the price could be massive as bulls set sights on retesting the $4,000 mark in the next bull run.\n\nExperts opine on possible effects from traditional finance due to the anticipation of spot Ethereum’s ETFs in the United States amongst some wealth managers bullish on its staking feature.\n\nAlso Read: Breaking: EigenLayer Floats EIGEN Token Whitepaper On GitHub\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQbGU0eWwyXy1sYllpTlpibG42QU5iWVVGdXBUM1g3RmNyT3kzVlF3eFBpZk4yaDhQM0ZNeEhJUEgwZmtOWER1M2VHdnJVV2dFYWhtUWhLcXhrVG56MjlUVzFtRV8zU2ZwZWlVczEyQUlGN2VyLUc2UXRiU1d6TnhmUGszbEk5NzRqR3BZektQVE1OY0VuZVVyc3JIWVpoOVFDOTVkajl1c0luaTFUck1tTTlBLW9iM2MxbjBhSXN1UUtRSDNIQWlwbEtBMVAyRjBCczRVMlhXQUIwRDllUWpDLWUwTlpITUdjaktzZUR6ZkRqR09ncFE00gH8AUFVX3lxTE03YmlobWdJWHdMMmV5ZXdsbTl5cUlfV3ZDdzNiT2JVYzdhRjJ6SlJwNk5QTmtqNXhrOWVPcHJiaFc3cXZFYmU5bE0tcENxVWQ0dmxqYThVSWlUNEVfSFZHVm1PaFJIWk80SEJYTHFNUHhObE5pS0RJSWl0eVg4Q1hUQW5XQUhkS3hHMU5rdDFfSjdJTmx2NXpWLTNMUm82aGFXUEtXN0NmUXRVVEZQanhlbnJjcUxRQjl0SWtUUGw1VV92M29WMTFmd0gtUlFiM3VFYld6ZUhqakUzTlo2WnVtdFdIMTg4S28zakxrREp2Q0h4NGp1SThDbUZ6Tg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Relief wave on altcoins likely as BTC shows a $5,000 range - FXStreet",
        "content": "Bitcoin price could drop into the liquidity pool between $60,600 and $59,005 as it establishes $65,600 as weekly resistance.\n\nEthereum price could confirm a falling wedge pattern with a 25% run above $3,406 at breakout point.\n\nRipple price defends $0.5000 but overhanging bearish activity will keep XRP holders’ vision for $0.6000 a hopium pipe dream.\n\nBitcoin (BTC) price has recorded lower highs over the past seven days, with a similar outlook witnessed among altcoins. Meanwhile, while altcoins display a rather disturbing outlook amid a broader market bleed, there could be some relief soon as fundamentals show:\n\nA massive cool off in euphoria and sentiment\n\nA cool-off phase allows the market to correct itself, stabilize, and establish a more sustainable growth trajectory.\n\nA healthy outlook in funding rates\n\nHealthy funding rates indicate a well-functioning and balanced market ecosystem, promoting stability, reducing the risk of manipulation, and fostering confidence among market participants.\n\nOverleveraged short positions are waiting to get liquidated\n\nWhile the initial liquidation of overleveraged short positions may lead to short-term volatility, the eventual impact can often be positive for the price of an asset.\n\nRead More: Week Ahead: Bitcoin could surprise investors this week\n\nBitcoin price forms a $5,000 range\n\nAfter successive weekly closes below $65,600, and with the bulls defending against a dip below $60,000, Bitcoin price has established a $5,000 macro market range. The odds hint at a further decline given the Relative Strength Index (RSI) is subdued below the mean level of 50 and the Awesome Oscillator (AO) indicator continues to post red histograms in negative territory.\n\nIf seller momentum increases and Bitcoin price dips into the liquidity pool between $60,600 and the intra-day low of March 5 at $59,005, the downtrend could continue with bulls waiting to buy BTC just above the $50,000 psychological level.\n\nBTC/USDT 1-day chart\n\nConversely, if history repeats, Bitcoin price could move in the opposite direction as the DXY Compare indicator. To confirm the continuation of the uptrend, however, the bulls must haul BTC above $72,000 because plenty of bearish activity awaits BTC price near the $70,000 threshold.\n\nAlso Read: Bitcoin Price Outlook: Will BTC ignore major macro market developments this week?\n\nEthereum price could rally 25%, pending confirmation\n\nEthereum price is trading with a bearish bias, but not for long as the price action since March 12 has consolidated into a descending wedge pattern. The execution of this bullish reversal technical formation will happen after a decisive breakout above the upper trendline on the one-day timeframe.\n\nThe target objective for this pattern is a 25% move toward $4,250, determined by measuring the heath of the wedge and superimposing it at the expected breakout point.\n\nThe Relative Strength Index (RSI) continues to wind around the mean level of 50, while the AO indicator shows growing bullish sentiment displayed by the green histograms that draw toward positive territory.\n\nThe higher highs seen on the RSI chart since mid-April relative to the lower highs in ETH price also support the bullish thesis, suggesting a bullish divergence. If the RSI flips above the mean level, it would tilt the odds further in favor of a bullish breakout.\n\nETH/USDT 1-day chart\n\nOn the other hand, if ETH bears have their way and book profits for the nearly 10% gains made since Ethereum price bounced from the $2,900 support, the market would see a correction. A candlestick close below $2,900 would invalidate the bullish thesis.\n\nAlso Read: Ethereum fees drops to lowest level since October, ETH sustains above $3,200\n\nRipple price suffers the weight of overhanging bearish pressure\n\nRipple downside potential remains very much alive with bearish activity waiting to descend on XRP price once it lifts. This is seen with the multiple spikes on the volume profile (grey) in the one-day chart below. The RSI is also declining steadily, showing falling momentum.\n\nThis, coupled with the red histogram bars that remain in negative territory reinforce the bearish outlook. If the $0.5000 psychological support is lost, Ripple price could drop all the way to the $0.4500 threshold, or in a dire case, extend the fall to the bottom of the market range at $0.4188, nearly 20% below current levels.\n\nXRP/USDT 1-day chart\n\nOn the flip side, if XRP bulls show up, Ripple price could recover. For the bearish thesis to be invalidated, however, the price must record a candlestick close above $0.6500. This is because massive bearish activity awaits the payments token in the area surrounding $0.6000 as XRP bears wait to cash in.\n\nAlso Read: XRP slides to $0.50 as ETHgate controversy resurfaces, Ripple CTO debates impact on litigation"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMinANBVV95cUxOcWVnemRNenRqSUU2TU5kSmI5RFAtZmN5b0d0Y2cxcjBKT0hoOUJtQmtNckZId1B3d1V3dXRsbi10dUZaNmxzemJNRThmR19vb3NHVy1yQ0toMVN3ZnRySThjdWJ3Y1dJVnNfSjNPbks5WWgzUy1wdGFZM1RmRFBEOVR4SHl4MDZTd005Q1lpREtKVzdUQmNueWM4LVY0Ykt3Zl9HZjVwRV95ekhzNzllME55X29xdzMzYXhWcXBOU3I2VV9XenBBZXdQdkdSeGViZjhEN3YzWDFkQkxsbUpaS3Fld25HaG8td2NuWjF2amxEbGtHMC12aTNuS0o2TGIxMm5kdnk4WHZlNXNickQtVFhOMTV5S1U1c2szN3JNRmd3Y3RVYVZXNE9BMVZnV2hUb2YycWo2cEt0cFE4VFo4OFI2eTQ2TVZEdWZVa3JZVU82ZWxHTm9ZNm1vcXBMZmtBLXgtT21IN1ozaWh4dHlCNWVSdm5wY3U1M2Y2YnZlZ1o0MVc3LUtLZVFQUThNSzhqT2diQkpoM0FkbXlV0gGiA0FVX3lxTE1FM1dtWHNmaFBoRmYtdmdMVlI4RGNhbTZGSEFBUUpSbldQclhIVVJpTkRmV3BnMWFqVnE1c3pJLWZuWmJxR0VHSUhPOFJvcUNTSFJNdUNSY2dVUURsdXlVWE95Q0NpM3lEV2ktbzk3b2lFZ3hLMXhSYk9BYVgzcXpkYXh0dThSbmxtM2xfVXhMNzRTZjBucWpqYUtOQ2I0VzgwVm9oTWVhbjFjTUk5bHdKODBBNUlIOTQxV3doNGptanR6LTRBakRERHNaMFZadnVuMm0tS0dUTklNSnI1dkQ1cldKdWxaMXZOeXBPMWQxVWxuUktrekZpeHJXdlVOVFQwZHdaODdCTFJPaTZKclRYSDdnQjZfaXFxUGd6N2EzWHBYVy1SdTliaVpNNEZFODFnYldTVFc4bjBPcnpidVJTMnVleU9md0p6RmxhSFRLaVZxY2gxQ1NjakNEd2FPRlJtc3M5QjJjOUhpQlJsTzR1YU9KdE1ESU5WY0JEZG5pMGI2THhyTG56SDhfVEtFOWxpWXNyUzdYMnE2eVVJMno3RkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrency market sees decline as Bitcoin and Ethereum slip - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe cryptocurrency market experienced a decline in Monday's trading session, with Bitcoin slipping 2.3% to $62,300, while Ethereum fell 4.3% to $3,170.In addition, the global cryptocurrency market cap decreased by 2.94% to approximately $2.31 trillion over the last 24 hours.\"Bitcoin failed to continue the relief rally after it crossed $67,000 briefly last week. Bitcoin’s current price momentum could be linked to low demand from Spot ETFs and negative sentiment among investors expecting a potential post-halving crash,\" said Shivam Thakral, CEO of BuyUcoin.\"$59,600 is an important level bulls need to defend to prevent further downsides. A strong break and close above $65,000 could clear the path for a rise to $68,000 and then to $71,000,\" said Thakral.Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"There seems to be a bearish trend forming for BTC, and we can expect some slow-moving days ahead. Immediate resistance is around $63.4k.\"Other major crypto tokens such as BNB (-2.2%), Solana (-5.2%), XRP (-3.4%), Dogecoin (-5%), Toncoin (-4.7%), Polkadot (-5.2%), Shiba Inu (-5.3%), and Avalanche (-4.4%) also declined.The volume of all stablecoins is now $52.74 billion, which is 90.58% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $1.227 trillion. Bitcoin's dominance is currently 53.15%, according to CoinMarketCap. BTC volume in the last 24 hours rose 19.3% to $21 billion.Regarding the future price movements of cryptocurrencies, the CoinDCX Research Team noted, \"This week's macroeconomic events, such as the Fed's fund rate and unemployment rate announcements, could potentially increase market volatility.\"On the technical front, Edul Patel, CEO of Mudrex, said, \"Bitcoin has been range-bound between $60,000 and $70,000 level since a while now. The support lies at the $62,500 level and the resistance is at the $64,200 level.\""
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9IV1VKZm9QN2JZTlNZQTFjOVdjb1JSQ2g0S2dRVzNES3Z3S0ZwMlJ4UWMyVEl0d3Y1TVV5dGdkVElKYmF2dTdHaDlqMzlTNWNST0U4b21DVUJrS19tTEJVTHNXLTZJb251UWViWmdFSE1oYkJiT1dWcVBnZTTSAYIBQVVfeXFMT3RSZjRXNThFQmtqMWFncUFJMTVaSlhKeTdfV250czg0dTJJRHdvNlQyT204U2tWTzhPVE5Nck50TThsZjE4RkhWcGtrY2JTS3ZGY09rZHV4blg5RnZXSWdhbG5Kb3hyWTNLU0hwUThLZE9WWTlSTVFNcWlCU2hFeUVlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum’s run to $3.3K may be false breakout for ETH’s price - AMBCrypto News",
        "content": "Resistance at $3,353 could force ETH to decline to $3,120.\n\nIn the midterm, the price might fail to surpass $4,000.\n\nEthereum’s [ETH] rise to $3,300 on the 28th of April returned optimism to the market. However, according to AMBCrypto’s analysis, the joy market participants might have had could be momentary.\n\nOne reason for this prediction could be linked to a recent transaction. In the early hours of the same day, a participant sent 14,999 ETH to the Coinbase exchange.\n\nWhile we have not been able to track who the exact culprit was, the transfer could affect ETH’s price. This is because a large number of coins sent to exchange usually end up in a sale.\n\nAlso, depending on the volume, the sale could stop the value from moving higher.\n\nHigh liquidity comes with resistance\n\nHence, it could be that ETH’s surge in the last 24 hours was a false breakout.\n\nFor context, a false breakout is terminology that explains how a cryptocurrency tries to break certain resistance but loses momentum afterward.\n\nWithout looking at other indicators, this conclusion might sound too hasty. Hence, AMBCrypto decided to examine other parts of the market related to the altcoin.\n\nOne indicator we gauged was the liquidation heatmap. For most people, the liquidation heatmap helps to track high liquidity in the order book.\n\nHowever, the same indicator can be instrumental in identifying support and resistance zones. From the data above, there was a concentration of liquidity at $3,353.\n\nIn areas like this, large trades can be executed at relatively good prices. But as soon as orders enter this liquidity, the price might reverse. As such, the $3,353 region could be a resistance point for ETH.\n\n$4K is not close\n\nMoving on, the value of the cryptocurrency might drop once it hits the price mentioned above. However, support lied at $3,276, indicating that ETH might not slip below the level.\n\nThe next part we considered was the Cumulative Liquidation Levels Delta (CLLD). If positive, the CLLD indicates that there are more long liquidations.\n\nOn the other hand, a negative CLLD suggests that short liquidations were more than longs. As of this writing, the CLLD was positive. But this indicator also has a say on the price.\n\nWith the press time position, the CLLD indicated that ETH could undergo a full retrace. Should this be the case, the price of the cryptocurrency might drop to $3,120.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn the meantime, the price of the cryptocurrency might keep its head above $3,300 for some time. However, expecting this increase to drive ETH to $4,000 might be a stretch.\n\nOur assessment showed that the market lacked enough firepower to drive such a hike. In addition, expecting the altcoin to surpass its all-time high might not be an option anytime soon."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxOQ2luSEx4NW1VeUpOa0JaWXlhQ3B1emZsTHFjQmFBS0g5bU9MSzY0QzlsYUw2X010RG1MMXZTWDlVbFVabXVlby1rYzlsTndWak1RMzVCTkpuZlFmQlo3WTJpeTdSbkQzWDJrSWwxU1p1MlYta3czcDlDd2xLSU5lRGhKSjBGR25IWHBpSWxEb0FuOVlUSXRGWFdBajZYLXRzbWZHaHV5UTQyVlgtbms5cjN6TmVNZmFXbWZIZjZpNk11MWc5VDBDTy1CdXJuZmNpeWZwd3JKYk4zRTVINHF1czljeDlyTHl1dlg2NkFNUDdBY3ZPS1dr0gH8AUFVX3lxTE5ma09ZZDNyejJzTC1Id0tadlo1MTMxdDdJRzA1Q01HLXVFZmRzMTVoVF9scnRmM2FYb3NxcDdjNkNGaWNOTzFKWGExWDJvcUgxXzFkXzYtLWprNDBDRTZ4MWdnZDFVU1Y2clRvcUIwZVFEb21QWGpuN0cyZ1ZCLVprdjhBakppRGlVNWdxOEp1bFVfa1BtTE9sYjhVWkVwSmJpNzRncUV2dHcxM2pNZXRNZzJlcFZrTE5UVGF1RFYyTS04OEdVc25ydVJUemRkZm9kWU1KYlZGYkJNMnBHdkFLTFpWZjY4bGZJcEo4eW5DeTFXUmNYUTNqUzR6Sw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong issuers don’t care if SEC declares Ethereum a security, official says ahead of BTC, ETH ETF debut - FXStreet",
        "content": "Hong Kong Bitcoin and Ethereum ETFs are due to go live on the Hong Kong Stock Exchange on Monday, April 29.\n\nMainland Chinese investors are not allowed to invest in the products, save for those with residence permits.\n\nOfficials expect $300 million first-day issuance, far above $125 million seen in the US on January 11.\n\nA campaign that started in March is approaching its climax with Hong Kong’s Bitcoin and Ethereum exchange-traded funds (ETFs) due to hit markets on Tuesday, April 30.\n\nAlso Read: Spot Bitcoin ETF approvals in the US inspires ambition among Hong Kong industry insiders\n\nHong Kong Bitcoin, Ethereum ETFs to go live\n\nHong Kong will officially beat the US in the issuance of in-kind redemptions and subscriptions for Bitcoin ETFs, and then some, as the Asian state will also be issuing ETH ETFs ahead of the US. Local media reports that the products are set to go live at 9:30AM on Tuesday with an announcement from the Hong Kong Stock Exchange.\n\nThe briefing cited Zhu Haokang, head of digital asset management and family wealth of China Asset Management (Hong Kong), and Wayne Huang, head of OSL ETF and custody business as they responded to interviews. Key elements in the Q&A are as follows:\n\nScale of capital inflows, Hong Kong vs. US\n\nAccording to Haokang, the trading scale of the Hong Kong virtual asset spot ETF on day one of listing can exceed the trading scale of the first day in the US:\n\nUS dollar, Hong Kong will exceed US$125 million, and China is confident to become the ETF issuer with the largest trading volume on the first day among the three issuers. The details can be revealed to everyone at 9:30 tomorrow morning.\n\nHuang added that while the products will debut on Tuesday, OSL completed its first day of raising funds on OSL on Monday, citing two funds, “ChinaAMC and another fund that cooperates with us.” He added that the transactions witnessed so far are greater than the capital inflow of the US BTC spot ETF on its first day of trading.\n\nDifferentiating spot BTC ETF and spot ETH ETFs in Hong Kong\n\nHaokang said that unlike the US-based spot BTC ETFs, Hong Kong’s products would have spot and physical subscriptions and redemptions. Also, ChinaAMC's Hong Kong spot ETF is the only ETF with the Hong Kong Dollar, US Dollar and RMB pairs.\n\nAnother difference is that beyond the listed shares, there are also unlisted shares. These options are not available in the other two companies.\n\nUnlike in the US, Hong Kong uses cash and physical subscriptions and is open for trading during Asian trading hours. This, according to Haokang, will still attract many American investors.\n\nThe reach of Hong Kong virtual asset spot ETF\n\nThe physical subscription method is an enabler even for Bitcoin mines as miners can use their Bitcoin holdings to directly purchase virtual asset spot ETFs in Hong Kong.\n\nIt would also reach regions like Singapore and the Middle East, which are yet to issue ETFs, with Haokang citing extreme interest among investors.\n\nFamily offices across Asia and overseas have also demonstrated interest in spot crypto ETFs.\n\nSecurities firms qualified to conduct relevant transactions in physical subscriptions\n\nCurrently, only three securities firms can do physical subscriptions in Hong Kong with more expected to come in. The three are Victory Securities, Huaying Securities, and OSL. Brokers are also expected to join the match starting in May.\n\nOperations for physical purchase\n\nHuang highlighted that this was the first time Hong Kong was going for physical operations, adding that the brokerage firm would have to upgrade its license to be able to handle virtual asset transactions:\n\nInvestors can transfer their coins to OSL through this brokerage firm, and then finally transfer their equity back to OSL. Transfer it to the fund's custody account and complete the entire process of physical subscription.\n\nOSL’s anti-money laundering process in physical subscription\n\nTo open an account, investors are required to connect to OSL through a brokerage firm to open an account. There will be a whitelist verification on the transferring wallet as evidence that it belongs to the investor.\n\nInvestment verification will follow, where the user's private wallet is screened for suspicious activity in the past dozens of on-chain transactions. Passing whitelist verification allows money transfer.\n\nThe products will also allow wallet-to-wallet transfers between exchanges provided anti-money laundering rules of the other exchange are consistent with the OSL rules. “We can accept the other party's transfer of coins,, he said, adding , “We need the other exchange to provide certain customer information.”\n\nAccessibility to mainland investors\n\nMainland Chinese investors are not allowed to invest in Hong Kong’s cryptocurrency spot ETFs. It is only accessible to:\n\nHong Kong’s qualified investors\n\nInstitutional investors\n\nRetail investors, and,\n\nInternational investors that meet the regulations\n\nHaokang advised the public to consult brokers and sales channels and monitor corresponding regulatory adjustments or the introduction of a specific regulatory framework in the future.\n\nImpact of US SEC deeming Ethereum a security on Hong Kong’s Ethereum spot ETF\n\nWhether the US defines ETH as a security will not affect the independent decision-making of the Hong Kong Securities Regulatory Commission, said Huang, adding that the Commission has its own set of procedures for determining whether a certain virtual asset is a security and whether it can be opened to retail traders.\n\nFurther, Huang highlighted why Hong Kong can be a global pioneer in launching an Ethereum spot ETF. He said:\n\nThe regulation of cryptocurrency in the United States has multiple departments speaking out at the same time, or trying to regulate it.\n\nConversely, this mandate is defined in Hong Kong, unique to the China Securities Regulatory Commission. He added, “Hong Kong has already had a clear definition of Ethereum. Ethereum It is not a security, but the first non-securities virtual asset to be included in Hong Kong supervision together with Bitcoin, and it is one of the two targets that can be provided to retail investors.”\n\nCrypto ETF FAQs What is an ETF? An Exchange-Traded Fund (ETF) is an investment vehicle or an index that tracks the price of an underlying asset. ETFs can not only track a single asset, but a group of assets and sectors. For example, a Bitcoin ETF tracks Bitcoin’s price. ETF is a tool used by investors to gain exposure to a certain asset. Is Bitcoin futures ETF approved? Yes. The first Bitcoin futures ETF in the US was approved by the US Securities & Exchange Commission in October 2021. A total of seven Bitcoin futures ETFs have been approved, with more than 20 still waiting for the regulator’s permission. The SEC says that the cryptocurrency industry is new and subject to manipulation, which is why it has been delaying crypto-related futures ETFs for the last few years. Is Bitcoin spot ETF approved? Bitcoin spot ETF has been approved outside the US, but the SEC is yet to approve one in the country. After BlackRock filed for a Bitcoin spot ETF on June 15, the interest surrounding crypto ETFs has been renewed. Grayscale – whose application for a Bitcoin spot ETF was initially rejected by the SEC – got a victory in court, forcing the US regulator to review its proposal again. The SEC’s loss in this lawsuit has fueled hopes that a Bitcoin spot ETF might be approved by the end of the year.\n\nPossibility of other virtual asset ETFs\n\nIssuers of these virtual assets together with the Commission must find a legal opinion of the security or a non-security status of the asset. They must also turn the legal opinion and the Commission’s due diligence on the currency into a detailed research report and submit it to the China Securities Regulatory Commission.\n\nFinal approval by the China Securities Regulatory Commission will usher the asset to professional investors first. Once a specific liquidity threshold is attained, the asset will be accepted as an ETF. However, It will only be introduced for retail trading once it reaches the scope of an index."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNemdKQ3FDczVjcWFuQUFkZjdKRURTS1JYbXpvZ0dSU0hUTFJlT3hpZzk3QWtscmxQZW1rbFVyQjIxX1RvbjI4STFMMTBiTEdCa0lZcW9TSVlYbXhKa3daZjFFNHg2TU9MWUlfQllDTzJweWZHRnZtbUF3TVZ1V3dpVmVLNWU3N2FSUENQSVh4cDnSAZYBQVVfeXFMTTlWZHRKOHgzY1diNFRFVXpyek9wMHU4SlAxM19DaVJOYjlZVGp1ank3UHVYd0FlcU9vSUhLSklTaVhJOVFyMzBfQzVEWkFJbFBUZXVwQmNGYVNSRFdCQnFzWFlvSlQ1dERER0RhSFgxUl9vT1NNSko3YUJyQzVOc1c5dHRIRU1nVUFLZy15d1h2VWxseE5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum vs SEC: What next for Franklin Templeton Investments’ ETF - AMBCrypto News",
        "content": "Franklin Templeton lists ETH ETF (EZET) on the DTCC website.\n\nHowever, May approval odds by the US SEC are still low.\n\nThe Ethereum [ETH] community got excited after Franklin Templeton Investments’ spot ETH ETF was listed on the DTCC website.\n\nThe DTCC (Depository Trust and Clearing Corporation) is a key settlement organization for institutional trades and securities in the US. So, it’s a great step for Franklin’s Ethereum TR Ethereum [EZET] to be listed on DTCC.\n\nHowever, the US SEC has the final say on approval. Unfortunately, the SEC hasn’t granted Franklin Templeton such a green light.\n\nDelay on Franklin Templeton Investments ETH ETF\n\nOn 23rd April, the US SEC delayed the decision on Franklin Templeton’s spot Ethereum ETF proposal and requested more time. Part of the statement read,\n\n“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.”\n\nThe SEC has also delayed decisions on other potential issuers, such as BlackRock, Van Eck, and Grayscale. With the May 2024 deadline approaching, rejection of the applications is more likely.\n\nBloomberg ETF analysts James Seyffart and Eric Balchunas have kept the odds of May approval below 30%.\n\nIn a recent interview, Seyffart reiterated the same and suggested that approval may be likely in 2025,\n\n“I don’t think it’s going to happen later in the year; the odds are slightly higher. But 2025 is looking more possible, but I’ll have a better idea after I see the denial letters.”\n\nJustin Sun, Tron founder, also expected May rejection, stating that,\n\n“The crypto industry still needs to prepare for a long-term education with regulators, focusing on helping them understand crypto.”\n\nDespite prior statements that Ethereum isn’t a security, like Bitcoin, the SEC has remained muted on ETH status.\n\nThe lack of clarity prompted Consensys, the firm behind the MetaMask wallet, to file a lawsuit against the SEC last week for the court to decide Ethereum’s status.\n\nIn the meantime, ETH prices have remained below $3300 since mid-April. A strong recovery ahead of the Hong Kong spot ETH ETFs launch saw the altcoin hit a high of $3357.\n\nBut bulls faced rejection at the short-term resistance level of $3300 again. Ergo, a daily candlestick close above $3300 could confirm further bullish intention, especially if bears don’t breach the $3000 psychological support."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZEEybkpZTTI1VHNrbVg4N0V0bzBPQWZZTFlubnZTanJadlVSNmRfQkVYRXA5TGpaaHZIaDRNWVJqNmhvbll0SThFTFp3ZHNjOGlMMGZFT1VZYXFlSnVMQ0toaFFuUkhJQTRDUWVjQUJQdi0tdnVFQTJxNUxRVTJJS3VkczJXbDRrTEJ0M9IBkgFBVV95cUxNTk9NbnNDUDVvaDdycXJvcGxyQTVadVRmRlNRQTdBczAwVWhnLS1sMi1lOWZqOHdVcWk4S0pWNlhya3N3UFQ4RUo0OWFUWFJOb3F4NGQ0MzdEVFBmWTRTMk1kRE9tMnJ4UDQ4X2Q3a0MzMzRRX3VTbEJfcWI0U3gyakxMMEhBU3pGTkQ0VFc4dFhidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum & Consensys vs SEC – An ‘unlawful power grab’ or a ‘cover-up?’ - AMBCrypto News",
        "content": "Consensys sued the SEC in Texas over Ether’s classification\n\nOrg has challenged the SEC’s allegations, while advocating for fairness and clarity\n\nWith the debate around Ethereum’s [ETH] possible classification as a security becoming long and tiresome, Consensys, a blockchain software giant, recently made news. It did so by taking a bold step and initiating legal action against the United States’s SEC and its five commissioners.\n\nLaura Brookover’s insights\n\nRemarking on the same, Laura Brookover, Senior Counsel & Head of Litigation and Investigations at Consensys, on a recent episode of “Unchained,” claimed,\n\n“I never expected to one day be suing the SEC, but here we are. We’ve sued the SEC in our home state of Texas to defend Ether and the Ethereum network from Chair Gensler’s unlawful power grab.”\n\nShe added,\n\n“It’s really time they saw the light of day because these are important critical issues for our industry.”\n\nAccording to the exec, the SEC is not only targeting Consensys’s product – Metamask, but also their finance team. They are doing so by asking about the sales of Ether and Ethereum developers.\n\nShe went on to say,\n\n“If Chair Gensler gets away with misclassifying Ether as a security it’s really catastrophic in the United States.”\n\nConsensys’s defense mechanism\n\nWhile highlighting the fundamental differences between proof of work and proof of stake mechanisms, Consensys has consistently refuted the SEC’s potential theory that staking turns Ether into a security. In fact, Brookover went on to challenge the SEC’s differentiation between Bitcoin [BTC] and Ethereum ecosystems, claiming,\n\n“There’s really no reason to treat them differently, it’s arbitrary. So, I think that’s one of the things we’ll probably point to, as showing that the SEC really has no basis here.”\n\nThat’s not how everyone feels though. For instance, according to crypto-lawyer Bill Morgan,\n\nOn the contrary, Steven Nerayoff, a former Ethereum advisor, believes that Ethereum has functioned as a centralized entity since its ICO and thus, warrants classification as a security. He added,\n\n“This move is to distract people from the truth and just another cover-up.”\n\nThe Wells Notice\n\nWhile discussing the SEC’s Wells notice targeting Consensys for allegedly operating as an unregistered securities broker, Brookover highlighted Consensys’s metamask swaps and staking features. In contesting this accusation, she argued that Metamask serves as a communication tool for liquid staking protocols, rather than engaging in securities distribution.\n\nErgo, Brookover is optimistic that a successful outcome in the lawsuit would provide much-needed clarity to the regulatory uncertainty surrounding cryptocurrencies."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPTDdHcDA5REF5RmY1cVVBS1JiOFdQZFFGLXh1SHA0QVlGdFZyNEJPQjU5T0FQZmYzbmQ4emJualAyc1JZdHlFYTR3Y04zMlMyN2k1dXNmVllmckdfY2wtOElyQ1pLSUR1b25hcDJzYVZQTWhrVjFQVjJ1UVVVOVVNTnlTeU54OUc1TGNz0gGQAUFVX3lxTE9Sa3BJU2dYbUdoQkRqa28tYjdVWlZIaGhfUHBieE9LeGlKUkM5QXhzdk5jRE9wTW9aNFk4RjN3X2hxNEpPOEduUGpGN3N4MzNkUFhuZ04zNTNUSHJ5THpfODBnaWdINnlqT1JidGNmZl9sb2tjeWxjQk9EUEdVb3BVaDBLQ0F1MUktZDZvSTd5cg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETH upgrade debate: How will EIP 3074 impact ETH’s future? - AMBCrypto News",
        "content": "Developers were in two minds about 3074 EIP in Ethereum’s recent developers call.\n\nPrice of ETH plummeted, on-chain metrics remained positive.\n\nEthereum’s [ETH] latest Dencun upgrade was a success that helped many L2 solutions reduce fees to extremely low levels.\n\nAfter this upgrade, the Ethereum developers set their sights on their upcoming upgrade, Prague, on their recent call.\n\nNew developments\n\nEthereum’s Pectra upgrade, expected in late 2024 or early 2025, is expected to bring new features to crypto wallets, enhancing user experience.\n\nEthereum Improvement Proposal (EIP) 3074, enables regular crypto wallets to function like smart contracts.\n\nOne key aspect of EIP-3074 is its ability to give standard wallets, like MetaMask, smart contract capabilities.\n\nAdditionally, it allows a third party to cover the gas fees associated with a user’s transaction, potentially making transactions more affordable for users.\n\nIt also includes features such as transaction bundling, reducing the need for multiple signatures, and sponsored transactions, allowing wallets to delegate funds for others’ use, similar to ERC-4337’s account abstraction.\n\nSome developers argue that the proposed changes to EIP 3074 to allow broader use cases and global message revocation significantly increase its complexity, making it harder to implement and potentially introducing security risks.\n\nBecause of these circumstances, developers have decided to conduct a separate breakout meeting to discuss the technical aspects of EIP 3074.\n\nTheir aim is to reach a consensus on its implementation in a way that satisfies everyone, given its controversial nature.\n\nState of ETH\n\nThe developments being made to the Ethereum network may heavily influence the price movement of ETH going forward.\n\nAt press time, ETH was trading at $3,170.97 and its price had fallen by 4.48% in the last 24 hours. However, the volume at which ETH was trading at, had grown by 9.33% in the same period.\n\nThe speculation around Spot ETFs around ETH was one of the major drivers of price movement for ETH in the last few days.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nDespite the recent decline in price, the onchain metrics provided a positive picture. The network growth for ETH had also grown during this period, indicating that the number of new addresses showing interest in ETH had surged.\n\nThis renewed interest may help ETH see further bullish momentum going forward. Along with that, the velocity had also risen, indicating a heightened trading frequency for ETH."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNSGNVbEJXYzZlYXpUbTFNaTRhU3NSYWxNSEU0Z3ktN0QtRFhzdUh2VGNaUVhqb3k2Y2ozZkUxSXNXblJ3TXRTSTJqZi0yeWpUanFSYnZCRjZyaUU2RjlfTkFHbUhPZFdWTWVxbXZDSlVYN1RMY09FOWNLOWh1Q19iUWJ1bmpwanEwaVYybG1xTTF3OHlNTmUyN1QtWE9VUU11eXB1b0E3YjZUWjE0T25USmZnWmh5Y29yY3NLdERyN2pxeDNjN2pFYlR2bXpNTVJVUEdxX9IB4gFBVV95cUxOanRQMXFudjRhRldsQ2lGdVhscTNtSmVtY0FaeUVzZUJOZG9id2diY3pSdUhyR0EydzlZdjFsalJLYTZEME1MVWw4WWY1VUVjLXRsbTZMUEg5WjV6QUNGNFFUc2FqclpiclphSzMxblFnR29NZHpGSDg3b1ROS2NLemk2UTNtWHM2bnF5c1loWGpseExsaDlDN2pPUkZYTVVqdmllREp3SmdHVG1hVWM2UGg4YkV5Vng4N2xOMWkyTEJxc3dxV1JFV0huQjQzeGhxakFHTy13MHZqb0pIRUhKX3N3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Experts Pick Ethereum ETFs & BlockDAG’s 30,000x ROI For Next Big Crypto Boom - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    }
]