[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQQUNzQnJuT3REOG1pT2wxdTRsNU1PcjR0RDJ1Y29hcDJOS1BTOW5zcnZCc1h1Vk9CalFBVVJyYnJUM2dTWUZGWlRLMmk2Tmd4c04tUlRiS0w0VnR2UTRtOUZnRFJZdGx4ZEZPbklzaVpubEhMUVE1OE9NOVZmeml3YV90UF8xb09Qbm9zbzBFTG1NUEdfcXBlbzNCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Gensler won’t commit to Ethereum ETFs, says Bitcoin approval was simply ‘most sustainable thing to do’ after losing in court - Fortune",
        "content": "In a pair of interviews on Wednesday, Securities and Exchange Commission Chair Gary Gensler still didn’t seem very excited to be discussing the Bitcoin ETFs approved by his agency on Jan. 10.\n\nAnd he doubled down on previous remarks that approving the investment vehicles didn’t equate to the agency changing its mind about Bitcoin’s potential risks, merely that it was a reaction to the August decision in Grayscale v. SEC where the agency, according to Judge Neomi Rao, “failed to reasonably explain” why it had previously approved Bitcoin futures products but not spot ETFs.\n\n“While we had denied two dozen of these, a court in Washington said we did not get that right, and it got remanded to us. The most sustainable thing to do is to approve these given the court ruling,” Gensler told Bloomberg News.\n\nThe SEC chair, both in that interview and earlier in talking to CNBC, reiterated his concern over the links between Bitcoin and illicit actors, and the multitude of crypto exchanges that face little to no oversight. It’s why, Gensler noted, the recently approved ETFs are Bitcoin-specific—although he didn’t elaborate on why Ethereum didn’t deserve similar consideration.\n\n“This is a field that has been rife with fraud and manipulation, and look at all the bankruptcies,” Gensler said on CNBC when asked whether the problem was Bitcoin itself or the currency potentially being misused. “It’s entity, after entity, after entity.”\n\nWhile speaking on CNBC’s Squawk Box, Gensler acknowledged that although regular currencies issued by governments are used illegally, such as for money laundering, those issued by central banks also play a massive role in supporting established economies. Meanwhile, he added, Bitcoin and crypto just “have the market share of ransomware.”\n\nGensler also was asked about such criticisms aimed at crypto, especially in the wake of the ETF approvals, and he insisted his agency remains impartial. “We’re merit neutral if someone is complying with the law,” he said.\n\nIn the later Bloomberg interview, Gensler elaborated on his skepticism of crypto trading platforms, Bitcoin’s relative volatility when compared with other assets, and the lack of use cases for many cryptocurrencies.\n\n“We really do look to ensure as best we can there’s no fraud or manipulation,” Gensler continued, “but one of the challenges of the Bitcoin market is that so much is traded on trading platforms that are not compliant with our laws.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTU1XdENqSjRUX0ZZdEM0U0FGTFE4dTZNNWo2VHozZ1NUR3pqc3NZczlYanpsYVdKNHNhRmJsUURYSzFlRDFwRGVLUGFyd2xEUC1qTzBYdzh5X1NBRE53ZDI5MGhJN05lSXpsdHRWLS1DcnQtcEZMejI3VGFScnNsSm9TelMyOFlRN055V0xWMmdYTEx0eFJHV28yS2U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Two Ethereum DeFi traders just made $120m using a strategy called ‘looping’ - DLNews",
        "content": "Two Ethereum traders made $120 million in the last 24 hours.\n\nThe traders employ a 'looping' strategy in DeFi, enabling leveraged positions on Ether to amplify their investments.\n\nUpcoming Ethereum upgrades and the potential approval of an Ether ETF are key market catalysts, potentially driving Ether's price even higher.\n\nA pair of high-value Ethereum traders are up nearly $120 million today as crypto prices continue to jump.\n\nAccording to DL News’ analysis, two wallet addresses, 0x28 and 0x74, have used various lending protocols to increase their exposure to Ether.\n\nCombined, these wallets hold over 1.1 million in Ether and staked Ether derivatives — worth $3 billion. Both wallets are deposited in a handful of lending protocols like MakerDAO, Spark, Morpho and Compound.\n\nThe identities of wallet owners aren’t publicly known, but these wallets caught attention in 2022 for nearly being liquidated for $600 million worth of Ether. Now, that risky bet has paid off.\n\nLooping on DeFi\n\nThe strategy these whales — a term for high-value crypto traders or investors — employ is commonly referred to in DeFi as looping.\n\nA trader deposits an asset, such as Ether, into a lending protocol and then borrows a different asset, like dollar-pegged stablecoin DAI, against their deposit. They then swap that DAI for Ether, the original asset.\n\nAfter swapping cryptocurrencies, the trader re-deposits the newly-acquired Ether back into the lending protocol. This action allows them to borrow additional funds, establishing what’s called a ‘leveraged long position’ on their original Ether deposit.\n\nThe looping strategy enables traders to achieve a leverage of 3-5x — multiplying capital by a factor of 3 to 5 times — on their initial investment.\n\nJoin the community to get our latest stories and updates\n\nBut in this case, these whales have opted for a more conservative leverage range of 1-2x. Despite its potential for higher returns, this strategy carries a multitude of risks. A significant drop in the Ether price could lead to liquidation, resulting in the loss of the initial deposit.\n\nThe pair of whales deployed these strategies years ago when Ether was worth around $1,000. Ether is currently trading around $2,700. The price of Ether would have to drop over 60% for them to be liquidated.\n\nEthereum catalysts\n\nTraders who utilise the looping strategy inherently hold a bullish sentiment — conviction that the prices will go up — on the market.\n\nFor Ether, there are a couple of significant catalysts on the horizon.\n\nEthereum's Ether token has performed well over the past year.\n\nThe first is the upcoming Dencun upgrade, which will reduce the cost of transactions on Ethereum’s layer 2 networks like Arbitrum and Optimism. After successful tests on two of Ethereum’s test networks, the upgrade is slated to come to Ethereum mainnet around March 13.\n\nThe weeks leading up to major Ethereum upgrades generally coincide with increased interest in the Ethereum network, and some researchers even find that it causes Ether’s price to increase.\n\nSince the approval of the Bitcoin spot ETF, the market has turned its sights to an Ether spot ETF.\n\nHeavyweights like Blackrock, Fidelity, Invesco and others have all already applied for an Ether spot ETF, with a decision to be made by May 23.\n\nGiven the Bitcoin ETFs hold 692,000 Bitcoin, or 3.53% of the total supply, traders are hoping an Ether ETF would see a similar success.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTFBnT2d3ZWlXY2U0TURvS3ZjZDdkLTJTc3o0VHh2LVFvMHNqb3BsbVV0NFhTbFZMNWxqbExDbnhwdl9PZnJXaFUtX1J3emtDek50MkVrOXNn0gFbQVVfeXFMT1Bid3g1ZHdlZ3dVWlNwMkRLdmVGVU5GUVBvU1VkbVUzNzkzeGZsV0F2eGFsNDMtUWxhWXlZaTZmalVCOGt0azdRZHdwSk5YTE0xd3BvbzBjMDZmaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "New Ethereum Token DN-404 Rivals ERC-404 in Fractional NFTs - NFT Plazas",
        "content": "Security Concerns Casting Doubts on ERC-404\n\nThe stability of ERC-404 is under review. A DN-404 creator who goes by the name ‘quit’ found a potential security issue that could enable ERC-404 token holders to access NFTs improperly through inadequately prepared lending protocols.\n\nIn response, an ERC-404 contributor — ‘ctrl’ — confirmed that a refined version of the standard is under development and will undergo an audit to verify its strengthened integration and enhanced protection measures.\n\nDespite DN-404’s novel structure, cygaar raised an additional flag of caution to potential adopters, announcing on X that “ERC-404 tokens don’t really adhere to either ERC-20 or ERC-721 standards. It’s close to ERC-721, but the balance function isn’t the same due to fractions.”\n\nAdditionally, cygaar claims that the “404 number is very arbitrary. It doesn’t follow the standard EIP numbering process.”\n\nThe advent of DN-404 alongside the security debates concerning ERC-404 may profoundly influence the dynamics of NFT trading and the evolution of Ethereum’s blockchain standards."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOMXkxM2gyN1hKOFBObjRKSm1oOG9PRkM5R1NCRjlsVjBhc3JiN240Yjg3NERKbExkNU1ldTRPTWxBdHVVYUZBVzJXTWh5ZVVpT1VTcnhjcHQ4bjhsWjhKLS1RTVVFT2hkQWlnM1NDeElpb1JWLWtCTFgtV3JVemdKUGtuVGJydFZKcEJn0gGQAUFVX3lxTE5VbTQzWVJDMnZDRDlLZko4am5rTm14b1dTTXotRHVGYzFMT2U0c1ZadmVUNGRxR29JejZTMEJTMWxJa3VVUzFVVGVpSzNiWWxnb1REZEtjVmpqRWNFR2g4SnkxTkkyVndyLTRoSmFqV1dNNG9fdmdHNTdFUDgxZEdGTENMOFNKQ29KYkZjMFBIbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Whale Goes All in on ETH in Brave Move as Price Skyrockets - U.Today",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has seen a surge in demand and price since February's start, touching a one-month high of $2,687 in early trading today.\n\nAdvertisement\n\nAccording to Lookonchain, an Ethereum whale has made a brave move in accumulating ETH since the start of February, when its price started rising from lows of $2,239.\n\nThe whale's strategy was going long on ETH using revolving loans on the Spark platform, which allows the borrower to withdraw, refund and redraw funds as needed within a specific limit and period.\n\nSpark is a platform that provides revolving loans. Users can deposit ETH or other ERC-20 tokens as collateral and borrow stablecoins like USDC or DAI at a variable interest rate.\n\nAdvertisement\n\nAccording to Lookonchain, the aforementioned whale has withdrawn 39,900 ETH worth $99.5 million from exchanges like Binance, Bybit, OKEx and Bitfinex since Feb. 1 at an average price of $2,492, and borrowed 56.8 million DAI from Spark.\n\nThe whale's goal is clearly to increase their ETH holdings and profits while paying little interest on the loans.\n\nWhale's bullish stance is evident\n\nThe above-mentioned strategy may seem risky given the volatility of the crypto market; however, the whale's bullish stance is evident.\n\nBy all indications, the whale is essentially betting that the price of ETH will rise more than the interest rate of the loans and that the collateral value will not fall below the liquidation threshold. If the price of ETH falls significantly, the whale may lose their collateral and suffer a substantial loss.\n\nOn Monday, the Ethereum ecosystem and layer-2 tokens such as LDO, ARB and MNT soared after Franklin Templeton filed for a spot Ethereum ETF.\n\nGrowth in alternative cryptocurrencies, or \"altcoins,\" appears to have accompanied Bitcoin's surge, which reached $50,000 for the first time since late 2021. At the time of writing, ETH was up 8% in the last 24 hours to $2,678."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOVjhieDRtSXN0aWdmZjBVdUxNamVQNDRMVzZTajgtQ3pYR0dJa19hckpyZTRfNWd2eHN5ZkU0NldaM1R0Qm5fLUJ1dV8yekVmTE1NNkhzaU5QZTFBWFFvWmotckRIUE45NXk5TUZYN3JCSFpvaHIwYng2Rl84NGFBb2JId3hMbUJQc3E4bHBGbDFqVVU0VGJFNDJBUEw1NE1BT21CdGJOYzNvU2twY19zUzEydjgxcnlocTRYVmF6Tl_SAcYBQVVfeXFMTm1jaHJ0T042Q2I5TWFWbjlOS1l0SzJhcGpybGJpal9ZcmlUQ3JaZVpuZGtLWkRobnhwME1SMHEwaEc1SmpYaUpsekpSdzNlZ2RlXzhEdnRzMk5oTm5odHE4V0FBNVRRVEpGZkV4ZTFzODhvMGxaYnNjeFNESFcwNWx3TFBMSldzcDctLXp5Sl9kbWphSnZPMlRwS3hxQVhQLURKNWk5V3kzcmdld3JoV3V6bTRRRzBUaEwwQ2x6RkpXbE1obFF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Developers Create 'DN-404' Tokens After ERC-404s Send Network Fees Surging - CoinDesk",
        "content": "ERC-404 has also caused criticism among Ethereum developers for attaching ERC to its name. However, in messages to CoinDesk, the team explained that the naming helped it gain popularity and gained a following around what it intended to do."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBVSndwQjRsYmd1YlVfWlRUbmR5MTZmR0VDd21oVTlnTTlpVkM4c2JjRmtVS3VNeUZEMXZtZ2NEVlVFNTFGMUFadXozaGVCTDhUaXNkRFd1aG1ib2c4WXVtNGtxRUFSTEk4SVJ0U0Nlaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 14:04:03 GMT",
        "title": "Ethereum devs can now deploy apps on Sei’s parallelized EVM - Blockworks",
        "content": "The high-throughput blockchain Sei has upgraded its devnet, a developer-focused kind of testnet, to v2. With the new version, apps developed on Ethereum can be deployed on Sei with no changes.\n\nSei is hoping to lure developers with an execution environment it says offers the “best of Ethereum and Solana.”\n\nSei’s Ethereum-Solana hybrid analogy is based on its use of parallelized processing. In brief, parallelized blockchains process multiple transactions simultaneously rather than one at a time. Solana’s version of smart contracts make use of parallel processing. Ethereum smart contracts do not.\n\nSei is one among multiple studios courting developers with the promise of a parallelized Ethereum Virtual Machine (EVM) — and perhaps a more scalable version of Ethereum’s execution environment.\n\nSei went live alongside an airdrop of its token in August. Sei Labs, the team developing the blockchain, told Blockworks in January that its next version would involve a move to the EVM. Before the upgrade, Sei ran on the Cosmos ecosystem’s CosmWasm smart contract platform, meaning Ethereum apps couldn’t run on Sei.\n\nAt the time, Blockworks noted that other outfits, including Neon and Monad, were working on parallelized EVMs as well.\n\nRead more: Parallelized EVMs are gaining popularity, but they won’t scale blockchains alone\n\nSei is now backwards compatible with Ethereum smart contracts, meaning developers can deploy onto the newer chain without changing their code.\n\n“While for some developers the current offering of EVM blockchains and rollups is sufficient, the majority face bottlenecks as they attempt to scale their application,” Sei Labs co-founder Jay Jog said in a press release.\n\nIn a blog post accompanying the upgrade, Sei said its parallelized EVM would be able to handle thousands of transactions per second (TPS).\n\nFor context, Ethereum has handled 62 TPS at its best, while the popular Ethereum scaling solution Arbitrum hit a peak of 380 TPS, according to a dashboard compiled by Chainspect. Solana’s highest TPS was roughly 1,600 TPS.\n\nThe public devnet is aimed at developers building with Sei — and functions like a testnet from a user’s perspective. Sei hopes to go to mainnet sometime in the first half of 2024, a spokesperson for the team said.\n\nSei has tacked on over 200,000 new users in the past month, according to a Flipside dashboard. Of these new users, a large majority appear to be trading NFTs.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQRm1EeklJQVZ2WlJxU0tpWmYwWENwOEZWVi13MDB2TnB4aUs1bU9obHAxb2UyZU8yNHRMSExibXVlRklORlJuNE9XSzFXdjJ5TFpockNoRDd4YjRqLUZhSldXMXBMUVZ0T2NxNHJpOHZmLXpxN0FOdldDYkVKTEJNdHRGRVRpcXpud2Q0YzJaQlBoWkU5eUJkZ0VURjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Co-founder Jeffrey Transfers 10,000 ETH to Kraken - Crypto Times",
        "content": "Jeffrey Wilcke, a co-founder of Ethereum, moved 10,000 Ethereum, valued at roughly $27 million, to the Kraken market, one of the biggest cryptocurrency exchanges in the world, on February 14th.\n\nAs per the data from Etherscan, Jeffrey initially tested by transferring 0.1 Eth to the address 0x8E9.., flagged as kraken deposit by Arkham Intelegence.\n\nEtherscanData: Jeffrey Transfers 10,000 ETH to Kraken\n\nJeffrey then transferred 4.3K Ethereum, valued at $10 million, four days ago to the Kraken and today he transferred $27 million in Ethereum.\n\nIn total, he has transferred over $37 million to the crypto exchange and still holds 135,738 ETH($374.6M).\n\nThe cryptocurrency community has taken notice of this noteworthy transaction, which has sparked a wide range of responses and conjectures about possible ramifications for the Ethereum network and the larger cryptocurrency market."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOU0tFZkdYRUhRMUxnUjg3dk40THRBbkhWcnBJV0FGZl9HY0twVmctTTVXOE5ad095SkN5OUZjOVdKNldhRVdKSG16TzNzZVVCUF9lSWxSTzl4X3d5MVhmUjFDcnNuM2JmN2xMRUlheFZHTEFQNVJOSU9VdjFuZzM5Ti1EVUxnRnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum (ETH) Price on the Verge of a $3,000 Rally ? - crypto.news",
        "content": "On Feb. 12, Ethereum (ETH) price peaked at $2,633, just shy of its 2024 top, while Bitcoin (BTC) raced above the $50,000 for the first time since 2022.\n\nBitcoin (BTC) attracted the media attention after breaking the $50,000 barrier on Feb. 12, but Ethereum bulls are making strategic moves to stage a similar breakout.\n\nWill ETH price reclaim $3,000 in the coming days?\n\nEthereum derivative traders have intensified bullish bets\n\nEthereum and Bitcoin price action have been closely correlated for many years. This has sparked optimism that BTC hitting the $50,000 milestone on Feb. 12 could open the doors to ETH making a similar bullish upswing.\n\nIn the ETH derivatives markets, there has been an noticeable increase in the spate at which speculative traders are placing leveraged bullish bets.\n\nCryptoQuant’s funding rate represents the aggregate percentage of fees paid by perpetual futures traders to keep their positions open.\n\nThe chart below, shows the ETH funding rate rose to 0.4% on Feb. 13, signaling that speculative traders are placing more leveraged bets on an imminent ETH price upswing.\n\nNotably this is its highest in more than 40-days dating back Jan. 8, when investors were piling on bullish positions ahead of the Bitcoin spot ETF verdict.\n\nEthereum (ETH) Funding Rate vs Price Source: CryptoQuant\n\nConcisely put, rising values of positive funding rates indicates that long position holders are showing paying increased fees to short traders, in anticipation that an imminent price upswing will yield outsized profits.\n\nETH is trading just below the $2,660 mark, at the time of writing on Feb. 13. Hence, this surge in ETH funding rates right after BTC crossing the $50,000 milestone indicates an overwhelming bullish outlook that an Ethereum price rally toward $3,000 could soon follow.\n\nUS whales are ramping their ETH purchases\n\nUS-based corporate entities have further intensified efforts to score an ETH spot ETF approval in H1 2024. On Feb. 12, Frank Templeton became the latest asset manager to file ETH derivative applications with the US Securities and Exchange Commission (SEC).\n\nIt appears that the institutional participants are backing up their optimism with rapid ETH purchases in the spot markets. Cryptoquant’s Coinbase Premium index tracks the intra-day difference in Ethereum prices quoted on Coinbase Pro exchange and Binance.\n\nAs depicted below, Ethereum Coinbase Premium index stood at 0.04 on Feb. 13 and has been trending in positive values since Feb. 8. And during that\n\nEthereum (ETH) Binance vs. Coinbase Premium index | Source: CryptoQuant\n\nThis critical metric is based on the premise that Binance dominates the retail trading market, the majority of Coinbase pro clientele is dominated by US-based corporates and high-networth investors looking to trade within a more regulated environment.\n\nHence, positive values of the Coinbase Premium index means that ETH quoted prices on Coinbase have been consistently higher than Binance, indicating that the whales’ buying pressure on Coinbase Pro has exceeded retail activity on Binance.\n\nThis pattern has often appeared in the build up to major ETH price rallies. Unsurprisingly, ETH price has gained 11% since the whales dialed up the buying pressure on Feb. 8.\n\nCombined with the dominant bullish sentiment among the speculative traders, this unusual buying trend observed among the whales could send ETH price to its next milestone target at $3,000.\n\nETH price forecast: $3,000 target in focus\n\nIn summary, speculative traders showing optimism with rising funding rates and the buying pressure from US-based whales have put ETH price on an upward trajectory.\n\nAnd based on the historical patterns associated with these bullish metrics, Ethereum price is likely to make another leg-up toward the $3,000 area.\n\nHowever, the bulls face major roadblock at the $2,750 range. IntoTheBlock’s in/out of the money data shows that, 878,100 addresses had acquired 671,830 ETH at the average price of $2,760.\n\nIf the bulls can scale this initial resistance level, it could generate momentum to push for $3,000 target as predicted.\n\nEthereum (ETH) Price Forecast, February 2024 | Source: IntoTheBlock\n\nOn the flip side, ETH price could enter a negative trend if the bears can force a downswing below $2,000. But this scenario seems unlikely in the short-term. The chart above shows that 3 million holders acquire 6.2 million ETH at the average price of $2,300. If those holders defend their position ETH will like a solid short-term support around the $2,350 level."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNcnhFT2NWaEtvZUlMVDVXMGRiTkxPWW5wUV8tVEdTWGhfWUJGd1c4V3pWOU1SNUN4Qlp2cGwtd2E5YzcycHEzc2ltdkQ5Q3Vza1dPdjlEUVp2MU5ob21qY2EzNVgyVExyeWN6cXBuWXZiR3VpTFJCcUxwWHl1dUVUZ1JSUnRpLXNRSUNWOERDb2k3VWNDR09QS1oxbzBRdHZWcFFhVWVPUlZLSDVRUFR1MjNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum, Solana see gains as Bitcoin's rally above $50,000 causes $184 million liquidations - CryptoSlate",
        "content": "Bitcoin’s surge past $50,000 catalyzed a broader market upswing, propelling numerous large-cap alternative digital assets such as Ethereum (ETH), Solana (SOL), and others to significant gains.\n\nAccording to data from CryptoSlate, Ethereum saw a 7% uptick, reaching $2,661, while SOL surged 8% to hit $114. Among the top 10 digital assets, Avalanche’s AVAX spiked 6% to $41, Cardano’s ADA rose by 3.74% to $0.5574, while BNB Coin (BNB) and Ripple’s XRP experienced more modest gains, each climbing by less than 3%.\n\nMarket analysts attribute this bullish trend to the buzz surrounding the multiple spot Bitcoin exchange-traded funds (ETFs) in the US. Vetle Lunde, a senior analyst at K33 Research, noted that inflows into these ETFs have remained robust more than a month after their launch.\n\n“Yesterday saw a net inflow of 9,870 BTC, pushing the net U.S. spot ETF flow since launch to 72,312 BTC. The new nine now hold 228,000 BTC,” Lunde added.\n\nDuring the past day, BTC’s price crossed the $50,000 threshold for the first time since late 2021. The top crypto’s value has risen 4.2% to $50,146 as of press time, extending a positive run that had seen it gain 16% over the past week.\n\n$184 million in liquidation\n\nThe broader crypto market rally resulted in a significant liquidation totaling over $184 million from more than 56,000 traders, according to Coinglass data.\n\nShort traders, or speculators betting against price increases, bore losses amounting to $134 million, while long traders betting on price increases lost approximately $50 million.\n\nAcross assets, Bitcoin led the liquidation charts with a total loss of $69.80 million. Short Bitcoin traders accounted for $55.04 million in losses, while long traders lost $14.76 million. Ethereum followed closely, contributing $39.85 million to the overall liquidation.\n\nOther assets like Solana, LINK, and ORDI also experienced liquidations of $10.14 million, $5.93 million, and $4.81 million, respectively.\n\nAcross exchanges, Binance witnessed the highest proportion of liquidations at 43.13%, totaling $79.42 million. Other platforms like OKX and ByBit recorded liquidations of $58.29 million and $18.73 million, respectively.\n\nNotably, the most significant liquidation order occurred on Bitmex for LINKUSD, amounting to $3.14 million.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOd1JNYVVwdlR3N2V1cDBnSDZXWFlsZkVreGJ4VFFzOWFPZlFVUU5hT0pUR3FPQ0dUU1VrTzRudG0yMGtmLUhPSTZrbFhmQjJNSWFQaWlqRTFHS1JKbEJnSlJSMnN5Q0czdWJ0ZVlLZnEyNUU4QXRPdGdmREktbFlNWS1R0gGKAUFVX3lxTE1oLWNBbGJMZXlKTHdBVUViLUhWcmJnZHdSNWJtd0RVTXJ1RURsWjI5ZW5DREFfN01ISXdlSGFjalA4UTExLWY1ZFpqM1daM0dPZWpNeklwZzZSTlRlUHU5d0x5ZjgwQ2RRTjA0ZXNObzgtTzhNOGRlSkM5RWkwR0ZhclhBTnBQOXFIQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Starknet Reveals Airdrop Details for 1.3 Million Eligible Ethereum Wallets - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum layer-2 scaling network Starknet has released details about its much-anticipated token airdrop, which is now officially set to launch on February 20.\n\nAlmost 1.3 million wallets will be eligible to receive free tokens during the airdrop, according to the Starknet Foundation, which is referring to the event as a “provisions program.” Beneficiaries range widely, from Starknet users and developers to users of decentralized apps (dapps) affiliated with the network, all the way to Ethereum stakers with no prior exposure to Starknet.\n\nMany users are likely eager to receive bundles of STRK, the network’s new native token—but due to their potential value on secondary markets, those behind the airdrop emphasize the token’s importance to backing a new governance structure for Starknet, in which STRK tokens will represent voting power.\n\n“This is part of a very serious value-driven process of decentralization,” StarkWare co-founder and CEO Eli Ben-Sasson told Decrypt. “It’s evolving in such a way that is truly democratic while also bringing great stability to the network.”\n\nAD\n\nAD\n\nOver 700 million STRK tokens will be doled out to users across Ethereum in the Starknet airdrop’s first phase, between February 20 and June 20. Eventually, 1.8 billion total STRK tokens will be distributed to users and community members, as Decrypt previously reported.\n\nIndividuals who used or developed on Starknet prior to November 15 stand to gain anywhere between 500 and 180,000 STRK, depending on their level of activity on the network.\n\nThe largest allocations in this category are reserved for the more than 2,000 individuals who were accepted into the “Starknet Early Community Members Program” after proving their contributions to the network in its infancy. A calculator on the Starknet website allows users to determine their particular allocations.\n\nUsers of dapps powered by Starknet’s predecessor, StarkEx, are eligible to collect 111.1 STRK, so long as they used those dapps prior to June 1, 2022. Those dapps include borrowing and lending platform dYdX, gaming-centric layer-2 network Immutable X, layer-2 bridge Rhinofi, and on-chain fantasy soccer game Sorare.\n\nAD\n\nAD\n\nEthereum developers, contributors, and stakers, meanwhile, are also eligible to receive STRK tokens—even if they’ve never touched Starknet or a StarkEx-powered app.\n\nEthereum stakers who began running nodes prior to the network’s 2022 merge event will be able to receive 1,800 STRK per validator, up to 12 validators. Those who staked prior to the launch of Ethereum’s Beacon Chain in December 2020 can receive 3,600 STRK per validator, also up to 12 in total.\n\nCore Ethereum core developers in the network’s Protocol Guild will be eligible to claim 10,000 STRK per person, while Ethereum Improvement Proposal (EIP) authors can claim 2,000 STRK. Other Ethereum developers can take home 1,800 STRK, while ETH stakers in pools or on centralized exchanges will be able to claim 360 STRK per validator.\n\nIt’s been a major year for Starknet, which at the start of 2023 held less than $1 million worth of crypto assets on its network. That figure has soared to over $56 million in total value locked (TVL) on the network at writing, according to Defi Llama.\n\nSince December, when Starknet first announced its upcoming airdrop, that figure has shot up over 75%, from just over $32 million at the time.\n\nEdited by Andrew Hayward\n\nEditor's note: This story was updated after publication to correct the airdrop distribution details."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOa1VCVWtBODE3ekF1d3pHSkdDa21IUnViQ2tpSERRQUo4bVF2UlpSRGdqbldXT3lIeWdueF9NcEtvN0N0N2h4Q2ViTHRvWFd1dERuZnM4SjVfZVBEalItOGE1ZVZPR3FNNlA5eDhJbXp6ZnBEY1VQVURDQUlGWmhydVRNS1pFX09TcEZQaUZwNVd2SHd4dU9rTklyb29zUmRvQXVpa3VHdjRud1ZfZ3o0R084dVlLLUNodm55b1MwYnJvNUh3akZhdVFB0gHPAUFVX3lxTE5GZmNJSm5POUJPVXktUFdaY0F0Wm5tQThmWVZWSjhfY3l5UkM3WVA5aXJkX3RxdXgxRTRzRkFkS24xbVdtTThtVGdETHBqZzJSRGNTRFRKYWRZbmZpd3lCQ1pVWXFDcVdZMzJGZHNCekxMeXc1YkxmdDl0VDB4V18yWFkybzF5bVRRZmdVR3J5bjJJZWVPREpZQ0xIMWxSQVA1dEZVLVg3OWItMFV6SVQ1SHlKTWVxYW9QY2gtVUF2aXVTVmtzdFg1aW4wVmN1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Crypto Custodian Taurus Enlists Lido to Bring Liquid Ethereum Staking to Swiss Banks - CoinDesk",
        "content": "“One open question that was clarified from a banking law perspective was that when funds are locked up, those funds must be available to clients at any given time,” Lavrov said in an interview. \"You could argue that is achieved by liquid staking, since funds are readily available and the token can be exchanged one-to-one with ETH. So I see a breakthrough opportunity for banks to get into solutions like Lido.\""
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNOG1tNEZ3V05seXlHTmphLWxGMDlmMDA5cllVRms4cjlYR1FhSjdYRVdteENETlEwMUFQTHplUjYxaEc2ZkNwTWVMUGs1SjdkaDVmcVNGT1gwa283dDMxTGpldlA1UUpWRDNfb3lEeUIwQVNFTGYzbXJjRWo0NE1xTjN4NjdHZUhwRWsxdXFualNVVGx2OTZESXNuZkFsakNuLVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Spot ETH ETFs have 50% chance of May approval: Bitwise, Grayscale, Galaxy execs - CryptoSlate",
        "content": "Executives at three asset management firms agreed during a Feb. 13 panel discussion that pending spot Ethereum ETFs have a 50% chance of approval this May.\n\nMatt Hougan, Global Head of Research for Bitwise Asset Management, said\n\n“I think it’s probable we will get an ETH ETF reasonably soon. I think there’s a 50/50 chance by May … “\n\nSteve Kurz, Global Head of Galaxy Asset Management, agreed that there is a 50% chance of a spot Ethereum ETF approval by May. He also predicted a 75% chance by the end of 2024.\n\nDave LaValle, Global Head of ETFs at Grayscale, also placed approval odds at 50% by May. On whether Grayscale would sue the US Securities and Exchange Commission (SEC) in the event of a rejection, LaValle said: “We’ll have to wait and see how it plays out. We have to look at the facts.”\n\nGrayscale previously compelled the SEC to review its spot Bitcoin ETF application through legal action. The SEC cited the case as one reason for approving spot Bitcoin ETFs in January.\n\nThe 50% odds expressed by each executive broadly align with other predictions. JP Morgan member Nikolaos Panigirtzoglou believes there is a 50% chance that a spot Ethereum ETF will be approved in May. Bloomberg ETF analyst James Seyffart — a colleague of Eric Balchunas, who hosted today’s panel discussion — has predicted 60% approval odds. Finally, a Polymarket prediction market suggests that approval odds by the end of May are 48%.\n\nEight firms intend to offer an ETH ETF\n\nOf the three firms listed above, only Grayscale and Galaxy (in partnership with Invesco) have a spot Ethereum ETF application pending with regulators.\n\nOther spot Ethereum ETF applicants include VanEck, ARK and 21Shares, Hashdex, BlackRock (iShares), Fidelity, and Franklin Templeton.\n\nThe SEC must approve or reject VanEck’s application by May 23. Though it will not necessarily approve the fund, it will likely decide on other similar applications simultaneously.\n\nNo spot Ethereum ETF exists on the US market at present. Bitwise currently offers two Ethereum futures ETFs, which do not provide exposure to the spot Ethereum market. Grayscale offers an Ethereum Trust and an Ethereum Futures Trust, both of which it intends to convert to ETFs. Many other asset managers also offer Ethereum futures ETFs.\n\nEthereum Market Data At the time of press 8:31 am UTC on Feb. 14, 2024, Ethereum is ranked #2 by market cap and the price is up 0.17% over the past 24 hours. Ethereum has a market capitalization of $319.55 billion with a 24-hour trading volume of $16.55 billion. Learn more about Ethereum › Ethereum $2,659.17 0.17% Crypto Market Summary At the time of press 8:31 am UTC on Feb. 14, 2024, the total crypto market is valued at at $1.87 trillion with a 24-hour volume of $73.94 billion. Bitcoin dominance is currently at 52.30%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5EV3Z0a2RYQ1NjMnQ5eGZza21BREFFM0w5VlZHMHBSVU1IaG0ydUR6MWtfYlhJcUNRSnlWUmp0QnNFUUljSTZtM3NHMWJ2VzJIVkF0aVpBcExMdWVrRkktUTVJcGdOM1hRdjVXZlVjN20?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "What is the Ethereum (ETH) Burn Address? - Watcher Guru",
        "content": "Since it arrived in 2015, Ethereum has become one of the most popular digital assets and blockchains available. Indeed, the Vitalik Buterin co-founded network has established itself as the second most prominent cryptocurrency on the market. However, for those new to Ethereum or the industry, there is a lot to learn. In this guide, we will specifically answer what is the Ethereum (ETH) burn address.\n\nEthereum, like many digital assets, exists in its ecosystem and requires a burn address to remove some of the native tokens from the circulating supply. Different assets can take differing approaches to the issue of supply management. Yet, despite the differences in approach, it does not lessen the overall importance of the process as a whole.\n\nThe process of burning in Ethereum is a procedure that sees ETH sent to one address to be removed from circulation. This null address is a unique location and leads to the burning of the asset that is sent there. Moreover, they are unique in that they do not exist in association with anyone, and offer an irreversible purpose of removing both ETH and ERC-20 from the market.\n\nThis development is a positive one for the ecosystem as a whole, as it is for all assets. For Bitcoin, as an example, it lessens its overall supply through the Halving event. This is something that happens every four years and slices the overall supply of BTC in half.\n\nFor Ethereum, burning is how it maintains the supply and therefore strengthens the overall value of its price over time. Subsequently, without further ado, let’s explore where the Ethereum (ETH) burn addresses are, and some interesting aspects of ETH burning.\n\nWhere is the ETH Burn Address?\n\nSource: Investopedia\n\nAlso Read: Ethereum Shows Steady Growth; ETH Could Hit $3000 With This Breakout\n\nFor the Ethereum blockchain, the Ethereum (ETH) burn address is specifically designated as 0x0000000000000000000000000000000000000000 and is where ETH and other Etheruem-based tokens are sent for permanent removal. The process is called ‘burning’ and is something that has been taken up by a host of different assets currently on the market.\n\nWhat is also significant about ETH burning is that the address does not have a private key. What this means is that any tokens that are sent to this address are unretrievable. There is no way to access them, or for them to be transacted to different wallets again. Therefore, the conclusion of a transaction to the burn address is the decimation of whatever ETH, or ERC-20 tokens that you have sent.\n\nAlso Read: Ethereum (ETH) Valentine’s Day Price Prediction\n\nAccording to Etherscan, the previously mentioned null address currently features more than 13,300 ETH. Moreover, these tokens equal a value of more than $34 million since the null address has been active. This notes a rather remarkable portion of ETH has been sent to the burn address since its debut in 2015. Subsequently, the overall value of the tokens has seen an immense increase.\n\nAlthough the process of burning ETH has existed since the beginning, 2021 saw a new development in the ETH ecosystem come to fruition. This saw a massive change in how much ETH would be burned thanks to a change within the functionality of Ethereum as a network.\n\nWhat Is EIP- 1559?\n\nAlso Read: Ethereum (ETH) Could Rally 1000% to $27k: Predicts Expert\n\nSpecifically, this change took place through the implementation of Ethereum Improvement Proposal (EIP) 1559. This proposal first came to fruition in 2021 and brought forth a new mechanism that would aid the burning of ETH.\n\nEvery transaction that occurs on the Ethereum blockchain requires a gas fee to be paid. This is a number that is developed through an algorithm that takes data from network activity and volume. What EIP-1559 does is take that base fee and send it to the null address to be burned.\n\nThis integration does a couple of key things that should benefit the Ethereum ecosystem over time. First, it will allow greater predictability for Ethereum fees. Therefore attempting to lessen how high the fees have gotten in the past. Secondly, it will reinforce the asset’s deflationary infrastructure through the proposal. Therefore, helping to secure the value that the asset maintains over time."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOeFRBSVdfajVsSUhCZjM3Zm1iR0lQOTNHdHlaellrV1VNTmRPaWRlSkttaVZfTUVScWZmMG4yVFJLUVdZOWlET0NqcWhNREt0eEhxWEVUZ25EdWZHa01YUWVKMDJ4T2dqb1YtdWlpa0dQZGlfa2Y4blBVRzdSVXRaTFVMcWM5ZXBpNWgzTzNTVkpLcDZ5M0x0WVlxbGZzSlBCZUROYlFoclN0d3dQZWNrT0NfUkdwZEV1dGfSAb8BQVVfeXFMTjhMb3pzTGtQNmtfRXZFQ1Zha3ZfNE5BTVZoVWJBOVJ2RVpmVzdzdHAyM2QwRG9IY2JqVUxZc0xIellVY1NSc2xWeHFFcW5ScnJ0b1NTZjEwSG0tcEpVRDF5S3BBYW5sWWtpVWRrVFRCcW1KLXhtU2Ixc3hRWTRGaTJGSC00NldIeWJhRVQxTDFmaVJlUzVsc3BCbHgwcGRRdUU0ZDZmanJneUVzZHZCS2lMRV9fMzF5YXJ2bmJBSXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Crypto Trader Says Ethereum Accumulation Phase Now Over, Predicts Rally for ETH Rival - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that Ethereum (ETH) is now in an uptrend after a lengthy period of accumulation.\n\nPseudonymous analyst Inmortal tells his 206,500 followers on the social media platform X that ETH has convincingly broken out of a trading range after retesting the lower $2,000 level several times in the past few months.\n\n“Wake up honey, bear market accumulation is over.”\n\nEthereum is trading for $2,670 at time of writing, up more than 6% in the last 24 hours.\n\nNext up, the trader thinks there is a price correlation between ETH-rivals Solana (SOL) and Avalanche (AVAX) and is expressing bullish sentiment on both tokens.\n\n“If SOL pumps, AVAX will follow. Muscle memory.”\n\nSOL is trading for $113.94 at time of writing, while AVAX is trading for $41.27.\n\nThe trader is also bullish on open-source gaming blockchain Beam (BEAM).\n\n“My unspecified amount of BEAM is up.”\n\nLooking at his chart, the trader suggests BEAM is in an uptrend after bouncing off the bottom of a trading range at around $0.0170.\n\nBEAM is trading for $0.0294 at time of writing, up more than 14% in the last 24 hours.\n\nLastly, the trader is predicting Bitcoin (BTC) will go on a massive rally when retail traders sitting on the sidelines enter the crypto market.\n\n“No new participants in crypto and we are at $48,000, chilling. Imagine when the masses come in like they did in 2021. We are going much higher, soon.”\n\nBitcoin is trading for $49,777 at time of writing, up more than 3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPR2J6ajY1N3BZTGlxaE5VVDRjMHkzeE96blluWGhzbDVodVBJQ2JrMW0wMlpBODExVFR1dlVvdVQzWTZra0t6ZkpJNjdCRTdIdnNfVUdUdEstN1dKSzFwVHlkSTNHdDlKRGdxMkVJaXpLTmFiY0lNdjF5MlhpTldaMWFucDlxaUYzWl9TXzh4QXFyM3Q2ZDhaSnBmUWo2RElTeGs0UGhJbXNjZGVs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton files for spot Ethereum ETF, Sui and KangaMoon unveil new initiatives - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nFranklin Templeton has applied to issue a spot Ethereum ETF. At the same time, the launch of the AUS-Sui Blockchain Academy through a partnership between the Sui Foundation and the American University of Sharjah is in the works. So far, the KangaMoon presale is ongoing. KANG is trading for $0.005.\n\nAnother firm files to issue a spot Ethereum ETF\n\nFranklin Templeton has filed to issue a spot Ethereum ETF, allowing the company to provide its clients access to Ethereum.\n\nThe fund may also participate in Ethereum’s consensus mechanism and earn staking rewards.\n\nYou might also like: Franklin Templeton enters competition to introduce spot Ether ETF\n\nOther financial giants, such as Ark 21Shares and BlackRock, have also filed for spot Ethereum ETFs.\n\nThe U.S. SEC is yet to approve any of these applications.\n\nETH is up 14.6% in the past week.\n\nSui Foundation partners with UAE University\n\nAUS-Sui Blockchain Academy has been launched by Sui in collaboration with the American University of Sharjah (AUS).\n\nThis academy will allow developers to learn more about blockchain technology.\n\nYou might also like: Sui defi ecosystem rises to top 10 as TVL spikes above $430m\n\nThe partnership aligns with the strategic vision of the Emirate of Sharjah, which aims to become a hub for innovation and education in the field of technology and blockchain.\n\nSUI reached an all-time high of $1.81 following the announcement.\n\nKangaMoon presale growing\n\nKangaMoon is popular among meme coin enthusiasts and investors.\n\nThe project has already sold over half of its tokens in the presale, and investors are joining to be part of the upcoming community that will focus on meme coin culture, social-fi, and play-to-earn gaming.\n\nYou might also like: Analyst bullish on Polkadot and Celestia, KangaMoon rallying\n\nKANG is the utility token of the KangaMoon ecosystem and will power in-game activities and other functions.\n\nHolders can participate in weekly, monthly, and quarterly competitions to grow their holdings before the game’s official launch.\n\nThe KangaMoon project has potential due to its link to the play-to-earn NFT gaming market, which is expected to grow at a CAGR of 17.93% by 2028.\n\nConclusion\n\nInstitutional investors are interested in cryptocurrencies, as evidenced by Franklin Templeton’s application for a spot Ethereum ETF.\n\nIf approved, altcoins like KangaMoon will likely rally in 2024.\n\nThe first presale stage for KangaMoon is almost ending, and its price could increase to $0.0075."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE00T05ZSGxFWWw3a3RMYUhjUU9rSXlXSk5Wb1JWYW9lTU5mSjExUGZsNUdUU21QYy0yaXA1a1JwNF9jU1djNmNoYTFNUW1rM3dOSlEyUXFoc0tSTEFXZHdVdFV5SkJ4V2htT0otcjNueHVXSk45dVp3bkF5UGlUZ9IBhgFBVV95cUxPWklEOUFTZVN5U3NrTW9ydFF3ZmNYX2Vxb0Z4Wkt0YWIzWEk2bnRiSWNaUjA3aV9uUVJLcDdpN3pCTzBwNGh1b0pRRVFYZi1udW9vUHI1VU05WlZxOHdwNDZUZmNjREdnNVZJOWVfQThFV3EzUU5UOWt0SUthNGpzT1VuSlh1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Points Season: Who's Winning the NFT Marketplace Wars on Ethereum, Solana, and Bitcoin? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe “points” meta has overtaken the crypto space as of late, and NFT marketplaces across Ethereum, Solana, and Bitcoin are jumping on the bandwagon (and in some cases driving it) in an attempt to win the hearts, minds, and wallets of traders everywhere.\n\nWill points translate to token airdrops? Will the NFT market return to its former glory? And if so, which company is in the best position to win the NFT marketplace wars? Here’s how things are shaping up so far:\n\nMagic Eden is the latest NFT marketplace to try and lure in users through points-like loyalty models that could pay off with a token drop or other rewards. The marketplace recently launched its Diamonds rewards system, which includes a retroactive drop of rewards to Solana traders dating back to 2021.\n\nEthereum marketplace Blur pioneered the points model, and it was this time last year that the upstart platform dethroned longtime leader OpenSea by dropping hundreds of millions of dollars worth of BLUR tokens to its most loyal users. By the end of the year, Blur had given away $818 million worth of BLUR tokens after users racked up points.\n\nAD\n\nAD\n\nTensor, the leading Solana NFT marketplace, has employed a similar points-based loyalty model, and similarly overtook leader Magic Eden last year—but Tensor still has yet to launch its crypto token. To be clear, Tensor has yet to officially announce a token airdrop tied to the points, though it has teased such sentiments in the past.\n\nMagic Eden’s launch of its Diamonds system—starting on Solana, but expanding to Bitcoin, Polygon, and Ethereum soon—signaled an apparent attempt to catch up to Tensor. Similarly, we don’t know yet what Magic Eden’s points-like Diamonds will actually be used for, though there’s also a separate NFT token drop coming in parallel with the rewards system.\n\nIs Magic Eden’s rewards shift paying off in terms of boosting its market share? So far, not really.\n\nMagic Eden briefly saw a Solana surge that suggested it was making up ground on Tensor. On February 5, Decrypt observed that market data from analytics platform Tiexo pointed to Magic Eden claiming a 41% share of Solana NFT volume over the previous 24-hour period, compared to 53% for Tensor. That was much closer than it had been in recent weeks.\n\nAD\n\nAD\n\nHowever, as of this writing, Tensor commands about 73% of Solana NFT market share over the past 24 hours, per Tiexo, compared to just 22% for Magic Eden. Zooming out a bit, there isn’t a significant shift over the past weeks. In the last seven days, Tensor has over 75% share compared to 19% for Magic Eden; in the last month, Tensor claims over 73% with Magic Eden at less than 22%.\n\nImage: Tiexo\n\nExpanding the data to include platforms across several major NFT chains, however—including Solana, Ethereum, Bitcoin, Polygon, and BNB Chain—reveals some other interesting details about how rewards models are further reshaping the marketplace wars.\n\nLooking at the broader landscape, Blur rules the market by a wide margin, commanding about 42% market share over the past week. That’s entirely on Ethereum mainnet, still the leading blockchain for NFTs, and Blur’s existing token and history of sizable airdrops to users appears to be propelling its continued dominance.\n\nTensor is second overall with about 14.5% market share among tracked networks, all on Solana, followed by Magic Eden with 14%—with the majority of that volume coming from Bitcoin Ordinals sales.\n\nOpenSea, which has no points system and has long resisted calls to launch its own token, lands in fourth with about 12.4% share, primarily on Ethereum and scaling network Polygon. Bringing up the rear is OKX’s marketplace for Bitcoin Ordinals, which are similar to NFTs, with about 7.7% market share.\n\nTiexo’s 24-hour data shows some deviations due to the smaller sample size, with Blur holding an even larger share at 52.5% and Magic Eden up second with just under 12%—but the majority of that volume is on Bitcoin, likely due to Tuesday's sale for the Bits gaming project. OpenSea, Tensor, and OKX bring up the rear, in that order.\n\nImage: Tiexo\n\nMagic Eden is readying a significant push on Ethereum with the launch of a new marketplace for that chain, created in partnership with Bored Ape Yacht Club creator Yuga Labs. Set to debut on February 27, the marketplace has also set alliances with the teams behind major Ethereum projects like Pudgy Penguins and Azuki.\n\nWill the launch of Magic Eden’s new Ethereum marketplace, with associated Diamonds rewards, help turn the tide and provide a sustainable boost as it battles rivals? We’ll see later this month, as it’s the next big shift on the horizon—although the NFT world is ever full of surprises.\n\nAD\n\nAD\n\nEdited by Guillermo Jimenez"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNQjZmSlVMaHlQZkNzaVgxQ2FnTFk5TTE1SUIyYjdmclF2bm0wWTVEdUR0Rnc2NWt0cGlVeWFyM2pxWWFOdkM2VC14dXpsYTZFTDdISjBGU0ZCTW9uc3M0YzMyWm5iRkcybjJZVF9JaDBuTHM5U3pKM21pVXNNQUZ3NWFwX3NQc2x3OV9sekpFNFJKQUNOTDhuRGJYdkdDM1lhU2F3Yl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Name Service might pay $300k to resolve eth.link dispute - Domain Name Wire",
        "content": "ENS Labs asks DAO about settlement offer and reimbursement for legal expenses.\n\nEthereum Name Service (ENS) has asked the ENS DAO to vote on a potential settlement over eth.link.\n\nEth.link is used as a resolving service for .eth names. People can type a second level .eth name followed by eth.link to get the name to resolve in their browser.\n\nThe person who registered the domain went to prison for helping North Korea evade sanctions and the domain expired while he was in prison.\n\nThe domain was registered at Uniregistry, which had an expired domain auction partnership with Dynadot. Dynadot auctioned the domain for $852,000, with Manifold Finance as the winning bidder.\n\nEthereum Name Service subsequently sued GoDaddy (which owns Uniregistry), Dynadot, and Manifold Finance. The domain was transferred to ENS due to a temporary injunction, but the case continues.\n\nManifold was dismissed from the case due to a lack of jurisdiction, but might still have a claim on the domain. The company has now offered to settle the dispute for a $300,000 payment.\n\nENS Labs is putting the settlement offer out to the ENS DAO. It is also asking the DAO to reimburse its legal expenses to date, which total about $750,000.\n\nGiven the legal expenses incurred to date and likely future expenditures, the settlement seems to be a bargain for ENS, assuming that the other parties also agree to the settlement and don’t demand their legal expenses to be reimbursed.\n\nIt appears that ENS Labs wants to avoid further legal expenses. It says that if the DAO refuses to reimburse it for its legal expenses, “ENS labs will act to minimise its further expenses by having the case dismissed.”\n\nA settlement would also be helpful because ENS would no longer be entangled in a lawsuit with GoDaddy. Despite the lawsuit, GoDaddy worked with ENS to integrate its new gassless wallet connection into the GoDaddy registrar."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQeUxlQnZTeHlWdl9xa2luNEEzR0NtcEFEekN5M0JwVGRwTkNoRnNEclN4aUlVaEtuUFp6WExZbUNWZzhXWDMxY3JyMUU0RUF0UjI0dzRERV8zOWFvUDVwVWlWeGE5TEZyeTBlR0tzTjdLNW5CMWhtOW1ZeU1KeW5KbVVCMVQ4QWJ6b0wtR19oX0w2TUpYRmVBOHRUZlpuUm4wWVJqRmpvNWxmblhNVnRCODJFQ3h0bUhvWC1qQ0UybThtdldWcUg4YldqeHhrdFRBOXdYdNIB2gFBVV95cUxOZGZsMkVTaVBqZUhSZTFSTmRxM1diZGFNd2dMb1BuRXlXdlgxYVpPeTZKRkZGSk1lUkpUSUJGNkQ2Q0d1NER4NDVFWFR5UmItc01jRE9uZFZLOWFRQ0l2RVh3elVlcTNTWkxWVEFBdTJsNlZ0QzJXYkRUZXlOZ3Z3eHd4RVJxNGQwSUhHTjNvby1TR21lV1hERkVOM0ZRU0luTXFxc09WdjBKbm1qV0NoWUxqWEU0ZE9ENUhEbXdVbE1qc0d3MGhoWlpBRFZ1alBnUXZ1RGZCX05JZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Peter Thiel’s Investment Fund Bought $200,000,000 Worth of Bitcoin and Ethereum Right Before Bull Run: Report - The Daily Hodl",
        "content": "Billionaire entrepreneur Peter Thiel’s investment fund reportedly purchased $200 million worth of Bitcoin (BTC) and Ethereum (ETH) right before crypto prices took off last year.\n\nCiting sources with direct knowledge of the matter, Reuters reports that Thiel’s Founders Fund bought $100 million worth of BTC and $100 million worth of ETH in Q3 and early Q4 of 2023.\n\nThe fund started acquiring Bitcoin when it was priced below $30,000 and executed purchases of both crypto assets over several months, according to the report.\n\nThe top crypto asset by market cap is trading at $49,498 at time of writing and is up nearly 92% since September 1st while the leading smart contract platform is trading at $2,628 and is up more than 61% over the same period.\n\nFounders Fund started purchasing Bitcoin back in 2014 but sold off its BTC holdings before the crypto market imploded in late 2022, according to Reuters. The firm reportedly generated gains of $1.8 billion from the investment.\n\nThiel co-founded the retail payments giant PayPal and the software company Palantir. He was also one of Facebook’s earliest investors and has expressed vocal support for crypto assets in the past.\n\nFounders Fund now has more than $12 billion worth of assets under management (AUM). The fund has previously invested in well-known companies like Facebook, Airbnb, SpaceX, OpenAI, Stripe, Spotify and The Boring Company.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOeF9zNno1MlFJdzE3UGZMbzJVclAyVHIzSThtSGtQd3FOYmNVREEyYXVDclgwSExFUWpWVVFsZmNNSE1SLVBOeHMxQk16OFc1THZ1Ul9nSEtqWk1BM3VRX2tuSXJhQmg0SEk1UHpPNmtRSXc0RW1iQkl0R0VaeXNRTlh5ZFfSAYwBQVVfeXFMTVctc0pJSW9UbTgtSm1Od3JuZXRUYUVaTmZwR0NOVGdsTTdkbnlQWjd2bkowWXBBdXRacHUyWVRPdVVjOUJyV19YbDRxS0RiRjFDd0tSa3Z1eE1KUi12azhybmd0QktiQUd4SWRORC1raDZxU0hGZWo4dVF1dXRQVW1Va2pEX3lyOC05SG0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Ethereum and Solana Post Big Gains, Following Bitcoin Bullishness - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA wave of optimism has swept the crypto market, propelled by significant price surges for industry heavyweights Ethereum (ETH) and Solana (SOL).\n\nSolana has defied expectations with a strong price rally, seizing the fourth spot in cryptocurrency rankings by market capitalization and overtaking Binance's BNB token. While a major network outage on February 6 could have spooked some paper handers,market sentiment was bullish enough to counter the fears.\n\nThe price of Solana went up 4% today, from $112.54 to its current $117.14. For swing traders, things also look good, with the cryptocurrency registering an impressive 15.9% spike in the last 7 days.\n\nAD\n\nAD\n\nThere appears to be growing appetite for risk in the markets as the widely followed Crypto Fear and Greed Index hit 74 out of 100, its highest level since Bitcoin's record peak in November 2021.\n\nBitcoin is usually seen as a volatile alternative to stocks, but altcoins are even more volatile than BTC, and are very sought after in bullish times for their potential to yield high gains in short periods.\n\nBeyond overall market sentiment, the total value locked (TVL) in Solana's DeFi protocols has experienced a meteoric rise of over 944% since 2023, according to DefiLlama, reflecting heightened investor confidence and engagement in the Solana ecosystem. The solid growth comes despite the low blow that came up with the collapse of FTX.\n\nSam Bankman Fried, the former CEO of the defunct exchange was a major fan and investor in the token.\n\nAD\n\nAD\n\nAs a side note, preorders for the new version of the Solana Mobile Saga smartphone have surpassed expectations, achieving over 100,00 presales and giving the Solana Foundation enough room to increase its price and cash in on the brand marketing that a crypto-phone brought during a token bull run.\n\nThe Founder Window for #Chapter2 has officially closed and we’re thankful to everyone who participated! The Early Adopter Window has now begun and has a preorder price of $500. pic.twitter.com/YTjtbqovb4 — Solana Mobile 2️⃣ (@solanamobile) February 14, 2024\n\nEthereum maintaining momentum\n\nFollowing broader market movements, Ethereum continues its ascent. ETH has registered impressive gains today, exhibiting remarkable strength throughout the market upswing.\n\nThe price of Ethereum bounced 5.6% after a minor red candle yesterday. ETH started the day at $2,642 and went up all the way to its current price of $2,781.\n\nThe price of Ethereum hasn't see such levels since April of 2022.\n\nBitcoin's price movements have considerable pull on altcoins, including Ethereum. However, on a more fundamental level, the highly anticipated Dencun upgrade to the Ethereum network, slated for March, promises significant efficiency improvements and has fostered a positive mood among investors and the crypto community.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQUHdRZF9ja2Z3OEJ1Qmp1RXpUc0ZMQ0VvTERaa0k3T0h5S0lWQXZWVW9PdnB6WWl2cWRmbko2NHRvNk5GalFLRl9wcElRX3RKOXJOcE9NaFdtbDJFNTVSMnZ5dDd6eFZBMHpKTTRaRVdockhKUWRacktfSFlzaGFFZkZ3NWNXaEcycG9jMkVyN0xOOXV2a29aUTVvbUVCZ9IBpgFBVV95cUxPOFh6WERnbk1TQTdWYlZfZUFoTTU4aU4wVVdhZE53eElIQzJaQlNKZ1RETEtrSy05dXV4dDRiWU5kWmhXRFFVYVA3elEzbFBkNTJIUGlLODNHVmVkbEc2b0tHbXJGZXdhQ0t6djUxcFh4ZE9NNHVROXRWbEJVZEh6dVRUN2ZDWmxTb0lsbU80bk05d2tkTllFUGFGT3BhTkd6VFdlUTFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Glenlivet Distillery Mixes Ethereum NFTs and AI Into Whiskey Collection - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Glenlivet, a celebrated distillery in Speyside in northeastern Scotland, has launched a 50-year-old whiskey collection to commemorate its 200th anniversary. Additives to this pristine liquor, however, include blockchain technology via NFTs and utilizes generative AI for label design—checking all the hype boxes from the last few years.\n\nThe collection, titled \"The Twelve Elements,\" pays homage to the twelve essential components that shape Glenlivet's renowned single-malt whiskey. Cask expert Kevin Balmforth explained that the whiskeys composing the collection are among the brand’s oldest official releases.\n\nBalmforth also pitches the release as innovative, highlighting the distillery's embrace of technology while honoring its rich heritage. “This ultra-rare collection represents a look to the future and offers whiskey enthusiasts worldwide a foray into the evolution of luxury investments,” he said, as reported by Decanter.\n\nOne of the bottles being sold by The Glenlivet\n\nAD\n\nAD\n\nEach bottle in \"The Twelve Elements\" collection is paired with a unique NFT on the Ethereum blockchain, available through The Whisky Exchange's Cabinet marketplace. These NFTs serve as digital certificates, ensuring irrefutable proof of ownership—reinforcing its appeal to whiskey collectors. And generative AI was tapped to design unique labels gracing each bottle, with one-of-a-kind designs based on the respective element.\n\nThe release extends a wider shift in the NFT landscape, where experts anticipate a growing emphasis on utility and real-world applications. As Decrypt previously reported, experts like Pedro Herrera, Head of Research at DappRadar, believe there’s an ongoing change in the dynamics of the NFT space.\n\n\"Collectibles that we were so used to in 2021, like Bored Apes and CryptoPunks, have slowed down,” Herrera told Decrypt in a previous interview. “People are starting to grasp the real concept behind NFTs, which is proving ownership, authenticity, and so on.”\n\nOther major brands like Mastercard, Budweiser and Nike are also exploring this potential. Besides the appeal of NFTs as unique digital items, businesses have been exploring ways to leverage decentralized solutions to increase transparency and traceability and fight counterfeit and forgeries.\n\nAn auction for The Glenlivet “The Twelve Elements” collection begins on February 21, where prices are expected to surpass $43,000 (or 16.4032 ETH). Each bottle will be shipped later this summer with a digital certificate.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOR0JPRDNGLUplT3VvcFI1S2gxV3p1Vm5BRUpMRFhsbWh4dEkyYmNMSGYtdlBHckhuZGtiWFJhdW04SW0xTGRPY0ppNTN4QW52bGM2Q1JoSEp2THNzM3BiMW8wUEFINFJKQlZpZWxjX0UySUdKYTZHR3FnX0JTYWZVVUVPNHNGUGFZS21CM0VyQlFfbzloWDd0T0V5Vk5welcxY2NVenZCZHNKdWxraEYyenNyNVdJMWpNcjBvbldYLXp5SF84NnA3aDRhY9IB0AFBVV95cUxNcWhSX1pnMWxJcFBsUTI4cnpMRW42UlAyQ3NBMmxiczlEbHdlUUNoVWRFMXlJY1NoODZtbnotQTgxVWp5TXBoc2NzaHl4bmw0anA3b2VENmtvcmtOdWtWZEpBTF90Mkx1cDFVekRKQkVzcEhSWFBVUkNmTWw5WkxHT3NGWjNxRE4wWkYzeVJNZkRmeXNaNlhvNFlwR1hKWXBnYzBuLVhCRG0tdXV3TTlEYkNTNjRIVlpkM2R2VU5nZ0thN3E2d2N5cHl3dFkzUDlq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "$1,600,000,000,000 Asset Manager Submits Application for Spot Market Ethereum Exchange-Traded Fund (ETF) - The Daily Hodl",
        "content": "Global investment giant Franklin Templeton has submitted an application to the U.S. Securities and Exchange Commission (SEC) for a spot market Ethereum (ETH) exchange-traded fund (ETF).\n\nThe investment firm, which currently reports $1.6 trillion in assets under management (AUM), was one of 11 applicants who received approval from the SEC last month to launch a spot Bitcoin (BTC) ETF.\n\nIf the product is approved, the Bank of New York Mellon will be the custodian of the fund’s cash holdings, according to Franklin Templeton’s filing, which was submitted on February 12th. Coinbase Custody will serve as custodian for the ETF’s Ethereum holdings.\n\nIn the application, Franklin Templeton says the ETF will offer investors a convenient way to gain exposure to ETH.\n\n“The Shares are intended to offer a convenient means of making an investment similar to an investment in Ether relative to acquiring, holding and trading Ether directly on a peer-to-peer or other basis or via a digital asset platform.\n\nThe Shares have been designed to remove obstacles associated with the complexities and operational burdens involved in a direct investment in Ether by providing an investment with a value that reflects the price of the Ether owned by the Fund at such time, less the Fund’s expenses.\n\nThe Fund is not a proxy for a direct investment in Ether. Rather, the Shares are intended to provide a cost-effective alternative means of obtaining investment exposure through the securities markets that is similar to an investment in Ether.\n\nThe Fund is a passive investment vehicle and is not a leveraged product. [Franklin Holdings] does not actively manage the Ether held by the Fund.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQLVI2MUd0bDdteXlYUEM0dmxIcFM4VUV6ZTRCSHFaaF96OTJiOS1jT3dZR2x1NXJlM3Bxb19DbVRIZnZUZ0haa3RFX2RUUkxaRUJCekxaYTRRU0pKRVZwVlcwcFJZWEJvQ2lxSWhFbFlEOTlYQXVMVjVEMGVhUmZmV2QtWno4TjdUNlFSTUVlMHhEX2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: Over 35% of ETH now locked, crypto demand explodes! - Cointribune EN",
        "content": "Tue 13 Feb 2024 ▪ 4 min read ▪ by Fenelon L.\n\nThe amount of Ether (ETH) locked in smart contracts on Ethereum has reached a new record, surpassing 35% of the total supply. This strong demand reflects the growing utility of the Ethereum network.\n\nEthereum Drains Its Available Supply, 35% of ETH Now Locked\n\nSince the successful deployment of the proof-of-stake consensus mechanism with the famous “The Merge”, the number of active validators on Ethereum has continued to grow. Now, according to a recent tweet by analyst Leon Waidmann from BTC-ECHO, more than 35% of circulating ETH are locked in smart contracts.\n\nThis record proportion reflects the steady increase in Ethereum’s actual use, beyond mere speculation. An increasing amount of ETH is being “committed” to the future of decentralized finance through staking, DeFi protocols, or DAOs, rather than just being traded or sold.\n\nThis underlying trend can be explained by two factors:\n\nFirstly, the voluntary locking of ETH in smart contracts proves a sustained demand from users convinced of Ethereum’s long-term potential. They agree to lock up their funds, sometimes for long periods, in exchange for gains such as interest or transaction fees.\n\nSecondly, this new record reflects the growing utility of the Ethereum blockchain, now perceived not only as a speculative asset but also as a technological platform that enables the creation of cutting-edge decentralized applications in areas such as finance (DeFi), identity, and governance (DAO).\n\nA Premise for the Takeoff of ETH Price?\n\nWith the major technical update Cancún scheduled for March 13, 2024, which is expected to significantly reduce transaction fees, and the high expectations surrounding the possible forthcoming approval of Ether spot ETFs by the SEC, Ethereum today seems poised to initiate a powerful bullish movement.\n\nThe price of Ether has indeed crossed its early 2024 highs. And with all these ETH locked in smart contracts, the available supply on the markets is drastically reduced. A situation that further enhances the bullish potential of Ether.\n\nMany analysts therefore expect the “Ethereum rocket” to take off soon, driven by the combination of a very strong demand and a real utility that continues to progress. The blockchain seems to have reached a critical mass, a premise for a new historic surge in the months to come.\n\nIn summary, with more than a third of ETH now locked on the blockchain, Ethereum seems to have reached a tipping point that bodes well for the coming days. The enthusiasm of investors and developers suggests that new records are on the horizon for the star crypto.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPQktXY1lSZFc5aVJwMjRVY1lwZFBZb25BTnJ3QVkwdmVxNnZpVXJnVG1lMm5MSGtMR0psUzBIWkpHQlBmQzNnbThVdmNxc01OSlNkME93UU5mQnhxQXFBbklQT2Q1SEtYZGFqYkh0TUh6NFA5ZS0yanVPU1YtdS1OUU50MUI4MGJyMlhWTzdwSHlVZE5GcExSWXd1UjdBRWUwbWtrSzhmQzNHT3BBYWfSAbMBQVVfeXFMTzJ6Q3NVNWdpUnhvRzJsLW4xMlBsN3lTRE5lTldRdnNFZG1fTTV3eWlIaVRkaExqckVTOUpURVRzVGxQalJpWG4zS3JSbFFIdkFZNFdQYzU2aDdmTFd4OFloUWQyWE9tRDVpdFMtUlRRc1NBN1czTDNmZVZ1bmhVM0dPX2RWZVFSNUREVERBbHlTWEloYlBtU3dzVVpSNjFEcGlOZWhJQXNSbVE4YURZZV9NWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "The Protocol: Bitcoin's OP_CAT, Fake Ethereum Tokens, Starknet's Airdrop - CoinDesk",
        "content": "FILES NOT FOUND: Ethereum has a standardized process for adding new token standards, including the well-known ERC-20, for fungible tokens, and ERC-721, for non-fungible tokens or NFTs. But a new unofficial token standard, ERC-404 is suddenly getting traction – and there's now a supposedly improved version called DN-404. Both standards aim to combine virtues of fungible and non-fungible tokens, theoretically offering the potential to fractionalize NFTs – sort of like creating separate tokens representing a partial interest. The first ERC-404 token, PANDORA , traded as high as $32,000 on Friday morning from a low of $250, in just under a week, as reported by CoinDesk's Shaurya Malwa . \"Several projects have already latched on to the hype and issued their own versions of ERC-404 tokens,\" including on the Arbitrum and Solana blockchain ecosystems, Malwa wrote. According to the analysis firm FundStrat, \"this standard also seamlessly aligns with the ongoing trend of meme token trading.\" Nansen, the blockchain data firm, noted in an email that PANDORA \"recorded a staggering $190 million in trading volume just a week after it was launched.\" The flurry was enough to drive a spike in Ethereum fees . Wu Blockchain newsletter wrote that \"the current hype and FOMO are already very strong.\" CoinDesk's Daniel Kuhn wrote that there are nagging worries some blockchain users might mistakenly think that ERC-404s have been approved and vetted under the official process – raising \"concerns over the safety of the technical design of ERC-404s, considering that they are unaudited.\" On Monday, a group of Ethereum application developers started a new unofficial token contract purporting to solve some of the apparent drawbacks – called DN-404 , short for “Divisible NFT-404.” One of the developers, who goes by the X handle @0xQuit, tweeted that the newer version \"averages about 20% gas savings vs ERC-404.\""
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOQ1hhY3V6MXg1NW5HNzl2cDNsbFdaYV9KVjBxVWtPcUoybDBlR1drNFNXSEpWeHVoUVlTa1A5eVpzUGlvazJfanJyckRSYkh3RzFhQVFzQlJMaVVrREZlQ1hkY3p1UENpTG5yODctSjFVSkx6RDl5VGJfT0VyallrcjMyTk84d3dWVlItNHp0WkhZdTBqbGpuVkdRTDBUQ09xYVNHMVRRcDc4U3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Why Are Creators Minting NFTs On Bitcoin Rather Than Ethereum? - DisruptionBanking",
        "content": "Artists, creators, and collectors have all sought to capitalise on the explosive growth of the non-fungible token (NFT) market. While Ethereum has long been the preferred blockchain for minting NFTs, a new trend has emerged in which crypto natives are turning to Bitcoin as an alternative. This shift prompts an examination of the reasons behind this transition and an evaluation of the advantages and disadvantages of using Bitcoin for NFT minting.\n\nThe Rise of NFTs and Ethereum’s Dominance\n\nNFTs have changed the way we perceive and monetise digital content, giving creators a means to authenticate and monetise their work in the digital world. Ethereum, with its robust smart contract capabilities and established ecosystem, emerged as the de facto platform for NFT minting and trading. Its smart contracts work under ERC-721 and ERC-1155 standards, providing a framework for creating and exchanging NFTs, as well as for interoperability and liquidity within the growing NFT market.\n\n\n\nHere are 5 token standards you need to know about.https://t.co/ngj3v0dUPq — nft now (@nftnow) June 8, 2023\n\nThe Case for Bitcoin NFTs\n\nWhile Ethereum’s dominance in the NFT space remains undisputed, a growing number of individuals are exploring the viability of Bitcoin as an alternative platform for minting NFTs. Here are some factors that may have contributed to this shift:\n\n1. Bitcoin’s Brand Recognition and Network Effects:\n\nBitcoin enjoys the most brand recognition and network effects as the pioneer cryptocurrency blockchain. Using Bitcoin’s iconic status, proponents believe that minting NFTs on the Bitcoin blockchain enhances their perceived value and marketability, tapping into the broader Bitcoin community and investor base.\n\n2. Security and Immutability:\n\nBitcoin’s blockchain is popular for its excellent security, stemming from its extensive hash power. By minting NFTs on the Bitcoin blockchain, creators benefit from Bitcoin network’s unparalleled security.\n\n3. Layer 2 Solutions and Scalability:\n\nEthereum and Bitcoin still struggle with scalability challenges and high gas fees, and Ethereum has seen various solutions helping this challenge. However, Bitcoin, too, has seen the emergence of Layer 2 solutions such as the Lightning Network. These off-chain scaling solutions enable faster and more cost-effective transactions on the Bitcoin blockchain, making it an attractive option for NFT minting.\n\n4. Interoperability and Cross-Chain Integration:\n\nThe growing need for interoperability between different blockchain networks will open up for cross-chain integration. This will allow NFTs minted on the Bitcoin blockchain to seamlessly interact with other ecosystems and platforms.\n\nBitcoin NFT project Taproot Wizards has sold out its first collection, Quantum Cats, raking in $13M from the sale of the 3,000 digital images made with the Ordinals inscriptions protocol.https://t.co/5WY0mfK33O — CoinDesk (@CoinDesk) February 10, 2024\n\nAdvantages Of Using Bitcoin for NFT Minting\n\nOne significant advantage is its reliability. Bitcoin still boasts the only ecosystem that is totally decentralised. This virtue allows Bitcoin transactions to be irreversible, ensuring secure transfers of digital assets without the risk of fraud or forgery—a great and appealing option for NFT minting.\n\nBitcoin’s brand recognition is also an attractive attribute. As the legacy blockchain, its pull for NFT marketability and value can be skyhigh.\n\nThere is also Bitcoin’s cost effectiveness. Transaction fees are typically low, making NFT creation accessible to a wide range of users. Also, the widespread acceptance of Bitcoin by exchanges and businesses simplifies the process of transferring tokens.\n\nDisadvantages of Using Bitcoin for NFT Minting\n\nOne significant limitation is its restricted functionality compared to Ethereum. Unlike Ethereum, Bitcoin’s blockchain wasn’t initially designed for smart contracts. This barred it from having complex capabilities to build smart contracts and, consequently, NFTs.\n\nAnother concerning issue is Bitcoin’s slower block time. Transactions on the Bitcoin blockchain take longer to process and confirm compared to Ethereum. Such delays can frustrate both buyers and sellers waiting for their tokens.\n\nMoreover, Bitcoin still trails Ethereum in terms of developer support. Ethereum boasts a larger developer community, providing a wealth of tools and resources for creating and deploying smart contracts. Bitcoin’s lack of builders can make it challenging for creators to find necessary resources for NFT creation.\n\nDid you know that Bitcoin supports smart contracts?\n\n\n\nLedger Academy dives into what they are, how they work, and what you can do with them: https://t.co/No1QRYUQWp pic.twitter.com/fwN8ylKt3b — Ledger (@Ledger) January 8, 2024\n\nThe emergence of Bitcoin as an alternative platform for minting NFTs shows there’s a broader shift towards exploring diverse blockchain ecosystems and milking the unique features and advantages they offer. Although Ethereum remains the dominant force in the NFT space, Bitcoin’s brand recognition, security, and scalability present enticing reasons for creators to consider minting NFTs on its blockchain.\n\nBut the listed challenges such as limited smart contract functionality and a less mature ecosystem shows that builders should evaluate closely when choosing between Ethereum and Bitcoin for NFT minting.\n\nUltimately, the decision rests on the specific preferences, and objectives of creators, as they navigate their project.\n\nAuthor: Adeniyi Makinde\n\n#NFTs #Bitcoin #Ethereum #Blockchain #Crypto #DigitalAssets"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOYUgxNG1paVJjeV8yMFFTSHd2TXJURTUxUDN0bDZHdTNvYUNOaXY5Zk0zMkpuY0p4czVkb1ZGVWFBSnV1UGhObXBpYXRqSUVwNzk4ZjZJYlFqRElaSEZUMHZXLTZOVHVIMUp5bjRjUHh3cGdoWW5JVEpwWGRDeGRaV1BvUWxKUXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "$Sharbi Unleashes FETCH to Allow Users to Bridge Between Shibarium, Ethereum and Arbitrum in Seconds - Yahoo Finance",
        "content": "One year after crypto's \"Queen of Memes\" launched on the Ethereum chain, the Sharbi team is rolling out its bridge built by Solidity.io to reduce offchain bridging time from 7 days to 15 seconds\n\nAustin, Texas--(Newsfile Corp. - February 14, 2024) - The team behind $Sharbi, the top overall coin on the Shibarium chain that was recently launched by the Shiba Inu community, today announced the launch of FETCH, the first multichain bridge that connects Shibarium, Ethereum and Arbitrum. Built by Solidity.io, FETCH will reduce current offchain bridging time from seven days to 15 seconds, a massive cryptocurrency market advantage. Go to https://fetch.sharbi.net/ to view and use the bridge.\n\n\n\n\n\nSharbi\n\n\"Investors understand the frustration of having their hands tied when they recognize an opportunity but can't access their funds fast enough to capitalize on it,\" commented Andrew Rosemond, Sharbi Core Team Member and a Decentralized Autonomous Organization (DAO) Administrator for Sharbi. \"FETCH will be truly transformative for the Shibarium ecosystem, empowering users to bridge between chains in seconds, not days.\"\n\nThe second significant Valentine's Day in a row for the Sharbi team, the FETCH bridge is today being rolled out to the entire cryptocurrency community, following months of building and testing with Solidity.io, and on the heels of Sharbi's first birthday, January 25th. FETCH users are now able to bridge $Sharbi, $Bone and any tokens the DAO votes to whitelist going forward.\n\n\"Sharbi is just getting started,\" Rosemond added. \"The word is beginning to get out about Sharbi's new investment fund Boom Boom Capital, as well as the strategic partners with whom we've aligned to build the Sharbi ecosystem.\"\n\nSharbi is a fully decentralized, 100 percent DAO-controlled, pay-to-hold coin. Of note, Sharbi is also a Know Your Customer / Know Your Client (KYC) Verified Project and achieved The Verification Gold Standard® of Assure DeFi®. To date, Sharbi has distributed over $1 million dollars to holders as passive revenue.\n\nTo learn more about Sharbi, go to https://www.sharbi.net/.\n\nAbout Sharbi\n\nSharbi is a community-owned, multichain cryptocurrency built on Arbitrum, Ethereum and Shibarium. Sharbi harnesses the power of a decentralized WEB3 community and is 100 percent Decentralized Autonomous Organization (DAO) controlled. Sharbi is a Know Your Customer / Know Your Client (KYC) Verified Project and achieved The Verification Gold Standard® of Assure DeFi®. Boom Boom Capital, Sharbi's DAO investment fund, participates in exclusive seed round/pre-sale crypto opportunities, and all revenues generated are distributed quarterly. A MEME 2.0 community token, Sharbi provides ongoing USD Coin (USDC) and BONE rewards to holders. A four percent fee on every Sharbi transaction is redistributed to all holders across each chain in USDC (ETH/ARB) and BONE (Shibarium), and a one percent fee goes toward project liquidity. Sharbi also launched FETCH, the first multichain bridge that connects Shibarium, Ethereum and Arbitrum. Connect with us on Twitter (@SharbiToken) and Telegram (t.me/SharbiPortal).\n\nStory continues\n\n\n\n\n\nFetch Sharbi\n\nMedia Contact:\n\nAndrew Rosemond\n\n832-875-1414\n\nlnrcryptoatx@gmail.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/197823"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPaE5fRkozaWk1dGlLNVZRV3pzQmpfUGxiZS1NekhFUkQxRWN0SXhuV2lsVG81emxOS0I1bVk5VG1rd0pjT0hjZDFQcnVUbFAtQVhjazdmTzhSMkRWeGRxbDZpdXI0dlp2V2JNXzBpTjhNUFBaR0JBT2FTdDNoZmY3T0hNWUFGZG52cHpnUlZMdzNNQTdmWjM2clZNc05naFNqSkk1ODVWMTV5dGhvTnhiVFUxdEFwaVhsRjZZZm9FLW1TYkVlX255TGE4aUp1aG1Yb1cxZmp2QlJMQdIB3wFBVV95cUxPN05xbGRaOHBheHVLd0FJdlVyb3I3Q0ZlZlR0WnExY19pdU42ZVdNT1Q4cmFwSXctdVRiNFRIYWgyZ0dwaVl5WW1vWWRMR0xsdE0tTVVJVGdmRjd5TmFCcDVlVENOUzc4Y1Z5bS12N2gxZDRnbkdQQlFGRTlPc2pyUnhJX0dZWlVsVHRYeGRyU0tTb05WcUJ5alNBMGg1WjhsX0VQMEhQQlNWMUdVc3FaY3ppdFZZUThRcEo2VmJ5dWt5RHMtTTF6S05vU21SbWU1N1J1bHpOYVQ2TTZaR3h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton registers for spot Ethereum ETF amid growing competition | Stock Market News - Mint",
        "content": "Asset management firm Franklin Templeton has officially entered the competition for a spot Ethereum Exchange-Traded Fund (ETF), becoming the eighth player in the market seeking approval for a similar product, Reuters reported.\n\nThis January, in a significant development for the cryptocurrency industry, the United States Securities and Exchange Commission (US SEC) approved 11 spot Bitcoin ETFs in January. This marked a watershed moment, fulfilling a decade-long demand for regulatory approval within the crypto space.\n\nAlso Read | Bitcoin surges to $50,000 for the first time since 2021 on ETF demand\n\nSpot Crypto ETFs Explained A spot crypto ETF, like the approved spot Bitcoin ETFs, tracks the market price of the underlying digital asset. This provides investors with exposure to the token without requiring direct purchase.\n\nWith Franklin Templeton's registration, there are now eight ETF providers competing to introduce spot Ethereum ETFs, the report added. Notably, all these contenders had rolled out spot Bitcoin products in the same month.\n\nAsset Disparities among Major Players While BlackRock and Fidelity, the leading contenders in the spot Bitcoin ETF race, boast assets of $4.18 billion and $3.49 billion, respectively, Franklin Templeton is positioned near the bottom of the league table, the report said. As per data from BitMEX Research, assets in Franklin's Bitcoin ETF total only $77 million, with seven out of the nine newly launched spot Bitcoin ETFs holding assets surpassing $100 million.\n\nDespite its current position, the veteran asset management firm, established in 1947, remains resilient. Franklin Templeton is actively marketing its spot Bitcoin ETF through Google ads, signalling its commitment to gaining traction in the market.\n\nAlso Read | Nvidia overtakes Amazon in market value of $1.78 trillion\n\nIndustry Developments and SEC Decisions Recent SEC decisions have impacted other players in the crypto ETF race. The regulator delayed its verdict on Grayscale Investments' application to convert its Ethereum trust product into a spot ETF. Similarly, BlackRock's application for a similar product faced a delay. VanEck was the first to file for a spot Ethereum ETF, and the SEC must decide on its approval or denial by May 23.\n\nIf approved, Coinbase Custody, a unit of crypto exchange Coinbase, will hold the proposed ETF's Ethereum in custody. Notably, Coinbase Custody is also the proposed custodian for BlackRock's Ethereum ETF."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPYVNNOVZESG1iYVNFMDlCRHd6bWs2QkRhX2lMN2tSaWJ2VVR6VFBzVG5mNTFtaFc1Q0ZvRzlaNFkySWZXaEZUdGRNOFFIT3Q3ZG1CT1lvREEwWUdTWk01eWJ2aG51UV9HYXNNbmZBaVlPM1pfd1B3RFA3YXdfbll0ZGxtUG9jUDRzTEQyZE1TSkt5NmdHVUNFSG5feTF0QnZ6alFDeDlrNXVBRkdm0gGyAUFVX3lxTE05ZHQxRFh4UWVzSFBWenBXcFVNUXNLV09hZ1VCbnJKWV9uUE8zSnpxODQxMG5XQjdMTTlUY3BZNkJsTkYzektFX3BnNHpEWWV0UjBFN29TT0NUMjJFOTJGNE5GSWR1ZG1TOEV3M1NoZlVRQ01lWnZFYkZCekFoaHc3dGFyQ2hXbGJMaVVfelhMdjRoS0lMeW9XV1lWQTlzNnBBSERyWXF0Z2VFWWt5dUZfZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Cardano (ADA) Secures Crucial Breakthrough, Ethereum (ETH) Breaks New High, Solana (SOL) on Verge of Important Price Test - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCardano has surged past the 50-day EMA, a technical indicator often used by traders to gauge the intermediate trend direction of an asset. The 50 EMA breakthrough signals strong bullish sentiment, as ADA's price climbs to test newer highs, which is a promising sign for investors seeking growth opportunities.\n\nThe current support level for ADA is established at around $0.50, which recently acted as a strong bounce point for the price. This level will be crucial for Cardano to maintain its bullish stance. Should the price remain above this support, it could pave the way for ADA to target the next resistance level at approximately $0.60.\n\nIf ADA continues its upward momentum and consistently closes above the 50 EMA, we could witness a further increase in buying pressure. This could lead to a new resistance test and potentially bring ADA to higher price points, eyeing the significant $0.65 mark as the next major target for bulls.\n\nConversely, should Cardano's price fall back below the 50 EMA, it may enter a consolidation phase or even a retracement. In this price drop scenario, the asset would likely find its first technical and psychological support level at $0.50. A breach below this could trigger sell-offs, leading to a retest of lower support levels, possibly around $0.48.\n\nAdvertisement\n\nEthereum's surprising return\n\nEthereum has achieved a new high in its valuation. The digital currency has seen its value surge, crossing a critical threshold that could indicate further upward momentum.\n\nEthereum's recent breakthrough above the $2,600 mark signals a robust upward trend. This level previously served as a significant resistance, capping the asset's price during the previous cycle. With this level now surpassed, it sets a new local high for the asset, suggesting that the price may continue to rise as market confidence grows.\n\nThe support level for Ethereum is currently at around $2,500, which aligns with the moving averages that have historically acted as dynamic support during retracements. A sustained position above this level could reinforce the bullish sentiment and support the thesis of continued growth.\n\nOn the growth front, the continued rally could be fueled by the increased adoption and utility of ERC404 tokens, which combine the liquidity of ERC20 tokens with the uniqueness of ERC721 tokens. The high network fees on Ethereum also point to significant network utilization, hinting at robust on-chain activity that could support the asset's price.\n\nHowever, should a price drop scenario occur, a retest of the $2,500 support level is likely. If this support fails to hold, Ethereum could face a sharper decline toward the next significant support area, potentially around the $2,400 level, as traders may start to take profits, and momentum could slow down.\n\nSolana weaker than expected\n\nSolana is currently at a crucial juncture, testing the upper bounds of its established price channel. The asset has shown resilience and consistent performance over the past few weeks, leading to a critical moment that may define its trajectory in the short to medium term.\n\nSolana is trading around the $113.8 mark, approaching the upper resistance line of its price channel, which is approximately at the $115-$117 zone. This resistance level is particularly significant as it has previously acted as a strong point of rejection, prompting price pullbacks.\n\nOn the support side, Solana finds its immediate cushion around the $100 mark, which aligns with the 50-day EMA. This level has historically provided a bounce back zone for the price, indicating strong buying interest.\n\nShould Solana successfully break through the upper resistance level of the channel, the next probable target for growth is the $125-$130 range. This would establish a new higher high, potentially inviting more investors to the market and possibly initiating a new rally."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBDNFlWR1NORklKbTdMUU5VYnNEN3F2cXA1RGRSLXc2NzhtaXZnMDkwdVh1aGtVMXlOaGZybjZDdW1KdXgzUUlHSXE5d1o5MjhvREF3am8ySWFSOFUtT0k3dHNrRTNPQXFLUkVjVjl0R2pBZ9IBd0FVX3lxTE15dW5BZXhnZll5REI3a0JCd0xIWURieDkzck41aG1PY2xnY1Vkb0U0OWJTMlQ5ZDVrVDVNcmVhbjgzMkxlMS1jRklnbmo2dmJ6MUpudlI2RkhfNlhYOC1xMjVXYzdQMEc3di1fSjQ3UVhSMk9nQ1gw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Why is the Ethereum (ETH) Price Up Today? - CryptoPotato",
        "content": "ETH seems unstoppable. However, it had a helping hand from Bitcoin. In the following, we take a look at a few technical indicators that might provide some insights into why the Ethereum price is up today.\n\nKey Support levels: $2,500\n\nKey Resistance levels: $3,000\n\n1. Buyer Took Control of the Price\n\nEthereum is up in double digits this week and appears to be just heating up. Buyers are coming in strong, and they have already taken the price above $2,700 at the time of this post. The breakout at $2,500 started this rally and coincided with Bitcoin breaking above $50K.\n\n2. The Most Important Target Right Now\n\nEthereum’s biggest target is $3,000 if this rally continues. This is a key psychological level that may awaken sellers once hit. Until now, sellers have been absent and unable to stop this buy momentum.\n\n3. Bitcoin Leads the Charge, Ethereum Follows\n\nThis rally is being driven by Bitcoin’s spectacular performance in the past three days. Ethereum was quick to follow and managed to keep the same pace. This is a welcomed development as it brings enthusiasm across the whole spectrum of the market.\n\nMoreover, the recent bullish cross on the 3-day MACD confirms that ETH buyers may only be starting to show their strength, as shown below."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE4zeFVubGc1My16cGxGWUVvMG81SWRiMHBqN2ZjQ0NycE1qdUp3QUgwLWpHd3JWVmw2cFc5RkFsTjk1Q0F1NjF1QW1DNnUyYVJLeGotNGUwMWo1c1JhQkVodkdfUHY0NFV1QUdWQ3draFZFNkU1MTBYTjRJRHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "3 Cryptos to Buy Before Bitcoin’s Next Major Move - Yahoo Finance",
        "content": "Bitcoin has been on fire lately! After a relatively quiet 2023, the king of crypto has awoken from its slumber over the past week. Bitcoin (BTC-USD) has gained over 13% in the last week alone, barreling over the key psychological $50,000 per token resistance level.\n\nThis recent surge signals that we may officially be entering a new crypto bull market. The last major Bitcoin bull run started in late 2020 after Bitcoin undertook its quadrennial halving event. Prices skyrocketed until a blow-off top in November 2021.\n\nThis time, the spark likely has more to do with an influx of institutional cash rather than the token’s upcoming halving. With 11 spot Bitcoin ETFs approved last month, billions in fresh capital is entering the crypto sector. Add on the fact that the next halving is likely happening in April 2024, and the stage seems set for even more fabulous fireworks this cycle.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhen Bitcoin starts pumping, history shows many altcoins follow suit in a big way. Here are three to consider before they do.\n\nEthereum (ETH-USD)\n\nA stack of ethereum coins\n\nSource: shutterstock\n\nAs the second largest cryptocurrency behind Bitcoin, Ethereum (ETH-USD) has cemented itself as the most correlated altcoin when compared to this crypto benchmark. When Bitcoin pumps, Ethereum almost always follows suit. Historically, Ethereum tends to see amplified gains relative to Bitcoin, delivering even higher returns for investors.\n\nI believe Ethereum is poised to outperform Bitcoin in the next major crypto bull market rally. It still has a smaller market capitalization than Bitcoin, giving it much more upside potential in terms of its valuation multiple. Additionally, Ethereum has recently become deflationary due to its proof-of-stake consensus mechanism and token burning. The token’s current annualized deflation rate sits around 2%, meaning existing Ethereum tokens become more scarce over time.\n\nBut what truly gives Ethereum an edge over Bitcoin as an investment is its role as the dominant smart contract-enabled blockchain network. Ethereum is the foundation for most decentralized applications and Web 3.0 use cases, from NFTs to DeFi. It is spearheading innovation in the blockchain space, while Bitcoin remains primarily a store of value commodity.\n\nFor these reasons, Ethereum has beaten Bitcoin’s performance in every bull market cycle. I expect this trend to continue in the next bull market, as more developers build on Ethereum and more investors recognize its network effects over other chains. The stars are aligning for potentially parabolic gains for Ethereum if Bitcoin’s momentum continues.\n\nStory continues\n\nKaspa (KAS-USD)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nKaspa (KAS-USD) has seen tremendous growth over the last year to cement itself as a promising medium-sized layer-1 blockchain. With a market capitalization now above $3.1 billion at the time of writing, Kaspa is catching the eye of both developers and investors.\n\nAs I’ve discussed previously, Kaspa distinguishes itself through its unique DAG-based architecture called GHOSTDAG. By generalizing the blockchain into a directed acyclic graph structure, Kaspa is able to achieve significant scalability improvements in both transaction throughput and processing speed.\n\nThe protocol handles security and ledger ordering by distinguishing “blue blocks” created by honest actors from potentially malicious “red blocks.” The largest strongly connected cluster within the acyclic graph identifies trustworthy blocks to favor. This prevents attacks like double spends or transaction rollbacks. I think Kaspa has the potential to reach a market cap of over $10 billion if the project’s tech becomes more time-tested.\n\nPolygon (MATIC-USD)\n\nA phone, on top of a laptop keyboard, displaying the logo for Polygon. Polygon Price Predictions\n\nSource: sdx15 / Shutterstock.com\n\nPolygon (MATIC-USD) seems primed to ride any Ethereum bull run as a leading Ethereum scaling solution. Originally launching as a sidechain, Polygon has rapidly expanded its capabilities to become a versatile layer-2 network. Its core advantage lies in significantly improving Ethereum’s transaction speeds and reducing gas costs on the Ethereum network.\n\nPolygon now has two main components – Polygon PoS and Polygon zkEVM. Polygon PoS offers compatibility with Ethereum smart contracts by functioning as a sidechain alternative. Polygon zkEVM replicates the Ethereum virtual machine environment with zero-knowledge proof cryptography to enable private transactions.\n\nThis multi-faceted approach aims to maintain Ethereum’s censorship resistance and security guarantees while drastically increasing scalability. Polygon essentially tries to offer developers the best of both worlds – Ethereum-equivalent functionality with faster and cheaper transactions.\n\nNotably, Polygon’s roadmap indicates even bigger ambitions, including upgrading Polygon PoS to a zkEVM chain and launching new standalone chains. With abundant room for growth in both its network infrastructure and token price, Polygon could be one of the top performers if the crypto bull market returns in a big way.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Cryptos to Buy Before Bitcoin’s Next Major Move appeared first on InvestorPlace."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPQUVqejdreVRJbVlVQXBiY1NpTmJTR0NlalNYWmpEblRPdHI2dkRsa0dybXlmRDFjeXR1c1JHYjY2WldiN2tYVzdiR1lJX1cwRHJIVkNMd2JjdlFNd3R4Vk9mWl8ya1JVR3JiYVV5LWUxcTZBTDZqRGQ4UlpqS3NMNzB0elJOelZyRmZ5S2p6WTRVeG5LdWJHV0ltWjlwWHB3ZkJVYkNaNGNIOGJ0eHFrQmVuSFIydjFUelVaaWJRZXJCOFRkYklTUklQNEwyamtsZ0k5VkpPYk0wTW9DZTE5cDVrM1lPNjZJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Surge Despite Hotter-Than-Expected US Inflation; Biden Vs. Trump: New Poll Finds One Candidate Nearly Closes Gap In Tight Race, Stands To Gain More If This Happens- Top Headlines Today While US Was Sleeping - Benzinga",
        "content": "Bitcoin, Ethereum, Dogecoin Surge Despite Hotter-Than-Expected US Inflation; Biden Vs. Trump: New Poll Finds One Candidate Nearly Closes Gap In Tight Race, Stands To Gain More If This Happens- Top Headlines Today While US Was Sleeping"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOQllVZWhrQ1NxellJRnNiNmhqQl9RTlRFUjVqYUQ4VkNuT0dzSEU2UTF3UlE5UHdTRnpXQzE0MElXXzRsTVdQWWk2UFdKa0NUMFpIRS0weFVWZEdUblpNNEdnTklQSWQ5VFlLVTlkM2k4aHItVmFiV1ZlLVB1RC1sZEk3TUZKNVo5QmtNaGNMOEFYTFZUbi1DZjBsUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "The price of Solana grows more than Bitcoin and Ethereum - The Cryptonomist",
        "content": "Recently, the price of Bitcoin has risen significantly, breaking through the historical $50,000 mark, with Ethereum closely following. However, Solana has gained even more in percentage terms.\n\nCrypto markets tend to move in a coordinated manner, albeit accidentally, but with some variations. Sometimes these variations are dramatic, while other times they are just movements of different magnitude, but in the same direction.\n\nThe price performance of Bitcoin, Ethereum, and Solana\n\nIf we exclude stablecoins, BTC, ETH, and SOL are the three largest cryptocurrencies in the world by market capitalization.\n\nThe Bitcoin price has gained 4% in the last day, and 16% in the last seven days.\n\nThe ETH (Ethereum) price is up +7% compared to yesterday, but up +14% compared to seven days ago.\n\nSOL from Solana is instead showing a great +8% compared to yesterday accompanied by a +20% compared to seven days ago.\n\nThe fourth cryptocurrency in the world by market capitalization excluding stablecoins, namely BNB, is only showing a +2% increase compared to yesterday and a +7% increase compared to a week ago.\n\nTo find performances similar to SOL, you have to go down to the ninth position (AVAX by Avalanche), while for higher performances you have to go down to the 22nd position of IMX (Immutable).\n\nHowever, if we compare the performance during 2024, from January 1st until today, SOL stands at +11%, while BTC is at +18% and ETH at +17%.\n\nSo the real boom in this 20245 is being done by Bitcoin and Ethereum, among the main cryptocurrencies, while Solana is doing it especially in the last week.\n\nThe growth of SOL\n\nIn reality, the price growth of Solana started much earlier.\n\nUntil mid-October 2023, it was not exceeding $25.\n\nIn late October, it had already risen above $30, and during the month of November, it had doubled, reaching over $60.\n\nHowever, its rise continued even in December, first reaching above $70 and then making an even bigger leap to over $120 at the end of December. This last jump recorded a sensational +120% in just over a month.\n\nIn other words, from mid-October to the end of December, it recorded an incredible +450% in less than two and a half months.\n\nIn addition, since the failure of FTX in November 2022, it had never risen above $30 until October 2023, and since the implosion of Terra/Luna in May 2022, it had never risen above $80 until December.\n\nHowever, it must be said that during 2024 it has not yet risen above $120, so its performance in the beginning of this new year is not at all remarkable.\n\nThe reason why it has recently risen a lot is that at the end of January it had dropped well below $90, so the recent increase is actually a rebound after a strong 30% correction.\n\nThe growth of the price of Bitcoin and Ethereum compared to Solana\n\nA different story can be told for BTC and ETH, because in 2024 they have already reached price peaks higher than those of 2023.\n\nBitcoin at the end of 2023 had gone from $27,000 in mid-October to $43,000 at the end of the year, with a +60% increase in two and a half months.\n\nIn the course of 2024, it had already made a brief jump to $49,000 on the day of the launch on the markets of the new ETFs, but only to then drop below $39,000. So the $50,000 reached yesterday is the new all-time high post-bubble, and the growth of the last seven days has not only been a rebound.\n\nEthereum, on the other hand, had gone from $1,600 in mid-October to $2,300 at the end of 2023, with a gain of 45% in two and a half months.\n\nIn January, it briefly rose to almost $2,700, only to then drop to $2,200. Yesterday’s return near $2,700 is a middle ground between Solana’s rebound and Bitcoin’s new annual record.\n\nThe price of ETH is currently still only at the levels of early May 2022, which is well below the almost $4,900 of November 2021.\n\nSo in the long run, Bitcoin’s performance remains the best among the three, compared to the levels of 2021, while Solana’s performance remains particularly the best in 2023.\n\nLow interest from retailers\n\nOne really interesting thing is that there doesn’t seem to be any FOMO going on.\n\nIn fact, the interest of investors and retail speculators is still quite low, despite BTC only returning to -27% from its all-time highs.\n\nBitcoin hit $50k.\n\n\n\nMeanwhile, Google search volumes relative to price are at all time lows.\n\n\n\nThis is a new era. pic.twitter.com/8DnsadIclt — Yassine Elmandjra (@yassineARK) February 12, 2024\n\nThis is probably due to the decreasing interest that retailers have in Bitcoin, as many of them are mainly looking for the big hit with stellar profit percentages that BTC probably can no longer guarantee.\n\nIf true FOMO were to arrive, perhaps brought by some memecoin or shitcoin in a rapid and astonishing rise, the crypto markets could react with further increases, even on Bitcoin and Ethereum.\n\nCertainly what is happening in these weeks in the crypto markets is not yet able to bring real FOMO, because for many retail investors a +16% in seven days is not attractive enough.\n\nThe real madness, which has already been observed several times in the crypto markets, could only come in the face of performances like Solana’s at the end of 2023, namely with a +100% in a few weeks.\n\nNeither Bitcoin nor Ethereum seem to be able to do similar things anymore, at this time, and Solana has already done them by the end of 2023.\n\nThe memecoins and shitcoins, on the other hand, are able to do even better, although large pumps almost always lead to large dumps."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPM0VYUE15Nnd5QkxPeDMxZnlCaDdrNXFseFBZU2xfeW5sdnpvVHVXeXdBSThIbDJMMFJTV09nMnhLWnJtSmNQalRHcjVvcU9UU2dKRE5wX2xIeEZSSlBYbDgzQm4zZXJOT0N3OWd3dDNwd2ZkYzVLclF2Mnowem9ZVE5fc0RyZ1ZsWnV0eWxBWi15b3dJX2ZVdHJ0bl9yRDh2VnpMNlZ0U0hhMVRHdXFrdkFralJkUTNk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "AI project 1) Forecasting Ethereum prices; Time vectors & Transformers - DataDrivenInvestor",
        "content": "AI project 1) Forecasting Ethereum prices; Time vectors & Transformers Caspar Bannink · Follow Published in DataDrivenInvestor · 18 min read · Feb 13, 2024 -- Share\n\nImage 1) Credits to author (AI assisted)\n\nThis project is only an experiment and should only be used for experimental purposes. Applying this model in real scenarios will result in losses.\n\nThe code can be found on Google Colab and Github, the links are at the end of the article.\n\nIntroduction\n\nIn recent years, the transformer architecture has catapulted the field of AI into the mainstream narrative. The transformer showed incredible potential in the field of NLP, however, it proved very useful in other fields as well, outperforming many state-of-the-art models. For example, Alexey Dosovitskiy et al., (2021) showed a vision transformer outperformed convolutional networks in image recognition tasks. Furthermore, the power of transformers was again proven in the field of time-series forecasting. Neo Wu et al., (2020) compared a transformer-based model to the current best models for sequence-to-sequence time series forecasting; LSTM & RNN-attention models. The transformer-based model outperformed the other models by a considerable margin.\n\nHowever, the application of transformers in time-series forecasting was definitively proven in 2023. Azul Garza and Max Mergenthaler-Canseco published their paper: TimeGPT-1. As the name already betrays, TimeGPT-1 is a foundational transformer-based model for time-series…"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQUTVOOEwyLUpBSFRNSTFPT0xtQXFoT3ZMaHJ4dm5LSTh4RGVzRjN0eDdxNXJjZFdCSVJlcXhEZ01aQXh6Z3p3VHgtNU5mcU1tUjVTWHptS0NYV2dtTGNZYlNGNlU1eXNQSDlnTHJhcHNWRUh5Yy1pUEVFdGNCZGNuTEY1UnBVYjdy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Gas Fees : Did Someone Pay Transaction Fee of 42 $ETH? - CoinGape",
        "content": "After the Ethereum merge, the investors hoped for reduced gas fees on the Ethereum network. Instead, many users had to make transactions with hefty transaction fees. Starting with today’s example(13 February), a single transaction on the network was charged 42.88 ETH gas fees, worth around $113531.\n\nadvertisement\n\nEthereum gas fee concerns are getting out of hand, where this time, a user had to spend 42 ETH to transfer 10 ETH. People are questioning the sense of such a transaction where the fee is four times the transaction itself.\n\nIt hasn’t happened for the first time, as many similar past events are also in the records. Last year, an investor paid 64 ETH ($118,600) for a single transaction.\n\nAfter the merge, we didn’t see many unreasonably high gas fees, but even the few examples were a lot to handle because of the hefty amount people had to pay.\n\nEthereum was known to be the future of transactions, but events like this are pushing people to more layer 2 solutions like Polygon and Arbitarum. Because of this, more and more people are shifting towards these solutions that charge just a fraction of the original chain but deliver the same amount of security.\n\nWhy A Network Charge Transaction Fee?\n\nAlmost every blockchain requires transaction fees to complete any transaction on their network. Those fees vary depending on the blockchain. Among these blockchains, Ethereum is known for its security but also a high gas fee application. There are four scenarios where you will have to pay a gas fee for Ethereum: –\n\nWhile Making a Transaction (Sending Ethereum) During Minting NFT’s Utilizing Ethereum-based Smart Contracts Creating Dapps\n\nThe gas fees can vary depending on your purpose of use and supply and demand on the platform. During the 2017-18 bull run, the average recorded gas fee was in-between $5-6. We only saw it moving up from there, increased Ethereum prices and network congestion take the blame for that.\n\nIs Ethereum Cancun-Deneb (Dencun) a Solution For Gas Fees?\n\nDencum is yet another highly anticipated upgrade for Ethereum that will happen in the first quarter of 2024. This upgrade promises to work on major ongoing issues of Ethereum, including scalability, security, and efficiency. This upgrade will introduce nine EIPs ( Ethereum improvement proposals), including implementing the EIP-4844. EIP-4844 is supposed to reduce the gas fees on the platform by introducing new blob-carrying transactions. For now, we can understand that these blob-carrying transactions will cost less because of the large blob sizes. Overall, we will get some relief from the high gas fees. After the successful implication of this upgrade, we will have to see whether they work for real to improve the shortcomings of the network or not.\n\nConclusion\n\nEthereum’s gas fee is necessary for the proper functioning of the platform. The complex transactions require more gas fees compared to the easier ones. Yet, sometimes, the charged fees are not worth the value of the transaction. The solution for such a situation isn’t that close, so the people can opt for the other layer2 options to transact after carefully analyzing the timing of transactions."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPaW1PZmZfMEZtUU8xTnFkU3NFZlVfVFZlWW5lUkRndFB0cXlvZXYwM1IzNHk1SnV4YXRjSmtpbWJ3RmhXcnQwQXBOdWVnUUV0Q21xMlU2VXZLbVN6ZWxydi1IQ0hBZmdaSVRPckdIUFZ5b3g3b0R5NHg5ejdtY3NfUEVqZHhnV2RuMTFFZHl3aW5VeFBTcjd1TDJLU0tlWjR2TkRuMDlCZlRRVGhFYUhOeHJEdGxmRXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Keone Hon of Monad: 10,000 TPS & Full EVM Equivalence - A New Era for Ethereum Apps - Delphi Digital",
        "content": "In this episode, Keone Hon dives deep on Monad, a high-performance Ethereum-compatible layer 1 blockchain focused on delivering high performance and drastically lower transaction costs.\n\nWe discuss Monad’s key technical innovations like MonadBFT consensus, parallel execution, and a custom database enabling 10,000+ TPS. Keone explains how these breakthroughs allow complex 100K gas transactions costing just a fraction of a cent, 100x cheaper than even leading Layer 2s.\n\nWe also explore how Monad achieves this while maintaining decentralization and a rich developer experience via full EVM equivalence. Tune in to learn why Monad could be a game changer for builders and users looking maximize performance and minimize costs.\n\nKey Links\n\nSocials"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQRzdnalA4WDhGNXFyd3pXcHNvbHpER2ZWckpMTGsycFhWbldsT21TUGp1cHI4UkpJems1NGNlckhralQ5SVFYMWxScl9aalBJUW1SN05hZnYxcGxqckhqWGI4blJGX2FnZFE4Z2pocUczbTJOY2h4OWhVV0lNR2NGc0NZYmRzUFdRZkRhbHFkTWxJSmN1c1hrTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Starknet Token Airdrop Set for Feb. 20 Launch - Crypto Times",
        "content": "Ethereum layer-2 scaling solution Starknet has announced its much-anticipated STRK token airdrop will officially start on February 20. The token distribution aims to decentralize the network and empower community governance.\n\nThe Starknet Foundation plans to airdrop 728 million STRK tokens to over 1.3 million eligible Ethereum wallets that interact. They will have until June 20 to claim the tokens.\n\nThe Starknet Provisions Program is designed for a broad distribution of STRK to those who’ve substantially contributed to Starknet.\n\n\n\nHere are a few relevant details:\n\n\n\n✨1.3 million addresses.\n\n\n\n✨50% of the token distributed to Starknet users.\n\n\n\n✨Ethereum stakers until the Merge,… pic.twitter.com/mANrSYHeG9 — Starknet 🦇🔊 (@Starknet) February 14, 2024\n\nStarknet leverages zero-knowledge (ZK) cryptography to enable fast and low-cost transactions while ensuring validity on the Ethereum mainnet. The network boasts Ethereum Virtual Machine compatibility, meaning dApps can deploy on Starknet using Cairo or Solidity code. Developers gain increased speed at lower costs.\n\nAs Starknet decentralizes with its token, the community can contribute more directly to governance decisions. Network participants also gain opportunities to help secure layer 2 through currently developing staking mechanisms.\n\nThe upcoming airdrop distribution aims to encourage broader engagement and kickstart a robust token economy. With Starknet processing over 50% of all layer-2 transactions, the launch of STRK may mark a significant milestone as ZK-rollups continue gaining market share.\n\nStarknet’s combination of scalability, security, and usability presents a promising layer-2 solution amidst Ethereum’s ongoing challenges with congestion and fees. The network hopes wider access to STRK will help further its capabilities and adoption."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNeF9LWVlUWDRpd0huNHRZeEdIUGE0czJ4bUNVeTlrVVRRNVpBY21GMDJBRU4tbDRqbFJSazdzVDBGYTRISlRZdThsTk9uRkRzRWE3ZHVMVHliNTEwT0VKc1Jpa0x3Ty1kbzAwUlV3MHhvNzhTTld3dkxyLUJuMnBrVU93aWpWQXNPV1dSZGxqWWVibXhIR0xXYzA1MUxHdVRQdmNYdmtCeF9Cbzc4SUlzd2h1RlMxcll6SUV1VnBYdmlUcFQyUnpwbll3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Peter Thiel: the former CEO of PayPal’s fund has invested $200 million in Bitcoin and Ethereum - The Cryptonomist",
        "content": "The Founder’s Fund, led by Peter Thiel, former CEO of PayPal, has invested a whopping $200 million in Bitcoin and Ethereum in 2023.\n\nPeter Thiel: The former CEO of PayPal’s fund has invested in Bitcoin and Ethereum in 2023\n\nLast year, Peter Thiel’s fund, former CEO of PayPal, invested a whopping 200 million dollars in Bitcoin and Ethereum.\n\nIt is revealed by Reuters, which claims that the venture capital company founded by billionaire Peter Thiel, Founders Fund, would have invested a substantial amount between summer and autumn 2023.\n\nA renewed interest from Silicon Valley in the crypto-market, therefore, with the investment taking place before the latest price surge of cryptocurrencies.\n\nThe Thiel fund has invested $200 million, half ($100 million) in BTC and the other half ($100 million) in ETH.\n\nThe present investment in crypto is not the first by Founders Fund. In fact, already in 2014, the fund would have started aggressively buying Bitcoin, but they were liquidated before the November 2022 crash, from which approximately $1.8 billion in profits were made.\n\nPeter Thiel: the former CEO of PayPal is once again profiting from investments in Bitcoin and Ethereum\n\nAt present, therefore, the former CEO of PayPal’s fund seems to still be profitable.\n\nAnd indeed, last summer, Founders Fund began buying Bitcoin when it was below $30,000. In the following months, additional BTC along with ETH were purchased.\n\nLooking at the charts both for BTC and ETH, the trend appears to be bullish for both.\n\nSpecifically, since the end of October 2023, BTC has started its bull run which has seen it surpass $50,000 just yesterday.\n\nAs for Ethereum (ETH), on the other hand, the bull run started in mid-November, with the price going from $1900 to over $2600 today. Last summer, the price of ETH remained below $2000.\n\nInvestments in the crypto sector\n\nPeter Thiel seems to be a major investor in crypto projects. In April 2022, during the crypto winter, the Founders Fund together with Pantera Capital, led a $20 million Series A funding round for Ondo Finance.\n\nActually, Ondo Finance’s was the first time Peter Thiel’s fund led an investment in a token-based project.\n\nNot only that, in May 2021, Peter Thiel, through his Thiel Capital, would have invested to support the crypto-exchange Bullish, created by Block.One..\n\nThis involvement of the billionaire in the crypto world responds to Thiel’s own statements that, in February 2021, he explicitly expressed himself bullish on Bitcoin."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxORVlsZ2NFbkdXSDlYQmxiZG41WV90Z1JnZTluaUdzWWlRYTM3Y1cza01rZmx6TXBPUjlTekNnWFhHUzhib1lxc3J0bmlfUmhSSVVWTW5UdENRU0FOR2NsdHVzX0ZuZE92SHZMQVdrX05KVXZuWnNiTHBpSUFlMkthTXJsZE5vTjRDSURwT1c2dmk5OUFWM19ZQTJKNTlqZ0JGa21WR3IwMmR1SWt60gGyAUFVX3lxTE51VGV2bHdLaDJzQkxxeXV2MjVwWXptRzg3eEF3Z05ITXR1cFlzWVc2N19pRFJZd3cwaHFvTi1wcURwQkRaWmlBckxzRHpCU2NQQ3BDMkdybzVWNnFtUmhXQ1JqeGczRzVVZWEzbUJfbmZfTXl3S2FKbnh2enZhRjhpdUdIRGc2WDdkdllyWkczR3NHLTBCNlJqNkV3WmV6MWttV0JzRm5IR2VyX1RXNjNjZFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Peter Thiel-backed Founders Fund Invests A Massive $200 Million In Bitcoin and Ethereum - CoinGape",
        "content": "Institutional investments in Bitcoin (BTC) and Ethereum (ETH) have been soaring over the past few months! A recent Reuters report suggests that Peter Thiel-backed Founders Fund invested a hefty $200 million in these two cryptocurrencies in late summer 2023. Also, the fund has reportedly split its $200 million investment into equal amounts in BTC and ETH.\n\nFounders Fund Re-entry Into Bitcoin Market\n\nAs per sources familiar with the matter, the Founders Fund started acquiring Bitcoins last summer when it was trading under $30,000. However, this was not the first time that the fund was making a bet on the largest cryptocurrency.\n\nadvertisement\n\nFounders Fund, a notable institutional investor in the crypto space, embarked on an aggressive acquisition of Bitcoin as early as 2014. However, the firm opted to liquidate its holdings prior to the 2022 crypto market crash, resulting in approximately $1.8 billion in returns, reports Reuters.\n\nThis previously undisclosed action by the esteemed Silicon Valley venture capital firm highlights a resurgence in token investments among institutional investors. Many funds that sought an exit after the crypto market crash of 2022, are now making fresh entries.\n\nIn 2022, the price of Bitcoin plummeted to nearly $15,000, marking its lowest value since 2020. Despite this setback, both Bitcoin and Ether prices have steadily rebounded over the past year, culminating in Bitcoin surpassing the $50,000 milestone for the first time in over two years. However, it still trades under the all-time high levels of $69,000, back in 2021.\n\nPeter Thiel And Crypto\n\nPayPal co-founder Peter Thiel has publicly expressed admiration for Bitcoin, lauding it as a store of value akin to gold and a safeguard against the policies of central banks. Bitcoin’s foundation on blockchain technology, operating independently of traditional financial institutions, resonates with Thiel’s interests in libertarianism, limited government, and technological progress.\n\nThis affinity for cryptocurrency dovetails with Thiel’s broader investment philosophy. Founders Fund, renowned for its early support of companies like SpaceX and Meta, now manages assets exceeding $12 billion. In a strategic move reflecting the growing importance of crypto assets, the fund welcomed Joey Krug as a partner in April 2023, specifically tasked with overseeing crypto investments.\n\nNow with the arrival of spot Bitcoin ETFs last month, the institutional inflows into Bitcoin have surged significantly. A spot Ethereum ETF is also likely to arrive by May 2023 which could lead to more institutional participation going ahead.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQcThsUTJ5Zmd3ZzExcUVJaGdlTGJVZWRPWGd3ZFJ5UVJScUJiQzgyVTQtSkJCSnlWckpDdXI1czRTU1NZdmNiNVZPc09wMEswcVJOOHhVY3REbE9zUk1fZmFPazZzUzJ2M0h6Ml9MeFltbVdlNTJtRldNX3VLQllQNkxnbVpVbkVsU3FQVlRLTnJhRExNWmljag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton Eyes Ethereum ETF, Pushing Crypto Mainstream - PlayToEarn",
        "content": "Franklin Templeton, with an impressive $1.4 trillion in AUM, has officially filed a proposal with the Securities and Exchange Commission (SEC) to launch an Ethereum ETF.\n\nNamed the \"Franklin Ethereum Trust,\" this ETF aims to provide investors with direct exposure to Ethereum. The fund plans to engage in staking, a process where digital assets are \"locked up\" to support the operation of a blockchain network, in exchange for token rewards. This move introduces a tradFi giant into a practice that has sparked debate among regulators and major financial players. Staking has come under fire due to the SEC's proceedings against crypto firms like Coinbase, which were penalized for marketing what it deemed unregistered securities through staking services.\n\nThis application follows the SEC's decision in January to approve 11 spot Bitcoin (BTC) ETFs. After years of reluctance and rejection, this breakthrough allows these investment vehicles to begin trading on stock exchanges. Such ETFs have opened the doors for regular investors to gain exposure to crypto without having to own or manage them directly. Franklin Templeton had previously secured approval for its Franklin Bitcoin ETF, marking its first step into the crypto ETF space.\n\nThe race to launch a spot ETH ETF is heating up, with major players like BlackRock, Grayscale, and VanEck also throwing their hats into the ring. The approval of spot BTC ETFs has already led to billions of dollars flowing into these funds, driving up the price of the underlying token.\n\nPer a report published by Standard Chartered Bank, there is growing interest in ETH ETFs, with the SEC approval expected in May."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOOUhfcmhFWVdVUWFKdTBaSWk4dW5GLWlXOW5xTjBlWFNmdkhkMlZxNTNGdmJOUkc4NHpsaXZhakQ4c2J0UVJEQ1phTE5tVGlwYjZtR0wxc1dadjJsS3pydnhiYnVqZzFBNy01YkUwUVVDMlFCbW8wbHNsaXBSZ1pFbkpZZVZvOVJkbUFxWEJQYzBuQ29PT1BtQVFPZHJTY0h4WDJuX0JSVVViUHktQzNoWElMSjFtN3dWaFlLNtIBwwFBVV95cUxQQmhxNlR2LV9DdTdTS2V2eVQtSmhxRk5rLWlZWTU2OEpDSE43WEM0czNSMGk1d0s4N2NDOExTM2o1RHlJMjhtb1FMRUFITXVrOVM2cGZ0bFZlcWR6OURSdDNneElBTHVadk1GaTVJU0djcjh0TVBHUWE2N1JyaUdZUGltM0hSSmQ4MUdwQUVybXZoZEN3RmZKV2s2Y0hFVnRCMHB6THgwenJKU0pXM2l1aGZ4bnRManV3Q1hHVXcwLVhoNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton files for spot Ethereum ETF - The Financial Express",
        "content": "Franklin Templeton on Monday disclosed that it had officially filed for a spot ethereum exchange-traded fund, becoming the eighth player vying to introduce a similar product in the market. In January, the U.S. Securities and Exchange Commission (SEC) approved 11 spot bitcoin ETFs in a watershed moment for the crypto industry, which had been demanding regulatory approval for those products for more than a decade.\n\nA spot crypto ETF tracks the market price of the underlying digital asset, giving investors exposure to the token without having to buy it. With Franklin’s registration, there are now eight ETF providers competing to introduce spot ether ETFs, all of whom rolled out spot bitcoin products in January. While the two biggest new entrants in the spot bitcoin ETF race, BlackRock and Fidelity, now have assets of $4.18 billion and $3.49 billion respectively, Franklin Templeton hovers near the bottom of the league table.\n\nAccording to data from BitMEX Research, assets in the Franklin Bitcoin ETF totaled only $77 million. Seven out of the nine newly launched spot bitcoin ETFs now boast assets north of $100 million. The veteran asset management firm founded in 1947 is not throwing in the towel just yet and is spending to market the spot bitcoin ETF in Google ads. Last month, U.S. SEC delayed its decision on an application by crypto asset manager Grayscale Investments to convert its ethereum trust product into a spot ETF. BlackRock’s application at launching a similar product was also delayed by the market regulator.\n\nAlso Read SpiceJet shares zooms over 6% as board approves QIP allotment of 48.7 crore shares at Rs 61.60 per share EPFO: You can make a guaranteed tax-free corpus of Rs 3.3 crore in 30 years with Voluntary Provident Fund – Check calculations How 5th, 6th, and 7th Pay Commissions changed govt employees’ salaries | Projected pay revision by 8th Pay commission Omaxe Group to invest Rs 2500 cr in India’s first 5-in-1 sports-cum-retail project in Delhi, eyes Rs 4200-cr topline\n\nVanEck was the first to file for a spot ethereum ETF, which the SEC must either approve or deny by May 23. Coinbase Custody, a unit of crypto exchange Coinbase (COIN.O), will hold the proposed ETF’s ether in custody. The company is also the proposed custodian of BlackRock’s ethereum ETF.\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPMFRjVUZqOFBpYzBQQUFNZEpOclRJc1M1QkdJbU5POW9LYWdieVVfX04yenRwd0dSbmVmaVlDUk02am5DY2E4Ymprd1otSVFlTUJERFhNN0VrMmpKTjM4MkpybU5wdUV3VHpJQXh2SXcwUFBkQVdzY2lYZzN5YUZtRG1xX2d1bEFHUFpQMzkyVW9sYnFmZEtEMFNCV1NMS2t0WGJvaHFvb9IBpwFBVV95cUxPMFRjVUZqOFBpYzBQQUFNZEpOclRJc1M1QkdJbU5POW9LYWdieVVfX04yenRwd0dSbmVmaVlDUk02am5DY2E4Ymprd1otSVFlTUJERFhNN0VrMmpKTjM4MkpybU5wdUV3VHpJQXh2SXcwUFBkQVdzY2lYZzN5YUZtRG1xX2d1bEFHUFpQMzkyVW9sYnFmZEtEMFNCV1NMS2t0WGJvaHFvbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "How to Buy Smog ($SMOG) – Solana & Ethereum Meme Coin with 100x Potential - - Disrupt Africa",
        "content": "Smog, a new Solana meme coin prioritising fairness and community, offers a fair launch and large airdrops. It strategically expands by launching on Ethereum via Wormhole, aiming for 100x growth with staking rewards and an ambitious roadmap targeting mass adoption.\n\nSmog, a rising meme coin on Solana, aims to prioritise fairness and community engagement. Its fair launch model removes presales, ensuring everyone has a shot at acquiring $SMOG tokens.\n\nSmog also embraces a community-centric approach, allocating a large portion of tokens to airdrops and rewards, as evidenced by its impressive airdrop participation.\n\nFurthermore, Smog strategically positions itself to capitalise on the meme coin trend. It launched on Solana’s efficient blockchain and further expanded its reach by entering the Ethereum ecosystem via Wormhole, tapping into its vast user base and liquidity.\n\nBy avoiding presales and focusing on airdrops, Smog fosters a strong community foundation, aiming to attract over 10,000 “Loyal Chosen” holders for long-term sustainability.\n\nBelow is a detailed guide explaining how to buy Smog:\n\nStep 1: Setting Up Your Wallet\n\nFirstly, ensure you have a digital wallet compatible with Solana. Popular options include Phantom and Trust Wallet, which offer both mobile apps and browser extensions for convenient access. Additionally, for Ethereum users, MetaMask serves as a compatible wallet to purchase $SMOG, along with ETH or USDT.\n\nStep 2: Purchasing Crypto\n\nTo acquire Smog tokens ($SMOG), you’ll need cryptocurrencies like ETH, SOL, USDT, USDC, or BONK. These can be obtained from major exchanges and then transferred to your wallet. Alternatively, some wallets offer the option to purchase these cryptocurrencies directly through third-party providers, though be cautious of associated fees.\n\nStep 3: Connecting Your Wallet\n\nVisit Smog’s official website and locate the “BUY SMOG” button on the buying widget or the top right corner of the homepage. Clicking this button will redirect you to Birdeye, a trusted crypto data aggregation platform. Here, you’ll find a Jupiter-powered widget enabling you to swap your selected cryptocurrency for Smog tokens. Simply click on the widget’s ‘Connect Wallet’ button and choose the wallet set up in the previous steps.\n\nUsers can also go to Jupiter decks and connect a Phantom wallet or other Solana-compatible wallets.\n\nStep 4: Buying and Holding $SMOG\n\nOnce your wallet is connected and you possess the required cryptocurrencies (SOL, USDT, BONK, etc.), you can exchange them for Smog tokens. The system will automatically track your airdrop points, contributing to your rewards as $SMOG launches on the Solana network.\n\nStep 5: Signing Up for the Airdrop\n\nFor additional engagement and rewards, consider signing up for the $SMOG airdrop on Zealy.io. Completing various community tasks earns you points, which will be tallied and updated a few weeks post-launch, enhancing your airdrop rewards and involvement within the Smog community.\n\nWhat is Smog?\n\nSmog is a trending meme crypto on the Solana blockchain that follows the footsteps of predecessors like Bonk, Myro and Dogwifhat, which have seen massive success in recent months.\n\nThe launch of Smog Token was nothing short of spectacular, propelling its market capitalisation to a staggering $37 million within the opening phase and driving a price increase of +134%.\n\nThis success was fuelled by the response to the SMOG airdrop campaign, which saw over 10,000 tasks completed.\n\nBUY $SMOG NOW WITH ETH, SOL, USDT, USDC, or BONK\n\nThe Smog development team continues to make waves with exciting multi-chain developments. The latest announcement was the $SMOG token launch on Ethereum, leveraging Wormhole and PortalBridge.com to facilitate cross-chain compatibility. This move aims to broaden Smog’s reach and accessibility, tapping into Ethereum’s ecosystem with over $1 billion in total value locked (TVL).\n\nThe multi-chain bridge will introduce a SMOG ETH LP, making it easier for new users to acquire $SMOG tokens and further driving price growth. Additionally, a new $SMOG staking platform is set to launch, offering attractive fixed APY yields of up to 42.0% to incentivise token holding.\n\nWith a base lock-up period of 3 months, both OTC and DEX-purchased SMOG tokens can be staked, providing users with additional rewards and reducing selling pressure.\n\nSmog Tokenomics\n\nSmog employs a strategic framework for dispersing $SMOG tokens, aiming to fulfil its objectives within the Solana ecosystem. This allocation of total supply serves to bolster the project’s expansion, foster community involvement, and enhance market liquidity.\n\nThe $SMOG token grants holders access to ‘The Dragon’s Court,’ a professional cryptocurrency community dedicated to unlocking endless ‘virality’.\n\nRoadmap\n\nSmog’s roadmap unfolds in three phases:\n\nPhase 1: Building the Base\n\nThis phase focuses on setting the stage with airdrop research, staking tools, token deployment, and engaging the community through dragon-themed challenges. This builds pre-launch interest and fosters early adopter unity.\n\nPhase 2: Fair Launch & Execution\n\nThe focus shifts to executing Smog’s game plan, including a fair launch guaranteeing equal access for all participants.\n\nPhase 3: Hypergrowth & Meme Coin Mastery\n\nThis ambitious phase aims for explosive growth with continuous airdrops, targeting over 100,000 token holders. Community engagement takes centre stage through “Social Mastery,” while Smog strives to become the reigning “Sol King of all meme coins.”\n\nWhy Buy $SMOG?\n\nSmog’s allure lies in its potential for explosive growth. As the crypto market recovers, many seek the next breakout star. Smog’s bold ambitions, riding the meme coin wave, could attract both individual and institutional investors.\n\nBUY AND STAKE $SMOG FOR 10% DISCOUNT\n\nMore than just a fun meme coin, Smog boasts strategic tokenomics and a community-driven approach. Its roadmap charts a clear course for development, prioritizing engagement, market reach, and long-term stability – a compelling package for potential investors.\n\nAccess the Smog community on X, Discord and Telegram to stay tuned with the latest project updates and news."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNOGZScjJIUmlJTTlQOW81UlE1Vy1LZ0I1SGJoMWNfZVRrX2ZIUDkxSmg1OFpLaVlJNVRzUDA0UVowOUxQa2prNFZjYkRGdTB0UlFQWWpDZ2p3UHRqZ3FFZHZZNjAtYjZIYnF5SXlfcXRZYmJTRXgyUUxxdDZ0UURGNUZBTTcxdWZiOGRTaDdsNVh2REFlQVRVclQ4TTFUMTJKVDZBRXhWV3FaOVHSAbABQVVfeXFMTzV1UmdqUHJ1MFZSZGFocHNhdTlSTGFXVnFFa2pwbExCZUxoLXJrdm5hSHBUMDN0YkY0SzU2OXlNeVQyQW9ZbS1YMV9HQlJrMWtuaWNaS2p4bkFkLTF1WjdTekFTejBEekp5VGMyVG9RejFWdHo4THJmSXBJVFU1WklVYVBJeWtnaDF4MFRSUTNESklzWlZYSGFicXFwclRwSmpIQlVFcU1uU2Y5SjY4dEY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "5 Layer 2 Crypto To Buy Now For 2024 Bull Run: Are Tech Savvy Investors Buying? - CoinGape",
        "content": "As the crypto market prepares for a potential bull run in 2024, investors are increasingly focusing on Layer 2 solutions. These solutions are celebrated for their scalability and efficiency, attracting significant attention.\n\nAmong the many options, 5 crypto to buy have emerged as the frontrunners: MATIC, OP, ARB, BROCK, and MNT. These tokens capture the market’s attention for their technological advancements and potential to redefine the blockchain landscape.\n\nadvertisement\n\n1. Polygon (MATIC)\n\nPolygon (MATIC) has emerged as a premier platform for Ethereum’s scalability and infrastructure development. MATIC boasted a significant uptick of over 9% in the past week at $0.8877. This rise comes amid a flurry of encouraging developments, captivating investors. The platform’s adoption of an enhanced Proof-of-Stake consensus has notably increased its security measures. Furthermore, deploying over 19,000 decentralized applications (DApps) on Polygon now directly competes with Ethereum’s ecosystem.\n\nThe platform maintains its appeal with transaction fees that are a mere fraction of those on Ethereum, averaging at just $0.001. While Ethereum continues its struggle to implement sharding for scalability, Polygon remains a sought-after destination for DeFi and Web3 initiatives. Despite this, Polygon remains committed to gradual enhancements even as the digital landscape sees the emergence of Web3 innovations.\n\n2. Optimism (OP)\n\nOptimism, operating as a Layer-Two blockchain over Ethereum, has witnessed a notable rise in its ecosystem and valuation. This growth is propelled by key upgrades and partnerships that bolster the network’s efficiency, attracting a growing number of developers. With an infusion of $300 million in cryptocurrency assets, Optimism is poised to redefine transactional efficiency while upholding Ethereum’s reputable security framework.\n\nMarket analysts are optimistic about Optimism’s future, forecasting short-term and long-term growth fueled by rising platform utilization and broader adoption. Despite facing market volatility, Optimism has showcased remarkable resilience, surpassing general market trends and highlighting its potential for delivering significant investor returns. Optimism is trading at $3.77. It has experienced a weekly increase exceeding 17%, marking it a prime investment opportunity in cryptocurrency.\n\n3. Arbitrum (ARB)\n\nArbitrum (ARB), a leading Ethereum layer-two (L2) scaling solution, leverages optimistic rollups to enhance Ethereum’s speed, scalability, and cost-effectiveness. This technology maintains Ethereum’s security and compatibility, with ARB’s price reaching $2.09 and a weekly increase of 13%, positioning it at 39th in the market with a capitalization of $2.65 billion.\n\nRecent data from DeFiLlama reveals a $2.89 billion increase in the Total Value Locked (TVL) on Arbitrum-based. This surge underscores a growing confidence in Arbitrum’s capabilities and an expanding market presence. Furthermore, with on-chain volumes hitting $920 million, Arbitrum has outperformed Solana-based applications, showcasing its robust activity and signaling a promising future amidst the crypto market’s recovery phase.\n\n4. Bitrock\n\nBitrock emerges as an innovative Ethereum sidechain, utilizing the IBFT 2.0 Proof of Authority (PoA) protocol to offer minimal gas fees. Its high-speed, secure infrastructure stands out and introduces a multichain (DEX) swap feature. This allows for directly trading cryptocurrencies on their native chains, eliminating the need for DEX-specific tokens or gas fees. Bitrock is currently priced at $0.124062, ranked 947th with a market cap of $11 million.\n\n5. Mantle (MNT)\n\nMantle quickly climbs the ranks among Ethereum’s Layer 2 networks, securing the fourth position in Total Value Locked (TVL) just two months post-launch. An attractive APY of 7.2% evidences this surge in investor interest. In addition, Mantle can handle up to 200 transactions per second due to its high-capacity processing prowess.\n\nThis performance positions Mantle as a formidable competitor within the Layer 2 ecosystem, challenging established networks with its efficiency and scalability. Mantle price is trading at $0.7152, with a surge of more than 20% in the past week, making it among the best crypto to buy today.\n\nBottomline\n\nIn conclusion, as the crypto landscape evolves, Polygon, Optimism, Arbitrum, Bitrock, and Mantle are marking their territories as pivotal players in Ethereum’s scaling and infrastructure development. These platforms and solutions highlight the dynamic nature of the crypto market, offering promising avenues for investors and developers alike.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQNDNQZXZidGJyaG1abktyalp4NWlZQy1sSVM1UnJIdUJkcXZha1BPQThoenliZ1RpMmxYVFJGdFNaRFNkai1qRlMwaWdUal9EZUlITUtDcV96VDVxOElaUDhNb3hOUWMzbXlUZTc0by1FUGdkTnBCRERMTW1iRlpVUElROVhaN0c5UlYxUjZEb2tZQmlPWGdIQmR5RmtWWS1QUVBveXF4NTd1MmYzeHJESGxQdFdKWHY2RHVlRDV6MTV0Tnh0blRrQ0hMRDVqdi04aVF4M19YSW5sOFdUT185TlYtZFpITjJfWGdNcnNIOFo4N2FvSzVj0gH8AUFVX3lxTFA2QWJIMW5PZmNjY3NXUGhMNnJ1aUtZV3FNMzFEb29FWUhNVGJuZy01bVQ0T1ZiVDRmRXgzd2dQNWxjdURFQVc0eFRiUDdLQUFSaHozbHVtcTRMM0R6WmM5NlZnd3haMVY2UGpESGxULU5BMlN2aXBZTnc3a05zLUhhd1dxRnZXOXVTUFY3Ym0zNWR6QnhLVGhrNng3M2g4YTdSWUVyU0YzY3NxZVVkQlRtamRCT0ZqR2hjS3BUVHRYTFBscUEtSWcyaHlxQWtIakp5R1lnazNjZGxWUmlyVXBjdEN5WVVqbWtsamE4QTJiRXg4czg4YjktTUNjdg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Crosses $50,000 For The First Time Since December 2021 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, climbed above the $50,000 mark early Tuesday, for the first time since December 2021, before climbing down to $49,750 at the time of writing. Several factors, including the likes of ETF inflows, upcoming Halving event, and a healthy US stock market, have led to BTC’s much-needed rally. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the greens across the board. The BEAM token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 13 percent. FLARE, on the other hand, became the biggest loser, with a 24-hour dip of over 2 percent.\n\nThe global crypto market cap stood at $1.87 trillion at the time of writing, registering a 24-hour gain of 3.52 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $49,785.67, registering a 24-hour jump of 3.30 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 42.88 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,639.92, marking a 24-hour gain of 5.54 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.27 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 1.68 percent, as per CoinMarketCap data, currently priced at $0.08179. As per WazirX, Dogecoin price in India stood at Rs 7.11.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 1 percent. At the time of writing, it was trading at $71.95. LTC price in India stood at Rs 6,194.58.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5286, seeing a 24-hour gain of 0.91 percent. As per WazirX, Ripple price stood at Rs 45.88.\n\nSolana (SOL) Price Today\n\nSolana price stood at $113.15, marking a 24-hour jump of 6.17 percent. As per WazirX, SOL price in India stood at Rs 9,650.\n\nTop Crypto Gainers Today (February 13)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nBeam (BEAM)\n\nPrice: $0.02928\n\n24-hour gain: 13.33 percent\n\nORDI (ORDI)\n\nPrice: $69.95\n\n24-hour gain: 12.49 percent\n\nHelium (HNT)\n\nPrice: $8.83\n\n24-hour gain: 9.67 percent\n\nSei (SEI)\n\nPrice: $20.7338\n\n24-hour gain: 8.99 percent\n\nGnosis (GNO)\n\nPrice: $275.72\n\n24-hour gain: 8.24 percent\n\nTop Crypto Losers Today (February 13)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nFlare (FLR)\n\nPrice: $0.0327\n\n24-hour loss: 2.40 percent\n\nImmutable (IMX)\n\nPrice: $2.93\n\n24-hour loss: 2.13 percent\n\nKaspa (KAS)\n\nPrice: $0.1403\n\n24-hour loss: 1.18 percent\n\nAxie Infinity (AXS)\n\nPrice: $7.69\n\n24-hour loss: 0.63 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $4.09\n\n24-hour loss: 0.20 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin crosses the $50,000 threshold, marking its first break since 2021. The surge is attributed to the strong showing of the US stock market, substantial investments in spot Bitcoin ETFs, and an impending halving event. The next resistance for Bitcoin is at the $50,250 level, suggesting the potential for a continued climb beyond $51,200. Positive investor sentiment is reflected in active bullish activity in the market. At the same time, Ethereum sustains a position above $2,600, with bullish investors aiming for the $2,717 threshold.”\n\nCoinSwitch Markets Desk noted, “After a long wait of more than 2 years, BTC finally hit the prestigious figure of $50k once again yesterday as the total crypto market cap inches towards the 2 trillion dollar mark. Incidentally, BTC has printed 8 consecutive green candles, a fit previously achieved in July 2021 which led us to the last all-time high at $69k. With the market picking up pace, the world’s second biggest crypto by market cap, Ethereum (+6%) and its top layer-2 solutions, OP (+8.3%) and ARB (+7.5%) have also started to show strength to move towards another local high if the momentum in BTC is sustained with just two months to go in the most sought after event in the crypto ecosystem — the BTC halving.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's rise above $50,000 is causing losses for bears, supported by its strongest weekly close since December 2021. Bitcoin is trading more than 3% higher, having gained 13.5% last week, marking its biggest weekly gain since October. Bears expecting a deeper pullback after bitcoin's plunge below $40,000 last month are thwarted by the nearly 30% recovery since late January. Spot bitcoin ETFs saw net inflows of $1.1 billion last week, surpassing $10 billion in assets under management. Macro tailwinds from US stock markets reaching record highs and Fed rate cut expectations further boost Bitcoin. While bearish concerns persist due to an overbought RSI and nearing market highs, bullish resistance around $52,000 with aggressive buying is likely to persist, spelling more woes for Bitcoin bears.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, BTC reached a significant milestone, breaking the $50,000 mark and hitting its highest level of the year. This led to a widespread increase in altcoins, contributing to the overall crypto market cap nearing $2 trillion. From a technical perspective, both BTC and ETH are showing bullish momentum. BTC has its sights set on $51,800, while ETH aims for $2,700. Traders should pay attention to the US CPI announcement today, as it has the potential to impact market volatility. Being cautious in response to such events is advisable.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin surpassed $50,000 for the first time since December 2021, fueled by the positive impact of ETFs, solidifying its position among the top 10 most valuable assets. Bitcoin's recent surge saw a 3.59% increase in the last 24 hours, with a notable 16.87% gain over the past 7 days, currently priced at $49,915.98. Ethereum (ETH) is trading at $2,654.07, experiencing a 5.88% rise in the last 24 hours and a 15.28% increase over the past week.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The Total Crypto Market Capitalisation has risen to $1.87T with Bitcoin crossing $50,000 for the first time in 2 years. As expected, Bitcoin soared to $50,000 after holding and breaking above the $49,000 support. On the Other hand, Ethereum is trying to break the $2700 resistance which might be successful when Bitcoin Dominance decreases from the current 52%. There are Approximately 60 days until the Bitcoin Halving in April 2024 which could potentially push the Cryptocurrency market to new highs.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOS1hPdXhhVXY0dlhjVnAzWmJ5bmRoRWpnTzk3bk1FN0lsZmRJc2NqUVFjYm5IMEpBOEhXSmxoMHQ4TzcwMXVXazF3MG10YkFkN3g0cjZ4OWJHNy00cXdTamtCUTZJdkdDYkJrd0dVZF9MbDVLU3hIa2J3TkhGMlduaFpucHNOQkFic0dWUkN1YnE3UHZ0M1FsNGRZNE0tNnRETUlUWjhDNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Solana & Ethereum Lead Top Crypto Gainers – 5 Best Coins to Buy Now as Prices Pump - Watcher Guru",
        "content": "The crypto market has started the week bullishly, with Solana (SOL) and Ethereum (ETH) posting gains of over 7%. Other top altcoins also saw significant boosts as crypto investors became even more optimistic.\n\nThis article will discuss the price rises of SOL and ETH and highlight five alternative cryptocurrencies that could also be worth buying while the market is hot.\n\nSolana & Ethereum Surge as Cryptocurrency Market Turns Bullish\n\nOver the past 24 hours, Solana and Ethereum have posted substantial gains and look likely to continue their upward trajectory.\n\nSOL now trades around $114, up nearly 10% since yesterday.\n\nThe layer-1 blockchain’s native crypto has seen its market cap swell to almost $50 billion, with spot trading volume surging by 85%.\n\nMeanwhile, ETH hit $2,685 earlier today, marking a 7% increase in the past 24 hours.\n\nETH’s market cap now exceeds $320 billion, cementing its status as the second-largest cryptocurrency behind Bitcoin (BTC).\n\nThe price rises of SOL and ETH come amid a broader altcoin surge, with investor sentiment turning decidedly bullish over the past week.\n\nMoreover, with the Crypto Fear & Greed Index now in “Extreme Greed” territory, there seems to be support for further upside soon.\n\nWhat Are the Best Coins to Buy Now as Crypto Prices Rise?\n\nAs the cryptocurrency market posts strong gains, investors may be wondering what other coins are worth buying.\n\nThis section will highlight five cryptocurrencies beyond Solana and Ethereum that could also see their prices pump in the days and weeks ahead.\n\n1. Jupiter (JUP)\n\nJupiter (JUP) has emerged as one of the most talked-about cryptos amid the ongoing altcoin surge.\n\nAs the governance token of the Jupiter decentralized finance platform on Solana, JUP allows holders to guide decisions on liquidity plans, token emissions, and other essential parameters.\n\nThe token also serves as a crucial part of Jupiter’s offerings, like perpetual swaps and its upcoming stablecoin, SUSD.\n\nWith 40% of the total supply airdropped to nearly 1 million wallets, JUP has seen impressive adoption and usage so far.\n\nAs Solana continues seeing developer and user growth and Jupiter builds out its DeFi offerings, JUP has significant room for price appreciation in 2024 and beyond.\n\n2. Meme Kombat (MK)\n\nNext on our list is Meme Kombat (MK), a presale cryptocurrency hosted on the Ethereum blockchain.\n\nMeme Kombat combines elements of crypto gaming with meme coin virality, offering a virtual battle arena where users can bet on hilarious animated fights.\n\nEach fight features two well-known meme coin mascots, with fight outcomes determined on-chain.\n\nAside from wagering, MK holders can also stake their tokens to earn passive income.\n\nMore than $8.6 million has been raised through Meme Kombat’s presale, meaning the hard cap of $10 million could be reached very soon.\n\nWith DEX listings on the horizon, Meme Kombat could be another crypto worth buying as the market continues its bullish surge.\n\nVisit Meme Kombat Presale\n\n3. Dymension (DYM)\n\nAs one of the pioneers in the “modular blockchain” space, Dymension (DYM) is another crypto that may be worth considering.\n\nDymension is building a network of high-speed “RollApps” – easily deployable blockchains tailored for specific use cases.\n\nThe DYM token serves as the native asset facilitating transactions, staking, governance, and cross-chain transfers.\n\nWith an innovative RollApp Development Kit allowing rapid blockchain creation, Dymension offers an easy solution to scalability issues that hamper the adoption of dApps.\n\nAt the time of writing, DYM is trading for just $7.17 and has recently passed a market cap of $1 billion – suggesting that the token could be gearing up to explode soon.\n\n4. Bitcoin Minetrix (BTCMTX)\n\nBitcoin Minetrix (BTCMTX) is a first-of-its-kind “Stake-to-Mine” platform hosted on Ethereum.\n\nUsing Bitcoin Minetrix, crypto enthusiasts can mine Bitcoin without needing expensive computing hardware.\n\nThe process involves staking BTCMTX tokens to earn mining credits, which are then burned to receive hash power.\n\nNot only that, but BTCMTX holders can also generate further tokenized income through staking – with yields currently set at 63% per year.\n\nOver $10.7 million has been raised in Bitcoin Minetrix’s presale, with BTCMTX tokens on offer at the discounted rate of $0.0134.\n\nGiven the massive buzz around Bitcoin’s upcoming halving event, Bitcoin Minetrix could attract enormous attention once launched later this year.\n\nVisit the Bitcoin Minetrix Presale\n\n5. Manta Network (MANTA)\n\nConcluding our list of the best coins to buy now is Manta Network (MANTA).\n\nManta is building dual modular networks in Manta Pacific and Manta Atlantic.\n\nThe former is a layer-2 ecosystem for private Ethereum dApps, and the latter is a high-speed standalone blockchain on Polkadot.\n\nPowered by zero-knowledge proofs, Manta allows private and compliant on-chain transactions at scale.\n\nDISCLAIMER: THIS IS A SPONSORED POST"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxPbHprNmhFQkhBc0dTU2MwcWkwT2dZeDFGTmtCVjlvcUdkbEdpWDV2eThsZVVsbkk2Y0pPTUItSjQxaXBtbVdSLXlsbG9TLVZFOHIyYmlZOHZpUlQydlZQemNFZHdxcEtoQ21Ta21VSUpjQ0o4MElmOHFxT2ZvMVdZNUVqSmluX2VkbTA2b1RfcWVzNjc3dTI5ZVlBQmRjcDZJMXBVVXBwUDE1czJkb1BCa1o3Ym1IdlB6d3E3dnZseGhyMXJfLUNOMnJlclgwU2gydlFyZm5LT2szVkFIWlVGNlBRVFlTY0VYNEgzTWxyWFlkQ1Rfc0HSAfsBQVVfeXFMTkVxcWFoTkJuSjdORzF3LVNHeGQxVVZFMkVxOEJqSVhYN0pfclVrdXVXOGhDWE1KYVM4NlFWTnVFWkJTc29BQUVLajlmbUhWVFhrRlJaMHZuVkxKNnRhVjBrUjVNdXRUb2hyc05xTk0tRXBLMnd3dmJDME1JQjJqbmNNWGI0MnEtRWNRZ1QxWmhpRUJvUGc5UHd6bFljemk5OW5zQnlBVEFpUVpzMktiTW56ZktVVDlwajB0VnFYdF9nOENjel9uZkNxSlZNTVdSZUQ5am9aX0FxZEQxQ09IQ1lPRkhvV2tkZDRXWENEREpNU004SXowNG51QWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Stable At $49,000, PYTH Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to remain stable within the $49,000 range early Tuesday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor losses across the board. The PYTH token emerged as the biggest gainer of the lot, with a 24-hour jump of over 15 percent. BEAM, which was the biggest gainer yesterday, became the biggest loser, with a 24-hour dip of over 7 percent.\n\nThe global crypto market cap stood at $1.85 trillion at the time of writing, registering a 24-hour dip of 0.94 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $49,468.81, registering a 24-hour dip of 0.87 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 42.79 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,630.87, marking a 24-hour dip of 0.60 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.29 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 1.19 percent, as per CoinMarketCap data, currently priced at $0.08102. As per WazirX, Dogecoin price in India stood at Rs 7.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 4.25 percent. At the time of writing, it was trading at $68.98. LTC price in India stood at Rs 6,000.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5247, seeing a 24-hour loss of 1.11 percent. As per WazirX, Ripple price stood at Rs 45.50.\n\nSolana (SOL) Price Today\n\nSolana price stood at $111.60, marking a 24-hour dip of 1.82 percent. As per WazirX, SOL price in India stood at Rs 9,505.43.\n\nTop Crypto Gainers Today (February 14)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nPyth Network (PYTH)\n\nPrice: $0.6732\n\n24-hour gain: 15.04 percent\n\nBlur (BLUR)\n\nPrice: $0.6945\n\n24-hour gain: 9.10 percent\n\nStacks (STX)\n\nPrice: $2.13\n\n24-hour gain: 7.92 percent\n\nAkash Network (AKT)\n\nPrice: $3.47\n\n24-hour gain: 6.63 percent\n\nVeChain (VET)\n\nPrice: $0.03324\n\n24-hour gain: 5.63 percent\n\nTop Crypto Losers Today (February 14)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBeam (BEAM)\n\nPrice: $0.02756\n\n24-hour loss: 7.23 percent\n\nAstar (ASTR)\n\nPrice: $0.1787\n\n24-hour loss: 4.76 percent\n\nSATS (1000SATS)\n\nPrice: $0.0004515\n\n24-hour loss: 4.63 percent\n\nInjective (INJ)\n\nPrice: $34.52\n\n24-hour loss: 4.50 percent\n\nRonin (RON)\n\nPrice: $2.61\n\n24-hour loss: 4.37 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Following the release of January's US CPI data, which indicated a higher-than-anticipated 3.1% annual inflation rate, Bitcoin is currently consolidating. Despite a dip to $48,000, it has bounced back to $49,500, showcasing a bullish trend. If Bitcoin maintains levels above $49,000 this week, the potential for growth to $50,000 and beyond is likely; otherwise, a correction within the $46,000-$48,000 range might occur.”\n\nCoinSwitch Markets Desk noted, “After crossing $50k early yesterday for a brief period of time, BTC corrected for about 2.5% due to the US CPI data for January where CPI print came higher than expected. The January report showed 3.1% year-on-year inflation as compared to the expectation of 2.9% which directly had an impact on the chances of rate cuts in May. Market participants now see a 34% chance of a rate cut as compared to 51% before this data became public. Since $50k is a major psychological resistance, it would be interesting to see whether BTC corrects further down. On the other hand, as crypto fear and greed hit its highest levels since Nov 2021, we are seeing the crypto market rally. In altcoin news, SOL(-1.89%) briefly overtook BNB as the 4th largest crypto by market cap, with its market being in touching distance of $50 billion. If BTC continues the rally or even starts consolidating near the current price levels, we could see great gains in fundamentally solid altcoins.”\n\nRajagopal Menon, Vice President, WazirX, said, “On Wednesday, Bitcoin (BTC) dipped below $50,000 in response to a US inflation report that exceeded expectations, affecting projections for interest-rate cuts. The leading cryptocurrency faced a 2% downturn, sliding from an initial $50,000 to $48,700, rebounding to $49,600 afterward. In contrast, SOL exhibited increased resilience, achieving a gain of over 1%. Analysts urged vigilance concerning market optimism, highlighting that the inflation data hindered Bitcoin's rally shortly after surpassing the $50,000 threshold on Monday.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin fell below $49,000 after the release of stronger-than-expected US CPI data, dampening expectations of a rate cut. With US government bond yields and the rising dollar index, Bitcoin has faced selling pressure along with stocks and gold. However, the withdrawal may be short-lived. Spot inflows into Bitcoin ETFs remain strong, suggesting sustainable demand despite macroeconomic uncertainties. Additionally, with the upcoming supply halving and the continued influx of spot ETFs, bullish sentiment remains. Options data indicated rising investor optimism, while potential safe-haven demand amid concerns over US regional banks could further support bitcoin. Thus, declines are seen as buying opportunities, with a retest of the all-time highs at $69,000 likely in the near future.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The Crypto market experienced a slight correction as Bitcoin made a pull back to $49,000 level. The next few days could see a decrease in Bitcoin Dominance and the start of a bullish trend for Ethereum and Altcoins. At the same time the Bitcoin ETF inflows have continued to increase making the demand for Bitcoin 10x more than the supply coming from miners. We may witness a continuation of the bullish trend until the halving in April this year.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, the release of US CPI data showing 3.1% versus the forecasted 2.9% caused BTC to drop by almost $2000 to the $48,000 level. However, it managed to recover slightly. This drop also impacted altcoins, which fell by more than 5%, with some recovering afterward. Additionally, NASDAQ experienced a decline of more than 1.5%. Technically, BTC saw a daily bearish candle close after eight consecutive days of green candle closes. While this isn't necessarily a sign of reversal yet, BTC needs to maintain its position above $49,000 and clear the $51,850 level. On the other hand, ETH/BTC bounced back from its support level, suggesting that we may see ETH outperforming BTC for the next few days.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNc2dwY0lQUWhrMzA4WjZSMGYwdmNIeERNb0h6ZXhCcjRmbzEyY0NaNFhGZTNjcDh0N2c4azNPOTlseTFjTGhGTDNhdWU1SWJlMEFaYnVTemx2b0llYlZnS3RGTi0tZXdRNk9sZVREczFXSU9SdmNXYW0yalNnRnZwMHJSZ19IcVdIeVJILVRtUDZzSzJ0Z1NqYnBadnRuZ3ZzcS1wc1ZqTHplX3VZVGRHcHZUUURQWVRvQkxWV0h6SW56bWhfUHlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Crypto Market Price Analysis Today: Ethereum (ETH), Aptos (APT), Internet Computer (ICP), Optimism (OP), IOTA - Blockchain Reporter",
        "content": "Bitcoin has surged to the critical $50,000 milestone, fueled by the robust performance of the U.S. stock markets and significant investments into Bitcoin-specific exchange-traded funds (ETFs).\n\nMany experts are bullish about the ongoing upward trend. However, several analysts have issued a note of caution to investors on social media, pointing out that the percentage of Bitcoin’s total supply that is currently in profit is approaching 95%, a level that often brings a decline.\n\nDespite the potential for short-term setbacks, the outlook for [ccpw id=60415] remains positive over the longer term. Glassnode indicated in a post that certain on-chain metrics suggest Bitcoin might be at the early stages of a bull market.\n\nCould this upward trajectory of Bitcoin also lift certain altcoins? Let’s dive into the charts to explore this possibility.\n\nEthereum (ETH) Price Analysis\n\nAttempts by bears to hinder Ether’s recovery were observed around the 61.8% Fibonacci retracement mark of $2,700, but bulls are strongly defending a decline below immediate Fib channels. As of writing, ETH price trades at $2,616, declining over 1.6% from yesterday’s rate.\n\nThe upward trend of the 20-day Exponential Moving Average (EMA) at $2,640 and the Relative Strength Index (RSI) declining from the overbought region suggest that the volatility is stabilizing. If [ccpw id=60480] surpasses $2,700, it might consolidate within $2,900-$3,000.\n\nThe critical support level to keep an eye on is at $2,400. Should this support be breached, we might see an escalation in selling, potentially driving the price down to a significant support level at $2,250, where it is anticipated that buyers will mount a strong defense.\n\nAptos (APT) Price Analysis\n\nAPT’s attempt to recover is being met with resistance at the 20-day Exponential Moving Average (EMA) of $9, suggesting a negative sentiment as traders opt to sell during price rallies.\n\nShould the price decline from its current position, the bears will aim to push and keep the price beneath the solid support level of $8.8. Achieving this could lead the APT/USDT pair to fall towards the vital support at $7.9, where it is anticipated that buyers will robustly defend the level.\n\nConversely, a breakthrough and sustained closure above the 20-day EMA would signal a shift towards strength. Following this, the APT price might ascend to the descending trend line, poised to be a significant obstacle for the bulls. Surpassing this resistance could pave the way for a potential surge to $11.1.\n\nInternet Computer (ICP) Price Analysis\n\nICP has been oscillating within a symmetrical triangle pattern for several days, reflecting a standoff between buyers and sellers.\n\nThe 20-day Exponential Moving Average (EMA) at $13 is leveling off, and the Relative Strength Index (RSI) hovers around the midpoint, suggesting an equilibrium in market forces. To seize control, buyers need to push the price out of the triangle’s confines. Following this breakout, the ICP/USDT pair could aim for a surge towards the resistance zone between $14 and $16.\n\nConversely, if sellers manage to drive and keep the price beneath the triangle’s uptrend line, it could trigger a decline towards the firm support level at $9.8, and possibly extend to $9. This level is expected to witness vigorous defense from buyers.\n\nOptimism (OP) Price Analysis\n\nOptimism is currently at a critical juncture, with buyers and sellers contesting the price near the EMA20 trend line.\n\nThe bulls managed to push the price above $3.3, yet they struggled to capitalize on this breakout the following day near $3.9. The bears attempted to seize control by pushing the price below immediate Fib channels, but the bulls stood firm and strongly defended, indicating strong buying interest at lower levels. The aim for buyers is to drive the OP/USDT pair towards $4.1.\n\nOn the flip side, the bears are plotting to pull the price back under the moving averages. Succeeding in this effort could see the pair tumble to the crucial support level at $3.2, a level which buyers are keen to protect. Failing to hold this line could lead to a further decline to $2.9.\n\nIOTA Price Analysis\n\nThe bulls successfully pushed IOTA beyond the neckline of its inverse head and shoulders (H&S) pattern and are now working to hold onto these gains amidst a retraction near $0.27.\n\nShould the buyers keep the price north of $0.27, the IOTA/USDT pair could quickly move up to $0.32, followed by a potential rise to $0.35. Surpassing this barrier would indicate that the upward trend is set to continue, with $0.4 as the subsequent bullish target.\n\nOn the other hand, a sharp decline and fall below the moving averages would suggest that the breach above $0.27 might have been misleading, setting a trap for the bulls. Under such a scenario, the pair could drop to $0.23, and possibly further down to $0.2."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOaW0zdU02Z3NNZE1rSTNJS1JQWG1tNFdSNEpYaTA3Z250aUR2RFFtbXhTZ1JjRXhUWGprRHY4UkwyVXJJTUFIRWJWQVdLSUhneTlTY3NtdnZYX01abUswLU5Tb0lBS25iZGN0aEJjNUZRV3c3elpSRG9iSG9wUWtRcEpWNFJoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Can it reach $10,000 in 2024? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The Ethereum price is currently moving up quickly in the slipstream of the Bitcoin price and has been able to surpass the $2,600 mark again in the last few days . With the recent increases, there is a chance that the Ethereum price can reach new all-time highs in the coming months. Can the Ethereum price even rise to $10,000 by the end of 2024? How has the Ethereum price moved in the last few weeks? The Ethereum price has risen significantly in the last few weeks. In mid-October, the Ethereum price was still at $1,600. Then the price rose extremely sharply at the end of 2023. In mid-January, Ethereum was able to break through the $2,600 mark.\n\nIn the last few weeks we saw a significant consolidation and the price fell back to the $2,200 mark. But another bull run over the last two weeks brought the Ethereum price back above $2,600. Can the ETH price rise consistently in the coming months? The year 2024 has so far been dominated by the crypto bull run. The Bitcoin price is rising massively in anticipation of the halving. Especially as Bitcoin prices continue to rise, the prices of altcoins could rise even more in percentage terms. While many coins are highly speculative, a rise in Ethereum is still the safest behind Bitcoin. Another point that could cause the Ethereum price to explode is a possible Ethereum ETF. However, many regulatory questions still need to be clarified. Whether the ETH price rises more strongly, equally or slightly weaker than the Bitcoin price, a rally in 2024 is likely. Can the ETH price rise to $10,000 at the end of 2024? The Ethereum price could well see a new all-time high in 2024. This is above the $4,800 mark. This puts us over 50% of the all-time high at the moment. The road to $5,000 might not be far."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQcHdfY3RhcWZ3TzZhYmFodV9veUl1U3lSUlBVQmRhVS1qMUhMbWpYemt1M0pkZEFpeVhhZFljM1lQNWVqQktVUC1SY3NjdDA0M2dIU0NoYUVyaGJIRGdFVXdEN2UwZmh5cU1FcTktWjBDenQ0eU1GdTJZUHdwSVNrR09QQkJPbDNrQkRhRm9mWUVHWVlYczBWaXd0MkpsbHRRT1hxenBRSTVjdGNMaEtiNC1SdmJxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin Pre-Halving Rally 'Has Begun,' but Ethereum and Altcoins Will Follow BTC - Here's Why - Captain Altcoin",
        "content": "Home » Journal Bitcoin Pre-Halving Rally ‘Has Begun,’ but Ethereum and Altcoins Will Follow BTC – Here’s Why Journal Bitcoin Pre-Halving Rally ‘Has Begun,’ but Ethereum and Altcoins Will Follow BTC – Here’s Why Samuel Munene\n\nAccording to analyst Rekt Capital’s newsletter, the Bitcoin “Pre-Halving Rally” phase began earlier than expected. Rekt Capital noted that Bitcoin had broken away from its Pre-Halving Downside period and entered a new Pre-Halving Rally phase. “The Pre-Halving Rally phase has begun, a little ahead of schedule,” noted Rekt Capital.\n\nThis Bitcoin breakout has major implications for the wider altcoin market. Rekt Capital explained that it is “kickstarting a new Money Flow Cycle.” Altcoins have started to react to Bitcoin’s new pre-halving rally stage. Besides, Rekt Capital analyzed that altcoin market capitalization broke out from its bullish pennant formation over the past few weeks, representing a historic breakout from this structure.\n\nBreaking Out: Altcoins Follow Bitcoin’s Lead\n\nAs Rekt Capital pointed out, “After extended consolidation at highs, Altcoin Market Cap is ready for a new uptrend. Historically, yellow-circled retests have preceded uptrends to revisit the blue level at $250bn, which would set up another retest (blue-circled retest). Altcoins are going to increase in valuations over the coming several weeks.” Hence, with the altcoin market cap breakout, valuations of individual altcoins like Ethereum are anticipated to rise.\n\nRekt Capital discussed Ethereum’s price movement in detail . As predicted, Ethereum has rallied 15% from its range low and is moving towards its range high of $2791. “Generally, the fact that Altcoin Market Cap and Ethereum have broken out, shows that Ethereum is following Bitcoin and with time – Altcoins will too,” noted Rekt Capital.\n\nAltcoins Bottoming Out for a Bullish Cycle\n\nMoreover, this timing is beneficial as altcoins are currently in their lowest hype period for Q1 after experiencing significant retracements from late 2023 highs, according to Rekt Capital’s analysis. “Now, Altcoins should be bottoming in preparation for their next wave up,” commented Rekt Capital.\n\nCelebrate Dogecoin and Make Big Gains with Doge2014! Doge2014 raises 500K in days celebrating Dogecoin. Make potentially big profits and get in on exclusive airdrop! Show more + Show less –\n\nAs per highly-regarded analyst Rekt Capital, the Bitcoin halving pre-rally has started alongside bullish breakouts in the altcoin market cap and Ethereum price. Individual altcoins are anticipated to follow the upward trajectory of Bitcoin and Ethereum over the coming weeks as they bottom out of their low hype cycle.\n\nYou may also be interested in:\n\nJoin and Get 10k Tokens FREE! Sponsored Visit Meme Arcade by FOFAR Now Early access bonuses with 10k $BACON for joining now\n\nEngaging community with games and crypto incentives\n\nIntegrated platform with GameFi and NFT functionalities\n\nSimple interface that’s easy for new users to explore crypto gaming"
    }
]