[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQnIyQTFidC1NRmw2QkE4enl3TXlNV1ZNT2RLSUVkZkg2LUQ1ZkFfUWR3U3VjZTB4d3pGMFdLZG5WUEhYdGtQOUxFV1VOcU9WVzJ0eVVrNWtmaDRoY3huWEdFSzZSdnoyMDdXX3dDM0R6MmlQMU1CdzJBdzNUNk9rOGNKVVdhd3Q2NnZhb0xIdElmYVNtY0NpSG95Vzg5Y0J2OVZj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC probing crypto companies in Ethereum investigation as hopes for ETF dim - Fortune",
        "content": "The Securities and Exchange Commission is waging an energetic legal campaign to classify Ethereum, the second-most popular cryptocurrency, as a security, according to U.S. companies that have received subpoenas related to an investigation. The news delivers a further blow to the crypto industry’s hopes the agency will approve applications by BlackRock and others for an Ethereum ETF following the SEC’s approval of a series of Bitcoin ETFs in January.\n\nThe SEC’s Ethereum investigation involves demanding companies furnish any documents and financial records they may have regarding their dealings with the Ethereum Foundation, a nonprofit group that oversees the governance and development of the blockchain by the same name.\n\nAccording to a person at a company who received a recent subpoena request, the SEC’s probe of the Swiss-based Ethereum Foundation began shortly after the blockchain’s shift to a new governance model known as “proof-of-stake” in September 2022. Another person at a separate company that received a subpoena described it as narrow and focused on the Ethereum Foundation, and said they received the subpoena in the last few weeks.\n\nThat proof-of-stake event moved the blockchain away from the energy-intensive model used by Bitcoin in favor of one that relies on a trusted network of validators—and provided the SEC with a new pretext to attempt to define Ethereum as a security, according to people at three different companies familiar with the subpoenas. The people asked Fortune not to identify identify them or their firms for fear of retaliation by the agency’s chair, Gary Gensler, whom one described as “vindictive.”\n\nThe existence of an investigation into the Ethereum Foundation was reported on Wednesday by CoinDesk, which cited an update to the group’s Github code repository that reportedly provided evidence of a probe by an unknown state agency.\n\n“The SEC does not comment on the existence or nonexistence of a possible investigation,” the agency said in response to a request for comment from Fortune.\n\nA push to label Ethereum a security\n\nThe news of the subpoenas comes as the SEC and the Biden administration pursue an aggressive campaign to cut down the crypto industry, which they characterize as lawless. This campaign, however, has been frustrated at times by the vague legal status of cryptocurrencies, which has led to a series of court battles over whether the SEC even has jurisdiction over the industry.\n\nThis critical question of jurisdiction turns on whether a given cryptocurrency is a security, an issue that has not definitively been addressed by courts. While there is a consensus Bitcoin is instead a commodity, under the supervision of the Commodities and Futures Trading Commission, Gensler has signaled his agency regards the vast majority of other cryptocurrencies as securities that must be registered with the SEC.\n\nThe SEC has made this case in recent court cases, except when it comes to Ethereum, whose legal status is even murkier. The security status of Ether has long been a point of contention for the agency. Speaking at a conference in 2018, then-Director of Corporation Finance William Hinman said that Ether did not resemble a security. Emails published as part of the Ripple trial revealed that SEC staff deliberated on how clear to make the assertion and that one official wanted to say that the agency did “not…see a need to regulate Ether.”\n\nThat changed under Gensler, who took over the agency in 2021, and following Ethereum’s switch to proof-of-stake the following year.\n\nAt that time, Gensler said that any crypto assets produced by blockchains that use a proof-of-stake model could resemble investment contracts and therefore be classified as securities, although he was not speaking about any specific coin. In March 2023, he once again suggested that proof-of-stake tokens could be regulated as securities, although he’s since declined to comment specifically on Ethereum, including at SEC oversight hearings at the House Financial Services Committee.\n\nThe issue grew more complicated in October after the SEC approved nine ETFs that tracked the Ether futures market, which is overseen by the CFTC, suggesting the view Ether is a commodity. CFTC Chair Rostin Behnam has said on several occasions that his agency views Ether as a commodity.\n\nBut last month, the controversial crypto firm Prometheum, which has the approval to operate as a special purpose broker-dealer, announced its intention to offer custody services for Ethereum as a security under SEC oversight, once again adding uncertainty to Ether’s regulatory status. One of the recipients of the recent subpoena speculated that Gensler has sought to use Prometheum as a Trojan Horse to classify Ethereum as a security.\n\nThe recent race by major financial firms including Fidelity and BlackRock to gain approval for a spot Ether ETF has brought the issue into the spotlight, with all signs pointing to the SEC rejecting the applications by their May deadline. Bloomberg analysts have pointed out that agency staff have not gone back and forth with issuers on details about the potential, as they did with the spot Bitcoin ETFs, which were approved in January.\n\nA potential declaration that Ether is a security could throw the process into further doubt, especially as it would raise questions over the CFTC’s supervision of Ether futures markets."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOVUdiM2JkUGwtOGZWdnBaVkhxamdDWW1EeTl3LVh2T3BjMzg5cWpxS0hPV1BWYjFtUVhLem8yN1N4dGhvYjIyQ2E1dWFWVnJvWUVQLWh0ZURFYUlhWnpBcmExdjZIMzg4QUExWjFKRk5fM1hKY19IcWhGLXlhM1JhcWE1WFd6WGFvV3lRZ1dsOWpUUnN2d2RUR3FLQk9BUDAtenowQm9LVdIBrAFBVV95cUxOVDVMaHVfSFY1emxDUVhjU0RGdWNCRjlpV1JvMm5LS0k2T1NnQUJDTi0xMkZpcVlVV0JfRWZ2b3h0RDhWVXBWQUpxOTUtUkFROVh4QWIwenpxa094VXoySFd6SDFOTFFDWUwxT2ZfS2g3cGctMEc2Y1JDNW8xTl9tNHdsak1NcVpod3NMMjFXS1pycnNnTndXSnVENHNtYlhiLWp2TURROGRyY1M1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Faces Inquiry From a Government; Fortune Says SEC Investigating ETH - CoinDesk",
        "content": "After the publication of this article, Fortune reported the SEC is seeking to classify ETH as a security, a move that would have major implications for Ethereum, an ETH ETF and crypto as a whole. The financial regulator has sent investigative subpoenas to U.S. companies in the past several weeks, according to Fortune's reporting."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNTVk3STFwVnVUY1U2NVlpYXJjQ3JWWGFTdFdab1Y2UTRteEFQU2NRbEhfcUpkaXhqNERvbXA1ZDJmS28yaTdONnJDcWlCWjJBbzFTWk1LU1dQNjBoZVZZZlVXa2w5anVqQU8tMGE0Y3FwN3AyVnpXN1hMYmU5TXJJRWFxNmgzX2tCVnZET0c4dV9lZ2o4RkZmSVFINU1YdkZIa2pUUkQ4TGN0d1FYemc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC Investigating Ethereum Foundation Regarding Proof-of-Stake Transition: Report - Unchained",
        "content": "Fortune reported on Wednesday that the SEC may have had its sights on the Ethereum Foundation since as early as 2022, while CoinDesk wrote that the Foundation faces an inquiry from an unnamed government agency.\n\nThe SEC may be looking into whether Ethereum's switch to a proof-of-stake model makes it more of a security, according to Fortune.\n\nTwo reports on Wednesday have ignited conversations about the potential investigation of the Ethereum Foundation by regulatory authorities, notably the Securities and Exchange Commission (SEC).\n\nThe first report, published by Coindesk, highlighted the removal of certain confidentiality language from the Ethereum Foundation’s website in February 2024. The language, which is usually included to subtly indicate that a project had not received requests for information from any authorities, read:\n\n“The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a way which requires that contact not to be disclosed. Stiftung Ethereum will publicly disclose any sort of inquiry from government agencies that falls outside the scope of regular business operations.”\n\nThis language was removed in February, though news of its removal only began to circulate on Wednesday.\n\nSoon after, a second, more explosive report published by Fortune suggested the SEC had begun investigating the Ethereum Foundation shortly after Ethereum migrated to its current proof-of-stake model. This model, which rewards users for staking tokens and allows for participation in governance votes based on token holdings, may resemble traditional securities to the extent that the regulator may attempt to regulate it as such.\n\nFortune’s report revealed that the SEC began probing the Ethereum Foundation shortly after its blockchain transitioned to proof-of-stake. This information, sourced from individuals at companies who received subpoenas, suggests a focused interest from the SEC on how Ethereum’s new governance model could influence its classification, possibly as a security. These individuals, who requested anonymity due to concerns over retaliation, hinted at an energetic approach from the SEC to redefine Ethereum’s legal status.\n\nThe price of ether, Ethereum’s native cryptocurrency, fell almost 6% following the publication of the two reports on Wednesday late morning ET, but it has since recovered, according to CoinGecko. Ether was recently trading at $3,387, up 1.5% over the last hour.\n\nCommunity Responses\n\nThe latest developments have sparked widespread speculation within the crypto community, although opinions vary on their significance. Some community members and observers have downplayed the potential impact of these investigations, suggesting that regulatory scrutiny of major cryptocurrency foundations is not uncommon.\n\nAmong those downplaying the seriousness of the news was Neeraj K. Agrawal, Communications Director for cryptocurrency policy think tank Coin Center, who questioned on X the substance of Fortune’s report and suggested that the crypto industry is overreacting. Meanwhile, others view the SEC’s actions as a continuation of its aggressive posture towards the crypto industry, potentially impacting the approval odds for spot Ethereum ETF applications, which analysts have recently been reducing.\n\nRead More: Bloomberg ETF Analysts Now Predict SEC Will Reject Spot Ether ETFs in May\n\nIs Ethereum a Security?\n\nAt the heart of the apparent investigation lies the complex legal status of Ethereum as either a commodity or a security. The SEC, under Chair Gary Gensler, has remained ambiguous on Ethereum’s status in spite of a willingness to declare other tokens securities in a variety of legal actions. Still others point to Gensler’s own shifting position in this regard, frequently highlighting his apparently contradictory statements regarding ETH’s status as a security during his time as a professor at MIT.\n\nToday’s reporting suggests that may have changed in September 2022, when Ethereum successfully completed its transition to a proof-of-stake model. This move was part of Ethereum’s broader strategy to enhance efficiency and reduce its environmental footprint. However, it also introduced new complications on the regulatory front. Gensler has argued since then that U.S. securities laws are much more applicable to proof-of-stake blockchains since they allow holders to participate in governance votes and earn yield from their staked tokens.\n\nThe apparent investigation also comes at a critical time when major financial institutions, including BlackRock and Fidelity, have applied to launch Ethereum ETFs. The SEC’s actions have dampened hopes for the approval of these ETFs, with Bloomberg analysts predicting a rejection of spot Ether ETFs in May. This skepticism stems from the lack of engagement between the SEC and ETF issuers, a stark contrast to the flurry of dialogue observed prior to spot Bitcoin ETFs being approved.\n\nAs the situation unfolds, the crypto community remains watchful of the SEC’s actions and their potential impacts on Ethereum’s future developments and the broader cryptocurrency ecosystem."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSUJXRHJwRmxGV2g0QlNSaUU5QkctMTJQUnZTSU5ST3FCWVlwVHZMN3BBRjRqYWdYdzMyU2wyTFk2S1ctNjVIbTFnQldaZ1B5Ymd3a25wM29jTGVXbEtfamloWVFqcmhPOFU5Ym92NmdqbExpMDFGUUl4TzNQYzNZazZwZGkyWlBfbUlVQmdSYlIxaUZqQVQ0b1VfOE9kYVFNZUxocXM1eFdHaXpVYU9ocXB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Faces Investigation by Undisclosed ‘State Authority’ - PYMNTS.com",
        "content": "The Ethereum Foundation, a Swiss nonprofit at the heart of the Ethereum ecosystem, is reportedly under investigation by an undisclosed “state authority.”\n\nThe investigation was disclosed Feb. 26 on the group’s GitHub repository, CoinDesk reported Wednesday (March 20).\n\nA commit on the Ethereum Foundation’s GitHub repository, showing a change made to its website, said “we have received a voluntary enquiry from a state authority that included a requirement for confidentiality.”\n\nThe Ethereum Foundation did not immediately reply to PYMNTS’ request for comment.\n\nThe inquiry comes at a pivotal time for Ethereum and its native asset, ETH, as U.S. investment firms are looking to offer it as an exchange-traded fund (ETF), according to the CoinDesk report.\n\nSimultaneously, the Securities and Exchange Commission is reportedly examining whether ETH should be classified as a security, a development that could have far-reaching implications for Ethereum and the wider crypto industry, the report said.\n\nThe foundation’s website previously stated that it had never been contacted by any agency in a manner that required non-disclosure, a statement that was removed at the time of the Feb. 26 update to the website’s GitHub repository, per the report. The specifics of the inquiry and the identity of the authority have not been disclosed.\n\nAn SEC investigation into ETH’s classification leading to ETH being deemed a security could have consequences for Ethereum, ETH ETF applications, and the cryptocurrency market at large, according to the report.\n\nThe specific reasons for the inquiry remain unknown, but it is possible that a Swiss regulator may have issued a document request to the Ethereum Foundation, possibly in collaboration with the SEC, the report said, citing its interview with an unnamed attorney. The timing of the inquiry could be related to the SEC’s upcoming deadline on May 23, indicating increased activity and investigations by regulatory authorities.\n\nThe SEC approved bitcoin as an ETF in January after years of opposition to the idea of an ETF that invests in bitcoin. While that approval was heralded by figures throughout the cryptocurrency industry, SEC Chairman Gary Gensler stressed that the approval applies only to bitcoin and should not be seen as an indication that the regulator is ready to approve other listed securities.\n\nFor all PYMNTS crypto coverage, subscribe to the daily Crypto Newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQdE9STTJCZHdhSlNjZmdTVHlnX3lqRVRGdW5OU19hVVFDN1N1VFVIM2tBQTlheGU2UjBKemZScEFkcktTalVxWmZVOV9vejd0OHgtTGZaYW5IUlpoUEk1dnhsMzNCQ01HeFlOR1I2MWhTQ0xaWDA3Q1BZQXlLal9ybTVpTEE5c3RNd3BQTXdudTdJSm1ydEMyaUZRVlNpV21HTzd0WGl3Ym9UVzctdXMxcWlOYk5ldw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Gets SEC Scrutiny in Latest Crypto Crackdown - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNOFRNaFBlUHQtX09LRVlPaVZzVlFQMl9YU3Z0alZSYTlZeWFRdnc4YjdqY2hpRUxLUUdZTXh3a05IS1VsUS05Nk5QVTFYbEdhZUp5TkllYzlFb1BjVXZpajRrWE9LZTVrblNpbnJuVnVCZUdqUU5JbDVsWEVUblRpRzRfd0JMclQwaHpLMUpQZmhsWGkzRkFjOHJOOEhiZ2RRZ2JkUVdFUmN3amF1TEw2OXBLb0xMSWZINGstUzdjdTZ1N0VUUlNrUV9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Its First Tokenized Fund, BUIDL, on the Ethereum Network - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--BlackRock today unveils its first tokenized fund issued on a public blockchain, the BlackRock USD Institutional Digital Liquidity Fund (“BUIDL” or the “Fund”). BUIDL will provide qualified investors with the opportunity to earn U.S. dollar yields by subscribing to the Fund through Securitize Markets, LLC.\n\n“ This is the latest progression of our digital assets strategy,” said Robert Mitchnick, BlackRock’s Head of Digital Assets. “ We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.”\n\nTokenization remains a key focus of BlackRock’s digital asset strategy. Through the tokenization of the Fund, BUIDL will offer investors important benefits by enabling the issuance and trading of ownership on a blockchain, expanding investor access to on-chain offerings, providing instantaneous and transparent settlement, and allowing for transfers across platforms. BNY Mellon will enable interoperability for the Fund between digital and traditional markets.\n\n“ Tokenization of securities could fundamentally transform capital markets. Today’s news demonstrates that traditional financial products are being made more accessible through digitization. Securitize is proud to be BlackRock’s transfer agent, tokenization platform and placement agent of choice in digitizing and expanding access to its investment products,” said Securitize co-founder and CEO Carlos Domingo.\n\nBUIDL seeks to offer a stable value of $1 per token and pays daily accrued dividends directly to investors' wallets as new tokens each month. The Fund invests 100% of its total assets in cash, U.S. Treasury bills, and repurchase agreements, allowing investors to earn yield while holding the token on the blockchain. Investors can transfer their tokens 24/7/365 to other pre-approved investors. Fund participants will also have flexible custody options allowing them to choose how to hold their tokens.\n\nThe initial ecosystem participants in BUIDL include Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, among other market participants and infrastructure providers in the crypto industry.\n\nBlackRock Financial Management, Inc., will be the investment manager of the Fund and Bank of New York Mellon will serve as the custodian of the Fund’s assets and its administrator. Securitize will act as a transfer agent and tokenization platform, managing the tokenized shares and reporting on Fund subscriptions, redemptions, and distributions. Securitize Markets will act as placement agent, making the Fund available to eligible investors. PricewaterhouseCoopers LLP has been appointed as the Fund's auditor for the period ending December 31, 2024.\n\nThe Fund will issue shares pursuant to Rule 506(c) under the Securities Act of 1933 and Section3(c)(7) of the Investment Company Act. The Fund’s initial investment minimum is $5 million.\n\nBlackRock has also made a strategic investment in Securitize. As part of the investment, Joseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, has been appointed to Securitize’s Board of Directors.\n\nAbout BlackRock\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading financial technology provider, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit www.blackrock.com/corporate\n\nAbout Securitize\n\nSecuritize, the leader in tokenizing real-world assets, is driving the compliant digitization of financial assets through next-generation blockchain technology. Securitize, or through its subsidiaries, is a registered broker-dealer (member Finra / SIPC) and operates a primary marketplace, an alternative trading system, as well as a top 10 transfer agent and has an exempt reporting adviser. Learn more at http://www.securitize.io.\n\nDisclosures\n\nInterests in BUIDL have not been registered with the Securities Exchange Commission under the Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements. Interests in BUIDL will not be listed on any exchange.\n\nPrivate market investments are speculative and considered risky, including potential loss of your investment, and may not be appropriate for every shareholder. Any discussion of liquidity is purely speculative. Past performance is not indicative of future results.\n\nSecurities are offered through Securitize Markets, LLC, (“Securitize Markets”) a registered broker-dealer and member FINRA/SIPC. Neither Securitize Markets, nor any of its affiliates provide any investment advice or make any investment recommendations to any persons, ever, and no communication through herein or in any other medium should be construed as such. Securities offered by Securitize Markets have not been registered under the Securities Act of 1933 and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.\n\nBUIDL may not be able to maintain a stable value of $1.00 per token at all times. Investments in tokens using blockchain, such as an investment in BUIDL, involve a high degree of risk, including risks that are different from the risks of investing in traditional assets. These risks include, but are not limited to, risk of regulatory uncertainty, market adoption, market manipulation, market exiting, price volatility and security risk and may expose investors to loss of principal. Investments in private placements are also speculative and involve a high degree of risk. Investors must be able to afford the loss of their entire investment. Offers to sell, or the solicitations of offers to buy any security can only be made to qualified investors through official offering documents that contain important information about risks, fees and expenses associated with the applicable securities. Investors should conduct their own due diligence and are encouraged to consult with a financial advisor, attorney, accountant, tax advisors, and any other professional that can help them to understand and assess the risks associated with any investment opportunity. Past performance is not indicative of future results.\n\nBlackRock Financial Management, Inc. (the “Investment Manager”), a Delaware corporation that is an indirectly wholly-owned subsidiary of BlackRock, Inc., is the investment manager of the Fund and is responsible for its investment activities subject to the policies, control and supervision of the board of directors of the Fund. The Investment Manager is registered with the U.S. Securities and Exchange Commission as an investment adviser under the U.S. Investment Advisers Act of 1940, as amended.\n\nIn connection with its services as placement agent for BUIDL, the Investment Manager will pay to Securitize Markets cash compensation as follows: (i) an upfront flat fee and (ii) a quarterly fee with respect to each investor who is introduced to BUIDL by Securitize Markets generally equal to a percentage of the average daily net asset value of such investor’s interests in BUIDL for the applicable calendar quarter, with the amount of the upfront fee to be credited against the quarterly fee.\n\nThe compensation paid by the Investment Manager to Securitize Markets for acting as placement agent to BUIDL creates a conflict of interest for Securitize Markets. In particular, the amount of compensation received by Securitize Markets will depend on the number of investors that are introduced to BUIDL. As a result, Securitize Markets is incentivized to recommend that prospective investors invest in BUIDL. In addition, BlackRock’s investment in Securitize Markets creates a conflict of interest for the Investment Manager.\n\nSecuritize Markets or one or more of its affiliates may be a BlackRock client or investor."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE02TG5udkhoQVA4bUV2SGwtRV9IdUZtYnB6RVBFNkZKMXc5ckpQd3FoTkZ6eW1rMWJ0dHQteEt4aVZaSE8tZVJlRll5blRzR2JsbjN5aHhhUGxUZ0VkaUM5NWo4RWVjTkpzM2NwVGd0Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Is Ether is a crypto security? The SEC wants to know - Quartz",
        "content": "The U.S. Securities and Exchange Commission (SEC) is considering whether to classify Ether, the second-largest cryptocurrency by market cap, as a security. Fortune reports that the financial watchdog has sent subpoenas to three companies as part of probe of the Ethereum Foundation, the ecosystem that works behind the Ethereum blockchain network.\n\nThe top 15 cities for startups Share view video The top 15 cities for startups\n\nThe top 15 cities for startups Share The top 15 cities for startups\n\nThe news comes on the heels of the SEC’s hesitance to approve spot Ether ETFs, leaving applicants like Hashdex and ARK 21Shares (pdf) waiting for final decisions in May. While the agency approved 11 Bitcoin ETFs earlier this year, it seems like Ethereum ETFs may face regulatory hurdles.\n\nAdvertisement\n\nAccording to the Ethereum Foundation’s GitHub on Feb. 26, the group has “received a voluntary enquiry from a state authority that included a requirement for confidentiality.”\n\nAdvertisement\n\nSecurity, currency, or commodity?\n\nThere’s been plenty of discussion around whether cryptocurrencies like Ether are a type of currency, security, or commodity since Bitcoin was introduced in 2009. SEC chair Gary Gensler, who’s taught a course on blockchain and cryptocurrencies at the Massachusetts Institute of Technology, is known for his strict approach to regulating crypto. He has referred to the cryptocurrency market as the Wild West, emphasizing its need for regulation.\n\nAdvertisement\n\nWhat next for the crypto market?\n\nThe SEC’s current action is a jolt to the potential of spot Ethereum ETFs. The Ethereum blockchain network, which went through a major upgrade earlier this month, is home to thousands of decentralized finance (DeFi) applications, and the move is expected to affect the crypto market. At the time of writing, Ether — the native token of Ethereum — was down 15% over the past seven days, hovering around $3,300."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9YaVgybzhicFlmbXFKOWozQkZIa1Fkbk5NeHN2akFzbW9DMlpnTzhKcERVTnBQQzZhRmhkaTFIVWZBN090NHZ6TFV5X0VrZDZVWHloZm1UX0p6Y19ETzcwVVZMX1ZiSG42OVJYcnNENzhkb1dBWmtScQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation faces probe from 'state authority' over undisclosed reasons - Crypto Briefing",
        "content": "The Ethereum ecosystem's recent Dencun upgrade and the prospects of an Ether ETF coincide with the mysterious probe.\n\nShare this article\n\nThe Ethereum Foundation, a Swiss non-profit organization working for central to the Ethereum ecosystem, is currently under investigation by an unnamed “state authority,” according to a recent update on the group’s GitHub repository. However, further details on the scope of the investigation and the reasons behind it remain undisclosed.\n\nA GitHub commit logged on February 26, 2024, on the Ethereum Foundation’s repository revealed that the organization received a voluntary enquiry “from a state authority” that included a confidentiality requirement. The issue was first raised by an investigative report conducted by the crypto media platform CoinDesk.\n\nThe report from CoinDesk refers to a lawyer familiar with the situation, whose statements speculate that a Swiss regulator may have served a document request to the Ethereum Foundation. The same lawyer also extended the speculation by saying that the request in question may also point to a collaboration between the named entity (ostensibly, the Swiss government, in this case) and the US Securities and Exchange Commission (SEC).\n\n“I also think it’s fair to say the Ethereum Foundation is not the only entity that they are seeking information from,” the lawyer said, implying that other overseas entities might have received a similar method of scrutiny based on documentary requests.\n\nThe investigation comes at a time of significant technological changes for Ethereum, the second-largest blockchain by market capitalization. Following its initial coin offering in 2015, Ethereum recently implemented the Dencun upgrade, designed to reduce transaction costs for users of Ethereum-based layer-2 platforms.\n\nOn the regulatory front, the SEC is also currently evaluating multiple applications for an Ether ETF, with a final deadline for some applications approaching on May 23. However, analysts following the process have expressed skepticism about the likelihood of approval, citing a lack of engagement between applicants and SEC officials.\n\n“The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a way which requires that contact not to be disclosed. Stiftung Ethereum will publicly disclose any sort of inquiry from government agencies that falls outside the scope of regular business operations,” says a disclosure on the Ethereum Foundation’s website.\n\nThis statement is a warrant canary, and it has since been removed from the website, coinciding with the aforementioned GitHub commit.\n\nBy definition, a warrant canary is a form of text or visual warning that companies include on their websites to indicate they have never been served with a secret government subpoena or document request. The removal of the canary suggests that the Ethereum Foundation may have received such a request without explicitly stating so.\n\nThe SEC recently requested for public comment on proof of stake, the consensus algorithm employed by Ethereum and other blockchains.\n\nUPDATE: According to a report from Fortune, the SEC is pursuing an “energetic legal campaign” to classify Ethereum as a security, confirming the investigation’s links to the US government."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5ueHpLMGU5WlA0UjZKN1FTLXZkd3JzQUxJM0hVamZhcXVWTUgwWXdMWGhLWTh3TnIxRExkWllnZzRQRkNQcjRxNTdyVDVBTTVKdGFkTHhYZVRlQXZjbFNXNnhKc3ZOb3pEQ2p2UUZVd0lXLVBkLVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "2024 Ethereum Facts & Figures for Nonprofits - The Giving Block",
        "content": "What is Ethereum, exactly? It’s one of the oldest and most popular blockchains in the crypto sector. Ethereum is also the name of its native token, which is abbreviated as “ETH.”\n\nA growing number of nonprofits know that donating ETH is a popular way to give back—making ETH donors a major force for good in the Crypto Philanthropy movement.\n\nAs the crypto bull market picks up momentum, there’s never been a better time to ask for ETH donations. Since “crypto” can feel overwhelming at first, we’ve gathered up some essential facts and stats about Ethereum for fundraisers and nonprofit professionals."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQMkdJd0YxeHlNdTg1OHMwTjhCZkxNTmM2OEtlYkxpaDE4dkdhRFpiM2VuUTNJQW9UbGxYaDZUdnVMRlZYOUVJeWkzNTM0SUZwaENKOWsxMjRtNHZXTTlYdVRBSXlxVmdGdF80OVFuSHBOQXJHWXhsWDNJaENRSVp3OWdNb0ZWSkhi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "What Happened in Crypto Today: Are Ethereum ETFs in Trouble? Analysts Are Losing Faith - Yahoo Finance",
        "content": "What Happened in Crypto Today: Are Ethereum ETFs in Trouble? Analysts Are Losing Faith\n\nThis week in crypto felt like we all got roped into a real-life Squid Game. The high-stakes challenges just kept coming at the community from every angle.\n\nIt started off with Bitcoin hitting a fresh new all-time high of around $73,000 last Thursday. The community was euphoric, dreaming of life-changing riches as the OG coin blasted through resistance like it was nothing.\n\nSource: BTC price page\n\nBut then, brutal reality struck. BTC retraced all the way back down to $63,000 as an aggressive sell-off neutralized the epic rally in a heartbeat.\n\nAs the market was trying to process the price chaos, a major drama erupted on another front. Trezor - one of the most trusted names in the crypto security game - got its social media account compromised. Their X account was used to shill a fake \"TRZR\" token sale in what felt like a cruelly personalized variation of the Red Light/Green Light game.\n\nAnd just when we thought things couldn’t get worse, the SEC made a move (well, not really!). Those awaiting rulings on the proposed ETH ETF applications got slammed as the SEC elected to kick those all-important decisions down the road yet again with delays.\n\nIn the midst of this password-pocalypse, the crypto news cycle kept on spinning with more major players making power moves. So let’s round up the top crypto stories!\n\nHere's a TLDR of the top headlines:\n\nLet’s get into the details of each of these stories!\n\nWe Hope You Didn’t Fall for TRZR…\n\nYesterday, things went south in the world of wallets - and it all started with one of the most trusted names in the hardware wallet game.\n\nOn March 19th, none other than Trezor, the cryptocurrency hardware wallet firm that's sold over 2 million devices worldwide, fell victim to a major security breach. And trust us, it wasn't pretty.\n\nAccording to reports, Trezor's official account on the bird app was hacked in what's suspected to be a SIM-swap attack. And once the attackers had control, they wasted no time in pushing an elaborate crypto scam.\n\nThe compromised account started promoting a fake token presale for \"TRZR\" token on the Solana blockchain.\n\nHow much money did its followers lose? Did Trezor make any official announcement following the incident? Read the full story!\n\nAnother Big Move by BlackRock\n\nThe world's largest asset manager has just filed with the SEC to launch a tokenized asset fund. And we're not talking about some small-time operation here – this is a big move from one of the most influential players in the finance game.\n\nStory continues\n\nAccording to the filing, BlackRock's new fund will be called the \"BlackRock USD Institutional Digital Liquidity Fund,\" and it'll be registered in the British Virgin Islands.\n\nBut here is the problem - if you want to get in on the action, you better have some serious cash to throw around because the minimum investment is $100,000.\n\nOn the bright side, if approved, we will probably see trillions pouring into tokenization and RWAs soon! Read the full story!\n\n$100M Web3 Gaming Fund?\n\nAnother day, another blockchain gaming investment fund, right? 🥱\n\nThis time it's Immutable, Polygon Labs, and VC firm King River Capital teaming up to launch a $100 million \"Inevitable Games Fund.\" Sounds impressive on paper, but what's in it for the average crypto degen?\n\nThey've already secured backing from big names like Abu Dhabi's Alpha Wave Ventures and Mike Arrington's family office. Moreover, the fund has its hands in a few buzzy gaming projects like Pixelmon and Guild of Guardians.\n\nBut at the end of the day, it's just another VC money pit...unless there's something truly game-changing in store.\n\nMaybe this trio has cracked the code on delivering an actual fun and worthwhile Web3 gaming experience? One that doesn't feel like a cash grab or tech demo, but an innovative blend of gaming and crypto that hasn't been seen before? Read the full story!\n\nMatter Labs Makes Moves\n\nIt's time to talk about a power move in the world of layer-2 scaling solutions and institutional finance.\n\nMatter Labs has teamed up with the digital asset bigwigs over at Sygnum Bank to tokenize $50 million of their treasury reserves. That's right – Fifty. Million. Dollars.\n\nBut wait, there's more! This tokenization extravaganza isn't just some random crypto flexing. Nope, these funds are being tokenized onto the very blockchain that Matter Labs built – zkSync itself.\n\nNow, for those of you who aren't familiar with the world of traditional finance (or \"Trad-Fi,\" as we like to call it), these tokenized funds will represent Matter Labs' investment into the Fidelity Institutional Liquidity Fund. And we're not just talking about some fly-by-night operation here – this Fidelity fund is an open-ended money market behemoth.\n\nFeels like RWA and tokenization are in line to be the next big trend to follow. Read the full story!\n\nSEC and ETH ETFs\n\nThe SEC has decided to keep us all in suspense a little while longer by delaying its ruling on the proposed spot ETH ETFs from Hashdex and ARK 21Shares.\n\nAccording to the SEC's announcement on March 19th, the final decision on these ETH ETF applications has been pushed back to late May, leaving the crypto community on the edge of their seats for at least another couple of months.\n\nIt seems that the market analysts over at Bloomberg are starting to lose faith in the prospect of these ETFs getting the green light. Yep, you read that right – even the seasoned experts are starting to doubt the SEC's willingness to play ball.\n\nWeren’t Bloomberg analysts too optimistic about ETH ETF approval in May? What happened? What did they say? Read the full story!\n\nPopular Game Developer Goes Web3\n\nThe masterminds behind iconic franchises like Final Fantasy and Kingdom Hearts are diving headfirst into blockchain gaming. And they're not just dipping their toes in the water – Square Enix has formed a partnership with HyperPlay, a Web3 games platform built on blockchain.\n\nThis collaboration isn't just a handshake deal – Square Enix made an undisclosed investment in HyperPlay, with the goal of expanding and scaling the platform's game store offerings.\n\nAnd as if that wasn't enough, Square Enix is also set to launch \"SYMBIOGENESIS,\" an art experience based on the popular cryptocurrency wallet MetaMask, on the HyperPlay storefront. Read the full story!\n\nThat’s a wrap! See you tomorrow with more crypto stories."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBYeGptOWVmRURGYUV4QVhYdDBFYXZZTG12UUVNTkFibjBDYWNQaVlXVW9TYWxEVjNSXzk5djQzVUxmUkFwaTMzdi1oaTUxaUpSSzJGR2lEOWk3YXRPNGd1NnRKZTZnbExlT3pzM3RoUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation ditches ‘warrant canary’ - Protos",
        "content": "CoinDesk initially reported, and a Protos review has confirmed that the Ethereum Foundation removed a ‘warrant canary’ from its website on February 26, according to a commit to its GitHub repository.\n\nA warrant canary is a symbol or piece of text that states the entity has not received a certain type of inquiry. By removing the canary, the entity can signal that it has received outreach from authorities. The text that was removed from the Ethereum Foundation website appears to have said:\n\n“The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a way which requires that contact not to be disclosed. Stiftung Ethereum will publicly disclose any sort of inquiry from government agencies that falls outside the scope of regular business operations.”\n\nThe merge request corresponding to this change on GitHub further notes that the foundation “received a voluntary enquiry from a state authority that included a requirement for confidentiality.”\n\nRead more: Ethereum’s Dencun causes ‘Blast’ layer 2 outage\n\nIt is important to note that the request is explicitly described as a ‘voluntary enquiry,’ and it’s not clear what ‘state authority’ may have sent in this request.\n\nThe regulatory status of Ethereum in the United States has been thrust back into the spotlight with the United States Securities and Exchange Commission (SEC) considering the applications for various spot ether Exchange Traded Products (ETPs).\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQS3lxYkhQdnVSdVQ2eTNWcm9NdnNmaWxRMTdnMTNjdHNJeDhEUF9sMWlOSGVURVctOTl4ak8tNzBlYjdzQWMtbzQ2STNiRFpLOEFkYWNiOEo2RVNXTmw0Znd3MTJsNmlCeU9sRWhvUWt0aG1yN2xWSEd3LUNQeEVXNlJIbjVZeE81d2ZsV0R0NFRlckZhbWx6NWdUTEU1QVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Why some in crypto don’t want Ethereum ETFs to win approval — yet - DLNews",
        "content": "Bitwise CIO Matt Hougan says it would be good for crypto if the SEC delays approval of an Ethereum ETF until December.\n\nThe comments come as market watchers say odds of approval in May are dwindling.\n\nBitcoin ETFs have smashed expectations, bringing in a whopping $12 billion in inflows in only a few months.\n\nOne expert suspects BlackRock may even withdraw its pending Ethereum ETF application.\n\nHopes are fading that the US will soon greenlight spot Ethereum exchange-traded funds. And Bitwise’s chief investment officer said that’s a good thing.\n\n”Wall Street, traditional finance just started ingesting this giant thing called Bitcoin,” Matt Hougan, CIO at the asset manager, said on a panel Tuesday at the Digital Asset Summit in London. “We need another eight or nine months of digesting Bitcoin.”\n\nHougan said on X after the event that his comments are controversial as hype for an Ethereum ETF lingers.\n\nVanEck is the first Ethereum ETF application on the Securities and Exchange Commission’s pile. The regulator is due to decide the outcome of the application on May 23.\n\nHougan’s surprising take comes as market participants look to Ethereum after Bitcoin became the fastest-growing ETF sector since the SEC approved them in January.\n\nWith $65 billion in trading volumes this month, Bitcoin’s inflows have shattered expectations, bringing in $12 billion.\n\nBut hopes for its Ethereum counterpart are dwindling: Bloomberg Intelligence analysts this month lowered their odds of a May approval to just 35%.\n\n‘Good for the industry’\n\nIf the SEC does push back that deadline to December “that will be a net good for the crypto industry and ultimately, for ETH ETF flows,” Hougan said at the event.\n\nJoin the community to get our latest stories and updates\n\n“Spot Ethereum ETFs will gather more assets if they launch in December vs. if they launch in May,” he added on X.\n\n“I tend to agree,” Bloomberg Intelligence analyst James Seyffart wrote in an X repost of Hougan.\n\nSeyffart reiterated his bearishness for a May 23 nod: “The SEC hasn’t engaged with issuers on Ethereum specifics,” unlike its approach to its Bitcoin ETF counterparts.\n\nBitwise doesn’t have an active spot Ethereum ETF filing before the SEC.\n\nDifferent this time\n\nJake Chervinsky, chief legal officer at Variant Fund, said on X that one key difference between the Ethereum and Bitcoin applications is that the SEC doesn’t face the legal pressure it did with Bitcoin ETFs.\n\nIn August, a court victory by Grayscale against the agency “basically forced it” to approve the ETFs, Chervinsky wrote.\n\nAdding to the pressure: A letter drafted last week by two US senators urged the SEC not to approve any other crypto-based exchange-traded products.\n\nThe letter shows “buyer’s remorse” following the success of spot Bitcoin ETFs, Bloomberg Intelligence analyst Eric Balchunas said.\n\nHe added that that pressure is now part of why he and his colleagues are pessimistic that Ether ETFs will be approved.\n\nPossible BlackRock withdrawal\n\nChervinsky earlier this month cited “political blowback” suffered by the SEC surrounding spot Bitcoin ETF approvals as a sign the agency may ask BlackRock and other Ether ETF applicants to withdraw their applications.\n\nBlackRock and the SEC have a “collaborative relationship,” so BlackRock may withdraw its Ethereum application, Chervinsky said.\n\n“I bet they will,” he said.\n\nIn an email to DL News, BlackRock declined to comment on its active filings with the SEC.\n\nTyler Pearson is a markets correspondent at DL News based out of Alberta, Canada. Got a tip? Reach out at ty@dlnews.com."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSHVGd0lsWm1RbUNleGNmdzlkbHNtcThzWTk3WDd2UWtEeGgxS3oxMGpSXzMwQ21PMWtwczV6OHRWX1g5U0ZqbWpaZzlMUW1WVjg4V2NiQk1tclZ3eXVBanJTNERlclJ2NWZhU2VnT1REZ3pLV2FkcFNKbzdlSkNSRXdVRktkZkZxM0VkakRvZ3d0eGFPb2xXc1ZkWlVuVGVtWWJrckFzWFFqVFBPanZxR9IBtgFBVV95cUxQM3loYlNOTFZiZnRYSGNka2MtdUphRzJXVG9RS2NmN08xTXVOSnRiVl9Yd3dtTW1RUlpHNHBjU280VmlkNjZIZGVEdFdhT3RrMmF6VUxRLVJscEJtQ05VUE5IaV83U2xET3NGSUkzYjNTc0xTU0pUMmhFRXctOHRzZWZHNkxDYnFtaVp5bm4tMUM3NFZFMUMtRHBGZERkUDI2ZWNOWjRJSXdUMTZYdVhXUE9FdHVBZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ether Tumbles 6% as ETH ETF Hopes Dim Amid Regulatory Probe Reports - CoinDesk",
        "content": "Designating ETH as a security could complicate efforts to create ether ETFs in the U.S. The SEC has a May deadline to decide on approval. An analyst at Bloomberg Intelligence on Tuesday said he doesn't expect such a fund to get approved by May, given the regulator's lack of engagement with potential issuers – a contrast to the active conversations around spot bitcoin ETFs before they got the green light in January."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPNE1CcERCZS1lUTlCbUVlVjJRRUZ1YlNRSkpQRDJSeUJYRGNHQWJVM2ZtLS1TOXA5amhHRWtvMjBKcFJadkQ0b3F3YlZVRF8xY3pDQk1IdFh6bVBFRFV2Q1RReEpaZk1GVjFpSGlpZUY1SUlkcXVHRmNXdkZjMllZQ0NGWG84SFBvRWtKb0JiTm0yOUNKYTY1TGVNWHpfdE0weFhZWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC’s reported move to brand Ether a security called an ‘excuse to not approve’ ETF - DLNews",
        "content": "Fortune reported the SEC sent subpoenas to three companies as part of probe of Ethereum Foundation.\n\nCrypto lawyers say it could be pretex to deny Ether ETFs.\n\nNews roils crypto industry as long simmering categorisation of Ethereum heats up.\n\nThe US Securities and Exchange Commission is attempting to classify Ether, the world’s second-largest cryptocurrency, as a security, according to a media report published Wednesday.\n\nCiting unnamed sources who said they feared reprisal from the SEC, Fortune said at least three companies have received subpoenas seeking information related to the Ethereum Foundation, the Swiss-based nonprofit that contributes to the development and promotion of the Ethereum blockchain.\n\nBut attorneys who spoke to DL News said the SEC’s classification of Ether as a security would have little real-world impact unless it was backed up by US courts.\n\n“The only thing that would matter is if they get a final, binding judgement from a court of competent jurisdiction, and even then I believe they would have a very hard time enforcing that in any practical way, beyond just charging the Ethereum Foundation a fine,” crypto attorney Gabriel Shapiro told DL News.\n\n“But it could give them an excuse to not approve an ETH ETF, which is likely their biggest objective here.”\n\n‘Voluntary enquiry’\n\nThe news that the SEC is investigating the Ethereum Foundation was preceded by reports from CoinDesk and The Block that said the Foundation had received a “voluntary enquiry” from an unnamed “state authority.”\n\nSEC Chair Gary Gensler has repeatedly said he believes Bitcoin, the original cryptocurrency, is a commodity like gold or wheat.\n\nBut he has remained noncommittal when asked whether Ether should be classified as a commodity or as a security, which is subject to more stringent and costly oversight.\n\nJoin the community to get our latest stories and updates\n\nWednesday’s reports suggest he has made up his mind.\n\nThe SEC has requested documents and financial records that detail the companies’ dealings with the Ethereum Foundation, according to Fortune.\n\nEther was down 0.5% over the last 24 hours in late afternoon trading UK time on Wednesday, according to CoinGecko.\n\n“[The] SEC has been pretty transparent that it informally thinks ETH is a security,” said Matt McGuire, a former senior prosecutor for the attorney general of Virginia and general counsel at Violet, a crypto identity platform.\n\n“It’s not surprising to me to read that they’re issuing a lot of subpoenas gathering information, but doesn’t tell us exactly what they’ll do with that information.”\n\nLightning rod\n\nThe investigation began shortly after Ethereum’s transition to a Proof of Stake “consensus mechanism” to tend its blockchain network, according to one source cited by Fortune.\n\nCryptocurrencies issued by blockchains that rely on Proof of Stake, or PoS, technology to confirm and order transactions could be classified as securities, Gensler has previously said on several occasions.\n\nSince taking the helm of the SEC in 2021, Gensler has become a lightning rod for criticism in the industry after the commission sued players large and small for alleged violation of securities laws.\n\nMost notably, the SEC sued three of the world’s largest crypto exchanges: Binance, Coinbase, and Kraken.\n\nThe SEC accused them of selling unregistered securities such as Solana’s SOL, Polygon’s MATIC, Cardano’s ADA, and several other tokens.\n\nThe industry has treated the crackdown as something of an existential crisis, arguing that applying 90-year-old securities laws to cryptocurrencies would amount to a death sentence given their unique features and the cost of complying with government regulations.\n\nEther ETF in the balance\n\nThe news comes as traditional financial institutions seek the SEC’s approval of a spot Ether ETF in the wake of the release of Bitcoin ETFs in January.\n\nBut hopes for its approval have been dwindling: Bloomberg Intelligence analysts this month lowered their odds of a May approval to just 35%.\n\nThose odds fell from 25% to 14% Wednesday on crypto prediction market Polymarket.\n\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can contact him at aleks@dlnews.com."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPVkJxT1lzV0FneHFmcnA4Ymp6eldYY2pCQXNLSjgtRExkSGo1d2Y4aG0ybzR1Z0J1RG4tNTZkS0pORzJCYjlXWXNqR29JbE1vVFBwOGN4QS01ZjdabHJBa3VXb2NBUnRUc2NmODUyUXBwTXdEaHlTeDd6NFEtNURkc1FvTUItSDI3ZUNhT9IBkgFBVV95cUxPcG1GbnhDd1ZlUzcwTkVXbHJPRlRyUEh2aXlydTY3Yy1YY09oMS1ZTEJpLTlMLUJ3YU9lZUtHWWNJUDRlZjZueTNPaFYwbzhueUw2dzREVHRoYzBGV21yTEVnajRGRVlmampIRUpPUmFjeXd4bFJ2YXdwLXNHZWFjVGp0TEt4TXV4eEZ6Y2hnQTlrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana Leapfrogs Ethereum on DEX Volume - CoinDesk",
        "content": "At press time, the top trending tokens for the past 24 hours on the DEX Screener were from Solana. Such has been the speculative frenzy that 2,300 meme coins came into existence in a single hour on March 13 and the supply of stablecoins on Solana hit a multiyear high of $2.80 billion."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQTVJvc2tuWUF0bldWdVlZbERWemZ2Q2R1ZzhsVGx6WXFEZVFoVWo2c2ExZUlSVnMyZWhicTNWdE5ZUWRiT2xpMmdwYmVzUDEyVG5JRzVxWE44YVgxaThNWlE4alVmeHNYWDJHWVNIRG14ZTJXc2FibW1NdmtEWG1BNU5waFZUMVVnOXZfSTVsbzI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Fidelity Updates Ethereum ETF Application To Include ETH Staking - Yahoo Finance",
        "content": "Fidelity Updates Ethereum ETF Application To Include ETH Staking\n\nFinancial services giant Fidelity plans to stake a part of the ETH if its spot Ethereum exchange-traded fund (ETF) application gets approved. This would allow investors in the ETF to earn additional income from staking rewards.\n\nIn an amendment to its ETF application filed with the U.S. Securities and Exchange Commission (SEC), Fidelity stated that it may stake part of the fund's assets through one or more staking providers. Fidelity did not disclose which staking providers it would use.\n\nStaking is a process that allows cryptocurrency holders to earn rewards by locking up their coins. Staking helps to secure the blockchain network and validate transactions.\n\nFidelity's move follows similar announcements from other fund issuers, including Ark 21Shares and Franklin Templeton. All three firms are seeking to launch spot Ether ETFs that would allow investors to gain exposure to ETH without having to buy and store the cryptocurrency themselves.\n\nThe SEC has yet to approve any spot Ether ETFs. However, Fidelity's application is one of eight that are currently under review by the agency. The SEC has a final deadline of May 23 to approve or deny these applications."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMGI4MVNmMWxxbXlXUU85NGg2WnFCQkJDRGQySURBUkpoQi1yZk1CQ0xHeVpBZEMtUGU4ZjFFOGp6WDBzX1hWaHI5WmxKTlRhdUdDWXZodENEa3p6TmRPRk5zdnFVWnRxQlVQNk8zYlR0X0drM29jekhCSkZEelBtSkVobHNHbnkyZnJpa0hmNU9qRF85cXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock launches $100 million tokenized asset fund using Ethereum - CryptoSlate",
        "content": "BlackRock, the world’s largest asset management firm, has created a new tokenized asset fund, according to a March 19 SEC filing.\n\nThe initiative — dubbed the BlackRock USD Institutional Digital Liquidity Fund — is registered in the British Virgin Islands and developed in partnership with San Francisco-based Securitize, a company focused on asset tokenization.\n\nThe technical details of the fund and which asset classes it aims to tokenize were not disclosed in the filing and remain unclear. On-chain data shows the fund has been seeded with an initial capital of $100 million USDC on the Ethereum blockchain.\n\nThe companies have yet to make a public announcement and did not respond to a request for comment as of press time.\n\nRWAs\n\nThe establishment of the BlackRock USD Institutional Digital Liquidity Fund is reflective of the increasing interest in the tokenization of real-world assets. This emerging sector aims to combine the capabilities of digital assets with traditional finance to streamline the settlement process and enhance transactional efficiency via blockchain technology.\n\nThe market responded positively to the announcement of the fund, with a notable increase in the value of ONDO, the native token of Ondo Finance, a platform that facilitates the tokenization of real-world assets.\n\nThe token was trading at $0.5 as of press time, up 12% over the past 24 hours despite the wider market crash, according to CryptoSlate data.\n\nWith this new venture, BlackRock has positioned itself at the forefront of integrating digital assets with traditional financial services, potentially setting a trend for more institutional investments in blockchain technology.\n\nBlackRock’s crypto journey\n\nThe Digital Liquidity Fund is the latest step in BlackRock’s broader journey in the digital assets industry, following the introduction of its spot Bitcoin ETF — IBIT — in January. The ETF has seen record-setting performance since its launch and rapidly attracted over $15 billion in assets under management.\n\nThe firm also has an Ethereum ETF application in the pipeline and is considered to be bullish on both crypto and the underlying blockchain technology that allows tokenization.\n\nBlackRock CEO Larry Fink recently highlighted the strategic importance of BTC and ETH ETFs as precursors to wider adoption of tokenization in the financial industry. He said these products would open the door to a significant shift towards incorporating digital assets into conventional financial practices.\n\nMentioned in this article"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOOTdwdTZ4UnU0eWVIWFdHVUM5M25GOHg2c3BMUnNzYTQ5ZTBxRGpsQTVBUXJta3pFa3JmQzVvaDJMVzg5LXpLd0FDZWlPT1p6dXhjcnU2YXI5Y1hUcXdrWk13NkdQZlpocklReXhKSExqWUZQaUlLNF85VkFSTExoanA5dnduaFRrRXlKUFM4ZmtNY0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Looks to Add Staking in Proposed Spot Ethereum ETF - Unchained",
        "content": "Grayscale Investments plans to add staking to its proposed spot Ethereum ETF, following a similar move from Fidelity Investments earlier this week.\n\nGrayscale Investments says that having the ability to stake ether would allow the fund to mitigate inflationary pressures and preserve value for shareholders.\n\nGrayscale Investments has included a provision to stake ether in its application for a spot Ethereum exchange-traded fund (ETF).\n\nIn a preliminary proxy statement filed on Tuesday, Grayscale put forth four proposals in a consent solicitation statement for its proposed Grayscale Ethereum Trust (ETHE) — a close-ended ether fund that it intends to convert into an ETF if approved.\n\nOne of the four proposed items included the ability for the fund to stake ether through the trust in a Proof-of-Stake validation protocol.\n\n“We hope you share our view that these amendments both modernize and simplify ETHE Shares for the ultimate benefit of current and future ETHE shareholders,” wrote Grayscale CEO Michael Sonnenshein.\n\nThe provision follows a similar one filed by Fidelity Investments in its application for a spot ether ETF, which the firm amended on Monday.\n\nMeanwhile, the outlook for a spot ether ETF being approved has started to look less promising, with Bloomberg ETF analysts now predicting that the U.S. Securities and Exchange Commission (SEC) will likely reject all applications in the pipeline.\n\n“We haven’t seen signs of SEC engagement with the issuers on this topic and we would have expected to see more substantial signs of interactions between the SEC and these issuers by now if the SEC were planning to approve,” Bloomberg ETF analyst James Seyffart said in an email to Unchained.\n\nThe overwhelming demand for spot bitcoin ETFs following their approval aided bitcoin’s push towards a new all-time high, and it is fair to assume that the price of ether might follow a similar trajectory if spot ether ETFs were to be approved. However, the SEC’s stance on the status of ether as an asset is markedly different from its view on bitcoin.\n\nSEC Chairman Gary Gensler has stated on a number of occasions that bitcoin is the only digital asset that can be considered a commodity, and “everything other than bitcoin” could be classified as a security.\n\nIn April, Gensler avoided giving a direct response to a question from House Financial Services Committee Chair Patrick McHenry on whether Ethereum was a security or a commodity."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOLVhMWWdrUmhwN19SNjZEYzYwX2s4X1hmMDZ3Y1F0M1ozcW94WUlBRTR1NHRNUjRuUDgxV3RLT0lsRG5SU2NMay1PdC1HOGMxczQ5dnVIazFHOHdxaDNFMXJnU2pyWUdUUGVVYUFqSTFFclNpbjAwVUpUSDlnUDZPWjJaY1FqcVFHTVhHUnNaWV9RRmY1aWVrV2toUzVuUThST080TFRseEphN1JOZFFyVVRRbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC delays lower expectations of Ethereum ETF approval by May despite staking additions - CryptoSlate",
        "content": "The US SEC has delayed the approval process for several highly anticipated Ethereum exchange-traded funds (ETFs), recent regulatory filings show.\n\nThe delays affect proposals from investment firms, including VanEck, Ark Invest, Hashdex, and Grayscale — which has added a staking component to its ETH ETF application along with Fidelity — sparking discussions about the future of crypto ETFs in the US.\n\nLower odds of approval\n\nBloomberg ETF analyst James Seyffart, who has been closely monitoring the developments, expressed a shift from his previously cautiously optimistic outlook regarding the approval of Ethereum ETFs.\n\nHe noted that the SEC’s lack of engagement on Ethereum-specific issues contrasts sharply with their approach to Bitcoin ETFs in the previous fall, dampening hopes for a positive outcome by the crucial May 23 deadline.\n\nSimilarly, Eric Balchunas recently pointed out that the absence of bullish signs and sources that were present before the Bitcoin ETF approvals significantly reduces the chances of a favorable decision for Ethereum ETFs, estimating the odds at 35%.\n\nThe conversation extended beyond the ETF delays, touching upon the broader regulatory environment for cryptocurrencies. Some suggested the SEC might insist on a court order before approving Ethereum ETFs, citing potential differences between Ethereum and Bitcoin in terms of their designation.\n\nHowever, Seyffart disagreed with the notion that Ethereum could be classified as a security, a designation that could fundamentally impact its regulatory treatment.\n\nThe discussion also ventured into the realm of potential outcomes and strategies. Seyffart speculated about the future of Grayscale’s Ethereum futures product and its implications for potential legal challenges against the SEC’s decisions.\n\nStaking in ETFs\n\nMeanwhile, both Fidelity and Grayscale have added amendments to their Ethereum ETF applications to include a staking component.\n\nStaking, a fundamental aspect of Ethereum’s proof-of-stake (PoS) model, involves the locking up of digital assets to support the network’s security and functionality, offering participants rewards in the form of additional crypto.\n\nGrayscale’s proposal, like Fidelity’s, allows the ETF to allocate part of its holdings to staking through selected providers, potentially including affiliates. The move is designed to explore the income generation possibilities within a regulated financial framework, with the ETF expected to receive ether tokens as network rewards, which could be considered income for the fund.\n\nHowever, this addition arrives amid increased scrutiny from US lawmakers, who have recently urged the SEC to halt the approval of new crypto-related ETFs due to concerns over investor risks.\n\nAs the May 23 deadline approaches, the crypto community remains on edge, awaiting further developments.\n\nEthereum Market Data At the time of press 2:25 am UTC on Mar. 20, 2024, Ethereum is ranked #2 by market cap and the price is down 6.6% over the past 24 hours. Ethereum has a market capitalization of $384.94 billion with a 24-hour trading volume of $33.96 billion. Learn more about Ethereum › Ethereum $3,205.79 -6.6% Crypto Market Summary At the time of press 2:25 am UTC on Mar. 20, 2024, the total crypto market is valued at at $2.36 trillion with a 24-hour volume of $184.43 billion. Bitcoin dominance is currently at 52.29%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNVlFOMF9kMTFYeXBoUHUwN25VUzZ0cmZtYlNpX09YOG5oelNhOS11SWxqSGswNktISnYwSG42TUdCWHBQVjdBSE5PQW5vcnpjREQ0VUdhWTZZWXI0UG9iUW5aX2VlNG0xSVAxOXJqRmFtZHJSOS02OVFUenAyOWd1N1RvTVdZYXY3NzlMNy0weUxuSmlxSHdpbXJRZDBxSGE4a0dRa0F1T0JDNHhwdmgyOFFFOGlsQ0pxUE44VG5ZY3VuZzBpMXZibXo1ZzJVMm_SAdQBQVVfeXFMT2hhNWhZSnVUN0N3WUN5Y1dZSGE2ckRSLWlxUExFYVY2QUJwOE9sdmhjX0FtRTE1OHlFemh5cGRueE9KQ0ozZm1lTlRWRWhBN2VJSkdQQkgzVjRSa29aMHNMbW9rY2U0NEVQQWRhemVEWDJSRVJoNXZsOVJmaGc1SG1Bb2dRbTVjc1FrbkxyMUd0bGhkMjlQcTNwTE1uV21Gb1ZiR1RkdGMwci1zVzNGRGtnZi1LRUtRYUpQeXVYY29CbEtmSlZ6cC1UbFkzb2lFSnVWai0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "NBA All-Star Tyrese Haliburton Talks Ethereum and Potentially Receiving Salary in Crypto - CoinDesk",
        "content": "\"I heard of bitcoin a few years back. Spencer Dinwiddie was the first guy in the NBA to ever say anything. This is when I was in college,\" Haliburton said. \"The first crypto I got involved with was Ethereum because that was the blockchain I was using for NFTs, so that's why I've heavily invested in Ethereum. I want to get into bitcoin because it's the blue chip of crypto."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQbmota29qYk52a1dUbzZkRmdib0RYN2xsUUN0Y0FPY1lBbVBISGhYemJzdWtJTXRYV0FvMkFVbHRIQnc2U0FPS2U3emNIUWlZbmh4UzV4MXlBdG1FMmlXeDE0bWpOdVdvU05GeWNoMEpQbTlmYTVFTmVHblBGLTc3U0lRVGh0TTJpNXc3YnozLUVqVExPUDhJeGxfZHprM25wV0drLWJ0b0sydDFGcjB5NlJWdU1uSWprd0tQT0lpZnhUcDQybHlFTS1OVXR1YmPSAdQBQVVfeXFMT2JRNUozalNuZHFZZlRGUElKbkItbXN0SjhaTjZIMXF4SmtaaDduTE1kNFc4WjFzdjlMbC0zUk1rd3p1Nnc2Z0pYUUk3QV9tYmxXTjVBVzh1dmhhQW5Dd2Q1dFZPcjFZVnN4Tjd6VThEdnQwT3ZDQm1TUjROWk5SZ3J2alB6WjUtR0FOS0ppTDNrdWE3Rk1fbG9KRldJVkRJSjgzbVJNakJCa3ZSZ3FFb21jZnJuQm5SOWo4Zm41RkN2ZWJNdm1vWGNPaDZSTGx0dXZtQzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Starknet, an Ethereum Layer 2, Plans 'Parallel Execution' to Mimic Solana's Speed Feature - CoinDesk",
        "content": "The feature will go live as part of an upgrade set for the second quarter, allowing Starknet to \"process a greater number of transactions simultaneously, resulting in improved throughput and faster L2 finality,\" according to a press release distributed by a representative of the developer StarkWare. It is part of the 2024 road map released Wednesday."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQaEJZeUJ6UHA3OFdvWVo0UGVqUXEzMjByaFlKcnB1WkZBd1lXRkQzb3RBRjliMGwxTHdBUlc3WVZqQWhIandkeTV5WUtzOEJjcnZtT0lTc2pXUzFHV19nMUhqWDVsM04zUG1iNTVFN2Ytck55WmlIWVJBNUU3Q2FSZ1JIcFVlcXRjYWtmV1FlZXMyb0N0aFdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC investigating Ethereum Foundation in bid to declare ETH a security - CoinGeek",
        "content": "Homepage > News > Business > SEC investigating Ethereum Foundation in bid to declare ETH a security\n\nGetting your Trinity Audio player ready...\n\nCracks are appearing in the Ethereum Foundation following reports that the U.S. Securities and Exchange Commission (SEC) is probing the group ahead of plans to label the ETH token an unregistered security.\n\nOn March 20, sharp-eyed observers noticed a small but significant change in the Ethereum Foundation’s GitHub repository that was made on February 26. Gone from the site was a block of text declaring that the Foundation “has never been contacted by any agency anywhere in the world in a way which requires that contact not be disclosed.”\n\nThe change was made by developer Pablo Pettinari, whose description of the revision stated that the change was necessary due to the Foundation having “received a voluntary enquiry from a state authority that included a requirement for confidentiality.” A ‘warrant canary’ was also quietly removed from the Foundation site, indicating that it had been served with a subpoena or other secret government request.\n\nFortune subsequently reported that the SEC had served subpoenas on multiple companies seeking financial records and other documentation regarding their dealings with the Foundation. One of these companies told Fortune that the SEC had launched a probe into the Foundation following the Ethereum network’s September 2022 transition\n\nfrom a consensus mechanism based on proof-of-work (PoW) to one based on proof-of-stake (PoS).\n\nPoS requires Ethereum transaction validators to post a ‘stake’ of 32 ETH tokens, a sum worth around US$51,000 at the time (currently worth over US$100,000), making it a prohibitive barrier for most ETH holders to clear. The net result of this shift was that a handful of ETH whales—including many Foundation insiders who claimed large portions of the ETH distributed via the network’s controversial pre-mine—are now reaping most of the rewards for keeping the network humming.\n\nFortune claimed that individuals at three companies that received SEC subpoenas said that the shift to PoS had offered the agency ‘a new pretext’ to define ETH as a security. This isn’t much of a revelation: SEC Chairman Gary Gensler commented at the time that entities offering PoS-based ‘staking services’ represented “another indicia that under the Howey test, the investing public is anticipating profits based on the efforts of others.”\n\nGensler wasn’t alone in making this observation. In March 2023, the New York Attorney General’s Office filed charges against the KuCoin exchange for failing to register as a securities broker-dealer. The NYAG called the complaint “one of the first times a regulator is claiming in court that ETH, one of the largest cryptocurrencies available, is a security.”\n\nThe NYAG explained that “ETH’s development and management is largely driven by a small number of developers who hold positions in ETH and stand to profit from the growth of the network and the related appreciation of ETH … [Ethereum Co-Founder Vitalik Buterin] and the Ethereum Foundation retain significant influence over Ethereum and are often a driving force behind major initiatives on the Ethereum blockchain that impact the functionality and price of ETH.”\n\nPrior to the network’s launch, Buterin himself stated publicly that “if you’re investing in Ethereum, I would say you’re investing in the team and community.” More recently, former Ethereum insider Steven Nerayoff offered evidence showing that Ethereum Foundation members understood from the start that ETH was a security.\n\nNerayoff released emails showing Ethereum Co-Founder Joseph Lubin asking lawyers for a legal opinion that would leave insiders “well insulated from criminal liability regarding securities laws.” This acknowledgment of ETH’s security status helps explain why Lubin and other insiders did such a full-court press on Gensler’s predecessor, William Hinman, who in June 2018 controversially declared that ETH was originally a security but then “become something other than a security.”\n\n(g)ETF(*cked)\n\nThe SEC has yet to comment publicly on the Fortune report other than to say it doesn’t comment on possible investigations, whether they exist or not. The ETH token suffered a momentary plunge as the story broke, but has since recovered its losses and then some.\n\nRegardless, the Ethereum community is up in arms over the mounting suspicion that the SEC wants to label ETH a security in order to justify the SEC’s refusal to authorize new ETH-based exchange-traded funds (ETFs). Rightly or wrongly, the launch of multiple BTC-based ETFs in January has been credited with that token’s otherwise unwarranted spike in fiat value, and ETH holders want to artificially pump their own bags in the same fashion.\n\nFoundation members decided they wanted in on the ETF spoils once they learned that their developer counterparts at BTC Core had been promised a share of the profits—anywhere from 5-10% for a decade—by at least two of the BTC ETF issuers.\n\nSo far, the SEC has refused to play ball, using all the procedural options at their disposal to avoid having to issue a formal decision on any of the multiple ETH ETF applications. Just this week, the SEC told an ETF applicant to cool their heels while asking the public to submit further comments.\n\nThe SEC has until May 23 to issue a decision one way or the other, but the reported lack of communication between the SEC and applicants regarding the finer points of their paperwork has been taken as a sign that ETH won’t be getting the BTC treatment.\n\nLabeling ETH a security could set up a regulatory turf war between the SEC and the\n\nCommodity Futures Trading Commission (CFTC), which currently regulates ETH-based futures contracts. One year ago, CFTC Chair Rostin Behnam told Congress that “we would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset.”\n\nThis interagency slap-fight could provoke Congress to finally set some firm boundaries between the two regulators when it comes to digital assets. But given the current Congress appears infinitely more interested in performative stunts than actually legislating, don’t hold your breath.\n\nMeanwhile, as everyone focuses on the ETF question, there is also the possibility that Gensler will use whatever information he may have gleaned via the SEC’s subpoenas to file a complaint against the Ethereum Foundation, Buterin, Lubin and countless others connected with that centralized mothership.\n\nIt’s not like there aren’t plenty of options—in terms of both the number of targets and the type of charges—to choose from.\n\nWatch: Digital currency regulation and the role of BSV blockchain"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQdk8xbndIVHlwNkh3QUtDZ0NrREpoWHhNSWRoRWtpR1owUm1YZUZBdW5rb2RaRG5ueGpadWxSbWlhYXdyd1E0S1VRVzlDNDJtNmpGcHBvQ3hFNm1ZYzFBNkRucW9Cd2NqNjBlNkhtSjBoWWpUeEkyc2FCRkt0bWRLTmJXemk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Standard Chartered: ETH Could Hit $14,000 if ETF Gets Approval - Yahoo Finance",
        "content": "Standard Chartered: ETH Could Hit $14,000 if ETF Gets Approval\n\nStandard Chartered has predicted that Ethereum (ETH) could reach $8,000 by the end of this year and $14,000 by 2025. In a research note, the bank's analysts believe that the approval of spot Ethereum exchange-traded funds (ETFs) will be a major catalyst for the cryptocurrency's price.\n\n\"Ethereum is currently between two important events that we see driving price upside,\" wrote Geoffrey Kendrick, head of forex and crypto research at Standard Chartered. \"It has just had a structurally significant upgrade, and U.S. regulatory approval of ETH ETFs is expected in May.\"\n\nKendrick also noted that the network's recent Dencun upgrade could be another factor driving up the price of Ethereum. The upgrade is expected to make transaction fees on the blockchain much cheaper. Standard Chartered's prediction is in line with other bullish forecasts for Ethereum. In January, JPMorgan predicted that ETH could reach $5,000 by the end of the year.\n\nSeveral high-profile fund managers, including BlackRock and Fidelity, have filed with the Securities and Exchange Commission (SEC) to launch Ethereum ETFs. Standard Chartered expects the SEC to approve the ETFs by the summer."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5kOVROZUNRSWJRT2xaaVpuY0xLdF85WklZcjZYQ0FqbnhfSEZoekxUeWVGQV9OT1N5TkF2WF9CSjR3TjFnenFWeWdZWFI1VGdpRnVpRkFWdldhNVplTUpsRE8tc25KUjNBenZOZFZYcXZVMDFvbW9oYkM0Vm9Zdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "What Does State Inquiry Mean for Ethereum? - CoinDesk",
        "content": "The Ethereum Foundation – the Swiss non-profit organization at the heart of the Ethereum ecosystem – is facing questions from an unnamed \"state authority\" according to the group's website's GitHub repository. CoinDesk's Sam Kessler breaks down the latest update, as well as a report from Fortune that names the \"state authority,\" as the SEC. Fortune's report also says the agency is seeking to classify ETH as a security. Watch."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPb1J4Wl81dEh0d2Jna29KUUNBX1BsSWJrbmtGUHFkUTMyY0d2QzVlMS12blpaelNCaWJwTEVEdVpZRUtaLWlkNGpDY2pjb2ppN0FIYWhSX2JZM2pBbEZ6NnlXcXhlUGF2T01jUEpiRkdOdkIxT2FlZ1NDbjJ2R1pVeTNXRHo5amlZc1FOMThFcnlzdEFQcVEzeA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Are Losing Ground Today - The Motley Fool",
        "content": "These three top tokens are seeing selling pressure build, as capital flows affect investor sentiment.\n\nToday's price action in the cryptocurrency world has been choppy, with many of the top tokens that investors watch closely seeing big declines over the past day. As of 3:30 p.m. ET on Tuesday, Bitcoin (BTC -0.63%), Ethereum (ETH -1.11%) and Dogecoin (DOGE -4.23%) had declined 3.9%, 4.9%, and 5.3%, respectively, over the past 24 hours.\n\nThese moves appear to be the result of a shifting narrative in the crypto world. With more investors now focused on the flow of funds into this asset class, more recognition is being placed on the supply and demand of capital flows into this sector.\n\nAccordingly, the capital inflows into spot Bitcoin ETFs, such as the Grayscale Bitcoin ETF (GBTC 1.49%), have become a much more pertinent focal point for Bitcoin and the entire sector in general.\n\nReports today that this particular spot Bitcoin ETF (and others) saw big capital outflows appear to be driving the majority of the move in these three top cryptos. The Grayscale ETF led the way lower, posting a $643 million outflow on Monday, with more expected to be reported today.\n\nLet's dive into this particular catalyst, as well as some other concerns that investors are pricing into Ethereum and Dogecoin right now.\n\nWhy the sentiment shift?\n\nCapital flows into spot ETFs aren't the only story, but they're the major one in the crypto space right now. With various spot Bitcoin ETFs such as Grayscale's seeing record inflows in such a short time, anticipation around a budding supply/demand dislocation in the Bitcoin market forced other speculative retail capital into the sector. For higher-risk assets such as Dogecoin, this led to what can only be described as a hype-driven rally.\n\nThere were also some recent comments from Elon Musk about potentially integrating Dogecoin further into the Tesla purchase ecosystem. We'll have to see whether that plays out or not, but it's clear that Dogecoin's primary purpose is to be a speculative trading vehicle for those willing to take abnormally large risks. In this market, that's worked out well for bulls.\n\nFor Ethereum, anticipation around pending deadlines for the Securities and Exchange Commission to review spot ETF applications from the likes of Grayscale and others continues to be a driving factor for this token.\n\nThat said, if capital outflows from spot Bitcoin ETFs continue, this catalyst could be moot. Thus, investors are undoubtedly going to get ahead of the catalyst by pricing-in expectations, and we'll likely see Ethereum trade somewhat in line with Bitcoin until a decision is handed down.\n\nWhere to go from here\n\nInvestors who decided to jump on the crypto bandwagon before this flood of speculative capital surged into the sector have certainly done well for themselves. And while we have seen some recent capital outflows from the likes of the Grayscale Bitcoin ETF and others, it's also true that these ETFs have assets under management that many thought they wouldn't at this point in the cycle. So, it's really a matter of perception right now with respect to how the Bitcoin market is finding its balance.\n\nFor Ethereum and Dogecoin, I expect to see similar correlation with Bitcoin for some time, until we see the impact of the upcoming Bitcoin halving and potential approvals of spot Ethereum ETFs. Until then, buckle your seat belts -- it's likely going to be a thrilling ride."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE55b1NxTktDREdTNzNvZzBkYzVEM3dNRmNqSTVuamNmdHdkRTluQUctdHhpTkZRdTNyVmxXMm9aUUdldjJ4SW91ekx1ejRtb1czMG5ETzRkbVBWQ1BzWF9DMGFTV3A5NGRIc0hrSTRFc0FaUi1VQi1lNnBBQ0ZMUdIBgwFBVV95cUxNUE1HVGlILTVuemF2X2R4aTZCZFQwTFUxN0hGU3RVNEc3cndEeWwxcHZyMGI4Q0ZKelVnWWI0Qi13eFltZ1REUWw4Tmp6VHFvMUljLW8yeHlfM1lZYWx2Y2cwY1hsODRuVmtGTFhKaTFrTlRoT2Y1TXJCS0tNQk1kZnBRbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "ETH Whales Cashing out Massively Amid Ethereum Price Drop - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAmid a tumultuous week for the crypto market, ETH whales have made substantial moves, cashing out millions before Ethereum's price downturn. In the past four days of market downtime, three smart traders have offloaded a staggering 26,946 ETH, equivalent to a jaw-dropping $95.7 million. Their combined profits stand at an impressive $39 million, according to data from Spot On Chain.\n\nAdvertisement\n\nThe first trader, identified as \"0xb82,\" executed a strategic move, selling 7,300 ETH for $24.4 million in stablecoins via Binance, netting a handsome profit of 22.7%, which is equivalent to a remarkable $4.59 million. Not far behind, \"0xebf\" deposited 8,870 ETH, valued at $33.1 million, onto Binance on March 16, reaping an estimated total profit of $25.3 million, an impressive 55.8% gain.\n\nLastly, \"0xa43\" sold 10,776 ETH for $38.2 million on March 15, realizing a notable $9.14 million profit, equating to a 31.5% gain.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nThese moves come against the backdrop of Ethereum's price plummeting over 11% since the start of the week. After reaching a two-year high of $4,093 last week, Ethereum faced a significant sell-off, driving its price down to $3,200 per ETH.\n\nCoinGlass reports that within the past 24 hours, positions totaling $120 million were liquidated, with an estimated 85% of them being long positions, suggesting a wave of sell-offs and profit-taking among investors.\n\nThe mass cash-outs by ETH whales amid the price drop raise questions about the future trajectory of Ethereum and the broader cryptocurrency market. Whether the main altcoin finds a foothold will largely be both the cause and the consequence of how events develop further."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOWm90Y0RGNzhmY29uMUxvTkR1Z19raUdvWWxiNllrTW53SFpMRmxUQXdUZjdNV0V1WkxKckdEQS0tUjdQM3pNY3BhYWgzUndOVlc1b2J5Mlp0bUpLY0gteWFnRTdpaXBrc1lzUmU0dzhLNHRRYkE2c0lkb1liNGJSb0hWUUlwZHp6T2NKVm9nUzBKZWgtUDJZeThxWngwNEpGaDFXQlEwUURMdHdqd3NtZnZzbEowQm03U3JrOTZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Enterprise Ethereum Alliance Announces New Leadership and Vision - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--The Enterprise Ethereum Alliance (EEA), the leading global community for enterprise blockchain, today announced the appointment of new leadership and a renewed vision for the future of the alliance at the intersection of the Ethereum ecosystem and enterprise. The announcement was made at the Momentum Event, an in-person gathering of EEA members, partners, and industry leaders, co-hosted by EEA, NYU, EY and Microsoft.\n\nThe Momentum Event kicked off with opening remarks by Yorke E Rhodes III, EEA Board Member for Microsoft, who introduced the event’s co-hosts and agenda. Rhodes expressed the goals for the convening, which showcased the latest developments and innovations in the Ethereum for enterprise blockchain space, as well as to foster collaboration and engagement among the EEA community.\n\nPaul Brody, EEA Board Member and EY Global Blockchain Leader, was announced as the new Chairperson, and Karen Scarbrough, EEA Alternate Board Member for Microsoft, as the new Executive Director. Vanessa Grellet is also joining as a new EEA Board Member.\n\nRhodes praised Paul, Karen and Vanessa for their expertise, vision, and dedication to the EEA and the enterprise blockchain industry.\n\n\"I am honored and excited to take on the role of Chairperson of the EEA, and to work with Karen and the rest of the board to lead the alliance into a new era of enterprise blockchain innovation,\" said Brody. \"The EEA has been a pioneer and a catalyst for the adoption and standardization of Ethereum-based solutions for enterprises, and I look forward to building on that legacy and expanding its reach and impact in the global market.\"\n\n\"As the new Executive Director of the EEA, I am thrilled to join forces with Paul and the EEA community to revitalize and energize the alliance and to deliver value and benefits to our members and partners,\" said Scarbrough. \"The EEA has a unique opportunity and responsibility to shape the future of enterprise blockchain, and to foster collaboration and interoperability among the diverse and dynamic ecosystem of Ethereum-based solutions. I invite everyone to join us and find a way to engage and contribute to the EEA and the enterprise blockchain movement.\"\n\n“I am excited to join the EEA Board to help bridge the gap between public blockchains and the enterprise world and drive adoption of blockchain applications in financial services and consumer use cases. The EVM ecosystem is open for business,” said Grellet. Vanessa will be sharing her perspective at the Digital Asset Summit and Pay 360 conference in London this week.\n\nBrody and Scarbrough also expressed excitement about the journey forward, given the recent surge of energy and interest in the enterprise blockchain space, driven by the second annual EEA Ethereum Business Readiness Report, the expected launch of several Ethereum-based exchange-traded funds (ETFs), and the growing demand for tokenization and decentralized finance (DeFi) solutions among enterprises.\n\nThe Momentum Event continued with a series of presentations, panels, and workshops, featuring EEA members, partners, and industry experts. They shared their insights, experiences, and best practices on various topics related to enterprise blockchain, such as scalability, privacy, security, governance, compliance, interoperability, use cases, and business models.\n\nAbout the EEA\n\nThe EEA is the industry's leading global community for enterprise blockchain working with an open, standards-based architecture and specification to accelerate the adoption of Enterprise Ethereum. The EEA's world-class team brings clarity to enterprises across an ecosystem of multiple vendors of choice and many innovative startups. For additional information about joining the EEA, please reach out to membership@entethalliance.org or visit https://entethalliance.org/become-a-member/\n\nFor more information about the EEA Momentum Event please visit: https://lu.ma/6ts0ta1l\n\nFor more information about the upcoming EEA Career Day please visit: https://lu.ma/rxnj8ye5"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPam81RGZqUWw3akd5RE5CNVBqT3dXdy1IaHBHUVA5ZW9zT2I4SDVXZ0VLSldmOGhHNGhQQXRVM1pTRmFVU2RWWkhxTDI1ci1kTzhYUklNZmF2MnpZS2FyMFBiMW5UQ3ZEM1daN0I3OTA1bGZwVWRhclJKb0lIUVdsZTRSU2xOV3RJcUZvdzl2QUZQN2hlQUtUbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Morph, an Ethereum layer-2 for app building, announces $19 million seed round - Fortune",
        "content": "Morph, a layer-2 Ethereum Virtual Machine, today announced a $19 million seed round led by Dragonfly Capital.\n\nMorph is a fully permissionless EVM L2 that uses a combination of optimistic and zero-knowledge rollup technology to enable a user-friendly option for developers who require a chain on which to build finance, gaming, social media, and entertainment apps.\n\nFrom a technical stance, Morph has focused on blockchain’s trilemma problem—how to balance decentralization, safety, and scalability.\n\n“If we want to really bring blockchain to the next step, into mass adoption, we have to find a vertical which can really create value that the end users realize—so that’s why we focus on the consumer side,” Morph cofounder and CEO Cecilia Hsueh told Fortune.\n\nMorph is designed to offer the most “founder-friendly pipeline” for projects in the L2 space, the company said in a statement. The technology is built within three key pillars: decentralized rollup technology, optimistic zkEVM integration, and modular design. Developers building on Morph have access to tools to help transition from the earliest stages of building up through a potential token listing.\n\nIt’s also the first layer-2 on Ethereum to launch with a decentralized sequencer, meaning multiple entities or nodes can participate in the sequencing process, meaning the opportunity for any single node to manipulate transaction order is significantly reduced.\n\n“The existing L2 market is focused solely on short-term gains to be able to win the next casino round, rather than building for sustainable success. At Morph, we proudly help developers to create dApps that can truly make a long-term difference and win over a mainstream user base,” cofounder and COO Azeem Khan said in a statement.\n\nThe company plans to use the fresh capital on hiring, marketing to bolster its visibility within the L2 ecosystem, and refining its technical infrastructure. Additional investors include Pantera, The Spartan Group, and MEXC, with a further $1 million raised in an angel round. Bitget, the world’s leading cryptocurrency exchange, is an original investor in Morph and plans to continue playing a role in the Morph ecosystem.\n\n“We believe Morph’s technology can be exactly what developers in the consumer vertical need to pave the way for wider mainstream adoption,” Paul Veradittakit, a managing partner at Pantera Capital, said in a statement."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNY3JYMDFBcEhtRjBfOUNiV1FWMHFLTGx1T3NGanp5dUZBTnlWVG1DcDZOUWdTZEVpX2pzRGwzM0NtS0NkY05YUE5ma1dNYVJyR2NKSlE1MnNOc1FScVB0MWtDWDdRRmp4UGswLXVhendaQmhWRFlfcWdsVDFZYkNLeEJsdDFFcnRUb1ZN0gGTAUFVX3lxTE56cmJhVEJMQ3lsTEg0U09nd1ZfR3NxdVJnbm1ESWR2UFVEbXNtcnRDU1pBTFlyN2o3bkNjdnRuN2FxZkpMYnNqLVIyRlY2U25PUGdHcFc3Z2pValM5Y1l4RkJJU0JxNHB5S212Rk9CWnU2aHhka29Nc1Q3UzhNNDAzWlhISjhjOFFONERHa1V1TThfbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "How Much Has the Ethereum Dencun Upgrade Cut Layer-2 Gas Fees? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHeralded by Ethereum developers as the technical milestone they’d been “dreaming of,” last week’s Dencun upgrade was supposed to forever alter the Ethereum ecosystem—by making transactions on its layer-2 networks exponentially cheaper and thus more accessible.\n\nOne week later, how do things stand?\n\nOn the whole, Dencun has delivered exactly as promised. Across layer-2 networks that have already integrated the software update, gas fees have plummeted to unprecedented lows, in most cases by over 90%.\n\nAt writing, median transaction fees on layer-2 networks Arbitrum, Starknet, Optimism, and Optimism-based chains Base and Zora have all fallen to one cent or below, according to data from Dune and Ethereum analytics platform Grow The Pie. That’s a 91% to 95% drop in cost for each of those networks.\n\nAD\n\nAD\n\n2 hours ago, @arbitrum's gas fee dropped by another 80%. Now you only need 0.000004 ETH (about $0.01) to complete a transaction on this chain. This is fucking insane man! https://t.co/GgEv4AbGbz pic.twitter.com/2DNZlcLjmN — Larvandweb3.eth 🦇🔊 (@Larvandweb3) March 19, 2024\n\nDay by day, those costs continue to fall—from one cent down to mere fractions of a penny.\n\nEnabling Dencun’s near-elimination of gas fees is a novel data storage solution called proto-danksharding, which is powered by blobs. Blobs allow layer-2 data to be stored on-chain for a temporary period of about a month, as opposed to forever—the only previously available option.\n\nGm to 4844, welcome to @Optimism & @base Swaps now costing 1/10 of a cent Modularity scales. pic.twitter.com/CcZPshm836 — AureliusBTC (@AureliusBTC) March 14, 2024\n\nAD\n\nAD\n\nDencun’s drastic reduction of on-chain fees has impacted not just ETH transfers and token swaps, but also heftier NFT-related transactions.\n\nOn Zora—a layer 2 network built by the homonymous NFT minting platform—the most common transactions are (expectedly) NFT transfers. Nonetheless, the median transaction cost on the network is currently 9/10ths of a penny.\n\nCompare those minuscule figures with the Ethereum mainnet, where an NFT sale currently costs $72 on average, per Etherscan. Just weeks ago, due to network clogs, that cost neared $400 per NFT transfer.\n\nThis is huge Reducing transaction fees and confirmation times on Layer 2 will open up so many more use cases for crypto. We're finally getting scalability. https://t.co/X7K3TzkMno — Brian Armstrong 🛡️ (@brian_armstrong) March 14, 2024\n\nNot all layer-2 networks are quite there yet, however. Some are taking a bit longer to integrate Dencun-related updates across their settlement contracts. Polygon, for instance, has yet to see its gas fees fully drop off; mean transaction costs on the network are currently hovering around $0.72. Polygon Labs VP of Product David Silverman previously told Decrypt that he expects all layer-2s, including Polygon, will be fully integrated with Dencun within a month or two.\n\nWhile the impact of Dencun is clearly already substantial, some critics outside the Ethereum ecosystem—and even developers within it—have noted that transaction costs are likely to rise with increasing network traffic.\n\nWhile blob-enabled L2 gas prices are very cheap right now, we can expect them to increase a bit over time as demand for blobs increases. This is expected behavior & is why 4844 is only the beginning - blobs are an evolving primitive & are part of the wider danksharding roadmap. — sassal.eth/acc 🦇🔊 (@sassal0x) March 14, 2024\n\nAnd yet, most layer-2s with slashed gas fees have already seen dramatic increases in network activity. Daily transaction volume has more than doubled on Optimism, Base, Arbitrum, and Zora in the week since the upgrade; on Starknet, it has almost tripled. Gas fees on all those networks are still currently one cent or less on average.\n\nAD\n\nAD\n\nMany L2 developers hope that such sustained drops will prompt a fundamental shift in how users engage with Ethereum—moving the bulk of routine transactions onto L2s, and away from the costly mainnet.\n\nBut recent gains of layer 2s don’t appear to be at L1’s detriment—at least not yet. Traffic on the Ethereum mainnet remains consistent with figures from the past year, according to Etherscan; in fact, it’s slightly up since last week.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPS0VuYkNJalNJZzU2YnJLTm8yRjlaTjJVa2FONHRlM1V4Y283a0RfbEM2NDlSSTE1QmIxR2RKTDVGZEVqMEwyUjNkVUFrbktoZGRUNThXNWdDNVdZYnFpU1NEal9LWUFHVzk2aGRZdzlYWW1GMkZuMVVJLTJySXBfUjJZS2FRSTRlZW0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana overtakes Ethereum on DEX volume amid memecoin ‘presale’ frenzy - Fortune",
        "content": "Solana is now the top smart-contract blockchain by trading volume, surpassing Ethereum, according to data from DeFiLlama.\n\nThe volume of tokens trading on Solana-based decentralized exchanges, aka DEXs, climbed by 67% to $21.3 billion over seven days, whereas volume on Ethereum-based equivalent exchanges rose by just 3% to $19.4 billion. Likewise, the number of daily active addresses on Solana has also spiked, rising from 400,000 to 600,000 in January to February to roughly 1.25 million on Tuesday.\n\n“A lot of the surge we’ve seen in Solana DEX trading volumes will likely come from the memecoin wave that we’ve seen over the past few weeks,” Martin Lee, a data analyst at Nansen, told Fortune.\n\nSpeculative buzz around Solana-based memecoins dogwifwhat (WIF), bonk (BONK), book of meme (BOME), MAGA (TRUMP), and slerf (SLERF) is partially behind Solana’s recent successes. On March 13, 2,300 Solana memecoins were minted in one hour, meanwhile stablecoins on Solana reached a multiyear high of $2.80 billion.\n\nIn the last 1 hour, 2,500 Solana memecoins were created. — Ram Ahluwalia CFA, Lumida (@ramahluwalia) March 13, 2024\n\nThe speculative frenzy behind Solana’s memecoins has been catalyzed by a trend called “presales” whereby tokens are sold before officially launching. A buyer sends funds to a crypto address and receives the set number of tokens at a later date. Some estimate that over $100 million worth of tokens were sent to various memecoin presales over the weekend, mainly on the Solana blockchain, CoinDesk reported.\n\n“There’s a bastion of memecoins attracting users with the lure of outsized returns: Speculation on these are likely currently driving an influx of users, but I’m hopeful that new entrants will stick around,” Philip Forte, founder and CEO of Elixir, told Fortune.\n\nThe hype of presales has grown with the success of BOME. Last week, its creator took to X to offer a presale, and the result was that early investors turned a few hundred dollars into hundreds of thousands over a few days. Meanwhile, BOME’s market capitalization soared from zero to $1.6 billion in a few days, with over $100 million in daily trading volume, CoinDesk reported.\n\nThis BOME presale meta is the worst thing to happen in this space in a while https://t.co/06cOaB48W7 — Franz (@Franz_0x) March 17, 2024\n\nBut the presale frenzy has drawn criticism from some on-chain watchers, with one X user posting: “2 years later and everyone is right back to bidding ponzis. People can do what they want with their money but sending money to a ‘memecoin presale’ that has a 99.9% chance of rugging is actually just dumb as hell.” (BOME prices did drop after its launch, about 50% at the week’s start—steeper than a wider market correction.)\n\n“The reason Solana is able to capture all the memecoin volume as opposed to ETH L2s is because Solana’s transactions fees have been historically much lower,” Pat Doyle, Blockchain Researcher at Amberdata, told Fortune. “This makes investing in the speculative memecoins much more attractive as you don’t have a larger percentage of your transfer consumed by fees.”\n\nDoyle added: “Looking at this from a broader view, the memecoin craze is showing the ability for Solana to handle high volume and throughput.”\n\nAnd, to be fair, many investors had an eye on Solana before the latest memecoin boom: The blockchain’s native token SOL—though down about 8% today, to $168—is up almost 70% in 2024.\n\nAustin Federa, head of strategy at Solana Foundation, told Fortune in a statement that although the company expects some of the new users associated with the memecoin blitz to exit, \"We see this as a catalyst for a wave of new users to discover the usability and power of the Solana network—and stay for the long term.\""
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPMFktLWpOZm1ZQlhlODhybDR2WVVEdVUtSGJ1Qkt1QmJUcm1jSWxRd2RWdjlZNHc5bDdKTjl3b3kweFJjUEZDT0taN3B2Y0dTZGxJSFhmM2s5YnE3d1RqTW1RcmFJOHhWTDdaMTFKVTV0bWw1d1psSmEwQWI0N3JJNi1Od25DMnhiaUlycTVCOG14NUNGd0JFZWJjUXdmSjhxcjM40gGrAUFVX3lxTE9wZ0dPelViajFQMHR2cEhGYXlxQl84aXQxaG9hQ3JnTkZ3ekdIaThxdTFaODg0X1VBcWZIT0hsUE8zNWZxQ1ROYUlQaVRUZE5zaWZUSlE2T2x3ZktWU1pocGp6Y3NFRTJxc1MxUm1MRVNzbGV6cXlieFdyNS1LWDlpQkRkWTZOSHA5QmlVUWlWbk8zQkNnaURZUV9hTy1iOTBjQnVRUGI4cHlMSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Coinbase Transactions Are Failing Due to Congestion on Ethereum Scaler Base - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLeading American crypto exchange Coinbase is having issues again Wednesday—but while other recent instances were blamed on a surge in crypto trading activity amid Bitcoin's rise to a new all-time high price, this wave of problems is being blamed on Base, the Ethereum scaling network that Coinbase itself incubated.\n\n\"Due to network congestion on the Base network, transactions on Coinbase Wallet and Coinbase.com may experience intermittent failures,\" Coinbase's status page reads. \"If your transaction is not confirmed by the network, please wait or submit your transaction again on Coinbase.com. We advise that Coinbase Wallet customers wait for congestion to resolve before submitting transactions on the Base network.\"\n\nFollowing the initial publication of this story, Coinbase representatives sent the following statement to Decrypt:\n\n\"Due to high network traffic on the Base network, transaction fees increased over the last 24 hours. Some user transactions that were submitted with lower fees may be stuck in a 'pending' state. If possible, users with pending transactions should cancel their transaction and resubmit with the latest estimated gas fee. If you are unable to cancel your pending transaction, the transaction will complete once traffic subsides. Rest assured, your funds are safe. Pending transactions will process once fees reduce. The Coinbase Wallet team is working on implementing a transaction cancellation feature, and will provide an update once available.\"\n\nAD\n\nAD\n\nBase transactions have spiked dramatically in recent days following last week's launch of the Ethereum Dencun upgrade, which promised to cut transaction fees on layer-2 scaling networks. Indeed, Base—which is based on Optimism's scaling tech—has seen a dramatic decrease in fees, falling by 90% or more alongside some other networks.\n\nPublic blockchain data curated by Dune shows a sizable leap on transaction volume on Base, rising from a daily average of about 400,000 daily transactions before the Dencun upgrade to a million or more each of the last several days. Base hit a new daily transaction record of 2.12 million on Saturday.\n\nEditor's note: This story was updated after publication with additional details."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPNUtfNUZSb195b0F0UUVYcDZ3aGhOa3N5bkY4dlloSnMxajVEWlh0ZDNEWkpJMTBmdksxajVMLW95VjMzUmtJUTJDVzF3UEpIYXRFLWlINi1LLWhYXzNydGtrY215SEhaUXdVd0pNVWtlTTBDWk5paXpXZ0g4ek5tT2VqdHJLeWNwTXlBYVVnY3NfZk0tVWNVNlJrSDJXeWMxbS1iWndXc3owRngxNk9lLUcxRzVRYzNFMDVGWmhza1LSAcYBQVVfeXFMTjQxUlpjMGFVcmlRYzl6bFJJOFZZYnAwR3Rnd2FiS3U1NjR2RmxVdnFmTVNrOGkwNGozTnhPRFNaTDRZM25EQ3hwWVYxaFlqaWdGY3RZSVVkeTJsS0JJVVpIdVRMajFKVzRFSlZuZkJkN3prZHp4NUV6Vm8xc0czZGhJTlBjSlc1dXhaS0E2RGdsZVh0ZVVOMmdkck01c19Bb1lnR3ZJSTBFbWZQSlNhdkNqeTNMZVVvQ2dUdFhOc2VNZmZISHVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price plummets as large investors take profits - FXStreet",
        "content": "Ethereum’s price loses nearly 7% on the daily time frame, adding to the almost 20% weekly decline.\n\nThree Ethereum whales sold $95 million in Ether, taking nearly $40 million in gains since Friday.\n\nETH price could sweep the $2,900 level for liquidity before attempting a rebound.\n\nEthereum (ETH), the second-largest crypto asset by market capitalization, is currently in a state of decline. ETH price is down 7% on the day and almost 20% on the week, wiping out recent gains. On-chain data insights reveal that large-wallet investors, popularly known as whales, are shedding their Ethereum holdings and taking profits, increasing the selling pressure on ETH.\n\nAlso read: Grayscale amends Spot Ethereum ETF filing, ETH trades sideways below $3,700\n\nEthereum price crumbles under rising selling pressure\n\nData from crypto intelligence tracker Spotonchain shows that three large-wallet investors have taken profits on their Ethereum holdings in the past four days. The three Ethereum whales sold 26,946 Ether, worth $95.7 million, and took $39 million in profits. The transactions took place on Binance between March 15 and 19.\n\nAs whales shed their Ether, the altcoin’s supply on exchanges has increased. Between March 15 and 19, ETH reserves on exchanges are up from 13.92 million to 14.43 million. An increase in supply on exchanges implies there is a higher volume of Ether available to sell.\n\nAs seen in the Santiment chart below, Ethereum price declined alongside this supply increase, supporting the thesis that profit-taking has partly driven the drop in Ether’s price.\n\nSupply on Exchanges. Sources: Santiment\n\nEthereum price could sweep $2,900\n\nEthereum price is strongly correlated to Bitcoin. Therefore, the price decline seen in BTC likely helped Ethereum’s price to drop as well alongside factors like profit taking and whale activity.\n\nETH price is on the verge of dipping into the range between $2,717 and $3,200, represented by the Fair Value Gap (FVG) on its monthly chart. Once the altcoin collects liquidity in this zone, its price could rebound towards resistance at $3,500 (represented by R1 in the chart below).\n\nThe ETH/USDT 1-day chart shows that bears are taking over as the Moving Average Convergence/Divergence indicator flashes red bars. The Relative Strength Index (RSI) is at 42.05, close to the neutral zone, meaning ETH is not currently oversold. Should the RSI for ETH drop into the oversold zone, it would give a buy signal for sidelined buyers to step in.\n\n\n\nETH/USDT 1-day chart\n\nA daily candlestick close below $3,200 (the upper boundary of FVG) would result in a steeper correction that could send ETH price towards support at $2,166."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQUjZJeG1pNlBnWk1kUGVQaUVKSDZsSmp4Z3pXVUtYbGQyX2pqYTlxa1dYd3ZaUGZYeVplVlBPS1JoNU0zZ2dOU2NGZHlsRUkwWndOWGpfNmYySVpVUnRvdkFGTURCeVhTc0xJN29valdmckYzV1pOalRHcWwxRXlSYjd2aXFTR2RKMDNPUEU1c3I1ZmRULWR1b1hmeVpSc3hFbll0RmN2QWNvcjNXRFlmbXppWHBxeFN00gG-AUFVX3lxTFBicGYzVWRBbUJOMlhrUjZWVjgweDRqZ2drZzFEeS0xeWk3RklEZlVBbTVubzlNbzJacDJWOW0zVTNuYWZlMExRT3ZWMW9VSzQ4a3NSUGFJSW8yLWYzbFZPaXVlT1lTZVlyN2RxdHE5U05BUXZTSXpVSHBZcmFNSTFlcm5taHFjOEZyeXA5Qjc3ekVXamNuR0VaZTRNY0hEOU5KMkV4NGhKQ2Nlb2xHNm9pZUJtTUpKNG9xZzRoNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana Meme Coin Slerf Clocks Higher Trading Volume Than All of Ethereum - CoinDesk",
        "content": "SLERF came into existence following a token presale , during which it raised $10 million from users. It quickly went viral on social platform X after its developer said they accidentally sent all the money raised to a burn address, a crypto wallet address that’s not controlled by anyone, thus losing access to the funds."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPeHd2eW80NEdGdWNiaTRuTnNrY1hvOG9Eckt6cktTVHFZenBWUFA4dTgtZndaMHYxVEhRb0VLMWpDal9HSENGRWNXNGZWUDkwRFpMU3QzcEY0YjlPcmlGSnFoZHY0NHhVREtaUDZVZmpxQlZzN25QWlIwaGdEZ0ZsejlXcGVnaktsQUx2OUlsZDlmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC Pursuing Legal Campaign to Classify Ethereum as a Security - Watcher Guru",
        "content": "The US Securities and Exchange Commission (SEC) is reportedly pursuing a legal campaign to classify Ethereum as a security. Indeed, Fortune reports a plethora of US companies were subpoenaed related to an ongoing investigation into ETH.\n\nThe development further threatens the industry-wide hope of the SEC to approve a Spot Ethereum ETF this year. The agency had issued approval for 11 Spot Bitcoin ETFs in January, but the current legal action appears to undermine Ethereum’s chances.\n\nJUST IN: 🇺🇸 SEC pursuing legal campaign to classify Ethereum as a security. March 20, 2024\n\nAlso Read: BlackRock Launches Digital Asset Fund Backed by $100M on Ethereum\n\nSEC Seeking Security Classification for Ethereum\n\nSince the start of 2024, the digital asset market has performed impressively well. Although this week has seen the price correct, Bitcoin has led gains across the board. The asset itself reached a new all-time high of $73,000 this month through increased institutional investment.\n\nAlthough many had hoped ETH would benefit from similar action, that appears unlikely to happen now. According to a report from Fortune, the SEC is pursuing a legal campaign to classify Ethereum as a Security. Specifically, the agency has issued subpoenas to US companies as they investigate the asset.\n\nSource: Redot.com\n\nAlso Read: Ethereum Foundation is Under Investigation by State Authority\n\nAccording to the report, the SEC is seeking “documents and financial records that they may have regarding their dealings with the Etheruem Foundation,” a non-profit group that supports Etheruem and is based in Switzerland. Moreover, the report notes investigations into the Ethereum Foundation began as far back as September of 2022 when it transitioned to a proof-of-stake governance model.\n\nThe report noted another source received a subpoena within the last several weeks. The initial investigation was reported by CoinDesk but has not received confirmation from the Ethereum Foundation. In a comment to Fortune, the SEC said it “does not comment on the existence or nonexistence of possible investigation.”"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5lNDdyRDVLRXNOekRRdUFTQlNpNFZqM1Y4ZFpoYmUyaXc1VE5aZjZLZUdTZGhqOTJubFBFVGJIdHJjMUpHS3REVlcwS3RpcEFhUkFkYzNuTGdRdWFxbXEtOS14RzMwTVZKNzQxatIBdEFVX3lxTE1hbVY1eHdJV01jb1QyTDR6SG9CeUJmZjBzN04yYUtUeURMSEczT3UxdGZEcmI1Z1N0NHVkVXAtNHExRHVFNFVKM3J2Wi1HNzJ4X2hyYlJGUmZpeHBPazBMa2dZSUJISmNmM1BBZTdLdE11bU04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Won't Be Approved In May—Nor Should They, Some Experts Say - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe odds of spot Ethereum ETF emerging anytime soon are looking increasingly dire, but some crypto experts say that may be for the better.\n\n“Spot Ethereum ETFs will gather more assets if they launch in December versus if they launch in May,” wrote Matt Hougan, CIO of Bitwise, on Twitter on Tuesday. “TradFi needs more time to digest the Bitcoin ETFs.”\n\nBitcoin spot ETFs, which hit the U.S. market on January 11, have absorbed $12 billion in net inflows since launch. One of those ETFs belongs to Bitwise itself, which now holds nearly $2 billion in BTC on behalf of clients.\n\nHougan has repeatedly argued that there is still ample room for greater adoption of Bitcoin ETFs by the traditional financial world, and that certain target markets—like corporations and wirehouses—are still “plugging in” to the asset.\n\nAD\n\nAD\n\nA survey released by Bitwise in early January, however, found substantially less interest in Ethereum among financial advisors. At the end of last year, 71% of respondents favored Bitcoin, compared to a roughly 50/50 split in 2022.\n\n“Aside from Bitcoin (which is in a class of its own), the most excitement I've heard in terms of real-world use is around stablecoins,” added Hougan, based on his attendance at the institutionally-focused Blockworks DAS conference. “Seems clear to me that stablecoins will be a multi-trillion market by the end of 2025.”\n\nBloomberg’s ETF experts are apparently of the same mind: earlier this month, analyst Eric Balchunas said that Ethereum spot ETF would be “small potatoes” next to their Bitcoin-based counterparts.\n\nI tend to agree. (Bitwise doesn't have an active spot #Ethereum ETF Filing before the SEC) https://t.co/htJZF1JRas — James Seyffart (@JSeyff) March 19, 2024\n\nAD\n\nAD\n\nNeither Balchunas nor his associate, James Seyffart, believe such ETFs are likely to receive approval by May 23, which is the SEC’s final deadline for approving or deny he first wave of applications for the product.\n\n“[Regulators] need to start having convos with the issuers ASAP and they don’t seem to be doing that based on anything we’ve seen thus far,” wrote Seyffart on Monday.\n\nFurther impacting the odds for some issuers—including Fidelity and Ark—is the promise to stake a portion of their fund’s assets to earn a yield from the Ethereum network. Blockchain staking and proof-of-stake cryptocurrencies are already in dicey legal territory with the Securities and Exchange Commission (SEC), held solidly in the spotlight in many of the agency’s lawsuits against the crypto industry.\n\nJames Butterfill, Head of Research at CoinShares, believes an SEC decision on the ETFs may be delayed until the third quarter of 2024 or later due to unresolved issues around staking.\n\n“Currently, it appears that incorporating staking within a grantor trust is not feasible,” Butterfill told Decrypt.\n\n“Given the SEC's history of postponements, as observed with Grayscale over ten years and Blackrock last September, the likelihood of further delays is high,” he continued. “With much optimism placed on May, investors might face disappointment.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQT2VwR1BoYlc5N0lKUHNwcVhhMkJwb2xIcks5NlhZQmFIbVgzV3B5R1lDa3RsemE0cUFJUFRJSVhfZExRNHotdmJ2WWc5YlFveWRLOUR0anA5Yk9hejJzWXJLVE9rMUxnWXhjLXRmS2RRVTlQN0hTS2VOdmFJZlUtNm51SE5nMnNLMm9IZUtvcnI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation is Under Investigation by State Authority - Watcher Guru",
        "content": "The Ethereum Foundation is under investigation by unnamed state authorities, according to a CoinDesk report. Indeed the non-profit organization that is based in Switzerland supports the Ethereum ecosystem and has been subject to an investigation based on a GitHub commit.\n\nSpecifically, the group announced they have “received an inquiry from a state authority that included a requirement for confidentiality.” To this point, the details regarding the investigation are scarce with little information on its purpose or overall breadth.\n\nJUST IN: Ethereum Foundation under investigation by State Authority, CoinDesk reports. March 20, 2024\n\nAlso Read: Ethereum Slumps Below $3400: Can ETH Hit $4000 This Week?\n\nEthereum Foundation Reportedly Under Investigation\n\nOne of the most prominent networks within the digital asset industry has been Ethereum. The second largest cryptocurrency by market cap, ETH has become stable within the market as a whole. Now, a report indicates that the ecosystems nonprofit organization is the subject of government-related inquiry.\n\nThe Ethereum Foundation is under investigation by a State Authority according to a new CoinDesk report. Indeed, the group had reportedly identified the investigation in a February 26th,2024 GitHub commit. However, they have not released a statement regarding the ongoing reports.\n\nSource: Bitcoinist\n\nAlso Read: Ethereum Ether (ETH) Drops Following Dencun Upgrade\n\nThe news arrives at what is certainly an important time for the Ethereum ecosystem as a whole. Specifically, the chain implemented the highly-anticipated Dencun upgrade in March. The technical development was integrated in hopes of lessening transaction costs for the network Layer-2 platform users.\n\nAlong with that, there is anticipation that Ethereum could be the next digital asset in lien for a Spot ETF. Bitcoin had received approval for the investment offerings earlier this year. Thereafter, it skyrocketed in value, reaching an all-time high of $73,000 this month. A similar occurrence for ETH would have massive implications on its value and the market as a whole.\n\nThe situation is continuing to develop, and updates will be relayed when they arrive."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTERxbXVmemRfVnVSejRrUVA5UDJYRmZLUVlsQUZKNHBaR1VXYm9DUlRQNnhmaDV3REh6cnhPTHJHb0hmV25JNk1Ua2MwbW10N2lwc1c1dDc4NFE0TkxyNUwtM0xSTlNCdWROVWJkb0E4b2NhVDhleGxESGlOYWtUUlRjMjFxYklGR1k2VVYtS0dYNnVh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Digital Asset Fund Backed by $100M on Ethereum - Watcher Guru",
        "content": "Asset management company BlackRock is launching a tokenized digital asset fund, a new SEC filing on Tuesday shows. In turn, BlackRock seeded the fund by depositing $100 million in USDC stablecoin on the Ethereum Network.\n\nJUST IN: BlackRock launches digital asset fund and deposits $100 million $USDC on the Ethereum network. — Watcher.Guru (@WatcherGuru) March 19, 2024\n\nThe BlackRock USD Institutional Digital Liquidity Fund was incorporated in the British Virgin Islands and will be launched in partnership with Securitize, a tokenization firm. According to wallet data from Etherscan, BlackRock deposited Circle’s USDC stablecoin into a wallet on the Ethereum Network.\n\nBlackRock is continuing its journey into the digital asset industry following its Spot Bitcoin ETF launch earlier this year. The company’s Bitcoin ETF has been one of the best-performing Bitcoin products out of the field of new launches in 2024. Additionally, BlackRock also has a pending application for a spot Ethereum ETHER (ETH) ETF, which the SEC is putting off approval of.\n\nMANHATTAN, NEW YORK, UNITED STATES – 2021/05/25: BlackRock offices in New York City. Founded in 1988, BlackRock, Inc. is an US multinational investment management corporation. The corporation is the world’s largest asset manager, with $8.67 trillion in assets under management as of January 2021. (Photo by Erik McGregor/LightRocket via Getty Images)\n\nBlackRock Continues Its Mission For Tokenization\n\nIn a January interview with CNBC, BlackRock CEO Larry Fink said that BTC and ETH ETFs “are just stepping stones towards tokenization, and I really do believe this is where we’re going to be going.” Now, we are seeing the asset manager shift towards tokenization with a major step.\n\nAlso Read: Solana (SOL) Market Cap Predicted to Reach $1 Trillion\n\nFurthermore, BlackRock’s digital asset fund also represents a major milestone for the tokenization of real-world assets. Tokenization is a growing sector in the intersection of digital assets and traditional finance. It involves placing traditional assets on blockchain rails in pursuit of faster settlements and higher efficiency."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9LRy1PcjZhQml1clN4VFFlTVQzX1hhUXJxV3Q3TDNFNmNmRUZOYXdPb2o0Nmt1X1FWdzhlUjhPX0FsYzhjTTM4aDVJRm5VMDVPOV9TSTlJdmIzZFNuZXhCYlE3UTBGRGJQaG5vanBzNNIBdEFVX3lxTFBLenNwbl8yTTFDV1JBcjRGSWFzQmdyZFVhOWxBbjF0b2JRbG1CTTdEZE41WlVoek1XMUp0N01INHFIVm5Scm1FekF6b0RoWUVyR2xyWGtVakR0eGlZTjcyOU1SV19pb1E0WUc3LVBqMWpUbDI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Fidelity's Ethereum ETF Offering Gets Amendment - U.Today",
        "content": "Advertisement\n\nFinancial behemoth Fidelity has submitted an amended Ethereum (ETH) exchange-traded fund (ETF) proposal, adding staking to its application.\n\nAccording to the filing, it would be possible to stake a portion of the fund's assets with the help of a trusted staking provider.\n\nSimilarities with Bitcoin ETFs\n\nThe amended filing references the approval of multiple approvals of spot Bitcoin ETFs. The financial giant argues that it makes sense to greenlight the same product for the largest altcoin due to the high correlation between Ethereum and Bitcoin futures issued by CME.\n\nSince the SEC expects the CME's surveillance to be useful for assisting in detecting possible instances of fraudulent and manipulative practices, Fidelity claims that the same rationale should be applied to spot Ethereum ETFs.\n\nAdvertisement\n\nIt is worth mentioning that Fidelity's Bitcoin ETF has managed to end up among the most popular ETFs of this year so far after attracting almost $7 billion since its launch in January.\n\nIt occupied the top spots alongside BlackRock's Bitcoin ETF, which continues to shatter records.\n\nLow approval odds, high price targets\n\nAs reported by U.Today, Standard Chartered recently made a stunning prediction about the Ethereum price potentially reaching the pie-in-the-sky $8,000 target if the SEC were to approve a spot Ethereum ETF this May.\n\nHowever, such a scenario remains unlikely according to various experts. Political pressure appears to be the main impediment as of now, with the SEC facing some backlash in Congress following the success of spot Bitcoin ETFs.\n\nThere are varying opinions about the possible impact of a spot Ethereum ETF. Investment firm VanEck, for instance, believes that a spot ETF could end up being an even bigger deal than similar Bitcoin products. However, Eric Balchunas, a senior Bloomberg analyst, recently downplayed the impact of such an ETF, comparing it to an opening act trying to follow a headliner."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOYklJNmhzdnpxUEh3MDY4YnpFOVRrbWVDUzRfZFpheVFIWENmLUlFVndSMGhGOWRuMEZrM3kxYUtsQ2RzTF9vTjI1MC04eVJSMGJEVEV4U29NUU5sR1FiSjlyVVdqbDBLSkY2aWNmZUpKU2lPSUVIby1RUkxhVVc5aDZKb9IBiwFBVV95cUxNMGNpaWozQlg1SldDVzd4djUxZkM2anBRS1ZjS0xFSDBBWVBvQlhFNmp2YjNoQ1h2cEMzaUJpM1ZlNkFsblpLUHJhSXdJbm0tdjcyZy1MME1FU2E4MlMySUhiQ2o1TWt1Tm1yX2pyRk9KNGEtdjlPQ2JaRVJQZlZ6bk9iZWpfQW1oMVhV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Another CryptoPunks NFT Just Sold for $16 Million in Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is down this week despite recently setting its highest price in over two years, but the market lull didn’t stop someone from spending big on Wednesday: A CryptoPunks NFT was just purchased for more than $16 million worth of ETH.\n\nPunk #7804, one of just nine Alien Punks in the influential Ethereum NFT collection, traded hands for 4,850 ETH on Wednesday afternoon, or $16.42 million at the time of the sale. That makes it the second-largest CryptoPunks sale ever whether measured in ETH and USD.\n\nThe sale comes just weeks after another Alien Punk (#3100) sold for 4,500 ETH, which was worth $16.03 million worth at the time of the transaction on March 3. As with that purchase, the buyer of this latest Punk has yet to be publicly identified. The Ethereum wallet used for the purchase was funded for the first time Wednesday via Coinbase.\n\nHowever, the seller of Punk #7804—who purchased it in 2021 for 4,200 ETH, or $7.57 million at the time—posted a message on Twitter, lamenting that they did not “elevate” the profile of that particular Punk during their time holding it.\n\nAD\n\nAD\n\nEnd of an era. I've long since felt like an imposter. Holding punks, and potentially NFTs a whole hostage by not elevating 7804 in the way he deserves. After over a year of looking around I feel I've found the right buyer with the right vision to appropriately elevate this asset https://t.co/onngtTumrJ — Peruggia (@peruggia_v) March 20, 2024\n\n“End of an era. I've long since felt like an imposter. Holding Punks, and potentially NFTs [as] a whole hostage by not elevating 7804 in the way he deserves,” the pseudonymous Peruggia wrote. “After over a year of looking around, I feel I've found the right buyer with the right vision to appropriately elevate this asset.”\n\nThe top CryptoPunks sale of all time happened in February 2022, when a crypto startup CEO purchased another Alien Punk (#5822) for 8,000 ETH, or $23.7 million.\n\nToday’s purchase now ranks as the fifth most expensive NFT sale of all time. The record is still held by Mike “Beeple” Winkleman, whose digital artwork collage “Everydays: The First 5000 Days” grabbed international headlines when it was auctioned for $69.3 million by Christie’s in March 2021, helping to ignite the initial fever around NFTs.\n\nAD\n\nAD\n\nMinted in 2017 by Larva Labs, CryptoPunks helped set the standard for tokenized profile pictures—one that would later be expanded upon by the Bored Ape Yacht Club and countless other collections that followed. The NFTs were originally given away for free, yet have generated nearly $2.8 billion worth of secondary trading volume to date, per data from CryptoSlam.\n\nEven the cheapest available CryptoPunks NFT on a marketplace is listed at about 51 ETH, or $177,000 worth. The CryptoPunks IP was ultimately acquired by Bored Ape Yacht Club creator Yuga Labs in 2022.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPa3NHRm5HNE42UnpMdjlQTTFucWlSRkhZRERZYXZocldfTi1MRDNHbUs0alMtbzIzOVNQRklsT3hWYkFCQ2FUOVZtdXBhMTN5UVgxRFhSTV9sQXo1YTcxaGIxLU9xbHljZVRMcnZnWjRQbnFkWmVDLWE0bzRBN0ZmSXNlQkhzcGVxdVd0Q3F5dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Enters Asset Tokenization Race With New Fund on the Ethereum Network - Yahoo Finance",
        "content": "BlackRock to start a new real-world asset (RWA) tokenization fund on the Ethereum network.\n\nThe asset management giant also made strategic investments in asset tokenization company Securitize.\n\nAsset management giant BlackRock (BLK) officially unveiled its tokenized asset fund on the Ethereum network on Wednesday.\n\nThe BlackRock USD Institutional Digital Liquidity Fund is represented by the blockchain-based BUIDL token, is fully backed by cash, U.S. Treasury bills, and repurchase agreements, and will provide yield paid out via blockchain rails every day to token holders, according to a press release.\n\nSecuritize will act as a transfer agent and tokenization platform, while BNY Mellon is the custodian of the fund's assets, BlackRock said. Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks also participate in the fund's ecosystem.\n\nBlackRock also made a \"strategic investment\" in Securitize, the press release added, but the terms of the deal weren't disclosed.\n\n\"This is the latest progression of our digital assets strategy,\" said Robert Mitchnick, BlackRock’s Head of Digital Assets. \"We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.\"\n\nThe announcement came after a regulatory filing revealed that BlackRock incorporated a fund with Securitize, spurring speculations of a tokenized fund as observers pointed to blockchain transactions to seed the vehicle, CoinDesk reported Tuesday.\n\nBlackRock is the latest traditional finance giant to enter the tokenization field after Citi, Franklin Templeton and JPMorgan have already made headways with the technology. Creating blockchain-based tokens of traditional investments such as bonds and funds – known as tokenization of real-world assets (RWA) – is a fast-growing use case for blockchains as digital assets and traditional finance (TradFi) are becoming more intertwined. Tokenized U.S. Treasuries , for example, have grown to $730 million from $100 million in early 2023 as crypto firms seek to earn a steady yield by parking their on-chain funds.\n\nBlackRock CEO Larry Fink said earlier this year in a CNBC interview that the company's spot BTC ETF was \"stepping stones towards tokenization.\"\n\nRead more: The Tokenization of Real-World Assets (RWA) Explained"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOYzRLRTJhcy1aSkZZT2tfaVFBZ1lNNXFEUTZnTlNvNGlrUzduXzZFYlQ1ODR2ZEI0eWswd2JOYjlCNVN1Um5nbEJzem4taXVMNWhldDl5amh5X29lY2VIOVdaaGZnOHdtNUxZakcyc0R1dWE3NklPWktfMHZvdXlyVV9pNVl1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Slumps Below $3400: Can ETH Hit $4000 This Week? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, surpassing $4,000. However, the coin has since experienced a decrease in value along with the broader cryptocurrency market. As of press time, ETH is trading at $3,391, which represents a 6.1% decrease in the last 24 hours. Despite this recent decline, ETH remains up by 89% year-to-date and is still the second-largest cryptocurrency by market capitalization.\n\nAlso read: Cryptocurrency: Top 3 Coins That Could Hit ATH In The Coming Week\n\nEthereum Price Prediction for the week\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for the week. According to their analysis, ETH is expected to reach a minimum price of $3,637 and a maximum price of $3,726. The average price is expected to be $3,680.\n\nThe recent surge in Ethereum’s price has been largely attributed to the growing expectations of ETH exchange-traded fund (ETF) approval. However, the current market sentiment, coupled with Bitcoin’s struggle to push further highs, has dampened the likelihood of ETH surpassing the $4,000 mark this week.\n\nAlso read: Can Shiba Inu (SHIB) Hit $0.00005 This Week?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks.\n\nWhile the recent drop in Ethereum’s price following the Dencun upgrade may be disappointing for some investors, it is essential to view the cryptocurrency market’s volatility in the context of its long-term potential.\n\nAlso read: Solana Breaches $200, But Analyst Warns Investors To Stay Out of SOL\n\nEthereum’s fundamental strengths, including its large developer community, robust ecosystem, and commitment to sustainability, position it well for future growth and adoption."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9mLWxtR0huX0V2S3dFZkdiQmZNWWU3dlV4bzVlQ2hzX0xrdnk0MjEtUXdqZFFjc1pZVVBRWUw1TkpjdGI1VU9pZjJuSkpNZVFCSzhTelRvdnN4UzFwNzI1ZHYzVEdPZll0VzREMHEyTVoweGpXSDRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana Passes Ethereum on DEX Volume - CoinDesk",
        "content": "Solana has replaced Ethereum as the No. 1 smart-contract blockchain as trading volume in Solana-based decentralized exchanges (DEX) has increased 67% to $21.3 billion in seven days, according to data tracked by DeFiLlama. Could the increase in volume be catalyzed by the hype around Solana-based meme coins? CoinDesk's Jennifer Sanasie presents the \"The Chart of the Day.\""
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNakRwYnZUWF9VWnZaMGoxaldET3hHN19ldEFZeWVTSWxRbG1HQkFMVE45ZHlJRzRqdmVVUURYQ3NHVHdHR1dSeVI1c3NpVnJXSXVDc2Z3bmJfWEVSdnpoeFlxZExfbzdacmRrVVhQLWpEUkVaVHZ6b0VjTXBQLXlKR1IwNWVjSVVCN0lpVDZ3Rjc3TlJRdDctbUdfdUM2dTFjUl90RTdiU3BKdFc3ZTdZUUJWRHFxa0dOSmtUSnVyV25ZSEt4azhsaFNUcGNvcTNRYV9xd2JsNNIB3AFBVV95cUxPV19LZkZZYVZGOXBpZDlRV1JyVklfZ0ozNHNyVmo3TkZva0oyczY1RkFxemFjb0NqNWxyOEZ3ZVctZXV2d1VobUExaDk3LTFlYmFodWtiRkNxUjEyNDNCaUlPOUE1eWpBYVZ3ay1uN3d2RXFZTW1BcndpMUhOeHAzNmVReTJfaXZXa0hVa3piRXZxa0F4UWNIdi1BWlZXWEtmUWlrekRzWFdJVTJZN1VIdThJYTR6V0UzNXdERjZRN0NGal9mM0ZXWnJZdkRxbktWTm1VR3FPS2dSejda?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC stuck under $65K ahead of FOMC - FXStreet",
        "content": "Bitcoin price could make a 12% drop to the weekly imbalance zone before reclaiming its ATH.\n\nEthereum price likely to drop 10% before ETH becomes attractive for buyers.\n\nRipple price could extend the fall with a bearish divergence in play, amid a hidden continuation pattern.\n\nVolatility has increased in the market ahead of Fed interest rate decision.\n\nBitcoin (BTC) price slipped below the $65,000 threshold on Tuesday, bringing down with it Ethereum (ETH) price as well as Ripple (XRP) price. Volatility levels have also increased, as markets await Wednesday Federal Open Market Committee (FOMC) policy meeting.\n\nNevertheless, with expectations of an interest rate pause, and further interest rate hikes off the table, crypto market participants have reason to expect a rally in Bitcoin and altcoins. A pause would hint at the Fed taking a more accommodative stance toward the economy, potentially leading to increased risk appetite among investors, which would be bullish for crypto.\n\nAlso Read: Bitcoin price draws further away from its all-time high of $73,777 with BTC halving one month away\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies. Bitcoin price could drop 12% to the weekly imbalance area\n\nBitcoin price has formed a Head-and-Shoulders pattern on the daily timeframe, forecasting a 12% drop if the technical formation plays out. The market is leaning towards the downside, with the Relative Strength Index (RSI) nose-diving to signify momentum is falling.\n\nThe Awesome Oscillator (AO) is also edging towards the mean level with its histogram bars flashing red. If the bears have their way, BTC price could drop into the weekly imbalance, stretching from $52,985 to $59,005.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls are able to flip the neckline of the Head-and-Shoulders pattern into support, Bitcoin price could extend north to negate the bearish thesis above the $69,000 threshold.\n\nAlso Read: Bitcoin price provides yet another lower buying opportunity 30 days to BTC halving\n\nEthereum price eyes a 10% drop\n\nEthereum price has slipped below the most critical Fibonacci retracement level, 61.8% at $3,365, with eyes now peeled on the 50% Fibonacci placeholder at $3,137.\n\nWith the RSI nose-diving below the mean level as momentum falls fast, coupled with the AO histogram bars drawing towards negative territory, Ethereum price could drop 10% to find inflection around $3,013 before ETH is attractive for buying.\n\nETH/USDT 1-day chart\n\nConversely, if the bulls increase their buying pressure at current levels, Ethereum price could pull north, breaching resistance due to the 78.6% Fibonacci retracement level of $3,691.\n\nA flip of this roadblock into support would motivate the late bulls to buy ETH, with the ensuing buying pressure sending ETH price north to record a higher high above the peak of the market range at $4,105. This would constitute a 25% climb above current levels.\n\nAlso Read: Ethereum L2 bridge deposits skyrocket after Dencun Upgrade\n\nThis bearish divergence could send XRP price lower\n\nRipple price has recorded higher lows, while the RSI has produced lower lows, culminating in a potential weakening momentum or a trend reversal. It suggests the bullish momentum in XRP price is losing strength as the RSI is showing lower levels.\n\nIncreased selling pressure could see Ripple price descend below the ascending trendline, potentially going as low as $0.5500, or in a dire case, extend a leg lower to test the $0.5368 support level. This would constitute a drop of around 11% below current levels.\n\nXRP/USDT 1-day chart\n\nConversely, a recovery by the bulls could see XRP price restore above the 50% Fibonacci placeholder at $0.6152. Enhanced buying pressure above this level could see the price confront the 61.8% Fibonacci retracement level of 0.6460, where stiff resistance is expected.\n\nOvercoming this level would be the signal the skeptics might need to come in en masse and push XRP price further north. This could send XRP price to the peak of the market range at $0.7457, denoting a 24% climb above current levels.\n\nAlso Read: XRP trades with modest losses below key $0.60 level"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPVmhZUVZEQmdKdWtkeWk2U0F2WjI0c05DOGE1d255cW5kaGJUcV82eEtNLWNMa1kzWFZUd3B2U0tmcDhKMTRiMmNoSkpDM0tEWE5RQ1IwNmpVUlJEVzBsdHpOVVB1VmpVY2N4MzN5bnJxNzVWRTBlbWtQN2Yzc0w5VnZmWXYxZFRyRnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "The Feds Are Reportedly Investigating Ethereum Foundation - Gizmodo",
        "content": "The U.S. Securities and Exchange Commission (SEC) is investigating the Ethereum Foundation and companies doing business with the nonprofit, according to a new report from Fortune Wednesday. And that’s very bad news for crypto enthusiasts who were hopeful that spot Ether ETFs, which would make it easier for investors to invest in the cryptocurrency without holding it personally, would be approved by regulators soon.\n\nThe news comes after CoinDesk first noticed on Wednesday that the Ethereum Foundation had recently included a note on Github about being investigated by an unnamed “state authority.” The spokesperson for the SEC told Gizmodo via email on Wednesday that, “The SEC does not comment on the existence or nonexistence of a possible investigation.”\n\nThe purpose of the SEC’s apparent investigation, according to people who spoke with Fortune, is to classify Ethereum as a security. The head of the SEC, Gary Gensler, has previously said Bitcoin isn’t a security but should be classified as a commodity while suggesting practically all other crypto coins are securities.\n\nFrom Fortune:\n\nAccording to a person at a company who received a recent subpoena request, the SEC’s probe of the Swiss-based Ethereum Foundation began shortly after the blockchain’s shift to a new governance model known as “proof-of-stake” in September of 2022.\n\nThat proof-of-stake event moved the blockchain away from the energy-intensive model used by Bitcoin in favor of one that relies on a trusted network of validators—and provided the SEC with a new pretext to attempt to define Ethereum as a security, according to people at three different companies familiar with the subpoenas. The people asked Fortune not identify to identify them or their firms for fear of retaliation by the agency’s chair, Gary Gensler, who one described as “vindictive.”\n\nWhy does it matter if Ethereum is a security? That means Ethereum and the exchanges that trade it will be subject to tighter enforcement from the SEC.\n\nEthereum’s price has ticked down roughly 14% over the past five days though it’s still up 98% in the past six months. The crypto coin was trading at roughly $1,600 in late September.\n\nEthereum was created in 2015 by programmer Vitalik Buterin after he rather famously became frustrated that his favorite World of Warcraft character’s capabilities were degraded. To Buterin, that was when he “realized what horrors centralized services can bring,” leading him to create an ostensibly decentralized crypto coin.\n\nButerin is estimated to be worth about $400 million, according to Forbes, down from about $1.4 billion in 2021."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBXVjJzdzB6QXBGeXNUcFBYNng5RDJfMUxNUTVrN1R2RTN2RUFaYW9oTWJySGxGdU9XVmpqVmVDTUt3dG1DT1Z4ZFFOSnczbkpydmR1QmhVT2dXRXhpaEpMRk9xNk51VUh1X0dJbmJWSHp5X1BzLWp1aXQ0NGg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price: Can ETH Price Cross $8K in 2024? - CoinGape",
        "content": "The Ethereum price has been a victim of the crypto market crash having experienced a drop in its value. ETH’s market performance chart shows a red pattern over the past week with an 18.88% decrease. With an increase of 86% in its value year-to-date the market seems optimistic for the token to hit $8,000 by the end of the year. Let’s find out how possible this is.\n\nFactors Driving Ethereum Price to $8,000\n\nThe Standard Chartered Bank has mentioned the approval of ETH ETFs and the recent Dencan upgrade as possible drivers of Ethereum price to $8,000 by end of 2024.\n\nadvertisement\n\n1. Ethereum Price Dencun Upgrade\n\nThe Standard Chartered Bank believes that Ethereum’s recent Dencun upgrade will enhance its competitiveness by reducing transaction fees on Layer 2 networks. He predicts that the importance of the “bridge” category will increase as a result of this upgrade.\n\nAdditionally, the bank foresees Ethereum’s future use cases shifting towards gaming and tokenization, which will create a substantial demand through NFT and DeFi channels. It emphasized that this will serve as proof of concept for real-world industries to leverage Ethereum’s advantages over their current systems.The bank expects significant advancements in these areas by 2025-26.\n\n2. Ethereum spot exchange-traded fund (ETF)\n\nThe Standard Chartered Bank has also forecasted that if a spot exchange-traded fund (ETF) is approved in the US, Ether could potentially reach $8,000 by the end of this year. It asserts that the ETF inflows are likely for Ethereum (ETH) as it benefits from being considered the “big tech” of digital assets.\n\nThe bank anticipates that the US SEC will approve ETH ETFs on 23 May, which is the final deadline for the first batch of applications. This timeline aligns with the SEC’s previous approval of Bitcoin (BTC) ETFs in January 2024.\n\nStandard Chartered bullish on Bitcoin and ETH. Bitcoin TP:\n\n2024: $150k\n\n2025: $200k – $250k ETH TP:\n\n2024: 8k\n\n2025: 14k pic.twitter.com/Ahfc2KKVOY — bearishbiasjedi (@FinBizJedi) March 18, 2024\n\nAdditionally, the London Stock Exchange (LSE) in the UK has announced that it will accept applications for ETH and BTC ETFs, increasing the chances of US approval.\n\nThere is an expectation of a significant influx of ETH through ETFs, similar to what was seen with BTC ETFs after their approval. Standard Chartered Bank estimates suggest that spot ETFs could bring in approximately 2.39-9.15 million ETH within the first year of approval, equivalent to around USD 15-45 billion. This inflow as a percentage of market cap is comparable to the previous estimates for BTC ETFs, which have proven to be accurate.\n\nIf ETH ETFs receive approval in the US on 23 May as anticipated, there will be greater potential for price growth than previously thought. ETH is expected to keep pace with BTC, maintaining the current 5.4% price ratio throughout 2024. Considering the bank’s projection of BTC reaching USD 150,000 by the end of 2024, this would imply a price of USD 8,000 for ETH.\n\nWill spot Ethereum ETFs Be Approved?\n\nVarious scenarios are showing that Ethereum ETFs approval is unlikely.\n\n1. Analysts’ Lowered Expectations\n\nMany analysts have become less hopeful about the idea due to regulators’ apparent lack of communication on the matter. The current prediction markets on Polymarket suggest that there is a 28% chance of a spot ether ETF being approved by the end of May. This is a notable decrease from the 74% odds on Polymarket back on January 10, when spot bitcoin ETFs were given the green light.\n\nBloomberg Senior ETF Analyst Eric Balchunas has revised his prediction for the approval of a spot ether ETF to 30%, down from 70% in January. Balchunas stated, “We are now at 30% odds.” In contrast, his colleague James Seyffart had previously estimated a 60-65% chance of approval. Seyffart expressed his growing pessimism, stating that the current situation for an Ethereum ETF approval feels opposite to the odds for a bitcoin ETF approval. With only approximately 73 days left until the deadline, there appears to be minimal progress or development.\n\n2. Political Pressure on the SEC\n\nIt is unlikely that Ethereum ETFs will be approved this year due to increased political pressure on the Securities and Exchange Commission to only allow ETFs for Ethereum.\n\nSenators Jack Reed and Laphonza Butler have urged SEC Chairman Gensler to refrain from approving more cryptocurrency ETFs to protect investors. They argue that the approval of Bitcoin ETFs in January has opened the door for Wall Street to sell risky crypto investments to the public. The senators believe that allowing more crypto ETFs would expose investors to fraud and manipulation in thinly traded markets.\n\nThey express concerns about proposed Ethereum ETF applications and the possibility of other altcoins being approved. Reed and Butler emphasize the risks retail investors would face from ETPs, which could be susceptible to fraudulent schemes. They call for greater regulatory oversight on BTC ETF brokers and advisors to safeguard investor interests.\n\nThe success of the BTC spot products clearly ruffling some feathers on the Hill. @SenatorJackReed and @Senlaphonza write to the @SECGov urging:\n\n-no further ETPs for other tokens\n\n-make life difficult (i.e. examinations/reviews) for brokers and advisers that recommend BTC ETPs pic.twitter.com/enxdumC02N — Alexander Grieve (@AlexanderGrieve) March 14, 2024\n\nBalchunas believes the success of the Bitcoin ETF has caused regret among Democrats, impacting the approval chances of an ETH ETF. Balchunas noted the Senators’ focus on correlations between ETH futures and spot prices as a potential indicator of future actions by the SEC. He speculated that the SEC may have provided information to the Senators. The analyst also pointed out the technical term “ETP” for 33 Act funds and suggested SEC involvement in drafting the letter. Overall, he sees the letter as a sign of potential rejection of spot ETH ETFs.\n\nETH Price Current Status\n\nEthereum price is currently at $3,266.05 having decreased by 9.00% over the past day. The token is below its all-time high of $4,891 it achieved on November 16, 2021, which investors are hoping it will hit and surpass during this bull run year. There is quite substantial activity going on in the market regarding ETH as demonstrated by a 63% increase in the 24-hour trading volume. It still holds the second position according to CoinMarketCap, boasting a market cap of $392.18 billion and a circulation supply of 120 million ETH.\n\nPrice Forecast: Will Ethereum Price Hit $8,000?\n\nETH is likely to encounter a lot of obstacles in reaching $8,000 by the end of the year, based on the current technical indicators. The 200-day EMA and MACD signals show a strong bearish sentiment, indicating that the price may face more downward pressure. Although there might be temporary recoveries, the overall trend seems difficult for a significant price rise. Traders and investors should keep an eye on important support and resistance levels, as well as the general market sentiment, to accurately assess ETH’s future path."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1yd0cyVWdsQUZJdUpkeGhuVWh6dWxUVURzWGR2THczUlgtYTFSQjFIVEdUdVMzZlMtZVRLR2g2MkZVQUJXNU4zQTNiM2hOQ3J6a1Q2MVdKZDlRUkk4dUtUWU5ZMWpoNURmUFVYYm9iLW5vTnJHR2p6eVozbzVWekXSAYcBQVVfeXFMTS00VmJJU1NZanlBdHBQVVFaejN4ZU1pVEFJYnVOcWF3ZEpmSFN2RUp3d2VVSHE3RnBGZTltTzE5Nk40VFZ6ZjNpb1k3LVQtSW44S0pLMW03ZFRyOUs4SGVodk52Wm03X01aVmVkbEJNbEVkZk4yUzJaOTNsUnExQ013ajgzdkVV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Gaming Network Xai Could Add 100+ Games in 2024—Here's How - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nXai, the gaming-centric Ethereum network built on Arbitrum scaling technology, could add a heap of games by year’s end thanks to a new collaboration with a prominent indie gaming curator called The MIX.\n\nThe MIX, or The Media Indie Exchange, says that it could launch more than 100 games on the layer-3 Xai network before the end of 2024 and that we should see the first of those games live within 60 days. No games have been confirmed yet, however, as they will be announced individually.\n\n“We already have a number of games confirmed and a large pipeline of games that we expect to confirm in the short term,” The MIX owner and co-founder Justin Woodward told Decrypt’s GG. “By the end of the year, we anticipate deploying at least dozens, if not over 100, games to Xai through this partnership.”\n\nOver the last 12 years, The MIX has served as connective tissue between indie game developers, publishers, and the media, presenting curated gaming showcases and developing content around such events. With those connections in place and having shown hundreds of games via its events, The MIX now aims to onboard some of those creators to Web3.\n\nAD\n\nAD\n\nIn many cases, it appears that the games coming via The MIX will be completed “Web2” games that can be adapted for the blockchain market via Xai’s software development kit (SDK)—though the company will also help facilitate crypto games being built from scratch for Xai.\n\n“Xai offers an SDK that simplifies the process for Web2 games and their users to access the advantages of Web3 through a straightforward implementation,” said Woodward. “Many games will utilize this technology, which is completely abstracted from the user experience.”\n\n“A smaller group of games are building Web3 foundations from the start,” he added. “It will be exciting to see the creativity of indie game developers experimenting with Web3 tech.”\n\nWoodward said that the Xai implementation in upcoming games could bear a “striking resemblance” to how game publisher Valve has allowed players on the Steam platform to buy and sell in-game items in Web2 games like Counter-Strike: Global Offensive. But unlike in traditional games, players won't be locked to a certain storefront or marketplace.\n\nAD\n\nAD\n\n“Ultimately, it's up to the game developers to determine how they utilize it,” he added.\n\nThe MIX lives in the traditional gaming space, albeit aligned more with indie creators than major publishing giants. Even so, there’s been plenty of skepticism around crypto games in the Web2 world. On the other hand, game studios are reeling from mass layoffs, and the industry is in disarray. Are game developers coming around to crypto distribution channels?\n\n“There will continue to be some pushback,” Woodward admitted, “but developers have been more responsive to Xai because the Web3 elements are pushed behind the scenes and don't affect the user experience.”\n\n“It's also important to acknowledge how Web3 has helped indie game developers bootstrap community,” he added. “When examining Xai's socials, it's clear they have built a rabid community ready to play games by leveraging their technology. This presents an opportunity for indie game developers to connect with and grow their audience. Blockchain is merely a technological component.”\n\nThe MIX is currently holding an event at the Game Developers Conference in San Francisco in collaboration with gaming content studio Kinda Funny.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNUFVDQjRPelZDYkVZOTZHSjFzazZNbHlwUnNsM2RId1J0b3JOVHgzSnVzVjhTdnhPYnlSeENjeUtQbkc5SjY5NEp5T01DWE1tcHA4RDVpUXF3azljQ2lBeTBhV2FxNVJEUnZTaUFfM3lKTTI3dU5QRV96OWNnYnJpUF9xam81aDlFTXpYMGlXOTdocmYzRWfSAZsBQVVfeXFMTzZXMzVoZXZ6aXQ3UXd5YVgxR3JPZWVLelZaVkVRQnN5b29JTVdJTHBOdjZTYkw2VFlkaHhGQUdOQUN6d2ZTWWdUQ2REOGVacmZIaFIxTDdhSVFXYWJHenJsZG9WR1lPSjRQcUxwZzBOR1NVd1lRaUNJSzBRRVdSU1hKZW1lTTZQUE1naExPZm9RWjhSNFdRdWVJeHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Breaking: Ethereum Foundation Under Investigation By A State Authority - CoinGape",
        "content": "The Ethereum Foundation is reportedly under investigation by a State Authority, a new update disclosed through the protocol’s GitHub repository.\n\nThe Unclear Inquiry Into Ethereum Foundation\n\nAccording to the GitHub update, the disclosure of the inquiry was made weeks ago, marking the first time any State Authority will be issuing such a probe into the Ethereum blockchain developer.\n\nadvertisement\n\n“This commit removes a section of the footer as we have received a voluntary enquiry from a state authority that included a requirement for confidentiality,” said Pablo Pettinari, one of the core developers at the Ethereum Foundation, in a commit on February 26.\n\nThe GitHub commit showed the removal of contact, another bizarre trend that negates its core tenets of transparency. The inquiry also led to the removal of a canary that represented the Ethereum network from the foundation’s website. Per the Wayback Machine data, this canary feature and its associated text were present in January.\n\nThe community has been thrown into undue speculation following the breaking of the inquiry. With the Ethereum Foundation currently not sharing additional details about the probe, any potential fallout in the long term will go a long way in helping stakeholders understand what the core challenge is.\n\nEthereum remains a controversial digital currency as it relates to its security classification. Through a series of intricate events, there are allegations of a likely conflict of interest with Jay Clayton, the former Chairman of the United States Securities and Exchange Commission (SEC) who filed a lawsuit against XRP days before leaving office.\n\nMany in the community postulated that this lawsuit was directed at XRP to stump competition, however, there is no evidence at the moment to connect this with the current State Authority inquiry.\n\nWhile the price of Ethereum recorded a knee-jerk reaction to the news, there is stability in the market at the moment. Over the past 24 hours, Ethereum has recorded a 0.82% uptick with its price pegged at $3,316.02. To complement this rare bullish twist, the coin’s trading volume is up 8.45% to $34,886,760,871.\n\nCrypto Entities and Federal Probes\n\nJust as the Ethereum Foundation is facing a probe by a State Authority, other crypto-based entities have had their fair share of related probes in recent times.\n\nBinance was under investigation by the United States Department of Justice (DoJ) for years, a probe that ended in a settlement last year. The settlement, which is worth about $4.3 billion in monetary terms, was regarded as one of the largest scores by the DoJ, FinCEN, and CFTC at the time. It also led to the resignation of co-founder and former CEO Changpeng ‘CZ’ Zhao from the company.\n\nBesides this historic event, other platforms including Coinbase Global Inc. remain in a tight legal battle with the Securities and Exchange Commission (SEC) over some of its offerings.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPTUlTWmhwc0t1WUZ4WmVnYzlzc1lubkIwbHlmZTd5SHNJdlJ3NlZxN3lfNzktTTBoSmZhVVAxMkdwa1BINXllYmI2UUdtNno0aHRDM0hYcDlyclhGeDJhR3dtUldLMXBmOXowemgyUHlCX1MwTjJTQW93LU52ZmpWVDhUQ1hOdkpzcTVtSjl5SHF4TkJFZWNHSmsxRDhMS1lSNzdwTzRWR0gzclBCcmdtRl9lUDZnbEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Rallies 10%, Why Close Above $3,550 Is The Key - TradingView",
        "content": "Ethereum price started a recovery wave from the $3,050 zone. ETH is up over 10% and is now struggling to clear the $3,550 resistance zone.\n\nEthereum started a decent recovery wave from the $3,050 zone.\n\nThe price is trading above $3,350 and the 100-hourly Simple Moving Average.\n\nThere was a break above a major bearish trend line with resistance at $3,400 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise if it settles above the $3,550 resistance zone.\n\nEthereum Price Starts Recovery\n\nEthereum price extended its decline below the $3,350 and $3,200 levels, like Bitcoin. ETH even declined below the $3,150 support level before the bulls appeared. It tested the $3,050 zone.\n\nA low was formed at $3,059 and the price is moving higher. There was a strong recovery wave above the $3,350 resistance. The price cleared the 50% Fib retracement level of the downward wave from the $3,675 swing high to the $3,059 low.\n\nThere was also a break above a major bearish trend line with resistance at $3,400 on the hourly chart of ETH/USD. Ethereum price is now trading above $3,400 and the 100-hourly Simple Moving Average.\n\nOn the upside, immediate resistance is near the $3,520 level or the 76.4% Fib retracement level of the downward wave from the $3,675 swing high to the $3,059 low. The first major resistance is near the $3,550 level. The next key resistance sits at $3,675, above which the price might gain bullish momentum.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nIn the stated case, Ether could rally toward the $3,820 level. If there is a move above the $3,820 resistance, Ethereum could even rise toward the $4,000 resistance. Any more gains might call for a test of $4,080.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could start another decline. Initial support on the downside is near the $3,380 level.\n\nThe first major support is near the $3,320 zone. The next key support could be the $3,220 zone. A clear move below the $3,220 support might send the price toward $3,150. Any more losses might send the price toward the $3,050 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $3,380\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5Sc2NobFN4VDRfd05Td3RrYndINW5maUxIQ3BsR0phT2xFMm1xZ0FpNVFKMmhreC1pelNVV21QWDJubzUyUDRzWk9LZlJyOXI0ZGJVajZJdmRrUllUdFlOR21kSEFPX0M5Ukc1NkV2MVhIOER6REpFa1NsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana surpasses Ethereum on DEX - The Cryptonomist",
        "content": "It is not the first time it happens, but the fact that the volume of trades on decentralized exchanges on Solana has exceeded that of DEX on Ethereum always makes headlines.\n\nEthereum not only has existed since 2015, but has been dominating the world of DeFi uncontested for years now.\n\nSolana instead landed on the crypto markets just under four years ago, but has transaction fees that are far lower.\n\nSolana’s Overtake on Ethereum\n\nIt should be noted, however, that in terms of key metrics Solana has not yet surpassed Ethereum.\n\nBy market capitalization SOL (the native cryptocurrency of Solana) is around 75 billion dollars, just surpassed by BNB with 78. ETH, the native cryptocurrency of Ethereum, is still on another level, with 386 billion dollars.\n\nFor TVL (Total Value Locked on DeFi protocols), Ethereum surpasses everyone with its 46 billion dollars, with Solana in fourth place with only 3.7 billion, surpassed also by Tron as well as BSC. However, the majority of TVL on Tron is due to USDT, while in the Solana ecosystem it is due to DEX.\n\nIt is no coincidence that the overtaking occurred precisely on decentralized exchanges, especially in terms of daily trading volumes.\n\nMoreover, even among DEXs, Uniswap still dominates in terms of TVL, although now a portion of its trading volumes does not occur on Ethereum but on layer-2 solutions like Arbitrum.\n\nUsing as a reference the trading volumes per chain, in the last seven days Solana has exceeded 21 billion dollars, while Ethereum stopped at 19.\n\nHowever, it should be added that there have been more than 6 billion dollars in trading on Arbitrum, so overall the Ethereum ecosystem with its layer-2 still surpasses the Solana ecosystem.\n\nNote that in third place in this ranking there is BSC, with 12 billion, and in fourth place Avalanche with 4.\n\nThe reason for the overtaking\n\nThere are two reasons that have led to this overtaking.\n\nThe first, simply, is the much lower fees on transactions.\n\nIn fact, it is no coincidence that the fifth chain by trading volume on DEXs is Arbitrum, the main layer-2 solution for Ethereum that enables transactions at very low costs.\n\nSolana still has lower costs, so it’s not surprising that it’s the preferred chain at the moment.\n\nHowever, there was another reason behind this boom.\n\nThe boom of memecoins played an important role.\n\nMany memecoins are now being launched on low-cost chains, such as Solana or even Base. Moreover, anyone can list their new token on a decentralized exchange, so DEXs are the ideal place to launch new memecoins.\n\nIt was a real boom, with some truly colossal proportions.\n\nIn the last 1 hour, 2,500 Solana memecoins were created. — Ram Ahluwalia CFA, Lumida (@ramahluwalia) March 13, 2024\n\nNow that the temporary boom of memecoins seems to be fading, it is possible that Ethereum will return to dominate this ranking, even though Arbitrum has now become a strong competitor.\n\nThe historical volumes\n\nHowever, the situation changes if historical volumes are taken into consideration.\n\nOn a monthly basis, in March Ethereum still dominates with over 51 billion dollars so far, while Solana is at about 45.\n\nIn February, even BSC had surpassed Solana, with 25 billion dollars compared to 22.\n\nIn January, for example, Arbitrum had almost caught up with Solana, both at 22 billion, so it is evident that the overtaking of the last week is due to a perhaps temporary boom, largely driven by memecoins.\n\nIn November 2021, at the peak of the bubble, DEXs on Ethereum recorded a record of $107 billion in monthly trading volumes, followed by $74 billion on BSC.\n\nThey were numbers far superior to the current ones, so it seems that there is still room for growth for DEX. At that time Solana didn’t even make it into the top 10, so in just over three years it has come a long way.\n\nEven Arbitrum has grown a lot, because back then it was under 4 billion, while in the first 20 days of March 2024 it is already over 18.\n\nThe prices of SOL (Solana) and ETH (Ethereum)\n\nInterestingly, both ETH and SOL are currently priced 34% below their all-time high.\n\nHowever, in the last seven days ETH is losing 20%, while SOL is gaining 12%. Also since the beginning of the year SOL is performing better, with a +68% compared to the +42% of ETH.\n\nThe key point to understand these differences actually lies in the bear market of 2022/2023.\n\nETH in 2022 has dropped less, and in 2023 it immediately recovered together with BTC.\n\nInstead SOL lost much more in 2022, and especially in 2023 it recovered only in October, when the entire crypto market restarted.\n\nAlthough in some ways it may seem that Solana is challenging Ethereum, in reality for now it is still the latter that dominates, even on DEX (especially thanks to its second layer)."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOeXpsM2NiTDFTa2JRczZ2MElrVDBKcGRYZDlZYXJYOGlUakpCQlRVYTg0ZjYyNXRlOWFTZ3pYU2ltS2JPbmt2cmFCcFkxNVlaSW9jby1SZ2dCQkhFamxpZ2xOZVlXbEdwc2x4ME5xcHQtRzVDbjlCOWFwdWIxbUNvR09DQXR5SGl0UTNJTjdPWS0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum rejected $4,000: Crypto analysis of March 20, 2024 - Cointribune EN",
        "content": "Wed 20 Mar 2024 ▪ 5 min read ▪ by Family Trading ▪\n\nAfter reaching the $4,000 threshold, Ethereum has entered a corrective phase of 25%. Let’s examine the future outlook for ETH together.\n\nSituation of Ethereum (ETH)\n\nAfter marking a high at $4,100, the price of Ethereum has begun a downward movement, countering its last bullish phase active since $2,100. Indeed, the price of Ethereum regained, on the morning of this Wednesday, March 20, $3,050. It is worth noting that this drop occurred after the Dencun update. Has the price of the cryptocurrency already integrated this news? What is certain is that the fall of Bitcoin has contributed to that of Ethereum. The $3,700 support was not solid enough, just like those at $3,500 and $3,200. However, it can be observed that the price of Ethereum rebounded on the Fibonacci 50% level, taken into account from $2,100. Thus, a buying pressure seems to be identified at this level.\n\nEthereum is currently just above its 50-day moving average. The structure remains bullish, but a move of ETH below this threshold could cast doubt on this perspective. As for Ethereum’s bullish momentum, it’s not surprising that it has been revised down, given the direction taken by oscillators and the price of Ethereum itself.\n\nETH/USD Chart (1D)\n\nThe current technical analysis was conducted in collaboration with Elie FT, an investor and trader passionate about the cryptocurrency markets. Today a trainer at Family Trading, a community of thousands of self-funded traders active since 2017. There you will find live sessions, educational content, and mutual assistance around financial markets in a professional and friendly atmosphere.\n\nZoom on Derivatives (ETHUSDT)\n\nThe open interest on ETH/USDT contracts experienced a notable decrease. This reduction came with a liquidation mainly on the buy side and a reduction in the funding rate, hinting at some capitulation by buyers. It is crucial to mention that a reduction in the funding rate can be interpreted positively when it is considered excessively high. Indeed, it may signal a readjustment towards a healthier balance between the market and its underlying asset, thereby helping to alleviate selling pressure that could weigh on these contracts.\n\nOpen Interest / Liquidations & Funding rate ETH/USD\n\nThe heat map of ETH/USDT liquidations over a month reveals that the cryptocurrency is just above a strong liquidation area in a price range between $3,000 and $2,800. Above the current price, there is also an area around $4,100, corresponding to the last peak reached by ETH. As the price approaches these levels, a massive trigger of orders could occur, thus increasing the risk of a period of heightened volatility for Ethereum. These zones thus represent a critical point of interest for investors.\n\nETH/USDT Liquidation Heatmap (1 month)\n\nHypotheses for the Price of Ethereum (ETH)\n\nIf the price of Ethereum stays above $3,000, one could anticipate a bullish continuation up to the $3,600 level. The next resistance to consider, if the bullish move continues, would be $4,100. At that point, it would represent an increase of more than +26%.\n\nIf the price of Ethereum fails to maintain above $3,000, we could envision a return to $2,900 or even $2,800. The next support to consider, if the downward movement continues, would be around $2,700. At this stage, that would represent a drop of nearly -15%.\n\nConclusion\n\nAfter experiencing a peak at $4,100, Ethereum underwent a significant bearish correction, despite a notable rebound to $3,050, a dynamic partly attributed to the influence of Bitcoin’s fluctuations. Although support at various levels was compromised, the rebound observed at the Fibonacci 50% level shows a certain resilience and potential buying pressure. Thus, the cryptocurrency’s structure remains bullish. However, it will be crucial to closely monitor the price reaction at various key levels to confirm or refute the current hypotheses. It is also important to remain vigilant to potential “fake outs” and market “squeezes” in each scenario. Finally, let’s remember that these analyses are based solely on technical criteria, and the price of cryptocurrencies can otherwise evolve rapidly depending on other more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNRUZtWEg4ZXBMbkhQR2dTSWtOU0c2aGF6NW5nZk1yNkVrR1FDQXY5V3MwV2lhMmlWLTAxVkoxMGxNSGVhV1VBSFVIVmF5N3lTdnkwRkJiY25ZLVQ2RC1VLVhSRkFRX2VPY1lueklIczQzUE5jZnJCSGFhUFBWQ3BhNUNNZkV5S184bjAxaVczMTBVZDBk0gGaAUFVX3lxTE4tVU55aUhKT2VHOWl0UWpJX1M1dXF3WWVOazExbjJwQmpkOFk4Y2VYbzg2R3I0NjZzdk14NzVpUUFvQkltOUw1bXhzT1dtVDRHVVJaOWkxRkY0NTRVc2IxeGxIVHlqZFppZFZjS2lfUFpnNC1OcEZ3UEt2b0FDb1JYQ2tVOWFncVhOakptYmJ4SUVFMkJhN2RWZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "US SEC is reportedly gearing up to classify Ethereum (ETH) as a security - AMBCrypto News",
        "content": "US SEC is reportedly investigating Ethereum Foundation, according to a report by Fortune\n\nA post on a similar investigation was made on the Ethereum Foundation GitHub in February 2024.\n\nEthereum (ETH), the second largest cryptocurrency in the market, seems to have finally fallen under the radar of the US Securities and Exchanges Commission (SEC). According to a report by Fortune, SEC has started a “legal campaign” to classify ETH as a security. And, the infamous crypto regulator has served several subpoenas to several companies in relation to an investigation on Ethereum.\n\nSEC reportedly probing Ethereum Foundation\n\nNotably, the commission is seeking for any information and financial records on their relationship with Ethereum Foundation – the non-profit organization that spearheads the development and governance of the blockchain. Moreover, the investigation started right after Ethereum made a huge technical shift – changing its consensus mechanism Proof-of-Work (PoW) to Proof-of-Stake mechanism (PoS).\n\nThe development emerges hours after it was reported that a US state authority was investigating Ethereum Foundation, according to a Github commit. A February 26 commit by Pablo Pettinari, a front-end developer said, “This commit removes a section of the footer as we have received a voluntary enquiry from a state authority that included a requirement for confidentiality.” In addition to this, the commit also had deleted text that said,\n\n“The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a way which requires that contact not to be disclosed. Stiftung Ethereum will publicly disclose any sort of inquiry from government agencies that falls outside the scope of regular business operations”\n\nInvestigation in parallel with Spot Ethereum ETF fate\n\nNotably, the investigation seems to be taking momentum right when the market is expecting the commission to give a green card to a spot Ethereum ETF. The crypto community, particularly the Ethereum community, has been on high the end given that the first application came from Blackrock – the investment management giant.\n\nThe firm had filed for an spot ETH ETF right after it got an approval for its spot Bitcoin ETF earlier this year. And, this move was quickly mirrored by other players such as Fidelity, Hashdex, and ARK Invest. Notably, Fidelity is also looking into providing traders with the option of staking a part of their holdings.\n\nHowever, with the ongoing investigation, it remains unknown how it would impact the applications. In today’s update, the SEC has delayed VanEck’s spot Ethereum ETF, a day after it delayed decision on Hashdex Nasdaq and ARK 21 Shares Ethereum ETF applications."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOX181cWtHWTNWMVE3dV85ZkxWMHBkVDdneU5JekJ3SUlZQURwRm9BRFl4NE4zUjNLaWIzSm9CV1VXYU90RjRaZE03WjJwZ0pVZlhQdFFBbGwxd05NQjFGSUFmRFZ5bWhzRExmLTRyY0E2TGVsa1VENXNKOFNDWkxRMk5rQWQ0MUphM0dFUmE1dlN6RFVJVEhBWGlnLUQ4RE5O?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Crypto Fund and Deposits $100 Million on Ethereum! - Cointribune EN",
        "content": "Wed 20 Mar 2024 ▪ 4 min read ▪ by Eddy S.\n\nThe bomb has been dropped. BlackRock has just declared war on crypto critics. By launching an unprecedented digital assets fund, the investment giant is sending a stinging message. The reign of cryptos is here. Institutional investors can now throw themselves into the fray, heading into the decentralized world. Massive crypto adoption starts today.\n\nThe crypto fund that’s shaking Wall Street\n\nFrom the first hours, crypto investors scrambled for shares of the new fund. In a strong symbolic gesture, BlackRock deposited $100 million in USDC on the Ethereum network. Astonishment in traditional circles. Indifference feigned by seasoned bitcoiners.\n\nThis major event had the impact of an unequalled bombshell. In one fell swoop, the steamroller of institutional adoption of crypto got moving. Goodbye to byzantine digressions about “the speculative bubble”. Welcome to an era of unparalleled recognition for decentralized digital assets.\n\nBecause in reality, BlackRock had simply followed the movement. Faced with the enthusiasm of its wealthy clients, it was impossible to lag behind any longer. The appetite was voracious for direct, secure, and regulated exposure to cryptos. Now satisfied by the firm’s all-in offensive.\n\nThe devastating effect for the financial dinosaurs\n\nThe shockwaves of BlackRock’s initiative will continue to grow in strength. Today, the entire traditional financial sphere is slowly imploding. A colossus with over $10 trillion in assets under management has publicly endorsed crypto by investing heavily in it.\n\nIn the face of this tidal wave, how can the outdated banks and managers maintain their anti-crypto stance? No chance. Overtaken by the insatiable appetite of their clients, they will have no choice but to submit in turn.\n\nInstitutional adoption will morph into a veritable digital gold rush. Hedge funds hungry for returns will join the fray without delay. Family offices and their billions of American dollars will dive in headfirst, forgetting the moralizing speeches of yesteryear.\n\nAlmost overnight, the world of finance will wake up crypto-compatible, almost crypto-native. A handful of holdouts entrenched in their retrograde stance will change nothing of the inevitable. BlackRock will have unlocked the flood gates of mass adoption. Nobody will come out unscathed.\n\nAt the helm, the ubiquitous BlackRock gives the starting signal. New onramps to the crypto ecosystem will emerge in abundance. Decentralized savings products, ETFs traded on exchanges, everything will be possible for the masses. The institutional rush will in turn generate massive popular adoption. And as the first dust settles, the most astute will realize. No, BlackRock won’t just have opened the floodgates of crypto investment. The leviathan will have enabled us to step fully into the era of decentralized digital abundance. A new civilization is rising.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPb0taLTBJeU9YTmpka2NuUldSSFpldjk3SWJwLVdjb1ZVRGdVUEpYWjRXeGZiMmdmUDVnLWtURlNva3BjSkdhSWNfR0R3dkVTcUdZc3VjRWZXX2VQcXhtT2F0S2xDNURZbTNrN29jaWxsTHRxRGJ0MmdIam9mU29QMWFEem9wTm1PMzFNNnhCMl9Uay0yQ2trR0tBdFBQSl9BVVHSAacBQVVfeXFMTnJTbUU4ckVITnlQY25VbndJTWxwU0lBemluSnNHanJMQ094NFBDQUpCcEk5RHhkNndqMTMtTm9PMFh3eFI1N0M5dlZFQ1EyUEJTclFFTF9KUUgwNm9iOHdpelh5X2pBTGRZd3FZOVFZX1lWUE1fdk4tT0RzTVpUWDFUVlpsLUs5RzdBcjFIRkwtZ3lmTm9scnR0czROeG9HRzBfaDE4RnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Is Smart Money Buying Or Selling ETH At $3,300? - CoinGape",
        "content": "Ethereum price prediction: Ether flirts with short-term support at $3,300 barely a week after climbing to a new yearly high of $4,095. For some investors this correction means panic.\n\nHowever, savvy participants, otherwise referred to as smart money, are acting by scooping up the liquidity following $122 million in liquidations, according to Coinglass data.\n\nadvertisement\n\nEthereum Price Prediction: What’s Next After Holding $3,300 Support\n\nTraders are deliberating whether to buy or short Ethereum price at $3,300 support. Unfortunately, there is no easy answer to the dilemma, especially with the Relative Strength Index (RSI) bouncing back to 42 after testing near oversold levels (30 and below).\n\nThe bullish outlook from the RSI alone may not be enough to call for immediate buy orders, but if ETH price closes the day above $3,300, stability could begin to return on the battered market.\n\nThe Money Flow Index (RSI) which tracks the flow of money in and out of Ethereum shows that buyers are regaining strength. As more people bet on the dips, the MFI climbs towards the overbought region. In turn, buying pressure will ignite a new uptrend, aiming for gains above $4,000.\n\nIndicators like the 200-day Exponential Moving Average (EMA), the 50-day EMA, and the 20-day EMA signal that the correction in Ethereum may be far from over.\n\nAttempts to recover to $4,000 must take place aggressively, otherwise, more losses will could leave a deteriorated technical structure, resulting in prices dropping to $3,000 in the short term and $2,500 in the medium term.\n\nIt is also worth keeping in mind that Ethereum price currently holds below the previous day open at $3,520. A break above this level in this session could imply that Ethereum starts the next session on Wednesday stronger, encouraging traders to keep buying instead of selling.\n\nThe most robust resistance lies between $3,739 and $3,839, as highlighted by the IOMAP model graphically prepared by IntoTheBlock. More ETH coins are experiencing unrealized losses compared to those in profit. Precisely, 4.46 million ETH roughly 34% are in the money and 8.7 million ETH approximately 8.7 million ETH are out of the money.\n\nSupport areas have shrunk significantly since the weekend as observed with the green circles on the chart. Therefore, investors must move strategically to ensure that they avoid falling into more traps.\n\nThe most solid support in the range between $2,832 and $2,932 represents 1.61 million addresses which purchased 1.32 million ETH at an average price of $2,887. This region will come in handy for the bulls if downward pressure overwhelms the demand at $3,300 and $3,300 causing a larger sell-off.\n\nOn the upside, for Ethereum to strongly flip bullish, the price has to break above the thick supply area highlighted between $3,739 and $3,839. FOMO may kick in as ETH climbs above $4,000 bringing the all-time high above $4,800 within reach.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNc0RySzNFblBvM29xVEJUQzdGUjZwb1VQZVV2T3ZsenpCX3lScFJMYlVwUW1RRXpGUlVIZFNHdDR3SnBEVEI3VHcyQVZiR3RrOWZmY2NJVWVwcG5mQndMeFBBSlY0Z1NPckZ2X0hDWVlpNFo2YW50dTE3dXgyVTJSUURKNDHSAYoBQVVfeXFMTnZQVHdGVnBMNWtLeUh2ZHBBS1N0U2NpemEzX2VfYUt5RGo4WHpJTnVvX2Y1blJWNW5mdTZRLV9tMnZIcWFkMl9sWE9HX0NyZTFtdHNqZWQ0eXBVOFdyTktLSi1qaENUN1dlMXdTWm9oNnY1eGFNWURQQXljbzJ5Q1k4Wi0tQlhvTnlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum: All factors that will dictate when ETH crosses $4K again - AMBCrypto News",
        "content": "U.S. investors were crazy about Ethereum earlier this month.\n\nDespite the recent pullback, user activity and demand remained high.\n\nEthereum [ETH] was trading above the $4K mark for close to 48 hours in total in 2024. On the 12th and 13th of March, ETH poked its head briefly above this psychological level.\n\nAMBCrypto reported that supply on exchanges was low, meaning investors need not fear an intense wave of selling pressure.\n\nNew demand for ETH was at a YTD high and the Dencun upgrade went live on the 13th of March.\n\nThis upgrade was branded as the “first step in a long-term strategy” to make the network scale to “hundreds of thousands of transactions per second” by Jesse Pollack, the creator of Base and Head of Protocols at Coinbase.\n\nThe Coinbase Premium grew to highs not seen since the first week of May 2023. This indicated an influx of demand from investors in the United States. However, this was affected by the recent pullback.\n\nU.S. investors were no longer entranced by Ethereum\n\nThe Coinbase Premium is the percentage gap between the Ethereum prices on Coinbase Pro (ETHUSD pair) and Binance (ETHUSDT pair). This metric has trended higher since the 24th of February.\n\nIt has a ceiling at the 0.05 reading since June 2023, but in March, this trend was flipped.\n\nThe index rose as high as 0.23 on the 8th of March. Since then, it has taken a nosedive and fell to -0.1 on the 17th of March.\n\nThis showed that U.S. investors had been enamored by Ethereum earlier this month, but quickly snapped out of it as prices plunged below the $4K level.\n\nIn May 2023, ETH was in a longer-term downtrend when the index shot skyward. This time, Ethereum has embarked on a move that could potentially break its ATH.\n\nHence, the retreat by U.S. investors might pan out differently this time.\n\nSantiment metrics pointed toward strong demand\n\nThe active addresses count trended upward in the first half of March, just surpassing the January highs. It has fallen a bit since then but still maintained a lofty position.\n\nThis uptick in user demand for the network was a bullish development.\n\nThe Open Interest noted a decline alongside the prices to signal short-term bearish sentiment in the market.\n\nThe Funding Rate had been highly positive a week ago but retreated in the past few days, once again underlining a shift in sentiment.\n\nETH wallets with more than 10k tokens booked profits on their holdings earlier this month. This was seen by the swift drop in the supply distribution % figure for the 10k-1M ETH.\n\nThose holding less than 10k ETH did not change dramatically.\n\nThe whales deciding to cash out as prices approached the $4K mark indicated that studying whale behavior could help traders and analysts enormously.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nIn conclusion, some on-chain metrics indicated a bullish outlook. The price trend of Ethereum would remain bullish until we dive below the $3.1k level.\n\nTill then, bulls could treat these dips as discounted buying opportunities."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5wNjRhZkk4cVFLOFJQYnFGaFRHNUtxcEFFTjBmSFF2OVpaV3Z6V096WDhNbkk4Z19MS2xtUlctRjN1d0ZUcFVDajZDRjY3dG1NNVFjMGJOUUtNaDQ1Nzk1WHdEdXVZNjFlS0NSd9IBckFVX3lxTFByTmYzZS1rWEZiNFZRNHIybWx3eVNSODJPUFJpMTVEcGEwR1pzZTU0UWlRSWtnUjUtRDJ0U0NnaVllNnVjdEdYNmZjd1l1UkdHTmJRSFpHU1pMS0pmTFhkOTg0bWpFTG84VE9zaXRXUVE1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Not A Security, SEC Unlikely To Succeed: A16z - Bitcoinist",
        "content": "The crypto industry finds itself at a pivotal juncture as the Swiss Ethereum Foundation received a “voluntary enquiry” from an undisclosed “state authority” which demanded confidentiality, as Bitcoinist reported yesterday. This revelation, made through the removal of the Warrant Canary from its website and a note in a Github repository, marks a first in the foundation’s history.\n\nA little later, a report by Forbes surfaced, claiming that the United States Securities and Exchange Commission (SEC) is the agency, trying to declare ETH as a security. This action comes in the wake of the SEC’s approval of Bitcoin ETFs in January and the looming mid-May deadline for spot ETH Exchange Traded Funds (ETFs).\n\nThe SEC’s inquiry seeks extensive documentation from US companies on their interactions with the Ethereum Foundation, particularly after Ethereum’s transition to a Proof of Stake (PoS) model. Seemingly, the SEC’s probe of the Ethereum Foundation aims to categorize Ether as a security, particularly after Ethereum’s transition to a PoS in September 2022.\n\nA16z SEC’s Security Probe Into Ethereum\n\nIn response to the SEC’s actions, Brian Quintenz, Global Head of Policy at Andreessen Horowitz (A16z), a leading venture capital firm with significant investments in the crypto space and $35 billion assets under management, has vocally opposed the SEC’s attempt. Quintenz, through a series of statements on X (formerly Twitter), laid out a cogent argument against the SEC’s probe.\n\nQuintenz stated, “Reminder: When the SEC allowed ETH Futures ETFs to trade on its regulated security exchanges, it explicitly acknowledged the status of the underlying, ETH, as being a non-security and outside of its jurisdiction.”\n\nHe further elaborated on the significance of the SEC’s decision post-Ethereum’s transition to a proof-of-stake (PoS) model, saying, “Importantly, this [futures] ETF approval decision in October 2023 occurred well after Ethereum changed to PoS in Sept of 2022; meaning that to the SEC, ETH, in its present state as of Oct 2023, was not a security.”\n\nQuintenz argues that any doubts regarding Ethereum’s regulatory treatment should have been resolved with the futures ETF approval, indicating a clear stance from the SEC that Ethereum does not fall under its jurisdiction as a security.\n\nHighlighting the potential contradictions in the SEC’s approach, Quintenz pointed out, “If the SEC had any doubt about the regulatory treatment of ETH in Oct 2023, it wouldn’t have approved the ETF. If ETH were in fact a security, then the CFTC-listed futures contracts (on which the ETFs were based) would be illegal, as any derivative on ETH would be considered security futures contracts and subject to different rules, listed on different exchanges and subject to joint SEC/CFTC jurisdiction.”\n\nCoinbase CLO Weighs In\n\nEchoing Quintenz’s sentiments, Paul Grewal, Coinbase Chief Legal Officer (CLO), reinforced Ethereum’s classification as a commodity rather than a security. Grewal took to X, articulating, “Millions of Americans hold ETH; it has been vital to crypto since its 2015 launch; and ETH is a commodity, not a security.”\n\nHe backed his argument with references to previous statements by SEC officials and the consistent position of the Commodity Futures Trading Commission (CFTC) and federal courts. Notably, Grewal argued, “Ex. C. And even very recently, the SEC’s trial lawyers continue to compare ETH to BTC,” indicating a longstanding regulatory perspective that diverges from the current SEC probe.\n\nThe crux of the argument against Ethereum’s classification as a security lies in the application of the Howey Test, a legal standard used to determine whether certain transactions qualify as investment contracts. Grewal contended, “Even if we were to apply Howey, ETH utterly fails that test, and nothing about the merge changes that conclusion.”\n\nSigh… again with the ETH misinformation as we await a decision on ETH ETPs. Ok–let’s talk about some basic facts about Ethereum. Millions of Americans hold ETH; it has been vital to crypto since its 2015 launch; and ETH is a commodity, not a security. 1/10 — paulgrewal.eth (@iampaulgrewal) March 20, 2024\n\nAt press time, ETH traded at $3,507.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5hc1ZxcndJRnVaaDRmamt6Y3BzVEY2RDAwaHZlRDlpTHBRSVJ6bGZfR0d4bFhyQjRRV3M2RVNDSEIxVUY3NnI2eDFvQU9obWszV2Z1dGJwSUNQdTI2c0hUYzlpcVJyWFVDckpIWmwwb3BXOTlBTlNmak5R0gGCAUFVX3lxTE8tUjVKQjBHTjJwTldzNHJ6VE1SdTVnUXlFXzNLSHRxOW5TN2gzT0ZnNWxlY3E5clZpNGJqdDUycVNvZ19BQW04eGlVYVRCZG1FcXY2TTRjdlNNcnBQcUZ1Z3pMWU8xcV9jVElGZXIxMlRzc3ZaMkM4Uk9GeHNUVHpsNkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum See Red as Crypto Market Boom Turns to Gloom - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMarkets are seeing red early Tuesday morning as Bitcoin drops 7% and Ethereum lags 10%.\n\nThe global crypto market cap has contracted by 8% since yesterday, having dropped below $2.5 trillion after last week getting within 5% of matching its all-time high market capitalization crypto markets last saw in early November 2021.\n\nAt the time of writing, the Bitcoin price is $63,142.39 after having briefly dropped below the $63,000 mark, according to CoinGecko data. It's been a rapid change of scenery for Bitcoin traders. BTC set a new all-time high by inching above $73,000 last week.\n\nAD\n\nAD\n\nEthereum has fared even worse than Bitcoin.\n\nEarly Tuesday morning, the Ethereum price was $3,230.05. That's a 10% drop since yesterday and 20% lower than it was this time last week, when the Ethereum community was ramping up for the Dencun upgrade to go live on mainnet.\n\nThe stark Bitcoin and Ethereum price drops mean that a lot of long positions opened by optimistic traders have been liquidated, according to CoinGlass. In the past day, more than $500 million worth of long and $100 million worth of short positions have been liquidated across digital asset contracts.\n\nWhen a trader opens a long position, it's essentially bet that an asset will increase in price by a certain date. Ideally for investors, they only sell the asset once they've realized some gains and want to take profit. But in extreme cases, an exchange or brokerage can force a trader to liquidate because the asset has seen a big drop in price.\n\nAD\n\nAD\n\nMeanwhile, many of the meme coins that were stealing the show a few weeks back have seen even larger losses. That's usually the case for meme coins. When the market's largest assets, like Bitcoin and Ethereum see price movement, memes can especially volatile and see outsized gains and losses.\n\nSolana meme coins Dogwifhat (WIF) and Bonk (BONK) have dropped 22% and 19% respectively in the past day. And Floki Inu (FLOKI), one of their Ethereum-based Shiba Inu-themed meme coin competitors, has shed 20% since yesterday.\n\nEven Jupiter, the Solana DEX that yesterday pledged to help out the Slerf presale buyers who just lost $10 million, has seen its JUP token drop 16% since this time on Monday."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE45Q2ZObGFXSkZWU2wzelg5akRTWTdiOVFLdG1hMjBSVUdZbWNxTzNvRVlwZmlFMC1Id0c4NTNCdjJWcjVqcUNBSTFSZDJDd0s3c0ZSbldwMGYwUWp5ajdxbXNhQnBra2s4UFZDRFQzWnNJV0I2c0RrdVhhLUTSAYIBQVVfeXFMUFRXcnpMZEMxMTMtTlYxZlllVGdGV3lHbHBoZTRXWlVBOUswYm43SEZkbTJsZWxGdmc5RDk3ems1ZlBVR3VlRE1XaDhwRWhnN2JCTWptXzQ4a0M1Q3BGbVJvaW9ucUI5Nk5KUFRZZHhhMTRlZURNMkNpbEtSWlFyTzZNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Crypto wallet providers urged to rethink security as criminals drain them of millions - The Register",
        "content": "Infosec researchers are noting rising cryptocurrency attacks and have encouraged wallet security providers to up their collective game.\n\nCheck Point specifically cites the growth of attacks that abuse Ethereum's CREATE2 opcode, dubbing it a \"critical issue in the blockchain community\" that's seeing millions of dollars worth of assets being drained from victims' wallets.\n\nIntroduced in 2019, CREATE2 is seen as a significant advancement for Ethereum, allowing for more efficient deployments of smart contracts – the technology that validates transactions on the blockchain.\n\nCREATE2 is also the function that's being exploited by attackers to drain tokens from victims' wallets.\n\nOne of its key capabilities is being able to deploy smart contracts to pre-determined addresses, making the entire process more predictable for the blockchain when dealing with multiple contract interactions across the ecosystem of decentralized applications.\n\nBy pre-determined, it means that an attacker can create temporary, single-use addresses to receive a victim's assets. New addresses can be used for each attack, and this is crucial because wallet security providers rely on previously held data to flag potentially malicious transactions. If the address has no dodgy history, it's likely the transaction will evade these detections.\n\nThe fact that attackers can set up a contract before deploying it (before it even exists), using a wallet address that doesn't have a history of malicious activity, means that if they can get the victim to approve a contract they can drain their funds.\n\nOf course, this requires some social engineering hijinkery to pull off, but we've all heard about the real-life scam stories that sound too wild to be true, but are. This attack works, and has facilitated huge single-transaction scams in recent times.\n\nThe researchers highlighted one fraud in January that saw attackers make off with $3.6 million worth of SuperVerse tokens in one fell swoop as an example of how serious these incidents can be for victims.\n\nRemember: with blockchains, there is no legal recourse and no customer helpline to recover funds. Once they're sent and signed, that's it – tokens are gone for good.\n\nHow they work and why they work\n\nThe attack flow is as follows. First, an attacker needs to get a victim to approve a contract that hasn't yet been deployed – the bit that requires social engineering. They then use CREATE2's ability to generate new contract addresses to receive the funds and deploy the malicious contract, complete with the victim's authorization, in turn draining the victim's wallet.\n\nThe key part here is the generation of a new wallet address, one that has no history of being reported for criminal intentions. CREATE2 generates this using a calculation that includes four parameters: the attacker's wallet address, a constant prefix, a salt, and an initialization code.\n\nThis address will be created only when the victim approves the contract, meaning it's never been used before for any illicit dealings, and won't be used again, thereby bypassing the security protections that usually monitor such transactions.\n\n\"The exploitation of the CREATE2 function underscores the continuous battle between innovation and security in the blockchain sphere,\" said Check Point researchers Oded Vanunu, Dikla Barda, and Roman Zaikin.\n\n\"As Ethereum continues to evolve, so too must the security mechanisms designed to protect users from such sophisticated attacks. Awareness and education are the first steps in safeguarding digital assets against emerging threats. Blockchain developers and users alike must remain vigilant, continuously updating their knowledge and security practices to navigate this ever-changing landscape securely.\n\n\"This vulnerability highlights the need for enhanced security measures in wallet security products to adapt to the evolving tactics of cybercriminals, ensuring the safekeeping of digital assets in the face of innovative exploits.\"\n\nThe big business of crypto attacks\n\nTowards the back end of 2023, we saw a string of high-profile wallet-draining attacks netting cybercriminals hefty sums, and the attacks weren't localized to just the Ethereum blockchain either.\n\nJustin Sun, founder of the Tron Foundation and owner of Poloniex, a crypto exchange that was drained of circa $120 million in November, offered a reward for the attackers at the time to return the funds they stole.\n\nThe Monero Project was also mysteriously drained of nearly half a million dollars just days before, and 5,000 Atomic Wallet users were drained earlier in the year – just a few of the high-profile incidents that took place in 2023.\n\nWhile not all of these have been directly attributed to CREATE2 exploits, researchers told The Register that it seems like North Korea's state-sponsored Lazarus gang may have been behind a sizable proportion of them.\n\nThe web3 anti-scam solution provider ScamSniffer analyzed a series of CREATE2 incidents between May and November 2023, concluding that almost $60 million had been stolen from around 99,000 victims. ®"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNRXhvOGREclppNFZmRUZsRkh6c1VpZjJHM1MtSlRtRVJTaWkybVFQMDZXMGRiVV90Qnk3N2tEMVlwWnBPR2czTkttLV9kNUxXXzB3TUNUTE9uRExRWG1MUGlUUXNEX05TMGkwcG9JVDQ4bVllOVRrLW9vbFkxMUZHdVhPTFB6Y1RZVFM2TWowYWZPaVBsNDc00gGcAUFVX3lxTE5WUTdsaTZneThpV2tVbVdTS0xtcmRXSXlBMUdoRmNoQ2pLSzZuNjIzWjRodGR3YXNCVlVNaEdCQTNYeUNoRVhMWHpwbnBiVVFfVTN4Y1hWQ08zZjBESWtGSmI3WkN5ZVBjVktqX1E4SE1fc2EweHJwOXRPZUNEeFNkcVp5U0MtSVZaMFJvbHlYT2JBWGkyRVAzb0t5bQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Pivots to RWA, With Planned Ethereum Tokenized Asset Fund - CryptoPotato",
        "content": "On March 19, BlackRock revealed that it is preparing to offer a fund through a partnership with digital asset tokenization specialist Securitize.\n\nAccording to a filing to the US Securities and Exchange Commission, the Wall Street giant plans to launch the “BlackRock USD Institutional Digital Liquidity Fund.” However, the total size of the fund was not disclosed.\n\nIt feels very good for Ethereum, commented Galaxy CEO Mike Novogratz on March 20.\n\nBackRock Pivot to RWA\n\nThe fund will be based on the Ethereum blockchain and will trade under the ticker BUIDL. The Ethereum address hosting it had its first transfer around two weeks ago, according to Etherscan. It contains 100 BUIDL tokens and has one holder.\n\nBlackRock’s real-world asset (RWA) tokenization partner, Securitize, is already working with KKR, Hamilton Lane, and others on tokenized funds, reported Bloomberg.\n\nHowever, the new product is only available to institutional investors, with the minimum investment accepted set at $100,000.\n\nRWA tokenization is a process of putting traditional assets such as gold, commodities, treasuries, and real estate on the blockchain. It has been predicted to become a multi-trillion-dollar industry over the next decade, and Wall Street wants in on the action.\n\nBig banks such as JPMorgan, Citi, and Bank of America are all experimenting with RWA tokenization.\n\nPrivate wealth management firm Bernstein has estimated that around 2% of the global money supply, roughly $3 trillion, could be tokenized on the blockchain over the next five years. Additionally, Citigroup has estimated the tokenization market could swell to $5 trillion by 2030.\n\nETH Price in Retreat\n\nMoreover, the news of the fund comes amid hopes that a spot Ethereum ETF may be approved by the SEC in May. However, analysts have been lowering their odds of approval since the regulator has disengaged from fund issuers, and staking complications could arise.\n\nBlackRock is among the fund managers that have applied for a spot ETH ETF following the approval and success of its Bitcoin product.\n\nEthereum prices did not react to the news and retreated a further 5.8% on the day, falling to $3,150 during early Asian trading on Wednesday.\n\nETH had recovered marginally to trade just above $3,200 at the time of writing, but the crypto correction looks set to deepen.\n\nEthereum has fallen 21% from its 2024 high of $4,070 on March 12 and remains 34% down from its peak price in late 2021."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOVGRTQjVTb3hJby1XcFpta056UG5ybk1vV1p2ZEtjLTVWYnJKN1JLcW9CSmxReFppYUh2ZkpONHowQWc3Q19iWkFvVWlMMG40YzRNZHZDZGlhSHUyS2NwOTJlZGZoUndjRGkxLVVtdjBFS2NqTFNVNXlKemV0Ni1IME03YXlHd3BvNVRIdlNIYlVXX09FNHd5OGZQQV_SAaIBQVVfeXFMTVJGOUs4TTRWbGpyaHZmTktFOGdvXzdKbmdxQzE1Mmx5ZGZJLWhGbjloVkRySERjZTJiSF9JZzlLalRpb29kckFjUWZtQmR2Y1c5a0NjQ19neHZqZGE2TUZiazBpamdrcUpMY2U0cHYxbFBLdTBZRDJzQ29YZVBuZmJrLVd5V0tMTEp3VzBTamV2M19FVzhCS2tjc2Z3OXRlaVFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Risks $24M Collateral Liquidation If ETH Falls To This Level - CoinGape",
        "content": "The decentralized finance (DeFi) ecosystem found itself on shaky ground as liquidations soared. In the last 24 hours, the DeFi ecosystem witnessed more than $5.4 million in collateral liquidations of which Ethereum (ETH) held a massive share. This comes amid the Ethereum price drop to $3,200 after it neared rhe $4,100 mark earlier this month.\n\nEthereum Price Drop Risks Massive Collateral Liquidation\n\nThe DeFi sector witnessed $4.27 million collateral liquidations tied to Ethereum alone, according to Parsec data. Moreover, amid the Ethereum price volatility, the data suggest massive collateral liquidations if ETH nosedived to $3,008. At this level, an enormous $24 million worth of ETH in collateral would be liquidated.\n\nadvertisement\n\nAdding fuel to the fire, on-chain derivatives exchanges, including GMX, Kwenta, and Polynomial, have collectively triggered liquidations surpassing a staggering $52 million in the same period. As Ethereum’s price dipped to $3,200 from its recent $4,100 peak, short traders realized their profits by buying back their positions.\n\nHowever, long position holders indulged into panic selling to minimize their losses from the recent ETH price crash. According to Coinglass, Ethereum registered $120.27 million liquidations in the last 24 hours of which a staggering $103.54 million was liquidated by long players.\n\nWhilst, short traders accounted for $16.73 million liquidations. The significant long liquidations could lead to a further ETH price slump. In addition, the heightened Ethereum collateral liquidations could add to the bearish turn. Furthermore, Ethereum open interest fell 3.49% to $12.52 billion as derivatives traders pulled their money out.\n\nAlso Read: Ethereum (ETH) Price Reversal Unlikely Soon As Majority Holders Still In Profit\n\nETH Price Plunges 9%\n\nThe Ethereum price crash over 9% today amid increased sell pressure. At press time, the ETH price plummeted 9.53% to $3,230.82 on Tuesday, March 19. Whilst, the crypto boasted a market cap of $387.84 billion.\n\nOn the contrary, the ETH 24-hour trade volume spiked 64.25% to $28.97 billion owing to the recent liquidations and whale selloffs. Earlier this month, the Ethereum price peaked at $4,092.28 but couldn’t surpass $4,100 owing to the recent bearish turn.\n\nMoreover, the Federal Open Market Committee (FOMC) meeting scheduled for Wednesday, March 20, has spurred volatility in the crypto market. Moreover, weak inflows into Spot Bitcoin ETFs fuelled the bearish sentiment, which also affected the entire market, including Ethereum.\n\nAlso Read: Ethereum (ETH) Price Reversal Unlikely Soon As Majority Holders Still In Profit\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPMUpJMTQyZHJ5UFVzSjF4M1V4b3F5MUtBYk9sWDUyakhVUlFOcDZ4bUxfMGRHR3dqemk2dVlkMXJ4Z3pSeXZWR2M2NEtTVTNPazhVMlVNMDNnREpRYXpLdUI3Z2ZEZng4VkZ4cVNvV2MwSXRJOFRRM2dYWE50ckVWWFI0VjJNaFNtdVkxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Market Dynamics Shift: Raffle Coin (RAFF) Sees Surge as Ethereum (ETH) Dips To $3,500 Forecasting 100X Gains - The Cryptonomist",
        "content": "SPONSORED POST*\n\nAgainst the backdrop of changing market dynamics, Raffle Coin (RAFF) has continued to emerge as the top favorite for investors eyeing different opportunities in decentralized online raffles. Where Ethereum (ETH) struggles to hold around $3,500, the surging Raffle Coin (RAFF) has shown potential gains.\n\nThis analysis ahead compares the very different performance paths of Ethereum (ETH) and Raffle Coin (RAFF) as they combat the recent market environment.\n\nEthereum (ETH): Facing Pressure Amidst Profitable Holders\n\nDespite such developments being witnessed at a point where the Ethereum (ETH) Dencun Upgrade is currently undergoing, Ethereum (ETH) keeps on facing an ever-mounting selling pressure with its price being a main negative move of 10% from the recently recorded high at $4,000. But still, these remain profitable for most of the network, specifically 89% of Ethereum (ETH) holders.\n\nAccording to the data from IntoTheBlock, key support levels are emphasized by the huge sell volume flowing at around $3.7K. Price action on Ethereum (ETH) remains weak, battling key support and resistance levels, signifying a number of possible trajectories.\n\nRaffle Coin (RAFF): Investment Potential and Unique Features\n\nDuring the rampancy of Ethereum (ETH), Raffle Coin (RAFF) will shine, providing you with a decentralized platform through which to buy tickets for online raffles. Using blockchain technology, Raffle Coin (RAFF) becomes safe and transparent giving its users the feeling of empowerment. Without any hitches in operations, users can conduct instantaneous draws up to the monthly draws and get to vie for prizes worth billions of dollars. In addition to that, Raffle Coin (RAFF) is a reward for user engagement. It includes an attractive loyalty scheme and a VIP program with the motive to build and motivate users to build a strong community.\n\nWhat sets Raffle Coin (RAFF) apart is the low fees against existing ones, keeping them instant and low and the robust security of blockchain technology. Besides, the presale investor will be enjoying a share of the fees, commission-free crypto swaps and a rewarding program for growth. Presale is still available and offers tokens at a very small amount of $0.016. Having been audited and with permission from Audit, Raffle Coin (RAFF) gives an attractive investment indicating that it promises excellent potential in terms of massive growth.\n\nConclusion\n\nIn brief, Ethereum (ETH) deals with market volatility while Raffle Coin (RAFF) provides an exhilarating wager for the gambler at heart, united by and for decentralized online raffles. With innovative features, clear governance and investment opportunities, Raffle Coin (RAFF) is set with the key ingredients to bring a new flavor to the landscape of online raffles. Expert projections of a 100x surge are backed by all the innovative features this platform offers. Don’t miss out on joining the future of online raffles: sign up at Raffle Coin (RAFF) and join some of their exciting games.\n\nFind out more about the Raffle Coin (RAFF) presale by visiting the website here.\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5LZVdaSTViNHVsSUlidXNLbGZqelJYM0MxUFQtNHdLSU9aRkxwbTJoSlZ0bHFXaWd1ZHJwR053UGt0UzkxVDUxSUloY1FHQjFzX3NrdmRFXzl2RWdBR2Y0ckp4aGdsLVFkYmJvbll30gFzQVVfeXFMTlJqa1hyemI4U2I3Vi1tTW1TbDJYRXNmRFplZjZyMnZGR05YNlg1UW1wWFVrZDBLU3M2TFJaaUV1dlVHb1RHMDBTd0VCN1oxamdpb2xtV3d4Q3VtSnRsNXY0Mzh2d21LZUJ4ZUNzaWdnd3Vidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price prediction and strategy for a $4K comeback - AMBCrypto News",
        "content": "A close above $3,700 could help the price back to $4,000.\n\nThe Pi Cycle Top indicator revealed that the ETH might rally.\n\nEthereum [ETH] seemed to have become a shadow of its former self after the price collapsed from $3,633 to $3,22o in the last 24 hours.\n\nDespite the decline, AMBCrypto agrees that the value of the altcoin might retest $4,000. However, this prediction might not come cheap or easy.\n\nThis is because of the number of addresses that accumulated ETH around $3,700. This has made it a key resistance zone.\n\nAccording to IntoTheBlock, ETH’s previous rise above $4,000 placed 89% of its holders in profit.\n\nWho decided what’s next?\n\nHowever, the recent decline meant that there was a sell wall at $3,700 where 991,000 ETH addresses purchased 4.35 million coins.\n\nWith ETH trading below the region, the holders have an opportunity to break even if the price climbs.\n\nIf the participants decide to book profits, the altcoin might find it challenging to revisit the psychological $4,000 mark.\n\nOn the other hand, if buying pressure outweighs the on-chain sell volume, then ETH might cruise above $3,700.\n\nBut whether the cryptocurrency would continue to languish in the red does not depend on the on-chain outlook alone.\n\nTherefore, AMBCrypto gauged the price action from a technical perspective. According to the 4-hour ETH/USD chart, the Exponential Moving Average (EMA) depicted a short-term bearish trend for the altcoin.\n\nAt press time, the 20 EMA (blue) crossed below the 50 EMA (yellow). With this trend, the price of the cryptocurrency might drop by another 7.30%. Should this happen, the value could hit $3,112.\n\nA look at the Aroon Indicator also reinforced the bearish bias. As of this writing, the Aroon Down (blue) was 100% while the Aroon Up (orange) was 35.71%. This indicates that sellers were in control of the price action.\n\nETH is oversold\n\nFurthermore, an assessment of the Supertrend indicated that ETH has not yet flashed a buy signal. But there was an earlier sell signal at $3,780.\n\nMeanwhile, the Relative Strength Index (RSI) was in the oversold region. If the reading continues to decrease, then the chances of a harder bounce might also increase.\n\nIn a highly bullish case, ETH might climb to $4,500 when the market turbulence fizzles.\n\nWhile the short-term outlook looked gloomy for ETH, the Pi Cycle Top indicated otherwise for the mid to long-term.\n\nHistorically, the indicator tells when a cryptocurrency is close to the bottom or has hit the market top.\n\nHow much are 1,10,100 ETHs worth today?\n\nIf the 111-day moving average (MA), in green hits the same region as the 350-day MA (purple), then Ethereum would have hit the top of this cycle.\n\nBut that was not the case, as the 111-day MA was lower than its opposite number. Thus, the price of ETH might have a lot of upside potential over the forthcoming months."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNbkk5M3NVV1g0ZXN0M0VzQVBFU2N0QTkyWGJYV2ZJc09maXZmU2hYbVN4ODBoSUswcnVEeTAxZlBETGx0aVRZenFxMmhuUGRxTHNGSF9KRUpfVHByd01aNXFGOWlGeHlTLWNfWmQxdG55WWxKOWV2MzZIOEpQY3NqY09FUjVrMzBJbGRnR1VSS0EwRm41Sl9XMHc5WllDcmhIZmxvdGpGaVJ2V0k0ZUJhcFhydHEyWktrVGk1d0JOMDhaTC13dkRIdklaYUc4WnBCMk1rYkFTQmZ4NlBXbE1HT2ZBTU0xdDJkdHlzN3pSbEpRYUJwb2VPZEE3NlUxbXhqcVVwQ3drdGhjVERoWGJFTlBUYmRmUlHSAZwCQVVfeXFMTXBoc19EMXd1c1pScVJ6VVJhWl9yd3J3M3RfTG81aTZYSzZKYTRhUjUxd2x2c1Rka3NrOW9ZNVVuNXY3RVBVZ1pDbmxBY1NzXzhTSmZhVHo5eGVkRWRMbnVZaklBNEZWdnVWME9xRXQwV243eU9uUGNRWTV5VUU0dVRMVjEyZmMzZ2dqbE9OQ3QtSDVOZUJLYjVjUlo3bTJoNWJNYXZQUmtNVDczRTkxYXNLT2lpQ1VwQkx4WjdqdkNSenJ3NkVmSGdybk41ajhINGtUZkFHNTZaNHYwMXRuQ3VBVVE1c3JBdnJQVFN6aFJ4RUxwTEhjYXIyeUswT2ZwbEdyZXRTV0IzU29KbmFoY19IMEM5VGRveGZCRVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Polkadot (DOT) and Ethereum (ETH) surges as KangaMoon (KANG) exhibits impressive presale performance - The Times of India",
        "content": "KangaMoon (KANG): A promising Ethereum-based Meme Coin reinvigorates the Play-to-Earn landscape\n\nPolkadot (DOT) price outperforms expectations, attracting Institutional Interest\n\nEthereum Token (ETH): Poised for $5,000 or Headed for a correction?\n\nDisclaimer: The above content is non-editorial, and TIL hereby disclaims any and all warranties, expressed or implied, relating to the same. TIL does not guarantee, vouch for or necessarily endorse any of the above content, nor is it responsible for them in any manner whatsoever. The article does not constitute investment advice. Please take all steps necessary to ascertain that any information and content provided is correct, updated and verified.\n\nThe recent market surge has propelled numerous tokens to new heights in a remarkably short period. This resurgence of the bull market appears to be stronger than previous cycles. In this article, we will delve into the performance of top crypto coins like Ethereum (ETH), Polkadot (DOT), and a new market entrant, KangaMoon (KANG). KangaMoon is particularly witnessing an impressive growth during its ongoing presale phase, experiencing a surge of 125% in value to position itself among the top meme coins to invest in.Based on Ethereum Network, KangaMoon (KANG) is generating significant buzz within the cryptocurrency community during its ongoing presale. Having already surpassed the $1.6M funding milestone, KangaMoon is poised to tick the next $2M milestone before the end of March. This robust presale performance, however, underscores KangaMoon's potential to disrupt the meme coin market as well as capture the attention of crypto and meme coin enthusiasts worldwide.KangaMoon places a strong emphasis on building a vibrant community and fostering creativity. Their platform is designed to empower users, allowing them to participate in exciting battle contests and unleash their imagination by designing unique in-game characters.Setting itself apart in the meme coin market, KangaMoon seamlessly combines elements of Social-Fi and GameFi's Play-to-Earn (P2E) dynamics within a unified ecosystem. The platform's reward system is designed to incentivize active participation across various activities. Users not only earn rewards for playing games but also for completing challenges and engaging on KangaMoon’s social media platforms.During its presale phase, KangaMoon has already demonstrated impressive growth, with its value surging by 125% from $0.005 to $0.01125. At this rate, analysts are optimistic about its future prospects, anticipating further upward momentum. With the potential to reach $1 by Q2 2024, KangaMoon is expected to gain wider traction, especially upon its listing on major Tier-1 cryptocurrency exchanges.Surpassing the performance of established cryptocurrencies like Litecoin and Cardano, Polkadot (DOT) has demonstrated impressive returns recently. Its performance since the beginning of the month not only surpasses these well-known cryptocurrencies but also signals growing institutional interest beyond them. The lower price-to-sales (P/S) ratio of Polkadot serves as a value indicator, suggesting that Polkadot may be undervalued, potentially attracting the attention of institutions seeking untapped opportunities.Furthermore, Polkadot's recent price movements have generated a bullish sentiment, indicating a reversal from a downtrend to an uptrend. With the completion of this bullish formation, the price of Polkadot has already achieved half of the anticipated 31.3% growth, approaching the expected target price of $12. However, the future growth of Polkadot hinges significantly on consistent market support and the ability to surpass the critical $11 level.Ethereum (ETH), the world's second-largest cryptocurrency, has been holding steady above $4,000, fueling speculation of a potential rally to a new all-time high of $5,000. After an impressive 51% surge in February, Ethereum bulls carried their momentum into March. On March 8th, Ethereum triumphantly surpassed the $4,000 resistance level for the first time in three years, marking a significant 20% increase within the first week.As anticipated, this surge triggered a short-lived sell-off, leading to a 3% retracement that brought the price down to around $3,900 within the next 24 hours. However, over the past week, Ethereum continues to trade at a weekly price range of $3,828 - $4,049. Despite the price pullback, a majority of current Ethereum holders appear to be maintaining a bullish stance, suggesting continued confidence in the cryptocurrency's long-term potential.Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!Website: https://KangaMoon.com/ Join the Telegram Community: https://t.me/KangaMoonofficial"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNa1lzQ3FsYXJIUlJ4dGhxOGlqaWNNLU1CVkgwVmJlWEpaM0IwSkY3UVZNVFYzeUlvSTM5dlV2YzdJQ25tMzBiQlAxOFMySXNDRlhZTGF0WUZzdDdUaWxmN21RN0ZUU2tPVFFDN1RrWjVTWTB6TzdfOXRJNjFfYjNBX0xJUTfSAYoBQVVfeXFMTTNvc2puREVubUNxLUd1TTVPODR0dkdfOWYtODVpQWVmUEV2N01fWkNJNjhkaXB5SzJVaE5ROFFEeVBSSmZNSHFzblJiQWdhdzdkdmFzVGFqZ0xWTVlJTW8wM1JzUEs0ZXVfS2I1MWZNZklrdW1XM01GOHV6RG5ZSENPMUpvQk1JSXFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF: Fidelity Adds Staking In Latest Filing - CoinGape",
        "content": "The serial delay of the United States Securities and Exchange Commission (SEC) on spot Ethereum ETF has done little to deter Fidelity Investments as the firm just added the Staking option to its filing.\n\nFidelity To Add Staking to Spot Ethereum ETF\n\nIn November 2023, the American investment management firm applied to list its Ethereum spot ETF product with the SEC. This made it the 7th firm in the U.S. to gravitate towards the product after the likes of BlackRock, Hashdex, Invesco, and Grayscale Investments.\n\nadvertisement\n\nThe spot Ethereum ETF, if approved, will trade in compliance with the BZX Rule.\n\nOrdinarily, the SEC is expected to decide on the rule change within 45 days of its publication for public comment. However, the decision from the agency did not come as expected even after the request for public comment was made in the first week of December. Rather the SEC announced a 45-day extension, pushing its decision on the Fidelity spot Ethereum ETF to March 5.\n\nFIDELITY ADDS STAKING TO THEIR ETH ETF APPLICATION IN AMENDMENT Source: DB | Coins: ETH — db (@tier10k) March 18, 2024\n\nIt is already way past the expected date and no decision has been made by the SEC on Fidelity’s spot ETH ETF or that of any other applicant. As it continued waiting for the SEC, Fidelity decided to add staking for the cryptocurrency. Precisely, the asset management firm is looking to stake a portion of the fund’s assets through one or more trusted staking providers.\n\n“In consideration for any staking activity in which the Fund may engage, the Fund would receive certain network rewards of ether tokens, which may be treated as income to the Fund as compensation for services provided,” Fidelity stated in its amended spot Ethereum ETF filing.\n\nDeadline Fast Approaching\n\nIn the meantime, the duo Ark Invest and 21Shares are still anticipating a decision for their joint spot Ethereum ETF by May. Also, industry observers are closely watch the May 23 deadline for VanEck’s filing, a make or mar point for the product.\n\nConsidering how much the regulator has consistently extended the date for its decision, it is not certain that the SEC will stick to the next deadline. Top industry players like JPMorgan already doubt the possibility of the SEC’s May approval for Ethereum ETFs.\n\nStill, the recent move from Fidelity Investments to amend its filing suggests that these spot Ethereum ETF applicants are doing their best to keep hope alive.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9FeUgzbVQwcWdveHdOSjFCbFI2MDlUTGsxbG11WHZPMno4RWFIa2dzMDdKVExiMFd4R0kyaWpTalA2Y0FkcVFraUUyb2pjZldEdWZxeUcwdWZJSzFTYU9vRG9uN2FxTl9EZTk2UkotUXREWmF2WnfSAXtBVV95cUxQQ0NoUmx1RjhFSEsyN2tHR0F6dDFoSU5DcjRNcEhWVF9OLTZPZTdnQ2RSc09Wa2ZzYk5YN0RsWUd1VWExLWQ0eF9PazdQc244OVdKUzlIM0xtMnZFRGVsR1JCS2YzZnRucFJZNVo0QnpySjdfSmxPVzBOdFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Welcomes BlackRock's Yield-Bearing Stablecoin - Bitcoinist",
        "content": "On Wednesday, BlackRock, the world’s largest asset manager, announced the launch of its first tokenized fund on the Ethereum blockchain, marking a significant stride in bridging the gap between traditional finance and digital assets. The BlackRock USD Institutional Digital Liquidity Fund, known as BUIDL, aims to provide qualified investors with US dollar yields through blockchain technology.\n\nBlackRock Chooses Ethereum\n\nAccording to Robert Mitchnick, BlackRock’s Head of Digital Assets, the introduction of BUIDL is a continuation of the firm’s commitment to innovation within the digital assets space. “This is the latest progression of our digital assets strategy,” Mitchnick stated, highlighting the goal of developing solutions that address real-world client needs while expressing enthusiasm for the collaboration with Securitize.\n\nSecuritize is proud to announce we have partnered with @BlackRock. Together, we’re launching BlackRock USD Institutional Digital Liquidity Fund (BUIDL). BUIDL will provide investors with the opportunity to earn U.S. dollar yields by subscribing to the fund with Securitize… pic.twitter.com/nDsNehOXJU — Securitize (@Securitize) March 20, 2024\n\nTokenization is at the heart of BlackRock’s digital asset strategy, with BUIDL enabling the issuance and trading of ownership on the Ethereum blockchain. This approach not only widens access to on-chain offerings but also ensures instantaneous and transparent settlement, along with interoperability across platforms, courtesy of BNY Mellon.\n\nCarlos Domingo, co-founder and CEO of Securitize, emphasized the transformative potential of tokenization in capital markets, noting, “Today’s news demonstrates that traditional financial products are being made more accessible through digitization.”\n\nBUIDL is designed to maintain a stable value of $1 per token, distributing daily accrued dividends directly to investors’ wallets as new tokens each month. The fund primarily invests in cash, US Treasury bills, and repurchase agreements, ensuring a secure yield for token holders on the blockchain.\n\nMoreover, the ecosystem for BUIDL includes prestigious names like Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, setting a solid foundation for the fund’s operations.\n\nThe strategic collaboration extends beyond product launch, with BlackRock making a strategic investment in Securitize and appointing Joseph Chalom, its Global Head of Strategic Ecosystem Partnerships, to Securitize’s Board of Directors.\n\nThis initiative represents a critical juncture in the evolution of digital assets, signaling the increasing integration of blockchain technology with traditional financial instruments. The fund’s tokenized structure offers a glimpse into the future of investment, where accessibility, transparency, and efficiency reign supreme.\n\nEthereum Community Rejoices Euphorically\n\nReactions from the Ethereum community have been overwhelmingly positive, with industry figures like Anthony Sassano and Ryan Berckmans citing the launch as a bullish signal for both Ethereum and the broader crypto market.\n\nSassano, founder of the The Daily Gwei, remarked, “BlackRock launching a yield-bearing stablecoin on Ethereum is still one of the most bullish things to ever happen in crypto and the market has definitely not digested this yet,” underscoring the significant impact of such a move.\n\nRyan Berckmans stated, “BUIDL seeks to offer a stable value of $1 per token and pays daily accrued dividends directly to investors’ wallets as new tokens each month. I hadn’t realized that BlackRock launched *a yield-bearing stablecoin* on ETH. Yield-bearing stables are apex products. Very bullish.”\n\nSeraphim Czecker, head of growth at Ethena Labs added his excitement, stating, “Freaking Blackrock launched a yield bearing stablecoin and you’re not bullish on crypto. We have come a long way.”\n\nAt press time, ETH traded at $3,549.\n\nFeatured image from DW, chart from TradingView.com"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUEUwUFlpU00tZ1gwMmVObTg3ZXQwTEtuQlRxQXJoYnQ2c2Y3Nm1QNHBRSkVYZzFHTF9vTTJWRUNPUmNiajFDVXI0aW5IUVptbW1rMUthX0Z3UFJhVmJwbE9weWxFSy1fZi0wcXN1WTNxN010RmsxblpkM0NDcHlmaGM5ZVJsQld3UHlFX2RoVFI4VVph0gGaAUFVX3lxTFA3Xzh0NzZncEIySzI4cGlNQXZCUGVXR0o2UnlGUUl5eDMyZThfWXJ0MEthWVRCY2Ffa2U1NlNLMjJJWG1ZVlc1MHRpNkFjNGp3aXhWY3A5VXVzUVZjQk5mN0xibTdnZEhNUjREQWItRHhaamxMcDZ5Q0c1RHZyZ0d4TnZYRENsT0ZpdUppMHIzTjBFcWV1MjY5MHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana a better version of Ethereum? Arthur Hayes has this to say… - AMBCrypto News",
        "content": "Solana’s recent performance has revived the old ‘Ethereum-killer’ debate again\n\nComparisons arose after SOL flipped BNB recently\n\nThe Ethereum vs Solana debate took a renewed twist in the third week of March after Solana hit crucial milestones.\n\nFor starters, Solana’s [SOL] search interest on Google Trends surpassed Ethereum [ETH]. This indicates a spike in retail attention to SOL compared to ETH.\n\nAdditionally, SOL flipped BNB based on market cap and climbed into the top 3 in the DeFi ranking.\n\nCrypto influencer Anthony Pompliano recently interviewed Arthur Hayes, a serial investor, co-founder, and former CEO of BitMEX.\n\n\n\nHe asked for his thoughts on the ETH vs. SOL debate, and Hayes offered his candid opinion.\n\n“I don’t think anything is going to be ETH.”\n\n\n\nHowever, he added that Ethereum is the home of DeFi and hosts most of the first versions of dApps (decentralized applications) before they launch on other networks.\n\n“If you think of primitives of DeFi and dApps, the first version is always on Ethereum. It’s not on Solana, AVAX, Cardano, or any other blockchains.”\n\nHowever, Hayes highlighted why DeFi applications might migrate to other networks like Solana.\n\n“Maybe there are reasons like network bloat, gas fees; then they move over to Solana or other chains.”\n\nHe added,\n\n“But you’re not seeing a new primitive emerge on a non-ETH chain first. If I start seeing that happen, I may have to change my mind on my maximalist position on ETH.”\n\nSolana is great if you “missed” discounted ETH\n\nInterestingly, Hayes confirmed that he trades most L1s but categorically highlighted Solana as a great opportunity for anyone who missed cheap ETH.\n\n“Solana is a better version of ETH; I disagree, but that’s what they believe. It could trade to $5K-$10K in this cycle. So buying it at $140 is a great asymmetric risk profile.\n\nAdditionally, he highlighted Solana’s UX/UI as the best in the ecosystem and easy to use. Hayes believes these conditions could make Solana the best performer in this cycle.\n\n"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPR1VZd2xMNXh6SzdudHZDYno2bmh1UU9vOTIybjNpYUM3eU1XY3pYQW9ZWlRqTWFHUVlhczdsc2QwUEdVSmVtdkFyTUJ2d3FFclZZMU1BTFU5NmtydW9sREVLaWFONWVWVGFhWTZ3ZFIxSGUzemE0Q2ZrMDNUb0c2Wm94bDRLdU1KTHJPektoazE4bUNuSjJz0gGcAUFVX3lxTE5TVEZ4QlBOcUgtOC0tTUp2Nm5rRnIxSEFZM1A4ZjZ0X3U0aF9uWndFLWNMdXdqdU02US1TdFVRbDZUcWVmV1ZPcG93djIzMlVPZm5KeVNwWEpzLVRSSWw2Z1ZMMUY1cTlFMVdqajFrQkVOWWd1WmV5WDNkTzFWaWlnd3dYZEtiUjh2LUZlc3FKSmNrVnJiQWcycVdGZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF: SEC hits pause again, is a May launch possible? - AMBCrypto News",
        "content": "SEC’s latest delay announcement has spurred some degree of skepticism\n\nExperts are now revising the odds of an Ethereum spot ETF being approved\n\nThe United States (US) Securities and Exchange Commission (SEC) has pushed back its verdict on the proposed Ethereum [ETH] exchange-traded funds (ETFs) by Hashdex and ARK 21Shares.\n\nThis delay, announced on the 19th of March, precedes the “third deadline” set by the agency, with final determinations anticipated in late May. The announcement underscored that ARK 21Shares’ decision is due by 24th May, with Hashdex’s deadline set for 30th May.\n\nHowever, analysts harbor growing skepticism regarding the approval likelihood of the eight Ether ETF proposals, including those from BlackRock, Grayscale, and Fidelity.\n\nEther ETF approval uncertainties\n\nBloomberg ETF analyst James Seyffart voiced apprehensions regarding the minimal interaction between the SEC and the applicants, raising uncertainties about the future of these ETFs.\n\nHe noted,\n\n“My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round.\n\nHe further added,\n\n“The SEC hasn’t engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall.”\n\nIn recent developments, Eric Balchunas, an analyst at Bloomberg ETF, revised the chances of Ether ETF approval from 50% to 35% and noted,\n\n“I get all the reasons they SHOULD approve it (and we personally believe they should) but all the signs/sources that were making us bullish 2.5mo out for btc spot are not there this time.”\n\nThis highlights the sharp contrast between the Ether ETF and previous Bitcoin ETF approval processes, reflecting the SEC’s minimal communication. Public sentiment mirrored this, with Polymarket odds for Ether ETF approval dropping from 77% in January to 32% by May.\n\nBitcoin ETF vs Ethereum ETF\n\nFurthermore, Grayscale is considering adding staking to its Ether ETF application, outlining proposals in a “consent solicitation statement” to investors.\n\nThe statement highlighted,\n\n“This proposal will allow the Sponsor to cause the Trust […] to use, or permit to be used, any Ethereum held by the Trust in a proof-of-stake validation protocol in exchange for consideration of any kind for the ultimate benefit of ETHE shareholders.”\n\nThis highlights that Grayscale aims to ease inflationary pressures through staking, pending shareholder approval. If approved, Grayscale would align with ARK 21Shares, Franklin Templeton, and Fidelity, who recently integrated Ether staking into their ETF applications.\n\nOverall, it would be interesting to observe the contrast as the SEC greenlighted ether futures-like ETFs but hasn’t approved spot or mixed ether ETFs, unlike Bitcoin ETFs last fall."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNWXBfbS1Md2ZPYl9qSmhXblZtczJ4M0ZkYV9ydW5JU0NqYklFN0U3RkNPNEpyMWE1dXhxQVplZ1hXa1hxajJWb21DN2UyejBOUkpWYjdSR2QyTjR1eDhMQkNtc19JSkZJM3pFaENkSFk5NzBfTkZFalVSV3VEc2Z2LUJjcG5VLUZmRk9WdEtFYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock chooses Ethereum for their tokenised investment fund - City A.M.",
        "content": "BlackRock chooses Ethereum for their tokenised investment fund\n\nTuesday was another record day for the Bitcoin ETFs. This time, it was a new record in terms of outflows, with $326 million leaving the Bitcoin invested funds. Not even BlackRock’s IBIT could save the day with inflows of only $75 million. But, even with the market cratering, it wasn’t all bad news. BlackRock’s SEC filing of their USD Institutional Digital Liquidity Fund to invest in tokenised assets was a reminder how much more money can potentially flow into crypto.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nTuesday was another record day for the Bitcoin ETFs. This time, it was a new record in terms of outflows, with $326 million leaving the Bitcoin invested funds. Not even BlackRock’s IBIT could save the day with inflows of only $75 million. But, even with the market cratering, it wasn’t all bad news. BlackRock’s SEC filing of their USD Institutional Digital Liquidity Fund to invest in tokenised assets was a reminder how much more money can potentially flow into crypto.\n\nLarry Fink previously stated he saw value in an Ethereum ETF, but it will just be a “stepping stone towards tokenisation.” It seems like he truly meant it. Last Thursday, BlackRock submitted a filing to the SEC for their USD Institutional Digital Liquidity Fund, called BUIDL. The fund will invest in tokenised assets on the Ethereum blockchain, using Securitize as their broker. Market participants discovered the fund’s on-chain wallet has $100 million of USDC ready to invest. Since the wallet became public knowledge, it has received an assortment of tokens. The deposits are an interesting form of marketing, with all eyes watching the BUIDL wallet.\n\nThe creation of the fund is a big deal in further legitimising crypto as an asset class to invest in. Since the ETFs, Bitcoin is increasingly accepted as a store-of-value alternative to gold by traditional investors and as a first step into the crypto world. The next step would be to introduce investing in other “Layer 1” blockchains, such as Ethereum or Solana. What BUIDL could potentially enable is step 3. This is investing in assets built on top of Layer 1s, with Ethereum being the obvious first choice.\n\nRight now, information on where exactly investments will go within the Ethereum ecosystem is not available. But, the fund has made it clear, BlackRock is betting on Ethereum, with the chain being able to cater to their tastes. According to DefiLlama, Ethereum has over 55% of the total value locked across all chains with nearly $50 billion. The vast majority of tokens with potential use cases are also launched on Ethereum with the Layer 1 having over 1,000. It is becoming more obvious that this will be the place institutions first dip their toes; either by investing in assets, or using DeFi applications.\n\nWith BlackRock’s nearly perfect ETF approval record and the recent launch of BUIDL on Ethereum, is this an indication there is still hope for the ETF approval deadline in May? T-minus 63 days until we find out."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTE5Pd1RTMVZlQUdGRVlpVGE3bFhjZ3FNQ1dyVlU3enQ3dGYtUXg2V0tRNDJ0MWpqNjhKWGhab2toYWVBZVVYWGc3SjR2Sm9BWHVkVXVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "What is EtherFi? A new approach to Ethereum staking - OKX",
        "content": "EtherFi is a decentralized, non-custodial liquid staking platform that brings positive disruption to DeFi by allowing staking on Ethereum. The protocol offers a host of unique features, including its use of NFTs for validators and integration with EigenLayer for added yields.\n\nRead on to explore EtherFi in detail, including its key features, how it enhances decentralization for Ethereum, the project's roadmap, and more.\n\nTL;DR\n\nEtherFi disrupts DeFi by implementing non-custodial Ethereum staking, granting users full control.\n\nBy incorporating EigenLayer, the protocol increases rewards and boosts the value of DeFi by supporting simpler restaking.\n\nThe introduction of eETH, the project's native token, represents significant progress, streamlining the staking process through automatic restaking and various benefits.\n\nEtherFi's impressive $23 million Series A funding spotlights its fast expansion and strong investor support.\n\nEtherFi's roadmap outlines its future development, including achievements such as implementing DAO governance and improving the accessibility and security of Ethereum.\n\nWhat is EtherFi?\n\nEtherFi stands out in the DeFi space as a liquid staking platform on Ethereum. It introduces an innovative approach by allowing users to stake ETH and earn rewards, while emphasizing a non-custodial framework where users maintain control over their keys.\n\nOne of EtherFi's distinctive features is the development of a non-fungible token (NFT) for every validator participating in the staking procedure. This strengthens the safety and independence of stakers within the system.\n\nEtherFi's operations include integration with EigenLayer, which allows for additional yield earning on top of Ethereum's staking rewards. This integration allows users to engage in restaking without locking up their assets, providing flexibility to those interested in restaking.\n\nThe platform's native token, eETH, complements EtherFi's governance token by enabling users to directly manage the staking and restaking processes. The introduction of eETH has attracted considerable interest for the advancements it brings to the staking industry through its focus on the user, and its unique offerings. These include automatic restaking and the ability to earn rewards from EtherFi and EigenLayer. EtherFi's offering simplifies the staking process and enriches the user experience by offering additional incentives.\n\nEtherFi's robust growth is underscored by its recent $23 million Series A funding round, highlighting the confidence in and support for the project from leading crypto investors. EtherFi's success in liquid restaking has significantly impacted the DeFi scene, as demonstrated by its recent financial milestone. The platform's growth in Total Value Locked (TVL) and its increasing number of users demonstrate the effectiveness of its strategy and the rising desire for decentralized financial options that give users more control.\n\nHow does EtherFi enhance Ethereum's decentralization?\n\nEtherFi enables users to securely stake Ethereum through Operation Solo Staker, promoting a non-custodial approach. The operation allows anyone to run nodes via two 'paths'. Path 1 is permissionless, requires a 2 ETH bond to be put forward, and uses distributed validator technology (DVT) to allow stakers to validate and secure the blockchain. Path 2 sees stakers make a commitment to operate a node for two years and solo stake using DVT but without the need for a bond.\n\nBy making non-custodial staking easier for everyone, whether they're new to Ethereum or have been involved for a while, and dispersing network functions among numerous individuals without depending on intermediary institutions, EtherFi contributes to deeper decentralization for Ethereum.\n\nThe technical structure of EtherFi was specifically created to support a decentralized staking environment. Node operators can enter their public keys through smart contracts, and stakers can select operators to oversee validator nodes.\n\nAn auction system determines the allocation of staking opportunities to operators for greater fairness and transparency in network participation. Additionally, EtherFi offers unique features such as eETH, a liquid staking derivative token, and T-NFT and B-NFT tokens, which offer incentives and flexibility to stakers and node operators. EtherFi also introduces innovative features like eETH, a liquid staking derivative token, and T-NFT and B-NFT tokens, providing flexibility and incentives for stakers and node operators.\n\nApart from its technical achievements, EtherFi has promoted innovation and growth in Ethereum's ecosystem through its service layer, which provides a foundation for others to build out new services from. This not only encourages the creation of new applications and services but also provides a platform for growth and expansion within the Ethereum community.\n\nWhat are the key features of eETH in EtherFi?\n\nAmong its many features, EtherFi has attracted attention for its non-custodial nature, automatic restaking feature, and partnership with EigenLayer for additional rewards.\n\nAutomatic restaking\n\nThe eETH platform has implemented an automatic restaking feature that allows Ethereum staked on the platform to generate extra rewards. By integrating with EigenLayer, EtherFi allows users to validate various software modules beyond the base layer of Ethereum, increasing their potential earnings.\n\nT-NFT and B-NFT for enhanced security\n\nEtherFi's staking method stands out due to its implementation of T-NFT (transferable non-fungible token) and B-NFT (bound non-fungible token). These tokens serve as proof of ownership for staked ETH and play an important role in the safe exchange of validator keys with node operators. The B-NFT is specifically linked to the person holding the validator key, guaranteeing a strong level of security and responsibility.\n\nLiquidity pool and eETH mechanics\n\neETH functions as a rebasing ERC-20 token in a liquidity pool mechanism. This makes sure that an individual's eETH holdings will adjust proportionally to their share of EtherFi's overall Ethereum control. The protocol heavily depends on the liquidity pool, which enables issuing and burning of eETH and T-NFTs for delegated staking.\n\nPermissionless withdrawals and rewards\n\nEtherFi enables unrestricted withdrawals, providing the ability to skim partial rewards and fully unstake without relying on external authorization. This functionality is especially noteworthy in light of Ethereum's recent updates, which give stakers greater control over accessing their rewards and initial funds. This ability promotes fluidity and adaptability in the staking community.\n\nNon-custodial staking\n\nEtherFi empowers users by allowing them to maintain control of their keys. This helps users to stake with confidence as they have complete ownership and control of their assets without relying on outside parties. This method significantly decreases the risk of counterparty involvement with node operators and protocols.\n\nHow does EtherFi's eETH work with EigenLayer for additional yields?\n\nThe introduction of EtherFi's eETH has significantly progressed the liquid staking tokens (LSTs) field by providing a non-custodial staking option that seamlessly incorporates EigenLayer, resulting in improved yield possibilities. Here's how eETH functions within this system to generate extra yields.\n\nLiquid staking and restaking\n\nWith eETH, EtherFi users can stake Ethereum and get eETH tokens. These tokens can be automatically restaked on EigenLayer, allowing users to earn Ethereum staking rewards and additional yields without running their own node. This sets eETH apart from other LSTs, as it provides access to restaking yields through EigenLayer, increasing the potential earnings for its holders.\n\nIntegration with EigenLayer\n\nEigenLayer enhances the Ethereum staking layer's capabilities by applying actively validated service (AVS) modules to verify non-EVM code. This allows individuals with staking and LST holdings, including eETH, to generate extra income by validating applications and services outside of Ethereum's main functions.\n\nSecurity and control\n\nA key aspect of eETH is its focus on security and giving users control. EtherFi uses sharding in its technical design to guarantee that stakers maintain authority over their keys — a major deviation from the usual method of node operators generating the keys. This strategy reduces the chances of risk from other parties and reinforces the non-custodial aspect of eETH staking.\n\nRisks and considerations\n\nAlthough the combination of eETH and EigenLayer offers attractive returns, it's important to recognize the potential risks involved in staking. These include the possibility of flaws in smart contracts and the potential for penalties if an AVS operator misbehaves or validation is unsuccessful. EtherFi has pledged to apply protocol governance when deciding which services to back, to minimize these risks for its users.\n\nWhat is the EtherFi roadmap and its milestones?\n\nEtherFi's was launched to meet developers' needs for a secure, decentralized staking protocol that emphasizes user control and self-custody.\n\nImportant achievements include:\n\nEffectively implementing EtherFi's decentralized platform.\n\nEnabling individuals to stake their ETH in increments of 32 validators through trusted node operators.\n\nPartnering with Obol Labs to incorporate solo node operators.\n\nA significant milestone was the launch of eETH, EtherFi's liquid staking token, which allows for fully permissionless participation in Ethereum staking. The launch helped achieve two major objectives of the project: enhancing liquidity and improving accessibility in the DeFi space.\n\nThe EtherFi roadmap demonstrates the importance of open-source values to the project. EtherFi intends to release its software services and code to the public, promoting transparency while building trust within the community.\n\nEtherFi is also preparing to integrate DVT phase 2, which will create a completely automated process for individual staking and promote Ethereum's more decentralized staking environment. The plan includes implementing DAO governance and a token generation event to establish a collective governance structure that guarantees the protocol's sustainability and flexibility.\n\nThe final word\n\nEtherFi stands out in DeFi by offering non-custodial Ethereum staking, giving users control over their keys. Its integration with EigenLayer allows for extra yields through restaking, increasing its value in the DeFi space.\n\nEtherFi's liquid staking token, eETH, simplifies staking and provides rewards from both EtherFi and EigenLayer. A successful $23 million Series A funding round highlighted the platform's growth and showed strong investor confidence in the project's future.\n\nMany expect further developments for EtherFi, particularly as its roadmap emphasizes innovation, with stand-out milestones including the eETH launch, solo node operator integration, and plans for DAO governance. These developments all aim to make Ethereum staking more accessible and secure for a broader audience."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWkhDeWFEZTVXNmhVRFF5VWgzaGp3ZUxFQTJnUnZYZVlFY2NpQ282aERCTklvUEI4OXBKeXY2MUtTLUJGTmRQLW00X1B6cVNDdkV2V1hVVGNxWU1DbVVtcjM5NWZiNTNpTXBRSTUwVTBDYmxuVV9ocmhKZVY3RTVZTmNFYnJCQ1UzbEs2WVpuNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Crypto: Approval Odds for Ethereum Spot ETFs Stand at 85% - Cointribune EN",
        "content": "Tue 19 Mar 2024 ▪ 3 min read ▪ by Ariela R.\n\nThe potential approval of Ethereum Spot ETFs by the SEC will certainly mark a turning point for Ethereum as well as the cryptocurrency market. What changes would this imply for the Ethereum ecosystem and crypto investors?\n\nCrypto Weekly Roundup: Ethereum Dencun, Market Dumps, & More\n\n\n\nAfter weeks of Bitcoin dominating the crypto news, Ethereum has chalked up another significant milestone – the launch of its much-awaited Dencun upgrade, which went live on March 13.https://t.co/yUkS2PTIfy — Crypto Daily™ (@cryptodailyuk) March 17, 2024 Following the Dencun update, the crypto community is eagerly awaiting the approval of the Ethereum ETFs\n\nThe Ethereum Spot ETFs: A Hope for May\n\nFor several months now, speculation has been rife about the approval of Ethereum Spot ETFs and its impacts on the crypto market. According to My Betting Edge, applications for Ethereum Spot ETFs have an 85% chance of being approved by the SEC in May.\n\nThis anticipation is already generating considerable interest within the cryptographic community. Indeed, it could signify a new era of institutional investment in Ethereum crypto. “Ethereum Spot ETFs could transform the crypto market in May,” highlights the analysis. It sheds light on the potential impact on market liquidity and diversification.\n\nThe approval of these crypto assets would indeed be a significant step forward. It would offer professional investors a direct way to invest in ether, without going through the ether futures contracts listed on the CME.\n\nThe SEC and Ethereum ETFs: A Decision Highly Anticipated by the Crypto Community\n\nThe decision of the SEC is crucial, as it will influence not only investors but also the overall perception of cryptocurrencies. The SEC’s delay in the decision on spot ETF projects and the request from Grayscale Investments has created suspense.\n\nIf approved, the Ethereum Spot ETFs could attract a new wave of cryptographic investors. Above all, it would strengthen Ethereum’s position as a leader in the crypto sector. This could also promote:\n\nincreased diversification of the Optimism (OP) ecosystem,\n\nbetter availability of ZK-Rollups applications.\n\nWhile the Dencun upgrade was a success, the crypto community is eagerly awaiting the SEC’s decision regarding Ethereum Spot ETFs. According to some cryptography experts, the My Betting Edge analysis may have been generated by a chatbot. Nonetheless, all projections are worth considering!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOM0FCdXo5QUJfSnNhWUJVZXNGeGV4RVp4WnVlNWtkVDVjSGFsQnV1ZXpCRjVvZXJaei10SXFBT1h1TmJOUFBtOGkySXVmaFZqNlZ6c2l1QkY5bDhqOVl2VUFiQmZYXzQ5VGtISWxsdjV6VDVLOFgwSVdRb0gwblJJSkdVNmIyaHhDOGNRRNIBkgFBVV95cUxQb0MyNzZ0MDNJWGdXOXU0czRBMGtuOFFnTE8wSmJTUE5ZVlJCVF8tU1Q2Skk0OTQwN0JNM2F6aUJjZVlEQkZRVXpLQnhGTUtxNF96T3dhZi1VRENCd2dCazctLVIyMXpIUHpBWDZnOU9EWjViZDRhaUJVWlZXZEotVW43RkJlODZPOUthOVUxa1F3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin-based collections have an edge over Ethereum NFTs – Here’s why - AMBCrypto News",
        "content": "NodeMonkes logged the second-highest sales volume in the last 24 hours.\n\nBitcoin was the top-ranked chain in NFT sales over the last week.\n\nThe non-fungible token [NFT] market has been known for its ebbs and flows through its brief history, with exciting projects popping up at different stages to pique the interest of enthusiasts.\n\nNodeMonkes makes waves\n\nThe latest sensation happened to be Bitcoin [BTC]-based NodeMonkes.\n\nAs per AMBCrypto’s analysis of CoinGecko’s data, its floor price surged by over 50% in the last 24 hours, propelling it to become the second-largest NFT collection at press time.\n\nA floor price is the lowest price that an NFT can be sold for. In recent years, it has become the gold standard for evaluating the growth of a collection. The higher the floor price, the better.\n\nAs of this writing, NodeMonkes’ floor price was 0.82 BTC, worth over $55k, placed just below the blue-chip powerhouse, CryptoPunks, whose floor price was above $177k.\n\nThe highlight of the surge was how NodeMonkes surpassed the other giant, Bored Ape Yacht Club [BAYC].\n\nThe Bitcoin-based collection also logged the second-highest sales volume in the last 24 hours, totaling over $4 million. This represented a jump of 106%.\n\nA product of the now-popular Ordinals technology, NodeMonkes are a collection of 10,000 unique monkey-inspired digital artworks.\n\nThe NFT grabbed the attention of the market earlier this month, when one of its sales topped $1 million.\n\nNote that this sale came alongside a sharp uptick in Bitcoin’s price, which likely contributed to the USD figure.\n\nOrdinals power Bitcoin’s NFT ecosystem\n\nBut NodeMonkes wasn’t the only Ordinals-based collection making waves in the market.\n\nRunestone, a project led by Ordinals developer Leonidas, saw a 40% spike in its floor price in the last 24 hours to top 0.04 BTC.\n\nThe success of these collections reflected a paradigm shift in the broader NFT landscape.\n\nEthereum [ETH] NFTs have dominated this sector ever since they burst onto the scene in 2021.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nHowever, the introduction of Ordinals has altered the dynamics significantly, causing Bitcoin to become the most-favored network for NFT transactions.\n\nAccording to AMBCrypto’s analysis of CryptoSlam’s data, Bitcoin was the numero uno chain in NFT sales in the last week, followed by Ethereum and Solana [SOL]."
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNOGlLLUd0aGQyRzdnaXVWanc5S25yRms5cWg3aUt0U2Y5Vl9oSDN1R01sMUtDaEsyMGVmTUlEZnpCNnZMSEQ1NmFwMjE1NkROeEpkTHdUcjBFRmtnV2xKUUdLXzNlTjhxMVZ3Y3RUYjA0c3c1YVA3VzhDQzdYNVpHRlVteGQzV2drRHlVR0x4SEJrQ1RDUzlTMEphNnpHOEE1LVV2ZDdYUEFaV2ZWRFY2UkFJNk_SAcIBQVVfeXFMTkFiWTNTbUFuOHhNYW4yUnJLYmJ5OGRiaGM4c3dWSHRTVUlJQVRCUU16a0lBblBaZkhlRndlZGlZMHFJbkZ1RGtQTFRfdHJJWm5feW9PVHdyZVV6ZWdWWElIWnozMmI5TWhLVjd6SFZIWk5SejdqMnlOYjVrYlBJd01LZHI3Y0ZUVGswTlRDSk5LZDI1ckIyNWFqU0UzMzlPUVdZZ19YLTFwTmRmTnRmbldELVZyZXZyRGJTV2FCNGpWWGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "3 Metrics Showing Ethereum Could Drop Below $1700 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPWGY4Z0tOcm80bGhHOVdlYkYyLVpEU0k4ZkowNnM5d3lnWGRING5Jdnh4NGU1aXlZRXhIUTVlUTFlQURjN0lLSWdEcEtpRXJBTXBvcHNpa2tjbzVVdmY5SmZHN29wdVl4Vno3ek9IWXEzZXlhdnFGek9Wc2g4UEVVamJKLUtQMVhRaDNLOWk0MWdmQ1VoUWplWTA0b1o3Yzk1Sk1EdTdPTGtueUVIdzM0NEoxSzZXOHFqdGxheGZzYWHSAc4BQVVfeXFMTnVJdUdTdUVCSHl1SXAtendyRnNNWi1XZHJzaDNPM1JnNUV1RHlFUEV0SG9pQjV6M0hUYlMwZzdCdG1GVU9tTU1hclJxaDdOeHVjcFNrZlRBdW92cngyTkc3YkJRSlVfdFNjSWpnZ3YxYlM0YU0wa3Z6aGV0YkdtMzg2MjAxUDk3SWxRRzB6VWlzUnNMclBrQmFyblBLQmdrWGI3ai1QbnNOMURYdFdvZTJOWE9kMTBWMmFwTllqVzdWZEt1QU15ekNMdGxuTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s Price Adjustment: Understanding the 5.08% Decline - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 99,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNckpUZ3FsVTYzbk9FSDJ1MFlPaDRuaXd0N2twM3BpNFpfM3llTHVUdDd1VEdnb0N0aTdpNzdTVDd6RFpVVDJ1RW0xbzhkb24yd2pBTERObEFxVEJwYm5hWGR2VU02OHFNQkNNTXEyTmVrZ0VaaWpBS0drYW5URHpCcGRrR3F0VlBodVE00gF8QVVfeXFMUE1SWlVpUFowdWgtZm1odkUwOEdTMm9pdFBzUERBMTVXejZvSE00LUpDdG9GZml1RjRKZHo3RHVBci1uX1dvTlJ2bV85S09adWtRdF95ejZUOXJYV3lMOTVEaHlYdHhvbWVwZ0NiSDVvcFpsTHFFVjROZ3dkcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Foundation under investigation - Vijesti.me",
        "content": "Ethereum Foundation Faces Government Investigation; Fortune reports that the SEC is investigating ETH. After publishing this article, Fortune reported that the SEC is seeking to classify ETH as a security\n\nDisclaimer: The translations are mostly done through AI translator and might not be 100% accurate.\n\nThe Ethereum Foundation - the Swiss non-profit organization at the heart of the Ethereum ecosystem - is facing questions from an unnamed \"government body\", according to the group's website GitHub.\n\nThe confidential investigation comes at a time of change in Ethereum technology and a possible upheaval for the underlying asset, ETH, which many US investment firms are looking to offer as an exchange-traded fund (ETF). The US Securities and Exchange Commission (SEC) is slowing their efforts despite recently approving a number of Bitcoin ETFs.\n\nThe co-founder of the blockchain platform Ethereum is Vitalik Buterin and has the citizenship of Montenegro since April 2022. This information was communicated by tthe current Ministry of Finance and Social Welfare (MFSS), headed by current Prime Minister Milojko Spajić. It was then clarified that it was Butera's citizenship was granted in accordance with Article 12 of the Law on Montenegrin Citizenship.\n\nphoto: MFSS\n\nFollowing the publication of this article, Fortune reported that the SEC is seeking to classify ETH as a security, a move that would have major ramifications for Ethereum, the ETH ETF, and crypto in general. The financial regulator has sent investigative subpoenas to American companies over the past few weeks, Fortune reported.\n\nThe scope of the investigation and its focus were unknown until the article was published. A statement on GitHub dated February 26, 2024 said that \"we received a voluntary request from a government agency that included a request for confidentiality.\"\n\nThe Ethereum Foundation did not respond to requests for comment.\n\nPreviously, the Ethereum Foundation website contained the following announcement:\n\n\"The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a manner that requires the contact not to be made public. Stiftung Ethereum will make public any type of investigation by government authorities that does not fall within the scope of regular business operations.\"\n\nThat post was removed from the site on February 26, along with the \"warrant canary\" tag.\n\nA warrant canary is usually some sort of text or visual mark (like a colorful bird, as was the case at the Ethereum Foundation) that individual companies place on their websites to indicate that they have never been served with secret government subpoenas or requests for documents.\n\nIf a government agency requests the information, the company can remove the text and thereby suggest that they have been served with the request without explicitly saying so.\n\nThe Ethereum Foundation had previously mistakenly removed that tag in 2019, but quickly put it back on the site.\n\nA lawyer familiar with the situation said the Swiss regulatory agency may have served a document request on the Ethereum Foundation and may be cooperating with the US Securities and Exchange Commission.\n\n\"I also think we can say that the Ethereum Foundation is not the only entity that they are seeking information from,\" the lawyer told CoinDesk.\n\nThe SEC is evaluating multiple applications for the Ether ETF, but analysts following the process are growing less optimistic that the federal regulatory agency will approve any application, citing a lack of engagement between applicants and SEC officials.\n\n\"Every rumor about every activity\" that the SEC and their foreign counterparts are engaging in can be linked to the May 23 deadline facing the SEC,\" the lawyer said.\n\nBonus video:"
    }
]