[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNMnh5VEg0SGFaaEIzUXAybFpaUlN2SkdLNGRvM1FPcmlvQ29tTF84Z29LbEN2X2ZQang1Q1BZUTNZbEItTVozZkpfeC00cGwyenk5ZmVqU2xnR2d2U0VjRHJRT1pTZm4wQTdmLTcyVTNPeVpzUFBWRlUzaW1LQzUyNmNSRExDdy1rd3NZaWx1LWpBZ2JxTW1adU1NdGVtM3paWEFVNjFvUVpZWUpE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "MIT grads’ $25 million crypto crime puts spotlight on Ethereum front-running - Fortune",
        "content": "If you graduate from the Massachusetts Institute of Technology with elite computer skills, you can make great money working for a tech company—or even more money working on Wall Street. But if that doesn’t grab you, and you want to get even richer, you can always try your hand at white-collar crime like twentysomething brothers Anton and James Peraire-Bueno. The pair came up with a scheme that let them pocket $25 million in just 12 seconds. Unfortunately, it ended badly, as the feds announced yesterday in a press release that reads like a pulp novel.\n\n“Unfortunately for the defendants, their alleged crimes were no match for Department of Justice prosecutors and IRS agents,” wrote the DOJ. For good measure, the release quotes an agent who declares the crime was solved “with cutting-edge technology and good-ole-fashioned investigative work.”\n\nPurple prose aside, the case involves some impressive detective work as well as a sophisticated explanation by Justice Department lawyers of a new type of alleged crime involving the Ethereum blockchain. The crime involves the arcane business of “Maximum Extractable Value,” or MEV, which entails packaging transactions in a block in a way that allows those who construct the blockchain to profit from others’ transactions.\n\nThe miners who build blockchains do not, of course, do this out of the goodness of their hearts. Instead, the process relies on incentives that allow miners—in the case of Bitcoin, Ethereum, and other chains—to obtain a reward in the form of both coins and transaction fees for adding a new block. When Ethereum switched to a new blockchain construction process known as proof-of-stake, however, it created new opportunities for miners to make money—including by front-running trades included in the blocks they package. This is what people mean by MEV. (Bitcoin investment firm River, as well as the DOJ’s criminal indictment, has a good explanation of how exactly it works).\n\nMEV has been around for a while now, and while a number of people in crypto find it distasteful, it is not illegal—and indeed, similar things go on in the world of traditional finance such as the practice known as payment for order flow. The Peraire-Bueno brothers, however, took things a step further when they detected a bug in a popular piece of software used to carry out MEV. This allowed them not to simply front-run Ethereum users’ transactions, but to tamper with them in a way that allowed them to outright rob them.\n\nAll of this is likely to draw new scrutiny of the murky practice of MEV, and potentially lead to calls for reform among the Ethereum crowd. As for the Peraire-Bueno, the episode also showed that people with MIT degrees are also capable of old-fashioned stupidity. Not only did they get caught, but the DOJ also found evidence they conducted web searches about things like money laundering and how to get away with financial fraud. Don’t Google your crimes, people! Finally, the brothers can at least take comfort that they are not the only MIT grads to be charged with crypto crimes—the school is also the alma mater of a certain Sam Bankman-Fried.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe government of El Salvador has mined 474 Bitcoins in the last three years via volcano-powered rigs, contributing to the country's overall holding of 5,575. (Reuters)\n\nCircle is moving its legal base of operation from the U.S. to Ireland, a move that could increase the firm's tax bill. (Bloomberg)\n\nTornado Cash developer Alexey Pertsev is appealing his money laundering conviction. (CoinDesk)\n\nBitcoin jumped back above $65,000 partly in response to encouraging CPI data. (CNBC)\n\nCanadian authorities arrested a self-proclaimed “crypto king” who took $40 million from around 160 investors and blew most of it on travel and luxury cars—a decision that also led to him being kidnapped and tortured by those he scammed. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nBitcoin wallet for sale:"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNE0xSGxNVjRBeEo2eFVtNFMtTWZoUVluNjcwTmtMWEhjVko1YlltSTl3eUxQdHFNal92VXZsN1ZEYWxOTTAtbWYxRllNZFI3V0lNTVVOYzRESVUzMTBvNG5rblNFOUcwYXgxcThqMXBtUmRvY1Q1ZzVYUTRHdzRJd2FnZjFVQ21faTRxQnp1c0NpbTQzMEYzQ9IBngFBVV95cUxOclF1SldjOHRvSHpNS2ZVNE9ydDdHcGNsYWdxS3EtRDFNOHJfd1pod1VrbnZweHg5SjdJNkV4bF9CTXNGdXlhRDREVEhfZ0F3WkR6UU5BZk1pMkdFem5leWFWbU9RVWRRN2sxaks1Z3Myak9KUXp0cExxcm9ucW9sWklBV2lCYThLcWJhZGhoUEtfV2lYMXZySm9Rc25adw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "MIT-educated brothers accused of stealing $25 million in cryptocurrency in 12 seconds in Ethereum blockchain scheme - CBS News",
        "content": "Washington — A pair of brothers from New York and Boston were taken into federal custody Tuesday, accused by prosecutors of devising a novel criminal scheme to steal about $25 million in cryptocurrency from a commonly used blockchain, according to a newly unsealed indictment.\n\nAnton and James Peraire-Bueno were charged with wire fraud and conspiracy to commit money laundering. Investigators accused them of spending months plotting their theft within the Ethereum blockchain, baiting their victims and establishing shell companies to hide their illicit profits.\n\nAccording to charging documents, the pair studied math and computer science \"at one of the most prestigious universities in the country,\" which prosecutors said afforded them a unique set of skills that allowed them to carry out the first-of-its-kind endeavor in a matter of seconds. James Peraire-Bueno is listed as a 2021 graduate of the Massachusetts Institute of Technology, and the MIT Registrar's Office confirmed that Anton Peraire-Bueno earned a B.S. in computer science and engineering in February 2024, and James Peraire-Bueno earned a B.S. in mathematics, computer science and aerospace engineering in June 2019, as well as a M.S. in aeronautics and astronautics in June 2021.\n\nThe brothers allegedly started laying the groundwork in December 2022, engaging in what investigators called a \"baiting\" operation that targeted three specific victim traders on the digital Ethereum platform. They are specifically accused of exploiting the \"validators\" on the blockchain, vital components of the integrity and security of transactions.\n\n\"In doing so, they fraudulently gained access to pending private transactions and used that access to alter certain transactions and obtain their victims' cryptocurrency,\" prosecutors alleged in court documents.\n\nInvestigators said the defendants' plot took months to plan but just 12 seconds to execute, allegedly raking in approximately $25 million from their unwitting victims.\n\nFrom April and June of last year, Peraire-Buenos are accused of laundering their money through shell companies. Prosecutors said the duo even rejected repeated requests from a victim, the victim's attorney and an Ethereum representative to return the cryptocurrency.\n\nThey were arrested on Tuesday and are expected to make their initial appearances in New York and Boston federal courts on Wednesday.\n\n\"As cryptocurrency markets continue to evolve, the Justice Department will continue to root out fraud, support victims, and restore confidence to these markets,\" Deputy Attorney General Lisa Monaco said in a statement.\n\nAttorneys for the brothers could not be immediately identified."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaFItMlVrVTFhOTRaa1pqcUlCdW83Y2VFMnRETk1SZk1pcncweUdiUjUwVXdMbzlGU0FGWW9IdTRUNUVLY2tjZjhyZDVfZm9DWDJaSV9SSkxjYTdrbkw2RkxkZFdQTzhJcDVGOENDekF4MzZ5Mm9aVUllOFB2UzNvN0FURW5vcHpHRlNtTURKMWNtaDVBZlQ5SVN5cHlOQVpxZlNsRlNTeXdsYllFX3FpR2hR0gG3AUFVX3lxTE5UZXh0R2FYbDRHWDdMdzh1NEU4TlBFRVJKV0QxX01TWUs0RnR2MURqLUJvb2d3T29qbmFRVmdlRWVwMEVXRkduQ3AzYmw5SXVQZlRoRjVjOHZrZjI3Wkc1T0NUeUhsRUxMRXp5WVkzLUhZSmhNMEI4S0w3WTVBOWlRU1dKd2pHWjJBNmY2STFCa04tdDRkNk12S09weWdoVl96cG9KX25wcy04UkxWUzR0RG5IZFpTMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Brothers Accused of $25M Ethereum Exploit as U.S. Reveals Fraud Charges - CoinDesk",
        "content": "The brothers created 16 Ethereum validators and targeted three specific traders who operated MEV bots, the indictment said. They used bait transactions to figure out how those bots traded, lured the bots to one of their validators which was validating a new block and basically tricked these bots into proposing certain transactions. The brothers allegedly frontran the bots on certain trades and also used their validator to \"tamper with\" the new block by sending a false digital signature that gave them access to the block's full contents and replaced \"lure transactions\" with \"tampered transactions.\" In those tampered transactions, the brothers allegedly sold illiquid cryptocurrencies they had tricked the victims' trading bots into placing buy orders for."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA2bnhZWjVlWFgwWjdZOExLLUp2aHdKTFNySS13VnlpOWltTng1cUZLdmhNY0JGOHZQSUNoWEJCWEV6V2doNUVtNndDSkR4VXhNdFlab2Z1RW91TUV4eDdLVm1OVmRlT1ZDR3Q5YWFjSHpuaTVyWWfSAWxBVV95cUxOaUpkVWM0Vmdkc2R4UmRJNGNTUDV0RWxsZTJDaDdfLUZjWTNRcExGel9SQXVnemd3VVF6VnJmRUowR2ZaQTJvLU53cWlDM0tnMXJVcXdaVDZtM3RTQ04tNWlMSS11anA4TVZOWDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two former MIT students charged with stealing $25 million of crypto in 12 seconds - CNN",
        "content": "CNN —\n\nTwo brothers who studied at the Massachusetts Institute of Technology were arrested on Wednesday on US charges that they carried out a cutting-edge scheme to exploit the Ethereum blockchain’s integrity and steal $25 million worth of cryptocurrency.\n\nFederal prosecutors in Manhattan called the scheme perpetrated by Anton Peraire-Bueno, 24, and James Peraire-Bueno, 28, “novel” and said the case marked the first time that such a fraud had ever been the subject of U.S. criminal charges.\n\nAuthorities said they executed their elaborate heist in April 2023, stealing $25 million from traders in just 12 seconds by fraudulently gaining access to pending transactions and altering the movement of cryptocurrency.\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,” U.S. Attorney Damian Williams said.\n\nAn indictment charged them with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. Anton Peraire-Bueno was arrested in Boston, while James Peraire-Bueno was arrested in New York.\n\nTheir lawyers did not immediately respond to requests for comment.\n\nBoth brothers had attended Cambridge, Massachusetts-based MIT, where according to prosecutors they studied computer science and math and developed the skills and education they relied upon to carry out their fraud.\n\nThe indictment alleged that for months, the Peraire-Bueno brothers plotted to manipulate and tamper with the protocols used to validate transactions for inclusion on the Ethereum blockchain, a public ledger that records each cryptocurrency transaction.\n\nProsecutors said they did so by exploiting a vulnerability in the code of software called MEV-boost that is used by most Ethereum network “validators,” who are responsible for checking that new transactions are valid before they are added to the blockchain.\n\nProsecutors said that after carrying out the heist, the brothers rejected requests to return the funds and instead took steps to launder and hide the stolen cryptocurrency."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPa2pPbXB5cjdDMEpXekJOaVJTVW5HYmNEWlE2TFFRbmlzUUR3MjgxeWJoQ2FrTnFGUDRBQUdVSzVSSExKOGRKbkREb3FONDd2SFJhVks3V1Fnak5rZmNtM2NSWmpNNXB3TUEzaGIzMGotaW5JQXRZaXF5RVJQQUhZMENjWlNxTzd5T2lkVGMwQTQ2WDNZbW1Meg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "2 arrested for $25 million exploit of Ethereum’s proof-of-stake validators - CoinGeek",
        "content": "Homepage > News > Business > 2 arrested for $25 million exploit of Ethereum’s proof-of-stake validators\n\nGetting your Trinity Audio player ready...\n\nEthereum’s already wobbly foundation looks even shakier following the arrest of two brothers who exploited the network’s vulnerabilities to steal $25 million from transaction validators.\n\nOn May 15, the United States Department of Justice (DOJ) announced the arrest of two brothers—Anton and James Peraire-Bueno—on charges of conspiracy to commit wire fraud, wire fraud and conspiracy to commit money laundering. If convicted on all counts, the brothers face up to 20 years in prison.\n\nThe MIT-educated pair are accused of netting around $25 million worth of tokens in a 12-second span—the duration of a block validation ‘slot’ on Ethereum—by manipulating vulnerabilities in the process by which Ethereum verifies transactions. Damian Williams, U.S. Attorney for the Southern District of New York, said the “novel” scheme “calls the very integrity of the blockchain into question.”\n\nThe scheme involved Ethereum’s so-called ‘maximal extractable value’ (MEV), the process by which Ethereum’s transaction validators can preview and reorder pending transactions. MEV allows validators to personally profit from this advance knowledge by front-running significant or large transactions. European regulators recently flagged MEV for its potential for market abuse.\n\nThe DOJ says the Peraire-Bueno brothers stole funds that would otherwise have gone to a group of Ethereum validators using MEV-Boost. This open-source software outsources the creation of new Ethereum blocks to a network of ‘searchers,’ ‘builders,’ and ‘relays.’\n\nSearchers utilize automated bots to scan the Ethereum mempool for profitable arbitrage opportunities, then forward a bundle of preferred transactions to the builder. This bundle prioritizes the searcher’s ‘frontrun’ transaction, aka buying a token on the expectation that the transactions that follow will boost the value of said token. The searcher also includes a ‘sell’ transaction further back in the bundle to cash out this expected spike in token value.\n\nBuilders sent these bundles to a relay, which initially submits only the blockheader to a validator. Only after the validator accepts the block for publishing to the chain does the validator see the complete ordered transaction list.\n\nTaking the bait\n\nAs detailed in the indictment, the brothers began plotting their heist around December 2022, just months after Ethereum made its transition from a consensus mechanism based around proof-of-work (PoW) to one based on proof-of-stake (PoS).\n\nThe brothers established 16 validators, then engaged in a series of ‘bait transactions’ to figure out what motivated MEV bots to propose bundles containing these transactions. The brothers thus identified three ‘victim traders’ that specialized in crypto arbitrage trades.\n\nThe brothers then initiated “at least eight” transactions (the ‘Lure transactions’) they knew would cause the victim traders’ MEV bots to propose bundles containing these transactions. The bundles also included the victim traders’ own ‘buy’ transactions in which they paid $25 million in stablecoins and other tokens to acquire “substantial amounts of particularly illiquid cryptocurrencies” (aka shitcoins of little or no utility).\n\nThe victim traders also included their ‘sell’ transactions after the Lure transactions, but with coded conditions that the frontrun transactions couldn’t be executed unless the Lure transactions “took place immediately after the frontrun trades” and the sell transactions occurred immediately after the Lure transactions.\n\nBut the brothers had identified a vulnerability in the MEV-Boost relay code that prematurely exposed the full content of proposed blocks. This allowed the brothers to tamper with the victim traders’ proposed blocks when one of the brothers’ 16 validators was selected to approve the next block.\n\nOnce the victim traders’ $25 million buy transactions had gone through, the brothers “replaced the Lure transactions with Tampered transactions. In the Tampered transactions, the defendants sold the same illiquid cryptocurrencies that the victim traders had recently purchased as a result of the Lure transactions and, for which the defendants already held as a result of information gathered through the bait transactions. In effect, the Tampered Transactions drained the particular liquidity pools of all the cryptocurrency that the Victim Traders had deposited based on their frontrun trades.”\n\nThe net result was that the victim traders’ sell orders couldn’t go through, leaving them with worthless shitcoins while the brothers collected around $25 million in stablecoins and more liquid tokens. The brothers then published the re-ordered block to the Ethereum network.\n\nThe victim traders eventually caught on to what had occurred and reached out to the brothers, as did “a representative from Ethereum.” The brothers ignored these pleas and set about laundering their stolen loot through exchanges with minimal ‘know your customer’ controls as well as some decentralized finance (DeFi) protocols.\n\nWhile the brothers may have graduated from MIT, they failed OpSec 101 by googling phrases such as ‘money laundering’ and ‘does the United States extradite to [insert country here]’ ahead of their heist.\n\nDeputy Attorney General Lisa Monaco said the brothers’ high-tech antics “were no match for DOJ prosecutors and Internal Revenue Service (IRS) agents, who unraveled this first-of-its-kind wire fraud and money laundering scheme.” IRS Criminal Investigation unit special agent Thomas Fattorusso added that his office had “simply followed the money” using “cutting-edge technology and good-ole-fashioned investigative work, on and off the blockchain.”\n\nWhile the company behind MEV-Boost released an update to prevent future exploits of this kind, the reputational hit that Ethereum has taken since its shift to PoS shows no sign of ending. In fact, PoS is considered one of the primary reasons why the U.S. Securities and Exchange Commission (SEC) is (allegedly) preparing to designate ETH as an unregistered security.\n\nA significant chunk of ETH was already concentrated in relatively few hands, most of them belonging to Ethereum insiders who were the primary beneficiaries of 2014’s controversial crowdsale. PoS was guaranteed to further concentrate control of the network, trigging more planks of the Howey test. Regulatory blowback was/is inevitable.\n\n‘Compromised and partially drained’\n\nStill more ‘crypto’ bro-on-bro violence made the news this week courtesy of a hack of the BlockTower blockchain-focused institutional investment firm.\n\nOn May 14, Bloomberg reported that BlockTower’s main hedge fund had been “compromised and partially drained by fraudsters,” citing sources familiar with the situation who didn’t want to be identified. The total amount of the stolen assets, as well as the nature of the hack went unspecified, but BlockTower has reportedly hired blockchain forensics experts to get to the bottom of this mess.\n\nAs a private company beholden only to its well-heeled investors, BlockTower has so far offered no official statement about the report. The company’s main fund held around $1.7 billion worth of assets under management prior to the hack.\n\nThis isn’t the first time BlockTower has suffered losses via exploits, having lost $1.5 million worth of TRU tokens after hackers targeted its wallet on the Dexibel decentralized exchange in 2023.\n\nBlockTower describes its Flagship fund’s M.O. as “focused on liquid crypto assets via a multi-strategy approach analyzing both top-down market regimes and bottom-up asset selection (beta augmented with alpha), and incorporating market neutral strategies where appropriate to the opportunity set.”\n\nIn 2022, BlockTower launched a dedicated venture capital fund that has taken stakes in numerous ‘crypto’ entities, including memecoin-factory Solana, struggling NFT-focused Dapper Labs, Sky Mavis (parent of the Axie Infinity game, which suffered a nine-figure hack of its Ronin Bridge network in 2022) and fraudulent ‘algorithmic stablecoin’ issuer Terraform Labs.\n\nHonestly, given that stellar track record, we’re a little surprised there was anything left to steal.\n\nMake it stop\n\nBlockTower wasn’t the end of this week’s hackery. The Sonne Finance ‘decentralized non-custodial lending protocol’ was taken for $20 million worth of ‘wrapped’ ETH and USDC tokens. Sonne Finance said it’s prepared to offer the hacker a ‘bug bounty’ that would allow him/her/they to keep 10% of their loot as payment for pointing out the gaping security flaws if they return the other 90%.\n\nBut the hacker has reportedly already swapped some of their ill-gotten gains for nearly 1,200 ETH and 183,000 DAI (an Ethereum-based stablecoin maintained by the MakerDAO decentralized autonomous organization). From there, the ETH will almost certainly tread the well-trodden path to Tornado Cash, the ETH-based coin mixer that helps obfuscate a digital asset’s digital trail.\n\nWe say that with some confidence because on May 14, Reuters revealed a United Nations Security Council (UNSC) sanctions committee report that found Tornado Cash helped launder $147.5 million worth of ETH that was stolen from Justin Sun’s HTX (formerly Huobi) exchange last year by North Korea’s hackers.\n\nThat nine-figure sum was funneled through Tornado Cash in the month of March alone. A further $66.3 million worth of ETH that was stolen from the Sun-linked Poloniex exchange has been similarly washed. With apologies to ancient Rome, when it comes to stolen tokens, all roads lead to Tornado Cash.\n\nThe UN report, based on data provided by PeckShield and Elliptic analysts, also found that North Korea was the likely culprit behind 97 suspected attacks on ‘crypto’ firms that netted the Hermit Kingdom some $3.6 billion between 2017 and 2024. The same report indicates that North Korea may have been responsible for 11 ‘crypto’ heists so far this year that netted nearly $55 million.\n\nIronically, many of the victims of these heists were likely among the legions of ‘crypto bros’ loudly denouncing this week’s sentencing of Tornado Cash co-founder Alexey Pertsev to 64 months in a Dutch prison for money laundering. Code is law, after all… that is, until it’s your bits of code that have been stolen and laundered. Still, man up and take one for the team, right?\n\nOne imagines that, within crypto crook circles, it’s hard to get angry when they get caught thieving from each other. After all, it’s the dominant ethos of this game, in which the much-ballyhooed notion of ‘building’ doesn’t so much take a backseat to ‘grifting,’ it gets relegated to a rickety trailer haphazardly hitched to the back of this out-of-control 18-wheeler.\n\nFor those of you who crave a more productive, utilitarian and (ta-da!) legally- and regulatory-compliant worldview, there’s a little shindig going on in London next week that might be just what you’re looking for.\n\nWatch: Teranode & the Web3 world with edge-to-edge electronic value system"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4NkZVZ0NHQXJaMzN2V3JFQXNhYjZvZy1YU1VieHlzSENNRXZ6MjdyNWV4cmZsR21Ra1pLOHV6alNQYmtBaFdhSExremtrQzlyNXNJZlpVU1Z4cVVPeUNreFEtSXI1VVR3U3VBWU9ucFoxMXd1M09sRWFQMHBPQXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals - Yahoo Finance",
        "content": "ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals\n\nIn January, ARK Invest teamed up with 21Shares to offer a spot bitcoin ETF, which trades as ARKB. The ETF has been hugely successful, attracting several billion dollars in investment. However, the duo is not content with just a spot in a bitcoin ETF. They have also applied for a spot in ethereum ETF, which is currently under review by the SEC.\n\nDon't Miss:\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true .\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nThough they did not make a formal comment, ARK and 21Shares updated their filing for the spot ethereum ETF application. The update removed a small clause related to staking. Originally, the firms were looking to stake ETH that was held by the firms, which would have been labeled as income from the fund. \"Sponsor may, from time to time, stake a portion of the Trust's assets through one or more trusted Staking Providers,\" the clause noted.\n\nHowever, the update excluded this clause. While they did keep all of the other clauses specific to ethereum, the change caused some to raise eyebrows. Eric Balchunas is an ETF analyst for Bloomberg and in a post on X, he said, \"While it may seem like this is them getting their docs in shape based on SEC comments (which would be good news) there hasn't been any comments. So it’s prob either a Hail Mary or maybe trying to give SEC one less thing to use in their rejection. Not sure (yet).\"\n\nAccording to Balchunas, the SEC did not prompt ARK and 21Shares to make the change. So, in his opinion, it is some sort of preemptive action to give their application a higher probability of acceptance.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today?\n\nThe issue of staking has been seen by some as a hang-up for potential approval of spot ethereum ETFs. The novelty of the system could cause further delays in the already lengthy decision-making process by the SEC. So, by leaving it out of the application, ARK could improve its chances of approval. However, this does come at the cost of having a less attractive ETF, as the staking rewards would not be earned.\n\nThe SEC has already made delays to decisions on multiple applications. As it stands, the final date for a decision on the VanEck ETH ETF application is May 23, followed by ARK 21Shares' on May 24th.\n\n\"Our odds of approval remain the same: slim to none,\" Balchunas said in a post on X.\n\nCathie Wood is the CEO of ARK Invest and is known to be extremely bullish on cryptocurrency. However, even she acknowledged that the crypto ETF market may not see much more growth. \"We'd be surprised to see anything but bitcoin and ether being approved by the [U.S. Securities and Exchange Commission],\" she said in an interview.\n\nStory continues\n\nThe case for a spot ethereum ETF is getting weaker, and the SEC has not spoken often on the topic. While there is certainly a possibility that the ETFs could receive approval in late 2024 or 2025, it seems unlikely that they will occur anytime soon.\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRjhQTV8wd2VaN2FZV3lzWlF2SlFPOUV0M1ZrSkdsdkZ0dW15TlBONXFxLUF2R1B5NnNZY2hCcHphSHJwTXZTakVzbnE2Y0ZzemR0aC1VV2puMjlINC1pdHFGdm5QeEoyRk45QVVtRU5VVGNwbldqeXdyN0E2Q1hfekxzUFdpeUthVFBxd0hMNEphcUNBbWp5ajdiQVdXZ1lCU2FTampTdWRyekFPSVFYbGlBaFlBT0XSAbwBQVVfeXFMT3RTdHJDTlNTMGZxOVBHbjRVNHFYV1BUN3UxT2h3VkFSM2hmejAwVW9nai1KUmM1bWRTSzR0Yk8zZVRleWY0SEplNV95VUhFbmNuZXM4TW9aemk2M202UTlPQVZXcnZXU0o4X0x6Rkw3U1pXTFBMWlFqc20xTGRXczYyakRCNUFNWEJLMGlwQUNFaGg1blBob3FiUERYb0M4c0t5SzlUeW1aNkhSbWlwekFMYjRXQmF0NW0xRXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Brothers arrested for $25 million theft in Ethereum blockchain attack - BleepingComputer",
        "content": "​The U.S. Department of Justice has indicted two former MIT students for allegedly manipulating the Ethereum blockchain and stealing $25 million worth of cryptocurrency within approximately 12 seconds in a \"first-of-its-kind\" scheme.\n\nAnton Peraire-Bueno and James Pepaire-Bueno were arrested in Boston and New York on Tuesday on charges of wire fraud and conspiracy to commit wire fraud and money laundering. If convicted, each of them faces a maximum penalty of 20 years in prison for each count.\n\nTheir case was investigated by IRS Criminal Investigation (IRS-CI) Cyber Investigations Unit in New York, with the assistance of the New York City Police Department and U.S. Customs and Border Protection.\n\n\"The brothers, who studied computer science and math at one of the most prestigious universities in the world, allegedly used their specialized skills and education to tamper with and manipulate the protocols relied upon by millions of Ethereum users across the globe. And once they put their plan into action, their heist only took 12 seconds to complete,\" said U.S. Attorney Damian Williams.\n\nThe two former Massachusetts Institute of Technology (MIT) students allegedly manipulated transaction validation processes on the blockchain by accessing pending private transactions, altering them, obtaining victims' cryptocurrency, and rejecting requests to return the stolen funds—instead, they took steps to conceal their illegal gains.\n\nThe indictment claims the brothers learned their victims' trading behaviors while preparing the attack (starting December 2022) and took measures to hide their identities and the stolen proceeds.\n\nThey also used multiple cryptocurrency addresses and foreign exchanges and set up shell companies. Following the attack, they moved the stolen crypto assets through a series of transactions that would obscure their source and ownership.\n\nWhile planning and executing the attack, they allegedly took the following steps, among others:\n\nEstablishing a series of Ethereum validators in a manner that concealed their identities through the use of shell companies, intermediary cryptocurrency addresses, foreign exchanges, and a privacy layer network;\n\nDeploying a series of test transactions of \"bait transactions\" designed to identify particular variables most likely to attract MEV Bots that would become the victims of the Exploit (collectively the \"Victim Traders\");\n\nIdentifying and exploiting a vulnerability in the MEV-Boost relay code that caused the relay to release the full content of a proposed block prematurely;\n\nRe-ordering the proposed block to the defendants' advantage;\n\nAnd publishing the re-ordered block to the Ethereum blockchain, which resulted in the theft of approximately $25 million in cryptocurrency from the Victim Traders.\n\nThroughout the process, the brothers also searched online for information on carrying out the attack, concealing their involvement in the Ethereum exploit, laundering the criminal proceeds through cryptocurrency exchanges with lax verification procedures, hiring attorneys with cryptocurrency expertise, extradition procedures, and the crimes outlined in the indictment.\n\n\"These brothers allegedly committed a first-of-its-kind manipulation of the Ethereum blockchain by fraudulently gaining access to pending transactions, altering the movement of the electronic currency, and ultimately stealing $25 million in cryptocurrency from their victims,\" said IRS-CI special agent Thomas Fattorusso."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5naUZEd2pvcUw5NWJWckptYXJZNFRrYTNVd2ExMURvLXZsN3BFVUF6aGI5Vk8xVmRRSm9VUmNYeDBtU3RwTngxelEtQTZVU1ZRQ0UyM0l5NjREMXp5amtZeUJPVHU0QnVmZktQd3kxaXRNczFodGR5R9IBgAFBVV95cUxOa2RzOFREVVdIRDlGUjFmYkF3WGJKcEdzdFhEU01SSlNqdlJiNjd6M1I3cGRwRDhNYklDN0J0Wk0zdzlRYm1LXzVyVXFxUjl4WnhoSS01S3FwWmt0RTBEQ3FDeFVhUENHdGVrbVZVZkZFaGlFVkJjRVoyaFhxRm9pRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction 2024 2025 2026 - AlexaBlockchain",
        "content": "As the world’s second-largest cryptocurrency by market capitalization, Ethereum has attracted the attention of investors and industry experts. With advancements in blockchain technology and the increasing popularity of decentralized applications (dApps), the future of Ethereum (ETH) continues to be a subject of widespread debate.\n\nIn 2021, the price of Ethereum hit an all-time high of $4,600, fuelled by the launch of Ethereum 2.0. Yet, what causes the price of Ethereum to continue to fluctuate wildly? Could Ethereum one day witness a value overflow of this cryptocurrency at a higher growth rate?\n\nIn this article, we bring you a detailed review regarding the factors that could influence the economic predictions of ETH in the coming years. We will also give you the anticipated costs in 2024, 2025, and 2026.\n\nEthereum Overview\n\nEthereum is an innovative cryptocurrency that takes the shape of a decentralized, open-source blockchain. It first emerged in 2015 and came alive via people looking for a network that encourages smart contracts and decentralized apps to be developed and used without manipulating, hacking, or being influenced by fraud.\n\nThis platform further aids creators in planning goods and performing contracts quickly without any negative consequences. Indeed, compared to other cryptocurrencies, Ethereum has a wider scope that includes cryptocurrencies such as Bitcoin. For this type of machines like those that are required to reach a new level of these apps, the ‘Ethereum Virtual Machine‘ (EVM) lies in the epicenter of Ethereum.\n\nHistorical Price Analysis\n\nEver since 2015, prices of Ethereum have seen quite some lows and some highs at the same time; thus, it’s been quite a volatile ride for the fintech asset. Ethereum prices had been determined and influenced by a lot of things such as the overall market sentiment, advances in technology and how well they were adopted within the Ethereum ecosystem.\n\nA particular craze worth mentioning about 2017 was the ICO, and the buying using ETH alone brought about a surge in the demand for ETH. About $8 was its initial price at the beginning of 2017, and its price has reached an all-time high of over $1300 before 2018 ended. From there, a bear market showed continuous decline of ETH prices through months. ETH’s price had leveled at around $130 at the end of the year.\n\nThe 2020 pandemic catalyzed the institutional adoption of cryptocurrencies and a lot of mainstream interest and recognition which it didn’t have before. The rise of decentralized finance of the DEFI was primarily seen as very bullish for the evolution of the Ethereum Network, and subsequently, the price of ETH lifted from then. Each ETH was priced at $4600 at the end of 2021 and at the beginning of 2022.\n\nBy the end of 2022, Ethereum saw another dip which continued through all of 2023 with the fintech asset priced as low as 1100$. The market came back by the end of 2023 at a ranging price of around $4000. And in May 2024, the price of Ethereum is currently around $3080.\n\nEthereum Price Predictions for 2024, 2025, and 2026\n\nPrice Prediction 2024\n\nAs the Ethereum network grows and expands, the demand for its native cryptocurrency will also grow in 2024. More sharding and scaling solutions will strengthen the network’s capacities and speed and draw more users into the system. Henceforth, the bull run is likely and the currency will hit the $3,500 – $4,000 mark, by mid-2024.\n\nBy the end of 2024, ETH’s integration into traditional finance and major corporation adoption could cause the predictions to increase to $4,000 – $5,000 if foreign exchange and other layer-2 scaling solutions tonight volumes.\n\nPrice Prediction 2025\n\nBy 2025, the Ethereum ecosystem might further mature and absorb into various fields. By solving all the scaling issues (if there are any) and introducing new layer-2 solutions, it will become far more efficient and will attract even more users and developers. So, the price might rise in the years to come.\n\nSlowly, when more real-world uses are implemented, and Ethereum-based app usage increases, the use could potentially even make the demand rise up. Since it can be noted from many experts that big investors and traditional finance sectors have also increased their interest in Ethereum. It might also make a profit to much extent as it is considered that Ethereum will become a dominant blockchain platform.\n\nIf this continues, the price predicted might reach within the range of $6000-$7000 by the end of the year 2025. The cryptocurrency market is notorious and high volatility is one of the aspects preventing it since unexpected events happen in the market frequently, which might increase or decrease the prices. Any legislative shift can also increase or decrease the prices of any cryptocurrency.\n\nPrice Prediction 2026\n\nIn 2026, Ethereum may prove to be unbeatable and may have shown much progress. The powerful Ethereum ecosystem and scaling solutions may probably absorb almost all industries. By not having any stress to adapt and evolve as it is upgraded or updated regularly, it can potentially cause several organizations or even governments to adopt blockchain technology.\n\nThe price for Ethereum (according to experts’ speculation) might reach a range of $8000-$10000 by the end of 2026 if significant developments occur.\n\nForecasted Price Range for Ethereum (ETH) 2024-2026\n\nYear Forecasted Price Range for Ethereum (ETH) 2024 $3,500 – $5,000 2025 $6,000 – $7,000 2026 $8,000 – $10,000 Forecasted Price Range for Ethereum (ETH)\n\nInvestment Strategies\n\nEthereum is no different than any other investments and it is important to do thorough research, understand the risks involved, and consult with financial advisors before making any investment decisions. Here are some effective tips for people looking to invest in Ethereum:\n\nTechnical Analysis: Some of the technical indicators are moving averages, relative strength index (RSI), chart patterns and so on. These pinpoint the price areas where one should sell and buy.\n\nSome of the technical indicators are moving averages, relative strength index (RSI), chart patterns and so on. These pinpoint the price areas where one should sell and buy. Dollar-Cost Averaging: Instead of investing all at once, consider spreading your investments over time through dollar-cost averaging..\n\nInstead of investing all at once, consider spreading your investments over time through dollar-cost averaging.. Risk Management: Implement strict risk management practices, such as stop-loss orders and position sizing.\n\nImplement strict risk management practices, such as stop-loss orders and position sizing. News and Sentiment Monitoring: Stay updated on Ethereum-related cryptocurrency news, announcements, and market sentiment.\n\nStay updated on Ethereum-related cryptocurrency news, announcements, and market sentiment. Diversification: Diversifying your portfolio by investing in other promising cryptocurrencies or traditional assets to reduce overall risk.\n\nIt’s important to remember that crypto has its risks, and volatile market conditions can lead to losses if not approached with caution and proper risk management strategies. Check out cryptocurrency exchanges like Crypto Pie to get the best strategies, market analysis, and stay updated with the latest crypto news in your country.\n\nFinal Words\n\nThe future of the 2nd largest cryptocurrency looks bullish. The upcoming years do have anticipated short-term volatility. However, the price growth potential it has is huge and is expected to grow significantly. Technological developments, scalability solutions, and increasing interest from institutions are driving such a surge. Investors are advised to do comprehensive research, frame proper strategies, and be cautious while playing around in the ever-volatile cryptocurrencies market.\n\nRead Also: Is Vanguard Charting a New Path with the Appointment of Outsider CEO Salim Ramji?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPcHlCbktmc1RUX2pDNDZWY2d4YjZUdFJERk5rdGdTWTEtU3RWTWNBUDNhVC1fc2dKdHRzTDNSb0NjSGt1LV9iZ05XaUpWYk41LXJPcDVQaEN5aEwwbjRNa1NNVFJsZFEwT0hlaWZtbWZneS1KX2VNRV9vM0lCNU9VX2JBUms4NTZsZ0Y0RkUyejdKQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two MIT students charged for exploiting Ethereum blockchain bug, stole $25 million in crypto - Mashable",
        "content": "Two brothers alleged stole $25 million from the Ethereum blockchain after exploiting a flaw in a popular cryptocurrency software. Credit: GEOFFROY VAN DER HASSELT/AFP via Getty Images\n\nJust when you've thought you've seen everything when it comes to cryptocurrency theft, two brothers attending MIT have uncovered a brand new way to steal millions.\n\nAccording to a U.S. Department of Justice (DOJ) announcement on Wednesday, Anton Peraire-Bueno and James Peraire-Bueno have both been charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. The brothers allegedly found a way to exploit the Ethereum blockchain and stole $25 million in cryptocurrency as a result.\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,\" U.S. Attorney Damian Williams for the Southern District of New York said in a statement. \"The brothers, who studied computer science and math at one of the most prestigious universities in the world, allegedly used their specialized skills and education to tamper with and manipulate the protocols relied upon by millions of Ethereum users across the globe.\"\n\n\"Once they put their plan into action, their heist only took 12 seconds to complete,\" Williams continued. \"This alleged scheme was novel and has never before been charged.\"\n\nHow two MIT students exploited the Ethereum blockchain\n\nWhile one part of the brothers' scheme may have taken only 12 seconds, the DOJ indictment makes it clear that they meticulously planned and prepared for months in order to successfully exploit the Ethereum blockchain.\n\nOn the Ethereum blockchain, transactions aren't verified in chronological order, but by \"maximum extractable value\" or MEV, essentially how much value can be earned by validators from the transaction. Validators verify transactions, and in turn, add new blocks to the blockchain.\n\nMashable Light Speed Want more out-of-this world tech, space and science stories? Sign up for Mashable's weekly Light Speed newsletter. Loading... Sign Me Up By signing up you agree to our Terms of Use and Privacy Policy Thanks for signing up!\n\nAccording to the DOJ, the two MIT students exploited a flaw in MEV-Boost, an open-source software used by 90 percent of Ethereum validators. Upon discovering the exploit, Anton and James Peraire-Bueno set up a series of validators using shell companies in order to conceal their identities. The DOJ alleges it took \"several months\" for the two to prepare for their scheme.\n\nThe Peraire-Bueno brothers set their plot in motion by creating \"bait transactions\" in order to trick \"victim traders\" into revealing their trading behaviors.\n\nIn April 2023, the two pulled off their $25 million crypto heist by \"luring\" in the victim traders' MEV bots with eight transactions containing \"illiquid cryptocurrency\" to frontrun and then transfer into stablecoins and other liquid cryptocurrencies. These bundled \"Lure Transactions\" from the brothers were timed to be verified by one of their own validators.\n\n\n\nFrom there, the brothers further exploited the system by forging signatures to deceive the blockchain relay into releasing the transaction information, which they then manipulated. As a result, Anton and James Peraire-Bueno walked away with $25 million and proceeded to take further steps to conceal their alleged crime.\n\n“These brothers allegedly committed a first-of-its-kind manipulation of the Ethereum blockchain by fraudulently gaining access to pending transactions, altering the movement of the electronic currency, and ultimately stealing $25 million in cryptocurrency from their victims,” said Special Agent in Charge Thomas Fattorusso of the IRS Criminal Investigation (IRS-CI) New York Field Office in a statement. “In this case, IRS-CI New York’s Cyber Unit simply followed the money.\"\n\nAccording to the DOJ, the two left a trail of incriminating evidence, including a document laying out the exploit in full detail, breaking their scheme into \"four stages:\" The Bait, Unblinding the Block, The Search, and The Propagation.\n\nIn addition, in the weeks and months following the exploit, the brothers search history unveiled queries for terms such as \"top crypto lawyers,\" \"wire fraud statute of limitations,\" \"money laundering,\" \"fraudulent Ethereum addresses database,\" and searches related to which countries the U.S. has extradition agreements with.\n\nThe two face up to twenty years in prison for each charge."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOa0FCcV9JTWg2MHMwaTdoRnN5U29rR19nby1HV3Q5RFVNbUZzU01jQzJoa2VWT210cVBpTi1fUW5ZSVJhRy1SRmR3eF9KbG1xTUxjU1ZqWDR5YURNYWpHQmZhMVJKRTVHcjBuNTZxV01INDBZZWN0T0hkZFZEY1F6aFlkNUxKZFJfYV9DajRQWnE2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two brothers accused of stealing $25 million worth of crypto - The Verge",
        "content": "Two brothers were taken into federal custody Tuesday for allegedly stealing about $25 million worth of cryptocurrency in just a few seconds in a “first-of-its-kind manipulation” of the Ethereum blockchain. The brothers — Anton Peraire-Bueno and James Peraire-Bueno — studied math and computer science at MIT and used the skills they had acquired “at one of the most prestigious universities in the country” to exploit “the very integrity of the Ethereum blockchain in order to fraudulently obtain” the funds, prosecutors say. The brothers were charged with wire fraud, conspiracy to commit wire fraud, and conspiracy to commit money laundering.\n\n“Unfortunately for the defendants, their alleged crimes were no match for Department of Justice prosecutors and IRS agents, who unraveled this first-of-its-kind wire fraud and money laundering scheme,” Deputy Attorney General Lisa Monaco said in a press release.\n\nThough the heist was carried out in a matter of seconds, the brothers spent months plotting it, charging documents claim. The indictment claims that the Peraire-Bueno brothers “carefully planned and executed” the attack, beginning sometime in December 2022. The brothers allegedly created “an online document” laying out their four-step plan: 1) The Bait, 2) Unblinding the Block, 3) The Search, and 4) The Propagation.\n\nThe brothers set up a series of Ethereum validators “in a manner that concealed their identities through the use of shell companies, intermediary cryptocurrency addresses, foreign exchanges, and a privacy layer network,” according to the indictment. They allegedly targeted three traders — whose behavior they had studied for months ahead of time, prosecutors claim — and set up “a series of test transactions or ‘bait transactions’” to attract bots the traders used.\n\nProsecutors claim the brothers exploited a vulnerability in Etherum’s code that has since been patched. “In doing so, they fraudulently gained access to pending private transactions and used that access to alter certain transactions and obtain their victims’ cryptocurrency,” the Department of Justice’s press release claims.\n\nAfter stealing approximately $25 million worth of cryptocurrency, the Peraire-Bueno brothers allegedly laundered the funds through several shell companies. The brothers’ online search history in the weeks following the alleged theft included “top crypto lawyers,” “how long is us statue [sic] of limitations,” “fraudulent Ethereum access database,” and “money laundering statue [sic] of limitations.” Charging documents claim one victim and their lawyer repeatedly contacted the Peraire-Bueno brothers between April and June of 2023, as did a representative from Ethereum."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUC1YOGhqeGVzNjZHY2w5SHlFWlVJZnBYUGdPTXBxOW5ObnhWYk1uYlQ3WGlsMnZDU2s1UU5YQXNjbjUxT3JfRklST2JHa1cxUGc5bHpMc2UzZ0pnVXJNS2FGMTBTNnZoYU1nTEowMDFHcTVDcDBTa0ZuN3MtT3k0QVNIbEFHN05vTFRYZzRwUVY4MG1XOHhrN0RGSEFKaXZGM3lWbzJhSUtTUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum Scaling With L2s Has Damaged Its Tokenomics. Is It Possible to Fix It? - Unchained",
        "content": "While Ethereum layer 2s are at an all-time high in terms of active addresses and transactions, the mainnet may not be doing as well.\n\nEthereum, often celebrated for being “ultrasound money” owing to its deflationary bent, has turned inflationary again over the past month, challenging the foundational principles that its community thought drove its value. A recent report from CryptoQuant has declared the ultrasound money narrative dead, sparking debates and concerns about the tokenomics of ETH.\n\nLearn more: What Is Tokenomics? A Beginner’s Guide\n\nThe core of the issue lies in the balance between Ethereum’s main chain and its Layer 2 scaling solutions (L2s). While L2s have successfully improved Ethereum’s scalability by handling transactions off the main chain, they have inadvertently reduced the demand for Ethereum’s native token, ETH, on the main chain. This reduction in demand has led to lower transaction fees, measured in gwei, and subsequently, less burning of ETH. Currently, gwei sits at around 8, significantly lower than in previous times, indicating that at this level, ETH is far from being deflationary.\n\nRead more: Why Ethereum Gas Fees Have Fallen to Their Lowest Level Since 2020\n\nEthereum can shift from deflationary to inflationary due to changes in network activity and the balance of Ether burned versus issued. Under EIP-1559, when transaction volumes are low and the burned base fees are less than the Ether issued in block rewards, the total supply of Ether increases, making Ethereum inflationary. This dynamic demonstrates how Ethereum’s supply is not fixed but responsive to network usage, potentially impacting its value and scarcity when shifts from a deflationary to an inflationary state occur.\n\nMeanwhile, Ethereum L2s are ripping, processing 10 times more transactions than the main chain, while reaching an all-time high in weekly active addresses.\n\nGiven these levels of gas fees, the question arises: how much activity needs to happen in the L2s for ETH to become deflationary again?\n\nRead more: Horizontal Scalability Is the Solution to L2 Fragmentation\n\nA Complex System\n\nAnsgar Dietrichs, a researcher from the Ethereum Foundation, told Unchained that the deflationary mechanism of ETH is directly tied to its market cap and the balance between revenue and expenses. At low prices, the burning mechanism can exceed the issuance, making ETH deflationary. However, as the market cap grows and if revenues don’t keep up proportionally, ETH can become inflationary.\n\nThis bidirectional influence means that the market cap not only affects the deflationary or inflationary nature of ETH, but also that this nature, in turn, affects the market cap through investor perceptions and behaviors.\n\nTo reverse this trend and restore the deflationary status of ETH, a significant increase in activity on L2s is required. This means that more transactions and fees need to be funneled back to the Ethereum main chain to increase the burning of ETH. However, according to Dietrichs, research has not been done to assess exactly how much activity it would take. Neither the Ethereum Foundation nor researcher Justin Drake responded to several emails requesting additional information on how much L2 activity is needed to keep ETH supply deflationary.\n\nIn addition, Dietrichs pointed out that for any given revenue and issuance level, with constant investor preferences, there is essentially one specific equilibrium market cap that the market would trend towards. Any change in these factors—revenue, issuance, or investor preferences—shifts this equilibrium market cap point. This dynamic feedback loop suggests that addressing the deflationary challenge is not just about tweaking a few parameters, but about understanding and influencing a complex system of interrelated factors.\n\nAs Ethereum continues to evolve, the question remains: Can the foundational promise of ultrasound money be restored, or will Ethereum have to adapt to a new economic reality?\n\nLearn more: A Beginner’s Guide to Ethereum Layers: Data Availability, Consensus, and Execution"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE8yZjc1eUJ1THQ3VFp6SmxsSU4xN3N6TXNxSkJHRGJDejBjejJnc0RRejA5RkIydkhHNFpUdXpfRU5HcXBOclhLa3M2MmNIZTVOWU9nQ21ZcUw5alFwWlYxQjNRWdIBaEFVX3lxTE5FVGFKbnk2NTl5ek5fNE04LXZ3UDByZ0JtU21jUHJ2OGVsYWhxZFFoQU1sWGN3aUd3Sm0taFdDaUh0V25qeUQ1eEpxT2F1cXBUdE01QVFtVUllQ29qTWFLRTkycEZhV0tG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Breaks $3,000: Are We Saved? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum has secured a breakthrough above $3,000, but the current state of things suggests that the second-biggest cryptocurrency on the market might still face some troubles. The price has started an immediate reversal, and Ether could face additional selling pressure if it falls below $3,000 again.\n\nAdvertisement\n\nCurrently, Ethereum is trading around $3,005, with resistance levels at $3,200 and $3,400. If ETH can break through these levels, it could signal a stronger bullish trend than now. However, if Ethereum falls below $3,000, the support levels to watch are $2,900 and $2,800. A drop below these levels could indicate an aggravation of the bearish trend.\n\nRecent price action shows that Ethereum is struggling to maintain its upward momentum. The 50-day EMA around $3,067 and the 200-day EMA near $2,800 are critical levels to monitor. Breaking through the 50 EMA would be a positive sign, while falling below the 200 EMA could trigger more selling pressure.\n\nAdvertisement\n\nOn-chain data provides additional insights. The number of active addresses on the Ethereum network has been fluctuating, indicating varying levels of user activity. Currently, the number of active addresses is around 450,000, down from recent highs. Transactions on the network have also shown some variability, with daily transactions hovering around one million.\n\nThe net ETH emission after EIP-1559 has been slightly negative, suggesting that more ETH is being burned than minted. For now, the situation has changed as activity on the L1 of Ethereum dropped substantially.\n\nEthereum's recent breakthrough above $3,000 is a promising development, but the asset is still facing some issues. Key levels to watch are $3,200 and $3,400 on the upside, and $2,900 and $2,800 on the downside."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOVXBJLTh5MnJodlRVWExkYWRRMjZMNjk1eTBwOFNNa1ViRnp6MFFjN0phMlNCS2hLdzZvUzVKSmVFZ0tHUWNvZlJOR1hGWVlqWkFfVG1KV1Y4SEVlQ1hvWmtHMXhjc0FqN1M1TGYwc1hPck4xdTIzWUJiYkNpc0hWRmM2WVV5WkpTMm13clk2SXFqSWt3V1JwMlAwaEVPNDZ1WlkxajZZLVVzYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "MIT students stole $25M in seconds by exploiting ETH blockchain bug, DOJ says - Ars Technica",
        "content": "Within approximately 12 seconds, two highly educated brothers allegedly stole $25 million by tampering with the ethereum blockchain in a never-before-seen cryptocurrency scheme, according to an indictment that the US Department of Justice unsealed Wednesday.\n\nIn a DOJ press release, US Attorney Damian Williams said the scheme was so sophisticated that it \"calls the very integrity of the blockchain into question.\"\n\n\"The brothers, who studied computer science and math at one of the most prestigious universities in the world, allegedly used their specialized skills and education to tamper with and manipulate the protocols relied upon by millions of ethereum users across the globe,\" Williams said. \"And once they put their plan into action, their heist only took 12 seconds to complete.\"\n\nAnton, 24, and James Peraire-Bueno, 28, were arrested Tuesday, charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. Each brother faces \"a maximum penalty of 20 years in prison for each count,\" the DOJ said.\n\nThe alleged scheme was launched in December 2022 by the brothers, who studied at MIT, after months of planning, the indictment said. The pair seemingly relied on their \"specialized skills\" and expertise in crypto trading to fraudulently gain access to \"pending private transactions\" on the blockchain, then \"used that access to alter certain transactions and obtain their victims’ cryptocurrency,\" the DOJ said.\n\nThe indictment goes into detail explaining that the scheme allegedly worked by exploiting the ethereum blockchain in the moments after a transaction was conducted but before the transaction was added to the blockchain.\n\nThese pending transactions, the DOJ explained, must be structured into a proposed block and then validated by a validator before it can be added to the blockchain, which acts as a decentralized ledger keeping track of crypto holdings. It appeared that the brothers tampered with this process by \"establishing a series of ethereum validators\" through shell companies and foreign exchanges that concealed their identities and masked their efforts to manipulate the blocks and seize ethereum.\n\nTo do this, they allegedly deployed \"bait transactions\" designed to catch the attention of specialized bots often used to help buyers and sellers find lucrative prospects in the ethereum network. When bots snatched up the bait, their validators seemingly exploited a vulnerability in the process commonly used to structure blocks to alter the transaction by reordering the block to their advantage before adding the block to the blockchain.\n\nWhen victims detected the theft, they tried to request the funds be returned, but the DOJ alleged that the brothers rejected those requests and hid the money instead.\n\nThe brothers' online search history showed that they studied up and \"took numerous steps to hide their ill-gotten gains,\" the DOJ alleged. These steps included \"setting up shell companies and using multiple private cryptocurrency addresses and foreign cryptocurrency exchanges\" that specifically did not rely on detailed \"know your customer\" (KYC) procedures.\n\nThey also researched the \"very crimes charged in the indictment,\" the DOJ said. Among search terms found in the brothers' history during the planning phase of the alleged scheme were phrases like \"how to wash crypto\" and \"exchanges with no KYC.\" Later, seemingly attempting to prepare for any legal consequences from the scheme, the brothers allegedly searched for things like \"top crypto lawyers,\" and \"money laundering statute of limitations,\" and \"does the United States extradite to [foreign country].\"\n\nTo uncover the scheme, the special agent in charge, Thomas Fattorusso of the IRS Criminal Investigation (IRS-CI) New York Field Office, said that investigators \"simply followed the money.\"\n\n\"Regardless of the complexity of the case, we continue to lead the effort in financial criminal investigations with cutting-edge technology and good-ol'-fashioned investigative work, on and off the blockchain,” Fattorusso said.\n\nThe indictment comes the same month that the Securities and Exchange Commission (SEC) is expected to decide whether to approve an ethereum exchange-traded fund (ETF). According to CNBC, the alleged fraud could fuel SEC skepticism as it reviews the ethereum ETF.\n\nSEC Chair Gary Gensler, a noted crypto skeptic, wants to ensure investors are protected before approving any potentially dangerous listings, CNBC noted."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOQXNTTU1obnFCRHhnN3JmNnRtSEpqTmE4MGExdS1ZclJDODk1NTUwWDZGdGtEbmx3RDVadzJwRFhDQmZNVVNlcnBCTlVYMWZTZ1A2amVMQkFSTmtPeWppY0xpYzBSWUJUb3ptOFZWR1RENE5HT0JnbFowa3pMQm9wMm5FaWxQR0pZSm41dkNkWE9tV2M0ZkZ5UFhUQdIBoAFBVV95cUxPQ3haNzF5ZkoyeDFoWlVqOGZvS0x1SEFHdEhMWk81TWNjejM5RjQwTzNIVVMyaENWZURSYnNwN2pFaEhKSjgtZllaMnlZOVJNSXY3aEZLaGZTb2hWdmxid25oRWxMc1BnTF9hRHloTDlscG1mbFk5TGhJbmdmYjNsRXBzR1l6QXBDdDByVGgxVExITWF0RVk3SjN3Z2lvOVQ2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "What the DOJ’s First MEV Lawsuit Means for Ethereum - CoinDesk",
        "content": "“If you hope Ethereum will always be a ‘dark forest’ where on-chain predators compete with each other for arbitrage opportunities, then you probably dislike this prosecution,” Consensys General Counsel Bill Hughes told CoinDesk in an interview. “Thankfully, I think there are only a few who are actually like that. If you prefer predatory behavior like this be curtailed, which is the vast majority, then you are likely to feel the opposite.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOeml5NHJWQmpJY0hPdWZQR1VWcXpuZ1N5TzZRUHZPZlpJNDFybzJmVmNzdzNQOHVfVWN4N0hkQ2VxdUJHMlpPVl9lNzB5TDEtcTB2dFJ3R2NDMjFvQXp0M0pJRVI3NjRydmJYU3lqZHZEeG9hMDdIY1hBX0ZhZVdqMTJDc9IBiAFBVV95cUxOTWdWeEJLaUVMSndJTmVucW9Hb01WdVpyWDJoTFc2dVVrNG1adkRqbnI4UEZwN3BVUF93d2s3ZG4yNzNtZ1VlWDNONXJ2eHNGLXJsUGFIeWttdHdjTFBvdHdBOG5BazhoR1hmUWloV094NllHNnF6MGFVRFhTMHVmRERDOEM3M0hK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Exploring Ethereum's Staking Expansion: Potential for Growth and Innovation - CoinDesk",
        "content": "The next Ethereum upgrade, Pectra, will likely take place by the end of 2024, or in early 2025. One of the key proposals, EIP 7251, can provide a better UX for validators to earn staking yield. This proposal will increase the max effective balance of validators from 32 to 2048. Leading staking service providers, like Coinbase, are managing more than 130,000 validators already. The lift in maximum effective balance allows these providers to consolidate the number of validators and ultimately increase efficiency and lower the cost of operation."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQUEVSYzZzdzdaOU15eUgyZ3JSbTc4QlN0eTF4RER2dlBPaV9DRkhsdEV3NUhiLTJmWVZCOExteXRLTUpEaGV1Q2dWMl9icTE2N0tZYW1yZWtDT09EWFVGbFFYajN4Ti1Qbm9LcjBXOV92VTVRc0RjVS14V2ZJdUlndEEzcTVmSjM1em1sM25udVFSLUxOU2xHaXRyLTlvbENtUkZhcmc0bFpZa1R2WjdpSzFQN0JQNWxoUjZONC14NkzSAcYBQVVfeXFMTlE1Rmpab3lRYlZtVldSclpLVTRoRlQzYVdaZGhVWk9MMGw1b1FzdEhfdlV3SXl1cDhaRktYTTAwcHVMZDNMX3RaSmVzNU5IdENpMjBHYkZtdTY3dm1pWkR2QWtrVFNwZFpSdmlWUUNWMHd4NUhPdjBiT0s3ZWE2aFlGeEtVSmp0MXNKTWJDeWFDWUlBZm1aTDIzUzNyZXdfSV9rUG5sWmVPTVJZZ2NSNnlLSHVSR2lUaEtXaEtWczlMWlVQUUhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "How MIT Brothers Allegedly Cheated a Noxious-But-Accepted Ethereum Practice for $25M - CoinDesk",
        "content": "\"In this process, a relay acts in a manner similar to an escrow account, which temporarily maintains the otherwise private transaction data of the proposed block until the validator commits to publishing the block to the blockchain exactly as ordered,\" the prosecutors wrote. \"The relay will not release the transactions within the proposed block to the validator until the validator has confirmed through a digital signature that it will publish the proposed block, as structured by the builder, to the blockchain.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOYUE1WUY1dkZpR0NMUFpMUkNQZ1l5NDdWWENLYU1XcUxEOFM3Snd1dEwtSktXelZRMWJmc3NFVVBLZ3hIc0c0cEduRHh6YkM3Z0JDVU9LSmVxYnBKZjJyYmdMbUlNRXhIc3YtVGtLUU9VdExGMUw5czBnc3RUbVJfaHYzTVhYWThpZWFrSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two brothers arrested for allegedly stealing $25M of crypto in 12 seconds - The Washington Post",
        "content": "Two brothers have been arrested and charged with wire fraud after federal prosecutors in Manhattan accused them of stealing around $25 million worth of cryptocurrency from traders in an elaborate online heist that prosecutors described as a “first-of-its kind” scheme. Anton Peraire-Bueno, 24, of Boston, and James Peraire-Bueno, 28, of New York, allegedly carried out “a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds,” Deputy Attorney General Lisa Monaco said in a statement Wednesday.\n\nProsecutors accused the men of fraudulently gaining access to pending cryptocurrency transactions on the ethereum blockchain and then redirecting the proceeds in April 2023.\n\nLawyers representing Anton Peraire-Bueno did not immediately respond to an overnight request for comment and the identity of James Peraire-Bueno’s attorneys was not immediately clear.\n\nAdvertisement\n\nAccording to the unsealed indictment, the two brothers “studied mathematics and computer science at one of the most prestigious universities in the country.” They used “the specialized skills developed during their education, as well as their expertise in cryptocurrency trading” to exploit the integrity of ethereum, a decentralized blockchain network that has hosted an average of more than a million transactions per day since at least 2023, the indictment alleged.\n\nWhile the indictment did not name the university the brothers attended, the Massachusetts Institute of Technology confirmed in an email that Anton Peraire-Bueno earned a bachelor’s degree in Computer Science and Engineering in February 2024, while James Peraire-Bueno earned a bachelor’s degree in Mathematics with Computer Science, and in Aerospace Engineering in June 2019, as well as a master’s degree in Aeronautics and Astronautics in June 2021.\n\nAccording to the indictment, the two men “manipulated and tampered with the process and protocols by which transactions are validated and added to the ethereum blockchain,” thereby gaining fraudulent access to pending transactions and giving them the ability to steal funds.\n\nAdvertisement\n\n“Once they put their plan into action, their heist only took 12 seconds to complete,” said U.S. Attorney Damian Williams for the Southern District of New York.\n\nShare this article Share\n\nIn December 2022, they created and shared an online document with each other that laid out their plans, before engaging in test or “bait” transactions to identify three victim traders, according to prosecutors. After stealing approximately $25 million from them in April 2023, the brothers took “numerous steps” to hide their identity, including setting up shell companies and using multiple private cryptocurrency addresses and foreign cryptocurrency exchanges to hide the money, prosecutors alleged.\n\nThe brothers then ignored repeated requests from one of the victims, their lawyer and a representative from ethereum to return the stolen money, and instead carried out transactions in an attempt to hide both the source and ownership of the funds, according to the indictment.\n\nAdvertisement\n\nThe pair were arrested Tuesday. Each brother is charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. If convicted, they face a maximum sentence of up to 20 years in prison for each count."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQeWVuQ0pkMl9McG5mcURObXFpTEdKWmFsODgwdThvWm1nT3FuU1lZM3BkX2szM3drbHkyOGd3VU1hNHhBMEdiX2wySWNVNV9iQk5oY3ZfNVhfTGpBRGVUamNBdUYyT2hYbU1jN3hqRENYUW91ZjV3VHBUazk0Q05ZT1ZZSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Odds of Ethereum Spot ETF Approval Are “Slim to None,” Says Bloomberg Analyst - Yahoo Finance",
        "content": "Odds of Ethereum Spot ETF Approval Are “Slim to None,” Says Bloomberg Analyst\n\nThe crypto world anxiously awaits the U.S. Securities and Exchange Commission's (SEC) pivotal ruling on the approval of a spot Ethereum ETF, scheduled for May 31st. As the deadline draws near, several factors have come into play, casting uncertainty over the decision's outcome.\n\nAt the center of the SEC's deliberations is a crucial question: whether Ethereum should be classified as a security or a commodity. This determination could significantly impact the fate of the spot ETF applications filed by various firms, including VanEck, ARK 21Shares, Hashdex, Invesco Galaxy, BlackRock, and Fidelity.\n\nIn a recent development, finance lawyer Scott Johnsson highlighted a concerning detail from a March filing by BlackRock regarding its spot Ether ETF application. The filing called for public feedback on whether the investment vehicle could be listed as a commodity, suggesting that the SEC might be exploring the possibility of labeling Ether (ETH) as a security.\n\n\"The obvious purpose is to potentially deny on the basis that these spot filings are improperly filed as commodity-based trust shares and do not qualify if they are holding a security,\" Johnsson stated in an X post.\n\nMixed Expectations and Market Reactions\n\nBloomberg's senior ETF analyst, Eric Balchunas, has expressed skepticism regarding the likelihood of approval, reflecting the general sentiment that the regulator might maintain a cautious stance toward cryptocurrency-related products."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9NamkwVjNXTkp5RnBWMFNhdGtIZUdheDVSTGo1Vzk0QU1YZl9ienJlWkYwOGVkWFE4SWdERDVyMlRmLU5GQ21oSmlVMGFPeTV1X1B2TzBaZzU5bDd3U3h2QjdWYTJLbFVkQnhhN19xeWtMMTJseVpNNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum Poised For Bullish Surge: Analyst Predicts Major Breakout - TronWeekly",
        "content": "The famous crypto analyst Javon Marks has just made a very optimistic forecast for Ethereum (ETH), which has excited investors and traders. In his last post on X, Marks pointed out several bullish indicators that signal Ethereum might be about to experience a huge price jump.\n\nBased on Marks’ analysis, the current price structure of ETH is like a bull flag, a technical pattern that usually indicates a further upward trend. He stressed that the higher formation of the ETH’s price action indicated the continued buying interest and strength of the buyers. This pattern is reinforced by a hidden bullish divergence in the Relative Strength Index (RSI) where lower lows in the RSI are opposed to the higher lows in the price action.\n\nMarks stressed that this diversion is a major signal of the possible upward trend. Lower lows in RSI and higher lows in price action make a hidden bullish divergence which reveals the underlying strength in ETH’s current trend.\n\nEthereum Eyes $4,811: Major Breakout Ahead?\n\nThe analyst also mentioned that a greater price breakout was on the way. He estimated an upside potential of over 63%, which could take ETH to a price of $4,811. This projection is drawn from the technical analysis and the past performance of similar patterns.\n\nSource: Chart by Javon Marks\n\nA successful bull flag breakout could be the cause of Ethereum reaching its new all-time highs, thus, affecting the whole altcoin market significantly. He thinks that if this happens, it would not only be a turning point for Ethereum but also a driving force for the advancement of other altcoins that usually follow the movements of Ethereum.\n\nInvestors and traders are watching the price action of Ethereum closely, hoping to get a signal of the bull flag breakout. If Marks’ estimations are right, the crypto market could have a major rise, and Ethereum would be the one to lead the way. The possibility of new all-time highs is a great chance for those, who are in a good position in the market, to make a profit.\n\nJavon Marks’ latest analysis shows that Ethereum has a bright future, as the technical indicators are in accordance with the trend. The market is waiting for ETH’s breakout, which could be the key to the cryptocurrency market’s future.\n\n\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUnpwODBqZFowVTliYW5NZlpIT2ZfQnVSUWhyODNvQzBNLXpkNFBvMFN6czE2SzhkWS01QzhVWHc2T0tyTVc5Z3lfYkFZWFRmT0F0LVFxM3pzbG5PbUNGcjZ6RGk3OHF0QkFxb2JpdEtnVzZZZU5hRGh3ZGZveTZpYmdsMU1Ldw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "2 crypto thieves have been charged in a $25 million Ethereum heist - Quartz",
        "content": "The U.S. Department of Justice has arrested two brothers for attacking the Ethereum blockchain and stealing $25 million worth of cryptocurrency within 12 seconds, it said in an unsealed indictment on Wednesday.\n\nAT&T is selling its stake in DirecTV Share AT&T is selling its stake in DirecTV\n\nThe indictment is charging Anton Peraire-Bueno, 24, of Boston, and James Pepaire-Bueno, 28, of New York, with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering, the agency said.\n\nAdvertisement\n\nThe DOJ said the duo allegedly committed a “first-of-its-kind manipulation” of the Ethereum blockchain. In doing so, they were able to redirect pending transactions to ultimately steal $25 million in cryptocurrency.\n\nAdvertisement\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,” said U.S. Attorney Damian Williams for the Southern District of New York.\n\nAdvertisement\n\nThe DOJ said that because the Peraire-Bueno brothers studied computer science and math at “one of the most prestigious universities in the world,” their education could have helped them carry out the scheme.\n\nIf convicted, the Peraire-Bueno brothers each face a maximum of 20 years in prison for each of three counts they are being charged with, the DOJ said.\n\nAdvertisement\n\nCharges against the brothers come also come amid deliberations of whether the U.S. Securities and Exchange Commission (SEC) will move to approve an Ethereum exchange-traded-fund (ETFs). The ruling, scheduled for later this year, would let investors gain exposure to ether tokens without directly owning the cryptocurrency.\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPaS1WeC1MdUcwNkhfcTVRQnlzVC1sakFQM1NCNVJrcUU0MkxleVRzTHpxbkdIZHl2ZGRFWWhxbnpCLTlSdXVObWR6UEh5SWdGYVZCTEFkcm80a3NMX0pZRUdtd2FNMHBNU3BKaHUxWlJ6Z0s4ejU0SkpKX2xRWkxLWE9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "US indicts Ethereum validators for exploiting MEV trader - Protos",
        "content": "Anton Peraire-Bueno and James Peraire-Bueno, two brothers who operate Ethereum validators, have been indicted in the Southern District of New York on charges of wire fraud, conspiracy to commit wire fraud, and conspiracy to commit money laundering.\n\nThe charges related to a scheme that has been described as exploiting the ‘very integrity of the Ethereum Blockchain to fraudulently obtain approximately $25 million.’\n\nThe brothers allegedly worked together on a complex exploit that allowed them to take advantage of traders searching for ‘maximum extractable value’ (MEV) on Ethereum.\n\nBy operating multiple Ethereum validators, the brothers were allegedly able to submit blocks that included exploited transactions.\n\nAllegedly, once the brothers were aware that their validators would soon have opportunities to submit blocks, they would create ‘bait’ transactions that seemed to have significant upside for the MEV traders and wait for those traders to attempt to ‘sandwich’ their trades.\n\nThese sandwich bots will often look for transactions with the potential for arbitrage and place transactions that buy shortly before and sell shortly after.\n\nWhen the traders were baited into submitting these ‘bundles’ of transactions, the brothers allegedly submitted a fake signature to MEV-Boost Relay, which at the time resulted in the relays prematurely releasing the whole proposed block.\n\nThey then allegedly took advantage of the fact that they were operating validators to disassemble the block and allow the traders to still front-run. However, instead of buying the asset the MEV trader believes they are interested in, they actually sold that asset at the higher price.\n\nA rogue validator on Flashbot seems to be exploiting MEV bots. Over 25m USD already stolen.\n\n\n\nThe validator takes a sandwich bundle from the MEV bot and replaces the victim transaction with it's own that exploits the MEV bot instead.\n\n\n\nHere's how it works – pic.twitter.com/il3o9r41J1 — Mudit Gupta (@Mudit__Gupta) April 3, 2023\n\nRead more: How Flashbots is taking over Ethereum block proposals\n\nThis technique did potentially put their validators at risk of slashing, but the $25 million they were able to take outweighed the economic costs.\n\nThe indictment additionally details some of the steps the brothers allegedly took to plan for the exploit and to launder the funds once received. This allegedly included creating an ‘exploit plan’ that broke down the exploit into four steps:\n\nThe bait Unblinding the block The search The propagation\n\nAfter the exploit, the brothers turned to internet searches to manage the risk of their decisions, allegedly searching for:\n\n‘Top crypto lawyers’\n\n‘How long is US statute of limitations’\n\n‘Wire fraud statute/wire fraud statute of limitations’\n\n‘Money laundering statute of limitations’\n\n‘Computer fraud abuse act’\n\n‘Does the United States extradite to’\n\nIn order to help clean the funds they received from this exploit, the brothers allegedly transferred some to a ‘second-layer exploit address,’ which was subsequently frozen. Much of the remainder, totaling approximately $22 million, was converted to Dai, a stablecoin.\n\nAfter going through a lending protocol, this Dai was allegedly exchanged for Circle’s stablecoin USDC. These funds were then allegedly transferred to an exchange account controlled by Pine Needle Inc., the company set up by the brothers, before being transferred again to a bank account associated with their business.\n\nThis indictment represents the first time that anybody has been indicted in the United States on fraud charges related to changing the expected ordering of transactions on Ethereum.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRjNsLUUzcDZ4dFFxWVdkTDIyNUdFQU9UX3NDVUw5TTNCeUlQYlltR2IyamI4WDZwbzFocTRCRDRxd3pQMWc5UE5xTk03Z0UtNGlBM2NkMlA5X0RMUjN0UXExS05ZbWdOR254TlluSEtTVVh3RW10eGdDRHdfbTd6aS1DVjdwTzlmVE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Deadline Approaches for SEC’s Spot Ethereum Decision - Nasdaq",
        "content": "By May 23 — exactly a week from now — the SEC will need to reach a decision on VanEck’s spot ethereum application.\n\nVanEck isn’t the only one aiming to get approval. The deadline for ARK Investment Management’s filing with 21Shares is May 24, just a single day after VanEck's. Recently, ARK and 21Shares updated their application to remove a staking clause.\n\nMinimal Hope\n\nAs for what to expect from the SEC, analysts aren’t exactly enthusiastic. Ric Edelman, head of the Digital Asset Council of Financial Professionals, recently told CNBC he “would be astonished if the SEC said yes at this point,” citing the lack of correspondence between the SEC and VanEck.\n\nVanEck CEO Jan van Eck is not optimistic that the SEC will approve the firm’s ethereum ETF application just yet. In April, van Eck told CNBC he expected his firm’s ethereum filing to “probably be rejected.”\n\n“The way the legal process goes is the regulators will give you comments on your application, and that happened for weeks and weeks before the bitcoin ETFs — and right now, pins are dropping as far as ethereum is concerned,” the VanEck CEO added.\n\nA March filing regarding BlackRock’s petitioned spot ether ETF indicated the SEC may be considering labeling ethereum as a security, not a commodity. The filing delayed BlackRock’s decision until June and asked for public comment on whether ETH is a security or a commodity.\n\nMeanwhile, Grayscale Investments has withdrawn its filing for an ethereum futures ETF. This comes while Grayscale awaits approval on its proposal to convert the Grayscale Ethereum Trust into a spot ether ETF.\n\nDespite the pessimism over the SEC’s next moves, the price of ethereum is doing quite well. The cryptocurrency is currently hovering around the $3,000 range. This marks a stark gain in more than a year: Ethereum sat closer to $1,800 in May 2023.\n\nLooking ahead, the SEC’s debate over whether ethereum is a commodity or a security could keep spot ethereum ETFs off the market for now. Ether’s regulatory status will ultimately determine whether or not spot ether is here to stay.\n\n﻿\n\nFor more news, information, and strategy, visit the Crypto Channel.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE5RSWotempJTUdQalZVNUhvWTBGaTBtaHdZa1FNdldDdVNUaUItbjBFTFZpYV9VUzZNZTRCRGdDUHZPQUpxX0h4b01pZkJJY2JnN0hBMGJGY0NwOXplZlHSAWNBVV95cUxPVTdiN2lNZWJ0bUNhZUZNSzdjN3gtRTFLS0VSMXM3Y0VrNWlCa2NMYWFGUXRVNjF5N1FGT1R3dmViMGpZeUNLNGZwTkR2a0otLXIxMVEwbnpkT1pfMWxONHVaWHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "US brothers arrested for stealing $25m in crypto in just 12 seconds - BBC.com",
        "content": "US brothers arrested for stealing $25m in crypto in just 12 seconds\n\nGetty Images\n\nTwo brothers who studied at one of the most prestigious universities in the US have been charged with stealing $25m (£20m) in cryptocurrency in 12 seconds.\n\nAnton Peraire-Bueno, 24, and James Peraire-Bueno, 28, are accused of wire fraud and money laundering.\n\nThe US Department of Justice said the alleged heist is the first of its kind.\n\nProsecutors also say the pair, reportedly educated at the Massachusetts Institute of Technology (MIT), carried it out in April 2023.\n\n\"The Peraire-Bueno brothers stole $25 million in Ethereum cryptocurrency through a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds,\" said Deputy Attorney General Lisa Monaco.\n\nShe added that agents from the Internal Revenue Service (IRS) played a key role in unravelling the \"first-of-its kind wire fraud and money laundering scheme\".\n\nProsecutors allege the two used highly specialised skills that they learned at \"one of the most prestigious universities in the world\" to exploit Ethereum's process for validating transactions.\n\nThe brothers studied mathematics and computer science, according to the indictments, and both attended MIT, according to news reports.\n\n\"The defendants' scheme calls the very integrity of the blockchain into question,\" US Attorney Damian Williams said in a statement on Wednesday, referring to the public ledger that records crypto payments.\n\nThe brothers allegedly stole from Ethereum traders by fraudulently gaining access to pending private transactions and then altering the transactions to obtain their victims' cryptocurrency.\n\nThe process, which investigators say they referred to as \"the Exploit\", took only a matter of seconds to execute.\n\nWhen confronted by a representative for Ethereum, officials say the brothers declined to return the funds and took steps to launder and hide their stolen gains.\n\nProsecutors note that this is the first time that such a \"novel\" form of fraud has ever been subject to criminal charges."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNVUtYQzNqY2JJNjNSRkJpdVk4OVEyRmpOWlpnczRaNWo1ZWQ3eVZ3VG5Cd196NVVmNVVaYjZFdWVRbHRlN2QtQUhPY1ZOTTRRaGtXdjNPTXFFaXJvc0VoWFpUenBucUczZWo1LTczejFUNXYtOTREelNwTDdtdnBqM2dYTHZQVDdEQVRNcXFpQmRreUVuZU9iZ3NHcHJ3WjVDcHp0MGNHZTRTN1RYeVE4QkRaZkFEUzd4a1k3ZVd6SFR4aWtYZ2xNMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bybit's Ethereum Euphoria: Predict Market Movements for the ETH ETF and Win - PR Newswire",
        "content": "DUBAI, UAE, May 15, 2024 /PRNewswire/ -- As anticipation builds for the U.S. Securities and Exchange Commission's (SEC) decision on Ethereum Spot ETF applications, Bybit , one of the world's top three crypto exchanges by volume, has launched \" Ethereum Euphoria : The ETF Expedition.\" This event offers Bybit users the chance to win USDT and a Tesla Cybertruck while learning about the impact of major market events.\n\nThe \"Ethereum Euphoria: The ETF Expedition\" campaign features two main activities:\n\nBybit's Ethereum Euphoria: Predict Market Movements for the ETH ETF and Win\n\nDaily ETH Price Prediction: Users can predict the daily price of the ETHUSDT perpetual contract at 10:00 AM UTC the following day. The user who accurately predicts or comes closest to the actual price will win 1 ETH. This activity runs for 20 rounds over a 21-day period, with a total of 20 ETH up for grabs. ETH Spot Trading Pair Price Trend Prediction: Users can predict the price trend of eight ETH-related spot trading pairs (ETHUSDT, WLDUSDT, ARBUSDT, STRKUSDT, MATICUSDT, MNTUSDT, SHIBUSDT, and OPUSDT) and earn points to exchange for generous rewards.\n\nTo maximize their chances of winning, users need to achieve a daily cumulative derivatives trading volume of $500 or more or take advantage of the daily free prediction chances available between 2 PM and 4 PM UTC. Bybit is offering 1000 free chances per day on a first-come, first-served basis. And participants whose points rank in the top 200 will have a chance to win Tesla Cybertruck.\n\n\"As the crypto landscape evolves, it's crucial for traders to stay informed and capitalize on rare events like the Ethereum ETF decision,\" said Joan Han, Sales & Marketing Director at Bybit. \"We believe that informed traders are empowered traders, and this campaign is designed to foster that spirit.\"\n\nBybit invites all traders and crypto enthusiasts to join the \"Ethereum Euphoria: The ETF Expedition\" campaign. Don't miss this golden opportunity to participate in Ethereum Euphoria and win big rewards.\n\n#Bybit / #TheCryptoArk\n\nAbout Bybit\n\nBybit is a top-three cryptocurrency exchange by volume with 25 million users established in 2018. It offers a professional platform where crypto investors and traders can find an ultra-fast matching engine, 24/7 customer service, and multilingual community support. Bybit is a proud partner of Formula One's reigning Constructors' and Drivers' champions: the Oracle Red Bull Racing team.\n\nFor more details about Bybit, please visit Bybit Press .\n\nFor media inquiries, please contact: [email protected]\n\nFor more information, please visit: https://www.bybit.com\n\nFor updates, please follow: Bybit's Communities and Social Media\n\nDiscord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube\n\nSOURCE Bybit"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPdWtMQXhEQzY1TzlibWU3U21ZenFFWmF6b2N1MFdYbE9VSEI1S0gwM0piWUY2d2NKWTZ3UDJNdGdzZzI5UHZwMWExS0x0cGhHa0lOOU9DYThYRkZBOF9PY0JNZTRaTWFUVzRtT1IyckNZaVVmX2twLUwzczhRRHB0ZVduYlROZGFZb0lFVWh3b0FuaDlhajlCcHVDWk9xNGFxNkdV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "SEC approval of spot ethereum ETFs would benefit all investors - American Banker",
        "content": "The SEC, having already approved spot bitcoin ETFs, ought to follow through and grant the same approval to spot ethereum funds. Doing so would create a new surge of investment, with positive economic impacts, writes Rachel Lin, of SynFutures. Unshu - stock.adobe.com\n\nOpinions vary widely on the potential approval of spot ethereum exchange-traded funds, or ETFs , by the U.S. Securities and Exchange Commission . Despite mounting uncertainty about when or if the regulator will approve the new financial instrument, there is optimism ahead pertaining to the prospects of an ethereum ETF approval — akin to the fervor for the once long-awaited bitcoin ETF .\n\nThe BTC ETF proved pivotal in driving institutional interest in the digital asset class, particularly in regions like Hong Kong, Singapore and Dubai, where investors sought new growth opportunities after missing out on the stock market surge. Its success was the impetus to drive investors that once shunned cryptocurrencies to finally make the leap in a more secure fashion.\n\nAs the second-largest digital asset, ethereum boasts a vast ecosystem that positions it as a front-runner in the digital economy. Regulatory clarity, coupled with institutional investment, is poised to propel ethereum to unprecedented heights. Beyond mere price action, the approval of ethereum ETFs holds symbolic importance, solidifying crypto's status as a legitimate asset class and reinforcing its role in the evolving financial landscape.\n\nThe trend toward regulatory clarity is unmistakable, evidenced by the SEC's acknowledgement of ethereum's non-security status in permitting futures trading. This sets a clear precedent for the approval of a spot ethereum ETF. To deviate from this path would not only highlight regulatory ambiguity but also undermine market confidence. Moreover, proactive regulatory initiatives in various jurisdictions like Hong Kong, where plans for spot bitcoin and ethereum ETFs have just been greenlit, highlights the growing global acceptance and recognition of the potential of ethereum-based financial instruments. These developments underscore the urgent need for the SEC to align its regulatory framework with evolving market dynamics and maintain competitiveness in the global landscape.\n\nUndoubtedly, market demand from institutional investors serves as a driving force behind the push for ethereum ETF approval. The lineup of heavyweight players eagerly awaiting the green light — BlackRock, Fidelity, Invesco with Galaxy, Grayscale, VanEck, 21Shares with Ark and Hashdex, and most recently Bitwise — underscores the potential for ethereum ETFs to unlock new avenues for investment and liquidity. This influx of institutional capital could not only boost ethereum's market profile but also catalyze the development of more sophisticated products and services within the ethereum ecosystem.\n\nCryptocurrency House votes to nullify crypto custody guidance; Biden vows veto The House advanced a resolution that would roll back a Securities and Exchange Commission resolution that banks argue cuts them out of the crypto custodying business, but President Biden said he would veto it if it passes the Senate. May 9\n\nMoreover, the fact that the global ETF assets under management, or AUM, have exceeded $11 trillion suggests that investors are increasingly turning to ETFs as a preferred investment vehicle. While ETFs represent 13% of equity assets in the United States, indicating a significant adoption rate, their penetration is comparatively lower in Europe (8.8%) and the Asia-Pacific region (4.6%). The lower penetration rates of ETFs in Europe and the Asia-Pacific region suggest potential opportunities for growth. As more ETF products become available tailored to regional preferences and regulatory requirements, we may see a further expansion of the ETF market globally.\n\nConsidering the lessons learnt from BTC ETFs and the increasing recognition of crypto as a viable alternative asset, especially in a cooling economy, ETFs offer a less burdensome and tax-efficient means of exposure to cryptocurrencies. They simplify the complexities associated with owning crypto outright and broaden accessibility from individual retirement accounts all the way to large institutional accounts.\n\nThe broader impact of ethereum ETF approval reverberates across both short and long-term horizons. In the short term, we can expect increased trading activity and price volatility for ethereum and altcoins in the days leading up to the SEC's decision. However, in the long run, institutional adoption facilitated by ethereum ETFs could spur ecosystem growth, paving the way for a more robust and diverse range of financial instruments. Moreover, approval would provide much-needed regulatory clarity, particularly for ethereum-based financial products, mitigating uncertainty and fostering a conducive environment for innovation.\n\nIn light of the regulatory precedent, global trends and market demand, it appears increasingly likely that the SEC will grant approval for ethereum ETFs, notwithstanding delays and regulatory hurdles. I confidently predict that this will propel prices of bitcoin and ethereum to new heights. These milestones will reflect the growing confidence in cryptocurrencies and herald a new era of mainstream adoption and acceptance.\n\n"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPVGNnWkViaWxFNUVMTGVpdFRfUFphRVBXbDlmNXJjbDUzUkxIM3JsWmlRUVA5QVZTdWVNTF9oQ3Blc0ZZd2xyR0ZDd055NXR5QldMT1V1U0xXYXNOZzgyeU8xX3BuOVdCWTNEcDlvbEZWVnJ6djhfSk9LOHJkaTlDck1RcXV5ZUc5NVQ3aElMaUZjdVHSAZsBQVVfeXFMUFVfMGdhblByQnNTUWE3SmExamlua19LeGMwenZUZEJQQkxpMFIyUlRUN2MxemUwckFybDJ4WDZJaEMwYzFyUFlZU19ka1ZXdEViV3dxSmVnbWZNRl91V3ZaRVlseHlvQU8wZEFsb0NuQ0VTWVlQeW5BNUhfRnRrNnNEYmxLa2FWM1JEUEJQMk5WLWhnd0R3cFJzdTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Steady Ahead of U.S. Consumer Prices Report - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, were steady hours heading into another U.S. Bureau of Labor Statistics consumer prices report.\n\nThe new Consumer Price Index report will be released at 8:30 a.m. EST. For now, things seem pretty tame in crypto markets.\n\nBitcoin price sitting just above $62,000—up 0.6% compared to the same time yesterday. And the Ethereum price, which had sunk to around $2,900, was down 0.2% since Tuesday morning, according to CoinGecko data.\n\nEconomists have been forecasting that the market is in for another disappointingly high Consumer Price Index report today. The CPI is one of the key metrics that the Federal Reserve uses to determine whether it should lower the federal interest rate. But analysts have flagged that gas prices have been on the rise and prices have been inching upwards in the services sectors.\n\nAD\n\nAD\n\nIt's bad, but not necessarily terrible news, Michael Pugliese, senior economist at Wells Fargo, told Morningstar.\n\n“The trajectory is still down,\" he said, \"but it’s been a more gradual downward move relative to the expectations coming into 2024.”\n\nWhen the BLS issued its March Consumer Price Index report last month, it showed that personal expenditures in the U.S. had grown by 3.7%. The news that the U.S. economy had been growing slower than expected caused BTC and ETH to dip.\n\nBitcoin started the month having sunk below $60,000, briefly touched $65,000, and triggered the liquidation of hundreds of millions worth of derivatives positions along the way. More recently, the mix of macroeconomic factors—including the war in Israel's War on Gaza and slowed growth in major economies like the U.S.—has sparked pessimism in crypto markets.\n\nAD\n\nAD\n\nBut there's a little good news: Bitcoin billionaire Arthur Hayes said earlier this month that the bottom for BTC is already in.\n\n\"I expect prices to bottom, chop, and begin a slow grind higher,\" he wrote in a recent blog post. But he noted that he wasn't planning to add more Bitcoin to his bags.\n\n\"The recent intense puke out provides an excellent opportunity to unstake my USDe and spend synthetic dollars on high beta shitcoins,\" Hayes said. \"I’m buying Solana and doggie coins for momentum trading positions.\""
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOZ1JaZkNTczZGSTNFYjA5d2pnQUdOUVd3RTlwVHJXUHVEU1NmakNmUUFwMWdSWURnODlFakdRQ3FCb3JJSGFNelRwUVdGUU5vbHZIYnlXVzZiT0Jhd3ZsRWpsMFdISVY3S0p4anZ0elpYcTdYcUJYdHZCUDgyaUdRQjQ2VnozNl9ybnF5ekZOTHBwZDhFN2RrNUs3VGxGbGU5RVNLQ0N0OVpwSXdCUklSRExyONIBuAFBVV95cUxPOFMtNmd5WmhWM0VRZWtjSWNMMEVHWjFMZ29weTN4V1c5NEkwMklOUXljV0pXa0diaWdCUmw5NDBKcVpkZmR5VDlPcDRZU2VNV3B0TVBvXzhwa3J6SXJXam11VzFfTWt4eUU2ZEFLVnlySG1Sc1N1Y1hKbmVsaW9oa2U3S2I4QVA1NnlfZExQODVLYXpGY0N3a0MxanZVRmFzd1duNWx5cHRZMXNhcTFhclRXTXlWSlRi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Justice Department charges MIT brothers with $25 million crypto theft that took 12 seconds - CNBC",
        "content": "The Department of Justice on Wednesday announced the indictment of two brothers who graduated from the Massachusetts Institute of Technology for allegedly stealing $25 million in cryptocurrency within roughly 12 seconds.\n\nThe DOJ said the brothers —James Peraire-Bueno and Anton Peraire-Bueno — plotted the \"first-of-its-kind\" crypto fraud involving Ethereum blockchain over several months.\n\nTheir father is Jaime Peraire, the H.N. Slater Professor in Aeronautics and Astronautics at MIT and a former head of the university's Department of Aeronautics and Astronautics.\n\n\"We are in shock, we don't even know what's going on,\" Jaime Peraire told CNBC when contacted at his home in Massachusetts, and asked about the arrest of James, 28, and 24-year-old Anton.\n\nPeraire declined to comment further.\n\nProsecutors said that Peraire-Bueno brothers allegedly identified a vulnerability in the Ethereum blockchain that allows outsourced bots to identify the most valuable pending crypto transactions before adding them to the blockchain, according to the indictment.\n\nThey then allegedly posed as the Ethereum validators that use those bots and redirected the pending transactions to steal the $25 million, the indictment said. Foreign law enforcers allegedly froze roughly $3 million of those funds, but the two men converted the unfrozen money to the DAI crypto token, which is pegged to the U.S. dollar, the DOJ said.\n\nThe Peraire-Buenos also allegedly set up shell companies and used multiple private cryptocurrency addresses and foreign cryptocurrency exchanges to hide their scheme.\n\n\"The defendants' scheme calls the very integrity of the blockchain into question,\" said Manhattan U.S. Attorney Damian Williams, whose office is prosecuting the two men.\n\n\"Once they put their plan into action, their heist only took 12 seconds to complete,\" Williams said. \"This alleged scheme was novel and has never before been charged.\"\n\nJames, who lives in New York City, and Anton, who lives in Boston, were arrested Tuesday on charges of conspiracy to commit wire fraud, wire fraud and money laundering.\n\nThey appeared separately in federal court in New York and Boston on Wednesday afternoon.\n\nJudges set their bonds at $250,000 apiece, and each will be required to obtain two co-signers for their release bonds by May 29, according to a spokesman for the Manhattan U.S. Attorney's Office. They are also barred from trading cryptocurrency, securities and commodities.\n\nIf convicted, the brothers face a maximum sentence of 20 years in prison for each of the three counts.\n\nWilliams's office said the Peraire-Bueno brothers studied math and computer science \"at one of the most prestigious universities in the country,\" and said that their education would have helped them to acquire the ability to carry out the alleged fraud.\n\nJames Peraire-Bueno earned a Bachelor of Science in mathematics with computer science, and in aerospace engineering in June 2019 from MIT, and then in June 2021 earned a Master of Science in aeronautics and astronautics from the school, according to an MIT spokeswoman.\n\nDuring his undergraduate years, he was a member of MIT's sailing team.\n\nAnton Peraire-Bueno earned a Bachelor of Science in computer science and engineering from MIT in February. He was a member of the university's rowing team.\n\nAnton's LinkedIn page says he was a cryptocurrency researcher intern at a San Francisco-based Polychain Capital for several months in 2021.\n\nIn 2020, Anton co-authored an academic paper about a machine learning model that could have \"a strong practical impact\" for organizations \"with large amounts of sensitive data,\" according to a synopsis of that paper.\n\nLawyers for Anton did not immediately respond to requests for comment. The court docket did not show that any attorneys had filed appearances on behalf of James.\n\nThe charges come ahead of a long-awaited ruling expected from the Securities and Exchange Commission later this month on whether to approve an Ethereum exchange-traded fund.\n\nThat ETF would allow investors access to the ether token without having to directly own the cryptocurrency.\n\nIssuers of Bitcoin ETFs have already been bearish on the chances that the SEC will approve an ether ETF.\n\nThe DOJ's announcement of the alleged fraud could increase skepticism as the SEC completes that review.\n\nSEC Chair Gary Gensler has expressed concern about lacking regulation in crypto markets that could make it a dangerous listing for investors.\n\n\"To me, the fundamental question is, how do we ensure that the American investor is protected? And right now, they're not getting the required or needed disclosures,\" Gensler said in an interview on CNBC's \"Squawk Box\" earlier this month.\n\n\"And the intermediaries in the center of this rather centralized market generally are conflicted and doing things we would never allow the New York Stock Exchange to do,\" he said."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxONkVUUmhlQ1h5b2RCc3k0ZUhHMWNjdmI5eGlDbnlndl9uZVpQekdPMlQ5RE5rSWFkekRQS1dtNzVGbE01Q3ZrTW1fOVIwWTg1RERBV3B5ZTNTLVFDUTZtaWI2bjNsR0s5clJxNzNOTVRucnU1LTc2Vy02MnBfTXpNdFFNRENCTzBkYUV4djI2VHI0dXBnamk5TjY0bjFUZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Brothers stole $25m from Ethereum MEV bots, prosecutors allege - DLNews",
        "content": "A pair of brothers are facing three charges after they allegedly executed a “cutting-edge scheme.”\n\nThe alleged fraud involved tricking three traders’ MEV bots into making a $25 million trade, according to prosecutors.\n\nA pair of MIT-educated brothers made off with $25 million in a “novel scheme” that targeted crypto trading bots on the Ethereum blockchain, US prosecutors allege.\n\nIn an indictment unsealed Wednesday, prosecutors charged Boston’s Anton Peraire-Bueno, 24, and New York’s James Pepaire-Bueno, 28, with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering.\n\n“The defendants’ scheme calls the very integrity of the blockchain into question,” Damian Williams, US Attorney for the Southern District of New York, said in a statement.\n\n“This alleged scheme was novel and has never before been charged.”\n\nAnton Peraire-Bueno didn’t immediately respond to a DL News inquiry.\n\nThe alleged scheme took advantage of three traders’ MEV bots — Ethereum-based, automated trading programs that scan the blockchain seeking profitable opportunities to front-run pending transactions.\n\nThe brothers also exploited a vulnerability in Flashbots, software that hides pending transactions on Ethereum in order to limit the efficacy of MEV bots, prosecutors allege.\n\nThrough the alleged scheme, the brothers tricked the three traders’ MEV bots into buying illiquid tokens worth $25 million, according to prosecutors.\n\nJoin the community to get our latest stories and updates\n\nUsing the Flashbots exploit, the brothers then tampered with the pending transactions to acquire the $25 million in stablecoins and other, more liquid tokens the MEV bots had used to purchase the illiquid tokens, prosecutors allege.\n\nThe MEV bots, which had assumed they could profit off the purchase of the illiquid tokens by immediately selling them at a markup, were left holding the bag, according to the indictment.\n\n“As a result of these actions, the Victim Traders’ final sell transactions could not take place,” the indictment reads. “The illiquid cryptocurrencies which the Victim Traders purchased in the frontrun transactions had been rendered effectively worthless.”\n\nIn the months before and after the exploit, the brothers had searched for ways to dodge accountability, according to prosecutors. Among other things, their web searches allegedly included “how to wash crypto,” “cefi exchanges with no kyc,” “top crypto lawyers,” and “wire fraud statute / wire fraud statute of limitations.”\n\n“As alleged in today’s indictment, the Peraire-Bueno brothers stole $25 million in Ethereum cryptocurrency through a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds,” Lisa Monaco, deputy attorney general, said in the statement.\n\n“As cryptocurrency markets continue to evolve, the Department will continue to root out fraud, support victims, and restore confidence to these markets.”\n\nThe brothers were arrested Tuesday, according to prosecutors. If the brothers are found guilty, they face a maximum sentence of 20 years in prison for each count.\n\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can contact him at aleks@dlnews.com."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQ1ZqTzFtdFhXRGU2UGZkLUVLejlfNTlZN2VQVW1zWWJUeW5IeXlvM05rOEQ2UHM4Y3JMSTRja1kwVzZHLVE0azZXbmVZMnlfSXBLZ3BzdDZzaTk2QlhkbjFYTEc0WTdtM1I0cDB6ci1lb1BTOENXeHhRcGVoVVVHRUtIMmhQQk43bHlFaXlRLUtKaERDWEJYUE9aeVbSAaIBQVVfeXFMTnhoRy1OT2t2c0xqaHJxazQtSWlYa2E2dXY2RlljR1FHblVIMzV5UUJLdWJfdHRfbGJxaWpyeC1vR29PZGdaZWswZU5oVUZwNXVJNXQySTRlNHBmejFOOGlDb20tbFQ5YkZHOEx0enlFUGxnODQ5ZzFRaTRTZmNQdjdRM3pET215ZGMzTk5tanRsUXhNMzFMRVc3RUlMWmZyUl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price to Reach $10,000 by the End of 2024? Analyst Weighs In - CryptoPotato",
        "content": "TL;DR\n\nEthereum’s price recently surpassed $3,000, with analysts predicting further significant gains.\n\nDeclining MVRV ratio, negative exchange netflow, and potential approval of a spot Ethereum ETF in the US could drive ETH’s value higher.\n\nIs ETH Gearing up for an ATH?\n\nThe cryptocurrency market has experienced a significant uptrend in the past few days, with numerous digital assets rising to multi-week highs. Although not witnessing such a substantial increase, Ethereum (ETH) is also among the notable gainers.\n\nIts price surpassed the $3,000 mark, representing a 4% increase on a daily scale. Numerous analysts believe this could be the starting point of a bull run that can take place in the near future.\n\nThe X user Michael van de Poppe is among the optimists. He claimed recently that ETH is on its way to reaching a higher timeframe support level. “The good times are there in a few weeks’ time,” he assumed.\n\nCryptoYoddha was even more bullish, envisioning a price explosion toward the $10,000 milestone by the end of the year.\n\nLast but not least, World of Charts argued that ETH has started breaking the “falling wedge consolidation” on a 12-hour timeframe. “Trend is already up and expecting continuation towards $4500 in coming weeks,” the analyst forecasted.\n\nObserving Some Important Factors\n\nOne element signaling that ETH’s value could be on the verge of a rally is the Market Value to Realized Value (MVRV). It helps to identify if the asset is overvalued or undervalued. A high ratio suggests a market top, while a low one may indicate a good buying opportunity. The MVRV has been on a significant downfall since mid-March.\n\nAnother factor is ETH’s exchange netflow, which has been predominantly negative in the past month (according to CryptoQuant’s data). Shifting from centralized platforms towards self-custody methods is considered bullish since it reduces the immediate selling pressure.\n\nLast but not least, ETH’s price may head north in case of the approval of a spot Ethereum ETF in the United States. However, such a green light may also lead to the same immediate “sell-the-news” event witnessed after the BTC ETF approvals in January."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOTkFKMk5lR0xFQUVRZGJaa2x6ck10aVE1NEhyRmdfV1EwZWEydjhUUVVET1pScFFVd3dZODZhMENWWjZCMVNfSGNvLUlQMmFfRnVya3ZvVGFEQlAwMTFYLTl2RFA1X043WXE2YUJDYV9VOXVzcE5wVy1TRWxpcmphZVhDUS1wZUM5d2FNVHBjN2JMdUthTHgxajJlbFVsNV81SHN2YzBEcUx1TTQ5M3Z3Z05rVzI3WmFTUENTdjBidUIwNm9qZHfSAcsBQVVfeXFMUEVMLWZTZXdnR1luRnpEdkF2U2JmYnpsYlFPMXd6UEY4cXQtdGRNVFdFcWxEQ2JyNTA4UXlFMVBBVDN0aGhBLVBxdXBtbWRtUFNyMFlnZjJkUGJyM01LeXJCa0RXNVhIRkphNHZVT2s5a09HbFVUOUNSUkFpaW02ZDZHR29hZnFCQW5uaTN5cG1qMjFaZ0t2djVfWldXZ1Znb1JFZEVrOER0c0R6eUdnV2hDOFJrSmRobFBtaW9YR0dlYk9rLWdhN0RvOWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum Flashing Bearish Signal, According to Crypto Analyst Benjamin Cowen – Here’s His Outlook - The Daily Hodl",
        "content": "Widely followed cryptocurrency analyst Benjamin Cowen is warning that the price of Ethereum (ETH) could depreciate drastically.\n\nCowen tells his 801,000 YouTube subscribers that Ethereum has fallen below the bull market support band (BMSB), an indicator consisting of a 20-week simple moving average and a 21-week exponential moving average used to determine whether the price of an asset is in bullish or bearish territory.\n\n“The last time that Ethereum fell below its bull market support band was actually about 30 weeks ago. Or the last time it was below its 20-week simple moving average was about 30 weeks ago. So it’s been quite a while and now we have closed below it once again.”\n\nAccording to Cowen, the price of Ethereum fell drastically during two previous times that closely resemble the current moment when the second-largest crypto asset closed below the BMSB.\n\n“In both cases, after it fell below the Bull Mark Support Band, Ethereum/US dollar then fell about another 50%…\n\n…50% from here [around $2,970] puts ETH all the way back down at around $1,400.”\n\nEthereum is trading at $2,902 at time of writing.\n\nThe widely followed analyst says that he foresees the Ethereum/Bitcoin (ETH/BTC) pair bottoming out over the coming weeks though the Ethereum/US dollar (ETH/USD) pair could take longer to form a bottom.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQSkdJZHV5clpmN0ZJbHNDWjNoWWFPdXA2aFhBbkU0T05Oc3E3NDJELUQ4WFBJTG1IV1dHWEc3Nll1Zzg4dUQ4R1ZiNlIwcGp1azlmMktEdjNjNEx0QkZPTFZ0R1FramR6bGFCY3NrU2g1RWctNllqa0NJdURTbXpYaVVSVFVMbU93QTRCQ2UyaUhIQjZJU0loUmZFaWVYdkZVMmhUTll5SXZNVFFDbjBfOHpwckhJWkJ3eFd0a2ZSeUtrWXAwY2M00gHMAUFVX3lxTE1HSUVWUy1aTEs1VlpZbzMzVlc4NXAxTXl2OThVTnNNWExtSlFIX3gwbVFhc2g1SkdqWkNDWDRsdkMzVXRaaFB5Z2swa2JqMlpnejVXSmQwVS1xWVJmNG5GRXhWUDAtUWJGdC01eHotbjFJWVBWX2ZwWWZWSnQ0YjhlQW1IdFB3U2lMUGREX0lLdkV6YTRKaWZLV0VoUkRlZHp1MmhmNHhPeFRTcEQxZWZCMXNpWmVTakV4cENPa3k3bzVtbkZnNlFaVUwtRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Billionaire Mike Novogratz Says New ‘Market Events’ To Propel Bitcoin, Ethereum and Solana Higher - The Daily Hodl",
        "content": "Galaxy Digital CEO Mike Novogratz is predicting that new “market events” will propel Bitcoin (BTC) and other crypto assets to the next leg up.\n\nIn Galaxy Digital’s Q1 earnings call, the billionaire says that a break out for Bitcoin, Solana (SOL), Ethereum (ETH) and other digital assets could still be a few months away, following a period of sideways trading.\n\nHe says Bitcoin could trade in a range of $55,000 and $75,000 until the upcoming US presidential election in November provides clarity on crypto regulations or the Federal Reserve cuts interest rates, which he believes could send crypto higher.\n\n“Listen, we had a lot of tailwinds in Q4 and Q1 – the adoption of the [Bitcoin exchange-traded funds] by far the biggest. That was the giant wake-up call that this is now an institutional asset. We also had the halving that we’ve now put in the rearview mirror. There was also a view that the Fed would bring rates down significantly this year and that view has changed. It’s changed in the market; it’s changed here in Galaxy and so I think we’re at a consolidation phase in crypto.\n\nBitcoin, Ethereum and everything else, Solana, will consolidate. What does that mean? It means [Bitcoin trades] probably somewhere between $55,000 and $75,000 until the next set of circumstances, the next set of market events brings us higher…\n\nI think that’s probably where we are certainly for this quarter, maybe next quarter until either (a) the Fed starts cutting rates because the economy finally slows or (b) we get through the election and I think the election will bring clarity, one way or the other, to the crypto regulatory landscape.”\n\nBitcoin is trading for $65,884 at time of writing, up nearly 7% in the last 24 hours. Meanwhile, Ethereum is trading for $3,019 at time of writing, up 4.4% on the day and Solana is trading for $155 at time of writing, up 8.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPaFQzUHZjVlJsdmo1X25SejJnQk5XSWtmSTBZeVNDZXpJbkhpTkJwMk9CTFlkVzlGZEJPWlE3VmN0QUVxMzJQcG1TMnhMbnBGYXNnWllnSkxIRXgzUjEtSi1veEgyYjAycnVqQjh6Q0FQd2Etb051aTNTc05PMWVEWtIBhgFBVV95cUxNSGxTRVZjLTJCMXdESWloTV9XTmp4VFVHLXlyQVV3el8yWXliUXhYU1RzN0N6VUhCRTgtQVB2SVVYOXE3WHlFTnBvX2tJRXVWcEVwUlZ3bkc2UG9PYTZqbHZrdDMxRmtmQ0I1Q3JQblFWaHJFTjd0a1F3WFVTZFBsVVBNYUNndw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Major Metric Signals Huge Rebound, Says Analyst - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) is on the brink of a substantial recovery, as indicated by prominent crypto analyst Ali Martinez. The analyst’s recent tweet has sent ripples across the digital asset sphere, highlighting a crucial technical indicator that suggests ETH's potential for a notable price upswing.\n\nAdvertisement\n\nRenowned for his keen observations within the crypto market, Martinez took to X to explain that the TD Sequential of ETH has revealed a buy signal on the daily chart. He noted that this crucial signal indicates the potential for the Ethereum price to experience a rebound spanning one to four candlesticks.\n\nThe TD Sequential presents a buy signal on the #Ethereum daily chart! It anticipates that $ETH could see a rebound of one to four candlesticks. pic.twitter.com/Vg7FTl9X2a — Ali (@ali_charts) May 15, 2024\n\nThis observation comes at a pivotal moment for Ethereum, which has witnessed a tumultuous period characterized by fluctuating prices and market uncertainty. At the time of reporting, ETH’s current price stands at $2,910, marking a marginal decline of 0.01% over the last 24 hours.\n\nAdvertisement\n\nHowever, zooming out to a broader perspective reveals a more significant downtrend, with Ethereum plummeting by 10.80% over the past 30 days. This downward price trajectory of ETH has left investors and enthusiasts alike on edge, eagerly awaiting signs of a price reversal.\n\nHope for community\n\nMartinez's assertion provides a glimmer of hope for Ethereum proponents , suggesting that the cryptocurrency may be poised for a resurgence. The TD Sequential indicator, a technical analysis tool utilized to identify potential trend reversals, has historically proven to be a reliable metric within the crypto space.\n\nWith its recent alignment in favor of ETH, anticipation for a bullish reversal has intensified among traders and investors. Despite the recent bearish sentiment surrounding Ethereum, the prospect of a rebound underscores the resilience of the digital asset and its underlying blockchain network .\n\nIn the end, Ethereum's journey toward price recovery appears to be gaining traction, with signals of a potential rebound emanating from key technical indicators. As the crypto community braces for what lies ahead, the resilience and adaptability of Ethereum stand as testaments to its enduring relevance in the digital economy."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPa3NxbTBWd3ZOSlhNSDg4R2ZreTJCYTg4RXFFMVl5RkhjLUhrbHkwOGI2RVF0NTBKb296RzJxU0g3bW1LRXh6cFR5MzBmWG1BM2xRZ0hFSWFzaEhPZlVsY3NsMnVKdjBWMFR2M28xUmN0dElxN3B3djgzR1ZGSFl4U1FRSWY0U05wYTVjajhKNNIBlAFBVV95cUxOZUFBbHNLQzlBLW1IUFQzLXA2ZlRSYVBEb3NxT19GTjhtSFRDMTB1WlVHUGREdWM3UC1PeDdsOUZ4NVRzVWxPVHFXWkdBQ2NldTYyQ2twNVR5S2FHRkZPd2JXMGxuUnVUUENCenBiLVl5TjdHVjU3Wlp5eXFyRGtkYmQ3Ml9QQjd0NWRVWFl1RFExc3Vr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 08:42:39 GMT",
        "title": "Solana (SOL) Beats Ethereum for First Time in History, But There's a Catch - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nOn May 12, Solana generated more Total Economic Value (TEV) than Ethereum in a single day. This marks the first time Solana has outpaced Ethereum in its history, but there is always a catch.\n\nBreaking down the data\n\nAccording to Blockworks Research, Solana generated $2,248,681 in TEV on May 12, surpassing Ethereum's $1,977,416. TEV combines transaction fees and miner/extractor value (MEV). TEV is often used to analyze the utility and adoption of a blockchain network.\n\nFor the first time ever on May 12, Solana generated more Total Economic Value than Ethereum in a single day pic.twitter.com/nrCe7pMNjb — Dan Smith (@smyyguy) May 14, 2024\n\nChris Burniske, the former Ark Invest analyst, commented on the whole thing, stating that we should keep an eye on L1s that are keeping up their annual expansion in the form of TEV. Higher TEV can indicate greater usage and demand, which can, in turn, provide more flexibility in the economic policies of the network.\n\nAdvertisement\n\nThere's a problem\n\nHowever, the achievement has sparked some debate between Solana and Ethereum users. Critics argue that comparing Solana's TEV with Ethereum's without considering layer-2 (L2) solutions is misleading. L2 solutions are built on top of Ethereum to enhance scalability and reduce fees, effectively offloading some of the activity from the main Ethereum blockchain (L1), while remaining a crucial part of it. As one commentator pointed out, \"Since some ETH activity has moved to L2s, wouldn't we include that? Come on Chris, this is just disingenuous if you don’t take L2s into account.\"\n\nDespite the criticism, comparing TEV across blockchains remains valuable. As Burniske explained, each L2 operates in its own blockspace environment, and TEV comparisons are typically made on an L1-to-L1 basis. However, some may disagree with such an approach and consider L2s an inseparable part of larger ecosystems like Ethereum, which has struggled due to high fees in the past. For now, Ethereum fees sometimes drop even below Tron's."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPakFzOEhEU2g2REMtc1dzQkdMRnN3MTcyUjdPNE43ZXZ5b1JjckhFdnN4QmNLUHNXS0N6WW8taFkxVV9rTTc2Z0VLR2VMYUNSV01YbW13b2IwRHZOZlRJU1QxRFRaS3lLQjF4M2djNkFYNTQyVGJIbTVoRDJuSlg3RkFTclQtVGNTZGl6QVlKUHZxOGQ0b3g3ZUNrS3RZWktLN0Vzdi0zVFhuSENzR3QyUk9KWTJ3T0twSDZibTdVempib1NlX3lfTUlXZkJtT18yaURNd2p30gHbAUFVX3lxTE9RR0JCelQ5b2xtWGVqS1Vtd2hkNnh6REFReXZlUHdjcElDcnQ0Sll0c0VYenpTWVVOTzF5WVNVeVp1NmFKSkFSbERUdXIxTHZlMUlhOVRSTVFyOHJWZkVtZTd4eHhidFM0QlJPUWxoaGszaFd5d2FHN21paElITjQyUkkyczZ2aFRDWHQzNkRtSWJqaUxIR1VXSVlQbktYSWNxU2tSeG1WejB5TzV6TzMwSGFTNk1seHhibk5zTHBJbElLSU4yY0pxUF9qcFR1WnkzWjF6aUtma2FHSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says Ethereum Competitor To Rip Higher, Predicts Outlook on Dogecoin and One More ETH Rival - The Daily Hodl",
        "content": "A closely followed crypto analyst predicts one Ethereum (ETH) competitor is about to have a massive breakout against Bitcoin (BTC).\n\nPseudonymous trader Kaleo tells his 638,000 followers on the social media platform X that the smart contract platform Avalanche (AVAX) could soar against BTC by more than 84% from its current value.\n\n“AVAX/BTC: I might be crazy bros, but I still believe AVAX rips higher from here.”\n\nLooking at his chart, the analyst suggests that AVAX/BTC is printing a bullish flag pattern on the daily chart and could soon reach 0.000950 BTC ($62.13).\n\nAVAX/BTC is trading for .000515 BTC ($33.89) at time of writing, down more than 3% in the last 24 hours.\n\nNext, the analyst predicts ETH competitor Solana is about to soar against Bitcoin (SOL/BTC) after printing a bullish pattern on the daily chart of higher high prices and higher low prices.\n\nHe believes SOL/BTC could soon cross the 0.0032 BTC ($209) level.\n\n“SOL/BTC: Solana is still one of the biggest no brainer long plays out there. Don’t fight strength.”\n\nSOL/BTC is trading for 0.00243 BTC ($160) at time of writing, up more than 3% in the last 24 hours.\n\nLastly, the analyst predicts that Dogecoin (DOGE) will breakout based on a 2021 pattern when the memecoin rallied after the soaring meme stock GameStop (GME) hit a market top. GME had a massive rally this week but has since retraced.\n\n“I’m going to make this simple for you. Here’s a chart of Dogecoin versus GME. You may not remember this, but it was GameStop that led the way back in early 2021. It wasn’t until after it topped that DOGE started sending. Dogecoin is overdue for a good pump. It’s almost time.”\n\nDOGE is trading for $0.15 at time of writing, up slightly in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/your/dTosh"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQUVFpbVducFFJaFptSDJIVmFjcGwzMTNFamJsNTY3cWtGeGVyMkl1V29VYmtBcmVKZDg0U0FIdklRYlV2MmNCN0VDTWg0V3NUaTNySGZuNVFwLWs4ZUFoU1R1OXJYNV9yanlhOUxiNUlkUFBHMWQ4NHJTc0tPZVMwTEdUcGs1bFl3UVdQS0J5VU4wWi0zaEtvcnBtVVU3YnZPMXBKU3NLdVgwUlYyalhkNlNCcmJtTDRueVBldFI0VVJ4RUdIYkY1UTFKOU01Sjk3NGVTNjJCYXEyOUhNbHNuUdIB5gFBVV95cUxNMGd6cmVaMkhZU0d4LVVqSF9yQ0NjSU10UEd2RXI5dC12OW1mM2Q3V2NVTXRJUWowazlCLTY3bVFnaFRIUmxkb3pEZThFQ1lCd0ZXaVRmUXI5Y2xCanlkNVVGYU9ZemEyaXVXZjZ6cVJCc21XWW5lUW5LNkpzckxVa1B1b0JzdTBjckU4ZW9aSERObXRjczlNRExNbXFPQ1dwcm1KbzdDcGV2b0YtbnludXdLbHRhOUdTaTZhYUFEa3U2bUdKT0Y1LUdCM0YyT0I4UFdyZWNGSWF6U0Z6ZVR1dUEyYU9adw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "$25 million stolen in 12 seconds: MIT graduates pull off crypto heist in Ethereum blockchain scheme | Today News - Mint",
        "content": "The Federal prosecutors in Manhattan on Wednesday arrested two brothers who studied at the Massachusetts Institute of Technology, alleging they carried out a cutting-edge scheme to steal $25 million worth of cryptocurrency and exploit the Ethereum blockchain’s integrity, reported the New York Post.\n\nAccording to the report, the federal prosecutor identified the accused as Anton Peraire-Bueno, 24, and James Peraire-Bueno, 28. They cited that this was the first time that a fraud like this had ever been the subject of US criminal charges.\n\nStating that the Peraire-Bueno brothers executed their elaborate heist in April 2023, the federal officers say they stole $25 million from traders in just 12 seconds after fraudulently gaining access to pending transactions and then altering the movement of cryptocurrency.\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,” New York Post quoted US Attorney Damian Williams as saying.\n\nThe authorities have charged the Peraire-Bueno brothers with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering.\n\nThe report also mentioned that Anton was arrested in Boston, while James was held in New York.\n\nThe Peraire-Bueno brothers attended MIT in Cambridge, Massachusetts, where they studied computer science and math. Prosecutors claim they used their skills and education to commit fraud.\n\nThe prosecutors claimed that both plotted for months to manipulate and tamper with the protocols used to validate transactions for inclusion on the Ethereum blockchain.\n\nIn addition, the prosecutors said that the Peraire-Bueno brothers exploited a vulnerability in the code of software called MEV-boost, used by most Ethereum network 'validators'. These validators check whether new transactions are valid before they are added to the blockchain."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNWFVEellZU1RPekZFR05tYjl5VzBvQlp0V3dxZmZLNGstbkdWcTJla0w2RFJqRHNoUlVIbDJUcUdQU1hEbjlsaVJjZEZzelA2UFFkRVgycjUyc2pDU2VtWFNTeGVlZEthTTdydU9uQlZiMDRCYnVwZHhFb3lJaGZ6TjliSkZKOW0tRDItU1Vkd2NkQ2R0MEJ6c2stczlZNV9wTXNIRGI1alEtbEJTSUloYTBfYUVhZjhOS1ZqTGduY2xJelN6VW5xNVVTQ05yekphQ2NieDBjaml5d9IB3wFBVV95cUxONEtKMV93QkZMUnNyWkp2WFlTTHRnMkJXeUN3bVpucXZMYzZqSGpqcGtwX2lyZ2c3Sl9XUkxndUdwNDB5Z19VdmpiVm1scVQzWVZ3R1A3Sjh3MER2NlZpOFVXRWNKcDFXaUpsNWhKVFA3RU5yMTJzVzJMVXhFQVBZY3FyMVRGZ21NVlI2b1o4QVBoS0FjdDFTby1KNndRYVRGbnBSdmtlMllKbVA5YUlDazBnc1RXZHF1TkU5SXN2S2ttbmdVV1JFTVJVS1R2WWdxVWZxNDdXZHlSV0xLNWdV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum, Solana and One More ETH-Rival Will Benefit From Rise of Artificial Intelligence: Real Vision Analyst - The Daily Hodl",
        "content": "Real Vision analyst Jamie Coutts believes Bitcoin (BTC) and a certain breed of altcoins will be beneficiaries of artificial intelligence’s (AI) rise to prominence.\n\nThe former Bloomberg analyst tells his 16,200 followers on the social media platform X that AI will need a money system, and that BTC may be the best available form.\n\nHowever, Coutts says that stablecoins and the native tokens of smart contract platforms, such as Ethereum (ETH), Solana (SOL), and NEAR, are also well-suited.\n\n“AI needs a money.\n\nBitcoin is the best form factor, but it won’t be the only one. Stablecoins and native tokens for smart contract platforms will also see widespread use.\n\nSOL ETH NEAR.”\n\nCoutts recently said that artificial intelligence (AI) technology could send the total market cap of the layer-1 crypto sector soaring from the current $1.9 trillion valuation to as high as $25 trillion by 2030.\n\nThe analyst shares an excerpt from his firm’s Pro-Crypto November 2023 report that suggests AI will increase the demand for on-chain verification and authentication services.\n\nThe report also says that human-directed or autonomous AI agents could make use of smart contract platforms to exchange value, significantly increasing the growth rate.\n\n“By incorporating an ‘AI growth factor’ starting in 2026, which adds 10% to the annual growth rate, we can begin to gauge this impact. Initially, the effect is modest, but by 2030, AI agents could comprise over 40% of total daily active users (DAU). This obviously creates some rather astronomical valuations for the blockchain assets, which will benefit from the transaction fees generated by an increasing number of AI agents.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/studiostoks"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNU1VaTG1hZ1hhaV9RNk9GX29KdEpsM1FLTG9OZ0c2WHRlckEyaHlHbUp3c20zRVp4WmNKX3VjN0NwVFRGVXhvcFZURXExRVNpVXNyUWVuRVlacVg1cHNULWZ1c3J4REt4MkdtMU5UWFAtR2NGT3Z5VURLdERreUFsSkpOaGdEbkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes New Gas Model for Ethereum Transaction Call Data - Yahoo Finance",
        "content": "Vitalik Buterin Proposes New Gas Model for Ethereum Transaction Call Data\n\nVitalik Buterin, the co-founder of Ethereum, has introduced a new Ethereum Improvement Protocol (EIP-7706) that focuses on a revised gas model for transaction call data. Currently, Ethereum-based transactions incur gas fees for transaction execution and storage. However, Buterin's proposal suggests the inclusion of a third type of gas fee exclusively for call data, which refers to the essential information transmitted to smart contracts during Ethereum transactions.\n\nThe intention behind this modification is to allocate a separate charge specifically for the data transferred in transactions, distinct from the costs associated with executing contract code or storing data. The new gas model would introduce a transaction type that offers max_basefee and priority_fee as a vector, providing values for execution gas, blob gas, and call data gas.\n\nPresently, the Ethereum network employs distinct mechanisms to adjust the base fee for transaction execution costs and data storage in blobs. Buterin recommends a unified approach for all three types of gas fees, suggesting that a common method should be adopted for their management.\n\nThe proposed change aims to address the issue of high transaction costs associated with data-heavy transactions that do not necessarily involve significant computational intensity. If accepted, the Ethereum network would independently set the costs for call data, separate from other expenses."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNVnNxMV90d1AwTjZnMi1qWjFZZjVCTWQ3M01pSFdhemxFTVRYWEl4NXlRRFVVS1NQMU0zUVZMZWNDbWdKLXJCdzh0c0EzeHMwUW16LVBQREJRazFTM3ZvaEVCRUhxSERTVTVYSVVMdk1KVUtGZm4tc2tkTlpJMzh4RHZHREo1bmcwRzYxZXVEVmZPM0tSWFNUZ2t2SWpoRFNPYXFz0gGoAUFVX3lxTE9tXzF6WTIyTHhLTzU0S2lEWExhb1V4MlVJRmdzVXJVQ1A1RV8zWUtLTS12QTVZdWlCc3dIMlVvOTNocWZSTWhqVmxOVmtpclh4UkJDdFlfdHlmY1l4Y2M2Ql96anEzQlNienFfQWt5cFE2RG5MWlM5ODRKTE5CNEdCbmg0TGtFNWc5RXNUSHpFcXkzQURNNjhBaFpVMVo3Q3pBcHRyLWlZXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Brothers indicted over $25 million Ethereum cryptocurrency theft: DOJ - FOX 10 News Phoenix",
        "content": "Two men have been indicted for their alleged role in a scheme that resulted in the theft of cryptocurrency worth $25 million.\n\nIn a statement, officials with the U.S. Attorney's Office said the indictments for 24-year-old Anton Peraire-Bueno of Boston and 28-year-old James Peraire-Bueno were unsealed on May 15. The brothers were arrested on May 14.\n\n\"The charges in the indictment arise from an alleged novel scheme by the defendants to exploit the very integrity of the Ethereum blockchain to fraudulently obtain approximately $25 million worth of cryptocurrency within approximately 12 seconds,\" read a portion of the statement.\n\nA visual representation of digital cryptocurrency Ethereum (Photo by Jonathan Raa/NurPhoto via Getty Images)\n\nDepartment of Justice officials say the two, who studied computer science and math \"at one of the most prestigious universities in the world,\" are accused of plotting for months before executing the heist.\n\n\"These brothers allegedly committed a first-of-its-kind manipulation of the Ethereum blockchain by fraudulently gaining access to pending transactions, altering the movement of the electronic currency, and ultimately stealing $25 million in cryptocurrency from their victims,\" investigators wrote. \"After the exploit, the defendants transferred the stolen cryptocurrency through a series of transactions designed to conceal the source and ownership of the stolen funds.\"\n\nThe two are accused of conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. If convicted, both could face up to 20 years in prison for each count."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQa1hoVmJnVXNfZGNUVno3bXEwSW5ndjJmT0dnYXV5YkItWHVnZkhnb2lUU3dmdkJxNTNlOGk0MWZRM0NmT1ZfS1FiVWkydW5fOGVydUVlSkM0c0pfSDE2ejNkWXFuQTFRT2pKWEF0dnRwYkpDbHQzcUkwbDExLV9ObGlRNjLSAYwBQVVfeXFMTms3UXg2RlRpaUwwRHRhN09rbFhrM3ZGRTFxUlZYU2NWMVhIa0diMDJZdWdYLXd0U1o5TkxRQlFhSDJrdnpOWTBMQkFzdnFZSGh0VDlqYUpIcVhBUzF2aXN3emllcmxJaF81YzFaRnA4TDlIbVEtc0ZmUEpaQlpWSHdHaDg0NkJJYzkyWEg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Why Did DeGods Leave Solana for Ethereum? 'I Was Just Being a Pussy', Says Founder - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a candid tweet Thursday, DeGods and y00ts NFT project founder Rohun Vora (aka Frank DeGods) took a critical look at his previous decisions, especially those made during tumultuous times for the well-known collections. His reflection sheds light on the pressures of community expectations and being a founder.\n\n“I used to try to move mountains to appease the community in times of chaos,\" he began. \"Every single time it's backfired.\"\n\nThroughout the years as the leader of DeGods, he has made many decisions to try and please his holders and keep the buzz going. For example, the team went through many art changes, including a planned upgrade and self-proclaimed art “downgrade.” On Thursday, the team said that it would make no further art changes to DeGods.\n\nBut the biggest and most controversial move was bridging DeGods NFTs from Solana to Ethereum last year, along with y00ts from Solana to Ethereum sidechain network Polygon—though they then moved y00ts to the Ethereum mainnet and returned a $3 million grant from Polygon Labs.\n\nAD\n\nAD\n\ni used to try to move mountains to appease the community in times of chaos. every single time it's backfired. the truth is, on the internet you either stand by your conviction or you're a pussy. i've been a pussy in the past. like the bridge off SOL. everyone in the community… — Frank (33.3%) (@frankdegods) May 16, 2024\n\nMaking the decision to bridge the projects off of the Solana blockchain happened as the community was in a state of panic following the collapse of crypto exchange FTX in November 2022, which preceded Solana’s price collapsing to a low of about $8—roughly 97% from its 2021 peak.\n\nFrank, feeling the pressure, made the call to move the projects to the Ethereum ecosystem, which houses the most valuable NFT projects. He framed the move at the time as one designed to elevate DeGods into the big leagues of NFT culture.\n\n\"Like the bridge off SOL,” Frank wrote. “Everyone in the community was panicking (myself included) during FTX. I tried to fix their anxiety. In reality, I was just being a pussy.\"\n\nAD\n\nAD\n\nFrank contrasted his past actions with his current mindset, emphasizing the importance of standing by your convictions.\n\n\"The truth is, on the internet you either stand by your convictions or you're a pussy,\" he tweeted. Frank stressed that succumbing to short-term pressures and seeking immediate approval often backfires. It’s a lesson he learned by leading one of the most prominent NFT projects, and one that has faced considerable challenges—many self-inflicted, as he admitted.\n\nFrank recently announced the launch of an optional bridge back to Solana for both DeGods and y00ts. This move allows the community to decide whether to stay on Ethereum or return to Solana, reflecting his desire to provide flexibility and choice. There are no strong-armed incentives this time around. It's just an option.\n\n\"I said I want to allow our community to come back home and I meant it. I still do,” he wrote, though they launched the latest bridge with decidedly less fanfare than the original.\n\nDecrypt reached out to Frank for additional comment, but did not receive an immediate response.\n\nFrank’s tweet offers a raw and honest look at the challenges of leading an NFT project amid the constant demands of holders, particularly amid a diminished market for such assets. The bridge back to Solana and increasing openness about the past appear to be moves to atone for lingering regrets, all while the projects attempt to move forward.\n\nyou can now bridge your DeGods & y00ts between solana & ethereum. pic.twitter.com/EXCIwcvbY5 — de (@delabsxyz) May 1, 2024\n\nAD\n\nAD\n\nLooking forward, Frank expressed his belief in building a robust and resilient community, rather than one that constantly seeks validation through reactive measures.\n\n\"I believe that antifragility is the answer,” he wrote. “That's my conviction. Not just building the best community, but the strongest one.\"\n\nEdited by Andrew Hayward"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQY0ZYTVhqdk1Rbm02WFpTTlNsSGNsZWNmY0dlelREaWkxY2tLSXBOZUViUU5wblFOb2MteTA1c0kxZEVfbUFNNURLUE1oZzlYd2F5bC1ka3J2b1BMUUp2X3Y5ZzFhamp3ZmlNLUh6anJBeTdSdkJraGZ3aW9BRjhFek1OWnA0WklaUm44ZTNzNmZ1a0dWSzhGZl9xNWN4MTlLV2lNc29HNU9OQVNSN2MwVlBwRE53Zmdsem1DMTNfWmhRdmNMVzZJZFNsaXJBZEVMMGRmZ2ZYQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Undergoes Technical Correction: Market Adjusts After Recent Increase - TradingView",
        "content": "Ethereum price tested the $3,040 zone and corrected gains. ETH is now testing the $2,925 support and might aim for a fresh increase.\n\nEthereum started a downside correction after the bears defended $3,040.\n\nThe price is trading below $2,960 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bearish trend line forming with resistance at $2,965 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh increase unless there is a close below the $2,925 support.\n\nEthereum Price Dips Again\n\nEthereum price started a fresh increase above the $2,950 and $2,960 levels, like Bitcoin. ETH even cleared the $3,000 level before the bears appeared near $3,040.\n\nA new weekly high was formed at $3,039 and the price recently started a downside correction. There was a move below the $3,000 level. Ether dipped below the 50% Fib retracement level of the upward move from the $2,860 swing low to the $3,039 high.\n\nEthereum is now trading below $2,960 and the 100-hourly Simple Moving Average. However, the bulls are active near the $2,925 support and the 61.8% Fib retracement level of the upward move from the $2,860 swing low to the $3,039 high.\n\nImmediate resistance is near the $2,960 level. There is also a connecting bearish trend line forming with resistance at $2,965 on the hourly chart of ETH/USD.\n\nNewsBTC\n\nThe first major resistance is near the $3,000 level. An upside break above the $3,000 resistance might send the price higher. The next key resistance sits at $3,050, above which the price might gain traction and rise toward the $3,150 level. If there is a clear move above the $3,150 level, the price might rise and test the $3,220 resistance. Any more gains could send Ether toward the $3,350 resistance zone.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $2,965 resistance and the trend line, it could continue to move down. Initial support on the downside is near the $2,925 level.\n\nThe next major support is near the $2,900 zone. A clear move below the $2,900 support might push the price toward $2,850. Any more losses might send the price toward the $2,740 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,925\n\nMajor Resistance Level – $2,965"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE0tbzVndVYyVFNZSGd5d1p2eWRDT05uOEpacTYyc0JacmVNd0dQdy1rVE80cXVxamtrcW9KSTJ0MWxKRW12Z3gwdUhWemp6Sm5zRWZQS0dyUkVUWlNoMjJ6WVl4WkE5WWfSAWxBVV95cUxNa1hpekxnRkNaQXE2SXNhY3MwQk8xX1NReVRzajJaUjc3RDd2aUlRMUZKcFdaM05JU2ctWWJoaGFTeDBoYUtNZ3RzOFFxM1MtTmJmczAwelJlTEoxczNNMVJyNlRfUm5yb28wY0c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for May 16 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA further market decline can be postponed, according to CoinMarketCap.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe price of Ethereum (ETH) has risen by 0.83% since yesterday.\n\nImage by TradingView\n\nDespite today's growth, the rate of ETH is looking bearish on the hourly chart. If the daily bar closes below the local support level of $2,973, bears may again seize the initiative, which can lead to a drop to the $2,900 zone.\n\nImage by TradingView\n\nBulls could not keep the rise going after yesterday's bullish closure. If the situation does not change by the end of the day, there is a chance to see a test of the support of $2,852 until the end of the week.\n\nImage by TradingView\n\nFrom the midterm point of view, none of the sides is dominating as the price is far from the main levels.\n\nHowever, if buyers lose the $2,900 zone, the accumulated energy might be enough for a breakout, followed by a move to the $2,600-$2,700 range.\n\nEthereum is trading at $2,957 at press time."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObEp4VkhKdFJ3VWtvbnF0dkYzOUhiSmlVOThESTZxSk5ab01lZXZUZ25idkpvbk1jczY5MnM5dG9LMlhSLTdUM0k0eF82eXo4TE1rS3g2aVMxSVJtRDdqMnNPLWJSZ1RTaXp6cXVpOGZsakR1aU1CYnFYQmdGZi1PcGVVdEhFazl4dTByc0hySWV4VGhLZ2VF0gGcAUFVX3lxTFA2VkR5bnlMM3F4MW9DWEVXOFFXZHZRTWNSRkZOQmN6MG1TZ2R6a0EydDhpUVhkai1VUHJlMW9NY2lXUjluRGo4aUFqaTBLVHFzY0tHTl9rUEtPdWM1VDl3eWppRXBOc1dLQkdWLUpLdzUyUGFqN2JyREN5V2NkbkdCSmRCRUlzTG5iTGhBRTJRSXdqUFd5VlVJWFJJZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH): Can Buyers Bounce Back From This Range Low? - Blockhead",
        "content": "Ethereum (ETH) buyers held the price floor at the $2.9k support level, as selling pressure continued to persist. Over the past month, ETH has traded between a broad price range with $3.2k serving as the range high and $2.9k serving as the range low.\n\nWith ETH trading just above the $2.9k support level, it has presented buyers with an opportunity to leverage the price zone for a possible reversal.\n\nPrice Range Offers Long Opportunity\n\nETH’s latest price rejection came at the range high of $3.2k on May 6. This brought another wave of selling pressure that saw the altcoin retest the range low of $2.9k. However, it also presented an opportunity for buyers to rally.\n\nETH/USDT on TradingView (4H Timeframe)\n\nAnalyzing the previous price action in the trading range showed that ETH had successfully achieved bullish rebounds thrice from the support level. This makes it a solid price zone for buyers with the tendency for a repeat of the price movement.\n\nA look at the chart indicators indicated bullish movement. Capital inflows rose to +0.08 as indicated by the Chaikin Money Flow (CMF). Yet, the selling pressure kept the Relative Strength Index (RSI) under the neutral 50 mark. Bulls will need the RSI to flip bullish for a sustained upward rally.\n\nBuyers can consider entries at the current market price of $2.9k with a target zone of $3.1k to $3.2k. However, a bearish candle close below the $2.9k support level would invalidate the bullish thesis and interested buyers would have to consider the $2.7k support level for new entries.\n\nETH Long/Short Ratio | Coinglass\n\nTraders in the futures market leaned slightly bullish on the higher timeframes which could serve as encouragement for spot traders. However, the tight margins mean the trades could easily swing either way and open long positions should be managed properly to avoid getting caught out by sharp price drops.\n\nDisclaimer: This article does not constitute trading, investment, financial, or other types of advice. It is solely the writer’s opinion. Please conduct your due diligence before making any trading or investment decisions."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNWURhU0xaa05pWEhBU3RKOXc1S01rR0tITnQzQmxwYmhVN241V3FQNTR0TlZKRHBKdUdiZ3dJOUhIaG1yMjlqeXdzS2lHeGI0cmN4bm9kU1V3RkdrU0ktWlFYT0kwZlpZNS1LckYzbGhURzJSaUFuWlNqZ3gyRnhtVzJxSzV1a2NYdjNTdmhyaFV4enE1VWxN0gGcAUFVX3lxTE9IVW5jeTFmUFVrUmdnRElDYldWaGgzalhxV1VJbVpmbDF0Q1VORTlhenp6SGNBTWI5RlMyNFJVZS11ODRvYl9FTUhiaF9rSVhSUVFia1JZVEN3MURvTDhyckN5UFYzaUdVM1ZJcjk1cXJFaWh0VkVUaGEzU181Mjd2YjNVVHlaSmxybUhZdk5mTGFnUElFdVBIS0J2Sw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Top 4 Ethereum Meme Coins to Buy in 2024 for $100,000 Profit Potential - CoinGape",
        "content": "This week has been notably bullish for the cryptocurrency market as the Bitcoin price showed a notable rally from $60000 to $67000. Amid a sudden change in market dynamics the meme sector often shows a major move due to their inherent volatile nature and susceptible to speculating trading. The opportunity seekers can consider Ethereum based meme coins to buy such as Shiba Inu Coin (SHIB), Pepe (PEPE), Floki (FLOKI), and MOG Coin (MOG) projecting the potential of substantial growth.\n\nThe Meme coin frenzy is abuzz in the crypto space, with Solana-based and Ethereum-based meme coins leading the charge. Ethereum’s popularity in the meme coin sector stems from several factors. It has a vast user base, ensuring extensive reach and adoption. Additionally, Ethereum’s integration with DeFi applications offers added utility to meme coins.\n\nadvertisement\n\nDespite Solana’s growing presence, Ethereum’s established network and extensive ecosystem continue to dominate the meme coin landscape, making it the go-to platform for these digital assets.\n\n1. Meme Coins To Buy – Shiba Inu Coin (SHIB)\n\nShiba Inu Coin (SHIB) continues its impressive rise in decentralized finance, marked by a robust 12% value surge. Known as the second meme coin, SHIB has shown a 7% increase over the past week, signaling a bullish trend.\n\nCurrently priced at $0.00002447, SHIB is poised for further growth and maintains its upward momentum. It holds the 11th spot on CoinMarketCap, boasting a market cap of $14.42 billion.\n\nThis ascent is driven by several factors, including heightened trading activity, strategic token burns, and the rise of other meme coins like BONK, BOME, and WIF. Additionally, the rollout of Shibarium plays a significant role in SHIB’s appeal.\n\nThese elements collectively make Shiba Inu an attractive prospect for potential investors aiming for substantial returns.\n\n2. Pepe (PEPE)\n\nPepe (PEPE), an Ethereum-based cryptocurrency, is also gaining significant attention. With a current market cap of $4.04 billion, Pepe coin has secured the 24th position in market rankings. The Pepe price stands at $0.000009691, experiencing a remarkable 482% surge over the past year. This performance marks PEPE as the leading meme coin on CoinMarketCap.\n\nOver the past week, PEPE has seen a significant 20% rise, solidifying its status as a key player in the altcoin market. Its recent value surge following a bullish breakout positions PEPE as a prime option for investors looking to capitalize on the altcoin season in the 2024 bull run.\n\n3. Floki (FLOKI)\n\nFloki (FLOKI), initially known as a meme coin, has now made significant strides in the Web3 space. Incorporating aspects of the Metaverse, decentralized finance (DeFi), and non-fungible tokens (NFTs), it has earned the nickname “The People’s Crypto.” Floki’s blend of meme appeal and real-world utility sets it apart in the cryptocurrency sector.\n\nAccessible on both the Binance Smart Chain and Ethereum, Floki is available as BEP-20 and ERC-20 tokens, respectively. FLOKI recently experienced a notable surge following the approval of a major token burn proposal by the FLOKI DAO.\n\nThis development, along with recent major listings and exchange integrations, has sparked optimism within the FLOKI community, suggesting a potential continued rise.\n\nCurrently, the Floki price is $0.0002007, showing an 11% decrease in the last 24 hours. Despite this, it saw a significant 15% increase over the past week. The crypto community is watching closely, anticipating further gains in the 2024 bull run.\n\n4. MOG Coin (MOG)\n\nMOG Coin (MOG) is also making waves in the cryptocurrency world with its unique meme-driven approach. MOG Coin price value now stands at $0.0…06229, marking a 0.10% increase in the last 24 hours.\n\nSince the start of the year, MOG has skyrocketed by an impressive 3753%, positioning itself as a top affordable meme cryptocurrency for potentially massive gains in the 2024 bullish market.\n\nBottom Line\n\nEthereum meme coins like Shiba Inu, Pepe, Floki, and MOG are poised for impressive returns in the 2024 bull run. With the market’s upward trend, these coins present promising opportunities for investors looking to capitalize on the growth of the crypto market.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNeHdqUENyTVZCcFBBdHBldXRUcmVtMUNDOTJYODgxRUJQUVUwQTVzcnZZTDhvblRCbnhtdzR6Uy1wUDgxczZweV8wbElMTnRlRktmUGtRN1Vtd2RTQld1V01TZ0R6b1lWWmZSdnlvY3Brb2VLOVZjaVJBbEdoUGc1bTZGMGtIMXhXNGpPRkQ2LWE5Ykp3TFHSAZsBQVVfeXFMTjZxTTBpQjBtZXlhaHQ0NVNrWmtDd1hNWUw3UHA0UVBJeXNaQjBXbHhuQlhYem9DMlExTFoyRDQzT2lnaFVKU0QwZHFOV0YwaUVNNHdSTGxvRU1jVEtRaWVQN1dmWWgtaEh6dEtvWWxWRWNOdHRQRnFWZTRDTGhweDRoTmJnUi1sZlFmTlpZeVN3SlByLXBsNnc4NFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs see declining interest: What does it mean for the future? - AMBCrypto News",
        "content": "Declining on-chain volume in ETH indicates waning interest ahead of ETF verdict.\n\nA financial institution predicted a delay for Ethereum ETF, but not an outright rejection.\n\nSome major events are due to happen before the end of May. But if there is one that the crypto community places at the top, it is the U.S. SEC’s decision on the numerous Ethereum [ETH] ETF applications.\n\nETF stands for Exchange Traded Funds. Unlike normal cryptocurrencies like ETH, an Ethereum ETF would only expose investors to the altcoin, not that they would own it directly.\n\nBut whether this would come to pass remains a big debate subject. For some, the SEC has no other option than to approve it, since it gave Bitcoin ETFs the green light.\n\nA stumbling block appears\n\nHowever, others believe that recent developments indicate that the regulator does not share that view. One notable figure that could hinder the Ethereum ETF approval is Gary Gensler.\n\nFor some time, Gensler who is the SEC chair, has publicly stated his dislike for the crypto ecosystem. Recently, the SEC served Well Notices to some firms, including Consensys.\n\nA Wells Notice is a formal notice from the SEC written to let a recipient know that the agency is planning to bring enforcement actions against them.\n\nConsensys is a blockchain software company developed to become an Ethereum knowledge center. Since the firm has links with Ethereum, it could be possible that the SEC says a big no to the applications.\n\nHowever, J.P. Morgan had a contradicting thought to this. While the firm said it does not expect an approval this month, it noted that it won’t be an outright rejection. It explained that,\n\n“Markets do not expect an approval by this month as implied by the significant discount to NAV by the Grayscale Ethereum Trust ETHE.”\n\nThe SEC faces a deadline between the 23rd and 24th of May to decide. However, it seemed that the broader market was skeptical of good news coming out of the development.\n\nInterest in ETH falls\n\nThis was evident in the series of outflows from Ethereum investment products which AMBCrypto reported. In terms of the volume, we also assessed the on-chain volume.\n\nAs of this writing, the volume was 11.17 billion. This was a significant decrease from the peak in March. Declining volume in ETH is a sign that market participants are losing interest in the altcoin.\n\nIf the SEC approves the Ethereum ETF, the price of ETH might also be affected. At press time, ETH’s price was $2,910. A go-ahead could send the cryptocurrency as high as $3,500.\n\nBut if this is not the case, the potential decline to $2,700 might come to pass. However, eyes would be on two major applications, which are from VanEck and ARK.\n\nApplicants are closing the loopholes\n\nPreviously, ARK and 21 shares, who have a joint application, included staking in their Ethereum ETF filing. But in an amended submission on the 10th of May, they changed it.\n\nThe firms had hoped that staking would be included and added it as a feature in February. The rationale for the inclusion was that ETH could have served as part of the company’s income.\n\nBut the fact that the SEC still has issues with labeling the cryptocurrency a security or not, left them with no option to be on the safe side. However, this does not imply that the Ethereum ETF would get a nod.\n\nIn the meantime, J.P. Morgan also commented on the possibility of a delay.\n\nAccording to the financial institution, a denial could cause a lawsuit, like the way Grayscale took the regulator to court before the Bitcoin ETFs were approved.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThis is because Grayscale had also applied to convert its Ethereum Trust to an ETF. The viewpoint read,\n\n“The template is likely to be similar to bitcoin: with futures-based Ethereum ETFs already approved, the SEC ( if it denies the approval of spot Ethereum ETFs) is likely to face a legal challenge and eventually lose”\n\nDespite the anticipated verdict, the number of ETH holders has been increasing. According to Santiment, the total amount of participants holding ETH was over 12o million."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOakl2T2N5V0VPN21UdHdoX05BSU5PLXV4MWs5RDZnaDZGMTBwbVotM1FkckMzVEFLMURoZVJNdXVSZ1BKUWFsWklBSUQzVnFxbDRfYS1aLXNqbHBJRnNBcnMyZmJHWFlkWGJFbS1oc18ydk81Z0lfWUpsT0EtemhaVm5FaF8zNGQwOENZTmxfc9IBlAFBVV95cUxQNUNQR1plZ3lYVDVJeDVlekVaLVFxS3NfNEExQ2FMakxEMldvZlJTZzc5R0Z6M25JME5JRGIweEsxenlkNnFrczgzT1VXZzg2TERoM0dGWUxxS3EyZWdoTFZUamE0eGFHUTQ5QWRyRXJUcU5wdk9MTk9zWEEyUk8ySklya2hZX1hqeU9yeDZlMnJNNThQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF chances ‘slim to none’ as SEC considers ETH ‘security’ - AMBCrypto News",
        "content": "SEC could reject spot ETH ETF application based on ‘security’ status.\n\nMixed feelings on possible SEC’s rejection grounds as ETH price dropped.\n\nThe US SEC (Securities and Exchange Commission) has been quiet on the status of Ethereum [ETH] and whether it will approve the spot ETH ETF filings.\n\nHowever, a recent development indicates that the agency could reject the ETF applications and raise ETH’s security status issue.\n\nReacting to a recent SEC’s notice on spot ETF filings, Bloomberg ETF analyst James Seyffart doubled his odds of the agency’s rejection of the applications. Seyffart commented,\n\n“Looks like odds just went up for SEC to deny Ethereum ETFs by claiming #Ethereum is a security. Not a guarantee that they will do this, but I think this almost guarantees that the SEC is at least considering it.”\n\nMixed feelings about possible Ethereum ETF rejection\n\nThe overall market has been expecting a rejection of ETH ETF applications in May. The above development could shed some light on the possible grounds for the agency’s move.\n\nHowever, Nate Geraci of ETF Store wasn’t convinced the agency had a sound ground for rejecting the spot ETF applications.\n\nCiting the recent removal of staking features and existing ETH futures amongst others, Geraci wondered,\n\n“If SEC denies spot eth ETFs, what will rationale be…Lack of correlation b/w spot & futures market? Then why approve eth futures ETFs. ETH = security? Then why approve eth futures ETFs. Staking? Issuers have (reluctantly) removed. I don’t see path for legal disapproval here.”\n\nLast week, ARK and 21 Shares removed staking features on their spot ETH ETF application. Some market watchers read the update as a possible approval by the SEC.\n\nThe sentiment was quickly reflected by the uptick in the chance of May ETH ETF approval on the prediction market, Polymarket.\n\nApproval chances jumped from 9% on the 10th of May (ARK’s update) to 16% on the 13th of May.\n\nHowever, the revelation of SEC’s possible ETF rejection and raising of ETH’s ‘security’ status saw the approval chance drop to 13% on Polymarket at the time of writing.\n\nSeyffart’s colleague, Eric Balchunas, also echoed his sentiment. Reacting to SEC’s spot ETF notice, Balchunas said,\n\n“TLDR: the SEC asked commenters re the Eth spot ETFs whether these filers have properly filed their ETF listing proposals as commodities. This shows the SEC is perhaps considering to ETH is a security in their denial. Our odds of approval remain the same: slim to none.”\n\nArk Invest and 21 Shares ETH ETF applications are due for the SEC’s decision next week, the 24th of May. The decision on the Hashdex application will be on the 30th of May.\n\nHowever, pessimistic views on the SEC’s spot ETF approval have dragged ETH’s price down.\n\nThe king of altcoins has been in a price downtrend since mid-March – a bearish market structure that could push ETH to $2500 or lower."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPazNCeE1jLVhmNTNwenlPc2NwOWV5dktxSGV6X3Fob2ZiLTA5S1pCVzFlSEVUSldGSi04UDdGWWhoQUEwcjl2TVJmb0tmY1hCdU5sLW05bUE4UDUwaG5UTkJzUXBMOWg1ZFpSS3c2WU9MUC1lZFkzVzZYa2RIUEJoOUd1eFhkSEp4bDM2MmJjZGpFRTBtS3JnOU1aQVU0QTBtMHBFZFVCdW51a1g1ek9oWmkwaU94bFpCNDdSdTlyTktpbDNjQXFaMWNLS2MzV3VQc3lFNEtRRWUtRVZmV2VvdtIB5gFBVV95cUxNUWlIWU92eVlSSVdrU283RWR0YnpfcHl3NFpOaE1uaVJBeUtnTFdTZ1dmR0tOdUNMQmZBbGNoREF4ZDE4bmM4M2dVR3B5Wjdva1JTX3owNHdfWUhQTGxKd1RKV2pubE4tR0l5M0VCVnBUVFpTaUxHdTlHUXdlbzdLd3pBb2ZGWmgxdVFiVXU1dFo3YTd2VFlFcUpuTzYtRkc3N3VadXI5Q0d6UjJxNlNpUWNNVU0zNm9KMHJSQmlNS2c5clpKX3pJNmV4c3B2bXN3ajFvUWRlbnh4S2I3WjVXOTdQcnMtQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins rescued as BTC acts on CPI data - FXStreet",
        "content": "Bitcoin price could achieve a market structure change toward further upside if BTC holds stable above $65,500.\n\nEthereum defends $2,900, but 26% upside potential will only be activated after breaching $3,212.\n\nRipple price’s RSI must record a stable higher high above mean level of 50 for XRP to become attractive.\n\nBitcoin (BTC) price rescued altcoins on Wednesday following US inflation data, which was measured by determining change in the Consumer Price Index (CPI). Like the core CPI, the CPI came in cooler than previous months at 3.4%.\n\n❖ U.S CPI (MOM) (APR) ACTUAL: 0.3% VS 0.4% PREVIOUS; EST 0.4%\n\n\n\n❖ U.S CPI (YOY) (APR) ACTUAL: 3.4% VS 3.5% PREVIOUS; EST 3.4%\n\n\n\n❖ U.S CORE CPI (MOM) (APR) ACTUAL: 0.3% VS 0.4% PREVIOUS; EST 0.3%\n\n\n\n❖ U.S CORE CPI (YOY) (APR) ACTUAL: 3.6% VS 3.8% PREVIOUS; EST 3.6% — *Walter Bloomberg (@DeItaone) May 15, 2024\n\nMarkets like this so far with yields falling as well as the US Dollar (USD). Cryptocurrency assets moved higher, which means the data release was a much-needed catalyst.\n\nAlso Read: Bitcoin price restores early May highs as US CPI surprises to downside\n\nBitcoin price is a fraction away from market structure change\n\nBitcoin price is trading with a bullish bias, gliding along an ascending trendline with higher highs. After a sequence of lower highs, BTC could change the market structure if it manages a stable close above the $65,500 resistance level.\n\nThis is likely, provided BTC holders keep their profit appetite in check and buyer momentum increases. The higher lows on the Relative Strength Index (RSI) show a growing bullish trend. Traders looking to enter long positions for BTC may consider waiting for a higher reading on the RSI.\n\nA stable close above $65,500 on the one-day time frame would encourage more buy orders, with the ensuing buying pressure sending Bitcoin price to $70,000. Beyond this level, BTC would have a chance at taking back the $73,777 peak. Notably, the DXY Compare indicator is also dropping, which has often displayed a countercurrent flow against BTC price.\n\nBTC/USDT 1-day chart\n\nConversely, if traders book profits for the Wednesday god candle, Bitcoin price could drop. A slip below $63,354 would spook panic sellers like it did on two recent occasions, May 9 and 13, where BTC was rejected from the aforementioned level.\n\nIn a dire case, Bitcoin price could descend below the ascending trendline and ultimately fall below the $60,630 support level. Below this level, BTC could roll over to $58,000, or worse, $56,552, levels last tested on May 1.\n\nAlso Read: Will GameStop stock resurgence have downstream effect on BTC and alts?\n\n$3,212 level is critical for Ethereum price’s upside potential\n\nEthereum price is attempting to reclaim ground above the ascending trendline after a slip below on Tuesday. The governing chart pattern is a falling wedge, which is a bullish reversal technical formation. For the 26% target objective to be realized, however, ETH must manage a candlestick close above $3,212.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased seller momentum could see Ethereum price drop. If the slump extends to close below $2,781, it would invalidate the bullish thesis.\n\nNotably, the RSI continues to chop sideways with equal lows as it remains subdued below the mean level of 50. This shows the bears still have the upper hand.\n\nAlso Read: Ethereum faces key resistance in attempt at short-term bull run, Solana flips ETH Mainnet in terms of revenue\n\nXRP bulls sitting on their hands\n\nRipple price remains range-bound as XRP bulls continue to sit on their hands. This is seen with the RSI stuck below the mean level of 50 since April 11. If the RSI records a higher high within the upper segment of the range, Ripple price could extend the climb.\n\nIn the meantime, Ripple price is likely to consolidate along the 50% Fibonacci placeholder of $0.4952, with the horizontal chop likely to continue.\n\nXRP/USDT 1-day chart\n\nConversely, enhanced profit-booking could see Ripple price wipe out the ground covered, slipping below $0.4952. In a dire case, XRP price could extend the fall to $0.4500, or worse, extend a leg down to $0.4188, levels last tested on April 13.\n\nAlso Read: XRP holds gains as attorneys debate relevance of discounts offered to Ripple’s institutional clients"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE9VZ29JbmFnZUxvSkxRVU9oOU9GS3VmanRwTWs3UEIzbW4yOERBRnlfMGtDVEZrVnBsTTFDNHQ5LWNJbkwwcERlRW9lS1d5Q0xsZkZiMjlXdTJVTmt3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "What is Mantle Network (MNT): exploring Ethereum's first modular Layer-2 solution - OKX",
        "content": "Mantle Network is a pioneering modular Layer-2 solution designed to help scale the Ethereum network efficiently, handling more transactions faster than before. The tool achieves this by bundling transactions together using Optimistic Rollup technology, reducing gas fees and speeding up transaction times.\n\nIt's understandable why the Mantle Network and its technology has gained plenty of interest, with scalability a hot topic among crypto commentators. By providing a fast and cost-effective solution, Mantle Network aims to make decentralized applications (DApps) more accessible and user-friendly for all on Ethereum.\n\nCould it be a catalyst that unlocks more of Ethereum’s potential? Read on as we explore Mantle Network and its functionality, the advantages it brings to the space, the role of the project's MNT token, and more.\n\nTL;DR\n\nMantle Network's unique modular design improves performance and handles Ethereum's blockchain trilemma by separating execution, consensus, settlement, and storage.\n\nMantle Network uses Optimistic Rollup tech to speed up Ethereum transactions and reduce gas fees.\n\nInitially called BitDAO, Mantle is now backed by Bybit. This provides financial support and EVM compatibility for seamless Ethereum contract integration.\n\nMantle Network aims to lower fees and boost speeds to make DApps more user-friendly and accessible by increasing scalability.\n\nThe project's native token, MNT, plays an important part in the network's security and efficiency, and supports community governance.\n\nWhat is Mantle Network?\n\nMantle Network is an advanced Layer-2 solution for Ethereum. It uses Optimistic Rollup technology to increase transaction speeds and lower gas fees. Transactions are processed off-chain, but still settled on Ethereum to capitalize on the network's security.\n\nOriginally known as BitDAO, Mantle Network is backed by Bybit, a crypto exchange. This relationship not only provides the project with financial support but also helps attract a sizable user base, positioning Mantle Network as a strong contender in the Layer-2 ecosystem.\n\nMantle Network is built around a unique modular architecture. Unlike other blockchains, it separates execution, consensus, settlement, and storage into specialized modules. This modular design not only enhances scalability and performance but also maintains the network's compatibility with Ethereum Virtual Machine. As a result, existing Ethereum applications can migrate to Mantle Network with minimal modifications.\n\nMantle Network's Optimistic Rollup technology assumes transactions are valid and only checks for fraud if needed, improving efficiency. Meanwhile, the tool incorporates advanced data availability technologies like EigenLayer, which helps reduce the fragmentation of security on Ethereum and bolsters security for DApps using Ethereum-based modules. For Mantle Network users, this provides cheaper and more accessible data storage while inheriting Ethereum’s security.\n\nMantel Network's integration of governance and utility drives the ecosystem's economic model, providing network security, functionality, and the maintenance of a decentralized and efficient blockchain environment. As a consequence, the technology's unique features and strong support make it a promising contributor to Ethereum's future scalability.\n\nHow Mantle Network works, and its advantages\n\nMantle Network comprises a variety of advanced tools and technologies that combine at Layer-2 to boost Ethereum's scalability. Read on to understand the network's architecture and the advantages it brings.\n\nValidator nodes and transaction compression\n\nValidator nodes are essential to Mantle Network's operation, and they bundle user transactions into compressed blocks. This compression reduces the size of the associated data, reducing gas fees and increasing transaction throughput.\n\nOptimistic Rollup technology\n\nOptimistic Rollups assume transactions are valid by default and only verify them if there's a challenge. This allows Mantle Network to handle a greater volume of transactions quickly and at a lower cost. When a batch of transactions is processed, it's posted to the Ethereum mainnet as \"calldata,\" a cheaper storage method that makes sure the data is accessible without overloading the Ethereum network.\n\nIf a user suspects a transaction is invalid, they can submit a fraud proof. The Ethereum mainnet then checks the transaction to make sure it's valid. If the transaction is fraudulent, the validator's bond is slashed, providing a strong incentive for honest behavior.\n\nEthereum compatibility and a modular architecture\n\nMantle Network supports Ethereum contracts and tools by allowing developers to quickly move their DApps to the network with minimal steps.\n\nMeanwhile, the network's modular architecture enhances its overall efficiency by separating the execution, consensus, settlement, and data availability functions into distinct layers. This modular approach improves performance and addresses scalability, security, and decentralization challenges — often called the blockchain trilemma.\n\nData availability and security\n\nMantle Network uses EigenLayer's EigenDA to ensure accessible and secure transaction data. This advanced technique offers high throughput while protecting data integrity.\n\nWhat are the drawbacks of Mantle Network?\n\nWhile the functionality explored above brings a host of advantages to users of Mantle Network, there are some drawbacks to keep in mind.\n\nOptimistic Rollups can be complex\n\nOptimistic Rollups are complex. They assume transactions are valid, which can lead to delays if a transaction is challenged. This fraud-proofing process takes time, which can be a problem for applications that need immediate confirmation.\n\nCentralization risks exist\n\nOne concern is the risk of centralization, especially with the control of the sequencer in Optimistic Rollups. At first, the sequencer might be centralized, posing security and operational risks.\n\nAlthough Mantle Network plans to decentralize its sequencer to lower these risks, the transition process itself could still have weak points and cause a single point of failure.\n\nOver-dependence on Ethereum\n\nMantle Network relies on Ethereum for security, but this can be a double-edged sword. While it benefits from Ethereum's robust security, the network has also been affected by congestion and high gas prices on the mainnet. This can hurt Mantle Network's performance and cost-effectiveness during busy times on Ethereum.\n\nCompetition within the Layer-2 space\n\nAnother challenge for Mantle Network is the competition from other Layer-2 solutions such as Arbitrum, Optimism, and zkSync. To stay competitive, Mantle Network must keep innovating and growing its ecosystem. That requires a lot of resources and a constant commitment to development to stay ahead.\n\nDevelopers face a learning Curve\n\nThere's a learning curve with Mantle Network's modular architecture. Although the modular design offers flexibility, it also adds complexity. Developers might need extra time and resources to understand the network's components, potentially slowing down development and deployment.\n\nWhat's the role of the MNT token in Mantle Network?\n\nMNT is the native token of Mantle Network. It's held in the Mantle Treasury and can therefore be considered \"not in circulation\", according to the project website. Meanwhile, the Mantle Governance process manages token distribution.\n\nMNT plays a variety of roles in the network.\n\nGovernance: MNT token holders can vote on important network decisions, such as upgrades, funding, and other key matters. Each token equals one vote, protecting a community-driven and decentralized Mantle Network.\n\nTransaction fees: Mantle Network uses the MNT token to pay transaction fees. It helps keep the network running and gives the token a purpose.\n\nStaking: You can stake MNT tokens to help secure the Mantle Network. This means locking up your tokens to support network functions like validating transactions.\n\nSupporting ecosystem growth: MNT tokens fund ecosystem growth initiatives, including supporting new projects, grants, and other development activities that expand the Mantle Network ecosystem.\n\nWhat's next for Mantle Network?\n\nIn 2024 and beyond, the Mantle Network is expected to grow and develop in several key areas.\n\nMost notably, Mantle Network's technology will reportedly be enhanced, with a particular focus on its modular architecture. The network's modular design simplifies the process of making upgrades and scalability improvements by separating functions like execution, consensus, settlement, and data availability into distinct layers. As a result, hard forks are no longer needed.\n\nDecentralization is also expected to be an important focus for the project going forward. Governance and decentralization are already a priority for Mantle Network. As the first DAO-based Layer-2 solution, the project emphasizes decentralized governance. Token holders decide on protocol upgrades and fund allocations, making sure any changes align with community needs. Mantle Network plans to decentralize its sequencer, making the network more resilient, secure, and less prone to censorship.\n\nEnhancements to staking on the network are another area of development, particularly with the Mantle Liquidity Staking Protocol (LSP). With LSP, users can stake ETH for yield-bearing mETH, making the network more useful and offering further incentives to the community.\n\nWhat's more, Mantle Network is expected to form new strategic partnerships aimed at enhancing interoperability and expanding the ecosystem. These collaborations should connect Mantle Network with DeFi protocols and Web3 applications, strengthening its market position.\n\nThe final word\n\nEthereum's scalability challenges are well documented, and Mantle Network is another Layer-2 solution that aims to ease this limitation for users and developers. The tool uses Optimistic Rollup technology to speed up transactions and reduce gas fees on Ethereum, but its influence goes further still.\n\nMantle Network's modular architecture provides compatibility with existing Ethereum applications, while its Optimistic Rollup technology assumes transactions are valid and only checks for fraud if needed, improving efficiency further.\n\nAs the Ethereum network continues to evolve while facing competition from established and emerging projects, solutions such as Mantle Network provide a compelling reason to use and build on Ethereum."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOUkRzelkyZE10UWw3WGEyWTQ5Q3BKRXpyWWw0Y0pwWjBqRUVOQmR6UVhYejVEZ2E2dVh3YlJVMzJaR1prRFlTeFVHdzRVR3JLMlI2OERRbU5FRDF3bHhyTkx4dUpNb19DSFRlNHN4RUpkS3ZPVTlmWnpfY2ozSHZwbjlib0VRcmlvUWJJazBzUXDSAZYBQVVfeXFMUEZ1Y1NaY2xaYnVHOG9XenpsbWVRR1EyMGRSNGh6MWdpM1N1UEpqelI5RnNpOUJ3M2tFcm1uTzZ0MFJqU0hMbjZkZ01SV0pQWC03ekg1UWZ0Q3dMWWJCVEY1a2lSLTRLM1ZhVEUwWlIyTTlNenM5T0F4NDFhYlNhdWtTTGM3MjhuaTNyeHhHdFU5ellpNXdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum supply up by 100,000: What about ETH’s ‘deflationary status’? - AMBCrypto News",
        "content": "Ethereum loses ultrasound money status.\n\nTotal supply has increased by over 100,000.\n\nEthereum [ETH] has transitioned from being labeled “ultrasound money” due to the EIP-1559 upgrade, which has altered its deflationary characteristics.\n\nThis upgrade reduced Ethereum’s burn rate, leading to a slowdown in the rate at which Ether is removed from circulation.\n\nThe total supply of ETH has increased, and there has been a recent rise in the supply of ETH on exchanges. How does the supply on exchanges compare to the total supply?\n\nEthereum total supply and fees burnt display contrasting trends\n\nThe analysis of Ethereum’s supply metric on CryptoQuant reveals notable fluctuations in total supply dynamics over recent months.\n\nFrom November 2023 to early April 2024, there was a discernible decrease in ETH’s total supply, dropping from over 120.2 million to approximately 120.06 million, marking a reduction of over 100,000 Ether.\n\nHowever, beginning from the 19th of April, Ethereum’s total supply started to ascend, reaching around 120.1 million at the time of this analysis.\n\nThis recent increase in total supply is attributed to a decline in the fees burnt, which commenced following the Dencum upgrade.\n\nAn examination of the fees burnt metric illustrates a significant decrease, starting around March.\n\nDuring this period, fees burnt were approximately 6,000 Ether, contrasting sharply with the current value of around 890 ETH at the time of this analysis.\n\nThis significant reduction in fees burnt accounts for the observed uptick in Ethereum’s total supply, indicating a shift in its deflationary dynamics.\n\nAlso, the decline in fees burn is due to the decline in fees on the network.\n\nEthereum sees a decline in overall fees\n\nThe recent Ethereum upgrade has led to a reduction in transaction fees, both on the main network and its Layer 2 solutions.\n\nData from Coin98 Analytics indicated that Ethereum transaction fees has reached a yearly low, averaging 0.00017E, which translates to approximately $0.5 per transaction.\n\nThis fees marks a significant decrease compared to levels observed around February.\n\nFurthermore, analysis of the overall fees generated on the Ethereum network revealed a noticeable decline in recent times.\n\nAs of this writing, the total fees were around $3.6 million, contrasting sharply with the peak recorded in March, which stood at approximately $7.8 million.\n\nThis downward trend in fees commenced about a month ago.\n\nEthereum supply on exchanges climbs\n\nAnalysis of the Ethereum exchange supply indicates a notable upward trend, albeit with some interesting nuances.\n\nThe increase in exchange supply began before the total supply started to rise, with the growth, observed between March and press time, amounting to over 3 million Ether.\n\nAs of this writing, the total exchange supply was over 16.8 million.\n\nDespite this significant growth, the exchange supply remained relatively low compared to the total supply of Ethereum. This suggests that Ethereum is facing a manageable risk of oversupply.\n\nFurthermore, the proportionately low exchange supply indicates that the current price of Ethereum is not under immediate threat from inflationary pressures.\n\nETH continues to trend below $3,000\n\nAnalysis of the Ethereum price trend on the daily timeframe is reflecting a challenging period. Following its drop below the $3,000 price level in the previous week, ETH has struggled to regain its footing.\n\nAs of this writing, it was trading at around $2,900, experiencing a decline of approximately 1.5%.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nBoth the Stochastic indicator and the Relative Strength Index (RSI) were signaling a negative price trend. The RSI, in particular, indicated a bearish trend as it remained below the neutral line.\n\nHowever, the current position of these indicators suggested a potential price reversal in the near future, with ETH poised for a possible uptick."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPbEJQRTBXVkgxeFpzZEVPUndWakRad2RkdGZOTG5sNlFBWkxDMEdaZklLOGR5SWJfTlhVSURNeU9uVFRsRkpPdEdOX1F5dXVRV2tNY2ZwNktkN2lUQjFTdDN3SWVHNDBSSXNUQWFxU1pVdTFVWkpVVnBCNnYwa1hKYWFxVENYOHNTdEdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto: Bitcoin Rally Leaves Ethereum Far Behind! Why? - Cointribune EN",
        "content": "Thu 16 May 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe crypto markets experienced a bullish week, but Ethereum seems to be struggling to keep up with Bitcoin’s rapid pace. While the total market capitalization increased by 5.5%, ETH failed to fully capitalize on this bullish momentum.\n\nCrypto: Ethereum Struggles to Keep Up with the Bullish Trend\n\nETH closed above $3,000 more than five days ago and has underperformed BTC by 22% since the beginning of 2024. This trend highlights the difficulty Ethereum is facing in maintaining its value against Bitcoin. Additionally, U.S. macroeconomic data seems to support the rally of some rare assets.\n\nAs a result, the markets reacted positively to the Consumer Price Index (CPI) data, which showed a 3.4% year-on-year increase in April, in line with market expectations. Unfortunately, this indicator was not enough to boost Ethereum as it currently is with the queen of crypto.\n\nThe Growing Uncertainty Among Investors\n\nSome crypto analysts believe that the upcoming SEC decision on May 23, 2024, regarding VanEck’s request for a spot Ethereum ETF, is a key reason for Ethereum’s inability to break the $3,000 resistance level. The uncertainty surrounding this event is leading traders to delay their investment decisions until the outcome is more certain.\n\nHowever, despite long-term optimism regarding Ethereum’s prospects, a rejection by the SEC could lead to a short-term market correction. Eric Balchunas, Senior ETF Analyst at Bloomberg, has expressed doubts about the approval of an Ethereum ETF in 2024, given the regulator’s cautious approach toward products that could be classified as securities, particularly those that include native staking services.\n\nIn conclusion, while the crypto markets have had a positive week, Ethereum still needs to prove its ability to keep up with the market leader, Bitcoin, in this bullish race.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQdWVSNUVNdzBCdTJiai0weFhSV25yX1hKMFk1d2I5Ynlaal9VWHkxVHlzLUFzNlgzVDhILXF6UG1UZWFJQl8yQURGTWY1VXBfRTQ5eEQ3R1VKV1Bfb090UWNlZ2ZVUVQ4b2sya0k5M0lUMDhoTGsxOHA0dlNNaWJwNjdxZGhmeS1mY3NZbC1GYVBaT0haa29ibklKSHp6TWVBTm9hN2dpeDl2YVnSAbABQVVfeXFMTU42TXpiVnUyYXprWVZTN1lzT0xSdlZxdV9fd1NoMllnNWlKd2VEc0IwUDVydk9GVU53NVA0MUNwRTRvZklGQnBjV0NaTWg0MnpSYk5BcV9BVkJYVjdobkttalNvYzg3SjVfMVNsRlNKbDBUejFzTTFxTkhjamZmZ0dqUDM3eVZtMDZxM3BZS1FPbUNUaHJ0Y2F1UFBoQWp0QW9FWlFMZ25KbzhoWHRvbzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 16: Bitcoin Surpasses $65K, Ethereum Gains, Floki Grabs Spotlight - CoinGape",
        "content": "The top crypto prices today rallied after the cooking U.S. CPI data was released on Wednesday, May 15. The Bitcoin (BTC) price surged past the $65,000 mark. Moreover, the Ethereum (ETH price regained the $3,000 level. In addition, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also recorded significant gains.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price soared 6.38%, reaching $65,835.21 at the time of writing on Thursday, May 16. On the other hand, it’s trading volume spiked 59.83% to $41.96 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.29 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price rallied 3.69% to $3,009.62 at press time with a market valuation of $361.51 billion. Whilst, ETH saw its trading volume jumped 29.61%, reaching $15.57 billion.\n\n3. Solana Price\n\nThe Solana price rallied behind the $160 level, regaining the bullish momentum today. The Solana price climbed 13.33%, settling at $143.90. In addition, SOL witnessed a 70.42% hike in trade volume to $4.22 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price inched closer to the $0.52 mark again. The XRP price recorded a surge of 3.24%, reaching $0.5185. On the other hand, XRP’s trading volume shot up by 11.78% to $1.19 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price rallied 7.05% to $0.4595 today. Whilst, ADA recorded a hike of 37.57% in its 24-hour trading volume, settling at $400.18 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price soared 7.14% to $0.1565 while its rival, Shiba Inu price rocketed 8.73% and traded at $0.00002509.\n\nAlso Read: Tech-Savvy Investors Bet On 3 Altcoins To Buy In May For 50X Profit\n\nTop Crypto Gainers Today\n\nFloki (FLOKI): The Floki crypto price surged 10.77% and traded at $0.0002158.\n\nThe Floki crypto price surged 10.77% and traded at $0.0002158. Pepe Coin (PEPE): The PEPE price soared 6.10% to $0.00001141.\n\nThe PEPE price soared 6.10% to $0.00001141. Arweave (AR): The AR price rallied 4.90% to $41.22.\n\nThe AR price rallied 4.90% to $41.22. Wormhole (W): The Wormhole price rose 2.88% to $0.5436=\n\nTop Crypto Losers Today\n\nWorldcoin (WLD): The WLD price lost 9.30% to $4.79.\n\nThe WLD price lost 9.30% to $4.79. Ethena (ENA): The Ethena crypto price slumped 6.98% to $0.7021.\n\nThe Ethena crypto price slumped 6.98% to $0.7021. Celestia (TIA): The TIA price dipped 6.77% to $8.19.\n\nThe TIA price dipped 6.77% to $8.19. Dogwifhat (WIF): The WIF crypto price slipped 5.98% to $2.92.\n\nTHORChain (RUNE) and Bonk (BONK) also registered massive gains today. Meanwhile, the latest data from the U.S. Labor Department highlighted that the U.S. Consumer Price Index (CPI) surged by 0.3% in April, which was lower than the market estimation of 0.4%. Thereafter, the Bitcoin price climbed from $62,000 to over $65,000.\n\nAlso Read: Bitcoin Price: Will Softer CPI Send BTC To $70,000 In May?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPNU44ZW9BX29LX3I3WjVXTFRnaDNGOEZ1OUNUMDVrSHBUajBZR0JTX21SejE2Q24xMGw5Y3V1SWJLSGtyN1NVR2lqcG5RekNkTGJkS3dEM1dybGx3TXBlRWVJdHk1ZkhQYVF2SnBzaWNtQWNvamFSUHE5dUM0Y2UzcTVLUG1KN3PSAYwBQVVfeXFMUHlFeHBtYlV4bHJUdDJWRHdHcEJWMWVGWGp2NlJRTlBVaDU5U09XSExCQmRWRTJCeWFqVlU2emF2U0N4eU1EajFIdGlsZURfU05HZ2xDNFdTRER1QUw3dG5Xdl9nZ1NKcUJtbHFSNmdNMkVqUzF0emkxZnNUVUpDNVpNSlp1d0Y3cTNKVVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum’s 28% drop: What happens if ETH’s $2,850 support fails? - AMBCrypto News",
        "content": "ETH was trading at a significant support level.\n\nKey technical indicators hint at the possibility of a continued decline in ETH’s value.\n\nLeading altcoin Ethereum [ETH] is clinging to a crucial support level as its price trends within a descending channel.\n\nA descending channel is formed when an asset’s price continues to make lower highs and lower lows, indicating a broader downward trend.\n\nReadings from ETH’s price movements on a daily chart revealed the formation of this channel on 12 March. Since then, the coin’s value has declined by 28%.\n\nAccording to CoinMarketCap’s data, the altcoin exchanged hands at $2915 as of this writing.\n\nA break below or a break above?\n\nIf ETH bulls fail to defend the coin’s current support level of $2,850, its price might initiate a decline below the lower trendline of the descending channel.\n\nIf this happens, the altcoin will exchange hands at the $2600 level.\n\nAMBCrypto’s assessments of some key technical indicators hinted at the possibility of a break below the current support level.\n\nFor example, ETH’s key momentum indicators signaled that the coin’s sell-offs outpaced its accumulation among market participants.\n\nThe coin’s Relative Strength Index (RSI) and Money Flow Index (MFI) were positioned below their respective neutral spots at press time. ETH’s RSI was 39.52, while its MFI was 49.39.\n\nETH’s Elder-Ray Index returned a negative value, confirming the current bearish trend. This indicator measures the relationship between the strength of buyers and sellers in the market.\n\nWhen it returns a negative value, it means that bear power is dominant in the market.\n\nLikewise, the dots that make up ETH’s Parabolic SAR were spotted above its price at press time. These dots have been so positioned since the beginning of May.\n\nThe Parabolic SAR indicator is used to identify potential trend direction and reversals. When its dotted lines are placed above an asset’s price, the market is said to be in a decline.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIt indicates that the asset’s price has been falling and may continue.\n\nShould ETH bears force a break below the current support level, the coin’s next price point might be $2780. However, if this projection is invalidated, the altcoin might rally above $3000."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQNXFiWW9qUzhqRWdCcGZqbDc4WndLdVRYLXVmNlBlTnBrbllZX3RqWVo5WWYyQlp6OVNQb01CcHVUTzRWakl6a2hEWUNUV1VoQWVTZy1mUjQ5dFZlS0E4cXMtNGo2Sm0xcTlNc08xNi1VNzF6Qmg3SkFRZkpCdVViU2Z1Wnhqekk3Wi03Yk9PZEZMczZSQlpzR0I1V3nSAaIBQVVfeXFMTTJVd2plcDdJUkdnal9CRkJfYzV5Q2lTbk1aREctLWVGQkV0ZUU2LW1wTWd3UUhUOG9YcGd5RUMyT1FwQ1lRUmJmcU1kVWlWMUdwRTlKQmh4WlZOblpoZ0VfeTM1dTA0QU53QjU0amhQNktLMlBHMS1ONV80T3hya2FhNGlZazdOM29fbGxuZ3FCZlN4OEczcHpTNVJjNnYzenhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 15: Bitcoin & Ethereum Suffer Amid Market Decline As Pepe Coin Shines - CoinGape",
        "content": "The top crypto prices today registered a decline as the Bitcoin (BTC) price extended lower than the $62,000 mark. Moreover, the Ethereum (ETH price struggled to sustain above the $2,900 level. In addition, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also noted a significant drop.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price dropped 0.95%, reaching $61,909.06 at the time of writing on Wednesday, May 15. On the other hand, it’s trading volume slumped 5.31% to $26.27 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.21 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price dipped 1.12% to $2,905.97 at press time with a market valuation of $346.58 billion. Whilst, ETH saw its trading volume fell 1.14%, reaching $12.09 billion.\n\n3. Solana Price\n\nThe Solana price distanced from the $150 level amid the declines today. The Solana price slumped 2.68%, settling at $143.90. In contrast, SOL witnessed a 6.75% hike in trade volume to $2.47 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price inched closer to drop below the $0.50 mark again. The XRP price recorded a drop of 0.89%, reaching $0.502. On the other hand, XRP’s trading volume shot up by 25.49% to $1.06 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was down 1.81% to $0.4289 today. Whilst, ADA recorded a slump of 19.33% in its 24-hour trading volume, settling at $290.99 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price plunged 3.04% to $0.1464 while its rival, Shiba Inu price tumbled 2.20% and traded at $0.00002305.\n\nAlso Read: Render vs Theta; Which DePIN Altcoin to Buy In May\n\nTop Crypto Gainers Today\n\nPepe Coin (PEPE): The PEPE price soared 7.47% to $0.00001092.\n\nThe PEPE price soared 7.47% to $0.00001092. Arweave (AR): The AR price rallied 4.01% to $40.93.\n\nThe AR price rallied 4.01% to $40.93. Wormhole (W): The Wormhole price rose 3.22% to $0.354=\n\nThe Wormhole price rose 3.22% to $0.354= Floki (FLOKI): The Floki crypto price surged 1.22% and traded at $0.000196.\n\nTop Crypto Losers Today\n\nRender (RNDR): The RNDR price lost 8.54% to $10.12.\n\nThe RNDR price lost 8.54% to $10.12. Chainlink (LINK): The Chainlink crypto price slumped 4.09% to $12.90.\n\nThe Chainlink crypto price slumped 4.09% to $12.90. Near Protocol (NEAR): The RUNE price dipped 3.97% to $6.99.\n\nThe RUNE price dipped 3.97% to $6.99. Hedera (HBAR): The HBAR crypto price slipped 3.11% to $0.106.\n\nMonero (XMR), Sui (SUI), Injective (INJ) also made it to the top crypto losers list today. The decline in the crypto market could have been triggered by the hot PPI data released on Tuesday, May 14. The latest report highlighted that the U.S. PPI for last month, i e. April, surged by 0.5%, which is substantially higher than what the market estimated.\n\nAlso Read: Solana Price Analysis: Flag Pattern Suggests Imminent Breakout Rally to $200\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPZTYybVNhZnVxdXlRZjB5cUR5a0VCU3JDc2ktbEdsczZvazlyTjlFbmkxVmpiUnB6RnZPTDFEa1Z6MEN4Y2xxTXBTXzB1NjhoYXI5Z1ZKeHN1ODlwYUl6SGhqVDR2Zm9tcDJZTVc1SEgycGY5TksyUEx2X2tUV2RUUk81SnRZOVoyRFUzbTBn0gGTAUFVX3lxTE5iMDB1ZDhxRHkyY3lrMjQ2RDg5T2lhM2txREUtYWpjaXM5bmljWVVyaUoyVDA1V0N3RkY4N0ZGZTByellLVnl1aXhnN05samN4SjktUGVKeGhiUlFJT3VkV2JfZFkxcG5SODlsdFBZRWxZbHZfZFpRWEduNk5qRU1CeEZwdGtBZG1oWVN1R0l2SHU4MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum underperform as crypto market remains bearish - AMBCrypto News",
        "content": "Bearish sentiment dominated the crypto market.\n\nBTC and ETH led the bearish sentiment with their poor price trends.\n\nWhile holders of certain meme coins may be celebrating significant gains in recent days, the broader cryptocurrency market appears subdued.\n\nRecent data indicated an overall negative sentiment prevailing in the market, potentially paving the way for an uptrend in the near future.\n\nHowever, as of now, the market capitalization is on the decline, with major assets experiencing decreases in value over the past 24 hours.\n\nNegative sentiments dominate crypto market\n\nAMBCrypto’s analysis of the crypto market’s Weighted Sentiment, focusing on large-cap assets such as Bitcoin [BTC], Ethereum [ETH], and Binance BNB, revealed a prevailing negative sentiment at press time.\n\nThe Santiment chart illustrated a bearish sentiment across the market from the 8th to the 14th of May.\n\nSimilar patterns of universal bearishness were observed from the 10th to the 16th of April, as well as the 13th to the 19th of March.\n\nAt press time, Ripple exhibited the lowest Weighted Sentiment, with Bitcoin following closely as the second lowest.\n\nCrypto market capitalization declines\n\nAMBCrypto’s examination of the crypto market data on CoinMarketCap revealed a decline in market capitalization over the last 24 hours.\n\nThe market cap had decreased by over 1.3% to approximately $2.27 trillion at the time of this writing. Despite this decline, the volume has surged, showing an increase of over 27% to around $68 billion.\n\nFurthermore, the fear and greed index reflected a neutral sentiment, standing at 55 at press time. However, it appeared to be edging closer to fear.\n\nThis drop in market capitalization is attributed to the lackluster performance of major assets like Bitcoin and Ethereum in recent hours.\n\nBitcoin and Ethereum remain bearish despite increases\n\nAMBCrypto’s analysis of the Bitcoin price trend on a daily timeframe revealed a setback in its attempted rebound.\n\nThe decline was marked by an over 2% decline on the 14th of May, bringing its price back to the $61,000 zone.\n\nHowever, at the time of this writing, Bitcoin had recovered with an over 2% increase, trading above $62,000 once again.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nSimilarly, Ethereum experienced a decline of over 2% in the previous trading session, settling around $2,800. Nevertheless, it had rebounded by over 1% at the time of writing, trading at approximately $2,900.\n\nDespite these fluctuations, both assets remained in a bearish trend, contributing to the overall bearish sentiment in the crypto market."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPby1RbFZLQXZoV2d2Tm5jWFlzcFRQLTdRQzdNSVZHZGdFSXZ6aE5BeFh1UlhDSF95bjJaZTFOeVNtaTFvZkZqQ1BNcHVHeDVlMHNuY2w5VDdNcjlLRWN2blFUWDN1WDlMM3A5SUpVcmZsMTd4SVlMWlRURV9IRGx6TXlSWDNzMmNHOEFsUDVZOTFTa3VhZ2FhNEJlQVZGbjFteTFFdXJobWN4SFEycFJmSmR6ZzlnZHVuaWNXd3Rnb1FGYjVWQnB0ekxleWlMc3hKMVFnZGV6aGRaNXhQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "BlockDAG Illuminates Piccadilly Circus: Ethereum Price Soars While Fantom Faces Market Cap Shocks – What’s Next? - Techpoint Africa",
        "content": "Among the dynamic world of cryptocurrencies, BlockDAG emerges as a notable contender amidst the volatile Ethereum price predictions and Fantom's (FTM) declining market cap. Recently showcased at London’s Piccadilly Circus, BlockDAG has captured the attention of major investors and is quickly becoming a digital asset to watch.\n\nFantom (FTM) Continues Growth Despite Market Fluctuations\n\nDespite some setbacks, Fantom has impressively doubled its market cap to $2.6 billion. Although there has been a dip in token revenue, the platform's growth in USD and total value locked (TVL) demonstrates a solid base for expansion. Enhanced by reduced staking requirements, Fantom is bolstering its network security and decentralization, making it a compelling alternative to Ethereum due to its focus on scalability and low transaction fees.\n\nEthereum Faces Price Resistance\n\nAs a foundational platform for smart contracts, Ethereum is currently grappling with price resistance around the $3,000 threshold. A successful break above this level could signal an upward trend, however, projections currently indicate potential drops to $2,880 or even lower. This volatility poses risks for short-term investors but could represent an opportunity for those looking at the longer-term potential. Despite these challenges, Ethereum continues to be a central hub for developers and a key player in the decentralized applications landscape.\n\nBlockDAG: Innovating and Captivating the Crypto World\n\nBlockDAG is quickly gaining traction in the crypto community with its distinctive approach to mining and engaging its community. Highlighted by its vibrant display in Piccadilly Circus and an event at the Las Vegas Sphere, BlockDAG is on the radar of many crypto enthusiasts.\n\nThe upcoming launch of its X1 mobile mining app on June 1 is particularly exciting, promising to make mining accessible and efficient through a user-friendly platform. This app will enable smartphone users to mine BDAG coins without excessive battery or data use and will feature a leaderboard and referral system to foster a robust community ecosystem.\n\nBlockDAG: Poised to Be the Top Crypto Investment in 2024?\n\nWith the crypto landscape constantly evolving, new opportunities arise as established entities like Ethereum and Fantom navigate their own challenges. Amid this, BlockDAG stands out with its innovative solutions and community-focused initiatives.\n\nThe launch of the X1 app and its focus on making crypto mining accessible positions BlockDAG as an exciting new project that could lead the market. For investors searching for fresh and promising opportunities in the cryptocurrency sector, BlockDAG offers an appealing option, especially with its ongoing presale capturing significant investor interest.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQN2dBZWF5TFVBc0xOS3ZoVDNUSHFmWHZsQy01eXZ4dmZwaGpFZEJoZ1VqU1JzMU14dGl3MXZhTmoxalJ4R00tVHY4ekphbVVUTnpLdG9nZ0RuT2VMZWxwcVdlV3VJLWRUUFY3c0lWZDRjUHc4d09SS0NicnVGd1VaVDZZd0dyYzQtdW5wLUVESdIBlAFBVV95cUxNcUljUDNESEJOTHVZb3VZQWFFNjhtN0pIclVmck9JX0lZTXVoQ0E4QkJfRHNyM3J0bDA1bFlEQmFvOHc5ZDg5cmtjbWFuemlpdk5aOHVlTE9GZmZTOXQ2alhha2RMMjd5c0lGbHF1cDVFUExXT2VGRklWQjVpQmdORWtEYmlyRlF2eTJ0U1lwT21tNGEx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two Brothers Have Been Charged With Stealing $25 Million in Crypto in 12 Seconds - Robb Report",
        "content": "Legal issues just keep on mounting in the world of cryptocurrency.\n\nTwo brothers have been charged with wire fraud and money laundering related to $25 million in Ethereum that they stole in just 12 seconds, the BBC reported on Wednesday. Anton Peraire-Bueno and James Peraire-Bueno, both in their 20s, face more than 20 years in prison if found guilty.\n\n“The Peraire-Bueno brothers stole $25 million in Ethereum cryptocurrency through a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds,” Lisa Monaco, the U.S. deputy attorney general, said.\n\nThe Department of Justice noted that this is the first such crypto heist it has seen. The Peraire-Bueno brothers studied mathematics and computer science at the Massachusetts Institute of Technology, the BBC wrote, and prosecutors say they used the skills they learned there to exploit Ethereum’s system. They were apparently able to steal the millions of dollars in crypto by hacking into Ethereum traders’ pending transactions and rerouting the money to themselves. When a representative for the blockchain got in touch with them, they refused to return the money and then tried to launder and hide it.\n\n“The defendants’ scheme calls the very integrity of the blockchain into question,” Damian Williams, the U.S. attorney for the southern district of New York, said in a statement.\n\n“The Exploit,” as investigators have called the scheme, took place back in April 2023. It’s the first time this sort of fraud is resulting in criminal charges, the BBC noted. But that doesn’t mean it’s the first time crypto has become caught up in high-level legal proceedings.\n\nMost notably in the States, the disgraced FTX founder Sam Bankman-Fried was sentenced to 25 years in prison for stealing $8 billion from his customers. Over in Turkey, Faruk Fatih Özer, who created the failed Thodex exchange, was given an 11,196-year jail term. And the Binance founder Changpeng Zhao pleaded guilty to money-laundering charges and said he would pay a $50 million fine.\n\nAll those cases involved men who held positions of power in the crypto world, making this week’s case an outlier. The Peraire-Bueno brothers were able to infiltrate Ethereum from the outside and make a break for it with $25 million in their (digital) pockets. That money, though, will not have been theirs for very long."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNR3V5eG1IOWxBYUFTZmpkS3JmdlpneWFJanlzQnVRWWxZTG5fcWR5YmV5ZVhObmlZM19yVkh5SzZSdUNrM2IwTWFPYWxwSGFibGIyU0dNanFsc0pCVm5tVkhScy1EOEFMNnZGYkZ3R3pqZ1lMYV9ydlB1SFVFWXltLUp3MkE0Zk1sU2NBcWEtNHp4UldnQTYwSlRkUGNJekZtSFhqbl9zZHNZZVMtT2Y3bHBqQy1zZ1pzOXhpMWlpZFA2VDR2Y1M2ZWwwbUFkV3djcW5meXdSYUxCams?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "BlockDAG’s Dashboard Upgrade Enhances Transparency, Outshining Spot Ethereum ETFs And Render's Market Outlook - Techpoint Africa",
        "content": "While enthusiasm wanes for spot Ethereum ETFs due to underwhelming performance, and Render demonstrates potential for recovery despite a recent price dip, BlockDAG has made significant strides with a major upgrade to its dashboard. This enhancement bolsters transparency and equips users with advanced tools for analytics, propelling BlockDAG to the forefront of the cryptocurrency scene with an impressive $26.9 million in presales.\n\nDeclining Enthusiasm for Spot Ethereum ETFs\n\nInterest in spot Ethereum ETFs has dwindled as Ethereum continues to underperform relative to its peers. The cautious approach by the SEC, especially under the leadership of Gary Gensler, has resulted in delayed approvals for Ethereum ETF applications, contrasting with the earlier approvals for Bitcoin ETFs. The withdrawal of Grayscale’s ETH ETF application has further fueled skepticism, contributing to a pessimistic outlook for near-term approval. Ethereum's stagnant market activity has led to disinterest and uncertainty among investors, reflecting a broader sense of market apprehension.\n\nRender Shows Signs of Recovery Amid Market Fluctuations\n\nRender has recently seen a 4% decrease in its price but remains a subject of optimism as its trading volume has risen by 27%. Currently priced at $10.84, Render is expected to rebound from this minor slump, viewed by analysts as a normal market correction. Predictive technical indicators suggest a bullish trend, with Render potentially climbing to $12.21 and aiming to revisit its peak of $13.86.\n\nComprehensive Dashboard Upgrade and Mining Innovations by BlockDAG\n\nBlockDAG’s latest dashboard upgrade introduces a new dimension of user engagement and transparency. The dashboard provides detailed transaction insights, enabling investors to effectively track their investment activities. Features like 'My Transactions' display detailed histories in various currencies such as BTC, ETH, and USDT. The 'Live Transactions' functionality offers real-time purchase visibility and categorizes investments based on the USD amount, enhancing the competitive aspect with a leaderboard that highlights the top 30 investors.\n\nAdditionally, BlockDAG continues to innovate in the mining sector with the launch of the X10 miner from its X series. This device boasts a 100 MH/s hash rate, capable of mining up to 200 BDAG daily, anticipated to deliver substantial returns at the official launch price. The X10 utilizes ASIC technology for high efficiency and low noise, making it suitable for both beginners and experienced miners.\n\nBlockDAG’s Position as a Market Leader in Cryptocurrency\n\nAs BlockDAG commences its twelfth batch with a compelling price of $0.0075 per coin, it has effectively raised $26.9 million by selling more than 9.1 billion coins. This achievement highlights BlockDAG as a significant player in the cryptocurrency market. With uncertain futures for spot Ethereum ETFs and a recovering Render market, BlockDAG’s innovative dashboard and mining solutions establish new standards in market transparency and user engagement. These strategic advancements position BlockDAG not only as a pioneer in technological innovation but also as a lucrative option for investors seeking substantial tools and potential high returns in the evolving crypto market.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNQ1lwZEVvVlR3Wm5FVHFPMUtubVExaTJjX21LRnVZbXRPUFU2OG1aLUxwMTg4VXJ5VG01Q3huZnJXeVlEc1lPekxsbXBTNkxZNENET1pMb2E1bXhhWW5VZnhMbnYwRVZNX3ZjLVdWTzh2UWs3elNxWEtjUUpVWDFqZE5ZTjBtUGpJN1Q5SVRxMNIBnAFBVV95cUxNRFpTT0NqS3NBdmpsSEZwR3NhRFIxd0RkRzI0S0Nwck8ydDJscjFnNGFHanNINE4tT3pMemQ4MHdfNWRWaU50VmJHWVdCOWtZRUFjWEtRRzNuekM5cm1VQmxuR1c0VUlxUUZ5LXZhT2YzMzU1bkRUR2ZsYXhjRVpFY1pmYWRMWFlRWEJwOWU0ZU5hZGR6YkotY0FveXQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Continues to Dip - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOdDUwZVZ5bm96ZjEyeFNpNndaRlFZeVRsUDA2YUtxRjZnTlRBeHpUbWY3N3dHMUNfQkVxRGhsS0lpRHlnSmxoR1dFcTBHZDREcFUxUm9LYUktNU05UDNycjRvSVFhVlNla0VBdVR4V3lVVzd4LXQwODdjRnVoLUQ3ZGc2VTlRc1Jmck16OTYzX055dl9OeDg5clBuRnhKZGxHMUZWVUdB0gGrAUFVX3lxTE1LdDVZMnVuWnZLVkVyQnVjQXZ3d1FnWE1BRGpidlJkMUtGcjM4M0hLNnhBVDdqZTB2LUZCbGRXRlY5UlJ4a0xfOFNYVEMxNVFOU21zWGxMWHFtaEJaSm1FbWl3WlpzNWxXQ1pqTmUzUXpZdFp5eXdjcXBJRkVNdGVuSzFpUUJwWl9sTHdKdFc1bDZ2V0ZObDFuLXg0bHNzVkhTbmhXWFZza0xOaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum Breaks $3,000 Barrier as Coinbase & BlackRock Place Big Bets - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Ethereum's price is rising due to positive market sentiment, lower transaction fees, and growing institutional interest.\n\nCoinbase adopting Ethereum and the potential approval of an Ethereum ETF are seen as signs of confidence.\n\nEthereum's price could rise further if it breaks above $3,050 resistance, but it could also fall if it fails to do so.\n\nEthereum (ETH), the world’s second-largest cryptocurrency, is currently on a remarkable upswing, catching the eye of investors worldwide. This surge is fueled by a mix of positive market sentiment, encouraging CPI Inflation data, and ongoing developments in the cryptocurrency world.\n\nAs of now, ETH is valued at $3,004.66, marking a significant 3.63% increase in the past day alone. This surge has propelled its market cap to an impressive $357 billion.\n\nKey Developments For Ethereum\n\nBehind Ethereum’s surge are several key developments. Notably, Coinbase, a major fintech player, has chosen Ethereum as its go-to network for on-chain products and services. This move signals strong confidence in Ethereum’s abilities and is likely to attract more users to Ethereum, boosting demand for Ether (ETH) tokens and driving prices higher.\n\nCoinbase, one of the most disruptive and influential fintech companies in the world, is using $ETH as their primary network for on-chain products and services.\n\n\n\nBlackRock, the largest asset manager globally, has an $ETH spot ETF pending approval and has recently issued a USD… — AdrianoFeria.eth 🦇🔊 🛡️ (@AdrianoFeria) May 15, 2024\n\nMoreover, BlackRock, the world’s largest asset manager, is on the verge of approving an Ethereum spot ETF. This move has sparked institutional interest, potentially leading to significant investment flows into Ethereum.\n\nLayer-2 Expansion\n\nAdditionally, Ethereum’s layer-2 networks are expanding rapidly, bringing down transaction costs and improving scalability. This makes Ethereum more attractive for various applications, from decentralized finance (DeFi) to non-fungible tokens (NFTs).\n\nETH Technicals Remain Strong\n\nFrom a technical standpoint, Ethereum has shown resilience amidst market volatility. Recent bullish momentum pushed the price above key resistance levels at $2,950 and $3,000, reaching a new weekly high at $3,039.\n\nWhat’s Next for Ethereum?\n\nLooking ahead, breaking above the $3,050 resistance could lead to further price gains, targeting levels around $3,220. On the flip side, failing to breach this barrier might trigger a downward correction, with support levels around $2,930 and $2,900.\n\nBullish or bearish on Ethereum? Join the discussion.\n\nAlso Check Out: Ethereum Price Prediction 2024, 2025: Will ETH Price Cross The $5000 This Year?"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1BbDhuVXdIT096eDJoR2pKbmxzbHdvckRPb0JpWWVqbm9DLU1HeHE4cXVTVFR2XzlqWm55YTltdVAxTHY0OUw5MUZhSVB5VDdhZUdGdjlDbDYtTnFBNmZqWUcxS0V2ZG1aSUdrV0FIakJyRTlJ0gF6QVVfeXFMTjZnOW9YZnJrWTJWNUpUY1BITWFvMzFwV2F6MUJNSm5oamFBc05yQzF3NTV2N2pMZlRSWV9RX0g3UUZXQ01LWmhudHV4YW1PaWxOTV94TTJJQS1BeTkxUk1WTjBkUHB3SDRLd3BMM1M1MEtuTFJYand6QVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 17:02:28 GMT",
        "title": "Ethereum Bull Flag Breakout: ATH On The Horizon As Major Metrics Turn Bullish - NewsBTC",
        "content": "Crypto analyst Javon Marks has highlighted several metrics that have turned bullish for Ethereum (ETH). The analyst noted that one of these metrics suggests an all-time high (ATH) for the second-largest crypto token.\n\nBullish Metrics For Ethereum\n\nMarks remarked in an X (formerly Twitter) post that the bull flag-like price structure has formed on the Ethereum chart. He added that higher lows are forming in Ethereum’s price action, which is also a bullish signal as it suggests a strong resistance to downward trends. Meanwhile, the analyst claims lower lows in the Relative Strength Index (RSI) indicate a hidden bullish divergence with Ethereum’s price.\n\nRelated Reading\n\nMarks then raised the possibility of Ethereum hitting a new ATH, stating that the “bull flag breakout might lead into new all-time highs and be of major service in many Altcoin progressions.” Before then, he claimed that Ethereum could soon experience a larger price breakout, making the crypto token experience a 63% upside to $4,811.\n\nCrypto analyst Michaël van de Poppe also recently suggested that Ethereum could make a major move soon enough and lead altcoins to make new highs. According to him, this will be triggered by the news surrounding the Ethereum ETF, as he expects that to be the “rotation for the Altcoins.”\n\nHowever, Ethereum also risks experiencing a significant decline, considering reports that the Securities and Exchange Commission (SEC) might reject the Ethereum ETF applications. Crypto analyst James Van Straten stated that a rejection of the Spot ETF “sends the ETHBTC ratio lower 0.047 to 0.03 as a long-term projection.”\n\nThis was one of the reasons why the analyst stated that “Ethereum looks like it’s going to the grave.” He also alluded to the fact that ETH has become inflationary with the Decun upgrade reducing transaction fees, which has ultimately reduced ETH’s burn rate.\n\nThings Aren’t Looking Good For ETH\n\nCrypto analyst Derek recently mentioned that “Ethereum dominance and recent performance are heading toward their worst ever.” He noted that attention has turned to Bitcoin due to the reports about a potential rejection of the Ethereum ETF and securities status, which has put pressure on investment sentiment. According to him, this has caused the “imbalance in dominance” to reach its worst point.\n\nRelated Reading\n\nThis Crypto Expert Called The Bitcoin Top in 2021, Now He’s Calling The Bottom In 2024 4 months ago\n\nDerek further noted that Ethereum’s unimpressive price action is affecting other altcoins, as their prices are “depressed.” He also claimed that the prices of layer two coins “continued to be under pressure.” The analyst suggested that things could get worse, as the ETH/BTC chart shows a downward wedge pattern in progress. He claims that altcoins can only “breathe” if Ethereum can escape this pattern quickly.\n\nAt the time of writing, Ethereum is trading at around $2906, down in the last 24 hours according to data from CoinMarketCap.\n\nFeatured image from Metaverse Post, chart from Tradingview.com"
    }
]