[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQNkZGcWZMQko0d21wa2ZHYk1HU2dIY210cUhXWC1FU09hTTVqTVlNdWp1WnRFQzNkR3lXa3BKUHUwUmtFVlFhanMtQXVuNlotMW56aGptTnJyaHRvOUQ0eWZqM2VaU0NRQjVnUFMyMzJ5cnlvdVdPcWVDd3BLQkhRNFZQQVNaRUFaS29nWER4UlJqeF84ZDNZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Kraken Executive: Ethereum ETFs Could Amass $1B Monthly - Crypto Times",
        "content": "In a recent Bloomberg interview, Thomas Perfumo, Kraken’s head of Strategy, predicts that Ethereum ETFs could attract between $750 million and $1 billion in monthly investments.\n\n“The market sentiment is trying to gauge. I think the market is priced in something along the lines of $750 million to $1 billion of net inflows to Ethereum ETF products every month” Perfumo stated.\n\nIn the interview, Perfumo noted that if the inflows exceed expectations, it could provide strong support for the industry and potentially drive Ethereum to new record highs.\n\nIt creates positive support for the industry, if we surpass that, note that Bitcoin was at a pace of north of $2.5 billion He said\n\nMoreover, the hype around Ethereum ETFs has already generated some optimism among investors. After the SEC approved the 19b-4 filing, Ethereum’s price jumped by 22%, attracting investments into crypto assets.\n\nThis price movement shows how the market is sensitive to regulatory developments and the potential for growth once ETFs are approved.\n\nPerfumo also pointed out other factors that support the current market sentiment, including the upcoming U.S. election and potential interest rate cut by the Federal Reserve. The recent U.S. CPI data suggest disinflation on a monthly and yearly basis, with some traditional firms projecting rate cuts starting as early as September.\n\nThese wider economic factors, combined with the developments in the crypto space are shaping the overall market outlook.\n\nRegarding Kraken’s strategy, Perfumo emphasized the exchange’s goal to drive crypto adoption through strategic initiatives. When asked about reports of Kraken going public, he reiterated the company intended to expand crypto adoption instead."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPcHU5Ry1HZWwtOXRWUE8zVnlydjQ3bnl1b2xJd21EZUZ4bC1tYXAxSEZkR1hJSWV5YndWeVBZWEpISXZnMWw2WDNTdll4bXdTbUsyRzFzaUtISnBkdXExOVNBRUZ3eEYtT05pYkI3MkxKZmxvZ0QyYVdobUhmSS1VX1NNaTlPLU5WTEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Kraken exec expects Ethereum ETF launch to ‘lift all boats’ - CryptoSlate",
        "content": "Kraken Head of Strategy Thomas Perfumo said spot Ethereum (ETH) ETFs could help the crypto sector while commenting on political developments in the US.\n\nOn July 12, Perfumo told Bloomberg that spot Ethereum ETFs would attract capital flows while attracting attention to crypto, noting:\n\n“It’s a rising tide, lifts all boat story. “\n\nPerfumo further explained that Ethereum’s eventual value “hinges on the Ethereum ETF.”\n\nHe said that the crypto market is “pricing in” $750 million to $1 billion of net inflows to Ethereum products on a monthly basis, which would imply that Ethereum could reach all-time highs between $4,000 and $5,000.\n\nPerfumo also compared expectations to Bitcoin’s all-time high in March, which he called a “quiet peak” that occurred without any evidence of millions of new investors entering the industry.\n\nPolitical developments\n\nPerfumo also commented on political developments. Early in the interview, he said US election outcomes will “set the tone for policy making and the legislative agenda for the next four years.”\n\nHe also emphasized the importance of legislative action and clarity and noted that recent developments show bipartisan support in Congress.\n\nThe House recently decided to pass the Financial Innovation and Technology for the 21st Century Act (FIT21) and attempted to repeal the SEC’s controversial accounting rules along with the Senate. However, President Joe Biden chose to veto the resolution.\n\nPerfumo said:\n\n“Even though you’ve hit barriers at the executive level, [there’s] still good progress going forward.”\n\nHe added that the Republican party appears “more pro-crypto [and] more progressive” on the matter, noting Donald Trump’s plans to attend the Bitcoin Conference in Nashville.\n\nTrump has also made numerous statements in favor of pro-crypto policy, including at recent campaign events in Wisconsin and San Francisco.\n\nMentioned in this article"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPRElTWXhqd0tpd0ZtdjNGOWcyX29jY3hpa0poWDRYUklwWndGLTJmeWJqYXlCNE9kT0Uwb21IY3Q5aU5HamlHZFN1S0lFUnZrNmpfNTliWmtabjUtZXJ4cmdSZ0w4cmFnVVBLS3BENTdvbTYxUkg0elYyZ2ozMGNuMm50aXRaTGRDMHpydjJZMF9aSV9PS2RkZmJXejVDNXU50gGmAUFVX3lxTFBzdW1JU0F0SmZSay1Jb3JhYTlnLWNyOGlaVWZrX2k4LWk0eDVEQ1RRczBMS1pmSHp6aHpNSFJWQ3EwcnB6Q2ZkY2twUUJRQVhPcDRId0Vzcm5pekN3YXh0bGo3THNGX2s4UF9sR1NrNFB2QzNYUmd3WG9aemNrYUxQR3BZTXJmeHJRMTNLc3lYWUtlbFpVTzJnSmNzS0tkZWtlN1d1dGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price To Hit $5,000 As ETH ETF Speculation Ignites Bullish Comeback - CoinGape",
        "content": "Ethereum price has seen a notable increase in value over the past day following the market recovery. ETH price is hovering above $3,100 after an upward trend over the recent hours.\n\nAs of the time of writing, Ethereum price is trading at $3,155 with a surge of 3% during the US trading hours. The current market capitalization stands at $379 billion, according to CoinMarketCap data.\n\nadvertisement\n\nThe trading volume for Ethereum has experienced a significant increase, rising 27% in the past 24 hours to approximately $11 billion. This uptick in volume indicates heightened trading activity and interest in Ethereum during this market recovery period.\n\nOver the past week, Ethereum price has been trading in a range bound between $2,800 and $3,1500. The popular cryptocurrency saw a 5% increase in value over the seven days. During this time, several market events have influenced price movements. A significant drop was observed, where prices briefly dipped before recovering strongly above the $3,100 mark.\n\nEthereum Price Gains Traction: ETF Speculation Fuels Optimism\n\nEthereum’s spot ETF might trigger significant investments into the cryptocurrency sector, potentially seeing $1 billion added monthly. This forecast comes from Thomas Perfumo, Kraken’s Head of Strategy, during his Bloomberg interview.\n\nPerfumo highlighted the Ethereum spot ETF as the foremost of four major growth drivers for the cryptocurrency market in the latter half of 2024. He predicts the ETF’s approval would garner substantial interest from the broader financial community, channeling more capital into cryptocurrencies. According to him, this development marks a pivotal moment, promising to transform market dynamics by attracting new investors.\n\nCan ETH Potential Surge Towards $3,300 Soon?\n\nEthereum price prediction is on the brink of a significant market move. If it successfully breaks through the $3,200 resistance mark, it could ignite a bullish trend, pushing its value close to $3,300. This surge could set the stage for a challenge against the $3,400 level.\n\nConversely, a market downturn could see Ethereum price retreat to the $3,100 support. Prolonged bearish pressure might further drive its price down to $2,900, signaling a potential bearish shift in the market trend.\n\nTechnical Indicators Show Signs of Bullish Momentum for ETH\n\nThe 4-hour technical indicators for Ethereum price show signs of a bullish trend. The Moving Average Convergence Divergence (MACD) indicator currently displays a positive crossover. The MACD line (blue) has crossed above the signal line (orange), suggesting potential for upward price movement.\n\nThe Relative Strength Index (RSI) is positioned at 57. This level is slightly below the overbought territory (typically above 70), indicating that there is still room for upward price momentum before the asset becomes overbought.\n\nFrequently Asked Questions (FAQs) 1. What is Ethereum 2.0? Ethereum 2.0, often referred to as Eth2, encompasses a series of upgrades aimed at enhancing Ethereum's scalability, security, and sustainability. 2. When will Ethereum 2.0 be released? The initial phase, the Proof of Stake Beacon Chain, was launched in December 2020. The final integration, known as The Merge, which combines Ethereum Mainnet with the Beacon Chain, was anticipated in the first half of 2022. 3. Can Ethereum reach a new all-time high? Market conditions and technological advancements such as Ethereum ETF could potentially drive Ethereum to surpass its previous highest price.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQcHp3Zjk4RGdHTjRmM3pvQ2JRWjBRUlpCV253UFVpSHYyRjQyOEFjaENQYmQ5N01rZzRLNHZNdjZBbkhUOTBqdnlDOVFQWkFQME1JSHdoNTA0blcxRmhrdDRDUmRnbXNVMXAza3FtSy1fX241X1hzNl9DUU5Yc3dKaGZFOWh4RkpWQ1dUa2pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Here’s The Price XRP Must Reach to Flip Ethereum - The Crypto Basic",
        "content": "XRP would need to rally by as much as 1,223% to finally flip Ethereum as the second-largest cryptocurrency in the market.\n\nThe XRP community has continued to bemoan the underperformance witnessed with XRP over the past few years. This persistent underperformance since March 2020 has created a massive gap in market cap between XRP and Ethereum, two assets that continuously competed closely for the second spot in the early days.\n\nXRP’s Battles for Second Spot\n\nBefore Ethereum’s launch in July 2015, XRP battled with Litecoin for the second spot on the list of largest assets by market cap. After Ethereum launched, XRP transcended Litecoin, but instead began a new battle with ETH. Ethereum gained the upper hand until January 2018 when XRP hit its ATH of $3.3.\n\n- Advertisement -\n\nHowever, amid the correction from this peak, XRP dropped below the second spot again. Market data confirms that since March 2020, Ethereum (red) has outperformed XRP (blue) by a mile. This has led to ETH’s market cap skyrocketing to the hundred-billionth level, while XRP’s valuation remains below $40 billion.\n\nCurrently, Ethereum boasts a market cap of $377.2 billion, while XRP’s market cap currently stands at $28.58 billion. XRP has now moved below the top 5 assets by market cap, with its current position being seventh. Despite the bearish reality, some market watchers project an imminent rally. Some of the expected targets could help XRP recover the second spot.\n\nHow Much XRP Must Rise to Flip Ethereum\n\nAmid these predictions, we recently assessed how much XRP needs to rally to reclaim the position as the second-largest cryptocurrency. For context, XRP must surpass Ethereum’s $377.2 billion valuation to reach this feat. This would mark a new all-time high valuation for the asset.\n\nSupposing XRP’s circulating supply remains fairly constant at 55.805 billion, the token would need to hit a price of $6.76 to claim a $377.2 billion market cap. With XRP currently changing hands at $0.5112, a massive 1,223% rally is necessary to clinch the $6.76 price level.\n\nNotably, the $6 territory is one of the multiple targets set by market analysts. Interestingly, this $6 price level represents the lower end of these projections. Last month, crypto analyst EGRAG suggested that XRP could reach a minimum target of $6.4. His chart indicated that this target level aligns with the 1.618 Fibonacci retracement point.\n\n- Advertisement -\n\nMoreover, Mikybull, a Bitcoin analyst, disclosed in April that he expects XRP to clinch the $6 level soon. DustyBC, another analyst, predicts a rally to $6 during the bull run. Last October, market watcher Cryptobilbuwoo made a similar projection. Meanwhile, currently, XRP is among the top gainers over the last 24 hours, having spiked 10.45%."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOWFpEcXhOMEpZaC14LW5hZl9kWlM2Wi1kOGFVUXp3dkptVDQtNDRPdkVtWXBHZ29pM0szenA1V010R2tYRWRwamJuS2puMTlMdWJ1TE1MUXRHNlVrQnBLZ19fV2l2Sk9rZFY2TF9INTVxYW93emRKTTNMS0l2RjVJd2xPM0ExUVJsaS1fSm1BRzJxcWViMlpWSzNtWFF2U1M4NXF2SmhZMVg0Y1p4WFNieE5yMURFU2tRVkMtc2dBdG8tVFJwY1RV0gHMAUFVX3lxTE9yYnpNVDhhRXY1S3ZvaklEdnFDTFZfbHdFTk1Cc2Q5VGtvNm9wR0JmSW5mLTNOUmZtTS11TkxpYVlxQ2RwdmI3QWRtMmtBcDV0aUhlMFdKallXTnFyN1BEMWZKVVFwc0s3RDItVFRHU2YwV1lBNzlLanVCdXRvYUxvN1dpRmVjaE5VYVJWdmZ1Rm5FVm5CYnZlY3V2Z2dqZ0dwUXBTcWVUcXpaQ1hxUGZaejI1MUhNdFFoZjEyLVlsYk8zV1laUG9fWHozeQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "More Than a Third of Ethereum Supply Worth Over $147,000,000,000 Now Staked, According to Santiment - The Daily Hodl",
        "content": "New data from market intelligence platform Santiment finds that more than 33% of Ethereum’s (ETH) overall supply is now being staked.\n\nIn a new thread on the social media platform X, Santiment says that over 47 million Ether – worth about $147 billion at time of writing – are now being staked on a prominent ETH staking platform, a figure 3x higher than two years ago.\n\n“The ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high 47.36 million ETH. This is good for 33.9% of the entire supply, and more than tripling since the 10.9% it held two years ago.”\n\nStaking is when a crypto holder uses their tokens to validate and secure a blockchain as a means of earning rewards.\n\nEthereum switched from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) one in September 2022, allowing users to stake ETH to validate the blockchain and earn rewards.\n\nFurthermore, the switch caused the number of ETH hitting the market to drop and made the blockchain faster, cheaper to operate and more eco-friendly. At the time, the Ethereum Foundation said that the number of ETH issued would drop from 13,000 to 1,600 per day.\n\nEthereum is trading for 3,143 at time of writing, a fractional increase during the last 24 hours.\n\nSantiment goes on to note the top 10 crypto gaming projects in terms of non-redundant daily development activity over a 30-day period.\n\nThe list includes MultiversX (EGLD), Decentraland (MANA), Immutable X (IMX), Skale (SKL) and Root Network (ROOT).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFA5aTJ2TTVrdkZNT2VuSEdwVmFNNE1zYnNncVdYcWJlZUxteDFfZmxJUlNXNlcxUUQwSjNjU1ZFd2hZUEVVR3hTQjV3UEFqZEl4NExLM1huUnZFQXF5OXluUlpwdEQydDEyUTA3X0w4NWjSAXZBVV95cUxPSWhaSkk2cHEtM01YNjFLTm1PM0hIZ3dLV2tqNlBVeEVIWjh1SnhhX0cxRVduR2lKanYwbGRWMnVzRlFmZFNGUDlCU3JucjB1Mi1ra1J5QU9DRk5fUDNMWVBnUVdGRERzeU5DVzVaRjJPS0FiQVhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Here's Why Ethereum's Buterin Is Getting 'Canceled' - U.Today",
        "content": "Ethereum co-founder Vitalik Buterin has joked about getting \"canceled\" on social media after speaking out about the importance of cleaning up indoor air.\n\nAdvertisement\n\n\"Me, early 2024: hmm I haven't been canceled for a while, maybe I should say something spicy and do another round… Me, Jul 2024: canceled for... trying not to get airborne diseases,\" Buterin added.\n\nOn Saturday, the Canadian programmer attached a photo of himself wearing a face mask on a plane next to an air quality monitor that shows elevated levels of CO2.\n\nAdvertisement\n\nHe has clarified that modern planes typically have relatively clear air due to ventilation and filtration, but those mechanisms typically tend to be turned off when the plane is on the ground.\n\nButerin is concerned about a lot of various viruses that can potentially contaminate the air.\n\n\"It's not the CO2 itself that's the (main) problem, rather it's a proxy way to measure that ∼7% the air I would be inhaling is air that has been breathed out by other people. 3000+ ppm means *lots* of various viruses,\" Buterin added in a post on the X social media network.\n\nButerin has long been focused on improving indoor air quality and air hygiene. With that being said, the reaction of the cryptocurrency community, which is teeming with anti-vaxxers and conspiracy theorists, was expectedly unhinged. Plenty of users half-jokingly stated that they were considering selling their Ether holdings in response to Buterin's post. Some also resorted to using ad hominem insults.\n\n\"The delta between the minds behind crypto and the minds of crypto consumers is pretty awesome to behold,\" one social media user noted."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNMF9nSGR5WVJfRFJSUW9Kd1p3Vm5peVVLYXdIWE9PNlBKNjM3R1p6ZzlZQ2JRZlE0ZXhQN29rWVp5bmRuNTVQZVpfaXBfOU9NOE95SktvNHFON05NRWN0ZnBuVUdwU0l0ZjE5RFVpU3FTZXlaVU1ycHJpQnBhcko0T3NaRldTTnNSMTVsTndoNFVYRkpOV2hodUlXUlRNSU1aUnF6NHVTZHctaHUtMFloZjVfaXdNc29QVXZyMWpB0gHDAUFVX3lxTE5adHlqcFduRU5LOGlHQXoxSEtIUGtzSGdfQzFsOHRoNWRteWFPN0lvc25ZekhQbXNweEI3VEFsazNIOFVrWGJqbkw0SEVySDlBd3hOb2x6NG40T0FuTkJwSDJJZWpoZkhtdUVucVlYeXRabDN1UTNNWExvRWtIam95RzBxdVc0b1JqakxMZ1R4SW4tZ0JlOFZveWJSaGFiam1FMEpkdE9JVFljcXJURGlER1JyYjd0X3pCTGQzdGhpekZqOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Key insights from Ethereum's performance in current bull cycle - FXStreet",
        "content": "Ethereum's price has followed a divergent pattern in the first 365 days after a Bitcoin halving event.\n\nOver 90% of ETH's supply has been in profit since January.\n\nEthereum investors are slowly displaying confidence again with ETH ETFs on horizon.\n\nEthereum is up 0.3% on Friday as key insights from Glassnode reveal ETH's next potential move as the current bull cycle matures.\n\nDaily digest market movers: How ETH has performed so far in current cycle\n\nDespite earlier predictions that the agency would likely approve issuers' spot ETH ETF S-1 registration statements, the Securities & Exchange Commission (SEC) has remained silent. While the SEC remains mum, key on-chain data provide insight into key historical price moves in Ethereum and how they may affect the current cycle:\n\nEthereum has followed a somewhat divergent market performance in the first year after a Bitcoin halving event, according to Glassnode. In 2016, ETH suffered a 45% drawdown before picking up the pace to rally about 3,400%. In the 2020 halving, ETH charged up by 150% before rising about 2,150%. Since the past halving in April, its price has remained relatively flat.\n\n\n\nETH Price Performance after Halving\n\n\n\nEthereum has often experienced steeper drawdowns than Bitcoin during the early and later stages of previous bull cycles. In previous cycles, ETH saw corrections of above 65%. However, the largest drawdown in the current cycle is quite low compared to others, coming in at -42%.\n\n\n\nThe total supply of ETH in profit crossed the 90% mark in January and remained relatively above it throughout H1. According to Glassnode, extended periods where 90% of a coin's supply is in profit often indicate the later stage of a bull cycle. This is characterized by profit-taking from investors, which in turn outweighs demand.\n\n\n\nETH Percent Supply in Profit\n\n\n\nETH's growth is evident in its 267% rise, adding $354 billion to its market capitalization since the FTX lows of November 2022.\n\nETH technical analysis: ETH investors are slowly gaining confidence again\n\nEthereum is trading around $3,135 on Friday, up by a mere 0.3% on the day. After posting a bearish exhaustion candle, ETH briefly declined to $3,060, sparking over $40 million in liquidations in the past 24 hours. Long and short liquidations accounted for 81% and 19% of total liquidations, respectively.\n\nThe move saw ETH's total liquidations flipping that of Bitcoin despite its relatively lower market cap. This could prime ETH to begin a fresh move toward the upside.\n\nETH options Open Interest (OI) declined to $5.16 billion on Monday, its lowest level in the past year. The move signified heightened uncertainty among traders as ETH's price retraced below $3,000.\n\nHowever, following a slowdown in the bearish pressure and a slight rebound in ETH's price, ETH options OI has begun climbing up again, nearing the $6 billion mark on Friday. The price recovery and rising OI indicate traders are slowly gaining confidence in ETH again.\n\nThis is also evident in ETH's Long/Short Ratio, which has risen to 1.04 in the past few hours.\n\nWith the potential launch of Ethereum ETFs on the horizon and BTC seeing heavy selling pressure from miners, the German Government, and Mt. Gox repayment, investors may reallocate capital into ETH. However, the SEC's delay to greenlight issuers ETH ETF S-1 drafts may hamper a good price increase.\n\nAs a result, ETH will likely follow a horizontal trend within the $2,852 to $3,300 range but slightly tilted toward the upside until the SEC moves on ETH ETFs.\n\nETH/USDT 8-hour chart\n\nAccording to Coinglass data, ETH may drop to around $3,041 in the short term, where there is a liquidity wall of $35.57 million, before rebounding."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORXJrUmZweGJZODFQSG9zd3hNUjRJNWtaekViMlppR25sV25IcHVkWjNHS0hsRndUaV8zZEFONjBEMWNYS1NhRnY1aVczdGlvQmJDRFhHSGxJUGNUcDZoQk9mVU9OZ2ZaZGpqRnFneUxWemZkeWJJWDdGd2dQcTBWcnJvOGtUTHVZZjJQUdIBkgFBVV95cUxNYjVqZHBYSU1DLTJkbFNJdlFpb2lWQk5Obl9LdmFKSFpPVlppUGE1TGVGLUpNSFRXaGE5OU9HVzVTMTMzUmNiYUEzcXNLYXJTdUxZeHZLV01nRFBFNDhJNXRsVWIyd2VZVWUyVWs5bEk3bTZObFlHVnc4aHItcThIWTR2aWpTQWRqc1FqRlVjckFzdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Classic – Swing traders, watch out for these key levels! - AMBCrypto News",
        "content": "Ethereum Classic is likely to face rejection at its former support zone\n\nOBV and Open Interest showed buyer enthusiasm was low\n\nEthereum Classic [ETC] has retraced all of the gains it made during the rally from January to March. Back then, the altcoin’s price had risen from $18.33 to $39.67 at the apex. Alas, the market’s buyers have been underwhelming since then.\n\nThe fall below the $22.9-level meant that a new bearish move seemed more likely than a recovery. Here are the levels and scenarios that ETC swing traders need to watch out for.\n\nFormer support level is now the short-term bullish target\n\nIn April and again in June, the 78.6% retracement level at $22.9 was tested and defended as support. However, the Awesome Oscillator and the price action revealed that a strong downtrend was in play in June.\n\nSupport levels at the 50% and 61.8% retracement zones were lost quickly to sellers and in July, the bears marked another victory by forcing a descent below $22.9. The recent bounce from $18.3 doesn’t mean the bulls are winning though.\n\nInstead, Ethereum Classic swing traders would want to take short positions around the $23.2-$24.1 zone. More conservative bears can wait for a bearish engulfing candle to go short. With the OBV just barely above its three-month support level and the AO resolutely below neutral zero, the bearish argument is very convincing.\n\nOpen Interest at its lowest since October 2023\n\nThe weakness of the bulls was captured by the Open Interest chart. Alongside the price, the OI has slid persistently and stood at $89.7 million at press time.\n\nDespite the 10.6% price hike over the past week, the speculators did not seem too keen to bid.\n\nAdditionally, the spot CVD halted its downtrend over the past week and was slowly climbing higher at press time. The funding rate was positive, underlining the presence of bullish sentiment.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe short liquidations on 8 July after the rejection from $21 suggested a liquidity hunt. Traders should be on the lookout for a price surge that takes out short positions, as that might warn of a liquidity hunt in the opposite direction during the move towards the $23 resistance zone.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPZGkzbnFucXJmQmNpcXpCZ2Q1Yno5UTE3OU1OUHRCclNrQ01KOHJrSEVKUHRzRXRaQkhPZi1SSHRRU0VyeGJSSTlaOGt0dno5QW04Zy16cHdRV3hYQlYta2swWGw4MFJWZVpLcllFQUhVMWZjT2JlOVVmblY0dGpsdnUzeGhmc204?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Whales are Betting Big on Staking! - Cointribune EN",
        "content": "Sat 13 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nOn July 11, 2024, crypto whales showed increased interest in ETH staking and tokens within the Ethereum ecosystem. Data reveals that these large investors are moving funds to Binance, not to sell, but to take advantage of the passive income opportunities offered by Wrapped Beacon ETH (WBETH). This token, part of the EigenLayer ecosystem, is attracting more and more traders’ attention due to its potential yield.\n\nCrypto: Ethereum Staking at $49 Million!\n\nThe increased activity of whales shows a focus on ETH and the broader Ethereum ecosystem. This, with significant fund movements towards staking rather than immediate profit realization. A notable example is that of a whale who purchased 16,074 ETH worth about $49.24 million. This whale withdrew them from Bitfinex, Binance, and Coinbase to stake them.\n\nThis crypto transaction, completed in one week, illustrates the trend of whales testing new forms of staking. ETH staking through specific entities is perceived as a secure method of token holding while receiving liquid staking tokens for trading.\n\nWhales Seeking New Opportunities\n\nWBETH has become a very active token, often offering arbitrage opportunities. Currently, WBETH holders can trade at a price higher than ETH spot, which might explain the increasing deposits into Binance’s staking program. Additionally, Binance offers an annual yield of 2.85% for staked ETH! This further enhances the appeal of this crypto product.\n\nAnalysts predict that this trend might continue, especially with the potential launch of an Ethereum ETF in the coming days. This development could push ETH prices above the $4,000 threshold. Whale movements are closely monitored as they can signal significant changes in the crypto market.\n\nThe growing interest of whales in ETH staking and Ethereum ecosystem tokens reflects renewed confidence in the growth potential of this network. This dynamic could play a key role in the continued adoption and maturation of the Ethereum ecosystem.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQYUpMNTBpWmZ5N29fVjBkQTJOYk9YdlJsc2JzRUNTV0F6MXVzRWhnR0I1djFmbVl4aTRjTVZ0VmdyaGF4ZTluVzdkR3JuZWdWaWZHazVhbThuMFVja3VfajNJUlZfdl8tSXJHQk9jbU1ZQzhmSGtDTVIxYUl5SVBZUWZLWkU5SWRRY2xoUlVDQ3hHdzAxajZWRjBmWG9veG1ZT196R0l5dEhkSnZ5NEJYeUVteC1ic00z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "What’s the go with crypto: Is Bitcoin still a good investment? - Sydney Morning Herald",
        "content": "Money editor Dominic Powell and our experts share tips on how to save, invest and make the most of your money.\n\nReal Money, a free weekly newsletter giving expert tips on how to save, invest and make the most of your money, is sent every Sunday. You’re reading an excerpt − sign up to get the whole newsletter in your inbox.\n\nAround the start of 2017 as a bright-eyed, [AGE REDACTED]-year-old, I remember stumbling onto an article discussing a relatively new cryptocurrency called Ethereum. The article made a raft of claims about how it and various other digital currencies would revolutionise the internet and entirely change how we interact, transact and work online, which sounded pretty cool at the time.\n\nInvesting in the cryptocurrency space can be daunting. Credit: Michael Howard\n\nObviously, none of that happened and almost certainly never will (despite constant assurances from crypto fanatics), but what did happen since 2017 is the price of Ethereum went from $20 to about $4500. Similarly, the price of Bitcoin, the most well-known cryptocurrency, jumped from being worth about $2000 to $85,000 today, great news for anyone who got in when it was cheap. For a detailed description of what cryptocurrency is, check out this Explainer I wrote a while back.\n\nFast-forward to today, and the launch of new crypto products, such as Australia’s first exchange-traded fund with Bitcoin as its underlying asset, tends to come with far less hype than, say, the heady days of non-fungible tokens and Dogecoin. And the major cryptocurrencies (Ethereum, Bitcoin), although still volatile, tend not to experience the same wild price swings of even a couple of years ago − even if there’s still a bunch of smaller, useless “meme coins” operating effectively as pump and dump schemes trying to entice unfortunate investors."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPN180RHdjRUU1aF9FdmhpdHdCa21qV01OLUlLSTBZLWg3dklmT0tyUDc4ZXBBMTA4Yi1qcUVfU2VLbjlCQ3dvWDFxdVZ4TVRuMWJvLVFrUzdOczN0THoyUFdOT3o2b0Q4ek1jc0R3cmw3UXp0Y1NwcGpmcUpHQVBlWDdnMVhWdmdjQ1l5YTBlSVlPaUdzeUE00gGcAUFVX3lxTE81TVVMUUpXbm5iUlAya1VqTGVrdW4yVkZacFRiOWxTR1FST0JGSWNscnFJZEhFb0JJTjM5VzN0NXg2Ym5GUmhjUFBGb3pJVGF6VnA0WmNuSEVBZnItcEpXZUNaNmhDZWtyejlXTmRoNlNmWHQ1Vms4c3hlb1RnSTh1NnVnR0phaVNTV3JpTWl6NlFDVDNQd25VTkhxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Exploring the effect of PEPE whales’ exit ahead of Ethereum ETF launch - AMBCrypto News",
        "content": "PEPE’s large holders sold off significant portions of their holdings in the last 30 days\n\nOn-chain data revealed that the memecoin was undervalued and could rally after the event\n\nMany investors in the market consider the upcoming Spot Ethereum [ETH] ETF launch to be bullish. However, AMBCrypto found that large holders of Pepe [PEPE] seem not to share a similar sentiment.\n\nWe found this information after examining the addresses by holdings data. This indicator groups addresses into different segments and shows if they are accumulating or selling off their assets.\n\nIs the memecoin in chains?\n\nAt press time, AMBCrypto noticed that PEPE addresses holding tokens worth $100,000 to $10 million fell by double-digits. This decline implies that they have sold off some of their tokens within the last 30 days.\n\nThis is a surprise, primarily because PEPE is the top memecoin on the Ethereum blockchain. Therefore, it was expected that the big wigs of the memecoin sector would give the same bullish cues as the rest of the bullish market.\n\nIf this stays the same when the spot Ethereum ETFs go live, PEPE’s price might hike as a result of the development. However, it could be challenging to sustain the hike unless buying pressure increases.\n\nAt press time, the value of PEPE was. $0.0000087. This price meant that it was down 49.27% from the all-time high it hit on 27 May.\n\nGoing by the analysis above, further distribution could drag the price, and the token could be 55% down for the highs. However, post-Ethereum ETF’s launch, the token might perform well on the charts.\n\nHigher highs will come later\n\nThis was the signal the Market Value to Realized Value (MVRV) ratio gave. This ratio provides insights into profitability in the market.\n\nWhen the ratio rises, it means that the market cap is outpacing the realized cap. In this instance, holders of a cryptocurrency have motive to sell. However, if the ratio falls, it means that the realized cap is much more than the market cap.\n\nMost of the time, this brings about unrealized losses and there is little to no motive to sell. At the time of writing, PEPE’s 30-day MVRV ratio was -10.90%, indicating that it experienced a poor level of demand dynamics lately.\n\nHowever, the good part is that the negative ratio might force market participants to hold on to the token. Therefore, the memecoin could be termed undervalued relative to its current market conditions.\n\nAs such, if buying pressure intensifies much later, we could see the price attempt to revisit its May highs. Despite the bearish signs pre-ETF launch, some analysts believe that the memecoin would gain from the development.\n\nRealistic or not, here’s PEPE’s market cap in ETH terms\n\nOne of them is Donny Dicey, an analyst on X. The quote below is what Dicey thinks of the token’s reaction to the Ethereum ETF launch."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPN3l4dS1VOUZKaTZqRDFqdmlYS3QwSmdRVXBsR0R5Wjl5bklGblpWV05md0x5cE5NT0lENFhra2UwSTJsdkhMQWFLa28zTFBMQ1h3Q3ltZzFfekJIeGhPeHZjTDFpYWtmTnJUR1ZGTm0wSzdqOTBCam80N3hzXzhPN2NVazdBTi0tQzJfa1lJUdIBlAFBVV95cUxQZjNRQmpBUlA5RFhselhkNWhMNXdOVlM2TFprM0c1SjFlZXdKNlZ0MDZJa1BDblJVWk5qRllTUXZjcm9rZmZ5eVRfQ3U2M21jYUJXd2dScEx4TDdrZzRHTUdxSF92ZUdGM2VlckpuZmE5QkJ0aUJSYWU5Yzh1Z3hkQzhPR1lScFQwOWVXOHNZZlNLUzkx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Approval: How Long Will the SEC Stay Silent? - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) is keeping issuers of spot Ethereum ETFs in suspense with extended delays. Additionally, Ethereum bulls are eagerly anticipating a significant price rally once the approval process concludes.\n\nNate Geraci Predicts Timeline for Ethereum ETF Approval\n\nETF Store President Nate Geraci recently shared his observations of the SEC’s approach towards the spot Ethereum ETFs review process. Geraci stated that the US SEC seems to be treating the spot Ethereum ETF S-1 filings in a manner similar to the 19b-4 forms, thereby maintaining a high level of secrecy in the matter.\n\nadvertisement\n\nDespite the silence, Geraci believes that the approval shall happen by the next week. “I still think approval is likely next week. There is absolutely no reason for delay,” he said.\n\nIt appears the SEC is playing the spot eth ETF S-1s similar to the 19b-4s… *Extremely* tight-lipped. Still think approval next week. Absolutely no reason for delay. — Nate Geraci (@NateGeraci) July 12, 2024\n\nThe SEC is repeating the same mistake this time as it did with the spot Bitcoin ETFs, said Geraci while quoting SEC Commissioner Hester Pierce. Back then Pierce said: “Had these products come to market in the way other comparable products typically have, we would have avoided the circus atmosphere in which we now find ourselves.”\n\nBloomberg’s ETF strategist Eric Balchunas also commented on the SEC’s lack of action regarding the Ethereum ETFs. He said that there’s been no communication throughout this week after the issuers submitted S-1 forms on Monday. This leaves the issuers puzzled over the delay.\n\n“Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait,” Balchunas remarked. He expressed hope that the situation might progress quickly next week, but uncertainty remains. As per the market sentiment, the issuers are expecting one more filing submission before the final approval by the SEC.\n\nAlso Read: ETH Gas Fee Flashes Inactivity Concerns Before Ethereum ETF Approval\n\nTop Players Accumulate ETH Before the ETF Approval\n\nOver the last few weeks, some of the top market market players and Ethereum whales have been accumulating ETH in preparation for the ETF approval.\n\nThomas Perfumo, the head of Strategy at Kraken showed that the US Ethereum ETFs can see inflows to the tune of $1 billion every month following the approval. Additionally, big market players like Tron founder Justin Sun have accumulated $1.1 billion worth of Ethereum gearing up for a big rally ahead.\n\nAs of press time, the Ethereum price is trading 1.25% up trading at $3,123 with a market cap of $375 billion. Ethereum bulls should take the price past $3,200 in order to trigger the bull run up to $4,000 and beyond.\n\nAlso Read: Bitwise Executive Says Ethereum ETF Is Close to the Finish Line\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQVHA0dGpzNVRUTnZTcEkwcnVrRFc5alZCYklnMGJyV2JJd2hYQ2xvMzZHX2ZlcEo5cHNzQ3lYODFqSmplUmE4MjMtb1NFNmM5Rnl0YXFoWHZNY2dZY2NTVnBFSldteGd4MW1Scm9GSnRROUZVUUJjTmlCU19vbjVVSHVaR2VvdmYyM3FKdTlPU3F6bWFHLUtOaGJnc21hbGtCMWVOdzZqdjNHeFhVQ053V0pYMkxSOW02cHlZUHhoSXZ3cjZBWmxHTHlieVo5akXSAdQBQVVfeXFMTWZPYmlGcTFDclQxeHI3S1dfTTRKeDZON3NxZE52Y2gyQjBJLUM4X1NhOUlCMHBrU1ZrM1VEeUVOWkxFNXJlcTF3OGZzVXFyZjRjWEt1eTgtMjlxOUtOTEZMMHFGblNvQzV0dExRczVFQ0kySWhmXy1jRFZNWm1WdXBxcmpyRnVvbHRyS0pmcGgxMzBwVVRaZkZvUFlvN0FkVnNCWVQ4V3dabXpyLWZhbnhRb3JEYU1SbzFaWmFsbXZ1Q1JxNW15T2VteUVaYmpiZGJCbUI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch, a game changer for Ether and altcoins? - FXStreet",
        "content": "Ethereum analyst from venture capital firm says Spot Ethereum approval could come as early as this week, placing odds at 72.7%.\n\nA crypto analyst predicts 200% gains in Ether price, post the anticipated approval of the Spot ETF by the Securities & Exchange Commission.\n\nEther sustains above $3,000 even as supply on exchanges surges to 2024 peak.\n\nEthereum (ETH) traders are watching two key events closely: the anticipated approval of the Spot Ether ETF and the activities of whales, the large wallet investors holding ETH.\n\nAn analyst has predicted that the odds of Spot Ether ETF is 72.7% this week.\n\nEthereum ETF launch, and on-chain activity\n\nAnalyst behind the X handle @DarkCryptoLord says that the odds of the SEC approving a Spot ETH ETF is 72.7% this week. ETH traders anticipate the ETF approval to act as a bullish catalyst for the altcoin’s price.\n\nEric Balchunas, Senior ETF analyst at Bloomberg shared his thoughts on the Ether ETF and said it remains unclear why the US financial regulator is taking so long.\n\nYeah, rn it’s all quiet on the Western Front re eth ETFs. Nada from SEC this week. Unclear why they taking such sweet ass time. Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait. Maybe things will move fast next week. We’ll see… https://t.co/o1ZSdIf1nE — Eric Balchunas (@EricBalchunas) July 12, 2024\n\nSantiment data shows that Ethereum supply on exchanges has climbed to its highest level in 2024. It is likely that Ether holders anticipate a rally in ETH price and are waiting to take profits.\n\n19.23 million Ether is being held in wallets across crypto exchanges per Santiment chart.\n\nSupply on exchanges vs. ETH price\n\nAnalyst predicts 200% gains in Ethereum\n\nAnalyst behind the X handle @follis_ notes the similarities between Ether chart and Bitcoin’s prior to the largest asset by market capitalization rallying 200%. If the Ether ETF garners as much attention and interest from institutional investors, as Bitcoin did, it is likely that the altcoin extends gains by 200%.\n\nEveryone focussed on Germany and Mt Gox\n\n\n\nMeanwhile the Ethereum ETF is about to launch and the $ETH chart looks identical to $BTC before it pumped +200% last year\n\n\n\nStudy ETF rallies pic.twitter.com/VWENNnO8dN — フ ォ リ ス (@follis_) July 9, 2024\n\nAltcoins related to Ethereum, staking tokens, staking tokens, Layer 2 scaling assets could extend gains alongside Ether. Bitcoin’s post-ETF gains reflected in assets like BRC-20 and related assets, if history repeats this could occur for Ethereum.\n\nAt the time of writing, Ether trades at $3,152 on Binance."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdlFsX2toelVfV0dVU3o3eXhRMGJXeXBYNG5yaFRjM19WWVB5anVTaWRzLWI0U3lubzhsSHVjcXNrYVlSMUFMTEVMWUFjMzFGb0xIRm5wR3prM0lOT2c3LTB5S1pzZW9Pa29FUlNoa3Z4MXhOTWlIRWtZMjJIa2t0RnBSamLSAYoBQVVfeXFMUF9qa2VyeFNtd295Y0kzNTNtT3B2ZWYzRjJvQzU0OUpEWUd2NFhyWE0yZklnSUc5el81Z0FqUkVXblpBMVJVWkYzeF92SktldFl3RFduaWF3N2wtZFNrandxSzg0d25JUUhwTlpBa2tfaFNjYU9oX1g2RWE4R2dqYnpQRjNYOFhuX1NR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum gas fees hit new low as Pectra dawns – What next? - AMBCrypto News",
        "content": "Ethereum fees declined significantly and hit its lowest point in over a month\n\nDevelopers continued to work on the Pectra update, with the testnet expected to launch next week\n\nEthereum [ETH] has seen a significant surge in price over the past week, with the altcoin even managing to push past the $3,000-level. This has inspired some hope among investors. Despite the positive price movement though, overall interest in the Ethereum ecosystem declined.\n\nGassed out\n\nCryptoquant analyst Woominkyu’s analysis of Ethereum gas fees revealed a downward trend since May 2024, reaching its lowest point in recent months. This suggests a relatively quieter period of network activity on the Ethereum blockchain.\n\nThe analyst’s chart visualized the average gas fee (Gwei) in blue, while the black line tracked Ethereum’s price. Historically, periods of increased gas fees have often coincided with upward price movements for Ethereum.\n\nNew developments underway\n\nEven though interest in Ethereum’s ecosystem seems to be slowing down, new developments on the Ethereum network may help attract users to the network.\n\nEthereum developers on 11 July discussed advancements for development on the Ethereum network. Progress on the Pectra and PeerDAS testnets were the primary focus. Developers expressed confidence in launching Pectra the following week, while addressing remaining issues on PeerDAS. For context, PeerDAS stands for Peer Data Availability Sampling. It’s essentially a method being explored to improve the scalability of the Ethereum network.\n\nAdditionally, preparations for the Pectra testnet launch are now underway. Various client combinations are being tested to ensure a smooth transition. Efforts to integrate the EthereumJS client into the Pectra testnet are progressing too.\n\nAlongside testnet development, research is also being done into potential vulnerabilities in Ethereum’s client software. A tool designed to identify these issues is being developed and refined with the goal of enhancing network security.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nOverall, the Pectra upgrade is primarily focused on adjusting the blob gas limit. Blobs are essentially data chunks that are processed off-chain to improve Ethereum’s scalability.\n\nBy modifying the blob gas limit, the Pectra upgrade aims to optimize the efficiency of data processing and potentially enhance the overall performance of the network.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,139.96 following a 2.23% hike in the last 24 hours.\n\nHere, it’s worth pointing out that the volume with which ETH was trading declined by 26.55% over the same period too."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPS25hV01DaUhSUkZGamY0QVBrY0lSRHpSLTZDbnU4Wk5CUFNlSXUtWGZwUmhzS0stekE5Zkx3U3NBYmdQQVdseGs4bmpYUkxndElwSUVQWDRWT2lKMHFzMHlCUkt5YzdtMFRTRWZMdy1rWWl3WElCQkxSblU1UFljcjg4cjhlcS1maU5mS01vMXl2UDVI0gGaAUFVX3lxTE55dnE1MWlGMlU4bk1lMVNHQ25ZVUJtMThYbVc4aDllLVNIdXY0X0FwVmpzWkw1NWRDU1VGaEx1MGdSNkFuVzU0aGZsZ3ppWERoaXBmd212V0tfUjV3b0RJbDh2TG5pWEh0c1pNblRkVXRhOC1xVWhNR3IxWWVCMXYyY2thRDhvNUJCc0l4OUxHTUQ2ckV0dHhFYXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum News: Whale Scoops $33M ETH As Spot ETF Approval Speculation Looms - CoinGape",
        "content": "A significant Ethereum whale has made a substantial purchase, investing millions into the second-largest cryptocurrency by market capitalization. This notable transaction occurred at a crucial time, as the crypto community anxiously awaits potential approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission.\n\nThe timing of this large-scale acquisition, combined with the ongoing regulatory uncertainty, has ignited intense interest among investors and analysts. Many view this as a possible indicator of shifting market dynamics for Ethereum.\n\nadvertisement\n\nDetails Of The Whale Purchase & Market Context\n\nA significant Ethereum transaction has caught the attention of the crypto community, highlighting growing interest in the cryptocurrency as speculation about ETF approval intensifies. An Ethereum wallet, identified by the address 0x517…7aF15, has made a substantial purchase of 10,545 ETH coins.\n\nThis acquisition occurred over a brief three-hour period, indicating a rapid and decisive move by the buyer. The total value of this purchase amounts to approximately $33.29 million, with each ETH coin acquired at an average price of $3,156. Interestingly, the buyer executed this large purchase through five separate transfers. Each transfer involved an identical amount of ETH, suggesting a strategic and possibly automated buying approach.\n\nOver recent weeks, there has been a noticeable trend of accumulation among top market players and Ethereum whales. Thomas Perfumo, the head of Strategy at Kraken, has provided valuable insight into the potential impact of spot Ethereum ETF approval. According to Perfumo, U.S. Ethereum ETFs could see substantial inflows, potentially reaching $1 billion every month following approval.\n\nAdding to the intrigue, other high-profile figures in the crypto space have been making significant moves. For instance, Justin Sun, the founder of Tron, has reportedly accumulated Ethereum worth $1.1 billion.\n\nAlso Read: Hong Kong & Australia Bitcoin ETF Inflows Hit Record High\n\nCurrent Ethereum Market Status & Regulatory Outlook\n\nAs of the latest data, Ethereum price is trading at $3,153.88, with a 24-hour trading volume of $8.9 billion. This represents a 1.30% price increase over the last 24 hours and a 4.60% increase over the past week. The current circulating supply stands at 120 million ETH.\n\nThe cryptocurrency community is closely monitoring the U.S. Securities and Exchange Commission for potential approval of spot Ethereum ETFs. The SEC has been delaying its decision, creating uncertainty for ETF issuers and investors. Market analysts remain optimistic about an imminent approval, with some predicting it could happen as soon as next week.\n\nHowever, there are concerns that the SEC might be repeating its approach from the Bitcoin ETF approval process, potentially causing unnecessary delays. Bloomberg’s ETF strategist Eric Balchunas noted a lack of communication from the SEC this week, despite ETF issuers submitting their S-1 forms on Monday.\n\nInterestingly, just before the final decision on ETF approval, Ethereum gas fees dropped to a two-month low, suggesting major inactivity on the Ethereum network. This development adds another layer of complexity to the current market situation and regulatory expectations.\n\nAlso Read: Solana Co-founder Highlights US Govt’s Crypto ‘Mess’\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQSUE1Tkw1SW1GZWl2MG02b0hhc2dSamRaWFE4UV9xaFowLU1aclo2Z0hIT2E2NTdKSG9kci1nLVVSa2NWRmY0ckp1b29abThuYUF5Z1Fkczdlb01raFpITkhOUW5NcHZZY2pmMGxvYmdXaUx0TU1lS3BqZjdVQjVWVkI4ZG5rQXAtVnfSAY8BQVVfeXFMTmNiMFBldzBOMkJlVVpWTVo0czdiM0Jhd1FxT3QtZHpmNENueTZ3TDRQX0xWNkZOM3dQZzItc1lKYUluLWpjTEdQaElrZDdqckZsTlBGRUlqZzhfMWQ2aENFRUNaV0R2MW9QNzB1YmhOU0hWQnRLRnd6TFlVeUtUSURjRXpraVE3cklmLTVIYzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Ethereum sees rising demand from U.S. investors – Price impact? - AMBCrypto News",
        "content": "The increase in the Coinbase Premium Gap suggests a price increase for ETH.\n\nHowever, ETH might not reach $4,000.\n\nAccording to data from CryptoQuant, crypto investors have been buying Ethereum [ETH] in large numbers. This was evident from the trend of the Coinbase Premium Gap.\n\nThis metric measures the difference between the ETH price on Coinbase and that of Binance. When it decreases, it means that investors from America are selling ETH or refraining from buying.\n\nAmericans now trust in the altcoins\n\nBut high values, like its recent rise to 0.78 suggest strong buying pressure from the U.S. As per AMBCrypto’s findings, increased exposure to Ethereum might be connected to the imminent Ethereum ETF launch.\n\nBut apart from that, it provides the altcoin price with a higher chance of increasing. For example, in March 2023, the Coinbase Premium Gap dropped to one of its lowest point ever.\n\nThis led ETH price to drop below $1,400. Fast forward to March 2024, the same metric hit a high point. At that time, ETH jumped to $4,065.\n\nAt press time, the market value of ETH was $3,194. This was a 34.70% decrease from its all-time high. However, if buying pressure continues to improve in the U.S. and other regions globally, we could see the price erase some parts of this drawdown.\n\nFurthermore, data tracked by IntoTheBlock gives context of price Ethereum can reach should accumulation intensify. The specific metric AMBCrypto looked at was the IOMAP.\n\nETH set to retest $3,437 despite neutral sentiment\n\nIOMAP stands for In/Out of Money around Price. In addition, this indicator spots buying and selling zones that are supposed to act as support or resistance.\n\nIt classifies addresses based on those making money, at breakeven point, and those out of money.\n\nThe larger the cluster of addresses at a price range, the stronger the support or resistance it offers. As of this writing, 3.56 million Ethereum addresses were in the money and purchased 2.47 million ETH at an average price of $3,140.\n\nTo the right, 2.02 million addresses bought 4.01 million ETH around $3,242, and are out of the money. Considering the larger addresses in the money, there is a chance ETH might break the resistance at $3,242.\n\nIf this is the case, the next area for the cryptocurrency to reach could be $3,347. AMBCrypto checked the Ethereum Fear and Greed Index to see if it could be a good time to buy ETH.\n\nFurther, this index ranges from o to 100. Values close to 0 indicates fear and those close to 100 indicates greed. As of this writing, the index was 39, meaning that there was neither extreme fear nor greed.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the reading provides an opportunity to purchase the altcoin especially as the ETF launch is seemingly a bullish event.\n\nWhile the price of ETH seems in line to increase, a decrease in overall interest could invalidate the prediction."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQaWJQa1pOYUNIblEyOHJCam1LTjd3NDFnRi01ZDk0clRieExVVEdRaVItVXN4VnQ4bDUzLWV0UnZWdUliYjdOaXVieS1LYVN1MllKRFNFVzBSN1RrQldLMVo5bE1tbnRRWWxKQW10OVpJUDdobnA4bVo1VVNUNmx3bjlYaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Here’s when Ethereum will reach $4000, according to analyst - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is currently showing signs of recovery after a recent sell-off phase. This has led to a notable rebound, suggesting the potential for a continued uptrend.\n\nOver the past two months, Ethereum has outperformed Bitcoin (BTC), with analysts predicting a significant price increase in the coming days due to the anticipated launch of an Ethereum ETF.\n\nThis event is expected to strengthen ETH against BTC, particularly given the bearish divergence on the BTC weekly chart.\n\nDespite the optimism, there is no clear timeline for the launch of the much-anticipated spot Ethereum ETF, causing confusion among issuers about the delay.\n\nNevertheless, major market participants and Ethereum whales have been accumulating ETH in preparation for ETF approval, anticipating a substantial price increase once the approval is granted.\n\nIn a TradingView post on July 13, analyst RLinda pointed out that the daily chart of ETHUSDT shows that bulls are actively maintaining the price above a crucial support line.\n\nTechnical analysis and market outlook\n\nAccording to the analysis, the area above the 200-day moving average (MA) indicates consolidation, which is a positive sign for a bullish structure.\n\nETH price analysis chart. Source: TradingView/RLinda\n\nThe current resistance level is around $3,200, and a breakout could lead to significant upward movement, potentially targeting the $4,000 to $4,800 range.\n\nOn a shorter, four-hour timeframe, the price movement is characterized by consolidation. A large player appears to be actively purchasing ETH, anticipating important news and reinforcing the intermediate bottom zone.\n\nThis period of consolidation, supported by increased volume, indicates strong buying interest and a likely continuation of the uptrend. The key support levels here are around $3,056 to $3,152, which have consistently held firm.\n\nETH weekly price analysis chart. Source: TradingView/RLinda\n\nThe weekly chart supports this bullish outlook, showing a pattern of higher lows indicative of a long-term bullish trend. The key support level at approximately $2,852 has proven resilient, with buyers preventing further declines.\n\nA breakout above current resistance levels on the weekly chart could lead to a significant rally, targeting the $4,000 to $4,800 range.\n\nTimeline for reaching $4000\n\nGiven the current market conditions and the anticipated approval of ETH-ETFs, Ethereum could reach the $4000 mark within the next 4 to 6 weeks.\n\nThis projection is based on the expected approval of ETH-ETFs within the next 1-2 weeks, technical indicators suggesting a strong uptrend, and positive market sentiment with strong buying interest.\n\nAs of the latest update, Ethereum is trading at $3,201.78, reflecting a 2% increase on the daily chart.\n\nETH seven-day price chart. Source: Finbold\n\nThis upward momentum is bolstered by both fundamental and technical indicators pointing towards a bullish future.\n\nIn the short term, maintaining consolidation above MA-200 and breaking through key resistance levels are crucial.\n\nIn the longer term, sustaining the support levels and continuing the bullish trend could see Ethereum reaching new highs.\n\nThe alignment of both fundamental and technical factors suggests that Ethereum could reach the $4000 mark soon, particularly if the anticipated ETF approval materializes.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOTzZWYlZLS1N6WnJ3QXRxU000bnZGY294aV9XeGFIYUhKSzZUQ2RIWWFOYzlObjAtTmV2cDRIUDBjalpjdmtkTWZPVDRwVnhFWFlfSEljQUgxZnk2Yk04eG4zUDMzUkdEc2F2ZkNVdUltcVUwUnBhVERFSlJQYlRCM0NFZi1rcEI4UlY4VlVubmxaMUlYMjBwM2NmTXJvRzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Ethereum or Cardano? We asked ChatGPT-4o which crypto is a better buy for 2024 - Finbold - Finance in Bold",
        "content": "Ethereum’s (ETH) position as a leading decentralized finance (DeFi) crypto project faces significant competition from other established entities.\n\nNotably, Cardano (ADA) is among the prominent projects vying for Ethereum’s throne. Cardano has undergone significant developments, building the potential to replace Ethereum.\n\nIndeed, based on this unique position, the crypto tokens underlying projects can serve as unique investment opportunities. In this vein, Finbold consulted OpenAI’s most advanced artificial intelligence (AI) tool, ChatGPT-4o, to gather insights on which crypto is a better investment for 2024.\n\nThe AI tool noted that deciding whether to invest in Ethereum or Cardano in 2024 involves analyzing several factors, including their performance, development progress, market position, and future potential.\n\nComparative overview\n\nThe AI project acknowledged that Ethereum has rallied by 40% in 2024, indicating strong investor confidence and market performance. It boasts a well-established ecosystem with many decentralized applications (dApps) and smart contracts.\n\nThe Ethereum network’s transition to Ethereum 2.0 improves scalability, security, and energy efficiency by introducing Proof of Stake (PoS). Additionally, Ethereum has a large and active developer community that is continuously innovating and improving the platform.\n\nHowever, ChatGPT-4o noted that Ethereum still faces challenges despite recent improvements, such as high transaction fees. These high gas fees can be a barrier for small transactions.\n\nEthereum strengths and weaknesses. Source: ChatGPT-4o\n\nOn the other hand, Cardano‘s price dropped by 28% in 2024, suggesting a decline in market confidence or other challenges. Cardano is known for its rigorous academic research and peer-reviewed development process, which aim for a highly secure and scalable blockchain.\n\nIt uses a PoS consensus mechanism, which is more energy-efficient than Ethereum’s previous Proof of Work (PoW) model. The Cardano team continues to roll out significant upgrades and developments, such as smart contract capabilities with the Alonzo upgrade.\n\nDespite these strengths, ChatGPT-4o noted that Cardano’s ecosystem is less mature or widespread than Ethereum’s, with fewer dApps and projects running on its platform. The recent price drop may reflect broader market sentiment or specific issues within the Cardano community or technology.\n\nCardano’s strengths and weaknesses. Source: ChatGPT-4o\n\nThe verdict\n\nWhen choosing between the two, the AI tool pointed out that given Ethereum’s strong performance, established ecosystem, and upgrades with Ethereum 2.0, the asset might be the better buy for 2024. This year’s rally indicates strong market confidence, and its mature ecosystem offers more immediate opportunities for investors and developers.\n\nIn contrast, ChatGPT-4o stated that while Cardano presents an innovative approach and energy efficiency, it faces challenges in adoption and market confidence. However, it could present a buying opportunity if investors believe in its long-term potential and the success of its ongoing developments.\n\nHowever, it noted that Ethereum might offer more stability and immediate opportunities, while Cardano could be a higher-risk, potentially higher-reward option. The tool advised diversifying investments across assets to balance potential rewards and risks.\n\nETH vs. ADA investment verdict. Source: ChatGPT-4o\n\nIn summary, the AI platform noted that when considering an investment between the two, it’s important to put into perspective the risk tolerance and investment horizon.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]