[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQVXdiUG12X2Vadm9nenlRWHFWWXd2S1hpZ3p4QTNJNElxRF9ETHRuYVA2a2ZWYTV5YWVoWExnYVFrZkhKUmt3RGxtRDVSMEw1WEhRSG1oRVZpUE11SjBnTUpOUmRqOTlpdHhpYUVtcUpaeVJuRENTelhjbGVnYUdBRUQ1YTFiM2wzeEtwQ3VVRUxxdlJ0YzBPc094dFJCa2VQVjROVEZnZ3JqZWhxTXM5NF8xc0NYbUJI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Token Ether Rallies on Claim About SEC’s Ethereum Probe - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNVJGQ1NwZXd1TXl5WkxOVFdpSEFaMmNDc2loSktxeHk2d0drN0xtZi1Jc3JkZ0otMUk3bWRYOEEtN0p3OWRFZkVURlo4NnpaYklYMENPVy1BNHVFUkhnYksxeE5WWUxHYk4tRzhfSGNCV2FTbk02eFEtLXdYUHRKNVFxaEtLbzRVY29VMzdTSGwzckc4a3VZbUwxMDRYMW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "What Will Allocations Look Like in Combined Bitcoin and Ethereum ETFs? - Unchained",
        "content": "After the first combined ETF was filed today, what will other issuers do regarding the allocation to BTC and ETH?\n\nAs the first combined BTC/ETH ETF was filed, what can we expect from future allocations?\n\nOn Tuesday, as the market eagerly anticipates the full approval of spot Ether ETFs, Nasdaq filed for a combined Bitcoin and Ethereum ETF. This new ETF, managed by Hashdex, will allocate 70.54% to bitcoin and 29.46% to ether. These allocations are based on the relative free float market capitalizations of bitcoin and ether.\n\nBut, is this the only way newly combined ETFs will allocate to bitcoin and ether? And what impact might this have on the market?\n\nRead more: There Are Now 11 Spot Bitcoin ETFs. Here’s the One That’s Best for You\n\nWhy Combined ETFs Matter\n\nThe introduction of combined BTC and ETH ETFs is significant for several reasons. Firstly, these ETFs offer investors diversified exposure to the cryptocurrency market without having to choose between Bitcoin and Ethereum. This diversified approach might attract more inflows, especially from more conservative investors, as it mitigates the risk associated with investing in a single asset. By holding both BTC and ETH, investors can benefit from the possible upside of both leading cryptocurrencies, potentially stabilizing returns compared to single-asset ETFs.\n\nThe structure of combined ETFs could also impact the prices of BTC and ETH. As these ETFs gain popularity, increased demand for the underlying assets could drive up their prices. If there are ETFs that allocate more to one asset or another, it could be positive for that specific asset.\n\nNate Geraci, president of the ETF Store, explains that the success of broad commodity ETFs suggests that combined crypto ETFs could find a larger audience “due to the novel nature of the category.”\n\n“Some investors and advisors will prefer a diversified approach to an emerging asset class like crypto versus attempting to pick winners and losers,” Geraci told Unchained. He believes that once additional crypto assets are available in an ETF wrapper, such as SOL or XRP, we can expect to see various index-based and actively managed strategies.\n\nAllocation Strategies\n\nGeraci believes that, as in the Hashdex ETF, the division should be reflective of their respective market caps. “Ether is currently valued at about one-third the market cap of Bitcoin. I think that’s a reasonable proxy for what spot Ether ETF demand will look like compared to spot Bitcoin ETF demand,” Geraci told Unchained. And despite the lack of staking options in the initial spot Ether ETFs, Geraci believes this won’t significantly deter demand.\n\nHowever, Geraci also expects the emergence of multiple flavors of combined BTC and ETH ETFs, including market cap-weighted and actively managed products. “Market cap-weighted products will hold BTC and ETH in the proportions described above. Actively managed ETF holdings will be dictated by the manager and prevailing market conditions,” he notes, indicating potential variability in allocations based on market dynamics.\n\nScott Johnson, general partner at Van Buren Capital, suggests that combined BTC and ETH ETFs might feature a 50/50 split or follow some type of index-weighted approach. “To the extent these come online in the near term, you might see a 50/50 or some type of index-weighted allocation,” Johnson told Unchained via email.\n\nLooking at other markets, such as Canada, where crypto ETFs have been available for several years, provides valuable insights. For example, the Evolve Cryptocurrencies ETF is weighted on a market capitalization basis and rebalanced monthly. As of the latest data, this ETF allocates 71.90% to Bitcoin and 28.10% to Ethereum.\n\nMeanwhile, CI Financial offers the CI Galaxy Multi-Crypto ETF, an actively managed ETF, and uses a rules-based, momentum-signaling strategy, allocating roughly 50/50 to BTC and ETH.\n\nLearn more: Bitcoin ETFs Explained: What Are They & How Do They Work?"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFA4cWxhX1o4M1FraHplcC1DUDhzOE5ZeTI5MUdBUGxsb190QjRTY1JqN2ZBWlpYZFN0VkU4ZVV2Rl9tQUVNZjdNWXE0OERMWVVkOVJvT3RyY0dyLXljbGtIb2praXdUeWd4ZzhieUtJOWd0emJyeVNReDZtQdIBgwFBVV95cUxOaUxSUVo3QXV2OG43azMtd0p4M3JmMVp3MVhkdGxld2ttTXJ5Tm5RdFpyeGszX3B5V3dJSE0tZHgzdzRZeDNvanh0S3hFTFdsREJyQ3drWjg5UWl2bEpXU2tFZGFqaDJvWkdoNjZ6ZDFoVGlFb3JHLTRFNjF3RE1aeTJKdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "SEC Is Dropping Its Investigation Into Ethereum, Consensys Says - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLeading Ethereum developer Consensys announced late Tuesday that the U.S. Securities and Exchange Commission is “closing its investigation” into the cryptocurrency.\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0,” the company posted on Twitter. “This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nAfter the SEC approved Ethereum spot ETFs last month, Consensys said it sent a letter to the SEC noting that the funds “were premised on ETH being a commodity,” asking how the decision would affect the agency's investigation. (Disclosure: Consensys is one of 22 investors in Decrypt.)\n\nETHEREUM SURVIVES THE SEC. Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nAD\n\nAD\n\nConsensys attorney Laura Brookover separately posted the SEC's notification letter and the company's full statement on the SEC's move to Twitter.\n\n“Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development,” Brookover wrote. “After more than a year, the Ethereum investigation is finally over with no charges against anyone.”\n\nThe SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development. After more than a year, the Ethereum investigation is finally over with no… — Laura Brookover (@laurabrooksie1) June 19, 2024\n\nThe SEC's correspondence, however, included standard language that disclaimed that the notice that it concluded its investigation “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the staff’s investigation.”\n\nAD\n\nAD\n\nWhen contacted by Decrypt, an SEC spokesperson said “the SEC does not comment on the existence or nonexistence of a possible investigation.”\n\nIn April, Consensys went on the offensive, filing a lawsuit against the SEC that claimed the regulator was trying to “seize control over the future of cryptocurrency\" and that it was planning to designate Ethereum as a security. In fact, the unredacted lawsuit revealed, Consensys alleged that the SEC had internally decided on the status of Ethereum a year prior.\n\nThe lawsuit was triggered by a Wells Notice—a precursor to regulatory action—Consensys said it received for its popular MetaMask wallet.\n\nOn Tuesday, Consensys made clear that it would continue to press its case against the SEC.\n\n“In our lawsuit, we also seek a declaration that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws,” the company said. “It should not take a lawsuit to provide the much-needed regulatory clarity to allow an industry that serves as the backbone to countless new technologies and innovations to thrive.”\n\nWhile celebrating the SEC's decision to back off, the company remained staunchly critical of the agency's approach to crypto regulation.\n\n“The closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under SEC’s unlawful and aggressive crypto enforcement regime,” Consensys added."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOblFyU1N5RjJpaTNXYjhCNFVlbjAyQkY4UDdFMVNNUEoxRzQ2MW9abGVhbVRpQ0NGRkxZRlEwd0lsZThSUU9YdU1GTUxjaFRENFhlUFdHeFMzQzN6emZtV01jNGtRVFdyTTNURG95dGJGbUNsQW53QVN3N3dQREg5M0gwOEdwYjJlWFVDSWRUQ2NZSTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "3 Reasons to Buy Ethereum While It's Below $4,000 - The Motley Fool",
        "content": "Is Ethereum on its way to a new all-time high? These three factors say yes.\n\nIn the first half of 2024, Bitcoin (BTC -2.22%) captured the imagination of crypto investors. But don't sleep on Ethereum (ETH -4.27%). Up 54% year to date, it has largely kept pace with Bitcoin, and it has one new catalyst in place that could send it soaring in the second half of the year.\n\nSo this could be the time to put Ethereum on your investment radar. There are three good reasons why it could soar past the $4,000 mark on its way to a new all-time high.\n\nThe new ETFs\n\nThe big catalyst, of course, is the imminent launch of the new spot Ethereum ETFs. If they enjoy anywhere near the same success as the spot Bitcoin ETFs, they could send the price of Ethereum soaring. During the first six months of the year, the spot Bitcoin ETFs pulled in $30 billion from investors, and that is what led to Bitcoin skyrocketing in price by 60%. The current thinking is that the new spot Ethereum ETFs could pull in as much as $3 billion in their first six months.\n\nThe only question, really, is when the new ETFs will start trading. The original consensus was the end of May. That was then pushed back to the end of June. And now SEC head Gary Gensler says it will be sometime before the end of the summer. Maybe by the time you're back from summer vacation, you'll be able to buy them.\n\nEthereum's market dominance\n\nOne underappreciated fact about Ethereum is just how dominant it is in many niches of the blockchain world. From decentralized finance (DeFi) to gaming, web3, and the metaverse, Ethereum is the clear market leader. Its blockchain technology powers so many of tomorrow's most powerful and interesting apps. That means more users, more developers, more active wallets, more transactions, and more cash flows than any other blockchain ecosystem.\n\nCase in point: In the world of DeFi, Ethereum currently accounts for 60% of all total value locked (TVL), one of the most important metrics for blockchain performance. By way of comparison, its chief rival Solana (SOL -4.85%) has only a 4% market share. Other up-and-coming rivals -- such as Sui and Aptos -- barely show up as blips on the radar. Thus, this group of \"Ethereum killers\" could pose less of an existential risk to Ethereum than originally feared.\n\nNew blockchain upgrades\n\nI can't think of another cryptocurrency that gets more attention for its blockchain upgrades than Ethereum. It has followed up The Merge (a massive blockchain upgrade) with a number of smaller technical upgrades meant to make its blockchain faster and cheaper to use. Last year, we had Shapella. Earlier this year, we had Dencun. And now the buzz is building for the next upgrade, known as Prague-Electra.\n\nThere are two reasons these stepwise upgrades are so important. First of all, they make it easier for Ethereum to fend off its rivals. Yes, Solana might be faster and cheaper to use right now, but Ethereum is doing everything in its power to narrow the gap. The ultimate goal is the ability to process 1 million transactions per second, and each new upgrade brings Ethereum closer to this target.\n\nAlso, each new upgrade helps to build confidence in Ethereum's roadmap for the future. Unlike other cryptocurrencies, which often seem to have a helter-skelter feel to their overall development, Ethereum lays out a roadmap at the start of every year and patiently explains how all the steps in this roadmap fit together. I've always viewed this process as similar to the way that publicly traded corporations give guidance about upcoming results.\n\nHow high can Ethereum go?\n\nGiven these three factors, I think there's a reasonable chance that we could be talking about a new all-time high of $5,000 for Ethereum sometime by early 2025. That's a 40% gain from today's price of $3,500.\n\nBut $5,000 may be entirely too low a future projection for Ethereum. It's not hard to find analysts predicting a price of $10,000 for Ethereum. And investment firm VanEck thinks Ethereum is on a rocket to $22,000 by the year 2030.\n\nIn many ways, this depends on how well those new spot Ethereum ETFs perform. If the end of summer comes and they still are not trading, or if new investor inflows disappoint, then it might be time to tamp down expectations. If you are comfortable with assuming that risk, it could be time to start thinking about investing in Ethereum while it's still trading below $4,000."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQUm8zZi0zLVotNW9MX0pxSzlrLUNZYU52ajVXZ2h4cE1ENXp4V0plWUUyWFdTLXV4SmZoRFhwMUFCNVFYcGFwRXZselNxS3g4QUtsdWVxWndPX0RpbnhqTHJieVhKMVkzWGpPdHdndU41cmdudzEyVm5QOFNqdkdhQVZWd1gxb2FtODNEMVd1allPYTBrUm5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "When can investors buy Ethereum ETFs? Here are four clues - DLNews",
        "content": "Eric Balchunas has updated his odds on when spot Ethereum ETFs will start to trade.\n\nBut it’s not the only sign that the funds may start to trade very soon.\n\nUS spot Ethereum exchange-traded funds are almost here.\n\nWhile the official launch date isn’t yet set by the Securities and Exchange Commission, options traders, bettors and analysts offer clues suggesting that they may begin to trade over the next two weeks.\n\n“The general market consensus is that these ETFs will be launched sooner rather than later,” Jamie Sly, communications manager at crypto data firm CCData, recently told DL News.\n\nThat’s huge for the crypto community.\n\nEthereum surged 35% to $3,900 in May after the regulator green-lit the first stage of the applications.\n\nMarket watchers hope the upswing was just the start of a bigger wave.\n\nThe bet is that the final approval will enable the cryptocurrency to break its $4,800 all-time high from 2021 — replicating the success of the spot Bitcoin ETFs launched in January.\n\nSEC’s Gary Gensler\n\nSEC Chair Gary Gensler delivered the first clue during a Congressional hearing last week.\n\nJoin the community to get our latest stories and updates\n\n“I would envision sometime over the course of this summer,” he said.\n\nProspective issuers are working through the final step of the application process.\n\n“That’s working smoothly,” Gensler said.\n\nBloomberg’s Eric Balchunas\n\nFollowing Gensler’s comments, Bloomberg Intelligence analyst Eric Balchunas estimated spot Ethereum ETFs will launch by July 2.\n\n“Decent chance they work to declare them effective the next week and get it off their plate before holiday weekend,” Balchunas tweeted, referring to US Independence Day on July 4\n\nBettors\n\nBettors are also becoming more bullish.\n\nOn betting platform Polymarket, odds that the ETFs will begin trading on July 4 have jumped from 28% last week to 76%.\n\nElsewhere, JPMorgan analysts suggest that spot Ethereum ETFs will start to trade around July and August ahead of the US election as crypto becomes a political issue.\n\nTraders\n\nTraders have poured nearly $240 million into bets that Ethereum will reach an all-time high of $5,000 before the June 28 expiry.\n\n“This positioning is being driven by traders front-running the launch of spot ETH ETFs,” Jake Ostrovskis, OTC Trader at Wintermute, recently told DL News.\n\nCrypto market movers\n\nBitcoin is down 2.1% over the past 24 hours to $65,270.\n\nEthereum is down 2.5% to $3,500.\n\nWhat we’re reading\n\nEric Johansson is DL News’ News Editor. Got a tip? Email at eric@dlnews.com."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13amR4SzFmSDZXZFA2RlVYaUpFdGhpcjVlZmZfVHRUd3B4NXRweklqWEpaU18waWJfNEpXYUJtVW4zdGp2akZGeWlKd3liOGtEcFVNVk1wdi1tSVJiemNTVEtqTU1nY2NvdGlsc1RWUFBLOFZvbHl6aFBoN0w2S1XSAYQBQVVfeXFMUHM3a2pWbHc0SDZnWVBQVHFiZFlJZm55YTFrU2pRcVVtSTE2ZENOTzNmaVUtS1FFTkJ2MzAtNGJZUi1FWG44RVMyV2JzMnQtMDkxaXVpLVdoQ0VTOWZMSTVsV3BTOXViakc5bkxHU0gxWDVidTdCdF84ZTFmQkZsVDNMTTVv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Hit $5,000 After Major Move, Says Top Analyst - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a bold prediction that has captured the attention of the crypto community, prominent analyst Jelle has forecasted Ethereum (ETH) to reach an all-time high of $5,000 by the end of the year. This comes on the heels of ETH successfully turning the $3,500 level into solid support, a milestone Jelle highlighted in a recent tweet .\n\nAdvertisement\n\nCurrently, Ethereum is trading at $3,540, reflecting a slight decline of 0.33% over the past 24 hours. Despite this minor dip, there has been a significant increase in trading volume, which has surged by 22.88%, amounting to $12,881,843,193. This uptick in trading activity signals growing investor interest and potential momentum for Ethereum in the near term.\n\nAnalyst optimism amid market trends\n\nAlthough Ethereum has experienced a slight bearish trend recently, market analysts remain optimistic about its future performance. Jelle’s prediction is based on recent price action, where ETH turned the $3,500 level into a critical support zone. This technical development is seen as a positive indicator , suggesting that Ethereum has the potential to push higher in the coming months.\n\nA major catalyst for Ethereum’s projected rise is the anticipated launch of spot Ethereum exchange-traded funds (ETFs). Expected to start trading within the next couple of months, these ETFs are likely to attract substantial institutional investment, providing a significant boost to Ethereum's price. The introduction of spot ETFs is seen as a pivotal moment for ETH, potentially leading to increased adoption and market confidence.\n\nAdvertisement\n\nHowever, Ethereum’s journey to $5,000 is not without challenges. The crypto market is inherently volatile, and various factors, including regulatory developments and macroeconomic trends, could influence its trajectory. However, the underlying fundamentals of Ethereum, coupled with its growing ecosystem and the upcoming launch of spot ETFs , provide a strong foundation for potential growth.\n\nIn addition to the technical analysis, Ethereum’s development continues to progress. These advancements are expected to enhance the network's scalability, security and sustainability, further solidifying Ethereum’s position on the market. As the market evolves, all eyes will be on Ethereum to see if it can achieve this new milestone and redefine its place on the cryptocurrency landscape."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFAxS3hZQW1CQk5KMGpvNmFTbmg4VnlkbC1SbllxZExpN28zRHNnNE9ocDFnOE9WV0t4Tm1ZSkU5eWxsaERVMl9RM1VTakJIX1M2MmI4RHY1VHBjYnNWbDNGbFF3VDFZOWdHUWYzdGdwTVgzQXdVM2lxSWViaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin dominance reaches 56%, showing cyclical performance trends over Ethereum - Crypto Briefing",
        "content": "The ETH/BTC ratio has reached its lowest point compared to previous cycles, signaling a broader shift in market dynamics.\n\nShare this article\n\nWhile Bitcoin’s price continues to trend downward, its dominance in the general crypto market has, in contrast, surpassed 56%.\n\nAt the time of writing, Bitcoin is down 11% from its most recent all-time high. According to data from Glassnode, the level of dominance that Bitcoin is now displaying was previously observed earlier in April this year.\n\nNotably, however, this dominance level was last observed consistently in April 2021. Such a gap indicates a critical shift in market dynamics.\n\nAs a result of Bitcoin’s increasing dominance, the Ethereum to Bitcoin (ETH/BTC) ratio has been decreasing. Current trade ratings are at 0.052, down 2% year to date, signaling Ethereum’s underperformance relative to Bitcoin. The current cycle’s performance trends negative, making it the least conducive cycle for Ethereum returns in Bitcoin.\n\nThe current ETH/BTC ratio hovering at 0.052 reveals interesting patterns since the previous cycle’s low, observed in June 2022, when the ratio dropped to 0.054 and briefly below 0.05. By comparison, the September 2019 ratio for ETH/BTC was at 0.016. This means that Ethereum has underperformed against Bitcoin since at least the 2022 cycle. For context, Ethereum has outperformed Bitcoin by over 200% in prior cycles.\n\nEthereum’s underperformance in the current cycle may be attributed to various factors, such as the growing competition from other smart contract platforms, the delayed implementation of key upgrades like sharding, and the increasing regulatory scrutiny faced by the crypto industry as a whole.\n\nSuch a trend highlights a consistent decline in Ethereum’s relative performance across cycles, raising questions about the consequences and future dynamics between the two largest market cap cryptos."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFA3UF91bEMzd29sVjl3aE9weTNLR3UzcWw1RWluVHVkYU4xd242WW1vanp3NWM3YUg1NXdoNVBrb1Zyc3FHR21PZGpaYlFFeUs3QWx5TWxJN1EzUWxLb2JYZWtONUNzaUIzamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Poised For $5,000 Surge Amid Rising Demand, Analyst Forecasts Bright Future - TronWeekly",
        "content": "Ethere­um (ETH) continues to captivate the cryptocurre­ncy market, driven by robust technical indicators and optimistic fore­casts from top analysts. Dr. Magic, a renowned crypto analyst, rece­ntly shared a bullish outlook on Ethereum, highlighting ke­y metrics such as increasing spot premium, rising ope­n interest (OI), and declining funding rate­s. These factors signal a strong potential for Ethe­reum’s price surge.\n\nThe­ spot premium for Ethereum, which me­asures the differe­nce betwee­n the spot and futures prices, is rising. This sugge­sts strong buying pressure in the spot marke­t, indicating growing demand and bullish sentiment among trade­rs. According to Dr. Magic, the Velo Premium chart confirms this tre­nd with a noticeable increase­ in green bars.\n\nEthereum Poised for $5,000 Surge Amid Rising Demand, Analyst Forecasts Bright Future 4\n\nAnother optimistic sign is the­ increasing open intere­st (OI), which denotes the total numbe­r of outstanding derivative contracts. A rise in OI indicate­s greater capital inflows into the marke­t and increased trading activity. The Ve­lo Aggregated Open Inte­rest section of Dr. Magic’s chart shows a steady incre­ase in candles, pointing to greate­r price volatility and investor intere­st.\n\nAdditionally, the funding rate, a periodic payme­nt based on the differe­nce betwee­n the perpetual contract marke­t and spot prices, is trending downward. This makes holding long positions che­aper, thereby ince­ntivizing more buying. The Velo Aggre­gated Funding section illustrates this tre­nd with diminishing green bars, further supporting the­ bullish sentiment.\n\nSpot ETFs Could Propel Ethereum Higher\n\nA major factor that analysts belie­ve will boost Ethereum’s price­ is the imminent trading of spot ETFs. Expecte­d to start within the next few we­eks, these ETFs will provide­ traditional investors with easier acce­ss to Ethereum, potentially le­ading to an influx of institutional money into the market. This could furthe­r enhance demand and drive­ up prices.\n\nProminent analyst Jelle­ has also projected a bright future for Ethe­reum, forecasting it to reach an all-time­ high of $5,000 by the end of the ye­ar. This bold prediction is underpinned by Ethe­reum’s successful transformation of the $3,500 le­vel into solid support. Such a technical milestone­ is seen as a positive indicator, sugge­sting that Ethereum has the pote­ntial to push higher in the coming months.\n\nEthereum Poised for $5,000 Surge Amid Rising Demand, Analyst Forecasts Bright Future 5\n\nAlthough Ethere­­um has recently expe­­rienced a slight bearish tre­­nd, market analysts remain optimistic about its future pe­­rformance. The $3,500 leve­­l has become a critical support zone, indicating pote­­ntial for upward movement. Analysts like Je­­lle believe­­ this technical developme­­nt strongly indicates Ethereum’s ability to rise­­ in the coming months.\n\nEthere­um faces challenges on its journe­y to $5,000 due to the volatile nature­ of the crypto market, influence­d by regulatory changes and economic tre­nds. However, its strong fundamentals and continuous de­velopment efforts form a solid base­ for future growth, potentially reshaping its role­ in the industry amid market shifts and anticipated de­velopments.\n\nRelated Readings | Altcoins Set to Explode: Analyst Predicts Major Bull Market Breakout"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNFA4OElPOUJvaDlBUmNQUHFRcnBMX2hUVjZIZ2R6VnBSUlFHcURmNnhzeXZRTU5zMW43eWNweDNpcU5JRGlEc2piRkFlMXUzeVBqN0JWTmpnTGFBVHFOOFA4WXV5MmMwSGR6MFlxMDBSdVZzbmkzalBxZjc3eGpGWVJpczJUZmx3YmpJOGYwamFvUGRrbkhxRVJCbkctV3dkQm1rNDBnN0ItOE04Wmk1TXZqdW9GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "ETF on Ethereum: Bloomberg’s forecast on the launch is anticipated to July 2nd - The Cryptonomist",
        "content": "The Bloomberg analyst, Eric Balchunas, continues to update the general public on the highly anticipated launch of spot Ethereum ETFs in the USA, moving his prediction to July 2.\n\nETF on Ethereum: Bloomberg’s forecast for their launch is now July 2nd\n\nThe latest update from Eric Balchunas, analyst at Bloomberg, states a new forecast for the launch of spot Ethereum ETFs in the USA for July 2.\n\nThis is an anticipation compared to what was previously stated, which was July 4th.\n\nMakes sense. What I heard: issuers still waiting to get comments from Corp Fin on S-1s which they handed in 2wks ago. Corp Fin is just looking at these docs for first time (why? bc of the (highly likely) political last min 180 (remember they were as surprised by this as anyone… https://t.co/N32N6jFXBv — Eric Balchunas (@EricBalchunas) June 13, 2024\n\nUPDATE: we are moving our launch date for the Ether Spot ETF to July 2, having heard that the Staff sent comments on the S-1s to issuers today, and that they are quite light, nothing major, asking them to return within a week. There is a good chance they are working to declare it effective the following week and get it out of the way before the holidays. Anything is possible, but this is our best guess at the moment.\n\nIn practice, the new forecast date for the launch of spot ETFs on Ethereum, by Bloomberg’s analyst, is based on the comments from the staff of the United States Securities and Exchange Commission (SEC).\n\nSuch comments are addressed to the issuers of the Ethereum spot ETFs, who are awaiting a response on their S-1s, for which it seems there is a good chance that the SEC will work on them for implementation as early as next week.\n\nEthereum spot ETF and Bloomberg forecasts: the new launch date is July 2\n\nJust the day before the publication of this update, Balchunas di Bloomberg had shared something quite different.\n\nIn fact, the issuers of spot Ethereum ETFs had not yet received a response, and for this reason, the analyst had postponed his previous forecast of July 4th.\n\nThe journalist from FOX Business, Eleanor Terrett, had also published the details on this topic. Basically, it seems that Gary Gensler, Chairman of the SEC, would have stated “during this summer” and Senator Bill Hagerty “by the end of this summer”.\n\nIt was May 23 when the SEC had approved the eight 19b-4 filings for the listing of spot ETFs on Ether in various US exchanges. Unfortunately, however, the real launch on the stock exchange can only occur when there are approvals for the S-1 registration statement.\n\nMark Cuban’s thoughts on the SEC Chairman\n\nIn the meantime, Mark Cuban, the pro-bitcoin and crypto billionaire investor, has publicly stated his thoughts on the SEC Chairman, Gary Gensler.\n\nIn practice, Cuban sees that Gensler’s actions are an obstacle for Joe Biden’s election to the presidency of the USA.\n\nThis is because the President of the SEC continues to act against crypto, leaving that the young crypto holder voters will pass their vote to other candidates.\n\nOn the contrary, in fact, there is Donald Trump who seems to use the crypto sector as an integral part of his election campaign, declaring himself in favor of its growth."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNSXo0Y0t5VGd4aU9jOW4yd1ZHQS1JMWJ6RHMzN1N4WUtzeVItb2FZWVoxalU3emNmODQ0emg4X3VYMUlFZGl6WmVXNy0zT0xOaGFzUE1YOGFINF9aMDhzRXZNSjIyZDVvSkFPSldwV3dGUzhKbnczTDA0SGtDbEVTM01FQ0EtRzN6emIyRmtpX2dpMUNsNTlWRWhqbTcwb2V3ZmtoMlo4WjlUUGlFNl9RaG5MbkJkWXVoZ1lIWE9vUzEzZGhvalHSAcsBQVVfeXFMT1FJa1hKbWREOHJNdW1hRUppNjRzQ1l4c1hBV2FWR1VYcXZkQm85MHlDY2c3ZHhMUlV0SnNzeXRZWXd2YV9qcEl4WEdmSzN1b1dUemcycU54YjNJeWVHaEN0RmxvZGRKMllQMGlpejlzaFdlbzFsa0hySlhqQ1NlMFN3US1oeHktckR3M1AwQ3E0Z0E5cnpsRUJXM0VzU2x1TXRpTlI5eU0xNFR0dHRaT3g0TGJPTE82WkFvdnI0RXc4blJYT0g0V0ZkUlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF anticipation wipes nearly $70 million worth of ETH - FXStreet",
        "content": "Ethereum positions worth $70 million faced liquidations in the last 24 hours.\n\nETH bulls seem to have paid a heavy price for their impatience.\n\nSpot Ethereum ETF approval could push Ether's performance on par with the rest of the top five cryptocurrencies.\n\nThe cryptocurrency market has been on a downtrend for nearly two weeks but Monday’s events showcased how impatient Ethereum (ETH) investors are. In a downtrending market, traders are usually looking for signs of reversal to maximize profits. But sometimes, false signals might end up trapping many eager bulls, and Monday was one of those days.\n\nWhile $19.81 million Bitcoin (BTC) longs were wiped on June 18, a whopping $39 million ETH longs faced the ax.\n\nBTC vs. ETH liquidations\n\nAdditionally, in the past 24 hours, total liquidation for Ethereum has hit nearly $69 million while that of Bitcoin hovers around $47 million. This widespread gap further adds to how impatient ETH holders are.\n\nLiquidation heatmap\n\nEther’s underperformance\n\nDespite the spot Ethereum ETF approval on May 23, Ethereum price rallied by less than 30% before the ETF-induced momentum was lost. Since setting up a local top at 3,977 on May 27, ETH has crashed 14% and currently trades at $3,418. Ether’s lackluster performance can be clearly seen when comparing the returns posted since 2023 with the top five cryptocurrencies based on market capitalization.\n\nSolana (SOL) tops the chart with a 1,274% gain since 2023. Following SOL is Bitcoin, with Ethereum grabbing the third spot with an 182% return. Despite being the second-largest cryptocurrency in terms of market capitalization and ETF approval, ETH still lags behind BTC.\n\nBTC, ETH, SOL, BNB, XRP performance\n\nThis is the second reason why Ethereum investors are eager to see ETH perform. With every potential uptick in buying pressure, traders tend to open long positions, hoping for the start of a magnificent rally. Between June 14’s low and June 16’s high, ETH rallied 8.67%, which was a relatively big jump in comparison to other altcoins. In line with this rally, the Open Interest (OI) also jumped from $14.69 billion on June 14 to $15.80 billion on June 17. However, the recent liquidation event has brought the OI back to June 14 levels.\n\nETH OI\n\nEthereum’s underperformance has played a pivotal role in attracting eager bulls, the partial approval of spot Ethereum ETF is another reason for making investors impatient.\n\nEthereum’s ongoing ETF approval could drag on\n\nUnlike the Bitcoin spot ETF approval, which took years to happen, the Ethereum spot ETF was given a go sign rather quickly by the U.S. Securities and Exchange Commission (SEC). But this approval wasn’t 100%, as the SEC only approved the 19b-4 forms for eight spot Ethereum ETFs from issuers like BlackRock, Fidelity, and Grayscale.\n\nWhile this development was a major win for ETH enthusiasts, but the issuers still need to get their S-1 registration statements approved by the SEC. Only after the S-1 forms are approved can Ethereum spot ETFs begin trading. Depending on feedback from the SEC and multiple revisions, it may take several weeks. However, estimates from Bloomberg ETF analyst Eric Balchunas, the S-1 forms are likely to be approved before July 2 and the trading could start as soon as the next day."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdWVLSDRJT3pwRUVnSmFGSzhhTWN6OGdpVEVDYTYzTDZSVXRyam1IRmZvNDlIVkVoUDRYY1A0YnIzN2JDcDFfVl82VFpIMG1rOWd0YUF0QnRIOVJJLURDTGx0LWtnSHBQT0F5aHdrRHFmT0RTQk1xVm01WVJ2T01hQ0duRDdqY2VqWWFkQWVLdk1nb3hyamhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Report Highlights Ethereum’s Potentially Dangerous Back-end - Brave New Coin Insights",
        "content": "Report Highlights Ethereum’s Potentially Dangerous Back-end\n\nThe Liquid Collective and Obol report says these correlation risks may impact the effectiveness of a major upcoming upgrade called Pecta, which is set to be implemented in 2025. The report says that for Ethereum to remain stable — cloud, operator, and client diversity needs to be improved.\n\nThe report, “Ethereum’s Correlation Risks: Poorly Understood, but Always Present”, explores risks like Ethereum’s slashed correlation penalties. Ethereum, like other Proof-of-Stake networks, disincentivizes bad validator behavior through slashing. If a validator messes with the network by, for example, double-signing a transaction, they lose their stake.\n\nWhat makes Ethereum different is its correlated slashing model, where if more validators are slashed at the same time, each validator loses more stake than if they had been slashed separately. This model becomes ineffective and dangerous if a single operator in the network controls several nodes. The report states that multiple nodes deployed by the same operator are likely to have similar staking practices.\n\nThe report says there are several non-malicious reasons for nodes to be slashed including – Geographical cloud outages, bugs in client software, or unintentionally long downtimes. If an operator was to get large enough, an accidental slashing event could implode the network.\n\nThe report says this risk is further compounded by issues such as;\n\nThe popular client Geth is used by 84% of the network. If it were to crash or have a bug, the consequences would be severe. Diverse client usage would mitigate this risk.\n\nPotential for regional AWS outages or policies affecting large chunks of the validator set. A greater geographical distribution of servers and operators using more cloud providers would mitigate this risk. As the image from the report shows, the Ethereum validator set is concentrated in Western Europe and the continental United States.\n\nThey note these concerns, alongside the limited adoption of Distributed Validator Technology (DVT). DVT is a form of validator security that spreads out key management and signing responsibilities across multiple parties, to reduce single points of failure and increase validator resilience.\n\nThe report also encourages future Ethereum Improvement Proposals (EIPs) to refine language around correlation penalties to mitigate risks further.\n\nQuestions About Solidity\n\nFurther to the validator and correlation issues raised in the Liquid Collective and Obol report, in a recent episode of The Crypto Conversation, Sui founder Evan Cheng also pointed to the Ethereum’s programming language Solidity as questionable from a security perspective. “People talk about security, but they still use, for example, Solidity. Well, let’s just be frank, from somebody with my background I can tell you Solidity will never, ever, ever be safe. It’s like, it hurts me. The first time I saw Solidity, I was like, no way, this is wrong. The software is written in a programming language that allows dynamic behavior which is not analyzable. So, you know, all these problems we’re seeing with reentrancy [editor’s note: reentrancy refers to a vulnerability that can occur when a smart contract function makes an external call to another untrusted contract], you know, it’s too fundamentally broken on that front. That this is what I mean by Solidity will never be safe. And this is why we are seeing and will continue to see these hacks happen, right? Because it’s the dominant smart contract language and it’s really, really bad.”\n\nConclusion\n\nCritics say to secure Ethereum’s future, it is essential to address these correlation risks by enhancing cloud, operator, and client diversity, while also continuously refining security protocols and adopting innovative solutions like Distributed Validator Technology. Only then can Ethereum ensure its resilience against potential threats."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxONFlsbG9EQU9mNm5GSDlzNll1aldNTGFocTQtUl9yVkJ6TnNWTjVHNVN2NnFWaldNZUJMRldTSTlHRU9zV0FjdFlyVWFDVnZZS0QxdC1pSzJuRHhxZWctVkhPQ3NnU0FraTFya1d2RDl0dWJ2a2M4Q2x6dUVlQjEwb1lTbGZmNE9SWUNyZFFzeUl1enJZNGxjSjNxbmJpZGFKVnQ3OWc0NlFsZTlVdmRoQnA5bWExUHlSbEJ4TW10TklxYlQwbVJ4WVoxQm1SOG5jeW02aXBVdmtGek4ydTMyTXExWkF0U0hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Popular French Magazine Paris Match Converts Iconic Photos Into Ethereum NFTs, Puts Them For Sale In Auction - Benzinga",
        "content": "Paris Match, considered one of the best outlets for photojournalism, plans to auction some of the most iconic photos from its archives as non-fungible tokens.\n\nWhat Happened: The French weekly news magazine said that the auction, beginning Monday, will have 75 NFTs for sale, all of which were created on Ethereum ETH/USD, the blockchain known for housing some of the biggest collections like CryptoPunks and Bored Ape Yacht Club, reported Decrypt.\n\nSome photos selected for Monday's auction included The Rolling Stones, Jack Nicholson, Orson Welles, and John Travolta. News reports on watershed events like the Berlin Wall were also included.\n\nThe opening bid for photos began at 0.3 Ether, worth $1,148 at the time of writing. Along with the NFTs, the owners will also get physical prints of the photos.\n\nAs with other assets in this category, Paris Match NFT owners will have full digital license rights to the photos.\n\nWhy It Matters: The development coincides with an increased desire to convert entities with important historical and artistic significance to NFTs.\n\nEarlier this month, digital asset investment firm Galaxy Digital announced the tokenization of a nearly 300-year-old vintage violin once owned by Russian royalty. The tokenized version was used as collateral for a loan.\n\nThe global NFT sales volume surged 45% to $19.25 million in the last 24 hours, according to CryptoSlam. The total number of sales rose 11% to 193,714.\n\nEthereum clocked the highest sales at $7.19 million, followed by Polygon MATIC/USD and Bitcoin BTC/USD.\n\nRead Next: Deutsche Telekom, T-Mobile’s Parent Company, Will Mine Bitcoin"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE02YXg4RkJabXAxdlZTWmdLX1JGR2xtbmIyeVpMLWRsZ2paeFhkbTRxTXIxb2o0Y2U3SmNRdUJIa2FuZUZjdTktQXlHS242ZHBwOTNXeGt2TnllYk5oOU5JVjE3a3ZxXzlGQ01MclMzLWdTQVFzMGfSAXtBVV95cUxQZmRpMDNMajJESVo4dHRNd0dNOEFndnJuXzRaUEhHMVNuTW41MGV2bjF4X3NZay1FbVZBSzk5NzYxa0d4T0w1dkNQZ0JzUFlHT0RBUEsyZWVHZFhlZ05acVNrRmQzRkY3WW41YlJvYU85SE5xWlBseUtBZE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Hybrid Bitcoin and Ethereum ETF Proposed by Hashdex - U.Today",
        "content": "Brazilian cryptocurrency asset manager Hashdex intends to launch a hybrid spot exchange-traded fund (ETF) that tracks the value of Bitcoin and Ethereum.\n\nAdvertisement\n\n\"The Shares are designed to provide a straightforward means of obtaining\n\ninvestment exposure to bitcoin and ether through the public securities market, as opposed to direct acquisition, holding, and trading of spot crypto assets on a peer-to-peer or other basis or via a crypto asset platform,\" the filing says.\n\nAdvertisement\n\nHashdex plans to simultaneously use at least two custodians for the ETF (BitGo and Coinbase).\n\nThe Hashdex Nasdaq Crypto Index US ETF will be capitalization-weighted, with Bitcoin (BTC) accounting for 70.54% of the portfolio. The weightings will be adjusted on a quarterly basis to reflect changes in market value.\n\nHashdex also did not rule out that other digital currencies will be added to the mix. However, such changes would need to be approved by the SEC first.\n\nThe asset manager's Brazil-based crypto index ETF includes such assets as Solana (SOL), XRP, Cardano (ADA), Litecoin (LTC), and Polygon (MATIC) on top of Bitcoin and Ethereum.\n\nAs noted by Bloomberg Intelligence analyst James Seyffart, bringing such a product to the US would make \"complete sense as a future goal.\" He opined that \"people who believe digital assets have broader use than just what Bitcoin currently offers,\" adding that such a product would make \"a ton of sense\" for advisors that want diversified exposure to the cryptocurrency space.\n\nAs reported by U.Today , Hashdex withdrew its ETF proposal that was supposed to combine futures-based Ether contracts and spot-based Ether in late May.\n\nThe approval deadline for its new proposal should be around March 2025, according to Seyffart."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPVGQzZ0pETDFsWUlJWl9SZ0RieERPa1RocmJHSklETlQxZlVjRmxHQlhnTThWRUhGcE93eWJ1UHl3b2c2cFlKcTdrcU9FMG0zcGlFb3BCTHI0UkswTmgxLWdmTXU3WWs4aWNDa0hHRFZ5TElMMGYyZXpTZ3k5ZWVsOE1lNllpUUlXc1FoU2JiRV_SAZgBQVVfeXFMTXRocjRoWWFfMXdIcmVRY2xncGszdG9hc0ZoNC1rMmtDUmpPck01UWdQU3UzMFo0RUR2V0gya3IyRkVXbzFadEFFR0dsOXRSbFpqTUJxQldId0V0TVNISEdRNmVyVGoyYVpBbzF3Q2xpLTN6LVBoNXF0cDhCQ08yRzZuVVBnNlV2cFQ0SGd0cm92VXpzclJqYTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Dogecoin, and Ethereum Volatility Drive $290 Million in Liquidations - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nVolatility in the prices of Bitcoin, Ethereum, and Dogecoin today didn’t substantially affect most traders, as each of the three cryptocurrencies ended up roughly where they started by Monday evening. But price spikes along the way appear to have triggered a wave of crypto liquidations—over $290 million worth across the market.\n\nEthereum led the pack, with about $58.9 million worth of liquidations triggered by ETH’s price movement in the last 24 hours, per data from CoinGlass. The majority of ETH-related positions liquidated on Monday were longs.\n\nWhile ETH only fell 2% overall on Monday, the token did briefly fall below $3,500. Though that dip was tiny (ETH only fell $12 below $3,500 at its lowest point today), and the token soon recovered, the crossing of that line may have triggered a wave of liquidations.\n\nDogecoin experienced a similarly minor but significant drop today. The world’s top meme coin only briefly fell below $0.13 today, before recovering in a matter of minutes. But that dip appears to have triggered a massive wave of long position liquidations for the token. Over $44 million worth of DOGE long positions have been liquidated in the last 12 hours alone.\n\nAD\n\nAD\n\nDOGE is down 3.6% on the day overall.\n\nBitcoin, meanwhile, was crypto’s third-biggest target for liquidations today—with short positions constituting a thin majority of positions liquidated.\n\nIn the last 24 hours, some $21 million worth of BTC short positions—and $19.86 million worth of long positions on the coin—have been liquidated.\n\nThough the price of the world’s top cryptocurrency has ended up, at writing, almost exactly even from where it stood a day ago, BTC briefly shot up past $67,000 on Monday afternoon, in an unfortunate development for those betting on the token’s downward trajectory. BTC now sits, at writing, at $66,376.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNeUdWNGNycjJGSlZ1Z1Q5OUJZRjR3ZWR5bTNsX1ZTVVgzTWh3RVJRVmhEQkZRQkk1R1ptUXZiaUppam5kaENOVWlZODc5UHRFdm9ZOTFmdzc0bTRyaXJiOE1HRzZWN01vUUxYaEpjU3ltUld6Ni1TNi1BYWxJeXR3Nl9Vc0pQd9IBjgFBVV95cUxNY2gzREhnSWhWS0VldVQxSnowb04ySXg3aVBEQXQyLVYzZUxQVkJRaERGUEkwTFZCOXg4NFIwdWpaNld6Ql9XcmV5dS04VFVUWS02SmxSWjZQM0cxbnYxaXNaSU5pelZzRXdMRVU3emhST21BNmp0OXJRRlY2YkplMnNReU5xYzhjbmxHSHlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Dive as Crypto Liquidations Near $500 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the prices for Bitcoin, Ethereum, and other cryptocurrencies stayed in the red late Monday, investors saw nearly half a billion dollars in positions liquidated in 24 hours. Of $489 million in liquidations, the vast majority—over $432 million—slammed long positions, according to aggregated crypto market data from CoinGlass.\n\nMost of the day's liquidations came in the past 12 hours, as the price of Bitcoin fell as low as $64,548 late Monday and the price of ETH dipped to $3,384, leaving both down more than 5% over the prior seven days.\n\nThe overnight figures continued a flood of liquidations observed yesterday, vaporizing $290 million in mostly long positions.\n\nAbout 200,000 traders were liquidated over the last day, per CoinGlass. Per the site's metrics, the largest single liquidation order happened on Binance, a $6.4 million long bet on Ethereum.\n\nAD\n\nAD\n\nEthereum led the overall liquidation flood, with $92.5 million in positions rekt over the past 24 hours, as of writing, with CoinGlass showing Bitcoin with $72.8 million in liquidations and Dogecoin (DOGE) with $60.3 million. Shiba Inu (SHIB) and Solana saw $22.9 and $19.8 million in liquidations, respectively, over that same span.\n\nThe volatility of crypto—even with massive institutional investor interest in the case of Bitcoin—often leads to forced liquidations as its fluctuating price defies the expectations or hopes of holders.\n\nA price spike in Bitcoin and Ethereum drove over $300 million in short position liquidations in May, for example, followed by an equally sizable surge for long positions a few weeks later.\n\nEdited by Andrew Hayward\n\nAD\n\nAD\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPdjM0MzZuRWUtaEcxTGNqM0FLNEV2SXBIaWwyRnp6dWFGdW45eWRxOW9QYUJZTUpQNmpLM2NpQmRYNHBlZ1Q0ZFNYZ0VqTi1XUHQwMlB3eHRMc3ljOGV4Tl8zT0I5aXhRWkl2aVVKWENVSHdWRkNFUzBWQXhZRnlTQ3JtN1FTaUxLOGpNaGZacEZxTmRPMEJPVTNMRjhDS3JhM2N6MzJNRlZ2TWxkbjRr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Rising Ethereum futures open interest highlights impact of SEC’s ETF approval - CryptoSlate",
        "content": "Onchain Highlights\n\nDEFINITION: The total amount of funds allocated in open futures contracts.\n\nEthereum futures open interest has shown substantial volatility throughout 2024, significantly influenced by recent regulatory developments.\n\nFollowing the approval of spot Ethereum ETFs by the US Securities and Exchange Commission (SEC), open interest in Ethereum futures surged, reaching new highs.\n\nOn June 17, futures open interest across all exchanges neared 4.0 million ETH, coinciding with a price movement towards $3,600 per ETH.\n\nThe SEC’s approval of Ethereum ETFs marked a significant milestone, signaling increased regulatory acceptance and boosting investor confidence. The introduction of these ETFs has driven notable market activity, particularly in the derivatives sector, with futures open interest hitting record levels due to heightened speculative and institutional involvement.\n\nThis development highlights the strong interplay between regulatory actions and market trends, with the approval of Ethereum ETFs not only enhancing market legitimacy but also potentially setting the stage for further growth in Ethereum’s market infrastructure."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQYmFYUWtLcUR0aXZGYll1NHE4WGl6Q3JNcW1tVFA1X2JyNGVWQmpQZE5SX05aa0UxSkZVTlJpZWZBSklyTmxTUzc4Rkx6eUs5alRzT3FzR3c4VlZ2Y3ZoMFV5QUJGZy1WSHVqLUdJVlNoWXhWd0VFVGZsYVhfV1ZzUnB1YVpVZDZaSTQxdkRBWGR3dUpJOVdJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "New scaling milestone for the Ethereum (ETH) blockchain - The Cryptonomist",
        "content": "In recent days, an important milestone has been reached regarding the scaling of the Ethereum (ETH) blockchain and its layer-2 and layer-3.\n\nJust yesterday, in fact, the all-time high of the number of daily transactions recorded overall on Ethereum’s layer-1 and all its upper layers was registered.\n\nAccording to the data from L2BEAT, the average daily TPS on Ethereum’s layer-1, that is, its actual blockchain, has settled at a modest 13 tx/s, but the overall figure, which also includes the upper layers, has approached 246 tx/s.\n\nJust think that seven days ago the average TPS on layer-1 was practically the same, but with the upper levels it was just 123 tx/s, or about half. At the beginning of the year, it was only 73 tx/s, while the one on layer-1 has always been more or less around 13.\n\nThe second layer and the scaling of the Ethereum (ETH) blockchain\n\nWhat is making the most difference is the layer-3 Xai, a scaling solution for gaming created by Offchain Labs, the company behind Arbitrum One.\n\nJust yesterday it recorded a TPS of over 101 tx/s, followed far behind by layer-2 Base at about 33 tx/s.\n\nIt should be noted that there are two other upper layers that have recorded a higher daily average TPS than Ethereum, namely Arbitrum, with more than 20 tx/s, and Proof of Play Apex with almost 16.\n\nMoreover, both Taiko and Blast are also recording interesting numbers, because they are both above 11 transactions per second.\n\nL2BEAT monitors as many as 74 chains, including layer-1 (Ethereum), layer-2, and layer-3, although for about ten of these it is not managing to collect data.\n\nIn the last twelve months, the daily average TPS of Ethereum has remained more or less constant around 12 or 13 tx/s, while the overall TPS was just 30 tx/s, which is slightly more than double that recorded on layer-1.\n\nAs recently as February of this year, the overall TPS was still only at 40, but after the Dencun update in March that reduced fees on the upper layers, it skyrocketed first to 100 and then recently well beyond 200 tx/s.\n\nThis makes it very clear that by now the majority of transactions within the Ethereum ecosystem do not occur on layer-1 (the native Ethereum blockchain), because there they are relatively slow and expensive, but on the upper layers where they are faster and above all much more economical.\n\nThe fees\n\nThe average cost per transaction on the Ethereum blockchain yesterday was over $2. Five days ago, however, it was over $6, and a good ten days ago it had risen to almost $9. Not to mention the fact that on March 5th it skyrocketed to over $30.\n\nInstead, according to the data from L2BEAT, yesterday on Base the average cost per transaction was 0.4 thousandths of a dollar, or 0.0004$.\n\nOn Optimism it was 1 thousandth, and on Arbitrum slightly above 2 and a half thousandths.\n\nThe difference is truly remarkable, and this is due to the fact that on layer-1 it is not possible to reduce costs by increasing TPS, while the upper layers can scale much more easily.\n\nIt should be remembered that the average cost of a single transaction depends on the level of network congestion, so a network that supports higher TPS can clear the queue of pending transactions much faster, greatly reducing congestion.\n\nInstead, on layer-1 like Ethereum and Bitcoin it is not possible to increase the number of validated transactions per second, making it very difficult to reduce congestion in case of many requests.\n\nThe price of ETH\n\nThis remarkable increase in on-chain activity has not, however, had positive effects on the price of ETH, also because ETH is used to pay the cost of transactions on layer-1.\n\nAbout ten days ago it had risen above $3,800, but starting from Friday, June 7, it began to fall.\n\nFirst it went back to $3,600, and then it dropped below $3,500.\n\nIn particular, last Friday for a brief moment it had also dropped below $3,400, but at that point, it recorded a quick rebound that in fact then brought it back around $3,500.\n\nThe current price levels are in line with those of mid-April before the early sell-the-news on Bitcoin was triggered about a week before the halving.\n\nAt that time, the price of ETH dropped to $3,000, and then fell below $2,900 during the month of May.\n\nIt then recovered after the news of the possible approval of spot ETH ETFs in the USA (which later happened), but since we are still waiting for their actual debut on the stock exchange, there is still a lot of calm and uncertainty at the moment.\n\nIt is worth noting that the current price of ETH is still 28% lower compared to the all-time highs of late 2021, while for example that of BTC is -% from the all-time highs of March."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOdUpVRkowV1VzQ2VCU3JqN2l6d3NZLWJpbG5pWm1kVUJsNTU1djV4WWJyUk1RQ1k5eTlXb2RTd1dpYlhvczhtZThJVW9HREZOWFVzTTNwYXl3NnU3Nlo3dDJxdGg5bmMwWWlxdU1WeFVmTDhhMnpqTHhsRUNZTjdOOHhyMXM0eEtZajFNcFhJOWZNSS1SM001R2c5dmJ5T2x0Uk94UDBtYTZTSEJVX0ln0gG0AUFVX3lxTE5odDFNT3hwM2xXZTJHd095bGZFTGpfQzg1MVUzNi04QnhuYkFNRldSOFNkdmJOZy1XZjlmODlJNUZHZlBuUVVZblo2ZDVVcFk1UmtLZGExSk9TMTdvcnVpNzlhTGpzVzlYdHY1Wm5IMVZmdnh1QXA1b2N0aEd2R183V2l1SUZGdlNQc29zR0JXVm1Oa2dzNHBnLUpUOS1ZVHJXWU92QW9XQWo2bTUxOGpSZmtMRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Hedge Funds Front-Running Ethereum ETF Approvals, According to VanEck Analyst - The Daily Hodl",
        "content": "Financial institutions are likely in the process of positioning themselves for the launch of spot Ethereum (ETH) exchange-traded fund (ETF), according to a VanEck analyst.\n\nMatthew Sigel, head of digital assets research at VanEck, says that hedge funds are front-running the approval of ETH ETFs in the US.\n\nSigel cites data from K33 Research showing a large spike in inflows to Ether exchange-traded products (ETPs) outside of the United States markets.\n\n“Hedge funds are front-running the ETH ETF approvals, ETH on exchanges is near an all-time low, fundamentals are improving.\n\nI could be eating BBQ HODL hat by July 4th.\n\nAnd you’re bearish?”\n\nSigel also shares a chart from blockchain analytics firm CryptoQuant showing a downtrend of ETH supply on exchanges, suggesting an accumulation of Ethereum from large players.\n\nIn a recent interview with the Bankless podcast, Sigel says that VanEck is viewing Ethereum as an “open source App Store,” and according to the analyst, it’s not completely unlikely that at some point an ETH ETF could become more successful than the Bitcoin ETFs.\n\n“Now that the SEC has at least theoretically approved spot Ethereum ETFs to trade it’s obviously important to explain the investment case for this asset. Overall, there’s a bigger market for income-producing assets than there are for inert assets like Bitcoin (BTC). So it’s not impossible that in a decade, the market for an Ethereum ETF could be bigger than Bitcoin, but in the meantime, we have to educate traditional financial market participants as to why this asset matters.\n\nThere’s a lot of analogies that have been attempted and the one that we’ve honed in on is the ‘open source App Store.’\n\nWe think that Ethereum is a productive asset that lets anyone open a storefront on this network, and they can do so at a lower take rate than Big Tech currently charges. So it’s an open-source App Store with payments functionality bundled in essentially for free, and we wanted to explain the mechanics of how that works and put some numbers around the profit and loss (OPNL) statement of Ethereum.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOZmV5WHVZTDJxeGl5ekpGMHIwMmpTdTI2UXdVckdJSC1zSkdyR19SY3J4bWg5N01YQjJsMXVwYXNYRkRORWw3dWplSEx3aU1IMWNIbU5rNDVlLU1vZ1ByV2QweEt6MllIcnVQbTZPNXByMWI3Y29yUmhvN3Bnc2VGaVBPVmo2a2ozQ0l1TkwybHN5bDJNeFdyMmVWMVp3OUQxSUJmNTVkT0VPdnZERzYyZ29JNzRrb05IR0R0a0MzMld4aDMwb2NWQXAyMEZVYkRSUzVMb0NOT2NpYUFTT2k4MEhlWFJRQk04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Secures 'Momentous' Win After SEC Closes Security Probe: Whale Accumulates Over $19M Worth Of ETH In Immediate Aftermath - Benzinga",
        "content": "ConsenSys, a blockchain software company, announced a major victory for Ethereum ETH/USD, following the closure of the SEC’s investigation into whether the world’s second-largest cryptocurrency is a security.\n\nWhat Happened: On Tuesday, ConsenSys took to X to reveal that the regulator will not move forward with the charges alleging that sales of Ether are securities transactions.\n\nThe announcement followed a letter sent by ConsenSys to the SEC on June 7, asking for confirmation that the Ether spot ETF approvals last month, based on ETH being a commodity, would lead to the closure of the investigation.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we're happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nSee Also: Bitcoin, Ethereum, Dogecoin Go Sideways, But ‘Market Structure Back To Bullish,’ Says Trader\n\nConsenSys emphasized that the closure of the Ethereum investigation, while significant, does not resolve all issues faced by blockchain developers, technology providers, and industry participants under the SEC’s crypto enforcement regime.\n\nThe company now seeks a declaration that its software offering MetaMask Swaps and Staking does not violate securities laws.\n\nThe positive news also got whales excited, with one investor scooping 5,603 Ether, worth $19.6 million, in the aftermath, according to Lookonchain.\n\nAfter @Consensys posted that the #SEC had closed its investigation into #Ethereum 2.0, the whale bought another 5,603 $ETH($19.6M).\n\n\n\nThe whale has withdrawn 16,604 $ETH($59M) at an average price of $3,600 from #Binance since May 30.https://t.co/NYbgSJevaT pic.twitter.com/N3vsISPeyX — Lookonchain (@lookonchain) June 19, 2024\n\nWhy It Matters: In April, ConsenSys alleged that the SEC had been covertly targeting Ethereum for over a year, scrutinizing its nature and whether it should be classified as a security.\n\nIn response, ConsenSys filed a lawsuit against the SEC, arguing that the SEC is overstepping its authority by attempting to regulate Ether.\n\nFor context, the CEO of ConsenSys, Joseph Lubin, was one of the co-founders of Ethereum.\n\nPrice Action: Reacting to the development, Ether spiked 3.32% to trade at $3,549.33, according to data from Benzinga Pro.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Trade In The Red As Summer Doldrums Kick In: Analyst Says ‘We Are Early In The Cycle’"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9fcFQ4TnJ3OE9fdFZ4Ukl4aDByaWwyNE03QTBoLXNFaHFGOXlzcGVjMXNMZHVxVXI4eVRVRVVnczJGS053NVNrTDVTQkZaakZpdGpOc1RXY3RucnpwSmRFNE9tQ3hHY3U4djZaV1pJbnPSAXhBVV95cUxNd0hpbUpQb2xoZloxaDQ2Y1NRQmVZb2ZuNXd1YXNrRTFPY1Y4SGlocFcwRVdYeGpkcjRsTWNIN1JCemVxeWFvblJSeVVsUy1CUi1keGVsWXJIanA4OHBVVWlwaWNxcWdxYWdSbjFoWURxOE5Cb2Z4Um0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Joint ETF Could Come to US via Hashdex - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWe have spot Bitcoin ETFs trading in the United States, while Ethereum ETFs have been approved and should hit the market soon. What’s next? Possibly a joint ETF that includes both of the leading cryptocurrencies by market cap—if Hashdex has its way.\n\nIn a move potentially marking another significant step forward for crypto investment in the States, the crypto asset manager has filed an application for the Hashdex Nasdaq Crypto Index US ETF.\n\nIf approved, it would be the first exchange-traded fund (ETF) to directly hold both spot Bitcoin and Ethereum in the American market.\n\nThe filing, submitted via Form 19b-4 with the Nasdaq, details a fund that tracks the Nasdaq Crypto Index (NCI). The form states that the ETF will include cash holdings, with Coinbase Custody and BitGo designated as custodians if the fund is launched.\n\nAD\n\nAD\n\nThe NCI is a market-capitalization weighted index, meaning the fund would primarily hold Bitcoin (70.54%) and Ethereum (29.46%), mirroring the relative weightings of these two dominant cryptocurrencies.\n\nThis proposed ETF comes amid a year of milestones for crypto funds in the U.S. The Securities and Exchange Commission (SEC) finally greenlit the first spot Bitcoin ETFs in January, and spot Ethereum ETFs received initial approvals in late May. SEC Chair Gary Gensler recently told a Senate committee that he anticipates that they will begin trading this summer.\n\nWhile the Hashdex ETF focuses on Bitcoin and Ethereum for now, the filing clarifies that it would not invest in \"crypto securities, tokenized assets or stablecoins.\"\n\nHowever, the index could potentially incorporate additional crypto assets in the future, provided they meet specific criteria. These criteria could include being listed on a U.S.-regulated platform or serving as the underlying asset for a derivative instrument on such a venue.\n\nAD\n\nAD\n\nHashdex emphasizes a passive investment strategy for the ETF, meaning it aims to track the NCI's performance, regardless of market direction. This signifies an intention to provide investors with exposure to the overall cryptocurrency market represented by the index, rather than attempting to outperform it.\n\nThis filing follows Hashdex's previous efforts to transition its Bitcoin futures ETF to one holding physical BTC directly, mirroring the recent launches of spot Bitcoin ETFs in January. However, the company was unable to secure approval before its competitors' launch in January.\n\nUpdate: A dual Ethereum and #Bitcoin ETF filing from @hashdex just dropped. Will be market cap weighted. Shouldn't be a surprise to anyone -- makes a lot of sense. Final deadline for SEC approval should be sometime around the first week of March 2025 pic.twitter.com/5wB7ucvbgM — James Seyffart (@JSeyff) June 18, 2024\n\nBloomberg ETF analyst James Seyffart noted on Twitter that the final SEC approval deadline for the joint Hashdex application should be around the first week of March 2025.\n\n“There's language in here to allow the addition of other digital assets essentially as they are approved by the SEC,” he added.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5HRnlERUJzdmcxLVBzWlpzbWZHTGh0NS02bXo3LWVFdWFSb0FLdlVjTDZYWDdxYk53ZjlHcjVMOHRXaU9waDVlLUNyeGxjbVQ0el94c3NLTHZWOWNLQTdRcWRpc1Q4Qm1EczFkLTE0NDVrd0hCZnJuM3dIN1UwWnfSAYQBQVVfeXFMUHI4UFl2OC16S0E0NGpaMGxmcXVEczlHNm9HUWROWmRkNWRKTHFxTUd5T21XZjhxLTNPNjVQVnVSWEZSb21DVnAzN2VreGttdlBta1YwT21TUnRvSlJzV2FCSjJUcXVraWN6cXgyT3VrOG9qTVQzQldQYXlaM2pRejk3cEdX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 01:03:49 GMT",
        "title": "Ethereum Analyst Thinks Prices Will Immediately Rally After Spot ETF Approval: Here's Why - Bitcoinist",
        "content": "Ethereum is slipping after printing higher highs over the weekend. Considering price action, the coin is up roughly 5% from last week’s lows but is still trending below the all-important resistance at $3,700.\n\nAlthough ETH holders and traders are upbeat, prices must decisively close above this liquidation level, paving the way for more gains in short to medium term.\n\nWill Prices Plunge After Spot Ethereum ETF Begin Trading?\n\nThe cause for optimism follows the rapid shift by the United States Securities and Exchange Commission (SEC) to approve the first spot Ethereum exchange-traded fund (ETF) in the country.\n\nFollowing encouraging events in May, where the agency approved all 19b-4 forms, the product could go live and be accessible to investors and institutions in two weeks.\n\nWhile there are concerns that the approval of the spot Ethereum ETF could lead to another wave of lower lows, as seen with the spot Bitcoin ETF in January, one analyst is stepping in to reassure holders.\n\nTaking to X, the analyst pointed out that the potential impact of Grayscale selling its Ethereum holdings (ETHE) once spot ETFs go live would be minimal, providing stability and confidence in the market.\n\nThis preview concerns ETH’s current state of affairs and the broader Ethereum ecosystem. The market wasn’t prepared for the United States SEC to fast-track the product’s approval this year.\n\nIn Bitcoin’s case, prices rose sharply from mid-October as the markets anticipated the spot ETF going live in January. Once launched, it became a “sell the news” event, briefly pushing down prices.\n\nMeanwhile, Ethereum prices are turning lower after marked gains posted on May 20 when news permeated to the community of the United States SEC’s scrambling efforts.\n\nEyes On Grayscale And ETHE Discount\n\nAt the same time, the analyst pointed out that, unlike Grayscale’s GBTC before the approval of spot ETFs, the discount in ETHE is narrow and within the 1-3% range. Currently, Grayscale manages over $10 billion of ETHE.\n\nThe tiny discount means traders who bought ETHE for the discount have had sufficient time to sell at near market price. As such, it means that even once a spot Ethereum ETF goes live, selling pressure would be minimal.\n\nStill, only time will tell whether ETH will soar or plunge in the next two weeks. From a regulatory perspective, the clarity that results after the spot Ethereum ETF is released could spark demand, allowing more institutions to gain exposure. K33 analysts predict the product will attract between $3.1 billion and $4.8 billion in net inflows within the first five months of trading.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ManJrQzFMS1QxQXJTWE1hemZkcEFkaGk2QXRPb3Vma2NFdmRkc21wUzc2Wk9seXBDZllJbGlONDQzNnFaN09pXzB1VEhNeVVlb2VvQ1JGcmY0UU1tYmVrcEVuYnhYWjRDOWhCMlctd3RKdHg2MXZWUHFVNFI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum To Surge 50% This Year Against Bitcoin - Watcher Guru",
        "content": "Ethereum is poised for a huge surge this year of up to 50% to rival Bitcoin, according to a new analysis of chain data. According to a technical setup called the inverse-head-and-shoulders (IH&S), Ether is expected to boom over the next few months, mimicking a similar bullish pattern to 2021 where it competed with BTC in terms of growth.\n\nThe IH&S pattern is characterized by the formation of three troughs below a common neckline resistance. These formations are the middle trough (head), which comes to be deeper than the other two troughs (shoulders), which are roughly of the same length.\n\nIf the IH&S pattern resolves when the price breaks above the neckline resistance after the formation of the right shoulder, the price rises by as much as the maximum distance between the head’s lowest point and the neckline resistance. In simpler terms, Ethereum’s growth between 2019 and 2021 followed this pattern. In that period, it competed with Bitcoin in terms of the best-growing cryptocurrency.\n\nAlso Read: Bloomberg Analysts Move Up Expected Ether ETF Launch to July 2\n\nEthereum And Bitcoin To Flip This Summer Following Ether ETF Approval?\n\nOn Monday, the ETH/BTC pair flipped as the head trough appeared. To begin this surge, it will next need to reach the common neckline resistance level at around 0.061 BTC. Upon doing this, Ethereum will be in business and will need to retest the neckline before a breakout commences. This breakout may see ETH boom to new highs in the coming months. You can see these patterns forming on Ethereum’s price chart.\n\nFollowing the latest approvals of Spot Ethereum ETFs, the Ether community is as bullish as ever. The news of the asset being on its way toward public trading fuels its battle against Bitcoin. While BTC remains the biggest cryptocurrency by market cap, Ethereum has always been close behind in terms of trading volume. Many bullish price predictions expect Ether to reach all-time highs next month, as soon as the SEC fully approves ETFs. When trading commences, the asset will possibly see a similar boom to Bitcoin in January 2024."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQcDdaSUt3VE1felRFMGl6U1VDb1NHaVpTVDdneXAxRERZdUQyNEJWSmNjcVg3Wi1sU29qNFRjNzB2WnpUa2VWTFI4UG9vem1YY2lTdDIxYnZwMUZmLTRKZ2pmNlhFT0FfV3JHenBGWktTYWtzZ2hWajRUQ3lfd1BKUWdkZjBJbFFLcG1uNNIBkgFBVV95cUxPaWFYcGdGeWE5MGUwM25VZzRJUmFIOG8xczdyMm41VUI2dlFfempHdTlSQzR5MlVvbl9CMEo5eElZV0hlOTBfbHZ0djZiRTFrZFZncmNrUFN5M3lBN2YzdFU0LWJlbVRfbnd2QXY1OHRJMXpFUHY5ZjkxR3VQNExuRjBNZE5UMVFybG5hVjJUWkstZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum dips as ICO whale unloads: What’s next for ETH traders? - AMBCrypto News",
        "content": "Ethereum’s price fell 2.7% after a $19.3 million transfer to Kraken.\n\nThe transfer indicates possible sell-off activity by long-term Ethereum holders.\n\nEthereum [ETH] has declined by 2.7% in the past 24 hours, trading at $3,442. This marks a substantial decrease from its March peak of over $4,000.\n\nConcurrently, an interesting trend has surfaced within the Ethereum market, with on-chain data revealing that participants from Ethereum’s initial coin offering (ICO) have started to liquidate holdings that are nearly a decade old.\n\nWhale moves and market ripples\n\nRecent on-chain data from Spotonchain revealed that an Ethereum ICO whale has transferred substantial holdings to the Kraken exchange, totaling approximately 5.5K ETH or about $19.3 million.\n\nThis move precedes a notable sell-off that pushed ETH’s price downwards.\n\nFurther analysis reveals that this individual, who originally acquired 150K ETH during Ethereum’s ICO phase at a mere $0.31 per token, has been actively managing their substantial crypto assets.\n\nOver the past few days, this whale has moved 10K ETH, valued at roughly $35.4 million, to Kraken.\n\nDespite these large transactions, they retain about 139K ETH spread across three wallets, currently valued around $469 million.\n\nThe actions of such significant market players often lead to speculation about potential price impacts.\n\nTransferring large amounts of cryptocurrency to an exchange typically suggests preparation for selling, which can lead to price drops due to increased supply on the market.\n\nDiverging signals in Ethereum’s market\n\nIn this case, while there’s an observable correlation between the whale’s transfers and ETH’s price movements.\n\nBroader market data from CryptoQuant indicates a general decrease in ETH being moved to exchanges—down from over 600K ETH in March to under 50K ETH currently.\n\nThis trend suggests that, aside from a few large players, the overall investor sentiment is leaning more towards holding rather than selling.\n\nRecent liquidation data also paints a stark picture of the market’s volatility. In the past 24 hours, Ethereum liquidations have contributed $92.8 million to a total of $465.20 million across various cryptocurrencies.\n\nSuch high liquidation volumes can exacerbate price declines, leading to further market instability.\n\nHowever, it’s not all bleak for Ethereum. Glassnode data shows a rise in new Ethereum addresses, signaling fresh interest and potential support for the cryptocurrency.\n\nThis growth could buffer the negative effects of large-scale sell-offs, stabilizing the price over time.\n\nMoreover, AMBCrypto suggests that current price levels might be nearing a bottom, indicating a potential turnaround in the near future.\n\nIf this assessment holds true, the recent price drops could present a buying opportunity for investors believing in Ethereum’s long-term value."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQYnJWdzU0NjNGdHZQaTFMZ2VkZzlPYWEzazVXczVQaU94cmNQejVaWG9rLXVOV2pzanFlcWQ4LUJyU1p4Zk1VZ1BxNmRLek5pQWIxTmxqWk1pQWV1VEFUOXF1MFQ4Smx6NTRQS2dJak5tSHNhRGlnUFhBZTJENEIwQmFzc2pxeEtIalZVNnFmR29ublVLbkNUQ0szNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Drops 5% Amid ICO Whale’s $19.3M ETH Deposit - Crypto Times",
        "content": "A top cryptocurrency, Ethereum, faced substantial selling pressure, leading to a 5% drop below the $3,400 mark, now trading at $3,438 with a $420 billion market cap.\n\nSpotOnChain, an on-chain data provider, revealed significant activity from an early Ethereum ICO participant who deposited 5.5K ETH, valued at $19.3 million, onto the Kraken exchange just before the price decline.\n\nJust before the $ETH further plummeted 3hrs ago, an #Ethereum ICO participant deposited 5.5K $ETH ($19.3M) to #Kraken.\n\n\n\nNotably, the whale:\n\n\n\n• received 150K $ETH in 2015 at an ICO price of $0.31 ($46.6K),\n\n\n\n• deposited a total of 10K $ETH ($35.4M) to Kraken in the past 2 days,… pic.twitter.com/fzswTXi3yx — Spot On Chain (@spotonchain) June 18, 2024\n\nInterestingly, over the past two days, the same entity transferred a total of 10K ETH, worth $35.4 million, to Kraken. This action is significant considering that the whale initially acquired 150K ETH in 2015 for a mere $46.6K investment, showcasing the immense value appreciation of Ethereum over the years.\n\nDespite recent transfers, the whale still retains 139K ETH across three wallets, valued at $476 million. The downside pressure on ETH’s price, however, appears limited. Ethereum has faced challenges breaching the $4,000 resistance level, leading to a 15% correction in June.\n\nNevertheless, on-chain metrics portray Ethereum’s resilience, notably with a massive 4.1 million ETH withdrawal from exchanges in the past ten days. This reduction places only 12 million ETH, representing 10% of total supply, on centralized exchanges—a level not seen since 2016.\n\nThe bullish indicators, in line with Bloomberg analyst Eric Balchunas’ prediction of the spot Ethereum ETF launching by July 2, suggest that substantial capital inflows into Ethereum may follow, potentially viewing the current price dip as a temporary setback before a renewed upward momentum post-ETF launch.\n\nThe rapid value appreciation of Ethereum, demonstrated by an ICO participant’s significant deposits and the subsequent rise in value, underscores its enduring investment potential."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPZmVDbmhSVEowUm1HZWF3RlNBS0VBczd2dExILUdPb3lKRWVJVy1Db2RXOTlQeWp5VFp1S1lmRThDQ2QxQ0Jla0dGNk9ZSmZKRU9HUXUwUnRzRmNxTjJMN3RFODZQYmo1d3lhRm9oQ3ZGY1dNcmNvdy1uZGZOTFpHZ9IBiAFBVV95cUxQVkhxalFQRjRkTHludS05ckZpaXZndjNzYU51VG50OGQ5ZVlsbThYeVZLMTRidlJJck1DVVZpRE14UjN4dDk0YnF4SVhZSGd1QnJXQ0N5d2lzYVVkZ2Utbk5oV3NaTTRMRWc3WnJCVU05dHBkYVpyUGpnZ1FTM2VaMWpJTmtRVlpp?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Bridge Router Protocol to Wants to Build Its Own L1 With Strategic Funding - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum and BNB chain bridge Router Protocol just closed an oversubscribed funding round to extend the bridge to more networks.\n\nRouter Protocol, a modular cross-chain framework for building interoperable applications. By connecting different blockchain ecosystems, bridges play a crucial role in creating a more cohesive and streamlined network.\n\nIt was launched in 2022 on the Polygon and BSC chains with the objective of making life easier for future Web3 users.\n\nRouter Protocol said in a press release that it has recently raised more than expected funds for further development—but didn't disclose exactly how much. The investment realized from this raise will be used to fuel its own fully operational layer 1 blockchain, thus breaking away from the Binance and Polygon ecosystem.\n\nAD\n\nAD\n\n“Router Chain embodies the evolution of our unwavering vision to build the universal interconnectivity layer between fragmented L1/L2 networks,” Ramani Ramachandran, CEO of Router Protocol, said in a press release.\n\nThe goal, he added, is to do away with complexity.\n\nThe team is “laser-focused on delivering seamless and intuitive user and developer experience for multi-chain applications,” he added.\n\nAccording to Shubham Singh, the CTO of Router Protocol, the ecosystem has experienced tremendous growth with cross-chain projects like FolioX and StakeEase, which have decided to take advantage of the Protocol’s unique characteristics to make a name for themselves.\n\nAD\n\nAD\n\nIn another development, Router Protocol has achieved a significant milestone with the successful launch of Router Nitro. This cross-chain bridge leverages an innovative reverse-verification method to deliver speed and gas efficiency.\n\nSince its launch, the Nitro bridge has facilitated over $350 million in volume, processed more than 650,000 transactions, and attracted nearly 300,000 unique users within four months.\n\nThis underscores the growing demand for seamless cross-chain interactions.\n\nThe Protocol will soon launch an Ecosystem Grant for projects with future prospects that build on the Router Chain.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxNLUVJZE40QWRpVkJzdEYwUGpOYms1OHU4ZTItUHZRZ1JhMmVseC1EQ05NQ1E2QWFPaGQwZ0RKbG5JYWtSYzFEakdvdlhNQnA4dEh1MVRHeGVjOGNnZ3o3dUJWMU1GLTNZWkNMdENBSjF3Qkg1dTAtd1FoalhYWmpHWXdfX2w1TjFvd0FGcVpzSl9yUmdGMjhvdldEX3Y5RTdya1BCV0doREZnVVY4X0pnZGFJNmtWXzZHUGxNdDV4VTJGWjBHTFdpQlpnQUwyLUxwcDFKSENXRmpLVGNUbEZv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Mean reverting Trading System on cryptocurrencies: a strategy to exploit the false breakouts of Ethereum (ETH) - The Cryptonomist",
        "content": "In order to diversify the basket of systematic trading strategies, this article will attempt to evaluate whether it is possible to approach trading on Ethereum (ETH) with a “mean reverting” strategy based on false breakouts. Like most cryptocurrencies, Ethereum has historically shown a predominantly “trend following” behavior, therefore seeking trend reversals might seem like a counterproductive choice.\n\nWith the recent evolution of the crypto market, it might be useful to consider incorporating a strategy into your portfolio that takes advantage of the “mean reverting” trend, which seems to be increasingly present in this market as well, fueled by growing liquidity.\n\nTo do this, an attempt will be made to define a trading system that can take advantage of false breakouts at the previous session’s low levels, which increasingly often result in rebounds rather than downward trend extensions. Upon breaking the previous day’s low, the condition will be met to enter long if the price returns to the just-broken low level.\n\nStructure and initial results of the mean reverting trading system on Ethereum (ETH)\n\nThe strategy, which will be built only on the long side, assumes entering after bearish market movements with the idea that breaking the previous day’s low could lead to a rebound.\n\nThe session is calculated using the exchange’s time (normally Greenwich Mean Time, GMT) from midnight to 11:59 PM, considering a historical data series from 2016 to today (May 2024). A fixed amount of $10,000 per trade is set, with an initial stop loss of $3,000.\n\nPositive results are obtained right from the start, with a growing equity line. In the following figures, it can be seen how the total profit of the system exceeds $71,000 in just 75 trades, with an average trade of $1,100. These results might seem overly positive, but in reality, they indicate a still rough strategy, given the few very long-duration trades, as confirmed by the high value of the average trade.\n\nAlthough it provides interesting metrics, the low number of operations makes the statistic not very robust, in addition to being not very applicable in real trading given the long duration of many trades.\n\nIt is therefore appropriate to limit the duration of the trades, perhaps finding a compromise between average trade and number of operations through an optimization of the parameters used.\n\nFigure 1. Equity line of the mean reverting trading system on Ethereum (ETH).\n\nFigure 2. Average trade of the trading system mean reverting on Ethereum (ETH).\n\nFigure 3. Summary of the performance of the mean reverting trading system on Ethereum (ETH).\n\nOptimization to determine the ideal duration of trades\n\nAs a first step, we will try to limit the duration of the trades by imposing closure after a certain number of days. By optimizing between 5 and 120 days, the values in figure 4 are found. As noted from the graph in figure 5, around 55 days there is an area with good values of average trade and net profit on drawdown. This is still a rather long duration compared to the event that generates the market entry (false breakout of the previous lows), but the optimization shows that it is not possible to achieve noteworthy results with shorter duration trades. Therefore, as an example, we will choose to close the trades at most after 55 days.\n\nFigure 4. Optimization of trade duration (expressed in days).\n\nFigure 5. Chart of the main results of the optimization.\n\nThe total profit of the system has dropped to about $46,000 with an average trade of $130, values lower than the previous ones, but definitely more realistic considering that they are obtained in 354 operations, a number that makes the statistics more robust and the trade time horizon more sustainable. However, there might still be room to improve the metrics and get closer to a strategy that can be considered for live trading. For example, one could filter the entries with price patterns, trying to operate only when there are ideal conditions.\n\nAnalysis of price patterns to improve the results of the mean reverting trading system on Ethereum\n\nIn this regard, a proprietary list will be used that brings together many price combinations, different from each other, which will serve to understand in which situations Ethereum (ETH) seems to work best with the logic of false break out being tested.\n\nFigure 6. Optimization of price patterns to improve the effectiveness of trades.\n\nThe case “PtnNeutYes=4” (figure 6) identifies the days following a session with little conviction. These are days in which the “body” of the daily candle (open-close) was not greater than 75% of the total range of the daily candle (high-low). Therefore, one would want to avoid those situations where the “body” is greater than 75% of the total range of the session.\n\nIt is noted how in fact MyPtn number 4 manages to increase the average trade (152$) and the net profit (49,209$). The drawdown also decreases and stands at -6,697$. A good improvement, also visible from the shape of the equity which is decidedly more regular (figure 7).\n\nFigure 7. Equity line of the mean reverting trading system with the application of Pattern 4.\n\nFigure 8. Average trade of the mean reverting trading system with the application of Pattern 4.\n\nThese good results are certainly far from those that would have been achieved with the simple “buy & hold” of Ethereum (ETH) from 2016 to today (figure 9) in terms of absolute profits. But it must be considered that the fluctuations of the “buy & hold” are not comparable to those experienced by the trading system, making the former a definitely less sustainable approach. In addition to this, it should be noted that the trading system uses a fixed size, while applying the “buy & hold” is like reinvesting the profits obtained.\n\nFigure 9. Buy & hold of Ethereum (ETH) since 2016 with $10,000.\n\nFinal considerations on the mean reverting trading system on Ethereum\n\nIn conclusion, it has been shown how it is possible to operate with a mean reverting approach even on an instrument like Ethereum, typically trend following, which with the general growth of the mercato crypto presents more and more opportunities for reversal. The trading system developed in this article is certainly not ready for live trading, but the reader is left with the task of further experimenting and optimizing this idea to refine it and transform it into a real operational strategy.\n\nSee you next time and happy trading!\n\nAndrea Unger"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPRlkxSTg2QTNMLUloTFE3VmxpU3o2Q1g4d3ZuUmhVck9HZjR3NGlRaFNhMm4wZXZCOGsxdFdSenpqN01XX21XdHhUNFc2WGFITktQNEI5cy01aUtTSjlwdE5SSzBzaTdaUHhUb0F1anh6XzZJQXB5NVE4T3J6NU5jaDdJOGVoNVV3dVU5ZVNYaXhoTGMwbG4xM1pIb1RGTng5LUtvcEJ3VE85Y0NUakFTYUZB0gG3AUFVX3lxTE5KX29LMTZGZmlFV1JFd0FTS1Znb3R0Y2ZSSjVzWm0yclAzUE11cmdoLUFwSWFHdGJSLWFaZXdNeWVUeXhmbDlocHpIWDdkS2pHNzQzMjN6ajlocXBYS0taRnRtWjRkeEZCMzZ4OTV0aE1WUmFtRUNHZFBfbS0yLVZEem9YNDRwUDU4V0Ric2JvT1Q5b2F2RlBBU1QtTWRiU3QwV09VQlZEZ0RkNHJZVDJBWnc0bTVGaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12,200,000,000 Valuation - The Daily Hodl",
        "content": "Top US crypto exchange Coinbase is listing one Ethereum (ETH) restaking protocol project for pre-launch trading.\n\nIn a new announcement, Coinbase says that EigenLayer (EIGEN) is now available for trading ahead of its official launch on the platform’s International Exchange and Coinbase Advanced for users in eligible jurisdictions outside of the US, UK, and Canada.\n\nSays Coinbase,\n\n“You can now trade EIGEN-PERP with up to 2x leverage. EIGEN opens with a price of $7.307 and an Implied FDV (fully diluted valuation ) of $12.2 billion.”\n\nEigenLayer allows ETH holders to re-stake their tokens for use as “cryptoeconomic security” for protocols other than Ethereum, in exchange for protocol fees and rewards, according to EigenLayer’s website.\n\nPre-launch trading on Coinbase is a newly added feature.\n\nSays Coinbase,\n\n“Pre-launch markets allow users to trade perpetual futures contracts on tokens that have not launched yet. When the underlying token is launched on applicable spot exchanges, the instrument converts to a standard perpetual contract. Pre-launch markets on Coinbase allow users to participate in price discovery for upcoming projects on a trusted and secure platform.”\n\nCoinbase also warns there are higher risks when trading the pre-launch digital assets.\n\n“Pre-launch markets significantly differ from standard perpetual futures markets, carrying unique considerations and posing elevated risks. It is crucial to exercise caution and refrain from trading contracts that you are unfamiliar with or do not fully understand the associated risks.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/tsuneomp"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNQkRYQ2liVU1palB1SUdSSktJbmZhU1p0WW5yTWE0REoxa3hOUk5Ecl9VaFE2XzhyU0V0WTJGRnZhQl9qUURSdklfR0FBNWxwXy1jZWVwMGpONFI2NG1SdlBCV0V6bWpRZ2EwYXptWHAzVmFoZjNINkFXU0pHTjhXN0lJU25BWDREN2Fkc3A5SFR5LXB1WlFF0gGcAUFVX3lxTE5BOXlMdTlmZXBLeWVMc1VJTXNtQTFILWtjRFd2TjU1Qjh2S1dUM1RCOWJkRGtJSzc3SlByLThkYnBvSXVZUG9VQU9ua0JGUjZ0ckNVdjBxWVg5Y0hodmZiV2Rwb2FvblVsak9Gby1LWTNFQkg2a3FVYndjcG43ZXNqb19ZcldFTkpTTHNSWTJvWHBFVVhySGo5eVdGUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Drops 5% as ICO Whale Transfers $20 Million to Kraken - CoinGape",
        "content": "Ethereum is experiencing significant selling pressure, with its price falling below $3,400. As of now, ETH is trading at $3,436, down 4.23%, and has a market cap of $420 billion. On-chain data indicates that Ethereum ICO participants have begun liquidating their decade-old holdings.\n\nEthereum ICO Whale Deposits 5.5K ETH to Kraken\n\nOn-chain data provider SpotOnChain has recently reported significant activity from an early Ethereum ICO participant just hours before the ETH price faced strong selling pressure. As per the report, the ICO whale deposited a total of 5.5K ETH worth $19.3 million to the Kraken exchange.\n\nadvertisement\n\nInterestingly, it turns out that the same participant over the last two days has moved a total of 10K ETH worth $35.4 million to Kraken. At the ICO price of $0.31, the whale had originally received 150K ETH in 2015 for a total investment value of just $46.6K. Despite the recent transfers the whale participant still holds a total of 139K ETH, valued at $476 million across three wallets.\n\nJust before the $ETH further plummeted 3hrs ago, an #Ethereum ICO participant deposited 5.5K $ETH ($19.3M) to #Kraken. Notably, the whale: • received 150K $ETH in 2015 at an ICO price of $0.31 ($46.6K), • deposited a total of 10K $ETH ($35.4M) to Kraken in the past 2 days,… pic.twitter.com/fzswTXi3yx — Spot On Chain (@spotonchain) June 18, 2024\n\nETH Price Downside Is Limited\n\nEthereum has been testing investors’ patience in the past few weeks. The ETH price has been moving sideways after failing to breach the $4,000 resistance. In the month of June so far, the Ethereum price has corrected almost 15%.\n\nDespite this, the on-chain indicators continue to show strength for Ethereum. In the last ten days, there’s been a massive withdrawal of 4.1 million ETH from the exchanges. As per data from Glassnode, there are only 12 million Ethereum or 10% of the total Ether supply sitting on the centralized exchanges. This is the lowest level of ETH supply on centralized exchanges since 2016.\n\nThis bullish on-chain development, coupled with the launch of the spot Ethereum ETF can lead to strong capital inflows for Ethereum. Bloomberg analyst Eric Balchunas expects the spot Ethereum ETFs to go live for trading by July 2. Thus, this could be the final pullback before the ETF goes live for trading and the ETH price resumes an upward rally.\n\n#Ethereum is beautifully riding a bullish continuation wave. Every time it forms a pattern, it turns bullish. We’ve got a bull flag in play right now. pic.twitter.com/DQvztCsFY3 — Yoddha (@CryptoYoddha) June 17, 2024\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPUlRxWUdfakVYcmVOdjNVMHIxUzZURjREakl2V2E2WVpwdTJmeUJlaWp3UnBfUUJqMXg5c2pqbFg5bjdPN0NHQ3JyX1VEaXVNY1BBcmVKOEZpa3hRdlJERGlqU0NqR0haSVB6Uzlhdk1sSFdPWXN5YXZOWGpEZzh2ZXkwTmhfRmhpN3VoZGtnRG1wMmJ4T1Y1YlhOazloLU5KMnVwTUtyeDJGSk14Y0R6WXlhYlZYMU1CY0ZPTTlRNnQ1QUVTU0pKR1NkX3FjT3lUWmlHY1d3T01mR0xYSVHSAeMBQVVfeXFMTTlFai1tdVhaUEt3QmRzRldzT2FhMDNraTFITXlFbUxvTFI3NjlzZE9VWC1OVjZ6eE9URkh3SzhJbEM5MnBxYmh4TkNFU1AycTlTeWV4ak9NSDMza2RwSERBR2dKQ2VuV1BZTXZsSHdEME1rOGNkVXBEa0FieXVOMG4tYmRHblhnMUctLU1lTkNzNXNtMjdxNUc3c2VvazJkRW5LMjFhemY2Rm1Qb3hobFlOaFhiS0ZVeGVvcjNOTEtTOW96Q1BZaG9rV0VrRHlxN1AyZHhiZzJZWGJwZjJER0xjcTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "ETH's decline persists amid Hashdex's plan to launch combined ETF for Ethereum and Bitcoin - FXStreet",
        "content": "Hashdex filed for a market-weighted ETF that will track both spot Ethereum and Bitcoin prices.\n\nEthereum exchange reserves approach an all-time low following massive inflows across global ETH ETFs.\n\nEthereum's decline is likely caused by high correlation with Bitcoin and short-term speculative trading.\n\nEthereum (ETH) is down 3% on Tuesday as Hashdex submitted a market-weighted crypto ETF to the SEC, aiming to track the price of ETH and Bitcoin. Additionally, global investors have increasingly purchased ETH ETFs amid declining exchange reserves.\n\nDaily digest market movers: Combined ETH & BTC ETFs, Global Ethereum ETF net inflow\n\nHashdex submitted a 19b-4 filing for a combined spot BTC and ETH ETF, Hashdex Nasdaq Crypto Index US ETF. According to the filing, Bitcoin will account for 70.54% and Ethereum 29.46% of the Index's weight.\n\nAlso read: Spot Ethereum ETF anticipation wipes nearly $70 million worth of ETH\n\nHashdex's crypto index filings come after the asset manager withdrew its initial spot ETH ETF application on May 24, a day after the SEC approved 19b-4 filings of similar products from eight other issuers, including VanEck, Franklin Templeton, Invesco & Galaxy, BlackRock, 21Shares, Fidelity, Grayscale and Bitwise.\n\nWhile the SEC has yet to approve S-1 registration statements that will enable these issuers to launch spot ETH ETFs for trading, Bloomberg analyst Eric Balchunas confirmed that the SEC has already sent in their first round of comments on the drafts. He also speculated that ETH ETFs could go live on or before July 2.\n\nOn the other hand, Matthew Sigel, Head of Digital Asset Research at Van Eck, said, \"Hedge funds are front-running the ETH ETF approvals.\" He made this claim by citing data from K33 Research, which shows that the 4-week net flow of global ETH ETFs has reached 86,472 ETH.\n\nRead more: Ethereum resumes downtrend as Canada sees another staked ETH ETF launch\n\nAdditionally, Ethereum exchange reserve has dropped significantly, reaching an eight-year low. In other words, ETH on exchanges has reached its lowest level since the number one altcoin became mainstream.\n\nMeanwhile, Ethereum reached new heights in Q1 2024 in terms of total transaction count. The total number of transactions in the whole Ethereum ecosystem reached over 800 million in Q1 2024, an 85% growth YoY.\n\nETH technical analysis: Ethereum's downward pressure may be caused by Bitcoin\n\nEthereum is trading around $3,420 on Tuesday following massive liquidations across the crypto market. ETH liquidations reached over $91.07 million in the past 24 hours, with long liquidations accounting for $74.11 million and shorts at $16.96 million, according to data from Coinglass.\n\nDespite several market catalysts, including buying pressure across global ETH ETFs, declining exchange reserves, and imminent spot ETH ETF approval, Ethereum's price is still lagging.\n\nAlso read: Ethereum ETFs could go live before July 2 after SEC send issuers comments on S-1s\n\nOne reason may be Bitcoin's increasing dominance over the crypto market, which is now at 52%. A decline in the number one digital asset often causes a decline in the price of ETH and other crypto assets, signaling a high positive correlation. Bitcoin has been on a downward trend in the past week, and ETH has followed it in the same move.\n\nAnother reason for the decline may be a speculative move from traders shorting ETH in the short term due to the wider crypto market outlook.\n\nETH/USDT 4-hour chart\n\nThe $3,300 support remains key for ETH in the coming days. A breach below this level may cause ETH to sustain a further downward movement. A breakout above the $3,900 resistance is key to validating any potential bullish move."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUlJPR29sSnZQeEdndHdlTEpfX1hEVUYyVl9mR3dLTVl1VHY4Yy10dHdxbFpOdVBqdEF1c01zOWNXM08xOXcxVk5TUXVnOGVwTzBnVVkyQTVQbVE5RWxjX0xEUzFBU1I4NzRSbEhSTFVETXhuTDAyVEllM0xSMkxXLThxM0pkdWtE0gGOAUFVX3lxTE1BSU0zMjhQb1dKcXRPRTJVMjAydU9nRXVocFVkRWtPVGNUWWNCRDlMUU16c1RmUTMzTnBUZG1Uc0NUQTN0d3Y4dnBNZmd0T3ppV01KdXlaak1IQVhQeGRaZ0VzX3VFWUk2YTNPRmNZR1lQWEpId3BEOE1Oam8yd2c1cWZlUHJ4d3llQlBVWkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum stablecoin volume drops: Will it impact ETH prices? - AMBCrypto News",
        "content": "Stablecoin volume on Ethereum fell to $40 billion, indicating the potential of leading the cryptocurrency to a bear phase.\n\nThe MVRV Long/Short Difference, alongside holders’ sentiment showed that ETH’s price might increase.\n\nStablecoin volume on the Ethereum [ETH] blockchain has dropped from $84 billion to $40 billion, according to data from CryptoQuant. When the volume of stablecoins increases, it means that demand for tokens on a blockchain might increase.\n\nAlso, when this happens, it strengthens the native cryptocurrency of the ecosystem. For Ethereum, the drop in volume indicates that most ERC-20 tokens have been underperforming.\n\nETH holders don’t believe in bears\n\nERC-20 tokens refer to the fungible tokens created using the Ethereum blockchain. Historically, if the stablecoin volume plummets to $30 billion, ETH falls into a bear market. Therefore, the risk was present.\n\nAt press time, ETH’s price was $3,517, representing a 4.18% decrease in the last seven days. While there have been predictions that the price would revisit $4,000, that has not happened in weeks.\n\nBesides this, AMBCrypto looked at the LTH-NUPL. LTH-NUPL stands for Long-Term Holder- Net Unrealized Profit/Loss. This metric assess the behavior of long-term holders.\n\nTypically, the metric considers UTXOs with at least a lifespan of 155 days. According to Glassnode, Ethereum’s LTH-NUPL was in the belief (green) zone.\n\nThis indicates that holders of the token are convinced that the price might increase.\n\nIf this conviction remains the same in the coming weeks, then ETH might not fall into a cycle. Instead the price of the token, backed by demand, could be looking at hitting a new all-time high.\n\nWill rising volatility lead the price higher?\n\nThe Market Value to Realized Value (MVRV) Long/Short Difference is another metric that can tell if ETH is in a bear zone or not.\n\nWhen the reading of the metric falls into the negative region, it means that a cryptocurrency might have dropped to the bear market.\n\nBut as long as the metric remains positive, the cryptocurrency is in a bull phase. At press time, AMBCrypto observed that the MVRV Long/Short Difference was 35.50%.\n\nWhile this was a decrease from the reading last month, it was a sign that ETH has not succumbed to the bear zone. However, one cannot deny that it implies that ETH’s price might fall.\n\nBut if it does, the value of the cryptocurrency is unlikely to slide below $3,000. If this remains the case, ETH might have a chance at retesting $4,000 and beyond.\n\nMeanwhile, the one-day volatility has begun to increase. Volatility measures how rapid price can move in different directions. When volatility increase with buying pressure, price can jump to incredible figures.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nOn the other hand, high volatility will selling pressure leads to correction. For ETH, it remains uncertain where the price would head next.\n\nHowever, something seemed almost certain, holders might not give in to bearish demand that drive the price lower than expected."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPb0owNWJLbnVTZXduV2Q5dlZKVFFjQWpJUVZEa3lHaEtlZVgwMzdONHJlcklHUmpEZkxQa0hsTnU3QUZRc3pZZmxNYXQ0bFYtUDlBNFhVbUpNMWZvcnJ6LUZZYlRUdFBFQUlpZ0hDd2dpY2tpdDl1Qks1aWpCZEhfeHpIVWYwanZZd1lvUWliZGpJVk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "CryptoHeap Launches New Pooled Ethereum Staking Service for Global Users - Yahoo Finance",
        "content": "CryptoHeap\n\nMiami, FL, June 17, 2024 (GLOBE NEWSWIRE) --\n\n\n\n\n\n\n\nCryptoHeap, a leading platform in the cryptocurrency staking industry, proudly announces the launch of its innovative pooled Ethereum staking service. This new service aims to provide users worldwide, excluding those in the U.S. and U.K., with the opportunity to participate in Ethereum staking without needing to meet the high minimum requirements individually.\n\nSalvage Warwick, spokesperson for CryptoHeap , highlighted the significance of this development. \"The introduction of our pooled Ethereum staking service marks a significant milestone for CryptoHeap. This service is designed to democratize access to Ethereum staking, allowing more users to benefit from staking rewards without the need for substantial initial investments,\" Warwick stated.\n\nComprehensive Staking Packages\n\nCryptoHeap’s new pooled Ethereum staking service complements its existing range of staking packages, designed to cater to various investment levels. These staking packages provide daily rewards, capital return, and significant referral bonuses, making them highly attractive to investors. Here are the detailed packages available:\n\nArbitrum: $100 USD staking for 1 day; $2 USD daily and total rewards. Toncoin: $200 USD staking for 1 day; $4 USD daily and total rewards. Sui: $600 USD staking for 6 days; $6 USD daily, $36 USD total, and $6 USD referral rewards. Polygon: $1,500 USD staking for 8 days; $16.50 USD daily, $132 USD total, and $18 USD referral rewards. Cardano: $5,000 USD staking for 12 days; $60 USD daily, $720 USD total, and $70 USD referral rewards. Ethereum: $8,000 USD staking for 16 days; $104 USD daily, $1,664 USD total, and $128 USD referral rewards. Tron: $10,000 USD staking for 20 days; $130 USD daily, $2,600 USD total, and $170 USD referral rewards. Solana: $15,000 USD staking for 25 days; $210 USD daily, $5,250 USD total, and $300 USD referral rewards. Bitcoin: $30,000 USD staking for 30 days; $480 USD daily, $14,400 USD total, and $690 USD referral rewards. Chainlink: $50,000 USD staking for 40 days; $950 USD daily, $38,000 USD total, and $1,650 USD referral rewards. Cosmos: $100,000 USD staking for 50 days; $2,100 USD daily, $105,000 USD total, and $3,800 USD referral rewards. Uniswap: $150,000 USD staking for 55 days; $3,750 USD daily, $206,250 USD total, and $6,750 USD referral rewards.\n\nPooled Ethereum Staking: An Inclusive Approach\n\nThe new pooled staking service allows users to combine their Ethereum assets with others to meet the staking requirements collectively. This innovative approach lowers the barrier to entry, making it easier for more people to participate in Ethereum staking and earn rewards.\n\nStory continues\n\n\"Ethereum staking typically requires a minimum of 32 ETH, which can be a substantial amount for individual investors. Our pooled staking service removes this barrier, enabling users to stake smaller amounts and still benefit from the rewards,\" explained Warwick.\n\nExclusion of U.S. and U.K. Users\n\nWhile CryptoHeap is committed to providing accessible staking solutions globally, the new service will not be available to users in the U.S. and U.K. due to regulatory considerations. Warwick addressed this decision, stating, \"We understand the regulatory complexities in these regions and have decided to exclude U.S. and U.K. users from this particular service to ensure compliance and maintain the integrity of our platform.\"\n\nAdvantages of CryptoHeap’s Pooled Ethereum Staking\n\nCryptoHeap’s pooled Ethereum staking service offers several advantages, making it one of the best crypto staking platforms available today. Users can enjoy lower entry barriers, reduced risk, and the potential for higher returns through collective staking.\n\n\"We believe that pooling resources is a powerful way to enhance the staking experience. By joining forces, users can participate in Ethereum staking with smaller investments and still enjoy significant rewards. This service truly embodies our commitment to inclusivity and innovation,\" Warwick added.\n\nThe Future of Crypto Staking\n\nWith the rise of digital currencies and the growing interest in decentralized finance (DeFi), crypto staking has emerged as a popular investment strategy. CryptoHeap’s exclusive packages and pooled Ethereum staking service are a testament to its commitment to offering the best staking options in the market. These packages are especially attractive for investors looking to stake the best crypto to stake in 2024, including Ethereum and other prominent altcoins.\n\n\"CryptoHeap is dedicated to providing a seamless and profitable staking experience. Our platform is equipped with the latest technology and security measures, making it one of the best crypto staking websites in California and beyond,\" Warwick added.\n\nSecurity and User Education\n\nCryptoHeap prioritizes the security of its users' investments. The platform employs advanced encryption protocols, multi-factor authentication, and real-time monitoring to safeguard assets. Additionally, CryptoHeap offers extensive educational resources to help users understand the nuances of crypto staking, including the best ethereum staking platforms and whether staking ethereum is a good idea.\n\n\"Security and education are at the core of our platform. We want our users to feel confident and informed about their investments. Our comprehensive resources cover everything from basic staking principles to advanced strategies, making CryptoHeap a trusted platform for staking enthusiasts,\" Warwick explained.\n\nStrategic Enhancements and Future Plans\n\nCryptoHeap is continuously innovating to enhance its platform and provide users with the best possible experience. The introduction of advanced analytics tools, automated investment strategies, and user-friendly interfaces are part of the platform's ongoing efforts to stay ahead in the competitive crypto staking landscape.\n\n\"As one of the best staking crypto platforms, we are committed to delivering value and ensuring that our users can achieve their investment goals. Our focus is on continuous improvement and innovation, and we are excited about the future developments we have in store,\" Warwick concluded.\n\nWith the introduction of pooled Ethereum staking and a range of exclusive staking packages, CryptoHeap is well-positioned to meet the growing demand for crypto staking. The platform’s commitment to security, education, and innovation ensures that users can navigate the complex world of crypto investments with confidence and success.\n\nInvestors and crypto enthusiasts are encouraged to explore the exclusive staking packages and other features available on CryptoHeap’s platform. For more information about CryptoHeap’s services and upcoming enhancements, visit the official website at https://cryptoheap.com/ .\n\nMedia Contact Details\n\nContact Name: Salvage Warwick\n\nContact Email: salvage@cryptoheap.com\n\nAddress: 250 NE 25th St Apt 910, Miami, FL 33137, USA\n\nCity/Country: Miami, FL, USA\n\nWebsite: https://cryptoheap.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nCONTACT: Salvage Warwick salvage at cryptoheap.com\n\n\n\n"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQc0tXYnRZMjdYeDNSYk9pVTRQWVh2U2xNa0xzM0VqZ0FLeTVWdk5tS0M5TGhib0lDR18wMHZPcm5RSFRiOGFMUnBEeGdHWDZwVTktdFdtWHRSQjloamhSaFkxUzVaanBLdmRnNGlDUXhfa1pYVWpfZDhaUFd4NE53TmEtR0dkTjkyS0ZYN1lodmZtVHJVRV9J?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bonne nouvelle : La SEC pourrait approuver les ETFs Ethereum dès le 2 juillet ! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nAccording to leading analysts, the final approval of Ethereum ETFs could be made official as early as July 2, just before the Independence Day weekend. This news is important not only for crypto investors but also for the global financial market. The approval of these ETFs could mark a decisive step towards the legitimization of digital assets, opening the door to new investment opportunities and speeding up the adoption of cryptos on an unprecedented scale.\n\nA decisive step towards the approval of Ethereum ETFs\n\nThe SEC could mark a turning point for cryptos by approving Ethereum ETFs as early as July 2, according to leading experts. “July 2 could be the fateful date,” said Eric Balchunas, senior ETF analyst at Bloomberg. Gary Gensler, the SEC Chairman, recently indicated that the agency could approve S-1 filings for exchange-traded funds on major altcoins “by this summer,” highlighting the significant advancement of the process.\n\nThe steps to enable the listing and trading of eight Ethereum ETFs have already been initiated by the SEC, particularly through the approval of required rule changes. However, the S-1 registration statements, which contain detailed information about the financial products, still need to be finalized before their official launch. Last May, the SEC requested issuers to update these forms, a sign that the process is making significant progress.\n\nA turning point for crypto investments?\n\nNate Geraci, another ETF specialist analyst, shares this optimism. “The last steps before approval are often the most critical, but everything indicates that the SEC is ready to move forward,” he said. According to him, only a few minor adjustments remain before the final approval is granted, an encouraging sign for the cryptocurrency market.\n\nThe approval of Ethereum ETFs could have major repercussions for institutional and retail investors. By facilitating access to Ethereum through regulated financial products, this decision could not only bolster the credibility of cryptos but also attract a significant influx of capital. This new liquidity could increase market stability and reduce volatility, making cryptocurrencies more attractive to a broader audience.\n\nIn the long term, this approval could serve as a catalyst for other regulatory initiatives favorable to cryptocurrencies worldwide. Regulators in other countries are closely monitoring the SEC’s actions, and approval could prompt other jurisdictions to adopt similar measures. This could accelerate the global adoption of digital assets, driven by increased investor confidence and continued innovation in the sector.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE05VlY3V2V3c3Fld25xZ2pnLTRFVXM1OWEzRWpyZnRyRDVNOTZqUzJMYnZmMGVwaTRjSUlaUTdHUXA3blVkcmJWMjNwX3FtQ2hWdktMUjlBVGNQN25lYUY3aGN1a0NXa2d6NVdTdklMNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "The dark side of tokenisation - Financial Times",
        "content": "Print this page\n\nThe writer is a law professor at the American University Washington College of Law\n\nTraditional financial institutions are increasingly showing interest in “tokenising” real-world assets, meaning they are curious about how these assets could be digitally represented by programmable tokens recorded on shared ledgers. There could be real efficiency gains associated with tokenisation, but the drive towards it could also take a dark turn.\n\nThe most dangerous outcomes would arise if tokenisation of real-world assets were pursued simply to feed into what has been described as “the perpetual motion machine that is crypto trading”. Regulators around the world have expressed concerns about the integration of crypto and traditional financial markets, because of the high levels of volatility, leverage, concentration and operational risk associated with the crypto markets. This integration would be sped up if ownership of tokenised real-world assets were recorded on so-called permissionless public blockchains. The type of ledger favoured by the crypto industry, these blockchains can be accessed by any computer running the necessary software to host them, no identification or vetting required\n\nThe tokenisation of real-world assets can and should proceed without using these problematic blockchains. Their inefficiencies are well documented, and experimentation to resolve problems in scaling their use tends to focus on processing transactions off the blockchain (defeating the stated goal of decentralisation).\n\nIt is perhaps less well appreciated that these kinds of blockchains are also plagued by governance problems. We cannot simply trust in the code of the blockchain. Public permissionless blockchains are “designed by people, maintained by people, and governed by people”, as one research paper put it. but we don’t necessarily know who these people are, who pays them, or if they’ll show up in an emergency. This is an untenable position for critical financial infrastructure.\n\nUnfortunately, BlackRock has chosen to host its tokenised Buidl fund on the public permissionless Ethereum blockchain. The good news is that some other financial institutions have taken a different path, and are experimenting with other kinds of ledgers to see if tokenisation yields efficiencies in their markets.\n\nEfficiencies can arise from programmability, meaning that software known as “smart contracts” can be built into the tokens to allow for the automation of functions, like interest payments. Smart contracts can also be used to build bespoke financial products out of multiple tokenised assets — this is known as composability. Ownership of tokenised assets can also be split into smaller pieces in a process known as fractionalisation. When ownership of all tokenised assets used in a single transaction is recorded on the same ledger, the transaction can be settled “atomically”, or simultaneously, 24/7.\n\nCross-border payments seem particularly ripe for improvement through tokenisation, but we shouldn’t rush to tokenise everything. Some purported benefits (particularly those relating to financial inclusion) are overhyped. And where efficiencies gains are real, they can invite corresponding fragilities. Even when divorced from crypto, there is a dark side to tokenisation.\n\nTokenisation promises to bring more real-world assets into the financial markets, and to engineer them into new categories of bespoke financial products both big (through composability) and small (through fractionalisation). This may unlock liquidity and efficiencies in good times, but we learned in 2008 that illiquidity, deleveraging and fire sales will be on the menu when things turn south. Discretion and forbearance (for example, with regard to margin calls) are often critical to containing the damage in these circumstances, but obligations automated with smart contracts will inflexibly self-execute regardless of context.\n\nIn addition, smart contract software provides another attack surface for hackers, and the more comprehensive the underlying ledger, the more attractive a target it becomes for cyber attacks. Atomic settlement also deprives markets of the benefits of netting of transactions.\n\nIf we think back to 2020, we learned the hard way that supply chains could become brittle when the unexpected occurred; now there is increasing interest in production strategies that are less efficient, but more resilient. We should explore tokenisation with the same mindset. We need to ask “when something is efficient enough, will making it more efficient introduce too many fragilities and be counterproductive in the long run?” In the best-case scenario, tokenisation experimentation will spur the financial industry to start thinking intentionally about this question.\n\n."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxON3kxdGZXRno1LWsyS3p5cG9tU01JTGdWVm9yWXlkd2tGV09GMFZSRm5mQ1pQU0JCSWRlSGEyVE9QRTRpLUM0WHdlTHlpendmY3N3RmFkSFJSQVJSX1RtcExrUjJUczktblg2UDM3Z3hXem4xSnB2elQ5OHl1YjBsenZUdnl3YUhfTXJlcm9PajhXelJXa09leUp3S196MV8ta3NjOXhkSnB6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whales on $2.45 Billion Buying Spree Amid Market Volatility - Crypto Times",
        "content": "Ethereum whales have been on a massive buying spree lately. In just three weeks, they scooped up over 700,000 ETH worth a whopping $2.45 billion according to On-chain analyst Ali Martinez\n\nThis accumulation happened during a period of wild swings in crypto prices that triggered over $215 million in forced trader liquidations, with $50.61 million coming from bets on Ether.\n\n#Ethereum whales have bought over 700,000 $ETH in the past three weeks, totaling approximately $2.45 billion! pic.twitter.com/sfmXnkqD49 — Ali (@ali_charts) June 15, 2024\n\nThe whales’ huge Ether purchases coincided with a volatile stretch for Ethereum, the second-largest crypto. ETH prices plummeted to $3,368 on June 14th before recovering to around $3,500 in the following days. The price movements crushed traders on both the buying and selling sides by automatically closing out their positions when they ran low on funds to back their bets.\n\nThough Ether is still up 2.31% over the last day to $3,565 at press time, it had suffered a 2.96% weekly decline prior. Derivative markets had been bracing for further falls before last Friday’s options expiration based on bearish trading data.\n\nWhile the market turmoil caught many off-guard, blockchain metrics suggest things may be steadying. A key indicator tracking investor profits being cashed out spiked before flattening, which analysts see as a potential sign of selling pressure letting up between $3,400 and $3,600.\n\nAdding to the long-term bullish outlook, a spot ETF for Ethereum could launch on July 2nd, according to Eric Balchunas."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOOGZBUWkxTTE3YmhuS0VtWTlKVGU3ZGVWUzRaOUtRZkhKYXEzZGpuQTdQNkI1WDB0TmVqcVFVSXAwOXhab3RUa2lVdlJxU0RMLWQ1RVU3OWxoaUt6NnN5bzNSemJxNU5jcjBVaUtWVmQzaEtlTmtPRUtLSVBGLXpBbmtuRDR6MXh0ZXY0Z28wcGRLTGRHczAybnhfRnFPUlBqeExTYzB2bG9pX0tmVkp4MEY0WHHSAboBQVVfeXFMTmtLdV9jakEzRHVZNElaSnQ1amlkVnFIMVMzUDFKVV9JYnNLTm1tWW9GQTdUQi0wWVZJVTZ2YURMUFZUSlM2VDNzOGVoMDUzVjBOQzNSVUpza2xJTUM3WWJvQnRFS0JvQkFkbER2MV9kQUk3MU5CYV9JVU81MHdYcjl2QlNOT0NPbkZteWs0QWdNa1dfRV9MS01YWHNIYnQ2N3AwWWQwRlNod2dXRlRDa2kzSk94SGY1OGFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum bolstered by hopes, Bitcoin waits for a signal - FXStreet",
        "content": "Market picture\n\nThe cryptocurrency market has lost almost 5% over the past seven days. It has not given up important support levels but also has no significant drivers to resume growth. Bitcoin lost 4.7% over the week, in unison with the market. Ethereum lost 3%, while the top altcoins' performance ranged between -7.7% (Solana) and +11.7% (Toncoin).\n\nBitcoin has been trading close to $66K since Friday, hovering around the 50-day moving average, testing the medium-term uptrend. The outcome of this test, as well as the market's direction in the short term, depends on risk appetite in global markets. It has waned due to fears over the French election and a series of weak data from the US and China in recent days.\n\nEthereum, on optimistic expectations about the ETF, was able to add over 6% after briefly dipping under its 50-day MA on Friday. However, a loss of nearly 1.5% since the start of the day on Monday makes one wary of the near-term performance. The increased liquidity on weekdays will likely play into the hands of bears rather than bulls by increasing selling interest.\n\nNews background\n\nBernstein raised the target price of the first cryptocurrency by the end of 2025 from $150K to $200K. The forecast revision is due to expectations of \"unprecedented demand from spot bitcoin-ETFs\" managed by BlackRock, Fidelity, Franklin Templeton and others. Bernstein's baseline estimate is for BTC to reach $500K by the end of 2029 and $1 million by 2033.\n\nPeter Brandt, Factor CEO, suggested that a massive sell-off of Bitcoins by mining companies could lead to a short-term drop in BTC to $60K and even $48K.\n\nSEC head Gary Gensler said approval of Form S-1 for the Ethereum-ETF is possible \"sometime by the end of this summer.\" According to him, \"individual issuers are still going through the registration process. Everything is going smoothly.\"\n\nAccording to CryptoQuant, Ethereum traders bought up 298,000 ETH (worth around $1.34B) after the Fed meeting, the second-highest daily number of coins in history.\n\nRipple Labs filed a letter demanding that the SEC reduce the fine it is requesting from $2B to $10M, using an agreement between the regulator and Terraform Labs as its argument.\n\nEl Salvador President Nayib Bukele proposed creating a private equity bank to \"diversify the financing options offered to potential investors in dollars and bitcoin.\""
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOWWVzU2tRZ2s0SDRieThHeWRHeGctQmhHakdtYkdzQVJXY2x6bXJON0tzWC12RU9LZ2JxTVZYZnVLYW9wRkxDXzJ5NEpTQjREYmZPeXpKT1I5Y012MEtUdUNtUEhRQWQ4b1g3RFA4QTJLOUFfakczc0lVNEJvNDF3TV9SOE02MTJ6akNRdDJoN0VRWldrRlJHNld3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bonne nouvelle : La SEC pourrait approuver les ETFs Ethereum dès le 2 juillet ! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nAccording to leading analysts, the final approval for Ethereum ETFs could be officially announced as early as July 2, just before the Independence Day weekend. This news is significant, not only for crypto investors but also for the overall financial market. The approval of these ETFs could mark a decisive step towards legitimizing digital assets, opening the door to new investment opportunities and accelerating the adoption of cryptos on an unprecedented scale.\n\nA Decisive Step Towards the Approval of Ethereum ETFs\n\nThe SEC could mark a decisive turning point for cryptos by approving Ethereum ETFs as early as July 2, according to leading experts. “July 2 could be the fateful date,” said Eric Balchunas, senior ETF analyst at Bloomberg. Gary Gensler, the SEC chairman, recently indicated that the agency could approve the S-1 forms for exchange-traded funds on major altcoins “by this summer,” highlighting significant progress in the process.\n\nThe steps to allow the listing and trading of eight Ethereum ETFs have already been initiated by the SEC, notably through the approval of necessary rule changes. However, the S-1 registration forms, which contain detailed information about the financial products, still need to be finalized before their official launch. Last May, the SEC requested issuers to update these forms, a sign that the process is progressing rapidly.\n\nA Turning Point for Crypto Investments?\n\nNate Geraci, another ETF analyst, shares this optimism. “The final steps before approval are often the most critical, but everything indicates that the SEC is ready to move forward,” he said. According to him, only a few minor adjustments remain before the final approval is granted, an encouraging sign for the cryptocurrency market.\n\nThe approval of Ethereum ETFs could have major repercussions for institutional and individual investors. By facilitating access to Ethereum through regulated financial products, this decision could not only bolster the credibility of cryptos but also attract a significant influx of capital. This new liquidity could increase market stability and reduce volatility, making cryptocurrencies more attractive to a broader audience.\n\nIn the long term, this approval could serve as a catalyst for other regulatory initiatives favorable to cryptocurrencies worldwide. Regulators in other countries are closely monitoring the SEC’s actions, and approval could encourage other jurisdictions to adopt similar measures. This could accelerate the global adoption of digital assets, driven by increased investor confidence and continued innovation in the sector.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPSXVCbmtVbE1mVlhYcTRGVEd3dXR6WHNZUjF2eXVLSjJEQ1ZidzE0blA3cGVXNzFvdlV5cGxnVzhlOWlqVjNqWEV0NXAxRGVPTjNKV3hPU0xpSnhhc0ZfdkJZbkk1ZTJCcGdMZW1yekNRSkczdHRYTlhpNWlsdHU1WjJyc09lUmPSAYwBQVVfeXFMTjc4YTRVSnRVTWY1YW9oZE1KNDhhbmJ4dUVRanpIUklydk5GbnFHbjZEbTh1a29HQ2k0eFFxYXFsVlE4RDRBN29QT09QSUE2eDZHeFhKTy1uUjRjUHNkdmZSYnBPTnQ3Ukt6Ri1UbXdNd2dzMVd6SkRTNWRiaGVxQWE3STNMaXBwLXFsY3g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: When Is Ethereum Price Poised Reach $4,200? - CoinGape",
        "content": "Ethereum price jumped 8% over the weekend as the asset experienced renewed investor interest. The price dipped to $3,362 before beginning an uptrend throughout the weekend. By Monday’s European business hours, ETH hovered around $3,586, marking a 1.2% increase in 24 hours but a 2.7% drop over the past 7 days. Meanwhile, Bitcoin’s price remained in a consolidation zone, with an anticipated directional move expected soon.\n\nEthereum Price Prediction: Bulls Take Advantage of Major Support\n\nadvertisement\n\nETH price witnessed an 8-day continuous fall last week, going from $3,878 to $3,362. In the drop, the asset broke a critical support level responsible for holding it above $3,650. Bears took advantage of the ensuing panic to drive prices even lower.\n\nThe bulls eventually utilized another stronger support structure between $3,400 and $3,250 to bounce Ethereum price action back into an uptrend. The asset may have entered another consolidation zone between $3,600 and $3,300, but it is too early to tell. The bulls’ main challenge lies in breaking above the $3,600 support-turned-resistance. If they succeed, ETH price may rise to $4,216, with some resistance around $3,800 and $3,900.\n\nMeanwhile, Bitcoin is at a crucial place on its daily chart, trending around a key support level ($65,000). On Friday, bears managed to push the price below the support level, but they were met with hostile rejection from the bulls. A clean break below this level would result in a further downside to $57,000. On the flip side, this support level is strong and has been tested three times before. A bounce from here may result in a BTC price surge to $72,500. A break above this might easily launch Bitcoin to new all-time high prices.\n\nSpot ETF S-1’s Will Likely be Approved by the End of Summer\n\nGary Gensler, Chair of the Securities and Exchanges Commission (S.E.C.), hinted at a likely Ethereum ETF S-1 approval by the end of summer. This news may have likely caused the reversal in Ethereum price over the weekend.\n\nMeanwhile, Ethereum blob usage has been trending up for about 5 weeks now as rollups continue to see more and more activity. Blobs improve the efficiency of Layer 2 (L2) transactions, reducing congestion and potentially cutting down on gas fees.\n\nBottom Line\n\nSpot ETFs for crypto assets have historically been great price boosters. As summer approaches an end, the crypto markets watch closely for Ethereum Spot ETF approval. By releasing this information, Ethereum investors are now in a buy-the-rumor phase that may last until the eventual approval of the ETF.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPV1c4NlRmTDNLWXlZOUVMN3czZGpwWWxkY2dQRU1fbm8zS3BSamFrSkhuTlZrZlV3NzFKYWZBQ1VzSXRobDZBckRzTXd1bjdScEZVdnhoMS1wQ2lmeUFRWmxUdVU0OGc5QlVFNnRLRm5vZ3F0M3VVSnR4bzJXZUtGTTd2UXc2R29OSDZBM2VJejRUUdIBlwFBVV95cUxPdGVPYndzZkx3VVc4LXZ5OGRJc0RYdjI0UlVsS2FTRDR5MnVHUEh3Y0ZnUmRsLTgwRDN5MWRPLXlpd0IyNVVocXhhMEVfYXNVWFlHbDNrTUU0WTJjdnZaNXZydWVuOGo0YXg0clh1V0Ewc2RyQkdSVnFhTlBCbUJTUkFRaDVBS0pKZHlMVG9hQ0E5T0dZTU8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum whales are on the move: What does it mean for ETH’s future? - AMBCrypto News",
        "content": "Ethereum whales accumulated large amounts of ETH in the last few days.\n\nDevelopments for Ethereum ensued, price remained stagnant.\n\nEthereum’s [ETH] price has remained stagnant over the last few days, despite this, whales have shown interest in the ETH token.\n\nEthereum whales move in\n\nThe number of Ethereum wallets holding significant amounts of ETH has been on the rise.\n\nAccording to Santiment’s data, over the past four weeks, there’s been a massive increase of over 3% in Ethereum addresses that hold more than 10,000 ETH.\n\nWhales hold a substantial amount of ETH, and their buying activity can significantly influence market sentiment. If they continue accumulating, it can drive up demand for ETH, potentially leading to a price increase.\n\nThis can attract further investment, creating a positive feedback loop and propelling the price even higher.\n\nWhile whales can contribute to price appreciation, their actions can also introduce volatility.\n\nIf these large holders decide to sell a significant portion of their ETH holdings in a coordinated manner, it could trigger a sudden price drop, causing panic among smaller investors\n\nNew developments on the network\n\nApart from whale interest, another factor that could impact Ethereum significantly would be the developments occurring on the network. In the most recent developer call, multiple aspects of the Ethereum network were discussed.\n\nThis meeting of Ethereum developers addressed upcoming advancements to the Ethereum blockchain. The discussions centered on three primary areas Electra, PeerDAS, and SSZ-related improvements.\n\nElectra is the name for a series of upgrades to the Ethereum consensus layer, which coordinates validators on the network. The call addressed the nearing completion of code for the next Electra version and upcoming testing phases.\n\nPeerDAS refers to a planned modification to the Ethereum network’s communication system. This would allow nodes to process and validate larger amounts of user data.\n\nDevelopers are planning separate testing phases for PeerDAS to ensure its stability before integrating it into the main network.\n\nFinally, the call touched upon SSZ, a technical specification for data encoding. Several improvements related to SSZ are being developed, and their potential inclusion in a future major upgrade is being explored.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nLooking at the price\n\nAt press time, ETH was trading at $3,524.08 and its price had declined by 1.08% in the last 24 hours.\n\nDespite the dip in price, the volume at which ETH was trading at had surged by 30%."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQejdOZW85ci13WU1PUGJlQV9YaVNUYzI3eVNKVnFsazRIZVVZZWJXYzM0alBERmJzdEQ0UEt2VjZHSjVNTVM1czVqaHJVMmlLZ3NtcXI1RThnZDVhU0hvbEdYbUZpMkJtYjFfaTc4WlIzOHRBNTJDUE9BakhtdThuYlJ6b1R1eDhIcFgzYTZlSm9sTWRFY0xSZWNURjBMcjVPUjdnSkpVUlNZQUI5LTRSRlN2ejBRMmxFR0ROYmdDYUdTNVRYdWRCbzZtYUcweFJndzdqelBMNTFlZkoxRFpIMm9uUGt0UdIB6wFBVV95cUxNWFRwcWR1ZUFCdEtpTDBCWjhXT25xclhmdVhHVDYydTdYLVg4WWpfSnpGNC11REJDSjhOX1VhTldyVGI3TUlMRWdEem5NdlBBLWYxUjNaUVFYRi0tRHlTbnNkalR4WGpibWIzTXV2bDNJSFFNLTdnbHk5bWx3MTdPN2l5RWdXRjF6Rl9vLTRYLWNpaEdGYzJuMkVtOEpLOWpjUWZlOFZFeGJDTzVkams0NVpxeGswUFNXQkdQSDBvN0pzOVdyOE5XczExZnhya1FwWEllbXdfdnFPaVUzRUZJc29LSkQzX1h5RFlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin retesting its major resistance level - FXStreet",
        "content": "Bitcoin price is retesting its weekly resistance level of $67,147.\n\nEthereum price finds support around $3,321, the price imbalance between $3,146 and $3,498.\n\nRipple price faces rejection due to the key resistance level of $0.499.\n\nBitcoin (BTC) and Ripple (XRP) prices are poised for short-to-midterm corrections, while Ethereum (ETH) hints at a potential rally.\n\nBitcoin price faces resistance at a major level\n\nBitcoin price daily candlestick closed at $66,043 on Friday and is currently moving upward toward its weekly resistance level of $67,147.\n\nIf BTC breaks above this weekly resistance level and flips it into a support zone, then it could rally 6% from the point of breakout to reach its previous resistance of $71,280.\n\nHowever, if BTC fails to break above the $67,147 level, then it could have a short-to-midterm downward correction in the coming days, tagging the midpoint level of the price imbalance between $63,118 and $64,602 at $63,813.\n\nThis midpoint level also roughly coincides with the 50% retracement level at $64,258, calculated from the swing low of $56,523 on May 1 to a swing high of $71,994 on May 21.\n\nIf BTC bounces off $63,813, it could rally 6% to reach its previous resistance level of $67,147.\n\nIf the bulls are aggressive and the overall crypto market outlook is positive, then BTC could extend an additional rally of 6% to reach its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if Bitcoin price breaks and closes below its daily support level of $60,800, the bullish thesis would be invalidated, leading to a 4% drop to its weekly support level of $58,375.\n\nEthereum price poised for a rally\n\nEthereum price bounced 7% from a low of $3,362 on Friday to its current trading at $3,614.\n\nThe $3,362 level roughly hovers around the 61.8% Fibonacci retracement level and the price imbalance midpoint between $3,146 and $3,498.\n\nIf this support holds, ETH price could rally 10% from its current trading price of $3,614 to tag its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,279 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,864.\n\nRipple price is set for a correction\n\nRipple price faces resistance at its daily resistance level at $0.499.\n\nIf this resistance level holds, XRP could experience a 7% short-to-midterm downward correction from its current trading price of $0.488 to its recent low of $0.450.\n\nIf the bears are aggressive and the overall crypto market outlook is negative, then XRP could extend an additional decline of 7% to reach its previous low of $0.419 from April 13.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the Ripple daily candlestick closes above $0.499, XRP could rally roughly 7% to its previous high of $0.532 on June 5."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxNeVlFeHYtTTlXVGdqc28zb0ppcTRKek02dVN6bzZGOWZzbU9mb3NkTDdDN2FWN3lMRlNXRzQyU2pkN29pOXN3RFNMUE9pRmhUWE9ENlVVWF9GUjVFNl9SbGJYaW54SFdxUDBvaDRoTjdfRUd3ZFJxYldjUzdoNXBRQ0FTbFhiOEtDSmY1YndqX2JCQkRXWFpiZmROUmluLTZTZFZNMWFBVVNjRktwY3RjdkdsZEVXWXNnTWZzZkJYY25QLTNHRHNXSWgwYmkwOHJvSmY1QzF5R0s2LXRRQVF0UDhSSW5URHBWeU45ZEZvMlRLU2JqYUh0REVPVkNfYmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Heats Up: Ethereum ETF, Bitcoin's $85K Prediction, and Furrever Token's Referral Rewards - GlobeNewswire",
        "content": "New York City, NY, June 17, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is buzzing with excitement as several key developments take center stage. Ethereum's anticipated ETF approval, Bitcoin's potential rise to $85K, and the growing interest in Furrever Token's unique referral rewards are capturing the attention of investors worldwide.\n\nEthereum ETF Anticipation\n\nEthereum is on the brink of a significant milestone with the potential approval of its Exchange Traded Fund (ETF) by the U.S. Securities and Exchange Commission (SEC). Market analysts predict that this approval could occur as soon as July 2, marking a crucial step forward for Ethereum. An approved ETF would offer a regulated investment option for both institutional and retail investors, likely leading to a substantial influx of capital into Ethereum.\n\nRecent comments from SEC Chairman Gary Gensler have fueled optimism, suggesting a favorable stance towards ETFs. Bloomberg's Eric Balchunas notes that the final approvals may follow minor adjustments between issuers and the SEC. This development could pave the way for a significant market event, boosting Ethereum's price and solidifying its status as a mainstream investment option.\n\nBitcoin Targets $85K\n\nBitcoin (BTC) is poised for a potential surge to $85K, driven by increasing mining costs and historical price patterns. The relationship between rising mining expenses and Bitcoin's price suggests that BTC could reach new heights as miners seek profitability. Historically, Bitcoin's price has often increased to match or surpass mining costs, indicating a potential rise to $85K.\n\nThis upward trajectory is supported by growing institutional interest and favorable market conditions. Analysts forecast that Bitcoin's price could exceed $85K, driven by heightened demand from both retail and institutional investors. The strong fundamentals and increasing mining costs create upward pressure on Bitcoin's price, making this prediction plausible.\n\n\n\n\n\nFurrever Token's Delightful Rise with Referral Rewards\n\nFurrever Token, a cryptocurrency themed around cats, is making a notable impact with its innovative approach and engaging referral system. Designed to create a joyful and engaging experience, Furrever Token aims to build a whimsical crypto ecosystem centered around delightful cat imagery and community involvement.\n\nThe token's referral system is a key feature, offering users a 10% bonus in $FURR tokens for every deposit made through their personal referral link. This incentive has significantly driven community growth and engagement, allowing users to earn additional tokens and actively participate in the ecosystem. Currently priced at $0.000732, Furrever Token offers presale investors the potential for up to 15X returns post-launch.\n\nHaving raised over $1.3 million in nearly three months, Furrever Token is in stage 9 of its presale, with a goal to raise $1.9 million. The anticipated launch on PancakeSwap is expected to draw considerable interest due to the token's unique appeal and innovative features. Furrever Token's mission to foster a fun and vibrant crypto community sets it apart in the crowded market, attracting both new and experienced investors.\n\nConclusion\n\nThe convergence of Ethereum's potential ETF approval, Bitcoin's expected surge to $85K, and Furrever Token's engaging referral rewards is creating an exciting landscape for crypto investors. As Ethereum moves closer to regulatory approval, Bitcoin aims for new highs driven by rising mining costs, and Furrever Token offers unique community-driven opportunities, this period marks a significant turning point in the digital finance narrative.\n\nInvestors looking to capitalize on these dynamic developments may find substantial rewards in the coming months. Whether you're interested in Ethereum's ETF-driven growth, Bitcoin's bullish outlook, or Furrever Token's charming and profitable ecosystem, now is the time to explore these opportunities and potentially realize significant gains. The crypto market is heating up, and these developments are set to make waves across the financial landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5NOFlFdGY3Y3lVYVc0MmMyWFZXMlgzQnNWdnc5MG1TS0lvQ2Q1czN0LWxsZXl0bkJjOEl2YUJHbzVUeG9zT0gyRklkbUxiY243Sjl1dFlLblFfb0otbklMSXR2REU3NUtKUkZwNjl6UXFLejM4cGRaM25zWdIBgAFBVV95cUxPY3BIWjdTUG40Yk9Jd25WNFpkaWtFOU9RYUdvLWRySmxxOEFmMjhnN3otTm1uT2o5NlhqdmNZNU1mWkdTMDJUdGRtOVhTcTVSWVpOZkloUHU2M0xYVGFxdGJaVURfZ2I5bFhDVGQ1am1QcjBhY3VFbkVjbHdqdjhmRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Open Interest gains by $1B – Impact on ETH? - AMBCrypto News",
        "content": "While Open Interest increased, Funding Rate stalled.\n\nThe price of the altcoin might keep swinging between $3,400 and $3,600 in the short term.\n\nOne day after Ethereum’s [ETH] Open Interest dropped to $13.14 billion, it added another billion to its value. At press time, the Open Interest (OI) was $14.10 billion, according to data from Glassnode.\n\nOI is the value of outstanding futures contracts in the market. Whenever it decreases, it means that traders are closing positions related to the cryptocurrency. However, an increase suggests otherwise.\n\nSpeculation is a ticket to a new high\n\nThus, the rise in Ethereum contracts indicates increased speculative activity regarding the altcoin. In many instances, an increase in OI offers strength to the price direction.\n\nFor ETH, it might not be different. As of this writing, ETH changed hands at $3,563, representing a slight 1.10% increase within the last hour.\n\nBy the look of things, this could be the start of a significant uptrend for the cryptocurrency.\n\nHowever, the trading volume had decreased by 35.36% in the last 24 hours. The decline in trading volume is a sign that activity involving ETH was lower in the spot market.\n\nIf spot market activity continues to drop while trading in the derivatives market increases, ETH’s price might stall around the $3,500 to $3,600 region.\n\nBut if buying pressure in the spot market increases, the altcoin might jump in the $3,800 direction.\n\nSkepticism lingers\n\nDespite the outlook, Ethereum’s Funding Rate has remained stagnant since the 8th of June. Funding Rate is the cost of holding an open position in the derivatives market.\n\nIf funding is positive, it means the contract price is trading at a premium to the spot price. In a situation like this, longs pay short to keep their positions open.\n\nOn the other hand, a negative funding implies that shorts are paying longs. Also, the contract value of the cryptocurrency is at a discount.\n\nFor ETH, the low Funding Rate and high price means that spot volume might soon begin to pick up.\n\nIf this is the case, the reasonable inference could be a bullish move for Ethereum. Nonetheless, the price of the cryptocurrency might fail to hit $4,000 in the coming week.\n\nIn addition, AMBCrypto looked at the Taker Sell Ratio. To get this ratio, we need to divide the sell volume by the total perpetual swaps.\n\nWhen the ratio is lower than 0.5, it means that selling pressure has decreased. However, a value higher than 0.5 indicate the selling is dominant in the market.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs of this writing, Ethereum’s Taker Sell Ratio was 0.50, according to data from CryptoQuant. If the condition remains the same, ETH’s price might struggle to close in on $4,000 as mentioned earlier.\n\nIn the coming week, the value of the cryptocurrency might trade between $3,400 and $3,600 as it did in previous weeks."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41V1Z0bTMyMXkyWUF4M2xvVjl2Q1BNUThIUG96S0FYLTVxM2lzRllVMjFMSEw5cGFOU3p2bXRrY0VZUDhySkpCSFVHZzBQM0NvUnBQbWtkZkRNaHExRmF6dVp2Tnp2YUh6dXlKVTNMd1F3RDR3Ny11andnSdIBgAFBVV95cUxNSDhpWjZYenYzd1g3dmlUMjBrdnNTU3VEM3BUUlNjOE1veWxCejlzRkNKTndZWU5KeGVBS2c5M1ZoMjJpRTN3dGZMZ0RRaXZhZ1NNN2xXWVo5MndWb3NyeG5MZnlpeHZ0bmc1VUxFbFpyVUtfOXlMbGFmS3VaQ2ZmUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Wins As US SEC Ends Securities Investigation - Bitcoinist",
        "content": "The crypto industry received a significant jolt of clarity and optimism as the US Securities and Exchange Commission (SEC) concluded its investigation into Ethereum 2.0, announcing that it will not pursue any enforcement actions. This decision marks an important victory for Ethereum and could serve as a critical reference point for the treatment of digital assets under US securities law.\n\nEthereum Is Not A Security\n\nIn 2018, the SEC made a key distinction that Ether was not a security. However, by 2023, amidst evolving functionalities and the transition to Ethereum 2.0, the SEC revisited this stance, hinting at possible regulatory oversight. This shift led to increased scrutiny and uncertainty within the Ethereum community, culminating in a lawsuit filed by Consensys on April 25, 2024. The lawsuit aimed to confirm the classification of ETH as a commodity, arguing that the SEC lacked jurisdiction over its trade and governance.\n\nIn a pivotal response dated June 7, 2024, Consensys urged the SEC to acknowledge the approvals of Ethereum-based ETFs made earlier that May, which were predicated on the assumption that ETH is a commodity. Consensys argued this should conclusively end the SEC’s investigation into Ethereum 2.0.\n\nThe SEC’s Enforcement Division officially responded on June 18, 2024, as communicated in a letter addressed to Kevin S. Schwartz, attorney for Consensys. The letter stated, “We write to provide notice that we have concluded the investigation in the above-referenced matter […] based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission.”\n\nImportantly, the SEC underscored that this closure should not be seen as an exoneration or that no action may ultimately result from the staff’s investigation. Nonetheless, Laura Brookover, a lawyer at Consensys, underscored the significance of this development, stating, “The SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development.”\n\nThis resolution can be perceived as a critical moment for the broader crypto industry, particularly in how digital assets are classified and regulated. Alexander Grieve from Paradigm noted the tone of the SEC’s notification, commenting, “They’re pretty hedge-y/evasive in their notification—BUT it is relatively unusual for the SEC to specifically highlight to a company that they’ve closed an investigation.”\n\nThe closure of this investigation without enforcement action could set a precedent for how other cryptocurrencies are treated by regulatory agencies, potentially easing the regulatory environment for digital assets.\n\nWhile the immediate threat of an enforcement action has been alleviated, Consensys and the wider crypto industry are looking towards further clarifications in regulatory policy. Consensys in their lawsuit also seeks a federal court ruling regarding their operations, asserting that they do not act as brokers nor issue securities through their software offerings like MetaMask Swaps and Staking.\n\nAs stated in their lawsuit, “Consensys is built on creating software products that allow people around the world to use and build on top of the Ethereum network, and it is entitled to run its business without the cost, burden, and uncertainty of an unlawful enforcement action.”\n\nAt press time, the price of Ether (ETH) has responded favorably to the SEC’s decision, showing a notable increase of 3.3%, bringing it to a current trading price of $3,561.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZmtHaHBoeEMxdUdVUjM4cWh0eWhYZXA5YWc2bE1jZmJtdkVNVnVmajB4eWRNZVdlYXl2UkRPXzR4dHJqWGhmTzZkV1VMRERPbmZfejJLa3lqUTdjMUdHaktOcFVTTDgybkRhallaWmswYWtBVkJiLTZSYl9MSk91Wi0ybWg2V0NNRjdZeDZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Unleashes a Huge Wave of Liquidations! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nTurmoil reigns again in the crypto markets, shaken by a violent financial storm. Indeed, a sudden surge in position liquidations has swept across the ecosystem in the past 24 hours. This unexpected tidal wave has brought Ethereum to the forefront, potentially marking a decisive turning point in the evolution of crypto investment trends.\n\nStaggering Figures Galvanize Crypto Investors\n\nAccording to the data, total liquidations jumped 78.8% in one day, surpassing 75 million dollars, even as total open interest declined by 0.35%, to 66 million. In detail, 43.9 million long positions and 31.6 million short positions were liquidated.\n\nHowever, it is Ethereum that dominates, with over 19 million in liquidations, including 5.6 million in longs and 13.5 million in shorts. This amount is significantly higher than Bitcoin’s, at 8.2 million. This feverish surge undeniably propels Ethereum to the forefront of the crypto scene.\n\nCrypto Liquidations\n\nA Rebalancing of Forces on the Chessboard?\n\nThe main platforms concentrate most of the movements, with Binance capturing 38.7 million in liquidations and OKX 23 million. Beyond the figures, this episode could mark a major turning point in crypto strategies. The increased volatility of Ethereum, combined with its potential, could indeed prompt many investors to reconsider their allocations.\n\nA dynamic of capital redistribution in favor of Ethereum and promising altcoins thus seems to be emerging. This show of strength could initiate a lasting paradigm shift, where diversification and calculated risk-taking become the new watchwords.\n\nThese jolts may be only the beginnings of a profound reconfiguration of balances in the crypto universe. By taking the lead in this surge of liquidations, Ethereum appears to send a powerful signal in favor of increased diversification of investment portfolios. A new era might thus dawn, where wise risk management and the exploration of varied opportunities become the new niches for success in these turbulent markets.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOZmlPcVRFUkF4YXBESk40UVhkdXY2bnR3eG5zOTZnWVVQcVBrYVkzWFFEWldMTW1RTFU3WU9aT1ZTdzV0N0gwaXVTNk1RdXRtcUxnUTlLT3c2ZzJpZGEzTzNrZDJjbTlUczZCaGNrN0E4V01BRzQtRXQweXY2MVVEenlwcVpNdGtFSU10eTdTVUY3bVJzOElwd0dn0gGfAUFVX3lxTE1TaTNUU092SkIwMnRLZWY1MHJFUUdSRXVGT1pMb3ZqN3NEZnZSLXIxUGVoaWFoR0tKUVVXdmR1SFhwTEtqVHBuUmpMbmRmQUVqNC10Vl9kZnVRaG1CVjV6eWFIbUIyd0RYc3F3QkpVM1VIeDJSTHRFR2FMaDhERUYxTkJ0SXN5aUF4R2pVX2hSWkpZTm5SOFUzZm5EX0s3aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "This Crypto Investor Lost Nearly $4M in Ethereum (ETH) to Armed Robbers - CryptoPotato",
        "content": "A cryptocurrency investor based in London has lost almost all his digital asset investments to armed robbers following a physical attack in his home.\n\nAn X post by the victim, pseudonymously named Ram, revealed that the three thieves were armed with machetes and forced him to transfer all his crypto to certain accounts.\n\nInvestor Loses $4M Crypto to Robbers\n\nAccording to Ram, the robbers were aware of his residence and knew he had crypto. Upon arrival at his home, they forced him to open his Ledger wallet and transferred over $3.7 million worth of ether (ETH) to their addresses. Ram said he was lucky not to get stabbed.\n\n“This just happened – 3 guys physically robbed me at my home. They were armed with machetes. They knew I had crypto and knew where I lived…I’m still in a state of shock. This is one of the worst experiences of my life,” the crypto investor stated.\n\nData from Etherscan shows the transactions moved 1,098 ETH from one address and 13 ETH from the other. With ETH trading at around $3,400 at the time of writing, the stash is collectively worth more than $3.77 million.\n\nDue to the theft, Ram’s wallet addresses now hold less than $63,000 worth of crypto assets, including StakeWise (SWISE), Unibot (UNIBOT), USD Coin (USDC), Staked Aave, and FOX.\n\nKraken Investigating Incident\n\nThrough his tweet, Ram sought the help of on-chain sleuth ZachXBT and crypto exchanges Binance, Coinbase, and Kraken to recover the funds. Digital asset influencer and investor James Crypto Guru revealed that the thieves were selling the assets on Kraken through the Bitrefill payment gateway, tagging the exchange’s support team to look into the matter.\n\nIn response to James’ tweet, the Kraken Support team disclosed that they were investigating the situation; hence, Ram faces the possibility of recovering some of his stolen assets. Ram’s experience highlights the importance of investors keeping mum about their crypto holdings.\n\nWhile offline crypto thefts are rare, online attacks have remained on the rise. Recently, decentralized finance protocol UwU Lend and omnichain tokenization platform Holograph lost $20 million and $14.4 million, respectively, after attackers exploited vulnerabilities in their smart contracts."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQanBlMXI4OUMyR2pmc0tpandGczVCVGZnUmdUN3hTSkV4NF9nYkJmU3d0aEdYakRWYnVoemlZaDNESm1ZLU5kUlBhQzlmVE5VQnZzckFRbTVZZjBoZ2tHRnhFcTBzclRGWjVaWmhrYlNPWUl5elFnQ2ZvY192NFBvUjVGMGVubFhGSmlYdEZDb1Y5WVk2TEtuZHVtX3pxMlZyOTBCYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "1 billion dollars at stake! Ethereum dominates the crypto market in May! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn May 2024, the crypto sector experienced a wave of investments totaling 1 billion dollars, with Ethereum dominating the market. According to a report published by KuCoin Research, although this figure represents a slight decrease compared to April, it marks a 10.61% increase compared to May 2023.\n\nEthereum reigns over the crypto market in May!\n\nThe recent research highlights that projects related to Ethereum, Ethereum Virtual Machine (EVM)-compatible chains, and layer-2 (L2) networks continue to captivate the interest of institutional investors. These technologies offer scalable and versatile crypto platforms for decentralized applications, essential to the evolving blockchain ecosystem.\n\nDespite the predominance of Ethereum-based investments, non-EVM chains such as Bitcoin, Solana, Fantom, and The Open Network (TON) have also maintained their popularity among crypto investors. With a total investment of 1.2 billion dollars in May, these networks are gaining traction due to their unique capabilities and growing ecosystems.\n\nMemecoins are also part of the game!\n\nDue to concerns over the trend of low float and high fully diluted valuations (FDV) in the crypto market, many retail investors have turned to memecoins and celebrity-associated tokens. These assets, often launched with lower market caps and more accessible valuations, have provided an alternative to high valuation tokens with limited circulating supply.\n\nNotcoin (NOT) is a remarkable example of this trend, as the token gained significant popularity in May. Unlike many tokens that gradually release their supply, Notcoin was launched with all tokens available from the start, which contributed to its rapid growth. On June 3, NOT became the fifth most traded crypto, surpassing the trading volume of the popular stablecoin USD Coin (USDC). Its price reached a new all-time high of $0.02896 on June 2, pushing its market cap above 2 billion dollars.\n\nCrypto investments in May 2024 reflect the continued confidence of investors in Ethereum and associated technologies. And this, despite a slight decrease of 70 million dollars compared to the previous month. The future seems mixed but anything is possible in the cryptocurrency space.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxON0xodHBfSnVmRG9iMGVDRnVIQ01mZ1AzUjIxdkFtQTBLZUcxOVF6bVpMaEdCN2dtck1hTlUxdHM2dmZtRW1HYTNrMUJPSHl0clBwWHVqcGU4ZFhEaWRHbjNCVEZNaUZ0NXUxX3I5aHpKa20xV19WS1ZYSVAzU1dxSV9DQXBnNWp6NkxDUUNBUXBfbXNUeFZXTWVHem0xLWhiU1p2aVJvTDZEOVRGZndIejY3dDdJY2l2Z1Vr0gHAAUFVX3lxTFBQR1VlaTFhOEdwcTR0MURodE5CTlRDZ3Rvd1lpT085eEZoS3VWUmZacDM0MFBWVW1aUFQ2S3k2WE5lN2ljbF9GUHI5NVd2MFdibC1OVHdPUHE5WEY1NGFLMTdLbjFQOGRFLWNLalRHYXQ1UjJCM2FDand0NE5IWm1KRkFQTDljWmZtRlZGQmdQS2t1dkRQSWZuRXdVYTBLdHN5Z3VNX2xrZFdJMXRpTEpDYmRNbER1d3BzVWhzaW5GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Watch now: ETF Edge on India, Ethereum & Gamestop... Plus, Kyla Scanlon on her \"Vibecession\" - CNBC",
        "content": "[The stream is slated to start at 1:15 PM ET. Please refresh the page if you do not see a player above at that time.]\n\nCNBC's ETF Edge is dedicated to the fastest-growing trend in investing right now: ETFs. Every Monday, Bob Pisani will be joined by a panel of top market participants to offer educational and actionable advice to help you build your best portfolio."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNZ24tVlN0Ym9wVUtyclF1WUxVYU1kYm8xczBoUFFVUkU3d29mYzRWZXZJRDJGV1VSMWRVdHV2QzFqeHNQR2MzdnlnSmw1ZjItRklMTW9mMHlaS2JYMGdQSi1yMkFDREN4LXkwMzBPWTBJRkZpWHBpckJsZ0Y2TndmR0NUSVBuRVlGdVJKams5UUZySExramdZalNtZ0RwUWMyQk9rYWxLMXh5UVhU0gGyAUFVX3lxTE5PNjQ5LW5PUGVweHktZWF2WTRTTXFhRmhGb1hIOXdkS21DcUhLTWFRS2VJVVozeEFyZmJhV0Vjd0RyLUx5U2NFN0JNOFpBeGpYc3lScGlIVzBHY1dWXzNycnJUNmFPQUlObzlKUjhDaG1uRDNqdFNma2x0cXhFNXBBWXcxSUc3NndyM0hNUDZ5ZGNaUmNsdWlJZVpGakhhdWNXWGp1X0lham1CeUl1ODhWMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prices Today June 18: Bitcoin Nosedives To $65K, Ethereum Sinks 5% Amid Bearish Market - CoinGape",
        "content": "The crypto prices today rode a bearish wave as Bitcoin (BTC) slipped to the $65K mark, whereas Ethereum (ETH) showed signs of a pullback. Altcoins Solana (SOL) and others mainly followed, with Dogecoin (DOGE) and Shiba Inu (SHIB) meme coins noting a dip of 9%-13%. However, XRP traded in the green, defying broader market trends.\n\nThe global crypto market cap saw a significant 3.14% decline to $2.35 trillion, although the total crypto market volume from yesterday spiked 104.01% to $94.07 billion. This follows whopping outflows recorded across the crypto sector, triggered by the U.S. Fed’s recent hawkish stance.\n\nadvertisement\n\nHere’s a collection of some of the top cryptos and their price movements today, June 18.\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe BTC price chart illustrated a faded movement today, nosediving to $65,374.98, down 1.39% over the past day. The token’s 24-hour bottoms and highs are $64,597.25 and $67,252.08, respectively.\n\nBitcoin’s dominance stood at 54.87%, a 0.93% jump over the past day. The token boasted a waned market cap of $1.29 trillion. This drop comes in the background of nearly $146 million outflows recorded in the U.S. spot BTC ETFs, per data by Farside Investors.\n\nEthereum Price\n\nETH price traded primarily in the red in the past 24 hours, falling 4.39% to $3,428.45. The token’s 24-hour lows and highs are $3,371.59 and $3,591.67, respectively.\n\nEthereum boasted a market cap of $419.50 billion.\n\nSolana Price\n\nSOL price corrected 9.25% over the past day to trade at $134.26 at press time. Solana’s 24-hour slumps and peaks are $130.16 and $148.95.\n\nXRP Price\n\nHowever, the Ripple Labs-backed crypto noted slight gains of 0.33% over the past day to reach $0.4893. XRP’s 24-hour lows and highs are $0.4808 and $0.5194, respectively.\n\nDOGE & SHIB Prices\n\nBesides, the meme coins sector mimicked the broader market’s tumbled movement. Dogecoin (DOGE) fell 9.74% from yesterday to $0.122, while Shiba Inu (SHIB) fell 12.12% to $0.00001802. Further, Pepe coin (PEPE) plummeted 11.84% to $0.00001055.\n\nAlso Read: GameStop (GME) Plunges 13% After Unexpected Announcement From CEO\n\nTop Crypto Gainers Today\n\nThe only top gainer for today was XRP, per CoinMarketCap’s data, with its price action facilitated above.\n\nTop Crypto Losers Today\n\nzkSync (ZK) price crashed 30.23% to $0.2002.\n\nFantom (FTM) price plummeted 20.69% to $0.5013.\n\nEthena (ENA) price plunged 18.89% to $0.6021.\n\nStarknet (STRK) price dipped 17.82% to $0.7444.\n\nMeanwhile, it’s also worth mentioning that BTC and ETH noted gains in their hourly timeframe charts, underscoring a tussle to gain upside momentum. Similarly, altcoins SOL, XRP, DOGE, and others followed.\n\nAlso Read: Ex-SEC Official Denies Joining Memecoin Platform\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNN3prRFRuRlpFNmFPYm1tdEg1TW5RWGxQQkpyLTUtTmtZVlFBeXU0LUFiUThQOEY1cjVfV0ZTVzZyaThSUi1yU3Azem0taktlNU02SkJITmJmRERweC1Vck5laVlybTJ4ZFF5MDhUQkN3dFZIdXFWZFUxQTl2cUNULTFwaVl4Tmk2V3lFV1dxWGg3T05CNUw5M2hEUE9wQmVBSmlxMDhHWUwzSlBaNkHSAbMBQVVfeXFMTVJ0MnFVcnduN1JfTEE2MmJ2Sjd6Z052Q0J4SWhyTENoQVhRTDJsYUVEYWdkRS1sUGNMNTJqby1YeGxkajV1YVBFdVh0M1BFTjU0LVNQUjI2RzRiRlhTMGRGY3JYSmdGTFk4ZVQwMkZTc2Z2anRYUVVrY2M5VnpmbFMweEFRLXhJSUxRb0dfbGROeVBKclhyTWFTdEplWE5OSGlMUVN2Q3RpS0NBZGJJOVFYUk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Is ETH in Danger of Falling to $3K or Will the Bulls Wake Up? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has landed on a decisive and substantial support region following a brief consolidation correction stage, with potential for a bullish reversal.\n\nHowever, if Ethereum sellers breach this pivot, a cascade in the market is likely.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA closer look at the daily chart shows that Ethereum has reached a pivotal support region after a brief consolidation correction stage. This region encompasses the price range between the 0.5 ($3421) and 0.618 ($3289) Fibonacci levels, aligning with the substantial support of the 100-day moving average ($3412). T\n\nThe alignment of these support indicators highlights the strength of this critical level and the prevailing demand at this juncture, which could halt further downward pressure.\n\nA battle between buyers and sellers is expected at this pivotal price range, leading to heightened market volatility and potential liquidations. The outcome will likely determine Ethereum’s upcoming trend. If sellers overcome buyers and breach this crucial support region, a cascade toward the 200-day moving average at $2996 will be imminent.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, Ethereum formed a head and shoulders pattern, resulting in increased selling activity and a break below the pattern’s neckline.\n\nThis development and a bearish divergence between the price and the RSI indicator have heightened bearish momentum, leading to a significant downward movement. Following this, Ethereum has formed a descending flag pattern, a well-known bullish continuation pattern if breached from the upper boundary.\n\nCurrently, the price is hovering around a critical and decisive support region marked by the 0.5 ($3420) to 0.618 ($3289) Fibonacci retracement levels and the flag’s lower boundary. This area is experiencing intensified volatility and fluctuations.\n\nIf sellers break down this crucial support, an impulsive downtrend targeting the $2.9K support is expected. Conversely, if sufficient demand returns and shrinks the existing supply, a reversal towards the flag’s upper boundary at $3.6K will likely occur.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum’s price has experienced heightened selling pressure near the $4K mark, leading to a significant decline. This likely stems from participants’ aggressive interest in opening short positions near this pivotal level. Analyzing the potential liquidation levels is crucial for determining the mid-term price targets.\n\nAs the chart demonstrates, a significant amount of liquidity resides above the crucial $3.9K mark, potentially representing buy-stop orders from notable short positions around this critical juncture. This liquidity region is likely to be the main target for buyers if demand returns to the market and the price experiences a bullish reversal near the $3K threshold.\n\nReaching this crucial liquidity range would likely lead to increased market volatility and potentially trigger a short-squeeze event, where short positions are forced to cover, driving the price higher. Nevertheless, if the selling pressure continues and Ethereum fails to reclaim higher levels, the price may continue to consolidate or decline."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBaV2Jrb20zU28xdl8yUlA1VEhPUzVhQlBXc1AtQi15OThPc3pfdXg0UGtFcUpoVGFtRTVmcTdjdnhyblBpWEd2d2NCaHBBam5Gb0RBOHJuZEd4cTRuemlOQnBPOUloVExFZmFXMW5EUk1Jd1FoYVdLWm1vQ1DSAYIBQVVfeXFMTzlTdGtjNVpkQXNmY3lXbHRYMHBrWV9ZQWFQSHZkcE1EYnBIZzd2U2NoTkV5WjBydXV3aVlZMzNwTnFhaDBNNWpRaTgtRnFqQW95WWdFQkRyZXprakJUdXRVVFJkbmlQS3BFZmJ2SEFobnNDR3JEeXB3MEZEcXR1Vk8zdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s big hint: Last chance to buy ETH at $3,500? - AMBCrypto News",
        "content": "Ethereum’s price declined by more than 3% in the last 24 hours.\n\nA key indicator suggested that ETH was near its market bottom.\n\nEthereum [ETH] bears continued to dominate the market as the token’s weekly chart remained red.\n\nHowever, the entire situation can change, as the latest data revealed that this might be the last stage of the accumulation phase for altcoins.\n\nSince Ethereum is the world’s largest altcoin, the chances of ETH gaining bullish momentum seemed likely.\n\nLast chance to buy ETH\n\nCoinMarketCap’s data revealed that ETH’s price dropped by more than 3% in the last seven days. At the time of writing, the king of altcoins was trading at $3,553.33 with a market capitalization of over $426 billion.\n\nMeanwhile, Milkybull, a popular crypto analyst, posted a tweet highlighting how altcoins were following its 2020 trend, which resulted in a massive altcoin season then.\n\nIn 2020, the altcoin market cap broke out of a pennant pattern, initiating a bull rally. A similar pattern has once again emerged, hinting that this might be the last opportunity to buy alts, including Ethereum, at a lower price.\n\nHowever, AMBCrypto’s analysis of Santiment’s data revealed that investors were not capitalizing on this opportunity.\n\nWe found that ETH’s exchange outflow declined over the last week. Additionally, its supply on exchange also increased, meaning that selling pressure on the token was high.\n\nIs Ethereum awaiting a rally?\n\nSince Milklybull’s analysis hinted at a bull rally, AMBCrypto then analyzed ETH’s on-chain data to see whether it supported the possibility of a price increase.\n\nEthereum’s Pi Cycle Top indicator revealed that ETH was resting near a market bottom, hinting at a price uptick.\n\nIf that happens, then ETH might soon reach $4.92k. For starters, the Pi Cycle indicators are composed of the 111-day moving average and a 2x multiple of the 350-day moving average of Ethereum’s price.\n\nThe possibility of ETH gaining bullish momentum seemed high, as at press time the token’s fear and greed index had a value of 38%, meaning that the market was in a “fear” phase.\n\nWhenever the metric reaches that level, it indicates that the chances of a bull rally are high. We then took a look at ETH’s 12-hour chart to better understand what to expect from the king of altcoins.\n\nThe technical indicator MACD displayed a bullish crossover.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the rest of the indicators looked bearish. For instance, the Relative Strength Index (RSI) registered a downtick.\n\nThe Chaikin Money Flow (CMF) also followed a similar declining trend, suggesting that it might take a bit longer for ETH to begin a bull rally."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNblZ6R05wNFl0VUhwYzhzMmZtS3RYVzAtWXEyMkptckhGX2ZhWkktWmZ6OHU0d3hyUjZBQ3p2el9QTnlsYk56cW9qZ2JpZnBHbG9VVEtjTDNoRFlwa0hxakJSSEY3QnFnUDdidXlCMFctclBHS1hBLUFZMzVBTmN1TF83U0c1Ni1STVlRN2lR0gGTAUFVX3lxTE96WHdzSU1BS0VtNkdlYjZfVVlidmxnbkpDclJ2N2lGR0Z2eThmdmdjNjlVRlVTTnVqSjFhN0hNSW9SSlFJWHU1WFJxX2tlLUpGYkRTcFVWUTFzWGhja1hRMVZmZ1gzb0JVa3U3TGdsU003MkdvNzdOZUJNU2tycVRodkFqZWxSVmFuX0JRN3M2Sjlnaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Solana beats Bitcoin, Ethereum on THIS front: Will SOL also rise? - AMBCrypto News",
        "content": "SOL’s monthly NFT transactions were much higher than Bitcoin, Ethereum.\n\nETH’s weekly sales volume increased, while SOL and BTC dropped.\n\nSolana [SOL] continued to dominate the NFT ecosystem last month, followed by stalwarts like Bitcoin [BTC] and Ethereum [ETH].\n\nLet’s dive deep into these blockchains’ performances in the NFT space to better understand who is actually leading the market.\n\nSolana takes the cake\n\nCoin98 Analytics recently posted a tweet highlighting the performances of multiple blockchains in the NFT space.\n\nAs per the tweet, SOL was the market leader last month in terms of the total number of unique traders, as its number touched 308k.\n\nSolana was followed by Bitcoin and Ethereum, which had 129k and 74k unique traders, respectively. Polygon [MATIC] and Aptos [APT] completed the also made it to the top three of the same list.\n\nSolana also outshines the rest with a whopping 5.2 million monthly NFT transactions. On the other hand, BTC and ETH’s numbers stood at 550k and 437k, respectively.\n\nAMBCrypto’s look at DappRadar’s data revealed that STEPN, Mad Lads, and Famous Fox Federation were the top 3 NFT collections on Solana in the last 30 days.\n\nNodeMonkes, Bitcoin Puppets, and RuneStone were the top three BTC collections.\n\nMeanwhile, Bored Ape Yacht Club, Milady Maker, and Mutant Ape Yacht Club sat in the top three positions on the Ethereum blockchain.\n\nIt was interesting to note that despite topping the chart, Solana’s monthly NFT sales volume dropped by more than 40%. AMBCrypto reported earlier how BTC outshines ETH in terms of monthly NFT sales.\n\nHowever, a similar decline trend was also noted on BTC and ETH’s NFT sales volume, as they fell by 62% and 52%, respectively.\n\nNonetheless, SOL’s number of buyers and sellers increased by double digits, reflecting high activity.\n\nThings changed in the past seven days in terms of growth as ETH outperformed the rest. CRYPTOSLAM’s data revealed that ETH’s NFT sales volume increased by 17% last week.\n\nIn the meantime, SOL and BTC’s numbers dropped by 18% and 37%, respectively. Notably, ETH also had the highest sales volume of over $40 million, while SOL’s number was the lowest as it stood at $14 million.\n\nSOL, BTC, and ETH’s state\n\nWhile the NFT market witnessed a change in trend last week, all the cryptos’ prices turned bullish.\n\nOn one hand, BTC and ETH’s prices dropped by 4.4% and 3.4%, respectively, and on the other hand, SOL dropped by nearly 10%. At the time of writing, BTC was trading under $67k.\n\nAs per CoinMarketCap, at press time, ETH and SOL were trading at $3,558 and $144, respectively.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe bearish price actions also took a toll on these cryptos’ social metrics.\n\nAMBCrypto’s analysis of Santiment’s data revealed that SOL, BTC, and ETH’s Weighted Sentiments dropped, meaning that bearish sentiment around them was dominant in the market."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNalBualVGMkY0bnVsdmFHeDgtMkx4SkNJZllid2xHWS1pM1BOXzdRZUtIT0drZGZWaTVJZTBUTEZBNXFib3llV0FTZE5lV2xXY0J4eEdPZzU2emFmWG42Q0VMZjZpNGdCZFpMXzNyTzZOOHY0Z2ZPWXdqVmtyZmhIbk5lT05wV2vSAYwBQVVfeXFMTzJTdUlBUVlzellwb0h3REF0TWFtUGNObXRFRFBwUTdkamRvOVhXek5MX2lNTnlRM1pEeWRIckMwV1pZbGQ2QU1NQ2RZWHRfeEVmWGtvQkx4Tkt3VWZEY0llU242TTEtbko0bXA5NHoxU2IzdHpJTlV3dUt5U3VkUGVOTVdFdzU1Vk5wUTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "NFT market revival: Ethereum takes the lead as sales surge - AMBCrypto News",
        "content": "NFT sales volumes grew by 10.95% over the last week.\n\nEthereum regained the top spot in the NFT sector.\n\nWhile crypto investors weren’t initially flocking to NFTs in 2024, the past few weeks have seen a shift in the market. NFT sales are on the rise, with some collections experiencing significant surges in activity.\n\nThe NFT market recently saw gains for the second consecutive week with sales up by 10.95% during this period.\n\nBlue-chip blues\n\nHowever, the picture wasn’t entirely rosy. Ethereum-based NFT big names like Bored Ape Yacht Club (BAYC), Mutant Ape Yacht Club (MAYC), and CryptoPunks haven’t seen uniform growth.\n\nCryptoPunks’ sales volume dropped a hefty 59%, and the average holding time for these digital avatars has also dipped. This suggests some investors might be offloading their Punks.\n\nMAYC, on the other hand, witnessed the same level of disinterest. The sales, though down 53% compared to earlier highs, show a different story.\n\nThe average holding time for MAYC NFTs skyrocketed by 74%, indicating investors are holding onto their Mutant Apes with confidence.\n\nApeCoin sees no love\n\nDespite the resurgence in MAYC popularity, ApeCoin, the cryptocurrency linked to these Ape collections, hasn’t mirrored the growth.\n\nApeCoin’s price has actually fallen by nearly 16% in the past month. Even if the resurgence in interest in Ethereum NFTs hasn’t helped ApeCoin, the future of the token looks extremely glib.\n\nThe rise of Ethereum NFTs like MAYC and CryptoPunks has propelled Ethereum back to the top spot in the NFT space. For months, Bitcoin dominated NFT transactions, but renewed interest in Ethereum NFTs has revitalized the network’s overall activity.\n\nAccording to CryptoSlam’s data, the Ethereum network saw $154.8 million worth of NFT sales being made on the network over the past month.\n\nThe surge in activity on the Ethereum network can also help improve the overall sentiment around ETH and help the altcoin in terms of price movement.\n\nBitcoin has been pushed to second place in terms of NFT volume. While collections like NodeMonks and Bitcoin Puppets remain popular, Ethereum’s resurgence has shifted the focus.\n\nIf activity on the Bitcoin network continues to decline and investors lose confidence in Bitcoin NFTs, the price of BTC can be affected negatively.\n\nSolana remained a close third in NFT volume, with Polygon trailing just behind."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQZVBIbFlLUk5FdmRfdXJkT1g2VVVaNkRwalBrT0ZjVVRGRm5uWmlBMXUteHI5UTVPZ0piUVlPWkdaUm1PV3dRUlF2NmhVY3VCMGtNR2hGR1lFaEpNT1Zfd3ZyeDZTaV9kZ3F1Uk5iMWVFRTZZajk4TUFzSkU3MmU1MHBiLWZIVE3SAYwBQVVfeXFMT3JVRlRnVnNaVUFqMGNzSzI4WEJTOURFdU9yVWdkY2pndWxPQUlZenNWSlBDSTQ4cTNXc3MwRlNGUVgxeTBKbEhIYktaajRtRlNqbFFKaXZVY1BKWUEtZ3RGSmR6c3oyM25KMVNVYWFHeWVTNEp1czh2alB4Y1A3SWI4NmdjX1E1YVMyUGQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Restaking EigenLayer Goes Live On Coinbase, What’s Next? - CoinGape",
        "content": "Ethereum’s restaking protocol, EigenLayer, has officially launched in full trading mode on Coinbase International Exchange, sparking renewed interest in the cryptocurrency market. This move marks a significant milestone for EigenLayer, a protocol that enhances returns by leveraging Ether staking to support the Ethereum blockchain.\n\nNotably, the launch has fueled optimism among investors, who see this as a potential catalyst for market growth.\n\nadvertisement\n\nEigenLayer Goes Full Trading On Coinbase\n\nCoinbase International Exchange’s recent announcement regarding EigenLayer has caught the attention of the crypto community. The leading crypto exchange has transitioned EigenLayer’s EIGEN-PERP pre-launch market into full trading mode, allowing for various order types, including limit, market, stop, and stop-limit orders.\n\nNotably, this transition follows a brief period in post-only mode, where users could post and cancel limit orders without actual matches being made. Precisely, the move to full trading mode has generated excitement among investors, with the potential to boost market sentiment significantly.\n\nMeanwhile, major exchanges like Coinbase, Binance, and others, often influence crypto markets through such positive announcements. The market’s focus has now shifted towards EigenLayer’s innovative features and its implications for Ethereum staking.\n\nEigenLayer’s primary appeal lies in its restaking capability, which amplifies returns for investors by allowing them to deposit Ether coins in support of the Ethereum blockchain. This unique approach offers a new avenue for maximizing yields within the Ethereum ecosystem, making it attractive to investors looking to enhance their staking returns.\n\nAlso Read: Vitalik Buterin Lauds Relevance Of Community Notes, Here’s All\n\nThe Project’s Controversy\n\nEigenLayer’s recent developments have not been without controversy. The protocol’s highly anticipated token distribution through an airdrop faced backlash due to the exclusion of users from the United States and China.\n\nDespite raising approximately $165 million from prominent backers like a16z Crypto, Eigen Labs’ decision to restrict access to residents of certain countries has raised regulatory concerns. Besides, it also sparked debates within the crypto community.\n\nMeanwhile, this exclusion has overshadowed the airdrop program, despite its success among eligible participants. Notably, Tron Founder Justin Sun managed to secure over 3 million EIGEN tokens from the airdrop, valued at around $30 million. Such significant acquisitions highlight the potential value and impact of EigenLayer’s tokens in the broader market.\n\nNotably, the controversy surrounding the exclusion of specific jurisdictions underscores the regulatory challenges faced by innovative decentralized finance (DeFi) projects like EigenLayer. However, the successful transition to full trading mode on a major exchange like Coinbase signifies a crucial step forward for EigenLayer, potentially paving the way for increased adoption and acceptance within the crypto community.\n\nAlso Read:\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOcHBlemd3X2pfNDhxYkFITVpmNVhsZnRtM1J3bW5fUG9pSl9mNFdZdHo0SE9PZnhoSEVMRmlsOWFtM2tseUN0Rk1JOFl6enJvbks0ZzJoSnFoRUE1TlBsOF9BUURXeno0ckdmQzU3WTBQSDBhb2YwOEpZdVc3VE5wWHhMT3Yxek83cThvWU0wWWjSAZ4BQVVfeXFMTlcybk1GY1hsU0RUeFg2bUs1QndNY1VFSDJrRTkzM0VYWENkQVRKTm45elRCdTlJdUJ5LXpEdE5wR0FHbDBCbjNuVEZSdEFSd2daQllxamRiSFJTX1l6WS1LUnV5bDd6ZnZsNlRib3ozNGd4d3hfYTB5dEk5b2xKdXRTeW9kT25OaFBNSjJsTHBkY01NUzYxN0pQYXV0S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 18, 2024 - Analytics Insight",
        "content": "1. Market Adoption:\n\nThe use and popularity of Ethereum to support decentralized applications (DApps) and smart contracts elevate its necessity and requirements. It is also important to note that large banks and other forms of financial companies that invest in Ethereum’s technology can also have a positive effect on its Price.\n\n2. Regulatory Environment:\n\nInformation on changes in regulations greatly influence the Ethereum market. Temporary fluctuations in prices might be attributable to the latest regulatory changes in the major markets such as the US, EU, and Asia.\n\n3. Macroeconomic Factors:"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNMHJsck5LMjNpVEFqMHZBNUllQkFmY0FrSW1GQ2VLWm1SY0JtcVU5d3RXd0NmOVJQWjYweUFHdTdfZWFIZjdwS2xnTEFuRnVvRG1jYjRkZzlCdXNoZ1huZlAyUkltTklqQ1FfUGJxWU05ZlFPRm5MaW8tRU5QQmRxd01CYTVTWGZZWTRBenQ4bGhTQ2tSVTA5OE80YUR4elhNdFJnNFZKbXBQNUVabmJLanMxZlFUdzk5SDI2cl80SkowWHRfeFhmRnJJT1haYnpma2xRemRjSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "RCO Finance Takes Crypto and Ethereum DeFi By Storm, 3 Key Features that Make It Unique - The Portugal News",
        "content": "The crypto and Ethereum DeFi space is currently witnessing the emergence of an exceptional player, and astute crypto investors can't keep calm! RCO Finance (RCOF) has made advanced AI technology accessible to all, raising a storm in the crypto world with this unprecedented solution.\n\nBy Advertiser, in Crypto · 17 Jun 2024, 12:00 · 0 Comments\n\nWe'll explore the three key features that have everyone raving about RCO Finance (RCOF) in this article and its presale opportunity poised to turn modest capital into substantial returns!\n\n\n\n\n\nRCO Finance Makes A Firm Stand With Three Key Features\n\n\n\n\n\nRCO Finance (RCOF) is not your typical DeFi project. It has quickly gained traction as a comprehensive platform for everything decentralized finance, especially with these three key features;\n\nAutomated Market Making (AMM): Unlike traditional investment platforms and even some DeFi protocols that require manual trade execution and constant monitoring, RCO Finance (RCOF) has developed a fully automated DeFi trading platform that uses advanced AI and machine learning technologies to eliminate human errors and emotions, leading to better investment outcomes and more consistent returns.\n\nReal-World Asset Integration and Tokenization: One of the biggest challenges in the crypto space has been the divide between digital and real-world assets. RCO Finance (RCOF) addresses this by enabling users to invest in stocks, bonds, and real estate using their cryptocurrencies and bypassing the hassle of converting to fiat currency.\n\nAI-powered Robo Advisor: Many market experts argue that this is RCO Finance's (RCOF) best feature yet and one of the best AI trading tools in the entire crypto industry. This intelligent system uses historical price data, live price movements, trends, and news events to create tailored investment strategies based on individual financial goals and risk tolerance.\n\nBy continuously analyzing market conditions, the Robo Advisor adjusts portfolios accordingly, helping investors of all levels to make sound and profitable investments.\n\nWith these three key features, RCO Finance has risen above the competition, providing ease of investing, a bridge between traditional and digital finance, and dynamic investment strategies. Yet it has more to offer; keep reading to explore them!\n\n\n\n\n\nRCO Finance: A Gift That Keeps Giving\n\n\n\n\n\nRCO Finance (RCOF) continues to outpace many top cryptocurrencies by leveraging AI to ensure that even novice investors can benefit from sophisticated investment strategies once reserved for professional traders. Its user-friendly interface ensures a seamless investment experience as investors can easily navigate all its features.\n\nFurthermore, RCO Finance (RCOF) equally prioritizes privacy and security by conducting thorough, regular smart contract audits. It does not require any KYC procedures, ensuring that investors maintain anonymity while complying with necessary regulations.\n\nGiven its high leverage options of up to 1000x, RCO Finance (RCOF) enables investors to diversify their portfolios extensively and maximize their potential returns, even with smaller initial investment capitals. Besides, they also benefit from the tokenization of real-world assets.\n\n\n\n\n\nTurn $100 To $3000 On The RCO Finance Presale\n\n\n\n\n\nIf you've been wondering how best to take advantage of RCO Finance’s (RCOF) diverse offerings, consider investing in the project's ongoing presale. With the coin expected to officially launch at $0.4, a simple investment of $100 can yield up to $3000 if you purchase RCOF tokens at its current Stage 1 price of $0.01275.\n\nMoreover, RCO Finance's choice to build on the Ethereum blockchain has attracted many investors. Many experts view it as the next promising Ethereum token with substantial and sustained growth potential. This sentiment is driven by RCO Finance's impressive tokenomics, deflationary mechanisms, and a clear roadmap.\n\nInvestors are also encouraged to stake their RCOF tokens for rewards that amount to one of the highest APYs in the crypto industry. This approach has driven demand and stability for the token.\n\nHolding RCOF tokens grants access to community rewards surpassing $100,000 and enables investors to have a say in key decisions within the RCO Finance (RCOF) ecosystem.\n\nFor more information about the RCO Finance Presale:\n\nVisit RCO Finance Presale\n\nJoin The RCO Finance Community"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPUFBYamlVeTlzUVgxazBWZk85ZTJUb3hSVEF5aGZKRXpZTFpEZ2tHbXM0Tk9fQU9QTDNTWUdqU1dDSV9RVDBOQldRVkl1VC1uWEh3dUlGRlMxQmJ5VkJrdjJIUHZfN2Q0TjhkRUFfclBmb2xOLXg0X0FfTC1razZvMVN1RGFpQTl4TlVRMkQxbVPSAZ4BQVVfeXFMTmtVT0xSSEJIWU5ldzRLemN5LWdjcXB0eC1rY0tQT2NMYjJ6b0lMNkZVekRqNlR1blI3OWl3STFGTkZYLWVKeXp1VXR3d1RhcHlHc0pOVlRYdl8zM2pMWFFSQWptblprTEVpV25vRWJWZEptcmN3cnZFSmJ3WUxfc1dmUl9DcWNUZGlPWldZZ0ZzUTZBTDF0WnJYcHZyWGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 17, 2024 - Analytics Insight",
        "content": "1. 50-Day Moving Average: The 50-day moving average for Ethereum is trending upward, indicating a medium-term bullish momentum. This suggests that buyers have been relatively strong in the past few months, maintaining the price above this moving average.\n\n2. 200-Day Moving Average: Similarly, the 200-day moving average shows an upward trend, supporting a long-term bullish outlook. The Ethereum price staying above the 200-day MA signifies a positive long-term trend."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNX2g3QXduU3VQaHJ3X0JhQy1iUXZIYzc0SFFMSXVzR1VOcEliTkhFN0NUcUdRb2xnTFFPNWw2NlU3MzhBWV9GTVVqWVY5QXJ4bDZvQ0JINHdGc0c3b2NCUHFmMUpDLWdwTzZGVzdObERpTmVJQTdPREppMU83NjZOXzNIa0N4RW1LNUVYS2NnZ1g1OUdoTTNPSjhnMGQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Targets $3,300: Will ETH Rise 50% Versus Bitcoin? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is down when writing following yesterday’s contraction. Even though the community is optimistic, citing favorable fundamentals, sellers still control price action. For the Q1 2024 uptrend to be valid, Ethereum needs to close above $3,700 and reverse recent losses. If not, the odds of even more losses remain amplified going forward. Presently, the immediate support level is at $3,300.\n\nEthereum is down 3% in the last day and week. At the same time, the average trading volume is decent, at just over $20 billion. Traders expect prices to recover, shaking off the current weakness, in the days to come. When this prints out and there is a decisive high-volume breakout above the local resistance levels, participation will likely expand.\n\nTraders should monitor the following Ethereum news:\n\nEven though Ethereum is tracking lower versus the greenback, analysts are confident of its performance versus Bitcoin . By the end of the year, optimistic traders say ETH could post a 50% spike versus BTC . If this prints out, it would follow the same path as the 2019 to 2021 Bull Run.\n\nWhile the mainnet transaction processing speed remains low, scaling successes in layer-2 and 3 solutions have seen the combined TPS rise to all-time highs. This is primarily because of the explosion in processing speeds in Xai, a layer-3 platform.\n\nEthereum Price Analysis\n\nAt press time, ETH/USD is fragile.\n\nThe coin is trading below $3,700, slipping yesterday.\n\nThough the June 17 bar had a long lower wick, pointing to strong demand at the tail end of the day, earlier losses today validated bears.\n\nAccordingly, aggressive traders can short on every high, targeting $3,300. This preview aligns with the bear formation set in motion by the June 11 bar.\n\nThis outlook will only change when Ethereum soars above $3,700, ideally with expanding trading volume."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1lcndYalhPRDVrclBGZEVDUnVxYTZrUl9VYWZrTFdxLWlxWUVmdjNoQ3dHcE0zN1RPci11eU9HcjktcUdWSUpfMTJDWXBVc2lMa0xVenQ1QW9rZUpLNUdfZDExaEEyRlRZSFFHWFM5WEdIMkHSAXhBVV95cUxQQnI5YU9rRFpvVUhmTnZwdDRuNXJRTnFRWWVrc2F2dTJfR0hJaFFmakZCbDNodkxWVFAyT19JT3ZxWVJKSTlsMF9WVDJOZDhKNGZoeUFFMFVNN3EzMmxZT0g1NDNoNFBsYlY3TVYwa2hOV1RSRWFrek8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 03:32:35 GMT",
        "title": "Ethereum Price Support Retest: Is a Double Bottom Pattern Emerging? - NewsBTC",
        "content": "Ethereum price declined again and retested the $3,365 support zone. ETH could start a fresh increase toward $3,700 if it stays above $3,365.\n\nEthereum is still holding the key $3,365 support zone.\n\nThe price is trading below $3,550 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bearish trend line forming with resistance near $3,500 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could form a double-bottom pattern and rise toward the $3,700 resistance.\n\nEthereum Price Retests Key Support\n\nEthereum price failed to gain pace for a move above the $3,580 and $3,650 resistance levels. ETH reacted to the downside like Bitcoin and declined below the $3,500 support. There was a sharp move below $3,420, but the bulls were again active near $3,350.\n\nA low was formed near the $3,350 level and the price is again rising. There was a move above the $3,380 and $3,400 resistance levels. The price was able to clear the 23.6% Fib retracement level of the downward move from the $3,649 swing high to the $3,350 low.\n\nEthereum is now trading below $3,550 and the 100-hourly Simple Moving Average. It seems like the price could form a double-bottom pattern and rise toward the $3,700 resistance. If there is a fresh increase, the price might face resistance near the $3,460 level.\n\nThe first major resistance is near the $3,500 level or the 50% Fib retracement level of the downward move from the $3,649 swing high to the $3,350 low. There is also a connecting bearish trend line forming with resistance near $3,500 on the hourly chart of ETH/USD.\n\nAn upside break above the $3,500 resistance might send the price higher. The next key resistance sits at $3,580, above which the price might gain traction and rise toward the $3,650 level.\n\nA clear move above the $3,650 level might send Ether toward the $3,720 resistance. Any more gains could send Ether toward the $3,800 resistance zone.\n\nDownside Break In ETH?\n\nIf Ethereum fails to clear the $3,500 resistance, it could continue to move down. Initial support on the downside is near $3,380. The first major support is at $3,350.\n\nA clear move below the $3,350 support might push the price toward $3,250. Any more losses might send the price toward the $3,120 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,350\n\nMajor Resistance Level – $3,500"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9faGphc0Q3R1pXclEwQnFVQTBOc3FZMGU1SE50enFhU1lvdzJuemtGRGFSVmdxU0ZJaklpUUVPU0FqdHJPc0x6dmo5dFEyTVpYR2t4MWNxS0dKNUtSWGFKUVA1WXUxX1kzbnppQTV1RTNfeFk0LVBFUmktMNIBgAFBVV95cUxPdEwtdmtNUFdqanFpZkZUaTN5TFlEMy02aVN3Vk9ydXdRTG9DdjRXNzFtaHJ4NDRscWZLcG9tUldfTmtjZ01RLVpFaGw3NHZQcEE5TG44MXJWaUZCVEtNc04xT29yU1RaRUxrY1cyNkdvWjJUalNYSzdIZFk5MldWSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 15:02:44 GMT",
        "title": "Ethereum Foundation Moves $64.4 Million Worth Of ETH, Is This A Dump? - NewsBTC",
        "content": "The Ethereum Foundation is again in the news following its recent transaction involving millions of Ethereum (ETH) tokens. The non-profit organization’s Ethereum transactions are always significant, considering the impact they usually have on the second-largest crypto token.\n\nEthereum Foundation Transfers $64.4 Million Worth Of ETH\n\nCrypto journalist Colin Wu revealed in an X (formerly Twitter) post that a wallet (0x8e…D052) linked to the Ethereum Foundation transferred 18,089 ETH ($64.4 million) to a new address (0x87…D812). On-chain data shows that the new address has yet to transfer these funds and that the ETH holdings have yet to be offloaded on the market.\n\nRelated Reading\n\nTransactions involving the Ethereum Foundations are always concerning because the non-profit organization has a reputation for selling at the top. As such, the transaction of these funds is one to keep an eye on, considering that the potential sale of these tokens could mean that the Ethereum Foundation is again looking to catch ETH at the top.\n\nIt is worth mentioning that the Ethereum Foundation has already sold over 1,700 ETH since the start of 2024 with on-chain analytics platform SpotOnChain, noting that these transactions have always occurred ahead of a price drop. Therefore, a potential price drop if these 18,089 ETH are eventually sold is a huge possibility.\n\nDespite this development, Ethereum’s outlook is very bullish, especially with Bloomberg analyst Eric Balchunas stating that the Spot Ethereum ETFs could begin trading by July 2. These funds are expected to spark a significant rally for the second-largest crypto by market cap, with crypto experts like Ash Crypto predicting that Ethereum could rise to $10,000 thanks to these Spot Ethereum ETFs.\n\nETH To $10,000 Is The Most “Asymmetric Bet”\n\nCrypto analyst and trader Tyler Durden mentioned that the most asymmetric bet in crypto today is ETH reaching $10,000. He also highlighted Ethereum’s chart against Bitcoin and suggested that ETH was ready for that big move, considering it has traded sideways for eight months.\n\nThe analyst also suggested that the Spot Ethereum ETFs will play a massive role in Ethereum’s rise to this price level. He stated that Wall Street went through a lot of effort to get the Spot Ethereum ETFs approved and that they would ensure that they make money from ETH while pumping its price.\n\nRelated Reading\n\nMeanwhile, Durden boldly asserted that money would exit the Solana ecosystem and rotate to Ethereum. He claimed that Solana has lost its “main character and driver of liquidity”, which is why the money will flow into ETH. Interestingly, he mentioned that celebrities have “cannibalised,” which is why he believes that the capital rotation cannot happen the other way around with money moving from Ethereum to Solana.\n\nAt the time of writing, ETH is trading at around $3,500, down in the last 24 hours, according to data from CoinMarketCap."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQR0lNXzVaLU9xUDdOY1A0eTN6VjFVaHU5Q09Ld21Yak0xYW1MODZLdnVrUFd4VFJiU2tsMFY2bjc1dXhlV3lSNmU0VEhIMW84ZmhKWVRVelY2cF8yQTdSMmE1OW16eWZleVJzVDhGaWtKdWMwRmpscDJISURFSm0tVUpCUmNiamdRM2taUmRMN3RQdTRueWZuNXZQeEw2aUJMYWxhbTBHazlCNVZvZ3J6VHZWVmlJcmvSAbwBQVVfeXFMT0pFeC1GMkhPOGJvd1ZrSms5WUpRQ3owUmJ1ZWlYeVNlZjdZS04xbnR4OHh1RjBLREJ3TDgyeVkwZVd5cXJiWVUwZnRaanhndGxQQmZxbEkxUlV6U2lBanFnX01OZzNxR2hfNlJZcHcwSlZvYXl1ek4xRGZfWlVPWjNCMXB5YkpUMlpoVmpialAzODRTLVVWMWFSTjdWZlFQVG5JWWhCT1NTcnFZaGJ0dWNJRHVWS280WTgzcGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Price To Plunge To $3.2K This Crypto Market Crash? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nWith a surge of 74.63% in its trading volume and a price correction of 3.56% within the past 24 hours, the Ethereum price has plunged below its important level of $3,500. Furthermore, with the rising bearish sentiment, the market sentiments hint at a further fall in its value.\n\nNotably, the altcoin leader, ETH Price, has started this week on a bearish note by losing over 5% in valuation over the past 2 days. Moreover, the price continues its struggle to reclaim the $3,500 mark, indicating a negative influence in the crypto space.\n\nWith the ongoing cross-border market correction, will the Ethereum token make a comeback this week? Or will its price plunge toward its crucial support level of $3,200? Dive in as, in this article, we have covered the market sentiments and short-term price analysis of Ethereum crypto.\n\nETH Coin Price On The Verge Of A Major Break Down:\n\nAfter hovering close to its important support level of $3,700 for a brief period post Ethereum ETF approval by the SEC, the bulls failed to hold the value above its support level. This resulted in the Ethereum price experiencing a breakdown in its price chart.\n\nTradingView: ETH/USDT\n\nSince the breakdown, the ETH token has been constantly trading in a closed range between $3,400 and $3,700, highlighting a weak price action for the altcoin in the crypto market.\n\nMoreover, the altcoin leader has formed a symmetric triangle pattern in the 1D time frame and is on the verge of testing its support trendline, the outcome of which is uncertain.\n\nEthereum Market Sentiments:\n\nThe Simple Moving Average (SMA) displays a bearish crossover in the 1D time frame, suggesting a weak bullish sentiment in the crypto space.\n\nThe technical indicator, RSI, fails to gain momentum, resulting in it recording a bearish reversal above the mid-point. Furthermore, it is now headed toward its oversold range, highlighting an increase in the selling-over-buying pressure for the Ethereum token in the market.\n\nWill The ETH Price Go Up?\n\nIf the bulls hold the Ethereum crypto above the support trendline of the symmetric triangle pattern, it will test its resistance level of $3,730. Maintaining the value at that level will set the stage for the ETH coin price to attempt to test its upper resistance level of $4,094.75 this month.\n\nHow Low Will ETH Go?\n\nOn the contrary, if the bears overpowered the bulls, the Ethereum price will continue trading under a negative influence, break down its support trendline, and test its support level of $3,400 this week.\n\nFurthermore, if the bearish sentiment intensifies and the bears continue to dominate the market, the ETH token will plunge further and prepare to test its crucial support level of $3,000 during the coming time.\n\nAlso Read : Bitcoin, Ethereum, And XRP Price Prediction: Is The Bull Rally Over?"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE95cUF3VXh2MzNUb1pKTDA2MXNSR3hieXZ0NlpxNjNpVFY0TVpCZlBZbGdnaGtmc21pcnY3OUhyR0t5anNtZW9lVlpPRXBKMzdwOTRXV0ZiRkc3Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Down: Why is ETH Price Crashing? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "With Bitcoin (BTC) experiencing a week-long downward trend, Ethereum's price has also felt the impact of this market pressure, mirroring the current volatility in the cryptocurrency market. Ethereum (ETH) has seen a notable decline in its price lately. This fluctuation highlights the ongoing instability and interconnectedness of cryptocurrency prices. Yet, Why is Ethereum price crashing? Let's take a look at this in more detail.\n\nHow has the Ethereum Price Moved Recently?\n\nETH/USD Daily Chart- TradingView\n\nAs of today, Ethereum is priced at $3,561.84, with a 24-hour trading volume of $12.75 billion, a market cap of $427.91 billion, and a market dominance of 17.63%. Over the last 24 hours, ETH has seen a slight decline of 0.30%.\n\nEthereum hit its peak price of $4,867.17 on November 10, 2021. Its lowest price was $0.420897, recorded on October 21, 2015. Since reaching its all-time high, the lowest price ETH has dropped to is $897.01. The highest price it has reached since this cycle low is $4,094.18. Currently, the sentiment for Ethereum price predictions remains neutral, with the Fear & Greed Index showing a reading of 71, indicating a state of greed.\n\nThe circulating supply of Ethereum stands at 120.14 million ETH. Over the past year, the supply has decreased by 0.24%, equating to a reduction of 292,161 ETH.\n\nWhy is Ethereum (ETH) price down?\n\nThe decline in Ethereum's price can be attributed to several key factors. First, the anticipation of an important Federal Reserve interest rate decision and the release of U.S. inflation data are creating uncertainty in the market. Investors often react to such economic indicators with caution, leading to a decrease in buying activity.\n\nFurthermore, there is a noticeable shift in the behavior of Ethereum's largest holder groups. These major stakeholders are showing a reduced tendency to accumulate more ETH, which is contributing to increased selling pressure in the market. This combination of macroeconomic concerns and changes in accumulation sentiment among significant holders is driving the current downward trend in Ethereum's price.\n\nWill Ethereum Reach $4000?\n\nThe potential for Ethereum to reach the $4000 mark is supported by several key indicators and market dynamics. Over the past year, Ethereum's price has increased by an impressive 106%. This significant growth showcases robust demand and strong investor confidence in ETH. Such a substantial annual performance suggests a positive trajectory that could potentially drive the price towards $4000.\n\nIn addition to its overall growth, Ethereum has outperformed 50% of the top 100 crypto assets over the last year. This relative strength indicates that Ethereum is not only growing but also maintaining a competitive edge in the broader cryptocurrency market. This competitive position often attracts further investment and interest, contributing to price appreciation.\n\nFrom a technical perspective, Ethereum is currently trading above its 200-day simple moving average (SMA), a widely followed indicator used to assess the long-term trend of an asset. Trading above the 200-day SMA suggests that Ethereum is in a sustained uptrend, providing a favorable condition for reaching higher price targets like $4000. Moreover, in the past 30 days, Ethereum has experienced 16 green days, accounting for 53% of the time. This positive momentum reflects consistent buying interest and bullish sentiment among investors, which, if sustained, could support further price increases.\n\nHigh liquidity, backed by Ethereum's substantial market cap, ensures that large trades can be executed without significantly impacting the price. High liquidity is crucial for sustaining price increases, indicating a healthy market where buying and selling activities can occur smoothly. This liquidity, combined with the other positive indicators, provides a solid foundation for Ethereum's potential rise to $4000.\n\nWhile the path to $4000 is not guaranteed and depends on multiple factors, the current indicators and market conditions suggest that it is possible. Investors should stay informed about market trends and macroeconomic factors while considering both the opportunities and risks involved. Continued positive market sentiment, stable or improving macroeconomic conditions, and ongoing technological and ecosystem developments within Ethereum can significantly bolster its chances of reaching this price level."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNR1NOMFhkTTVuN2xkaDkycHRPWVhveURnMU03RkEzQjlyWUZBeHlMbkNjQllUci1SLW15MHlqZnltWVloWDBnaDRNVmlKekJiNmFoMU9IUVJYZmYxbjFoTENnek1KR2hTcWEtbV9scURGM2VWOEZpbFZ4OXpMTEdLNUFnaU9pY2dpME5neUpqb0trZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whale Moves $19.3 Million Worth of ETH to Kraken - Blockchain Reporter",
        "content": "Today, the ETH price went even lower, a large transaction took place by an early Ethereum ICO participant. According to SpotOnChain, this individual deposited 5,500 $ETH to the Kraken exchange. The value of this Ethereum is about $19.3 million.\n\nJust before the $ETH further plummeted 3hrs ago, an #Ethereum ICO participant deposited 5.5K $ETH ($19.3M) to #Kraken.\n\n\n\nNotably, the whale:\n\n\n\n• received 150K $ETH in 2015 at an ICO price of $0.31 ($46.6K),\n\n\n\n• deposited a total of 10K $ETH ($35.4M) to Kraken in the past 2 days,… pic.twitter.com/fzswTXi3yx — Spot On Chain (@spotonchain) June 18, 2024\n\nEarly Ethereum Whale Invests $46.5K in 2015, Now Worth $476M\n\nThis huge whale has been invested on Ethereum from the time of its ICO in the year 2015. At that time, they received 150,000 $ETH at an ICO price of $0.31 per $ETH which made the total investment equals to $46,500.\n\nIn two days, the whale continues to pay 10000 $ETH, which is equivalent to $35.4 million, to Kraken. However, even at these impressive staking levels, the whale remains an Ethereum holder or a staker of Ethereum. The funds held include 139,000 Ether worth about $476 million, spread across eight wallets.\n\nMarket Watches as Early Ethereum Whale Shifts Holdings\n\nThe fact that early investors move this sort of Ethereum volume usually sparks interest within the cryptocurrency community. It can mean many things about market strategies such as profiting, or positioning for further market swings.\n\nSuch movements by major holders are capable of altering trading behaviors and the overall market sentiment especially given the current volatile nature of Ethereum. Analysts will wait to see how these steps do impact Ethereum’s price in the future days.\n\nThis case represents the significance of the permanent presence of early investors in the market of cryptocurrencies and their role in the existing trading platform."
    }
]