[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9BNnpMa2xIWFhCWDdUZFpoUENINnd6elV5d28wWWNpSHFzdGZPRUdkMnEwRHg5V1JHUEFaV1BiOVpsc2pPYUJpZ2JuTUZNNUFnQjRXeUtzWFl6M3lmTE00OEZpczFlX0pYbmVyc0FrZlFITXFwbkpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "How Much Cheaper Will Dencun Really Make the Ethereum Ecosystem? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOn March 13, Ethereum is set to undergo its latest network upgrade, Dencun. While the event has certainly stirred excitement among the network’s die-hard tech enthusiasts, it has generated relatively little mainstream buzz in contrast to the 2022 merge, which transitioned Ethereum to the more energy-efficient proof-of-stake model.\n\nMake no mistake, though: According to the developers responsible for running the largest layer-2 networks built atop Ethereum, Dencun will constitute a seismic event in the blockchain’s history—one poised to make gas fees a thing of the past on scaling networks, and usher in a new era of possibility for on-chain development.\n\n“This is the beginning of a new paradigm for how Ethereum operates,” Karl Floersch, the CEO of OP Labs, which builds layer-2 network Optimism, told Decrypt.\n\n“Since 2015, there has been nine years of stagnation in terms of user experience and capability set—a lot of fundamental research had to be done,” he continued. “That fundamental research is done. It is now ‘put this thing into practice’ mode.”\n\nAD\n\nAD\n\nNumerous other layer-2 developers who spoke with Decrypt echoed the same sentiment: Dencun will shift Ethereum into an entirely new gear, principally by making layer-2 transactions exponentially cheaper and easier to validate.\n\nWithin a month or two of Dencun’s launch, once settlement contracts across all layer-2 networks have been updated, gas fees on most layer-2s should drop significantly—so long as networks pass those savings onto users, Polygon Labs VP of Product David Silverman told Decrypt. Silverman said Polygon intends to ensure its users reap the sum of those cost reductions.\n\nTerence Tsao, a developer at Offchain Labs, which builds Arbitrum, told Decrypt he “can safely say” that gas fees on layer-2 networks should immediately fall by 75% once Dencun is implemented, assuming current levels of network traffic.\n\nHow will gas prices plummet so quickly? It’s all thanks to “blobs,” which will soon introduce a new, temporary method for data storage on Ethereum via a process called proto-danksharding. At present, data can only be stored on Ethereum forever, which is immensely expensive. Proto-danksharding will allow layer-2 data to instead be stored temporarily for a period of about a month. The process will be just as secure, but far cheaper.\n\nAD\n\nAD\n\nTo understand the potential impact of that change, says Polygon Labs’ Silverman, think of Ethereum as a road. For the last several years, Ethereum could best be described as a rural backroad—a reliable means to get from A to B, but one that’s slow, and easily clogged.\n\nProto-danksharding will single-handedly expand Ethereum from that backroad into a four-lane highway, says Silverman. Eventually, full danksharding will grow the network to a 16-lane highway. Those extra lanes might come in handy at some point, or they might be overkill; regardless, it’s Dencun that’s bringing Ethereum—to stay with the analogy—into the age of modern transportation. And to developers like Silverman, the significance of that leap cannot be understated.\n\nGas fees won’t just become miniscule post-Dencun; They may drop to the point that crypto companies and projects cover their cost—just as Web2 giants like Google cover the costs of video conferencing and email, for example—to entice users.\n\n“We’re going to enter a world where most users are just not going to experience gas at all,” Silverman said. “And it becomes abstracted away.”\n\nThat gas-free future, to be clear, will exist on layer-2 networks, not the Ethereum mainnet. But post-Dencun, the overwhelming majority of retail user traffic is likely to shift—permanently—away from Ethereum proper, and onto layer-2 networks like Arbitrum, Optimism, and Polygon, says Offchain Labs’ Terence Tsao. And that appears to be exactly how Ethereum developers want it.\n\nBefore focusing on Arbitrum, Tsao previously worked on the Ethereum mainnet. He says Dencun will mark a major shift in how users interact with Ethereum, with the mainnet “fading away into the background.” It will still be essential, serving as an effective engine that secures data on layer-2 networks and facilitates communication between them.\n\nBut the overwhelming majority of on-chain transactions—for NFTs, for shoes, for cups of coffee—will never again take place on the Ethereum mainnet, says Tsao. Stories of tens of millions of dollars burned attempting to mint NFTs will soon be a charming relic of a bygone era.\n\nKarl Floersch of OP Labs expects that Dencun will reinvent what it means to build applications—and to exist on-chain.\n\nAD\n\nAD\n\n“We've never seen what the world looks like when blockspace is in abundance,” he said. “We've never seen the kinds of applications that people can build.”\n\nFloersch anticipates that by effectively eliminating any barrier to entry for integrating on-chain elements with any product, a renaissance of cross-pollination will soon occur across mediums, sites, and platforms. As just one example, he offered the idea of a video game that generates NFTs in-game, interacts with DeFi protocols, and leverages your social media presence to influence gameplay. All seamlessly, and all at effectively zero cost.\n\n“Oh my god, I've been dreaming of this,” he said. “I'm really excited for the world to know why we've been so excited about crypto.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1RaHBPb1hhMnlsVjJEQVFVOFg1eWRCWlM3LXdEb0c0NHJrTzRJd0JNVWxYSGRKNW53UGU5N082RUFPcE5QR3JWRHUtS3JEVFZTZmc0OWx3cFFWWXlJdHJwNGVudzJULTBqQ2p4SXJOb0k4dEpBNjR0Tg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "What Can You Buy With Ethereum? Explore Purchases with Ethereum: A Guide - The Crypto Basic",
        "content": "Ethereum, the blockchain platform behind the second-largest cryptocurrency by market capitalization, ETH, has revolutionized how we think about digital assets and transactions.\n\nUnlike its predecessor Bitcoin, Ethereum offers more than just a digital currency – it provides a platform for developing decentralized applications (dApps) and smart contracts, making ETH a versatile tool for both investment and purchasing.\n\nIn this informative piece brought to you by The Crypto Basic, your go-to source of crypto news, we examine the myriad of possibilities that Ethereum unlocks for its users; as such, let’s explore what you can buy with Ethereum and how it’s shaping the future of digital transactions.\n\n- Advertisement -\n\nWhat Can You Buy with ETH?\n\nEthereum’s widespread adoption has led to its acceptance as a payment method for a variety of goods and services; here are some of the most notable categories:\n\n1. Digital Assets and NFTs\n\nOne of the most exciting uses of Ethereum is in the purchase of Non-Fungible Tokens (NFTs) – these digital assets represent ownership or proof of authenticity of various items, from digital art and music to collectibles and even tweets.\n\nNFT marketplaces like OpenSea and Rarible allow users to buy, sell, and trade NFTs using ETH, offering a new frontier for collectors and artists alike.\n\n2. Online Goods and Services\n\nA growing number of online retailers and service providers are beginning to accept ETH as payment: from tech gadgets and software subscriptions to booking travel and accommodations, Ethereum is making its mark on e-commerce.\n\nWebsites such as Overstock, Newegg, and Travala.com are leading the way in crypto adoption, allowing consumers to seamlessly use ETH for their online purchases.\n\n- Advertisement -\n\n3. Real Estate and Luxury Items\n\nThe real estate sector is also embracing Ethereum, with some platforms facilitating property sales and rentals through ETH transactions; this not only simplifies the buying process but also opens international property markets to investors around the globe.\n\nAdditionally, luxury items such as high-end watches, cars, and even yachts can now be purchased using Ethereum, thanks to platforms and dealerships that cater to the crypto-affluent.\n\n4. DeFi Platforms\n\nDecentralized Finance (DeFi) platforms are another area where ETH can be used effectively – these platforms offer a range of financial services, from lending and borrowing to earning interest on crypto deposits, all without the need for traditional banks.\n\nBy using ETH on DeFi platforms like MakerDAO, Compound, and Aave, users can engage in a new, decentralized economy.\n\n5. Charitable Donations\n\nEthereum’s flexibility also extends to philanthropy, with numerous charitable organizations accepting ETH donations; this provides a transparent and efficient way to contribute to causes worldwide, from disaster relief to educational programs.\n\nThe Ethereum blockchain ensures that donations are traceable, reducing the risk of fraud and ensuring that your contribution reaches its intended destination.\n\nAdvantages of Buying with Ethereum\n\nPurchasing with Ethereum comes with several benefits, including:\n\n1. Decentralization\n\nTransactions are not controlled by any central authority, offering a level of freedom and privacy not typically available through traditional payment methods.\n\n2. Security\n\nThe use of blockchain technology ensures that transactions are secure and immutable, reducing the risk of fraud and theft.\n\n3. Speed and Efficiency\n\nEthereum transactions are processed quickly, often within minutes, making it an efficient option for online and international purchases.\n\n4. Transparency\n\nAll transactions are recorded on the blockchain, providing a transparent record of purchases and transfers.\n\nHow to Buy with Ethereum\n\nBuying with Ethereum is straightforward – here’s a simplified process:\n\n1. Set Up an Ethereum Wallet\n\nTo hold and use ETH, you’ll need a digital wallet; choose one that suits your needs, whether it’s a hardware wallet for added security or a software wallet for convenience.\n\n2. Acquire ETH\n\nYou can buy Ethereum on a cryptocurrency exchange using fiat currency or other cryptocurrencies.\n\n3. Find a Vendor\n\nLook for businesses or platforms that accept ETH as payment (this information is often listed on their payment page or FAQ section).\n\n4. Make a Transaction\n\nFollow the vendor’s process for paying with ETH, which typically involves sending the payment from your wallet to the vendor’s wallet address.\n\nLooking Ahead: Ethereum’s Expanding Marketplace\n\nAs Ethereum continues its development, so does the ecosystem of products and services available for purchase with ETH.\n\nThe advancement of Ethereum 2.0, with its promise of increased scalability, security, and sustainability, is likely to further boost Ethereum’s acceptance as a means of payment.\n\nThis evolution will undoubtedly clear the way for new opportunities addressed to consumers and businesses alike, making ETH an even more integral part of the digital economy.\n\nEthereum is paving the trail for a new era of digital transactions, offering a versatile and secure method for buying a wide range of products and services: from the art world to real estate, and from online shopping to charitable donations, ETH is more than just a cryptocurrency – it’s a key to a decentralized, digital marketplace.\n\nStay tuned to The Crypto Basic for the latest in crypto news and insights, as we continue to explore the frontiers of cryptocurrency and its impact on our daily lives."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE96THJnbENNaHNoWW9lVHA5WnRoWmhOOVlkTjE2WXdDeEVzVkcyQ3BZRm5VNzdkaURqdVdrZm42cnM4eGE2bjIwZWxtLVZYcWNXZXF4ZnlaT0NfM09QUllWUWc0SmVYM1Z50gFuQVVfeXFMT21nTEszdHA4YkdaSXZGR3ByN0drVWJ5aElDb3UxTmp4ZzFEUUZOT2RWWU4yNmxfQ2xsLVg5MmloMXA3cUl2am9rUlBkQm9GVjloVl8zOUJabHFLcDZUTDZXZjJjWkhJQ19SZG1OUkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for March 3 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe last day of the week is about to end bullish for the cryptocurrency market, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has increased by 0.3% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the price of ETH is the middle of the local channel between the support at $3,365 and the resistance at $3,448.\n\nAs most of the daily ATR has been passed, any sharp moves are unlikely to happen today. In this regard, consolidation around the $3,400 zone is the more likely scenario.\n\nImage by TradingView\n\nOn the daily time frame, the situation is quite similar. The rate of the main altcoin is far from the resistance. Traders may only expect an ongoing rise if the bar returns to the $3,480 zone.\n\nImage by TradingView\n\nFrom the midterm point of view, Ethereum (ETH) has almost touched the $3,582 level. However, one should focus on the candle closure. If it happens above it and with no long wicks, the upward move may lead to a test of the $3,600-$3,700 area this month.\n\nEthereum is trading at $3,428 at press time."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOdXk0dC1sNmpHWEpta2x1cGtIRnBORkUyRHdTZjdLcTVzT0ZlaGxMUkdKU2YyYk9QckE1UkhyYXZLTnR2aE1UWlhUTnBQQXU2M0tCRWxRN3lzRVpVbFRZYUk3b1huYnVibC1LNlhyMzB1cGViVDZWeFc5d2V1NWg3RkpHbmw1MVpOVUdtRXRpTTktUms4Ulk4RzBSdjBvSHdwX2RPYkxZZWpQNlA2RFpJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to Break $4,000 After Bitcoin’s Latest Move? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPLVQwclJFa21CVVR1ekNTYkxXUlJ0T2F0VGJOaTdCVWx3cjlVdnVXOXZiTVhkYUFtOXBkUG5KVG9iMUZmdEhpc0NOWFM1NEVHczkxOS1HSVY0VzJMYjhZcnpXdElBcjVGTTZxdDF6MzJVREpYTkpHNDZSZnVPNGdWclYyR0RHZUdBN1RlQ0trT0p3UmFIMWtNbtIBngFBVV95cUxOdlYzSm13WllHV1k5NXpsbGpSSTBZVVIyWnVYQkNzekpJVloyYnRzYzRFclh6TGJXTE0tLWwxUy0xNkVXZDI1UnJRRjZURWF3bmJFeWs2NzFiVlVTYUlWa3pObUxQeklKcXBNMkk2MVR3NzBXbE9ycjZtaWlxNnc5MTNYcFY1bHd4Uld4a0pGaTVZaEc1Y2Z5eFVZVnY4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Taiko, an 'Ethereum-Equivalent ZK Rollup,' Raises $15M - CoinDesk",
        "content": "Taiko says it provides an \"Ethereum-equivalent ZK rollup\" – described by Ethereum co-founder Vitalik Buterin in a 2022 post as the holy grail of technological achievement for these scaling networks. A \"rollup\" is a term for a layer-2 chain, which acts like an auxiliary network to provide faster and cheaper transactions that can then be settled to a main or \"base\" blockchain like Ethereum. The \"ZK\" refers to \"zero-knowledge\" cryptography, a hot trend in blockchain design."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5keWZzeUM1c0NMb0RhSlBWV2R0cmRrUmpOQW82ZnJiRUp4TU9EUUxqS0NxSnhRYm5wRDlCX1RIR1VQWlM3VVEyOENKOS0tUjBrODI3TU9uX0FXbl9pUklCaER6cWRIZDFW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Solana 500% Surge Sparks Ethereum Déjà Vu - TronWeekly",
        "content": "Buoyed by the bullish market momentum, Solana has recaptured investors’ sentiment, steering attention away from Bitcoin and Ethereum. SOL is on the cusp of breaking new records as the token approaches a 2-year high. From less than $10 a year ago, the leading altcoin exceeded $130, a whopping 500% surge.\n\nSimilarly, the trading volume of the 5th largest crypto asset has spiked 120% to $3.2 million. Market experts have drawn parallels between SOL’s price trajectory and that of Ethereum in 2020. If the rest of the cycle plays out similarly, a takeoff is imminent.\n\nSOL still really reminds me of ETH in 2020. Pretty sure the rest of the cycle plays out similarly too, expecting takeoff soon. Bring it on.\n\nWhile price is one way to look at it, the other perspective is revenue, as gauged by the gas fees of the respective blockchains. And Solana’s gas fees have been soaring, both in absolute terms and as a percentage of Ethereum’s gas fees. In February 2023, Solana’s daily gas fees were less than 0.2% of Ethtereum’s. In January 2024, the table flipped as Solana’s daily gas fees exceeded 8% of Ethereum’s, making a nearly 40-fold increase.\n\nImage Credit: PYOR\n\nSolana’s DeFi TVL has also scored a new milestone, surpassing $2 billion, a level not seen in the last 20 months. The new feat is a testament to its robust DeFi ecosystem, which has bounced back strongly since the 2022 FTX collapse. Since December, the total value locked has doubled, indicating increased user activity and trust in the platform’s DeFi applications [DApps]. The blockchain’s scalability and affordability make it a cheaper and faster alternative to Ethereum.\n\nSolana: Dynamics of DEX Volume and Notable Sector Gains\n\nWhat’s more interesting is that while constituting less than 3% of total DeFi TVL, Solana generates over 20% of the overall on-chain DEX volume. Along with SOL, Ethereum, Manta, and Arbitrum also recorded notable gains. This uptrend marks the fourth consecutive month of growth for DeFi since it finally broke its downtrend in October 2023.\n\nMarket observers have noted that the liquid staking and lending/borrowing sectors led the surge across key protocols, culminating in a robust DeFi week for Solana."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQWFlsVnRwM3NWeHpfMVBJSHNvcUlxYl9kS3JRM3BTZHprVnExemxZMzFNRldDTGx6ZFNOaGJMQ0M5c0JNZHN1M3hRUjJUMEltZXM4cVl5WGNlZEthNVYtRGl6Y0xvRjdOWUQ4b0lRNUx4QjluU3liUS1QYlJnZUg2MWRNcGt2YXhGVmlZR0E3VlVrMFZIWVRtU0hkX1pTRkpzX011U2hMdUkxLUozTE1NWElRTzdZaHlOQlJtRVVn0gHDAUFVX3lxTE5fZkNnZnRJV0ZaZkpRa1JkRFVyX2hac0NwbkFKUWwzU3k3bmlHOUl1QzF6bzR6bXBvSUI1REJLdllRblljWmNzNXRFeGg2QlVla2syR3RyQmdXc2gwbVV5VEdJdE1EdDZobGlnTGlmMmVyby1uSVZoSTVxTFI4VnVnNEpuaW94UEtjS2pyOTdSUVMydEdDSEZmMWVuQ3dSSjY1TGV1eWp5U1M4VlUydmdBTTEtNlRyc1dCNUpZN1A2eEEycw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Ethereum ETFs: The next big push for Bull Run - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe recent launch of Bitcoin ETFs has sparked a resurgence in the crypto market, attracting a wave of new investors and igniting a surge in trading activity. This positive momentum has created a ripple effect of optimism that transcends Bitcoin alone. Now, as the U.S. Securities and Exchange Commission (SEC) gears up to decide on a potential spot in Ethereum ETF in May, anticipation is running high for another major milestone in the crypto space.If Bitcoin's dominance in the crypto market is undeniable, Ethereum's unique functionalities and growing ecosystem make it a force to be reckoned with. The Ethereum blockchain and its native currency, Ether (ETH), serve as the backbone for a vast array of decentralized applications and innovative projects. From smart contracts to decentralized finance (DeFi) and non-fungible tokens (NFTs), Ethereum's ecosystem continues to drive unprecedented levels of use cases and activities.ETH has already demonstrated strong performance with a 33% gain year-to-date. This rally is fueled by a combination of factors, including Ethereum's shift to a proof-of-stake consensus model, which has made its token supply deflationary. Additionally, the amount of ether locked up in staking pools, DeFi smart contracts and layer-2s is also an important factor. The proportion of ETH held on exchanges has reached an all-time low of 11%, suggesting increased demand and scarcity.The growth of Ethereum's ecosystem, particularly in the DeFi sector and layer 2 scaling solutions, further reinforces the bullish outlook for ether. New layer 2 networks have brought scalability and lower fees to the Ethereum network, driving higher transaction volumes and activity. With further upgrades to the Ethereum blockchain, such as the upcoming Dencun upgrade, Ethereum's ecosystem is poised for continued expansion and value accrual. To add this, the number of Zk rollups being built on top of Ethereum further bolster its position in the Web3 space.The potential approval of Ethereum ETFs presents a significant opportunity for investors to capitalize on the growth of the Ethereum ecosystem while mitigating the complexities associated with direct asset ownership. These investment vehicles offer a regulated and simplified avenue for investors, providing indirect exposure to Ethereum's price movements.Several established financial institutions, including Franklin Templeton, Blackrock, and Fidelity, who already have SEC-approved Bitcoin ETFs, are actively pursuing the launch of an Ethereum ETF in the U.S. These firms see the potential for Ethereum ETFs to do more than simply track the price of Ether; they believe it can facilitate the development of transparent and accessible tokenized financial markets built on the Ethereum network, offering benefits beyond simply attracting investors.The classification of Ethereum as either a commodity or security remains an ongoing discussion. While SEC Chair Gary Gensler's statement regarding the potential categorization of most crypto assets as securities adds complexity to the ETH ETF approval process, it also signifies the ongoing engagement of regulatory bodies in defining a framework for the evolving crypto landscape.India boasts millions of enthusiastic investors who are increasingly convinced about the future of virtual digital assets (VDAs). For Indian investors, although such ETFs are currently unavailable for investment, these developments have nonetheless infused the community with positivity.While the availability of ETFs for crypto like Bitcoin and Ethereum remains a future prospect, the recent developments have nevertheless inspired confidence and optimism among Indian investors. As the crypto market continues to evolve and mature, Indian investors eagerly await opportunities to participate in the growth and innovation of this dynamic sector."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNUdxSExGQ2pZTGF2U0xCWFkybVdqUnBodkdmSXlYQTFzX3lLRC1XWVlOWVBBYjZia2d2RTJDTm1wQjlLUnB1WVZ1Y0pieDNCYWstOHdQeUhfc3otbHdLS3JzZGQ0SHZmOTdmUzlLbWtZbjhNYXgwdnBYN19aYTI4Umg3WdIBiAFBVV95cUxONGtpc3RFSGZaNDJLd1d6ZTA1M2FTX2lWbGt4QVNBcXpQN2QteS1nRllsYjluRlNGdEJ3eVEwQ2FKcF9jdzdGN1J3NVhSWTlMTkp1UzVyWGp0dzNlNElHR3NTb2N0dVBHTTA2d2RGUjhTWHRZNnRTZHQtSldsLXF0LTBxQ0dQRTFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s latest milestone – What about ETH prices? - AMBCrypto News",
        "content": "Ethereum’s MVRV ratio now sits above 100%.\n\nThis marks its highest level since April 2022.\n\nEthereum’s [ETH] Market Value to Realized Value (MVRV) ratio has climbed to its highest point since April 2022, data from Santiment revealed.\n\nThe MVRV ratio assesses whether an asset is overvalued or undervalued. It does this by comparing the current market value of an asset to the average price at which all units were last moved on the blockchain.\n\nWhen it increases, it suggests that the current market value of an asset is significantly higher than the price at which most investors acquired their holdings.\n\nAt press time, ETH’s MVRV ratio was 103.11%, having risen by 145% since 25th January, per Santiment’s data. This rally coincides with the recent surge in ETH’s price, which recently surpassed the $3,400 mark, according to data from CoinMarketCap.\n\nWith an MVRV ratio of 103%, ETH’s current market price is 1.03 times higher than the average price at which all ETH units were last moved on the blockchain. Therefore, on average, most coin holders would realize at least 100% profit on their investments if they sold now.\n\nNo cause for alarm\n\nWhile readings from ETH’s Bollinger Bands indicator observed on a single-day chart revealed that ETH’s price remained prone to swings, other key indicators showed that bullish sentiments exceeded bearish activity.\n\nFor example, the coin’s Awesome Oscillator returned green upward-facing bars at press time. This indicator measures market momentum by comparing its short-term and long-term moving averages.\n\nWhen it returns only green bars, it indicates that the short-term moving average is rising faster than the long-term moving average. This suggests that the bullish sentiment is strong and gaining momentum.\n\nFurther, the coin’s Moving Average Convergence/Divergence (MACD) line (blue) rested solidly above the trend (orange) and the zero lines as of this writing.\n\nWhen readings from this indicator show the MACD and trend lines above zero (as is the case here), it suggests that bullish momentum is prevailing in the market.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nOn the coin’s derivatives market, futures open interest totaled $11.38 billion as of this writing. The last time ETH’s futures open interest was that high was in December 2021, per data from Coinglass.\n\nWith the growth in the coin’s positive funding rates across exchanges, futures traders continue to place bets in favor of a price rally."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNZXhBMDQyQUM3bWVfZXprVzI4M3JIOHpXQ0x3dEVYY2tHV1g4Q3p6MEhxeE1kSGIxcndFTjNUV195VHlhaUdpaE5fbHpLOUgxSHdMOGRNWlVrOEdWU29SOVZtSzc2OHFWZ2J4V3dJMW5CY2VUY2ExcGUzWjlSUGViTFFGbXBremlmZThybzZJNTEzWnZ6UF85ZkZaM1ZyaC02a2l3YkNna09KMVF5MVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Highlights Polymarket's Prediction on Ethereum's Gas Fee Reduction - Blockchain News",
        "content": "Vitalik Buterin Highlights Polymarket's Prediction on Ethereum's Gas Fee Reduction Jessie A Ellis Vitalik Buterin draws attention to predictions of lowered Ethereum gas fees post-EIP-4844, with market speculation suggesting major cost cuts.\n\nEthereum co-founder Vitalik Buterin has brought to light on X (formerly Twitter) a Polymarket prediction that could signal a significant change in the network's fee structure following the introduction of Ethereum Improvement Proposal (EIP) 4844. The forecast, a topic of intense discussion within the Ethereum community, estimates a notable reduction in transaction costs, potentially lowering the price of data blobs (~125 kB) to under 0.001 ETH.\n\nThe current expense of calldata on Ethereum, calculated at approximately 0.06 ETH factoring in gas and data size, has been a substantial bottleneck for the network’s scalability and user adoption. Polymarket’s speculative market, a barometer of community sentiment, shows that a sizable portion of participants, 46%, predict gas fees will fall between 0.0001 and 0.001 ETH a month after EIP-4844's implementation. Another 24% believe it could settle between 0.001 and 0.01 ETH.\n\nButerin's mention serves as a reminder that these market predictions, while speculative, provide insight into community expectations and can be utilized as a hedging tool against the potential outcome of the EIP-4844 upgrade. The proposal is a key part of Ethereum's ongoing efforts to enhance its protocol , which includes the much-anticipated transition to Ethereum 2.0.\n\nThe reduction in gas fees anticipated by EIP-4844 could significantly amplify the network's appeal to developers, encouraging the proliferation of decentralized applications (dApps) and boosting overall network activity. It also reflects the broader goal of Ethereum's upgrade path: to maintain its competitive edge as a leading blockchain for smart contracts in the face of rising alternatives offering lower transaction fees.\n\nInvestors and the Ethereum community are keeping a watchful eye on the development and eventual outcome of EIP-4844. The reduction in gas fees has been long sought after and is expected to not only improve the user experience but also potentially influence the market sentiment around ETH positively.\n\nDespite the positive outlook, upgrades of this magnitude come with inherent risks and uncertainties. Nonetheless, the community's response to Buterin's highlight of Polymarket's predictions indicates a prevailing optimism about the proposal's capacity to resolve some of Ethereum's most pressing challenges related to gas fees. As the upgrade looms on the horizon, all eyes will be on its real-world impact versus the speculative predictions.\n\nImage source: Shutterstock"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQaG1oT243bGF1endUbjRQYU1qakN0SWIzUHJJSk9FNFJZZzRyd2hrVjlGZHFFTE1OZjM0YjhtbXFURjZXSGhjRWY4M2VlZ3JWdk93SWFsQ2RMenhlNnl5X1pBaHJ3LXMweDBUVmFMWnFvRDFLdktic0lGZGlvYTRjMzlKRzNmUjBLclJqVFA1NkFZTGtTSWVpNmEtM2tPWUtKcU9MYmJ0OXRNVGVFSUw5WXlueWd4cHB6SVlDX0xMY1VCOFByeXA1Rkw3ZEp0dHEy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Key Indicators Suggest A Strengthening Case For Surge To $3,800 - TradingView",
        "content": "Ethereum price is consolidating gains above $3,400. ETH is showing positive signs and might soon aim for a move above the $3,500 resistance zone.\n\nEthereum is holding gains and consolidating below the $3,500 resistance zone.\n\nThe price is trading above $3,400 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support at $3,420 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair seems to be setting up for a move toward the $3,650 and $3,800 levels.\n\nEthereum Price Remains Supported\n\nEthereum price formed a base above the $3,350 level and started another increase, like Bitcoin. ETH broke the $3,400 level to set the pace for more upsides.\n\nThere was a clear move above the 50% Fib retracement level of the downside correction from the $3,519 swing high to the $3,305 low. The bulls are now active above the $3,420 level. There is also a key bullish trend line forming with support at $3,420 on the hourly chart of ETH/USD.\n\nEthereum is now trading above $3,450 and the 100-hourly Simple Moving Average. It is showing positive signs above the 76.4% Fib retracement level of the downside correction from the $3,519 swing high to the $3,305 low.\n\nImmediate resistance on the upside is near the $3,500 level. The first major resistance is near the $3,520 level. The next major resistance is near $3,550, above which the price might gain bullish momentum. The next stop for the bulls could be near the $3,650 level.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nIf there is a move above the $3,650 resistance, Ether could even rally toward the $3,720 resistance. Any more gains might call for a test of $3,800.\n\nAre Dips Supported In ETH?\n\nIf Ethereum fails to clear the $3,520 resistance, it could start a downside correction. Initial support on the downside is near the $3,420 level and the trend line.\n\nThe first major support is near the $3,400 zone or the 100 hourly SMA. The next key support could be the $3,350 zone. A clear move below the $3,350 support might send the price toward $3,320. Any more losses might send the price toward the $3,150 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $3,400\n\nMajor Resistance Level – $3,520"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQS1IQ3pIdzNmVlZXMTNuQUtkRkRuNUNLTWR6ZkJqcmtaejdHU0dpeFpacTQtQnhDRlRsV2QtZmVlWnc3U19CeXQ1SzE5YmEzeVdqMGhwSFVFRnVMT0VnZ25BRzJfbkREQWphVnpJMVJ5clQxR2R4ZzNFazlpdTRhd29ra0FVZzExcnlmR2tQX0FkYWFzcXlQWExOeWlPSHBBMHRtQmhrRnNObU1rek5HNDlnaGQwdlVITnhQdnlFZ9IBxAFBVV95cUxOaU9NdV9feUNxQlN0eXBnREZGOXlwN0NfOURGeG5MekF0REYxYTY0amkzU180LXNaZGJwQlJpVzVpOFdVVzlPWEtzTzNKTG4yVng1cHM5c3V3Y2M4V3FIMm82TkVMajNMZlZ3RjZlS1NjSmltOFRBQlpTZnQ5eEEyb1hyUm5udnBvdGp4VEdial9SbERSRF85UnM3YUphazNiZlBrQUNGN050RDhNRE85YVhmT2VwSmtZdHZ5c3FROFcyMGJK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: The long game could see ETH climb 30% - FXStreet",
        "content": "Ethereum price has defended its range low of $884.51 since early 2021 while the $4,485.32 peak capped the upside.\n\nIf ETH manages to close above $3,602.43, it could catalyze a continuation to the January 2021 peak.\n\nA break and close below the midrange of the channel at $2,684.92 would invalidate the bullish thesis.\n\nEthereum (ETH) price is trading with a bullish bias, having breached the midline of the market range between the January low around $884.51 and the November high of the year 2021 around $4,485.32.\n\nAlso Read: Ethereum Layer 2 transaction volume surges driven by system upgrades, increasing partnerships\n\nEthereum price could retake the November 2021 highs if bulls play the long game\n\nEthereum (ETH) price is above the 50% Fibonacci retracement level of $2,684.92 after a bullish bounce above the $2,000 psychological level in November 2023.\n\nWith momentum still rising, ETH price could extend the gains, shattering the $3,602.43 blockade before an extension to the local top around $4,485.32. A weekly candlestick close above $3,602.43 would pave way for more gains.\n\nIn a highly bullish case, the gains could see the largest altcoin by market capitalization reclaim the $4,868.00 range high. Such a move would denote a 30% climb above current levels.\n\nBulls continue to remain well within the ETH market, as seen with the large volumes of green histogram bars of the Awesome Oscillator (AO) in positive territory. This is despite Ether being massively overbought and could play in favor of the upside.\n\nETH/USDT 1-week chart\n\nOn the other hand, if the $3,602.43 level holds as a resistance in the weekly timeframe, the Ethereum price could retest the midpoint of the market range at $2,684.92, with a break and close below it invalidating the bullish thesis."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOSXBDRjdKbmVNRGNSWE04a2l2RW1GcDdlajZkSzJxaHMzS3QwZk9vckR6bmNYcEEzMHkyMzhwelZyWlZuMTJESkpjaWE1MzVIWm8wazRKWjVTeHd6TW9kR0ZZcmVBR0NJc2ZmM0wxUUVZN1FMN0xXOHBPbm5FSEE2Tnh5Zl9kTFhWYS1XWm1XUFJDdjk1Z2Y2TjFXaVhsa2prYnpvSVdVZUNWUzFuZ2lIck5RNnpPYkpVZ0FqYlJsMFdMeGFmamQzdjNvYXkwU0JtLTJQRFhiYi3SAd4BQVVfeXFMT09NYnpuS2RneWtVWW92TEFOVElHZEdQdVg5dUpKdjI0WHZFdEdkTGg0OGFkWWNKMHVkUHhsYWNQVlJRMFVUNzBMclhndlg2b1pmQXFZdGJBbDZKQ3N0bDUtMWhoZWpiUGFBN3NIRWowdzM2Z1hfVldqUkdNUGR3cEhWQUNiSUhNTTRfcUhMM0FhY1Y4TkU2QmZFTHhZNlhBLXpVQThvMUEteVZDTUhhXzJyalRZQS00UENuTWtLdUMzeUd0Z2xzdkhvNk4yMDBDYlo2TUpudmVfZ0ttcGNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2 Transaction Volumes Skyrocket in First Two Months of 2024, Says Analytics Firm IntoTheBlock - The Daily Hodl",
        "content": "Ethereum (ETH) layer-2 projects are on the rise, according to the crypto analytics firm IntoTheBlock.\n\nIntoTheBlock notes that Ethereum L2s have seen a 91% surge in transaction volumes since the beginning of 2024.\n\nThe analytics firm also notes that both ETH and Bitcoin (BTC) continue to fly off centralized exchanges.\n\nIn a new analysis, Lucas Outumuro, IntoTheBlock’s head of research, tracked the top two crypto assets’ weekly netflows, which measures the level of each asset moving in and out of centralized crypto exchanges by subtracting the amount of their withdrawals from their deposits.\n\nOutumuro notes that $906 million worth of ETH netflows left centralized exchanges, the smart contract platform’s 8th consecutive week of net outflows. IntoTheBlock interprets the movement of netflows off crypto exchanges as a potentially bullish sign for crypto assets.\n\nThe analyst also notes that $797 million worth of Bitcoin netflows left centralized exchanges in the past week.\n\nBTC is trading at $62,703 at time of writing. The top-ranked crypto asset is up by nearly 23% in the past seven days and nearly 42% since the beginning of 2024.\n\nETH is trading at $3,445.00 at time of writing. The second-ranked crypto asset by market cap is up by nearly 17% in the past week and more than 46% since the beginning of the year.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOaGNRMzl6WUp6bF9HY0lza3NxX0NqTGRFbVNBT1FxLVFISW9CWXNsaVRPVTFYQk5sd0tHRk0wUEtIR0hnaWhWTUNkeUs3akJFaXJHWkdHR1FyX3p2anhfVTFHUlZiODFjaWk5Nzc5Q05VcnV5TElzOFpqR3hHNktCdtIBiAFBVV95cUxOaDNqMkhRTDB4NDFBbUs3ZF9fdVEzdEN4R281bHpyT2wyZnRxQWgwX3o1WmtsRUZDcmdrTXZEUXhuU3FBaDQxRUNHdXhGTFAxa1FRbFYyQWNYRjVJN1R3Z3VEYlRTV08zLVRQeFViZ3V0dmQ2c1A0dEFHSnc0QmNMOXBCVkkwZWdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Blast: 7 of the Hottest Projects and Airdrops on the Ethereum Scaler - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJust two days after the launch of Blast, an Ethereum layer-2 network from the founder of dominant NFT marketplace Blur, hundreds of millions of dollars have flowed into newly created protocols living on the network—and buzz is growing about several other projects emerging in the ecosystem.\n\nThe network already boasts a total value locked (TVL) north of $2.4 billion, according to the Blast website. Many users have flocked to Blast in order to capitalize on future airdrops that may reward early users of applications and protocols within the network.\n\nAlready, clear winners have emerged, with some DeFi protocols receiving huge sums of investment, and other games and tokens garnering sizable attention on social media. Here’s a glance at some of the projects dominating Blast in its first days.\n\nOrbit Protocol\n\nAD\n\nAD\n\nWith a TVL of over $200 million, Orbit is currently the hottest DeFi protocol built within the Blast ecosystem. The protocol allows users to lend and borrow assets while remaining within Blast, and incentivizes users by letting them earn liquid rewards in the process. It also boasts its own native token, ORBIT.\n\nOrbit lending/borrowing and the $ORBIT token are now both live on @Blast_L2 mainnet🥮🚀 Heres how you can skip the endless points by earning liquid $ORBIT yield and owning your Blast allocation 🧵 Get started:https://t.co/Aikku3Tr77 pic.twitter.com/Xu5bpP3vl0 — Orbit Protocol 🥮 (@OrbitLending) March 1, 2024\n\nSpacebar\n\nSpacebar, which refers to itself as an “on-chain playground,” is a gamified platform on which users are encouraged to interact and engage with each other to earn various types of points. Users connect their profile picture (PFP) NFTs to the ecosystem to create an avatar, and also mint new NFTs within the Spacebar game world.\n\nSpacebar also incentivizes users to stake ETH within the platform to earn additional rewards. A major pull to the project appears to be the promise of an upcoming airdrop to early and active participants.\n\nDegens, we are live on @Blast_L2 with Phase 1 🧑‍🚀 If you're looking for the best playground to play and farm, you found your home. 🏡 In Phase 1, you can:\n\n- Choose a PFP NFT as your digital identity on Spacebar.\n\n- Mint a free Blast Protoship NFT.\n\n- Stake $ETH.\n\n- Refer friends.\n\n-… pic.twitter.com/6I1koiIpLX — Spacebar 🚀 (@spacebarxyz) February 29, 2024\n\nAD\n\nAD\n\nPac Finance\n\nThe first hybrid lending protocol to launch on Blast, Pac Finance facilitates both peer to peer loans, and peer to pool loans on the Blast network. The project includes features like self-repaying loans, one-click leverage trading, and instant lending loops. The platform is currently pledging quantities of Blast’s yet-to-launch native token, which it received after winning the blockchain’s “Big Bang” app development competition, to early adopters.\n\nPacMoon\n\nThe self-proclaimed “community meme coin” of the Blast ecosystem, PacMoon is a decidedly independent token project that took off this week to much fanfare. The token, PAC, has yet to launch—it will via airdrop at some point “soon,” according to the project’s team. But in the meantime, it has generated a frenzy on Twitter, where posts about the coin noticed by the PacMoon team are purportedly being rewarded with PAC allocations.\n\n1. Create content about PacMoon If we like or rt your post, you get $PAC. A rt will get you more $PAC than a like. You can stack likes and rts for more $PAC. — PACMOON (@pacmoon_) February 29, 2024\n\nZerolend\n\nAnother lending market on Blast, Zerolend incentivizes users to borrow and lend a range of tokens in exchange for rewards in ETH, BLAST, and ZERO, the protocol’s native token. Unlike Orbit Protocol and Pac Finance, Zerolend already exists on two other blockchains: Manta and zkSync Era.\n\nDistrictOne\n\nDistrictOne is a gamified, incentivized group messaging platform built on Blast. By liking messages and engaging with posts, DistrictOne users can collectively earn rewards and compete for jackpots. A key element of the ecosystem are “gems,” which are rewarded to users for high engagement, and earn them spots in weekly and ongoing airdrops.\n\n3. 🎮 Gamified Spaces\n\nD1 transforms group interactions into thrilling rallies with jackpots. Participate in daily sessions, support your favorite spaces, and stand a chance to win big. It's all about community power and shared success. pic.twitter.com/S6WCqCqMJe — DistrictOne (@DistrictOneIO) February 15, 2024\n\nJuice Finance\n\nJuice Finance is a protocol that enables levered cross-margin trading. Users can yield farm and spot trade on other Blast protocols through Juice, and in the process, lenders and borrowers can earn various rewards. Holders of certain Ethereum NFT projects, including Pudgy Penguins, Wassies, CryptoPunks, Azuki, DeGods, and RektGuy, are automatically eligible to claim the platform’s native Juice points. At writing, Juice has a TVL of nearly $35 million.\n\nAD\n\nAD\n\nThe Time is Now. Juice has officially launched on the @Blast_L2 Mainnet 🧃 Head over to https://t.co/hlbbCAMn6X to deposit & begin maximizing your Points 🚀 All Blast bridgers, Juice testnet users and many NFT holders are eligible to claim Juice points 🧵 pic.twitter.com/Ps36mkduY1 — Juice (@Juice_Finance) February 29, 2024\n\nEdited by Andrew Hayward"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPZnR5QUx5a0ZXekc2ZVVxVENzMDVFdnRTalVTaEdueDFuZ21aRVBwbS1wZ3k4MGVSanZ2TnhWMzREZnJEbjBxeUVDdkJrMl9US2gtZEpVdDVUUm9SUG03WmpuMnVxQjNka3hMQ0w2cVVETWRDbXZsMlhWSmt0SS05TGhacC1IQjh6cnFGNUJ30gGTAUFVX3lxTE1obTZiRFk0SHhqVzJka2gzRGFSekZTbWJGU1lCMFE5SlBUc2o3QmdLNHZGMW85cm9LQ29kWVdpMnJ1UDRfb3UwczdyUHhjSTJGWWpJay1GYlY1RWdreGZPd0lJVFZDNW9BLXVtQnkyclNKR08weVNhS0pwdlNWNkg3aEdMeFg5YzJsdUdNUmN2ZnVEaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Draws Attention to Price of Ethereum Blobs: What Is It? - U.Today",
        "content": "Advertisement\n\nEthereum co-founder Vitalik Buterin recently drew attention to the predicted cost of \"blobs\" on the Ethereum network, highlighting potential economic ramifications. Blobs, introduced by Ethereum Improvement Proposal (EIP) 4844, are data bundles roughly 125 kilobytes in size that can be attached to transactions.\n\nButerin compared current data transmission costs on Ethereum with projections from Polymarket, a prediction market platform. According to current gas prices, transmitting 125 kB of data (calldata) costs approximately 0.06 ETH.\n\nIn contrast, Polymarket forecasts the price of blobs to be around 0.001 ETH. This significant disparity suggests that EIP-4844, if implemented, could drastically reduce data storage costs on the Ethereum network.\n\nAdvertisement\n\nPolymarket is predicting that blobs (~125 kB) will cost ~0.001 ETH.\n\n\n\nToday, 125 kB calldata costs ~30 gwei per gas * 16 gas per byte * 125000 gas ~= 0.06 ETH\n\n\n\nAnd if you think polymarket's guess that blobs will be 60x cheaper is over-optimistic, you can use the market to hedge! pic.twitter.com/vUwJInNhCP — vitalik.eth (@VitalikButerin) March 3, 2024\n\nWhat is EIP-4844?\n\nEIP-4844 proposes a three-part solution to tackle blockchain's scalability issues. Firstly, it introduces Type-3 transactions, which enable users to attach blobs directly to their transactions. This offloads non-critical information from the main ETH chain, freeing up space and potentially reducing transaction fees.\n\nSecondly, the proposal introduces blob storage, allowing a limited number of blobs to be temporarily stored on beacon nodes (validators) for a specific time frame. Finally, a blob base fee mechanism is implemented to incentivize validators to include these blobs in blocks. This ensures the continued availability of the data while preventing excessive storage that could strain the network.\n\nHow to hedge by Vitalik Buterin\n\nBeyond cost reductions, Buterin suggests that Polymarket's predictions could serve as a valuable tool for stakeholders within the Ethereum ecosystem. By understanding the market's anticipated cost of blobs, participants can potentially hedge against price fluctuations, contributing to a more stable and predictable environment.\n\nIt is important to note that EIP-4844 is still under development and its implementation timeline is uncertain. However, the potential cost savings and increased scalability offered by blobs highlight the ongoing efforts toward a more efficient and cost-effective Ethereum network."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQZmNKZUZ6bjljLUlhRzNDOFhkSUZRMXNRa1dqX3JraEljUzQ4ZXJXVWw0ZnF5cENDV1ZBTW9MMVhfanl3VnFRcVBiVzVjT29qeHFfRG12a1BzaVdmYy11SzZlTWhNZ05sQ3o4bk1MMC0wZ1lubnZCME11WF96SFNuckxn0gGKAUFVX3lxTFBZTGFkRzYyN1Q3N2dReXFnbkRzZFZMUk5sUEhXVGF3YUZrTWpRRWtLcjFnTzBGMG54UW5CcWYtclptUlpOQzJBc1VCR1NGUGd6bXIwQ3dEWTFyMmVsRXlqS1c4UTB6ZHdaWjRzQVU5WGU3SVhfbF9EQVhxVVBHT1YxSDJVX25xSF9sQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Wormhole Airdrop on Ethereum and Solana Could Be Worth Almost $3 Billion - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCross-chain bridge protocol Wormhole is gearing up for a multi-billion dollar airdrop of its upcoming W token, pre-market trading data suggests.\n\nOn Monday, W traded for 2.49 USDT in OTC trades recorded through Bybit— more than five times higher than it traded for one month ago in the perpetual futures market. At the time, Wormhole published a tokenomics and unlock schedule for W, which entailed a token generation event that would immediately release 1.1 billion tokens, with another 600 million tokens released to the community over the next several months.\n\nThe math adds up to an immediate airdrop worth $2.73 billion at current prices, potentially one of the largest airdrops in crypto history.\n\nAD\n\nAD\n\nAccording to CoinGecko, the largest crypto airdrop so far was for Uniswap’s UNI token on September 16, 2020—a $6.43 billion event. Wormhole’s upcoming airdrop would place it firmly within the top five.\n\nThat said, Wormhole hasn’t announced an official airdrop date, and pre-market trading prices may fluctuate wildly before then. There’s also a strong chance the price could collapse dramatically after the token is listed on exchanges, as is what happened with Starknet’s STRK airdrop last month.\n\nThe Wormhole and Starknet airdrops are similar in several ways: tokens for both protocols have a fully diluted supply of 10 billion tokens, and each gives governance rights to its holders to determine the future of the project in a decentralized manner. Much of the W supply is also being reserved for its biggest stakeholders, including 5.1% for guardian nodes, 12% for core contributors, and 11.6% for strategic network partners.\n\nWormhole allows crypto users to send messages and assets between 30 different blockchains, having popularized as a two-way bridge between the Ethereum and Solana networks. It held a $2.5 billion valuation following a $225 million funding round that closed in November 2022.\n\nAD\n\nAD\n\nWormhole’s website currently claims that the protocol has processed over $35 billion in transfers since its inception. Portal, the asset bridging protocol built on Wormhole, holds TVL worth $1.6 billion, according to DeFi Llama.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5uYVlBRDVBdFZzYndPekJCUkhLaENqT2NrR3Y1T1VkeU9KTHhEWFJqTzFPaFJKSmlQY1l5RjJxb2VwazJ4b2EtOWhiNXo4aDRLUVRZRDhOOUpGN0NW0gFiQVVfeXFMTnNrd21WX0s1VDVBaDh1YUVBTXo5Ql9NVldBSVE2SU1Vak03emVTTWVjUlF5QVNjNkYyQWRoaXZjYW80Qk5IbmxJbEZyTXprRkxuN2lvUUhEMmlYUnBSOTByMEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Top Analyst Downplays Ether ETFs - U.Today",
        "content": "Advertisement\n\nThe cryptocurrency market is busy discussing the potential approval and implications of Ether ETFs. However, not all industry experts are optimistic about its immediate future.\n\nEric Balchunas, a senior Bloomberg analyst, has expressed skepticism, comparing the excitement around Ether ETFs to an opening act trying to follow a headliner.\n\nThis might indicate that the much-hyped Ethereum ETFs may not live up to the hype, especially when compared to spot Bitcoin ETFs.\n\nThis sentiment casts a shadow of doubt over the potential impact of Ether ETFs on the cryptocurrency landscape.\n\nAdvertisement\n\nMajor hurdles\n\nJake Chervinsky, chief legal officer at Variant, recently expressed his concerns regarding the approval of ETH ETFs this year.\n\nCiting political pushback faced by the SEC during the approval of Bitcoin ETFs and the current market's volatile nature, Chervinsky stressed the regulatory body's cautious stance.\n\nThe SEC's hesitancy, coupled with its ability to justify denial based on legal grounds, even if questionable, shows how hard it would be for Ether ETFs to get the green light.\n\nDespite BlackRock's influential position and previous successes in securing ETF approvals, Chervinsky argues that the SEC's request for withdrawal could be a likely scenario.\n\nStill big deal?\n\nNot everyone is subscribing to this cautious outlook. Nate Geraci, president of The ETF Store, predicts that spot Ether ETFs could have a more significant impact than many anticipate.\n\nDrawing parallels with the underestimated demand for spot Bitcoin ETFs, Geraci points out ETH's substantial market capitalization, which stands at one-third of Bitcoin's.\n\nWith the spot Bitcoin ETF category already amassing approximately $50 billion, the introduction of Ether ETFs could potentially tap into a significant market interest.\n\nAs reported by U.Today, BlackRock's Bitcoin ETF recently surpassed $10 billion in assets under management. It set a new record for the fastest ETF to reach this threshold. The record was previously held by a gold-focused fund for several decades."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeHpTdEdjTEM3OVNPOTExaVZGOE5ZM3Z6MHp2eW5tTXhZNG5xZ3JGMnhIRGJLUGZFdmNraGxIQ2VwQzBKNVpMNzN6UmdvMnhSbGhySXotQkpiQnVobVFGRkR0c0MtR1RjU2hncjRGQ3g0UVVMUTlqVjZncmlWQm4yUmk0UzhzNkhZTEVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Filecoin is riding the boom in liquid staking - DLNews",
        "content": "Liquid staking is booming on Filecoin.\n\nMost of the increase has come from the GLIF protocol.\n\nGLIF said it intends to launch a points system, a trend among Ethereum and Solana DeFi applications.\n\nAlmost one year after the introduction of Ethereum-style smart contracts, so-called liquid staking protocols are booming on Filecoin, a blockchain built to store data.\n\nSince January 1, the value of crypto locked in Filecoin’s dozen liquid staking protocols has grown to more than $450 million from $272 million.\n\nIt’s a sign users are becoming more familiar with Filecoin and its nascent DeFi ecosystem.\n\nIt’s also another sign that users love the points systems that have taken over Ethereum and Solana, too.\n\nA “likely catalyst” for Filecoin’s recent growth “is the anticipation of rewards programs that incentivise user activity,” Messari analyst Mihai Grigore told DL News.\n\nLike airdrops — projects’ distributions of free tokens to reward early or loyal users — points programs, which function much like traditional businesses’ rewards programs, can juice user activity.\n\nUnlike airdrops, however, they allow US-based projects to avoid the regulatory headache that can come with promising or issuing tokens.\n\nAs such, they have spread like wildfire among decentralised finance applications on Ethereum and Solana. They appear to be a powerful incentive on Filecoin, too.\n\nJoin the community to get our latest stories and updates\n\nOf the dozen liquid staking protocols tracked by DefiLlama, all have grown at least 48% in the past month. But GLIF, the largest, has separated itself from the pack.\n\nGLIF is a long-running project on Filecoin. It built one of the blockchain’s first wallets, according to founder Jon Schwartz. When Filecoin developers added smart contract functionality in March 2023, GLIF built a liquid staking service.\n\nDeposits to GLIF have skyrocketed since early February, when it announced a $4.5 million raise and the launch of a points system sometime in the first quarter of the year.\n\nSince then, the total value of crypto locked in GLIF has more than doubled. On February 22, user activity briefly overloaded GLIF’s website.\n\n“Year-to-date, GLIF’s increase in net deposits of [about] 6.9 million FIL accounted for nearly 76% of the total DeFi net deposits on Filecoin,” Grigore said. That figure doesn’t account for collateral posted by borrowers on GLIF.\n\nSchwartz attributes the jump to points and to growing comfort with Filecoin.\n\nWhen Filecoin developers launched the blockchain in October 2020, there were only 11 built-in smart contracts.\n\n“That would be analogous to Ethereum having, say, 11 smart contracts, and those were the only ones you could really use on the network,” Schwartz told DL News. “No developers like myself could deploy custom smart contract logic to the chain.”\n\nThat changed last March, when developers introduced smart contract functionality.\n\nThat change brought Ethereum-style smart contracts on Filecoin, enabling DeFi use cases, “notably liquid staking,” Grigore said.\n\nSchwartz believes the blockchain is now reaping the benefits of that paradigm change.\n\n“You know how these things go, especially with new and immature networks,” he said. “It takes time for DeFi to develop and for people to get comfortable.”\n\nLiquid leasing\n\nLiquid staking is the biggest business on Ethereum. As of Wednesday, users had deposited more than $46 billion in cryptocurrencies in Ethereum’s three dozen liquid staking protocols.\n\nThat’s because it addresses a key issue with Ethereum’s so-called proof-of-stake security system, which was adopted in September 2022.\n\nIn a proof-of-stake system, security, as well as the privilege of confirming and ordering transactions, comes from users willing to lock up, or stake, their Ether in exchange for a modest annual yield.\n\nLiquid staking protocols address the opportunity cost that comes with locking away one’s Ether by issuing derivative tokens, which typically trade at par with Ether and are accepted in its stead by decentralised exchanges and lending protocols.\n\nFilecoin isn’t a proof-of-stake blockchain, and Schwartz prefers to call GLIF a “liquid leasing” protocol.\n\n“That said, the problem space the GLIF is filling for Filecoin is pretty much the same problem space that, say, Lido is building for Ethereum, or Jito for Solana,” he said, referring to other blockchains’ liquid staking protocols. “But the mechanisms are different.”\n\nFilecoin’s big year\n\nIt’s just the beginning of what could be a busy year for Filecoin.\n\nEarlier this month, Filecoin and Solana project Triton One announced a partnership, in which Triton would store Solana data on Filecoin.\n\nDevelopers behind billion-dollar decentralised exchange Uniswap deployed the protocol to Filecoin this week. SushiSwap developers launched their decentralised exchange on the blockchain in November.\n\n“A lot of these new projects that have components that were built on the [smart contract functionality] … they’ll come out this year,” Schwartz said.\n\n“It’s going to look like a different Filecoin, simply because what’s possible this year was not possible in the three, four years prior,” he added.\n\nAleks Gilbert is a DeFi correspondent for DL News. Have a tip? Contact Aleks at aleks@dlnews.com."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPd1dvZFBvY2JfVkR1OEZ6MXEyWWFiRmtUcVVuZ25DUENTVm5JSUJFMmFmaUJFMlZxblZDY0dNOEEyazdSNTNxVHh5Y2daV3VvUGhONXJCZG1xRDRhXzYxRjNsaEFNMmQtR3BmNHVONDVzRFI3ZS1QRkNXaE9PeXlnNG01VWhDa1NGSjZEeGNOMHVCb3NrcGV3OE91RzZjeUZPbm9tUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Ecosystem Update: Fee Reductions on the Horizon for Major Networks - Crypto Head",
        "content": "Key Takeaways: Scheduled for next week, this major Ethereum upgrade aims to significantly lower costs for layer-2 networks, particularly through enhancements in rollup technology.\n\nThe upgrade is expected to lower the operational costs for layer-2 networks, with these savings likely passed down to users in the form of decreased transaction fees, though exact savings remain speculative.\n\nEntities like Polygon, Arbitrum, and StarkWare express varied expectations for post-Dencun impact, highlighting the upgrade’s potential but noting the difficulty in precise cost reduction forecasting.\n\nStarkWare CEO projects a dramatic decrease in transaction costs due to cheaper data storage with blobs, possibly by a factor of ten for the bulk of user costs associated with data on layer-1.\n\nBase’s head predicts initial significant fee reductions, potentially by 90-95%, but expects an equilibrium fee rate to emerge as demand increases, aiming for “sub-cent” transaction costs in the long term.\n\nEthereum’s ecosystem is on the brink of a significant transformation with the impending Dencun upgrade, slated for next week. This pivotal update is set to introduce Dencun, marking a monumental shift towards reduced operational costs for layer-2 blockchains, notably rollup networks designed for enhancing transaction speed and cost-efficiency over the primary blockchain.\n\nThe crux of the Dencun upgrade is EIP-4844, colloquially known as “proto-danksharding.” This introduces a novel transaction category aimed at lowering the expense of data transaction publishing on rollups by incorporating data “blobs” – designated storage within transactions for temporary data holding by rollup networks or protocols, likened to a “side car” for auxiliary space.\n\nThe integration of more blobs is anticipated to substantially decrease the costs for layer-2 networks to store data on Ethereum, with expectations of these savings trickling down to users through reduced fees.\n\nHowever, the precise impact remains a topic of speculation among Ethereum experts. Queries directed at major layer-2 teams, including Polygon, Arbitrum, StarkWare, and Coinbase’s Base, have yielded insights into their expectations post-Dencun, albeit with varying degrees of certainty.\n\nPolygon’s co-founder, Jordi Baylina, suggested at the ETHDenver conference that the expansion in data availability on Ethereum should logically lead to lower prices due to increased supply.\n\nHowever, he noted the difficulty in predicting the exact reduction, emphasizing the upgrade as a crucial step in Vitalik Buterin’s roadmap for scaling the blockchain through rollup-centric activity. Polygon’s approach, particularly with its recent emphasis on ZK rollups, stands to benefit differently compared to optimistic rollups, according to Brendan Farmer, another Polygon co-founder.\n\nSteven Goldfeder of Offchain Labs, associated with Arbitrum, highlighted the upgrade’s potential to elucidate the intricate dynamics of layer-1 and layer-2 fee structures, underscoring the unsustainable nature of pricing layer-2 fees at nominal rates.\n\nStarkWare’s CEO, Eli Ben-Sasson, pointed out the significant potential for cost reduction attributable to blobs, especially given that data costs on layer-1 constitute the bulk of transaction expenses for users. StarkNet, developed by StarkWare, has been meticulously prepared for the proto-danksharding implementation, aiming for immediate compatibility upon the upgrade’s activation.\n\nCoinbase’s Jesse Pollak, discussing the Base layer-2 network, projected that proto-danksharding could initially lower transaction costs by 90-95%, assuming no surge in usage. However, he anticipates a balance between reduced costs and increased demand, possibly settling transaction fees at two to five times less than current rates, potentially reaching sub-cent levels.\n\nThe Dencun upgrade, particularly with its introduction of proto-danksharding and the concept of blobs, stands as a testament to Ethereum’s continuous evolution. It aims not only to enhance the efficiency and scalability of layer-2 networks but also to substantially lower transaction costs for users, albeit with the exact outcomes yet to unfold.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPM1EyV0Z1UmNHTm1OcFhWeDYteWk5aGNVT1RiQTBhUjFPRnA3elpqRnM4Z2lqTHhMYVpVQngwLTdtMnVCNnZIeXlXOG4xVTdadlVPM2o1aXcwTDdKYllRWEFvZkdEc0h4T0dxTGN5dWl6MGVVTzBTLUZJb09oZUNVYmdBcm0xbWo2eWJEUWJiaEU4UnZVMF9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "3 Cryptocurrencies to Buy Hand Over Fist in March - The Motley Fool",
        "content": "Bitcoin, Ethereum, and Chainlink are three cryptos that could be ready to soar even higher in 2024.\n\nAccording to a growing number of analysts, the next crypto bull market rally has officially started. Enthusiasm over the arrival of new crypto investment products is building, top cryptos are surging, and the long, cold \"crypto winter\" now seems to be a distant memory.\n\nIt's time to start looking for coins and tokens likely to skyrocket higher as part of a broad-based crypto market rally. Three that are on my short list are Bitcoin (BTC 0.24%), Ethereum (ETH -0.22%), and Chainlink (LINK -0.72%).\n\nBitcoin\n\nIf there is a no-brainer crypto investment in 2024, it's Bitcoin. After an awkward start to the year, when it briefly fell below $40,000, Bitcoin is now on a tear. It's up 35% for the year, and is holding strong above the $50,000 mark.\n\nMost of those gains, of course, have come on the basis of the Securities and Exchange Commission's (SEC) approval of the new spot Bitcoin exchange-traded funds (ETFs) in early January. In a single move, the SEC gave the green light to Bitcoin as an asset that anyone could hold as part of a well-diversified portfolio. Investor fund inflows into the new Bitcoin ETFs have been off the charts. All of this new buying of Bitcoin, of course, should continue to send the price of Bitcoin higher.\n\nAnd that's really just the start, because Bitcoin has another catalyst in place that might be much more powerful: the upcoming halving, scheduled for April. There have been three previous Bitcoin halving events, and each one has sent the price of Bitcoin to a new all-time-high.\n\nPast performance is no guarantee of future performance, of course, but investors are understandably excited about just how much higher Bitcoin could go after April. Suddenly, Bitcoin's all-time high of $69,000 looks well within reach, and many investors believe Bitcoin could end the year at $100,000 or higher.\n\nEthereum\n\nAmid all the buzz surrounding the new spot Bitcoin ETFs, Ethereum is also soaring higher. This is primarily due to the growing narrative that Ethereum will be the next crypto in line to get its own spot ETF. A handful of Wall Street firms have already submitted applications, and SEC approval could come as early as May.\n\nThe only question, of course, is whether Ethereum will be another case of \"buy the rumor, sell the news,\" as Bitcoin was in January. Simply stated, the huge rally Ethereum has seen thus far in 2024 might fizzle out in May, as soon as the new ETFs become available to investors.\n\nThat being said, there's still enormous upside potential with Ethereum, which is currently undergoing yet another upgrade to remain a best-in-class blockchain.\n\nChainlink\n\nGiven that Bitcoin and Ethereum together account for nearly 70% of the total value of the $2 trillion crypto market, it's worth looking for ways to diversify your portfolio beyond just the two biggest names. Of all the cryptos that rank in the top 20 by market cap, my personal pick is Chainlink.\n\nThat's because Chainlink, as a data oracle network, is completely different from both Bitcoin and Ethereum. Chainlink provides real-world data to smart contracts, which are one of the key building blocks of decentralized finance. Since Chainlink is the biggest and best-known data oracle network, it is also the most valuable. The crypto currently has a massive $11 billion market cap, which ranks No. 12 among all cryptocurrencies.\n\nWhat makes Chainlink particularly interesting is that it is also a long-term play on an emerging trend known as real-world asset tokenization. This refers to the process of transforming traditional financial assets (such as stocks and bonds) into digital assets that live on the blockchain.\n\nThese financial assets require data for proper pricing, and that's where Chainlink comes into the picture. Right now, Chainlink is one of the leaders when it comes to real-world asset tokenization, which has the potential to become a multitrillion-dollar trend by the year 2030.\n\nPortfolio diversification and risk factors\n\nWhile the long-term prospects for Bitcoin, Ethereum, and Chainlink look good, just remember to do your due diligence before investing. Crypto is notoriously volatile, and regulatory risk is always a very real risk factor. As a rule of thumb, it's best to invest in large-cap cryptos that have a diversified base of both retail and institutional investors.\n\nIf forced to rank these three cryptos, Bitcoin would easily be my No. 1 choice. But, as they say, it's best not to put all your eggs in the same basket. Portfolio diversification is key, and two cryptos that could play a key role in this regard are Ethereum and Chainlink."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9nRnp1RXlGRmhOaEtYWmV2RDVpN3Y1SVF6T0xtNzBLU2dqNlFDTi1oX0pzU0cyWnJucWVKcmlPdnZoUnk5UkNIYmxIZ3VJVDF4dERVdnFraFRmd2dXMmlIUmRxd0hNd0FsblRSMkN3aV9LYnEwblY2U0E2Z1dqdjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Top cryptocurrencies to watch this week: ETH, DOGE, SHIB - crypto.news",
        "content": "The cryptocurrency market was highly prosperous last week, witnessing a remarkable 16% surge in the global crypto market cap to $2.32 trillion. During this positive trend, altcoins like Ethereum (ETH), Dogecoin (DOGE) and Shiba Inu (SHIB) are among the top cryptocurrencies to watch heading into Monday.\n\nETH, DOGE, and SHIB prices – March 3 | Source: Santiment\n\nETH breaches $3,400\n\nETH is up 9.6% this week.\n\nAs Bitcoin (BTC) garnered significant attention from market participants this week, Ethereum capitalized on the rally, achieving substantial surges beyond crucial psychological thresholds that had historically posed formidable challenges during its previous rallies.\n\nAt the onset of the week, Ethereum started on a positive note, securing an impressive three-day winning streak spanning from Feb. 26 to Feb. 28. During this period, the cryptocurrency overcame the psychological resistance levels at $3,200 and $3,300.\n\nRemarkably, Feb. 28 stood out as Ethereum’s most bullish day, with the asset surging 4.40% amid Bitcoin’s rally beyond $63,000. However, ETH experienced a pullback on Feb. 29 after reaching a peak of $3,521. The last time ETH saw the $3,500 level was in April 2022, before the Terra-induced price slump.\n\nAfter retesting $3,500 on Feb. 29 due to increased exchange outflows, Ethereum faced intense bearish pressure, resulting in a 1.33% decline — this marked Ethereum’s first intraday loss for the week. Nonetheless, a recovery campaign on March 1 saw ETH breach and retain $3,400.\n\nDespite facing selling pressure attributed to rising exchange inflows and a potentially overbought RSI, Ethereum has managed to stay above $3,400, currently trading for $3,411 at the reporting time.\n\nYou might also like: Bitcoin options surge to $500m as whales apply cautious strategies\n\nDOGE records a 55% surge\n\nWhile Ethereum recorded a bullish week, its gains pale compared to Dogecoin. Notably, DOGE emerged as one of the most significant beneficiaries of the market uptrend despite commencing the week at a modest price of $0.08611.\n\nBefore the recent rally, Dogecoin had been in a consolidation phase, fluctuating between $0.094 and $0.076 since the beginning of the year, with $0.09438 acting as a formidable resistance level. On Feb. 27, DOGE successfully surpassed this threshold, rallying to a peak of $0.10058.\n\nFollowing the correction at the $0.10 resistance, Dogecoin maintained its position above the $0.094 level, concluding Feb. 27 at $0.00766 with an impressive 9.45% intraday gain. The meme coin built on this momentum, achieving a substantial 18.69% gain on Feb. 28, as it surpassed the $0.11 and $0.12 levels.\n\nDOGE sustained its uptrend until it hit a 16-month high of $0.15074 on March 2. This price represented a 75% increase from Dogecoin’s weekly opening price of $0.08611. The token expectedly faced stern resistance at $0.15, but held up well above $0.14, closing the day at $0.14206.\n\nIn a notable retracement from the March 2 highs, Dogecoin has experienced a 6.07% drop today as the market corrects from the week-long uptrend. Despite these bearish developments, DOGE maintains a considerable 55% gain for the week, currently trading at $0.13335.\n\nSHIB makes it to the top gainers’ list\n\nThe crypto market witnessed a resurgence of meme coins amid the uptrend, with Shiba Inu surfacing as one of the biggest gainers. SHIB began the week at the $0.000009 level, a threshold it had continued to trade at amid the previous market bearish consolidation phase.\n\nShiba Inu held above $0.000009 at the time, looking to leverage the threshold as a springboard for more substantial gains when a market uptrend comes up. This plan went well, as the asset took advantage of the Bitcoin rally to secure one of the most substantial weekly gains in the market.\n\nSHIB recorded multiple substantial intraday gains, with the lowest coming in at 4.18% on Feb. 26.\n\nThe month of March bode well for the token, as it recorded its largest intraday gains on March 1 and March 2 soaring 34.33% and 33.93%, respectively. SHIB eventually flipped MATIC, DOT and TRX to become the 12th largest asset by market cap.\n\nAmid these price surges, SHIB breached the $0.00001 and $0.00002 zones, soaring to a 22-month high of $0.00002390 on March 2 before witnessing a retracement. Despite the retracement, Shiba Inu has retained a spot among the top 5 gainers this week, changing hands at $0.00002176 amid a 125% weekly gain."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOZ2tYUXhVdWtjZ05ROEduTEgzOHVBNWdGWnVzaUdDQW5oYWpLSmlWOFRxTUNkakdfZVloWkp6ZERZVVk4eUYybUd3TEw2VTBucmhyTjVjZGRxcWQxMGF6cmZEZHhoaWZGa2lpQ1k3b2g0c29BVkhvQ01kbFVCWUpwRG9FLU94akJWLUowSWR2ONIBlAFBVV95cUxPOEhJal91RDVXcHRrbW1qSDFXVTBoYlEzLVBJWDA4V1RUMlZVNFR4U1A0Q3c5RTBIc3k1XzgtSmMxSkRKY3JZZHRvTTkyLW5oY2E1OTZJOEUzTGtGUm1mcWxXT2xCekxaTFZwRWtGclA3Vng0bHAwTjVxcEVzYVRtRXZfUTF6RzdCWGlVZTdUMVRUcjhX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Analyst Reveals Why He’s Choosing ETH Over BTC For Long Positions - ZyCrypto",
        "content": "Advertisement\n\nAmid a lackluster performance in the overall crypto market, discerning investors are shifting their focus towards Ethereum (ETH) and Bitcoin (BTC), the flagship cryptocurrencies. Notably, some are now actively debating and analyzing which of the two, ETH or BTC, holds greater investment potential.\n\nOne such investor is renowned analyst “ImNotTheWolf” who took to Twitter on Saturday to share his views expressing a preference for buying ETH over BTC.\n\nThe analyst outlined the reasons behind the decision, first emphasizing the narrowing window of opportunity for Bitcoin market cap dominance. He further shared the weekly chart showing that BTC dominance trend has hit a major downtrend resistance along the 55% level. According to him, a rejection along this trendline could see Bitcoins dominance recoil further in coming months, making Ethereum’s to rise.\n\n“Bitcoin Dominance only has a spread of +4% before hitting my ‘target’ of a major downtrend resistance, vs a -30% difference to the downside (which is where I believe Ethereum will shine).” Wrote the pundit.\n\nTo further back his argument, the analyst speculated that Bitcoin’s ETF volume would be redirected into Ethereum, explaining, “The Bitcoin ETF was somewhat largely ‘priced in,’ and the quick move has already played out.”\n\nAdvertisement\n\nHe further predicted that savvy institutional players would use incoming institutional volume as ‘exit liquidity’ to secure profits on Bitcoin, shifting to larger positions in Ethereum. Additionally, he pointed to the anticipation of an spot Ethereum ETF and the upcoming launch of BLAST, an Ethereum layer-2 scaling network, suggesting that these events could usher in a new ‘DeFi Summer’ and ‘Altcoin Spring.’ Notably, major financial players like BlackRock and Fidelity have sought approval for spot Ethereum ETFs, signalling growing institutional interest in the second-largest cryptocurrency.\n\nMoreover, the upcoming Dencun upgrade, set to bring enhanced scalability and reduced transactions costs is anticipated to further bolster Ethereum’s market position as well as the price of ETH.\n\nThat said, the pundit concluded by urging investors to make prudent investment choices, suggesting that this might be the last ‘cycle’ before a potentially prolonged bear market triggered by over-regulation.\n\n“However, if you play your cards right… one cycle will be all you need to achieve financial freedom,” he noted."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWGF5N1JRTjBncFdocDZjd0sxcVFIbE5ONnZyM3hTVDAzWFpLZ1IxeUdUdGJQUUhCVUNIRmxuS1k3dGNGNklPVjRaSWxfeEZXTXJINGVLSmR2R0tVZmNQRUR0QUM5eU0xRUhJS2FhSE5lRHVqLW5jZmNCbDFiX1Z5R1ZMMDkySjB3NVAyZnNNcUHSAZYBQVVfeXFMTkRJNjZ0a01HYl9KS2ZXcnh5NTFDcUxveWstQzVHcS1jbGdKYkJRb3hEZV84R1VQXzNsdC13RC1qVF8yR3pGR24wNjB3QkRQYjRHbVFkWllxblB2NldOaF9tVEdXR0dYNHZQYnZHT1JCV1RSSmQ0RmlqLVM5MTZFYjNheGdaV0t6UnFKS0p0bktXRjQ5UWdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum L2s take the center stage as countdown to Dencun begins - AMBCrypto News",
        "content": "ETH L2s handled nearly 10x more transactions than the base layer in the last seven days.\n\nTVL on ETH L2s jumped 65% YTD.\n\nEthereum [ETH] layer-2 (L2) solutions carried on the strong momentum generated in the last year to 2024 as well.\n\nEthereum scales and how\n\nAccording to a recent post by on-chain analytics firm IntoTheBlock, transaction volumes across leading optimistic rollups including Arbitrum [ARB], Optimism [OP] and Base have nearly doubled since the start of this year.\n\nOn expected lines, Arbitrum accounted for more than 50% of the total volume.\n\nTo get more insights, AMBCrypto examined the broader ETH L2 market, which included zero-knowledge rollups (zk-rollups) as well.\n\nData sourced from L2Beat showed scaling solutions processing nearly ten times as many transactions on the mainnet over the last seven days.\n\nThe average transactions per second (TPS) on the L2s consistently remained above 100 since the 25th of February, while the mainnet’s count hovered in the usual range between 12-14.\n\nL2 solutions witness jump in TVL\n\nThe so-called L2 solutions, built atop the base layer of Ethereum, were projected to be the answer to the scalability question.\n\nWhile these chains handle the bulk of the low-value transactions, the mainnet would take care of security and decentralization, thus addressing the blockchain trilemma to a great extent.\n\nThe fundamental advantages like high throughput and low fees attracted a plethora of decentralized applications (dApps) towards L2s.\n\nAs of this writing, more than $33 billion was locked into L2 projects, implying a 12.9% increase over the week, and a 65% leap year-to-date (YTD).\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA watershed event awaits\n\nSuch numbers come at a time when the L2 proponents and the broader Ethereum ecosystem were eagerly awaiting for the Dencun Upgrade. The biggest upgrade since last year’s Shapella, Dencun was expected to bring about a whopping 10x reduction in L2 transaction fees.\n\nIf these estimates come true, the ETH L2 ecosystem might hold the vast majority of all DeFi users and apps in the near future."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxObnA1TG5yNW9yWjJvZm5wVEpob1VjaUdnX1MyWEhfQ3JWX1hmRm5tblRRY0pKcXVuVjVUQzRpU1N3UFB6N19uWGFQNVhORlM0TEpldmFXbzVqckQ5cUxDLW5ibzhHbTNaTzc1dlRlcFpsRF9TTThmT2NnOG0tTU1tSU56dVktdjV6b0dJ0gGQAUFVX3lxTFA0N3NFVVY2Q3pvSGh0dk9kQ2tpQkFOemlfTkhFUUtHSWN5U1hVanBFQUpuaklucm90cExfTTNRRkRqWDJGN1JqdjFHREpTbDhkZldBa25QX29FRzZaS0lkSnR1bXJZNU83T3ZPTTBVcnlaVVAxX3gySnF4MlBCOWgyNHo1R1NicVV5VVVEVmRYZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin Reacts to Memecoin’s Parabolic Surge - CoinGape",
        "content": "Ethereum co-founder Vitalik Buterin intervened in reaction to an X post by Roko Mijic criticizing the acceptance of memecoins, which caused a significant rise this past weekend, to correct the record on the fledgling asset class’s adoption.\n\nThe Vitalik Buterin Disposition on Memecoins\n\nThe ongoing memecoin rally in the digital asset space pushed the combined market cap of the assets up 30% north of $41 billion earlier today. Popular Shiba Inu (SHIB) surged by a wholesome 52% earlier today, leading the memecoin rally. The price surge took the price of SHIB to $0.00002 and till the time of this writing, the token has yet to bow to bearish correction.\n\nadvertisement\n\nCanine-themed memecoin Dogecoin (DOGE) equally registered up to 30% increase earlier in the week. Market analysts believe that DOGE may be gearing up for a mega bull run in the long run. Its average daily trading volume has also gone up significantly, surpassing $4.77 billion. Overall, the rally has touched almost all memcoins and there are still speculations that the positive momentum will last for a while.\n\nOne X user tried to establish the fact that these memecoinuse cases are currently experiencing a rally due to a lack of use cases resulting from a decline in crypto infrastructure. However, Vitalik Buterin reacted to the post, trying to explain that this is not the outlook in all cases.\n\n“I feel like 2 years ago I completely agreed, and my high-level argument was something like “infrastructure is public goods, the incentive to fund public goods is N times smaller than optimal (that’s basic econ 101), so it’s practically impossible for there to be too much infrastructure”,” Buterin explained.\n\nUnder-loved Infrastructures In the Crypto Ecosystem\n\nHe went on to talk about how “infrastructure” is a diverse category where some could be public goods and others are “realistically a zero-sum network effect grabbing game.” For Buterin, he perceives some infrastructures as being over-invested, having more than enough acceptance and adoption. On one hand, others are barely loved and talk more about being accepted.\n\nI feel like 2 years ago I completely agreed, and my high-level argument was something like \"infrastructure is public goods, the incentive to fund public goods is N times smaller than optimal (that's basic econ 101), so it's practically impossible for there to be too much… — vitalik.eth (@VitalikButerin) March 2, 2024\n\nFor perspective, the Ethereum co-founder itemized some of the infrastructure that he perceives as under-loved. Zk voting as well as association set providers for privacy pools made it to the list amongst many others.\n\nVitalik Buterin mentioned ENS names on Layer-2 with decentralized verification via CCIP as one of the under-loved infrastructures. The others were proof of personhood and proof of community membership, more secure software supply chains for DApps, and a fully decentralized (and no “governance token”) instant cross-L2 token transfer protocol.\n\nAll these have gained expression one or or another with Polygon deploying the ZK technology through its ZKEVM protocol. However, the adoption is generally at a lower pace compared to the hype memecoins are generating at the moment.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPaXViWjI0RDZWdDNLVEFHZmFTOEhxbnpyOF9hX28yaDNYYjhSNGhaRFlpRzVwdU5FVVlVRWtxZHNKVjY3T0ZtNHlvWFlBaUVJVTQ0bDJ5LXM3VThtaVAtTWwybXE2NjJkVnRxUEpGNEtHTEZMNmpUNVJCc3lqVE1PbmlubkZfSjdJYnfSAZIBQVVfeXFMT29DaHUySjJNVjNORktlVjhwQTVQeVowZU9aTkxPcGZsMjBscXhNbnh5M3lfUUxVOV8xN01LR196d01qWEEyRlF4UW4tMHVGX3JHLWgySzBIZmpuUVNXZ1hId1JjeTZNXzF0WDRMcWtLOC1kc2k0OW9EbnNfbzJsTXdoTzVxejN0c1VXYzg4MS04RkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "This Week in Crypto Games: Portal Airdrop Begins, Ethereum Card Battler 'Parallel' Opens Up - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto and NFT gaming space is busier than ever lately, what with prominent games starting to release, token airdrops piling up, and a seemingly constant array of other things happening at all times. It’s a lot to take in!\n\nLuckily, Decrypt’s GG is all over it. And if you need a quick way to get caught up on the latest moves around crypto video games, we’re debuting This Week in Crypto Games.\n\nOur weekend roundup serves up the biggest news from the past week, along with a few other tidbits you might have missed. We also showcase a few of our original stories from the week.\n\nBiggest news\n\nAD\n\nAD\n\nPortal token launches: You’ve probably heard about this one if you follow the crypto gaming world at all. The long-awaited PORTAL token launched Thursday following a huge airdrop farming campaign across Twitter, and it popped above a $500 million market cap before cooling off. Portal is a cross-chain gaming platform designed to bridge the gap between games and networks, and there’s still a ton of hype around it.\n\nParallel open beta: NFT card game Parallel, which we picked as our 2023 game of the year, is now available for anyone to hop in and play following Thursday’s launch of the open beta. Think Hearthstone but with added complexity, an appealing space opera vibe, and collectible NFT cards. Now one of crypto’s brightest games is available for anyone to check out.\n\nDookey Dash cash: We already knew that Yuga Labs plans to bring back last year’s viral crypto gaming sensation Dookey Dash, albeit without NFT gating. And now we know that the free-to-play version—Dookey Dash: Unclogged—will still offer serious prizes, with a prize pool of more than $1 million set to be offered up when the game launches this month.\n\nSpeaking of Dookey Dash: Unclogged—Rug Radio creator Gabriele \"Orangie\" Leyva went hands-on with an early version provided by Yuga Labs and shared the following preview with Decrypt's GG:\n\nEx-PlayStation boss joins READYgg: This news flew under the radar a bit, but former PlayStation boss Shawn Layden was announced last week as an advisor for READYgg, a crypto gaming infrastructure startup. He’s apparently keen on NFT tech being used for user-generated games, for example, and will use his connections and influence to help more game developers embrace the space.\n\nAD\n\nAD\n\nICYMI\n\nThe original Stormtrooper design from “Star Wars: A New Hope” will be featured in Solana gaming platform MixMob, but there’s an interesting backstory to the deal .\n\nArbitrum layer-3 gaming network Xai launched staking rewards last week, which will roll out in phases. Here’s what you need to know .\n\nCrypto gaming startup Gala launched its GalaSwap decentralized exchange (DEX) last week on its new layer-1 network—and there are trading rewards.\n\nTelegram game Notcoin will start to purge mined coins from inactive game accounts ahead of the upcoming token drop on The Open Network (TON).\n\nLong-running Ethereum NFT card game Gods Unchained has finally gone mobile with last week’s launch of iOS and Android versions.\n\nThe Arbitrum Arcade promotion will showcase games building on the Ethereum scaler and offer up $200K worth of grants to content creators.\n\nImmutable said last week that it has now onboarded 200,000 users to Immutable Passport, a streamlined wallet designed for non-crypto natives.\n\nNot crypto, but AI—Google’s DeepMind team revealed a demo for an AI tool that can generate video games on the fly based on a user prompt. Wild.\n\nGG spotlight\n\nHere are a few of our original stories from this past week that we think are well worth a weekend read:"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiowJBVV95cUxNY0VfVlhMdGlIclJjRDg5V0hzdklQdWhMOXlPQjFvMnFXeHRQdENhUkF2WTBSNzVBT0doQlZ3cWlaQVJzV0gxRXE5NTRaQ1kyS2FSUVlRTG1GQm4xcWlTeHdLblQ3dEh5SE9XczBqMUpYalMwRFV1Sml4dzlZVGRoOUhkWHB1dzk3Zmt5eldDQ3hvM2JLamk2MkpZcVlVdDA2U3VGbjQ5ZUs3VXJnaWdIRU4wQ0FzTzRqc0FnSlNhSXlPMlNCOU8zMmhaYVhuaTQtdzJLX3lidHFla1Bic081bkR1NDZ2V0w2X1dmWjFrLWJGb05xWHFLZlhzR1dFZ01tY1JycUFCaWhrdGlwY3Z2UXNUUzFhWVBfSmJFa1pIeHZtU1HSAbACQVVfeXFMTm9lMWZRVFhUN0VFZGFoanpHby1zSlFoV1ZvWklpZzByQ21XWHJIQTgxNGc2Vk1vaFgtUmljZWZkMXd0NHRkVldLTm9WUnVlazVMYVlCYm1TMDd1MkdYRl9Vd0pYa2dPMHdRbHp2Q3o5aHNBRU5uVnZrU0VxTFFsMWFmN21pMm9mNGlsbXc1eWJHLXE2MDdybEMwMF94UUotMjZaUG1CUW1YbG5fVGx6UHhVSjg2djhYUHZhZnRDaldzN1ZvT2hyQ0dkTXpBVFVyLTd5TjRBNDZHclRrdFhJS2dwZkZDdksyeUpiRWRQcXo1ZW1OaldmX19EOUc4bmVZRVdTLVBIZUg2RFg5a08yQUZzNC1nSzlWRE5TNVpGb053dVcteDE5SGVsMXlKLVQ4Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Top 5 Altcoins To Buy Today: Ethereum (ETH), Solana (SOL), Polygon (MATIC), Dogecoin (DOGE), Retik Finance (RETIK) Will Dominate The 2024 Bull Run - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxPWlVlZjFlYUwzLWUxRklFRjd5bk5URk9fMlVHZ21UcmxJZnZ3eHh4RnRVNFVlVDlrZzlKS2tPaGtGaVBHekgwMmtFazBBT1Jta3FqRWRuYUJKSGtHSFJwNnA2LWtCeHNYZ0lDR1lLd093R0p5d1JZb2tBUXRIbHUzcmJtVE1VWlpzLWs0SmZselFfc2tpZFZTVXhySUEwNWlXSEJMTUhHeVRyeWNBekp2cGl4ZmFNRkFWbjlWV2N6a3VKdlVKREo2Z0ZtT0hXUENxYXMtWk9vWHlGMC1VWXpqM0hCQmFDbzRIZU04X0w1dThMeVRBN3fSAYMCQVVfeXFMUE5hUVphX2N2YWN4MjJiWUFoTTRQekJ1ZWNGRVhjS2R3VmdqYllMdXB2aWdTZG4zT2xOelowRHkwSGp6c3N3OTI4SkJfQVNpUFdZR0xnMVJndVZlaFJZOGcxUUI5OGhLTzNDZk9ERXZkcnVpRDFTZnFQSFVEcjI3b0N5SlFVZHBhNTdHX1ozeDVJeGptZ1RSaFlTMTd2LWw5dGc4U1RQZWlqV3JEZTZWdjhqVHo2MEJJakQ5Uy1xdXRWLUhCUkd0QTVtMDhQVlgwbUJ3ZEVvQ043Z1RMN0lQNzhvZDZOYU51TVR3TFZBR01lS0k4S3M0a3hqNXBNRjFibkVMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "Solana (SOL) Bulls Diversify Portfolio with Pushd (PUSHD) Presale Amid Bitcoin (BTC) & Ethereum (ETH) Gains - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBYUjhiRmZPeUVYZ29LWGdYWDZxVWVvWWs0LWJVRUMxM00tbWRCZkVSSzMtaDZoSldBZ0g4TFU1R0tqRGFqQWhFODlReThNXzVYZ3RPbjJhTkJpTjhWNUJsQno5Q0VoZlBrb3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Mar 2024 08:00:00 GMT",
        "title": "This Smart Trader Flips $708 to $3M in 51 Days, Here’s How - Coinfomania",
        "content": "An Ethereum trader has achieved a remarkable feat by turning a mere 0.7 ETH into a staggering $1.39 million in just three weeks.\n\nAccording to Lookonchain monitoring, the story began when this trader spent 0.7 ETH ($1,848) on February 14 to buy 4.26 million GPU tokens. At the time, GPU had only been live for two months.\n\nIn just 21 days, this trader made ~$1.39M with only 0.7 $ETH($1,848), a gain of 755x! He spent 0.7 $ETH($1,848) to buy 4.26M $GPU on Feb 14, when $GPU had been online for more than 2 months. Then sold 3.37M $GPU for 102 $ETH($336K), with 891K $GPU ($1.06M) left.… pic.twitter.com/kUMLpPR0iu — Lookonchain (@lookonchain) March 6, 2024\n\nCapitalizing on the token’s price surge after their initial purchase, this trader then sold 3.37 million GPU for 102 ETH ($336,000) several hours before press time.\n\n755x Return in 21 Days\n\nOn-chain data shows that this investor still holds 891,000 GPU ($1.06 million) tokens in their wallet.\n\nIf the trader were to offload their renaming GPU tokens worth $1.06 million, they would make a total profit of $1.39 million, which translates to a 755x return on their investment. This final figure is obtained by adding the $336,000 profit already taken to their $1.06 million unrealized profit.\n\nWhat is GPU?\n\nGPU is the native token of Node AI, a decentralized platform that provides access to GPU and AI resources, utilizing blockchain to “create a secure and transparent environment for users.” GPU facilitates various activities within the platform, including revenue sharing and renting AI servers with high GPU capabilities.\n\nSince its launch, GPU has been printing impressive numbers. For instance, around the time this trader first purchased the token, its market cap was just $4.3 million. Fast-forward to today, and GPU’s market cap has grown to $116 million.\n\nThis market cap has been mainly pushed by the token price surge over the past few weeks. Data from CoinGecko shows that GPU has surged 534% over the past week.\n\nThe token trades at $1.25 at press time, gaining 114.0% in the past 24 hours. With a 534% surge over the past week."
    }
]