[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNY05ocDFNNlhXSGRMNlBIVzVpSmgzY1NuYzJsSEZsVTRCOU5BTnZCZDB0V25sNlc5TTRBdjh2X3RyOFR6dFUyQ0RBQ0lMb0drQVJnMElZN3BYdnVXYUNJRTVLMHNzWTRJUTN6VkZuc0xCVkctSktyZEsyZzlPMFVYSU4xT3laSnkyX2ZSbDh4dVNwM2UwVHRIQzNjUkE4MjRVci15TnRONUnSAa4BQVVfeXFMTlhDNmtfY2daa2kyMjBfOWpXaVROS0tXVEhjWjZvSEJGZzhJRTgwWTM5cTZkQ3g1V2g3cGFuV19aTDJZUURhSkQ3cHFJeUlPT1B0NWpoSXU2M3RxQVhtWGFzRUxuSVNtSHEtdG1IblVJbnNHM05ReXBuTzBvS0VsdkZyNWItVU03QnNqbUNSb0VuX0s0a2NiYVVkZmNBM09sZHJDV0VzaDkxVHJxTHN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "The SEC ruling on Ethereum ETFs could mark a historic shift in crypto investing - CNBC",
        "content": "VanEck CEO Jan van Eck sees a major sentiment shift underway in the cryptocurrency market linked to the U.S. Securities and Exchange Commission's approval of a rule change allowing for Ethereum exchange-traded funds.\n\n\"This is really one of the most amazing things that I've seen in my career with respect to securities regulation,\" van Eck told CNBC's \"ETF Edge\" this week.\n\nVanEck was the first to apply to the SEC for permission to list its proposed Ethereum ETF. With that first hurdle cleared, VanEck can begin the process of bringing the product to market, though the exact timeline is unclear.\n\n\"There was a real risk that the SEC was going to lose any kind of jurisdiction over digital assets. So the first reaction was to get the ETF, Ethereum ETF approval green lighted,\" he said. \"But I think there's a bigger narrative going on as well.\"\n\nTo van Eck, the buzz around Ethereum this May means clearer regulation on the horizon and an increased investor interest in crypto. In a statement on its website, his company said that \"the evidence clearly shows that ETH is a decentralized commodity, not a security.\"\n\nVan Eck said the Financial Innovation and Technology for the 21st Century Act, or FIT21, passing in the House on May 8 was another major step toward regulatory clarity for cryptocurrencies, even though he is doubtful it will make it to the Senate before the election.\n\nEther spiked on the SEC's approval of applications to list Ethereum ETFs on May 23, but is virtually flat since then.\n\nDisclaimer"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBoMzloaWFlcnZwR09aZ3VadmtrN0tIUEZ5ZTNKWVNDUVl1UHoySkJJZGpKZkRmSXM4SDVTZ0FsTnJGUW1hVWludGNSS3JTdXlNcU1Zd2Q5QWRNSUlFMUtVck9NQllVMzRMZEVBR2JxMUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "EigenLayer raises the stakes for ethereum - Financial Times",
        "content": "Print this page\n\nThis article is an onsite version of our Cryptofinance newsletter. Premium subscribers can sign up here to get the newsletter delivered every week. Standard subscribers can upgrade to Premium here, or explore all FT newsletters\n\nHello and welcome to the FT Cryptofinance newsletter. This week we’re taking a look at a fast-growing new trend in decentralised finance.\n\nThe excitement over the arrival of stock market funds investing directly in cryptocurrencies this year has obscured the rapid changes taking place in the world of decentralised finance, or DeFi.\n\nThe hottest thing in the market at the moment is the emergence of EigenLayer, a new network that lets holders of the ether cryptocurrency simultaneously lend out the same coin multiple times.\n\nUnderscoring its appeal, its Seattle-based parent company Eigen Labs in February raised $100mn from Andreessen Horowitz’s a16z, one of the most influential crypto venture capitalists.\n\nThe concept behind EigenLayer is “restaking”, a new concept for the crypto market. At present holders of ether can earn interest, in the form of more tokens, if they deposit or “stake” their ether on ethereum, allowing the system to secure and validate transactions on the blockchain.\n\nThey earn a reward for it but that keeps their coins locked up and immobile. EigenLayer takes the staked ether and allows it to be reused in other applications that are also built on ethereum — earning them further yield in the process.\n\nIt may well sound familiar. That’s because, fundamentally, it is rehypothecation, or the practice of lending the same asset over and over again. It’s something global financial regulators have clamped down on since the 2008 collapse of Lehman Brothers, when it emerged that the US bank had used collateral posted by clients to help fund its own trades. It took years for customers to be reunited with their assets.\n\nIn the world of crypto, this vice is turned into a virtue. Other services such as Lido Finance also rehypothecate assets but hand out tokens that represent the value of the staked ether.\n\nThe twist with EigenLayer is that it is trying to extend the security that underpins the ethereum network to other applications that are also being built on ethereum. EigenLayer sits in the middle, connecting people who want to use their staked tokens to lend with new applications that are being built. EigenLayer uses automated algorithms and smart contracts to manage the process.\n\nThe advantage of EigenLayer is that, at least in theory, it solves a major issue for the ethereum network. Every application built on ethereum has to sort out its own security with its own validation, and that makes it a highly inefficient, fragmented and costly system that is difficult to scale. EigenLayer can help the network grow by piggybacking on the complex and effective system that validates it.\n\nFrom a standing start in December there are now just under 5mn ether coins, valued at $18.6bn, locked up in EigenLayer, according to data provider DefiLlama. That makes it the second-largest application in the DeFi market, between longtime players Lido on $36bn and AAVE on $13bn.\n\nBut in a research paper this week, Carol Alexander, professor of finance at the University of Sussex in the UK, argued that restaking was creating a major, new risk in the market.\n\nShe said the $18.6bn figure was “vastly overestimated” because some of the numbers had been counted multiple times. The true figure backing the activity is closer to two-thirds of that, she thinks.\n\nThat matters because, she said, each new application needs to rely on highly leveraged tokens backed by very little in a thin market.\n\nThe EigenLayer system is designed to punish bad actors such as hackers by confiscating a portion of staked tokens or deposits as a penalty. It relies on algorithms that unilaterally decide when malicious activity is happening.\n\nThat leaves the leveraged staking market exposed if there are deliberate attacks to steal funds, if prices are manipulated or if lenders simply have poorly coded algorithms, light borrowing standards or poor risk controls. And all built on an IOU of ether, she says.\n\n“Because the vast majority of staking is on ethereum, any stress events . . . have the potential to spread credit contagion throughout the DeFi ecosystem, and this could precipitate another DeFi winter,” she concluded.\n\nAlready the multiplication of layers is dizzying. Applications such as Renzo restake staked ether tokens on EigenLayer — and mint another token to represent that transaction. Applications such as Renzo “are taking on a very large credit risk”, Alexander warned.\n\nThat could lead to a cascade of liquidations in the market and tokens could depeg from other tokens whose value they are supposed to track, she said.\n\nIt has happened before. The collapse of the terra stablecoin, which triggered the crypto market crash of 2022, began with staked ether tokens in the DeFi market and spread because bigger traders and lenders were interlinked with other markets.\n\nHowever some have argued that introducing layers of applications on top of staked ether is “financialisation” of the ethereum network.\n\nEither it can be a protocol for open innovation, more akin to a commodity, or it can be an investable asset that will deliver a yield for investors, said the head of research at one staking service who declined to be identified.\n\n“It’s not really possible for them to do both. If you optimise ether as the financial asset . . . you’re encouraging the creation of this kind of layers and going further out in the risk curve to maximise yield.”\n\n\n\nYet market demand is potentially pushing ether and ethereum towards it being an investable asset, just when US lawmakers and financial regulators are leaning towards ether being a commodity.\n\nIf the Commodity Futures Trading Commission becomes the main US regulator for crypto as expected, then the agency may find itself going down a very deep rabbit hole when piecing together the aftermath of the next market crash.\n\nWhat’s your take? Email me at philip.stafford@ft.com\n\nWeekly highlights\n\nFormer FTX senior executive Ryan Salame was sentenced to more than seven years in prison after pleading guilty last year to election fraud charges and conspiring to operate an unlicensed money-transmitting business while at Sam Bankman-Fried’s failed cryptocurrency exchange.\n\nBlackRock’s IBIT became the world’s largest bitcoin exchange traded fund even though it only launched in January. Its holdings of just under 300,000 bitcoin pipped those of Grayscale, even though its rival held more than 619,000 at the start of the year.\n\nUsers of Gemini’s Earn lending programme will get nearly $2bn of their crypto that was stuck at Genesis, following the digital asset trader’s bankruptcy in January 2023.\n\nSoundbite of the week:\n\nElon Musk dismissed stories that he had talked to Donald Trump about digital assets. He wrote on his X social media site:\n\n“Pretty sure I’ve never discussed crypto with Trump, although I am generally in favor of things that shift power from government to the people, which crypto can do.”\n\nData mining: the rise of ethena\n\nAmong the signs of soaring optimism in DeFi is the emergence of a stablecoin called ethena. It is pegged to the ether cryptocurrency rather than the US dollar, and offers buyers a yield of 36 per cent. From nothing in January, it is now the world’s fourth-largest stablecoin with nearly $3bn in circulation. Its backers argue that it is fully decentralised — pegged to the price of ether so there are no deposited assets sitting in a bank. Instead it uses derivatives to keep the value in balance. This week it overtook First Digital USD, which has $5.29 in circulation and now sits behind Dai, which has $5.3bn in circulation.\n\nCryptofinance is edited by Laurence Fletcher. To view previous editions of the newsletter click here.\n\nYour comments are welcome."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE45cVVqVVZoV2tlVnh4NkVyc1lPY24xR3A2RDF4TlpCLUlCVmVDMzFPTV9MenFRMnZwelBubjFxX3V6eWVpbnRfa2gwRHJCcHZmTm1aaEZWUjB0eGp4WllDTFJ0eEtGSzJhQmRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "ARK Invest opts out of Ethereum spot ETF, explores alternative paths: Report - Crypto Briefing",
        "content": "The next step involves the SEC reviewing and providing feedback on the filings.\n\nShare this article\n\nSpot Ethereum exchange-traded funds (ETFs) have seen several developments this week following listing approval on May 23. The most remarkable is that Cathie Wood’s ARK Invest suspended its spot Ethereum ETF plans. An ARK spokesperson stated in an email that the firm would seek better investor opportunities.\n\n“At this time, ARK will not be moving forward with an Ethereum ETF,” the spokesperson stated. “We will continue evaluating efficient ways to provide our investors with exposure to this innovative technology in a way that unlocks its full benefits.”\n\nThe comments follow 21Shares’s updated S-1 form for its Ethereum product, which no longer names ARK Invest as the ETF’s partner. The proposed ETF has also been changed from “Ark 21Shares Ethereum ETF” to “21Shares Core Ethereum ETF.”\n\nARK Invest cooperated with 21Shares in pursuing a regulatory nod to launch a spot Bitcoin fund. The two asset management firms expanded their partnership, applying to offer spot Ethereum ETF in September last year. At the time, the SEC’s decision on spot Bitcoin ETFs was still on hold.\n\nAfter getting the SEC’s approval in January, their spot Bitcoin ETF, ARK 21Shares Bitcoin ETF (ARKB), debuted trading on the CBOE on January 11. As of May 31, ARKB holds around $3.2 billion in Bitcoin (BTC).\n\nWhile Ark shelves its Ethereum ETF plans for now, the company affirms its continued commitment to its Bitcoin ETF.\n\n“21Shares and ARK remain committed partners on the ARK 21Shares Bitcoin ETF, which launched in January, as well as on our existing lineup of futures products,” 21Shares confirmed in a statement.\n\nSpot Ethereum ETF filings: Weekly roundup\n\nThis week’s highlight is the updated S-1 forms from ETF issuers. At press time, all eight issuers had submitted their required filings to the SEC.\n\nThe S-1 amendment from VanEck was filed on the day of approval. BlackRock followed suit with an updated filing earlier this week. Other issuers also sent their amended filings by Friday, the due date set by the SEC.\n\nHashdex’s proposed Ethereum ETF was withdrawn on May 24, one day after the SEC greenlit the other eight funds, except for Hashdex’s. Hashdex was also the only issuer without an amended 19b-4 filing ahead of the Ethereum ETF decision.\n\nFidelity is the only issuer that discloses its management fee in its updated filing. Its planned fee is 0.19%.\n\nThe next step involves the SEC reviewing and providing feedback on the filings. According to a source with knowledge of the situation, this process could entail at least two additional rounds of revisions to the S-1 documents."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQOWhLQmpCUVAwc0xPcUtwRXdUd0plLWJkVGF3QUNsaTE1LWlhMWRnTWd1dDkwWmQxYnl0eGhsV1hNbm15RG1hSUpxRjFrYzViZkxJVWpPd1RiNmxrbkQxc2RtR0RmUHFlN0hLT0VCSjVWWFJxcFY3OS1fdUFfYTdNLWZnRDBpUG1sWEQwTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "BlackRock advances with Ethereum-based ETF project - Baseline",
        "content": "BlackRock, a leading name in asset management, recently disclosed updated information about their proposed Ethereum-based exchange-traded fund (ETF). This novel investment product has hit major headlines as it holds potential to diversify traditional investment portfolios.\n\nThis progression in the Ethereum ETF project is seen as a response to the rising demand for digital investments. The approval of BlackRock’s Ethereum ETF could trigger other asset management firms to roll out similar products, similar to the trend seen with Bitcoin ETFs.\n\nThe first acquisition related to the project was made by the ‘Seed Capital Investor’ who bought 400,000 shares at $25 each. These shares, now valued at a staggering $10 million, have significantly enhanced the investor’s financial portfolio. Moreover, the Trust’s net asset value has remained sturdy since this acquisition, reflecting a robust financial strategy.\n\nOnce regulatory approval has been secured, the Ethereum ETF assets can be converted into Ether. Investors can leverage Ether’s volatile market without the hassle of owning or managing the underlying cryptocurrency. The Trust plans to use ‘ETHA’ as the trading handle, subject to requisite approvals.\n\nBlackRock progresses with Ethereum-based ETF\n\nExpectations are high for the Ethereum ETF kick-off as recent approvals by the U.S. Securities and Exchange Commission have fuelled optimism in the crypto sector. This move by the SEC is seen as a validation of digital assets, thereby promoting wider participation in the mushrooming cryptocurrency markets. Furthermore, increasing popularity of Ether ETF could potentially trigger notable shifts in crypto market dynamics.\n\nMeanwhile, BlackRock’s Bitcoin ETF has also been massively successful, becoming the largest public Bitcoin fund worldwide. With nearly $20 billion in managed assets, the fund brought in a net inflow of over $16 billion. Given its promising return rates and accessibility for retail investors, the fund continues to attract those believing in the future of digital currencies. Corporate entities have also shown significant interest, underscoring the mainstream acceptance and adoption of cryptocurrencies.\n\nThe growth and potential of the crypto space is irrefutably confirmed by the success and acceptance of the BlackRock Bitcoin ETF. Edited by Parikshit Mishra, Deputy Managing Editor at the Data & Tokens team, this article offers insights into the trends, developments, and potentials in the world of finance, both decentralized and traditional."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQYkkyM2UyQUZleVFVTmdCS0NPbFE3bUxpeDRsWnlGV1ZEaWFJbERKVG9Eak1VOTJGM3FJT19KLVFXYVlzbzVvTnRvdHZYTlhPUEZBYW5OWUxyRDdsTWNKZ2hEaWFLT010eU1iWTlCNHo4MmJqOE9IdXJFRDN3YnRQLVFGR1IyTEwzQklwZTVnZmV0QW9F?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Classic’s third ‘halving’ puts pressure on miners’ profits - DLNews",
        "content": "The Ethereum Classic halving has cut token rewards paid to miners by about 20%.\n\nThe automatic reduction means miners are less profitable than they used to be.\n\nEthereum Classic — a 2016 fork from the main Ethereum blockchain — just completed its third halving, reducing the tokens paid out to miners on the network by around 20%.\n\nThe reduction on the $4.4 billion blockchain occurred at block 20,000,001, or 12:00 am London time on May 31.\n\nMiners now earn 2.048 ETC for every successful block they mine, compared to 2.56 ETC previously.\n\nInvestors often see the reduction in a token’s supply as a positive — the token should increase in value if the supply decreases while demand stays the same.\n\nSuch events can be double-edged swords, as they also impact the profitability of miners.\n\n“Mining revenue will decrease if price remains at the same level,” Red Luo, a content manager at crypto mining pool operator F2pool, told DL News.\n\nEthereum Classic’s ETC token trades at around $29.70, down 5.8% over the past week.\n\nEthereum Classic's ETC token falls ahead of the network's third halving.\n\nMiners usually turn off their machines when they are no longer profitable, hurting the network’s decentralisation.\n\nJoin the community to get our latest stories and updates\n\nF2pool runs the biggest Ethereum Classic mining pool, with over 44% of the network’s known hashrate.\n\nCan miners stay profitable?\n\nSome Ethereum Classic miners subsist on thin margins.\n\nWith a 20% reduction in rewards, small miners, or those in areas with more expensive electricity, may stop mining because it’s no longer profitable.\n\nThe reduction could also hurt large miners running older, less-efficient mining machines.\n\nStill, according to Luo, the impact should be minimal.\n\n“We find that most popular machines can operate profitably even after the reward reduction,” Luo said, adding that the reduced rewards should not significantly impact the network’s hashrate.\n\nThe hashrate is the number of hashes — or guesses — per second of all mining machines trying to solve equations and process blocks on a blockchain network.\n\nA higher hashrate means more computing power is required to process transactions.\n\nThis makes that blockchain more secure because it would take more miners — and cost more in energy and time — to attack the network.\n\nHow Ethereum Classic works\n\nEthereum Classic is a Proof of Work blockchain. It split from the main Ethereum network after the DAO hack in 2016.\n\nLike Bitcoin, Ethereum Classic requires miners running powerful computers to solve complex equations, which, when solved, allow them to add blocks of transactions to the blockchain.\n\nIn return, successful miners receive token rewards.\n\nSolving these equations is difficult. Many miners choose to team up in so-called mining pools and split the rewards if one of them solves an equation.\n\nAlthough Ethereum Classic is programmed to reduce token rewards by 20%, many in the community still refer to it as a “halving,” because it resembles Bitcoin’s halvings.\n\nBitcoin halvings cut the rewards paid to miners in half about every four years.\n\nEthereum Classic halvings occur every five million blocks, or about every two years.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPWS0wa2M5N2tHWmYyUzVjMXZOT2RZVTRMdDJBNG9WeU44elItckJ3T2dUcEc4VHlRaTNUVFgtbWxOZFYwZGVMOHlzcWNPUkRZTEFJN1g1QjA0Q2stVFdycGFtZl96UFRqSEl2WUxpbzZPMkJmTlBzSU9tdU1zQzdwNDg5WTVDN28wakstUjZFQ0FqZE1zZWJSREc4aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum: Charting The Ascendancy Of The Second-Largest Cryptocurrency - FinanceFeeds",
        "content": "With a market capitalization of 468.42 billion USD, Ethereum (ETH) is the second-largest cryptocurrency network, trailing only Bitcoin. Experts suggest Ethereum is poised to maintain its dominance in the crypto world for years to come. What makes Ethereum stand out, and what has fueled its significant growth recently? This article delves into these questions, guided by the insights of experts at Octa, a globally licensed financial broker.\n\nIn the week ending May 26, Ethereum’s price surged nearly 25%, reaching up to 3,900 USD. The 4,000 USD mark, last crossed in March, seems within reach following the US Securities and Exchange Commission’s approval of spot Ethereum exchange-traded funds (ETFs). Long-term prospects for the Ethereum ecosystem look promising, bolstered by growing adoption across various sectors and a strong developer community. Since becoming the second-largest cryptocurrency in 2018, Ethereum has held this position firmly. But what makes it so resilient in the volatile cryptocurrency market?\n\nA New Era of Blockchain Technology\n\nVitalik Buterin, a visionary entrepreneur, and cryptocurrency enthusiast, conceptualized Ethereum. His interest in blockchain technology began in 2011, and by 2013, he proposed Ethereum as a blockchain platform capable of more than just financial transactions. Ethereum was crowdfunded in 2014, raising over 18 million USD in Bitcoin, and the network launched on July 30, 2015. Unlike Bitcoin, which was designed as a decentralized digital currency, Ethereum aimed to expand blockchain technology’s capabilities.\n\nEthereum supports smart contracts, which are self-executing contracts with terms written into code. This feature allowed users to create new cryptocurrencies on Ethereum using the ERC-20 token standard, enabling a wide range of applications. One notable example is Chainlink (LINK), a decentralized Oracle network that allows Ethereum smart contracts to interact with real-world data.\n\nPractical applications of Ethereum include:\n\nDecentralized Finance (DeFi): Ethereum-based applications aim to replicate traditional financial systems using blockchain technology, offering services like lending, borrowing, decentralized exchanges, and stablecoins.\n\nNon-Fungible Tokens (NFTs): Unique digital assets representing ownership of specific items, often used in digital art and gaming.\n\nDecentralized Applications (dApps): Ethereum supports various applications across industries, including gaming, social media, and digital marketplaces.\n\nIdentity and Authentication: Decentralized identity solutions give users control over their personal data.\n\nEthereum’s versatility and the wide range of applications it supports have driven its adoption and growth. The development of DeFi, NFTs, and dApps on the Ethereum blockchain has created a robust ecosystem that attracts developers, investors, and users alike.\n\nEthereum 2.0: A Leap Forward\n\nOn September 15, 2022, Ethereum transitioned to Ethereum 2.0, introducing several significant improvements:\n\nNew Consensus Mechanism: Ethereum 2.0 switched from proof-of-work (PoW) to proof-of-stake (PoS), which is more secure, energy-efficient, and better suited for scaling.\n\nImproved Scalability: Ethereum 2.0 increased scalability by introducing shard chains, allowing the network to handle thousands of transactions per second.\n\nEnhanced Network Efficiency: Shard chains work alongside a central beacon chain to distribute processing loads, improving overall efficiency.\n\nSustainability: The PoS mechanism reduced energy consumption by approximately 99.95%, making Ethereum more eco-friendly.\n\nDespite these advancements, Ethereum 2.0 faces challenges such as accessibility limitations, potential centralization, and untested security aspects. Interested users must own ETH tokens to become validators, requiring significant investment, which may limit accessibility. Additionally, PoS could lead to centralization if larger nodes dominate the validation process.\n\nAccessibility Limitations\n\nBased on the proof-of-stake consensus mechanism, the Ethereum 2.0 blockchain requires users to own the native cryptocurrency before becoming validators. This means that they must purchase ETH tokens using fiat currency or exchange tokens from cryptocurrency exchanges. To become a validator, users need to raise at least 32 ETH, which translates to about 50,000 USD. This high entry cost is unaffordable for most users, potentially limiting the number of validators and reducing the decentralization of the network.\n\nPotential Centralization\n\nThe PoS mechanism relies on delegates chosen to validate transactions, raising concerns about potential centralization. Larger nodes, with more substantial holdings of ETH, could dominate the validation process, controlling the selection of delegates and preventing smaller nodes from participating. This could lead to a concentration of power among a few influential delegates or validators, undermining the decentralized nature of the Ethereum network.\n\nSecurity Concerns\n\nWhile PoS offers many advantages over PoW, it is still relatively new and untested. The low entry cost for becoming a validator could potentially expose the network to personalized attacks against prominent players, decreasing overall security. As the PoS mechanism matures, it will be crucial to identify and address any emerging security challenges to maintain the integrity of the Ethereum network.\n\nContinuous Innovation\n\nEthereum’s commitment to innovation is not limited to the PoS transition. The network is also exploring layer-2 scaling solutions and other upgrades to enhance its performance and user experience. Layer-2 solutions, such as rollups, aim to increase transaction throughput by processing transactions off-chain and then settling them on the main Ethereum chain. These solutions can significantly reduce transaction fees and improve the scalability of the Ethereum network.\n\nLong-Term Outlook\n\nEthereum’s continuous evolution and commitment to innovation make it an attractive platform for developers and investors. As the network grows and new applications emerge, Ethereum’s relevance and influence in the cryptocurrency space are likely to increase. Some experts predict that Ethereum will surpass its current record peak due to the launch of spot ETF products in the US, potentially triggering significant market movements. Investors trading Ethereum CFDs on platforms like Octa may capitalize on these predicted trends.\n\nOcta: A Global Financial Broker\n\nOcta is an international broker offering online trading services worldwide since 2011. With clients in 180 countries and over 42 million trading accounts, Octa provides commission-free access to financial markets and a variety of services to help clients achieve their investment goals. The company offers free educational webinars, articles, and analytical tools, ensuring that clients have the resources they need to make informed investment decisions.\n\nCharitable and Humanitarian Initiatives\n\nOcta is involved in a comprehensive network of charitable and humanitarian initiatives, including the improvement of educational infrastructure and short-notice relief projects supporting local communities. The company is committed to giving back to society and making a positive impact through its various initiatives.\n\nAwards and Recognition\n\nOcta has won over 60 awards since its foundation, including the ‘Best Online Broker Global 2022’ award from World Business Outlook and the ‘Best Global Broker Asia 2022’ award from International Business Magazine. These accolades reflect Octa’s dedication to providing high-quality services and its commitment to excellence in the financial industry.\n\nEthereum’s impressive ascent in the world of cryptocurrencies is a testament to its innovative approach and robust ecosystem. With its versatile blockchain, support for smart contracts, and continuous evolution, Ethereum is well-positioned to maintain its status as a leading cryptocurrency. The transition to Ethereum 2.0 marks a significant milestone, addressing scalability, efficiency, and sustainability challenges while introducing new opportunities for growth and innovation.\n\nAs Ethereum continues to evolve and adapt to the changing landscape of the cryptocurrency market, it remains an attractive platform for developers, investors, and users. The support from financial brokers like Octa, with their comprehensive services and commitment to education and innovation, further strengthens Ethereum’s position in the market.\n\nFor those interested in exploring the potential of Ethereum and other cryptocurrencies, Octa provides the tools and resources needed to navigate this dynamic and rapidly evolving space. With a focus on accessibility, education, and support, Octa empowers clients to make informed investment decisions and capitalize on the opportunities presented by the cryptocurrency market.\n\nEthereum’s journey from its inception to its current status as the second-largest cryptocurrency is a story of innovation, resilience, and continuous growth. As the network transitions to Ethereum 2.0 and explores new frontiers in blockchain technology, it is poised to shape the future of the cryptocurrency market and drive the next wave of digital transformation."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE51SUJiS181QmxQWWV5VWg5NXRWY1l2bE5VWklOVU9fYnJtTWR0Z25wMnItNW04SmxOeGVCQXRxUHV5RWE3MnlNRnI0OHNMRTNaRFMyWkFJb1phTFhYQ3ZYdlVwMUVkNkdvTzZtZm9jenZPOGFK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin (BTC)'s $1.3T Market Cap and Ethereum (ETH)'s Innovations Make Furrever Token a Must-Watch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 31, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is in a dynamic phase, with Bitcoin and Ethereum at the forefront of innovation and growth. Bitcoin's market cap has surged to an impressive $1.3 trillion, reinforcing its status as the digital gold standard. Ethereum, meanwhile, continues to drive blockchain advancements with its robust smart contract capabilities and the upcoming Ethereum 2.0 upgrade aimed at improving scalability and reducing transaction costs. Amidst these giants, Furrever Token (FURR) is carving out its own niche, offering unique appeal and significant growth potential.\n\nBitcoin's $1.3T Market Cap: The Digital Gold Standard\n\nBitcoin, the first and most prominent cryptocurrency, has reached a market cap of $1.3 trillion, nearing the value of silver. This milestone reinforces Bitcoin's position as a digital store of value, often likened to gold. Bitcoin's growth is driven by increasing institutional investment, mainstream adoption, and its finite supply of 21 million coins. Its decentralized nature and robust security through proof-of-work consensus make it a reliable asset. As more companies and financial institutions integrate Bitcoin, its influence on the broader cryptocurrency market grows, driving interest and investment in alternative cryptocurrencies.\n\nEthereum's Innovations: The Backbone of Decentralized Finance\n\nEthereum remains a cornerstone of the crypto ecosystem due to its versatile blockchain, which supports a myriad of decentralized applications (dApps) and smart contracts. The recent statements from Vanguard, a $7 trillion company, highlight Ethereum's potential and limitations. Although Vanguard has no immediate plans to support Ethereum ETFs, the blockchain's ongoing upgrades aim to address scalability issues and enhance transaction efficiency. The upcoming Ethereum 2.0 upgrade, transitioning from Proof of Work (PoW) to Proof of Stake (PoS), is expected to significantly improve transaction speeds and reduce fees. This evolution is crucial as Ethereum powers a substantial portion of the DeFi (Decentralized Finance) space, making it indispensable for developers and investors alike.\n\n\n\n\n\nFurrever Token: A Unique and Promising Contender\n\nAmidst the well-established Bitcoin and Ethereum, Furrever Token (FURR) is emerging as a unique player with its charming and engaging approach. Designed to bring a refreshing dose of cuteness and community engagement to the crypto space, Furrever Token stands out with its whimsical approach. The token integrates adorable cat-themed stickers, emojis, and visuals, fostering a warm and friendly community.\n\nStrategic Tokenomics and Growth Potential\n\nFurrever Token's tokenomics are structured to ensure long-term growth. With 9 billion tokens in total, 65% are allocated for presale, 25% for decentralized exchanges (DEXs), and 10% for the team, which will be locked for a year. This strategic allocation aims to provide liquidity while ensuring the team is committed to the project's longevity.\n\nThe presale has already raised over $1.1 million, and with the current price at $0.000648, there is an expectancy of up to 15X returns for early investors. The upcoming launch on PancakeSwap is generating significant excitement and FOMO (Fear of Missing Out), making Furrever Token an attractive investment opportunity.\n\nWhy Furrever Token is a Must-Watch\n\nUnique Appeal: Furrever Token's whimsical approach with cat-themed visuals and community engagement stands out in the crypto market. Strong Community: A growing and active community on platforms like Telegram ensures continuous engagement and organic growth. Significant Growth Potential: With a presale price of $0.000648 and potential for substantial returns, Furrever Token offers an enticing opportunity for investors. Upcoming Launch: The planned launch on PancakeSwap and future exclusive content create a sense of anticipation and excitement.\n\nConclusion\n\nBitcoin's impressive market cap and Ethereum's ongoing innovations underscore the dynamism of the cryptocurrency market. Amid these developments, Furrever Token presents a unique and promising investment opportunity. Its engaging approach, robust community, and potential for high returns make it a must-watch for investors looking to diversify their portfolios. As Bitcoin continues to dominate and Ethereum drives innovation, Furrever Token offers a delightful and potentially lucrative alternative. Visit furrevertoken.com to learn more and invest today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNZXdjcUZiWUtBZFJIQ1p4b0FfdGZaeFl1Y09lU2V2Z21rS3I0WkxRQlcyTE4zQ09VTGNDa3hPaVNyUS12WWpsTmRIem5ESmpDS0xtUW4yU3VLYjIwYUpSajlNRHFMU3NUQ0JONU1UZDR4Ym8xdlh3S0kyeHJHOVdRNXJtTkFHYkZlemk0RzVWVUFUOURqS25vMnJTXzk5cUxCdlBoVFlQSDZEUEw1bnRjdXJ6VE1nd0gtTE1aNlJjSjlPRzZpLVYxSDBsMWQxYkFSVlJKRVVuNDFtMDVSdmxZWjJ1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum Under Siege: Most Attacked Blockchain In 2024 Suffers 43% Of May's Crypto Losses - Benzinga",
        "content": "Ethereum ETH/USD was the most targeted blockchain by hackers and fraudsters in May, constituting nearly 43% of the total losses.\n\nWhat Happened: The world's largest network for decentralized apps and services suffered the most individual attacks, totaling 9, in the month, according to a report released by Web3 security firm Immunefi.\n\nThe second on the list was BNB Chain BNB/USD with 4 incidents. Together, Ethereum and BNB Chain accounted for a massive 62% of the total losses across major chains.\n\nAmong the most sensational of Ethereum losses was the $21 million exploit on the Web3 game Gala Games GALA/USD.\n\nOverall, total cryptocurrency losses to hacks and rug pulls dropped 20% this year compared with the same period in 2023. Additionally, losses in May declined 28% month-over-month.\n\nWhy It Matters: Ethereum was the most targeted chain last month, and also during the first quarter.\n\nWith a vast array of decentralized finance projects, the network has been vulnerable to attacks from bad actors. It is the largest DeFi chain, with upwards of $64 billion in deposits as of this writing, according to DeFiLlama.\n\nThe Immunefi report specifically underlined that DeFi projects were the main target of exploiters, representing 100% of all the losses.\n\nPrice Action: At the time of writing, ETH was trading at $3,743.49, marginally down 0.38% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next: Ripple CEO Brad Garlinghouse Foresees XRP, Solana, Cardano ETFs Amid Bitcoin, Ethereum Approvals\n\nPhoto by DrawKit Illustrations on Unsplash"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9KVTNvVUl4Tk1MYVR5SHoyQUZHNDdBaE9wVl9JdW1lQjhTbGlsU2VKZDF5T21QeDY0OS1FSTlERTJWb21YUjB4U3VaTzZ0T2F2ejlDdWY4OTdIbGlTaVp2bXZsdklfYWZCUU9YSW9ncTYtT3lQUG5Lc9IBgAFBVV95cUxOZHR3Zkl6R1FMekJfdjRsa0JpWjVqMU9aNkQycGRiMlpHeW8ybEN0b0NCZ0NpaFMtTVhUWUtGWVlRemRfQmJLa3pqU2p0TDNpSzhBbE9qMXpmZEE2RGxtWjhDbWlUSFBtOWxSTWxxR3FPdlVWNThoeDJuQ0NHV0tLaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Franklin Templeton Reveals Ethereum ETF Fee - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFranklin Templeton has become the first asset manager to reveal the management fee on their proposed Ether spot ETF—and it's virtually non-existent.\n\nPer an updated S-1 filing with the Securities and Exchange Commission (SEC) on Friday, the Franklin Ethereum ETF will only charge customers 0.19% per year for holding Ether in their fund, a much lower rate than those assessed by global competitors that have already gone live.\n\n“The sponsor’s fee is accrued daily at an annualized rate equal to 0.19% of the net asset value of the fund and is payable at least quarterly in arrears in U.S. dollars or in-kind or any combination thereof,” wrote Franklin.\n\nThat’s not all: the fund has also promised to waive all sponsor fees on its first $10 billion for the first six months after the fund goes live.\n\nAD\n\nAD\n\nThe ultra-low fee mimics that of Bitcoin spot ETFs that launched in January, where competing funds crunched each others’ numbers in a vicious fee war days before their products went live. Most now offer fees below 0.3%, with many—like Fidelity and VanEck—offering temporary fee waivers.\n\nFranklin also launched a Bitcoin ETF at the time, but mostly lost the battle to competitors on both volume and assets. This time, the asset manager has wasted no time getting its fee rate out the door, driving its costs close to zero.\n\n“For context, most ether spot ETFs in other countries or in other vehicles are >1%,” wrote Bloomberg ETF analyst Eric Balchunas to Twitter on Friday. “The US ETF market is just special in its hardcore-ness but that’s why the vast majority of new investor cash [is] flowing here.”\n\nAD\n\nAD\n\nAs seen with the Bitcoin ETFs, a 1% discrepancy can make all the difference for customers. For example, the Grayscale Bitcoin Trust (GBTC), which chose to keep a relatively high fee of 1.5% in January, has already lost more than half of its Bitcoin in outflows.\n\nDespite boasting over 600,000 BTC at launch, it has now lost its title of the world’s largest Bitcoin ETF to BlackRock’s much cheaper fund. Meanwhile, more expensive Bitcoin ETFs in Canada and Europe have also seen net outflows, despite rising demand for Bitcoin throughout the year.\n\nIn addition to Franklin, the SEC approved 19-b4 applications for seven other Ether spot ETFs last week. Experts say the funds are likely to go live on national securities exchanges within weeks.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcllwRFhMbi1ZSU1xMm9pRnR1ckVCbVFpNm45VFYxd1lraFRDQkhwN1YzV28xbXZBY3hKd0J6RVRtWDd1MTJvMzFXNDQ5MnRiOENXVWVSbzVVeDU2VnlVNDM0ZjY1djRKdjJPd05najVQT3BVVGpPNXZsUHNIUF9LOFVycTJVd1lMRHJfQmJiUUpMYkJVRkdPN9IBngFBVV95cUxPdkZ3UXV2UTQ4amRNTjBZSzhzSHNMZmpvX0Jtcmd2VjZoWXJHY3JvdVNzZ2xjcTVrNmQ5ZkxZclZLNGhuOFVrRFE3ZEpZblNWdHlrOTVUblMwNjRJNjNYeXgzcWJtWjkzVVNjMXphaXFWOUxjZmd2cXJOanNyckZ4YnJJNk1XUkFsaVNnNWllV1FWd1hwOXdOMXVyYk9Cdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin Price Slips While Ethereum Jumps, Here’s Why Analyst Remains Bullish On ETH - CoinGape",
        "content": "Bitcoin’s price has slipped today, while Ethereum continues to maintain positive momentum. This divergence in performance between the two leading cryptocurrencies has sparked intense market discussions.\n\nMeanwhile, amid this, a recent report from QCP Capital has provided insights into this trend, highlighting key factors influencing the current dynamics and why analysts remain bullish on Ethereum.\n\nadvertisement\n\nBitcoin Price Struggles While Ethereum Soars\n\nThe recent decline in Bitcoin can be attributed to multiple bearish factors. According to QCP Capital, potential supply pressures from the upcoming Mt. Gox distribution, valued at approximately $9.6 billion, and the recent DMM hack, which saw $305 million stolen, have weighed heavily on Bitcoin’s price.\n\nNotably, these events have created a bearish outlook, contributing to the cryptocurrency’s current struggles. However, despite the sluggish performance of Bitcoin, Ethereum’s price has surged today.\n\nMeanwhile, Ethereum has managed to sustain its positive momentum, driven by bullish catalysts. The approval of Spot Ethereum ETFs has significantly boosted investor confidence.\n\nBesides, QCP Capital’s report notes, “Vols have been absolutely crushed after ETH spot ETF approval this week despite prevailing catalysts.” The anticipation of these ETFs trading earlier than expected has injected fresh optimism into the market.\n\nThe SEC’s recent move to urge applicants to submit S-1 forms by May 31 suggests that Ethereum spot ETFs could start trading as early as June, according to the report. This accelerated timeline has further fueled bullish sentiment for Ethereum.\n\nNotably, the contrasting reactions to these developments have highlighted the different trajectories of Bitcoin and Ethereum in the current market.\n\nAlso Read: Binance founder CZ Begins Four-Month Sentence in Lompoc, California\n\nBullish Outlook on Ethereum\n\nAnalysts at QCP Capital are particularly optimistic about Ethereum’s future performance. They believe that the market may be underestimating the potential impact of the upcoming Ethereum spot ETFs. In its report, QCP Capital stated:\n\nA sleepy market may get caught offside, and our bet is on the bullish side, particularly for ETH.\n\nNotably, this suggests that the approval and launch of these ETFs could trigger significant price movements, catching many investors by surprise. The overall sentiment around Ethereum remains positive, with many expecting the cryptocurrency to continue its upward trend.\n\nMeanwhile, the factors contributing to this optimism include the regulatory green light for ETFs and the broader adoption of Ethereum in various applications, from decentralized finance (DeFi) to non-fungible tokens (NFTs).\n\nWhile Bitcoin faces headwinds, Ethereum’s favorable conditions and strong market interest position it well for future gains. The differing performances of these two major cryptocurrencies underscore the importance of understanding the unique factors driving each one’s market dynamics.\n\nAs of writing, Bitcoin price dipped 1.17% and exchanged hands at $67,561.26, while touching a low of $66,633.42 in the last 24 hours. On the other hand, Ethereum price soared 1.56% to $3,781.67, while its trading volume rose 8% to $14.95 billion.\n\nAlso Read: Cathie Woods’ Ark Invest Withdraws Spot Ethereum ETF Application\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPVklrR19GZUltXzJmbFkyLXdFdi1lWHVJTThPbGRobS1MUWZfT1hzQ0IzNWVFMHpZelJsc1NsUEZaRFZIaVRfanNpQnpEWjJBMHQyLWR3WHJjdC15Vk1fT1A1N2RKcHc3MlZSc3JEcW54Q3dBaGdiU0ZNbldUVTJUQVlvVmFfeDRHb2s1YXRXb0lMdlBaZ1duTFpqSHFOSFU4WTlFY0tTVHJ0R2t4c1lRbEtIUi1lMGJWOUNCTnZvWldJeldK0gHSAUFVX3lxTE5BQmJYSURyREJrZloyRXp0Q1Z2TGI4bjRJU1d6S2pqX0dfdE9vQ3lLSzFYN1pKbVhsQWc2QVZiaFk3OW93UWRycFBvX0FVMDRCWmVHN2RtV215SkhOd3l6NjRkWnQ2aE9qZlFRNHZNX0ZmeHAySmxleFE1ZXJ5aFFvV0VlakpPRzJkdkludUkzbGo0cXVleHBxUll3UTJubU5uTW0xc3pmMEZDOTJoZTFBeV9DU184bEduZ0JlclBrcjcwdFR6UlpZd3A3X1k4UFZKQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Will ETH Touch US$5000 in June 2024? - Analytics Insight",
        "content": "Crypto News - Ethereum Price Prediction: Powering countless projects in decentralized finance and the booming NFTs scene, the asset understandably draws the attention of traders and holds the spotlight firmly in the minds of crypto enthusiasts everywhere. Ethereum is a ground-breaking blockchain technology that is most renowned for its smart contract functionality but it has also led the charge in crypto-tech advances from day one. Speculation surrounding Ethereum (ETH) reaching US$5000 by June comes as we near mid-2024. In this article, we will give a detailed perspective on Ethereum price prediction: whether Ethereum can reach this milestone, taking into account market trends, technological breakthroughs, macroeconomic conditions and predictions of analysts."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQUmVaaEFwS1FIb1I5UjhrU0cxLVI4NzNlQ3RlSTdhSXRlNGx2WjUtdGhHQkY5LUZuZmczWEF0ZFMwMDF1VG5tNmdaVzF6QUVhMDBEQVFSU014UGlfQzZqbzZmeUhzUEZGTFhJWFZQRjVURFZIVDA1SEZNNVdtTWVsbtIBjgFBVV95cUxNUUt5U05GWmtPVUxMYUMxaFBvc0JjT09McEZZaEI0SWZuVms1NU9aeFQ1MWF1Wi10aTQySndubHRtaHZhMlVPZ2ItcmJKNDBKNzFaVzZrTVlabllkT0hZa0JMSVhkSGpycWU5Qm9CX1V6WEJXSjhJcDdZU1FaWjFmcUdJcjdIc0FQVk96RDB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: A Detailed Coverage - Analytics Insight",
        "content": "In all, Ethereum appeared from the start as being bent on doing more than merely enabling the direct exchange of value. It has been attempting to create a global computing network that will extend the applications of blockchain and cryptocurrency.\n\nLast week, it was seen that the SEC green-lightened several issuers' Form 19b-4 filings for spot Ethereum ETFs, which signifies significant progression for such outcomes to list on U.S. exchanges. Like the BTC futures and options spot Bitcoin ETFs that were listed in January, these new products may help bring access to the crypto asset class to a broader investor base. Even though this involves the usage of blockchain technology, Ethereum is a different network with different applications (Plate While Bitcoin at the moment is mostly an object to hold as a new form of money, an embodiment of digital gold, Ethereum is a distributed computing system that hosts a multitude of applications and is often referred to as a decentralized application store. New investors who are keen on this asset might wish to understand that Ethereum works on different fundamentals than many cryptocurrencies and also wish to uncover its competitive stance and the part it plays in the advancement of blockchain-based digital selling."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQZW1YWHFFMmFmcnlVYVNvMTZvWjJ4X1Z2LUh1WDFZTFZIcEJObHg3S2hnbkJieWNUQ092WjhKa1JWSzl0UTVFLVJDdVMyanhYOUVWLWhzVkdCN1lLdTctck9VOGIybHdLcl9YbjBGbHNmbWt3d1VHUFBlcnN5Xy1aejV30gGHAUFVX3lxTE53UnhIaXRFTFNCV3lvWEp4bWltMkotNjhYRHdwdUxMd0RUT19TMnlLaC1jRXJ5S1FJN282M2FpMnRndkNnYnVmVnB3ZlE1dlpQdzkyMS05UTdUTmRYRmlSUjgtTHJrR0RoQTFBeHU5dmRIUFVhdVlnODRTWDg4WmpJRHR2QzJuOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum whales dive into ETH at $3.7K – Will the market follow? - AMBCrypto News",
        "content": "Ethereum’s exchange reserve declined sharply on the 30th of May.\n\nMetrics suggested that ETH was in an overbought position.\n\nEthereum [ETH] enthusiasts got excited last week as the king of altcoins’ price once again exceeded $3.9k. However, ETH couldn’t hold its momentum and soon fell from that level. In the meantime, whales took the opportunity to stockpile more ETH.\n\nInterest in Ethereum is growing\n\nETH had a rollercoaster ride last week as it managed to go above $3.9k on the 27th of May. But bears arrived soon as its value dropped.\n\nIt was interesting to note that the ETH ETF approval couldn’t propel substantial growth for the coin over the last week.\n\nAccording to CoinMarketCap, ETH was down by over 1% in the last seven days. At the time of writing, the token was trading at $3,759.66 with a market capitalization of over $451 billion.\n\nWhile the token’s price volatility remained high, whales made their move.\n\nAli, a popular crypto analyst, recently posted a tweet highlighting that there’s been a notable increase in Ethereum addresses holding more than 10,000 ETH.\n\nThis increase in the number of addresses suggested that whales were moving from a distribution phase to an accumulation phase.\n\nAMBCrypto’s look at Glassnode’s data pointed out yet another metric that suggested a rise in accumulation. Ethereum’s balance on exchanges witnessed a major decline on the 30th of May, indicating high buying pressure.\n\nThe flip side of the story\n\nThough the aforementioned data suggested that investors were buying ETH, AMBCrypto’s look at CryptoQuant’s data revealed a different story.\n\nAs per our analysis, Ethereum’s net deposit on exchanges was high compared to the last seven-day average, hinting at a rise in selling pressure.\n\nOn top of that, ETH’s Coinbase Premium was red. This clearly meant that selling sentiment was dominant among US investors.\n\nA possible reason behind this could be ETH being overbought. Both ETH’s Relative Strength Index (RSI) and stochastic were in overbought positions.\n\nAMBCrypto then analyzed Ethereum’s daily chart to see how this change in buying and selling pressure might impact its price in the coming days.\n\nThe technical indicator MACD displayed the possibility of a bearish crossover. The Money Flow Index (MFI) registered a slight downtick.\n\nAs per Bollinger Bands, ETH’s price was in a highly volatile zone and was still resting well above its 20-day Simple Moving Average (SMA).\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nTherefore, if the price decline continues, then ETH might first plummet to its 20-day SMA before rebounding.\n\nNonetheless, the Chaikin Money Flow (CMF) looked bullish as it went northward. This might allow ETH to break above its resistance at $3.789k sooner than expected.\n\n\n\n\n\n"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOblNiNERrQ1dNREpnTWRFQ3FZMUNrNjIxWV84cGpzSDJ4LXByVnhielhOU3lSMUNGeUZJVE9WaHp0bmcyLWFsTWtkeFlLWTJBd3RZMVBKYjY5SUt4NTRRSWhIa3ItaGdwOTEwT01hbFF3ZTVMVDlPZV9Wdkc1Nks3b3Nfa3d1Z9IBiwFBVV95cUxNNnhucGZ6dWlCVFpZRVM3allyV194NWdjakRDdzJOSHdKZXo3OUJVdW9DRUozRzEyVE1icjE4V0hiTEtDNmZzdHBpVktJaVN5dGFYQmlJai1HN3FVV25lNkRSeE9TU1V0dmd2QUZROXh5cGpHMWdBNmhGV1Z1ampvYXA1LS02cW5HUkkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s bullish surge cools off – How much longer for $4k? - AMBCrypto News",
        "content": "Ethereum shows signs of consolidation amid ETF hype, indicating no strong market direction.\n\nOverall sentiment and technical indicators suggest that the consolidation phase has already begun.\n\nComing off the high of spot ETF hype, Ethereum’s [ETH] rally seems to be slowing down by the minute. What was an increase of 17% last week has turned to less than 1% this week. Is the world’s second-largest cryptocurrency at risk of consolidating?\n\nLet’s take a look.\n\nThe Ethereum derivatives data presents a mixed sentiment, potentially indicating a slowdown in Ethereum’s rally. The increased trading volume by 10.32% and open interest by 1.19% shows that traders are still quite active with ETH.\n\nLooking at the long/short ratios, we see a predominance of long positions over shorts, indicating that despite the slowdown, many traders are still betting on Ethereum’s bull run as ETFs get ready to start trading next week.\n\nEther’s current liquidation pattern could signal that despite the predominant bullish sentiment, ETH is facing increased market caution. This typically precedes a short-term consolidation, as was seen from Bitcoin after breaking all-time highs earlier this year.\n\nThe ETH/USDt chart shows an incoming consolidation even more. After peaking around $3,980, Ethereum faced resistance and has since formed a consolidation pattern, generally fluctuating between $3,770 and $3,900.\n\nThe Relative Strength Index (RSI) currently reads at 51.43, indicating a neutral momentum that aligns with the ongoing price consolidation.\n\nThis suggests neither overbought nor oversold conditions, providing no strong bias towards either bullish or bearish momentum in the near term.\n\nFrom a technical analysis perspective, the key support level to watch is around $3,770, marked by several touches over the past few days, which have prevented further declines.\n\nOn the upside, resistance is set near $4,000, where Ethereum has struggled to sustain upward movements.\n\nMeanwhile, a notable peak in social dominance suggests a recent surge in discussions or interest around Ethereum, which is clearly driven by the ETF hype.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe moving averages, however, show a downward trend in the long term, predicting an overall decreased interest level in Ethereum.\n\nAll in all, Ethereum is not at risk of consolidation. It is already consolidating."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPYWZ5NndMWjBtQzR1aFpPVVdpcnBpOTNJTG9pZjV6RHB6d0pKRHlaS0lfaHV1MTNWZm84QUJWbWJNVTh6NmdxY1B0Si1nNDh6c1lMYXZLZngyd2hMZzBZWENqOENCQWo1ajFFUm9TbVlQUlZmNWx4dkw1b1pLbThIdjl2WkZlM21JWElxU1M4bWNSVERiNW9IMzRtMUpCaldqTFJ1cQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum or Solana? We asked ChatGPT-4o which web3 crypto is a better buy for 2024 - Finbold - Finance in Bold",
        "content": "As the summer of 2024 approaches, investors are closely examining potential opportunities within the cryptocurrency market, particularly focusing on the prominent Web3 cryptocurrencies Ethereum (ETH) and Solana (SOL).\n\nEthereum has recently gained traction with the approval of ETFs, boosting its market presence, while Solana boasts a Total Value Locked (TVL) of $4.795 billion, highlighting its growing ecosystem.\n\nThese digital assets have captured substantial attention due to their robust ecosystems, impressive year-to-date performance, and ongoing development activities. However, the prevailing market conditions have left investors deliberating which of these two cryptocurrencies will yield better returns.\n\nTo address this question, Finbold asked ChatGPT-4o which Web3 crypto, Ethereum or Solana, is poised to be the best performer in summer 2024. We used the following prompt with ChatGPT-4 to get the recommendation:\n\n“Which cryptocurrency, Ethereum (ETH) or Solana (SOL), is better for investment in the summer of 2024, considering each coin’s key attributes such as year-to-date performance, volatility, development activity, community support, market trends, potential for growth, and overall stability? Provide a detailed analysis, comparing both cryptocurrencies based on these attributes to determine the objectively best option for potential short-term gains and long-term value. Justify your answer with relevant data and insights”\n\nChatGPT-4o: Ethereum (ETH) emerges as the better investment option for the summer of 2024\n\nChatGPT-4 identified Ethereum as the superior investment option for summer 2024 primarily due to its more stable market presence, significant development activity, and recent ETF approval, which are likely to drive further institutional interest and long-term growth.\n\nWhile Solana (SOL) shows impressive potential, its higher volatility and shorter track record make it a riskier investment compared to Ethereum.\n\nKey attributes of ETH for summer investment. Source: ChatGPT-4o / Finbold\n\nObjective recommendation for summer investment. Source: ChatGPT-4o / Finbold\n\nEthereum price analysis\n\nETH 7-day price chart. Source: Finbold\n\nBased on a detailed analysis, Ethereum emerges as the superior investment option for both short-term gains and long-term value in summer 2024.\n\nCurrently trading at $3,760.20 with a year-to-date gain of 65%, Ethereum’s recent ETF approval and robust ecosystem position it favorably against Solana, which is trading at $165.60 with a year-to-date gain of 62%.\n\nFor short-term investors, Ethereum’s potential bullish trend makes it a safer choice. For long-term investors, Ethereum’s stability, extensive development activity, and strong community support offer significant growth potential.\n\nHowever, diversifying with a smaller portion in Solana can provide additional exposure to its high growth potential, balancing risk and reward.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]