[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5ibGpuak5VQnZPSU85UFpOTUMyUmxlSjlfUE1uNzVyM0VkUEZlRHFMdER2a21rWHpTZWFiY0tEc1dMY1hiaTF0Y2poYWNyNEFsOEotVEFyTG1wQTBoM05uZnFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "What Is Base By Coinbase? Learn About This L2 Network And How To Get Started - Bankrate.com",
        "content": "At Bankrate we strive to help you make smarter financial decisions. While we adhere to strict editorial integrity , this post may contain references to products from our partners. Here's an explanation for how we make money .\n\nThe investment information provided in this table is for informational and general educational purposes only and should not be construed as investment or financial advice. Bankrate does not offer advisory or brokerage services, nor does it provide individualized recommendations or personalized investment advice. Investment decisions should be based on an evaluation of your own personal financial situation, needs, risk tolerance and investment objectives. Investing involves risk including the potential loss of principal.\n\nOur investing reporters and editors focus on the points consumers care about most — how to get started, the best brokers, types of investment accounts, how to choose investments and more — so you can feel confident when investing your money.\n\nBankrate follows a strict editorial policy , so you can trust that we’re putting your interests first. All of our content is authored by highly qualified professionals and edited by subject matter experts , who ensure everything we publish is objective, accurate and trustworthy.\n\nFounded in 1976, Bankrate has a long track record of helping people make smart financial choices. We’ve maintained this reputation for over four decades by demystifying the financial decision-making process and giving people confidence in which actions to take next.\n\nBankrate’s editorial team writes on behalf of YOU – the reader. Our goal is to give you the best advice to help you make smart personal finance decisions. We follow strict guidelines to ensure that our editorial content is not influenced by advertisers. Our editorial team receives no direct compensation from advertisers, and our content is thoroughly fact-checked to ensure accuracy. So, whether you’re reading an article or a review, you can trust that you’re getting credible and dependable information.\n\nWe value your trust. Our mission is to provide readers with accurate and unbiased information, and we have editorial standards in place to ensure that happens. Our editors and reporters thoroughly fact-check editorial content to ensure the information you’re reading is accurate. We maintain a firewall between our advertisers and our editorial team. Our editorial team does not receive direct compensation from our advertisers.\n\nBankrate follows a strict editorial policy , so you can trust that we’re putting your interests first. Our award-winning editors and reporters create honest and accurate content to help you make the right financial decisions.\n\nBankrate.com is an independent, advertising-supported publisher and comparison service. We are compensated in exchange for placement of sponsored products and services, or by you clicking on certain links posted on our site. Therefore, this compensation may impact how, where and in what order products appear within listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. Other factors, such as our own proprietary website rules and whether a product is offered in your area or at your self-selected credit score range, can also impact how and where products appear on this site. While we strive to provide a wide range of offers, Bankrate does not include information about every financial or credit product or service.\n\nWe’re transparent about how we are able to bring quality content, competitive rates, and useful tools to you by explaining how we make money.\n\nBankrate follows a strict editorial policy , so you can trust that our content is honest and accurate. Our award-winning editors and reporters create honest and accurate content to help you make the right financial decisions. The content created by our editorial staff is objective, factual, and not influenced by our advertisers.\n\nYou have money questions. Bankrate has answers. Our experts have been helping you master your money for over four decades. We continually strive to provide consumers with the expert advice and tools needed to succeed throughout life’s financial journey.\n\nDisclaimer: Our writers and editors used an in-house natural language generation platform to assist with portions of this article, allowing them to focus on adding information that is uniquely helpful. The article was reviewed, fact-checked and edited by our editorial staff prior to publication.\n\nAs the use of blockchain technology and cryptocurrencies continues to grow, so does the need for faster, more secure and cost-effective technologies. This is where Base by Coinbase comes in. Base is a new Ethereum-based crypto platform that increases transaction speed and security and supports a variety of applications.\n\nHere’s what Base is, how it works, its benefits and potential drawbacks and its use cases.\n\nWhat is Base by Coinbase?\n\nBase by Coinbase is a crypto platform that uses the Ethereum network to increase transaction speed, security and accessibility while reducing costs. Unlike other cryptocurrency platforms, Base is specifically designed using blockchain to support decentralized applications (dApps).\n\nBase uses what’s known as Ethereum’s Layer 2 blockchain. The Layer 2 blockchain is designed to perform transaction-heavy work with speed, keeping costs lower for the main Ethereum blockchain (Layer 1). Base uses OP Stack, an open-source development platform, to create greater compatibility and ease of transition for developers familiar with Ethereum.\n\nBecause of this approach, Base can offer low transaction fees, faster transaction times and full compatibility with Ethereum processes. Base is linked with Coinbase, making it accessible for broader adoption in the blockchain ecosystem.\n\nHow does Base work and what is it used for?\n\nBuilt as an Ethereum Layer 2 (L2) blockchain network, Base is designed to increase performance, interoperability and scalability while decreasing transaction costs and settlement time.\n\nBase processes transactions off-chain through a mechanism known as “rollups,” bundling multiple transactions together and submitting them as a single batch to Ethereum’s Layer 1 for validation. This approach reduces costs and load on the main Ethereum network.\n\nThe primary use cases for Base include the following:\n\nDecentralized finance (DeFi) platforms\n\nNon-fungible token (NFT) marketplaces\n\nGaming and virtual worlds\n\nSocial media platforms\n\nSupply chain and logistics applications\n\nBase’s compatibility with Ethereum-based tools and frameworks, along with lower fees and faster transaction times, make it a useful platform for developers and individuals.\n\nThe benefits of Base by Coinbase\n\nBase by Coinbase offers some key advantages for individuals and businesses:\n\nFaster transactions: Base processes transactions quicker than the main Ethereum network, making it more efficient and user-friendly, especially during peak network activity.\n\nBase processes transactions quicker than the main Ethereum network, making it more efficient and user-friendly, especially during peak network activity. Lower fees: One of the biggest draws of Base is its significantly lower transaction fees compared to the main Ethereum network, making it a better option for frequent users.\n\nOne of the biggest draws of Base is its significantly lower transaction fees compared to the main Ethereum network, making it a better option for frequent users. Interoperability: Base supports a wide variety of blockchain applications and services, including decentralized exchanges, DeFi platforms and NFTs.\n\nBase supports a wide variety of blockchain applications and services, including decentralized exchanges, DeFi platforms and NFTs. Developer-friendly: Developers can run their existing Ethereum-based applications on Base without having to overhaul their code.\n\nDevelopers can run their existing Ethereum-based applications on Base without having to overhaul their code. Scalability: Base offers increased scalability, so it can handle a higher volume of transactions efficiently.\n\nBase offers increased scalability, so it can handle a higher volume of transactions efficiently. Accessibility: Base is linked with Coinbase, one of the most popular cryptocurrency exchanges, so it’s easily accessible to a broad audience in the blockchain ecosystem.\n\nThe potential drawbacks of Base\n\nWhile Base by Coinbase is a powerful tool, it’s equally important to consider its potential limitations and challenges:\n\nComplexity: Layer 2 solutions such as Base can introduce complexity that may be daunting for newcomers to blockchain technology. This complexity could slow user adoption and create hurdles in understanding its functionality.\n\nLayer 2 solutions such as Base can introduce complexity that may be daunting for newcomers to blockchain technology. This complexity could slow user adoption and create hurdles in understanding its functionality. Security concerns: While Base tries to maintain the security standards of the Ethereum Layer 1 blockchain, its new protocols could allow vulnerabilities and create security risks.\n\nWhile Base tries to maintain the security standards of the Ethereum Layer 1 blockchain, its new protocols could allow vulnerabilities and create security risks. Centralization: Base’s dependence on Coinbase, which holds significant control over transactions, challenges the decentralization ethos of blockchain technology. This concentration of authority within one entity may raise concerns for users, though Coinbase says it intends to decentralize the platform over time.\n\nBase’s dependence on Coinbase, which holds significant control over transactions, challenges the decentralization ethos of blockchain technology. This concentration of authority within one entity may raise concerns for users, though Coinbase says it intends to decentralize the platform over time. No native crypto coin: Unlike some competitors, Base doesn’t have a native crypto token. This lack might put Base at a disadvantage as it can’t incentivize developer activity through token grants, a common practice in the blockchain ecosystem.\n\nUnlike some competitors, Base doesn’t have a native crypto token. This lack might put Base at a disadvantage as it can’t incentivize developer activity through token grants, a common practice in the blockchain ecosystem. Scalability concerns: Despite its robust infrastructure, Base has had transaction failures and increased gas fees during periods of high use. So it may need further scalability to manage significant user growth in the future.\n\nDespite its robust infrastructure, Base has had transaction failures and increased gas fees during periods of high use. So it may need further scalability to manage significant user growth in the future. User experience: The transition from traditional Ethereum transactions to Base might not be seamless for all users, leading to potential difficulties.\n\nCan you buy Base from Coinbase?\n\nCoinbase says it does not currently plan to issue a new network token for Base. Instead, Base will use Ethereum as its native gas token. So at least for now there is no Base crypto coin to buy.\n\nCoinbase warns that users should be aware that scammers may try to send fake Base tokens and suggests that you don’t interact with anyone peddling fake Base coins.\n\nBottom line\n\nBase by Coinbase is a Layer 2 solution for the Ethereum network, offering faster transaction times, lower fees and increased compatibility with the Ethereum ecosystem. Despite some key advantages, users should pay attention to potential drawbacks such as security and complexity."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxONHQ0NDd3M1FIY1FfaFpPbGNPNXBFbUN6TjlkdDFmN0dLd3VsV3NSWENTUzJ3VjJkR2VHazZMSmtsbjZjQTJ1MWNfc0hGNDNDNjgxbUZ0WXAwc1V5am9DMXF3OUV3U0J5NkhEbldEZTIzV01mVWliZXlKNU9PeWZ5WWJCdTU5V3dfLUh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval signals growing mainstream acceptance of crypto - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission's (SEC) upcoming full approval of a spot ethereum exchange-traded fund (ETF) will be a significant milestone in the evolving landscape of cryptocurrencies. This development not only impacts ethereum but also broadens the horizon for the entire crypto industry. Roundtable anchor Rob Nelson and David Uhryniak, Director of Ecosystem Development at TRON DAO, weigh in on the implications of this event.\n\nAccording to Nelson, the approval is not just a win for ethereum but a sign of increasing mainstream acceptance of digital assets. He emphasized that while bitcoin might experience a temporary setback, the overall trend is positive for the entire crypto space.\n\nTRON DAO's David Uhryniak noted that the approval represents a crucial step towards wider adoption of cryptocurrencies. He believes that as more people become comfortable discussing and investing in digital currencies like ethereum and bitcoin, they will begin to see the practical applications of these technologies in their everyday lives.\n\nThis growing familiarity with cryptocurrencies could lead to greater integration of blockchain technology in various sectors, he said. Uhryniak envisions a future where owning a piece of ethereum or bitcoin prompts individuals to explore how these assets are used, ultimately fostering a deeper understanding and broader application in workplaces and beyond."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBwTGdJRUgxUWl4UzBZajVuWi1qcm5fX3F6MXNvQm9hT011OGR4VTBkVUpoeEtBVGc1QzdqSkFyLWpMUlhTV25RSE5UR0swRTRTUVlfSDlXTWgzNHQzRExSVFdFcXJRNGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs could debut week of July 15, says ETF expert - Crypto Briefing",
        "content": "The SEC sets July 8 as the deadline for Ethereum ETF S-1 amendments.\n\nKey Takeaways Spot Ethereum ETFs are expected to launch the week of July 15, pending final S-1 approvals.\n\nThe SEC's amendment due date potentially influences the launch timeline.\n\nShare this article\n\nSpot Ethereum exchange-traded funds (ETFs) are expected to launch the week of July 15 as ETF issuers are making headway with the security regulator, according to Nate Geraci, president of The ETF Store.\n\n“Potential final S-1s by July 12th…would theoretically mean launch week of July 15th,” Geraci explained.\n\nBloomberg ETF analyst Eric Balchunas said the US Securities and Exchange Commission (SEC) has set July 8 as the deadline for ETF issuers to amend their S-1 forms. The regulator may request additional amendments.\n\nGeraci’s expectations are in line with Balchunas’ estimated timeline. Balchunas suggests that trading of spot Ethereum funds could commence shortly after July 8.\n\nMeanwhile, Steve Kurz, head of asset management at Galaxy Digital, indicated potential SEC approval of a spot Ethereum ETF before the end of July. In a recent interview with Bloomberg, Kurz said he expected approvals in “weeks, not days” and “within July.”\n\nGalaxy Digital, in collaboration with Invesco, submitted an application for a spot Ethereum ETF in October last year. Their 19-b4 form was approved by the SEC on May 23.\n\nKurz said Galaxy has been working with the SEC on the firm’s applications for the past few months. He noted that Galaxy’s forthcoming Ethereum ETF mirrors the structure of its existing spot Bitcoin."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQTXU1eGhqZ1p0Yjk2b0xpdk1DVmVyZ3RmTHVJSFF2eWpmMFgzZmxKZVAyak9teS1IS3gxdElHdVRfQkpjdlQtY2ZIX1Z3MkJqRkgxTWdqQURxaTJtRlRBZXhVcFBHTERoaU1YU2xpaHd6MzlTYW9vUElxUmZTRHhrUkV5cnV4RmpOZXhxb2tIOElYWnNvWkF5d3Z2cXQwV2tfclJCWFJTUUhQSUlfY0pqTi1saXhGT2NY0gG-AUFVX3lxTE1fVlZZZlNVSWpPSHFsVDI3SmIwT2hUTVE1VkVQUWctbnhINnI1eHkwWlM5NzhGdXliQmsyQnhLLTVYWUFuNW1WaG9vRG9GQkNVbTkwYXRLZmVNcTVVSkJYSHJjWUpCdllxdFU3RjlFOHdGRndpaUMtY2k5YXRhdklZYWdzYzEtNFNKWlNVYTlDVGZVakRTRU1mZEV0eGtGOWl2cWxEdUI0UzZwbXNrekpwRnNvUWVvYjUwM3VqaUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum mailing list breach exposes 35,000 to crypto draining attack - BleepingComputer",
        "content": "A threat actor compromised Ethereum's mailing list provider and sent to over 35,000 addresses a phishing email with a link to a malicious site running a crypto drainer.\n\nEthereum disclosed the incident in a blog post this week and said that it had no material impact on users.\n\nAttack details\n\nThe attack occurred on the night of June 23 when an email was sent from the address ‘updates@blog.ethereum.org' to 35,794 addresses.\n\nEthereum says that the threat actor used a combination of their own email address list and an additional 3,759 exported from the platform's blog mailing list. However, only 81 of the exported addresses were previously unknown to the attacker.\n\nThe message lured recipients to the malicious website with an announcement of a collaboration with Lido DAO and invited them to take advantage of a 6.8% annual percentage yield (APY) on staked Ethereum.\n\nMalicious email sent to Ethereum holders\n\nSource: Etheretum\n\nClicking on the embedded 'Begin staking' button to get the promised investment returns took people to a fake but professionally crafted website made to appear as part of the promotion.\n\nIf users connected their wallets on that site and signed the requested transaction, a crypto drainer would empty their wallets, sending all amounts to the attacker.\n\nCryptocurrency drainer site\n\nSource: Ethereum\n\nEthereum's response\n\nEthereum says that its internal security team launched an investigation as soon as possible to identify the attacker, understand the attack's purpose, determine the timeline, and identify the affected parties.\n\nThe attacker was quickly blocked from sending more emails and Ethereum took to Twitter to notify the community about the malicious emails, warning everyone not to click the link.\n\nEthereum also submitted the malicious link to various blocklists, which led to it being blocked by most Web3 wallet providers and Cloudflare.\n\nOn-chain transaction analysis showed that none of the email recipients fell for the trap during the campaign.\n\nEthereum concludes by saying it has taken additional measures and is migrating some email services to other providers to prevent such an incident from happening again."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQM1BpMm43dTJucC1zM282U2VqeEpoTzg3NTU0WUZ6MFJ5VXFTbExBdGdNS3UtV2RGdldfc1ZBb3pQbzN0SV9wZG94VmFuWlRNX21SVXhhOVRHaDQ2RWRjM080VnRQTUpCSlVFRTFXcEVuUV93bG5wTGhrWHRZelhDQnRzVldUX3hXZS13SWxlRXRWZms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outshine Ethereum by 800% in 2024 - Crypto Times",
        "content": "Solana-based meme coins have significantly outperformed their Ethereum-based counterparts in 2024, yielding an average return of 8,469% as compared to Ethereum’s 962%, per the “CMC 2024 H1” report.\n\nSolana-based meme coins Vs. Ethereum-based meme coins, Source: CoinMarketCap\n\nAs per the report, the explosive rallies of WIF and BONK on Solana have drawn significant attention and capital from other blockchains, creating a cycle of increased meme coin performance and investment. While meme coins exist across various blockchains, Solana and Ethereum lead in activity and trading volume.\n\nEthereum meme coins are more well-known because they were primarily introduced in 2023 or earlier. In contrast, most Solana meme currencies came onto the scene in late 2023 or early 2024, capitalizing on the surge in attention at the time.\n\nPolitical meme tokens have become a prominent subgenre inside the $57.7 billion meme currency market with a market valuation of $784 million. The MAGA (TRUMP) meme coin has increased in value by more than 5,100% this year due in large part to Trump’s open endorsement of cryptocurrencies and his acceptance of cryptocurrency contributions for his campaign.\n\nThe exceptional performance of Solana-based meme coins underscores a growing shift in speculative investments within the crypto space. This trend is not only reshaping the dynamics between different blockchain ecosystems but also highlights the increasing integration of political narratives within the meme coin market.\n\nAs crypto becomes a significant topic for the upcoming November US elections, political meme coins are expected to continue attracting speculative interest, further driving their market activity and value."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcDl3VXRpanE4ZW1hVUwyMnRGMU5KVlI1OXJlcGJOWXV3d295TkFHUXR6UlNsZDh1M2hsYVhFRWZLcEtjRi1PYTBGNzVKclhOWWRVUHZIN2JMYmFQY3RXb3VFejF1WTVxSHVBWk9mbk9HQXkwNDVuenowUGJYZ1Z1SVNwRVNiVDhpVUtWaUJOUFdZRmZTQWdNVGdsdXktNTl0UGhKY1U1dDFqcmxzRFA4cjQ1dkw5Sk1zU2VXSy02ZDYxVnVB0gHKAUFVX3lxTE9jMjVfdER1aTZBZHQyRUFPNnZqbW9zNHQ4Yl9JakU3S3d6TnlmTXQ5OVJKa3dLVlpxelB0MkhOeHZaMHZCSXg3OFYxSzhFSGd4THRVRUVXc3F0NFVyMllwQW9tdEJFWW5kMTNIZ3p6MmVTY3pHUFd4c0JxTGQ4eFBTQ0JhZ1FnT3MxS0w3Z3Z0d0g5aU1wTXpjUXlnR2I5UW9pQVFWVmZKc045dWdEWVZrd0tRVmMzMklkTDB0TzhXbUloVER2ZUh2Tnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support as SEC delays ETF decision - FXStreet",
        "content": "SEC delays decision on Ethereum ETF S-1 drafts as analysts shifted their potential launch date again.\n\nEthereum whale risks liquidation if ETH declines to $2,984.\n\nEthereum breaches key support amid key insight from CME open interest.\n\nEthereum is down more than 5% on Thursday following the Securities & Exchange Commission's (SEC) failure to approve ETH ETF issuers' S-1 drafts. Meanwhile, the recent decline has strengthened the bearish outlook after ETH moved below a key support level, sparking $90 million in long liquidations.\n\nDaily digest market movers: SEC yet to approve ETH ETF\n\nDespite its light comments on issuers’ S-1 drafts, the SEC has yet to approve spot ETH ETFs following the US Independence Day holiday. As a result, Bloomberg analyst James Seyffart shifted his over/under date for a potential approval to next weekend.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May, but also need to sign off on their S-1s before the products go live.\n\nNate Geraci, President of ETF Store, noted that the SEC expects issuers to amend their S-1s by July 8, with another round of filings potentially due around July 12. This \"would theoretically mean launch week of July 15\" for spot ETH ETFs, wrote Geraci in an X post.\n\nMeanwhile, following the recent market decline, a whale who longed ETH via the Compound protocol is about to be liquidated, according to data from Lookonchain. The whale deposited 12,734 ETH worth $40 million to Compound and borrowed $31.4 million worth of dollar-denominated stablecoins with a health rate of 1.06. The whale risks liquidation if the price of ETH drops to $2,984.\n\nETH technical analysis: Ethereum bears lead market amid slight bullish sentiment from US investors\n\nEthereum is trading around $3,132 on Thursday, down more than 5% on the day. The decline wiped out more than $90.81 million worth of long positions from the market, bringing the total ETH liquidations to $102.48 million in the past 24 hours.\n\nETH has now breached the $3,203 key support level, strengthening its bearish outlook. With the move, ETH has fully balanced the market inefficiency from itsprice spike following news of the SEC's U-turn on spot ETH ETFs.\n\nETH/USDT 4-hour chart\n\nETH may test the $3,029 support level in the next few hours. A bounce from this level will cool the bearish momentum. However, a move below it may see ETH seeking support around the $2,852 price level.\n\nIn the past 24 hours, Ethereum's futures open interest (OI) across top exchanges declined by almost 5%. Open interest is the number of outstanding contracts in a derivatives market that are yet to be settled.\n\nWhile the move signified wider risk aversion from traders, Ethereum's CME OI was an outlier, rising almost 1% in the last 24 hours. This indicates that US investors may be slightly bullish despite declining prices due to expectations of spot ETH ETFs' launch.\n\nAnother key insight is that spot ETH ETFs may experience impressive flows using the rising ETH CME OI as a proxy to measure investors' sentiment. As a result, ETH may take bears by surprise and rally past its yearly high, invalidating the bearish thesis."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE50YU9yNmg4aXJRYUpCZmxsUkFtdFJHQVlGaDRpUUxLTnRrSmtwTHRvNjRRb0FrdWdzcXlJVlRSVWpibm9wakxaQ0ZNaGNLVkZIaVRXUVpBUG9GQy1HVW5JcWY0OVgzNmFybS1CRnlHRDNVdVhKU2fSAX5BVV95cUxNVkYwaDlpS2pOQTA5XzVDY0gtVU1jdDRIX2dZQ05BTlF3R3FyVkZSNWw3Y3cxMHNYQWFtY21Ga3NwdnZfVVl5em9XNUJCR1EwbEFPZU5YTWFqaW9aLWtSaGpZLUtGZmhCRzdoQTVvQWNaM3RCUzJkQjdxY0hSY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Updates Ethereum ETF Filing as US Listings Near - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAsset manager Bitwise submitted an updated registration statement for its proposed spot Ethereum ETF with regulators on Wednesday, disclosing its plans to waive fees. While largely procedural, this latest revision is seen by market observers as a sign that the launch of Ethereum ETFs is imminent.\n\n“Expect more from other issuers throughout the rest of the week,” Bloomberg ETF analyst James Seyffart wrote on Twitter (aka X). “We're thinking these things could potentially [be listed] later next week, or the week of the 15th at this point.”\n\nAfter shares in the Bitwise Ethereum ETF are listed on an exchange, Bitwise will waive a yet-to-be-defined management fee on the first $500 million its fund garners during that period, the amended filing with the Securities and Exchange Commission (SEC) stated.\n\nBitwise’s move follows similar ones from Franklin Templeton and VanEck. Both ETF hopefuls have included fee waivers in filings for the first $10 billion and $1.5 billion, respectively.\n\nAD\n\nAD\n\nAnticipation of the trading of spot Ethereum ETFs has grown steadily since the regulator’s last-minute approval in May. While the SEC approved several so-called form 19b-4s, it has yet to green light individual S-1 filings from asset managers, which are needed for trading to begin.\n\nBitwise submitted its amended S-1 days before it was actually due, according to Bloomberg ETF analyst Eric Balchunas. On Twitter, he floated the idea that Bitwise “wanted to get it off their plate,” and that the SEC’s latest round of comments appeared to be minimal.\n\n“From what I hear the last round of comments were ‘literally nothing’—took zero time to update,” he said.\n\nBalchunas concurred that the class of products seems on track to begin trading this month. At the same time, he wondered why the regulator appears to be dragging its feet, considering the SEC seems mostly satisfied with the filings that firms have put forward so far.\n\nAD\n\nAD\n\n“Given how light comments were, these could have easily been trading by now,” he wrote. “Could be one 'problem' issuer slowing down [the] process or just summertime.”\n\nNot long after spot Ethereum ETFs were approved on May 23, the cryptocurrency rallied to around $4,000. Yet as the approval process has played out, Ethereum’s price has shed most of those gains, drifting down $3,270, as of this writing.\n\nSEC Chair Gary Gensler said last month that the process for launching spot Ethereum ETFs is “going smoothly.” Speaking at the Bloomberg Invest Summit, he added that progress is dependent on asset managers providing full disclosures.\n\nThough Bitwise’s amended filing has few changes, it does include new disclosure language. For example, a clause was inserted stating the “chair of the SEC has stated that the SEC has authority under existing laws to regulate the digital asset sector” within a section on oversight.\n\nBitwise also added a few sentences disclosing that certain digital asset trading platforms, to the extent that they are regulated, may not be in compliance with applicable rules.\n\nFinally, a section also outlines the “Initial Creation of Ether.” Looking at Ethereum’s initial supply of 72 million, it shows how most was sold to the public through a crowd sale in 2014, alongside distributions to the Ethereum Foundation and the network's developers.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSE1sNlp6MlhTdjkzRkk4ZlBva0wxbnhBX1VIN0V0Y1l2VWFTR3EtOGYzY1N4NkpVSUY3czRxb05qSGdUQXN1WV9NOEI1M2dDR09uOEJZSTNibm9TOGdZZnlOei1oNVdoYWRycy1YMkFmMF9mQXFrMEpJQ0JwYVI5ZGU4bXBjZk1xbFo4Mi1B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "What to expect from Ethereum ETFs after Bitcoin ETFs’ record $14bn frenzy - DLNews",
        "content": "Ethereum ETFs are expected to launch any day.\n\nExperts expect explosive growth if the success of Bitcoin ETFs is replicated.\n\nBitcoin ETFs may see $50 billion in inflows over the next year.\n\nIt’s almost here.\n\nMarket watchers expect the US Securities and Exchange Commission to approve spot Ethereum exchange-traded funds after the Independence Day weekend.\n\nThe launch of the funds comes after spot Bitcoin ETFs saw $14 billion in inflows since their January launch.\n\nThose funds also catapulted Bitcoin’s price to record highs in March.\n\nWill spot Ethereum ETFs have a similar effect?\n\nHere’s what the experts expect.\n\nInflows\n\nSpot Bitcoin ETF inflows will surge by 257% to $50 billion by the end of 2025 as large platforms like Morgan Stanley and Merrill Lynch start to approve them.\n\nThat’s according to crypto ETF provider Bitwise’s chief investment officer Matt Hougan, who made that case in an investor note this week.\n\nJoin the community to get our latest stories and updates\n\nEthereum on-exchange products will attract $15 billion in net flows in their first 18 months, he said in a separate note.\n\nAnd crypto exchange OKX’s chief commercial officer told DL News he expects investors to pour up to $500 million into the ETFs in their first week.\n\nOthers offer a more bearish outlook, saying spot Ethereum ETFs will be unable to replicate the success of their Bitcoin kin.\n\nFor one, Ethereum lacks a clear narrative akin to Bitcoin’s status as a haven asset.\n\nMechanism Capital’s managing partner Andrew Kang and TP Icap’s co-head of digital assets Duncan Trenholme have both voiced those concerns.\n\nBeating the odds\n\nHougan argued that there is a way for the world’s second biggest cryptocurrency to beat the odds — by recognising that Bitcoin and Ethereum “are as different as gold and oil.”\n\nWhile Bitcoin is structured as a monetary asset, Ethereum is more like a tech platform that enables others to build new applications upon it, he said.\n\n“Investors love technology stocks,” Hougan said. “Nearly all investors have exposure to high-growth tech plays like Nvidia and Meta, and relatively few have exposure to monetary assets like gold.”\n\nBut for Ethereum to beat expectations, the idea that it is a tech asset must gain momentum, he said.\n\nThat equires more adoption of Ethereum-enabled initiatives, such as stablecoin or tokenisation products.\n\n“Maybe someone needs to launch a new ETF that’s 10% ETH and 90% tech stocks,” he said. “As a starting point for the future of technology, you could do a lot worse.”\n\nWhat about the price?\n\nSpot Ethereum ETFs launching is expected to trigger a new crypto rally.\n\nSingapore-based QCP has suggested that Ether will surge to $5,430 on the back of the ETFs.\n\nOthers — like research firm Bernstein and Lekker Capital — suggest the launch will drive the price to $6,600 and $7,000 respectively.\n\nFor Bitcoin, Bernstein predicted that Bitcoin will reach $200,000 over the next year, helped by growing crypto adoption, Donald Trump’s pro-crypto stance, and the powerful industry lobby.\n\nWintermute, similarly, projected that Bitcoin can reach $100,000 before the end of the year.\n\nIn the short term, however, investors are betting that Bitcoin will continue to wobble.\n\nTraders are hedging against a downturn — driven in part by crypto exchange Mt. Gox’s repayments to creditors, and governments selling seized Bitcoin on the open market — by piling into bullish Ether option trades.\n\nCrypto market movers\n\nBitcoin is down 4.3% over the past 24 Horus to trade at $60,169.\n\nEthereum is down 4.3% to $3,300.\n\nWhat we’re reading\n\nEric Johansson is DL News’ News Editor. Got a tip? Email him at eric@dlnews.com."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPTWxlVl9mREV4ZGVRMjM2alVHQVVLYkZFMHI3ckhwckhDS0c3eWdyeDM1MElrQVVNQTRDblVBUlY5TzVoamtCX1BVTmZRcVFkVGR6X29yV2JDNktTX2lLZWZBOEttVzlOazBhbGJZRmtCNlRtUWdvWTFzY25aRExWV1lxYUxpZThJQVo4ZTF2VzU2X0FxaVE5VERVaFhRWnJTeXVNbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set To Outperform Bitcoin In Coming Months - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNSVBpajlfM0lQSjQ4YnFkNkU2VjdXRHlCWVZPekZvMEtZZm5jTmxjOW5rdHZjem13M0wxc0NuOFVnT045MXNmVkNCZUtoMzNtYmtqVXI3WDBoalhRaExMVk0zeXB0TFRGU2pNUFZxdGxZMVAyVHJkMWtidkRHSEhuT2RYVkNKeDFiT1dv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Its History and Future Outlook - Camarillo Acorn",
        "content": "Ethereum, the world computer, has been instrumental in the blockchain and the cryptocurrency community since its entrance. Being one of the largest platforms for the implementation of smart contracts and dApps, Ethereum has become a platform for many new ideas in the digital economy niche. Appreciating its history from when it was born up to the present and its possibilities is useful in comprehending its importance and possibilities. Also, certain points in Ethereum’s timeline can be marked as important, for example, the Ethereum price all time high and the lowest price Ethereum has hit in 2024.\n\nThe Birth of Ethereum\n\nEthereum was introduced in late 2013 by a young programmer, Vitalik Buterin. Buterin planned on building a platform surpassing what Bitcoin can offer, a decentralized platform for executing smart contracts and dApps. This vision aimed at using blockchain technology not only to de-centralize money but also a number of applications and operations.\n\nThe development of Ethereum was backed by an ICO in 2014, the project creators accepted over 18 million dollars in Bitcoins. This funding effort was a testimony to the fact that the people believed in Buterin’s vision. The Ethereum network officially went live on July 30, 2015, with the first block known as the “Frontier.”\n\nEthereum’s Evolution and Milestones\n\n1. Early Growth and Adoption: The early years of Ethereum though were quite dynamic and experienced high adoption rates. Due to the ability of Ethereum’s smart contracts, developers began to actively engage in developing dApps. Many initiatives, starting from decentralized finance (DeFi) and ending with gaming, appeared during this period and were based on Ethereum.\n\n2. The DAO and Its Aftermath: A major milestone in the history of Ethereum is The DAO (Decentralized Autonomous Organization) hack in 2016. The DAO was a very ambitious project envisioned as a decentralized venture capital fund. However, a flaw in its code was taken advantage of, and 50 million dollars in Ether were stolen. This caused a rather bitter fork, where the community was split in two: Ethereum and Ethereum Classic, whose token is ETC. The reason for forking was the community’s decision to get the funds back and to make the platform trustworthy.\n\n3. Reaching All-Time Highs: The price of Ethereum has been volatile over the years, which depicts the growth of the currency and people’s interest in it and the crypto space as a whole. The highest Ethereum has ever been recorded was in November 2021 when one ETH was trading at above $4800. This milestone signified the escalating beliefs in the Ethereum project and cryptocurrencies with the DeFi, NFTs, and the Ethereum 2.0 launch.\n\n4. The Technology Behind Ethereum: Ethereum platform is based on implementing smart contracts and Ethereum Virtual Machine (EVM). Smart contracts are digital contracts that are self-executing with the terms of the contract written in code. These contracts operate on the EVM, meaning that the implementation of these contracts is done to the letter as is coded, and there are no chances of downtime, censorship, fraud, or third-party meddling.\n\n5. Ethereum 2. 0: An essential shift that characterizes Ethereum technology is the shift to Ethereum 2. 0, also called Eth2 or Serenity. Ethereum 2. As for the platform’s major concerns such as scalability, security, and energy consumption, 0 attempts to tackle some of them. The upgrade involves moving from the proof of work (PoW) to the proof of stake (PoS).\n\n6. Proof-of-Stake (PoS): In PoS, the validators are selected to produce new blocks and check transactions depending on the number of tokens they own and are willing to pledge. This is anticipated to cut energy usage by a large margin, thus improving Ethereum’s sustainability. Moreover, PoS is aimed at increasing the network capacity so that more transactions can be processed per second, eliminating the issue of high traffic and high gas fees.\n\nBenefits and Challenges\n\nBenefits\n\nDecentralization and Security: Ethereum’s decentralized nature ensures that there is no single point of failure for applications.\n\nInnovation Platform: Ethereum introduced the smart contract feature, which created a market of decentralized applications combined with various industries, from finance to gaming and even supply chains.\n\nInteroperability: Ethereum’s open-source architecture ensures the integration and cooperation between various platforms and applications in the ecosystem.\n\nChallenges\n\nScalability Issues: Nonetheless, Ethereum has a major problem of scalability whereby the network usually gets congested and this attracts high charges. Ethereum 2. 0 also aims at solving these problems but the change is gradual and continuous.\n\nRegulatory Uncertainty: Like all cryptocurrencies, Ethereum is not free from the criticism of the regulating authorities. Changes in the law on its uptake and application can influence it.\n\nSecurity Vulnerabilities: Smart contracts are very effective but sometimes contain errors and flaws that can lead to attacks such as the one witnessed in the DAO hack.\n\nFuture Outlook\n\nSeveral prospects indicate that Ethereum’s future is bright, and several important advancements are likely to strengthen its status as a dominant blockchain.\n\nEthereum 2. 0 Implementation: The complete execution of Ethereum 2. These include scalability, security, and energy efficiency, and it is expected that the 5G network 0 will offer many improvements. This upgrade may encourage developers and enterprises to deploy their applications on the Ethereum network since it is a more reliable and fast network.\n\nDeFi and NFT Growth: The DeFi and NFT markets which are closely associated with Ethereum are expected to expand in the future. DeFi applications provide financial services with no intermediaries, and NFTs are non-interchangeable digital assets that include art, virtual land, etc. For Ethereum these innovations will be vital for its to remain relevant in the future which is why the support for these innovations will be important.\n\nEnterprise Adoption: Enterprises are increasingly using blockchain solutions to enhance business aspects such as transparency, security, and efficiency. Ethereum’s well-deepened ecosystem and further growth make it a valuable candidate for enterprise use, which can result in further expansion and becoming a more widespread part of business processes.\n\nCommunity and Development: The Ethereum community has been, and continues to be, very engaged and enthusiastic about the platform. This way, it is possible to constantly improve and develop the approach that corresponds to the current tendencies and issues. Given that the Ethereum’s development is based on a principle of collaboration, it will most probably remain a leader in the field of block-chain technologies.\n\nFinal Notes\n\nEthereum has evolved from a unique concept to one of the most significant parts of the blockchain and cryptocurrency sphere. It has introduced the elegance of smart contracts and Decentralized applications to the world, which has completely changed the way assets are interacted with and managed.\n\nDespite the issues concerning the network, including the matters of scaling and the legal environment, the further evolution of Ethereum 2. Thus, it has a 0 ranking and strong community backing, which shows it has a bright future ahead of it. Thus, as Ethereum is constantly developing, it is ready to stay one of the leaders in the digital economy and contribute to the development of further implementations of decentralized technologies."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSDJla0lJNVFtV3JlWG1TUkR1MmJqUzJfM285QnZfaWVHOVBkdGxoM1FTQ2ttdmgyMWFvZS1USk9fMkkyZjF6YUhlbXNDc0ViY3NwVlA3ODhGTlFYV0lhWGZuWDRSWlNCUTNsdEhEczNRTHQwUGxJX1R4Z3FKa0trWlNhWWJhNjlXTnFTetIBlAFBVV95cUxNb044c1NVc3VYb2tKZkxIVGc5LTdzaVJNRTVsVmJweFAzdlVZZEZjWElzMG9EOTlXdDh0NndKYTZWb244S1VIbms1cGlNNUxEc0xrTDhVcTV2NS05MWt3QzlyaGc0RnBzbmZPTFFqVE9IeUhUQURDS1NObEwxcVJUNlJjYm9ILXM0TFhiTUNldEhjck1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Liquidations Top $200 Million as Ethereum, Bitcoin Fall - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto market liquidations spiked to their highest point in a week on Wednesday as the price of Bitcoin sunk below $60,000.\n\nIn the past 24 hours, more than 74,000 traders were liquidated to the tune of $208 million, CoinGlass data shows.\n\nThe majority of those — some $184 million — struck investors holding long positions that had bet on prices going up.\n\nThe largest liquidations afflicted Ethereum investors, at $55.5 million, almost entirely in long positions, data shows.\n\nAD\n\nAD\n\nOngoing issues surrounding U.S. monetary policy, geopolitical tensions, and the upcoming U.S. presidential election in November are projected to impact the top cryptocurrency's price throughout 2024.\n\nBitcoin dropped from around $62,200 to as low as $59,425 in intraday trading. The asset has since clawed back losses above $60,200 but is still down 3% over the past 24 hours.\n\nMeanwhile, Ethereum is down by 3% over the same period, falling from a Wednesday high of $3,425 to as low as $3,254. It's now trading at $3,300.\n\nSolana, the world's fifth-largest crypto by market cap, took the largest hit among the top 10 coins, down roughly 8% to $140. Solana had been riding high on New York-based investment management firm VanEck's filing of its “Solana Trust” exchange-traded fund late last month.\n\nAD\n\nAD\n\nTop cryptocurrencies have fallen over the past month. Ethereum is down over 12% across 30 days despite simmering interest in the debut of Ethereum spot ETFs.\n\nSome analysts predict the new financial products could begin trading by mid-July, with at least one firm predicting the price of ETH will subsequently take off. Bitcoin is down 12% over the same period.\n\nTo be sure, analysts still see further price gains this year, with the current market cooling representing a precursor to another major price surge in the coming months, Decrypt reported Monday.\n\nOn Wednesday, analytics firm CryptoQuant released a report examining Bitcoin mining metrics and flagged conditions for a bottoming of prices at current levels.\n\nEdited by Sebastian Sinclair."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQVmI1TEhWVkR4NDNacnZSRUJKbE16UDVJVDBaNlFBS3UydjlIWVN0dTJhZnZpZzJDQ3l6dTZpd1pZWGhGdFBBZGxWY0p4S2NWQTl3OEdfcmNFY2NYa01CZmMtaGw4SWJkWXhNZWtqRUo0MlFtNXNKUmg5clR6QmxjbVFLWWFkMW1LX0ZJdEF6ZzREaW1iVDBvb0Zad0E3eFVMZm16YjMtZkF3T05pMmthM0ItTzVGMzYtUGdvVGV2TnZiYknSAcgBQVVfeXFMUF9fb0pUWDRsNG40SUtIclJoS3RsRFVOX2s1Vzg0eEJwSW9MM21rcUxXTDV0THBTbUtNUEIyQjl6OFltb1dwRkNTSWFRRjROQkhqLXFmWm9aeEZrV3lvQ3hiYlA5Z3RVbFBZVXJSQk1EVnpLZmloSnQyUC1BZTZBTG5uOW1iaFlKQkcwdWZHUnpfM0hWWGtMSG5UTFoxb1BETXhCbnlBNnR1RTBkckZ2Ql95U1ZHOUM1T205R0pTVl8xS0RoN3JzQzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum poised to follow Nvidia's steps as Bitwise files updated S-1 draft - FXStreet",
        "content": "Ethereum ETFs expected to begin trading in July after Bitwise files amended S-1 ahead of due date.\n\nEthereum ETFs could flip analysts' expectations if investors buy into ETH's Nvidia-like high-growth tech play narrative.\n\nEthereum derivatives data reveals investors are becoming more risk averse following Mt. Gox headwind on horizon.\n\nEthereum (ETH) is down 3% on Wednesday following Bitwise filing an updated S-1 draft and a wider market downturn with potential Mt. Gox BTC supply flooding the market. Despite the general market lull, investors may gain consolation from Bitwise prediction that Ethereum ETFs could outperform analysts' expectations if positioned as a high-growth tech play similar to Nvidia.\n\nDaily digest market movers: Could Ethereum be the next Nvidia?\n\nAsset manager Bitwise filed its amended S-1 registration statement with the Securities and Exchange Commission (SEC) today ahead of its July 8 due date. The new filing added a fee waiver for up to $500 million in assets under management, similar to Van Eck's waiver last week.\n\nConsidering the comments on these drafts were light, Bloomberg analyst Eric Balchunas said spot ETH ETFs should have begun trading and expects them to launch before the end of July.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May but also needs to greenlight their S-1 registration statements before the products can begin trading.\n\nAccording to Bitwise CIO Matt Hougan, Ethereum ETFs could be more successful than earlier predicted if investors buy into the narrative that Ethereum is a high-growth tech play similar to Meta and Nvidia. Hougan had earlier predicted that spot ETH ETFs could attract up to $15 billion in net flows before the end of 2025.\n\n\"It's pretty easy for me to imagine investors selling a small amount of their tech exposure and adding ETH. I'd argue it's easier than imagining investors carving out an entirely separate portfolio sleeve for a new monetary asset,\" Hougan noted.\n\nHowever, people need to buy into the idea that \"Ethereum is a technology investment\" for this to happen. Hougan noted that a clear understanding of how Ethereum differs from Bitcoin and the growth of applications on its network would help strengthen the “high-growth tech play” narrative.\n\n\"What might that look like? Imagine stablecoins going from $160 billion to $1.6 trillion in assets as more people embrace the speed and transparency of blockchain-enabled payments. Or consider decentralized finance applications opening up new avenues for lending and borrowing with the onset of regulatory clarity. Or imagine more firms following BlackRock's lead and building tokenized funds on the Ethereum platform,\" said Hougan.\n\nMeanwhile, Lookonchain revealed in a recent analysis that Ethereum ranks number one among blockchain networks in terms of yearly revenue. Ethereum's revenue is at $2.728 billion per year, with Bitcoin coming behind at $1.302 billion. Increased revenue often indicates high user activity in a blockchain network, which helps estimate bullish sentiment.\n\nETH technical analysis: Ethereum traders are skeptical with Mt. Gox headwind in sight\n\nEthereum is trading around $3,307, down about 3% in the past 24 hours. ETH breached the $3,367 support level, pouring cold water on hopes of a potential rebound. ETH liquidations reached $44.33 million, equalling that of BTC in the past 24 hours despite having a lower market cap. Long liquidations accounted for 87% of ETH's total liquidations, with shorts at 13%.\n\nEthereum options open interest has declined by 57% since its spike following the SEC's approval of 19b-4 filings of spot ETH ETF issuers. As of May 24, ETH options OI was at $13.44 billion. However, following the expiry of May and June options, most investors have failed to open new positions as indicated in the chart below.\n\nETH options OI\n\nETH options OI is now at $5.69 billion, its lowest level since September. The decreasing options OI accompanied by ETH's price decline suggests option traders are more risk-averse. Two possible reasons for the uncertainty among traders include:\n\nSEC's delay in greenlighting prospective spot ETH ETF issuers’ S-1 drafts.\n\nPrevailing wider market bearish sentiment from Mt. Gox BTC supply.\n\nThe ETH Long/Short ratio also provides insights into traders' sentiment in the past week. The ratio's 7-day average is at 0.946, indicating the futures market is tilted toward the downside.\n\nAs a result, ETH may sustain a horizontal movement in the coming weeks until the SEC approves issuers' S-1 drafts for spot ETH ETFs to begin trading.\n\nETH/USDT 4-hour chart\n\nA breach of the $3,203 support could strengthen bearish sentiment and send ETH back to the $2,850 to $3,029 range."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE16QnE2aDVja3NESWV0N1ZncTF2YnRCRlVOTmhzTkowS1E4V0FrLTBlWDAweGo1YU9PUFY3S0lvWVllRTBfcDlqakloYm1WVHJkOGp1a1ZNbVJOWXlYdjJrRGl6VFBNT0VSb09Vd9IBckFVX3lxTE9sSnpIV3VtczFXYmoyRlM4T3pxOFZ6X05BV25aalFvRDFjcVk2TUh1WExPektBeVgzbmdQeHo5QnJGaEVERUtRVnFjXzJySk9ZVlM5Z1Nwc1Jpdjk2aTlxSHBJTHdYQkhKRFp1YUlsYjR4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Here’s When Ethereum ETFs Are Going to Launch - U.Today",
        "content": "Multiple industry analysts believe that Bitcoin exchange-traded funds (ETFs) could be on track to be launched in mid-July.\n\nAdvertisement\n\nAccording to industry sources that were cited in a recent Bloomberg report, multiple applicants are supposed to submit their amended S-1 forms before July 8.\n\nAs noted by Nate Geraci, president of The ETF Store, this would mean that the final approval of S-1 forms is expected to take place by July 12. This would \"theoretically\" mean the launch week of July 15, according to Geraci.\n\nAdvertisement\n\nThe U.S. Securities and Exchange Commission sent shockwaves across the cryptocurrency industry after it unexpectedly greenlit rule rules changes (19b-4 forms) in May. The Ethereum (ETH) price experienced a powerful rally shortly after that decision. However, that rally was short-lived since the SEC had yet to complete the two-step ETF approval process that also included S-1 forms.\n\nIn late June, SEC boss Gary Gensler stated that the approval of Ethereum ETFs was going \"smoothly\" after previously claiming that these hotly anticipated products would be able to start trading this summer.\n\nSell the news?\n\nAccording to a recent report by K33 Research, the Ethereum price might fall right after the launch of several spot ETFs in the U.S.\n\nHowever, K33 Research still expects that inflows into spot ETFs will be a boon for the price of the leading altcoin. These inflows could reach up to 1% of the cryptocurrency's total circulating supply, according to the firm.\n\nLast week, Steno Research predicted that these products could possibly attract up to $20 billion worth of inflows within the first year of their trading."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFByQUZRY2lPdm0tLThjTndBNEJRcUVIWkdvMnpLa2VUNTMzWXlmRTR5azhaSDJkaE53UXJ4UnRObE94dzhDbmt6MlotckE2Z1NDazREQWpIVEQwZm5SMGZaUzlmU1Vtc0V1c3ZOZkdCMjVrZG8xeGtHRDFoQW1pZ9IBgwFBVV95cUxPZkw0RDdGbHdGRmlsb1RYLW5laFFJbGlaazVCUUhOd3hhc1ZHTVVEMXVsOGQxWTZGdzBPVEw1dV9tNmxPVHpHZUNHa2tLOTNaeDdyVEs0Z2VTMmFwX2Jmc2l4cXRmLUx2NmdmWUVXUXJpRU14Wm1UQjhuclR4VTJtN3FBdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Skyrockets 100% Against Bitcoin in Annual Revenue - U.Today",
        "content": "Ethereum has surpassed Bitcoin in fee income over the past year by an epic 100%, according to the newest report from Lookonchain. Thus, its network has recorded $2.73 billion in fee income, the most in the industry. Bitcoin, in second place, generated $1.3 billion. Closing the top three is Tron Network, with almost $460 million.\n\nAdvertisement\n\nOther networks also contributed to the overall fee income landscape. Solana generated $241.3 million, Binance's chain accumulated $176.6 million and Avalanche recorded $68.83 million. Additionally, the zkSync Era earned nearly $60 million, Optimism $40.4 million and Polygon $23.9 million.\n\nHere are the top 10 chains by 1-year fee revenue.#Ethereum earns a fee of $2.728B per year, #Bitcoin earns a fee of $1.302B per year, and #TronNetwork earns a fee of $459.39M per year. pic.twitter.com/ixAiP9g8JA — Lookonchain (@lookonchain) July 3, 2024\n\nAs the data highlights, Ethereum has a significant lead, doubling Bitcoin's revenue. This result is attributed to a broader range of applications and services on the network of the main altocin, with higher usage and transaction fees as a result.\n\nAdvertisement\n\nSure win?\n\nEthereum's ecosystem supports decentralized finance platforms, NFTs and various applications, all of which contribute to increased transaction volume and fee income. This is what has positioned ETH as a more versatile and widely used network compared to Bitcoin.\n\nIn return, Bitcoin's revenue, while still over a billion dollars, is primarily driven by its role as a digital store of value and medium of exchange. Its transaction fees are affected by network congestion and the price of BTC itself, which can fluctuate significantly.\n\nHowever, it still lacks the extensive range of applications found in the Ethereum ecosystem, resulting in lower overall fee income."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9wckRnbkI3MmJXWGxVNDVxamNrV21ydkJvQmNnZmZqMGhKT0NTLVNpWVo2S2YtcGk3ZWZZd01UZ3FRYk5BbTBSaGc3ai1wNGRnRG9BQV9LWjMyQUczMHdkUnNLZ0QtTGxCSFUxUDE5czFxWVY1VFZZ0gF8QVVfeXFMUFhUb01aQ2c1VGpjN3pDeWhqT3NSQ3lPM2l6TEphalN3SkZVdDVVaHVwa1pUU21ua0c3V1lyc0gxRG9nTUFFOFBOY2VuOU5WS3BuMElYWDhPbWtjNUl5TTQxR1NfcXZjV3VRdFpwc3pJRC1tTUFLelBCT2dvWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Touch $3,000, Here Are 3 Things to Know - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum is slowly moving toward the $3,000 price level, and it seems inevitable if the market does not face an unexpected influx of fresh funds, which is unlikely. Investors should be ready to see Ethereum at $3,000 and potentially even lower.\n\nAdvertisement\n\nThe price of Ethereum is getting close to $3,000. This means that there will probably be more volatility on the market. In the past, traders have been drawn to important psychological levels like $3,000 in order to take advantage of possible deals and sellers to limit losses.\n\nIt is wise for investors to prepare for potential fluctuations and contemplate tactics to efficiently handle their risks: options, futures hedging, funds redistribution and other strategies may come in handy. The $3,000 drop could have a big impact on investor sentiment.\n\nEthereum, which frequently trades above crucial levels like $3,500, has benefited greatly from the investment community's strong support. A decline below these levels could cause confidence to waver, especially among individual investors, who may see the drop as an indication of an extended bearish phase.\n\nAdvertisement\n\nAn increase in caution when investing in Ethereum may result from this change in trading volumes. The ecosystem of Ethereum may be impacted by the drop in price. We are already seeing a notable outflow from the network, which does not really benefit the digital silver.\n\nFurthermore, the financial strain that Ethereum-based projects may experience could impede ecosystem innovation and development. The NFT (non-fungible token) and DeFi (decentralized finance) markets are no longer around levels we had seen back in 2021, and current tendencies show that things are unlikely to change in the foreseeable future."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNeUpMN3lJTllsTzJJVVZHZEJ6RGdXZk1GT3ZQLUJKdjE1Qkp4SXNsYVhEcUpuUWdjNUFfRlhhOENISi1CWDlHQmFNNTBGM2VKVlVVeVlIc1RIOTl4YjZ6X09ac054TmZ1NWctb3k1RlBJZkxZMGJHdlRqbENHNnVwWmJXeDhwbFlueDF2OTNTM2FRdVpVWlJz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Lido sees around 100k increase in staked Ethereum amid SEC scrutiny - CryptoSlate",
        "content": "Lido has reported a rise in staked Ethereum on its platform despite the US Securities and Exchange Commission (SEC) classifying its staking programs as securities in its lawsuit against Consensys.\n\nStaked Ethereum increase\n\nA July 2 report showed that Lido users staked an additional 95,616 ETH between June 24 and July 1. This increased the total value of assets staked on the platform by 1.26%, reaching $33.48 billion.\n\nDuring this period, Lido led in net Ethereum deposit inflows, surpassing centralized exchanges like Binance and Gate.io and the rapidly growing liquid restaking project Ether.fi.\n\nThe platform also revealed significant activity in its wrapped staked ETH (wstETH) on Layer 2 networks like Scroll, Base, Arbitrum, Optimism, etc. The total number of assets on these blockchains increased by 7.19% to 141,586, bringing the 7-day trading volume to $1.23 billion.\n\nHowever, the Annual Percentage Rate (APR) for staked ETH decreased slightly, dropping 0.04% to 2.96%.\n\nNode decentralization\n\nLido is enhancing decentralization efforts by launching a Community Staking Module (CSM) to promote more decentralized Ethereum node operations.\n\nAccording to official documentation, CSM will integrate a diverse range of Node Operators, including Solo stakers, into the network. The module will also allow permissionless entry for node operators. It added:\n\n“The ultimate goal for this module is to allow for permissionless entry to the Lido on Ethereum Node Operator set and enfranchise solo-staker participation in the protocol, increasing the total number of independent Node Operators in the overall Ethereum network.”\n\nThis move would mark a clear departure from its previous approach, which required its DAO to approve a new node operator before its addition to the platform. However, its current initiative would allow solo staking to become more attractive and accessible for interest validators by introducing “reasonably low bond for Node Operators” and requiring “no secondary token collateral.”\n\nThe module is in early adoption mode on the Holesky testnet and is expected to transition to a permissionless state on July 11, 2024.\n\nMentioned in this article"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5pM0NEc1VrQ2RpX3dHd1FldHc1enJKampPTXZDYVUwX2ROQlMyTjktOHVKZm91MEVMZG9hWG4xQUthR3JhX2pzVEtwcE52eDRjQ29TLWk1QmJnQ0dOVmdGMEJUMnVXYkVoakcxR19OWW3SAXZBVV95cUxQQXJaZXU2RFRfeE4zX3YyRkVDQ192dmNlNzFyczNCbDR2N0tYRVBfOHBlUWFvTVQ4QnRST195VXl3TjA0ck8zb3RpRHhzeWpvekhxZkRBZTZSSWtpb3VNT0JRTlE3Y2NqVjFRQzdYd0xtRjVZZ1ZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "3 Reasons Why $3,365 Is Critical for Ethereum (ETH) - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum is hanging on the edge at $3,365, as this price level is actually far more important than you might think. The asset has clearly gained serious ground for a reversal after breaking above the 100 EMA, but right now, ETH is in some trouble and may reach $3,000 quite soon.\n\nAdvertisement\n\nEthereum has historically held up at this critical support level, which is located roughly where the $3,365 level is. If Ether were to fall below this mark, it would indicate that this support is no longer there and will probably descend to $3,000. This is the next significant psychological level. The 100 EMA frequently serves as a reliable gauge of the general trend, and a break below it may trigger a large sell-off.\n\nThe 200 EMA is the only significant support level between the 100 EMA and the 200 EMA in terms of technical support aside from the 200 EMA, which is located much further below. Ethereum may see a swift decline to the 200 EMA level, or roughly $3,000 in case of a breakdown.\n\nAdvertisement\n\nNot only has Ethereum broken above the 100 EMA, but it has also broken below the consolidation channel it has been trading in for the last few weeks. This channel has given traders some predictability by providing a range in which ETH has moved. A break below $3,365 would mean that the market is leaving this channel to the downside, suggesting that the trend may be turning from bullish to bearish and potentially causing more losses.\n\nThe 100 EMA serves as a key support level, and a break below it might cause ETH to move rapidly toward $3,000 because there would be no other support level. Furthermore, a breach below this level would indicate a break out of the current consolidation channel and could indicate a reversal of the bearish trend."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQM3VsdDhUOU8xV1F2MHE4ZThtNHRCeGVYaWNLdHhuM2xSWk9XZlFsRzRBaTdMWWtuMUNMcXh2OXN5R3ZLV29sUmdmQ1E4VExNMXVyZTk2TC13THp6V1ZGMk1mRWlBMGhLQjhkMlhybkFuQmFWOG5RTnNYU3drbXlvX1lvNDROZGg5SUUxNGlDN1pJcl9iTEJXbGVHNEMtR3hPMHdJYm1fandZMkNDcXBjLURrNG5mdExmc3ZUTnp6MNIBxAFBVV95cUxNLUVaYndGbFZQbzdqYVRFR2FhN05qdENrX25NYnpSdVpnVEcxaktyc05PYldxQ19iMFU4eFIyMm4tOTJFcGVncFMwM1FrN05mMTBaQnR6T1NteVo4czdkVmNybWFwNmlzRHVLa1hCbnpyck1WdFd1MWNoaFBuZ2xOOWZlNzB4MW9xOWpnMXRDaUlxUWVFY1djZnpkb1BfTEstb3BjNF81ZzJPbFdZX0tvV2kzWEhOUGlYUG9BUWFGa0FLVzdD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Builder Consensys Buys Wallet Guard to Strengthen MetaMask Security - CoinDesk",
        "content": "The blockchain-based Web3 world of decentralized applications saw its fair share of funds stolen from users through scams alone last year. Wallet Guard, which further improves scam and drainer detection through transaction validation and client-side heuristics, follows last year’s integration of Blockaid security alerts into MetaMask."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1WeDB6MHItRUhtSGU3RzdsbFlmamFaeE5NazEzandpUkNzSWJ6aFVtRWZoUXpYaU10NFgwMG1DS1YzU3ppVVNMb1NNZldIZlRsa0JaWElZZGNYNDdySHhHU01iRmJuUTh0SmxWMm5RYWw5cnRaTFlIelpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) Sees Remarkable Growth, Eyes $120 Target - TronWeekly",
        "content": "Much attention has been focused on Ethereum Name Service (ENS) in recent days. Ethereum Name Service increased by 41% over the past week, signalling a solid uptrend with further upside potential. In a broader sense, ENS headed up nearly 14% over the past 30 days, testifying to this token’s sheer resilience and growth potential.\n\nThis impressive surge can be attributed mainly to Bitcoin’s price rebound. The upward momentum that Bitcoin’s rise created for altcoins has given them room for losses to recover and set their eyes on new highs. With the lead set by this top cryptocurrency, Ethereum Name Service and other altcoins follow through in a continuum, further benefiting from renewed investor confidence.\n\nCurrently, Ethereum Name Service stands at $31.90, with a trading volume of $1.17 billion within the last 24 hours and a market capitalization of $1.00 billion. In the past 24 hours, Ethereum Name Service has added 10.54% to its value, additional backing for what is already an extraordinary cryptocurrency market player.\n\nEthereum Name Service (ENS) Sees Remarkable Growth, Eyes $120 Target 4\n\nAnalyst Sees Potential for $120 for Ethereum Name Service (ENS)\n\nCrypto analyst Matthew Hyland believes in an optimistic price trajectory for the Ethereum Name Service (ENS). As per Hyland, if it breaks out from its current levels, Ethereum Name Service will reach as high as $120. Hyland’s bullish prediction came from ENS’s recent performance.\n\nThe analyst mentioned that he had recommended this to his Patreon subscribers when it was $17.50, exactly on the night of the ETH ETF approval a few weeks ago. Unaffectedly, with ENS currently trading at around $30 and showing every sign of attempting a breakout, this recommendation has paid off.\n\nHyland’s insights and predictions give further weight to the growing confidence placed by the crypto community in ENS. His price target of $120 foreshadows a substantial upside potential from current levels, so it has emerged as one of the cryptocurrencies investors will watch over the next few months.\n\nAs ENS values surge, many opportunities emerge within the crypto market, gaining optimism from well-esteemed analysts like Hyland. The eyes of investors and enthusiasts are fastened on Ethereum Name Service, hoping for more significant gains as the market evolves.\n\nRelated Reading | Ethereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBrQkJqbnVVTjBDZGhTRXJERHpXUG05cjlIMk41cUtBblRzMnZXYmpvZE1UQ0czSFFiVzlReVg0Z2FpS0JOYkdlbnlIMjFtTmZubGxDTzdyUGdVQ1I1V2x5OC1HZDN4TzhpTGNfcGt6ZjZKYVZa?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs To Be Approved Within July - Watcher Guru",
        "content": "Following the approval of spot Bitcoin exchange-traded funds [ETFs] in the U.S., the community has been awaiting the arrival of Ethereum ETFs. Similar to Bitcoin, Ethereum faced its own set of hurdles. But things seem to be falling into place as the approval for ETFs by the Securities and Exchange Commission [SEC] could be weeks away.\n\nAccording to Steve Kurz, the head of asset management at Galaxy Digital Ether ETFs, they will most likely get a green signal sometime in July. He believes that the ETFs are currently in the “window dressing” stage. Kurz added,\n\n“Look, we’ve done this before. This is methodical, this is window dressing, and the SEC is engaged. We’ve been doing this for months now, we did it with the Bitcoin ETF, the products are substantially similar — we know the plumbing, we know the process.”\n\nCurrently, there are a total of eight firms lined up for approval of Ethereum ETFs. This covers BlackRock, Franklin Templeton, VanEck, Fidelity, iShares, Galaxy Digital, Grayscale, and 21Shares. These companies have already received permission to list their shares on exchanges. But before their shares can be traded, they must receive clearance for their S-1 filing.\n\nAlso Read: Cryptocurrency: 3 ETH Coins To Stash Before Ethereum ETF Boom\n\nCan This Approval Boost the Price of Ethereum in July?\n\nAt press time, ETH was trading at $3,349.33 following a 2.58% daily drop. According to Changelly, ETH will surge to a high of $3,555.49. The average trading price for the altcoin will remain around $3,510. Ethereum could mostly see a bigger surge considering the current hype around spot ETFs.\n\nIn addition, a K33 Research analysis revealed that Ether ETFs would be a “golden egg” for the altcoin’s price. Ethereum could even beat Bitcoin in the initial weeks following its launch.\n\nAlso Read: Ethereum ETFs: $5B Net Inflows Expected in First 6 Months"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPUlp6Sk1wU1J2dVhSb3pzZXgyM3RaelpSRTBFdjQ5c29BZmJJQk13RzhSNkxkbU1MdjVKOVdFNlg5VEtlc0hWck16ZTJiTTZPcXp1Qk5IdTFkVm9MdXlyWUdQN1FSOHVIT1VqUkdMc2w3NFUzTURxdHg5OUluYkdaM0R4RmVnWjg0N2hlbkJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Will Ethereum Price Surge in 2024? What Traders Should Know - CoinGape",
        "content": "As 2024 progresses and the cryptocurrency market keeps evolving, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, stands as a strong contender, garnering the attention of both investors and traders. With various developments in the pipeline, and a volatile market to deal with, there are speculations about ETH price will surge this year. This article delves into the key factors that could influence Ethereum price in 2024 and what traders should keep an eye on.\n\nRecent Market Performance of Ethereum Price\n\nadvertisement\n\nAccording to CoinMarketCap data, Ethereum price has experienced challenges in the market, having declined by 2.8% in the past day to trade today at $3,357.89. The past month was not friendly either, with the token recorded losses of about 12.17%. With a market cap of $403.6 billion, and a trading volume of $10.8 billion, ETH remains a strong contender among cryptocurrencies. Although the coin achieved its all-time high milestone of $4,891.70 on November 16, 2021, it has since dropped in price by 31.32%.\n\nKey Factors Influencing Ethereum’s Price in 2024\n\n1. Ethereum Upgrades and Developments\n\nIn 2024, the Ethereum network will experience several major enhancements. The ongoing “Sharding” is designed to improve the network’s scalability even more.\n\nSharding will enable Ethereum to handle numerous transactions at once, easing congestion and decreasing gas fees. Anticipated enhancements in technology are likely to draw in additional developers and users to the platform, potentially increasing the need for ETH\n\n2. Institutional Adoption\n\nInterest from institutions in Ethereum is increasing. Many big financial institutions are starting to incorporate Ethereum in their activities, whether through investing directly, using DeFi apps, or creating products based on Ethereum.\n\nIn 2024, the anticipated introduction of Ethereum ETFs could potentially unlock the doors for a surge of institutional funds. These advancements are expected to increase investor trust and encourage interest in ETH.\n\n3. Decentralized Finance (DeFi) Expansion\n\nEthereum has been behind the growth of the DeFi ecosystem. The sector has seen an increasing number of assets on Ethereum. Decentralized exchanges (DEXs), lending platforms and yield farming are innovations on DeFI continuing to gain traction.\n\nAs the ecosystem expands, the demand and utility for ETH are likely to increase, positively impacting its price.\n\n4. Non-Fungible Tokens (NFTs) and Metaverse\n\nEthereum is also making big advancements in the metaverse and NFT areas. The popularity of virtual real estate, collectibles and digital arts is driving demand for ETH, especially since most NFTs are created on the Ethereum blockchain.\n\nMost NFTs are minted on the Ethereum blockchain. As the concept of metaverse develops, the role of Ethereum in fueling these virtual worlds could result in higher adoption, leading to increase in ETH price.\n\n5. Regulatory Environment\n\nThe regulatory environment for cryptocurrencies still has both positive and negative aspects. Although clear regulations can support growth, overly strict policies may hinder innovation and discourage investment.\n\nTraders need to monitor regulatory changes worldwide, as they could affect the price of Ethereum. Favorable ETF approvals or supportive blockchain policies could trigger price surges as positive regulatory updates.\n\nTechnical Analysis and Market Sentiment\n\nThe Ethereum (ETH) technical analysis shows a complex situation with indicators like EMA, MACD, RSI, and Fibonacci levels. EMA signals ‘Sell’, hinting at a bearish trend, with potential support at $3,090.3.\n\nMACD at -47.4 suggests selling due to bearish momentum, while RSI at 41.2 is neutral but near oversold levels. Fibonacci levels indicate support at $3,266.8 and resistance at $3,767.7, offering insights on potential price movements.\n\nFalling below $3,266.8 could lead to further drops, while surpassing $3,767.7 might indicate bullish momentum.\n\nWhat Traders Should Know\n\n1. Stay Informed: Staying updated about Ethereum’s technical upgrades and their schedules is essential. Effective execution of these improvements could signify a significant uptrend.\n\n2. Monitor Institutional Movements: Pay attention to updates from large financial institutions about their participation in Ether. Higher adoption by institutions can result in noticeable price gains.\n\n3. Follow DeFi and NFT Trends: The rise of DeFi and NFTs within the Ethereum ecosystem shows the high demand and usefulness of ETH. Monitoring these industries can offer understanding of potential price fluctuations.\n\n4. Regulatory News: Keep informed about regulatory changes happening across the world. Favorable regulatory updates may result in optimistic market outlook, while unfavorable news can elicit the opposite reaction.\n\n5. Technical Analysis: Make use of technical indicators for insight into market trends and possible entry and exit points. This can assist in forming informed decisions when trading\n\nConclusion\n\nthereum faces a critical juncture in 2024, driven by tech advancements, institutional attention, and the evolving DeFi and NFT sectors. Despite current bearish trends, the long-term outlook is optimistic with the upcoming upgrades and potential ETF greenlights. Traders must stay alert to market shifts and regulations to seize Ethereum’s anticipated growth in 2024 through informed decision-making and technical analysis."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOY1Zpa1lSWDZRX0p4VUR2SzdYVnp2ZDJTb2dWX0FkRmh4YXN3U251VlpDc1pFcUtXODdleTE1Z29vVkY5a3dpSVRuMEtqV0pYQjJVSjVKZjRtb2RxdE1vTEc5Y2owV0ZJdkpydGM5d2xQWTNWQWtoYjlLSDlDanZ2NVo2Vmg4VUVIWmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Staking: A Guide to Earning Rewards and Securing Network - Crypto Times",
        "content": "Ethereum, a major cryptocurrency, has become more eco-friendly and secure by using a new system called Proof-of-Stake (PoS). This new system lets you earn rewards for just holding onto your Ethereum (ETH) and helping to keep the network safe.\n\nThis guide explains what staking ETH is, how it works, and different ways to do it. Even if you’re new to crypto, this guide will help you understand how staking ETH can be a great way to get involved in the exciting world of Ethereum.\n\nWhat is Ethereum Staking?\n\nEthereum staking is the process of locking ETH on the Ethereum blockchain and participating in verifying transactions. This method sees users locking in their ETH as a “stake” or “deposit” as a guarantee against them verifying and validating Ethereum transactions.\n\nBy staking ETH, users qualify to become validators with granted privileges of broadcasting transactions on the blockchain, maintaining the distributed database, and securing the network. These validators are rewarded with transaction fees and a predefined yield on their staked amount.\n\nFollowing the Merge upgrade, which went live in September 2022, Ethereum was transited into using the Proof-of-Stake (PoS) consensus mechanism from the Proof-of-Work (PoW). This upgrade marked a significant milestone for ETH which changed its fundamental infrastructure.\n\nBefore the adoption of PoS consensus, Ethereum validators tended to use heavy electricity for verifying transactions just like Bitcoin. Now its electricity consumption is drastically reduced and the network efficiency is improved from the ground level.\n\nBy implementing a staking mechanism, Ethereum has also unlocked numerous economic benefits for its ever-evolving ecosystem. For instance, data from Ultrasound.money shows that the rate of increment in ETH supply has steadily decreased post the Merge upgrade and it is also helping maintaining ETH scarcity by burning significant supply regularly.\n\nBenefits of Staking ETH\n\nEthereum provides numerous benefits to users and entities who wish to participate in staking and securing the blockchain network. Below are some key benefits of staking on Ethereum for users:\n\n1. Passive Rewards\n\nThe primary benefit of staking ETH is getting rewarded in exchange with newly minted ETH as block rewards plus transaction fees. As a validator, users who stake ETH get to verify transactions and add them into blocks. Each of these transactions have associated gas fees which are rewarded to that particular validator who verifies it and adds it to the blockchain network.\n\n2. Network Effects\n\nStaking is a crucial element for PoS blockchain networks like Ethereum as it makes it secure and decentralized. As stakers are responsible for verifying and validating transactions, it is necessary for them to function in a fair and transparent manner so that the security of the blockchain network is preserved.\n\n3. Sustainability\n\nThe amount of staked ETH is periodically locked in the system so that its economical value remains sustained until it is unstaked. This brings prolific sustainability and empowers value creation within the blockchain ecosystem. Locking of ETH also contributes to narrowing the selling pressure in live markets.\n\nHow to Stake ETH\n\nThere are different ways to stake ETH and harness its benefits. All these staking methods are separate from one another on the basis of technicality, reward bars, and ease of implementation.\n\nLet’s understand it all in detail;\n\nSolo Staking\n\nThe method of Solo Staking involves setting up a node on Ethereum with a manual process. It is also known as native staking where stakers directly interact with the Ethereum network. The solo stakers will participate in securing the network all by themselves with their hardware devices to verify and validate transactions.\n\nAlthough it requires 32 ETH as a staking deposit for a node to become a validator and secure the network. Additionally, a sophisticated computer system is also essential for an Ethereum client to run, which is the software containing information on the whole blockchain. Such requirements make solo staking a hefty process and burden to people with no such experience in software engineering.\n\nHowever, this method represents the gold standard for staking on Ethereum with higher responsibilities than other methods and higher staking rewards. To run a node and become a solo staker, it’s recommended to follow the official guide from Ethereum.\n\nStaking as a Service\n\nAs the interest in ETH staking has grown rapidly, many “Staking as a Service” platforms have arrived in the past few years. These platforms allow you to stake ETH as a third-party service provider which then manages all your technical requirements including node set-up and hardware. It means that users can benefit from staking rewards without being worried about running their own validator node on Ethereum.\n\nThis method essentially enables non-technical users to participate in stalking while leaving technical aspects to someone else. All it requires is for users to generate keys and deposit 32 ETH for service providers. In exchange for their service, these staking service providers will charge minimal fees from staking rewards and send back the remaining rewards to users.\n\nStaking Pools\n\nStaking Pools allow individuals to stake a flexible amount of ETH instead of the standard 32 ETH in order to partake into staking. It enables earning staking rewards without the need for extensive technical knowledge or running their validator node. Instead of staking alone, users can send their ETH to a liquidity pool from where combined staking is initiated. Once a pool reaches to 32 ETH by collective deposits from different users, it automatically deploys a node and starts functioning as a validator.\n\nThis innovative staking method makes it possible for users to contribute any ETH amount and secure Ethereum network as a validator. Then the pool operator entity uses all the shared deposits to join the native staking on Ethereum. When staking pools receive rewards, it is distributed to participants in accordance with their initial stake.\n\nStaking on Exchanges\n\nOne of the easiest and most convenient methods of staking ETH is accessing it via centralized crypto exchanges. It involves depositing of ETH to a centralized exchange platform which offers staking facility. This is usually regarded as the safest and most handy staking process as exchanges provide guarantees to users for security as well as rewards.\n\nAlthough the exchanges require to send ETH to their wallets and giveaway asset custody which possesses risk for users. It essentially means that exchanges retain ownership of user’s assets and the risk of loss is increased. Most of the popular exchanges offer staking services to users including Binance, ByBit, Coinbase, and others.\n\nConclusion\n\nIn the ever-evolving crypto ecosystem, staking opens up exciting opportunities for users to participate in blockchain security and earn rewards. Ethereum stays at the forefront of staking with its robust position among blockchain networks. Staking ETH not only offers economic benefits but also contributes to the decentralization, security, and stability of the Ethereum network."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1wZjQ4Y1FONnNnWnZ2M19QWnE5U3kzbk5HeG9wQU1Qb3kxNWRmalJjanF3Q0xNZXd2dm1uUlU4T0FkRHpDcFM0bWY3WE5oaXllWUt2MnUyNHVTS2NJOFdJRTlmOHB1UW5ja2xmamtPWDZWSjFvUmFYRHk3MXo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set for Speed Boost with EIP-7732 - TipRanks",
        "content": "Ethereum (ETH-USD) is set for a speed boost with EIP-7732. Vitalik Buterin, Ethereum’s co-founder, is pushing for faster transaction times, and this new proposal could be the key. EIP-7732 aims to make the network faster and more efficient, addressing a growing demand for speed and reliability.\n\nWhat Is EIP-7732?\n\nEthereum developers have introduced EIP-7732 to split the tasks of validators and create a committee to ensure transactions are timely. This proposal could overhaul the block validation process, enhancing both security and speed for the blockchain.\n\nHow Does It Work?\n\nThe core of EIP-7732 is the Enshrined Proposer-Builder Separation (EPBS). This idea breaks down block creation into two main roles: the consensus proposer and the execution proposer. The consensus proposer selects an execution proposer, who then produces a valid block with essential data like payments or block hashes. A group of validators, called the Payload Timeliness Committee (PTC), makes sure the execution proposer submits the block on time. This separation reduces the workload on validators and boosts the network’s efficiency.\n\nWhy It Matters\n\nValidators currently juggle both consensus and execution roles within a short time frame, often leading to delays. By splitting these tasks, EIP-7732 allows validators to focus on consensus first and defer execution, improving overall performance. Additionally, this proposal introduces a trust-free exchange between builders and proposers, ensuring payments and valid block inclusion without needing extra middleware.\n\nThe Impact on Transactions\n\nVitalik Buterin emphasizes that a good blockchain user experience relies on fast transaction confirmations. Thanks to previous upgrades like EIP-1559 and the Merge, Ethereum transaction times have dropped to between five and twenty seconds. EIP-7732 could make transactions even faster, rivaling the speed of credit card transactions. However, implementing these changes might require another hard fork, which could introduce backward-incompatible updates.\n\nA Simple Comparison\n\nThink of a busy coffee shop. You order a latte, but the barista has to take your order, make the coffee, and handle the payment all at once. This slows everything down. Now, imagine a system where one person takes the order, another makes the coffee, and a third processes the payment. Everything moves quicker, and you get your coffee faster. That’s what EIP-7732 aims to do for Ethereum.\n\nLooking Ahead\n\nEIP-7732 is like a breath of fresh air for Ethereum. By splitting the validation process and making transactions quicker, it’s set to make the whole network way better for everyone using it. These upgrades could make Ethereum more appealing to investors and developers, which means more people might start using it. And as more people jump on board, the price of ETH could go up. Faster transactions and smoother operations could attract lots of new users and projects, boosting Ethereum’s value in the long run.\n\nAt the time of writing, Ethereum’s price is $3,113."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9oVDN3aXkxd2tzdmNxXzE3N2UtamxmYlhhRVB3TXowdlVHaHJCSXU2Tm94ZGRJbjU0eHRRNmM3VmdXOXlpdUNobnFicDEzaFR1Z3FIaFBoN2VxV19lTlcyVEUzamJfckJPTTdDYXpGVzNDMHBlcURMNjJnSzDSAYQBQVVfeXFMTm9oSnh0TEhtdEVkeXBwTkhaeFNaVFlENW5mUkl4VHYtazJxa2hXaEtMVnBCTXo3dURSR3VLVmFHNzhaVFp4U1NLYjUwd2FiS3VkLTRLS1EzYjdZaWUwbUc1YVFrMUc3Z3NhMVc3V0tHMk82ZWQwTzVod05mOWV5ZFFUX1RZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in GTA 6? It’s All Still Rumors—For Now - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRumors that the widely anticipated Grand Theft Auto 6 will utilize cryptocurrency have been circulating for more than a year now—and they’re swirling again.\n\nOn Wednesday, a pseudonymous Crypto Twitter influencer called Gordon—apparently named after Gordon Gekko from the iconic 1987 film “Wall Street”—shared to his nearly 500,000 followers that “GTA 6 will enable cryptocurrency payments,” and that “so far only Bitcoin, Ethereum, and USDT [are] confirmed.”\n\nBut in reality, no cryptocurrencies have been confirmed for Grand Theft Auto 6, despite the ongoing chatter around the rumors. Rockstar Games and parent company Take-Two made no such announcements this week on the matter, nor previously, and the official trailers and announcements have made zero mention of crypto inclusion.\n\nHowever, the tweet—which also included a fake trailer for the game—quickly went viral, with more than 500,000 views as of this writing after just a matter of hours. When Twitter users asked Gordon for his sourcing, he’d jokingly reply that his “uncle works there,” or say that previous reports on the matter were “old” at this point.\n\nAD\n\nAD\n\nFake news. — BORED (@BoredElonMusk) July 3, 2024\n\nBut in truth, nothing has changed since Decrypt’s GG reported on earlier rumors in May 2023, nor since the first official trailer—which initially leaked with “BUY BTC” stamped on it, apparently by the leaker in question—debuted last December.\n\nDecrypt’s GG reached out to Rockstar Games for comment, but did not immediately receive a response.\n\nCould Grand Theft Auto 6 implement a crypto element when it launches in 2025? It’s certainly possible, and if so, it would be a transformative moment for the embrace of cryptocurrency by the traditional gaming industry.\n\nAD\n\nAD\n\nTake-Two Interactive has previously explored the space, acquiring casual gaming giant Zynga in early 2022 as Take-Two founder and CEO Strauss Zelnick suggested there were “Web3 opportunities” they could explore better as a team. Zynga has since launched its first blockchain game on Ethereum, called Sugartown, but Take-Two still hasn’t dabbled with its other brands.\n\nRockstar Games, on the other hand, banned the use of cryptocurrency or NFTs on player-run Grand Theft Auto 5 servers in late 2022, following a surge in the use of NFTs to represent unique, player-owned assets within modified game servers.\n\nAnd given Grand Theft Auto’s satirical tone, the game might be more likely to skewer cryptocurrency and poke fun at caricatures of crypto and NFT die-hards, for example, rather than try to launch its own on-chain coin. But that’s all speculation at this point, as there are relatively few official details around GTA 6.\n\nFor now, at least, don’t believe the hype. While Rockstar Games hasn’t officially closed the door on cryptocurrency being used in Grand Theft Auto 6, it also hasn’t confirmed anything at all on that front. It’s sure to remain a hot topic in the long run-up to release, however, which is currently pegged for fall 2025.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5mUHJxQVUtR2NpdmI0cjNOMVBnODBjakx6dk81UGF0bUI5N1FxbVBJcmFQMGVPc2tEWVZqNEMyVTY5am9QWU1DaERUZFR2amV3MnNRQ0FYdzVKbHBDYUFYcXY4SGdScFB4ZVlmVjBkaGNMbHhEbU1lQ2VEeVB1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF arriving in July - The Cryptonomist",
        "content": "There is still uncertainty about the date of the actual listing on the stock exchange of spot Ethereum ETFs in the USA, but the chances that this may happen by the end of the month seem to be increasing.\n\nThere are indeed many experts and analysts who expect the definitive landing as early as next week, or in any case within the following two weeks.\n\nThe hypothesis of Galaxy Digital on the imminent approval of Ethereum ETFs\n\nYesterday Bloomberg interviewed the head of asset management at Galaxy Digital Ether ETF, Steve Kurz, who stated that spot Ethereum ETFs are very likely to be definitively approved by the SEC in the current month of July.\n\nAccording to Kurz, the requests are currently in a phase of “window dressing”.\n\nThe expert from Galaxy Digital reminded that the SEC has already done this before, and despite being almost identical products to those already approved in January on Bitcoin, he called it a way to embellish the procedure.\n\nIt should be noted that Galaxy Digital is one of the eight companies that has applied to the SEC to issue a spot Ethereum ETF, along with BlackRock, Franklin Templeton, VanEck, Fidelity, iShares, Grayscale, and 21Shares.\n\nAll have already received authorization to list the shares of their ETFs on ETH on the stock exchange, but before they can actually be listed and made tradable, they must receive authorization for the S-1 form.\n\nThe window dressing\n\nIn the financial sector, “window dressing” refers to the practice of embellishing a portfolio or a balance sheet, for example, by selecting or modifying certain information, in order to make them appear more attractive or better performing.\n\nFor example, in the case of investment portfolios, positions are carefully chosen to present in such a way as to make the portfolio appear more diversified or with better returns.\n\nObviously, it is considered a deceptive practice, or at least not very transparent, because it creates false expectations or gives a distorted image.\n\nIn this specific case the SEC needs somehow to present these ETFs as something positive, given that for years it has stood against both Ethereum and crypto ETFs.\n\nLast year it took a court ruling to force the SEC to approve the spot Bitcoin ETFs, as it had always rejected them in the past, making a mistake.\n\nThis year, however, it is likely that a diktat has come from above, given that it is still a government agency and in a year of presidential elections, evidently the candidate running again (Joe Biden) wanted to avoid irritating investors and the markets.\n\nSo in this specific case, window dressing might not be entirely misleading, even if it involves making formal changes to the requests to make them appear more in line with the expectations of the SEC.\n\nThe landing on the USA stock exchange of Ethereum ETFs\n\nIn the case of spot Bitcoin ETFs, the actual listing on the stock exchange occurred the day after approval.\n\nIn the case of spot Ethereum ETFs, only the requests have been approved for now, but the procedure is not complete. It is necessary for the SEC to also approve the final form, the S-1, which the various applicant companies have already submitted.\n\nTomorrow is the 4th of July, and in the USA it is a national holiday.\n\nFriday it is unlikely that the SEC can meet for final approval, also because before it can do so the window dressing phase must be completed.\n\nIt was expected that the final approval could arrive on Monday, but in the current state, perhaps it is already a lot if it manages to arrive next week.\n\nWhat is certain, however, is that once the final overall approval is obtained, the issuing companies will race to list their ETFs on the stock exchange as quickly as possible, and this means that the listing should take place the day after the definitive approval.\n\nThe forecasts\n\nIn reality, the main uncertainty is the one concerning the potential success of these new financial products on the USA stock exchanges.\n\nIn the case of Bitcoin in January, the success was resounding, so much so that the price of BTC went from $45,000 to over $70,000.\n\nInstead, in the case of Ethereum, a much more moderate success is expected, although to be honest, the markets seem to be skeptical about a true and proper success of these ETFs on ETH spot.\n\nThe options market on ETH currently shows a positive sentiment regarding the launch of ETFs in the medium/short term, as happened for Bitcoin, but at this moment the Ethereum spot market does not show any bull signs.\n\nThere is therefore a discrepancy, with on one side the spot market that does not seem to be optimistic, while on the other side the derivatives market seems to be.\n\nThe only certain thing is that there is no sign of true and proper euphoria.\n\nAt this point, it is possible to imagine that something similar to what happens in January after the actual stock market debut of the new spot BTC ETFs occurs. That is, a drop in the weeks immediately following, lasting less than 30 days, and then a rebound.\n\nThe sales\n\nThe problem is that with the actual landing on the stock exchange, two waves of selling could be triggered.\n\nThe first is that of those who will do the classic sell-the-news, after having done the buy-the-rumors, given that the news of the approval is not yet 100% certain.\n\nThe second, much more dangerous, is that of the Grayscale Ethereum Trust, which just like the Grayscale Bitcoin Trust could be forced to liquidate a large part of the underlying (ETH) once transformed into an ETF and listed on the stock exchange.\n\nIn January this dynamic lasted less than two weeks, also because then the other ETFs started buying more BTC than Grayscale was liquidating.\n\nSo if the actual listing on the stock exchange of spot Ethereum ETFs should take place around mid-July, it is possible to imagine a drop in the price of ETH until the end of the month, and then perhaps a rebound in August."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOZ3VYTU1XUTBfWFE0ZC1fcDczRjlWWElPOTdMeGQ5TmJFZHF0dy1PdmlmV2pDX1ZRQ25Fb054TkdHRWprWFlQMFJMQ0taVy1pNVg2Y2FVeDNqbDd1VGQ4TGIxV2plZWc0aGNQN2d4MDZYajM5c3pIclZTWGd5ZEFCbGRxN3k5eG9fY3JYcVVjQTJCTkpkN0FFZEtXemR0UXBMNTE3QkZlczhobGZ2S2ItMkx1aXVQbk9VOVIyT0dBX00wdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outperform Ethereum 800% YTD – Top Winners Revealed - TradingView",
        "content": "In the first quarter of the year, Solana-based meme coins have emerged as the frontrunners, surpassing Ethereum’s meme coin ecosystem and artificial intelligence (AI) tokens, according to a recent report by market data platform CoinMarketCap.\n\nThis shift in popularity signifies a change in dynamics within the cryptocurrency market, with meme coins gaining traction and challenging previously dominant narratives such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFTs).\n\nSolana Ecosystem Dominates Growth Chart\n\nThe CoinMarketCap report highlights that the Solana ecosystem has consistently topped the growth chart for the past eight months, with over 20 new tokens introduced in Q2 alone.\n\nEthereum’s ecosystem followed closely behind with 14 new tokens, while Derivatives and Stablecoins witnessed relatively lesser growth with 5 and 4 new tokens, respectively. This surge in Solana-based token offerings indicates a growing interest in the network and its potential.\n\nSolana’s meme coin ecosystem, in particular, has gained significant momentum in price performance and popularity since October 2023. Although Ethereum remains the dominant blockchain, Solana’s growing prominence suggests a noteworthy trend in the crypto space.\n\nInterestingly, SOL memes have significantly outperformed ETH memes, delivering an average return of 8,469% compared to 962% for Ethereum, as seen in the chart below.\n\nNewsBTC\n\nAs “speculative capital” from other chains rushed into Solana, attracted by the explosive rallies of tokens like dogwifhat (WIF) and Bonk Inu (BONK), more meme coins experienced price surges, attracting additional attention and capital.\n\nThe top winners in the meme coin space include the cat characters MEW, POPCAT, and Book of Meme (MEME). These tokens have outperformed even the most popular ones like WIF, BONK, Ethereum’s Pepe coin (PEPE), and Shiba Inu (SHIB).\n\nNotably, political memes also emerged as a popular subcategory, with the leading MAGA (TRUMP) meme coin gaining over 5100% year-to-date, largely due to vocal support for crypto from former President Donald Trump and the acceptance of crypto for campaign donations.\n\nEthereum Tops Fee Income Rankings\n\nDespite Solana’s significant gains, Ethereum continues to dominate the Layer 1 (L1) smart contracts market, representing 62.11% of the major L1s. The report notes that Ethereum’s recent milestone was propelled by the SEC’s approval of Ethereum Spot ETFs.\n\nHowever, Binance Smart Chain (BNB) and Solana have also gained traction, adding $42 billion and $18 billion to their market share among L1 networks. Solana currently leads with over 1.6 million active daily addresses, followed by BNB with 1 million active addresses.\n\nIn Q2, Ethereum experienced record low gas fees, reaching levels not seen since 2020 due to the growing adoption of Layer 2 solutions and the market excitement surrounding Solana-based meme coins.\n\nDespite representing 62% of the market cap among major L1s, Ethereum accounted for 70% of the daily revenue, generating approximately $2.7 million. Solana ranked second with around $900,000 in daily revenue.\n\nAccording to Lookonchain, Ethereum topped the fee income rankings in the past year with $2.728 billion, followed by Bitcoin with $1.302 billion.\n\nOther notable networks include Tron ($459.39 million), Solana ($241.29 million), Binance Smart Chain ($176.56 million), Avalanche ($68.83 million), zkSync Era ($59.77 million), Optimism ($40.4 million), and Polygon ($23.91 million).\n\nDespite both platforms experiencing success in various financial metrics and growth charts, Solana’s native token, SOL, has significantly outperformed Ethereum’s ETH token.\n\nAs of the current trading price, SOL is valued at $143.25, showcasing a year-to-date growth of 650%. ETH has seen a more modest surge of 68% during the same time frame, currently trading at $3,310.\n\nFeatured image from DALL-E, chart from TradingView.com"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNTGh6T18xazV0anRJY21QRV92Vkp1TFgtVFVLY2V1TVBoTmQtWHU5empzWjQtbVUzRnhOVS1EOHdJS1lpUG1wc2JCZ2ZhaWtZNWhEWXVwU0tyejQ0aTEwQTFuZFpGOXRHOHZ5T2VHZEFkZHFHMzVTYlpMVHZPbDdhV2xTZWpCckpuZXRCVTRhc3BFbUo5TDNXbjhWNHBGVlpM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Developers Unveils EIP-7732 Designed for Speed - Crypto Times",
        "content": "Ethereum developers have proposed an exciting update, EIP-7732, which aims to overhaul the block validation process and accelerate the blockchain. This proposal introduces significant changes designed to bolster security and performance by bifurcating the process into consensus and execution stages.\n\nIn response to the ever-growing demand for efficiency, EIP-7732 aligns with Ethereum co-founder Vitalik Buterin’s advocacy for quicker transaction confirmation times. At the heart of this proposal lies the Enshrined Proposer-Builder Separation (EPBS), a groundbreaking method that splits block creation into two distinct roles: the consensus proposer and the execution proposer.\n\nImage Source: Farcaster (Vitalik Buterin exploring methods to enhance the confirmation speed of Ethereum transactions)\n\nUnder this new system, the consensus proposer selects the execution proposer, who then commits to generating a valid block pack or a block hash. Ensuring this block’s timely submission is a dedicated group of validators known as the Payload Timeliness Committee (PTC).\n\nBy segregating the consensus and execution layers, EIP-7732 aims to alleviate the computational burden on validators, thereby enhancing network efficiency and speed. Presently, validators juggle both roles in rapid succession, a process filled with potential inefficiencies and delays.\n\nEPBS promises a solution by allowing validators to immediately handle consensus and defer execution validation, all without compromising performance or security.\n\nMoreover, this proposal introduces a trust-free exchange mechanism between builders and proposers. This guarantees payment and the inclusion of valid blocks, eliminating the need for intermediary middleware. As Buterin emphasized in a recent post, “One of the important properties of a good blockchain user experience is fast transaction confirmation times.”\n\nThanks to the transaction fee overhaul of EIP-1559 and consistent block times post-merge, Ethereum’s transaction confirmation now ranges between five and twenty seconds. While this matches the speed of credit card transactions, certain applications demand even faster processing, far outpacing the current 12-second Gasper consensus mechanism.\n\nWith EIP-7732 under discussion, the promise of swifter transaction speeds seems within reach. However, this advancement may come with the necessity of another hard fork, introducing backward-incompatible changes."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPeGZONFlMNjVoQzllZHAzTkUtbHU3TTNLdmJBTUZzbXZGQ0hKSzFvN2t3SWZtcktXM2lUVmF6VmJZc2RFRjZobV8yOV92dk5tQlotTk12ZUVoemcwcWN4N2JKbHhsQVFjaDlsdVBBcjdPT2VXREFxVXU3YkRkZnFrQlZTU1hIa2N4THRjSGZMTHpsQ21Rc2swUXRsZVFQdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Crypto Heist in GTA 6? Bitcoin, Ethereum Rumors Swirls Again - Crypto Times",
        "content": "Rumors that the highly anticipated Grand Theft Auto 6 will utilize cryptocurrency have been circulating for more than a year now—and they’re swirling again. Recent claims by a popular Crypto Twitter influencer have reignited speculation, but as of now, there is no official confirmation.\n\nThe Source of the Rumors\n\nOn Wednesday, a pseudonymous Crypto Twitter influencer called Gordon—apparently named after Gordon Gekko from the iconic 1987 film “Wall Street”—shared with his nearly 500,000 followers that “GTA 6 will enable cryptocurrency payments,” and that “so far only Bitcoin, Ethereum, and USDT are confirmed.” This tweet quickly went viral, garnering over 500,000 views in just a few hours.\n\n🚨GTA 6 will enable crypto currency payments.\n\n\n\nSo far only Bitcoin, Ethereum and USDT confirmed 😳 pic.twitter.com/MoYQoppH5z — Gordon (@AltcoinGordon) July 3, 2024\n\nThe tweet by Gordon also included a fake trailer for GTA 6, which contributed to its virality. When asked for sources, Gordon humorously replied that his “uncle works there,” or dismissed previous reports as outdated. This playful attitude did little to quell the excitement and speculation among fans and crypto enthusiasts.\n\nDespite the buzz generated by Gordon’s tweet, there has been no official announcement from Rockstar Games or its parent company, Take-Two Interactive, regarding the inclusion of cryptocurrencies in Grand Theft Auto 6. Official trailers and announcements have made no mention of any crypto elements, and Rockstar Games has not responded to inquiries on the matter.\n\nPrevious Rumors and Speculation\n\nThis is not the first time rumors about cryptocurrencies in GTA 6 have surfaced. Earlier speculation in May 2023 suggested similar possibilities, and the game’s first official trailer, which leaked last December, featured a “BUY BTC” stamp—though this was likely added by the leaker. Despite these hints, there has been no substantial evidence to confirm these rumors.\n\nPotential Impact of Cryptocurrency in GTA 6\n\nThe idea of integrating cryptocurrencies like Bitcoin and Ethereum into GTA 6 is tantalizing for many. If such features were implemented, it could represent a significant step forward in the mainstream adoption of cryptocurrency within the gaming industry. This potential has fueled much of the ongoing speculation and interest.\n\nWhile the rumors about Bitcoin and Ethereum in Grand Theft Auto 6 continue to swirl, they remain unconfirmed at this time. For now, fans will have to wait for official news from Rockstar Games and hold on to their excitement as the game’s 2025 release date approaches."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOM0UyM1dzMzVRU3h1bkRuRmcweXZNX2dhVEk4aHZEYnJIYXVMaGdVVWlRcHZLaC1pdTUzV0R6Z2xXRzdFN2JBWU96MkNZc0p0emR3Ym9uQmxfdzZJSVJKeC1pWEQtZVFsVC1uLUROekdpUk9NMjVyY0VNeXEyOXNueEk5T0N2UTczR2hwV0FwT0dGQ1habW9VNtIBngFBVV95cUxOSi1yWmRZX1pZUTFPZU94bWNBSVNxeUgwbkNBLURTaVZmODZMbUhxbktfUnNJOWdXOVZuLTlzOVBHUDBzMFBvMFJ6bFdHd0ZUY2s5dXoza1FaOHVwR2dzLWQzdl90eEh3X0pHNUYwY0hlYS02MXZMcXpWX0R5ZktCX053QlBYTGNiZ2J5cU1lV1VVcV9qUUNCWWd1VUxSUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Hopes High for Mid-July Launch, Despite 3% ETH Price Dip - CryptoPotato",
        "content": "Asset managers are optimistic about Security and Exchange Commission approval for the first U.S. ETFs directly investing in Ethereum, possibly by mid-July.\n\nThe SEC has given ETF applicants until July 8 to submit updated paperwork and amended S-1s, with potential additional rounds of filings.\n\nThere may be an additional round of filings after the one due on July 8, reported Bloomberg citing people familiar with the matter.\n\nWen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th. via @emily_graffeo @olgakharif pic.twitter.com/NG8xhtCP21 — Nate Geraci (@NateGeraci) July 3, 2024\n\nEthereum ETF Hopefuls\n\nRecent SEC feedback to issuers involved minor questions, which are being addressed, the report added.\n\nHead of asset management at Galaxy Digital, Steve Kurz, told Bloomberg that an Ether ETF could potentially be approved within the next couple of weeks.\n\n“This is window-dressing, the SEC is engaged. We’ve been doing this for months now. We did it for the Bitcoin ETF, the products are substantially similar – we know the plumbing, we know the process.”\n\nMajor asset managers such as BlackRock, Fidelity, Ark 21Shares, and Invesco have pending filings, but many issuers have yet to disclose their fund fees, which is a necessary step before trading begins.\n\nIt is also unclear if Ethereum ETFs will generate demand similar to spot Bitcoin ETFs, which have amassed $52 billion in assets since they launched in January.\n\nAnalysts have estimated that the Ethereum ETF flows could be around 10% to 15% of Bitcoin ETF flows and that ETH prices may fall as much as 30% following their launch.\n\nHowever, crypto research firm K33 Research expects Ethereum to outperform Bitcoin in July.\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader,” wrote K33 senior analyst Vetle Lunde in a July 2 report.\n\nBitcoin is facing potential selling pressure from a forthcoming distribution of almost $9 billion worth of BTC related to the defunct Mt. Gox exchange.\n\nETH Price Declines\n\nEthereum prices are not showing any positive momentum today. The asset fell 3% to an intraday low of $3,342 during Asian trading on Wednesday.\n\nETH topped $3,500 in a ten-day high earlier this week but shadowed its big brother as crypto markets failed to break resistance and retreated once again.\n\nEthereum is currently 17% down from its 2024 peak of just over $4,000 and 31% down from its November 2021 all-time high."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNSkxUdnpBU01IY2lobERjN2VhV1l5dWY1UmJsSkh4Q2ZVem1ySmN3QktvVndlZzlsUmV0U2k4aEFNMmZaWUxtMnZ2UnpTUUg3cWctVUhZenlubEhNNjUtNldMelY1bkxyTXBuMmR2cVp5RVhnMkNpSVpVcEQ3eVVsYzJXcmRkcm8tNlRXWXVYdWhuYUN6ajd4R1FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum: A Battle of Titans for Blockchain Revenues - Cointribune EN",
        "content": "Thu 04 Jul 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe race for revenue in the crypto universe is intensifying, with Ethereum taking a considerable lead over its historical rival, Bitcoin. Ether generated $2.728 billion, while BTC followed with $1.302 billion, illustrating a new dynamic in the blockchain ecosystem.\n\nEthereum dominates the Blockchain revenue landscape\n\nThe Ethereum blockchain has established itself as the undisputed leader in terms of fee revenue, surpassing Bitcoin. Its exceptional performance of $2.728 billion over the past year illustrates its dominance in the Decentralized Applications (dApps) and smart contracts ecosystem.\n\nThe first quarter of 2024 proved to be particularly lucrative for Ethereum, with its revenue reaching $365 million, marking a remarkable year-on-year growth of 155%. This spectacular rise is mainly due to the boom in innovative sectors such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nEthereum’s transaction fee revenue reached a record high of $1.17 billion in the first quarter, marking an 80% increase over the previous quarter.\n\nBitcoin: A giant that remains in the race\n\nAlthough surpassed by Ethereum in terms of revenue, Bitcoin maintains its position of strength with $1.302 billion generated through transaction fees.\n\nThe introduction of Bitcoin Ordinals has played a crucial role in this performance, leading to a notable increase in transaction fees. Furthermore, the Runes technology has contributed significantly, accounting for up to 68% of Bitcoin transactions since the last Halving.\n\nDespite its primary function as a store of value and medium of exchange, Bitcoin proves its ability to generate substantial revenue. This resilience testifies to its growing adoption and persistent importance in the crypto landscape, beyond its status as a benchmark digital asset.\n\nIn sum, the future looks promising for these two leading cryptos. With the imminent launch of Ethereum ETFs and the continued growth of the Bitcoin ecosystem, analysts foresee significant capital inflows in the coming months.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQSVFKaVhEMk50YlNDaktOd0RnY0o4M29TT2x1QjFrazVtSkRUOVRRV3prWFlmNENYeDNmTm5xMExkVzREOFNnSGoycFNhbzdFZzNCWXlpY0paMkdmVXF2V25TTzMyN0xCT3U4OU5aVXd5ZUhoaUo0Sy1oWk9Wd0t6alowM2FNODg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Crypto - Ethereum ETF: Launch Imminent on July 15th? - Cointribune EN",
        "content": "Thu 04 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic landscape of crypto, a new advancement is about to materialize with the imminent launch of an Ethereum ETF. According to the latest updates, Bitwise has filed an amended version of its S-1 form with the SEC! Signaling a decisive step towards the introduction of a spot Ethereum ETF as early as this July.\n\nIs the Ethereum ETF arriving this July 15?\n\nThe ETF, which allows investors to access Ethereum without directly holding the crypto, is eagerly awaited by the financial community. Analysts predict that SEC approval could come as early as mid-July, with a potential target date set for July 15. This anticipation is based on the recent update of Bitwise’s S-1 form, which includes a fee waiver for the first six months up to a cap of 500 million dollars.\n\nNo one really knows why the SEC is taking their sweet time with these, given how light comments were, these could have easily been trading by now. Could be one 'problem' issuer slowing down process or just summertime lazy/ppl on vaca. Not sure. That said, all indications launch… — Eric Balchunas (@EricBalchunas) July 3, 2024\n\nThe SEC, which already gave the green light to spot Bitcoin ETFs earlier this year, appears ready to extend this approval to Ethereum. This represents a significant evolution for crypto, as Ethereum is often considered to have higher growth potential due to its extensive applications in decentralized finance (DeFi) and smart contracts.\n\nA launch eagerly awaited by the crypto community\n\nThe launch of the Ethereum ETF by Bitwise could mark a turning point for crypto investment. It will offer a new regulated and simplified path for institutional and individual investors. This could also signal increased recognition of the value and legitimacy of digital assets in the traditional financial system.\n\nAs the probable launch date approaches, the industry is closely monitoring the developments. If everything goes as planned, Bitwise’s Ethereum ETF could very well be the catalyst for a new era of crypto investment, accessible to a broader audience and integrated into the global financial framework.\n\nThe launch of the Ethereum ETF by Bitwise is a highly anticipated event that could transform the crypto investment landscape. With the SEC poised to give its approval, the financial world is on high alert, ready to welcome this new era of financial innovation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQNURhc1RMdmZWTFRzSC1fblpVeXcza0NVOGkxbV9LV0RtZWZBVlZqOGxvR0xTcEtFM0dnZmR4OXFzczE5UGszNzRsVUZ2eE0tV1lWSS04cUVYajZiTTZLdDNLQUJZcVN0Q0JtUUlnQ3Z1T2lfbER0WFZhODd4MUlvZjNTWkVZdVZwNV9Sc1F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Want to market Ethereum ETFs to boomers? Call them high-growth tech plays - DLNews",
        "content": "Ethereum ETFs could launch any day now.\n\nBloomberg Intelligence ETF analysts predict Ethereum ETFs will get about only 20% of the demand that Bitcoin ETFs experienced.\n\nBitwise CIO Matt Hougan argued that marketing Ethereum as a technology play could help the products surpass expectations.\n\nSpot Ethereum exchange-traded funds will launch any day now.\n\nAnd there’s a chance these ETFs will greatly outperform expectations, Matt Hougan, chief investment officer at crypto index fund Bitwise, argued in a Monday report.\n\nThe key, Hougan said, is to market Ethereum as a big technology play.\n\n“Investors love technology stocks,” he said. “Nearly all investors have exposure to high-growth tech plays like Nvidia and Meta, and relatively few have exposure to monetary assets like gold.”\n\nMarketing Ethereum in two words\n\nBitcoin was created with a supply hard cap — there will never be more than 21 million coins in existence.\n\nFor that reason, the top cryptocurrency has often been described as “digital gold,” and promoted as a potential hedge against currency debasement.\n\nBut marketing Ethereum isn’t so easy.\n\n”One of the challenges for Ethereum ETFs in penetrating the 60/40 boomer world is distilling its purpose/value into an easy-to-understand soundbite a la ‘Bitcoin is digital gold,’” Bloomberg Intelligence ETF analyst Eric Balchunas said in May.\n\nJoin the community to get our latest stories and updates\n\nAfter all, calling it a “decentralised, open-source, and distributed computing platform that enables the creation of smart contracts and decentralised applications, also known as dApps” hardly makes it easy for outsiders to understand what Ethereum actually does.\n\nIt’s for that reason — and because Ethereum futures ETFs have done poorly — that Balchunas expects spot Ethereum ETFs to attract only 15% to 20% of the demand that Bitcoin ETFs experienced.\n\nBitcoin ETFs have hauled in roughly $14.6 billion since their launch in January.\n\nTechnology play\n\nBut Ethereum ETFs could “surprise to the upside” if financial advisers market the product as a technology play, Hougan said.\n\nThat means completely separating Ethereum from Bitcoin in investors’ minds. And make it clear that while Bitcoin competes with gold, Ethereum is a centre of technological development.\n\n“It’s pretty easy for me to imagine investors selling a small amount of their tech exposure and adding Ether,” Hougan said.\n\n“I’d argue it’s easier than imagining investors carving out an entirely separate portfolio sleeve for a new monetary asset [like Bitcoin,]” he added.\n\nHougan isn’t the only one advocating for Ethereum ETFs to be marketed that way\n\nEthereum ETFs will serve as proxy vehicles to anyone seeking exposure to everything that has to do with blockchain, Quinn Thompson, founder of crypto hedge fund Lekker Capital, stated on X.\n\nThat would include tokenisation, smart contracts, DeFi, stablecoins, and NFTs.\n\n“Remember that old saying ‘I believe in blockchain, but I’m not sure about Bitcoin.’ Now that expression is accessible for traditional investors,” Thompson said.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxQN29WODA1M0lfSXNzaGVCUUZYS2tzY2NxbDROdTFmOUtoN2loUWNmYXlrSGR1d3hIUXREbkcwVlYyd2dPTWlFS3FpRHZoMkRDN1dZc2pyUUJJOE90T2xKLXVwVWtqdURXOXd1WW9VdUJwblZNbzhwZGthcXAycmQ3blhxZmxjM0NGS0ZZYTJsdFZ0Y21tenJWa05KZThCNlVRZXM4MXVPcnVDM21aWnBOY2VtUFlGMWJWZU9tc045d0pjY2NnWGhUS2hiNnVXdGlLbnZJOXdHSHhtVndWRnJNLTZjbHdBWDVkYTVxSWs4UTFiUmVjUjh5ajBLZXRJVUR0Ni1qZmFKWFZYUE5jd1pNbHcxZ9IBmAJBVV95cUxNMkEzcXgwOFJYb0ZZODFmbzRIVUhpN3hFYWhSTURIUHpWTGxOajlWNktaX0dyUllsU2htbWUzOEw2NzhmX0RlYVlWNndEMTNNRmJCTmMwVE5QNXhyNnpFMzRDYThCYTYwY3FnWnd4QjhwUFQtOWwtM0Ryc1NLZXh6RmtabmNIQzlSeU5OS0tRWUMxRTVTdVFyNFdkdkV1VFdDcDJ6VWZVMmFLbE1KWURCTWh0Qm50VVA4V3NCYzZqNG9Qd1FSYnBkNUs4bTczaVZpZlZTUmVUNE1Pa180c2UxT0dzWEVNNWNlNlY0djdwYl9TbWpMWEY4TnpSckJRMl9SVXpDMk1vTjdwNVJFTENSMnk1a2xRQV8y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum fall up to 3% on Fed’s hawkish tone; Solana, Cardano defy trends wit - The Economic Times",
        "content": "ETMarkets.com\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWhile Bitcoin’s (BTC) resilience over the last one hour was palpable, this crypto asset is still trading down nearly 3% from the previous session. Around 12 pm today, it was trading at $61,035.66. The slide in BTC had an impact on other altcoins including Ethereum (ETH), Tether, Dogecoin , Avalanche, and Shiba Inu which were down by up to 2.5%.Altcoins that were trading in the green around this time included Solana, XRP , Toncoin, Cardano, and Tron which gained up to 2%.The crypto market's lackluster trade could be attributed to the remarks by US Federal Reserve Chair Jerome Powell's hawkish statement which said that the Central Bank needs more evidence on inflation to decide on the timing of the rate cuts. Moreover, the May jobs data was reported higher-than-expected.Bitcoin's decline reflects both concerns and opportunities in the crypto market, Sathvik Vishwanath, Co-Founder & CEO at Unocoin said as he highlighted strong trading volume of $20 billion over the past day, indicating significant market activity. \"The news suggests that large holders of Bitcoin, known as whales, are piling up, indicating confidence in a potential year-end rally,\" he said.Vishwanath said that BTC is currently finding support within an ascending channel of around $61,700 though it faces resistance at the 50-day EMA at $62,210, suggesting a limited immediate upside. \"With the RSI at 48, indicating neutral sentiment, the market is depending on Bitcoin's ability to hold above $61,700 to avoid a deeper decline to the $60,700 and $60,000 support levels,\" he added.Source: CoinMarketCapOn the BTC price movement, CoinDCX Research Team in a note said that the current drop filled most of the weekend BTC CME gap, though another gap remains around $59,700-$59,800 which suggests that BTC could drop further to fill it.Currently, Solana is outperforming BTC and ETH due to ETF hype, the note said, adding that the market is slightly negative due to bearishness in BTC.\"Bitcoin has been consolidating around $61,000 for the past 24 hours, following some profit-taking by traders. It's having a hard time breaking past the $63,600 resistance level. If it doesn't manage to hold its current position, Bitcoin might drop back to the $60,800 support level, with bulls trying to keep it above that mark,\" Edul Patel, CEO of Mudrex warned.He pins his hopes on approval to Ether ETFs which he said could improve the market sentiments.Also Read: Gold’s 13% uptick beats Nifty's H1CY24 gains. Who could hold the edge in second half? (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNS3ZlMEdNYnVidEJzYnRpU3hmSkh6LTBuVWFqVXY5dnoxUDRnbTFYWXVlUmNNX0R1Z3NIYUpWcXpiRFlTMk9RTFYzeTZFTUFJQ1RqUGFmdUE3aFpkeHY0SXgyaVZlSnlPWGlsMndPSWdseUxlbkRSV0xXUlBPa0QtQ204R0pSR21xSUsxLTU3YUpvYVpqeVY4OWlfLVNZVWRiaHpNMTRJVVllZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Files Amended S-1 for Ethereum ETF Ahead of Launch Deadline - Crypto Times",
        "content": "Bitwise Asset Management has submitted an amended S-1 form to the Securities and Exchange Commission (SEC) for its proposed Ethereum exchange-traded fund (ETF). This filing, completed on Wednesday, came just days before the July 8 deadline\n\nFollowing this development, Bloomberg ETF analyst James Seyffar predicts that Ethereum ETFs, including Bitwise’s offering, could begin trading within the next two weeks.\n\nUPDATE: We've got another amended S-1 from @BitwiseInvest for their #Ethereum ETF. Expect more from other issuers throughout the rest of the week. We're thinking these things could potentially list later next week or the week of the 15th at this point. pic.twitter.com/xqVlt9lSGy — James Seyffart (@JSeyff) July 3, 2024\n\nOn May 23, the SEC approved 19b-4 forms for eight spot Ethereum ETFs, including Bitwise’s product. However, issuers must also have their S-1 statements declared effective before trading can commence.\n\nMoreover, Bitwise’s updated S-1 form includes several revisions, most notably a fee waiver for the first $500 million in assets under management. However, the firm has not yet disclosed the fee structure that will apply after this threshold is reached. This competitive pricing strategy aims to attract initial investors to the product.\n\nFor instance, VanEck and others are offering similar waivers implying competition among these new financial instruments available for investment purposes. These moves suggest that companies are taking initiatives ahead of entering the market as expected.\n\nBloomberg ETF analyst James Seyffart noted that multiple issuers are expected to file amended S-1 forms throughout the week, indicating a coordinated effort to meet regulatory requirements."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOQjg4bWlrQ1gxZUtYT2NSUmI0dFN6TUozVGNJR1B3djBUTmxNSVVYQ0ZoYXJ6YWt4NFFySHBfWW1qZkpHWllKelR1NndOdGhlN19BTFBiNW9XQ1lTWXJZMERuRUI3aTF2VGNNWUtBTjVDTU0yek1nVGNIb29RSlY1UXo5cE1naUdteEtRRTFYaWs3bTZ2T3UxVy0zbzZIUUFodGhKWTl2LVRxU3BmcDJEa3lqQXliWlR2YWZHZtIBwgFBVV95cUxOTk1MbUFPR0hqeGl0NVhteUpZMzk2VG1XSGR3b0thVXNkc0xlNGpsY3hLdkhMRTZoOTRTSWRNY0Ewd0VRdEZoeXpqXzdIbUQzZ2F0N3l0eHhYY3hpekJwcEVWYWMzanpCWjdscmVlTEV5YkVPQ2F4Y3Y0eHFFVTJjeWhfWFZnU3hQOVFuZHpvMEdObXBVT195QnRnUDhwUEVjYmEyT0Fwdk9mem8zbGRCYmpRMENUMnhwakpMUGhMZmdHZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Here’s the Most Probable Level for a Recovery After ETH Crashes 5% Daily - CryptoPotato",
        "content": "As Ethereum’s price continues to trend lower, investors are wondering whether the bull market is over. Yet, there is still a key support level that can provide the staging grounds for a recovery.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been trending lower inside a large descending channel pattern. In the last few days, the market has failed to reclaim the $3,500 level, and it dropped lower following a bearish rejection.\n\nCurrently, a decline toward the $3,000 support level, which coincides with both the lower boundary of the channel and the 200-day moving average, could be expected.\n\nWhile this confluence of support elements makes $3,000 a strong support zone, if it gets broken down, things can get much worse very quickly.\n\nThe 4-Hour Chart\n\nThe 4-hour timeframe shows a clear picture of the price’s rejection from the $3,500 resistance level. The $3,350 short-term support zone is also getting broken to the downside, making $3,000 a probable upcoming target for ETH.\n\net, investors should keep an eye on the RSI, as it has entered the oversold region, which could point to a potential recovery soon.\n\nSentiment Analysis\n\nBy TradingRage\n\nTaker Buy Sell Ratio\n\nAnalyzing the futures market metrics for Ethereum can be a great complement to price analysis. This chart demonstrates one of the most useful futures market metrics, the Taker Buy Sell Ratio.\n\nIt measures whether the buyers or sellers are more aggressive in executing their orders on aggregate.\n\nAs the chart demonstrates, following the rejection from the $4,000 level, a huge volume of market sell orders has been executed in the futures market, bringing the Taker Buy Sell Ratio to its lowest value in the past few months. This indicates that futures market traders believe the price will be dropping even lower in the short term."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOREh5M0wwVll4U095X1laWlJKeGM2RVdwSUdFSVR5LXI1anZicnVjZWstRk9vVVNLU29nTUdEZ0kzb1ZkZ0V0enRmUFZaUTc1a1d2VHAzb1JNd3pPTVVPYjBEYWxMb2VQUHBnVHZQSUFXbjhscHlkNUtpNWJEOUhzZm1OUkFYT2VmNUhBY0cyczRoSXMycXh6REZrV1Myb05VQ3BBR0pMeGVOQdIBrwFBVV95cUxPV0h0TmViWW1JZWJ1MXFnVVBNcnRTNE5Qb1ZGcHlEYVhxZ1hpal91T2tiMTdjaGlpUkNTTlF3WW45SURhbW1qYkNnS0xfRVNYQmNodXVsaTJnT09VVGdMQ1NWM1dwRHpHS0lvOUNyN25zUm1XeEgxVjJjZmtHcTlsMDBzd1RMTnFydGdBTkZvRVFOcXV3ektyeHdtZHZ1WWpVd1lYakNsX2N3VjJaLW13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Predictions: ‘Buy the Dip’ Opportunity or Further Pain for Bulls? - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) has faced significant declines, currently around $3,200, but some analysts remain bullish, predicting potential rebounds and an all-time high of $8,000.\n\nThe upcoming launch of spot Ethereum ETFs, expected to attract $3-$5 billion in net inflows, could boost investor confidence and drive ETH’s price higher, similar to the impact seen with spot BTC ETFs earlier this year.\n\nWhat’s Next for ETH?\n\nEthereum (ETH), similar to many other leading cryptocurrencies, has been severely affected by the latest market correction. Its price currently hovers at around $3,200 (per CoinGecko’s data), representing a 5% daily decline and 15% on a monthly scale.\n\nAccording to some industry participants, though, the negative trend may soon be replaced by a fresh uptick. The X user Poseidon claimed the “future is bright,” and ETH is poised for an all-time high of $8,000.\n\nCaptain Faibik was also bullish, forecasting that the price of the second-largest cryptocurrency “will bounce back hard,” meaning it currently offers a great “buy the dip” opportunity.\n\nOn the other hand, there are some worrying signs that Ethereum’s freefall may continue in the coming days. The popular crypto analyst, using the X handle Crypto Tony, claimed that everything would be under control as long as ETH’s valuation remains above $3,270. The asset lost that resistance level a few hours ago.\n\nWaiting for the ETF Launch\n\nOne important factor that could place ETH back into green territory is the launch of spot Ethereum ETFs (expected this month). Recall that the US Securities and Exchange Commission (SEC) approved multiple such products earlier this year, but they are not yet live.\n\nAccording to crypto exchange Gemini, the official introduction of spot ETH ETFs in America could attract net inflows in the range of $3-$5 billion within the first six months of trading. The move might improve the asset’s market position, moving it closer to the leader Bitcoin (BTC), the analysis reads.\n\nSpot ETFs will make it easier for traditional investors to gain exposure to Ethereum without needing to hold the cryptocurrency directly. This removes some hurdles, such as self-custody, for example.\n\nThe launch of those products could also be seen as a positive signal for the legitimacy and acceptance of ETH and the broader cryptocurrency market. As a result, investor confidence could be significantly boosted, leading to a potential fresh flow of capital and a subsequent price rally.\n\nRecall that the US SEC greenlighted spot BTC ETFs in January this year. The price of the primary digital asset hit an all-time high of over $73,500 approximately two months after that."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPanB3dVRpT3pqTTFIZWVCOGk0dHp3R1BSYTgyWk52a081WUo5YV92VWpZY0ZtZEszQTlMeEJKeGU5VGxaa25xMHlMd2lXUVZJZ0lmYzhIRUxxRVdKNXcwMGhuTEtpd3Zjbjl6T2Z3b0ctWnhweFBrUFJEb0dNZHFtVTllU0wxR3Frbm1iN2F2Z1ViTFB6b1Q5R0stbFpMdzFneXZTeFIxLXhjbWdQWk1DYWJIVW1DaEl3UkRlQTZlQXF5OVZWMks2U1RJcTRoN2VXdkJnODc4cHhwQjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Predictions: ‘Buy the Dip’ Opportunity or Further Pain for Bulls? - TradingView",
        "content": "TL;DR\n\nCryptoPotato\n\nWhat’s Next for ETH?\n\nEthereum (ETH), similar to many other leading cryptocurrencies, has been severely affected by the latest market correction. Its price currently hovers at around $3,200 (per CoinGecko’s data), representing a 5% daily decline and 15% on a monthly scale.\n\nAccording to some industry participants, though, the negative trend may soon be replaced by a fresh uptick. The X user Poseidon claimed the “future is bright,” and ETH is poised for an all-time high of $8,000.\n\nCaptain Faibik was also bullish, forecasting that the price of the second-largest cryptocurrency “will bounce back hard,” meaning it currently offers a great “buy the dip” opportunity.\n\nOn the other hand, there are some worrying signs that Ethereum’s freefall may continue in the coming days. The popular crypto analyst, using the X handle Crypto Tony, claimed that everything would be under control as long as ETH’s valuation remains above $3,270. The asset lost that resistance level a few hours ago.Waiting for the ETF Launch\n\nOne important factor that could place ETH back into green territory is the launch of spot Ethereum ETFs (expected this month). Recall that the US Securities and Exchange Commission (SEC)approvedmultiple such products earlier this year, but they are not yet live.\n\nAccording to crypto exchange Gemini, the official introduction of spot ETH ETFs in America could attract net inflows in the range of $3-$5 billion within the first six months of trading. The move might improve the asset’s market position, moving it closer to the leader Bitcoin (BTC), the analysis reads.\n\nSpot ETFs will make it easier for traditional investors to gain exposure to Ethereum without needing to hold the cryptocurrency directly. This removes some hurdles, such as self-custody, for example.\n\nThe launch of those products could also be seen as a positive signal for the legitimacy and acceptance of ETH and the broader cryptocurrency market. As a result, investor confidence could be significantly boosted, leading to a potential fresh flow of capital and a subsequent price rally.\n\nRecall that the US SEC greenlighted spot BTC ETFs in January this year. The price of the primary digital asset hit an all-time high of over $73,500 approximately two months after that."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOSTE0cHkyQUtHd2FHSGx2SVVRakdGZmFWeW4wY1ZxMzRkUkJLcTh0UU4zWFFvZTk2RWJNT1B2b2pjREp3SWR5SzVCa1VmTndNa3o5eVdTSjV3bEY2VU5QVVktZy1ZaTY4d0pUeHIxb0FUajBzMXppMGhvc3ZCMDloZlp2cXJmVElmYmQyamZfR29BUdIBlwFBVV95cUxPVEdScmVDY1NGSUNfcHhMWEZpOC1xdWViMUpkUndYeG1ack9VeU10R1U5WGkzRTFkLXBZa1hPQ1hzOWswaFlHT0YwWWxWNmo3aVUzTERmZGVZWXZHUjdZbkRGdWdfNjZGQ2x1NE5zWGJIcEdWc0ZLc1gxMUMta3JDM2JteFJjZ3pjNXAzeXZyenc2MGVxWjVJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF delayed: ‘Shouldn’t have taken this long,’ community says - AMBCrypto News",
        "content": "Ethereum saw a downturn despite strong beginnings.\n\nThe postponement of ETH ETFs by the SEC sparked mixed reactions within the crypto community.\n\nAfter a strong kickoff on the first day of Q3 of 2024, Ethereum [ETH] has flipped back to a bearish trend once again. As reported by CoinMarketCap, ETH, at press time, dropped by 1.11% over the last 24 hours.\n\nHowever, despite this recent downturn, technical indicators like MACD and RSI suggested a potential shift from sellers to buyers.\n\nAt press time, Ethereum was approaching a critical resistance level at around $3538, and a breakthrough could signal the onset of a bullish phase for the largest altcoin.\n\nWhy is ETH down?\n\nProviding some light on the current price situation of ETH, analysts Eric Balchunas and James Seyffart confirmed that the SEC has set a new deadline — the 8th of July — for submission of the forms.\n\n“Unfort think we gonna have to push back our over/under till after holiday. Sounds like SEC took extra time to get back to ppl this wk (altho again very light tweaks) and from what I hear next wk is dead bc holiday = July 8th the process resumes and soon after that they’ll launch @JSeyff.”\n\nCommunity reaction\n\nNeedless to say, this news was not received well by the community, who echoed a sentiment similar to ETF Store president Nate Geraci,\n\n“It shouldn’t take this long.”\n\nTherefore, to reassure the community, Eric Balchunas said,\n\nAs the latest trend unfolds, the crypto community is once again on edge, eagerly anticipating the approval of the ETH ETF.\n\n@StrongHedge best put it when he said,"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQX1VRdURSWHN4bmd3ZlEycGRVQUVlcmV5WVBJUzNFenNzcGtoSG5oMUZDbGJ4WUE2UExUajFGTnk0Wnkyc3FwN1F1TU4wUGZGSk1QOGE4SXV1U2M2X0RLOUwxNG4zNFpPbnUxRE9ZMFEtZ0pQSVVrdW5fU09jenNnZ1lHUzhMRk5RVDVOcGhTTFFFUDZXeGR5U29GMllHbmdaYnV6QU1mc2F5YTVraVV3NWc4Y2xNTU9scUxkbXYtOVJHeU1LSGdwV0huOHFXMXk5UGk40gHYAUFVX3lxTE9URXRTLS01NDI4QkNzRjJWbksyMndtV0pQMGZkSEt2aXpKY3ZqSTRsa3NPQ3hwbW1oRXVCVWh2M2UzaEFxcTV4MWl2RlJGTmNUOVJqbC04VXBZOV9YYlVmbktHWHNaRFJ2NU9DNWJzbHk1eHFhV0VWc0xzbWpjRC1tX2pLY0lxdHR2NVFaMEFUVGJCZVZqZEtNNGJLRjd3U3Foa0dNaVVteDBidE5xdEd0OHFUcVR2YWFIZmFSeVpuMEVHbmpVOE1qREhVbVRVMXhObmtOdlFmMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Trader Says Top Ethereum Rival Primed To Go Higher, Updates Outlook on Bitcoin and One Blue-Chip Altcoin - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that one Ethereum (ETH) rival is in an uptrend after retesting the $120 range last week.\n\nPseudonymous analyst Altcoin Sherpa tells his 217,700 followers on the social media platform X that Solana (SOL) appears to have more upside potential after holding the 200-day exponential moving average (EMA) as support.\n\n“SOL: I didn’t trade this… I think SOL looks good for higher though.”\n\nSolana is trading for $140 at time of writing, down 8.5% in the last 24 hours.\n\nNext up, the analyst says that Bitcoin (BTC) has yet to confirm a trend direction as it continues to trade sideways around $60,000 within a range with an upper bound of $73,794 and a lower bound of $56,544.\n\n“BTC: still seeing the same type of choppy price action, no real conclusive trend yet in my opinion. 200-day exponential moving average (EMA) is still close to the range low and I don’t really see anything on lower time frames that suggests reversal (yet). Best to stay flat for now in my opinion.”\n\nBitcoin is trading for $60,157 at time of writing, down nearly 3% in the last 24 hours.\n\nNext up, the analyst is turning bearish on layer-2 scaling solution Polkadot (DOT).\n\n“The chart itself still looks … terrible for what it’s worth.”\n\nLooking at his chart, the trader suggests that DOT could bounce past $7 before dipping to the $6.40 level on the daily chart.\n\nDOT is trading for $6.04 at time of writing, down nearly 8% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQQWFRTFo0U2c2SWdXZUdIMlVhbnBjamhRY3Q2THlSYXc5ekNRNlBod0ZmUzd1bGN5ZWxfbl9YeGljVnNxcVdJZ2NaODl6cjZQRmxNTmxQYWZuVDM3cWRpbFRQVDFkM3hrWWJEaDREb0J2cVhVY1E4Mk1Ma2tiMHdpUjF6blExak9ldXNPRHBn0gGTAUFVX3lxTFBuNFJmRkRfd0sxMzdTQlRoanM3UDh6SE9wOVVzaTRsTTVLWFJuR0NTZlhTY0ZmekNIVW8yaVA1Nk4wWWxGY29LSzNVelExYXhNMzZGTk1kS2VDTl9SNkU5eFJ3N1JBSjhLeW5TVjdlVkNMZE10eGZrdi14ZzVzbTlsYXpxbFlkYmMtcUR5aEFPTG13WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Large Ethereum Whale on Verge of Liquidation as ETH Bloodbath Deepens - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAnalytics X account @lookonchain spreads the word about a large whale, who is long on ETH. Currently, this trader is on the verge of liquidation, the tweet states, while he is about to lose the more than $30 million in crypto that he borrowed.\n\nEthereum (ETH) whale on verge of liquidation\n\nAccording to the data source, this whale deposited 12,374 ETH to Compound, while he borrowed $31.4 million stablecoins. @lookonchain says that should the Ethereum price continue to decline, once it falls to the $2,984 level, this whale’s long positions will be liquidated.\n\nAs the market declines, the whale who is long $ETH is on the verge of liquidation!\n\n\n\nHe deposited 12,734 $ETH($40M) to #Compound and borrowed $31.4M stablecoins, with a health rate of only 1.06.\n\n\n\nWhen the price of $ETH drops to $2,984, he will be liquidated.\n\n\n\nAddress:… pic.twitter.com/lP9877HjCJ — Lookonchain (@lookonchain) July 4, 2024\n\nIn the meantime, another whale grabbed 9,425 ETH worth slightly more than $30 million earlier today. @lookonchain stated that it was a fresh wallet. The whale made a purchase of a dozen other cryptocurrencies, including BNB, MATIC, LINK, AVAX and top meme coins, such as Shiba Inu, Dogecoin, Pepe Coin and Floki.\n\nAdvertisement\n\nIn total, it bought and withdrew a whopping $120 million worth of altcoins from the largest cryptocurrency platform, Binance. The Ethereum chunk was the largest among his purchases.\n\nBitcoin price deep in red, Ethereum follows suit\n\nThis week, since Monday, the second largest meme cryptocurrency, Ethereum, has staged a decline of a whopping 10.42% as it has slumped from the $3,500 zone to the $3,150 mark, where it is changing hands right now.\n\nToday, Ethereum plummeted first by 3.03% in a big single red hourly candle. This drop was followed by a marginal rise and then another price decline of 3.09%.\n\nEthereum has been following the recent price decline of the flagship cryptocurrency, Bitcoin, which has been going down heavily since Monday. Analyst Charles Edwards published a tweet, in which he shared that the Bitcoin price keeps going down as major players continue to dump Bitcoin. Mostly, these are miners who are selling freshly mined BTC and their old Bitcoin reserves.\n\nLong-term holders are actively selling their BTC as well. Overall, according to the Glassnode data shared by Edwards, currently, there is a 374,000 Bitcoin negative flow. That is, approximately $24 billion worth of Bitcoin is being dumped on the market at the moment.\n\nThe U.S. and German governments have recently sold several large amounts of both Bitcoin and Ethereum, according to earlier U.Today reports."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOZGJiWnQtdEpOZVZnSkVtaS1VVlI4emRUeWhsTTFWZFgyRzYtRGJmblVMV056ZEhna0llWEFjYlNGZmlnOWNtTnBwNUpKbUNHNm8ybG1BRmw3N3ZiczhNOXc4UDNUVWhTSThMQnp2dHV0R0FoQ1p2eGtKSkNrQUhUTHpOQTVPM1lPNDBhd0hHS3ZialVjNnFHb2p6OThoWXM3emtzcThIRXExazlmaXh6ZkFMaXB1SlRKOEJSWmVCVE5TdzduRnQ2OTA3NXhhSE9mTjV30gHYAUFVX3lxTE1HZTZmOHpOU0pyUFk3YV91U3hNQlNZNDV1WGdLRUxReFJMTHNhV2R5bWFtR19ZNUJ3Mm5FSmw5aTJWS2d0a2NFQ09zWGVXTFpUcTlpOTJ5d0x2SUdqMl9TeUVMS0xuNVQ1a3BBZFQ3Wmk5ckN6SmM5bGQ1ME1KOUpTSUJTWG5Ga2hNZVlPbHBabzgzUGpSbk01ZW8xMXA0aFZPUkFmR081ektYR0FvS2xzYWVJU3pDdDhSbGk4eF9pSkN0M0JubjBReWszQjExRFBod2ZVaWV6RA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Over $370,000,000 in Bitcoin, Ethereum and Altcoins Liquidated in 24 Hours As BTC Briefly Dives Below $57,000 - The Daily Hodl",
        "content": "Options traders are seeing hundreds of millions of dollars worth of losses as Bitcoin (BTC) suddenly plummets below $57,000 and altcoins collapse.\n\nAccording to crypto data aggregator Coinglass, over $379 million in liquidations have occurred in the last 24 hours — nearly 90% of them from leveraged long positions.\n\nBinance, the world’s largest crypto exchange platform by volume, hosted the largest amount of liquidations at $181.38 million, followed by $101.07 million on OKX, $47.06 million on Huobi and $37.72 million on Bybit.\n\nCoinglass reveals that during the last day, $115.59 million worth of Bitcoin was liquidated, the overwhelming majority of them being long positions. Coinglass also finds that $100.76 million worth of the leading smart contract platform Ethereum (ETH) has been liquidated during the same time frame.\n\nOther prominent digital assets that saw large liquidations include ETH rival Solana (SOL) at $17.87 million, meme asset Dogecoin (DOGE) at $6.7 million, layer-1 blockchain Toncoin (TON) at $5.37 million, artificial intelligence-focused project Worldcoin (WLD) at $4.6 million, and BNB at $4.15 million.\n\nIn the past 24 hours, 131,492 traders were liquidated, according to Coinglass. The largest single liquidation order happened on Binance in the ETH/USDT pair for a value $18.48 million.\n\nIn the last 24 hours, Bitcoin traded from a high of $60,584 to a low of $56,836. The top crypto asset by market cap is trading for $57,369 at time of writing, down nearly 5% during the last day, while Ethereum is trading for $3,121.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/wacomka"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxORjVBRnRlZHU0dVdkalZsR056SFdQQWY5TlFtS0ZkYkNKNl9GdmZKTDhhNmVWSDBvbUNfcGV6RUYzbDMxeGhnc1ZJUW1VUXV2eXlBdUt3bmZGQ19DZlFLN3o1UWg0bm9WQzV2TENRMkFqZnNVZGRhR0IwX0JWX3QxVVR4ZVlZeFlSX1pLMkI2RWbSAZYBQVVfeXFMTmdvY05XamR6N21UVWR0aVRLTmZTeXg5dTE1Zjl3YkN2YTVwMzY1MGNKV20ySnh5bEcta2J6eS1CM1pBMmJKYXdQbVdBcFVwTFBqY3dZSlBNQzNKT1lnN1RDSnNRdnI5U0hCaWpQRGlHVnNwLUxCVkZrTjdmVjJzMjExWGQxaHBPVU44cFhMalVDeHllUTZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum slows down as uncertainties around ETFs remain – What now? - AMBCrypto News",
        "content": "In the last two weeks, investors have pulled out $120 million from ETH-focused investment products.\n\nEther spot ETF launch timeline has been moved after the SEC asked issuers to resubmit amended S-1 drafts.\n\nEthereum [ETH] was trading at around $3,448 on the 2nd of July, barely unchanged in the last few hours but in conformance with the generally positive July narrative.\n\nIn the meantime, ETH bulls targeted fresh heights above $3,450 and were betting on upside potential from the hype around Ether spot exchange-traded funds (ETFs).\n\nThe new products, expected to debut in the U.S. later this month, could help propel ETH/USDT above the $3,630 resistance, where it was rejected on the 17th of June.\n\nBullish speculators suffered mild losses on the 1st of July after Ethereum failed to sustain momentum above $3,520.\n\nETH attempted to break out from the descending channel on the 4-hour timeframe chart overnight on the day, but as of press time, has been unable to cement the move.\n\nMarkedly, the latest advance toward $3,500 will not amount to triumph for bulls if ETH is unable to sail above the $3,520 — $3,550 resistance zone.\n\nEthereum institutional uptake\n\nIn its digital asset flows report released on Monday, CoinShares observed that Ethereum investment products posted outflows of $60.7 million last week.\n\nThe figure marked the most significant negative 7-day flow in almost two years, and brought the cumulative two-week outflows to $119 million.\n\nThe report further highlighted that Ethereum was the worst-performing crypto asset in 2024, based on net flows, with—$37 million and—$25 million MTD and YTD flows, respectively.\n\nU.S. Ethereum spot ETF\n\nA U.S. Ether spot ETF has been nigh this summer after the Securities and Exchange Commission (SEC) approved 19b-4 filings of eight prospective issuers on the 23rd of May.\n\nStill, the ETF products are yet to be cleared to go live, pending approval of the S-1 registration statements.\n\nThe latest setback in the approval process has been laid at the door of the U.S. securities regulator. Last week, the SEC reviewed S-1 forms from issuers and requested resubmissions incorporating its comments by the 8th of July.\n\nConsequently, the timeline for the launch of the spot Ethereum ETFs has been pushed to mid-or end of July.\n\nMarket anticipation\n\nLast week, Bernstein analysts Gautam Chhugani and Mahika Sapra forecasted that Ether spot ETFs will see slightly lower demand when they go live, compared to Bitcoin [BTC] ETFs, since they mostly share the same sources of demand.\n\nThe co-authors also cited “the lack of an ETH staking feature” in the approved spot Ether ETFs as a deterrent that could dampen interest in the products.\n\nBitcoin ETFs have thus far attracted $55 billion since their introduction at the start of the year.\n\nThough inflows have waned from the February highs, analyst projections show that the figure is expected to eclipse $100 billion by the end of 2025.\n\nJ.P. Morgan, on the other hand, forecasted that Ether ETFs could see net inflows of about $3 billion ($6 billion if staking is permitted) by the end of the year.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nJ.P. Morgan also expected the market’s immediate reception to be mildly negative, citing possible profit-taking by investors who bought the Grayscale Ethereum Trust (ETHE) in expectation of its conversion to an ETF.\n\nSeparately, in the last week, Bitwise CIO Matt Hougan projected that Ether spot exchange-traded funds (ETFs) would draw in $15 billion of net inflows in the first dozen and a half months."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPR09MNWRPVEVDUnZZblFXNU1ObEtiV24yMzRPLXpnOElDOUVTTVlNWkRVTGtBS3gtam9ldEkzcXVObzF2ZjdHbVI2czBMa0I2b1MyY2lLb1BTQ3lHcW9IUU1Pd3M2ZFVyRmF3aUJaMlp4N0JBcThubGhzUzRrR3p0QS1aUmdwczJjMEdOdWRXTWd0blFQQU9MNktXMWFyaXJXbmFZTlhpZ9IBrAFBVV95cUxNV3Z1QnpycTF1UElsOHFoVGN4eGJEMFVVN3Y3YTFMa0JRazBGSXRYVlp4X2o0Z1JoUV9xMmV2T1dDU1dhWWNoZjYwdmdCdFI3XzF3UVJBZm13ZXpwdVNaRUNScDNEQTZOTHNlZkhhUXp5TzJIa0tFdjI2ZGtUZ016OFRfWXlQeklPNWRjRFo4MFJSNkR1RkluYWw2ajdVVEUwMmgzQUJyVUdOUHd0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Incoming Binance Update Affecting Bitcoin (BTC) and Ethereum (ETH) Traders: Details - CryptoPotato",
        "content": "TL;DR\n\nBinance will terminate trading for six pairs, including BTC/AEUR and ETH/AEUR, effective July 5, possibly due to poor liquidity or other factors.\n\nDespite delisting some pairs, the company has added new ones like WIF/BRL and ZK/USDC, though these are not available to users in certain restricted regions.\n\nBinance’s Latest Move\n\nThe world’s largest cryptocurrency exchange – Binance – will terminate trading services for the following six pairs: BTC/AEUR, ETH/AEUR,AI/TUSD, CHR/BNB, GAS/FDUSD, and LQTY/FDUSD. The amendments will take effect on July 5.\n\nThe company did not provide an exact reason for the delisting effort, reminding that it periodically reviews all listed spot trading pairs and removes some in case of poor liquidity or other factors.\n\nThe majority of the affected cryptocurrencies are in the red today (July 3). Their poor performance coincides with the sector’s overall decline. According to CoinGecko’s data, the global crypto market capitalization is currently standing at around $2.35 trillion, a 3.5% plunge compared to the figure observed the day before.\n\nAs CryptoPotato reported, Bitcoin’s (BTC) price retraced toward the $60K mark, while Ethereum (ETH) dipped to approximately $3,300.\n\nContrary to halting services for some existing trading pairs, Binance recently included some new ones in its platform. WIF/BRL, ZK/USDC, and ZRO/USDC were added to Binance Spot. It is worth noting that the service is not available to all clients:\n\n“Currently, users residing in the following countries or regions will not be able to trade the above-mentioned spot trading pair(s): Canada, Cuba, Crimea Region, Iran, Netherlands, North Korea, Syria, United States of America, and its territories (American Samoa, Guam, Puerto Rico, the Northern Mariana Islands, the U.S. Virgin Islands), and any non-government controlled areas of Ukraine.”\n\nPrevious Binance Announcements\n\nThe exchange has enforced numerous similar changes since the beginning of the year. Last month, it ceased trading services with the following pairs: ALPACA/BTC, NFP/TUSD, MDX/BTC, QUICK/BTC, and XAI/BNB.\n\nA few months before, Binance terminated all operations involving Monero (XMR). The move was followed by a price crash for the popular privacy coin."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNd0RCTkkySzZaNEhzNElkZWJFZVZ2YU1BenQxUG0wcVdSSjBFa3h4dDBWalBGTmlWT1VaMlIxN1FiM1d3U2JRRUpfMGdvYUoyMktQSnRhaEZ6TjBBakpybGVuRnhkRTM3TFR0RGxHWFctYXRjaS1DMlNTQTBmUnlPWDZiam1acHR5TGFhbFZTckdGNTRIWXhod3luR0RWRHRFV1hHSFNSMDlzVS05?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Dives Below $3K: What’s Next For The Crypto? - TradingView",
        "content": "Ethereum price remained in a bearish zone below $3,250 zone. ETH dived below the $3,000 support and even tested the $2,850 zone.\n\nEthereum started a fresh decline below the $3,120 and $3,000 levels.\n\nThe price is trading below $3,000 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $3,000 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct losses, but upsides might be limited above the $3,120 zone.\n\nEthereum Price Dives 8%\n\nEthereum price failed to start a recovery wave above the $3,150 and $3,200 resistance levels. ETH started another decline below the $3,120 support zone like Bitcoin. There was a move below the $3,050 and $3,000 support levels.\n\nThe price declined 8% and even tested the $2,850 support. A low was formed at $2,862 and the price is now consolidating losses. The price is showing a lot of bearish signs and trading well below the 23.6% Fib retracement level of the downward move from the $3,425 swing high to the $2,860 low.\n\nEthereum is trading below $3,000 and the 100-hourly Simple Moving Average. If there is a recovery wave, the price might face resistance near the $2,960 level. The first major resistance is near the $3,000 level.\n\nThere is also a key bearish trend line forming with resistance near $3,000 on the hourly chart of ETH/USD. The next major hurdle is near the $3,120 level or the 50% Fib retracement level of the downward move from the $3,425 swing high to the $2,860 low.\n\nNewsBTC\n\nA close above the $3,120 level might send Ether toward the $3,200 resistance. The next key resistance is near $3,250. An upside break above the $3,250 resistance might send the price higher toward the $3,350 resistance zone.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $3,000 resistance, it could continue to move down. Initial support on the downside is near $2,850. The first major support sits near the $2,800 zone.\n\nA clear move below the $2,800 support might push the price toward $2,720. Any more losses might send the price toward the $2,650 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $2,850\n\nMajor Resistance Level – $3,000"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPekdpNHRuMllkdi1LM0hUb2pjX3F2QVY4VDBvenlMeDVYeGFtZm85TDUzdmpjYkpSREVkRHF5UUxhaV95Umt1N1VSWE9tZW1EUkV2MmdIMmtJM21OSTNGeVlsZ09ZZjZZS0YyUDVtZFZSeVQ3Ni1qU0NlWmt2NG5KV0k0VEwxd3AwTVlOQ1FDQ0RnTXFRUmplRWJwQlRpNmpyZVFYOWRTSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Hops on the Blockchain: How Ethereum Is Revolutionizing the Beer Industry - Washington Beer Blog",
        "content": "Image from pexels.com.\n\nFor many years, beer has been something that helps people relax and enjoy social events. It is also a sign of celebration and an important part of different cultures. However, how beer goes from the farm to your glass can be quite mysterious.\n\nMany people who love their favorite beers do not know much about where these drinks come from, how the ingredients are sourced, or what kind of effect making them has on the environment. This lack of clear information is becoming more and more worrisome for buyers, especially because craft beer is getting very popular nowadays.\n\nNow, let’s talk about Ethereum. It is the second-biggest blockchain platform globally and it can’t be said for sure what will the Ethereum price prediction tomorrow will be. But one thing we know is that its ability to change the beer industry cannot be ignored. This new technology has great potential for changing how we keep records of beer, comprehend its history and relate with those who make it – all in a way that could greatly benefit this thriving sector.\n\nTransparency From Grain to Glass\n\nImagine picking up your favorite IPA and raising a glass, knowing exactly where every hop in that brew was grown – right down to the specific farm, their green methods and even when they were harvested. With Ethereum blockchain technology, this is possible now. Brewers can use this technology to note each step in making beer, starting from getting raw materials like hops and barley all the way to putting the finished beer into bottles.\n\nThis information is then kept safe on a digital ledger that nobody can alter, and anyone can see. People who buy the beer use simple apps to check this data, making sure where their beer came from and how good it is. This openness builds trust between brewers and customers, allowing the customers to make smart buying choices that match their values.\n\nA Toast to Ethical Sourcing and Sustainability\n\nMany consumers now want to support businesses that are ethical and have sustainable practices. Blockchain can be very useful for making sure there is transparency in these aspects. Breweries dedicated to using organic ingredients can place this data on the blockchain, giving consumers verifiable evidence.\n\nAdditionally, this technology has the ability to track the carbon footprint of beer throughout the whole supply chain. This helps breweries find places where they can do better and do less harm to the environment. Picture a world where lovers of craft beer can pick their favorite drink, knowing it was made with little harm to the environment – making both their taste buds and the planet happy.\n\nStreamlining Distribution: Smart Contracts for a Smoother Brew\n\nIn the beer distribution world, there is a complicated web of breweries, distributors and retailers. These parties often face inefficiencies such as errors in orders or invoices due to miscommunication between them.\n\nEthereum’s smart contracts can solve this issue by automating tasks like ordering from the brewery, creating an invoice for the distributor and making payment – all executed without any need for human intervention. This not only cuts down on administrative expenses but also gets rid of mistakes and hold-ups linked to conventional ways.\n\nConsider a situation in which a distributor automatically places an order for more of a well-liked IPA from a brewery whenever the inventory levels decrease, all because of a smart contract. This method greatly enhances efficiency for each participant involved – starting with the brewer up to the distributor and eventually ending at the consumer who receives their preferred beer more swiftly.\n\nCraft Beer Goes Global\n\nFor craft breweries, the main problem they encounter in exporting their beers is the complicated regulations and huge amount of paperwork. Blockchain technology could help with this by creating an easy-to-use system for international trade that guarantees safety and prevents any changes to documents or transactions.\n\nFor small breweries, this might be a game-changer. They can make use of it to enter new markets and distribute their special brews all over the world. Picture a dedicated craft brewer in Seattle smoothly exporting their IPA that won awards to a beer festival in Europe, with blockchain dealing with all required paperwork without any issues.\n\nBig Beer Embraces Blockchain\n\nThe craft beer market is perfect for blockchain, yet big players are also becoming interested. In 2018, it was said that Anheuser-Busch InBev – the biggest brewer globally – utilized Ethereum to monitor advertising details about its Budweiser brand. This shows how blockchain can be beneficial even for the largest businesses in this industry.\n\n“We’re building a company to last for the next 100 plus years and that can only be done by disrupting existing paradigms through innovation and putting consumers at the heart of everything we do,” said Lucas Herscovici, AB InBev’s Global Marketing Vice President of Consumer Connections, Insights and Innovation.\n\n“When we started digging into the potential of blockchain, we began to realize that if Kiip was started today, it would be built on blockchain technology,” said Brian Wong, founder and CEO of Kiip, a leading ad tech and data platform powering mobile advertising. “Blockchain’s magical impact comes in the form of its immutable and decentralized ledger technology. Data that is stored uniquely in thousands of servers can never be manipulated. We saw this technology’s potential to impact several major areas of the advertising world, including supply-chain transparency, campaign data reconciliation and viewability verification. Single Ledger, quite frankly, is just the beginning for us.”\n\nMore recently, Budweiser’s move to purchase the domain name “Beer.eth” for 30 ETH (around $81,000 at the time) and an NFT art piece for 8 ETH (around $21,000) further highlights the growing interest in blockchain within the beer industry.\n\nBrewing a Brighter Future\n\nWhile blockchain technology gives exciting possibilities, there are issues to think about before it can be used everywhere. One main problem is scalability – for example, the Ethereum network sometimes gets crowded and this might make transaction processing slower.\n\nGovernments must solve complex regulatory challenges as they figure out how to fit blockchain technology into current legal systems. And also, it is very important that consumers learn about this technology. Many people still do not know much about blockchain, so brewers must find good methods to explain the advantages of this technology.\n\nA Toast to Innovation\n\nEven with these difficulties, the possible advantages of blockchain for the beer industry are clear. By making things transparent, encouraging honest sourcing and improving the distribution process, blockchain can give more power to both brewers and people who buy beer.\n\nAs technology becomes better and these problems are solved, we can see even more new uses coming up. The future of beer appears very promising, with the addition of blockchain making things clearer, smoother and more fun for all people taking part in it.\n\nImagine a future where breweries can make interactive experiences on the blockchain. This way, people can go on virtual tours of hop farms or join special beer releases with safe token ownership. The chances for fun and new ideas are really without limit.\n\nDedicated to working together, creating new ideas and learning continuously, blockchain technology can change the beer industry greatly. This will make everything more connected, eco-friendly and enjoyable for everyone involved – from the enthusiastic brewers making the beer to those who truly appreciate drinking it.\n\nSo, next time you open a chilled drink, take a short moment to think about the journey it made to be there. Maybe with blockchain technology, someday you’ll even track that path yourself—from “hops on the blockchain” to delightful sips."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQZE1TT09RVGJmbUNicUs2TEdBeDhTU002WDdObEZHNGxBWkZvZEJBNjV4dTJIb2p6dmFVQWZmZG1yYmltMnNqYThUWnVfY2VXMzFPdVJ3U2NPYW9LUkVaQXQwVUtiWHNoZGgteGR1UjY2Mlk5TmQ2Y0VsQkkyTlNCZV84QVZ3Q0NNOGxkZTdCR09oRDc1SUhpeGVZX0VncDZsak5qZXNySkVjQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Crashing: ETH Approaching $3,000 Despite Massive Adoption - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is selling off when writing, looking at the performance in the daily chart. Even though the uptrend remains, since gains of May 20 weren’t wiped clean, there are cracks developing. These fissures are widening after ETH closed below $3,300 today, confirming yesterday’s losses. If the dump continues, the probability of the coin crashing to as low as $3,000 would be elevated, denting sentiment.\n\nAt press time, Ethereum is bearish, breaking below a critical support level. As things stand, Ethereum is down 5% in the last day and week. Since the coin is in red, there have been changes in trend; the coin is sliding on rising participation. Over the last day, the average trading volume rose to over $18 billion. This points to traders flowing in, possibly unloading.\n\nTraders and investors are monitoring the following Ethereum trending news:\n\nGTA 6, the popular video game, reports show that it will support other crypto assets apart from BTC , ETH, and USDT. The expansion of the number of coins accepted is a huge boost as far as adoption is concerned.\n\nCircle and Paxos are now regulated in the European Union, compliant with MiCA laws . Meanwhile, Société Generale, one of the largest banks in France, is launching its stablecoins on Ethereum. More TradFi companies are choosing the first smart contracts platform over modern solutions like Solana.\n\nEthereum Price Analysis\n\nETH/USD is under immense selling pressure, looking at the performance in the daily chart.\n\nWith the drop of July 3 and early today, every high below $3,300 could offer entries for aggressive sellers targeting $3,000 in the short term.\n\nSince the drop was comprehensive, the probability of ETH sliding below $3,000 to as low as $2,800 remains elevated.\n\nNotice that the gains of May 20 are yet to be completely erased, giving hope to optimistic Ethereum buyers.\n\nIf ETH unexpectedly picks up momentum, winding up recent gains, and breaks $3,500, it would be a huge boost for bulls."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQVWZpLUM1dU05SEZlb0dheU04QVJ1ejJnNXdudkdNdklXUEJ2cy1WNm5DZzlzMFVHaU1JUGNGUWROMndEYk5xSkxsMjFVYjNfTTVCNF9NYW9TUW1pMXJQMGxqd3k3eENEY2hCOHduU0J2anZwNElSaHpKUC1udVRzUlNBTlE0MmdaM0syQ0ZvNjNkRWxjUXk0Mzhwb1V5Ulg2bzdLdDAxS255TkotTjZrZkxKTHpMdlI1M25rWV9zSnY2YWV2T205V05ERWVwRkdZNXlqNU8zdXlxcWpZ0gHiAUFVX3lxTE9XWERQTFI2N29wUmVVYjlSYVU5S2pva2Rvc1RybFhRRlhKZmItaGVnVnV5Tk43WnU1MzJFTGVCS09SVUJrRFNIWHhuMTIzUUdkRzJrbzVycjhuWnlMNEJ1YlR0UDVEWWhLUHdqMF9zZGpNellyaEFoTl8yYS1CTTd1X0VGd0NDUlNJVkJpVWQxVVF2MkRMU1NkSU8yMnE3Rmc1UTd1R2Y1b0hmUl8zN1p6ck15RzZULWZtWFJmb3FZcllMTnNWZzJnS3lGdDF3bDlJdW02d19oUE1EU1dXUWRuOXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin struggles around $64,000 level - FXStreet",
        "content": "Bitcoin price encounters resistance around the $64,000 daily resistance level.\n\nEthereum price experiences rejection as it meets the descending trendline around the $3,500 level.\n\nRipple price faces resistance at $0.500, its daily resistance level.\n\nBitcoin (BTC) faces resistance near the $64,000 daily level, leading to a 1.05% decline in trading on Wednesday. Ethereum (ETH) and Ripple (XRP) similarly encounter resistance, resulting in 1% and 0.5% declines, respectively.\n\nBitcoin price finds hurdle around the $64,000 level\n\nBitcoin price was rejected by the daily resistance level at $63,956 on Monday and trades down 1.05% at $61,488 on Wednesday.\n\nIf BTC's price closes above the hurdle at the $63,956 daily resistance level, it could rise 5% to retest its next weekly resistance at $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are below their neutral levels of 50 and zero. If bulls are indeed returning, then both momentum indicators must regain their positions above their respective neutral levels.\n\nIf the bulls are aggressive and the overall crypto market outlook is positive, BTC could extend an additional rally of 6% to revisit its weekly resistance at $71,280.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes below the $58,375 level and forms a lower low in the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 3% decline in Bitcoin's price, to revisit its low of $56,522 from May 1.\n\nEthereum price experiences rejection by the descending trendline\n\nEthereum price was rejected by the descending trendline on Monday and is now 1% lower on Wednesday, reaching $3,386. This descending trendline is drawn from joining multiple swing highs from June 9 to July 1.\n\nIf ETH breaks above the descending trendline around the $3,500 level, it could rise 5.5% from the breakout point to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are below their neutral levels of 50 and zero. If bulls are indeed returning, then both momentum indicators must maintain their positions above their respective neutral levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick closes below the $3,240 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 12% crash to the previous support level of $2,862.\n\nRipple price struggles at the $0.50 level\n\nRipple price currently trades at $0.483, below the daily resistance level of $0.50.If Ripple's price surpasses the barrier at $0.50, it could rise 7% from $0.50 to $0.532, its previous high from June 5.\n\nIn the daily chart, the Relative Strength Index (RSI) is currently below the 50 mark, indicating neutral to bearish sentiment, while the Awesome Oscillator (AO) remains below zero, suggesting bearish momentum. Both indicators must rise above their critical thresholds of 50 for RSI and zero for AO for a sustained bullish trend. Such a development would bolster the ongoing recovery rally in the market.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT daily chart\n\nConversely, if Ripple price daily candlestick closes below $0.450, marking the June 7 low, it would invalidate the bullish outlook by establishing a lower low on the daily chart. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNUFZOWDFkbjA2ZE50dU1SY0FXMGpMVElLRU9meTdsS3NuNjRkR19NMm9SVVUxZVNYQ2dGNU12amtpc3lLQjlXdWJTQUREcFY4S2xoMER0eWtZTHpicGNVM2FjMU03R19hVjA0LUlXRDFuUjk1VWRFVTNWWDBJSmZSN0phZVF6R3N6NUFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs vs. Bitcoin ETFs: How Their Approvals Differ - CoinGape",
        "content": "The Securities and Exchange Commission (SEC) recently approved a spot Ethereum ETF, bringing jubilation to the crypto community. This development follows the approval of Bitcoin ETFs which took place slightly over a year ago. Both approvals are important milestones for the digital assets, but the differences in processes and implications of Ethereum and Bitcoin ETFs are notable. Let’s explore the differences between these two significant approvals and their implications for the future of cryptocurrencies.\n\nBreaking Down the Approval Processes\n\nWhen the SEC gave a go a head for the operations of spot Bitcoin spot ETFs, the event was embedded in the history of the cryptocurrency world. The acceptance signaled Bitcoin’s shift from a specialized virtual asset to a commonly-used investment option.\n\nadvertisement\n\nInvestors now have the opportunity to access Bitcoin through a regulated product, without requiring digital wallets or unregulated exchanges. This endorsement confirmed Bitcoin’s status as a valid asset category and established a model for upcoming cryptocurrency offerings.\n\nSkipping ahead to May 2024, the SEC’s endorsement of spot Ethereum ETFs takes a different path. Despite being a significant milestone, Ethereum’s approval is overshadowed by continued discussions regarding whether it should be classified as a security.\n\nIn contrast to Bitcoin, Ethereum has faced regulatory challenges on its approval journey, which aligns with ongoing talks about regulating digital assets, indicating a more complex regulatory landscape.\n\nEthereum ETF vs Bitcoin: Market Reactions and Investor Sentiment\n\nThe market saw an instant and significant impact following the approval of Bitcoin ETFs. Bitcoin price increased dramatically, and the amount of trading rose as both institutional and individual investors showed interest in the innovative investment option.\n\nThis response highlighted Bitcoin’s position as a top digital asset and showed how cryptocurrencies can blend with conventional financial systems\n\nEthereum’s approval has similarly generated excitement, with Ethereum price rising beyond expectation. The potential introduction of Ethereum ETFs promises to broaden its investor base and enhance market credibility.\n\nHowever, the exact timeline for these ETFs and the participants involved remain uncertain, creating a dynamic environment for ETH’s price and market behavior.\n\nNavigating Regulatory Terrain\n\nBitcoin’s Regulatory Hurdles\n\nThere were challenges in approving Bitcoin ETFs. The SEC investigated to prevent market manipulation and ensure investor protection. Bitcoin’s strong market presence and increasing attention from institutional investors were key factors in overcoming regulatory hurdles, despite the difficulties faced.\n\nEthereum ETF Unique Regulatory Landscape\n\nThe regulatory journey of Ethereum has been somewhat complicated. This is because, unlike Bitcoin, the wide range of applications offered by platform, has an ongoing debate on how to classify the ETH.\n\nThe complexity of Ethereum ecosystem which includes non-fungible tokens (NFTs) and decentralized finance (DeFi), is demonstrated by the approval of its ETF by the SEC. This decision shows the need for a more advanced regulatory approach in the changing world of digital assets.\n\nEthereum ETF vs Bitcoin: Implications for the Future\n\nThe acceptance of Bitcoin ETFs set an important standard for investing in cryptocurrencies. It showed that digital assets could be included in traditional financial products, opening the door to upcoming advancements and regulations in the industry.\n\nOn the other hand, the approval of Ethereum’s ETF highlights the increasing importance of its wide range of uses. Apart from simply being a digital asset, Ethereum’s participation in DeFi and NFTs showcases its ability to spark more innovation in the financial industry.\n\nThis approval may speed up integrations and developments, strengthening Ethereum’s significance in the changing crypto environment.\n\nLooking Ahead: Challenges and Opportunities\n\nThe approval of cryptocurrency ETFs signifies a major step forward in incorporating digital assets into traditional finance. These advancements are anticipated to stimulate creativity and broaden the applications of cryptocurrencies, impacting market trends and investor actions.\n\nThe timing and authorization of these ETFs also indicate more general political and regulatory factors. As the regulatory landscape keeps changing, focusing on centralization and establishing strong frameworks will be crucial for maintaining the expansion and adoption of digital assets.\n\nConclusion\n\nWhile both Ethereum and Bitcoin ETF approvals mark important milestones, their differing paths highlight unique aspects of each cryptocurrency’s journey toward mainstream acceptance. As the crypto market evolves, these approvals will play a pivotal role in shaping the future of digital asset investments and their integration into traditional financial systems."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE12aXpORUxJSUxFejJTRTZubjh0QzA4Q0VmYzhQcFRYa19VQUptbHU0Q0U3YVg1MThPalo5LUUzSHlxM25Xc3NiZGdsN2FiUG5fTFM4Z0E1T19vZnlWTWR6dTdhRW9TNVA1ejE0Mks3dEI2QTd6S21fUDM4V1M5M03SAYQBQVVfeXFMTlh0ZTdSMzd3Mko2cjZxU29TMzE1WFpYNkpJMUVTZjY0Qm5IYzN0a0hLRS0zb0ZBS1o2ejdwV0xjNG9Ra3UtaFJLT0t5d0VjaG41SmFlZUltVHZQa29kVHk2MmdiaFdEX2xLSXBQem9ZM0JBSEVjd2U3ZUU3T0ZERnYwMFhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Set to Launch on July 15: Will This Trigger an ETH Bull Run? - CoinGape",
        "content": "Heading into July, the primary concern within the crypto community centers around the anticipated launch date of the spot Ethereum ETF for trading. According to Nate Geraci, president of The ETF Store, Ethereum ETFs are expected to become available for trading as early as July 15th.\n\nGeraci stated that with the revised S-1 submission for Ethereum ETFs to happen in July, the final S-1 approval from the SEC could arrive around July 12. Thus, July 15, Monday, would be the most probable day to begin trading Ether ETFs.\n\nadvertisement\n\nWen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th. via @emily_graffeo @olgakharif pic.twitter.com/NG8xhtCP21 — Nate Geraci (@NateGeraci) July 3, 2024\n\nIssuers to Address SEC Query On Spot Ethereum ETF\n\nLast Friday, the US SEC returned the S-1 filings to issuers to address some minor questions. Sources familiar with the matter stated that the issuers have been already working on it. As we know, in May, the SEC approved the 19b-4 filings to list the Ether ETFs on exchanges. However, they can only go live for trading after the SEC approves the S-1 submissions.\n\nSteve Kurz, head of asset management at Galaxy Digital, expected the Ether ETF approval in the next couple of weeks. Speaking to Bloomberg TV on Tuesday, July 2, Kurtz said:\n\n“This is window-dressing, the SEC is engaged. We’ve been doing this for months now. We did it for the Bitcoin ETF, the products are substantially similar — we know the plumbing, we know the process.”\n\nNow the bigger question in everyone’s mind is will the Ether ETF prove to be a strong catalyst to drive the crypto market higher?\n\nAlso Read: Why Are Ethereum Institutional Products Depleting Before ETF Launch?\n\nEthereum to Outperform Bitcoin\n\nOn Tuesday, K33 Research published a report stating that Ethereum would be outperforming Bitcoin post the ETF approval. As per K33, the launch of Ether ETfs would absorb nearly 0.75% to 1% of all ETH in circulation within the initial five months. This expectation is in line with that of Gemini which predicted $5 billion inflows within the first six months of launch. K33 senior analyst Vetle Lunde said:\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader.”\n\nThe ETH/BTC ratio steadily declined from 0.056 after the Bitcoin ETFs launched, reaching 0.046 by May 24. However, unexpected news that the SEC would soon approve Ethereum ETFs boosted the ratio back up to 0.055.\n\nAlso Read: ETH/BTC Price Prediction: ETF Hype, FOMO and Ethereum Price Imminent Rally To $5,000\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5XdW5lc2ZKcEhPV3d2djJCTWRUakJFWFNXbFZsbF9rS0hRQnlhQWZwRDl2QV96bGhVN3BJdWJuRWlGT3p1SmVlOGxpeVU3V3N2ZUFkUkJzaGwzcmZoSTcwQ2RzYWE5MWwxV3NoT2xTNkN1dDY0ZHlsUWZReGFiZ9IBgwFBVV95cUxORWt0cmRJTy1sYmd6eVh3NlN6eXBBNGZhLUMxY3JMRHZoWGhBVnZVLWVjbjNnXzYtVXJQV280aTE0RkY5ZFBiU2p1RlJvdUR4ZWNVVDZCeUhhR3hXX0tKVkl0enlMRWh3aXRXOU5idklXeVlEb0Y2Y3lTOXlCeFQ2aUh1RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Whale Faces Liquidation, ETH Price Nosedive - CoinGape",
        "content": "A significant Ethereum whale is on the brink of liquidation due to the ongoing decline in ETH prices. This whale has deposited 12,374 ETH to Compound and borrowed $31.4 million in stablecoins. If Ethereum’s price drops to $2,984, the whale’s long positions will be liquidated.\n\nCurrently, Ethereum is trading at $3,124, down from the $3,500 zone earlier this week. This 10.42% decline since Monday has intensified concerns about the whale’s potential liquidation. The situation worsened today with a 3.03% drop, followed by a marginal rise and another 3.09% decline.\n\nadvertisement\n\nEthereum and Bitcoin Prices Drop Sharply\n\nThe crypto market is seeing significant activity among large holders amid this price downturn. Another whale recently acquired 9,425 ETH worth over $30 million from Binance. This fresh wallet also purchased a variety of other cryptocurrencies, totaling $120 million in altcoins.\n\nAs the market declines, the whale who is long $ETH is on the verge of liquidation! He deposited 12,734 $ETH($40M) to #Compound and borrowed $31.4M stablecoins, with a health rate of only 1.06. When the price of $ETH drops to $2,984, he will be liquidated. Address:… pic.twitter.com/lP9877HjCJ — Lookonchain (@lookonchain) July 4, 2024\n\nThis large acquisition includes BNB, MATIC, LINK, AVAX, and top meme coins like Shiba Inu, Dogecoin, Pepe Coin, and Floki. The ETH purchase was the largest among these transactions. These moves are drawing attention as they occur during substantial market volatility.\n\nEthereum’s price drop is closely following Bitcoin’s recent decline. Bitcoin has been falling sharply since Monday, driven by sales from major players and miners. Analyst Charles Edwards noted that long-term Bitcoin holders are actively selling their BTC.\n\nGlassnode data shared by Edwards indicates a 374,000 Bitcoin negative flow. This translates to approximately $24 billion worth of Bitcoin being dumped on the market. Additionally, the U.S. and German governments have recently sold significant amounts of Bitcoin and Ethereum.\n\nAlso Read: Dogecoin Whale Bags 90M Tokens Amid Market Crash, What’s Next For DOGE?\n\nETH Price Drop Could Trigger Liquidations\n\nThe potential liquidation of a giant Ethereum whale could have broader market implications. If Ethereum’s price falls to the critical $2,984 level, it may trigger further sell-offs. This could exacerbate the current downtrend and lead to more liquidations.\n\nThe ongoing selling pressure from Bitcoin is also affecting the overall market sentiment. As major holders and governments offload their assets, it creates additional downward pressure. Investors are closely watching these developments to gauge the market’s next moves.\n\nMarket analysts are providing varied perspectives on the situation. Some believe the whale’s liquidation risk underscores the fragility of highly leveraged positions. They argue that such scenarios highlight the importance of risk management in volatile markets.\n\nOthers are focusing on the broader market dynamics at play. They point to the influence of Bitcoin’s performance on Ethereum and other cryptocurrencies. As Bitcoin faces significant sell-offs, it drags down the entire market, including Ethereum.\n\nAlso Read: US Government Shifts $14M Bitcoin Amid $BTC Dip, New Selloff Incoming\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQSlQyRnd6UVVFRFNfT2dKbEFiSmw1QVllejI0ODBDVXlmZDdmamFoc0pNTGpQdzF1RldXRjVOY0c0bHI2WDcySXFDTU80TExja2psMTNWVEE3d2t4dDV6bFVrbU82WXVmT0d4QTc4ZFRaVUNDTFUzVzlBSEF6eUt1YU5KUFVzS3J2NVFZOXRadS04dURUdDlDR1ZlbkZhOUFwaUFPY3pyXzlqb2lZTWJhX29nRnlsblNPV3RGTVBLa2F0dW1hMEpNREpQQ09UdzJ1QVZEWnkyZlg1X3VaZ1RUVjk3UjV5d9IB6wFBVV95cUxPdnYwLUt2eENNQWhmTnNlWXNIV3NxSktOc21GNjI3eUF5LUpJZmlhSjVlamNKMklrRGtTcE10UW5ldDBjWkRuNUhUQmRPY0JYTDBYUzVtUVduYmxRZUpEVTVfUFQyMTlmUG9OZGF1bnBVN1dtQmJxWVY3Y1JUTEtNZ2FUVmtsSUhOaHhOVW1aYWJJYVNnazNCanZXdEZjeXNTeFYzZ05YNzc4WFBOUVJyUzlKSk5iVGhLY2oyZmc2bk5mYnItcVhuT0NZX00tOEg1bnA5M1dLcUExRWlleEhYY2tydVpmVnVWbzh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Outperform Bitcoin (BTC) After ETF Launch, Foreseeing Strong Inflows Equaling 0.75-1% of Supply Post-ETF - Crypto News Flash",
        "content": "K33 Research says that Ethereum spot ETFs will accrue up to 1% of the Ether supply, or $4 billion, pushing ETH to outperform Bitcoin, which faces selling pressure as Mt. Gox creditors get refunded.\n\nThe firm says that ETH is trading at a steep discount against BTC but noted that Ether’s futures interest was soaring, indicating that traders are accruing the altcoin on high leverage.\n\nK33 Research says Ethereum spot ETFs will change the game for the largest altcoin, making it a better investment than Bitcoin.\n\nThe Norwegian analytics company, formerly Arcane Research, says that most investors don’t realize Ether’s vast opportunity. This is reflected in its continued suppressed price, even as the green light for the launch of the ETH ETFs edges closer.\n\nThe company believes that once the ETFs launch, they will quickly rack up around 1% of all circulating Ethereum, equating to 1.2 million ETH, or $3.86 billion. It stated:\n\nWe maintain a bullish ETH outlook in anticipation of net inflows equivalent to 0.75-1% of ETH’s circulating supply in the five months following the launch.\n\n🚀 #Ethereum (ETH) set to outshine #Bitcoin (BTC) post-ETF launch! 💹 K33 Research: 'We maintain a bullish ETH outlook in anticipation of net inflows equivalent to 0.75-1% of ETH’s circulating supply in the five months following the launch.' Get ready for a bullish ride! 📈… pic.twitter.com/SB9fTggK9M — Collin Brown (@CollinBrownXRP) July 3, 2024\n\nMarket experts have yet to come to a consensus on when the SEC will nod to the ETH ETFs. As Crypto News Flash reported, some, like ETF Store President Nate Geraci and Consensys’ Jimmy Ragosa, believe the approval will be in mid-July. Others believe it’s towards the end of the month, while a few others believe the SEC’s move to return the applications with its comments will lengthen the application process beyond July.\n\nAll analysts concur that these products will forever change Ethereum regardless of the timeline. American exchange and custodian says they will rack up $5 billion in the first six months, while K33 Research has a slightly more conservative estimate at $3.86 billion.\n\nThe firm said:\n\nETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader.\n\nCan ETFs Push Ethereum Beyond $5,000?\n\nBitcoin ETFs launched in mid-January, and two months later, the top coin hit its all-time high just below $74,000, dragging the entire market with it. Ethereum soared to $4000 at the time.\n\nAnalysts believe that a similar effect will take place once ETH ETFs launch. However, according to K33, ETH might “stumble immediately following the launch of the ETFs” from the “sell the news” phenomenon. However, they expect it to pick up pace immediately and, by the end of the year, hit new heights.\n\nK33 says it’s surprised that more traders aren’t accumulating ETH in anticipation of the coming surge. Year-to-date, the top altcoin has only gained 45%, around the same as BTC and lower than BNB and other lower-cap altcoins.\n\nHowever, those in the derivatives market are catching on. Data shows that ETH futures open interest has been surging “relentlessly” as more traders take on higher leverage to buy ETH in anticipation of the price rise.\n\nEthereum trades at $3,313 at press time, dipping 3.5% in the past day.\n\nRecommended for you:"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQQUgtWXFob3QwVkxmQmQ3dUJPMUgyOHhIVHg2UjZxcFJkeXlWUnVGOElJYjJZNFBrbnVRQms1ZGNPdVhTV3NfZmhROHFOR0lQWTk3QThmQURCMmY2RVVGMWhLRmVlcllZcGo0VU1PYzZxeUxNYUZtQkFOSEhWck0yVkEtOWMtbmRIckNLZXVPRTZxOUhBZ1UwYmx5cU5ZV2lsV2MwNUs5WDVkZXM1SUhpaHBoNzVsOWlxUkhJb2dldmZscjJwSTIwQjE2SElMbkl0X1FF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin In The Red Again, Analyst Reveals Downside Target - Benzinga",
        "content": "If #Bitcoin breaks $60,600, it could climb another $1,000 to reach $61,600! But if $BTC dips below $60,200, then $59,200 will be the target. pic.twitter.com/aONlUXjfjY"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNRTR1SWxWM0xkZ0RpQV9yMUhQYWlQLTJINFVOYlh2QzlfTkx0ZHp2REZ2bkhmRVNzS2ZxQS1YTXB4UVlidEVTTW41eVRTOEFTUVlENnBHZ3RJZlcwT2Zlc3ByZVAtMks3a0oxeHA1UEdXalNWT2V3TjhXQzlUeDBhQ09QaVdPODlXekhGUV80ZkM2ekNJTTBQaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Falls 10% In Bearish Trade - Investing.com",
        "content": "Investing.com - Ethereum was trading at $2,898.17 by 23:12 (03:12 GMT) on the Investing.com Index on Friday, down 10.25% on the day. It was the largest one-day percentage loss since November 9, 2022.\n\nThe move downwards pushed Ethereum's market cap down to $360.89B, or 17.62% of the total cryptocurrency market cap. At its highest, Ethereum's market cap was $569.58B.\n\nEthereum had traded in a range of $2,896.05 to $3,108.66 in the previous twenty-four hours.\n\nOver the past seven days, Ethereum has seen a drop in value, as it lost 12.95%. The volume of Ethereum traded in the twenty-four hours to time of writing was $20.66B or 21.95% of the total volume of all cryptocurrencies. It has traded in a range of $2,896.0498 to $3,522.0027 in the past 7 days.\n\nAt its current price, Ethereum is still down 40.42% from its all-time high of $4,864.06 set on November 10, 2021.\n\nElsewhere in cryptocurrency trading\n\nBitcoin was last at $55,408.9 on the Investing.com Index, down 6.05% on the day.\n\nTether USDt was trading at $1.0002 on the Investing.com Index, a gain of 0.09%.\n\nBitcoin's market cap was last at $1,104.18B or 53.90% of the total cryptocurrency market cap, while Tether USDt's market cap totaled $112.45B or 5.49% of the total cryptocurrency market value."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZDV5YXlMS01kQUktRHliT2ZFakxpWGdkR0NWMDVMOVotOWhlUGltLWU3XzVFMExSTmxGdGVsVl82SEtyTy1SSjVpQ3ZrSUhUSDBoUFdxLUh4a0dWVlZhdkxRUnJJZm9OdXhqdDY3UnBJTE5LaEN6NlFQbVFleE5FR1lMRnltcl96d3ZoNDhaTUVhUGdIZENKYVdxWTcxRWV1YnpLeUFxVmZTMlNSa2t5Rm9BOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Drops 15%: Will Spot ETF Catalyze Demand, Driving ETH Above $3,700? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum, following the performance of Bitcoin, is in red on the last trading day. ETH is bearish, at least from a technical perspective, but bullish from a fundamental standpoint. This position will only change if there is a convincing close above local resistance levels, the first being $3,700. Gains of June 29 and 30 were welcomed, but for this trend to evolve, there must be confirmations; this is missing at press time.\n\nPresently, Ethereum is in red, sliding nearly 15% from May highs. Though traders are upbeat and expecting gains, movements are tight in the daily chart. So far, Ethereum is down 3% in the past day and relatively stable in the last week of trading. Meanwhile, the average trading volume remains low, at just over $10.8 billion.\n\nTraders are closely watching the following trending Ethereum news:\n\nUniswap, one of the leading DeFi protocols on Ethereum, will be releasing the Uniswap extension in the coming week. More people will engage with the mainnet through this tool, driving up demand for ETH.\n\nConsenSys, the developer of MetaMask —a non-custodial wallet, has been charged by the United States SEC for allegedly enabling the trading of unregistered securities. At the same time, the development company has been sued for facilitating the staking of ETH without registration.\n\nEthereum Price Analysis\n\nThough the crypto and the broader Ethereum community are watching out for the United States SEC to approve the trading of spot Ethereum ETFs, price action remains muted for now.\n\nETH/USD is under pressure, looking at price action in the daily chart.\n\nAccordingly, traders may choose to short on every high below $3,700, targeting $3,300 in the short term.\n\nEven so, in light of the spot Ethereum ETF expectations, long-term traders might choose to buy and HODL. This preview is valid as long as prices trend above $3,300.\n\nAny decisive close below this level will invalidate the general bullish preview, permitting ETH sellers to push, angling for $2,800.\n\nThis position will be valid, especially if the bear breakout bar below June lows is with rising trading volume."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPRzBKODBxM2t0REdQMUVweEF5TjhCaGpiXzRvdlIyeUsyWk9DaGV3TmtoXzlKdXg0UE1kd215QVMtanlvOEgyQmNvcE16UUQ0NVg4UVNzZG5jcHJhck1GeHZlNFFweUV0Z2ZXVmphdF9XWHhBbHo5MFI4MlRnYjdEQ09MeXk4RGFaWG1hcVVB0gGTAUFVX3lxTFBIeXVfVWhsWVExOHBlNTlqcnlxN1ZudGphZy10SXROaDBHNlRYV1czQ20wamVUMS1ZSW9ZeWNQVDRnUVJhS0o1aHVmbkF1NzlhczBtVFd1ZVRpOWVpY09hME96OUZuemVqcmNTbkFXU3ZJM0pST2t5ZXJ0QWpIdlNDOHZFMFlxZkt6Vm90SjkzVHBUMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum dApp volume jumps 92%, but ETH bulls need to be careful - AMBCrypto News",
        "content": "Activities related to NFT trading and staking ensured the rise in dApp activity.\n\nWhile new demand for ETH fell, withdrawals from exchanges jumped.\n\nEthereum [ETH] stood out from the many blockchains available after its dApp volume increased by 92.43% in the last seven days. For context, dApp stands for decentralized Applications.\n\nThey are applications that operate on a blockchain network while using smart contracts to power trading and user interaction. In most cases, low transaction fees bring about a surge in volume.\n\nEthereum beats BNB Chain, others to the spot\n\nThis is because users do not have to pay exorbitant fees to facilitate the exchange of tokens or transfers. However, during Ethereum’s era of high transactions fees, there were time it outperformed other chains in this regard.\n\nBut this time, the dominance could be linked to the cheap gas fees enabled by the Dencun upgrade which took place in March. At press time, Ethereum’s dApp volume was $71.13 billion.\n\nThis value was much higher than BNB Chain, Polygon [MATIC], and the Tron [TRX]. However, one thing AMBCrypto noticed was that it was not an all-round increase with the applications.\n\nFor example, dApps like Blur, EigenLayer and Uniswap [UNI] NFT Aggregator registered notable hikes. However, others including Uniswap V2 and V3 could not match up as they noted declines.\n\nThis data suggested that there was a lot of NFT trading and staking that impacted the rise in volume. But trading of tokens on the blockchain were nowhere near those heights.\n\nTherefore, it was not surprising that there was a notable decrease in the network’s UAW. This is an acronym for Unique Active Wallet. It is a term used to measure user engagement and activity.\n\nIf it increases, it means that user activity is high. But a decrease suggests a fall in active transactions, and that was the case with Ethereum.\n\nETH caught in between two sides\n\nMeanwhile, ETH’s price changed hands at $3,365 which was a 2.32% decrease in the last 24 hours.\n\nAs it stands, the price of ETH might continue to experience a decrease or trade sideways despite optimism that the token would perform well this month.\n\nOne reason for this prediction is Ethereum’s Network Growth. According to AMBCrypto’s analysis, the blockchain’s Network Growth was down to 23,300.\n\nThis metric measures the number of new addresses making their first successful transaction.\n\nIf the number increases, then the blockchain is getting good traction. However, a decrease implies that adoption is low, which seems to be the case with ETH.\n\nHistorically, when Network Growth rises, it does not take long for ETH’s price to jump. The opposite happens when the number of new addresses fall.\n\nAs mentioned before, it is possible to sell ETH drop from $3,300 in the short term.\n\nDespite the bearish outlook in the short term, the long-term looks promising for ETH. This was because of the Exchange Net Position Change on Ethereum.\n\nThis metric tracks the 30-day supply of cryptocurrencies held in exchange wallets.\n\nWhen it increases, it means deposits on exchanges are rising, increasing the likelihood of sell-offs. However, a decrease means withdrawals, and tilts toward fewer selling pressure.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAccording to Glassnode, ETH holders have been removing their assets from exchanges for some months. If this continues, it could provide stability for ETH’s price.\n\nSo, ETH could target hitting $4,000 this quarter or surpassing its all-time high."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQVnlqZWJscURWb2xLN0dwcGtTWWMtdno3d0JfMFN4OUhfWkZnWkdORlU5ODBuc3FDODRVa29pM3l2QWI0N0FyMEw4VG4zUzJlMmRxLW82bVZ2WU51ZXU4cWlyR0xtSGpKdy10dGxnVWI1b1lxMWhSc3hhSXpRUG91MTFmZnFnbFdtUmlhbVlKTGfSAZYBQVVfeXFMUEhKVGR4MXhtRWlOSTg1ZEV1MzB3QU9zQUVmc0xLcWdfdXBGdTJuemg4cXl1cW42YTVvYWRWS2dCOFF4cTJCQlIxOXFQOURkRTdIU2x2THNkVE14Rkp5NkNPMWk5eWI5TWJsMjFDR2IyekNJSTZZQXdkV0gxSUZuMTJXTmx4bnROV2dzMDV1R1NIT0pEUWln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum, Bitcoin & XRP Lead $1.5B Crypto Scam Losses, What’s Happening? - CoinGape",
        "content": "The first half of 2024 has been marked by a surge in major hacks within the cryptocurrency space. Ethereum (ETH), Bitcoin (BTC), and XRP have led the crypto scam losses amounting more than $1.5 billion. This year, over 200 significant incidents have resulted in approximately $1.56 billion in losses.\n\nCrypto Scam Losses Hit $1.5B\n\nAccording to Peck Shield Alert data, only $319 million of lost crypto funds have been recovered. Moreover, the losses this year represent a staggering 293% increase compared to the same period in 2023, where losses amounted to $480 million.\n\nadvertisement\n\nFurthermore, DeFi protocols have been the primary targets for hackers. They account for 59% of the total stolen value. Over 20 public chains experienced major hacks during this period. Moreover, Ethereum, Bitcoin, and XRP topped the list for the amount lost via crypto hacks.\n\nIn addition, Ethereum and BNB Chain were the most frequently targeted, each accounting for 31.3% of the total hacks. Meanwhile, Arbitrum followed with 12.5% of the attacks. One of the most significant incidents occurred on June 3, 2024.\n\nDMM Bitcoin, a major Japanese cryptocurrency exchange, reported a substantial breach. The attackers stole 4,502.9 BTC, worth over $300 million at the time. This incident highlighted vulnerabilities within exchanges, especially those handling large volumes of digital assets.\n\nAlso Read: XRP News: Whale Shifts 63M Coins As Ripple Strengthens Case\n\nMajor XRP, ETH, BTC Hacks\n\nA week after the DMM Bitcoin attack, on June 10, UwU Lend, a decentralized finance (DeFi) lending protocol, was compromised. The breach led to a loss of approximately $19.3 million in digital assets. This hack underscores the ongoing risks associated with DeFi platforms, which often operate with less regulatory oversight. The platform then offered $5 million reward for catching the hacker.\n\nEarlier in the year, on February 3, 2024, Chris Larsen, co-founder of Ripple, confirmed a major security breach involving his personal wallets. Initially, there were rumors that Ripple itself was targeted. However, Larsen clarified that the hack involved his digital wallets and not Ripple’s corporate assets.\n\nThe hackers managed to transfer a whopping 213 million XRP tokens, valued at approximately$112.5 million. Moreover, on-chain detective ZachXBT first alerted the community to the suspicious transactions. In response to the theft, Larsen and various crypto exchanges took swift action to mitigate the impact.\n\nMultiple exchanges, including MEXC, Gate, Binance, Kraken, OKX, HTX, and HitBTC, collaborated to freeze a significant portion of the stolen funds. Binance alone froze $4.2 million worth of XRP to aid the investigation.\n\nMoreover, on April 2, 2024, FixedFloat, a Bitcoin Lightning-based exchange, experienced a security breach. Unauthorized transactions led to financial losses exceeding $3 million. This incident highlighted recurring security issues for FixedFloat, following a similar breach earlier in the year.\n\nThe company also faced significant challenges in securing its platform against repeated attacks. Moreover, in February, hackers stole $26 million worth of Ethereum and Bitcoin from FixedFloat. These digital assets were then dumped to exchanges to realize profits.\n\nAlso Read: Ethereum Leads Bitcoin By 2x In Network Fee Revenue, Thanks to Layer-2s\n\nKritika Mehta Kritika boasts over 2 years of experience in the financial news sector. Currently working as a crypto journalist at Coingape, she has consistently shown a knack for blockchain technology and cryptocurrencies. Kritika combines insightful analysis with a deep understanding of market trends. With a keen interest in technical analysis, she brings a nuanced perspective to her reporting, exploring the intersection of finance, technology, and emerging trends in the crypto space.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZ0JIUVNFa2lMUmttUlhJa1N5MDJXQXp6dkFHb0M1cHVxbWpPSzBhTGdVRllNMDBRaDJ6MkJhZXBZQ0pqbWR0RmtxWGIwVjFVZXJaSHhwc0d1TGY5bmFmbW5iLUlLdVYzdjg5ZmxQS1JNN1V0MF9BVi1QYmdGYnFBbmFPdExJSl9FMjlLeDZaa2UtVjjSAZgBQVVfeXFMTTJPc1E1dWFXd3huTTZhVGsta2Nfd1hxLUxpc1RUS2QyekwyZFZiUTBMTkREYk1tcWhiOExYOS02TXFUMkpJVEwxRFh6UzFGMTl4VEFOTjcwN3B5cy1XTFQxc04yQXc3ZU1hbExKbVUzMHRCdlp5V1BHZmd2NmNmaDkwWlVGUWM4OWQwUFF4N2Q4OC1yeGc2MTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Files Amended S-1 for Ethereum ETF Ahead of Launch Deadline - CoinGape",
        "content": "Bitwise has filed an amended S-1 form for its Ethereum exchange-traded fund (ETF) just days before its July 8 deadline. This move indicates that the product is nearly ready for launch. Analysts predict that these ETFs could begin listing within the next two weeks.\n\nBitwise Submits Amended S-1 for Ethereum ETF\n\nBitwise’s updated registration form was submitted on Wednesday. Analysts suggest that these products be listed by mid-July. A source close to the situation indicated the SEC might approve the final drafts by the end of next week.\n\nadvertisement\n\nThe SEC approved 19b-4 forms for eight spot Ethereum ETFs, including Bitwise, on May 23. However, issuers need their S-1 statements to become effective before trading can begin. This two-step process has kept the market eagerly awaiting the launch.\n\nDespite the light comments on the S-1 forms, the SEC has taken its time to get approvals. A single problematic issuer may need to be on time to process. Nevertheless, expectations remain high for a launch this month.\n\nAlso Read: Federal Reserve Forecasts “AI Will Be Deflationary” To Boost Economy\n\nAnalysts Confident in Near-Term ETF Launch\n\nBloomberg ETF analyst James Seyffart noted the frequent amendments in S-1 forms. He expects more filings from other issuers throughout the week. This pattern suggests a coordinated effort to meet regulatory requirements.\n\nUPDATE: We've got another amended S-1 from @BitwiseInvest for their #Ethereum ETF. Expect more from other issuers throughout the rest of the week. We're thinking these things could potentially list later next week or the week of the 15th at this point. pic.twitter.com/xqVlt9lSGy — James Seyffart (@JSeyff) July 3, 2024\n\nSenior Bloomberg ETF analyst Eric Balchunas expressed surprise at the SEC’s slow pace. He speculated on possible reasons, including summertime vacations. Despite this, he confirmed indications of a launch this month.\n\nThe SEC’s return of S-1 forms with light comments suggests minimal hurdles remain. Analysts view this as the final round of feedback. This has increased confidence in a near-term launch.\n\nBitwise made significant updates to its S-1 form. One notable change includes waiving the sponsor fee for the first $500 million assets. However, the firm still needs to disclose the fee after this threshold.\n\nAnother issuer, VanEck, also announced that fees would be waived initially. These moves suggest competitive strategies to attract initial investors. By waiving fees, these firms aim to lower the entry barriers for new investors.\n\nThe recent amendments highlight Bitwise’s proactive approach to regulatory compliance. The firm’s updates reflect a strategic positioning ahead of the anticipated market entry. This aligns with the broader trend among issuers to streamline their offerings.\n\nAlso Read: US Lawmaker French Hill Doubles Down On Trump’s Pro-Crypto Stance\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQR3FQc2NYbHlKZjUwNGlyTkpuclgzRUtpTGRSeC1YblU3WHVYbnEtV1puTk5ORktwLXFRZUp5X1EzRUNvR2dIc0diTjE0YlhWRkNHSzhYY2pnNjg5ZmJBUmZEUkNQSWRNRGVwaUZfeWpMa1ZSbU5xcXdKenlnczYtXzBTblk1eHFONW5FU2lhVXpnNEFTRGY2ZS1lSUdjRFdXQlEzSGkzY29xZmJONXphSVpPUDZVQVZBSUc4eDQ4TVA5WUxZc1hoTlNRY0FZcW1GX1hVNm9BRDFMNDRMeWlwc0dR0gHvAUFVX3lxTE5CYlpfbFNZUDcwWHNHakluckhja2NBUlBVY2J3Zk1nS2tmZjhZQng4RHNSdzN0Y1NIem0xSE56REJqSUdSdG14WjkxM0RkZERVY1pvSlVERjc0YmtDRzJlMzdoTGtfM0RVTGJodkhHcUhfUFBaMnFfTVFLVHE1Ni1HRDREaGt0SUJlWGVBUlZ3WGJUYlJ2cU5nVzFRX2FnWTlyU3A2OTZGbmtuODZtVHdybGJfYnotdHpjbzNqQnpOWWU3QUU2dDlJYUNodFBXeFF5aXJkdF9Cb0RrakhRUEJZOHhJQmxabEltWWk3bXhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) And Cardano (ADA) Ready To Take Charge, But Analysts Pick Presale Star As The Best Crypto To Buy - Outlook India",
        "content": "Analysts Back Presale Star, KangaMoon, To Lead the Bull Market\n\nAlthough the top altcoins are preparing for a bull run, the attention of most market experts has been on KangaMoon. KangaMoon first caught the attention of industry experts in presale, where it raised over $8 million and onboarded more than 32k users. The resilience shown by KangaMoon during the recent market dip is one of the reasons market experts are bullish about this new altcoin."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOcE1kQ0dpZG9ZVlpzU3A5MEJuaHVKclRUN2FDanlQQzdiSmFfclVpTmt3dGRUTHh0cEVVMEV2SlZpaXFfQ1NBa2txb0EtM2xqRm5yMFM0c1hfSDhTWnZLZ3Z0dC1IU0I0UUhVYnc2S2lnM3RoV3lQYkU0c1RWaVlBazZEY2pvNHRtTjc5RjJqR3pZM3lfYnfSAaMBQVVfeXFMT1kzS0VvNnFuRXBSU2RfQzlWNm5vMUZRanBUWDB5cXRnbXJlLXBVSEEyOGJaZjI4LVpmSzJ0NEUyWTJTT1IwLUswemlNMzNQeVh1cldDNVZ5STZ3c1pfMWJXWmJlVjk4MWVNR3g1bnIzcDIwVDd6MTBtLTRvOXlDME16a18yRHR3bnBtRFYtdjB3M25YQzFuVUxCWjV6aVhXd0FfTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Stumbles to US$3,357; Drops 1.71% - Analytics Insight",
        "content": "Short-term Analysis\n\nIn the short term, Ethereum price movement suggests a cautious outlook. The 1.71% decrease in the last 24 hours, coupled with a bearish MACD and a nearing oversold RSI, indicates that sellers currently dominate the market. However, the approach towards the first support level at US$3,347.7 could attract buyers, potentially stabilizing the price and providing a platform for recovery.\n\nMedium-term Analysis\n\nOver the medium term, the 1.05% decline over the past week reflects ongoing bearish sentiment. The support and resistance levels will be crucial in determining the next phase of price movement. If Ethereum holds above the first support level and manages to breach the first resistance level, it could signal a shift in momentum toward a more bullish outlook.\n\nMarket Sentiment\n\nThe overall market sentiment for Ethereum remains mixed. While the current technical indicators point to a bearish trend, the approaching support levels and near-oversold RSI suggest the potential for a rebound. Traders and investors should closely monitor these key levels and technical indicators to make informed decisions."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOMjdSdm41S3owc3VoQTFmTkFRQ3VHeWNkMExnTVlLWmQ2ZkhHbUJmbmdVT0FyQ2s4eEJ5SkxiVGlyV1NocEV2X0xSYWE2Z1kyQ05uQ3Z5SzdBbFYtc0VpdkxkWlJ3Q25TeHZMQmdobXJxdWQtczVtbFhTaGYwV2RMUDQ0dU5YV3NiMW5GMk8zMmZ6X2NfbHM1a015dFdsYVUxVndpWGNyWHJzbFNEWFFia1lUckI0cDlH0gHGAUFVX3lxTE94ei1sclFlSERodjFQdElsOTY4d3owVzJxeWNqbUkyZURBczAxYjZOeXNNMFRCdThPNHJpc0hWNjNkZk9Rd2FJYTZkcUtrb2NrX0ZCRm1MR2VmTUNUenk5UFgwNmh1RENSeTA4eGcyVkdjX2dIUFB6MkFyM3JCd3ctS1lyaE9BWjhjUUtPcHJBNG54c2FqN0JWdW9nTWdMeUxJU3I0S1ZUNmo2LUJmSklJcVg0UzlzVVNBTkVmVUVGZEI1WmtQQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum's Performance Hits A 2-Year Low - Investors Focus On Emerging Cryptos - Outlook India",
        "content": "Players who complete any of these tasks will receive $PLAY tokens as a reward. The players who earn the most XP will be at the top of the list and receive extra $PLAY tokens as a prize. This gamification strategy has not only increased user engagement but also driven demand for the token. PlayDoge raised over $5.3 million so far, so hurry up and invest!"
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxObmVHSmZzOUo3dnRXTGxtWWc5cTdNWXo4T25LM1d6eGQwV0ZtNlFyN2paSjBwRk95RW1SaExJQ09NRnRPUGNTbDlKSUVhWVI1cFRrYTQ1eWJESnowRW5CNDVzQUJJZzRad2pKSnhyc1ZWWXY0WXRmMkgxR29GcWNYWmQ0TzlxQUIzMTJydko3bU3SAZYBQVVfeXFMTVFkdF9VQkkyYmlBZ2tWcktWeGxSR2NHMG9tVEZ3eHRMMUl5c2tVcWloenM1cGN2blBHTFJkc2J0MWF1MjJPQUVpMWhfUTl2NkNWT3FWRTFVTWZXMm42ODJSYmt4dFY1T1VUNmdkX2ZzS2tWb1lEdnlhZGI5QTNDeEJXaDdSNm5rbEFzM0docDZoZ294Zjdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Lido dominates staked ETH market, but can it lift Ethereum’s price? - AMBCrypto News",
        "content": "Lido outperformed Ethereum in terms of fees earned in the last few days.\n\nDespite interest in staking growing, the price of ETH declined.\n\nLido [LDO] has managed to outperform Ethereum [ETH] in the last few days in terms of fees earned.\n\nLido showed growth\n\nIn the last month, Lido Finance collected $20.8 million in fees in just one week, which was higher than the fees collected by Ethereum itself, which collected $19.8 million during the same period.\n\nThis impressive performance placed Lido Finance as the second-highest fee earner within the cryptocurrency space for that week, behind only Tron [TRX], which had earned $33.7 million.\n\nLido Finance’s momentum continued throughout the month. Over the entire month, Lido generated $98 million in fees, representing an 8% increase compared to the previous month.\n\nThis strong fee generation is likely due to Lido’s dominance in the staked ETH market. At press time, Lido held over $33.4 billion in total staked assets, commanding a 29% market share in staked ETH.\n\nLido’s total value locked (TVL) jumped 1.36% this week, reaching $33.48 billion. This surge was driven by a wave of new ETH staking deposits, with 95,616 net new ETH staked through Lido in the past seven days.\n\nWhile the 7-day stETH APR dipped slightly by 0.04% to 2.96%, there were positive signs elsewhere.\n\nWrapped stETH (wstETH) bridged to Layer 2 networks saw a significant rise of 7.19%, bringing the total to 141,586 wstETH.\n\nArbitrum [ARB] held the majority with 65,290 wstETH, followed by Optimism [OP] at 27,879 wstETH. Both networks experienced minor declines in the past week.\n\nThere was also a slight increase in wstETH deposited in lending pools and liquidity pools, reaching 2.70 million stETH and 83.5k stETH respectively.\n\nwstETH bridged to Cosmos networks also saw a small uptick, reaching 1,788 wstETH up 2.12% in the past week.\n\nHowever, the 7-day trading volume for (w)stETH dipped 7.25% compared to the previous week, totaling $1.23 billion.\n\nWhile Scroll saw a significant increase in wstETH up 86.26%, other networks like Base, Polygon, Linea, and zkSync Era experienced minor declines.\n\nWhat happens next for ETH?\n\nThe popularity and growth of the Lido protocol hints at the fact that users are increasingly showing their interest in staking ETH.\n\nRealistic or not, here’s LDO’s market cap in BTC’s terms\n\nEven though ETH’s price may be stagnating at the time of writing, a surge in staking implies that existing users believe in the long-term potential of ETH.\n\nAt press time, ETH was trading at $3,336.23 and its price had declined by 3.15% in the last 24 hours."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5UUlFHM3ZCSUwtRUZWclA2VFotY3NWZ0ZXS3JCWFdnYWI0T181dS01X09wbE91TFV2NWxQRDg3QWdaTnAxTW0ybmJjMlZpSFFGN002QUxfTHBubDRONkhyeU1sOV8yU1l3UDZIcWw1SFYtdExV0gF6QVVfeXFMUDd3MzVTYzEyXzlKNEtwMEd5aDljcnBCSW54MjI2X19wRVUtSzFzMWtXR29TMXVLYzY4aEhJU3YtVGYtc3FIbmdCOF9GQjMwLVpNUVpYVW8ydkxZYkZMeEM4UUpjc2NJMnhBNHdZU1l6QUZEY2VRek5ZbXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 03:29:54 GMT",
        "title": "Ethereum Price Plummets: Potential Recovery Hindered by Bearish Pressure - NewsBTC",
        "content": "Ethereum price failed to clear the $3,520 zone and started a fresh decline. ETH dived below the $3,250 support and even tested the $3,150 zone.\n\nEthereum started a fresh decline below the $3,320 and $3,250 levels.\n\nThe price is trading below $3,250 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $3,325 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct losses, but upsides might be limited above the $3,320 zone.\n\nEthereum Price Takes Hit\n\nEthereum price failed to continue higher above the $3,450 and $3,420 resistance levels. ETH started another decline below the $3,320 support zone like Bitcoin. There was a move below the $3,250 and $3,220 support levels.\n\nThe price declined 5% and even tested the $3,150 support. A low was formed at $3,156 and the price is now consolidating losses. There was a move above the $3,200 resistance level. The price is now testing the 23.6% Fib retracement level of the downward move from the $3,426 swing high to the $3,156 low.\n\nEthereum is trading below $3,300 and the 100-hourly Simple Moving Average. If there is a recovery wave, the price might face resistance near the $3,250 level. The first major resistance is near the $3,300 level or the 50% Fib retracement level of the downward move from the $3,426 swing high to the $3,156 low.\n\nThere is also a key bearish trend line forming with resistance near $3,325 on the hourly chart of ETH/USD. The next major hurdle is near the $3,365 level. A close above the $3,365 level might send Ether toward the $3,450 resistance. The next key resistance is near $3,500. An upside break above the $3,500 resistance might send the price higher. Any more gains could send Ether toward the $3,550 resistance zone.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,320 resistance, it could continue to move down. Initial support on the downside is near $3,200. The first major support sits near the $3,150 zone.\n\nA clear move below the $3,150 support might push the price toward $3,080. Any more losses might send the price toward the $3,050 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,150\n\nMajor Resistance Level – $3,320"
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOdjhjVHIxT1N0NS1YbUExaHJBd3ZEVHp1cWZyWmFYQlNFc1JnbWpNbUdOTjNHdW82TTRHR3h6WXRVTk5pblpxa1E4Y1NFSWhzSWhqbEdvNlNqaGZxR2VKbF8yUE0wVm41XzdFQjZra25GZFJhMG1fMTRrbkJ0T01lM3dTakY1MEJZbEZ4TzJGU0lHRklHWWk1U0RtemtodHpDSEFRaDBtSlhDUG9mc0xFbEw5SVZjVzFSbmtlbUJn0gHDAUFVX3lxTE5OTXRaM09McnNJSWphRl9tR1hEd2J0eEZOZktyVng0ZS1GSUphYjA0SGVhQUt6bzRSZTNjVU1jR0xVZW00Zm5hV0doTnNSb1A4V3lmZnd6SXRKd3RLRlJzN3FqWWZUaVROM2NhNXZEN2QwMjdUWU1KZzA3Z1ZjcEM1dGhKa1RmY19EMU5DOTlmc0JTeVdlbkc4OVUwLTBlMlZmeElGc0paSFJYc3VqZ1NkbFdxVTdwMmtETHJzcC00OFN3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set to Eclipse Bitcoin: ETFs Could Catapult ETH to New Heights — K33 Research - NewsBTC",
        "content": "As the global financial markets prepare to launch U.S.-based spot Ethereum exchange-traded funds (ETFs), Ethereum is positioned to potentially outperform Bitcoin, according to a new analysis by K33 Research.\n\nThis comes amid concerns that Bitcoin might face downward pressure due to upcoming repayments to creditors of the defunct Mt. Gox exchange.\n\nRelated Reading\n\nETF Launch to Begin a New Era for Ethereum\n\nEthereum has lagged behind Bitcoin in performance over the last year, with the former surging 67% while the latter by 95%, but that might be about to change with the anticipated launch of Ethereum spot exchange-traded funds (ETFs) in the United States, expected in the coming weeks.\n\nAnalysts Vetle Lunde and David Zimmerman from K33 Research suggest that introducing these spot ETFs could be pivotal for Ethereum’s valuation.\n\nDespite a likely initial dip post-launch, they forecast that inflows into these funds will propel Ethereum’s price over time, drawing a parallel to the earlier impact of Bitcoin’s spot ETFs, which attracted billions of dollars in inflow after launch.\n\nThis optimism is rooted in the belief that ETFs will catalyze significant capital flows into Ethereum, mirroring the influx seen with Bitcoin.\n\nThe analysts project net inflows amounting to 0.75% to 1% of Ethereum’s circulating supply within five months post-launch, potentially setting the stage for substantial price appreciation. The analysts noted:\n\nETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader.\n\nWhen Will ETH Spot ETF Launch In The US?\n\nDespite the analysts’ bullish outlook, the market appears skeptical, as evidenced by Ethereum futures trading at a discount relative to Bitcoin futures, as highlighted in the K33 Research.\n\nRelated Reading\n\nExperts Eye Spot Ethereum ETF Launch By Mid-July, Predict Price Rally 2 months ago\n\nEthereum is trading at around $3,312, reflecting a 3.3% drop over the past day and conceding with the ubiquitous decline in the crypto market.\n\nIn the broader context, the crypto industry is enthusiastic about Bitcoin and Ethereum ETFs. Nate Geraci, president of The ETF Store, highlighted that amended S-1 forms for Bitcoin ETFs are due before July 8, with approvals potentially finalized by July 12, paving the way for a mid-July launch.\n\nWen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th. via @emily_graffeo @olgakharif pic.twitter.com/NG8xhtCP21 — Nate Geraci (@NateGeraci) July 3, 2024\n\nConcurrently, Steve Kurz from Galaxy Digital expressed confidence in a Bloomberg interview that Ethereum ETFs would receive approval within July, underscoring the structured and familiar regulatory process drawing from experiences with Bitcoin ETF applications.\n\nFeatured image created with DALL-E, Chart from TradingView"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOcGEwMHpOV0NhMDdMVkZvNW94Qlk5NWJtV0J2dFNMR2FtWVhhZW5pUS1mdnpsUFpaVWZSdUliSzh6dGFtMkZWNTU1V3RxRDRFN0VQSkNWMzlJQkl2dlN1aldYNjNBOVltVTA2b1QzNWUyb0pwaUgwQzBONDJmZy16X2VpY0x6eko3WFRjMzlZaHg1Zlo0bmfSAZsBQVVfeXFMTVBjQjVqazhsTFVoRWh5Z0JwbVItb0V1OVo5YWlCZEFtVnktelNYOVk2NFhZZC1HaW5nc3BSQlVwei1yUzZWS2F2ZVQ3eURBOVlvcm9RR2c1VTBBX3U2WHpTdVRJR0ZYeEYtUUZCZjZrSmFQQ0lYNy1oUkRRSTdzOS13ekVvRF9xc3lNWm9TVy05bnVELW1rbTdELVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Doomsday for Ethereum? ‘A Crash Down To $1,500 Is Coming,’ Says Skeptic, Here’s Why - NewsBTC",
        "content": "The crypto market is currently navigating through a turbulent phase, particularly for Ethereum, which has seen a significant downturn of nearly 15% in its value over the past week.\n\nAmid this negative price performance, Peter Schiff, a well-known economist and a skeptic of cryptocurrencies, has chosen to add salt to the wounds by projecting a stark prediction for ETH. According to Schiff, Ethereum could plummet to as low as $1,500, marking a substantial decline from its current levels.\n\nRelated Reading\n\nShiff’s Bearish Outlook And Community Reaction\n\nSchiff’s prediction comes when Ethereum is trading below the previous crucial support of $3,000 mark, a sharp 30% fall from its peak above $4,500 in March.\n\nThis decline coincides with heightened speculation surrounding the potential launch of an Ethereum spot exchange-traded fund (ETF), which seems to have triggered a premature sell-off among investors instead of propelling the price.\n\nSchiff’s commentary suggests that the market’s response to the ETF rumors has been to liquidate positions rather than hold, adding further downward pressure on Ethereum’s price.\n\nHe expressed his view on Elon Musk’s social media platform, X, stating, “It looks like those buying the Ethereum ETF rumors couldn’t wait for the fact to sell,” indicating a market driven by speculation rather than sustained investment confidence.\n\nWhile Schiff’s bearish outlook has garnered attention, it has also sparked a mix of skepticism and agreement within the crypto community. Users have expressed varying opinions on social media platforms, with some questioning the technical basis of Schiff’s $1,500 target.\n\nOthers humorously noted that Schiff’s pessimistic predictions often come at market bottoms, suggesting his views might inadvertently signal a buying opportunity. For instance, one user remarked on the irony of Schiff’s timing, indicating that his bearish predictions could contradict market sentiment indicators.\n\nthx for your inputs you do realize you only become relevant on this side of twitter as a bottom signal lol youre like those acoustic wif kids who had a stroke on stage the wif party as a top signal — agent pretzel (@agent_pretzel) July 5, 2024\n\nEthereum Faces Critical Juncture\n\nEthereum is experiencing a significant downturn, trading at $2,975—a 4.2% drop over the past day. This decline and Bitcoin’s similar trajectory have led to a 4.1% reduction in the global cryptocurrency market cap, erasing more than $200 billion in value.\n\nAccording to Coinglass, this downturn has triggered substantial losses for traders, with 207,020 liquidations in the past day, totaling $576.53 million. Ethereum-related liquidations account for $134.58 million, predominantly from long positions.\n\nWhile Peter Schiff’s outlook may seem too pessimistic amid these market conditions, another voice in the crypto analysis sphere, Inspo Crypto, offers a slightly more moderate view.\n\nHe notes that Ethereum’s price has fallen to early May levels and suggests that the next 8-hour trading window could be crucial in determining the market’s direction.\n\nRelated Reading\n\nAnalyst Predicts Ethereum Nosedive, Cautions Investors To Prepare For $2,700 Target 2 months ago\n\nIf Ethereum can rise above these levels, it might potentially ease the bearish trend. However, failure to reach the $3,170 mark (which it already has) could lead to further declines, possibly down to $2,700, exacerbating losses across the altcoin market.\n\n$ETH has broken down below $3,170. The next 8 hours (1D candle) will show whether the bulls have given up or not. If the price retraces back above, we should consider this a deviation. But if $ETH instead retests the lower trend channel next at $3,170 unsuccessfully, it could… pic.twitter.com/1msfKQBf2v — InspoCrypto (@InspoCrypto) July 4, 2024\n\nFeatured image created with DALL-E, Chart from TradingView"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPZGdMZ1B0TjJUUlFPemhyNDUyU18tSFA4dXNvTXFjTHRrUVZDOE1XcWJBRlRpSndiVXVzNzlGZUxqQTRWNlRIUFlrWDQ5MEdBMmFVbHJURFdOTGx6bllqSXpaUHNUa1dJLWp4MlJqUlY5U3p0ekZLWVl5SVJENFhPR3lZNGlLUHczRE5HcndCQk_SAZYBQVVfeXFMTUxuRTk0cWpDUGczT2NaRWxKRDJzTlZHTXhHZDhHcHNNZTUzd0tLaDNpZmF0RkxNbzM0V1JEREJzWEtOWElqVlFmMG0yTTlSdVJFdl9xdm5EVm1peE9vMWRpcUxoQUNnbl9rQW11MmladnMtYW1FNC1aM0NfUEY3TnphY0pFTlpzX1Z6Qmhkd3F6eHVmQkpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 09:34:28 GMT",
        "title": "Experts Eye Spot Ethereum ETF Launch By Mid-July, Predict Price Rally - NewsBTC",
        "content": "The crypto industry is on the verge of a potentially significant development as key figures in the sector hint at the imminent approval of a spot Ethereum ETF in the United States, possibly triggering a notable price rally for ETH.\n\nNate Geraci, president of The ETF Store, shared insights into the expected timeline for the launch of the first spot Ethereum ETF.\n\nAccording to Geraci, current forecasts by Bloomberg predict a mid-July launch. He detailed the procedural timeline via X, stating, “Wen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th.”\n\nIn parallel, Steve Kurz, head of asset management at Galaxy Digital, confirmed to Bloomberg on July 2 that the U.S. Securities and Exchange Commission (SEC) might greenlight a spot Ethereum ETF before the month’s end.\n\nRelated Reading\n\nETH Price Dips As Ethereum ETF Approval Faces Delay 2 months ago\n\nKurz emphasized the extensive groundwork laid in collaboration with the SEC, drawing parallels between the proposed Ethereum ETF and Galaxy’s existing spot Bitcoin ETF (BTCO), created with Invesco. Kurz expressed confidence in their preparedness, remarking, “We know the plumbing, we know the process… The SEC is engaged.”\n\nBloomberg ETF analyst Eric Balchunas also chimed in, aligning with the mid-July expectations. He highlighted the SEC’s recent instructions to Ethereum ETF issuers for amending their S-1 registration forms by July 8, suggesting possible further amendments. Notably, the SEC approved rule changes under 19-b4 in May, facilitating the listing and trading of such funds, though the issuance of funds remained pending final approvals.\n\nEthereum Price Holds Above Key Support\n\nThe anticipation of these approvals appears to be having a stabilizing effect on Ethereum prices. Crypto analyst IncomeSharks, commenting on Ethereum’s current price trajectory via X, noted optimism for a near-term breakout, stating, “ETH – Looking more optimistic for a Q3 breakout. Liking the chances of a run towards $4,000 this or next month.” According to the chart shared by him, ETH price needs to hold the region of $3,300 to $3,350 in order to rally to $4,000.\n\nSupporting this sentiment, Cold Blooded Shiller highlighted the crucial need for Ethereum to demonstrate momentum at the current price levels, specifically around the $3,400 mark, as a key indicator for a potential high-time-frame impulse.\n\nRelated Reading\n\nEthereum Suffers 3rd Straight Weekly Outflows, Becomes 2024’s Worst Performer 2 months ago\n\n“ETH is still in a fine position but it really needs to start showing some momentum soon. LTF divergences around this $3400 low are probably where I take one stab at trying to capture any HTF impulse away from the consolidation,” he remarked via X.\n\nAdding historical perspective, analyst Jelle (@CryptoJelleNL) compared the current market phase to Ethereum’s long consolidation in 2016-2017 before its massive rally, urging persistence and optimism: “In 2016-2017, ETH consolidated for 50+ weeks before rallying nearly 12000 percent. Today, people are giving up after less than 20 weeks, with ETH ETFs right around the corner. Stick to the plan boys. The best is yet to come.”\n\nAt press time, ETH traded at $3,353.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    }
]