[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE52Z0ZEQThIcS0tNzZ6M1VuNlhVS1Q0T1p6Q0J2aDJkdjJFY0xqS2dUa2ZvanVVQWJTN21BU0ZQNzBaaTJoclNRTGdIbkRmN2xTNWRqWUxubTVoWWRzSmpieUN5bkxzam5VanItVUVrZGF4SDMxbmRNQWllb2E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Franklin Templeton's Ethereum spot ETF listed on DTCC - Crypto Briefing",
        "content": "The listing represents a preliminary step in the trading process, yet it does not ensure that the SEC will grant approval for the fund.\n\nShare this article\n\nFranklin Templeton’s proposed spot Ethereum ETF has appeared on the Depository Trust and Clearing Corporation’s (DTCC) new securities list with the ticker EZET. This development occurred just a day following reports of the SEC’s probable rejection of spot Ethereum ETF applications.\n\nThe DTCC listing represents a preliminary step in the trading process, yet it does not ensure that the SEC will approve the Ether Spot ETF. The SEC’s decision on the fund remains pending.\n\nFranklin Templeton filed for spot Ethereum ETF in February, joining other industry giants like BlackRock, Grayscale, VanEck, and ARK Invest, in the race. However, the outlook for Ethereum-based funds is not as promising as it was for Bitcoin-based predecessors.\n\nBloomberg ETF analyst Eric Balchunas estimates there is only a 25% chance of SEC approval for a spot Ethereum ETF. He cites a noticeable absence of engagement from the SEC, contrasting with the Bitcoin ETF approval process. Balchunas interprets this silence as a deliberate ‘tactical’ decision rather than mere ‘procrastination.’\n\nJPMorgan analysts anticipate a protracted delay in the regulatory approval of the spot Ethereum ETF, though they suggest that approval could eventually follow a legal challenge similar to Grayscale’s lawsuit, which compelled the SEC to reassess spot Ethereum ETF applications.\n\nMeanwhile, Ethereum’s market performance has stagnated post-Bitcoin’s fourth halving, with its price staying between $3,100 and $3,200, according to CoinGecko. At press time, Ethereum is trading at around $3,100, down 1% in 24 hours."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOSjdnMWRBQm55d1YtcTFFc0NkSWc5bE9LWlBqS2V6blMyMjJ5SzNQRVVRcGJHOGdFYWVDTUxfQk1GQnRFRTVZTng4Q1NqeW1qVmlrYldCdThwdXRKb0NzWGV1WDdRVW9XSTJjS1lFeEd3RmJXU3EyaG9tYWZoazJvX09kWXA4cGtUc3RkRGl5R3dPN0x5Q1ZKR2pjcG81UUYzeUw4dUdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Consensys sues to stop SEC from ‘seizing control of Ethereum’ and damaging MetaMask - DLNews",
        "content": "Crypto stalwart joins industry offensive regulator moves to legally define Ethereum.\n\nSEC signalled it is poised to make a move on MetaMask.\n\nStaking is new front in legal war between DeFi and Washington.\n\nConsensys has joined the anti-SEC brigade.\n\nOn Thursday, Consensys, the company behind the popular crypto wallet MetaMask, sued the US Securities and Exchange Commission for allegedly waging a “campaign to seize control over the future of cryptocurrency.”\n\nThe firm, which is led by Ethereum co-founder Joe Lubin, has locked arms with Coinbase, Greyscale, and the Blockchain Association in the vanguard of crypto industry stalwarts that have challenged the agency’s three-year campaign to clamp down on digital assets.\n\nIn the process, Consensys hopes to protect its own position and one of its crown jewels — MetaMask, a wallet provider with 30 million users.\n\nAd hoc enforcement\n\nConsensys alleged the SEC is unlawfully deploying “ad hoc enforcement actions against Consensys and others.”\n\nIn its lawsuit, which was filed in federal court in Texas, Consensys said the SEC is trying to legally define Ethereum as a security.\n\nThe move alarms industry players because it would force projects to register Ethereum-linked tokens the same way traditional firms do with stocks and bonds.\n\nFor the crypto community, this is anathema because they consider blockchain-based assets as a separate class that deserves its own statutory regime, and rules and regulations. This idea is at the heart of Coinbase’s defence against a lawsuit brought last year by the SEC.\n\nJoin the community to get our latest stories and updates\n\n“The SEC’s unlawful seizure of authority over ETH would spell disaster for the Ethereum network, and for Consensys,” read the complaint.\n\nNew front\n\nStaking has opened a new front in the battle between the SEC and the industry since Ethereum switched to a Proof of Stake consensus method for maintaining its blockchain in 2022.\n\nThe SEC has been on a warpath to define Ethereum as a security ever since the network introduced staking that year.\n\nStaking refers to earning rewards from a blockchain network by locking up a cryptocurrency to support the network’s validating nodes.\n\nA person familiar with the case explained that the crypto company had considered several options before moving to file.\n\nCertain elements of the SEC’s investigation into the Ethereum protocol compelled Consensys to defend itself and the ecosystem before the Commission did any real damage, the person said.\n\nConsensys’ complaint came after the SEC notified it was preparing to sue the firm over MetaMask, one of the industry’s most widely used crypto wallets.\n\nThe SEC alleged in its notification that given MetaMask’s “swap” and “stake” features, which let users trade cryptocurrencies and earn rewards on their holdings, Consensys is operating as an unlicensed broker-dealer, according to the filing.\n\n‘Ethereum is not a security’\n\nConsensys says the non-custodial wallet is akin to a web browser rather than a trading platform like an exchange.\n\n“Any investigation or enforcement action premised on Consensys operating as a ‘broker’ under the Exchange Act through its MetaMask wallet software would exceed the SEC’s authority,” said the complaint.\n\nThe crypto firm is asking the court to find that Ethereum is not a security, a move that would ripple across the industry.\n\nThat’s because the SEC has made a series of legal attacks against some of the biggest firms in the industry.\n\nCoinbase, the publicly traded crypto exchange, and the SEC are locking horns after the commission alleged that Coinbase is also operating as an unlicensed broker and exchange.\n\nEarlier this month, the SEC notified Uniswap, crypto’s largest decentralised exchange platform, that it was operating as an unlicensed broker.\n\nNow, the SEC appears to be turning to peer-to-peer protocols and applications.\n\nLiam Kelly is a Berlin-based DL News’ correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPZWREMXM5NnoxSFNPT3AxV3o5dUNURDRTVDBuYmdmYllyQkJ6UGxXZnFvMGR5VmJ0SWxpVEhLNGg5VHZqU1hrQ0JJTzdMVkpaaTQzcWlMNTdrQ1JOMm1xTHdETWp5NjU3QlpvTE96RUh5aVJkTEhhQXBqZUdnbjFFQnlJWTZFTWRsanhGdFVNakhPZ0I0YlFSNWFTZmZ1MzZqNkx1enY4OVNYM2VWdGJ1YnliRDBzY3YwNndtOWJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Metamask wallet developer Consensys files lawsuit over SEC’s claims that ETH is a security - Ledger Insights",
        "content": "Yesterday blockchain development firm Consensys filed a Texas lawsuit against the Securities and Exchange Commission (SEC) and its Commissioners, arguing that the SEC is unlawfully claiming that Ethereum’s ETH token is a security. The lawsuit also seeks an injunction preventing the SEC from taking legal action against MetaMask, Consensys’ popular cryptocurrency wallet with more than 30 million monthly active users.\n\nSome redacted parts of the text are worth exploring as they could imply that the SEC has issued some confidential ruling or internal guideline that ETH is a security. Apart from the redactions, the lawsuit explicitly states, “The SEC’s investigation into transactions in ETH is predicated on a determination that ETH is a security.”\n\nFounded by Ethereum co-founder Joe Lubin, ConsenSys is backed by numerous traditional finance (TradFi) firms. These include HSBC, JP Morgan, Mastercard, Microsoft, Softbank and UBS.\n\nMetaMask wallet\n\nConsensys was first informed about the SEC’s interest in MetaMask in April 2022 and has provided considerable information since then. On April 10 Consensys received an SEC “Wells Notice” warning of an imminent enforcement action. This was on the grounds that the SEC believes the MetaMask Swaps and Staking services violate federal security laws because Consensys is not a broker dealer.\n\nConsensys argues it is simply providing a user interface enabling access to other services such as decentralized exchanges (DEXs) and staking protocols. The SEC has also sent a Wells Notice to Uniswap, the leading DEX.\n\nWhile it’s a different jurisdiction, Europe’s latest anti money laundering (AML) legislation imposes requirements on crypto asset service providers, but explicitly excludes self-hosted wallet providers such as MetaMask.\n\nDid proof of stake make ETH a security?\n\nBack in 2018 there was much debate about whether or not ETH was a security. One lawyer in the crypto space raised questions about the patterns in the ETH ICO and concluded it probably was*. However, just a few months later, SEC Director William Henman delivered a high profile speech in which he said ETH was a commodity.\n\nConsensys is understandably unhappy that the SEC has flip flopped on this position. However, since then Ethereum has changed by moving from proof of work to proof of stake (the Ethereum Merge). This involves validators locking up cryptocurrency and earning a return in exchange for helping to secure the blockchain. Based on this, the SEC also targeted Consensys’ sales of ETH from its treasury and asked why Consensys considers these are not sales of securities. Additionally, Consensys received three subpoenas relating to the Ethereum Merge.\n\nIt’s not the only one that relied on the ETH being a commodity. The CFTC continues to say ETH is a commodity. As a result TradFi crypto players such as EDX Markets – founded by Fidelity, Citadel Securities and others – only trade Bitcoin, ETH and Litecoin. No license is required for spot trading of commodities.\n\nWhat’s in the redactions?\n\nConsensys’ statement that the SEC has taken the position that ETH is a security, combined with redactions in the text, indicates that the SEC’s stance appears to have formally changed.\n\nHere’s one redaction: “The SEC’s self-aggrandizing about-face on ETH is notable for its lack of transparency. In April 2023, Gary Gensler, the Biden Administration’s crusading SEC Chair, appeared before the House Financial Services Committee. The Committee Chairman repeatedly asked Gensler: does the SEC now think ETH is a security? Gensler refused to answer this direct question from the Chairman of the Congressional committee charged with overseeing his agency. He did not want to admit that his SEC had already secretly cemented its power-grab by issuing an <redacted>.”\n\nElsewhere in the text it states, “ETH is not a security under the Securities Act, and therefore <redacted> exceeds the SEC’s statutory authority.”\n\nOn the basis of the first redaction, we quizzed ChatGPT to see if it could fill in any blanks. The suggestions it came up with were :\n\ninternal memorandum\n\ndirective to staff\n\nconfidential ruling\n\nclosed-door decision\n\nclassification guideline\n\nenforcement action plan\n\npreliminary determination.\n\nIf, as Consensys implies, the SEC had already made some internal finding that ETH is a security, then given this is an about face, they should publicize it sooner rather than later. That said, Gensler has stated that proof of stake tokens should be regulated as securities for over a year.\n\nWhat about an ETH ETF?\n\nThe crypto markets seem rather sanguine about the latest news of SEC’s position, perhaps because it’s already built in. ETH is up 1% during the past 24 hours. However, the SEC is also expected to approve an ETH ETF. If the SEC believes that ETH primarily trades on unauthorized exchanges, could this serve as grounds for rejecting the ETF? This reasoning differs from the grounds it used to reject previous Bitcoin ETFs, which courts threw out last year. Bitcoin is definitely a commodity, so its spot markets do not need to register.\n\n* in response to the ICO blog post, high profile crypto techie Hasu penned another."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPSWRhWV9mUTZQaVB5NjFNSWlZcFpZUUtNdVFjWjBYUldpVFM4UEdzNVd0VkpRdUptWHVKeVJQV1pzeFprQnBBUTdOZFJtc2ZSZXAwamZnUVhJTjNjRkw4UmZEd0tkUkNmVG5OT016dnFPYThodkhYSDRQWHJxaTJYS19HVWFzbWpXTU9PbHg4cHNtVjhybDlJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Movement Labs Secures $38M for Ethereum L2 Development - Crypto Times",
        "content": "Movement Labs successfully raises $38 million in Series A funding, driven by the leadership of Polychain Capital. The investment will fuel the development of Movement L2, a cutting-edge layer-2 blockchain that promises enhanced security and efficiency for Ethereum transactions.\n\nThis initiative leverages the Move programming paradigm, initially developed by Facebook, to offer a robust alternative to traditional blockchain environments.\n\nFounders Rushi Manche and Cooper Scanlon, young visionaries and former Vanderbilt students, are at the forefront of this innovative venture. They aim to integrate the Move Virtual Machine into Ethereum’s expansive ecosystem. This move is anticipated to reduce transaction costs while boosting transaction processing speeds.\n\ngmove.\n\n\n\nemotional day for us at movement labs across all verticals as we announce our $38M series A,\n\n\n\nbefore we get into it, i want to talk a bit about where we came from 1/ — rushi (@rushimanche) April 25, 2024\n\nAddressing Industry Challenges\n\nThe drive for adopting Move stemmed from the persistent security challenges within the blockchain sector. Historical data reveals that between 2022 and 2023, hackers exploited vulnerabilities in smart contracts to siphon off approximately $5.4 billion across various protocols.\n\nMovement Labs’ new Ethereum Virtual Machine (EVM) is designed to mitigate such risks by allowing developers to deploy verified code, preventing prevalent attack vectors like reentrancy attacks.\n\nAdditionally, the Move programming language incorporates techniques such as parallelization to manage multiple transaction streams effectively. This feature fortifies the network against potential security threats.\n\nThe funding round drew support from multiple venture capital firms, indicating strong confidence in Movement Labs’ approach to blockchain security. Participants included notable names like Hack VC, Placeholder, and Aptos Labs. These partnerships underscore a collective commitment to advancing secure and efficient blockchain technology.\n\nMovement Labs is poised to launch the testnet phase of Movement L2 this summer, marking a milestone in their journey towards a decentralized and secure blockchain infrastructure. The introduction of the Move Stack and a shared sequencer further illustrates the company’s dedication to innovation and scalability in blockchain technology.\n\nBy prioritizing decentralization from the outset, Movement Labs sets a new standard for layer-2 networks. This strategic direction enhances Ethereum’s security and functionality and supports the broader adoption of blockchain technology across various sectors."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNVERTaXUwVmtwQnJsTmZHZFJGLXVMR1Vtc1BUdlNRb3VmUjZBaUtqSUE3ZEJPLUNsRGZKRk83WTFiR1BjcWl1NnRjUW1ncHlQM3VIR25SdWlSMjhhdndvV2dHc3dZbmNoU09uSlo2UE92Wm14dmdZbm5FQjNhWmx1SFdNTXpZNTc5VHYwR1lnWHNuMHFPQTJVLUF1cENlZmVMRGFOUGZnOUFMaTJBNlh4R3NRZUpYdUlteTg00gHAAUFVX3lxTE1NSzlqVlFKM2M1aFBrVlFSWkNhWGQ5QXRaellCdEhpdmJHeEF1STc2dzBjV25ZSjI0NTVNZlc2VER3RHZpM2FVYjZaczBMS3hsSm9fTVJzRmc4ZGYyRFZ1RGlva0ZWUi1RNWlnMjZCU194TVBKQU8tNTg4REFTOXB6eXNLV0lKZU0wNmo5d3g2V3RZMUdlZVJpUEVLZXBLYk1rSkhzekhLSG5GWHJWeWNQcVVHQ19PbW5sOS1oNnh1bg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Consensys, a Target for the SEC’s Assault on ETH, Is Fighting Back - CoinDesk",
        "content": "“The end goal of the suit is to get the judge to agree and issue an order finding that Ethereum is a commodity, that the SEC has been acting beyond its statutory authority and in violation of procedures it's required to comply with, and that peer to peer software that people use to read and transact with themselves on the blockchain is not a broker,” Hughes said."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOQnU1VTV2MUItZnpIUjdhS3RGbHI0S2NGV3JyZGRrVmRyeDUtT1VpU3RHTE5saDc4TU9UNXk4Y0hrSzEzRjZBMkhoRWd1Tkx3QlhJVWViWFcxMEZCajFrVTNDSl9sYl9mamx2ZS1SZkFmN1Vrd1RXYWNoRUphNkZWMVBZU2FrcDZtRjBSbllqOW9tNXNadkxrUTBwdUJOR1h2bWlOdVBIMjNseWpqaXEwUFJ3TDNpdWhGUG9jc2pn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: ETH Investors make $620M move after BTC Halving - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQUGJhT2s4R3U1My1NOVZwMXZxZ2hXbDl3N0thanVMTmtBOUpKWlh5M2M0Tmd4UklPbDlDSC1vVmc0dXBhcWEzNVdVczlZRDVkYlZSTUtaM0VmMm1EWXVlVEZUOHA5cG5HcW9OYzVlTUduOHZBZWNaYTRvNkM0MjhMT3ViRUFGUlg5YkE2MmlZQVJ3VFlpWldySkNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Polkadot community backs SnowBridge for seamless Ethereum integration - CryptoSlate",
        "content": "Polkadot’s governance is currently mulling over a proposal to activate SnowBridge, a cross-chain bridge designed to link the Polkadot blockchain with Ethereum.\n\nA cross-chain bridge essentially serves as a decentralized application (DApp), streamlining asset transfers between blockchains to enhance token utility by fostering cross-chain liquidity.\n\nMarket observers have highlighted the significant role SnowBridge would play in enabling Polkadot’s ecosystem to tap into Ethereum’s extensive DeFi landscape.\n\nThe SnowBridge proposal has garnered substantial support from the community due to the potential benefits, t, with all cast votes currently in favor of its implementation. If approved, SnowBridge is slated to go live in 28 days.\n\nWhat is SnowBridge?\n\nSnowBridge is one of the many bridges under development within the Polkadot ecosystem. This initiative, a collaboration between Snowfork and Parity Technologies, aims to revolutionize the movement of Ethereum assets into and out of Polkadot.\n\nCurrently, bridging ERC-20 tokens into Polkadot necessitates using bridges reliant on third-party signatures. While this method is standard in Web3 ecosystems, it poses limitations for Parachains and dApps on Polkadot due to its impact on their trust model.\n\nSnowBridge offers a solution through a trustless model that relies solely on signatures from first-party Ethereum and Polkadot validators. It operates on BridgeHub and is poised to enhance cross-chain interaction between Polkadot and Ethereum.\n\nSnowBridge has been in development for some time and was deployed on the Polkadot parachain testnet Rococo in January 2024. Subsequently, developers utilized it to transfer assets between the Ethereum Sepolia testnet and AssetHub on Rococo, with ERC-20 tokens initially being the sole supported asset type.\n\nSince its deployment, several updates to SnowBridge have been implemented based on thorough testing and audits conducted by the team and security firms.\n\nDisclaimer: CryptoSlate has received a grant from the Polkadot Foundation to produce content about the Polkadot ecosystem. While the Foundation supports our coverage, we maintain full editorial independence and control over the content we publish.\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQWU45eVpoVjF5ODlkR2dfQ1pWekd5MXZpNkk2UHdXTUQydDlBNXpEVzd1RnhfT0sxV3VhUWxPWFJ0QTlyQ3E5M1NoS25PbGpSMWItX3dWUXVNWjJCeDMzYmE3SmgxQ2xtWjRMeVpEdjc0Q0VpNmFJUDBaMG10LS04aktWQVYxc2tLWklxMmtya2V0dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Consensys sues SEC for alleged ‘unlawful’ regulation of Ethereum - SiliconRepublic.com",
        "content": "The company claims the SEC plans to treat Ethereum as a security and that the agency is attempting an ‘unlawful power grab’ through enforcement actions.\n\nBlockchain company Consensys has filed a lawsuit against the US Securities and Exchange Commission (SEC) for allegedly overreaching in its plans to regulate the Ethereum platform.\n\nEthereum is a decentralised blockchain and development platform, which Consensys claims is – or will be – the foundation of “countless” new web3 products and technologies.\n\nThe company alleges that the SEC is attempting an “unlawful power grab” through enforcement actions against Consensys and possibly other blockchain companies using Ethereum. Consensys also claims that Ether – the native cryptocurrency of the Ethereum platform – is a commodity and not a security.\n\nThe blockchain company claims apps that allow people to make transactions using Ethereum are not securities brokers and “therefore cannot be regulated by the SEC”.\n\n“If allowed to expand its regulatory purview, the SEC would effectively destroy value for hundreds of millions of ether holders and bring use of the Ethereum blockchain in the United States to a halt, crippling the technological evolution of the internet,” the company claims.\n\nThe complaint wants a court to agree with Consensys’ claims that the SEC has no legal authority to regulate ether, software interfaces built on Ethereum or “the Ethereum blockchain in general”. This complaint has been filed in a US district court in Texas.\n\nThe SEC did not respond to a request for comment from Coindesk on the new Consensys lawsuit.\n\nCrypto crackdown\n\nThe SEC has been cracking down on various crypto trading platforms in the US in recent years. The US agency claims that digital assets such as cryptocurrencies are subject to US securities laws because they are investment contracts. Critics of the SEC claim there the regulations around digital assets in the US are unclear.\n\nLast year, the SEC sued both Coinbase and Binance, claiming the crypto exchanges had acted unlawfully in the country. Towards the end of 2023, Binance and its CEO Changpeng Zhao plead guilty to US charges and the crypto exchange agreed to pay more than $4bn to resolve an investigation.\n\nLast month, the SEC scored a victory in its lawsuit against Coinbase, when a judge ruled that its claim that the cryptocurrency exchange engaged in unregistered sales of securities could be heard by a jury at trial.\n\nThe SEC is facing a hit from recent criticisms, however. Last week, two SEC lawyers resigned after a US judge sanctioned the regulator for “gross abuse” of power in a crypto case, Bloomberg reports.\n\nFind out how emerging tech trends are transforming tomorrow with our new podcast, Future Human: The Series. Listen now on Spotify, on Apple or wherever you get your podcasts."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1QZW9ObTNrRVJKMm43TWdMMng4dFdaVUQzRWRKMXBMUWJSc1gteVk2ZnhYb1hLc1RfWVUzQ0JzZnl1QzVqVXliM004MmVUU19jV2dPSkM2T3IyX2FpcjVQVWl0YzZCUEdCM0tmY3dqMGlpdUhUVkh6cy1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "The SEC’s Ethereum bank shot - Fortune",
        "content": "If you’ve ever played a casual game of pool, you’re familiar with the situation where the ball you wish to sink has no direct path to the pocket, and you’re forced to try a more elaborate shot that involves banking it off one or more of the sides. It’s a great feeling when it works and the ball goes in. The trouble is, most of the time it doesn’t. This is the situation SEC Chair Gary Gensler now finds himself in as he seeks to exert jurisdiction over Ethereum, which many feel slipped away from the agency’s purview years ago.\n\nThe second-biggest blockchain, which went live a decade ago, is largely decentralized. When a small group of people arranged to issue tokens for sale shortly after its launch, the SEC could have made a plausible case Ethereum was a securities offering. But that ship has long since sailed, so Gensler is trying the regulatory version of a bank shot.\n\nThis has become apparent in the SEC’s recent efforts to go after those engaged in staking, a process that Ethereum implemented in late 2022, and that replaced energy-intensive mining with a new model for verifying transactions on the blockchain. That model entails trusted nodes called validators, which receive modest rewards for updating the chain, and that require people to post collateral to ensure they are behaving honestly. If they try anything funny, they get “slashed” and lose that collateral.\n\nIt’s a clever model that serves to maintain the blockchain in an energy-efficient manner and has worked well as Ethereum has continued to attract new projects and developers around the world. It’s just how Ethereum works. Under Gensler, however, the SEC’s lawyers have attempted to seize on staking as proof the blockchain’s tokens are securities in order to try to stuff the Ethereum toothpaste back in the tube.\n\nI don’t really get it. If you squint, I suppose you can look at the validators who secure the blockchain—and offer to stake tokens on behalf of smaller Ethereum holders in return for a cut of the reward—as engaged in some sort of issuance of securities. But it doesn’t make sense in the broader context of Ethereum, which is a sprawling decentralized project with no single group of people in charge of it. It makes even less sense to imagine how Ethereum was not a security in 2018—Gensler said so himself at the time—but that now it is.\n\nIn any case, his legal theory will soon be put to the test as crypto giant Consensys yesterday sued the SEC to fend off the agency’s attempt to regulate the staking service offered by its MetaMask wallet. The company is not only asking the court to force the SEC to stay away from MetaMask but to leave all Ethereum projects in peace once and for all. This doesn’t mean Consensys is saying those who make money on staking should pay no tax—that’s an issue for the IRS—but rather that the SEC has no legal authority to touch Ethereum in the first place.\n\nThese sorts of things are unpredictable but, at first glance, it’s hard to see how the SEC wins in court. Perhaps Gensler is very good at pool and thinks he can make the legal version of a tough bank shot. Or maybe he’s just taking a shot and relying on blind luck that it will work.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nPayment giant Stripe is accepting USDC, the first time it has processed crypto since 2018 when it ceased taking Bitcoin because it was “unstable.” (TechCrunch)\n\nNew funds stopped pouring into BlackRock’s Bitcoin ETF on Wednesday, ending a 71-day streak of inflows. (Bloomberg)\n\nMovement Labs, a startup building a new layer 2 on Ethereum using tech created for Facebook’s abandoned Move blockchain, raised a $38 million Series A led by Polychain. (Fortune)\n\nPantera Capital is seeking to raise a $1 billion crypto fund, the largest since 2022, that will invest in a broad array of crypto assets. (Bloomberg)\n\nLawyers for Binance founder CZ seeking leniency ahead of his sentencing filed 160 letters of support, including from the two mothers of his five children. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nCrypto bro on Consensys v. SEC:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9LS1F4anRxT0JOcFItREdlWXdUeTRnN2w4REhYU3Z2OURyU1pVcDdmQkJKZ2o1NWVnN2lyQTFQeS1zMEhyd0I3NUtad0dHaFg3ZEFvRkZYajZBZWJnSlRVRWVwU2JXVngxTWJ1NnhFRWRWU03SAXtBVV95cUxNR2VPLVBDMUVVY1ZRY3FEWHRYYnl0eTZjMkhFNUVoaW5YSmJMN1VKMWxPMjZJV1FKYjdZVGdHQkN1WjM3VGtRX0JIYUh5OVd1MzdtZV9JMEd5Zjg3TFdXU1U4VGRaY0VlR21TVnVhU3hPWURjdUNtZzBrV3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Coinbase, Uniswap Execs Praise Ethereum Giant Consensys for Taking On SEC - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto industry heavyweights are lending their support to Consensys after the Ethereum giant launched a preemptive strike against the SEC on Thursday.\n\nConsensys, the company behind the MetaMask crypto wallet, filed a lawsuit against the SEC, alleging the regulator is trying to \"seize control over the future of cryptocurrency\" and is overreaching in its attempts to regulate Ethereum. (Disclosure: Consensys is one of 22 investors in Decrypt.) The company claims the SEC plans to regulate Ethereum as a security—which, up to now, the regulator has yet to state publicly.\n\n“Thanks [to the founder of Consensys and the rest of the team] for fighting back and defending our industry,” Uniswap founder and CEO tweeted yesterday. “We're tired of the overreach and harassment.”\n\nThe SEC has a long and contentious relationship with the crypto industry, filing multiple lawsuits against industry leaders such as Binance, Kraken, Uniswap, and Coinbase. So this reversing of the tables was welcomed with open arms by figures in the space who took to Crypto Twitter to express their delight.\n\nAD\n\nAD\n\nSue the Exchange Commission Thanks @ethereumJoseph and @Consensys for fighting back and defending our industry We're tired of the overreach and harassment https://t.co/yDTjjiaJWl pic.twitter.com/vtWxqKxv9n — hayden.eth 🦄 (@haydenzadams) April 25, 2024\n\nThe SEC hit Uniswap with a Wells notice earlier this month, alleging the decentralized exchange had broken securities laws. A Wells notice is a letter that the SEC sends to individuals or companies to inform them it plans to take enforcement action and file a lawsuit.\n\nIn its own lawsuit against the regulator, Consensys revealed that it too had received a Wells notice from the SEC after a years-long investigation into Ethereum, the network's transition to proof of stake following the merge, and the Metamask crypto wallet, specifically.\n\nConsensys's preemptive lawsuit seeks to get a court to agree that Ethereum is not a security, thereby nullifying the SEC's claims. It's a move others in the industry have attempted recently as well, including Coinbase.\n\nAD\n\nAD\n\nThe San Francisco-based crypto exchange is currently tied up in legal battles with the SEC regarding the alleged sale of unregistered securities. In the wake of the Consensys announcement, Coinbase Chief Legal Officer Paul Grewal took to Twitter to express his thoughts.\n\nI know ETH is a commodity. You know ETH is a commodity. The CFTC knows ETH is a commodity. It's time for the SEC to admit that it still knows ETH is a commodity too. No more games. Thank you to @Consensys for standing up against the SEC's unlawful expansion of authority. https://t.co/8w7A4PBwUK — paulgrewal.eth (@iampaulgrewal) April 25, 2024\n\n“It's time for the SEC to admit that it still knows ETH is a commodity too. No more games.” Grewal said, “Thank you to Consensys for standing up against the SEC's unlawful expansion of authority.”\n\nNeither Binance nor Kraken—both still fighting their own SEC court battles—immediately responded to Decrypt’s request for comment.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPRUJ3NVBZZHEyN09vZEd5SWl4Wk9TdmNDVnNQMUpORXNkWWM5a3NrWHlPNWk2TUxlU25OVEk0TTQtUU83bDY3NXViRW1OcmhubTlmdUs2bUJCb0x4Q1BfMU1zNlA1VzJ3LXVROG5JSUhMM0trQzdHdTZ2TkpjcVl1Vjd0WXZmQ1Y0elRhX0FRM1BvOVZNQWVobXlzUEJrcktCdEgwaktnSHZHZkpYSU0tSkR1aXJleVBlZHhWX3lBZkpmeDhJazlmQ21hNTRhQ1lxM2fSAdcBQVVfeXFMUG1ZWlYzWGFfWExFVTBxQzUzbUdKMVBQN2luRGtsTU1RbktzcmJGX1pleHp1QWJram9YR2FpU1poVnUwclJzQzg0bWt1eTdLYW0weFptYTE0ZUN6ZFhpdzhkeW95emFGZEhObWxpWXQyUENIRTd4dDlaOFdvSXo4UncxRGwybzZUb0dtYXhpalRlMmFDVVZXTnNVNTJYa1JvNmRja0xUTEZHUFc5T3FKdDlYaGZwZ1FydVp4VUhleEJCcW55SE5KS2RSTmFvNzUtU3FwcS01SzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Franklin Templeton’s Ethereum ETF listed on DTCC, no guarantee of SEC approval - FXStreet",
        "content": "Franklin Templeton has launched its Ethereum ETF coded as EZET, as seen on the DTCC website.\n\nFranklin Templeton’s Spot Ethereum ETF listing on DTCC does not guarantee S-1 filing approval by the US SEC.\n\nETH price is $3,125 at the time of writing, down nearly 3% from Monday’s close.\n\nEthereum (ETH) holders have long awaited the approval of the Spot Ethereum ETF by the US Securities and Exchange Commission (SEC). The firm’s ETH ETF, dubbed Franklin Ethereum TR Ethereum ETF was listed on the Depository Trust and Clearing Corporation (DTCC) website.\n\nSpot Ethereum ETF approval anticipation brews\n\nFranklin Templeton, the $1.5 trillion asset management firm has listed its Ethereum ETF on the DTCC website. The website lists the ETF and indicates that it is available for creation and redemption. The DTCC listing however does not imply an approval of the S-1 filing with the US Securities and Exchange. Franklin Templeton submitted its Spot ETH ETF application on February 12.\n\nEthereum ETF appears on DTCC website\n\nWhile not directly related to the S-1 filing, listing on the DTCC is a crucial step that allows for supply adjustment of ETF shares to help keep up with their demand in the market. It helps keep an ETF’s market price closer to its net asset value (NAV).\n\nIn previous instances, the website has listed securities that are eligible for trading and settlement once ETFs complete registration and compliance procedures. The SEC postponed its decision on Franklin Templeton’s Ethereum ETF application on April 23. The final deadline is now June 11, this offers the regulator an additional 45 days to make its decision on the Spot Ethereum ETF application.\n\nEric Balchunas, Bloomberg ETF analyst says that the chances of an approval by the SEC are 35%.\n\nETH price is $3,125 at the time of writing, down nearly 3% from Monday’s close."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9yTms5UTdqSjVGdFFvb2cxdW00Nl9abjZBN0JxemN0VXdGLVprZ2Vfbmk2bEZ4cUsxeC1Rc1h0cHMzMXB5OTBWT1R6dUtGY0pfSlhBN3BtZHVqQkZYVk92aUUzSFJyTW9Cb0Y4Skg2Q21KdlFhVGFudEVoeVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum May Price Prediction: Can ETH Hit $4,000? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, rising by 4.8% in the last seven days. At press time, ETH is trading at $3,150, according to CoinGecko data. ETH is up by 68.5% year-to-date and has regained the $3,100 level recently.\n\nAlso read: Shiba Inu Makes Crucial Shibarium Announcement: Can SHIB Hit $0.0001 In May?\n\nEthereum Price Prediction for May\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for May. According to their analysis, ETH is expected to reach a minimum price of $3,271 and a maximum price of $3,399. The average price is expected to be $3,335.\n\nThe prediction reveals that ETH is unlikely to hit the $4,000 level by May. The recent surge in Ethereum’s price has been largely attributed to the pump after the recent BTC retrace. With Bitcoin once again showing heightened volatility, the trajectory of ETH remains uncertain.\n\nAlso read: Dogwifhat: Can WIF Hit $10 In May?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks.\n\nAlso read: Top 3 AI Cryptocurrencies To Buy For Gains As Nvidia Report Drops In May"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPYnRyNU5lWG0xS0RscUFORkh3N1lTZzFPU0RPWHdCaTNCbU4tQ2xIMjJpUDR2WTZSREQ1YmZUSlBjNXg5b2tUWmRWeGVTWUVkdndib1paYWI0MFFsbnp2TXhzZ0lvdFlZRnBTclpacVNXeURGS3ozc3pSdk1jQ0wwX0RMbGoyZHVHZEtPUDk3TGNmSDhRODBuUnhFdEtTN1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum is failing to keep up with Bitcoin and how Solana could benefit - DLNews",
        "content": "Ethereum’s price in Bitcoin hit a multi-year low in April.\n\nSeveral factors suggest that the gap between the two could become more pronounced.\n\nInvestors are losing their faith in Ethereum as the cryptocurrency continuously fails to keep pace with Bitcoin’s outsized gains.\n\nAnd things could get worse for the world’s biggest altcoin.\n\nNot only have the odds for a US spot Ethereum exchange-traded fund getting approved in May dropped, but Ethereum exchange-traded products suffered $34 million worth of outflows this past week, CoinShares data shows — making them the only asset group among those CoinShares tracks to register a net outflow since the start of the year.\n\n“ETH sentiment is anecdotally at the lowest it has been in years, despite recent developments such as the BUIDL fund by BlackRock,” Luke Nolan, a research associate at CoinShares, told DL News.\n\nThe decreasing optimism comes as smaller altcoins, like Solana, have attracted investors who don’t expect Ethereum investments to yield as high returns as they did in the past.\n\nA Bitcoin-driven market\n\nIn previous bull markets, Bitcoin has outperformed other cryptocurrencies at the beginning of the cycle — a trend that looks to be playing out again.\n\nThis time the focus on Bitcoin has been catalysed by inflows to the 10 US Bitcoin ETFs that launched on January 11.\n\nThey have so far seen over $12 billion in inflows, according to data from Farside Investors.\n\nJoin the community to get our latest stories and updates\n\nYet, Ethereum has not managed to capitalise on the rally.\n\nEthereum’s price in Bitcoin — or ETHBTC — fell to a low of 0.046 in April, creating the biggest price gap between the two assets in almost three years.\n\nThat means that since ETHBTC peaked in 2022, an investment in Bitcoin has outperformed Ethereum by 44%.\n\nThe ETHBTC trading pair shows the price of Ethereum divided by the price of Bitcoin. Traders use this metric to gauge the relative strength of Ethereum against benchmark cryptocurrency Bitcoin.\n\n“Even though some people may not view ETH as an altcoin per se, its over- or underperformance relative to Bitcoin is a powerful metric to try and understand what kind of market we are in,” Nolan said.\n\nIf the Bitcoin ETFs continue to steam ahead, the price gap between Bitcoin and Ethereum may become more pronounced.\n\nAnd there’s reason to believe that Bitcoin ETF inflows will continue to soar. Hong Kong recently approved the launch of Bitcoin ETFs, which are set to begin trading April 30.\n\nEthereum ETF approval looks unlikely\n\nWhile Hong Kong also approved a spot Ethereum ETF, the odds of US regulators approving similar funds on May 23 — the deadline for when they have to either approve or reject VanEck’s application — are low.\n\nBloomberg Intelligence analysts James Seyffart and Eric Balchunas put odds for a May approval at around 25%.\n\nSimilarly, punters on blockchain-based betting platform Polymarket put the odds of an approval at 13%.\n\nThis week, BlackRock amended its spot Ethereum ETF application while competitor Grayscale filed to convert its futures Ethereum ETF to a spot fund.\n\nDespite this, analysts remain sceptical that any US spot Ethereum ETF will be approved.\n\n“The ETH ETF is almost certainly going to be rejected in May, which has dampened flows into ETH in already existing [exchange-traded] products,” Nolan said.\n\nSolana steals the spotlight\n\nAmong so-called altcoins, Ethereum is the largest, with a market value of $384 billion. But this success is a double-edged sword, according to Nolan.\n\n“ETH has a large market cap and investors have turned to lower cap alternatives,” Nolan said.\n\nOne popular alternative is Solana.\n\nMost traders assume it would be difficult for Ethereum’s market value to exceed that of Bitcoin. So with Bitcoin sporting a market value of $1.27 trillion, Ethereum traders see limited upside potential.\n\nDespite rallying 546% over the past year, Solana’s market cap is a comparatively low $64 billion, leaving more room for it to grow.\n\nTraders are also starting to pay more attention to Solana’s price compared with other cryptocurrencies.\n\n“I have noticed much more attention this cycle vs. last cycle to SOL/ETH and SOL/BTC pairs,” Nolan said.\n\nSigns of hope\n\nThere’s still hope Ethereum could stop bleeding against Bitcoin — but not for a while.\n\nThe approval of a spot Ethereum ETF should help drive interest. Nolan said he expects an ETF will “likely” be approved in 2025.\n\nAdditionally, if the current bull market repeats previous ones, Ethereum should do better as time goes on.\n\nUntil then, traders will continue to watch the ETHBTC chart closely for clues as to where the top two cryptocurrencies are heading next.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out with tips at tim@dlnews.com."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNSHJPdGU3NE1MTEpMUUV5WGtSQ3hha2lzbmFnNkZUOUpVTEloSVJHZzFzTmxJbXJFZFJxeS1YbjRNVHhrZFUwMURhalZVLTRiUTJ3TG52Y0pYaDJPbHBlbVFRQUJ6ZWlNcnZOdVl4a2MyTmd3N0UwcXZEMjctV1lGUmRtOE94YVk4OFVpUTEyMEhkZEZtQkpxUy16OG1Oc2o1WnRF0gGoAUFVX3lxTE9PSHBsa3FsaXc1dTZNYzBSYk83UXZlT2pLZVZwc1NZd0ZJZ0l5WDZPa1NpMlNKQy00Y2RmOGJnR0lqbmxpT1RGRDNwY2o0SVhWaGlGd0NYZUtDR3VZdkhDNFJNSnA3UXIzMm8wX0NvUjhPLXgxY3Axb3FETVVGZ2U2cm9Pb2puRkNFc0FMQXJQM2dmRTFZZDNkai1Bb2N6anltZ0U3bTlGTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ex-Ethereum Advisor Reaffirms ETH Is A Security Amid Consensys Vs SEC Lawsuit - CoinGape",
        "content": "In a bold move, former Ethereum advisor Steven Nerayoff has reaffirmed that Ethereum (ETH) is indeed a security. In a series of scathing posts on social media platform X, Nerayoff accused Ethereum of being centralized since its inception. Moreover, he alleged that it has operated as a security since its initial coin offering (ICO).\n\nEx-Ethereum Advisor Reacts To Consensys Vs SEC Lawsuit\n\nNerayoff’s affirmation comes amidst an ongoing legal battle between Joseph Lubin’s Consensys and the U.S. Securities and Exchange Commission (SEC). The lawsuit, filed by Consensys, aims to prevent Ethereum from being declared a security. The former Ethereum advisor labeled it as a move to “cover up” prior collusion.\n\nadvertisement\n\nIn one of his posts, Nerayoff declared, “It’s an undeniable fact that Ethereum is centralized and has been a security since the ICO. This move is to distract people from the truth and just another cover-up.” Moreover, he further accused Ethereum of engaging in “major securities fraud” through speculative ICO purchases and undisclosed whale holdings.\n\nFurthermore, the former advisor also spotlighted key figures within Ethereum’s leadership, including Joseph Lubin and Vitalik Buterin, alleging their involvement in fraudulent activities. Nerayoff pointed to Lubin’s significant purchases during the ICO as evidence of securities fraud, a claim supported by SEC Chair Gary Gensler’s assertion that Lubin acquired 9.5% of the ICO.\n\nIn addition, Nerayoff alleged collusion between Ethereum and the SEC. He cited a meeting between Lubin and former SEC official Bill Hinman prior to the latter’s speech declaring Ethereum not a security. According to Nerayoff, this coordinated effort aimed to conceal Ethereum’s true centralized nature, contradicting claims of decentralization.\n\nAlso Read: Breaking: Consensys Fights for Ethereum, Sues SEC to Block Regulation\n\nSteven Nerayoff Connects XRP’s Legal Woes To ETH\n\nFurthermore, in a surprising twist, Nerayoff linked Ethereum’s controversy to the ongoing SEC case against Ripple. He suggested a broader conspiracy to monopolize the crypto market. Additionally, he accused the SEC of biased treatment towards Ripple while targeting Ethereum’s only competition, echoing sentiments from the XRP community.\n\n“The XRP case has exposed the collusion between the SEC, FBI, DOJ, and other big entities to monopolize the crypto market,” Nerayoff asserted. Furthermore, he called for Ripple to be exonerated and Ethereum to be held accountable for its alleged misconduct.\n\nNerayoff’s allegations have reignited scrutiny over Ethereum’s regulatory status. Moreover, it has raised questions about the SEC’s handling of crypto enforcement. As the legal battle between Consensys and the SEC unfolds, the community awaits clarity on Ethereum’s regulatory status.\n\nAlso Read: Ethereum Price Analysis: Will ETH ETF Denial Jitters Trigger Sell-Off To $2,500?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPWlhiOFVEd21FVXRYVHVPLVBvYk05RnJEUXpNNHVvQTJvQk5hUUtCRkF0RTZoQ3kzd2JnU3RIel9fek82c0Zpb3FoSzBsU2lNaFlwZTFzanBUT0xZQW10N3h3VXRRWUR2bnpHbFNiM0d3TDk3NnluQ3BJcHpuM3BoN0swdFpaZlFwZm0tSWtaQ1pGZ3U4eS1j0gGcAUFVX3lxTE50c0xsOV9yaGpxVFNzMzFUMXIyVnRZdVFsbDZtYXFidC16UWQ1b09FR084bWJaaXEwcVprY0Q3RmxRVGlEZ083X2o4b1ZRSVRnbEM5d1ZLNGw0TFFiaFRhenZNQk1NdjZtazdDZ21jQUxDOFZjamtRVU83ZW5VUzlCYnBwRk5pZzVkY21NU2VVaEItbzgtWjJJMi1wWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "6 Under $1 Ethereum Meme Coins To Buy This Weekend For 50X Gain - CoinGape",
        "content": "The cryptocurrency market shines a spotlight on several Ethereum meme coins to buy that are currently valued under one dollar. Notable among these are Pepe (PEPE), Shiba Inu Coin (SHIB), and Floki (FLOKI). Each of these digital currencies has seen impressive gains recently, attracting the interest of investors aiming for significant returns. Their growing popularity may suggest they are viable options for turning a small investment into considerable profits in the volatile crypto market.\n\n1. Pepe (PEPE)\n\nPepe (PEPE), a new cryptocurrency on the Ethereum blockchain, is swiftly gaining traction. It aims to match or surpass the success of iconic meme coins like Shiba Inu and Dogecoin. Currently holding the 35th spot in market rankings, Pepe coin boasts a market cap of $3.22 billion.\n\nadvertisement\n\nEnhanced support from platforms like Coinbase and significant acquisitions by large-scale investors have propelled its visibility and value. Market trends and a rise in similar meme coins also contribute to Pepe bullish momentum.\n\nPresently, the Pepe price is $0.000007638, marking a 5% increase in the last 24 hours. This recent surge has positioned it as today’s most popular meme coin on CoinMarketCap. Over the last week, it has witnessed a substantial 47% increase. Over the past 12 months, PEPE value has skyrocketed by 3368%, highlighting it as a potential investment for significant returns this weekend.\n\n2. Shiba Inu Coin (SHIB)\n\nShiba Inu Coin (SHIB) continues to flourish within the decentralized finance realm. As another Ethereum-based digital asset, it has recently seen a 3% rise in its value. The current price of Shiba Inu stands at $0.00002577, suggesting continued growth. With a 146% increase over the past year, SHIB remains a strong contender in the market.\n\nRanked 11th by CoinMarketCap, SHIB has a market capitalization of $15.18 billion. Factors such as enhanced trading volume, strategic token burns, and the introduction of Shibairum are driving its upward trajectory. This makes SHIB another attractive meme coin for potential investors looking for substantial gains.\n\n3. Floki (FLOKI)\n\nFloki (FLOKI), initially recognized as a meme coin, has evolved significantly in the web3 realm. It now engages prominently in the Metaverse, decentralized finance (DeFi), and non-fungible tokens (NFTs). Dubbed “The People’s Crypto,” Floki integrates popular internet culture with cutting-edge, practical projects.\n\nAs of now, Floki price stands at $0.0001885, marking a 4% increase in the last day. It holds the 55th position in global market capitalization, valued at $1.8 billion, and is showing promise for substantial future gains following trends seen in other Ethereum-based meme coins.\n\n4. Grok (GROK)\n\nGrok (GROK) is carving out a space in the meme coin sector. It gains its inspiration from the Grok AI project by Elon Musk’s X company. This association has significantly heightened its profile, pushing it to the forefront of AI-related meme cryptocurrencies.\n\nGrok price is trading at $0.008313, reflecting a slight 2% dip over the past day. With a market capitalization of $52 million, it is ranked 596th on CoinMarketCap, highlighting its position among the top Ethereum meme coins.\n\n5. Bonk (BONK)\n\nBonk (BONK), a newly minted dog-themed cryptocurrency on the Solana network, has made a significant splash by allocating half of its tokens to the Solana community. This strategy has vaulted its market capitalization to a robust $1.74 billion. At the time of writing, the Bonk price is trading at $0.00002667, which represents an 8% increase over the past 24 hours.\n\nThis trend reflects a 79% rise over the past week and an astonishing annual gain of 4100%. Such dynamics suggest BONK could be a lucrative investment, especially as it rides the growing popularity of Solana, positioning itself as a top meme coin with the potential for exponential gains.\n\n6. CorgiAI (CORGIAI)\n\nCorgiAI (CORGIAI) has carved a niche within the artificial intelligence sphere, fueled by a vibrant community-driven project. The introduction of its Corgi Cre8r tool, enabling users to generate text-to-image NFTs, showcases its commitment to innovation.\n\nDespite a slight 1% dip in its price today, CorgiAI’s token, currently valued at $0.001672, has surged 542% this year. This impressive performance highlights its appeal as a promising investment among Ethereum meme coins, hinting at substantial returns for future investors. The current CoinMarketCap ranking is 3097, with a market cap of 507 million.\n\nBottom Line\n\nAs the crypto market continues to evolve, these selected Ethereum meme coins represent promising opportunities for investors. With their low entry price and recent upsurge in popularity, they are prime candidates for potentially lucrative investments this weekend.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPdjhZc3JZUnVmc0hmb2l6YlBGNEZqZHRHYTFfUU91cG5nSGZMb0M1bnU1TlVZMENhWTNjWUJ2TExyY2FidXptUklxUU9pX2pzQTNDTVFHbXZOS0U4UHBmb1Q4cC01YUh2YVEwRzJ1NVA4aXlLenEtTmNmRVJxUW9DWWg1UTg5RkxMaWfSAY8BQVVfeXFMTWhIU29xZ05yUjVsbXc1VFpURnJDVHBnMEk5c3lxUTJERjhhWGF0RUpvVHVjWm9jb1RkSjFBTlNkN3VBWXBHOFJkLU5TenRVaHFaRkM2bm9SZC1xM0pONUxYUEVVUDJlQlJ5cnlnM2xrTW00SWJPUWZHZldDcG9YakhoclVtdy14V0R6QWNMMEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: What $781 million outflows in 7 days means for ETH’s prices - AMBCrypto News",
        "content": "Ethereum’s Supply on Exchanges increased in the last few days.\n\nETH was down by over 2%, and indicators looked bearish.\n\nEthereum [ETH] has witnessed a considerable amount of outflow from exchanges over the last week. This happened while its price action was bullish.\n\nHowever, the market turned bearish in the last 24 hours. Did this have a negative impact on ETH’s outflow?\n\nEthereum’s outflow surged!\n\nEthereum’s price rested comfortably above the $3k mark as its price rallied by more than 6% in the last seven days.\n\nWhile that happened, investors stockpiled ETH, hinting that they expected the token’s price to rise further in the coming days.\n\nTitan of Crypto, a popular crypto analyst, recently posted a tweet highlighting this fact.\n\nAs per the tweet, crypto exchanges witnessed an outflow of over 260,000 ETH, equivalent to more than $781 million, within the past seven days.\n\nAdditionally, Justin Sun also accumulated ETH. As per a recent tweet from Lookonchain, a wallet that possibly belongs to Sun withdrew 15,389 ETH, worth $49.78 million, from Binance again.\n\nThe wallet earlier had bought 147,442 ETH, worth $469.9 million at $3,179 since the 8th of April.\n\nHowever, the last 24 hours witnessed a change in market sentiment as most cryptos’ prices dropped. According to CoinMarketCap, ETH was down by over 2%.\n\nAt press time, the king of altcoins was trading at $3,165.53 with a market capitalization of over $386 billion.\n\nIs ETH’s price drop affecting buying pressure?\n\nSince the token’s price dropped, AMBCrypto checked its metrics to find whether this had any impact on buying pressure.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was high compared to the last seven days’ average. This signaled that investors have started to sell ETH.\n\nThe token’s exchange outflow declined in the last few days. Additionally, the fact that investors were selling Ethereum was further proven by its supply-on-exchange graph as it went up.\n\nNotably, the price decline didn’t affect whale accumulation. This seemed to be the case as ETH’s supply held by top addresses continued to rise last week.\n\nGoing forward\n\nAMBCrypto then analyzed ETH’s derivatives metrics and technical indicators to see if the rise in selling pressure could further impact its price. The token’s Funding Rate increased.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nGenerally, prices tend to move the other way than the Funding Rate. This movement suggested a continued price drop for ETH.\n\nTechnical indicators also looked bearish. For instance, both ETH’s Chaikin Money Flow (CMF) and Money Flow Index (MFI) started to decline, showing a continued price drop in the coming days."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOWjJ4RXlwaW9UMUVmS2hUMm1NMzh1RGZJYmF1VF9FMDlFRHZSMERibEJXTFRXa2V6ZEpOcVp1TV9meDM3Z2taZG95cEVLTFhWUkFhN1VqOTNJNlFFN3VFRUNLcUp3ZXZhZDc3T090VFhNTE53ckZ0M3NIMGM0MzV5dVIzZEzSAYoBQVVfeXFMTzlMU25HMkw1MGFXaVlSa1ZaXzE1UnFiS3p5Y1VMaUpXZ2ZBWmJDelI0SzcteW9UUVdFT3dBWXBJeTN4OF9VNE1VVmJmYjY1TUlMTU1LTHh0b1ZxMC1vM1FjMHBuT2J1M2FlTlgzVW1GSUZvOHhpQmJDcFlvVmVNazdMbkNGY3R1TzNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Best Time To Buy Longs In Bitcoin (BTC) and Ethereum (ETH): QCP Capital - CoinGape",
        "content": "Crypto trading firm QCP Capital on Friday recommended buying Bitcoin and Ethereum, saying “If you are still a bullish believer, a consolidating market could be the best time to accumulate longs.”\n\nBitcoin and Ethereum prices are consolidating near $63,000 and $3,100 levels for a massive rally this year. Santiment reported that Bitcoin active wallets are rising quickly despite choppy prices.\n\nadvertisement\n\nBitcoin and Ethereum Fall Raises Questions\n\nPost-Bitcoin halving performance of Bitcoin (ETH) and Ethereum (ETH) prices raised questions of whether the market has lost faith or is this just a short pause in a longer-term bull run.\n\nQCP Capital, a Singapore-based digital asset trading company, in a new trade idea on April 27 noted the volumes in Bitcoin and Ethereum options have compressed drastically. This week, heavy selling of BTC options has seen the vol curve collapse, with Bitcoin vols further compressing from 70% to 50%. The company added that if people are looking to buy BTC and ETH, then this consolidating market is the best time to accumulate longs.\n\nOther the other side, the downside skew in Ethereum (ETH) risk reversals has also dropped further to -13%, said QCP Capital. This could be due to recent reports of SEC possibly denying or further delaying spot Ether ETF. According to people familiar with the matter, the SEC and its staff have shown no interest in the spot Ether ETF and its potential. Four people who participated said the discussions were one-sided.\n\nAlso Read: Shiba Inu or Dogecoin: Which Is Better & Likely to Outperform This Year\n\nHong Kong’s Spot Bitcoin and Ether ETF Going Live\n\nSpot Bitcoin and Ether ETFs to begin trading in Hong Kong on April 30. QCP Capital says this is potentially a big positive catalyst next week as Hong Kong financial industry joins other financial markets such as the U.S. and Europe to invest in spot Bitcoin ETF.\n\nExperts predict market reaction similar to the United States, which saw massive buying by institutional investors. Interest is growing in what could be a gateway for the inflow of Asian institutional capital, said QCP Capital.\n\nQCP Capital suggests BTC Accumulator and ETH Accumulator strategies for options traders, which a weekly buying call at a discount of the spot prices of BTC and ETH.\n\nBTC price fell over 2% in the last 24 hours, with the price currently trading under $63,000. Meanwhile, ETH price trades at $3,116, down more than 1% in the past 24 hours.\n\nAlso Read: Bitcoin ETF Records First All Net Outflow Of $83M Since Launch, Bitcoin Bottomed?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPR25YanJmVFJkZVNWcmlYNTk2eElLMVZBMDBWTWhBTGdTM3R5NFgyMWNia1l1aE96WlRLTVNwTlZ4bWlWZl82X295RnZBeWsxcUhhSlM1cnNtdGpadHZiMmtxeHB1QmYzRE1kY0QwQ1AxUkVJMDBIQmRTeTRJRzNxYWFYTG5vY0k5WVltMDd1Qmx6cjRpWWZoTHhXN1NuM2w2YkJFdldaVkF6Z0E0b3lacy1GZngxRFJtUmJiVUVlcHBEaE1qLU40Y3RFcV9FTVhyRVZpbjQ4ZE5VSUNOVjl0WTdsNXlxZXBj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin On Shaky Ground, Crypto Veteran Sees 'Bitcoin Still Stuck In Range' - Benzinga",
        "content": "Cryptocurrency markets are trading down on Friday, alongside a drop in total short crypto liquidations to the lowest levels since February 2024. One week after the Bitcoin Halving, exchange net flows for Bitcoin witnessed a major drop of 227% to $114 million.\n\nWhat Happened: Crypto markets experienced a shaky Friday late evening, with Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD trading in the red. Global concerns, such as the Japanese yen’s tumble to a fresh 34-year low against the U.S. dollar, weighed on the stock and crypto markets.\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.4% $63,876.32 Ethereum ETH/USD -1.1% $3,139.89 Dogecoin DOGE/USD -2.2% $0.1497\n\nA development on the Asian market will see Chinese investors with a Hong Kong residence permit allowed to buy shares in the Hong Kong ETFs. The global cryptocurrency market cap now stands at 2.36 trillion, down 1.07% in the past 24 hours. In the same period, 48,733 traders were liquidated, with total liquidations reaching 119.34 million.\n\nNotably, crypto short liquidations as of April 26 at 3:30 pm ET stood at the lowest since February 2024, at $24.96 million. IntoTheBlock data highlights that Bitcoin exchange’s net flows dropped significantly by 226.6% to 114.4 million, while large transaction volumes narrowed by 23.6% to $37.98 billion.\n\nTop Losers\n\nCryptocurrency Gains +/- Price Wormhole (CRYPTO: W) -10.0% $0.5994 Pendle PENDLE/USD -9.9% $5.44 Arweave AR/USD -8.0% $8.22\n\nAlso Read: Bitcoin’s Consolidation Is The ‘Calm Before The Storm,’ Veteran Trader Lark Davis Writes\n\nAnalyst Notes: Crypto veteran trader Michaël van de Poppe states that Bitcoin is still stuck in a range. However, he expects altcoins to perform better.\n\n#Bitcoin is still stuck in a range.\n\n\n\nI don't think we'll see much happening from here for the coming 3-6 months.\n\n\n\nSlow sideways, perhaps a grind.\n\n\n\nExpecting way more from #Altcoins. pic.twitter.com/akiD1uhTCU — Michaël van de Poppe (@CryptoMichNL) April 26, 2024\n\nHeavily-followed meme coin analyst and trader Murad shared potential price targets to determine whether the current range is accumulation or distribution.\n\nMy current base thinking on $BTC\n\n\n\nExpecting continued chop suey in the purple box into the Summer\n\n\n\nIn that box, you have to look for clues whether this is re-accumulation or re-distribution\n\n\n\nRe-accumulation –> 100K\n\n\n\nRe-distribution –> 52K or 42K or 32K\n\n\n\nBrush up on Macro pic.twitter.com/6YHvPoaG47 — Murad (@MustStopMurad) April 26, 2024\n\nCrypto trader Tim estimates that the “crypto market will be much higher” and is holding his entire portfolio. He states, “If the ship goes down, I’ll join you, but I think we’ll go higher after May, and this is a consolidation phase before the next leg up.” He strongly reaffirms that in all scenarios, crypto is here to stay and will grow.\n\nWhat’s Next: These topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Arthur Hayes: Bitcoin Bull Market Not Over, Urges Investors To ‘Left Curve It’\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQN1RzQzF1SmxZcW5nOC01bUdMbWhadzFMUjJyd3R4MlpHS3B0NHJYNHc1ZGRLNERzRjJraE5xMDMxWTNpQ0w1SmpoZmM0OUUxaEVZMk52eEdrenhzR1lNR0dUdU02UTRzcGRaM28xaG9LMWQ1cGtyQUxpNkVTQmxieVk0Mzg0RFU4RVh1bkM3TWNPUW_SAZgBQVVfeXFMUGszcVVuZzVELU5EUnhidHJSOUN5SE81Q0NCZ0hYMmJXc3JIQl83Ul9PRnpFb0dmRzhWbS14UjRsLWFPVnUtZXR5LUdhampxQjBIWENlUnhRcUxNZHRQX0ZsX0JMNEJjUmZDV1BMenFUNG90VzRsejRKc2k5cS1RRXd0Z0VOc1FvTzVRb1lvY3hKa3ljb3ZxaVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Time to revamp your ETH strategy before May? - AMBCrypto News",
        "content": "Cynicism around Ethereum grew on social media due to the expectation of the rejection of Ethereum’s spot ETF.\n\nPrice movement of ETH remained stable, and velocity and network growth remained the same.\n\nEthereum [ETH] has been struggling around the $3,100 to $3,200 mark over the last few weeks after its recent crash.\n\nWord on the street\n\nDespite these factors social activity around Ethereum grew, but not all of it comprised of positive discussions.\n\nSantiment’s data indicated that traders were focusing on recent reports which suggested that the SEC may reject proposals for spot Ethereum ETFs in May.\n\nMuch of the community believes that the significant increase in cryptocurrency value since mid-October can be attributed to the positive sentiment resulting from the approval of spot Bitcoin ETFs in January.\n\nHowever, current indications suggest that the SEC may not be ready to approve other assets at this time.\n\nAs regularly observed, historical data suggests that prices often move counter to popular expectations. Increasing fear, uncertainty, and doubt (FUD) due to trader impatience could actually benefit non-Bitcoin assets.\n\nThere has already been a notable increase in bearish sentiments among traders, as most assets have retraced considerably since Bitcoin’s all-time high on 14th April. Therefore, there is a higher likelihood of relief bounces occurring in the next week.\n\nWhile a softened stance or a surprise approval could initially boost Ethereum’s value, overly eager traders’ fear of missing out may lead to a mid-term drop, providing opportunities for large holders to lower prices.\n\nRegardless, if mainstream sentiment is selling the rumor, there historically tends to be a justification for buying the news.\n\nWhat’s next for ETH?\n\nAt press time ETH was trading at $3,151.30 and its price had fallen by 0.35% in the last 24 hours. The volume at which it was trading at had also fallen by 4.04% during the same period.\n\nThe network growth had moved sideways over the last few days, implying that new addresses weren’t particularly showing interest in ETH at the time of writing.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe velocity at which ETH was trading was also moving sideways indicating that the frequency at which ETH was being traded at had remained stagnant.\n\nThe network growth and velocity moving sideways suggest that there may not be any significant fluctuations in price in the near short term for ETH."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQejllc0VEQUJPSDRuSVlWZDh1YjFENXJYak9XNElNcjFxNUNYYW9mX3VhOWR0bWxPSUg5LU9nWmMzSnRKSFpGOG9KMzBkR184M01QQnJrMjNrdHhia21GeFZSTExzb09MbXNITFpUWGdIVW1qU0dSYUF4aUwzNDI0aEhnM3JuLU1j0gGOAUFVX3lxTE9nMFR2M1pmWTRhQ2dQWTZzbXN1cjhBMVJacS1TS1RPaFNZLWQySDZ4MDRESmxyX2t0MXExZTJJU2owUXNYTkdZcWRqa2ZZbUdndTFHclJOUlpnZktjVG41RzVjeWlfclA5Y3RIMU9kYllFaVNQa0NYS3ZPYUlHUnpudlJPMlFSYmp4WG9zYWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Solana tops Bitcoin, Ethereum in NFTs, but should SOL prices worry you? - AMBCrypto News",
        "content": "Solana’s NFT sales volume and transactions dipped last month.\n\nSOL’s price action remained bearish, and indicators suggested a further price drop.\n\nSolana [SOL] witnessed a year-long summer in its NFT ecosystem as the blockchain outperformed its competitors. However, Solana’s NFT metrics started to decline in the past month. Meanwhile, the token’s price action also turned bearish.\n\nSolana’s NFT ecosystem is shining bright\n\nSolanaFloor, a popular X handle that posts updates related to the blockchain, posted a tweet highlighting SOL’s commendable performance.\n\nAs per the tweet, SOL outperformed every other chain, including Bitcoin [BTC], Ethereum [ETH], and Polygon [MATIC], in yearly NFT blockchain user adoption.\n\nWhile SOL’s number of users grew by 33% in the past 365 days, MATIC, BTC, and ETH’s users grew by 29%, 10%, and 21%, respectively.\n\nAMBCrypto’s look at DappRadar’s data revealed that MadLads, Frogana, and Sharx by sharky.fi were the top NFT collections on Solana, which might have contributed towards the aforementioned achievement.\n\nDespite promising 365-day growth, things started to change in the last month. AMBCrypto’s look at Cryptoslam’s data pointed out that SOL’s NFT sales volume dropped by over 36% last month, as did its total number of buyers and sellers.\n\nIts total NFT transactions also dipped by 11%. Santiment’s data also corresponded to this, as SOL’s NFT trade count sank sharply over the past month.\n\nSolana investors need to worry\n\nWhile Solana’s NFT metrics dipped, the token’s price action also turned bearish. According to CoinMarketCap, SOL was down by over 25% last month.\n\nIn fact, in the last 24 hours alone, the token’s value dropped by 7%. At the time of writing, SOL was trading at $145.55 with a market capitalization of over $65 billion, making it the 5th largest crypto.\n\nThe decline in price also took a toll on the token’s social metrics. SOL’s social volume declined over the past month, reflecting a decrease in its popularity in the crypto space.\n\nAdditionally, Solana’s weighted sentiment also remained in the negative zone for the majority of the days. This clearly suggested that bearish sentiment around the token was dominant in the market.\n\nAMBCrypto then analyzed the token’s daily chart to find whether this bearish price trend would continue longer. We found that both SOL’s Relative Strength Index (RSI) and Money Flow Index (MFI) started to decline and were headed further below their respective neutral marks.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nAdditionally, the token’s price also failed to go above its 20-day Simple Moving Average (SMA), as suggested by the Bollinger Bands.\n\nAll these technical indicators hinted that investors might witness a further drop in SOL’s price in the coming days or weeks.\n\n\n\n\n\n"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQMWhBMTEtek5KY084VWhXcEs3dWFQSW52SU1VaDJlQUZuY2pyZ1hteUhtcjJpdENia2FCSzM1VEttMFBIQk5PUTlvd2RSOW9IbVdDZGdEeUpOS1AyVXhid3NUR0NZdmFMV3A5UU1Va2kxTDV3TmFMRnp0c0dkSFJtZVpXa2g1QmV5MHJnLWlyTDlzSjJ0QnFN0gGcAUFVX3lxTE1SZWVreUNMNHNadjZfb1JRc0pueWtYQVlSdjR3dUh2dmVpS3I2a01xTEUzNU1hTXZIUnl0TGlxNEY1dXJ3R25lWi0zcWtRVHRMN3U1aGZmT3ZFMWlNaHBJdEZwSjluY182WTc1M0NrUGRSR2dMbHh2ZWd3azB6MFJVUzlMNlRNbjJXdElYTUFtMFl4Rkk1dnlqTEUzdQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s correction – $2,700 and ETH price’s other targets if it falls again - AMBCrypto News",
        "content": "Selling pressure on Ethereum rose over the past week\n\nMost market indicators looked bearish on ETH’s charts\n\nEthereum’s [ETH] price managed to climb past $3.2k last week. Soon after, however, the altcoin turned bearish as ETH was unable to hold its position on the charts. Given how everything has panned out, if the worst scenario is to be considered here, ETH might fall to its $2.7k support level.\n\nMore red for Ethereum\n\nAccording to CoinMarketCap, ETH’s price appreciated by 2% last week, allowing it to go past $3.2k on 24 April. However, the uptrend didn’t last long as its price dropped over the last 24 hours. At the time of writing, ETH was trading at $3,118.13 with a market capitalization of over $380 billion.\n\nAccording to IntoTheBlock’s data, 79% of Ethereum investors are still in profit. The decline in ETH’s price also affected its social volume negatively. Additionally, after a spike on 25 April, its weighted sentiment dropped on the charts. This alluded to bearish sentiment around ETH being on the higher side.\n\nThings can get worse, however, as if ETH records more price corrections, its value might drop to the $2.7k support level in the coming days, as per a recent tweet from Crypto Tony, a popular crypto analyst. The possibility of ETH hitting that support level would increase if it fails to go above $3.6k.\n\nTherefore, AMBCrypto took a look at Santiment’s data to see whether metrics seemed bearish.\n\nWe found that selling pressure on the token has been increasing. This was evidenced by the hike in its exchange inflows over the past week. The fact that selling pressure was high was further proven by ETH’s supply on exchanges, which rise.\n\nOn the contrary however, whales remain confident in ETH as its supply held by top addresses went up.\n\nEthereum’s immediate support levels\n\nAMBCrypto then checked ETH’s daily chart to find whether a sustained downtrend is inevitable or not. We found that the Money Flow Index (MFI) went north – A sign predicting a price uptick.\n\nNonetheless, the rest of the indicators seemed bearish. For instance, both ETH’s Relative Strength Index (RSI) and Chaikin Money Flow (CMF) headed south, meaning that the chances of a further price drop were high.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nFinally, AMBCrypto’s analysis of Hyblock Capital’s data revealed that ETH has a strong support level near $3.1k if a price correction happens.\n\nA drop below that level could result in ETH plummeting to $2.8k before it reaches its tested support level at $2.7k in the coming days or weeks."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQSDE4TXVROHg3YllEYk9LQWtGSHpGZW14UDc4WF8zdkU3TEhTX2ZSXzA1eTVhdV9hLWhsd21NZG5QNF9WOGJ4SkpqdWwxOURRMVNsckI2ZmtBOGFEZjV2T0JsM1FLeDZZYWJIbC1TcUJweW92N3hDMjJ5NU9QNjNvcNIBhgFBVV95cUxNbC1OOUJGR1FhWFNZZjVjaDdZNjJRUF9xUlptUmFiQzg3UmJaUXhGRWxUblJFYmpLbGZianhPRjI5bjB2Um9rRHc3UXhsdTh2V0c0eTRJNEhQenV6N3N5Wml5REptV25BaWlPeHVmY293YXRTR1NMSGFPYVdkNkJrQ3hZeHlIZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s big moves: Whales buy the dip leaving ETH’s price at… - AMBCrypto News",
        "content": "Whales continued to stockpile ETH despite being under water.\n\nMajority of whale positions were longing ETH in derivatives markets.\n\nEthereum [ETH] sank 4.73% over the last 24 hours of trading, reversing the bullish momentum which it gathered following Bitcoin’s halving. The second-largest cryptocurrency was exchanging hands at $3,125 as of this writing, according to CoinMarketCap.\n\nThe slump however, failed to influence the market behavior of whale investors, as the latter still seemed bullish on ETH’s prospects.\n\nWhales buy ETH’s dip\n\nAccording to on-chain tracking platform Spot On Chain, whales accumulated hefty amount of ETH in the last 24 hours.\n\nA particular wallet with address 0xe0b snapped 1,524 stETH at an average price of $3,159. With this grab, the wallet owner pushed their total stETH holdings beyond $10 million, earning an estimated 3.42% profit.\n\nIn a bigger purchase, a whale amassed 7,128 ETH, worth $22 million at prevailing prices, at $3,111. The wealthy investor reportedly sat on a huge $482 million worth of ETH stash.\n\nAs of this writing, the holder was in a state of unrealized loss.\n\nSupply held by top addresses increase\n\nThese were not isolated developments though. According to AMBCrypto’s analysis of Santiment’s data, ETH whales upped their transaction activity in the last 2-3 days, as seen by the jump in large transfers exceeding $100k.\n\nMoreover, the share of total supply held by top addresses rose from 41.37% on the halving day to 41.45% on the 24th of April, suggesting accumulation by whales.\n\nWhales still betting on ETH’s rise\n\nOn the derivatives markets too, majority of the whales were bullishly positioned. About 63% of the total whale positions on Binance were long on ETH, as per AMBCrypto’s analysis of Hyblock Capital data.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThough, it was worth mentioning that the long exposure came down after the halving.\n\nThe market sentiment leaned towards greed, indicating the possibility of increase in buying pressure in the days to come. This could support ETH’s rebound in the days ahead."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVFkxNFJOZnIzS0R0Uy1oVlJPajlIcUFzX251SlBLbUI4ZVdSQndFQ1gxc2NoTTRVaEFobHNGOWNZclhrWGtMWjRkd3BsQ1l6MUFSQW9QVzYtMEJLTjEzMXZUaHlHQnctMlpyZmktYk05dWtxMzN0ZHZmX2oyc3pvLUtEWktTTG84eWd1VjEtaVhZMC1H0gGaAUFVX3lxTFBIYktnbkpQSlN2UW1LNUFIVlNuYzViUjdJQ1FYRGhBWVRoNnExWDlBQkowR09OYzdqTHBrTm5Xa2U4cnFaenVMOTZMVFNBbmpwT2xxQkROZFlNdkczVWZjbzNIeDJuUTlQaEJSYk1PQnowTEpvQ2JMR01JeDI5emFsSEZQWmtMeVZDdE1WcnprbnZvcl8wMUlDbFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Polkadot vs Ethereum, BNB Chain – Here’s what the stats are telling you - AMBCrypto News",
        "content": "Though dev activity dropped, Polkadot’s network activity hiked on the charts\n\nA trend reversal could be on the cards for DOT’s price action\n\nPolkadot [DOT] has been renowned for having robust development activity consistently over the years. However, as per recent data, other blockchains like Ethereum [ETH] and BNB Chain have emerged to overtake its levels over the last few days. While this shift happened, DOT’s price action turned bearish on the charts.\n\nPolkadot’s development activity drops\n\nCoin98 Analytics recently shared a tweet mentioning a list of blockchains ranked in terms of their development activity. As per the tweet, Polkadot registered 827 developers last week, with the blockchain witnessing over 5000 weekly code commits.\n\nThough the number by itself wasn’t low, it was lower than other blockchains. For instance, ETH had more than 2000 weekly developers who executed over 19,000 commits. Polkadot was also behind BNB Chain, whose weekly commits exceeded 6,000.\n\nOther blockchains that outshined DOT were Polygon [MATIC] and Optimism [OP], whose weekly commits stood at 6,300 and 5,200, respectively.\n\nAMBCrypto’s analysis of Santiment’s data also revealed a similar story. We found that DOT’s development activity dropped sharply over the last seven days. However, despite the drop in dev activity, the blockchain’s dev activity contributor count spiked multiple times last week.\n\nHere, it is interesting to note that while the blockchain’s dev activity fell, its network activity registered a massive spike last week.\n\nAMBCrypto’s look at Artemis’ data revealed that after several days of dormancy, DOT’s daily active addresses shot up considerably on 24 April. Thanks to the rise in active addresses, its daily transaction count also followed a similar trend.\n\nBears are attacking DOT\n\nIn the meantime, Polkadot bears buckled up as the token’s price dipped on the charts. According to CoinMarketCap, DOT lost more than 1.5% of its value in the last seven days. In fact, in the last 24 hours alone, the token’s value dipped by 2%. At press time, DOT was trading at $6.70 with a market capitalization of over $9.6 billion.\n\nDOT’s funding rate has risen over the last few days too. This is a bearish development as prices tend to move in the opposite direction from the funding rate.\n\nNonetheless, Polkadot’s open interest also went down. A decline in the metric is a sign that chances of the ongoing market trend changing are high.\n\nRead Polkadot’s [DOT] Price Prediction 2024-25\n\nDOT’s Money Flow Index (MFI) also registered a sharp uptick and was heading further above the neutral level, suggesting a possible price hike.\n\nFinally, as per the Bollinger Bands, DOT’s price was resting under its 20-day Simple Moving Average (SMA). A successful breakout above that level could result in a fresh bull run for the altcoin on the charts."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPVmF3OFRpRm5vbXpoMTJUdkJSQkh4S3V0OVZwSnNqY29KTWJGRU9wMzJ6QlZGSjlMYVY1RG5QQTczME5DdmNZTDhrQlpGUlJOdGhDY3p4akRvT2ktamREYkJBX1Vpb25YQWJUVDFURkpJNUVaNE9TN3dtaE5BOTNkVGhmeHQzNFlFQ3fSAY8BQVVfeXFMTUZ3UWd4a2NYMW00XzMyLUxYRG96emlDWDFxcmwyS1J3OFh5UmF0bl9Ia2tyMkh3MFBXSzRTUWZqbnlORWJTVzZ4NlZRVHZaUjNuVmxzS0JVVm1XQnlra3N5SDRQNnZDSWRlQWJxV2lnZUNIRVh0S0J6WktLcmMzQVZuc08xWlREZDdMZFdwVkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "What next for Bitcoin, Ethereum as $9.3B options expiry looms - AMBCrypto News",
        "content": "Most of the bets predicted a bullish close for BTC and ETH.\n\nETH might drop below the max pain point while BTC might end the week above it.\n\nMore than 96,000 option contracts of Bitcoin [BTC] and 978,000 for Ethereum [ETH] are set to expire on Friday, 26th April.\n\nAccording to derivatives exchange Deribit, the BTC contracts were valued at $6.2 billion while ETH contracts were worth $3.1 billion, bringing the total to a mind-blowing $9.3 billion.\n\nWith options, traders can purchase contracts that allow them to buy or sell a cryptocurrency at a predetermined price. As options near expiry, traders must decide if to buy, sell, or close the contract.\n\nOptimism rises despite the decline\n\nDetails AMBCrypto got from Deribit showed that the BTC put-call ratio was negative. This indicates that most of the bets were calls and traders were bullish on the coin price.\n\nIt was a similar case for ETH. For those unfamiliar, buying a call option means that a trader will make money if the price goes up. On the other hand, a put option is a bearish bet, meaning a trader will make profits if the price declines.\n\nDepending on where BTC and ETH prices close, the exchange noted that sellers might gain the most if BTC hits $61,000. In ETH’s case, buyers might lose a lot of money if the value of the altcoin reaches $3,100.\n\n“Bitcoin options and the removal of a 61k max pain price point, together with the expiring open interest of nearly $3 billion in Ethereum options and the removal of a $3.1k max pain price point.”\n\nAt press time, BTC’s price was $64,140, representing an 8.52% decrease in the last 30 days. ETH, on the other hand, changed hands at $3,129— a 12.46% 30-day decrease.\n\nDifferent patterns for the top two\n\nTo ascertain where the price might close this week, AMBCrypto looked at the liquidation heatmap. Liquidation heatmap shows traders high areas of liquidity (magnetic zone).\n\nThis helps to identify potential large liquidation points, and the possibility of prices moving toward certain regions. According to data obtained from Hyblock, a magnetic zone (colored yellow) appeared on the BTC liquidation heatmap at $67,250.\n\nTo the downside, another magnetic area was at $62,600. If Bitcoin’s price moves toward $67,250, then most option contracts will end up making money from their bets.\n\nOn the other hand, a decline toward $62,600 could cause losses. However, the pain might be minimal as long as the price does not hit $61,000.\n\nHowever, it might not be the same case for traders who went with the ETH call option.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAt press time, the high area of liquidity was around $3,025, indicating that the price might decline below the $3,100 max pain threshold.\n\nIf this happens, a large part of the $3.1 billion set to expire could be wiped out. However, if ETH stays above $3,100, puts might not be the only ones to gain from the price action."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOWUtuSjVuVzBfVVlTaFJybGU5LTBDZFZNbVlTeEdIWUNoc3VITkZ4czNBbHJKWklSb0tYS2ZCUW9RaHNrYVF1NGhRZ2h4VTJhT3FKdEUyaVdSRDVYX2hZWTlWRjVfcXo2YnBjTm42RFRfTmhwOEdIOF9PdG95Tk41MjlCbmZMbnRnOGJma0RncHbSAZYBQVVfeXFMTy1xOC1PMU1MVUNsNWlJbGltVmR6bDlER0dXZmkxdk5QcmtQeDlmOTdzOWdsMVZfcFB4Tl9vVHpnSUpMbmxuRVVBanVpaHRjaS04a1JDbmJRSjQwbnRnNUQ1c3UwY01ILU1xbkhoTlRBejUxdGkzODFrMmFDNm1zTUJhaXhneFd1eUl2aDB2akVzaWowMmdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum validators stay put – Where does that leave ETH’s price? - AMBCrypto News",
        "content": "Voluntary exit on Ethereum fell to a one-month low.\n\nDespite last week’s price rally, bearish sentiments remain significant in the ETH market.\n\nThe daily count of validators exiting the Ethereum [ETH] network recently cratered to a 30-day low, data from Glassnode showed.\n\nThis occurred due to the recent decline in demand for the proof-of-stake (PoS) network. AMBCrypto previously reported that user activity on Ethereum has declined over the last month.\n\nThis resulted in a low ETH burn rate, which has increased the coin’s supply and made it inflationary once again.\n\nWhen ETH becomes inflationary, its price experiences significant downward pressure. According to CoinMarketCap’s data, the coin’s value has dropped by 13% in the last month.\n\nDue to ETH’s low price action, validators on the Ethereum network have not been incentivized to unstake their coins for onward sales.\n\nThe network typically witnesses a surge in validator exit when ETH price climbs, causing validators to attempt to capture gains on their previously staked coins.\n\nWith fewer validators leaving the network, the participation rate among validators has also risen to its highest in the last month.\n\nValidators must participate in the network to ensure that Ethereum runs optimally. A high participation rate indicates reliable validator node uptime, fewer missed blocks, and superior blockspace efficiency.\n\nAs of this writing, the validators’ participation rate on the network was 99.6%.\n\nETH gains, but at what cost?\n\nAt press time, ETH traded at $3,150, recording a 5% value uptick in the last week. This price growth has been due to a minor resurgence in bullish sentiments among market participants, which AMBCrypto gleaned from its readings of the coin’s key technical indicators on a one-day chart.\n\nFor example, the coin’s MACD line rested above its signal line at press time. This signaled that ETH’s short-term moving average is above its long-term moving average. It is viewed as a bullish signal and interpreted as an indication to take long and exit short positions.\n\nLikewise, the coin’s Chaikin Money Flow (CMF), which measures the flow of money into and out of the market, returned a positive value at press time. This showed that the ETH market had a steady liquidity supply.\n\nHowever, bearish sentiments lingered in the market. The value of the coin’s Elder-Ray Index was -61.96 at the time of press. This indicator measures the relationship between the strength of buyers and sellers in the market.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nWhen its value is negative, bear power is dominant in the market.\n\nConfirming the strength of ETH bears, its negative directional index (red) was positioned above its positive index. This showed that coin sellers had more presence in the market than buyers."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1wYjlxMVRETlJLbmdXaHE5OHdDOVBjZS1iSG5BaEJNX21lakRKNnhnTnlsX1Qyby1vaEJnR191aWJiUmdLS3FjSWJISHhqR2ZoNVhlYkx5U0ZPZko2czdn0gFjQVVfeXFMT1g2MzJjU3hjbGpYTWV4SmgzV2lWS2VKTjVvNmVGNTFkR2VTZExMVG9KMkNWalFNZ2czOGtyUFpsTGFOQkpVNTY2Y2FsUi1MZndXQVl1MVZRTUhPLURvMWczWGs0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "What Is the Next Ethereum? Top 6 Competitors in 2024 - CoinCodex",
        "content": "There are several blockchain networks competing for a piece of Ethereum’s smart contract and DeFi market share. Projects like BNB Smart Chain, Cardano, Solana, Tron, Polkadot, and Avalanche are some of the most prominent “Ethereum killers”.\n\nEthereum (ETH) is a blockchain protocol that supports decentralized applications and smart contracts. It is the second-largest cryptocurrency by market capitalization and the most widely used platform for decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nHowever, it also faces some challenges, such as high gas fees, network congestion, scalability issues, and environmental concerns. Therefore, many other blockchain platforms have emerged as potential competitors or alternatives to Ethereum, offering different features and advantages.\n\nIn this article, we are going to examine the most prominent Ethereum competitors and look into the pros and cons of 6 crypto projects that are vying to become the next Ethereum.\n\nNative Coin Total Unique Add. Txs Per Sec. Avg. Tx Fee TVL Market Cap Ethereum ETH 264 mln 30 $4.99 $67 bln $382 bln BNB Smart Chain BNB 444 mln 2,200 $0.0982 $7.8 bln $88.8 bln Solana SOL 28 mln 4,233 $0.005 $5.7 mln $63.9 bln Cardano ADA 4.4 mln 1,000+ $0.16 $397 mln $16.7 bln Tron TRX 225 mln 2,000 $0.95 $8.6 bln $11.0 bln Avalanche AVAX 20 mln 4,500 $0.084 $1.1 bln $13.3 bln Polkadot DOT No data 1,000 Parachain specific $265 mln* $6.8 bln\n\nData collected on April 26, 2024.\n\n*Polkadot’s TVL is calculated as the total sum of TVL across Polkadot parachains (Moonbeam, Acala, etc.)\n\nWhat is the next Ethereum? Analyzing the top 6 “Ethereum killers”\n\nWhen talking about the “next Ethereum”, we are referring to cryptocurrency projects that are leveraging blockchain and smart contract technology for developing DeFi and NFT solutions, which is currently the arena Ethereum is dominating thanks to its first mover advantage. In the following sections, we are going to examine six projects with robust feature sets and active communities that could challenge Ethereum’s dominating market share in the future.\n\n1. BNB Smart Chain\n\nBNB Smart Chain (BSC) is a blockchain platform launched by the popular cryptocurrency exchange Binance. Powered by its native token BNB, BSC aims to provide an alternative to the Ethereum network by offering faster and cheaper transactions. It achieves this by using a different consensus mechanism called Proof of Staked Authority (PoSA). BSC's compatibility with the Ethereum Virtual Machine (EVM) allows developers to easily migrate their dApps from Ethereum to BSC, leveraging its high throughput and low fees.\n\nWhy is BNB Smart Chain considered the next Ethereum?\n\nThanks to a large number of users, familiar features that are heavily inspired by the Ethereum blockchain, and backing by the world’s largest crypto exchange, BNB Smart Chain is considered the top Ethereum killer.\n\n2. Solana\n\nSolana (SOL) is a high-performance blockchain platform designed for decentralized applications and crypto-currencies. It leverages a unique combination of proof-of-stake (PoS) and proof-of-history (PoH) mechanisms to achieve fast transaction speeds and low fees. Solana's scalability and throughput make it an attractive option for developers looking to build complex applications that require high-performance capabilities.\n\nWhy is Solana considered the next Ethereum?\n\nSolana is one of the most energy-efficient and cheapest crypto networks for transferring value. In addition, Solana features a healthy ecosystem of dApps and an active community, despite SOL’s rapid price decrease last year due to its connection with the now defunct FTX exchange.\n\n3. Cardano\n\nCardano (ADA) is a blockchain platform that aims to provide a secure and sustainable infrastructure for the development of decentralized applications and smart contracts. Built using a peer-reviewed academic approach, Cardano boasts a high level of security and scalability. It utilizes a unique consensus algorithm called Ouroboros, which ensures that the network remains decentralized while maintaining fast transaction processing.\n\nWhy is Cardano considered the next Ethereum?\n\nCardano is not only one of the most popular crypto projects but also one of the most actively developed blockchains in the space, making it not only one of the top Ethereum killers but also a potentially good investment overall.\n\n4. Tron\n\nTron (TRX) is a blockchain platform that aims to create a decentralized digital entertainment ecosystem. It focuses on providing a decentralized infrastructure for content creators and consumers in the entertainment industry. Tron offers high throughput and low transaction fees, making it suitable for applications such as gaming, social media, and digital content distribution.\n\nWhy is Tron considered the next Ethereum?\n\nOver the years, Tron has emerged as a credible alternative to Ethereum due to its transaction speed and overlapping features. In recent years, Tron has also looked to expand its offering, integrating decentralized file-sharing capabilities with the acquisition of BitTorrent (BTT) and launching a decentralized stablecoin, USDD.\n\n5. Avalanche\n\nAvalanche (AVAX) is a highly scalable blockchain platform that prioritizes speed, security, and decentralization. It utilizes a novel consensus protocol called Avalanche, which enables high throughput and fast finality. Avalanche's unique approach to consensus makes it highly resilient to attacks and allows for quick transaction confirmations, making it an attractive choice for developers seeking a scalable and secure blockchain platform.\n\nWhy is Avalanche considered the next Ethereum?\n\nAvalanche’s focus is on overcoming some of Ethereum's scalability and speed limitations. While the blockchain itself is capable of processing about 150 times the number of transactions as Ethereum, Avalanche has struggled to build a dApp and NFT ecosystem that could challenge Ethereum, at least so far.\n\n6. Polkadot\n\nPolkadot (DOT) is a multi-chain platform that enables the transfer of any type of data or asset across different blockchains. It aims to create a decentralized internet where different blockchains can communicate and share information securely. Polkadot's unique architecture allows for interoperability between different chains, facilitating seamless data transfer and enabling developers to leverage the strengths of multiple blockchains simultaneously.\n\nWhy is Polkadot considered the next Ethereum?\n\nPolkadot was conceived by Gavin Wood, a computer scientist and co-founder of Ethereum. Wood launched Polkadot with the intention of enhancing scalability with “parachains”, which enable parallel processing of transactions, allowing Polkadot to handle a larger volume of transactions compared to Ethereum.\n\nWhich are considered “Ethereum killer” coins?\n\nIn addition to the blockchain networks described above, like BNB Smart Chain, Cardano, and Polkadot, there are numerous other platforms considered members of the group of Layer 1 networks called Ethereum killers.\n\nSome examples of blockchain platforms that have an overlapping feature set, such as Ethereum, include several smaller market cap projects, including Cosmos, Ethereum Classic, Near Protocol, Tezos, Algorand, and Fantom.\n\nIt is also worth mentioning that several Layer 2 solutions that aim to alleviate scalability issues on the Ethereum network, like Arbitrum, Polygon, and Optimism, are also considered by some as Ethereum competitors. However, that categorization would be somewhat nonsensical, as these solutions aim to enhance the operations of the Ethereum blockchain, not replace it.\n\nAre Bitcoin and Ethereum competitors?\n\nBitcoin and Ethereum are both cryptocurrencies that use blockchain technology, but they have different purposes and features. Bitcoin is designed as a digital currency and a store of value, while Ethereum is a platform for smart contracts and decentralized applications. Therefore, they are not direct competitors but rather complementary projects that aim to solve different problems using blockchain technology.\n\nHowever, from the perspective of traders and investors, Bitcoin and Ethereum may be seen as competitors as they vie for market share and adoption. Bitcoin is the first and largest cryptocurrency by market capitalization, and it has a high level of security, decentralization, and network effects. Ethereum is the second-largest cryptocurrency by market cap, and it has a high level of innovation, functionality, and scalability. Both cryptocurrencies have their advantages and disadvantages, and their performance may vary depending on market conditions and user demand.\n\nThe bottom line: There are several blockchain platforms vying to become the next Ethereum\n\nEthereum was the first major blockchain platform to build the necessary infrastructure and building blocks to support the creation of decentralized applications, decentralized financial systems, and new tokens, thanks to the ERC-20 token standard. Since its launch in 2015, numerous other networks have tried to overcome Ethereum’s first mover advantage, but to no avail. BSC comes the closest, especially in terms of active users. However, the ecosystem of products and services is considerably smaller on BSC than on Ethereum. Other networks, like Cardano, Solana, and Polkadot, are even further removed, despite their ability to process considerably more transactions and at a lower price than Ethereum\n\nFor more information about whether it is a good idea to buy Ethereum, and what are the pros and cons of investing in Ethereum, you can check the video below."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNNVNRb2JPcFRtT2ljcU1xa2NFNGU5ekQtTjdaTGJfZXYwaDltOTNrWlJENHF0aTJOQjlCb0NwR2FNenl6aTdOa0pIU1JKS0ttRzkyZFk5RXlER2NNaXJBemktdHU5TVo4YTlfcGpkUzhlZVF3MkZpOXU4dldET081emNiVHlTUENSSVVEcjlqUnhyZWQzOGhvWTBzMF9Qa3QxclFiTm1VeWV3RkVQN1I0dzVjWGFhT2PSAbwBQVVfeXFMTmNZUkJ2S3NyVzQ1bERqNklZQkp3SV9jUEFzNk5CYXJvNE1kaFNFRG5XcVpxMjZHcWNfaXFvQTVkR2dFQzhZMDdGRHlQTHpxc1FZWDV5Z2JTUHNobldUZlpjTXlOVFFMblZpS3k0VXZ2QnR5ZTNaaGh3aWN2YTNpS0RBUXdqVzlqdlA3VjFRQXJuNnFFNm5mY28xbWEtR0xUdENNcjBXTHN3MlhkenlCNVRHYmswdDZZazAwVkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, And XRP Price Prediction: Will Bulls Make A Comeback This Week? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nDespite increased price volatility in the cryptocurrency industry post-Bitcoin-Halving, the top tokens constantly display a neutral sentiment in their respective charts, indicating uncertainty in the market’s future course.\n\nMoreover, the mid-cap and low-cap altcoins have experienced the highest gains since Halving, highlighting a high possibility of a switch of investor’s interest toward other projects to maximize their profits.\n\nWith the current market sentiments, will the industry leaders Bitcoin, Ethereum, and XRP tokens record a comeback during the coming week?\n\nBTC Price On The Verge Of Testing Its Major Support:\n\nThe market leader, Bitcoin price, has recorded a neutral sentiment post-halving by losing approximately 2% within the past week. Moreover, it continues to trade in a consolidated range between $61,025 and $73,754 since the start of March, indicating a weak price action for the BTC price.\n\nTradingView: BTC/USDT\n\nDespite recording a correction of 10.45% within the past 30 days, the Bitcoin price has a Year-to-Date return of approximately 50%, indicating a high possibility of a bullish price action in the long-term perspective.\n\nThe technical indicator, MACD, displays a constant red histogram in the chart, highlighting a strong bearish influence in the crypto space. Moreover, the averages show a downward trend, suggesting the price may continue losing value in the coming time.\n\nIf the market experiences a bullish reversal in the chart, the BTC price could attempt to achieve a new all-time high (ATH) of $80,000 during the coming month. Conversely, bearish price action could result in Bitcoin price testing its low of $61,000.\n\nAlso Check Out : Bitcoin (BTC), Ethereum (ETH) and Solana(SOL) Price Prediction For This Week\n\nETH Price Forms A Bearish Pattern:\n\nThe Ethereum price continues to hover close to its support trendline within the symmetric triangle pattern, highlighting a strong bearish influence in the crypto space. Moreover, the EMA 50-day acts as a resistance trendline, resulting in the ETH token trading close to its crucial support of $3,150.\n\nTradingView: ETH/USDT\n\nAfter trading under a bullish influence and recording a yearly top of $4,094, the leader of altcoins, the ETH token, has recorded a correction of 23.76% in valuation. However, Ethereum price has a YTD of 36.86%, highlighting a positive outlook for this altcoin in the coming time.\n\nThe Moving Average Convergence Divergence (MACD) shows a constant flatline in the chart, indicating a weak price action for the leader of altcoins in the market. Furthermore, the averages show a neutral sentiment, indicating uncertainty in future price action.\n\nIf the bulls break out of their resistance zone, the ETH price will regain momentum and attempt to test its upper resistance level of $4,000 during the coming month. However, if the bears overpowered the bulls, the price will fall toward its low of $2,630.\n\nWill XRP Price Ever Rise Back Up?\n\nThe XRP price has leveled all its gains post-halving, indicating a bearish price sentiment in the crypto industry. Furthermore, the Cross EMA 50/200-day shows a Death Cross in the 1D time frame, highlighting a high possibility of a bearish price action for Ripple token in the coming time.\n\nTradingView: XRP/USDT\n\nThe MACD displays a constant green histogram, indicating an increase in the buying pressure within the crypto space. However, the averages show a constant flatline, indicating a mixed sentiment in the crypto industry.\n\nIf the market pushes the XRP token above the resistance level of $0.5340, the bulls will regain momentum and prepare to test its upper resistance level of $0.60 during the coming month. Negatively, if the bears continue to dominate the market, it will plunge and fall to test its low of $0.47.\n\nRead Also : Bitcoin (BTC) Price Might Drop Below $50K Level: Here’s Why"
    }
]