[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxOdkozWlBEcTdJSzdXbExYeUlYRkZRVFNYX3JzQWFSaTZGZGlVS2FlVVJlZ0puNWdVbW9Ua0h2eGg0V3kzOUozUDYtOE52ay1pUHBZQmhMZkVNRmJ1WlN6dy1SbWl3MUIwemJiendPSHNMTGJBSWhSQmwyRkZqYmF3Q1BRWWJiZHN4NldPRUNXaVJhbUJPNUlfSlM5czhOSVpYZHlZWVpnZU80ZlNEdmFlMThac0RBdHJfZFFISHY1a1JLVUZtYjVYNnd5X2JkMW9pV0RRcVBuQlEwNUZkSXdJaFM4UGpVaXd2SkFj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "GoDaddy and Ethereum Name Service Simplify Connecting Domain Names and Crypto Wallets for Customers - PR Newswire",
        "content": "Users can now connect their GoDaddy domain with their ENS name for free, seamlessly connecting DNS to ENS and the Web3 ecosystem\n\nTEMPE, Ariz., Feb. 5, 2024 /PRNewswire/ -- GoDaddy (NYSE: GDDY), a global leader in domain registration and web hosting is excited to partner with Ethereum Name Service (ENS), a pioneer in blockchain-based naming systems, to enable domain name users to link their domains to ENS effortlessly, with no additional costs or technical experience required. This collaboration signifies a major step toward bridging the gap between the Domain Name System (DNS) and blockchain technology.\n\nDNS is a naming database that interprets readable addresses (domain names) into a unique string of numbers called an Internet Protocol (IP) address. Similarly, ENS simplifies complex wallet addresses into human-readable names. By connecting the two, it empowers domain owners with the combined security and reliability of GoDaddy, a globally recognized brand, along with the cutting-edge benefits of ENS's blockchain infrastructure.\n\n\"As a long-time domain industry steward, we are always looking for innovative enhancements that benefit our customers,\" stated Paul Nicks, president of domains at GoDaddy. \"Partnering with ENS presents our customers with a unique opportunity to experience the fusion of domains names and blockchain technologies, bringing some great benefits for users in both areas.\"\n\nWhile it has always been feasible to bring domain names over to ENS, barriers like high gas fees have limited the seamless transition. To help, ENS deployed new smart contracts to enable the resolution process of domain names in ENS, at the DNS top-level domain (TLD) level. This allows verification of DNS records, enabling a cost-free method for users.\n\nThis integration not only simplifies user experience but also fosters a sense of trust in digital identities. Domain owners and crypto wallet holders can now enjoy a newfound convenience, effortlessly linking their digital assets for efficient management.\n\n\"With this milestone, we are furthering our mission to build a more secure, decentralized and user-friendly internet,\" said Nick Johnson, founder of ENS. \"ENS, much like DNS, is a public good and a core part of the internet infrastructure. By pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.\"\n\nThis important advancement simplifies the use of digital properties, creating an environment of convenience and trust. Learn more about linking domains at GoDaddy. For additional information about ENS's integration with GoDaddy, click here.\n\nAbout GoDaddy\n\nGoDaddy helps millions of entrepreneurs globally start, grow and scale their businesses. People come to GoDaddy to name their idea, build a professional website, attract customers, sell their products and services, and accept payments online and in person. GoDaddy's easy-to-use tools help microbusiness owners manage everything in one place, and its expert guides are available to provide assistance 24/7. To learn more about the company, visit www.GoDaddy.com.\n\nAbout Ethereum Name Service\n\nThe Ethereum Name Service (ENS) is a distributed, open, and extensible naming system based on the Ethereum blockchain. ENS addresses allow anyone to register a .eth domain which they can then connect to multiple wallets, and use across all of Web3. Founded with an Ethereum grant in 2017 by Nick Johnson, ENS quickly grew as the most widely used permissionless domain name protocol in the world. With over 2 million names registered onchain and over 4 million names offchain, the protocol aims to become the neutral naming protocol for all.\n\nSource: GoDaddy Inc.\n\nSOURCE GoDaddy Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTmtMU3hjU3dLZG5nODBtQmtKUHQ3THlnWE9PMlZPcG9sblZXNlZFbVZDQng1eVZsNGxHR1UyMWREU2M1SGZ3ZFRHSURTTUprSzJOaVRnN0VyWF9qMEczM0NRU1VaeERYaERmRWxTaXA0RThueGxqNWFUWHNQRGJZUHY3WVBLekRIY293UndwaHNMUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "SEC seeks comments on Ethereum spot ETF proposal from Galaxy and Invesco - Crypto Briefing",
        "content": "The asset managers filed for an Ether spot ETF with the SEC in September last year.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC) has requested public comments on a proposed rule change to list and trade an Ethereum spot exchange-traded fund (ETF) from investment firms Galaxy Digital and Invesco, according to a filing published today.\n\nThe ETF, called the Invesco Galaxy Ethereum ETF, aims to track the spot price of Ether, the native token of the Ethereum blockchain network.\n\nThe SEC published the proposal in the Federal Register on November 8, 2023, and has now instituted proceedings to determine whether to approve or disapprove the listing.\n\nIn its proposal, the SEC outlined several areas where it is seeking feedback, including whether the ETF is properly filed under the Exchange’s rules for commodity-based trust shares, and whether arguments made for listing Bitcoin ETFs apply equally well to an Ethereum spot ETF.\n\n“Do commenters agree that arguments to support the listing of Bitcoin ETPs apply equally to the Shares? Are there particular features related to ether and its ecosystem, including its proof of stake consensus mechanism and concentration of control or influence by a few individuals or entities, that raise unique concerns about ether’s susceptibility to fraud and manipulation?” the SEC queried in its request.\n\nThe regulator also asked for views on whether the proposed ETF would be susceptible to manipulation given the nature of the Ethereum market.\n\nOther questions covered topics like the liquidity and transparency of Ether markets, potential surveillance-sharing agreements with trading platforms like Coinbase, and the correlation between Ether spot and futures prices.\n\nInterested parties have until February 27, 2024, to submit comments on the proposed rule change. The SEC will then review the feedback as it decides whether to greenlight Galaxy and Invesco’s Ethereum ETF."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5SX3FhUkpocG1ubWthQ2NjckpkT3Y3bzlVeFl3dXNrYUN2MXlaYTlvMm5UcnlrMzAzRmlRVUFWRjNWTW5SZjhneEN4UDhoeXRYbjRtY09ybS1KcEdYUmRSUUs4QzdfTlVNdHFvNnd4WlMxMTR3cUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "ENS partners with GoDaddy to enable users to link wallets to domains - Blockworks",
        "content": "Ethereum Name Service (ENS), a domain naming system on the Ethereum blockchain, has partnered with GoDaddy, a domain registrar, to enable users to easily link their wallets to web pages.\n\nENS can be considered the blockchain-based counterpart to the Domain Name System (DNS) that is widely utilized in Web2.\n\nDNS services assign unique IP addresses to devices, facilitating the translation of these addresses into user-friendly domain names for accessing internet web pages. Similarly, ENS services convert intricate wallet addresses into easily readable names.\n\nThis latest integration with GoDaddy, one of the world’s largest web hosting providers, will allow users to connect their simplified ENS wallet addresses with their DNS.\n\nBridging the gap between Web2 and Web3 comes with its own set of problems, however, like concerns around censorship.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nMost recently, Kubi Mensah, the co-founder of Gattaca, noted in a post on X that its domain was suspended indefinitely without any prior notice.\n\nAlthough the issue was resolved after escalating concerns to the senior management of the domain provider, the reason for the suspension was never made apparent.\n\n“We see this incident as a reminder that the fight against censorship is hard but worth every bit of our effort,” Mensah wrote.\n\nGenerally speaking, due to the decentralized nature of Web3 domains, entities themselves can not suspend, take or control an ENS .eth domain, Nick Johnson, the founder and lead developer of ENS, told Blockworks.\n\n“ENS .eth domains are censorship-resistant and tamper-proof by design; even the ENS DAO has no power to revoke or restrict a .eth domain,” Johnson said.\n\nHowever, this latest collaboration is a gateway for Web2 domain users to access blockchain technologies via their domains, and ownership of a DNS domain ultimately remains with the registrar.\n\n“Names that are imported from DNS — using our new integration with GoDaddy or our legacy integration — remain subject to the registrar they are held with, and the rules imposed by the registrar and ICANN,” Johnson said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQaVk5YTdwRDhSNXlMQV9hRTRtdHYyOEZYWlhGS1U4R2lrUzRCYXg2ekJ6emxUWktvQTBwOW5FUXJDeVplMjBEZjFYZE83My1aakJ3LUc2UnhGOWllTko1SGNwbm9zZWNYMF9pTVVWTlFHNGlHNGVtRWRQeFJlUndFc3U3NjBWUnd3elJFNG5TQkMxakFKT2ptWlY5akNVTWxfdm5N?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Watch K33 Research Senior Analyst on Solana, Ethereum - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQdWlLQ0xqNFp6allJY2Rtc05ZQWxmandEOGNuVnJkemluTlhRdFZsWWJFRkZaSVVyQVlfZjZuaDdValVPWjU0N1pHTjRTci15X1g3aDUzY3dsSlhuR2Rxbk0ybG4zTUt6UnM1RmgtTEI0bmRQU1Jmb0dHZDJMcFBfcXNVZXl2RnRqdkdicjVjdE54bmtzWmpRSlg2c0Zmc1UxZnRlOUNyd2NBSWFWcUNLNVNEWXYwSkwwLUtIZ3hUZC0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Outperforms Crypto Market as ETH 2.0 Staking Crosses $300M - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNaUFqM3Z3QndaVGpnWFpIMHNSZnR2c3VJQTlvQ2owa0hQbXg5YnlKZEJrbExNdFR5T0pEeWp1anFQOWtWeDB2aEtNMHB0REpzUXRURG5GM3FQUTdsNEpUM045V09QLWY2TlZUX0xpdDA5dk03Y0lFRE1nSUlSX3l4N3hoZTlXYTVtMGZkckc1MmVyQ2JKOGg1RWZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How 20 million GoDaddy users can finally add Ethereum to their websites - DLNews",
        "content": "A GoDaddy representative told DL News that DNS is a great piece of technology, but falls a bit short at “holding data.”\n\nThe domain registry giant selected Ethereum Name Service among a host of competitors in the industry.\n\nA key component of integrating ENS includes offering gasless transactions.\n\nAfter several years examining blockchain technology, GoDaddy is finally taking the plunge.\n\n“It’s been a few years. I’ve been talking at various conferences and formally to all different companies in the space,” Paul Nicks, the firm’s domains president, told DL News.\n\n“ENS is the first company that shared a vision, bridging the gap between the known, good, scalable, secure DNS infrastructure, with some of the cool emerging things happening in the blockchain space.”\n\nThe tie-up now means that from today, more than 20 million GoDaddy users will see a new button in their accounts, letting them link their web2 domains to the Ethereum Name Service.\n\nAfter that, it’s a matter of adding their crypto addresses.\n\nThe two firms are in the same business.\n\nWhile domain registrars like GoDaddy help turn clunky IP addresses into human-readable names, Ethereum Name Service does the same for the string of letters and numbers used for crypto addresses.\n\n“DNS is great as the phonebook, showing that this points here. Where I think it falls a bit short in creating some of the interesting technologies, is holding data,” said Nicks, explaining the firm’s move into blockchain technology.\n\nJoin the community to get our latest stories and updates\n\nEthereum Name Service goes gasless\n\nExecuting the new integration will be without gas fees, too, a key sticking point for Nicks’ move into the space.\n\n“That was what allowed us to really take this and say, ‘it’s good for our customers,’” he told DL News. “We pushed as hard as we could to make this super simple, and remove all the friction possible.”\n\nThe integration goes live today, but for ENS founder Nick Johnson, it’s just the beginning of the firm’s deeper integration with the Internet’s original phonebook — Domain Name Service.\n\n“We’re immediately working on improving the fields that are accessible to include all the ones that DNS supports, which means you’ll be able to basically use the domain as your crypto profile,” he told DL News.\n\n“If you then sign up with something like Farcaster, for instance, you would potentially be able to import all of your profile details simply by signing up and authenticating with your ENS name, which could also be your domain name.”\n\nAs for any other firms Johnson is looking to do business with, he told DL News that there was “nothing we can announce right now.”\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQOTAtV0RENDRuX1QzeU5PTGlCLW15V1NXcFI3SjZsOU9IYVhQYTJ2Y29xTHpVVDIxNGRGeUtYbmxndW1FaW9BTUl6ZUFfeGpVM2VvazBzRkliOFhwckUzOXZNd0RhT2swTXhlM0kwV2dqVEtOemxuc2JNWmpLaTEtenlXMkVwU3BNUjRuTl91dGlQcDBWWFJKU3lZOTBsV21kTVpURnRSb2pFTkFhNkxkalMtbDdRemw3RUVaakxB0gHDAUFVX3lxTE9tVVp4MXlGdlhxX3FJUGYtUWJQUHpIWXZWTGE4VTVBVGlpeXdJTDhWY0thVnAxN2VQcVNUMGlhNld3ejRoYkR0SWtVQ3NZWEtOZ0dQTTQ3Zl9rRjZ4ZHZERVRHOHhZVFBCdGc3NUZQR2JiZ3BaZmU3ZFhabVRqZjVkemlhQTBVTzNsMjdxVDQ2SHdxazV6dHRWdm9TdTRPdmszZWlxeGVlelNmY01mYUVoTkdzT3FCdTNSb0VpVlVmdGlkbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Apparent 'Insiders’ Make Millions After Grabbing Ethereum Version of Dogwifhat - CoinDesk",
        "content": "“I originally created the meme you all know as “dogwifhat,” @issa said on X. “With so many of you reaching out to me and the $WIF team never acknowledging me as the original creator, I wanted to clarify that I have no affiliation with them and never owned or received any allocation.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBWTlpTYk9xaW9STkZXbTZ5WndhNjM2OTl5V2k4T2VRQXpIZ25SLXFUYlhveXdSTWp3X180SUh0NTFuUWZmVlpKU0Y0VjE5SGoyMzV4M0tlSDF6TVBXMklCeXBQaHFlN3BNdlJRQdIBdEFVX3lxTFA1cEpQMVZka1dYQVFwVWwxUHdoYVZGeEhLeVRGSjZ1UGFlOTBzclVxakhzeGp1OEVDVnN0WTU0R3oxSzhpdUZPNjd0d3c3c1AtOUpXYUFQQ1ZDelVBVHN1TGpmWUk1SHZRQ2ozcUtSZ1U3WlNh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Robinhood Adds MetaMask for Easier Ethereum Buys - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto wallet MetaMask has integrated trading platform Robinhood into its product to allow customers to snap up digital assets with less hassle.\n\nIn a Tuesday announcement, Ethereum software company Consensys, which created MetaMask, said that American customers will be able to buy digital coins and tokens via Robinhood's low cost order engine. (Disclosure: ConsenSys also incubated Decrypt and is one of 22 investors in the company.)\n\nThe idea, the company said, is that the process of buying crypto from a number of different providers would be made quicker and easier. This means easier access for MetaMask users who are also Robinhood clients to Ethereum and Ethereum-based tokens, such as Uniswap (UNI), Chainlink (LINK), Aave (AAVE), Compound (COMP), andShiba Inu (SHIB).\n\nAD\n\nAD\n\nMetaMask is a popular Ethereum wallet and extension that can be used on browsers Google Chrome, Brave, Edge, and Firefox.\n\nIt works by connecting an internet browser to Ethereum's blockchain, allowing users to store their keys and make transactions with exchanges and on decentralized apps.\n\nRobinhood is an investing app which initially allowed users to buy and sell stocks but has entered the crypto world in recent years.\n\nHello @RobinhoodApp customers 👋! We’re happy to announce that US users will now be able to buy and transfer crypto on MetaMask with Robinhood Connect. Click below to read more about the integration: https://t.co/A5FoL9EBrq — MetaMask 🦊🫰 (@MetaMask) February 6, 2024\n\nSenior product manager at Consensys Lorenzo Santos said in a statement that the integration would \"help more people access crypto in a seamless and self-custodial manner, by offering more buying options with service providers they already use and trust.\"\n\nAD\n\nAD\n\nRobinhood Crypto's head of product Seong Lee added that the feature \"allows users to start using their crypto right away.\"\n\nLast year, Robinhood released a software wallet to compete with MetaMask, Robinhood Wallet, which allowed users to swap and transfer crypto, and view owned NFTs and crypto.\n\nEditor's note: This article was updated after publication to clarify that it is MetaMask that has integrated Robinhood and not the other way around."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOckdHWW1IOUlJZzc0SndHOEpFc28xSFBRRUN3RjhWOVJpdUhFVlhaUVREeVB6ZjFKa0NmWTBnUnVEQk1qNU15SG9iMExXOGYyMWR4cU01ZGxWRmsxY19DVmpGcWxiU1BFcnRqQXVkZGpUVElWVzVYSFNKWUZ5R21kSTBkOUhaVm16V2w5eXZwZm9Gc1ZxbWfSAZsBQVVfeXFMUDVsMFQ5dndPdUc0bG5naDAyNUhwVFU4MmY0M2k0UUNNdlhPaWRQYVhZZHRyTU9VRHUtWnVTdzY4dHlLV1F2TmdEcjZWQUdUazcwMy1la1NIVkNzU2JvNDlJY1NURjdrVGVFVzBkcEVlSUtrS1RhNW9xai0xRTNPd3I2ODJ3NlN2WEdob2dnNGFwQlJHbjdSa1gtZ2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Supply Drop Starts: Are We Seeing Beginning of New Ethereum Era? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum network has recently observed a noteworthy supply drop, entering further into the deflation area. This week's data showcases a supply change with a decrease of 393.60 ETH, leading to a total supply of 120,179,017 ETH. This decline does not immediately impact the asset's price; however, a sustained deflationary trend could signal a positive development for Ethereum's market performance.\n\nAdvertisement\n\nDeflation in a cryptocurrency like Ethereum signifies that the number of coins being burned — taken out of circulation — is exceeding the number being created or issued. Such a supply contraction, especially when continuous, can be beneficial for an asset's valuation, as it may enhance scarcity and potential demand over time.\n\nETH/USD Chart by TradingView\n\nAnalyzing the current Ethereum chart, we observe that ETH has been maintaining a steady posture above the 100-day EMA (orange line), a significant indicator of long-term market sentiment. This positive position, juxtaposed with the recent supply deflation, provides a solid foundation for a potential growth scenario.\n\nAdvertisement\n\nThe deflationary mechanism introduced by Ethereum's EIP-1559 is expected to play a vital role in the asset's price dynamics in the long-term future. As the network reduces its overall supply, each ETH token's relative value could increase if demand remains constant or grows. We might also consider this as a precursor to a new short-term era for Ethereum, where increased network activity causes severe deflation.\n\nThe recent outage of the Solana network adds an intriguing layer to the narrative. Historically, when alternative layer-1 networks face technical difficulties, Ethereum often benefits as the leading smart contract platform. The current downtime in the Solana ecosystem may redirect attention and activity back to Ethereum, potentially strengthening ETH's market position."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9ER09QN1JrbnpYazBRWmdmS1pGalFxR1hUZFZEbGFTaTh2alZZLXd1VVREQS15anZ1Y2ROLWlhTmZXa1lSYlVkSGJUUHktdUlUTFl6d1NfczIzM1djLWpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Gitcoin is restructuring to focus on grants for the Ethereum ecosystem - Blockworks",
        "content": "Gitcoin, an open-source software funding platform, has announced it will shift focus away from public goods funding and towards enhancing grants infrastructure designed for the Ethereum ecosystem.\n\nSince its launch in May 2021, Gitcoin’s organizational hierarchy has been relatively flat, with no CEO calling the shots. Workstreams, or focused groups dedicated to specific tasks or projects within the organization, have always required budgets to be approved through community voting — an often time consuming process.\n\nAs the DAO has evolved, however, it morphed from an impact-focused organization to something more technology-centric. Gitcoin executive director Kyle Weiss told Blockworks in an interview that this did not align well with the existing DAO structure.\n\n“It was too disjointed,” said Weiss. “In a DAO environment where everyone is fully remote, we have folks contributing from nearly every continent — stability, operations, and software development is really important, you need a core group of individuals who have context.”\n\nRead more: Gitcoin’s co-founder wants to return from the sidelines\n\nAs part of the new restructuring plan, two business units have formed within Gitcoin. One unit will focus on coordinating product-specific work, while a subDAO will manage matters of community and governance.\n\nWeiss noted that over the years, the company has experimented with various products. He said that some of these have been distractions, while others have been valuable to its growth.\n\n“A lot of 2024 is focusing on grants. We want Gitcoin to be much more associated with grants, whereas right now, our narrative has been around public goods funding, and that shift is because we’ve moved from being an impact organization to a technology organization,” Weiss said.\n\nFor this reason, Weiss explained the DAO will transition from independent workstreams towards a structure more akin to a “Labs” structure. This is something that is common among existing protocol development teams, similar to how Uniswap has Uniswap Labs or how Optimism operates with OP Labs.\n\n“We want to make sure there is stability in the software development side and then give the DAO material scopes of work to own,” he said.\n\nWeiss says that by granting software development teams greater leadership and more defined decision-making powers, the community can remain concentrated on achieving results through the grants programs via token voting.\n\n“I don’t know if the token holders are the right people to decide on multi-year roadmap decisions on the technology side,” Weiss said.\n\nGitcoin co-founder Kevin Owocki shared this sentiment.\n\n“It’s not proven that DAOs can develop software, so the Labs team is designed to recognize that in our organizational structure, and make sure that we’re building world-class software.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOMEtnZnlJZkdNb0MyREl2dTBHRURweGhHeFpkWlZuaWt4RkRRX0hVLTFWUmJjLU5zVmV5UDc5cGtXM1N6VmROeS1INFYzNm5LWVFOVEU2UVZDZDZDc2lQbGYyUkF6LXhIelk5MjdZWVg1cUhwTVpmeG9nUHBybkpkeDlmblROMWRKVmFodHZaWE43TkZwZmRyZEJIdUs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum experiment ERC404 is an NFT-cryptocurrency hybrid — and it’s already generated $87m in trades - DLNews",
        "content": "ERC404 is a novel token standard on Ethereum, combining the attributes of NFTs and fungible tokens.\n\nFor NFT traders, that means more liquidity and trading flexibility.\n\nTokens on Ethereum fall under two broad technical categories standards: non-fungible ERC721 and fungible ERC20.\n\nNFTs, or non-fungible tokens, are designed to be proof of ownership on the blockchain and each token of this type is unique. Fungible tokens, or simply known as cryptocurrencies, are not unique: one Shiba Inu token is the same as the other Shiba Inu token.\n\nBut a new experimental token standard, dubbed ERC404, seeks to make a hybrid of those two standards. Its implementation through an NFT collection of Replicants has piqued the interest of traders, resulting in about $87 million in total volume on decentralised exchanges and just under $1 million in total volume on NFT marketplaces in just the last week since its launch.\n\nUsers can sell their Replicant on popular NFT marketplaces like Blur and OpenSea or they can sell the fungible Replicant tokens on popular decentralised exchanges like Uniswap.\n\nThe price of one Replicant has risen from around 0.38 ETH on February 3 to over 4.26 ETH, giving the collection a fully diluted value of over $88 million putting them in the top 15 NFT collections.\n\nA new Ethereum token standard\n\nERC404 is an experimental token standard on Ethereum meaning it has yet to receive a full external audit.\n\nToken standards are simply a set of rules that smart contracts must abide by. The ERC20 token standard sets a series of rules that tokens must abide by, while the ERC721 token standard sets the rules for non-fungible tokens.\n\nBy combining these standards, each Replicant holds qualities of both a token and an NFT.\n\nJoin the community to get our latest stories and updates\n\nThis is different from fractionalised NFTs, which break a single NFT into tradable pieces, as this gives users the ability to sell shares in a single NFT, not an entire collection.\n\nERC404 greatly improves the liquidity — availability of funds — for NFTs, which are typically highly illiquid assets.\n\nUsers do not need to list their NFT and wait for someone to buy it — they can always sell the token on a decentralised exchange, like Uniswap, which has $19 million in liquidity for the PANDORA/WETH trading pool.\n\nThe new token standard has a few quirky consequences.\n\nIf the user then sells the fungible token, the NFT linked to it is destroyed. This dynamic where a new NFT is created upon purchasing one full token has caused the volume on decentralised exchanges to explode relative to the volume on NFT marketplaces, due to users trying to “re-roll” to try and get a red Replicant, the highest tier in rarity available. In NFT collections, rare traits command higher prices.\n\nThis frenzy has benefited liquidity providers on the token’s Uniswap pool. The 1% fee on trades in this pool brought in just under $1 million in fees since February 3.\n\nBlur integrated the new standard into their marketplace within just two days. Others like BananaGun, a Telegram trading bot, announced ERC404 support today. Multiple other NFT projects have launched, or announced they will launch, also using this new experimental token standard.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOSy1PXzNraGo3WklQM0stOFJFT0k1emN5OGllRGtYb0l3dVhQUmo0Q3k4bjczY1pMdFhWb2Utanl3cmFkNmt1SUVaTXFydUg2bFMzN2dtZFFGVktBZ2hubm1tNG1xVWRzRHRLQkdlYlZvcnBlWXM3Q29SaV81TWN3dXhvaDNlQ3BQV1o1UThR0gGTAUFVX3lxTE1rWUItLXFTRnFXQ3pHdHM2YmZKaVMxaF9IOUJub1FFbGZDZWdlN0Jjblpyemg1em5QSzFKZlowVmlrWkt0SFNDdjJBcUZReDN0Mm9Dd1owTXN0ME1VS0FUb28xMnFwbkh4VVJ4dy1mZFFCLWJ6d215bzdOUEFNQ0Fzd19SM0lDUzVSNW96dmpLWWFaaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "SEC Delays Another Ether ETF Application - CoinDesk",
        "content": "The proposed product would allow professional investors to directly gain exposure to spot ether. Currently, ether futures listed on CME are one of the only ways for regulated U.S. investors and funds to bet on Ethereum’s growth."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1kUXdvbjlRbThLd2dubFpLcFBTWE84czdvdkRWcjl2SF9ISS0taVNTZ0pnZ3k4WjdiYmtLU3hSUzF2NE9wWkhVekluN3c4STVRWWxCYlQ1bHUwanNRV3F1VFRHZjFIRm4yN0llN0Q5cFZmMWNzOFBhaG9sNNIBgwFBVV95cUxOYVU2TlFsUmlHSndYaXJ3dF9ldTlWSDdvbUQ4V2FUVmwwdlVKY3JNT3RTQUwtaDliSnpMUUJEUFJucl84X0pnQVhWc1Z2UVNHb21CeDMwbE1vcGQteFU0U2paZzNlTlhabUg0cFBrTDBpM0ZxUGFWRVJkTG1RVGJJcDYxaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "You Can Now Use Your .Com Domain as Your Ethereum Address With GoDaddy and ENS - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum Name Service (ENS) domains are different from traditional Domain Name System (DNS) website domains. ENS domains can be assigned to an Ethereum wallet to ease the hassle of sending funds and assets, as they're much easlier to remember than a typical alphanumeric wallet address. But typical web browsers can’t do much with them.\n\nThe two are getting closer together, though, thanks to a new alliance between ENS and GoDaddy. The web domain registrar just linked up with ENS to make it possible to tie a DNS address (like .com or .net) to an ENS name (.eth), so that the DNS domain can be used with crypto apps, wallets, and more.\n\n“With this milestone, we are furthering our mission to build a more secure, decentralized, and user-friendly internet,” ENS founder Nick Johnson said in a release.\n\n“ENS, much like DNS, is a public good and a core part of the internet infrastructure,” he continued. “By pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.”\n\nAD\n\nAD\n\nThanks to Gasless DNSSEC, users can now easily associate an Ethereum address with their DNS domain name (.com, .xyz, etc.), allowing seamless integration with all applications that properly support ENS! 😱 Just follow these simple steps! pic.twitter.com/rdE7KGicup — ens.eth (@ensdomains) February 5, 2024\n\nAccording to a blog post, GoDaddy has added a new section to its domain management dashboard, letting users pair an owned ENS name with the owned DNS name. There are no additional fees to use the feature, and ENS says that your DNS domain name can then be used in place of the ENS address on supported exchanges and marketplaces, for example.\n\nENS says it was previously possible to import DNS names over to its Ethereum-based decentralized architecture, but that it was a costly process that could cost as much as 0.5 ETH—about $1,150 worth at present. But last week’s passage of the Gasless DNSSEC functionality enables the move without such exorbitant network fees.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdk5EZFBoS1hBNVBtWDB3SlJSQ3JHVXhXbWZQdlo5VWV6RzVGRTBDNm1ic3ZJX0ZRMUJfajZTSjlVZFhmSWFFQnlTd2t1c29rZ0Zqak15N2lxdHVPOGF2M2hrWlYxQjY5WXowSHNiWW9PQk5KdzRvX1VINTl3TXpocFlDV1poUmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin halving will impact Kangamoon, Ethereum, and Optimism - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nIn 2024, Bitcoin halving will happen. This event will likely impact altcoins like Kangamoon (KANG), Ethereum (ETH), and Optimism (OP).\n\nEthereum is evolving\n\nIn the coming years, Ethereum will continue to upgrade.\n\nAs it is, more institutions are adopting Ethereum, which has led to an increase in its total value locked and transition to a deflationary asset.\n\nDespite potential challenges, experts are bullish.\n\nETH is steady, with supporters bullish that a spot Ethereum ETF will be approved.\n\nOptimism navigating trends\n\nOptimism, a layer-2 scaling solution for Ethereum, has made notable progress ahead of the Bitcoin halving in 2024.\n\nIt has upgraded and integrated with Orderly Network.\n\nOP is trading at $3.16, down from $4.20.\n\nThe integration of OP’s Stack on January 21, 2024, is a significant milestone for decentralized finance (defi).\n\nIt is expected to bring more users and liquidity to Optimism, boosting its overall economic activity.\n\nThe integration has led to an 800% increase in address count on Optimism, indicating growing interest and adoption.\n\nMarket analysts have mixed predictions for OP’s future price. Still, the overall sentiment remains optimistic, given its role in the expanding Ethereum ecosystem and its contribution to scaling solutions.\n\nKangamoon’s future\n\nKangamoon combines social and gaming elements.\n\nIt aims to create a community where members can participate in various challenges and earn rewards and KANG.\n\nKANG is changing hands at $0.005 in the ongoing presale, but analysts expect more gains.\n\nYou might also like: Cardano takes on Ethereum, analysts bullish on KangaMoon\n\nKangamoon doesn’t have taxes on buying or selling KANG.\n\nAs the cryptocurrency market changes, Kangamoon’s unique approach and focus on the community could make it a significant player in the meme coin and digital gaming markets."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQNkVlaVVNQWpMVE9qcTNLMFdaME1uRFlVaG5pSDlFb0Iwa3JTWE83TVJXSlVYVHZTRFFpYVp0YzVjN3lBTzh0Q3R4TjIwN1V4SEhHWV9zRU1YM21Xc3U5bDhBUFdXY3RiRUlxVkVINGI4NHVQVW1WajBsQ19xT3pjSm1LalBzV0t3dDh3Z2lveVotd1RGYmF1NDg2cGotTHdDaTA1SWMycEl4ekFtdkxnbkotSkx2NVZweW5vMkZwZ1FLOWfSAcgBQVVfeXFMUFJ2a0poOE1mR1VjR1R2R3piVGVRMU1zekVKaVlQT3BFLUhxaHF0cW9IS2JsalM0bTlxUlN5NHFDcFllQ3owLTI2VnhiS2JNVXF6ZlZvWGlFcUhiMXp2NXNwTERXSzVjZ0dFYWZOLTBkd1diaHlqemtneHlxdU5GaV9ybHp5aGNrcWt6NTViYW1UUjhkc2F6VEhXRV9XZmphaVFjVmxBRjJmN1J1NjV5enJORk1rTVdEUGgwd3NJSk9iSi0wX0NQcUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Web Registry GoDaddy, Ethereum Name Service Connect Domain Names With Crypto Wallets - CoinDesk",
        "content": "“Right now you can use this integration to set your Ethereum address, but going forward, it ought to be possible to do this for addresses for all chains to set text records, so you can make your .xyz or your .com, your Web3 profile.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBwTkhUb19tblRwNkQ4WWtYVmNVZlJMczdnN1hBREgtdmFoRFo2Y1JsV0NlcWVKQVk1YmJaeVJ1c0tXLVRuTXRCaDYwbWVtLVZVZ3BhSkNMaFRCWWw0Y1NCUmlBUjRJVTdUSTY2a0hWOC1tWWZhNlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Europe leads Ethereum ETF market with $4.6b AUM - crypto.news",
        "content": "While U.S. regulators deliberate on spot Ethereum ETFs, Europe and Canada already boast billions in spot and futures ETH-related products.\n\nPer a Coingecko study, Europe dominates the global Ethereum (ETH) ETF scene with an 81.4% market share. The area has 13 ETH-backed ETFs split across spot products and futures funds, amounting to $4.6 billion in assets under management (AUM).\n\nCanada is also a big market for ETH ETFs and commands a 16.6% market share of $949 million in AUM. ETFs have also become a gateway into crypto for many Canadian investors. Local regulators introduced stricter measures on crypto companies, leading to an exodus of exchanges like Binance and Bitstamp.\n\nGlobal ETH ETF AUM stood at $5.7 billion as of Feb. 2, spread over 27 ETFs featuring both spot and futures funds. European Ethereum ETFs have traded since 2017, when Grayscale launched its ETH trust (ETHE). However, Grayscale’s fund was excluded from the study due to its close-ended structure.\n\nThe company was engaged with the U.S. Securities and Exchange Commission (SEC) over converting ETHE to a spot Ethereum ETF, but a decision was delayed till May, crypto.news reported.\n\nGlobal Ethereum ETFs markets | Source: CoinGecko\n\nYou might also like: Standard Chartered foresees Ethereum ETF approval by May 23\n\nSpot Ethereum ETFs in the U.S.\n\nFollowing approval of spot Bitcoin (BTC) ETFs in the U.S., SEC chair Gary Gensler stressed that Ethereum-based products may not receive the same treatment. Gensler has repeatedly reiterated that most cryptocurrencies qualify as securities and must register with the SEC.\n\nHowever, the SEC’s loss to Grayscale in court and the eventual approval of spot BTC ETFs on Jan. 10 may better the chances of a green light for spot ETH funds. A U.S. court found that the SEC’s denial of spot crypto products while allowing futures-based ETFs was “arbitrary and capricious”.\n\nSEC Commissioner Hester Peirce also said Ethereum ETF approvals will not be the same as the Bitcoin counterpart, where a court ruling was required to cajole the securities watchdog into reassessing its decision.\n\nIn the interim, several spot ETH ETFs have been delayed until the second quarter of 2024, including bids from issuers like Fidelity and Invesco Galaxy."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPQ05Jc0FOTWU0Mk9OcmF5SFZBbmF0bVJlRWdpMUE1YXBYb21qdjZtUjg5S0lSSm1jd2RVeXZKdGRhMWRES3VNV0ZuZFItSDVvWGlFRkVPeHoyd1RYSklDc2tmaDVtRER6TURhSDc4V0RxLVFmdFYySGo0RVN1NHhOeHdWNEtheEowZzFSLUlyMmFGX282VHRmeGRfcWRMNXdVQlBIeTJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum price gaps narrow on U.S. crypto exchanges post-spot ETF approvals - crypto.news",
        "content": "Bid-ask spreads on major U.S. exchanges like Coinbase and Kraken have tightened post-spot ETF approvals, signaling enhanced market liquidity and depth, analysts at Kaiko say.\n\nBid-ask spreads for Bitcoin (BTC), which represent the difference between the highest bid and lowest ask prices, have decreased significantly post-approval, indicating an improvement in market liquidity and deeper trading activity.\n\nIn a recent research report, analysts at Kaiko revealed that U.S.-based crypto exchange Kraken experienced the highest volatility in spreads during January, reaching a peak of 10 basis points on Jan. 20. Similarly, spreads on Bitstamp and Coinbase also peaked between Jan. 8 and Jan 13 at 6.7 and 1.7 basis points respectively, before plummeting to below 1 basis point in recent weeks.\n\nBid-ask Bitcoin spread on crypto exchanges | Source: Kaiko\n\nKaiko pointed out that the trend extends beyond U.S. markets and Bitcoin, as the average bid-ask spread for the most liquid BTC and Ethereum (ETH) trading pairs has also declined across various crypto exchanges.\n\n“Coinbase and Kraken saw the strongest decline while the drop was less pronounced on Binance and OKX, which already offer very low spreads.” Kaiko\n\nAnalysts say the approval of spot exchange-traded funds (ETFs) will eventually fuel a new wave of competition among exchanges, as Coinbase has already announced fee waivers for large traders, which is expected to further drive down spreads.\n\nAs crypto.news earlier reported, the U.S. Securities and Exchange Commission (SEC) has greenlit all spot Bitcoin ETF applications. Nonetheless, Gary Gensler, who has maintained a critical stance on cryptocurrencies since assuming leadership of the U.S. financial regulator, reiterated in a statement that the SEC “did not approve or endorse Bitcoin,” despite approving spot ETFs."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE93blJjanFZaUNOSlgwTUFicE5wTUtubTQ0UHlmTEVRSU10LVM4NnIyWFVWaTJITk1tNGdsTkRBVkZhNlhGb09fZThzQ1o0ZHExRDhXc2JBNGdFNUZaOWtBVEJja2tTZGRMUnFyaUZBbkZOUlhEa1h4NjAyaVnSAYQBQVVfeXFMTWJaeFowNndqSFp2OW5oeU9DRmJVWHFTM3BqQm1MZTd3N0haRjFDX3lKN3dnc3djQW9zaUFKSUM5Nkp3cTItclNRLWhNT3NoYmlXZU84Mk5vUE5ZZWFPMGkzVXpZa2pZOEdKdkVYSGNFNExvdFFEUUpHanQ5eldzRTNtUHFI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Praises Farcaster, Disses Friend.Tech - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDecentralized social media protocol Farcaster is crypto’s latest obsession—and unlike other blockchain-backed social networks that have come and gone, Ethereum co-founder Vitalik Buterin seems to think this one can go the distance.\n\nIn response to a Twitter post early Monday about the failures of Friend.tech, another decentralized social app that quickly lost steam after a rapid rise in attention, Buterin appeared to write that platform off as doomed due to its speculative approach.\n\n(Video by Rug Radio Creator Benjamin White.)\n\nAD\n\nAD\n\n\"Bad GameFi is using financial speculation as a substitute for fun—blockchain games need to be fun as games,\" Buterin said. “I believe a similar thing for crypto social.”\n\nIn contrast to using “financial speculation as a substitute for fun,” as Buterin apparently believes Friend.tech did, the Ethereum creator praised Farcaster, as well as decentralized social media protocol Lens, as products that will stand the test of time.\n\n\"Bad gamefi is using financial speculation as a substitute for fun. Blockchain games need to be fun as games\" - approx quote I've said many times I believe a similar thing for crypto social. Registering a prediction: farcaster and lens will NOT be deserted in 4 months, or 1 yr. — vitalik.eth (@VitalikButerin) February 5, 2024\n\n“Registering a prediction: Farcaster and Lens will NOT be deserted in 4 months, or 1 [year],” Buterin wrote.\n\nFriend.tech, which lets users buy and sell shares of their friends’ social media profiles, exploded in popularity last summer. Critics, however, dismissed it as a Ponzi scheme that relied upon speculative momentum to attract users, the majority of whom were mainly interested in turning a quick profit.\n\nAD\n\nAD\n\nThe concerns were founded: Within months of Friend.tech’s delirious highs, activity on the platform collapsed spectacularly. It has yet to recover: At writing, daily transaction volume on Friend.tech has fallen 99.6% from September’s highs, according to data compiled by Dune.\n\nFriend.tech’s volatile arc rhymes with those of many projects in the crypto sector that catch heat and make headlines, only to collapse as soon as speculative interest wobbles.\n\nFarcaster, by contrast, is not driven by financial incentives. A decentralized network of social media apps, Farcaster apps operate like standard social media sites—with the added benefits of privacy, censorship resistance, fewer bots, and user-friendly tech innovations.\n\nOne such innovation, Frames, has catapulted the network to unprecedented popularity in recent days by allowing users to perform numerous functions within a social media app—like playing games, making online purchases, and minting NFTs—without having to exit to a third party.\n\nIn the last week, thanks to Frames, user activity on Farcaster has shot up a tremendous 1,300%. That degree of success has previously (temporarily) graced other on-chain social media platforms, including Friend.tech—but Buterin appears confident that this streak, at least, won’t signal yet another flash in the pan.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTThLaEdubHZBUUNjR1pHX1lPc2hpZ0t2SmpMTXFvRXVPS1c1X191Z1JUUjA4OVlqOGtVNFpHSDVtckpOcVc0ZHIyTWI2dHZWQl9iVEhJOEFBNVRkM3I4ZjVIVDVac1l5Zk9lZlRxSFg1QkdLQTBGWHV3SEhNUWdBedIBiAFBVV95cUxOQ05KVmpiZmhFMkxVT3hBNHRJZ2huT0gzWE42VVdsMGFwVGRhU0xQN3ZQV3F3aWVTNVlHSFcyV1ViOWFSYzJqS1FyZ1B4RDRCYkxsOE01U1VHWHY3azBsR0kzLVNraWV4WlRFWVh1Unp5QU1rcjNFM2R4c0VrTUNVODZlcm55QW43?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Dymension Goes Live, Airdrops $390 Million in DYM to Solana, Ethereum Users and More - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDymension’s anticipated airdrop took place on Tuesday as the network’s mainnet went live, serving up over $390 million worth of DYM tokens for early users and select communities as the token surged in value following the launch.\n\nDYM is currently up 58% on the day to a current price of $5.60, according to data from CoinGecko, with some $246 million worth of trading volume already on exchanges including Binance, ByBit, and KuCoin. The airdrop spans 700 million DYM tokens, representing 7% of the total supply.\n\nDymension is a network built to let developers deploy app chains that it calls RollApps, and it’s a layer-1 blockchain built using Cosmos tech and the inter-blockchain communication protocol (IBC) to connect with various other chains. Builders can choose from various virtual machines and tokens on their RollApps.\n\nThe “genesis rolldrop,” as Dymension called it, was available to more than a million unique wallets across various chains and communities, including users on the networks Solana, Celestia, and Ethereum scaling networks such as Arbitrum, Optimism, Base, and the upcoming Blast.\n\nAD\n\nAD\n\nCertain communities could also take part in the airdrop, including holders of the popular Pudgy Penguins NFT collection on Ethereum, as well as Mad Lads and Tensorians on Solana.\n\nWhile more than a million wallets could have claimed a share of the 700 million airdropped tokens, the claim already took place in January—and only 528,523 wallets ultimately made a claim, which means that around half of eligible users left money (or DYM) on the table. Those tokens were ultimately redistributed to other users.\n\nDYM is currently the second-largest token airdrop of 2024 based on the total value of the dropped tokens. It follows decentralized exchange (DEX) aggregator Jupiter on Solana, which airdropped 1 billion JUP last week—which, at the current price, puts the total value of that drop at $527 million.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPOHcxRzFVNG1fVGk0MkFWektiRVJMdEZzelJPbUVRa0xpQVo5aVVHOXBkYktmY0VuSGFVSlVKYzBwdDI5OXNqUHFOMVdBNlg5ZWtMVmdMekpGVW1QcjhjY1EtT1RVLVBxb2xjWU9wYzZnbHJOc0RleEU1cmdZXzB1MlZ5YWo2WjFTY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Analyst: this coin may outperform Bitcoin and Ethereum in 2024 - crypto.news",
        "content": "Although the broader market has been relatively flat, the Bitcoin Minetrix presale has been active, pushing raised amount to over $10.3 million. Some supporters now believe Bitcoin Minetrix (BTCMTX) could outpace top coins like Bitcoin (BTC) and Ethereum (ETH) in 2024.\n\nThe project incorporates a stake-to-mine model for utility, adding value to its ecosystem.\n\nBTCMTX versus BTC and ETH\n\nSince Bitcoin and Ethereum are considered some of the safest (least volatile) cryptocurrencies, market participants often expect more sizable returns when buying other projects.\n\nNew coins typically have more upside potential because of their lower market caps.\n\nMeanwhile, the prices of Bitcoin and Ethereum are less volatile in each market cycle as liquidity grows from expanding market caps.\n\nBitcoin Minetrix will lists on various exchanges at a later stage; an opportunity some investors plan to exploit.\n\nBitcoin Minetrix’s stake-to-mine model\n\nBitcoin Minetrix takes a novel approach to one of crypto’s most pressing issues: Bitcoin mining.\n\nThe project has created a cloud mining solution on Ethereum for users to mine Bitcoin.\n\nYou might also like: Analyst says Ethereum can reach $10k in 2024, new altcoin likely to follow\n\nIt requires no specialist hardware or technical expertise. This addresses the problems of high-startup capital and skill requirements to begin Bitcoin mining.\n\nBitcoin Minetrix enables anyone to easily get started.\n\nTo get started, users stake BTCMTX, in exchange for Bitcoin mining credits. They can then burn these credits for cloud mining power, mining BTC.\n\nEarlier cloud mining solutions are regarded as shady due to a series of scams that have been carried out.\n\nThe Bitcoin Minetrix whitepaper highlights this issue, explaining that cloud mining protocols would lure investors with decent gains and then present “unwarranted complexities” once users deposit more cash.\n\nHowever, Bitcoin Minetrix believes in transparency and fairness, ensuring all transactions are recorded on-chain.\n\nFurthermore, no cash changes hands with Bitcoin Minetrix thanks to its stake-to-mine model.\n\nWill Bitcoin halving impact BTCMTX\n\nThe Bitcoin halving has correlated with the beginning of every crypto bull market.\n\nThe event, set for early April 2024, will halve miner rewards, creating a supply and demand discrepancy in the market.\n\nYou might also like: Next Bitcoin halving just 15k blocks away\n\nThis development might drive prices higher, possibly lifting altcoins like BTCMTX thanks in part to the project’s correlation to Bitcoin.\n\nSince Bitcoin Minetrix users earn real BTC rewards, the value of Bitcoin Minetrix is tied to the Bitcoin price.\n\nBitcoin Minetrix tokenomics and presale\n\nBitcoin Minetrix tackles the mining problem but captures value using BTCMTX.\n\nSince BTCMTX is key to earning rewards and can be staked, it will relieve the token of selling pressure.\n\nAlso, staking rewards are primarily paid in mining credits, not BTCMTX. This differs from most other staking coins, which pay rewards in their native token, leading to sustained sell pressure.\n\n42.5% of Bitcoin Minetrix tokens are allocated to Bitcoin mining, 35% to marketing, 12.5% to staking, and 10% to the community.\n\nIn the current presale stage, BTCMTX is available for $0.0133."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQVFlWTZpdkFNNVR5QlpCdk1GYXVTSGdyQVJ1UDltajdkM09sRUxvOElDckszaVlfaXl4WVFROFpVSTVXeDNuYWt5eFpma1pXVTVaU2Z1RDc5b1YxUmV4R1BKZUwtX3VCdkdydTM5MnQzS2RXOXU5dkR0bmFHUVFpWNIBiAFBVV95cUxQRFJLMWRLOEw2MXg1SmJnaVdnR2dXQ081ZDRKb0ZKd2g3Y3BtNzExRXBGem1QMEg2bGh0dHBJQWRLOHB4S3hyUVhOOWhsTGJiOVdCWFFvQ2ZKbTY4YmpudlFKUnZRZV9DMldwaWdOaUpUWVJPVjBUZ2tVX19WUkhZNDJpU3NsVkNM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "'Heroes of Mavia' Airdrops Token to 100,000 Gamers, Ethereum NFT Owners - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHeroes of Mavia, a recently released mobile strategy game, today launched its MAVIA token and conducted an airdrop to 100,000 players—along with holders of some 10,000 Ethereum NFT land plots in the game.\n\nThe MAVIA token on Ethereum debuted early Tuesday and has spiked in value, jumping about 36% to a current price of nearly $3.10, per data from CoinGecko. The platform reported about $95 million worth of trading volume on exchanges like Bybit and Crypto.com, with a current market cap of over $92 million.\n\nDeveloped by Skrice Studios, Heroes of Mavia is a iOS and Android strategy game that’s very similar in approach to the smash mobile hit Clash of Clans. Heroes of Mavia will implement the MAVIA crypto token, however, and Skrice has sold NFT land plots that will be integrated into the game.\n\nAccording to Skrice, more than a million people downloaded the game following its release last week. The studio launched an airdrop program for 100,000 total players who synced their game account to the Heroes of Mavia website, and all 100,000 slots were quickly filled ahead of the token launch.\n\nAD\n\nAD\n\nHeroes of Mavia has reached 1,000,000 global downloads on iOS and Android 🎉 Join us on our mission to bring mass adoption to Web3 gaming - one player at a time! pic.twitter.com/5KyknZaOQA — Heroes of Mavia (@MaviaGame) February 4, 2024\n\nFurthermore, people who own the Ethereum land plots and participated in NFT staking programs that began in early 2022 will also receive a share of tokens.\n\nSkrice Studios has raised over $8 million in funding to date, with backers including Binance Labs, Crypto.com Capital, and Animoca Brands.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQcmtsSDVZc3N5TmRScGdFeTBBaFVzanJ5bDN6ZUxkcVhPVGJWY3NtLXlMVVFhaVhMZ1dQWFJPak5Db1pUbHhhSmVGRDJwT0VlUXQ4QWVhanYtOUYtRVhId0lHRE5tZkpXQjBKRkptUk1TMmVHUEF6a2F3dnotS3pQSnJrUFhCak9WSXJQSERSY0NGOVFoZkM0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Crypto SWOT: Is the U.S. SEC ready to approve spot Ethereum ETFs? - Kitco NEWS",
        "content": "Frank Holmes is CEO and chief investment officer of U.S. Global Investors, Inc., a boutique investment advisory firm based in San Antonio that manages domestic and offshore funds specializing in the natural resources and emerging markets sectors. The company’s no-load mutual funds include the Global Resources Fund (ticker PSPFX), the World Precious Minerals Fund (UNWPX) and the Gold Shares Fund (USERX).\n\nPlease consider carefully the fund’s investment objectives, risks, charges and expenses. For this and other important information, obtain a fund prospectus by visiting www.usfunds.com or by calling 1-800-US-FUNDS (1-800-873-8637). Read it carefully before investing. Distributed by U.S. Global Brokerage, Inc.\n\nAll opinions expressed and data provided are subject to change without notice. Some of these opinions may not be appropriate to every investor. Foreign and emerging market investing involves special risks such as currency fluctuation and less public disclosure, as well as economic and political risk.\n\nThe S&P/TSX Global Gold Index is an international benchmark tracking the world's leading gold companies with the intent to provide an investable representative index of publicly-traded international gold companies. The FTSE Gold Mines Index Series encompasses all gold mining companies that have a sustainable and attributable gold production of at least 300,000 ounces a year, and that derive 75% or more of their revenue from mined gold.\n\nHoldings as a percentage of net assets as of 6/30/07: Jiangxi Copper (China Region Opportunity Fund 1.74%); Silvercorp Metals Inc. (World Precious Minerals Fund 2.78%, Global Resources Fund 0.89%, China Region Opportunity Fund 2.42%); Gold Fields Ltd. (Gold Shares Fund 6.05%, World Precious Minerals Fund 2.58%, Global Resources Fund 0.39%); Sino Gold Mining Ltd. (Gold Shares Fund 1.03%, World Precious Minerals Fund 0.58%, China Region Opportunity Fund 0.27%); Anglogold Ashanti (0.0%); Dynasty Gold (0.0%)."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxQVV9uVl9IUFNXZGVjS3R5UDg3MExYR3NZUGlEVE4tcWx4RUFVZ09nTU8wbG44YUZfdjUtLUJOYW1wVUtSSl95dzZxZDhqRU9UUnNqRkFiLTBGWTduZGRxTGk3MnBLSlg5blBFSlFsRUgwYmRseVppVDNSaThxX25RSWpBc0poemdjdDZJZm8wRWFaVmw3REJGSGVHeVNQdTVhZWRtYWItb2k3STRGN3FTNm9USjNtREdwRjNNdmpNY1ZkdjF2dVJSVEhvUlIyZTNhcTRrQndPTnpIWGxPUC1DR0dDTk1MQ2J0bXIyVlFPdDRNZVN4NFHSAfsBQVVfeXFMTkRmNy1QazhKRTF3bXJma09mUjJPNmpORV85aXVLVThXTC14RTJCcDVpajFyRk15MDdueDFWVjRHanZtVXZQUWdfcVVLaUthZV9ZekdzVHhnbjJCNzZsSWM3RXFGX3FaUFZsRTZnRUZRZ3dpWkoyeGV4NEVpenpicWtTOTVSbXRZVUdIUWhIMW42bFpPMG01RE9PWnZ2b1dsdllnMzdzOS1jUFFibGstM19SYnF2UTZVaHdjRzcxYXowOF93MU5ra1pXTW5KdHBJMU14RTN2QXJTdUx4RmhBT0g1MGhudWpkazNGbWVrZ2h6OFFzelNOZGVITTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to record rash move soon as Bollinger Bands contract - FXStreet",
        "content": "Bitcoin price could fall 5% to the support confluence between 100-day SMA and horizontal line at $40,650 as boring chop continues.\n\nEthereum price could revisit $2,200, a 4% correction, as the 50-day SMA proves impenetrable.\n\nA retest of the October lows around $0.4734 seems likely for Ripple price as XRP token holders show weakness.\n\nBitcoin (BTC) price continues to record a boring chop, trading horizontally, with altcoins such as Ethereum (ETH) mimicking the price action. Meanwhile, Ripple (XRP) price continues to suffer in the hands of unmotivated traders.\n\nAlso Read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nBitcoin price likely to fall 5%\n\nBitcoin (BTC) price is trading within a range, consolidating between the centerline and the upper band of the Bollinger indicator at $41,895 and $44,210, respectively. With the two Bollinger bands contracting, BTC could record an impulsive or rash move soon.\n\nThe Relative Strength Index (RSI) is closely bearish, teasing with a cross below the signal line (yellow band). The Moving Average Convergence Divergence (MACD) also appears subdued with miniature volumes on the histogram bars. This is also reflected in the Awesome Oscillator (AO), tilting the odds in favor of the bears.\n\nIf the bears have their way, Bitcoin price could descend 5% to find support due to the confluence between the 100-day Simple Moving Average (SMA) and the horizontal line at $40,650. If this level fails to hold as support, BTC could extend the fall into the demand zone between $38,496 and $39,582. A break and close below the midline of this order block at $39,196 would confirm the continuation of the downtrend, potentially going as low as the $37,800 support.\n\nBTC/USDT 1-day chart\n\nConversely, if bulls have their way, Bitcoin price could shatter past the upper band of the Bollinger indicator at $44,210. This could see BTC climb to $48,000, or in a highly bullish case, tag $50,000, nearly 20% above current levels.\n\nAlso Read: Bitcoin price gains strength as GBTC outflows shrink\n\nEthereum price could drop to $2,200\n\nEthereum (ETH) price action is almost similar to that of BTC. It could fall 4% to $2,200 as overhead pressure due to the 50-day SMA continues to build. The Proof-of-Stake (PoS) token’s price has made multiple attempts to breach this supplier congestion level to no avail.\n\nWith the RSI below 50, the AO and MACD in negative territory, and below the latter’s signal line (orange band), the odds favor the downside. Ethereum price could slip past $2,200 to test the 100-day SMA at $2,203. In a dire case, the fall could see ETH dip into the demand zone between $2,059 and $2,118.\n\n\n\nETH/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Ethereum price overcome the 50-day SMA to confront the $2,388 barrier. Flipping this into support could restore Ether into the ascending parallel channel, a gateway to more gains.\n\nAlso Read: Ethereum monthly transaction count climbs to highest level since July 2022\n\nRipple price looks for pullback as XRP holders show weakness\n\nRipple (XRP) looks ready to fall as it is stuck below the foothold of the midline of the descending parallel channel. Increased selling pressure could see XRP price retest the October lows around $0.4734, with technical indicators showing an unmotivated holder community. This is seen by the waning momentum on the RSI below 50 and the position of the AO and MACD in negative territory.\n\nXRP/USDT 1-day chart\n\nOn the flipside, enhanced buyer momentum could see XRP price breach the resistance due to the midline of the channel, bringing the $0.6000 psychological level into focus.\n\nAlso Read: XRP price trades broadly unchanged leading up to crucial milestone in SEC vs. Ripple lawsuit"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPQm4zbWRxYURFMXlKWnlrMHl2WXM4VXl4V2R2YVNvLXFuVGs5cUhfYmNEYmY2STc3V3VOZ0RBZXBNSmR1ZXYySHBIZHZXNHFmclBoVkNaYUpnaDAySTh1SDh3RENlODY5TW9NTUlDX2ZsdGNybW9nYnVlTWQ4eHNsR3d4di1URWlyd1hkcjdlSDd4X0ZraXRGcnN2SUJDYmszamVzQ3R6cUJkMTdOVzJpLW930gG3AUFVX3lxTFBLX3lEU0dNaTV0LVRfSGIyd0lYdFMyUjhsQlNtcFFvalFCTE1MV25qSWR2S2VaVENfNnJUM2E0azdNcHJIdWdEZlBWOWNyZXNENUNRQUc5dGZvTTJDS2p5NTdDdkhBenlYZzctMjVqbWZMMTZyVktNc3VmaGthdXhRSTNTVjJsMTl1di14TUZvdHV5eUg4dElKWVFPZXNLT0dPaGpkZ09SWXRWa3B1d2YzcVMtYWZGWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Genesis Seeks Approval to Sell $1.6B in Bitcoin, Ether Trust Holdings - CoinDesk",
        "content": "Some of the GBTC shares were transferred to the crypto exchange Gemini by Genesis as collateral as part of the Gemini Earn program, the filing stated. Genesis seeks an additional 31 million GBTC shares that were pledged to Gemini but never transferred, the filing added."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPMXpHeDRQTVVvaENTcVpiQl9yVXZIRmZYbkdWV0t3NDZsaTd5Z2VOTzFpdl9HTFBrb2VJTzAzNlBiNHktR0t5TEgtZE1LN3NtZWduNHh3R0tJSmg5NHdtbVBHYmVhRlFSX28zcjlrckJ1VTM2OTl2am43a3lJb1JfQVc4VGVwdE1aX0VoU3ZyeElxWEJId2N1c052RHc3cVU1Z3JhSDV3clhCblZkblVMQVBUVdIBuAFBVV95cUxOY3dDNk5rMXFTMU9HcGVEcWhGRm5LWUFtb1dOVm5JdmhBaXdaMzNyUWNlSWZYeVpzVHNEWjQzNGdnRVA4NjZnZDljWl8tal9TVWNLRHhrMmd3VWwtQ2RoVFpKc1JpMlhBLV9wZ3ljeEprTHdwWlRiUENkWXA5X3UyUWs3M254UE1RUURxX25JRzd0cWxpa3FkTXpvYTZ0c1AzTnU1MzNUQzFvTHZabktFdS1oYXFLRXNm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Solana (SOL) Gains Crucial Foothold, XRP's Movements Are Too Predictable, Last Resort for Ethereum (ETH)? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana is showing signs of a potentially significant technical development on its trading chart against Ethereum. The asset is currently engaging in a critical battle at the 50-day EMA, a level that will determine the medium-term trend direction for the asset.\n\nAt this juncture, the 50 EMA is acting as a dynamic resistance level. Solana's attempts to break above this level have been met with resistance, but there is a persistent effort from the bulls to push through. Should Solana manage to decisively close above the 50 EMA, it would likely confirm an important new support level, which could bolster investor confidence and potentially lead to a new leg up in its price against ETH.\n\nHowever, despite the bullish attempts, the volume profile suggests that there is not substantial buying activity to give Solana the powerful push it needs to sustain above the 50 EMA. The volume, a crucial indicator of market enthusiasm, is somewhat lacking, indicating that the current push may not have the necessary momentum to create a reliable new support level.\n\nThe support level to watch, if Solana fails to break the 50 EMA, is positioned around the 100-day EMA. A retracement to this level could provide a bounce-back opportunity for the asset, but it would also reflect short-term bearish sentiment, indicating that the market is not ready for a breakout.\n\nAdvertisement\n\nXRP stays irrelevant\n\nUnpredictability is often the name of the cryptocurrency game. However, XRP has recently been tracing a path \"too predictable\" for a cryptocurrency. A few days ago, XRP appeared to be gathering momentum, but a swift correction quickly dispelled the budding optimism, bringing it down to lower support levels.\n\nThe focal point for traders now is the $0.47 support level. This key threshold is anticipated to be the springboard for a potential reversal. Yet, the timing of when XRP might reach and rebound from this level remains nebulous. The lack of volatility in XRP's price movements is serving to complicate predictions further.\n\nVolatility is a measure of trading opportunities, with larger price swings offering more potential for profit (and loss). The current state of flatlined price action limits these opportunities, potentially driving traders to look for more dynamic assets to trade.\n\nThe resistance levels to watch are at $0.5714 and $0.5633 which, if broken, could suggest the beginnings of a reversal pattern. However, without significant buying activity, these levels may continue to cap any upward movements.\n\nEthereum's last stop\n\nEthereum approaches a key technical indicator, and the outcome could dictate the asset's trajectory in the coming weeks. Currently, Ethereum's price hovers near a crucial point, engaging with the 50-day EMA.\n\nAt this juncture, the 50 EMA serves as the immediate resistance level. The ability of ETH to break above this mark is crucial — if successful, it could signal a return of bullish momentum, with potential targets set at higher resistance levels, such as the recent high around $2,436. Failure to breach this level, however, could spell trouble for Ethereum's short-term prospects.\n\nA rejection at the 50 EMA could lead to a price retracement toward the 100 EMA (the orange line), which is currently near the $2199.9 mark. This would not only negate the recent progress but could also result in bearish sentiment, potentially establishing a downward trend.\n\nFurther complicating the picture is the volume profile. The descending volume as the price approaches the 50 EMA suggests a lack of conviction among traders, which could imply that the push to overcome this resistance might not be supported by strong buying pressure. In market terms, a decrease in volume during a price increase often precedes a reversal, indicating that the current movement might lack the necessary fuel to sustain a breakout."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOX09ScEpEb19pYkhFbmVOQjIwRW5oMXJqcTdrMGtCX25lbmtxZHJJZHk4ZUotMnl6OUJNdExVVkdQWGotNDFReVQzaURiaDE3VFhlY29tckJLWVJjUmxUd0lMQzZia3daamlOQlJINVZpLUJMX0RQak03S2pRNnZWUHpwLURiQdIBjgFBVV95cUxPUUFsMk8tVkY5dm5KWi02WlFSVk55eEQwSnV2THRUX25DeHdWNEZLRDZKWnZHbk1HeUlJZzlPZUpPZnhkNXdtX2NYdXRJLVlXRnhwTHdSWVNiSEtpZFhWd3JLMzR6SHluN1BVeEVkRHdXMXhuMHdoeXFzM3NlSExmZzJZX3V1QmRRQlVUS2Fn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "What Is Farcaster and Why Is Crypto So Excited About the Twitter Alternative? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the last two years—particularly, since Elon Musk’s divisive purchase and overhaul of Twitter in late 2022—a number of upstart decentralized social media protocols have attempted to harness the transparent, uncensorable power of blockchain networks to improve the online social experience.\n\nFarcaster is the latest such project to do so. Now, it’s making waves after releasing a key update that has attracted thousands of new users in a matter of days. Here's why Crypto Twitter is so optimistic about this new potential replacement.\n\n(Video by Rug Radio Creator Benjamin White.)\n\nAD\n\nAD\n\nWhat is Farcaster?\n\nFounded by Coinbase alums Dan Romero and Varun Srinivasan in 2020, Farcaster is a social media protocol built on Optimism, the Ethereum scaling network. On top of the public and decentralized Farcaster ecosystem, users can create (and have created) a slew of integrated apps that perform various social media functions.\n\nThe most popular app built on the Farcaster network is Warpcast, a Twitter-like platform for writing posts (called “casts”), following other users, and liking or sharing (“recasting”) those users’ posts. Though a slew of apps currently live on Farcaster, Warpcast accounts for almost half of all sign ups across the entire protocol, according to on-chain data from Dune.\n\nMost of Farcaster’s most popular accounts are major players in the crypto space: Ethereum co-founder Vitalik Buterin, Ethereum core developer Tim Beiko, and Base creator Jesse Pollak.\n\nFarcaster shares its main selling points with other decentralized social media protocols: a lack of censorship, control over one’s data, and seamless interoperability of accounts across all apps built on the network. That’s opposed to, for example, the lack of interconnectivity between accounts on Twitter and Instagram.\n\nOne element that particularly distinguishes Farcaster from other social media protocols is the network’s emphasis on eliminating bot activity. To sign up, users must pay a $5 sign-up fee, meant to prevent the creation of spam accounts. Further, users can only post a limited number of “casts” on Farcaster apps, which are tied to packages called storage units.\n\nAD\n\nAD\n\nStorage units, which go for $5 a piece, grant a user 5,000 casts, 2,500 reactions, and 2,500 links or photo posts within a one-year period. Users who wish to buy additional storage units to post more can do so via a fairly technical and complicated process. This storage unit structure was designed to prevent Farcaster apps from being inundated with the millions of bot comments and likes that plague traditional social media platforms like Twitter.\n\nBut far and away, the most popular innovation on Farcaster is called Frames—and it upended the protocol’s trajectory overnight.\n\nWhat are Frames?\n\nLaunched on January 26, Frames are a new Farcaster feature that allows users to perform a suite of functions, both on-chain and off-chain, within Farcaster apps—without exiting to a third party.\n\nOn Warpcast, for example, users scrolling through a feed of casts can now click on a Frame posted by someone they follow, and perform a variety of functions—including minting NFTs, browsing an art gallery, playing games, subscribing to newsletters, and making online purchases—all while staying in their feed.\n\nSome popular Frames include “Girl Scout Cookies,” which enables one-click purchases of the popular dessert, “Nethria,” a text-based monster combat game, and “NFT Mint,” a gasless NFT drop.\n\njust came across one of the coolest new features in social media that I've seen in a decade not being dramatic, it's actually genius@farcaster_xyz Frames TL;DR - you can embed an \"iframe\" (not fully) into your tweets (casts) and people can interact with them without leaving… pic.twitter.com/30e9lgGkfa — mert | helius.dev (@0xMert_) January 28, 2024\n\nFrames is powered by Farcaster’s EdDSA authorization system, which already underlaid the Farcaster ecosystem. According to Farcaster co-founder Dan Romero, that structure eliminates the possibility of wallet drains, spoofing, and other malicious crypto hacks.\n\nAn easy to miss part of frames is it's powered by Farcaster's EdDSA auth system. 1. UX — every Farcaster user already has an EdDSA in the app they are using whether Warpcast or Supercast or something else. Every Farcaster client supports frames under the hood. And for… — Dan Romero (@dwr) January 29, 2024\n\nAD\n\nAD\n\nCurrently, on-chain functionality for Frames is limited to Ethereum-affiliated networks. As soon as next week, however, Farcaster’s founders have indicated the protocol will expand to support Solana.\n\nFarcaster is easily my favourite app in crypto right now and it's now coming to Solana 😱 colossal hint: with Farcaster Frames (embeddable actions into posts) — Solana is the **only** way to go from frames -> onchain without a backend OPOS pic.twitter.com/qrxte8okiy — mert | helius.dev (@0xMert_) February 2, 2024\n\nWithin days of introducing Frames, Farcaster exploded in popularity. The ecosystem, which typically supported around 2,000 daily users in recent months, quickly shot up over 1,300% in activity, to an average of over 28,000 daily users by Monday, according to data from Dune.\n\nThe volume of casts and likes on the platform has increased exponentially over the same period, from an average of 100,000 daily engagements just weeks ago, to over 2.3 million on Monday.\n\nAll in all, just north of 125,000 users have signed up for Farcaster so far—a statistic that pales in comparison to mainstream social media platforms, but nonetheless marks a substantial milestone for an on-chain network that has yet to cater to non-tech savvy users.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNTFlST2NHUzZrQm9DZ0xXX1RqNDlrcDJkNEdwWUtYbnlpdTFFWFFtZnhBd2FablViMWg2WEJueGJQNTJ2NXlueUdONmZlMmFKNFU0dl9JMjdwb3NWTnhacHJ2U1JtTzc3T2hTRFdmR2JkeE52b0RwMXJHWDJnZVlxU19HYkZ4YV9rMmpPd3dB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "The case for investing in bitcoin and ethereum through ETPs - Funds Europe Magazine",
        "content": "While some investors may find the rise of crypto assets utterly baffling, one thing is not in doubt. Adding either bitcoin or ethereum in small amounts to a balanced and diversified portfolio has historically produced outsized returns, says Tom Rodgers, ETC Group’s head of research.\n\nBlackRock’s recent entry into the American crypto investment space is a landmark development that is expected to have wide implications for investors’ ease of access to crypto, and not just because the company has $10 trillion of assets under management (AUM).\n\nThe move by the world’s largest money manager to file for a spot bitcoin ETF is an indication of growing institutional interest in bitcoin.\n\nIt is also a validation of the European crypto asset investment products that have attracted more than $6 billion in AUM since 2020.\n\nBut while US investors may have to wait until February 2024 to find out whether they can access spot bitcoin without having to buy crypto on an unregulated digital asset exchange — nor go through the hassle of having to custody their own crypto — European investors can do so safely and securely today using crypto exchange-traded products, or ETPs.\n\nHard to ignore\n\nInstitutions from family offices to private banks are enquiring in ever greater numbers about crypto ETPs. The annual Trackinsight Global ETF Survey — supported by JP Morgan and State Street — surveyed 549 professional investors that allocate roughly $900 billion across exchange-traded fund (ETF) strategies and found that 48% were considering single asset crypto ETPs.\n\nThis may not be surprising, given bitcoin has achieved annualised 78.1% returns over the last seven years at the cost of similar annualised volatility.\n\nIn the year to date, bitcoin’s price has climbed 69.9% at a 30-day rolling annualised volatility of 0.32. Ethereum appreciated by 47.1% with a volatility of 0.31.\n\nFor comparison, the S&P 500 has returned 14.1% at a volatility of 0.12, while gold has increased by 7.4% at a volatility of 0.11. So it is clear that the cost of such outperformance comes in the form of higher annualised volatility and larger intraday price swings.\n\nWhether allocation to crypto assets comes in the form of the common 1-2% threshold, or up to 5% for the more adventurous buyer, not earmarking an appropriate position has, in an era of wildly shifting preferences, become a business risk that many are being forced to reassess.\n\nWhat’s Europe’s problem with bitcoin ETFs?\n\nIt is a quirk peculiar to European markets that their regulatory frameworks do not allow the launch of a Ucits fund with only one constituent, for example in bitcoin or ethereum. These are the two largest and best known digital assets, with market caps of $500 billion and $200 billion, respectively.\n\nThe inability to launch a Ucits-compliant single asset crypto ETF in Europe gave rise to ETPs. These funds use a structure invented a decade ago, created for commodity assets such as precious metals, which are ineligible under Ucits rules. The largest of these is the iShares Physical Gold ETC, which has $15.3 billion of AUM, suggesting a strong degree of institutional acceptance.\n\nETPs are physically-backed bonds, 100% secured by the underlying asset – whether that is gold, silver, bitcoin or ethereum.\n\nMore than 80 crypto ETPs — which range from bitcoin and ethereum to lesser-known digital assets — now trade on regulated stock exchanges in Europe.\n\nBetter than a crypto exchange\n\nThe most stringent criticisms levelled at crypto-native exchanges are around their business practices: the worst are accused of co-mingling customer funds with company revenue, and holding assets in hot (online) wallets where they are more easily targeted by hackers.\n\nBy direct contrast, physically-backed bitcoin and ethereum ETPs hold coins in cold storage (offline) with a regulated third-party custodian, mitigating the risk of cybersecurity incidents.\n\nThe collapse of crypto-native FTX in November 2022 is still fresh in many minds, and the commensurate negative headlines are one of the more obvious reasons why larger players may have avoided the space to date.\n\nRecent high-profile lawsuits against the best-known among them, Coinbase and Binance, have also left investors seeking providers known for their transparency and professionalism.\n\nThe institutional 180 on bitcoin\n\nWe may all remember JP Morgan CEO Jamie Dimon telling a conference in 2017 that bitcoin was “a fraud worse than tulip bulbs”, and that people who owned it were “stupid”.\n\nIt was quite the surprise to find the bank’s strategists in May 2023 suggesting that bitcoin should be trading at $45,000, 70% above its market price, given the price of gold, and bitcoin’s scarcity and store of value qualities.\n\nLloyd Blankfein, CEO of Goldman Sachs between 2006 anertfd 2018, warned towards the end of his term that bitcoin was nothing more than “a vehicle for fraudsters”. The bank’s analysts also crossed the Rubicon, in 2022, to say that bitcoin would compete with gold for the store of value market.\n\nBlackRock CEO Larry Fink seems to have taken a remarkably similar journey. In October 2017 Fink said that BlackRock was not setting up a crypto unit and that none of his clients had ever asked for bitcoin exposure. By 2022 the company’s first bitcoin product was seeing “substantial interest” from clients.\n\nAttitudes towards crypto are changing fast in the face of outperformance, adoption and ever greater understanding of the asset class. This makes professionally-managed crypto ETPs in Europe one of the best vehicles to access these alternative assets.\n\n*Tom Rodgers is head or research at ETC Group.\n\n&© 2023 funds europe"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOU0FmWERSOEF4My1PUWFDX0lSMy1pQ0s0MDZfWmx0cWsyaFMtZmdDeFRTdEEzazB3UkVjR1R1c0dLOFhYZEk4TURQN1YybGlLMm0tR0RLbk5ra0lGZTZ4Qzk0UjVlLW9uY0d1ZzJlVDF5MzlYN3E2X1hpdjAzX0gzM19nZS1RNzRkMVpPU1JlLXdXNUNDVllINW4zR2h0dGZSMDJF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dogwifhat: some crypto-wallets pocket over $1.3 million - The Cryptonomist",
        "content": "During the weekend, it seems that some crypto wallets that collected a large supply of the Ethereum version of dogwifhat (WIF) pocketed over $1.3 million. The incident suggests that these are apparent “insiders” of the project.\n\nEthereum Dogwifhat: 12 probable insider crypto-wallets of the project pocket over $1.3 million\n\nOn Saturday, it seems that the Ethereum version of dogwifhat (WIF) was pumped and then dumped within a few hours, showing some suspicious data.\n\nAnd indeed, it seems that there are 12 crypto-wallets that, thanks to their wide supply of the memecoin version Ethereum, have managed to pocket a whopping 1.3 million dollars.\n\nThe suspicions suggest that these crypto wallets are apparent “insiders” of the project. This is confirmed by the on-chain analysis tool Lookonchain, which shows that these crypto wallets have purchased 24 million Ethereum WIF tokens for 3,000 dollars in ETH.\n\nThe purchase took place in the same block in which the deployer opened the negotiations, which implies that the trader knew exactly when the tokens would be issued and traded.\n\nAnyway, on Saturday, the Ethereum WIF went from prices of fractions of a cent to 30 cents in just a few hours, and then crashed by over 80%.\n\nEthereum Dogwifhat: word from the creator\n\nAlways on Saturday, on X, the issa account came forward, claiming to be the creator of the crypto dogwifhat.\n\nAs many of you know, I originally created the meme you all know as \"dogwifhat\". It recently gained a ton of traction within the crypto space, most notably through a coin named $WIF that launched on Solana, currently trading at $270M~ market cap.\n\n\n\nWith so many of you reaching out… — issa (@issa) February 3, 2024\n\n“As many of you know, I originally created the meme that you all know as ‘dogwifhat’. Recently, it has gained a lot of popularity in the cryptocurrency space, especially thanks to a coin called $WIF, launched on Solana and currently traded with a market cap of 270 million dollars. Since many of you have contacted me and the $WIF team has never recognized me as the original creator, I wanted to clarify that I have no affiliation with them and I have never owned or received any allocation. Today I officially announce that I will launch the REAL $dogwifhat, but on Ethereum. The website explaining the origin story of dogwifhat is directly linked below this text. If you are not familiar with the cryptocurrency space, please proceed with caution, this is not financial advice. All other tweets following this can be found on the official website @dogwifhat_eth”\n\nIn practice, the Ethereum version of dogwifhat is not connected to Solana-based WIF, which was launched at the end of November.\n\nSeventh crypto in the “Meme” category\n\nMeanwhile, looking at the meme crypto ranking by market capitalization, the dogwifhat (WIF) based on Solana blockchain is in seventh place.\n\nWIF has a total market cap of over 217 million dollars, not far from the other meme cryptos like FLOKI (265 million dollars) and MEME (227 million dollars).\n\nOn the memecoin scene, the dominant one is Dogecoin (DOGE) with over 11 billion dollars of market cap, followed by SHIB with 5.2 billion dollars and BONK with 655 million dollars.\n\nIn the last month, WIF Solana-based has seen a price pump of 97%, with the price going from $0.09 to the current $0.21. However, during the month, its highest recorded price was $0.45."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOajRuVEFrNTFkMDBGZE5DbjA2UkxoMEpzQ1daRmpoMUQ4cVNyb0REYVlIMGFUclNWVzhxWGVCTEtia2lGNTFhYS04NjdfZjVOeFpHM0lZNlNzRHpVcTVmczdWWjlPYkV3bHBXV3NFZk9zYVFUZU9PODdqUzFlUUtNaEwxeUdmdlZTb1hTYUJPZWpZVmxoUm5IUnN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "EigenLayer Protocol Hits $3.4B TVL in Ethereum Restaking - Crypto Times",
        "content": "Eigenlayer’s TVL surged by 70% in just a week, reaching a record-breaking $3.5 billion, driven by the reopening of deposits and the removal of staking caps. This move enhances participation and flexibility, allowing users to maximize staking capabilities without limitations.\n\nMoreover, strategic partnerships with Frax Finance, Liquid Collective, Mantle, and other DeFi leaders underscore Eigenlayer’s commitment to advancing collaboration and innovation within the decentralized finance ecosystem.\n\n🟦 EigenLayer Restaking Reloaded! 🟦\n\n\n\nFrom NOW until Feb 9th, 12 PM PT, dive back into the world of LST restaking! All pools are fully uncapped, featuring both the existing pools and welcoming new partners @fraxfinance, @liquid_col, & @0xMantle. pic.twitter.com/yDGHiJjX3m — EigenLayer (@eigenlayer) February 5, 2024\n\nEigenlayer has proposed implementing certain guidelines to maintain neutrality as part of its transparency commitment.\n\nThese include abolishing limits on staked token values to enable unhindered involvement and imposing caps on protocol incentives and governance influence to prevent domination. There are also no payment restrictions from applications to stakes, enabling free rewards flow.\n\nEigenLayer’s success underscores the importance of community input in shaping its trajectory, emphasizing dialogue among stakeholders to strike a balance between decentralization and growth.\n\nWith governance structures in place to prevent monopolistic control, EigenLayer demonstrates how decentralized platforms can thrive while fostering inclusivity.\n\nIts expanding partnerships within the crypto ecosystem demonstrate a dedication to community-driven progress, serving as a model for other projects seeking widespread adoption and engagement."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNWmI0bndHdFFpbC1fV1RpZDlScUVKc21tRmRxbEV2XzRoNjhLd1lsUE5FdUJZVGdfdE5WeHlONGhoMlhWVV9PNmNIcERUUHFNY1RXd0s0ek0wU0NTcmtPRkItRkM5Tngxb2ZhOE9aMEJwcm84VDI1czRNd2k2bXNEbUxTb3NRZ0pjRVI4SjdnNm5ud01GeE1IODlsYmZfNEtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Bybit Report Predicts Ethereum Rebound in 2024 - Canada NewsWire",
        "content": "DUBAI, UAE, Feb. 5, 2024 /CNW/ -- Bybit , the world's third largest crypto exchange by volume, has released a new report reviewing the hottest trends in 2023, digging into the reasons behind them, and exploring what is to come in 2024.\n\nIn 2023, among several sectors studied, AI tokens have been the standout performers, outperforming most asset classes including Bitcoin and big tech. This remarkable performance underscores the burgeoning interest in AI technologies and their increasing integration into blockchain applications.\n\nBybit Report Predicts Ethereum Rebound in 2024\n\nAs the market evolves, Bybit boffins anticipate that BRC 20 tokens built on top of Bitcoin will take the limelight as more communities explore Bitcoin's utility as a base-layer.\n\nIn addition, Bybit's analysis suggests that tokens connected with the Decentralized Physical Infrastructure (DePIN) sector, including those used in computing, are expected to hold stable prices in the face of potential selling pressures. This stability is indicative of the sector's resilience and the sustained demand for decentralized privacy and networking solutions.\n\nFinally, this anticipated shift could signal a reconfiguration of market dynamics and investor confidence in Ethereum's long-term prospects.\n\nFor more detailed insights and the full report, please visit here.\n\n#Bybit / #TheCryptoArk\n\nAbout Bybit\n\nBybit is a top-three cryptocurrency exchange by volume with 20 million users established in 2018. It offers a professional platform where crypto investors and traders can find an ultra-fast matching engine, 24/7 customer service, and multilingual community support. Bybit is a proud partner of Formula One's reigning Constructors' and Drivers' champions: the Oracle Red Bull Racing team.\n\nFor more details about Bybit, please visit Bybit Press .\n\nFor media inquiries, please contact: [email protected]\n\nFor more information, please visit: https://www.bybit.com\n\nFor updates, please follow: Bybit's Communities and Social Media\n\nDiscord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube\n\nSOURCE Bybit"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQNFk3Z0kxYnI1WVRXZTBoSlM1aTZ2THpScXhGcnhDa1pRUEFwa0t2N25lenBTTWY0dDBFU0J2dHJ6ZVJpN1lISUlucXEzcy10QUF4NVdIRGlOX2hmWlQ1d1htdVRXLUswZGN2S0pLQm1MaWpKUUc2R0h6TnNjUnotcTAybnYtQU1ta1hnOGxZcUtuazRUWm5kXzZhV08yWTRwcFdheGdzSVFlMkpueWNCYtIBtgFBVV95cUxPbGJMM3RqSTRweS11OFJXZ2p5UDRnVnpWd1BOMkxwbFloM1pnUXZXMlN3VXVzVVgweFlpdzA3a003ZzgwMXJDTlIzVFkteEwwMjhTbXVoRzZORnpzZzUtMG1sLVpyYmp1ZUY3S0pSUnhTa3J6Z1RKdGQ5N0NUb2NTRVR5NGp0SHZhVWk1Yml1VUIwMU40LVhSc1BPWTMwRXl5QkpmalNSTk1PUWIxbUhMYU5kOHRVQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "GoDaddy To Link Website Domains to Ethereum Name Service (ENS) Domains for Free - The Daily Hodl",
        "content": "GoDaddy, a world leader in web hosting and registration, is announcing a partnership with Ethereum Name Service (ENS), a domain naming service built on top of Ethereum (ETH).\n\nAccording to a new press release, users of GoDaddy domains can now link their domains to ENS without any additional costs or technical knowledge.\n\nAs stated by Paul Nicks, president of domains at GoDaddy,\n\n“As a long-time domain industry steward, we are always looking for innovative enhancements that benefit our customers.\n\nPartnering with ENS presents our customers with a unique opportunity to experience the fusion of domain names and blockchain technologies, bringing some great benefits for users in both areas.”\n\nAccording to the press release, the DNS will translate domain names into unique IP addresses while ENS turns wallet addresses into more easily readable-by-humans names.\n\nThough it has been possible before to bring domain services to the ENS, the integration has not been simple enough for most users, and the partnership aims to change that.\n\nSays ENS founder Nick Johnson,\n\n“With this milestone, we are furthering our mission to build a more secure, decentralized and user-friendly internet. ENS, much like DNS, is a public good and a core part of the internet infrastructure.\n\nBy pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.”\n\nENS is worth $19.78 at time of writing, up 9.3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObkwyMHdRdWhSMVI0WXVGVXdBVzMxWXRBX2k1YVFSWV9oWXF5RzhpU3p6MVF2OGU5dWZHOGR1V29DX002UnRDWkJ4eklsMDZWRnJnRFZMdGw4YVI1S2I3M3hiUVZKYnhMREYtbG5WNjRwdVNKTHE4bG50VDh2YzlpMEw5bTd4RU81Qlg0YnVEaDRTMEoyMVlr0gGcAUFVX3lxTE5JdHZta2VXcUlGZDkzTnF5NFVkdV9BSG56VEJnS0R2ZWlyWGZPYkN4U3lXaFJlQ3RkOWJCSkM0MmxScHJ0Z2hpLUFHZ1BoektrTUZYM0hSQ2Z1QjM0SXZyeXQ3Rnd3TlhrcXpQYlY1ZElvallGMzFJOXFZSXc2TlR3OHJFZ2JGVnF4RXgwcHVWcV9tOGc3UE5MbFdTVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "EigenLayer Lifts Staking Cap, TVL Soars Past $3B - CoinDesk",
        "content": "EigenLayer allows investors to earn additional interest on their staked ETH tokens by \"restaking\" them to secure other chains. EigenLayer currently supports popular liquid staking tokens (LSTs) like lido staked ETH (stETH) and rocket pool ETH (RETH). Lido and Rocket Pool are among a slew of platforms that stake ETH on behalf of users; they issue LSTs representing one's stake which accrue interest and can be traded just like any other token."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQN3lYMjhUZHZZUEhfeEVsNlZ4UHdUbFp3bWNRcFdiMFNQN0ZIci1YcWExeTNSSnJEcDN4MXZQU1psY2docjZ1b05zNkFrY2dZVVdqTUNwVExGSDZxRzdBUUtudVlMdkwyMDU4TXFQT05qcEptdW9SS1dJRHdpdERkclhsZGE0NFIzLWNkUk54WmdJNzZvaXdQTTJvM1VaZzhGY0VVNkhfd2tvOWtOc1ZZVmt0UzZ2Z9IBuwFBVV95cUxQU3FmdERWa2ZGWHI5dmhEd3hDQVNndWtfS1JBaGQ4bktGSTRXamNuT2V0YlJFdzlTVnZDRGVOWDZfd1lHX3FtbHk3OGRjWDBWMUdvQS1RUU5LakpTNmRjM1lVcHUzLTh6UHRGNTBpSmdJRVV6Tm9UMDh6THhpcGI3Wkw2Q2FOTmxnYllDZXc1LXN3ZTdpVXlEVEJyRlM1djdXNjkxWUhJT2J1cnBHX0FkM1VRLTdwbVpNdU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Kelexo (KLXO) Cryptocurrency Sale Becomes Spotlighted in February as Ethereum Classic (ETC) and Cardano (ADA) Holders Remain Optimistic - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn the midst of a market resurgence, Ethereum Classic (ETC) and Cardano (ADA) holders eye potential profits, with Ethereum Classic’s (ETC) upside supported by discussions of an Ethereum ETF. Cardano (ADA) faces challenges but remains crucial at the $0.5 psychological support.\n\nAmidst this, Kelexo (KLXO) steals the spotlight, revolutionizing decentralized lending within Web3. The ongoing presale witnesses growing interest, offering profit-sharing opportunities, a Kelexo (KLXO) wallet-linked debit card and a disruptive approach to traditional lending processes. Kelexo's (KLXO) comprehensive ecosystem and ongoing success position it as a significant influencer reshaping the landscape of online lending in 2024.\n\nSupporters of Kelexo (KLXO) can take part in pre-sale and buy tokens here .\n\nEthereum Classic (ETC): A potential upside\n\nWith discussions about an Ethereum ETF in May 2024, Ethereum Classic (ETC) emerges as an intriguing option with the potential for sharper moves. As a smaller-cap coin compared to Ethereum (ETH), Ethereum Classic (ETC) presents a higher upside. The coin's current price, hovering around $24.45, indicates a potential uptrend continuation, supported by its resilience above the 38.20% Fibonacci level at $23.24.\n\nAdvertisement\n\nCardano (ADA): Navigating turbulent waters\n\nCardano (ADA) faces turbulent market conditions, reaching a critical psychological support level at $0.5. This level holds significance, triggering emotional trading decisions. Cardano’s (ADA) price action around this level is crucial, as a bounce could signal a potential reversal toward upper resistance levels. Conversely, a breach of the $0.5 support may lead to further declines, with key support at $0.4738 and a possible last stand at $0.42.\n\nKelexo (KLXO): Lending redefined within Web3\n\nKelexo (KLXO) is a unique decentralized lending platform that simplifies borrowing and lending using smart contracts. Investors are attracted by the opportunity for profit sharing and a Kelexo (KLXO) wallet-linked debit card for global transactions. The ongoing presale indicates a growing interest in decentralized financial solutions, positioning Kelexo (KLXO) as a notable player in the cryptocurrency world.\n\nThe platform's Web3 model, without Know Your Customer (KYC) requirements and featuring instant transactions, disrupts traditional lending processes burdened by bureaucracy. Kelexo (KLXO) addresses common issues like high fees, paperwork and limited access, making it an attractive alternative for borrowers and lenders. The ongoing presale reflects a growing interest in decentralized financial solutions.\n\nKelexo (KLXO) offers a complete system, including a worldwide spending debit card, immediate cryptocurrency exchanges with no fees and a rewards scheme. Those who invest early can receive a portion of the fees generated by the platform according to their holdings. The platform supports decentralized governance, enabling users to propose and vote on enhancements. Additionally, a VIP program provides users with account managers, cashback perks and interest payments, enhancing user involvement."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNdkh0dTltMWVTcjNvWU42Nk1aTnJyM1Jaek9fbE5CbGtHT2plUjhwaFZYcDNIWklTdkJHWmJlbTdyNXRJNnlCWVZtbEFrUTJucl9kT1dGMVh0OGNmckpPUGtHdE0zMmZCTnNNcXc1cTliemZCOUNMX0Q1THd4UnVldktFQmJaVEpEVzNYRElBZU9PMW5wWnY2enZ4M21JVUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Mollars ICO & What You Need to Know About Ethereum Blockchain’s New Bitcoin - CryptoPotato",
        "content": "The official Initial Coin Offering [ICO] for the Ethereum blockchain token “Mollars” launched on Monday, November 21st. The token price starts at $0.30 in the first phase.\n\nMollars is a hybrid cryptocurrency that will be an alternative to Bitcoin as it’s a store of value tokens. There will be a difference, however, as it’s starting a decade after BTC was first introduced to the world.\n\nWhat are Store of Value Tokens and Coins?\n\nLike Bitcoin, Mollars aims to be a store of value that’s in high demand, and the founder will not hold tokens privately. Possibly as high as 99.5% of today’s cryptocurrency founders have a personal stash of tokens that was likely introduced to investors through the ‘fine print’ in the crypto brand’s whitepaper.\n\nIn Mollars whitepapers, it’s clearly stated that no party involved in the development of this token will be given tokens. A complete 100% of the tokens generated by the founder and developer team will be put onto the crypto market and exchanges.\n\nAnother attribute that makes Mollars a store of value, like Bitcoin, is that it will be fully decentralized.\n\nThe founder will not own the brand. The creator of the token created infrastructure and formulas to give the token longevity, but the enigmatic figure will have no control over the token once it has been released on top crypto exchanges.\n\nMollars ICO and Potential Exchange Listings\n\nThe first exchange that Mollars will be listed on is Uniswap, the world’s #1 decentralized crypto exchange. If the ICO reaches its goal of US$ 2 million dollars, it will have a listing day price of US$0.62.\n\nThe 62-cent listing would mean today’s first-round ICO investors would get ROI Yields of over +200%.\n\nThe price of the listing day could be weaker if the US$2,000,000 milestone is not met with the Initial Coin Offering fundraising.\n\nWith 15,661 tokens sold since its debut on November 21st, the Mollars ICO listing is averaging a daily buy rate of just over 2,610 tokens. At this rate, it would take the Initial Coin offering a substantial amount of time to complete. However, the ‘buzz’ is building, and that daily buy rate is expected to increase.\n\nAnother reason users might begin buying more is the crypto token’s founder’s recent release of the white paper and mission statement. One of those statements includes a ‘catalyst’ to expand the Mollars brand via product.\n\nBitcoin Had a 10-Year Head Start… So Here’s The Catalyst\n\nThe new ERC-20 token will be a necessity for those who wish to use Mollars developers’ coming mystery web3 product. This decentralized app [dApp] will launch in early 2024 at the same time as the hybrid tokens launch on its first major crypto exchange.\n\nWhat exactly is the dApp Mollars will launch? It’s not yet clarified but the web3 ‘goody’ is being believed to target P2E gamers and metaverse enthusiasts of the Ethereum blockchain world.\n\nMollars ICO in 2024\n\nThese claims by the new ERC-20 token’s developers have left some analysts to believe today’s first round ICO investors could generate more than just the typical listing day gains.\n\nAs the Mollars token is being offered at US$ 0.30 cents today, it will list on a major crypto exchange in second quarter of 2024.\n\nMany new tokens see gains when listed on new cryptocurrency exchanges, but having an actual product could lift the token.\n\nICO & Tokenomics\n\nSpecifics for the ICO launch and post-listing plans have been made clear based on the fundraising goal being met successfully. A total of 4,500,000 tokens will be sold. Mollars initial coin offering will have 4 funding rounds. The price of the token pre-exchange will increase with each round incrementally.\n\nFirst-round investors will have the best opportunity to buy Mollars tokens at the previously mentioned rate of US$0.30. After a modest 200,000 tokens have been sold, the second round will begin.\n\nThe ICO price for second-round token investors will be US$0.40, which is a substantial increase. A maximum of 300,000 tokens will be sold in this second stage before the price is bumped upward again in the third round.\n\nAs popularity grows, the supply available in the ICO’s third round will more than double to 700,000 $MOLLARS tokens. By this third round, Mollars will have the first details and possibly a preview of their web3 product.\n\nIn the fourth round of the ICO, investors will have to pay half a dollar to buy tokens early.\n\nIn the 2 rounds following the fourth, the token presale will increase by US$0.05 each round. Specifically, 5th-round investors will have to pay US$0.55 per token, and 6th-rounders will have to buy tokens at a rate of US$0.60 each.\n\nThe total token supply that will be sold in the Mollars presale totals 4,000,000 crypto coins.\n\nAfter the ICO presale is completed, the $MOLLARS coin will appear on a top crypto exchange quickly — according to public plans.\n\nLearn more about the ICO and this new hybrid token at their official website — www.Mollars.com.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNem9NNGp4STZEazV1dGxKQVliTV9DMVhVcXZ2VXl4RHZHMWhSMnUzaVhaaWJzelNfaDF2YzVOdGlvXzExWGg0NmExRDlOYmdyQ1l6MzF0eWdzNUpDaW9zQThWZVhrb0hpQzd2bEl6MWhsV3pRdXFQbEtYbTdfWktPYUJUN0ZMbGVRemE3d1QtdTN4cFhhZnfSAaMBQVVfeXFMT0F2b0JJdi12Z3htMi13cWtoNTMxYzhCdTQ5XzYyRjlBMnhYS28zejVYZlgzQ2tEZTdKclpKb3J4cHU4aENBenY2a3laVW1IMjkyMzkxbWZQS1JxQTRyb0tVS1ItSm5sQkpnYzA0cEROeVFVRXlBZFNXcEF5SG95YWF4cDFHd3RvUnFzbXAyVzdMSk5VU1RlNlVpUUV2UGl3Q3o1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How Bitcoin and Ethereum Move Together: An Analysis - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNZmJxeGhNSzV6ZVJ6MFRzcUtNa3FXbU14MkxzNkE5bWozRDIwWlVFSmNmekw3eWxqT045cnFaVVY0cURBdFRWbHU1RmJaNzZzUnZwQnVPc1RSRUpnaEpNX2Z4YmRxOFFBY2FwVmNSWmV5NlpUcUNiSGhRZDdrN1Y5UFRxVUZxOTQ0UXoxeXlINFd4MDVMWHU4Yi1QR2w4MFRCNThTaFM4OHVkU2NVeWlTMWE2Vi1TOU80QW5JNGpPbW5nOVFTVVZXcWFwT1V5N1hMNVdKSNIB2gFBVV95cUxQdWdIbjVLb2hQNEF5ZzJUYWJGcW15TDJVZ1JtdDN5VUZVWlF2Nmh1MTRIVVVvX3gtWi15Z0tDVTRGdlluOXplWjFqSW40NjU3cEt2ZlUtWDRaT011c1FZN3VSNEJvMEp3UVQtcHJDd3d1RWZPM3NXcVpDUzJ0MGRoVERCSlc1bnJrbUpyTHNQb010U1o2VWdYVkhETkVzSFcxUlF0dUVKQ2owSVhTS2NJbVlXNmc0cEJ3dHFqYmU3M1dfY2R2VWZ3LW9nOHJSWUhWazhSOU5zcURmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Types of Cryptocurrencies: From Bitcoin to Altcoins and beyond - The Economic Times",
        "content": "Bitcoin (BTC): The Pioneer Cryptocurrency\n\nAltcoins: Diverse Alternatives to Bitcoin:\n\nStablecoins: Minimizing Volatility for Stability:\n\nUtility Tokens: Powering Blockchain Ecosystems:\n\n\n\nSecurity Tokens: Bridging Traditional Finance with Blockchain:\n\nPrivacy Coins: Enhancing Anonymity in Transactions:\n\nCentral Bank Digital Currencies (CBDCs): Government-Backed Digital Money:\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nCryptocurrencies have revolutionized the financial landscape, offering innovative solutions to traditional monetary systems. As digital assets built on blockchain technology, cryptocurrencies provide decentralized and secure transactions. However, the crypto space is not a monolith; it comprises various types of cryptocurrencies with distinct purposes and functionalities.Types of Cryptocurrencies:Bitcoin, created by an anonymous entity known as Satoshi Nakamoto in 2009, is the first and most well-known cryptocurrency. Often referred to as digital gold, Bitcoin operates as a store of value and a medium of exchange. Its primary focus is on security and decentralization, making it a preferred choice for long-term investment.Altcoins, or alternative coins, encompass all cryptocurrencies other than Bitcoin. These coins aim to address specific shortcomings in Bitcoin or introduce new features. Examples include Ethereum (ETH), Ripple (XRP), Litecoin (LTC), and many more. Ethereum, for instance, enables smart contracts and decentralized applications (DApps), expanding the use cases beyond simple transactions.Designed to minimize the volatility inherent in many cryptocurrencies, stablecoins are pegged to traditional fiat currencies like the US Dollar or commodities like gold. Tether (USDT), USD Coin (USDC), and DAI are popular stablecoins. These digital assets provide a reliable medium of exchange and a store of value while retaining the efficiency of blockchain technology.Utility tokens are native to specific blockchain platforms and serve as a means of accessing and utilizing features within that ecosystem. For example, Binance Coin (BNB) is used to pay for transaction fees on the Binance exchange, while Filecoin (FIL) is a utility token for decentralized file storage on the Filecoin network.Security tokens represent ownership of real-world assets such as real estate, stocks, or bonds. These tokens are subject to securities regulations, providing a bridge between traditional financial markets and blockchain technology. Security tokens offer fractional ownership and increased liquidity for traditionally illiquid assets.Privacy coins focus on enhancing user anonymity by implementing advanced cryptographic techniques. Monero (XMR) and Zcash (ZEC) are examples of privacy coins that prioritize transaction privacy and fungibility. These coins appeal to users seeking enhanced confidentiality in their financial transactions.Some governments are exploring or developing their own digital currencies, known as Central Bank Digital Currencies (CBDCs). CBDCs are digital versions of a country's fiat currency issued and regulated by the central bank. These digital currencies aim to provide the benefits of blockchain technology while maintaining control over the monetary system."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQTC1BUTJyeVBPdnpjODBzbUxWZzhzYUdxVmc5TnZJRHVDamdjWlQ3NE4wUW9nV1B5b1ZkV1c5S1NLM2p2STJjcGU4bkVYa0ZkdGVJenNTUWRodmF1Wkp0VEVZUFVsaWRZcEp6cGZpTXlFZ25ueDU5Ym0zeWVhYV9JYXZoc2taWUIwS2RKc0VEa0lCZDZiUHBtRXBZVFVHbWpBaDZHbXZ2WjV3UXhfdEhWVTN4dHBWQdIBvgFBVV95cUxPMFVSNDkzQzBXRkNtaXVUUVIzd2ZUQzUtZVRmMF94QlpKVE03ajduVHYzUlBJaEZsa0N5VFZOa21YSDJtMlI5TzhONFdYWS1SNDM3X1RaMVFtQ2ZRR29Lc3hDU2lpTTVVdzgxb090amVYaE5LQlJOMmtZVlNnN2I5OWdXMS1mb2pSakVEdmRFV1hPSk96Qmt5VGcxdzhzZXNXbkdTTml5MmtLTmsxUmIyczNwdWdUWWhhMFNtM2Jn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Binance Boosts Ronin: Ethereum-Based Gaming Project Gains Listing After 108% Surge - Crypto News Flash",
        "content": "Binance has unveiled its plans to list Ronin (RON) for trading.\n\nRonin is a pioneering blockchain gaming protocol that supports games like Axie Infinity.\n\nBinance, one of the world’s largest crypto exchanges, has announced its decision to list Ronin (RON), an Ethereum-based gaming project on its platform following the token’s surge of over 108% in value over the past month.\n\nThe listing of Ronin on Binance marks a crucial moment for the project and highlights the growing importance of blockchain gaming in the broader crypto space.\n\nBinance’s Support for Ronin\n\nBinance revealed its plans to support Ronin for trading in a blog post, stating that it would provide users with the opportunity to engage with this unique gaming token. To enhance user awareness and safety, Binance noted that it will attach a seed tag to RON, requiring traders to pass quizzes every 90 days to ensure they understand the risks associated with trading these tokens.\n\nThe new spot trading pairs for RON on Binance will include RONIN/BTC, RONIN/USDT, RONIN/FDUSD, and RONIN/TRY, offering users a variety of options to trade against popular cryptocurrencies. Deposits for RONIN have already commenced, with open trading for the spot trading pairs starting on February 5, at 13:30 (UTC). Withdrawals will become available on February 6, at 13:30 (UTC), providing users with full access to their RONIN holdings.\n\nNotably, RON was trading at $1.68 on January 8 and reached a high of $3.50 on Feb 6, representing a 108% rise. However, at the time of writing, RON has retraced by 3.6% and is trading at $2.87, with a market capitalization of $780 million.\n\nRonin, an EVM-compatible blockchain specifically tailored for Web3 gaming, has gained widespread recognition for its ability to scale gaming experiences to accommodate millions of daily active users. Developed by Sky Mavis, the team behind the popular gaming project Axie Infinity (AXS), Ronin stands out as a pioneering platform in the realm of blockchain gaming.\n\nHowever, Ronin has not been without its challenges. In March 2022, the platform experienced a security breach, resulting in a loss of over $600 million. Despite this setback, Sky Mavis swiftly identified the attacker and red-flagged the exploiter’s address for purposes of investigation. Notably, Binance was among the key contributors to the compensation fund established to support victims of the hack, reaffirming its commitment to the security and resilience of the crypto ecosystem.\n\nDespite these challenges, Ronin has continued to thrive, with recent data indicating a surge in activity within the Ronin ecosystem. Market intelligence firm Nansen reported a staggering 368% increase in active addresses on Ronin in November 2023, highlighting the platform’s growing popularity and adoption.\n\nCollaborations With Ronin\n\nIn addition to its listing on Binance, Ronin has forged strategic partnerships to further its mission of advancing blockchain gaming and NFT adoption.\n\nThe integration with Binance Pay, announced in December, streamlines the process of wallet funding for Ronin users, enhancing accessibility and usability within the ecosystem.\n\nFurthermore, Ronin has teamed up with Impossible Finance to deploy launchpad infrastructure for Web3 game launches. Calvin Chu, Core Builder of Impossible Finance, emphasized the potential of Ronin as a catalyst for the emergence of new projects, users, and communities, highlighting the synergies between the two platforms in driving the adoption of blockchain gaming and NFTs.\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQd04yRjZGSXhfS3hEbG5VeXkwY3l5UmRHX01uVENWeGM2bVpzTWlZQ1BxT0w3N2JmMnBVU0RvS0FiYzR2ako3WTQ1Mk9SbVItOHg1ZXA4WVMwcGFYM0RtSXg3c18zcVBBaHBrQnU2MFpWcl9lNXp3WlpEcEVYd0NWc1dLVUxfOFlTYUHSAY8BQVVfeXFMTmZBQjlIdFNxV040T3F1cUlJM0F6ZzhRbWV0dUk1NWw5S1pucXJHZG44Z2Eta1RNbnhIWWk2X25yOUlEeEVKOHQweHQ0R0VISjNaXzlDcFowY0ZKOWVSMXpkczlXb2tFRm9Pc0hKcWNrWnEyQXlfTjNMdWdaWVZzOFlmQlQ0d1ZYMkVvQVlwUVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "First ERC404 Token Sees Enormous 13x Pump: But There's Silver Lining - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nNovelty and explosive price movements go head-to-head in the crypto industry, and the latest novelty on the market is Pandora, the inaugural token leveraging the new ERC404 standard. This experimental token standard, a hybrid of ERC20 and ERC721, aims to blend the liquidity and fractionalization capabilities of these well-established protocols. Pandora's price has skyrocketed to over $8,600, marking a staggering 13-fold increase for some investors.\n\nAdvertisement\n\nThe ERC404 standard is an ambitious attempt to marry the functionalities of ERC20 tokens, known for their fungibility, with ERC721 tokens. By doing so, ERC404 seeks to enable a novel form of asset representation that could potentially unlock new mechanisms for trading, ownership and asset interaction within the blockchain.\n\nThis standard employs a technique known as \"pathing,\" a method designed to allow for the coexistence of token amount data and identifiers within a unified framework, albeit with certain tradeoffs due to its experimental nature.\n\nThe dramatic ascent of Pandora's price is exemplified by the success story of a trader who turned a $97,484 investment into approximately $1.2 million in just two days. By purchasing 154 Pandora tokens at $633 and selling 25 of them at $7,548 each, the trader realized a profit of $91,211, with an outstanding holding valued at around $1.1 million.\n\nAdvertisement\n\nHowever, each meteoric rise on the market is not so simple. The ERC404, while groundbreaking, is experimental and unaudited, suggesting that its integration and broader adoption come with inherent risks.\n\nThe rapid price increase of Pandora could potentially precipitate a sharp reversal, as history has shown with other crypto assets that have experienced similar parabolic uptrends. Investors and enthusiasts are thus advised to proceed with caution, bearing in mind the speculative nature of such investments and the uncharted territory that ERC404 tokens represent."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOQ3N2ZXRrLUM3SXc2U2U3aURTUVFKRjFFTE5LaTdEanlONFNheEZDekEtWmVDMHF6NmxWdmpmQ2x4QVQyQ09adGhyVmVmc3lUd1NQcHBzNlJyVkh2RHY3ZFVrNFNmWEF3bnoyeURFc3BtYi1kYjV1cDhBQmRRZ3FBQ3hnUktlSjNwa1h3dkgtb3VtYVpENG9CLWNsVFl0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "DeFi developer Ameen Soleimani takes another stab at peg-less stablecoin - DLNews",
        "content": "It’s a cypherpunk’s dream: a stable cryptocurrency backed entirely by Ether, rather than real-world assets under the purview of hostile governments.\n\nBut RAI never took off. Its founder, prominent Ethereum developer Ameen Soleimani, hopes a newer version called HAI will prove decentralised stablecoins can thrive without being wedded to the dollar and, in turn, a central bank he believes is hellbent on gradually inflating away its value.\n\nPeople who hold a related token, KITE, will govern HAI. Beginning today, people who’ve used RAI and the Optimism blockchain can check their eligibility for a February 13 airdrop of KITE.\n\n“I would like to have money that doesn’t get rugged — for me, for my friends, for everybody on the planet,” Soleimani told DL News.\n\n“By providing an alternative, it’s a check on other systems that might try to exploit you. So it’s similar in ideology to Bitcoin.”\n\nBitcoin’s proponents consider it a decentralised hedge against inflation, an appreciating asset beyond the reach of governments that often wield their control of money to cow dissidents. But it has been too volatile to serve as “electronic cash” as first envisioned.\n\nCrypto developers have long sought to fix that by creating decentralised stablecoins such as RAI and Liquity’s LUSD. They have been mostly popular with DeFi natives, but Soleimani hopes that HAI, which is slated to launch February 20, will appeal to a broader range of people due to it its lower cost and a greater range of collateral assets.\n\nRAI vs HAI vs DAI\n\nLiquity accounted for a paltry 0.13% of the stablecoin market at the end of 2023, according to stablecoin ratings firm Bluechip. With a market capitalisation just under $5 million, RAI was even smaller: its share of the market was just 0.01%.\n\nJoin the community to get our latest stories and updates\n\nAbout $23 million in Ether backed RAI as of Tuesday.\n\nThat’s partly because both rely solely on deposits of Ether to back their stablecoins. That became less appealing after a pair of Ethereum upgrades that de-risked staking, a process in which investors lock up their Ether for a modest annual yield.\n\nUnlike RAI, HAI can be minted against multiple forms of collateral, such as Optimism’s OP and liquid staking tokens like stETH. Users who hold a separate token called KITE will have a say over what collateral HAI will accept.\n\nIn a February 12 airdrop, the developers behind the new stablecoin will give away one-fifth of the KITE supply to about 18,000 crypto wallets that belong to people who have used RAI, Optimism, and a prototype version of HAI.\n\nHAI will exist on Optimism, a low-cost blockchain that settles on Ethereum for security purposes, technically called a layer 2 blockchain.\n\n“We wanted to have multiple forms of collateral so that we could work with a broader base of users,” Soleimani said, “and we wanted to do it on a Layer 2 so that we could actually have smaller value loans and more everyday users can use it instead of, like, rich Ethereum whales.”\n\nAnother decentralised stablecoin, Maker’s DAI, gradually lost that moniker as it accepted greater amounts of centralised collateral in the form of USDC and US Treasuries.\n\nSoleimani said HAI could guard against mission drift by requiring a higher voting threshold to add collateral than to change other parameters; by delaying implementation of new collateral after a vote, giving anyone unhappy with the decision the opportunity to exit their position; and by limiting the amount of certain collateral users can deposit to mint HAI.\n\n‘Make more float coins’\n\nHAI will also start trading at $1, rather than RAI’s arbitrary $3.14 soft peg. RAI floats freely against that peg, but never too far from it. Similarly, HAI is expected to gradually drift from $1.\n\nSoleimani has taken to calling these tokens “float coins.” He hopes their popularity will show people that “stability” is not synonymous with tracking the value of the dollar.\n\nMarket values of top stablecoins\n\nTo ensure stability, it uses a self-correcting mechanism akin to a Chinese finger trap: the more someone tries to manipulate its value on the market, the more expensive the effort becomes.\n\nThe mechanism has worked well for RAI: according to data gathered by pseudonymous data analyst Kyoronut, RAI has been less volatile relative to the dollar than other world currencies.\n\nWhile Soleimani hopes HAI becomes a popular stablecoin, its market capitalisation isn’t the only measure of success, he said.\n\nHAI’s code is easy to copy, tweak, and deploy. Soleimani wants people to take advantage of that.\n\n“Make more float coins,” he said.\n\n“In the future that I want, instead of, like, going to the bank to get a loan against your farm or whatever, you and your friends — high tech farmers — would be able to make your own bank. You would have the digital tools to do so.”\n\nCorrection: This article was updated on January 7 to clarify that 18,000 wallets will receive KITE in an airdrop. The article originally stated 18,000 KITE would be distributed in the airdrop."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1xUlZqdUkyQm9fYVdvV3dYM2I0OVVTUEJsalVXNDFoWUVlYmtFS0YzNVlpMHRyYm1LNTVtRTAzb1lUSEpzUGZPdXY3Q01mdmhBZWhCOFd3SEpPVE5mRXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How to Invest in Ethereum - Moneyland.ch",
        "content": "Ethereum (ETH) is the second-largest and best-known cryptocurrency after bitcoin (BTC). This moneyland.ch guide explains how you can invest in Ethereum.\n\nWhat is Ethereum?\n\nBitcoin clearly dominates the cryptocurrency space by a wide lead. But when ranked with all other cryptocurrencies excluding bitcoin, Ethereum holds first place. The cryptocurrency, which was first introduced at the North American Bitcoin Conference in Miami, currently has a market capitalization of 237 billion Swiss francs (as per February 1, 2024).\n\nStrictly-defined, the term Ethereum denotes the entire blockchain-based infrastructure. The cryptocurrency that enables transactions within the Ethereum platform is called Ether. However, the term Ethereum is widely used to describe the cryptocurrency as well.\n\nUnlike bitcoin, the Ethereum blockchain does not limit the number of Ether that can be generated. Ether is used to settle payment transactions on the platform. Ethereum is best known as a platform for smart contracts – transactions that are performed automatically when predefined conditions are met, without the need for an intermediary.\n\nTable 1: The biggest cryptocurrencies by market capitalization in Swiss francs\n\nCryptocurrency Market capitalization Bitcoin CHF 720 billion Ethereum CHF 237 billion Tether CHF 83 billion BNB CHF 39 billion Solana CHF 36 billion\n\nDate: 01.02.2024.\n\nHow can I invest in Ethereum?\n\nIf you are interested in investing in Ethereum, there are a number of different ways to do it:\n\nBuy Ethereum at ATMs or stores: A number of Swiss cryptocurrency service providers sell Ethereum at vending machines and in certain stores.\n\nA number of Swiss cryptocurrency service providers sell Ethereum at vending machines and in certain stores. Buy Ethereum online: There are many Swiss online service providers that you can use to buy Ethereum online.\n\nThere are many Swiss online service providers that you can use to buy Ethereum online. Exchange Traded Notes (ETNs): ETNs track the price of Ethereum and enable you to profit from price growth without having to buy actual Ethereum.\n\nETNs track the price of Ethereum and enable you to profit from price growth without having to buy actual Ethereum. Ethereum futures ETFs: These ETFs invest in futures – contracts used to speculate on price developments.\n\nThese ETFs invest in futures – contracts used to speculate on price developments. Contracts for difference (CFDs): CFD’s based on the Ethereum price can be used to speculate on positive or negative price developments. Typically, CFDs use leverage, and this exposes you to a lot of risk. For this reason, CFDs generally are not recommended for inexperienced investors.\n\nWhat are the possible costs of investing in Ethereum?\n\nExchange rate markups: All Ethereum service providers and trading platforms use their own exchange rates to calculate the price of Ethereum in Swiss francs. The cost of buying Ethereum largely depends on how high the dealer’s markup over the market price is. Make sure to compare the rate offered with the market price before you buy Ethereum. Even a platform that does not charge fees at all can still be more expensive than other platforms if it uses an unfavorable exchange rate.\n\nAll Ethereum service providers and trading platforms use their own exchange rates to calculate the price of Ethereum in Swiss francs. The cost of buying Ethereum largely depends on how high the dealer’s markup over the market price is. Make sure to compare the rate offered with the market price before you buy Ethereum. Even a platform that does not charge fees at all can still be more expensive than other platforms if it uses an unfavorable exchange rate. Transaction fees: Most trading platforms change a fee every time you buy or sell Ethereum. You also pay a fee – a brokerage fee – when you buy or sell ETNs using a stock brokerage account.\n\nMost trading platforms change a fee every time you buy or sell Ethereum. You also pay a fee – a brokerage fee – when you buy or sell ETNs using a stock brokerage account. Total expense ratios (TERs): Before investing in Ethereum using an ETN (more on this below), you should make sure to compare the total expense ratios (TERs) of Ethereum ETNs. The TER shows the ETN’s ongoing fees, which detract from investment performance.\n\nHow can I buy Ethereum offline?\n\nYou can buy Ethereum at some brick-and-mortar stores and at special vending machines. Simplicity is the main advantage: You can buy Ethereum and pay with cash (or other payment methods, in some cases), without having to first open an account with a service provider. The main disadvantages of buying Ethereum at brick-and-mortar outlets are the high fees and the poor exchange rates.\n\nTypically, you receive a QR code which lets you access an Ethereum wallet that contains the Ethereum you purchased.\n\nTable 2: Swiss service providers for buying Ethereum offline\n\nService provider Are payments in\n\nCHF possible? Limits for Ethereum\n\npurchases Fees Bity ATMs Yes, in cash. Euros are\n\nalso accepted. CHF 1000 per 30 days.\n\nHigher limits with identity\n\nverification. CHF 2 plus 3.5% to 9.5% of the\n\ntransacted amount, depending\n\non the ATM. Cryptonow cards\n\n(Värdex) Yes. The cards are\n\navailable at various\n\nretail outlets, including\n\npost offices, Coop\n\nsupermarkets, and\n\nstores in the Valora\n\ngroup (including\n\nK Kiosk and Avec). CHF 1000 per 30 days 9.9% of the transacted amount,\n\nplus a CHF 1 activation fee. Tibc ATMs Yes, in cash. Euros\n\nare also accepted. CHF 1000 per 30 days.\n\nHigher limits with with\n\nidentity verification. Variable. Värdex ATMs Yes, in cash. Euros\n\nare also accepted.\n\nFor purchases at the\n\ntill at Värdex partner\n\nstores: Debit cards\n\nare also accepted. CHF 1000 per 30 days.\n\nHigher limits with with\n\nidentity verification. CHF 1 plus 6.5% to 10% of the\n\ntransacted amount, depending\n\non the ATM.\n\nWith the exception of Bity, all of the Swiss companies included in Table 2 are registered with Finma. Date: 01.02.2024.\n\nHow can I buy Ethereum online?\n\nThere are many different Swiss online service providers from which you can buy Ethereum online. Most platforms require you to open an account before you can buy Ethereum through them, and that involves some time and effort. The advantage is that the fees are usually much lower than those charged for offline purchases.\n\nTable 3: Swiss service providers for buying Ethereum online\n\nService provider Bank license Are payments in CHF possible? Fees Bitcoin Suisse\n\n(minimum account\n\nbalance: CHF 100,000) No Yes, by bank transfer. 0.95% of the transacted amount. Bity No Yes, by bank transfer (verified\n\ncustomers can also pay with\n\nVisa or Mastercard). 1.2% of the transacted amount\n\n(0.8% for verified customers). DFX No Yes, by bank transfer. 1.49% of the transacted amount. Lykke No Yes, by bank transfer. None. Mt Pelerin No Yes, by bank transfer. Card\n\npayments are also accepted,\n\nbut with a fee of 2.5% to 3.4%. No fees for the first CHF 500 per\n\nyear. A fee of between 0.9% and\n\n1.3% applies to transactions above\n\nthat amount. Lower fees apply to\n\nholders of Mt Pelerin tokens. Smart Valor No Yes, by bank transfer, debit card,\n\nor credit card. 1.29% to 8.9%, depending on the\n\namount transacted. Swissborg No Yes, by bank transfer. Card\n\npayments are also accepted,\n\nbut with a fee of 2.25%. 1.49% of the transacted amount.\n\nLower fees apply to holders of\n\nSwissborg tokens. Swissquote Yes No, only EUR or USD accepted\n\nfor Ethereum purchases. You\n\ncan fund your Swissquote\n\naccount with CHF by bank\n\ntransfer. Debit cards and credit\n\ncards are also accepted, but\n\nwith a fee of 1.9%). 0.5% to 1%, depending on the\n\namount transacted.\n\nWith the exception of Bity, all of the Swiss companies included in Table 3 are registered with Finma. Date: 01.02.2024.\n\nWhat are Ethereum ETNs?\n\nThe principle of exchange-traded notes (ETNs) is similar to that of exchange-traded funds (ETFs). Like an ETF, an ETN aims to replicate the performance of an underlying asset – Ethereum in the case of Ethereum ETNs. These notes enable you as an investor to participate in price growth without buying actual Ethereum. You can invest in ETNs using a stock brokerage account at a bank, as with ETFs. ETNs are passively managed and are best suited to investors who only want to participate in the price developments, without actually holding Ethereum.\n\nThe difference between an ETN and an ETF is that an ETN is not an investment fund, but a promissory note that gives you a debt claim against ETN’s issuer. Your investments are not protected if the issuer goes bankrupt because unlike ETF shares, ETNs are not classified as segregated assets.\n\nThe titles of many ETNs include the abbreviation ETP, which stands for exchange-traded product. This is a broad term that covers many different assets that are traded on stock exchanges, including both ETNs and ETFs.\n\nWhich Ethereum ETNs are there?\n\nThere are many different Ethereum ETNs available to Swiss investors, but the selection varies depending on which stock brokerage account you use.\n\nTable 4: Ethereum ETNs ranked by costs (TER)\n\nETN ISIN Domicile of ETN issuer TER CoinShares Physical Ethereum GB00BLD4ZM24 Jersey 0.00% 21Shares Ethereum Core ETP CH1209763130 Switzerland 0.21% WisdomTree Physical Ethereum GB00BJYDH394 Jersey 0.35% Global X Ethereum ETP GB00BLBDZW12 Jersey 0.65% SEBA Ethereum ETP CH0587418630 Switzerland 0.75% VanEck Ethereum ETN DE000A3GPSP7 Liechtenstein 1.00% Ethereum Staking ETP CH0454664027 Switzerland 1.49% ETC Group Physical Ethereum DE000A3GMKD7 Germany 1.49%\n\nDate: 01.02.2024.\n\nThe ETNs included in Table 4 all use physical replication, meaning the issuer holds actual Ethereum as collateral.\n\nApart from the TER, you should also pay attention to the brokerage fees and custody fees charged by your bank. Typically, the fees for ETNs are the same as those for ETFs.\n\nCan I invest in Ethereum using ETFs?\n\nUnlike bitcoin, there are not yet any ETFs that replicate the market price of Ethereum. Currently, you only have the option of investing in Ethereum futures ETFs, which speculate on future price developments. These ETFs invest in futures.\n\nWhat are the risks of investing in Ethereum?\n\nInvesting in cryptocurrencies like Ethereum can potentially yield high returns, but it more closely resembles a lottery than a genuine investment. The prices of cryptocurrencies are very volatile, and there is no sure way to predict future price developments. Substantial losses are possible over both short terms and long terms, and a total loss cannot be ruled out. Ethereum can be used as an additional component to further diversify your investment portfolio. But it should never be a major part of your portfolio.\n\nYou should be especially careful with leveraged CFDs. Using these is identical to betting on the Ethereum price. Because a part of the investment is paid using a loan, you can end up losing more money than the amount you invested. These products are generally not suitable for inexperienced investors.\n\nMore on this topic:\n\nHow to buy bitcoin in Switzerland\n\nHow to pay with bitcoin in Switzerland\n\nShould I invest in bitcoin & Co?\n\nHow to invest money in Switzerland"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNRDZCNnJNZlNHUEhCZkVqUVJqajFGbzVKUjl0N1RpNHBqR2ZhWWlzSVZjN05XTzlscVF6Nlg2dUllYW9WS2syUjZ2RFhhb1JUV3VGUUJOclhzWGRCelpYWk16YTRTc2F4bUQ2c3ljR09WaWY4OWdtQTNYVzNWYkNlRWNVd29ITFBVdUZnNHNVSl9JQWJjYjRvMFdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ronin is making a comeback two years after its $624m hack - DLNews",
        "content": "A version of this story appeared in our The Decentralised newsletter. Sign up here.\n\nGM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nAxie Infinity’s Ronin blockchain is making a comeback\n\nA new liquid restaking protocol wants to ‘vampire attack’ Lido\n\nThe Curve team is gearing up for another big launch\n\nRonin trading volume and TVL soar\n\nOn March 23, 2022, the bridge connecting the Ronin blockchain to Ethereum was hacked for $624 million, the biggest onchain crypto hack ever.\n\nThe situation looked bleak. In addition to the huge loss, user activity on Axie Infinity, the Ronin Blockchain’s flagship game, plummeted.\n\nFast-forward two years, and despite the odds, Ronin is thriving again. On Monday, Binance listed the blockchain’s RON token for trading after a 74% rally since the start of the year.\n\nThe RON token now trades higher than before the Ronin bridge suffered a $624 million hack in 2022 (CoinGecko)\n\nRonin is a so-called layer 1 blockchain. It was originally launched as a low-cost alternative to Ethereum.\n\nIn recent months, activity on Ronin has spiked. Trading volume on the blockchain is up 54% this week, while total value locked — a measure of funds locked in protocols on Ronin — jumped 28% this month.\n\nJoin the community to get our latest stories and updates\n\nGames such as Pixels have brought a new wave of users to Ronin, while existing projects — like early NFT franchise Cyberkongz — are planning to migrate to Ronin.\n\nRonin’s recent success could be a bellwether for a wider resurgence in crypto gaming, following its boom and bust during the previous bull market.\n\nPuffer Finance wants Lido’s blood\n\nPuffer Finance, a new entrant to the nascent liquid restaking sector, has drawn in over $440 million in deposits in less than a week.\n\nPuffer isn’t just competing against rival liquid restaking protocols like Kelp DAO and ether.fi — it wants to take on Lido, the biggest liquid staking protocol with more than $21 billion of deposits.\n\nIt plans to conduct what’s known in DeFi circles as a vampire attack — a type of aggressive growth strategy where a protocol targets users of a rival protocol by offering additional incentives.\n\nPuffer requires users to lock up Lido’s stETH to mint its restaking token called pufETH. Once the protocol fully launches later this year, Puffer will convert the stETH tokens backing pufETH into Ether and restake them itself in permissionless validators.\n\nIf successful, the plan should help chip away at Lido’s market dominance — a hot issue within the Ethereum community.\n\nCurve isolated lending is coming\n\nThe team behind decentralised exchange Curve Finance and the crvUSD stablecoin is about to launch its own lending market.\n\nDubbed Llamalend by the Curve community, the new protocol will allow users to borrow and lend using any Ethereum-based crypto as collateral. It uses the LLAMMA soft liquidation mechanism outlined in Curve co-founder Michael Egorov’s crvUSD whitepaper.\n\nThis means that instead of loans hitting an all or nothing liquidation threshold — as they do on other lending markets such as Aave — Llamalend will liquidate delinquent positions gradually. The algorithm can even buy back sold collateral if prices recover.\n\nEgorov told DL News that he tentatively expects Llamalend to launch by the end of the week.\n\n(Full disclosure, DL News’ founders were core contributors to the Curve protocol.)\n\nData of the week\n\nThe Ronin blockchain’s TVL has increased 250% over the past three months. And since the start of the year, the number of stablecoins on Ronin has also jumped 36%.\n\nThe fact that users are depositing stablecoins to Ronin is important. It shows that the TVL increase isn’t just due to the price increases of tokens already on Ronin, and that users are depositing new funds to the blockchain.\n\nAfter a long period of inactivity, stablecoin deposits to the Ronin blockchain are increasing. (DefiLlama)\n\nThis week in DeFi governance\n\nTEMP CHECK: Uniswap set to greenlight deployment on Zora\n\nVOTE: Frax makes more progress toward onchain US Treasury bills\n\nVOTE: Arbitrum DAO wants to diversify its holdings with real-world assets\n\nPost of the week\n\nMemecoins broke through into the real world this week after someone adorned the iconic raging bull statue near Wall Street with a pink crocheted hat — a nod to Solana memecoin dogwifhat.\n\nIt’s not the first time memecoin investors have pulled a similar stunt. In 2021, pictures of the giant brass bull facing off against a Shiba Inu went viral in appreciation of Dogecoin.\n\nYes this is real pic.twitter.com/oAKRJv2H1J — OJC 💫 𓃓 (@OjCrypto) February 2, 2024\n\nYes this is real pic.twitter.com/oAKRJv2H1J — OJC 💫 𓃓 (@OjCrypto) February 2, 2024\n\nWhat we’re watching\n\nI'm excited to share our latest research on adjusting the block gas limit.\n\nTogether with @VitalikButerin, we're exploring paths to reduce the maximum block size, balance calldata pricing, and ultimately raise the block gas limit.https://t.co/Thvyw9Yog3 — Toni Wahrstätter ⟠ (@nero_eth) February 5, 2024\n\nI'm excited to share our latest research on adjusting the block gas limit.\n\nTogether with @VitalikButerin, we're exploring paths to reduce the maximum block size, balance calldata pricing, and ultimately raise the block gas limit.https://t.co/Thvyw9Yog3 — Toni Wahrstätter ⟠ (@nero_eth) February 5, 2024\n\nEthereum Foundation researcher Toni Wahrstätter and Ethereum co-founder Vitalik Buterin have co-authored a proposal to increase the block gas limit and the price for nonzero calldata bytes.\n\nDoing so, they argue, should reduce block sizes and incentivise the transition to using blobs for data availability.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQLXZqVXJmUFNpTDVjRmVCX1BaWE55cXp6clhOQlZiRWc1VEJ3WFptTGZfYVFwNjZJVWxnM0NueDNrMFJ1UWZDelpacmVkVWZ6d0p2bHFnVjZ5dXNTSW4wMlVWcm5zU3hBN0VhYklCaTBqb2VPbnVvZU1La29BRDVQTXR1ZFVQNnRhZHBPZ0xqWXVtV0hfRHd3TXVzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Farcaster NFTs are already selling for thousands of dollars. Here’s why - DLNews",
        "content": "Crypto’s latest decentralised social media app has taken center stage as users are now busy trading Farcaster IDs.\n\nEarly IDs have been eligible for various airdrops, likely driving trading activity.\n\nFarcaster is crypto Twitter’s main character these days, attracting interest from many crypto notables, including Ethereum co-creator Vitalik Buterin.\n\nTrading on Farmarket is booming, with users spending large on Farcaster IDs.\n\nSo far, the highest-selling FID on the Farcaster account marketplace earned the previous owner almost $7,000 in Ethereum.\n\nEarly joiners to Farcaster, an Optimism-based social media platform, claimed low FIDs — between one- to five-digit IDs. FIDs have now reached the six-digit level.\n\nFarcaster IDs are displayed as digits, with lower digit IDs attracting higher bids. They are also NFTs that can be bought and sold.\n\nUsers are offering each other as much as $34,000 for account NFTs on the Farcaster account marketplace FarMarket. (FarMarket)\n\nInterest in low FIDs is likely tied to some Farcaster apps having started airdropping viral meme coins to low-digit FIDs. One token called DEGEN has already surged 800% since late January, CoinGecko data shows.\n\n“I think this is a fad that will die soon, and [that] is why I immediately listed my ‘rare’ FID for a reasonable price — top sale at the moment for 3 ETH,” pseudonymous X user kcaz told DL News, referring to the hype around low FIDs.\n\nThey were the ones that sold the FID worth nearly $7,000, ID #4323.\n\nSecondary markets all the way down\n\nLaunched in August 2022, the protocol has over 293,000 users from over 41,000 Ethereum wallets and has already attracted several notable crypto personalities, including Ethereum co-creator Vitalik Buterin.\n\nJoin the community to get our latest stories and updates\n\nSpeculative interest in low-digit crypto IDs is not a new phenomenon.\n\nLow-digit Ethereum Name Service names have also sold for thousands of dollars in the past with 000.eth selling in July 2022 for 300 ETH, worth $315,000 at the time.\n\nAs was the case for digit-ENS domains, tiered floor prices have also emerged for FIDs based on how low they are. The floor price is the lowest offer for an NFT and can be used to calculate the minimum value of an NFT collection.\n\nFIDs lower than 20,000 currently have a floor price of a few hundred dollars, Farmarket data shows.\n\nFarcaster on the rise\n\nThe speculative FID trend comes amid a broader increase in Farcaster adoption metrics.\n\nThe protocol’s daily active user count soared 400% last week, coinciding with the protocol’s launch of Frames — a feature letting users turn social posts on Warpcast into mini-apps for use cases like NFTs and gaming.\n\nWarpcast is one of the many apps built atop the Farcaster protocol. Many are touted as decentralised alternatives to popular web2 social media platforms. Warpcast is similar to X, formerly Twitter. Fancord resembles Discord.\n\nWhile Farcaster has enjoyed soaring metrics, its competition struggles to maintain pace.\n\nFriend.tech, last year’s dominant SocialFi protocol, has seen its user numbers plummet 96% from its peak in September.\n\n“Bad gamefi is using financial speculation as a substitute for fun,” tweeted Buterin, responding to commentary on Friend.tech’s recent drop in user activity. “I believe a similar thing for crypto social.”\n\nThe Ethereum co-creator predicted that Farcaster, along with another web3 media protocol Lens, “will not be deserted in 4 months, or 1 year.”\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxOeXZFenNzczdCWTF3T2hYYVNyMHNZcUxTTjItQ1AwbFVlZ2RoR3pzczR1ZjRIZmFtd0FhUkdkMHJrLVVHOV9XZU92eWdtZENZYmRRLXY4OS1qd2pkRm5XMVltZmc2X3pWRU1uOHN5bXNqeXlXcG91aEZZUzN6VWpiMVR5RWstNlhiNEZScWlqRDItdy1WRllhTDd0dkNObmRpZ3R5TnhQZ3RScTJkTkkyZTdRQmlEYjdyV3Z0cGI0cTRtVDF3a0h2WGxVR09Ycm9pclBGM05uNENUaHFlVm9YSXpGSFpEOFhhVm1lbWtnMGZKVUZBdGVQblVn0gH_AUFVX3lxTE5iTk1rc3R4OVFPdDY4UTFYZE1xVjUzVHZENVhjLVhkTGFEZ2hodHpfcWNxWThQN1Y2TzFMNVVaem1USldwMFB4VENlYXhLZDJwYXZCeG12OGQ1U0xOSjNYdGRLNF9qSlBrSGV3Tm95a21MbERORDFQM1p2eVNiMWEtb3pyRjNZZTkwRDltS0pZRElNVFotY1NGVzVvbEI4NGxvSEtCVDBxQmx4RU1hb0R0QkFZbXkzLU40dGlWSl9QbWxjSEpUM3ZOMXlHNDF0NmRjQjA3MWlfRVZrQ0ZpaDhRNXAzUVMtamlUTmRERm9Rekxwc0oyQmJxR1JtdjhjVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $43,000, Ronin Loses Over 25% - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, dipped below the $43,000 mark early Tuesday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor gains and losses across the board. The Ethereum Name Service (ENS) token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 13 percent. Ronin (RON), on the other hand, became the biggest loser, with a 24-hour dip of over 25 percent.\n\nThe global crypto market cap stood at $1.64 trillion at the time of writing, registering a 24-hour gain of 0.42 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,792.43, registering a 24-hour gain of 0.27 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.74 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,312.58, marking a 24-hour gain of 0.81 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.02 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.21 percent, as per CoinMarketCap data, currently priced at $0.07834. As per WazirX, Dogecoin price in India stood at Rs 6.90.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.86 percent. At the time of writing, it was trading at $67.73. LTC price in India stood at Rs 5,871.87.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5066, seeing a 24-hour jump of 0.17 percent. As per WazirX, Ripple price stood at Rs 44.50.\n\nSolana (SOL) Price Today\n\nSolana price stood at $95.92, marking a 24-hour dip of 0.95 percent. As per WazirX, SOL price in India stood at Rs 8,401.\n\nTop Crypto Gainers Today (February 6)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nEthereum Name Service (ENS)\n\nPrice: $20.80\n\n24-hour gain: 13.70 percent\n\nSui (SUI)\n\nPrice: $1.59\n\n24-hour gain: 8.87 percent\n\nOptimism (OP)\n\nPrice: $3.21\n\n24-hour gain: 7.02 percent\n\nGnosis (GNO)\n\nPrice: $231.89\n\n24-hour gain: 6.05 percent\n\nImmutable (IMX)\n\nPrice: $2.26\n\n24-hour gain: 5.97 percent\n\nTop Crypto Losers Today (February 6)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRonin (RON)\n\nPrice: $2.53\n\n24-hour loss: 25.69 percent\n\nPyth Network (PYTH)\n\nPrice: $0.465\n\n24-hour loss: 7.43 percent\n\nFlare (FLR)\n\nPrice: $0.02913\n\n24-hour loss: 6.67 percent\n\nInternet Computer (ICP)\n\nPrice: $12.17\n\n24-hour loss: 6.19 percent\n\nOasis Network (ROSE)\n\nPrice: $0.1121\n\n24-hour loss: 3.55 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin held its position above the $42,000 mark despite a 14 basis points increase in the 10-year US Treasury bond yield. Federal Reserve Chair Jerome Powell's statement that the Fed had little intention to cut rates in March did not shake the bullish sentiment, with the $42,000 level being defended. Despite this, the $42,000 level has seen defence by bullish investors. The next resistance for BTC is at $43,800, with support at $41,300. Meanwhile, Ethereum is presently at the $2,300 mark, with a potential bullish move anticipated if it surpasses $2,400, aiming for $2,600. Until then, Ethereum is expected to trade sideways.”\n\nCoinSwitch Markets Desk noted, “As BTC has been trading in a narrow channel for more than a week now, the up-trend still remains intact with $42k being the level to break on the down side and $44k on the up-side. However with Blackrock now holding more than $2 billion worth of BTC, bears will have to instill some massive amount of fear for breaking it to the downside. One of the biggest news from yesterday came from GoDaddy. The company announced that its users can now link domain names with Ethereum Name Service, ENS (+13%) at no extra cost. This is a big boost for both Ethereum (+1.68%) and the ENS token.”\n\nRajagopal Menon, Vice President, WazirX, said, “The potential liquidation of Genesis's assets could exert a negative impact on market prices. The selling pressure that started after the approval of spot BTC ETFs persists, influencing the market ahead of the anticipated Genesis sell-off. Bitcoin's price has retreated from $43,000 levels and faces a challenging struggle to avoid a further decline back to the $40,000 support level, which held during the bullish market sentiment at the end of last year. Ethereum's pricing signals indicate overbought conditions, suggesting a potential lull at the resistance level and a possible market downturn. Contrary to market expectations of a rally, XRP continues its downward trajectory, surprising investors. The Relative Strength Index signals oversold conditions amid a bearish sentiment, with moving averages indicating a prevailing 'Sell' sentiment.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The total crypto market cap stands around $1.64T, a 0.73% increase over the last day. The selling pressure by Grayscale which has sold 141,00 Bitcoin is being absorbed by 175,000 Bitcoin bought through ETFs.The Cumulative spot Bitcoin ETF volume has also crossed the $30B threshold reflects a huge demand for Bitcoin in the Spot ETFs. Bitcoin has persistently attempted to breach the $44,000 level for several weeks but it has been hindered by low trading volume.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's January surge in trading volume to $16.01 billion, the most since September 2022, pushed its value past $43,000. Factors such as reduced grayscale bitcoin sales and a strong US stock market contributed to this. Upcoming events, including the US Federal Reserve meeting, can affect market trends. Despite the potential uncertainty, Bitcoin's market capitalization rose 2% to $1.66 trillion in 24 hours. Federal Reserve Chairman Jerome Powell's plan to cut interest rates three times in 2024 aims to take advantage of the strong US economy and control inflation. Crypto analyst DonAlt predicts that Bitcoin could reach $60,000 if it clears key barriers and maintains a bullish outlook.”\n\nCoinDCX Research Team told ABP Live, “In the past 24 hours, the crypto market initially remained stable but later saw a decline, impacted by the fall in the US market and Coinbase shares. The overall market has been relatively quiet recently as BTC consolidates around the $43,000 level. However, on a higher time frame, BTC exhibits a bullish trend with confirmations from EMAs. ETH is following a similar price action to BTC, and both cryptocurrencies need to break out of their current consolidations to signal a significant move in either direction.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOMGwzbGJzYUZwWW9ERW5yVDZ6ZDlLWUpWUk5oTmkwb25qUzBKdElyOER5TkxsS3A4bU9NeDhkZm5ucnN3S01ZVE52V25KblRQVDFYbE9mcFNtR0R4dUN2c1g4ZDNQZDV1SFotSWZMMS1XNnpYVWh4bzJfUEFMcGZDUWJDV1RjeG1paFM4MVdpREY3QV8xYTEzTUFZdDFFLUROZU9adUYyQk83VVdGZllOdHVTdDdWV3FF0gHGAUFVX3lxTE5Ea1hOdTRMeElWYjFwSjRpdnFwcUYtTWhRYTl1SU5sbnYzekI3WXlHc0FnX2MxVnJHY0lvR1FDcWpzQlZEQmdIcmM3VDI0WGI3NDlPVUN3RzZUUF9ZUExJU1RvR1lON2VWamtJbzFxWDRNVm45bmFWUXNjNWZkQkhBeDlXZUl5S2ZSeElXLW84ZkZaNU5NYXJ3OTNXaFVNSzdpSmNSTEhOb1ZscDFyR29hRGVoNkZPZFZFN3hacTZMdndxTnpRQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum Dip; RON Lost 25% - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBGd3ZjRm9fd1UxVGV3ZUk4YWdEZ0p6UUdlSzR2VEFKeElHRURVX1ZBdVZHNEhCOWFEZFVKTTNVYVRUMTlWZ0JNQVFkZVFmREtnc2pQMzRGSXNnWUhLWDBldlptZmo0S1NwTWxUT1ZGQUVvQUhpRU5USGE5NExVQdIBggFBVV95cUxPUTMxX0tUR0JzZGg5X3JqbmtXUXFLT2tiNUxlOXFTQ2pGWjRMZ3d0OHkyanM4S0REdUY3WHpaU3B1MFNTMlVrbFQ5dGg0SW83blVWZUNUaWdZWU9qZnN0MkpvdU5qUENtZXB4S1hiQ2RWWFhXVWY1SWtUeFFabW1SWktn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Price Estimated to Reach $ 2,538.89 By Feb 11, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is up 3.17% today against the US Dollar\n\nEthereum is currently trading 6.09% below our prediction on Feb 11, 2024\n\nEthereum gained 6.35% in the last month and is up 44.19% since 1 year ago\n\nEthereum price $ 2,384.40 Ethereum prediction $ 2,538.89 (8.10%) Sentiment Bullish Fear & Greed index 64 (Greed) Key support levels $ 2,281.10, $ 2,254.32, $ 2,222.03 Key resistance levels $ 2,340.18, $ 2,372.47, $ 2,399.25\n\nETH price is expected to rise by 8.10% in the next 5 days according to our Ethereum price prediction\n\nis trading at $ 2,384.40 after gaining 3.17% in the last 24 hours. The coin outperformed the cryptocurrency market, as the total crypto market cap increased by 3.12% in the same time period. ETH performed well against BTC today and recorded a 1.83% gain against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,538.89 by Feb 11, 2024. This would represent a 8.10% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 6.35% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 25.24% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 44.19% 1-year price change. On this day last year, ETH was trading at $ 1,653.62.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,714.13, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.25. Ethereum recorded 15 green days in the last 30 days.\n\nEthereum technical analysis for today - Feb 06, 2024\n\nThe sentiment in the Ethereum markets is currently Bullish, and the Fear & Greed index is reading Greed. The most important support levels to watch are $ 2,281.10, $ 2,254.32 and $ 2,222.03, while $ 2,340.18, $ 2,372.47 and $ 2,399.25 are the key resistance levels.\n\nBullish sentiment for Ethereum\n\n25 indicators are currently signaling a bullish prediction for Ethereum, while 4 indicators are showing a bearish forecast. With 86% of indicators favoring a positive prediction. This results in an overall Bullish sentiment for Ethereum.\n\nCrypto market is currently experiencing Greed\n\nCurrently, the Fear & Greed index is at 64 (Greed), which signals that investors have a positive outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 2,372.86 (BUY) $ 2,342.19 (BUY) - - MA5 $ 2,315.28 (BUY) $ 2,342.89 (BUY) - - MA10 $ 2,275.38 (BUY) $ 2,316.66 (BUY) - - MA21 $ 2,319.52 (BUY) $ 2,241.23 (BUY) $ 3,083.51 (SELL) $ 2,068.40 (BUY) MA50 $ 2,321.73 (BUY) $ 2,087.63 (BUY) $ 2,685.39 (SELL) $ 1,923.03 (BUY) MA100 $ 2,196.73 (BUY) $ 1,955.41 (BUY) $ 1,545.55 (BUY) $ 1,888.48 (BUY) MA200 $ 1,976.76 (BUY) $ 1,861.02 (BUY) $ 2,148.26 (BUY) $ 1,666.57 (BUY)\n\nPeriod Value Action RSI (14) 46.87 NEUTRAL Stoch RSI (14) 100.00 SELL Stochastic Fast (14) 61.00 NEUTRAL Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 7.31 NEUTRAL Awesome Oscillator (5, 34) -60.55 NEUTRAL Momentum (10) 34.04 NEUTRAL MACD (12, 26) -3.45 NEUTRAL Williams Percent Range (14) -39.00 NEUTRAL Ultimate Oscillator (7, 14, 28) 47.26 NEUTRAL VWMA (10) 2,306.87 BUY Hull Moving Average (9) 2,309.05 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 2,441.28 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 46.87, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bullish. ETH would have to increase by 8.10% to hit our $ 2,538.89 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQaFdUZFpvc1pQZ0VwaXVmS0l6dUUtNk9MYldJMkMzdFRGT3F3ZDZISzhDQ0NIaTBWYmZNZjB6cG9URjNtR0ZkeVVtc2V1NGh6WW1SdVdnRzZja2VWeGNmQkdnYmFTSkV1N1ZQRThLN0JoVDVldFlpWWUyYnFlcF84cUhFUktYSXdEYTJMWWpNdlB5dVR1Q3BQVUV4T3Z5UTlwU0N4c0Z4TEZMVXBVOHNweGV6RWg5bktwT01CZEZObHZISTZWaldaWmZ4V0dYNmU0WUhLTU9MdThuSXRFZXp6aWIyVnJnSGk5NWJV0gHwAUFVX3lxTE9OZU9UWXZjQ2JPTzhJZHc5TDNfOFVndl94RVF3WlBiaTBQZVVmNFI1elduQ0k5eEdWbF9YNTZKc1NlM2lMS3I2V1VWRVRlMEFMVEdvQTg2RlJDLTlQVE5tc29VSC1uUWNUNWF0b05yYjZIYVhwTE9KZDhuclBmclU3d3o0RVdxNDBYOEc1MmtIcWZOUVRxak9DZkZYWmJ5eEhET2UtX2ZHeGRMaGRVVWZvWG0xc3lBVHluVVFuTEo3SnZibnJUNUtfb2RvdUVEbVljS2tONkM5SUM5TU5LQVBOZDZ3Y0JQZmJXYXR6MUoxSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Crypto Markets Anticipate Lunar New Year Impact: Bitcoin and Ethereum Outlook for the Year of the Dragon - The Currency Analytics",
        "content": "As East Asia prepares to celebrate the auspicious Year of the Dragon, cryptocurrency markets stand at the precipice of new opportunities and challenges. Bitcoin, the flagship cryptocurrency, remains steady around $42,000, while the CoinDesk 20 Index shows a slight decline amid the festive countdown. In the wake of the Lunar New Year, analysts and experts offer insights into what the Year of the Dragon holds for Bitcoin and Ethereum.\n\nThe Year of the Dragon, renowned for its symbol of luck and prosperity in the Chinese Zodiac, carries significant weight in the financial world. Reflecting on past predictions, CLSA, a prominent Hong Kong-based brokerage firm, foretold a year of market fluctuations in 2023, attributed to the Year of the Rabbit. However, contrary to expectations, Bitcoin surged by nearly 94% over the past year, with Ethereum experiencing a notable rise of 47%.\n\nAs nations in East Asia prepare for the Year of the Dragon, considered one of the luckiest and most prosperous in the Chinese Zodiac, the crypto market reflects a sense of anticipation. Last year’s predictions by CLSA, a Hong Kong-based brokerage firm, hinted at market fluctuations attributed to the Year of the Rabbit, advocating cautious ventures beyond comfort zones. Interestingly, the market seemed to have “hopped” back from its 2022 downturn, with Bitcoin surging nearly 94% and Ether rising by 47% over the past year, outperforming the S&P 500 fivefold, as per CoinDesk Market Index data.\n\nDaniel Wang, co-founder and CEO of Taiko, a zero-knowledge roll-up platform, expresses optimism for Ethereum’s performance in this auspicious year. In an interview with CoinDesk, Wang mentions, “The Year of the Dragon opens new doors for Ethereum, especially with the anticipated impact of ETFs. Ethereum is on track to achieve lower gas fees and faster transactions with the long-awaited Dencun upgrade.”\n\nAdding to the positive sentiment, Lucy Hu, a Senior Analyst at Metalpha, highlights the promising factors for Bitcoin’s future. “Despite the crypto market currently experiencing a sell-the-news effect, the Year of the Dragon is on track to be one of the best performing as inflation is now under control and the Bitcoin halving event takes place later this year, boosting market confidence. We hope the fiery spirit of the Dragon can lead the market to new heights never seen before.\n\nDaniel Wang, the co-founder and CEO of Taiko, a zero-knowledge roll-up platform, sees immense potential for Ethereum’s performance in 2024. Wang emphasizes the impact of ETFs and Ethereum’s forthcoming upgrades, particularly the Dencun upgrade, which promises lower gas fees and faster transactions. In an interview with CoinDesk, Wang highlights the Year of the Dragon as a harbinger of new opportunities for Ethereum.\n\nSimilarly, Lucy Hu, a Senior Analyst at Metalpha, underscores Bitcoin’s promising prospects amidst halving events and inflation control measures. Despite ongoing market fluctuations, Hu believes that the Year of the Dragon signifies a period of resurgence for cryptocurrencies, driven by improved market confidence and regulatory developments.\n\nWhile the crypto sphere anticipates bullish trends, traditional financial markets also brace for dynamic shifts. CLSA’s recent report suggests a resurgence in equity markets, particularly in the second half of the year. However, analysts caution against overlooking potential market volatility, likening the experience to riding on the back of a dragon—full of exhilarating twists and turns.\n\nAs the global financial landscape navigates the complexities of the Year of the Dragon, investors and enthusiasts alike remain vigilant. The intersection of cultural symbolism and market dynamics underscores the significance of East Asia’s Lunar New Year celebrations beyond borders. With Bitcoin and Ethereum poised for transformative developments, the fiery spirit of the dragon ignites hope for unprecedented growth and resilience in the crypto market."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTFBtWWJNajZLVERwQTZUSXFrcUJ1NVZsdktzUi1tTE14eGdjak0xeDl6TlF2U29CekdTQ3A5M3RtZHhoTmhYN05OM2FYcmNFQ1FDR1dtaHBrTkxYTHB6ZkNvMmFBY9IBaEFVX3lxTFBvY00yd0s0U3Bsc0lJNFg5N0pEU0dJdWI3cnJLaXBjY2toM2pDbkJzX1RmR3F4WEI1eTNZVi1rTDVBckVYZ3A2WGxaekdCZDdvMV82OGRPYThwcVFNWURzY0I4SDFfeEcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Mantra Network Set to Challenge Ethereum L1 Dominance — Should You Buy OM Tokens? - CoinChapter",
        "content": "MANTRA Network\n\nNOIDA (CoinChapter.com) — Blockchain project MANTRA (OM) price reached its highest level since Dec. 2021 after the DeFi platform’s proposal to make OM its native token passed with overwhelming support. In other words, OM is now challenging Ethereum, the leading layer-one project by market cap.\n\nNotably, MANTRA is a blockchain project that is built around the MANTRA DAO, a community-governed DeFi platform that offers users a range of financial services, including staking, lending, and decentralized governance.\n\nSome of the products that MANTRA offers include MANTRA Finance, for trading and earning on crypto and tokenized assets, and MANTRA Chain, for building Web3 applications\n\nMANTRA Community Approves OM As Native L1 Token\n\nAfter a recent vote, the MANTRA community made a pivotal decision regarding its native token. Opting against the introduction of a new token, AUM, the community voted in favor of the OM token becoming the native L1 token.\n\nThe call for changing the native token for the MANTRA Network resulted in widespread confusion, with existing OM holders worried that their token holdings’ value would be depleted. The community, therefore, voted to keep OM as the native token to simplify the MANTRA ecosystem.\n\nAdditionally, keeping OM as the native token would allow holders to take advantage of the hype around the MANTRA mainnet launch. A new native token, AUM, in this case, would have diminished the bullish impact of the main net launch for both tokens.\n\nMANTRA noted that the OM token proposal passed with overwhelming community support.\n\nAfter voting ended, the decision to promote the OM token as the main L1 token once the main net goes live passed with 99.95% of the votes. The adoption of OM as the native L1 token opens up new use cases for the MANTRA token, such as in governance and in utility.\n\nFurthermore, the decision would likely attract more buyers to the market, favoring the MANTRA network token. Given the strong community support, it is likely OM supporters would be pushing for a spot ETF for the MANTRA token.\n\nOM Price Dips Post Adoption News\n\nMeanwhile, OM’s price failed to react to the bullish cue. The MANTRA token dropped over 23% after reaching $0.192 on Feb. 4, OM price’s highest level since Dec. 2021.\n\nThe price dip indicates that many in the MANTRA community booked profits after voting for OM as the only native token for the DeFi platform. However, OM price has had a very bullish run since Dec. 2023, spiking nearly 714% from Dec. 4’s low near $.0236 to reach its recent high on Feb. 4.\n\nOMUSD daily price chart with RSI. Source: Tradingview.com\n\nIf the MANTRA token price continues to fall, OM would likely end up testing the support near $0.125. Moreover, breaching the immediate support might force OM price to drop to the 50-day EMA (purple wave) support near $0.085 before recovering.\n\nHowever, news of the MANTRA Network adopting OM as its native L1 token might help bulls push OM price to the resistance near $0.193. Flipping the immediate resistance might help propel the crypto token to the resistance near $0.234 before corrections pare gains.\n\nThe RSI for OM was marginally overbought, scoring 70.11 on the daily charts."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNS3dVVkl4U3pScm5uLUlGS3ltSENoWGVEeUJqVXlOTU0ybENkcHZwSGs3blRqaktFSnBkRTlaTXlvdllXZ0VHcWFMQTZVODF0Ykh4T1hzaUZkM3JOQjhyakhPR0FzTHZyaDY1WmlTcDlKb1Y2eHpWd2lrcW1pT2dlek0yMTBpOWNHcTRMREV5SnlRcF9YbDFSX1dGamnSAaIBQVVfeXFMTkx2eXVNclRNWWFoc0VONF9fclJSRG94NS1mNDRXYURwZWJBU2hHdFdQLXd4UEFfeUhRNmg1RHNJNlBXa0hmZnNqb3ROLWZXbk95aXVPOFQwc0V5WWRWMzdwQ1c1VE5OQ2tjRTFaX1FRd3l4Sm1lYUJlSThsZVFId3lCYVN5NlFQQTdTQXRVd0lTRFo2T3U1NF91WEwyckVRSmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in the Spotlight- Sell-Offs, SEC Decisions, and Technical Signals - News Welcome",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, finds itself in the middle of a myriad of critical events that are likely affecting its price and future outlook. Here is a glimpse into the recent billion-dollar sell-off, the SEC’s stance on a major ETF proposal, and a brief technical analysis for a comprehensive understanding of Ethereum’s current landscape.\n\nA Billion-Dollar Sell-Off Causing a Stir in the Ethereum Market\n\nA recent large-scale sell-off involving 459,561 ETH, valued at approximately $1.014 billion, by crypto financial services firm Celsius sent shockwaves through the Ethereum ecosystem. This massive transaction, primarily directed towards Coinbase Prime and Paxos Treasury, has raised concerns about Ethereum’s price stability and liquidity. While Celsius retains a significant ETH reserve, the market is reacting cautiously while observing how Ethereum absorbs this major outflow.\n\nSEC Holds the Cards while the Ethereum ETF Debate Continues\n\nTo add another layer of uncertainty, the SEC has hit pause on BlackRock’s proposal for a spot Ethereum ETF. This delay in the decision that was initially targeted for February indicates the SEC’s cautious approach towards crypto investment offerings. The future approval or rejection of this ETF is perceived to hold significant weight as it will likely influence investor sentiment and market movements.\n\nAnalyzing Potential Paths for ETH\n\nLooking at the technical side, Ethereum’s current indicators paint a mixed picture. The RSI (Relative Strength Index) suggests neutrality, while the stochastic %K hints at some bullish momentum. The CCI (Commodity Channel Index) leans towards a growing bullish trend, but the low ADX (Average Directional Index) indicates a lack of strong trend direction. Meanwhile, MACD and Awesome Oscillator readings are further confirming current bullish signals.\n\nSupport levels of $2295.48 and $2375.39 stand ready to cushion potential price dips, while resistance looms at $2573.47 and $2691.64. The 10-day and 200-day Simple Moving Averages (SMAs) at $2226.37 and $2358.42, respectively, suggest there may be a possible consolidation phase.\n\nPrice Predictions- Where Does Ethereum Go From Here?\n\nPredicting Ethereum’s price movements would require circumnavigating a complex interaction of technical indicators and fundamental developments. The SEC’s eventual decision on the ETF proposal and potential commissioner comments regarding the pending approval will no doubt have a significant impact on investor sentiment.\n\nFrom a technical perspective, immediate support and resistance levels will play a crucial role. A bullish scenario could see Ethereum test $2691.64, possibly reaching $2700 if the ETF receives approval. On the other hand, the recent sell-off and ETF delays might push prices toward $2375.39, with a further break likely to test $2295.48.\n\nHope vs. Caution for Ethereum- Final Thoughts\n\nOverall, Ethereum stands at a critical stage. Technical indicators present a balanced picture with hints of potential growth, particularly if the ETF receives a green light. However, the billion-dollar sell-off and regulatory uncertainty stress upon the need for caution. Investor sentiment and regulatory decisions will ultimately determine Ethereum’s path forward, keeping everyone on their toes for the time being.\n\nIt is pertinent to mention that this information is for educational purposes only and should not be considered financial advice. It is advised to conduct your own research and due diligence before making any investment decisions.\n\nhttps://www.investing.com/news/cryptocurrency-news/ethereum-eth-becomes-target-of-massive-1-billion-selloff-whos-responsible-3292047\n\nhttps://www.tradingview.com/news/cryptodaily:b6d7ba892094b:0-is-ethereum-s-stability-at-risk-after-a-gigantic-1-billion-sell-off/\n\n\n\n\n\n"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTDg5WEczVDh0aGpWMkRxYnBjQUx4NkU3Vlc5dUdvcEdUc05SUENvX3gtbENfQjBwYWNhNGpNVVRheWVmVGYzbXYtVHM1TkVHZXdCOHlNVUVncHIydkh3WVppcFJfaGFHeUtxUDhYU0plNU1JX2tqS0ticWs0LTZLMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Algotech (ALGT) Shows Early Signs of Presale Success as Investors Watch for Other Opportunities on Ethereum Classic (ETC) and Bitcoin Cash (BCH) - Coinfomania",
        "content": "Ethereum Classic (ETC) is right on the heels of the Ether token, looking to get some surge from the recent talk on ETH spot ETFs, while Bitcoin Cash (BCH) is navigating a bearish wave in a market where the BCH price could go either way. Algotech (ALGT) has shown signs of a huge entry from its $1.1 million private seed sale, and its presale is currently pushing boundaries.\n\nTLDR\n\nThe Ethereum Classic (ETC) price surge follows speculation on Ethereum spot ETFs.\n\nThe Bitcoin Cash price tries for a resistance break at $238.39 as bearish predictions loom .\n\nAlgotech (ALGT) presale is offering more than massive profits .\n\nEthereum Classic Price Shoots as ETC Token Looks to Benefit From ETH Profits\n\nNews of Bitcoin’s ETF approval dominated the crypto-verse for the past two months as the ETFs moved from speculation to reality. With Bitcoin’s trading vehicles in motion, analysts expect Ethereum spot ETFs to hit the market before the year ends. Bitcoin’s ETFs are stale news already, and the Ethereum Classic price is already pumped for an ETH price surge.\n\nEthereum Classic (ETC) dipped along with the rest of the top altcoins in January, but ETC is rising back up pretty quickly. Within the past seven days, the Ethereum Classic (ETC) value has climbed way ahead of the general crypto market, attaining bullish rankings on multiple analyses, including those from Investor Observer.\n\nA peek at the price prediction for Ethereum Classic (ETC) shows that CoinCodex gives the token a bullish $37.60 target for the next month, as its current surge has seen the Ethereum Classic price beat its $24 resistance. ETC could turn out to be one of the top altcoins to watch in 2024.\n\nBitcoin Cash Price Could Hit Bearish Waters as BCH Attempts To Break Resistance\n\nUnlike Ethereum Classic (ETC), the Bitcoin Cash price surge following the Bitcoin ETFs rally in December was short-lived. BCH is still quite bearish at the moment, as it is trying to push against the looming $238.39 resistance. While many analysts concede that BCH has room to navigate a comeback, there is little hope in a bullish Bitcoin Cash (BCH) price for now.\n\nFollowing the January dip, traders across exchanges have been shorting Bitcoin Cash (BCH), contributing to its bearish conditions. However, a crypto intelligence tracker, Santiment, states that a mass liquidation following the shorting of the coin might lead to a surge in Bitcoin Cash price.\n\nWith Investor Observer ranking Bitcoin Cash (BCH) as a low-volatility token, there will be little price manipulation in the near future. BCH might also be a top crypto to invest in for the future since Bitcoin’s halving might have bullish effects on Bitcoin Cash price, too.\n\nAlgotech (ALGT) Presale Is Rocking the Crypto-verse!\n\nMost presales have come and gone with little impressions and even less to gain from them. Algotech (ALGT) is set to go on record as one of the best new ICOs in the cryptocurrency market, and you just have to be there for the show. 275% profits and an amazing giveaway— Algotech (ALGT) is almost too good to be true!\n\nBut what is Algotech (ALGT) about? The token is big on research and development, focusing on algorithms that will aid financial trading for both pro and beginner traders. With Algotech (ALGT), gone are the days where you sit for hours to analyze the market, only to have a risk management tactic go wrong. Algotech (ALGT)’s algorithms are specifically designed to remove the possible human errors that come with manual trading, replacing them with a quick, efficient, and reliable set of tools that give traders value for their time and efforts.\n\nWith advanced risk management strategies, you will be trading smart when you use Algotech (ALGT) algorithms. The presale is here for non-trading folks to benefit from Algotech (ALGT) by being pioneer members of the community. Get your ALGT tokens today for $0.04 and sit back for up to 275% profits by launch day.\n\nYou also automatically enter the draw for Apple devices and VIP tickets to the Blockchain Life event in Dubai when you invest over $1 in Algotech’s (ALGT) presale.\n\nHop on the Algotech (ALGT) project today and start your 2024 crypto journey the best way!\n\nVisit Algotech Presale\n\nJoin The Algotech Community\n\nDisclaimer: This is Sponsored Content. Coinfomania does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their research before taking any actions related to the company stated in the release."
    }
]