[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNcmlTbW42TGRHc1FaZzVrTEszRENnNHRVYmtvUXhUQWNsS2tKd2wyNzFTRlNJd3M0U0JjSGtTelVfb2p1WFBOdVZDUTJIUnhOTDR0MDRfLVJTa2VKdjJVUEQxalI5VHQ1aHJPY09CY2JkMTNEdVBTLUpMQmxHSUtTUk1FWWZPd29vYkJETXhfOFlDTFAxSXVV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s decentralized mantra in tatters after execution of client bug - CoinGeek",
        "content": "Homepage > News > Tech > Ethereum’s decentralized mantra in tatters after execution of client bug\n\nGetting your Trinity Audio player ready...\n\nEthereum’s claims of decentralization are ringing ever more hollow due to the network’s lack of client software diversity, an overreliance that could pose an existential threat to ETH stakers.\n\nLast weekend, around 8% of Ethereum proof-of-stake (PoS) transaction validators suddenly began producing invalid blocks due to a critical flaw in the Nethermind client software. The issue followed the release of Netherland’s v1.23.0 update, requiring a frantic patch to get these network nodes back in business.\n\nWhile the order was eventually restored, a similar scenario befell the Besu client earlier this month. Besu’s share of the Ethereum execution client market was around 5% at the time and has since fallen to 4%.\n\nEthereum watchers soon warned that the fallout could be catastrophic if/when a similar situation impacted the Geth (Go Ethereum) client. Geth accounted for around 84% of network execution clients at the time of the Nethermind bug, but a concerted effort to sound the ‘eggs in one basket’ alarm has since pushed this down to a mere 79%.\n\nGeth is client software developed by the Ethereum Foundation that supports network functions like transaction validation and smart contract execution. Geth is generally considered a more robust option than its rivals, which, along with the Foundation’s stamp of approval, is why it accounts for such an outsized market share.\n\nRegardless, such a high concentration level would be problematic in any sector. But in an industry so prone to probing by malicious actors—particularly those adept at software supply chain attacks—it’s a recipe for disaster.\n\nA Geth failure would bring Ethereum finalization to a screeching halt, but as Labrys developer Lachlan Feeney recently suggested, this vulnerability could also result in the loss of the majority of the roughly 29 million ETH currently staked by validators.\n\nBecause validators are penalized for being offline, an ‘inactivity leak’ could rob validators of two months’ worth of staking rewards in just two days. Should the downtime extend for five days, a year’s worth of rewards would be lost. A weeklong outage could cost validators 10% of their staked ETH, while 90% of that stake could be lost if the outage extends to six weeks. While such a prolonged outage may be unlikely, it’s also not impossible.\n\nGeth-based validators would likely stampede for the exits rather than watch their stake bleed away to nothing. But they’d get caught in a logjam of similarly minded validators, all of whom would continue bleeding ETH as they wait their turn to disembark this sinking ship. Given the sheer number of Geth-based validators, this bottleneck could mean that only one in 12 could exit with more than 50% of their stake.\n\nFork me\n\nThe potential repercussions of a serious Geth bug don’t stop there. Should a Geth-based validator produce an invalid block, Geth’s domination of the network could result in this invalid block being added to the chain, resulting in a fork that would quickly become the dominant chain. Geth validators would be blocked from the valid chain until the smaller chain is finalized.\n\nAs Feeney put it, “Because the Geth validators are stuck on the invalid chain, they are considered inactive on the non-Geth chain and will suffer the inactivity leak. No software update or bug patch to Geth will save these validators. They will be bled out until their stake represents <⅓ of the network, allowing the non-Geth chain to finalize.”\n\nFeeney estimates that this bleeding could result in an 18% reduction in the total supply of ETH. (That’s definitely one method of creating artificial scarcity and thus losing the token’s fiat value.)\n\nFeeney offered this warning: “Staked ETH is not risk-free yield. Would you invest a minimum of $75,000 USD [the rough value of the 32 ETH required for serving as a validator] into an instrument where the maximum potential gain is 3.5% p.a. but the potential for loss is 100% (even if that loss is unlikely)? Probably not, but this is what 84% of the Ethereum stakers are doing today.”\n\nLido shuffle\n\nRetail users lacking the 32 ETH necessary to stake on their own have several options for pooling their resources, but staking via a service won’t necessarily protect them from the potential carnage described above.\n\nLido Finance, the largest staking service with around 9.4 million ETH staked, relies on Geth for most of its operations. On January 23, Lido stated that its preliminary Q4/23 data put Geth usage across Lido protocol validators at 67%, down from 76% in Q3/23 and 93% in Q3/22. Lido said “client diversity is fundamental” to its “mission to decentralize Ethereum.”\n\nLido added that its Lido DAO (decentralized autonomous organization) node operators “are afforded high degrees of autonomy,” but they “have already begun to signal their commitments to reduce majority client usage, or explain how their setups avoid the possibility of being affected by supermajority bugs.”\n\nCoinbase has a plan to make a plan\n\nThe Coinbase (NASDAQ: COIN) exchange has faced similar queries this week about its reliance on Geth. On January 22, CEO Brian Armstrong personally responded to a Coinbase customer who tweeted that they had “unstaked all of the ETH I had staked with you since you offered it as a service.” The user added that this “single client staking setup” made it “not worth the risk” of losing “a large percentage of my deposit.” Armstrong replied: “Taking a look.”\n\nLater that day, the Coinbase Cloud account tweeted that when it launched its ETH staking service, “Geth was the only client that met our technical requirements.” Coinbase claimed that “execution client diversity … is a critical concern,” and thus, it was conducting “an updated technical assessment with the goal of adding another execution client to our infrastructure.” Coinbase promised to provide an update on its progress “by the end of February.”\n\nNot everyone found this reassuring, with at least one customer suggesting that the situation wasn’t “a review and plan kind of phase. This is take serious and urgent action, with informed customers phase.” Coinbase was urged to set up “an insurance fund or allow us to opt in to other clients” because “the risk of supermajority failure is a *bigger* risk to your customers than minority client failure.”\n\nThis probably wasn’t the best week for Coinbase to run a sponsored post on Decrypt promoting the claim that its staking service “aims to be a ‘one-stop shop’ for crypto staking.” One stop, one point of failure… Synergy!\n\nCoinbase rival exchanges Binance, Kraken, and Bitfinex (among others) also rely solely on Geth to power their staking services. However, they have kept quiet regarding any plans they may have to inject a little diversity into their operations.\n\nAll in one\n\nDecentralization theater has been Ethereum’s stock-in-trade from its inception, starting with the Ethereum Foundation’s oversight-bereft crowd sale that delivered the majority of ETH into the hands of a few whales. This concentration of wealth and power continues to this day via the PoS consensus mechanism that further enriches the whales who can afford to run multiple validators.\n\nThis centralization was recently cited by the U.S. Securities and Exchange Commission (SEC) as part of the reason it was delaying decisions on applications to offer Ethereum spot-based exchange-traded funds (ETF). BlackRock, Grayscale Investments, and Fidelity are among those chomping at the bit to offer Ethereum ETFs to the public following the launch of multiple BTC spot-based ETFs earlier this month.\n\nIn approving those BTC ETFs, SEC chairman Gary Gensler stressed that the decision was limited to “one non-security commodity” (BTC) and “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.” Gensler, who has previously stated his belief that ETH is an unregistered security, reiterated his ‘don’t expect ETH ETF approvals anytime soon’ message earlier this week.\n\nOn Thursday, the SEC posted a list of ETH-related questions for public comment before making any ETF decision. For instance, the SEC wonders if there are “particular features related to ETH and its ecosystem, including its proof of stake consensus mechanism and concentration of control or influence by a few individuals or entities, that raise unique concerns about ETH’s susceptibility to fraud and manipulation?”\n\nInterested parties are instructed to submit their comments within three weeks. Just remember Ethereum Foundation members, you have to at least try to make it look like they’re not all coming from the same address.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of groups—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple, Ethereum,\n\nFTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNVHBCVS1lZktCa3lpbXpXTUY1cVpIbkc2LVlmUHN3NzZXN0d6U2MtdlBDU1ctcC1zQk15ekdVcVpqUlJ1eVhsakRuTVpjLU1BMFpRUE5TWEpjbmg3aFJYR3I2LUxGOTVGalFFamlCUUxpV0p3c0tpREhzR3N3YnBZcWo2a3ZoclJIZXFDTmRQVzBzMTNjYkVDdNIBoAFBVV95cUxPR0QxVUhrTlQwYW5fUzR4ckUwS3FrTnd4UlFqQnJfclFjRnNWVHlhTVo1UDlpM28wdzZTUUUxNVpSQTc3WGZERDZORkhMVlVwbzdRMVFiN2k3RFhBb1N3Q2JjZzIySzg0b1g1SGRSUFBWdF9uUUxLOVBDU3JlVDlJdEpHYnN3NXhGTXJXMEZtSjBydkIxMGE3Q0dxLXI3dnRW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, Solana Losses Pile Up as Bitcoin Sell-Off Sinks Crypto Market - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) and the wider crypto market are down bad this week. But some of the biggest losers near the top of the market were once recently stars of the show, including Ethereum (ETH), Solana (SOL), and Avalanche (AVAX).\n\nIn recent weeks, all three of those top 20 cryptocurrencies were making big gains as they attracted institutional investor interest. Now, each has slipped by at least 14% over the past seven days, and have posted sizable losses on the day.\n\nEthereum is down sharply this morning, per data from CoinGecko, falling 7% over the past 24 hours to a current price of about $2,200 and pushing its seven-day dip to 14%.\n\nSolana is down almost 16% over the past seven days at a current price of $82.50. It has rebounded slightly from earlier this morning, but remains down about 5% on the day.\n\nAD\n\nAD\n\nMeanwhile AVAX, which is the 11th largest cryptocurrency, has plunged 19% on the week to a current price of just under $29. Like Solana, it has shored up some of its losses since this morning, now down about 5% over the past 24 hours.\n\nIt was just over a week ago that Ethereum came just shy of hitting $2,700, its highest price since April 2022. Excitement over Ethereum grew amid the launch of spot Bitcoin ETFs as investors considered the next wave of prospective institutional adoption, particularly as BlackRock CEO Larry Fink talked up the prospect of an Ethereum spot ETF.\n\nSOL had been on a big run starting from the end of October. It was expected to take a hit during the trial of disgraced crypto mogul Sam Bankman-Fried, who was heavily invested in the asset via his now collapsed crypto empire, FTX.\n\nBut major companies such as Visa and Shopify sung the project's praises and said they'd use its blockchain. A growing developer base also meant the price of SOL shot up. It rose as high as $123 in December 2023, nearing a two-year high after plunging to a price of about $8 in December 2022.\n\nAD\n\nAD\n\nAVAX also attracted interest when investment banking giant J.P. Morgan said in November it had used the Avalanche blockchain to tokenize portfolios.\n\nLong-term holders have reason to be optimistic, though—despite the recent dips in price, both coins over a one-year period are doing well: SOL is up 239%, while AVAX has jumped by 64%. Even Ethereum is up by 35% over the last year.\n\nThe broader crypto market has taken a nosedive as it follows the price action of the biggest digital asset by market cap, Bitcoin.\n\nSince crypto fund Grayscale converted its flagship BTC fund into an exchange-traded fund (ETF) and started trading on the stock market, investors have been keen to redeem shares previously locked into the product.\n\nThis has put pressure on the price of the biggest and oldest digital coin in recent days.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQOXp2TC1maHNaMDZQd0h6TzlWeXpnZnJVSkR5ekxiRURwMmZWbktIZkpDdG5iRUtvbm9pekhqVWFyQWR2cEh2UlUyeFJ0TWUyc2lGWVNHWWh6TS1pVTJzQ1VpY3d4eFc2YU4wbS1VR0ItejZfUDlIcEx5LURnMU9NQWd6bXpKSmhwcWJpTWswS3o1aDd1QVhIS1pZZFkwT0R6czFKbVd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Attempts to Recover - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE56eTFLazFlb3lzemtwb3NXWmhPWHN3TGtPdGpNeUFpOEU5NTUtcjRyTXAtOHlFQ2g5cmRVWWtsSm53cHluS2JFMmQ0MFZKdWFDNWNLbU9jRnk3WjYwX2RKMkVNZ1MxZHR2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Polymer Labs secures $23M to bring IBC to Ethereum - Blockworks",
        "content": "Polymer Labs, a modular IBC-based networking protocol, has secured a $23 million Series A co-led by Blockchain Capital, Maven 11 and Distributed Global.\n\nOther investors, including Coinbase Ventures, Placeholder, Digital Currency Group, North Island Ventures and Figment Capital also participated in the round.\n\nPolymer can be described as a modular layer-2 network that employs Cosmos SDK’s IBC protocol, OP stack’s settlement functionality and Eigenlayer’s data availability layer. It is the brainchild of Bo Du and Peter Kim.\n\nAfter being in the blockchain industry for a few years, the Polymer founders experienced firsthand how difficult it was to build interchain products. In the summer of 2021, they made a decision to drop their side projects and focus on fixing blockchain interoperability.\n\nRead more: The Interchain Foundation puts aside $26.4M to grow Cosmos ecosystem\n\nInitially, the team wanted to design their own interoperability protocol — similar to that of many general message-passing protocols that exist today. However, during their research, they came across the Cosmos SDK’s Inter-Blockchain Communication protocol, Du told Blockworks.\n\nIBC is an inter-blockchain communication protocol, as its name suggests. It allows different blockchains in the Cosmos ecosystem to communicate with each other. The protocol is designed to ensure that information can be securely transferred between separate operating chains.\n\nRead More: DeFi users ‘don’t care’ what chain apps are on\n\n“IBC already had years put into its design and architecture, so we decided to stick with IBC and not invent a whole new standard,” Du said.\n\nKim added that at the time, IBC was the most decentralized, elegant solution to establish connections and pass messages between chains.\n\n“​​We realized this was something that could be expanded to other chains; basically export the technology to have industry penetration rather than just the Cosmos app chains,” Kim said.\n\nSo how does it work?\n\nThe team wanted to find ways to make the already established interoperability protocol on Cosmos a mainstream standard in the Ethereum ecosystem.\n\n“It’s not easy to integrate IBC natively into all these different chains, which is why we designed the virtual IBC protocol, which essentially allows chains that don’t natively implement IBC to access IBC execution through Polymer and have Polymer execute IBC on its behalf,” Du said.\n\nMany blockchain interoperability protocols today are focused on the state component of interoperability, which involves aligning the status of the data stored within separate systems, but Du believes this is just one part of the interoperability problem.\n\nRead more: Interoperability isn’t just a buzzword\n\nBeyond the state layer, two other layers need to be considered. This includes the application layer — that is, the layer responsible for encoding and decoding sent data and the transportation layer (TAO) — which manages the routing of raw data.\n\n“All of IBC’s core logic will live on the transportation layer; this becomes decoupled from the application layer, and Polymer will hold the IBC state on behalf of the connected chain,” Du said.\n\nThis means that at the end of the day, the application — which lives on Ethereum — will be able to interact with the IBC network through Polymer smart contracts.\n\n“Polymer will then take the apps intended actions and execute the associated IBC logic and produce a commitment to the IBC state of that chain on Polymer — so essentially, Polymer is maintaining this merkle-ized IBC state on behalf of the connected chain,” he said.\n\nRead more: 2023’s top 5 DeFi protocols by revenue\n\nSimilar work to decouple state, application and transport layers is being explored by the interoperability protocol LayerZero.\n\nIBC has been around for a long period of time. Du notes that its specs cover various considerations ranging from authentication, timeouts and acknowledgment, somethings its competitors may not have.\n\nThis means that applications will not have to individually implement these different changes when there are protocol upgrades.\n\n“If you want to design a protocol that is going to last for generations of builders, you need to be able to handle these different edge cases properly,” Du said. “This is a foundational level protocol.”\n\nInvestors in Polymer Labs, Yuan Han Li and Joshua Rivera from Blockchain Capital, shared this sentiment.\n\nThey note in a press release reviewed by Blockworks that “while numerous arbitrary messaging protocols have emerged to address the cross-chain interoperability, they have all done so by building a new messaging standard, paradoxically causing more fragmentation when a standardized and battle tested way to move data between heterogeneous blockchains already exists.”\n\nUltimately, the Polymer team is hoping to ensure that IBC becomes a widely adopted interoperability standard that will shape how blockchain applications of the future will communicate. This latest funding round will bring the team closer to launching mainnet.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbHY0eDdJYXJ4b3I0M3Y5VVVpRzNIUGE1QWxzaTUtSDlVSzlPY0RoSThFaXAtekMxNElxdEREemhlMTlWVl9QbVktU1F5c1dnS3dFeWxtbVRFTFdMREJ6czZzeDUwNEowNVB0UHp5YzZkUW1INGpCcS1tZzdpVGNHcHBGVGNMWEtyMy1vVjJuZGhOWnU3NW9jdTJHQ1hsVnhsSWZ4QllCTDRhcHNTQzVHSzRERnJMR3VLWmZsMFJxTktZZXYzbHBDWWVuT2V2MEZq0gHWAUFVX3lxTE9Wajl0cmxXWlRLdDRtcHhTRThPYjNzYm5rb1dyUG15SDV3M1lKcDM1T01KNWNhTFVsZk5FTjd4b3BnSlBCemNobEx1b1NHY3JkQ3dVUkhNNzZKTUtZS3NGd3ZwaTBoczFzWUctYVM3RUMteXdyRlNrRFE0ci1nYVNkc1NwakVJanBNSE9OSnFzdURLajhRaGUyTTF2VVFhR1JqS1NqT3VfdmxlZmYyejZxYVlnb2RDM2dSeWlxeTRFSVFJbkc2Q0NwbWNGOXQwbmFQX2N3TUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Now Closer Than Ever To Ethereum Compatibility As Second Audit Nears Completion: Developers - The Daily Hodl",
        "content": "The XRP Ledger (XRPL) is almost ready for the launch of its much anticipated Ethereum Virtual Machine (EVM) compatible sidechain, according to developers working on the project.\n\nThe project aims to allow Ethereum (ETH) developers, who are used to Solidity, the main programming language for writing smart contracts on Ethereum, to access and build on the XRPL network.\n\nDevelopment firm Peersyst Technologies says on the social media platform X that the new sidechain is waiting for a few components to come together, such as its XChainBridge which is currently being voted on by validators.\n\nThe bridge aims to allow users to automatically bridge any token from the sidechain onto the XRPL.\n\nPeersyst also says that the sidechain, which is “more advanced than ever” and has already been audited by security firm Bishop Fox, is going through a second audit with “a recognized supplier” that will be published soon.\n\nThe firm also says that a new version of blockchain explorer Blockscout is being built for the sidechain.\n\nAccording to Ripple, some highlights of the EVM sidechain include:\n\nSupport for 1000 transactions per second, enabling large loads and throughput.\n\nLow transaction confirmation times, producing a block every 5 seconds.\n\n1 block finalization time; once a block is added to the chain and confirmed, it’s considered final.\n\nFull Ethereum Virtual Machine (EVM) compatibility, enabling you to connect your wallet and interact with or deploy smart contracts written in Solidity.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalya Yudina/INelson"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQSS1qVG5ndWtSek1RNEJJT053WUpVeTdUWHVqanhCN0VFMm1wM0d6QnhfWHpydE1zUVl4c1dORzlrbUFLY0NIMmd4bjdCcTVjOXRPNFVsekI5VG10MzRiN0ZiNnBOZ1dVWG5TVmpSS0pYVTdhSlU1NnlQUkluWnYxQ0JfNTYxa0p0a2lKQjdEekM5Rkh2UThtMXVCckdWV095MFVvRFczRWEzdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Plunges During Tuesday - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPTE56Rnp0bUdmbHplZ1pjbjFlWXI3dkh6YXRCd3hSZ3NuWmdhX2RQYnVaWGFZRmdpZ250V1NWQ01CRkhVV194SmhUYnlMLUdrQWM1S0dnT0xvZWsyVjNTcXBQVWVtZ2FCaENwVkxRZ2NrSV9FQmFOQkZsVzNYeFhxdUVYRdIBiwFBVV95cUxPdE9Sckd1bWhkLXN4SVFqXzNQVHdRVDBTRlRzQTlGTzlVaFhkcXVxVkZETTlleERuWmg4TFkxajc3cXBvMHNaYVZmakJsMFppMTQycmt3aUVmazJRcWRiUjVNM0ZIWGkxM3BsUVhROXVDbW9mNGRvWnAwa1EyZ2RMcDVRd3I1UEpHcEY4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump’s Ethereum Wallet Holds $1.1M in MAGA Meme Coin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYou never know when a huge pile of meme coins can turn into serious cash. Early Dogecoin (DOGE) investors know this well, as do Solana developers who received an airdrop of BONK. And the latest beneficiary of a meme coin glow-up is… former U.S. president Donald Trump?\n\nAn Ethereum wallet that blockchain analytics firm Arkham Intelligence previously tied to Trump, which holds a share of royalties from sales of the official Trump NFT collections, also holds over 579,000 MAGA (TRUMP) tokens. And a recent surge in price for the meme coins means that Trump’s holdings are valued at about $1.1 million as of this writing, as first reported by CoinDesk.\n\nThe TRUMP token has jumped 222% this week alone, per data from CoinGecko, and 689% over the past 14 days. Meme coins are famously volatile and can be driven by social media sentiment and real-world events, and Trump has racked up a pair of 2024 presidential primary wins in recent days as he attempts to win a second term in office.\n\nTrump’s wallet isn’t associated with the creation of the TRUMP token, and in many cases, meme coins inspired by celebrities and public figures aren’t created by the person in question. Instead, they’re often created anonymously in an effort to ride the wave of hype and FOMO.\n\nAD\n\nAD\n\nIn this case, Trump’s wallet was sent the sizable allotment of TRUMP tokens across multiple transactions in August and October 2023, per public blockchain data tracked by Etherscan. At the time of the largest transfer, on August 19, the 469,901 tokens received on that date were collectively worth approximately $5,670, per data from DexScreener.\n\nNow his stash of TRUMP tokens is valued at $1.1 million, making up the largest single holding in the Trump-affiliated wallet. Overall, it holds nearly $2.6 million worth of cryptocurrency as of this writing, including about $755,000 worth of Ethereum (ETH) and $731,000 worth of Wrapped Ethereum (WETH).\n\nIn December, the wallet dumped $2.4 million worth of ETH across a period of three weeks, following the launch of his third collection of NFTs minted on Ethereum scaling network Polygon. Only about half of the latest NFT collection has been minted so far, after the two previous collections both sold out.\n\nThe wallet was tied to Trump by Arkham last year following a financial disclosure notice from the former president, as the wallet receives royalties from the sale of his officially licensed NFTs.\n\nAD\n\nAD"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOdVZFQ1NRaGFnSGxUenZWOGZfVWJ0UE5BQTZwdGx1STBNTGw4d24xS2xkOVZ2clBORWNOeWl5eVFGbkU1eUFhRVR5VG43Wklac05WeEUtNmNWNGFlOVNybjkzOEF2d01TUmJEeFFfQ0gtZEJtbWQ3azNNWVREcjViWER6ckdRT0RIanBoTnQtRGRHUFRjWXRvWTJHT3NuMnlIdmpuY0VBOXo1UGxOSXhvOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC has a ‘hard no’ stance on spot Ethereum ETFs, but issuers are optimistic: FOX reporter - CryptoSlate",
        "content": "FOX Business reporter Eleanor Terrett reported a wide range of expectations regarding spot Ethereum ETF approvals on Jan. 23.\n\nNotably, Terrett suggested that the U.S. Securities and Exchange Commission (SEC) is opposed to approving a spot Ethereum ETF. She said:\n\n“Another source tells me the line at the SEC at this very moment is a ‘hard no’ and there’s currently ‘some internal resistance’ to the idea.”\n\nTerrett did not state whether that source is a member of the SEC itself or a member of an asset manager seeking approval from the SEC.\n\nTerrett also noted that SEC commissioner Hester Peirce, known for her pro-cryptocurrency stances, has advocated for a more straightforward decision process. The SEC in part approved spot Bitcoin ETFs because one applicant, Grayscale, obtained a legal victory, as SEC chair Gary Gensler explained in a statement. Peirce criticized that approach in an interview with crypto news platform Coinage today, as she said that ETF approvals should involve “regular way consideration” rather than court cases compelling action.\n\nTerrett concluded that further indications of the SEC’s stance will emerge in the coming months as it becomes clear whether it engages with S-1 registration statements. The SEC typically posts notices of meetings with asset managers and exchanges on each ETF’s page as they occur.\n\nAsset managers appear to be optimistic\n\nDespite resistance within the SEC, Terrett suggested that the asset managers responsible for issuing each fund are optimistic about approval.\n\nAccording to Terrett:\n\n“[One] issuer with an ETH Spot ETF application says they’re confident the approval and smooth launch of the Bitcoin spots will compel the [SEC] to approve ETH spot ETFs.”\n\nAnother unnamed issuer said that they expect a spot Ethereum ETF to launch by the end of the summer because of the SEC’s earlier approval of Ethereum futures ETFs, and because of BlackRock’s strong ETF approval record.\n\nThat source also cited the CFTC comments suggesting Ethereum is a commodity, as well as Ripple’s partial legal victory against the SEC, as factors that could more broadly prevent the SEC from labeling crypto assets as securities. However, it is not clear that those developments will directly impact spot Ethereum ETF approvals in the coming months.\n\nPublic expectations around approval vary. Bloomberg ETF analyst Eric Balchunas posits a 70% chance that an spot Ethereum ETF will be approved in May, while JP Morgan executive Nikolaos Panigirtzoglou has predicted a 50% chance of approval. Polymarket odds suggest a 53% chance of approval.\n\nMentioned in this article"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQbDRlTUk0SENRWEFvMXJQTE56VXRKUzdQZmJNTGpHZ1djdm9VMnhla1JRNmpUZ1JDZER1QTZRb0pkNThqS2JENUJBTWtpY1FYLVpLRjBVWjliQ0VPSDh3b3NuNU1JTkI5VHlkNUNqaXVUV0lrYlZJTXMwZ0tPdTFDVWxvRXpUODBULUlLN2RkTUlPLWx6azdyNEJZUjM5ckdtenB0WWhqaV9IdkllR2xFTzg3eWJzeUtHTmtRVnhkbFlwMUFfN2lzUjQ5VVc0TURhRC16T2pBS1k1aG1QanNsMlZ30gHnAUFVX3lxTFBvMWJwWnRXX1d0cFRwUnRWMWdUVUVwT3RaTFhVbG8zcnUyMUgyOWFod3hRd3hnQlBKSHZKOEwwamJIOEFIRlRyT25DS0NzS0FnYXB2aDd5RS0xS2o4eFJWU1Z0MVlOXzE5UmE4UjlyMTRzdzRaNFQ2VDBRQkNZRjlpd29mRnZfdTZhWDgwQ3N4UE1vV0wwSjMtVGRRUnFIWURtM3FITGF4S2NieHlYR3FnUG9xNlVnOVJ0SnMtb1piZ19vT1N4Wkd1bVJqV2pvbnlWZWZxbVRWQ0ZqT2dVbEVXZ0IybThpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin - The Daily Hodl",
        "content": "A widely followed crypto strategist says that Ethereum (ETH) is giving off a bullish reversal signal when paired against Bitcoin (ETH/BTC).\n\nTrader Michaël van de Poppe tells his 685,700 followers on the social media platform X that he thinks Ethereum will outperform Bitcoin in the coming weeks.\n\nAccording to the analyst, ETH/BTC is flashing a bullish divergence on the weekly chart, indicating that the pair may be gearing up for a move to the upside.\n\n“I personally believe that Ethereum is going to outperform Bitcoin in the upcoming period and it has started since the ETF (exchange-traded fund) approval.\n\nMassive weekly bullish divergence created, but facing crucial resistance at 0.06 BTC ($2,385).\n\nSome more consolidation and then we’re likely going up.”\n\nLooking at the trader’s chart, he seems to think that ETH/BTC will rally to as high as 0.13 BTC ($5,168) sometime this year.\n\nAt time of writing, ETH/BTC is worth 0.05596 BTC ($2,224).\n\nAs for Bitcoin itself, Van de Poppe thinks BTC may fall to around $38,000 before finding support.\n\n“Bitcoin is at the range low and is actually in the area to be accumulated.\n\nAdditionally, this also means that altcoins are in stages to be bought as those 20-40% dips are a great opportunity.”\n\nAt time of writing, Bitcoin is trading for $39,800.\n\nVan de Poppe is also keeping a close watch on the price action of blockchain data-aggregator Covalent (CQT). According to Van de Poppe, CQT is likely headed to its next support level at around $0.15 before igniting a strong surge.\n\n“One of the latest runners has been TIA (Celestia), but competitors are likely to pace up momentum too.\n\nCQT is one of them. Market capitalization is relatively low and correcting, just like the entire market.\n\nThis provides opportunities and I think CQT is one before it reaches $0.42.”\n\nAt time of writing, CQT is trading for $0.214.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/PeachShutterStock/Spyro the Dragon"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPX2dGYXpOQlI1dmJUbzJta25RZXdIMExsb2t1X2UxdkF4TWFRXzd3dm9aUTczQm1PYlZ0ZDd4UDI0ZWlqNS1FLTUxOTRvejJlX2JOMG13QnBIbjNSelJyOUg1ZklwS2dLQ1FpRUx0S2FTOFpNaVlYemdBNDVVckpMS0ZrLWxPT19mdEtOSzJlTnZ5WlNTTE1iN1hERFBvYVZa?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s record number of hodlers downgrades Bitcoin to second place - Baltic Times",
        "content": "Comparisons between Bitcoin and Ethereum have made the topic of many crypto debates, leading to many different conclusions. Bitcoin is the holder of many notable records and achievements, including being the first decentralized cryptocurrency established by Satoshi Nakamoto in 2009, the most valuable digital asset and the one that occupies the largest share in the cryptocurrency market. As a result, Ethereum, which was founded in 2015 by Vitalik Buterin, has always lived in Bitcoin’s shadow, alongside all the other digital currencies that emerged in its wake, forming the altcoin pack.\n\nHistorical cryptocurrency data reveals that the two assets have moved in tandem, with the flagship crypto dictating the price trajectory. Judging by the difference between the current Ethereum price and the Bitcoin price, the latter wins by a landslide. Ethereum always seems to be several steps behind Bitcoin, unable to pose a real threat to its dominance and yank it off its throne.\n\nHowever, if we delve a bit deeper, we can see that the altcoin leader also showcases a series of strong suits and key metrics that place it at the top of the cryptocurrency hierarchy, in front of its longtime rival, and hodler count is one of the areas where Ethereum excels.\n\nEthereum hits record number of hodlers in 2023\n\n2023 has been a good year for Ethereum for several reasons. The second-ranked crypto has been on an appreciation journey for the better part of the year, with a 20% gain in the last month and a 38% gain over the past 60 days. Apart from the considerable price increase, Ethereum has also seen a significant surge in hodler numbers.\n\nHodler is a popular crypto slang term that designates long-term holders of a cryptocurrency. These investors buy and hold onto assets regardless of price volatility, trusting their long-term value and their ability to weather market fluctuations.\n\nAccording to IntoTheBlock data, addresses that have held Ether for more than 12 months currently make up 72% of all Ethereum holders, reaching the highest level since 2018. At the moment, Ethereum counts approximately 73.9 million long-term holders, after a 44.2% increase, while Bitcoin’s holder figures stand at 33.6 million.\n\nHodlers play an important role in the health and performance of digital assets. Coins backed by a large number of holders tend to be less susceptible to market volatility and are generally perceived as more resilient and trustworthy. So, the fact that Ethereum’s holder community is growing is certainly a positive development for the network.\n\nIn addition, Ethereum also outclasses Bitcoin in terms of whales, which refers to persons or entities that own a large amount of a single cryptocurrency, between 1000 and 10,000 coins. By the latest count, the number of Ethereum whale addresses has recently reached 5,370, marking a 12% yearly increase, while Bitcoin whale wallets amount to 1,920.\n\nThis proves that Bitcoin is not the only coin boasting record-breaking performances in the cryptocurrency ecosystem. Ethereum outshines the original crypto in many ways, so even though there’s still a huge price discrepancy between the two, the top altcoin continues to attract an increasing number of investors.\n\nWhat prompted Ethereum’s holder increase?\n\nNot too long ago, Bitcoin used to hold supremacy in hodler numbers as well. What’s more, both Bitcoin and Ethereum have had impressive runs this year and recorded increases in their hodler metrics. So, what exactly caused the tables to turn and lead to such a notable disparity between the two assets?\n\nEthereum’s surge in long-term holders can be attributed to a series of factors. One of the most likely causes for the increase is the rise in Ethereum staking registered this year. The amount of staked Ether has nearly doubled since the beginning of 2023, with roughly 24% of all Ethereum’s circulating supply being locked in staking deposits. Since most staked funds remained untouched for more than 12 months, this led to a major rise in the Holder Ratio.\n\nHowever, there are other factors that have contributed to the phenomenon which have to do with the purpose and the evolution of the two crypto projects. On one hand, Bitcoin has continued to operate as a deflationary store of value and a peer-to-peer form of digital money, so it hasn’t strayed away from its original purpose and use cases.\n\nOn the other hand, Ethereum has undergone massive transformations since its launch back in 2013. Designed by Vitalik Buterin as a programable blockchain, Ethereum started its journey as a platform that enables the deployment of decentralized apps (dApps). However, over the years and after multiple upgrades and updates, the Ethereum ecosystem expanded considerably, with applications and use cases spanning across many other areas, including gaming, decentralized finance (DeFi), and non-fungible tokens (NFTs).\n\nBitcoin is clearly more established and mainstream than Ethereum, having a longer track record in the market and being superior in terms of price performance and scalability. Ethereum is in a weaker position from this point of view, but price action is not the only aspect that attracts investors and drives crypto adoption.\n\nThe fact that Ethereum boasts a diversity of use cases and represents a hub for innovation in the crypto sphere has caught the eye of stakeholders and that has led to an increase in hodler numbers.\n\nThe Ethereum network also seems to respond better to the changing needs and demands of market participants. The Merge and Shapella upgrades, which saw Ethereum switch from a proof-of-work (PoW) consensus protocol to a proof-of-stake (PoS) mechanism, stand as proof of Ethereum’s adaptability, flexibility and its constant focus on innovation. These attributes have turned it into a decentralized blockchain powerhouse and continue to draw in more investors and holders.\n\nFinal thoughts\n\nEthereum’s record number of long-term holders might not be enough to steal the leader position from Bitcoin, so it’s rather premature to make assumptions about a potential flippening in the near future. However, changes in this key metric serve as an indicator of Ethereum’s strength and potential and are worth taking into account by crypto enthusiasts."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNeW4tREZubjBNdzVKOWxIWkgtaVB2TXNuc2tjZXB2SVI2a3JCREJWU0JqS1FRTk1VSDZnaUk2WUhjLTB5QkxjQXF1anBSWkVEV2ZNU1JKUVljeFlvN2FXdHpvUkNZYUF5R29DRWltM0FaNmtRRVcwVll4bzYySUtsby1vNjJ5OGstU3ZqVGFac0duVGtoQy0tRjViYkhGc3JDeGpha21NRHl6clhLRjY5MDNsdnnSAboBQVVfeXFMTzJyRlcyRHJZTEdNcTlBd3ZmS19ZZFQ0cW9Rano5YUM0UTZybGQtLU5OQWVFdWlKUXVpX2h5WUtReDNCUmpDWkRhTXkwckk4U1YyWUlwTG8yTnB5Yi03NGhUT0tHRllYSktWQW1ER3I0dHdxQVM4UGN5LUxuRDhVSGFiaTlhVk5zYXVsVks3N0wwVlBGaXJVaUFyYWx0SWtpM3JhSHJJMVpsLU1tbHVEbC1LYmhLM09MV3d3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) In Dangerous Position, Bitcoin (BTC) About to Lose $40,000, Shiba Inu (SHIB) At Local Support - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum finds itself shaky on the edge of a precarious position. The recent price chart indicates a concerning situation: the 26-day Exponential Moving Average (EMA), a key indicator of short-term momentum, is under threat. If this level fails to hold, Ethereum could see its value dip to the $2,347 mark, a scenario that may well trigger a more pronounced decline.\n\nThis potential slip below the 26 EMA is crucial because it suggests a weakening in buying pressure and a shift in market sentiment from accumulation to potential distribution. A break below this level would not only establish $2,347 as the next price floor but could also exacerbate the asset's losses, leading to further bearish momentum.\n\nETH/USD Chart by TradingView\n\nThe Ethereum ecosystem has faced its share of challenges despite the rise of layer 2-networks, which have not catalyzed the anticipated rally. The broader market has similarly not exhibited the explosive bull run many investors had hoped for, with Ethereum’s trajectory reflecting this subdued market energy.\n\nAdditional support and resistance zones can be gleaned from the chart. On the support side, following the $2,347 level, the next critical support lies around $2,175.2 - a breach of which could see ETH test the psychological and technical support near the $2,000 level. Resistance, on the other hand, is firmly established at the recent high of $2,547.6. This price point serves as a litmus test for Ethereum’s ability to rebound and reclaim bullish momentum.\n\nAdvertisement\n\nThe current market dynamics, marked by cautious trading and a lack of definitive direction, have placed Ethereum in a zone of uncertainty. Investors are advised to monitor these levels closely, as a break below or above these could signal Ethereum's next significant move.\n\nBitcoin in trouble\n\nBitcoin finds itself at a precarious juncture as it teeters on the edge of the critical $40,000 mark. The recent price action paints a troubling picture for Bitcoin enthusiasts, with the asset losing its grip on the 50-day Exponential Moving Average, a key support level that has historically indicated bullish sentiment.\n\nAs Bitcoin's price struggles to maintain the $40,000 level, the next potential foothold lies at the 100-day EMA. However, this level does not traditionally offer substantial support, and a breach below could precipitate a fall below $39,000, triggering heightened market concern. The chart reveals that the next major support zone stands near the $35,888 mark, a level that buyers might attempt to defend vigorously.\n\nOn the resistance front, Bitcoin faces a significant challenge at the $42,786 price level. Overcoming this resistance is crucial for Bitcoin to regain stability and demonstrate potential for a recovery. However, the market currently lacks the necessary liquidity to facilitate a strong rebound, as trading volumes remain relatively low.\n\nShiba Inu gets hit\n\nThe token is currently trading at a local support level, which is a make-or-break situation for its short-term future. A breakdown below this point could spell trouble, signaling a potential decline and testing the resilience of its investor base.\n\nThe current market landscape for SHIB is challenging, with a noticeable lack of growth catalysts and low liquidity in the broader cryptocurrency market, both of which could exacerbate the asset's precarious position.\n\nHowever, there is a glimmer of hope. The descending trading volume accompanying SHIB's price consolidation suggests that bearish momentum could be waning. This deceleration of selling pressure often precedes a stabilization of price, or even a reversal if bulls regain control.\n\nIn terms of specific price levels, SHIB is currently finding tentative support around the $0.000027 mark. Should this level fail to hold, the next support zone lies near $0.000022, which may serve as a new accumulation point for buyers. On the resistance side, SHIB faces a hurdle at $0.000035, a breach of which could open the door to a retest of higher levels, possibly around the $0.000040 range."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPOGV2TjF0XzRwZXI5NWh0V19oNlByRmJZRDFScEFsNERYMnNPdmtRUnZWZl9HZGdXSjBDVWRtOF85YVZLXzRXZlNlOU1iR3M1Z3Y3clQ2d1FDeGFxTEhJNGY1NUZKcW94a0RpZVZ5OHNjY3JBaW8yaVVFdXNjOWk2d0ZLd0VDcXVHVzZScnpNTTRRRnlzZ0M5dE1KNlljV3JxZXd1QWNobGN5dmwtU2RaVlUycUROZXAyNm9SS09UcDRURmtqdlk0X0lJc9IB0AFBVV95cUxNYm9uWmZMQy04bXd4VzhKRHY1TS1DdjMtTWJJa1RLWmRCQXJ1SXN0c2dpSkNDekVPdEdGSUwwSXlfZE84OVZ2ajFFZHhBWTJCRHhzYmFRb196elZmR1puSDBXdnZpY3pQV2ViS1ZxRzNULUQwSUxpSmF2aVVLTWdGaDdjX3JHallnWlhLeFBnalg1QUhNRjBMTXEwMm4xTlBzN0NLUzlFdnZPRFN2OURWcjJmcHV3aDBwaUhIVGxoRVVWVi1ITXZFTXdVOUs5RUF1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Celsius Wallet Deposits Nearly $36,000,000 Worth of Ethereum (ETH) Into Crypto Exchanges: On-Chain Data - The Daily Hodl",
        "content": "A wallet associated with the defunct crypto lending platform Celsius deposited $30.34 million worth of Ethereum (ETH) to Coinbase on Monday, according to the crypto tracker Lookonchain.\n\nLookonchain also notes that Celsius deposited $5.13 million worth of ETH to the crypto exchange FalconX.\n\nCelsius’ two staking wallets still hold a total of 557,081 Ethereum worth around $1.3 billion.\n\nCelsius filed for bankruptcy in July 2022 after its native token, CEL, plummeted by 99% and it was unable to fulfill withdrawals.\n\nIn July, the project’s founder, Alex Machinsky, was arrested and charged with multiple counts of fraud in the US. Mashinksy is also being sued by the U.S. Securities and Exchange Commission (SEC) for similar reasons. The regulatory agency alleges Mashinksy raised billions of dollars by lying to customers and offering unregistered securities.\n\nLate last year, a judge approved a new plan from Celsius that aims to generate funds for a new mining and staking corporate spinoff designed to repay creditors.\n\nThe company, dubbed “NewCo,” will have a $1.25 billion balance sheet, $450 million of which will be liquid crypto.\n\nIn a statement earlier this month, Celsius said it has begun the unstaking process for its Ethereum holdings, which it has been using to generate income for its estate over the last year and a half.\n\n“In preparation of any asset distributions, Celsius has started the process of recalling and rebalancing assets to ensure ample liquidity\n\nCelsius will unstake existing ETH holdings, which have provided valuable staking rewards income to the estate, to offset certain costs incurred throughout the restructuring process.\n\nThe significant unstaking activity in the next few days will unlock ETH to ensure timely distributions to creditors.\n\nAs a reminder, eligible creditors will receive in-kind distributions of BTC and ETH as outlined in the approved Plan.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/ex_artist"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPR2lJMXpQTlFEUFRnbWdJSWdIWExoT1hVNGFIbWNjUEVETjJZUXU2djdKUnZrWW5qanZiZGJuY3N4dUZDeEtVQzA3cjFLbE9lcDFvUzZwQ0lCMWsyOHVmVm1lY2Q2T0U1UlpBS2JrRllGNWdMZ3c3WVRaa3BDUDNLUmpYOV9USG1tQnE2WC1TclVKcS1uWFBScklVbWQxMURFQVIzeW1xcUhoUmJUYmM4ZnpjUUJ5ZjkxVUxockpHVmo3bFljSEFQcFZXYTdNcjTSAdQBQVVfeXFMTk9lOFVmd3ZCQVhoYndsZmNDa1NwaWh3Z184YkpBb0NZc1drMlVkLXBSeXNVbkpFakFhTWhpLVoyR0hVakg2OEtmRW5PbmRrOGpXZkpxZDJlX3JFZ19zTHRVcTJhN3c3dEtpRDFPVTBlb3ozVmZXOGRiZkQ3eHlDTS1wTHdjaU5Wb2w4cU5weFZEUk5xeVB5ZnV2MFNZdEZBNWw4SkFBaFJ1OFlpNjFCeEJ2Y0cyOVNLR21Rc0NhNjBnWjZfSEh4Xzl1bDVvLW5HeWN0bmw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Interoperability Hub Polymer Raises $23M Series A Funding From Marquee Investors - CoinDesk",
        "content": "\"Existing interoperability solutions such as token bridges are widely used but have proven unreliable and susceptible to hacks, leading to a lack of standardization within the Ethereum ecosystem with billions lost in exploits,\" Polymer Labs said in an emailed announcement on Tuesday."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxONE5KMkNwUUFib1BKQ3Z0NllaM2NEdmJiWmRiQ0VGYnFiWGFlTTdGam1FQm5aMl9yQTA2Q0tYX214Q2drUVY3ZjdTaHh6cmZ3UkViNVIyUDgzLU1hWU5lbG1VaUhHa1BJWWVwVmU3d3lGdFpNQkVxNF9fNVFNVTdURTVlS280WXZnd3JqSXg3TVRzMVg0aUZVYUtiMXhTaGlkOURleU5EbzE0ZTgwN1JLemJsU25NWU9tM3FYcEF3TDNVUG5JMkU2dGVhaksyYWg1dXd2NXlRS3VkWUY2anVJTNIB5gFBVV95cUxQNVdqb2taVC1DUUZPWmpvLVJQRkF5R1ZVNUdnd01rdVFGMW1uWjM4YzBSeFJucDY5a25mM0pHaTRXTjBYMS1uSlFkSlRfZy1xX29QNGlCUkNYSHZEQjN5Z2xnTWN6ek5vZ0hRRWRzTHJ4cnM0XzBYTnd4WkFhaVNtRDEwNUVpTDJGUlkxN2JwWXoycTRKcE80THdmZXY4aG1wV3o4QkVfa1NzTmlrZnRYa29CallHMTBiUjR1SG9TU1hHRWNzVk5BdFd4cEpEN1dtMVhkSFJGbVhQMHNRZnYzTWxIaS1vdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum traders realize nearly $33 million in losses as overheated futures market cools - FXStreet",
        "content": "Ethereum traders realized $32.73 million in losses during the crypto market correction on Monday.\n\nETH funding rate declined alongside Ethereum's price drop of nearly 7%.\n\nSentiment among traders improved, increasing the chances of a recovery in the altcoin's price.\n\nEthereum price dipped nearly 7% in the past day as the crypto market corrected on Monday. Bitcoin led the decline by dropping below $40,000, a psychologically important level, for the first time since December 3.\n\nETH price, which is correcting to the lowest level in two weeks, could be bottoming out as market participants’ sentiment improves alongside a decline in the altcoin’s funding rate.\n\nAlso read: Bitcoin bleeds below $40,000, sign of recovery or concerning dip?\n\nEthereum traders hit by $32.73 million losses in single day\n\nEthereum’s Network Realized Profit/ Loss (NRPL) metric indicates that ETH traders suffered $32.73 million in losses on Monday. This marks the first time Ethereum traders realized a loss since October 13.\n\nEthereum’s Network Realized Profit/Loss. Source: Santiment\n\nEthereum price dropped from $2,467 to $2,300 on Monday. The altcoin continued to decline on Tuesday, hitting a low of $2,285. While Ethereum’s price is currently in a downward trend, some on-chain indicators suggest that the altcoin could begin a recovery.\n\nTwo key metrics, Ethereum’s funding rate and weighted sentiment, suggest that ETH price trend could reset. The sentiment among traders, according to data from crypto intelligence tracker Santiment, recovered from its 2024 low of negative 0.89 on Monday to negative 0.75 on Tuesday.\n\nMeanwhile, the funding rate is considered a key predictor of the Ethereum price trend. If the funding rate declines while the sentiment among traders improves, it indicates there is a cooling-off in the derivatives market.\n\nEthereum price could begin its recovery following the completion of the ongoing correction.\n\nEthereum funding rates and price. Source: Coinalyze\n\nEthereum weighted sentiment. Source: Santiment\n\nTo the downside, Ethereum price could find support at $2,232, the 50% Fibonacci retracement level of its decline from April 2022 to June 2022. Should the current selling pressure abate at this level, ETH price could reboundand make a recovery to its 2023 peak of $2,446.\n\nETH/USDT 1-day chart\n\nHowever, a daily candlestick close below $2,232 could invalidate the bullish thesis. If Ethereum price drops further, the bearish imbalance zone between $2,086 and $2,056 could act as the next support zone."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPcVdTcFdVSml3RWlTUkkyRFdJOW1VdmdfSVRIdHJhcFZEYS1oT2lJUEtVc2RWem16Q09CSkNLNnJVYUxKOHRVd0FQX011UlJ2c0ZMWlhBQkFzMXN5c0F5eEJkMllNelVCNXhvV1lkT2cwYkw4Y3BFdFh3bTU0Y2dPMFpVVERwbWlHbXFtYjJ30gGWAUFVX3lxTE1TeW5iWlh0TG5MVTlCbjdTLU5mT2E3OTYzM1ZWSFhVRTFyWVZnQTBRaE9nTDhvMnUzYkt2NGU4b3V2LXhnbG9GVW5XdE5oRlNWazNSYTUyQWdVcEFtdHhHUmpubmg3clc4eTdLQTZPdW5DVlotRVVmeFhHMWlXdDJnNHBnWVg0ZkVDb3pDbm1RcXZVR1MyZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Edward Snowden Urges Support for Jailed Founder of Ethereum Mixer Tornado Cash - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhistleblower turned international fugitive Edward Snowden today backed and endorsed the legal defense fund for the Tornado Cash founder.\n\nIn a Tuesday post on Twitter, the exiled former CIA contractor asked followers to pitch in to help Roman Storm, co-founder of the once popular but fatally sanctioned cryptocurrency mixing service.\n\nYesterday, Storm said on Twitter that he would launch a campaign—in the form of a decentralized autonomous organization (DAO)—to raise money for a lawyer. Last year, the U.S. Department of Justice arrested Storm and charged him with money laundering for his part in the creation of Tornado Cash.\n\nTornado Cash was a popular cryptocurrency coin mixing application that allowed users to anonymously send and receive Ethereum, the second largest digital asset by market cap.\n\nAD\n\nAD\n\nBut the Department of the Treasury’s Office of Foreign Assets Control (OFAC) in 2022 banned Americans from using the service, claiming that criminals had used it to launder dirty money.\n\nThey then alleged that Storm and his colleague Roman Semenov laundered more than $1 billion in criminal proceeds. Developer Alex Pertsev was also arrested.\n\nBut the new fundraiser’s website argues that “the arrests of Roman Storm and Alex Pertsev are considered a direct attack on the open-source development space and may have devastating consequences for developers who write and publish code.”\n\nIf you can help, please help. Privacy is not a crime. https://t.co/R4vauNLRB4 — Edward Snowden (@Snowden) January 23, 2024\n\nAD\n\nAD\n\n“If you can help, please help,” Snowden said in a retweet of Storm’s plea. “Privacy is not a crime.”\n\nSnowden, who has been living in exile in Russia since being charged by the U.S. government with espionage in 2013, has long been a privacy and cryptocurrency advocate.\n\nHe said last year that the sanctioning of Tornado Cash was “deeply illiberal and profoundly authoritarian.”\n\nSnowden also helped create the privacy coin Zcash and has spoken about how people should use cryptocurrencies rather than buy them as an investment.\n\nSnowden has also pointed out Bitcoin’s privacy problem. The biggest cryptocurrency by market cap is pseudonymous: a user’s identity isn’t recorded on the blockchain but every single transaction is.\n\nAuthorities are, therefore, able to track down people who send and receive the digital coin if necessary.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNLTU5RERvdkZNbDNCQWdRR2kxdzRWZmZ1LTZleG94VEluVmRneGtNd2RVUXBjdmJGVXNaUnMySlFxeXhOZGhHeU9EcnZlRHJ4UEl1alJOUkY4aUdjNjFzTHczUy11alhCTjM5WS0zUlFrR2FVdmRjUGtNbXVESVU4R0c2TzRralFtS0NoQ1lpbk50REFwWlU2R3BUZ2MyUTJOWS16NUxnVDQ5czlrSXJ2bWhka1JMWFdHY3ZLMWVYR2hvU1dGRV9wclN6ZlM3Uzl2aFdFODhqMUlfOHU1el90a3BQOGVtdWlscWdLQjViQ2J3eDJl0gH6AUFVX3lxTE91bXFVVVJZNmlSUGcwRkVuOTRPQUdNY0o3Ql9yWTdtNFBCMUpaaGpFY3VwdGNuaEZNR21vTkNmZ0J3TG5hQ3lpYVhTLUdqczVKTWc2YWxnRGtReUlkbW4wbDFJc1ZoVjJhWnh5YVBubnVZLVlTaHQ3XzVfYV9LVVJQcTBSc1E2VF9TWEtrclE3TVpPRU9RNXRvbXphU0I5Xy1PUkFqb2ROa2JYU3ZudWN5RjQ2UW5TYUdHb3BKWTBYQTNDemh4SWRPNjZmLXVObGlvbXJpVzFnVUhEMlk1SXdUQTJDY2J3ZG9qUC16SllwWW5ZN20tTWd0dFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC defies respectable correction, restores above $40,000 - FXStreet",
        "content": "Bitcoin price could make a move north if it closes above the $40,726 support on the three-day timeframe.\n\nEthereum price likely to fall 5% before inflection with uncollected liquidity residing below $2,135.\n\nRipple price looks poised for recovery after a double chance on the FVG.\n\nBitcoin (BTC) price is attempting a recovery barely 24 hours after speculation of a “respectable correction” that was expected to send BTC to the $35,000 range. Ethereum (ETH) price is yet to heed BTC’s cue, while Ripple (XRP) appears to have bottomed out.\n\nAlso Read: Bitcoin price could face short squeeze, analyst says, as FTX sells nearly $1 Billion of Grayscale spot BTC ETF\n\nBitcoin price fights to find a hinge\n\nBitcoin (BTC) price is pulling back after a strong rejection from the $48,000 psychological level. Despite a slippery slope, BTC has managed to reclaim the $40,000 psychological level after a range low of $38,555. BTC holders remain in murky waters until such a time when the price breaks and closes above the $40,726 support on the three-day timeframe.\n\nThe Moving Average Convergence Divergence (MACD) and Awesome Oscillator (AO) indicators remain in positive territory above their respective mean lines, inspiring hope for a possible move north.\n\nIf the bulls have their way, a decisive move above $40,726 would set the pace for Bitcoin price to breach $43,750, or in highly bullish cases, reclaim the $48,000 level. Overly ambitious outcomes could send BTC past the $50,000 psychological level, last tested in December 2021.\n\nBTC/USDT 3-day chart\n\nConversely, with the Relative Strength Index (RSI) below 50 and still southbound, Bitcoin price could extend the fall, potentially slipping past the $37,800 support. Losing this buyer congestion level could send BTC to the $30,000 psychological level.\n\nAlso Read: Bitcoin Price Outlook: Analyst anticipates $35,000 retest for BTC as part of ‘respectable’ correction\n\nEthereum price could extend the fall 5%\n\nEthereum (ETH) price may have an additional 5% in losses coming to test the $2,135 level, amid uncollected sell-side liquidity residing below this critical level. This level is critical for Ether market value, as it continues to hold Ether afloat after a prolonged consolidation since December 3.\n\nIt therefore marks a possible inflection point or another measure of quicksand to invalidate the prevailing bullish outlook.\n\nThe odds support the bearish thesis, suggesting the drop could come as the RSI is showing falling momentum as the MACD is subdued and moving in tandem with the signal line (orange band). The AO histogram bar is flashing red but still in positive territory, reinforcing the assumption that $2,135 will be critical in determining the next directional bias.\n\n\n\nETH/USDT 3-day chart\n\nIf the $2,135 support holds, the Ethereum price could bounce, with the potential to overcome resistance due to the midline of the channel as it targets the $2,800 level, 25% above current levels.\n\nAlso Read: Ethereum ETFs likely to get better deal than their Bitcoin counterparts\n\nRipple price likely to bounce from here\n\nRipple (XRP) price looks ready for recovery after a second retest of the Fair Value Gap (FVG) between $0.4927 and $0.5111. The RSI has tagged 30, suggesting XRP is oversold and a bullish correction may be due. A reentry by the bulls could see the Ripple price reclaim the support offered above $0.5442. In a highly ambitious case, XRP could extend the gains to the $0.5784 level. Beyond this, the next logical target for the XRP price could be the $0.6000 psychological level, standing around 16% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the XRP price extends the fall below the midline of the FVG at $0.5029, the load-shedding exercise could extend with Ripple price likely to revisit the $0.4746 support, around 8% below current levels.\n\nAlso Read: XRP price could gain nearly 12% as on-chain metrics signal recovery"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBfNE9QSzA2QnpMY25kYzJjTm51UGtIUVNpM0FTblJocElGeE85QzVNWUw2OU8ydERfdElfTmRiaVRhZlpveXdVNnV1UlYzR1hnNTlDckEtY1FEWUdkUFVYUGdGdG9Hc09UdWtMd1hVTGNBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays BlackRock Spot Ethereum ETF - Watcher Guru",
        "content": "In the latest development for the next wave of cryptocurrency ETFs, the SEC has delayed a decision on BlackRock’s Spot Ethereum ETF. Following landmark approval of Spot Bitcoin ETFs in early January, BlackRock hoped its pending spot ETH ETF application would be approved swiftly, but the SEC has yet to budge.\n\nJUST IN: 🇺🇸 SEC delays BlackRock's Spot Ethereum ETF. — Watcher.Guru (@WatcherGuru) January 24, 2024\n\nAlso Read: Solana to Surpass Ethereum by 500% – But When?\n\n“The commission finds it appropriate to delegate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,” a new SEC filing says. The commission designates March 10, 2024, as the new deadline to approve or deny BlackRock’s Ethereum ETF.\n\nThe SEC also delayed decisions on every Spot Bitcoin ETF application before approval, including BlackRock’s. Just days ago, the commission delayed Fidelity’s Spot Ethereum ETF application.\n\nIt’s no secret that the SEC is not a fan of cryptocurrency. In fact, chair Gary Gensler implied shortly after approval that it was seemingly pushed to approve the Spot Bitcoin ETFs. Immediately, cryptocurrency enthusiasts went to social media to blast the commission, signaling a feeling of déjà vu. Following the initial filing, the SEC had 45 days to decide on the ETFs or delay it, and the commission’s deadline was Jan 25, a day after the decision to delay.\n\nAlso Read: Bitcoin: Cramer’s Doubts vs. Hayes’ Bottom Fishing – What Lies Ahead?\n\nHence, it is likely that the SEC is looking to prolong the potential approval of Ethereum ETFs, including BlackRock’s. Other asset management firms have filed ETF applications for Ethereum in hopes of adding it to their services. However, those applications may likely be delayed eventually as well."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE43aFptSVhrVlhBdllLMVlJUHFmNTN5bUNoY0FjNVlGdlNEU08tejVuR1pSc1dVaDd5enN2YU5NMEFYY0RQLUIyLXZJaDRIX2F3dHJZZzhPa1U1bmJpZWd6dlViQUFsNmVHdzhRZVppVV9QcWZNdmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Crypto Surge 2023: Global Adoption Soars 34%, Bitcoin & Ethereum Lead - TronWeekly",
        "content": "In 2023, the global cryptocurrency landscape witnessed remarkable growth, with the number of cryptocurrency owners surging by 34% to reach a staggering 580 million by the year’s end, as reported by Crypto.com. This notable increase, up from 432 million in January, defied prevailing macroeconomic challenges such as stringent monetary policies by Western central banks, ongoing conflicts in Europe and the Middle East, and the enduring effects of the pandemic.\n\nhttps://t.co/vCNztATkNg’s Market Sizing Report for 2023 is out.\n\n\n\nThe industry grew 35% to 580M users in 2023, adding 150M new users.\n\n\n\nGet more insights on global crypto growth in 2023 👉https://t.co/2zTkTv71cK pic.twitter.com/axkfKHvAJk — Crypto.com (@cryptocom) January 22, 2024\n\nCrypto Boom 2023\n\nThe surge in adoption was evident in the first half of the year, notably marked by the success of the Ethereum Shanghai Upgrade in April. This upgrade not only bolstered Ethereum network activity but also contributed to a rally in Ethereum prices. The latter half of 2023 witnessed sustained growth in both Bitcoin and Ethereum adoption.\n\nBitcoin, representing 51% of global cryptocurrency owners, saw a 33% increase, reaching 296 million by December. The introduction of the Bitcoin Ordinals protocol played a pivotal role in this growth, facilitating the minting of non-fungible tokens (NFTs) and fungible tokens on the Bitcoin network. Bitcoin’s exceptional performance in April and May was attributed to the momentum generated by Bitcoin Ordinals, with more than 54 million inscriptions on the network and a total inscription fee exceeding 5,473 BTC ($257 million).\n\nInstitutional interest further fueled Bitcoin’s adoption, with significant developments in Bitcoin exchange-traded funds (ETFs). Notably, BlackRock’s Bitcoin ETF filing and other institutional heavyweights contributed to a surge in institutional adoption.\n\nEthereum, representing 21% of global cryptocurrency owners, experienced a 39% growth, reaching 124 million by December. The adoption growth was closely tied to the implementation of liquid staking after Ethereum’s Shanghai Upgrade, enabling the withdrawal of staked ETH after the transition to the Proof of Stake (PoS) blockchain.\n\nAnalysis of the trends in 2023 revealed exceptionally strong monthly growth rates of 5.1% and 6.7% in April and May, respectively. The overall growth of owners for Bitcoin and Ethereum remained robust throughout the year, with prices reaching notable levels in Q4 2023—$44,000 for Bitcoin and $2,400 for Ethereum.\n\nDespite fluctuations in market dynamics, the composition of cryptocurrency owners demonstrated stability, with Ethereum’s adoption rate increasing by 0.7% and Bitcoin witnessing a marginal decrease of 0.4% during the year. The crypto market’s resilience in the face of global challenges underscores the growing significance of digital assets in the financial landscape.\n\nRelated Reading | Bitcoin Countdown: ViaBTC Predicts Post-Halving Price"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOTkJTenhFWFVwMmg2bUlob3NoNUtKYTdhQXlENEhLT085MV9PeFFyZGZGSEs0dVZFNURYdWhtS1pNTlhVXzdjcjJuZXU4Vk5Qb1BXUXBwRHBoTGRzdWxjc2JEd2o0LVphWk1yOGlOT3dVbmRSVHNOVndWbWN1MTBwTV9rcm1FZW0zb3AtRtIBkgFBVV95cUxPYWxnS0FFLUxQZ1pqWTNsVjFIYXVwWjBzNWNrRmdXV2FVWVVhYUV4bkZfOEs3ckhVMktReDI4LUdZRVdiZHdyU3JRMDVwT0pGVDRxU0U4aXJtbzNKRklodm1GbXQ4a19FRmpXUkRkMXc1c3l1NHBzWF9QaWk0QldOYUEwX0xWbmJrak9FR2pNeld1dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Cardano Outperforms Polkadot, Ethereum in Recent Development Activity - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nProof-of-stake (PoS) blockchain network Cardano (ADA) has outranked many of its major peers in monthly development activities, as measured by GitHub Commits. According to data insights from crypto analytics platform Santiment, Cardano has maintained a slight lead over its peers over the past month.\n\nAdvertisement\n\nPer total GitHub data, Cardano recorded a total of 332.9 commits over the past 30 days, with the closest ranking peer, Polkadot, recording 329.57 commits. Per Santiment, there was no significant jump in Cardano’s GitHub Commit from the previous report, as the December holidays slowed things down in terms of developer activities overall.\n\nCardano has always maintained the top spot as the biggest venue concerning developer engagement. For many months, it has not been displaced from first place, despite the emergence of numerous alternative protocols, including both layer-1 and layer-2 solutions.\n\nThis tear of development activity is one of the unique ways Cardano is showcasing its strength as a major Ethereum killer, seeing as other top chains like Ethereum are recording relatively lower GitHub commits overall. Per Santiment data, Kusama, Polkadot’s canary network, came in third, with a total commit of 329.57, the same figures as Polkadot.\n\nAlternate chain performances\n\nProtocols like Optimism and Status (SNT) recorded upticks in their figures, with total commits coming in at 281.03 and 262.23, respectively. Hedera and Cosmos occupy the fifth and sixth positions, with their GitHub commits coming in at 251.57 and 246.17, respectively.\n\nInternet Computer and Chainlink were also ranked higher than Ethereum as the trio recorded 212.1, 198.87 and 195.93 commits over the past 30 days.\n\nThe GitHub Commit metrics are a testament to how much work is put in to ensure a protocol stays at the top of its game in rolling out applications and upgrades needed to function optimally. While this has not necessarily translated into price growth for Cardano or others, it shows that efforts to keep building for the future remain solid."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNVmExc3U0NW9oN04zcGRSWDR2dFJFanozYTJMeFZGMWw4b0NzbTJzclB1c19ySlE5b2RkeWZmblJ5RnU2T19IMHJmUXJFZUEwdU9vVHItQzh2YzF2ZEcwRGJtM1RGalU2Tzk2MGktcndweEY1V1BzRWVCa1FjejFOMk9HNXFQNjhGdmFqdjlxR2VSaUhQODV1UjNGSEhkX1RtTHV0dkFoUmU5dEphNnRjdWswOHN6Wjkxbkh6eTYwZ2c4S2VkNG9jWENKbGhkRHNRVU9Fa2h6alTSAd4BQVVfeXFMUElhTm91OUJUWHN1eVpuWHdJWGY5RkZacXNVdkpTc215US04d1plc0xKa25GR1hEQ3Y3RFRtdUZ2VzJ5dTJvZkRHSHdHcXgydkgxd3Z0X2VQd1dOcUM1S3hFd1E3UEtQQmxZTS1pbXRzek93M1I4U0pqTzZLWHl4cTNKWWIyNE5ZLTlfVUd2aWVYYjQwUW1TTkVYMURmSFoxbm1PQW4ySXFOcUhDVk1HbEgwWHJRSkZhc0YxNGt4aTltMDN0RnlQQUtsc3Q3a1p4cEFYVnNyblBjR2k3cVhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Analyst Predicts Over 100% Rally for ETH-Based Altcoin, Updates Forecast on Sui, Arbitrum and One Other Crypto - The Daily Hodl",
        "content": "A widely followed crypto analyst thinks that an altcoin running on the Ethereum (ETH) network is gearing up for a big surge in price.\n\nTrader Michaël van de Poppe tells his 685,500 followers on the social media platform X that the decentralized oracle network Chainlink (LINK) looks poised for a 2x rally.\n\nAccording to Van de Poppe, LINK looks bullish against both Bitcoin (LINK/BTC) and the US dollar.\n\n“This one looks primed for continuation.\n\nThe BTC pair is making higher highs, higher lows and held a higher timeframe support level.\n\nExpecting a breakout to $25-$30 in the coming months to occur.”\n\nAt time of writing, LINK is trading for $14.72, suggesting an over 100% upside potential if the ETH-based altcoin hits the analyst’s target.\n\nLooking at layer-1 blockchain Sui (SUI), Van de Poppe believes that the altcoin is likely headed to its next support area at around $0.90 before the next leg up.\n\n“This one is also having a general correction, which is fine. The optimal zone for entries is coming up, before the upwards trend is continuing.\n\nBuy the dips.”\n\nAt time of writing, SUI is worth $1.04.\n\nNext up is the Ethereum scaling solution Arbitrum (ARB). Just like SUI, Van de Poppe thinks that ARB will see lower levels before regaining bullish momentum.\n\n“This region between $1.40-1.85 is an area I’d be looking to get myself positioned before a potential run to $3.”\n\nAt time of writing, ARB is trading for $1.71.\n\nThe last coin on the trader’s radar is the interoperable blockchain Cosmos (ATOM). Van de Poppe believes that ATOM must stay above its immediate support level to have a shot at igniting a strong breakout rally.\n\n“Crucial area to hold, if this area between $7.50-9.00 is going to hold, likely a breakout to $22-$26 seems next.”\n\nAt time of writing, ATOM is worth $9.20.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNYTFwVWNZRU5BME9XenNzbE4wUlBIRFpyNUhmc1Budlo0SmFldWhybzZTLTM1eEpJQWViV0Nma0hhYm91VVN4d2p0elRHQm9qRXlhc3pEZWxJQzZBancyaXFkdFcyUEV5T29jRzEzOThOZWJXSVBkSEdOWHMyMU1DTmtTTHBfWW9hc0l4MEVONXdIR1AxOWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Celsius Shifts $40 Mln Ethereum To Coinbase Amid ETH Price Dip To $2,200 - CoinGape",
        "content": "Celsius Network, a bankrupt crypto lender, has been on a sell-off spree as it is liquidating its crypto assets to repay its creditors. Most of the sell-off circles around Ethereum (ETH) as it constitutes a majority of Celsius’ reserves. In the latest development, the crypto lender transferred over $40 million worth of ETH to Coinbase, a leading crypto exchange.\n\nCelsius Transfers Massive ETH Reserve To Coinbase\n\nAccording to data from Lookonchain, an on-chain tracking platform, Celsius recently moved 18,000 ETH tokens from their reserves to Coinbase. The transaction accounted for nearly $40 million worth of ETH being transferred, considering the current ETH price trend.\n\nadvertisement\n\nFurthermore, as the Celsius ETH unstaking program progresses, it has been reported that since November 13, 2023, the institution has deposited a total of $280,760 ETH tokens to Coinbase, FalconX, and OKX exchanges. This accounts for a massive $621 million worth of Celsius ETH reserves being unstaked.\n\nWhilst, Celsius currently holds an Ethereum reserve of 540,029 tokens, valued at over $1.2 billion. Earlier, on Monday, Celsius recorded a deposit of 13,000 ETH worth $30.34 million to Coinbase. Moreover, another transaction noted a shift of 2,200 ETH, equivalent to $5.13 million, to FalconX.\n\nIn addition, last week, the bankrupt crypto lending firm transferred 34.8 million Polygon (MATIC) tokens to Binance, the world’s largest crypto exchange. The transaction was valued at $26 million at the time. Moreover, FTX joined in with a significant transfer of ETH and Wrapped Bitcoin (WBTC) to Wintermute and Binance.\n\nAlso Read: Divergent Views on Spot Ethereum ETF Approval, ETH Price Drops 5%\n\nEthereum Price Falls To $2,200 Range\n\nThe Ethereum price has dropped below $2,300, which is spurred by the overall bearish sentiment in the market. However, the ETH price showed signs of a rebound as it gained 0.43% and traded at $2,239.26 at press time on Wednesday, January 24. The second-largest crypto displayed a market valuation of $269.07 billion.\n\nWhilst, the trading volume for Ethereum dropped 1.32% to $14.40 billion in the past 24 hours. During the day, the ETH price extended as low as $2,167.28 before surpassing the $2,200 level again. Moreover, it’s important to note that ETH has lost over 54% from its ATH of $4,891.70 two years ago.\n\nIn addition, the crypto has plunged more than 17% from its high of $2,710.42 attained in the week the Spot Bitcoin ETFs were approved. According to TradingView data, ETH is boasting a strong bearish outlook in the short term, considering the EMA values. Currently, ETH is trading fairly lower than the 10-day and 50-day EMAs of 2380.3 and 2316.1, respectively.\n\nAlso Read: Coinbase CLO Challenges Court Ruling In SEC vs Crowd Machine Lawsuit\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNdFdwYnVuTmJVaDhlbXFjY0pvTVFfSjNENTMzeGI5Z3h6OGJIbzd1UEhUX0d5VW9zWGplaV9RZUMyQ1VOa2cwekZPQWFCaUZWOTBZaGxaMHAxTjVKTFlmOW1QbjRfOXhjU1NXNkhwWG5FMlluOS1tUl9sR2UzQktHZlo0U0tpU181bHJ4Y2FpeHJJZG9BR19meVAxTTdVVVVUc0h5dFg5bmlUN3fSAbABQVVfeXFMUGxCRjcyZ0R1ZXVnVVZKbU9jNkRkdnh0Z1ZIZy1nYjhLVGZXSFZELU1KVjNPbGhibVpyTGZJdkdoWFUyVmpGZDcwMDJ1RThMXzBVelg3S2QyMlh2RklNQkR3UWhiUFRieUtzaUltRnM0NzU3Ulpyakl0Ty0tLV9nNXVmQVJGSmFHS3ZpcHppMUl2dDRRRWxPMk1ZMmlDWXFGbkFtaU81YzBFV05rekdhWmY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Strong Start to 2024 Sparks Q1 Optimism: Could ETH Reach $3,600? - Crypto News Flash",
        "content": "Analyst Michaël van de Poppe predicts Ethereum (ETH) could outperform Bitcoin (BTC) in Q1 2024, mainly due to the potential approval of an Ethereum spot ETF.\n\nEthereum’s current price is $2,425, with key support at $2,368, but it faces resistance at $2,440, and profit-taking by large investors may influence its price.\n\nEthereum (ETH) is gearing up for what could be an impressive first quarter in 2024, with prominent cryptocurrency analyst Michaël van de Poppe expressing optimism about the digital asset’s prospects in a tweet on X. Van de Poppe, the founder of MN Trading, believes that Ethereum may emerge as one of the top-performing cryptocurrencies early in the year. His confidence in ETH’s performance is rooted in factors beyond its intrinsic value.\n\nMy Top 5 #Altcoins for Q1 2024! It's always an exciting topic, especially when the markets are heating up, and people eagerly await to jump into the altcoin markets. Watch the entire video here:https://t.co/Lp3kSvWpxb But, what is my top 5? Let's discuss it! My top 5 ⬇️… — Michaël van de Poppe (@CryptoMichNL) January 1, 2024\n\nEthereum ETF Filings Raise Expectations\n\nRather than focusing simply on Ethereum’s fundamentals, van de Poppe emphasizes the importance of Exchange-Traded Fund (ETF) filings, including Bitcoin (BTC). According to him, the prospect of an Ethereum spot ETF being approved might significantly impact the cryptocurrency’s price.\n\nVan de Poppe’s thesis centers on the idea that Ethereum is poised to outperform Bitcoin soon, prompting a strategic allocation towards ETH. He believes that authorizing a Bitcoin ETF will pave the way for an Ethereum ETF, increasing interest in the second-largest cryptocurrency.\n\nWhile the chances for an Ethereum ETF are encouraging, it is worth noting that the U.S. Securities and Exchange Commission (SEC) has pushed out its decision on the Ethereum ETF until May. Despite the delay, many industry observers remain optimistic that a judgment in favor of Bitcoin ETFs will be made in January, perhaps creating a precedent for Ethereum’s ETF ambitions.\n\nEthereum’s Price and Market Analysis\n\nAs of the most recent data, Ethereum (ETH) is valued at $2,425, kicking off the year on a bullish note. The daily chart indicates that buyers have been able to capitalize on the exhaustion of sellers at the $2,272 price level.\n\nHowever, Ethereum’s price currently resides within a crucial range. Data from the crypto intelligence tracker IntoTheBlock highlights the demand zone for Ethereum between $2,368 and $2,373. A drop below this critical area could trigger a further decline in Ethereum’s price, potentially leading it to a range between $2,010 and $2,082, given the absence of significant barriers.\n\nConversely, if Ethereum’s price experiences an upward rally, it will encounter resistance around the $2,440 mark. Notably, there is substantial accumulation between $2,373 and $2,440, with 903,110 ETH addresses holding a total of 4.73 million Ether.\n\nExamining investor behavior and profit-taking trends is critical for determining the potential impact on the price of Ethereum. Investors with large wallets, also known as whales, appear to be profiting. Increases in the Network indicate this Realized Profit/Loss (NRPL) measure, which tracks profits made by Ethereum holders and whale transactions for $100,000 or more. Such profit-taking by big holders tends to impose selling pressure on the asset, causing prices to fall.\n\nAnother critical metric to monitor is trading volume, which reflects on-chain activity. Recent data from Santiment reveals a decline in Ethereum’s trading volume between January 10 and 22. This decline in volume has occurred in conjunction with a decrease in ETH’s price. The dwindling volume and reduced activity on the Ethereum network lend credence to the possibility of a short-term correction in the asset’s price."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9QTVprZ0Nkdk9udlBmdlVremJlOTVYLXE5eldvRUtmTVBVcFMtSzhSbFpXSUZmckpEUnl0SndJX2pPT0lZcXJNM3EyajJkWUM4aTJjSXBRYlFGcDNwNU5DaVV0S1Fzdk9jSlhVSGVUSjlZaElFVXZZ0gF8QVVfeXFMTmo0d3lhSGMtZnhCVzhNNTdIb3Npa0RaS1VzeXhvVlpILTV1UDhwN29sNnVPVGtCRDFPVHk1OFIybVo1UG1lY2QyRDZiYU5qMHQzZXR1TUpFZk9HcVIxbG1jQ0JSSTNLLWlzOGNrWDEwbkI2aVpidHhFWWxKNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Will Ethereum bear the brunt of Celsius’ moves? - AMBCrypto News",
        "content": "Celsius made massive ETH transactions in the wake of its bankruptcy proceedings.\n\nGas usage on the network declined, however, NFT activity remained high.\n\nThe most recent data insights from on-chain analytics provider LookonChain revealed massive transactions within the Celsius wallet over the past 10 hours.\n\nSpecifically, a deposit of 13,000 Ethereum [ETH], valued at $30.34 million, was executed on Coinbase, alongside another transaction involving the deposit of 2,200 ETH, totaling $5.13 million, to FalconX.\n\nTurning up the heat\n\nFor context, Celsius Networks is a cryptocurrency lending platform undergoing bankruptcy proceedings. This is why it has been actively transferring a substantial portion of its Ethereum holdings to various exchanges.\n\nThis process of unstaking ETH and relocating it to exchanges is a strategic move aligned with the platform’s recovery efforts during the ongoing bankruptcy proceedings.\n\nAccording to the most recent data available, two staking wallets affiliated with Celsius retained a considerable quantity of Ethereum.\n\nThe aggregate holdings within these staking wallets amounted to 557,081 ETH at press time, equivalent to an approximate value of $1.3 billion.\n\nETH sees red\n\nThe amount of ETH being held by Celsius could affect market sentiment, and their sudden moves may cause FUD around ETH.\n\nAt press time, the king of altcoins traded at $2,229.54, with its price having fallen by 6.46% in the last 24 hours. Its MVRV ratio also fell during this period, denoting that many holders posted losses.\n\nThis could be a positive development for ETH, as there was no incentive for these addresses to sell their holdings.\n\nAdditionally, despite Celsius depositing their ETH to exchanges, the concentration of ETH held by whales remained high. The rising interest from whales could help move ETH’s price in a positive direction.\n\nDespite these factors, the number of short positions taken against ETH had grown. According to Coinglass’ data, the number of short positions taken against ETH grew to 53.12% in the last few days.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nState of the network\n\nComing to the state of the network, it was seen that the gas usage on the Ethereum network had plummeted. This meant that overall activity on the network had declined.\n\nHowever, overall NFT trades on the Ethereum network continued to rise, suggesting that there may be hope for the interest in Ethereum to be rejuvenated in the future."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPNEJESUVXVVBGS0wtRGYxWVVnUlh4Q3NIV29wcS10WXVkc3Y3d2U2c2I0VTQtQU1XNERXeHBLN1dBcFhmMVBYZW5fRjRMZHp5Z1lVc2t3UXlhemNXSUREUVJfVm9KdXlvMl9ZWjNYX2NZcDZnVEdQa0YwWVlKeEFnMlIwVnFyYlgycUHSAY8BQVVfeXFMT0hrMEpCbWxLNFg4eGZCYzBLa2tXQ3g3WWVudmI4YkNVM19zUEtfZDZJVUNQb0I1VGJEUGdNTm5GZ0dTZ1FPX0t4UjRBX0p1Ml9lU1dTRXRib0h5WDkzdGFVZF9yZWVaTXZMLW1CdTNJbjhiazA5bFNHZVBpVkRVemk3YnF5STdhMzV3dnBTMWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Trust Wallet Launches ETH Pooled Staking Service - The Daily Hodl",
        "content": "January 23, 2024 – Dubai, United Arab Emirates\n\nTrust Wallet, a leading cryptocurrency gateway, announces the launch of ETH pooled staking.\n\nThis feature aims to expand the Ethereum staking experience, offering greater access, potential for rewards and security for Trust Wallet users.\n\nETH pooled staking, offered through Trust Wallet and powered by Kiln, addresses some of the traditional limitations associated with Ethereum staking while providing a competitive APR (annual percentage rate) of up to 3.8%.\n\nPlease note – APR is an estimate and may vary due to market fluctuations.\n\nThe requirement to hold a minimum of 32 ETH is no longer a constraint, allowing a broader range of users to engage in staking activities.\n\nThis initiative reflects Trust Wallet’s ongoing efforts to make cryptocurrency investments more inclusive and represents a noteworthy development in digital asset management.\n\nKey features of ETH pooled staking\n\nHigher staking rewards with lower fees\n\nETH pooled staking offers higher rewards than centralized exchanges by staking directly on-chain and reducing intermediary involvement.\n\nThis method not only amplifies user profitability but also offers greater control over their staked assets.\n\nContributing to chain security\n\nUsers of ETH pooled staking don’t just benefit financially – they also contribute to the security and stability of the Ethereum blockchain.\n\nThis ‘doing well by doing good’ aspect adds a feel-good factor to the staking experience.\n\nEnhanced security benefits\n\nAligning with Trust Wallet’s core principle of security, the collaboration with Kiln ensures a robust and secure staking environment, safeguarding users’ assets and interests.\n\nAccessible staking for all\n\nThe removal of the 32 ETH minimum requirement invites all Trust Wallet users to participate in staking, promoting a more diverse and equitable crypto ecosystem.\n\nSeamless integration\n\nThe ETH pooled staking feature is seamlessly accessible directly from the Trust Wallet app with only a couple of clicks, providing a user-friendly interface for effortless staking of ETH.\n\nNate Zou, product lead at Trust Wallet, said,\n\n“I am incredibly excited about the introduction of ETH pooled staking. This initiative goes beyond being just another feature – it signifies our dedication to providing our users with a more equitable and profitable staking option, while also enhancing the robustness of the Ethereum network.\n\n“We eagerly encourage our Trust Wallet community to delve into the rewarding experience of ETH pooled staking. This development is a key landmark in Trust Wallet’s ongoing journey to offer holistic, user-friendly and secure solutions in the cryptocurrency space.”\n\nAbout Trust Wallet\n\nTrust Wallet is the simple-to-use, self-custody crypto wallet and gateway to Web 3.0 for people who want to fully own, control and leverage the power of their digital assets.\n\nFrom beginners to experienced users, Trust Wallet makes it simpler, safer and convenient for millions of people around the world to experience Web 3.0, store and manage their crypto and NFTs, buy, sell and stake crypto to earn rewards and access DApps securely – all in one place.\n\nWith features such as the Trust Wallet security scanner and support for over 10 million digital assets across more than 100 blockchains, Trust Wallet is a true multi-chain crypto wallet that allows users to access the Web 3.0 world safely and without limits.\n\nContact\n\nDrew Azarias, Trust Wallet"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQYXRMeFBucUlMTjdsRGtfazFRRlNKUU5sbExFWjFuWlhMRWlNRFhBeWM2Q0JSaWlBZmdSSlZjenhfQW1wZjUzeF8zM1NVRmVIRUc5QUE0QW1sUTk1ci1BSWhwZUV5WGNZNWFTclZrcTJ5Rzc5UE9aWWstdWFTWnlIdHRYZUpqZGNNbDRoXzZZYm1NUWpVbE5LTjVGMl9pbjRrWWFkV01rZjl1Z0lEWHRhZENSNkVuRWZCZTFZRUx6R0FicHVRT3czeWVnT1RVbFFNY1lrMlFUZ9IB3AFBVV95cUxNQnZlRnFCZFdzT2RraXVUSUZvUE1ySDNqWHdja19nV1NFVXJQaEpRelcyZXRIajIzaWFWcHEtaEhzQUU1LUl2R3pDOTU1bEVkZnlsN2cyQXBVdjFldkc1Z0pDMUYtTkJPYldyUl9Sa0ZmeU1ULTRiLTdrb3FCV1JLZEVQOHBKdkRiZV9zd3pXZ3QwODNqUmNyTzVMMW5OcjU0aU82MmRveUU4MExkcmNrVDgzYmlfZDJmTkgtVXlFSktVczJmS2ZNd3Fxb0dEUkJRQ0dyOWRvUE1Cb2VG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Immutable X & Sei — Asian Wrap 24 January - FXStreet",
        "content": "Sei price shows a good sign of recovery after sweeping a key swing low. This move indicates that bulls are vying for higher prices. However, the pullback rally will not be simple due to key hurdles.\n\nImmutable X (IMX) price did well across December, with the gaming and metaverse sectors standing out while contending ecosystems struggled. While the project eventually found inflection with holders cashing in, things may change soon as the network has a linear unlocks event that will line up for the next month.\n\nFollowing the landmark approval of spot Bitcoin exchange-traded funds (ETFs) on January 11, the Ethereum (ETH) community started envisioning a similar investment product of their own. Nevertheless, it is impossible to ignore the months-long back-and-forth that transpired between the institutional players and the US Securities & Exchange Commission (SEC).\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE1XYkM0TkUwM1FjNDBnOEUtRFQ3ZnR6bDl4UVAwZG9qbEZqTWh0WUpzNVdrVkVzWjU2b3JGTElJWTJJT3VLYXc2WnVWOU1IQUl0Vnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "How to bridge to Base - OKX",
        "content": "Blockchains are independent networks that cannot communicate with each other. To address this issue, developers have created blockchain bridges . These bridges enable users to seamlessly transfer their funds between different chains. By facilitating blockchain interoperability, cryptocurrency bridges make the transfer of digital assets even simpler.\n\nBase is an open-source Ethereum Layer 2 (L2) chain incubated within Coinbase using Optimism’s OP Stack. Its roll-up architecture makes it more efficient than Ethereum regarding fees and speed. Moreover, it functions similarly to the Ethereum Virtual Machine (EVM), allowing developers to transfer or set up Ethereum decentralized applications (DApps) without modifying the code. The underlying blockchain also has access to Coinbase's ‌on-ramps and additional services, simplifying the process for beginners to join.\n\nPreparing for bridging: wallet and asset selection\n\nChoosing the right wallet\n\nThe first step before using an Ethereum to Base bridge is to choose the right wallet.\n\nOKX provides a highly secure and multi-chain OKX Web3 Wallet with all OKX accounts. It can safely store BTC or any other cryptocurrency for as long as needed. In addition, the OKX Web3 Wallet features bank-grade security and inbuilt access to hundreds of DApps and the OKX NFT Marketplace .\n\nSelecting assets for bridging\n\nBefore bridging a cryptocurrency from one chain to another, it’s crucial to confirm that the asset is compatible. In this tutorial, we'll be moving ETH from Ethereum to Base. To do this, we only need ETH, as it is the native currency on both chains. ETH is used on both Ethereum and Base for gas fees.\n\nTo successfully bridge a different asset such as USDT, it's important to confirm that Base is compatible with USDT. One simple method to verify its availability in the bridge is to check if USDT is listed as an option. However, also make sure that you have ETH on Base to pay for any gas fees after you bridge the USDT.\n\nExploring bridge services\n\nDecentralized bridge services\n\nOne possible option for securely bridging ETH to Base is through OKX Swap . It combines prices from various decentralized exchanges to suggest the most efficient path, reducing the impact of price differences and transaction costs.\n\nBase also offers its own solution, Base Bridge . However, it supports a limited number of cryptocurrencies and doesn't offer swapping services. Other options you can check out are Meson and Stargate .\n\nCentralized bridge services\n\nOne convenient method for bridging to Base is by using centralized exchanges. This involves depositing your cryptocurrency into OKX using one blockchain and then withdrawing it via a different one. The following is a basic tutorial on how to bridge ETH from Ethereum to Base through OKX Exchange.\n\nStep 1: Create an account on OKX .\n\nStep 2: Once logged in, head to “Assets” on the top-right and click “Deposit.” If you don’t have ETH, you can buy some on OKX and skip the deposit step.\n\nStep 3: Select “ETH” as the crypto and “ETH-ERC20” as the deposit network.\n\nStep 4: Deposit ETH into the address shown, from your Ethereum wallet. It takes a few minutes for the ETH to reach your account and be accessible.\n\nStep 5: Once your funds are ready to be used, go back to “Assets” and click “Withdraw.”\n\nStep 6: Select “ETH” as Crypto and the withdrawal method as “On-chain.”\n\nStep 7: Type in your Base address, and select the network as “ETH-Base.” Enter the amount of ETH you want to bridge to Base and hit next. You’ll be asked to authenticate your account, and the ETH should arrive in your wallet within a few minutes.\n\nOne of the simplest ways to transfer your assets is through an exchange, since you won't have to worry about slippage or network fees.\n\nChoosing a bridge service\n\nYou have the choice between centralized and decentralized cryptocurrency bridges, both of which are effective options. If you opt for decentralized bridges, you can benefit from quicker cross-chain transactions. However, they may have downsides such as steep fees and slippage. It's important to prioritize security when selecting a decentralized bridge and to make sure it has a trustworthy history of protecting assets.\n\nBridging process: a step-by-step guide\n\nTo bridge ETH to Base, you'll need to connect your wallet and transfer the assets. We'll use the OKX Web3 Wallet and OKX Swap for this process. If you prefer to use a different wallet or bridge service, the steps should be similar.\n\nConnecting to a bridge service\n\nStep 1: Head over to OKX Swap .\n\nStep 2: Select \"Connect wallet\" located in the top right corner, then choose \"OKX wallet extension\". If you have a different wallet provider such as Metamask or Phantom, select \"Other\" and choose your desired wallet.\n\nStep 3: Enter the password for your OKX wallet and click on “Confirm” to establish a connection between your OKX wallet and OKX Swap.\n\nTransferring assets to Base\n\nNow you’re connected to OKX Swap, you’re ready to bridge ETH to Base.\n\nStep 1: Set the bridge parameters and the amount of ETH you want to bridge under “Swap and Bridge.”\n\nSelect “Ethereum” as the network and type in the amount of ETH you want to bridge.\n\nSelect “Base” on the “To” network and token, “BASE_ETH.” OKX Swap will automatically show you the amount of ETH you’ll get.\n\nStep 2 (optional): This is an optional step. Only do this if you understand slippage and bridges very well.\n\nNetwork fee: This estimates the network fee to facilitate the blockchain bridging.\n\nSlippage: Slippage refers to the level of flexibility you're comfortable with when it comes to fluctuations in price. By setting the slippage at 0%, OKX swap guarantees a precise receipt of 0.4985 ETH, as indicated. If the price fluctuates at the time of the transaction and OKX is no longer able to guarantee the price shown, the transaction is cancelled. Allowing for some slippage is important when there's a noticeable lack of liquidity.\n\nTrading route: The OKX Swap isn't a bridge, but rather functions as a DeFi aggregator that selects the optimal bridge to Base for you. You have the option to manually modify the service if desired.\n\nStep 3: Click “Swap across chains.” When your wallet shows, confirm the transaction.\n\nOKX Swap offers a user-friendly DeFi solution for transferring and exchanging cryptocurrencies through various bridges.\n\nIn addition, OKX Swap and similar bridges can function as ETH to Base bridges, allowing you to revert. To do so, you must choose Base as the primary network and ETH as the secondary network for the bridging process.\n\nUnderstanding fees and timelines\n\nFee structures explained\n\nThe decentralized bridging process includes various charges:\n\nEthereum gas fees : Since you’re using OKX swap on the Ethereum network, there’s an Ethereum network fee.\n\nBridge fees: The function of OKX Swap is to serve as both a bridge and swap aggregator. A small fee is charged by the bridge to complete the bridging process.\n\nBase transaction fees: Like the Ethereum gas fee, a Base transaction fee is required to transfer ETH from the bridge to your wallet.\n\nConversion fees: There's an extra charge if you switch the cryptocurrency during the bridging process. For example, if you are bridging USDT on Ethereum but wish to have ETH on Base, you have the option to do so, but there will be a fee for converting USDT to ETH.\n\nBefore the transfer, you have the option to view a detailed breakdown of the conversion and bridge fees on OKX Swap. However, the Ethereum gas fee will only be displayed on the OKX Web3 wallet pop-up when you confirm the transaction.\n\nExpected transaction times\n\nSimilar to ‌fees, ‌transaction time is also influenced by various factors:\n\nEthereum confirmation time: The duration for ETH to be transferred from your wallet to the bridge is determined by the amount of gas used. Typically, only a few seconds.\n\nBridge processing time: The amount of time it takes to transfer your asset between chains varies depending on the specific bridge being used. For OKX Swap, this information can be found in the advanced options by selecting the trading route.\n\nBase blockchain confirmation time: The ETH will be transferred to your wallet once the bridging process is finished. Due to Base's fast processing speed, you can expect it to arrive in a matter of seconds.\n\nSecurity measures and best practices\n\nEnsuring secure transactions\n\nWhen using a cryptocurrency bridge, keep in mind that you’re engaging with a smart contract that has access to your wallet. Malicious smart contracts could deplete wallet funds.\n\nMake sure you’re using a trustworthy bridge to Base, such as OKX Swap, which has a longstanding presence in the market.\n\nAvoid using your primary wallet to connect to bridges and decentralized applications. Instead, keep a separate cold wallet specifically for storing your assets.\n\nUse tools like Revoke to revoke access to your wallet once you’re done bridging.\n\nAn effective approach to minimizing these risks is to use a centralized exchange for bridging. OKX is a top cryptocurrency exchange on a global scale, implementing top-notch security protocols to guarantee the safe and seamless buying and selling of cryptocurrencies for users across the world. Visit our security of funds and Proof of Reserves page for more details.\n\nAvoiding common pitfalls\n\nHere are some of the common pitfalls you should avoid while you’re bridging your assets to Base:\n\nBe sure to review all the information you enter before submitting it. Once you’ve confirmed the transaction, you can't undo it.\n\nBe mindful of the gas fees . During periods of high demand and congestion, there's a possibility for Ethereum gas fees to reach alarmingly high levels. It may be best to wait for the fees to decrease or use a centralized exchange for bridging purposes.\n\nHigh slippage and liquidity issues are another aspect to look out for. You may encounter significant slippage when using a relatively unknown or low-liquidity bridge to transfer coins. To prevent this, it's advisable to only bridge assets with a strong level of liquidity.\n\nTroubleshooting and support\n\nCommon bridging issues and solutions\n\nStuck transactions are a common problem. Make sure to set an appropriate gas fee on Ethereum for the transaction to go through. If your gas is too low, the transaction will fail and the funds will be returned to your wallet. Bridge congestion can also cause transactions to get stuck, but cryptocurrency bridges are designed to handle them and will be resolved eventually. Patience is required in these situations.\n\nCross-chain compatibility: Before bridging, always make sure there’s is sufficient liquidity for the asset being bridged and that it’s compatible with the chain.\n\nWhere to seek help\n\nThe cryptocurrency community is extremely supportive. If you encounter any problems, you should be able to find assistance."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPMGpWZGk2NWZVNGVUZUk3N29CYlJSZTVuSVlJdFk1TDdyaEJqdDlCTGRuN1lBRTJkZmFTUDlVQm12ZGFVdnlLSkJvMmU2Sk5uTHJxcnJmR29lWWJfLUF1UDRwMXBKeXBTOXRBUE5ndGJhT05YR2ZLVmswTWtXc2FfQlQwWmpkRXI2c0UtRjJYOFo3S0NSTXdtUC1GaDRSWE43Y3ZkSDJWTjdmRGkxRWozVG05WERxZ3JBR3otVl9vOThmR0RoUHVKOFBHUHNBSTY5Q2ZBaFZTOFRsVnRWckI1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum 2.0 is Here: Bitcoin Minetrix and Chainlink are the Ethereum-Based Altcoins on Early Investors Watch List - TechCabal",
        "content": "Ethereum is now paving the way for sustainable altcoins after its recent upgrade. Ethereum’s blockchain has proven to be one of the most reliable platforms for building decentralised applications and smart contracts. This reputation has prompted numerous developers to leverage the Ethereum platform, crafting their own distinctive cryptocurrencies.\n\n\n\nIn Ethereum’s thriving altcoin ecosystem, two projects stand out: Chainlink, with its decentralised oracle network and Bitcoin Minetrix (BTCMTX), with its novel mining protocol. Both leverage Ethereum’s strengths, but which boasts stronger investor appeal for the future?\n\nEthereum Leading the Way for Environmentally Friendly Altcoins\n\nEthereum has become a go-to platform for various blockchain applications and smart contracts. Offering developers a robust toolkit, it serves as a versatile space for creating and launching diverse blockchain-based projects.\n\nThe Shanghai upgrade to version 2.0 on March 12, 2023, was the next phase for Ethereum. This upgrade not only made the network eco-friendly but also set it apart from other widely used cryptocurrencies that consume substantial energy for mining.\n\nThe latest iteration, Ethereum 2.0, is geared towards making the platform even more scalable, faster and environmentally sustainable.\n\nChainlink: A New-and-Improved Ethereum Platform?\n\nChainlink functions as a decentralised oracle network embedded within the Ethereum blockchain. Its main purpose is to facilitate connections between smart contracts and real-world data, bridging the gap to external APIs.\n\nWith a market capitalisation surpassing $8 billion, Chainlink has gained recognition in the cryptocurrency community, currently holding the 12th position on CoinMarketCap.\n\nKnown for its technological advancements, Chainlink plays a crucial role in supporting decentralised finance (DeFi) applications. By providing secure and reliable data feeds, the platform empowers developers to create DeFi applications without constraints from on-chain data sources. Additionally, Chainlink boasts an active community of developers dedicated to ongoing improvements and innovations on the platform.\n\nBitcoin Minetrix: A Community-centric Crypto with the Technical Power of Ethereum?\n\nBitcoin Minetrix is quickly gaining attention for its innovative “Stake-to-Mine” approach to Bitcoin (BTC) mining. Developed on the Ethereum blockchain, this project presents a user-friendly method for individuals to earn Bitcoin passively, eliminating the need for technical expertise.\n\nThe platform is tailored to make Bitcoin mining more accessible to a broader audience, removing the requirements for expensive hardware and specialised skills. By staking their BTCMTX tokens, users gain access to cloud computing resources, simplifying the entire mining process.\n\nThe project has built a solid reputation rooted in security and transparency. Through Ethereum-compatible wallets like MetaMask, users can easily acquire and stake BTCMTX tokens within the ecosystem.\n\nThe onboarding process involves buying tokens, opting for “buy-and-stake,” and collecting rewards in Bitcoin.\n\nBitcoin Minetrix’s native token, $BTCMTX, is based on the ERC-20 standard, within the Ethereum blockchain. With a total supply limit of 4 billion tokens, the project demonstrates a thoughtful distribution strategy, allocating portions to the presale, marketing activities, staking and community-related projects.\n\nA major benefit of Bitcoin Minetrix is its ability to address typical challenges associated with Bitcoin mining, such as complexity and high entry costs. The token-based system offers a higher level of decentralisation and security compared to standard cloud mining services, reducing barriers for regular crypto enthusiasts.\n\nWhen users stake their tokens, they not only receive “mining credits” for cloud mining power but also enjoy two streams of income: potential staking rewards of up to 87% annually and a share of the mining profits. This dual-revenue model is a significant draw for those interested in both mining and staking in the cryptocurrency space.\n\nWhat Future Users of Web 3.0 Want for DeFi Currency\n\nAs the crypto market continues evolving, users seek sustainable and reliable DeFi currencies. Ethereum’s blockchain platform has proven to be one of the most reliable and eco-friendly platforms for building decentralised applications and smart contracts. Chainlink and Bitcoin Minetrix are two cryptocurrencies that have used Ethereum’s platform to create unique and reliable DeFi currencies.\n\nChainlink’s decentralised oracle network has proven to be a valuable asset for the DeFi ecosystem. Its secure and reliable data feeds allow developers to create DeFi applications not limited by on-chain data sources. Bitcoin Minetrix, on the other hand, offers a unique community-led approach that has proven to be popular among users.\n\nIn conclusion, Chainlink and Bitcoin Minetrix are two of the most promising Ethereum-based cryptocurrencies currently on the market. While Chainlink has an advantage in its focus on decentralisation, Bitcoin Minetrix’s unique features, such as its stake-to-mine feature and strong community governance, make it an attractive investment opportunity for those looking for the next big project.\n\nFor investors seeking dramatic growth, turning attention to presale tokens like Bitcoin Minetrix is a strategic move. The $BTCMTX token holds the promise of potentially soaring 50x – 100x, and with its final presale stage underway, early investors have a prime opportunity to get involved and potentially see significant profits in the coming weeks.\n\nShare this article"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNUGd3MHpQWlFyY3hOWTdXemt5elYzRy01MFZ6TVh5M1EyMEtFMUo5N1Z5STB6ZjYyaHNUcU5WS0ZFSE1kN1R2dU1WUjZNNUtfTkdXQ21MRG9EUUpwUWZPMFZIMVJ3a20zdFlZamduYkhxWEpaR0JPc3hxNDBxUnpGY2Y0T3F3RjTSAZQBQVVfeXFMUHRzQ196cjJucTlCZXhTZnFZMFF3emNaQmhuUEpqSzNjajJBX183YzV4MjJVSlhHTEJqVWp2dFBkWDVROFprZU85U0ZCOUdqMk9zZE5fWk1fY0ZHOHZSVkNTTnZicm1pRHpGMlFwME9xTUktZ2FmQUF6WHRiUVZDUmY3S1p1WWpIc2pNUEE1dEQ5NTFaVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "How to Make Money on Ethereum Gas Fees - Analytics Insight",
        "content": "Ethereum, with its smart contract capabilities and decentralized applications (DApps), has become a powerhouse in the blockchain space. However, one of the challenges that users often face is the cost associated with Ethereum gas fees. Gas fees are transaction fees required to successfully process and validate transactions on the Ethereum network. While they are essential for maintaining the network's security and efficiency, they can sometimes be a source of frustration for users. Nevertheless, savvy individuals have found ways to turn this challenge into an opportunity, exploring various strategies to make money on Ethereum gas fees. In this article, we'll delve into these strategies and provide insights on how you can leverage gas fees to your advantage."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQSmlOU3V4UEhhb3piZ2djZUZ0alZ0VUxvbWZHQTdYeGt3UWpHc3pIS3JnV1I4bmkzVHFYQnpGR2Ruc0Y0SUtDeHd1TWhSU2NKMG1jQ3ZfRlJIZzUyNElPbWRwWDg4ZGtMM2JPVzBLNVhRZlpCdDFESTZxcDZLMTgtOUZWdUFoNE5lZ1hB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "BlockDAG Presale Raises $1 Million In 24 Hour - The Crypto Basic",
        "content": "The crypto world has brought exciting opportunities for investors. Recent news highlights the approval of spot Bitcoin ETFs (BTC), hinting at positive developments for Ethereum ETFs. Ethereum’s (ETH) increased activity and a potential price upswing add to the intrigue. Ripple’s XRP also draws attention with bullish predictions, setting the stage for potential gains.\n\nAmidst these developments, BlockDAG’s (BDAG) impressive $1 million crypto presale success in just 24 hours reflects early investor confidence, signaling a positive outlook for the project. As crypto investment emerges as a promising avenue for wealth creation this year, these success stories offer a compelling start.\n\nEthereum Network Activity Spikes\n\nThe recent approval for spot Bitcoin ETFs has increased optimism regarding the approval of ETH spot ETFs. This surge in interest has translated into heightened daily trading volume and increased buy orders for Ethereum compared to Bitcoin. Ethereum’s on-chain activity has surged, reaching a three-year high of about 1.96 million daily transactions before stabilizing at around 1.28 million. The influx of new Ethereum users has contributed to a decline in exchange Ether supply, signaling a trend towards non-custodial wallets and staking programs.\n\n- Advertisement -\n\nDoes XRP’s Trajectory Lead to $27\n\nErgag Crypto has shared a chart analysis on the X platform, predicting significant gains for Ripple’s XRP. Highlighting a Giant Cup formation in the current state of the asset, Ergag reaffirms his bullish targets, anticipating a move to $1.2, then to $1.6, and setting a new all-time high. The trajectory is expected to continue with price values reaching $7.5, $13, and finally, $27.\n\nEmphasizing the importance of simplicity in analysis, Ergag advises followers to focus on essential aspects rather than getting caught up in complex charts and macro analyses. With a positive trajectory indicated by higher lows against the Cup edge and the formidable ATLAS Line, Ergag expresses confidence in XRP’s performance, noting the $0.55 level as a significant support. Despite potential challenges, he encourages the XRP community to remain steadfast and stay focused on the upward targets.\n\nBlockDAG Network’s Promising Future\n\nBlockDAG Network’s recent success in raising $1 million during its crypto presale in just 24 hours reflects strong early investor confidence. This indicates initial support but also paves the way for continued backing as the project progresses. The successful presale enhances the project’s credibility and sets a positive tone for its long-term success.\n\nThe potential for early supporters to earn significant returns, combined with various income streams, makes BlockDAG an appealing choice for investors with different risk preferences. Backed by a clear roadmap and a confident team, BlockDAG allows investors to participate in its growth and potential impact on the market.\n\nAs a socially conscious cryptocurrency investment, BlockDAG Network appeals to eco-aware investors due to its revolutionary approach to blockchain technology and emphasis on environmental sustainability through an optimized Proof-of-Work consensus process.\n\n- Advertisement -\n\nRide the Crypto Presale Wave\n\nMaking confident decisions is a transformative process that stems from solid self-awareness and a belief in one’s skills and judgment. Recent developments, such as the green light for spot Bitcoin ETFs, have ignited interest in Ethereum, resulting in heightened trading activity and increased on-chain transactions. Additionally, Ripple’s XRP rides on optimistic predictions, emphasizing the importance of simplicity in analysis and setting positive targets. BlockDAG’s impressive success in its crypto presale reflects early investor confidence, hinting at a promising future. Make the decision and join the presale.\n\nJoin BlockDAG Presale:\n\nPresale\n\nWebsite\n\nTelegram\n\nDiscord"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNNkxtUXVzeHNvV0trTlVOOWx3eFJGbW9UOGVZY1Q1V0Z6M1FZQVBaZlYyWDR1amRWY2V6eTdRclhOeWFhRUppX0puS0RldzRrR1dpd0lZRUNYa2I2N3JvT08zNXlhby1xRzIyNDAwTGgwZWhTU2Q1RmZFc1lrU2YxMm96QmJOUdIBkwFBVV95cUxNVTVHdHRpM2tvMUNST25QN2JVclc5QVFBU3BDMHk3cEtYczRSX0tsMG95MVYweEFvVmJhRllySXMwS2EzeVhrZUtjd0ItUmhrSkEtZ3d1VjVYbkViS0w4MTliQ0RieHQtaWthMGg0YmExbEc5T0xmYW15OEgzZkVZVC1HWmpGb2pJZUNqX2FIcVpXc0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "How Do Ethereum Developers Make Money - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTFBZb2NBa3dyLWhqbkVXX1gzVkZGajJJUWd5M2NVTGZwemlJTVpTSFg1MmZNYVV1ckhsWkh3QVRQNGR1WUI0eXlPY0Q1RVl3TzN0R29mOWpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "How to bridge to Polygon - OKX",
        "content": "Getting familiar with cryptocurrency bridging is essential to your crypto journey. If you’re looking for a detailed guide on how to bridge to Polygon, you’ve come to the right place. Let's explore how to bridge ETH to Polygon using Polygon’s portal and OKX Swap. Additionally, we’ll walk through a centralized bridging process using OKX to bridge USDT from Ethereum to Polygon.\n\nIntroduction to Polygon and blockchain bridging\n\nBlockchains are typically isolated systems with their native tokens and can't interact with other chains. Blockchain bridging enables blockchain interoperability and digital asset transfer between multiple chains. With each chain having its own features and applications, users must be able to move across them conveniently. Cryptocurrency bridging refers to the act of moving your funds from one chain to another.\n\nPolygon blockchain is an Ethereum-compatible chain, but faster and more efficient than Ethereum. At any given time, the transaction fee on Polygon is a fraction of what it is on Ethereum. This makes Polygon ideal for various use cases, such as decentralized finance (DeFi), gaming, non-fungible tokens (NFTs), and more. Bridging from Ethereum and other chains to Polygon is essential to get into the Polygon ecosystem.\n\nPreparing for bridging: wallet and asset selection\n\nChoosing the right wallet\n\nThe first step before using an ETH to Polygon bridge is to choose the right wallet .\n\nThe OKX Web3 Wallet offered by OKX is known for its strong security measures and ability to support multiple cryptocurrency chains. This wallet can securely hold BTC and any other digital currencies for an indefinite period of time. It also boasts bank-level security and allows users to easily access a variety of decentralized applications (DApps) and the OKX NFT Marketplace .\n\nSelecting assets for bridging\n\nWhen you’re looking to bridge assets from one chain to another, you must make sure you have the native assets on both bridges. Transferring from Ethereum to Polygon requires ETH to complete the initial transaction. MATIC is the native token of Polygon. While you don’t need MATIC to bridge your assets, you still need it to use your bridged asset on the Polygon blockchain.\n\nNext, you must decide on the digital asset you’re transferring and make sure it’s supported on both chains. One easy way to do this is to check for the supported assets on the bridge of your choice before cryptocurrency bridging.\n\nExploring bridge services\n\nDecentralized bridge services\n\nThe most common method of cryptocurrency bridging is to use decentralized bridges. Polygon Portal is a popular ETH to Polygon bridge built by the Polygon Foundation and is a safe blockchain bridge to use. Other popular polygon bridging providers include Allbridge and Wormhole . They’re good options if you’re looking for advanced controls.\n\nAnother option is OKX Swap , which allows you to swap and bridge assets across multiple chains. OKX collects prices from numerous decentralized exchanges to provide the most efficient path, reducing both slippage and fees.\n\nCentralized bridge services\n\nA straightforward way to bridge assets is using centralized exchanges. You can deposit your assets to OKX using one chain and withdraw them using another. Here’s a simple guide to bridging USDT from Ethereum to Polygon using OKX.\n\nStep 1: Create an account on OKX .\n\nStep 2: Once logged in, head to “Assets” on the top-right and select “Deposit.” If you don’t already have USDT, you can buy some on OKX.\n\nStep 3: Select “USDT” as the crypto and “USDT-ERC20” as the deposit network.\n\nStep 4: Deposit USDT into the address shown in your Ethereum Wallet. It takes a few minutes for the USDT to reach your account and be accessible.\n\nStep 5: Return to the \"Assets\" section after your funds become available and select \"Withdraw.”\n\nStep 6: Choose \"USDT\" as the cryptocurrency and opt for the \"On-chain\" withdrawal option.\n\nStep 7: Type in your Polygon address, and select the network as “USDT-Polygon.” Enter the amount of USDT you want to bridge to Polygon and hit next. You’ll be asked to authenticate your account, and the USDT should arrive in your wallet within a few minutes.\n\nOne of the simplest ways to bridge your assets is by using an exchange, since you won't have to worry about slippage or network fees.\n\nBridging process: a step-by-step guide\n\nLet’s now walk through the process of bridging ETH from Ethereum to Polygon. We’ll use Polygon Portal as the ETH to Polygon bridge for this and the OKX Web3 Wallet, which we previously set up. Next, we’ll also explore how we can perform decentralized bridging on OKX Swap.\n\nConnecting to a bridge service\n\nStep 1: Head over to Polygon Portal .\n\nStep 2: Click “Connect Wallet” in the top-right corner and select OKX Wallet.\n\nStep 3: Type in the password for your OKX wallet and select “Confirm” to allow Polygon Portal to connect with your wallet.\n\nTransferring assets to Polygon\n\nNow that you’re connected to Polygon Portal, you're ready to bridge your Ethereum.\n\nStep 1: Click on “Bridge” on the left.\n\nStep 2: Fill in the bridge details. There are a few fields here that you need to fill in carefully. Let's break them down:\n\nTransfer from: The chain you are transferring from. In this case, Ethereum. Token: Select the token you want to transfer. We’re going to select ETH here. Amount: Type in the amount of ETH you want to transfer from Ethereum to Polygon. Transfer to: Select Polygon POS since this is the chain we’re bridging our ETH to. Refuel gas: Polygon's native currency is MATIC, and refuel acts as an ETH to MATIC bridge. It's optional for the bridge to go through. However, you need it to interact with your bridged ETH. Turn it on and select the amount of MATIC you want if you have none. It can also be considered a MATIC Bridge since you’re converting a part of Ethereum’s native currency to Polygon’s native currency.\n\nStep 3: After filling in and selecting all the fields, select “Bridge ETH to Polygon POS.”\n\nStep 4: OKX Wallet is shown with the details of your transaction. Confirm it once again and hit “Confirm.”\n\nPolygon Portal or any other bridges can also do the reverse and act as Polygon to ETH bridges if required. Note that to do so, you must select Polygon POS as the first chain and Ethereum as the second.\n\nBridge ETH to Polygon on OKX Swap\n\nOKX swap is a decentralized cross-chain swap and bridge aggregator. OKX itself isn't performing the bridging here. Instead, OKX sources the best price across multiple bridges and moves your crypto.\n\nStep 1: Head over to OKX Swap and connect your wallet. The process is the same as connecting your wallet to Polygon Portal above.\n\nStep 2: Set the parameters under “Swap and Bridge”:\n\nSet the first chain as “Ethereum” and type in the amount of ETH you want to bridge. Set the second chain as “Polygon” and the coin as “WETH.” OKX automatically shows you how much WETH you’d be receiving here.\n\nStep 3 (optional): Click on the small arrow next to the rate to expand the menu. This is an advanced option — you don’t have to change anything here. If you’re sure about what you’re doing, you can manually adjust the slippage and change the trading route.\n\nStep 4: Click “Swap across chains.” When your wallet pops up, confirm the transaction.\n\nOKX Swap is a user-friendly DeFi solution for transferring your cryptocurrencies across chains and exchanging them during the process.\n\nUnderstanding fees and timelines\n\nFee structures explained\n\nThere are multiple fees involved in a decentralized bridging process:\n\nEthereum gas fees : To send your ETH and use the Polygon Portal bridge, you're required to pay a transaction fee to the Ethereum network.\n\nPolygon Portal fees: Since Polygon Portal is providing the service of bridging your ETH from Ethereum to Polygon, a small fee is involved.\n\nPolygon transaction fees: Similar to the Ethereum gas fee, a polygon transaction fee is taken to facilitate the transaction of ETH from the bridge to your wallet.\n\nConversion fees: Some assets aren't native to the blockchain. This includes ETH on Polygon. The ETH is converted to Wrapped ETH (WETH) and deposited into your wallet. WETH is pegged to the price of ETH and enables the seamless transfer of assets between chains. There's a small fee involved in the conversion of ETH to WETH.\n\nBefore transferring, you can get a breakdown of the conversion and bridge fees on Polygon Portal. However, the Ethereum gas fee is only shown on the OKX wallet pop-up before you confirm the transaction.\n\nExpected transaction times\n\nJust like the fees, the transaction time also depends on multiple factors:\n\nEthereum confirmation time: This is your ETH's time to move from your wallet to the bridge. If you use enough gas, this should take a few seconds.\n\nBridge processing time: This is how long the bridge would take to move your asset from one chain to another. It changes from bridge to bridge. In the case of Polygon Portal, you can see it below the confirmation button before you bridge. This is only an estimation and could take longer if lots of people are using the bridge at the same time.\n\nPolygon blockchain confirmation time: The WETH must come to your wallet once the bridging is complete. Since Polygon is very fast, it should reach your wallet in a few seconds.\n\nSecurity measures and best practices\n\nKeeping transactions secure\n\nCryptocurrency bridges are powered by smart contracts that have access to the funds in your wallet. Unfortunately, wallet funds can be depleted using rouge smart contracts. We recommend the following for secure crypto transactions on bridges:\n\nMake sure you’re using a reputable bridge service like Polygon Portal, which has been in the market for a long time.\n\nAvoid using your primary wallet to engage with bridges and other DApps. Instead, use a separate cold wallet for this purpose.\n\nAfter bridging, make use of tools such as Revoke to remove access to your wallet.\n\nA potential solution to reduce these risks could be using a centralized exchange. As a leading global cryptocurrency exchange, OKX employs world-class security measures to enable users worldwide to buy and sell crypto safely and seamlessly. Visit our security of funds and Proof of Reserves page for more details.\n\nAvoiding common pitfalls\n\nHere are some of the common pitfalls you can avoid while you’re bridging your assets to Polygon:\n\nMake sure to review all the information you enter before submitting it. Once you confirm the transaction, it can't be reversed.\n\nPlease keep in mind the gas fees , as they can become relatively expensive on Ethereum during periods of high network traffic. Consider waiting for the fees to decrease, or use a centralized exchange to make the transfer.\n\nAnother factor to consider is potential slippage and liquidity concerns. Using a less popular bridge or bridging to a coin with limited liquidity may result in higher slippage. It’s best to bridge assets with good liquidity to prevent this.\n\nTroubleshooting and support\n\nCommon bridging issues and solutions\n\nOne common problem encountered by users is transactions that become stuck. The only factor you can influence is the gas fee for Ethereum, which must be set correctly for the transaction to be successful. The transaction will fail if the gas fee is insufficient, and the funds will be returned to your wallet. Transactions can also get stuck when the bridge is congested. Fortunately, cryptocurrency bridges are designed to handle these situations and will eventually be resolved. It may just take longer, so it’s wise to be patient.\n\nCross-chain compatibility: Before bridging, always make sure there’s sufficient liquidity for the asset being bridged and that it can be used on the designated chain.\n\nWhere to seek help\n\nThe cryptocurrency community is incredibly supportive, and if you encounter any problems, you can count on finding assistance."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPY09ONDM3c3ZkcGdEZzBtMkExeWtadTdoY2pXeXB3WVM5bDZWMkI0eGh5azBzWFRrLWhqRjFkdXprb0huN09SUFFHakxVeWhfXzJVRF9tZ2tzbUxNWWhpVThUQWJGX3BDQkNhcnpEUUctOWt6WFowb2NtMU5ybnlNR1B0NENJNXNDSHcwWF9Fa1VTaHg0TkVXbGx0bzllX0JrLV9vRlEycUhjZjZPU21lTFp4OGt4c0FHZ1k4U0RhLTZyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF approval unlikely soon; Aave and InQubeta eye explosive growth opportunities - Cyprus Mail",
        "content": "The recent launch of spot ETFs has sent the crypto sector into a tizzy. The Bitcoin ETFs were launched in January following approval from the US Securities Exchange Commission.\n\nFollowing their launch, there has been speculation that Ethereum (ETH) ETFs are next in line. However, many analysts think it could be a while before Ethereum ETFs see the light of the day. Some experts believe that regulatory concerns and key decisions on ETF acceptance criteria could delay the decisions on Ethereum ETFs.\n\nAt the same time, the market has been seeing burgeoning investor interest in InQubeta (QUBE) and Aave (AAVE). While Aave is a decentralized protocol for buying, selling, and swapping cryptocurrencies, InQubeta is a fundraising platform for startups working in artificial intelligence (AI).\n\nInQubeta’s presale success has been particularly impressive. The platform’s presale funding currently stands at $8.4 million.\n\nInQubeta: A game changer for the AI startup space\n\nInQubeta is a startup-friendly platform where innovators can raise funds for AI-based projects and find resources to grow their businesses. The startups onboarded by the team are screened to check how well their goals fit within the platform’s vision. It also assures investors that they are backing a legitimate project that seeks to build the future of AI.\n\nA key pillar of InQubeta’s investment model is its native cryptocurrency, the QUBE token. Apart from serving as a mode of payment on the network, the QUBE token helps with implementing a decentralized governance system.\n\nThe combination of decentralization, a deflationary model, and code architecture, make InQubeta one of the best altcoins to buy now.\n\nThe token can also be staked to earn consistent passive income. Staked assets promote a blockchain’s growth by boosting liquidity. The token owners are given rewards throughout the staking period. To ensure uninterrupted rewards for stakers, the team uses on-chain tax collections to maintain a separate reward pool.\n\nRegarding decision-making, it’s a team effort in InQuebeta’s case. Every new feature or protocol decision is first discussed among community members and then put to a vote. Token holders use their voting privileges to participate in the process which decides whether the suggested change will be implemented.\n\nPayPal eyes integration of its stablecoin with Aave\n\nAave is a non-custodial protocol where crypto users can sell, purchase, and stake their crypto assets. Hailed as one of the best crypto investments of 2024, crypto users can also lend and borrow assets on the platform.\n\nAll these services are powered by the platform’s native token AAVE. Token holders can also participate in its governance by voting for proposals and protocol upgrades.\n\nAave’s strong growth in the recent past has bolstered its prospects and ratings. Experts monitoring market trends suggest that the AAVE token is moving towards bullish territory and its patrons should consider accumulating their holdings.\n\nIn a related development, the team behind PayPal’s stablecoin PayPal USD is believed to be exploring an integration with Aave. The move is expected to ramp up PayPal USD’s reach and help it explore opportunities in a more liquidity-rich ecosystem.\n\nThe aggregate sum of TVL of Ethereum blockchains crosses $20 billion\n\nEthereum is regarded as one of the best cryptos available in the sector due to its versatility. The popular blockchain network can be used for creating blockchains, cryptocurrencies, and NFTs, among other DeFi solutions. All transactions in terms of its native token ETH are confirmed with the proof-of-stake consensus protocol.\n\nGiven the craze around Bitcoin ETFs and Ethereum’s northward movement, crypto enthusiasts expect Ether ETFs to be next in line. However, as per veteran analysts, it might be unlikely for Ethereum ETFs to debut any time soon due to delays in regulatory approvals.\n\nNevertheless, these experts haven’t changed their opinion about Ethereum and consider it a good crypto to buy.\n\nThe blockchain was recently in the news after the aggregated sum of Total Value Locked in Ethereum Layer 2 networks surged past all non-Ethereum chains in 2024.\n\nAccording to the observations by Ethereum Foundation contributor Josh Stark, on January 4, 2024, the aggregated TVL of Ethereum L2 blockchains was $20.7 billion while that of non-Ethereum networks was $19.6 billion.\n\nConclusion\n\nAs the crypto market matures, people are looking for top crypto coins that could not just boost their portfolio but also fetch them long-term gains. InQubeta, Ethereum, and Aave are good options to consider because they sport a high growth potential with a utility-centric model.\n\nToken holders can enjoy seamless user journeys along with the benefits of a diversified portfolio. Using decentralization, they have created thriving communities that are encouraged to participate in operations and shape their platforms’ growth trajectory.\n\nVisit InQubeta Presale\n\nDISCLAIMER – “Views Expressed Disclaimer: Views and opinions expressed are those of the authors and do not reflect the official position of any other author, agency, organization, employer or company, including NEO CYMED PUBLISHING LIMITED, which is the publishing company performing under the name Cyprus-Mail…more"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOWXpnckppcnVMb2tlUGFNckVYV0x1WjVkN0tvdmhtVlQtVDM5Q281VHdQLTZwUDFGbVVkR05zOXZXMG01cWIzSzZBT2hOMk5VRnJUZko2YnZsMHBFQllYU3NyR19rSGxEazVIWkt1eHN6d2RJSDAtQ1hLeUFtYkdURTVZaDBtX20tSmFpN2NZMG1WcTMwTHNCMU1hd2FKV2czR0hvM2JWZEp5SjA0N1NObXp2aW9xQmMyaGcwOGdHQzU5RnPSAcMBQVVfeXFMTll6Z3JKaXJ1TG9rZVBhTXJFWFdMdVo1ZDdLb3ZobVZULVQzOUNvNVR3UC02cFAxRm1VZEdOczl2VzBtNXFiM0s2QU9oTjJOVUZyVGZKNmJ2bDBwRUJZWFNzckdfa0hsRGs1SFpLdXhzendkSUgwLUNYS3lBbWJHVEU1WWgwbV9tLUphaTdjWTBtVnEzMExzQjFNYXdhSldnM0dIbzNiVmRKeUowNDdTTm16dmlvcUJjMmhnMDhnR0M1OUZz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "#CryptoExplained: Crossing the Chasm: U.S. Bitcoin Spot ETFs Usher in a New Era of Crypto Adoption - Rolling Stone India",
        "content": "The introduction of US Bitcoin spot ETFs marks a pivotal moment in the journey toward cryptocurrency acceptance. In an earlier article, I emphasized the significance of the product adoption curve. With the United States Securities and Exchange Commission (SEC) approval of the US spot Bitcoin ETFs, it is evident that crypto has successfully navigated the chasm phase of the curve and is now entering the realm of the early majority. On average the gains of new entrants forming the early majority, will likely be less than those of the early adopters, but they will still beat the broader market as adoption of crypto continues to increase.\n\nPhoto: Wikimeida Commons\n\nAnticipations are high that, over the coming months, traditional investors will channel substantial funds into the cryptocurrency market via spot ETFs and derivatives. This influx is expected to lead to a steady increase in cryptocurrency values. Additionally, the impending Bitcoin halving in April is poised to further fuel this upward trend by slicing the daily supply of Bitcoin in half.\n\nYet, it’s Ethereum that seems poised to reap the most significant rewards from the Bitcoin ETF approvals. As the second-largest cryptocurrency by market capitalization and the premier protocol in terms of total value locked, Ethereum has experienced more substantial gains than Bitcoin since the ETF approvals. Several factors contribute to this. Firstly, Ethereum is expected to benefit from the Bitcoin halving and the anticipation surrounding the forthcoming Ethereum ETF in May. Secondly, Ethereum’s inherent utility as a smart contract platform, its capped supply, and ongoing enhancements aimed at boosting its efficiency and accessibility, position it as the preferred infrastructure for global digital assets.\n\nLooking ahead, the Ethereum ETF, expected to launch in May, is set to solidify Ethereum’s status as a frontrunner in the digital asset sphere. This ETF will draw in conventional investors seeking diverse exposure in the cryptocurrency market and spotlight Ethereum’s distinct features, such as its smart contract functionality and progressive upgrades aimed at improving scalability and performance.\n\nAs the cryptocurrency landscape evolves, the relationship between Bitcoin and Ethereum will undoubtedly be compelling to observe. Bitcoin’s spot ETF is a significant step towards broader crypto acceptance, but Ethereum’s utility and technological progress establish it as an indispensable player in the digital asset infrastructure. The advent of spot ETFs represents a critical milestone, signifying the maturation of the cryptocurrency market and its integration into conventional financial systems.\n\nTo sum up, the launch of the US spot Bitcoin ETF is a transformative event for the cryptocurrency industry, heralding a shift towards mainstream adoption. However, Ethereum is likely to be the primary beneficiary in the forthcoming months, propelled by its robust infrastructure, the anticipated ETF, and the growing recognition of the value of utility and technological innovation in the cryptocurrency sector. Moving forward, the interplay between these dominant cryptocurrencies and the wider financial ecosystem will undoubtedly shape the future of digital assets and global finance."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMigAJBVV95cUxQemNlQjJ0QXpuR1BmdkEtSlhWR3FoTm8wUmdiTGVUZ2tPY0FrSmNvNWVXMUoxdmlTSTR2MnMwYW5mMTlzV3ZPNDBKWDN2bWdGeDZjaGZnOF9xS1NsSF94UEttSzhtSmJqWDZpOVRpOUpqLWIwZ0pva01DRlFWS28zYnNQc01pOTYtTTFxZjVmbk5zdzRJMTA5MjFZZGkyYUpVYzVndEJOaEdfWXdVQmJETzhoOF8yeGpSdXl4Y1pVSUJLQi1KckI4TDh0VkpPNWJSV0doSWJNcDFocE1FQ21tZkFLSUlfcmQtamg0NUEtNTRHeWZ6RE9CLTdlaEFyWUhn0gGAAkFVX3lxTFB6Y2VCMnRBem5HUGZ2QS1KWFZHcWhObzBSZ2JMZVRna09jQWtKY281ZVcxSjF2aVNJNHYyczBhbmYxOXNXdk80MEpYM3ZtZ0Z4NmNoZmc4X3FLU2xIX3hQS21LOG1KYmpYNmk5VGk5SmotYjBnSm9rTUNGUVZLbzNic1BzTWk5Ni1NMXFmNWZuTnN3NEkxMDkyMVlkaTJhSlVjNWd0Qk5oR19Zd1VCYkRPOGg4XzJ4alJ1eXhjWlVJQktCLUpyQjhMOHRWSk81YlJXR2hJYk1wMWhwTUVDbW1mQUtJSV9yZC1qaDQ1QS01NEd5ZnpET0ItN2VoQXJZSGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Crypto Bull Run Coins: Top Cryptos to Buy Before the Bull Run Featuring ApeMax, Celestia, Chainlink, Solana, Ethereum, Bitcoin, and Dogecoin - - Disrupt Africa",
        "content": "The crypto world is buzzing with excitement and anticipation for a possible crypto bull run in 2024 with the recent approval of spot Bitcoin ETFs and the upcoming Bitcoin halving event. In the crypto market, there’s a ripple effect, where Bitcoin’s movements influence other digital tokens.\n\nThis article, compiled from different Web3 news sources and official altcoin project websites, takes a closer look at the top cryptocurrencies to buy before the anticipated bull run. It specifically highlights ApeMax and its innovative “Boost-to-Earn” feature, along with well-known tokens such as Solana, Chainlink, Ethereum, and more.\n\nTop Cryptos to Buy Before the Bull Run\n\nApeMax (APEMAX)\n\nApeMax has emerged as a standout altcoin with its revolutionary “Boost-to-Earn” staking mechanism, where buyers can boost their preferred entities and possibly earn rewards in the process. In its ongoing presale, ApeMax provides token holders immediate access to their purchased tokens.\n\nThe ApeMax presale is gaining significant momentum, attracting over 9,900 token holders. Eligible buyers can also get discounts through Early Bird Loot Boxes for a limited time, further enhancing the appeal of ApeMax in the market.\n\nCelestia (TIA)\n\nCelestia distinguishes itself as an innovative blockchain incorporating rollups and zero-knowledge (ZK) solutions. TIA addresses scalability and privacy concerns within the crypto space, boasting a substantial market cap of $2.7 billion.\n\nChainlink (LINK)\n\nOperating as a robust oracle network, Chainlink plays a crucial role in connecting blockchain contracts with real-world data. Widely adopted and deeply integrated with decentralized finance (DeFi) protocols, Chainlink remains a key player in the evolving blockchain landscape.\n\nSolana (SOL)\n\nPositioned as the “Ethereum rival”, Solana, a third-generation blockchain platform, utilizes Proof of Stake (PoS) and Proof of History (PoH) mechanisms to deliver efficient smart contract functionality. Solana is known for its high speeds, low costs, and overall efficiency.\n\nEthereum (ETH)\n\nMaintaining its position as the second-largest cryptocurrency by market capitalization, Ethereum continues to lead the smart contract revolution. Ethereum’s robust infrastructure supports decentralized applications (DApps) and smart contracts, with the NFT and Web3 gaming sectors sustaining its relevance.\n\nBitcoin (BTC)\n\nAs the mother of all cryptocurrencies, Bitcoin remains the digital gold standard, characterized by unparalleled security and decentralization. Despite recent developments surrounding Bitcoin, the pioneer crypto has recently dipped below $42,000.\n\nDogecoin (DOGE)\n\nA pioneer in the meme coin category, Dogecoin, was launched in 2013 and gained popularity with its unique branding. Despite fluctuations in value, DOGE continues to be a significant player in the meme coin market, fueled by attention from influential Web2 and Web3 figures.\n\nWhen is the Crypto Bull Run?\n\nSeveral factors point to the possible commencement of the next crypto bull run in 2024, including the recent approval of spot Bitcoin ETFs and the upcoming Bitcoin halving event. However, there is too much uncertainty and market volatility to predict if and when a crypto bull run will take place.\n\nWhy Should You Consider ApeMax?\n\nWith distinctive features, a user-friendly interface, and the innovative “Boost-to-Earn” mechanism, ApeMax stands out in the market. The daily increasing presale rate and discounted loot boxes, making ApeMax an exciting new coin.0\n\nClosing Thoughts on the Top Cryptos to Buy before the Bull Run\n\nThis article sheds light on the hot trending crypto coins to consider before a crypto bull run, a period where market confidence is at a high and prices of some crypto coins rise. This article delved into various exciting crypto coins, like Celestia, Solana, and ApeMax with its unique “Boost-to-Earn” staking mechanism.\n\nWhile the highlighted coins presented are interesting, it is essential to acknowledge the associated risks with altcoins and cryptocurrencies. Doing thorough research is important before engaging with any cryptocurrency. This article does not offer financial advice.\n\nFor readers intrigued by ApeMax, visit the official ApeMax website to review eligibility rules and other purchasing conditions before buying tokens."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxPQ0dSUVByZmxqOWhDMlBBYi1FbkkzZ2pTeUZpS0JGMjQ5aDFUdkY3UHJZcEJRSXhQTVQwc0p0MjVvRGROd0MwcV96VUNuNXI1VDN0YVdfQVltMDNOMVRtQ09NSTk2XzVJV21xMmJGUU1UZE12dl82TW1NUDV6QnBMc3lvTU5odEdVTHhxbURnNWpxc253eGlTTVMzdTN4Y2xpM08weEl6NlNVRFJEN3dnelplbXpKNGU4WklpOUEwQjZKWk5yWTR2bTlNV25nWTBNd1IwVlZ0dHNLQWRseDVJRVNLQWkyWGd5Y2lIOGt4dmFzVXdFdXRFetIB_gFBVV95cUxNM2lWZ1RqNkpRTGZRMWVlY0ktX2RkeG1ybVlEeWtUM1c5dl9uMVcwZGpIZ2pBNmpNd3ppUEcwYmJaQ0JLT2x5VXVqZ0dXYXRzdnZWVjhwUW1VMVdlaGZmQTFtRU9kTFRrczlDb1MyUlpPdThaRjFTa3J6aWdYZlZ6WGd0Rk1MeDNfUHZOQjRTcFRDTGFHZlZFUFNFYlNtVnR0emxhNzd0MmVpU2kxRUFHSm0wU2JPYXE3VmpyTXh2QWdOV3hkZ1dUV0x5VUROM0IwUE5tY0oxNzhscy16VkdxbnVSUTNYRkxyVXM2VnFQSTRwWGFhcktnbzlxWEloZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $40,000, Global Market Cap In Freefall - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, slipped below the $40,000 mark early Wednesday, continuing its recent spell of slump. Other top coins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the reds across the board. The AKT token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 14 percent. ORDI became the biggest loser, with a 24-hour dip of over 15 percent.\n\nThe global crypto market cap stood at $1.54 trillion at the time of writing, registering a 24-hour dip of 2.32 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $39,671.24, registering a 24-hour loss of 1.03 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 35.27 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,214.95, marking a 24-hour dip of 5.61 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.97 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 3.29 percent, as per CoinMarketCap data, currently priced at $0.07839. As per WazirX, Dogecoin price in India stood at Rs 7.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 4.54 percent. At the time of writing, it was trading at $65.03. LTC price in India stood at Rs 5,659.36.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5156, seeing a 24-hour loss of 2.83 percent. As per WazirX, Ripple price stood at Rs 45.50.\n\nSolana (SOL) Price Today\n\nSolana price stood at $83.86, marking a 24-hour dip of 2.05 percent. As per WazirX, SOL price in India stood at Rs 7,498.98.\n\nTop Crypto Gainers Today (January 24)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nAkash Network (AKT)\n\nPrice: $2.76\n\n24-hour gain: 14.28 percent\n\nBlur (BLUR)\n\nPrice: 0.668\n\n24-hour gain: 8.69 percent\n\nSui (SUI)\n\nPrice: $1.17\n\n24-hour gain: 5.69 percent\n\nSei (SEI)\n\nPrice: $0.6376\n\n24-hour gain: 4.63 percent\n\nAptos (APT)\n\nPrice: $8.65\n\n24-hour gain: 3.97 percent\n\nTop Crypto Losers Today (January 24)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nORDI (ORDI)\n\nPrice: $53.68\n\n24-hour loss: 15.35 percent\n\nSATS (1000SATS)\n\nPrice: $0.0004319\n\n24-hour loss: 12.81 percent\n\nOKB (OKB)\n\nPrice: $47.37\n\n24-hour loss: 9.56 percent\n\nPyth Network (PYTH)\n\nPrice: $0.3679\n\n24-hour loss: 8.98 percent\n\nKava (KAVA)\n\nPrice: $0.6815\n\n24-hour loss: 8.12 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin remains below the critical threshold of $40,000, currently undergoing correction at $39,700 after a recent dip. The existing trading level could witness increased buying, given the support at $38,500. In case of a support breakdown, the next support level is expected at $37,800, while upward resistance is identified at $40,350.”\n\nCoinSwitch Markets Desk noted, “BTC seems to have found the first level of strong support at $38.5k as a two-week-long sell-off post-ETF approval continues to keep new crypto investors from participating. It is worth noting that the next big support for BTC lies directly around the $32k mark so it is very important for the bulls to hold the $38.5k mark. While investors are turning fearful for the Bitcoin support to not hold with more than 300 million dollars worth of liquidations in the last 24 hours as per the data from Coinglass, a U-shaped recovery to take Bitcoin back to nearing $50k should is still a possibility.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin encountered a significant drop, breaching the $40,000 threshold and briefly reaching $39,500, attributed to notable sales influenced by the Grayscale GBTC Bitcoin ETF. This decline raises concerns about a potential descent to $38,000. In parallel, Ethereum grappled with its bearish momentum, experiencing a nearly 3% drop to $2,347 in 24 hours. This market movement unfolds amid a larger context where Bitcoin has seen a 20% decline post-major ETF launches by BlackRock and Fidelity. The downturn pressured Bitcoin miners with low transaction fees while institutional players strategically accumulated BTC, impacting short-term dynamics. Google Bard's AI hints at a possible further decline to $35,000, considering inflation, interest rates, and regulatory factors. Investors navigate cautiously as Bitcoin hovers just under $39,000, indicating potential price oscillation between $35,000 and $45,000.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The crypto market continues to witness selling pressure as Bitcoin ETFs have made entry and exit into the investment vehicle very easy. Users may have liquidated their positions to book profits and created new positions anticipating the next rally. Bitcoin and Ether dropped by roughly 1% and 6% respectively which resulted in a 2.14% drop in the overall crypto market cap. The next market mover can be the rate cut announcement by the US Fed which it signalled at the end of 2023.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, the crypto market witnessed a decline, with BTC and ETH experiencing sharp drops. Although BTC managed to recover and close in the green, ETH remained weaker, influenced by panic selling triggered by news of GBTC ETFs selling. Technically, BTC found support at the 100 EMA D, a positive sign if it continues to rise from this level. ETH, on the other hand, is at a key support level but is yet to show signs of recovery. Critical support levels for ETH include $2,170, $2,125, and a notable support coinciding with the 200 EMA D at $2,016.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxOV0FTMHEtamdEVFlWYVJiWEFXbWZKa0dFSXhsbkFxZ0FsUldZd3hzZS0wa2JhZThpY2YtTjBIOE8xTzRkNENGMlhHNnBKeUhPNkVnZVlXTzY5eFlHWlJpZGI0Uk80XzhWckhQQUt4c3AzV3BPQmE4VnNkaHYwb0pSUWtHOTliM29fSTVtdGVMSlhwUkNNS1NtbVZ3eVlSYW9kU2NCcFdOSmdod3RwNjNvNktNaEFEaFNkcGVJd1Q3ZGJjaWNBZHZKSkFJM0RyOFBzdTRuSFQtVUNNVms3TGZMUTZ0aFR6LTg4Znd1Sk45MGcwMTFwYUhPeTMwb19nTHFENXhFZ2xqak1keGJMVmVUSdIBngJBVV95cUxQajE3WkVzN0NPQUxPSnJrSXQyLVBHdUdGYko3UllUZWVhU1l5SlFxZElHM0Q4aGhVRXZoczRhSTA3ZDlBZFl6dF9kcDE3LXFVTlExZk43NElOX2ZTZml0RzZQUnRhMnFXS2lucGw2bGlUcGxDV3JMRXFWNW0xWENzSERBTG1SRnhVeTVDLWlKdEcxMm82MVFSZXRvU0ppVDlZR3BRZVdXUklzYmRPVm9Ock9WVmJwR3owM2Rud1h6UmtUNTlqNmdzZVhrOS11QzV1R0pxcUt4LXZya2pncEVrVElUZ0NWRllya0dBaTMxWThGbEtBYVlqRTB3NW1TWE9WdDlxVEgwX2RoUlpfQklxMDNZdUhqYTZJaDJRRVhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Will Bitcoin Rise Again? Best Altcoins To Buy Now In The Crypto Dip Before The Bull Run Featuring Apemax, Polygon, Celestia, Ethereum, Polkadot, Sei - Analytics Insight",
        "content": "Polkadot is a blockchain interoperability platform that allows different blockchains to communicate with each other. Polkadot uses a unique sharded architecture that allows it to scale to many transactions. Polkadot is still under development, but it has the potential to play a major role in the future of blockchain technology."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE54YU9aczh6MlVmU1BtV2xrSkxLdXFmeEd6UUE1WEZ6MEVkWjNKN0VrbV9DMUVDZXREa21TdXMta0NYUmZMQ0trMU5qMXFFRS1INHJVMm54YzY2eU1nME1JU29yOTZNSDRoWFHSAW9BVV95cUxPaDdMWWlBOFM4WWVleUNmRmRreV8wcFFpcThtZk1vbFhUbXItVi13UXNuMGE3bWxENWl5TWRIS05iMFptTG5zUlQyLUhwemlvLXM4QVNxRThlblp6VW9USl91bmhnRTZHQnFxcXN2Q00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "AXS Mobile App Users Can Pay Bills Using Cryptocurrencies Such As Bitcoin & Ethereum - MS News",
        "content": "AXS Mobile App Lets Users Pay Bills With Popular Cryptocurrencies\n\nOn 23 Jan, AXS announced in a press release that customers using its mobile app can now pay bills using popular cryptocurrencies.\n\nThrough a partnership with cryptocurrency payment firm Triple-A, AXS has made the option available for 550 of its 600 services.\n\nUsers can choose to make the payment via four currencies: Bitcoin, Ethereum, Tether or USD Coin.\n\nPay bills using cryptocurrencies on AXS app\n\nAccording to a press release on Tuesday (23 Jan), AXS revealed it has partnered with Triple-A to enable users to pay their bills in four digital currencies — Bitcoin, Ethereum, Tether or USD Coin.\n\nThe option is only available for 550 out of 600 AXS services, not for the 50 services covering credit cards and bank loans, reported The Straits Times (ST).\n\nAXS app users can thus top-up or pay recurring bills such as road taxes.\n\nTriple-A acts as a gateway that receives the payment before converting the cryptocurrency into Singapore Dollars (SGD) and crediting it into AXS’ bank account.\n\nFor now, the option to pay using crypto is only available on the AXS mobile app.\n\nIn a Facebook post revealing the new payment method, AXS said that customers will be charged a 2% service fee upfront.\n\nAccording to ST, AXS and Triple-A aim to introduce the service to the 650 AXS machines across Singapore. They also target its release on the AXS website by Q2 2024.\n\nPayment option increases efficiency\n\nAXS Services CEO Chin Mun Chung said the collaboration will allow the firm to cater to users’ evolving preferences.\n\n“This partnership reinforces AXS’ position as a forward-thinking and customer-centric payment solution provider, ensuring that our users enjoy utmost flexibility in their financial transactions,” he said.\n\nIn addition, Triple-A CEO Eric Barbier noted that the mode of payment comes with newfound efficiency.\n\nHe said that the collaboration with AXS will offer users more convenience and choice when paying their bills.\n\n“By accepting digital currencies, AXS can enjoy reduced processing times and fees,” he explained.\n\nHave news you must share? Get in touch with us via email at news@mustsharenews.com.\n\nFeatured image adapted from AXS Pte Ltd on Facebook and André François McKenzie on Unsplash."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5EMGhmUG90TUNRS2hMbWVnaURTZGd3RElBVWdUamxmUFB4R1NUSEs2bHd5Yk9pVnpfWURjMkp4UEtaZWIyOXNBZ29ZVGl2a1hFMEhTRDlfQXRINHVFb0xz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot ETF Update BlackRock Aims for Bitcoin Success - Indodax",
        "content": "Recently, news related to approving Bitcoin spot ETF has become a hot topic in crypto asset investment.\n\nRemember that ETFs ( Exchange Traded Funds) are investment instruments traded on exchanges like stocks.\n\nETFs combine the characteristics of mutual funds and individual stocks. Generally, ETFs include a portfolio of assets representing a specific index, commodity, bond, or sector.\n\nMeanwhile, the main difference between direct investment in stocks or crypto assets and ETFs is that ETFs reflect the performance of the entire market or a particular index, not just a single company or asset.\n\nWith the presence of Bitcoin spot ETFs, investors have the opportunity to get involved in the Bitcoin market without needing to buy Bitcoin directly. They can acquire Bitcoin ETF units through stock exchanges, similar to purchasing shares on the stock market. Apart from that, the existence of a Bitcoin ETF also has the potential to have a positive impact on the price movements of this crypto asset in the market.\n\nOn the other hand, the advent of Bitcoin ETFs will allow investors to get involved in the Bitcoin market without having to purchase Bitcoin itself directly. Investors can also acquire Bitcoin ETF units through a stock exchange, similar to how shares are purchased on the stock market.\n\n11 Bitcoin ETF Products on the Market\n\nQuoting cnbcindonesia.com Currently, there are eleven (11) Bitcoin ETF (Exchange-Traded Fund) products available on the market, including BlackRock’s iShares Bitcoin Trust (IBIT), ARK 21Shares Bitcoin ETF (ARKB), WisdomTree Bitcoin Fund (BTCW ), Invesco Galaxy Bitcoin ETF (BTCO), and Bitwise Bitcoin ETF (BITB).\n\nFurthermore, there are VanEck Bitcoin Trust (HODL), Franklin Bitcoin ETF (EZBC), Fidelity Wise Origin Bitcoin Trust (FBTC), Valkyrie Bitcoin Fund (BRRR), Grayscale Bitcoin Trust (GBTC), and Hashdex Bitcoin ETF (DEFI).\n\nOn the other hand, the presence of Bitcoin ETFs shows that cryptocurrencies are now considered an important asset class in the investment world. In addition, fund managers issuing ETFs can increase liquidity in trading these assets.\n\nFurthermore, the presence of Bitcoin ETFs also makes it easy for investors who may lack experience in the crypto world to acquire these assets easily.\n\nBlackRock Wants to Follow Bitcoin ETFs with an Ethereum ETF\n\nQuoting coindesk.com, not long after the launch of BlackRock’s Bitcoin Exchange-Traded Fund (ETF), the asset management firm’s CEO, Larry Fink, effectively kicked off a marketing campaign for a second ETF product with the crypto asset Ethereum as its underlying, citing the transformative utility value of the blockchain.\n\nHowever, selling an ether (ETH) ETF could pose an interesting dilemma for the issuer. Investors may have just bought a Bitcoin ETF, so the practical need to refresh the portfolio is already met. Why would they need another crypto diversification tool?\n\nSui Chung, CEO of CF Benchmarks, an index provider for digital assets and partner of the BlackRock iShares bitcoin ETF (IBIT), has been thinking about that, especially after recently publishing a guide sheet explaining the benefits of bitcoin-backed securities to investors.\n\nIn his explanation, Chung also defines Bitcoin technology and its potential applications in finance is part of his explanation.\n\nHowever, he also believes that is the role of bitcoin ETF investing: small allocations diversify the portfolio and increase overall risk-adjusted returns.\n\n“The main thing is how bitcoin behaves and its price history,” Chung said in an interview.\n\n“When you put bitcoin in a portfolio with stocks, bonds, and cash, it becomes the most powerful diversification in investment history. You put a little bit, and the Sharpe ratio goes up.”\n\nChung added that it is becoming interesting how mainstream financial institutions, BlackRock, Franklin Templeton, Fidelity, etc, are marketing ETH ETFs to ordinary TradFi investors.\n\n“Because you’re already selling bitcoin by taking the diversification path; someone is already investing 1.5% or 2% of bitcoin into their portfolio.”\n\nIn a sense, BlackRock leader Fink has already begun to dive into the complex world of Ethereum by mentioning tokenization, a concept highly valued among TradFi firms today and something that ETF issuers likely also fully believe in.\n\nHowever, such educational efforts should also explain smart contracts and decentralized finance (DeFi), Chung said, without forgetting the complex issue of blockchain staking and the SEC’s opinion.\n\nOf course, the key difference between Bitcoin and Ethereum is how the latter (Ethereum) moved from an energy-consuming proof-of-work security system to a more environmentally friendly validator model.\n\nBitcoin Spot ETF Trading Volume Reaches $1.8 Billion on 3rd Trading Day\n\nQuoting blockworks.co/ on Thursday (18/1/2024), spot Bitcoin ETFs recorded a trading volume of approximately $10,000,000,000 in their first three (3) days on the market, with funds from Grayscale Investments and BlackRock continuing to lead in the category.\n\nGrayscale’s newly transformed Bitcoin Trust ETF (GBTC) recorded trading volume on Tuesday of about 25,000,000 shares, or $970,000,000, as found in a review of Yahoo Finance data by Blockworks.\n\nThis comes after GBTC volumes of around $2,300,000,000 and $1,800,000,000 on Thursday (11/1/2024) and Friday (12/1/2024). The high trading volume for GBTC did not signal a net outflow of funds. It experienced net outflows of $579,000,000 last week, as revealed in a CoinShares report released on Monday.\n\nDespite being recently converted into an ETF format, GBTC was launched in 2013 and has assets under management of around $27,000,000,000.\n\nSegment observers told Blockworks last week that they expect GBTC to experience outflows over time, partly due to its high fees compared to its competitors, at 1.5%.\n\nOn Tuesday (16/1/2024), BlackRock’s iShares Bitcoin Trust (IBIT) saw a trading volume of about 15,000,000 shares, or about $370,000,000.\n\nMeanwhile, about 8,200,000 shares of the Fidelity Wise Origin Bitcoin Fund (FBTC)-worth about $310,000,000-were traded on the day.\n\nIn a post, Bloomberg Intelligence analyst Eric Balchunas said that BlackRock’s IBIT is on its way to becoming the fund “most likely to beat GBTC as liquidity king.”\n\nIndustry observers cite liquidity-tighter bid-ask spreads and the ability to make large trades without much price influence as key factors that certain investors will consider when deciding which spot Bitcoin ETF to buy.\n\nSpot Bitcoin ETFs by Ark Invest and 21Shares, as well as by competing firm Bitwise, had trading volumes on Tuesday of around $124,000,000 and $52,000,000, respectively.\n\nOther similar offerings by Invesco, VanEck, Franklin Templeton, Valkyrie, and WisdomTree each had volumes of $10,000,000 or less.\n\nBitwise initially led in net fund flows for the spot Bitcoin ETF. However, BlackRock and Fidelity, traditional financial giants, surpassed the crypto-focused firm after the second day, as shown by Bloomberg Intelligence data.\n\n21Shares president Ophelia Snyder told Blockworks that the initial trading volume reflects pent-up demand, and she expects “a second wave of activity in the coming weeks and months as this becomes more prevalent.”\n\nHowever, the focus on short-term cash flows into the funds is “very short and largely beside the point,” he added.\n\n“It will increase over time,” Snyder said. “So I think the short-term view is a mistake.”\n\nYou can access the Bitcoin collection information page only on INDODAX Academy to get the latest Bitcoin news.\n\nKeep updating your information about bitcoin and the world of other crypto assets with INDODAX Academy!"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFAyYzdCek5UY0RZOGxBOHp0RDlSRjlwN2V0S3M4a284NldfVWdHN3NEUkI2V3REaU5EaVdIenlWNFFFSFlFaDhmN2JRRnpOTGhCZHBWdHY3YkpPNjF4WFdqejFLclg0RkQ1MnR4NU5OVE4wMlB4VzRPbldHR2TSAYABQVVfeXFMTXFndkVEWVJ4blRVTDJpcGNnb0JiX0d1QVNDM0d3TEdSNXl5cjBUOXp1V2VSTWU0MUIyVmNpQ09SUWloWmVvcTY4SmFtemJ0MVVWY1Z3X1VmNkNhUzZ3eEQzbFZsWGF5SVFreTJCUEc4X2w5MUVwcGhTbGhRa08zYnI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Price Estimated to Reach $ 2,506.30 By Jan 28, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is down -4.60% today against the US Dollar\n\nEthereum is currently trading 6.75% below our prediction on Jan 28, 2024\n\nEthereum gained 0.99% in the last month and is up 42.89% since 1 year ago\n\nEthereum price $ 2,337.01 Ethereum prediction $ 2,506.30 (8.06%) Sentiment Neutral Fear & Greed index 50 (Neutral) Key support levels $ 2,260.52, $ 2,206.97, $ 2,100.63 Key resistance levels $ 2,420.41, $ 2,526.75, $ 2,580.31\n\nETH price is expected to rise by 8.06% in the next 5 days according to our Ethereum price prediction\n\nEthereum price today is trading at $ 2,337.01 after losing -4.60% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -2.37% in the same time period. ETH performed poorly against BTC today and recorded a -1.11% loss against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,506.30 by Jan 28, 2024. This would represent a 8.06% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 0.99% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 30.74% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 42.89% 1-year price change. On this day last year, ETH was trading at $ 1,635.52.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,714.13, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.05. Ethereum recorded 12 green days in the last 30 days.\n\nEthereum technical analysis for today - Jan 23, 2024\n\nThe sentiment in the Ethereum markets is currently Neutral, and the Fear & Greed index is reading Neutral. The most important support levels to watch are $ 2,260.52, $ 2,206.97 and $ 2,100.63, while $ 2,420.41, $ 2,526.75 and $ 2,580.31 are the key resistance levels.\n\nNeutral sentiment for Ethereum\n\n14 indicators are currently signaling a bullish prediction for Ethereum, while 14 indicators are showing a bearish forecast. With 50% of indicators favoring a positive prediction. This results in an overall Neutral sentiment for Ethereum.\n\nCrypto market is currently experiencing Neutral\n\nCurrently, the Fear & Greed index is at 50 (Neutral), which signals that investors have a neutral outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 2,483.53 (SELL) $ 2,416.91 (SELL) - - MA5 $ 2,452.01 (SELL) $ 2,380.54 (SELL) - - MA10 $ 2,463.33 (SELL) $ 2,323.92 (BUY) - - MA21 $ 2,395.77 (SELL) $ 2,232.92 (BUY) $ 2,799.51 (SELL) $ 2,033.55 (BUY) MA50 $ 2,313.67 (BUY) $ 2,074.80 (BUY) $ 2,482.72 (SELL) $ 1,900.02 (BUY) MA100 $ 2,104.79 (BUY) $ 1,945.07 (BUY) $ 1,607.35 (BUY) $ 1,876.10 (BUY) MA200 $ 1,927.88 (BUY) $ 1,854.46 (BUY) $ 1,986.60 (BUY) $ 1,657.07 (BUY)\n\nPeriod Value Action RSI (14) 53.13 NEUTRAL Stoch RSI (14) 67.40 NEUTRAL Stochastic Fast (14) 54.09 NEUTRAL Commodity Channel Index (20) 66.67 NEUTRAL Average Directional Index (14) 19.16 NEUTRAL Awesome Oscillator (5, 34) 122.52 NEUTRAL Momentum (10) -158.30 NEUTRAL MACD (12, 26) -7.52 NEUTRAL Williams Percent Range (14) -45.91 NEUTRAL Ultimate Oscillator (7, 14, 28) 53.13 NEUTRAL VWMA (10) 2,520.84 SELL Hull Moving Average (9) 2,471.57 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 2,426.71 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 53.13, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Neutral. ETH would have to increase by 8.06% to hit our $ 2,506.30 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQU1NrQ2dpUDFpQlFEaHhERmk0dDJWbV90djVQakM3eEdIVXVJNFpCZV9KTlg1RUhCTjFGaE1jeU5tNkx3R3U1MS1lOS01bkI4VnEwUW9ybl9fMDlTOHRFeFdsNV9yclN4SzBTTVM4S1otNW1aUzBXQkhaNUVKcEdaNk54bWlac0tSblZPcW45SmpIazRLSjVrNXdUdlRrb0N0RnhKcUVkWmQxaDdiSEdR0gG0AUFVX3lxTFAyZE91cmY1OXBWd05DQU9DRl9JUHg4eHZDcURseW16TlJYOVNMakdsa2R6M1UzdFkwVndOeG40MkJpSlhPVGlNU21FUjJ0V1dxRW1naGlkVFdtblMybVh1WGwwOXAzNDlmVERaMlNmMi1Ga3RQczhrRjU2UDlKWGdKc0JxOVFWaV96S3MzSXZRMGxlcHY1UXFWYzVETzRMWVFleTJDNFpXNEs3d3hrY2VYeS0yNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Celsius Dump Triggers Ethereum Dive: $35 Million Sell-Off Sends ETH Price Crashing - NewsBTC",
        "content": "Celsius Networks, currently undergoing bankruptcy proceedings, has engaged in significant Ethereum transactions that are causing ripples within the digital currency landscape.\n\nIn the past 10 hours, on-chain analysts at LookonChain detected noteworthy transfers, including a 13,000 ETH deposit ($30 million) on Coinbase and an additional 2,200 ETH ($5 million) on FalconX. These transactions suggest a proactive stance by Celsius in addressing its ongoing financial challenges.\n\nRelated Reading\n\nXRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details 8 months ago\n\nCelsius Sells $125M ETH, Maintains $1.3B Reserve\n\nAccording to Arkham Intelligence, Celsius sold more than $125 million worth of Ethereum (ETH) coins between January 8 and January 12. The primary goal of this auction is to pay off creditors.\n\nDune Analytics also revealed a more widespread pattern of redemptions, with over $1.6 billion of staked Ethereum being redeemed during the same period. Since the Shanghai update last year, the amount of redemptions recorded is the highest.\n\nDespite facing financial constraints imposed by the court, Celsius still holds a substantial Ethereum reserve. This reserve amounts to over 557,000 coins in two staking wallets, with a total valuation of approximately $1.3 billion. The size of this reserve adds a layer of complexity to Celsius’ current financial situation and underscores the evolving narrative within the crypto space.\n\nSource: LookOnChain\n\nAs part of its obligations to creditors, Celsius has been actively liquidating its Ethereum holdings. These auctions, aimed at paying off outstanding debts, are integral to Celsius’ bankruptcy proceedings.\n\nSource: LookOnChain\n\nThe market has responded to these Ethereum transactions, resulting in a 4% decline in the price of ETH. The cryptocurrency slipped below the $2,350 mark, raising concerns among analysts, especially as ETH now wavers below its crucial demand zone ranging from $2,380 to $2,461.\n\nAnalysts predict that a failure to maintain this level could lead to a potential retreat towards the $2,000 mark.\n\nEthereum currently trading at $2,307.2 on the daily chart: TradingView.com\n\nWealthy Investors Trigger Ethereum Profit-Taking\n\nSantiment’s historical data reveals that significant transactions by wealthy investors, commonly known as whales, often trigger profit-taking activities among regular ETH holders. This phenomenon intensifies selling pressure and contributes to price declines.\n\nRelated Reading\n\nMeanwhile, decreasing funding rates suggest an underlying optimism in the market, hinting at a possible cooldown in previously overheated perpetual markets. This situation leaves room for ETH to rebound once the selling pressure subsides.\n\nAs the bankruptcy drama of Celsius unfolds, the scrutiny on its Ethereum transactions and the resulting market dynamics will persist. Investors and observers are closely monitoring the situation, eagerly awaiting further developments and anticipating the broader implications for both Celsius and the crypto ecosystem.\n\nFeatured image from Shutterstock"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPTXFRQjBXUVVPZThKWXp1R19tcnNjd2FjeWNCeUwycFo4WThyT0F4YUJKaUc2T0R2ZmF4YjFJQ1A1MVdYLUItSXNYVzJtREZKNWJNUW1LR051bUhac0wtYzRNUmF5amw3Z3daNllYamdwUVg2OG5nLUJCMUpIWW1La001X3ppanBReGMxNG9FN1RRb1JVUXVKQmFfZlB6c2kyZmcw0gGnAUFVX3lxTE9MMk1FR2JXSGlKRGcwTXNLcDIyOU5kNzAzQ1BWTFRMZWxObXd1NnFtcUp0am9ERFBsQ3ZPSmw5NWRLT05waGYwNWdHY0NtQkpsQnNpRlZZMHNNNXZFTkMwSkxBLXBEdXllMkV2d0pjZFVLWDFRUi1xWFhYdGg4bDlvazBtQ3NqT1pkdkxJRk94NklRUHBVQmVSenJwUjJqSFNaSEdYejBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum EIP Embraces AllianceBlock's RWA Token Standard ERC-7208 - CoinCodex",
        "content": "The Ethereum EIP website has accepted AllianceBlock's draft proposal for a new ERC token standard, and the Nexera protocol will be the first reference implementation of the ERC-7208.\n\nThrough his X (formerly Twitter) account, AllianceBlock's founder and CEO, Rachid Ajaja, verified this, calling it \"a significant milestone in the Company's spectacular journey.\" He also extended an invitation to cryptocurrency members to observe the evolution of the Draft to Final state by providing knowledge and experience that will be vital in improving the ERC interfaces and advancing them to the 'Final' stage, where they will be accepted by all.\n\nToday marks a significant milestone in our journey. Thanks to your incredible support, which has garnered 4,300 views, 70 replies, and 309 likes—landing us at the top spot on the Ethereum Magician forum—we've officially been accepted as a Draft on the Ethereum #EIP website… — Rachid Ajaja ?????? (@AjajaRachid) January 19, 2024\n\nWhat is ERC-7208?\n\nAllianceBlock released a draft proposal, known as ERC-7208, for a new Ethereum Request for Comments (ERC) token standard. The idea of a new token type called \"Real World Asset\" (RWA) is introduced in the Ethereum Improvement Proposal (EIP) 7208. Enhancing on-chain data processing and Real World Asset management across the Ethereum blockchain network is the main goal of this proposal.\n\nTokenizing Real World Assets requires consistent and predictable interactions between tokens; this is addressed in the ERC-7208 standard. In order to improve the functionality and interoperability of ERC tokens, it seeks to provide a set of interfaces known as the On-Chain Data Container (ODC), with a particular emphasis on managing on-chain data pertaining to Real World Assets.\n\nAllianceBlock's dedication to promoting innovation in the blockchain realm, particularly in the areas of decentralized finance (DeFi) and the tokenization of physical assets, is demonstrated by the creation of ERC-7208. The proposal is at the final stage of approval clearly demonstrating its importance within the Ethereum community.\n\nERC-7208 Empowering The world of Real World Assets (RWAs)\n\nSince its introduction in June 2021, ERC-7208 has been sparking lively discussions within the crypto sphere. Enthusiastic members of the Ethereum network have been actively participating in development forums, eagerly anticipating the potential expansion of the network. This is all pending the successful passage of the final draft of EIP7208 by AllianceBlock and its subsequent complete adoption on the Ethereum website. The recent Twitter announcement of this development also mentions the Ethereum Magician forum, a popular hub for developers and stakeholders to come together and suggest enhancements for the Ethereum network.\n\nEIP7208 aims to revolutionize the web3 and blockchain landscape by simplifying data transfer beyond traditional financial transactions. By streamlining the process of creating Real World Assets (RWAs) and also simplifying the rationalization and on-chain trading of these assets, tokenization of these assets will be made easier thanks to EIP7208 . This will be achieved with the introduction of a specialized token standard designed to handle real-world assets (RWAs) on the Ethereum platform, thus solidifying the network's position as a top player in the world of decentralized finance.\n\nJoin the Ethereum Crypto community and have discussions with other crypto enthusiasts on the importance of having ERC-7208 on the Ethereum website."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQX1NqbExhWnlpSGhsNHVDZWduQ0dkVTN6NGRTbjFNVHpzVC0yV19PWGR2LXBHRm1XdGJSbnlQdE1fMVgxMTdPbi1jeGYtZzlNZHRnU0ZsOXI1M1BPYmRROUQ4SlIzZXlpMlY3b0Z1SjQwOGRDai1jaWpSUVlyTldNUi13WVFsZG9NMW5VcDdhSEVRaGdKWXBqMkFCZlZ5dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Leads with $487 Million in Rug Pull Loses, Followed by Polygon - BlockPublisher",
        "content": "The immutable and open nature of DeFi makes it vulnerable to losses arising from unauthorized access to digital assets like cryptocurrency. As a result, every year many DeFi platforms lose millions of dollars from malicious actors like hackers and scammers. However, various DeFi protocols are susceptible to different attacks. Today, we discuss crypto losses that different DeFi projects incurred during 2023.\n\n$2.5 Lost in Crypto Crimes in 2023\n\nA recent SlowMist.pdf “SlowMist”) report revealed that there were a total of 464 crypto incidents that resulted in a loss of more than $2.5 million in 2023. The Ethereum network had the highest number of security breaches and other crypto crime incidents, accounting to about 70% of the total.\n\nThe Ethereum losses were mostly a result of crypto hacks and rugpulls that totalled more than $487 million. On the other hand, Polygon had the second highest number of incidents amounting to $123 million. The main causes of Polygon’s losses were crypto scams and hacks.\n\nIt’s not surprising that the Ethereum ecosystem recorded the highest number of crypto rugpulls and other crimes. The reason is that it has an extensive ecosystem and high profile crypto projects.\n\nNotably, the largest crypto crime on Ethereum was on the cross-chain platform Multichain where there was a loss of $230 million. However, despite these security incidents the ETH price and Polygon price (Matic) remained competitive. Both ETH and Matic were bullish for the greater part of 2023.\n\nBased on these figures there was a 34% decrease in the number of crypto security breaches in 2023 as compared to 2022. In 2022 there were more than 300 incidents with a total loss of more than $3.8 billion.\n\nThe decrease in crypto incidents was a result of improved security systems for DeFi protocols and an increase in community awareness about crypto crimes and safety measures.\n\nApart from Ethereum and Polygon, Binance Smart Chain (BNB) recorded several crypto scams and other security incidents. Crypto scams comprised the highest number of incidents on the BNB chain. There were 113 security incidents with a total loss of about $110.12 million.\n\nDeFi was the Greatest Crypto Crime Target in 2023\n\nOf all the affected project types, DeFi was the greatest target during 2023 with over 230 crypto incidents. The following graph shows the distribution of crypto crimes among the major crypto sectors.\n\nAs The Graph indicates, DeFi and crypto exchanges had the highest incidences of crypto crimes. According to SlowMist, the crypto crime losses on DeFi constituted 60.7% of all the incidents. Crypto exchanges were the second most affected institutions.\n\nPopular methods of Attack\n\nRugpulls: Data on SlowMist.pdf “SlowMist”) shows that there were 117 rug pull incidents with total losses that exceed $83 million. Base ecosystem incurred the most loss that amounted to over $32.5 million. BNB Chain had the second highest numbers of rugpulls with over $23.05 million in losses.\n\nUsually, project developers orchestrate rugpulls which come in different forms including inflating prices and withdrawing liquidity. At times, they create projects, fund them and invite many people to invest in them. Once there is much liquidity they close the projects and disappear with the funds.\n\nFlash-loan Attacks: In 2023, flash-loan crypto crimes led to the loss of over $275 million in 36 cases. Often the attackers capitalized on uncollateralized loans in lending DeFi protocols. In such cases, they use the borrowed funds to exploit platform vulnerabilities and manipulate prices.\n\nAccess Control Exploits: In this case, the attackers take advantage of weaknesses on how the systems grant access rights and permissions. Certain vulnerabilities enable attackers to gain unauthorized access to digital assets that exist on the platforms. In total, there were 29 cases of access control exploits that resulted in losses amounting to $852 million.\n\nMajor Security Breaches in 2023\n\nEarlier on, we pointed out that in 2023 there were a total of 464 recorded crypto incidents. Let’s briefly look at some of the biggest exploits of the year.\n\nMixin Database Attack: Mixin Network’s, a cloud service provider, was attacked on 23 September leading to a loss of assets worth more than $200 million.\n\nEuler Finance: On 13 March attackers exploited Euler Finance and stole assets worth more than $197 million. The bad actors accessed flash-loans and triggered liquidation functions by donating the digital assets to a reserve address.\n\nPoloniex Exchange: On 10 November hackers stole crypto assets worth around $130 million. According to SlowMist, based on the fast and professional manner the attack was carried out, it could be the work of the Lazarus Group.\n\nOther attacks: The other crypto projects that incurred much losses due to crypto crimes are BonqDAO (a non-custodial lending platform), HEX, HECO Bridge, Atomic Wallet, Curve Finance and Orbit Chain.\n\nThere were 464 reported crypto incidents in 2023. Most of these incidents occurred on DeFi and crypto exchanges. Due to improvement in security of DeFi protocols there was a 34% decrease in crypto crime incidents in 2023 compared to 2022. Ethereum, Polygon and BNB Chain witnessed the greatest losses due to the attacks.\n\nHow to Protect Yourself from Rugpulls and Hacks\n\nThe best means to protect yourself from rugpulls and hacks is to carry out your crypto activities like trading on crypto exchanges, such as Gate.io crypto exchange. This is because exchanges verify projects that list their tokens there.\n\nIf you want to invest in crypto start-ups you can also do that on cryptocurrency exchanges. As an example, Gate.io lists verified start-ups on its Startup page. With these emerging crypto projects there is no chance of rugpulls.\n\nConclusion\n\nThere were 464 security incidents in 2023, a decrease of about 34% from 2022. The greatest losses occurred on the Ethereum and Polygon networks. Most attackers targeted DeFi and exchanges due to the number of activities that take place there. The best way to avoid rugpulls and crypto hacks is to carry out various transactions on cryptocurrency exchanges."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOOTJycXJOaEhGNEk0SGhveFRrejgyaWpxOHVRTWNobkt6MkprQU5zcVlGeFh5Y1k4YkZRUWZQbXFOTS1oYzF2X1dJZmIxQXNUTzdUTTRLZHp2YUpQS2h1TnRXOVVISWZlYklhNDY3WWdYaGtBZXBEeF9faVIxdXQ2eTZrOWtWczR4Z3hTRFlBeWlqeWxFcVJ5dWw3QlFFTHN4bE9yS3loVm1mcEw2TV9iNdIBtAFBVV95cUxNbUxvVGNpQXBlejVFZzMxYVVvTnhoNmxjRzdlZmgtVXhMZlZYVldOeHVxSzI1Ukg0R0lJRHo4dHpsVXduQUFVQzJrckF6US1mYk0yd1l3NGg4a2FyMUZOdTdvYUZnenFXOUszd195ZTIzY05mb1BWc3dWSW4wYkxnSFhDMWhfOFM3VUdFeWlxMWNEbTFTOXF3UmNJUTZyYS1lRkxZRHV1OU04RVNlZmNOdE9scVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Trust Wallet Unveils Pooled ETH Staking to Open Access for Smaller Holders - CoinCodex",
        "content": "Key Takeaways\n\nTrust Wallet has launched a new Pooled ETH Staking feature that enables more users to participate in Ethereum staking and earn rewards.\n\nBy partnering with Kiln, Trust Wallet can pool together assets from multiple users to meet the required 32 ETH minimum balance to run a validator node.\n\nKey benefits include higher rewards, lower fees, enhanced security, and easy in-app access to staking, making it more equitable and accessible.\n\nRemoving the high 32 ETH requirement aims to incentivize Trust Wallet's large user base to adopt ETH staking, further decentralizing and strengthening the Ethereum network.\n\nTrust Wallet, a popular crypto wallet app boasting over 10 million users, has launched a revolutionary new \"ETH Pooled Staking\" service that finally allows everyday crypto investors to participate in staking Ethereum (ETH) and earn lucrative annual rewards in the range of 4% without needing to meet the prohibitively high normal minimum balance of 32 ETH.\n\nBy entering a groundbreaking partnership with leading staking provider Kiln, Trust Wallet can now pool together assets from multiple users to jointly validate transactions on the Ethereum network as a single validator node, overcoming the high technical barrier that has until now locked out individuals with less than 32 ETH from earning income through staking.\n\nBenefit of Trust Wallet Pooled ETH to Users\n\nThis innovation makes it possible for nearly anyone to earn passive rewards on their ETH holdings through staking, a major win for accessibility and inclusiveness in the Ethereum ecosystem. No longer just an option for whales, ETH staking’s many benefits—chiefly, earning high-yield annualized returns simply for holding coins—are now open to all Trust Wallet users.\n\nBeyond expanding access, ETH Pooled Staking also bolsters security by supporting validator nodes that keep Ethereum decentralized and robust. According to Trust Wallet’s Product Lead, Nate Zou, this development signifies their “dedication to providing our users with a more equitable and profitable staking option” that promotes a “more diverse and equitable crypto ecosystem.”\n\nThe staking feature is directly built into the Trust Wallet app for maximum ease of use, allowing users to get started securing the Ethereum network and earning rewards with just a few taps. It complements Trust Wallet’s existing suite of tools like crypto and NFT support, dapp browsing, and their new scammer-detection scanner.\n\nBy removing the traditionally high 32 ETH minimum balance requirement for staking, Trust Wallet hopes to see its broad user base flock to ETH pooled staking in droves, further decentralising Ethereum in the process. More individual holders staking their ETH also unlocks greater profit potential."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQMThUaElWSmNVNzJfVXNZcERTNHJYajRmMkMyZTFGdmxQb3FFMDNvdnV2TlRLNGwzUWgtTEJSZTZ2VmhCNnpSdW1RaVVHTElKSkozeGxZOEhicWN4LXVCNEtaeEl1d2prYi1DX3JSaFdwLS1HamRFdTlRU2Zab2huOGRESUg4dXFmdjdTT0VuOS1ISWVyazV5enk2UDZTRzFMZTRZeFhObmRLSnlTNFlyN2F2Y01Pd9IBtgFBVV95cUxQMThUaElWSmNVNzJfVXNZcERTNHJYajRmMkMyZTFGdmxQb3FFMDNvdnV2TlRLNGwzUWgtTEJSZTZ2VmhCNnpSdW1RaVVHTElKSkozeGxZOEhicWN4LXVCNEtaeEl1d2prYi1DX3JSaFdwLS1HamRFdTlRU2Zab2huOGRESUg4dXFmdjdTT0VuOS1ISWVyazV5enk2UDZTRzFMZTRZeFhObmRLSnlTNFlyN2F2Y01Pdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval: Decoding the SEC's Stance and Market Anticipation - The Currency Analytics",
        "content": "Despite internal resistance within the SEC, asset managers responsible for Ethereum ETFs maintain an optimistic outlook. One issuer expressed confidence in both approval and a smooth launch, drawing parallels with the successful approval of Bitcoin spot ETFs. Another issuer even anticipates the launch of a spot Ethereum ETF by the end of summer, citing the SEC's earlier approval of Ethereum futures ETFs and BlackRock's strong track record with ETFs."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVVl4dGdwMkdoM0w1SGlTOV8zblJfMkpsak9ZT3Z1VTFuYk9wZlN1cWNTSkk3YWxoQUZLTlg5RXRCYkhnMU9LMi1RcXVoZDZ3Sl9PUEVUNWlRQU1yZXJMc1ZrVHc4aEduSXVhWWZxUzk4aDVlVkZZYVZzRGE5dU8tdzhxQUloZnViWmdsSElMUFVSMVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Analysis: ETH Trades Close $2,150 as Downtrend Enter Day 2 - Coinfomania",
        "content": "Investors in the DeFi project, CBDAO (BREE), are scratching their heads after it became evident that the people behind the project have vanished. The project’s website, Telegram group, and Twitter handles are no longer online, with the total lost funds exceeding over $1 million in ETH.\n\nAt the time of writing, the BREE token which had traded as high as $50 in early September was trading at a $0.43 price, representing a 99.1% decrease from that all-time high.\n\nCBDAO exit scam\n\nAccording to information from its now-deleted website, CBDAO dubbed the “Ultimate DAO sandbox” was a DeFi project that promised investors up to 30% APR. BREE tokens can be earned via farming and staking, with the project aiming to deliver a Governance as a Service (GaaS) solution that allows new decentralized autonomous organizations (DAO) to bootstrap their governance processes.\n\nAs per a detailed Medium post by a supposed investor, “the team had been developing the project and meeting deadlines,” and even “pushed a new website the night before the attack.”\n\nThe team had announced a token swap for users to swap BREE tokens for Synthetic Bree (SBREE) tokens, and it was a backdoor on the newest token contract that the attacker exploited. They minted 50,000 SBREE, converted to BREE, and dumped onto the open market in fourteen separate transactions for roughly $60,000. That was in ETH addition to the roughly $1 million that the project initially raised, leaving investors bewildered about why the paltry sum was the last act of the exit scam.\n\nWill the identity of CBDAO founders be uncovered?\n\nWith the project existing for as long as two months, investors claim to have uncovered the identity of some of its founders and have already reached out to law enforcement agencies. Other crypto exchanges that reportedly did business with the CBDAO team, including Binance, Bittrex, Poloniex (listed SBREE), Somish Labs, and Etherscan (advertiser), have been contacted.\n\nMeanwhile, angry investors who lost thousands of dollars to the CBDAO exit scam created a Telegram group vowing to uncover the identity of the project’s founders.\n\nSee Also: Degen DeFi User Farming UniCats tokens Ends up Losing $140,000 UNI tokens to Exploit"
    }
]