[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPTHk5QWpUczI2QWVhdHNSZkxZdFh5RUlsZHdrb0dNRFlMUW5WbFk1N1o2Ylhndk1lbTRLazVKbHVJRThvaWxzMWNqOFJuSnFhQmtJVDF0LXRwYV9Sb1dkU2tyeGM5UjRUamluek4tanhkNzdfZWNRNllpNE5GSWNKTHNvb1FUeTFLRFFVSm5xdjNxZG9BQy02R05ZR21xOV9kUlExTGh1TFRpT2NwMVFsZzhPWmlLVXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Think Beyond Bitcoin: Ethereum’s Use Cases and Latest Technology - CoinDesk",
        "content": "Addressable Market Analysis. With this approach, we identify the industries already adopting blockchains, while forecasting the percent of each industry that could move onchain by 2030.\n\nCycle Analysis. With cycle analysis, we analyze past adoption cycles and the growth in key fundamentals to forecast the potential future value of the network.\n\n“GDP” Analysis. One way to compare Ethereum’s valuation relative to other layer 1 networks is with “GDP” analysis. In this case, we quantify and forecast the economic opportunity, or GDP, of the network. The GDP of a blockchain network is the sum of all of the revenues produced by the applications and protocols built “on top” of the L1. Ethereum’s “GDP” was over $2.7 billion in 2023 (covers top 100 applications per Token Terminal).\n\nTotal Crypto Market Cap Analysis. The combined market cap reached $3 trillion in 2021. Despite the volatility of the industry, we think crypto is in a long-term secular and exponential adoption cycle. As such, if the industry were to follow past adoption patterns (388% increase last cycle), the combined market cap could reach $10 trillion in the next expansion. Following historical data, we apply a percentage to Ethereum and ultimately get a projected price/token in the next cycle."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5mQm1HYllCMmVwWV9vRlNHSEFtam9GTWktNThtSmFWOHVSR0hIYTZTbTA0SzNxUW9pdHRLSE8wcTRScktldFBFTUVpb01DeHdHODJoYXRZTlRJYnlqdXpMUmNsck5FS2stdV9KQ3ZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Cheatsheet: Ethereum staking at record high, exchange balances at 6-year lows - Blockworks",
        "content": "This is Cheatsheet, a primer on what’s happening in crypto today.\n\nBitcoin is doing well but it smells like altcoin season out there — with a hint of wet dog.\n\nDog coins dogecoin (DOGE), bonk (BONK) and shiba inu (SHIB) lead the top end of the market with gains between 32% and 25% over the past day.\n\nBitcoin (BTC) and ether (ETH) had managed about 6.5% as of 7 am ET, still a sizable gain considering their scale.\n\nArweave (AR), the “permaweb” blockchain geared for decentralized file storage, continues to enjoy a moment, also climbing by a quarter.\n\nAR is the second-best performing top-100 crypto after PEPE over the past week. Arweave has tapped into AI hype, having just launched a testnet for an adjacent blockchain built to power decentralized computing.\n\nWhat’s happening on-chain\n\nEthereum holders on the whole continue to stake their ETH as prices reach nearly two-year highs.\n\nThere’s more than 31 million ETH ($107.1 billion) staked as part of consensus, up 7% in one month.\n\nMore than a quarter of the circulating supply is staked — over double the ETH on crypto exchanges.\n\nETH staked is at an all-time high, while exchange balances are at near six-year lows.\n\nThere are now almost 1 million validators on the network. About half are either managed by liquid staking protocol Lido or Coinbase on behalf of their users.\n\nBarring this Tuesday, there has been more ETH queued to be staked than unlocked every day this month. Another 13.4% of the supply (16.1 million ETH worth $54.4 billion) is kept in the network’s DeFi apps after dropping half a percent overnight.\n\nNewly-launched re-staking platform EigenLayer just surpassed Maker — the protocol behind major stablecoin DAI — now with 2.85 million ETH ($9.7 billion), a figure that tripled this month.\n\nRead more: EigenLayer’s $100M haul ignites series of adjacent investments\n\nEigenLayer could soon topple Aave\n\n88% of the SOL supply is still staked ($50.15 billion) but that number has slipped over the past two epochs (about four days).\n\nNearly 5% of SOL is locked in DeFi, up from 3.7% at the start of the month. Lending protocols Kamino and marginfi, alongside liquid staking app Jito, are gaining deposits.\n\nBitcoin’s budding DeFi sector could soon surpass Solana’s for total value locked, even if still getting off the ground.\n\nCrypto business\n\nVolatility came for crypto stocks yesterday, with only four rising across Wednesday’s session and into after hours trade.\n\nMicroStrategy is on track to open 15% higher than yesterday (its bitcoin is now worth $12 billion).\n\nCore Scientific, a bitcoin miner, may still stick the landing after bankruptcy, set for 9.5% higher.\n\nCleanSpark, another miner, corrected by 13.5% before adding 6% after hours.\n\nDespite its retracement, CleanSpark is still the best performing crypto stock this year, having added two-thirds to its share price (MicroStrategy and Marathon are second and third).\n\nNevada-headquartered CleanSpark is on an acquisition spree, buying up three Mississippi data centers with aims to boost its hashrate by more than 15 EH/s, the equivalent of around 2.8% to bitcoin’s total right now.\n\nHut 8 however has lost 34% year-to-date amid leadership changes and a “merger of equals” with US Bitcoin Corp. The dip especially hurts considering bitcoin has climbed more than 40% and threatens new all-time highs.\n\nRead more: New Hut 8 CEO prepared to make ‘hard decisions’ to nix inefficiencies\n\nOnly six of about two dozen crypto stocks have outperformed the S&P 500 this year.\n\nProShares’ fund offering short exposure to bitcoin, BITI, is one of the worst performing ETFs on the market this year, down 32%.\n\nMicroStrategy execs have sold $155 million in company shares this year, three-quarters coming from former CEO Michael Saylor.\n\nOn the ground\n\nLoading Tweet.. iykyk\n\nLoading Tweet.. Ether ETFs could impact Ethereum in very complicated ways\n\nLoading Tweet.. Should’ve spun up a DAO\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQR0VJaXdaNTcwQ0w3NmpCWGEwX2EtckFPLTNoSl9tUW9jaldLczVfT2ZvaS1PTm1PWG1rVzZKSFYtSk9wOUlmeWhyMy1INS1vc0ZSb0NhNndaVzZYdENCVFNMWWJQRm4xNFc2NWEyMkFicGk5cWttYkZrQXJycmpxcmZ0TU8talFuYVZVUHFzMEZBX2pzcEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Forget Bitcoin and Ethereum: This Cryptocurrency Is Poised for an Incredible Run - Yahoo Finance",
        "content": "Cryptocurrencies are waking up after another long slumber. Ethereum (CRYPTO: ETH) has gained 92% over the last year, while Bitcoin (CRYPTO: BTC) climbed 128% higher. From the introduction of new crypto-based investment vehicles to the upcoming halving of Bitcoin-mining rewards, many forces have combined to thaw the latest crypto winter.\n\nBut not every cryptocurrency has been invited to the party yet, even if their growth prospects look at least as promising as Bitcoin's or Ethereum's. In particular, Polkadot (CRYPTO: DOT) seems undervalued and poised to break out in a market-beating run. The official blockchain network of the Web3 Foundation isn't getting the market respect it deserves.\n\nPolkadot's low price sticks out like a freshly stubbed toe if you agree that a decentralized and personalized internet is the future.\n\nI'm not saying you should sell all your Bitcoin and Ethereum to reinvest it in Polkadot today. A diverse portfolio always makes more sense, even in the uncharted waters of the crypto industry.\n\nBut in case you haven't considered adding some Polkadot yet, let me explain why this token is in a prime position to beat both the stock and crypto markets over the next few years.\n\nImage source: Getty Images.\n\nWhat is Polkadot, anyway?\n\nPolkadot is a blockchain network designed to solve a fundamental problem of the crypto world: different blockchains can't easily talk to one other. Imagine a world where your Apple iPhone couldn't connect directly to a Samsung Galaxy device -- that's the old blockchain reality. Polkadot acts as a translator and bridge, allowing blockchains with different purposes and designs to seamlessly communicate and share data.\n\nThe Web3 vision for the internet is all about decentralization and user control. Polkadot makes this possible by enabling customized blockchains (so-called \"parachains\") to plug into its network. These parachains can be tailored for specific uses like gaming, finance, or social media, creating an interconnected ecosystem where value and information flow freely.\n\nThis programming ecosystem supports quick and easy development of apps and programs that take advantage of the best features in many different blockchains. Polkadot makes it easy to store monetary value in Bitcoin, execute Ethereum's smart contracts, collect real-world data from Chainlink (CRYPTO: LINK), and more.\n\nAnd the DOT token (commonly referred to as Polkadot) is the lifeblood of this decentralized system, passing data between different blockchain networks with ease while ensuring the security of data transfers. Plus, its multichain design allows for many transactions to be processed quickly, avoiding the bottlenecks of less scalable blockchains.\n\nStory continues\n\nHow the DOT blockchain makes money\n\nRunning transactions through Polkadot's proof-of-stake ecosystem generates a tiny fee for the validation nodes that process every request. This toll fee for traveling on the next-generation information superhighway serves as an incentive for helping the system work.\n\nIn this way, increased use of the Polkadot network directly translates to higher demand for DOT tokens, since they are needed to pay transaction fees. As the ecosystem grows and more value flows through Polkadot, the underlying DOT token becomes more valuable.\n\nThe current reward rate for staking your Polkadot tokens stands at 17.3%. That's quite high, in order to motivate more DOT owners to stake their tokens and take a more active role in the system. Less than 53% of all DOT tokens are staked today, below the target rate of 60%. So the reward rate could change over time as the staked portion grows or shrinks. Staking also lets DOT holders participate in network governance, further influencing the value of their holdings.\n\nPlus, that's the raw reward rate for people running their own nodes on the DOT network under ideal conditions. The rate will be lower if your chosen crypto-trading service keeps a part of the staking revenue for itself. For example, my Coinbase (NASDAQ: COIN) account currently shows a 6.9% earning rate for staking DOT tokens.\n\nThese mechanisms ensure that DOT's value is tied to the growth and success of the Polkadot network.\n\nPolkadot Price Chart\n\nPolkadot has room to grow, but many market makers haven't noticed yet\n\nDOT's 14% gain over the past year pales in comparison to Bitcoin's and Ethereum's returns. Yet those larger crypto names operate in different, often less-dynamic market segments.\n\nWith its interoperability focus, Polkadot sits at the leading edge of Web3 innovation. Market caps are often imperfect metrics in rapidly evolving industries, and DOT's $10.5 billion market value should grow much larger in 2024 and beyond.\n\nIt seems like a gross undervaluation given Polkadot's pivotal role in the emerging decentralized internet. Astute investors can see this mispricing as a chance to buy into a leading Web3 infrastructure play at a significant discount.\n\nShould you invest $1,000 in Polkadot right now?\n\nBefore you buy stock in Polkadot, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Polkadot wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of February 26, 2024\n\nAnders Bylund has positions in Bitcoin, Coinbase Global, Ethereum, and Polkadot. The Motley Fool has positions in and recommends Apple, Bitcoin, Chainlink, Coinbase Global, and Ethereum. The Motley Fool has a disclosure policy.\n\nForget Bitcoin and Ethereum: This Cryptocurrency Is Poised for an Incredible Run was originally published by The Motley Fool"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQOWtQREJZUGVvb3lSUXRPcC1JOHBwR1EwbXFhYkYyekRWNXRQdng2M0s0dll3X3lISC1YdG1tdmdjTmlYMXlkU2w3cm56bkNfbnlKTmZPNEFRX3MwTVRXQXhXX2ZISkNnX0NwUldfa2l1SEt5R3JLanlFaVZLYmUzcVJzMGkxQlVJalFJODBMM0c0V0U3SkpSSEFUbUVfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "ETHDenver Comes at a Critical Time for Ethereum: Here’s What to Expect - Unchained",
        "content": "For the past decade, Denver has acted as a physical gateway to a new internet intended to be both permissionless and open-sourced. This year’s ETHDenver finds itself at the convergence of several significant events in the crypto space.\n\nThis year’s ETHDenver comes a few weeks before Ethereum undergoes its Dencun upgrade.\n\nDenver is not just home to the Rockies, the largest mountain system in North America. The Mile-High City is where ETHDenver takes place, an annual community-run gathering for those curious about smart contracts, decentralized finance, and blockchain networks.\n\nFor the past decade, Denver has acted as a physical gateway to a new internet, serving as the entry point for people to meet others and coordinate building a digital landscape intended to be both permissionless and open-sourced.\n\nAs snow falls, some crypto enthusiasts are already in Denver, participating in hackathons, networking for potential investment deals, and learning more about the underlying technologies that power decentralized networks.\n\nThis year’s ETHDenver finds itself at the convergence of several significant events in the crypto space. It comes a few weeks before Ethereum, the second-largest blockchain network by market cap, will undergo its Dencun upgrade, which is expected to substantially improve transaction cost efficiencies for layer 2 rollups.\n\nThe “innovation festival,” as ETHDenver’s landing page calls it, also comes as competition among layer 2 scaling solutions is ramping up, with some networks maturing and others just joining the race.\n\nArbitrum\n\nand\n\nOptimism\n\n, with a total locked value of $3.186 billion and $929 million respectively, according to blockchain analytics firm\n\nDefiLlama\n\n, have been operational for several years, gearing up for the next stage of their blockchain networks.\n\nRead more: Is Ether Heading for $3,500?\n\nOn the other hand, new layer 2s, some connected to centralized exchanges such as Base and Mantle, have gone live on public mainnets within the past 12 months.\n\nOne newer layer 2 blockchain network, Blast, has attracted over $2 billion in crypto assets from a total of about 165,000 users, and yet the protocol has yet to activate its public mainnet. The Blast team announced on X that they would roll out Blast’s mainnet on Thursday, the same day ETHDenver founder John Paller and Colorado governor Jared Polls conduct the conference’s opening ceremony.\n\nRepresentatives of Arbitrum, Optimism, Base, and Mantle, among other Ethereum rollups, will be in Denver.\n\nNew Proposals and Techniques\n\nIn addition to fresh layer 2 entrants, applications and protocols on Ethereum have seen new proposals and techniques. For example, EigenLayer, widely known for introducing a new mechanism called “restaking,” has accumulated $8.88 billion in locked value in its smart contracts since it launched in June 2023.\n\nMeanwhile, the largest decentralized exchange by trading volume, Uniswap, is undergoing community discussions following Uniswap Foundation governance lead Erin Koen’s proposal to distribute fees generated by the protocol to UNI token holders.\n\n“2024 will be a year of growth, but also a year of evolution for crypto”, wrote Alex Thorn, head of research at Galaxy, in a report published in late January. In that vein, Ethereum’s multifaceted landscape is simultaneously maturing and changing, marked by technological experiments and strategic shifts within the space.\n\nContributors from EigenLayer, Uniswap, and other protocols will also be taking part in ETHDenver, and so those attending the conference can expect discussions inspired by panels, fireside chats, and even casual small talk, about the various elements of Ethereum: layer 2 scaling solutions, governance proposals, and staking techniques.\n\nPolitics\n\nETHDenver also comes as crypto lobbyists, lawyers, and regulators are preparing for the upcoming U.S. primary elections slated to start in April. As such, attendees can anticipate people sharing their views on the United States’ current political scene.\n\nPolicymakers have historically played an integral role in the crypto space through legislation and public remarks.\n\nSenator Elizabeth Warren said on Feb. 2 in a hearing of the U.S. Senate Committee on Banking, Housing, and Urban Affairs that “cyber criminals are exploiting cryptocurrency to scam American consumers out of billions of dollars every year.”\n\nFormer U.S. President Donald Trump, the frontrunner for the Republican presidential nomination, has not only released a few NFT collections but also said in a Fox News town hall event in South Carolina on Feb. 24 that he could “live with” people wanting to pay with BTC, after previously being fairly critical of the cryptocurrency.\n\nNotably, the United States Securities and Exchange Commission also approved several spot bitcoin exchange-traded funds (ETFs) last month, causing investors to speculate on when the SEC, headed by Gary Gensler, will approve spot ether ETFs.\n\nAt ETHDenver, several political figures will be speaking as well. On Thursday, SEC Commissioner Hester Peirce will be part of a fireside chat about public goods. U.S. presidential candidate Robert F. Kennedy Jr. will have a conversation on Saturday with the founder and CEO of Custodia Bank, Caitlin Long, about the role of blockchain policy. Colorado’s congressional representative Brittany Pettersen, who is a member of the House Financial Services Committee, will also be speaking on Saturday about the “Crypto Conversation in D.C.”\n\nBitcoiners, Solana Enthusiasts, and Avalanche Loyalists Pull Up, Too\n\nWhile ETHDenver initially was started by people intimately tied to the Ethereum community, the annual multi-day conference has drawn in individuals and communities outside of Ethereum, such as Bitcoin, Avalanche, and Solana.\n\nLast Friday, Solana Foundation developer advocate Nick Frostbutter spearheaded a workshop at ETHDenver to help people get started on Solana.\n\nCrypto enthusiasts can also attend the Hack House hosted by Ava Labs, the software development firm behind Avalanche, another layer 1 blockchain like Ethereum and Solana. “Looking forward to attending ETHDenver next week, going to check out the Avalanche hack House and catch up with some of my good friends in the Ethereum community,” Emin Gün Sirer, founder and CEO of Ava Labs, wrote on X last week.\n\nDenver will have Bitcoiners, too, as Bitcoin Renaissance, an event focused on the “synergies between Bitcoin and [Proof of Stake] chains,” like Ethereum, takes place on Thursday.\n\nAttendees will have the opportunity to engage, learn, and listen generously to individuals from a diverse range of blockchain ecosystems within and beyond Ethereum, the incumbent leader of smart contract functionality.\n\nIn the waning days of winter, Denver, already a physical portal to a new internet some have named “Web3,” heralds a dynamic atmosphere where people are meeting up to push the boundaries of decentralized networks.\n\nUnchained is a media partner of ETHDenver and will cover the conference. Stay tuned!"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOR1hNdzJ0NkVTV2FNVFpFd1dJOUlFQlZ6bGFLRVp2QVE1eVpwaEI3ZTNEak5LT3hPekZBQktKMFFLZlNfWDJFRFpqa0dva2l2a2V1amVLOGhzdkYzeFFMTUs5VTRVbWJnNzRCMjBoaGlhWDkxMWdfUGYtUWNBUFpHT0dtVE0tVnRxLUoxTjNKMmdZa2QzSjJhTFRfQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "What is the Dencun upgrade? Here’s what it means for Ethereum - DLNews",
        "content": "Ethereum developers expect to implement the network’s Dencun upgrade on March 13.\n\nThe upgrade will streamline how layer 2 networks interact with Ethereum and cut costs further for users.\n\nIt also lays the groundwork for further development towards a scalability mecca.\n\nNot to be outshined by Bitcoin’s halving event in April, Ethereum developers have another massive upgrade slated for next month.\n\nCalled Dencun, the upcoming fork is expected to cut costs for users on various layer-2 networks, specifically rollup platforms like Arbitrum, Base, zkSync, and Scroll.\n\nAfter successful runs on various Ethereum testnets — technical sandboxes that replicate the $418 billion network — Ethereum developer Tim Beiko reported that Dencun will go live on March 13.\n\nThis upgrade — like last year’s Shapella and the previous year’s Merge upgrades — is essentially a bundle of small changes suggested and discussed by core Ethereum developers. These changes are called “Ethereum Improvement Proposals,” or EIPs for short.\n\nDencun will include nine different EIPs. For users, the most important one is EIP-4844.\n\nThat’s because this specific change is expected to dramatically cut the costs of interacting on layer-2 networks. Specifically, this EIP will lower the cost for layer 2s to post batches of transactions to Ethereum.\n\n“Dencun is an exciting upgrade for the Ethereum ecosystem as it will drive the costs of using the network down across the board for all rollups,” Matter Labs engineer Anthony Rose told DL News.\n\n“This means less cost-friction and, hopefully, more usage.”\n\nJoin the community to get our latest stories and updates\n\nMatter Labs develops and maintains zkSync.\n\nRollups batch transactions — leverage trades, simple swaps, or loans —into much smaller pieces of data. This data, which is proof that all those transactions did indeed happen, is then sent to Ethereum.\n\nLess data means less congestion and lower gas costs on Ethereum.\n\nBut as activity has moved off Ethereum, rollups are also facing higher fees amid higher user activity.\n\n“Overall, EIP-4844 increases the capacity of all Ethereum L2s, reducing fees and scaling up the throughput of the entire ecosystem,” Roberto Bayardo, a software engineer at Base, told DL News.\n\n“Our contributions here will reduce transaction fees on Base from double-digit to single-digit cents.”\n\nScroll users should also see a marked drop in costs after the upgrade and data compression, Scroll researcher Toghurl Maharramov told DL News.\n\nDropping costs will open a plethora of new use cases only possible when costs have fallen to pennies. Bayardo pointed to onchain order book exchanges and gaming as a few examples, as well as marrying machine learning with crypto apps.\n\n“Use cases that were previously impractical due to cost may become practical, David Dennis, Offchain Labs’ product marketing lead, told DL News.\n\nOffchain Labs is the development firm behind Arbitrum.\n\n“This could include new growth in onchain gaming, generative art, AI, or new surprises.”\n\nNew use cases mean more potential hazards, though, suggests Maharramov.\n\n“The main risks that we’re aware of are the introduction of new primitives to the protocol and, as the result, bugs that can arise from those primitives.”\n\nWhat’s next for Ethereum after Dencun?\n\nLike upgrades before it, Dencun also sets the stage for further development, specifically, continued scalability.\n\nEIP-4844 ushers in Ethereum’s “Surge” phase, as specified by an updated network roadmap from Vitalik Buterin.\n\nThe end goal during this phase is to hit 100,000 transactions per second.\n\nThen “Scourge,” essentially avoiding centralisation and pesky MEV risks as rollups become the dominant scaling choice.\n\nThe “Verge” and “Purge” phases seek to make it even easier to verify all the data on Ethereum and eliminate any superfluous code written amid all the changes.\n\nAnd finally, the Canadian-Russian programmer introduced the “Splurge.”\n\nThe goal here?\n\n“Fix everything else.”\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBHSDJYYW53VS1fWGhJQUhDZjhFQ2dOVkJfQUppc0ZPMGdoU2R1OEQtWXpyeGE3eVU1ZjE2YW1NZG9XNGk0TUkxZ2RVVFpRQk44bGMyem5SemVYaE1FUVpPTGQybUhwdXfSAW9BVV95cUxQTm84aUY3WmRWT0dDdjV5RnE5NDhkOWJ1YmRpa0NybnROQ1pZTy1mMkNoay0zMVRkX09tdG5sdWwyQlM4b3AyTkNsUFUySzliQ3VxNHk5UjVNemtiMk9CSGh4U19WeGdkMDJ3bEg0dkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin Rides Bullish Sentiment to $59K as Ethereum Hits $3,300 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin shot past $59,000 early Wednesday morning and Ethereum reached the $3,300 mark amid growing bullish sentiment among crypto traders.\n\nTogether, BTC and ETH now account for $1.5 trillion, or 67%, of all digital assets globally. In the past day, the global market capitalization has grown by 3% to $2.3 trillion.\n\nThe Bitcoin price, currently $59,266.94 has risen 5.4% since this time yesterday and 15% since a week ago, according to CoinGecko data.\n\nAD\n\nAD\n\nBTC, the world's largest and oldest cryptocurrency, has been the beneficiary of a strong tailwind from the nine new spot Bitcoin ETFs that began trading in January. As of early Wednesday morning, the ETFs along with other BTC exchange-traded products have seen a total of $3.8 billion worth of volume and have a market capitalization just shy of $45 billion, according to CoinGlass.\n\nOn Tuesday alone, the spot Bitcoin ETFs saw net inflows worth $359 million.\n\nThe growing hope among traders is that because the ETFs have been taking in more Bitcoin than is newly released on the network each day, it will supercharge the effect of the Bitcoin halving in April.\n\nThe Bitcoin halving reduces the rewards paid to Bitcoin miners for validating transactions. In the history of Bitcoin, it's already happened three times before in 2012, 2016, and 2020. The block reward used to be 50 BTC, but has now been reduced to 6.25 BTC. After this year's halving—currently schedule for the middle of April—the block reward will be reduced to 3.125 BTC.\n\nIt's an anti-inflationary mechanism to reduce the rate at which Bitcoin's 21 billion supply is released to the network. The periodical reminder of scarcity tends to kick off a bull run each time it's happened before, but it remains to be seen how things will play out this time.\n\nAD\n\nAD\n\nMeanwhile, Ethereum has been getting a boost from anticipation for its Dencun upgrade. The change became even more real yesterday when developers announced that the change will be pushed to Ethereum mainnet on March 13, 2024.\n\nThe upgrade will usher in proto-danksharding, which will make transactions on the network much faster and more affordable.\n\nThere have also been signs that institutions are starting to give Ethereum a bigger footprint in their portfolios, according to a new report from ByBit."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxONUVLaFNSUG9DVHR2VHlfWEtuYVRXaExCMTdxWEQtSmNTS0otVWlZRkJ6RUJKeWlseGxpVnY3UzhrWEYzRTdGZWJtaDAtYl9rX0lwSXFFTXRaUlh3UjluN2NCVC1zd3h0d2RGcWxtcldlVGU0WEZXM2c3dUFfQWdQbWY3T2NrOVppTTlnSWFjR2JfN1RBcmxidWtxbmg2STQzQ0x4ZEVLT3UzTlVnWDhNLS1icXdXUGttOXJLcnJtNmpNbjFP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Emerges As CRE's Preferred Crypto As Investor Interest Reignites - Bisnow",
        "content": "Nearly a dozen companies, including investors like BlackRock and Fidelity Investments, filed applications this week to launch exchange-traded funds using ethereum, the favored cryptocurrency of the commercial real estate world.\n\nMany in CRE dipped their toes into crypto when the craze first hit the financial world years ago. But the renewed interest in the opaque digital currency spurred by a key Securities and Exchange Commission approval last month could open new doors for property investment.\n\nPhoenix-based NAI Horizon Executive Vice President Jeffrey Garza Walker told Bisnow he is hearing new buzz in CRE about crypto, and particularly ethereum, especially as major ETFs roll out. Garza Walker's specialty is industrial assets, and he believes that blockchain will be a normal way to transact commercial real estate within two years.\n\n“Certainly, there's a lot more momentum behind it now, a lot more velocity,” Garza Walker said. “There's a system in place to look at and start to get comfortable with. As people get more comfortable and feel that this is a safe way to transact, they are going to learn that it's quicker and much more easy than what's been traditionally done.”\n\nEther trades on the ethereum blockchain, and the two terms are often used interchangeably.\n\nCrypto is having its biggest week since before the crash in 2022, with investors pouring into the sector. Investments are being made in vehicles that didn't exist two years ago, such as ETFs that can invest directly in cryptocurrencies, like BlackRock's iShares Bitcoin Trust, which pulled in a record $520M in a single day on Tuesday.\n\nUntil recently, ETFs were only allowed to invest in crypto-adjacent entities, such as bitcoin miners. In January, the SEC approved ETFs that invest directly in bitcoin, and the agency may approve ETFs for ethereum in May.\n\nAs the erratic bad boy of the crypto world, bitcoin gets the glory and notoriety, but not wide acceptance by commercial real estate. As crypto's No. 2 entity, ether is a different story, quietly working its way into CRE.\n\nEther experiences less volatility than bitcoin, the stock price of which has whipsawed in the last five years, hitting a two-year high of more than $60K this week. Ether’s share price, meanwhile, reached over $3K this week, a 45% increase over last year.\n\nIn addition to being the more predictable of the two front-runners, ether is widely regarded as the best option for executing smart contracts, which are perhaps the most commonly used application of crypto among CRE professionals. Smart contracts can be executed automatically on ethereum, removing the need for intermediaries, and the system uses a special programming language that allows for high levels of customization.\n\nEthereum is the “settlement layer” of choice of Coinbase, the largest U.S. crypto exchange platform, according to Aaron Rafferty, co-founder of StandardDAO, a tech company that counts proptech among its specialties. In a crypto context, a settlement is the finalization of a transaction, such as a property sale, when it is stored within the blockchain.\n\n“Any platform utilizing the ethereum blockchain is essentially using smart contracts, which takes money in and distributes dividends once conditions are met,” according to The Crypto Realty Group CEO Piper Moretti. “The transactions are more transparent due to blockchain technology, but what investors really care about are the ease of trading and liquidity and not having to wait months or even years to get their money in or out of a deal.”\n\nEthereum is also pivotal in the tokenization of assets, which allows investors to acquire relatively small pieces of real property, with ownership registered via blockchain.\n\nThe tokenization concept, which uses blockchain to create “tokens” — essentially ownership units in an asset — has gotten more attention for artwork than real estate, but commercial property is moving in that direction.\n\nEarly attempts at tokenizing real estate taught the industry some important lessons, particularly around which properties would work with the strategy.\n\nIn 2018, tokenization firms Fluidity and Propellr attempted to tokenize part of a commercial property in Manhattan and failed because investors weren't able to wrap their heads around the concept, Moretti said.\n\n“The world wasn't ready for it, as only a small number of investors understood,” she said.\n\nBut when the owners of the prestigious St. Regis hotel in posh Aspen, Colorado, decided to tokenize not long after, investors were ready.\n\nInvestors wanted in on the name and reputation of the St. Regis, Moretti said. The property sits at the base of Aspen Mountain in one of the priciest ski towns in the country. It is frequented by celebrities and high-paying business magnates.\n\nThe St. Regis hotel in Aspen, Colorado\n\nWhile crypto-associated ETFs are grabbing headlines, ethereum is poised for an upgrade. An update called Dencun is scheduled to roll out on March 13, promising to make ethereum more efficient and, importantly for real estate, increase scalability for smart contracts.\n\n“Ethereum’s upcoming Dencun upgrade will generally reduce the cost to use smart contracts via Ethereum Layer 2s, while retaining the Ethereum network’s underlying security,” Grayscale Investments research analyst Will Ogden Moore told Bisnow via email.\n\nGrayscale is the world’s largest crypto asset manager, with more than $10B in assets under management.\n\n“This dynamic, plus the fact that Ethereum is the second largest crypto protocol by market cap, could encourage commercial real estate industry participants to choose Ethereum Layer 2s as they explore future projects on the blockchain,” Ogden Moore said.\n\nStill, there there are limits to what blockchain tech can do in a real estate context, said DGIM Law partner Isaac Marcushamer, adding that smart contracts might be more automated, but they won't take the place of courts in dispute resolutions or affect due diligence much.\n\n“You look at zoning, pro formas, environmentals, mechanicals and architectural surveys. I can't conceptualize how blockchain affects any of that,” Marcushamer said.\n\n“Blockchain appears to be a secure way of tracking transactions that you want to make public,” he said. “That's a really cool way to replace the hundreds of thousands of pages, or millions of pages, that are sitting in the county clerks’ offices.”\n\nBut there's a catch: government approval of such transfers. Control over how that process plays out remains with state or local governments in the United States, and Marcushamer isn't sure that they will come around anytime soon.\n\n“I don't see how, in the buying and selling of real estate, blockchain has the right ingredients yet to make something happen,” Marcushamer said. “Maybe someone will use it as a way to vet that you want to lease an apartment and use it to sign your lease, sure. But those are relatively friction-free transactions today.”\n\nCRE is edging into ethereum-associated blockchain technology, but real estate is still real estate, Marcushamer said, in that it is a slow adopter of new tech.\n\n“Blockchain isn't in its infancy anymore,” Marcushamer said. “I think it's a toddler or a preteen in its evolution. It's starting to have an identity, to be understood for what it is. But the pace of adoption in the blockchain field is going to be slow as we kind of continue to go through this period of uncertainty in real estate.”\n\nThe spiking value of bitcoin and other cryptocurrencies in February is drawing attention to the sector, but since values are volatile, the normalization of crypto ETFs will be more lasting in its impact, Moretti said. Once the big players are in crypto, others will jump in, including real estate players.\n\n“It's not just a fad, and it's not something that's just played out, because we have these large-scale financial institutions embracing it who have figured out a way to make it more accessible to traditional investors in ETFs,” Moretti said.\n\nWide-scale adoption isn't going to happen instantly, but the momentum is there, with the approval of ethereum-associated ETFs adding to it, she said.\n\n“The more adoption, the easier it is for the real estate industry to embrace something like this,” Moretti said, referring to the use of ethereum for smart contracts and tokenization. “Companies like mine are primed for this kind of thing. We're ready for it. Other companies in the real estate industry, not so much, because they haven't been paying attention.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOSWpMWlNBRzhuemJldTlESG41RXFGcUIyd3pLd3dTYVZqX2JIdDFBVzY5SWhUUmtYX0hJRWtPMUo4MVRoTmxPaXdjMkptRmJpelZJTjlJcE5UdXBYUVJuM3FLNXBJMHZvOFhZWFBqY2luSDA4anFsTWxTZ1kyeXBZT2h1RGkwMlNWV1VhNEpIT3RIcTZnZzF6NXF3T0M5MktCV0daODNVakVjMjhTd3djUWNRM3RVMWxTN3JjZnozVGNydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "White & Case advises ETC Group on first crypto ETP based on Ethereum total return index - White & Case LLP",
        "content": "Global law firm White & Case LLP has advised ETC Group, Europe's leading provider of digital asset-backed securities, on the expansion of its product portfolio to include the first Ethereum staking exchange traded product (ETP) based on a total return index.\n\nLike the company's other exchange traded commodities (ETCs), including the world's first centrally cleared Bitcoin ETP and the first Crypto ETC tracking an MSCI Index, the new product, which tracks the performance of the Compass Ethereum Total Return Monthly Index, is traded in fiat currency and connects the crypto market with the traditional stock market, allowing trading with a secure and liquid product on regulated markets.\n\nThe new product is listed on the German stock exchange XETRA. The product is 100 percent physically backed by Ether, which is securely held at a regulated custodian.\n\nETC Group was founded in 2019 to provide investors with the tools to access the investment opportunities of the digital assets and blockchain ecosystem. The company develops innovative digital asset-backed securities including ETC Group Physical Bitcoin (BTCE) and ETC Group MSCI Digital Assets Select 20 ETP (DA20), which are listed on European exchanges including XETRA, Euronext, SIX, AQUIS UK and Wiener Börse.\n\nThe White & Case team in Frankfurt which advised on the transaction included partner Karsten Wöckener, local partner Claire-Marie Mallad and associate Daniel Sander.\n\nPress contact\n\nFor more information please speak to your local media contact."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPX0tzSGw2b3Yzc2pZcVFlOTJWOWdQNk5zTEw2aG9USXN0VXg2c01aNWdYdjNzS1JKX2RfUmhvOGZ6U2gtWkRNS3BEa2tabHNXU3huc3JoQ2REU3hPeHc0eGlzT0tpSGhrRVFnYmpCMDIwUS1aRVFLSk52ZmR1dmRXMjRqamI1MER1eEJrLWM2aTlibGczdUROZE9NVENSRkJmTEo4X1ZzZ19NVl9XY3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Traders Eye $4,000 Price Target as Markets Overheat - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRWVfMjZid3pJbWxadE5OT1ZiUHJCTDNUTkFkVWdsYkh6Zk1rT2xjRG1RZFdiNW9ZYlRtSUZuMWJ4VEJpa0dta051ZkFBc3MzTzNKSzk3MW1kdG1NS0xOOENzUWpfcnpCQktmTXA4ZmY5Y3k4YjdqelRtQkhHMkVUWm1ZWU1WUG1TWEttMVZqLU16SHRoNkdB0gGcAUFVX3lxTE1HT2I2bjdhbjM2Y2xaMjV1d292d1dmeW81aGdSY0wyMlptYUFyT25LcU9UUkVOdFB2QklzU2ZaX3BwZU9jSlJlMkE1U09FS3JXQ1VWODhVRHY4Y19HRUkwVVZ2TGlhQk1BaVhGZnZVVldLbDhOdjNiUlVNbzdiajVxSUlYSVRVNTJvZUFIaFkyVm92QW8xc3RVZGxqeA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "What to Expect From Ethereum’s Cancun-Deneb Upgrade - CoinDesk",
        "content": "Ethereum's network transitioned from Proof-of-Stake to Proof-of-Work in 2022 (the “Merge”), with ether becoming a deflationary asset as a result. Currently, more than 25% of Ethereum's total supply is locked in staking platforms, significantly reducing the available supply for trading or investing. This shock coincides with a burning mechanism reducing ETH supply by 0.21% per year."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE93LWtvS1dPQm1RbFlaeEMtc2tVLW9uUmFZaWVyZG94d0l2REMtVG96Z0J5U3QtOWhVNnVMUElrYXQzblBBQnRaNzl6R0ZHR1lPT09Rb0dfcS1aeUlyMWI0RkRjZ1g2T2RqQXRjUUNEZzZhY2tqNUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum devs debate future of account abstraction - Blockworks",
        "content": "Ethereum’s Dencun upgrade is all set for March 13, as Thursday’s core developer call reiterated that client teams are all-systems-go for mainnet.\n\nAttention quickly returned to the candidates for inclusion in the next upgrade after Dencun, now referred to as Pectra — and specifically the Ethereum Improvement Proposals (EIP) that deal with issues of account abstraction.\n\nThe challenge: making the account abstraction roadmap more concrete.\n\nEthereum co-founder Vitalik Buterin, who rarely participates in core developer calls these days, kicked off the discussion by calling for “long-term goal alignment.”\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nAside from a few “smaller things,” there are four main goals for an account system revamp, on Ethereum, Buterin said. It should:\n\nallow for key rotation and key deprecations; be quantum computer resistant; allow batching; allow sponsored transactions.\n\nThe first two goals are clearly not satisfied by Ethereum’s “end user account” (EOA) model, hence the need to move the entire EVM ecosystem towards smart contract accounts (SCAs).\n\n“One thing that would be good to avoid is essentially creating two totally separate developer ecosystems for smart contract wallets and for EOAs,” Buterin said.\n\nCore developers have previously identified a need to deliver feature upgrades that improve the user experience in the short term, even as they work to deliver on a multi-year roadmap for Ethereum.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nEthereum’s first mainnet foray into account abstraction was EIP-4337, which debuted at the ETHDenver conference in 2023.\n\n“It was meant to be a testbed,” Ethereum developer Yoav Weiss reminded his colleagues on the call. “It allows [us] to experiment with account abstraction on different EVM chains without having to reach consensus on how account abstraction works.”\n\nSince then, the improvement has yielded millions of smart contract accounts. Layer-2 networks zkSync and Starknet have even enshrined their own 4337-based native account abstraction approaches.\n\nBut there’s a catch. These bespoke implementations caused wallet fragmentation — you can’t use Starknet’s Argent wallet on other chains — and potentially new attack vectors, according to Weiss.\n\nThe solution is to have a standardized and secure version that any layer-2 can use, enabling a better user experience across chains.\n\n“It’s something that’s going to happen with or without us, so we may as well help them get it right,” Weiss said.\n\nNext steps\n\nDevelopers focused on two competing EIPs that are being considered as a stepping stone towards a more comprehensive smart contract account system on Ethereum: EIP-3074 and 5806.\n\nCore developers Lightclient and Andrew Ashkhmin favored the former, while Weiss outlined some advantages of the latter.\n\nThe consensus was that more discussion is needed, but one thing is clear: Whatever option wins out for Pectra, it should keep open the path for further innovation.\n\n“We need to make sure no EIPs make it hard for us to do account abstraction later, and both of these [3074 and 5806] are fine in that sense,” Weiss agreed.\n\nDevelopers must weigh the need to improve Ethereum for its current users, while remaining aligned on the future trajectory of the network.\n\nAccording to Ashkmin, a software engineer with the Erigon client team, EIP-3074 is fairly EOA-specific but has “a pretty natural path to extend it to be smart contract focused as well.”\n\nThat’s a good thing, said Ahmed Bitar, a core developer at Nethermind, noting that EOAs aren’t going anywhere until “normal users” (think: your mom) can readily deal with smart contract accounts.\n\nButerin, who doesn’t make decisions but whose opinion carries weight in the Ethereum community, embraced that approach.\n\n“I think that’s exactly why 3074 and 5806 are being discussed,” he said. “In the long term, if there is an endgame where EOAs get removed as a protocol feature, that will not mean any kind of forced wallet change for users.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQZ0JqUWs5OUVSMWhMcndLY2s4enVJS2lhWHFrTWdzR1RrOUE2SG9iaWFCVDVCV3BfSXVrNzJkenQ1S1BjckNHdExETzBzeGp1VGJFTXctcFFEbVJFMVVSNW1XNllxV0VQWkJNQnVfcnBBOWJZNW8wWUFwYzFfR1VPdFJJaE9uOHliZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs are here and thriving. Is Ethereum next? - Yahoo Finance",
        "content": "As Bitcoin (BTC) celebrates its 15th birthday, it is revelling in a long-awaited gift: a bump-up in price and newfound liquidity, thanks in no small part to the US Securities and Exchange Commission's recent approval of spot Bitcoin ETFs.\n\nSpurred by a Grayscale court victory, The SEC's early January decision to grant 11 firms license to offer spot Bitcoin ETFs ushers in a new era for the oldest and most widely accepted digital asset by offering traditional retail investors easier access and giving it more mainstream credibility.\n\nWith the price of Bitcoin jumping more than 50% in 2024 and with Ethereum (ETH) and other digital currencies climbing back to near-record highs, the question now is what's next for Bitcoin, Ethereum, and other cryptocurrencies.\n\nIs it a store of value, like gold? Is it a digital replacement to 'paper money,' or fiat currency? Is it a way to help investors diversify their investment portfolios? Or is it the framework for ledger technology that will continue to re-define how digital information is stored, encrypted and valued?\n\nIn the short term, as well, other factors are driving the price of Bitcoin, including an expected “halving,” which cuts in half the amount of tokens that Bitcoin miners receive as reward for their work. The next halving, which happens once every four years is so, is due to occur in April.\n\nIn this segment sponsored by Grayscale, Yahoo Finance Senior Contributor Corey Goldman sat down with a who's who of Bitcoin experts, including Grayscale CEO, Michael Sonnenshein, CoinDesk Indices Managing Director Andy Baehr, Matt Kohrs, host of the crypto-focused Matt Kohrs show, and TechCrunch Senior Cryptocurrency Reporter, Jacquelyn Melinek, to break it all down.\n\nFor more expert insight and the latest market action, check out Yahoo Finance Live Monday through Friday.\n\nEditor's note: This article was written by Corey Goldman and Luke Brooks.\n\nVideo Transcript\n\nCOREY GOLDMAN: Bitcoin celebrating its 15th birthday this year with the SEC giving the digital asset the gift of additional credibility by allowing retail investors to invest in the tokens via spot ETFs. Indeed, the SEC's early January decision to grant 11 firms license to offer spot Bitcoin ETFs ushers in a new era for the oldest and most widely accepted digital asset by offering traditional retail investors easier access and giving it more mainstream credibility. The question now is, what's next?\n\nTo unpack what's in store for Bitcoin, Ethereum, and other cryptocurrencies I'm joined by several cryptocurrency experts, including Grayscale CEO Michael Sonnenshein, CoinDesk Indices Managing Director Andy Baehr; Matt Kohrs, host of the crypto-focused \"Matt Kohrs Show;\" and TechCrunch Senior Cryptocurrency Reporter Jacquelyn Melinek.\n\nStory continues\n\nSo some time has passed since the SEC gave license to these new spot Bitcoin ETFs. We know that. For starters, why don't we talk about why it was such a landmark decision? So maybe, Matt, you can talk about it first. You know, what do you feel really sort of pushed the ball forward in terms of this particular SEC stamp of approval?\n\nMATT KOHRS: I think from the retail side, it was more of the first opportunity that the average person now has the accessibility to protection from the government. And now with the continual debasement of the dollar, little protection from that. So I think it's exciting times that we got that regulatory clarity, very much thank you to Grayscale.\n\nCOREY GOLDMAN: Fair enough. And, you know, Jacquelyn, I mean, what are your thoughts? What have we learned so far, do you think, in terms of the SEC's move?\n\nJACQUELYN MELINEK: I think this was a matter of when, not if this will happen. I've talked to Michael in the past about this. And he said this was a 10-year long process waiting for this moment. The first spot Bitcoin ETF application was filed over a decade ago. And nobody really gave up from that point to this day. And I think in a way, it brought in so much more demand than we even anticipated.\n\nCOREY GOLDMAN: In terms of what the investor behavior has been-- I mean, you've seen that so far, I mean, what's that taught us? What have we seen so far?\n\nANDY BAEHR: You know, cryptocurrencies are a really unique asset class in that it started from the bottom. It started from individuals and enthusiasts. And it's kind of swimming its way upstream to institutional adoption. So the ETF is the first way at least for Bitcoin for people to have conversations with advisors and advisors to put Bitcoin into their portfolios in a way which reflects their kind of primary financial planning. So it's been a tremendous success.\n\nCOREY GOLDMAN: All music to your ears, I'm sure.\n\nMICHAEL SONNENSHEIN: Indeed.\n\nCOREY GOLDMAN: You know, I guess the question is, how much of that momentum have you been seeing? What was your-- what's your perspective?\n\nMICHAEL SONNENSHEIN: Well it is-- I really think crypto's mainstream moment, right? I think for so long, crypto had been outside of mainstream financial services. And the spot Bitcoin ETF wrapper now being in market, now having over 10 spot Bitcoin ETFs in market really does weave Bitcoin firmly into the fabric of the financial services landscape. So I do think it's a very, very important moment and one that certainly my team and a lot of folks around the industry are really excited about and wanting to now capitalize on that momentum.\n\nCOREY GOLDMAN: I mean, in terms of, you know, where things have gone, a bit of time has passed. Have there been any unforeseen surprises?\n\nMICHAEL SONNENSHEIN: You know, I think if anything, a lot of folks maybe thought that it would take longer to see the advised market come online. You know, here in the US, there's about $40 trillion of advised wealth. And so starting to see our clients increasingly move towards that financial advisor audience wanting to have those conversations.\n\nIt really has kind of been two buckets. And they've come online really quickly. One is I'm really scared, and I don't know what to do about this. But my clients are asking about it. Or it's two, I'm personally excited about this. What's going to be the best way to have that conversation with clients? What's the best way to integrate it into portfolios?\n\nCOREY GOLDMAN: And, Jacquelyn, what about you for your audience? You know, what are you guys focusing on? And what have you seen that's maybe not what you were expecting?\n\nJACQUELYN MELINEK: Yeah, I think this just adds a lot of legitimacy to the digital asset sector. I mean, having the SEC approve 11, not 1, 2, 3, 5, but 11 issuers is just like a massive move for the industry. And while there's still an uphill battle for future ETFs-- I'm sure we'll talk about that-- I think it just adds to the fact that this is getting Wall Street and crypto together and providing a bridge for the two.\n\nCOREY GOLDMAN: Now one thing you definitely see-- and I'm going to start with you over here-- I mean, that we've seen since the SEC's approval has been the shift in the price of Bitcoin itself. So maybe you talk-- tell us a little bit about what that means. How does the price of Bitcoin, how is that affected by what the SEC has decided to approve?\n\nANDY BAEHR: For sure. And, you know, just to touch on the earlier point, the market structure around the launch of the ETFs worked immaculately well. And it was probably-- I can't imagine a more difficult 11 different ETF launches, futures markets, spot markets, 24/7 intersecting with 9:30 to 4 o'clock. And everything went off without a hitch.\n\nI think the market gained tremendous confidence that the crypto-native market structure was there to meet the demand for the ETFs and continues to do so. That's critically important considering that banks aren't really participating in this asset class yet. So I think a lot of the strength has come from the fact that the network effect is now going to include ETF holders and their advisors. And that means there's just a wider audience.\n\nSo one of the long-term drivers of the price of Bitcoin is the network, how many people need it and for what they're holding purpose is and for what they're holding duration is. There are other macroeconomic factors which we think drive the price of Bitcoin. There are technical things like the halving coming up, which some people predict will put us-- some stability or some support underneath the price.\n\nBut for the newer investors, especially those who are working with advisors who have more of a long-term view of an allocation, they really should be able to gain some confidence from the stability of the first month out.\n\nCOREY GOLDMAN: Now, one of the things that we saw-- Jacquelyn, I'll just throw this quickly to you-- it was this by the, you know, sort of sell the fact kind of movement once the SEC made its decision or announced what it was doing. What do you attribute to that? I mean because at this point, it has recovered from what we can see. But what was going on in terms of the Bitcoin price itself? And what's next?\n\nJACQUELYN MELINEK: I think, you know, there's been over $40 billion already put into the Bitcoin spot ETFs across all 11 by market cap. And so as a result, I think you're going to see price go up. And similar to the comment about Bitcoin having supply and demand, constraints will exist there. And I think it's just going to be a pretty positive year for Bitcoin. There's so many points that are just signaling that the demand will continue to increase for Bitcoin, the ETFs, and just the market in general.\n\nCOREY GOLDMAN: The SEC's approval of spot Bitcoin ETFs is arguably given the digital currency a long awaited seal of approval, though it's also created new factors to consider like volatility and, of course, regulation. Or has it?\n\nQuick question around the room here. We're going to talk a little bit more about exactly what it means. It's one thing to actually have the SEC give it seal of approval. But there's a lot of stuff that goes behind the scenes in terms of what they actually now require. So I'm going to hand that one off to you to start. What's your view? I mean, how are things shaping up there?\n\nANDY BAEHR: Market structure, as we said earlier, has been performing spectacularly well. All of the Bitcoin ETFs are tracking the price of Bitcoin quite well. A lot of people don't understand, the Bitcoin market structure that exists in the crypto-native world is extremely robust and is made up mostly of people who used to be in traditional finance.\n\nSo there are futures markets. There are options markets. There are lending and borrowing markets. I think that the market structure has proven itself clearly robust enough to support spot Bitcoin ETFs in this country as it has in other countries for many years.\n\nAlso, about volatility, Bitcoin used to be about four or five times as volatile as, say, equities. Due to a number of factors, including the growth of the network, Bitcoin actually over the summer was a little bit more volatile than equities are during a turbulent period.\n\nSo the volatility has come down quite a lot as the market has expanded. I think that we have a very good asset to underlie an ETF market that the regulators should be very pleased with.\n\nCOREY GOLDMAN: Just a question related to that. I mean, in terms of what and when is going to be reported to the SEC because that's what they all want-- they want lots of information, you know, regular filings, all that. What are your thoughts, or what are you hearing about what people maybe have to do to prepare based on what's now been approved?\n\nMATT KOHRS: In terms of volatility, gold was volatile. A lot of the times, that's the biggest thing of like, How could this be a store of value? up until 2004 in November when we sold the gold ETF, right? Before that, it was common to have 20% drawdowns. Like, it was nothing.\n\nAnd then once again, as Wall Street actually entered in and there was more money, things settled down. And it started to act the way it was perceived to be. And I have no hesitation that Bitcoin will do the exact same thing.\n\nAnd then with the SEC in terms of regulations and paying attention, well, that kind of gets into the world of, are we talking on Wall Street or native crypto? Obviously, two very distinct veins. I myself prefer to be in control of my own Bitcoin. But I also understand how there's some hesitation that maybe don't fully understand the technological aspects that they would prefer someone to hold the Bitcoin for them, obviously, a trusted party.\n\nCOREY GOLDMAN: And, you know, maybe that's a great question to pass over to you, which is the focus here is on the retail investor.\n\nMICHAEL SONNENSHEIN: Sure.\n\nCOREY GOLDMAN: Right? So at the end of the day, how much do they need to worry about what the SEC is actually looking at versus the institutional players, everybody else behind the scenes?\n\nMICHAEL SONNENSHEIN: Well, this is something that at Grayscale we've been committed to for many, many years. GBTC, the Grayscale Bitcoin Trust ETF, actually became the first SEC reporting company in January of 2020. And so in many ways, the 10-Ks, the 10-Qs, the 8-Ks, all of the disclosure that we've put into those documents, that has really paved the way forward, not just for GBTC to come to market as an ETF but for all the other spot Bitcoin ETF issuers as well.\n\nAnd so we've really had a constructive dialogue with the SEC to continue to expand our disclosures, expand our reporting, and really continue to try and bridge that educational gap because crypto does move quickly. That's one of the things we've all been talking about today is really that the ecosystem continues to evolve, demonstrate its resiliency. And it's incumbent upon us as industry players to make sure that we're, you know, giving them a trusted source of information.\n\nCOREY GOLDMAN: Fair enough. And, Jacquelyn, I mean, from your perspective again, you know, just looking at your audience, how closely do we have to watch what the SEC is going to say once that reporting starts to come through?\n\nJACQUELYN MELINEK: I think it's extremely important to watch what the SEC is saying and also what they're not saying. I think the delays last month with the Grayscale and BlackRock spot Ethereum ETF applications speaks volumes by itself. They don't have to say much. And also, the decision, a 3 to 2 vote to approve the spot Bitcoin ETFs, was also them saying something that it was like a push/pull situation. Not everyone was on board with each other. And the conversations are still going to be an uphill battle.\n\nCOREY GOLDMAN: As we all know, Bitcoin is structurally different. It's different than other cryptocurrencies. The question is, you know, how has that impacted the NAV, you know, in terms of looking at some of these spot Bitcoin ETFs and even just other products in general? And how might it affect that net asset value of some other types of potential cryptocurrencies or spot ETF cryptocurrencies going forward?\n\nMICHAEL SONNENSHEIN: Well, I think one of the most important takeaways for this audience or really anybody thinking about Bitcoin is that there are multiple use cases. And there are multiple truths around Bitcoin. I'd say the narrative that is most solidified itself on Wall Street is probably looking at Bitcoin as digital gold or a digital store of value.\n\nBut that's not to say that other investors aren't also getting very excited about the potential for Bitcoin to be a transactional mechanism to allow us to move value at the same speed that we move information. Other folks may be attracted to Bitcoin for the underlying blockchain technology and all the new use cases that we're beginning to unlock around using that distributed ledger technology to really take care of things like ownership and provenance and authenticity.\n\nAnd that's OK. It's OK for it to mean multiple things to multiple people. And I do believe over time, it will mean even more things to even a larger audience of people.\n\nCOREY GOLDMAN: Matt, I'll throw that same question over to you.\n\nMATT KOHRS: I think from a philosophical standpoint, it's a store of value. I think from a technological standpoint, it's a protocol. But then I think from a realistic standpoint, it is the first globally accessible public money. Right now in this world, half of our population has no access to a bank.\n\nThis, obviously, with other technological developments globally allows them to not have access to a bank but allows them to be a bank. We are on the forefront of an exponential growth of what this means for the financial sector. We've seen this before historically. Money goes in the way of being the most efficient, the most usable. This is the next logical iteration that is being propelled because of the technology that we have, which is blockchain.\n\nCOREY GOLDMAN: And is the idea behind that-- and I'll ask you this question that-- you know, and again, some people will think of it as, OK, well, if a-- one Bitcoin is worth $50,000-- and then you have this halving coming up-- how does that work? Like, how do you actually create a whole ecosystem of a currency, a global currency, as you mentioned, around something that's very finite and static and--\n\nANDY BAEHR: Yeah, couple of--\n\nCOREY GOLDMAN: --has a really high price tag?\n\nANDY BAEHR: --interesting points there. When you say a Bitcoin is worth $50,000, there's two values there. There's Bitcoin, and there's dollars, right? So the value of Bitcoin being linked to dollars might be a way to express a view on Bitcoin. It might be a way to express a view on dollars.\n\nIf you think that dollars are going to come under a tremendous amount of pressure, you're going to hop over to Bitcoin for relative safety. But it can also have a macroeconomic interpretation because what? Dollars have inflation. Dollars have an interest rate. Dollars have policy that's driven by the Federal Reserve.\n\nBitcoin has none of these things, right? Its supply is locked in. There's no policy that's going to change the amount of supply. And that can be an attractive alternative for diversification or just for certainty. So for a small allocation to portfolio, it can actually have a lot of power. Add to that its diversification properties to traditional assets. Add to that its historical right skewed distribution. And suddenly, you might be asking your advisor, can we add more Bitcoin rather than should we be adding any at all?\n\nMICHAEL SONNENSHEIN: And I think, Andy, the other thing that's so interesting about that is that when you look at correlations amongst different asset classes, where you are today in terms of risk/reward on equities, on fixed income, on all the different places that investors have to park cash capital, it's become so concentrated. And so investors are looking to assets like Bitcoin looking to assets like Ethereum to provide that diversification benefit to their portfolios.\n\nAnd as more and more investors do this, they look back at their portfolios. And they talk to their advisor at the end of the year. And they question, well, did I beat the S&P 500 or not? But they also now may start having to ask themselves, well, am I behind from a returns perspective because I also didn't have that incremental additive of Bitcoin or Ethereum in my portfolio?\n\nCOREY GOLDMAN: So many of the SEC's approval of spot Bitcoin ETFs is only the beginning with many more types of digital currencies and assets starting with Ethereum, next up. In fact, Coinbase recently wrote about the SEC and the benefits of Ethereum and why a spot ETF makes sense. So what does the future investing in digital currencies and assets look like? I will throw this one over to you, Michael. What is your view?\n\nMICHAEL SONNENSHEIN: Grayscale operates Grayscale Ethereum Trust tickery, ETHE. It's the largest Ethereum fund in the world. We have applied to the SEC to uplist ETHE to a spot Ethereum ETF. I think when we examine the crypto landscape, very similar to what we saw in Bitcoin when I was being asked these exact same types of questions, Ethereum has a very, very similar setup in the sense that there is an inextricable tie, almost 100% correlation between Ethereum derivatives, right, the Ethereum futures market and the spot Ethereum market.\n\nAnd so the fact that we now have an ecosystem of Ethereum futures-based ETFs here in the US, there really is no reason to deny the uplisting or the approval of spot Ethereum ETF to come to market as well. Certainly, Bitcoin and Ethereum are the two largest assets by market cap within the crypto landscape. And so my belief, the Grayscale belief is that spot Ethereum ETFs are a matter of when, not a matter of if.\n\nCOREY GOLDMAN: I think there is maybe some discussion and debate about the when and if scenario. Maybe, Jacquelyn, I can ask you a little bit more about that and what your thoughts are.\n\nJACQUELYN MELINEK: Yeah, I actually interviewed SEC Commissioner Hester Peirce last month. And I asked her, of course, about the spot Ethereum ETF applications and what the timeline for that is. Of course, she declined to comment. But at the same time, she also said like when the spot Bitcoin ETFs were approved, it wasn't like the day of crypto dawned on the SEC. It was a big moment for the industry, yes. But that didn't mean everything was changing. There's a whole new leaf.\n\nBut at the same time, she said, we have to be prepared for when that day does come. And maybe it is a matter of when, not if. But the timeline for that is unclear. But I think the amount of demand that we've seen with the spot Bitcoin ETF will show that this is something institutions and investors want regardless if the SEC is in favor of it.\n\nCOREY GOLDMAN: I mean, there are differences. We know that. So I mean, it's not all going to be the same process necessarily of getting these things approved. Is that fair to say?\n\nMATT KOHRS: To my understanding-- and, obviously, the rest of the panel would love for you to weigh in-- is there a major difference with it currently being a security and not necessarily defined as a commodity when coming into the initial lawsuit that you guys had. It was Bitcoin, clearly, a digital commodity.\n\nANDY BAEHR: The market structure around Ethereum is just about as robust as Bitcoin's. In Canada, you've had Bitcoin and Ether ETF for several years now. I think that the idea-- and actually, the idea of a spot Ether ETF is great because it allows these investors and advisors to think about a completely different investment story with Ethereum as to Bitcoin.\n\nBitcoin being a store of value, a macro asset, having its own properties. And Ethereum really representing kind of the growth of all these projects, smart contracts, and adoption. They really kind of pair well together. And they work really well as educational tools, which in-- with two-- only two tokens show you the whole breadth of what digital assets can do.\n\nSo we can't wait for that to be the case. We feel that after that, after the two majors are available independently, people will want to move towards an index so that they can get all the next winners of the next generation.\n\nCOREY GOLDMAN: So, Michael, all of this really speaks to the various types of use cases, right? What about the average investor? I mean, how does an increasing roster, if you will, of cryptocurrencies, what-- how did-- how does that apply? And what do people do with that?\n\nMICHAEL SONNENSHEIN: Well, I think for the average retail investor, what's been interesting about crypto as an asset class-- I think we were talking about this earlier-- is it actually landed in the hands of retail before it landed in the hands of institutions, which it's never really been the case as other asset classes have been developed on Wall Street. And so there have been some retail investors that have certainly gone involved in crypto, buying Bitcoin directly, or perhaps even buying shares of GBTC in their brokerage account. That's now been mainstreamed not just to retail but to advised wealth and even institutions through the onset of Bitcoin ETFs.\n\nWhat we have been hearing, though, from investors, to Andy's point, is that they want to diversify now. They understand the use case of Bitcoin. They understand the role that it plays in their portfolio. And they're not only looking at assets like Ethereum and just kind of going down the market cap list of crypto assets. But then they're starting to think about, well, what else is out there?\n\nAnd so now that Bitcoin has kind of had its mainstream moment, a lot of those questions coming in from investors as to, well, what else should I be focused on? What other areas of crypto can I help even diversify my Bitcoin holdings across?\n\nCOREY GOLDMAN: Right, that makes sense. And, you know-- and when you had mentioned earlier about it sort of the idea of Bitcoin being this global currency-- so you have sort of two layers there. You have one where you have one digital currency that's actually something that could be used to buy and sell stuff. And then you have another type of currency or future types of cryptocurrencies where you're going to build out investment products. So what do you think is the more, I guess, the quicker route here? Like, what do you think is going to take off first?\n\nMATT KOHRS: I think it's comparing the equivalent would be two blue chip stocks, two different addressable markets, two completely different things. One is a store of value, you-- your own bank. The other one is a completely new vision on technology itself. And I myself, if available on the market, would happily invest in both. I don't think you have to pick between the two because I think strongly that both have a bright future.\n\nCOREY GOLDMAN: Jacquelyn, what are your thoughts?\n\nJACQUELYN MELINEK: I think there are separate groups of people in this. So there will be people who are in it for solely speculative purposes. There are people who are investing long-term. And then as Michael mentioned and Matt, that there will be people who will see the value of this and then explore beyond just buying Bitcoin. There are so many, like, use cases and sectors within this industry beyond just the token. And I think once people dive in and get a little bit of education, curiosity will grow.\n\nANDY BAEHR: Yeah, the-- that first intuition meeting, right? You can only kind of teach or provide intuition for kind of one thing at a time. And Bitcoin's a great place to start, right? So relatively simple blockchain. It's 15 years old. It hasn't changed very much. It kind of has one job.\n\nOnce people get over that and get their intuition together about how blockchain technology really works to the extent that it gives them confidence, moving into Ethereum and saying, oh, I'm going to use that same technology to build stuff on top of, I get that. And now I'm going to use that same blockchain technology to do entertainment or gaming or other kind of functions. And kind of, that's how the world changes a little bit, both in terms of finance and other things that impact. And when-- so when people say digital assets have the same potential as the internet or mobile telephones or things like that--\n\nMICHAEL SONNENSHEIN: I think Andy is spot on, no pun intended, with our conversation today. It is-- you know, I think there's a lot of questions from investors as to whether or not it's too late. It's too late to start learning. It's too late to start investing in crypto just because it's had the run up that it's had.\n\nIt is still in the early early, early days of this ecosystem. And we are going to continue to see new use cases come unlocked. As the monetary base within crypto becomes larger, that is going to kick off really a flywheel that will lead to development work, new addressable markets, new users. And that's the kind of stuff that I think gets everybody on this panel really, really excited. So it's not too late. And if you're confused, no better time than the present to really start bridging that educational gap.\n\nCOREY GOLDMAN: Michael Sonnenshein, Grayscale's CEO, thank you for joining us today. Andy, likewise, thank you. Matt, appreciate your time. And, of course, Jacquelyn, thank you for joining us."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPNHZBbVhyZmZXTnhQVmdUZFdWZzRmVmtBVkpBc3hoSzFZV0VUSGlWdnpTZzh0cDhfUXZjeUp3YUZQa29FZFI3ZmMtM2owbWMwOUdwaWN0cncwZEFvd044M3pvUW43dUNjeHFTYWJDSGJZMlh5Q1JnTm1WRjloVmZTaXhB0gGKAUFVX3lxTFBNVFZTSUZHak4wSWVXeFhFckVIX3dZckdBdjB2Y0tySDVXQlVQSUxlZ3ZvZEFvNnRSakQ2c3VrLVNwVUhGTk9ybTQ0LUtEUURGYlRtSnVXTXczSVlRVE9vLXpVUU4zSkZUZW1yVUgybVY3c3F1d29FWlk0ZC1WdGcwTFhjaDZ6WFJGQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Blast Unlocks $2.3 Billion in Crypto as Ethereum Scaler Launches - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlast, an Ethereum layer-2 scaling network from the founder of leading NFT marketplace Blur, launched its mainnet Thursday afternoon, finally unlocking billions of dollars’ worth of crypto funds that users had locked up in an effort to earn staking and airdrop rewards.\n\nMore than $2.3 billion had been staked into the bridge from the Ethereum mainnet to Blast, according to the Blast website just before the scaling network went online. Blast was revealed in November, alongside the bridge and rewards campaign.\n\nThe total had been rapidly climbing over the last few days, in part because traders were attempting to get their funds onto Blast to take advantage of a growing slate of projects that will launch on the network and airdrop tokens and rewards to early users.\n\nIn addition, the growing price of Ethereum in recent days helped grow the value of what had already been staked. Ethereum’s price is up 12% over the last week amid a wider market surge fueled by Bitcoin, which spiked to a price of nearly $64,000 on Wednesday.\n\nAD\n\nAD\n\nTo recap, Blast is the L2 with native yield. ETH and stablecoin balances on Blast are automatically yield bearing. This increases capital efficiency for users and unlocks new possibilities for Dapps. — Blast (@Blast_L2) February 29, 2024\n\nWhile some Blast users may be keeping their funds on the network to take advantage of newly launched apps and protocols—plus continued staking rewards and airdrop benefits ahead—others are withdrawing their funds into a crypto market that’s seen sizable gains pretty much across the board since late last year.\n\nAccording to an on-chain data dashboard from analytics firm Arkham Intelligence, the total amount of funds on Blast has fallen below $1.9 billion as of this writing.\n\nBlast will give users “airdrop points” in May, which will pertain to a future token launch around the scaling network. It’s competing with other Ethereum scalers like Arbitrum, Optimism, Base, and Polygon—but the incentives model flung Blur to the top of the NFT world, and founder Tieshun “Pacman” Roquerre and team must expect the same for Blast with scaling networks.\n\nAD\n\nAD\n\nThe launch of Blast hasn’t been without controversy. Crypto traders and builders alike criticized Blast’s approach of launching a bridge that users wouldn’t be able to withdraw funds from for months, and took issue with the framing of the incentives model.\n\nIn November, Dan Robinson—Head of Research and General Partner at Paradigm, the VC firm that co-led Blast’s $20 million seed round—wrote that the firm thought the “announcement this week crossed lines in both messaging and execution.”\n\nHe further criticized the decision to lock up funds for months, and said that “much of the marketing cheapens the work of a serious team.” Blast founder Pacman admitted that Paradigm asked them to “make changes” to the launch plan, but he said that it was ultimately Blast’s own decision to make.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPckExS3VvUElzd0xoRHVnOGN6bThYMFRHR3g3SExyWWY3a3ROYnk0UVJ6Q2NwcnpfYnJ2c3FPRDA4azhfaEhrbjEwTGktZmZuVmN0TzNUSEk2Y1RUX2U0eG91RzRpVmhWTV85Sk83REVEQmVyTFM4RW95eWdPb2tXWnAteTRDSzVjQkFxNVBzQTBDMmM0OFNncW5WeWZzWmE3LXdqdEZGSmxuMzFSRFdRZkE4cEN5NnBVLXMwdzRLc9IBxAFBVV95cUxQQXkyNkYybGRKdENqQnpIN0RrVE1LN3JNYzBvNWx3aS14bEJvMk0tS0RnYm8yZTAzempfLTB0SnA2bGVBVjAybWRQNWl2VmhXeF80NTZPanRGZ2pOTjU1cms1V3g1MFp6MDVYbEVTbmFEYXhsOENTRjdqNkI1cWVIT2x6bnpGdGZZNmlmTHFNa203dGMwMng3WG1nQmhzY05jQXM5TWYyRjVMMTZTWFV4ck1QaVFJclNxcVlyaVh3R2pYQzFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Coinbase Adds 2 Software Programs for Ethereum Staking, to Reduce Concentration Risks - CoinDesk",
        "content": "Coinbase tweeted at the time that \"Execution client diversity on Ethereum is a critical concern for all of us at Coinbase,\" adding that the company was \"performing our latest assessment of alternative execution clients and will have more to share on that process and our next steps by the end of February.\""
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQLXczUjJiMzFNSFREaks5aHYtZ3VlNFZycklpa0dqcURORExnbW0xSzRaLTV0a0dndWxsdVdTT1BtYm9MRFQ5b1lPX3dpVjVUbGFuTHJqSzFyZG1vZGoxWGY3S0FGNE5CVkRNTFRuRzFWVkxkdDhsYjMtd2tUMXVkWDZB0gGHAUFVX3lxTE12Y3VRWXNfbnBDcnNQWlBqT2hlWXBjelo3cFFhLUh4YkdsRjFPYnZ1dm1XMnF2RTJWSlR5bkp5M2N1aEtCWVVRV2I2empMVE5VSnQxZTlvM0dzczZ2SXpvMnM2MXc0SmFMZFVQQjNnQTJKUmQ5R3BheTk3OVZUSmstRzh4UENyVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Pushes Above $3k. What’s Next? - Blockhead",
        "content": "Ethereum (ETH) hit a key price mark over the past 24 hours, climbing solidly above the $3k level. This came after significant whale movement on Ethereum, as shown by on-chain metrics from Lookonchain.\n\nThis whale accumulation hinted at strong bullish sentiment on ETH with market participants responding with an 68% uptick in Ethereum’s daily trading volume. This resulted in a 4.4% increase in ETH’s marketcap.\n\nAt the time of writing, ETH’s prospects for further gains look good, especially with Bitcoin (BTC) hitting $56k.\n\nEthereum Still Leads the Way\n\nDespite the rise of several other altcoins, Ethereum has retained its place as the leading altcoin. This has established the blockchain’s dominance in the altcoin space with Ethereum providing the base for several other blockchains.\n\nEthereum launched in 2015 with a core feature for smart contracts which has become an essential tool behind decentralized applications (dApps). This has made Ethereum the preferred blockchain of choice for developers and enterprises creating technology with real-world use cases.\n\nETH serves as the native token of Ethereum and despite the challenges with gas fees, its price action continues to serve as a reminder of the surging demand for ETH.\n\nCan ETH Reach $3.6k before February is Over?\n\nEthereum’s daily price chart showed the second largest cryptocurrency has been on a bullish run since the start of February. It rose by over 43%, as the price moved from $2.2k to its current price of $3.2k.\n\nETH/USDT on Trading View (Daily Timeframe)\n\nThis swift increase in price over a 25 day period was powered by increased capital inflows to Ethereum. The Chaikin Money Flow (CMF) remained above the neutral zero mark throughout February, hitting a February high of +0.33. This signified that investors and traders alike were super bullish on Ethereum.\n\nConsequently, this translated to a strong bullish trend, as evidenced by the Relative Strength Index’s (RSI) reading of 81.\n\nParticipants in the futures market reacted to the break of the $3k price level with a rise in ETH's Open Interest and Funding Rate. The Open Interest rose by 8% in the past day while the Funding Rate rose significantly which showed more short positions were getting liquidated than long positions.\n\nETH/USDT Open Interest - Funding Rate | Source: Coinalyze\n\nWith a clearly established trend and the break of the $3k resistance, buyers can look to ride ETH’s bullish trend up to the $3.6k price zone. However, this is where buyers will need to be wary due to ETH’s previous price action.\n\nThe weekly timeframe showed that the last time ETH reached the $3.6k price zone in March 2022, it led to an aggressive sell-off over a three month period that saw ETH fall from $3.6k to $900.\n\nAs such, buyers should anticipate profit taking at the $3.6k level and the possibility that selling pressure could still exist at that price zone.\n\nDisclaimer: This article does not constitute trading, investment, financial, or other types of advice. It is solely the writer’s opinion. Please conduct your due diligence before making any trading or investment decisions."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQdmg0Tm5fbXk2cnJ2THlIdzRIUEpkdnFXWTdWY2VVcXlUTzVGYkZSTHNlMGVrbm5faUhRZTQ4UVpoQ2EyTkNFcnpjT19xcFAwbnBfTlVlajVZU1RnV0k0ejItem1ydVlCd1ROMmZtZzE0eFltYVNvTXV1YWZfeEFWQ3JKQ0ZCUEQzdnRrNnNEWlR2ajg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum and Dogecoin Are Trending Higher Today - The Motley Fool",
        "content": "Bitcoin's incredible rally to near-all-time highs is providing a rising tide lifting all boats.\n\nIt's been a wild and wacky few days in the cryptocurrency world. Megacap tokens are seeing continued volatility, with Bitcoin (BTC 0.23%), Ethereum (ETH -0.22%) and Dogecoin (DOGE 2.68%) still up materially from yesterday's close (4 p.m. ET). These three tokens rose 2.8%, 3.8%, and 12.9%, respectively, over this time frame, as of 1:45 p.m. ET.\n\nNow, these increases are markedly lower than the previous increases these tokens saw during yesterday's session. Bitcoin, largely viewed as the benchmark for the entire sector, surged to a multiyear high of more than $63,000 per token yesterday, before giving up a good chunk of these gains. Currently, Bitcoin continues to hover around the $60,500 level, still substantially higher than the $45,000 level the token started the year at and the sub-$20,000 level investors saw late last year.\n\nLet's dive into what's driving this positive price momentum among these three megacap tokens today.\n\nCapital inflows are the story to watch with these cryptos\n\nBitcoin's run toward its record price (nearly $69,000 per token in late 2021) has been remarkable. Initial interest around the world's largest cryptocurrency following the approval of spot Bitcoin ETFs by the Securities and Exchange Commission gave way to selling pressure, due to a range of factors, including FTX's liquidation of assets in a bid to make investors whole. However, a turn of events has materialized, with capital flows into spot Bitcoin ETFs surging more than $7 billion over the past two months, as institutional investors jump on digital assets in a manner reminiscent of the previous bull market rally.\n\nInvestors banking on a supply/demand dislocation in terms of Bitcoin have been proven right, with momentum driving additional interest in leveraged products such as perpetual contracts, which traders and speculators can use to bet on short-term spikes in a token's price. Notably, the funding rate for Bitcoin perpetual futures hit the highest level since the last bull market peak in 2021. This signals there's plenty of speculative capital being put to work, in addition to the billions of dollars of institutional capital flowing into Bitcoin alone.\n\nFor even more speculative assets such as Dogecoin, these sorts of trends are very bullish, and are a key reason why we're seeing even greater moves in meme tokens. Dogecoin's price action has largely depended on broader sentiment in this sector. And with Bitcoin remaining the benchmark asset others are valued against, a rising tide appears to be lifting all boats.\n\nAdditionally, speculation around when spot Ethereum ETFs could be introduced is building. If the wave of capital hitting Bitcoin flows into Ethereum as well, investors could be due for big upside. Accordingly, the market is doing what it does best, and discounting these potential catalysts ahead of time, with Ethereum getting to multiyear highs on this sector-wide momentum as well.\n\nWhere do we go from here?\n\nIf many investors were asked yesterday if Bitcoin were to hit an all-time high this year, the answer would likely have been a resounding yes. And given the fact that the world's largest crypto is now within 15% of its all-time high, there's certainly something to this thesis. I wouldn't be surprised if this period of consolidation we're seeing today gives way to another rally in the coming days or weeks that takes Bitcoin and its megacap counterparts near, or above, all-time highs.\n\nLong-term investors who have stuck with megacap tokens through the 2022 and 2023 bear market period have been rewarded. Now, the question is how much profit-taking will take place at current levels, and whether institutional capital flows and speculative activity can be enough to push these tokens over the top. Certainly, these are three tokens every investor needs to watch closely right now."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNNzN4M2EwRXotaUdxYlFkOEV0QWpXRG5jNGZVbFJCM3B5SVdIejVCTXhibGZENTlqUEdBdEZyTERTenNVVFVndk9ES0c1aUdPWUs1a0lwZU1fTEhQTi1QMFhiUW5iVm9ibVk4aHUzdGxjbjBwbExaYVNVSUxKWjVoQzRrMVdJZmPSAY8BQVVfeXFMT3dPS08ydVZ2cXZXdm5IQ2FFLTNyTVVIMldjcjFhUGRFcDVJZjRCVTU2cXI0T0xBaTdNRGppclVmcWh0R0pKelV5Sk5OTGlqM1pYa2tSbXo3X1RyeFBZMDFUYWVXWVd4aU1Ycl95U1dmWXRsSUpST2hSYW9JMXBraEo2RkFlblpWeXd1djgxN0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Top Dogs: Dogecoin, Shiba Inu and Bonk Outpace Bitcoin, Ethereum Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto markets are sizzling, but it's the dog-themed meme coins like BONK, Dogecoin, and Shiba Inu that are stealing the show, with massive gains in the last 24 hours.\n\nAs Bitcoin and other major cryptocurrencies experience a bullish surge, the meme coin phenomenon has grabbed some of the spotlight.\n\nIn an industry known for its volatility and unpredictability, memecoins have emerged as a unique and intriguing segment of the crypto landscape. And they can be the subject of some of the most intense volatility since their prices can be so dependent on market sentiment.\n\nInitially created as a joke or for fun, these digital assets have gained significant traction, becoming an integral part of the crypto culture alongside DeFi degens, NFT holders, Bitcoin maxis, and other subcultures.\n\nAD\n\nAD\n\nBonk (BONK): The hot thing on Solana\n\nLeading the meme coin pack is Bonk (BONK), the first dog-themed token on the Solana blockchain. In the past 24 hours, BONK has skyrocketed by 54%, climbing from $0.00001573 to its current price of $0.000024. The coin reached a daily high of $0.000025 just a few hours ago, and its meteoric rise shows no signs of slowing down.\n\nBONK's impressive performance extends beyond the short term, with a staggering 105% gain in the last seven days and a mind-boggling 3,240% increase over the past 12 months. This remarkable growth has propelled BONK to the top of the crypto charts in terms of price performance today, outperforming all of the top 100 digital assets by market capitalization.\n\nDogecoin (DOGE): The original meme coin isn’t done\n\nAD\n\nAD\n\nHot on the heels of Bonk is Dogecoin (DOGE), the OG meme coin that started it all. Over the last 24 hours, Dogecoin has surged by 33%, jumping from $0.098 to its current price of $0.13. The coin's weekly performance is equally impressive, with a 55% gain. It’s up 62.7% compared to where it was a year ago according to Coingecko.\n\nDogecoin's popularity has been fueled by high-profile endorsements from celebrities and influential figures such as Elon Musk, who has frequently expressed his support for the meme coin on social media. But it should be noted that Musk is currently facing allegations of insider trading, market manipulation, and fraud over the timing of messages he sent about DOGE on X and when a wallet supposedly belonging to him bought or sold the meme coin.\n\nShiba Inu (SHIB): The Late Bloomer\n\nRounding out the top three meme coin performers is Shiba Inu (SHIB). In the last 24 hours, SHIB has soared by 28%, rising from $0.00001094 to its current price of $0.000014. The coin reached a daily high of $0.0000146, demonstrating the incredible volatility that has become synonymous with meme coins.\n\nSHIB's recent performance has been particularly noteworthy, with a 45% gain in the last seven days. However, its 12-month performance has been relatively modest, with a 13% increase. This is largely due to the coin's underperformance in 2023, only beginning to gain traction in early 2024.\n\nThe current bullish trend in the cryptocurrency market, driven by institutional appetite for Bitcoin and Ethereum, has undoubtedly contributed to the rise of meme coins. As altcoins tend to be more volatile than Bitcoin, the gains and losses experienced by memecoins are often amplified. That’s why they’re cherished (and sometimes hated) by risk seekers like degens.\n\nIt's important to note that meme coins are among the most volatile tokens in the crypto ecosystem. That means a coin that surges one moment can crash in mere minutes, wiping out whatever unrealized gains a trader might have. Many meme coins enjoy short-lived success, mainly because they are created as rug pulls, or because, just like memes, people lose interest shortly after they go viral.\n\nEdited by Stacy Elliott.\n\nAD\n\nAD"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOUlE1SGFOUjFSN3BiNTdEUlNmVFh2WUlsaGkwR1NxeTFTTU5KSnVqNlY5d0hRMHRfU2JGbXduUWh1WnhuMjgzMFhxTEotZGFHbjhLSkh0bWc0Sldvb3VYbzNmOW9YeWxSNms4cU1zNlotU1hPeGlqSWxpZkJHMkFMR0ZvdTVNRzhWVmZvb1UxbUNEdnllRFRZcUY2WGZKQ05leUhWSjdpVnRmVDItMnJZSmpHRdIBuAFBVV95cUxQbE40bm1GaGFjZk5pRXItM2dENjQ1WGRWX3dhNWdYeHNyTGNhcWZSaWZiZnUtSkRCNlE0OW5wei1LUzRmc0N6aHhYZTExTTI5VTV3d2JvUTBOUkJ1ekJyNHI3eFF0T2pnX3J3TFJMZ2xxcGJIZ2p0d2JWSnMyb3F4ZmYwNklYQkI1cGpHaW1CX3FwWS1kWjNWbTJaZzIwWmVpaDFsUkxjTl9zbXEtbVRLY0g0QUlsR0Fx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Should We Wait for Bitcoin (BTC) at $60,000, Ethereum (ETH) Secures Way to $3,500, Dogecoin (DOGE) at Pivotal Level - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin has experienced a substantial rally, pushing past several resistance levels with a vigor that points to positive market sentiment. Currently, the price hovers around the $56,000 mark. A critical observation is the lack of volatility preceding this surge, which appears to have contributed to a short squeeze, catching bearish traders off guard and propelling the price upward as they rush to cover their positions.\n\nSupport levels for Bitcoin are now pegged at $53,000 and $49,645, which align with the recent consolidation range and the 50-day moving average, respectively. These levels are crucial for Bitcoin to maintain its bullish momentum. On the resistance side, the immediate hurdle lies at $58,000, followed by the psychological and substantial barrier of $60,000.\n\nBTC/USDT Chart by TradingView\n\nBitcoin's trend is bullish, with the asset trading well above its moving averages, a sign that could indicate sustained bullish pressure. The trading volume has seen a significant uptick during the rally, suggesting strong buyer interest and the possibility of continued upward movement.\n\nIn a bullish scenario, if Bitcoin can breach the $58,000 resistance, it may well be on its way to testing the $60,000 threshold. Such a move would likely require continued institutional interest, positive developments in the cryptocurrency space and the maintenance of a favorable macroeconomic environment.\n\nAdvertisement\n\nEthereum's lead\n\nEthereum has seen a robust upward trend, with the price currently floating around $3,225. The bullish momentum has pushed ETH well above its moving averages, and it seems that the next target will be the long-awaited $3,500 price mark. The 50-day moving average, currently near $2,650, followed by the 100-day moving average at $2,414, are key supports that have historically propelled prices higher upon retesting.\n\nAs for resistance, Ethereum is looking to challenge the $3,300 level, having recently broken past it. A sustained move above this level could open the door to $3,500, a psychological and technical barrier that may see some selling pressure. However, the strength of the current trend suggests that this resistance could be tested soon.\n\nEthereum's trend is decisively bullish, with a steep and consistent climb in price. However, the asset appears to be in overheated territory, as indicated by the Relative Strength Index, which is hovering near overbought conditions. There might also be a divergence forming, as the RSI is not confirming the new highs that the price is reaching, which could be an early sign of a potential pullback.\n\nIf the buying pressure maintains its course, Ethereum could comfortably reach and potentially surpass $3,500. This would likely be fueled by continued positive sentiment on the market, advancements in the Ethereum network and increasing adoption of its blockchain.\n\nDogecoin aims at breakthrough\n\nDogecoin is currently at a crucial point that could define its trajectory in the coming weeks. Currently trading at around $0.09152, DOGE has been experiencing an uptick in buying pressure, pushing it toward a key resistance level at $0.092. This level is significant not only because of the psychological round number effect but also because it has served as a strong resistance point in the past. A break above this level could signal strong bullish momentum, potentially leading to yet unseen performance highs for the token.\n\nSupport for DOGE is currently established at $0.08451, which aligns with the 50-day moving average. This moving average has historically provided support during uptrends, offering a bounce back point for prices following retracements. Further support is found at $0.08216, marked by recent lows that have been tested and held firm.\n\nThe trend for DOGE is currently bullish, with the price above both the 50-day and 100-day moving averages, indicating positive sentiment among traders. The moving averages are sloping upward, suggesting that the trend has strength and may continue."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE9WcWpTTzZsZ1J1cjA1bHdIb1hXNkVfQzJuMmJSRzVwcjMzNmdQZXFjX0VGdFI2QVJhOVRwSmJHeTVyWDJVdHZtRWRTWkF3eGVfeFhkZnhSRVlmdmcwZk5pbzRCWXZYZWlmd0RFY9IBckFVX3lxTE9ManZVLU1tODBTeXJoSVQ3YUZrZGtnOGdURzhqNkV2X3hXODhrSUZ0U0s3UFVYWFJEWkNXTmt1Z0Z0bmMyOWVHUkJBWGJWZ2tfc0VxZG9nUUhsLTA1T3pQUHhpSXI0UEluTDdla08xazJpZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETFs Will \"Bloom,\" Jim Cramer Predicts - U.Today",
        "content": "Advertisement\n\nRenowned market analyst and television host Jim Cramer expressed optimism about the future of Ethereum exchange-traded funds (ETFs), predicting a bright future akin to the success seen with Bitcoin ETFs.\n\nThis prediction comes after the ETH price surpassed the $3,400 mark.\n\nSpot Ethereum ETFs promoted by Coinbase\n\nCoinbase, a leading digital currency exchange, has taken significant steps by formally requesting the Securities and Exchange Commission (SEC) to approve the listing and trading of the Grayscale Ethereum Trust on NYSE Arca.\n\nThis request aligns with the broader industry push, involving major financial institutions like Fidelity and BlackRock, towards the establishment of Ethereum ETFs.\n\nAdvertisement\n\nThe potential approval of Ethereum ETFs has sparked considerable speculation about the digital currency's market value. Standard Chartered, a prominent financial institution, predicts a significant surge in Ethereum's price, potentially reaching $4,000, contingent upon the SEC's approval expected in May.\n\nThis forecast is based on the anticipated increase in accessibility and investment in Ethereum, should ETFs be approved, marking a pivotal moment for cryptocurrency investment.\n\nWill an Ethereum ETF be approved this year?\n\nThe sentiment around the approval of Ethereum ETFs is increasingly positive, with industry leaders like Grayscale's Sonneshein expressing confidence in the inevitability of such financial products being greenlit in 2024.\n\nETF expert James Seyffart also expects an ETF product to be approved this year.\n\nThis consensus among market analysts and financial leaders indicates a growing belief in the maturation and acceptance of cryptocurrency within mainstream investment vehicles."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPWUk5X3BvZTBqTE1TdTFBN0hsVWpMb3gxSEZPTmJxcDhaMjVVM1kwNThPV0xWam56V0hwZlVmdkhvaHBzbFJsMUJBSmpQMS1la3N3RXVWRjZkdXNjZzZoSGZxcEEwQjJwbkl1NlFRelpwM2xzd2JCUUFpTjVwbGZVUmpDTHR4MzJfZzdVMllCVmxRb09L?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Jim Cramer Makes Surprising prediction About Ethereum ETFs! - Cointribune EN",
        "content": "Thu 29 Feb 2024 ▪ 3 min read ▪ by Eddy S.\n\nFollowing the historic success of the first Bitcoin ETFs, approved by the SEC in January 2024, plans for Ethereum ETFs are also becoming more concrete. Key sector players are pushing to get the green light, while investors are eagerly waiting. Meanwhile, Jim Cramer, the famous American host, is making a rather surprising prediction about these crypto assets.\n\nThe Resounding Impact of Bitcoin ETFs\n\nThe successful launch of Bitcoin ETFs by giants like BlackRock has encountered massive enthusiasm. In just 38 days, these funds have accumulated the equivalent of 20 days’ worth of bitcoin mining output.\n\nWith now over 700,000 bitcoins in their reserves, these ETFs reinforce the belief that the available supply will become scarce. They have acted as a powerful bullish catalyst. What will happen with Ethereum ETFs if they are approved?\n\nEthereum ETFs, Jim Cramer’s Prediction\n\nJim Cramer is very optimistic about the imminent approval of Ethereum ETFs by the SEC. This optimism fits into a very positive dynamic for Ethereum at the beginning of 2024. The Grayscale manager and Coinbase exchange are pressing the SEC for a green light.\n\nMany believe the coming arrival of Ethereum ETFs is inevitable, much like Cramer. According to the famous crypto critic, it is clear that an Ethereum ETF will happen very soon.\n\nIn the same vein, Standard Chartered Bank even anticipates a surprising growth in the price of Ethereum by May 2024, if these ETFs are approved. Proof if any were needed that expectations are high.\n\nLikely Adoption by Mid-2024\n\nWhile the SEC has not yet officially decided, many experts believe that approval will take place in 2024. Recognized figures think it’s just a matter of months before Ethereum ETFs hit the market.\n\nThis prospect has even led numerous companies to refine their applications to get the go-ahead. Similar to VanEck and Valkyrie, which have filed amended registration forms in this regard.\n\nThe dynamic thus seems very favorable for the upcoming adoption of Ethereum ETFs, paving the way for a new era for this crypto. The impact on its price and development could be spectacular.\n\nThe anticipation for Ethereum ETFs among investors is indeed palpable, as was the case with Bitcoin prior to its approval. Jim Cramer’s prediction might well come true in light of various indications. However, the SEC holds the cards and could take a few more months before moving forward, or instead, maintain its current stance. Regardless, this product should invigorate the crypto ecosystem if it sees the light of day.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxObER2UmFQbHBaN3hzR3NseFdDVzZ5REdHTk9fVXZsTVpvTE1kOUtEb3dfbzRLSG1QZktJaU45d3Zvd1paN245aWFZMHhycDNmbU1NRkpiNzBDbjRYQzZkVXMtWnlvb2hOcnJSaW1Sckp1S3dpVWd5N2owZVFlU09yYkdhNXRzV011dmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "What Will Be My Portfolio If Ethereum (ETH) Price Hits 5K ? - CoinGape",
        "content": "As Ethereum (ETH) enjoys a period of significant growth, many investors are taking notice. Over the past year, its value has doubled, reaching a noteworthy milestone of over $3,000 on February 20, 2024. Now, experts are predicting that Ethereum could potentially reach $5,000 by the end of this year, 2024. With the market buzzing and investors eager to seize opportunities, you might be wondering: What will happen to your investment if you buy Ethereum now, and what kind of returns can you expect if it reaches $5,000? Let’s delve into this exciting scenario.,\n\nEthereum (ETH) Market Performance\n\nAs of February 28, 2024, Ethereum holds a value of $3,256.38, alongside a robust 24-hour trading volume of $21.6 billion, representing a slight decrease of $21.67 within the past 24 hours. Despite this minor setback, Ethereum has seen a 1% price increase over the same period. Retaining its position as the second-largest cryptocurrency, Ethereum boasts a live market capitalization of $390.93 billion, with a circulating supply of 120.15 million ETH according to CoinMarketCap. This demonstrates its significant presence in the digital asset landscape.\n\nadvertisement\n\nAlthough Ethereum reached its peak of $4,891.70 on November 16, 2021, it has since experienced a decline of 33.41% compared to its current price. However, recent trends offer promise, with Ethereum witnessing a notable increase of 9.25% over the last 7 days and an impressive surge of 100% over the past year.\n\nEthereum (ETH) Market Performance chart\n\nEthereum’s price surge is driven by various factors. The anticipation of a spot Ether ETF approval by the SEC, with a 45% likelihood by May 31, has fueled market optimism. The upcoming Dencun upgrade on March 13, introducing EIP-4844 for improved efficiency and scalability, is also a contributing factor. Open Interest in Ethereum futures has reached a record-breaking $11.32 billion, reflecting increased market activity and investor interest. Whale activity, particularly large ETH purchases, suggests confidence in Ethereum’s long-term potential.\n\nAdditionally, the surge in Ethereum restaking protocols, highlighted by EigenLayer’s $100 million funding and TVL increase, signals bullish momentum. Successful airdrops like Starknet (STRK) and Blast’s upcoming token launch further boost investor confidence in Ethereum’s ecosystem.\n\nWhat Will Be My Portfolio if Ethereum (ETH) Price Touches $5,000?\n\nImagine you’ve set aside $300, ready to dip your toes into the world of cryptocurrency. Ethereum gets your attention, priced at $3,256.38 per coin. Now, let’s fast forward to a scenario where Ethereum’s value climbs to $5000. What could this journey look like for your investment?\n\nStarting with your initial $300, you’d acquire approximately 0.092 ETH at Ethereum’s current price. If Ethereum reaches $5000, your investment would appreciate to $460. That’s a respectable profit of $160, translating to a solid Return on Investment (ROI) of around 53.33%.\n\nNow, what if you decide to scale up your investment? Doubling your initial stake to $1000, you’d secure roughly 0.307 ETH. If Ethereum hits $5000, your investment would grow to $1,535, resulting in a profit of $535 and an ROI of approximately 53.50%.\n\nAnd for those willing to commit $2000, you’d acquire about 0.614 ETH. Should Ethereum reach $5000, your investment would soar to $3,070, netting a profit of $1070, again with an ROI of 53.50%.\n\nWhether you’re starting small with $300 or venturing into larger sums, Ethereum presents an intriguing investment opportunity. So, as you weigh your options, remember: that Ethereum’s potential could offer a compelling path forward in the world of digital assets.\n\nEthereum Forecast : Will Ethereum (ETH) Hit $5,000?\n\nEthereum price is showing strong performance, currently hovering around $3,256. The steady price rise has surpassed its usual levels, with analysts suggesting a potential climb to $3,500 soon. Ethereum is now eyeing the $3,300 resistance level, recently breaking through it. If the price manages to surpass $3,500, it could face some selling pressure as this marks a significant psychological and technical barrier. The current bullish trend in Ethereum’s price is evident, with a consistent rise of around 1% in the past day.\n\nLooking ahead, some analysts predict that by the end of 2024, Ethereum could touch $5,000. BitMEX founder Arthur Hayes recently divested his Solana holdings in favor of Ethereum, foreseeing a surge that could propel the cryptocurrency to $5,000.\n\nThis optimism is further fueled by upcoming events such as the Dencun upgrade and the potential approval of an Ethereum spot ETF by the SEC, both of which are expected to bolster ETH’s value. Additionally, the Bitcoin Halving scheduled for April 2024 could also contribute to Ethereum’s growth trajectory. If Ethereum maintains its current momentum, it has the potential to surpass its previous all-time high."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxObjQzdHQxcmw4UXNNVzNBUXdhSkc2UG43VkNsNGlGczc4UWdlb1YyVnoyeHRLUTJ3WnRQRFNQdy1WNXNqQTJfdGRDVFZEbEoyV2F5YlRscHVzX1Y4Y2s5RUt5b294Sm0xOHFac0xCX1pMSzlxMnN6a205NlZRbTZ6cHBXV0lKdVV6OFB4SGJteW9NNVVIdllTZTFZMl8xMUowdlJ6TUZqeEhMbDkwaS1GVmhua9IBuAFBVV95cUxPV1ZxdTVERG40N00yOTFNWkJvak5oTHJTc0UyOW8yY05aZEFGVE9SbTJxZ1M2Tk5tQWg3WjlmX0ZZUjdmSF95b1FFcFFfV0hQcjZhWncxNktZMXdGc2lUX0NhV1lQUUNvMUJSQWF5OURMVkM2WVpjWnVCdVNGUDdKSGtwYTJFVWdQMVI0bjF2SngzcDVfQkxzSXZoWG5CemJuc2ZLY3pWOFVZa2l6S3ZRcHJ6NGFlbXY0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "XRP Breakthrough: What's Next? Cardano (ADA) to Break $0.65 Level, Solana (SOL) Loses to Ethereum Massively - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP is eyeing the next significant hurdle at $0.6. The recent trading sessions have witnessed a commendable performance by XRP, which has successfully breached several local resistances, positioning itself for a potential upward trajectory.\n\nAnalyzing the price dynamics, we observe a robust volume spike, which is indicative of strong buyer interest and may signal the start of a sustained bullish trend. This is a vital factor as volume often validates price movement, giving credence to the breakthrough and setting the stage for the next leg up.\n\nXRP's current trend shows it maneuvering above the crucial moving averages, a bullish indicator that suggests the asset has ample support for its ascent. The intersection of these moving averages has served as a springboard for the price, pushing it toward the $0.6 mark.\n\nLooking at the resistance and support framework, the immediate resistance is indeed at the $0.6 threshold. A decisive close above this level could pave the way for an extended rally toward higher resistance zones.\n\nAdvertisement\n\nConversely, if XRP faces rejection at this level, it might retreat to test the fortitude of its newfound support levels, potentially around the $0.55 to $0.53 range, where the confluence of moving averages may offer a buffer against a deeper pullback.\n\nCardano on verge of bull market\n\nCardano's native token, ADA, is showing signs of a strong bullish trend as it approaches a significant resistance level at $0.68. This move is particularly noteworthy as it positions ADA to potentially surpass the highest price point it has achieved in 2024. The trading community is attentively monitoring ADA's performance for a decisive break that could establish new benchmarks for the year.\n\nA detailed price analysis reveals that ADA has been consistently forming higher lows, which is indicative of accumulating strength and buying pressure. The recent uptrend has been supported by increasing volume, suggesting that the bullish sentiment is backed by active market participation. The $0.68 level is critical; a convincing move above this price could trigger further buying as it would confirm a breakout from the recent consolidation pattern.\n\nFrom a technical standpoint, ADA has sustained itself above both the 50-day and 200-day moving averages, which traditionally act as dynamic support levels. The convergence of these averages provides a strong base for the token, making the path toward the $0.68 resistance more attainable. A successful break above this threshold could open the door to testing previous yearly highs and, potentially, the all-time high (ATH).\n\nLooking at the current trend, the next major resistance after $0.68 is anticipated to be in the region of $0.75 to $0.80, where ADA may encounter a tougher barrier due to historical price actions. On the support side, the key levels to watch are $0.61 and $0.55, which have previously acted as both support and resistance.\n\nSolana's failed battle\n\nSolana has been a strong contender with its high-speed and low-cost transactions. However, recent market developments have seen Ethereum reclaiming its dominance, overshadowing the advancements of its competitors.\n\nA comparative price analysis shows that while Ethereum has been gaining in both market cap and price, Solana has been lagging behind. The SOL token is struggling to keep up, as evidenced by its performance on the price charts. After a period of consolidation, Solana is now grappling with resistance levels that were once strong supports, particularly around the $108 mark.\n\nAs of the latest trends, SOL is trading in a channel, with its immediate resistance near $120. The key support to watch is at $100, a psychological level that may dictate Solana's short-term price direction. Should this level fail, the next support is at the $89 zone, marked by previous price interactions."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQd29pS0lGR1oxdEZnZmVqNzE2N1BhbUJhb2o2MHJ5V05OUEJ2UFRXaTg3WG9zU2lianJiY2plMndZRzBhbWFRMG41ZUtiYUJDcVVtbWlUTHU0WFdZVTk4TDBuMzNsajlpM3pmRlRHUE1EZWQybUhfVWd3d0JUd3RWbGlqUndqTkVSU1RKQlhn0gGWAUFVX3lxTE00UHRIdTJPOTk0TmhGWDVoWUtiNGpZSkV5TGdMVlFiZmlBeldncFU5UWRJbENSdHlDdUU1R3RVOURuWUlYSW8yX1RvTlhyTzE0V3J3MjVndXY5NlNaN2F1SG5zdklfaFhoTjRzNDN5WTRsMS12bTNkUHB6cUZCVmZJSEEyQm8wZ21QeDUtWkVoYnJMOS0yZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Portal Airdrop Begins as Ethereum Gaming Token Hits $425 Million Market Cap - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGaming token and cross-chain platform Portal made its long-awaited debut early Thursday, rewarding airdrop farmers and Binance token stakers ahead of launching staking rewards and rolling out other features.\n\nPORTAL, minted on Ethereum, is currently priced at $2.54 per token according to data from CoinGecko, with just over 167 million tokens currently on the market—nearly 17% of the total supply of 1 billion tokens. That puts the market cap at about $425 million as of this writing.\n\nNewly launched tokens are famously volatile, and PORTAL is down significantly from the initial price of $3.36 upon listing with crypto exchange Binance. That 24% dip in less than 10 hours is sizable but also typical for new, heavily traded crypto tokens. Nearly $500 million worth of PORTAL has already been traded.\n\nNot only is the Portal token now available to trade, but crypto users who participated in the project’s airdrop farming campaign on Twitter late last year can also claim their share of the initial airdrop. While some users on social media have griped about claiming issues and regional restrictions, others have shared that they received thousands of dollars’ worth of the gaming token.\n\nAD\n\nAD\n\nOther users sharing in the launch day buzz include Binance customers who staked tokens in reward pools to earn a share of 50 million PORTAL tokens allotted for the crypto exchange’s Launchpool campaign. More than $9 billion worth of crypto was staked at Wednesday’s peak, setting a new record for Binance’s launch platform.\n\nWhat is Portal? It’s billed as a cross-chain platform that serves as a central hub for crypto and NFT games across multiple networks, giving gamers one place to access games, transact funds, interact with their owned assets, and more. It’s set to support games on Solana and Ethereum scaling network Polygon, among others.\n\nThe team behind Portal includes employees from the crypto startup SuperDuper—which is behind the Creepz NFT project on Ethereum—as well as video game industry veterans from Rockstar Games and Electronic Arts. Prominent Hollywood agency WME is representing the project.\n\n$PORTAL staking coming soon! Stake for access to the Portal Launchpad. Gain VIP access to top-tier token presales, NFT mints, & drops from your favorite brands. 🚀 Stake more, get more access\n\n💥 Higher scores = elite reward tiers\n\n🏅 Snatch unparalleled Web3 rewards pic.twitter.com/pcmjmKolIq — Portal (@Portalcoin) February 29, 2024\n\nAD\n\nAD\n\nThe token is live after a months-long run-up: Now what?\n\nPortal has tweeted about special token staking benefits launching in the coming days, letting players stake (or lock up) their tokens within the platform to gain various perks, such as “VIP access” to token and NFT sales, as well as early access to upcoming blockchain video games.\n\nPortal will also hold more seasons of its engagement-driven “Crystal Dash” airdrop campaign to generate more user rewards. It will also launch nodes that users can presumably purchase to help support the network in exchange for incentives, akin to what the Xai gaming network on Ethereum scaler Arbitrum has done.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNWxhRndpck9IMERnVDZ1di1XX1p4Umtvbk5ZU1Q0U19MazZiLXBiQnR3VkQ0WG9LblNJd0xlaTBTdGJnakdaOVNGd0htaEc2THhoUTJUOTBscldWMDRiZ1RqVTBmbk5USG9PQTZDUVRQSTctTmpmME1mQkNXWWZWazljNi1IRW1leGpwTk1oa2h2UdIBlwFBVV95cUxPUHNkdjEtZEotd3Nsb2dwQnpFY2syVHdkLVJndmVWbVBuWEJMMk9MWFV5cU5zcEJkOHBWcjV4dldpXzJ3LWVraWhxR2o2MGpRTUt5RGVfaEZSMW5LaXNtN2gzaV82b1V4OEJKclRRQ0p6cGpvMk0yRkFyVVlHTkRsNGtSUGZLZWtlQVQ5eTJiWWFKdEdkenRN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Profitable Ethereum transactions on the rise – Time to invest in ETH? - AMBCrypto News",
        "content": "For every loss-making transfer on the network, about 2.3 transfers were found to be profitable.\n\nAll ETH holders were realizing gains over 20% on their investments on average.\n\nEthereum [ETH] broke through $3,300 as bullish momentum into the world’s second-largest cryptocurrency continued to propel it upwards. At press time, ETH was up 2.61% in the 24-hour period, and more than 12% over the week, according to CoinMarketCap.\n\nProfitability highest since November\n\nWith the price boom, most of the traders were making profits on their transactions. According to blockchain analytics firm Santiment, Ethereum’s on-chain profit/loss ratio in the last week was at a three-month high.\n\nFor every loss-making transfer on the network, about 2.3 transfers were found to be profitable.\n\nThe percentage of total supply in profit exceeded 93% as of this writing. On a rising curve, this level was last seen during August 2021, three months before ETH hit all-time highs (ATH).\n\nMoreover, on an average, all ETH holders were realizing gains over 20% on their investments, as evidenced by the 30-day MVRV Ratio. Typically, the more the ratio increases, the more likely traders have historically demonstrated their willingness to sell.\n\nHowever, AMBCrypto’s investigation of MVRV Long/Short Difference indicator showed that long-term holders were realizing higher profits than short-term holders.\n\nHence, it was highly likely that these diamond hands would wait for prices to ride to ATH and beyond before distribution.\n\nBe mindful of pullbacks\n\nETH’s bullish impetus should not make you lose sight of potential corrections on the way.\n\nThe total amount of ETH on exchanges has increased steadily since the start of 2024, while the supply outside has plateaued. This is generally interpreted as rise in short-term sell pressure. Such corrections might be a good time to buy the dip.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAll ready for Dencun\n\nThat being said, with strong bullish catalysts to follow, ETH supporters were confident of an extended bull market.\n\nOne among these was the hugely-anticipated Dencun Upgrade, intended to reduced transaction fees on layer-2 (L2) chains. According to a recent blog post by Ethereum Foundation, the upgrade was activated on all testnets, and was set for mainnet launch on 13th March ."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBOOHd4SHRITkVDTTFiajlvUEJMZ0xYbGNEdGxvVFJOeEs2SjE1LXF2UmpqYThuYUZZZEpkWUZMaFVCSUJ0OEwxRzZYZjFMaUk5WG05a3RCV0tJMjc1SkVBNFNmWVpoWlRIREI4REJmdVJETmJhLWVDcNIBgAFBVV95cUxPbjl6SF9WUGxlX1l4QkxEX1J5Um1leVJCbHYtaTVlVFBaNXM3dl9hTjZSdHlpdDVfcHo3WDl1QU51b0ZrOG9NV0V2VURCYkJrWm45Tnp3R3V3RGJxUUhiOUdOZ2ROX3E3NDI0M05odV9xUEdTQzFtdmtscmp5SmxEZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Trump's Ethereum Meme Coin Holdings Hit $4 Million—Will He Dump TRUMP? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFormer president Donald Trump’s crypto wallet is bulging—and he now owns nearly $4 million worth of MAGA meme coins.\n\nThe Ethereum wallet tied to the presidential hopeful by blockchain analytics firm Arkham Intelligence now holds almost $6.4 million in crypto. Most of that—about 58%, or $3.85 million worth as of this writing—is held in MAGA (TRUMP) tokens, which run on Ethereum’s blockchain.\n\nTrump also holds over $1.2 million in Wrapped Ethereum (WETH) tokens and more than $1.1 million in Ethereum (ETH). The former United States President receives royalties from sales of the official Trump NFT collections, launched in 2022 and 2023. He cashed out millions of dollars’ worth of ETH late last year following the latest NFT collection launch.\n\nThe TRUMP meme token is currently priced at $6.53, up 139% this week, CoinGecko shows. In the past month, the price has soared by 341%. TRUMP hit an all-time high price of $7.78 early Wednesday, pushing the value of Trump's own holdings above $4.5 million at the time.\n\nAD\n\nAD\n\nTRUMP is a meme coin: a cryptocurrency based on an internet meme, a joke, or a celebrity. Such tokens often run on other blockchains—such as Ethereum—and are extremely volatile.\n\nTrump almost certainly has no official connection to the TRUMP token project; they’re often created by anonymous crypto users looking to make bank on hype and momentum. In this case, Trump’s wallet was sent massive chunks of the tokens last fall.\n\nThe biggest meme coin is Dogecoin (DOGE), which has its own blockchain and is the 10th largest digital asset with a market cap of $16.2 billion.\n\nSince DOGE’s launch, thousands of meme coins have sprung into existence only to disappear just as quickly (at least in most cases), making some investors massive gains—and losses.\n\nAD\n\nAD\n\nTrump has never publicly acknowledged holding the meme coin. But with the Republican frontrunner facing increasingly high legal bills ahead of this year’s election, will he feel the pressure to sell more crypto?\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1aVHNycHVyeFNzM3VXZWVJSVZaRV95dGFBb29jMnhwZks4Z3pHYXVEd3dqR0VYaXdaZ1NDT1ZfV1pFVXZFU2EyMmRydTZCSXlEWTV6LTI5alJaOXVPcEhlcWtqUmtTZUhmSDFqWjQ0Umhmd3JBMlHSAX5BVV95cUxOTnFzME1NVk9BQ1l4U2t2NWRFVk1nalVjbVhPQ2czVTg5eEJnU2RrblVBZVJhbUNWUGVueUppNkZobVhWX1dwNUhtU3Z4TnQ0OWdaWmhQSC16QlpCNnBNTTRKTEJ6TURkQjBWSlotOHZTazgyZWpFNkN6NHlBVkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "‘Parallel’ Ethereum NFT Card Game Set to Open to the Public - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nParallel, an NFT trading card game with assets minted across Ethereum and scaling network Base, will make its long-awaited move into open beta on Thursday, February 29, letting anyone jump in and start playing the competitive PC game.\n\nPreviously available only in a closed beta, Parallel—GG’s pick for the best game of 2023—builds on the foundations of genre giants like Hearthstone and Magic: The Gathering, but with some fresh wrinkles and a distinctive space opera setting.\n\nParallel’s developers announced the impending launch via a blog post on Wednesday, noting that a game update had been released with various gameplay tweaks and content additions ahead of the gates being opened to the public.\n\n“It’s finally here. The open beta release of our baby out into the world,” the post reads.\n\nAD\n\nAD\n\nAccording to the team, the update lacks any substantial balance changes because they’ve been focused on optimizing the PC game client. But beyond that, they say that “the game is pretty healthy,” and that they believe it feels reasonably balanced at present.\n\n“We think there’s still a lot of room to explore in the current meta, and we’ll all be surprised what happens as more heads get into the game and build decks,” the post adds. “Good luck, and welcome to the beginning of the story.”\n\nParallel Game Servers are back online and Patch 0.27 is live! Learn more about the latest updates and Open Beta Season 1 beginning March 1st!https://t.co/11Gk0YhMwl pic.twitter.com/l9dLFjgCs2 — Parallel (@ParallelTCG) February 28, 2024\n\nFollowing Thursday’s open beta rollout, Parallel will launch a new season of in-game content on Friday, March 1, including a premium battle pass that players can optionally purchase to unlock a new in-game card and other perks.\n\nAD\n\nAD\n\nFor more on Parallel, read our hands-on preview of the game from last August, as well as our Game of the Year story with details on what’s ahead for the NFT experience.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBaRFhrbFFQVjZGVWMxaGdRNGNuZjNBdEJORHN4eGZsYXlRWm0ybmlVc3Y2RjFETXB2bnFOeERWdWlqdHRhLXBTVFBuTUxvT3U5dEQ5VWhLZHJnRWVkQkMyMzU1TDAtRXpXbC0yd3Nn0gFzQVVfeXFMTS1rNUxnbUo1eFV4RGc0OTRaT3p0bnFCbEFuZVdCNGI5NFRKckNUcFpSbzBZLU5qVk1CNDZZcEI2dnJ1VlFQclhfTEVqV01xWHNuUmZZaTE5SExMbnlJLWdzRnZibEhKem5jc01uVGNFQnhBNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for February 29 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe situation remains bullish on the market, according to CoinMarketCap.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe price of Ethereum (ETH) keeps rising, going up by 3.80%.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH has formed a local resistance level of $3,501. At the moment, one should pay attention to the daily closure. If it happens far from that mark, there is a chance to see a local correction to the $3,400 zone.\n\nImage by TradingView\n\nOn the bigger time frame, the price of the leading altcoin has made a false breakout of yesterday's peak at $3,487.\n\nHowever, if the bar closes above it, the rise is likely to continue to the $3,600-$3,700 area soon.\n\nImage by TradingView\n\nFrom the midterm point of view, traders should pay attention to the nearest resistance level of $3,582. If the weekly candle closes with no long wick, the upward move may lead to the test of the vital zone of $4,000 next month.\n\nEthereum is trading at $3,479 at press time."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOclc2Q2FBakRnZmtfQjhpZFdwTHZoemctR2NabFc1azktcHF1UGdNNEdfbng1akNkVEZDaHNYb0VhelN3ZzFhYjd3X2hJUGROSVNpVTdjQnp4UElGMzFGbXltcjNKVVJqdzROVy1BVi1od2U4dm12Mi1VdWVqZlpKM9IBiAFBVV95cUxOcVVOSzRvRXRabTM5MUFHM0ZFRWN3X19MNE14TDRwdVNOM0I1VkR2Uk1iM29sM1lITm5XV3RFdFB1NWswblZCZWVaNW9nNGxRTC13VWlCeVNIRzRzWVc3WjNzVDc4REltRlBvSXBrM0dwTFdtVTZjZTRLTHIwa0dxVWNBTl80dmpl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum NFT Card Game 'Gods Unchained' Hits iOS and Android - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLong-running NFT trading card game Gods Unchained has finally gone mobile. Immutable Games announced Wednesday it has launched the fantasy-based tactical game on iOS and Android devices worldwide.\n\nAn early access version of Gods Unchained Mobile is now available on the App Store and Google Play Store. It provides a card combat experience on smartphones and tablets, turning the PC and Mac game into one that you can play pretty much anywhere.\n\n“Your mobile is probably one of your most important devices, which is why it was important for us to give players the freedom to choose where they want to play, whenever they want,” said Executive Producer Daniel Paez in a statement. “For anyone who has ever wanted to play a quick game on the go, Gods Unchained Mobile now makes it possible.\"\n\nThe mobile app includes Immutable Passport wallet integration, ranked and casual play, and a deck-building tool. Plans for a mobile version of Gods Unchained were publicly announced last year, following a closed testing period on Android.\n\nAD\n\nAD\n\nGods Unchained originally launched in 2018 on Ethereum, and later was migrated to Immutable’s own Immutable X scaling network, which enables cheaper and faster transactions. The game has generated nearly $350 million worth of NFT sales to date, according to data from CryptoSlam.\n\nAmid a recent wave of expansion, Gods Unchained hit the Epic Games Store, a popular PC gaming marketplace—but then was promptly removed. That’s because the ESRB ratings board gave the game an “Adults Only” rating due to its play-to-earn crypto elements, and Epic Games blocked such games from its storefront.\n\nHowever, following an investigation from Decrypt’s GG in December, Gods Unchained returned to the store after Epic Games modified its policies to allow such “AO” games—but only in instances where it received the rating due to the ESRB’s policies towards crypto games.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward.\n\nAD\n\nAD"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOaG9nenRrbnI2eW5CV3lHVDN0TmYwT0owRE1PclZFdW5SbXNsUGY2ZDJHazZ0ajB5R0c5eUVuN2JmemhuanZtUEVyRTM5TGxVdDdKVHd3VHhvYmdoWU8wWThBU1dpbXA5Z0xiNHpqcmsxZXY1eERNbXRKNU1fZ2tfeGlZUXdOOHZJUUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Pushd presale takes in more Bitcoin Cash and Ethereum holders - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nCommunity support plays a pivotal role in the success of cryptocurrency projects. A strong, active community can drive adoption, provide valuable feedback to developers and contribute to the project’s resilience in volatile markets. For investors, the strength of a project’s community can be a key indicator of its potential for success and longevity.\n\nThe Pushd (PUSHD) platform is attracting a growing number of Bitcoin Cash (BCH) and Ethereum (ETH) investors. This influx underscores the confidence in Pushd’s e-commerce model and its ability to capitalize on the DeFi boom.\n\nBitcoin Cash holders shifting to Pushd\n\nInvestors in Bitcoin Cash, a cryptocurrency focused on becoming a peer-to-peer electronic cash system are increasingly attracted to the Pushd presale.\n\nYou might also like: USDT and ADA holders considering Pushd in ongoing presale\n\nRecognizing the potential for Pushd to offer significant advancements in decentralized e-commerce, Bitcoin Cash holders are moving towards the platform.\n\nNotably, they are seeking to leverage their investments in a project with the promise of reshaping online commerce.\n\nEthereum community expands investment\n\nThe Ethereum community, buoyed by the network’s stability and its position as a leader in supporting decentralized applications, sees Pushd as a complementary investment.\n\nThey are always on the lookout for cutting-edge blockchain projects. Now, these ETH holders are drawn to Pushd for its potential to utilize smart contracts and decentralized finance principles in creating a new e-commerce ecosystem.\n\nPushd set for gains\n\nPushd is creating economic opportunities by offering an innovative platform where anyone can buy and sell without the constraints of traditional e-commerce systems.\n\nThis openness creates economic activity and innovation, providing individuals and businesses with the tools they need to succeed in the digital age.\n\nIts model represents a new wave of economic empowerment, facilitated by technology and driven by community.\n\nThe influx of investments from Bitcoin Cash and Ethereum holders into Pushd underscores the platform’s broad appeal and market readiness.\n\nBy combining the principles of blockchain with the needs of the modern e-commerce sector, Pushd is on the cusp of significant growth, offering a unique opportunity for investors seeking to capitalize on the next wave of blockchain innovation.\n\nPushd is in its stage 5 of the presale where PUSHD is trading for $0.11.\n\nRead more: Pushd preferred by Dogecoin and XRP investors"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNYzRPY0JDdTVwc255aDEyclg0ODl2WVRyb2ZIT2QtYklXa1dxTG41cHJlcEEya0VnekFLNS0tRXVjWGdLUkVlVnlnVmR1T3ZKNE5IQm5QME5QcDJjX3QwMUowSEdpc1E2MWJmaTFpUXloczFWTmFwRnE2WW1Od2VoWF9RU1hvVzZ0NU1KOHU5MXpCYTJheU9fSWRjVdIBoAFBVV95cUxOalFiTGZ6bTlNSG9kQlZaMXU3R3cxWGJCRjA4WXkwLWlENTJ0bXE0TTFmcERmM056Y0lLTWtUMHpTUENQeEc3QXlQcjEtaEdRbXpwSDJ2QzRLc204dmxKaDhpU0pDNElyVGVObm5vUEFzQVpGWmljc0FlRGRLcV9sOVNjUGRxOVVVWVJFdFRjbmpGcWRGX3dtZ1VwTDc2QzAy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast: Will ETH Keep Pumping To $4,000 Or Pullback? - CoinGape",
        "content": "Ethereum price forecast: Ether has in the last 20 days surged by almost 40% from $2,416 to $3,344, outperforming Bitcoin’s 35% increase over the same period to $59,354 on Wednesday, February 28.\n\nAlthough market participants anticipated a rally ahead of the Bitcoin halving due in April, it seems to have come early. Unlike other bull markets, cryptos are trading in the era of ETFs.\n\nadvertisement\n\nOther than the retracement in January caused by a sell-the-news action, the outlook of the market has been bullish, especially for Ethereum. Following the approval of Bitcoin ETFs, optimism for ETH ETFs has been growing.\n\nEthereum Price Forecast: Why Is ETH Rally Unstoppable?\n\nEthereum price action this week can be attributed to various factors including the Dencun upgrade — expected to launch on March 13 on the mainnnet, the spot ETF, and a strong bullish case exhibited by Bitcoin.\n\nThe Dencun upgrade will be a game changer for the Ethereum ecosystem starting with a larger block size from 12.5 MB to 25 MB, cheaper transactions for layer protocols, and a better developer experience.\n\nFor this reason and more, the upgrade could be a market mover which may explain the increasing risk appetite among investors. Following last Monday’s swing above $3,000, confidence saw many people buy ETH, in turn, building the momentum likely to push Ethereum price to $3,600 this week.\n\nETH’s technical structure remains steady based on the position of the Relative Strength Index (RSI) at 78. Its persistent climb implies that buyers are in control and the uptrend is far from over.\n\nThe Money Flow Index (MFI), an indicator that tracks the volume of money flowing in and out of Ethereum is in sync with the rising price. Unless people decide to sell for profit, Ethereum is poised to keep pumping ahead of the Dencun upgrade.\n\nRecommended: Ethereum Price: Here’s Why ETH Is Bullish This Week\n\nAccording to IntoThe Block’s blockchain analytics, ETH faces little resistance up to $3,800 from its current level. The second-ranked crypto asset has strong support, with the largest accumulation zone ranging from $2,803 to $2,903. Around 1.6 million holders bought about 4 million ETH at an average cost of $2,860.\n\nSo far more than 85% of the total Ethereum supply, approximately $27 billion is in profit or in the money. The amount of supply in loss stands at 14.4% worth around $4.8 billion. 3,400 ETH worth roughly $11.3 million, making up 0.03% of the supply, is locked in staking contracts.\n\nFrom the above data, it can be established that the majority of ETH holders are in profit. Their adamance to sell speaks volumes about the long-term bullish outlook.\n\nEthereum’s decentralized finance (DeFi) sector has also been growing in tandem with the price surge that Defi Llama shows a total value locked of $52.4 billion. As this value increases, selling pressure will reduce, allowing Ethereum price to keep rallying.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSTVqUWF1czVWR3h3ZnZaSU8wcDBEWEtrM00zMFRVUFl2UElxMU9DdXlNWEtTMjZyRTdOcUNOaDE5R2tsX2EzMEl1UmY3SnBTbHdvMDBBNEwyaC02LUp4LTRudWpkdGNyNFZuOGdEU1M0ZWM2TXVpVHhJWWw4R3R3ZldkUmI0VWVzSzRsV2FwLU5LLVBsWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: Your ETH Investment in Nov 2022 Would Be Worth This Much - Watcher Guru",
        "content": "The Ethereum network underwent a dramatic transition from the proof-of-work mining model to the proof-of-stake model on September 15, 2022. With an astounding 99.95% decrease in energy use, this much-anticipated change has ushered in a new era of sustainability and environmental friendliness in the blockchain sector.\n\nHowever, the second-largest cryptocurrency plummeted in 2022 following the FTX collapse, reaching a low of around $1,142 on Nov. 22, 2022. Nonetheless, ETH’s price has made significant gains in 2024.\n\nIf you had invested $1000 in Ethereum every month since November 2022, you would have purchased $16,000 worth of ETH till now. However, the portfolio’s value would have surged to $31,024.33, a spike of 93.90%. In other words, your initial investment would have almost doubled in 15 months.\n\nAlso read: Dogecoin Surges 31%: Can DOGE Reach $1 in 2024?\n\nCan Ethereum hit $4,000?\n\nIf Ethereum’s price is able to surge and sustain support around the $3,800 area in the coming weeks, some analysts estimate the next likely upside target could be around $6,835 based on the 1.618 Fibonacci extension level. This would represent the next key price milestone if the current bullish momentum is maintained. However, prices could also consolidate or correct before any potential further upside.\n\nOf course, if existing market conditions deteriorate again, Ethereum may see a downside. However, indicators presently favor the ongoing bullish structure persisting through February.\n\nAlso read: Cryptocurrency: 3 Coins To Watch As Bitcoin Eyes $60,000\n\nEthereum is up by 15% in the last seven days and 51% in the last 30 days. In the last 24 hours, ETH has spiked by almost 5%.\n\nSo, with ETH firmly back in recovery mode, early technical clues support the growing narrative of history repeating itself this cycle. With a major upgrade coming and the anticipation of the ETH ETF, Ethereum is poised for further growth."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOQ0RKeXF1MFQ1SHp0MUNGVW9nTXFRMmZIUGRheXotLV9RNWVQV193WU1ZbV9xOWVuZTNOTHJPdGVzdHJZUG4tTnNZMy05VTNDaTJyQnc4cktDcnlOM082TUpCRFNLRURNRVY5R3EtUjB1WGFPb2p2LWJ3UEFhWG1ENFpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Pushd presale attracts Ethereum and Chainlink investors - crypto.news",
        "content": "Disclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nEarly-stage investments in the cryptocurrency market, such as participating in presales or backing new projects, can offer substantial rewards. These investments allow individuals to support innovations in the blockchain space potentially. However, they also come with a high level of risk, including the possibility of total loss, highlighting the need for careful project evaluation and risk management.\n\nAs Ethereum (ETH) break above the $3K mark and investors move away from Chainlink (LINK), the decentralized platform Pushd (PUSHD) is attracting interest and investment. This shift indicates a growing preference for innovative DeFi projects like Pushd which promises to transform the e-commerce landscape, capitalizing on the current market dynamics.\n\nEthereum breaks above $3K\n\nEthereum is trading above the $3k mark.\n\nYou might also like: Magic Eden introduces creator focused Ethereum platform amidst soaring Bitcoin NFT transactions\n\nIt points to its appeal and foundational role in the crypto ecosystem, particularly in the DeFi and dapp spaces.\n\nInvestors are reassured by Ethereum’s performance, seeing it as a beacon of growth and innovation within the market.\n\nChainlink investors look for new opportunities\n\nChainlink is facing a high outflow of investors due to various market pressures and sees its community exploring new horizons.\n\nThe decentralized oracle network, while critical for the functionality of many blockchain projects, has prompted its holders to seek additional ventures.\n\nPushd capitalizes on market shifts\n\nPushd leverages its web3 foundation to create a diverse and dynamic marketplace, where a wide range of products and services can be listed and discovered.\n\nIt supports a vibrant ecosystem of offerings. This diversity not only enriches the shopping experience for buyers but also provides sellers with a broad audience for their products.\n\nYou might also like: Pushd preferred by Dogecoin and XRP investors\n\nAmidst the shifting dynamics of the crypto market, Pushd is being considered by Ethereum and Chainlink communities.\n\nIts decentralized e-commerce platform offers a novel use case, promising to leverage blockchain technology to enhance online shopping experiences.\n\nPUSHD is available for $0.11 in stage five of its presale.\n\nRead more: USDT and ADA holders considering Pushd in ongoing presale"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTE10R3JKa3RDa19wcTJXdFVBVlJhcHNKeGdWSjhqRUdsQ0dvSWV0VzZXWFBaZVQxamJldGFmQnZ1UUpXLWVEZjNSSGJ0MjM2QlNSY3ZR0gFYQVVfeXFMTWxWNzEtU0JRQVdUZkl3VmEzbjlKQ0xOSWJiUEY1eEdsZVMxU3FOeGVfVkl2Ry1WTEt0NGtPVnpqaGwtN3RLNzkxNU1iS3FSUjFKc3pYUUxoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum NFT Card Game Parallel Evolves in Open Beta - NFT Plazas",
        "content": "Ethereum NFT Card Game Parallel Evolves in Open Beta\n\nThe Ethereum-based NFT card game Parallel extends an open invitation to gaming enthusiasts across the globe, transitioning into its Open Beta phase today.\n\nHaving previously been accessible solely in Closed Beta, this Sci-Fi card game steps up its ranks by promising to engage a broader audience, opening its competitive PC-based title to the general public.\n\nWith the introduction of five distinct factions, a new playable NFT card, exclusive cosmetics, and an array of additional rewards and adjustments, gamers can now choose their allegiance and craft a unique path to victory, blending skill, strategy, and creativity.\n\nA Rebirth in Card Games\n\nMerging the classic charm of trading card games like ‘Hearthstone and Magic: The Gathering’, Parallel introduces a distinct space-themed twist on Coinbase’s Layer-2 scaling network, Base.\n\nCelebrated for its innovative approach to the card game scene, Parallel has evolved through numerous extensive developments, which have led to the launch of its Open Beta debut:\n\nBaseline emissions have been raised by 15%\n\nProduction costs for ‘Echo’ cards have significantly decreased\n\nThe modifier for the highest rank has been enhanced\n\nPRIME bonus for ‘Prismatic Key’ victories increased from 35% to 50%\n\nPrevious in-game bug issues have been fixed\n\nMinimum standard specifications have been revised.\n\nOn top of experiencing a thrilling shift in the game’s dynamics, Parallel is notably introducing ‘Premium Battle Passes’, alongside ‘Masterpiece’ and ‘Special Edition’ raffles to offer exclusive perks.\n\nAdditionally, gamers can brace themselves for a card adjustment involving the iconic ‘Master Thief Kozo’, with an intriguing new NFT card in the mix.\n\nWhile the opportunity to claim the Closed Beta Season 7 ‘Battle Pass’ card and cosmetic enhancements comes to a close on March 8, a new door opens.\n\nNow, it’s time to step into a new realm of gaming greatness as Parallel’s Open Beta embarks on an intriguing, revamped journey.\n\nWant more? Connect with NFT Plazas\n\nSubscribe to our Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNMmJoOFBPQ0UyU0E4TGdra0NQWXNNLUtfZEdJY0k1NDU1N1lVcU10b2Y3eFhicnV0Sll3OEcwWFJKSVMzMFRTQkJDSjlhQ2VsRkxjcjB4TWFDTDhER3pPZS1GNFhBd2VnVzBvSDBVUHFvV09nSWR1QTZFSEFEcUxTazdvT29HZEhqZmlacFNR0gGTAUFVX3lxTE8yNlU2bEIxTU5QVVNGSFh0anRhNGJDUEJSdkZKZG9uVUphaFhiYkpKUXRjRHFrZ2hXQVhEYTdrR1dKU1VaVkM2aG81QzFIak5sWjhDelJXNDd2S2JweHZiYS04SUJtUGpZcVlRRWpqZDB0bnMybkVhalNCaWVtcHBkbld1S1FiQU9OemxQOENuMTlnSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Jim Cramer makes ‘pretty obvious’ prediction about Ethereum ETFs - AMBCrypto News",
        "content": "Amidst Ethereum’s [ETH] recent 16% surge in the past week, Jim Cramer, a respected market analyst and TV host, predicted that Ethereum ETFs’ will become the next big thing.\n\nOn the 28th of February, Jim Cramer took to X (formerly Twitter), drawing parallels between Bitcoin’s [BTC] ascent and Ethereum’s surge to $3,400, said,\n\n“Given the success of the bitcoin ETF, it’s pretty obvious that an Ethereum ETF will soon bloom.”\n\nCoinbase backs spot Ethereum ETFs\n\nFueling the event further, currency exchange Coinbase formally petitioned the Securities and Exchange Commission (SEC) to greenlight the trading of the Grayscale Ethereum Trust on the NYSE Arca platform.\n\n\n\nCoinbase recently submitted a comprehensive response to the SEC for a spot Ethereum ETF proposal, advocating for the approval of Grayscale Ether Trust. They argued,\n\n“ETH’s market depth, tightness of spreads, and price correlation across spot markets are highly indicative of a market resilient to fraud and manipulation.”\n\nThis strategic move reflected a broader industry trend, with major financial players like Fidelity and BlackRock also pushing for Ethereum ETFs to be established.\n\nThe increasing optimism\n\nAs per Bloomberg, the Standard Chartered had also predicted,\n\n“Ethereum’s price will surge to $4,000 pending SEC approval in May.”\n\nThe optimism around Ethereum ETFs was also reflected in the sentiments of industry leaders like Grayscale’s Sonneshein who confidently anticipates the greenlighting of such financial products in 2024.\n\nAdditionally, ETF expert James Seyffart echoes this sentiment, expecting an ETF product to receive approval this year.\n\nHence, market analysts and financial leaders’ consensus reflects growing confidence in cryptocurrency’s integration into mainstream investments."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPLU1qVmJGbkstZVpFQXAyS19BRl8tZHhYTnhQcTNQc2NNOGlfVHpLN0lQUlhRck14NWNHcTBCSVI0VHdFM01UaldUbkxLYm9MMklocXM3cWZsX2doajRGTHpkOFlNNDloRHdDdzIwQ3pFSTRONXZ2X2RTYWt3WmhVMUowYW5XUWlHaGdEanJXT3JMT0dsVzg0VEtsdk1MRDFoM0I5X2REc0dZZk4wV3hTTEphbVVaSy1pdldjal9UM1VyX3ViRmtN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Uptrend To Continue? These Could Be The Factors To Watch - TradingView",
        "content": "Ethereum price climbed to a new multi-month high above $3,500. ETH is correcting gains like Bitcoin and might find strong bids near the $3,250 zone.\n\nEthereum extended its increase above the $3,500 resistance zone.\n\nThe price is trading above $3,300 and the 100-hourly Simple Moving Average.\n\nThere is a major bullish trend line forming with support at $3,260 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct lower, but dips might be limited below the $3,260 support zone.\n\nEthereum Price Eyes Fresh Increase\n\nEthereum price gained pace after it broke the $3,200 resistance zone, like Bitcoin. ETH cleared many hurdles near the $3,320 and $3,400 levels. Finally, it spiked above the $3,500 level.\n\nA new multi-month high was formed near $3,515 before there was a downside correction. The price declined below the $3,420 and $3,400 levels. It even tested the 50% Fib retracement level of the upward wave from the $3,110 swing low to the $3,515 high.\n\nEthereum is now trading above $3,300 and the 100-hourly Simple Moving Average. There is also a major bullish trend line forming with support at $3,260 on the hourly chart of ETH/USD. The trend line is close to the 61.8% Fib retracement level of the upward wave from the $3,110 swing low to the $3,515 high.\n\nImmediate resistance on the upside is near the $3,420 level. The first major resistance is near the $3,450 level. The next major resistance is near $3,500, above which the price might gain bullish momentum.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nIf there is a move above the $3,500 resistance, Ether could even rally toward the $3,620 resistance. Any more gains might call for a test of $3,800.\n\nAre Dips Supported In ETH?\n\nIf Ethereum fails to clear the $3,420 resistance, it could start a downside correction. Initial support on the downside is near the $3,310 level.\n\nThe first major support is near the $3,260 zone or the trend line. The next key support could be the $3,250 zone. A clear move below the $3,250 support might send the price toward $3,120. Any more losses might send the price toward the $3,050 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,260\n\nMajor Resistance Level – $3,420"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQWFhtT2ZjSWh4VWNWNG1oSWQ1dzc5Z2wtMXE1SkNkOGtSYjlZR0c1aXZrQVppUTZRcjFiUExwREdSbm90cWRURU1Sb01WZXd1ZFRES0E1eHl2N0EzMlRJWG81OEZDZG9INFpEcFRfNDNiTUNaVXJsX2d3RE5nOXVtZ05UaDM1aDc2cXNFZm5VUzFwYzJGamNLX0UtZDQ2LTk4WG9yYTk0ZUhHZlFGZlYzY2x5M1Nnd21UVmR4RGZKNGd5Q2RaZWxXby1BYTFCLWFDaFAwbGJ1TXRJVmtIejhuY2xldDVJWkXSAewBQVVfeXFMTUNmcGJ4WW5US0hjMmczdDdaMUk1RElPWXdiN0U2azRxSVNJb3N3QVRwR2ZqaUtlbXJrRjlfSG15d3A5N1J2X0JneXJjdndBM1MxVUNkbzJId3VxU015akVWeHJ1dGwyRFhfR1c4azhDQjNEbmxpTktqQ190SzJLQklxQnFuZHVTR0JubVNRbi1BbDFTUElzRVNIRkE3TjQya0hPdURFZEt2VzA1eDRmWjJlSUd4VkpIMWx3R0RPeHJ4djFRbHE4T21KYUlsMVhRdmc3X1gxXy05YWx5RTBsbmhVdEY3LVhxTFBnV2Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum funding rates surge to over two-year highs as bullish bets get costlier - FXStreet",
        "content": "Bitcoin price rally past the $60,000 mark pushed the annualized funding rates for BTC contracts to more than 85% on top exchanges.\n\nThe surge in funding rates is the highest since early April 2021.\n\nThe annualized funding rate for Ethereum contracts on Binance exceeds 110%.\n\nBitcoin’s (BTC) price rally to its 2024 peak of $64,000 has resulted in a spike in funding rates, pushing them to hit a 27-month high. Data from the centralized-exchange data platform Velo Data shows that the BTC rally has catalyzed a bullish sentiment in the futures market, which is likely to attract arbitrageurs and institutional investors.\n\nAlso read: Bitcoin shatters $63,000 as Jim Cramer posses a rhetoric on BTC value for mankind\n\nBitcoin and Ethereum funding rates peak\n\nBitcoin price rally to $64,000, a new 2024 peak, marks the end of a prolonged bear market and paves the way for hopeful BTC holders, awaiting catalysts like the upcoming halving event in April 2024. The futures market has renewed hopes from Bitcoin’s recent bull rally, with funding rates soaring to 27-month highs.\n\nAccording to Velo Data, BTC’s funding rate on Binance surged past 89%, and is nearly 80% on the OKX exchange. The surge in annualized funding rates for Bitcoin contracts open up arbitrage opportunities for institutional investors and large wallet addresses.\n\nBTC Funding Rate. Source: Velo Data\n\nOn Thursday, Bitcoin trades around $62,600. The largest crypto asset by market capitalization is up 21% in the past week.\n\nEthereum (ETH) rallies alongside Bitcoin as the two enjoy a high correlation of 0.93, according to Macroaxis. Ethereum futures contracts have crossed a 110% funding rate on Binance, according to Velo data.On Bybit, Ethereum funding rate is 100%, versus February 28, when it was 10%.\n\nETH funding rate. Source: Velo Data\n\nThe massive spike in funding rates has brought them to their highest level in 27 months, alongside catalysts like the recent SEC approval of Spot Bitcoin ETFs in the US and the anticipation of a Spot Ethereum ETF approval by the regulator. In this context, both assets could see further increases in funding rates and popularity among derivatives traders.\n\nMarket participants have noted the capital inflows to Spot Bitcoin ETFs in the weeks following the product’s launch, fuelling hopes for institutional interest in futures and the underlying asset.\n\nAt the time of writing, Bitcoin price is $62,631 and Ethereum is exchanging hands at $3,469."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE5QWUx1ZExST3UtTVVMenFzRXZFR0xHajZpNWZ0LTRETVhGWG1kOHdIUE5iN3F3c2Y3SEtwTmhHWXVCN3R5WFJfSV9ENTJ6S3hUSkFicGdOT1MtQ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "What Is EigenLayer? A Guide to the Decentralized ETH Restaking Protocol - Unchained",
        "content": "EigenLayer is an Ethereum-based protocol that uses a restaking mechanism to allow ETH stakers to reallocate their staked tokens to bolster security for other protocols built on the network.\n\nAn important part of the growth of Web3 is the development of innovative solutions that drive down the cost of building dApps without compromising security. EigenLayer is a marketplace that offers developers on the Ethereum network access to a marketplace of Ethereum stakers ready to provide validation services at significantly low costs.\n\nRead on to learn about EigenLayer, how it works, and its benefits and risks.\n\nWhat Is EigenLayer?\n\nEigenLayer is an Ethereum-based protocol that uses a restaking mechanism to allow ETH stakers to reallocate their staked ETH and Liquid Staking Tokens (LSTs) to bolster security for other protocols.\n\nStakers on EigenLayer earn extra restaking rewards for their efforts, while the protocols enjoy access to an already-built validator set.\n\nEigenLayer commoditizes decentralized trust by allowing protocols to leverage Ethereum’s highly secure trust network, driving down the cost of kickstarting protocols since they don’t have to spend on reward incentives to create a validator set.\n\nHow Does EigenLayer Work?\n\nEigenLayer enables users to repurpose their staked ETH to extend Ethereum’s security to other dApps built on the network.\n\nUsers can opt into EigenLayer and agree to grant additional enforcement rights on their staked ETH. The opt-in feature creates additional slashing conditions to meet the conditions of projects, such as data availability layers and bridges. The slashing conditions enforce honesty among the participants and ensure the security of the dApps utilizing EigenLayer is upheld.\n\nEigenLayer operates as a marketplace where developers get to incentivize validators to allocate their restaked ETH to secure their protocols. Alternatively, dApp would have to create a native token for the validators’ reward incentives and bootstrap their own trust network from scratch.\n\nWith Eigenlayer, developers can make it attractive for validators to choose their projects through attractive yields. The financial and time resources involved here are significantly lower than those involved in creating an entirely new trust network.\n\nTypes of Staking on EigenLayer\n\nUsers can choose between two staking options on EigenLayer: native staking and liquid restaking. Let’s take a look below.\n\nNative Restaking\n\nNative restaking involves having the Ethereum validator’s withdrawal credentials to the EigenPod, which is the protocol’s smart contract. Users must operate an Ethereum Validator node to participate in native staking.\n\nLiquid Restaking\n\nUsers can also choose to restake by locking their liquid staking tokens, LSTs, into EigenLayer smart contracts. The validator takes their LSTs already staked on protocols, such as Rocket Pool and Lido, and restake them on EigenLayer.\n\nBenefits & Risks of EigenLayer\n\nEigenLayer presents both benefits and risks.\n\nBenefits\n\nAdditional rewards for stakers: Restaking allows stakers to earn rewards from multiple protocols.\n\nTrust aggregation: The large capital pool improves the trust model by reducing the chances of and increasing the protocol’s corruption cost should a 51% attack occur.\n\nReduced capital costs: On the validators’ side, reusing capital across multiple services amortizes its cost. On the developers’ side, EigenLayer solves the bootstrapping problem by offering a large validator set at a comparatively lower cost (both financially and in terms of time) than building the set from scratch.\n\nSimplified network security: Restaking on EigenLayer presents flexibility to the Ethereum ecosystem, where projects can easily access and utilize the network’s security. Small projects no longer need large capital outlays to develop security systems as they can rely on Ethereum’s. An increase in the number of projects on Ethereum due to the lower entry barrier increases adoption and leads to further decentralization.\n\nRisks\n\nYield risk: The open marketplace may lead stakers to opt for the protocols offering the highest yields. This may lead to competition between projects to adjust their yields to attract stakers, leading to limited or no demand for projects that offer lower yields.\n\nCentralization: EigenLayer’s promise of increased yields may lead to ETH stakers redirecting their withdrawal credentials to the protocol. This risks the Ethereum network if bad actors identify and exploit EigenLayer’s potential vulnerabilities.\n\nSlashing: A staker agrees to the potential slashing of up to 50% of their staked ETH. Additionally, they have to comply with the protocol’s conditions. If the rules determine they exhibited malicious behavior, they stand to lose the remaining 50%.\n\nThe (S)Takeaway\n\nEigenLayer holds significant promise in benefiting multiple parties, especially developers looking to focus on their dApp’s features and trusting EigenLayer to provide validator sets. This can potentially lower the entry barrier and see more decentralized protocols built on Ethereum.\n\nHowever, EigenLayer also comes with a set of risks, including yield risk, centralization, and the potential for stake slashing. How the protocol will address those challenges will significantly impact its future."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOamVCMWdtaTQ3ZXZxU1JrMzhqTVJ4WHM5MHZRV21nekE2cGJJX1pNNnFZb05SazQ5c3dMbFp3WkxrTVJSQ1NjbGd2MzQ0WHZnZDRMNEUyd1hiVGg0Qkt0OWJjSzZQZzF4TkF5SzdVY0x0QldnVm16YktMcE44X242QWgtWUdsRExWLW9sVjM4Rkg3UXc1LTdOV2dfTF9CbzRKVEdLZDQ4SUw5Mm9QcjNINFFDOEZzWEJEYXlhMXNRRk94b0xITl9OdU1qWWfSAdIBQVVfeXFMT0JhR2t3UUpQTmZZM0JkS2E3VW50el9nZVgyZVdQNGtvWk1oN1ZnVDJ6ckdBOEZxdURDTWdiVTV6ZnZBY2VSVlN1bTJYMldMM1c5bmhCSjZtczFjZUZFb2xlQWVIV215Q0QxUEFTWW5zR1NiSzhZRi1BUDJwUXp2R3lZWTVSMjZqSlBLanphVmJMbHpMcWwyR2NPRUh6d0N6WS1HUjh2QS0xVkl2cElaMEcwRTlNekxhaW5nNGZxck83eVlUOTRIdUlnb0pRVUNiUVRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Here’s the Upside Potential for Solana (SOL) in the Coming Crypto Bull Run, According to InvestAnswers - The Daily Hodl",
        "content": "A popular crypto analyst is laying out the potential upside for Ethereum (ETH) competitor Solana (SOL).\n\nIn a new YouTube video, the anonymous host of InvestAnswers notes to his 478,000 subscribers that Solana hit 20% of Ethereum’s market cap in December but has been outperformed by the second-largest crypto asset in the months since then.\n\nThe InvestAnswers host says that if Solana returns to that 20% level, that would mean a SOL price of around $171, based on what ETH’s currently trading for.\n\n“If we go to one-third of the market cap of Ethereum, that’s $277. If we go to half of Ethereum, that’s $421, and if we go to 70% of Ethereum – $585. A lot of people talk about it becoming parity, but I’m not going to go there, because ETH is still a big machine, a big monster. And remember, we’ve been at some of these levels before in the past, and we can probably go to them again.\n\nBut the other good news is, as the value of Ethereum rises, technically Solana will rise too. But there’s a lag in between — so the future’s very bright.”\n\nSOL is trading at $108.62 at time of writing. The fifth-ranked digital asset by market cap hasn’t experienced the 2024 gains that most of the crypto market has and is priced at roughly the same point it was at the start of the year.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNS1RRNS1UdXA4Zm4zSURWVm5xcHlXZENrZnpfTG9MSG1wdmpmNHh6TndybVZQbUJRNklQUlV1a0picmZtbml5X3Voc2lNcHhHYVJsaU9nRDZnb1NzX3RTTkZwZktRV2JHN1lma2JVMzZyaVdvdXJMMFBqVDN5SHFoaGg0c1B1dmlfMnFUWXMzb2JFOEg3c3h2UVF1dkNKbFZHS0w3TNIBqgFBVV95cUxOd1pOUE9QX2d6a2xCcW04WjRaT0txWnV3b2x4UVd2SFRySG9ISGtsWDE2YkxxS2tGM0EzTGZJcnEtaGpPZ18zREtncWJISkxDVWphdW1ieUhmZmNUSmFwemR4c3JPY1lBcUdiSlFReW9mcXJJNklJQ3hIRVZha1BwTlp0T0J2TmFrMW5Tak9nSmxyQkFjOW50M09FZUV0R0xPY3hzREZnREJPdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Tag New 2024 Highs But These 3 Altcoin Gems Could Hit $1000 - CoinGape",
        "content": "Bitcoin price continued with its bullish streak closing February with a 45% increase from the monthly open. The largest crypto ascended to $64,000 before high volatility caused a sharp but brief sell-off to $60,000. Ethereum also doubled down on its bullish efforts, rising above $3,500. As the largest cryptos breakout, investors may want to consider 3 altcoin gems could hit $1000 in 2024, including Binance Coin (BNB), Bitcoin Cash (BCH), and Bittensor (TAO).\n\nAs the Bitcoin halving approaches, a pivotal moment anticipated to kickstart a new bull market in April 2024, cryptocurrency enthusiasts are looking for lucrative alternatives. BNB, BCH, and TAO are three such altcoins expected to soar to $1,000 before the halving, presenting themselves as attractive investment avenues in the lead-up to this crucial event.\n\nadvertisement\n\nBinance Coin (BNB)\n\nBinance Coin (BNB), the proprietary token of the Binance ecosystem, operates on both the Binance Chain (BEP-2) and the Binance Smart Chain (BEP-20), serving as the cornerstone of these platforms. Its dominance stems from the substantial trading volumes seen on Binance, coupled with its crucial role across the exchange’s dual blockchain infrastructure.\n\nNotably, the BNB Chain stands out as the primary blockchain, facilitating a wide array of decentralized applications that rank among the top in the market.\n\nRecently, Coinbase made headlines by broadening the scope of its asset recovery tool to encompass the BNB Chain and Polygon networks. This development has notably contributed to a bullish Bitcoin market value trend.\n\nAs of the latest updates, BNB has successfully breached the $400 resistance barrier, showcasing a commendable performance. Currently, the token is priced at $414, reflecting an impressive increase exceeding 4% in its market value.\n\nBitcoin Cash (BCH)\n\nBitcoin Cash (BCH), designed to function as a peer-to-peer digital currency, envisions itself as a robust global currency facilitating swift transactions, nominal fees, enhanced privacy, and expanded block sizes. Born as an alternative to Bitcoin, the original and most esteemed cryptocurrency, BCH has climbed its way into the top 20 digital currencies, solidifying its position as a leading Bitcoin fork.\n\nThe value of BCH has recently broken through the $300 resistance mark, signaling a strong bullish trend. Presently, BNB stands at $303, exhibiting a growth of 1.29% in the past 24 hours and an impressive 16.88% over the last week, cumulating a monthly increase of 24%. Predictions suggest BCH could soar to the $1000 milestone as the Bitcoin halving event approaches.\n\nBittensor (TAO)\n\nBittensor (TAO), an innovative open-source protocol, underpins a decentralized network for machine learning on the blockchain. This network enables collaborative training of machine learning models, rewarding them with TAO tokens based on their contribution’s informational value.\n\nThe overarching aim of Bittensor is to establish a genuine marketplace for artificial intelligence, where both creators and consumers of AI can engage freely, supported by a trustless, transparent, and open framework.\n\nRecent trends on the price chart indicate a consistent upward trajectory, marked by successive higher highs and lows. Bittensor has broken through the upper edge of its ascending channel, hinting at a potential resistance challenge. At the time of writing, the price of Bittensor surged past the $600 mark, now trading at $616, signaling robust bullish momentum.\n\nBottom Line\n\nIn conclusion, the impending Bitcoin halving catalyzes market movements, historically marking the onset of a bull market. Investors are diversifying their portfolios with promising altcoins like BNB, BCH, and TAO, all poised for significant gains, potentially reaching $1,000 before the halving event in April 2024.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE94Q3VnenZJYThvZlJISmd0NGZreHZWbzV4OUNwVUdSMTIwTFhOU3dNZ0UxcTVmNlZCeTdkaEw0UXpHNnltOVUxTGVoLTZNMWxaNXRJZkdOdWNsTWRNc3pOelZCMzZnLW85cDhYUEdQU2VTbE5mcnBqTnRld1F6amfSAYQBQVVfeXFMTkNqdktuaDdiY2Y5Wk0zVjRsZkUzYng0WEZOdm9XMm5OMzhsNHEzM2J4blNleU9NV0JQalhQY3JISlo1dGFnM3NTQ2lad1lUSTFkaTh1SHVOakFRTDRUZFktVlo2a3J2UVc2T3VhMVVseWtpaklZSExGb0hheTh2cmo4dUJW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Jim Cramer Issues Unexpected Ethereum ETF Prediction - CoinGape",
        "content": "Jim Cramer, the controversial Bitcoin and crypto critic and CNBC Mad Money host has caught the broader digital currency ecosystem unawares with his positive prediction for spot Ethereum ETF.\n\nJim Cramer Acknowledges Spot Bitcoin ETF Growth\n\nPer Cramer’s post on X, there is a very high likelihood that spot Ethereum ETF approval will come from the United States Securities and Exchange Commission (SEC) very soon. He hinged his prediction on the success that the spot Bitcoin ETF market has recorded in the last few weeks after being greenlighted by the securities regulator.\n\nadvertisement\n\nGiven the success of the bitcoin etf it's pretty obvious that an ethereum etf will soon bloom — Jim Cramer (@jimcramer) February 28, 2024\n\nThe spot Bitcoin ETF market has registered more than $6 billion in inflows so far with BlackRock’s IBIT leading the train. On Tuesday, IBIT registered a massive $520 million inflow from a net inflow of $577 million. This meant that up to 10,167.5 BTC was added to the general spot Bitcoin pool. The $577 million inflow is the third largest that the nascent ecosystem has seen since it was launched.\n\nOn that same Tuesday, the trading volumes for all nine spot Bitcoin ETFs combined reached $2 billion. The volume of flows seen in the spot Bitcoin ETF market must have taken Jim Cramer by surprise because he had previously looked down on the potential of the offering.\n\nHe blatantly questioned the future performance of Bitcoin, although, at the time, the coin was struggling to form support at $40,000. However, his recent statement about the Ethereum ETF suggests that he may have changed his perception of the potential of the spot Bitcoin ETF and the flagship cryptocurrency.\n\nSpot Bitcoin ETF Applicants Waiting on the SEC\n\nMeanwhile, there are ongoing meaningful speculations around the spot Ethereum ETF.\n\nMany of the applicants, including Grayscale Investments, are currently awaiting the decision of the SEC on the offering. While waiting, many are updating their applications to ensure that the securities regulator has no excuse to reject their application eventually.\n\nAlmost a week ago, the Chicago Board Options Exchange (CBOE) filed the 19b-4 with the agency on behalf of Franklin Templeton for its spot Ethereum ETF. Similarly, VanEck took a strategic step by submitting its S1-A form for its proposed spot Ethereum ETF on February 17.\n\nAll of these updates and amendments, like in the case of spot Bitcoin ETFs, may be an indication of how close the approval from the SEC is, hence, Jim Cramer’s prediction may be true.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNWWFFcmRXcFJnT3QwaGVpMW9iWkU4SXBBMHJjajM4bE5IeE5mV25ZOFd1U3R2ZkF5dnZRaTFKODYwbV9hcUk2Zmw4elZQVGc3amNNQ3hCOGpfN1MxdklyVWs1VUQyVTVrZFRGQmQ5VEE5Z2xUOFk2cDluLWJPVVBUSTVCZF9XcldTemIzVU9fQU85TFhzQkNrOXowbUFKVUtSaFdndlQzQTJKVzFZOTFQOUxCNjVKeVBZLVVmdnFYRFZObV9hSURUMjhfUTRMNjFyT1HSAdcBQVVfeXFMTUduTUNyU2ttejQ4RVVoVm1RU0kxN2ktNUx4eUlvWW1sR1FTR2pKVjdndnJQUTE2ZG56cU1MX2ZUVlc0VGJZSDdsMVBVTnNib0tLU0dWOVF6NHFnX3JqdlpQMTdGUkwwV0pvb3E2OVJIbENsT0pzMmZOMmxBTFJTM253ZVpUSmlac3NEWGprTGFuN2lPWV9sYkloNTdGcXhobTVIQUdtc2FEcHRrU1U1a2tDaDBCYWE3X2dEZS1GYVpFWGs4T09xUEZlbEhGV3gxbUlvV0dwcVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & ETF – Asia Wrap 29 February - FXStreet",
        "content": "Bitcoin ( BTC ) price exploded to an intraday high of $64,000 on Wednesday before a quick retraction. Reports circulated that over-the-counter ( OTC ) BTC supplies depleted, which could compel institutions to switch to public exchanges as an alternative source of Bitcoin.\n\nFollowing the landmark approval of multiple spot Bitcoin exchange-traded funds (ETFs) on January 10, this has been the abounding theme in the cryptocurrency market. The lead crypto analyst at FXStreet attributed the narrative to the surge in Bitcoin price, which now stands about 50% higher since the investment product started trading.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxPcUc3eGk4NWxSVmlmVWs3eGtBNGYwV25CVHhEU1pvMUszMjRyazB1blVhaG1wdmZIUktZZXJBSmYxcTlLNVBPMHdRMkJVZ2JnSVR0S0ZDNkhiR1Vpdm4yTG5tVE9FM2JZODhHNFVwU1VkNVRCQnc0MW1aSlZMemt5WlJMN3pMdjNZS3ZZVXk5cGlBT2U4WEViVGNQZ1h1UEVQVlBRSjBUMTNpanRLeVNMZ0ZLYzVCak9PME1SbnpvNlVuaS1WSnZKOWlOVW13Z1E1ZC11M1FtQnVwYnMzSHo1NFA5ckRFMTlYMFdV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "BingX Launches Ethereum Layer 2, Bitcoin Layer 2, and Web3 Game Token Airdrop Guide for 2024 - Media OutReach",
        "content": "The issuer is solely responsible for the content of this announcement.\n\nSINGAPORE - Media OutReach Newswire - 28 February 2024 - BingX QA, known for its innovative approach to cryptocurrency research, has unveiled the 2024 Airdrop Guide featuring Ethereum Layer 2, Bitcoin Layer 2, and Web3 Game tokens.In 2023, BingX QA released Airdrop Guides for tokens such as Starknet and Arbitrum, providing users with valuable insights into airdrop opportunities. Following these guidelines, numerous users participated in the Starknet airdrop in February 2024 and received a minimum of $1000 worth of STRK tokens. In response to inquiries from users eager for more airdrop opportunities, BingX QA intensified its exploration and research efforts.The latest Airdrop Guide includes promising projects such as Ethereum Layer 2 Blast, Bitcoin Layer 2, Celestia, Ronin Network , and the ERC404 protocol.Blast, developed by the NFT trading market Blur, is an Layer 2 public chain where users can receive airdrops by staking ETH.The development of Bitcoin Layer 2 has been a hot topic, with the recent Merlin coin airdrop requiring staking of Bitcoin ecosystem's BRC-20 Ordi tokens.Celestia, being one of the earliest modular public chains, also requires staking of Tia tokens for airdrop eligibility.Additionally, the ERC404 protocol released its first token, Pandora, in February 2024, with the promise of future airdrops for holders of Pandora tokens.In order to facilitate user participation in airdrops, BingX has listed coins such as Ordi, Celestia, and Pandora on the spot trading market. Investors can use BingX Price Tools to access price estimates, valuations, and risk assessments to decide whether to purchase tokens for airdrop participation.Peter, BingX QA's Researcher, stated, \"Despite the abundance of bull market airdrop projects, Ethereum's price performance continues to correlate with Bitcoin's price fluctuations. Since acquiring airdrops requires staking tokens of the respective public chains, investors should also be mindful of the risk of token price declines due to Bitcoin price depreciation .\""
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPUThOWHRhR2szU2hLRGw4UHpNZVlVZkJzRDhWQ2hXcW16VFpmazllUW1LWGRLcHRjM0R3T20tck9WQzA0X1lIWEdHUFV4OUpzYkwwVmZRdjFFUjRKeW94cG9zQ1VWRE5VWElydmxIN2ZSRnRuMEdzQzVYSklMVnNYSERST25ZNzdTd1k2U2lyNlJkcmdTOFpsTlQzeTZSZnhDRmg0b0V3bWxPMXVkVm0tcTN1QWVZZ1NxUUFmSmlrWmx6bWJRTmhtTTlWMUNMX0RFbWdOd1NqVdIB3AFBVV95cUxNdGZJTTFfMlk4X3FsUzlSeDFySDdvcGY1MEk2NWIxaEVEOHZrZHFTNmpEV1VhbGpBc081TGNUcjRaUF90ajdPX1lWQmRmOEtqa1RpbXJGUDE1U1hBV1JEU216M2JJbFhpVnQ5ajZ5UThqaGY1ZS02OV9rX2dUYThyN3BQQXp0VS1vempjTmo5UWs5TjZxU0pUTkp4cnZ4STRWSmt4UUd2Smk3UjdrUV9mWnJncDlVR2N6MVByaVNjSzlKVDJPSExTLUVwS3h5aWg2a1FDWkMyRFhORUot?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & XRP – European Wrap 28 February - FXStreet",
        "content": "Ethereum price rallied to $3,369 on Wednesday, on Binance. The altcoin has rallied to a new yearly high likely catalyzed by Bitcoin’s recent gains and the altcoin’s upcoming upgrade. Bitcoin price is inching closer to its $60,000 target, fueling bullish sentiment among market participants. Ethereum has enjoyed a close correlation with Bitcoin, at 0.92, according to data from Macroaxis.\n\nBitcoin Cash with ticker BCHUSD made a strong recovery back in July of 2023 which might be wave (III) because a slow down from $330 is overlapping, thus it can be a correction, so ideally that's a wave (IV) retracement, meaning that uptrend for wave (V) can still show up on a daily chart with space up to 400-500 area. We are actually tracking a bullish triangle pattern in wave (IV), which looks to be completed after recent break above 300 region.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNYWFPRXMtQlFiRm9TdWpuQ1BRSUNTSy1oNlNpc0puUE96eWhVeUNPbDM3YnpZdkxYX3NuTkY4Tk9nbUlOSGkydjNhZ3pYSzJzQ3NjWDZEOXRnMHlrbENVOGo2ODFUUmprRngzLWpQZk05OVBCNDh4TnNWTFBpU0x0Umhkek5ac2tabmE4TE5zQnJNSTRlbFBfZ210ZU42cG_SAawBQVVfeXFMUHNaMEpGUERQTGlIZm5oZDRYWGNES1dZOGdQNGRfWTFKaEw2OUp2ZXY2Mi03ZmVwZDdSSHRmaF9KdzBKRUFyaTNicFEzY3MweUNVZHhRUjJFWXk0MU4wbFJweWJGd1MwT01GZFR6VjJkdGc4bTU3cmVaUW1DWm5zd2hjakcxZ3JmSEpjUjBqallDamlnT3RVQVBWMGU0NXFyVWJ0RVRfQjJyY0dFYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Hits $3,400, Rises 5% as Smart Contracts Grow - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxONmNfclpmOHZ2RThqcno2WnBCNHVBQ1IyaFZ1R0t6TUhZdldwLVpUSDgydnEzTzk0TmJTOXM2Q25kTUJocmtuMkxCb3NVQWJESnh2dGtQUTNya3VMS0MzV010RW5qSDlBY2VkMkpfMXF4ZkI5LVRRTS1zQ2RncDZaWmpmcmgxVDZ3UkNJN2ZXRG5TbkNNX0pIUmo0RGhnN0FvNEp1OEZOZHdqNXl2UDh1VTVLb1RJOWxqOTFfb1pDU0lRTzRmQWVneFNnNW7SAdIBQVVfeXFMT2RLZ1ZKVFlxVjNEZlBQY2FObGZEaElOYXMxVWUzbVVqQklSakdGX1ZQMWViSzJ4anUwLXVtUmt4Y29pZ3hZcHF3c1pFb2ZoVUlRblZsNzUzM1dZR0d4b2x2VkQxTkN4bjVKbTdIWEJybUVSdFJTLVkxS3B2WWdDVTVLeXBfWUxYTGhrNFhEN04zNU1xcm9aNHMtXzlZV1hfSnM3NFFPMDBsX1B2ZEdPQjJOb3ROZVJ6UUt5cHhxTWE4NnlzYm9fd3pfbmxBNXlyQm53?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price hits new yearly high at $3,369 as staked Ether rises to 26% - FXStreet",
        "content": "Ethereum price climbed to a new high on Wednesday, ETH hit $3,369.\n\n26% of Ether’s supply is now staked, meaning it is removed from circulation.\n\nDencun upgrade will activate on the Ethereum mainnet on March 13.\n\nEthereum price has climbed to a new 2024 high of $3,369 on Wednesday. Bitcoin’s rally to $59,000 and the upcoming Dencun upgrade activation on mainnet have likely catalyzed Ethereum’s price gains.\n\nAlso read: Ethereum price rally beyond $3,000 depends on two catalysts\n\nEthereum price hits new 2024 high\n\nEthereum price rallied to $3,369 on Wednesday, on Binance. The altcoin has rallied to a new yearly high likely catalyzed by Bitcoin’s recent gains and the altcoin’s upcoming upgrade. Bitcoin price is inching closer to its $60,000 target, fueling bullish sentiment among market participants. Ethereum has enjoyed a close correlation with Bitcoin, at 0.92, according to data from Macroaxis.\n\nThe other catalyst is the altcoin’s upcoming Dencun upgrade. This is a key upgrade for Ethereum after the altcoin’s Merge - the transition from Proof-of-Work to Proof-of-Stake. Ethereum developers made an official announcement stating that the Dencun upgrade will go live on mainnet on March 13.\n\nThe Dencun upgrade has successfully cleared the testing phase and is ready for mainnet activation. This event has likely fueled anticipation among ETH holders, as the altcoin’s price continues its uptrend.\n\nBlobs are coming .oO\n\n\n\nDencun is scheduled for mainnet activation at epoch 29696, occurring March 13 at 13:55 UTC. See the announcement below for client release versions and other useful info about the upgrade https://t.co/9Wa3Y5M5k4 — timbeiko.eth ☀️ (@TimBeiko) February 27, 2024\n\nThe event is expected to catalyze gains in Ethereum, pushing ETH price higher. With 26% of the Ethereum supply staked, and out of circulation, Ethereum price is likely to push higher in the coming weeks.\n\nEthereum price could rally to $4,000\n\nEthereum price is in an uptrend, the altcoin is rallying towards it $4,000 target. Ethereum’s psychologically important price level is $3,000. The second largest asset by market capitalization has sustained above the $3,000 level and hit a new yearly high amidst catalysts like Bitcoin’s rally and the upcoming Dencun upgrade.\n\nEthereum price has support at the 23.6% Fibonacci retracement level of its rally to $3,369 at $3,086.\n\nThe Moving Average Convergence/ Divergence (MACD) and Awesome Oscillator (AO) supports Ethereum’s gains and suggests the uptrend is intact.\n\nETH/USDT 1-day chart\n\nA daily candlestick close below the $3,000 level could invalidate the bullish thesis for Ethereum price. In the event of decline, the altcoin could find support at the 38.2% Fibonacci retracement level at $2,911.41."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQX1dDWWV3a0MtU0pRYmNlRzMyREtHaUJxRTY1SjhRYzlQYWt4ODZiYm9SLXZsZHJlTngyNjgxTkgwZFhJUDdCN25KdHFXUVBNRFdCaFZlLWU1cl9nbHRwOU02T3lkbm5DdlhiVEhVbUFGcnlWTEkzX1gyb1ZhTkRxTGRVUDFSbFc2T2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Bull Run Price Predictions: Ethereum (ETH), Solana (SOL), and Nugget Rush (NUGX) - The Cryptonomist",
        "content": "SPONSORED POST*\n\nTLDR\n\nEthereum breaks $3,100, driven by ETF hype.\n\nSolana and Nugget Rush show bullish momentum.\n\nNUGX’s play-to-earn model and NFT integration attract investors, while SOL may hit $195.\n\nFor the first time since April 2022, one of the top-ranking altcoins, Ethereum (ETH), has pushed above the $3,100 level. This rally represents a monthly growth of over 38% for the token. There are speculations that the hype surrounding a potential approval of Ethereum spot ETF in the US triggered Ethereum’s rally, especially as giant cryptocurrencies like Bitcoin (BTC) and Ripple (XRP) didn’t pick up on any bullish run. With ETH targeting ATH, investors are excited about the highs it’ll hit soon.\n\nThis excitement has triggered bullish expectations for other cryptos like Solana (SOL) and Nugget Rush (NUGX). SOL and NUGX have been bullish since last year, earning them the potential to deliver explosive prices with time. While Solana maintains its innovation, investors have been so excited about Nugget Rush’s upcoming launch after it finished its trending presale. These stellar performances of both altcoins have sparked predictions of a bullish price run for the year.\n\nLet’s explore price predictions for Ethereum, Solana, and Nugget Rush.\n\n>> Buy NuggetRush Now <<\n\nNugget Rush’s (NUGX) Early Stage Performance Foreshadows Incoming Long-term Uptrend\n\nThe play-to-earn gaming masterpiece Nugget Rush recently announced that its NUGX meme token will debut on top-tier exchanges after its ongoing presale event ends. The announcement has triggered positive sentiment for NUGX’s price potential, which will be revealed during the upcoming exchange listings. But investors are already wondering if Nugget Rush could be the best crypto to invest in compared to giants like Dogecoin (DOGE) and Shiba Inu (SHIB).\n\nNUGX’s price performance shows a lot of bullish momentum that isn’t showing signs of slowing down soon. When the token was listed for its presale, investors bought in at $0.010 in preparation for its launch. With subsequent presale stages, NUGX is sold at $0.018. During this surge, early investors could pocket considerable gains regardless of the stage they got in at. Although investors who bought at $0.010 are up 80%, holders who got in before the fifth presale round have pocketed over 20% of profits.\n\nInvestors are excited for the token to rally to $0.020 before listing on exchanges. The excitement has led to an impressive presale of over 200 million tokens, showcasing high demand for NUGX. The presence of large investors has also helped Nugget Rush raise a milestone sum of over $2.5 million, which will quicken its rise to rank among the top DeFi projects.\n\nNugget Rush’s mix of play-to-earn gaming, NFTs, and staking benefits positions the platform for quick adoption. Players can mine in-game assets to be exchanged for real value. Nugget Rush’s character-based NFTs can be traded for tangible value, while its rare RUSHGEM collection can fetch holders real gold, showcasing their high-value potential. By having these NFTs baked into the gaming experience, Nugget Rush is set to experience an explosive bull run, making it the best crypto to invest in for 2024.\n\n>> Buy NuggetRush Now <<\n\nEthereum’s (ETH) Push To Peak Prices Set Stage For Meteoric Surge\n\nThe price of ETH went through the roof lately, hitting a two-year high of $3,100. This surge shocked investors when top DeFi projects like Cardano (ADA) delivered little to no bullish momentum. Being the second-largest market cap cryptocurrency, Ethereum has achieved an impressive reputation as the best DeFi ecosystem. With the token’s price targeting new highs, analysts are confident that Ethereum could revisit its all-time highs.\n\nUpcoming impact events like the Dencun upgrade and the Bitcoin halving could push ETH higher. This surge above $3,100 shows that the hype surrounding agitations for an Ethereum ETF is already affecting the ETH. If approval for an Ethereum-based ETF falls through, ETH is expected to deliver new all-time highs as adoption skyrockets. Ethereum is already raking in the dividends of its transition from proof-of-stake to proof-of-work. If ETH continues on this path, it could hit $5,000 by the end of the year.\n\nSolana’s (SOL) Impressive 2024 Start Signals Potential Bullish Run\n\nThis year has been one of Solana‘s most expansive years. The platform’s popularity has heightened compared to last year, when it delivered over 1,000% growth. Since this year started, Solana has been on the front page of every positive crypto news, thanks to its affiliations with trending meme coins and airdrops from top exchanges. Solana’s reach has helped it stabilize despite its bearish correction at the beginning of February.\n\nAlthough the token surge has slowed compared to last year, investors are confident that SOL could rally higher, following the momentum that the Bitcoin halving will introduce into the market. In addition to an already bullish path, Solana-based memecoins have been gaining pace for a while. Dogwifhat (WIF), Bonk (BONK), and Myro (MYRO) have been hinting at an incoming bull run that would reflect on SOL. According to experts, SOL might hit $195 by the end of the first half of this year.\n\nFinal Thoughts\n\nNow that events surrounding ETH are pointing towards bullish prices, Solana and Nugget Rush are following suit. Solana is set to skyrocket, according to her recent performance. Despite being in its early stages of development, NUGX has been pumping for months courtesy of its mouthwatering offerings. Not only has the coin set record impressive growth, but its momentum has stayed solid. NUGX’s exchange listing could deliver life-changing returns to investors, as they’re known to pump the prices of tokens to new ATH. These benefits are what make Nugget Rush the best memecoin to buy now.\n\nVisit NuggetRush Presale Website\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOMDFtdXpvSWZKWlNnNHBjRjNSbUxxWllzd2tpVHNyeUFOaHdiV3NWaHVBWGVaaDlIdU8wOUlKWWd2Q3hyVEVTMFpjYjNTSVFBdWNjM3dxa25FQkI1LVQ3RWNTY2U4ZVR1aEtPMm05SHZiVVhzVnloMkF1ZE1CVDNtWnVITQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Polygon: Scaling Ethereum With MATIC - Markets.com",
        "content": "The Polygon blockchain technology, coupled with the MATIC token ecosystem, provides a robust infrastructure for Ethereum scaling.\n\nBy leveraging the power of Polygon, developers and users can enjoy faster transactions, lower costs, and an overall seamless experience within the Ethereum ecosystem.\n\nBut what exactly are the benefits of using Polygon for scaling Ethereum? Well, for starters, Polygon's scalability solutions are designed to enhance transaction speed, reduce gas fees, and increase the efficiency of the Ethereum network. It's a win-win situation for both developers and users alike.\n\nIntegrating the MATIC network for Ethereum scaling is a straightforward process that brings exponential benefits. By following a few simple steps, developers can seamlessly integrate their dApps with the MATIC network, unlocking the full potential of Ethereum scalability.\n\nAs we look ahead, the future of scaling Ethereum with MATIC looks bright. Ongoing research and advancements in the field are paving the way for even more innovative solutions.\n\nThe integration of Polygon and the MATIC network is set to transform the Ethereum landscape, opening up new possibilities for decentralised finance and beyond.\n\nPolygon and the MATIC network offer a game-changing solution for scaling Ethereum. By harnessing the power of Polygon's blockchain technology and the MATIC token ecosystem, developers and users can enjoy a faster, more efficient Ethereum experience.\n\nSo brace yourself for the future, where the scalability of Ethereum meets the capabilities of Polygon and MATIC network integration.\n\nMust Read: Crypto Trading: The ultimate beginner’s guide Content\n\nUnderstanding Ethereum Scaling Challenges\n\nScaling Ethereum has become an urgent concern due to the challenges it faces in terms of scalability and rising gas fees. The need for Layer 2 scaling and reducing gas fees has become a critical focus for the Ethereum community.\n\nThe Challenge of Scalability\n\nEthereum, the world's leading smart contract platform, is experiencing scalability issues as its popularity and usage continue to grow. The network's current capacity is limited, resulting in slower transaction speeds and increased congestion.\n\nHigh Gas Fees\n\nOne of the main challenges faced by Ethereum users is the soaring gas fees. These fees, paid by users to miners for processing transactions, have surged to unprecedented levels during peak demand periods. This has made it less feasible for smaller transactions and has hindered user adoption.\n\nLayer 2 Scaling Solution\n\nTo address these challenges, Layer 2 scaling solutions are being developed for Ethereum. Layer 2 scaling refers to off-chain solutions that aim to increase the network's capacity and reduce congestion.\n\nThese solutions enable faster and cheaper transactions while maintaining the security and decentralisation of the Ethereum network.\n\nReducing Gas Fees\n\nReducing gas fees is another crucial aspect of Ethereum scaling. By optimising transaction processing and implementing more efficient fee structures, the aim is to make Ethereum more accessible to users and encourage broader adoption. This will allow Ethereum to be used for smaller transactions without the burden of high fees.\n\nLayer 2 scaling for Ethereum\n\nEthereum gas fee reduction\n\nBy addressing the scalability challenges and reducing gas fees, Ethereum can become a more efficient and cost-effective platform, attracting a wider range of applications and users.\n\nIntroducing Polygon Blockchain Technology\n\nPolygon, formerly known as Matic Network, is a protocol and framework for building and connecting Ethereum-compatible blockchain networks. It aims to address the scalability issues faced by Ethereum and enable faster more efficient transactions.\n\nBy leveraging Polygon's Layer 2 scaling solutions, developers can create scalable dApps and smart contracts that retain all the security benefits of the Ethereum mainnet. Polygon achieves this through its unique architecture, which combines Ethereum's security with the flexibility of a standalone blockchain.\n\nOne of the key features of Polygon is its ability to support multiple sidechains, also known as \"Polygon chains.\" These chains are designed to be highly scalable and interoperable, allowing developers to build and deploy their own customised blockchain networks.\n\nThe MATIC Token Ecosystem\n\nWithin the Polygon ecosystem, the MATIC token plays a vital role. MATIC is the native cryptocurrency of the Polygon network and serves as a utility token for various functions within the ecosystem.\n\nFirstly, the MATIC token is used for securing the network through staking. Validators stake MATIC tokens to validate transactions and secure the network against potential attacks. In return, they earn rewards for their contributions.\n\nMATIC also acts as a gas fee token, allowing users to pay for transaction fees on the Polygon network. This helps to reduce the overall cost of transactions and make decentralised applications more accessible to users.\n\nFurthermore, MATIC is used for governance and decision-making within the Polygon network. Token holders can participate in the voting process to influence the protocol's direction and development.\n\nPolygon's blockchain technology offers a scalable and efficient solution for scaling Ethereum. With its Layer 2 scaling solutions and the MATIC token ecosystem, Polygon provides developers and users with the tools and resources needed to build and interact with decentralised applications on a larger scale.\n\nBenefits of Polygon Scaling for Ethereum\n\nOne of the key benefits of using Polygon for scaling Ethereum is the significant improvement in transaction speed. The MATIC network, integrated with Ethereum, enables faster and more efficient processing of transactions.\n\nWith Polygon, you can experience quicker confirmation times and reduced waiting periods, enhancing the overall user experience.\n\nBenefits of Polygon Scaling:\n\nEnhanced Scalability: Polygon provides a Layer 2 scaling solution for Ethereum, allowing for the execution of a larger number of transactions in a shorter time frame.\n\nThis scalability boost enables the Ethereum network to handle more users and applications, facilitating its growth and adoption.\n\n\n\n\n\nReduced Costs: One of the primary concerns in the Ethereum network has been the increasing gas fees. Polygon offers a cost-efficient alternative, enabling instant and low-cost transactions.\n\nBy leveraging the MATIC network, users can enjoy reduced transaction fees and minimise their overall expenses.\n\n\n\nInteroperability: Polygon's technology allows for seamless integration with other blockchains and networks, providing enhanced interoperability.\n\nThis interoperability opens up countless possibilities for developers and users, enabling the creation of innovative decentralised applications (dApps) and expanding the reach of the Ethereum ecosystem.\n\nScalability for dApps: With Polygon, developers can easily build and deploy scalable dApps on Ethereum.\n\nThe Layer 2 solution provided by Polygon ensures that dApps can handle a higher volume of users and transactions without compromising performance. This scalability enables a smoother and more efficient experience for DApp users.\n\nEcosystem Growth: The scalability solutions offered by MATIC and the seamless integration with Ethereum contribute to the overall growth and development of the blockchain ecosystem.\n\n\n\nPolygon's technology attracts developers and users, fostering innovation and creating new opportunities in the rapidly evolving decentralised finance (DeFi) space.\n\nPolygon's scaling solutions bring numerous benefits to the Ethereum network. From enhanced scalability and reduced costs to increased interoperability and ecosystem growth,\n\nPolygon is playing a vital role in addressing Ethereum's scaling challenges and paving the way for a more efficient and sustainable blockchain ecosystem.\n\nExploring the Future of Scaling Ethereum with MATIC\n\nAs the demand for Ethereum continues to grow, the need for effective scaling solutions has become more pressing than ever. The integration of the MATIC network offers a promising path towards achieving scalability and enhancing the overall performance of Ethereum.\n\nWith the continuous advancements in research and development, the future of scaling Ethereum with MATIC looks bright. Here are some key aspects to consider:\n\nOngoing Research: Researchers and developers are actively exploring innovative approaches to further enhance the scalability of MATIC and Ethereum. Ongoing studies are focused on addressing the limitations and optimising the existing solutions. Layer 2 Improvements: The introduction of Layer 2 solutions has already demonstrated significant improvements in transaction speed and cost reduction. The future holds even greater potential for advancements in Layer 2 scaling techniques, offering a more seamless experience for Ethereum users. Adoption and Integration: As more projects realise the benefits of scaling Ethereum with MATIC, the adoption and integration of the MATIC network are expected to expand. This increased adoption will further drive the development of MATIC's infrastructure and contribute to the growth of the Ethereum ecosystem. Enhancing Interoperability: The future of scaling Ethereum with MATIC also involves enhancing interoperability with other blockchain networks. This will enable the seamless transfer of assets and data across different platforms, fostering collaboration and expanding the possibilities of decentralised applications. Community Involvement: The MATIC community plays a vital role in shaping the future of Ethereum scaling. Through active participation, feedback, and contribution, community members contribute to the continuous improvement and evolution of MATIC's scalability solutions.\n\nBottom Line\n\nThe integration of the MATIC network with Ethereum provides a powerful solution for scaling the Ethereum blockchain. With the growing demand and usage of Ethereum, there is an urgent need for effective scaling solutions to improve transaction speed and reduce costs. Polygon, with its innovative blockchain technology, offers a viable answer.\n\nBy leveraging the benefits of the MATIC network, Ethereum can achieve faster and more scalable transactions, enhancing user experience and opening up new possibilities for decentralised applications.\n\nAs the demand for Ethereum continues to grow, the scalability provided by Polygon and the integration of the MATIC network will play a vital role in shaping the future of the blockchain industry.\n\nReady to trade with markets.com? Creating an account is easy.\n\nStart Trading Now Start to trade now Join the 100.000s that have made markets.com their home for trading. Learn about trading as you grow your portfolio. More power in our platforms Ready to trade?\n\nCreate an account! Enter valid email Please enter a valid password Passwords must be between 8 and 15 characters long Passwords must contain at least 1 numeric character Passwords must contain at least 1 uppercase character Passwords must contain at least 1 lowercase character Password must contain ~!@#£%^&*()_-+=:;<>{,[]?,. Password can not be commonly used Password cannot contain non-latin characters Passwords cannot contain spaces By creating an account, you agree to our Privacy Policy, Cookie Policy and receive marketing emails. Subscriptions can be managed under Notifications settings in your account. Trading CFDs carries a considerable risk of capital loss. Trustpilot\n\n“When considering “CFDs” for trading and price predictions, remember that trading CFDs involves a significant risk and could result in capital loss. Past performance is not indicative of any future results. This information is provided for informative purposes only and should not be considered investment advice.”"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOUE0wOWhvWl9MWVpPMi1MTmdxSHlpN2JCOFVUUTVBUkFFaFhZeW83ZGpTZ0wtaDBYZ042UnU2NmF6ZlU2SVJIX1dNU01laGRHYmF6Uzc5b2xKTkNxMC12SkJQRGJha1gtUDZ1aFdJdGlpeTZZQWtiZlJuMGhOcHl5bXYxWnlzOGRnOERuT1FfN2FvQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Institutions choose ETH over BTC and SOL, GFOX also being considered - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nSimilar to Bitcoin’s dominant position, Solana has likewise been a major player in crypto. Its surging price and rising profile since March 2020 has been instrumental in the popularity and acceptance of DeFi.\n\nMeanwhile, Bitcoin’s utility and acceptance have also increased outside crypto circles, with institutions creating partnerships with the cryptocurrency market. These institutions hope to tap into the financial potentials of the crypto market in other spheres, and thus coins like BTC and SOL are often at the forefront of institutional collaborations and adoptions.\n\nIn a recent turn of events, however, market statistics have revealed that ETH is now the largest single asset owned by institutions. This is, however, not the same for retail investors who seem to favor memecoins like Galaxy Fox over popular cryptocurrencies.\n\nThe Bitcoin/Solana institutional tussle\n\nSolana has, since its launch in March 2020, created a niche for itself as a firm competitor of the popular Ethereum network. The token was built on the decentralized nature of the crypto market to create DeFi.\n\nSeeing its increasing utility, investors have pushed SOL from $0.9511 in 2020 to over $110 in 2024. The token’s growth over the years can be attributed to its role as a blockchain network for DeFi projects.\n\nIn January 2024, SOL was in the news for the announcement of the launch of Jupiter’s JUP token.\n\nThe token’s price surged because investors were confident that the new product was going to be on par with other DeFi projects.\n\nYou might also like: ARK Invest, 21Shares partner with Chainlink on Bitcoin ETF transparency\n\nSince February, however, it appears that investor confidence in SOL has stalled, as the price has been going sideways. Market statistics have revealed that the token’s single-digit institutional ownership may be linked to the network’s major price dips over the years.\n\nCrypto investors have shown more confidence in BTC. Despite market sentiments that Bitcoin will experience major sell-offs after an all-time high of $70,000, more investors continue to flock to BTC.\n\nMarket data has shown that institutional interest in Bitcoin is beyond speculation as the cryptocurrency is a tangible asset in 2024.\n\nApart from institutional interest in the pursuit of spot Bitcoin exchange-traded funds (ETFs), institutions are actively entering the cryptocurrency space to partake of its innovative benefits.\n\n\n\nExploring Ethereum\n\nMarket reports have hinted at a shift in institutional sentiment towards ETH.\n\nMany analysts have linked this turn of events to the upcoming Dencun upgrade scheduled to take place in March, 2024.\n\nSome other analysts have suggested that the recent institutional hype around ETH may be due to its switch to a proof-of-stake (PoS) consensus mechanism.\n\nThis has reduced ETH’s supply, increased staking activity, and is predicted to increase demand and subsequent price of the cryptocurrency.\n\nYou might also like: Lido Staked Ether takes over XRP in market cap as Ethereum reached $3.2k\n\nWhile Solana has done pretty well in the DeFi ecosystem, the layer-2 networks built on Ethereum give the coin an edge.\n\nSome analysts have reported that institutional interest in ETH is not a general market sentiment. According to these analysts, retail investors are more diverse in their holdings and have a preference for meme coins like GFOX.\n\nLooking at alternatives: GFOX\n\nGalaxy Fox has raised over $3.6 million in the ongoing presale.\n\nThe project is a blend of meme culture and play-to-earn (P2E) features. Its performance can be attributed to its utility and community support across various social platforms.\n\nYou might also like: Ronin rallies by over 50%, Galaxy Fox presale approaching $4m\n\nGalaxy Fox has shown great potential to change P2E gaming as we know it, with token rewards for skilled players.\n\nThe token is currently used across the Galaxy Fox platform as a legal tender for transactions.\n\nAside from its utility, GFOX affords gamers the opportunity to acquire boosters and NFTs as passive income for staking the tokens.\n\nFinal thoughts\n\nMarket statistics have revealed that institutions that joined the crypto market because of its utility in the first place are now shifting their focus from Bitcoin and Solana to Ethereum.\n\nThis can be attributed to the upcoming Ethereum Dencun upgrade, its recent deflationary supply, and its growing influence in the DeFi space.\n\nWhile ETH is attracting institutions, retail investors are leaning toward memecoins like GFOX.\n\nWith Galaxy Fox’s P2E features, strong community, and growing utility, the token is emerging as a contender in the crypto space. GFOX is available for 0.0028."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQMVVSTklkX05MdWdIaTNLUjA3OHBPTzZ4Z2VSNXc1M1RjYkdraFYwdG9ITTdZcHRLdFhHMl9LcGVaQ2lOdjZwV2gzZUZNaWU2MEtvV2VpdWJ2aHJBbzluc2ZGTHdUbW5zTjBEajM0bk5FUk5ETzEzbG5zLTBGTlVDem0wc0liOEt2RnBDNjBvM3Z3cEZzQ1M0bGdSVnFfNEJRdHJxa3N4NVNobm1Pb0s1SXA3ZWNqeWJlU0F5VA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Shiba Inu: Shibarium Transaction Fee Sits at $0.00001, Beating BTC, ADA, ETH and MATIC - The Crypto Basic",
        "content": "On-chain data confirms that Shibarium, the Shiba Inu layer-2 network, boasts transactions fees hovering at $0.00001, much lower than other prominent networks, such as Bitcoin, Cardano, Ethereum and Polygon.\n\nThe Shiba Inu ecosystem development team launched Shibarium last August to help network participants, especially the Shiba Inu community, overcome the high fee and slow transaction predicament on the Ethereum network.\n\nAmid the growing adoption, the official Shiba Inu X handle recently disclosed one of the most promising features of the network. Notably, the account reminded the community that the average transaction fee on Shibarium currently sits at 0.0000219 BONE worth $0.00001.\n\nShibarium Fact: Did you know that transaction fees on Shibarium are as low as 0.0000219 BONE ($0.00001)? This is just one of the powerful features of our chain! Keep shaping the future with $SHIB #SHIBARMY 🚀 — Shib (@Shibtoken) February 28, 2024\n\n- Advertisement -\n\nThis represents one of the lowest average transaction fees in the blockchain ecosystem, with Shibarium beating multiple networks on this metric despite these other networks commanding greater adoption than the emerging layer-2 protocol.\n\nBitcoin and Ethereum Transaction Fees\n\nFor instance, Bitcoin, the premier blockchain network, features a transaction fee much higher than what Shibarium presents.\n\nAlthough Bitcoin’s transaction fees fluctuate daily, a feature resident in all networks, data from Ycharts confirms that the blockchain currently has an average transaction fee of $7. At this figure, Bitcoin’s fee is about 700,000 times the value obtained on Shibarium.\n\nRecall that Ethereum pivoted to a proof-of-stake (PoS) model in September 2022, with an aim to become greener. Some proponents posited that this switch could help reduce transaction fees, but network participants have continued to lament higher fees on the chain.\n\n- Advertisement -\n\nAccording to data from Ycharts, the current average transaction fee on Ethereum is $1.587, much higher than what is obtainable with Shibarium. Notably, this entails that Shibarium’s fees are 158,700 times less than Ethereum’s.\n\nShibarium Also Beats Cardano and Polygon\n\nLike Shibarium, Cardano and Polygon were built to address the pain points native with earlier proof-of-work blockchain networks. However, Shibarium addresses these issues much better than chains such as Cardano and Polygon.\n\nAccording to the Cardano Explorer, Cardano boasts an average transaction fee of 0.17 ADA, currently worth $0.107 against prevailing rates. While this puts Cardano among the chains with the lowest fees, it falters compared to Shibarium.\n\nDespite being a fork of Polygon, Shibarium beats the network in transaction fees. According to on-chain analytical resource CoinTool, Polygon currently has a normal fee rate of $0.00322 per transaction. This is much lower than Cardano, Bitcoin and Ethereum.\n\nHowever, fees on Polygon are still 322 times more than Shibarium. Besides its promise of much lower transaction fees, Shibarium also facilitates near-instant transactions, making it one of the top choices overall for fast, secure and low-cost transactions."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQckFBMFdDVU5TdGVnbWRWTUwteWN1S1VCODVLZGh5bEtJZ0tsNUtsbC1IeXVzaEVRb2V4T2ttWll2bmctY2pveW02MzFYVUo3VEliazAyS3B6d1I0QkxnWHJpZzlJc25PWnlQU3pjTDZuQXZMSTBPUFZVMVVFX3R0ZDRBQnYySWdSd0ZTVDFIaWhkUEsxdW0tQ1FCUklUZ0pPVGdwZ2k0UjljeHpQSjJ6ZVRoeDVOV0Y2UW8xd3lxZDNSUXdHbHRLZ2dOd3Faa1NTeU1VMjVPUmp2ci1XVEZRYzZHQnFuekFi0gHuAUFVX3lxTE9aZEZmbjVpN3Jkbmc5LVBfMXpqakFJeVJKSHhweFRGQlR2U3F4b0c4SFVucEI1TlFpaHhRNE4zamUwUzBpSnFBZDRmNW5QajJxaV83TjFOdXFWSEQweUIyQUx3THBFUmpMc3NuQmxCUm5OS2ZOekhab2JoVWdXcGc3eEVGUG8xb3l6dEM0Tk5SY2lJei14Vm5kaXZXal9EeEU3XzlUdHozOW03bWo5VnVhM3ZPS3BDUDJfbDVBSWNIdFFfM2RNWDZneThsQ1k3R0o4SGx5X1lyeGd5aVlDdnRtRG5HdGxhdTY2R2xXdGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "JPMorgan Analysis Suggests Bitcoin Halving and Ethereum Upgrade Already Priced In – Is Correction in BTC and ETH Looming? - Crypto News Flash",
        "content": "JPMorgan’s analysis suggests the effects of the Bitcoin halving and Ethereum upgrade might already be reflected in their current market prices.\n\nDespite a bullish outlook on cryptocurrency sustainability, there’s speculation on whether a correction for BTC and ETH is on the horizon.\n\nFollowing the CNF update on JPMorgan’s alert regarding the upcoming 2024 Bitcoin Halving, this article explores the implications of the Bitcoin halving and Ethereum upgrade on their prices, pondering the possibility of a market correction for BTC and ETH.\n\nRecently, JPMorgan made headlines with a tweet emphasizing a positive outlook on cryptocurrency.\n\nBIG BREAKING 🚨 JP MORGAN GOES BIG ON #BITCOIN . MAJOR U.S BANK JPMorgan says \"we see the higher cryptocurrency prices not only sustaining but improving.\" pic.twitter.com/WGKq0W3bey — BITCOINLFG® (@bitcoinlfgo) February 27, 2024\n\nThis statement marks a significant stance from the major U.S. bank, contrasting its previous cautionary advice.\n\nAdditionally, a recent CoinMarketCap post elaborated on JPMorgan analysts, led by Nikolaos Panigirtzoglou, suggesting a deviation from past trends. They argue that the anticipated impact of the halving has already been factored into current prices, evidenced by the increased flow of Bitcoin from smaller wallets, typically associated with retail traders, surpassing that from larger, institutional-linked wallets.\n\nNikolaos Panigirtzoglou, in an interview, highlighted,\n\nThe revival of the retail impulse in February perhaps reflects the anticipation of three main crypto catalysts over the coming months: the Bitcoin halving event, the next major upgrade of the Ethereum network, and the prospect of approval of spot Ethereum ETFs by the Securities and Exchange Commission in May. We believe that the first two catalysts are largely priced in, while for the third, we see only a 50 per cent chance.\n\nAt the time of writing, BTC’s price stands at $57,354, marking a 2.1% increase in recent days and a 10.94% surge over the past week.\n\nMeanwhile, ETH’s price has reached $3,269, showing a 1.17% rise in the past day and an 11.40% increase over the past week.\n\nThe observed confidence boost in both Bitcoin and Ethereum raises the question: Is a correction in BTC and ETH prices imminent? Despite the positive forecasts, JPMorgan’s analysis suggests a cautious approach, indicating that major catalysts might already be priced in, leaving room for speculation on potential market adjustments.\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOd2NDanlfdnp1c280M0FDcHhzaV9Sb2FjRGR5N3hVZ1haSk1oSEJ6OF9VQVprSmtQVzFqbWhTbVpQU3JPSFlpbkRleGtSdHNmUmZfQVk2MTZCZUV2MkcwTnJFakJFdmo0ZTRCWlc5bUFmQmlEV1RxNUlkUDZ4bGxLaEdKVVRwX18wM1EwZnpvYm15cFVxTnloLTVTaWtncXhLN01DSUg2bmZHV1JGRU5qeG5iR0dEdWlQSVdBWmljdWJMRzV5VjBBbElmM0FyUExBeDA2b05qdXAtN0tfWUxNedIB7gFBVV95cUxPN2dnUlJBRGNZWUpOdHlrblh6RVU5cHBWTzZ3aGdYbU02ZzFUR0ZGLUhDdVhEdlc1M3p4NExhUFBXbERLS3p4TVpya1RPTFVkT0QwOFpkdjZSQnE0S2JheG1OZHMzZXlSbmJhTDNRNmx6NlpZYV9nVTBseURjOHpjRnQtUVZzYzUyZEZfSmFlbzl4Z01MUnpIQXZOQ2dRYldjMjBYclBxUmJ5QW1hcXJwUHpocGR0NWtHOFlZR2VGdVVJYlk5akRCQjdzNHV0c2lvUzlGM1RJVUQyMGZsaldnZWQ2bEk4YlNTaXhqUzhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "From Potential to Profits: Bitgert Coin’s Competitive Edge Over Ethereum in Returns - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNQ2tRdXhPbEVYMXhVQk5icjRGRWdqX2x3OGFFeHByV0I5RTNqQVlUYVNsSFVpWmY2NjVNeWtLdzRoeVBJNDRKUHNPY0ZQSzI3U3d1anpScVZ3ZVdWVjRwR1NaLVJUUWRITUQwX2RDanZhOF81MTJkTjdFYlpNU0M3T3BOYXc3YU8yT01mWHFOMWJUOWN5cmVGelJqTmtaU3lVY0VDTXhwNEd6ek92VU1iVWpoU3M0ZzJmMU5hWEhHNFhNQ29aOHZSNWdsR2hxZDh1SFHSAdcBQVVfeXFMTXpVdllWXzlCSVVLRnJUMW9MblZxNnpGa2tEbFdIb1FkN1RWLXlrTk1wTE1PTUVndEVRWTNhMk5JWkJwcGFFc3JIVktFaktfUmprYjhfYmJuaDFCeE1pMDk4dGFRQlJGUFczWFRwSnJ1TnBuN0Y0RjVKUmhyLUd2VnZLaWEyMVdEbGM1NWZjWExFVnJvbGFkbHBPUFdLQTI0U2tMR1FZX1p0YVRvRTFvYmFQc3Zsa09YZW5CS0FiV09BSDlvdWs1dEtEV1VkR2NqdFg5Y3M2MzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ProAir Review 2024 (360 AI): Honest Reports and Ratings Explained by Traders! - mid-day.com",
        "content": "Ethereum ProAir is a novel crypto-trading platform created to simplify the complexities of crypto-trading and ensure seamless trading of various cryptocurrencies.\n\nEthereum ProAir Review\n\nCryptocurrency trading is an ever-growing and evolving industry that has proven to be the best space for crypto trading enthusiasts. This necessitates the need for advanced platforms that use the latest technologies and algorithms to simplify trading. One such technology that has been found to benefit buyers and sellers is automated trading platforms. These platforms offer complete assistance throughout the trading journey.\n\nADVERTISEMENT\n\nRight now, plenty of crypto trading bots are available in the crypto market, and choosing the most safe and effective one from them can be a real task. A trading software that is currently trending is Ethereum ProAir. This trading system has become a topic of discussion among crypto experts and several reviews are popping up online presenting mixed opinions. So, an in-depth examination of the system is necessary to verify its authenticity.\n\nThis Ethereum ProAir review will get into every detail of this trading platform such as the registration process, its working, main features, pros and cons, minimum deposit, cryptocurrencies supported, and more. So, continue reading the review and see if this trading bot is worth investing in.\n\nEthereum ProAir AI Review Platform Facts\n\nTrading Bot Name Ethereum ProAir Versions Ethereum ProAir 360 AI Platform Type Web-based trading bot Accessibility From all devices Verification Required Yes Assets Supported Stocks, Forex, Commodities, Indices, CFDs, Crypto and more Minimum Deposit €250 Payout Time 24 hrs Software Cost Free Deposit Options A wide range of payment services Available Countries Many countries across the world Official Website Click Here\n\nWhat Is Ethereum ProAir?\n\nEthereum ProAir is a novel crypto-trading platform created to simplify the complexities of crypto-trading and ensure seamless trading of various cryptocurrencies. In addition to crypto, the platform also supports traditional stocks, CFDs, forex, and other asset classes there offering opportunities for portfolio diversification. According to the creator, Ethereum ProAir will suit expert traders and beginners.\n\nThe Ethereum ProAir trading system simplifies trading by using advanced technologies like artificial intelligence, algorithms, and technical tools. The platform offers a demo mode, also known as practice mode to carry out virtual trading without risking money. Ethereum ProAir also has a customization feature that can be used to adjust various settings including trading parameters.\n\nClick Here To Trade Now With Ethereum ProAir For Free!\n\nEthereum ProAir Main Features\n\nFeatures of a trading platform help decide if it is worth investing in. Here, let us go through the unique features of the Ethereum ProAir trading software:\n\nIntuitive Interface And Simple Dashboard\n\nTwo of the main features of the Ethereum ProAir platform are a user-friendly interface and a simple dashboard. A simple interface ensures easy navigation of the platform and the dashboard lists all features in detail. The dashboard includes a data tracker, technical analysis tools, and more.\n\nAdvanced Technologies Like Artificial Intelligence\n\nNext, the Ethereum ProAir trading software has been integrated with advanced technologies like artificial intelligence to simplify the trading process. This technology makes automation easier. Sophisticated mathematical algorithms and technical tools are also available that make trading seamless.\n\nSafety And Security\n\nThe Ethereum ProAir Ai platform respects the privacy of users. This is ensured by following strict safety protocols and advanced encryption technologies like SSL encryption. Through these, the system protects user accounts, transactions, and confidential data.\n\n24/7 Customer Support\n\nAnother important feature of the Ethereum ProAir trading bot is the 24/7 customer support service offered by its dedicated team. The team ensures quick response to all types of user doubts and concerns such as account maintenance, trading, transactions, technical errors, etc.\n\nPractice Or Demo Mode\n\nThe practice or demo mode is the main feature of the Ethereum ProAir platform which makes it easy for use by novice traders. They can explore the platform and market trends and patterns, build strategies, and improve skills without risking real money. Virtual funds will be available on the system that can be used to carry out virtual trading. This feature will help traders decide if the system is suitable for them.\n\nCustomization Options\n\nThis is yet another feature that will be beneficial for beginners. Traders can adjust the assistance level of the platform according to their trading experience, skills, and goals. Novice traders can get higher levels of assistance while experts can adjust the settings as needed.\n\nHow To Register On Ethereum ProAir?\n\nOpening an account on the Ethereum ProAir platform is quite simple. The following are the simple steps that you have to go through to become a member of this trading community:\n\nStep 1- The Registration Process\n\nThe first step involved in account signup is the registration process which is easy and safe. The Ethereum ProAir platform requires details such as name, mobile number, email ID, and a strong password to complete the registration process. Once you provide this information, the creator will examine it and send an email with a confirmation link to activate your account. Open the email and click the verification link to activate your Ethereum ProAir trading account.\n\nStep 2- Depositing Funds\n\nThe next step that you have to follow after the registration process is depositing funds. The minimum deposit required to begin real-time trading on this software is €250. Traders and investors can deposit larger amounts after considering factors such as financial goals, trading skills, the value of assets, trade opportunities, and so on. Funds can be deposited on the Ethereum ProAir account through any payment services available on the platform. No charges apply for depositing or withdrawing funds from your account.\n\nStep 3- Start Live Trading\n\nAfter account activation and fund deposition, you can begin live trading on the Ethereum ProAir account. The initial step is to set the trade parameters and adjust other settings like technical indicators to align with your trading preferences. Once these aspects are done, the Ethereum ProAir platform will begin analyzing the market, generating signals, and executing trades. The system will explore various asset classes including cryptocurrencies and take advantage of the most profitable opportunities.\n\nRegister On Ethereum ProAir For Free!\n\nHow Does Ethereum ProAir Work?\n\nYou can begin live trading once your Ethereum ProAir account is ready for use with the required initial capital. For this, first set the assistance levels as needed. You can adjust the trade parameters, indicators, and other settings as suitable for your trading skills, experience, and goals.\n\nWith this, the Ethereum ProAir platform will begin live trading which involves various steps. The system will use advanced algorithms to analyze the market in detail including real-time market trends and patterns, movements or fluctuations in assets, the historical and current value of assets, and more. When profitable opportunities come up, the Ethereum ProAir platform will alert you on time.\n\nOnce the trading bot offers profitable trade signals, traders and investors can use them to execute orders of various asset classes. The tools and resources available on the Ethereum ProAir platform can be used to track progress, evaluate potential risks, and get a wider view of your complete trading activities.\n\nIs Ethereum ProAir A Legit Platform?\n\nThe Ethereum ProAir platform ensures its genuineness by partnering with trusted brokerage services that will guide traders throughout their trading journey. The system follows strict safety protocols and uses the latest technology to code user information and protect them from prying eyes. 24/7 customer support is available to all traders. The platform offers different payment methods and traders have complete control over deposits and withdrawals. So far, the customer responses are positive, and Ethereum ProAir is found to have a high success rate. These factors suggest that Ethereum ProAir is legit. But, beware of platforms coming with similar names as they are just imitations of this trading system. To avoid such traps, make sure you register only through the official Ethereum ProAir website.\n\nEthereum ProAir Pros And Cons\n\nThe positives and negatives of the Ethereum ProAir trading software are given below for your reference:\n\nPros\n\nFree trading bot\n\nCompatible with all devices\n\nSimple and transparent account registration\n\nRequires just a minimum investment of €250\n\nSuitable for both novice and savvy traders\n\nIntegrated with advanced technologies, algorithms, and tools\n\nNo additional charges\n\nZero platform cost\n\nDifferent deposit options\n\nEnsures the safety and security of user information and funds\n\n24/7 customer support\n\nAccessible in different regions\n\nCons\n\nDue to restrictions imposed by local laws, Ethereum ProAir might not be available for trading in certain regions\n\nEthereum ProAir- Cost, Minimum Deposit, And Profit\n\nThe Ethereum ProAir trading platform is completely free. So, traders and investors can use this platform, take advantage of its features, and make profits. For trading different assets, the minimum deposit required is €250. If you want, you begin live trading by investing bigger amounts. But, to decide the amount, you have to consider factors such as trading experience, skills, goals, risk tolerance, and so on. Buyers and sellers can deposit the initial capital through any deposit options available on the platform such as debit/credit cards, e-wallets, etc. No charges apply for account registration or maintenance, transferring, depositing, or withdrawing funds, or other activities.\n\nTrade Now With Ethereum ProAir For Free\n\nEthereum ProAir- Cryptocurrencies\n\nThe Ethereum ProAir platform provides the opportunity to diversify your trading portfolio by offering a wide variety of assets such as cryptocurrencies, stocks, CFDs, forex, and so on. The most profitable among these and the asset that offers quick payouts is cryptocurrencies. The following are some crypto assets that you can buy and sell through the Ethereum ProAir trading software:\n\nCardano (ADA)\n\nBitcoin (BTC)\n\nDogecoin (DOGE)\n\nLitecoin (LTC)\n\nRipple (XRP)\n\nEthereum (ETH)\n\nBinance Coin (BNC)\n\nDash (DASH)\n\nMontero (XMR)\n\nEthereum Classic (ETC)\n\nPolkadot (DOT)\n\nEthereum ProAir- Countries Eligible\n\nThe Ethereum ProAir trading software is available in most countries in the world where local laws permit trading. Here are the regions where this trading system can be used to trade cryptocurrencies and other asset:\n\nCanada\n\nAustralia\n\nUnited Kingdom\n\nSouth Africa\n\nSlovenia\n\nSlovakia\n\nNorway\n\nSweden\n\nNetherlands\n\nFinland\n\nPoland\n\nSwitzerland\n\nMexico\n\nBrazil\n\nSpain\n\nGermany\n\nBelgium\n\nJapan\n\nVietnam\n\nMalaysia\n\nSingapore\n\nTaiwan\n\nThailand\n\nHong Kong\n\nFinal Verdict On Ethereum ProAir Review\n\nFrom the Ethereum ProAir Review, it's clear that the Ethereum ProAir trading app ranks among the most effective platforms in the market. Before assessing its authenticity, let's quickly review everything discussed so far.\n\nThe Ethereum ProAir trading platform has been created to provide complete assistance in trading cryptocurrencies and other assets such as stocks, forex, CFDs, and so on. The creator says that the system has been integrated with the latest technologies, algorithms, tools, and resources to provide a detailed overview of trading activities and help enter profitable trades.\n\nOnce traders set the parameters and other settings, the Ethereum ProAir will automatically and autonomously execute other tasks like market analysis, price movement monitoring, price data comparison, trade signal generation, risk evaluation, and timely alerts on profitable trade positions.\n\nThis automated trading software offers a demo mode that can be used by novice traders to do virtual trading without using real money. Customization of account assistance is also available that can be utilized to align parameters and other settings according to trading preferences.\n\nFrom our analysis, Ethereum ProAir seems to be an authentic trading platform that is safe and effective for traders from all backgrounds. The main thing that buyers and sellers have to do is start an account and deposit the initial capital.\n\nFor doing live trading, the Ethereum ProAir system requires just a minimum deposit of €250. Traders can increase the initial capital by considering factors like trading goals, skills, experience, risk tolerance, asset values, and so on. No extra fees are demanded from traders for account maintenance, transactions, and other activities. So, altogether, the Ethereum ProAir trading software seems legitimate and worth a shot to take crypto and other asset trading to the next level.\n\nTry Ethereum ProAir For Free!\n\nEthereum ProAir - FAQs\n\nIs Ethereum ProAir compatible with all devices?\n\nYes. The Ethereum ProAir platform has been designed in such a way that it is compatible with all devices.\n\nCan money be withdrawn at any time from the Ethereum ProAir account?\n\nBuyers and sellers have complete control over the funds on the Ethereum ProAir account. So, funds can be withdrawn at any time without hassles.\n\nIs Ethereum ProAir easy to use for beginners?\n\nEthereum ProAir should be easy to use even for beginners as it has a user-friendly interface with a simple dashboard, a demo feature, and customization options.\n\nDoes Ethereum ProAir ensure safe trading?\n\nThe Ethereum ProAir platform guarantees a safe trading environment by following strict safety protocols and using advanced encryption technology.\n\nWhat about the Ethereum ProAir account registration process?\n\nThe Ethereum ProAir account registration process is simple, safe, and transparent. Traders have to follow just 3 simple steps to become a part of this trading community.\n\nVisit Ethereum ProAir For Free!\n\n“Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.”"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbElVUWZndWVXXzc0bEUxbXpNTTNQU1o0QUdqSGsxOWhOZ0FKY0ZiUEZjd09ZRHY3cEhnYzctSWRudEpRVHBHVVJOajJSSExaTjdGYTU1ZGF4TnZHWnNyVlNMQkJudndsakJDenVBcGFWalltWnYxeVlVRHA3VU1aLWJCNmRhcjdid2p2ekVuV244ZUhvek9r0gGcAUFVX3lxTE4wRFV1VWp2cTBHaFBwUjJpUi02RWZwVmUzSGxJUm9acFdjeE4wNTd3YnZmeTdGSWVhY3pXU3k5blpyTGUwLVBVYWJsZlpIVE9EU0NUcjM4SHpsT0hVQXFDZjFOZlY5TWRpa0FLX3Z5OHhta3ZWM3FpelNDZzVBRU1GcFdKWHZfOEphamRRNklVRlJ1bm5TOXR5bWFwNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Altcoin Market Cap Break From “Wyckoff Accumulation Phase”: Will Ethereum, XRP Fly? - NewsBTC",
        "content": "In a post on X, one analyst observes that the altcoin market capitalization has broken from the Wyckoff accumulation phase. With this upswing, the trader expects altcoin prices to move higher.\n\nThis refreshing breakout coincides with Bitcoin’s (BTC) stellar performance when writing on February 28. At spot rates, the coin is trading above $60,000, a psychological round number- now supported- and is closely approaching $70,000.\n\nThe Altcoin Breakout From Accumulation\n\nThe “Wyckoff accumulation pattern” is a concept developed by technical analysts to pick out potential buying opportunities, in this case, altcoins. Whenever prices are in this phase, it is widely believed that the so-called “smart money” or large institutional players are accumulating at low prices.\n\nCurrently, prices consolidate at tight ranges and with low trading volumes. A signal marking the end of this accumulation is a sharp breakout, lifting prices above the defined range. Often, this upswing is with rising trading volume.\n\nRelated Reading\n\nEthereum Price Primed To Hit $3.5K After Bitcoin Rallies Past $60K 7 months ago\n\nLooking at the chart, the altcoin market cap has broken above the accumulation phase. With previous resistance and support, the altcoin market cap will likely continue floating higher. As such, top altcoins, including Ethereum (ETH), Solana (SOL), and XRP, will follow suit, posting fresh 2024 highs.\n\nWhy Spot Bitcoin ETFs Give BTC Edge In This Bull Run\n\nSo far, Bitcoin is leading the way, posting over $10,000 in less than a week. However, with the coin trading above $60,000, its demand-side drivers differ entirely from what’s influencing altcoins. The approval of spot Bitcoin exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC) has seen billions of dollars flow to the world’s first cryptocurrency.\n\nTherefore, while altcoins have historically outperformed BTC when crypto prices rally, there is an edge with spot Bitcoin ETFs. As such, this bull run will likely differ from 2017 and 2021. This forecast is because institutions will likely favor a regulated asset over altcoins whose status remains undefined.\n\nAs of late February 2024, the United States SEC has not approved spot ETFs of any altcoin, including that of Ethereum. Additionally, the agency has labeled several top altcoins, including Cardano (ADA), unregistered securities. The agency even filed lawsuits against major exchanges like Binance and Coinbase, accusing them of facilitating the trading of what the commission described as “unregistered securities.”\n\nRelated Reading\n\nCEO Of German VC Firm Predicts XRP To Become ‘World Reserve Bridge Currency’ 7 months ago\n\nIt is not immediately clear whether the United States SEC will change their preview of leading altcoins, especially Ethereum (ETH), which has a market of over $400 billion. Wall Street heavyweights like BlackRock and Fidelity remain interested in launching spot Ethereum ETFs.\n\nFeature image from DALLE, chart from TradingView"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOZXFoajliQl9IenlwYmZBcDlqTzVjZVFiMzI5NmxqcXlpRlBrWGVvWlpwc3lMTWV6c1dDTVA5UnBHYUNOdmxCb1l6ZDhmYUttczZycFJyQ1JWWDFhMlhmem54akd0cDhuUGNfcFBRR19uekNaN2ttLWZJYmo5X2lLanRtdFdMa0VJTWY2OVI0cGZSTFl5dWxLeVk2eHV3ZXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "The Rise of Bitgert Coin: Studying its Higher Returns Than Ethereum - Blockchain Reporter",
        "content": "Cryptocurrency, once viewed as just another fad not meant for the long term, has now become more of a norm than an exception worldwide. Bitcoin, the first cryptocurrency, is now a hit, touching $62k this week and is expected to touch that number by this year end itself.\n\nEthereum has been one of the most popular cryptocurrencies after Bitcoin in the past. This article will discuss how Ethereum’s price has performed over the last few days.\n\nEthereum Price Analysis\n\nThis was first explained in 2013 in a research paper by Vitalik Buterin. Ethereum was launched with an Initial coin offering (ICO) price of $0.311. It has shot up to nearly $3500! This became famous due to its proof of stake working mechanism which was found to be much faster than the proof of work mechanism used by first ever digital currency known as bitcoin.\n\nEthereum is a programmable network meaning it can be used to create smart contracts which can self-execute thereby useful for creating decentralized applications like games and financial apps among others.\n\nHow Bitgert Coin price will Confidently Outperform Ethereum’s price\n\nFirstly, it was built on BNB chain and since 2022 it is on BRC 20 blockchain using BNB as its native token. Bitgert enables its users to stake and earn rewards on BSC network hence having gas fee priced at $0.0000000000001 per transaction.\n\nBitgert also offers many benefits as compared to other coins like ETH for investors who use them to trade. One such characteristic which makes it unique or rather distinctive is that it is peer-to-peer network where there is no need for intermediaries during transactions.\n\nToday’s investors are preferring Bitgert instead of Ethereum due to its stealthy rise in price. Proof-of-stake authority consensus mechanism also applies to it; it is a famous coin in cryptocurrency market these days.\n\nConclusion\n\nOnce upon a time, Ethereum was considered as a coin of evolution when it was introduced into the crypto industry but now because of various factors, unluckily it’s not as popular as before.\n\nAlthough Bitgert may be newer than Ethereum, the near zero gas fees and cross-chain transfer of cryptocurrencies at a higher rate has made its popularity grow. No wonder why it will outperform Ethereum soon, with its price rising steadily and the investors’ return on investment being the maximum for it.\n\nFor the highest return on your investment, you should definitely invest in Bitgert which most other investors do now.\n\nTo learn more about Bitgert coin, visit – https://bitgert.com"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPaDJDRDdRSlo0SmJXX1o1R1dGSnBPYkprZDU5X0lINEVzVG1NdnVFR0dzSmtua0VEVTNSWUV2NFhRbzVCcHBuU1h6UmU0dWVnVmIzSFVBNHIxMG1QRWw3TkQ4M1VTaVhlTlV3eUh3Y2c4THlyQTBsM2pSRXBERTNpd3dFWUpIR1VmWGc3djk0eGhYYlJyM1JFQkstU01Fak9BQmFMSHdQREpMeDhMZHBRaC1WZTR1N053a0s4YTZiMTFHXzRnRV9nWVJRd0RISUQ0MWRjckVOX20?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 06:12:48 GMT",
        "title": "Is DeeStream (DST) sensation the next Twitch & why does Ethereum (ETH) holders think $4,000 possible in March - NewsBTC",
        "content": "The crypto space has had an incredible year so far, and the first quarter isn’t even over yet. The Bitcoin ETF, BTC reaching $52k, Ripple v. The SEC and other interesting news have already featured this year. Even more amazing events are expected like the Bitcoin (BTC) halving.\n\nEthereum (ETH) has also performed well this year. It has surpassed multiple estimates and recently crossed $3000. Investors are looking forward to a $4000 valuation by March but how likely is this?\n\nAnd what other projects can investors look forward to? We think the answer is DeeStream (DST). Here’s why.\n\nCan Ethereum (ETH) reach $4,000?\n\nThe value of Ethereum (ETH) at the start of this year was just above $2000. The token has grown massively since then, especially in February. Ethereum (ETH) has added around nearly (50)% in the last month.\n\nEthereum (ETH) is above $3,000 now and many investors expect it to reach $4,000. This may be likely if it continues to grow at this rate. However, Ethereum (ETH) may not reach this price until April. In any case, Ethereum (ETH) seems like a good option to invest in for decent returns right now.\n\nStreaming sensation DeeStream (DST) amazes many\n\nNew crypto projects spark a lot of excitement in the crypto space. Some of them involve new applications of blockchain technology which always stir up the industry. For investors, new projects mean new, typically cheaper, opportunities to invest in cryptos. DeeStream (DST) is a new project that has an exciting application of blockchain technology and opportunities for returns.\n\nOn DeeStream (DST) users can sign up and stream or view live-streamed content from across the world. Streamers can earn money from gifted subs, Dee gifts and packages. Users can also earn crypto on DeeStream (DST) by completing tasks on the platform, unlike other platforms where users cannot make money from watching streams.\n\nDeeStream (DST) also offers lower transaction fees for users. Deposits and withdrawals are also processed faster on DeeStream (DST). This means streamers will get their funds as soon as they request for them.\n\nStreamers will also get more revenue from their streams thanks to its revenue-sharing plan. It aims to be a better streaming platform for viewers and streamers. DeeStream (DST) has much value as a token. Investors can buy the token for just $0.04 in its presale. This lower price makes it more affordable than tokens like Ethereum (ETH).\n\nIts tokenomics are also decent. It has a total supply of up to 300 million units. The project also has team tokens restricted for 1,000 days so dumping is unlikely. Liquidity is also locked for life.\n\nFor its significant potential, investors back DeeStream (DST). Experts believe it could have a 20x return by the end of this year. The profits from this look amazing and smart investors won’t miss out.\n\nFind out more about the DeeStream (DST) presale by visiting the website here.\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    }
]