[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9sdUsyVHJKck81X2l3UjBHeTJ6TnZmTmlUcUZYZGhJc29oakp2VFZISEV5TzlOcFJjZnFBWWN5M3lOdk5ENG5KdWpDQWtXOE5GOXdpVDNmc1dKempJVnJLYndacm9wcVdIQVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-3074 Proposal on Ethereum? - Unchained",
        "content": "EIP-3074 is an Ethereum Improvement Proposal (EIP) that aims to improve account management for Ethereum users.\n\nEIP-3074 has been approved for inclusion in the Prague/Electra Ethereum hard fork, scheduled for Q4 2024. The proposal aims to streamline transaction processes and decrease expenses by introducing third-party transaction sponsorship. EIP-3074 represents an advancement in Ethereum’s account model, paving the way for future developments.\n\nSo, what exactly is EIP-3074, what implications does it hold for Ethereum, and how is it different from EIP-4337?\n\nWhat Is EIP-3074?\n\nEIP-3074 is an Ethereum Improvement Proposal (EIP) that revolutionizes account management within the Ethereum network. It allows externally owned accounts (EOAs) to delegate control to smart contracts, enabling more advanced transaction strategies.\n\nEIP-3074 was introduced in 2020 by Ethereum core developers and researchers Sam Wilson, Ansgar Dietrichs, light clients, and Micah Zoltu.\n\nIt introduces two new operations, “AUTH” and “AUTHCALL,” to empower EOAs to transition seamlessly into smart contracts without requiring the deployment of new contracts.\n\nThe primary goal of implementing EIP-3074 is to enhance the wallet user experience by enabling gas sponsorship, facilitating batch transactions, and enabling wallet asset recovery processes.\n\nSee the illustration below to understand the flow of transactions.\n\nHow Does EIP-3074 Aim to Improve Ethereum?\n\nEIP-3074 proposes delegating control of EOAs to smart contracts which offers developers a flexible framework for innovative EOA transaction strategies. This transformation is facilitated by two instructions: “AUTH” and “AUTHCALL.”\n\nThe AUTH establishes the “authorized” context variable based on ECDSA signatures. On the other hand, AUTHCALL initiates authorized account transfers, allowing for additional logic to be implemented around “AUTHCALL” without compromising security or user experience.\n\nThe AUTHCALL opcode functions similarly to the existing CALL opcode within Ethereum. It establishes the authorized address as the message sender in the subsequent call, effectively permitting the invoker contract to act on behalf of an EOA when interacting with other contracts.\n\nIn practice, the process involves the EOA address user signing the transaction off-chain, then either the EOA user or a gas sponsor sending the transaction to the invoker contract, which verifies and calls each target contract using “AUTH” and “AUTHCALL.”\n\nThat way, EIP-3074 enables any EOA to function as a smart contract wallet without contract deployment, facilitating more complex transaction schemes. This introduces various exciting use cases to Ethereum, such as gas sponsorship, batch transactions, and wallet asset recovery.\n\nGas sponsorship allows dapps, projects, and third parties to cover gas costs for users, removing the need for users to hold ETH themselves, which is particularly user-friendly for new Web3 users.\n\nIn addition, EIP-3074 supports executing multiple operations in a single transaction, streamlining non-ETH token trading by eliminating the token approval process. Hence, this enhances transaction efficiency and reduces costs.\n\nFor wallet asset recovery, EIP-3074 allows users to recover assets via a special invoker contract when they lose their private keys through a social recovery mechanism.\n\nEIP-3074 vs. EIP-4337: What’s the Difference?\n\nEIP-3074 and EIP-4337 tackle unique aspects of account abstraction on Ethereum. They are similar in that they both address execution abstraction, enabling functionalities such as batching multiple calls to multiple destinations, ensuring atomicity, and enhancing dapp-specific user experiences.\n\nHowever, they are quite different in how they work.\n\nEIP-3074, primarily focused on enhancing the capabilities of EOAs, introduces a novel approach by supercharging EOAs with arbitrary execution logic through invokers. It extends the functionalities of EOAs without necessitating asset migration to new accounts.\n\nHowever, EIP-3074 only addresses execution abstraction and doesn’t deal with decentralized access. It prioritizes simplicity and aims to streamline transaction processes for existing EOAs.\n\nEIP-4337 takes a broader approach, aiming to abstract the entire account, involving all five functionalities. It looks to preserve Ethereum’s core properties of decentralization and censorship resistance while mitigating potential vulnerabilities, such as DoS and griefing attack vectors.\n\nUnlike EIP-3074, EIP-4337 necessitates migration to a smart account as it cannot extend the capabilities of EOAs. It aspires to achieve full account abstraction without compromising the fundamental tenets of the Ethereum network.\n\nReasons For and Against EIP-3074\n\nLet’s take a look at the benefits that will come with the new EIP-3074 token standard proposals.\n\nReasons For EIP-3074\n\nNew Opcodes: EIP-3074 introduces new Ethereum opcodes, enabling EOA users to authorize smart contracts to execute actions on their behalf within a single transaction. This improves security and control, as users don’t need to permanently transfer their private keys.\n\nUser-Friendly Utilities: The new opcodes enable various user-friendly utilities, including transaction batching, sponsored transactions, conditional transactions, meta-transactions, and delegated security. These utilities streamline transaction processes, improve efficiency, and expand possibilities for decentralized applications (dapps) and users.\n\nEasier Migration: EIP-3074 allows easier migration to smart accounts by empowering EOAs. Previously, the effort and gas cost of migrating existing assets posed a challenge for users switching to smart accounts. With EIP-3074, migration is smoother and in a single batched and gas-sponsored transaction.\n\nUnified User Experience (UX) and Developer Experience (DevEx): dApps can enhance user experiences without excluding EOAs, thereby increasing incentives to leverage sponsored transactions and transaction batching. This introduces standardization around these features and allows for the integration of smart account functionalities into development frameworks.\n\nHybrid Accounts: EOAs can designate smart accounts as invokers, enabling hybrid custody use cases and facilitating testing of smart accounts before asset migration. This flexibility gives users more control over their assets and opens up new possibilities for custody solutions.\n\nReasons Against EIP-3074\n\nWhile EIP-3074 provides many advantages, it also has some potential downsides.\n\nSecurity Concerns: The security of invokers is a significant concern associated with EIP-3074. Poorly implemented invokers could pose a threat to user funds. To address this risk, rigorous audits of invokers and safeguards in EOA wallets need to be implemented.\n\nRequirement for Hard Fork: The adoption of EIP-3074 necessitates a hard fork due to new opcodes. This requires agreement and integration, which can be a lengthy process and has brought some resistance to the EIP-3074 proposal.\n\nThe Bottom Line\n\nThe decision to implement EIP-3074 came from the community’s recognition that the journey of achieving full account abstraction (AA) through proposals like EIP-4337 and RIP-7560 may require more time than initially anticipated.\n\nAt this time, focusing on enhancing EOAs offers immediate benefits. By fixing EOAs, EIP-3074 enables greater on-chain flexibility and execution abstraction within the existing Ethereum ecosystem.\n\nThe seamless integration of EIP-3074 into the Ethereum ecosystem and its reception by wallets and decentralized applications (dApps) will be crucial to its success. Moreover, ongoing efforts to address security concerns and ensure safe, user-friendly operations will be important for the widespread adoption and sustained effectiveness of EIP-3074."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOOFJ0OWIxUFhqN3h6VjBFajc0bG1DUWdIMld6WXA0UmFsREk3Qmh1RHdJUGVYOXhfQkpTaFZpdGFWYlhwOHhvTEJ2ejZMWFJOY2FKbHdMQlplT3Zkb0tkVzZTNlczVDdZckF6SHRTREFTSG9GenFSOUVBWmptcnJEdnZUX3E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum devs propose new transaction type with EIP-7702 - Crypto Briefing",
        "content": "The proposal outlines a new transaction type that temporarily upgrades externally owned accounts.\n\nShare this article\n\nA group of prominent Ethereum developers, including Vitalik Buterin, has proposed a new transaction type (EIP-7702) to enhance the functionality and security of Externally Owned Accounts (EOAs). The proposal aims to address common issues such as transaction batching, sponsorship, and privilege de-escalation.\n\nAccording to the EIP-7702 draft, the new transaction type “adds a contract_code field and a signature, and converts the signing account (not necessarily the same as the tx.origin) into a smart contract wallet for the duration of that transaction.” The proposal is intended to offer similar functionality to EIP-3074.\n\nThe motivation behind EIP-7702 is to provide short-term functionality improvements to EOAs, increasing the usability of applications and, in some cases, allowing for improved security. The proposal outlines three particular applications: batching, sponsorship, and privilege de-escalation.\n\nWhile EIP-3074 solves these use cases, the authors of EIP-7702 believe it has forward-compatibility concerns. They state that EIP-3074 “introduces two opcodes, AUTH and AUTHCALL, that would have no use in an ‘endgame account abstraction’ world where eventually all users are using smart contract wallets.”\n\nAdditionally, they argue that EIP-3074 “leads to the development of an ‘invoker contract’ ecosystem that would be separate from the ‘smart contract wallet’ ecosystem, leading to possible fragmentation of effort.”\n\nThe specification of EIP-7702 details the transaction payload format and the process of executing the transaction, which involves setting the contract code of the signing account temporarily and reverting it back to empty at the end of the transaction.\n\nThe authors provide a rationale for how EIP-7702 can convert EIP-3074 use cases, stating that “it requires fairly little work to convert an existing EIP-3074 workflow.”\n\nThey also argue that EIP-7702 is designed to be forward-compatible with future account abstraction, avoiding the creation of separate code ecosystems and the need for new opcodes that may become obsolete.\n\nDespite the potential benefits, the authors acknowledge that EIP-7702 breaks the invariant that an account balance can only decrease as a result of transactions originating from that account, which may have consequences for mempool design and other EIPs.\n\nAs with any proposal requiring users to sign contract code, the authors emphasize the importance of user wallets being cautious about which contract_code they sign, highlighting the shared security considerations with EIP-3074."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTElXX3kxeDRUUFdiQ29FdV9obmZOblZlYjdNTzlaeko0Zy15UXdMeVhTRHhpSmRXWTJSSWdmckFPMFo3QmRWZG5RcmlXbVQwZE0xVU93dnNxdXdzZFd6VTBVc2hPWEdkamxrU3k5VkFvU1NuU0pHMjZYdlkzRFlZQy1QMV9OUnZEeGZuclVfRE10NDJBVDFydnFpRzFxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Grayscale will focus energies on spot Ethereum products, CEO says - DLNews",
        "content": "Grayscale Investments has withdrawn its application to provide an Ethereum futures ETF.\n\nMichael Sonneshein, Grayscale’s CEO, said he is optimistic that the SEC will approve the firm’s application to convert its Ethereum trust to a spot ETF\n\nGrayscale Investments will focus on converting its Ethereum trust — the world’s largest — to spot exchange-traded products, CEO Michael Sonnenshein said on Wednesday.\n\n“At Grayscale we decided to focus our energy on our spot products. That’s really core to our DNA,” he said during an event in London that was hosted by the Financial Times.\n\nOn Tuesday, media reported that the crypto-native asset manager had withdrawn its application to the Securities and Exchange Commission to provide an Ether futures ETF.\n\nIt had filed the application in October.\n\nSonnenshein said the asset manager was withdrawing the application because a number of futures products are already available for investors.\n\nAs DL News has reported, VanEck’s EFUT and ProShares’ EETH dominate the brutally competitive Ethereum ETF field, accounting for over 90% of total trading volume at launch.\n\n“Sometimes we will file for a product. That doesn’t necessarily mean it’s going to come to market,” Sonnenshein said\n\nAll eyes on Ether ETFs\n\nGrayscale paved the way for the approval of Bitcoin spot ETFs by winning a legal case against the SEC that allowed it to convert its Bitcoin Trust to an ETF.\n\nJoin the community to get our latest stories and updates\n\nThe SEC granted Grayscale’s application — plus 10 others from various asset managers, including BlackRock and Fidelity Investments — in January\n\nSince the wild success of these funds, which have seen almost $12 billion in net inflows, attention has turned to the approval of spot Ethereum products.\n\nGrayscale, along with BlackRock, VanEck, ARK Invest, Fidelity, Invesco, and Hashdex, has applied to convert its Ethereum trust to a spot ETF.\n\nThe industry will know what the SEC is thinking when the regulator makes a decision on the first application, VanEck’s, on May 23.\n\nMini Trust\n\nGrayscale has also filed to provide a mini trust — a smaller fund seeded with assets from the larger trust.\n\nCraig Salm, chief legal officer at Grayscale, has said the Grayscale Ethereum Mini Trust aims to complement the rest of the firm’s Ethereum-based line of products to support a range of investors.\n\nThe mini trust “would launch as a lower-fee alternative spot Ethereum ETF and is designed for investors interested in optimising their Ethereum ETF investment for a ‘buy-and-hold’ strategy in their brokerage or retirement account, for example,” Salm said.\n\nAnalysts aren’t bullish on the chances of the SEC approving any of the applications for spot Ether products.\n\nFor one, Ethereum’s regulatory status isn’t clearly defined. SEC chair Gary Gensler has been evasive about whether Ethereum is a security.\n\nPlus, Gensler suffered political blowback from anti-crypto politicians in the Biden administration after the SEC approved spot Bitcoin ETFs — though, arguably, the agency had no choice after it lost in court to Grayscale.\n\nOn Wednesday, Sonnenshein said while it was difficult to know what the SEC is thinking on Ethereum, Grayscale is “optimistic that the SEC will do the right thing by investors.”\n\nHe added that “Grayscale Ethereum Trust is already an SEC reporting company. We file 10-Ks and 10-Qs [disclosures to the SEC], and we’ve always been a business that pushes our regulators to allow crypto to be brought further and further into the regulatory perimeter.”\n\nReach out to the author at joanna@dlnews.com."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9EMk9SbkZnVUdhVEZaOC1scnVqVThwNFRjYXJfU0hiOGlLY0xlSTdCZkYwWEZrX0RicEJMNlF5VGVLUmpBZGUxSGtTSXQxUmR1UmhYTDRlWXdjbGNBWGtycU94MDlrUm4t?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "MEV collected by validators is now higher on Solana than on Ethereum - Blockworks",
        "content": "Solana’s validators are a bit like baristas flipping around an iPad — they’re nicer to you when you include a tip. And as traders keep cramming into Solana’s metaphorical coffee shop, the validator tip jar looks increasingly stuffed with money.\n\nValidators are a group of 1,728 computers that run software to produce blocks on the Solana blockchain. Coinbase Cloud is a prominent Solana validator, as is Google Cloud. One revenue stream that validators earn is called maximal extractible value (MEV), which refers partly to tips paid by searchers to be included in Solana blocks.\n\nThis MEV revenue has been growing quickly since mid-March. Notably, Solana validators are earning more from MEV overall than Ethereum validators, according to Blockworks Research. Just a few months ago, Solana’s MEV revenue was a rounding error compared to Ethereum’s.\n\nRead more: MEV doesn’t have to be a zero-sum game, research suggests\n\nBroadly defined, MEV refers to the largest amount of value that validators can create by packing transactions into blockchain blocks. Blockworks Research’s dashboard suggests Solana validators raked in a hair under $7 million from MEV last week.\n\nAt the moment, Solana MEV is almost entirely the product of a protocol named Jito. Jito offers a fork of the Solana validator called Jito-Solana, and 78% of Solana’s validators use this client, according to Jito’s website. The client lets searchers, or traders, arrange transactions in bundles. Searchers can include a tip to try getting validators to send their particular bundle to the blockchain.\n\nWhether all this is good for Solana is something of a matter of perspective. Some forms of MEV can be predatory. Jito recently suspended its mempool, a kind of waiting area for transactions, due to “sandwich attacks” that let opportunists create MEV by trading right before and after a transaction to manipulate the price and take profit from the trader.\n\nRead more: Jito Labs ends mempool functionality citing impact on Solana users\n\nIn Jito’s telling, the protocol is making Solana more efficient while also minimizing negative forms of MEV like sandwich attacking. If it can pull that off, Solana could see a lot of benefit.\n\nContinued long-term growth in Solana’s MEV would likely imply that less spam is being included in blocks, and Solana would have more available blockspace, Blockworks Research analyst Hayden Tsutsui said. In a best case scenario, more blockspace could free up room for more on-chain activity, which could also bring along more liquidity, Tsutsui said.\n\nBut it bears mentioning that as things currently stand, Solana is still staggering under a mountain of spam. More than 60% of non-vote transactions fail on Solana, according to Blockworks Research, largely due to bots taking advantage of Solana’s cheap fees by inundating the network in hopes of getting transactions to land.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPZ01XM1dtUHRITm4tRzFhdnN6ZjFNSE9xNzFLLWxiQkx4SkE4WF9CMXBZbEZrVkFYX0FlcDd0NHJ3Z3Z5d2t3YnlOOUZ4cWw3bHVQc0xjQ0ZNMWxnYXdVU0JvenBmelBTUjZzS0ViM1kteElmelBnbG9BY0RCbDlDakV4SG9ldEt0d3NWS0NxeEhWdXpzWXcwQW5wbmdpbV9yOUl1ZE9TVWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Can ETH Reach $4,000 in May 2024? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9qSWxZUG51VnhmbUxYal9VNEVMZTFoS3pOU2hQWjBlM0ZpVVJ4ektUTjNZc1M4TGFXSG5vM2dBYW5kbm9mR01iSWR2elpDSFpidW5ZZmp0cWU1QjJzRFhlamZTXzFJc1lRRkptMGJWZFliMXBFRHN5ekZQMS1OLU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana Gains 5%, While Bitcoin and Ethereum Experience Minor Dips - Yahoo Finance",
        "content": "Solana Gains 5%, While Bitcoin and Ethereum Experience Minor Dips\n\nWhile most of the top cryptocurrencies are trading sideways or slightly down, Solana (SOL) stands out with a nearly 2.28% increase over the past day. According to CoinMarketCap data, Solana is currently trading at $155.03, marking a week-long gain of over 20.36%. Despite a turbulent month that saw its value swing from a high of $184 to a low of nearly $120, Solana has been steadily climbing in the past week, outpacing the gains of Bitcoin and Ethereum.\n\nIn contrast, Bitcoin remained flat over the past 24 hours, trading at $63,618, while Ethereum has dipped slightly by 0.84% to $3,075. Over the past week, Bitcoin has seen a modest increase of 4.05%, while Ethereum is up 2.20%.\n\nAmong the top 100 coins by market capitalization, a couple of notable gainers are in the Solana ecosystem. Jupiter's token, JUP, which serves as a decentralized exchange aggregator, has risen 25% over the past week to reach a price of $1.14. Additionally, leading Solana-based memecoin Dogwifhat (WIF) has experienced an over 35% increase over the past 7 days, reaching $3.28.\n\nSolana's recent resurgence coincides with a surge in new tokens deployed on the network using the SPL standard. On Saturday alone, a record-breaking 14,648 new tokens were deployed on Solana, as reported by Solscan. This trend has continued for the past two weeks, with at least 10,000 new tokens being introduced on the network each day."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBiUnBiLUxRVjVQQWJnRXhWNkJmMnYyYlRTSkgwWkpVRkdoWVNELXItb0RjdnFQc3p2N3VyQVdOOFB3WFhkVV9CemRjUW1hTFVPWWZ0WVZDcGpTZno1QVd6OEx5QWFPQy1iOTdHSDF0dGUybGo0bmUwStIBgAFBVV95cUxQVENuYVk1V3JnSWo0YzVUbkY3M0taZHVBVEZrOGdEQ0thVkl4d2tWdzlmMHRFWnk4SlBlampvN2JxSmhjYmtwTkZsdUx3UjZrZUNRa2pla2RMQm9QYTJ5NWhLcWxaYmhmNC1Pc1FGU24xQmd2OEJWUGlkRkttbkNNRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Is No Longer ‘Ultrasound Money’ After Dencun Upgrade: Analysts - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s latest upgrade may have worked a bit too well, bringing unwelcome consequences for long-term Ethereum (ETH) investors.\n\nAs advertised, the Dencun hard fork slashed transaction fees by over 90% on multiple Ethereum layer-2 networks shortly after going live on March 13. the median Ethereum transaction fee today is up to four times lower than before Dencun when comparing periods of similar network activity, according to market intelligence platform CryptoQuant.\n\nWith users paying less in fees, however, the Ethereum network is now burning the circulating ETH supply at its slowest rate since the Merge in September 2022. In fact, the burn rate is now so low that ETH has returned to being an inflationary currency, regularly issuing more units than are burned in a given period.\n\n“We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, and the narrative of ‘ultrasound’ money has probably died or would need much higher network activity to come back to life,” CryptoQuant analysts in a weekly research report on Wednesday.\n\nAD\n\nAD\n\n“Ultrasound money” became a popular nickname for Ethereum after the Merge, which changed the consensus mechanism for the second largest cryptocurrency by market cap from proof of work to proof of stake. The upgrade also cut the issuance rate of new ETH by 90%, bringing it below the amount that the network burned through fees.\n\nEthereum faithful eagerly used that fact to needle Bitcoiners, who have proudly championed Bitcoin (BTC) as “sound money” thanks to its fixed supply of 21 million coins. Theoretically, Ether was now superior “ultrasound money” with an actively decreasing supply, making it a better long-term store of value.\n\nBut with ETH’s inflation rate back above zero, that argument is gone—and a revival in network activity may still fail to bring it back. As CryptoQuant noted, fees burned on Ethereum were positively correlated with network activity up until Dencun, after which they fell like a rock.\n\nCould someone tell me how is ETH not crashing? The total fees are bottoming. The burn is bottoming. Inflation is actually hitting same levels as Bitcoin once in a while. CEO and General Council for Consensus: \"We have started our lawsuit because we did not believe SEC will… pic.twitter.com/y5DqKYLLKt — zatoichi42🌊 (@zatoichi42) May 7, 2024\n\nAD\n\nAD\n\nAccording to the open-source dashboard ultrasound.money, Ether’s current inflation rate is 0.559% per year—still higher than Bitcoin’s 0.835% rate following last month’s halving.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE52YUFXZHVXS1BHTlpRbVNja2dkSW1fNGlpbWdCYjAzSFVoNWx5TGdRZ2pZcERza2NjZ2d4M3pDeG9HMFJ1RlhEbENDajN6VmpuRFY5UkxUam9HZ0xjREdxNE9jRVY2ZWQ1YWF6Z9IBckFVX3lxTE1lZGNVV09BZlg0QmtiTHAwZDlLdnBRZ0Jqc2hvWjcwRnZENDdRMGZMZ2JUYmc3QjUyS25aMzY3NFdqNVNJOEZEUzVVc2dyQnJuTDRydjJlcHNEa1M0OXVOU29TbGszOGpFYmZuUGxkMHEzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Another Ethereum ETF Decision Delayed by SEC - U.Today",
        "content": "The U.S. Securities and Exchange Commission has moved to delay its decision on the Invesco Galaxy spot Ethereum ETF proposal, according to a recent filing.\n\nAdvertisement\n\nThe regulator has extended the period for approving or disapproving the ETF proposal in question for an additional 60 days.\n\nLast month, the SEC also punted its decision on spot Ethereum ETF proposals by Franklin Templeton and Grayscale.\n\nAccording to a recent report by Reuters, which cites industry insiders, the SEC is predicted to deny Ethereum ETFs proposed by VanEck and ARK later this month.\n\nAdvertisement\n\nIndustry experts have predicted that the SEC was going to deny these ETFs due to the lack of engagement, which was not the case on the cusp of Bitcoin ETF approval.\n\nSpot Ethereum ETFs are likely to be rejected for a mechanical reason, according to industry analysts. Bitwise's Matt Hougan predicted that the SEC would say that it wanted to see more data.\n\nIt is worth noting that the SEC is currently in the middle of a legal battle with key Ethereum backer Consensys. In April, Consensys took the regulator to court over its decision to \"wrongly\" label the leading altcoin as a security.\n\nHowever, BlackRock CEO Larry Fink said that it was still possible to launch a spot Ethereum ETF even if the underlying cryptocurrency were to be classified as an unregistered security.\n\nIt took the SEC more than a decade to finally approve spot Bitcoin ETFs earlier this year. The ETFs ended up being a big success, but it seems like the regulator is not ready to approve Ethereum ETFs."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcDl3VXRpanE4ZW1hVUwyMnRGMU5KVlI1OXJlcGJOWXV3d295TkFHUXR6UlNsZDh1M2hsYVhFRWZLcEtjRi1PYTBGNzVKclhOWWRVUHZIN2JMYmFQY3RXb3VFejF1WTVxSHVBWk9mbk9HQXkwNDVuenowUGJYZ1Z1SVNwRVNiVDhpVUtWaUJOUFdZRmZTQWdNVGdsdXktNTl0UGhKY1U1dDFqcmxzRFA4cjQ1dkw5Sk1zU2VXSy02ZDYxVnVB0gHKAUFVX3lxTE9jMjVfdER1aTZBZHQyRUFPNnZqbW9zNHQ4Yl9JakU3S3d6TnlmTXQ5OVJKa3dLVlpxelB0MkhOeHZaMHZCSXg3OFYxSzhFSGd4THRVRUVXc3F0NFVyMllwQW9tdEJFWW5kMTNIZ3p6MmVTY3pHUFd4c0JxTGQ4eFBTQ0JhZ1FnT3MxS0w3Z3Z0d0g5aU1wTXpjUXlnR2I5UW9pQVFWVmZKc045dWdEWVZrd0tRVmMzMklkTDB0TzhXbUloVER2ZUh2Tnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support as SEC delays ETF decision - FXStreet",
        "content": "SEC delays decision on Ethereum ETF S-1 drafts as analysts shifted their potential launch date again.\n\nEthereum whale risks liquidation if ETH declines to $2,984.\n\nEthereum breaches key support amid key insight from CME open interest.\n\nEthereum is down more than 5% on Thursday following the Securities & Exchange Commission's (SEC) failure to approve ETH ETF issuers' S-1 drafts. Meanwhile, the recent decline has strengthened the bearish outlook after ETH moved below a key support level, sparking $90 million in long liquidations.\n\nDaily digest market movers: SEC yet to approve ETH ETF\n\nDespite its light comments on issuers’ S-1 drafts, the SEC has yet to approve spot ETH ETFs following the US Independence Day holiday. As a result, Bloomberg analyst James Seyffart shifted his over/under date for a potential approval to next weekend.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May, but also need to sign off on their S-1s before the products go live.\n\nNate Geraci, President of ETF Store, noted that the SEC expects issuers to amend their S-1s by July 8, with another round of filings potentially due around July 12. This \"would theoretically mean launch week of July 15\" for spot ETH ETFs, wrote Geraci in an X post.\n\nMeanwhile, following the recent market decline, a whale who longed ETH via the Compound protocol is about to be liquidated, according to data from Lookonchain. The whale deposited 12,734 ETH worth $40 million to Compound and borrowed $31.4 million worth of dollar-denominated stablecoins with a health rate of 1.06. The whale risks liquidation if the price of ETH drops to $2,984.\n\nETH technical analysis: Ethereum bears lead market amid slight bullish sentiment from US investors\n\nEthereum is trading around $3,132 on Thursday, down more than 5% on the day. The decline wiped out more than $90.81 million worth of long positions from the market, bringing the total ETH liquidations to $102.48 million in the past 24 hours.\n\nETH has now breached the $3,203 key support level, strengthening its bearish outlook. With the move, ETH has fully balanced the market inefficiency from itsprice spike following news of the SEC's U-turn on spot ETH ETFs.\n\nETH/USDT 4-hour chart\n\nETH may test the $3,029 support level in the next few hours. A bounce from this level will cool the bearish momentum. However, a move below it may see ETH seeking support around the $2,852 price level.\n\nIn the past 24 hours, Ethereum's futures open interest (OI) across top exchanges declined by almost 5%. Open interest is the number of outstanding contracts in a derivatives market that are yet to be settled.\n\nWhile the move signified wider risk aversion from traders, Ethereum's CME OI was an outlier, rising almost 1% in the last 24 hours. This indicates that US investors may be slightly bullish despite declining prices due to expectations of spot ETH ETFs' launch.\n\nAnother key insight is that spot ETH ETFs may experience impressive flows using the rising ETH CME OI as a proxy to measure investors' sentiment. As a result, ETH may take bears by surprise and rally past its yearly high, invalidating the bearish thesis."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0zNXZBWXd1NS1DUFd3SFd5V3FJWnlqV1lEVU53TkN3Tzc4bU95WnNRLXptTW5EMEpUQXE3d0p4WFdyektHemI3QUI1UjRuN0tXLWVKUUVhVGVOZUREdktV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "51% Attack: Definition, Who Is At Risk, Example, and Cost - Investopedia",
        "content": "What Is a 51% Attack?\n\nA 51% attack is an attack on a cryptocurrency blockchain by an entity or group that controls more than 50% of the network. If a party were to gain this much control of a network, it would have the power to alter the blockchain.\n\nThe attackers would be able to prevent new transactions from gaining confirmations, allowing them to halt payments between some or all users. They would also be able to reverse non-confirmed transactions that were completed while they were in control. Reversing transactions could allow them to double-spend coins, one of the issues mechanisms like proof-of-work were created to prevent.\n\nKey Takeaways Blockchains are distributed ledgers that record every transaction made on a cryptocurrency's network.\n\nA 51% attack is an attack on a blockchain by an entity or group that controls more than 50% of the network.\n\nAttackers with majority network control can interrupt the recording of new blocks by preventing other miners from completing blocks.\n\nChanging historical blocks is impossible due to the chain of information stored in Bitcoin's blockchain.\n\nAlthough a successful attack on Bitcoin or Ethereum is unlikely, smaller networks are frequent targets for 51% attacks.\n\nUnderstanding a 51% Attack\n\nA blockchain is a distributed ledger—essentially a database—that records transactions and information about them. The blockchain's network reaches a majority consensus about transactions through a validation process. The blocks where the data is stored are sealed. The blocks are linked together via cryptographic techniques where previous block information is recorded in each block. This makes the blocks nearly impossible to alter once they are confirmed enough times.\n\nThe 51% attack is an attack on the blockchain, where a group controls more than 50% of the hashing power—the computing that solves the cryptographic puzzle—of the network. This group then introduces an altered blockchain to the network at a very specific point in the blockchain, which is theoretically accepted by the network because the attackers would own most of it.\n\nChanging historical blocks—transactions locked in before the start of the attack—would be extremely difficult even in the event of a 51% attack. The further back the transactions are, the more difficult it is to change them. It would be impossible to change transactions before a checkpoint, where transactions become permanent in Bitcoin's blockchain.\n\nAttacks Are Prohibitively Expensive\n\nA 51% attack is a very difficult and challenging task on a blockchain network with a large participation rate. In most cases, the group of attackers would need to be able to control the necessary 51% and have created an alternate blockchain that can be inserted at exactly the right moment. Then, they would need to out-hash the main network. The cost of doing this is one of the most significant factors that prevent a 51% attack.\n\nFor example, one of the most advanced application-specific integrated circuit (ASIC) miners is the WhatsMiner M63S. It costs more than $10,000 (new) and has a hash rate of 406 terahashes per second (TH/s). A single or smaller group of miners would not be able to alter and mine the Bitcoin blockchain with only a few of these machines. It would take thousands of these ASICs to get ahead of the Bitcoin network. Smaller networks could be out-hashed using these mining rigs, but the benefits of doing so wouldn't outweigh the costs of funding the attack and setting it up.\n\nHashing power rental services provide attackers with lower costs, as they only need to rent as much hashing power as they need for the duration of the attack.\n\nAfter Ethereum transitioned to proof-of-stake, a 51% attack on the Ethereum blockchain became even more expensive. To conduct this attack, a user or group would need to own 51% of the staked ETH on the network. It is possible for someone to own that much ETH, but it's unlikely.\n\nAccording to Beaconchain, more than 32.3 million ETH were staked on May 8, 2024. An entity would need to own and stake more than 16.5 million ETH (more than $49 billion as of May 8, 2024) to attempt an attack.\n\nOnce the attack started, the consensus mechanism would likely recognize it and immediately slash the staked ETH, costing the attacker an extraordinary amount of money. Additionally, the community can vote to restore the \"honest\" chain, so an attacker would lose all of their ETH just to see the damage repaired.\n\nAttack Timing\n\nIn addition to the costs, a group attempting to attack the network using a 51% attack must not only control 51% of the network but also introduce the altered blockchain at a very precise time. Even if they own 51% of the network hashing rate, they still might not be able to keep up with the block creation rate or get their chain inserted before valid new blocks are created by the 'honest' blockchain network.\n\nAgain, this is possible on smaller cryptocurrency networks because there is less participation and lower hash rates. Large networks make it nearly impossible to introduce an altered blockchain.\n\nDespite the name, it is not necessary to have 51% of a network's mining power to launch an attack. However, such an attack would have a much lower chance of success.\n\nOutcome of a Successful Attack\n\nIn the event of a successful attack, the attackers could block other users' transactions or reverse them and spend the same cryptocurrency again. This vulnerability, known as double-spending, is the digital equivalent of a perfect counterfeit. It is also the basic cryptographic hurdle blockchain consensus mechanisms were designed to overcome.\n\nSuccessful 51% attackers may also implement a Denial-of-Service (DoS) attack, where they block the addresses of other miners for the period they control the network. This keeps the \"honest\" miners from reacquiring control of the network before the dishonest chain becomes permanent.\n\n\n\nWho Is at Risk of 51% Attack?\n\nThe type of mining equipment is also a factor, as ASIC-secured mining networks are less vulnerable than those that can be mined with GPUs; they are much faster. Cloud services such as NiceHash—which considers itself a \"hash-power broker\"—theoretically make it possible to launch a 51% attack using only rented hash power, especially against smaller, GPU-only networks.\n\nBitcoin Gold has been a common target for attackers because it is a smaller cryptocurrency by hashrate. Since June 2019, the Michigan Institute for Technology's Digital Currency Initiative has detected, observed, or been notified of more than 40 51% attacks—also called chain reorganizations, or reorgs—on Bitcoin Gold, Litecoin, and other smaller cryptocurrencies.\n\nAre the Odds of a Bitcoin 51% Attack Growing?\n\nOn May 8, 2024, the Bitcoin network's total hashrate was 569.29 exahashes per second (EH/s). The top three mining pools by three-day hashrate were:\n\nFoundryUSA, at 175.76 EH/s; 30.9% of the total Bitcoin network hashrate\n\nAntPool, at 161.77 EH/s; 28.4% of the total Bitcoin network hashrate\n\nViaBTC, at 73.11 EH/s; 12.8% of the total network hashrate\n\nCombined, these three pools made up 72.1% of the network hashrate, a whopping 486.9 EH/s (486.9 million TH/s—the CPU in your computer might be able to hash at about 15 kilo hashes per second). If Foundry and ViaBTC were to collude, they could take over 51% of the hashrate (248 EH/s).\n\nFoundry and Antpool combined could control 69.3% of the network. Because these pools use platforms to connect pool members and manage workloads, if the managers decided to take control they could issue work orders to their pools to work on the altered chain. The pool's miners would have no idea which chain they were working on since their mining rigs automatically work on whatever task they are given.\n\nEven more concerning is that these three pools also monopolize the majority of the network hash rates for Bitcoin Cash, Litecoin, and Bitcoin SV.\n\nThese pools have been operating for several years without issue, but the fact remains that they already control most hashing power of the minable and profitable cryptocurrencies.\n\n\n\nWhat Does a 51% Attack Do? A 51% attack alters blocks that are being added to the blockchain, giving the attackers the ability to create or alter transactions for the period they are in control.\n\nHas a 51% Attack Ever Happened? Yes. Several blockchains have been attacked using this method, but they had small networks, were new, or had other vulnerabilities that made it possible.\n\nHow Much Would a 51% Attack on BTC Cost? If a large mining pool was directed by its managers to conduct an attack, it wouldn't cost the managers much at the time of the attack. However, it would likely lose its honest miners once they found out about it. For a single person or group to conduct a 51% attack, they would need more than 304 EH/s of computing power. This is an enormous cost considering the fastest miner hashes 406 TH/s and costs more than $10,000 per unit (about 84,000 units).\n\nThe Bottom Line\n\nA 51% attack is the unlikely event that a group will acquire more than 50% of the hashing power of a cryptocurrency network. These attacks happen on smaller crypto networks, but tend to fail on larger ones like Bitcoin because they are more secure.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA2UUV3UER6WC1tR0pqQXZqVml0RUxmTm1uZkJIbGlGdWo3N0NpcktpLWtRN0J3ZlhjWjRLOGZVQ1AwQ0c4UzhFYTVlZVozak5KTXN4U3dDOXF3VUFMcXREVDI0dVgwX1hFSkpicmVLVFAtQTJQeVBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Grayscale backs off from its Ethereum futures ETF application - Crypto Briefing",
        "content": "Grayscale abandons Ethereum futures ETF plan after multiple SEC delays, though analysts suggest that the asset manager may possibly file another application.\n\nShare this article\n\nGrayscale, a leading crypto asset manager, has withdrawn its rule change application to the Securities and Exchange Commission (SEC) for an Ethereum futures exchange-traded fund (ETF), citing multiple delays by the federal regulator since the initial filing in September 2023.\n\nThe notice of withdrawal, submitted on Tuesday, did not provide specific reasons for Grayscale’s decision to abandon its plan for the Grayscale Ethereum Futures Trust ETF. The SEC had invoked several delays in reviewing the proposal, most recently on March 22, after previously extending the review period on November 15 and December 18.\n\nBloomberg analyst James Seyffart described the move as “interesting,” suggesting that the filing was “essentially a trojan horse” designed to create similar circumstances to Grayscale’s successful lawsuit against the SEC over its Bitcoin trust (GBTC).\n\nUPDATE This is interesting. @Grayscale just withdrew their 19b-4 filing for an #Ethereum futures ETF. This was essentially a trojan horse filing in my view, in order to create the same circumstances that allowed Grayscale to win the $GBTC lawsuit (approve futures deny spot) pic.twitter.com/Kihj2dlQx1 — James Seyffart (@JSeyff) May 7, 2024\n\nIn August, a federal appeals court sided with Grayscale after the firm accused the agency of approving Bitcoin futures ETFs while denying Bitcoin spot ETFs.\n\nSeyffart speculateds that Grayscale wanted the SEC to “approve futures, deny spot” again, potentially setting up another legal showdown. However, he noted that the withdrawal could be a sign that Grayscale is not pursuing a lawsuit this time around.\n\nNotably, however, Seffart did not dismiss the possiblity of Grayscale re-filing an amended application, which would be less work for the SEC but would eliminate the opportunity for a lawsuit.\n\nThe move comes amid growing skepticism about the SEC’s willingness to authorize Ethereum spot ETFs, despite the agency’s approval of Bitcoin spot ETFs in January, which sparked a bull run for the top cryptocurrency.\n\nThe odds of approval for Ethereum spot ETFs have continued to decline, further diminished by recent revelations that the SEC allegedly classified Ethereum as a regulated security last year, contrary to public statements indicating that no decision had been made."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOdTV0ZzRMbVZvdnMtMnloR0ljcHFXMjdVQk10eVJrNGJVbEdFZjlIYjRlcWVubzBFWTZZYkg2a2UxRi1ra0NJUEl4RWNKLXdrNFlYNm1ndi1YT2lSam85NDNvZ0JHUFQ1LUJ2Z2FfUkNoanR2d1Z3eGgxREk3ZGZLNl9DUEpJZ3gyenhFdGhKOVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana Surges as Ethereum Struggles: Can Furrever Token Mirror SOL's Success With the Help of $10,000 Competition? - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 08, 2024 (GLOBE NEWSWIRE) -- During turbulent times in the cryptocurrency market, where uncertainty looms large and volatility reigns supreme, certain tokens defy the odds and chart their path to success. Solana stands tall, riding a wave of surging momentum, while Ethereum grapples with its challenges, struggling to maintain its position amidst the chaos. Yet, amidst this backdrop of fluctuating fortunes, a beacon of excitement and opportunity emerges: Furrever Token (FURR). As Solana's meteoric rise captures headlines and Ethereum's struggles dominate discussions, FURR enters the fray with a sense of ambition and optimism fueled by the promise of its unique charm and a compelling $10,000 competition.\n\nEthereum ETF Decision Delay Sparks Volatility: SEC's Latest Move Sends ETH on a Rollercoaster Ride\n\nThe US Securities and Exchange Commission (SEC) has once again postponed its decision on the proposed Invesco Galaxy Ethereum exchange-traded fund (ETF), extending the deadline to July 5, 2024. This announcement has triggered a downturn in Ethereum's (ETH) price, adding to the uncertainty surrounding the approval of Ethereum ETFs. With major financial institutions like Grayscale, Franklin Templeton, VanEck, and BlackRock also awaiting regulatory clarity, the market response has been marked by slight downward pressure on ETH, particularly among short-term traders.\n\nDespite briefly breaching the critical resistance level of $3,220, Ethereum has seen a decline of approximately 4% today. The volatility has led to significant liquidations among long traders, totaling $67.42 million, indicative of a cautious sentiment among investors amid regulatory uncertainties. As attention remains focused on further updates from regulatory authorities, Ethereum's trading volume has surged by over 66% in the past 24 hours, reaching $13.78 billion, highlighting the market's keen interest in developments impacting ETH's price.\n\n\n\n\n\nSolana Surges: Breaking Trends and Charting New Heights\n\nSolana (SOL) has experienced a notable uptick in its price, currently standing at around $158.12, marking a 1.5% increase from yesterday. This surge follows a significant breakthrough that has caught the attention of investors and analysts alike. Solana has signaled a potential reversal of its previous bearish trend by successfully breaching a key trendline resistance, instilling confidence in its upward trajectory.\n\nThe next obstacle in its path is the 26-day Exponential Moving Average (EMA), historically a formidable resistance level. Should Solana surpass this barrier, it could pave the way for further gains, potentially reaching the 50-day EMA at around $163.29. This technical achievement underscores Solana's resilience and heralds the possibility of a bullish phase, reinforcing its position as a compelling investment option in the crypto market.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR)'s Path to Success: Leveraging Community Engagement and a Lucrative Competition\n\nFurrever Token (FURR) is positioned on the brink of mirroring Solana's triumphs, propelled by its inventive strategy and recent strides in community engagement. With its mission grounded in fostering a warm and inclusive ecosystem, FURR has captivated investors and enthusiasts, boasting a vibrant community and rapid organic growth. Currently priced at $0.000648, FURR offers investors the potential for up to 15X returns, further enhancing its appeal in the market.\n\nThe recent unveiling of the Furrever Token $10,000 Frenzy Bonanza Competition is pivotal in FURR's journey toward success. This competition represents more than just a mere event; it embodies FURR's commitment to community involvement and excitement. Participants are invited to partake in simple tasks on the Gleam platform, accumulating points and increasing their chances of winning substantial rewards. With a $10,000 prize pool up for grabs, the competition ignites fervor within the FURR community and attracts new participants eager to be part of the excitement. However, time is of the essence, as there are only two days left to join, adding a sense of urgency and encouraging enthusiasts to act swiftly to seize this opportunity.\n\nMoreover, the competition's strategic significance extends beyond mere rewards. By incentivizing participation and rewarding community engagement, FURR aims to solidify its position as a leader in the market. The competition fosters long-term loyalty and enthusiasm among its supporters, laying the groundwork for sustained growth and success. As FURR harnesses the momentum generated by the competition, it sets its sights on a future defined by innovation, prosperity, and unwavering community support.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token $10,000 Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOQnFxSTByVEpCaXNHaWh4VTVJakdlMkpiREFIejNUWjZ4UV9Ud0xsRWl2TDhSMnlwblRnemg0THZpNVJfbXh4VzJWRUlUQzBGZ2c2TGlFQ0lMSjVjSDlUSWk2QmJzQVhSMXhIclJmRmdzaGZ3dWNYUFJpUGE1VDhOTDJ4Y1FlRi1BZFBGNGpYNDE1Uy1WR2hGRDUzY1FDMlFrTzczdFdRTzhEN0hCSzI0MF9aNUtOLTdjakxCeGQ5YmM4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Vitalik’s New EIP-7702 Draws Early Support; Could Be Included in Ethereum’s Next Hard Fork Upgrade - Unchained",
        "content": "EIP-7702, which is meant to enable externally owned accounts to temporarily become smart contract accounts, was largely the result of intense discussions among Ethereum builders over previous improvement proposals.\n\nEthereum Improvement Proposal (EIP)-7702 has seen increasing support among developers, builders, and researchers less than a day after Ethereum co-founder Vitalik Buterin and three additional authors proposed it, a potential sign the EIP will be included in the next hard fork upgrade.\n\nEIP-7702 enables “flash smart wallet accounts,” which are externally owned accounts (EOAs) that become smart wallets, temporarily for one transaction. EIP-7702, wrote Jarrod Watts, developer relations engineer at Polygon, on X is “one of the most impactful changes Ethereum is going to have… EVER.”\n\nEOAs are controlled by their corresponding private key held by people, while smart contract accounts are governed by coding logic.\n\nThe introduction of EIP-7702 comes as the Ethereum community has had ongoing conversations about the most optimal path to what’s called “account abstraction,” in which all externally owned accounts become smart account wallets.\n\nEIP-3074 and EIP-4337\n\nSpecifically, the Ethereum community has been going back and forth about EIP-3074 and EIP-4337, both of which are intended to improve Ethereum’s security and user experience.\n\nEIP-4337, which was deployed on mainnet Ethereum in March 2023, aims to achieve account abstraction “without changes to the consensus layer protocol of Ethereum,” by enabling smart contracts to act as accounts, according to EIP-4337’s GitHub page.\n\nWhile deployed on mainnet for over a year, the problem with EIP-4337 is that “EOAs are still the most used type of account by far,” Watts wrote on X.\n\nThe lack of migration among current users from EOAs to smart contract accounts is occurring for two reasons, according to Watts: people don’t have a way to convert their EOA to a smart contract account, and they also suffer from “a lack of native support by Web3 apps to connect smart contract accounts.”\n\nAs a result, Ethereum developers looked to EIP-3074 to solve these problems. According to its GitHub page, EIP-3074 allows “externally owned accounts to delegate control to a contract.” It’s meant to provide short-term functionality improvements to EOAs and act “as a stepping stone toward full [account abstraction],” said Lukas Schor, co-founder of wallet infrastructure maker Safe, in a conversation with Unchained.\n\nRead More: EIP-3074 vs EIP-4337: Ethereum Developers Disagree on Endgame for Account Abstraction\n\nWhile some were ecstatic about EIP-3074’s planned inclusion in the next Ethereum hard fork upgrade, others were not. According to the authors of EIP-7702, EIP-3074 not only introduces new opcodes that would have no use in a world where all users are eventually using smart contract wallets, but also leads to fragmentation.\n\nEIP-7702, which according to Schor does what EIP-3074 is attempting to do, but better— namely, improving the current user experience for those transacting onchain, as well as being a step in the right direction towards account abstraction including converting all existing Ethereum users’ accounts into smart accounts.\n\nEIP-7702 “modifies EIP-3074 to make it leaner and more compatible with ERC-4337…so that we don’t end up with two separate [account abstraction] ecosystems,” Watts wrote on X. Per its GitHub page, EIP-7702 has forward compatibility with future account abstraction, because “the contract code that users would need to sign could literally be existing ERC-4337 wallet code.”\n\nAs such, Schor thinks EIP-7702, despite its nascent status, will be included in Ethereum’s next hard fork upgrade, dubbed “Petra.” He indicated that EIP-7702 is not only favored by EIP-3074 proponents because it solves the same issues they want such as a better user experience for existing users, but is also “quite liked” by EIP 4337 proponents because of its compatibility.\n\nEIP 7702 feels like an approach to improving EOAs that is more aligned with smart accounts and generally more future proof: https://t.co/Dmx47ZTaYU I think it would probably make more sense to include in Pectra than 3074 — konradkopp.eth (@abstractooor) May 7, 2024\n\nQuantum Resistance\n\nEIP-7702 also seeks to address the potential problem stemming from the advancement of quantum computing, superpowered computers that rely on quantum mechanics.\n\nSome Ethereum developers have become concerned about the possibility that in 5 to 10 years, quantum computing will progress to the point where it can break the cryptographic algorithms called ECDSA used to generate private keys, compromising the security of a blockchain network. ECDSA, an acronym for “elliptic curve digital signature algorithm,” is widely used in many Ethereum-based crypto protocols to verify digital signatures for transactions.\n\n“The only way to move away from that is to not have ECDSA based private keys controlling user wallets, and that is solved by moving users to smart accounts [through EIP-7702], because then you can use different cryptographic curves [and] different signing schemes that are much stronger cryptographically and are quantum resistant,” said Schor."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNUmpuWFFJS0dZc1V1RHdOSVlRYVR5NU5xY08xbEhpSE1uOUQ0eFNZN1lNUUZNZ1JrakFBOWFITi1vOGQ3dnRCc0dRRkd0b3hLZktZZlZ0SGVjZkhiTXNBUE1OTFlIVHZxSDkwMmpTeWlhNG1NS3FVOU44S241N2JESHdBRmfSAYoBQVVfeXFMTWNvX0lNR0xFZGVPX2NzdGtqcHQtU0RFUkVja29OMVhMcUwyQl9WVHdQWEhJT1VBR2trWUpkWmVuMW9tSkt1dVpPNHJGbkJKVk1scm5qWVRnU2lEOW1RSzdYcFl6ampDWDRLM1pHdDFvbmhITEZsanBXbXhuSmZNOHdFZVJFRzlVam13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "More Ethereum whales exit the market – Are they giving up? - AMBCrypto News",
        "content": "One of Ethereum’s top whales has dumped seven thousand tokens, making over $16 million in profits.\n\nEthereum’s price has seen very minute increases; Analysts expect bulls to take control back.\n\nEthereum [ETH], the second-largest cryptocurrency in the world, continues struggling to regain its footing after a dramatic free-fall that sees investors holding on for dear life.\n\nBut now, it would seem that the largest holders of the token are starting to give up.\n\nRecent data from Lookonchain showed that an Ethereum whale who bought the coin around a year ago is now selling it for profits.\n\nThe whale withdrew 12,906 ETH (which is $24 million on price levels at press time) from Binance [BNB] at $1,890 last year and deposited it into Lido [LDO].\n\nThey then withdrew 7,000 of those coins from Lido when the market crashed a little on the 30th of April and deposited it into Binance. The profit made by the whale was over $16 million.\n\nData from WhaleStats revealed that BSC Chain Ethereum whales’ Fear and Greed Index was at extreme fear at press time.\n\nEther remains the most traded and held token by the whales, but they are clearly on edge, awaiting further market movements.\n\nEthereum’s performance in a gloomy market\n\nCrypto markets are still in the red, reeling from the correction that came after Bitcoin hit new all-time highs, suggesting an onset of a bull run.\n\nHowever, currently, the bears have the upper hand. At press time, Ethereum was worth $3,208. That is an increase of 0.02 percent over the past day and 0.8% in the past seven days.\n\nProminent crypto analyst Ashcrypto updated his outlook for Ether’s price.\n\nAccording to him, the historical pattern from 2020 and 2021 shows that Ethereum is going to break out again in the third quarter of this year. Going by his chart, he expects Ether to hit $4,000.\n\nMeanwhile, KEN Crypto, another popular analyst, believes that there has been a slight change in investor sentiment.\n\nAlthough it is largely bearish, he asserts that there is a tiny little bullish sentiment emerging too, thanks to the coin staying above 100 Simple Moving Average (SMA).\n\nHowever, despite that, Ethereum bulls are encountering major resistance, struggling to breach key higher levels.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nFurther insights from IntoTheBlock reveal a strong link between Ethereum’s price and the volume of large transactions, showing that they greatly affect Ethereum’s price movements.\n\nNotably, a decrease in these transactions in April corresponded with a drop in Ethereum’s price. Clearly, whales are influencing the market by increasing selling pressure."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9KQ1JCbFhmYm9wQ082YV81Nno0WmpJX25hNzQ2eFdEOFA3ZmdYU0gtZjlPQzRUNUU4MExaV2VIWVp4Tl9sTVZkODR3aGNiT3VXWkdSc2JQU0U1Rk9nZ1U0c0VZbXFMZFFVSkhwbk9qZ2lJNURuZWVsVtIBfkFVX3lxTE1QZ0NaYkZmTVczcDVfSnhYckhpUlFldlVxbkZ4Z1dlVk5zX0gzUS1lREtkbXR3ZU9tYk5vYkhqYS1BSUZkTU5EOFRVbkFxOHAybTA5MjhvRmZRZEEzOGRnUzRnZUZNTFpPaEVCb0t3eTJQdVpJX1Rsd1RmQzl0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "This Ethereum ‘weakness’ may keep ETH’s price below $3,100 - AMBCrypto News",
        "content": "Data showed that ETH’s underwhelming performance has restricted money flow in the market.\n\nOld coins were moving, indicating that selling pressure might continue.\n\nEthereum [ETH] is challenged with replicating its performance in the last bull market, according to a recent report. Put together by 10x Research, the report stated that the project’s fundamentals have weakened.\n\nAs a result, Ethereum is preventing money from flowing into the market at a faster rate. For those unfamiliar, 10x Research is a crypto institutional research platform.\n\nAccording to them, ETH drove the 2020/2021 bull cycle. However, the fact that the altcoin has been lagging restricts the market from reaching its full potential.\n\nIs ETH dragging BTC and others back?\n\nThe firm also added that it expected Ethereum to drive adoption, but it has failed to do so. It does not end there. The report also mentioned that the correlation with Bitcoin [BTC] has also hindered BTC, noting that,\n\n“Surprisingly, BTC and ETH remain highly correlated, with an R-square of 95%. Ethereum’s weak fundamentals are becoming a roadblock for Bitcoin as they prevent broad fiat inflow into the crypto ecosystem.”\n\nETH’s price at press time was $3,128. And according to 10x Research, the $3,100 region was a crucial spot for the cryptocurrency.\n\nHowever, the chart shared by the platform suggested that the price could decrease and hit $2,600 if care is not taken. When AMBCrypto checked the validity of this conclusion, we found some solid grounds for it.\n\nThe traction stops, places the price in danger\n\nFirst off, we considered looking at Ethereum’s number of new addresses. According to data obtained from Glassnode, the number of Ethereum new addresses jumped to 196,620 on the 5th of May.\n\nThis metric tracks the number of unique addresses that participated in a transaction for the first time. However, at press time, that number had plunged to 125,008.\n\nThe inability to sustain this growth puts Ethereum in a dicey position. The same goes for the price of ETH.\n\nShould the number of these addresses continue to fall, then ETH could be in a pole position for a slide below $3,100 as predicted.\n\nMeanwhile, ETH’s one-day circulation has been decreasing since March. This implies that fewer coins have been engaged in transactions since then.\n\nTypically, this could be a sign of decreasing demand for the cryptocurrency. However, it also shows that the number of ETH set aside for selling could be low.\n\nAnother metric we looked at was the Mean Coin Age (MCA). Low values of the MCA indicate accumulation, and this could foreshadow higher prices in the future.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the 90-day MCA on Ethereum’s network skyrocketed to 45.83. This increase implies that long-term holders of the cryptocurrency are moving their coins.\n\nMovements like this suggest a potential to sell. As such, ETH’s recovery might remain on the sidelines as the price might continue to struggle."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNVS0zM3NCaHFYYU9ZYTN4WUxUN1laYzFYYjNPMTJZOERSRHNTU0xhU3FOdGkwTkVRa0VYcUItemo1eVZfLXh1amNhS0xnRVpBUF91QzNzVzJLdDZxUlVMQ2s5LXpQYXdGS213VTkzRFVqZXRNam5waFBvNFpBWXVtX0RVR19MZ9IBjgFBVV95cUxPbVNNdWhIOHpsUnQ0U2FuUEhDOGJ5Ukt6RGYxSWF4N2FWR0FzR19IdXN3SkNVOWhORFJKSFNGbGx1ZUtBRk5LZkg0RmdoSGRWMUY0bTltZUFCQ0F0aDZoa041dldPRXFzWWQ0QmEzSl9aS1JDWWRLbDcxMThOWTQ1UVNqbFJJSlpEZE8tWEZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Game ‘Fantasy Top‘ Now One of Crypto's Most Profitable Apps - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFantasy Top, a fantasy football-esque Ethereum NFT game that turns Crypto Twitter influencers into trading cards, has seen a surge in attention since launching just one week ago on layer-2 network Blast. In fact, it’s making so much money in fees and revenue that it’s now included in the same conversations that surround many leading blockchain networks.\n\nOver the last week, Fantasy Top has been the fifth most profitable crypto protocol, according to on-chain data tracked by DefiLlama, with $9.31 million worth of ETH. It earned by selling NFT card packs and taking a cut of trades via its secondary marketplace.\n\nOnly Bitcoin ($22.1 million), Ethereum ($21.6 million), liquid staking protocol Lido ($18.2 million), and decentralized exchange Uniswap ($15.9 million) generated more fee revenue during that span. And over the past 24 hours, Fantasy Top lands in seventh place with about $925,000 in revenue, with the Tron and Solana networks rising above for the daily tally.\n\nFantasy Top has quickly become a crypto industry sensation, particularly on Crypto Twitter—because it’s based on and built around the social media sphere. The game’s 120 unique “heroes,” which were turned into tradable NFTs on Ethereum layer-2 network Blast, are all based on notable industry traders, investors, analysts, and content creators.\n\nAD\n\nAD\n\nAs in fantasy sports games—and particularly NFT-based versions like soccer game Sorare—Fantasy Top players must create a lineup of their owned heroes, and then they’ll earn points based on the real-life Twitter (aka X) engagement of the influencers in question.\n\nMany of the in-game heroes in question have also been playing the game themselves, driving attention and spending in the process. And there’s good reason for them to: They’re being paid a cut of all pack sales and secondary market trading fees.\n\nLate Monday, the game paid out $1.25 million in Ethereum (ETH) split between heroes, as well as potentially millions of dollars worth of Blast Gold—points for the upcoming BLAST token airdrop. And that was from less than one week of play since the mainnet launch. That amount, of course, would come from the aforementioned revenue total.\n\nPreventing Bots and shortening the Main Competition 🏁 To safeguard Fantasy participants and uphold a meritocratic environment, we've decided, together with the heroes, to end the competition slightly ahead of schedule, preemptively thwarting any surge in malicious activities.… pic.twitter.com/BKp0rYL6Io — fantasy.top (@fantasy_top_) May 8, 2024\n\nAD\n\nAD\n\nHowever, the Fantasy Top rollout hasn’t come without challenges. On Wednesday, the game’s creators said they had prematurely ended the first in-game “Main Competition” that began Monday because heroes’ social media content engagement totals were manipulated and boosted—apparently due to automated bots.\n\nFantasy Top says it will share the results of the competition soon, along with details on how it plans to address botting issues in the future.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPck5LUXVFT2Jua3B5VTF1LW1lY252ak5DazVYN21yaWRkWjZabnNBZ1RTNTF4QkhpQUJVWlQ3TldBYlY1OHB0YnNHNW5iQlR0TlE0dXhQRDlRYkdYX1FyWHktR0NuRDg2eHlDSTZjclZJZnhxRlk1cjVJRVBMc1BnbElPNjd6VXFJRHdxbExzb3BFenFIT2xmaG9JTzAzY1RIVGtMX01TMU9XdHFWb2oxdnFLMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "EIP-3074 vs EIP-4337: Ethereum Developers Disagree on Endgame for Account Abstraction - Unchained",
        "content": "Ethereum developers can’t see eye to eye on a proposed code change that could potentially improve user experience with wallets.\n\nSome developers believe EIP-3074 could introduce security risks to the network.\n\nEthereum’s next major hard fork Pectra would introduce a host of new Ethereum Improvement Proposals (EIPs), but one of them is facing pushback from the developer community, including the blockchain’s cofounder Vitalik Buterin himself.\n\nThe proposal, known as EIP-3074, introduces Ethereum Virtual Machine (EVM) opcodes: AUTH and AUTHCALL. The former allows externally owned accounts (EOAs) to authorize actions via a signed message and a commit, and the latter executes transactions on behalf of the authorized EOA.\n\nLearn more about it: What Is the EIP-3074 Proposal on Ethereum?\n\nAuthors of EIP-3074 expect that this change will make EOAs easier to use because of the ability to sign off on batched transactions together and also having third parties sponsor transaction fees, opening the doors for decentralized protocols to potentially cover these costs for their users.\n\nEIP-3074 is coming in the next Ethereum hard fork. This is a big deal. Wallet UX will 10x. Congratulations to Ethereum and the EIP-3074 sponsors. Reth has already implemented and tested it. We are fans. Let's go. https://t.co/lUiK2kb3UT — Georgios Konstantopoulos (@gakonst) April 11, 2024\n\nWhile the proposal is an effort in Account Abstraction (AA), aimed at making wallets more flexible, it has faced pushback from authors of EIP-4337, which was deployed to the Ethereum mainnet in March 2023.\n\nEIP-4337 is also an AA proposal, which supports introducing features to EOAs such as paying gas fees in tokens besides ether and account recovery mechanisms. However, that proposal sets out to achieve the goals AA using an offchain transaction relayer, without requiring any changes to the consensus layer.\n\n“This is of course NOT simply a matter of ‘my AA proposal good, your AA proposal bad,'” said ZeroDev CEO in a blog explaining that developers behind the two proposals had fundamentally different visions for the Ethereum roadmap.\n\nThe core disagreements include whether EIP-4337 is the endgame for AA and if it is more urgent to solve censorship resistance or user experience issues. Those in the EIP-4337 camp believe that Ethereum should prioritize censorship resistance even if it means delaying UX improvements, while those in the EIP-3074 camp think that the network is already censorship-resistant enough.\n\nThe big really valuable and necessary thing that ERC-4337 provides for account abstraction is a *decentralized fee market* for user operations going into smart contract wallets.https://t.co/JUigSO5OtW — vitalik.eth (@VitalikButerin) October 1, 2022\n\nWhile the proposal would bring about more immediate user experience improvements, some developers think that including EIP-3074 in the Pectra hard fork would introduce security risks to the network.\n\n“Ethereum’s account model is complex for users and thus introduces security risks,” wrote Ethereum developer Yoav. “We need to improve it, not to weaken it. After 3074 inclusion I expect we’ll see more rugpulls, replay attacks, wallets drained. I hope to be proven wrong here as well.”\n\nThe Ethereum Foundation is hosting a discussion on the proposal on Tuesday, which may determine its future."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPU2ZuSGNFZlctUzloWWlSV3FKa0d6WFJ6bnk2N05ZUmV1Q3AwYXoxR3ZLenUzY3E3SzRETEZfQzRmZHQyWi0xd1lrMDdsZ1ozTDM2WExBUzNYN3QtckcxZFNlNWQteW8xak9KTGpXWGRJZWdIOXo4V1VqSUpFM056dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Grayscale CEO “Optimistic” on Spot Ethereum ETF - Markets Media",
        "content": "Daily Email Feature Grayscale CEO “Optimistic” on Spot Ethereum ETF\n\nMichael Sonnenshein, chief executive of Grayscale Investments, said the digital asset manager remains optimistic that the US Securities and Exchange Commission will approve spot ethereum exchange-traded funds.\n\nSonnenshein spoke at the Financial Times Crypto and Digital Assets Summit in London on 8 May.\n\nHe said: “We are just a couple of weeks away from seeing the SEC’s first thinking on spot ethereum products and we are optimistic that the SEC will do the right thing by investors.”\n\nIn April this year the firm filed with the SEC to convert its Grayscale Ethereum Trust, which is already an SEC reporting company, into a spot ETF. Last year the asset manager won a lawsuit against the SEC which challenged the decision by the regulator to deny approval of the conversion of the Grayscale Bitcoin Trust into an ETF, despite the regulator approving bitcoin futures ETFs.\n\nThe ruling said that in order to avoid arbitrariness and caprice, administrative adjudication must be consistent and predictable and follow the basic principle that similar cases should be treated similarly. The court said: “The Commission failed to adequately explain why it approved the listing of two bitcoin futures ETPs but not Grayscale’s proposed bitcoin ET. In the absence of a coherent explanation, this unlike regulatory treatment of like products is unlawful.”\n\nIn a similar fashion, the SEC has approved ethereum futures ETFs. Grayscale had also filed for an ethereum futures ETF, but this has recently been withdrawn as these products are already in the market.\n\n“At Grayscale we decided to focus our energy on our spot product which is core to our DNA of pioneering access to spot exposure for investors,” Sonnenshein added. “We can always revisit things in the future but that is where our energies are focused right now.”\n\nSpot bitcoin ETFs\n\nIn January this year the SEC approved the listing and trading of 10 spot bitcoin ETFs and also approved the conversion of the Grayscale Bitcoin Trust into an ETF (GBTC).\n\nSonnenshein said: “When I zoom out and think about our 10 years of work, spot ETFs are by far the most mainstream moment that bitcoin has ever had. We have seen announcements from major banks and legacy financial players publicly advancing their plans in the crypto space.”\n\nGrayscale’s spot bitcoin ETF had $28bn of assets when it came to market after converting from the trust, and Sonnenshein was challenged on the ETF’s net outflows of $17bn since January. Data provider Blockworks Research said in a report that the Grayscale ETF notched its first and second days of net inflows since its conversion on Friday 3 May ans Monday 6 May.\n\n“We have always believed that a rising tide will lift all boats and see the addition of legacy financial players as helping to boost the ecosystem,” he said. “We never believed that we would have 100% market share in perpetuity, and we certainly cannot be the only firm educating investors on the merits of allocating to crypto.”\n\nSonnenshein also argued that the trust was the highest returning publicly traded product in history, returning over 49,000%, so the firm expected profit taking. He continued that the ETF was reaching an equilibrium and starting to see some net inflows into the product over the last couple of days, so this is just the beginning of the Grayscale journey.\n\n💸 Latest data shows US Spot #Bitcoin ETFs with a total net inflow of $11.77B and a daily net outflow of $16M on 7 May. Blackrock’s IBIT saw zero net inflow and Grayscale’s GBTC resumed its net outflow of $29M after two days of net inflows. pic.twitter.com/EOYb1tJb7b — Crypto.com Research & Insights (@cryptocom_rni) May 8, 2024\n\nOutflows may also be related to Grayscale maintaining a 1.5% fee for its spot bitcoin ETF, while competitors have much lower fees of around 0.3%. Sonnenshein admitted that the fee war was faster and more furious than anticipated but said Grayscale has made a commitment to investors to lower fees, which the firm will evaluate over time.\n\nHe also argued that investors will buy the Grayscale ETF because the firm has been a specialist in digital assets since 2013, has leading research, a track record and liquidity, and that the fee is just one component when investors look at allocations. However, in March this year Grayscale filed with the SEC for a new spot bitcoin ETF, the Grayscale Bitcoin Mini Trust, which Sonnenshein said would come to market with an “industry leading low cost” fee, if approved.\n\nThe new ETF is in the form of a spot off in which shares of the Grayscale Bitcoin Mini Trust will be being distributed pro-rata to GBTC shareholders, so shareholders of both ETFs will end up with a lower blended average fee across the two products.\n\nHe expects the established large liquid GBTC ETF to be used as a capital markets allocation tool and trading vehicle. The mini trust has the same exposure but is more of a long term allocation tool, which Sonnenshein said is similar setup for many ETFs. In addition, he believes there will be a new base of investors in digital asset ETFs from the financial advisor and wealth management communities, once their platforms approve these products.\n\nBREAKING‼️ $430 BILLION asset manager Susquehanna International just reported owning +$1.2 BILLION #Bitcoin across 10 ETFs. This include +$1 BILLION in just Grayscale's Bitcoin ETF. Wall Street is hungry for Bitcoin… 🚀 pic.twitter.com/uzpjOlDUZw — Radar🚨 (@RadarHits) May 7, 2024\n\nCrypto sectors\n\nIn October last year the asset manager launched GrayscaleCrypto Sectors, a framework designed to organize the crypto asset class. The firm also announced a partnership with FTSE Russell, the index business of London Stock Exchange Group, to introduce the FTSE Grayscale Crypto Sector Index Series, a suite of five rules-based indices capturing the investable crypto market across five sectors – currencies, smart contract platforms; financials, consumer & culture; and utilities & services.\n\nSonnenshein described the development of crypto sectors as “really important”, which the firm is bringing to regulators and other constituents of the ecosystem so that it continues to grow.\n\n“There is a lot of confusion in how to understand the differentiation amongst the crypto asset class when you get beyond bitcoin and ether, so we have taken this sector-based approach which is tried and tested in traditional assets,” he said. “It has been a really effective tool for drawing more interest and excitement into the ecosystem.”\n\nHe said he is also excited about Grayscale Labs, which is incubating new product ideas, new exposures and their most appropriate product wrappers.\n\n“I think the Grayscale lawsuit and the fact that we remain one of the largest crypto asset managers has garnered the attention of other folks in our space as well as more traditional players, but there is no definitive or pending deal or anything of that nature,” he added."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPVHd2c3EyZGdQal84ZmRkYkd0RVJEQ3dpZ056eUdEU2JwejRtUTNRcWFQNWl6ekJIRktaZkx5cURmT0ZuYmxnQ3lGRFJ6UjdBUTNyZTR1THU3Ty16MlpOUW15aTVCSFFFc2kweVg5dll5RjhBcWtTUV9URUFnd0hzM0RTYlhBUHVlUktxU0FLSWUxbzdlRjJxQUpMTkg3TnlvWHlhaVc0dHpGWWVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Joseph Lubin Defends Ethereum Against SEC Overreach - CryptoGlobe",
        "content": "In a recent interview with Wired, Joseph Lubin, co-founder of Ethereum and CEO of Consensys, shed light on his ongoing legal battle with the U.S. Securities and Exchange Commission (SEC).\n\nConsensys is a leading blockchain software technology company with a core focus on the Ethereum ecosystem. They develop a comprehensive suite of tools, products, and infrastructure designed to empower developers, businesses, and individuals harnessing the potential of Ethereum. Consider ConsenSys a pivotal player in constructing the foundation for the decentralized web.\n\nThe conflict, which centers around the SEC’s alleged attempts to classify Ethereum’s native cryptocurrency, ETH, as a security, has far-reaching implications for the future of the decentralized web.\n\nLast month, Consensys received a Wells Notice from the SEC, indicating that the regulator is considering suing the company over its MetaMask wallet. The SEC takes issue with two specific features of MetaMask: token swapping and staking. However, Lubin believes that the SEC’s actions go beyond MetaMask and represent a broader effort to assert control over Ethereum and the decentralized technologies built upon it.\n\nIn response to the SEC’s notice, Consensys filed a lawsuit against the regulator, accusing it of an “unlawful seizure of authority over ETH.” The company argues that ETH does not possess the characteristics of a security and that the SEC’s actions could have disastrous consequences for the Ethereum network.\n\nLubin explains that if the SEC were to successfully classify ETH as a security, it would have a “chilling effect” on Ethereum users in the United States. Individuals would be unable to legally acquire ETH, and software developers would be hindered in their ability to further develop the Ethereum protocol or build applications on top of it. Moreover, Lubin fears that the U.S. could use its influence to pressure other countries to reduce access to decentralized protocols and financial disintermediation.\n\nBy bringing the lawsuit against the SEC, Consensys aims to clarify the limits of the regulator’s jurisdiction and encourage the broader crypto industry to push back against what Lubin describes as “aggressive and unlawful SEC overreach.” He argues that the SEC has been “gaslighting the industry” by secretly treating ETH as a security while publicly stating otherwise.\n\nLubin likens the current situation to the early days of the internet, when new technologies caused confusion and required open dialogue and clear regulation. He believes that, ultimately, the situation will be resolved favorably for Ethereum, but acknowledges that the industry is currently in a “painful stage” marked by resistance from regulators.\n\nA favorable outcome for Consensys would be a clear declaration that ETH is a commodity, not a security, and the eventual approval of ETH spot exchange-traded funds (ETFs) by the SEC. Lubin believes that such a development would open “floodgates” of capital into the Ethereum ecosystem, driving further growth and maturation of decentralized finance (DeFi) applications.\n\nLubin dismisses the notion that the SEC’s interest in Ethereum intensified following The Merge, a major upgrade to the network’s consensus mechanism. He argues that the post-Merge Ethereum network is more decentralized and secure, and that staking rewards should be seen as income, not investment contracts.\n\nWhen asked about the SEC’s motivations, Lubin offers a “conspiracy theory,” suggesting that the U.S. government and big banks are resistant to the disintermediation and direct financial agency that decentralized technologies offer. He believes that the SEC’s actions are less about expanding its jurisdiction and more about slowing down or killing new technologies that threaten the status quo."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPVHZfQXp2N3V4clcwTUZZQjM1a0ttUFdycHl1Q0Z0Q2FwTVQ0TWxPZUdTMk1CVS1CNXZKallBNVVJRkp0NVRHdC1aU1pTdksxbkV1RXZwc29Udy1rc1Y3dFp6ZDNIMlp3dkM1eWhGVkdGcTFJTTY0SElRUFNHYV9RQWtfWHMybTRBcXVzV2VSalBWMzhBRlQ5YUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Decoding Ethereum: A comprehensive guide to ETH pricing trends - Arizona Big Media",
        "content": "Ethereum, launched in 2015, is a prominent blockchain platform known for its versatility and native cryptocurrency, Ether (ETH). It is the second-largest digital currency by market capitalisation.\n\nEtheruem price has sparked significant interest due to its unique features, such as smart contracts that automate transactions and decentralised applications (dApps).\n\nUnderstanding Ethereum’s Price Factors\n\nSeveral key factors influence the cost of ETH. These include market demand, blockchain upgrades, regulatory news, and the broader economic environment. Each plays a crucial role in the fluctuating values seen on the market.\n\nMarket Demand\n\nThe demand for ETH is driven by its widespread use in dApps and initial coin offerings (ICOs). As more developers build on the blockchain network, demand for ETH increases, often leading to a rise in its cost.\n\nTechnological Advancements\n\nUpgrades to the ETH network, such as the switch from proof of work (PoW) to proof of stake (PoS) in its consensus mechanism, can significantly impact its value. These upgrades aim to enhance the network’s scalability, security, and sustainability, which can, in turn, affect investor confidence and market rates.\n\nRegulatory Influence\n\nRegulatory announcements or decisions impacting cryptocurrency, particularly in major markets like the USA, Australia or the European Union, can lead to volatility in Etheruem prices. Positive regulatory news can encourage investment, driving prices up, whereas negative news can have the opposite effect.\n\nEconomic Factors\n\nThe broader economic environment, including interest rates, inflation, and economic growth, also impacts the blockchain’s values. Some investors may treat ETH as a hedge against traditional financial markets during economic uncertainty, influencing its price dynamics.\n\nHistorical Pricing Trends of Ethereum\n\nLike many digital currencies, its cost history is marked by volatility. From modest beginnings, its value saw a significant surge in 2017 during the cryptocurrency boom, followed by substantial fluctuations in subsequent years.\n\nSignificant Milestones\n\n2017 Bull Run: The blockchain reached new highs as cryptocurrencies captured public attention.\n\nThe blockchain reached new highs as cryptocurrencies captured public attention. 2018 Correction: Following the boom, its value corrected sharply as the market cooled.\n\nFollowing the boom, its value corrected sharply as the market cooled. 2020-2021 Surge: Driven by the DeFi (Decentralised Finance) explosion and the anticipation of Ethereum 2.0, the rate soared once again.\n\nAnalysing these trends helps understand the cyclical nature of cryptocurrency rates and prepares stakeholders for potential future movements.\n\nCurrent Trends and Future Projections\n\nETH continues to evolve, especially with the gradual implementation of Ethereum 2.0, which aims to address issues related to scalability, security, and sustainability. Monitoring current trends is essential for those interested in ETH’s future price movements.\n\nFactors to Watch\n\nAdoption of DeFi: The growing DeFi sector primarily operates on the network and is a critical driver of demand for ETH.\n\nThe growing DeFi sector primarily operates on the network and is a critical driver of demand for ETH. Network Upgrades: The final rollout of Ethereum 2.0 could be a turning point for ETH’s market valuation.\n\nThe final rollout of Ethereum 2.0 could be a turning point for ETH’s market valuation. Institutional Investment: Increasing interest from institutional investors can provide more stability and growth in the blockchain’s value.\n\nStrategies for Monitoring Prices\n\nFor investors and enthusiasts looking to keep a close eye on its price movements, several strategies can be effective:\n\nUtilising Technical Analysis\n\nTechnical analysis requires studying past market data, primarily price and volume, to predict future value movements. This can be particularly helpful in the highly volatile crypto markets.\n\nKeeping Abreast of News\n\nStaying updated with the latest technological developments, regulations, and the global economy can provide insights into potential price movements.\n\nEngaging with the Community\n\nThe Ethereum community is active and often at the forefront of discussing and disseminating critical information. Engaging with group forums and social media can provide early insights into shifting trends.\n\nEthereum remains a dynamic and influential cryptocurrency, with various factors influencing its pricing trends. By understanding these elements and monitoring ongoing developments, individuals and venture capitalists can make more informed decisions regarding their engagement with them. As the landscape evolves with technological advancements and regulatory changes, keeping an informed eye on Ethereum will remain crucial for anyone involved in crypto."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQVDkyX3dyQTY4d3R6bm96OWJLcmRNaHRrWDhUejROTnNBLTlSbGZ6Ulp5R2tPQ0tOUDlZVTh6dFBzd1lpQ283cTJSX3F3aFRCcmZ4SWJkcjJXYVF1aGc2ZG9vSVVEendvNUg3Rkd1MHZERHhpQmhzX3JKZ3ZGNEI5MXVCOHdOUVRYSUxvUGJWSdIBlAFBVV95cUxOd1lkSlBOdEY4RmF5RG5paWE4N2d5aXNNUzk2WlVwRXd0enVzX2lVNDI0aE56WXVtcXpDNXE4aEdPZmE3MExQeFRXSkFVaVdLVUxVUGdyOU1zQjV2NC1ubGdCNGktYzY5U0pJSWNRY0lXYWRhYTdYdWNfYUM2d1lBRVQzOGVGaWFrN29hX2RUTDVjbnhq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum sees $30M inflows after weeks – This is the key reason why - AMBCrypto News",
        "content": "Investments worth $30 million were allocated to Ethereum products.\n\nBitcoin registered outflows, but ETH’s price might drop.\n\nFor the fourth consecutive week, digital asset investment products recorded more outflows than inflows. Coinshares, the leading asset manager, made this known in a post dated the 7th of May.\n\nIn total, the outflows were worth $251 million with Bitcoin [BTC] accounting for $284 million. However, Ethereum [ETH] was able to reduce that number after it registered inflows worth $30 million.\n\nETH comes out from the shadows\n\nThis was the first time in seven weeks that Ethereum had inflows. However, AMBCrypto observed that the launch of Bitcoin and Ethereum spot ETFs in Hong Kong last week was responsible for the increase.\n\nCoinShares also agreed, highlighting that,\n\n“The bright spot last week was the successful launch of spot-based Bitcoin and Ethereum ETFs in Hong Kong, which saw US$307m inflows in the first week of trading.”\n\nAnother reason could be linked to the anticipated decision of the U.S. whether to approve the Ethereum ETF applications or not.\n\nIn previous articles, AMBCrypto had reported how some experts expressed skepticism about the approvals.\n\nHowever, there were a few who displayed optimism that the filing would get the green light. In the week before the last, we had mentioned how Litecoin [LTC] and Chainlink [LINK] led the inflows.\n\nBut last week, these altcoins could not find favor in the eyes of investors. For Ethereum, an approval could save ETH from its depressing phase.\n\nOn the other hand, rejection could trigger another wave of correction for the cryptocurrency. At press time, ETH changed hands at $3,067.\n\nThe coast is not clear\n\nFurthermore, there have been predictions that the price might slide again. If validated, a decline to $2,800 could happen, as it did a few weeks back.\n\nNonetheless, there are some traders whose target is a return above $4,000. To ascertain the potential of these forecasts, we looked at the Market Value to Realized Value (MVRV) ratio.\n\nThe MVRV ratio measures the profitability status of holders. With this metric, one can tell if a cryptocurrency is undervalued, at fair value, or overvalued.\n\nAt press time, Ethereum’s 30-day MVRV ratio was -3.447%. This means that holders would generate an average of a -3% loss if they all decide to sell at the current value.\n\nBut most would not do this. However, this might not be a good accumulation point, despite the negative reading. Historically, great buying opportunities appear when the metric is between -7% and -18%.\n\nTherefore, those keeping an eye on ETH, and waiting for good entries, might need to wait a little longer.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nRegardless of the entry region, ETH would need an intense level of buying pressure to start rewarding the positions.\n\nFor now, it is uncertain when that will happen. However, market participants are hopeful that Ethereum’s time to shine might not be far away."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPdWgxQzZNc0oyRlVlSmRHbWF4LVR3NmpWZ29XWGJBNTZBSVFlNUxhSnpzcTFnaWpvRlZoWUlCWlByWnpBR0lCWUprTnlQVTlkV2MtUVJpZ1gxMFBkUTdqbWNmZWlzNDdTVDl1UnJYa0M1MXhqVzJHTHBUN2d3cjZuaENibVRpWUluNjhQRS13Rm5kcUFnUFNOeEI4X3BxbVdUSEgtTVZLbmU0N2t2bDU0bjNqLWpwN3pZTmNCdjc4d2thYlBXVEdTcTFlcnN4ZW_SAdQBQVVfeXFMT2ZFLWR3ZUJRYWZUYmd0QjNUVDMtR1BvLUFHR1VBNzRSZkV4dEs5TzBzRmt2MnJpaDZ2NE55eERwOGFpdTdfVUFsNWNpX0hYR3FHUEJoRzdrR29XVFdRZE1lQVB0di1yQS1uQmpZUFBwYVNtamlYOC0xczN0WUhxeFBpNHdyVjhHOC1mVFJZcFRsNjc1Q3lvckt2T01aSTZxU3FTMkhURHB1S3o0dnZEWWJKZWhVeWxpTUVyMVFfZmJxX01vODlBR0RiX1BQUFJnYjVhR1Y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum-Based Altcoin Leads Real-World Assets Sector in Development Activity, According to Santiment - The Daily Hodl",
        "content": "Blockchain analytics platform Santiment says one Ethereum (ETH)-based altcoin project is leading in the real-world asset (RWA) sector based on development activity.\n\nSantiment says that blockchain oracle Chainlink (LINK) is seeing the greatest amount of daily activity on the development hosting platform GitHub.\n\nLINK Is seeing more than two times the amount of development activity compared to the second most active blockchain project, Synthetix (SNX), a decentralized finance (DeFi) crypto that allows synthetic asset creation on Ethereum.\n\n“Here are crypto’s top real-world assets by development. This list is compiled by counting any non-redundant GitHub activity, and averaging this daily activity over the past 30 days. Chainlink currently produces 2.49x more daily activity than the next most active project, Synthetix, in the RWA sector.”\n\nSantiment’s ranking list is as follows: 1. Chainlink 2. Synthetix.io 3. Centrifuge (CFG) 4. Dusk (DUSK) 5. Oraichain (ORAI) 6. Creditcoin (CTC) 7. IX Swap (IXS) 8. Maker (MKR) 9. Polymesh Network (POLYX) 10. Reserve Rights (RSR).\n\nSantiment also says that the native asset of decentralized oracle protocol Tellor (TRB) is outperforming most other digital assets so far this month.\n\n“Tellor is one of the top performing assets thus far in May, exactly doubling in market cap since the calendar month turned. Whale transactions and address activity have both seen sudden spikes, which are suggesting potential TRB profit takes.”\n\nTellor is trading for $111.64 at time of writing, up 16% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTWhxLTN1TUQ3a1p6NkZwclFTODVWZ0tLY2gxVjJoRzRZcXR5VGYtSWl4QWJTMmRwT1VzcWpxZ0c2TVhtQnZ6ekJOcFlpNFV0RXB0NFhDSlpxVzFPTXhIMEYtbEVDQXdBUXR6eWQxTXhjQUVjdnBfRW51V2dFZk1yRUVFU3FWQXlYcHpncUZYZlowZjVlQm1HSU55MTNhUdIBowFBVV95cUxPR3JlVVpRTUhJLVN4RjV2b1doaDIyYlk0cHlLR0p2RmdCT3YweHhpc3EweC03VTdqTno0Tk9KTE8wM1RsS09rcG05dG85YzBBUDM4RzJzT0k0aWx1OGx6Y0JjeEFjLWxDMk1JdjZjSDhVNmJOZEZEMEJfd1gzY0cybkN3d0E1RDZ5Rkx3azNpempVaFd4TFhmNmx4cXNMTVpkNHB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum Remains The ‘Basket Case’ This Bull Cycle, ETH Price Dip To Continue? - CoinGape",
        "content": "While Ethereum (ETH) remains a central player in the crypto market, it faces mounting challenges in its quest for widespread adoption. Moreover, a recent report by 10x Research suggests that Ethereum is the “basket case” in this bull cycle. This has raised concerns about the ETH price’s future trajectory as it recently lost hold on a crucial level.\n\nWill Ethereum Price Continue To Dip?\n\nThe 10x Research report noted that despite Ethereum’s pivotal role in facilitating DApps and the NFT market, its weak fundamentals have become a cause for concern. It negatively affects Bitcoin’s trajectory due to the correlation between these crypto behemoths. In addition, the poor fundamentals also bring doom to the Ethereum ecosystem.\n\nadvertisement\n\nDuring the previous cycle, Ethereum was positioned as a revolutionary force set to supplant traditional banking systems. However, its failure to swiftly address scalability issues and adapt to changing market dynamics has left it trailing behind. Whilst, Bitcoin has now assumed the mantle of digital gold, leaving ETH behind.\n\nMeanwhile, the correlation between Bitcoin and Ethereum remains strikingly high, with an R-square of 95%. This underscores the interconnectedness of the two largest cryptocurrencies. Hence, Ethereum’s struggles are proving to be a “roadblock” for Bitcoin, hindering broader fiat inflows into the crypto ecosystem.\n\nThe lower amount of inflows is also a reason why Ethereum price is plummeting harder than Bitcoin. In addition, FTX has been dumping ETH to complete the liquidation process. Furthermore, hackers are leveraging Tornado Cash to get rid of the stolen ETH funds.\n\nAnalysts warn of further downside for Ethereum, with price predictions suggesting a further dip. As the ETH price extended below $3,132.80, the impending decline became evident. The breach of this critical support level signals a continuation of the bearish trend, with the next target set at $2,905.30.\n\nHowever, if Ethereum manages to breakout above $3,132.80, the bearish trend could be over. As of writing, the ETH price was down by 3.10% to $3,078.99 on Tuesday, May 6. Moreover, the second largest crypto by market cap attained a low of $3,027.59 amid the decline today.\n\nAlso Read: Just In: SEC Delays Decision on Invesco Galaxy Ethereum ETF to July\n\nFTX & Crypto Hackers Dump ETH\n\nFTX, tha bankrupt crypto exchange founded by Sam Bankman-Fried, has expedited its liquidation spree lately. Since the beginning of this week, the organization has offloaded over $12 million worth of Ethereum. The two transactions highlighted by Peck Shield Alert, a blockchain tracker, saw a transfer of $6.3 million and $6.17 million worth of ETH, respectively.\n\nThis ETH dump was direct toward Coinbase and Wintermute. Whilst, crypto hackers who stole Ethereum funds have been using Tornado Cash for anonymized transactions and realizing profits. According to a post on X Peck Shield Alert, Poloniex hackers, who led to a compromise of $125 million worth of crypto assets, transferred 200 ETH to Tornado Cash.\n\nFurthermore, Kronos Research hackers, who stole $26 million of crypto funds, joined the fray. They also transferred 200 ETH to Tornado Cash. In addition, they shifted $4 million of Ethereum to a new wallet to commence laundering via Tornado Cash.\n\nAlso Read: Binance To Remove This BTC, ETH, & USDT Pair, Here’s Everything\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMipAJBVV95cUxPMlYtaTlFLXVpN0VmSUZDLWdCczJveEFneThNY2ZXNlFiaHJBdUhSN1hHeE5qSmhIVDJ4S1F1dzk4Sm9vekdzOUlmazc0Qlc0YXZjdlZtZG9qdGVjbkxtMWlFWFZfU1hXVHhRTlQ3VkZ5eWFmU1hac3JxTTZoYXhLSG43UzEyQ0dweUJTTkxJbm1wMjVoOUtsQ0V1dlI4M0d6ZTJDMUJrVkpiMDNnc3BVN2hQYWFwQ28yMlZCVkFlTjBUYlVoeHdFVXlHUDZLLXJKWXdlaE40aEtYWXZUVTVUbHhxUXBITGhBT29pM2J3YnZRbWpSWnRTcmx1U1ptMG1zcXJpNENSYk03TWZjUVVhZ0w2OHBqbEhveW1HTm1ORm4zTWpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Bitcoin Surges 8.33% to $65,000, Ethereum Holds Strong at - GlobeNewswire",
        "content": "New York, NY, May 07, 2024 (GLOBE NEWSWIRE) -- In the dynamic and ever-evolving world of cryptocurrencies, recent movements within the market showcase the resilience and potential of major digital assets. Bitcoin (BTC) recently experienced a surge from $60,000 to $65,000, predicted by the Bitcoin Fundamental Index (BFI). Ethereum (ETH), maintaining stability above the $3,000 mark, shows strong holding signals from investors, while Furrever Token (FURR) demonstrates the merging of cuteness with crypto, reaching a significant presale milestone.\n\nBitcoin's (BTC) Recent Surge Predicted by Fundamental Index, What's Next?\n\nThe recent surge in Bitcoin's price, moving from approximately $60,000 on May 1st to $65,000 by May 6th, was successfully forecasted by the Bitcoin Fundamental Index (BFI) developed by Swissblock. This innovative analytical tool correlated fundamental metrics of the Bitcoin network to its price movements, signaling a potential reversal just before the rally began.\n\nOn-chain data from the period leading up to the price increase showed a significant rise in transactions exceeding $100,000, alongside balanced inflows and outflows on cryptocurrency exchanges. Specifically, exchanges saw total inflows of around $8.3 billion and outflows slightly less at $7.23 billion. This pattern reflected a healthy market sentiment, with substantial buying pressure counterbalancing profit-taking by some investors.\n\nInterestingly, the BFI highlighted that the concentration of Bitcoin by large holders was relatively low at 11%, suggesting that the recent price movement was not predominantly driven by whale activities. This is significant as movements driven by large stakeholders can often introduce increased volatility into the market. Moreover, the price correlation of Bitcoin remained stable, with a perfect correlation score of 1, indicating predictable movements aligned with key market indicators.\n\nAs Bitcoin navigates through various economic and market conditions, tools like the Bitcoin Fundamental Index offer valuable insights for predicting potential price movements. With the recent rally now aligning with fundamental and on-chain analyses, the cryptocurrency community continues to watch closely, using these indicators to gauge future market directions effectively. As always, investors are encouraged to consider such comprehensive data when making investment decisions in the volatile crypto market.\n\n\n\n\n\nEthereum (ETH) Shows Strong Hold as Prices Soar Above $3,000\n\nEthereum (ETH), a major player in the cryptocurrency market, is currently showcasing signs of strong investor confidence as its price stabilizes above the crucial $3,000 mark. With the current trading price at $3,177, Ethereum is approaching the 23.6% Fibonacci Retracement level, which is recognized as a vital support zone.\n\nEthereum investors are increasingly choosing to hold onto their assets rather than sell, contributing to a bullish market sentiment. This behavior is evidenced by a significant reduction in active deposits, which have decreased by 27% over the past week. Active deposits are essentially the unique addresses that transfer Ethereum from personal wallets to exchanges, and this decrease marks an eight-month low in potential selling activity.\n\nHowever, if Ethereum fails to hold the $3,000 support, it might face a correction towards $2,539, challenging the current bullish outlook and potentially extending losses for investors.\n\nAs Ethereum continues to navigate through these pivotal price points, the market's response to these holder behaviors and technical levels will play a crucial role in determining the short-term trajectory of this leading cryptocurrency. Investors and market watchers are advised to monitor these developments closely, as they could significantly impact Ethereum’s pricing and market positioning in the coming weeks.\n\n\n\n\n\nExploring the Charming World of Furrever Token (FURR): A Blend of Cuteness and Crypto Innovation\n\nFurrever Token (FURR) offers a unique twist in the cryptocurrency landscape by integrating the charming allure of cats into its platform. At the heart of Furrever Token's strategy is its commitment to enhancing user interaction with delightful cat imagery. By incorporating cat-themed stickers, emojis, and visuals, FURR transforms everyday transactions into enjoyable and heartwarming interactions. The project's focus extends beyond mere aesthetics; it actively fosters community engagement through various challenges and initiatives that encourage users to express their affinity for cats and cuteness.\n\nHaving raised over $1 million in just two months and currently in stage 8 of a 10-stage presale, Furrever Token is priced at $0.000648. The token offers potential returns up to 15X, appealing to investors looking for both fun and financial growth. Ensuring security and transparency, Furrever Token has undergone a smart contract audit by Securi Lab and maintains active engagement with its community on platforms like Telegram.\n\nAdding an element of excitement, Furrever Token has launched the $10,000 Frenzy Bonanza Competition, captivating participants globally. Hosted on the Gleam platform, this contest offers a total prize pool of $10,000 in FURR tokens. Participants increase their chances of winning by completing various tasks, with the more tasks completed, the higher the probability of securing a top spot.\n\nScheduled to run from May 2, 2024, at 12:00 pm (UTC +1) to May 9, 2024, at 12:00 pm (UTC +1), the week-long event allows ample time for participants to partake and gather points. At the end of the competition, three winners will be chosen randomly to receive $5,000, $3,000, and $2,000 in $FURR tokens, respectively, potentially boosting their cryptocurrency holdings significantly.\n\nFurrever Token is proving to be a standout in the cryptocurrency world by merging the appeal of playful themes with serious financial potential, promising to be an enticing venture for both cat enthusiasts and crypto investors alike.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token $10,000 Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPRzh0bmlnRmxRTnJDck9RRnVYZ3liaE9IYlR6d1JmR0h1b0JSTXEwMFliOUpfdHg4VTEtem4waklsbk5tWEJ5aFhjd3RnVmRtSUd1eFplak1GS0dhTC04N2ZSNkRMeF9ROWVHa3ZiU0hfY05lZTZ2ZG4taDhYNS1WckZ5UGlWMjMxdVZoNDZvdUJmb25ZdFhUY2tfUmp1QWVs0gGoAUFVX3lxTE92bG10cFZZRVNHeFBiWjlXdUVLWjdtVmhXRWJzZGlsa2ROcEY3SmpJa29PWDlfRjlCd3ZwRXNvdDhRbFU2YmsxY0JYbk5aZ1N0VU03NFJ6V2hvSWZBSm9tOHNRekY4cy1HUE04NzdpU21pTWhIVkdPakViR195MXhmd1o2NXNfNUtTaXdsaTQ3SkcwbXR4RTZKS0pmT2E5SjBzeDFBMHJiSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum Game 'Fantasy Top' Pays $1.25M to Twitter Influencers It Turned Into NFT Cards - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto Twitter’s new favorite game, Fantasy Top, just paid out $1.25 million worth of Ethereum to top influencers that it turned into NFT trading cards for the fantasy football-esque experience.\n\nAfter launching on Ethereum scaling network Blast a week ago, the game—which allows players to create card lineups of their favorite Twitter (aka X) influencers, and earn rewards based on those influencers’ respective social engagement—took crypto by storm.\n\nThe in-game “heroes” turned into cards include meme coin trader Ansem, DeGods creator Frank, and even Su Zhu—the co-founder of collapsed crypto hedge fund Three Arrows Capital. (Disclosure: Rug Radio co-founder Farokh Sarmad, president of the combined DASTAN parent company that includes Decrypt, is also one of the Fantasy Top \"heroes.\")\n\nInfluencers earn a 1.5% fee from the trading volume of their card as well as a share of 10% of all pack sale revenue. Now Fantasy Top has made its first payouts—and creators are cashing in.\n\nAD\n\nAD\n\nHeroes $1,250,000 Payout 🤝 Exciting news! We've successfully distributed the First Week Heroes Payout. ⚡️ 409 ETH\n\n✨ 7,500 FAN pts per hero on average\n\n🟡 2,480 Blast BOLD You can view the rewards on the Hero Page. The on-chain distribution will begin soon, coinciding with… pic.twitter.com/U5B7yZvRG3 — fantasy.top (@fantasy_top_) May 7, 2024\n\nThe top three earners for week one were content creator Jenn Duong in first, then the aforementioned Ansem and Blast founder Pacman tied for second. First place was crowned with 6.7 ETH ($20,500) while the other two were blessed with 6.1 ETH ($18,700) apiece.\n\n“$18K in earnings for [the] first week, not too shabby,” Ansem posted on Twitter, in response to the news. “Fantasy Top [is] one of the crypto apps that could onboard a lot of Web2 creators.”\n\nScoring in Fantasy Top is based on your lineup’s real world social media engagement. On Sunday, it appeared that Duong’s Twitter engagement was being artificially inflated by bots with degens trying to perform better in-game. She publicly condemned people doing this, temporarily putting her Twitter account on private as she sorted through it.\n\nAD\n\nAD\n\nBut Fantasy Top says it’s using anti-botting protections when it comes to scoring, and Duong has also seen substantial organic engagement due to her video content around Fantasy Top, as well as other Blast apps and protocols.\n\n20K pushing 1 mill impressions \"Who's afraid of little old me?\"\n\nYou should be pic.twitter.com/Hgx1igdgIO — Jenn (@jenndefer) May 7, 2024\n\nOn top of the 409 ETH ($1.25 million) given out to heroes—300 ETH generated from pack sales, and 109 ETH from the card marketplace—another 2,480 Blast Gold was distributed to players too.\n\nWe’re yet to know how much Blast Gold will be worth, but crypto industry observers estimate the value to be above $10—adding an additional $25,000 or more to the game’s first week payouts. \"Heroes\" also earn FAN points, which could be a precursor to a future token airdrop, though that's currently unclear.\n\nI'll be sharing 100% of this initial @fantasy_top_ revenue drop with all Herro Card holders. I believe in betting on the ppl that bet on me. Lets cook https://t.co/9VX4QlWCSV — Herro (@HerroCrypto) May 7, 2024\n\nFantasy Top also said that it plans to launch a feature that lets influencer \"heroes\" share their earned rewards with players who own their in-game cards, which would give the game a SocialFi component. Some influencers have already confirmed plans to share their rewards with NFT holders.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOWEhDdzl1ZUJMYkRFaWJUZU9mdXUtUkxTNHRiWUlHMmNqdGJtOE4xY0FVbWt5TFp1MU5KT2t1WmpjQ1l3N3JVQU9XZ2FoS1NXZDI2OHdvcmlXM19VNVdueTBTY3J3ZVY4dzNET09FckwzNUF2ZENqWTltSHIxNlZSWi1KV0dfbjdkMzFTcmxGa0RFODNNbUN5V0hhVGllbWlpTjhRb0Z3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Hodl Law Challenges Unclear Ethereum Regulations in Court Appeal - Crypto Times",
        "content": "Hodl Law is currently appealing the dismissal of its suit with the SEC. The matter revolves around the question of whether Ethereum, the world’s second-largest blockchain platform and its native currency named Ether, ought to be regarded as secure.\n\nAccording to HODL Law, the SEC’s failure to provide unambiguous regulations on cryptocurrencies is not only affecting businesses but also poses a great threat to the growth of the industry. They seek to obtain the court orders that call for the claim that ether transactions are not within the purview of securities laws.\n\nLook ma, we made it! The 9th Cir is not required to have an oral argument but I guess something about the way @SECgov has been acting caught its attention. Will be livestreamed!@digitalassetbuy @scottmelker @MetaLawMan @JohnEDeaton1 @attorneyjeremy1 @Belisarius2020 @twobitidiot https://t.co/BiT8BQSwpE — Fred Rispoli (@freddyriz) May 7, 2024\n\nThe SEC first dismissed the original lawsuit against Hodl Law because it had no actual proof of any harm done. According to the SEC, the pleas of Hodl Law of uncertainties regarding future enforcement is nothing but speculation, and so a lawsuit is unwarranted.\n\nThe Court of appeal of 9th circuit will be presiding over this case on July 18, 2024. This case means a lot in the whole digital currency field as the SEC launched a wave of disputes against other crypto firms recently."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNM1RfRWwwbDFKZEZEQU5JbHlIUHFHaU9XZ2VBaDQ5MXd1cmkyMVhYSVN4cnh5U0RqX1M5NDBYQ25JZ1lPNTVIM0M2TzBicmRVeGZmUnB2WVJGNEQ1clpoMHhmTDVFbHJmTnVSRkdNM3p1ODUyWjU5NjBrZXY5WjZhUW9Gb19XN3J2TDV30gGQAUFVX3lxTFBNMEJRNEJyUlh6dEt6SXVZV3hkVkNkLU1FdGhkcGpjOTBaRjMxdkhINzM1Z05oVmU3ZmFYNkRUSm9LZnMyc19hVmkyUEpWSnlUbXVCVHJ4RGRsUnpLOTJVcUhLdmQ3QkVBT2JyVFBENUtnS1RtTVhnSjg1bWNVeWhkRTdDbVA4TkRIUDdmYkZObA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Allegedly Dumps 1,000 ETH: Will Price Drop Follow? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe recent series of transfers by the Ethereum Foundation to the multisign address \"0xbc9\" has caught the attention of market observers, sparking concerns about potential volatility in Ethereum's price.\n\nAdvertisement\n\nIn the latest transaction reported by Spot On Chain, the foundation moved 1,000 ETH, valued at $3 million, to the aforementioned address. This action is part of a larger trend, as the foundation has already transferred a total of 5,000 ETH to the same address since the beginning of 2024.\n\nWhat is notable about these transfers is their potential impact on the market. Analysis reveals that a considerable portion of the previously transferred ETH — 1,766 ETH — has been promptly sold for 4.81 million DAI, averaging $2,725 per ETH. Interestingly, these sales often coincide with a decline in Ethereum's price.\n\nAdvertisement\n\nIndeed, historical data indicates a correlation between the Ethereum Foundation's sell-offs and downward pressure on ETH's price. With the multisign address \"0xbc9\" currently holding 2,508 ETH, equivalent to $7.51 million, market participants are cautious about the implications for Ethereum's value.\n\nETH to USD by CoinMarketCap\n\nThe current market environment adds to the apprehension, with Ethereum trading below $3,000 per coin and struggling to breach the $3,300 resistance level. As a result, there is speculation about whether the foundation's actions could exacerbate the downward trend, potentially leading to a drop in ETH's price to $2,400.\n\nAs the crypto community braces for what lies ahead, all eyes remain glued to Ethereum's price chart, awaiting clues about the next move of the main altcoin."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5VQU9MLTFrR1FyejJ2UHFfNVgtblFIU1ZvV3ZyNXYyNlhmZFNYRGM1d1U1QkUtbXZPSjZ6U2FxWVJlME5QX05yQi1oN0ZYTmJIUnBKWnlYRkI4U0trX2JUdzBHM1EyWFRpNjJycmF4Yks5a0RONk01Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF: SEC extends the suspense! - Cointribune EN",
        "content": "Tue 07 May 2024 ▪ 3 min read ▪ by Mikaia A.\n\nThe United States Securities and Exchange Commission (SEC), the world champion of procrastination regarding ETFs, has resurfaced. A newly filed document has announced a further 60-day delay in the decision on the Invesco Galaxy Ethereum tracker. A habit that no longer surprises anyone in the crypto universe.\n\nThe SEC Further Delays Ethereum ETF Decision: Indecision Reigns Supreme!\n\nGary Gensler and his team seem reluctant to approve spot Ethereum ETFs, even though they have already approved Ethereum Futures ETFs. The numerous decision postponements are proof of this. The SEC had even opted for public consultation to better defend its position. And it doesn’t stop there!\n\nAccording to Cointelegraph, the United States Securities and Exchange Commission (SEC) has once again postponed its decision on the Invesco Galaxy’s request to create an Ethereum spot exchange-traded fund (ETF).\n\nIn a document filed on May 6, the SEC has given itself an additional 60 days to rule on the Invesco Galaxy’s application for a spot ETH ETF, thus setting the next deadline on July 5th.\n\n“The Commission finds it appropriate to designate a longer period within which to issue an order approving or disapproving the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues it raises,” wrote the SEC.\n\nOver the past few months, the SEC has delayed decisions on the applications of eight potential Ethereum ETF issuers, confirming the expectations of analysts, including VanEck, BlackRock, Fidelity, Franklin Templeton, Hashdex, and Ark 21Shares.\n\nDeadlines for the SEC approval requests of Ether ETFs. Source: James Seyffart\n\nIssuers Left in Total Limbo!\n\nLast March, Eric Balchunas, Bloomberg ETF’s senior analyst, lowered his forecasts for SEC ETF approvals from 50% to 35%. He was less optimistic about the approval of VanEck’s offering before the deadline.\n\nAccording to Balchunas, the extended “radio silence” from the SEC towards potential fund issuers, combined with a growing political pushback against Gary Gensler, the chairman of the SEC, have motivated this decision.\n\nSimilarly, Bloomberg’s ETF analyst, James Seyffart, has revised his “cautiously optimistic” stance. Since March 20, he expects a “final rejection” of all Ethereum ETF requests by the SEC on May 23rd.\n\nDiscover our newsletter This link uses an affiliate program.\n\nDespite this consensus, Ethereum advocate Anthony Sassano remains confident in the approval of the funds before VanEck’s deadline, citing the SEC’s approval of Ethereum futures ETF products in 2023 and other recent meetings between regulators and industry firms.\n\nMicroStrategy’s Michael Saylor is more than skeptical.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOaG96MDdmUWFmUEN3VXBQeGE0WmZzR3hTWk5wM2RkSS03TTN2ZldnOXpOT1V1dGJ5Tks1bGpDcERKcVFQenBTSGN4aDlRY2dKeWJZOVplT1BOMDl1bDYwZUIzdUg1SWZwTXFmZ3lZS3VfcTMyTDNnNk5sQXZmNTl5REtnSkpGVG5jOEh4SGNHM0FrRDEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana to Flip Ethereum in Transaction Fees as Soon as This Week - Watcher Guru",
        "content": "Once dubbed the ‘Ethereum Killer,” the Solana network is poised to surpass the famed blockchain network in transaction fees as soon as this week. Indeed, Blockworks senior research analyst Dan Smith discussed the potential flip that is just on the horizon.\n\nSuch a development would return Solana to its once-heralded position as a network most likely to dethrone Ethereum. Ongoing outage issues had called the network crowning into question. However, its performances throughout 2024 provide hope that it will meet those expectations.\n\nSource: Blockworks\n\nAlso Read: 3 Solana Based Meme Coins To Watch This Week\n\nSolana Flip Ethereum in Fees as it Continues Strong 2024\n\nJust five months into the year, Solana has proven to be one of the biggest stories in the digital asset market. In March, it was the home network for a plethora of surging meme coins. Indeed, the industry’s meme coin mania was driven by Solana-based newcomers like Dogwifhat (WIF) and Book of Meme (BOME).\n\nThose performances had seen the network become the market leader in monthly DEX volume. Moreover, Solana could be set to flip Ethereum once again, this time in transaction fees, which will take place as soon as this week.\n\nSpecifically, Blockworks researcher Dan Smith predicted Solana would flip Ethereum in both “transaction fees [and] captured MEV this month,” while noting it could happen this week. Captured MEVs are profits that are captured through arbitrage trading.\n\nSolana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week — Dan Smith (@smyyguy) May 7, 2024\n\nAlso Read: Solana: Here’s When SOL Can Reclaim Its All-time High of $250\n\nAccording to Smith, Solana’s total economic value has reached $2.8 million as of Tuesday. Alternatively, Ethereum had seen a total economic value of $3.1 million on the same day. Subsequently, the tightness of the two network races is clearly continuing to sort itself out.\n\nConversely, the daily transaction fee battle is still clearly held by Ethereum. The network generated more than $2.75 million in the last 24 hours, outpacing Solana’s $1.49 million, according to DeFiLlama.\n\nSolana has still proven its worth throughout this year. Its native token has also performed well, with the asset increasing more than 20% over the last seven days alone. Indeed, Solana (SOL) and its network are expected to continue their positive performances throughout the year."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQMTRqdDlBcDVxdm1GUDhDWEREeHZWeklrbXNKeEFMdHJteU91NG5MVlpBOXBCTTh3T29FX2RVc0tQY1NJdGgxbFBlMVMxOWg5TWxLSVdoNllEWW9tejZ0Z3NGRnRFUE5UQXJzZ1gwT2JvMmtxWHhKSk9NWl81bEVZLWpxenXSAYoBQVVfeXFMTWNjZlpoR19sR2FhNjdXS2ZoVGluMEw1d3R5RzZ0UmJ0dlpuR2NwajQyMFROTHEzc0RYX3JhVEozYVc3TnVvWGNCZ1dhZjJyNnh6dkR3Ujd1NHc1U0RlNjlUUVNLb0hmRWpReDVfMV9fLTlUN3ZJdzBtenhwZ1c3WHJYS1I5Q3JuLWN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Why Ethereum traders are starting to bet big against ETH’s price - AMBCrypto News",
        "content": "Short positions increase following Grayscale’s decision to pull its Ethereum futures ETF application.\n\nMarket sentiment grows bearish with potential further declines.\n\nEthereum [ETH], the second-largest cryptocurrency by market cap, has recently shown a lack of significant upward momentum, contrasting with Bitcoin’s [BTC] recent surge.\n\nAlthough Ethereum reached over $4,000 in March, it failed to set a new all-time high, unlike Bitcoin, which soared to a new peak in the same period.\n\nIn the last two weeks, Ethereum has seen nearly a 10% decline, and this downward trend has continued in the last 24 hours, with a 2.2% drop.\n\nThis bearish sentiment is reflected in the actions of Ethereum traders, who have been increasing their short positions, particularly after a significant development from Grayscale Investments.\n\nGrayscale’s strategic withdrawal\n\nGrayscale Investments recently withdrew its application for an Ethereum futures exchange-traded fund (ETF), a move that has significantly impacted trader sentiment.\n\nThis decision, made just three weeks before the U.S. Securities and Exchange Commission (SEC) was due to deliver its verdict, has led to an increase in short positions on Ethereum.\n\nTraders are currently betting heavily on further declines, with $358 million in short positions poised for liquidation if prices rise by just 4%.\n\nConversely, a 4% drop would only eliminate $237 million in long positions.\n\nThis withdrawal aligns with broader concerns about Ethereum’s regulatory status, particularly regarding its classification as a security and the fate of spot Ethereum ETFs.\n\nAs the decision date — the 23rd of May — approaches, analysts and market participants are growing increasingly skeptical about the approval of these ETFs.\n\nAccording to Polymarket, over 90% of participants believe that the spot Ethereum ETF will be denied.\n\nHow is Ethereum doing?\n\nBeyond ETF concerns, Ethereum faces issues with its overall usage and a lack of speculative interest, especially from short-term holders.\n\nJames Check, a noted crypto on-chain analyst, pointed out that Ethereum’s usage is so low that its burn mechanism cannot keep up with issuance to validators.\n\nThis sentiment was echoed by Glassnode, which highlighted Ethereum’s underperformance relative to Bitcoin due to a lag in speculative interest from these short-term holders.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nFrom a technical perspective, Ethereum’s price is expected to continue its downward trajectory until it reaches a swing low liquidity near $2,800.\n\nThis is because Ethereum’s price has recently touched a breaker block, and the next target is to hit the major swing low on the 4-hour chart."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOdzhzaUVsR29pMlgzV2RRRzU4d3ZjVUdHcmpEeDRFR0dqUnUwcmFsU0tUNVNEbk1RWDVQenpXR01lMUZhN1lpdHV3YUtwblltRFE3Y2RMWlRYQmNYa0VzTS1QTW1pWVRWc2M4RV8weEdFS3JrWTNpX0tScDJfNnE3ZmJoLUdsM09PWUdUNTVST0lfY2RDNkJfRTJuTmpXNkZ5QVJLUEFpT1E2Z2tPWXQxbTVGTk1sSEQ3bkhoc1VJSXFncldzQjVZM25zUzBnRWRRaWhXRHlndnRKZnZCRlY5Vjg4OHc3TlRETkpJUGJZZUfSAfYBQVVfeXFMTzFyZ2JqZWZDOTBFNnEtY2dtN1dVMU1CU2c2U1hrZUEtNXA0Vzk0Z09kX19reU5IZ205VUxmSG1Ja3JXZ3d1N01tQURzVWg2YjQ1ZzI2Sm9iOFV6Q2x0VEh3RXgxd3BCN2E5RE9jb0dzaGwtcktrYnd6cm9aZ0x6Z1VYaUQtV191ME9QWDhQc19sb1hheV9xUWNaQzZIb1EzZ0VkdEtlaXlIOG44cUpvM3Z2MmxQam5YRzhEOVVJWmk2eWZvZ2w1bjM4VVp3ZUlaSXc2Ujh1VkpfNzlqNmM1RG5BSHJSTHJQd1VUMFFOa1RlSF9pSFln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Until BTC flips $64,300, altcoins' bleed could continue - FXStreet",
        "content": "Bitcoin price could rally 20% if bulls make a stable move above $64,300.\n\nEthereum price is close to bottoming out with a 26% upside potential under wraps for ETH holders.\n\nXRP would be good for entry, safe rather once Ripple price reclaims 0.6700 as support floor.\n\nAltcoins are going through a rough patch as Bitcoin (BTC) price continues to conceal directional bias in the higher time frames. In the lower time frames, however, a flip of the $64,300 into support would be the redeeming feature to cauterize the bleeding seen among altcoins.\n\nThe altcoin market capitalization is still holding well above the $250 billion level, positioning itself for a future move to the upside, should BTC show strength. An interesting observation, however, is that while the Asian session has been trying, the European session continues to front run a sell-off in the New York (NY) session. This means a good NY session would bode well for the broader market.\n\nAlso Read: Altcoins in disarray as BTC conceals directional bias\n\nBitcoin price could be primed for 20% rally\n\nBitcoin price action is consolidating within two converging trendlines that slope downward as they gradually narrow the price range, effectively forming a falling wedge pattern. The target objective for this technical formation is a 20% move north to $76,116.\n\nNevertheless, this breakout may not be here just yet as momentum continues to fall as shown by the lower lows and lower highs on the Relative Strength Index (RSI). The Awesome Oscillator (AO) is also still in negative territory, typically signifying a bearish trend in the market and that the downward trend may persist in the near term.\n\nA break below $60,660 support could see Bitcoin price provide another buy opportunity below $60,000, or in a dire cause, slump all the way to $56,000 before a pullback.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls defend $60,660, Bitcoin price could use this level as the jumping off point for further upside, activating the bullish reversal pattern by recording a decisive candlestick close above $63,871 on the one-day time frame. A candlestick close above this level would invalidate the bearish thesis.\n\nAlso Read: Bitcoin price dips into $61K but large holders buy BTC ahead of 20% upside potential\n\nEthereum price is close to bottoming out\n\nEthereum price is withstanding the worst of the weakness seen in BTC, but this could end soon as the $2,900 support looks primed to defend. The RSI is defending against further downside, while the AO flashes green as it edges toward positive territory.\n\nA show of strength from ETH bulls could see Ethereum price recover. A stable higher high above the peak of the Monday trading session at $3,221 could instigate a 26% move north for the Proof-of-Stake (PoS) token to the profit target of $4,083.\n\nETH/USDT 1-day chart\n\nConversely, if Ethereum price slips below $2,900 and closes below it on the one-day time frame, it would invalidate the bullish thesis. This could trigger more selling, sending ETH to the $2,800 before a possible recovery.\n\nAlso Read: Ethereum may be gathering momentum for potential rally, Vitalik Buterin introduces EIP-7702\n\nRipple price must ascend beyond $0.67 for safe entry\n\nRipple price has recorded higher lows, reinforced by those on the RSI, suggesting a growing bullish trend. However, XRP will only be safe to buy once the price reclaims above $0.6700, levels last tested on March 15. Such a move would constitute a climb of nearly 30% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nHowever, if traders begin to cash in on the gains made since Ripple price bottomed out at $0.4188 on April 13, the trend could be reversed. Confirmation of this would be seen by a slip below the 50% Fibonacci placeholder of $0.4952 and ultimately a lower low below the May 1 bottom of $0.4782. This would invalidate the bullish thesis.\n\nAlso Read: SEC vs. Ripple lawsuit sees redacted filing go public, XRP dips to $0.51"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOajlnMzFvd2pud0Exc0pHOUxObi1nNUh0TjBiMzZWRFdQUDNyQy1PMDRBbU5sNDB6bWtEM2ZicFBiN0JRRDV0ZmVadDNxQm5RcUpfanFTZzYxZzBpeXV5Qzc5dV9VbUFHaC15aHpodTNHYWtxWm9ETXlEN2pMSlRYSHZITdIBiAFBVV95cUxNbzh2UVZGLXJQWjNxeDcxYkN5NnFOT0hUbnRhdGhjdTM1R2hkZkxUV2NJNVlfS29JZVNqOGlZcDRBMHA1Y2FoOWc0VTdkbE8tY09pemRLS2RjZ0ZsRmg3d05uQ1lRcktVbXVaQkVmX3VIYVlpQ1RyUXF5N1laT2R6NDJlbE5sZ1FW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum Client Geth Releases Advanced Live Tracer Tool - CoinGape",
        "content": "Marius Van Der Wijden, an Ethereum (ETH) developer, has just implemented a revolutionary feature into his cryptocurrency management system. Sina Mahmoodi designed the live tracer to trace real-time balance modifications in Ethereum and ERC-20 tokens across multiple addresses. Moreover, this solution grants users an opportunity to download full CSV reports for each address, thus making it a powerful tool for tracking asset movements.\n\nThis feature is an important improvement in cryptocurrency tracking. It promotes openness and offers crucial information that can be a reference point for users to make good financial decisions. The platform’s capability to provide such detailed information on asset movements is a testimony to Van Der Wijden’s innovation and customer-centered solutions.\n\nadvertisement\n\nEthereum Electra Hard Fork on the Horizon\n\nA recent development within the Ethereum community is that the developers are making great progress on the next consensus layer-focused hard fork, Electra. According to Coingape, the Electra specifications, which would include four essential Ethereum Improvement Proposals (EIPs), are expected to be prepared for a testnet launch by the end of April. Among these, EIP 6110 is of special significance since it is intended to improve the security and stability of the Ethereum network by altering the way in which validator deposits are handled.\n\nFurthermore, another change will be in the engine API, which will be introduced via EIP7002 based on triggerable exits at the execution layer, with additional minor adjustments currently being discussed. One more important proposal, EIP 7251, suggests raising the maximum effective balance of validators to 2048 ETH. Developers are discussing this feature, and it is not clear whether custom ceilings for partial withdrawals are necessary for validators with a balance of over 32 ETH.\n\nEthereum Price Volatility Confounds Traders\n\nIn the last 24-hours, volatility was seen in the Ethereum market. The cryptocurrency started trading at about 3,138, reached its peak in the middle of the day, and dropped to nearly 3,078 at the end. This market behavior in the second half of the day points to the bearish posture of Ethereum, which is an indicator of the sentiment of investors and the general market.\n\nThis trading conduct affirms that cryptocurrency markets are volatile. Predicting price movements for investors and traders remains challenging, and it touches on factors such as market sentiment, the global economic situation, and technological progress within the blockchain ecosystem.\n\nRead Also: Crypto Regulation: CFTC Chair Predicts More Crackdowns In 6-24 Months\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPekdzNUN6bFA0OFJ5NjF1dDlZN0V5c2JnQWJwcWVRSzdKdGYzQjNRdFRXeHhzSS1hclhLNUNXbW0tM2JxdmdvUVNPTEtoMmVvdHZxVU56YUNmSzdnMUtpZWJuYmJIalhuUDZ0NEdDUXVwb3d0bnRQdzc3aFBrZmhBYTlPTVk0ZXQxVURhSl90T1JscXBU0gGaAUFVX3lxTE51djJieG0xS3U5dDJlRWM1VzdydTVvS2d0OV96d09MY2tVYUhqdnBmeF81S1lsNV9JalRMdHhyZ2JYVFJ6QUlDWkRsb29pcXFwNW1FZXVmQlN3Wl9lTTR5M2JKdTk4TW1Mdk91TlRNVm83YkVpZUJvdHk5MVRwTzlIbTdjeVJ3OGZ2a3VhZW05cUpXd1hSWWJablE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum struggles around $3K as short positions surge: What now? - AMBCrypto News",
        "content": "ETH traded at $3k at press time.\n\nThe cumulative short liquidation of Ethereum rose to over $800 million.\n\nAfter experiencing a price decline on the 7th of May, Ethereum [ETH] saw more liquidations in long positions. Consequently, more traders opted for short positions.\n\nAs a result of this increased shorting activity, the price of Ethereum declined further, falling below the $3,000 price range during the trading session on the 8th of May.\n\nEthereum traders bet on price decline\n\nAMBCrypto’s analysis of Ethereum’s exchange liquidation map on Coinglass indicated a dominance of short positions at the time of writing.\n\nThe cumulative short liquidation leverage for the 24-hour period has risen to over $800 million.\n\nThis suggests that traders are increasingly taking short positions, indicating their expectation for the price of ETH to continue declining in the short term.\n\nFurther examination of the map revealed that the cumulative leveraged position for the last seven days has exceeded $1.7 billion.\n\nGiven the prevailing trend in the previous trading session, this current positioning by traders is not unexpected.\n\nEthereum long positions feeling the heat\n\nEthereum’s long positions have experienced more liquidations than short positions over the last three days.\n\nAMBCrypto’s look at Coinglass’ liquidation chart revealed that between the 6th and the 7th of May, longs exceeded $78 million.\n\nConversely, short liquidations, during the same period, amounted to approximately $18.3 million.\n\nThis trend persisted at press time, with long liquidations surpassing $7 million, while short liquidation volume stood at around $1.6 million.\n\nETH to fall deeper?\n\nAMBCrypto’s look at Ethereum’s daily timeframe price trend revealed a notable three-day decline.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nTrading at around $3k at the time of writing, with a decrease of less than 1%, the price movement indicated some level of volatility as depicted by the Bollinger Band.\n\nThis decline has further entrenched ETH into a bearish trend, with the Relative Strength Index (RSI) standing at 40, signaling a strong bearish sentiment."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQc3BJM2tRd29yWjNYRDVESlVyWE93Y3NXaFd4YU1hNlFfYXB1dkxVUTRvVFRYdGFOV2ZRa0xjR05pWXVMU2g2cm93QXhVWjh0QTB0T3V6V1daMzhFSlJnQ3VOSTlsYzhZbnBldy1RQkgzZW9WRjR4QW9kMUpXV1N4Y3hrS3FPNGVrRm9MZkVjb3RlMHhpT2QwZdIBngFBVV95cUxOR0RCZjJUX1BhWE5Lc08tN3J6NEg1NkhCWU9NTUJUMlZNWThnNk9URGhCVWlfdDFGbC1ZX0pYby1WSmhzOTBNZV9uRmhqS2hhR3UxeU1WMzNubURwMzhFOTBOSlhla2xnT1VxTXd6aWJDRzJLeElpMFpGVGhPZkEwV0pYbXIySkJVZWs4dU9IN2daSnBSbDBzbm5aU2dFZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "SEC Chair Gary Gensler Shares Vital Insights On Robinhood & Ethereum’s Future - CoinGape",
        "content": "SEC Chair Gary Gensler’s recent interview with CNBC has sparked a global frenzy across the crypto horizon. His insights on pressing issues such as Robinhood’s Wells notice and the Ethereum security lawsuit, which could potentially shape an ETH ETF, have captivated significant attention among crypto market participants.\n\nSEC Chair On Crypto Regulation\n\nIn his interview with CNBC today, Gensler stated that cryptocurrency is a small piece of U.S. markets. However, it is staged as an outsized piece of scams and fraud in the trading sphere.\n\nadvertisement\n\nGensler observes that a significant portion of the cryptocurrency field operates noncompliantly, breaching protections and security laws, which is a matter of concern. He also noted that the mainstream financial media tends to overlook the vast capital markets, valued at $110 trillion, and instead focuses on the more minor, more scrutinized part under regulatory authorities’ watch.\n\nSimultaneously, talking about Robinhood’s receiving of a Wells notice, CNBC spotlighted Vlad Tenev’s (CEO and Co-founder of Robinhood) post on X, which aimed to slam the U.S. SEC for stifling crypto innovation. Concerning this, Gensler’s attention was brought to Coinbase CEO and co-founder’s reply to Tenev’s post, stating, ‘ Welcome to the club.’\n\nThe Chair replied that the U.S. SEC is responsible for being a cop on the beat to ensure proper regulation surrounding entities offering securities trading services. The Wells notice is a testament to this and was hence issued to Robinhood. Meanwhile, Gensler also asserted that many tokens are securities by the law of the land, eyeing the issuance of a Wells notice to Robinhood while also adding to speculations surrounding Ethereum.\n\nAlso Read: Revolut Unveils UK Crypto Exchange Amid Digital Asset Surge\n\nGensler On Ethereum’s Security Status\n\nOn the other hand, when asked about the U.S. SEC’s view of Ethereum’s future status as a security, Gensler replied that investor protection remains the top priority, and refrained from offering a definite answer. Currently, American investors are not getting enough disclosure and intermediaries of this market, Gensler stated\n\nThese comments on Ethereum’s future status as a security have left a veil of uncertainty, potentially impacting the launch of an ETH ETF. In the interim, Gensler also rationalized allegations of misleading congress in his interview with CNBC.\n\nAlso Read: Just-In: Shiba Inu (SHIB) Bags Nexo Listing, Will SHIB Price Rally\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQNVpTaDVqcmFKSXFGZXE1U3J5TGtoMFRzeWpaTHJoMlNqZEpJUnZjSGxRQjRfdVM2YVQwdG5WY3RrWF9GdjF0MEpMbVdlVTNUeXl4MFRZYkl6Q0FWQThUTmNZaElKcjRKUjItcjFfbmprVWR4MVR6RlVWX1I3MnNGRXAyVlhGQdIBiwFBVV95cUxQcl93Y0FQZy16c2laY0QxRkhnWG1Ta2lIVlRCaUxoQlVFMU10YW1TUmlpRWZKOGtoUDJkUnZ0Ukg5VWVKRE1BLXQtZWRmbHdMQmp3WGJUV1UtVkk3Ny1Lc0tnSHJ6OTktbGV6WmV4a0E2OS1tM1VabWMzNGVKRjVROHlncmtjVDZHRTE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Solana NFTs revive, beat Polygon: What about Ethereum NFTs? - AMBCrypto News",
        "content": "In the last 24 hours, SOL’s NFT sales exceeded $3 million\n\nEthereum continued to dominate Solana and Polygon in the NFT ecosystem\n\nSolana [SOL] witnessed some traction in its NFT ecosystem last week as a few popular collections migrated back to SOL.\n\nDoes this mean that Solana’s NFT ecosystem is poised to witness further growth in the coming weeks?\n\nSolana outperforms Polygon\n\nThe NFT ecosystem boomed last week as sales across multiple chains increased. AMBCrypto’s look at NonFungible’s data revealed that the total number of NFT sales last week increased.\n\nThe total number of unique sellers also went up during the same time.\n\nWhile the market grew, Solana onboarded popular NFT collections like y00ts and DeGod, which had migrated to other chains earlier.\n\nTo be precise, y00ts returned from Polygon [MATIC], while DeDod left Ethereum [ETH]. The inclusion of such top collections helped SOL’s NFT space.\n\nAs per a tweet from SolanaFloor, SOL’s NFT sales reached $25 million in the last seven days. The number was commendable, as Polygon’s weekly NFT sales stood at a mere $8 million.\n\nNonetheless, Ethereum remained the top player, as its weekly sales volume was $48 million, as per Cryptoslam.\n\nAMBCrypto’s look at DappRadar’s data revealed the top-performing collections on Solana. Both y00ts and DeGods made it to the top 5, along with Mad Lads, Frogana, and SMB Gen 2.\n\nIs Solana still ahead of Polygon?\n\nTo see whether Solana continued to dominate Polygon, AMBCrypto checked their last 24 hours’ performances. As per our analysis, Solana continued to outperform Polygon.\n\nWhile Polygon’s 24-hour sales volume stood at just over $1 million, SOL’s number touched $3 million.\n\nHowever, it was interesting to note that despite high sales volume, SOL’s total transactions dipped by more than 10% while Polygon increased by 17%.\n\nNonetheless, they were both still considerably behind Ethereum. The king of altcoins’ 24-hour sales volume exceeded $6 million, which was a 17% increase from the previous day.\n\nEthereum’s total number of buyers, sellers, and transactions all increased by 9.8%, 8.9%, and 12%, respectively, in the past 24 hours.\n\nRealistic or not, here’s SOL’s market cap in ETH terms\n\nSOL turned bullish\n\nWhile the blockchain’s NFT space flourished, its native token’s price action also turned bullish. According to CoinMarketCap, SOL’s price increased by more than 14% in the last seven days.\n\nIn fact, in the last 24 hours alone, it surged by 6%. At the time of writing, SOL was trading at $155.92 with a market capitalization of over $69.7 billion, making it the fifth-largest crypto."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNdFBZbm1YekdlTS01b192aGlqVjZaN2NKbTZHUFVJR2M5VWdBUHl6Sjh3Q3JyZ1lPaENOV2xBdGpsSXVod3NfdE54MkJSZEpoblVZX0V0WnZOSzZqc2lrRVgyQmQ5amVxZERram9YdkktTE9FRllNYnhhYlVOVjVYWHZ6ZGNVcW1KblHSAY8BQVVfeXFMTS1WQVhlTG1tZ3VSUWRCTjZGeEt2WHZlYUVtNUhTVm1Tc3lpSWw1NlI4VHJkUDFMTTZ0TzZwMW1Gc0NMemd5dnZ3azNzNXVFQVhOcHFlZ2pqanBQQVZ4ZmhWTzU0SXp6VHMtNnJZMWppS3Buc3VMaHpKLVpQMmZ0V1luMTVVT2ZCVnl2alVZLVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum: DAI stablecoin takes the cake in April, more inside - AMBCrypto News",
        "content": "Stablecoin market cap grew to $158 billion, a 4.76% increase.\n\nDAI boost Ethereum Stablecoin trading volume\n\nDespite the broader cryptocurrency market experiencing recent downturn, Ethereum [ETH] has shown resilience, not only in market performance but also within its stablecoin sector.\n\nIn recent weeks, while Bitcoin has seen modest gains, Ethereum has also posted slight increases.\n\nMore notably, Ethereum has witnessed a significant surge in stablecoin volume, largely driven by the decentralized stablecoin, DAI.\n\nThis surge highlights a growing trend of reliance on stablecoins during periods of market volatility.\n\nApril marked a record-breaking month for stablecoin transactions on Ethereum, surpassing all previous records.\n\nThe total volume of stablecoins traded on the network saw an unprecedented increase, with DAI playing a pivotal role.\n\nThis spike in activity is attributed to the use of complex transactions involving Mechanized Extractable Value (MEV) and flash loans, which have become increasingly popular for their ability to maximize trading efficiency and liquidity.\n\nDAI: A catalyst for Ethereum’s record volumes\n\nDAI’s involvement in sophisticated financial maneuvers has significantly contributed to the increased transaction volumes.\n\nThese transactions often utilize flash loans—short-term, uncollateralized loans returned within the same transaction—which have elevated the volume figures reported.\n\nFor instance, as shown on Etherscan, one transaction alone was responsible for injecting nearly one billion dollars into DAI’s volume, illustrating the scale and impact of these operations.\n\nOver the month, DAI’s volume reached roughly $636 billion, constituting the majority of Ethereum’s $1.2 trillion total stablecoin volume for April.\n\nThis marked a more than threefold increase from March, showcasing DAI’s growing importance within the Ethereum ecosystem.\n\nNotably, the surge in DAI’s volume is not just a reflection of increased usage but also of the growing sophistication and integration of financial technologies on the blockchain.\n\nImplications of stablecoin growth\n\nThis increase in stablecoin activity comes with significant implications.\n\nWhile the inclusion of flash loan transactions in volume calculations might inflate figures, the underlying trend indicates robust activity and adoption.\n\nFurthermore, DAI’s supply growth—adding approximately one billion dollars worth of tokens since early March—mirrors the increasing demand and confidence in stablecoins as a hedge against market volatility.\n\nThe sustained growth in stablecoin volume, particularly in DAI, led to an increase in the overall market cap of stablecoins in April.\n\nAccording to AMBCrypto’s recent report, ​in Ap​​ril, stablecoins experienced a remarkable growth surge, contradicting the general market downturn and marking a seven-month consecutive expansion.\n\nIs your portfolio green? Check out the LINK Profit Calculator\n\nThe sector’s market capitalization increased by 4.76%, reaching $158 billion, with a significant addition of $27.1 billion in value year-to-date.\n\nThis growth is notably the first to occur during a market retreat, driven by heightened inflation in the U.S. and increased geopolitical tensions, citing a CCData report."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORThxb1ZNeEgzSnNxTzlSRHBoc2RjTjZIMDlxVTc1T296UjVtSU01SkhaSUV2ajlSdUlqTXlJdHdOcXdERXc3VlFIQjNENFJtcDJIVFhpbzZmWkdBYUFZek44dVh3S2FlTXlvNWJwY0VHN0hnaG9PME9DV3JWZUFzbjNPUWxmRTFCdjViaWZBSFhuVWJUc2lUNmM2dGM5ZS1IQVlZcC16ZHdiaXltNnVzcU5DRVRGMlpCcTdmVHRiSjZqVWVQMmdiZXFkSk0wb3h0dEVLME91VEjSAd4BQVVfeXFMT2hTUE13eUlOcVJybXZpZWVEVjZoNGw4dE5RdzY0Zmg5SzJrT2V2OGVZME5LMFlsbElndDBKSGxTTzdsd3pfZW1lNnJtQlFwSjJDZzB4UDFxT01sU3FTTFVTNGdjRXU4VGFDYWsxaEdUNmtoWnJYUG9WV2ZWZ0lsWGNPTG4wWmoySjFZbHc3d1dvSlduSklqU3JZMFF5eldQc0NzQVZLQmxSb3dkdEQxRm5makJyUW1NdmJMSGpkN0ZkaTNDejYyQ21rTmdDZm9xZDdVLUdNZkF5LUZpbFpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Bitcoin & Injective – American Wrap 08 May - FXStreet",
        "content": "Injective (INJ) had a market capitalization of close to $4.5 billion at its peak in March 2023. At nearly half its market cap, the DeFi protocol has proposed a solution, likely to reinstate INJ to its former glory through higher relevance and fresh capital injection.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074. The Ethereum Foundation also appears to be dumping ETH tokens again with a recent transfer.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOdVg4Y0hfV1dLNDU1RGZtNGZLanctVVBzek9Semh4OHJLQ1I3YVRkNzBwMjJ5dk1NRUdyZnIwYWx0RmkxQjFMTWxhWUhTSUJRS0FySzZCN3FfZEFXY2J2WnlFLVktMjM3bWZLR0htbjEwVDcwQ0FGRnJWWDFyNzNHbmo3d0psTWRWTk52ODFtM21WR2FZMkVnWmJRTzVxWGPSAaQBQVVfeXFMUDlFb2hiVEpobS1BQk1PbW52UzQ2aTVfQlUyMkhtenBSOXVRY2ViTkVGLU5fMkdMMjZNR1BPOFBPOVFleEV5LUdwc3JEUlhRcG9NWXR6MzRNRktSUTZQTlJjdjczLVYxWWVuUEk3WHNnNlBveG02cldWVGNvM0tzTFhyNG1oZWFWUC1rOHVOQ0VCZUwxdlNpUkk1WktkTVJIVVI2aFA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Client, Near Protocol, EigenLayer Fast Finality Layer Layer Goes Live - CoinGape",
        "content": "Nethermind, an Ethereum Client, has just declared its participation in NEAR Protocol’s Fast Finality Layer (NFFL) initiative. This union comes at a crucial time for decentralized applications (dApps) and smart contracts when the blockchain industry is experiencing a rollup in Layer 2 user adoption in the Ethereum network. Nevertheless, though promising advances in scalability and efficiency have been achieved, challenges such as liquidity fragmentation and high finality times remain that impede user experience and innovation.\n\nIn response to the demand for faster transaction finality and increased interoperability, NFFL is an innovative infrastructure layer enabled by NEAR Protocol, together with Ethereum Client Nethermind and EigenLabs. NFFL aims to ensure rapid transaction finality on Ethereum Layer 2 rollups and beyond, removing the inefficiencies of today’s optimistic- and ZK-rollup solutions. By harnessing the security features of the Ethereum network and the validator guarantees provided by NEAR Protocol, NFFL makes transactions final in a matter of seconds, providing a paradigm shift for decentralized finance (DeFi) and blockchain-based applications.\n\nadvertisement\n\nNear Protocol NFFL Enhances Blockchain Interoperability\n\nFast cross-rollup communications support and defragmentation action on liquidity are core pillars of the NFFL initiative. NFL, by optimizing the transaction process and reducing waiting times, will enable developers to design apps that can smoothly integrate several Layer 2 solutions without losing speed and security. This improvement not only improves the user experience but also promotes innovation in the blockchain space, enabling developers to create new opportunities in DeFi, gaming, and other decentralized applications.\n\nAdditionally, NFFL’s focus on chain abstraction fits into the bigger picture of simplifying user interactions with blockchain networks. Through an infrastructure layer that makes transactions quick, secure, and interoperable, NFFL is fueling a world where applications and assets can roam the blockchain ecosystem. The fact that such an integration is seamless in a wide range of platforms acts as a unifying factor. It simplifies the process of cross-chain transactions, making the blockchain community a more accessible and unified community.\n\nNEAR Price Decline Amid Launch of NFFL\n\nDespite the significant strides made by NEAR Protocol through the launch of the Fast Finality Layer, the project has faced a price decline of 6.16%, with NEAR price trading at $6.96. While this decline may raise concerns within the cryptocurrency market, it is essential to acknowledge the long-term implications of initiatives like NFFL in scaling the Ethereum ecosystem and advancing the vision of chain abstraction for Web3.\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQYkpoSVNGbGZENXpsMkVHYUVqS3d2ZHN3OXN0QktLbmh0VnJPcUF1a1F3OHNzVkxGb01lRGhPdU9CeVR0dVlhaHdhOEotV0t1a1FDZjJHUC1iVDdZQUszZUc4N3oteXRRVWpUS0RCdGZDYXpncG1EZWxCdl9mRjB1VkhaYTY2NWpfSVhwZUhDbkJ2UdIBlwFBVV95cUxPSVE5Rkp1M0hjMzl5WTVkWEZXVVVQV0xhZHVFaS1McEozcEt1ZlU2ZF9UcXdZQWxndXByYm9FUHIyWVBBV1c0MlQxTngzRXd6WkFVa0xFenFnRzJlS0liYW1KOGViMGxyaGNWX2hSNUtETEZhZ0ZaYVRDWWdCajlzRGNfRVkwbnlXZTZMOFQ0dWZ5RG9aSnVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Just In: SEC Delays Decision on Invesco Galaxy Ethereum ETF to July - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) has again announced that its decision-making process for the Invesco Galaxy Ethereum ETF will be further delayed. The SEC is now planning to issue its decisions by July 5, 2024. Such an extension allows the regulatory body to make the required investigations in detail and adequately solve the questioned areas. This move, however, is a continuation of the recent pattern of postponement of the decision-making on spot Ethereum ETF applications from leading financial companies.\n\nSEC Extends Review of Invesco Ethereum ETF\n\nThe latest filing by the SEC stated the necessity of more time to analyze the rule change proposal by the Invesco Galaxy Ethereum ETF properly. The SEC is thus attempting to ensure a thorough review of the many intricacies involved in the offered approval. This action is taken against the background of a series of delays that have been bothering many other companies that seek similar approvals, like Grayscale and BlackRock.\n\nadvertisement\n\nThe SEC’s tread-softly strategy mirrors the general regulatory ambiguity of cryptocurrency products. Though Ethereum Trust of Grayscale is already registered, complications persist, as revealed earlier this year by the SEC’s request for additional public commentary. This repetition of delays highlights the balancing act that financial regulators face as they try to strike a balance between regulation and the increasing interest in cryptocurrency investment products.\n\nDoubts Grow Over Ethereum ETF Approvals\n\nThe continued delays have, however, significantly dimmed hope within the investment community that Ethereum-based ETFs are about to become a reality. Some of the key market analysts, including Eric Balchunas of Bloomberg, have made substantial changes to their forecasts, and now the probability of approval by the end of May has fallen from 70% to only 25%. This change in mood is reflected by the broader market, which remains hungry for such inventive financial products while being somewhat restrained by regulatory uncertainty.\n\nAdditional doubt from financial analysts such as Michaël van de Poppe and MicroStrategy CEO Michael Saylor has further clouded the current situation. Their views, resonating with a large segment of the crypto investment community, imply a cautious regulatory posture regarding the approval of Ethereum ETFs in the short run. This prudential view emphasizes the regulatory barriers that still need to be overcome in the market for securities based on cryptocurrency.\n\nThe repetitiveness of SEC delays affects Invesco Galaxy and creates an example for other firms waiting for approvals of their ETFs. With VanEck and Ark Invest decisions due later this month, all eyes are on the first clue of any change in the SEC’s approach. The continued postponements pose the question of what the future panorama of cryptographic investment products will be like and the probability that the market will widely accept digital asset ETFs.\n\nRead Also: Ethereum Client Geth Releases Advanced Live Tracer Tool\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPeGotVHd6bGtHSG5PWWh1X3l5WDE5azFqbUtQSzFkNkwweFBxclpnS0JWTDRqM3JjbU1hRDRRLVRtSVlER1pMOE5SYi1OVGV4eXYtbGVlRVVBaFRJWmJSX3o0QWNTSlpjb0pJend2UHU0b2g4cXl1c3pCUEMwSk9URlM2M2tDdTVXdzZz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "The first modular L1.5 for Ethereum: The Ghost layer - Cointribune EN",
        "content": "Tue 07 May 2024 ▪ 4 min read ▪ by La Rédaction C. ▪\n\nThe modular Layer 1.5 “ghost layer” is intended for both institutional and retail use cases and is constructed to give public blockchains compliant privacy.\n\nIn order to allow users to store their assets privately and facilitate omnidirectional value transfer, the ghost layer makes use of a zk-based system and 0VM. Additionally, it enables users to create private access channels into various blockchain-operating execution layers to employ pre-existing apps.\n\nNovachrono, the founder of Silent Research Labs, said in a tweet that,” if you create a system where the processing of the state(computation) and storing of the data depends on its own nodes you can call that a Layer 1; but if you create a system whose state is processed by itself but the validity of the data is stored elsewhere, it becomes a layer 2;— however if you create a ledger whose state is decided by the base ledger but the computation is stored elsewhere- you can call it a Layer 1.5”.\n\nThe concept of privacy has been ingrained in cryptocurrency since its inception, and the industry as a whole has been searching for a highly effective, modular, and fully compliant privacy system; nevertheless, most architectures and system designs are unable to satisfy practical requirements and use cases.\n\nIn 2023, Silent Protocol unveiled EZEE as a solution to the issue of state denial, also known as the lack of a “global shared state,” and to provide a fully detachable architecture for functional privacy.\n\nDevelopers are unable to create an ecosystem of applications around a framework without composability, which results in isolated systems. To prevent malicious users from abusing the system, Silent Protocol also developed silent compliance VM, a decentralized selective revealing protocol.\n\nThe silent compliance virtual machine powers the ghost layer, which is an implementation of the EZEE architecture designed for the Ethereum environment.\n\n“The ghost layer is rooted out of Ethereum supporting Ethereum assets, but achieves modularity not because it captures value vertically but enables horizontal composability on different chains,” said Silent cofounder Isa Sertkaya.\n\nIn order to update the system’s state forward, Silent Protocol also uses 0VM. However, instead of utilizing 0VM to verify the update, it uses the base ledger and zksnarks to validate the state.\n\nThe goal of Silent protocol is to create a compliant, modular framework that will enable institutions to use Ethereum in a secure, confidential manner, just like they do now.\n\nWith the same liquidity available on the mainnet, developers of various blockchains can convert their current applications into 0dapps, or privacy-preserving apps.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPcHhGV3JRQ0hPdTJqN2I0NVBMYjdleFVoX1JIOXQ5T3VWOVE5NDNHQ2VBazljSlp0d2hYOGxIRXVTM3dZRlQyVXJEZkFBaW9hcjgxVlVvVHU2aVlBWUV2RG5RaDFudkRiTy1Sc2U1aDROcTBrVUVZdGVzd2F3UlJNcWZoLWk4Vi1XNXAyczNOZzZGdkFjLXVCSlpJd0xCQlE4Z3hkSGZLWVlrdU5fMkpnN1V3THd4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Will BNB Hit New ATH Soon? Crypto Whales Load Up on Ethereum (ETH) and Raboo (RABT) - Techpoint Africa",
        "content": "Want to strategize how to invest in crypto? Go whale watching! By emulating the crypto whales, one stands a better chance at investment success than most. With the BNB ATH within reach, whales are feasting – but not just on BNB. Ethereum is seeing a ton of crypto whale activity and more. The new meme-fi AI token Raboo is seeing a crypto whale feeding frenzy on its presale as tokens are gobbled up at $0.0042.\n\nBNB (BNB): BNB ATH comes closer – when will it reach $700?\n\nSo far, yet so close. The BNB ATH (all-time high) was $686.31 in May 2021. Currently, BNB is trading a mere 14% below that. BNB briefly broke $600 in March but remains stubbornly in the high 500s. That extra 15% push it needs to get to BNB ATH seems just out of reach. Or is it?\n\nApril was a horrible month on the market, and crypto whales saw the prices plummet before swooping in and taking advantage of the market correction. But ‘when in doubt zoom out’, and BNB climbed 96% in the last three months. Suddenly, the BNB ATH doesn’t look that far off and may even break the mythical $700 mark within the next month.\n\nEthereum (ETH): Crypto Whales Lifting Ethereum Tide\n\nEthereum is the 2nd-ranked token for a reason, but Ethereum has its challenges. It is slow and expensive to operate. The result of this is that Ethereum does not respond as fast to market forces as the rest of the cryptosphere, and while other coins are threatening to reach their ATHs, Ethereum is struggling to make it back to $4k, a spot it briefly held in the second week of March before April left a bloodbath.\n\nBut Ethereum seems to have found support at $3,064. With 24-hour volumes reaching $11 billion, Ethereum is creeping upward as crypto whales return to the largest layer 1 solution in the cryptosphere.\n\nRaboo (RABT): Crypto Whale Presale Feast\n\nIt happens daily: a new coin nobody has heard of is on the market and showing a massive growth of several thousand percent, only for investors to wonder where this new coin came from. The crypto whale investing secret: ICOs & presales. The true crypto whale not only hunts on the open markets and exchanges but also searches for ICOS, where tokens are available at a set price. These tokens then explode, and massive returns are made. This is why the crypto whales flock to Raboo.\n\nRaboo is a new meme coin luring all the crypto whales with its combination of solid financial foundations and internet-culture allure. But with an AI-driven turbo engine. Raboo has already collected over $1 million in presale liquidity, and looking at its tokenomics, it’s easy to see why this is such a lucrative investment opportunity.\n\nConclusion:\n\nCrypto whales are acquiring tokens right now, as they know the market can only go up from here, driving up prices in Ethereum and may even set up a BNB ATH. However, the wise ones are now participating in the Raboo presale, waiting for the massive returns when Raboo (RABT) brings a 100x return when it lists on the markets.\n\nYou can participate in the Raboo presale here."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE9URG5GX0ppSWxWZURuN0NsOUJDNGUyR2tuT29mMnVKSHQtaU00SFlQZVpSMm9FRzBUd3NWV1RGMUlIOW15SUJUanoxR3FaU0Q5T3B2NVF1QzZqUUxzdkJ0SENvSDM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Crypto Synthetic Assets Explained - LCX",
        "content": "Traditional vs. Crypto Synthetic Assets\n\nTraditional assets are tangible or monetary items traded on established financial markets, such as equities, bonds, and commodities. Crypto synthetic assets, on the other hand, are digital representations based on blockchain technology that are designed to mimic the value and performance of conventional assets.\n\nTraditional assets are tangible or paper-based, whereas crypto synthetic assets exist solely in digital form on blockchain networks. Despite the fact that crypto synthetics have advantages over traditional assets in terms of accessibility, liquidity, and programmability, they come with their own risks and complexities.\n\nTraditional Assets Crypto Synthetic Assets Nature Physical/Financial Digital Market Accessibility Conventional DeFi Ecosystem Ownership Physical Ownership Digital Ownership Liquidity Limited High Liquidity Programmability Limited Control Smart Contract Flexibility Regulatory Oversight Stringent Evolving Regulation Custodial Requirements Often Required Variable Counterparty Risk Centralized Decentralized Transparency Varies On-Chain Transparency Asset Variety Limited Range Wide Range of Assets Accessibility To All Limited Access Global Access\n\nTypes of Crypto Synthetic Assets\n\nCrypto synthetic assets appear in various forms, like synthetic stablecoins, tokenized commodities and equities, leveraged and inverse tokens, and yield-bearing synthetic assets.\n\nSynthetic stablecoins\n\nSynthetic stablecoins are digital tokens designed to replicate the value and stability of fiat currencies, such as the United States dollar or the euro. They provide a method for exchanging products and services and storing value in the cryptocurrency ecosystem without being subject to the volatility of cryptocurrencies. Developed on the Synthetix platform, sUSD is an example of a synthetic stablecoin. It seeks to provide users with access to a stable digital currency whose value corresponds to that of the U.S. dollar.\n\nTokenized commodities and equities\n\nOn blockchain networks, tokenized commodities and equities serve as digital representations of physical assets such as gold, oil, stocks, and other commodities. These synthetic assets enable the fractional ownership and exchange of conventional assets in a decentralised manner. sOIL, which is also developed on the Synthetix platform, is an example of a synthetic asset that monitors crude oil prices. Without actually possessing any oil, investors can become more exposed to price fluctuations.\n\nLeveraged and inverse tokens\n\nSynthetic assets, known as leveraged and inverse tokens, are developed to amplify or counteract the price changes of an underlying asset — inverse tokens profit when the underlying asset’s price decreases, while leveraged tokens magnify profits and losses. For example, BTC3L (Binance Leveraged Tokens) aims to generate daily returns that are three times greater than Bitcoin’s (BTC) price. If Bitcoin increases by 1%, BTC3L should increase by 3%.\n\nYield-bearing synthetic assets\n\nWithin the DeFi ecosystem, yield-bearing synthetic assets offer holders the opportunity to generate passive income through staking or lending. cDAI, created by the Compound protocol, is an example of a synthetic asset. Dai (DAI) stablecoins can be used to participate in lending operations and collect interest on the Compound platform. Since cDAI accrues interest to holders over time, it qualifies as a yield-bearing synthetic asset.\n\nApplications of Crypto Synthetic Assets\n\nTraders pursuing increased profits, investors diversifying their holdings, and DeFi enthusiasts engaged in yield farming can utilise crypto synthetic assets.\n\nTrading and investing opportunities\n\nCrypto synthetic assets provide access to numerous trading and investment opportunities. They permit traders to engage in leveraged trading, thereby increasing their exposure to market fluctuations and potentially generating greater returns (or losses) than they could with conventional trading. Moreover, synthetic assets encompass a vast array of underlying assets within the crypto ecosystem, such as stocks and commodities, thereby providing investors with a simple method to diversify their portfolios.\n\nYield farming and liquidity provision\n\nUsers who stake cryptographic synthetic assets in DeFi protocols can engage in yield farming, earning additional synthetic assets or governance tokens for actively participating in liquidity provision and DeFi operations. Additionally, synthetic assets considerably increase liquidity pools and the overall liquidity of DeFi platforms, which is crucial for facilitating trading, lending, and borrowing within the DeFi ecosystem.\n\nRisk management and hedging strategies\n\nSynthetic assets provide effective risk management and hedging instruments. Traders and investors may employ inverse synthetic assets as effective hedges to safeguard their portfolios against declines in the underlying assets. Additionally, synthetic stablecoins offer a decentralised alternative to conventional stablecoins, safeguarding the value of assets against the inherent volatility of the market.\n\nRole of DeFi in the Creation and Trading of Synthetic Assets\n\nDeFi democratises finance by upending established financial systems and increasing global financial inclusion by enabling users to create, trade, and diversify their portfolios with synthetic assets.\n\nThe creation and trading of synthetic assets are crucial to the transformation of the conventional financial environment, and DeFi is a key participant in this process. DeFi platforms revolutionise the way we interact with financial instruments by leveraging blockchain technology and smart contracts to facilitate the issuance, creation, and trading of synthetic assets.\n\nDeFi improves accessibility and productivity by eliminating the need for intermediaries. By collateralizing cryptocurrencies, users can issue tokens that represent the value of real-world assets such as stocks, commodities, and fiat currencies.\n\nSecond, the open and permissionless design of DeFi encourages innovation by allowing programmers to experiment with various synthetic asset designs and trading strategies. This innovation has democratised access to international markets by giving consumers access to a vast array of assets around the clock.\n\nDeFi platforms provide liquidity pools where users can trade synthetic assets without difficulty. These systems encourage yield cultivation by rewarding users for monetary donations and ecosystem participation.\n\nAdvantages of Crypto Synthetic Assets\n\nCrypto synthetic assets offer a plethora of benefits, including diversification, leverage, engagement with DeFi, liquidity enhancement, and risk mitigation.\n\nCryptographic synthetic assets offer numerous advantages to the digital finance sector. The ability to provide access to a variety of assets, including traditional stocks, commodities, and currencies, is the most significant of these benefits because it enables users to seamlessly diversify their portfolios within the cryptocurrency space, thereby reducing risk and enhancing investment strategies.\n\nThese assets also provide access to leverage, enabling traders to increase their exposure to asset price volatility and potentially generate greater returns. They play a crucial role in DeFi, allowing users to actively participate in yield farming and liquidity provision and receive rewards for their efforts.\n\nIn addition, synthetic assets serve as the basis for liquidity pools, thereby enhancing the overall liquidity of DeFi platforms — a crucial element for facilitating efficient trading and lending activities. These resources also serve as indispensable risk management tools, equipping consumers with the knowledge they need to safeguard their investments against unpredictable price fluctuations.\n\nChallenges and Risks Concerned With Synthetic Assets\n\nWhile synthetic assets offer novel opportunities and solutions, they are not devoid of challenges and dangers, such as smart contract vulnerabilities, liquidity issues, the unpredictability of regulations, and oracle-related issues.\n\nThe use of synthetic assets in the cryptocurrency and blockchain industries involves a number of hazards and concerns that must be carefully considered. One of the primary concerns is the possibility of smart contract vulnerabilities or exploits, which could result in significant losses. In the infamous DAO attack of 2016, for instance, a smart contract vulnerability led to the seizure of approximately $50 million worth of Ether (ETH), highlighting the risks associated with these complex financial instruments.\n\nAnother concern is market liquidity, as some synthetic assets may have less liquidity than their real-world counterparts. This could lead to price manipulation or slippage during trading, threatening the market’s overall stability.\n\nIn addition, regulatory supervision remains a major concern as governments around the world struggle to define and regulate these unique financial products. The continuing legal disputes and regulatory changes involving stablecoins like Tether (USDT) provide an example of the possible legal difficulties that synthetic assets may encounter.\n\nIn conclusion, an excessive reliance on oracle systems, which grant smart contracts access to real-world data, poses security risks. For example, if an oracle is compromised, it may provide erroneous information, which can affect the utility and value of artificial assets that rely on it."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOQlZ5TEhSbFZkQUhCeXZIbW1ON2xCaEFoZ1dWSE1GcF95VDJiYjEwa0h2RDdxSWw2ajVzeU5Qdm9KQ0hFdzlKdWpVSGlOY0E5TEpzMkkxYnZXa1I0UHdSYUlWdUR1NVZ2VTkzZ0hEQldHYUJaVmZyZHZqWGJUeUFCX053a3QwOU5MUGVseXN2SmxBNWlRVjVFUVVna1RfRG5zYmsxNVBPS0lqU0tuM0s1OEY1UVpMSEMxV2R5c2dyeUotU2JlWGZQV3hVa203VTBTUHliT2dNeDdTNFB4OFZBLUxFc3Rwbmt4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Continue To Slip: Analyst Says King Crypto Network Fundamentals Indicate 300% Upside, Could Top Between $250K-$275K - Benzinga",
        "content": "Leading cryptocurrencies saw a decline on Wednesday, extending the run of losses that started as the week began.\n\nCryptocurrency Gains +/- Price (Recorded 8:45 p.m. EDT) Bitcoin BTC/USD -1.94% $61,407 Ethereum ETH/USD -1.08% $2.985.73 Dogecoin DOGE/USD -3.96% $0.1446\n\nWhat Happened: The world's largest cryptocurrency, Bitcoin, dipped below $62,000 during the day, taking its week-to-date losses to over 6%. Popular meme coin Dogecoin witnessed a steeper decline, down more than 14% since the start of the week.\n\nThe price drop triggered liquidations worth more than $140 million in the 24-hour timeframe, with nearly $100 million in long positions getting wiped out. Bitcoin liquidations topped $37 million.\n\nSurprisingly, the number of traders taking bullish long positions on Bitcoin spiked dramatically, exceeding those gunning for Bitcoin's price decline.\n\nBitcoin's Fear & Greed Index flashed \"Greed,\" reflecting a degree of FOMO in the market, and a potential surge in buying pressure.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 8:45 p.m. EDT) Kaspa (AIOZ) +8% $0.1208 THORChain (RUNE) +6.76% $5.75 Toncoin (TON) +3.67% $5.88\n\nThe global cryptocurrency market cap stands at $2.27 trillion, declining by 1.34% in 24 hours.\n\nThe U.S. equity market was a mixed bag on Wednesday. The Dow Jones Industrial Average rose 172.13 points, or 0.44%, to close at 39,056.39 points, extending its winning run to six straight sessions. The S&P 500 dropped 0.13% during the trading hours, ending at 5,187.67 points. The tech-focused Nasdaq Composite slipped 0.18% to 16,302.76 at the closing bell.\n\nThe yield on the 10-year Treasury rose to 4.496% as of 9:23 p.m. EDT.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: According to on-chain analytics firm IntoTheBlock, the correlation between cryptocurrencies and traditional markets, including equities, was closer to zero.\n\nBitcoin's correlation with the Dow was 0.25, while with the S&P 500, it was 0.40. This suggested that both asset classes were moving on separate wavelengths.\n\nThe 30-day correlation of BTC & ETH with traditional markets and commodities is currently close to 0, meaning crypto is doing its own thing right now.\n\n\n\n🔗https://t.co/Wx8RxQwatF pic.twitter.com/8aQqAdwNQz — IntoTheBlock (@intotheblock) May 8, 2024\n\nPopular cryptocurrency trader Elja highlighted that Bitcoin was undervalued relative to its current network fundamentals.\n\n\"Bitcoin’s current network fundamentals indicate a 300% gain from the current level. This means that the BTC top could be somewhere between $250,000 and $275,000.\" Elja stated.\n\nIs #Bitcoin Severely Undervalued?\n\n\n\nBitcoin's current network fundamentals indicate a 300% gain from the current level.\n\n\n\nThis means that the BTC top could be somewhere between $250,000 and $275,000.\n\n\n\nThe cycle is not over yet. pic.twitter.com/j2tW6v68sH — Elja (@Eljaboom) May 8, 2024\n\nAnother crypto expert, Benjamin Cowen, mentioned that the market was far off from the alt season—the phase where traders take profits from Bitcoin and invest them in altcoins.\n\n\"A macro BTC dominance uptrend, which is what we have been in, suggests that this is not alt season, nor has it been. This chart shows the last alt season we had was in 2021.\"\n\n\"Alt Season\" is when #BTC dominance craters, as people take profits from BTC and put it into altcoins\n\n\n\nA macro BTC dominance uptrend, which is what we have been in, suggests that this is not alt season, nor has it been. This chart shows the last alt season we had was in 2021 pic.twitter.com/KtfWMPTXWw — Benjamin Cowen (@intocryptoverse) May 8, 2024\n\nPhoto by CMP_NZ on Shutterstock\n\nRead Next: Bitcoin Retail Interest ‘Not Coming This Bull’, Warns Trader"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNR0xmUENEaXdHY0tjQ1ZKWHM5Q1duYUpFVWZHa3pvSU5zYzhfNVRwRE9ycm5lV2Q0REdUTUZRbHBrTVl3NWpkX2dpM3ZtendyVjU5OEM4QzJTWXZXM3RsVDJmY1J4cmp0Nm5hMDVJbl82MEpjRXFaVDdDMFVQSU1KQ3h1dF9Xbkh4ZG51SdIBkgFBVV95cUxOcjBaay1aMnBGaWZUMzgtWmptMUk0WnFkVkZ2cV9YNzhpSUdzdDFUN25oVzJmYlZrX2pnSDNYMWJMdW55Ykl4WW5JUk9vbEhYcUVjTzhzZExaMlByTnh0dDROem1qaFJKbVFtMklOYk05Z0JneVUyS1g1eXgyU1Naek84WC1pdmVVZ21WQ2ZiaGJidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes To Add Quantum Resistance To Ethereum - CoinGape",
        "content": "Ethereum Co-Founder Vitalik Buterin has introduced a new proposal that will bring longer-term sustainability to the protocol’s smart contract push. Notably, the presence of Vitalik Buterin lends strong credence to the Ethereum ecosystem, the new proposal has drawn curious comments.\n\nUniswap Founder Diffuses The New Ethereum Proposal\n\nThe Ethereum proposal dubbed EIP-7702 was brought to the fore by Uniswap Founder Hayden. In response to community members with doubts about what the proposal means, Adams shares some insights.\n\nadvertisement\n\nHe highlighted that the proposal was designed to replace EIP-3074 which marks an upgrade for normal “EOA” wallets to give smart wallet functionality. Also, some Ethereum developers have also introduced the EIP-4337 proposal that seeks standards for smart contract wallets.\n\nWhile EIP-3074 had been slated for inclusion, the Uniswap founder noted that Vitalik Buterin was not at peace with it. This is because of the accompanying longer-term implications as it relates to compatibility between 3074 and 4337. Vitalik Buterin was also concerned that in the age of quantum computers, 3074 might break sooner than expected.\n\nThe 7702 proposal was introduced to correct the concerns in both previous alternatives. In the proposal, new functionalities like third-party transaction sponsorships are enabled. Beyond this, privilege de-escalation is also a key update that will enable “users can sign sub-keys, and give them specific permissions that are much weaker than global access to the account.”\n\nWhile the proposal will pass through the regular community vetting processes, its benefits remain properly highlighted. Ethereum developers will now face the decision to adopt the proposal, a move that will require “converting an existing EIP-3074 workflow. This process, the GitHub Commit noted is simple to do.\n\nAs usual, like Ethereum Dencun Upgrade and other related upgrades, this proposal, if approved and launched on the mainnet will not impact the average user.\n\nEthereum Price Continues To Show Weakness\n\nThe Vitalik Buterin proposal and the price outlook of Ethereum are notably decorrelated. According to top market analyst, Michael van de Poppe, it is hard to suggest ETH price is close to its low. This is because the bear market has extended for about 2.5 years already.\n\n#Ethereum continues to show weakness. Would suggest that we're close to the low, but the bear market continues and we're at more than 2.5 years already. Some important scenarios:\n\n– Breaking 0.052\n\n– Support at 0.042-0.046 These are marked. pic.twitter.com/Qottd5n3Hz — Michaël van de Poppe (@CryptoMichNL) May 7, 2024\n\nAt the time of writing, Ethereum’s price comes in at $3,058.12, down by 0.47% in the past 24 hours. Using the BTC/ETH chart, van de Poppe pitched two scenarios to watch out for. The first is a breakout point at 0.052 level with the second being the support between 0.042 to 0.046.\n\nThe Vitalik Buterin pitch may help reboot the price of Ethereum when the news is fully priced in the market. However, beating short-term bearish market headwinds remains a crucial test to pass.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE45aHhGYldwcDdXMDRDWW5hU0lZZk1aejZBMmRHN2M2M0ZoZnVPdUs2b29vWDhremttX1lvSkJvUTkzU2lyVnBNSm9xVDRPSlNtVDB0Y0EyS0dlbVdiOWtJUXJoUjIzb2xOa21mdjczNHZncUJZQnpj0gF8QVVfeXFMTTVEUnRGRk1YTFlBYTMzTHVXSmNnTEpnaTEtMmZtSTRqaWFFc09SS1lXRTc4U2NXbzZhZFo4UjZPVWxScWp5VUMxYlhWdTY0S2JISmw2aXIxM0lvZDYtMHhDWUhOM1FadFRnQXpLTWx0SEF5TS1jNWhZeEJiag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 21:03:31 GMT",
        "title": "Can Ethereum Reclaim $4,000? Fragile Fundamentals Threaten To Send ETH Crashing - NewsBTC",
        "content": "Ethereum has put on a disappointing performance for its investors over the last few weeks, leading to concerns on whether the second-largest cryptocurrency by market cap has lost its shine. The cryptocurrency continues to skirt around the $3,100 level, not making any significant breaks upward. This points to weak fundamentals that could trigger a price decline.\n\nEthereum Fails To Make Meaningful Moves\n\nMarkus Thielen, Head of Research at 10x Research, has pointed out some worrying developments with the Ethereum price. In a new report shared with NewsBTC, he explains that despite Ethereum remaining highly correlated to Bitcoin with an R-Square of 95%, it continues to perform poorly while the latter has made new all-time highs.\n\nRelated Reading\n\nThielen points back to ETH’s performance in the last bull market, which was closely tied to new sectors popping out of the network, such as decentralized finance (DeFi) and non-fungible tokens (NFTs). This caused demand to skyrocket, and in turn, the price followed as users gobbled up ETH for the high gas fee required to transact on the blockchain.\n\nHowever, Ethereum has failed to maintain this momentum, which can be attributed to its inability to bring the upgrades that users needed in time. Thielen explains that the Dencun upgrade which helped solved the high gas fee issues had come three years too late because by 2024 when the upgrade arrived, users had moved on to Layer 2 networks. Also, during this time, other Layer 1 networks have seen a rise in users and Solana is one example of this.\n\nThe researcher further explained that the weak fundamentals of ETH are now not only affecting its price but has had a spillover effect to Bitcoin. “Ethereum’s weak fundamentals are becoming a roadblock for Bitcoin as they prevent broad fiat inflow into the crypto ecosystem,” Thielen stated.\n\nBetter To Short ETH\n\nThielen’s analysis of Ethereum also spreads to the drop in stablecoin usage on the network. Back in 2021, Ethereum had dominated stablecoin transactions such as USDT and USDC. However, it seems like, with other things, the high fees have driven users towards other networks. Blockchains such as Tron (TRX) are now dominating stablecoin transactions, leaving ETH in the dust.\n\nAdditionally, there is also the fact that ETH’s issuance is turning inflationary once again. After the London Hard Fork, also known as EIP-1559, was completed in 2021, the network saw its issuance turn deflationary for the first time as ETH burned quickly surpassed ETH being brought into circulation.\n\nRelated Reading\n\nHowever, this has now changed in the past months as there have been more ETH issued than those burned, Thielen notes. To put this in perspective, a total of 74,000 ETH were issued compared to only 43,000 ETH burned. This inflation, coupled with the fact that staking rewards have now dropped to 3%, below the 5.1% offered by Treasury Yields, Ethereum has had a hard time maintaining bullish sentiment.\n\nGiven these developments, the researcher believes it is better to be bearish on Ethereum right now. “Right now, we would be more comfortable holding a short position in ETH than a long one in BTC as Ethereum’s fundamentals are fragile, which is not yet reflected in ETH prices,” Thielen concludes.\n\nETH price fails to hold $3,100 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Watcher Guru, chart from Tradingview.com"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNF82YW1vOEl5N2M1eEJieDBGS2wtd2Y4Vk5seEFWOGdFTGY0b19yeW4zVk9fWjlwLWh4UkdETVJmQzY1VWo3ajItSkxJU3NieVRVTEdrLWYwYnRNN1lVUDl1bk5uMi00SDdvWXVvT21iaG15NHBVYWo3eGFLTkNUVV9uQ210UTdKdE1ia0h1ZVRuc3htWUt0d041UXpQeEJkZElvYVhRX29CY2cxMm1EaVJ1RzR5Z9IBuwFBVV95cUxPN01PenhBejItSW43RkFLNVZFclp2M2k4bmtZdUNYbURaZzhCVGpueXNaR0FiS0VacWZmUkFlWFlHR2lMUTFvdmdSSTBSM1lURWhzeno5bkVpOHpGNEdJa2hOd3hYNjEwZDk2U2tLVmRWbHBkVXNvNU8xbHhlYWtIc2szb0FHeGIxbDRaamFHQkxNQnZENE5ha1ByVEg2NHVZQndRVmxPYklsM3FQUzN5Y1l4dTRMRHVfdGNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Is Ethereum About to Take a Massive Drop? Here’s Why ETH Price Could Drop By 70% - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nIs Ethereum About to Take a Massive Drop? Here’s Why ETH Price Could Drop By 70%\n\nStory Highlights Ethereum slides below $3000 as the bears intensify their presence within the crypto space as Bitcoin drops below $62,500\n\nWith a stable descending trend, the ETH price is feared to drop to its initial levels, offering the traders a lifetime opportunity to jump in\n\nThe volatility has made its way into the markets with the selling pressure mounting over the crypto space. After a long fight, the bears are close to dragging the levels below the crucial support as the ETH price is trading in and out of $3000. With new bearish clouds looming over the markets, it will be more interesting to see whether the bulls can provide a solid foundation or the bears can squeeze profits!\n\nPreviously, it was believed that the ETH/BTC pair, which was gaining strength, was a clear indication of altcoins growing stronger than Bitcoin. However, a recent analysis suggests that the ETH price against USD or USDT drops heavily whenever the ETH/BTC pairs face rejection from the interim highs. Now that the ETH/BTC is falling under acute bearish pressure, will the ETH price recover from the recent losses?\n\nA popular analyst, Benjamin Cowen, referring to both pairs, believes the descending trend could soon knock in the ETH price.\n\nThe analyst refers to the weekly ETH price chart against the USD and compares the ETH/BTC’s variation. He marks the times when the ETH/BTC breaks down and indicates that the ETH price against USD encountered a 70% drop simultaneously. Now that the ETH/BTC has faced rejection, the analyst predicts a similar price action. He says,\n\n“The last 2 times that ETH/BTC broke down, ETH/USD then dropped approximately 70%. In a world where everyone has been preaching Alt Season for the last 2.5 years into a BTC dominance uptrend, I thought I would remind people that there is still downside risk,”\n\nWith this, the analyst sheds light on the possibility of the altseason being differed as there is still more room for the price to go down, probably below $2000. If this happens, the Ethereum (ETH) price may offer a lifetime opportunity to accumulate as the 5-digit price target continues to prevail for the rally in the long term.\n\nAlso Check Out : Ethena Token Jumps 18% This Week! Can ENA Price Reclaim $1?"
    }
]