[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOeDc0UDM0cGt3cW1wTGt1ek9TT0FNT3RCa3ZydHN5Yi1paURUWkFyWEJxMEU1azZFa3ZRSEM5bjFHXzVCdHpKY0F3S0xMQTdGSlB3SWM2a09BbEZQdlBFcTlRMF84bGk2LWpWTXVFTy1hcmhHRlpJWWtzYXB1VWZoeHdnbVdmT0JHS25VWkpEdUh0MWJyX2xneE9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF update: Speaking at Bloomberg Invest, CFTC chair Gary Gensler says application is ‘going smoothly’ - Fortune",
        "content": "Securities and Exchange Commission Chairman Gary Gensler betrayed impatience upon fielding questions from reporters about crypto, including his agency’s handling of applications to launch Ethereum ETFs. In speaking with journalist Annmarie Hordern at the Bloomberg Invest event in New York on Tuesday, Gensler accused his interviewer of going after “clicks” after she asked him several questions related to crypto policy.\n\nThe issue of cryptocurrency ETFs has been contentious during Gensler’s SEC tenure, most notably when a federal appeals court last year rejected the agency’s decision to refuse applications for a Bitcoin ETF. The court ruling led the SEC to approve those Bitcoin applications in January and, despite initial signals from Gensler that the Ethereum petitions would be rebuffed, the agency more recently indicated it would grant them.\n\nThe agency’s apparent change of heart has led to ongoing speculation about how long the process will take. Despite his grumblings, Gensler—a noted crypto opponent—offered a few details.\n\n“I don’t know the timing, but it’s going smoothly.” He elaborated that his team is waiting for asset managers to make “proper disclosures.”\n\nGensler’s comments came after SEC filings from this spring suggested that the agency may have adopted the position that Ethereum was a security for more than a year.\n\nGensler also made a point to clarify that an ETF trading Ethereum futures has already been approved. Last October, the SEC approved futures ETF applications for Valkyrie Investments, VanEck Funds, Proshares, Bitwise Asset Management, and five others. The pending spot ETF applications would give investors direct exposure to the asset via regulated exchanges.\n\nOnce heralded as a supporter of crypto by many who saw his tenure teaching a course on the subject at MIT as an endorsement, Gensler has come down hard on the industry over the past few years. Last year alone, the regulator brought 46 enforcements against crypto-related firms, according to a Bloomberg report.\n\nGensler juxtaposed the 11 Bitcoin ETFs the SEC approved this year, which are currently trading on regulated markets, with what he called the “non-compliant model,” or exchanges that also knowingly trade non-compliant securities. “It’s about real protections for investors and for other people that want to access the capital markets,” said Gensler. It’s about trust in those markets.”\n\nGensler declined to answer a question about reports that his stance on crypto might cost Joe Biden, who appointed him, the election. “My number one priority is the American public,” said Gensler. “That’s the client, and so that’s who we represent.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNTXNqT2NfWXlCdTZoVjU2SlhLaWMxdUtDWDF5XzM4UE5rVE1Xd0F6bUo0Ri1wZEFnUUp3S3hJUjBPOFJIUllIZ3dxcjZka0tLdlZ2VlV1RVBvTlpPczRraFJPTWktQUVXYlZmRUNCUjg2Vm5XUjdBN0dxZmJiYlRHV1ZsOHlObHpVTTlvVi1WbUxPVFFrVWczMDR6RHVOUUs0VWd5ZnUta3BINWl2MFBmd2JuX2hPdlZMS1hMbmhPUXktMEc1SmlCelVFVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency Market News: Bitcoin Briefly Slips Below $60K, SEC Drops Ethereum Probe - Investopedia",
        "content": "Key Takeaways The bitcoin price has continued its month of suffering, as the price briefly dipped below $60,000 on Monday.\n\nFormer bitcoin exchange Mt. Gox has announced distribution of funds owed to former customers will begin in early July.\n\nThe Securities and Exchange Commission (SEC) closed its investigation into Ethereum without filing charges against blockchain technology firm Consensys.\n\nCrypto asset manager Hashdex has filed for a combined spot bitcoin-ether ETF.\n\nThis week, analysts will be watching to see if bitcoin can halt its decline while also keeping an eye on Thursday's U.S. presidential debate.\n\nJune hasn't been kind to bitcoin: The price of the cryptocurrency briefly slipped below the $60,000 level Monday after it looked like it could surpass the previous all-time high of more than $73,000 earlier in the month.\n\nThe most recent negative news for bitcoin comes in the form of a coming distribution of bitcoin owed to former customers of defunct bitcoin exchange Mt. Gox, which is estimated to involve as many as 140,000 bitcoin coming onto the market.\n\nThat said, the past week hasn't been all bad news for crypto, as the U.S. Securities and Exchange Commission (SEC) concluded its investigation into Ethereum and blockchain technology firm Consensys without filing any charges. In addition, crypto asset manager Hashdex has filed for a spot crypto exchange-traded fund (ETF) that will focus on diversification.\n\nMt. Gox Repayment Plan Causes Bitcoin Jitters\n\nThe defunct bitcoin exchange Mt. Gox announced it will begin the long-awaited process of returning assets to its customers in July, over a decade after it filed for bankruptcy following multiple hacking incidents. The total amount of bitcoin to be distributed remains uncertain, with estimates ranging from 65,000 to 140,000 bitcoin, potentially valued at up to $9 billion.\n\nWhile some investors worry that the influx of these bitcoins could depress prices, others argue that the potential selling pressure may be overstated, noting that creditors have had years to sell their claims if they needed funds urgently. The announcement of the impending Mt. Gox repayments caused bitcoin's price to briefly dip below $60,000 Monday, continuing its downward trend for the month.\n\n\n\nAccording to data from Farside Investors, spot bitcoin ETFs have now suffered their largest outflows over a two-week period since U.S. spot bitcoin ETFs were approved in January, with investors pulling out a net $1.1 billion from these funds over that timespan.\n\nSEC Closes Ethereum 2.0 Investigation\n\nOn June 18, blockchain technology company Consensys announced that the SEC's enforcement division has concluded its investigation into Ethereum 2.0. Despite the closure, the SEC's stance on whether ether, the native token of the Ethereum blockchain, qualifies as a security remains ambiguous.\n\nAccording to Consensys, the regulator began its investigation into Ethereum last year and the company sued the SEC early this year, claiming that Ether was a commodity and that the SEC lacked jurisdiction to investigate.\n\nWhile the SEC's chair, Gary Gensler, hasn't definitively labeled ether a security, the Commodity Futures Trading Commission (CFTC) considers it a commodity. The investigation's closure could indicate the SEC leans toward treating ether as a commodity, although the SEC's future actions remain uncertain.\n\nAccording to Fortune, Consensys’s legal battle with the SEC will continue despite the recent announcement. The conflict originally stems from the SEC's scrutiny of Consensys-owned crypto wallet MetaMask, particularly its token-swapping capabilities and staking access. The SEC contends that these functions constitute unlicensed brokerage activities involving unregistered crypto asset securities. Consensys indicated that while the closure of the Ethereum 2.0 investigation is a win, it doesn't fully address the broader regulatory issues.\n\nHashdex Files for Combined Bitcoin-Ether ETF\n\nWith spot bitcoin ETFs already trading in the U.S. and spot ether ETFs seemingly right around the corner, the next development could be a combined ETF featuring both leading cryptocurrencies. Hashdex, a crypto asset manager, is spearheading this effort with a recent filing for the Hashdex Nasdaq Crypto Index US ETF.\n\n\n\nIf approved, this ETF would be the first in the U.S. to directly hold both bitcoin and ether. According to Nasdaq's filing with the SEC, the ETF will track the Nasdaq Crypto Index (NCI), which is weighted by market capitalization. Coinbase Custody and BitGo are set to serve as custodians. The ETF aims to provide a passive investment strategy, offering investors exposure to the market's overall performance. Hashdex already has a similar product in Brazil.\n\n\n\nWhile the new ETF initially will focus on bitcoin and ether, the filing leaves room for the inclusion of additional crypto assets in the future, provided they meet regulatory criteria. Bloomberg analyst James Seyffart noted that the final decision from the SEC on Hashdex's application is expected by early March 2025.\n\nWhat To Expect in the Markets This Week\n\nCrypto market analysts will be watching the bitcoin price closely this week, hoping for signs that the bleeding will stop, especially in the context of high bitcoin ETF outflows and the upcoming Mt. Gox distributions.\n\nHowever, some market watchers, such as Custodia Bank founder and CEO Caitlin Long, say the bitcoin price decline isn't something to worry about in the context of the recent halving event. \"It’s normal for a price dip like this to happen after a halving—halvings are incredibly bullish, but bull markets don’t start until typically several months later—for fundamental reasons,\" Long posted on X.\n\nAll eyes will also now turn on Thursday's U.S. presidential debate between Joe Biden and Donald Trump, as conversations about cryptocurrencies find momentum on the campaign trail.\n\nFormer President Trump has changed his stance about bitcoin, now seemingly supporting the cryptocurrency without making any definitive regulatory or policy-related comments for digital assets. Due to the SEC's aggressive enforcement actions during his administration, President Biden, by extension, has not been viewed as crypto-friendly—an image that his campaign is trying to dissociate from him, although there are no specifics on crypto policy from that camp, either."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1vYklBNVZZRlkxWm1YNk16SS01Z05wRWJBZmhKMGw0dVN6bmEydkRlakpJbXZaVllyOXNKY3pLNXktYWxTajlBcnBPRkNtZjdWcnl0MkhyaV9kc2VQeW9LYU85NXcxSXpKalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Cega Shark Bull vaults on Ethereum and Arbitrum combine stability with high returns - Blockworks",
        "content": "The promise of guaranteed high yields with downside protection is often a red flag when navigating a sea of DeFi app marketing speak.\n\nYields are often exaggerated while risks get buried. It’s easy to promote sky-high APRs when you print your own token to fund temporary incentives.\n\nIn the offchain financial world, however, there is such a wild beast emerging from the depths: Shark Fin notes.\n\nDeFi app Cega Finance, a leader in exotic options and structured financial products, launched an onchain version on Ethereum and Arbitrum today.\n\nA Shark Fin is a type of structured financial product that offers a unique risk-reward profile. These notes provide investors with enhanced returns if the price of the underlying asset stays within a predetermined range. The name derives from the shape of the payoff diagram, which resembles a shark’s fin.\n\nSource: Cega.fi\n\nThe potential returns sharply increase to a peak if the asset’s price remains within the range, and then level off or decline if the price moves beyond the specified threshold. This structure allows investors to benefit from stable market conditions while protecting against significant downside risk.\n\nCega’s launch provides conservative investors an onchain version with crypto as the underlying assets.\n\nExpansion from Solana to Ethereum\n\nCega debuted its first four vaults on Solana almost exactly two years ago, but branched out to Ethereum in the second quarter of 2023.\n\nRead more: Solana options protocol Cega comes to Ethereum\n\nThe decision to launch on the Ethereum Virtual Machine (EVM) was always part of Cega’s roadmap, but the collapse of FTX in November 2022 prompted Cega to expedite its plans, according to co-founder Winston Zhang.\n\n“We knew that we couldn’t wait, and we wanted to continue growing,” Zhang told Blockworks.\n\nInitially, the team considered expanding crosschain via LayerZero or Wormhole, but ultimately decided to hire a new team of Solidity developers to rebuild on Ethereum.\n\n“While that was a little bit slower, it provides the best affordance for safety and security because we’re able to control the smart contracts design ourselves and not rely on a third party,” Zhang explained.\n\nThis transition, which took three to six months, was particularly a response to demand from large-scale investors like DAOs, funds and high-net-worth individuals who prefer the stability of Ethereum.\n\nThe decision to add Arbitrum was driven by its strong DeFi community and significant TVL, making it an ideal target audience for Cega’s products. Arbitrum’s growth, fueled by platforms like GMX, aligns well with Cega’s offerings, which appeals to trading aficionados and derivatives enthusiasts.\n\nIt’s not a migration — Cega maintains a presence on Solana with thousands of users, and the product will continue to be developed there.\n\n“We are having conversations about what it means to reprioritize the Solana ecosystem and how to think about product parity for some of the new products that we’ve launched on Arbitrum and [Ethereum] mainnet,” Zhang said.\n\nMaking complex products accessible\n\nOne of the biggest challenges Cega faces is how to simplify complex financial products for their non-professional users. They made a conscious effort to create intuitive visualizations and straightforward documentation to avoid overwhelming users with technical jargon.\n\nTypically reserved for accredited investors in traditional finance, the goal is to make this class of investment tools accessible to everyone, regardless of investment size.\n\n“The products that we’re building are ultimately derivatives products, but they add a number of benefits for the end user that they can’t get from existing [perpetual futures] platforms or vanilla options platforms,” Zhang said.\n\nThe new “Shark Bull” vaults target users who might typically have capital on lending platforms like Aave, and want to increase their stablecoin yield without taking directional risk to crypto markets.\n\nThese vaults offer 100% principal protection with a guaranteed yield of 12.7%, and the potential for up to 30% returns under certain circumstances by combining lending and options strategies.\n\nStablecoins’ lending yield forms the baseline return, while a portion of the yield is used to purchase out-of-the-money (OTM) call options on crypto assets — the “bull” component, driving the high bonus payouts if prices rise.\n\nThe lending counterparties in this case are not smart contracts but major crypto market makers, so this introduces some credit risk. Cega facilitates these loans but is not a custodian, and manages the risk through stringent legal agreements and ongoing credit monitoring provided by Credora.\n\nRead more: Bitcoin lenders have a new regulation-friendly option for yield\n\nCega, based in Singapore, emphasizes compliance with global regulations. These days, that requires geofencing the US-based customers.\n\nDecentralization plans\n\nThe company raised a total of $9.3 million from notable investors including Dragonfly and Pantera, and does not yet have a token.\n\nZhang said his team deliberately avoided participating in the points incentivization game popular over the past year, preferring to focus on providing real sustainable yield.\n\n“We’re actually really proud of that,” Zhang said.\n\nEven without incentives, the platform has about $16.6 million in TVL currently, and about $404 million in cumulative trading volume.\n\nLooking ahead, Cega does plan to launch a token while maintaining its core values of responsibility and prudence, Zhang said.\n\n“There’s way too many protocols in crypto and in DeFi that just aren’t built on real foundations,” he said, citing the project’s published values.\n\n“There just have been way too many examples in the ecosystem of carelessness, and lack of responsibility, and that is not us.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBEM0pVc1J5UXpFcWhPa25tRE1jV3RsRXlEaFpCTlRmTWxjMktYRDVZTjNhWndKdk1vVHJvRkxNa1FiU2lZdWp4Zllpb1dTbXV3VzJaMUVFcmpPQWlOQVpCRHRGZlhudmVqZUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum options traders still bullish despite recent crash: Kaiko - Crypto Briefing",
        "content": "Ethereum sees bullish trading despite recent put-call ratio drop.\n\nShare this article\n\nEthereum (ETH) options traders maintain a bullish stance despite the recent market turbulence, according to analysts at Kaiko. This analysis is backed by the put-call ratio dynamics, which raised in May and suggested a bearish sentiment as more puts than calls were bought.\n\nImage: Kaiko\n\nHowever, this trend reversed in June as the ratio declined, indicating a shift towards bullish bets. This optimism is further supported by the trading volumes at higher strike prices for December expiries, where a significant number of calls exceed the current price levels.\n\nThe positive shift in trader sentiment can be linked to recent regulatory developments, Kaiko analysts highlighted. Last week, the SEC concluded its investigation into ConsenSys regarding Ethereum’s status as a security, which has likely contributed to the bullish outlook among traders.\n\nMoreover, as reported by Crypto Briefing, the spot Ethereum exchange-traded funds (ETF) are likely to start trading in the US on July 2nd. This information was later reiterated by Bloomberg ETF analyst Eric Balchunas.\n\nTherefore, this could potentially trigger a price leap for Ethereum, as experts shared with Crypto Briefing near the ETF approval in May. Although some of the upward movement might be already priced, there’s a significant chance that ETH might sharply increase its price following the start of the ETF trading in the US."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQT2ZoMDBxSU0wWi1Qc2xHMnp1YkhhZmFXeGhwWm5Dd2I0WEQzSFp5Z2JYaHlTUWlCUFFmWXhEd1Zib3lCc2JaSDBtdzVXaGlOTGg5d3lkUmR6QUlJZ2RyOVJpbk8yc0dxUXFxUG9qb1MzdWtoeDFlTlp6ZVhOMFQ0VdIBhgFBVV95cUxQZGR5ZlZtX1F0TllKZXZOdm1GeTI2S2huVVJ6dGpVZmdUemRjdGg3d1lEYWEyZFdjWEUtSXd6d0stLXk1bmhpYkdKbGduYURmbE9HWGdZRWlqUmhHbTlKZ1owMG45ek85M1gzNnlZVGdjOWRaLTZTTDJnek5CTjFyOWMtS3hpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Hacked, Tim Beiko Confirms: What Happened? - U.Today",
        "content": "Ethereum Foundation's Tim Beiko has confirmed that the company's official email was hacked and multiple messages were sent to mailing list subscribers. According to WuBlockchain, hackers got access via SendPulse. For now, users should avoid clicking any kind of links they consider suspicious in the future.\n\nAdvertisement\n\nSeveral suspicious emails sent from the official updates@ethereum.org address led to the discovery of the hack. These emails were found to be fraudulent and to have malicious links that could harm recipients if they clicked on them.\n\nTim Beiko alerted the public on X, warning them to exercise caution and not to click on any links or open any attachments from the compromised email. The Ethereum Foundation uses SendPulse as their email service provider, which is how the hackers gained access.\n\nThe attackers apparently took advantage of SendPulse's security flaws to obtain unauthorized access to the Ethereum Foundation mailing list and distribute phishing emails. Working with SendPulse to fix the problem and secure email correspondence is the Ethereum Foundation's current focus.\n\nAdvertisement\n\nTo stop it from happening again, they are also looking into the nature of the breach. Beiko posted a sample email to assist users in spotting phishing scams. Although these emails may appear authentic, they contain links that take users to malicious websites that are meant to infect computers with malware or steal personal and financial data.\n\nAlways verify the message's content and the sender's email address twice. Before taking any action, get in touch with the organization directly through official channels if something seems off. To receive the most recent information on the breach and security warnings, follow the Ethereum Foundation on social media and on their official website. Email service providers and the Ethereum Foundation should be notified if you receive any suspicious emails. This can aid in stopping the phishing attempts from spreading further."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNcEl4c3JmcGNpWTFLQmQxREZDSUdKSGdnM0c3WjAzRXoyX2xndjVEbFpueURxRTZ3Zkpha0lNbVJyNVhKaFM5V3JSQk50VmM0S1NYa3lzLUJTTlBkY1lacnB4OHlhazRzeHRXejlaSDYyaFNFR2hybzRnSVpmc0h5NERfamdKV1NLczZnOHJLQlg5d0lVbzBuZGtnTlF6T1VQYnFvNThQSE45dGZtMU5YSVp6ZEdhSGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: The Emerging Blockchain Powerhouse Transforming the Music Industry The Hype Magazine: Unveiling the Pulse of Urban Culture - From Hip Hop to Hollywood! Explore a Diverse Tapestry of Stories, Interviews, and Impactful Editorials Spanning Fa - The Hype Magazine",
        "content": "Ethereum: The Emerging Blockchain Powerhouse Transforming the Music Industry\n\nMost of us have heard of Bitcoin even if we don’t quite know what it is, but a similar Web3 decentralized platform called Ethereum just made news, and is perhaps more important to music artists and the recording industry as a whole.\n\nThis is because Ethereum is one of the easiest blockchain platforms to use by technology developers, and because of this, has become one of the most popular software platforms involved in new music technology companies such as Infanity. When Ethereum is used to develop software, it can also include the use of cryptocurrency known as ETH, similar to Bitcoin, which is another cryptocurrency.\n\nSo for music technology companies built using Ethereum, such as our company Infanity, someone can buy music and/or other products not just through regular credit card transactions, but also by purchasing with ETH. Since the price of ETH goes up or down more frequently than the US Dollar, a music fan could also buy music at a cheaper rate when ETH goes down. A music fan can also make money because if the price of ETH goes up, the digital collectible you bought could go up, and so you would see a profit when you sell the collectible.\n\nAlso, with blockchain technology, there is also a record of any purchase that can be seen publicly through various channels. So for a music fan or a music artist selling their music on a platform like Infanity using Ethereum, that means you could actually prove you were an early supporter and fan of a new artist, and that an early “edition” could grow in value over time.\n\nThe recent news on Ethereum was that for the time being, the Securities and Exchange Commission will not pursue trying to determine whether Ethereum is a security that would have to be regulated. This means that companies built on Ethereum to sell digital collectibles are still in the clear the same way selling paintings at live auctions are just collectibles and not regulated. Ethereum is here to stay.\n\nWritten By: Renata Lowenbraun"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQQ1N2U0VCREp2YzhIemRwS01Pc0tFc3U1ZHF6a3E5MEhKdWg2amd4c2hBTmNZWGUyS3hSNnlES1B6SVZQYVJoSndEYmZjMXlRSE9jLVdEaWIzQ091MDVVYjlaYmVKb1l4SWw4OWVRSEpKZnZCTENqTWpfTHlsWXMyX01NWG95WUNSVkI2dUZpSWJINVRsVWNpWmY3NElDRUFCbFQtRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "The SEC Ends Its Ethereum 2.0 Investigation, but Staking Isn’t in the Clear - Unchained",
        "content": "Episode 665\n\nThe SEC won’t pursue enforcement against Ethereum 2.0, but why? How much of a role did politics play? And where does that leave staking and court cases involving companies such as Consensys and Coinbase?\n\nListen to the episode on Apple Podcasts, Spotify, Pods, Fountain, Overcast, Podcast Addict, Pocket Casts, Amazon Music, or on your favorite podcast platform.\n\nLast week, Consensys revealed that the SEC had concluded an investigation into Ethereum 2.0, referring to when Ethereum transitioned from a proof-of-work consensus mechanism to a proof-of-stake one.\n\nIn this episode, Laura Brookover, senior counsel & head of litigation and investigations at Consensys, and Sam Enzer, partner at Cahill Gordon & Reindel, explore the implications of this decision on Ether’s status as a commodity versus a security, and why the SEC dropped the pursuit, including whether the shifting political winds played a role. For instance, how much of the decision was influenced by the ETH ETF approvals, Democrats crossing party lines to vote for FIT21 and the repeal of SAB 121, and/or SEC crypto enforcement chief David Hirsch’s resignation?\n\nIn this discussion, they also explained why the closure doesn’t necessarily mean that staking, or restaking, is safe from the SEC. Plus, what’s the impact of this closure on the other big crypto cases, such as Coinbase, Kraken, Uniswap, and Ripple?\n\nShow highlights:\n\nHow Consensys managed to get the SEC to reveal that it had concluded its investigation into Ethereum 2.0, and the significance of that move\n\nThe SEC’s possible reasoning behind investigating Ethereum after it had switched to proof of stake\n\nHow uncommon is it for the SEC to send a letter concluding an investigation like the one into Ethereum\n\nWhether recent events around crypto as an election issue, the ETH ETF approvals, votes for FIT21 and the repeal of SAB121, and David Hirsch’s resignation, might be connected to the decision to close this investigation\n\nWhether the Biden administration has shifted its stance on crypto and whether Gensler should remain as chair\n\nHow the SEC might still go after staking\n\nWhether restaking, such as pioneered by EigenLayer, is safe from regulatory actions\n\nWhy the SEC might be pursuing different judgments in various jurisdictions for MetaMask and Coinbase Wallet\n\nWhat crucial evidence from the closed Ethereum 2.0 investigation could strengthen Coinbase’s defense in its ongoing lawsuit\n\nWhy the SEC’s aggressive stance on various crypto enforcement actions seems to remain unchanged despite closing the Ethereum 2.0 investigation\n\nWhy Sam and Laura believe Solana should not be considered a security, despite the SEC naming it as such in various crypto cases\n\nHow the SEC’s argument about an “ecosystem” is nonsensical, according to Laura Brookover\n\nWhat the implications of the closed investigation are for the cases of Kraken and Ripple\n\nWhat Sam and Laura B. are watching out for in terms of regulation and ongoing legal cases\n\n\n\n\n\nThank you to our sponsors!\n\nGuests:\n\nLinks\n\nEthereum ‘Survives the SEC’\n\nConsensys lawsuit against the SEC\n\nEther ETFs\n\nLatest on other SEC enforcement actions"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiqAJBVV95cUxPazN5bFhjdjgtVVF5YjUzc09wbWlMS0tndjJGdVExcXBUTVI3dmJCdW1ET3pHSGFuV0lORlhiXzQxWHotWk5TdW4zSnZucEZDX3FrbDN2QmprN3BsZzNTWWJrcnU4bTI2QUcyeXJMYUh4UHNXOXNIb2todzRDNkVXeGt2dUd3ZjY3cGJ3bDY1NDR6U2IweWo4SXgtdFRVdWVNbGdPeTRJYzlwcXdjWE5yQ29hQmJwWU1sU2Q0VmRaa01iSnVHZ1locjRxdXFvYnRaSXNoM3piSE1kVWRNUGVxOGFBUGhjUlNqV3QtUTJuWWdaTk8yNEF6bEpuaHBPYmFfMThFZDhlbk5FSUpmcXdUaWFaTnJoYUR3UFphUlJzeXp2VFlUUGl0OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum Spot-ETF Approval Trigger A 30% Ether Price Drop? Bitcoin And Other Crypto-Related Stocks Reacting Negatively in Premarket Amid Fears - Markets Insider",
        "content": "Crypto-related stocks including Coinbase Global (NASDAQ:COIN), MicroStrategy Inc. (NASDAQ:MSTR), Marathon Digital Holdings (NASDAQ:MARA) and others showed subdued reactions to Nate Geraci, president of The ETF Institute, anticipating approvals for spot Ethereum (CRYPTO: ETH) this week. However, analysts are deliberate about how the ETF would impact ETH price.\n\nWhat Happened: The launch of spot Ether exchange-traded funds (ETFs) could potentially lead to a 30% drop in Ether’s price, warns Andrew Kang, founder and partner at Mechanism Capital. Kang suggests that Ether’s price could plummet from its current value of $3,410 to as low as $2,400, CoinTelegraph reported on Monday.\n\nAt the time of writing on Monday, Coinbase was trading at 3.70% lower at $217.50 after closing at $225.86 on Friday, while Robinhood Markets, Inc. (NASDAQ:HOOD) was trading 1.97% lower at $21.85 after it closed at $22.29 on Friday. Similarly, Marathon Digital was 5.15% lower since its close at $19.21 and was trading at $18.22 while MicroStrategy was trading 5.68% lower at $1,399.50 after Friday’s close of $1,483.76. Riot Platforms, Inc (NASDAQ:RIOT) also reacted to the conversation by trading 3.87% lower at $9.180 during pre-market.\n\nKang expressed his skepticism about the potential benefits of an Ether ETF in a recent post. He stated, “How much upside would an ETH ETF Provide? I would argue not much,” predicting a price range of $2,400 to $3,000 post-ETF launch.\n\nKang anticipates that spot Ether ETFs will attract only 15% of the flows that spot Bitcoin (CRYPTO: BTC) ETFs have seen. This is in line with the 10–20% range estimated by Bloomberg ETF analysts Eric Balchunas and James Seyffart.\n\nSee Also: Trump’s Niece Says SCOTUS Desperate To Give Ex-President Campaign Boost With Its Delay Tactics: Proves ‘H\n\nHowever, not everyone agrees with Kang’s predictions. Industry analyst Patrick Scott expects a similar directional movement to how the spot Bitcoin ETFs have performed, but he doesn’t foresee Ether’s price doubling. Meanwhile, asset management firm VanEck projects that spot Ether ETFs could drive Ether to $22,000 by 2030.\n\nKang also raised concerns about Ethereum’s future as a cash flow “machine”, suggesting that Ethereum may resemble an overpriced tech stock. He also noted that the removal of staking from the proposed spot Ether ETFs might deter investors from converting their spot Ether into ETF form.\n\nWhy It Matters: The launch of spot Ether ETFs has been a topic of discussion in the crypto world. Nate Geraci, president of The ETF Institute, had earlier anticipated approvals for spot Ethereum ETFs, potentially shaking up the cryptocurrency market.\n\nIn a post on X, formerly Twitter, Geraci predicted that spot ETH ETFs would be approved, stating, \"I’m deciphering this as spot ETH ETFs will be approved this week…Just me tho.\"\n\nGeraci's views were consistent with his forecast two weeks ago when he stated that he would be shocked if spot ETFs did not receive green signals before the end of the month. \"No reason for delay,\" he had said.\n\nThis also follows a controversial political shift that led to the SEC's approval of spot Ethereum ETFs last month, a narrative that has been called into question after President Joe Biden vetoed a bill aimed at overturning SAB 121.\n\nRead Next: Trump Reportedly Makes Decision On VP Pick, Says Running Mate Will Be At Debate\n\nImage via Shutterstock"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNNVIxbWpSN0wyLXA5eDhtWTQxWjBsM2YzRFAxdlBJLW5vQTVpUzUyS1dlMTdBZTRncjRfRFFBSG5VSWJqbnc0cUU3TXMyLVp0QUZELXd3Q2ZlMXdoSHR0c0J2OC11R1ZtY2JvTXpRMHhiMU9sMEJOOGYwUUpkZkpMV3IzZGI0cEVIbGN0QmFaTEQ0TVAzd0RPZ19XU08tR1hITl9KcDExdnJLdkx3MGJoNXdFSmxxNDF4UXhsRC1RakUxUXhq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum Price Rebound After Crashing to 1-Month Low? Top Experts Weigh - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNZ2ZxbktyX096OEsyeTViOHplMzUzQUtjR1JEa05wRnMwLTBuM21ER1R1ODRsb3BzMUxIT2hkUUNGTVByem5Rdk55eFRQRUZKVjVocGF5MlRZMnh6TGFfbDV1RXVoWHpQOVRxdnlfMUw5WnNkZ2ZYeFdqMmxDUFNCY2J0cXAzVmJjeF9IcXpQRlBRREhXWXRlS2tsMWRXOXZLRHRPWG9IbHdLUFBEbFN0RDhJa0JtSG11VWR5dkRISGNSR3RacHJxZVNXcW1TOEZac0l0LWk2cm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "The SEC, Ethereum, and the American political landscape with Joe Castelluccio, Partner at Mayer Brown - Mayer Brown",
        "content": "Joe Castelluccio, Mayer Brown partner and co-leader of the firm’s Fintech and Digital Assets groups, spoke with Fintech.TV on June 21 from the New York Stock Exchange. Joe discussed drivers of market appetite for crypto assets, a timeline for spot ether ETFs, recent SEC actions regarding ether’s status, and the digital assets horizon for the second half of 2024.\n\nView the full interview on Fintech.TV."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1ERk9PaTdkMHo0OVlTTU50TnhpaUZyT3lsOVB1cVBoOEd1aktLT25jZVd5SWxkRWtJam0wTTlmcXFmckIwWHlhZk0wYnZuaER4Z083ZFp1cWdQelRyV2h0LWhUZzRSWk5BZWxXMTdOX2Y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Solana's Battle Against Bitcoin And Ethereum: Expert Analysis - TronWeekly",
        "content": "After a major run last year, Solana has struggled to sustain its previous momentum. According to market analyst, Matthew Hyland, SOL will probably underperform compared to Bitcoin [BTC] and Ethereum [ETH]. Based on indicators and market dynamics, Hyland predicts a challenging path for SOL to break new all-time highs against BTC, mirroring ETH’s performance in the previous cycle.\n\nIMO SOL probably underperforms BTC and ETH going forward I could be wrong about this, but I think the idea of SOL breaking to new ATHs against BTC is similar to ETH last cycle, which it did not happen SOL had a major run; I was VERY VOCAL buying between $16-$25 last year so I don’t hate it by any means and still think it has upside in USD but I don’t think it is likely it will run away and outperform BTC and ETH going forward\n\nSolana's Battle Against Bitcoin and Ethereum: Expert Analysis 3\n\nDespite the challenges of outperforming the two leading crypto assets, Solana is known for its high speed and low transaction costs, attracting developers and projects. It has positioned itself as a potential “Ethereum killer,” aiming to resolve scalability issues that plague the ETH chain. Having said that, Ethereum’s transition to ETH 2.0, which promises scalability and energy efficiency, could overshadow SOL’s advantages.\n\nAdditionally, Bitcoin’s growing acceptance as a legitimate asset class in several nations and its potential to serve as a hedge against inflation bolster its long-term prospects.\n\nSolana’s Downward Trend and Future Potential\n\nWhile Solana has undoubtedly emerged as a competing rival and has upside potential in USD, its capacity to outshine BTC and ETH remains uncertain. Investors should keep a close eye on market developments and be cautious about betting SOL to lead the altcoins in the cryptocurrency realm.\n\nOn the price front, SOL’s price has been on a downward trend in the last week. On June 15th, the price was trading close to $168. At press time, the price is around $127.50, reflecting a decrease of roughly 23.36%.\n\nNevertheless, Solana is a popular platform for decentralized applications [dApps] due to its fast transaction times and low fees. If dApps become more widely used, it could drive up the demand for Solana and increase its price."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQY1JqdkFYT08xa0FpWHc2VkE1ZVdLVXZjdURpWXBwSWZyQjFPampONldRMGwyMFMwWDVvOWRSb2swYlhfUVY1UU1GYUQyMVhuRzBmSGNUUmtFekZxV2RCNTBxVjNuYjROd0VWS0htWFY2aENrcmxZNC1mR2pXZzIzR3A2UHJHUnFfQXRZRUtMb9IBlAFBVV95cUxPQS0xSV9zQklJek8teG94eld2cHNKaFVDSlVnSmZ0ZnZ2eTRWdG9GRDc3dmFrSC1qMTQ1bktoWUtWdHMtOVp1d1FOTkFHOEdEUkRZUnduNDBBOTRHaDd6QW9IdzExTTA3aW9CejJycU0yaFdmbTRZcm5NZEVMT3lUSTFHUHlNSzdoLTZMVHZzRUw0RERW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Justin Sun Bullish on Potential Ethereum ETF Approval? Data Suggests So - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe tounder of the Tron blockchain, crypto billionaire Justin Sun, has acquired yet another large ETH lump as he may be expecting the SEC to grant permission to launch spot Ethereum ETFs at the start of July.\n\nLast year, Sun already bought more than $1.1 billion worth of Ethereum, according to the recently shared analytics data.\n\nJustin Sun scoops up more ETH\n\nAnalytics account on X (formerly known as Twitter) @spotonchain spread the word that more than eight hours ago, the owner of cryptocurrency wallet -0xdbf (@spotonchain believes it to be the founder of Tron Justin Sun) transferred a large amount of Ethereum from Binance. It happened while ETH traded at $3,472. This ETH chunk was valued at $16.07 million at the time the purchase was made.\n\nThe above-mentioned data source shared that over the last three days, the same wallet belonging to the Tron creator bought (at an average price of $3,494) and withdrew from Binance 13,967 ETH worth almost $49 million.\n\nAdvertisement\n\nWallet 0xdbf (likely #JustinSun) withdrew another 4,629 $ETH ($16.07M) from #Binance at $3,472 ~8hrs ago.\n\n\n\nOverall, in the past 3 days, this wallet has withdrawn 13,967 $ETH ($48.8M) from Binance at an avg price of $3,494.\n\n\n\nFollow @spotonchain and set alerts for the wallet now:… https://t.co/ozvNN9KVhL pic.twitter.com/eTbffY7b0H — Spot On Chain (@spotonchain) June 24, 2024\n\nA few days ago, @spotonchain shared with the crypto community that Justin Sun had made a massive Tron-USDT deposit (89.57 million coins) to Binance and spent $32.9 million of that amount buying more Ethereum, which he later withdrew to his wallet.\n\nIn another tweet today, @spotonchain suggested that Sun may be “bullish on the rumored launch of the Ethereum Spot ETF” next week.\n\nEthereum ETF approval expected on July 2\n\nAs reported by U.Today, on Friday, the spot Ethereum ETF emitters updated their S-1 filings to the SEC. Among the details made public, Franklin set its Ethereum ETF fees at 0.19%, while VanEck’s fees were announced to be 0.2%. Besides, BlackRock revealed that it has had $10 million worth of future Ethereum ETF shares bought in advance by a major undisclosed investor.\n\nPrior to this, Consensys spread the word about the securities regulator shutting down its investigation into the mechanisms of Ethereum 2.0, thus rejecting all the rumored U-turns to calling ETH a security. This pivot made the chances of seeing a spot Ethereum ETF approved grow stronger.\n\nThe anticipated date of the SEC announcing its positive decision on this is July 2, according to Bloomberg analysts."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNQkRjXzBTamRWbWEzYVFyRDdQaU5kSVEycXpDOHdKSUxpYVRZa01SejhCZklJOVU0OExFZF9iUHRGbGRRUjVvdzRnUU16ZUFtUGpqcUtYYWNJN2w0VGU5NFNndHRPSVh0bXhOTWFiZTRHbmVZUWdSMTVnUkc3YmFsSE92QTRONXhIemMyamIwbUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Gas Fees At ‘Rock Bottom’ as Network Activity Soars - Unchained",
        "content": "The average gas fees on the Ethereum mainnet dropped under three gwei as transactions across the layer 1 and layer 2 protocols are at an all-time high.\n\nMedian gas prices on Ethereum have dropped to their lowest level in years despite soaring network activity. Data from Dune compiled by @hildobby shows that mainnet gas prices dropped below three gwei on Friday for the first time since early 2020.\n\nGas prices are the cost to conduct a transaction on Ethereum. In dollar terms, the drop in gas prices equates to performing a swap on Uniswap for $1.06, trading an NFT on Seaport for $1.49 and transferring ETH on chain for $0.23, according to data from GasFees.io. When transacting on a layer 2 network like Base, which incorporates “blob” transactions, fee levels are reduced even further. A Uniswap swap on Base costs $0.0016 in fees, a Seaport trade costs $0.0021 and an ether transfer costs $0.00026.\n\nAccording to Pistachio.fi founder Brian Smocovich, the lower levels of fees on the network are not the result of a slowdown in transaction activity, but rather, the effect of a more efficient fee market.\n\n“Ethereum volume per day is the same if not higher than 6 months ago. L1 [layer 1] fee market is now more efficient because of L2 [layer 2] volume and EIP-4844,” said Smocovich on X.\n\n“The L1 gas market is now more efficient because most volume is on L2s, L2 -> L1 settlement is 100x cheaper than pre-4844, and we have the gas market efficiencies of EIP-1559,” he added.\n\nHe noted that gas is at “rock bottom” while network activity is at an all-time high, citing data from L2Beat which shows that layer 1 and layer 2 protocols recorded an average of 299 transactions per second on June 21.\n\nThe flip side to gas fees sinking is how it impacts the supply dynamics of the network, specifically, Ethereum’s burn rate which is now at a 12-month low.\n\nEIP-1559, introduced via the London hard fork, introduced a base fee tied to usage that would be burned or removed from supply. With a lower amount of fees to burn, ether’s supply has turned slightly inflationary and sits at a growth rate of around 0.56% a year, according to ultrasound.money."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOQ0dtZ0FSaHd0Y2JpNEpILVFXVHRzMVRTQzBhb1dqRHE5Uk44WFNPQ3pvMUZNa2RzaGhvQXVaRUExR2tWUHRPVTRXdVVkNmdBZGFxRE80bXBnc1dvUDltQm0xYXdjX3hRWU8wX2lVU1NqUTJiSVdLWXBPMzRUVnBCRW16OEJuYkXSAYwBQVVfeXFMTXNrLXdLbVkwSmZSSU9KLWtvMzVZQUhEdjBRUUllUTRQVkZnT0xtRzdVRHNEMWxPNXliaXlGeHFGUkk0MWd2Szg2aDZZLU50enlJTld3RERMcDItTU50NEJUdTNndjdSaHhDR2U0dE5objBlUmxuQzRFNEFPX2FwanhELUFFMkZjQmNjX20?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Gensler Provides Crucial Update on Ethereum ETF Approval Process - U.Today",
        "content": "During a one-on-one interview that took place at the Bloomberg Invest Summit in New York, U.S. Securities and Exchange Commission Chair Gary Gensler said that the process of approval of several Ethereum (ETH) ETF applications was going \"smoothly.\"\n\nAdvertisement\n\nHowever, Gensler does not know exactly when these products will be able to start trading. He has stated that the asset managers are supposed to make proper disclosures before the launch.\n\nAs reported by U.Today , the SEC boss previously stated that Ethereum ETFs would go live this summer.\n\nAdvertisement\n\nLast week, several prospective spot Ethereum ETF issuers, including financial behemoth BlackRock, submitted amended registration statements that include information about fees as well as seed investments.\n\nEarlier today, financial firm VanEck also moved closer to the final approval of its Ethereum ETF application by filing a Form 8-A.\n\nBloomberg ETF analyst Eric Balchunas has predicted that the Ethereum ETF products could be launched on July 2 . According to the expert, the latest move by VanEck bodes well for this prediction.\n\nThe SEC shocked the cryptocurrency industry by unexpectedly 19b-4 forms in May. However, this was only the first step of the ongoing approval process. Now, the agency has to greenlight numerous S-1 registration forms that will actually allow Ethereum ETFs to go live.\n\nIn late May, banking giant JPMorgan predicted that the yet-to-be-launched spot Ethereum ETFs would not attract the same level of demand as their record-breaking Bitcoin counterparts earlier this year. Its analysts expect these products to attract only $3 billion worth of inflows this year, which would be only a small fraction of the total inflows that have been recorded by Bitcoin ETFs."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE52LV93QnpwX2prREdkYm5pSXY0TkgwMzN2UVdfcDh6bzkyWURPSmxsXzVoQlNoMkg1LTQ2OUZiQXZDLUx5UEljV3lMWlYxMHk1c1pXRHF5emFNZUVud0RSX1V3T24xRHNi0gFuQVVfeXFMT0p6ZDJOSHhlYmZudGtCUzQ3cVhHQjA0UmRHRzE0OXZGTjVNcHA0eWtCbG9ERnhkbHJ6em43Z25CSjctbUZQYWhfMXRxYk5kaHJJMFRxLVVQdWUwZnEwRDRyY3hhODI5NC1IZ0pfMEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for June 25 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe majority of coins are rising, even though sellers' pressure remains relevant, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe price of Ethereum (ETH) has gone up by 1.88% since yesterday.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH is in the middle of the local channel, between the support of $3,342 and the resistance of $3,393.\n\nAs most of the ATR has been passed, ongoing sideways trading around $3,370 is the more likely scenario until tomorrow.\n\nImage by TradingView\n\nOn the bigger time frame, neither buyers nor sellers are dominating. However, if the decline continues to $3,300, traders may witness a test of the $3,200 zone until the end of the week.\n\nImage by TradingView\n\nFrom the midterm point of view, one should pay attention to the weekly bar closure. If it happens far from its low, it is possible to see a bounce back to $3,600.\n\nEthereum is trading at $3,379 at press time."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZ19vQnMtSHc3ZTVodkREbnlfUk5TSXQ5bm9VWFpDZlMtVU1ZZW1ZSGx0UlI5Q0VBUndPY3dvYkZqdGdMNHhTNEhlWVppS1dFMEQwcjhhbmZVZExRLWozVlJ5b2puMUNDV1lqTDduSGhzbmNDU1hibHNDa3AtM0FCRF83MGhlcDk10gGOAUFVX3lxTE9wRURBTGRacVJLMHhVN283a3RrTlh4bXJVZFlGZUVTaklEdmhwQjluVmVGaE91TG5wbEVWNUlrMHJyWDJYMURKWkZkcTJOZ3F0REs5UkVhZ2tCUjhXQmZHTkUwQjhYWmQ2WGFEalVzcy1SVkpfaE1KNDFPZEV2elp5NklnSXVWSFFFZDYwX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Could Ethereum ETFs lead to ETH’s downfall? Expert weighs in - AMBCrypto News",
        "content": "Spot Ether ETFs may reduce Ethereum’s price to as low as $2,400.\n\nInstitutional interest in Ethereum is less compared to Bitcoin, affecting ETF conversion rates.\n\nAs Ethereum [ETH] trails Bitcoin in performance, its price has seen a 5.1% decrease over the past 24 hours, bringing it to a current valuation of $3,315.\n\nThis recent downturn in price reflects broader market trends and investor sentiment. Despite this fall, analysts foresee a further drop potentially driven by new financial products entering the market.\n\nAndrew Kang of Mechanism Capital speculates that the introduction of spot Ethereum exchange-traded funds (ETFs) could push Ethereum’s price down to as low as $2,400.\n\nETH ETFs to drive down Ethereum’s price?\n\nThe rationale behind Kang’s prediction lies in the comparative lack of institutional interest in Ethereum as opposed to Bitcoin.\n\nThe founder of Mechanism Capital disclosed that the absence of strong incentives for converting spot ETH into ETFs, coupled with unimpressive network cash flows, presents a challenging outlook for Ethereum’s immediate future in the ETF market.\n\nThese factors may contribute to Ethereum’s struggle to maintain its market price in the face of evolving market structures and investor preferences.\n\nAdditionally, the potential influx of ETH into the ETF landscape is estimated to attract about 15% of the flows that Bitcoin ETFs have garnered, based on extrapolations from Bitcoin’s ETF performance.\n\nInitial data indicates that spot Bitcoin ETFs attracted around $5 billion in new funds within six months of their launch.\n\nApplying these figures to Ethereum, it is projected that Ethereum-based ETFs might see approximately $840 million in true inflows during a similar timeframe.\n\nConcerning this, Kang expresses skepticism about the alignment between the crypto community’s expectations and traditional financial (tradfi) allocators’ preferences, indicating that the market may have already “priced in” the effects of the ETF launch.\n\nChallenges in market perception\n\nFurthermore, the conceptual pitch of Ethereum as a decentralized financial settlement layer and a base for Web3 applications carries potential. However, according to Kang, current data suggest that it may be a challenging sell.\n\nParticularly, the reduction in network transaction fees due to decreased activity in decentralized finance and non-fungible tokens has shifted perspectives, possibly likening ETH to overvalued tech stocks in terms of financial metrics.\n\nAdditionally, according to Kang, the recent regulatory green light for Ethereum ETFs was somewhat unexpected, giving issuers limited time to craft and disseminate effective marketing strategies.\n\nHe added that the removal of staking options from the ETF proposals could further dissuade investors from converting their holdings, impacting the anticipated influx of capital into these funds.\n\nConcluding the insight, Kang noted:\n\n“Does that mean ETH will go to zero? Of course not, at some price it will be considered good value and when BTC goes up in the future, it will be dragged up with it to some extent. Before the ETF launch, I expect ETH to trade from $3,000 to $3,800. After the ETF launch my expectation is $2,400 to $3,000. However, If BTC moves to $100k in late Q4/Q1 2025, then that could drag ETH along to ATHs, but with ETHBTC lower. “\n\nAre there bearish signs from ETH?\n\nIn light of Andrew Kang’s pessimistic view on Ethereum, it’s worth examining Ethereum’s fundamentals to validate these concerns.\n\nData from CryptoQuant reveals a worrisome trend in one of Ethereum’s key metrics—there has been a notable increase in Ethereum deposits on exchanges, suggesting a potential rise in selling pressure.\n\nThis indicator aligns with IntoTheBlock’s data, which shows a significant reduction in large ETH transactions (those exceeding $100,000).\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThese transactions have decreased from over 10,000 late last month to under 4,000 as of today.\n\nDespite these bearish signs, a recent report from AMBCrypto highlights an uptick in Ethereum’s daily active addresses, adding a layer of complexity to the market’s dynamics."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSzRYQW9IZnktdnJvWEVGT18ySmNvbkNaOFZ4aHBiLWJJTkY1Z0h5TFJXVEd5bkVfM096YlZpSy1aR19KU0FZRmpxNXFSbEF1ZkhCNV80bDA4VnY1RFk5cTRiLWN6a3dRVXlrdVpZdlhURVphMmxlVEo2UFBDVE4zZzBTdThYazJmSTV5dmtOMV9fdkN1TXNZVEVudW8tTzV3cWlVQUtzRW1vdUo2dHU0M9IBtgFBVV95cUxQV1ZKd1pyUjRWa1c3UWVWVWMyTkRTYUx2eTgyazV4cHhmSFZFc1dqWGM5bDVhaENndVJPM053MnczdEFWMG5mNjQwMGtVWm5tbTM5endtUFJ1RkFCR1hFOHNDdWFmQUZOV0dFNFNpZGZLdE5sSkRNd0U1Vlh5SUJhZkstZEhHVnkxWFQ2VEFOT1BLZTlGUmZNc0l2OHNtQUl0czdSdHpzRURnY3NPbF9CZUxuMUhKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Set to Skyrocket to $150 Again, Ethereum (ETH) Huge Gains Ahead? Massive Reversal Pattern Formed, Shiba Inu (SHIB) Stealth 20% Surge - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana could be aiming at the $150 price threshold once again as the price starts showing reversal potential after reaching the 200 EMA. The trend flattening is often one of the first signs of an upcoming price reversal. However, it is important to stay cautious as in the midterm, Solana is still in a downtrend.\n\nThe SOL/ETH chart indicates that Solana has been steadily declining over the last several months, but there may be a shift in store as of late. The price has bounced back somewhat after touching the 200 EMA, which has served as a support level. This suggests that bullish momentum may be developing.\n\nNear the oversold area at about 35 is where the RSI is currently trading. This could mean that buyers are about to intervene and that the selling pressure is lessening. The MACD histogram also exhibits indications of a possible bullish crossover. An increase in purchasing activity is indicated by volume analysis, which may be good news for Solana.\n\nGiven the large uptick in volume bars, it appears that traders are beginning to stockpile SOL at these lower price points. Despite these encouraging indicators, it is critical to recognize the difficulties Solana may encounter while recovering.\n\nAdvertisement\n\nEthereum's reversal potential\n\nEthereum could be forming a ground for a price surge as the second-biggest cryptocurrency enters the falling wedge pattern formation in addition to relying on the 50 EMA. At this technical threshold, Ethereum could easily perform a reversal.\n\nThe falling wedge pattern is usually interpreted as a bullish reversal pattern indicating that an upward movement may be approaching and that the downtrend may be coming to an end. According to Ethereum's recent price action, the pattern's peak, which typically comes before a breakout, is getting closer. The blue line on the chart, the 50 EMA, has served as an important level of support. The fact that Ethereum's price has repeatedly rebounded from this level suggests that there is significant buying interest in this vicinity.\n\nEthereum's chances of a bullish breakout from the falling wedge pattern are greatly increased if it can hold this support. The relative strength index or RSI is currently trading close to 46, suggesting that Ethereum is neither overbought nor oversold.\n\nEthereum has the freedom to rise from this neutral position without being under a lot of selling pressure. Volume analysis indicates that buying activity is gradually increasing, indicating that traders are starting to accumulate Ethereum at these prices. The possibility of a bullish reversal is further supported by the fact that this accumulation phase frequently comes before a notable price movement.\n\nShiba Inu's last hope?\n\nDespite the enormous 25% price drop we saw on Shiba Inu, there is still some hope for a reversal at around $0.000018. However, a quick glance at the trading volume of Shiba Inu clearly shows that it is not the most favorable asset on the market right now.\n\nRecently, Shiba Inu's price dropped by 25%, indicating a significant decline. SHIB is now at a critical support level at $0.000018 due to the drop. This stage may serve as a possible turning point in the event that buyers intervene. Nevertheless, SHIB's trading volume has been comparatively low, suggesting that there isn't currently a lot of buying interest.\n\nOne significant element that could impede a speedy recovery is this low volume. Right now, the relative strength index (RSI) is circling the oversold area. This can suggest that a reversal is imminent and that the selling pressure may have been overdone. Nevertheless, a reversal cannot be ensured by the RSI alone — higher buying volume is required.\n\nResistant moves have been made by the moving averages, especially the 50 EMA. In order to verify a reversal, SHIB must make a significant volume breakout above these moving averages.\n\nEven though the Shiba Inu market is currently difficult, there is some hope because of the support level at $0.000018. We could witness a 20% increase if SHIB can maintain this support and return toward the moving average.\n\nAn important role is also played by the larger cryptocurrency market. SHIB may benefit if Ethereum and Bitcoin begin to rebound."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOQUtfR2RVN1dpc1d3LURwc0M1S19oN19CN1RSbEJGbWdEc3RkNVpHOGtGS3Z6LTNyX0FvbDdOekpfRmIwM1drNGVMSnhpTmRTczBCbjNfanpSUE9IaGJNS3kweFNtSXBEWXBMUHpLVE5kZXU0VWMwbEtXbTRJcUFSTkxHZjlNUlVMSk5LdTNpMFp5TWtpTURGQ1d3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "VanEck’s Ethereum ETF will be free as battle for dominance heats up - DLNews",
        "content": "VanEck initially won’t charge a fee for its Ethereum ETF.\n\nMost prospective ETF issuers haven’t publicised their fees yet.\n\nEthereum ETF fees are likely to be just as low or even lower than those for Bitcoin ETFs.\n\nSpot Ethereum exchange-traded funds could launch any day now. And one of the last things prospective issuers need to get right are fees.\n\nA recent filing shows that investment-management firm VanEck will be waiving the fee for its Ethereum ETF until some unspecified time in 2025, or until the fund reaches $1.5 billion in assets, whichever comes first.\n\nOnce either of those conditions is fulfilled, the fund will process a 0.20% fee.\n\nVanEck “aims to be a leader on crypto ETF fees even if it means we lose money at the outset,” Matthew Sigel, the firm’s head of digital-assets research, posted on X.\n\n“The plan is to make it up on volume; in this case, decentralised finance volume,” he added.\n\nSigel laid out the gambit in another post: If the Ethereum ETFs create a renewed interest in Ethereum, then the ensuing network activity will likely push the price of Ether up — which would benefit VanEck’s holdings, he said.\n\nHe also hinted that the firm could potentially take an interest in Ethereum DeFi projects such as Curve or Aave.\n\nVanEck has employed a similar approach toward its spot Bitcoin ETF. The firm is waiving fees entirely until the fund reaches $1.5 billion or March 31, 2025, whichever comes first.\n\nJoin the community to get our latest stories and updates\n\nSo far, the ETF has accrued $614 million in assets — making it the sixth-largest spot Bitcoin ETF.\n\nFee war\n\nOut of nine prospective issuers, VanEck and Franklin Templeton are the only two that have disclosed their Ethereum ETF fees.\n\nFranklin Templeton will be offering 0.19% fees on its ETF — the same as for its Bitcoin ETF.\n\nFirms don’t need to disclose their fees until very late in the ETF launch process, according to Bloomberg Intelligence ETF analyst Eric Balchunas. And issuers are likely waiting for BlackRock to make a move.\n\n“What BlackRock is going to charge is probably the single most important missing variable outside of the exact launch date,” Balchunas posted on X.\n\n“Their fee is the sun that the rest will need to orbit around,” he added.\n\nEven so, VanEck and Franklin Templeton’s opening moves will put pressure on BlackRock to issue an ETF with fees lower than 0.30%, Balchunas said.\n\n“So far, it looks like Ethereum ETFs are going to have as low or even lower fees than Bitcoin ETFs,” he said.\n\nStaking\n\nOne factor in the fee calculus is that Ether investors can stake their holdings through exchanges and decentralised platforms to earn a 3% yield.\n\nBut they won’t be able to do this through Ethereum ETFs.\n\nAnd this raises a question: Why would institutions want to pay fees for an asset instead of earning a solid yield for it?\n\n“Even paying 0.20% without the staking element seems like a nonstarter to me,” Adam Morgan McCarthy, an analyst at crypto data firm Kaiko Research, told DL News.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQMHhnRUsyNFFqdUVzVUNkd29rSEhWR2xyNUlIdnNNampLc01xRlp6blo0REpiYWVZZDNOQlRyWkJkbUdJS0xkRGVkX0ZKTXRWcGtnYUFnOGJicHY1dUh0dWZkUHkwNmFaZUw1a0Ywd3pMTmx6ZzI3ZTM5MFZ6Q0hGemVGZE1pem9XaVc5TkViRWZuVVZGUDFQRldncGNQRW1QcV9QdjlBRkJEZENXRGR0ODZSZlctUlQwNkxPQ0VsMlFnbnhLVkZHb3ZYVE14Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Securities and cryptocurrencies: The SEC drops the Ethereum case, but continues to pursue Ripple - The Cryptonomist",
        "content": "The latest news from the crypto market talks about new developments in the respective cases of the SEC against Ripple and Ethereum in relation to the security token issue.\n\nThe federal agency of the United States has definitively abandoned all investigations on the Ethereum Foundation, determining that ETH does not fall within the definition of security and thus preparing for the asset’s entry into U.S. exchange-traded funds.\n\nIn the meantime, the dispute against Ripple continues, with the SEC requesting a fine of over 100 million dollars, awaiting the resolution of the case at the trial that will determine once and for all if XRP should be considered a financial security or not.\n\nAll the details below.\n\nThe SEC concludes investigations on ETH: everything ready for the launch of spot ETFs\n\nAccording to recent reports from the cryptographic developer Consensys, the SEC is about to drop all investigations into the Ethereum Foundation, first initiated in March 2023 with the intention of classifying ETH as a security token.\n\nAs reported within the post “Ethereum has survived the SEC” and now the insiders of the well-known blockchain of smart contracts will be able to build freely without having to worry about regulatory limitations.\n\nThis very important milestone for the sector comes after Consensys had sued the SEC on April 25, only to renegotiate with the agency on June 7, requesting the case to be closed.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nETH no longer considered a financial commodity, after 6 years in which the SEC has repeatedly changed its mind on the matter. Initially, in fact, in 2018 it expressed opposition to this connection, only to return to accuse the issuers of the currency of selling unregistered securities after the chain’s consensus mechanism transitioned from PoW to PoS.\n\nTo tell the truth, even Gary Gensler, chairman of the Commission, has never given a clear and precise definition regarding Ethereum, while he had expressed himself in a much more convinced manner for other cryptographic products such as those offered by Ripple, Cardano, and Dash.\n\nDuring a testimony to Congress last year, he indeed refused to answer the question of whether ETH fell under the definition of security and if it meets the requirements of the Howey Test.\n\nJUST IN: 🇺🇸 SEC Chair Gensler refuses to answer if Ethereum $ETH is a commodity or a security while testifying before congress. pic.twitter.com/IkDTgNrfix — Watcher.Guru (@WatcherGuru) April 18, 2023\n\nNow that the SEC has closed the investigations on Ethereum, we can officially prepare for the listing of the cryptocurrency in the spot ETF markets in the United States.\n\nThe Securities and Exchange Commission had already approved this kind of financial products with underlying ether in May, but the S-1 applications of the registrants were not given the green light.\n\nThe landing of exchange-traded funds for ETH could now be very close: indicatively the listing is expected by the beginning of autumn but it could also arrive in the coming weeks.\n\nThe asset managers like BlackRock, Fidelity, and Bitwise are getting ready by starting to release the first promotional videos of the next investment offering, implying that it is only a matter of time before Ethereum makes an appearance on Wall Street.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nDespite the victory against the SEC in a historic lawsuit, Consensys warns that the broader web3 sector could still be under the watchful eye of the federal agency.\n\nAs reported in a post from last week:\n\n“The closure of the Ethereum investigation is important, but it is not a cure for the numerous blockchain developers, technology providers, and industry participants who have suffered under the SEC’s illegal and aggressive cryptocurrency enforcement regime.”\n\nThe SEC abandons Ethereum, but continues the case against Ripple: the 100 million dollar fine\n\nOne of the cryptocurrency companies still in the eye of the storm is Ripple, with the SEC motivated to classify XRP as a security despite a court having refuted this connection last year.\n\nAt this moment the Federal Securities and Exchange Commission is asking the company that manages the issuance of the cryptocurrency, for compensation of 102.6 million dollars after reducing the amount from an initial fine set at 2 billion dollars for selling XRP without a license.\n\nRipple refuses to give in to this bullismo, and has recently proposed a fine of 10 million dollars, citing the agreement with Terraform Labs as justification. However, the SEC has countered that such a low fine “would not meet the purposes of civil penalty laws.”\n\nThe regulator has indeed clarified that Terraform Labs has agreed to destroy “the keys to all its securities in crypto assets”, “return a significant amount to investors in those securities”, and remove “two of the board members in command at the time of the violations”.\n\nAs stated by the SEC itself:\n\n“Ripple also confronts the dimension of the sanction of Terraform with the amount of the ‘gross sales’ of that defendant, arguing that the Court should impose the same ratio (1.27%). But this is not an apples-to-apples comparison”\n\nIn the middle of this debate, last week Judge Phyllis Hamilton dismissed at least the 4 compensation claims in separate class actions, while still keeping the main case alive to label Ripple’s token as an unregistered security.\n\nIn particular, Hamilton focused on the fact that Brad Garlinghouse, founder of the accused company, had insistently promoted the currency in 2017 while he himself was proceeding to sell large shares on the market.\n\nThe promotional activity of Ripple which Judge Hamilton may be treating with more weight than Judge Torres could give the expectation. There seems to be some additional evidence of promotional statements before Judge Hamilton. The whole remaining cause of action going forward… https://t.co/Cd1RS4xQgX — bill morgan (@Belisarius2020) June 21, 2024\n\nDespite Judge Annalisa Torres having previously closed the XRP-security case, now everything seems to be back in the spotlight: the ball is now in the court of the trial, which will decide whether to classify Ripple’s digital currency used for cross-border payments as a financial security.\n\nThe SEC is trying to assert itself by instilling fear in the entire digital token industry, in order to “discourage future misconduct in the cryptocurrency sector“.\n\nIn the meantime, while the federal agency limits the expansion of the crypto sector with these attempts at destabilization, more and more famous personalities and US celebrities are illegally promoting tokens linked to their name, which inevitably end up causing their investors to lose money."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPVy1aTEkyQ1BjTjgzRjhfTU9SbHI3QWdSd0V3S1RiLWtfbVpxeGUzaElEc3MzUElIWkdoQ096d01scG8zY1RvWWhVMGt1V3pkWWNmbEpCenY4UGxWSjdQODZ6dnBFOFZYaE1Kb3Y0aEJSd0ZNTWRld3V1aWh2QVFxSTRvbGx0M283NDNuRWFtRUtuV0gzWUJ3T3lGVXZ2bjZ4S3hYUtIBqgFBVV95cUxQV1VUemtRcFNrbUZCdDEtOGNKc0dwSHhHdmtBNlE4Z2otSTJ6N1ZSMWVUV1JDZVRic2oyVXZvSnhJUFBkN1lnQUJTS1Bha0t0c083bUxWV2FSNU5tMnVBZ2l4UnljYVlXNVk5Qk02MVF5ZGZ6RnU0MEZhU1BKV0Zpak5hd013SzBnZHdBdE50bDlNWU90N2g0ME5mbHFXdFMtYTQ1dHp4VmFIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ether Traders Buy $4K Calls In Anticipation of Record High - CoinDesk",
        "content": "A call option is a derivative contract that gives the holder the right to buy the underlying asset at a specified price within a predetermined time frame. When traders purchase call options, they do so with the expectation that the price of the underlying asset will rise above the strike price, that is, $4,000 in this case, before the expiry of the option."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQMGRQbkM3c2dMZkpoYnVrcVFqUEpWcVk3RmdrZERINDRZU3M5MnJTSXRDazd2UkFMdU5ORV9wUkhpcG1JbG95WkNGbnFycnJwTmpvaHVPeG44bTBpWDBxdk9fTlUwVHNWWWJrLTdMNm9zeW16Rk5kT0s0V3lWNHVVVVVucG1kOEpWSXJWcjBiay0yU0JraEIxRVFRdU9GZmFFdF84S04yZjhHd3E0V1FBRkRIVWh6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "The price of Ethereum at $2,400 after the launch of spot ETFs - The Cryptonomist",
        "content": "From the analysis of Andrew Kang, founder of Mechanism Capital, it emerges that after the launch of spot Ethereum ETFs, the price of ETH could drop to $2,400. For Kang, the smart contract crypto does not attract institutional investors in the style of Bitcoin.\n\nETF on Ethereum Spot: after the launch, the price of ETH could drop to $2,400\n\nAccording to the analysis by Andrew Kang, founder of the venture capital firm Mechanism Capital, it seems that after the launch of spot Ethereum ETFs, the price of ETH could drop to as low as $2,400.\n\n“Before the launch of the ETF, I expect ETH to trade between 3,000 and 3,800 dollars. After the launch of the ETF, my expectations are 2,400-3,000 dollars.”\n\nIn practice, Kang wanted to highlight that the position of Ethereum compared to Bitcoin is very different.\n\nIn fact, the founder of Mechanism Capital states that the crypto of smart contracts does not attract institutional investors, as Bitcoin did previously. On the contrary, for Kang, there are few incentives to convert Ether spot into ETF form and the network’s cash flows have not been very impressive.\n\nNot only that, it seems that according to Kang the success of the Bitcoin spot ETF has become an expectation for the Ethereum ETF for crypto natives, and not for TradFi investors.\n\n“Personally, I believe that the expectations of crypto natives are inflated and disconnected from the real preferences of traditional tradfi allocators. It is natural that those within the crypto space have a relatively high mental and purchasing share of Ethereum. In reality, Ethereum is much less appreciated as a key portfolio allocation by many large non-crypto capital groups.”\n\nSpot Ethereum ETF: the forecast on the price of ETH after the launch\n\nAt the time of writing, ETH is worth $3,377. If after the launch of spot Ethereum ETFs, the price were to follow Kang’s predictions and drop to $2,400, it would be a dump of -30%.\n\nNot only that, the founder of Mechanism Capital believes that spot Ethereum ETFs will attract 15% of the flows that spot Bitcoin ETFs have recorded, which is a percentage between 10 and 20% estimated by Bloomberg analysts Eric Balchunas and James Seyffart.\n\nOther analyses then, talk about the ETH/BTC price ratio, which from 0.054 at current prices, could drop to 0.035 in the next 12 months.\n\nHowever, Kang believes that a rally in the price of Bitcoin towards $100,000 in the next six to nine months could “drag” Ether towards a new all-time high.\n\nThe addition of the ProShares request\n\nAmong the latest news on ETF su Ethereum spot, there is talk of the United States Securities and Exchange Commission (SEC) that has added the request from ProShares.\n\nAnd in fact, among the 8 questions already approved in May, it seems that the one from ProShares was missing. Now, given that the process for final approval could end between the end of June and the beginning of July, this ninth question has also been accepted.\n\nThe announcement was made directly by the SEC, with a document revealing that NYSE Arca has proposed a rule change to list and trade shares of the ProShares ETF on Ethereum\n\nNow the crypto world and institutional investors are waiting to see the final approval of the 9 Ethereum spot ETFs, with the SEC expected to approve the S-1 form."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA2N2pFdEtfV2RCOXUweXpKdEtXMkJLckRoVVhQVVpIZGxZMU5oanMxcGdpS2dlc29uSkFOdk03enpoeUh2MndUcnU3Qy0xNk1McHZWN3dpcUtrdnVMdVQ2OC1taUxMZHhqaWFzNldiQmJ0Z19fWF9CbjQ1NUxZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF could begin trading soon: here’s why - crypto.news",
        "content": "VanEck has filed Form 8-A for a spot Ethereum ETF, signaling interest from major financial institutions in crypto investments, with anticipation of an S-1 registration in the coming weeks.\n\nIt’s noteworthy that the majority, over 80%, of initial crypto spot ETF investments were from retail investors. VanEck’s filing for a spot Ethereum (ETH) ETF signals a shift, indicating that major financial institutions are now stepping up their Ethereum investment efforts.\n\nThere is a growing expectation that an S-1 registration for spot ETH ETFs will be filed in the coming weeks, and VanEck has just submitted its 8-A form.\n\nAs Eric Balchunas, Bloomberg’s senior ETF analyst, posted, this 8-A form is a crucial step in the process leading to the launch of any ETF product.\n\nBalchunas believes that trading could commence soon, noting that VanEck filed its Form 8-A spot Bitcoin (BTC) trading seven days before its spot BTC ETF product went live in January. Balchunas believes that the launch date could be on July 2.\n\nForm S-1, also known as a “registration form,” is the initial registration form that a company files with the U.S. Securities and Exchange Commission (SEC) when it decides to go public.\n\nThis form is required for all companies that want to be officially registered and listed on a public stock exchange. Form 8-A, also known as the Registration of Certain Classes of Securities, is a registration statement required by the SEC for companies seeking to register securities.\n\nThe SEC approved 19b-4 forms for eight Ethereum ETFs last month — but before trading can begin, the regulator still has to allow the registration statements to become effective. Previously, firms hoping for a BTC ETF filed Form 8-As about a week before listing.\n\nImplications\n\nVanEck’s filing is a significant milestone in the development of cryptocurrency investments, particularly for institutional investors interested in ETH investing. This move signals that major financial institutions are ready to act on Ethereum’s potential.\n\nThe recent trend shows that more institutional investors are showing interest in crypto spot ETFs. This shift from retail to institutional investors could lead to more cash inflow and stability in the crypto market.\n\nA spot crypto ETF tracks the price of a specific crypto and invests portfolio funds into that crypto. These funds are traded on public exchanges but generally track a particular crypto. Like similar funds, crypto ETFs are on regular stock exchanges, and investors can keep them in their standard brokerage accounts.\n\nThis news comes as Vaneck was just slated to launch Australia’s first-ever spot Bitcoin ETF."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPdFNhNmV0N3A1NC0tNEJEUTJ2d0ZQMXBWSERvX0Z6eDVHdnB1ekNlVjgtbHEzUkRkTXR1YjN3TjlBRUdlLTJNSG5QVkJJLWE4TVlRWUFWRHZhMmZRYVhRRjFxd1E3MzFaRWpxYUNTRUNHUExlNS01SmU1MkFHbEZsUEp0LVpkaVdS0gGOAUFVX3lxTFBidnlKQTNSMmdycFdHWjZiSU9UeHhKMEpRUlRjeEl0dUdZQ2d0VjY1T1FvdjhoR0d2aXhUa2R6SWZXT0JXY01VbVM3OEU0TGczTlkwX1ZxcmtNQ3Uwd1ZiQVljdkhhV2ZJZXE3SFJ4dlhqcDlyeUtXbDY2SU9HLTlUT3hYcU0xclIteGYtUkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum Price Going To Crash Below $3,000 Support? - CoinGape",
        "content": "Ethereum price has faced intense selling pressure in the past couple of weeks despite starting June above $3,800. May was a bullish month for Ether which soared almost touching $4,000, thanks to the Securities and Exchange Commission (SEC) nodding to spot Ethereum ETFs.\n\nThe downturn to $3,300 in the last two weeks can be attributed to the larger macro environment. Investors in the crypto market have not been too amused by the Federal Reserve’s hawkish stance on interest rate cuts.\n\nadvertisement\n\nThis coupled with increased profit taking ahead off the start of the actual trading of the spot ETF has seen Ethereum price dive toward the $3,000 mark.\n\nShould the selling pressure increase this week, ETH price might fall below $3,000. Such a move could lead to cascading price dips as investors are likely to make irrational decisions to protect their capital.\n\nHowever, in an incoming inflation report in the US, the PCE price index could bring some level of relief to the crypto market. Experts are also looking toward the US election likely to be bullish for crypto later in the year.\n\nWhat To Do As Ethereum Price Grinds Toward $3,000\n\nEthereum is seen struggling to defend support at $3,300 during US business hours on Monday. Key indicators like the Relative Strength Index (RSI) validate the downtrend as it falls in the neutral area, getting closer to the oversold region.\n\nThe smart contracts token seems largely disadvantaged based on its position below two key Exponential Moving Averages (EMAs); the 20-day and 50-day.\n\nA potential death cross pattern would further destabilize Ethereum. Its occurrence on the daily chart may trigger traders to consider shorting ETH, thus creating more headwinds for the token.\n\nThe area with the most potential for support lies around $3,000 as highlighted by the 200-day EMA. A dive to this level may result in two actions; the first being an immediate rebound toward $4,000 as liquidity is collected or a continued fall below $3,000.\n\nA previous retest of this support at $3,000 extended the correction to $2,800 following the crypto sell-off in April and early May. A similar move is possible and one that may stretch to $2,500.\n\nNevertheless, the expected start of spot Ethereum ETFs trading on July 2 according to insight from analyst Eric Balchunas could be of immense relief to Ethereum.\n\nETFs will expose Ethereum to new markets among institutional investors who may be pressured to seek exposure to the crypto on traditional stock exchanges. Bitcoin rallied, achieving a new all-time high in March after the SEC approved the spot ETFs in January.\n\nEthereum price prediction shows the potential to gain momentum with increasing demand from the ETF. Therefore, this could be a good time to buy ETH and speculate on a stronger rebound in July and August.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1OaHRqcVM0Tnk4NF9KcF9xUWM1TVBuUWg5T21nTUpSU0x6UnRUbWp2ZHJMd3FfTmRpRkJWSUF6Y091VEZYcHJMdWNqME9IOWRpa3BadUIwajM3N2dreS1FclFFRkdkR2pub0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch: Here’s what you need to know - Gulf Business",
        "content": "Image credit: Supplied\n\nFollowing in the footsteps of Bitcoin, the Ethereum cryptocurrency is about to get its own Exchange Traded Fund (ETF).\n\nIn May this year, the US Securities and Exchange Commission (SEC) approved the launch of 8 exchange-traded funds (ETFs) backed by spot Ether. These include the Grayscale Ethereum Trust, Bitwise Ethereum ETF, BlackRock’s iShares Ethereum Trust, VanEck Ethereum Trust, ARK 21Shares Ethereum ETF, Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund and Franklin Templeton’s Franklin Ethereum ETF.\n\n\n\nThe move comes after the SEC in January approved bitcoin ETFs. A spot ethereum ETF will allow investors to gain exposure to the price of ethereum without the complications and risks of owning ethereum directly.\n\nOver the last three months, the price of Ethereum has risen by more than 5 per cent to trade at levels or around $3,590 on several cryptocurrency exchanges.\n\nAnd in a note published by Bybit, the world’s third largest cryptocurrency exchange says that “the game-changing ETF will bring the second-largest cryptocurrency to everyday brokerage accounts and institutional investors”.\n\nBybit further notes that trading in an ethereum ETF is expected to kick off in the first week of July.\n\n“Ethereum is the crypto product favored by traditional capital such as BlackRock and Franklin Templeton, both of whom have tokenised funds on the platform,” said Hao Yang, head of financial products at Bybit.\n\n“Given this, the chain seems poised to become the institutional pick. With its native yield, the ETH token allows for composability, and we are seeing protocols building interesting derivatives based on ETH’s stable yield, leveraging this to create crypto primitives that mimic those built on top of the US Treasury market. Finally, because a portion of ETH is burned (sent to a wallet from which no withdrawals are possible), the asset can become deflationary, which means the more network effects kick in, the scarcer the asset becomes.”\n\nPublished below is the full note from Bybit, which provides an explainer of what to expect in the coming weeks and months.\n\nWhat is the Ethereum (ETH) ETF?\n\nAn exchange-traded Fund (ETF) is an investment fund traded on stock exchanges, holding assets such as stocks, commodities, or bonds. The ETH Spot ETF is unique because it is directly backed by Ethereum, meaning it holds actual ETH in its reserves. This allows investors to gain exposure to ETH’s price movements without purchasing or managing the cryptocurrency directly.\n\nWhat’s the Impact?\n\nThe potential inflows resulting from the ETH Spot ETF are substantial. Expectations are that it will capture 15-20 per cent of the assets of Bitcoin ETFs in the US, translating to around $8 – 12bn and more from global markets. These anticipated inflows are driven by market interest, accessibility, and regulatory approval, enhancing overall market stability and growth.\n\nMoreover, based on Metcalfe’s Law, the network effects of increased adoption and usage of Ethereum are expected to strengthen its ecosystem, further driving up its value. The introduction of the ETH Spot ETF is likely to bolster development on Ethereum, solidifying its position as a cornerstone of the digital economy.\n\nGiven these developments, many crypto analysts and experts expect ETH to reach new all-time highs by the end of the year.\n\nAccording to recent data, Bybit’s institutional investors’ exposure to ETH has almost tripled since the ETF announcement on May 24, 2024—moving from 6.54% to a current weighting of 14.29%. This surge underscores the growing confidence in Ethereum’s future performance and the expected positive impact of the ETF launch.\n\nInstitutional Investor Allocations Before ETH ETF Announced (Snapshot 10/5/2024)\n\nInstitutional Investor Allocations After ETH ETF Announced (Snapshot 14/6/2024)\n\nRetail investors on Bybit have also increased their ETH allocations, although not as dramatically as institutional investors. The allocation to ETH has risen from 7.40% to 9.52%, reflecting a cautious but positive response to the ETF announcement.\n\nRetail Investor Allocations Before ETH ETF Announced (Snapshot 10/5/2024)\n\nRetail Investor Allocations Before ETH ETF Announced (Snapshot 14/6/2024)\n\nConclusion\n\nThe announcement of the ETH Spot ETF has had a big impact on investment portfolios. Institutional investors have shown a significant shift in their strategies, tripling their ETH allocations, while retail investors have steadily increased their exposure to Ethereum. These changes highlight the growing confidence in Ethereum’s future and the potential of the ETH Spot ETF to drive further market dynamics."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOeG0zcHd3dHZScVY0MHFlWV9TTHRIMFBIRVhCTkFER2VrenpkTWE3dFpheUE3MmQ2RWJzXzcyUzRoYlRQbnlBNDdlcVRqQ0dmZ1ZCUlVXM1BKSVg2N2NPZ1RCNDlubzVTTTdKWEdPX3o5RkhkME94MTZKWmJRYjMtc0xXbm4wOUHSAYwBQVVfeXFMTmd3LVFBRzFHMksyel9BdndhMXdROUo5M0NmT3o4Qk52ZGVkdXIzd3ZieVh1dUZKa00tRTRoRW9RMWE1QVJUTklWcVk2SU9MeVRQX0dzVnZvOGk3VDZRNXNkU3RCR0JDQTVtc0hGYUxEZnF0UGFfRjNvdjRWd3BWeHg4Tll2V2NOeGtyNWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Get More Attention Than Bitcoin Now, Here's Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nMarket sentiment is shifting at a very fast pace, with Bitcoin (BTC) and Ethereum (ETH) dominating social trends. According to top market analyst Michael van de Poppe, with the ongoing drop in the dominance of Bitcoin, Ethereum might take over these social conversations moving forward.\n\nAdvertisement\n\nShifting investor focus\n\nAs spotted by van de Poppe, the dominance of Bitcoin has plateaued at 58%, setting the tone for Ethereum to enter the limelight. Van de Poppe noted that the spot Ethereum ETF product will shape the narrative eventually, as investors look for the next things that can drive optimism.\n\n#Bitcoin dominance continues to peak at 58%.\n\n\n\nIn that regard, it seems likely that we'll be having more eyes on Ethereum rather than Bitcoin in the upcoming period due to the Ethereum ETF. pic.twitter.com/bVRk9uwUSy — Michaël van de Poppe (@CryptoMichNL) June 25, 2024\n\nBitcoin has not helped the market much lately as its price has continued to nosedive, driving bearish sentiment for other altcoins. At the time of writing, the price of Bitcoin has inked a minor 0.24% surge to $61,324.10 after falling as low as $60,660 in the early morning trading session.\n\nThe majority of altcoins notably decoupled from Bitcoin, with the likes of Solana (SOL) outshining on the market, with prices soaring 9.11% to $138.59. With Bitcoin failing to step up as needed, the decoupling has spread to Chainlink (LINK) and Toncoin (TON), among others, all of whom are now up 5.69% and 5.4% to $14 and $7.612, respectively.\n\nEthereum spotlight\n\nThis month thus far, the trends on the spot Bitcoin ETF market marked by the sustained outflow have marred any chances of recovery in the near term. The majority of the uptick the market has printed thus far has come from Ethereum as the U.S. SEC ended its securities investigation into the asset.\n\nAs it stands, the ecosystem is now anticipating word on the potential approval of S-1 registrations that will ultimately usher in the trading of ETFs. Though experts have predicted there might be a lower volume of the product, it is still considered the biggest catalyst that might break the current market bull-bear uncertainty."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOYnFNeU5oTnh2MG1jRFpNOXZNTlNQeEcwRmV4akRaNEVGQVFpTFlYa0dlbDhaLUZ0OVlZQVRMcEtmQWJVYWxlbmhsR1Z3MUhoY0IyaU1rTWl5bFBfT1dlVlNpVWZFbUZOVzFYcUxFbnFBOUt4NW5hWGZkeENfMlI5cmQ0RENFNHhsb3c1a3VRVG9mdnZHSF96OUNnaDhmMjZZYU00ZmhORXpET2dSeDdsOVVkMERNNDZidXk2QtIBxAFBVV95cUxQaE9uUjYxcTZkMzAzSm5FSk1fXzAzUEROcE1iWjZMQVlfSGJMTEN3Mjlrdi0wSGowQ2xSamdnaktNX3JKdVphR1RELXJzV0R0QmYtZ1hxQjUtNTY5dncwVGdIR08xc3Q2SV94TXZVVTkwZW5LZnZFdlFTV2g5MW1jemZkbWYwQzdQYWF3SjBNaTNia2h2Yk1ZQzJScC1mYUlhRDd0UUFEQVBrVnBxTWo1dHc0eENpNnh3czBkWUtpVkdFOXNP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "After Sweeping Bitcoin and Ethereum Liquidations, Analysts Are Watching for Accumulation Whales - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe cryptocurrency market continues its downward spiral this week, having seen about $191 million worth of crypto derivatives contracts liquidated in the last 24 hours.\n\nBitcoin (BTC) is the most impacted, accounting for half of the total liquidations, of roughly $103 million. Ethereum (ETH) follows with $33 million in liquidations. This follows the 24-hour tally rising to $330 million yesterday afternoon after Bitcoin fell below $60,000 for the first time since early May.\n\nThis sharp rise in liquidations is reflective of the heightened market volatility and bearish sentiment.\n\nThe Bitcoin price dipped by 2.2% in the last 24 hours to sell for $61,516.48, while the Ethereum price shaved off 0.7% to trade at $3,382.27 on Tuesday.\n\nAD\n\nAD\n\nBTC and ETH have lost about 6.5% and 1.4% in the last seven days, respectively. But relative to the plunges they saw yesterday, both coins are on the up. Bitcoin is 0.2% higher than it was this time yesterday and Ethereum has rebounded 1.8%.\n\nTime for the accumulation whales to respond “This is time when accumulation whales are likely to respond to market fear, indicating a potential V-shaped rebound.” – By @mignoletkr Full post 👇https://t.co/CJLU7nPN9w pic.twitter.com/HOXng629Ym — CryptoQuant.com (@cryptoquant_com) June 25, 2024\n\n“What’s happening right now with Bitcoin prices is mostly related to a lack of demand growth or momentum from traders, whales, ETFs,” Julio Moreno, head of research at CryptoQuant, said on Twitter.\n\nAnother analyst at CrypoQuant, who goes by the pseudonymn Mignolet, suggested on Twitter that accumulation whales may swoop in to halt the bearish for a “potential V-shaped rebound.”\n\nAD\n\nAD\n\nThe current wave of liquidations primarily affected long positions, according to CoinGlass. This trend has been observed across various exchanges, suggesting a widespread market reaction to recent negative news and economic data.\n\nIn the past 24 hours, 64,829 traders were liquidated, the total liquidations comes in at $294.14 million, according to CoinGlass. The largest liquidation order was on a BTCUSDT contract valued at just over $15 million.\n\nBitcoin and Ethereum lead liquidations\n\nThat Bitcoin is hardest hit in these liquidations highlights the continued volatility in the market’s largest cryptocurrency.\n\nBitcoin’s price has been under pressure due to macroeconomic factors, regulatory concerns, and market sentiment shifts. Last week, German authorities sold off seized Bitcoin worth about $325 million within 48 hours.\n\n“Having seen a slippage in the price of BTC, the German government is releasing significant tranches of BTC and has taken a view that the price of BTC is to soften for a while to come,” Robert Quartly-Janeiro, chief strategy officer at crypto exchange Bitrue, told Decrypt last week.\n\nAs traders’ positions are forcibly closed, the ripple effect has further pressured BTC's price, contributing to a sustained bearish market outlook.\n\nEthereum also faced significant liquidations, albeit to a lesser extent than Bitcoin.\n\nAD\n\nAD\n\nThe $33 million in ETH liquidations since this time yesterday underscores the challenges faced by the second-largest cryptocurrency, which has also been dealing with similar market pressures and investor sentiment.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOSG5KWXpXYTlDMkN5eUZrY3VDS2Q5bGUxTG5VQnNLLTdPU1dVSkxXX0xUQ3hMeVExa2gwblhRWEtTamVHUUpFb2FHd2taaDRBOFAxZzFQOEpzczlvOUgwTk9ZUmlpU25iT2YzLXFNU05kZFA1M1NVNGVjMjEyZlpCYjQyeVFYa3N0TEU0UjZkOXo0LXdpemNpVmxKdjV4RC1zc1V3Y0R0aEZhLU43RVRTNm9BVkRtcFA2YVh2N0lrYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "July forecasts for the price of Bitcoin and Ethereum: analysis by Ryan Lee of Bitget - The Cryptonomist",
        "content": "According to the latest forecasts, in the month of July, the price performance of Bitcoin (BTC) and Ethereum (ETH) could be strongly influenced by a series of economic and market factors.\n\nRyan Lee from Bitget offers a detailed analysis of the main elements that could determine the trends of these two giants of cryptocurrencies. Let’s see all the details below.\n\nWhat are the price predictions for Bitcoin and Ethereum in the near future?\n\nAs anticipated, Ryan Lee of Bitget has released important forecasts regarding the price trend of the two well-known cryptos Bitcoin and Ethereum. One of the main factors to consider, according to him, is the macroeconomic environment.\n\nRecently, in fact, the net liquidity index of the Federal Reserve (FED) has exceeded 6.5 trillion dollars, releasing 400 billion dollars of liquidity into the market since the end of June.\n\nThis level of liquidity is the highest in the last two years. Furthermore, with the prospect of future interest rate cuts, market liquidity is expected to become even more abundant. Thus favoring a bull trend in the cryptocurrency market.\n\nAnother positive indicator for the cryptocurrency market is the increase in the market cap of stablecoins, which went from 160 to 162 billion dollars in June. This increase indicates a net inflow of capital into the cryptocurrency market.\n\nDespite a contraction of the overall market cap in June, the increase in stablecoins suggests that leverage in the cryptocurrency market is currently low, leaving room for further bull movements in the future.\n\nKey events: Mt. Gox refunds and spot ETFs on ETH\n\nMoving forward, we see two fundamental events that could significantly influence the prices of BTC and ETH in July. First of all, Mt. Gox has announced that it will start reimbursing BTC and BCH at the beginning of July.\n\nThis refund has raised fears of significant selling pressure, as Mt. Gox has moved 7 billion dollars of assets on the chain. A factor that could potentially cause a substantial drop in BTC prices.\n\nD’altro canto, i progressi sull’ETF Spot su ETH potrebbero avere un impatto positivo su Ethereum. Alla fine di maggio, la SEC ha approvato il deposito 19b-4 e recentemente, Fidelity, 21Shares e Grayscale hanno presentato i moduli S-1 dell’ETH Spot ETF alla SEC.\n\nIt is very likely that the ETF ETH will be officially launched on the US capital market in July. Thus leading traditional funds to directly purchase ETH and potentially determining a bull trend for ETH.\n\nIn summary, it is expected that in the month of July the price range of BTC will be between 58,000 and 73,000 dollars, while the price range of ETH will be between 3,100 and 4,500 dollars.\n\nIt is likely that the ETH/BTC exchange rate will continue its upward rebound, supported by the macroeconomic factors and market events described.\n\nThese developments could determine an interesting dynamic for investors and enthusiasts in the cryptocurrency sector.\n\nBitcoin drops to $61,000: brief analysis of the causes of the crash\n\nBitcoin has recently experienced a significant price drop, falling towards the $61,000 level and hitting a new monthly low.\n\nVarious factors have contributed to this decline, including mining activities, Federal Reserve policies, the lack of new inflows, and market indicators.\n\nBTC miners play a crucial role in the recent decline. There has been a significant increase in sales from old wallets, predominantly held by miners, following the recent Bitcoin halving event, which cut daily production from 900 to 450 Bitcoin.\n\nThe Bitcoin miner reserves have dropped to the lowest levels in the last 14 years, with a decrease of 50,000 units since the beginning of the year.\n\nThis month, the miners sold over 30,000 BTC, worth about 2 billion dollars, mainly on the exchanges, directly contributing to the price drop.\n\nFurthermore, the German government has moved 600 million dollars of Bitcoin to the exchanges, selling 200 million dollars in a single day.\n\nWith holdings of approximately 3 billion dollars in Bitcoin, this sudden sell-off, likely induced by financial requirements amid economic pressures, has had a significant impact on the market.\n\nFinally, on Thursday, the spot Bitcoin ETFs listed in the United States recorded the fifth consecutive day of outflows, totaling over 900 million dollars for the week."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE53TG1qZ29xUkpBeW9LQm5xa1FSVlBoNjBaZ3M4NlVuQjlRR3YtSUZld0MwaUF3eER4Y2QyaTJZbGFjaWlwZE9NQmF5UnNSZ3FTRURYZld0MzF1S2Njd1JvdXM4RFFheFlsZkZ1SVJkb3dIdl85?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum ETF Drive Prices Above $4K? - CoinGape",
        "content": "The cryptocurrency market is filled with excitement and expectation as the possible introduction of U.S. spot Ethereum (ETH) ETFs approaches. Analysts forecast a potential launch in early July, sparking discussions on whether these ETFs can attract as much demand as the hugely successful spot Bitcoin (BTC) ETFs. With Ethereum’s price being closely examined, the important question is whether Ethereum ETF will cause prices to surpass $4K.\n\nThe Bitcoin ETF Benchmark\n\nIn order to understand the importance, let’s examine the performance of Bitcoin ETFs. Since January, BTC-related products have collected approximately $14.5 billion in net flows and have grown their assets under management (AUM) to more than $50 billion, as reported by Farside Investors.\n\nadvertisement\n\nThis significant interest and investment have established a high standard for future cryptocurrency ETFs, including those designed for Ethereum.\n\nSkepticism Surrounding ETH ETFs\n\nIn spite of the excitement, there is a lot of doubt regarding the possible influence of Ethereum ETFs. Numerous analysts think that ETH ETFs could only attract a small portion of the demand that Bitcoin ETFs have seen.\n\nQuinn Thompson, who started the crypto hedge fund Lekker Capital, pointed out that the market is underestimating the positive effects of the forthcoming ETH ETF.\n\nAnalysts at JPMorgan predict that ETH ETFs may see inflows of $1 billion to $3 billion in the latter half of 2024. ETF analyst Eric Balchunas from Bloomberg predicted that Ethereum ETFs could potentially secure 20% of the market share currently dominated by Bitcoin ETFs.\n\nThese forecasts rely on the current demand trends for ETH compared to BTC in the futures market.\n\nBullish Counterarguments\n\nContrary to the bearish outlook, several analysts remain optimistic about the potential demand for Ethereum ETFs. Vetle Lunde from K33 Research estimated that ETH ETF products could see $4 billion in net inflows within the first five months alone.\n\nBitwise CIO Matt Hougan also expressed a bullish perspective, viewing the second half of 2024 as being filled with ‘tailwinds’ that could boost ETH demand.\n\nA recent report from Deribit Insights further bolstered this optimistic view, highlighting increased mid-term optimism based on options data. QCP Capital analysts echoed this sentiment, suggesting that if ETH captures even 10-20% of Bitcoin ETF flows, it could propel the price above $4,000 and possibly towards its all-time high of $4,800.\n\nMarket Sentiment and Predictions\n\nAlthough the outlook is positive, there has been less enthusiasm for Ethereum spot ETFs in the market compared to when Bitcoin ETFs were introduced earlier this year. Entrepreneur Andrew Kang highlighted that the effects of ETH ETFs are not as straightforward, predicting that Ethereum ETF investments will make up approximately 10% to 15% of Bitcoin ETF investments.\n\nKang predicts that ETH’s price may range from $3,000 to $3,800 prior to the ETF debut, but could possibly decrease to $2,400 to $3,000 after the launch, resulting in a substantial decline from its present worth.\n\nYet, there is a positive aspect. By any chance Bitcoins hit the $100,000 milestone by end of this year, or early 2025, it could also both ETH, alongside other altcoins.\n\nOptimism in Institutional Interest\n\nDespite the doubts, there are still optimistic signs on the way. Asset management giants such as BlackRock could utilize Ethereum to tokenize physical assets, thereby increasing the value of ETH.\n\nAdditionally, the SEC has finalized its inquiry into the Ethereum Foundation, potentially confirming ETH as a commodity instead of a security, thus increasing its attractiveness to institutional investors.\n\nCurrent Price Action of Ethereum (ETH)\n\nCurrently, Ethereum is trading at $3,363.36, after dropping in value by 4.15% over the past day, and 5.37% in the past week. However, ETH is experiencing heightened trading activity, with an increase of over 80% in trading volume, over the past 24 hours.\n\nConclusion\n\nThe price direction of ETH will significantly be impacted by the launch of Ethereum ETFs. Although opinions are split on whether these ETFs will have the same level of demand as Bitcoin ETFs, there is still potential for a significant impact. In case the optimistic projects of Ethereum prove accurate, the price of the second largest coin may surpass $4k. Achieving this milestone will be very significant for cryptocurrency. As the date for the launches approaches, both analysts and investors will be watching closely, on the market response, and whether or not Ethereum can meet the high expectations set before it."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQREFkaEE4VHRpbmZsVTh4S0M1YWd0WTNTTkFvbFlIaENUQlVINk1RWWw4MVBqbXVGZVR2bEo2aHVsdG1hU2FTSGZHWTdxMm1rd0haT2F0anByMHF3UDdrckZOZVB5NVNSV05uaW5YczBYbDM0WFk4cWNUel94d2pXVHdsVnY0TVHSAYwBQVVfeXFMTTk3T2pjR2Q3aHlXSTBpVTFPTl9CR3JibmlmUXAtaEZvM3lhTzhiaWtQN3NBcE11Z28xMWxFV2JULTJCZHNTWEFSbnAyUUY1cUg2SjE1VktGTTN2eDlqRkJZLWV3SmtlM19QTTFNQ3ZUQW5IRzMwNjFuZWNHSno3SUJna3ZEQlE3bFNkYTc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Will ETFs push ETH to $4K or drag it down to $2.4K? - AMBCrypto News",
        "content": "Analyst warns that ETH could dump to $2.4K after ETF launch\n\nAnother market observer blamed macro conditions, BTC and SOL, for ETH’s negative sentiment.\n\nExpectations of the Ethereum [ETH] ETF have been low, and analysts have had mixed views on the topic.\n\nAs of press time, ETH retreated to a low of $3.2K, an 18% drop from its recent high of $3.9K after the partial approval of ETFs in late May.\n\nWith only days to possible ETF launch, Andrew Kang, founder of crypto fund Mechanism Capital, expected ETH to drop further to $2.4K. Part of his recent analysis read,\n\n‘Before the ETF launch, I expect ETH to trade from $3,000 to $3,800. After the ETF launch my expectation is $2,400 to $3,000.’\n\nKang suggested that ETH ETF flows could be dismal in the first few weeks for two reasons.\n\nFirst, the SEC’s 180-degree pivot and approval in late May was a surprise move that limited the time to convince large ETH holders to move to ETF.\n\nSecondly, Kang cited that moving to ETF doesn’t come with staking yield perks. As a result, he estimated ETH ETF could attract only 30% of BTC ETF flows in the first six months, approximately about $1.5 – $4.5 billion.\n\nOther reasons for Ethereum’s negative sentiment\n\nOn his part, Quinn Thompson, founder of crypto hedge fund Lekker Capital, suggested that the negative ETH sentiment stemmed from being under the shadow of BTC and Solana [SOL].\n\nThompson added that SOL’s repricing relative to ETH reinforced the ‘ETH killer’ narrative.\n\n‘SOL has repriced 6x higher relative to ETH, so this is not as easy of a layup as it was’\n\nThompson also noted that the BTC ETFs and massive interest in underpriced SOL further isolated ETH into ‘middle child syndrome.’ Moreover, the liquidity crunch made things worse,\n\n‘On top of that, overall prices have been stagnant to down for 3 months and market sentiment is in the gutter due to a macro/liquidity blip.’\n\nDespite the negative sentiment, other analysts, like QCP Capital, maintained a bullish outlook ahead of the ETF launch in early July and noted,\n\n‘ETH bullishness persists with ETH vols trading at an 18% premium to BTC in expectation of an imminent ETH spot ETF launch.’\n\nQCP analysts had previously projected a retest of $4K was possible after the ETF launch. As of press time, ETH traded at $3.2K, and it remains to be seen how ETF will determine volatility and price direction."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNUlpMc3ZaUFlEUW5XTUNaaVJVU0hUd0x5Z3hueldDenUyMWs0NmNfYmhZNDNCMEFPbmo5cWJWRnFWajJpSlRrcHBiT2o4M3MwSHhEa1NyM2F0bGFXNlhLUDdPRnJaMnpGWGdTbXg4MDZ4czFLeTRzdkhVbFVRX1F1eURNdTVUeV9IRGJSTHJFNExWX1lvbE1uVFpwellsUU9CWmlV0gGoAUFVX3lxTFBqam1vQldyenZpY0FSc3UyRTNfdXRpaUdIdUd2OW44VWxySlc4aXZhWUJGLUotWFBxdUVSSFBpUTUzRTFuTnd2TFZpeE5Pdi1TdGJub2tvenoyeEQ4cURITDJwVmFHcXFQZEsxdWNnLVlXdnF3dGcxVUdvV0ItMDY0Y1lZS3JtejNqUnRvNlZwOE9MMEdmaEt5Q1hMbE1oT1NaRDVJb1JOeQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Incoming Ethereum Price Crash: Analyst Flags Warnings of Spot ETH ETF Launch - CryptoPotato",
        "content": "The reaction and market sentiment towards Ethereum spot ETFs is somewhat muted in comparison to when Bitcoin products launched earlier this year.\n\nThese are the findings of crypto entrepreneur and investor Andrew Kang, who published a lengthy analysis of the impact of Ethereum ETFs on X on June 23.\n\nBitcoin ETFs opened the door for many new buyers to make BTC allocations within their portfolios. However, “the impact of ETH ETFs is a lot less clear-cut,” he said.\n\nETH Price Could Tank\n\nKang estimates that the Ethereum ETF flows will be around 10% to 15% of Bitcoin ETF flows, resulting in roughly $500 million to $1.5 billion in true net buying within six months.\n\nIt was reported last week that Fidelity will seed its Ethereum ETF With $4.7 million, so the buying has already begun. In March, Standard Chartered predicted that inflows would reach $45 billion in the first 12 months of Ethereum ETF trading.\n\nNevertheless, Kang offered several reasons why the impact of an Ethereum ETF is expected to be less significant than that of Bitcoin.\n\nEthereum is seen as more of a tech asset rather than a macro asset like BTC. Additionally, there is less institutional interest and buying pressure for it since the its current valuation metrics, such as the price-earnings ratio, make it harder to justify to traditional finance allocators, he said.\n\n“It is natural that those deep in the crypto space have a relatively high mind share and buy-in of Ethereum. In reality, it has much less buy-in as a key portfolio allocation for many large groups of non-crypto native capital.” https://t.co/On2KWjAlLx — Andrew Kang (@Rewkang) June 23, 2024\n\nMoreover, Ethereum’s positioning before any ETFs are launched is different from Bitcoin’s as the asset is already up 4x from its lows while BTC was up 2.75x before its ETF launches, he added.\n\nTherefore, Kang expects ETH to trade between $3,000 and $3,800 before the ETF launch but potentially fall to between $2,400 and $3,000 after the launch. A dump to the lower estimate would wipe 30% off the asset’s current value.\n\nHowever, if BTC increases to $100,000 at the end of this year or early next, it could drag Ethereum and altcoins up with it, he predicted.\n\nKang’s bearish Ethereum stance didn’t end there. He expects a continued downtrend for the ETH/BTC ratio over the next year, ranging between 0.035 and 0.06.\n\nETH Prices Dip Below $3,400\n\nMeanwhile, ETH’s price tumbled in the past 24 hours alongside the broader cryptocurrency market, which remains riddled with uncertainty.\n\nAt the time of this writing, Ethereum is found trading below $3,400, down 3.4% on the day and 5.3% on the week.\n\nThe rest of the market is also declining. Bitcoin dropped below $63K for a 2.5% loss in the last day, while BNB and Solana lost 3% and 6.2%, respectively.\n\nNot All Bearish On Ethereum\n\nThe only bullish prediction was that large asset managers such as BlackRock could use Ethereum to tokenize real-world assets, but “how much value this translates into for ETH and on what timeline is uncertain,” he concluded.\n\nAdditionally, ConsenSys said last week that the US Securities and Exchange Commission was closing its investigation into the Ethereum Foundation.\n\nThis could solidify ETH’s status as a commodity rather than a security, which is also very bullish for the asset and the rest of the altcoins."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOOUZtclI5T1FrWDJuZGhtaGk3ZGE5N2Q2dU5iOEVORklVVE9sUVVXWlVOOENzN0l4YWhZWFBjN1lTSG1OWElsZzE1dzBEUUNsb2Fsd25feDJ4aVozWDFLYVlPR3NuYnNSTTAyVUUxTnV4RzM3Sm1EUUJsNUlxLTdXZGZ4eXZ5TTMwQ2lLbHczOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Crypto derivatives markets: Bitcoin vs. Ethereum - CryptoSlate",
        "content": "Introduction\n\nDerivatives play a crucial role in financial markets, providing essential tools for hedging, speculation, and price discovery. These instruments derive value from underlying assets, allowing market participants to manage risk and gain exposure to asset price movements without directly owning the assets. In the traditional financial market, derivatives are a massive category. The Bank for International Settlements (BIS) reported that the notional amount of over-the-counter (OTC) derivatives reached $667 trillion at the end of last year.\n\nWhile the crypto derivatives market is significantly smaller than that, it has grown substantially in the past couple of years and has become an essential part of the broader market. Crypto derivatives have become indispensable tools for managing the inherent volatility and leveraging investment strategies. Bitcoin (BTC) and Ethereum (ETH) derivatives are the pillars of this relatively young market, despite many other derivatives products based on smaller cryptocurrencies.\n\nThe growing adoption of these derivatives shows their importance in enhancing market liquidity, enabling sophisticated trading strategies, and facilitating price discovery. In this report, CryptoSlate will explore the theoretical and practical differences between BTC and ETH and their respective futures, options, and perpetual futures markets."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPNFp0Vjc2b1lBZFQ5V1I5cVNEOTZKbWFwM0xjdGI1ZzN2TTBtdzVjTndBR0M5ZnkxeXo5QjdmRUpCMDdadXdiNUFyM0dUdEMzWVJfdjNFcWtCYjRTZ0hYNHpRX1AwcVdhZ2QwRHFCeVNwZlhLTV9xS3NEd3JDOEloYUY3M1FOWVZQczRmdVUzQXRyUzl2TXfSAZsBQVVfeXFMTndub3NFMG1lQWtMWnJTSFgxTUNxcHBIMmNqVnU2ZWcxZVctWnV0V0tCZnBTT3hyOHhTRUFIaHBhWjBIbVdXeGNZSElFeFdhZlVMM2k5NW45aG1iUzZUalFLdTFWbXl5QlQzTk9ya05CWkd4REJadXhxYXBaWDIxNXVfWGZDQUZBb2VldmRZX1ExNzdRTWdVVFpaTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Deviates From Historical ETH Selling Patterns - CryptoPotato",
        "content": "During previous bull markets, the Ethereum Foundation has demonstrated a keen ability to time the market with its ETH holdings.\n\nHowever, the foundation appears to have departed from this established pattern.\n\nEthereum Foundation’s Unexpected Selling Restraint\n\nThe Ethereum Foundation was found to have executed large sales of ETH near peak valuations in the past. This strategy has allowed the organization to capitalize on high prices and potentially secure funding for ongoing development and operations.\n\nAccording to IntoTheBlock’s latest data, the foundation has yet to engage in any significant selling activity in this current market cycle.\n\nSuch a deviation raises important questions about the organization’s current strategy as per the on-chain intelligence platform as well as the future direction of the market. Ethereum Foundation refraining from offloading ETH tokens could mean that it believes the cryptocurrency has more potential for growth.\n\nETH has been under significant pressure along with the broader cryptocurrency market. The asset has dropped to $3,370 this week. Hence, such a case presents bullish sentiment despite almost a 10% drawdown in its price over the past month.\n\nAlternatively, the Foundation may have adopted a new approach to managing their assets.\n\n“Historically, during each bull market, the Foundation has strategically sold substantial amounts, often aligning these sales almost perfectly with market peaks. In the current cycle, the Ethereum Foundation has yet to execute any significant sales. Does this mean the peak is yet to come, or has the Foundation changed its approach?”\n\nPrevious ETH Sales\n\nIn January this year, Arkham Intelligence flagged a blockchain address associated with the Ethereum Foundation that sold $1.6 million worth of ETH.\n\nLater in April, Peckshield Alert revealed that the Foundation had converted a portion of its ETH holdings into stablecoins in April. According to the data, the foundation converted 100 ETH to 354,000 DAI. During this time, ETH was trading above $3,600."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNOGZWY1Y5MFU1Yk1MWU9WcFYzQ01SN096WVZRUklpaERFbWlhT2RXcnZLSXJvUWhjdnYxUWZ5bFpNOE9IdlMzcVlBcjNob2RRYkNvSG9xZjhzSVdaRFNEOXRKbnF5NUlrYVU0ZGt1NXR4OHlFYjdUMkJlaDJoeVN6OG5MUFNaQTVrbm03QmhSQzF1YkR3aWlhR0xJVU5TNTZHWVFzNTNzY2Y2WlQxYzBDUW9SWEN5dlgzSkdGTkJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "This Historical Ethereum Top Signal Is Yet To Appear This Cycle - TradingView",
        "content": "On-chain data suggests this signal that has historically occurred around Ethereum peaks has yet to appear in the current cycle.\n\nEthereum Foundation Wallets Haven’t Made Large Outflows This Cycle So Far\n\nIn a new post on X, the market intelligence platform IntoTheBlock has discussed a pattern that Ethereum has witnessed alongside its previous market peaks.\n\nThe pattern in question is related to the netflows for the wallets associated with the Ethereum Foundation. The ETH Foundation is a non-profit entity supporting the cryptocurrency and its ecosystem.\n\nBelow is the chart shared by the analytics firm that shows the trend in the net amount of ETH (in USD) moving in or out of the wallets connected to this organization.\n\nNewsBTC\n\nAs is visible in the above graph, the netflows for the Ethereum Foundation have generally taken negative values during the past bull markets. Negative netflows naturally correlate to a net amount of ETH movement away from the wallets connected to the company.\n\nInterestingly, the indicator has seen especially large red spikes around the tops of the cryptocurrency. As IntoTheBlock explains,\n\nHistorically, during each bull market, the Foundation has strategically sold substantial amounts, often aligning these sales almost perfectly with market peaks.\n\nThe chart shows that the indicator’s value has been more or less neutral during the past few months, even though the asset’s price has increased significantly.\n\nThis suggests that the Ethereum Foundation hasn’t been making any major sales during this bull market. Given the historical pattern, this may be a sign that a top isn’t yet here for the cryptocurrency, or at least the organization doesn’t judge it to be so.\n\nAnother explanation, however, could be that the non-profit entity has changed its strategy for this new cycle, meaning that the past trend would no longer hold the same weight.\n\nIn some other news, the official email of the Ethereum Foundation was recently compromised, as Tim Beiko, one of the ETH developers, had revealed in an X post.\n\nThe developer had noted that the organization was trying to reach out to SendPulse, an email automation service used by the firm, to resolve the problem.\n\nIn a follow-up post, Beiko confirmed that the team sent out an update to subscribers of the Ethereum Foundation blog, warning them that the previous email, announcing a “staking platform” by the organization, resulted from the compromise.\n\n“We should have locked down all external access, but we are still confirming,” said the developer in the post.\n\nETH Price\n\nEthereum plunged under the $3,300 level yesterday, but the asset has since recovered above $3,400."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNc0Vuc05yLURhVTZKb3g1QllnLXZmZTJTaXZxdVJCSzkyU25UVlBMTnA0SkNLU0wwcjNROXBWZkRUd0JCTkg0b1FXU01nZHIyRTlyZkRaUTE0OEZXWkdJMmg1LTkyOXNobkRSejdGaGJlcy05YkdCNVZnNnAwTFRsNmNZR0xWd0ZZM3NVatIBkgFBVV95cUxNWDR0YW5manVXUW5CQVN4c1lxWlM5ZGFkRERKenpwdFRTdGc2M2hDQkZTWHVCdDR0YktLS3VMemxmMXVGa2lUZ0p2QXkzU1FLWjBYQ2FHQWpQVXViczlhNms2eVRJaUJ1YVhyV05Zd1pIRVZuNjdzSVBTMzJITm8tZmJyUnd4NzVOX0FpSkdtS3FLUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "TRON Dethrones Shiba Inu (SHIB), While Founder Justin Sun Buys Ethereum - U.Today",
        "content": "In the course of what happened on the crypto market in the last few days, and especially in the last 24 hours, another dramatic micro-event occurred, in addition to liquidations worth hundreds of millions of dollars. It is related to the popular meme cryptocurrency Shiba Inu (SHIB), which has been displaced from 11th place among the largest cryptocurrencies by CoinMarketCap.\n\nAdvertisement\n\nThe culprit was the TRON (TRX) token, which is a native token of the TRC-20 network - where one of the largest turnovers of the most popular stablecoin, USDT, takes place. With a market capitalization of $10.59 million, TRX outperforms SHIB by 3.7%. Interestingly, Shiba Inu token beats Avalanche (AVAX), which is ranked 13th, by the same percentage.\n\nJustin Sun allegedly buys Ethereum dip\n\nWhile the TRON token bypasses popular competitors, the man involved in its creation, Justin Sun, deserves his own place in the headlines with his actions. Over the past week, Sun has been making a lot of noise behind the scenes, allegedly accumulating large amounts of Ethereum.\n\nAdvertisement\n\nAs U.Today reported yesterday, the TRON founder has accumulated over 3,967 ETH in the last few days, which is the equivalent of almost $50 million. In addition, today, an address allegedly belonging to Sun withdrew another 1,449 ETH from Binance.\n\nIs the growth of the TRON token ahead of its close market cap competitors related to the possible purchase of a large amount of Ethereum by its leader? It is an open question. It will be interesting to see how TRX's position in the rankings will change when ETH movements from Sun's wallets go in the opposite direction."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPT2gxNFMtR1FlQ1NBLUhXeDJKT3N2MkE2amxrbUFueDVtSVpYX21xZW9NVk5EUFFpczFzWlNxTGZxeHM3UEh6OUlSUE5QVUItTHNtbm96YjAwQno4ckdwQjBPcG5zQWdhWFJYSjlkdW9aWVc2T3p2el9sd0FSc0E1VXRGUjIwRzhTbUHSAY8BQVVfeXFMTi13RFVrZEhjX3c4Qm5BYVktTE9jbVRWcEdTRjIwNFA0TnZZLThtek1lNHpKY0ZTcDIxVVpKd2N2N0lkbC1GT054LXY3WmFhaWltRXZyQ2M2cUJCVlRsa0RUUzcwSmFPMG11R3BxUzlLTjlxcHJrX0lMbksycm5pX2FfeGRNcVZIX1JiRnRWOGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch hype: ‘ETH pumping, altcoins following’ – But… - AMBCrypto News",
        "content": "Despite anticipation around the Ethereum ETF, ETH-based memecoins showed marginal gains.\n\nWhile some see bullish potential in Ethereum’s future, Andrew Kang predicted a possible price drop.\n\nDue to the anticipated approval of the Ethereum [ETH] ETF, altcoins are enjoying a bullish surge, while Bitcoin [BTC] is hovering near the $60k mark.\n\nThis has also resulted in many foreseeing this as a bullish trend for July.\n\nImpact on Ethereum’s price\n\nHowever, at the time of writing, Ethereum declined by 1.15%, showing red candles on the daily chart. But AMBCrypto’s analysis of IntoTheBlock data presented a contrasting view.\n\nThe data indicated that despite the price decline, bulls outnumbered bears with a 7-day average of 107 bulls compared to 95 bears, suggesting that buying pressure outweighed selling pressure at press time.\n\nImpact on Ethereum-based memecoins\n\nContrary to expectations, the upcoming approval of the ETH ETF also did not lead to substantial gains in the memecoin sector.\n\nWhile the top Solana memecoins surged by up to 14% in the last 24 hours, and the leading Base memecoins saw a 7.6% increase, ETH memecoins showed only marginal gains.\n\nFor an in-depth analysis, AMBCrypto examined the price action of Dogwifhat [WIF], a Solana [SOL]-based memecoin, Brett [BRETT], a Base blockchain memecoin, and Shiba Inu [SHIB], an Ethereum-based memecoin.\n\nAccording to CoinGecko, WIF, and BRETT saw increases of 17.1% and 12.4% respectively, while SHIB was up by only 0.5%.\n\nThis disparity indicated that the positive market sentiment surrounding Solana and Base memecoins did not extend uniformly to Ethereum-based memecoins following the news of the ETH ETF approval.\n\nHowever, this did not diminish investor interest in the largest altcoin as underlined by Anomander, Founder at Legion Ventures, who said,\n\n“Obviously, the crypto market has topped on the Ethereum ETF approval. Keep blaming low-tier celebrities for launching their memecoins.”\n\nSharing a similar line of thought, and drawing a comparison between BTC and ETH’s price action, crypto analyst, Michaël van de Poppe took to X and noted,\n\n“Bitcoin dominance continues to peak at 58%. In that regard, it seems likely that we’ll be having more eyes on Ethereum rather than Bitcoin in the upcoming period due to the Ethereum ETF.”\n\nEthereum ETF launch, not a good sign?\n\nHowever, not everyone was optimistic about the ETH ETF’s impact on Ethereum.\n\nAndrew Kang of Mechanism Capital, in his recent post, speculated that the introduction of spot Ethereum ETFs may kick ETH’s price down to $2,400.\n\nHe said,\n\nFurther in his analysis, he pointed out that while there is potential for growth in ETH futures, the current lack of interest from savvy traders could signal concerns about the performance of ETH ETFs in the near future.\n\n“The BTC ETFs opened the door for many new buyers to make bitcoin allocations within their portfolio. The impact of ETH ETFs is a lot less clear-cut.”\n\nAll in all, these analyses suggest that the market is not as bullish on ETH ETFs as it was on BTC ETFs, potentially leading to less dramatic price movements for Ethereum."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOaWw0XzM3bjNoVk1iU2pocjkzUzlXWDJLaE52RThVVFZITWdGZTkteDlBUGdBdjZ4Zk5jYUlsTXJBSzNqdUF4eTFnSHlBLXlpX212Q3d0dnFyQnZvNmNNdFROVE0xRGRWb0VwQV9iWTJwdnNFaWk4QVE0RW9kbUt0X21MLWptWlFTRkRzcjc3cUFsSGMxMk5lQkU3a0pkYmVwOGxYVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Free Falling, Bears Broke $3,300—More Losses Incoming? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is deep in red at press time, down roughly 20% from March 2024 highs. Although the path of least resistance is northwards, aligning with the May 20 bull bar, there are hints of weakness. This is especially so following the recent crash below the support at $3,300. At this pace, traders may consider shorts, trading the bear breakout formation of June 24 as they eye the May 20 low.\n\nTraders are keen on riding the current trend, selling on every attempt higher. The skew shows on Ethereum’s current performance. After days of lower lows, ETH is down roughly 3% in the previous week. Considering the breakout on June 24, participation rose, surging to over $21 billion when writing. Any follow-through of yesterday could see Ethereum crumble even further, dropping to crucial support levels set out in May 2024.\n\nAs bears press on, traders are watching the following Ethereum news today:\n\nEthereum might be down today, but one venture capital expects even more sell-off even once spot ETFs launch in early July. The VC cited the low institutional interest in the product and the low network cash flows as reasons for skepticism.\n\nAmid the crash in ETH prices, network activity is also taking a hit. According to on-chain data, the average gas fee on Ethereum is down to its lowest in seven months. The contraction is partly due to the activation of Dencun in March.\n\nEthereum Price Analysis\n\nETH/USD is in red, down roughly 20% from March 2024 highs.\n\nEven though sellers are dominant, they are yet to completely reverse May 20 gains.\n\nStill, aggressive sellers can continue adding their positions, targeting $2,800 following the break below $3,300 on June 24.\n\nThe only time this will change is if Ethereum bulls absorb the selling pressure, lifting prices back above $3,300 and ideally to June 24 highs.\n\nIn that event, there will be a double-bar bullish formation, potentially marking a local bottom and resumption of the May 20 uptrend."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPV3lFWVNHS04xcDIzVklCLXJSVVRQYlRtZWVuSUV3YmtVaDllc2lsaElDa0tXLXl2VUtNNzYyaXpRdFNMbHRtMG9aSjE0elVlLWEtZVpiM091dkR5bVpYQ3hrdlhVZlk3eTZvNS1wbVpWRFpWOVVaak5McXp6VXhNYS03ZEo5cm14WkxiWW14VkxpNmhuSks4Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Crypto: A 30% Plunge for Ethereum with the Arrival of Spot ETFs - Cointribune EN",
        "content": "Mon 24 Jun 2024 ▪ 4 min read ▪ by Evans S.\n\nThe crypto universe is buzzing with the announcement of the imminent launch of spot Ethereum (ETH) ETFs. One of the most influential players in the sector, Andrew Kang, founder of Mechanism Capital, has recently shared his predictions regarding the impact of this news on the price of Ether. According to him, Ethereum could undergo a drastic drop of 30%, sparking strong reactions and intense speculation among investors.\n\nPredictions for the fall of ETH crypto\n\nAndrew Kang raised the alarm in an article published on June 23, where he predicts a significant decrease in the price of ETH crypto following the launch of spot ETH ETFs.\n\nCurrently, Ether is trading around 3,410 dollars, but Kang anticipates a drop to 2,400 dollars, a fall of about 30%. Unlike Bitcoin, the ETH crypto does not benefit from the same level of institutional interest, which could limit the appeal of ETFs for this asset.\n\nIndeed, the Mechanism Capital expert highlights that the cash flows generated by the Ethereum network have not been impressive recently, and the incentives to convert ETH crypto into ETFs remain weak.\n\nThis prediction contrasts sharply with previous peaks achieved by Ethereum, which flirted with 4,000 dollars last March, during the last Bitcoin historic summit.\n\nComparison with Bitcoin ETFs\n\nOne of the main reasons advanced by Kang to explain this pessimistic prediction is the comparison with spot Bitcoin ETFs.\n\nAccording to him, spot Ether ETFs will attract only 15% of the flows observed for spot Bitcoin ETFs, which is within the 10 to 20% range estimated by Bloomberg ETF analysts.\n\nIn practice, this means that Ethereum ETFs could receive around 840 million dollars in new capital inflows over the same period where Bitcoin ETFs attracted 5 billion dollars.\n\nThis low institutional attraction for Ethereum is exacerbated by a negative perception of its economic fundamentals.\n\nKang asserts that the expectations of crypto natives are often disconnected from the preferences of institutional investors, which reinforces the idea that the Ethereum ETF might not be as popular as some hope.\n\nDivergent perspectives and the future of Ethereum\n\nNot all experts share Kang’s pessimistic view. For example, Patrick Scott, also known as Dynamo DeFi, believes that Ethereum ETFs could follow a trajectory similar to that of Bitcoin ETFs, though he does not predict a doubling of the ETH crypto price.\n\nMoreover, asset management company Van Eck predicts that spot Ether ETFs could help bring Ether to 22,000 dollars by 2030.\n\nDespite these divergent perspectives, it is undeniable that the future of Ethereum will depend on its ability to evolve and strengthen its economic fundamentals.\n\nPresenting Ethereum as a decentralized financial settlement layer and platform for Web3 applications could attract some investors, but current data shows a less promising picture.\n\nThe arrival of spot Ethereum ETFs marks an important turning point for the crypto market. While some experts, like Andrew Kang, predict a 30% drop in the price of Ether, others see these new financial products as an opportunity for Ethereum to strengthen its position in the market. In the meantime, some investors are wondering whether it is better to buy Nvidia shares or bitcoin.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQZ0M0SE1ZMFAyT1VHZlFJUDdwZGpPR3MzZ2VLVFdaSnBsTklIbWNEZ1p6QzJHNEdZN29IWmJCeF9ienhEanBzZ3NFZURRbFhxT0o0eTJnNVJhZlk2eFdUYzhQU0xYeGdTdlZvQTBWV3dEVWJWbXdQNTJsdmlqSllyX1RYZTN4eEQ0MjBraFBOdVhfMW9zWFlPSHVYZHl3SzBjd1JVdkszWTdVUXdvSzEwNTNvOVROTk1MeHVWWGJsb2cyLUxXbEFCUDJNWjBFb3FfRzVxX2J30gHbAUFVX3lxTFBiRVdZQWk5ZV9OWTVxMjdlYS1KRlBYUS10OTJtamd4bHp6am1YTG0tbUhSLUtOYTlPVEkyY1dKcENRa29wUEIwZlQ5UkcwLWlwbWNGRVV4ZlBGcGFwS3RBaFdnSDhvQXNNYV9PelJlcGl1RUd0SFdidDhoWFFPZGxhay1lSXpFd0RVYnItQzdES0lNaHgwX3psR1dRVk5Ub2o5eHZvYk83elN4RWMwdDczdGxpSWwtSmtueFRVNGZRbVFqQlgzZWcxU01mMmxQVncyc3JKYldSVm5NYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin set to retest key levels - FXStreet",
        "content": "Bitcoin price is trading inside a descending wedge, and a breakout above $64,600 signals a bullish move.\n\nEthereum price is approaching its key support at $3,288, the 61.8% Fibonacci retracement level.\n\nRipple price faces resistance at $0.500, its daily resistance level.\n\nBitcoin (BTC) price is consolidating within a descending trendline, with a potential bullish breakout anticipated above $64,600. Meanwhile, Ethereum (ETH) and Ripple (XRP) prices retraced to critical support levels before gearing up for a bullish upswing.\n\nBitcoin price consolidating within a descending wedge\n\nBitcoin price is trading inside a descending channel, drawn from multiple swing highs and lows between early June and mid-June, as shown in the daily chart below.\n\nIf BTC continues to decline, it could find support at $62,451, the 61.8% Fibonacci retracement level from a swing low of $56,552 on May 1 to a swing high of $71,995 on May 21.\n\nIf the $62,451 support holds and BTC breaks above the descending channel, it could rally 7.5% to reach its previous resistance level of $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective mean levels of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nThis development would provide additional momentum to the recovery rally.\n\nIf bullish sentiment prevails and the overall cryptocurrency market shows optimism, BTC may extend its rally by 6% from $67,147 to retest its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if Bitcoin price breaks and closes below its daily support level of $60,800, the bullish thesis could be invalidated, leading to a 4% crash to its weekly support level of $58,375.\n\nEthereum price could retest key support level\n\nEthereum's price is declining towards its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27.\n\nIf this support holds, ETH price could rally 13% to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are both below their mean level of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price set for a downward correction\n\nRipple price faces resistance at $0.499, its daily resistance level, and is currently trading at $0.477.\n\nIf Ripple's price breaks above $0.499, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nThe Relative Strength Index (RSI) in the daily chart is below the 50 mean level, while the Awesome Oscillator (AO) is below its zero line. If bullish momentum persists, both momentum indicators must remain above their respective thresholds of 50 and zero. This would provide further support to the recovery rally.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT 1-day chart\n\nConversely, if Ripple's daily candlestick closes below $0.450, marking the June 7 low, establishing a lower low on the daily chart would invalidate the bullish outlook. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQZVlsX0E4ZTdCVkEzZTR1WGVubk81bzlteWZfU0g4QnRkeWNVdEtvb1BBMDJLYjNIdktUVk5CQTBLU0dMV21IWFZjN1MwQ3JUc0w0LTZFR0tlVmxFaWdlTUZxSlEyQWtySGx5TkgxMkE4QVE1aWVfUlM3OVZBZ3k4akNTVzhyd2ZRd0cxNVhIYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: VC Founder Predicts 30% Fall After ETH ETF Goes Live - Watcher Guru",
        "content": "Ethereum could be set to experience a notable decline as founder of crypto venture capitalist firm Mechamism Capital Andrew Kang predicted the asset to fall 30% after its recently approved Spot ETH ETF goes live. The forecast would see the second-largest cryptocurrency by market cap drop to lows of $2,400.\n\nOver the last 24 hours, Ethereum has fallen more than 5.7% according to CoinMarketCap. The last 30 days have seen ETH on a streak of losses, falling to its current $3,260 level alongside a bearish market. With the impending Spot Ethereum ETF set to go live soon, it may not bring the relief the market hopes.\n\nSource: Bitcoinist\n\nAlso Read: Ethereum ETF Applicants File Updated S-1 Documents With SEC\n\nEthereum ETF Launch Won’t Save Price According to One Expert\n\nThe approval of Spot Bitcoin ETFs in January of this year opened the door for Ethereum to receive the same approval just five months later. Yet, the market may not reward the latter in the same way, as one expert has warned of an adverse effect the investment vehicle could have on the asset.\n\nIndeed, Ethereum has been predicted to fall 30% when its spot ETH ETF goes live, according to crypto VC founder Andrew Kang. Specifically, Kang took to X (formerly Twitter) to forecast an ETH price of “$2,400 to $3,000” after the product launches.\n\nBlackrock filing for Bitcoin spot ETF with a 99.8% approval track record is the most positive news we've had in a while – potentially opening floodgates to 10's of billions of flows\n\n\n\nYet $BTC only up 6% from news\n\n\n\nFeels like a mispricing https://t.co/jrcwzsZ6ET — Andrew Kang (@Rewkang) June 18, 2023\n\nAlso Read: Standard Chartered to Launch Spot Bitcoin & Ethereum Trading Desk\n\n“How much upside would an ETH ETF provide? I would argue not much,” Kang said in the post. Kang also predicted that the Ether product would attract 15% of the flows that Bitcoin ETFs have observed since their approval. The prediction aligns with industry insiders who have estimated fathering between 10-20% of BTC ETF flows.\n\nKang remarked that only $5 billion in new funds entered spot Bitcoin ETFs in the first six months. For Ethereum, that time frame may only bring in $840 million in ‘true inflows’ according to the venture capitalist. That time period also saw Bitcoin reach an all-time high of $73,000 in March. During that bull cycle, Ethereum surged to $4,000"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPOUtSRi1zSnc2dEVaelN0SjV1TF90NGFOcHRhdkFZVnpPbF8zNExGdi1sRDlpa1ZIMTFic242LVRYbWpacFF5WmQzdUJacHo4X09YQUdJM2V2dzE2REZwVU9GOVpvS2I1VGI1VnVYWi1kZ0JGaExoTkpqdjVaWUNocTZHLUFTenoyZ0s5OTMxaTNzQmc0QnZFeVZKYWpTVnFvOF9pN0JzR0hHWk9NLWpkSmY3VThJNmp5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Binance, Ethereum, Solana and Ripple: The Biggest Crypto News of the Past Week - Cointribune EN",
        "content": "Mon 24 Jun 2024 ▪ 5 min read ▪ by Luc Jose A.\n\nAmid revolutionary announcements, technological evolutions, and regulatory turbulence, the crypto ecosystem continues to prove that it is both a territory of limitless innovations and a field of regulatory and economic battles. Here is a summary of the most impactful news from the past week surrounding Bitcoin, Ethereum, Binance, Solana, and Ripple.\n\nElon Musk says NO to crypto on Twitter!\n\nElon Musk, well-known for his support of Dogecoin, is working on launching a payment service via Twitter called “X Payments.” However, this service will not include cryptos initially. Twitter Payments LLC has obtained its first money transfer license in New Hampshire, signaling advances in integrating a fiat currency payment system. The decision to exclude crypto could be related to the volatility and regulatory risks associated with cryptos. This cautious strategy has sparked mixed reactions in the crypto community, with some seeing it as a step back while others see it as a strategic move that could evolve over time.\n\nTether launches Alloy: A gold-backed stablecoin!\n\nTether, famous for its stablecoin USDT, has launched a new stablecoin called “Alloy.” This stablecoin is backed by physical gold via Tether Gold (XAUt) and is designed to offer the stability of gold while enabling digital transactions. Alloy by Tether is a platform that allows the creation of collateralized synthetic digital assets. Users can mint aUSDT by depositing XAUt via smart contracts and price oracles, offering a new form of stability and flexibility in crypto transactions. This initiative is part of the trend towards the tokenization of real assets, offering an innovative combination of traditional security and blockchain technology.\n\nBNB Chain reduces fees by 90% with Haber\n\nThe BNB Chain network has recently activated the Haber hard fork, resulting in an impressive 90% reduction in transaction fees. This update includes the BEP-336 proposal, inspired by Ethereum’s EIP-4844, introducing blob transactions to optimize data storage and processing. By grouping transactions into attached blobs, verification becomes more efficient, reducing network costs to around $0.0001. This improvement particularly benefits the layer 2 solution, opBNB, and the decentralized storage solution BNB Greenfield. Despite a period of volatility for BNB crypto, the technological innovations of the Haber hard fork could stabilize and strengthen its market position.\n\nStandard Chartered enters crypto trading\n\nStandard Chartered, one of the world’s largest banks, has announced the opening of a spot trading desk for Bitcoin and Ether, marking a significant step in integrating cryptos into the traditional banking sector. Based in London, this desk will allow institutional clients to trade cryptocurrencies directly, enriching their investment portfolios. The bank has worked closely with regulators to ensure compliance and security for this new service. This strategic initiative aligns with the growing trend of financial institutions adopting cryptos, with Standard Chartered aiming to position itself as a leader.\n\nRipple partners with ten governments to develop CBDCs\n\nRipple has recently announced partnerships with ten governments for the development of central bank digital currencies (CBDCs). This strategic initiative aims to use Ripple’s blockchain technology to enhance the security and efficiency of global financial institutions. Among the partner countries are Bhutan, Palau, Montenegro, Georgia, and Colombia, each exploring specific aspects of blockchain technology to modernize their financial systems. For example, Bhutan focuses on cross-border payments, while Palau emphasizes an environmentally friendly digital currency. This collaboration has elicited varied reactions within the crypto community, with some fearing increased surveillance, while others see benefits in terms of transaction speed and security.\n\nThat’s the gist of this week’s highlights. But if you want a more detailed recap and in-depth analyses delivered directly to your inbox, don’t hesitate to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQbWVZREM3MUpuOWxlaWNwVlozQXkzdmF1ZHdIdjNTR2VNMjY3VUo1TjZWYmtJeHdjbG5DZmxOd1F0YUpkNFBDVVU3bGIzU0tDbHhhVWNtRTNSc2QtNUR4NGhYYkR6b3Y4V0l2V2ZqeEhFX1gyN3JlVmJCTWFnV0VsZmZYRnVvRTZG0gGOAUFVX3lxTE9ra1laMTl2ZWhseHIxWENlMzVQbUlMQjhLQ3pQNUV4QzZjNU04NU5JNUd0OUxHM2JLOHBEOWdDR2gtRzZ3Y2dSRXI2b1FiMDdaVW53XzVseUF0UGhuYkRzWERkaDg5WXhTWm1OS0wwcm53dExQUE1GNnNFRzhXckNBa1FDZ3V3WWxmRTB4NUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "ETH Price Reversal Soon As Ethereum ETF Coming In Two Weeks - CoinGape",
        "content": "The Ethereum (ETH) Price tanked by an additional 3.72% on Sunday, June 23, amid the broader market correction. However, this would be a good time for bottom fishing as the ETH price reversal could be on the horizon with the spot Ethereum ETFs going live in just two weeks from now.\n\nSpot Ethereum ETF Approval Ahead in Two Weeks?\n\nLast Friday, nearly 8 firms submitted the S-1 amendments to the U.S. Securities and Exchange Commission (SEC) while gearing up for the launch of the spot Ethereum ETF by the end of the first week of July.\n\nadvertisement\n\nNate Geraci, the President of the ETH Store, stated that the next two weeks are going to be crucial for the crypto market. He stated that the approval of the spot Ethereum ETF could have far-reaching implications and holds the potential to put the crypto back on the upward trajectory.\n\nIn his recent tweet on the X platform, Geraci stated: “The biggest thing I am watching for is the fee on the Grayscale’s mini ETH trust”. He believes that this fee could send shockwaves into the spot Bitcoin ETF market, as there’s also a mini BTC trust.\n\n“Buckle up,” says Nate Geraci as he expects some volatility and potential opportunities ahead in the upcoming two weeks. In a major prediction further, Gercai also stated that assets in the spot crypto ETFs would surpass the physical gold ETFs by this time around next year.\n\nEveryone ready for these next two weeks? Spot eth ETFs could *potentially* be approved & trading. Biggest thing I’m watching for is fee on Grayscale mini eth trust. That fee could send shockwaves through spot *btc* ETF landscape as there is also mini btc trust. Buckle up. — Nate Geraci (@NateGeraci) June 24, 2024\n\nETH Price Reversal Soon?\n\nAlong with Bitcoin, Ethereum has been the victim of the selling pressure with its price slipping under $3,400 levels as of press time. However, on-chain indicators suggest that a price reversal could be on the horizon very soon for Ethereum.\n\nAlso Read: Top 5 Reasons Why Ethereum Price Is Poised For A Reversal\n\nDespite the strong Layer-2 activity hitting its all-time highs, the Ethereum gas fee has been lowest in years. This shows that the Ethereum blockchain network is all set to handle higher scalability. Crypto analyst Ali Martinez also stated that the Ethereum active addresses have surged to their highest in three months, thereby reaching a total of 617,170.\n\n#Ethereum just saw its largest spike in active $ETH addresses in three months, reaching a total of 617,170 active #ETH addresses. pic.twitter.com/CSqBOnQhEr — Ali (@ali_charts) June 22, 2024\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNV0pvMlFzdmNLYVZXTXlmQllRTTVqbnR5QUtEbGRNQWlLZmwzaVgwcm9kMDU1cDNnSjNqaDBfelREMV9nSlhWTFRIWllzS0VIZjF0d1dZMk9manoxZmJfUTNhV3JxaW1QZUd6Tl80NjctMXFraUtlVS02aXlldkVPQ3ctb1VleHg2YXl0cVNHNmItTEXSAZgBQVVfeXFMUGVTSXdmTmFiS2xOczUyLXRWYzAyR1gybzBLSEcyS0RrUENEbk8wdDV2bE9LN0dUQ0oxTGRHVHRJYkcwc3RBdXFjMG9PVWRWSjFsMlVpd0RRWWN4N25ndDE1TDBOa2JjRGtVakhuMTB5ZzlYeHlpSUdzY04wWW1PZHFnbHZMWEhNVnV0ZkFvd3R4a0d6OHRnMjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2 Blast Secures Major Exchange Listings Amid Airdrop - CoinGape",
        "content": "Blast, an Ethereum Layer 2 solution developed by Tieshun Roquerre, is making significant strides. The platform has garnered attention with its rapid ascent since its early access launch in November 2023. Moreover, it boasts a total value locked (TVL) exceeding $2 billion.\n\nBlast Gears Up For Launch\n\nFurthermore, Blast’s popularity in Blast-based games is noteworthy. Recently, Blast has also ranked among the top 10 platforms by daily fee generation. This underscores its growing influence in the blockchain space.\n\nadvertisement\n\nOn Wednesday, June 26, 2024, the foundation will unveil the Blast Vision. This will offer a clearer roadmap for its future operations. Moreover, details of the Blast tokens are yet to be fully disclosed. However, it is known that there will be multiple categories for their distribution.\n\nLatest speculations point towards rewards for Blur farmers, who may benefit from the forthcoming airdrop for the Ethereum Layer 2 token. The airdrop is part of Blast’s broader strategy to cultivate a robust ecosystem.\n\nIn addition, the network plans to allocate half of the airdrop to developers through ‘Blast Gold.’ Additionally, ‘Blast Points’ will reward early users based on their wallet activities and dapp interactions. These mechanisms are designed to incentivize both developers and users.\n\nUltimately, the goal is to foster growth and engagement within the Ethereum Layer 2 platform. In addition, the Blast token has registered significant crypto exchange listings for June 26 on Bitfinex and Bybit. This hints at significant adoption upon launch.\n\nAlso Read: Ethereum Layer 2 Blast to Launch Foundation This Week, Here’s Why\n\nBybit & Bitfinex Exchange Listing Details\n\nOn June 24, 2024, at 2:00 PM UTC, BLAST deposits became available on Bitfinex, pending network conditions. If liquidity requirements are satisfied, trading is set to begin on June 26, 2024, at around 3:00 PM UTC. Moreover, BLAST will be available for trading against US Dollars (BLAST/USD) and Tether tokens (BLAST/USDt).\n\nBybit, another major crypto exchange, announced on X, “BLAST is Coming Soon to the #BybitSpot Trading Platform With Blast L2. Listing: Jun 26, 3PM UTC. Deposits and withdrawals will be available via the Blast Network.” Bybit recently flipped Coinbase as the second-largest crypto exchange in the world. It now holds a 16% market share. This significant adoption suggests that Blast could witness considerable traction upon its launch as Bybit boasts a gigantic user base.\n\nAlso Read: ETH/BTC Price Prediction: Ethereum Price To Crash Another 7%?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNElHRmk1b0pjRHozRXQ4MDJCTkFqVlZvUzlmTl9GN0duTWFWZ3d2NHdkUmZ6bDNkblVoWjlEOVlyOVRqT2ltaWcyVm9UdmdXdEhmVThoUDE0bnVsdmoxZW9QSC1abk5ORlVySlVCcGpXTUJmNXNCR1kzbHNoWXg2NlNzM3ZWY25fSC16SE45UTZtUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Approval is Going Smoothly - Watcher Guru",
        "content": "US Securities and Exchange Commission (SEC) Chair Gary Gensler has said that the Spot Ethereum ETF approval process is going smoothly. Indeed, the agency chair discussed the impending investment product that received approval in late May, and when they could go live.\n\nThe agency is still working with issuers on S-1 filings, which have to be approved before the investment products begin trading. Many experts have predicted the second crypto-based ETF in the country will officially launch in July.\n\nJUST IN: 🇺🇸 SEC Chair Gary Gensler says the process to spot #Ethereum ETF approval is going smoothly. June 25, 2024\n\nAlso Read: SEC Chair Gensler: Ethereum ETF Debut Will ‘Take Some Time’\n\nGensler Says ETH ETF Approval Process is Going Smoothly\n\nSpeaking at a Bloomberg Invest Summit taking place Tuesday, SEC Chair Gensler said Ethereum ETf approval is “going smoothly.” However, he did note that he does not know the timing of when the product could launch.\n\nThe statement echoes similar ones made earlier this month. Speaking before the US Senate Appropriates Subcommittee on Financial Services, he discussed the Ether ETF. During that appearance, he discussed the ongoing approval process.\n\n“Individual issuers still are working through the registration process. That’s working smoothly, and I would envision sometime over the course of this summer.” Gensler also noted that “disclosure and registration,” is all that’s left before the ETFs can launch.\n\nSource: CNBC\n\nAlso Read: SEC Chair Gary Gensler: Ether ETFs Should Be Approved By September\n\nDuring the Bloomberg Summit, Gensler didn’t hold back in sharing his well-established critiques of the digital asset market. he stated that the industry often uses non-compliant rails outside of exchange-traded products. Moreover, he referred to many cryptocurrencies as securities, while saying most Americans do not get the necessary disclosures.\n\nThe incoming Spot Ethereum ETFs are hoping to mirror the success that its Bitcoin counterpart exhibited earlier this year. Just three months after the BTC product went live, the asset reached an all-time high price of $73,000."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9PYl9YYzBQX3J6WU8tVWR6X0I4OElxMlpfWGNZRnF4ZDFNZXhDWTVIeXNDNjBndUZ5Nkp3ZVd1N19Bc2NvaVFJaDU0dWtHY2o5am9CZ1M2NUlnb0ctcXFWSjA4b3QxcFJLQUJ1RllGWm1KcTdMZkZlYTc0Z9IBgAFBVV95cUxQOVA2YWJtd0pvT05yV1I0ZDNuNUF2M2JLVm1qa0ZTS2E4UFN6Mk42cVI4c2VRbTZ0eGVvdVY3d3pKMUhudFZxZnRqMUl0UzZadHJQRDhQT2dzU2YzZWxuLTF3dnNsbjRmM1ZwNjBIWHA5SnpOUUQ0LTg0ZW5LbEcwZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Key signs Solana might be outperforming Ethereum - AMBCrypto News",
        "content": "Solana surpassed Ethereum in terms of DEX volumes.\n\nPrice of SOL declined materially over the last few days.\n\nSolana’s [SOL] performance since the beginning of the year has been extremely positive. Due to this momentum, Solana managed to outperform Ethereum[ETH] in terms of DEX (Decentralized Exchange) volumes.\n\nSolana DEX volumes on the rise\n\nThis DEX volume refers to the total value of cryptocurrency actually transferred between wallets on the Solana network. These transfers happen through swaps on DEXs, which utilize liquidity pools on the network and are all verified by Solana’s validators.\n\nThis DEX volume metric is considered a crucial indicator of a blockchain network’s fundamental value. It reflects actual usage within the network’s ecosystem, as opposed to just speculation on the price of the token.\n\nBy this measure, Solana’s strong DEX volume suggests it is currently outperforming Ethereum in terms of real-world use. This could be a sign of growing adoption and potential for future growth for Solana.\n\nEven though DEX volumes for Solana were on the rise, the overall activity on the network had declined significantly by 10.7% over the past month.\n\nMoreover, the number of code commits on the network had also fallen by 20% signaling a decline in development activity.\n\nEthereum, on the other hand, showed growth on both these fronts. Overall active users on the network grew by 2.2% over the past month and the number of code commits surged by 10% during the same period.\n\nAt press time, SOL was trading at $126.47 and its price had declined by 5.21% in the last 24 hours, due to the recent market correction. Since the 21st of May, the price of SOL has declined materially.\n\nDuring this period, the price of SOL exhibited multiple lower lows and lower highs, indicative of a bearish trend.\n\nThe RSI (Relative Strength Index) for SOL also fell materially over the last few days. It was below the 40 mark, indicating that SOL may be slightly oversold at the time of writing and could see a reversal soon.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe Awesome Oscillator (AO) for SOL had declined indicating weakening buying pressure and potentially increasing selling pressure.\n\nHowever, the volume at which SOL was trading had surged by a significant 212% in the last 24 hours."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPTzFoUjVaTjg4Z1hOVTVHclhyNE9qM1czdVdkMTlRMEk1RV8zOWN4NFJkWWx0NExZT2tUU3o2UHpDVlgwcU5TUXhPN2xyX2VBQnFSZHhNRmV2eUxfUjVsU0JqZWRabk9lYTFzS0cwUGJNZWJtV2VuRFV0aldVdVRncGJNVHlvNjRVMWZCZ0J1VzTSAZYBQVVfeXFMTTllR3h2WENzV3ZoRjhFaG5pdm1BRnA3TTVodHp3Nkx5cmF5MTlFRDFxem42OXdHLVNNdUczb3dub3M0S2Fyb0t2YXdaM0hxVENtRzJkQjBjWWxURkhZb05oMmJiVVA3dlg5S1RTWGkyQkNoVU9qWGsweE5kU0tiTnFFZUduZTNuSDhOQ2FZZlNnT1F5WEFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Institutional Investors Sell Bitcoin, Ethereum Worth $690M, Buys XRP - CoinGape",
        "content": "At a time when institutional investors are bearish on Bitcoin (BTC) and Ethereum (ETH), altcoins such as Solana (SOL) and XRP are seen as better alternatives. CoinShares claims further outflows from digital assets funds globally indicate a “true correction” is underway. Digital asset investment products have recorded $1.2 billion in outflows in two weeks.\n\nHedge funds are expected to exit Bitcoin and remain short on crypto stocks such as MicroStrategy, which could risk further selloff in Bitcoin.\n\nadvertisement\n\nCrypto Assets Saw Second Consecutive Week Of Selloff\n\nThe $1.2 billion outflow from digital asset investment globally reflects pessimism amongst institutional investors for interest rate cuts by the US FED this year. Digital asset investment products recorded $584 million outflow in a week, according to a CoinShares report on June 24.\n\nJames Butterfill, head of research at CoinShares, said “Bitcoin was the primary focus, seeing US$630m in outflows, but recent negative sentiment has not seen investors add to short positions. Multi-asset products saw US$98m inflows, suggest investors seen the weakness in the altcoin market as a buying opportunity.”\n\nThe selloff mostly came from investors in the United States and Canada, accounting for $475 million and $109 million, respectively. They are followed by Germany, Hong Kong, and Sweden. Interestingly, Switzerland and Brazil defied the selloff and saw inflows of $39 million and $48.5 million, respectively.\n\nAlso Read: Crypto Market Crash — Here’s Why Bitcoin, Ethereum, XRP, SHIB Are Falling Today\n\nSolana and XRP Recorded Buying\n\nAltcoins such as Solana, XRP, Litecoin and Polygon saw inflows as Bitcoin, Ethereum and Cardano remained under selling pressure. Bitcoin price fell under $59k, a recording a dip of 5% in the past 24 hours.\n\nSolana recorded $2.7 million in buying by investors in a week. SOL price currently trades at $137.36, up 9% today after buying from the recent dip witnessed by altcoins. The 24-hour low and high are $125.90 and $136.73, respectively.\n\nMeanwhile, XRP saw $0.7 million in investments in a week. XRP price jumped 0.34% in the past 24 hours, with the price currently trading at $0.475. The 24-hour low and high are $0.469 and $0.482, respectively. Furthermore, the trading volume has increased by 5% in the last 24 hours.\n\nAlso Read: Political Memecoins Might Be Biggest Winner In Trump Vs Biden Debate\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQaERlcUstcEdkR3h4YUdXeWcxUEJQSmdqalIwb1B0N19ZbHFIdFFXdDF5Uy0yNkhWYmJVMHJTZ1BUal9QQXRVaXhKRG1SVUlCY0h6dDdnZVdLem1leU03aTlsYWEwQTR2ZGhXLVVKNzBlODRPVmx5VnVIRnk1VkF3cENYNE9NZ1ljelNTODVhRk1fRXFKa1VyZWYydELSAaIBQVVfeXFMTkdNX2t1NndxdmE4b1VWRllLTjJKZkd1anlrbTFXb2Fid0xhSTdKYndOS2NmNXpBbWxrQ19zMDJmckRwQTMtTzYxWTJvbHlYMmlnV2J3S3JicjBZNHdfS3hZVFFCNjhSX2w2RGs4LWhOajRVendIQkxXYVdnNkE0VEM0bVRIRnJKUEl5NVBVc3YyS29tN0NPQk1seEtlSk1CR3NR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Despite Ethereum’s development, this group isn’t interested in ETH right now - AMBCrypto News",
        "content": "Ethereum outperformed all other networks in terms of development activity.\n\nWhale interest in ETH declined significantly in the last few days.\n\nThe recent buzz around ETFs on the Ethereum [ETH] network did not interrupt development activity on the Ethereum network one bit.\n\nDevelopment on the rise\n\nEthereum had one of the highest number of code commits and active developments on its network.\n\nWhat exactly are the devs up to?\n\nIn the recent developers call, Ethereum developers ironed out details for the upcoming Pectra upgrade to the Ethereum system. Pectra is being rigorously tested on special test versions, called Devnets, before going live.\n\nThe next test version, Devnet 1, will introduce two major changes. First, it will implement a more efficient way for validators, the special computers that verify transactions, to work together.\n\nSecond, it will introduce a new system called EIP 7702. This system allows users to grant permission to other programs to control their transactions, similar to giving someone a key to your digital wallet.\n\nHowever, there’s an ongoing debate about how users can take back this permission if needed. Developers are scheduled to meet again to finalize this crucial aspect of EIP 7702.\n\nBeyond the Pectra upgrade, the meeting also covered progress on other Ethereum developments.\n\nFor EOF, a separate upgrade focused on data storage, testing of client implementations will begin after finalizing Pectra changes.\n\nThe EOF team will provide more tests to aid development. Additionally, EOF meetings have shifted to bi-weekly as specifications are finalized.\n\nFor PeerDAS, another independent upgrade enhancing validator communication, the next testnet launch is expected within two weeks. Unlike Pectra, PeerDAS will use finalized Dencun specifications.\n\nThe meeting also included announcements. A new standardized format for writing improvement proposals was suggested to ensure better reviews.\n\nNotably, a new GitHub resource page “eth-clients” was introduced for Ethereum developers.\n\nETH remains stable\n\nAt press time, ETH was trading at $3,494.20, with its price had grown by 0.12% in the last 24 hours. Retail interest in ETH was rising.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAccumulation by addresses ranging from the 0.001 to 10 cohort collected large amounts of ETH over the last few days. Whales did not show similar interest in ETH and were letting their holdings go.\n\nEven though this selling pressure is being absorbed by retail investors, a reversal in whale sentiment would be required for ETH to see green again."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPS01EekRIZnVKV25pWmNZMmJzaVdmejBENUpReUFXYkZhOU5hUlNBdkJmWTN1MGlGSnBhQkxuX0tIQ2NCM1d4MWx3SlhtTUt2M2I2RXpJdE5YYVlsamw3N3Z0OXJiLVNmTG90TG5TNnE0MF94VEZjVjQ1R1hPcVgxZDk5N2NwU1JnYndHcjB30gGTAUFVX3lxTE91cTNjaGJhRmhSd3hDeC1kdmM3VlM5T2l3djVDZER4MXo5eFNxQkNHaHFBSno5aFBGeHBWUFlmSkg2TjlsRFhvSzlWTXdKeTdYNnFEWkE3X19lUlgwajJsOUQwbEZFcGRxcW5qaXdsdzVmZFd2WFNfUVcxQm8wZkRBS25KaXZVT0FEZkFQamw1bTBfNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2 Blast to Launch Foundation This Week, Here’s Why - CoinGape",
        "content": "In a statement on Tuesday, ahead of the token airdrop planned for this week, Blast, an Ethereum Layer 2 network, said that it was establishing a foundation to manage the protocol. As reported by the X account of Blast, the decision was made to shift towards a more decentralized model of governance.\n\nBlast’s Governance Transition to Foundation\n\nBlast, created by the founder of the NFT marketplace Blur, announced that the governance of the protocol will be handed over to the newly created foundation soon.\n\nadvertisement\n\nThis transfer will also entail control over the social network pages and the webpage of Blast, that was formerly maintained by Arcade Research – a Blast’s development company.\n\nUntil now this account and website was managed by @ArcadeResearch, a Blast development company. As part of the transition towards a decentralized governance structure, this Twitter, the website, and governance of the Blast protocol are being transitioned to Foundation control. — Blast (@Blast_L2) June 24, 2024\n\nThe foundation is being created to help the community toward the attainment of the ‘Blast Vision,’ which will be outlined further on June 26. The foundation wants to increase decentralized decision making and community participation in the future of the protocol.\n\nUpcoming Token Airdrop\n\nBased on the preparation made and anticipation of the crypto community, the token airdrop is scheduled this week. Speaking of tokens, Blast reveals that they will be categorized although the details of the categorization are still unknown. An analysis of Blast tokens in the recent past revealed that there could be up to four to five categories, with theories suggesting that Blur farmers may be on the list of beneficiaries.\n\nThe firm has revealed that 50% of the airdrop will be given to developers via Blast Gold, while the other 50% will be given to early users with Blast Points.\n\nUsers will be able to receive points in their wallets depending on their balances, which will encourage users to engage more in the platform. To foster the growth of the ecosystem, Dapps are encouraged to reward their users with Blast Gold.\n\nBlast’s Eligibility and Distribution Details\n\nTo be eligible for the airdrop, users must hold Points or Gold in Externally Owned Accounts (EOAs) and sign in to the Blast dashboard at least once using those accounts. Points and Gold held in smart contracts will not qualify for the airdrop. Additionally, embedded wallets such as Privy need to complete the linking process to ensure eligibility.\n\nThe firm has emphasized the importance of a secure ecosystem, noting that any suspicious or insider distributions by Dapps will be reviewed, and offenders will be blacklisted from future airdrops. This rigorous vetting process aims to maintain a fair and trustworthy distribution system.\n\nBlast has been adopted widely in the DeFi space. It has also ranked at the sixth position in the DeFi network rankings, with a TVL of $2.085 billion, according to DeFiLlama. This is a strong indicator of the network’s potential to become one of the leading solutions in the Ethereum Layer 2 ecosystem.\n\nLast month, the firm underwent an upgrade that enabled support for Binary Large Objects (blobs), enhancing the platform’s data storage and transaction processing capabilities. This upgrade is expected further to boost user appeal and adoption of the Blast network.\n\nRead Also: Blast Blockchain Secures Sixth Spot In DeFi Network Rankings\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPaF9XN0xBSkRnMGxXNEZJam1qOU1QejR3M1JiVHppQXZIWHRQZDRyZVJkOWpjNGpCbUY5WXZTZ0hpTHEtVkVOX3RXdjBKeDRWb0wwWWgxdnV3bnkwS1gwOHFBTC1tdUo2aVAyUS1YamxQc194SE5RRjIwM2lLcmFRMnc2YnBRaWFTVkdCMk9BMmTSAZ4BQVVfeXFMTkJENy1YQV9uOURiQm9reGJkeHRPTGE2c1JpemRKelF5X05uMUVZaGQ2bmZxUGVZRENOODJ2RTc4UGN1Y2ZWSGU3bmUwTGQ5ZWZKcXVmOFNjUXhkbjJIaElLb0RYX191a0d4ZEJnTllYTVBmYjRKSEVSUmNlYjdJekttV1dnbkotY3RJenRSNVhSbnAxSmhPbWFTWGRUMWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 25, 2024 - Analytics Insight",
        "content": "Short-term Outlook\n\nIn the short term, Ethereum price is expected to remain volatile due to ongoing macroeconomic uncertainties and market sentiment. Investors should monitor critical support and resistance levels and stay updated on any significant technological developments and regulatory news.\n\n\n\nLong-term Outlook"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZ2JhdXBzd0Q4N21pS3pzOC16QVR4ZHZRUW5kT2tjbWNQSEY2Zld0TzlrRlJadXFSZ0RKR2tnMGkwYjN2M3ZTcmFEV2FvWDI4UU9vVG1mbzc3dTlZMkNyUzJHc1p4SG9LM0RaMTluVzFjVmhGNjdaN3hWbnZhUDd4NUtBWW01X2tnV1NYctIBkgFBVV95cUxNUjUydDhtQ3RyTGZla1hRVlI0OHE2WVEyc2ZRMUIzeTZ5eHg0eE9SQmY2enJKSGIxQkdtZ3M0VDBjTDRxWHI1Z0lvZ1JIZXl6Sk1jZXhVV3Awb29OeF95MElQZVZ3eXJIYjJMTXdmcE0tb1I1T3B5MkpZSnJuV3NZWXduYktsUl9MZkVEYjdYQVI4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum lead the way as crypto outflows surpass $500M - AMBCrypto News",
        "content": "Negative sentiment in the market caused the increase in outflows from BTC and ETH.\n\nProjected distribution by a defunct exchanges puts the cryptos at risk of another decline\n\nCrypto investment products saw massive inflows for the second consecutive week, CoinShares’ latest report revealed. According to the digital assets management, outflows last week were worth $584 million.\n\nThis brought the total outflows in two weeks to $1.2 billion. As expected, Bitcoin [BTC] had the highest outflows with$630 million. The report explained that the gloomy perception among investors and projected interest rate cut contributed to the capital flow.\n\nIt explained that,\n\n“We believe this is in reaction to the pessimism amongst investors for the prospect interest rate cuts by the FED this year.”\n\nBTC, ETH play second fiddle to other altcoins\n\nApart from the outflows, trading volume of Exchange Traded Products (ETPs) fell to $6.9 billion. This was the lowest volume Bitcoin has had since the 10th of January ETF approval.\n\nEthereum [ETH] was second on the list with an outflow of $58.30 million. This was surprising considering that the broader market expect the Ethereum spot ETFs to begin trading in July.\n\nTypically, this was supposed to bring about optimism. However, that did not happen as the report stated that,\n\n“Ethereum did not escape the negative sentiment, seeing US$58m in outflows. While a range of altcoins saw inflows after recent price weakness, most notable were Solana, Litecoin and Polygon at US$2.7m, US$1.3m and US$1m respectively.”\n\nAt press time, Bitcoin’s price was $60,028 after it briefly fell below $59,000. ETH, on the other hand, changed hands at $3,349.\n\nIt’s the season to apply caution\n\nThe initial decline in prices could be linked to the disclosure that Mt.Gox. intended to pay back creditors $9 billion worth of BTC from July.\n\nMt.Gox is the defunct Bitcoin exchange that was hacked in 2011. It then went bankrupt in 2014, leading to a broader market collapse. If the distribution begins in July, there is a high chance that the recipients would sell off some of the coins.\n\nShould this be the case, BTC could plunge to $54,000 as predicted in some corners. For ETH, the anticipated live trading of the ETFs could save it from another round of correction.\n\nIf this happens, ETH’s price might resist another downside, and this could be the ticket to the altcoin season that has failed to appear.\n\nMeanwhile, Bitcoin’s volume neared its monthly high. At press time, the volume was $42.86 billion. Volume measures buying and selling, indicating interest in a cryptocurrency.\n\nBut considering BTC’s decline, it means that there was more selling than buying. While ETH’s volume also increased, it was not the same as Bitcoin.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs of this writing, ETH’s volume on-chain was $22.76 billion. As it stands, BTC seemed to be resisting a further decline. If bulls can defend the coin, the price might rebound to $63,000.\n\nIn ETH’s case, the value could revisit $3,500. However, if selling pressure increases, the prices could hit new quarterly-lows."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQRlVzTnlsdl9kY1I0TFhCcFdndUNMTU9ITXZaTkZ4MkE0LUcweUhyOEQ2cDdnMWc2TkhvUUgtQzZuNTM2Yk14andIcXVSWUd2R0x4N195RmhsX0Y4djBWUlFwVm9RRHdRT2RhZzVXdTcteHdyWnhTU3NjZG55TVFBTDUzY0pOdzcxYU42X2o3T1DSAZ4BQVVfeXFMTUNkMUp0bTY0bzNhY21YU3BURXA5SkhNdmRJV0VLU0RtUldtTGFwYXhLWUwteV9vOGhmR3NfTks3TEx5b0FxR016M0VBb2VjcmVZdEVSWHduMkNiODh6cXpjbURNVWRqZlBPNFdmOVh4dzB3STQ2dEhyY3BobnpnVFhMQWFjM2M1b3lTNkxKY09LVUFlbUFuWDRIUG95RlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 24, 2024 - Analytics Insight",
        "content": "Short Term Outlook\n\nIn the short term, Ethereum price is likely to remain volatile due to ongoing macroeconomic uncertainties and market sentiment. Investors should watch for further developments in global financial markets and any significant news regarding Ethereum's technological upgrades.\n\nLong Term Outlook"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQekdLV0xGcllMVkZMdVE3UzQ5TTJSa3cxdHB5MUgxUEpoVU45TjFJLW02MXVSbDU5OWhVSjdYR3NBb051VXJNSHpRZktYdFVzSTRhckRPZGRFTF9oTzN4MHl4MktaVlhTeWdLM3BRNTlFdUtzU2I1MjlVNTBJTnpkWS1BbGFkT1ZpSkHSAY8BQVVfeXFMTzV4UXFhM2dsQXZURExIZE9mSV9yQkZGTUdUMjNhb0N6ckd5NnV6RHhSbkNfQ0Z6M3NoaGwzRFFPWDh3d2JZS3NFS0tNanRyNklLb2xybGdpdHUtRXBBSTdGSHVreHo3SFRCVVp6N1J1cVhNcFVyRGFyOXBaTzNLRmhLYjU0dUZfdmhCTlRaVjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum makes efforts to stabilize its price – is it working? - AMBCrypto News",
        "content": "Ethereum saw a record number of daily active addresses.\n\nETH’s support has continued to hold.\n\nEthereum’s [ETH] recent spike in a key on-chain metric is noteworthy, especially considering its recent price trends and its struggle to maintain levels above a critical support line.\n\nHowever, it’s interesting to note that despite this spike, other on-chain metrics have displayed typical patterns.\n\nEthereum sees more active addresses\n\nAMBCrypto’s analysis of Ethereum’s Daily Active Addresses metric from Santiment revealed recent consecutive spikes, indicating a significant increase in network activity.\n\nOn the 21st of June, the number of daily active addresses reached over 617,000, marking the highest level since the 23rd of March.\n\nHowever, this record was surpassed the very next day, on the 22nd of June, setting another high point.\n\nEthereum’s Active Addresses indicated that by the close of trading on 22nd June, the number of daily active addresses exceeded 731,000.\n\nAMBCrypto then took a deeper look at the historical data, which revealed that the last occurrence of such high activity was around ten months ago.\n\nIn September 2023, the number of active addresses surged to over 1 million, marking the highest recorded level up to that point.\n\nThese spikes suggest a heightened level of engagement on the Ethereum network, which could be driven by various factors such as market movements, new developments in the ecosystem, or increased adoption.\n\nHowever, these spikes did not impact the volume.\n\nWhat of Ethereum’s volume?\n\nAMBCrypto’s analysis of Ethereum’s trading volume reveals an interesting contrast to the spikes in daily active addresses. Despite the increase in active addresses, trading volume declined.\n\nBy the end of trading on the 22nd of June, the volume stood at around $9 billion, which might initially seem substantial.\n\nHowever, when compared to the $15 billion recorded in the previous trading session, this represents a significant decrease.\n\nThe discrepancy suggested that while more addresses were active, possibly indicating increased user interactions or transactions on the network, these did not translate into higher trading volumes.\n\nThis pointed to possibly smaller, less value-intensive transactions dominating the activity during the period.\n\nETH’s bear trend weakens\n\nEthereum’s price chart indicated that it was currently striving to maintain its support level.\n\nAMBCrypto’s review of the daily timeframe chart showed that although there has been a decline in its price over the last few days, the support level has effectively held at around $3,400.\n\nAs of the latest data, Ethereum was trading at approximately $3,490, experiencing a slight decline.\n\nThis suggests tentative stability, as it manages to stay above the crucial $3,400 support level, which could be pivotal in determining its short-term price trajectory.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe analysis of Ethereum’s Moving Average Convergence Divergence (MACD) indicated that it was in a bearish trend at press time.\n\nHowever, the behavior of the MACD lines suggested that this bearish trend was weakening. Should the price increase, this could diminish further, potentially signaling a reversal or at least a slowdown in downward momentum."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOY0RqT2g2Y2pSRjhscXdTeEZzeml5V2hxMUxtM25SbTBvSUFHMk5wWkplTm53Znlfb29YMTdTN0lNUTMzZmRSM0Y3a2tfMmtibWlRbVFwalIxQTVUUTdPbGdzVDNfTkFBelBLZERIcDF1cWl1NjhzdEx5akhQTTJVVEkxRTRGaV92NGdpeHp5dmE3LWE4dXhERTBjQUgxTXVEQUlN0gGoAUFVX3lxTE1od1pteWJEQkY5SUZpRlBtcjBvQkNlT2w0QUdZaHdnQWdCT0R1TFJyc0kwRmVTX25pekY1Z004bHVJc3VIQnJYUTN2R0IyWFpFZ3BGRGFKOXVRYXAxWk8ycUZmUkZtU3MzbG5zOGk0QkFVLUtXUU56aUdOa29NMUpXWm9NVzdSY1RBSEV4UnY1bTlvYXg5ZTFEUmxTSDVDZFRWc1pMdnIyWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Crash: Here’s Why Bitcoin, Ethereum, XRP, SHIB Are Falling Today - CoinGape",
        "content": "Crypto market saw bears gradually taking over bulls, with the market cap tumbling from $2.35 trillion to $2.24 trillion in the last 24 hours. Crypto investors lost $180 billion in net wealth in a week as market sentiment slips to “Neutral” today. The crypto market fear and greed index continues to slide from 76 (extreme greed) last month to 51 (neutral) on June 24.\n\nBitcoin price plunges more than 4% to a 24-hour low of $60,858 amid continued selling pressure and uncertainty. Traders eye BTC price to slip below $61,000, the support level it hit in April and May as well. BTC spot and derivatives traders look extremely bearish due to a focus on U.S. PCE inflation data and monthly options expiry.\n\nadvertisement\n\nEthereum price also tumbled 4% in the last 24 hours, making the monthly drop to over 10%. ETH price is currently trading at $3,366 with a trading volume rising 73% as investors liquidated their holdings.\n\nAltcoins such as Solana, XRP, Toncoin, Dogecoin, Cardano, and Shiba Inu tumbled 3-6% in the last 24 hours. Meme coins and AI coins are witnessing massive selloff, leading to correction in the crypto market. dogwifhat (WIF) leads with a 14% fall in the past 24 hours.\n\nCrypto Market Nears Crash As Traders Brace For Macro Events\n\nCoinglass data indicates the popular cryptocurrencies recorded a liquidation of $170 million today, with $280 million liquidated in the last 12 hours. Over 90k traders were liquidated, with the largest single liquidation order happened on crypto exchange BitMEX after a whale sold XBTUSD valued at $10 million.\n\nOver $100 million in long positions in BTC, ETH, SOL, DOGE, NOT, ORDI, PEOPLE, WIF, PEPE in the last 4 hours due to uncertainty in the market. This has caused the crypto market to bleed today.\n\nA week ago, CoinGape warned about BTC price crash potentially to the $57k level near the month’s end due to key macro events and options expiry. Investors are bracing for both US PCE and monthly options expiry on Friday, expecting a sharp correction before the date as the Fed eyes only single rate cuts this year. Moreover, key macro events such as ISM manufacturing data, Fed Chair Powell speech, the FOMC meeting release, and jobs and unemployment rate data are due in the first week of July.\n\nOver 105K BTC options of notional value $6.72 billion are about to expire on June 28, per the largest derivatives exchange Deribit. With a put-call ratio of 0.52 and the max pain point at $57,000, Bitcoin price is more likely to remain under selling pressure.\n\nAlso Read: Big Capital Rotation Into Altcoins to Begin In Two Weeks, Predicts Analyst\n\nAnalyst Predicts Bitcoin Price Drop To $50K\n\nMarkus Thielen, founder of crypto research company 10x Research, said it’s the time to make tough decisions as BTC price action looks weak amid continuous outflows from spot Bitcoin ETFs. He predicts Bitcoin could crash to $50,000 due to double top pattern formation. The key support level is at $60,000.\n\n#Bitcoin Double Top? Is It Time to Panic? How Low Prices Could Plunge? https://t.co/UOr9cWTisg pic.twitter.com/rtoTDf14E7 — 10x Research (@10x_Research) June 24, 2024\n\nBTC on-chain data and other analysts have also pointed to weaker BTC price action in the coming weeks. The concerns around massive selloffs by dumb money have risen, which could push BTC much lower.\n\nAlso Read: ETH Price Reversal Soon As Ethereum ETF Coming In Two Weeks\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNdjBTbDJ0SzluM0tfMk96d1M1RHlfYzZuUFlqSEdaNGZxU0l6LTFRelVlOEpObDEwcml5ajkyaFpfOVVNeTIwNmFWdVY3TzFlZjQtVXFnaE8wSTFTVXlGbGE2WGtMeXY1bXhnTTc4V3R1OWhxY3RJRVBkcVhFUHUwck5oZVZSUGo2a2tHR2tOdDBudWJoNlFkeGF3Y283UHVxUk5J?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch Could See 30% Drop In ETH Price, Here is Why - Crypto News Australia",
        "content": "Founder of Mechanism Capital, Andrew Kang, says Ethereum will likely see a significant price drop, possibly to as low as US$2,400 when the spot ETFs launch.\n\nConversely, VanEck recently published a report on their website predicting Ethereum could top US$22,000 by the end of the decade, driven in part by the spot ETFs.\n\nThe recently approved Ethereum spot ETFs could be a downer for ETH’s short-term price performance, says Andrew Kang, founder of the crypto-focussed venture capital firm Mechanism Capital.\n\nIn an article posted to X yesterday, Kang argued that the ETFs likely won’t benefit ETH’s price unless the network can figure out a way to improve its economics and attract investors. Kang forecasts a price drop following the launch of the ETFs to as low as US$2,400 (AU$3,600) — a fall of almost 30% from its current price of just over US$3,340 (AU$5,020).\n\nRelated: Asset Managers Rush to Update Ether Fund Applications as July Deadline Looms\n\nHow Could ETFs Lead To A Price Drop?\n\nIt seems counter-intuitive that the launch of Ethereum ETFs could actually cause ETH’s price to fall, especially after what we’ve seen with the Bitcoin ETFs. So, how does Kang say this could happen?\n\nAdvertisement\n\nFirstly, he argues the true inflows into the Bitcoin ETFs have been much lower than it seems. Excluding rotations from Grayscale Bitcoin Trust (GBTC), spot rotations and basis trades (trading BTC futures for spot ETF), Kang says there’s been only about US$5 billion worth of true inflows to the BTC ETFs—a lot less than the US$50 billion often bandied around.\n\nExtrapolating this to Ethereum, Kang estimates the ETH ETFs might see around 15% of the inflows the Bitcoin ETFs saw. And after making a few other adjustments to account for differences between ETH and BTC, Kang lands on an estimate of around US$0.84 billion “true net buying” of ETH ETFs.\n\nHe says this level of “true net buying” of the ETFs is much lower than the derivative trading front-running the ETFs, which he estimates at around US$2.8 billion—suggesting “that the ETF is more than priced in.”\n\nLack Of TradFi Interest In Ethereum, Says Kang\n\nKang also argues there’s much less TradFi and institutional interest in Ethereum than Bitcoin and that this isn’t fully appreciated by many crypto investors:\n\nPersonally, I believe that the expectations of crypto natives are overinflated and disconnected from the true preferences of tradfi allocators. Andrew Kang, Founder of Mechanism Capital Andrew Kang, Founder of Mechanism Capital\n\nA key part of this lack of interest, according to Kang, is Ethereum’s misfiring economics which aren’t looking all that attractive at the moment and will reduce institutional enthusiasm for the ETFs:\n\nEthereum is a cash machine, but at $1.5B 30d annualized revenue, a 300x PS ratio, negative earnings/PE ratio after inflation, how will analysts justify this price to their daddy’s family office or their macro fund boss Andrew Kang, Founder of Mechanism Capital Andrew Kang, Founder of Mechanism Capital\n\nMuch of the upside Bitcoin saw around the launch of its ETFs was from institutional buying in the lead up to the ETFs. Kang doesn’t see this happening for Ethereum.\n\nPessimistic View Not The Consensus\n\nThis all sounds pretty pessimistic, does Kang think ETH is finished? No, not finished, but he does see the price falling considerably:\n\nBefore the ETF launch, I expect ETH to trade from $3,000 to $3,800. After the ETF launch my expectation is $2,400 to $3,000. Andrew Kang, Founder of Mechanism Capital Andrew Kang, Founder of Mechanism Capital\n\nKang says he could see ETH recovering back to all-time highs if BTC rallies over US$100,000 and in the very long-term he’s more optimistic, particularly around tokenisation.\n\nRelated: Breaking: US SEC Ends Investigation into Ethereum 2.0, Says No Further Legal Action Will Be Taken\n\nNot everyone agrees with Kang though: earlier this month asset management firm VanEck said ETH would continue its strong performance and predicted it could top US$22,000 by the end of the decade."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQZmpvR3V6VkN1Q1Bqb3ZqcHB5WmhsenhTWU5TM3hSRzlCMlYwdzdvMWsxVzFFUHd1aExCSjFhSlhiOFFQTXJuaVlWVDR0T1BTRkRCWElNT1laWlJUOGxIYkVreDdSQXg2SHl4NlkzQkpSQ2FpYkZZNWN2VnRKSTVoZlNzaFlWaFA1ZTBuSGNUVEdpWmvSAZgBQVVfeXFMTlIxYzg5aHVzMVBPRDJrcm9rYVhYa2NjOU9NcHN3cU9zZTBJc052dkVGQXZCSHdMVTl2aWpGV0wtTVZPOGpQclFabF9BVFhiM2JYLUp3VUM4bGs4VHBxOVJnT3l6T2xmRjg1eVdCS292XzVVZGpCODA3b1FDZDVyX3ZrTWNuQmgxbk1mc2hFZWdHY3VhWmdLLXg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "New lows for Ethereum gas usage as ETH tumbles below $3400: What now? - AMBCrypto News",
        "content": "Ethereum gas prices declined, but fees paid out to validators rose.\n\nThe price of ETH declined, however, Network Growth surged.\n\nThe recent market drawdown impacted Ethereum [ETH] significantly as ETH’s prices fell below the $3400 level.\n\nLow Ethereum gas, high fees\n\nCoupled with that, the Ethereum gas price declined. Despite the declining gas prices, in terms of fees paid out to validators, Ethereum outperformed other networks such as Solana [SOL] and Tron [TRX] by a large margin.\n\nThe higher validator fees, despite a gas price drop, could indicate continued strong network usage on Ethereum.\n\nEven with lower per-transaction fees, a higher volume of transactions could generate more total fees for validators.\n\nWhile validator fees might be high now, they might not be enough to offset the overall price decline of Ethereum.\n\nAt the time of writing, ETH had fallen by 4.14% in the last 24 hours. One of the reasons for the decline in ETH’s price would be its correlation to BTC which also fell considerably over the last few days.\n\nAccording to AMBCrypto’s analysis of IntoTheBlock’s data, ETH’s correlation to BTC was at high 0.78.\n\nEven with a significant decline in Ethereum’s (ETH) price, a large portion of holders seem to be in it for the long haul. On average, investors are holding onto their ETH for a whopping 2.3 years.\n\nThis long-term view is further supported by the fact that coins being actively traded are still held for an average of 2 months, indicating a reluctance to sell.\n\nThe average holding time of traded coins offers valuable insights into investor confidence.\n\nWhen coins are held for longer periods, it suggests investors believe in the long-term potential of Ethereum and are comfortable holding onto their assets.\n\nConversely, frequent trading activity may indicate a focus on short-term profits and less faith in the future of the market.\n\nOn-chain data\n\nNetwork Growth for ETH surged materially over the last few days.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nSo, many new addresses were interacting with ETH at the time of writing, implying that a large amount of addresses were interested in buying ETH at the current discounted rates.\n\nMoreover, the velocity at which ETH was trading had also grown, suggesting that the frequency at which ETH was being transacted had surged."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE80Y3pNamVwLWdGYUFpV25MaGxlLWVPLVhhSzczWjJaMklTUkhEYkE5TF9FYUZQa3FzWkllbGRjWU1xTGRSd2YwZExFdU1kWU5xZFo1YVRJQ1RZUFJjSF80YkVseE02Z3o3bHpYdzREcXhkd9IBd0FVX3lxTE5YdEprZXZLdVRuQW80b0JMSFVrWWhiWUlLRHR1dDRnSmc4QU5iaGlVNEhVamIyNGV5dWhEUGs5OEU1NUcyZWxjZ3A4YmNZc0ZIS0VBbDFQcG41Qy1BbFRyREkzczcyYWpPY0d3Znhmc3hXdlN6bWRr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 03:32:05 GMT",
        "title": "Ethereum Price Bottom Signal: Is a Recovery on the Horizon? - NewsBTC",
        "content": "Ethereum price extended losses below the $3,320 support. ETH tested the $3,240 support and is now eyeing a decent increase above the $3,380 resistance.\n\nEthereum extended losses and tested the $3,240 support zone.\n\nThe price is trading below $3,400 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $3,440 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could attempt a decent increase above the $3,380 and $3,400 resistance levels.\n\nEthereum Price Founds Support\n\nEthereum price struggled to start a fresh increase above the $3,500 zone. ETH followed Bitcoin’s bearish path and the price declined below the $3,350 level. The bears pushed the price below the $3,320 support zone.\n\nA low was formed at $3,230 and the price is now correcting losses. There was a minor upward move above the $3,300 and $3,320 levels. The price climbed above the 23.6% Fib retracement level of the recent drop from the $3,517 swing high to the $3,230 low.\n\nEthereum is still trading below $3,450 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $3,375 level or the 50% Fib retracement level of the recent drop from the $3,517 swing high to the $3,230 low.\n\nThe first major resistance is near the $3,450 level. There is also a key bearish trend line forming with resistance near $3,440 on the hourly chart of ETH/USD.\n\nThe main resistance sits at $3,540. An upside break above the $3,540 resistance might send the price higher. The next key resistance sits at $3,620, above which the price might gain traction and rise toward the $3,650 level. Any more gains could send Ether toward the $3,720 resistance zone in the coming days.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,450 resistance, it could start another decline. Initial support on the downside is near $3,325. The first major support sits near the $3,24 zone.\n\nA clear move below the $3,240 support might push the price toward $3,200. Any more losses might send the price toward the $3,120 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,240\n\nMajor Resistance Level – $3,450"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE03TFVnckxiazJQendsT0JDQmpqcGQzdXpMVDNWZnNDUGlWblBTT0pCeWt3X21fZW8temtEUHgwUHpkZEVLR3VGNjZPbmZIU3djOG8tN1JQZW1UZmtrSDlhN1VFQ2UtSFZSXzRDZnhQZGJEYjVOSVpZSg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Price Fall Below $1000 - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "While Bitcoin ETFs attracted numerous new investors, making it easier for them to include BTC in their portfolios, the influence of ETH ETFs is much more uncertain, according to Kang.\n\nThis observation comes from crypto entrepreneur and investor Andrew Kang, who shared a detailed analysis of the effect of Ethereum ETFs on X on June 23.\n\nThe response and market sentiment toward Ethereum spot ETFs have been less enthusiastic compared to the excitement seen with the launch of Bitcoin ETFs earlier this year.\n\nThere are 120.14 million ETH in circulation, with a yearly supply decrease of 0.24%, meaning 292,161 ETH were removed from the supply over the past year.\n\nEthereum hit its highest price of $4,867.17 on November 10, 2021, and its lowest price of $0.42 on October 21, 2015. The lowest price since its all-time high was $897.01, and the highest since then was $4,094.18. Currently, the market sentiment for Ethereum is bearish, and the Fear & Greed Index is at 51, indicating neutrality.\n\nToday, Ethereum is priced at $3,332.52 with a daily trading volume of $24.88 billion and a market cap of $400.36 billion, holding 17.73% of the market. Its price has dropped by 5.53% in the last 24 hours.\n\nBitcoin's price has dropped to $61,500, the lowest since early May, and is down over 10% from its recent peak. At the same time, other major cryptocurrencies like Ethereum , XRP , and Solana have seen even steeper declines, causing the total market value to shrink by $200 billion in the past week. The second major crypto ETH is also dropping. Will ETH price fall below $1000? Let's take a look at this Ethereum price prediction article in more detail.\n\nKang predicts that the flow of funds into Ethereum ETFs will be about 10% to 15% of what Bitcoin ETFs experienced, leading to an estimated $500 million to $1.5 billion in net buying within six months.\n\nLast week, it was reported that Fidelity would start its Ethereum ETF with $4.7 million, indicating that the buying has already started. In March, Standard Chartered forecasted that inflows could reach $45 billion in the first year of Ethereum ETF trading.\n\nHowever, Kang explained why the impact of an Ethereum ETF might be less significant than that of Bitcoin. He noted that Ethereum is considered more of a tech asset, unlike Bitcoin, which is viewed as a macro asset. Additionally, there is less institutional interest and buying pressure for Ethereum. Its current valuation metrics, such as the price-earnings ratio, make it a harder sell for traditional finance investors, he said.\n\nThe limited inflows and institutional interest could mean a smaller impact on Ethereum's price compared to Bitcoin, as the expected buying pressure from ETFs will be less intense.\n\nWill Ethereum Price Drop Below $1000?\n\nTo determine whether Ethereum's price will drop below $1000, we need to analyze several key factors influencing its market dynamics. Ethereum's price has increased by 75% in the last year, indicating a strong upward trend. It has outperformed 57% of the top 100 crypto assets over the same period, showcasing its competitive edge in the market. This historical growth reflects solid investor confidence and a robust market position.\n\nFrom a technical perspective, Ethereum is trading above the 200-day simple moving average, a bullish indicator that typically signals continued strength in price action. Despite recent fluctuations, maintaining this position above a crucial moving average suggests that the market sentiment remains relatively positive. This technical strength is a reassuring factor for investors concerned about potential price declines.\n\nEthereum's supply dynamics also play a crucial role in its price stability. The yearly inflation rate is negative at -0.24%, meaning the supply of ETH is decreasing slightly over time. This deflationary characteristic can support higher prices as supply diminishes, adding another layer of price support. With a high market cap and substantial liquidity, Ethereum is less prone to severe price swings compared to smaller, less liquid assets. This stability can act as a buffer against drastic price declines, further reducing the likelihood of the price falling below $1000.\n\nWhile Ethereum has been outperformed by Bitcoin recently, which may attract some investors away from ETH, this doesn’t necessarily imply a price drop below $1000 but rather a potential shift in capital allocation within the crypto market. The fact that Ethereum had only 13 green days out of the last 30 (43%) suggests some short-term bearish sentiment. This could indicate potential short-term volatility, but not necessarily a significant long-term decline.\n\nDespite lower inflows expected from Ethereum ETFs compared to Bitcoin ETFs, the initiation of these financial products still reflects institutional interest. The additional buying pressure from these ETFs, even if modest, can help sustain or increase the current price levels. Analyst Andrew Kang’s prediction of lower ETF inflows compared to Bitcoin and the challenges in Ethereum’s valuation metrics could result in a less pronounced price increase. However, considering Ethereum’s strong performance metrics, negative inflation rate, and high liquidity, a drop below $1000 seems unlikely under normal market conditions.\n\nSo, while short-term fluctuations and bearish sentiment can lead to temporary price drops, Ethereum's strong historical performance, technical indicators, negative inflation rate, and high liquidity provide a solid foundation against a decline below $1000. Therefore, based on the current data and market conditions, it is improbable that Ethereum will drop below $1000 in the near future."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQYzVtYmRBS0FSZFZwUXlwQUgybzd3VmM2UkxpTXBBUmEzd3ZRRnNmUG5YbzFKQmFyMk53dHpzVHNCU1lDRk9PZDhTSjFxTkhjT1JpWDBESDBwUmtqZDVEaWlkQ2NpVnJTTWNGNVhPNFl0ZHFaMXlZaEJmeEtqVjY5dzdKcm5fMGFRY0s1SFE5LXFRQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF: When Will They Launch & What Will The Price Impact Be? - Blockonomi",
        "content": "TLDR\n\nBloomberg analyst Eric Balchunas reaffirms his prediction of a July 2 launch date for U.S. spot Ethereum ETFs, following a surge in amended S-1 filings.\n\nSeveral major asset managers, including BlackRock, VanEck, and Fidelity, have submitted amended S-1 filings, with some revealing competitive fee structures.\n\nAnalysts have mixed views on the potential demand for Ethereum ETFs, with projections ranging from $1-3 billion to $4 billion in net inflows.\n\nSome experts, like Nate Geraci of ETF Store, suggest that Ethereum ETF approval could come as early as next week.\n\nThe SEC has already approved 19b-4 filings for eight spot Ethereum ETFs, but still needs to greenlight their S-1 filings before trading can begin.\n\nAs the launch of spot Ethereum ETFs in the United States draws near. Industry experts and analysts are closely watching developments, with some predicting an imminent launch while others remain cautious about market demand.\n\nBloomberg’s senior ETF analyst, Eric Balchunas, has doubled down on his prediction of a July 2 launch date for U.S. spot Ethereum ETFs. This forecast comes in the wake of a surge in amended S-1 (registration statement) filings observed on Friday. Balchunas noted,\n\n“We will see a bunch of amended S-1s filed today, probably later this afternoon. Then the ball’s in SEC’s court to let issuers know about any final changes and effectiveness (aka final approval).”\n\nThe U.S. Securities and Exchange Commission (SEC) has already approved 19b-4 filings for eight spot Ethereum ETFs last month.\n\nHowever, the regulatory body still needs to greenlight their S-1 filings before these ETFs can begin trading. SEC Chairman Gary Gensler has indicated that spot Ethereum ETFs will launch this summer, pending the approval of their S-1 filings.\n\nMajor asset managers have been quick to respond to this opportunity. BlackRock, the world’s largest asset manager, has entered the market with a $10 million seed investment.\n\nVanEck has filed with a competitive fee of 0.20%, closely matching Franklin’s 0.19%. Other significant players like Fidelity, Bitwise, 21shares, and Grayscale have also filed, although they have not yet disclosed their fees. The competitive fee structures suggest that issuers are positioning themselves aggressively in anticipation of strong market interest.\n\nMarket observers are divided on the potential demand for Ethereum ETFs. JPMorgan analysts project that these ETFs could attract about $1 billion to $3 billion in net inflows in the second half of 2024.\n\nBloomberg’s Balchunas estimates that Ethereum ETF products could capture only 20% of the Bitcoin ETF market share, basing his projection on the current demand for ETH vs BTC in the futures market.\n\nOn the more optimistic side, K33 Research’s Vetle Lunde estimates that demand for ETH ETF products could reach $4 billion in net inflows in the first five months alone. Bitwise CIO Matt Hougan views the second half of 2024 as full of ‘tailwinds’ for ETH demand.\n\nA recent Deribit Insights report also painted a bullish future based on recent options data, noting significant purchases of ETH September $4,000 call options.\n\n1) Decent clip of ETH Sep 4k Calls bought ($12m premium), and BTC Jun 65k+July75k Calls rolled to increased exposure in Dec 75+90k Calls, showing increased mid-term optimism.\n\nEarly trades in the last few hours supporting range lows with Sep 60k Puts sold, and Jun RR Calls bought. pic.twitter.com/HEgCEXhzjh — Deribit Insights (@DeribitInsights) June 20, 2024\n\nThe potential impact on Ethereum’s price is also a topic of speculation. QCP Capital analysts suggest that ETH could surge above $4,000 and potentially retest its record high of $4,800 if the ETFs capture 10-20% of Bitcoin ETF flows.\n\nHowever, some market participants, like Quinn Thompson, founder of crypto hedge fund Lekker Capital, believe the market might be underestimating the positive impact of the upcoming ETH ETF.\n\nNate Geraci, president of ETF Store, has suggested that approval could come as early as next week. This aligns with Balchunas’ July 2 prediction, which is strategically timed to coincide with the U.S. Independence Day holiday. Former SEC official Jay Clayton has also reinforced expectations for imminent approvals.\n\nIt’s worth noting that while most major players are pushing forward with their ETF plans, Hashdex, a notable player in the ETF arena, has withdrawn its application for a spot Ethereum ETF without disclosing reasons or future plans.\n\nInstead, they have presented a mixed Ethereum and Bitcoin solution.\n\nThe coming weeks promise to be crucial for the Ethereum market and the broader cryptocurrency ecosystem.\n\nWhether the ETFs launch on July 2 or later in the summer, their impact on market dynamics, institutional involvement, and Ethereum’s price will be closely watched by investors."
    }
]