[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNeElxRjZSUzBfb3ZpMnpOYlBCc2RPV1hmRVZSbV9CRGxVeHVDaU5QeHk1V0xYckQ4LUg0a2hDaWw1ZGw3N0ZiRWEwek1Ja3hpRHdtV0xpWXVSVFBNUVl4aWxYZzZZbUl4S0dZLVJrNEI1UlNWZWRRbjBaY1RpeVFCWWVRQk1VY2lyOE1nYktnZlRzS1BNMDdFT01uVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Gas Fees Have Fallen to Their Lowest Level Since 2020 - Unchained",
        "content": "The low price of transacting is a result of the flight of activity away from Ethereum’s base layer to its layer 2 networks, particularly following the Dencun upgrade that occurred in March.\n\nThe average cost of a transaction on Ethereum is at its lowest level since Jan. 2020 (one gwei represents one-billionth of one ether and is the unit of ETH used to measure gas prices). The decline reflects the movement of activity from Ethereum’s base layer to its expansive array of Layer 2 solutions.\n\nMoreover, the release of the Dencun upgrade, which significantly reduced fees for those layer 2 networks, has only intensified this trend of lower transaction costs. Gas prices on Ethereum have decreased about 92% from about 63 gwei on March 12, the day before the upgrade, to around 5 gwei at presstime, data from blockchain explorer Etherscan and analytics investment platform Ycharts shows.\n\nAccording to layer 2 watchdog platform L2Beat, the number of active and upcoming L2 projects collectively stands at 95. Over the past several months, users have significantly increased the amount of crypto assets they’ve bridged over to various layer 2 scaling rollups. And of the L2s, the top ones by total value locked—namely, Arbitrum, Optimism, and Base – have seen a spike in active daily addresses, signs of increasing user activity.\n\nRead More: Vitalik’s New EIP-7702 Draws Early Support; Could Be Included in Ethereum’s Next Hard Fork Upgrade\n\n“We can certainly see a trend upwards on EVM compatible chains of daily active addresses, which means users are going to cheaper alternatives. Looking at bridge data also confirms this, as bridge activity across Layer 2s has increased from ~$170mn per week to ~$300mn per week,” Andrew Van Aken, a data scientist at blockchain analytics firm Artemis, said in a Telegram message to Unchained.\n\nAdditionally, Ethereum has seen over $3 billion in net outflows of ETH over the past three months, per Artemis, with the majority of the flows going to L2s such as Arbitrum, zkSync, Base, Starknet, and Optimism.\n\nThe decrease in Ethereum’s transaction costs is “a reflection of the constant evolution of blockchain. Initially Ethereum served as the universal layer for all apps, from decentralized exchanges, to games, to trading memecoins, wrote Justin, CEO of decentralized perpetual futures platform Vest Exchange, in a Telegram message to Unchained. “However, with the advent of Layer 2 solutions and app chains, builders and users (and MEV bots) are realizing that there are tailored ecosystems for specific use cases. In return, we also see Ethereum to be transitioning moreso as a foundational security layer and for supporting more ‘passive’ protocols such as lending and LSTs.”\n\nEthereum Post-Dencun Upgrade\n\nDencun, the most recent Ethereum hard fork that brought several codebase changes, went live on mainnet on March 13.\n\nWhile the number of transactions has remained stable at just over one million per day, the amount of fees paid by end users of Ethereum has plummeted since Dencun, per Artemis.\n\nWith less overall transaction fees, the amount of ETH burned has gone down as well. According to Ethereum analytics platform Ultra Sound Money, the amount of ETH issued in the past thirty days is more than the amount of ETH burned, one outcome of the Dencun upgrade.\n\n“The new supply of ETH is now growing at the fastest daily rate since the Merge as fees burned plummeted as a consequence of the Dencun upgrade,” analysts at blockchain analytics firm CryptoQuant wrote in a report published on Wednesday.\n\nThe price of ETH reached a multi-year high of $4,000 on the day of Dencun, but has since dropped roughly 25% to around $3,015 at the time of publication, data from CoinGecko shows."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTElXX3kxeDRUUFdiQ29FdV9obmZOblZlYjdNTzlaeko0Zy15UXdMeVhTRHhpSmRXWTJSSWdmckFPMFo3QmRWZG5RcmlXbVQwZE0xVU93dnNxdXdzZFd6VTBVc2hPWEdkamxrU3k5VkFvU1NuU0pHMjZYdlkzRFlZQy1QMV9OUnZEeGZuclVfRE10NDJBVDFydnFpRzFxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Grayscale will focus energies on spot Ethereum products, CEO says - DLNews",
        "content": "Grayscale Investments has withdrawn its application to provide an Ethereum futures ETF.\n\nMichael Sonneshein, Grayscale’s CEO, said he is optimistic that the SEC will approve the firm’s application to convert its Ethereum trust to a spot ETF\n\nGrayscale Investments will focus on converting its Ethereum trust — the world’s largest — to spot exchange-traded products, CEO Michael Sonnenshein said on Wednesday.\n\n“At Grayscale we decided to focus our energy on our spot products. That’s really core to our DNA,” he said during an event in London that was hosted by the Financial Times.\n\nOn Tuesday, media reported that the crypto-native asset manager had withdrawn its application to the Securities and Exchange Commission to provide an Ether futures ETF.\n\nIt had filed the application in October.\n\nSonnenshein said the asset manager was withdrawing the application because a number of futures products are already available for investors.\n\nAs DL News has reported, VanEck’s EFUT and ProShares’ EETH dominate the brutally competitive Ethereum ETF field, accounting for over 90% of total trading volume at launch.\n\n“Sometimes we will file for a product. That doesn’t necessarily mean it’s going to come to market,” Sonnenshein said\n\nAll eyes on Ether ETFs\n\nGrayscale paved the way for the approval of Bitcoin spot ETFs by winning a legal case against the SEC that allowed it to convert its Bitcoin Trust to an ETF.\n\nJoin the community to get our latest stories and updates\n\nThe SEC granted Grayscale’s application — plus 10 others from various asset managers, including BlackRock and Fidelity Investments — in January\n\nSince the wild success of these funds, which have seen almost $12 billion in net inflows, attention has turned to the approval of spot Ethereum products.\n\nGrayscale, along with BlackRock, VanEck, ARK Invest, Fidelity, Invesco, and Hashdex, has applied to convert its Ethereum trust to a spot ETF.\n\nThe industry will know what the SEC is thinking when the regulator makes a decision on the first application, VanEck’s, on May 23.\n\nMini Trust\n\nGrayscale has also filed to provide a mini trust — a smaller fund seeded with assets from the larger trust.\n\nCraig Salm, chief legal officer at Grayscale, has said the Grayscale Ethereum Mini Trust aims to complement the rest of the firm’s Ethereum-based line of products to support a range of investors.\n\nThe mini trust “would launch as a lower-fee alternative spot Ethereum ETF and is designed for investors interested in optimising their Ethereum ETF investment for a ‘buy-and-hold’ strategy in their brokerage or retirement account, for example,” Salm said.\n\nAnalysts aren’t bullish on the chances of the SEC approving any of the applications for spot Ether products.\n\nFor one, Ethereum’s regulatory status isn’t clearly defined. SEC chair Gary Gensler has been evasive about whether Ethereum is a security.\n\nPlus, Gensler suffered political blowback from anti-crypto politicians in the Biden administration after the SEC approved spot Bitcoin ETFs — though, arguably, the agency had no choice after it lost in court to Grayscale.\n\nOn Wednesday, Sonnenshein said while it was difficult to know what the SEC is thinking on Ethereum, Grayscale is “optimistic that the SEC will do the right thing by investors.”\n\nHe added that “Grayscale Ethereum Trust is already an SEC reporting company. We file 10-Ks and 10-Qs [disclosures to the SEC], and we’ve always been a business that pushes our regulators to allow crypto to be brought further and further into the regulatory perimeter.”\n\nReach out to the author at joanna@dlnews.com."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA2UUV3UER6WC1tR0pqQXZqVml0RUxmTm1uZkJIbGlGdWo3N0NpcktpLWtRN0J3ZlhjWjRLOGZVQ1AwQ0c4UzhFYTVlZVozak5KTXN4U3dDOXF3VUFMcXREVDI0dVgwX1hFSkpicmVLVFAtQTJQeVBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Grayscale backs off from its Ethereum futures ETF application - Crypto Briefing",
        "content": "Grayscale abandons Ethereum futures ETF plan after multiple SEC delays, though analysts suggest that the asset manager may possibly file another application.\n\nShare this article\n\nGrayscale, a leading crypto asset manager, has withdrawn its rule change application to the Securities and Exchange Commission (SEC) for an Ethereum futures exchange-traded fund (ETF), citing multiple delays by the federal regulator since the initial filing in September 2023.\n\nThe notice of withdrawal, submitted on Tuesday, did not provide specific reasons for Grayscale’s decision to abandon its plan for the Grayscale Ethereum Futures Trust ETF. The SEC had invoked several delays in reviewing the proposal, most recently on March 22, after previously extending the review period on November 15 and December 18.\n\nBloomberg analyst James Seyffart described the move as “interesting,” suggesting that the filing was “essentially a trojan horse” designed to create similar circumstances to Grayscale’s successful lawsuit against the SEC over its Bitcoin trust (GBTC).\n\nUPDATE This is interesting. @Grayscale just withdrew their 19b-4 filing for an #Ethereum futures ETF. This was essentially a trojan horse filing in my view, in order to create the same circumstances that allowed Grayscale to win the $GBTC lawsuit (approve futures deny spot) pic.twitter.com/Kihj2dlQx1 — James Seyffart (@JSeyff) May 7, 2024\n\nIn August, a federal appeals court sided with Grayscale after the firm accused the agency of approving Bitcoin futures ETFs while denying Bitcoin spot ETFs.\n\nSeyffart speculateds that Grayscale wanted the SEC to “approve futures, deny spot” again, potentially setting up another legal showdown. However, he noted that the withdrawal could be a sign that Grayscale is not pursuing a lawsuit this time around.\n\nNotably, however, Seffart did not dismiss the possiblity of Grayscale re-filing an amended application, which would be less work for the SEC but would eliminate the opportunity for a lawsuit.\n\nThe move comes amid growing skepticism about the SEC’s willingness to authorize Ethereum spot ETFs, despite the agency’s approval of Bitcoin spot ETFs in January, which sparked a bull run for the top cryptocurrency.\n\nThe odds of approval for Ethereum spot ETFs have continued to decline, further diminished by recent revelations that the SEC allegedly classified Ethereum as a regulated security last year, contrary to public statements indicating that no decision had been made."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9EMk9SbkZnVUdhVEZaOC1scnVqVThwNFRjYXJfU0hiOGlLY0xlSTdCZkYwWEZrX0RicEJMNlF5VGVLUmpBZGUxSGtTSXQxUmR1UmhYTDRlWXdjbGNBWGtycU94MDlrUm4t?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "MEV collected by validators is now higher on Solana than on Ethereum - Blockworks",
        "content": "Solana’s validators are a bit like baristas flipping around an iPad — they’re nicer to you when you include a tip. And as traders keep cramming into Solana’s metaphorical coffee shop, the validator tip jar looks increasingly stuffed with money.\n\nValidators are a group of 1,728 computers that run software to produce blocks on the Solana blockchain. Coinbase Cloud is a prominent Solana validator, as is Google Cloud. One revenue stream that validators earn is called maximal extractible value (MEV), which refers partly to tips paid by searchers to be included in Solana blocks.\n\nThis MEV revenue has been growing quickly since mid-March. Notably, Solana validators are earning more from MEV overall than Ethereum validators, according to Blockworks Research. Just a few months ago, Solana’s MEV revenue was a rounding error compared to Ethereum’s.\n\nRead more: MEV doesn’t have to be a zero-sum game, research suggests\n\nBroadly defined, MEV refers to the largest amount of value that validators can create by packing transactions into blockchain blocks. Blockworks Research’s dashboard suggests Solana validators raked in a hair under $7 million from MEV last week.\n\nAt the moment, Solana MEV is almost entirely the product of a protocol named Jito. Jito offers a fork of the Solana validator called Jito-Solana, and 78% of Solana’s validators use this client, according to Jito’s website. The client lets searchers, or traders, arrange transactions in bundles. Searchers can include a tip to try getting validators to send their particular bundle to the blockchain.\n\nWhether all this is good for Solana is something of a matter of perspective. Some forms of MEV can be predatory. Jito recently suspended its mempool, a kind of waiting area for transactions, due to “sandwich attacks” that let opportunists create MEV by trading right before and after a transaction to manipulate the price and take profit from the trader.\n\nRead more: Jito Labs ends mempool functionality citing impact on Solana users\n\nIn Jito’s telling, the protocol is making Solana more efficient while also minimizing negative forms of MEV like sandwich attacking. If it can pull that off, Solana could see a lot of benefit.\n\nContinued long-term growth in Solana’s MEV would likely imply that less spam is being included in blocks, and Solana would have more available blockspace, Blockworks Research analyst Hayden Tsutsui said. In a best case scenario, more blockspace could free up room for more on-chain activity, which could also bring along more liquidity, Tsutsui said.\n\nBut it bears mentioning that as things currently stand, Solana is still staggering under a mountain of spam. More than 60% of non-vote transactions fail on Solana, according to Blockworks Research, largely due to bots taking advantage of Solana’s cheap fees by inundating the network in hopes of getting transactions to land.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPZ01XM1dtUHRITm4tRzFhdnN6ZjFNSE9xNzFLLWxiQkx4SkE4WF9CMXBZbEZrVkFYX0FlcDd0NHJ3Z3Z5d2t3YnlOOUZ4cWw3bHVQc0xjQ0ZNMWxnYXdVU0JvenBmelBTUjZzS0ViM1kteElmelBnbG9BY0RCbDlDakV4SG9ldEt0d3NWS0NxeEhWdXpzWXcwQW5wbmdpbV9yOUl1ZE9TVWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Can ETH Reach $4,000 in May 2024? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9qSWxZUG51VnhmbUxYal9VNEVMZTFoS3pOU2hQWjBlM0ZpVVJ4ektUTjNZc1M4TGFXSG5vM2dBYW5kbm9mR01iSWR2elpDSFpidW5ZZmp0cWU1QjJzRFhlamZTXzFJc1lRRkptMGJWZFliMXBFRHN5ekZQMS1OLU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana Gains 5%, While Bitcoin and Ethereum Experience Minor Dips - Yahoo Finance",
        "content": "Solana Gains 5%, While Bitcoin and Ethereum Experience Minor Dips\n\nWhile most of the top cryptocurrencies are trading sideways or slightly down, Solana (SOL) stands out with a nearly 2.28% increase over the past day. According to CoinMarketCap data, Solana is currently trading at $155.03, marking a week-long gain of over 20.36%. Despite a turbulent month that saw its value swing from a high of $184 to a low of nearly $120, Solana has been steadily climbing in the past week, outpacing the gains of Bitcoin and Ethereum.\n\nIn contrast, Bitcoin remained flat over the past 24 hours, trading at $63,618, while Ethereum has dipped slightly by 0.84% to $3,075. Over the past week, Bitcoin has seen a modest increase of 4.05%, while Ethereum is up 2.20%.\n\nAmong the top 100 coins by market capitalization, a couple of notable gainers are in the Solana ecosystem. Jupiter's token, JUP, which serves as a decentralized exchange aggregator, has risen 25% over the past week to reach a price of $1.14. Additionally, leading Solana-based memecoin Dogwifhat (WIF) has experienced an over 35% increase over the past 7 days, reaching $3.28.\n\nSolana's recent resurgence coincides with a surge in new tokens deployed on the network using the SPL standard. On Saturday alone, a record-breaking 14,648 new tokens were deployed on Solana, as reported by Solscan. This trend has continued for the past two weeks, with at least 10,000 new tokens being introduced on the network each day."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBiUnBiLUxRVjVQQWJnRXhWNkJmMnYyYlRTSkgwWkpVRkdoWVNELXItb0RjdnFQc3p2N3VyQVdOOFB3WFhkVV9CemRjUW1hTFVPWWZ0WVZDcGpTZno1QVd6OEx5QWFPQy1iOTdHSDF0dGUybGo0bmUwStIBgAFBVV95cUxQVENuYVk1V3JnSWo0YzVUbkY3M0taZHVBVEZrOGdEQ0thVkl4d2tWdzlmMHRFWnk4SlBlampvN2JxSmhjYmtwTkZsdUx3UjZrZUNRa2pla2RMQm9QYTJ5NWhLcWxaYmhmNC1Pc1FGU24xQmd2OEJWUGlkRkttbkNNRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Is No Longer ‘Ultrasound Money’ After Dencun Upgrade: Analysts - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s latest upgrade may have worked a bit too well, bringing unwelcome consequences for long-term Ethereum (ETH) investors.\n\nAs advertised, the Dencun hard fork slashed transaction fees by over 90% on multiple Ethereum layer-2 networks shortly after going live on March 13. the median Ethereum transaction fee today is up to four times lower than before Dencun when comparing periods of similar network activity, according to market intelligence platform CryptoQuant.\n\nWith users paying less in fees, however, the Ethereum network is now burning the circulating ETH supply at its slowest rate since the Merge in September 2022. In fact, the burn rate is now so low that ETH has returned to being an inflationary currency, regularly issuing more units than are burned in a given period.\n\n“We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, and the narrative of ‘ultrasound’ money has probably died or would need much higher network activity to come back to life,” CryptoQuant analysts in a weekly research report on Wednesday.\n\nAD\n\nAD\n\n“Ultrasound money” became a popular nickname for Ethereum after the Merge, which changed the consensus mechanism for the second largest cryptocurrency by market cap from proof of work to proof of stake. The upgrade also cut the issuance rate of new ETH by 90%, bringing it below the amount that the network burned through fees.\n\nEthereum faithful eagerly used that fact to needle Bitcoiners, who have proudly championed Bitcoin (BTC) as “sound money” thanks to its fixed supply of 21 million coins. Theoretically, Ether was now superior “ultrasound money” with an actively decreasing supply, making it a better long-term store of value.\n\nBut with ETH’s inflation rate back above zero, that argument is gone—and a revival in network activity may still fail to bring it back. As CryptoQuant noted, fees burned on Ethereum were positively correlated with network activity up until Dencun, after which they fell like a rock.\n\nCould someone tell me how is ETH not crashing? The total fees are bottoming. The burn is bottoming. Inflation is actually hitting same levels as Bitcoin once in a while. CEO and General Council for Consensus: \"We have started our lawsuit because we did not believe SEC will… pic.twitter.com/y5DqKYLLKt — zatoichi42🌊 (@zatoichi42) May 7, 2024\n\nAD\n\nAD\n\nAccording to the open-source dashboard ultrasound.money, Ether’s current inflation rate is 0.559% per year—still higher than Bitcoin’s 0.835% rate following last month’s halving.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNeEZRVmlMVGdwYTJnRnZDZ2g2Q3U4ZzlfV2dmeWk4MnA1cTJwOXN4WUlXb1plemhrN3g5ZWpfRFc0cHhEREppM1pDaEFIbDhSSkpBSmFwT19SOXh5R2NKakNDa2dNemZkVmFVeUc1ODcyejdkTHNWcG05VGxBWE9rVGhZWXpfVDVzRUUzOUYxRTJQVjRqVF9RY0dRVWNSMmhOT1J0RW9sSVl1bklTLTBqWG1RZ9IBuAFBVV95cUxPRC1wTDNnZ2s1bl80SDRuTkVSbTBkSldjc3BhZXpqemIyU2hiT0h4STZwcU5wYVkxQV9pOTlLSG1EREx5UG9UNGpKWU51ajZiTjlWT195cEhUaFhjUUhHV1hWTlRQQzhmN3lRbnlDSHJHSEVjSk9VbEt5MXB2UFFTMF9yaF9XR2Fta1JfTHE5cHpZV3pXMFBXU05aa0NmaWFGVzQ1Mk5Lb1ZfeWgzVkNOcUQ1NkIzS3BB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "ETH Reverts to Inflationary Asset Following Fee-Reducing Dencun Upgrade - CoinDesk",
        "content": "A CryptoQuant report reveals that Dencun has made transaction fees on Ethereum on average four times lower than they were before, but this also means that the amount of ETH getting burned has declined to one of the lowest levels since the Merge and supply is growing at the fastest rate since 2022."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNdkJtY2NKX2pzaFlkVTh1aGlqY2plcndNbWdjbTVRNkl2WFkyN0MzT3ZxeFdVRU1DXzkxdkxVU0FtSU5LUUhyWHFiZGFsWWpBSFA2MWwtR2JHSU5PdDRvRHdBczRKMXhkOFFQYXQxa0FId3V6WVZiWktkM1p1ZXZmVDliejhmRVNpcVRSRWFOdjFVdDRQYmdyaXNuRnA1ZnR0VFhaYkZ4Ny1JV1hHeUgyZElUSHZFRk4tMXcxeTBfZFpQZW5MNDFGa1FIR0tKdmJsVmNWUklJeGdIVnBxbTJaLXFFelTSAeoBQVVfeXFMTjdxZk9IdElPTl9FaVMwSm1EYW15OTdfaU1NMUJFdGtJMGlZMm5uM0VjX1pXTERrX3NwWnBzMjRvNkcybDZQZEdpeFBEdVoxNHY1WlF0NjIxUnBRVUtvN2lKZmxFY0kwZEdFSjg0Vm1mcWdaNVVNODZmWGZaa2psaGtaX0R3SnVmMWhzN3J4RkpYdTV4d3NBYzNCVm5Eb2xVZHM5ekQ3d0V3RWhJLTRLb2dkeGk2R284YS1JUEYxejRseDVxdVk4OS1JeGRTMXhMTkZmdnU1Q25LNHE0Sjl1TGZpY19RVm0yMkVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum could experience bullish run, ETH ‘ultrasound’ money narrative at risk - FXStreet",
        "content": "Ethereum’s ‘ultrasound’ money narrative is at risk after the Dencun upgrade, said CryptoQuant.\n\nEthereum's EIP-7702 would address concerns raised about the previous EIP-3074.\n\nEthereum's recent price action suggests it may be gathering momentum for a bullish run.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as a recent report from CryptoQuant reveals its ultrasound money narrative is at risk. Also, the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074.\n\nRead more: Ethereum resume sideways move as Grayscale files to withdraw Ethereum futures ETF application with the SEC\n\nDaily digest market movers: Ultrasound money, EIP-7702, Ethereum Foundation\n\nEthereum is set to see interesting updates on its blockchain following recent developments. Here are key market movers for the top altcoin:\n\nA recent report by CryptoQuant highlights that Ethereum is becoming inflationary following the Dencun upgrade in March. After the Merge that saw Ethereum transitioning from a Proof-of-Work (PoW) to a Proof-of-Stake consensus mechanism, the network began burning gas fees at a significant rate that saw a significant reduction in the growth of ETH's circulating supply.\n\nHowever, since the Dencun upgrade, when the introduction of \"blobs\" reduced Ethereum's network activity to boost its scalability and reduce user fees, the amount of gas fees burned has reduced significantly.\n\n\"Before the Dencun upgrade, the higher network activity on Ethereum meant higher fees burned and hence less ether supply. However, after the Dencun upgrade, the total amount of fees burned has decoupled from the network activity,\" noted CryptoQuant. As a result, this puts ETH's 'ultrasound' money narrative at risk since its circulating supply would begin increasing over time.\n\n\"We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, and the narrative of 'ultrasound' money has probably died or would need much higher network activity to come back to life,\" said CryptoQuant.\n\nFurthermore, following several concerns raised about EIP-3074, which was considered for inclusion in the upcoming Pectra upgrade, Ethereum co-founder Vitalik Buterin and co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett proposed EIP-7702 as an alternative.\n\n3074 = upgrade for normal \"EOA\" wallets to give some smart wallet functionality\n\n4337 = standard for smart contract wallets\n\n\n\n3074 was slated for inclusion, v likely worried the long term implications of\n\n1) compatibility btwn 3074 and 4337 wallets\n\n2) 3074 breaking in a future… — hayden.eth (@haydenzadams) May 7, 2024\n\nEIP-7702 introduces a new transaction type that would allow externally owned accounts (EOAs) to temporarily act as smart contracts during a transaction. Like EIP-3074, the new proposal would enable better ways to abstract gas fees, batch transactions, and improve the user experience. However, it goes further by improving compatibility with the ERC-4337 standard for smart contract wallets — an issue with EIP-3074 — and being more future-proof.\n\nSome crypto community members have speculated that EIP-7702 would replace EIP-3074 in the upcoming Ethereum Pectra upgrade. One X user commented, \"I think it would probably make more sense to include in Pectra than 3074.\"\n\nFireblocks' VP of Technology Arik Galansky also commented on the proposal saying, \"It's a long while since Ethereum introduced changes that are user-oriented rather than scaling-oriented and this one is right on point.\"\n\nA few weeks ago, EIP-3074 sent the AA world into shambles.\n\n\n\nInitially it looked like it's synergetic with ERC-4337, since they do different things. One enables EOA migration, another enables decentralized mempools.\n\n\n\nHowever, the nitty gritty details looked suboptimal: it's hard… — Ivo e/acc (@Ivshti) May 7, 2024\n\nAlso read: Ethereum traders show uncertainty, SEC delays decision on Invesco's ETH ETF application\n\nMeanwhile, the Ethereum Foundation appeared to be dumping ETH again on Wednesday following a transfer of 1,000 ETH worth $3 million to middle multisig address 0xbc9, according to data from Spot On Chain.\n\nThis transfer is the latest action in a larger trend where the Ethereum Foundation has sold 1,766 ETH for 4.81 million DAI stablecoin at ~$2,725 since the beginning of 2024. The ETH sales, done in small batches through the same middle multisig address 0xbc9, often coincide with brief Ethereum price declines, noted Spot On Chain.\n\nETH technical analysis: Ethereum could be gathering momentum for a bullish run\n\nThe market remained quiet on Wednesday as Ethereum continued trading around the $3,000 mark. Despite the calm market, ETH derivatives volume in May has risen higher — close to 60% — than that of Bitcoin, according to QCP.\n\nRead more: Ethereum could see a brief rally despite Michael Saylor's jab at ETH ETFs\n\nThe reason for the increase may be the market pricing in volatility over the Securities & Exchange Commission's (SEC) upcoming decision on Van Ecks' spot ETH ETF application on May 23, noted QCP. This also explains why the market is slightly tilted toward a downward movement as many expect the SEC to deny spot ETH ETF applications.\n\nWhile current price action indicates ETH may continue a horizontal movement in upcoming weeks, historical data suggests the largest altcoin could be gathering momentum for a bullish run. Considering ETH has remained in the $2,852 to $3,300 range for nearly a month, it could attempt a sustained breakout above the upper level of the range if it sees a slight bullish trigger.\n\nETH/USDT 4-hour chart\n\nOnchain data also shows most whales have been accumulating ETH around this range in anticipation of a price rally. A bearish event could see it break below the lower level of the range briefly, presenting a buying opportunity.\n\nEthereum is trading at $3,013 on Wednesday, May 8, down 0.7% on the day."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0zNXZBWXd1NS1DUFd3SFd5V3FJWnlqV1lEVU53TkN3Tzc4bU95WnNRLXptTW5EMEpUQXE3d0p4WFdyektHemI3QUI1UjRuN0tXLWVKUUVhVGVOZUREdktV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "51% Attack: Definition, Who Is At Risk, Example, and Cost - Investopedia",
        "content": "What Is a 51% Attack?\n\nA 51% attack is an attack on a cryptocurrency blockchain by an entity or group that controls more than 50% of the network. If a party were to gain this much control of a network, it would have the power to alter the blockchain.\n\nThe attackers would be able to prevent new transactions from gaining confirmations, allowing them to halt payments between some or all users. They would also be able to reverse non-confirmed transactions that were completed while they were in control. Reversing transactions could allow them to double-spend coins, one of the issues mechanisms like proof-of-work were created to prevent.\n\nKey Takeaways Blockchains are distributed ledgers that record every transaction made on a cryptocurrency's network.\n\nA 51% attack is an attack on a blockchain by an entity or group that controls more than 50% of the network.\n\nAttackers with majority network control can interrupt the recording of new blocks by preventing other miners from completing blocks.\n\nChanging historical blocks is impossible due to the chain of information stored in Bitcoin's blockchain.\n\nAlthough a successful attack on Bitcoin or Ethereum is unlikely, smaller networks are frequent targets for 51% attacks.\n\nUnderstanding a 51% Attack\n\nA blockchain is a distributed ledger—essentially a database—that records transactions and information about them. The blockchain's network reaches a majority consensus about transactions through a validation process. The blocks where the data is stored are sealed. The blocks are linked together via cryptographic techniques where previous block information is recorded in each block. This makes the blocks nearly impossible to alter once they are confirmed enough times.\n\nThe 51% attack is an attack on the blockchain, where a group controls more than 50% of the hashing power—the computing that solves the cryptographic puzzle—of the network. This group then introduces an altered blockchain to the network at a very specific point in the blockchain, which is theoretically accepted by the network because the attackers would own most of it.\n\nChanging historical blocks—transactions locked in before the start of the attack—would be extremely difficult even in the event of a 51% attack. The further back the transactions are, the more difficult it is to change them. It would be impossible to change transactions before a checkpoint, where transactions become permanent in Bitcoin's blockchain.\n\nAttacks Are Prohibitively Expensive\n\nA 51% attack is a very difficult and challenging task on a blockchain network with a large participation rate. In most cases, the group of attackers would need to be able to control the necessary 51% and have created an alternate blockchain that can be inserted at exactly the right moment. Then, they would need to out-hash the main network. The cost of doing this is one of the most significant factors that prevent a 51% attack.\n\nFor example, one of the most advanced application-specific integrated circuit (ASIC) miners is the WhatsMiner M63S. It costs more than $10,000 (new) and has a hash rate of 406 terahashes per second (TH/s). A single or smaller group of miners would not be able to alter and mine the Bitcoin blockchain with only a few of these machines. It would take thousands of these ASICs to get ahead of the Bitcoin network. Smaller networks could be out-hashed using these mining rigs, but the benefits of doing so wouldn't outweigh the costs of funding the attack and setting it up.\n\nHashing power rental services provide attackers with lower costs, as they only need to rent as much hashing power as they need for the duration of the attack.\n\nAfter Ethereum transitioned to proof-of-stake, a 51% attack on the Ethereum blockchain became even more expensive. To conduct this attack, a user or group would need to own 51% of the staked ETH on the network. It is possible for someone to own that much ETH, but it's unlikely.\n\nAccording to Beaconchain, more than 32.3 million ETH were staked on May 8, 2024. An entity would need to own and stake more than 16.5 million ETH (more than $49 billion as of May 8, 2024) to attempt an attack.\n\nOnce the attack started, the consensus mechanism would likely recognize it and immediately slash the staked ETH, costing the attacker an extraordinary amount of money. Additionally, the community can vote to restore the \"honest\" chain, so an attacker would lose all of their ETH just to see the damage repaired.\n\nAttack Timing\n\nIn addition to the costs, a group attempting to attack the network using a 51% attack must not only control 51% of the network but also introduce the altered blockchain at a very precise time. Even if they own 51% of the network hashing rate, they still might not be able to keep up with the block creation rate or get their chain inserted before valid new blocks are created by the 'honest' blockchain network.\n\nAgain, this is possible on smaller cryptocurrency networks because there is less participation and lower hash rates. Large networks make it nearly impossible to introduce an altered blockchain.\n\nDespite the name, it is not necessary to have 51% of a network's mining power to launch an attack. However, such an attack would have a much lower chance of success.\n\nOutcome of a Successful Attack\n\nIn the event of a successful attack, the attackers could block other users' transactions or reverse them and spend the same cryptocurrency again. This vulnerability, known as double-spending, is the digital equivalent of a perfect counterfeit. It is also the basic cryptographic hurdle blockchain consensus mechanisms were designed to overcome.\n\nSuccessful 51% attackers may also implement a Denial-of-Service (DoS) attack, where they block the addresses of other miners for the period they control the network. This keeps the \"honest\" miners from reacquiring control of the network before the dishonest chain becomes permanent.\n\n\n\nWho Is at Risk of 51% Attack?\n\nThe type of mining equipment is also a factor, as ASIC-secured mining networks are less vulnerable than those that can be mined with GPUs; they are much faster. Cloud services such as NiceHash—which considers itself a \"hash-power broker\"—theoretically make it possible to launch a 51% attack using only rented hash power, especially against smaller, GPU-only networks.\n\nBitcoin Gold has been a common target for attackers because it is a smaller cryptocurrency by hashrate. Since June 2019, the Michigan Institute for Technology's Digital Currency Initiative has detected, observed, or been notified of more than 40 51% attacks—also called chain reorganizations, or reorgs—on Bitcoin Gold, Litecoin, and other smaller cryptocurrencies.\n\nAre the Odds of a Bitcoin 51% Attack Growing?\n\nOn May 8, 2024, the Bitcoin network's total hashrate was 569.29 exahashes per second (EH/s). The top three mining pools by three-day hashrate were:\n\nFoundryUSA, at 175.76 EH/s; 30.9% of the total Bitcoin network hashrate\n\nAntPool, at 161.77 EH/s; 28.4% of the total Bitcoin network hashrate\n\nViaBTC, at 73.11 EH/s; 12.8% of the total network hashrate\n\nCombined, these three pools made up 72.1% of the network hashrate, a whopping 486.9 EH/s (486.9 million TH/s—the CPU in your computer might be able to hash at about 15 kilo hashes per second). If Foundry and ViaBTC were to collude, they could take over 51% of the hashrate (248 EH/s).\n\nFoundry and Antpool combined could control 69.3% of the network. Because these pools use platforms to connect pool members and manage workloads, if the managers decided to take control they could issue work orders to their pools to work on the altered chain. The pool's miners would have no idea which chain they were working on since their mining rigs automatically work on whatever task they are given.\n\nEven more concerning is that these three pools also monopolize the majority of the network hash rates for Bitcoin Cash, Litecoin, and Bitcoin SV.\n\nThese pools have been operating for several years without issue, but the fact remains that they already control most hashing power of the minable and profitable cryptocurrencies.\n\n\n\nWhat Does a 51% Attack Do? A 51% attack alters blocks that are being added to the blockchain, giving the attackers the ability to create or alter transactions for the period they are in control.\n\nHas a 51% Attack Ever Happened? Yes. Several blockchains have been attacked using this method, but they had small networks, were new, or had other vulnerabilities that made it possible.\n\nHow Much Would a 51% Attack on BTC Cost? If a large mining pool was directed by its managers to conduct an attack, it wouldn't cost the managers much at the time of the attack. However, it would likely lose its honest miners once they found out about it. For a single person or group to conduct a 51% attack, they would need more than 304 EH/s of computing power. This is an enormous cost considering the fastest miner hashes 406 TH/s and costs more than $10,000 per unit (about 84,000 units).\n\nThe Bottom Line\n\nA 51% attack is the unlikely event that a group will acquire more than 50% of the hashing power of a cryptocurrency network. These attacks happen on smaller crypto networks, but tend to fail on larger ones like Bitcoin because they are more secure.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOeHZ2Q0ZLRnpWRzRFaE1OMVlmd3dPbTBlU0NXMnBxRTNVSFBjWTN3dk1tOFY3bDdjc3MteUprQVBwU3RtR3IyVWZJTll1Mk9xV3ZhOTAwb2tPTUl4aWZvUWJGQno4UWJyYTVFZWEwOGMxSGhiUkhmOEJFYk9laGduMU9LT3lhNkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum ETFs in Hong Kong diverge - CryptoSlate",
        "content": "Quick Take\n\nHong Kong ETFs\n\nAccording to Farside data, the digital asset exchange-traded funds (ETFs) market in Hong Kong (HK) experienced a divergence in flows on May 8. While Bitcoin (BTC) ETFs saw overall inflows, Ethereum (ETH) ETFs saw outflows.\n\nFarside data shows that the BTC ETFs in HK attracted a combined inflow of $6.3 million on May 8. Bosera’s BTC ETF led the way with a $6.2 million inflow, bringing its total net inflows to $15.8 million. AMC’s BTC ETF saw a $0.1 million inflow, totaling $3.6 million in net inflows. Harvest’s BTC ETF did not register any inflow or outflow on the day, but its total net inflow is $6.5 million. Collectively, the BTC ETFs in HK have amassed $25.9 million in total net inflows.\n\nIn contrast, the ETH ETFs in HK faced outflows on May 8. Bosera’s ETH ETF saw an outflow of $0.9 million, bringing its total net inflows to $8.1 million. AMC’s ETH ETF experienced an outflow of $0.8 million, totaling $2.2 million in net outflows. Harvest’s ETH ETF recorded a $0.2 million outflow, taking its total net outflow to $0.2 million. According to Farside data, the ETH ETFs in HK have seen a net inflow of $5.7 million.\n\nFarside data indicates that the collective net inflows into BTC and ETH ETFs in HK have reached $31.6 million.\n\nUS ETFs\n\nOn May 8, activity was relatively subdued in the United States. Bitwise’s BITB ETF was the only one to register an inflow of $11.5 million, bringing its total net inflow to $1,759.6 billion. All other US ETFs saw no inflows or outflows. According to Farside data, the total net inflows for US ETFs stand at $11,778.2 billion."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOdTV0ZzRMbVZvdnMtMnloR0ljcHFXMjdVQk10eVJrNGJVbEdFZjlIYjRlcWVubzBFWTZZYkg2a2UxRi1ra0NJUEl4RWNKLXdrNFlYNm1ndi1YT2lSam85NDNvZ0JHUFQ1LUJ2Z2FfUkNoanR2d1Z3eGgxREk3ZGZLNl9DUEpJZ3gyenhFdGhKOVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana Surges as Ethereum Struggles: Can Furrever Token Mirror SOL's Success With the Help of $10,000 Competition? - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 08, 2024 (GLOBE NEWSWIRE) -- During turbulent times in the cryptocurrency market, where uncertainty looms large and volatility reigns supreme, certain tokens defy the odds and chart their path to success. Solana stands tall, riding a wave of surging momentum, while Ethereum grapples with its challenges, struggling to maintain its position amidst the chaos. Yet, amidst this backdrop of fluctuating fortunes, a beacon of excitement and opportunity emerges: Furrever Token (FURR). As Solana's meteoric rise captures headlines and Ethereum's struggles dominate discussions, FURR enters the fray with a sense of ambition and optimism fueled by the promise of its unique charm and a compelling $10,000 competition.\n\nEthereum ETF Decision Delay Sparks Volatility: SEC's Latest Move Sends ETH on a Rollercoaster Ride\n\nThe US Securities and Exchange Commission (SEC) has once again postponed its decision on the proposed Invesco Galaxy Ethereum exchange-traded fund (ETF), extending the deadline to July 5, 2024. This announcement has triggered a downturn in Ethereum's (ETH) price, adding to the uncertainty surrounding the approval of Ethereum ETFs. With major financial institutions like Grayscale, Franklin Templeton, VanEck, and BlackRock also awaiting regulatory clarity, the market response has been marked by slight downward pressure on ETH, particularly among short-term traders.\n\nDespite briefly breaching the critical resistance level of $3,220, Ethereum has seen a decline of approximately 4% today. The volatility has led to significant liquidations among long traders, totaling $67.42 million, indicative of a cautious sentiment among investors amid regulatory uncertainties. As attention remains focused on further updates from regulatory authorities, Ethereum's trading volume has surged by over 66% in the past 24 hours, reaching $13.78 billion, highlighting the market's keen interest in developments impacting ETH's price.\n\n\n\n\n\nSolana Surges: Breaking Trends and Charting New Heights\n\nSolana (SOL) has experienced a notable uptick in its price, currently standing at around $158.12, marking a 1.5% increase from yesterday. This surge follows a significant breakthrough that has caught the attention of investors and analysts alike. Solana has signaled a potential reversal of its previous bearish trend by successfully breaching a key trendline resistance, instilling confidence in its upward trajectory.\n\nThe next obstacle in its path is the 26-day Exponential Moving Average (EMA), historically a formidable resistance level. Should Solana surpass this barrier, it could pave the way for further gains, potentially reaching the 50-day EMA at around $163.29. This technical achievement underscores Solana's resilience and heralds the possibility of a bullish phase, reinforcing its position as a compelling investment option in the crypto market.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR)'s Path to Success: Leveraging Community Engagement and a Lucrative Competition\n\nFurrever Token (FURR) is positioned on the brink of mirroring Solana's triumphs, propelled by its inventive strategy and recent strides in community engagement. With its mission grounded in fostering a warm and inclusive ecosystem, FURR has captivated investors and enthusiasts, boasting a vibrant community and rapid organic growth. Currently priced at $0.000648, FURR offers investors the potential for up to 15X returns, further enhancing its appeal in the market.\n\nThe recent unveiling of the Furrever Token $10,000 Frenzy Bonanza Competition is pivotal in FURR's journey toward success. This competition represents more than just a mere event; it embodies FURR's commitment to community involvement and excitement. Participants are invited to partake in simple tasks on the Gleam platform, accumulating points and increasing their chances of winning substantial rewards. With a $10,000 prize pool up for grabs, the competition ignites fervor within the FURR community and attracts new participants eager to be part of the excitement. However, time is of the essence, as there are only two days left to join, adding a sense of urgency and encouraging enthusiasts to act swiftly to seize this opportunity.\n\nMoreover, the competition's strategic significance extends beyond mere rewards. By incentivizing participation and rewarding community engagement, FURR aims to solidify its position as a leader in the market. The competition fosters long-term loyalty and enthusiasm among its supporters, laying the groundwork for sustained growth and success. As FURR harnesses the momentum generated by the competition, it sets its sights on a future defined by innovation, prosperity, and unwavering community support.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token $10,000 Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOQnFxSTByVEpCaXNHaWh4VTVJakdlMkpiREFIejNUWjZ4UV9Ud0xsRWl2TDhSMnlwblRnemg0THZpNVJfbXh4VzJWRUlUQzBGZ2c2TGlFQ0lMSjVjSDlUSWk2QmJzQVhSMXhIclJmRmdzaGZ3dWNYUFJpUGE1VDhOTDJ4Y1FlRi1BZFBGNGpYNDE1Uy1WR2hGRDUzY1FDMlFrTzczdFdRTzhEN0hCSzI0MF9aNUtOLTdjakxCeGQ5YmM4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Vitalik’s New EIP-7702 Draws Early Support; Could Be Included in Ethereum’s Next Hard Fork Upgrade - Unchained",
        "content": "EIP-7702, which is meant to enable externally owned accounts to temporarily become smart contract accounts, was largely the result of intense discussions among Ethereum builders over previous improvement proposals.\n\nEthereum Improvement Proposal (EIP)-7702 has seen increasing support among developers, builders, and researchers less than a day after Ethereum co-founder Vitalik Buterin and three additional authors proposed it, a potential sign the EIP will be included in the next hard fork upgrade.\n\nEIP-7702 enables “flash smart wallet accounts,” which are externally owned accounts (EOAs) that become smart wallets, temporarily for one transaction. EIP-7702, wrote Jarrod Watts, developer relations engineer at Polygon, on X is “one of the most impactful changes Ethereum is going to have… EVER.”\n\nEOAs are controlled by their corresponding private key held by people, while smart contract accounts are governed by coding logic.\n\nThe introduction of EIP-7702 comes as the Ethereum community has had ongoing conversations about the most optimal path to what’s called “account abstraction,” in which all externally owned accounts become smart account wallets.\n\nEIP-3074 and EIP-4337\n\nSpecifically, the Ethereum community has been going back and forth about EIP-3074 and EIP-4337, both of which are intended to improve Ethereum’s security and user experience.\n\nEIP-4337, which was deployed on mainnet Ethereum in March 2023, aims to achieve account abstraction “without changes to the consensus layer protocol of Ethereum,” by enabling smart contracts to act as accounts, according to EIP-4337’s GitHub page.\n\nWhile deployed on mainnet for over a year, the problem with EIP-4337 is that “EOAs are still the most used type of account by far,” Watts wrote on X.\n\nThe lack of migration among current users from EOAs to smart contract accounts is occurring for two reasons, according to Watts: people don’t have a way to convert their EOA to a smart contract account, and they also suffer from “a lack of native support by Web3 apps to connect smart contract accounts.”\n\nAs a result, Ethereum developers looked to EIP-3074 to solve these problems. According to its GitHub page, EIP-3074 allows “externally owned accounts to delegate control to a contract.” It’s meant to provide short-term functionality improvements to EOAs and act “as a stepping stone toward full [account abstraction],” said Lukas Schor, co-founder of wallet infrastructure maker Safe, in a conversation with Unchained.\n\nRead More: EIP-3074 vs EIP-4337: Ethereum Developers Disagree on Endgame for Account Abstraction\n\nWhile some were ecstatic about EIP-3074’s planned inclusion in the next Ethereum hard fork upgrade, others were not. According to the authors of EIP-7702, EIP-3074 not only introduces new opcodes that would have no use in a world where all users are eventually using smart contract wallets, but also leads to fragmentation.\n\nEIP-7702, which according to Schor does what EIP-3074 is attempting to do, but better— namely, improving the current user experience for those transacting onchain, as well as being a step in the right direction towards account abstraction including converting all existing Ethereum users’ accounts into smart accounts.\n\nEIP-7702 “modifies EIP-3074 to make it leaner and more compatible with ERC-4337…so that we don’t end up with two separate [account abstraction] ecosystems,” Watts wrote on X. Per its GitHub page, EIP-7702 has forward compatibility with future account abstraction, because “the contract code that users would need to sign could literally be existing ERC-4337 wallet code.”\n\nAs such, Schor thinks EIP-7702, despite its nascent status, will be included in Ethereum’s next hard fork upgrade, dubbed “Petra.” He indicated that EIP-7702 is not only favored by EIP-3074 proponents because it solves the same issues they want such as a better user experience for existing users, but is also “quite liked” by EIP 4337 proponents because of its compatibility.\n\nEIP 7702 feels like an approach to improving EOAs that is more aligned with smart accounts and generally more future proof: https://t.co/Dmx47ZTaYU I think it would probably make more sense to include in Pectra than 3074 — konradkopp.eth (@abstractooor) May 7, 2024\n\nQuantum Resistance\n\nEIP-7702 also seeks to address the potential problem stemming from the advancement of quantum computing, superpowered computers that rely on quantum mechanics.\n\nSome Ethereum developers have become concerned about the possibility that in 5 to 10 years, quantum computing will progress to the point where it can break the cryptographic algorithms called ECDSA used to generate private keys, compromising the security of a blockchain network. ECDSA, an acronym for “elliptic curve digital signature algorithm,” is widely used in many Ethereum-based crypto protocols to verify digital signatures for transactions.\n\n“The only way to move away from that is to not have ECDSA based private keys controlling user wallets, and that is solved by moving users to smart accounts [through EIP-7702], because then you can use different cryptographic curves [and] different signing schemes that are much stronger cryptographically and are quantum resistant,” said Schor."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1UckVPQmlCLUpXVHN2VnBjbzI1Rlg3SS1wUUhtRmJXRWM3cV9HSWtPTV95dHFNRFNpUU13c2MtWGpWeFY5WmQxbkNrMmY5dE0xaHNoQUt1c3ZLU1M5TTFqTklkZnB6bzIwNWNFOHo3NVBaXzZh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Shiba Inu Eyes $0.001 Amidst Supply Challenges, Ethereum Targets Uptrend with EIP-7702, Furrever Token Rallies Community with $20,000 Competition - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, May 09, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market continues to offer diverse investment opportunities with unique growth potentials. Shiba Inu (SHIB), Ethereum (ETH), and Furrever Token (FURR) each present distinct scenarios, from SHIB's long-term aspirations to hit a significant price milestone, Ethereum's ongoing technological enhancements amid regulatory scrutiny, to Furrever Token's engaging community-driven initiatives. These developments highlight the varying strategies and market dynamics that investors and enthusiasts can navigate.\n\nShiba Inu's Road to $0.001: A Millionaire Maker for the Patient Investor\n\nShiba Inu (SHIB), the cryptocurrency that captured the hearts of many young investors, continues to hold the community's attention despite its fluctuating market performance. Originating as a favorite among retail investors, SHIB has created significant wealth for its early backers, with some even reaching millionaire status. Although the token is currently far from its all-time high of $0.00008616 achieved in October 2021, the undying optimism among its supporters envisions a milestone price of $0.001 per SHIB.\n\nTo become a millionaire at this ambitious target price, an investor would need to hold approximately one billion SHIB tokens, currently valued at about $23,972. This significant number reflects not only the potential high reward but also the substantial risk associated with such an investment in the volatile crypto market.\n\nPredictions on when SHIB might reach the $0.001 mark vary, with forecasts suggesting a timeline between 2033 and 2040. Such a long horizon necessitates patience and enduring confidence in Shiba Inu’s market strategy and broader adoption. The primary challenge facing SHIB is its massive circulating supply of 589 trillion coins, which poses a substantial barrier to significant price increases. Achieving a price of $0.001 with such a vast number of tokens would result in an unrealistically large market capitalization, not seen in current crypto valuations.\n\nIn response to these challenges, the SHIB development team is actively working on new mechanisms to reduce the token supply dramatically. Rumors suggest that these new initiatives could potentially burn trillions of tokens annually, accelerating SHIB’s journey towards the $0.001 goal if successfully implemented. This strategy not only aims to enhance SHIB’s value but also aligns with the community's long-term vision of reducing supply to create scarcity, thereby driving up the token's price.\n\nStory continues\n\nFor those betting on SHIB, the path to becoming a millionaire is intertwined with the token’s ability to overcome its supply challenges and achieve unprecedented growth in the coming years. This journey requires both a belief in the token’s potential and the fortitude to withstand the ups and downs of the crypto market.\n\n\n\n\n\nEthereum Positioned for Uptrend Amid Regulatory Developments and Technical Enhancements\n\nEthereum, a leading cryptocurrency, is showing potential for growth amidst a flurry of technical and regulatory developments. On a recent trading day, Ethereum's price was slightly down by 0.7%, trading around $3,013. However, signals of an upcoming rally are emerging, driven by significant improvements in its blockchain technology and speculative market movements.\n\nThe new Ethereum Improvement Proposal (EIP) 7702, developed by co-founder Vitalik Buterin and his team, is at the forefront of these developments. This proposal aims to innovate how externally owned accounts (EOAs) operate by allowing them to temporarily take on smart contract functionalities. This change is set to enhance the user experience significantly by simplifying gas fee processes, enabling transaction batching, and ensuring greater compatibility with the ERC-4337 smart contract wallet standard. These updates emphasize a shift toward making user-focused enhancements rather than purely technical scaling solutions, reaffirming Ethereum's commitment to its community of users.\n\nMoreover, the market is on edge as it awaits the U.S. Securities & Exchange Commission's (SEC) upcoming decision regarding the Van Ecks' spot ETH ETF application, expected on May 23. This decision is anticipated to cause volatility, with the community and investors closely watching for any potential impact on Ethereum's market position. Although current sentiments tend towards caution, historical trends and recent significant buying activities by large investors, commonly referred to as 'whales', suggest that Ethereum could be on the cusp of a significant upward movement. Should the market receive even slight bullish signals, Ethereum might break through the upper levels of its current price range, presenting a valuable buying opportunity for long-term investors.\n\nFurrever Token Stimulates Market Activity with $20,000 Competition Following Impressive Presale\n\nFurrever Token (FURR) is gaining notable traction within the cryptocurrency sector by not only achieving over $1.1 million during its presale but also by initiating a lucrative buying competition. The newly announced \"Highest Total Buys Competition\" is set to distribute $20,000 worth of FURR among the top ten participants who invest the highest amounts over the course of the event. This competition is designed to further energize the Furrever community and stimulate market transactions for the FURR token.\n\nKicking off today, the 18-day competition promises generous rewards for the most active buyers. The participant with the highest total purchase will be awarded $5,000 in FURR tokens, with the second and third highest buyers receiving $4,000 and $3,000, respectively. Those who place fourth through tenth will each receive $1,000 in FURR tokens. This strategic move not only encourages community participation but also aims to enhance the liquidity and trading activity of the Furrever Token.\n\nPriced attractively at $0.000648 per token, Furrever Token presents an enticing investment opportunity with potential returns of up to 15X. The vibrant community backing the token is evident in its active Telegram group, which houses over 4,000 members. Here, investors and enthusiasts collaborate and exchange ideas, staying informed about the latest developments and strategic directions of the Furrever Token. This level of engagement and the exciting new competition underline the dynamic and promising future of the Furrever Token in the competitive cryptocurrency market.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPSEhxemRCdEdTVlk0RWRoa0pDZmFTZnA2SmJ3U0VGVHQ0YWQtS2VzNGRNR19uTEdodzNpSjlVeU94SHdtYkpTeXdsOExPMHdZaTdpNGdDQ2s4eTNHcHZ5Ylc2dWdXdFBLcnVqckZMNkhJSVhWV3lUNGc1cjhGOWNyMVJabm5pQVp2eVhzVDRnd0ExUE1McDlXNkJuQjFfTHpWbUtTRmhXMWpWdEtFbXlVd25QaE9YZ9IBuwFBVV95cUxOeXk5UWpPYUNtVXRpUm5kQURWMURXbUxiN1RFUWNScVRoX0FuVlBwSWwyLXVBRHZQeWZaRVRBTHhZNGxKbjV3bnRnek9lQVhXZ2ZGZTJTX3BFS3lTZldHSHd4MXNLb2ZsQ0NhWEpOUFFUZFBwR3FaVkNQUDhJT1U3TDdsalhac2Z1UVhQd2JYOU00djBaY1hWeENuYWRFNHJWV0JWaGJwRGc3T1BOUmRCbHlSOWg4Vk5obWc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Here’s Why Ethereum (ETH) Has Been Lagging Behind Bitcoin (BTC), According to Glassnode - The Daily Hodl",
        "content": "Market intelligence firm Glassnode says Ethereum (ETH) has been lagging behind Bitcoin (BTC) for one key reason.\n\nIn a new analysis, Glassnode says that Ethereum has not seen the same level of increased capital from new buyers that Bitcoin has in the current market cycle, which drove the crypto king to new all-time highs (ATHs).\n\nThe analysts say that the approval of spot Bitcoin exchange-traded funds (ETFs) was likely a main driver for the increase in short-term holders who bought BTC in the last 155 days.\n\n“In the run-up to Bitcoin’s all-time high on March 14th, there was a noticeable increase in speculative activity. Specifically, capital accumulation has been observed among short-term holders (STHs), with the USD wealth held within coins moved within the last six months approaching $240 billion, near ATHs. However, this trend has not been mirrored for ETH, which has not yet seen price break above the 2021 ATH.\n\nWhilst Bitcoin’s STH-Realized Cap is nearly on par with the last bull run peak, ETH’s STH-Realized Cap has barely lifted off the lows, suggesting a markedly lackluster inflow of new capital. In many ways, this lack of new capital inflows is a reflection of the underperformance of ETH relative to BTC. This is likely in part due to the attention and access brought about by the spot Bitcoin exchange-traded funds.”\n\nThe Realized Cap metric records the price at which each coin moved and aims to gauge how many holders are in profit or at a loss.\n\nThe analysts suggest ETH could see a large capital inflow if the U.S. Securities and Exchange Commission (SEC) approves spot Ethereum ETF applications later this month.\n\n“The market is still awaiting the SEC’s decision for approval of a suite of ETH ETFs expected towards the end of May.”\n\nBitcoin is trading for $61,454 at time of writing, down more than 2.6% in the last 24 hours. Meanwhile, Ethereum is trading for $2,970 at time of writing, down more than 2.7% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZGp2R2VObnM5bW14cnByZWNRazRBcUM3NV9teC04VWRBbVgwaF94RjB4NUVuUVpHUkZvTWVQSHV3QWQxU3U1dmpfT2RzbUViNmlBX1JIUmIwVVRFWnNHVWNZMG5uTXJncWdla0J6aDd0czA5dnlGQ0VqYmF2S28yQWMtRUZYX0RjS2JldVhIT3BkUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Traders Increase Short Positions as Grayscale Withdraws Ethereum Futures ETF Application - Yahoo Finance",
        "content": "Traders Increase Short Positions as Grayscale Withdraws Ethereum Futures ETF Application\n\nThe price of Ethereum (ETH) has been hovering near a crucial support level at $3,010, experiencing a 2.57% drop over the past 24 hours, according to CoinMarketCap data. During this time, traders have shown a growing belief that the price will continue to decline, as they have accumulated significant short positions.\n\nThis development comes after Grayscale Investments decided to withdraw its application for an Ethereum futures exchange-traded fund (ETF) on May 7, just ahead of the scheduled decision by the United States Securities and Exchange Commission (SEC). The fate of spot Ether ETF applications, also set to be determined in May, has further fueled speculation regarding the classification of Ether as a security.\n\nLiquidation data indicates that if the price of Ether rises by 3%, approximately $345 million worth of short positions could be liquidated. In contrast, a 3% drop to $2,920 would only result in the liquidation of about $237 million in long positions.\n\nAnalysts and the crypto community have grown increasingly skeptical about the approval of a spot Ether ETF by the SEC. However, concerns about Ethereum extend beyond ETF approvals. The low usage of Ethereum has resulted in the challenge of its burn mechanism keeping up with issuance to validators. Furthermore, Ethereum has underperformed in comparison to Bitcoin, attributing it to a lag in speculative interest from short-term holders (STH)."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9KQ1JCbFhmYm9wQ082YV81Nno0WmpJX25hNzQ2eFdEOFA3ZmdYU0gtZjlPQzRUNUU4MExaV2VIWVp4Tl9sTVZkODR3aGNiT3VXWkdSc2JQU0U1Rk9nZ1U0c0VZbXFMZFFVSkhwbk9qZ2lJNURuZWVsVtIBfkFVX3lxTE1QZ0NaYkZmTVczcDVfSnhYckhpUlFldlVxbkZ4Z1dlVk5zX0gzUS1lREtkbXR3ZU9tYk5vYkhqYS1BSUZkTU5EOFRVbkFxOHAybTA5MjhvRmZRZEEzOGRnUzRnZUZNTFpPaEVCb0t3eTJQdVpJX1Rsd1RmQzl0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "This Ethereum ‘weakness’ may keep ETH’s price below $3,100 - AMBCrypto News",
        "content": "Data showed that ETH’s underwhelming performance has restricted money flow in the market.\n\nOld coins were moving, indicating that selling pressure might continue.\n\nEthereum [ETH] is challenged with replicating its performance in the last bull market, according to a recent report. Put together by 10x Research, the report stated that the project’s fundamentals have weakened.\n\nAs a result, Ethereum is preventing money from flowing into the market at a faster rate. For those unfamiliar, 10x Research is a crypto institutional research platform.\n\nAccording to them, ETH drove the 2020/2021 bull cycle. However, the fact that the altcoin has been lagging restricts the market from reaching its full potential.\n\nIs ETH dragging BTC and others back?\n\nThe firm also added that it expected Ethereum to drive adoption, but it has failed to do so. It does not end there. The report also mentioned that the correlation with Bitcoin [BTC] has also hindered BTC, noting that,\n\n“Surprisingly, BTC and ETH remain highly correlated, with an R-square of 95%. Ethereum’s weak fundamentals are becoming a roadblock for Bitcoin as they prevent broad fiat inflow into the crypto ecosystem.”\n\nETH’s price at press time was $3,128. And according to 10x Research, the $3,100 region was a crucial spot for the cryptocurrency.\n\nHowever, the chart shared by the platform suggested that the price could decrease and hit $2,600 if care is not taken. When AMBCrypto checked the validity of this conclusion, we found some solid grounds for it.\n\nThe traction stops, places the price in danger\n\nFirst off, we considered looking at Ethereum’s number of new addresses. According to data obtained from Glassnode, the number of Ethereum new addresses jumped to 196,620 on the 5th of May.\n\nThis metric tracks the number of unique addresses that participated in a transaction for the first time. However, at press time, that number had plunged to 125,008.\n\nThe inability to sustain this growth puts Ethereum in a dicey position. The same goes for the price of ETH.\n\nShould the number of these addresses continue to fall, then ETH could be in a pole position for a slide below $3,100 as predicted.\n\nMeanwhile, ETH’s one-day circulation has been decreasing since March. This implies that fewer coins have been engaged in transactions since then.\n\nTypically, this could be a sign of decreasing demand for the cryptocurrency. However, it also shows that the number of ETH set aside for selling could be low.\n\nAnother metric we looked at was the Mean Coin Age (MCA). Low values of the MCA indicate accumulation, and this could foreshadow higher prices in the future.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the 90-day MCA on Ethereum’s network skyrocketed to 45.83. This increase implies that long-term holders of the cryptocurrency are moving their coins.\n\nMovements like this suggest a potential to sell. As such, ETH’s recovery might remain on the sidelines as the price might continue to struggle."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNVS0zM3NCaHFYYU9ZYTN4WUxUN1laYzFYYjNPMTJZOERSRHNTU0xhU3FOdGkwTkVRa0VYcUItemo1eVZfLXh1amNhS0xnRVpBUF91QzNzVzJLdDZxUlVMQ2s5LXpQYXdGS213VTkzRFVqZXRNam5waFBvNFpBWXVtX0RVR19MZ9IBjgFBVV95cUxPbVNNdWhIOHpsUnQ0U2FuUEhDOGJ5Ukt6RGYxSWF4N2FWR0FzR19IdXN3SkNVOWhORFJKSFNGbGx1ZUtBRk5LZkg0RmdoSGRWMUY0bTltZUFCQ0F0aDZoa041dldPRXFzWWQ0QmEzSl9aS1JDWWRLbDcxMThOWTQ1UVNqbFJJSlpEZE8tWEZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Game ‘Fantasy Top‘ Now One of Crypto's Most Profitable Apps - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFantasy Top, a fantasy football-esque Ethereum NFT game that turns Crypto Twitter influencers into trading cards, has seen a surge in attention since launching just one week ago on layer-2 network Blast. In fact, it’s making so much money in fees and revenue that it’s now included in the same conversations that surround many leading blockchain networks.\n\nOver the last week, Fantasy Top has been the fifth most profitable crypto protocol, according to on-chain data tracked by DefiLlama, with $9.31 million worth of ETH. It earned by selling NFT card packs and taking a cut of trades via its secondary marketplace.\n\nOnly Bitcoin ($22.1 million), Ethereum ($21.6 million), liquid staking protocol Lido ($18.2 million), and decentralized exchange Uniswap ($15.9 million) generated more fee revenue during that span. And over the past 24 hours, Fantasy Top lands in seventh place with about $925,000 in revenue, with the Tron and Solana networks rising above for the daily tally.\n\nFantasy Top has quickly become a crypto industry sensation, particularly on Crypto Twitter—because it’s based on and built around the social media sphere. The game’s 120 unique “heroes,” which were turned into tradable NFTs on Ethereum layer-2 network Blast, are all based on notable industry traders, investors, analysts, and content creators.\n\nAD\n\nAD\n\nAs in fantasy sports games—and particularly NFT-based versions like soccer game Sorare—Fantasy Top players must create a lineup of their owned heroes, and then they’ll earn points based on the real-life Twitter (aka X) engagement of the influencers in question.\n\nMany of the in-game heroes in question have also been playing the game themselves, driving attention and spending in the process. And there’s good reason for them to: They’re being paid a cut of all pack sales and secondary market trading fees.\n\nLate Monday, the game paid out $1.25 million in Ethereum (ETH) split between heroes, as well as potentially millions of dollars worth of Blast Gold—points for the upcoming BLAST token airdrop. And that was from less than one week of play since the mainnet launch. That amount, of course, would come from the aforementioned revenue total.\n\nPreventing Bots and shortening the Main Competition 🏁 To safeguard Fantasy participants and uphold a meritocratic environment, we've decided, together with the heroes, to end the competition slightly ahead of schedule, preemptively thwarting any surge in malicious activities.… pic.twitter.com/BKp0rYL6Io — fantasy.top (@fantasy_top_) May 8, 2024\n\nAD\n\nAD\n\nHowever, the Fantasy Top rollout hasn’t come without challenges. On Wednesday, the game’s creators said they had prematurely ended the first in-game “Main Competition” that began Monday because heroes’ social media content engagement totals were manipulated and boosted—apparently due to automated bots.\n\nFantasy Top says it will share the results of the competition soon, along with details on how it plans to address botting issues in the future.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbVZzS1Zha21DY1RjNC04MTFqckdMR2RuWGRmRXY0WHYtc2dISEhQT2EzZFZrRE13V3RMNWtiWGd1UDVQMi1ydnZjVkktM3pVc3N1WHJHOVBMd0lSNjRQbDBZMDc1dFlXVDAxdkRmZ2NvRFl4T01iVXJPUldpQ1pUQU5wclF6aTNDdFh5Y2F2SFNHT1JPU1U4eFFiZmUyd0U0ZllnTG9zTlg0S3h1djNjcHhaYVZiVVlvbEVGZEFabGtuTDlkeGJqdE1GbU5GMEQ30gHWAUFVX3lxTE1yal90Q241Sm5xTHVlT1dkNzZONWVWa1Flb28yRmplZUZLN0dvTXp2R01XVzZnZGIyenhMZExoc05JR1M5RmVSYnRoRzI0UWw5S1JySF9rZ1hyR0ZwTERlZzhkaVQtSzFVUzRkbHU3MEFpS0JJNWpDbmRkQk1FMFZzaExDVi1KcUFGRjhWSHFkZkg0MWUtSWhFZUNaZU9XLV93R3NqWFJZZ1hpZFk3ak9FSy0yZHE4bzZGb2MzNDZOSjV1Vll3azFvR1h2ek56NERRcHhFY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Sexual Misconduct Allegations Lead Founder of Ethereum Layer-2 Chain 'Eclipse' to Step Back - CoinDesk",
        "content": "\"I'll be temporarily reducing my role as a public face for Eclipse,\" he wrote. \"The senior leaders at Eclipse are well equipped to take on these responsibilities and this will allow these conversations to unfold and the truth to emerge about these allegations.\""
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPU2ZuSGNFZlctUzloWWlSV3FKa0d6WFJ6bnk2N05ZUmV1Q3AwYXoxR3ZLenUzY3E3SzRETEZfQzRmZHQyWi0xd1lrMDdsZ1ozTDM2WExBUzNYN3QtckcxZFNlNWQteW8xak9KTGpXWGRJZWdIOXo4V1VqSUpFM056dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Grayscale CEO “Optimistic” on Spot Ethereum ETF - Markets Media",
        "content": "Daily Email Feature Grayscale CEO “Optimistic” on Spot Ethereum ETF\n\nMichael Sonnenshein, chief executive of Grayscale Investments, said the digital asset manager remains optimistic that the US Securities and Exchange Commission will approve spot ethereum exchange-traded funds.\n\nSonnenshein spoke at the Financial Times Crypto and Digital Assets Summit in London on 8 May.\n\nHe said: “We are just a couple of weeks away from seeing the SEC’s first thinking on spot ethereum products and we are optimistic that the SEC will do the right thing by investors.”\n\nIn April this year the firm filed with the SEC to convert its Grayscale Ethereum Trust, which is already an SEC reporting company, into a spot ETF. Last year the asset manager won a lawsuit against the SEC which challenged the decision by the regulator to deny approval of the conversion of the Grayscale Bitcoin Trust into an ETF, despite the regulator approving bitcoin futures ETFs.\n\nThe ruling said that in order to avoid arbitrariness and caprice, administrative adjudication must be consistent and predictable and follow the basic principle that similar cases should be treated similarly. The court said: “The Commission failed to adequately explain why it approved the listing of two bitcoin futures ETPs but not Grayscale’s proposed bitcoin ET. In the absence of a coherent explanation, this unlike regulatory treatment of like products is unlawful.”\n\nIn a similar fashion, the SEC has approved ethereum futures ETFs. Grayscale had also filed for an ethereum futures ETF, but this has recently been withdrawn as these products are already in the market.\n\n“At Grayscale we decided to focus our energy on our spot product which is core to our DNA of pioneering access to spot exposure for investors,” Sonnenshein added. “We can always revisit things in the future but that is where our energies are focused right now.”\n\nSpot bitcoin ETFs\n\nIn January this year the SEC approved the listing and trading of 10 spot bitcoin ETFs and also approved the conversion of the Grayscale Bitcoin Trust into an ETF (GBTC).\n\nSonnenshein said: “When I zoom out and think about our 10 years of work, spot ETFs are by far the most mainstream moment that bitcoin has ever had. We have seen announcements from major banks and legacy financial players publicly advancing their plans in the crypto space.”\n\nGrayscale’s spot bitcoin ETF had $28bn of assets when it came to market after converting from the trust, and Sonnenshein was challenged on the ETF’s net outflows of $17bn since January. Data provider Blockworks Research said in a report that the Grayscale ETF notched its first and second days of net inflows since its conversion on Friday 3 May ans Monday 6 May.\n\n“We have always believed that a rising tide will lift all boats and see the addition of legacy financial players as helping to boost the ecosystem,” he said. “We never believed that we would have 100% market share in perpetuity, and we certainly cannot be the only firm educating investors on the merits of allocating to crypto.”\n\nSonnenshein also argued that the trust was the highest returning publicly traded product in history, returning over 49,000%, so the firm expected profit taking. He continued that the ETF was reaching an equilibrium and starting to see some net inflows into the product over the last couple of days, so this is just the beginning of the Grayscale journey.\n\n💸 Latest data shows US Spot #Bitcoin ETFs with a total net inflow of $11.77B and a daily net outflow of $16M on 7 May. Blackrock’s IBIT saw zero net inflow and Grayscale’s GBTC resumed its net outflow of $29M after two days of net inflows. pic.twitter.com/EOYb1tJb7b — Crypto.com Research & Insights (@cryptocom_rni) May 8, 2024\n\nOutflows may also be related to Grayscale maintaining a 1.5% fee for its spot bitcoin ETF, while competitors have much lower fees of around 0.3%. Sonnenshein admitted that the fee war was faster and more furious than anticipated but said Grayscale has made a commitment to investors to lower fees, which the firm will evaluate over time.\n\nHe also argued that investors will buy the Grayscale ETF because the firm has been a specialist in digital assets since 2013, has leading research, a track record and liquidity, and that the fee is just one component when investors look at allocations. However, in March this year Grayscale filed with the SEC for a new spot bitcoin ETF, the Grayscale Bitcoin Mini Trust, which Sonnenshein said would come to market with an “industry leading low cost” fee, if approved.\n\nThe new ETF is in the form of a spot off in which shares of the Grayscale Bitcoin Mini Trust will be being distributed pro-rata to GBTC shareholders, so shareholders of both ETFs will end up with a lower blended average fee across the two products.\n\nHe expects the established large liquid GBTC ETF to be used as a capital markets allocation tool and trading vehicle. The mini trust has the same exposure but is more of a long term allocation tool, which Sonnenshein said is similar setup for many ETFs. In addition, he believes there will be a new base of investors in digital asset ETFs from the financial advisor and wealth management communities, once their platforms approve these products.\n\nBREAKING‼️ $430 BILLION asset manager Susquehanna International just reported owning +$1.2 BILLION #Bitcoin across 10 ETFs. This include +$1 BILLION in just Grayscale's Bitcoin ETF. Wall Street is hungry for Bitcoin… 🚀 pic.twitter.com/uzpjOlDUZw — Radar🚨 (@RadarHits) May 7, 2024\n\nCrypto sectors\n\nIn October last year the asset manager launched GrayscaleCrypto Sectors, a framework designed to organize the crypto asset class. The firm also announced a partnership with FTSE Russell, the index business of London Stock Exchange Group, to introduce the FTSE Grayscale Crypto Sector Index Series, a suite of five rules-based indices capturing the investable crypto market across five sectors – currencies, smart contract platforms; financials, consumer & culture; and utilities & services.\n\nSonnenshein described the development of crypto sectors as “really important”, which the firm is bringing to regulators and other constituents of the ecosystem so that it continues to grow.\n\n“There is a lot of confusion in how to understand the differentiation amongst the crypto asset class when you get beyond bitcoin and ether, so we have taken this sector-based approach which is tried and tested in traditional assets,” he said. “It has been a really effective tool for drawing more interest and excitement into the ecosystem.”\n\nHe said he is also excited about Grayscale Labs, which is incubating new product ideas, new exposures and their most appropriate product wrappers.\n\n“I think the Grayscale lawsuit and the fact that we remain one of the largest crypto asset managers has garnered the attention of other folks in our space as well as more traditional players, but there is no definitive or pending deal or anything of that nature,” he added."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQazVWWVdEb3JGenNCN09fdWVKU1JTTU11Vm9heUR4TGxQcmRkVGpoVnJfaUQtOE14ckNwOERTeWFGcFp3T3JpY01wRlA3Ykh5bkNyMTR4Q1RGNFdvNnlxY2xfX2RMeGxUcWxnTUVwV1paZmdZZnFPRUdZZXNrWkxDUnBOdFVUSnZKREZjOFl0TkZuMnNlUU40TDM0bFgwTEtLSC1HVVlsSjU5Qm5RT1FhWmR4ek5lTmwtV3hIdjJTOVQyZFNJc3JZU2lzQkpMOVJaeldvNkR4a9IB3AFBVV95cUxQSHBqN2lTRlEySlVmdEUyTWhpLUhFSmE0Z1lyQ3BuNUpCM01DbHVYVVg2RHc4OWRjT3Y4a3l1SzZINW9oY0tzdUhVU1c0LWFpUjFuZHUzRWpUR0g3V3ZORmNwMHRDM042VGw2S0FRalg0ZVBOMTBSYlZOdGo2S2xPaE9PYXRNcXU2VlY4MlJ4UWVmS3MxX1BkLUpxLVY2TnVySUlEb2ZQLVg4eHJJTE1YckwxdDQwR25TMlJQMGw5djdZS3Vyc3M4Vk94Uk1neENRdWwxVi1VaHB2bERX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Analyst Benjamin Cowen Warns Ethereum ‘Still Facing Headwinds,’ Says ETH Will Only Go Up if Bitcoin Does This - The Daily Hodl",
        "content": "The widely followed analyst Benjamin Cowen is saying that Ethereum (ETH) is at risk of facing more downside over the coming months.\n\nIn a new video, Cowen tells his 801,000 YouTube subscribers that monetary policy is likely to negatively affect Ethereum.\n\n“I think that ETH/USD is still facing some headwinds here, especially following the potential rejection of the spot exchange-traded fund (ETF)…\n\n…I think the impact that people are going to feel is just from tighter monetary policy. They’re going to blame it on the spot ETF and they’re going to capitulate potentially into that.”\n\nAccording to Cowen, the Ethereum could go up on one condition.\n\n“If ETH goes up from here, it would only be due to Bitcoin going up a lot more.”\n\nThe widely followed analyst says that the Ethereum/Bitcoin (ETH/BTC) pair, on the other hand, is likely to keep falling under most circumstances based on history.\n\n“So if Ethereum goes up, Ethereum/Bitcoin is probably going to keep going down. If Bitcoin goes sideways, Ethereum/Bitcoin is going to keep going down in my opinion. And if Bitcoin goes down, Ethereum/Bitcoin probably goes down because Bitcoin has been doing all s of things since 2022 began. In eight of 10 quarters, Ethereum/Bitcoin has gone down whether Bitcoin went up, down or sideways. Ethereum/Bitcoin generally went down.”\n\nETH is trading at $3,002 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPVHZfQXp2N3V4clcwTUZZQjM1a0ttUFdycHl1Q0Z0Q2FwTVQ0TWxPZUdTMk1CVS1CNXZKallBNVVJRkp0NVRHdC1aU1pTdksxbkV1RXZwc29Udy1rc1Y3dFp6ZDNIMlp3dkM1eWhGVkdGcTFJTTY0SElRUFNHYV9RQWtfWHMybTRBcXVzV2VSalBWMzhBRlQ5YUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Decoding Ethereum: A comprehensive guide to ETH pricing trends - Arizona Big Media",
        "content": "Ethereum, launched in 2015, is a prominent blockchain platform known for its versatility and native cryptocurrency, Ether (ETH). It is the second-largest digital currency by market capitalisation.\n\nEtheruem price has sparked significant interest due to its unique features, such as smart contracts that automate transactions and decentralised applications (dApps).\n\nUnderstanding Ethereum’s Price Factors\n\nSeveral key factors influence the cost of ETH. These include market demand, blockchain upgrades, regulatory news, and the broader economic environment. Each plays a crucial role in the fluctuating values seen on the market.\n\nMarket Demand\n\nThe demand for ETH is driven by its widespread use in dApps and initial coin offerings (ICOs). As more developers build on the blockchain network, demand for ETH increases, often leading to a rise in its cost.\n\nTechnological Advancements\n\nUpgrades to the ETH network, such as the switch from proof of work (PoW) to proof of stake (PoS) in its consensus mechanism, can significantly impact its value. These upgrades aim to enhance the network’s scalability, security, and sustainability, which can, in turn, affect investor confidence and market rates.\n\nRegulatory Influence\n\nRegulatory announcements or decisions impacting cryptocurrency, particularly in major markets like the USA, Australia or the European Union, can lead to volatility in Etheruem prices. Positive regulatory news can encourage investment, driving prices up, whereas negative news can have the opposite effect.\n\nEconomic Factors\n\nThe broader economic environment, including interest rates, inflation, and economic growth, also impacts the blockchain’s values. Some investors may treat ETH as a hedge against traditional financial markets during economic uncertainty, influencing its price dynamics.\n\nHistorical Pricing Trends of Ethereum\n\nLike many digital currencies, its cost history is marked by volatility. From modest beginnings, its value saw a significant surge in 2017 during the cryptocurrency boom, followed by substantial fluctuations in subsequent years.\n\nSignificant Milestones\n\n2017 Bull Run: The blockchain reached new highs as cryptocurrencies captured public attention.\n\nThe blockchain reached new highs as cryptocurrencies captured public attention. 2018 Correction: Following the boom, its value corrected sharply as the market cooled.\n\nFollowing the boom, its value corrected sharply as the market cooled. 2020-2021 Surge: Driven by the DeFi (Decentralised Finance) explosion and the anticipation of Ethereum 2.0, the rate soared once again.\n\nAnalysing these trends helps understand the cyclical nature of cryptocurrency rates and prepares stakeholders for potential future movements.\n\nCurrent Trends and Future Projections\n\nETH continues to evolve, especially with the gradual implementation of Ethereum 2.0, which aims to address issues related to scalability, security, and sustainability. Monitoring current trends is essential for those interested in ETH’s future price movements.\n\nFactors to Watch\n\nAdoption of DeFi: The growing DeFi sector primarily operates on the network and is a critical driver of demand for ETH.\n\nThe growing DeFi sector primarily operates on the network and is a critical driver of demand for ETH. Network Upgrades: The final rollout of Ethereum 2.0 could be a turning point for ETH’s market valuation.\n\nThe final rollout of Ethereum 2.0 could be a turning point for ETH’s market valuation. Institutional Investment: Increasing interest from institutional investors can provide more stability and growth in the blockchain’s value.\n\nStrategies for Monitoring Prices\n\nFor investors and enthusiasts looking to keep a close eye on its price movements, several strategies can be effective:\n\nUtilising Technical Analysis\n\nTechnical analysis requires studying past market data, primarily price and volume, to predict future value movements. This can be particularly helpful in the highly volatile crypto markets.\n\nKeeping Abreast of News\n\nStaying updated with the latest technological developments, regulations, and the global economy can provide insights into potential price movements.\n\nEngaging with the Community\n\nThe Ethereum community is active and often at the forefront of discussing and disseminating critical information. Engaging with group forums and social media can provide early insights into shifting trends.\n\nEthereum remains a dynamic and influential cryptocurrency, with various factors influencing its pricing trends. By understanding these elements and monitoring ongoing developments, individuals and venture capitalists can make more informed decisions regarding their engagement with them. As the landscape evolves with technological advancements and regulatory changes, keeping an informed eye on Ethereum will remain crucial for anyone involved in crypto."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQVDkyX3dyQTY4d3R6bm96OWJLcmRNaHRrWDhUejROTnNBLTlSbGZ6Ulp5R2tPQ0tOUDlZVTh6dFBzd1lpQ283cTJSX3F3aFRCcmZ4SWJkcjJXYVF1aGc2ZG9vSVVEendvNUg3Rkd1MHZERHhpQmhzX3JKZ3ZGNEI5MXVCOHdOUVRYSUxvUGJWSdIBlAFBVV95cUxOd1lkSlBOdEY4RmF5RG5paWE4N2d5aXNNUzk2WlVwRXd0enVzX2lVNDI0aE56WXVtcXpDNXE4aEdPZmE3MExQeFRXSkFVaVdLVUxVUGdyOU1zQjV2NC1ubGdCNGktYzY5U0pJSWNRY0lXYWRhYTdYdWNfYUM2d1lBRVQzOGVGaWFrN29hX2RUTDVjbnhq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum sees $30M inflows after weeks – This is the key reason why - AMBCrypto News",
        "content": "Investments worth $30 million were allocated to Ethereum products.\n\nBitcoin registered outflows, but ETH’s price might drop.\n\nFor the fourth consecutive week, digital asset investment products recorded more outflows than inflows. Coinshares, the leading asset manager, made this known in a post dated the 7th of May.\n\nIn total, the outflows were worth $251 million with Bitcoin [BTC] accounting for $284 million. However, Ethereum [ETH] was able to reduce that number after it registered inflows worth $30 million.\n\nETH comes out from the shadows\n\nThis was the first time in seven weeks that Ethereum had inflows. However, AMBCrypto observed that the launch of Bitcoin and Ethereum spot ETFs in Hong Kong last week was responsible for the increase.\n\nCoinShares also agreed, highlighting that,\n\n“The bright spot last week was the successful launch of spot-based Bitcoin and Ethereum ETFs in Hong Kong, which saw US$307m inflows in the first week of trading.”\n\nAnother reason could be linked to the anticipated decision of the U.S. whether to approve the Ethereum ETF applications or not.\n\nIn previous articles, AMBCrypto had reported how some experts expressed skepticism about the approvals.\n\nHowever, there were a few who displayed optimism that the filing would get the green light. In the week before the last, we had mentioned how Litecoin [LTC] and Chainlink [LINK] led the inflows.\n\nBut last week, these altcoins could not find favor in the eyes of investors. For Ethereum, an approval could save ETH from its depressing phase.\n\nOn the other hand, rejection could trigger another wave of correction for the cryptocurrency. At press time, ETH changed hands at $3,067.\n\nThe coast is not clear\n\nFurthermore, there have been predictions that the price might slide again. If validated, a decline to $2,800 could happen, as it did a few weeks back.\n\nNonetheless, there are some traders whose target is a return above $4,000. To ascertain the potential of these forecasts, we looked at the Market Value to Realized Value (MVRV) ratio.\n\nThe MVRV ratio measures the profitability status of holders. With this metric, one can tell if a cryptocurrency is undervalued, at fair value, or overvalued.\n\nAt press time, Ethereum’s 30-day MVRV ratio was -3.447%. This means that holders would generate an average of a -3% loss if they all decide to sell at the current value.\n\nBut most would not do this. However, this might not be a good accumulation point, despite the negative reading. Historically, great buying opportunities appear when the metric is between -7% and -18%.\n\nTherefore, those keeping an eye on ETH, and waiting for good entries, might need to wait a little longer.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nRegardless of the entry region, ETH would need an intense level of buying pressure to start rewarding the positions.\n\nFor now, it is uncertain when that will happen. However, market participants are hopeful that Ethereum’s time to shine might not be far away."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPdWgxQzZNc0oyRlVlSmRHbWF4LVR3NmpWZ29XWGJBNTZBSVFlNUxhSnpzcTFnaWpvRlZoWUlCWlByWnpBR0lCWUprTnlQVTlkV2MtUVJpZ1gxMFBkUTdqbWNmZWlzNDdTVDl1UnJYa0M1MXhqVzJHTHBUN2d3cjZuaENibVRpWUluNjhQRS13Rm5kcUFnUFNOeEI4X3BxbVdUSEgtTVZLbmU0N2t2bDU0bjNqLWpwN3pZTmNCdjc4d2thYlBXVEdTcTFlcnN4ZW_SAdQBQVVfeXFMT2ZFLWR3ZUJRYWZUYmd0QjNUVDMtR1BvLUFHR1VBNzRSZkV4dEs5TzBzRmt2MnJpaDZ2NE55eERwOGFpdTdfVUFsNWNpX0hYR3FHUEJoRzdrR29XVFdRZE1lQVB0di1yQS1uQmpZUFBwYVNtamlYOC0xczN0WUhxeFBpNHdyVjhHOC1mVFJZcFRsNjc1Q3lvckt2T01aSTZxU3FTMkhURHB1S3o0dnZEWWJKZWhVeWxpTUVyMVFfZmJxX01vODlBR0RiX1BQUFJnYjVhR1Y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum-Based Altcoin Leads Real-World Assets Sector in Development Activity, According to Santiment - The Daily Hodl",
        "content": "Blockchain analytics platform Santiment says one Ethereum (ETH)-based altcoin project is leading in the real-world asset (RWA) sector based on development activity.\n\nSantiment says that blockchain oracle Chainlink (LINK) is seeing the greatest amount of daily activity on the development hosting platform GitHub.\n\nLINK Is seeing more than two times the amount of development activity compared to the second most active blockchain project, Synthetix (SNX), a decentralized finance (DeFi) crypto that allows synthetic asset creation on Ethereum.\n\n“Here are crypto’s top real-world assets by development. This list is compiled by counting any non-redundant GitHub activity, and averaging this daily activity over the past 30 days. Chainlink currently produces 2.49x more daily activity than the next most active project, Synthetix, in the RWA sector.”\n\nSantiment’s ranking list is as follows: 1. Chainlink 2. Synthetix.io 3. Centrifuge (CFG) 4. Dusk (DUSK) 5. Oraichain (ORAI) 6. Creditcoin (CTC) 7. IX Swap (IXS) 8. Maker (MKR) 9. Polymesh Network (POLYX) 10. Reserve Rights (RSR).\n\nSantiment also says that the native asset of decentralized oracle protocol Tellor (TRB) is outperforming most other digital assets so far this month.\n\n“Tellor is one of the top performing assets thus far in May, exactly doubling in market cap since the calendar month turned. Whale transactions and address activity have both seen sudden spikes, which are suggesting potential TRB profit takes.”\n\nTellor is trading for $111.64 at time of writing, up 16% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNRzhHMVQwY0c4RWJZcHlrdFRqbXExLWgyZkp3b1A3RmZUbEpBcWlLbG9Zck1YRnpXSHNBazZMU2RFcmpGZ19VcGVmd3FuQkZFQ1BBRG5fanZOanlpS1JFTGtJZFIxY0FJblJNbkpReURJSFN5N0pwOEVuUVlpeGNyYmJmUGlMZ2pLWXQ5RTJjckZ4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Solana could surpass Ethereum in transaction fees - The Cryptonomist",
        "content": "In a turn that could rewrite the current dynamics of the world of cryptocurrencies, Solana seems poised to surpass Ethereum in terms of transaction fees within the next week.\n\nThis event, if it were to occur, would not only strengthen Solana’s positioning in the sector, but could also further solidify its label as an “Ethereum-killer”, despite the technical challenges and network interruptions it has recently faced.\n\nCurrent context between Ethereum and Solana for transaction fees\n\nEthereum, long considered the undisputed leader in decentralized applications and decentralized finance (DeFi), is known for its high transaction fees, especially during network usage peaks.\n\nThis has led many developers and users to seek cheaper and more efficient alternatives, a niche in which Solana has begun to stand out thanks to its promise of speed and significantly lower transaction costs.\n\nSolana has made its way in the field of blockchain with the promise of processing up to 65,000 transactions per second, compared to a capacity of Ethereum which currently revolves around 30 transactions per second.\n\nThis performance is supported by a unique consensus model, known as Proof of History (PoH), which works in tandem with the Proof of Stake (PoS) mechanism to optimize efficiency and reduce costs.\n\nDespite these advanced technical features, Solana has faced numerous network interruptions, raising doubts about its long-term reliability and scalability.\n\nThese technical issues have temporarily hindered its growth and have shaken the confidence of some investors and users. However, recent improvements and updates to the network aim to solve these problems, restoring confidence in the platform.\n\nImpact of reduced transaction fees\n\nIf Solana were to surpass Ethereum in terms of transaction fees, it could attract a significantly larger number of developers and projects.\n\nThis shift would not only increase the volume of transactions on the Solana network, but could also positively influence the value of its native token, SOL.\n\nFurthermore, a reduction in fees could further democratize access to DeFi applications, making them available to a wider audience that may currently be discouraged by high fees on Ethereum.\n\nSurpassing Ethereum will not be an easy task for Solana, given Ethereum’s vast user base and its extremely active developer community.\n\nFurthermore, the upcoming update of Ethereum, known as Ethereum 2.0, aims to solve many of its current issues related to scalability and transaction costs.\n\nHowever, temporary success in terms of lower transaction fees could give Solana the necessary advantage to solidify its position as a credible alternative to Ethereum in the long term.\n\nConclusion\n\nIn conclusion, Solana’s potential superiority over Ethereum in terms of transaction fees represents a significant turning point. If Solana manages to maintain lower transaction costs, it could not only attract a new wave of developers and users, but also consolidate its position as a valid alternative to Ethereum.\n\nThis evolution highlights the continuous innovation in the field of blockchain and the need for existing platforms to adapt in order to remain competitive. However, the success of Solana will depend on its ability to overcome past technical challenges and build a stable and secure network.\n\nIn a market that rewards both innovation and technical robustness, Solana has the opportunity to redefine the cryptocurrency landscape and demonstrate its value as a potential “Ethereum-killer” in the long term."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQOXJ0cGZBSnozTkZaWmU3Y0dzaVdUb1Z4ZjQteDdMbjRqSnVJMm5GbGRtRnlheS1DWXVaNDZHM3AtMnlVcGdyZWF2bk9Vb0VfSDBmb1Y4UjVxTkt2YldTa0VlRWEtMGF0dThMU0c4THBJaUFlTnhtckZXU3dONlFXSHVWbzd0R0JfYnVOStIBlAFBVV95cUxNN3BraHhyLXFvUHQzTjZBT3ROSmxPdENiNllXNHRvVk5OUmNvcW1FeHltWHFzQmlXNHhjNHV5Ym5YaDZFXzBPOXJtZTUtaEhfWFJzV1VfRlVOSG9wc3ZZSVJSSVFzdzMxLXoxUU5mRldCS0JOc0xiM1JWZklnNy01TnBrZU4zR1ZrSTJQcVBFNTVZdTFl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum Co-Founder Joe Lubin: SEC Wants to Create 'FUD', Push Crypto Offshore - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Joe Lubin has argued that the U.S. Securities and Exchange Commission's recent series of enforcement actions directed at crypto firms is \"intended to create FUD\"—that is, \"fear, uncertainty, and doubt\"—in the industry.\n\nSpeaking at the Financial Times Crypto and Digital Assets Summit, Lubin, whose firm Consensys recently revealed that it was sent a Wells Notice by the regulator, called its action \"an attempt to paralyze us, or have us move off-shore.\"\n\nThe regulator had, Lubin claimed, reclassified Ethereum as a security, \"without really telling anybody that that's the case.\" He added that Consensys' filing of a preemptive suit against the SEC is \"about getting clarity from U.S. courts,\" to establish that Ethereum is a commodity, \"as many in the SEC and the CFTC have been stating for years.\"\n\nOver the past year, the SEC has launched a series of enforcement actions targeting crypto firms including Coinbase and Binance. The regulator has also sent Wells Notices warning of impending enforcement action to firms including Consensys (disclosure: which is one of 22 investors in Decrypt), Robinhood and Uniswap Labs.\n\nAD\n\nAD\n\nAs part of those actions, Lubin said, the SEC has claimed that crypto wallets such as MetaMask are acting like broker dealers, which he called \"a preposterous notion,\" questioning whether Consensys or individual users should register the \"piece of software that anybody can download and run on their own\" as such.\n\nThe regulator had also made what Lubin called the \"bizarre\" claim that Consensys is helping firms such as Lido and Rocket Pool issue securities by providing \"access to some decentralized finance protocols on Ethereum.\"\n\nLubin added that the SEC is currently inspecting the GitHubs of software developers who are \"building out the deeper layers of the protocol,\" rather than being engaged in financial matters—an action he called \"chilling for software developers.\"\n\nThe SEC and Ethereum ETFs\n\nHe also pointed to the \"interesting\" timing of the SEC's actions, ahead of the regulator's May 23 deadline for approving or denying applications for a U.S. spot Ethereum ETF. Lubin suggested that the regulator was engaging in a \"flurry of activity designed to enable them to say that their action wasn't capricious,\" in the \"likely event\" that it denies the approval of spot Ethereum ETFs.\n\nAD\n\nAD\n\nThe Consensys founder argued that the SEC \"probably doesn't want to see a wave of innovation\" in the financial landscape resulting from the approval of spot Ethereum ETFs, and the prospect that \"many of the banking industry's customers will move their assets into digital form\" and DeFi applications.\n\n\"That'll be really uncomfortable for certain factions in the U.S. who would prefer to slow it down or shut it down,\" he said.\n\nNevertheless, Lubin remained optimistic at the prospects of a spot Ethereum ETF eventually being approved, pointing to an \"inflection point\" in 2025, \"when the courts force the SEC to approve the spot ETFs.\"\n\nEdited by Andrew Hayward"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNQndLcHFFZEViUHJhOUNWN2hDV2duRmhnVm1kYjFTaUJfcU5pcVJCaGN2Wk1NRlFXY2tzcXI4S0hCUnJSaF81eE9jQ1RBVXJuRGdnVHhoLTRXZnJMTkowOTNhbzRhRkNfWUQ3X3lpTkdITmZINHNBdmtPR0RmQXpwS0ljajloYVZZbEFMZzg4LXczTnZRTEVFbjU3eTdtcEY1U0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Falls Below $3,000 Support Level – Will It Recover Soon? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nThe broader crypto market has been on a steady downward trend since May 6, with the price of most assets dropping significantly. Ethereum fell from a high of $3217 to $2936 on May 8, 2024, marking an 8% price decline.\n\nEthereum is hovering around $2,984, down by 1% in the last 24 hours, its trading volume is $10.9 billion.\n\nThe prevailing downtrend has cast doubts and uncertainty about Ethereum’s trajectory in the coming days. Will the bulls return to trigger a rebound? Read on to find out.\n\nEthereum Price Analysis: Bearish Momentum Strengthens, Investors Urged to Exercise Caution\n\nEthereum is currently in a bearish trend, with several technical indicators signaling further downward pressure.\n\nEther has slipped to the lower band of the Bollinger Bands indicator, suggesting oversold conditions and further price declines. This could deter investors and traders from buying in until clearer signals emerge.\n\nThe Moving Average Convergence Divergence (MACD) is below the signal line, indicating a bearish trend continuation. This reinforces Ethereum’s negative sentiment and may prompt cautious behavior among investors.\n\nFurthermore, the SuperTrend indicator displays a sell signal, indicating that sellers are in control and may remain so in the near term.\n\nThe Relative Strength Index (RSI) is 38, signaling that Ethereum is currently oversold. However, this does not necessarily indicate an immediate reversal in price, and investors should exercise caution when considering entry points.\n\nOverall, Ethereum’s technical indicators paint a highly bearish picture, with multiple signals pointing to further downside potential.\n\nInvestors looking to enter the market may wait for the price to break above the previous $3,059 support level, which has now become a resistance. A break above this level will confirm a strong bullish momentum.\n\nHowever, given the unpredictable nature of the crypto market, traders should trade with caution and implement risk management strategies to protect their investments.\n\nGrayscale’s Withdraw ETF Fillings: What It Means for Ethereum Investors?\n\nGrayscale, a major crypto asset manager, has pulled back its filing for an Ethereum futures exchange-traded fund (ETF). These moves surprised analysts like James Seyffart, who called it a “Trojan horse” tactic.\n\nUPDATE This is interesting. @Grayscale just withdrew their 19b-4 filing for an #Ethereum futures ETF. This was essentially a trojan horse filing in my view, in order to create the same circumstances that allowed Grayscale to win the $GBTC lawsuit (approve futures deny spot) pic.twitter.com/Kihj2dlQx1 — James Seyffart (@JSeyff) May 7, 2024\n\nIn the analyst’s words: “In my mind, might as well make the SEC write up an approval or denial for an ETH futures ETF and go from there?” He suggests a discussion between the SEC and Grayscale must have prompted the withdrawal.\n\nNate Geraci, another analyst, said last month that there’s a possibility that the SEC will not approve the ETH ETF. He predicted that if the SEC rejects Grayscale’s Ethereum ETF application, they might take legal action again.\n\nHowever, in a recent X thread, Bloomberg’s senior ETF analyst, Eric Balchunas, sees this withdrawal as a positive sign. He thinks Grayscale might not sue the SEC again.\n\nGrayscale’s latest move could positively affect Ethereum’s price, as it shows its commitment to working with regulators rather than engaging in legal battles.\n\nWhile the price of Ethereum is still down, investors might want to consider this low-cap project, which is trending in the market.\n\nDogeverse ($DOGEVERSE) At Over $13 Million – Ape In Early For Massive Gains\n\nThe Doge-inspired meme coin, Dogeverse, has seen remarkable success since its inception, echoing the enthusiasm once ignited by Dogecoin. Dogeverse aims to unite the crypto meme community and pioneer multichain utility development.\n\nFrom its presale phase, Dogeverse quickly captivated the attention of the meme coin industry, garnering significant interest with its reasonable pricing point. The presale has raised over $13 million and is rapidly winding down as May progresses, reflecting the project’s appeal among investors.\n\nThe presale’s concluding discount price of $0.00031 shows that the project is affordable. Interestingly, this low rate could attract even more investors in its final stages.\n\nWhy DOGEVERSE Looks Promising to Investors and Enthusiasts\n\nDogeverse stands at the forefront of the cryptocurrency market, poised to revolutionize the meme coin landscape with its multichain capabilities. Its allure lies in the adoption of multichain technology facilitated by Wormhole and Portal Bridge technologies.\n\nBy transcending the limitations of a single blockchain, Dogeverse offers unparalleled speed and convenience. The project also empowers users to navigate across chains seamlessly. This strategic move not only enhances user experience but also expands Dogeverse’s potential user base exponentially.\n\nThe decision to commence on Ethereum is a solid foundation for the project’s multichain growth strategy. Ethereum’s widespread adoption and robust security features make it the ideal platform for such an ambitious endeavor.\n\nRaising over $13 million in a matter of weeks, it has captured the attention of both seasoned investors and newcomers. This remarkable achievement attests to the widespread anticipation surrounding Dogeverse.\n\nMoreover, as the Bitcoin Halving concludes, meme coins are poised for exponential growth, making Dogeverse’s arrival timely and strategic.\n\nBy integrating features from top-performing meme coins across various chains, such as DEGEN and BRETT, Dogeverse ensures its relevance and competitiveness in a rapidly evolving market landscape.\n\nSecure a Spot – Buy Dogeverse Today\n\nVisit the website and connect your preferred wallet using the options provided. Choose the network you want to participate in the presale on – options include Ethereum, Solana, BNB Chain, Polygon, Avalanche, or Base. Type the amount of ETH, SOL, BNB, MATIC, AVAX, USDT, or USDC you want to exchange for $DOGEVERSE. After the presale ends, use the same wallet and network you used to buy to claim your $DOGEVERSE tokens\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOWEhDdzl1ZUJMYkRFaWJUZU9mdXUtUkxTNHRiWUlHMmNqdGJtOE4xY0FVbWt5TFp1MU5KT2t1WmpjQ1l3N3JVQU9XZ2FoS1NXZDI2OHdvcmlXM19VNVdueTBTY3J3ZVY4dzNET09FckwzNUF2ZENqWTltSHIxNlZSWi1KV0dfbjdkMzFTcmxGa0RFODNNbUN5V0hhVGllbWlpTjhRb0Z3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Hodl Law Challenges Unclear Ethereum Regulations in Court Appeal - Crypto Times",
        "content": "Hodl Law is currently appealing the dismissal of its suit with the SEC. The matter revolves around the question of whether Ethereum, the world’s second-largest blockchain platform and its native currency named Ether, ought to be regarded as secure.\n\nAccording to HODL Law, the SEC’s failure to provide unambiguous regulations on cryptocurrencies is not only affecting businesses but also poses a great threat to the growth of the industry. They seek to obtain the court orders that call for the claim that ether transactions are not within the purview of securities laws.\n\nLook ma, we made it! The 9th Cir is not required to have an oral argument but I guess something about the way @SECgov has been acting caught its attention. Will be livestreamed!@digitalassetbuy @scottmelker @MetaLawMan @JohnEDeaton1 @attorneyjeremy1 @Belisarius2020 @twobitidiot https://t.co/BiT8BQSwpE — Fred Rispoli (@freddyriz) May 7, 2024\n\nThe SEC first dismissed the original lawsuit against Hodl Law because it had no actual proof of any harm done. According to the SEC, the pleas of Hodl Law of uncertainties regarding future enforcement is nothing but speculation, and so a lawsuit is unwarranted.\n\nThe Court of appeal of 9th circuit will be presiding over this case on July 18, 2024. This case means a lot in the whole digital currency field as the SEC launched a wave of disputes against other crypto firms recently."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM21obXJTTUYxWkZ0dEtjWHk1Tlc3bXRRdnpFZXozT1JvTXRraVIyQ3hwTzB0THEwYy1YbGhJMnZNWWNfQUwwNlZCU185SEpOQVBiMjR3U1JVazhmT0Nyc01xSnhaVGVjc21xMlJEa0JmRmdDcHVycHl4M1pCcnJ6dm1FeXFsN0Q5bUpDQjAwU1BPR1kzMkVCUXlnNDNORGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes EIP-7702: a revolution for Ethereum - The Cryptonomist",
        "content": "Vitalik Buterin, the visionary co-founder of Ethereum, together with co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett, has recently presented a revolutionary proposal: the EIP-7702.\n\nThis proposal aims to enhance the concept of “account abstraction” on Ethereum, introducing new flexibility and potential to externally owned accounts (EOA), such as regular wallets, allowing them to temporarily take on the functions of a smart contract during a transaction.\n\nWhat is EIP-7702? The proposal by Ethereum co-founder Vitalik Buterin\n\nThe EIP-7702, or Ethereum Improvement Proposal 7702, is a technical proposal that aims to extend the capabilities of externally owned accounts on Ethereum, allowing them to behave like smart contracts.\n\nNormally, EOAs are simple wallets that can send and receive funds, but cannot execute arbitrary code like smart contracts.\n\nHowever, with the introduction of EIP-7702, these accounts will be able to temporarily activate smart contract capabilities to perform complex operations, and then return to their original state once the transaction is completed.\n\nThe need for such innovation stems from the current limitations of EOAs, which cannot directly participate in more complex transactions without the intermediation of a smart contract.\n\nThis not only complicates some operations but also limits the possibilities of automation and customization for Ethereum users. With EIP-7702, users will be able to take advantage of the flexibility of smart contracts while maintaining the simplicity and security of a normal wallet.\n\nThe mechanism proposed in EIP-7702 provides that an EOA can temporarily activate a set of functionalities typical of a smart contract, such as the execution of specific code, at the time of the transaction.\n\nThis process is possible thanks to a modification of the Ethereum Virtual Machine (EVM) that recognizes and treats these “enhanced” EOAs for the necessary duration. Once the transaction has been executed, the account returns to its original EOA state, ensuring security and stability.\n\nI benefits:\n\nGreater Flexibility: Users can customize their transactions tailored to specific needs, without the need to interact with external smart contracts. Gas Efficiency: Reducing the need for intermediary smart contracts can result in a significant reduction in gas costs, essential for large-scale operations. Usability: By maintaining the basic structure of EOAs, users will enjoy a less complicated and more direct user experience.\n\nThe future of Account Abstraction and its economic implications\n\nOne of the most promising aspects of EIP-7702 is its potential ability to transform the economy of smart contracts on Ethereum.\n\nCurrently, the creation and maintenance of smart contracts require significant resources, both in terms of development and execution costs, mainly due to gas consumption.\n\nButerin’s proposal could simplify this process, reducing the need for multiple contracts for operations that a user wants to perform repeatedly, thus lowering overall costs and making blockchain technology more accessible to a wider audience.\n\nThis increased accessibility could have direct repercussions on the adoption rate of Ethereum. With lower entry barriers, more companies and individuals could be incentivized to explore and adopt Ethereum-based solutions.\n\nFurthermore, the adoption of such proposal could stimulate a new wave of innovations in sectors such as gaming, digital art, and digital asset management, where the need for complex and personalized interactions is particularly felt.\n\nThe issue of security is central in the debate on EIP-7702. Increasing the complexity of EOAs could trigger new security risks that must be carefully addressed.\n\nThe Ethereum community will need to work together to develop new security protocols that can adequately protect enhanced accounts against malicious attacks, while at the same time preserving the fluidity and efficiency of transactions.\n\nFurthermore, the introduction of EIP-7702 could require a review of Ethereum’s governance regulations, as the current framework may not be fully equipped to handle the changing dynamics of accounts and their interactions.\n\nActive participation of the community, through improvement proposals and voting, will be essential to ensure that the changes not only enhance the technology, but also reflect the values and needs of Ethereum users.\n\nPossible Implications of Vitalik Buterin’s Choice on EIP-7702 on Ethereum\n\nIf implemented, EIP-7702 could lead to a significant evolution of decentralized applications (DApps) on Ethereum, making the platform even more attractive for developers and end users.\n\nThe ease with which accounts can be adapted for specific functions could also stimulate innovation in areas such as decentralized finance (DeFi) and digital identity.\n\nDespite the numerous advantages, the EIP-7702 presents some challenges, especially regarding security.\n\nThe increase in functionality of EOAs could potentially expose them to new attack vectors. Therefore, it will be essential to implement robust security measures to protect users and maintain the integrity of the Ethereum network.\n\nThe EIP-7702 represents a significant step forward in the attempt to make Ethereum a more accessible and powerful platform. Although there are challenges to overcome, the potential for significant improvements in transaction management and interaction with the blockchain is evident.\n\nOver the next few months, the Ethereum community will have the opportunity to evaluate, discuss, and potentially adopt this proposal, continuing to push the boundaries of what is possible with blockchain technology."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNM1RfRWwwbDFKZEZEQU5JbHlIUHFHaU9XZ2VBaDQ5MXd1cmkyMVhYSVN4cnh5U0RqX1M5NDBYQ25JZ1lPNTVIM0M2TzBicmRVeGZmUnB2WVJGNEQ1clpoMHhmTDVFbHJmTnVSRkdNM3p1ODUyWjU5NjBrZXY5WjZhUW9Gb19XN3J2TDV30gGQAUFVX3lxTFBNMEJRNEJyUlh6dEt6SXVZV3hkVkNkLU1FdGhkcGpjOTBaRjMxdkhINzM1Z05oVmU3ZmFYNkRUSm9LZnMyc19hVmkyUEpWSnlUbXVCVHJ4RGRsUnpLOTJVcUhLdmQ3QkVBT2JyVFBENUtnS1RtTVhnSjg1bWNVeWhkRTdDbVA4TkRIUDdmYkZObA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Allegedly Dumps 1,000 ETH: Will Price Drop Follow? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe recent series of transfers by the Ethereum Foundation to the multisign address \"0xbc9\" has caught the attention of market observers, sparking concerns about potential volatility in Ethereum's price.\n\nAdvertisement\n\nIn the latest transaction reported by Spot On Chain, the foundation moved 1,000 ETH, valued at $3 million, to the aforementioned address. This action is part of a larger trend, as the foundation has already transferred a total of 5,000 ETH to the same address since the beginning of 2024.\n\nWhat is notable about these transfers is their potential impact on the market. Analysis reveals that a considerable portion of the previously transferred ETH — 1,766 ETH — has been promptly sold for 4.81 million DAI, averaging $2,725 per ETH. Interestingly, these sales often coincide with a decline in Ethereum's price.\n\nAdvertisement\n\nIndeed, historical data indicates a correlation between the Ethereum Foundation's sell-offs and downward pressure on ETH's price. With the multisign address \"0xbc9\" currently holding 2,508 ETH, equivalent to $7.51 million, market participants are cautious about the implications for Ethereum's value.\n\nETH to USD by CoinMarketCap\n\nThe current market environment adds to the apprehension, with Ethereum trading below $3,000 per coin and struggling to breach the $3,300 resistance level. As a result, there is speculation about whether the foundation's actions could exacerbate the downward trend, potentially leading to a drop in ETH's price to $2,400.\n\nAs the crypto community braces for what lies ahead, all eyes remain glued to Ethereum's price chart, awaiting clues about the next move of the main altcoin."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOaG96MDdmUWFmUEN3VXBQeGE0WmZzR3hTWk5wM2RkSS03TTN2ZldnOXpOT1V1dGJ5Tks1bGpDcERKcVFQenBTSGN4aDlRY2dKeWJZOVplT1BOMDl1bDYwZUIzdUg1SWZwTXFmZ3lZS3VfcTMyTDNnNk5sQXZmNTl5REtnSkpGVG5jOEh4SGNHM0FrRDEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana to Flip Ethereum in Transaction Fees as Soon as This Week - Watcher Guru",
        "content": "Once dubbed the ‘Ethereum Killer,” the Solana network is poised to surpass the famed blockchain network in transaction fees as soon as this week. Indeed, Blockworks senior research analyst Dan Smith discussed the potential flip that is just on the horizon.\n\nSuch a development would return Solana to its once-heralded position as a network most likely to dethrone Ethereum. Ongoing outage issues had called the network crowning into question. However, its performances throughout 2024 provide hope that it will meet those expectations.\n\nSource: Blockworks\n\nAlso Read: 3 Solana Based Meme Coins To Watch This Week\n\nSolana Flip Ethereum in Fees as it Continues Strong 2024\n\nJust five months into the year, Solana has proven to be one of the biggest stories in the digital asset market. In March, it was the home network for a plethora of surging meme coins. Indeed, the industry’s meme coin mania was driven by Solana-based newcomers like Dogwifhat (WIF) and Book of Meme (BOME).\n\nThose performances had seen the network become the market leader in monthly DEX volume. Moreover, Solana could be set to flip Ethereum once again, this time in transaction fees, which will take place as soon as this week.\n\nSpecifically, Blockworks researcher Dan Smith predicted Solana would flip Ethereum in both “transaction fees [and] captured MEV this month,” while noting it could happen this week. Captured MEVs are profits that are captured through arbitrage trading.\n\nSolana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week — Dan Smith (@smyyguy) May 7, 2024\n\nAlso Read: Solana: Here’s When SOL Can Reclaim Its All-time High of $250\n\nAccording to Smith, Solana’s total economic value has reached $2.8 million as of Tuesday. Alternatively, Ethereum had seen a total economic value of $3.1 million on the same day. Subsequently, the tightness of the two network races is clearly continuing to sort itself out.\n\nConversely, the daily transaction fee battle is still clearly held by Ethereum. The network generated more than $2.75 million in the last 24 hours, outpacing Solana’s $1.49 million, according to DeFiLlama.\n\nSolana has still proven its worth throughout this year. Its native token has also performed well, with the asset increasing more than 20% over the last seven days alone. Indeed, Solana (SOL) and its network are expected to continue their positive performances throughout the year."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQMTRqdDlBcDVxdm1GUDhDWEREeHZWeklrbXNKeEFMdHJteU91NG5MVlpBOXBCTTh3T29FX2RVc0tQY1NJdGgxbFBlMVMxOWg5TWxLSVdoNllEWW9tejZ0Z3NGRnRFUE5UQXJzZ1gwT2JvMmtxWHhKSk9NWl81bEVZLWpxenXSAYoBQVVfeXFMTWNjZlpoR19sR2FhNjdXS2ZoVGluMEw1d3R5RzZ0UmJ0dlpuR2NwajQyMFROTHEzc0RYX3JhVEozYVc3TnVvWGNCZ1dhZjJyNnh6dkR3Ujd1NHc1U0RlNjlUUVNLb0hmRWpReDVfMV9fLTlUN3ZJdzBtenhwZ1c3WHJYS1I5Q3JuLWN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Why Ethereum traders are starting to bet big against ETH’s price - AMBCrypto News",
        "content": "Short positions increase following Grayscale’s decision to pull its Ethereum futures ETF application.\n\nMarket sentiment grows bearish with potential further declines.\n\nEthereum [ETH], the second-largest cryptocurrency by market cap, has recently shown a lack of significant upward momentum, contrasting with Bitcoin’s [BTC] recent surge.\n\nAlthough Ethereum reached over $4,000 in March, it failed to set a new all-time high, unlike Bitcoin, which soared to a new peak in the same period.\n\nIn the last two weeks, Ethereum has seen nearly a 10% decline, and this downward trend has continued in the last 24 hours, with a 2.2% drop.\n\nThis bearish sentiment is reflected in the actions of Ethereum traders, who have been increasing their short positions, particularly after a significant development from Grayscale Investments.\n\nGrayscale’s strategic withdrawal\n\nGrayscale Investments recently withdrew its application for an Ethereum futures exchange-traded fund (ETF), a move that has significantly impacted trader sentiment.\n\nThis decision, made just three weeks before the U.S. Securities and Exchange Commission (SEC) was due to deliver its verdict, has led to an increase in short positions on Ethereum.\n\nTraders are currently betting heavily on further declines, with $358 million in short positions poised for liquidation if prices rise by just 4%.\n\nConversely, a 4% drop would only eliminate $237 million in long positions.\n\nThis withdrawal aligns with broader concerns about Ethereum’s regulatory status, particularly regarding its classification as a security and the fate of spot Ethereum ETFs.\n\nAs the decision date — the 23rd of May — approaches, analysts and market participants are growing increasingly skeptical about the approval of these ETFs.\n\nAccording to Polymarket, over 90% of participants believe that the spot Ethereum ETF will be denied.\n\nHow is Ethereum doing?\n\nBeyond ETF concerns, Ethereum faces issues with its overall usage and a lack of speculative interest, especially from short-term holders.\n\nJames Check, a noted crypto on-chain analyst, pointed out that Ethereum’s usage is so low that its burn mechanism cannot keep up with issuance to validators.\n\nThis sentiment was echoed by Glassnode, which highlighted Ethereum’s underperformance relative to Bitcoin due to a lag in speculative interest from these short-term holders.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nFrom a technical perspective, Ethereum’s price is expected to continue its downward trajectory until it reaches a swing low liquidity near $2,800.\n\nThis is because Ethereum’s price has recently touched a breaker block, and the next target is to hit the major swing low on the 4-hour chart."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1BMHlYc1NJTHc0aTZuaVpoR2J3U3VNQkZMYi11VEhmTVZSQzA3VWtSZUZxaTRJLW45YThtcWdhNXZkc3BIUjJqRmF2NVY2eGVFUkRiQjZWUUo3ZDVPZ0YzMGxBdzNkOE9sTktnS3ZPeDZlUjRRZ1YxSk9yQdIBgAFBVV95cUxOd3YwWm9VaWNWbmZ1bjdOcnpNLWJMVXZsOG15WXNianMtQ3J3YzFHemJJRzEyM1JmenE2a2ZMcTdkeGVYdnltVFlKVUFfeEp4N2pXNVcxcUotRFpkc05kQWlpY21nSVpOelZIazdzbVE4eG5ieGwzSG00U2x5WG9zZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "‘Cheap’ Solana can flip Ethereum ‘this week’ – Analyst - AMBCrypto News",
        "content": "Solana is quickly catching up to Ethereum on the fees front.\n\nHowever, the Ethereum ecosystem still commands investors’ trust.\n\nThe Solana [SOL] vs. Ethereum [ETH] debate resurfaced again on Crypto Twitter following reports that the former could soon flip the latter on the fees front.\n\nAccording to on-chain analyst Dan Smith, Solana was quickly closing in on Ethereum on transaction fees. Smith claimed that,\n\n“Solana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week”\n\nTransaction fees refer to charges linked to network activity, while MEV means validators’ highest value derived by maximizing block production or ‘confirmation.’\n\nSolana vs Ethereum: fees and other fronts\n\nSmith backed his argument with data, noting that there was about a $300K difference between Solana and Ethereum’s fees.\n\nThe chart showed Solana recorded a significant surge in 2024, closing most of the gap with Ethereum.\n\nAMBCrypto’s evaluation of Artemyz’s data confirmed the trend on the fees front. The data showed that Ethereum network fees had dropped significantly since the end of February.\n\nOn the 7th of May, Ethereum fees hit $2.8 million, while Solana had $1.6 million.\n\nHowever, other market watchers argued that Ethereum transaction volume should include all L2 to capture its “real value.” To which, Dan Smith responded,\n\n“The question is whether or not pushing activity to L2s where ETH, the asset is used as a currency, drives enough value back to the L1 to compensate for the loss of L1 activity”\n\nDespite its network challenges, Solana, on average, has cheaper transaction charges than Ethereum.\n\nReacting to Smith’s projection of SOL eclipsing ETH, crypto analyst Ansem wondered,\n\n“And it is still 100x cheaper to transact on for users, really think about this & explain to me in detail why ETH is still worth 5x more by market cap”\n\nThings are also hitting up on the DEX (Decentralized Exchange) front after Solana’s Jupiter exchange outperformed Ethereum’s Uniswap on the Unique Active Wallets (UAW) front.\n\nLike Ansem, most market watchers underscored SOL as grossly undervalued, especially after last week’s pullback.\n\nNevertheless, Ethereum had a commanding lead on TVL (Total Value Locked) and overall token value on price charts.\n\nSolana had $4 billion in TVL, while Ethereum’s reading stood at $53.3 billion at press time, underscoring that Ethereum had more investors’ trust."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQVzZLd0RSNDFMSmV0X3FORktOTEVuSG01ZFhpSVI3V3QwQ2ZrYnJnRGptRFdmSTA0WmlmZ3NrZUVYYmw3TlphRVB6Y0hxc2pzR21aelFLc3lleXdMTEtIakVLdFQ2VDAyZU9YeEFheXRCU29xWmgycDNwVkNPZzViazloTWs4X3lvY2pSM0hmeklWd01MMUdxbmNZSXlOTlkxNmhTWTc1UzRBNGYtTmU4VUpDRHpuWkk1TDRfd3poQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says Ethereum Price Will Drop To $2,500, Here’s Why - TradingView",
        "content": "The Ethereum price has been closing mirroring the performance of Bitcoin recently and since the Bitcoin price has been on a downtrend, the ETH price has followed. However, Ethereum on its own seems to possess more bearish fundamentals compared to Bitcoin, leading crypto analysts to believe that the second-largest cryptocurrency by market cap will fall further from here.\n\nEthereum Poised To Crash Further\n\nA crypto analyst known as Shin Forex took to the TradingView website to share an interesting analysis of the Ethereum price. The analysis, which focused on the ETH/BTC chart, unveiled some concerning developments in the ETH price.\n\nThe analyst explained that during this time, the liquidity in Ethereum has been dwindling. Instead of flowing toward altcoins like ETH, it is instead flowing toward Bitcoin. This suggests growing disinterest in Ethereum from investors and as liquidity flows to Bitcoin, Ethereum has nothing propping it up at this time.\n\nFurthermore, the crypto analyst explains that the ETH/BTC pair has now broken below its support of 0.05. Now, this drop below its support level is important given what has happened each time that it broke. Shin Forex points back to the last two market cycles, one in 2016 and one in 2019, of the ETH/BTC breaking below its support.\n\nBoth times that this has happened, a crash in the price has followed, before it can rally again. The crypto analyst does not expect this time to be any different and believes that ETH/BTC will fall below 0.04. If this happens, it will send Ethereum spiraling and the analyst has set a price target of around $2,500 for this.\n\nCan ETH Price Survive The Crash?\n\nIn the short term, the Ethereum price doesn’t look to good, especially as the altcoin is currently trending downward inside its current channel, according to the crypto analyst. However, zooming out to the larger timeframe can help give an inkling of how the ETH price could perform after the crash.\n\nLooking at Shin Forex’s chart of the last two times that a formation like this occurred, it has also set a precedent for money to flow back into Ethereum. In November 2016, the price had crashed but in a few months, there was a massive recovery as ETH/BTC rose to a new all-time high.\n\nA similar thing happened the next time in 2019, with the crash coming ahead of a market rally, albeit a bit slower at this time. So, if this trend holds, then the ETH crash is inevitable. However, a recovery is expected that will likely kickstart the beginning of another massive rally.\n\nFor now, bears continue to dominate the Ethereum market and have successfully dragged the price down below $3,000. It is trading at. $2,975 at the time of this writing, with a small 0.36% decline in the last day, according to Coinmarketcap."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOdzhzaUVsR29pMlgzV2RRRzU4d3ZjVUdHcmpEeDRFR0dqUnUwcmFsU0tUNVNEbk1RWDVQenpXR01lMUZhN1lpdHV3YUtwblltRFE3Y2RMWlRYQmNYa0VzTS1QTW1pWVRWc2M4RV8weEdFS3JrWTNpX0tScDJfNnE3ZmJoLUdsM09PWUdUNTVST0lfY2RDNkJfRTJuTmpXNkZ5QVJLUEFpT1E2Z2tPWXQxbTVGTk1sSEQ3bkhoc1VJSXFncldzQjVZM25zUzBnRWRRaWhXRHlndnRKZnZCRlY5Vjg4OHc3TlRETkpJUGJZZUfSAfYBQVVfeXFMTzFyZ2JqZWZDOTBFNnEtY2dtN1dVMU1CU2c2U1hrZUEtNXA0Vzk0Z09kX19reU5IZ205VUxmSG1Ja3JXZ3d1N01tQURzVWg2YjQ1ZzI2Sm9iOFV6Q2x0VEh3RXgxd3BCN2E5RE9jb0dzaGwtcktrYnd6cm9aZ0x6Z1VYaUQtV191ME9QWDhQc19sb1hheV9xUWNaQzZIb1EzZ0VkdEtlaXlIOG44cUpvM3Z2MmxQam5YRzhEOVVJWmk2eWZvZ2w1bjM4VVp3ZUlaSXc2Ujh1VkpfNzlqNmM1RG5BSHJSTHJQd1VUMFFOa1RlSF9pSFln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Until BTC flips $64,300, altcoins' bleed could continue - FXStreet",
        "content": "Bitcoin price could rally 20% if bulls make a stable move above $64,300.\n\nEthereum price is close to bottoming out with a 26% upside potential under wraps for ETH holders.\n\nXRP would be good for entry, safe rather once Ripple price reclaims 0.6700 as support floor.\n\nAltcoins are going through a rough patch as Bitcoin (BTC) price continues to conceal directional bias in the higher time frames. In the lower time frames, however, a flip of the $64,300 into support would be the redeeming feature to cauterize the bleeding seen among altcoins.\n\nThe altcoin market capitalization is still holding well above the $250 billion level, positioning itself for a future move to the upside, should BTC show strength. An interesting observation, however, is that while the Asian session has been trying, the European session continues to front run a sell-off in the New York (NY) session. This means a good NY session would bode well for the broader market.\n\nAlso Read: Altcoins in disarray as BTC conceals directional bias\n\nBitcoin price could be primed for 20% rally\n\nBitcoin price action is consolidating within two converging trendlines that slope downward as they gradually narrow the price range, effectively forming a falling wedge pattern. The target objective for this technical formation is a 20% move north to $76,116.\n\nNevertheless, this breakout may not be here just yet as momentum continues to fall as shown by the lower lows and lower highs on the Relative Strength Index (RSI). The Awesome Oscillator (AO) is also still in negative territory, typically signifying a bearish trend in the market and that the downward trend may persist in the near term.\n\nA break below $60,660 support could see Bitcoin price provide another buy opportunity below $60,000, or in a dire cause, slump all the way to $56,000 before a pullback.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls defend $60,660, Bitcoin price could use this level as the jumping off point for further upside, activating the bullish reversal pattern by recording a decisive candlestick close above $63,871 on the one-day time frame. A candlestick close above this level would invalidate the bearish thesis.\n\nAlso Read: Bitcoin price dips into $61K but large holders buy BTC ahead of 20% upside potential\n\nEthereum price is close to bottoming out\n\nEthereum price is withstanding the worst of the weakness seen in BTC, but this could end soon as the $2,900 support looks primed to defend. The RSI is defending against further downside, while the AO flashes green as it edges toward positive territory.\n\nA show of strength from ETH bulls could see Ethereum price recover. A stable higher high above the peak of the Monday trading session at $3,221 could instigate a 26% move north for the Proof-of-Stake (PoS) token to the profit target of $4,083.\n\nETH/USDT 1-day chart\n\nConversely, if Ethereum price slips below $2,900 and closes below it on the one-day time frame, it would invalidate the bullish thesis. This could trigger more selling, sending ETH to the $2,800 before a possible recovery.\n\nAlso Read: Ethereum may be gathering momentum for potential rally, Vitalik Buterin introduces EIP-7702\n\nRipple price must ascend beyond $0.67 for safe entry\n\nRipple price has recorded higher lows, reinforced by those on the RSI, suggesting a growing bullish trend. However, XRP will only be safe to buy once the price reclaims above $0.6700, levels last tested on March 15. Such a move would constitute a climb of nearly 30% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nHowever, if traders begin to cash in on the gains made since Ripple price bottomed out at $0.4188 on April 13, the trend could be reversed. Confirmation of this would be seen by a slip below the 50% Fibonacci placeholder of $0.4952 and ultimately a lower low below the May 1 bottom of $0.4782. This would invalidate the bullish thesis.\n\nAlso Read: SEC vs. Ripple lawsuit sees redacted filing go public, XRP dips to $0.51"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBCQ2UyY2FjZ0xSRVZtQmI0Zk9MRTYzTGdrT2FJRC1EOXlFaXB4eXBGakZTQmZCRFJfbzJSZnJPVGNXSWt5elVYdExSaVNVLW51WVlHRWYwLTFkRVZmMVY2OUhjeG1UTVlNeVVfOVFBQnBhUdIBd0FVX3lxTE5QZExQSU0zNmxXdVZndTVNMklTM050emNZbE5FNmluMnpZS21lRnRycEtNRHBqVHNoRjhXYTVTUUNwYXNmTFMxcmJUR2RXOFAxVERnWTBXWmYyR3VMQWZrTi1sRDlmVkZqVmdVWUZkMkFvLUFMUk1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Solves Ethereum's Gas Fee Problem - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThanks to insights from Vitalik Buterin and contributions from experts like Ansgar Dietrichs, Barnabe Monnot and Davide Crapis, we are getting familiar with the concept of \"multidimensional gas.\" Traditionally, Ethereum has used a unit called \"gas\" to measure and price the computational efforts required for transactions and operations. This includes calculations like adding and multiplying, managing data storage, bandwidth and even complex processes like generating cryptographic proofs.\n\nAdvertisement\n\nThe recent proposal involves transitioning from a single-dimensional gas model to a multi-dimensional one, addressing the inefficiencies of treating different types of computational resources as equivalents. The current system, while simple, does not accurately reflect the varying demands different operations place on the network, which can lead to either over or under-utilization of resources.\n\nButerin uses a straightforward diagram to explain that while the gas limit might suggest a block can safely handle a certain amount of computation and data, the reality of what is safe can be quite different. This misalignment could potentially allow for blocks that are either too safe and under-utilized or too risky and overloaded.\n\nWith the introduction of multi-dimensional gas on Ethereum via EIP-4844, the network can now process different types of demands more efficiently. This change has already started to show benefits. Blobs, for example, will allow these rollups to operate much more cheaply, increasing transaction volume threefold without significantly raising block size, thus maintaining network safety.\n\nAdvertisement\n\nThe update also anticipates future enhancements, such as better support for \"stateless clients\" — a new type of Ethereum client that does not need to store a complete copy of the blockchain. These clients rely heavily on proof systems, and the current shift toward multidimensional gas could facilitate a smoother implementation of these systems by allowing the network to handle proofs more efficiently without compromising on security or inflating costs for users.\n\nThis multi-dimensional approach allows Ethereum to fine-tune how it manages different resources, potentially increasing throughput without risking safety. It marks a sophisticated step forward in blockchain technology, promising to make Ethereum more scalable, efficient and ready for future demands."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPekdzNUN6bFA0OFJ5NjF1dDlZN0V5c2JnQWJwcWVRSzdKdGYzQjNRdFRXeHhzSS1hclhLNUNXbW0tM2JxdmdvUVNPTEtoMmVvdHZxVU56YUNmSzdnMUtpZWJuYmJIalhuUDZ0NEdDUXVwb3d0bnRQdzc3aFBrZmhBYTlPTVk0ZXQxVURhSl90T1JscXBU0gGaAUFVX3lxTE51djJieG0xS3U5dDJlRWM1VzdydTVvS2d0OV96d09MY2tVYUhqdnBmeF81S1lsNV9JalRMdHhyZ2JYVFJ6QUlDWkRsb29pcXFwNW1FZXVmQlN3Wl9lTTR5M2JKdTk4TW1Mdk91TlRNVm83YkVpZUJvdHk5MVRwTzlIbTdjeVJ3OGZ2a3VhZW05cUpXd1hSWWJablE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum struggles around $3K as short positions surge: What now? - AMBCrypto News",
        "content": "ETH traded at $3k at press time.\n\nThe cumulative short liquidation of Ethereum rose to over $800 million.\n\nAfter experiencing a price decline on the 7th of May, Ethereum [ETH] saw more liquidations in long positions. Consequently, more traders opted for short positions.\n\nAs a result of this increased shorting activity, the price of Ethereum declined further, falling below the $3,000 price range during the trading session on the 8th of May.\n\nEthereum traders bet on price decline\n\nAMBCrypto’s analysis of Ethereum’s exchange liquidation map on Coinglass indicated a dominance of short positions at the time of writing.\n\nThe cumulative short liquidation leverage for the 24-hour period has risen to over $800 million.\n\nThis suggests that traders are increasingly taking short positions, indicating their expectation for the price of ETH to continue declining in the short term.\n\nFurther examination of the map revealed that the cumulative leveraged position for the last seven days has exceeded $1.7 billion.\n\nGiven the prevailing trend in the previous trading session, this current positioning by traders is not unexpected.\n\nEthereum long positions feeling the heat\n\nEthereum’s long positions have experienced more liquidations than short positions over the last three days.\n\nAMBCrypto’s look at Coinglass’ liquidation chart revealed that between the 6th and the 7th of May, longs exceeded $78 million.\n\nConversely, short liquidations, during the same period, amounted to approximately $18.3 million.\n\nThis trend persisted at press time, with long liquidations surpassing $7 million, while short liquidation volume stood at around $1.6 million.\n\nETH to fall deeper?\n\nAMBCrypto’s look at Ethereum’s daily timeframe price trend revealed a notable three-day decline.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nTrading at around $3k at the time of writing, with a decrease of less than 1%, the price movement indicated some level of volatility as depicted by the Bollinger Band.\n\nThis decline has further entrenched ETH into a bearish trend, with the Relative Strength Index (RSI) standing at 40, signaling a strong bearish sentiment."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZ2ZUNndrZzEyTWljWWxvZU14VTMwLVJzdkZ2QUVRYUVoU1NNTnc4ZjlKSjVOY0w2Tl83dDNfU3ItaVRPUWhmZlI2QWstbE5xZ19mcXNZR0dTZDRLM2MtYTkyV0NHMkJZSjZYVVZhMWdfN3B6YWFRbUcybnNWUjVVR2s0SW5wYWw3T21yLXl3UklySURYVHfSAZsBQVVfeXFMT29UM1ZrRURncEhSZzZKS2hGTjEtSC1ObHdzR2ZYN0NLT3RMejI5V0V0d3FRSlZNaEdjMWxEY2xzTldVa083QjkwUmRqSEVXTE81dG9yVzkxQ2tjdS1KbHlmZWdtWU4wUWZvT0RLQ0wyYVlSSTNRNEFiUDR0OEN2cEhlY05Cb0F0YjJ2d1lpT0x4SWxPcEFRVDNXUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: What ‘convinced Grayscale to withdraw?’ Analysts weigh in - AMBCrypto News",
        "content": "Grayscale makes a U-turn on ETH futures ETF application\n\nAnalysts offer divergent views on Grayscale’s move and SEC’s next play.\n\nGrayscale has withdrawn its Ethereum [ETH] futures ETF filing, eliciting mixed signals as analysts struggle to interpret how this could impact the SEC’s next move.\n\nBloomberg ETF analyst James Seyffart called the application a “Trojan horse” that the exchange could use to sue the SEC if it denied its spot ETH ETF application, as it did in the spot Bitcoin [BTC] case.\n\nNow that Grayscale has withdrawn the filing, the analyst noted,\n\n“Maybe the SEC spoke with Grayscale about this… And whatever was said convinced Grayscale to withdraw? (This is a complete guess)”\n\nNo clear read on SEC’s Ethereum ETF approval move\n\nBloomberg ETF analysts have long maintained low odds of May approvals for the spot ETH ETFs in May.\n\nIndeed, the market looks convinced that nothing positive will happen in May. According to prediction markets, Polymarket, May approval bets have dropped below 10%.\n\nAnother Bloomberg analyst, Eric Balchunas, commented that,\n\n“Sounds like saying this is a good sign they’re not gonna pursue a lawsuit this time around?”\n\nHowever, when asked whether Grayscale’s withdrawal of the filing could mean that a May approval was likely, Seyffart was conflicted and answered,\n\n“I *DO NOT* think that’s gonna happen (though odds aren’t zero). So, I *DO* think it was something else. That said — honestly — that’s one of the very few reasons that I’d voluntarily withdraw this if I were Grayscale.”\n\nNate Geraci of ETF Store also couldn’t read Grayscale’s move. However, he pointed out that,\n\n“Only reason I would do this if I were Grayscale is b/c I have “assurances” spot eth ETF will be approved at some point.”\n\nOn her part, Eleanor Terrett, market watcher and FOX Business journalist, noted that muted demand for ETH futures could be the reason for Grayscale’s move.\n\nThere are a handful of ETH futures ETFs in the US per Blockworks ETF tracker.\n\nHowever, Terret noted that other Ethereum futures ETFs were approved in different frameworks,\n\n“The others were approved under the 40 Act, not the 33 Act?”\n\nFor perspective, the Investment Company Act of 1940 (40 Act) and the Securities Act of 1933 (Act 33) are two different ETF approval regimes in the US.\n\nIn a recent interview, SEC’s chair, Gary Gensler, dodged questions on the status and fate of the spot ETH ETF filings with ambiguous answers.\n\nIn the meantime, ETH extended its short-term price range of $2900 — $3300. It has been stuck in the range since mid-April.\n\nThat said, even last week’s over $30 million capital inflows didn’t induce a range breakout. However, this could change after the SEC’s decision on spot ETH ETF applications in late May."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQSk9OYlBtVDVQUUV4eUlmbXpBZzlycUVDMS1nSHBmWEZYbndNN2FTMVVEcEZhMlFhVlRJd0p6eW01ZmgxdWFRcDBPYUNzZ1FlbDZ4dWtUQ0VBSUF4V2ZrZllfUFZjdDFwa3psbDJDMFpQeVFEN2RhR3NnSlQ3cUpvdDBabnNHRnhfQmwzaNIBkgFBVV95cUxQenV6R2Y3Z2ZhUDhEaHZqZlF5MU9WYkFJMHUxWHZpOXJMTUotVlNFLTNIdEFSV3VzTHNYRkZkUkZPbFV6UWItdHZtTHNXMnNJYlJTNC1DWnVFU0lTcHRuQmtrb19DWTJzaWxpb3RxZ2pOdUNISE9CV3lqd2FONmI0NkdlTDdfb1hDZE13MjlDRVNlUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF: What’s The Reason Behind Grayscale Ditching ETH Futures Plan? - CoinGape",
        "content": "Grayscale Investments has sent shockwaves through the crypto industry by withdrawing its application for the Ethereum Futures ETF. While the investment firm hasn’t opened up on the reason for its decision, the crypto community has weighed in their opinion. Moreover, Fox Journalist Eleanor Terrett has shed light on potential reasons for the withdrawal of Grayscale’s Ethereum Futures ETF.\n\nWhy Did Grayscale Withdraw ETH Futures ETF?\n\nGrayscale recently made headlines as they withdrew their 19b-4 filing for an Ethereum futures ETF. Bloomberg ETF Research Analyst, James Seyffart, characterized the filing as a “trojan horse” strategy. Moreover, he suggested that Grayscale aimed to replicate the circumstances that led to the approval of their GBTC Bitcoin ETF.\n\nadvertisement\n\nIn addition, Seyffart highlighted that Grayscale could leverage the contradictory nature of SEC decisions. He cited how Grayscale won the lawsuit vy highlighting the SEC’s decision of approving Bitcoin futures-based ETFs while denying Spot Bitcoin ETFs. The analyst added that Grayscale should have sought similar success with an Ethereum futures ETF.\n\nHowever, the institution played a reverse card and gave up on the opportunity. Seyffart speculated this move to have been influenced by the SEC. He noted that the SEC might have had a meeting with Grayscale executives and convinced them to withdraw the Ethereum futures ETF.\n\nOn the other hand, Eleanor Terrett offered another perspective. She noted that Grayscale never completed an S-1 filing for its Ethereum futures ETF. Terrett proposed that the SEC may have been waiting to review a finalized futures application before considering the spot application. Meanwhile, Grayscale could have been awaiting a complete futures application from a competitor.\n\nSince there was no finalized ETH futures ETF application by another party, Grayscale could have pulled the plug on the initiative to save time and resources. Additionally, she pointed out the relatively subdued investor demand for existing Ethereum futures ETFs since their launch last year.\n\nTerrett speculated that Grayscale’s decision to withdraw the ETH futures ETF application could stem from a strategic evaluation of resource allocation. With muted demand for existing ETH futures ETFs and potentially limited prospects for approval, Grayscale may have opted to prioritize other initiatives.\n\nAlso Read: Breaking: Grayscale Withdraws Ether Futures ETF 19b-4 Filing\n\nSEC Delays Spot Ethereum ETF Decision\n\nThe SEC has continued to delay its decision regarding the Spot Ethereum ETF applications. This could have also fuelled Grayscale’s latest move. The SEC’s recent filing indicates a need for extended examination of the proposed rule change for the Invesco Galaxy Ethereum ETF.\n\nThis decision aims to ensure a comprehensive evaluation of the complexities involved before granting approval. Such actions come amidst a backdrop of delays affecting numerous other firms, including Grayscale and BlackRock, which are pursuing similar approvals.\n\nThe SEC’s cautious approach reflects the broader regulatory uncertainty surrounding cryptocurrency offerings. While Grayscale’s Ethereum Trust is already registered, challenges persist, as evidenced by the SEC’s recent call for additional public input. These recurring delays underscore the delicate balancing act regulators face in reconciling regulation with the growing demand for crypto investment vehicles.\n\nAlso Read: Bitcoin & ETH Records $251M Outflow Last Week, But There’s A Catch\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORThxb1ZNeEgzSnNxTzlSRHBoc2RjTjZIMDlxVTc1T296UjVtSU01SkhaSUV2ajlSdUlqTXlJdHdOcXdERXc3VlFIQjNENFJtcDJIVFhpbzZmWkdBYUFZek44dVh3S2FlTXlvNWJwY0VHN0hnaG9PME9DV3JWZUFzbjNPUWxmRTFCdjViaWZBSFhuVWJUc2lUNmM2dGM5ZS1IQVlZcC16ZHdiaXltNnVzcU5DRVRGMlpCcTdmVHRiSjZqVWVQMmdiZXFkSk0wb3h0dEVLME91VEjSAd4BQVVfeXFMT2hTUE13eUlOcVJybXZpZWVEVjZoNGw4dE5RdzY0Zmg5SzJrT2V2OGVZME5LMFlsbElndDBKSGxTTzdsd3pfZW1lNnJtQlFwSjJDZzB4UDFxT01sU3FTTFVTNGdjRXU4VGFDYWsxaEdUNmtoWnJYUG9WV2ZWZ0lsWGNPTG4wWmoySjFZbHc3d1dvSlduSklqU3JZMFF5eldQc0NzQVZLQmxSb3dkdEQxRm5makJyUW1NdmJMSGpkN0ZkaTNDejYyQ21rTmdDZm9xZDdVLUdNZkF5LUZpbFpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Bitcoin & Injective – American Wrap 08 May - FXStreet",
        "content": "Injective (INJ) had a market capitalization of close to $4.5 billion at its peak in March 2023. At nearly half its market cap, the DeFi protocol has proposed a solution, likely to reinstate INJ to its former glory through higher relevance and fresh capital injection.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074. The Ethereum Foundation also appears to be dumping ETH tokens again with a recent transfer.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPUjQ0Tl9IUzBvNC1Uam1lSmdPbW9XYlZ4b05SQUJPQ0tjU0Z4ZnNjcnBINzVRbjZfbW1Fa0J5NmxpUXBBeFN4YTI3cndDdDB2VldMQS16VFlDU285aHJXUlNOdjI2VlRhTmQtT1dqWk5rc3NYMll2NDA1Q0lNdUZyRGdZLVl4RUV6ejBv0gGTAUFVX3lxTE1zZkV2b2tlR3FxYllHSHhSNG5CT0xDMkdLbjc5ZWRjMXBmYjNhcDRlelczOVlRRUxVeGRndEllYWN3dzlfOWFUSjItakNoXzNtU18yN2RjdGRNRFJReUxEN0g0RUphUkFaZ0tuNFYwZjlPem5rNl9KdmJ5eXZ0N0dEbTJtRDF4c0h1bm04Z0dubFlMMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "What Is Fantasy Top? The Ethereum Game on Blast Turning Crypto Twitter Into a Fantasy Sport - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWe’ve seen mash-ups of fantasy sports and NFT trading cards, but what about something with more crypto-native subject matter? Enter Fantasy Top.\n\nBuilt on Ethereum layer-2 network Blast, Fantasy Top takes the premise of fantasy football and other fantasy sports games, but swaps out pro athletes for crypto influencers. It’s like Crypto Twitter: The Game, and it’s more than just a surface-level riff on the social media sphere.\n\nFantasy Top has gotten off to an electric start, dominating industry chatter while driving surging trading volume—and becoming one of the most profitable protocols or apps across all of crypto. Curious how to get started? Here’s what you need to know.\n\nWhat is Fantasy Top?\n\nAD\n\nAD\n\nCrypto Twitter often feels like a spectator sport, so it makes sense that someone turned it into a fantasy game. Fantasy Top takes the core premise of fantasy football, soccer, or baseball, and swaps in 120 (and counting) crypto influencers, traders, content creators, and personalities.\n\nEach “hero” in the game is based on a denizen of Crypto Twitter, and they get their own NFT cards minted on Ethereum layer-2 network Blast. You can buy and trade the NFTs, which come in multiple rarity levels and can be upgraded by acquiring multiple copies of a lower-level edition and trading them up. Higher-level cards come with a larger score multiplier.\n\nIn Fantasy Top competitions, you’ll select a lineup of five owned NFT cards and lock it in. Scoring is based on the actual Twitter engagement of your industry “heroes,” amplified by your cards’ particular score multipliers, so there’s strategy involved in both buying up cards for your lineup and picking the best cross-section of crypto tweeters to place highly in a competition.\n\nCards in Fantasy Top. Image: Fantasy Top\n\nRewards thus far include Ethereum (ETH), Blast Gold points that will go towards the network’s upcoming BLAST token drop, and FAN points, which may ultimately lead to future benefits on Fantasy Top—or perhaps an allotment of airdrop tokens.\n\nDo I need NFTs to play Fantasy Top?\n\nYes, Fantasy Top requires NFT cards to play. You’ll need at least five to lock in a lineup for a competition, and at this point, there’s no option to play the game without the NFTs.\n\nAD\n\nAD\n\nFantasy Top sells packs of cards with dynamic pricing based on demand (currently around 0.4 ETH, or nearly $1,200), or you can purchase individual cards from the app’s NFT marketplace.\n\nFantasy Top is played via the website, and like with other fantasy sports, you simply set your lineup and then watch the points roll in. Your leaderboard placement at the end of each competition period determines your rewards.\n\nWhat can I win in Fantasy Top?\n\nWith such significant demand right out the gate, the early rewards are substantial indeed. In the first “main competition,” Fantasy Top served up a total prize pool that included over $150,000 worth of ETH, potentially more than $2 million worth of Blast Gold (based on analyst projections), and other perks to players.\n\nAnd the crypto influencers who've become in-game heroes are seeing sizable benefits, too. A share of the overall pack sales, along with a cut of the marketplace fees, are paid out to the influencers.\n\nLess than a week after Fantasy Top’s mainnet launch on May 1, 2024, the game paid out $1.25 million worth of ETH (in total) to heroes, along with what’s estimated to be at least $25,000 worth of Blast Gold points.\n\nThe future\n\nFantasy Top is early and buzzy, but the team has already teased plans ahead for the future—and it also clearly has some kinks to work out along the way.\n\nOne week after launch, the game has already added leagues, which split players up into Silver and Bronze categories based on their performance thus far. Rewards will apparently vary by league designation, with “rewards increasingly skewed towards the top performers,” according to a tweet.\n\nWhat’s ahead? More in-game heroes, apparently, along with an improved scoring model, a “whole array of sub-competitions,” and other “surprises” to come.\n\nAD\n\nAD\n\nPreventing Bots and shortening the Main Competition 🏁 To safeguard Fantasy participants and uphold a meritocratic environment, we've decided, together with the heroes, to end the competition slightly ahead of schedule, preemptively thwarting any surge in malicious activities.… pic.twitter.com/BKp0rYL6Io — fantasy.top (@fantasy_top_) May 8, 2024\n\nBut as Fantasy Top attempts to grow, it will also need to deal with the immediate problem of users (or external observers) “botting” tweets from the heroes, manipulating the scoring and leading to some early pivots as the team figures out how to handle it all.\n\nSome heroes have complained of being targeted by botters, and Fantasy Top already decided to end its first main competition early due to manipulation concerns. The game is built around social media engagement, so that’s something they’ll have to sort out if Fantasy Top is going to try and parlay this early buzz into a sustainable game model."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOdVg4Y0hfV1dLNDU1RGZtNGZLanctVVBzek9Semh4OHJLQ1I3YVRkNzBwMjJ5dk1NRUdyZnIwYWx0RmkxQjFMTWxhWUhTSUJRS0FySzZCN3FfZEFXY2J2WnlFLVktMjM3bWZLR0htbjEwVDcwQ0FGRnJWWDFyNzNHbmo3d0psTWRWTk52ODFtM21WR2FZMkVnWmJRTzVxWGPSAaQBQVVfeXFMUDlFb2hiVEpobS1BQk1PbW52UzQ2aTVfQlUyMkhtenBSOXVRY2ViTkVGLU5fMkdMMjZNR1BPOFBPOVFleEV5LUdwc3JEUlhRcG9NWXR6MzRNRktSUTZQTlJjdjczLVYxWWVuUEk3WHNnNlBveG02cldWVGNvM0tzTFhyNG1oZWFWUC1rOHVOQ0VCZUwxdlNpUkk1WktkTVJIVVI2aFA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Client, Near Protocol, EigenLayer Fast Finality Layer Layer Goes Live - CoinGape",
        "content": "Nethermind, an Ethereum Client, has just declared its participation in NEAR Protocol’s Fast Finality Layer (NFFL) initiative. This union comes at a crucial time for decentralized applications (dApps) and smart contracts when the blockchain industry is experiencing a rollup in Layer 2 user adoption in the Ethereum network. Nevertheless, though promising advances in scalability and efficiency have been achieved, challenges such as liquidity fragmentation and high finality times remain that impede user experience and innovation.\n\nIn response to the demand for faster transaction finality and increased interoperability, NFFL is an innovative infrastructure layer enabled by NEAR Protocol, together with Ethereum Client Nethermind and EigenLabs. NFFL aims to ensure rapid transaction finality on Ethereum Layer 2 rollups and beyond, removing the inefficiencies of today’s optimistic- and ZK-rollup solutions. By harnessing the security features of the Ethereum network and the validator guarantees provided by NEAR Protocol, NFFL makes transactions final in a matter of seconds, providing a paradigm shift for decentralized finance (DeFi) and blockchain-based applications.\n\nadvertisement\n\nNear Protocol NFFL Enhances Blockchain Interoperability\n\nFast cross-rollup communications support and defragmentation action on liquidity are core pillars of the NFFL initiative. NFL, by optimizing the transaction process and reducing waiting times, will enable developers to design apps that can smoothly integrate several Layer 2 solutions without losing speed and security. This improvement not only improves the user experience but also promotes innovation in the blockchain space, enabling developers to create new opportunities in DeFi, gaming, and other decentralized applications.\n\nAdditionally, NFFL’s focus on chain abstraction fits into the bigger picture of simplifying user interactions with blockchain networks. Through an infrastructure layer that makes transactions quick, secure, and interoperable, NFFL is fueling a world where applications and assets can roam the blockchain ecosystem. The fact that such an integration is seamless in a wide range of platforms acts as a unifying factor. It simplifies the process of cross-chain transactions, making the blockchain community a more accessible and unified community.\n\nNEAR Price Decline Amid Launch of NFFL\n\nDespite the significant strides made by NEAR Protocol through the launch of the Fast Finality Layer, the project has faced a price decline of 6.16%, with NEAR price trading at $6.96. While this decline may raise concerns within the cryptocurrency market, it is essential to acknowledge the long-term implications of initiatives like NFFL in scaling the Ethereum ecosystem and advancing the vision of chain abstraction for Web3.\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQdEJUYU5PSlZDSkJwdGVSS3psUF9wLTQ0Z1RvTmItcnZoSVdVWFQxU2Q1Y3A2WkNuS1dhc3A4NHVMMjFCZXZ3ZmQxRFFaS2FyUHM4dWhqODR4b2R3NTBvakFzTldZeEN3bjh2SDd3X1JkUjNGZXoxMFR6RGtVRXRsdGJTcHNPdmNHakpzM2Q0RU0tcVRmbWfSAZsBQVVfeXFMT0l5aWNqZUpRSzZxU3l1WG9yY0k1a2pXRFAyRkxzdnFPTGFzTHFjVXFIVXk3WFNhemU5QUtWNHMxdmlaSXo1ZGJDaVRDbldjTlFOT0V3TkdNMjBWZGhXUE56STRmOVNjR0tXaEcxeldfZFp6cDdNZDd6eWdOTTl0VWFnbjQ2dEhYSk43YUJWbzdwYnQ1TVVLcXBGNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum: How they have fared since January’s ETF approval - AMBCrypto News",
        "content": "Ethereum has recorded low capital inflows since January compared to Bitcoin.\n\nETH’s long-term holders continue to wait for a new all-time high.\n\nLeading altcoin Ethereum [ETH] has underperformed compared to Bitcoin [BTC] since January, Glassnode found in a new report.\n\nAccording to the on-chain data provider, while BTC, aided in part by the US spot exchange-traded funds (ETF), has seen significant capital inflows since the beginning of the year, ETH has recorded a decline in trading activity.\n\nETH remains in BTC’s shadows\n\nFollowing the approval of spot Bitcoin ETFs on the 10th of January, Glassnode data shows a significant divergence in Net Unrealized Profit/Loss (NUPL) between BTC and ETH.\n\nIn its report, the on-chain analytics firm noted that this suggests that BTC’s investors have captured a larger share of profits compared to their ETH counterparts since then.\n\nThe NUPL metric determines whether an asset’s holders are experiencing unrealized gains or losses. It compares the average purchase price of all tokens held by investors to the current market price.\n\nIf the market price is higher, there is a net-unrealized profit, while if it is lower, there is a net-unrealized loss.\n\nAccording to Glassnode, a significant threshold for the NUPL is when the value exceeds 0.5. This is because it signals that an asset’s unrealized profit is greater than 50% of its total market capitalization.\n\nGlassnode said,\n\n“Amidst the hype and market rally surrounding (the) approval of the spot Bitcoin ETFs, the unrealized profit of Bitcoin holders expanded considerably faster than that of Ethereum investors. As a result, the Bitcoin NUPL metric crossed 0.5 and entered the euphoria phase three months before than equivalent metric for Ethereum.”\n\nFurther, ETH has yet to see a strong inflow of new capital as BTC has since spot ETFs became tradeable in the US.\n\nGlassnode assessed the Short-Term Holders’ Realized Cap for both coins and found that ETH’s remains low.\n\nThis suggests reduced activity from the coin’s short-term investors, whose actions are known to significantly influence an asset’s price performance.\n\nThe report further stated,\n\n“In many ways, this lack of new capital inflows is a reflection of the under-performance of ETH relative to BTC. This is likely in part due to the attention and access brought about by the spot Bitcoin ETFs.”\n\nOn why this might be happening, Glassnode added:\n\n“The market is still awaiting the SEC’s decision for approval of a suite of ETH ETFs expected towards the end of May.”\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nDue to the difference in the performance of the coins, BTC and ETH’s long-term holders (LTHs) have adopted different strategies.\n\nWhile BTC’s LTHs have let go of some of their holdings to book profits following the coin’s rally to a new all-time high, ETH’s LTHs –"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOQlZ5TEhSbFZkQUhCeXZIbW1ON2xCaEFoZ1dWSE1GcF95VDJiYjEwa0h2RDdxSWw2ajVzeU5Qdm9KQ0hFdzlKdWpVSGlOY0E5TEpzMkkxYnZXa1I0UHdSYUlWdUR1NVZ2VTkzZ0hEQldHYUJaVmZyZHZqWGJUeUFCX053a3QwOU5MUGVseXN2SmxBNWlRVjVFUVVna1RfRG5zYmsxNVBPS0lqU0tuM0s1OEY1UVpMSEMxV2R5c2dyeUotU2JlWGZQV3hVa203VTBTUHliT2dNeDdTNFB4OFZBLUxFc3Rwbmt4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Continue To Slip: Analyst Says King Crypto Network Fundamentals Indicate 300% Upside, Could Top Between $250K-$275K - Benzinga",
        "content": "Leading cryptocurrencies saw a decline on Wednesday, extending the run of losses that started as the week began.\n\nCryptocurrency Gains +/- Price (Recorded 8:45 p.m. EDT) Bitcoin BTC/USD -1.94% $61,407 Ethereum ETH/USD -1.08% $2.985.73 Dogecoin DOGE/USD -3.96% $0.1446\n\nWhat Happened: The world's largest cryptocurrency, Bitcoin, dipped below $62,000 during the day, taking its week-to-date losses to over 6%. Popular meme coin Dogecoin witnessed a steeper decline, down more than 14% since the start of the week.\n\nThe price drop triggered liquidations worth more than $140 million in the 24-hour timeframe, with nearly $100 million in long positions getting wiped out. Bitcoin liquidations topped $37 million.\n\nSurprisingly, the number of traders taking bullish long positions on Bitcoin spiked dramatically, exceeding those gunning for Bitcoin's price decline.\n\nBitcoin's Fear & Greed Index flashed \"Greed,\" reflecting a degree of FOMO in the market, and a potential surge in buying pressure.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 8:45 p.m. EDT) Kaspa (AIOZ) +8% $0.1208 THORChain (RUNE) +6.76% $5.75 Toncoin (TON) +3.67% $5.88\n\nThe global cryptocurrency market cap stands at $2.27 trillion, declining by 1.34% in 24 hours.\n\nThe U.S. equity market was a mixed bag on Wednesday. The Dow Jones Industrial Average rose 172.13 points, or 0.44%, to close at 39,056.39 points, extending its winning run to six straight sessions. The S&P 500 dropped 0.13% during the trading hours, ending at 5,187.67 points. The tech-focused Nasdaq Composite slipped 0.18% to 16,302.76 at the closing bell.\n\nThe yield on the 10-year Treasury rose to 4.496% as of 9:23 p.m. EDT.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: According to on-chain analytics firm IntoTheBlock, the correlation between cryptocurrencies and traditional markets, including equities, was closer to zero.\n\nBitcoin's correlation with the Dow was 0.25, while with the S&P 500, it was 0.40. This suggested that both asset classes were moving on separate wavelengths.\n\nThe 30-day correlation of BTC & ETH with traditional markets and commodities is currently close to 0, meaning crypto is doing its own thing right now.\n\n\n\n🔗https://t.co/Wx8RxQwatF pic.twitter.com/8aQqAdwNQz — IntoTheBlock (@intotheblock) May 8, 2024\n\nPopular cryptocurrency trader Elja highlighted that Bitcoin was undervalued relative to its current network fundamentals.\n\n\"Bitcoin’s current network fundamentals indicate a 300% gain from the current level. This means that the BTC top could be somewhere between $250,000 and $275,000.\" Elja stated.\n\nIs #Bitcoin Severely Undervalued?\n\n\n\nBitcoin's current network fundamentals indicate a 300% gain from the current level.\n\n\n\nThis means that the BTC top could be somewhere between $250,000 and $275,000.\n\n\n\nThe cycle is not over yet. pic.twitter.com/j2tW6v68sH — Elja (@Eljaboom) May 8, 2024\n\nAnother crypto expert, Benjamin Cowen, mentioned that the market was far off from the alt season—the phase where traders take profits from Bitcoin and invest them in altcoins.\n\n\"A macro BTC dominance uptrend, which is what we have been in, suggests that this is not alt season, nor has it been. This chart shows the last alt season we had was in 2021.\"\n\n\"Alt Season\" is when #BTC dominance craters, as people take profits from BTC and put it into altcoins\n\n\n\nA macro BTC dominance uptrend, which is what we have been in, suggests that this is not alt season, nor has it been. This chart shows the last alt season we had was in 2021 pic.twitter.com/KtfWMPTXWw — Benjamin Cowen (@intocryptoverse) May 8, 2024\n\nPhoto by CMP_NZ on Shutterstock\n\nRead Next: Bitcoin Retail Interest ‘Not Coming This Bull’, Warns Trader"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOUWR3NTVuSnRhZUZJZEo3Ylo3WmhRdGZydFJ3aWdLa0ZWcGFfVkJ2RXBLaG5pemxodkJ2LWdGX0hpcnB4aEdPZ29tZ1c2UTB3Y1RaQ0V3MWdaTUpzVjU3dFJxTXM4M2FrTEJQRlNDY3o0c2hxcmpfUzlaeC1HS1BvWE9YZEFrQ25Xek8yYWg2UzR1U2pldWNB0gGkAUFVX3lxTE02ZV9jXzgzR1djU3Z3aV8zRjFjdTJXUnlqRGx5eFFuT2FMeVVDN2FhN1haNFpDR3hkRS10Z2t3THFwaFU3a2Jhblg5T3hDdFoxbkxvQ0toZEZZT2NRaEpRbExOZnB1UlVXVUpseUZ4Wk9HYWU5bWIwRkVIREFLYjAzSF83elNCWDRmemFYSERhRk02c2U0U2NuSHhhMWU1cTRsZWZ1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Dynamics: A Detailed Analysis May 09 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNF82YW1vOEl5N2M1eEJieDBGS2wtd2Y4Vk5seEFWOGdFTGY0b19yeW4zVk9fWjlwLWh4UkdETVJmQzY1VWo3ajItSkxJU3NieVRVTEdrLWYwYnRNN1lVUDl1bk5uMi00SDdvWXVvT21iaG15NHBVYWo3eGFLTkNUVV9uQ210UTdKdE1ia0h1ZVRuc3htWUt0d041UXpQeEJkZElvYVhRX29CY2cxMm1EaVJ1RzR5Z9IBuwFBVV95cUxPN01PenhBejItSW43RkFLNVZFclp2M2k4bmtZdUNYbURaZzhCVGpueXNaR0FiS0VacWZmUkFlWFlHR2lMUTFvdmdSSTBSM1lURWhzeno5bkVpOHpGNEdJa2hOd3hYNjEwZDk2U2tLVmRWbHBkVXNvNU8xbHhlYWtIc2szb0FHeGIxbDRaamFHQkxNQnZENE5ha1ByVEg2NHVZQndRVmxPYklsM3FQUzN5Y1l4dTRMRHVfdGNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Is Ethereum About to Take a Massive Drop? Here’s Why ETH Price Could Drop By 70% - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nIs Ethereum About to Take a Massive Drop? Here’s Why ETH Price Could Drop By 70%\n\nStory Highlights Ethereum slides below $3000 as the bears intensify their presence within the crypto space as Bitcoin drops below $62,500\n\nWith a stable descending trend, the ETH price is feared to drop to its initial levels, offering the traders a lifetime opportunity to jump in\n\nThe volatility has made its way into the markets with the selling pressure mounting over the crypto space. After a long fight, the bears are close to dragging the levels below the crucial support as the ETH price is trading in and out of $3000. With new bearish clouds looming over the markets, it will be more interesting to see whether the bulls can provide a solid foundation or the bears can squeeze profits!\n\nPreviously, it was believed that the ETH/BTC pair, which was gaining strength, was a clear indication of altcoins growing stronger than Bitcoin. However, a recent analysis suggests that the ETH price against USD or USDT drops heavily whenever the ETH/BTC pairs face rejection from the interim highs. Now that the ETH/BTC is falling under acute bearish pressure, will the ETH price recover from the recent losses?\n\nA popular analyst, Benjamin Cowen, referring to both pairs, believes the descending trend could soon knock in the ETH price.\n\nThe analyst refers to the weekly ETH price chart against the USD and compares the ETH/BTC’s variation. He marks the times when the ETH/BTC breaks down and indicates that the ETH price against USD encountered a 70% drop simultaneously. Now that the ETH/BTC has faced rejection, the analyst predicts a similar price action. He says,\n\n“The last 2 times that ETH/BTC broke down, ETH/USD then dropped approximately 70%. In a world where everyone has been preaching Alt Season for the last 2.5 years into a BTC dominance uptrend, I thought I would remind people that there is still downside risk,”\n\nWith this, the analyst sheds light on the possibility of the altseason being differed as there is still more room for the price to go down, probably below $2000. If this happens, the Ethereum (ETH) price may offer a lifetime opportunity to accumulate as the 5-digit price target continues to prevail for the rally in the long term.\n\nAlso Check Out : Ethena Token Jumps 18% This Week! Can ENA Price Reclaim $1?"
    }
]