[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPUkh5S0YwU0dhWkY4ZDVDVmx5cEZpUVJtWngwcU8zSkVJaWNHbExsTXJySjhJVXRnNW13cnE2RUdPbmRkZUd0Yl9TaHJlazV0aUtyRU5zVGJnaENVYTZKXzZiWVJYTW1mQUFfV2V0aGlMemdFWWRWWjRhYU9UQmVqclJRZWJkQThXMkpZNDhHVkZSeXBYc081REFaRmZ5ejdFTDZ2M2JTNzdzSTEtVm5VYXhuR0xnUDRq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC sued over Ethereum, crypto firm asks court to state token is not a security - Fortune",
        "content": "A bitter legal fight between the crypto industry and the Securities and Exchange Commission grew more intense on Thursday as Consensys, a major backer of the Ethereum blockchain, filed a lawsuit against the agency in Texas federal court. The complaint seeks to head off an impending SEC lawsuit against the company over features of its popular MetaMask wallet, but also asks the court to resolve one of the biggest legal uncertainties hanging over the crypto industry by stating that Ethereum’s digital token, Ether, is not a security.\n\nIn its 34-page legal filing, Consensys uses dramatic language to argue that the SEC’s efforts to exert jurisdiction over Ethereum is both illegal and a threat to blockchain technology more broadly.\n\n“The SEC’s unlawful seizure of authority over ETH would spell disaster for the Ethereum network, and for Consensys. Every holder of ETH, including Consensys, would fear violating the securities laws if he or she were to transfer ETH on the network,” the complaint states. “This would bring use of the Ethereum blockchain in the United States to a halt, crippling one of the internet’s greatest innovations.”\n\nThe new lawsuit comes as SEC Chairman Gary Gensler pursues an aggressive enforcement campaign against leading companies in the crypto sector, including Coinbase and Uniswap. In recent weeks, this campaign has involved a wave of subpoenas asking firms and developers for documents related to their dealings with the nonprofit Ethereum Foundation, which supports the blockchain’s development.\n\nGensler’s tactics have angered many in the crypto industry who have complained the SEC has failed to provide clear rules or to create a regulatory model that accounts for the distinct features of blockchain technology. Gensler has disputed this, claiming existing securities laws are clear and sufficient, and that the crypto industry refuses to comply with them.\n\nThe controversy over Ethereum has been especially heated since the SEC has signaled repeatedly in the past that the blockchain’s tokens, like Bitcoin, are not securities and therefore outside its jurisdiction. This includes a landmark 2018 speech where a senior official stated that Ethereum had become “sufficiently decentralized” as well as the agency’s decision last year to allow Ethereum futures trading—an implicit acknowledgement that Ether is a commodity. Meanwhile, video has surfaced of Gensler himself, in his role as a private citizen, telling hedge funds in 2018 that Ethereum is not a security.\n\nThese precedents, however, have failed to dissuade Gensler, who appears to be using a recent feature of Ethereum, known as staking, as grounds for the recent legal campaign.\n\nA warning notice and a preemptive lawsuit\n\nThe Consensys complaint filed on Thursday reveals that the SEC earlier this month issued a so-called Wells Notice, which describes a formal letter warning the agency intends to sue a firm, and often leads to a settlement soon after. The complaint added that, in a related phone call, the SEC told Consensys that MetaMask was operating as an unlicensed broker dealer.\n\nAccording to Consensys, the SEC objects to MetaMask offering users a means to stake Ethereum on their behalf. Staking is a relatively new process for Ethereum, introduced on a blockchain-wide basis in September 2022, that replaced energy-intensive mining with a system of validators who pledge collateral in order to become a trusted validator.\n\nIn an interview with Fortune, Consensys founder Joe Lubin described as “preposterous” the theory that staking transformed Ethereum from a commodity into a security.\n\n“The act of staking is really just posting a security bond so you can get paid to contribute labor and resources to help operate the Ethereum protocol. Now they’re trying to turn that into some sort of investment contract,” Lubin said.\n\nThe SEC did not immediately respond to a request for comment from Fortune about the lawsuit or on the agency’s view of the legal status of staking.\n\nLubin also stated that Gensler’s legal position appeared to be an attempt to halt the overall growth of crypto, and to justify the SEC blocking pending applications by companies to launch spot ETFs for Ethereum following the huge popularity of Bitcoin ETFs.\n\n“They are trying to regulate a technology on its merits, which the SEC shouldn’t be doing. They’re trying to stifle certain kinds of innovation. And they’re trying to do that because probably they see Ether spot ETFs as a floodgate that’s going to bring a lot of capital into our ecosystem,” said Lubin.\n\nThe Consensys lawsuit was filed in Texas, which dovetails with a broader strategy of the crypto industry to tee up eventual legal appeals in the U.S. Court of Appeals for the Fifth Circuit. The circuit has shown greater skepticism of agency actions than other courts and, if the industry can win a favorable judgment, it would likely tee up an appeal for the Supreme Court.\n\nIt’s unclear for now what will happen in the event the SEC chooses to file a lawsuit on its own to follow up on the Wells Notice instead of resolving the issues with Consensys in the Texas court.\n\nThe complaint itself asks the court for a number of additional rulings beyond declaring that Ethereum is not a security. Those include declarations that MetaMask is not a broker dealer, and that the SEC is violating the Administrative Procedure Act and the Constitution’s guarantee of due process. It also seeks an injunction barring the SEC from conducting any investigations on the premise that Ethereum is a security."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFB5cnVpUTNhZzM0c0MzMk9BU2dwOFM5VTVqREJQSW5VbUJWeHR2aGV1N2JrbDdlTTVMSlJIWDZwOGdHOXNpUnlCRkFVazFHM2pNblBlNjVVUy1fR1BzMmZ1WVFWTnd5RUZydVIwUkVXVGZJOHJXc1pn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Consensys sues SEC over Ethereum classification, claims regulatory overreach - Crypto Briefing",
        "content": "The lawsuit from Consensys is demanding that SEC affirm that ether is not a security.\n\nShare this article\n\nConsensys, the crypto firm backing projects critical to the Ethereum ecosystem, has filed a lawsuit against the SEC, alleging the federal agency of regulatory overreach.\n\nThe filing was submitted in a Texas federal court. According to an initial report from Fortune Crypto, the complaint aims to preempt an impending SEC lawsuit against Consensys involving MetaMask, a major crypto and Web3 wallet that the firm has incubated and supported for years. The filing also seeks a court ruling that would declare that Ethereum’s native token, Ether (ETH), is not a security.\n\nConsensys’ 34-page legal filing argues that the SEC’s efforts to assert jurisdiction over Ethereum are both illegal and a threat to the broader blockchain technology landscape. The complaint states:\n\n“The SEC’s unlawful seizure of authority over ETH would spell disaster for the Ethereum network, and for Consensys. Every holder of ETH, including Consensys, would fear violating the securities laws if he or she were to transfer ETH on the network. [This] would bring use of the Ethereum blockchain in the United States to a halt, crippling one of the internet’s greatest innovations,” the filing stated.\n\nThe lawsuit comes as SEC Chairman Gary Gensler has continued with an aggressive enforcement campaign against leading firms in the crypto sector such as Uniswap Labs. The actions involved a wave of subpoena seeking documents related to their interactions with the non-profit Ethereum Foundation. This approach has drawn criticism from many in the crypto industry, who argue that the SEC has failed to provide clear regulations or create a regulatory framework that acknowledges the unique characteristics of blockchain tech.\n\nEthereum’s legal status and classification as a security has been a matter of contention between regulators and the crypto industry. The SEC’s previous stance was that the Ethereum blockchain’s tokens, like Bitcoin, are not securities and as such are outside its purview. This stance has not received any further clarification from the federal agency. Fortune’s coverage of the matter cited how Gensler is now moving to use Ethereum staking as a precedent to pursue the legal campaign against crypto.\n\n“The act of staking is really just posting a security bond so you can get paid to contribute labour and resources to help operate the Ethereum protocol. Now they’re trying to turn that into some sort of investment contract,” Consensys founder Joe Lubin said.\n\nAccording to the Consensys complaint, the SEC issued a Wells Notice earlier this month, indicating its intent to sue the company and alleging that MetaMask was operating as an unlicensed broker-dealer. The SEC’s objection appears to stem from MetaMask offering users a means to stake Ethereum on their behalf, a relatively new process introduced in September 2022."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNNG1sT2V0aW5HQm00SVExYnQtMERtZENKb0pTT0RzMW1KQTdlTTRSU3l6eXI1UWtHTGlhZVR6bVl2VkhuWldYNkVsZzlYNUtGMjlEY1VGd0QzYnRwamtoLTlwWnhOaVNkbktlMmNCbHNYbDh3NEZrOTV6RUVzcEkwc2ZBRTQ1czgtbHVIVXpZamV0QXQtUG9RSjZaVEtDclV3bHVGMzUwVmxORzZRVE8yTNIBtgFBVV95cUxOb1lUSVRIS0R0ZkxJQVBiaFdiRExnV25NLWJzQ3hVdHFBdDlvQVpnaklpeU1Gcno1bFZ1SDZxUGpLLUVkenZtWG9rSi1rWklvODdYMGphV2o0YWZrcXpMeS01VHlWcXRteW9zTnlJXy1rZDB1X2hYSVRuZV82bWx5T3BOXzZ4Szhxams0UUJSQ0gtZjZuVHhKakxEVTlXTVR4ZmNteDlUX2dPODR5VHNVSzU0aVJfdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Consensys Sues SEC Over ‘Unlawful Seizure Of Authority’ Over Ethereum - CoinDesk",
        "content": "The company wants a federal court to declare that ETH (ETH) is not a security, any investigation of ConsenSys based on the idea that ETH is a security \"would violate\" the company's fifth amendment rights and the Administrative Procedures Act, that MetaMask is not a broker under federal law, that MetaMask's staking service does not violate securities law and an injunction against the SEC investigating or bringing an enforcement action tied to MetaMask's Swaps or Staking functions."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxORFh4aHZkTnY1X2xWZUFleXBQR1V0U2pyeHZFSUtHQkowMXU4S3BKUFJNd3dkNGNCSXByZ1VrSE9HOENkb0c0UVpQa2ZnMTJDWHhlYVhfTnRfSFVDU2FVNzMtaUVwZlJmU0ktZHR6X1pNQ3d3WHQ5MTFUX2hkQkNQbVpUeV8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong to debut Bitcoin and Ethereum ETFs on April 30 - Yahoo Finance",
        "content": "Hong Kong is set to launch its inaugural spot Bitcoin and Ethereum exchange-traded funds (ETFs) on April 30, following approval by the Securities and Futures Commission (SFC), Bloomberg reported.\n\nThese ETFs, managed by Bosera-HashKey Capital and China Asset Management (ChinaAMC), will provide a regulated investment channel for cryptocurrencies, aiming to attract both retail and institutional investors.\n\nThe ETFs will utilize an in-kind creation model, allowing for the direct exchange of cryptocurrencies for ETF shares, a method not currently used in the United States.\n\nThe introduction of these ETFs is a strategic move by Hong Kong to cement its status as a digital asset hub and capitalize on the increasing global interest in cryptocurrency investments.\n\nIt follows the approval and launch of spot Bitcoin ETFs in the world’s largest economy, the U.S., which led to a record-breaking surge in cryptocurrency prices.\n\nBitcoin has reached a new all-time price record of US$73,737 since the ETFs launched in the U.S. in January.\n\nIt traded at US$65,044 at 1:30 p.m. ET, down 2.5% on the day. Ethereum is down 1.4% at US$3,182, according to CoinGecko data."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQVmc4TTViSVZ3dHRFR3p5THM1S05FT0lwUVhkQnhKVlUwdTBMRGJsS3lQdEdDSVhRQUVuV3YtdGdMeVpPcGJJMFZ1cWR2bkFPOHhuRzBNZmhDaFg5bDBuNWhENjl3eXYxN2g5cWotdVJZa1pRRHE0bFFuV183VmlYdlhWZVBTQzB5NHMxS0ZYRVllanJWVGNsWWtJVjZHRk95QmxfazFKeE9vdEZGaTdka2lJWW5jaE9xOW13dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Why SEC Delays Put The May Ethereum ETF Deadline In Doubt - Benzinga",
        "content": "The fervor surrounding Ethereum ETH/USD exchange-traded funds (ETFs) continues to build, particularly after the successful launch of multiple Bitcoin BTC/USD ETFs earlier this year.\n\nHowever, the path to approval for Ethereum ETFs faces continued regulatory scrutiny, with the U.S. Securities and Exchange Commission (SEC) engaging in a detailed review process with prospective issuers.\n\nGrayscale Intensifies Efforts with Revised S3 Prospectus\n\nDespite facing regulatory headwinds, Grayscale, a leader in digital currency asset management, has not relented in its push for a Spot Ethereum ETF.\n\nThe firm manages approximately $10.87 billion in its Ethereum Trust ETHE and has recently updated its registration through an S3 prospectus, aiming to elevate its ETHE to the NYSE Arca.\n\nThis filing is a critical move to transition the trust into a more accessible ETF format for investors.\n\n“Today we submitted new regulatory filings that would further expand our product suite,” Grayscale remarked, reaffirming its commitment to providing investors with access to Ethereum in a regulated framework.\n\nThe decision from the SEC, however, has been deferred to June 11, 2024, as the commission requires more time to consider the complexities of such financial products.\n\nAlso Read: Bitcoin Spot ETFs Net $31.6M Inflows As Hong Kong Readies For ETF Launches\n\nBlackRock Maintains Course Amid Regulatory Uncertainty\n\nSimilarly, BlackRock continues its pursuit of an Ethereum ETF, having amended its 19b-4 application. However, the outlook from analysts remains cautious.\n\n“The likelihood that this would expedite an approval is slim to none,” stated James Seyffart, an ETF analyst from Bloomberg Intelligence, indicating only a 25% chance of a favorable decision by the previously anticipated May 23 deadline.\n\nThe hesitance from the SEC has led to broader concerns in the financial community about the likelihood of Ethereum ETF approvals in the near term.\n\nAnalysts from JP Morgan have estimated the chances of approval by the May deadline at no more than 50%.\n\nIn contrast, GSR’s analyst Brian Rudick has notably reduced the probability to 20% from an initially optimistic 75%.\n\nIndustry Reaction to Delays\n\nThe ongoing delays and rigorous scrutiny from the SEC have sparked significant commentary among industry specialists.\n\n“It looks like a final nudge to try and get the SEC’s attention, although most likely in vain,” said ETF specialist Eric Balchunas, highlighting a general sense of pessimism that has persisted since the initial campaigns for cryptocurrency ETFs.\n\nBenzinga's Future Of Digital Assets Event\n\nAs discussions and developments around Ethereum ETFs continue to unfold, they will undoubtedly be a topic of focus at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Binance Founder Changpeng Zhao Apologizes, DOJ Pushes For 3-Year Sentence\n\nImage: Shutterstock"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNcDZSWGlNalVSSUg2OUoxQlphQ2ZEcWRVb0d1WWRVN0NoT1cwUmt2MFVqOXNiTkFxRFpSQl9rUjBEYjlxS3MtQTZ2eXpXWVNhOGNYRUpRSjhfb3NVMUdzZE9lSkZVRDhJMi13NEZldmx2ZHhycGVuZElRSHRUcFpvckM2QUpqTkJ3SDg0eUpHSdIBlAFBVV95cUxNNHd2a2UzdGl1cVpkSXRiTkJmdjJlMXRaZ3o4cWdLaXdCWDEyTDR6MHlreTMycmctR1dadFZmZ0pXVzAwbUlzT2Vkemh0bERtUEZJLTFrS19FWktqalRfa29LY1h0T2tZTm55X3lWV2c1cXQ5MVBPVS1TcWxYVG9taHFtWEZRR0FDODkyZDNlcmxnZWI0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Nearly $500 Million In Ethereum Transferred to Justin Sun-Linked Wallet - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent development on the cryptocurrency market, approximately $500 million worth of Ethereum (ETH) has been transferred to a wallet linked to Justin Sun, the founder of TRON. According to a tweet by Lookonchain, a prominent crypto analyst, it appears that Sun has withdrawn 7,128 ETH, equivalent to $22.34 million, from the Binance exchange.\n\nAdvertisement\n\nThis transaction was completed earlier today. Moreover, Lookonchain revealed that the TRON founder has purchased a staggering 154,570 ETH, valued at $492.23 million, at an average price of $3,177, since April 8. The significant movement of Ethereum by Sun has not only drawn attention to his trading activities but also underscored the bullish sentiment that large Ethereum holders, or \"whales,\" maintain toward the cryptocurrency.\n\nPrice impact\n\nDespite Ethereum's recent lackluster performance on the market, with its price currently trading at $3,134, down 3.48% over the last 24 hours, whales like Sun continue to demonstrate confidence in its long-term potential. It is worth noting that while Ethereum's price has experienced a slight decline, its 24-hour trading volume has surged by 30.11%, reaching a total of $14.57 billion.\n\nAdvertisement\n\nThis increase in trading volume suggests heightened activity and interest in Ethereum among investors, even amid market volatility. Moreover, Justin Sun's recent transactions have further fueled speculation and discussion within the community about the future direction of Ethereum and the broader market. As one of the most influential figures in the crypto industry, Sun's actions often serve as a barometer for market sentiment .\n\nOverall, the movement of such a substantial amount of Ethereum to a wallet associated with one of the most prominent figures in the industry highlights the continued interest and investment in ETH despite its recent price fluctuations. The actions of major players like Justin Sun will undoubtedly remain a focal point for market participants."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQMDl0cThhenZFdnEzdGMwNTg5VFJMdFVzVEpsU2hXcy1pY0l1VHdUZVdoeTRQdGl1UG9zQUdOWWdWLXh6WmNSdVN3a1JsdU5Oc3dDdjFYWXoxaGRzV1hoUV9VNDN1Mko3bXRBZGwzcFZXUGRHZEhsY3BtQXoyQ2RaVVB5YzBYNHIzT0F3YlRVTU8tcG0xaUphY1NMcnBlQ1YzTHFLbHJGRHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Crypto Firm Sues SEC to Fend Off Oversight of Ethereum - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQdzAzYmx0OFkwbWp4WXVlbGJNMGw5VFNqMExSZ0NjY09FdExDMFFXN1h0ODJoUk01Qkt2R0lyS0NDYVlVUHlxNFZsbld4Q1Z3WGxLLXdVVU5JMmliSGUzb0EzdnFDb1dLXzZXa21UM0dYM2ZxaS1UYWh2UHNjRHBnc2pTekxkV04tQWJVVVFuazhRcFJJMmtLZDBn0gGiAUFVX3lxTFBpNnZfWFRRLXRqaHloLTZ0VVFxZ1V0cTNkc2VjTWtKUExKbU1pSEQ3b2x5aU5BWEZ0UkxSTi1zWDhnOVBSTTlwcEpzNVF2RXo3ZUp2RFVQc0MzZUw3cktaSzEweHVDWTZ3VEFVRFpfVGd4dlEzbFBObEwyaDN6UEtYTTA1Qzdlb0tPV0xSZVhzT3UxUVFvQlo1R2Z1blViODZ6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "BlackRock, Grayscale Amend Ethereum ETF Applications After SEC Delays - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlackRock and Grayscale have filed amendments to their spot Ethereum exchange-traded fund (ETF) applications after the SEC delayed its decision on multiple proposals for Ethereum ETFs earlier this week.\n\nIn an updated 19-b 4 filing, investment giant BlackRock introduced a proposed rule change to its plan to list and trade shares in the iShares Ethereum Trust. The change calls for creation and redemptions to be cash-based rather than in-kind, noting that \"the authorized participants will deliver only cash to create shares and will receive only cash when redeeming shares.\" Further, authorized participants will not \"directly or indirectly purchase, hold, deliver, or receive\" Ethereum as part of the creation or redemption process.\n\nThe update mirrors the structure of other Ethereum ETF applications, as well as the already approved U.S. spot Bitcoin ETFs.\n\nGrayscale, meanwhile, has filed an S-3 registration statement as part of its bid to turn its existing Grayscale Ethereum Trust into a spot Ethereum ETF. Because the Grayscale Ethereum Trust is already registered with the SEC, the asset manager could file a Form S-3 rather than a Form S-1.\n\nAD\n\nAD\n\nThe proposed Grayscale Ethereum ETF would list its shares on NYSE Arca, trading under the ticker ETHE.\n\nSimultaneously, Grayscale filed a Form S-1 registration document for a mini Ethereum ETF, also trading on NYSE Arca under the ticker ETH. The move mirrors its proposed listing of a mini Bitcoin ETF (BTC) with lower fees than its flagship GBTC product, which has seen billions of dollars in outflows since its launch in January.\n\nThe flurry of filings comes on the heels of the SEC's announcement yesterday that it would delay its decision on spot Ethereum ETF proposals from Grayscale Investments and Wall Street giant Franklin Templeton.\n\nThe SEC and Ethereum ETFs\n\nAfter the SEC reluctantly approved multiple spot Bitcoin ETFs in January, hopes were initially high that the regulator would swiftly rubber-stamp approval of spot Ethereum ETFs.\n\nAD\n\nAD\n\nBut optimism among ETF watchers has dwindled. Earlier this month, investment bank JP Morgan predictied that there was \"no more than a 50% chance of spot Ethereum ETF approval by May.\"\n\nBloomberg Intelligence, meanwhile, doubled down on its prediction that there was no more than a 25% chance of spot Ethereum ETFs being approved by the upcoming May 23 deadline. \"That said, this definitely tells me that issuers aren't giving up the fight,\" Bloomberg ETF analyst James Seyffart tweeted following the filings.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPMlJES0RnVXRHdFF5aFdYMGM3Tk1IbEVwSEZDbWstSWJWVFRVNmppaVB3Sk95UFNHNHBESnRwaW8tN1dfemFWdzBWVmZFVV9ndUVUTWJ6VTJOckdPWDZyQV9OU0hTZHctSEhxbExuUl9qeWFxdUN1dzBnbXZlWFFKWnlYd1p0U3E0ekJ3aUNKRGdSNHlER0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Grayscale Files S-3 Registration for Ethereum Trust - Markets Media",
        "content": "From The Markets Grayscale Files S-3 Registration for Ethereum Trust\n\nGrayscale Investments®, the world’s largest crypto asset manager, announced it filed a registration statement on Form S-3 (the “Form S-3”) with the U.S. Securities and Exchange Commission (“SEC”) to register shares of Grayscale Ethereum Trust (OTCQX: ETHE) under the Securities Act of 1933, as amended (the “Securities Act”).\n\nFollowing NYSE Arca’s filing of Form 19b-4 for Grayscale Ethereum Trust, Grayscale filed the Form S-3, another key filing requiring regulatory approval in the firm’s effort to uplist ETHE to NYSE Arca as a spot Ethereum ETF*. Grayscale Ethereum Trust intends to list the shares on NYSE Arca under the ticker ETHE, and issue shares on an ongoing basis upon approval of NYSE Arca’s application on Form 19b-4 to list the shares and effectiveness of the Form S-3 to register the shares.\n\nThe offering will be made only by means of a prospectus. A copy of the prospectus, when available, may be obtained by email from Grayscale Investments by emailing info@grayscale.com .\n\nA registration statement relating to the shares has been filed with the SEC, but has not yet been declared effective. The shares may not be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy the shares, nor shall there be any sale of the shares in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\n\nSource: Grayscale"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNaklGYWhaRlNBS2Z0bVItWTJCRk0xZEdSNkJzei16aDBkOVVlRzZlMDhJZEZHeDBxZDhDQnRSVUx1aFJsY0VhVVlfYWZnMEZIdTJ4WXZLRkU2UGlINjZIRHBEWEI4eWhneTc0SUxxMXp4aWtvdDYyazU4TXg1ckVJQjl1aWFlNnp6eE9JSnpRVzh0NERGRW9McktkWEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Stripe brings back crypto payments — this time on Ethereum and Solana - DLNews",
        "content": "Stripe users will be able to make and receive USDC transactions through Ethereum and Solana.\n\nThe company had previously discontinued its Bitcoin services in 2018.\n\nPayments giant Stripe announced Thursday that it would be resuming crypto payments in 2024.\n\n“After nearly ten years, accepting crypto is back on Stripe, coming this summer,” Jeff Weinstein, product lead at Stripe, said on X.\n\nThe company began its foray into crypto in 2014, though it pulled away in 2018, citing the volatility of Bitcoin’s network and the blockchain’s consistent technological upgrades.\n\n“Bitcoin has evolved to become better-suited to being an asset than being a means of exchange,” the company wrote in a 2018 blog post.\n\nStripe’s new crypto policy favours Circle’s stablecoin over Bitcoin.\n\nUsers will be able to make and accept payments in USDC, through the Ethereum or Solana blockchains, according to the company’s presentation. They will also be able to connect various wallets — MetaMask, Phantom, Coinbase Wallet, Rainbow — to their Stripe accounts.\n\n“Transaction settlements are no longer comparable with Christopher Nolan films for length,” Stripe co-founder and president John Collison said on Thursday. “And transaction costs are no longer comparable with Christopher Nolan films for budget.”\n\nStripe warms up to stablecoins\n\nStripe was also a brief supporter of Meta’s stablecoin project, Libra, in 2019.\n\nJoin the community to get our latest stories and updates\n\nThen, in 2022, it announced a payouts programme in conjunction with X, formerly Twitter, enabling creators on the platform to receive earnings in USDC.\n\nThe payments services company was valued at $50 billion during a $7 billion funding round in 2023. Stripe has recently mulled over the possibility of going public, though it stated in March that it was in no rush to do so.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Stripe? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNUXFjeHJiZUxabE1rdVFMUDhjN0lqaGJLUmZuOFh1X1BhcW5YYS1FTFVGSFlLdjlkaWJucERrVm0xWWZ2akdEcFIwSFFUQXRyZkY3bXZGTnVwVUNidk9IV3FOOTJBMlBReGw5eGg2Yi1PRmhMWUVNXzUyWm9DeEhIVF9CQUhkZFJsTUNETEpVTFJIUjVwbHBLU0Nkdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Enhancing Ethereum’s Resilience With Distributed Validator Technology - Messari",
        "content": "Stephanie graduated with a BSc in Psychology and began her career in startup operations and consultancy. Prior to joining Messari, she specialized in crypto technical communications. She was an early member of Messari's Diligence Team with ownership over product design, project management, and research quality. She produced and oversaw professional cryptoasset due diligence reports and helped scale the team to 20+ members. On the Enterprise Research team, Stephanie is best known for her work on validator decentralization, scaling, and the modular blockchain landscape."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPal9ZTkNqN19tMThHVWlLUTNkdVlVb0thQkhMVXdaSHh1Wk43ZjlfNVAyNndWM1JIMmZ6d0RIOXRWb3FRMDNZc0FjVHVKV1Mwb2RYZUZ0OE1vMjFnMTMwNEo4aGZua2hLS3FXejVHZENXVmN3R0F2OVQyOVRRU3Y0VWpibDFCNEVIYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "SEC postpones Ethereum ETF decisions - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) has postponed its decision on approving spot Ethereum exchange-traded fund (ETF) from Franklin Templeton, initially anticipated for May, to a new deadline of June 11.\n\nThe SEC also delayed the deadline for the agency’s decision on Grayscale’s spot Ethereum ETF application to June 23.\n\nMeanwhile, the SEC is soliciting public feedback on a revised ETF proposal from BlackRock, which now includes a cash redemption model, a change from the original direct Ethereum exchange mechanism.\n\nBlackRock’s proposal, initially submitted in November 2023, has been revised to better align with the SEC’s regulatory framework, mirroring the cash redemption feature of previously approved Bitcoin ETFs.\n\nThe SEC has maintained a cautious approach to cryptocurrency ETFs despite approving spot Bitcoin ETFs earlier in the year.\n\nThe Bitcoin ETFs, approved in January, have since provided investors a regulated trading vehicle for the cryptocurrency and have experienced a cumulative total net inflow of US$12.42 billion.\n\nThe potential approval of Ethereum ETFs would provide investors with access to the second-largest cryptocurrency by market capitalization, marking another step toward the integration of digital assets into conventional investment portfolios."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPT29ER3ZyaThwdzV6TlFHem13Z09TdmlnVTc5Z0JkQk5mMHJ5c040Y19OdkJXVFdVamRBSUlyU3ZveXNtaUNnOGxUNFRMa3FhbzhfbXo0NUN2RllpLTFkVi1nOEF6SFFEZFBVVWdFR2xpUHNGcEhLU05Sd255MXMwcmR1V2lnUE9yS2xpRXdXQWpMVXNtZ1ZpQWdzZHZBaWxPWENrcG5CWWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Movement Labs raises $38 million to build layer 2 blockchain on Ethereum with Facebook tech - Fortune",
        "content": "The blockchain race is about to get even more crowded: Movement Labs, a San Francisco–based software development team that’s building a layer 2 Ethereum blockchain, has closed a $38 million funding round, Fortune has exclusively learned.\n\nPolychain Capital, the crypto VC mega firm led by Coinbase alum Olaf Carlson-Wee, led the Series A, with participation from other digital-assets-focused investors including Hack VC, dao5, and Robot Ventures.\n\nMovement’s raise comes on the heels of more sizable rounds for other companies building new blockchains, including Monad Labs, which raised $225 million to build a layer 1, and Berachain, another layer 1 developer that recently announced a $100 million Series B.\n\nWhile the flurry of fundraises reflects a return to crypto-focused venture investments, the concentration of capital around blockchains also indicates an increasingly competitive landscape for companies hoping to build the next Bitcoin or Ethereum.\n\nIn an interview with Fortune, Movement cofounders Rushi Manche and Cooper Scanlon said they hope to differentiate Movement by building the first layer 2 blockchain atop Ethereum that utilizes Move, a programming language originally built by Facebook for Diem, its ill-fated stablecoin project.\n\nRead more: We’re Gen Z college dropouts who raised $41.4M for our blockchain startup. Here’s how we did it\n\n“We are delivering Move to the front door of Ethereum, and it’s this ecosystem that we’re serving,” Scanlon said. “A lot of folks who never wanted to leave Ethereum are, for the first time, going to be able to benefit from the security performance of a next-generation virtual machine.”\n\nAccording to Scanlon and Manche, Movement Labs will soon announce its devnet and aims to launch its mainnet in the late summer or early fall. The company also plans to launch its own token, tentatively named Move.\n\nThe Ethereum movement\n\nTo outside observers, the proliferation of new blockchains may seem like overkill—a view often shared by those in the industry. The first, Bitcoin, created the concept of cryptocurrency in 2009; the next major advance came in 2015 with the launch of Ethereum, which introduced smart contracts and the ability to build decentralized applications ranging from exchanges to money-lending protocols.\n\nDevelopers since then have been vexed by blockchains’ speed and cost, with a series of layer 2s built atop Ethereum, as well as new layer 1s such as Solana, promising faster and cheaper transactions. As evidenced by the recent congestion issues plaguing Solana amid its memecoin mania, the problems remain.\n\nTwo recently launched blockchains, Aptos and Sui, came with a new value proposition: Each boasted teams of developers from Facebook who helped build the crypto-focused programming language called Move. They also created the Move Virtual Machine, a kind of computer program undergirding a blockchain that would represent a next-generation update to the Ethereum Virtual Machine.\n\nAs Manche and Scanlon explained, while Move and its new virtual machine would come with better security and capabilities than EVM, most developers were still building for Ethereum, which had much stronger community backing. Even if Sui and Aptos could boast better performance, they couldn’t necessarily build a thriving new ecosystem.\n\n“Aptos and Sui raised a lot of money,” Manche told Fortune. “But they failed to execute on the community aspect.”\n\nMovement, in contrast, is building its layer 2 on top of Ethereum but while using the Move programming language and the MVM. It’s also building a tool called Move Stack, which will allow the Move Virtual Machine to be adoptable by other blockchain networks outside of Ethereum. Scanlon said they’ve been contacted by “quite a few” different blockchains, including Avalanche and Binance Smart Chain.\n\nTheir thesis is that developers will want to build using Move, which they say is more intuitive than other languages, such as Solidity, but still be part of the Ethereum community. “Everyone’s trying to bring Facebook on-chain,” Manche said. “We’re bringing the language that Facebook built to Ethereum.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQNDJZdkg5d0pTaDdYZDlfVmU5X0J4S1d0YmJLX1JQODZVQzRYZU4xWGI0eTFCaVlOQ0RrUkl2eFhqQWpDWllnVGxYcElIakhoTWUzc24tVWRoZEdad2JyVjJRbkdib2lhQUlVcTNlNmtMTUpaOGpacDg2SmkycXhGTHRobG40NlZ0SEpaVXFMQ2kxSkEwVHF30gGfAUFVX3lxTE5iTndBU29NeGdHdU1weDF2bFlYLUVzckJfdndhYzVOQXFfZW1yQThpTmlQWjU5T19BcUV3T0xoSWtBRnNpSEszTkE2RGtWOFh3Nlp0X0hUWGZsT1FVZ0YzQnZjTU5XZXpRUUhSR0x0RkZqQ1JNLXBkZWQ3VDlMQXFDUkRwREx5OGdmVjVEQTJZaTJyN1VCMjRyY2lBdUNxaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Spot Bitcoin and Ethereum ETFs to Begin Trading April 30 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHong Kong’s Securities and Futures Commission (SFC) has officially approved a number of spot Bitcoin and Ethereum exchange-traded funds (ETFs) in the region.\n\nThe ChinaAMC, Harvest, and Bosera HashKey Bitcoin and Ether ETFs were approved, according to the official SFC website. Bosera Asset Management’s ETF will be jointly managed with HashKey Capital, hence the firms' names being combined in the listing.\n\nEarlier this month, the securities regulator gave conditional approval—but with this official stamp of approval, trading dates have been set for April 30, confirmed by ChinaAMC in a release shared with Decrypt.\n\n“The spot Bitcoin and Ether ETFs offer retail and institutional investors a safe, efficient, and convenient means to invest in virtual assets in a regulated framework.” ChinaAMC’s head of digital assets and head of family office business Thomas Zhu said in a press release, “With the growing adoption of ETFs in institutional asset allocation and retail trading in Hong Kong, we expect robust demand for our offerings.”\n\nAD\n\nAD\n\nIt was previously confirmed that the ChinaAMC and Harvest Global Investments ETFs will use digital asset platform OSL as a “sub-custodian partner.” OSL told Decrypt that the conditional approval already represented “substantial completion of the regulatory vetting process” so they were working “intensively” to be ready for launch.\n\nIt is yet to be confirmed if investors from mainland China will be able to purchase these ETFs—which could see up to $25 billion enter the market. However, veteran crypto analyst Markus Thielen told Decrypt, this is unlikely for at least six months unless there are significant regulatory changes.\n\nChina has a long and rocky history with cryptocurrencies—effectively banning crypto multiple times. However, OSL’s CEO, Patrick Pan, told Decrypt the approval of spot ETFs in Hong Kong could lead to “more progressive” regulation in China and potentially cause a ripple effect across the region.\n\nDecrypt has reached out to HashKey and OSL for comment and will update this story should they respond.\n\nAD\n\nAD"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxONDJCbm5QcklXNlRpdW9JSlhuSUx6QlA1bDBQejZrRU5qbVkxZUpESENFdnJSbXFKVHU0MmlqbFVSN01uZV9fX0FpaGZ3NmRyTm4xMHhFSmpoUDV0bXVCUDdvU0JHUFR3ZXpiMjBydWdPSlFhQzlVeFZROGhLa0REWFE3SGd0VkZBamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Stripe Enables Merchants To Accept USDC Payments on Ethereum, Solana and Polygon - Yahoo Finance",
        "content": "Stripe Enables Merchants To Accept USDC Payments on Ethereum, Solana and Polygon\n\nPayments giant Stripe has announced its return to the cryptocurrency space after co-founder John Collison revealed their plan to allow merchants to receive funds in the form of the USD Coin (USDC) stablecoin. According to Collison, the “transactions instantly settle on-chain and automatically convert to fiat” and will begin as soon as this summer.\n\nBusinesses utilizing Stripe's technology will have the capability to accept payments made in USDC, the second-largest stablecoin in the crypto market and the sixth-largest cryptocurrency by market capitalization. By embracing USDC, Stripe aims to empower its users by facilitating global transactions and providing customers with easy, fast, and secure payment options, regardless of their access to traditional banking services or credit cards.\n\nJohn Egan, the head of crypto at Stripe, expressed enthusiasm about the integration of stablecoin payments, highlighting the potential to enhance merchants' reach and offer their customers a seamless payment experience. Stripe plans to initially support USDC transactions on the Ethereum, Solana, and Polygon networks, with additional network compatibility to be announced closer to the launch date.\n\nThis move marks Stripe's reentry into the crypto landscape after its initial foray in 2014 when it became one of the earliest major companies to accept Bitcoin payments. However, the company discontinued its crypto services in 2018 due to rising costs on the Bitcoin blockchain. Despite this setback, Stripe remained optimistic about cryptocurrencies as a whole."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQXzFxZEwtUVowRzlFNDhRSXRoM093MDU5Y0VtYlhBcDR4dlNLVWV2ZmpmTkZCdW9sYWJZMjh6bnF1MUtGdGV2M1dWSmZyQjYtUTI2aXk0U0pWYktnZnBuVGhvZF9KaVBmRkF5dHBrM0dpWThjMkJnMURYOGY0WFBaM2dCVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Approves Spot Bitcoin and Ethereum ETFs, Trading To Start on April 30 - Yahoo Finance",
        "content": "Hong Kong Approves Spot Bitcoin and Ethereum ETFs, Trading To Start on April 30\n\nThe Securities and Futures Commission (SFC) of Hong Kong has officially granted approval for several spot Bitcoin and Ethereum exchange-traded funds (ETFs) in the region. The approved ETFs include ChinaAMC, Harvest, and Bosera HashKey Bitcoin and Ether ETFs, as listed on the SFC website.\n\nAlthough conditional approval was granted earlier this month, the official stamp of approval sets the stage for trading to begin on April 30, as confirmed by ChinaAMC in a press release. Thomas Zhu, ChinaAMC's head of digital assets and head of family office business, highlighted the benefits of these spot Bitcoin and Ether ETFs, stating that they provide a regulated framework for retail and institutional investors to safely and conveniently invest in virtual assets. He also expressed expectations of robust demand for their offerings, given the growing adoption of ETFs in institutional asset allocation and retail trading in Hong Kong.\n\nChinaAMC and Harvest Global Investments, whose ETFs were among those approved, have confirmed that they will be utilizing digital asset platform OSL as their \"sub-custodian partner.\" OSL stated that the conditional approval signifies substantial completion of the regulatory vetting process and that they are working intensively to ensure a smooth launch.\n\nWhile it remains uncertain whether investors from mainland China will be able to purchase these ETFs, the potential entry of up to $25 billion into the market is noteworthy."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTlczUF8xeWlmeTRzbjlmZ3lrakR0VnBqN0JxY0VPMXExR19yQmhJc0JOeTgyYTdLUDdHeUZRd2QtMjVMczlIbktweDJzQ1plS2tmd1JyQVEzc05kY21DZnpLOTNSb0VveHlOeE1McjBSNE1iYTk3TG0xNnJDYWlieC1fdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC expected to deny Ethereum ETFs: Reuters - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) is expected to decline spot Ethereum exchange-traded fund (ETF) applications next month, according to Reuters.\n\nThe regulator’s anticipated refusal of Ethereum ETFs contrasts with its earlier sanctioning of Bitcoin ETFs, which have garnered substantial investor interest.\n\nAccording to four people who reportedly participated in meetings with the SEC, current applications are expecting rejections due to unfruitful discussions with the securities regulator.\n\nThe lack of engagement observed in these meetings, compared to those preceding the Bitcoin ETF approvals, suggests the SEC may demand additional information on the Ethereum market.\n\nThere are nine spot Ether ETF applicants, including VanEck and BlackRock.\n\nAnalysts speculate that the green light for Ether ETFs might be postponed until later in 2024 or even further, Reuters reported.\n\nMeanwhile, Hong Kong’s Securities and Futures Commission (SFC) has sanctioned the first series of Bitcoin and Ether ETFs, with trading slated to begin on April 30."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNWHJqc3VHUkljWU1NUjFra3RzYWJsRjZ5V19lUjZJYTB6WElOSTI2UzF3eGhsUld6dWxIR3dxblhIZXJZbDFBb3NTUVZZYzBaZktxN1B1enhnTHBLT2NKdWRUVy00M2ktdTdmYVFzeXlzaTRHTV81RVRNS2M4dGxwRFlCSk1lUTJVV2pVNk130gGTAUFVX3lxTE1kRDBwQ0hwVDNOS1Jsck9iRU4zX1k0dWF1ZWFrVkZNMExnd3llUjBnaERfQXZidHZqSmFISFVxM0htY09tTW5saHVPdnREdmt0VVhHUkNiaW5UdUIyb2tvMmRmRW54SEhYNUpFUmNENXhST3BmNGRrV2ZkaUlMQlVRTlFTa3VzRkgxMUo1YnNYY2xWbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum starts to rally post Bitcoin halving: Key insights - AMBCrypto English",
        "content": "ETH has risen 6% since the halving day.\n\nThe total number of accounts longing ETH on Binance rose since halving.\n\nBitcoin [BTC] halving seemed to have exerted significant upward pressure on Ethereum [ETH].\n\nThe second-largest cryptocurrency rose 6% since the halving day, exchanging hands at $3,250 at the time of writing, data from CoinMarketCap showed.\n\nUsing Santiment, AMBCrypto noted a slight increase in the total balance of top non-exchange addresses since halving. This suggested that accumulation by influential investors supported the price rise.\n\nWill the momentum sustain?\n\nAccording to prominent crypto market analyst Ali Martinez, $3,170 till $3.270 has acted as a strong resistance for ETH, with as many as 1.63 million addresses acquiring 4.45 million coins in this range.\n\nWhile ETH clearly broke the first barrier, a break above $3.270 would support the idea of a rally all the way to $3,650, Martinez predicted.\n\nFutures traders bet on ETH’s rise\n\nThe price rally also galvanized ETH’s futures market. Since the 20th of April, the total number of accounts longing ETH on Binance have risen steadily, AMBCrypto noticed using Hyblock Capital’s data.\n\nAdditionally, the percentage of whale accounts taking bullish bets for ETH increased from 71% to 74% since halving. This sort of justified the accumulation theory outlined earlier.\n\nThe market sentiment also tilted towards greed, which could increase buying pressure in the coming days.\n\nWhat do the technical indicators say?\n\nAMBCrypto examined ETH’s daily chart and its key technical indicators to gauge the next movements.\n\nThe Relative Strength Index (RSI) hit the neutral 50 level as of this writing, indicating a pivot towards the bullish side. Typically, the 40-50 zone acts as a good support during a bull market.\n\nHence, a sharp move above this area could support a sustained rally.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe Moving Average Convergence Divergence (MACD) crossed above the signal line, indicating the possibility of a price increase.\n\nHowever, to strengthen the bullish narrative, the MACD should cross above 0 in the days to come."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxONnowcWJMRWZndUQwazJ5YmZvTXpGSXdGYUhzVWhwVnNPYWw2U05lV29TSFZDQzVsbWpwQkhpaHU3SFZxZ1FTSDVRNndnYklSR2JvYTBHcnBDVVZhNG83NFZrQWF5YkdobFZlUnd4Nzc0OHdHZnVSaDlOOENrSXlybXVsVXNVd3dpR1EyX2lGVVJwWUNHY0ZmM0hrY2NUMUtNSW1QOEpxZXZVZjhSR1BYOWJhYWJQc0xfSUJyUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Polychain Capital leads $38 million round for Movement Labs to bring Facebook's Move to Ethereum - The Block",
        "content": "San Francisco-based blockchain development firm Movement Labs has raised $38 million in a Series A round led by Polychain Capital.\n\nVenture capital firms Hack VC, Placeholder, Archetype, Maven 11, Robot Ventures, Figment Capital, Nomad Capital, Bankless Ventures, OKX Ventures, dao5 and Aptos Labs also participated in the round for the Move programming language-based project.\n\nMovement Labs co-founder Rushi Manche could not disclose a valuation or the structure of the round but told The Block that “the substantial capital raised speaks volumes about the immense potential our investors see in our ability to revolutionize the Ethereum ecosystem.”\n\nAccording to a statement shared with The Block, the funding will support Movement Labs’ mission to bring Facebook's Move Virtual Machine to Ethereum. This project aims to address smart contract vulnerabilities and enhance transaction throughput via the Movement zero-knowledge Layer 2 blockchain.\n\n“This Series A funding enables us to aggressively hire top talent in engineering, research, product, business development and other key functions to execute our roadmap. [It] allows us to significantly scale our 40+ person team,” Manche said.\n\nMore specifically, Manche told The Block, Movement Labs would be expanding its presence in the Asia-Pacific region and making significant investments in building out its formal verification and security research team. “We are also doubling down on our zero-knowledge proof engineering capabilities to push the boundaries of scalability and privacy,” Manche added.\n\nMovement’s Layer 2 would expand the usage of the Move programming language beyond the well-known Aptos and Sui Layer 1 blockchains. Move was originally developed at Meta by a team composed of people from Facebook’s now-defunct Diem stablecoin project.\n\nIn terms of the timescale for its rollout, Movement is launching its public testnet, Parthenon, in the coming weeks and is aiming for a mainnet launch by the end of the year, Manche said.\n\nHow Movement's Layer 2 works\n\nThe project's team explained that Movement introduces a new, novel execution environment designed for over 30,000 transactions per second and leverages a fully EVM-compatible bytecode interpreter and Ethereum for settlement to bring parallelization and smart contract security to users who wish to remain within the Ethereum ecosystem.\n\nReentrancy attacks — enabling malicious parties to repeatedly drain funds from smart contracts by exploiting the code execution order — are one of the most common vulnerabilities in DeFi, according to web3 bug bounty platform Immunefi. Movement's Move-EVM aims to prevent attack vectors like reentrancy from executing, allowing developers to deploy code that is fully verified at runtime, the team added.\n\n“The two biggest issues in blockchain infrastructure at the moment are poor user experience and smart contract exploits,” Manche said. “My co-founder, Cooper Scanlon and I started building Movement to increase the velocity of innovation in crypto where the next Facebook can be built on-chain by developers who do not have the resources for large development teams and expensive auditors. Move addresses the shortcomings of [the Ethereum programming language] Solidity and we are bringing it to market in a crypto-native way.”\n\nMovement Labs is also developing the Move Stack, an execution layer framework compatible with rollups like Optimism, Polygon and Arbitrum. The Movement Labs team said that it intends to collaborate with projects across the Ethereum ecosystem “to scale smart contract execution for users on all networks and unify them with a shared sequencer implementation.”\n\nMovement Labs previously announced in September it had raised $3.4 million in a pre-seed funding round, with investors including dao5, Varys Capital, Blizzard Fund and Borderless Capital. Angel investors, including Eigenlayer’s Calvin Liu, Berachain’s Smokey The Bera and Avail’s Anurag Arjun, also participated in the round."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5ySXZ4dDdDMEE5Ml9QamZ4N3A2SFR2M1htWElEZlFsTFA0UUlHR3ZiYkE3LXVQVklkZ3EzTDdLZzEtSUhJWXZfeWx6Z3FOdXJCRVBKdVBDNUFhSzdieXVucGR3NEZ4Z1hRMGROTFkxbllrSWRqNnhUdmgzSEFrQdIBhgFBVV95cUxOcWVENEtYOERyV3ppcmNTYUJIekI2cWtQd1VqT3ZrTndUWHZSSFktbzhjdDhYZUFTU09nZ0RyRXRNdGVmT0s0SV9nY09PeXFfWEQ2dmo3clpaSm5VMG5TUmp5d1kwbVdYckl6eEtaWnRtY2FQSWNWdkF1WHZwTVNPcWJ5Tk9UQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Payments Giant Stripe Reenters Crypto With USDC on Ethereum, Solana and Polygon - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPayments processor Stripe is back in the crypto game after announcing today that it will soon allow merchants to receive funds in the USD Coin (USDC) stablecoin.\n\nStarting this summer, the San Francisco-based firm will let companies that use its technology accept USD Coin (USDC) for online payments. USDC is the second biggest stablecoin in the crypto space and the sixth biggest cryptocurrency by market cap.\n\n“We’re excited about empowering Stripe users to accept stablecoin payments, helping them expand their global reach and give their customers access to easy, fast, and trustworthy transactions even if they don’t have a bank account or credit card,” John Egan, head of crypto at Stripe, said in a press release.\n\nStripe will initially support USDC transactions on the Ethereum, Solana, and Polygon networks, a Stripe spokesperson confirmed to Decrypt, adding that “the final, more expansive list will be announced close to launch.”\n\nAD\n\nAD\n\nBack in 2014, Stripe became one of the first major companies to accept Bitcoin payments. Its crypto initiatives fizzled in 2018, however, when the company shuttered the option citing rising costs on the world's biggest blockchain.\n\nDespite dropping the service, the company said at the time that it was still “very optimistic about cryptocurrencies overall.”\n\nIn March 2022, Stripe edged back toward the crypto space by making its payment platform available for NFT purchases and other Web3 companies, promising fraud prevention features like know-your-customer (KYC) requirements. Last year, the company was rumored to be working with Twitter on payment features.\n\nToday, Stripe says that it will allow merchants to accept USDC and settle transactions on chain. Payments made in the stablecoin will automatically be converted into fiat for deposit into the merchant’s Stripe account, the company explained.\n\nAD\n\nAD\n\nStablecoins are a type of cryptocurrency that have a value pegged to another asset, like dollars or gold. They are designed to be less volatile than Bitcoin or other digital assets that notoriously go up and down in price.\n\nThese coins and tokens are typically used by crypto traders to quickly enter and exit positions in other coins or tokens without converting them directly into a fiat currency like U.S. dollars—epecially when access to such currencies is either restricted or prohibited.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOc0VwWENkamdsYnphR3FNdUlhOUhvTGVNYlJaMEhBZXdOYVh1Smowa0p1Rm5GOFRBSExwQ1hDLVo4ZG85alprNlp0Rm5ocG1wc2pab0hMc0Y2aFlTbWI5NnBYLWVfc0Y4WXRJbVZ3X1plQ1JkUDczdV9GTVYycDRTVURn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC Postpones Ethereum (ETH) ETF Decision, Solana (SOL) Climbs 12% as Network Issues Resolve, Furrever Token (FURR) Excels in $1M Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 25, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency landscape is currently witnessing significant movements and regulatory developments that are shaping the future of digital assets. From the SEC's delayed decisions on Ethereum (ETH) ETFs to the surge in Solana's (SOL) network performance and the charming ascent of Furrever Token ( FURR ) , the dynamics within the crypto market continue to offer both challenges and opportunities for investors and enthusiasts alike.\n\nSEC Delays Decision on Ethereum (ETH) Spot ETFs, Extending Market Uncertainty\n\nThe United States Securities and Exchange Commission (SEC) has again postponed its decision regarding the spot Ethereum ETF applications submitted by Grayscale Investments and Franklin Templeton, casting prolonged uncertainty over the introduction of these investment vehicles on U.S. stock markets. This delay continues the trend of cautious regulatory scrutiny in the rapidly evolving cryptocurrency sector.\n\nPreviously, in a landmark decision last January, the SEC had approved 11 Bitcoin ETFs, which led to significant market inflows and demonstrated a strong investor demand for cryptocurrency-based financial products. Encouraged by this development, Grayscale attempted to convert its existing Grayscale Ethereum Trust (ETHE) into a spot ETH ETF in October. Shortly after, in February, Franklin Templeton also submitted an S1 form, signaling a robust interest among financial giants to facilitate access to Ether, which ranks as the second-largest cryptocurrency by market capitalization.\n\nDespite the evident enthusiasm and forward momentum from these asset management firms, the path to regulatory approval remains strewn with obstacles. Industry experts, such as those from JP Morgan, express skepticism regarding the rapid approval of these ETFs, estimating the probability of a favorable outcome by the May deadline to be less than 50%. This skepticism reflects the SEC's meticulous strategy in assessing new ETFs, emphasizing the protection of investor interests above all.\n\nThe ongoing postponements prompt speculation about the broader impact on the cryptocurrency market. A denial of these applications might lead these firms to consider legal action against the SEC, highlighting the tense interaction between evolving financial innovations and traditional regulatory frameworks. Nonetheless, the final decision by the SEC will critically shape the market landscape, potentially easing the integration of crypto assets into conventional financial systems or presenting new barriers.\n\nStory continues\n\nAs developments continue to unfold, the cryptocurrency community and prospective investors remain keenly focused on the SEC's actions. The forthcoming decisions will be pivotal in determining the future of Ethereum ETFs in the U.S. and will significantly influence the accessibility of digital assets to mainstream investors, marking a critical moment in the integration of blockchain technologies within formal financial systems.\n\nSolana (SOL) Sees 12% Increase as Network Congestion Clears and Block Production Stabilizes\n\nSolana has shown notable signs of recovery today, successfully breaking past the $150 resistance level, with its price now standing at $157.08 according to recent CoinMarketCap data. This 1.81% rise over the past 24 hours marks a significant turnaround for the cryptocurrency which had been struggling with network congestion issues.\n\nThe recovery in Solana's network is primarily attributed to improvements in block production, which has returned to a normal rate with an average block time of two seconds. Recent updates from SolanaFloor indicate that all 409 transactions were confirmed successfully, signaling a robust rebound in network health. This improvement has led to positive speculation about an increase in demand for Solana's native token, SOL.\n\nSolana's network had faced severe congestion problems, causing delays and operational challenges for many projects within its ecosystem. Some projects were forced to postpone their launches, while others sought alternatives, moving their operations away from Solana during the congestion period.\n\nHowever, the situation has seen a dramatic change with the latest update on block production. This development might signal a new phase of growth and stability for Solana, encouraging both current and potential project developers about the network's reliability.\n\nThe resolution of these issues can be credited to the efforts of Solana’s development team, including cofounder Anatoly Yakovenko, who have been actively addressing the scalability challenges. A significant breakthrough was achieved earlier this month when a major fix was implemented on the testnet by the core development team, supported by additional enhancements from other validator clients such as Anza.\n\nThis collective effort has not only resolved the immediate technical issues but also contributed to a substantial 24.5% increase in trading volume, pushing it to over $3.14 billion. The Solana community and investors are now looking forward to a promising future, energized by the network's recovery and the potential for continued growth and enterprise adoption.\n\n\n\nFurrever Token (FURR) Emerges as a Delightful Contender in the Cryptocurrency Market\n\nFurrever Token ( FURR ) has made an impressive entry into the cryptocurrency market, quickly setting itself apart from more traditional memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) with its captivating, cat-themed design. Designed to resonate with cat lovers, Furrever Token offers a unique, heartwarming experience that infuses the digital currency space with a new level of cuteness.\n\nStrategically positioned for growth and long-term viability, Furrever Token allocated 65% of its tokens during the presale phase, successfully raising over $1,000,000. This significant achievement highlights the strong investor confidence in the project's vision and potential. Additionally, the decision to lock 10% of the tokens for the team underscores a commitment to the project's future prospects and stability.\n\nFurrever Token has also placed a strong emphasis on security and compliance. Comprehensive audits conducted by Securi Lab have bolstered its credibility, ensuring that the project meets high standards of safety for its participants. Beyond its financial attributes, Furrever Token has fostered a vibrant community atmosphere. Nearly 4,000 active members on Telegram contribute to a dynamic and engaging environment, turning the project into a movement that extends beyond traditional cryptocurrency dynamics.\n\nAs the presale phase draws to a close, anticipation is mounting for Furrever Token's upcoming launch on PancakeSwap. With the potential for returns up to 15X and a current trading price of $0.000648, Furrever Token is poised to capture both the hearts and investments of the cryptocurrency community. It offers a refreshing and cheerful alternative to conventional memecoins, appealing to both seasoned investors and newcomers attracted by its charming theme.\n\nFor anyone seeking further information or needing assistance with Furrever Token, official communications are advised to be conducted through the designated support channel at support(at)furrevertoken.com to ensure authenticity and avoid potential scams. This measure protects the community and maintains the integrity of the Furrever Token experience.\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOeXY5S0RiNDhITWk1c2o0dDd1RE1vTWIxTzYyRmFQX0hZU3ZzcG9HdFhSSWtZeElwMHB4LXdVci1pMjdsRzI1akRIQzBoSHdlSWxWMkF4S3F3R2lwUmd1czQ2cDVkYTRVbVFOd3MxbThieUV3MDgwMWRtU0ZzSnc4Zm1jN2NlVVJPN1lHZk9Mel9NTEhKdk84X0twSFg3X19scXhGeWNETjZWRWUyekVPcVJacjRUYlR0dktjNtIBwgFBVV95cUxPZUg1Y1lVWjhqRUo1b0JQZVNfMHZ1YW5nQllOMllQamJIWG0xSkFxX0dfekR4ZXpnb1NHRXBYRTlWT2M4OG9kSF9yckJUVHJZVVRGVWZ1TEJKUC01QnphdmNnY3JsNU1FQ0ZjMnA0eC1iN25KZXNZNnlkWU1QVDZEXzRORVd2Ny1VbnhsUjhkcWZCY1FUTEtiekN4Qzl1TGdONzZDcTJpZHJURUVBdkVFSlM4SG1zQjhFbHh2VllUT1ZEdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "New Security-Focused Ethereum Altcoin Goes Live on Coinbase and Other Crypto Exchanges - The Daily Hodl",
        "content": "Top US-based crypto exchange Coinbase is listing a new security-focused Ethereum (ETH) altcoin, along with other major platforms.\n\nCoinbase announced via the social media platform X that the crypto project Safe (SAFE) landed a listing on the platform as an “experimental asset.”\n\n“Safe is now live on Coinbase.com and in the Coinbase iOS and Android apps with the ‘experimental’ label. Coinbase customers can log in to buy, sell, convert, send, receive or store these assets.”\n\nThe platform uses the experimental asset label for tokens that pose certain risks such as price swings and canceled orders because of lower trading volume and availability.\n\nThe Singapore-based cryptocurrency trading platform Bitrue is also listing Safe for trading starting April 25th.\n\n“Bitrue will list Safe and open trading for the SAFE/USDT spot trading pair. Listing schedule:\n\nDeposit opening time: April 24, 2024, 10:00 (UTC).\n\nSAFE/USDT trading opening time: April 25, 2024, 8:00 (UTC).\n\nWithdrawal opening time: April 26, 2024, 10:00 (UTC).\n\nComing soon: stake GNO and SAFE, earn up to 20% APR!”\n\nSafe is also getting listed on the Seychelles-based MEXC exchange.\n\n“MEXC will list Safe in the ‘Innovation Zone’ and open trading for the SAFE/USDT trading pair. The specific timeline is shown below:\n\nDeposit: opened SAFE/USDT Trading: 2024-04-25 08:00 (UTC).\n\nWithdrawal: 2024-04-26 08:00 (UTC).”\n\nSafe is trading for $1.90 at time of writing, down 13.5% in the last 24 hours.\n\nSafe – formerly Gnosis Safe – is the governance token for the decentralized finance custodian Safe Protocol, which aims to make Ethereum accounts smart accounts for new use cases involving artificial intelligence, staking, gaming, payments and easier logins.\n\nSafe co-founder Richard Meissner says,\n\n“We believe that to grow this ecosystem in a sustainable way you need some governance, you need some consensus. And this is really where we see the Safe token can come in. And with it becoming transferable this is where it becomes possible to really do this because the Safe token represents the ecosystem, also new people can join the ecosystem, and the ecosystem can provide security on how certain services are running, on how certain modules, which is like this extension mode that we use for smarter contracts, like are they secure or not to give guarantees.\n\nNow that we’ve flipped the switch, now we can really start saying, Okay, let’s implement all of these things.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQZHJvSExxeHh0QjNnenRYOWFWVUxpR2FhU1NBWldvLTF2WGU5eHhMUjVmLUVIT3BMcXI5OHE4dnBHR3hOcmFET0lJM2tydGM1a0lnX0FuZWZQdFZ2Y2RFaHIwWW94b3JURG1XYWdfbERLbnlrZ3pwT3BCWWJ5dnZlM0tKU2RoajhIZ3A4MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC Sued Over Ethereum, Prosecutors Say ETH Isn’t A Security - Watcher Guru",
        "content": "Crypto firm Consensys is suing the SEC over Ethereum and is asking the court to declare that ETH is not a security. This case mirrors the Ripple Labs case against XRP, where the SEC was forced to admit that XRP is not a security. Consensys is one of the major backers of the Ethereum blockchain. The lawsuit was filed in Texas federal court on Thursday.\n\nJUST IN: 🇺🇸 Crypto firm Consensys sues SEC and asks court to declare that Ethereum $ETH is not a security. — Watcher.Guru (@WatcherGuru) April 25, 2024\n\nConsensys seeks to divert from an impending lawsuit by the SEC against them over the MetaMask Wallet. The 34-page legal filing features dramatic language arguing that the SEC’s efforts against ETH are illegal and threaten overall blockchain technology. The debate on Ethereum’s digital token, Ether, being a security has been a key argument for the SEC, especially with Spot Ethereum ETF applications pending.\n\nThe SEC’s unlawful seizure of authority over ETH would spell disaster for the Ethereum network, and Consensys. Every holder of ETH, including Consensys, would fear violating the securities laws if they were to transfer ETH on the network,” the complaint states. “This would bring [the] use of the Ethereum blockchain in the United States to a halt, crippling one of the internet’s greatest innovations.”\n\nAlso Read: Shiba Inu: Bracing for Bullish Trends? Exchange Reserves Hit 2-Year Low\n\nThe SEC Continues Its Battle Against Ethereum And The Crypto Industry\n\nThe SEC is currently pursuing an aggressive enforcement battle against the cryptocurrency industry. SEC Chair Gary Gensler has unleashed multiple subpoenas, asking firms for documents related to the Ethereum blockchain. As a result, many in the industry have responded negatively to these efforts, saying that the initiative violates privacy and has been totalitarian.\n\nAlso Read: SEC Expected to Deny Spot Ethereum ETF Next Month\n\nFurthermore, the Consensys complaint filed on Thursday reveals that the SEC issued a Wells Notice in early April. This describes a formal letter warning the agency intends to sue a firm. It often leads to a settlement soon after. The complaint adds that, in a related phone call, the SEC told Consensys that MetaMask was operating as an unlicensed broker-dealer. The SEC may follow up with a new lawsuit around the Wells Notice instead of resolving the lawsuit imposed by Consensys in court. However, their plan remains unknown."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNZU5xcjdRM09QdnNOUmJuTGFVd3dZMWtkVUFMcGZ3TEZLOF8wWGwzc0VCWm1MZmIyYjdWa0ZBWVRCMHU1czY2R3hwZEFISjlsR0tCT255ZGRxdDMwYWJkNXZwV1d6dU5KalpNZlBRTURfMXNVcWxWT3pyVFhMYlJfTDZLSVdueXhWR0pOV1lsRlpXblprTDNQaUNwQkh3RlBVSjlaVGg3Z182M3dzN2Uwa3dVb9IBuAFBVV95cUxPR2JJNWQ3Wm9OQVhkeGQ2NTBJZldGWVU1RGJMWFZDUTlCOFZnNk5DcGwwb1JyOTNlWnZKV3NOU3N2dElXYWludHJMMkswNHRtLVcxV0JPRi1WeXdfOFY3OUY0dERsQWZHUVFiOWh0M1dTQmFLVHR1eV9KQWtyd0lyOFhlQmJZdWs0dU5JTENlSEdvSVRmRm5YMkZwMlVOMjFMRGdadUxFZmNrYUQwMkhQWGV2OUpWUHNW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Whales Turn Bullish As Over $92,020,000 in ETH Leaves Binance: Lookonchain - The Daily Hodl",
        "content": "A handful of crypto whales appear to have made substantial Ethereum (ETH) purchases in recent days, an indication the largest crypto holders could be turning bullish on the second-biggest digital asset by market cap.\n\nThe crypto tracker Lookonchain notes that a whale wallet potentially belonging to Tron (TRX) founder Justin Sun withdrew 4,666 ETH worth $14.91 million from the top crypto exchange Binance on Monday.\n\nThe whale had already purchased 132,054 ETH worth $420 million since April 8th.\n\nA new whale wallet also withdrew 7,182 ETH worth $23.06 million from Binance over the course of the day on Monday, according to Lookonchain.\n\nAdditionally, a third whale wallet withdrew 11,892 ETH worth $37.77 million from Binance on Sunday and Monday, then went long on Ethereum by depositing ETH into the lending platform Compound (COMP) and borrowing top stablecoin USDT.\n\nThe crypto tracker also notes that a fourth wallet withdrew 5,181 ETH worth $16.28 million from Binance over the weekend and staked the Ethereum into non-custodial liquid restaking protocol Bedrock and the decentralized finance (DeFi) project Pendle (PENDLE).\n\nETH is trading at $3,215 at time of writing. The second-ranked crypto asset by market cap is up more than 4% in the past seven days but down nearly 7% in the past month.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNNFVwXzk2OXNDVS1uUUt3U21PZW1CMzg3QXVXd3l5Qy1LMlE2UTZvUEhLcTRYd1JuSzFPWkN1Q0p6MkI2VUZjWVdrNUp6UE5udENOaWlCU2RVNC1IZlZ4bk1xdWIxM1BUUGh3dThTUnVoQmRjMXExSV9RbTJhN2pZYy0wQm8zR08tck5RMmhfd9IBlwFBVV95cUxQbWhFZUxNMFJsVWRENGZxakloMHdhTUJLd1VpRF9kZ0RlTjRSRTJONEVIUFBOc010N2xjUG5pVFJuY3RHRjBwS3dQaHpUeXFaRl81Y282MWtxQ1g2N3BTbVdtWnByQ1NoTEVmWDB5ZWd4azNsbTlPUDc3VGNPcVZLcll1aFZ5YTZDZHROcFREcVF1OXZWSUc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "CryptoPunk Sells for $12.4 Million in Ethereum—One of the Biggest NFT Sales Ever - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYet another CryptoPunk has sold for an astonishing sum: On Thursday, an ultra-rare Alien Punk from the NFT collection traded hands for $12.38 million worth of Ethereum (ETH).\n\nPunk #635, one of just nine Alien Punks in the influential 10,000-piece Ethereum NFT collection, sold for 4,000 ETH this morning. The sale was facilitated by crypto art brokerage Fountain, with the piece going to an anonymous collector who has yet to reveal their identity.\n\nThe eye-popping trade comes just weeks after two other Alien Punks sold for near-record shattering amounts. In early March, an anonymous crypto trader bought Punk #3100 for $16.03 million worth of ETH, in the second-largest on-chain CryptoPunk transaction ever recorded. Weeks later, Punk #7804—another Alien—sold for $16.42 million in ETH, taking the (silver) crown as the second-most expensive Punk sale in history.\n\nThe largest CryptoPunks sale of all time took place in NFT heyday of early 2022, when a crypto startup CEO purchased yet another Alien Punk—#5822—for 8,000 ETH, worth over $23.7 million at the time.\n\nAD\n\nAD\n\nCryptoPunk 635, the Alien originally owned by Larva Labs and sold at the Christie’s Contemporary Art Evening Sale in May 2021, has just been acquired by an anonymous collector in a deal brokered by Fountain. We’re honored to have played a small role in this sale. Congratulations… pic.twitter.com/glisy3MZpv — Fountain (@Fountainxyz) April 25, 2024\n\nWhile those Punk transactions, and today’s, rank among the most expensive NFT sales of all time, they still pale in comparison to the all-time leader: \"Everydays: The First 5,000 Days,\" an on-chain work by the artist Mike \"Beeple\" Winkelmann that sold for $69.3 million at a Christie’s auction in early 2021.\n\nThe recent resurgence of mind-boggling price tags for CryptoPunk NFTs, however, appears reserved for that collection alone. CryptoPunks, arguably the first NFT collection to attract substantial value and relevance after their creation in 2017, appear to have maintained their position over the last two years as rare cultural artifacts.\n\nOther once-coveted profile picture (PFP) collections have struggled to recapture dominance since the collapse of the NFT market in mid-2022. The Bored Ape Yacht Club, for instance, has seen its assets' value shrink to a floor price barely above $40,000, according to data from NFT Price Floor. That’s down more than 90% from the peak USD price seen back in 2022.\n\nAD\n\nAD\n\nOther collections that previously defined the NFT landscape, like Azuki and Doodles, have similarly seen their price floors drop by over 50%.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQUWYweUpBTHNzWXNEeWtjcGNuQUFmNHlaU2tGc0RWUjVrMjk4dFRJdjBpWjdaamtrUVNIMkZLOEF4UnNodnZyY1l2X2lsd01Ld0QtM0ZvQmFFNDhfOFFzSzlhYlV3dmJ4THlmODl1ZmtRNHZZUnp2eXZfajJhRVJYckNPNjJqbTF2YWQ4V3h6MExHV21yM21ZT2NWMWN0eDd5aWJCTWtPUnVSMV9hVE1LUWQ1MllpS1dpc2pBZlQxazZOUEJoTFNZYS1TZWhQcnhPaVF0eQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Movement Labs Raises $38 Million in Series A to Bring Facebook's Move to Ethereum - PR Newswire",
        "content": "SAN FRANCISCO, April 25, 2024 /PRNewswire/ -- Movement Labs , a San Francisco-based blockchain development team, has secured $38 million in a Series A financing round led by Polychain Capital. The funding will support the company's mission to bring Facebook's Move Virtual Machine to Ethereum, addressing smart contract vulnerabilities and enhancing transaction throughput.\n\nMovement Labs Series A Funding\n\nThe investment round saw participation from prominent venture capital firms including Hack VC, Placeholder, Archetype, Maven 11, Robot Ventures, Figment Capital, Nomad Capital, Bankless Ventures, OKX Ventures, dao5, and Aptos Labs, demonstrating strong industry confidence in the Movement ecosystem.\n\nFounded in 2022, Movement Labs aims to tackle the prevalent smart contract vulnerabilities within the Ethereum ecosystem while introducing a novel execution environment designed for 30,000+ transactions per second (TPS). By leveraging a fully EVM-compatible bytecode interpreter and Ethereum for settlement, the Movement Zero-Knowledge Layer 2 blockchain will bring parallelization and smart contract security to users who wish to remain within the Ethereum ecosystem.\n\nBetween 2022 and 2023, hackers exploited smart contracts for over $5.4 billion, affecting major protocols like Curve and KyberSwap through common reentrancy attacks. Movement's Move-EVM allows Move and Solidity developers to deploy code that is fully verified at runtime, preventing attack vectors like reentrancy from executing. The team calls this the \"Integrated Approach\", where multiple modular elements such as shared sequencing, embedded formal verification provers, alternative data availability, and Ethereum settlement can combine to power one blockchain, enhancing security and performance.\n\n\"The two biggest issues in blockchain infrastructure at the moment are poor user experience and smart contract exploits,\" said Movement Co-Founder, Rushi Manche. \"My Co-Founder, Cooper Scanlon and I started building Movement to increase the velocity of innovation in crypto where the next Facebook can be built on-chain by developers who do not have the resources for large development teams and expensive auditors. Move addresses the shortcomings of Solidity and we are bringing it to market in a crypto-native way.\"\n\nIn addition to the flagship Movement L2, Movement Labs will introduce Move Stack, an execution layer framework that is compatible with many of the rollup frameworks from companies like Optimism, Polygon, and Arbitrum. The team's vision is to collaborate with other Ethereum players to scale smart contract execution for users on all networks and unify them with a shared sequencer implementation.\n\n\"While the core focus of most other rollup teams is scalability, Movement's key insight is that scalability alone is not why we are yet to see mass adoption. The MoveVM offers a developer experience that is intuitive and bug-resistant as well as highly scalable. By marrying these benefits with the network effects and base-layer security guarantees of the Ethereum ecosystem, we believe Movement can build a flourishing ecosystem that is home to a new generation of mainstream applications,\" said Polychain's Bobby Beniers in a statement.\n\nThe team had previously announced a $3.4 million pre-seed round in September 2023. Users will be able to interact with its network this Summer.\n\nFor more information about Movement Labs and a guide to participate in the devnet, please visit: movementlabs.xyz , follow on X @movementlabsxyz and on Discord .\n\nAbout Movement Labs:\n\nCo-founders, Rushi Manche and Cooper Scanlon, early builders in the Move ecosystem, founded Movement Labs in 2022 as the first integrated blockchain network, powering the fastest and most secure Layer 2 on Ethereum. Designed to pair smart contract security and parallelization with EVM liquidity and user bases, Movement is bringing the MoveVM to Ethereum through its flagship L2 and connected rollups with the Move Stack.\n\nMedia Contact:\n\n[email protected]\n\nVideo - https://mma.prnewswire.com/media/2396978/Movement_Labs_Fundraise_Video_Final.mp4\n\nLogo - https://mma.prnewswire.com/media/2397018/movement_logo_full_color_rgb_2000px_72ppi_Logo.jpg"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiogJBVV95cUxOTlR3NGVBMnJWbnFLZHc0ZjFEZ205ajBudVRPZ0dqbjlaMTlEWkFYSWwyR053SUNiRGFKQ01keWpQcXhfd1B0V2E0VmZ0b2Z5UGtNbUJ4aG51NUJrWVBkTkx2Ni1qX3AzbzlkQ243LVQ5cUR5VGE4UjJFVXJ1UzNSLVEtRDFWaGZyZkd1NlhWQW42TXJ3R18yVDJYQnZOcDY2U00wV1c1dVhNay1xZXhnR2E0WW5sU044VGt2QXVBU3pmTXIxSWZWZy1FVXVrZXhYclFzNkxQenZJVVZFRTlXWTFpbzFaSTRURGRCNGpnelhRZEdLVVU0dW1yWkFMYjBfakswTUs5OVM1Q1VaOTR5WE52T3VySjhBZXBCbGtYRFEwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Unlike Bitcoin's Case, Ethereum ETF Approval Chances Slim, Says Crypto Analyst, But 'People Are Underestimating The Strength' Of ETH Ecosystem - Markets Insider",
        "content": "Michaël van de Poppe, a notable crypto analyst, voiced doubts regarding the prospects of an Exchange-Traded Fund approval for Ethereum (CRYPTO: ETH). Additionally, he emphasized the resilience of the Ethereum ecosystem.\n\nWhat Happened: Van de Poppe took to social media platform X to share his views on the possibility of an Ethereum ETF approval. He indicated that the chances of approval are low, despite the potential for an upward trend in Ethereum’s value. He also emphasized the strength of the Ethereum ecosystem.\n\n“It’s still on edge to have one and I think people are underestimating the strength of the Ethereum ecosystem,” he wrote.\n\nThe chances for an ETF approval for #Ethereum are quite low, but that doesn't mean that we're going to have an upward run on Ethereum.\n\n\n\nIt's still on edge to have one and I think people are underestimating the strength of the Ethereum ecosystem. — Michaël van de Poppe (@CryptoMichNL) April 24, 2024\n\nSee Also: Melania Trump Launches $245 Customizable Mother’s Day Necklace, Buyers To Also Get Limited-Edition Solana-Based Digital Collectible\n\nWhy It Matters: The possibility of an Ethereum ETF has been a hot topic in the crypto world. The SEC’s continued scrutiny of Ethereum ETF proposals has cast doubt on the May approval deadline. This has led to a decrease in the market’s expectation of an ETF approval, with a prediction market assigning only a 16% chance of approval by May 31.\n\nNotably, the SEC issued a historic approval for a Bitcoin (CRYPTO: BTC) ETF on January 10, 2024, pushing Wall Street into the cryptocurrency age.\n\nDespite the uncertainty, investment bank Standard Chartered remains optimistic about the future of digital assets. The bank believes that the market is well-positioned for a rebound, even if the approval is delayed.\n\nMeanwhile, the Bitcoin and Ethereum ETFs in Hong Kong are projected to accumulate $1 billion in assets within the next two years, despite China’s ban on the underlying assets. This suggests a strong global interest in cryptocurrency ETFs.\n\nHowever, not everyone is optimistic about Ethereum’s future. A seasoned Bitcoin trader and advocate recently declared a pessimistic outlook for Ethereum, suggesting that the “ETH story is dying.”\n\nPrice Action: Based on data from Benzinga Pro, Bitcoin is presently trading at $64,535, marking a 0.44% increase over the past 24 hours and a 46.10% surge year-to-date. Meanwhile, Ethereum is trading at $3,170, with a 0.98% rise in the last 24 hours and a 34.74% increase year-to-date.\n\nImage Via Shutterstock\n\nRead Next: Dogecoin, Shiba Inu And Other Memecoins Fueling Mass Adoption Of Base’s L2 Network, Coinbase Exec Says: ‘They Are Going To Be One Of The Biggest Drivers’"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNOFZqNnNfRkdTN0JsTjZxdVBra0pTVUdrX0NzUGgtYnhPVVRETDNUM2lHQUhVd2VrNEhGNW9Wb3ZxRWpNb1QzV2pBMDF6TVVibUh6NjV6VmN6S3A1eW5zWG5xaTI5NmZzbF9Ock9TSG1DUUxGUHNSWjl2M3h1cTlmVVpCVE5rNEhWUXhfa2VoVXEyWlhMSTZDdnREcUtqTTdGeHFYNjZ2ZHhxbTRYejdYQ1JkYTJyT1pjamdrekhxdC1wMy1ndXF1Smh3MWVEZTg0WFpnZNIB2gFBVV95cUxQWlNxX2QwbXVKOTVyc2JqX2tfRXV6WDFLci1GOXlSVUJNQ1o4OE5ITHVJa1VfWGl3cjNlcGhSMV9weWVUNG92SHVXMllqZU1uc2hYMTZSX25SNGREWVlWSjU1Qm9WRlVtNjRjcE1zaU9pS3FsLTJHNlRiT0RwTEV3dFZEWGNSekVoMzFwbGxzY0plcGdSbnN1X0hNUUQ0WmJ4Qi0wM181VFNYVkFCWk1WSlBIU2JxcllZeHd5UXlUN0xzM2hCZzRod1NNR2Q1RnJCWjY1ejZmWDlaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Ethereum, Solana and Altcoins Approaching ‘Banana Zone,’ According to Macro Guru Raoul Pal – Here’s His Outlook - The Daily Hodl",
        "content": "Ex-Goldman Sachs executive Raoul Pal says the altcoin market cap is on the verge of soaring to new all-time highs (ATHs).\n\nIn a new video update, the Real Vision CEO says that the digital assets market could enter “crypto summer” within a month, when Ethereum (ETH), Solana (SOL) and other alts could have massive rallies.\n\nA “crypto summer” generally means increased prices, higher trading volume, bullish market sentiment, more network development and wider adoption.\n\n“It’s very normal for crypto spring for Bitcoin to outperform and then as we come into crypto summer that we’re transitioning into now ETH starts to outperform Bitcoin…\n\nWill it outperform Solana? I very much doubt it. Solana is earlier in the adoption curve so it means the percentage changes are larger.\n\nYou can see the start of crypto spring, which was the breakout of this pattern and the slight acceleration. That says we’re getting to warmer days of spring as it were. But really, summer happens when you break the previous all-time high in market cap and things go utterly bananas. So this [chart below is altcoins] excluding Ethereum, so this is the rest of the space, really starting to accelerate and sometime in 2024 we will hit an all-time high market cap of altcoins and this chart will go truly into the banana zone.”\n\nPal also predicts that the crypto market will have a “crypto fall” similar to the 2013 and 2017 cycles when the market extended rallies even higher. Many analysts believe that crypto runs in four-year cycles and divides the cycles up into four seasons of the year to explain the different phases.\n\n“Let’s talk about crypto summer just in very simplistic terms. Here is the chart of the seasons. So spring is green. We had a great spring this year. Summer is when a lot of the gains start to happen. Fall was tricky last time around. We got a stunted cycle. If you remember that kind of double-toppy style thing.\n\nIt was highly unusual. 2017, and 2013 were typical of the fall season. And so we don’t know how this one’s going to play out. I think it plays out more like 2013, 2017, but it’s all assessing the odds as we go. But right now this is the easy year, the summer.”\n\nPal predicts that crypto summer will begin in the next month to month and a half.\n\n“Very soon, like in the next month, next month and a half, we will start to hit the banana zone. And this is what happens when you hit the banana zone. Things get absolutely wild, which is the really magical part of why this is the greatest macro trade of all time is this part and it’s coming.”\n\nLooking at his chart, Pal suggests that during “crypto summer” Bitcoin (BTC) could soar into the six-figure range, reaching as high as $300,000.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/Zalevska Alona UA"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNWnVYMmNBalduSmFoQU9oVjRGaHBRVzlGNDlwdFIxeHBEX2NQV2xOQjl2ekoxU0tyUGN4a1B6bWRNTl84SWhSeUU3NHhabDJFZURndkVrc2hPSGNPaW41amU0MXFNR0JzazhfczQ2RGFmOHFMUVVrRHRDRkVvNG55MkVzdVpfQ2tiejhmdTE1bjlZSnVKaElXVmxDMVg0a2dJTHIybEhsbFBtNjhsNVRxQ01pXy1oVS16c0NWSVZhVlM0MERkTW1YYUtPM1V2ZEdzQVl1RE56Q3VpOGJDTEpyYm9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Approval Unlikely But 'Bad News Already Priced In': Standard Chartered - Benzinga",
        "content": "While investors looking for an easy way into Ethereum ETH/USD via ETFs might face a wait, investment bank Standard Chartered remains optimistic about the future of digital assets.\n\nWhat Happened: Despite revising their previous May timeline for US approval of Ether ETFs, the bank believes the market is well-positioned for a rebound, Coindesk reported. Prediction market Polymarket assigns only a 16% chance to a spot Ethereum approval by May 31.\n\nCrypto Headwinds And Silver Linings\n\nStandard Chartered analyst Geoff Kendrick, who had previously predicted a May 23 approval for spot Ether ETFs, highlighted several challenges impacting digital assets.\n\n“The U.S. Securities and Exchange Commission (SEC) has targeted decentralized finance (DeFi) by suing Uniswap, U.S. Treasury yields have jumped, Federal Reserve rate cuts have been pushed back, and BTC and ETH — as risky assets — have been pulled lower by the escalation of the conflict in the Middle East,” Kendrick stated in a research report.\n\nThis array of negative factors has tempered the immediate outlook for Ethereum’s integration into mainstream financial products.\n\nDespite these setbacks, Standard Chartered remains optimistic about the future of digital assets.\n\nThe bank reassures that the worst may be over for the markets, stating, “The bad news is already priced in for bitcoin and ether, and positive structural drivers are expected to take over again.”\n\nThey maintain a bullish end-of-year price target of $150,000 for Bitcoin and $8,000 for Ether, which were trading around $66,800 and $3,237 respectively at the time of the report.\n\nAlso Read: Mt. Gox Creditors See Repayment Light At The End Of The Tunnel\n\nWhy It Matters: The report also noted significant market adjustments, citing the largest daily liquidation of leveraged long positions in the Bitcoin futures market since October 2023, which occurred on April 13 in response to geopolitical tensions in the Middle East.\n\nThis event removed $261 million from the market, signaling a “much cleaner” market positioning moving forward.\n\nFurthermore, the initial surge in Bitcoin spot ETF inflows has slowed, influenced by macroeconomic factors such as rising U.S. Treasury yields and ongoing geopolitical tensions.\n\nWhile the first wave of ETF buying appears largely complete, the integration of these funds into broader macro funds is anticipated, although this transition may require some time.\n\nWhat’s Next: As discussions on the future of digital assets continue, Benzinga’s upcoming Future of Digital Assets event on Nov. 19 will delve deeper into these topics, exploring how shifts in regulatory and market landscapes could shape the trajectory of cryptocurrencies like Bitcoin and Ethereum.\n\nRead Next: Crypto Lobby Group Sues SEC Over New Dealer Rule\n\nImage: Pixabay"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNTUdxQ1hFRnE2eklyaGlBZE44eU9tXzdWREtXekRfaWwzcG5ma3VfblJQS0hGb3RSZkJiOERBSkNYcWVsZ1BCUDZvTmlhbjZ3Mk9mSWZtaDdCY2NvSjBIVzhfM1NiMnpMYUpPbm44bWRLV1FjdmMzeTktX09MM1dYdG1ZSHZTeGFzSmVwSlJ4UTZHbUtSam91Tm1hWdIBowFBVV95cUxNYjFRdkVHbVFCTUxMb3lLdlZmRUhlRV9fUjNVUkYySWswd2ZOV2huaVRIMzdjSU9aMURDc3NCNlpUcUNYMVl6YnRtWmpYVjFTdkI3ekVneGZUa3RRTExUSjBXY1B0QmF5SVhfQVZ4UWtaS21reVk4bkRSY1NCankwZmV5N0swUndlRm9NT21JRHBnSHQxamFCb19wU3FLckdtX1NZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "What Is Xai? The Rising Ethereum Layer-3 Gaming Network on Arbitrum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new gaming blockchain has entered the lobby in 2024: Xai.\n\n“Xai is built to enable open trade in the next generation of video games,” the official site says. In its quest to do so, the network aims to reduce fees, offer account abstraction to hide some of those pesky blockchain elements, and empower game creators in the process.\n\nThe layer-3 blockchain is developed in part by Offchain Labs, the original creator and primary developer behind the Ethereum layer-2 Arbitrum network that Xai is built on top of. And Xai is getting help from game developer Ex Populus, which will deploy the first games planned to launch on the network in collaboration with the Xai Foundation.\n\nBut what does this really mean? We’ve rounded up all you need to know.\n\nAD\n\nAD\n\nWhat is Xai?\n\nMany crypto users are familiar with the concept of layer-1 blockchains and layer-2 scaling networks built on top of them, but Xai brands itself as a layer-3 network. This is because it’s built atop Ethereum layer-2 scaling network Arbitrum.\n\nIn practicality, this means that Xai keeps Arbitrum’s core functionalities the same while tweaking certain aspects of the network for a more targeted experience intended for a specific use case. While Arbitrum is a general layer-2 scaling solution that can be tapped for all kinds of apps, Xai specifically caters to the needs of gamers and game developers alike.\n\nFor example, Xai offers account abstraction—meaning it’ll hide confusing parts from users—when it comes to the blockchain wallet and account experience. The network also provides developers with increased gas and contract limits.\n\nMost notably, the Xai site says that it “introduces parallel processing and advancements for enhanced scalability, efficiency, and cost reduction.” That’s on top of Arbitrum’s existing layer-2 approach, which handles transactions away from the Ethereum mainnet to do so at a lower cost and greater volume via its optimistic rollup tech.\n\nAD\n\nAD\n\nBy reducing fees and increasing transaction times, Xai aims to create a smoother gaming experience while embracing the unique elements that make blockchain gaming what it is—such as true ownership of unique, in-game items, as well as tokenized economies.\n\n“The cheaper and faster we can make things,” Ex Populus co-founder and CEO Tobias Batton told Decrypt, “the better experience we can provide users.”\n\nWhat is the XAI token?\n\nKicking off 2024 with a bang, 125 million XAI tokens (5% of the token supply) were airdropped to gamers, according to the Xai Foundation. The airdrop’s total value was nearly $70 million at launch, growing to $140 million less than a week later.\n\nThe XAI token’s primary purpose is to be used as the gas fee token on the layer-3 blockchain. But there are also potential benefits, as XAI tokens can be exchanged for esXAI (or escrowed XAI) tokens and staked to earn interest-like rewards.\n\nOnce you have staked your esXAI tokens, you're able to participate in staking pools. Coming in Q4 2024, you’ll also be able to participate in governance as well as gain “exclusive access” to special events and assets associated with projects on the Xai blockchain.\n\nWhich games are building on Xai?\n\nAll of this technical stuff is great, but a gaming network is ultimately defined by the games on it. After all, no one would buy a PS5 if it had no games. So which games are being built on Xai?\n\nWith Ex Populus as a key partner, the developer has committed its suite of games to the layer-3 network. Currently, we know two of the games that are in development by Ex Populus: rogue-lite auto-battler Final Form, and hover car action shooter LAMOverse. But the studio’s website also states that an open-world experience is currently in pre-production, with details still to be announced.\n\nOutside of this partnership, early this year it was announced that Crypto Unicorns and its related NFT games will migrate from Ethereum sidechain network Polygon to Xai. Crypto Unicorns NFTs have generated $35 million of trading volume. The switch was motivated primarily due to “challenges” that arose when operating a game on Polygon, the team told Decrypt, namely in the form of network gas fee spikes.\n\nAD\n\nAD\n\nAfter that, a prominent indie gaming curator called The MIX, or The Media Indie Exchange, said that it plans to launch over 100 games on Xai before the end of 2024. While what games will be launched on the network is yet to be confirmed, Xai said that “many” of the games are already on Steam and will be reworked to benefit from blockchain tech.\n\nThis means that it's likely that currently Web2 games are going to get Web3 functionality using Xai, which The MIX suggests will bear a “striking resemblance” to how Valve allows players to buy and sell Counter-Strike: Global Offensive in-game items.\n\nMost recently, Reboot, the crypto gaming protocol powering Pixel Vault’s flagship game BattlePlan, announced an alliance with the Xai Foundation to migrate the game to the network. Sometime this quarter, BattlePlan will move one layer deeper from Arbitrum Nova to Xai in an attempt to “enhance player experience.”\n\nHow staking works on Xai\n\nAs an incentive to keep users on the network and reward them for supporting its consensus model, Xai began rolling out staking across two waves.\n\nVersion one allowed owners of Sentry Nodes—which are responsible for monitoring and flagging blocks on the Xai network—to stake up to 25,000 esXAI they hold. Then, in April, version two was rolled out, which opened the gates to any holder of esXAI.\n\nNow, staking pools can be created by Sentry Key holders—the NFT is used to operate a Sentry Node to support the network—and then anyone can stake esXAI in the pools that have been created. Pool operators can determine the distribution of pooled network rewards, specifying the percentages allocated to themselves, Sentry Key-holding stakers, and standard esXAI stakers.\n\nXai also introduced a tier system where the higher the tier of a staking pool, based on the amount of esXAI staked, the greater the reward multiplier for the staked Sentry Keys.\n\nAD\n\nAD\n\nFor example, if 500,000 esXAI is staked, then the Sentry Key will see a 3x reward multiplier. This starts at \"bronze\" with no bonus reward, but climbs all the way up to \"diamond,\" which has a 6x reward multiplier.\n\nThe future\n\nXai is like an onion: It has layers. As a layer-3 blockchain, it attempts to improve on the layers that came before it to optimize the gaming experience. Peel back more layers and you find a robust token and staking system with governance in layers to come.\n\nOf course, the one layer that’s still a bit thin as of this writing concerns the actual games themselves build on top of the network. But based on the announcements thus far, it appears those games are coming.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOaUxVUVVWelhrQzEzb2dieTFJOEhhS2JqNXk1dXk1VWNIbG53X2tTWVp6bE9jcjg1eGlwdXF3VnJhamxmbmpNMks0dElfQnRhUDZWZEZsZ1JxTnBDTG9sdUJISG9Xcmk4OU91ZmIzRFV2eV9UTlM5SVZObmN6OWtNQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC Expected to Deny Spot Ethereum ETF Next Month - Watcher Guru",
        "content": "The US Securities and Exchange Commission (SEC) is expected to deny Spot Ethereum ETF approval next month, according to insiders. Indeed, a report from Reuters notes that the ongoing meetings between issuers and the SEC have dampened expectations, with rejection likely in May.\n\nThe report fortifies industry-wide expectations of Ether ETF rejections next month. That was first forecasted by Standard Chartered, and corroborated by insider testimony. However, the description of the ongoing meetings regarding the investment offering leaves little optimism of an impending approval.\n\nJUST IN: 🇺🇸 SEC expected to deny spot Ethereum ETFs next month, Reuters reports. April 25, 2024\n\nAlso Read: Hong Kong Bitcoin & Ethereum ETFs to Begin Trading April 30th\n\nSpot Ethereum ETF Approval Now in Doubt?\n\nSince the arrival of Spot Bitcoin ETFs at the start of the year, the market has awaited what assets could be next. The positive impact that BTC offerings have had on the market as a whole has led many to opine about what another ETF could mean for furthering the industry.\n\nHowever, such an approval has seemingly reached a critical point. According to a report today, Ethereum ETF approval is increasingly doubtful as noted by insiders with knowledge of the ongoing meetings. Specifically, they have assured that an approval is not to take place in the coming month.\n\nSource: Blockchain Reporter\n\nAlso Read: Ethereum ETFs To Face Rejection By May, VanEck CEO Claims\n\nHowever, that is all the more disheartening by the reports of discussion in meetings between the SEC and issuers. The report describes those meetings as “one-sided” with the agency not discussing “substantive details about the proposed product.”\n\nThose developments greatly contradict what took place before Bitcoin’s Spot ETF approval. The meetings in the lead-up to that decision featured “intensive and detailed discussions” between both sides. Subseuqnlety, it showed the seriousness of the SEC in finally reversing its position on the investment offering.\n\nThe positive taking place for an Ethereum ETF signals a far gap between the SEC’s willingness and issuers’ desire. Subseuqnlety, a plethora of issers have already re-filled applications amid yet another delay from the agency. These ongoing discussions should continue to describe the timeline of when an Ether ETF could see approval."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFA0THlQd1F5a0NVV3JnY2Rqa08zVHJjZlpBZmNPbWd4Z1JDc01Zcko3QkxzNlJJaEQ5aFA4NkVOR0h4dzd2Z2xqMGhuMGM4UW1oUEJ6aEg4d0JJRWY2WnlJTmFYWEF1elFMVEdNVUdGd9IBdEFVX3lxTE5uYlNKNmQ0eUpiWnFzNkFxTUVsY1JkbnZyMEl2aWI2dlNOVjNzM01Rb2R2VWdDTzVGN0RJX0k2Mmlha1kyTUpMM2VTdlo0MERvNzgzT2tvbmowUnpjN0U5VHpNNDV3RVJyeFFwV19NYWFyaG9C?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Breaking: US SEC To Deny Spot Ethereum ETFs – Reuters - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) to deny the much-anticipated approval of spot Ethereum ETF, as per sources familiar with the matter. The SEC’s mindset toward approving spot Ether exchange-traded funds was never clear as the SEC tries to classify Ethereum (ETH) as security and delays its decision on spot Ether ETF for several issuers.\n\nUS SEC to Refuse Spot Ether ETF Approval\n\nIssuers of spot Ether ETFs and other firms expect denial of their applications next month by the U.S. SEC after bad meetings with the securities regulator in recent week, reported Reuters on April 25.\n\nadvertisement\n\nBlackRock, Grayscale, VanEck, Ark Invest and other issuers have filed with the SEC to approve and list ETF tracking the spot prices of Ether (ETH), similar to spot Bitcoin ETFs. VanEck and Ark Invest are first in line for the SEC’s decision on May 23 and May 24, respectively.\n\nAccording to people familiar with the matter, the SEC and its staff have shown no interest in the spot Ether ETF and its potential. Four people who participated said the discussions were one-sided.\n\n“It seems more likely that approval will be delayed until later in 2024, or longer,” said Todd Rosenbluth, head of ETF analysis at data firm VettaFi, who is tracking the issue closely. “The regulatory picture still seems cloudy.”\n\nThe SEC is taking a similar stance against spot Ether ETF when Gary Gensler-led agency rejected spot Bitcoin ETFs for more than a decade. The Grayscale Investments’ win in a lawsuit against the SEC forced the regulator to consider spot Bitcoin ETF approval, but Gensler was still not interested in it after the approval.\n\nThe denial will be a setback for the crypto market as participants believe spot ETFs pave the way for rising adoption of crypto, as seen in spot Bitcoin ETF. Also, spot XRP and SOL ETFs can be expected if the SEC approves the spot Ether ETF.\n\nThe SEC has only disclosed one meeting on spot Bitcoin ETF, which was in March. The SEC and Coinbase met to discuss Grayscale’s application to convert its Ethereum Trust into spot Ether ETF.\n\nETH Price Fall on This News\n\nWhile Hong Kong regulator has approved spot Bitcoin and spot Ether ETFs and listing is expected on April 30, traders have responded immediately to the news of delay.\n\nETH price extended drop to over 5%, with the price currently trading at $3,097. The 24-hour low and high are $3,074 and $3,292, respectively. Furthermore, the trading volume has increased by 35% in the last 24 hours.\n\nEthereum futures OI has also dipped in the last 1 hour, with a 24-hour fall of over 1%. There are 3.49 million ETH futures OI worth $10.82 billion, at the time of writing.\n\nAlso Read:\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9YU3dRUlU0M01kNXg5TnZfVUkyMTZ1OFVrU1Y5bHJPcmhrWE9kMWdjbWQ3a0E2S29tNUxKSGpiUHJDQnRfcUJ6OWRfNFJSMVBzNlBzdXNKV0xhdnhsajlCYVR6RXBERkUwczhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Top 11 Ethereum Ecosystem Tokens You Need to Know (2024) - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNRGR1dG41d3A4NXZheG5mMHc4YW55b3U1bTFkX2pNSlB2Sng3YmRLem5Tdkttc0t0c1RwSzBNOTlXc1RmX2FXZldFU2xsWDhPYTRsemhHS2l2ZE5SNnlFOWtscllvdGVKaHpCUXVHMzJsRU5NSVFhUk1XNE0zdi1fVU1PWFotejVkSGRhcFlOR1VJalZMV1pqcXBKd3I1M2c5OXR2Yl9zSkpUYzRHM2tHb2dSQWVvRzE5VkZyLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Ethereum, Solana, Ripple on the Brink of Critical Breakouts: How to Trade Them - Investing.com",
        "content": "Cryptocurrency markets have experienced a downturn post-Bitcoin halving, marked by lower trading volumes.\n\nEthereum and Solana are struggling to break key resistance levels at $3,200 and $150, respectively.\n\nXRP remains volatile amid the ongoing legal battle with the SEC, facing hurdles at $0.52-$0.55 range.\n\nDespite a brief upward swing following last week's halving, cryptocurrency markets have dipped in the second half of the week. Lower trading volumes are characteristic of the post-halving period.\n\nAmong major altcoins, has attempted a comeback, nearing the $3,200 mark, but a clear reversal hasn't materialized yet.\n\nfaces a similar situation, battling to break above $150. remains particularly volatile as the ongoing SEC lawsuit against heats up.\n\n1. Ethereum Eyes Breakout After Correction\n\nEthereum's decline took a breather last week, finding support near $3,000. During the April 13-19 trading sessions, the daily chart suggests buying activity (reaction purchases) emerged around the $2,920 zone.\n\nThis coincides with the Fibonacci 0.618 retracement level of the Q1 rally, hinting that the recent correction might be over.\n\nHowever, ETH's week-long uptrend has struggled to overcome the $3,200 resistance due to low trading volume. In the past 24 hours, selling pressure has intensified, with $3,150 acting as a key hurdle.\n\nAnalysts warn that a daily close below $3,150 could signal a continuation of the downtrend. A potential weekly close under $2,920 could open the door for a further slide towards $2,600.\n\nConversely, a surge in buying volume that pushes ETH above $3,150 would be a significant breakout. This would signify an end to the downtrend that began in March and could pave the way for a return to the $3,600-$3,800 zone in the short term.\n\n2. Solana Breaks Support, Faces Downward Pressure\n\nSolana started April on a concerning note, breaking below the ascending channel it had followed since October 2023. This downward breakout came with significant trading volume, pushing SOL to an average price of $127 last week.\n\nThe recent price movement suggests a corrective phase for SOL. While the token has attempted a recovery since last week, it remains capped at an average of $158.\n\nThis week, the $139-$143 range becomes crucial support for SOL. Failure to hold this level could see SOL experience a significant decline, potentially dropping below $100 as the downward trend strengthens.\n\nDaily closes above $160 are essential to confirm a reversal of the downtrend. As long as SOL remains below this price point, selling pressure could push it further down.\n\nMaintaining an average of $140 would also be a positive sign, potentially slowing the decline.\n\nOn the upside, if SOL can establish a solid foundation at $160, the next potential targets could be the $180-$190 range.\n\n3. XRP Faces Volatility as Legal Battle Heats Up\n\nXRP's price has been on a rollercoaster ride this week, reflecting the ongoing legal battle between Ripple and the SEC. The market reacted negatively to Ripple's recent rejection of the SEC's proposed fine, halting the recovery XRP experienced last week.\n\nFrom a technical perspective, XRP dipped below its long-term upward channel earlier this month. While there were attempts to return to the channel last week, a significant resistance level emerged around $0.55, hindering further progress.\n\nThe long-term outlook for XRP presents another hurdle in the form of resistance at $0.52 (Fib 0.236). A weekly close above this crucial $0.52-$0.55 range is critical for XRP to reverse its current trend. Failure to do so could lead to a short-term decline towards the support level at $0.43 (Fib 0.144).\n\nLooking ahead, with Ripple's response submitted and the SEC's defense still to come, the XRP market is likely to experience increased volatility in the coming months. The final court decision is expected to be a major factor influencing XRP's price as we approach summer.\n\n***\n\nTake your investing game to the next level in 2024 with ProPicks\n\nInstitutions and billionaire investors worldwide are already well ahead of the game when it comes to AI-powered investing, extensively using, customizing, and developing it to bulk up their returns and minimize losses.\n\nNow, InvestingPro users can do just the same from the comfort of their own homes with our new flagship AI-powered stock-picking tool: ProPicks.\n\nWith our six strategies, including the flagship \"Tech Titans,\" which outperformed the market by a lofty 1,745% over the last decade, investors have the best selection of stocks in the market at the tip of their fingers every month.\n\nSubscribe here and never miss a bull market again!\n\nDisclaimer: This content, which is prepared purely for educational purposes, cannot be considered as investment advice. We also do not provide investment advisory services."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNSEhGQ1hSU2I2Sy1kVW1iY1NuMXVsYnBIeVpXT1Uwd3hTQThYd0FmZDlTNFFXZllvWEJQQ0NPTnV4UlYtdGFxanZpWk5EaW9aYm9hUG4yYWlCdjlkV3psRHEzOHAxX2pLV2c5MGlraU1lSVlNZ0R6dUoyM2V0R21HeVhha2wxbGl0X21nNjBxWW1kOUdPWGN5Rkx5di0tME50dmVXcldheFhpWVnSAbABQVVfeXFMUFB1QjBZM0lpTGVoSm45aWZSeVV1bWg4QXhrUG5LYW01a2xHaDZ4TWtVeDBnbGNYS1czajhmQ1hjU0pIaUFFY2ZjaVZ0ZVJ2Nmxmc19TUG5fNlBBMUdRMHBTd1NURGNLVGgtQjAwWTU4aDVmTUo2RGdqNjk2NlZmaWNBM2VBdzRxZ2Q4UmdPc1NDakpMaTVBZDV0Y0VmYkdpd3gzQ2N6c2JERlRTRWdZeVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Is ETH About to Plunge Below $3K or Will the Bulls Step In? (Ethereum Price Analysis) - CryptoPotato",
        "content": "After a period of consolidation and corrective movements, Ethereum’s price has encountered increased selling activity, leading to a slight decline toward the 100-day moving average.\n\nThe main question now revolves around whether Ethereum sellers will manage to break below this crucial moving average.\n\nEthereum Price Analysis: Technicals\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of the daily chart reveals that following an extended phase of corrective retracements, with the price testing the critical resistance region of $3.2K, the market experienced heightened selling pressure, resulting in a slight downturn.\n\nConsequently, the Ethereum price is now testing a crucial support level marked by the 100-day moving average at $3086. This range holds significance as it typically attracts considerable demand, potentially limiting further downward pressure from sellers.\n\nHowever, given the current market sentiment and recent price action, Ethereum appears to lack sufficient momentum and buying activity, increasing the likelihood of a new bearish trend in the short term. Nonetheless, an unexpected breach below this critical support zone could trigger a cascade effect towards the 200-day moving average at $2.5K.\n\nThe 4-Hour Chart\n\nA closer examination of the 4-hour chart reveals that following a period of sideways consolidation near the lower boundary of the wedge pattern, which aligns with the support region around $3K, the price experienced notable buying pressure, leading to a bullish reversal.\n\nThis intensified demand resulted in a significant surge towards a critical resistance region, encompassing the 0.5 ($3234) and 0.618 ($3324) Fibonacci levels.\n\nHowever, sellers regained control and halted the upward momentum, causing a renewed bearish downturn, indicating a notable bearish sign for the market. Nevertheless, despite the prevailing bearish sentiment, Ethereum’s price is expected to remain confined within the crucial range, bounded by support at $2.8 and critical resistance at $3.3, until a breakout occurs.\n\nSentiment Analysis\n\nBy Shayan\n\nWith Ethereum’s price failing to surpass the $3.7K level, investors may be interested in understanding the behavior of futures market traders.\n\nThe accompanying chart displays the 14-day moving average of the Taker Buy Sell Ratio, a metric that gauges the aggressiveness of buyers relative to sellers. Values above one signify buyer dominance, while values below one indicate aggressive selling pressure.\n\nAs depicted in the chart, not only has the metric failed to recover above one, but it has also been on a sharp decline over the past few weeks. Moreover, the ratio has recently been steadily decreasing, nearing its lowest point since September 2022. This downward trend is concerning and suggests that Ethereum’s bearish trend could last in the mid-term if current conditions persist."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNLUF2R2I5ekNIdlhlZzQ1RTNmVnotekdPS2s4ekt3bzlTWUxUWW1WYXFGSmFXWHpuUnRWYWJhMTBzeVZGNUNmaHBFVW81VVJ0RXlPdzh1QXowMDJrX3hEUWVPVXp1WFl4NHZvNXlhSVRnX1Y1TWVQSUEtel96R0lldFhNeVo4TktzY3piTlI5eXF4b25MNU51V0J3Q3dYUFBzc085SThqc1ZsdGFOU1g4R9IBtgFBVV95cUxQVDl6eDZ5akltc214b08xVllwSzU4SkpBNUtBN3g3dlNQdnVoTlZzZ085TVV6dFUzNEthbGh0a3YyTm5PNkdQSTZYblNmOTMxNnY2MXdfSFNCNzBPX3NKOWxBS3BJdjJIdzN4N09QeXBTTG1VOGd5RWV4ekVrQWk0cXJvV1FDWW9QeTVGelF2V040MURYYlpDaUxpRmFFZGRpcmV0cGdWV0N1SjJqY053ZURPZ1lnQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETH ETF Denial Jitters Trigger Sell-Off To $2,500? - CoinGape",
        "content": "Ethereum Price Analysis: The cryptocurrency market continues to face headwinds after Bitcoin halving — an event anticipated to impact the supply of the largest digital asset significantly. Ethereum, like Bitcoin price and other altcoins, reveals emerging weakness with investors expressing confusion by selling their holdings. The modest 5.7% decline in ETH’s value alongside BTC’s 4.5% reflects the generally bearish outlook across the market.\n\nEthereum hovers at $3,105 during US business hours on Thursday. The 32% surge in the trading volume side-by-side with the price drop reveals reduced risk appetite and investor willingness to close open positions. On top of that, a 5% correction in the market cap to $382 billion mirrors the precarious state of the crypto market.\n\nadvertisement\n\nThe SEC Set To Deny ETH ETF – Issuers Reckon\n\nThe optimism for a spot Ethereum Exchange-traded fund (ETF) gained momentum in Q1 after the Securities and Exchange Commission (SEC) approved a bunch of Bitcoin ETFs.\n\nSeveral potential ETH ETF issuers moved to file with the agency for approval to operate the products in the United States. Market sentiment on Ethereum improved significantly, with experts projecting a similar impact to the BTC ETF on the price of Bitcoin which hit a new all-time high of $73,837 in March, CoinGecko data shows.\n\nHowever, according to the latest report, the SEC could move to deny Ethereum ETFs. The report published by Reuters cited issuers of the ETF and other companies who said that the regulator is not eager to meet with them.\n\nSo far nine firms have filed proposals with the SEC to list Ethereum ETFs including VanEck, and ARK Investment Management. Spot ETFs track the price of Ethereum in real-time.\n\nThe SEC is expected to decide on the first proposals filed by VanEck and ARK Invest by May 23, 2024.\n\nBased on the report, communication with the SEC has not been substantive and mainly one-sided. Contrary to this, the SEC frequently met with issuers of Bitcoin ETFs before the approval in January where they discussed details related to the new investment offers.\n\nDue to the one-sided state of communication, potential issuers of Ethereum ETFs say that they expect the regulator to deny their applications.\n\nWhile the launch of Bitcoin ETFs was the main driving force, the lack of a spot ETE ETF may derail the ascent to new all-time highs. Moreover, the state of the crypto market is delicate with negative denial news likely to add to the selling pressure, triggering a sell-off to $2,500.\n\nEthereum Price Analysis As More Declines Linger\n\nThe Money Flow Index (MFI) below the 40 mark reinforces the bearish grip on Ether. In other words, there’s more money flowing out than into Ethereum markets, exerting more pressure on the price which is currently 24% below the 2024 peak of $4,089. The token also sits below two bull market indicators, the 20-day Exponential Moving Average (EMA) and the 50-day EMA (the blue and red lines on the chart).\n\nIf Ethereum price closes the day below $3,100 resistance/support, the chances of a flash drop under $3,000 will increase. The 200-day EMA (purple line) will provide support at $2,740, possibly preventing further losses to $2,500.\n\nNevertheless, the correction could flip profitable if Ethereum price gains momentum from the forming falling wedge pattern. A break above the upper trend line could encourage traders to buy ETH betting on a trend reversal toward the $4,000 mark.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNb3BGalRlSDJnVnRTbGZVT19IbjJCNUIwMnJpT3Fyei1oZENBRGdjQVEyZHdSTTdWUUpDZUpnZXNxQkVWcTU1Z1p2TTRjM3VXTktvQ3hHTzJTdTdabmNrWHlIb1l5a2xlcFF5U2M1VHlzTHV0d0JBcDMwRkFIZ3NlUHFZbi1OU0ZDQl9wMXFLZ1p5RXlDaEFGbzNUaklhbmhJ0gGmAUFVX3lxTE5tTGxzY1Q4eXd4S2NvSEdxOWRxZE1UT3o5SWFtb0hOUkV3VGt1cUxaSlU4QUpNaURiWGZEQTN0a2cwQjRJNEQ5NlZFRTNRS2dhdGhOSU9obzBhaFlqd2ppemstUTBHQzAtZEZad0lTUkw0NzEwa1V0SlFodnVWeFQ1azNORjBVUk1tTlN2TkVjSUlIai1aWjEtRjlQUkM2QldkZ0tVOVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Jumps As TRON Founder Justin Sun Accumulates 15K ETH, What’s Next? - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by global market cap, appears to have ignited a torrent of optimism among crypto market traders and investors globally today, April 24. As ETH’s price action illustrated a considerable rebound, followed by heightened whale activity orbiting the token, the eternal Solana rival garnered noteworthy investor attention today, with crypto market participants speculating about the token’s price action ahead.\n\nNotably, TRON founder Justin Sun, a prominent figure within the crypto realm, continued accumulating staggering amounts of ETH, per today’s on-chain data. Meanwhile, whale activity surrounding the token has been burgeoning over the past few days, with bullish sentiments swirling around ETH. Here’s a closer look at why Ethereum curates market optimism with whales buying the token despite its sideways trading over the past few days.\n\nadvertisement\n\nEthereum Accumulations Note A Spike, Fuels Market Optimism\n\nAccording to Lookonchain’s insights, a blockchain data analytics platform, the Justin Sun-linked wallet 0x4359 withdrew 15,389 ETH, worth $49.78 million, from Binance today, April 24, nabbing global attention. This massive accumulation by Sun underscored a heightened sense of confidence in the asset’s future, birthing immediate bullish sentiments for the ETH price trajectory ahead.\n\nIntriguingly, CoinGape Media spotlighted a plethora of ETH whale accumulations yesterday, weighing in on the token’s optimistic take on the market. Per the report, Justin Sun invested a staggering $1 billion in Ethereum yesterday, further anchoring the TRON founder’s confidence in the asset. This, coupled with the rising Ethereum whale accumulations, paints a highly bullish outlook for Ethereum’s price action ahead.\n\nAlso read: Crypto News: FTC Votes to Ban Noncompete Agreements in Employment Contracts\n\nEthereum Price Jumps\n\nAs of writing, the Ethereum token’s price has been noted to have gained 1.67% in the past 24 hours and is currently trading at $3,242. The ETH market cap sprung 1.58%, accompanied by a 24-hour trading volume upswing of 2.16%, amassing slight optimism on the token.\n\nThis price rebound showcased by ETH primarily aligns with the colossal accumulations recorded in the past few days, as mentioned above. However, derivatives data for the token signals reduced investor interest and market activity for the token, underscoring a potential downtrend for Ethereum in the market as of press time. Coinglass revealed a 0.39% dip in the token’s open interest, accompanied by a derivatives volume fall of 2.88%.\n\nThis painted an uncertain scenario surrounding ETH’s price action ahead, as bulls or bears may take over the token at any moment in the future. Nonetheless, with post-BTC halving optimism, further accompanied by significant whale accumulations, crypto market enthusiasts continue to extensively eye the token, hoping to see a rising price action ahead.\n\nAlso Read: Block Inc Successfully Wraps Up Bitcoin Mining Chip Development\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5kYVNqdHJGWERrYlNXOTJ3d2JpaWhoNGE0dTlJLUl1ZjltNm5KaHZyTWlycEFNLU9fU1VMS2FDbHlUR215aEFZcVVxbFdxUzUzTUdoUG9rVXZZcDNpMm9JeDROcTRDRUEtd3N3T2NaTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "An Overview of the Top Pending Ethereum Spot ETF Applications - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9mcEE0RGc4R09KRUdwUVIxREtTODBpUWhVM19ud2FGWGhPRU1lOGZwb2RiOW12UFZWTlZrLVNKQWRkM0tKUHprMHlHbVNNempDNlJ5Mjd2WFFPNTVnOS1adVhKb2VpV2lvSkVadHlBSTlJWXJaNmfSAXtBVV95cUxQUHphRnEzV3czMUUtcjVzMmhaVzVKc2FjaTlpZ0htWkwtQUtnS1dnM0ZHMElnSGxEd0RFWEtJZ0dHSHcxdXczcWx3ZXhOTlI3YnZTM3hqVVI0SHBBOTBFWUpzb2VZMjZscFd0YnhvZVktb0x4NmowQWdFaUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "NEAR hits $7.51 – Why Ethereum can be in danger - AMBCrypto News",
        "content": "Active addresses on the protocol were six times that of Ethereum.\n\nNEAR’s price might continue to outclass ETH despite the difference in developments.\n\nNot only has NEAR Protocol’s [NEAR] price beaten Ethereum [ETH] hands down in the last seven days, but it has also surpassed the blockchain on many other fronts.\n\nAt press time, NEAR’s price changed hands at $7.51, representing a 39.06% increase in the last seven days. ETH, on the other hand, traded at $3,171. This was a 6.02% decrease in the last 30 days.\n\nBut it did not end there. According to Artemis data, active addresses on the Ethereum blockchain were 406,200 as of this writing and had remained in the same region.\n\nETH is not the L1 maestro: Who is?\n\nFor NEAR, it was an entirely different story. As of the 7th of April, active addresses on the protocol were less than one million.\n\nHowever, data from the developer analytics platform showed that the metric was 2.3 million.\n\nNEAR operates on the same Proof-of-Stake (PoS) consensus as Ethereum. However, it seemed that users and developers alike preferred the chain abstraction stack provided by the former.\n\nApart from this, there are not many layer-1 projects that possess the kind of scaling power like NEAR. As such, users can make faster and cheaper transactions without waiting for the layer-2s on Ethereum.\n\nWith the kind of momentum, the protocol has shown, ETH might find it hard to match up to the token in terms of its price. Another catalyst fueling the token’s hike in the buzzing narrative around AI.\n\nThe result of this is an incredible surge in market cap. Some months back, the protocol’s market was not in the top 25. But as of this writing, the project is ranked number 17, with a market cap of $7.36 billion.\n\nWins for both sides on different ends\n\nFurthermore, the last 30 days have seen fees on the network jump by 51%, with an average of $42,000. While this might help NEAR surpass ETH’s market cap, it could drive its revenue very close to Ethereum’s.\n\nAnother metric AMBCrypto looked at was development activity. According to Santiment, development activity on NEAR Protocol was 27.98. This was a significant increase from what the reading was on 16 April.\n\nFor Ethereum, the metric was 52.91, indicating that code committed to the blockchain’s new features and security was more than NEAR.\n\nWith this data, NEAR might not be able to outpace Ethereum when it comes to public GitHub repositories. However, it might be a different encounter with their respective prices.\n\nRealistic or not, here’s NEAR’s market cap in ETH terms\n\nFor instance, ETH has been lagging for a while. If this continues in the short term, the price action might not be able to compete with NEAR’s growth.\n\nHowever, in the long term, the circumstances might change if ETH starts moving. But within the next few weeks or months, NEAR might continue to outpace Ethereum’s metrics on-chain as well as its price."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxPTFg3cTNZSDJra1FmdjFfVWxrM3dCTnNWcVNBVmtjVm5halNYSnJ5cmpyYUVNTF92WDNSTnV4cU5DNUVCVTg5d0NVTUZtZmFUdUFrcWtvNVE5ZTZqdHFsZUk4dXkwLXBvZ3VHRk5TdVJXZmMxOGM1T3ZaSmRpVEFBN3F0S0xNVUxoRVVMaVdjY3BaVWx1YnRtNnVMN2ZCSEFNNkZtd0VFZFNTTm1yRVg5SXRuUVlqNzUwWTJMaEl3a1pDdC1Ea3JlQUpOUEF3bmY0elVRbERvMVU4dHB0S2xOY09xSXhaTENIbmFiS28yUjJXNWV0R2RsR3Z4bHRxaTUweFd6UXhFWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: farmers tremble on Renzo, ezETH depeg to $700 - The Cryptonomist",
        "content": "During the night we had only a small taste of the impact of a potential collapse of Ethereum’s liquid restaking tokens: Renzo protocol’s ezETH experienced a strong dump, due to the lack of liquidity on DEX, dropping to 700 dollars.\n\nThe ezETH-ETH ratio has dropped to the threshold of 0.2, causing several positions in the leverage of airdrop farmers who had used the coin as collateral in money markets such as ZeroLend and Gearbox to be liquidated: in total, liquidations amount to 340 million dollars.\n\nThe reaction of Renzo’s competitors was not long in coming, such as Etherfi, which reiterated its superiority as a restaking protocol, as well as the disapproval comments from the Ethereum community criticizing the risks of this system.\n\nAll the details below.\n\nRenzo’s LRT Depeg on Ethereum: ezETH at $700 overnight\n\nDuring the night Renzo, a famous Ethereum restaking protocol, risked collapsing after its token ezETH lost its peg with ETH reaching a price of about 700 dollars.\n\nIt all started when, immediately yesterday’s announcement by Renzo regarding the launch of their governance token REZ on April 30th (with an attached Binance launchpool), many users started selling ezETH on decentralized markets.\n\nWe remind you that this liquid restaking token allows you to accumulate Renzo Points, which will soon be converted into REZ. The announcement by the Renzo team has therefore marked the end of the farming period and several airdrop hunters have preferred to sell ezETH to move to other projects.\n\nMassive sales have targeted the main DEXs where the currency is traded, leading to its devaluation due to reduced liquidity.\n\nThink that the ezETH ratio to native ETH has reached 0.2, when technically it should be fixed at 1.\n\nNow Renzo’s token has fully recovered the peg, still being traded at a discount of about 1%.\n\nThe consequences of the takeoff immediately made themselves felt: many “leverage farmers” who have exploited money markets like ZeroLend and Gearbox woke up scorched this morning with over 340 million dollars of liquidations.\n\nOn this kind of platforms it is indeed possible to put ezETH as collateral, borrow stablecoins like USDC, buy other ezETH with the stablecoins, and potentially repeat the cycle indefinitely.\n\nThis practice allows you to accumulate many more Renzo Points, as well as other points that make you eligible for further airdrops such as those of EigenLayer, Linea, Blast, ZeroLend etc.\n\nThe problem is that if the value of the collateral (ezETH) were to fall for any reason below the borrowed value, there is a risk of liquidating the entire staked portfolio.\n\nFortunately, this time the settlements were overall contained, and part of them were covered by Gearbox’s emergency fund.\n\nAnyway, the entire Ethereum community got quite a scare, as Renzo is one of the largest protocols for restaking, with a TVL of 3.4 billion dollars.\n\nI just analyzed ezETH depeg consequences for Gearbox. All passive lenders funds are safe, no bad debt was incurred ✅\n\n\n\n115 Credit Accounts were liquidated, 10650 ezETH were sold on Balancer pool. Liquidation losses of 25.77 ETH were automatically covered by internal Gearbox… pic.twitter.com/RxxQlAtgBk — 0xmikko.eth | Token 2049 🇦🇪 (@0xmikko_eth) April 24, 2024\n\nMeanwhile, according to what was reported by “Spotonchain“, there are those who took advantage of the discounted price of Renzo’s liquid restaking token to speculate on the markets, managing to earn over 193 ETH in just 2 hours of trading.\n\n\n\nWallet 0xaa1 (linked to “czsamsunsb.eth”) made 193 $ETH (~$600K) in only 4 hours after $EZETH (#Renzo Restaked ETH) lost peg!\n\n\n\nSo far, the whale has swapped 4,499 $ETH for 4,692 $EZETH since the depeg occurred allegedly due to poor liquidity in Uniswap 4 hours ago, now making 193… pic.twitter.com/oJmKTR6io5 — Spot On Chain (@spotonchain) April 24, 2024\n\nThe risk of “leverage farming” in Ethereum restaking: Etherfi’s immediate reaction\n\nThe practice of “leverage farming” in the context of airdrop hunters has been widely criticized by several users of the Ethereum community immediately after the incident with the token depeg of Renzo ezETH.\n\nGoing all in to generate as many restaking points as possible can indeed lead to significant financial losses as soon as the market goes into a downtrend or in case of flash crashes.\n\nLiquidation of ezETH positions on the money market. Source: https://twitter.com/DU09BTC/status/1783054456071868905\n\nIn addition to the personal risk (sometimes disproportionate to the potential return) that users take on by engaging in leverage farming, it is worth noting how all of this creates an unhealthy environment for Ethereum and its ecosystem\n\nMany Ethereum stakers who did not go on leverage, but simply locked their stake on Renzo in order to reuse the consensus stakes found themselves in the middle of an unpleasant situation.\n\nFurthermore, the impact of the liquidation, if it had been of larger amounts, could have affected the price of ETH itself\n\nFor the moment, the worst seems to be over and fortunately no major damages have been reported.\n\nezETH briefly depeg overnight and now everyone's shooting at the ambulance 📉\n\n\n\n📌 There's nothing safe about ETH restaking!\n\nYou play this game to make money, but for the lure of gain, some people add a layer of risk with protocols that allow them to leverage their position…… pic.twitter.com/VIoj6n2jVB — 𝗙𝗮𝘀𝘁𝗟𝗶𝗳𝗲 (@0xFastLife) April 24, 2024\n\nIn the midst of the storm, Renzo’s main competitor, the Etherfi protocol, took the opportunity to celebrate the superiority of its liquid restaking token eETH as much more liquid than ezETH.\n\nActually, it was the lack of liquidity in the markets that influenced the drop in the token’s price, resulting in too high of a price impact for sellers.\n\nThe representatives of Etherfi have pointed out through a comment on a post criticizing the entire house of cards of Ethereum restaking, that not all LSRT protocols are the same and that there are safer alternatives."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPQXRHMi1UQkhxeURvdmFrbFMwTE9iMm12VFl5NTFNa2JIZ2k2VU9ibmI3LVhMT05iank5djNHMHJfQ1N0d3RWV0I1dEF5Z25iUXdXa3ZHOGdnUEZjcUxldUxDME1udnhjUzd0Xy1WY0plNE9wcmRuMC1ZNmpxZlBseVJFUkNXczk1Wk5MeEo3LUhDZTYyNDR2SEVmaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "BlackRock And Grayscale Refine Ethereum ETF Plans - CryptoCoin.News",
        "content": "As the landscape of cryptocurrency investments continues to evolve, significant developments are unfolding regarding the establishment of Ethereum ETFs in the United States. Recently, financial powerhouses BlackRock and Grayscale have made notable amendments to their ETF applications, following a recent decision by the Securities and Exchange Commission (SEC) to delay its verdict on these proposals.\n\nBlackRock, a global investment titan, has revised its filing strategy in an effort to align more closely with the SEC’s framework. The company submitted an updated 19-b 4 filing for its iShares Ethereum Trust. A key change in this filing is the shift from in-kind to exclusively cash-based transactions for the creation and redemption of shares. This means that participants will use cash to create or redeem shares, without directly handling Ethereum. This adjustment mirrors the structure utilized in previously approved U.S. spot Bitcoin ETFs and aims to streamline the process and potentially increase the ETF’s appeal to regulatory bodies.\n\nOn the other hand, Grayscale, known for its pioneering work in cryptocurrency funds, has taken a multi-pronged approach in its push for ETF approval. Leveraging its existing Grayscale Ethereum Trust, which is already registered with the SEC, Grayscale filed an S-3 registration statement to convert this trust into a spot Ethereum ETF, designated to be listed on the NYSE Arca under the ticker ETHE. Additionally, Grayscale introduced a proposal for a mini Ethereum ETF, aiming to offer a product with lower fees, similar to its strategy with the Bitcoin market. This mini ETF is set to trade under the ticker ETH on the same exchange\n\nThese amendments and proposals come in the wake of the SEC’s recent announcement to postpone decisions on several spot Ethereum ETF applications, including those from Grayscale Investments and another major player, Franklin Templeton. This delay has moderated the initial high hopes for a swift approval process that followed the SEC’s reluctant approval of multiple spot Bitcoin ETFs earlier in the year.\n\nDespite the setbacks, the firms remain undeterred, signaling a clear intention to continue pursuing regulatory approval. This determination reflects the growing interest and potential in cryptocurrency-based financial products, which are seen as pivotal for providing mainstream investors with regulated and structured opportunities to engage with digital assets.\n\nHowever, the path to approval remains uncertain. Investment circles and market analysts are closely watching the developments, with predictions about the approval chances varying. Earlier this month, JP Morgan estimated no more than a 50% chance of approval by the upcoming May deadline, while Bloomberg Intelligence suggested a more conservative 25% likelihood. Despite these odds, the consistent efforts by issuers to adapt and refile indicate a strong commitment to forging ahead in the evolving crypto ETF space.\n\nAs the May 23 deadline approaches, all eyes will be on the SEC’s next moves. The outcome will not only affect the involved financial institutions and potential investors but could also set significant precedents for the future of cryptocurrency investments and regulatory practices in the U.S. financial market."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOWTE4X3FZTlRmRk9tSEM1cUNGVEpnYVl2U3NiTFRQN2ZobWw1Y2lkV2pOMGtBTmxRLU9IRzVzWVpaMDZwWV9vck1yQ3dtMTY3LWJfMlU1VVFqN3BpX05IQi1KYmZ4MGZWdmVuSVB1LWQ2NmNfdTBYVThSLUdyYmwtelB2ZHl2WXpzNzBybDZza9IBlAFBVV95cUxOQ1lSOWpKV2NkVDlCZzdEbENaUFFpelEtQVlGckcydkhVNU91VVo3X0dBWmpEOVJQb2NVSTNFUWJLR3ItWVdjUE9XV0hLZkhEN2VSTi1NajZEamR4SlhyMGhrMjMwZ25zQl9oeVAycC1EQVNpNTNuU3hqT1ZaTWxvV0NuS1k3ZF9pMl9xUHpZZTNfYjRC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum holds $3K, for now – How can ETH’s price stay above it? - AMBCrypto News",
        "content": "Ethereum Open Interest has seen a slight increase recently.\n\nETH has maintained the $3000 range despite poor runs.\n\nIn the past few days, Ethereum’s [ETH] price has experienced some declines, but this isn’t the only notable change in key metrics.\n\nThe Open Interest has also seen significant movements, and its next direction could significantly impact traders’ sentiment.\n\nEthereum Open Interest sees a slight rise\n\nRecent data from CryptoQuant indicated significant changes in Ethereum’s Open Interest.\n\nAMBCrypto’s analysis of the Open Interest chart revealed a notable decline starting from around the 8th of April and continuing until the 13th of April.\n\nBefore the decline, Open Interest exceeded $10 billion, falling to around $7.2 billion during the downturn.\n\nHowever, there has been a recent uptick in Open Interest, reaching approximately $7.4 billion at the time of reporting. This suggested renewed inflows of funds into Ethereum.\n\nHowever, the nature of these funds, whether dominated by short or long positions, remained to be determined.\n\nThe dominance of short positions would imply an expected decline in price, potentially leading to negative sentiment.\n\nConversely, the dominance of long positions would suggest an anticipated price rise, likely fostering positive sentiment. The direction of the Netflow could provide insight into which position might become dominant.\n\nLong or short?\n\nWhile not guaranteed due to the potential impact of other events, the direction of the Netflow can offer insights into which positions might become dominant.\n\nAMBCrypto’s assessment of the Netflow chart showed a recent increase in Ethereum outflow. Over the last seven days, over 260,000 ETH, valued at over $781 million, have left exchanges.\n\nIn comparison, the inflow was significantly lower, confirming the dominance of outflows.\n\nThis suggested that more traders are withdrawing their ETH from exchanges, typically indicating a positive sign, as these traders seemingly anticipated a price rise.\n\nBased on this observation, we could predict the dominance of long positions as ETH’s Open Interest increases.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nEthereum still stuck in bear trend\n\nAMBCrypto’s analysis of the Ethereum price chart revealed that it has struggled to sustain consecutive uptrends of late. However, it has demonstrated more uptrend value than downtrends.\n\nBy the close of trading on the 22nd of April, Ethereum was trading at over $3,200, reflecting an increase of over 1.7%. At the time of this writing, it was trading at around $3,190, experiencing a decline of over 1%."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQWGpwclBKMFNMWVpiUjBGLWwzSjZBMlhpT0poRVNBcTRrNUVJb1p6V0tiT1FEajFxaW8xMG5pMjQ4dWlNSWRPRGwweGhVSnRJNmEyTTR4MXJBQUV2dVZRaXpwRm5KNjduSjhma296RENCWFo0N1RkR0ZaUG0yZ1RPa2tyNkNFc3lOdFk3YUwtUU0wWUxEWm1ZQjFyTHY3Z2NpR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Morph and Pyth Join to Revolutionize DeFi on Ethereum Layer 2 - Crypto Times",
        "content": "Morph, an Ethereum Layer 2 solution, has teamed up with Pyth Network to enhance decentralized finance (DeFi) applications. This integration empowers developers building on Morph with access to over 500 real-time price feeds for various assets, including cryptocurrencies, equities, and commodities.\n\nThe collaboration introduces Pyth Price Feeds on Morph’s testnet, combining ZK technology and optimistic rollups for improved scalability and decentralization.\n\nTransform your apps—with Pyth data 🔮\n\n\n\nToday marks the launch of Pyth Price Feeds on @Morphl2 testnet, a secure, decentralized, cost-effective, and high-performant EVM-equivalent rollup for Web3 builders.\n\n\n\nLearn more about this deployment below:\n\n\n\nℹ️ About Morph\n\n\n\nMorph is a fully… pic.twitter.com/HFczYHMLVI — Pyth Network 🔮 (@PythNetwork) April 24, 2024\n\nThe partnership between Pyth and Morph will provide developers with the tools they need to create secure and reliable decentralized finance (DeFi) applications. Pyth’s pull oracle deployment on Morph makes it easy for DeFi protocols to get real-time price updates from the Pythnet appchain.\n\nPyth’s oracle network gathers data from leading exchanges and market makers, ensuring the accuracy and timeliness of price feeds. This integration ensures efficient access to high-frequency market data for users within the Morph ecosystem.\n\nMorph combines optimistic and zero-knowledge roll-up tech to create a DeFi-friendly space for developers, gaming, social media, and entertainment applications. Morph’s decentralized sequencer supports Web3’s key principles: decentralization, resistance to censorship, and security.\n\nMeanwhile, Pyth Network disrupts the financial data landscape by aggregating real-time price updates from exchanges and trading firms. This partnership represents a big step forward in boosting the growth potential of DeFi apps, sparking fresh ideas in decentralized finance.\n\nThe partnership between Morph and Pyth opens opportunities for developers to create DeFi applications. By harnessing scalable infrastructure and dependable data sources, this collaboration is set to revolutionize decentralized finance, enhancing growth and creativity within the Ethereum ecosystem."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcXF1WkRWNzlJZS1GajFVWk94Nl9Wc1RRaXEzWjg3UjYtcHh0VEZ2elhNeXBFZFBMdjJBdFhzUjFSTmFZcGREVkpmY3UxQWZ2TXNuQ3lZaDl6UjNGbEMzakU4azlyNW8tbE9zMU1JaXJZYXlKd3dVczZ2bjRUNXhTMldsT3dkbnJ2Z2FmWjluSko2Y2VVb1laMjdYOS1mcjNOUWh3ZWpuMWHSAbYBQVVfeXFMTk12RWl0emxHcFJ6WTM3dFNtMDJOb0NXQnd1YWZ2ZzU0WElGS1ZVRnhJRmY2a1BZOXNZNlh4WmZ5RTFkX1RiWWN5V21yZHZmNVNHODVOTFE3NC1oZ0JPTVloUDVPTHFxRmhNRjhXbGJhbjFXV1FSZFoyZ01ZT0ItOU1PV3I2R3dMdENtVDA2MVhoR0pNdUpzcWNIVTBjdTBCWEl0SkczRkROaENMZ1hKYjlJeW83aEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Drops to $3,100; What’s Next - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQZzVNVGxjaFhwelNOMC1HZTR6RV8zSjE2a21LTW9RanBtWXpTM0QzR0FDQThvVzByeHQ3d3V1WkNFMnJZSWNmUC1GRk5NTHBNa2JlNGZMMGQzN1ZaZVJ5WUFFRzZoYmVfc0tOaTkyeVpzOFRXTlZPZGx0eUNwY0RwQXMySmxGSDZvT0RYeHEyYjdyZWNoOU41MldWQjlGRHJhU0HSAacBQVVfeXFMUG94S3U4SUkxa3k1dzBtMDNiSGliT29aRWNUZ21lclZIVmZ1U3BlLVlNeDJ2dENKWFhPNG84YmxzUkdxMFladXV4b3J1R0MwNEF5eXEyd3lFWGI0UFhaT1FkQk5XMTFzbm5oU2tkZm44UHpxWDBPVnRQQ1RwNkJrblRyX3VkV01RWU5hRTlVMVFfU1g5R0I4WXo1Wk15ZzlyMWJjTklqckE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Cardano (ADA) and Polkadot (DOT) Outperform Ethereum (ETH) on This Front: Details - CryptoPotato",
        "content": "TL;DR\n\nSantiment’s latest ranking shows which cryptocurrencies have accounted for the most development activity over the past 30 days.\n\nInterestingly, Bitcoin (BTC) is not included in the top 10 list, while Ethereum (ETH) is at the bottom.\n\nThe Latest Ranking\n\nThe crypto market intelligence platform – Santiment – revealed which digital currencies have been most active in terms of development frequency over the last 30 days. Optimism (OP), Cardano (ADA), and Hedera (HBAR) are those placed in the first three spots, while Polkadot (DOT) and Kusama (KSM) rounded up the top 5 list. The second-largest cryptocurrency by market capitalization – Ethereum (ETH) – was placed ninth.\n\n“Our platform pulls notable github activity from project repositories via a back-tested process to ensure only a team’s significant efforts to innovate and improve are included,” Santiment explained.\n\nEarlier this year, ADA topped the same ranking, leaving behind DOT in the second spot and KSM in the third. BTC was not included in the top 10 list (just like the latest data shows), while ETH claimed the tenth position.\n\nADA and DOT Price Outlook\n\nBoth cryptocurrencies have performed quite well on a seven-day scale, witnessing price spikes of 11% and 14%, respectively.\n\nEarlier this month, the popular X user Ali Martinez presented a chart showing that ADA’s valuation “is exactly where it should be.” He believes the token is poised to reach $1.70 as long as it enters the $0.55-$0.80 range. Currently, it hovers around the $0.50 mark (per CoinGecko’s data).\n\nThose interested in exploring additional ADA price predictions, please take a look at our dedicated video below:\n\nDOT was also projected to reach new heights in the near future. The X users World of Charts, CRYPTOWIZARD, and CryptoYoddha envisioned a rally towards the $15-$20 level.\n\nMichael van de Poppe and Flash went even further, revealing they have added Polkadot’s native token to their personal portfolios.\n\n\n\n\n\n\n\nDisclaimer: CryptoPotato has received a grant from the Polkadot Foundation to produce content about the Polkadot ecosystem. While the Foundation supports our coverage, we maintain full editorial independence and control over the content we publish.\n\n"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPakxrMkhncW1VbWl2RDdWc2d4bVMwR2s3MF92eTVVSE5MYUc3RWpkRzdDaXFhVFF4amZnLXVDSkY0WnNJTTR5NFVsNU5UVXowUUJqVzJZTHNiaXJmMzhwSjQ4aW1QOGFXY0szdDdSX1lVbDVzYlh2eVRGeHd3QU5PaUZlWlBjNU9Fc0JSLXhXOEgwaXl5QmNRTDZCc0lNLUFxXzgxMXpkVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "How Australians are unlocking their crypto riches - The Australian Financial Review",
        "content": "Sydneysider Johnny Phan says booming cryptocurrency prices are leading more Australians sitting on digital asset windfalls to his start-up Vield. The business makes loans to customers against the ballooning value of their crypto holdings, amid a broad price rally that is helping risk-taking Australians such as Mr Phan get rich quick.\n\n“If you ask the banks or mortgage brokers to borrow against your crypto, they’ll tell you no way,” he said. “They’ll say, ‘sell the crypto, and come back to us with the cash, then we can talk’. But lots of people don’t want to sell as they expect prices to keep rising, so we lend to them against bitcoin and ethereum.”\n\nLoading..."
    }
]