[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcmNKZnhVOVZQSWhUNzVnQlltOHF6alBxNTRzT0RubkxiRVZOYm9UQUt4eExiOV82M1pUcnI5QzVfQW9XektfZEYyWkEza1R3UGtUY1Nkd1FNUmQ4b0F3WkRsN0tWX2VIZnNsS1QxREpvS1hVa2I5TkVvQ0lIX19qRFdEdmJIdTNxUXE5Tmx0VjBQUVozenRwRHZvRm1qN05WRnVqc0U4N0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Watch Kraken Head of Strategy: Ethereum ETF Is a Big Deal - Bloomberg - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQTUU4TDVMRzNxeWcyb3dDcl9pVXhhRFlCUy1la2x5M3kya2drVXZxRWUxM183WUZJTXJadE4zLTRfMEUyNHpMQlhKRVRhUlVEa0FHZFdCN2czMFNuNEYwdnRWRHVnajFfOTFUM0FlM3NRY0Z2VVBVTVpXRml2V1lvN29PN2NrNV9HWENTVF9vOFNRQmh5UXpPeTRFMW9NdzZyU0tRMlF4aXItWEhtNThWTGJadDdVX3M4c2lBRHNRNmZsNkktSUF1X2dJSjZsUWZfUEFVU0RfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "ETH Price Analysis: Staking Deposits Hit $100 Billion ahead of Ethereum ETF Official Launch - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9lZDZEcmZ2SmJMX1JSaFNMMnFXd1l3VlRQXy1VM2MyVDk0RDNzRU50YndUa1BNMi0wR1g4eldVbkswUVpldHBnV25HWGhSNHd4aVp0ZFNZRDEtM29iRU5lZFV1dFVlRUNM0gFuQVVfeXFMT1M4OHlVQ2JkZ2ZrYmU2ZDBrckpMODc4WmJPdTF0b3poa2M1eVhvMjJxTE9iVlVjTGRZb3lYTGRiRVJzRGtTdjRTUFZ0dnFob0dnbkdzb09JbHlsR3ZxQ08tRFRvUzhmaWpPUE9IX0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for July 12 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBulls do not seem ready for a continued upward move, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe price of Ethereum (ETH) has fallen by 1.66% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH remains bearish as it is coming back to the local support level of $3,055. If the situation does not change by the end of the day, one can expect a breakout to the $3,000 zone.\n\nImage by TradingView\n\nOn the bigger time frame, one should pay attention to yesterday's bar's low. If the candle closes near it or below, the fall may continue to the vital area of $3,000 shortly.\n\nImage by TradingView\n\nFrom the midterm point of view, the rate of ETH is far from key levels, which means neither buyers nor sellers are ready for a sharp move.\n\nIn this case, ongoing sideways trading in the zone of $2,900-$3,100 is the more likely scenario.\n\nEthereum is trading at $3,074 at press time."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOOGxDa0FpTW42dGZCajhpcEtqRXQ0SkxkOTM3ZllLcFlBN1l0LUg1UzFQekx6cG13MkJCVlhsVDktN1NmWWQ5ZDVTV2pPdGJMbUlqV0ZkV09ONk5ha1BTLUo3X0xHekg0U3QyWXZIQV92cWJKWC1rdTktTU00LU5QVDNtNVlqelNMZXRrTFlzMFdjaHVuei00ckpNTHRuTGdHcHc0a3RqNlBPcGdFTXRjeXdOQzdBbjdCdzk1aGtfajNpLTVVMm1vOEgxcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Whale Makes $50 Million Splash, Moves Holdings to Self-Custody as Price Rebounds - CryptoGlobe",
        "content": "A large cryptocurrency holder, colloquially referred to as a whale, recently transferred 16,449 Ether ($ETH), valued at roughly $50.3 million, out of leading cryptocurrency exchange Binance exchange into self-custody.\n\nThe move came as the price of the second-largest cryptocurrency by market capitalization recovered from a slump seen earlier this month to climb above the $3,000 mark, and at a time in which spot Ether exchange-traded funds (ETFs) are expected to soon start trading in the United States.\n\nAccording to on-chain analytics firm Spot On Chain, this movement marked the first major Ether accumulation for this particular whale, with the transferred funds being sent to a new wallet, potentially suggesting a long-term holding strategy rather than an immediate sale.\n\n7 hours ago, a whale/institution withdrew 16,449 $ETH ($50.3M) from #Binance as the #Ethereum price rebounded to above $3,000.\n\n\n\nThis is the whale’s first large $ETH accumulation. So far, it has moved all $ETH to a new wallet and held them there.\n\n\n\nNote that the ETH ETF is likely… pic.twitter.com/BBHOvWM3yx — Spot On Chain (@spotonchain) July 10, 2024\n\nThe introduction of an ETF is expected to attract more institutional investors to Ether, potentially leading to a price increase. The cryptocurrency is at the time of writing trading at $3,100 after losing nearly 9% of its value over the past week amid a wider cryptocurrency market downturn.\n\nAnalysts expect spot Ether ETFs to be approved as soon as this week, with various issuers having recently filed amended S-1 forms. These amended filings, however, don’t contain fee information, which may mean there will be another round of filings.\n\nNotably, long-term Ethereum investors are now holding around 78% of the cryptocurrency’s circulating supply, which means that buyers who have been holding onto their funds for more than a year now control the majority of circulating ETH.\n\nThat’s according to data from on-chain analysis firm IntoTheBlock, which revealed that long-term holders (LTH) recently added more to their wallets as the price of the cryptocurrency dropped amid a wider market downturn.\n\nThese long-term investors are less likely to sell their coins compared to those who have held them for a shorter period. The trend of LTH dominance is seen as a bullish sign for Ethereum, suggesting growing confidence among investors, with the significant concentration they now have effectively taking a significant amount of the cryptocurrency out of circulation, limiting potential downward pressure on the price.\n\nFeatured image via Unsplash."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPc3BhVnBERjVfTVFmbzZkUExjUDdwemg3dmo3dGd5S0ZKczJ6SGxDMnhtS1h3bmg5SVNPaGxfRjh5b3lndUVLdHpRYl9NUHFpb3JiSTBCajBraUhUb09wWjI1QXZDa19nY2J3QlRJTG5IOVdNLWZEV1h3ZkJSLU91QVlFa0NCSno1YWN0OXl3eFJJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "How to Convert (Swap) Ethereum (ETH) to Bitcoin (BTC) - Finance Monthly",
        "content": "Imagine standing at the crossroads of the digital currency universe, where two of the most influential cryptocurrencies, Ethereum (ETH) and Bitcoin (BTC), intersect. This is not a mere intersection, but a gateway, a portal that allows you to convert one cryptocurrency into another. As a result, the question of how to swap ETH to BTC arises. Today, we will guide you on the journey of ETH to BTC swaps.\n\nThis journey is not just for the seasoned crypto navigators but also for those who have just set sail in the vast ocean of digital currencies. Knowing how to convert Ethereum to Bitcoin is like having a magic key that can unlock new opportunities for investment and diversification. Follow this guide to navigate the process and learn all about the exchange of two major players on the market - ETH to BTC.\n\nWhat is Ethereum (ETH)?\n\nEthereum (ETH) is not just a cryptocurrency but more of a decentralized global computer. It was funded through crowdfunding, making it decentralized from the start. Ethereum is in the process of a significant change from Proof-of-Work to Proof-of-Stake. With a market cap of $198 billion, Ethereum is the second-largest blockchain network in the world. It hosts nearly 6,000 decentralized apps (DApps) and functions as the base infrastructure for several crypto trading platforms, DeFi protocols, and NFT marketplaces.\n\nWhat is Bitcoin (BTC)?\n\nBitcoin, although less mysterious and more widespread, also has some intriguing aspects that are not widely known. For instance, a bug in 2010 led to the accidental creation of 184 billion BTC, far exceeding the intended maximum limit of 21 million. However, this issue was quickly rectified, and the maximum limit was reinstated. Another interesting fact is that the smallest unit of bitcoin is called a “satoshi,” which is equal to 0.00000001 BTC. Together, all these make the question of how to swap ETH to BTC even more important.\n\nWhy Do Users Swap ETH to BTC?\n\nUsers might look for ways to convert ETH to BTC for various reasons. One of the primary reasons is portfolio diversification. By holding a diverse range of cryptocurrencies, investors can mitigate risk across different assets. Due to the high volatility in cryptocurrency values, maintaining a variety of assets can safeguard investments against market fluctuations.\n\nWhere to Swap ETH to BTC?\n\nThere are several platforms where users can swap ETH to BTC. These include places like Coinbase, Binance, Kraken, and more. However, the majority of our readers prefer SimpleSwap as a convenient way to convert ETH to BTC. The platform stands out as a reliable and user-friendly platform for swapping ETH to BTC\n\nHow to Swap ETH to BTC: Swapping Guide\n\nOne solution for those wondering how to transfer ETH to BTC is through a platform like SimpleSwap.\n\n1. Choose the crypto pair.\n\nSelect ETH in the “You send” section and enter the amount you wish to exchange. Then choose BTC in the “You get” section. Click “Exchange”.\n\n2. Add the recipient’s address.\n\nEnter the recipient’s address. The ETH will be sent to this address after the exchange.\n\n3. Send the deposit\n\nYou’ll see an address to send the indicated amount of BTC to continue your swap.\n\n4. Get cryptocurrencies\n\nAfter receiving your deposit, SimpleSwap will convert it and send the ETH to the wallet address you provided.\n\nHow the Exchange (Swap) Process Looks Like\n\nBefore we delve into the specifics of how to exchange ETH to BTC, let’s pause to comprehend the procedure. By following a well-defined and organized approach, you can facilitate the exchange process with ease and efficiency. It’s important to note that this procedure is not exclusive to the method to buy Bitcoin with Ethereum - it can also be applied to any crypto pair.\n\nBenefits of Exchanging ETH to BTC\n\nSwapping the two can offer several benefits, some of which are discussed below:\n\nDiversity of Your Cryptocurrency Portfolio\n\nThe exchange allows you to distribute your investments across multiple cryptocurrencies, taking advantage of the distinct strengths and opportunities each coin presents. This strategy can reduce the impact of volatility in any one cryptocurrency and potentially improve the overall performance of your portfolio.\n\nPotential for Higher Returns\n\nHistorically, Bitcoin has demonstrated higher returns than Ethereum. While past performance does not guarantee future outcomes, many investors exchange ETH for BTC with the aim of benefiting from Bitcoin's market trends and its potential for high returns. However, it’s crucial to understand that higher potential returns also come with greater risk.\n\nLarger Market Volume and Broader Application\n\nBitcoin, being the first and most widely adopted cryptocurrency, has a larger market volume and broader application than Ethereum. This means Bitcoin is accepted and recognized by more businesses and individuals worldwide, making it potentially a more liquid and versatile investment. Swapping ETH to BTC could therefore offer more opportunities for use and potential appreciation.\n\nLower Transaction Fees\n\nBitcoin transactions generally have lower fees compared to Ethereum, especially during periods of high network congestion. This can make Bitcoin a more cost-effective option for frequent transactions. However, transaction fees can vary and should be checked at the time of the transaction.\n\nConclusion\n\nIn conclusion, the choice of how to convert ETH to BTC can be a strategic move both in the short term and in the long term. While the process may seem complex at first, platforms like SimpleSwap make the process straightforward and accessible. As with any financial decision, it’s important to do your research and understand the potential risks and rewards."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNeHZoVmxYX0l2aUJCb2NzMEQtR0JPQy1QX3NCbXlLSV9SdmZjYWZybDhaSVI4TDdWMjZzYmVSUUdCRS1vc3NwTVphazA5S2UwSmtSZjlndFNRSjZsSWhITWdUQjVVNU14Szlqc0liR0g3dFdjYjZkOGgtbUZFcUgwcVphZmhlY2VnZ0NRSG90WlJHXzRYWVHSAZsBQVVfeXFMTlZHaDhPYmY2UnNybF93NGhPbzBzREoxbml1Sm5HcGlWVEMwNTQ4ZzI1S3dlN0FuMXZybURteUxCUUhpbHhRNUxranlxeE13MElKNmpYNU5NaDRnbjNSSW14SUpkaU9Ea3dzYV9PN0hrWUdDeC1XOHhrUVhXRllfSE9TZFdTQ2wza0JnZHZzLUdEeWlyNXY2ZWRUb00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum rebounds, whales scoop ETH: Will the ETF approval boost gains? - AMBCrypto News",
        "content": "Ethereum whales are actively accumulating, with recent large transactions signaling renewed confidence.\n\nAnticipation of Ethereum ETF approval drives significant institutional inflows, suggesting bullish sentiment.\n\nEthereum’s [ETH] price increase has triggered heightened activity among large holders, commonly known as whales.\n\nFollowing a week of downward momentum, ETH’s price has seen a resurgence, leading to substantial transactions by whales.\n\nAs of the time of writing, Ethereum was trading at $3,113.58 with a 24-hour trading volume of $14,340,649,075, according to CoinGecko.\n\nThis was reflected in a 1.07% price increase over the past 24 hours, although the cryptocurrency has experienced a -7.46% decline over the past seven days.\n\nThis uptick in price has catalyzed increased accumulation by whales, signaling a potential shift in market sentiment.\n\nSignificant whale movements\n\nRecent on-chain data indicated substantial activity among Ethereum whales.\n\nNotably, Spot On Chain, an on-chain data provider, reported that an Ethereum whale withdrew 16,449 ETH, equivalent to $50.3 million, from the crypto exchange Binance [BNB].\n\nThis move came as ETH surged past $3,000, marking the first notable accumulation by a new whale address. The withdrawn ETH has since been transferred to a new wallet and remains there.\n\nFurthermore, Whale Alert noted another substantial transaction involving 9,966 ETH, equivalent to approximately $30.6 million, transferred from the Kraken exchange to an unknown wallet.\n\nThis activity aligned with a broader trend of whales resuming their accumulation of ETH following a period of distribution.\n\nAli, a known analyst on X, commented,\n\n“After a brief distribution period, #Ethereum whales are back to accumulating $ETH!”\n\nThe number of addresses holding over 10,000 ETH has declined since mid-April and began to rise again in early July.\n\nThis trend suggested that some mega-whales reduced their holdings during the price decline but are now increasing their positions.\n\nThe timing of these large-scale withdrawals and accumulations coincided with the market’s anticipation of the Ethereum ETF, which is expected to go live next week.\n\nThis development is a potentially bullish signal for Ethereum, as it could attract further investment and drive up prices.\n\nPotential impact of Ethereum ETF approval\n\nKatherine Dowling, Bitwise’s Chief Compliance Officer, has affirmed that the approval of the spot Ethereum ETF in the U.S. is approaching.\n\nWith issuers submitting their S-1 amendments, analysts expect the approval around the 18th of July.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThis has led to a surge in inflows into Ethereum investment products, with institutional players accumulating ETH ahead of the ETF approval.\n\nLast week, Ethereum investment products saw inflows of $10.2 million, indicating growing interest from institutional investors."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPM2luVTBCNVc0SExLNndvWkE0OVY3WVFheTZmVUhxTk1NalRmRlZ1ZlZlX1h6YkZhWDFPdVFQV2ZWdGdGdGJ3ZGpGWnMwOUVLeHdoYnpTODBINjlSbUZsQWRSdUZpTGU1eUxZRTI2dWsteUhBaUdPcW9qNDVqWGE2cjYtTF9XTk1nWHJhYnJVeGxXa1Nr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum braces for spot ETF boost as 40% of supply remains locked - CryptoSlate",
        "content": "Approximately 40% of Ethereum supply is locked as the market anticipates the final approval for ETH spot-based exchange-traded funds (ETFs).\n\nA breakdown of this “locked supply” shows that over 33 million ETH is staked on the network, representing around 28% of Ethereum’s total supply, according to Dune Analytics data.\n\nProof-of-stake networks like Ethereum require users to “lock up” their digital assets to support its security and operations, and in return, they earn rewards.\n\nAdditionally, 12% of the supply is locked in smart contracts and bridges, which are seeing high adoption lately. For example, A.J. Warner, Chief Strategy Officer at Offchain Labs, noted that ETH in the Arbitrum One bridge has consistently increased over the past three years.\n\nMarket observers believe this substantial ETH lockup and the impending ETF approval will boost ETH prices. Tom Dunleavy, Managing Partner at MV Capital, pointed out that the approval of spot Ether ETFs will significantly impact the market. He stated:\n\n“The spot ETH ETF flows are going to rapidly move this market.”\n\nETF approval\n\nMeanwhile, anticipation continues to grow surrounding the final approvals for a spot Ethereum ETF in the United States.\n\nOn July 9, Bitwise’s Chief Commercial Officer, Katherine Dowling, said the ETFs are nearing approval, pointing out that the Securities and Exchange Commission (SEC) was addressing only a few remaining issues.\n\nDowling suggested the products might be approved over the summer, a sentiment echoed by Bloomberg ETF analyst James Seyffart.\n\nSeyffart speculated that approval could come by the end of the month despite his low confidence in exact launch date predictions. He said:\n\n“I have fairly low confidence in those launch date predictions at this point. There’s no deadline & SEC’s Corp Fin is taking its time here (I don’t blame them). But these changes were very minimal and [i don’t know] why the ETFs wouldn’t be ready to go within a couple of weeks.”\n\nMeanwhile, crypto bettors on Polymarket expect the products to launch before the end of the month, with an 87% chance of being listed for trading by July 26.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOMldIeG5tdWg4ZVNmaTVOQjYwVEpNVWJmTTA0TjhLTGM4c3VkSmVLb3V5am9jd3ZQV212djYzNDJoaEJmR01rM2tWcmdYZmZWM2hHWlpHU05RaXhub0JCLXpkNUNRdlBTR2E4TTdObUZOaFZyMnBCbjU0dldzQmpnc2g0eHdzZmdZQThsOElqTGw4UU5DeGI4VVM2UU9SNTB4a0QwZU4yb9IBrAFBVV95cUxNYUFreE91V0hMaEVSTE83WkRJeERaejZuTEhIYWtBcjN3ekswd1dINUszcnp6a0FLTDZ5QTA5WDFwT05Eb0pCQ2YzTUtHWUFzSkxOTXJWTGpzNUVicFNMWGw3LW1CNGpzdmJXdUZhRjF3c2NqeXhGZWVoeFY0a0ViUktpZm9LLXZSSDBiTjRON2RWS0pzWHJZbWNjaGpZcWFMVlJUNzFjeDBVWTl6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH on the Verge of a Deeper Correction Toward $2.7K? - CryptoPotato",
        "content": "Ethereum’s price has been dropping recently, following a second rejection from the $4,000 resistance level, and it has yet to recover.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been making lower highs and lows since failing to break the $4,000 level to the upside a while ago. The market has also broken below the 200-day moving average, around the $3,100 mark.\n\nThe price is currently retesting the 200-day moving average but is seemingly getting rejected to the downside. As things currently stand, the cryptocurrency seems likely to drop toward the $2,700 support level in the short term.\n\nThe 4-Hour Chart\n\nThe 4-hour chart demonstrates a zoomed-in view of the recent price action. As evident, the downtrend has recently been aggravated to the downside, with the market briefly breaking below the $3,000 support level.\n\nYet, following an oversold signal by the RSI, the price has recovered above the mentioned support zone. However, the price seemingly lacks the momentum to continue higher and might be on the verge of a deeper decline toward the $2,700 area.\n\nOn-Chain Analysis\n\nBy TradingRage\n\nEthereum Exchange Reserve\n\nDuring the Ethereum downtrend in the last few weeks, many analysts have been looking for signs of capitulation that point to a potential bottom. Some signals are becoming evident.\n\nThis chart displays the Ethereum Exchange Reserve metric, which measures the amount of ETH held in exchange wallets. An increase shows potential selling pressure, while a decline indicates a decrease in supply.\n\nFollowing the recent brief decline below the $3,000 level, the exchange reserve metric has experienced an increase above its 30-day moving average. This might indicate the beginning of the capitulation phase, as many investors’ stop losses were below the $3,000 level."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQWWpDZHVlWWpqS0YxU0hoenN4MjVQcllTcWVvVGlOM3BKMkkycm1mc3pwQ1NXdUVXc3RPaTlHNVhUdDBLZXpYYXE5c3ZHNTgxR0VoT2lUb3FLLUdhYXlndFBPT1hzX3dwVkZ1Vjh5czVPcU5vSGo3bzN6UFQySDBNcFVaVmctSUEzLVhRMXQyNFBLU3Q0aG5YVUk3dk41VlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Reclaims $3,200 on Dovish CPI Report: What Next? - The Crypto Basic",
        "content": "Ethereum price gained 14% within the 7-day timeframe, as reclaimed the $3,200 territory on July 11, on-chain data trends suggest ETH retail traders could pile on more demand in the days ahead.\n\nEthereum Price Bounces 5% on Positive CPI Report\n\nEthereum price bounced 5% within the daily timeframe on June 11 as the crypto markets reacted positively to the latest US economy inflation report. On Wednesday, the US Bureau of Labour Statistics published the Consumer Price Index (CPI) report which showed that inflation slowed for the first time in 4 years, adding more luster to calls for interest rate cut.\n\nThe dovish US CPI report of June 2024 sparked a way of buying pressure across the crypto markets, but Ethereum’s ETF impending launch further fuelled the ETH price surge on Thursday.\n\n- Advertisement -\n\nLooking at the chart above, Ethereum price surged by more than 4% on Thursday, to reach a weekly timeframe top of $3,213 on Thursday, July 11, marking a 14.37% recovery from the 100-day low record during the market crash last Friday.\n\nWhile the positive CPI report, and louder calls for rate cuts have boosted investor confidence across all risk assets markets, ETH price is also receiving bullish tailwinds from the Ethereum ETF anticipated launch slated for July 15 according to Bloomberg analysts.\n\nAfter Thursday’s gains, the ETH price retraced toward the $3,100 level at the time of writing on Friday, July 12. However, according to on-chain data, more retail traders are looking to pile on additional demand for Ethereum as the ETF launch date draws closer.\n\nThe exchange order book data from IntoTheBlock provides comprehensive information on the total number of active buy and sell limit orders for a specific asset. This data is aggregated from 16 well-established cryptocurrency exchanges, such as Binance and Coinbase.\n\nA higher volume of buy orders often precedes a price bounce, as it means that market demand has exceeded the current short-term supply of the asset and vice versa.\n\n- Advertisement -\n\nThe chart above depicts that Ethereum buyers have listed active bids to purchase 300,000 ETH at the average price of $3,099. Meanwhile traders have only placed 232,000 ETH up for sale close to the current prices.\n\nEssentially, this means there is currently an excess market demand for over 68,000 ETH. Valued at the current prices, the bears must now place another $321 million worth of sell-pressure to halt Ethereum’s current price rebound phase.\n\nBut with the spot Ethereum ETFs due to launch in less than a week, existing ETH investors could opt to sit-and-watch approach and consolidate on their holdings. Other strategic short-term traders may also be waiting to sell into the expected market euphoria around the launch date.\n\nAs this cooling sell-side pressure persists on the dovish CPI report and the anticipated ETF launch, ETH price could be on the verge of a parabolic breakout towards $3,500.\n\nEthereum Price Forecast: ETH Bulls Can Target $3,500 Rebound\n\nEthereum (ETH) has shown signs of recovery, currently trading at $3,092.12 as of July 12. The price has rebounded by 14.37% over the past six days, suggesting a potential continuation of the bullish trend. The Parabolic SAR indicator at $3,256.23 signals a possible upward momentum, with ETH aiming to break key resistance levels.\n\nThe immediate resistance is at the Parabolic SAR level of $3,256.23. A break above this could open the door for a retest of the $3,500 level, a significant psychological and technical barrier. The Relative Strength Index (RSI) is at 39.20, indicating that ETH is still in the oversold territory but showing signs of recovery. If the RSI continues to rise, it could further confirm the bullish outlook.\n\nSupport levels are crucial to monitor in the event of a pullback. The first support level to watch is around $3,000, which has proven to be a strong psychological support. Below this, the next significant support is at $2,800. A drop below $3,000 could weaken the bullish momentum and lead to a retest of the lower support levels.\n\nIn summary, Ethereum’s price action and technical indicators suggest a bullish outlook with a target of $3,500. Traders should watch the key resistance at $3,256.23 and the support at $3,000. A successful break above the resistance could see ETH retesting $3,500 while maintaining support at $3,000, which is crucial for sustaining the bullish momentum."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOU1JRZFYtZUJuam9Fd2RoZ0NEbEY1QTQ0NExFY3RSLWlXSUV1TUNldWMxbWIwZ1VrYllLSndsVGhiSnEwbUp2RFVZTkkxOU1FYmU3QkctXzhWa3d1MGdqVy1rckZCY1JORGc5bUFTcGc3QmgyMTFtbmdkVktXRzFBX3F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities - Yahoo Finance",
        "content": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities\n\nThe chief of the U.S. Commodity Futures Trading Commission (CFTC), Rostin Behnam, has once again advocated for his agency to oversee Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, by classifying them as commodities. Speaking before the U.S. Senate Committee on July 9, Behnam referenced a recent Illinois court ruling that reinforces this classification.\n\nThe court decision on July 3 was part of a $120 million Ponzi scheme case involving an Oregon man accused of fraud. The Illinois district court judge declared that both Bitcoin and Ethereum qualify as commodities under the Commodity Exchange Act. The ruling also extended this classification to Olympus (OHM) and KlimaDAO (KLIMA).\n\nBehnam also cited a 2022 report from the Financial Stability Oversight Council (FSOC) that pointed out a regulatory gap in the spot market for digital assets that are not securities, suggesting that the CFTC should play a more significant role in overseeing digital commodities.\n\nBehnam emphasized that the lack of action from other U.S. regulators would not diminish public interest in digital assets and could potentially increase risks to financial markets and investors. “In short, our current trajectory is not sustainable. Federal legislation is urgently needed to create a pathway for a regulatory framework that will protect American investors and possibly the financial system from future risk,” he asserted.\n\nThe CFTC Chair outlined five key legislative priorities he believes his agency could implement to better regulate digital commodities. These priorities include crafting rules tailored to the unique risk profile of cryptocurrencies, establishing a permanent “fee-for-service” funding model, requiring comprehensive disclosure from registrants about their crypto assets, and enhancing the CFTC’s Know Your Customer (KYC) and Anti-Money Laundering (AML) capabilities."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOUDRxTEE3OFJyRV9ra0lsOGJYTzlLTzdKMVdJU2F0al8tdExyMzJpNTM1RUg0OW1zaVAyUUlweS1wbUstX3lfdzBlQzRQTTM2V0o0VWZXdW1xeUVWQWJzeWhPeXFUSC0zVUZzT01OY1JiUDN2eUJzajFoRGpuYXRXZFQwZTBRMGtOWW5hRG9KbXFQT2dCWWRrWDZJZkJSVjNUd21Vel9GVXBDUDVTc2Zobi02NktyMU5FWWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Bounce May Be Short-Lived - Watch Out for Renewed Selling Pressure - Investing.com",
        "content": "Crypto market rebounds after Bitcoin sell-off, but recovery remains uncertain.\n\nEthereum finds support, eyes resistance as spot ETF news fuels buying.\n\nThe crypto faces crucial levels as SEC decision on spot ETFs looms.\n\nInvestingPro Summer Sale is live! For less than $8 a month, unlock the AI-powered stock picks beating the market by 18.6% this year.\n\nThe cryptocurrency market has finally found some relief this week, pausing its persistent decline. While the sell-off has been the primary culprit behind the market's downturn, altcoins have also suffered. Despite significant challenges, such as the Mt. Gox situation and Bitcoin sell-offs by the German government, a surge in demand for US-based Bitcoin ETFs has provided a buffer against further declines.\n\nThis week, the cryptocurrency market halted its downward trend, providing a much-needed respite for investors. The primary driver of the decline has been the Bitcoin sell-off, which has also negatively impacted the altcoin market. Recent developments, such as the Mt. Gox situation and the German government's Bitcoin sell-offs, have cast a shadow over the market for the past month. However, the rising demand for US-based Bitcoin ETFs has offered some support against further declines.\n\nDespite this, it's too early to declare a market recovery. The total cryptocurrency market capitalization has not yet recouped the losses incurred in early July, despite this week's partial recovery. For a full recovery, the market capitalization needs to close above $2.15 trillion (Fib 0.236) on a weekly basis, breaking through resistance up to $2.3 trillion. This could happen if the Bitcoin sell-off ends and positive developments materialize, such as the launch of spot Ethereum ETFs.\n\nEthereum Rebounds From Buy Zone\n\nhas shown more resilience compared to the broader market throughout June. However, the SEC's delayed approval for ETF issuance dampened demand, leading to a significant drop in early July. Last week, Ethereum tested its April-May lows, falling to the $2,800 range, but saw rapid buying in this demand zone. This week, Ethereum has experienced positive price movements due to new developments for spot ETFs, reaching the critical resistance point of $3,100.\n\n\n\n\n\nEthereum Faces Crucial Resistance Levels Amid SEC Decision Anticipation\n\nEthereum (ETH) is approaching significant resistance levels that could determine its short-term trajectory. Based on the last bearish cycle, $3,125 aligns with a Fib 0.236 level, making it a critical resistance point. A clear daily close above this mark is essential for Ethereum to aim for $3,350, the 3-month exponential moving average, which could signal a trend reversal into positive territory.\n\nA key catalyst for Ethereum's price movement will be the potential approval of the SEC's spot ETH ETF. While approval could boost demand and drive prices higher, it might also trigger a sell-off once the expectation materializes. Hence, Ethereum's ability to respond positively to the SEC decision is crucial for a sustainable recovery. If ETF inflows significantly increase demand, any initial selling pressure could be mitigated.\n\nFor Ethereum to break its short-term downtrend and target $3,350, it must first clear the resistance at $3,125. In the event of a pullback, $3,000 serves as the immediate support level. Failure to overcome current resistance could see a retest of this support. Holding $3,000 may pave the way for a stronger move past $3,125, while a break below $3,000 could trigger a decline towards the $2,800 demand zone.\n\nThe $2,800 support has held since April, but each test weakens it, raising the risk of a break. Should this level fail, Ethereum's next support could form around $2,600.\n\nIn conclusion, the Ethereum market is closely monitoring developments around ETF approval. A confirmed trend reversal requires Ethereum to establish a firm floor above $3,350 this month. Until then, traders should watch the $3,125 and $3,000 levels closely as indicators of potential movements.\n\n***"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5zQjRodUN2bGFtS2ZKdWFHZXlZODMtSktBbUlER3hYYU9QbGFBc0hRTjA5R1F6YXd0OGtyOTBMdnFPY0Y5VWdWekE0MkI4LVR0c09HaVJuX21kd01zZnJJLVZuVm13TzQ1MmplMDRDamt0ZnBf0gF6QVVfeXFMT0RyUFEyR3MzLThyalhEREI2RzNGMUVLS2xoSDZUMUNTR2FLNV9OdW0yQXFwNWlVOW1ZdnZMQVE2b0RWTnBYTjRtbTg0OUkzMl9aWXZ4eUppYy05WmNOc1JVZG9hOWgxSmFLNmdYTlV0czNuR196YkRjRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 13:19:54 GMT",
        "title": "$46 Million in Ethereum (ETH) on Move, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAn Ethereum (ETH) whale moved a major amount of ETH earlier today. Per the latest data from Whale Alert, the whale moved 14,815 coins to crypto trading platform OKX. The transfer is estimated to be worth around $46.6 million based on the current price level.\n\nAdvertisement\n\nThe whale appears to be reducing its ETH holdings, and this transfer is suspected to be a sell-off. It comes at a crucial time as the Ethereum price is looking to initiate a recovery after the recent market dump. Consequently, the community is worried about whether this sell-off can halt the price's recovery.\n\nIt is true that major transfers from crypto whales can impact the market. If it is a sell-off, it can inject bearish sentiment into the market. In ETH’s case, the whale is expected to reduce its holdings. This move can put bears in control again and halt the upward trend. However, the impact of such sell-offs is not expected to be there for the long term.\n\nEthereum price dynamics\n\nAmid this latest transfer, the price of Ethereum is eyeing a potential recovery. Per CoinMarketCap, the ETH price is currently trading at $3,149. This comes after a notable jump of 1.55% in the last 24 hours. While the price is still down 10.7% over the past month, today’s increase indicates the start of a potential recovery.\n\nAdvertisement\n\nAnother positive indicator for ETH is that it is currently trading above its 200-day EMA and SMA. This is a major bullish sign as it shows that the leading altcoin has remained bullish over the long term. It means that the Ethereum price is not in a bearish phase, and it has the potential to recover its recent losses."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBtdzNIakdkeEliN01BYXZGd0tFcmhpWDN5a3FEamlKVTMxSGsyRXhuYVVsdWxNQmtJWHpUNlc0T3hYc08yNU1MbTJZM2hCLVVJS1plVXI5MmRaeG9WYmp5Y1VwRk5VN0V0dktB0gFwQVVfeXFMUFdOQXBjQ3dVTjJjWXF0YWI0SGxzalFOUTNRLUY5S1l5bE1Xb2Uzd1hTN2szT0RuazdSbnBCNF8wRG56ZXk0QTgtc1lXWXlRNWFINVBHS19hOWxNVGNMWEpsUlR0UE5pZ21QMmJyZV9fOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "What is ENS? Ethereum Name Service Explained (Updated 2022) - CryptoPotato",
        "content": "Back in the days, when the Internet wasn’t so mainstream, one of the main problems that users faced was that domain names hadn’t been matched up to Internet protocol (IP) addresses.\n\nThis made them very unfriendly towards the average Joe, who had to type in the IP address of the website they wanted to visit, as in to type in the numbers literally.\n\nUnlike traditional IPs, cryptocurrency addresses represent even longer strings of numbers and letters. If a user wants to send another user funds over Ethereum’s network, they would have to input the address and make sure that each number and letter is written correctly.\n\nQuick Navigation\n\nIt’s also important to know that blockchain-based technology is very punishing in this regard. If you fail to input the address correctly and mistype a letter, the funds you send will be irreversibly lost. There’s no central authority to contact to reverse or refund the transaction—that money is lost.\n\nAnd just like Domain Name Services (DNS) came to life when using the Internet, the Ethereum Name Service (ENS) came to be.\n\nWhat is Ethereum Name Service (ENS)?\n\nEthereum Name Service (ENS) uses the same concept as the Domain Name Service (DNS) but adjusts it for the needs of Ethereum users. At its core, the Ethereum Name Service is a distributed, open, and extensible naming system operating on the Ethereum blockchain.\n\nIt aims to map human-readable names to machine-readable identifiers. In this case, the human-readable name can be something like “cactus.eth,” whereas the machine-readable identifier can be the Ethereum address (or other cryptocurrency addresses, for that matter.)\n\nIn the image below, we have given an example of what it looks like. The address belongs to the Ethereum Foundation. The ENS domain name that we created is just an example for the purpose of this guide:\n\nThe standard Ethereum Address is converted into human-readable text (foundation.eth). This means that users can send funds or interact with “foundation.eth” instead of the standard address. Obviously, this makes it much easier for regular users and also considerably tightens the possibility of a mistake.\n\nAccording to the official ENS documentation, the system “has similar goals to DNS, the Internet’s Domain Name Service, but has significantly different architecture due to the capabilities and constraints provided by the Ethereum blockchain.”\n\nSimilar to DNS, ENS operates on a system of dot-separated hierarchical names called domains. The owner of a domain also has full control over the subdomains.\n\nHow Does ENS Work?\n\nThere are two core components to the Ethereum Name Service. Namely, these are the registry and the resolvers. The architecture of the system looks like this:\n\nRegistry\n\nThe registry is composed of a smart contract designed to maintain a list of all the domains and subdomains while also storing three essential pieces of information about each. These pieces are:\n\nThe owner of the domain\n\nThe resolver of the domain\n\nThe caching time-to-live for all the records that are under the domain\n\nThe purpose of the ENS registry is very straightforward – it’s to map from a name to the resolver who’s responsible for it. Meanwhile, owners of domains in the ENS registry are allowed to:\n\nChange the ownership of the subdomains\n\nTransfer ownership of their domain to another address\n\nSet the resolver and the time-to-live (TTL) for the domain\n\nResolvers\n\nResolvers, on the other hand, are responsible for translating names into addresses. Every contract that implements the required standards can be a resolver in the Ethereum Name Service. However, resolving a name in ENS is a process that is composed of two steps.\n\nThe first one is to ask the registry what resolver is responsible for the said name. The second one is to ask that particular resolver for the answer to the query. In terms of architecture, it looks like this:\n\nThe Difference Between DNS and ENS\n\nThe Domain Name Service (DNS) was created in 1983 by Paul Mockapetris, a US computer scientist. It followed the research of another American scientist, Elizabeth Feinler.\n\nPut in simple terms, the purpose of DNS is to match internet protocol (IP) addresses with human-friendly domain names. This allows users to type in the website’s name instead of having to input the literal numeric IP address.\n\nIn a similar yet different way, Ethereum Name Service attempts to make it easier for people (and applications) to read and share cryptocurrency addresses.\n\nHow to Register an Ethereum Name Service (ENS) Domain?\n\nRegistering an Ethereum Name Service domain is pretty straightforward. All you need is a hot wallet such as MetaMask.\n\nGo to app.ens.domains (the official website for registering an ENS domain), and type in the domain name that you want to register. This will check its availability.\n\nOnce you have selected your name, all you need to do is follow the instructions given below:\n\nEthereum Name Service Governance\n\nThe Ethereum Name Service is governed by several different arms, each with its own significance.\n\nENS Token + Distribution\n\nThe ENS token is a standard token using the ERC-20 standard on the Ethereum blockchain. Its main purpose is to be used for the governance of the system.\n\nToken holders can submit proposals and cast their votes. The main place where community members can discuss ideas and have governance-related discussions is the forum discuss.ens.domains.\n\nThe ENS token was airdropped to early adopters who had previously registered an ENS domain name. The claiming process started on November 8th, 2021, and users had until May 4th, 2022, to claim their allotted tokens.\n\n25% of the total supply was distributed through the airdrop, while the rest is designated as shown in the following piechart:\n\nENS DAO\n\nIn the spirit of decentralization, the Ethereum Name Service is operated by a decentralized autonomous organization (DAO). The DAO is governed by holders of the ENS token, who can submit proposals and vote on them to determine the protocol’s future development.\n\nENS Foundation\n\nThe ENS DAO itself is represented by an existing Cayman Islands Foundation called the ENS Foundation.\n\nIt has a few purposes, including:\n\nTo comply with tax requirements because without a legal entity, DAO participants may be responsible for a certain proportion of the DAO’s income, even if they don’t have access to these funds.\n\nTo enter into contracts with other companies.\n\nTo provide limited liability for participants in the DAO for the actions of the DAO.\n\nConclusion\n\nENS is a critical advent in the cryptocurrency field and a step towards solving some of the pressing issues that riddle the industry – namely, user experience.\n\nHaving to deal with long strings of random numbers and letters is oftentimes the reason for mistakes, and in the field of crypto, mistakes are quite commonly very expensive. Normalizing addresses and presenting them in a human-readable and friendly way is a step towards improving the overall user experience, the way DNS improved the UX for Internet users.\n\nAt the same time, though, DNS records of domains and names are typically stored on centralized servers, making them prone to hacks. ENS, on the other hand, are secured by Ethereum’s blockchain, making them multifold and more secure.\n\nThat said, the Ethereum Name Service is undoubtedly an important invention and innovation that’s quickly become widespread and used by thousands of people."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZnNZMWtQYTdPNC1HbjFQZmZKTkdyVDNlX05Ga1lqTjRXNlB5Q3BYdjlCRmhRcDZzb2tPZFZTa3BNQzR4MXpXbXdiUkxRWkVkbmtyNWF5VzRVUHp5NUNMU2ppSFoyWE0zVnRhWmdqSEtqQzNoSHBZa0szS3B5U1NGRi10UlVxd9IBiwFBVV95cUxPUlVDd005aXViVWdmeWxQWC1zVFlkUE1GMnVlbWNDcGNjTjJCMWdVbkViT3BrTmJJaUVuN2R2SjlvX3NTdWZLM0R6S3BlYlZVajVGM3J1YjZYMV9VUHdKdi01RWpKMHpEZFFGUWFsdFdhQU5EbXBiYkxHeGlIdFlIZDRjQnhSdmVYZkZF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun’s big Ethereum bet: Whales eyeing ETH ETF gains? - AMBCrypto News",
        "content": "TRON founder Justin Sun purchased 1,614 ETH as the approval of Ethereum ETF nears.\n\nEthereum’s price action was looking bullish and it may hit the $3,300 level.\n\nThe cryptocurrency market is turning neutral and seems to be recovering after a major decline. Despite the attempt at recovery, the market sentiment remains bearish.\n\nHowever, few investors are looking forward to the approval of the spot Ethereum [ETH] ETFs (Exchange-Traded Fund) as they started ETH accumulation.\n\nJustin Sun buys $5 million worth of ETH\n\nOn 11th July, an on-chain analytic firm spotonchain made a post on X (previously Twitter) stating that TRON founder Justin Sun purchased 1,614 ETH worth $5 million.\n\nThe average buying price of this massive ETH was somewhere around $3,097.\n\nBesides this recent ETH purchase, he has also deposited a notable $45 million USDT to Binance which signals a likely future ETH purchase.\n\nSince February 2024, Sun has been continuously accumulating ETH. According to the data, he has purchased nearly 362,751 ETH worth $1.11 Billion at an average price of $3,047 through three wallets.\n\nOn the other hand, another whale named Golem appears to have stopped dumping ETH.\n\nAdditionally, Golem has staked a significant 40,000 ETH worth $124.6 million, according to Lookonchain. This recent activity by Justin Sun and Golem, signals potential upcoming bullish momentum across the market.\n\nEthereum technical analysis and key levels\n\nAccording to expert technical analysis, ETH is looking bullish as it gave a neckline breakout of a bullish double-bottom price action pattern in a 4-hour time frame.\n\nOn 11th July, 2024, if the ETH 4-hour candle gives a closing above the $3,135 level then there is a high possibility that ETH could reach the $3,300 level.\n\nAdditionally, on a daily time frame, ETH has moved above the 200 Exponential Moving Average (EMA). A price above 200 EMA indicates that the asset is in a bull cycle on a higher time frame.\n\nFurthermore, the Relative Strength Index (RSI) a technical indicator also indicates a bullish reversal.\n\nHowever, this bullishness will continue once the SEC approves Ether ETF. Recently, Bloomberg ETF expert Eric Balchunas has predicted that there is a high possibility that the SEC may green light spot Ether ETF by 18th July, 2024.\n\nIn a post on X, he stated that,\n\n“We don’t have a new over/under launch date yet because we haven’t heard what the SEC’s game plan is. Hope to hear soon. But if you forced me gun to head style to give my best guess for date I’d go with July 18th.”\n\nDespite the bullish outlook for ETH, in the last 24 hours, the open interest (OI) has been negative (-0.53%) which suggests lower interest from investors and traders in this current fearful market.\n\nLiquidation and price-performance analysis\n\nData from CoinGlass for the last seven days also signals that bulls are back to supporting Ethereum. If ETH reaches $3,300, approximately $1.18 billion worth of short positions could be liquidated.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nMeanwhile, if ETH fails to sustain the current breakout and falls back to the $2,900 level, approximately $1.46 billion worth of long positions could be liquidated.\n\nAt the time of writing, ETH was trading near $3,115 and it experienced a 0.5% upside in the last 24 hours."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9kQmlhUmFyNlVQbUQtVm44UVZzN0M3YnFtbWhPZnJzX28weVNtT1VOOHlsbVhpenhzUUZVR28tbjkzeFdSa1R3VWY5VjdGMHM4LThUYmNKVVpvRDZfWEpobm01VkNDVEVDU2pvMmFCODNtUDZRSW5CdUtR0gF_QVVfeXFMUEdFVUxlWU5wVFVEVDdqLVNkclhmcm1XbnIwZm91eVpWMU5sYW84eEV4b3p3am90b3o2dHhjMVN3bG52ZUxOdEw3T0tUQWxsa0pOeTJ3VDFNZE9WSVljT3BxNFgtbHFmcUNJR0ZNUkdmMXpZUC1ab29FNXRObHJySQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Free From Massive Sell-off From Top Whale - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) has just been freed from an aggressive sell-off by a top whale, spotted about a week ago. According to data from crypto analytics platform Lookonchain, the Ethereum whale, identified as the open-source decentralized computing platform the Golem Project, just staked 40,000 ETH. This staked fund is worth $124.6 million as of the time of staking.\n\nAdvertisement\n\nEthereum freedom after intense Sell-off\n\nPer previously referenced posts by Lookonchain, the Golem Project started sending thousands of ETH to centralized exchanges on July 8. In the first wave of the sell-off, the protocol sent 24,400 ETH worth approximately $72 million to Binance, Coinbase and Bitfinex.\n\nGolem Project was one of the foundational beneficiaries of Ethereum ICO as far back as 2016. At the time, the protocol raised 820,000 ETH when the price of the coin traded for just $10.2.\n\nWith the sell-off activated, this week, the outfit also moved another 4,600 ETH, valued at $14.1 million, to Binance and Bitfinex, as of July 9. On July 10, another 3,000 ETH deposit was made to Binance, Bitfinex and Coinbase.\n\nThe staked Ethereum was also moved on July 10, and while many feared further selling off, the Golem Project decided to lock up the funds for now.\n\nPerfect timing\n\nEthereum is the second major cryptocurrency responsible for the broader market sell-off at the moment. While the spot Ethereum ETF sentiment is expected to sustain sentiment and price growth, the reversal is the case.\n\nIn the early stages, investors looked to the ETF as a major catalyst to drive growth and, hence, went all out to buy the coin. With Bitcoin losing its position in the industry, the ripple effect on Ethereum saw many HODLers offloading their bags.\n\nKnowing its sell-offs might trigger a market slump, the Golem Project decided to sell its bag at a time when the impact would be least felt."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxONlB0OGZRd0hJd3hQU3FaLWlXa280UFVubVUtQkJYVXZPc2lNd1drcnFlVTlVd1BiVVFhRGVDLTJERTlxWENIMVp1TzJDZDZxdG9od3c4MFA0LXMzQzEwS2FEWUlENDdraTF3WExjaW0yd1RuNTRvVFlQem1meGFrMWpObnc3cHZKWFRHY29sXzk0Q3JkWWZzTUQzMUd1dDFFbkhHRUhqOG9MYWF0eWloZERXMUgzZ1RNM1puRHR5VnRxUjRoQVpLRmVGVmFCQWZ4RThoU290RdIB3AFBVV95cUxQSVZpSHZmUFduQjVGWFB6cjZQWV9ydkFrOWhLYzdvdUFZeURzc0hYVTBRU0lZSG12cGdmV1FyUjJORzctcXdadlRpSWlFU1VNZW5wUkNsNW54UEhXTTZwRkRoY3hRTGc4bGpYdUN5Q3JtUTVOVmZYYk1PSHgxNXUwa1dkazdfcGFUWmpKLUZ0aDVTSmFUVFFnTlhQNnp4U2E2cXFFaGVPTkNxYzBQclQ1ZzNlaXJmemlzR1ZHTWtOdVk4SG9xNFJXRVE5U3NYUUEzRFNvV0R0RnY1QV9p?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Could Continue Underperforming Bitcoin Even After Spot ETF Approval, Says Benjamin Cowen – Here’s Why - The Daily Hodl",
        "content": "A widely followed crypto analyst believes that Bitcoin (BTC) could continue to outperform Ethereum (ETH) even if a spot ETH exchange-traded fund (ETF) were approved as expected.\n\nIn a new video update, crypto strategist Benjamin Cowen tells his 803,000 YouTube subscribers that Bitcoin could continue to have an edge over Ethereum as past narratives about ETH outperforming BTC haven’t lived up to the hype.\n\n“I ultimately don’t think the spot ETF for ETH will necessarily keep the ETH/Bitcoin valuation from staying at relatively low levels… There’s been so many narratives that have been given out over the last few years as to why the ETH/Bitcoin valuation would never go to even the current levels that it’s at… In 2022 when ETH/Bitcoin was at .08 BTC, if you had told them that it was going to go down into the mid-.04s BTC by 2024 they would have laughed at you…\n\nWe have these narratives about the transition from proof-of-work to proof-of-stake on this deflationary mechanism theoretically causing the Ethereum/Bitcoin valuation to ‘hold up well’ and that didn’t play out. And so it sort of gave us a glimpse into the idea that, hey, maybe this is more about monetary policy than it is about anything else.”\n\nETH/BTC is trading for 0.05416 BTC ($3,112) at time of writing.\n\nThe analyst also says the Bitcoin dominance (BTC.D) chart excluding stablecoins could decline in the near term only to increase in the fourth quarter, based on historical precedence in both 2016 and 2020.\n\n“There is a case to be made that whatever pullbacks there might be will likely be over some time the next month or so… In Q4 of halving years, we have seen dominance go up both times.”\n\nThe BTC.D index tracks how much of the total crypto market cap belongs to Bitcoin. A bearish BTC.D chart suggests that altcoins are about to outperform Bitcoin.\n\n?\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1hZHF4MHI1VlUwMERZajZsaFZ1LTFuY2pRTW9VSXQ0M2xKa0JjbThhZUE5QVRwcTBnV1lzR25xblRGMzhDMkxSS1p5ZC1rYmlZX0hyUnNKYnpGZC0xdGVLeGFMUlcwTTF4S24tZjF1czREZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Can Ethereum [ETH] Hit $3,500 This Weekend? - Watcher Guru",
        "content": "Over the last seven days, Ethereum [ETH] has dropped by 7%. The largest altcoin took a hit similar to the rest of the market. At press time, ETH was trading at $3,090.81 with a daily surge of 0.33%. During its recent rally, the community expected ETH to revisit its all-time high of $4,891.70. But things did not go as expected. The real question is whether Ethereum will continue trading at its current level or witness an upgrade to $3,500 this weekend.\n\nChangelly revealed that Ethereum will indeed have a bullish week ahead. The altcoin is expected to surge to a high of $3,172.27 following a 2.85% rise from its current levels. While the altcoin is still away from the $3,500 zone, the upcoming days could build ETF to reach its milestone.\n\nFactors like market sentiment, regulatory concerns, and the launch of exchange-traded funds [ETFs] could boost the price of Ethereum.\n\nAlso Read: Upbit Lists Ethereum Name Service: A Market Impact Analysis\n\nEthereum ETFs To Hit the Market Sooner Than Later?\n\nThe Securities and Exchange Commission [SEC] and potential ETF issuers are arguing about “fewer and fewer” concerns in the S-1 filings, according to Katherine Dowling, chief compliance officer at Bitwise. Currently, there are eight spot Ether ETFs in the market. But Dowling also notes that the precise date is still pending. She said,\n\n“We’re seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC. So that points all signs in the direction that we are close. We’re close to the finish line on the launch.”\n\nDetails on the issuer and the securities they want to offer are included in Form S-1s. When authorized, the Ethereum ETFs can go on sale.\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNaFdKTk5wMmZvNFpfZE9FUGltLTRtZkFZb2ZNeDNfSFhyY0xTaGZqRy12eUNFd1pMdXJXdnA4cGdLRFJ1NEhWR184Q0pLSnNMc3E4clNyTGdqMFI4RWQ1WDJuLXBoOVRweWx4T2FRekxlVGtWSjFsMlJvZTh3RGVCaTY1LWI1VFFmTmfSAY8BQVVfeXFMUFN2VXFQeTBPVXRiSEg2ME15TWlfcUxMdzhuOEloUkJ4bGhHX2R1bC1Vc0JZYVMxNGs3QmVxY0RWU09QMHhvbmtIYll1T2E2bVVHRFdLRWh6M1ZZQnlHY2VxYmFvWVpjcFd6V3ZRd0lRSUYzVlBFZ2dVX0tnS0VLVXhqMHBuNjRMRDZQOUx4Uk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum’s balancing act: Whale deposits vs. exchange reserves - AMBCrypto News",
        "content": "Ethereum whales have been active with deposits in the last few days.\n\nETH has been on a decline after failing to sustain recovery attempts.\n\nIn recent days, Ethereum [ETH] has experienced varied price movements, with attempts at recovery frequently negated by ensuing declines.\n\nConcurrently, there has been a notable influx of ETH into exchanges, a movement largely attributed to whales transferring large volumes.\n\nWhile the immediate assumption might be that these large inflows could lead to price drops, further analysis sheds additional light.\n\nEthereum whale deposits more ETH\n\nRecent data from Lookonchain revealed that a whale wallet deposited 10,000 Ethereum coins, valued at over $31 million, to the Binance [BNB] exchange.\n\nThis transaction continued a pattern for this particular whale address, which has transferred a total of 30,000 ETH, worth more than $94 million, to Binance since the 1st of July.\n\nThis wallet is among several that have moved large volumes of Ethereum to exchanges in recent days.\n\nIncrease in Ethereum net deposits\n\nAMBCrypto’s analysis of the Ethereum netflow via CryptoQuant indicated that there have been more inflows than outflows on exchanges since the beginning of the month.\n\nThe data highlighted a significant influx at the start of the month, with over 72,000 ETH (approximately $250 million) entering exchanges.\n\nThroughout the month, there have only been three instances of net outflows. This trend suggests that more Ethereum has been deposited than withdrawn in recent days.\n\nAdditionally, it appears that substantial deposits by large whale accounts have significantly contributed to this pattern.\n\nExchange reserve remains at decent levels\n\nDespite the recent surge in Ethereum inflow to exchanges, the overall exchange reserve has not shown a corresponding increase.\n\nAnalysis of the exchange reserve chart revealed that while there has been a modest uptick in the last few days, it was relatively minor compared to the overall decline.\n\nAt press time, the reserve stood at about $52 billion, down from over $57 billion at the beginning of the month.\n\nThis suggested that the decline in Ethereum’s value may have influenced the reduced dollar valuation of the exchange reserves.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, although there has been an increase in Ethereum volume, it has remained fairly stable, with figures hovering around the 16 million range. So, the changes in volume have not been substantial.\n\nAs of this writing, Ethereum was trading at approximately $3,071, experiencing a slight decrease of nearly 1%."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQUFFKQWVYSUgxSXlZdXNRd3BUWU95MUJoNXByZF9wSDFGVGRPT0ZETjRRdDdfdFo2SU1seHNuUkpiOGd6WEt6WkwydFJobHY5OHVDNWw0cmNtS2kxZ2ZkbFN5WUpLZ3o3emxmZVU0eVpWclJ3N2I1QkRVOGtxNkRMQWVMY2NBWW5OVHdGUDFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH - Watcher Guru",
        "content": "Ethereum ETF inflows could spark a new all-time high for the asset upon the launch of the ETFs, according to analysts. The recently approved Spot Ethereum ETFs are earning a lot of attention before their launch, with experts predicting how high they will send the Ether asset. Cryptocurrency exchange Gemini recently predicted that the ETFs can expect to see $5 billion in net inflows over its first 6 months. However, new analysis suggests that that number may double.\n\nTom Dunleavy, a managing partner at crypto investment firm MV Global, believes that the Ethereum ETF inflows could soar beyond $10 billion. “We saw $15 billion in flows for Bitcoin. I think we’re probably going to see $5 billion to $10 billion for Ethereum,” Dunleavy said speaking to CoinTelegraph. “I expect a very positive price impact sending us to new all-time highs by early Q4.”\n\nAlso Read: Golem Network’s ETH Sale: A Strategic Ecosystem Move\n\nHow Will Ethereum Fare Once ETFs Launch?\n\nImage Source: WatcherGuru\n\nCurrently, nearly a dozen Ethereum ETF filings are awaiting final approval before the asset can launch on the market. Following the approval of Spot Bitcoin ETFs in January, the assets exploded in the first few weeks, catapulting BTC to an all-time high in March. Spot Ethereum ETFs are expected to do the same for Ether, which is currently the second-highest-performing crypto asset by market cap. Ether currently trades at $3,136.48, and its all-time high was $4,721.07 in May 2021.\n\nDunleavy said he expects ETH ETFs to attract around $1 billion per month as a “base case” for the next few months. Since the asset is “less available on exchanges” according to the MV Global representative, it may see more hype and demand, thrusting the currency to new highs quickly.\n\nAlso Read: Can Ethereum [ETH] Hit $3,500 This Weekend?\n\nThe last 24 hours have seen Ether increase almost 2%. Currently trading above $3,100, there are still investors disappointed in the asset’s performance. However, the long-term outlook for Ethereum post-ETF launch is extremely bullish. Just last week, VanEck, Fidelity, and other Spot Ethereum ETF issuers filed amended S-1 forms with the SEC. That brought the product one step closer to launch. Moreover, experts are now predicting the investment vehicle will begin trading within the next two weeks.\n\nIf this launch date prediction rings true, Ether could explode in price by the end of 2024 as Tom Dunleavy suggests. The ETF asset is likely going to mimic the performance of Bitcoin ETFs earlier this year. Therefore, expect a frenzy around Ethereum post-ETF launch, and watch out for a huge surge in inflows during the opening days of the ETF’s arrival."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUnhwVXc2MFhGNXQwdkVJSjZsMkhiVnNTZGo3NkUtb0hMamlLR09GQ2xMaXJpWW80dDAyUnBHVXVsYjY2bWtvX2o0aDhaSUR2MmwyVElSYjZEX3Bha3I5a0JJTDJvdFdaR0pYV0EySTdHR19VX0ZzUmk1dFpnRW96U1dYbXB6d3ZzUUJlYl8wR2dTcUNQ0gGaAUFVX3lxTE5relJPS1J3ZWdQYVBWbHRRSDhneVktdktRZXhqeDlYM1pfdW9zTnl6RWxVZ1NPNkxodDhLdF9TT0dNS3RCbFlCS2ZPLTAtSVpveFgzZUYtYnJxSExNX1c2RFU5anhWRHRMU0E0dTM1eGZfMEtiaURrUVVSc3JzU2xCa2xXOExtSjZYTnpEX1FLQWUzRkx2MjJERnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "ETH Gas Fee Flashes Inactivity Concerns Before Ethereum ETF Approval - CoinGape",
        "content": "Ethereum investors are currently sitting on the edge of their seats eagerly awaiting the approval of spot Ethereum ETFs by the U.S. SEC. However, just before the final decision on ETF approval, the Ethereum gas fee dropped to a two-month low suggesting major inactivity on the Ethereum network.\n\nEthereum Gas Fee Drop Suggests Major Inactivity\n\nOn-chain data provider Cryptoquant has released a new chart highlighting the recent trend in the average Ethereum gas fee (gwei). As per the below chart, the gas fee has dropped to the lowest level since May 2024, indicating a sharp drop in the activity on the Ethereum blockchain network. Historically, the chart shows a strong correlation between the rising gas fees and the increasing ETH price.\n\nadvertisement\n\nThis decline in gas fees raises the question of whether it is calm before the storm, especially with the anticipated approval of the spot Ethereum ETF on the horizon.\n\nOn the other hand, the Ethereum staking activity has peaked at new all-time high levels ahead of ETF approval. Ethereum whales have been accumulating the coins in the last few weeks and moving them to staking.\n\nA day before, Tron founder Justin Sun accumulated a massive $5 million worth of ETH. Since February, Sun has been on an ETH accumulation spree and holds $1.1 billion of ETH, expecting a strong surge after the ETF approval.\n\nAlso Read: Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K\n\nEthereum ETF Approval and ETH Price Action\n\nThe Ethereum price attempted to break past the $3,200 level on Thursday, however, the bull failed in this attempt pushing ETH back to $3,070. for ETH to reclaim the bull run, it has to surge past $3,200 giving a technical breakout above the diagonal formation as visible in the below chart.\n\n$ETH – I’m still positioned to expect upside and still think we go up but we haven’t reclaimed the diagonal and OBV hasn’t broken out yet. That OBV V shape looks really good and I’m betting on UP. But have to keep bias in check if we reject both of these. pic.twitter.com/xAy5wWiFCf — IncomeSharks (@IncomeSharks) July 11, 2024\n\nBitwise CLO Katherine Dowling recently said that the Ethereum ETF is currently close to the finish line. Prospective issuers are eagerly waiting for the SEC to provide updates on the pending launch. It will be interesting to see whether there are more filings pending ahead of the final approval.\n\nAlso Read: Bitwise Executive Says Ethereum ETF Is Close to the Finish Line\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUHlCVnVnWDE5ZEgwSmxJMEVjZFRxaWVhUzBFOFN5STl1eWc0Q0UwUGJrSHFXZWFPVWVPLVV4T29UcGl3eTdadGEzRVpmMHM2bW54MjJkemJrMUIyS0R5SFNlVVR0Tk42NFVLRFVXazRNWnFvYUllM3YtRV9YZGxrcDFlMTjSAYoBQVVfeXFMTnRmZ0JkWlNNMzVHcmpvNHFQQjJ2TmVVaWdLWXNoZ1FhT0Njc1B0UXZkaHZhSXVqZWl6UC1ZTkhIMXJWeThGTjBSNDVMQ0JvNW9jN05BVDlhNGJzNGRNc0NwQWRyLW0wTGYzUWp0Y1h3c1ZKdlB2bjNMejRkYkN2V2M3YjdMTFJyNWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Key Reasons To Invest In Ethereum And Solana Now - CoinGape",
        "content": "Ethereum and Solana, prominent Layer-1 blockchains and decentralized application (dApp) hubs, currently face significant market dips. Ethereum leverages blockchain technology in its open-source platform, ensuring secure decentralized applications. Solana, also open-source, exploits the blockchain’s permissionless nature to innovate in decentralized finance (DeFi).\n\nSolana’s price recently dipped, disrupting a short-term upward trend. Typically, such corrections persisted for over a month before recovery. Meanwhile, Ethereum price exhibits a bearish pattern, albeit with modest rebounds.\n\nadvertisement\n\nThese platforms are known for their distinctive strengths; Ethereum prioritizes robust security, whereas Solana offers high throughput and minimal transaction costs. Despite the current volatility, this combination of features makes them pivotal players in the cryptocurrency domain.\n\nAnticipated Growth with New ETFs\n\nEther and SOL are poised for significant growth with the anticipated arrival of new investment products. Ethereum is at the forefront of excitement with its upcoming spot ETFs.\n\nThe financial community buzzes as the possibility of introducing Ethereum ETFs as early as this week remains pending approval from the U.S.\n\nSecurities and Exchange Commission. Investment experts, like Bitwise Asset Management’s Matthew Hougan, are preparing to capitalize on this development. Ethereum’s price is expected to surge, potentially exceeding its previous peak of $4,867.60 in November 2021.\n\nOn the other hand, Solana is not far behind, with a major ETF launch planned for March 2025. As the market begins to stabilize from recent fluctuations, Solana has shown impressive recovery.\n\nThe Cboe Exchange recently confirmed that asset managers VanEck and 21Shares would list their Solana-based products, pending regulatory green lights. The exchange has formally requested approval from the SEC to list these innovative ETFs.\n\nEthereum and Solana Drive Innovation in Blockchain Technology\n\nEthereum and Solana are pivotal in the blockchain landscape, fostering dynamic ecosystems for decentralized applications. Ethereum, a pioneer in smart contracts, maintains a vast array of dApps encompassing DeFi and NFTs, making it a leader in the field.\n\nOn the other hand, Solana excels in scenarios demanding high transaction speeds and minimal delays, such as gaming and high-frequency trading, thanks to its superior throughput capabilities.\n\nThese platforms rank among the top ten in market capitalization, enjoy robust developer support, and enjoy surging trading volumes. Their ongoing rivalry promises further advancements, making them attractive investment prospects in the blockchain domain.\n\nETH and SOL: Surge In DeFi TVL Dynamics\n\nEthereum holds a significant advantage as the leading platform in TVL, representing the total capital held within its smart contracts. High TVL indicates strong user activity and commitment to the platform, suggesting many users are locking up their assets in Ethereum-based DeFi projects. According to data from Defillama, ETH’s total value locked is currently at $54.273 billion.\n\nSolana has a smaller TVL than Ethereum. It’s known for its high-speed and low-cost transactions, which appeal to a different segment of DeFi users and developers. Solana’s focus on scalability and efficiency has helped it quickly become a competitive DeFi ecosystem, attracting innovations and developers, which could boost its TVL over time. Currently, the total value locked is $4.47 billion.\n\nScalability and Efficiency\n\nHistorically, Ethereum has faced challenges with scalability and high gas fees, especially during peak usage. However, ongoing upgrades, notably the shift to Ethereum 2.0, aim to address these issues by moving from proof-of-work (PoW) to proof-of-stake (PoS), which is expected to improve transaction speeds and reduce costs significantly.\n\nSolana is designed for high throughput and can process thousands of transactions per second (TPS), making it one of the fastest blockchains. This technical advantage makes it an attractive platform for high-frequency trading environments and applications requiring quick transaction settlements.\n\nFrequently Asked Questions (FAQs) 1. Is Solana Faster Than Ethereum? Yes, Solana is faster than Ethereum. Solana can handle over 65,000 transactions per second, while Ethereum manages about 15 to 45. This speed comes from Solana’s special design for handling many transactions. 2. Is Solana Cheaper Than Ethereum? Yes, using Solana costs less than Ethereum. Solana’s transaction fees are very low, only a fraction of a penny. Ethereum’s fees vary and can be high when the network is busy. 3. Is Solana More Secure Than Ethereum? Ethereum is considered more secure than Solana. Its network is more tested and has more validators, which makes it more decentralized. Solana has had more issues with network outages.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPQkVqTFNSX1lPTVVMNUMtQmg3WllLVXhPSkd1VlQ1M2x2ZkRjQXhicHRwOTJ2ZmJzODhEbENZNEdzZllEN19pVnNvc1FoMExLYWU5YVVXdVlVUzFsRnhxTjYzTVJjOVFLSVBTenByV2YyQTF3WGNCR3ZsdFZLYmYzNUFNN0liTzhlQ0g4SXF6cTg4anZwamRsaldqU1c0dVlseldOZ0l0QnpVbUxsOW9lYU5sTWpXQ1ZCOHRXTE9tZnZiWElRYzdsYTRtMzlLQW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "PEPE Whale Transactions Hit $135 Million amid Ethereum ETF Buzz: Will the Price React? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNMldoR1h3QW44d3N5LVpoRmVxdFpxUFUyYXVabHpESVdrUkY2RG00T0RQWXljRldNQjFmbEFkZ200T0pmREs1bVd2amJIbktxRWFONzhlbXVSSm5fTTlRM29RejlPX2pfUjVVSUYxLS1HYmtoRkpzYkIzSkgzcnhTTmpVamI0RzJF0gGQAUFVX3lxTE95ZFJVdzlKc2VfTmpMRVB0Zm12NGlUcUNEUUVLRmo4TEhRZDhsZ25GX2RMVnhQelRrejdQMGNqRlltWGhfUjhfV0p4YVhPaEJET01ham9JZXlzVXFDd1RmQUk1c0RzZTk4azBDcS1IWWVZQl8yRGVlcFdFdTdYRjNoT3FMbTF6bHRFTmNJU0lBMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coin Bonk and Ethereum's Pepe See Big Losses - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMeme coins Bonk, Pepe, and Brett are among the top five worst losers in the top 100 cryptocurrencies in the past day, according to Coingecko data.\n\nSolana’s dog coin Bonk (BONK) has taken the greatest hit, falling 12.1% to $0.000023 on the day. This comes amid a Bonk DAO vote to burn 100% of the BONK earned by the Decentralized Autonomous Organization (DAO). At the time of writing, the approval is set to pass with 99.3% of the vote.\n\nMeanwhile Ethereum’s Pepe (PEPE) is down 9.6% and Base chain’s Brett (BRETT) has fallen 8.1%. These are outsized losses compared to the broader meme coin market, as defined by CoinGecko, which has slipped by 3% in the past 24 hours.\n\nOther big meme losers include Dogwifhat (WIF) which has fallen 5.1%, Mog Coin (MOG) down 12.7%, and Popcat (POPCAT) which has stumbled 10.6%. Even meme coin veteran Dogecoin (DOGE) is down 3.1%.\n\nAD\n\nAD\n\nIn fact, the meme coin market has been hit so hard that only one of the top 50 meme coins by market cap is in the green over the past 24 hours. Ethereum’s Kendu Inu (KENDU) is up 13.3% after a Coinbase video advertising its new wallet web app included the token’s ticker.\n\n“Notice anything chads,” the meme coin’s Twitter account posted, “Coinbase it’s time.”\n\nAccording to CoinGecko, KENDU has a market cap just shy of $100 million after its 21% rise over the past week.\n\nAD\n\nAD\n\nDespite the meme coin market taking a hit, zooming out it doesn’t look too bad.\n\nThe meme coin category has gained 3.1% over the past 7 days, with many of today’s losers still being valued higher than they were a week ago.\n\nThis includes MOG which is up 21.3%, Bonk up 12.9%, Doge still up 7.8%, Popcat 4.4%, and Pepe 5.2%.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOQVZyQ2owUGZJRmdXemFDNHV1S2pOWGoxeFhqa1U3TWJzZG1MUFNKWUtrV0YxUXBMY2xscEhSelRXTVJoVHlSOGhKeHV4UEhaT1FnSTIza1BCU20tWG1DR29Rc3pBX3hIem8teE42cTVWN3RyY2RNQ2RUMGNCcGxGbUN30gGHAUFVX3lxTFBOTkEybUpubFBFam1ELUFSV214V294ay1wRWdqQzZieVBfZ2RBX2hteG1YOWtDMXY0Nl9lTnl0RmcxU0kyN1RIWEM1cVkwQUZqNTBIS0FlYkFkMDZnLTJqbXJCM3ZOMHlUaWxiOFc5U1cwMHFHYXhEaVYzTUQ3WWRYVjFuRkJOSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Buys $5 Million in Ethereum (ETH), Price Rally Coming? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSpotOnChain has reported that a suspected wallet of TRON founder Justin Sun is buying the Ethereum (ETH) dips. He reportedly purchased 1,614 ETH at the $3,097 price level. Sun spent around $5 million in USDT to make this purchase.\n\nAdvertisement\n\nThis is a notable development for ETH as it comes at a time when the coin has been trying to recover from its recent losses. Moreover, Justin Sun is a notable personality in the crypto realm. Such moves by Sun can leave a strong impact on the market.\n\nAdditionally, SpotOnChain revealed that the TRON founder has been buying ETH continuously. He has allegedly acquired 362,751 ETH since Feb. 8. Three different wallets were used to buy these coins at the price level of $3,047. The estimated cost of these ETH purchases is around $1.11 billion.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097.\n\n\n\nSince Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇).\n\n\n\nNote that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nIt appears that Justin Sun is not done with Ethereum yet. Per SpotOnChain, he has also deposited around 45 million USDT to crypto exchange Binance recently. This move shows that he may be using this USDT holding to buy more Ethereum in the coming days. These potential purchases are expected to boost ETH.\n\nAdvertisement\n\nImpact on Ethereum price\n\nAs mentioned above, significant purchases by market leaders like Sun can leave a positive impact on a coin. In the case of Ethereum, Sun already has a major holding, as he may buy more coins. This can have a positive impact on the ETH price and the broader crypto market in the long term.\n\nAs of writing this article, Ethereum is trading around $3,126.54, an increase of 1.5% over the past day. While this is a minor upward trend, it is still a positive move, as it appears that ETH is trying to initiate a recovery. Moreover, Justin Sun’s significant ETH purchases are expected to inject bullish momentum onto the market."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNTDdKMXNacXlLY0RwWnZQZEVMZDUtQ1FPN1BHRW5MUC1RN09ZdFg2a1lZNWZPNVJxWGIzTFdHSHdsNXB1OE1XYXFEV19HdXA4bHZDZWRIdXh2eW44OHJ5bWJoaV9PNXBVWW1vQWhxQmNtQ084V1RLQ09lcjdxS0pzTm9CcDRZbEdXRVB3V0FnTWwweGo0WlJ3TExXTDc4WWJnZV9lUWtndEZMS19mc1lDcm5rMHNZS0dLY1N3Y1JsaHp4TDVVRkZLemdQNW8tQ0lr0gHWAUFVX3lxTE5sbjVWNXBINjhpTVdDN3AtQTg4Y3l2UVl5SVI2dEtEN09Fc3paS19EYldtTWlNS2JFS2hhLU85S0NXRG1WT01CSUs5QXhUQUpKSGs4YTdpaHFDQnhsQll5NFBtbGtPRlVBWVZPMlZIVHVOY0JEcTF3bmhrY291MnVpUHhzR2hlcGtQWkQ2MGdrT3dfTVA1QnU5OVI5WllIM1dtZ3Vzemh6bzVuNjR5RzlRbnNvTzlod0JmWm5wNG5Wbnd6UDhuNXhCemtQdjJMcVEwb0FGdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Trader Says Ethereum Rival To Perform Well Over Coming Months, Updates Outlook on Bitcoin and Celestia - The Daily Hodl",
        "content": "A popular crypto trader thinks one Ethereum (ETH) rival is primed to perform well over the coming months.\n\nThe pseudonymous analyst known as Altcoin Sherpa tells his 217,800 followers on the social media platform X that he’s “pretty neutral” on Solana (SOL) over the short term but more optimistic on the asset as 2024 winds down.\n\n“I still believe $120-170 is a decent region to accumulate SOL overall, and I think this still does pretty well in the second part of the year. Not really expecting this one to move until the overall market environment improves though.”\n\nSOL is trading at $140.87 at time of writing. The 5th-ranked crypto asset by market cap is down more than 1% in the past 24 hours.\n\nAltcoin Sherpa also shares his prediction on Bitcoin (BTC).\n\n“Expecting a few days of green, after that, I have no clue. Next week should be pretty telling if we’re headed back within the range or not. Short-term bullish but mid-term, no clue.”\n\nBTC is trading at $57,519 at time of writing and is down more than 1% in the past 24 hours.\n\nThe analyst also says he plans to watch the native asset of the modular blockchain network Celestia (TIA) for a potential bull flag.\n\n“Modular is back and sexy. I’m looking to buy TIA at $6.00 or a bit lower. Let’s see if/when it comes.”\n\nBull flags, as the name suggests, are typically seen as bullish technical setups that imply an upward impulse and then a brief consolidation before another move up.\n\nTIA is trading at $6.82 at time of writing. The 66th-ranked crypto asset by market cap is down more than 3.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQMFFJVkxJSUdTNkM4ZUlxczNXQzFfODFGRGVyUVI1X1lsSEhKSlR2WFpza0hBQnBfWFlIZkJNZVpvakJlY1N1Y2ExSjYxS3VUM0xOOEpQdTgwc205cnYxOWNFYlRudEJQYnZIaFJ2WGxpQmRYZDY1dUtFaUY3ZmF0ZzF4TFhIVVhqMERfNGZMc2VZQVFKSkJJLWdWaFNQVEIzeEtoT251eVRka3ZMRll4c09CSUJPMlJIejhR0gHAAUFVX3lxTE50OEpHQm01c1NRaFY1azNXLU54d0NTSmhVZ0wwTEdRb0tueklna04xR1lJWUtzU2sxSTBjV04xNDk4b29VOW12TWJYOG9rSGw3Nm5oR0dZLVZmZWU4NG14UUR2b2s1d2xYUE42UElGa0IyZ0V3eUdOYkRmQ3lwa2VZWkRwNVQ1WDNlR3pfbWw5ZnJwOTgxNXU2ai03cW1QRzVCSlB3QXFSc2tZWmpEUWdKcldoQWJUWkNDdWd6X3YwdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "ETH/SOL Price Prediction: Ethereum Shows Bullish Signs as Solana Struggles - CoinGape",
        "content": "Ethereum price decreased by 2.7% in the last 24 hours to trade around $3,067 during American hours hours on Friday. On the other hand, the Solana price dropped by 5.4% in the last 24 hours to trade at $135.39. ETH price gained 4.52% against Solana on Thursday, going into the wee hours of Friday morning before retracing back a little bit.\n\nEthereum Price Eyes 7% More Gains Amid Fearful Markets\n\nThe Ethereum price action is trending below the 21-day, 50-day, and 200-day simple moving averages (SMA), while the relative strength index (RSI) is at 39 and rising. This indicates that bullish momentum is building on the Ethereum asset. The RSI also aligns with the chaikin money flow (CMF), which is at -0.05 and headed upwards. These two oscillating indicators signal that ETH price may be inbound for more upside.\n\nadvertisement\n\nEthereum price prediction shows the asset has bullish tendencies as the price action trailed back into the falling channel. A resistance barrier exists around the $3,300 level that, if broken, may catapult the price of ETH to $3,950.\n\nEthereum price has formed a double bottom against Solana, with 5.16% gains remaining until the market structure is completed.\n\nSOL Competes with Ethereum Price Amidst ETF Rumors\n\nOn the other hand, Solana price is trending inside an ascending triangle in the 4-hour time frame and is currently at the bottom trendline. The asset is also trending below the 21-day, 50-day, and 200-day SMAs, which is not bullish. The 200-day SMA currently offers a resistance of around $143, which coincides with the horizontal resistance line of the ascending triangle.\n\nIf the price of SOL breaks above the ascending triangle, it may surge 18% to $172. On the flip side, if bears prevail, the asset may find lower support around $121. The SOL RSI is trending at 41.61 and headed down, which shows increasing bearish momentum.\n\nNevertheless, the asset is at a crucial point against ETH price, where a bounce back could result in 15.74% gains.\n\nNate Geraci, president of ETF Store, shared Roxanna Islam’s prediction that more Solana ETF applications may be filed if the ETH ETF is confirmed. Cboe’s 19b-4 filings for VanEck & 21Shares already hint at the industry’s readiness.\n\n“I believe more issuers will submit spot Solana ETF filings after the spot ether ETFs are finalized.” –@roxannaswan Agree. My $$$ is on Bitwise first. pic.twitter.com/FoR84Fy9If — Nate Geraci (@NateGeraci) July 12, 2024\n\nBottom Line\n\nEthereum price action suggests a potential increase, targeting $3,950 if it can break through the $3,300 resistance level. Meanwhile Solana price prediction shows positive momentum in the short term against Ethereum, bucking the trend in a market where many crypto investors remain cautious. It trades within an ascending triangle pattern but shows increasing bearish momentum with its downward RSI. The price of Solana could either surge to $172 if it breaks above the pattern or find support around $121 if bearish trends continue.\n\nFrequently Asked Questions (FAQs) 1. What is the current price action for Ethereum? Ethereum's price has decreased slightly but shows potential for bullish momentum. If it can break through the $3,300 resistance, it could reach a target of $3,950. 2. What are the critical support and resistance levels for Solana? Solana is currently navigating critical support and resistance levels within an ascending triangle pattern. It could potentially surge to $172 if it breaks above the pattern or drop to $121 if bearish trends continue. 3. What are the potential impacts of ETF rumors on Solana and Ethereum? ETF rumors have a significant influence on the market. More Solana ETF applications may be filed if an ETH ETF is confirmed, potentially impacting both cryptocurrencies' market dynamics and price movements.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdS1FWXpZMzJEX2JtX1FxSVd2Nm4ybFF2Ym1vU0dJd3BhaDVCS3JxZmFNcmtRRlVXbDhaX2tqTGhwRGxBLW9qYnIwVlc4T0NpUmVXWlMwZ00zRl9lT1poSkZ0cEZ3dmFWMmgzUmZ6dGI2cTh1SGJYRVhXb2dmd2ExQzF30gGHAUFVX3lxTFBSYjQzck1kdjhBQi1NZV9JOFAySGxIRkItT091RjVtNmFKQjBkazg0T0RjaXBtYkZCaTZrVnZjbE5DRkQ5dzh2SGx3b2ZOUndmTE85ZHpwM3FvLTJPdmNnbUFadm9NUG1sNFgwYmU1Q2R2ZnhxZWd1d1ZQVHI2UXRYN1RFOE1Ncw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Buys $5 Million In ETH Ahead of Ethereum ETF Approval - CoinGape",
        "content": "Amid the current market volatility, the Ethereum (ETH) price is showing strength and holding steady around $3070 levels. There’s a massive whale activity currently happening around Ethereum, with Tron founder Justin Sun trying to absorb all the selling pressure before the upcoming approval of spot Ethereum ETF, scheduled within the next two weeks.\n\nJustin Buys Ethereum in Huge Quantity\n\nAs per on-chain data provider Spot on Chain, Tron founder Justin Sun spent a total of $5 million USDT in order to acquire 1,614 ETH at a price of $3,097 per token.\n\nadvertisement\n\nSun has been on an Ethereum accumulation spree since the beginning of the year. Spot on Chain reports that since February 8, Justin Sun has reportedly accumulated a total of 362,751 ETH across three different wallets, for an estimated total investment of $1.1 billion, and an average price of $3,047 per ETH.\n\nAlong with these purchases, Spot on Chain also noted that Sun recently deposited 45 million USDT to Binance, suggesting the possibility of future Ethereum acquisitions.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097. Since Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇). Note that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nInterestingly, the ETH whale accumulation has been happening just ahead of the spot Ether ETF approval, likely to happen before the end of July.\n\nAlso Read: Justin Sun Confirms Development Of Gas-Free Stablecoin Solution\n\nEthereum Whale Activity Jumps\n\nWhile Justin Sun has been picking up Ethereum from the exchanges, there have also been huge ETH deposits taking place recently. In the last 24 hours, the Golem Project was one of the major depositors of ETH to crypto exchange Binance. However, on-chain data shows that they have reportedly stopped selling ETH, while simultaneously staking a total of 40,000 ETH.\n\nMoreover, Elwood Technologies has also deposited 26,811 ETH worth over $84 million to crypto exchange Binance in the last three days. However, some of the Elwood-related addresses also withdrew 24,463 ETH from Binance during the same time.\n\nAs of now, the ETH price is holding firmly above $3,000 despite this massive whale activity. Technical indicators suggest that the Ethereum bottom could already be in.\n\n$ETH – Thought we were gonna bounce at the first support (red line) but that broke. The good news is this support is looking much stronger and that’s a much better response. I’m hoping that was the low of Q3. pic.twitter.com/GzitxuQN8i — IncomeSharks (@IncomeSharks) July 10, 2024\n\nAlso Read: Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUDhBNW1lUEhGZUhLNTRiQVE4YjlNOFJldkYwQWVDM3B6REFCWWh0eEZ6VEkzc3hnOExKRmU5cjNpYTVmbGd3bkdyMHJELUktZEdrcmh3MktPaDNZRkN2cEYyMXRtaHNNdHZleEZNeWJibWlsRC1zYjMyTlo2SzJ4Zmc0NXBqOWVNVTFyTNIBkgFBVV95cUxQOW9uU2taS2FvTG8zSFBYUGs1ZlpRTm1lVFEtOHJVdWJpem1MeUtlNGlLSVJJbl9NTjNpMndRcnlrUVRMT1pTaXREX3U2Wm9LYnAwc3dsNVdJSy10RGpZbHQzOVY3cGw5TUh6RW96OUtkaWMybnF1RVBnajk4blVMS3UyZUliSmZtU1ZVUDczeEduZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs ‘close to the finish line,’ celebrates Bitwise CCO - AMBCrypto News",
        "content": "The launch of Ethereum ETFs remained uncertain despite Gensler’s summer prediction.\n\nSEC’s cautious crypto stance contrasted with the Bitcoin ETF approval under Gensler.\n\nAmid mounting anticipation, the upcoming launch of a spot Ethereum [ETH] exchange-traded fund [ETF] has garnered significant attention.\n\n\n\nRemarking on the same, Katherine Dowling, Bitwise’s chief compliance officer, emphasized the uncertainty surrounding the exact launch date.\n\nBitwise CCO on ETH ETF\n\nDespite SEC Chair Gary Gensler predicting a summer debut for the ETH ETF, Dowling in a recent conversation with Bloomberg, said,\n\n“We’re seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC.”\n\nShe further added,\n\n“So that points all signs in the direction that we are close. We’re close to the finish line on the launch.”\n\nTime for a crypto-friendly SEC admin?\n\nThis is quite surprising because Bitwise was one of the first issuers to take proactive steps by submitting an amended S-1 form to the SEC ahead of schedule, on 8th July.\n\nThis move had back then sparked excitement within the crypto community about the imminent approval of the ETH ETF.\n\nHence, the delay and uncertainty in approval highlight the SEC’s cautious stance on crypto during the Biden administration.\n\nExpanding on the topic, Eric Balchunas, Senior ETF Analyst at Bloomberg, put it well when he said,\n\n“Looks like Solana ETFs are going to have a final deadline of mid-March 2025. But between now and then the most imp date is in November. If Biden wins, these likely DOA. If Trump wins, anything poss.”\n\nReiterating the same, Dowling added,\n\n“I think it’s going to be a really long haul to get some of these products out in the market, given the history we’ve had with getting these products to market and the fact of not having futures trading in some of these potential products.”\n\nNot all bad things!\n\nHowever, she also highlighted the SEC’s potential for positivity during the ETF approval process when she said,\n\n“But it’s an act of dialogue and I think our communication with the SEC about the prospects for these products has actually been quite welcoming.\n\nThis is important because, despite the SEC’s historical lack of interest in crypto, the current leadership under Gensler approved a decade-long-awaited Bitcoin [BTC] ETF.\n\nNeedless to say, the performance of the BTC ETF has been phenomenal since its debut on the 11th of January. As of the latest update on the 9th of July, the BTC ETF recorded inflows totaling $216.4 million as per Farside Investors."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQQ0t4MDVrZGlhcFBrcXg3YWNYdkpIMUY4S0JmRjRMcUltemVnVVZ5TXZlRlk0VVNoUzVyNGRrREJCSl9oTEkzcmp4Q1ZWeTRFSHNHMjY0ek94dHF2N2FHejNIYm1abWliNG9iSGpFWEFTQUs0QVhHQWVKYkViSUl5Rm13dWpjcElVYndjTVIyUnJ3VVFLQWVpdEhaOEI3Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Tron founder Justin Sun Buys 1,614 ETH Worth $5 Million USDT - Crypto Times",
        "content": "Tron founder Justin Sun has significantly boosted his Ethereum holdings, purchasing 1,614 ETH valued at approximately $5 million USDT.\n\nAccording to Spotonchain data, this acquisition is part of Sun’s ongoing spree since February, during which he has amassed a total of 362,751 ETH across multiple wallets, investing roughly $1.1 billion at an average price of $3,047 per ETH.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097.\n\n\n\nSince Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇).\n\n\n\nNote that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nThe recent ETH purchases coincide with preparations ahead of the anticipated approval of a spot Ether ETF by the end of July. Spot on Chain, an on-chain data provider, also noted Sun’s deposit of 45 million USDT to Binance, suggesting potential future Ethereum acquisitions.\n\nMeanwhile, Ethereum whale activity has surged, with notable deposits and transactions. The Golem Project, for instance, made significant ETH deposits to Binance but has reportedly ceased selling while staking 40,000 ETH.\n\nElwood Technologies followed suit by depositing 26,811 ETH, valued at over $84 million, to Binance within the last three days. However, withdrawals of 24,463 ETH from Elwood-related addresses on Binance were also observed during the same period.\n\nDespite these large-scale movements, Ethereum’s price has remained resilient above the $3,000 mark. Technical indicators suggest a stable support level, indicating potential bullish sentiment in the market.\n\nInvestors and analysts are closely monitoring these developments as they anticipate the impact of increased Ethereum holdings and whale activity on market dynamics leading up to the ETF decision.\n\nThe ongoing accumulation by major entities like Justin Sun underscores growing confidence in Ethereum’s prospects amidst market volatility."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOeEhwMFJ6YzJ6UnpjcURfRTlQY2U2QUV6UTB5bHVldHl6b2lnWHZQSkhTRndyb2ctUEoyNmxVS19DT19BeU9QVmpkQk9oRW1OM3FNazF6Ym5sRHRUQTBaU0tpc1dMUy1NQmdzbHVKQkllUnoxakdOX1I2akZKOHdsb1BPS3owWTMyVG91MFVDdEVOcWVCalJr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "The Ultimate Cryptocurrency to Buy With $1,000 This Summer - The Motley Fool",
        "content": "Amidst the recent market correction in crypto, Ethereum stands out among a crowded field for several reasons.\n\nAfter a strong start to 2024, the crypto market suddenly fell by nearly 20% last month. While it is still well within bull market territory, the recent correction can present a compelling opportunity for investors looking to bolster their exposure.\n\nHowever, not every crypto is cut from the same cloth. Just because there is a widespread correction doesn't mean just any cryptocurrency is worth your hard-earned money. While a handful could meet this criteria, one in particular stands out from the crowd -- Ethereum (ETH -7.32%).\n\nThe pending approval of spot Ethereum ETFs\n\nCrypto has come a long way in the last decade and a half, culminating in the recent approval of spot Bitcoin ETFs in January. A spot Bitcoin ETF allows investors to buy and sell shares that represent real Bitcoin (BTC -4.18%) on the stock market. Not only does this serve as a de facto stamp of legitimacy, but it also opens up the underlying asset (in this case Bitcoin) to a broader range of investors, specifically those who prefer the regulated environment of traditional financial markets.\n\nSo far the spot Bitcoin ETFs have been hit and one of the most successful ETF launches in history. In hopes of snagging the next big thing, attention has shifted to Ethereum.\n\nCurrently, there are eight applications under review by the Securities and Exchange Commission (SEC) to grant approval for a spot Ethereum ETF. While these processes can be cumbersome, the consensus is that they will gain approval sometime this month, and in the worst-case scenario, by the end of summer.\n\nWhy it matters\n\nThe approval of spot Ethereum ETFs will undoubtedly have a significant impact. First and foremost, it will open up Ethereum to new money and buyers, just like we are seeing with spot Bitcoin ETFs. Most evident are institutional investors. Known for their deep pockets, with a regulated and secure way to gain exposure to Ethereum, the expectation is that there will be an influx of institutional capital that can drive up demand and, consequently, the price of Ethereum.\n\nTake a look at Bitcoin for evidence. When Bitcoin ETFs were approved, Bitcoin surged 50% in just three months following approval, showcasing the potential impact on Ethereum.\n\nHowever, while there's no way to estimate the total influence of spot ETFs in the long term, there is some clear and compelling evidence that could show where Ethereum is headed in the short term.\n\nAt the beginning of May, many analysts estimated that the chances of a spot Ethereum ETF being approved were less than 25%. However, things quickly changed just a few weeks later.\n\nOn May 20, reports started circulating that the SEC was pivoting and planning on granting approval. In a matter of hours, Ethereum jumped more than 20% from roughly $3,000 to $3,800. Fast forward a month or so, and now Ethereum has fallen victim to the wider cryptocurrency sell-off that occurred, with its price now back down to around $3,100.\n\nYou might be able to see where this is going. The ETF approvals are likely a matter of when, not if. When they are approved, it would likely be safe to assume that Ethereum should, at a minimum, rise back up 20%, as this is how the market reacted when initial reports of approval started circulating. While 20% might not be massive in the world of crypto, it is still a commendable return and one that could be just the beginning of a more significant upward trend.\n\nThe opportunity at hand\n\nThe ETF news is incredibly bullish for Ethereum, not just in the short term but also in the long term. However, this is just one aspect of Ethereum's value proposition.\n\nEthereum is one of the most proven blockchains with clear utility over the years. It is the primary blockchain of DeFi, one of crypto's most prominent and innovative use cases, with more than 60% of the digital economy calling Ethereum home. Additionally, it has recently attracted the likes of BlackRock, which is pioneering the tokenization of real-world assets on the Ethereum blockchain.\n\nAll these factors combined make Ethereum the ideal crypto investment this summer. The pending ETF approvals, coupled with its proven utility and increasing institutional interest, position Ethereum as a standout in the crypto market. Investing in Ethereum now could offer substantial returns as the market recovers and new opportunities arise.\n\nSo, while the recent market correction may have caused some hesitation, it's important to see the bigger picture. Ethereum's robust ecosystem, ongoing developments, and potential for ETF approval make it a compelling investment and the ultimate cryptocurrency to buy with $1,000 this summer."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPOVB5NkxRV0NxU3VkRDFtSlhkTXB4SDNOQm9WbGhkdF84VFVnYkdkc0lLOWpadnc0TjRqazZKUXc3cC1BN2xRalEwNmJzZnlHV21URkdVaU9zUm11em1ibWdfLUl3WUNCQnJhN1MwbFF0ZnM0YlZnSWtCN0VCN0NKRWloNjNwTzRzcEozNDFlS08yQkVEVUJUTlBLc28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Here’s How High Cardano Could Rise if Ethereum Reaches $50K - The Crypto Basic",
        "content": "If Cardano (ADA) continues to boast a strong correlation with Ethereum, its price could set a new all-time high of $5.91 when ETH hits a target of $50,000.\n\nDespite the recent market turbulence, Ethereum (ETH) remains one of the top cryptos, and it is expected to recover its losses and surge to loftier heights.\n\nLast year, leading asset manager VanEck projected that Ethereum’s price could surge to $50,000 per coin by 2030. Since VanEck issued this forecast, it has become a major topic of discussion within the broader crypto community.\n\n- Advertisement -\n\nThis debate gained momentum earlier this year after the SEC approved multiple exchange filings relating to spot Ethereum ETFs. With VanEck projecting a price target of $50,000 for Ethereum by 2030, crypto enthusiasts are deliberating on how this could impact other assets like Cardano.\n\nCardano’s Correlation with Ethereum\n\nLike Bitcoin (BTC), Etthereum’s performance usually affects the price actions of other tokens in the market. To put this into perspective, while the ETH price is up 3.22% over the past 24 hours, ADA has witnessed a daily growth of 4.56%.\n\nMoreover, data from IntoTheBlock shows that Cardano has an 82% correlation with Ethereum over the past 30 days and an 86% correlation with Bitcoin.\n\nCardano’s Price If Ethereum Hits $50,000\n\nGiven Cardano’s correlation with Ethereum, it is expected that ADA’s price could soar remarkably if ETH hits the $50,000 target projected by VanEck.\n\nAt the time of writing, ETH was changing hands at $3,008. This suggests that ETH must rally 1,562% from its current price to reach the $50,000 target.\n\n- Advertisement -\n\nIf Cardano experiences a similar 1,562% growth, its price, currently trading at $0.3561, would soar to $5.9183. This price could mark a new all-time high for Cardano. Recall that Cardano’s previous ATH of $3.10 was registered on September 2, 2021. It is currently down 88.51% from its all-time high record at press time.\n\nThe coin has also crashed 9.84% in the past week, 22.1% in the monthly charts, and 39.9% year-to-date (YTD). Despite this bearish performance, Cardano could still witness a tremendous surge to $5.9183 if its price continues to correlate with ETH.\n\nBesides this estimation, some market watchers have forecasted Cardano’s potential surge to a $5 price level. In March, prominent crypto chartist Ali Martinez projected that ADA could reach a target of $5 before the end of this year."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNWUNIWV94dkRMM0xrZGRUYzB4dGhWb05sN1BwWko0NWtwc1U0NnE4dnQ2REJSWVVhMlpUODU4WEFFSW1PUzRJSTE2QmdJYnR4UEpVdmJEWDBvaVdQeGNTM3JiSmtmTXBnNVJLcnA5Ni1KRkpJV2FPMFlSUkF4SnkyUndhQ0t4YXE2NW1iZngtT2N2eVdQYUxfY21sb1QxWTBZUUhEUk5Ba2lneldoQlJ6QzBLZGUzMXkzUmc3dWZTWUZVRGxzWUZXcmIwcldVbVNDLTNyalVVd0JYQW5IM1ZLZllkazQwR3RKR1psall5SGzSAfYBQVVfeXFMT2RrTUlPUENBTXZfanZNOERMeWFfUlZHNHo2LXFxMkJlZENkYUl6TE5kQzZMZy1xSUdlNFJDdVEyenV5bmN0ZnJzYXR4Z0FwU0ZwV1BmZzlTdHlleXJFQktSVjhJMWNYaWlUS0UyZUUxSGlpN3BDQm1BQ1hVU2ppdG45Z1gyeElFV3l2WTE2MURtaUNIY181aEFDQ1gtVzNSRXVWeUQ5NVo2dklzbnVQck9JVTdMei1GS1VkVDJGNHdyd1R3RzlGeHJ2Tk1JNzZvUjFQeFpaUGIzd3FQV3pZeVkzSnRfcmdGcjYxN3l5Y05jMENPYndB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin volatility surges amid impact of US CPI data - FXStreet",
        "content": "Bitcoin price finds resistance around the weekly level of $58,375; a breakout of this level could signal a bullish move.\n\nEthereum finds support around the key level at $2,817, with potential recovery on the cards.\n\nRipple price finds support around the weekly support level of $0.413, impending rally eyed.\n\nBitcoin (BTC) initially dipped before rallying after the release of US CPI data on Wednesday. Ethereum (ETH) and Ripple (XRP) are possibly set to mirror BTC’s pattern, showcasing the synchronized dance of cryptocurrency markets.\n\nBitcoin price shows potential\n\nBitcoin has encountered resistance near the $58,375 weekly resistance throughout this week. As of Friday, BTC is trading at $57,250, showing a slight decline of 0.2%.\n\nFurthermore, BTC is currently below a descending trendline formed by connecting multiple swing high levels from early June to mid-July.\n\nIf BTC closes above the weekly resistance at $58,375 and a breakthrough above the descending trendline could potentially lead to a 9% increase, targeting a revisit of the daily resistance at $63,956.\n\nMoreover, the daily chart shows a lower low formation on July 5, while the Relative Strength Index (RSI) indicated a higher high during the same period. This bullish divergence often signals a trend reversal or a short-term rally.\n\nBTC/USDT daily chart\n\nConversely, if BTC closes below the daily support level at $52,266 and forms another lower low in the daily timeframe, it could indicate continued bearish sentiment. Such a scenario might trigger a 4% decline in Bitcoin's price, potentially revisiting the low of $50,521 observed on February 23.\n\nEthereum price displays resilience with promising upside\n\nEthereum's price found support on Monday at $2,817, which was its low on May 1. It rebounded by 2.7% in the next two days. As of Friday, it is trading slightly up by 0.32% at $3,059.\n\nIf Ethereum's price closes above the $3,240 level, ETH could potentially increase 8.8%, targeting a retest of its daily high from July 1 at $3,524.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are currently below their respective neutral levels of 50 and zero. For bullish momentum to be sustained, both indicators need to rise above these critical levels, which could support the ongoing recovery rally.\n\nFurthermore, surpassing the $3,524 level could open the way for an additional 5.5% rise, aiming to retest the next daily high, recorded at $3,717 on June 9.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick closes below $2,817, forming a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could potentially trigger a 7% decline in Ethereum's price, targeting a revisit of its daily support at $2,621.\n\nRipple price eyes a rally\n\nRipple's price found support near the weekly mark of $0.413 early this week, rebounding by 4% over the subsequent two days. As of Friday, it trades up by 0.6% to trade at $0.452.\n\nA daily close above the $0.450 threshold for XRP could potentially fuel an 11% rally, targeting a revisit of its daily resistance level at $0.499.\n\nOn the daily chart, both the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are currently positioned below their critical thresholds of 50 and zero, respectively. To maintain bullish momentum, these indicators need to rise above these levels, potentially bolstering the ongoing recovery.\n\nFurthermore, surpassing the $0.499 level could pave the way for an additional 6.4% increase, aiming to retest the next daily high at $0.532 recorded on June 5.\n\nXRP/USDT daily chart\n\nHowever, if Ripple's daily candlestick closes below $0.413, forming a lower low in the daily timeframe, it indicates sustained bearish sentiment. Such a scenario could potentially lead to a 16% decline in Ripple's price, targeting a revisit of its low from March 12 at $0.347."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNaDhIR2pvUGhSUW9CdDlGNzZ5MExSVVZYSnRCMmZHdHJia1hRUU15QkZmWWVZZnk0VmliWnZrdkdVWUNfTmFIWnRDNTBnckgxRFNkQl92YlF6c2dIakI4ck1DN0owSXEwako4VGIwNGpFMFFnbm01dmRhdFQtcE05SlRlaXFjY3JkY0RNRTNyeTJ2Wk4w0gGaAUFVX3lxTE1XVkRMbXVUT3V4WDdhd2JQeW1KaXhhZmdTZU5TT21VNHpsWnZQZnFUa0ktbUlnMDloMlVQal9qNDhBUjRkY016c1dFSHJBY2pBX19jVmtYUE1uS0tvYjhIUldESy1CbWFydkFFRkhWOWdmUGI3cktFVlpjZWp4NGwzdFJBVHowQXNmR3RNRFY3YlBpSGtDSGRJR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "4 Undervalued Ethereum Altcoins Gaining Institutional Interest - CoinGape",
        "content": "The consolidation trend in the cryptocurrency market continues as the leading digital asset Bitcoin struggles to sustain above $58000. Amid the uncertainty, the Ethereum altcoins in the ecosystem show a slight uptick due to market speculation of spot ETH ETFs getting approved around mid-July.\n\nA recent report by on-chain data tracker Lookonchain reveals significant Ethereum price ecosystem token accumulations by whales and institutions. Notably, aavebank.eth withdrew 21,027 AAVE ($1.98M), 205,493 UNI ($1.62M), 446 ETH ($1.37M), 102,313 LINK ($1.28M), and 20,797 ENS ($534K) from Binance.\n\nadvertisement\n\nMeanwhile, whale “Ox345f” withdrew 508,001 PENDLE ($1.89M) and 1.08M LDO ($1.77M). These large-scale transactions suggest a bullish outlook on Ethereum altcoins, indicating strong confidence from major market players.\n\nHere are the top four Ethereum ERC-20 tokens from the list above, each well-positioned for a significant market reversal.\n\nEthereum Altcoins -Chainlink (LINK)\n\nChainlink (LINK) is a decentralized oracle network that plays a crucial role in bridging real-world data to smart contracts on the Ethereum blockchain.\n\nAmid the current market uncertainty, the native cryptocurrency LINK is hovering sideways above $12.2 support. This horizontal level has been intact for the past eight months now coinciding with 200W EMA to create a strong accumulation zone.\n\nToday, the Chainlink price jumped 0.44% to trade at $12.4, while the market cap surged to $7.53 Billion as seen on CoinGecko. A potential rebound could uplift the asset by 28% before challenging the key resistance of a downloping trendline.\n\nAn upside breakout from this resistance will offer a better confirmation of sustainable recovery.\n\nAlso Read: Ethereum Price Forecast: Dwindling Open Interest Hints Sluggish Climb To $4,000\n\nUniswap (UNI)\n\nUniswap (UNI) stands out in the decentralized finance (DeFi) landscape as a leading decentralized exchange (DEX) built on the Ethereum blockchain.\n\nUNI, the native governance token of Uniswap, has been trading sideways for the past five months amid the triangle formation. The two converging trendlines of the chart setup are majorly influencing this altcoin’s price movement.\n\nCurrently, the Uniswap price trades at $7.75 seeking support at the pattern’s lower trendline. Consequently, the Uniswap market cap holds at $4.65 Billion, while the 24-hour trading volume is at $123.1 Million.\n\nA potential rebound could push the asset 20% before piercing the upper boundary of the triangle. This breakout will signal the end-of-correction pattern and attract momentum trades into the market.\n\nLido DAO (LDO)\n\nLido DAO (LDO) is a prominent project in the Ethereum ecosystem, known for its innovative liquid staking solutions. Amid the recent market correction, the LDO price fell from a $2.5 high to a $1.4 low registering a 44% loss.\n\nThe $1.4 support marked as the August 2023 bottom, provides the LDO buyers with renewed demand pressure. With an intraday gain of 3%, the Lido Dao coin trades at $1.629, while the market maintains around $1.45 Billion.\n\nIf the support holds, this altcoin may rally 22% before challenging the first resistance carrying the correction trend. The daily chart shows two downsloping trendlines that the buyers need to breach before reclaiming better control over this asset.\n\nEthereum Altcoins To Buy: AAVE\n\nAAVE is a leading decentralized finance (DeFi) protocol that allows users to lend and borrow a wide range of cryptocurrencies.\n\nOutperforming the market consolidation, the AAVE price has been rising for five consecutive days. From the multi-month of $75.5, the altcoin surged 23% to hit $93.27 and the market cap jumped $1.39 Billion.\n\nThe AAVE price currently testing the downsloping trendline of the descending triangle pattern indicates a pivot momentum for the coin holders. If buyers flip the overhead trendline into suitable support, the ongoing recovery could chase the potential target of $134, followed by $153.7.\n\nHowever, a bearish reversal could signal the continuation of the consolidation trend within triangle formation.\n\nAlso Read: 32.7 Million Ethereum Staked, Nears ATH: What Is Fueling This?\n\nKey Takeaway\n\nThe ongoing consolidation in Bitcoin and Ethereum shows no clear initiation from buyers or sellers to drive the crypto market. However, as the BTC price faces additional supply pressure from the German Government liquidating their Bitcoins, the potential approval of ETH ETFs bolsters Ether. Thus, the market whale/institutional entities show a higher interest in the Ethereum altcoins increasing their possibility of reversal.\n\nFrequently Asked Questions (FAQs) 1. What is a \"spot ETH ETF\"? A spot ETH ETF refers to an exchange-traded fund that directly holds Ethereum as its underlying asset, allowing investors to gain exposure to its price movements without owning the cryptocurrency themselves. 2. What does \"whale accumulation\" mean? Whale accumulation refers to large-scale buying activities by individuals or entities (whales) who hold significant amounts of cryptocurrency. 3. How does \"support\" function in technical analysis? In technical analysis, support refers to a price level below which a cryptocurrency has historically not fallen, suggesting a concentration of demand or buying interest at that level.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQblNxbHZnRnBDSEpqTEZSc28xT2ZSSFNFSHR6SVJJMk54aTJLbXRwaFF5TkpUX2UwYll1YWJGMG5LNzJsYUdCeFdubE5YMTdHbks1eE56dGdhY2xpQzVva2hWS2lQUmlYbHlmZERmektxN1lHb3lqNW5iOXU5bmhENXEwREQzMXZJREpKV193RHjSAZYBQVVfeXFMUE8teVptSWJUb2dBT1JicUFKSkwxeDVkRDZmdDJWa1J1NXJqOWxJZEx6TDI4eTk4MFR6bmotZy01UnZZdURVUHVRZUFQaUZPOWpGSzJSdEdLWVd0RHlyMXJkSzlpTHhvWHdpSVhSQllkV3RYeG9BOHV3UktoR2sxeG42aGJVTWRtOVQtLVdHNDFyNXVfbDRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum HODLers lock 6400 ETH in Beacon Chain – Why it’s important - AMBCrypto News",
        "content": "Sentiment appeared bullish ahead of the ETH ETF launch, with 40% of the total Ethereum supply now locked.\n\nBulls have kept bears at bay, suggesting that ETH might inch toward $3,500.\n\nOn the 11th of July, an unknown market participant transferred 6,400 Ethereum [ETH] to the Beacon depositor wallet. The Beacon Chain is the system responsible for validating new blocks on the Ethereum network.\n\nTherefore, sending coins to this wallet implies that holders would rather lock the supply than engage in trading them.\n\nLocking a lot of coins could reduce selling pressure, and in ETH’s case, it could prevent it from declining below $3,000.\n\nETH supply continues to fall\n\nHowever, that was not the only thing. According to Glassnode, the ETH 2.0 New Deposits have been increasing.\n\nWhen this metric increases, it means that holders of the altcoins are socking away at least 32 ETH in expectation of rewards.\n\nCoincidentally, this is happening at a time when the spot Ethereum ETF launch is approaching. Going by this development, the drop in circulation suggest that the Ethereum community seem bullish on the event.\n\nShould more ETH get locked, the price of the cryptocurrency might increase. In total, the total Ethereum supply locked was 40%. Out of this, 28% has been staked and 12% — bridged via smart contracts.\n\nBut for the price to increase, the number of coins on exchanges has to reduce. To check if this was the situation, AMBCrypto assessed Ethereum’s exchange inflow and outflow.\n\nExchange inflow tracks the number of crypto sent into exchange via external sources. Exchange outflow, on the other hand, is the number of ETH withdrawn.\n\nIf the exchange inflow outpaces the outflow, then the price risks correction. However, a rise in the outflow gives credence to a potential price increase.\n\nAccording to Santiment, ETH’s exchange inflow was 26,500 while the outflow was 37,500. Considering the difference, there is a high chance ETH’s price might jump days or weeks after official trading of the ETFs begin.\n\nA rally will begin sooner or later\n\nFollowing the development, Benjamin Cowen, founder of Into The Cryptoverse, commented on the potential price action.\n\nAccording to Cowen, ETH might begin to outperform Bitcoin (BTC) by the fourth quarter of the year. He said,\n\n“If it follows last cycle, it means ALT /BTC pairs begin their final drop in August, ETH/BTC begins its final drop in late September, and then BTC dominance tops sometime in Q4.”\n\nMeanwhile, data from IntoTheBlock showed that Ethereum might not wait till then before it starts doing well. This was because of the state of the Bulls and Bears indicator.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nBulls refers to those who bought about 1% of the total trading volume. Bears are those who sold the same ratio of the volume.\n\nAt press time, bulls dominated ETH bears, indicating that buying pressure was more. If this remains the case going forward, ETH’s price might revisit $3,300 and might approach $3,500."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOY2VzQjBUSHhKVUM2aFFOOEhfRTNPN3dpTkNDXzU0SnREU3dwYzJ2Q0RYeElQM3RTbVdUUG9rVXZ0djRBR3FTWHpsNkJtcldXLWdaWFhKNFJudTNhSUpkVUtMazUwZ3U0ZXJveEQ1bGt2Q3FabFJ3UDVXcWlCS09CaWU0ZVZrT3hkVVYyUjNMNXZObmM1aGJKRHlsVVdWZ9IBowFBVV95cUxNOEx2aWJ3TnBMenhCVXRsczAwUWlScl9VSU1iR2R5blF3cEk5LXVaTlhRN3VPVGtESDNtRHBMSXdkM08zU2lVLWhkTVFtalZ3WldyajRoT0xacWRva1MtM3BCT283TGZWYm56TzVzWEd3VXJJZ3hUWFZneVBRQ3htaEdMYU9uS0k0MWVGMFZlLXh6d29pVlBJUldpT0paX3RNcHRV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service Price Prediction: Why ENS Lags Despite Network Growth - CoinGape",
        "content": "The Ethereum Name Service (ENS) price decreased by 3.4% in the last 24 hours to trade at $26.03 during American trading hours on Thursday. The price drop negates the substantial growth ENS is experiencing in network adoption and integration. Can ENS price catch up to its fundamentals?\n\nEthereum Name Service Price Analysis: Rising Channel Hints 21% Short-Term Gains\n\nENS price has been trending inside a sizeable rising channel since July 5. Rising channels are famous for breaking out to the downside. The price of ENS also recently broke downward from a short descending channel, reaching the bottom trendline of the rising channel.\n\nadvertisement\n\nThe price action of ENS is also trending below the 21-day, 50-day, and 200-day simple moving averages. The 200-day SMA is currently offering some resistance to the asset’s price. A break above this indicator may result in a 4.11% surge that places the ENS price at $26.65, which coincides with a falling trendline acting as resistance. If ENS breaks above this trend line, it may increase by 17% to trade around $31.83.\n\nData from Santiment shows that altcoins like Ethereum Name Service (ENS) have grown in their networks in the last 24 hours, with 741 new wallets created. However, the ENS price still lags.\n\n📈 Altcoins like Ethereum Name Service (ENS) and Treasure (MAGIC) have erupted in network growth over the past 24 hours, surpassing major milestones. Historically, when projects see these spikes while at a flat price performance, there is an increased chance of a breakout. pic.twitter.com/9Ejnbd2IzW — Santiment (@santimentfeed) July 10, 2024\n\nMarket Speculation Impacts Ethereum Name Service Utility\n\nWhile ENS provides a valuable service, the token’s utility is currently overshadowed by speculative trading. This is further supported by the Chaikin Money Flow (CMF), which is below the zero line and heading downward. It indicates that the selling pressure on ENS is growing.\n\nNevertheless, the ENS Market Value to Realized Value (MVRV) Z-Score is below the zero line, indicating that it may be an opportune time to accumulate ENS as it is undervalued.\n\nGeneral Market Downturn is Pulling ENS Price Down\n\nENS is part of a bigger market that is greatly influenced by Bitcoin price movements. The recent BTC sell-off affected many cryptocurrencies, including ENS. However, given the robust network growth, a slight market recovery may result in significant price surges for the token.\n\nBesides, the total supply of ENS tokens is capped at 100 million, and their distribution can affect their price. Santiment shows the ENS Gini Index (a measure of the inequality among the values of a frequency distribution) at 0.903, indicating that the ENS distribution among holders is near perfect equality. The risk of whale dumps and sell-offs on ENS is almost 0.\n\nBottom Line\n\nDespite significant Ethereum Name Service network growth, the ENS token price has not kept pace with these developments. This disconnect between network adoption and token value suggests that other factors, such as market sentiment, may be influencing ENS’s price performance.\n\nFrequently Asked Questions (FAQs) 1. Why is the ENS price lagging despite network growth? The ENS price lags due to factors such as market speculation, selling pressure indicated by the Chaikin Money Flow (CMF), and general market downturns influenced by Bitcoin's price movements, overshadowing its network growth. 2. Is now a good time to invest in ENS? With the Market Value to Realized Value (MVRV) Z-Score indicating ENS is undervalued and the Gini Index showing near-perfect equality in token distribution, it may be an opportune time to accumulate ENS, despite the current price lag. 3. What is ENS? The Ethereum Name Service (ENS) is a distributed, open, and extensible naming system based on the Ethereum blockchain. ENS aims to map human-readable names, such as \"example.eth,\" to machine-readable identifiers, including Ethereum addresses, other cryptocurrency addresses, content hashes, and metadata. This system simplifies the process of interacting with Ethereum addresses and other resources, making blockchain technology more accessible and user-friendly.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQZHZWd3JRbi0walJBdGpRUmlMYkZwZ0R3RDhpMmZNbk83eUd3QmtjdW1XbnpDNmpETUp6ZDlmNS11ZXl6dDN1WUlHUEYzdHAzLUhINHVwS2VQSmtWTnM2Y2kydFh1UTc2NnNkTGMtVDVrVDQtSHNscUVCYWV3ZGZtaTJkclhZajhPSDQ1cjQwV3I1eGFhSVYtZXR4SkY0RGNUT29rb9IBqgFBVV95cUxQcHVjcVZudjF1Y2pPN0ZoSHB5UUR4Y1g3aVZaVG40Q0VkN3dfRnNELTg4bDRXSjYxMXM3UEVDeUVKYzl2OHc3YnRENWhkTHhGZ0NyTV9TQlRVQVNCQnkyVXUwMHFxTUxpQmhpdGc3c0FVNTV4RU5EV1JidEZWREZOVlVHbktUU1hNQVNvamZrMklYWkk4dktHa1NDUXVDdDhMLVUwcXhyRU9iUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Staked Ether Close to All-Time High as ETF Approval Nears - CoinDesk",
        "content": "The increasing supply of the second-largest cryptocurrency is a sign it has returned to being an inflationary asset, undermining its capability to act as a store of value over time. There are ways to counter this such as staking, which locks ether for a fixed period of time, and burning – or permanently removing from circulation – a portion of the transaction fees paid by users."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9qY08xTV81MGM1WGxQbFdtbjBiVUhVTy15eFVpYzJnNXdidWpwandRZTRQcG1wamZsYXd5SmtsOWFPMUkxWlRjZzkyaVdHOUN0Y1oyRTBWLUtTVUxjWFF6U2NVWWlHRU9NQmN6RFduZmZ6a2NVdUtCTW9RVURET3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin’s vision for the future of Ethereum - City A.M.",
        "content": "Vitalik Buterin’s vision for the future of Ethereum\n\nVitalik Buterin speaks at EthCC in Brussels, 2024.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nVitalik Buterin, co-founder of Ethereum, offered a comprehensive perspective on the current state and future of the ETH blockchain at the Ethereum Community Conference (EthCC) in Brussels. EthCC is a major event where developers and enthusiasts gather to discuss Ethereum’s advancements and challenges. In his keynote, Buterin addressed a packed room, highlighting both the strengths and vulnerabilities of Ethereum and proposing ways to fortify the network against potential threats.\n\nThe Ethereum co-founder began by outlining the strengths of Ethereum, focusing on its ability to support complex smart contracts that have fostered a robust ecosystem of decentralized applications (dApps). These applications range from decentralised finance (DeFi) to non-fungible tokens (NFTs), showcasing Ethereum’s versatility. He also praised the Ethereum community for its international and intellectual diversity, for its contributions to the network’s development and governance. It is the community that ensures the integrity and continuous improvement of the Ethereum blockchain.\n\nButerin did not shy away from discussing Ethereum’s weaknesses. He pointed out that the network struggles with handling a high volume of transactions, which leads to increased fees and delays. Security is also a concern, as Ethereum can be vulnerable to different types of attacks, including those targeting smart contracts. Additionally, using Ethereum can be complicated for new users. Newcomers may find managing wallets and interacting with decentralised applications difficult. There are also challenges in becoming a network validator. The validation process requires a significant amount of Ether (32 ETH) and technical knowledge to run a node. These issues can limit the network’s growth and its ability to attract more users.\n\nTo address these threats, Buterin proposed several solutions. He suggested increasing the quorum threshold from 75% to 80%. This means that a larger majority of validators would need to agree to confirm transactions. This change would make it harder for malicious actors to control the network. Buterin also advocated for automated responses to 51% attacks. During such attacks a bad actor controls more than half of the network’s mining power. This automation would allow honest validators to quickly move to a new fork of the chain. The goal behind this improvement is to reduce reliance on manual coordination. Simplifying the protocol and improving usability were also key points, aimed at making Ethereum easier and safer for everyone to use.\n\nButerin’s commitment to Ethereum’s continuous improvement was evident throughout his speech. He has been a frequent speaker at EthCC, discussing various topics over the years. In previous conferences, he tackled issues such as abstraction and the network’s evolution. His ongoing engagement with the community underscores his dedication to refining Ethereum and addressing its challenges head-on.\n\nButerin’s keynote at EthCC highlighted the dual nature of Ethereum’s journey—its strengths and its areas for improvement. By focusing on decentralisation, community engagement, and protocol simplification, Ethereum can overcome its current challenges and pave the way for a more robust future. As the blockchain continues to evolve, Buterin’s insights and leadership will remain crucial in shaping its trajectory."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQbWZ6QUh6b29VdWdZMjg0MWlGWFlBaHpFQmg0dkpOdGxaaGdEakVYczlGbWxqb0RPTzBPVUt0WXA5MG1oQUJPN0xBSWF5a0F3TUF2NzgtQk9QeXZHQi1aa2ZyTGdDV1pmRm52ZWxGZjVUUFN2bmtCYXFBallHRUxPNmZmQkY5YzVkYWd4WXJlNjBHazI0c3JQZzF4UnpzdG9fNWxYdE95d0RvUk1RQkZlUVVmS0o0d3A4NUpWV3Z6cjU2Z2xHWFRLb19yTGc4WDN1Y2cwMnFCVkNOUWFNVExhd2c5WWFLVU50X1lneE9XY0V1RHpVdG9GS9IB_gFBVV95cUxNOFJtWWRyTGFhZ3FWbng5VkpuZ1dSTGdCcTRZYTNtREszaFRKM2xXTzRUYVE5UGVUWXZHdVlkeUFWN1VVR2d2WEZiQ1pkSF9MVDJWVTV5SmxsaHlZWlVzU05ERWVCeEwyMTBjMzRsMkdZMjViM25FTVk2dUMxR0gzc3FrZDNOcXhyZG50UGo0eV9SQ2YxV3ZiMDBkLVotUVpya3FDbUE5dk8tbmQxbmluNFpFb2hXVE5xeFpVeHZKODJGRHp6RU00dGlzZUtNbzI0c0pxdHFFajliYWNOWlNYWFozWTA5Y0czM0w2aEpJQmt5VzRzdXUzMGxsaHh0dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum and Ripple rally even as whales make big moves - FXStreet",
        "content": "URGENT: The Compound Labs website (compound[.]finance) has been compromised. Please do not visit the website or clink any links until further notice. An update will be provided when available. This is our final message // end of tweet.\n\nOne of the greatest minds in crypto, @VitalikButerin just held a keynote at @EthCC . Topic: How to strengthen the Ethereum ecosystem. In case you missed it, here are the best parts of Vitalik's talk ⤵️ pic.twitter.com/10dwe8y6rI\n\nThat’s nice and all, but we can see by looking at Ripple’s financials in the years after this video 2017-2020 that their software revenue is around 2% and the other 98% is selling XRP. By looking at their expenses, we can see they would be out of business with XRP sales. pic.twitter.com/51RII7Tksl\n\nONDO is trading around $1.000 at the time of writing. ONDO is likely to rally 8% and extend gains to $1.093, the upper boundary of the Fair Value Gap (FVG), as seen in the daily chart above.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQVmdxdDV2U2pMNnBzY0Rod0VvMm9td1puVGFEUGM4ZTNUMnRJazNfS0xnZHdZLS13N2ZQenF4V2l5VklYVzVJTEFENWxWOVJaeXhFOTJSYjJfd3BxeV9aVENYNU1nQ3J3ajN6VmNPSlFxQUUwM2M4OFBCZnZpa2dNNkFXRllSY0JZT2hPbmZPOF9qcUlEYUdDbXVIXzY4VVJVNWNxQkduek1RMEpxUVJnSWJiSVgxTTNEblJpUFRjLXZVRXZKeHpSZGpUWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Recover As Germany Runs Out Of BTC To Sell - Benzinga",
        "content": "Cryptocurrency markets are trading up as PPI data has sparked speculation of an interest cut in September.\n\nCryptocurrency Price Gains +/- Bitcoin BTC/USD $57,825.58 +0.6% Ethereum ETH/USD $3,129.43 +0.5% Solana SOL/USD $138.75 +1.2% Dogecoin DOGE/USD $0.1076 +0.4% Shiba Inu SHIB/USD $0.00001644 +0.3%\n\nNotable Statistics:\n\nIntoTheBlock notes that 83% of Bitcoin holders are in profit at current levels despite the volatility. While concentration by large holders stands at 12%, 70% of holders have accumulated the coin for more than a year. Exchange netflows widened by 163.9%.\n\nDegen News revealed the German government is out of Bitcoin.\n\nCoinglass highlights 40,300 traders liquidated in the past 24 hours for $126.7 million.\n\nNotable Developments:\n\nTop Gainers:\n\nCryptocurrency Price Gains +/– ORDI ORDI/USD $33.56 +8.5% Maker MKR/USD $2,498.75 +6.5% Ronin RON/USD $2.05 +4.9%\n\nTrader Notes: Andrew Crypto sees a \"clean break above $59,200 next to continue this bullish momentum.\"\n\n\n\nHe concluded, \"A reclaim of the range is needed to confirm a local bottom.\"\n\n\n\nAnother crypto trader noted that \"Just like that market sentiment shifts to more positive but still doubt over hangs price performance. Will need to see multi-day follow through from spot buyers.\"\n\n\n\nCrypto trader Kevin also highlighted that Bitcoin has recovered nicely as Germany runs out of all its Bitcoin. He also reaffirmed his prior prediction that if Bitcoin \"can break above $60,000 and hold it then we can negate this pattern, which would be bullish.\"\n\n#BTC almost broke down last night but has recovered nicely since.. Germany all out of BTC. Send it higher https://t.co/Pbyn34rcUU pic.twitter.com/bBzYVmkw2x — Kevin (@Kev_Capital_TA) July 12, 2024\n\nCryptoquant Founder & CEO Ki Young Ju revealed that whales use a lot of leverage at cyclical bottom. While he suggests trading like a whale, he added \"whales use a lot of leverage only at the cyclical bottom.\"\n\nRead Next:\n\nImage: Shutterstock"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPY3hsSGRmZ2RBRUczRGxhY0IyU2lVWk41SUhhanNqN0JLYTcxeFpvLUI5TmxhN3p0N3VKanZ1N0F2QUpwcFdOSTRPdDYyNldTNWpqSy0yVnJXNEE4U3BCX0VnTlg0N21CSWo3bXg5bEMxVHlCU0Z4b3NuV3NfUXIyM1lIbGNMZVJ3WUpZS0xsTDZNTnFBeFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Shiba Inu Price Post Ethereum ETF Approval: Is SHIB Hitting $0.0016? - Watcher Guru",
        "content": "Ethereum ETFs are currently the most hyped element of the cryptocurrency universe. With the proceedings already in check, the Ethereum ETF approval can prove mega bullish for crypto, sending ETH to touch new price highs. At the same time, investors are also bullish for Shiba Inu to touch new price levels post ETH ETF approval, as SHIB is one of the most promising tokens running in the Ethereum chain.\n\nAlso Read: US Economy Is Slowing Down, Showing Signs Of A Possible Decay\n\nShiba Inu Price Prediction After Ethereum ETF Approval- 100x SHIB Rally?\n\nSource: WatcherGuru\n\nCoinpedia Markets, a notable crypto analytical platform believes that SHIB can rally 100x once Ethereum ETFs are approved by the US SEC. The popular analytics platform took to X to share an update, adding an extensive list of coins that have the potential to skyrocket post-ETH ETF approval.\n\nThe analysis indicated SHIB’s meteoric rise to $0.000167 if it surges up to the 10x level. If the token manages to spike by 100x, SHIB’s current value will be at a price level of $0.001679.\n\nMoreover, the token has always predicted a few tokens that are capable of ascending to new highs after the ETH ETF approvals. The list includes names such as Pepe, Toncoin, Render, Ondo, SHIB, and Turbo to name a few.\n\nShiba Inu July Prediction: How High Can SHIB Trade This Month\n\nThe new forecast of SHIB hitting the $0.0016 price mark soon has already sent shivers of excitement within the cryptocurrency space. Shiba Inu’s lead developer Shytoshi Kusama is also expediting efforts to streamline SHIB by conducting interactive tours across the world.\n\nAccording to Changelly, July seems to be a good month for SHIB, as the token may soon catch pace, to earn its lost valuation back this month.\n\nChangelly predicts the token to hit $0.0000269 by the end of July 2024.\n\n“Crypto experts have analyzed Shiba Inu prices in 2024, so they are ready to provide their estimated trading average for July 2024 — $0.0000269. The lowest and peak SHIB rates might be $0.0000168 and $0.0000371.”\n\nAlso Read: Cryptocurrency: 3 Coins Every New Investor Needs To Keep An Eye On?\n\nWith Shiba inu burns surging at a rapid pace, the token may seek stable price value sooner than its predetermined timeline."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxPQ0xOejE0ZWVoMUowNm82ME5ZT1lGcG5tRDNQTnpXQTM4OUdTbVFndG5pbl9HYjNDc0RpVmVEUjBiS2xZOUZNVXh4TGVqT1lGeFgzMVNMUy16OGFsQUtVUEJJbzM3SEVZZ3JJNS1jRjJadTRSSV90TGNFLXdfZ1dHLUZnWjBfT2EzWEdMcWFqZVRmbjVpWnZiMmp3TU10cXJleXphVlcxTml3Z2d3RkNIa0tXcFRhTm1HR2xmQ0F0NHNuTFAwSndQZXJZM3FHV1NsZExmN2Nsb01EVHE3MEUySmE3MXBpNjlPakxfQ3ZVaElsOW_SAfgBQVVfeXFMTVVyZGt2aktWQ01vTjJoVDkwenRtWHJoU05qQ1BPbjRRUHBrZ1dRTUlNRGpTbFJzdkZ2ZW55ck5TNVpEeEpWN0NBeDR4TDBfMmRDRWM3RU40MHJyQ2Q5dVhYcF9sM2lKblJ6MWpab3d3V0RFQlQ2SHJXTWNnR2VBRkxSU2tmbzUzeDVCODFQLTgyaHhlaWRuLTU1eHliZVd0b2RkMTRJYVlWVkNHMFF4OUZ5NGoxYktya3ppSF8xaDRjWHRpTDBQRVZyS1AzakxnQklQVG45eHdEb3VBMnUwaXVjMHpLa0NEcFJmOUlOUkxMUkhKeGlhRkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $57,000, MANTRA Becomes Biggest Gainer - ABP Live",
        "content": "Bitcoin (BTC), the world’s oldest and most valued cryptocurrency, dipped below $57,000 early Friday. Other popular altcoins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — landed in the reds across the board as the overall Market Fear & Greed Index stood at 40 (Fear) out of 100, as per CoinMarketCap data. The MANTRA (OM) token emerged to be the biggest gainer, with a 24-hour jump of over 7 percent. Memecoin BONK became the biggest loser, with a 24-hour dip of over 11 percent.\n\nThe global crypto market cap stood at $2.1 trillion at the time of writing, registering a 24-hour loss of 1.16 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $56,985.22, registering a 24-hour dip of 1.25 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 51.20 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $3,082.31, marking a 24-hour loss of 0.08 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.79 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 1.41 percent, as per CoinMarketCap data, currently priced at $0.1062. As per WazirX, Dogecoin price in India stood at Rs 9.75.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour jump of 1.58 percent. At the time of writing, it was trading at $68.23. LTC price in India stood at Rs 6,045.38.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.4507, seeing a 24-hour gain of 0.25 percent. As per WazirX, Ripple price stood at Rs 40.44.\n\nSolana (SOL) Price Today\n\nSolana price stood at $135.88, marking a 24-hour dip of 3.43 percent. As per WazirX, SOL price in India stood at Rs 12,357.\n\nTop Crypto Gainers Today (July 12)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nMANTRA (OM)\n\nPrice: $1.04\n\n24-hour gain: 7.16 percent\n\nNEAR Protocol (NEAR)\n\nPrice: $4.88\n\n24-hour gain: 6.05 percent\n\nMaker (MKR)\n\nPrice: $2,374.17\n\n24-hour gain: 4.50 percent\n\nAave (AAVE)\n\nPrice: $92.70\n\n24-hour gain: 4.11 percent\n\nSafe (SAFE)\n\nPrice: $1.50\n\n24-hour gain: 3.69 percent\n\nTop Crypto Losers Today (July 12)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBonk (BONK)\n\nPrice: $0.00002276\n\n24-hour loss: 11.26 percent\n\nCelestia (TIA)\n\nPrice: $6.27\n\n24-hour loss: 10.33 percent\n\nBrett (Based) (BRETT)\n\nPrice: $0.1085\n\n24-hour loss: 9.15 percent\n\nRender (RNDR)\n\nPrice: $5.85\n\n24-hour loss: 7.89 percent\n\nEthena (ENA)\n\nPrice: $0.3862\n\n24-hour loss: 7.15 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin briefly rose above $59,000 but couldn't maintain that level. It's facing difficulties breaking past the $60,000 resistance due to several factors: investors anticipating Fed interest rate cuts, the German government transferring BTC to exchanges, and the liquidation of leveraged long positions. The next resistance level is at $57,750, while support is at $56,000. Investors are also eagerly awaiting the US SEC's final decision on spot Ethereum ETFs, expected later in July.”\n\nCoinSwitch Markets Desk noted, “Germany has rapidly offloaded its confiscated bitcoin holdings, transferring over 35,000 BTC, valued at $3 billion, to exchanges in the past three weeks. This move might ease concerns among crypto investors about potential supply overhang from large sellers like the U.S. government and the Mt. Gox estate, which have also recently moved substantial amounts of BTC to exchanges.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin is currently trading at $56,923, down 0.89%. The price has declined from the $59,500 resistance zone and is now below the $57,500 mark and the 100 hourly SMA. A key declining channel with resistance at $58,400 is forming. If BTC fails to stay above the $56,500 support, it could continue to move down further. Bears could gain strength below the $56,000 support level.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “In June, Bitcoin opened at $67,741 but closed lower at $61,529, down 15.2%. The Crypto Fear and Greed Index hit an 18-month low, indicating waning investor confidence. Concerns arose from the German sale of more than 27,000 BTC and instalments from Mt. Gox. Despite a brief increase in daily active addresses, overall Bitcoin network activity has decreased. Bitcoin dominance peaked at 52.92% on June 15, the most since April 2021. Immunefi reported a loss of $572.7 million due to hackers in Q2 2024, with significant breaches on Bitcoin DMM and BtcTurk. However, there have been positive signs of adoption, including the expansion of Strike in the UK, the legalization of Bitcoin in Bolivia, and increased activity in Bitcoin ETFs and mining companies.”\n\nShivam Thakral, CEO of BuyUcoin, said, “Bitcoin crossed the $59,000 mark immediately after June CPI data showed that inflation was negative in June. The news uplifted the market sentiments and resulted in a mini rally across major digital assets. The probability of the US fed going for a reduction in interest rates is at 70% versus less than 50% one month ago. The strong ETF inflows suggest that investors are actively buying the dip in the BTC prices which may be a good sign for the long-term market.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, the overall market remained positive ahead of the U.S. CPI announcement. Despite the CPI data being less than expected, which is typically bullish for the market, the market declined afterwards, indicating underlying weakness. Currently, BTC appears weak, while altcoins are showing strength due to falling BTC dominance. ETH is also following BTC's path and could fall further if BTC declines. In the higher time frame, BTC's price action looks strongly bearish; if it loses $57,000, it could drop significantly, with key support levels at $53,600 and $50,700.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE44OFNtRnBaaXZtbnBEd1E3QTVia2VOVExQOFVHenNueWhVSVpLVjhMXzNKWjBsRi0yejQ2RjhtaGtKWkFqVTVWNE95Nk1pSTk5enUyV2xvNHlEWWp3WDVKRDg4U2NIVmpoY0dyc04zbXTSAXZBVV95cUxNWGZQclRzamdHNWtPc0hBUU1UY1lwa25xT21mX2pLT3dwSFJEWENkUmdVbGdTbVlhdlhnRVp3aDRna0RKWjRRSXVXQmFJNkFacWRhV2N3cm93THFLYW9saldyM0dPWW5hUWN2UlVFMFZDemxDWFd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 06:03:32 GMT",
        "title": "Analyst says Ethereum Will Reach $8,000 ATH, But This Needs To Happen First - NewsBTC",
        "content": "A crypto analyst has predicted that Ethereum (ETH), the world’s second-largest cryptocurrency will surge to new all-time highs around the $8,000 price mark. However, for Ethereum to reach this ambitious price target, the analyst emphasized that the cryptocurrency must fulfill certain key conditions.\n\nEthereum Road Map To $8,000 ATH\n\nA crypto analyst identified as ‘Bluntz’ on X (formerly Twitter) has expressed bullish optimism for Ethereum’s future outlook. The analyst forecasted that ETH could witness a mega rally to an $8,000 all-time high this market cycle.\n\nRelated Reading\n\nBitcoin Forms Double Top Pattern On 4-Hour Chart, Analyst Reveals Targets 2 months ago\n\nBluntz shared a video on June 8 via his official X account, highlighting key conditions Ethereum will have to overcome before it can reach a new all-time high around $8,000. The crypto analyst noted that ETH/USD is presently near recent lows, as a result, Ethereum could be getting closer to its lowest point in this current bearish trend.\n\nThe analyst disclosed that it was highly unlikely that Ethereum would immediately start surging upwards from its current low point. He emphasized that the cryptocurrency will need to undergo additional downward movement before witnessing a surge to the $8,000 price target.\n\nFor Ethereum to begin its road map to the $8,000 all-time high, Bluntz believes that the cryptocurrency must “sweep $2,800, take out the low and reclaim it.” After this, the analyst revealed that a three-wave corrective pattern, termed an “ABC,” will be completed, potentially signaling the end of Ethereum’s downward trend and the beginning of a substantial upward movement.\n\nBluntz also noted in his video that Ethereum’s ABC wave correction will send the price of the cryptocurrency to $6,000 before pulling back and rallying again to a cyclic top of around $8,000. He expects Ethereum to trade sideways for a while, testing new lows before entering a recovery stage.\n\nAnalyst Asserts Ethereum’s Biggest Gains Are Yet To Come\n\nIn his post, Bluntz confidently asserted that Ethereum has yet to experience its “big run” in this market cycle. Although the cryptocurrency surged to new highs above $4,000 earlier this year, Bluntz and a few other crypto analysts have predicted more bullish upsides for the cryptocurrency.\n\nOne of the primary reasons behind the market’s optimism concerning Ethereum’s price outlook is the upcoming launch of Spot Ethereum Exchange Traded Funds (ETFs). Bluntz disclosed in his video that the introduction of Ethereum Spot ETFs will likely trigger a substantial price increase for Ethereum.\n\nRelated Reading\n\nCrypto Analyst Says Bitcoin Could Reach $100,000, But What About Altcoins? 2 months ago\n\nThe analyst revealed that various crypto community members have engaged in a hot debate about the potential launch of the Ethereum ETF, expecting it to have a positive impact on Ethereum’s value. However, contrary to belief, Bluntz anticipates a major ETH sell-off, emphasizing that the price of the cryptocurrency will likely drop following the launch of its ETF.\n\nThis initial sell-off phase could indicate the shakeout of weaker hands in the crypto market. Following this, Bluntz expects Ethereum to be “bid up heavily,” potentially driving the price upwards.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTzlLbDVORlN4ZEJZT3JFem9hSjUxRXhtaHMtc3NvU0cxRnpHTmNEVkF4TkRXa19JM0R3Z0hiZWxHRGV1S0NmdUd5OVBubFQzWEltMWM5WkdITlpOaUJqV1dSZ0loVmh0Uy1oOWtHbkh4cXZiQjRhYzF5RVNsNnJUQkZKc1lJTUJmck1RWWV0b2QyU1p4SUZITkkwbkJyZ9IBowFBVV95cUxPT29DZVlTQXdoOGZjUjJ1UkZreGZjSDRfTXJjaF93cnJRV0Z5Q1NIZ0JBdWlQanl2dllBMnhLMFRaQVJmWnUwcUNzaVk1T2tyblFkN0lNLXlSWDEzbi1Sall5RXRGMkl1Wm5mTUlKR1h3cndsV0RwZ0Fma203ZVZrY1lOSGhoTGhSdGVLdEV5bm04NmdSd2NENDd2M283Q01SYVdN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Seen Hitting $5,000 as German Bitcoin Sell-off Shakes Market - NewsBTC",
        "content": "Ethereum has shown some degree of resilience in the face of heavy volatility in the broader crypto landscape, keeping ground above the $3,000 barrier in a week when Bitcoin stumbled under the weight of German economic policies.\n\nRelated Reading\n\n6,400 Ethereum Mystery Move Sparks ETH Rally Talk Pre-ETF Nod 2 months ago\n\nEther hodlers are keenly observing as the terrain of digital currencies undergoes notable changes; many of them are focusing on a possible $5,000 milestone.\n\nA Test Of The Market\n\nThere were tremors felt in the cryptocurrency market when the German government decided to sell about 5,000 BTC, or 90% of its Bitcoin holdings. As Bitcoin struggled to maintain values over $57,000, Ethereum showed remarkable resilience, remaining consistently above $3,000.\n\nBoth experts in the field and investors have noticed this difference in performance, and now people are anticipating how resistant Ethereum is to market forces in the coming days or weeks.\n\nIf Ethereum stays secure during this uncertain time, it could mean that it is no longer affected by changes in the Bitcoin market. This would have huge effects on the entire cryptocurrency business.\n\nETF Anticipation Drives Positive Mood\n\nIn the wake of the German Bitcoin selloffs, the broader crypto community is humming with expectation over the possible approval of an Ethereum ETF. If this event comes to fruition, Ethereum might reach a major turning point in terms of heavy institutional investments.\n\nThe possibility of an ETH ETF has given the market some hope as many people are guessing on significant price increase. Still, the effect of such an approval is unknown, hence investors should approach these changes warily.\n\nPrice Forecast and Technical Analysis\n\nAlthough many analysts see Ethereum’s price soaring, the technical indicators show a more complex picture of ETH’s existing situation even if optimistic forecasts abound.\n\n#Ethereum on the daily timeframe is looking bullish 🚀 If $ETH holds the green box support at $3000-$2800, we could see $5000 soon. Ready for a big rally?#CryptoPatel #Altcoins pic.twitter.com/ArIWLO4WiO — Crypto Patel (@CryptoPatel) July 12, 2024\n\nA well-known cryptocurrency expert, CryptoPatel sees Ethereum as having a bright future, predicting that its price will continue to grow and may soon reach $5,000. His findings revealed significant levels of support and resistance, both of which would have an impact on the movement of ETH in the future.\n\nAccording to his observations, the green box represents a significant support zone that extends between $2,800 and $3,000. Maintaining this support level is essential to the optimistic projection for the price of the top altcoin. It is possible that Ethereum could be on track to hit $5,000 if it continues to move solidly within this green band.\n\nRelated Reading\n\nMeanwhile, according to figures provided by crypto prediction platform CoinCodex, Ether will have risen by 3.68% by August 13, 2024.\n\nThe fear/greed index, on the other hand, shows some negative vibes. Last month, Ethereum had 50% green days. Because of these signs, experts say that you shouldn’t buy anything right now.\n\nThese conflicting signals make it hard to predict how the altcoin will behave in the next coming weeks or months. The market is cautious, but there are hints that things will improve in the future.\n\nFeatured image from Flow, chart from TradingView"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPeEhyWGl5Q3U3VHRSMXdTZzBjbDQ4alA1cGhueG1yMmtlMlZMOGZPTjc4dF9ZTVR0YUpFdmdaUkxaV0N1b0ZsbzF5T3lCSktfQjBPdWMtaG9qcGdJT3BCcXExX01tVXRMM3lyNVZ4M0lzdGx5N3NqZHEzdzc1TXc3Vll6bUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Rainbow chart predicts ETH price for end of 2024 - Finbold - Finance in Bold",
        "content": "After threading above the $3,000 mark for most of 2024 and even surpassing $4,000 briefly in March amid a broader cryptocurrency market surge, Ethereum (ETH) has been hit by the recent drawback as its price fell below $3,000 briefly on July 8.\n\nDespite this, ETH remains in the green so far in 2024, as it added 32.34% to its value on a year-to-date (YTD) basis.\n\nAs of July 11, the previous 24 hours have brought gains of 0.75%, which helped reverse the damaging 1.86% loss during the last week.\n\nEthereum 24-hour price chart. Source: Finbold\n\nAmid the current atmosphere of fear and unpredictability, the Ethereum Rainbow Chart, which employs a logarithmic growth curve to reflect investor sentiment across different price points, can provide essential insights into Ethereum’s potential future movements in the crypto market.\n\nThe 2024 Ethereum Rainbow chart\n\nThe Ethereum Rainbow Chart consists of nine distinct color-coded zones, each symbolizing a specific price range and the corresponding market sentiment. These zones range from “Fire Sale,” indicating extreme bearish sentiment at the lowest prices, to “Maximum Bubble Territory,” suggesting that the cryptocurrency’s price has soared to unsustainable levels and is likely to drop.\n\nCurrently, ETH is in the “Steady” zone, which can best be described as a neutral zone where neither buying nor selling pressure dominates the sentiment. Traders’ best move is to wait and see in which direction the price moves on the chart.\n\nEthereum Rainbow chart. Source: BlockchainCenter\n\nEthereum Rainbow chart predicts its price for end of 2024\n\nThe Rainbow Chart illustrates Ethereum’s historical performance within the context of market sentiment and provides some foresight into the potential future prices of the world’s second-largest cryptocurrency.\n\nIf ETH drops below $1,037.78 by late December, the current bull market is ending and a crypto winter is approaching. Conversely, trading above $8,930.22 would indicate that Ethereum is entering bubble territory, with consistent closes above $12,791.09 almost confirming an impending major correction.\n\nEthereum Rainbow chart for the end of 2024. Source: BlockchainCenter\n\nThe Rainbow Chart also shows that ETH would be most stable at the end of 2024 if it remains within the $2,915.49 to $4,210.36 range, known as the ‘HODL’ zone. It would still be relatively stable between $4,210.36 and $6,124.88, the ‘Is this the Flippening?’ range, though investors should remain cautious.\n\nAdditionally, the tool suggests that late 2024 would be a good time to buy Ethereum if it trades between $1,442.45 and $2,039.02, labeled as the ‘Accumulate’ zone. Prices up to $2,915.49 are also considered relatively inexpensive.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9XQVNvZ0I3TElVcUVCUk5JX0hmb040QVI0bWxWNlpaeWxqYkVEMThLM1hKNGpNd0RVY2lUVW9oYWgxeUFJdllUdFJPNFpZaDd5bXlaeHhhWnlMSTluMGpmMkpOcVYxRU43NHE3UEhhVDHSAXZBVV95cUxNc2FrV19IZlI4aUtLYTU5d3Y0SkwzOFdkTTRITVJ2UldHVlU2V0ZuWk9DTGVmQV9aQUJ5R3hBd1lHY3BjaFJvcEx3RU5laUhzSmJEVGt2emRXVEVVUS0xSkNBU2JudlFaMjdWbWxMcjRVYUQ2eVRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 03:21:39 GMT",
        "title": "Ethereum Price Rises Amid Challenges: Will ETH Break Above $3,200? - NewsBTC",
        "content": "Ethereum price extended its increase above the $3,120 resistance zone. ETH could soon aim for a move above the $3,200 resistance.\n\nEthereum is slowly moving higher above the $3,080 level.\n\nThe price is trading above $3,080 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bullish trend line forming with support at $3,070 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise steadily if there is a close above the $3,200 resistance zone.\n\nEthereum Price Outperforms Bitcoin\n\nEthereum price extended its recovery wave above the $3,050 resistance zone. ETH even climbed above the $3,150 resistance. Finally, there was a spike above the $3,200 resistance, outperforming Bitcoin.\n\nIt tested the $3,220 resistance zone. A high was formed at $3,213 and the price is now correcting gains. There was a minor decline below $3,150. The price tested the 50% Fib retracement level of the upward move from the $2,894 swing low to the $3,213 high.\n\nEthereum is now trading above $3,080 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support at $3,070 on the hourly chart of ETH/USD.\n\nOn the upside, the price is facing resistance near the $3,140 level. The first major resistance is near the $3,200 level. The next major hurdle is near the $3,220 level. A close above the $3,220 level might send Ether toward the $3,320 resistance.\n\nThe next key resistance is near $3,440. An upside break above the $3,440 resistance might send the price higher toward the $3,550 resistance zone in the coming days.\n\nAre Dips Supported In ETH?\n\nIf Ethereum fails to clear the $3,140 resistance, it could start another decline. Initial support on the downside is near $3,070 and the trend line. The first major support sits near the $3,000 zone and the 61.8% Fib retracement level of the upward move from the $2,894 swing low to the $3,213 high.\n\nA clear move below the $3,000 support might push the price toward $2,970. Any more losses might send the price toward the $2,895 support level in the near term. The next key support sits at $2,820.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,070\n\nMajor Resistance Level – $3,200"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNemJoNVY3bkYzcGtPMVVRSDdIRVd1MUM1Y0VMTGNpVXE3Q3hmRXlmU1d1bVZvbEI2Zy1Tbk00OWhxRHdlcmhLbnoxN2tJZ1JsODhLVXpFdlplWEt2VWxNNVd1NldfR1Z3ZWxLZFMzM29FQllScVQzYVFzT2RnaFE3VzdKSDFkQ3NQZUN6cWh2cEZ2aDJZTEstSkJUUTRON2pqbUkxTlFB0gGrAUFVX3lxTE5ya1FtVTJOelpFQkNkaWpzdnlxNmJQQm4wR25rajhWNzRBSGswTUtiYUd3aEh6Y19HZF9XcDJBc2xiZEtFdXVyNjdLSkJqRXljNUJHZDE1b1dNbkJoLUxQeVlpUTVxWXR0TTIwbDQtUG9KQW1FZDZlY3VkX1BBb1JuRy1aUW95VFJBcU9uTDR4VU5NVVZ0SzBZZG5LVUZTcWpxeXczM2ZGQzY1MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bulls Gear Up For Recovery – Can Spot ETFs Push Price To New Highs? - NewsBTC",
        "content": "Ethereum (ETH) is gearing up for a price uptick as we begin a new week. Ethereum is currently trading at $3,195 and is up by 1.83% in the past 24 hours. Although Ethereum’s gains are part of a wider market rally after a rebound, the altcoin is in the best position to surge the most in the coming weeks.\n\nRelated Reading\n\nFundamentals point to an extended price surge in the face of a looming launch of Spot ETFs. Additionally, technical indications are pointing to a bullish outlook for Ethereum as it approaches a crucial resistance level around $3,250.\n\nEthereum Basking In Bullish Sentiment\n\nEthereum is now looking to break above $3,200 after trading for the majority of the week below $3,100. Although Ethereum broke above $3,000 again last week, the king of altcoins largely consolidated between $3,000 and $3,100 in what looked like a slowdown of bullish sentiment.\n\nHowever, on-chain analytics and fundamentals point to Ether still basking in bullish sentiment among investors. Majority of investors are waiting for a signal before jumping on the asset.\n\nFor starters, there’s a growing sense that Ethereum Spot ETFs could be on the horizon. VanEck and other potential issuers amended their filings earlier in the week in hopes of receiving the SEC’s final permission. It could be a game changer for the crypto market in 2024 if Spot Ethereum ETFs start trading.\n\nAccording to Thomas Perfumo, Head of Strategy at Kraken, the Spot ETFs could open up an additional $1 billion inflow into Ethereum monthly. This new inflow of demand and money could see Ethereum push past its current all-time high of $4,900 into new price territories above $5,000.\n\nAccording to multiple reports, things are taking a better turn for the approval of these Spot ETFs, and the potential for approval by the SEC has jumped massively. As noted by Eric Balchunas, senior ETF analyst at Bloomberg, everything is already in place for the approval of the ETFs, and it is unclear why the SEC is taking so long. This has led to an increase in a bullish case for Ethereum for the rest of the month.\n\nYeah, rn it’s all quiet on the Western Front re eth ETFs. Nada from SEC this week. Unclear why they taking such sweet ass time. Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait. Maybe things will move fast next week. We’ll see… https://t.co/o1ZSdIf1nE — Eric Balchunas (@EricBalchunas) July 12, 2024\n\nRelated Reading\n\nBitcoin Whales Accumulate 71,000 BTC Amidst Price Dip – Details 2 months ago\n\nIndicators Looking Bullish\n\nOn the technical side of things, technical indicators also support a bullish outlook. According to the daily candlestick chart, Ethereum is on its way to closing its third consecutive bullish daily candle for the first time since June 16. The crypto is also attempting a break above the 100 SMA. A break above the 100 SMA in correlation with a bullish daily close could solidify the bullish momentum as we head into a new week.\n\nFeatured image from Reddit, chart from TradingView"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBOVmZEMHBkRWw5N3dMOW1JNnQ3V3ZCbGNTdWxUVUhUMVVLSm5EOU53eDU1dVE3WXUwbk5XeWpJZHNwYTRaS0xPWHZMNUpsdV9xNkdsYW56dHpvSlUxVGdqTUI5TnpRVXVJcnhfQUlTRXNXZzVkckdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction July 2024 - Is ETH About to EXPLODE? Buy Before It's Too Late! - Coinfomania",
        "content": "Different predictions on the future price trajectory of Ethereum (ETH) have been triggered by the upcoming launch of spot Ethereum ETFs.\n\nOf these forecasts, one that stands out the most is that ETH might replicate the remarkable gains that Bitcoin (BTC) made between 2023 and 2024. Bitcoin increased from $26,000 to an all-time high of $73,750 over that time.\n\nEthereum ETF Could Ignite Another Bull Run, Analyst Predicts\n\nAn anonymous analyst on X Follis stated that the expected Ethereum ETF might cause ETH’s price to move like BTC has in the past, with a possible 200% rise. Ethereum is now priced at $3,130, but the analyst predicts that price will grow to $9,324 by the end of the year.\n\nDemand would need to rise significantly in order for such a price hike to occur. The first signs of this increased interest were when ETH whales moved a sizable amount of money, as reported by Spot On Chain.\n\nEveryone focussed on Germany and Mt Gox\n\n\n\nMeanwhile the Ethereum ETF is about to launch and the $ETH chart looks identical to $BTC before it pumped +200% last year\n\n\n\nStudy ETF rallies pic.twitter.com/VWENNnO8dN — フ ォ リ ス (SG 🇸🇬) (@follis_) July 9, 2024\n\nA whale was observed to have taken out $50.30 million worth of ETH early on July 10, which was the first significant build-up since the Ethereum ETF started to garner more attention.\n\nThe recent events, in which a whale sold $12 million worth of Ethereum, stand in stark contrast to this claim. This change in behavior among Ethereum whales—from spreading their holdings to making bulk purchases—is corroborated by other Glassnode data.\n\nThis is demonstrated by the rise in addresses with $1 million or more in Ethereum valued at the time of reporting, from 14,217 on July 7 to 14,823 at that time. This suggests that there is increased demand for Ethereum and hope for the approval of the spot ETF.\n\nIn contrast to Bitcoin, Ethereum has experienced a more severe price correction. The price of ETH dropped by 24.65% between May 28 and July 9, while the price of Bitcoin dropped by a smaller amount, 19.43%.\n\nIn spite of this, according to market valuation, Bitcoin is still the most valuable cryptocurrency and is still outperforming Ethereum according to bullish signals.\n\nCautious Optimism\n\nHowever, historically, ETH’s more severe price drops have presented chances for large rebounds. A double bottom formation is currently visible on the daily ETH/USD chart, indicating a possible bullish reversal.\n\nTwo low points that are located close to the same price level and suggest a stabilization and possible upward trajectory help to identify this formation.\n\nThe last time such a pattern appeared on the Ethereum chart was in January 2024. After that, the price of ETH increased by 81.94%, reaching $4,067 by April.\n\nIf past events are repeated in a comparable manner, Ethereum’s price may reach $5,625 by the end of September. Nevertheless, Ethereum’s near-term outlook is still positive, provided that bulls can hold into their $2,934 support level.\n\nIs ETH About to EXPLODE? There could be Potential for a Bitcoin-Like Rally\n\nAnalysts are optimistic about Ethereum’s future, with some forecasting a rise similar to Bitcoin due to the impending introduction of spot Ethereum ETFs. The likelihood of more demand—especially in light of recent whale activity—fuels the possibility of a price spike.\n\nSource: Glassnode\n\nEthereum’s price adjustment is more noticeable than Bitcoin’s, but there appears to be a growing interest for the cryptocurrency based on the change from whale selling to accumulation and the rise in high-net-worth Ethereum holdings.\n\nShould the expected flood of institutional capital via ETFs come to pass, ETH may see a price increase like to that of Bitcoin during its 2023–2024 surge."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPeDlnN0VZX1BaN2pNeWVCZENXV2RzQy1od3o1amNxTjVubnE4SVdfZGtqLXItaFdJNEI5RTFTY3hRME5nUDJfY3pyUmVZV2dhS19KQVlWN3NUT0tpZFl2b1hRVlFFQmpPaVR1RC11TjRzRENJVXJ4TXJzRE1QMm04VFdBdW4zTXZrYlRncE4wNUlmQ2hhRzlqZ2FSU1oxSjJEYlpUdNIBqgFBVV95cUxQckwycTN6ZjAtX3ZfcXcwUnFfSGVoa3oydnhObndBN1lja2hkS19jbFE5Vl8ybERxTG4yQWlSanBpYnFiY00wVWowdHdkR1dTelJWTlBzM2tZRlpIU0lIdkswUE5yd2lVNzVrbEVRRkZ5bE10UGNZZlFpRWlianBqYktHTDBxazhXcHQwUzJCWkRtN2tnMHB5cnVFNk1XeXh2bi1mQ2pDRVJCUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Anchored at Vital Support: Are Bulls Ready to Tackle the Hurdle? - CoinChapter",
        "content": "Key Takeaways:\n\nEthereum managed to stay above the key support at $2,800.\n\nETH/USD is now trading well below a bearish trend line with resistance at $3,265 on the daily chart.\n\nThe price could recover, but the bears might take a stand near $3,265 and $3,400.\n\nEthereum\n\nNEW DELHI (CoinChapter.com) — Ethereum (ETH) found strong bids near $2,800 and recently recovered. ETH is outperforming Bitcoin and might attempt to surpass key hurdles.\n\nEthereum Price Holds Major Uptrend Support\n\nEarlier this month, Ethereum saw a major decline below the $3,400 and $3,265 support levels. The price declined over 15% and even traded below $3,000, like Bitcoin dived below $60,000. Finally, the bulls took a stand near the main uptrend support at $2,800.\n\nA low was formed at $2,815 and it seems like the bulls again managed to defend the key support around the $2,800 zone. Ether is now recovering losses above the $3,000 resistance zone. It cleared the 23.6% Fib retracement level of the downward move from the $3,975 swing high to the $2,815 low.\n\nEthereum price daily chart | Source: ETH/USD on TradingView.com\n\nEthereum is now consolidating and trading well below the 50-day simple moving average (blue). If there are more upsides, the price could face resistance near the $3,200 level.\n\nThe first major resistance sits near the $3,280 zone. There is also a connecting bearish trend line forming with resistance at $3,265 on the daily chart. The next resistance is near the 50% Fib retracement level of the downward move from the $3,975 swing high to the $2,815 low at $3,400.\n\nA clear move above the trend line resistance and then $3,400 might call for a move to $3,500 and the 50-day simple moving average (blue). If Ethereum bulls push the price above the $3,500 resistance, there could be a fresh rally.\n\nIn the stated case, the price could rise toward the $3,700 level. Any more gains might initiate a move toward the $4,000 zone in the near term.\n\nMore Downsides In ETH?\n\nConversely, Ethereum might struggle to rise above the $3,265 and $3,400 resistance levels. In the stated case, it could resume its slide. The first major support sits near the $2,950 level. The main uptrend support is now forming near the $2,800 region.\n\nIf there is a daily close below the $2,800 support zone, there is a risk of a larger pullback. In the stated case, the price might test the $2,550 level. The next major support is near the $2,420 level. Any more losses might send Ether toward the $2,150 support.\n\nOverall, Ethereum price managed to stay above $2,800 and recovered above $3,000. However, ETH bulls need to clear the $3,265 and $3,400 hurdles to start a fresh uptrend."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQajNzYkJjOGVJMG9fdmhzYndrLWpzZUR1VmkyU2N5VnBlMnhETWhFYmNxenA2MEZPNnFOWU4yWUNEa1NVYjkwczB1SFR1bzFyVFIwTEZkMXRFTFNYR0F5M2dRV25HdGJxLVdYMHpNYXU5d3A3X1FPSHpCZkFuM05nZFdQZDRaRHpOUFNyWlJCRjlrVXNu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Tron Founder Bets Large on Ethereum ETF, Splashes $5 Million on ETH - Coinfomania",
        "content": "Last year was an interesting one for smart contract platforms as the stiff competition continues in the DApp market, with the total on-chain transactions hitting $23 billion.\n\nWhile the Ethereum continues to hold its position as the market leader, possibly because of its first-mover advantage, the 2019 annual report published by DappReview, a DApp data tracking platform, shows that TRON blockchain dethroned EOS as the second most popular blockchains for DApps.\n\nTRON: Las Vegas on the blockchain\n\nIn 2018, EOS was ranked as the second blockchain after Ethereum in terms of DApp users and transaction volume. EOS recorded a total volume of $3.5 billion in DApp transactions, the largest in the smart contract market in 2018.\n\nHowever, the table turned in 2019 as TRON blockchain gained a total transaction value of $4.4 billion to outperform EOS, IOST, STEEM, NEO, ONT, LOOM, TOMO, WICC, WAVES, and WAX, according to the report.\n\nDappReview, which described the TRON Dapp ecosystem in 2019 as “Las Vegas on the blockchain,” noted that 8 out of TRON’s top 10 apps are mainly Casino DApps. The Casino DApps contributed about $3.9 billion to the total transaction value.\n\nCasino DApps accounted for 60.81% of daily active users on TRON blockchain. The user number for exchange DApps accounted for 10.93%, while game DApps has only 11.36% of all the users. Casino DApps further dominated TRON transaction volume on a 90.39% count, while the exchanges accounted for 8.27%.\n\nA tough year for EOS\n\nOn the side of EOS, which experienced many difficulties at the end of the year, Casino and Other DApps played well. They accounted for 40% of the total users in the first half of 2019, not until EIDOS was launched in November. Many believed it led to the prohibitive cost of resources and other controversies that nearly paralyzed the entire EOS ecosystem.\n\nEIDOS was released as a smart airdrop contract, distributing tokens to users who sent any amount of EOS to the contract, with 0.0001 EOS as the minimum amount. In this course, many users initiate several transactions to earn the EIDOS tokens almost for free.\n\nTechnically, an average of 1.69 million transactions was sent to the contract every day, thereby leading to the rise in the price of EOS mainnet resources. An average user now has to stake 30 EOS to get network resources to initiate a simple token transfer, an irony for an ecosystem that once promoted itself as a zero-fee dApp platform.\n\nThe EOS mainnet congestion affected users playing Other DApps, which led to the decline of users for the two categories of DApps; Casino and Other DApps.\n\nEthereum maintains global dapp leader\n\nEthereum has maintained the leading position in the game of smart contracts; perhaps it has remained the first choice and the most preferred platform for developers. The report shows that 1,223 Ethereum DApps were still active at the end of 2019.\n\nGame DApps dominates the Ethereum platform by 46.5%, followed by Decentralized Exchange (DEX) by 20.9%. Despite having the highest percentage of DApps, Game DApps have the lowest transaction volume than others from an estimated DApp transaction volume of $12.8 billion on the Ethereum blockchain.\n\nExchange DApps account for 61.05% of the transaction volume, while Finance DApps holds 29.98%. The reason could be related to the fact that most transactions in the Game may not involve token or asset transfers. Also, many game assets are exchanged in the form of NFT, which usually trades on NFT exchanges.\n\nThe report today not only provides insight into the usage of public chains, but it is also confirmed the massive adoption of blockchain in 2019."
    }
]