[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9VVG5jdE5UWkE3QUVaV2IyRVhNUFBrZzZMc19xRlp5bUx0ek5TMDhIRGxqRl93R1Q4R3ExbzU1WVN5UklYbXVRLUxrYmRBdHVxdUFuMUtyQ1NTOWcyaS1adzEtbjc3b2xXZFVseUdXS3FfR3RYeDB1OTh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "SEC Approves Spot ETH ETP's - JD Supra",
        "content": "On March 23, 2024, the Securities and Exchange Commission (the “SEC”) formally announced its approval of eight “Ether-Based Exchange Traded Products” (the “ETPs”).1 This announcement comes a little over four months after the SEC approved Bitcoin ETPs. The eight approved ETPs include (1) the Grayscale Ethereum Trust, (2) the Bitwise Ethereum ETF, (3) the iShares Ethereum Trust, (4) the VanEck Ethereum Trust, (5) the ARK 21Shares Ethereum ETF, (6) the Invesco Galaxy Ethereum ETF, (7) the Fidelity Ethereum Fund, and (8) the Franklin Ethereum ETF.2\n\nEther (“ETH”) is the native token of the Ethereum Network, the second largest cryptocurrency by market cap after Bitcoin.3 Approval of the ETH ETPs is another step towards mainstream recognition and adoption of cryptocurrencies. The adoption of ETH may be more significant than that of Bitcoin as the Ethereum Network provides users the ability to build and scale protocols on its network with a vast number of potential use cases, whereas Bitcoin is mainly used as a store of value. Increased exposure to ETH will inevitably lead to greater exposure for Ethereum products. As of May 24, 2024, the Bitcoin ETPs saw over $272.28 billion in overall trading volume.4 It remains to be seen whether the ETH ETPs can replicate such volume, though it is likely that they will not, at least not at first. Asset allocators and institutions took many years to get comfortable with Bitcoin’s value proposition (scarcity, immutability, sound money, etc.), not to mention the many years of ETF applications and rejections. The simple fact is that such institutions and managers are not as familiar with Ethereum now as they were with Bitcoin in January. In the long run, however, Ethereum’s turning complete features make it a much more powerful form of “programable money” and it would not be surprising if institutional and retail investors ultimately see as much, or more, value in the asset.\n\nOn the other hand, some may argue that these ETPs are inconsistent with the decentralized nature of cryptocurrencies. A similar concern was raised when Lido was responsible for almost one-third of the staking taking place on the Ethereum Network.5 Decentralization helps ensure that the Ethereum Network is not controlled by a few users. Conversely, the ETPs require these large asset managers to accumulate huge quantities of ETH. For now, these asset managers cannot stake their ETH or participate in the governance of the Ethereum Network, however, if given such opportunities, these asset managers could theoretically threaten the decentralized nature of the Ethereum Network and/or place the entire network under the control of the US government.\n\nAs these ETPs are brand new, we will have to wait to see how their adoption impacts cryptocurrencies and traditional finance."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9DdkVlYXdvNExldTlVQ2Q5OWpaR0hsLVFweWhJUzFld0xKNnNhUHV3SHdPQ0VTZVN2dU5fRkxaNlRfMTgwR0ItNnk3MUE1YUdNRDhSdUJZWU56Nm50azcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Launch date for Ethereum ETF in the US reiterated as July 2nd by Bloomberg ETF analyst - Crypto Briefing",
        "content": "SEC's approval of S-1 forms crucial for Ethereum ETFs' public trading.\n\nShare this article\n\nThe initial date for spot Ethereum exchange-traded funds (ETF) trading in the US is still July 2nd, according to Bloomberg ETF analyst Eric Balchunas. In an X post, Balchunas doubled down on this date, highlighting that “a bunch of amended S-1 Forms” for those ETFs might be filed today.\n\n“Then ball’s in SEC’s court to let issuers know about any final changes and effectiveness (aka final approval),” added the analyst. On June 14th, he predicted the launch date for the first time, as reported by Crypto Briefing.\n\nOn May 23rd, the US Securities and Exchange Commission (SEC) approved the ETF filings for eight Ethereum ETF issuers, including BlackRock, Fidelity, VanEck, and others. However, only the 19b-4 forms were approved, which acts as permission for the exchange-traded product to be created.\n\nNotably, the S-1 form, which is an initial registration required by the SEC before a security can be publicly traded, still needs approval. The first amended S-1 form came a few minutes after Balchunas’ post, with Fidelity presenting the document with the adjustments ordered by the SEC.\n\nThe asset managers are not including their ETF fees on the S-1 forms, and the Bloomberg analyst assessed that they might be waiting for BlackRock to disclose “to see what they need to orbit around.”\n\nMoreover, Balchunas’ fellow ETF analyst James Seyffart also expects all the remaining S-1 forms waiting to be amended to be filled today."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNdzhxUTQwMzZ6NzhEaDFRMWxzOS1BQTVTSnViV0lCMnE3a2tkdjNnczBoRGwxRUVaTUVQSVVtQlV1QjY5cnY1RWl4ZWNVRXo5ZGhjV2NaVUJqUUU3SG5MZmNmLTZraVRmMFl6RXBEeVN4b190bXNyNkpUOTBNQnhGSGFCNU9VOEF3RDVSaUVnbVNqeXBRODNNV1JIMzE5Z2QtR2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum wins a major battle, but its war with the SEC is far from over - Fortune",
        "content": "Consensys, the maker of the popular MetaMask crypto wallet, announced this week that the Securities and Exchange Commission has backed off its unpopular campaign to investigate developers who use Ethereum. The move is in line with the growing legal consensus that Ethereum is a commodity, not a security, which puts it outside the agency’s jurisdiction. The announcement, however, also contained a dark lining that reveals SEC Chair Gary Gensler’s crusade against Ethereum is far from over.\n\nYou may recall that things between Consensys and the SEC came to a head when the company took the bold step of suing in April, asking a federal judge to force the agency to back off. The lawsuit came as a preemptive strike after the SEC had telegraphed it was on the verge of filing charges against the company after a year-long campaign of issuing subpoenas to developers who use Ethereum.\n\nThe SEC’s legal position became tenuous after the agency, under growing political pressure, approved Ethereum ETFs—an acknowledgement the currency is indeed a commodity. In response to an enquiry from Consensys, the SEC then informed the company it was “closing its investigation into Ethereum 2.0.” The “2.0” phrase appears to be a reference to the blockchain’s new proof-of-stake system that went into effect in 2022.\n\nAll of this came as good news to the market, and the price of Ethereum jumped around 3%. But one line in Consensys’s announcement hinted that all was not quite as well as it seemed—namely that its lawsuit with the SEC was ongoing. This seemed strange given that, if Ethereum is not a security, the SEC has no jurisdiction and there is nothing to hash out in court.\n\nI asked Consensys’s lawyers what is going on and they told me the SEC is still going after MetaMask because it can be used to swap tokens on the DeFi market, and also because it offers access to staking—a key element of Ethereum that pays users to help secure the network. Here is how the lawyers put it:\n\n“The SEC’s theory is that, because the Swaps offering allows users to trade various tokens using DeFi platforms, it is a securities broker due to at least some of those tokens being securities. They also assert that providing a user interface to two liquid staking protocols is also brokerage activity, and that it also constitutes offering unregistered crypto asset securities. The closing of the Ethereum 2.0 investigation doesn’t resolve those issues.”\n\nThe SEC, in other words, is trying to argue that Consensys—and by extension other firms—is an unlicensed brokerage engaged in the securities trade. This is likely a losing argument too, but it’s on brand for Gensler, who has treated the process of crypto regulation like a personal vendetta, to dig in to the bitter end. The upshot for the crypto industry is it has won another battle, but the war goes on.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe Commodity Futures Trading Commission is investigating Jump’s crypto trading activities. (Fortune)\n\nS&P wrote that Ethereum restaking, carried out by EigenLayer and others, could become akin to an “internet bond market.” (Bloomberg)\n\nWorldcoin has resumed iris-scanning in Kenya after regulators dropped a year-long privacy probe that had halted operations. (TechCrunch)\n\nThe price of private shares of crypto firms like Kraken, Circle, Chainalysis, and Ripple have jumped this year amid rumors the bull market will lead to long-awaited IPOs. (Bloomberg)\n\nBitcoin is down around 10% this month as the price fell below $64,000, though some technical analysts predict a rally is on the way. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nWhat could go wrong?"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPMlBjVjlxVjRKYW01aXd0eExKSlZUeVBKNFAzZWlwc2pXb1N3QkRyaEdBZXplLU1tcFNDWWU4dFlCSnBSR3lERW1DVGU0eEdud2Rva2hQdF92LVNHc2dnZmJEaklLUWNtS1g2OXN0V1lwRzVvblEtVWNhekgxaWEwcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "What You Need to Know about Ethereum ETFs - Brave New Coin Insights",
        "content": "What You Need to Know about Ethereum ETFs\n\nThe buzz around Ethereum ETFs is reaching a fever pitch. Let's break down when you can expect them to hit the market and who's behind the scenes making it happen.\n\nEthereum ETF Launch – When’s the Big Day?\n\nInvestors and traders are clutching their Ethereum wallets in anticipation of the launch of spot Ethereum ETFs. Bloomberg’s ETF guru, Eric Balchunas, has circled July 2nd on the calendar. This date could be a game-changer, opening up a fresh route for folks to dive into Ethereum.\n\n\n\nWho’s in the Game?\n\nThe road to getting these ETFs approved has been a wild ride. The SEC has given the green light to the 19b-4 forms for eight big players, including heavyweights like BlackRock, Fidelity, and VanEck. This stamp of approval is a big deal, letting these companies move forward with their ETF plans.\n\nThe SEC has also tossed some light comments on the S-1 filings back to the issuers. This is a good sign that things are moving in the right direction. SEC Chair Gary Gensler hinted during a budget chat on June 13th that we might see these ETFs get the nod by September. Back on May 23rd, the SEC gave a thumbs-up to the 19b-4 filings from eight companies for Ethereum ETFs. This is a solid signal that these ETFs are just around the corner. Investors and traders are watching like hawks, knowing that the launch of Ethereum ETFs could shake up the crypto market in a big way.\n\nMarket Projections\n\nGetting a grip on the market projections for the Ethereum ETF can be a game-changer for crypto traders and investors. Let’s break down VanEck’s price forecast and the expected institutional money flow.\n\nVanEck’s Price Projection\n\nVanEck, a big player in asset management, has thrown out a bold prediction for Ethereum (ETH). They reckon Ethereum could hit $22,000 by 2030. This guess is based on Ethereum pulling in around $66 billion in “free cashflows.”\n\nInstitutional Capital Inflows\n\nThe launch of spot Ethereum ETFs is set to draw in a hefty amount of institutional cash. Geoff Kendrick from Standard Chartered thinks the inflows could be anywhere from $15 billion to $45 billion in the first year alone.\n\nThese numbers show just how much Ethereum ETFs could shake up the market. If you’re into crypto trading or investing, this is something you don’t want to miss.\n\nImpact on ETH Prices\n\nPrice Rally Prediction\n\nEveryone’s buzzing about the possible approval of spot Ethereum ETFs, and it’s got the crypto world in a tizzy. QCP Capital, a trading firm out of Singapore, thinks this could send ETH prices soaring. They’re talking a 60% jump, similar to what happened when spot Bitcoin ETFs got the green light back in January.\n\nMarket Reaction and Price Fluctuations\n\nThe market’s been all over the place since the news dropped on June 13th. ETH took a nosedive from $3,558 to $3,464, hitting its lowest point for the month. But it didn’t stay down for long, bouncing back up by 0.69% to $3,517.\n\nEven with these ups and downs, the market isn’t exactly screaming “bullish.” It looks like ETH might still be stuck in a bit of a rut, influenced by some bearish vibes. Check out the recent price movements.\n\nFor traders and investors, keeping tabs on these shifts is key. Knowing how the market’s reacting can help you make smarter moves with your investments.\n\nApproval Process Updates\n\nSEC Chair’s Statements\n\nDuring a budget hearing on June 13th, SEC Chair Gary Gensler mentioned that the approval process for Ethereum ETFs is expected to wrap up by summer, with a likely nod by September. The timeline hinges on how quickly issuers respond to the SEC’s feedback. This has stirred up quite the buzz in the crypto world.\n\nPrice Impact and Market Sentiment\n\nEven with worries about the drawn-out approval process for Ethereum ETFs, Gensler’s recent comments hint at a September green light, giving issuers more prep time. After the June 13th announcement about the potential approval, ETH’s price saw some ups and downs.\n\nETH’s price dipped from $3,558 to $3,464, hitting its lowest in June. But as of the latest update, ETH has bounced back a bit, up 0.69% to $3,517. Despite these price swings, the indicators didn’t show a strong bullish vibe, suggesting ETH might still be swayed by bearish trends. This mixed market sentiment highlights the cautious optimism about the potential Ethereum ETF approval."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPc3cwMXgtNktqeDVqM3Y3TlBlZU5OcVJnYURsemRSUldiYWRWUmJ0NWN1VzZmaFN1Rk5BbFczbzFKcjkweEVvUzQ3YmF1WGo1Z0s3XzlvSXhtOXRwc0FjTmNnU3ExYzk0dFIxdFRRZ19tR0VsTnBNd2FFZGxhWHIwNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Long-term Ethereum holders reach new high - CryptoSlate",
        "content": "Onchain Highlights\n\nDEFINITION: Bundle of all active supply age bands, aka HODL waves. Each colored band shows the percentage of Ethereum in existence that was last moved within the time period denoted in the legend.\n\nEthereum’s HODL Waves chart illustrates the distribution of held Ethereum over various time periods, indicating shifting trends in holding behavior among investors. The chart shows a noticeable concentration of Ethereum held for one to three years, signaling a significant amount of Ethereum acquired during the 2021-2022 period is still being held. The 1-2 year and 2-3 year bands reflect these holdings, comprising a substantial portion of the overall supply.\n\nThis holding pattern suggests confidence in Ethereum’s long-term value, with a significant portion of investors opting to retain their holdings rather than sell in response to market fluctuations. The decline in the proportion of Ethereum held for less than six months further supports this trend.\n\nIn contrast, the proportion of Ethereum held for more than seven years has grown, representing long-term holders who have witnessed multiple market cycles. This stability among long-term holders illustrates a persistent belief in Ethereum’s foundational value and potential for future growth.\n\nOverall, the HODL Waves chart provides valuable insights into Ethereum’s market trends, revealing an investor base that is increasingly committed to long-term holding strategies amidst evolving market conditions."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOTHRzd1BXOVI2U0F0S2NTMFFMYTJ5Y2VfNENqZzRYaHQtMXRibVUyOXhyNURVV25YU21pbEdNLXNyc1BqSjNiNlpDdVFlVWtfZ0pBcDlSVzVwZUlwMXNFSTg5V3FreG00Y01abEpWSWpQODh5UmFfOW9OY0llZ2trb0NkbjZ4bkZsRXBScUhvamxmWEpUem9WcndKa2RmNkt6MDV1blRZaW9zNFNIbTdBVzlnekhhNzBi0gG-AUFVX3lxTFBZZnZQMkIwUGlDZ3VnR2NBMVJxekRhNnh4YWhTeC1wNXRsYmpuaGFwM1FHbS1nR1R0ajBiaW5ZZ0hZdXBMSmY3cVplNEtIZHpWN3dVRk51T0htSHBWTmh6SUVzWTFiSE12R2M5RmN0NGZzRVZhbmVDVTNiTC1pZmJTV0p6MzJMMUpCRkNsaktYRWZTeDJGZVlpTHBROHFTLURpUFY2WVY1UHkwVXk3dk40N3U3dGJsZUhFYkdtZ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Here’s How Ethereum Could Skyrocket by up to 4,225%, According to VanEck’s Matthew Sigel - The Daily Hodl",
        "content": "The head of digital assets research at VanEck, Matthew Sigel, is outlining how Ethereum (ETH) could reach a price of $154,000, which the asset manager set as the bull case target in a report released weeks ago.\n\nIn a new interview on Bankless, Sigel says that Ethereum could reach a six-figure price by increasing its market share.\n\n“In that case, ETH would be capturing 90% of all smart contract value intermediation… so the penetration rates get pretty chunky, so Ethereum essentially accounts for 15% of the total financial markets. And then 50% of the advertising market hosted on open-source blockchains. And between 20% to 25% of information technology (IT) infrastructure and artificial intelligence (AI) going through open source blockchain.”\n\nAccording to VanEck’s head of digital assets research, the state of the global macro economy would also influence Ethereum’s prospects of reaching a six-figure price.\n\n“So I’d say in that world probably emerging markets are doing very well and the US dollar is doing extremely poorly. And the US regulatory state has either like fully embraced open-source digital assets, which I think is unlikely, or you completely seeded them to other countries. And then in that bull case, Ethereum is capturing a pretty sizable percentage of the value.”\n\nIn the report released earlier this month, VanEck set a base case target for Ethereum of $22,000, a potential gain of 518% from the current level. To hit the bull case target, Ethereum would have to appreciate by 4,225% from the current price.\n\nEthereum is trading at $3,560 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOSjZ5RGNQeHE5N2ZnTXhuajBfUmYzMkdOcGZPLUxLWWJwb0hKVW45aWV2THg4bHpFVy1hbklUcTJ1aDFKSXhWMmFzWUFSNHlYQ3VScklnNDNlN2Y4LUlVM0VwMS1VeG5ZNU1zMTFNVU4tWDQ2aTZpZDhzSmNLLUxsXzA4c04ySlNMUjgzQlRrekY1YzdiQmJaTklORkl6bDFmclZsdXFFdkQwZnExd2w3RlFzc9IBuAFBVV95cUxPVDUzdTh6UGVJd1NHWE5YRHBBaVgyakFoNGhIV0hPclBObU1fTEJrcDRISGUyVndBbF9DTzZRQUY5bFNtMXJPZjFicjg0RGlOdExYaE5VbGJYYmZRMENlemYyaVc0SHl1eUVRd3dBSWRzdnBZenRjd2hTd3E5cDJHS2tVY3VaVTllRDNHdE5ST2t2RGIwaW10Z1FnU04xNmNWUVVyaENxbmFGRUh6UXFoYy1IR05IQTI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) to $70,000 Imminent? Solana (SOL) to Pump Ethereum: Here's How, Cardano (ADA) Bounces Around $0.3, But for How Long? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin is finally entering reversal mode, with the price of the first cryptocurrency sliding in above the $65,000 zone. However, it is still moving below key support levels like the 50 EMA and is currently consolidating at the 100 EMA. The most decisive factor for a recovery would be momentum that is not present at this exact moment.\n\nIt is critical that Bitcoin maintains above $65,000 for the near future. Strong support has been seen at this level, which might serve as the basis for a reversal. If Bitcoin is able to overcome the immediate resistance at the 50 EMA or roughly $67,000, traders are hopeful of a possible rebound.\n\nAdditionally, the RSI which is centered on 47, shows that Bitcoin is neither overbought nor oversold, pointing to a period of consolidation prior to any notable movement. The macroeconomic environment as a whole is one factor influencing Bitcoin's current performance. Investor sentiment in a variety of markets, including cryptocurrency, has been influenced by worries about inflation and possible interest rate increases by central banks.\n\nBitcoin's long-term prospects are still promising despite these obstacles because of its growing institutional adoption and ability to act as an inflation hedge. Given its continued institutional interest and widespread adoption, Bitcoin's long-term prospects appear bright.\n\nAdvertisement\n\nSolana's questionable position\n\nWhile Solana clearly gained some respectable strength back in May, the situation for the asset has changed, and it has been going down steadily for the past 20 days. The SOLETH chart, often used for gauging market volatility, is clearly exhausted and might provide us with some growth in the future.\n\nThe Solana vs. Ethereum chart, which contrasts the two most powerful altcoins available, is an important comparison. This comparison makes the relative strength and possible volatility of the altcoin market easier for traders and investors to understand.\n\nA positive outlook for altcoins overall is frequently indicated by Solana's strong performance versus Ethereum and vice versa. Because SOLETH captures the growth and performance dynamics of two significant cryptocurrencies that are not Bitcoin, it is regarded as a barometer for market volatility. In the domains of NFTs and decentralized finance (DeFi), Solana and Ethereum are renowned for their strong ecosystems and noteworthy use cases.\n\nSignificant movements in these two assets may point to more general trends on the cryptocurrency market. Ethereum frequently serves as a benchmark since it is the bigger and more well known of the two. Conversely, Solana stands for more recent quickly expanding blockchain initiatives. It is possible to infer market sentiment regarding innovation and growth in the cryptocurrency space from the interaction of these two assets on the SOL/ETH chart.\n\nCardano's unexpected bounce\n\nCardano somewhat bounced from a local support level at approximately $0.35, with the potential to fight with the 26 EMA for momentum in the next few days. This bounce is a small but crucial step toward breaking an aggravating downtrend that has plagued the cryptocurrency for months.\n\nHolding above $0.35 is critical for Cardano in the near term. This level has provided a lot of support and might provide the groundwork for a future upswing. Cardano may indicate the start of a recovery phase if it can muster enough momentum to test and possibly break above the 26 EMA.\n\nAn RSI of about 37 indicates that ADA is in oversold territory, which may draw in buyers searching for cheap points of entry. But Cardano has not exactly performed well over the long haul. Even with the community's strong support and the project's lofty objectives, ADA has had difficulty holding onto its value. Cardano has experienced a protracted decline and has not been able to return to its prior highs since hitting its all-time high in early 2022.\n\nNumerous reasons contribute to this subpar performance, including the general mood of competition from rival blockchain platforms and slower-than-anticipated development progress. Although anticipated by many investors, the Cardano ecosystem has not yet produced the ground-breaking applications.\n\nAlthough the deployment of smart contracts on the Cardano network was a big step forward, neither the number of dApps nor user adoption has increased significantly as a result of it. Some investors have become frustrated with ADA's slow development, which has made them doubt the company's long-term prospects."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQNE5jVXhoOHJPdmJfMGFnWVJmMm1PWnlDLTVjcWNGb1JlZmdSR2lSbmtTdWdyZk96M25XM1RQQ1ZRQWF4YnpRWGwybkJGbnI2anQ3QlJkVVRQSGt4Rkh1ZTFyX3BxalBBcExxQzlvcHNhTWMtMWg4QlFheDgtUmEzM0lwcHY5OUp1bDEyLW5LM0VhRFhWVlowNldYWnRndldmZkRvaW8zeV9BN0xWZnJmMTJR0gG6AUFVX3lxTE1HMGxmeGxVS0ZYOWg0OXRMSk5QLXE4RWVCWWl5U2JaSWE2SXNVUHhzMW9MLWdpUWJaTk1weHhFTnhhZF9lUDlNcGxmMU9MdXJJdjloWmVBM3luLUZzeGJ2OUdBRHhsTjFtQ1dMLU5QNUFycjBzYXVkQzZBMG13V01vRGxOQlRZYTBkQ05NN0pPVloyY3JoNkhzY2hleU9PRlZVR2tscW5pWjZERGFQMkp6a0txQjB4ME5xZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Trust Faces 'Comparative Disadvantage' Without Staking: SEC Filing - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGrayscale, the world's biggest digital asset manager, is currently grappling with the limitations of its Ethereum Trust (ETHE) in the era of Ethereum staking.\n\nGrayscale recently updated its ETHE disclosures, adding: \"The current inability of the Trust to use its Ether in Staking and receive such rewards could place the Shares at a comparative disadvantage relative to an investment in Ether directly or through a vehicle that is not subject to such a prohibition, which could negatively affect the value of the Shares.\"\n\nThis addition comes on the heels of Ethereum's successful Shanghai upgrade in April, which enabled stakers to withdraw their locked ETH and rewards—thus making staking a more attractive proposition for many investors. With annual staking yields ranging from 4-6%, ETHE investors are missing out on potential returns.\n\nIf the Grayscale Ethereum fund were ever to allow staking, the firm noted, it would first need to amend its Trust agreement with the SEC. And NYSE Arca—the exchange where ETHE shares trade—would need to apply for an SEC rule change. The firm wrote that it \"may seek\" approval to do so in the future, but made it very clear that it can't stake any of the Ethereum backing the fund's shares now.\n\nAD\n\nAD\n\nGrayscale's frustration is understandable, especially given its ongoing efforts to convert ETHE into an ETF.\n\nIn a March SEC filing, the firm argued for the benefits of being able to \"stake the Ethereum held by the Trust\" as part of its push for an ETH spot ETF. However, the SEC has repeatedly denied Grayscale's ETF applications, leading to a legal battle between the firm and the regulator.\n\nGrayscale is not alone in navigating these regulatory challenges. Other prominent ETF applicants, such as Fidelity and Ark Invest/21 Shares, have recently removed staking language from their filings in what appears to be a temporary concession to the SEC's concerns.\n\nUnder Chair Gary Gensler, the SEC has taken a cautious approach to Ethereum staking, arguing that staking services may constitute securities offerings. The regulator has emphasized the need for clear disclosures on how staked crypto is handled by companies, including whether funds are commingled.\n\nAD\n\nAD\n\nWhile the SEC seems open to approving spot Ethereum ETFs, the staking issue remains a point of contention. Some experts have warned of \"serious security risks\" associated with Ethereum ETFs, noting that large, centralized holdings could make the network more susceptible to attacks or manipulation.\n\nFor Grayscale, the staking limitation is one of several challenges facing its Ethereum Trust.\n\nETHE has consistently traded at a discount compared to its underlying ETH value, a gap that has widened to nearly 50% in recent months. Converting to an ETF structure could potentially help close this discount by enabling share creation and redemption.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOUWotZ1U5VURCUWZ2c1h4Q2pXOUlTSlJLbVVZc0RQMWtrOUFOZEpHRm1BNVQ4Slp3d0hUTGlMZ2lDczd6Q2VxSjFocDg4Wi1TLUp5QThGMnF1WDVESU5WeWVULVF3ZVBCQW5TOENRSDY3bU9CWjBXSFprVU5TUzJHd2NJWDBITGdrX2t5YkppOUNiUnQ5cVVwdnhyS1NrQzhWbURBVFY3eGJobXpZcXhvQ3lDUlVMNjZPQkFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Here’s the $1 Billion Signal Keeping ETH Below $3,600 - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORHJWTHhlNXBWUVBjdVdkN2VZdy1DUm1kSjI5X1Q5Wm13bXNOazA3MWhYQ3dLYmpOaG42d0lDWmRuU0lWTnhCVnFEVzFYZndTOC04OFNDbThfeHRoNVRtS0ZIdThpMXVqSDlvM2JqUWlVMVBVWUpMN2hkTWRUVG83MXZsczc0bXlyaGh1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Altcoin Watch: Ethereum and Solana Maintain Strength, Furrever Token Offers High Referral Bonuses - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 21, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is energetic and ever-evolving, with certain tokens standing out due to their special advancements and promising prospects. As we move through 2024, Ethereum, Solana, and Furrever Token rise as the must-watch cryptos, each advertising unmistakable focal points and openings for financial specialists.\n\nEthereum and Solana: Balanced for a Major Upward Move?\n\nLater market examination by Jason Pizzino demonstrates that the cryptocurrency market is right now in a stealth zone, characterized by expanded fear and diminished market intrigued. This period regularly leads to littler extended bars after beginning alarms, with key levels just like the 50% mark holding relentless and lows remaining marginally higher. These patterns suggest the market may well be equipping up for a critical upward move within the coming months.\n\nEthereum's Resilience In the midst of Market Declines\n\nEthereum (ETH) has appeared relative quality by keeping up its position over the significant 50% level of its extent, set up amid the May low. This period coincided with Bitcoin's crest taking after ETF news excitement. Later advancements, such as the SEC dropping certain cases, have encouraged Ethereum's price soundness, in spite of broader market decreases.\n\nWhereas the majority of the market has seen significant drops, Ethereum has managed to hold its ground. In case Ethereum breaks down to around $3,400, Pizzino proposes that $3,200 might be a secure level to observe. In any case, on the off chance that it falls below $2,829, it might flag that the ETF news isn't as positive because it shows up. This level of strength shows a bullish structure for Ethereum, proposing potential for a slow recuperation over the coming months.\n\nSolana's Bullish Positioning\n\nSolana (SOL) is in a comparable position to Ethereum, remaining over the 50% mark of the whole bear market range. As of now exchanging over $138, Solana includes a drawback support around $109. This situation indicates a bullish structure, with Solana putting in higher lows and keeping up quality inside its cycle. Previous corrections in Solana extended from 37% to 52%, recommending that a redress down to 50% would be steady with past designs.\n\nSolana's capacity to remain over these key levels despite market instability highlights its potential for a major upward move. The bullish structure of Solana, coupled with its historical correction designs, recommends that it is well-positioned for recuperation and development within the close future.\n\n\n\n\n\nStory continues\n\nFurrever Token: Earn 10% With Referral Program\n\nIn the midst of the major players like Solana and Ethereum, Furrever Token presents a revival and locks in turn to the crypto showcase. Outlined with a charming cat-themed environment, Furrever Token points to supply a delightful user involvement whereas advertising considerable monetary openings.\n\nThe continuous presale of Furrever Token has as of now raised over $1.3 million, with the extent as of now in arrange 9, pointing for an add up to of $1.9 million. The project's commitment to security, approved by an audit from Securi Lab, assists in enhancing its credibility.\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPOE1mZHpIRHpqRVR4Mk1oenpjc0g3ckozMkFBTUlnWTJ6UElzN1JUS3lGRWh4MUV5Uks0LTlna0hfc3lZVFVKZS1FNTNULWtmOEsyTEF4M09MTXR0emI3eEZMZWI0R1ZkWFhpckljZ2kwS1NERFFxSjFCOU5qcUlYSVFoWDZ5RVo2UDU2Y3RR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Applicants File Updated S-1 Documents With SEC - Watcher Guru",
        "content": "Multiple Spot Ethereum ETF applicants have filed updated S-1 documents with the SEC for approval of their ETF products Friday. As the last step before launch, The SEC requested that issuers file new ones to speed up the process of reviewing the ETF products.\n\nJUST IN: The following applicants filed an updated version of their S-1 spot Ethereum ETF application:\n\n\n\n• Bitwise\n\n• Fidelity\n\n• VanEck\n\n• Franklin\n\n• 21Shares\n\n• Grayscale\n\n• BlackRock — Watcher.Guru (@WatcherGuru) June 21, 2024\n\nBlackRock; Grayscale; VanEck amongst others submitted their S-1s today. The SEC must now review the forms and let issuers know of any final changes needing to be made before ultimate approval. These forms are necessary to offer new securities publicly. This process may take more time for the SEC to process for each filer, especially if the regulator still holds any dissatisfaction for Ethereum ETFs. However, the prediction for a July 2nd launch still looks possible.\n\nFor context, Ethereum-based Exchange-Traded Funds (ETFs) are a type of investment fund that holds Ethereum like stocks, commodities, or cryptocurrency. The ETFs trade on stock exchanges similar to stocks. The first round of Spot Ethereum ETF approvals came at the end of May 2024.\n\nSpot Ethereum ETFs To Come This July?\n\nSource: Altcoin Buzz\n\nEthereum Price Prediction: Can ETH Hit $4K After SEC Decision?\n\nThroughout this year, ETFs have dominated the digital asset sector. The industry’s landmark approval arrived in January, with Spot Bitcoin ETFs launching. The impact was near-immediate, as BTC would reach an all-time high just three months after its debut. The launch of Ethereum ETFs is expected to do the same for Ether upon launch. Already at press time, Ethereum is up 50% since the start of the year. Despite a bearish past month, July and August will be interesting in dictating the future of the asset’s price.\n\nThe hype around Ethereum ETFs is even spreading in Europe. UK-based multinational bank Standard Chartered is officially launching a Spot Bitcoin and Ethereum trading desk. Bloomberg reports that the $820 billion bank’s STAN will be used for buying and selling both BTC and ETH directly"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9nRlU4SXNINHRMVVJpTEl5ajRvTmFUdF9raTlDTUZxdWVITkJRLTVRSFRqZmtFMWRYV01QV0dkb0haNXNEczZLc0V2Z2M1bXNSMzQ5VVBlQjFVVnVQcGNhWC1BVDVvRzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "“People can access me 24/7:” Bitwise Ethereum ad pokes fun at traditional finance - Crypto Briefing",
        "content": "Bitwise's Ether ETF attracts potential $100 million from Pantera Capital.\n\nShare this article\n\nAsset manager Bitwise released a commercial today comparing Ethereum (ETH) and traditional finance in a joking tone. With the caption “Unlike Big Finance, Ethereum doesn’t clock out at 4 p.m.”, the commercial portrays traditional finance as a senior and tired man, while Ethereum is a more jovial and full of energy version.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nThe character representing Ethereum shows surprise when the character portraying the traditional finance market says he’s “gone for the day” after “working non-stop since 9:30 a.m.” He adds that Ethereum would be tired too if it “moved billions around the world.”\n\n“Actually, I do. You know, stablecoins, NFTs, loans. People can access me 24/7,” says the character portraying Ethereum, and traditional finance shows surprise at that statement. Additionally, the commercial also jokes about the fact that traditional finance markets don’t work on weekends.\n\nAs reported by Crypto Briefing, Bitwise has revised its Form S-1 registration statement for its spot Ether (ETH) exchange-traded fund (ETF), highlighting a potential $100 million investment upon its launch.\n\nMoreover, the SEC filing indicates that Pantera Capital Management has shown interest in purchasing up to $100 million of shares in this Ether ETF. However, these indications are not binding commitments, leaving open the possibility of purchasing more, fewer, or no shares at all.\n\nNotably, the spot Ether ETFs could start trading in the US within two weeks, as shared by Bloomberg ETF analyst Eric Balchunas on June 14th."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOS0Z3SkR3Q1RVUHFfZ2duZl9GV2NCeTl5NTJyLUxUSDBfemdNd0hzMmNhX2I1RWc0QVNfcXp6SWw3Y0NKY2RKQWNNN09xRkRVcTEtQVFqRzAwRmJ0RjdXaS14SVc3YjRpYnI2VmVjeXNrRTZHbnQ0Tm5ZdDE0ZEJiYlhYYW1yQ05OUTlhaHVmMi02MkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Investigation closed: SEC clears Ethereum - Yahoo Finance UK",
        "content": "In a significant turn of events, the U.S. Securities and Exchange Commission (SEC) has closed its investigation into Ethereum 2.0, opting not to pursue any enforcement actions.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nIn a significant turn of events, the U.S. Securities and Exchange Commission (SEC) has closed its investigation into Ethereum 2.0, opting not to pursue any enforcement actions. This development has been hailed as a major victory for Ethereum developers and the broader cryptocurrency community.\n\nThis decision follows the SEC’s recent approval of Ethereum-based exchange-traded funds (ETFs). In a letter sent earlier this month, ConsenSys, a leading blockchain technology company, argued that the approval of these ETFs implied Ethereum should not be classified as a security. The company behind the MetaMask Ethereum wallet had urged the SEC to close the investigation based on this premise. The SEC’s decision to stand down has led to a significant impact on Ether (ETH). Its price saw a surge, breaking $3,500 in the minutes after the announcement, showing renewed market confidence.\n\nThis closure of the investigation marks the end of a contentious chapter in Ethereum’s history. The SEC had previously considered ETH a commodity but changed its position, leading to regulatory uncertainty and a lawsuit from ConsenSys. The lawsuit, filed in April 2024, aimed to halt the SEC’s investigation, arguing that Ethereum is a commodity and should not be under SEC jurisdiction.\n\nThe views and opinions expressed in this article are those of the authors and do not represent those of City AM, its affiliates, or employees.\n\nConsensys views the SEC’s latest decision as the beginning of a new era. In a recent blog post, the company declared: “Today’s development marks the beginning of a new path forward.” This outcome is a testament to Consensys’ persistent efforts, including legal battles, to protect the Ethereum ecosystem. However, despite this victory, Consensys has stated it will continue its lawsuit against the SEC, alleging regulatory overreach.\n\nThe SEC’s regulatory approach has been a point of discussion within the cryptocurrency community. While the Ethereum investigation has ended, other regulatory threats persist. For instance, the SEC has issued a Wells notice to Uniswap, indicating potential enforcement action. Similarly, Coinbase faces ongoing legal battles, and the XRP community continues to criticize the SEC for its perceived bias following Ethereum’s favorable treatment.\n\nThe crypto industry remains at odds with regulatory bodies, seeking clearer rules and fair treatment. The SEC’s recent decision is a positive step, but the journey toward regulatory harmony is far from over. As the landscape evolves, both crypto developers and regulators will need to work together to put in place a balanced framework that fosters innovation while ensuring compliance.\n\nThe views and opinions expressed in this article are those of the authors and do not represent those of City AM, its affiliates, or employees."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOdnFaakVHTm5VZHBOeEVBQkRmZEVpSnRxejRIdUphblVySmJCNFNZU3RhZkNJMnpValg1a0NWOUVqLWdkaVNWZ2V5QXBHQVh4SUZKM01ReDFRTmZPYVpxc1htLWx1aUxMUWRnZTI5MEZBT3ZMRTFhLWNuSjdyb3FEaTNQR1JjWm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation - Yahoo Finance",
        "content": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation\n\nIn a recent development, Coinbase has listed the Ethereum (ETH) restaking protocol project, EigenLayer (EIGEN), for pre-launch trading. Coinbase’s announcement on X confirmed that EIGEN is now open for trading ahead of its official launch on Coinbase’s International Exchange and Coinbase Advanced. This is specifically for users in eligible jurisdictions outside of the US, UK, and Canada.\n\nDon’t Miss:\n\nThe exchange explained, “You can now trade EIGEN-PERP with up to 2x leverage. EIGEN opens with a price of $7.307 and an Implied FDV of $12.2 B.” EigenLayer enables ETH holders to re-stake their tokens for use as “cryptoeconomic security” for protocols other than Ethereum, in return for protocol fees and rewards. An example: if you staked $100 of ETH for 10 years at a rate of 5%, you would have $127. However, if you restaked the original ETH just one time for a total of $100 staked across 2 protocols for 10 years at a rate of 5%, you would have $154.\n\nThe pre-launch trading feature on Coinbase is a novel addition. It permits users to trade perpetual futures contracts on tokens that are yet to be launched. Once the underlying token is launched on relevant spot exchanges, the instrument transitions to a standard perpetual contract. Its accepted collateral/margins were listed as USDC, BTC, and ETH with a minimum order size of 10 USDC.\n\nHowever, Coinbase has also issued a warning to users about the increased risks associated with trading pre-launch digital assets. The exchange emphasized the need for users to fully understand the risks involved before trading contracts.\n\nThe listing of EigenLayer’s restaking protocol on Coinbase for pre-launch trading marks a significant step in the evolution of the cryptocurrency market. This move not only provides traders with an opportunity to engage in futures contracts on tokens that are yet to be launched, but it also reflects the growing acceptance and integration of Ethereum-based protocols in the broader digital asset ecosystem.\n\nFurthermore, the introduction of pre-launch trading on Coinbase could potentially pave the way for other exchanges to follow suit, thereby expanding the range of trading options available to cryptocurrency investors. However, it’s crucial for traders to heed Coinbase’s warning and fully understand the risks associated with pre-launch trading.\n\nStory continues\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZXRXVk1ZaFBvNzhXMVFaVFdPT2pJMXpQemtmWmszYWpNc2ZKTTRSZUhRU3B6dzg3LS1EZUdvcE5FVVVnUW1kaGRDbU04eWJfRjRoZzhyeWhiUkJHQXczQTNhQk5oaXpnQU1wOXA4ZzludFVVU2NiVHVJLWxHcUdsbNIBiAFBVV95cUxPWTFZVHVfbmpDVGV1V3p4amF6ODBuQUhPZ3Z5QTFGamN3VnFiTDNZYUJMc1dWUzZVVm40cFV5blJSdFlycG1qTWZJVmJpX2NkT1RYblhJbnFkcHZSNVZEWm9kbjNncjg5Um5YMXBIRTV3X1dMdmRXRTZEdHJIQzhLeTdDSGlIOW84?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Derivatives Traders Are Deploying an Iron Condor Strategy - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum has fallen to $3,480, a 3% slip in the past 24 hours. Traders at Wintermute told Decrypt that ETH appears to be range-bound between $3,200 and $3,400 as derivatives traders are likely profiting from an Iron Condor strategy. The firm added that Bitcoin has been similarly range-bound between $63,000 and $65,000.\n\n\"Market consensus is these areas take importance as 'lines-in-the sand',\" an analysts from the firm's trading desk told Decrypt, \"and I'm seeing traders lean on them to define risk.\"\n\nAn Iron Condor is a direction-neutral options strategy where traders benefit from the underlying asset staying range-bound until the expiration of options.\n\nIt’s a relatively low-risk strategy that’s suitable for traders who expect low volatility in the Ethereum price. But because it involves buying and selling four different options contracts with the same expiration date, it requires precise timing to pull off.\n\nAD\n\nAD\n\nThe Wintermute analysts highlighted that the price range is an important area for derivatives traders, and a major swing in either direction could have a drastic impact on the price of ETH.\n\nEthereum’s open interest dropped to $11.5 billion this week, which indicates that traders believe major price swings in the asset are unlikely. That's for the short-term. But there are signs that traders expect upward movement in the coming months.\n\nThe analysts noted that yesterday, a large trader bought Ethereum options with a $4,000 strike price while paying a $12,054,100 premium. The expiration date for these option contracts is September 27. The trader could potentially profit to the tune of approximately $107 million if ETH witnesses an upswing, especially if it crosses the $4,000 mark.\n\nThe expiration date of these contracts is important, as the U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler has stated that U.S. spot Ethereum ETFs will go live sometime this summer.\n\nAD\n\nAD\n\nOption contracts expiring between June 28 and July 5 have witnessed an increase of 6-8% in their implied volatility (IV). High IV indicates that buying options contracts is more expensive and poses a greater risk for the buyer. Additionally, these contracts are likely being bought in anticipation of commentary from the SEC regarding U.S. spot Ethereum ETFs.\n\nEthereum has seen some major positive developments over the course of the week.\n\nIn the past 24 hours, Bitwise has released a TV commercial for Ethereum ahead of spot ETFs. The firm minted the video as an NFT on the Ethereum blockchain.\n\nEarlier this week, leading Ethereum developer Consensys announced that the SEC had closed its investigation into Ethereum 2.0 without filing any charges.\n\nThere are also signs that even without a start date for Ethereum ETFs to begin trading, institutional demand is starting to gain steam.\n\nPantera Capital Management LP is planning to invest $100 million in the Bitwise Ethereum ETF, the issuer noted in an SEC filing. A report based on data from research firm K33 indicates that Ethereum ETFs could potentially attract $4 billion in inflows within five months of their launch.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOOXJCakt2YmlkaG9NSDJTdGtyQW5zMVlxaDN5OURVU0tLSEdGR0ZFSElOSE41NFZCUjlrXzQydmp1Z1c2WUZodjFWenBocklzLWRweFhmYURxS0NfOXlxbE5udVlGaFQ3N2djeEhjeDlHM3YxTnVUbUpWb2RDZHBab0MtU254S1JwUmlZQkxXeHg0NFItMnRoRDdLUEhXSDA4bXF0UkhremstTUxOemR1UTFjc0ctdWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "XRP News Today: SEC Ends Ethereum 2.0 Investigation, Ripple’s Future - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQRE4zNTFGWUJ3aDhoYm4yOGZsZ2o4bWg2T3A2dElZQ1JVQTR4VWZKenBlcl93Y3h4aXhKZnZIOW0tTE9zdXRHT2VjZW80SFh3RW84bVlaRFhkaUhaWG44OGU5eUJhZXpDSDFuTmRMVzgyUllfeUJ6NDdfQk5LYUVyVWVjX2JDVUJVNXdCeTRpb0hFVkpCbFBtUVlmMjkzZkxkTHE2T0tZdHBHZV9Za1pMSHdxU1pqUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum L2 Blast Posts All-Time High in Daily Transactions and Users Ahead of Airdrop - Unchained",
        "content": "Airdrop season continues as Blast’s token generation event is set to occur on June 26, about a week after interoperability protocol LayerZero and rival blockchain network ZKsync opened up claims to their airdrop\n\nAhead of next week’s airdrop, Blast has a total value locked of about $2 billion, more than Base’s $1.6 billion.\n\nBlast, an Ethereum layer 2 blockchain network, recorded all-time highs in daily transactions and active users on Thursday, ahead of its airdrop scheduled for June 26.\n\nAccording to data from blockchain analytics firm Artemis, the number of wallet addresses active on Blast, a rough proxy for active users, more than doubled from roughly 73,500 addresses at the start of June to about 168,400 as of June 20.\n\nThe increase in active addresses coincided with an uptick in daily transactions as well. Users generated 640,1000 transactions on the first day of June. Since then, the number of transactions has grown almost 72% to 1.1 million transactions, per Artemis’ most recent data.\n\nRead More: What Is Blast on Ethereum? A Beginner’s Guide\n\nThe all-time highs in daily transactions and users come as those in the Blast ecosystem are gearing up for the protocol’s airdrop, set to occur in less than one week. “Dapps must distribute all Gold and Points to users by June 25, 8 a.m. ET in order for it to be counted,” wrote the Blast team on X two days ago.\n\nHalf of the Blast airdrop is allocated to points, which are earned by users based on the balance of their wallets, while the remaining 50% has been earmarked for “Gold,” which is for decentralized applications building natively on Blast. According to Blast’s protocol documents, “Gold is meant to be used as incentives for Dapp growth. This means that Dapps should give 100% of any Gold they earn to their users.”\n\nBlast’s record levels prior to its airdrop also comes in the same week interoperability protocol LayerZero and rival layer 2 blockchain network ZKsync opened up their airdrop claims, aiming to reward their contributing users.\n\nSybils\n\nThe increased network activity in addresses and transactions for the months-old layer 2 blockchain network is a sign of Blast’s popularity among users. But it is also safe to assume that a number of these addresses and transactions stem from Sybil techniques, in which one person acts as many users by employing more than a single wallet.\n\nThe goal of a Sybil attack is to simulate the kind of activity rewarded in an airdrop, distorting the on-chain picture of user activity so the attackers can, in this case, claim a larger share of the airdrop. Attempting to identify and disqualify addresses engaged in Sybil activities has become a common practice during a protocol’s preparation in conducting its token generation event.\n\nLow-scale Sybil activities would mean a relative handful of Blast addresses were duplicates, while professional Sybil farmers may use thousands of wallet addresses to generate transactional activity on the network."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNamFEWFgyT01qMlVWZmVuVWF1NTF3Tks3YWdZUmFNbDJxV0xsb0lITmU1V1Q1WEVGcS1HOGdpWFRUcG9SZEpxVVRzcnpjYWJqejlDbHFEMDkyT1M2eFZwS0loN213TjJLeGNpU2JaRi1mZDhsNlZQUjFDaFZNRm5wYWFCRzRPWElTZzhLNTUyU2FOZ3ByOXVIbjZkazUwNGhSRFBDN1JSMHVhWncteTZzOFM2dkhhVUFfLUJQcWNmMERqOXNkZU9LckxXRGI4bGQ2dTA5dXJ5VdIB3AFBVV95cUxNMDdVMDRhV0o4VElXYzJ5VFZjcnY2dldLUEl5a1N1S1JFSDVMUVFkb1o0WG5QY0tET3RMQ1dqdHFqby0xeV85ZllKcU83dXhweDZpQm4wRDVtNE51aVpRTVNxQXphWTFyWFRldGpYRm1YZVRwRC1KZnBCWjdzZzBLSWlCcERXekIxZHU2Y2VJcHR5dmVOcEItNGRPM2s4THU5d3d5d1ZkRXhVQkdwelZZUnlfWGRRX0R6WE43bzFtVzNZWlE5S0V4bVZWWDdIWElDdzMxRWg2czRhV0h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "One Ethereum Indicator Is Signaling Altcoin Season Will Start Early, According to Quant Analyst Ki Young Ju - The Daily Hodl",
        "content": "The CEO of blockchain analytics platform CryptoQuant, Ki Young Ju, is updating his outlook on altcoins ahead of a potential approval of spot Ethereum (ETH) exchange-traded funds (ETF) by the U.S. Securities and Exchange Commission (SEC).\n\nYoung Ju tells his 348,500 followers on the social media platform X that Ethereum’s Market Value to Realized Value (MVRV) metric is flashing a bullish signal.\n\nThe MVRV indicator, which is used to assess whether a particular crypto asset is undervalued or overvalued, is the ratio of market capitalization of Ethereum, or any other crypto asset, relative to its realized capitalization (the value of all ETH at the price they were bought at).\n\n“We’re entering early altcoin season.\n\nETH MVRV is rising faster than Bitcoin (BTC) MVRV, suggesting ETH market is heating up relative to its on-chain fundamentals.\n\nGiven the current ETF situation, this might be an ETH-only season. Historically, when ETH surges, other altcoins tend to follow.”\n\nTurning to altcoins, the CryptoQuant CEO says that memecoin dominance is on the wane after reaching a 15-month high in March. Memecoin dominance is the proportion of the total market capitalization of memecoins relative to the total market capitalization of altcoins.\n\n“Crypto Twitter would be shifting from gambling to focusing on fundamentals, similar to a few years ago.\n\nPack it up lads, it’s over.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBZMWpwWWx5ZEN0R1RaVWY0TkVvZmliTnAtQ1Q5UnNOTjlYNzdWR0VSTUhwWmlTYXVjektvcFZMOEpocjRaUEd1MmhVSEJWTm9JRW9UQzBOOHVncGx5cF9LZXMzSEJxemU3SDZSckZvcFJaaWZ2bk00UkNMUTM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered set to debut spot Bitcoin, Ethereum trading platform - Crypto Briefing",
        "content": "The bank will place the new desk under its FX trading division.\n\nShutterstock cover by Willy Barton\n\nShare this article\n\nStandard Chartered is launching its spot trading operations specifically for Bitcoin (BTC) and Ethereum (ETH), Bloomberg reported on Friday, citing people familiar with the matter. The new offering will expand the bank’s suite of digital asset services, including crypto custody and OTC trading.\n\nStandard Chartered’s FX trading division will handle spot trades for the two leading crypto assets. The new desk, based in London, is expected to launch operations soon, as reported.\n\nWhile banks like Goldman Sachs Group have offered crypto derivatives, direct dealing in the assets has been limited due to stringent regulations. The Basel Committee on Banking Supervision’s proposed rules have made profitability challenging by requiring a high-risk weighting for crypto exposure.\n\nStandard Chartered is working with regulators to address concerns and meet the demand from their institutional clients who want to trade Bitcoin and Ethereum.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” a representative from Standard Chartered stated.\n\nThe launch will make Standard Chartered among the first major banks to establish a spot crypto trading desk, paving the way for wider institutional adoption."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1zZ09EaGtEQ1h5Sm1DNDl6ZDhJQlVaNjl3MVM5VkF0UnB1Ni03NGtDdjZTcDNWMnk0aFlGcXV2VERJN0tRelVHVG9MdTVZWjNwRzlhZEYxTGlaaXdWQlBmOU5KUjZyMzZMNk800gFzQVVfeXFMUDB3Y19XYWFkQmZOVW4zNm1pSDAxaHNZd1IyQmw5ejBLYXlxX1d1TTY3LWtEbWkyZTZlcmxnbzFQTVpDTWtqaklyZ29lemVJNEtaWkRQV2hxNWY4YjdXdXVEX0U4bHpvLWc4U1ZLZ3VOLVJjOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Preps for Primetime With TV Commercial Ahead of ETF Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe second wave of the crypto ETF marketing blitz has officially begun, with crypto index fund manager Bitwise releasing a “national TV ad” on Thursday talking up the Ethereum network.\n\n“Unlike Big Finance, Ethereum doesn't clock out at 4pm,” the company wrote in a tweet on Thursday with an accompanying video.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nAD\n\nAD\n\nThe 40-second commercial featured an old man role-playing as the traditional stock market that’s only “awake” from 9:30am to 4pm, contrasted with a young man representing Ethereum—a blockchain that never goes offline.\n\n“Stablecoins, NFTs, loans... people can access me 24/7,” the young man tells his elder. “You’ll get after it again on Monday.”\n\nFollowing the post, Bitwise revealed that it had minted the video as an NFT on the Ethereum blockchain. Half of the ad’s proceeds will go directly to the commercial’s two actors.\n\nThe simple, short pitch mirrors that of the array of Bitcoin ETF commercials that hit the airwaves late last year. Promoters like Galaxy Digital said Bitcoin “embodies empowerment in the digital age,” while HashDex pitched it as the next “disruptive innovation” in financial technology after the credit card.\n\nBitwise was also the first of many issuers to run a Bitcoin ETF ad at the time, recruiting help from Johnathan Goldsmith—the most interesting man in the world.\n\nAD\n\nAD\n\nThat influx of ads preceded the Bitcoin spot ETF rollout that occurred roughly a month later, attracting billions of dollars in investments. As of today, expert analysts believe Ethereum ETFs are weeks away from going live, with Bloomberg ETF analyst Eric Balchunas forecasting a simultaneous launch on July 2.\n\nGrayscale ran a TV commercial about Ethereum in March in support of its existing $10 billion Ethereum Trust (ETHE), which it intends to convert into an Ethereum ETF. However, Bitwise's ad is the first to go out for a proper Ethereum ETF after regulators officially approved them for public trading in late May.\n\nWhile no other Ethereum ads have emerged yet, future ETF providers have been talking up the asset’s investment thesis. Much like Bitwise, VanEck in early June pitched Ethereum as a new and improved set of global financial rails, forecasting that ETH would hit $22,000 by 2030.\n\nLikewise, Bitwise CIO Matt Hougan posted a thread on Thursday arguing why investors may want to diversify into Ethereum alongside Bitcoin.\n\n“Adding ETH to a portfolio over a full crypto market cycle has historically boosted both your absolute and risk-adjusted returns compared to adding BTC only,” said Hougan.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1mZ1VuSE5fRUxTc3doNEphZUpXUFRuUHo3c0JYSFpCcmhlNGZXMkpmX1RjU1JTVWFPSnBlcmdhM2xMYmYydVc3VER4WmFHQjBpZzdiX0s2UXZtSV9wZ05ISzdQOW1OSU5oTHJhTWt4bmQ4Y3c0NVB6R0QySQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Could Holding 6 (ETH) Still Make You a Millionaire? Cathie Wood's Ether ETF Pullback And Her $20 Trillion Market Cap Prediction - Yahoo Finance",
        "content": "Could Holding 6 (ETH) Still Make You a Millionaire? Cathie Wood's Ether ETF Pullback And Her $20 Trillion Market Cap Prediction\n\nEarlier in the year, Bitcoin dominated financial headlines thanks to its recent halving and the emergence of spot exchange-traded funds (ETFs) boosting its demand. However, Cathie Wood of Ark Invest made a bullish prediction that Ethereum (ETH) may soon catch up to Bitcoin and potentially offer investors significant returns in the years ahead.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nDogecoin millionaires are increasing – investors with $1M+ in DOGE revealed!\n\nSpeaking at Big Ideas, an investor conference hosted by Ark Invest, Wood shared her optimistic outlook on Ethereum. She projected that Ethereum’s market capitalization could soar to $20 trillion by 2032. Given Ethereum’s current supply of approximately 122 million tokens, this projection translates to a staggering per-token price of over $166,000. Moreover, since the Ethereum Foundation continues implementing token burns, this price could rise even further.\n\nAt the hypothetical price of $164,000 per token, holding six ETH would equate to a value of just under $1 million. In comparison, the current price for six ETHs is roughly $21,000. To put this into perspective, the total market capitalization of the S&P 500 is approximately $40 trillion, while the global value of above-ground gold reserves is estimated at around $16 trillion. While reaching a $20 trillion market cap is theoretically possible for Ethereum, such a milestone is likely far off, if it happens at all.\n\nWood’s optimistic forecast is primarily grounded in Ethereum’s potential for mainstream adoption. Today, Ethereum is mainly used to interact with decentralized finance (DeFi) applications, which offer services ranging from borrowing and lending to storing health records.\n\nHowever, in 2024, DeFi remains predominantly focused on small-scale financial platforms. Wood argues that if Ethereum can expand its use cases to provide substantial user benefits, broader adoption could follow, potentially driving up the token’s price.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nWood’s projection, while ambitious, may partly be intended to generate excitement among investors about Ethereum’s future. Despite the optimism, her forecast might not materialize as predicted. It’s crucial to note that Wood has a vested interest in Ethereum’s success. Ark Invest, her firm, already offers an Ethereum futures ETF (ARKZ).\n\nHowever, it was reported by Bloomberg that Ark Investment withdrew from issuing an Ethereum exchange-traded fund (ETF). Previously, Ark had submitted an application for a spot in Ether ETF in partnership with 21Shares, but Ark’s name has now been removed from the filing. Despite this withdrawal, Ark’s official statement emphasized the company’s continued belief in Ethereum's transformative potential and long-term value. Bloomberg analyst Eric Balchunas suggested that the decision might have been influenced by the ongoing \"fees war\" in the market, which complicates profitability for issuers.\n\nStory continues\n\nThough many believed that the introduction of spot Ethereum ETFs would bring a boost to ETH prices, when the U.S. Securities and Exchange Commission (SEC) made a surprising move to approve the sale of spot Ether ETFs last month, ETH continued to slump, nearly dipping under $3,000 per token earlier this month. We've seen an incredible bounce back earlier this week, peaking at nearly $4,000 before hovering at $3,500 again.\n\nAn increase in Ethereum’s trading volume would benefit Wood, particularly in relation to Ark Invest’s financial products. Despite this potential conflict of interest, many investors remain optimistic about ETH’s future. As cryptocurrency adoption continues to grow and the possibility of spot Ethereum ETFs looms, there is considerable potential for ETH to achieve new price milestones.\n\nThis story was previously published on Benzinga and has been updated.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Could Holding 6 (ETH) Still Make You a Millionaire? Cathie Wood's Ether ETF Pullback And Her $20 Trillion Market Cap Prediction originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQVENtMEd3U0VxdmpSaXJCNEFnZ2lnQjh5ZHJ4Y3VXMC1UVjJvTDRodUJtQTdLNFFhdlRyZ252T3hOWTJjV2FvVHBUWWpRYkN5WngtS181d0Z5MXh3UC00Z0llNWNwUUppcEJlelBKWkRTMVBYc1JvMlJzSXM2V21uQtIBhgFBVV95cUxNbHEtTml5bXJIQTZ6bmd4RlNPZFVWQi1sUzhKdlV2YWZlMlBtOGJOczBOMWZzLTdjVjkxUHRrUGZndzM5ejhaTlgxbzQ5VWdPUU5CdEk3X2RWc1lQMlFQWnhsYTdoSmgzUnJ5bllnRksyUWpmSmV3M1h5WncwRXM2dWZXT2k4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ripple’s Top Lawyer Has Questions After SEC’s Ethereum U-Turn - U.Today",
        "content": "Stuart Alderoty, Ripple's top legal mind, still has some questions left after the U.S. Securities and Exchange Commission unexpectedly dropped its investigation into Ethereum.\n\nAdvertisement\n\nEven though Alderoty described the SEC's decision as a \"big win\" for Ethereum studio Consensys, he is still not sure whether it means that the company's offers and sales of the Ether token are not securities. Moreover, the legal status of Ether itself largely remains in a grey area.\n\nAs reported by U.Today , SEC Chair Gary Gensler has repeatedly refused to clarify whether or not the Ether token can be considered to be an unregistered security. Alderoty is now wondering what Gensler's response to such a question would be now that the agency has abruptly ended its probe into Consensys.\n\nAdvertisement\n\nIn April, the Ethereum backer filed a lawsuit against the agency after a Wells notice of impending enforcement action. Consensys accused the SEC of recklessly hurting market participants and developers by attempting to label Ether as a security. The studio also defended its popular MetaMask wallet, denying the SEC's claims that it had violated securities laws by acting as an unregistered broker-dealer.\n\nIn a sudden reversal, the SEC ended up not recommending an enforcement action, sending the price of the Ether token higher earlier this week.\n\nHowever, the status of Metamask and staking remains unclear, according to Alderoty."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPeWx3UFB1UTRaZXRUZkVscnBMZnR4cFVFM0tlTk9QdV9zaEliUlVFRVBTTDUteHF0WXdiSzZZMFYya05HZDdPU2lZRElHYXpWOU1FdnliS21qZkhxclNpb2ppUXRTbTFDQXFiSU85bUZsZXBfb0hTcmtna2lKN0FjckJZN1U3TXpQbnRnRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ultimate Crypto Guide: Bitcoin, Ethereum, and Furrever Token with Cutting-Edge 10% Referral Bonuses - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 20, 2024 (GLOBE NEWSWIRE) --\n\n\n\nAs we look to the future of cryptocurrencies, Bitcoin stands strong as a market leader, while Ethereum continues to captivate meme coin enthusiasts. Now, Furrever Token is poised to join the fray. This article examines what Furrever Token brings to the table alongside these giants.\n\nBitcoin Price Proceeds To Fall As Whale Activities Deepen\n\nBitcoin's price fell underneath $65,000 on Wednesday taking after Expanded whale exercises that will be offered orders. In the interim, hedge funds have experienced a drag in their Bitcoin introduction, which may be fueled by steady surges among Bitcoin ETFs.\n\nEthereum ETFs May Not Cause Upward Surge in ETH Price As Numerous Anticipate\n\nEthereum's (ETH) price expanded over 4% within the past 24 hours after the Securities & Exchange Commission (SEC) dropped its Ethereum 2.0 examinations in the midst of desires of spot ETH ETFs. In any case, the later energy encompassing ETH ETFs may not lead to the anticipated price increase.\n\n\n\n\n\nFurrever Token Stands Out with Innovative 10% Referral Program\n\nFurrever Token's presale has as of now raised over $1.3 million, with the venture right now in arrange 9 and pointing for an add up to of $1.9 million.\n\nFurrever Token offers a delightful client involvement centered around cat-themed symbolism and community-driven engagement. The unused referral framework permits clients to earn 10% in $FURR Tokens for each store made through their individual referral connection, making a fabulous opportunity for passive income. This framework not as it were incentivizes users but too cultivates natural community development.\n\nSupported by a comprehensive review from Securi Lab, Furrever Token guarantees a secure and reliable stage for its clients. The project's guide incorporates progressing integration of cat-themed substance and energizing future shocks, situating it as an interesting and agreeable speculation within the crypto space.\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a part of this crypto space.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nStory continues\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1ZaDJTdURzc3JFTmZSLTAwcXdzRGJrYjRQZGRYMVNMU3dlTmczTEVxYzl6S2dLMEFnTXNaWEFtUFBEOUx4bTJnVTV4djJMYzg4ejJzcHhSMExCeHFTZVVfMVQzQk5oMS1VVXRIbTZ4MEUyNDRZYkHSAXtBVV95cUxNaEdCOHlNQjRaZFlKUUdfblIxOV9ZOHdmUE1tLVI2V00zcUNndDMzNGdVelVqeGFqMVc4aVNMRVFDZ1YyT1NWT0preHBOdUNtNFEteXhjNldHclZLS1p0U2lVcXRVcEVlaHhIZ2lrMkJYb2ZoT3BtV3VRdkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Big Break Coming for Ethereum (ETH) DeFi, Here's Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe decentralized finance (DeFi) sector within the Ethereum network is poised for a major breakthrough. This projection is based on recent observations within the ecosystem and the broader cryptocurrency space. Renowned analyst and cofounder of Syncracy Capital, Ryan Watkins, asserts that the current setup for Ethereum DeFi is the strongest it has been since 2020.\n\nAdvertisement\n\nDeFi’s strong revenue growth and low valuations\n\nThe optimism lies in several factors such as the volume of revenue, upgrades in technology and the pending spot Ethereum exchange-traded-funds, ETFs, awaiting the final nod by the United States Securities and Exchange Commission (SEC).\n\nPer Watkins' analysis, DeFi leaders are seeing record-high revenues, while their valuations are at historic lows. This combination of high revenue and low valuation presents a compelling opportunity to investors.\n\nThe setup for Ethereum DeFi is the strongest its been since 2020.\n\n\n\nDeFi leaders are generating all-time high revenues across the board, yet valuations are the cheapest they've been in history.\n\n\n\nBetter yet, these revenues will likely accelerate from here as DeFi leaders rollout… pic.twitter.com/WmaajQIpxI — Ryan Watkins (@RyanWatkins_) June 20, 2024\n\nSome of the leading DeFi applications on the Ethereum network, such as Lido, MakerDAAO, Uniswap and Aave have recorded progressive increases in revenues, surpassing their 2022 peaks. Aave's annualized revenue for 2022 was just over $500 million. However, in May 2024, it reached an all-time high of $750 million.\n\nFurthermore, this revenue is expected to grow even more as DeFi leaders implement major upgrades, such as Maker's Endgame and Uniswap V4.\n\nAdditionally, the introduction of the Ethereum ETF is anticipated to spark renewed interest in the Ethereum economy. Despite facing a challenging regulatory environment since \"DeFi summer,\" the sector is gradually seeing improvements. Although there are no major policy changes expected in the near term, the overall narrative is becoming more favorable.\n\nMarket momentum and future prospects\n\nWatkins insists that as long as the long-term bullish trend continues, DeFi should benefit from positive momentum, given its highly cyclical nature. Market experts are optimistic that more and more users will be attracted by the DeFi offerings, further fueling growth.\n\nAlthough Uniswap is yet to generate any revenue, Watkins maintains that the potential for activating the fee switch seems imminent."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPdWxnOThBTWZETmloREdyR0pELUlTbGdXVVh4MnotMzk1VVpoWk5HUGhaWjl5d0xzUjZmVEJKaWpfNFRFTU1SUGNHa1A4c2phVVJFdXJoZ0l0bGFXZ3lkZVpjQWhsWVlLYk1jdHVfNm9yclpnUVVUMk02QUJVeVB2VkRNeGpqUVJERzRVdXNMUHRXaDJfaVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Highlights Ethereum DApp Innovations - Crypto Times",
        "content": "The founder of Ethereum, Vitalik Buterin explains several decentralized applications (DApp) that demonstrate principles of privacy and decentralization in the cryptocurrency market, indicating a continued focus on improvement and the core principles of Ethereum even as meme coins gain more attention.\n\nButerin described Farcaster as a social network that relies on the Optimism protocol. Farcaster still enjoys relatively low usage, but the platform still offers relatively high decentralization for users. Buterin spoke about the Lens Protocol, a decentralized application where users own their content, which speaks volumes about Ethereum’s vision of bringing decentralized interaction online.\n\nWe're still here! And a lot of that idealistic open internet stuff has actually moved forward quite a bit, eg. we have farcaster and lens, quadratic and retroactive funding, zupass, privacy-preserving ways to send ETH, ZK voting implementations… — vitalik.eth (@VitalikButerin) June 19, 2024\n\nButerin highlighted the importance of quadratic funding for the Gitcoin Grants as a fairly fresh concept of community funding for projects. This means they can fund different projects depending on what the community wants, thus, funding moves in the direction of accomplishing collective will.\n\nHe also mentioned that post-launch funding encourages schemes that have already proved useful and effective in practice, thus helping developers engage in more meaningful, effective project development.\n\nPrivacy improvements are also important according to Buterin in future Ethereum development. Buterin mentioned using zero-knowledge proofs (ZKPs) and zero-knowledge voting as critical innovations that allow verification of transactions and votes that occur in a black-box fashion while preserving privacy in the blockchain ecosystem.\n\nWhile meme coins have surged in popularity, often overshadowing more substantial, utility-driven projects, Buterin acknowledges this trend but contrasts it with the significant developments in decentralized finance (DeFi) and decentralized social networks."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOTzBDam10Y1lBNWpvVndkdW5DMGR3Y0hwVVA2d3pwbmJvZEc1TXd4UmM5N1hPUV9yVWNiZ0FRWXd6OVdWY201VXlDZDZ1aV9vdjZ5ZFZZMjlOMXYwX2x3SFVCVHZMTmdEeGpob0s5ZWhWV2hacGpKSGZlaERCLVluWXdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Bullish sign for Ethereum as exchange balances drop - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPSDZwTkh2dWs5S2xReklET1RHNy1IUXZfLTJWLWg5c2FhSEVZM3c2VHdfUWwwVU1vVVBJVFRaclBzZ3BlU1FZRlAxNWR2YVdkUmhUMUZ0RS14RDQ4OTFTYndjX0xMTWpWclcybTgtSXZudkFIVHNWZGFTbmQweEhGQVVLclhfcldo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Shiba Inu ETF Speculation, Ethereum's $4K Potential, and Furrever Token's 10% Referral Award - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 20, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency advertise is energetic and ever-evolving, with certain tokens standing out due to their special advancements and promising prospects. As we move through 2024, Shiba Inu, Ethereum, and Furrever Token rise as the must-watch cryptos, each advertising unmistakable focal points and openings for financial specialists.\n\nShiba Inu (SHIB): Pointing for 3x growth\n\nShiba Inu (SHIB) is the driving ETH memecoin, continuing to advertise dominance in spite of Pepe's (PEPE) bullish runs. As one of the foremost prevalent animal memecoins, the dog-themed cryptocurrency is set to blow up within the moment half of the year as the Ethereum biological system skyrockets.\n\nIts bullish viewpoint is obvious in analysts' promising estimates, anticipating a 3x upswing some time recently as the shade closes on the year. This will broaden the hole between Solana memecoins and possibly beat trending memecoins like celebrity and president memecoins.\n\nAdvance contributing to its appeal is its low passage point—a budget-friendly altcoin. It may be a retail favorite as a result, which is able play a key part in its other bounce.\n\nEthereum Price Forecast\n\nConcurring to the most recent crypto news, the SEC might give the much-anticipated S-1 approval for spot Ethereum ETF on 2nd July. In the event that this happens, the Ethereum price forecast might ended up exceptionally bullish once the ETF goes live on conventional trades. Be that as it may, the savvy contract advanced resource ought to break out of the neighborhood bearish drift to begin with. This would cruel a recover of the $3,500 support level, as appeared within the taking after 4H chart.\n\nFurrever Token: Entry in the Crypto Market with 10% Referral Program\n\nIn the midst of the major players like Bitcoin and Ethereum, Furrever Token presents a revival and locks in turn to the crypto showcase. Outlined with a charming cat-themed environment, Furrever Token points to supply a delightful user involvement whereas advertising considerable monetary openings. One of its standout highlights is the modern referral program, which permits users to earn 10% in $FURR Tokens for each deposit made through their individual referral interface. This framework not as it were incentivizes community development but moreover makes a stream of inactive salary for users.\n\nThe continuous presale of Furrever Token has as of now raised over $1.3 million, with the extent as of now in arrange 9, pointing for an add up to of $1.9 million. Furrever Token's guide incorporates energizing future advancements, such as elite charming cat substance, guaranteeing nonstop engagement and rewards for its community. The project's commitment to security, approved by an audit from Securi Lab, assists in enhancing its credibility.\n\nStory continues\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQSHp3aFo5RlZnSmNwOFA3dG8tOExuQmhSbmRfaHA4M09aeGRYQUs5Y3gzd2U2RlV0WFJsb1l1WXk2U0x0bHZ6UHRSMmQxZk5fZ3VsR1EtLUd5MmprNDFQUWhjRnFDNTBSbU5OVFVXbGwtVEV2cGs2eVAzWGxVeHJSWEdIay1VN1V2Q3d0bEpKc9IBlAFBVV95cUxQampzNWx5UGZwREdqWVM1bXJpcnkyTXhNZHJfcXZxSjFyZy1VTWNXQk8tcEhwajFUb0NSLWFaZ0pvZG1XbUhIRmhpemdXYmgzaU9JVm1XNEs2eXhnb1BTMG9IdEhCbHNNcG1DbWQ3Z2JidUh4RDJNUVlTR3djQUtwTWE3V3hqQjhWV25lbHFiSjdsaHZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "From Ethereum to Polkadot: The Journey of Gavin Wood - Crypto News Flash",
        "content": "Gavin Wood co-founded Ethereum and wrote its first implementation, pioneering smart contracts.\n\nWood founded Polkadot, enhancing blockchain interoperability, and later transitioned to Chief Architect for innovative focus.\n\nGavin Wood’s journey into the world of blockchain began using LEGO bricks rather than a computer. Self-described as a “technologist at heart,” Wood’s early interest with creating intricate constructions gradually moved from actual blocks to digital ones. This love of innovation and problem-solving made his later activities in the blockchain sector possible.\n\nBitcoin was the first cryptocurrency that Wood came into contact with. Thanks to the Silk Road online black market, his discovery was, in a sense, accidental.\n\nEnticed by the mathematical approach of human cooperation and interaction found in Bitcoin, Wood recognized the possibility of establishing whole new social systems. In little time at all, this interest became a professional possibility.\n\nThe Birth of Ethereum\n\nWood had a meeting with Vitalik Buterin and other trailblazers engaged in the ambitious Ethereum project in 2014. Once Wood joined this team, he was instrumental in turning Ethereum from a white paper into a working blockchain.\n\nWith the creation of the initial Ethereum implementation, he introduced the world to smart contracts—a ground-breaking idea that made decentralized, programmable transactions possible.\n\nWood wanted to create a platform that might propel social change as much as a new coin. Ethereum seemed to him like a means of creating a new planet that would propel human development for the remainder of the century.\n\nHis Ethereum work established the foundation for a significant force in the blockchain space that would upend established financial and economic institutions.\n\nMoving Beyond Ethereum: The Creation of Polkadot\n\nWood made major contributions to Ethereum and then focused on addressing some of the shortcomings he observed in the state of blockchain technology. As a result, Polkadot, a technology meant to facilitate smooth interoperability between several blockchains, was developed.\n\nThrough its special architecture, Polkadot addresses the scalability and governance problems that single-chain networks encounter by enabling several blockchains to run concurrently.\n\nood just presented a significant Polkadot update at the Token2049 conference: the Join-Accumulate Machine (JAM). By enabling multi-core computing and improving network flexibility, this new protocol seeks to offer a more modular and minimalistic design.\n\nFrom Polkadot’s current Relay Chain, the JAM protocol marks a dramatic change that will solve present constraints and advance the ecosystem toward its lofty objectives.\n\nWood resigned from Parity Technologies, the business that owns Polkadot, in October of 2022. He is still very much a part of Polkadot’s technical and conceptual components as Chief Architect, even if he is no longer CEO. This change enables him to spend more time on the creative improvements and projects that still define his profession.\n\nThe Broader Impact of Gavin Wood’s Work\n\nWood made more than just Ethereum and Polkadot contributions to the blockchain space. His concept to build decentralized platforms with blockchain technology has impacted a great deal of initiatives and businesses.\n\nThrough enabling interoperability between several blockchains, Polkadot has created new opportunities for both developers and companies, encouraging creativity and teamwork throughout the ecosystem.\n\nFrom a LEGO fanatic to a blockchain visionary, Gavin Wood’s path demonstrates his unwavering quest of technical innovation. Beyond what blockchain technology can do, his work has encouraged a new generation of developers and entrepreneurs to go outside the box.\n\nThe tale of Wood is proof of the ability of creativity and vision to propel technological advancement. Key elements in his success have been his commitment to finding solutions to difficult challenges and his ability to predict the promise of blockchain technology.\n\nWood’s story emphasizes for would-be entrepreneurs and engineers the value of remaining inquisitive, accepting obstacles, and never stopping to get better.\n\nThe future of distributed technology seems bright as long as Gavin Wood keeps leading and innovating in the blockchain field. His efforts with Polkadot and the JAM protocol are expected to completely change the way blockchains communicate, strengthening and expanding the ecosystem.\n\nRecommended for you:"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPUGlmczc2bVdOX1FzRXVwZUllNmRVT0xUMDJtbkJHcGN0QnZ3QTNMbDREZVVMb0lfWGtORWw2SjhOdzZDNzRKNXp1WUhnckkwNUxOSG5xQ0gzWHBLblZZbjNjNGE0SUpVeFRrZTI2QnU3d2oyVkdqU0w4bENYQjk0eUdrTXNmalNTVmRZQWFMVUl0ZjVCT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Comparing Avalanche and Ethereum: Which One Is Better? - Modern Diplomacy",
        "content": "Blockchain technology is developing quickly with several platforms springing up to meet the numerous demands and difficulties in the decentralized ecosystem. Among these, Ethereum and Avalanche stand out as two of the most prominent and innovative blockchain networks.\n\nDedicated platforms like Coindataflow.com offer a comprehensive analysis of cryptocurrencies, including Avalanche price predictions. Developers, businesses, and investors can access complete information on prices, market capitalizations, charts, and statistics for both Avalanche and Ethereum. To find out which one is better, you should read the article below where we compare Avalanche and Ethereum.\n\nThe Basics of Ethereum\n\nEthereum, launched in 2015 by Vitalik Buterin, is a distributed platform that enables developers to build and deploy smart contracts and decentralized applications (dApps). It introduced the concept of a programmable blockchain, allowing for the creation of a wide range of applications beyond just cryptocurrencies. Ethereum’s native cryptocurrency, Ether (ETH), is the second-largest cryptocurrency by market capitalization, following Bitcoin.\n\nKey Features of Ethereum:\n\nSmart Contracts : The platform’s primary innovation is its ability to execute smart agreements, self-executing contracts with the terms directly written into code.\n\n: The platform’s primary innovation is its ability to execute smart agreements, self-executing contracts with the terms directly written into code. Ethereum Virtual Machine (EVM) : The EVM allows developers to run code on the Ethereum network, ensuring compatibility and security across all dApps.\n\n: The EVM allows developers to run code on the Ethereum network, ensuring compatibility and security across all dApps. Decentralized Finance (DeFi) : The platform is the backbone of the DeFi movement, hosting numerous financial services, such as lending, borrowing, and trading without intermediaries.\n\n: The platform is the backbone of the DeFi movement, hosting numerous financial services, such as lending, borrowing, and trading without intermediaries. Wide Adoption: With a large developer community and numerous projects built on its platform, Ethereum boasts extensive adoption and a robust ecosystem.\n\nAvalanche: The Essentials\n\nAvalanche, launched in 2020 by Ava Labs, is a high-performance blockchain platform that aims to deliver unprecedented scalability, speed, and security. It utilizes a unique consensus mechanism called Avalanche consensus, which is a combination of Proof-of-Stake (PoS) and Directed Acyclic Graph (DAG) protocols. Avalanche’s native cryptocurrency, AVAX, has gained significant traction in the market.\n\nKey Features of Avalanche:\n\nHigh Throughput : Avalanche can process thousands of transactions per second (TPS), significantly higher than Ethereum’s current capacity.\n\n: Avalanche can process thousands of transactions per second (TPS), significantly higher than Ethereum’s current capacity. Low Latency : Transactions on Avalanche are confirmed in under a second, providing a seamless user experience.\n\n: Transactions on Avalanche are confirmed in under a second, providing a seamless user experience. Interoperability : Avalanche supports the creation of custom blockchains (subnets) that can interoperate with each other and other blockchain networks.\n\n: Avalanche supports the creation of custom blockchains (subnets) that can interoperate with each other and other blockchain networks. Eco-Friendly: Utilizing PoS, Avalanche is more energy-efficient compared to Ethereum’s Proof-of-Work (PoW) mechanism, which the latter plans to transition away from with Ethereum 2.0.\n\nComparison of the Crucial Aspects\n\nPerformance and Scalability\n\nWhen it comes to performance and scalability, Avalanche has a clear advantage over Ethereum. Avalanche’s consensus mechanism allows it to achieve a higher TPS and lower latency, making it more suitable for applications requiring fast and efficient transactions.\n\nEthereum’s current PoW mechanism limits its scalability, leading to network congestion and high gas fees during peak times. However, ETH’s upcoming transition to Ethereum 2.0, which will implement PoS, aims to address these issues and improve scalability.\n\nEcosystem and Adoption\n\nEthereum’s ecosystem is one of the largest in the blockchain space, with a vast number of dApps, DeFi protocols, and developer tools. The platform’s first-mover advantage has resulted in widespread adoption and a strong network effect.\n\nIn contrast, Avalanche is relatively new but has quickly gained traction due to its superior performance and flexibility. However, the adoption of Avalanche is growing rapidly, with many projects choosing to build on its platform due to its technical advantages.\n\nSecurity\n\nSecurity is a critical aspect of any blockchain network. Ethereum has a long track record of being a secure platform, although it has faced some high-profile hacks and vulnerabilities in the past. Its transition to Ethereum 2.0 is expected to enhance security further.\n\nAvalanche, with its novel consensus mechanism, also offers robust security features. Its PoS system reduces the risk of 51% attacks and ensures network stability.\n\nDevelopment and Flexibility\n\nBoth blockchain platforms offer flexible development environments. Ethereum’s EVM is widely used and well-supported, making it easier for developers to create and deploy dApps.\n\nAvalanche, on the other hand, offers more flexibility with its subnet feature, allowing developers to create custom blockchains tailored to specific use cases. This feature makes Avalanche an attractive option for enterprises and projects requiring specialized blockchain solutions.\n\nBottom Line\n\nDetermining which blockchain platform is better between two notable blockchain platforms ultimately depends on the specific needs and goals of the user. Ethereum boasts a mature ecosystem, extensive developer support, and a solid track record, making it a reliable choice for many projects. However, Avalanche’s superior performance, scalability, and flexibility make it a compelling option, especially for applications requiring high throughput and low latency.\n\nAs Ethereum transitions to Ethereum 2.0, the competition between these two platforms is expected to intensify, bringing further innovations and improvements to the blockchain space. For developers, businesses, and investors, both Avalanche and Ethereum offer unique advantages that can be leveraged to build the next generation of decentralized applications and services.\n\nCarefully consider the strengths and weaknesses of each platform. Thus you can make an informed decision on which one best suits your needs in the constantly changing domain of blockchain technology."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOb2tHYWE1VzE1RW9KZzdFakJjU2ZjWXpscHJNZ2h2MEUxU1R1LW5FUi1oMmpLYzBsTFhyb2JmRWxDb0RaXzhJZlEtbDZBLWJLbHU5ZzZfSFFhRGFZZWgxczhsVk1MUWhwczd4UDFzY1VYY2pOa0ZhOEtJUjFSblZNdXRhdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "ChangeNOW Lists ZKsync's $ZK Token: Boosting Ethereum with Enhanced Scalability and Speed - Yahoo Finance",
        "content": "Kingstown, Saint Vincent and the Grenadines--(Newsfile Corp. - June 20, 2024) - ChangeNOW, a leading non-custodial cryptocurrency exchange platform, is thrilled to announce the listing of the highly anticipated $ZK token from ZKsync. Starting from June 19, users will be able to trade $ZK on the ChangeNOW exchange platform.\n\nFigure 1: ChangeNOW Lists ZKsync’s $ZK Token: Fast Transactions & Lower Fees for Ethereum Users\n\nAbout ZKsync and $ZK Token\n\nZKsync, developed by Matter Labs, is a pioneering Layer 2 scaling solution for Ethereum, leveraging zero-knowledge rollups to enhance transaction speed and reduce costs. Since its inception in 2019, ZKsync has been at the forefront of tackling Ethereum's scalability challenges, making it a popular choice for decentralized applications (dApps) and DeFi projects.\n\nThe $ZK token, which serves as the backbone of the ZKsync ecosystem, is designed to incentivize users, facilitate transactions, and secure the network. With features such as lower fees and faster transactions than the Ethereum network, $ZK aims to provide a seamless user experience on ZKsync-powered platforms.\n\nAirdrop Details\n\nThe $ZK token airdrop, set to launch on July 15, 2024, will distribute 17.5% of the total token supply, amounting to 21 billion tokens, to its users. The snapshot date to determine eligibility is June 30, 2024. Eligible participants include ETH holders, regular users of ZKsync, and those interacting with dApps built on ZKsync.\n\nListing of $ZK on ChangeNOW\n\nListing the $ZK token on ChangeNOW aligns with the commitment to offering users access to innovative and high-potential cryptocurrencies. ZKsync's technology and vision resonate with the mission to provide seamless and efficient trading experiences.\n\n\"We are excited to support ZKsync by listing the $ZK token on our platform,\" said Kate L, CMO of ChangeNOW. \"This listing reflects our dedication to bringing our users the best tokens in the market and supporting groundbreaking projects like ZKsync.\"\n\nTrading $ZK on ChangeNOW\n\nStarting June 19, users can exchange $ZK on ChangeNOW without the need for registration or limits, ensuring a fast and secure trading experience. Inviting all crypto enthusiasts to take advantage of this new listing and explore the benefits of $ZK.\n\nFor more information on the $ZK token listing, visit ChangeNOW's website.\n\nAbout ChangeNOW\n\nChangeNOW is a non-custodial cryptocurrency exchange platform offering fast, reliable, and user-friendly services for trading a wide range of cryptocurrencies. With a focus on security and customer satisfaction, ChangeNOW provides a seamless exchange experience without the need for registration or limits.\n\nStory continues\n\nStay connected for more updates and announcements.\n\nChangeNOW\n\nWebsite | Twitter | Telegram\n\nDisclaimer: Cryptocurrency trading involves substantial risk and may not be suitable for every investor. The value of cryptocurrencies can fluctuate widely, and there is a potential risk of loss. Always conduct thorough research and consult with a financial advisor before engaging in cryptocurrency trading.\n\nPR Contact:\n\nZEX PR WIRE\n\ninfo@zexprwire.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/213703"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBYWjlFeGU2YXRPMkMtczdZdWkyY0owOGRkaE9BMEtzQWRidDNia2ZMV0l2bVotVW9CZG1LTUx4NENSZjFiSHE3WndONk5NV2dNMUNLTUpDWlVpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Choosing Polygon over Ethereum to Build Efficient dApps - Appinventiv",
        "content": "Polygon aims to give people numerous choices when they create dApp on Polygon. Some developers keep security over speed while others compromise on security for lowered fees and speed – the technology is building multiple Ethereum-centric scaling solutions to address all these different features.\n\nEthereum has remained a pillar in the cryptocurrency space. Right from DeFi to smart contracts and even NFTs, Ethereum has remained one of the key innovations of Web3. However, inspite of the glaring success, the technology has struggled with massive network congestion, high network fees, and lowering transaction throughput – factors that have created a scope for newer crypto projects coming in to scale it. Polygon is one such project.\n\nOriginated in 2017, India-based software company Polygon Technology scales Ethereum without sacrificing on its decentralization benefits. With the number of dApps on Polygon having reached 53,000, businesses are using the technology’s low fees and fast speed to build Ethereum-powered dApps.\n\nIn this article, we are going to look into the different facets of Polygon and what makes the technology better than using Ethereum for dApps development.\n\nHow does the Polygon dApp builder work?\n\nPolygon is a Layer 2 scaling solution that enables developers to build dApps on Ethereum without getting stuck with Ethereum’s limitations.\n\nHow it does that is by developing a layer 2 solution using off-chain on-chain concepts and different governance models like Proof of Stake, which helps the network lower its energy footprint by 99.95% – one which Etherum has also reached after The Merge. In addition to using a PoS architecture where the network participants stake MATIC for validating the transactions, Polygon enables developers to use its open source SDK to launch their Polygon dApp at the back of multiple scaling techniques:\n\nZK-Rollups: The ethereum-based technology acquired a zero-knowledge (ZK) protocol developer, Mir, for USD 400 million. What this protocol does is it enables transaction authenticators to validate the encrypted data without actually accessing the information enabling them to generate the verification proof in under 170 milliseconds.\n\nOptimistic Rollups: It consists of bundling several off-chain transactions into massive batches before submitting them in Ethereum. This way, the fixed costs get spread across multiple transactions that reduce the end-user fees. In essence, this scaling technique assumes off-chain transactions validity without pushing out validity proofs for the on-chain transaction batches by following a fraud-proving methodology to identify transactions having discrepancies.\n\nPlasma Chains: This scaling technique builds a child-parent relationship in Ethereum’s main chain. For example, the plasma chains can deploy their own dApps on Polygon which comes in handy when the other sidechains get hacked or are down. Additionally, the plasma chains tend to deliver off-chain transactions at higher efficiency levels.\n\nAt the back of these scaling methods, while the answer to how much time does it take to build dApp on Polygon is same as that on Ethereum or other blockchain technology, the transaction speed and cost difference is unmatched.\n\nFeatures of Polygon for dApp development\n\nThe technology merges the capabilities of sovereign blockchains and Ethereum into an attractive feature set that helps developers build a decentralized app on Polygon that is highly efficient, scalable, and speedy.\n\nEthereum compatibility\n\nWhen you build dApp on Polygon you work on a platform with complete Ethereum compatibility to tech stack, languages, standards, and tools.\n\nHigh scalability\n\nThe technology is built on dedicated blockchains, a scalable consensus algorithm, and a customized Wasm execution environment.\n\nCompetitive network Greater security\n\nPolygon dApp development is built on a modular “security as a service” facility offered either by Ethereum or a pool or validators.\n\nInteroperability\n\nThe technology comes with a native support for the arbitrary messaging passing bridges for external systems and can easily connect with Ethereum main chain using the bridging SDKs polygon offers.\n\nGood user experience\n\nWhen you build dApp on Polygon it is very similar to one on Web2 purely at the back of a facility like instantaneous transaction finality.\n\nModularity\n\nPolygon comes with high extensibility, customization, upgradability, community collaboration, and a short time-to-market.\n\nThese features of Polygon for dApp development are designed to bring the technology at par with the adoption of Ethereum minus all the limitations of the latter. This makes it profitable for developers and enterprises alike to build a decentralized app on Polygon.\n\nAmidst these feature sets and the obvious benefits of Polygon for dApp development, is it time to let go of Ethereum? And on a technological level, what difference does Ethereum hold from Polygon dApp development?\n\nCreating dApps on Polygon vs Ethereum\n\nWhile The Merge moved Ethereum from proof-of-work to proof-of-stake, bringing down its 112 TWh of energy consumption down to 0.01 TWh, the technology is where Polygon already is.\n\nThe Merge however, didn’t change the high variable transaction cost that Ethereum comes with – a factor that Polygon addresses on a massive extent. In addition to this, the transaction processing speed has also remained unchanged, which in case of Polygon dApps development is only 65,000 transactions per second at the back of the Layer 2 scalability solution.\n\nLet us look into the differences to understand why it makes sense to build dApps on Polygon.\n\nFactors Ethereum Polygon Foundation 2013 2017 Scalability 10 TPS 7000 Market Cap 139.56 Billion 7.698 Billion Average transaction fees 0.4876 US$0.01 Programming language Solidity Solidity, Golang, Vyper Transaction Deterministic Finality Instant 5 minutes Total dApps 2970 53,000\n\nWhile Polygon’s popularity is on a fast rise, there are some issues that are still prevalent in the technology. For understanding Polygon to its entirety, it is critical to know the limitations it comes attached with. Let us give a brief look at them:\n\nEthereum Dependency: Ethereum lies at the center of Polygon’s ecosystem as its settlement layer. This has resulted in Polygon being completely dependent on Ethereum for its operations.\n\nEthereum lies at the center of Polygon’s ecosystem as its settlement layer. This has resulted in Polygon being completely dependent on Ethereum for its operations. Under Development: Presently, Polygon comes with Matic POS Chains and Matic Plasma as scaling solutions. Other scaling solutions such as Optimistic Rollups, zk Rollups, Sidechains, Validum Chains, and Enterprise Chains, etc. are still in their developmental stages with an unsurety around when they would be live.\n\nPresently, Polygon comes with Matic POS Chains and Matic Plasma as scaling solutions. Other scaling solutions such as Optimistic Rollups, zk Rollups, Sidechains, Validum Chains, and Enterprise Chains, etc. are still in their developmental stages with an unsurety around when they would be live. Matic Plasma Chains: Polygon plasma chains can only be used for a limited set of use cases. Comparatively, POS Chains are a lot more famous since they offer greater user experiences and flexibility when compared to Matic Plasma.\n\nPolygon plasma chains can only be used for a limited set of use cases. Comparatively, POS Chains are a lot more famous since they offer greater user experiences and flexibility when compared to Matic Plasma. Competition: There are a number of scaling solutions such as Solana, Cosmos, Polkadot, etc. which are gaining steady momentum. They are making use of Ethereum and other blockchains to offer better user experience. Amidst this, we might see other solutions coming up and taking Polygon’s market share.\n\nWith everything we have covered up until this point, one thing is clear – even though the technology has some limitations which need to be addressed, the benefits of Polygon for dApp development are unignorable. However, for an entrepreneur what is necessary is to know the use cases on which they can create dApp on Polygon.\n\nThe use cases to build dApp on Polygon\n\nThe biggest reason why dApp development service providers like Appinventiv choose Polygon is the fact that the end product is the same as what results from Ethereum app development but the customer experience is much greater. So while the businesses get the same Ethereum-powered app, their users get an innovative user experience, higher lowered transaction speed, and minimal transaction fees.\n\nPayments: Polygon platform is engineered to create dApps that speed up the payment process, powering almost real-time payment settlement via specialized API and SDK integration. This enables apps, users, and merchants to instantly perform transactions through multiple cryptocurrencies, usually through the ETH or ERC-20 tokens. This system is being rolled out in three distinct phases: 1. ERC-20 token payments 2. Token transfer in cross-chain 3. Fiat-based payment models.\n\nLending Platform: The next use case to consider when you build dApp on Polygon is creating a module that would enable lenders to analyze users credit ratings and building a smart contract that would automate the loan disbursement journey.\n\nGames: The Layer 2 sidechain scaling solution of Polygon makes blockchain-based gaming platform development efficient and fast. With Ethereum and Polygon working together, the platform will be able to address the lag issues that non-Polygon blockchain games face.\n\nOther Use Cases: There are a range of other use cases to consider when you build a decentralized app on Polygon such as enabling fast settlement times required for decentralized exchanges to provide faster and cheaper trading.\n\n[Also Read: How to monetize with your dApp?]\n\nAmidst these use cases, the Polygon ecosystem is fast expanding. Here’s a look into some of the top applications that are a part of the network\n\nAdditionally, most of the dApps require a method to sign transactions without submitting in the users’ private keys details. On the back of its scalability enhancements, the technology helps in enabling an open identity framework for the dApp, thus solving the privacy issue.\n\nThese use cases are only a surface-level explanation of why businesses should develop dApp on Polygon. There are a range of other applications that can be built on Polygon.\n\nUltimately, even though Polygon dApps are built upon Ethereum, there are some very critical differences between them, specifically in transaction speed and cost. Such costly gas fees and slow transactions can lead to poor user experience that would leave a negative impact on the platform’s adoption. On this note, it makes better business sense to select Polygon, thanks to its ability to back faster transactions and lowered gas fees.\n\nAt Appinventiv, it is our constant endeavor to think about our clients’ customers first and this is the reason why we make dApp on Polygon. Using the technology we have built a range of decentralized apps right from a crypto wallet app to a DeFi exchange all promising a positive customer experience.\n\nLooking to explore the technology for your next dApp project? Get in touch with our blockchain experts."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxObjVQY1hRLURPS0dGcnBYLW1XcjJfWHJlQkpXTnd0azVDZ0c4Zjg5ZjFldmlBY3dGVTZTRDFTY29qSV82LUNPSGFPVktFOEVIaHpNNEt5YTlSRk9WTUd6WHNqZmJfdm1IU1BKX3VfeHh6Rm1MdzdsRkdnc24yUXZOdkNmWXdTOE5icnhGb3JwOWI1aEp6bFJRZlVQZkzSAaIBQVVfeXFMUFBUXy1hdmtOc0tuQjd2ZkRkYXRMRE9zellHSzUzZHlsQ0hIRkFJeld6cmExZzlfSkVNOXh4OFQwam9YUTNRUWJrbkZJdmVkTzg0bWRrdkNGWGEzVFhISkdrbGZYeGV0WHo0ZzJzZjRWMXhycUZobUNKamVNUVp4TGpINzltcnhNOF9iRUpaZDdDSlFrUEdfQlQ5N3lhUEhqUG9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin Dominates With 86% Holders in Profit, Ethereum and Meme Coins Close Behind - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn the ever-evolving world of cryptocurrencies, profitability remains a critical measure of success for both individual investors and the market as a whole. According to recent data from IntoTheBlock, Bitcoin (BTC) continues to dominate the market, with an impressive 86% of its holders currently in profit. This positions BTC as a leading asset, maintaining a significant lead over other coins in terms of profitability.\n\nEthereum (ETH), the second-largest coin by market capitalization, also showcases a strong performance, with 83.19% of its holders in profit. Ethereum's smart contract capabilities and its pivotal role in the DeFi (decentralized finance) ecosystem have significantly contributed to its success. Moreover, the potential introduction of an Ethereum spot ETF could catalyze further price appreciation.\n\nThis chart highlights top cryptocurrency projects ranked by the percentage of holders in profit.👇\n\n\n\n🟢Bitcoin remains dominant, with over 86% of its holders in profit.\n\n🟡Ethereum is close behind, showing strong performance. The introduction of an #EthereumETF could be the push… pic.twitter.com/MOtJumk9uU — IntoTheBlock (@intotheblock) June 20, 2024\n\nTron and meme coins gain traction\n\nTron (TRX) follows closely with 82.07% of its holders in profit, demonstrating the project's growing influence in the blockchain space. Tron's focus on decentralized applications (dApps) and its high transaction throughput has made it a popular choice among developers and investors alike.\n\nAdvertisement\n\nInterestingly, meme coins are also making a significant impact on the profitability rankings. Pepe (PEPE) leads the meme coin pack with 80.57% of its holders in profit, followed by Floki (FLOKI) with 76.85%. Dogecoin (DOGE) , the original meme coin, boasts a 74.99% profitability rate. These figures indicate that meme coins, often considered speculative investments, have generated substantial returns for their holders.\n\nEmerging projects and their profitability\n\nThe data also highlights the performance of emerging projects like Ondo (ONDO) and JasmyCoin (JASMY), with 75.61% and 72.18% of their holders in profit, respectively. Ondo, focusing on DeFi and structured products, and JasmyCoin, targeting data democratization and IoT (Internet of Things), are gaining traction and delivering notable returns for their investors."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQeWZDakhLZXJJTU1WUnJrSTNaTnNmZDU3aXB0bGpsVmR5QXBqWHI4cDI1Y1Bjclp4dmMtVDgtRXVFXzZxcDFRWDI4dnlqaERPRTRhQTlMMnY0T2lFakxKVDhFNlVZMlBXOV9xd3VLZ3ppVDgwMlFPVE1ub0tzdnBtbzFkbUJZSUlPLUV5cHRrczBWS0pwb1F2NHRyT1hWWHRYS20xUVJvblI4Z2pjUDhzOXMyRUTSAboBQVVfeXFMT0UzNk02Rl9pVWozZVdPRXNtb3k1b19WaDhVdEwxclhGWHFmN3NmUEVXczVlMlFKYkw1eUpaVzJGVU5jUUkycmN5STNnSDZVazAwSFJBTXJJR2lNSmNRZFRvRlBCTkVkTXV1RmFndGZ5bThtNTdMRWI2YTVHaVBzOUpCRGFod3lfVFp5WlBZT0FRZEFhNFB0Sm9idjcyWDE2ZjloaGhIR0FUeS1VdDhDSC0zcUdEVU5FZkxR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Start Gaining Some Strength, Is XRP Finally in Uptrend? Shiba Inu (SHIB) May Still Hit $0.00002: Here's How - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum is finally regaining some of its lost position. The second-biggest cryptocurrency on the market has already tested the $3,600 threshold. While the 26 EMA break did not happen, the fact that Ethereum tested that threshold may become a foundation for a bullish reversal in the foreseeable future.\n\nEthereum needs to rise above critical support levels in the near future. In particular, the $3,400 and $3,352 support levels are crucial. Ethereum could indicate strength and the possibility of further upward momentum if it can stay above these supports.\n\nTraders are keeping a careful eye on these levels for any indications of persistently bullish activity. The most likely reason behind the reversal is the exhaustion of bulls.\n\nInvestors should monitor the $3,600 resistance level, as a break above it may trigger a fresh upswing in price. Overall Ethereum's long-term potential — fueled by growing adoption thanks to the ETF and technological advancements — remains intact even though short-term fluctuations are to be expected.\n\nAdvertisement\n\nXRP's surprising strength\n\nXRP faces a 26 EMA resistance level after the bounce from $0.46, which is a strong signal for the asset. Despite losing the $0.5 support level, the short-term outlook is surprisingly positive for XRP. Key resistance levels to watch include $0.52 and $0.54, where a break above these could indicate further upward movement.\n\nA sustained price above $0.46 is critical for XRP in the near term. With its solid support, this level might serve as the basis for a resurgence. As long as XRP can overcome the immediate resistance at $0.52, traders are hopeful about a possible rebound.\n\nStill, there is cause for concern regarding the asset's long-term performance. The future of XRP is clouded by enduring regulatory challenges, most notably the ongoing lawsuit with the SEC. Since bad news can cause prices to drop sharply, market sentiment is also an important consideration.\n\nThe outcome of these legal challenges and public perception of the cryptocurrency market will have a significant impact on XRP's long-term prospects. Even though the short-term outlook is promising and could result in gains if resistance levels are overcome, investors should exercise caution. XRP has a number of long-term issues that could affect how well it performs in the upcoming months.\n\nShiba Inu is plummeting\n\nShiba Inu's drop below $0.00002 was dramatic and clearly should be treated as a signal of a potentially upcoming price drop. However, there is an important factor to consider: the short-term price drop is not set in stone, so bulls may still have enough reserves to buy back.\n\nSpecifically, $0.000019, $0.000022 and $0.000023 are three important price levels to keep an eye on. Each of these levels represents potential resistance or support areas that could determine Shiba Inu's next move.\n\nAt these prices a significant buyback might stop the current downward trend but if it does not hold, losses could continue. Short-term maintenance above $0.000019 is critical. A breakdown below this level could result in additional selling pressure because it has served as a significant level of support. On the other hand, a recovery of $0.000022 and $0.000023 would suggest a return of bullish momentum and might draw additional buyers into the market.\n\nThe popularity of Shiba Inu is fueled by its active social media presence and thriving community frequently causing their prices to fluctuate sharply. Sentiment can shift quickly, which can have a major impact on price, so traders need to be prepared for that.\n\nFurthermore, Shiba Inu's performance may be impacted by changes in the larger cryptocurrency market. Shiba Inu's long-term prospects hinge on its capacity to sustain interest and usage among the cryptocurrency community. Long-term growth may be possible for the project if it keeps coming up with new ideas and draws in users."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNZERkM05HbVV6V1J1S1IycF9qU0hqXzU0REFwTUFQQjZiQjB1UWVuTS1xUzNOa1pCYm9qNHptX2lNZkhTVnphLVdCZ1l4NnhNa2oxNmg1OGM3X21RaFZycHc4VVl2bUNRcGlaQ1I3Z3JBZ1dvZGhzdlBRNWdHMDBLM01YM0MzRUpLd0HSAY8BQVVfeXFMUHlCTkJWd0UyV3lfRjN6NnZHell5RS04RzVkVmlTMW43T1RlYnFhM3I3YUZmMFBBUjZOV1pvZHdkZW05bThBdzBjeTZPTzJVY3NVN1drT2hySXJweFVmQmFZb29QYkJUNUQzZHBMMnVUUGZsVjhpS2FIamVqTHo0YUJLd1BqVXlNSklaSG5WVlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 15:45:09 GMT",
        "title": "Max Keiser Issues Warning to Argentina's President Against Ethereum - U.Today",
        "content": "Argentinian President Javier Milei has expressed his support for the free competition of currencies, including Bitcoin. This announcement has been well received by many in the cryptocurrency community. However, Max Keiser, a well-known Bitcoin advocate and advisor to the president of El Salvador, has advised Milei to be cautious about including other cryptocurrencies, such as Ethereum.\n\nAdvertisement\n\nKeiser has described ETH as a scam, warning that its inclusion could slow Argentina's progress in the digital currency sector. He suggests that while Milei's endorsement of BTC is a positive step, the president should reconsider his stance on supporting multiple cryptocurrencies.\n\nAccording to Keiser, many Bitcoin enthusiasts initially supported various digital currencies before eventually focusing solely on BTC.\n\nAdvertisement\n\nKeiser, Bitcoin, Argentina\n\nThis is not the first time Keiser has criticized Milei's crypto policy. He previously raised concerns about Milei's decision to mandate the registration of all Bitcoin and crypto platforms in Argentina, arguing that this approach could have negative repercussions due to what he perceives as a lack of deep understanding of Bitcoin's unique characteristics.\n\nDespite these criticisms, President Milei remains committed to his vision of a free market where individuals and businesses can choose their preferred currency. He believes that allowing the use of different units, such as Bitcoin and Ethereum, will spur innovation and economic growth.\n\nEarlier this year, Argentina took an important step by removing taxes on Bitcoin and other cryptocurrencies, signaling a shift toward a more favorable regulatory environment for digital assets."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNazlDYlBKMkhSSmE5TGNXWFZWUzRHS3A3M0NLeUJYcElTVzcwd0ZXb0EydDdvTUxJQm5Uam5FS1VkVkxEdFYwSnNKNU1WMDg1OHRCdWZhalBQVC0tUndYQXVZM0hyMTZSbGZ2TDFNdGdFd05zSk5EUmlxY3duMWtnNmd2dW1DS3pBQ0ZLeTZvajZsUjFLLVdKcnlyOGV5ZjVScnZQWTQxblhPMjRRcVdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Pro-Ripple Lawyers Say Ethereum Still Has Regulatory Uncertainty Issues - The Crypto Basic",
        "content": "Ripple CLO Stuart Alderoty and pro-XRP lawyer Bill Morgan still believe the SEC’s decision to end an investigation into Ethereum 2.0 does not absolve ETH of regulatory uncertainty.\n\nBoth legal experts expressed this view shortly after Ethereum developer Consensys Inc. revealed that the SEC does not recommend an enforcement action based on its investigations into certain sales of ETH.\n\nRipple CLO Highlights Regulatory Uncertainty Surrounding Ethereum\n\nReacting, the Ripple CLO congratulated Consensys on the win but raised concerns about the uncertainty regarding ETH’s regulatory status.\n\n- Advertisement -\n\nHe quizzed whether the conclusion of the Ethereum 2.0 investigation indicates the SEC does not think Consensys offered ETH as a security. Additionally, he suggested that the SEC might still view ETH as a security.\n\nFurthermore, Alderoty questioned SEC chair Gary Gensler’s potential response regarding ETH’s regulatory status. Lastly, the Ripple CLO noted that the regulatory status of Metamask’s staking and swap services could be in question due to the SEC’s refusal to address the matter in its recent response.\n\nHe expressed frustration with the lack of clear regulatory guidance for the U.S. crypto industry, which could hinder innovation in the country.\n\nA big win for Consensys, though questions remain. Does this mean the SEC thinks Consensys’ offers and sales of ETH are not securities transactions and/or that ETH itself is not a security? What will Gensler say if now asked? What is the status of MetaMask and staking? This is… — Stuart Alderoty (@s_alderoty) June 19, 2024\n\nPro-Ripple Lawyer Reacts\n\nPro-XRP lawyer Bill Morgan echoed a similar sentiment, suggesting that the SEC’s decision not to pursue enforcement action following its Ethereum 2.0 investigation fails to clarify the regulatory status of the second-biggest crypto by market cap.\n\n- Advertisement -\n\nHe contrasted the regulatory ambiguity surrounding ETH with the legal clarity XRP received from a federal judge last year, raising a rhetorical question about which situation is preferable.\n\nCome on people. Would you prefer a letter like this sent to one company, or a finding from a judge that a token itself is not a security. Gensler will continue not to answer when asked whether Ethereum is a security. He can’t do that with XRP. pic.twitter.com/kPbeirslFE — bill morgan (@Belisarius2020) June 19, 2024\n\nFurthermore, the lawyer speculated that Gensler would continue to refrain from answering whether ETH is a security but cannot do so with XRP. This is because U.S. District Judge Analisa Torres held that XRP in itself is not a security.\n\nFight Continues\n\nThough the SEC has ended investigations into Ethereum 2.0, Consensys is still embroiled in a lawsuit against the securities regulator. The Ethereum developer filed the suit in April, requesting a Texas court to declare the staking and swap services offered on Metamask as non-securities.\n\nSince the SEC did not comment on the status of Metamask’s staking and swap services, Consensys stated that its legal fight with the regulator would continue."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNV2VTRlZLaEJlOTliMjVpa2tUWDBNbmpUbE1CX0NlLVZRdU5xdTRUMjBqczM4OHUxaVNSNXVaYzN4TW5ncG0tUzFSUHVWWXZyRTZXT2hucGxKRGNvSmNlb1I2b3NvOUhNVzRwQl80ZzJZMFk2NzRKQkVwNGNUaXNQR1N5LTNkSUk4X0xLMXZvSkNVM1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered to Launch Spot Bitcoin & Ethereum Trading Desk - Watcher Guru",
        "content": "UK-based multinational bank Standard Chartered is officially launching a Spot Bitcoin and Ethereum trading desk. Bloomberg reports that the $820 billion bank’s STAN will be used for buying and selling both BTC and ETH directly. The institution becomes one of the first global banks to offer a trading service for the two leading cryptocurrencies.\n\nThe report notes that that desk will begin trading rather soon, according to sources. Although other banks have offered crypto derivatives trading, the decision places Standard Chartered in a league of its own regarding activity in the digital asset space.\n\nJUST IN: $820 billion Standard Chartered Bank to establish a spot trading desk for buying and selling #Bitcoin and Ethereum. June 21, 2024\n\nAlso Read: Bitcoin To Hit $100K Before US Elections: Standard Chartered\n\nStandard Chartered Announces BTC and ETH Trading Desk\n\nSource: Blockchain Reporter\n\nIn 2024, the United States approved two crypto-based ETFs, in what is a revolutionary move for the asset class. The decision heavily impacted Bitcoin, with the leading cryptocurrency reaching a landmark price of $73,000 in March of this year.\n\nNow, global institution Standard Chartered Bank is set to launch a Spot Bitcoin and Ethereum trading desk. In an emailed statement, the company noted its work to help support the growing demand that the firm has seen from clients.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum,” Standard Chartered said. The decision isn’t their first foray into the sector. They have backed crypto custodians Zodia Cusotry and its exchange, Zodia Markets.\n\nSource: CNBC\n\nAlso Read: Standard Chartered: Solana & XRP ETFs Could Launch in 2025\n\nThe bank has also launched a tokenization platform, Libeara in November of this year. The project tokenized government bond funds that use the Singaporean dollar, and showcase another venture into the Web3 sector for the bank.\n\nThe decision is a byproduct of the aforementioned demand from institutional clients. Although no launch date is announced, sources say that the “crypto desk is close to starting operations.” Additionally, sources confirm It will run out of the firm’s London office."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONm44bm1xWHEwS0VldUxlSTJ0Tl9oTlhkbWJudGhpWGl0ODlhUjk0Nkk3bXNsS2QwNldkVE95MjMydjVwVFBlek9ic3JiRldkM0ZCZGlRQ0xRdUhHMDRDbDQ4T2hzdXVjdjJlaHRoTVppQkNJWW45ZTAzLVZiSWdqd1ZUYk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum & Solana Set Support - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tSUQ0cEUxY0ZkZy1IY2dOb3kzUU9zYkVXSWFkRXNmd3JrMV84VHp4WTcwakt4RWFKYXo3cnduLUFYYncwMGN0Y0k2Y1dnNWZaeWhOSXM4Y3lKaGhhV0dFV0ItRl9qX1JZRTNrVklRVVRpc29CVm15UFpSbDFSWnfSAYcBQVVfeXFMUEFpWnNSTHc1S3BHRGNpY0NfSVNiMmVtWTBrWHlpOEY0dFZNUTlmUEs2OG5lblh4RjMyYUd0YVVGUVNtRDV0aDFaQzVTT1MxR29XOUlWeWg0dnozbnNQWnczNjVsYlBOb29ZbWl3bnF6U0RQbGhNeWMzZ25mdXJDODlvMHFsUURZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered Is Creating a Bitcoin and Ethereum Trading Desk in London - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational bank Standard Chartered is creating a Bitcoin and Ethereum trading desk in London, according to a report from Bloomberg.\n\nThis will make it one of the first global banks to enter spot crypto trading, in the wake of spot Bitcoin and Ethereum ETFs being approved in the U.S.. Standard Chartered’s new crypto desk will begin trading soon, two people told the outlet, and will be part of the Forex trading unit.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” Standard Chartered told Decrypt, echoing the statement it made to Bloomberg.\n\nBut Standard Chartered declined to respond to Decrypt’s request for further comment.\n\nAD\n\nAD\n\nThe bank part-owns institutional crypto custodian Zodia Custody and has backed institutional digital asset trading firm Zodia Markets. Now setting up its own spot crypto trading desk shows clear intention to move deeper into the world of digital assets, after dipping its toes through investment.\n\nOther banks have traded crypto before, but due to regulation they have had to trade in derivatives rather than the actual asset itself. For example, Goldman Sachs began trading Bitcoin futures in 2020, then opened its Bitcoin derivative trading desk in 2021.\n\nThe Basel Committee, an organization that sets global standards for banks, recommended in a 2022 report that banks should apply a 1,250% risk weighting when trading crypto assets. This term refers to the amount of capital a bank should have in reserve to counter the risk of the investment. Industry experts have noted that this incredibly high weighting makes it hard for banks to turn a profit on crypto trading.\n\nStandard Chartered has been bullish on crypto recently. In May, it predicted Bitcoin and Ethereum to hit all-time highs after spot Ethereum ETFs were approved in the U.S.. Soon, the bank predicted that Solana and XRP ETFs would be next to be approved in the States.\n\nAD\n\nAD\n\n“Albeit this is likely a 2025 story not a 2024 one,” Geoffrey Kendrick, Standard Chartered’s head of crypto research and emerging market foreign currencies, said.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOdnB4UXFTcDJ4QUo1M2dTMUVaTkptQW9UczFoUHo3TmFEWHg1LTJvMy1rNjZ3clBvY1BHbGp0bjhmRnRLd1VEWnZTSUxHaHpVcC1sV290MXF0ck1IT3FVWXZhNFdKU0FHVUJ4WGJCVEJRX25CdHB3b1RmbmU2WjJ1cGQwYmU3emlIeHZ6OEE5R0UwYVXSAZgBQVVfeXFMTjBZak1RUXBzUnRKQUp1YXNwSXY0eWdMZDQ4RmFMUFItdm9UbVZmbTBBX05BcUhHT0kxUFF4c1lUcVlGcmpOelU0dmtYVHkxbGU5U3h3RGE2Qm02a0pSVHFwU29yZGgwRjlWclFQUGp6M1A4cUZ2SFFTdzRZd0pQNTF2NTllYUNUR1VmNlFQVWkxOFdEMWJRV0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price analysis: ETH targets $3,700 resistance after recovery - AMBCrypto News",
        "content": "Ethereum’s price surged by 6% from its weekly low of $3,381.\n\nMetrics indicate a potential price reversal.\n\nIn an exceptional turnaround, the king of altcoins has witnessed a significant price recovery from its weekly low of $3,381.\n\nAccording to the data from the top platforms, Ethereum’s [ETH] upswing can be attributed to whale activities.\n\nEthereum price was up by 14% in the last 30 days. Ethereum was trading at an average price of $3,527, at press time. Its 24 hour trading volume stood at around $19.5 billion, with a market cap of $433 billion.\n\nEthereum has surged by 6% since retesting a 50-day exponential moving average resistance level. The next price target remains at around the $3700 resistance level if the bulls accumulate more momentum.\n\nThe stochastic RSI indicates an oversold zone that could signal a potential price reversal to the bullish side.\n\nWhale transactions fuel price momentum\n\nAccording to santiment’s data, the number of whale activities involving ethereum has spiked in recent days. The number of whale transactions soared to over 1400 on 18th June.\n\nThis heightened rise in the whale transaction coincides with Ethereum’s recent price surges. This suggests that investors were actively accumulating ETH during the recent dip.\n\nThe whales’ long positions may cause ETH to surge if the bullish pressure continues.\n\nLiquidation heats up but Ethereum remains strong\n\nCoinglass’s liquidation heatmap data further indicates Ethereum’s resilience.\n\nDespite the liquidations across the cryptocurrency market, ETH whales managed to hold a significant $43.57 million worth of long positions in the last 24 hours.\n\nThis whale’s commitments further indicate confidence among Ethereum’s long term prospects.\n\nThe long-short ratio data reveal that there was a stagnation in the long positions-indicated by a flattened curve. However, there has been a spike in the data, indicating that the long positions are currently in control of the market.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nWhat next for ETH?\n\nWith increased whale activity and investor resilience, Ethereum’s recent bullish momentum is likely to be maintained.\n\nThe market sentiments indicate that long investors outweigh short position traders, which could signal a price surge in the near future. However, the bearish rally could continue."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOQkFqb1JWZmF3Z1NPdWNTLURrbUFJeFFJTE1kQ2NmdUtmM2ZjTGY1Uk5jNnpPR1lQUDBTdHJacThtN25nQmN4TVR5RFl2ZHRzeFNkQWgxc0J2VUE4eTg0TGJQYVpBMlFwTTdZeHZFUzVlQmsxNEc5WWNtUlpyU3B5N1ZOUV9hcGUxcmNJdmd2XzgxNkxCWUkzMkNhS3VEaTNic3VLendJY3Jxd9IBrwFBVV95cUxNYm1ROURGT2xsV2dpTU15VS1oM0NoV29mWHVxTWFzdUR3S2lIQ3A0WXpndVRad1BoMjVFaFBnMXduNnVtVHJHSmhnUHc1RVU1VlQtakpwLXRORkRQamVqdzgtSzl3YjMzaDY1YVFTU0RUc29DNUFPWGFrSmVfaFpOWHZvbWNyNWtidC1QcTlvc1Z2R0RFZWFtTFJLWVdiRC0ybFBNMTlWSTg4dHRsRjNv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "S&P Global: Ethereum Restaking Can Give Birth to ‘Internet Bond’ Market, Will SEC Approve? - CoinGape",
        "content": "S&P Global Ratings recently published a report stating that the Ethereum restaking services offering an additional yield are gaining prominence and could lead to a solid “internet bond” market in the long term.\n\nSimilar to the bond market, holders of Ethereum earn additional yield by either pledging or staking their ETH coins to help with transaction verification on the Ethereum blockchain. Similar to lending out securities in fixed-income markets, ETH restaking reinvest the staking rewards and provide compounding returns to investors. Ethereum restaking platforms like EigenLayer have been much in the limelight recently. Amid this popularity, EigenLayer went live on the crypto exchange Coinbase recently.\n\nadvertisement\n\nThe Rise of Ethereum Restaking\n\nIn a report published on Wednesday, Andrew O’Neill, S&P Global’s digital assets analytical lead, highlighted the importance of restaking in order to enhance economic growth within the crypto market.\n\nO’Neill also stated that restaking allows Ethereum node operators to validate new services by using established tokens thereby eliminating the need for these services to create their own validator with their own, illiquid, and volatile tokens.\n\nAs of now, there are only a few active restaking services popular as “actively validated services”. The report by S&P Global also notes that the total value of ETH restaked in the EigenLayer has surpassed 5.3 million Ether, valued at a staggering $19 million. Earlier this week, EigenLayer opened the Phase 2 claims for the EIGEN airdrop.\n\nRisks Associated with Restaking\n\nThe risks associated with restaking are primarily operational and specific to each actively validated service (AVS), though financial risks could emerge due to market speculation.\n\n“We do not currently foresee significant ecosystem-level financial risk as staking and restaking are generally non-custodial and there is no rehypothecation of the collateral,” O’Neill writes. “The impact of restaking on system-level leverage must be monitored, particularly through borrowing and leverage metrics on decentralized finance (DeFi) lending protocols”.\n\nEver since the EigenLayer launch in April, the protocol has gained strong traction within no time. This could inspire more players in the market to bring restaking services.\n\nHowever, the bigger question is whether the US SEc would allow more restaking protocols in the market. Another doubt is whether the SEC will allow restaking protocols to mature into “internet bond” market without proper regulations.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOQ2FNcmJPLThnNU5jMlZjUGhsNld4LWZVOXhOVTVmNlBBTXgxeWxINmVqUldCdmlDQURTdzN6cmU0VGpURWc3V1BxakFoWkozV3J4U3NnTTlGNzhQb1U5dUpvMzJ6M1dOQVQzek94Wjc2RWtLS3hFZkRkdEIwMzZvUjZ5TFEwZHlROE5yMjB2aGfSAZYBQVVfeXFMTk9NOTVGV2twcFFHZTMxUWg0Vm1ObWRlSDI5aTBVbWpKWE1HeTZHeF9RUlFFODFKM2lINnB3VE5WMHR2cWpwUWNTMUd3bmxQYXJjbHlLSlQ5NEtRYXFRZ2lGczZtbDhQNEJyZS12VG1jQkYxd09nb1BONFgwZ01qV3JYX2p5dGdpQTNWT3R0THBnWl8tcEVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum vs. Bitcoin: How a key metric points to ETH as the winner - AMBCrypto News",
        "content": "Ethereum’s price increased by nearly 3% in the last seven days.\n\nSelling pressure on ETH continued to remain high.\n\nWhile most cryptos’ prices were declining, Ethereum [ETH] decoupled from the market as it went the other way. In fact, the king of altcoins was outshining Bitcoin [BTC] on a key front, which hinted at a bull rally in the coming days.\n\nEthereum beats Bitcoin\n\nCoinMarketCap’s data revealed that ETH bulls stepped up their game over the last seven days as the token’s price increased. The token’s daily chart also remained green as it moved up marginally.\n\nAt the time of writing, ETH was trading at $3,575.26 with a market capitalization of over $437 billion.\n\nWhile that happened, Ki Young Ju, a popular crypto analyst, recently posted a tweet pointing out an interesting development.\n\nAs per the tweet, ETH’s MVRV ratio was rising, suggesting that ETH’s market was heating up relative to its on-chain fundamentals.\n\nIn fact, ETH managed to outperform Bitcoin in terms of MVRV ratio growth rate. The tweet also mentioned that, given the current ETF situation, this might be an ETH-only season.\n\nIt was also interesting to note that historically, when ETH surges, other alts tend to follow.\n\nIs ETH ready for a bull rally?\n\nSince the aforementioned dataset suggested that the chances of ETH showcasing a bullish performance were high, AMBCrypto planned to check its on-chain metrics.\n\nAs per our analysis of CryptoQuant’s data, ETH’s net deposit on exchanges was high compared to the last seven days’ average, meaning that selling pressure was high.\n\nAdditionally, its Coinbase premium was red, indicating that selling sentiment was dominant among US investors. Nonetheless, the Korea premium looked optimistic as it indicated that Korean investors were willing to buy ETH.\n\nA few of the technical indicators also looked bullish on the king of altcoins. For instance, the MACD displayed the possibility of a bullish crossover.\n\nThe Relative Strength Index (RSI) registered an uptick and was resting at the neutral mark at press time.\n\nAdditionally, the Chaikin Money Flow (CMF) also moved northward, hinting at a price increase in the coming days.\n\nAMBCrypto then checked Hyblock Capital’s data to look for possible targets for this week if ETH remains bullish.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nWe found that ETH might first touch $3,660, as liquidation would rise sharply at that level. A rise in liquidation often results in short-term price corrections.\n\nA successful breakout above that level might allow ETH to reach $3.8k. However, if the bears takeover, then investors might witness ETH drop to $3.28k this week.\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOX0U4NDFVV09aWEdZUVVyQ0F2RXEtX0dFUFRSd0VSa3hxWDJoU3pvRl9oOTNkd294cllhR0ltNHZPZ2NQSUN5YTI1OVhiRHQ2VHRDdFBrbUpwQXFGalVxZ3ItTTExZmk3amtLTHZ3VFVCb041UU4wYkM1ZUJWemJDWDJma0RhTkVDOVkxbNIBkgFBVV95cUxPY20wVXJWZTFRT2dFbHZobFhZWTB3MjVZTTVfOEUtNUZGNUdjb1BDSldHQ3U0eFhicEJoRTFIbTJmcHV1YUY5RkM0LWxzRGZJYWhZRks0MEVYVHdrVV9GSU5xbF81aENLdGo1ZlVobDBGNmxYXzM5ZllhbnpTcURXX09TUUxISU56eDVMdXNPNHB6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF: Bitwise files amended S-1, aims for 4 July launch - AMBCrypto News",
        "content": "ETH ETF launch is now closer than ever as issuers begin submitting amended S-1s.\n\nWhales have been positioning for launch, suggesting ETFs will be a key market catalyst in summer.\n\nMarket analysts have been waiting for amended S-1s (registration statements) from potential spot Ethereum [ETH] ETF issuers, which are the last step before the SEC approves them for launch.\n\nDigital asset manager and potential issuer, Bitwise, began this last step on 18th June. It submitted its amended S-1 to the agency, but the fee charges haven’t been included yet.\n\nReacting to the update, Bloomberg ETF analyst James Seyffart noted,\n\n‘I believe this filing from @BitwiseInvest is the first of the amended #Ethereum ETF S-1’s. This will contain the changes from the SEC’s first round of comments.’\n\nThe analyst added that Pantera Capital, a crypto-focused VC firm, was planning to put $100 million into Bitwise’s ETH ETF product (ETHW)\n\n‘Looks like Panterra will be putting up to $100 million into @BitwiseInvest’s Ethereum ETF — $ETHW’\n\nThe VC reportedly pumped $200 million into Bitwise’s spot US BTC ETF product in January.\n\nOther issuers are expected to submit their amended S-1s in the coming days. However, Seyffart noted that the amends ‘might not need additional but might require tweaks’.\n\n4th July in focus for ETH ETF approvals\n\nAlong with his colleague, Eric Balchunas, the analysts maintained that the products could be approved and launched by 4th July.\n\nThe SEC chair, Garry Gensler, recently confirmed that the approvals could be likely by summer. Overall, most market observers expected an approval by early July.\n\nThat said, there have been divergent views on institutional demand for ETH ETF products. Some projected low demand since the products won’t have a ‘staking’ feature.\n\nHowever, Ophelia Snyder, co-founder of digital asset manager 21Shares, maintained that the lack of staking will not affect institutional demand.\n\nIn fact, the executive added that staking could affect liquidity, especially when the lock-up period is extended.\n\nIn the meantime, ETH was up +4% in the past 24 hours and traded at $3.54K. Besides, ETH whales were on the move as they eyed the potential launch of the ETH ETF in early July."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPOG5uTjYxXzBxb0c2WTI5SXRHb0NtbGRXZkdELTNZanViTXlyaFVab01SdlBGVlRNR2QxRlIyVUZOMjFUb3d0OVlyLVY4ZFR3R1BRUnMwTkRxMDY2a29vMUc2REMxOEIxNmZEYm95NnNWT2RHU2RrdFJ3eDAycnlYZkJB0gGHAUFVX3lxTFAwRm5TX0NrY3c3Q3VadUxnd01ibzBXd1VIdlRWVFVVU1JHOUNydDdQSDYwSVNGWm5saDk4VW9TQm5sa19IZHExZWhqbFdKLTRwaC1GbndoM0Z3NUUyOVpVWGk5Q2lfeURHZEVkT241TS1VaUxKeW0wempjVXZNcVV2Q2RBUU1qbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Is $4k close as SEC changes its stance on ETH? - AMBCrypto News",
        "content": "Ethereum popularity increased materially according to recent data.\n\nStaking participation was on the rise as prices remained stable.\n\nEthereum’s [ETH] price has remained stagnant over the past few days. Despite this traders were showing interest in the altcoin.\n\nEthereum’s popularity grows\n\nAccording to Santiment’s data, the popularity of ETH had soared significantly over the last few days.\n\nThe current discussions surrounding Ethereum ETFs, SEC investigations, regulatory developments, and Consensys’ advocacy efforts for Ethereum’s status are likely contributing to this increased attention.\n\nThere were both bearish and bullish perspectives that can be had around the popularity of the rising interest in Ethereum.\n\nSantiment’s data suggested that the bearish concerns stemmed from the potential classification of Ethereum as a commodity by the SEC.\n\nDespite SEC dropping the investigation, the fact that it is willing to go after the coin can cause problems for the network. It could also pose a hurdle for the approval of other Ethereum ETFs, a key driver of current interest.\n\nAdditionally, the ongoing regulatory battle between Ripple and the SEC casted a shadow, as similar actions against ETH could dampen market sentiment.\n\nThe uncertainty surrounding Ethereum’s regulatory status and its potential limitations act as headwinds for the project.\n\nFrom the bullish perspective, there were a lot of points in favor of Ethereum. For instance, the SEC dropping its investigation, effectively clearing ETH sales of being securities, has been a major boost.\n\nThis news has led to a surge in ETH-related altcoins and a more stable market environment.\n\nFurthermore, the development of cross-chain bridges connecting Ethereum to other blockchains showcased continued growth and adoption within the Ethereum ecosystem.\n\nState of staking\n\nIn terms of staking, it was observed that the staking participation rate increased significantly for ETH. However, staking yield volatility had surged materially.\n\nWhile a higher participation rate is generally good, high volatility in yields can be a deterrent for some stakers seeking predictable returns.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThis volatility could be due to factors like fluctuations in network fees (MEV) or changes in the total amount of staked ETH.\n\nAt press time, ETH was trading at $3,587.52. Over the last 24 hours, the price of ETH grew by 0.67%. However, the volume at which ETH was trading at had fallen by 27% during the same period."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOaVNLbHl2aG9DRlM2T25Fd1dFLWNsalA4NEZfaGR4aUhKOEFVYm12WVgzNVNpMXkzUW9XZExfVlRKSzA1a2I2R1NtU2ZGVWY3TDY3N2hRYVdyREttNllZLW1TbkxoZ3pZaVZuVElWVTF6aUVvR3h5bXNCTGhVU0FXTWlDZ2Mwd3l5M1g4ajR0dmJmdGtSZVFnQ0IwSlFSZ3BUc2fSAacBQVVfeXFMUDllck9VMWFUcm1keTRkRDRJU3pWRExfSDFuSGN3UWtTRzRZN1NuWDFRaFdlYXl3eHVWVjA1TjA2RHMyZDh0ZElJRDl6M21pcEFkbDdlUGxXbnJyd2FLZ2I4ZDh6akdhQ2huVjU1ZWFmWWtSOFlsVk82QkFDSzBWTUdrQmVkSC1CSWZqSHNpVUg4RlZDLVhtSGw3cHhra3Y0ZGJKbmFDQU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Bitwise CEO Hints At Major Announcement, Spot Ether ETF Launch Likely By July 4 - CoinGape",
        "content": "Bitwise CEO Hunter Horsley on Thursday said there will be a major announcement by Bitwise Invest tomorrow. Bitwise recently filed an amended spot Ethereum ETF S-1 to disclose a $2.5 million seed investment and Pantera’s interest in putting $100 million in the Ether ETF.\n\nBitwise Likely Making An S-1 Filing For Spot Ethereum ETF\n\nHunter Horsley, chief executive officer of Bitwise Invest, took to X on June 20 and revealed a big announcement coming from the company. He said “Keep an eye on Bitwise Invest tomorrow. Something cool.”\n\nadvertisement\n\nWhile Horsley’s post didn’t mention enough details or points to another S-1 amendment to spot Ethereum ETF, experts believe it will be related to Ether ETF.\n\nNate Geraci, president of ETF Store, said a flurry of spot Ethereum ETF S-1 amendments are coming on Thursday and Friday. He believes there’s nothing left for the U.S. SEC to address or comment on as per details in the Bitwise S-1 recent filing.\n\nGeraci thinks spot Ethereum ETF will launch before July 4 as SEC Chair Gary Gensler hinted at the approval of Ether ETFs before the end of summer. The SEC has also closed its Ethereum investigation, clearing the way for a potential listing and trading of spot Ether ETFs on exchanges.\n\nHe expects Bitwise to reveal fees for its spot Ether ETF on Friday. The company charges a 0.20% management fee for Bitwise Bitcoin ETF (BITB).\n\nAlso wouldn’t be surprised to see another issuer or two file for combined spot btc & eth ETF over next week or so… — Nate Geraci (@NateGeraci) June 20, 2024\n\nAlso Read: Are Solana, Cardano, Polygon Commodities As US SEC Ends Ethereum Investigation?\n\nRise in Interest in Spot Ether ETFs\n\nConsensys disclosure about the SEC ended its investigation into Ethereum resulted in a broader crypto market recovery, with ETH price rebounding above $3,500. It indicates a massive interest in the spot Ethereum ETF and expected a similar interest from institutional investors.\n\nETH price jumped 1% in the past 24 hours, with the price currently trading at $3,586. The 24-hour low and high are $3,513 and $3,589, respectively. Furthermore, the trading volume has decreased by 28% in the last 24 hours, indicating a decline in interest among traders.\n\nHowever, ETH price can rise further amid S-1 filings by spot Ethereum ETFs. It could bring a potential rebound in the broader crypto market and most likely an altcoin season.\n\nAlso Read: VanEck Bitcoin ETF Debuts on Australian Stock Exchange ASX, Will It Get US-Like Response?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPcl9EUGxUTC1rLUdtRloydm1KZUZLTU9RMWdfUHRNSElRbk13S1BHbldkQWhrSWg1YzdUcFFDYkFLUUZBNWF1UURYQTJuLVpONDJXUVA3U2h2VDhhazBHdXJuUHZWOTlvUkFldDZwZFpnc1pwMEpMc2tod2NUZUZnMGpWTk84RFNJLXdFa2pNSjNNaVRhaHoxMU1B0gGfAUFVX3lxTE1heVlkS0ota0ljWjdWclFqRXlQYmVxbmoyQ1g1NzVXUmRBOXo2eXZ1OTVOa21ldGhQWHNVX3l1WFAybDExWFZmOVNSYVNXa1hSZmdERHA4VzBkYjBhVXN6V3pBeU1HVkFBMURLYW5UWVRDZUJLVGxYbGFCSi0xWDI3ak10b09XN2p1ODdrLTJUbGZISms2MHJERFp5UlFiMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Upcoming ETH ETF Trading Teases $5,000-Bound Rally - CoinGape",
        "content": "Ethereum Price Prediction: The Ether and crypto communities are eagerly looking forward to the start of spot ETF trading in the US. This follows insight from a renowned ETF analyst who projects the D-Day on July 2. In the meantime, ETH price holds firmly to support at $3,500. A breakout from this level could breach the $4,000 resistance which will ignite FOMO as investors back the uptrend toward $5,000.\n\nBitcoin too is starting to shape the next crypto landscape this week after reclaiming ground above $65,500. With the two largest cryptocurrencies modestly in the green, investors are beginning to appreciate the sell-off as a blessing in disguise. This means they can apply key dollar cost-averaging practices, buy the dips, and eventually increase potential gains in the second half of the year.\n\nFactors Likely To Drive The Next Altcoin Season\n\nThe crypto fear and greed index has fallen to 64—still showing greed among investors but significantly below last week’s figure of 74. This indicator by Alternative, monitors market sentiment with zero on the scale referring to extreme fear and 100 to extreme greed.\n\nadvertisement\n\nSince markets function as living entities, sentiment is driven by people. As euphoria increases, investors become greedy due to the FOMO. This propels prices higher but also introduces the risk of a drastic decline as some investors decide to take profits. It is rarely a good idea to buy when the crypto fear and greed index is near the extreme top.\n\nOn the other side of the fence, a drop in the metrics suggests greed is creeping in. Because sentiment is falling, many people choose to sell—some due to the fear of losing their capital or possibly to protect unrealized gains.\n\nIt is advisable to buy when the market is red and sell when it is green. With that in mind, investors might consider this to be a good time to buy into their favorite altcoins, ignoring the drop in the fear and greed index to 64.\n\nEthereum price has increased 1.3% in 24 hours to $3,585 on Thursday. The value growth, although minor, has reflected a 0.81% surge in the market cap to $438 billion. However, the second-largest digital asset faces a 30% slide in the trading volume to $14 billion—a factor likely to hamper potential growth in the upcoming sessions.\n\nNevertheless, investors seem to have set their sight on the approvable of the spot ETF. The Securities and Exchange Commission (SEC) approved the listing of spot Ethereum ETFs in May pending further approval for the operators of the products which will eventually give way to actual trading on stock exchanges.\n\nThe SEC also dropped investigations into Ethereum, further clearing doubts that Ether could be considered a security.\n\nETF analyst Eric Balchunas predicted earlier this week that Ethereum ETFs could start trading on July 2. This followed word that the SEC “sent issuers comments on S-1s today, and they’re pretty light, nothing major, asking for them back in a week.”\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nThe start of the actual trading of Ethereum ETFs could spark fresh interest in ETH and altcoins. Traditional investors would find it easier to buy ETH via exchanges, validating the crypto market.\n\nAnalysts at CoinGape expect this to be a moment of reckoning for altcoins like Solana, XRP, and Dogecoin which are believed to be the next in line for spot ETFs.\n\nThe move could be bullish for the entire crypto market, including Bitcoin, and possibly usher in the much-anticipated altcoin season.\n\nEthereum Price Prediction: ETH Stares At A 30% Breakout\n\nEthereum price is making key strides in its recovery following the correction to $3,400. The token currently sits above two exponential moving averages (EMAs), the 20-day and the 50-day.\n\nA daily close above $3,600 resistance would mean that bulls are getting back in the game for a breakout past $4,000. The presence of an inverse head and shoulders (H&S) pattern on the daily chart could reinforce the bullish grip when validated.\n\nThis is a bullish pattern validated when the price breaches the neckline resistance around $3,800 in Ethereum price prediction case. Traders would enter above this resistance eyeing a 30% move close to $5,000.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPOTRuTXMyanR0N2ttT2tCMHBBbmlEWDBvZFQyQUx5N1g1QWY3NURsQlpaR2RSSU1kVWpRYjVkRWhtNF9YOTRLelVDeElUbi12UDYzLU1kbHNjcWgxcFRJdjFNV2pxSFYyVmo0cURyMkFMQ1hOQUJuV0lnajVmSzR0NE4wN2xMSlF6X3hhM2FnVU7SAZgBQVVfeXFMT0phVk1YTzZRWWpLNEVWTFFHYUVrdXJ0VlZzbzlHZXFtUTdsbG9hdUk5VUhvSV9CRml3SFdfSlU0WnZfY0JBOVh6M0RUY1pxUHl4RkN2SlFBeWNqTFQ2N2VTSnpzc3RjU0RLUkVNS1JmamY3T3ZYOXVVejN3aEo0dlcwWjNqUFA2cmExdU03cmRxUkpCYWlXT1o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Consensys Predicts Ethereum ETF Approval Within Days - Crypto News Flash",
        "content": "Blockchain startup Consensys has predicted that spot Ethereum ETF S-1 registrations will soon be approved.\n\nAnalysts are projecting a an early July approval timeline for trading to commence.\n\nBlockchain software technology company, Consensys has predicted that the SEC could approve S-1 filings for spot Ethereum Exchange Traded Funds (ETFs) in a matter of days. Collin Brown, a renowned blockchain researcher commented that the prediction portends a bullish signal for Ethereum, the second-largest cryptocurrency.\n\n🚀 Ethereum ETF approval on the horizon! Consensys predicts SEC could give the green light within days. Bullish signal for $ETH! 🌐💼 #Ethereum #ETF Are your bags filled? 🚀🚀🚀 pic.twitter.com/aF91qMIXsv — Collin Brown (@CollinBrownXRP) June 21, 2024\n\nSentiments for Ethereum’s ETF Approval\n\nJimmy Ragosa, product manager at Consensys believes the wait for spot Ethereum ETFs trading in the U.S. might be nearing its end. Ragosa’s optimism stems from a recently amended S-1 document, submitted by Bitwise Asset Management to the Securities and Exchange Commission (SEC) on June 18.\n\nHe pointed out that compared to the previous version, Bitwise’s update omits details on the fee structure and initial investment. He added that the bulk of the SEC’s feedback centered around risk factors, legal and regulatory statements, contact information, and the distribution plan. Ragosa, therefore, projects an imminent approval from the SEC, based on the areas requiring revision.\n\nThis optimistic outlook aligns with recent comments from Bloomberg ETF analyst Eric Balchunas. He confirmed that the SEC’s feedback to prospective Ethereum ETF issuers earlier this month was “pretty light,” focusing on minor revisions.\n\nBalchunas even revised his initial prediction for the launch date, moving it up from July 4 to July 2 based on the expedited S-1 approval timeline. Last month, the SEC approved eight 19b-4 documents from exchanges requesting to list Ethereum ETFs, as previously reported by Crypto News Flash. With that hurdle cleared, the S-1 approval stands as the final regulatory step to Ethereum ETF trading in the US.\n\nMeanwhile, VanEck is another investment manager who believes approvals for spot Ethereum ETFs could happen in the coming weeks. As previously reported by Crypto News Flash, VanEck’s Matthew Sigel says the firm is accumulating Ethereum in anticipation of the launch.\n\nSEC Concludes Ethereum Sales on Consensys\n\nAdding to the positive sentiment surrounding Ethereum ETFs is the recent conclusion of the SEC’s investigation into Consensys’ ETH sales. The investigation, which focused on whether these sales constituted security offerings, cleared the way for Ethereum by not recommending any enforcement action.\n\nConsensys disclosed in an earlier report shared by Crypto News Flash that the victory follows a battle of regulatory challenges and a lawsuit filed by the firm. Notably, this development eliminates a potential hurdle for Ethereum ETF approval.\n\nDespite this victory, the SEC appears not to be giving up on its crypto enforcement actions. In response to Consensys victory, the SEC’s correspondence gave a disclaimer that the closure of the investigation should not be interpreted as an exoneration.\n\nETH, the native digital asset of Ethereum appears to be reacting negatively to these developments. At press time, ETH is trading at $3,481, demonstrating a 3% decrease over 24 hours. However, the trading volume increased by 11% to $15.9 billion, demonstrating renewed interest from investors."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNSmpYdEtITFRjNkpmS281WHRCa05TMWcxVE9Wc204YXZGSEQ3bmJ2WEU1cnYwLVN3ejVaSk5TQWdCSGFMWldCWmFERUlwTUJiVU4zdVd5VEExNUpETTNCMlYyUDg0UVBFdmJNejVPcGRWbGRtd3lvcDhXV21oZXlnWGRJUUZzbzJaYUtHN0liVDA2RjE4dFJZVWpqNUcxS3FGeVFJSHl3WjJ2NmlRTFRiQmdiV0pFemNTeG0zel9IbWZxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "3 Reasons To Invest In Ethereum, 1 To Stay Bitcoin-Only: Bitwise CIO - TradingView",
        "content": "In a recent commentary shared on X, Matt Hougan, Chief Investment Officer at Bitwise Asset Management, which ranks as the world’s largest provider of cryptocurrency index funds, detailed why investors should consider diversifying their cryptocurrency portfolio by adding Ethereum (ETH), alongside maintaining a position in Bitcoin (BTC). Hougan offered three compelling reasons for investors to embrace ETH, while also presenting a critical viewpoint for remaining invested solely in BTC.\n\nEthereum Vs. Bitcoin: 3 Reasons Pro-Ethereum\n\nHougan began by emphasizing the importance of diversification within crypto investments. Drawing an analogy to the early days of the internet, he pointed out how difficult it is to predict which technologies or companies will dominate over the long term. “It is very hard to predict the future with precision,” Hougan remarked, referring to investors who bet on early internet companies like AOL and Pets.com, which failed to maintain their initial promise despite the internet’s overall growth.\n\nApplying this lesson to crypto, Hougan advised a diversified approach to hedge against similar uncertainties. Ethereum’s current market capitalization stands at approximately $420 billion, which is substantial but still only about one-third that of Bitcoin’s $1.3 trillion market cap. Given these figures, Hougan proposed a default starting allocation of 75% Bitcoin and 25% Ethereum for investors seeking broad market exposure.\n\nHougan’s second point delved into the functional differences between Bitcoin and Ethereum. He described Bitcoin as primarily “a new form of money,” highlighting its design choices aimed at enhancing its utility as a robust monetary system. “Every design choice the Bitcoin ecosystem makes is designed to make Bitcoin the best form of money that has ever existed,” he stated, underscoring Bitcoin’s targeted development toward optimizing its use as a currency.\n\nConversely, Ethereum is characterized by its role as a foundational technology for building new applications that leverage its capability for programmable money. This includes everything from issuing stablecoins to enabling complex decentralized finance (DeFi) ecosystems.\n\n“Ethereum’s primary function is making money programmable,” Hougan explained. He argued that the ongoing development within the Ethereum ecosystem provides a broader exposure to the potential applications of blockchain technology, which is still in its nascent stages.\n\nThe third argument for Ethereum centered on historical performance data. Hougan pointed out that historically, portfolios that included Ethereum along with Bitcoin showed better performance metrics, both in absolute terms and when adjusted for risk, across full crypto market cycles.\n\n“My favorite thing about that table is that the +ETH portfolio has both higher returns and a lower maximum drawdown,” he highlighted. This historical analysis suggests that Ethereum could offer better downside protection and higher potential returns, though Hougan cautioned that “past performance is no guarantee of future returns” and noted that in shorter, recent periods, a Bitcoin-only strategy would have outperformed.\n\nCounterpoint: Why a Bitcoin-Only Strategy May Be Preferable\n\nAddressing the other side of the coin, Hougan discussed why many investors might prefer a Bitcoin-only strategy. This perspective is especially relevant for those concerned with macroeconomic issues like the degradation of fiat currencies and inflation.\n\nHougan posited that Bitcoin’s dominant position and its community’s focus on becoming a new form of money make it likely to continue leading this space. “It has a large lead, and size matters in money,” he stated, supporting the idea that Bitcoin’s simplicity and focused use-case as digital gold could be more appealing for certain strategic investments.\n\n“Money is a massive market. There’s plenty of space for BTC to run if it succeeds. […] My view, in a word: If you want to make a broad bet on crypto and public blockchains, you should own multiple crypto assets. If you want to make a specific bet on a new form of digital money, buy Bitcoin,” Hougan concluded.\n\nAt press time, ETH traded at $3,514.06."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPLUlWcjEtRlVnalJhOUZ4aUVYTk9OX2RCYzluRVhYOHpLcnR6c3loSTRCUnp3M1duVlJjcmxnSlRrT3o4azA5Mm5Rd19FRlVmQ2N1SWRmN2dtMkg1ODhRcVQyY1lhbVl6OXRycUMtcXhWSnYwQmx6eENZdnVSaHpBYXdSTEoxVlpRS2FzajdXQUFLaXFuQU9tTlhsVEFWVV9HUG1OUFRhU2w0QjRvMGhLSGRfU0hGSkdkSHNCNjYwSTg3NTN4bDl3NzNBV0dZaFBIdzJXTTlPT3NFd9IB3wFBVV95cUxONlRxVk1mTk91THJ2MDRpbDFSQUdxSld5ZFl0NGRnaFNicmRWSXNVMi1Sb21zMEpxMlZYSUtKbXNCT3RISmdlX1BGTHRqU3NDV1hEaXQtYXV4WEI3ampmU05KUG05YmE2RjFJbG1WN2pISFRQUlBuSWtJdXNRdllTZTZkMHlxU2tCN29LUDBjQ1gzT1gtaFo3TjM5dWJWblRZUEo3LWV2cTMtZFd5dEozTlBHVVFtRnhCVElVb0Vmam9ud1NYUVdBNGxRbWM3Z1l0OHpkMmdrSVdCcGxjS1BB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin retraces to crucial support - FXStreet",
        "content": "Bitcoin price faces rejection at the weekly resistance level of $67,147.\n\nEthereum price stabilizes near the $3,362 support level established on June 14.\n\nRipple price is encountering a barrier at $0.515, which aligns with its 50-day Exponential Moving Average (EMA).\n\nBitcoin (BTC) price encounters resistance at weekly highs before retracing to seek support at a crucial level, while Ethereum (ETH) and Ripple (XRP) align closely with Bitcoin's movements, gearing up to surpass resistance barriers and embark on upward rallies.\n\nBitcoin price encounters major resistance\n\nBitcoin price was rejected by the weekly resistance level of $67,147 on Monday and is currently trading inside a descending channel. The descending channel is drawn, joining multiple swing high points and swing low point levels between early June and mid-June, as shown in the one-day chart below.\n\nIf BTC continues to decline, it could find support at $62,451, the 61.8% Fibonacci retracement level drawn from a swing low of $56,523 on May 1 to a swing high of $71,994 on May 21.\n\nIf the $62,451 support holds and BTC breaks above the descending channel, it could rally 7.5% to reach its previous resistance level of $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective mean levels of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nThis development would provide additional momentum to the ongoing recovery rally.\n\nIf bullish sentiment prevails and the overall cryptocurrency market shows optimism, BTC may extend its rally by 6% from $67,147 to retest its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if Bitcoin price breaks and closes below its daily support level of $60,800, the bullish thesis could be invalidated, leading to a 4% crash, its weekly support level of $58,375.\n\nEthereum price outlook is optimistic\n\nEthereum price finds support around the June 14 low at $3,360. On Wednesday, the US Securities and Exchange Commission (SEC) granted it a free pass, currently trading at $3,523—the $3,360 low roughly hovers around the 61.8% Fibonacci retracement level at $3,279.\n\nIf this support holds, ETH price could rally 5% from its current trading price of $3,523 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) in the daily chart struggles to close above its mean level of 50, while the Awesome Oscillator (AO) trades below its mean zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nIf ETH closes above $3,717, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,292 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,864.\n\nRipple price shows promise\n\nRipple price faced resistance at $0.515, its 50-day Exponential Moving Average (EMA) on Monday, and is currently trading at $0.490.\n\nIf the ripple price breaks above the 50-day EMA at $0.512, it could rise 7% from $0.499 to $0.532, its previous high of June 5.\n\nThe Relative Strength Index (RSI) in the daily chart is below the 50 mean level, while the Awesome Oscillator (AO) is below its zero line. If bullish momentum persists, both momentum indicators must remain above their respective thresholds of 50 and zero. This would provide further support to the recovery rally.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT 1-day chart\n\nConversely, if Ripple's daily candlestick closes below $0.450, marking the June 7 low, establishing a lower low on the daily chart would invalidate the bullish outlook. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOWC1kcl9LcS00WnFaTG80VGE5djUteXlxMW9ncjRoRkZXLTFVVHYzUjNWTFAyM0VMLWVTY2paXzZsRHVSYkdzbjN4czVlcTdSOVc5dkI0NEVueW5NZERFUDJabzJ6THo2OHgtRjQ1c1dmc1FQVzB6cGJ2N2htRGdMWmJueGxiVXPSAYwBQVVfeXFMTzRvVVNFdzExR2lLeDl0bXVjanIyd1VkcHdaNW1QRUNJUGJpUXdBcGMwOGZFQmlVblZhY1A2T3ZnOE9SZk5XcV9HaTFTbXlpTEpVUHgyejRma191UU1hNEM1MFR1cm5DTlZwVjFGMWZkbVdSNldIYTA4NXVFLWQwRlI5OTRtVElqdVVDRTY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s exchange supply hits an 8-year low – Only 10% left! - AMBCrypto News",
        "content": "The percent of ETH supply on exchanges has dropped to an eight-year low.\n\nETH rebounded from its decline in the previous trading session.\n\nNot only has Ethereum’s [ETH] price declined in the last few days, but its supply on exchanges has also decreased. This decline aligns with the trend in its Netflow, which has seen a dominance of outflows over the past few days.\n\nWhat percentage of ETH is left on exchanges?\n\nThe Ethereum balance on exchanges has been declining over the past few weeks, with this decline becoming more prominent towards the end of the previous month.\n\nAn analysis of the chart on Glassnode showed that it recently declined to around 10.19%.\n\nAnalysis showed this was the lowest percentage supply on exchanges in about eight years.\n\nA study of the chart indicated that this was the first time since 2016 that the supply dropped to this level. The decline means that addresses holding ETH on exchanges have withdrawn their holdings.\n\nThe decrease in supply over the last few weeks is a positive sign for ETH, suggesting reduced selling pressure and potential accumulation by holders.\n\nMore Ethereum leave exchanges\n\nAn analysis of the exchange flow showed a dominance of outflows in the last few days. As of this writing, the netflow is -1,481, indicating that more Ethereum has left exchanges than has come in.\n\nThis current Netflow trend aligns with the exchange balance, which shows a reduced amount of ETH remaining on all exchanges.\n\nAnalyzing the ETH price trend\n\nAs of this writing, Ethereum was trading at around $3,540, with an increase of approximately 1.7%. An analysis of its daily time frame shows an improvement from the previous trading session.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nIn the last session, its price dropped to $3,400 after declining by less than 1%. This decline followed another decline in the session before that.\n\nAdditionally, Ethereum’s Relative Strength Index (RSI) analysis showed a positive move. The chart indicated that its RSI was now close to the neutral line. This suggests that the bear trend is weakening as of this writing."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPLUlob0xlY2NBU3pFZjZDdkV0VVFUZ3NFaFBZM2lnc3MzZE16anRad1NPRDQ2TFpfVXhWTU5xN3VPRFlHLXNvd3JxTnhHZGhaeEZxVnQ3eFRvQXloQzNKclJ6bEpRZFVPUGpNV0lRODlRbGF5aWZuZ0tPU0pMRFRwUDlXQml3Q2R4WUNoZmpIRkF3RGg5d0FrNGdvT2XSAaIBQVVfeXFMTmtIOGo3SVB2UDdYRlJIMVN4YVFaUnkzaHJValI5OV9ta2MzQVY0X1BfSkluMDFVOGtxMC1FanAxU3dHQnU5V3h3X2hFQ1hVajQzUkwySTdhc1hOM2t3a2JWczI3SnJ0Z1hLV3hDMXE1cmhPMjBfVjVKSng3MFBYWEo1bkhWZUctRjFESWdGbjRCSDZ5MUhVbGxwR3JrallCSjRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Breaking: Standard Chartered Becomes First Bank to Launch Spot Bitcoin, Ethereum Trading - CoinGape",
        "content": "Global banking giant Standard Chartered deepens crypto push and announces plan to open trading desk for spot Bitcoin and Ethereum. As a result, it has become the first bank to enter spot crypto trading.\n\nRecently, Mastercard and Standard Chartered Bank Hong Kong successfully completed their first live experiment on the tokenization of deposits using the Mastercard Multi-Token Network (MTN). The company making a stronger push into different crypto-related fields.\n\nadvertisement\n\nStandard Chartered Enters Spot Crypto Trading Space\n\nIn a major crypto development, Standard Chartered on June 21 said it is close to starting a trading desk for Bitcoin and Ethereum. The new crypto-focused operations will be part of the bank’s FX trading unit. The trading desk will be available to run from London, reported Bloomberg.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” said Standard Chartered.\n\nThe move was welcomed by crypto industry leaders including Binance CEO Richard Ten as it indicates the mainstream adoption of crypto is picking pace. Standard Chartered through its owned companies Zodia Custody and Zodia Markets has offered crypto-tailored solutions including crypto custody and institutional crypto trading.\n\nZodia Custody has also announced expanding the list of supported digital assets for comprehensive custody solutions. It has added USDe to its custody platform today.\n\nAlso Read: Ripple Lawsuit Referred To Magistrate Judge For Settlement\n\nBitcoin and Ethereum To Rally?\n\nTraders reacted immediately to the news, bringing some upside momentum to both Bitcoin and Ethereum prices.\n\nBTC price rebounded 1% after the news but still down 2% in the past 24 hours, with the price currently trading at $64,151. The 24-hour low and high are $63,529 and $66,451, respectively. Furthermore, the trading volume has increased by 37% in the last 24 hours.\n\nMeanwhile, ETH price also reversed upside after dropping to a low of $3,446. The price currently changing hands at $3,514, down 2% in the last 24 hours. Also, the trading volume has increased by 15% in the last 24 hours, rasing speculation of a recovery in the crypto market.\n\nAlso Read: Shiba Inu Coin Burn Rate Spikes 530%, Will SHIB Price Rally?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQY0RPeU9Vai1hdVNDQXhCaFk5d1FQVlRGRFRGeU9JNk5DNjlyOWYzU281dTJRQVlqaTlYOVVwMEJLeGVrVGFzRDM2VGxVZlZrQnY5SHlKa0hjMHp4VkdIY3duWkNwVmo4Y2lYV0w2YXJtY0tmNkhPbjJkZUh5NktpXzRSY1V2QTNNNTl4eE02SHNncXfSAZgBQVVfeXFMTWotcjNhaXlTdEI2S2tzcHl4d052NzM4VEIzVWpNaHVLd1NiUmsxZlJCWDdZWER5bWxIZUxFTzdKMUlTNEVPM1pHNzhyc1lRd0V5eTBqZHRwd0Vpa05idWl4YU1sQ0Vkd1VJRVlMaUoyZ09FZjdUYk1YaC1WdENOTDlBOVRjZ2lCR0JWa1hjOGRZZVRQd3pNai0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "BNB Chain follows Ethereum with latest upgrade: Any impact on price? - AMBCrypto News",
        "content": "Data showed that the latest upgrade could tank BNB Chain’s revenue.\n\nBroader trader sentiment was positive, suggesting that BNB’s price can retest $600.\n\nOn the 20th of June, BNB Chain, the decentralized blockchain ecosystem released a major update. According to the chain, through BEP 336, users on the network can make transactions with a 90% fee reduction.\n\nThe disclosure is synonymous with Ethereum’s Dencun upgrade, which brought about a decrease in gas fees. Interestingly, BNB Chain did not deny that the EIP4844 inspired it. Concerning this it explained that,\n\n“BEP 336 significantly lowers the cost of transactions on the BSC network by eliminating the need for permanent storage of certain data types.”\n\nWill this affect revenue?\n\nHowever, it is important to mention that the development could affect BNB Chain’s revenue. At press time, AMBCrypto observed that the project’s revenue decreased from what it was on the 19th, according to Artemis data.\n\nNotably, fees gotten from transactions contribute a major quota to the revenue. Therefore, a further reduction could lead to another drop. BNB’s price is another metric that the development could influence.\n\nAt press time, BNB changed hands at $585.37. This was a notable decrease from the all-time high it reached weeks ago.\n\nHowever, reduced transaction fees could mean increased demand for the BNB cryptocurrency. Should this be the case, the price of the coin might be able to approach its all-time high of $720.67 again.\n\nRegardless, it is important to assess what is happening on the network. As of this writing, AMBCrypto looked at the development activity.\n\nDevelopment improves while traders plan to take advantage\n\nDevelopment activity measures the work done in public GitHub repositories of a project. If the metric increases, it means that developers are committing more codes to ensure shipping of new features.\n\nHowever, a decrease implies that commitment to polishing the network is not at its peak. According to. data from Santiment, BNB ‘s development activity jumped to its highest level since the 6th of May.\n\nThis implied an improvement in developer dedication. For the price, this rise could be bullish for the coin. Another indicator to evaluate is Funding Rate.\n\nThe idea behind assessing this indicator is to see if traders view the upgrade as a catalyst to drive a price increase or not.\n\nAccording to Coinglass, BNB’s Funding Rate was 0.0020%. Positive values of the indicator implies that the contract price is trading at a premium to the spot price. In this case, trader sentiment is bullish.\n\nOn the other hand, a negative reading implies that the perpetual price is at a discount. Therefore, the broader trader sentiment is bearish.\n\nThus, the Funding Rate at press time, implies that longs are paying shorts a fee to keep their position open. Hence, the average trader expects BNB’s price to increase.\n\nRead Binance Coin [BNB] Price Prediction 2024-2025\n\nBut for the price to increase, buying pressure in the spot market has to be increase.\n\nIf this happens, BNB’s price can surpass $600 in the short-term. But if invalidated, the price of the coin might drop to $570."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1vWlFuWUZjQ2tQMUJiVEQ1cnBYUWg2WXZGeExMUnJjM1ZZdDFwZS1TTzZHZm0yVngxQllaQkgtRkRWWGRQc1NpYlRtZTJNdnNYWDlQOVZRS0tBOWlGSy1iUnRGbUFHRUpTdU8tNkx2QlB6X3o3WHpsblB30gGCAUFVX3lxTFBvcmFEZUFqTWZja1cxaTUzRnRscHZyUWhOOHA4MFBISzI4VXZKR1hpbzktd0VEa3NVQkZnZV9ncFVLSF9aVGh5RFNmdXRMRkp4OUIxdFpNYXhEeFVDOEdSMjZ0QlRDMjkyeW5hN3ljTmtCajJxQzBYazdvTlhBZm1PZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Fighting Game 'AI Arena' Sets NRN Token Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nArtificial intelligence-driven fighting game AI Arena has set a date for its NRN token launch, following a play-to-airdrop campaign this spring.\n\nEarlier this year, AI Arena let 8,000 users play its unique brawler game—built on Ethereum layer-2 scaling network, Arbitrum—while in pre-release for the chance to earn potential token rewards, with a campaign built around social media influencers. Now, those rewards are just around the corner.\n\nThose who participated will be able to claim their tokens at 7am UTC on Monday, June 24, with a centralized exchange listing coming an hour later. Which exchange(s) the token will be listed on has yet to be announced, as of this writing.\n\nAI Arena is a cartoonish brawling game akin to Nintendo’s Super Smash Bros. where players control their characters using artificial intelligence (AI). This is the unique hook for the game: Rather than button-mashing like other games in the fighting genre, you’re the fighter's coach aiming to clinch victory via extensive AI-driven training.\n\nAD\n\nAD\n\n$NRN token will go live 06.24.2024 Claim Site Open: 7:00 am UTC\n\nCEX Listing: 8:00 am UTC Listing partners to be announced Thank you to everyone who has been with us and believed in something.$NRN is AI gaming. Believe in the journey ahead. pic.twitter.com/gwonlVmKSQ — AI ARENA | ʌı (@aiarena_) June 21, 2024\n\nIn March, the final round of the play-to-airdrop campaign ‘Gateway of the Arena’ concluded. This competition attempted to attract players while providing token rewards for playing the pre-release game.\n\nThe 8,000 players that took part earned a score based on how well their AI fighters performed. Each player was also part of a team headed by one of eight influencers, including the pseudonymous YellowPanther and Wale. Depending on the team's collective performance, players were rewarded with a potentially sizable airdrop multiplier.\n\nHow well you, your AI, and your team performed impacted the size of your airdrop bag. Overall, AI Arena promises to airdrop 80 million NRN tokens—half from the play-to-airdrop drive and half tied to “NRN Boxes,” or reward boxes linked to community engagement.\n\nAD\n\nAD\n\nWith the 3rd and final cycle right around the corner, let's take a look at some of the best community-submitted highlights from Cycle 2 of the Gateway to the Arena competition! 🔥 (Your AIs are getting scary good at the game.) Want to be featured in next week's highlight video?… pic.twitter.com/HcN0937ZP5 — AI ARENA | ʌı (@aiarena_) March 6, 2024\n\nIn the future, AI Arena plans to launch a version that will require an NFT access pass to play. This version of the game will serve as the elite proving ground for the highest-level players, as the developer sees significant esports potential around this unique AI-driven fighting riff.\n\n“Thank you to everyone who has been with us and believed in something,” the AI Arena announcement tweet read. “NRN is AI gaming. Believe in the journey ahead.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNSS00TTJDMFY4NXlIVll5cmtnYWRtNllyekVGT3c5VzhpdW9rZ3BrMFVObHNxeFJBTzJMUDFLOWFpRGpkNHBjQzIybGk2elJnZW5GU3BFWkVyM3dnZE5QU0RIN3k4aFZyNVk0WmJNRWlMTHhubUxoaHZiYlhHTmlRUjN5Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Long-term Holders Dictate its Future! - Cointribune EN",
        "content": "Thu 20 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic world of crypto, investor confidence is often measured by their willingness to hold onto their assets through market highs and lows. Recently, Ethereum has signaled a resounding vote of confidence from its community, with a record number of long-term holders. These HODLers play a crucial role in Ethereum’s future!\n\nLong-Term Holders Are Booming on Ethereum!\n\nAccording to Glassnode data, a notable concentration of Ethereum is held for periods ranging from 1 to 3 years! Indicating that much of the Ethereum acquired during the 2021-2022 period is still being held. This trend is reinforced by the decrease in the proportion of crypto held for less than six months, while the share held for more than seven years has increased. Reflecting the stability and faith in the fundamental value of Ethereum and its potential for future growth.\n\nThe Ethereum HODL Waves chart illustrates the distribution of Ethereum held over various periods. This reveals changing trends in the holding behavior of crypto investors. The recent surge in long-term holders suggests a conviction in Ethereum’s long-term value! This, with a significant portion of investors choosing to hold their assets rather than sell in response to market fluctuations.\n\nCrypto – Ethereum HODLers\n\nThe Influence of HODLers on the Future of Crypto\n\nLong-term Ethereum holders play a crucial role in stabilizing and growing the crypto. By holding their assets, they reduce volatility and create a sense of confidence that attracts new investors. Their long-term vision also encourages the development of innovative projects on the Ethereum blockchain. This, in turn, fosters a richer and more diverse ecosystem.\n\nThis HODLing strategy can positively influence Ethereum’s future, positioning it as a leading digital currency with increased global adoption and usage. However, despite these positive prospects, it is important to note that cryptos remain a high-risk activity. Everything can change at any moment!\n\nThe behavior of long-term Ethereum holders suggests a strong belief in the long-term potential of crypto. Their strategy being beneficial, could be an indicator of Ethereum’s growing maturity as an investment asset.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQS0J3MEhmNmpvNWxRVGVHTmRrTmFnT3kxNnJLMy1pU0Y3RzZYZXBCUUZfbk9XbFVlcUdMWWZ3SjFaSWlUSFBmQ2EtVXNjaUN1djk3WGg0X291RGFXN2ZVRUZGOWsxSjFaaTBndjRzcnJDOGhsUDhyd3pRVFdyckRFZE5xYmt0b0toNWhGdUU5T3ZoQnZubkZv0gGcAUFVX3lxTE53eGxsYVpLaUFXdUlad19GOFBDVjd2UkxVVm84bmJCZ1oyVklXODgwY1lvQmF5ejRFY3o2cWRTc0NoNG9OckFZTDhTbmVMZWd6Q1pwdVgtQ1Y4bmJocTYwY21EdjRCWm45Um9MWm5tdDNfZ09wbTl1YWhwWWpTZkVQdTBITm9GWjZqSFB3RWQ0WnVUcXR3WXlPQXhRVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs and MVRV Growth Suggests ETH Dominance in Altcoin Season - CoinGape",
        "content": "Ethereum market value to real value (MVRV) is outpacing Bitcoin and other assets ahead of the anticipated altcoin season. This metric points to increased positive fundamentals in the market amid the decline in prices sparked by a fall in sentiments. Major drivers of ETH performance are the upcoming Ethereum ETF listings and whale accumulations.\n\nEthereum MVRV Outpaces Bitcoin\n\nEthereum’s MVRV is moving higher than market leader Bitcoin amid a slew of industry factors. New data from on-chain analytics firm CryptoQuant shows the trend suggests hitting up the ETH market in relation to its fundamentals.\n\nadvertisement\n\n“We’re entering early alt season. $ETH MVRV is rising faster than BTC MVRV, suggesting the ETH market is heating up relative to its on-chain fundamentals. Given the current ETF situation, this might be an ETH-only season. Historically, when ETH surges, other alts tend to follow.”\n\nThe altcoin season is expected to see a rally in assets but recent events point to an Ethereum-only season according to the data. However, gains will be seen in other altcoins due to the effect of ETH on the market. The asset’s recent surge to $3,700 before a price correction boosted similar sentiments in altcoins and meme tokens.\n\nInstitutional investors increased their appetite for Ethereum after the success of Bitcoin ETFs in Q1 2024. This led to inflows into investment products taking most funds out of the red zone in terms of yearly figures.\n\nETF and Accumulation Drive Sentiments\n\nPotential ETF listings have ignited bullish signals leading to a rise in ETH momentum. The initial approval saw its price soar 22% before falling alongside the market. Bulls project billions of inflows to Ethereum because of its smart contract capabilities and existing market utility.\n\nSimilarly, on-chain data shows the accumulation of the asset despite a price fall. Several analysts have projected the price to tap $4,000 post Ethereum ETF listing coupled with positive macroeconomic factors like cooling inflation and interest rate cuts.\n\nAlso Read: Binance Appeals $4.4M Fine by Canada’s FINTRAC Over AML Violations\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPRXd3Y0pzU3NveVNxbmoxVmk0YzJnbDM0a1dvNUszU0I2YUg3LTAtNkJPTDUtY19LeUhwNm84QXVTYzQzY29xUktHTUs2ek4ybHJ1Yjd4REg0Z1IwQXNua3hpQmI2TXh6ZTdzdE9zVHpLeFNadUJVdTBEaHRpaWtIUUNtb2dETjdta2haZVdhbUFTMU1ua2ZKNVBPQWJ2dl9oN2hvYVk1eUp6dFNWR3pTSjFMVWQzcnZCenk0dE0tNGNPZ0NkRG43aHl0bFJLbHdhU3V3d1B4SzNZUEpMaWfSAeMBQVVfeXFMUDBXT2o4bFgtMWdPUHlIZktxNkdYcy1jMGJXRU5SdzV3M05mSnBVZXA4MkVubTVrZ1BRQ01EY3prcTRSRDRjSFV5b0Fzc1F4OWZEcUE5b19HNDJhVGZKd0ptYzZNeGtKakpDSUZOWW9pVzR5TEVmaGNvWVZBaEEzVVU0c2RIVkJ6c1ZzZVFJZ3V1UkJleG1sS1d3WFFuQi05Mi1EWTBIcUhya3JOQkU1ZFNTTlJoQVNSNldKYXhIZXRWYW5kU0pObi1Ydm05Ul9vQTRDajlGS2FvU0tRcGlheXdxX1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "XRP holders wonder how SEC will treat Ripple as Ethereum gets free pass - FXStreet",
        "content": "The court decision is a partial summary judgment. The ruling can be appealed once a final judgment is issued or if the judge allows it before then. The case is in a pretrial phase, in which both Ripple and the SEC still have the chance to settle.\n\nThe SEC has stepped up its enforcement actions toward the blockchain and digital assets industry, filing charges against platforms such as Coinbase or Binance for allegedly violating the US Securities law. The SEC claims that the majority of crypto assets are securities and thus subject to strict regulation. While defendants can use parts of Ripple’s ruling in their favor, the SEC can also find reasons in it to keep its current strategy of regulation by enforcement.\n\nThe ruling offers a partial win for both Ripple and the SEC, depending on what one looks at. Ripple gets a big win over the fact that programmatic sales aren’t considered securities, and this could bode well for the broader crypto sector as most of the assets eyed by the SEC’s crackdown are handled by decentralized entities that sold their tokens mostly to retail investors via exchange platforms, experts say. Still, the ruling doesn’t help much to answer the key question of what makes a digital asset a security, so it isn’t clear yet if this lawsuit will set precedent for other open cases that affect dozens of digital assets. Topics such as which is the right degree of decentralization to avoid the “security” label or where to draw the line between institutional and programmatic sales are likely to persist.\n\nThe United States Securities & Exchange Commission (SEC) accused Ripple and its executives of raising more than $1.3 billion through an unregistered asset offering of the XRP token. While the judge ruled that programmatic sales aren’t considered securities, sales of XRP tokens to institutional investors are indeed investment contracts. In this last case, Ripple did breach the US securities law and will need to keep litigating over the around $729 million it received under written contracts.\n\nIt depends on the transaction, according to a court ruling released on July 14: For institutional investors or over-the-counter sales, XRP is a security. For retail investors who bought the token via programmatic sales on exchanges, on-demand liquidity services and other platforms, XRP is not a security.\n\nOn the contrary, if Ripple closes under $0.4665, the April 19 low, it could invalidate the bullish thesis. XRP could find the next support at the June 7 low of $0.4508.\n\nThe Moving Average Convergence Divergence (MACD) line crossed over the signal line, with green histogram bars flashing above the neutral line, supporting a bullish thesis for XRP. If this upside scenario unfolds, Ripple could rally towards resistance at $0.5326, coinciding with the June 5 high.\n\nXRP gained nearly 1% on Thursday, as seen on the daily chart . The altcoin is trading at $0.4963 on Binance at the time of writing, gaining nearly 1% in the past seven days but losing nearly 8% in the past 30 days.\n\nA big win for Consensys, though questions remain. Does this mean the SEC thinks Consensys’ offers and sales of ETH are not securities transactions and/or that ETH itself is not a security? What will Gensler say if now asked? What is the status of MetaMask and staking? This is…\n\nRipple (XRP) holders debate the future of the altcoin on Thursday, which could be closely related to the US Securities and Exchange Commission’s (SEC) next step following its decision to end the investigation into Ethereum (ETH).\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOVU1hSzA0QUZ6VTQ2aEhhUXM3SmNPNzJyREtqQ2JEVUxVQmJoVEFLWlZLSjFpRFBkVGtpYkprMml4WWNWdTJsN1JUd2dkSTNKTzE5eTN5OTd5QzQ5RDQyTHE2ZjVhRElWRjVFeExGTmctZF9UZWhGR3VYaE85MlQxaDFmMW9XdGxNdXh2OVBNbV8tSzdQQUFZaG1oVWpVT0FOUlc4U0VuLU43OW1CWW9aeXNtcWZfODQ0U3d6QS1fZE5aSVZSWUR3blNobVRzVHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Breaking: US SEC Ends Investigation into Ethereum 2.0, Says No Further Legal Action Will Be Taken - Crypto News Australia",
        "content": "The SEC has closed its investigation into Ethereum 2.0, dropping allegations that Ether sales are securities.\n\nConsensys argued that recent ETF approvals implied ETH is a commodity, leading to the investigation’s closure.\n\nThe decision may spark discussions on listing other altcoin ETFs, but Consensys emphasises ongoing challenges in the crypto industry.\n\nIn a major breakthrough for the crypto industry, Consensys, a private blockchain software technology company founded by Ethereum co-founder Joseph Lubin, just announced that the US Securities and Exchange Commission (SEC) is dropping its investigation into Ethereum.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nConsensys announced, “the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0”.\n\nRelated: Bloomberg Reports Elon Musk Plans To Turn X Into Next Venmo, Will Crypto Play a Role?\n\nThis includes dropping allegations that sales of Ether are securities – a long-debated question among the crypto community.\n\nAdvertisement\n\nLubin’s company said this comes after they asked the SEC on 7 June to confirm ETH’s status as a commodity following the recent exchange-traded fund (ETF) decision in the US.\n\nIn late May the regulator gave the green light for the listing of Ether ETFs on several US exchanges. The 19b-4 approval signifies that trading on these exchanges now only requires S-1 approval.\n\nA step many saw as a de facto greenlighting of Ethereum as a commodity.\n\nDecision to Spark More Altcoin ETF Talks\n\nThe SEC dropping the investigation could lead to more talk about altcoin ETFs being listed. Recently, both Ripple CEO Brad Garlinghouse and Tether co-founder William Quigley voiced their expectations of several other altcoins fund listings in the near future.\n\nQuigley believes ADA (Cardano) and SOL (Solana) could be next for an ETF, while Garlinghouse also believes an XRP ETF is in the cards.\n\nHowever, Consensys also said in their statement on X that, while great news, the decision to drop the Ethereum investigation is not a miracle cure for all the issues in the crypto industry.\n\nThe closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under SEC’s unlawful and aggressive crypto enforcement regime. Consensys Consensys\n\nThe statement added that Consensys would continue the fight, especially regarding the status of crypto wallet MetaMask and swaps and staking within the wallet.\n\nOur fight continues. In our lawsuit, we also seek a declaration that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws. It should not take a lawsuit to provide the much-needed regulatory clarity to allow an industry that serves… — Consensys (@Consensys) June 19, 2024\n\nBackground of SEC Investigation\n\nThe SEC’s Enforcement Division, led by Gurbir Grewal, initiated an investigation in March 2023 into Ethereum transactions dating back to 2018.\n\nThe probe came to light when the Ethereum Foundation’s GitHub mentioned scrutiny from a “state authority,” later identified as the SEC.\n\nRelated: Bitcoin NFTs Surpass Ronin with Record $148 Million All-Time Sales in Last 30 Days\n\nIn April, Consensys sued the SEC, seeking confirmation that ETH is not a security. The SEC decided to close the investigation after Consensys argued that the approval of spot Ethereum ETFs indicated that ETH is a commodity, not a security."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNc0lwSFlSaFNnT2UzYnJkQjdFVGctdWY4N18wTWNUR3BIZXpIRXFNRHd5S0I4RXEyYV9QZE1La2U2aXRTMDFDUUkxMmQyUjJSOEd2ZV9ZVnZ0eHpiZWhsUXZxWGRQSjRfMUd0eEx3dlFtOWREUlNqckdqYXc2XzZscm04VWpRRTQyNUszZ0ZINHXSAZ4BQVVfeXFMTXlvQ1RvdWdtVnZ6VlZvY1R4eEthWGpBeUhreEljdENTUkxISWRpbFBVeFhhcVdmMUNwckY1dFd4S0N1bGNQeXRXb3NISUdkcVplWjBOeGZfUk1yTTk5bU1xcFdVNlNTclhSLTVIYWdBUXAySHhnMnhMMmFpTTFmYkJMQjFUMS1MVDAxdFd3NXlnaFJweWVCLV9RM2R5eHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 21, 2024 - Analytics Insight",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by market capitalization, continues to be a focal point in the crypto market due to its robust platform and widespread adoption.\n\nAs of June 21, 2024, Ethereum price has seen significant activity, reflective of broader market trends and specific factors impacting the Ethereum ecosystem. This article delves into the current price of Ethereum, its market performance, and the underlying factors influencing its valuation."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBtZ0M4dWlDb3BMcV95TERDeFF2YnkyR3hZaVdfSDBmc1AyX205dTh4MF82Zm5CenVFWHdmeV9GUUtkeWFwZGl1c3V3VGZtYldnS2V6ekd5cl9vODJYWkh0em5FLXNzczV1eENvcFlDWnhzNkpj0gF6QVVfeXFMTnVHRnMwRUFKTUFfZ1dCZW1IT01FdzllNWtuVUluenY0a3ppTHh1ekgtZ0tJa3QzcGFiZEVwQ2dmTFpmdTNSN1RBNjJLb3VMdklRb0NZd0JDOHV6ZGMxaERaaEh1a1czcE1iTlBlYmMyeDN5OWttOWdKRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 03:42:46 GMT",
        "title": "Ethereum Price Retreats: Market Sentiment Slowly Shifts Bearish - NewsBTC",
        "content": "Ethereum price struggled to climb above the $3,650 resistance and trimmed gains. ETH is now signaling a downside break and might decline below $3,450.\n\nEthereum is trimming gains from the $3,620 resistance zone.\n\nThe price is trading below $3,550 and the 100-hourly Simple Moving Average.\n\nThere was a break below a short-term rising channel forming with support at $3,540 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bearish momentum if it dips below the $3,485 and $3,450 support levels.\n\nEthereum Price Trims Gains\n\nEthereum price started a decent increase above the $3,500 zone. ETH outperformed Bitcoin and broke the $3,550 resistance. However, the price struggled to surpass the $3,620 level and failed to test $3,650.\n\nA high was formed at $3,620 and the price is now trimming gains. There was a minor decline below the $3,550 level. The price dipped below the 23.6% Fib retracement level of the upward move from the $3,351 swing low to the $3,620 high.\n\nThere was a break below a short-term rising channel forming with support at $3,540 on the hourly chart of ETH/USD. Ethereum is still trading below $3,550 and the 100-hourly Simple Moving Average.\n\nThe bulls are now active near the $3,485 support zone and the 50% Fib retracement level of the upward move from the $3,351 swing low to the $3,620 high. On the upside, the price might face resistance near the $3,520 level. The first major resistance is near the $3,560 level.\n\nThe main resistance sits at $3,620 or $3,650. An upside break above the $3,650 resistance might send the price higher. The next key resistance sits at $3,720, above which the price might gain traction and rise toward the $3,750 level. Any more gains could send Ether toward the $3,880 resistance zone in the coming days.\n\nMore Downsides In ETH?\n\nIf Ethereum fails to clear the $3,560 resistance, it could start another decline. Initial support on the downside is near $3,485. The first major support is $3,450.\n\nA clear move below the $3,450 support might push the price toward $3,420. Any more losses might send the price toward the $3,350 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,450\n\nMajor Resistance Level – $3,560"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQLXNwcHpNQWFtYTF1bVpkSmxxa1VBQ2U4Q3JFRTlJU0NrZkNTM2tmbHp0aG0wODY5UFQzT1BjQ1FxTW5fRmJPR3BoZnFDVGl6bFRQQ0RYQW9lWFAxdmtPcXZIcjNBeWZ2TmllLS1rYzE0M1BaTE9oRDJESWJCWkhoeHNLUy02dkZodHZQV09TbFduTWVFTHF3NE81OEtXQkRNUDdqTkhkZlXSAa4BQVVfeXFMTXJWaENfSm9RcEZFeTRiZEJzM3hES2FkOWRZbU9pempKRVJJU0hQZVU1QVBsYldscmU3SXMwb2ZwZk5abFczaDNneTAtVVRTT2dPdW10VXZ0ZWZoTnVpZFkxbldvRl9rMjMzOWp4VWxmRjNnWnhpTERvbkt3YkhYMDB0S2lwR01TVDlVTXJTb1BpenFrXzVFZnl3RHRjckpGTFVqV2FDVHNLT3Z6aGN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 11:32:48 GMT",
        "title": "Ethereum At A Crossroads: Big Move Coming After Consolidation Phase? - NewsBTC",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, is currently at a critical juncture as its price enters a consolidation phase. This period of price stability, marked by a narrow trading range, has left traders and investors in a state of uncertainty.\n\nWith Ethereum’s price hovering around key support and resistance levels, market participants are closely monitoring technical indicators and market signals to anticipate the next move. The current consolidation reflects a balance between bullish optimism and bearish caution, creating an environment of indecision that could lead to significant volatility once a breakout direction is established.\n\nThis analysis delves into examining Ethereum’s current price state to determine its potential future price action.\n\nMarket Overview: Ethereum Current Trends And Analysis\n\nCurrently, on the 4-hour chart, the price of Ethereum is moving upward toward the upper level of the consolidation zone, but it is still trading below the 100-day Simple Moving Average (SMA).\n\nA careful examination of the 4-hour Composite Trend Oscillator reveals that ETH’s price may still move upward as both the signal line and the SMA of the indicator are trending above the zero line. From this formation, it can be suggested that Ethereum may likely move to test the upper base of the consolidation before dropping again.\n\nOn the 1-day chart, ETH is actively bullish moving toward the upper base of the consolidation zone while still trading above the 100-day SMA. With the way ETH’s price is moving, it may move on to test the upper base of the consolidation.\n\nThe 1-day Composite Trend Oscillator indicator reveals that although ETH is currently bullish, it may go bearish in the long run as both the signal line and the SMA are attempting to cross below the zero line.\n\nPotential Scenarios: What’s Next For ETH?\n\nA look at potential future scenarios for Ethereum’s movement post-consolidation suggests that if the price of ETH breaks above the upper base of the consolidation, it will begin to move upward toward the $4,099 resistance level. If the price breaches this level, it may move on to test its all-time high of $4,863.\n\nIn contrast, should the crypto asset break below the lower base of the consolidation, it will begin to move downward toward the $2,865 support level. If this level is breached, it will continue to move downward to test the $2,147 and probably other lower levels.\n\nAs of the time of writing, ETH was trading at around $3,607 and was down by 1.82% with a market capitalization of over $440 billion and a 24-hour trading volume of over $13 billion. Although its market capitalization is down by 1.77%, its trading volume has increased by 28.93% in the past day.\n\nFeatured image from Adobe Stock, chart from Tradingview.com"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNcWNnUkJOdkVWVHREM3pNU2Nvck1idjJ4VTFBUWlrWk96WHpkTTBNTzV0SGNqbnppbndqZEZYZkRwc0l4eGpUdHBPckxmTkJmX3MtM0JzU2w3dnNzWkFIcGVTRFdYNms5WS1XNDgyRHV2eTVJN3JLQjlMZGR6X3EzanlQWXR3UEZab01zZ2FkOUFNcm13VzBvVHF6Mm1oUdIBowFBVV95cUxNM1RRbWdwVTROLU5aLWlXNl95M0NNeEx0b3FSZ0ZkZFVIWjlRc2dvQVVSa0kyRU9TaUp1cFFtXzFoNlRlMFZscFFpaXNuWmxNem1ERFpEb0hUV1RlQmJfd1hoTTRNaGc4QnEwbi05U2dCZkIxM2N2anppcVQ1NTNNLXNTWkVzUkEzU2MxX3hhbjVtVC0zZjF3a2hjQlo2Tk01ZmQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 10:03:12 GMT",
        "title": "Double-Whammy For Ethereum: Price Collapses, Exchange Supply Dries Up - NewsBTC",
        "content": "They say journalists never truly clock out. But for Christian, that's not just a metaphor, it's a lifestyle. By day, he navigates the ever-shifting tides of the cryptocurrency market, wielding words like a seasoned editor and crafting articles that decipher the jargon for the masses. When the PC goes on hibernate mode, however, his pursuits take a more mechanical (and sometimes philosophical) turn.\n\nChristian's journey with the written word began long before the age of Bitcoin. In the hallowed halls of academia, he honed his craft as a feature writer for his college paper. This early love for storytelling paved the way for a successful stint as an editor at a data engineering firm, where his first-month essay win funded a months-long supply of doggie and kitty treats – a testament to his dedication to his furry companions (more on that later).\n\nChristian then roamed the world of journalism, working at newspapers in Canada and even South Korea. He finally settled down at a local news giant in his hometown in the Philippines for a decade, becoming a total news junkie. But then, something new caught his eye: cryptocurrency. It was like a treasure hunt mixed with storytelling - right up his alley!\n\nSo, he landed a killer gig at NewsBTC, where he's one of the go-to guys for all things crypto. He breaks down this confusing stuff into bite-sized pieces, making it easy for anyone to understand (he salutes his management team for teaching him this skill).\n\nThink Christian's all work and no play? Not a chance! When he's not at his computer, you'll find him indulging his passion for motorbikes. A true gearhead, Christian loves tinkering with his bike and savoring the joy of the open road on his 320-cc Yamaha R3. Once a speed demon who hit 120mph (a feat he vowed never to repeat), he now prefers leisurely rides along the coast, enjoying the wind in his thinning hair.\n\nSpeaking of chill, Christian's got a crew of furry friends waiting for him at home. Two cats and a dog. He swears cats are way smarter than dogs (sorry, Grizzly), but he adores them all anyway. Apparently, watching his pets just chillin’ helps him analyze and write meticulously formatted articles even better.\n\nHere's the thing about this guy: He works a lot, but he keeps himself fueled by enough coffee to make it through the day - and some seriously delicious (Filipino) food. He says a delectable meal is the secret ingredient to a killer article. And after a long day of crypto crusading, he unwinds with some rum (mixed with milk) while watching slapstick movies.\n\nLooking ahead, Christian sees a bright future with NewsBTC. He says he sees himself privileged to be part of an awesome organization, sharing his expertise and passion with a community he values, and fellow editors - and bosses - he deeply respects.\n\nSo, the next time you tread into the world of cryptocurrency, remember the man behind the words – the crypto crusader, the grease monkey, and the feline philosopher, all rolled into one."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNVklVUTBJM3FfbzRiYVhzZnRVUFBxaHVubnkya0RveTlVREd5MjNIbXVoT2lmNk9wVDkweE1ZenZZcnBoRU10aDV0bzlvbnE4SWdfZ3FMU2s5SlRqdzZMdGtzaEk5ZS1jWGFBUTRENGY5aDFMaUZkbGN5dFNybXlOTjV4dVo5OFJtUk9yVEdsczVtbG1LVy1jZ1F4Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "ChatGPT-4o sets Ethereum price as $800 billion bank enters ETH spot trading - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has been conquering traditional finance attention, especially among relevant institutional players. Now, Standard Chartered, a banking giant with over $822 billion in assets under management (AUM), has also made its move.\n\nAccording to a Bloomberg report, Standard Chartered plans to offer Ether and Bitcoin (BTC) in a new crypto trading desk. If accomplished, the move will make StanChart the first major global bank to offer this service.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” the bank said in a statement.\n\nFurthermore, the bank already holds stakes in crypto-focused firms like Zodia Custody and Zodia Markets. Standard Chartered launched Libeara, a blockchain unit, to help institutions tokenize real-world assets, a use case leveraged by Ethereum’s network.\n\nThe bank remains bullish on the crypto sector, predicting Bitcoin will hit $150,000 in 2024, as reported by Finbold. In this context, we asked ChatGPT-4o for a price prediction on Ethereum, considering the recent support from Standard Chartered.\n\nChatGPT-4o Ethereum price prediction with Standard Chartered spot trading\n\nNotably, OpenAI‘s flagship product, ChatGPT-4o, mentioned that increased institutional adoption is a driving factor for Ethereum’s demand. The artificial intelligence (AI) chatbot provided three scenarios addressing a bullish, a moderate, and a bearish outlook.\n\nFirst, ChatGPT forecasts ETH to trade between $6,000 and $9,000 by mid-2025. This forecast assumes positive regulatory developments, successfully launched Ethereum spot ETFs, and increased institutional adoption.\n\nA more moderate scenario puts Ether, the native token, between $4,500 to $6,000 by mid-2025, considering a sustained but not explosive influx of institutional funds. Meanwhile, Ethereum could remain at its current level between $3,000 to $4,000 if things do not play out as expected.\n\nChatGPT-4o Ethereum price prediction. Source: NanoGPT\n\nEthereum (ETH) price analysis\n\nAs of this writing, Ethereum trades at $3,496 per token, showing strong momentum in the one-year price chart. The leading Web3 cryptocurrency has gained 86% year-over-year, getting its launchpad ready for a significant surge if everything goes favorably.\n\nA rally to the AI targets would result in up to 157% gains from current prices.\n\nEthereum (ETH) one-year price chart. Source: Finbold\n\nHowever, ChatGPT-4o can make mistakes, and ETH’s success depends highly on the demand that its network can attract. Cryptocurrencies continue to be developed, some offering remarkable competitive advantages over Ethereum. Investors must be cautious and actively do their research to keep up-to-date with the market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOdGQ1ODlvYXZhc3k3LUdyb3d2RjlGSDlvQzZrZ05SNHdTcUxYZ1JqcUtfSHZBUkwtcGlheTRPSEZwOFhrRFBXbm8zS28xWS1lNVRONUc3WlJrSzY3T0F0dGdhLWFCX2VaV0JCTUt5UjFIZlNhRXFHNDhJdzNjMkltYVpfd0EzSnRMalN4ZFRodw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Fidelity Makes $4.7 Million Play on Ethereum ETF in SEC Filing - Coinfomania",
        "content": "The United States Securities and Exchanges Commission (SEC) Chairman, Jay Clayton revealed in a Monday interview with CNBC that there is now an increased chance of seeing a Bitcoin exchange-traded fund (ETF) go live for U.S investors soon.\n\nClayton made the revelation while answering questions regarding how far crypto market participants seeking the listing of a Bitcoin ETF have satisfied concerns expressed by the SEC regarding such a product.\n\n“Yes, but there’s work left to be done,” said Clayton who had in the past mentioned perceived market price manipulation on unregulated exchanges and unreliable custody as the primary reasons why the SEC hasn’t blessed any of the Bitcoin ETF proposals it has received so far.\n\nOnce again, the SEC Chairman highlighted those concerns as tough questions, before saying,\n\n“Now, progress is being made, but people needed to answer those hard questions for us to be comfortable that this was the appropriate type of product.”\n\nUndoubtedly, the latest comments made by the SEC Chairman raises hopes that there is yet a possibility of seeing the first Bitcoin ETF launch later this year or at least sooner than many had envisaged.\n\nAs Coinfomania reported last month, the SEC must now rule on whether or not to approve proposed rule changes to list Bitcoin ETFs submitted by Bitwise and VanEck/SolidX. These filings were published in the federal register in February kickstarting a 240-day waiting period for a final decision by the SEC.\n\nHowever, the regulator has delayed deciding on three occasions and must now rule on October 13, 2019, whether or not to approve the Bitwise ETF application, and make a similar decision regarding the VanEck/SolidX on October 18, 2019.\n\nIt is also vital to note that there is a possibility that the SEC decides against approving the current proposals [with only roughly a month remaining] since Clayton also mentioned that “there’s work left to be done.”"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNdGVoYVdIQVFucUZrRDhiQnV1UmM5TVdQWW82SDFRQzBYRHNFOTBaMlA0bGpiRGhuZFV0QU5ieTRveXg5T0h3b0c4ZnZfb2Q5YWt5bmFQRUpYSmI4TnR4emN0X203YnZNYU5QUXdLX2VtaUxqM005R0pfOVVMcDZhVE4tRUlFeHVMY0tvQUFCbC1KNEZYYS1SY0RoYm9BbEc5Zm11RUx5eTZldw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "The Top 5 Most Profitable Cryptos to Mine ft. BlockDAG, Ethereum, Kaspa, Dash and Zcash - BSC News",
        "content": "PROMO\n\nDiscover the top 5 profitable cryptos to mine, featuring BlockDAG, Ethereum, Kaspa, Dash, and Zcash. Learn how to maximize your mining returns.\n\nDespite many new cryptos opting to follow a proof-of-stake model, mining remains a lucrative endeavour for those looking to generate digital assets. With the right equipment and knowledge, miners can achieve substantial returns.\n\nThis article highlights the top 5 most profitable cryptocurrencies to mine, with a special emphasis on BlockDAG, a project that is revolutionizing the mining landscape.\n\n1. BlockDAG (BDAG): Innovating Crypto Mining\n\nBlockDAG has significantly advanced in the crypto-mining sector with its novel BlockDAG X1 app. This app, lauded for its operational efficiency and simplicity, is revolutionizing how mobile cryptocurrency mining is conducted. Currently available in beta on both iOS and Android, the app provides a straightforward mining interface for every user. Its sophisticated consensus algorithm ensures mining remains energy-efficient, optimizing battery and data consumption.\n\nThe BlockDAG X1 app is designed to be extremely user-friendly, featuring simple sign-up, an innovative referral program, and incentives for daily usage. By engaging regularly or bringing in new users, one can enhance their mining rates. Noteworthy events in global tech centers like Shibuya, Las Vegas, and Piccadilly Circus have showcased BlockDAG’s tech prowess, attracting substantial investor interest.\n\nBlockDAG's cloud mining solution offers a hassle-free mining experience, eliminating the need for physical hardware. It allows the customization of mining contracts to suit individual investment goals, enabling users to harness the power of distant data centers for potential profits. Features like minimal entry requirements, reduced operational complexities, and flexible contract terms enrich the cloud mining experience. Through its mobile apps, users can effortlessly mine from home, bypassing the need for elaborate setups. This positions BlockDAG as a leader in the mining industry, known for its seamless and accessible mining solutions.\n\nAdditionally, BlockDAG caters to those looking to significantly boost their daily BDAG coin production with a line of high-capacity mining rigs. The beginner-friendly X10 miner, with its compact design, can churn out up to 200 BDAG coins daily. For more ambitious miners, the X30 rig produces 600 BDAG coins daily and is capable of mining Bitcoin and Kaspa. The flagship X100 rig, tailored for the most serious miners, offers a massive daily output of 2,000 BDAG coins, with a 2 TH/s hash rate and efficient 1800W power usage, all while keeping noise levels low.\n\n2. Ethereum (ETH): The DeFi Powerhouse\n\nEthereum, the second-largest cryptocurrency by market capitalization, remains a profitable option for miners. Despite transitioning from Proof-of-Work (PoW) to Proof-of-Stake (PoS) with Ethereum 2.0, mining ETH is still viable through Ethereum Classic (ETC), which retains the PoW consensus mechanism. Miners can use GPUs to mine Ethereum Classic efficiently. With its widespread use in decentralized finance (DeFi) and smart contracts, Ethereum continues to be a valuable asset in the crypto-mining community.\n\n3. Kaspa (KAS): The Fast and Scalable Network\n\nKaspa is an innovative cryptocurrency that utilizes a unique Proof-of-Work consensus mechanism called GHOSTDAG. This technology enables high transaction speeds and scalability, making Kaspa an attractive option for miners. Kaspa’s mining algorithm, kHeavyHash, is optimized for GPU mining, making it accessible for a wide range of miners. The network’s efficiency and low transaction fees enhance its profitability, positioning Kaspa as a noteworthy contender in the crypto mining space.\n\n4. Dash (DASH): The Privacy-Centric Coin\n\nDash is a privacy-focused cryptocurrency that offers features like PrivateSend and InstantSend, which enhance transaction privacy and speed. Dash uses the X11 algorithm, which is compatible with both ASIC and GPU mining. Its unique Masternode network provides additional revenue opportunities for miners. The combination of transaction privacy, speed, and robust mining infrastructure makes Dash a profitable option for crypto miners looking for a versatile and secure digital asset.\n\n5. Zcash (ZEC): The Shielded Transaction Pioneer\n\nZcash is renowned for its strong focus on privacy and security. Utilizing the Equihash algorithm, Zcash can be mined using GPUs. The cryptocurrency's shielded transactions ensure that user information and transaction details remain private. Zcash’s emphasis on privacy has made it a popular choice among miners and users who prioritize confidentiality. The profitability of mining Zcash is bolstered by its robust privacy features and ongoing developments within the network.\n\nThe Most Profitable Crypto to Mine\n\nAs we explore the top 5 most profitable cryptocurrencies to mine, BlockDAG stands out with its innovative approach to mobile and cloud mining. Its user-friendly apps, energy-efficient consensus algorithm, and high-capacity mining rigs offer a comprehensive solution for miners.\n\nWhile Ethereum, Kaspa, Dash, and Zcash also present profitable opportunities, BlockDAG’s unique technology and recent advancements position it as a leader in the crypto-mining industry. Investors and miners should keep a close eye on BlockDAG as they seek to maximize their returns in the ever-evolving world of cryptocurrency mining.\n\nJoin BlockDAG Presale Now:\n\nWebsite | Presale | Telegram | Discord"
    }
]