[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4cUQ4bDB3ZHhsXzF1cWlGRExiWlZrMDctMTBZZ2gtcTNFcUFpQUZsbzU3Y1U0cWtpQ2R2Mmp3R0hxUUk2WDRkQll3cmZkcUJoVUhoRlVlczVndkZvUXZpYTBjRXRFdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency Explained With Pros and Cons for Investment - Investopedia",
        "content": "What Is Cryptocurrency?\n\nA cryptocurrency is a digital or virtual currency secured by cryptography, which makes it nearly impossible to counterfeit or double-spend. Most cryptocurrencies exist on decentralized networks using blockchain technology—a distributed ledger enforced by a disparate network of computers.\n\nA defining feature of cryptocurrencies is that they are generally not issued by any central authority, rendering them theoretically immune to government interference or manipulation.\n\nKey Takeaways A cryptocurrency is a form of digital asset based on a network that is distributed across a large number of computers. This decentralized structure allows them to exist outside the control of governments and central authorities.\n\nSome experts believe blockchain and related technologies will disrupt many industries, including finance and law.\n\nThe advantages of cryptocurrencies include cheaper and faster money transfers and decentralized systems that do not collapse at a single point of failure.\n\nThe disadvantages of cryptocurrencies include their price volatility, high energy consumption for mining activities, and use in criminal activities.\n\nInvestopedia / Tara Anand\n\nUnderstanding Cryptocurrency\n\nCryptocurrencies are digital or virtual currencies underpinned by cryptographic systems. They enable secure online payments without the use of third-party intermediaries. \"Crypto\" refers to the various encryption algorithms and cryptographic techniques that safeguard these entries, such as elliptical curve encryption, public-private key pairs, and hashing functions.\n\nCentral to the appeal and functionality of Bitcoin and other cryptocurrencies is blockchain technology. As its name indicates, a blockchain is essentially a set of connected blocks of information on an online ledger. Each block contains a set of transactions that have been independently verified by each validator on a network.\n\nEvery new block generated must be verified before being confirmed, making it almost impossible to forge transaction histories. The contents of the online ledger must be agreed upon by a network of individual nodes, or computers that maintain the ledger.\n\nExperts say that blockchain technology can serve multiple industries, supply chains, and processes such as online voting and crowdfunding. Financial institutions such as JPMorgan Chase & Co. (JPM) are using blockchain technology to lower transaction costs by streamlining payment processing.\n\nTypes of Cryptocurrency\n\nMany cryptocurrencies were created to facilitate work done on the blockchain they are built on. For example, Ethereum's ether was designed to be used as payment for validating transactions and opening blocks. When the blockchain transitioned to proof-of-stake in September 2022, ether (ETH) inherited an additional duty as the blockchain's staking mechanism. The XRP Ledger Foundation's XRP is designed for financial institutions to facilitate transfers between different geographies.\n\nBecause there are so many cryptocurrencies on the market, it's important to understand the types. Knowing whether the coin you're looking at has a purpose can help you decide whether it is worth investing in—a cryptocurrency with a purpose is likely to be less risky than one that doesn't have a use.\n\nMost of the time, when you hear about cryptocurrency types, you hear the coin's name. However, coin names differ from coin types. Here are some of the types you'll find with some of the names of tokens in that category:\n\nUtility : XRP and ETH are two examples of utility tokens. They serve specific functions on their respective blockchains.\n\n: XRP and ETH are two examples of utility tokens. They serve specific functions on their respective blockchains. Transactional : Tokens designed to be used as a payment method. Bitcoin is the most well-known of these.\n\n: Tokens designed to be used as a payment method. Bitcoin is the most well-known of these. Governance : These tokens represent voting or other rights on a blockchain, such as Uniswap.\n\n: These tokens represent voting or other rights on a blockchain, such as Uniswap. Platform : These tokens support applications built to use a blockchain, such as Solana.\n\n: These tokens support applications built to use a blockchain, such as Solana. Security tokens: Tokens representing ownership of an asset, such as a stock that has been tokenized (value transferred to the blockchain). MS Token is an example of a securitized token. If you can find one of these for sale, you can gain partial ownership of the Millennium Sapphire.\n\nIf you find a cryptocurrency that doesn't fall into one of these categories, you've found a new category or something that needs to be investigated to be sure it's legitimate.\n\nHow to Buy Cryptocurrency\n\nIf you want to use cryptocurrency to buy products and services, you will need to visit a cryptocurrency exchange. These are businesses that allow you to buy or sell cryptocurrencies from other users at the current market price, similar to a stock. After buying the coins, you will need to transfer them to a digital wallet or use a third-party service like Coinbase to store your coins.\n\nIf you only want to buy cryptocurrency as an investment, you may be able to do so through your brokerage. For example, Robinhood allows users to invest in bitcoin and other cryptocurrencies, although you cannot withdraw them from the platform for purchases. In addition, there are several crypto ETFs that provide exposure to the crypto asset class without requiring the investors to maintain their own wallets. For instance, as of May 2024, investors may choose to hold Bitcoin futures ETF shares. The SEC has also approved the listing and trading of Ether spot shares.\n\n\n\nIs Cryptocurrency Legal?\n\nFiat currencies derive their authority from the government or monetary authorities. For example, the U.S. dollar is recognized and issued by the government as the official currency of the United States and is \"legal tender.\"\n\nBut cryptocurrencies are not issued by any public or private entities. Therefore, it has been difficult to make a case for their legal status in different financial jurisdictions throughout the world. It doesn't help matters that cryptocurrencies have primarily functioned outside most existing financial infrastructure.\n\nIn the U.S.\n\nThe legal status of cryptocurrencies creates implications for their use in daily transactions and trading. In June 2019, the Financial Action Task Force (FATF) recommended that wire transfers of cryptocurrencies should be subject to the requirements of its Travel Rule, which requires AML compliance.\n\nAlthough cryptocurrencies are considered a form of money, the Internal Revenue Service (IRS) treats them as financial assets or property for tax purposes. And, as with most other investments, if you reap capital gains selling or trading cryptocurrencies, the government wants a piece of the profits. How exactly the IRS taxes digital assets—either as capital gains or ordinary income—depends on how long the taxpayer held the cryptocurrency and how they used it.\n\nIn the United States in July 2023, courts ruled that cryptocurrencies are considered securities when purchased by institutional buyers but not by retail investors purchased on exchanges.\n\nEnthusiasts called it a victory for crypto; however, crypto exchanges are regulated by the SEC, as are coin offerings or sales to institutional investors. So, crypto is legal in the U.S., but regulatory agencies are slowly gaining ground in the industry.\n\nAs of June 2024, El Salvador is the only country to accept Bitcoin as legal tender for monetary transactions. In the rest of the world, cryptocurrency regulation varies by jurisdiction.\n\nIn Asia\n\nJapan's Payment Services Act defines Bitcoin as legal property. Cryptocurrency exchanges operating in the country are required to collect information about the customer and details relating to the wire transfer.\n\nChina has banned cryptocurrency exchanges, transactions, and mining within its borders, but has a Central Bank Digital Currency (CBDC).\n\nIndia was reported to be formulating a framework for cryptocurrencies, but until it is enacted, crypto is not yet illegal. Exchanges are free to offer cryptocurrencies.\n\nIn Europe\n\nCryptocurrencies are legal in the European Union. Derivatives and other products that use cryptocurrencies must qualify as \"financial instruments.\" In June 2023, the European Commission's Markets in Crypto-Assets (MiCA) regulation went into effect. This law sets safeguards and establishes rules for companies or vendors providing financial services using cryptocurrencies.\n\nIs Cryptocurrency a Safe Investment?\n\nCryptocurrencies have attracted a reputation as unstable investments due to high investor losses from scams, hacks, bugs, and volatility. Although the underlying cryptography and blockchain are generally secure, the technical complexity of using and storing crypto assets can be a significant hazard to new users.\n\nIn addition to the market risks associated with speculative assets, cryptocurrency investors should be aware of the following risks:\n\nUser risk : Unlike traditional finance, there is no way to reverse or cancel a cryptocurrency transaction after it has already been sent. By some estimates, about one-fifth of all bitcoins are now inaccessible due to lost passwords or incorrect sending addresses.\n\n: Unlike traditional finance, there is no way to reverse or cancel a cryptocurrency transaction after it has already been sent. By some estimates, about one-fifth of all bitcoins are now inaccessible due to lost passwords or incorrect sending addresses. Regulatory risks : The regulatory status of some cryptocurrencies is still unclear in many areas, with some governments seeking to regulate them as securities, currencies, or both. A sudden regulatory crackdown could make it challenging to sell cryptocurrencies or cause a market-wide price drop.\n\n: The regulatory status of some cryptocurrencies is still unclear in many areas, with some governments seeking to regulate them as securities, currencies, or both. A sudden regulatory crackdown could make it challenging to sell cryptocurrencies or cause a market-wide price drop. Counterparty risks : Many investors and merchants rely on exchanges or other custodians to store their cryptocurrency. Theft or loss by one of these third parties could result in losing one's entire investment.\n\n: Many investors and merchants rely on exchanges or other custodians to store their cryptocurrency. Theft or loss by one of these third parties could result in losing one's entire investment. Management risks : Due to the lack of coherent regulations, there are few protections against deceptive or unethical management practices. Many investors have lost large sums to management teams that failed to deliver a product.\n\n: Due to the lack of coherent regulations, there are few protections against deceptive or unethical management practices. Many investors have lost large sums to management teams that failed to deliver a product. Programming risks : Many investment and lending platforms use automated smart contracts to control the movement of user deposits. An investor using one of these platforms assumes the risk that a bug or exploit in these programs could cause them to lose their investment.\n\n: Many investment and lending platforms use automated smart contracts to control the movement of user deposits. An investor using one of these platforms assumes the risk that a bug or exploit in these programs could cause them to lose their investment. Market Manipulation: Market manipulation remains a substantial problem in cryptocurrency, with influential people, organizations, and exchanges acting unethically.\n\nDespite these risks, cryptocurrencies have seen a significant price leap, with the total market capitalization rising to about $2.4 trillion. Despite the asset's speculative nature, some have created substantial fortunes by taking on the risk of investing in early-stage cryptocurrencies.\n\nAdvantages and Disadvantages of Cryptocurrency\n\nCryptocurrencies were introduced with the intent to revolutionize financial infrastructure. As with every revolution, however, there are tradeoffs involved. At the current stage of development for cryptocurrencies, there are many differences between the theoretical ideal of a decentralized system with cryptocurrencies and its practical implementation.\n\nAdvantages Removes single points of failure\n\nEasier to transfer funds between parties\n\nRemoves third parties\n\nCan be used to generate returns\n\nRemittances are streamlined Disadvantages Transactions are pseudonymous\n\nPseudonymity allows for criminal uses\n\nHave become highly centralized\n\nExpensive to participate in a network and earn\n\nOff-chain security issues\n\nPrices are very volatile\n\n\n\nAdvantages Explained\n\nCryptocurrencies represent a new, decentralized paradigm for money. In this system, centralized intermediaries, such as banks and monetary institutions, are not necessary to enforce trust and police transactions between two parties. Thus, a system with cryptocurrencies eliminates the possibility of a single point of failure—such as a large financial institution setting off a cascade of global crises, such as the one triggered in 2008 by the failure of large investment banks in the U.S.\n\nCryptocurrencies promise to make transferring funds directly between two parties easier without needing a trusted third party like a bank or a credit card company. Such decentralized transfers are secured by the use of public keys and private keys and different forms of incentive systems, such as proof of work or proof of stake.\n\nBecause they do not use third-party intermediaries, cryptocurrency transfers between two transacting parties can be faster than standard money transfers. Flash loans in decentralized finance are an excellent example of such decentralized transfers. These loans, which are processed without requiring collateral, can be executed within seconds and are mostly used in trading.\n\nThe remittance economy is testing one of cryptocurrency's most prominent use cases. Cryptocurrencies such as Bitcoin serve as intermediate currencies to streamline money transfers across borders. Thus, a fiat currency is converted to Bitcoin (or another cryptocurrency), transferred across borders, and subsequently converted to the destination fiat currency without third-party involvement.\n\nDisadvantages Explained\n\nThough they claim to be an anonymous form of transaction, cryptocurrencies are pseudonymous. They leave a digital trail that agencies like the Federal Bureau of Investigation (FBI) can follow. This opens up the possibility for governments, authorities, and others to track financial transactions.\n\nCryptocurrencies have become a popular tool with criminals for nefarious activities such as money laundering and illicit purchases. The case of Dread Pirate Roberts, who ran a marketplace to sell drugs on the dark web, is already well known. Cryptocurrencies have also become a favorite of hackers who use them for ransomware activities.\n\nIn theory, cryptocurrencies are meant to be decentralized, their wealth distributed between many parties on a blockchain. Ownership is becoming more concentrated, as witnessed by companies purchasing and holding them for price appreciation and investment fund managers buying them to hold in their funds.\n\nOne of the conceits of cryptocurrencies is that anyone can mine them using a computer with an Internet connection. However, mining popular cryptocurrencies requires considerable energy, sometimes as much energy as entire countries consume. The expensive energy costs and the unpredictability of mining have concentrated mining among large firms whose revenues run into billions of dollars.\n\nOnly 61 (1%) of the 4,568 Bitcoin blocks opened from May 15, 2024, to June 15, 2024, were opened by unknown addresses. The other 99% were opened by mining pools.\n\nThough cryptocurrency blockchains are highly secure, off-chain crypto-related key storage repositories, such as exchanges and wallets, can be hacked. Many cryptocurrency exchanges and wallets have been hacked over the years, sometimes resulting in the theft of millions of dollars in coins.\n\nCryptocurrencies traded in public markets suffer from price volatility, so investments require accurate price monitoring. For example, Bitcoin has experienced rapid surges and crashes in its value, climbing to nearly $65,000 in November 2021 before dropping to just over $20,000 a year and a half later. Bitcoin prices had roared back by mid-2024. As a result of this vast range of volatility, many people consider cryptocurrencies a speculative bubble.\n\nIs Crypto Actually a Good Investment? Crypto can be a good investment for someone who enjoys speculating and can financially tolerate losing everything invested. However, it is not a wise investment for someone seeking to grow their retirement portfolio or for placing savings into it for growth.\n\nIs Crypto Real Money? One definition of money is something that is generally accepted as a medium of exchange, a measure or store of value, and a unit of account. By this definition, cryptocurrency is real money.\n\nHow Does Crypto Make You Money? There are several ways cryptocurrency can make money for you. Decentralized finance applications let you loan your crypto with interest; you can stake a compatible one on a blockchain or at certain exchanges for rewards, or you can hold on to it and hope its market value increases. None of these methods are guaranteed to make money, but many people have benefitted from them.\n\nThe Bottom Line\n\nCryptocurrencies are digital assets that are secured by cryptography. As a relatively new technology, they are highly speculative, and it is important to understand the risks involved before investing.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9ReGFPQno5Wnp5bFJOUzYzeV9GYWdiOUpoZ1JBUXE1VUhLUHlCQVVsMWhhazZURGJ1dkRRRExfWHpRZ0R5a2M2cXkxOFU4VmNzTlhHZlEyRVA1cHg4SkdOTGZ1YXZFUmx0MktaZFdMdGJFX3M0UTkyTnZnTFVOdEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum a Millionaire Maker? - The Motley Fool",
        "content": "Ethereum still has upside potential. But does it have enough to make you a millionaire?\n\nThere's no denying that Ethereum (ETH -4.16%) has been one of the best crypto investments of the past decade. At its current price of $3,500, Ethereum is up more than 10,000-fold from its initial price of just $0.31. As a result, an investment of just $100 in 2015 would have likely been enough to make you a crypto millionaire today.\n\nBut we're moving into Ethereum's second decade now, and it's no longer a slam-dunk certainty that you can become a crypto millionaire by investing at today's prices. If you are thinking about investing in it for that purpose, here are three important questions to ask yourself.\n\n1. Does Ethereum still have 1,000x upside?\n\nLet's assume for a moment that you have $1,000 to invest in Ethereum right now. For that initial investment to grow to $1 million, it would need to increase in value 1,000-fold. A decade ago, that was certainly possible. But what about today?\n\nRemember: In 2015, Ethereum had the all-important first-mover advantage. It was literally the first smart-contract blockchain platform, and that opened up all kinds of new opportunities that even Bitcoin (BTC -2.10%) couldn't match.\n\nSo Ethereum went on to create, define, and control entire sectors of the blockchain world. From decentralized finance (DeFi) to blockchain gaming and non-fungible tokens (NFTs), it was not just the first to market. It was also best to market.\n\nUnfortunately, Ethereum no longer has the first-mover advantage. There are plenty of new challengers, and plenty of blockchains that can offer exactly what it can offer, if not more. So it only makes sense that the explosive growth that characterized the early years of Ethereum might no longer be possible. That's bad news if you're expecting 1,000x upside.\n\n2. How long can Ethereum remain the market leader?\n\nThere are now three direct Ethereum challengers -- Solana (SOL -4.76%), Avalanche (AVAX -6.54%), and Cardano (ADA -4.85%) -- that rank among the top 15 cryptocurrencies in market cap.\n\nThe appearance of these new challengers means that Ethereum's dominant market share in the various niches is slowly being eroded. So even if it is able to create entirely new blockchain niches (as it has for the past decade), the share of the market it will capture will likely continue to shrink over time.\n\nOf even more concern, some of these blockchain rivals are being viewed by investors as potential \"Ethereum killers.\" This poses a clear existential threat.\n\nWhen it comes to choosing blockchains, users and developers have a choice. And if the new Ethereum rivals continue to claim much higher speeds, enhanced throughput capacity, and lower fees, which blockchains do you think users are going to choose?\n\n3. What will be the effect of the new ETFs?\n\nLastly, there's the question of just how much of a lift the new spot Ethereum exchange-traded funds (ETFs) are going to provide. Just about everyone agrees that there was much more demand and hype for the new spot Bitcoin ETFs.\n\nThe spot Bitcoin ETFs have pulled in more than $30 billion in customer funds. However, JPMorgan Chase thinks that the new spot Ethereum ETFs will pull in only $3 billion.\n\nAs a result, the spot Ethereum ETFs are likely to be much less impactful than many people think. If you're expecting the price of the crypto to soar as soon as these new ETFs start trading, you might be disappointed.\n\nSetting realistic expectations\n\nThis might be tough to acknowledge, but Ethereum might only have 10x upside over the foreseeable future. And even that could be too optimistic. Given its current market cap of just over $400 billion, a 10-fold increase in value would imply a new market cap of $4 trillion. That's significantly more than Nvidia, which now has a lofty $3 trillion market value.\n\nA $4 trillion valuation might have been possible back when Ethereum had a clear economic moat to keep away potential challengers. But the barbarians are now at the gate, and some of them are crossing the drawbridge.\n\nFor that reason, I'm unconvinced that Ethereum is still a millionaire maker. Unfortunately, if you are really serious about becoming a millionaire, you might need to find \"the next Ethereum\" -- an undiscovered crypto with 1,000x upside that you can buy for mere pennies. And that, as we all know, is a lot harder to do than it sounds."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQeDlwajFYX2RxTEQ4TVhKV1FnYnVKbFRqM2E1WnJBNWZTaHpCWUdZcTNNR3g2OUNBcEpaUHhTaW1vR3dUc0dLblQyRmo5QXBiVUEtMjlSRVhOYXhRd1hDZV9EWXNfSk5SS0ZpdTlLQjE0LXhaY2VJb2d6S1R6SHQtRzJUY0hNc2ItTnc5WDdjNWN1WXN1aFo2d1pQVHI2UVRaYzhGRTJaWTBzckZWLXBfZExwZlNJUVV0bEF2aWViS3doeE1pLXFGVVhaMW5oT2pUOEdXX1FtTF9lVk41TUFxTzAtRlN3ZnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Biggest News in Crypto This Week: Michael Saylor Buys more BTC | Ethereum ETFs Launch | Paradigm to Invest $850M - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9GNHFBV19JYmFkMWRnNmtXbXpoWEN5T2twYnpOV2ZhNXBLY0tEZ21uMUsyRXR1X2QzMU9rcVZLX0pJcGxOaHV3Vm9MRkROUnJQcjllTTB4SVgtX19fMlpxd0Z1aUFaNlV2Zm9zY0RGYk15MzVnb1RnZmFzQjBLZ2PSAYQBQVVfeXFMTUp3eDRuMHJRT3ozeDg5em5ZQ2pwNGdUdTNOQUdWa295emNRQzliTGJFXzU0SXo3LVJXM3ByWVJUbGJScXVtcjlpQzFlTXUwcGUyT1hnN2JQUGhMWmZDQ0RnNFp2Z2tjV2EyZWliY1c1Q1lpX20xbGpMNG5Ccm1fdVFHbFYz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs May Be Approved by July 2, Top Expert Reveals - U.Today",
        "content": "The approval of Ethereum ETFs could be just around the corner, with top experts suggesting a possible date of July 2. As reported by U.Today recently, SEC boss Gary Gensler hinted that the agency could approve S-1 forms for spot exchange-traded funds on major altcoins \"sometime this summer.\"\n\nAdvertisement\n\nThe SEC has already taken steps to allow the listing and trading of eight Ethereum ETFs by approving rule changes. However, S-1 registration forms, which contain detailed information about the products, are still needed before they can go live. The SEC asked issuers for updated S-1 forms in late May, indicating that the process is still moving forward.\n\nEric Balchunas, senior ETF analyst for Bloomberg, has predicted that the regulator could approve these forms by July 2. He noted that SEC staff recently sent issuers minor comments on the forms and asked for responses within a week. The expert believes there is a good chance the commission will finalize its decision before Independence Day weekend, making July 2 a likely date for approval.\n\nAdvertisement\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nNate Geraci, another ETF analyst, also sees this as a positive sign, suggesting that there is not much left to do before final approval.\n\nThe potential approval of Ethereum ETFs may become a pivotal event for the crypto market as it could open up new investment opportunities and drive further adoption of digital assets. While the SEC nears its final decision, the community is watching closely, anticipating the impact on both institutional and retail investors."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNNEEzTjdkeWZOS0ZIeENWdWxhUDZFTTZyQzV2Vnl3dE1UYTVNNkp6cnVXdlBCaEZpeDl4dzJfcXFvbDk5YmQzMEpJSXh4OGFnLTBmMXhnUmtVWGRUTVEtaHgyNWtpZjgxUDhCNWNnU1BxcjgyVGtTVnduQnhBNzM2enZlam5fZXBEQzU0bFFYQnVaRGRETjNybHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Updates Spot Ethereum ETF Launch Date - Crypto Times",
        "content": "The anticipated launch of a spot Ethereum ETF is getting closer. According to analyst Eric Balchunas from Bloomberg, the estimated launch date has now been set to July 2, 2024.\n\nThis updated timeline comes after the Securities and Exchange Commission (SEC) staff provided feedback on the applications (called S-1 filings) submitted by companies seeking to launch Ether ETFs. Balchunas reports that the SEC’s comments were relatively minor, requiring only a few changes to be made within a week.\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\n“Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend,” Balchunas said, suggesting the SEC wants to finalize the approval process quickly.\n\nThe launch date aligns with SEC Chair Gary Gensler’s recent statement that Ether ETF approvals could happen “by the end of this summer.”\n\nEther ETFs are expected to provide institutional investors with a regulated means of investing in Ethereum, thereby potentially increasing its market activity and affecting its prices.\n\nThis development comes after Bitcoin-based ETFs successfully launched earlier this year and have already begun influencing market trends."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOX2tod0liTmk4WFR6OTRiSXRmMDlldjNGanVmajdBU2cwM3p0RXlYeVRUUDRaWEZFSEFNQXA2b2pPdHRVRHduRTVWQWNXbnBEcGwyd3B4ejc2MG41TTZrMWFEbTJ6SjN4VGJGLWN3WmZwWHFkdDQxS1lhdUVvUkw4N2w4bVdNd3lZWmQ5YXg1TEpKYmUxSEo2R1ZRWHJrcFJ0aVFBV245VFZyUUtVLWYyYUx2MlNLYWpLSTNLQmo4NDlIY2g3MGVLRC1TRzdVQnpjejh3ZG1HQXZvcjTSAeABQVVfeXFMTnRWZzRFRnhkcXhnWTJ5VmNqNHZwZjhtT0VHSkhSczhieEZMWVdWekRvUXNycHpibXRSRkY0NVB0V2l2UXM1emp4clZGeWJjU1FycGd1T1NtYWNyQTd3bC1MN05FZFd5WXJsNXRudWNPN2lITGlZZ0xRc0EzZjV4VkJaWDJ5N3JiZHNQZlBfMjg3S29Id1JKVXgzNkl5eGNpcDljZTc0VERwY203YjhlR2hCMFg4VTU4Q1d3Ym54UzE3dmdTUnhxM3VvYVlEV2wxU2stYmV6ektQNF9RbHdYd1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Tailwind: How the SEC ETF approval boosted Memecoin mania - The Economic Times",
        "content": "Why the Ethereum ETF Effect?\n\nA Look at Key Ethereum Memecoins\n\nLong-Term Impact: A Speculative Future\n\n\n\nInstitutional Interest: A Long Road?\n\n\n\nMemecoins: Flavour of the season\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bitcoin ETF, particularly BlackRock 's IBIT, has been the fastest-growing ETF to date, reaching $20 billion in just 137 days. In comparison, the next closest, JEPI, took nearly 1,000 days to achieve the same milestone. Now that the money men have tasted blood, and Ethereum spot ETFs to be listed, there are some interesting developments in the crypto market.While the primary impact is directly on Ethereum, there's been a fascinating secondary effect – a surge in the valuations of memecoins built on the Ethereum blockchain. Let's understand how this development is impacting the memecoin landscape and what it means for the future.Memecoins, often known for their viral appeal and sometimes questionable utility, have seen significant price boosts following the Ethereum ETF announcement. Notable memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) experienced double-digit percentage gains, while lesser-known tokens like Floki Inu (FLOKI) and Dogelon Mars (ELON) skyrocketed by even higher margins.Several factors contribute to this phenomenon. The approval of an Ethereum ETF signifies growing mainstream acceptance of cryptocurrencies. This is also a major development in the industry after the Bitcoin ETF approval which witnessed large volumes of institutional money inflows. This can attract new investors, particularly those with a risk appetite who might explore memecoins as a volatile yet potentially high-reward entry point into the Ethereum ecosystem.The ETF reinforces confidence in Ethereum as a blockchain among users which partially translates to interest and enthusiasm in memecoins built on Ethereum. Compared to memecoins on alternative blockchains like Solana, Ethereum's established developer community, network security, and scalability efforts (like Ethereum 2.0) provide a perceived edge.: One of the OG memecoins, thanks to Elon Musk’s endorsement, DOGE has seen renewed interest. While its utility remains debatable, its brand recognition and loyal community stand to benefit from the Ethereum ETF tailwind.: Known as the \"Dogecoin Killer,\" SHIB has also enjoyed a price increase. Its efforts to build a decentralised ecosystem with its SHIB token, Shibarium Layer 2 blockchain and LEASH governance token might attract investors seeking a more feature-rich memecoin experience within the Ethereum network.: Inspired by Elon Musk's dog of the same name, FLOKI positions itself as a memecoin supporting various charitable causes. The Ethereum ETF effect, coupled with FLOKI's community based initiatives, could attract impact-driven investors seeking memecoin exposure.: This space-themed memecoin, referencing Elon Musk's Mars ambitions, has seen significant gains. While its long-term viability remains to be seen, current market sentiment favours this token as a part of the overall market gains.The long-term impact of the Ethereum ETF on memecoins remains a grey area. While the current surge suggests renewed interest, memecoins are inherently volatile and prone to market corrections. Their long-term success hinges on developing real utility beyond mere hype, something that could be achieved by clear community guidelines and consensus, and of course a concrete regulatory framework.The Ethereum ETF approval gives Ethereum-based memecoins a temporary advantage over those on Solana. While Solana offers faster transaction speeds and lower fees, Ethereum's established reputation and developer base currently hold more sway in market sentiment. However, as market dynamics evolve and Solana continues to develop, this advantage could shift.Apart from reputation risk and uncertainty, institutional interest in memecoins isn't completely unfathomable. Despite their volatility, some memecoins boast massive market capitalizations and active communities. Institutions might see a potential for controlled exposure to capture some of this growth. A small allocation of memecoins could serve as a diversification tool in their broader portfolio. Some memecoins are exploring ways to develop utility, such as integrating with decentralised finance (DeFi) protocols or play-to-earn gaming platforms. This could attract institutions seeking exposure to these emerging trends. If memecoins gain wider mainstream acceptance like in the gaming community or other metaverse projects, and demonstrate long-term stability, institutional attitudes could shift.In May alone, 455,000 tokens were launched on Solana. During the same month, 177,000 tokens were introduced on Base, while Optimism and Arbitrum each saw the launch of 20,000 new tokens. Most of them were memecoins. Virtually everyone understands that investing in meme coins is gambling. In a casino, one is gambling against the house, everyone knows the house always wins. Many people view the stock market in a similar light, which is why GameStop and 'Roaring Kitty' gained traction—because it felt like someone was sticking it to the house. However, people recognize that the house always wins. Meme coins, on the other hand, offer a different dynamic. They provide a sense of peer-to-peer competition rather than betting against the house. It's more about competing with fellow enthusiasts, which is a more exciting and less disheartening game. The PVP (player versus player) nature of it gives people a sense of having a chance. These activities are not controlled by Wall Street suits, which adds to their appeal. It's a way of rebelling against a system perceived as rigged against the average investor.The SEC 's approval of the Ethereum ETF has had an unexpected but fascinating consequence – a resurgence in Ethereum-based memecoins. While the long-term viability of these tokens is uncertain, the current market sentiment favours established blockchains like Ethereum. This, along with the potential influx of new investors, has created a short-term boost for these memecoins. However, for the enthusiasm to continue, these tokens will need to evolve beyond mere internet hype and demonstrate tangible utility."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNZDM1SmJaV19VVlFKcGd6d0hXRGVJWnRDby1ZNFhBaGc0T1oxdFRoRVE0dEtnTWpFU3VVbE12aWlxM3RYekd6VHhLcGdiNnE4MkFaZTBUNlFPRmFqQWVKSjM1WG1wbFFSSFdVWGFObmpmRHFCR0R4TUg4VG10MWo1LW5GT0JyNkFZb3pINmlTZEc3blBDaUluMFRHdzVsOEZHaW5PcUN4dkt4NUJ2NFdCUUk3dDhqUdIBuwFBVV95cUxQak5aX296Q1J3YVVPUV9pdTgxMTNBbWpmTGVqWEtHZFJUeHJEeFdtb24wMDZTeHJ6NDh4R3BEaXlIdWd4SVZYRGZVLVJoeHVnV0QtLVZGSkN1WXVIZzhuUWh2Vm1QZlAyaEZOclM4YlNGLUtPVmtCQlBYMmN2cHYzeEMtc01vR3JwVVFRMExMT2NpdnM2QjdnUjZjTEpzZkFwczhmRGp2bWxUcVg2eEF5alkwb3ZCMXhTX1pZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Gains BlackRock’s Favor Over Permissioned Blockchains – ETH Price to Rally? - Crypto News Flash",
        "content": "Ethereum (ETH) is tipped for a bullish run following the recent shift of BlackRock towards permissionless blockchain.\n\nBlackRock recently launched its first tokenization project on the Ethereum blockchain.\n\nThe longstanding argument between a non-restrictive, permissionless distributed ledger system and its permissioned counterpart crept into a panel discussion at Coinbase’s State of Crypto Summit 2024 on June 13, 2024. Here, Ethereum’s permissionless blockchain seemed to have emerged at the top with Samara Cohen, the Chief Investment Officer of BlackRock for ETF and Index Investments, narrating the evolution of this technology from years back.\n\nAccording to her, private permissioned blockchains were expected to lead a few years back, however, public blockchains have defied all odds to take the lead in the ecosystem. Interestingly, experts have concluded after a broader consultation and observation that open source platforms like Ethereum are mostly preferred to avoid fragmenting liquidity and ensure wider and more efficient market participation.\n\nBlackRock Takes Action Towards Permissionless Blockchain\n\nSamara Cohen’s recent remark comes soon after BlackRock launched its first tokenization project on the Ethereum blockchain. In collaboration with a US-based firm Securitize, BlackRock tokenized the “Institutional Digital Liquidity” fund, bringing an initial liquidity of $100 million. Our investigation shows that the fund primarily invests in cash, short-term debt securities, and US Treasury bonds while leveraging Ethereum’s architecture to facilitate its operation.\n\nBlackrock CIO of ETF & Index Investments @Samaraepcohen said today at the Coinbase event that permissioned blockchains have lost, & that traditional market participants are coalescing around open-source #Ethereum for tokenization, so as not to fragment liquidity 👍 — matthew sigel, recovering CFA (@matthew_sigel) June 13, 2024\n\nIn line with the presentation of BlackRock’s CIO, Hunter Horsley, CEO of Bitwise has confirmed that BlackRock has embarked on a remarkable shift towards public blockchain. Speaking on this, Horsley stated that there is no debate as permissionless blockchain currently stands tall among permissioned distributed ledger systems.\n\nExperts Speak on the Impact of BlackRock’s Remark on Ethereum\n\nAccording to Anthony Sassano, a renowned angel investor, advisor and founder of The Daily Gwei, Ethereum is obviously the future as confirmed by BlackRock. To him, this could trigger a bullish reaction and send ETH to a new height.\n\nSeriously read and digest this. An executive at BlackRock (the largest asset manager in the world) is telling you that the future is public blockchains – specifically, that the future is Ethereum! If this doesn’t make you bullish, nothing will.\n\nOur review of the State of Crypto Summit 2024 took notice of the insights of key figures such as “Sandy Kaul, Senior Vice President at Franklin Templeton, and Alesia Haas, CFO of Coinbase.” Per their discussion, the year 2024 was underscored as pivotal for the crucial integration of cryptos and Traditional Financial (TradFi) via Exchange Traded Funds (ETFs) and the tokenization of assets.\n\nAlso, it was agreed that integrating blockchain technology into mainstream financial practices has encouraged the acceptance of platforms that provide transparency, accessibility, and governance.\n\nIn reaction to this development direction, analysts expect the ETH price to surge with Analyst Michaël van de Poppe predicting the market to explode with the expectation of Ether ETF going live in early July as reported by Crypto News Flash.\n\nEthereum has corrected in the past three weeks, but slowly but surely, the momentum toward listing the Ethereum ETF will start to emerge. The expectation is that the ETF will go live in July. I’m betting on the ETH ecosystem and it holds a crucial support level.\n\nAt press time, ETH was trading at $3,531 after surging by 0.28% in the last 24 hours and declining by 4.4% in the last seven days.\n\nRecommended for you:"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPRVZOTllNM0lvcTltM0pmMlZSZjl2SndlS1I3aTZ2b3VrMmRoNUxtamNYY3RhLVdKb0lpV3M2TjNsT2pHcGExNHp1dVBEUjJtNmtWam5wZVFhazVfVElwdWNuNGxfTE5rbE82YmNOUHZ2LUZJbzN5dUp1VFJVenhDT2pHM0tsZmJmTDBnajAyY3gtUFB2SEZ0RzNTMEhiSVZRT3fSAaoBQVVfeXFMTzFIWmtXd3BBb3NGU0M2WmNRMDFlYlVpQ3pBR0JCY0JFSmMwcTlsSXVRM0k4bzlLSEtBNDMyMVZfREVLX0xfRkxYeTQ2Rzg3dFVTXzJoZW5XbmlmQmVCTjBoY2RYM3ZpZU9zSUpkd3JIS0c0QjVzYVF2ZDFyQzF0M0NzY0dWRUE1dU5zUEhEZnBuUzJwaEF1VFl2ODVnZHl6MU1ON0dIdnJkRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "‘Wall Street Is Greedy’: Tether Co-Founder Predicts Next ETFs After Bitcoin, Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDon’t expect crypto ETF momentum to slow after the approvals of spot Bitcoin and Ethereum funds in the United States: Wall Street's “greed” will bring more and more such products, Tether and WAX co-founder William Quigley told Decrypt this week.\n\nQuigley predicted a proliferation of ETFs for other leading cryptocurrencies like Solana and Cardano, driven by Wall Street's relentless pursuit of profit.\n\n“Wall Street is greedy,” he said. “Every time Wall Street packages a new product to sell to consumers, if that product is successful, you can guarantee there will be copycats. There would be no ETFs if the Bitcoin ETF had failed.”\n\nHe added that Wall Street loves the “next hot new thing” because it’s something it can talk to its consumers about and sell their products. But should the momentum eventually cool, Quigley expects that ETF providers will shift focus to the next big trend.\n\nAD\n\nAD\n\n“We will continue to see new ETFs launching until there's a big pullback,” he added. “Then, you’ll see some of those ETFs shut down by the firms who launched them due to lack of demand.”\n\nThe SEC’s long-awaited approval of spot Bitcoin ETFs in the U.S. in January marked a significant milestone in integrating cryptocurrencies into mainstream financial markets. They allow investors to gain exposure to Bitcoin without directly holding the cryptocurrency, thus providing a more accessible and regulated investment vehicle.\n\nThis approval sparked significant interest and investment inflows, highlighting the growing acceptance and institutional interest in digital assets.\n\nThe success of the Bitcoin ETF has paved the way for further crypto-related financial products, and the market has been keenly awaiting similar developments for other such products.\n\nAD\n\nAD\n\nThe anticipation for Ethereum ETFs has been particularly high, especially following the positive signals from regulatory authorities. The funds received initial approval in late May, but will not start trading until funds’ S-1 registration forms are approved.\n\nSEC Chairman Gary Gensler on Thursday indicated that the approval process for Ethereum ETFs might be completed by the end of the summer.\n\n“Individual issuers are still working through the registration process that's working smoothly, and I envision sometime over the course of the summer,” Gensler said during a Senate hearing Thursday.\n\nTradFi butts in\n\nDespite the added mainstream attention coming with ETFs, Quigley expressed dissatisfaction with the increasing involvement of traditional finance in the crypto space.\n\n\"I was happy with crypto without Wall Street,” he said. “Would it be smaller? Of course. But I didn't feel the need to keep growing the size of crypto now.”\n\nHe warned that Wall Street's aggressive marketing of crypto products could lead to significant risks, especially if institutional investors pull out during market downturns.\n\nDespite his reservations about Wall Street's involvement, Quigley acknowledged that a significant capital influx is essential for substantial market growth.\n\n\"If you want a massive amount of capital, then yes, you have to do things like ETFs,\" he conceded.\n\nAD\n\nAD\n\nWhile ETF hype was partially credited with Bitcoin hitting a new all-time high price above $73,700 in March, alongside anticipation for April’s quadrennial halving event, BTC has yet to seriously challenge that mark again in the months since—and is down this week at a current price of just under $67,000.\n\nBut Bitcoin’s price typically climbs six months or more after the halving, which constrains the expanding supply, as the impacts of that event start to be felt. Quigley believes that historical patterns will continue along that path as well.\n\n\"It can't go higher because it's not the right time,\" he said, predicting a significant price increase ahead.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNYkxITms2eUpadVVVZWdMc1o4TlMtQ25HYktibm1GcXBYNHBSQTFKcGs0UTh3SGZfNUFkWTNPcWhkU0ZncEYzMllBSFkwZ3JGTC1uaVB5S29UTk5jZnZ0Zk1FblBLMUpVX2NCUnR2ZzMwbGxhTGtRSmVuU0xiemwxOEt6UGFnYmZVcUMtdlFNSmgzYjBUZ2hoUjBVa3FSY3hWalJYc2pFTjnSAa4BQVVfeXFMTWl0cWVPU3k1dVJ6aTQ1QjVOaFcwaml0ajhNX25Cd3RMd2JRcGlqZExVQ1EzY2sxMGFSTnFZdk9QZ2M1cDJaLTdDZ3RQU1pZSzlOSWY2ZXJGc1hRRm5IcG1OWV82ck50Y1hnUGxDeEdPLVd0QWpyYm1fOUIwbjFfLWFKOUx0em1xYXV0RGpDbXVKYmx5V0NDQXVob2Q5ZGE5dm16STB3T2JRcVN3N3FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Good News for Ethereum (ETH) ETFs in the US, But With a Catch: Bloomberg’s Balchunas - CryptoPotato",
        "content": "After the US Securities and Exchange Commission made history earlier this year by approving almost a dozen spot Bitcoin ETFs, all eyes in the community turned to the next digital asset in line – Ethereum.\n\nWhile the landscape didn’t look promising at first, it changed several weeks ago when, somewhat surprisingly, the agency greenlighted eight spot Ethereum ETFs. However, the launch date is still unknown.\n\nWhen the spot BTC ETFs were approved by the securities regulator, they went live for trading on the very next day, which caused tons of volatility but has been among the most bullish developments in the industries ever since.\n\nThe situation with the Ether ETFs is quite different. Although they have been technically approved, there are some irregularities with most S-1 filings and the question of whether they will allow staking, which is a major part of the Ethereum ecosystem. This is why the launch date remains a mystery.\n\nAccording to Eric Balchunas, Bloomberg’s ETF expert, there’s some good news on that front, as the Commission’s staff has recently made only minor comments to the S-1 applications.\n\nHe believes there’s a good chance the documentation will be handled within the next ten days or so, so they could “get it off their plate” before the July 4 US holiday. In other words, Balchunas suggested that the Ethereum ETFs could see the light of day by July 2.\n\nNote: our previous over/under was July 4th so this isn’t major shift but 1) we startted to feel like it would take longer so this is kinda good news and b) we basically decide the over/under on where are most torn 50-50 on where to bet and July 2nd is that date right now. — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nRecall that BTC’s price went on a massive rollercoaster in the first few days after the launch of the ETFs. Since then, though, these financial vehicles have attracted billions of dollars and propelled a price surge toward a new all-time high for the underlying asset.\n\nETH also saw impressive gains ahead of the ETF approvals, but there will likely be lots of fluctuations once they go live for trading."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNNHlYd1VsdkEyUFNVOVY1ZTJEOGNES3BPdWgwNE5UXzRmZEgwVVFZTWl0aHM1dDY0NEw2ekZWeTAyRjFPUFJKRHg0d21VeXRNVXBtcXlqdFFhMW9qUlRMX3lULWJvdVRmM0l4THJLQ09kNWRnMkpabjJMQ0hUcVZOOGVzYWprVVBuLUxMcmVWb2dpNExPYWViUGVvMHExd2RfbWdNRjc0UDZXZDRFSVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum powered by BlackRock: A €100 million alliance that changes everything - Cointribune EN",
        "content": "Sat 15 Jun 2024 ▪ 3 min read ▪ by Ariela R.\n\nThe world of traditional finance is in the midst of a transformation with BlackRock’s decision to favor public blockchains, especially Ethereum, for its blockchain-based financial products. This major shift marks a turning point in the adoption of public blockchains. It also opens the door to a deeper integration of this technology into the workings of financial markets.\n\nPublic blockchains, particularly Ethereum, represent the future (Source: Twitter)\n\nBlackRock and public blockchains: a new direction\n\nUntil now, BlackRock tended to favor private blockchains. However, experience has shown that public blockchains, like Ethereum, offer significant advantages in terms of transparency, accessibility, and governance.\n\nTransparency on Ethereum\n\nTransactions on Ethereum are visible to everyone, allowing investors to track capital flows in real-time and ensure the proper execution of operations. This increased transparency is essential for:\n\nstrengthening trust in blockchain-based financial products,\n\nattracting a broader audience of investors.\n\nAccessibility\n\nPublic blockchains (like Ethereum) are open to everyone. This allows anyone to participate in the network and interact with decentralized applications (dApps) built on them. This open accessibility fosters innovation and the creation of new financial products.\n\nGovernance\n\nEthereum and all other public blockchains are managed in a decentralized manner.\n\nExplanation: users have a say in the development and evolution of the platform. This participatory governance promotes accountability.\n\nBlackRock’s first tokenization project on Ethereum\n\nTo solidify its commitment to public blockchains, BlackRock launched its first tokenization project on the Ethereum blockchain.\n\nThis project involves converting a traditional investment fund, “Institutional Digital Liquidity,” into digital tokens based on Ethereum. These digital tokens, denominated in USD Coin (USDC), provide investors with transparent and secure access to portfolio diversification.\n\nBlackRock’s decision to adopt Ethereum is a strong signal of the growing maturity of the cryptocurrency market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPSmZwT3BOVzQ5QXJObm5idkp1d2RINlY2NnpOT0ptaTh0MTNlX1RIbE5SNE5fdXJlam5sUjRxTTJoSVdGQ1JvNUhJYjYxVWxVRG80Y2VTbHowOHcwSVpFa2NRWkQ5S3pPMUZXMXZ6dWVQT0RuWUxfejhwdVF5cThPdm5RaklsQdIBiwFBVV95cUxQb1FkZGRkbTB3RHQtdVRaVDBpeVNaQXVHR1V4ek1sWWhzaDViOTVJNVZXbWtHeFVfM3FCbUZiMlhuZ1IyeDZYU05WcGFRak9vbUFCN2JNc0VlMHYxci10MmdudFFhQjg0bm13TEN2TkFCQlh6M1I1QV8zRHNFeEtDVkx6SVFOQUFkampZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Hints Major Reversal as Whales Buy 700,000 ETH Amid Market Dip - CoinGape",
        "content": "The first half of June was notably bearish for the crypto market as Bitcoin price hit a low of $65000 amid several unfavorable updates. The FUD surrounding macroeconomic development, Bitcoin miners capitulating, the ETFs outflow, and whale distribution combined to fuel the recent correction in the majority of major cryptocurrencies including Ether. The Ethereum price dropped to a three-week low of $3362 on Friday but has now witnessed an ease in selling pressure amis stable the weekend.\n\nAlso Read: Crypto Headlines of The Week: Bitcoin & ETH Ride Rollercoaster, XRP & LUNC Make Waves\n\n\n\nadvertisement\n\nSEC’s Potential ETF Approval and Whale Investments Boost Ethereum Price\n\nDuring the recent market downturn, Ethereum formed a new lower high at the $3950 resistance level on the daily chart. The coin buyers failed to surpass the last high indicating an initial shift in market sentiment where traders prefer to sell on bullish bounces.\n\nOn June 14th, the coin’s price peaked at $3,887 before experiencing a significant drop of 13.5%, bringing it down to a low of $3,364. This price level coincides with the 100-day EMA, which has now begun to stabilize the declining Ethereum price, aiding its recovery to $3,509. Concurrently, the market capitalization has increased to $431.2 billion.\n\nThis surge is likely triggered by SEC Chair Gary Gensler’s recent statement to lawmakers, suggesting that the agency could finalize the approvals for listing and trading spot ETH exchange-traded funds (ETFs) over the summer.\n\nMoreover, in a recent tweet, renowned trader Ali (@ali_charts) highlighted a significant trend in the Ethereum market. According to his analysis, Ethereum whales have made substantial investments over the past three weeks, purchasing more than 700,000 ETH, which amounts to approximately $2.45 billion.\n\n#Ethereum whales have bought over 700,000 $ETH in the past three weeks, totaling approximately $2.45 billion! pic.twitter.com/sfmXnkqD49 — Ali (@ali_charts) June 15, 2024\n\nThis notable accumulation by large holders despite the ongoing correction indicates strong confidence for the Ethereum price to rebound.\n\nAlso Read: Ethereum Permanent Holders Scoop 298K ETH In A Day, ETH Price Rally Soon?\n\nIf the broader market correction persists, the ETH price may dive to $3200 and seek support from the long-coming support trendline. As per the past record, the Ethereum coin rebound thrice from dynamic support indicates a high accumulation for investors.\n\nThat said, the daily chart indicates a new resistance trendline forming above, suggesting that Ethereum might enter a sideways trading pattern. A breakout above this barrier is needed for buyers to regain control, and bolster a rally to $3900.\n\n\n\nTechnical Indicator:\n\nExponential Moving Average (EMA): The 100-and-200-day EMAs as dynamic support preventing ETH price from a major correction\n\nMACD: A bearish crossover between the MACD (blue) and signal (orange) indicates a seller as the key driving force behind the current price movement.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5qZ1NTajZjTTlGNTZxdHlBc2dhQXpIcGN5cEY3YVRsT0Q5TW1RQS1HcG5IVlNCdkcwLWdGOVFBa1hwMlF3emd0REFfeWdmMzNaSlZSaDJTZmx1ZHNubElDVnhmN0dGRkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Fhenix raises $15 million Series A to bring confidentially to the Ethereum blockchain - CTech",
        "content": "Fhenix, which develops confidentiality-enabling Layer 2 blockchain powered by fully homomorphic encryption, has announced the close of a $15 million series A fundraising round led by Hack VC with participation from Dao5, Amber Group, Primitive, GSR, Collider and Stake Capital, among others. This brings the project’s total funding to date to $22 million. The company plans to use these funds to support the initial stage of its open testnet, dubbed Helium, which will enable developers to deploy smart contracts to the Fhenix network for the first time.\n\nFully homomorphic encryption (FHE) is a novel form of cryptography that allows data to be computed blindly without ever needing to be decrypted. Fhenix is the first blockchain to natively integrate FHE in order to deliver an EVM-compatible smart contract platform that allows developers to encrypt all or part of their Solidity-based applications using familiar tools without any prior knowledge of FHE encryption.\n\n1 View gallery Blockchain. ( Photo: Shutterstock )\n\n\"My life's work has been research into secure computation with the goal of bringing confidentiality onchain. After exploring every available technical solution to this problem I came to the conclusion FHE is the best possible solution. The launch of the Fhenix testnet is an important step towards bringing encrypted computation onchain,\" said Guy Zyskind, co-founder of Fhenix.\n\nFhenix recently announced a technical partnership with EigenLayer around the development of FHE Coprocessors, which enable host chains–whether that be Ethereum itself, L2s, or L3s–to offload specific computational tasks to a designated processor, enabling developers on any EVM-compatible chain to integrate encrypted computation into their application logic."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNV2Q3UExtaWY2X0V3LWhNTmlpRE9LUF82NWszSXRmdS1xS1JicnIwQVlvb3RkUnV3TUhsTk5vMHJiRWY0SnQzUFJaZ3lzNXV0MUZsSk1HRTZOZEJuQkduVDdCVV9EcDlHN0lHSU5Nd2MxME5kMXJrSjJ1ckFXekRKZ2Nn0gGHAUFVX3lxTFAtcHc3MGNTZFFmMEZjMGdPV0l5bFdKVWdXU05GNm1NNENqWXYtd2RPUW9qM1M3QnBwWXZ4dDhOeTFkWXdTOG05MVlraVM1SjBIS1lpcDU1NHExOTV2X1Z2NU12QXg1Rkt4OG9GclQwejRFVXBTV0o5QUVDdjcxLXpzd2FYbWd6cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "114 Billion PEPE Trader's Surprising Ethereum Shift; Here's Why - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a dramatic turn of events, a PEPE trader has capitulated, selling all of his 114.7 billion PEPE tokens for 366.5 ETH, worth approximately $1.27 million.\n\nAdvertisement\n\nAccording to Lookonchain, the trader initially purchased the 114.7 billion PEPE tokens on May 14 and May 15 for $0.000011 per token, totaling $1.27 million.\n\nThis entry point seemed promising as the PEPE was gaining traction and attracting considerable interest within the crypto market. PEPE would later surge to all-time highs of $0.00001718 about 14 days later.\n\nThis $PEPE trader capitulated and sold all 114.7B $PEPE for 366.5 $ETH($1.27M) at a breakeven price.\n\n\n\nHe bought 114.7B $PEPE($1.27M) at $0.000011 on May 14 and May 15.\n\n\n\nThe price of $PEPE broke through $0.000017 on May 27, at which time his profit was $670K(+50%), but he did not… pic.twitter.com/aPxuftE1yI — Lookonchain (@lookonchain) June 15, 2024\n\nOn May 27, the price of PEPE surged, breaking through the $0.000017 mark. At this peak, the trader's holdings were valued at $1.94 million, presenting a potential profit of $670,000, or 50% gains. Despite the substantial gain, the trader chose not to sell, possibly holding onto the tokens in anticipation of further price increases, which proved costly.\n\nHowever, the market took an unfavorable turn as PEPE's price began to decline. The downward trend continued, and the value of PEPE fell below the trader's breakeven point of $0.000011.\n\nFacing the sustained drop in PEPE's price, the trader ultimately decided to sell all 114.7 billion tokens. The sale was made at a breakeven price, yielding 366.5 ETH, nearly equivalent to his initial investment of $1.27 million.\n\nAlthough the trader did not incur a financial loss, the missed opportunity for a substantial profit underscores the significance of timing the market perfectly. More often than not, market timing has been found to significantly impact trading outcomes.\n\nAt the time of writing, PEPE had dropped 0.79% in the previous 24 hours to $0.00001204. The frog-themed cryptocurrency has slowly decreased since reaching an all-time high of $0.0000171 on May 27. PEPE struck a low of $0.00001057 in yesterday's trading session as profit-taking continued and the market saw a slump before rebounding rapidly."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQRFZFNGRvSS12RWs1a1VXTWRlSHlNTm9vMHRaVGJUZ1hHYks1ZHE2MkxFdVJrQzMzYk5HT0lIbHpVWHlyNC1jRjZlU3FrTldyc2NEMHZKTFd4WE9lbl9LS1U1Z2hKTS1PR0NPd2lYdFlqcGtHTmFsS3NjcjYwNnZVcndQdWI4Q0hZcFZrejZ5Vm9FWTQ5UWfSAZsBQVVfeXFMT2xIcUpFLVBsUmNvci1PSHFlOUx6ZVNhY2dHQzYzQkdOWWViMC04dllfa1V3VUtWNVFRcjMyRVVQNDM0RTlCdGxTdjNsMG40MHJCSmdwdHVRSlRmdHBPZGhHT0QydnhtSE5IWGZwQ3hJMDBoSEdHYklCTkI4UVMwNDl1OEtkRUZGTUZYNzhuTDlJMDNOMVY2NTQtU00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "$64.4 Million ETH Allegedly Withdrawn From Ethereum Foundation: What's Going On? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRecent reports by crypto journalist Colin Wu reveal a significant transaction involving Ethereum (ETH), worth $64.4 million. The funds were moved from an account previously associated with the Ethereum Foundation, identified as \"0x8e23,\" to a newly created address, \"0x8798.\"\n\nAdvertisement\n\nThe original transaction in which the Ethereum Foundation sent 44,167 ETH, then worth $40,930, to \"0x8e23,\" took place nine years ago on Nov. 20, 2015. As of now, this amount of Ethereum is equivalent to $154.58 million.\n\nThis is not the first time that one of the key entities associated with the major altcoin token may have sold its ETH. However, it is one of the largest in recent times, with previous recent cases not exceeding 100 ETH, or $350,000.\n\nAdvertisement\n\nAt one point, Vitalik Buterin, the founder of Ethereum, justified these sales with the need to cover the operating costs of the organization, or charity. Whether the possible sale of ETH worth tens of millions of dollars is justified by such a need remains a question.\n\nEthereum (ETH) price outlook\n\nMeanwhile, the price of the main altcoin continues to torment traders in the range of $3,400 to $3,900, and it still will not update its all-time high at $4,868.\n\nETH to USD by CoinMarketCap\n\nUncertainty is added by the low-liquidity summer market and confusion with the dates related to the approval of spot Ethereum ETFs. However, experts expect the situation to be resolved soon."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVGQzdEVuWkdoSHBGMzAtMjJNazhSZl9PNzlpRnFsM2dRWnlqekdKQU1tdW9FcUZEbXZQcW9PY0NZV2FYd25uNTczYVpvNWlVRjhBUzAtdjNBRkFuanFNSHB0VmJCbE5WOXJrZFpSX2lheUpUQzA1U0RGQ09IemFUQmdIajRldlZsb3A3cF9lNDc5bk9Iek5uSWJMamp0NnZOZUp6RHZzZEl1V0hiU09DUGt4eDNSdzY1SzR1ZW5ublNxYVlxak5Kbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "BlockDAG X1 Beta App Pioneers in Crypto Mining Amidst Ethereum vs Solana Rivalry and XRP Price Increase - FinanceFeeds",
        "content": "BlockDAG is making headlines with the launch of its X1 mobile mining app. As Ethereum and Solana battle for blockchain supremacy and XRP strives for a market recovery, BlockDAG is carving out its niche with innovative solutions that simplify and democratize crypto mining. The X1 app, designed for both iOS and Android, transforms any smartphone into a powerful, energy-efficient mining device. Its user-friendly features, including easy sign-up and rewarding referral systems, make it an attractive option for both new and experienced miners.\n\nEthereum vs Solana: A Battle for Supremacy in 2024?\n\nThe ongoing competition between Ethereum and Solana is intensifying, with both blockchains showing robust growth. Solana has recently eclipsed Ethereum in terms of active addresses and trading volume, boasting over one million active addresses and climbing, challenging Ethereum’s market dominance.\n\nAlthough Solana is advancing, Ethereum maintains a strong position due to its comprehensive security measures and network activity. Industry experts believe that Ethereum’s dedication to security and scalability will help it retain its leading role. As this rivalry deepens, the crypto community is eager to see which blockchain will lead beyond 2024.\n\nXRP’s Market Recovery Post-SEC Legal Battle\n\nXRP has encountered notable hurdles, particularly following the SEC’s lawsuit against Ripple, which caused it to fall from the third to the seventh position in digital asset rankings. Despite the ongoing legal battles providing some clarity, Ripple faces unresolved regulatory issues that continue to affect XRP’s market performance.\n\nCrypto enthusiast Bill Morgan pointed out that XRP is lagging behind its peers. For XRP to experience a price recovery, it needs to overcome these regulatory challenges and secure key support levels. The future of XRP is filled with uncertainties, leaving the community watching closely to see if it will regain its previous stature.\n\nRevolutionising Mobile Mining: BlockDAG’s X1 App\n\nBlockDAG’s X1 app is transforming the mobile mining landscape with state-of-the-art features that ensure efficiency and simplicity, positioning BlockDAG at the forefront of the crypto mining industry. The app provides an energy-efficient mining process that doesn’t drain mobile devices, making it ideal for novice and experienced miners.\n\nAvailable for iOS and Android users, the X1 app offers an intuitive mining experience, democratising cryptocurrency mining. The app also features an easy sign-up process, a unique referral system, and rewards for daily activity, allowing users to boost their mining rates by participating regularly or inviting others.\n\nBlockDAG has made a splash at major tech events in Shibuya, Las Vegas, and Piccadilly Circus, showcasing its technological advancements and drawing significant investor interest. Notable events, such as the keynote at Shibuya Crossing and displays in Las Vegas and London, have emphasised BlockDAG’s commitment to innovation and its global influence.\n\nThese showcases celebrated the launch of DAGpaper V2 and its listing on CoinMarketCap and enhanced the project’s visibility and credibility. With over $50.4 million raised in pre-sales, more than 11.4 billion BDAG coins distributed, and $3.2 million from miner sales, BlockDAG has cemented its status as a major contender in the crypto space.\n\nKey Takeaway\n\nBlockDAG’s X1 beta app, equipped with cutting-edge technology and user-friendly features, is reshaping the landscape of crypto mining. As Ethereum and Solana vie for dominance and XRP works through its legal dilemmas with hopes of a price rebound, BlockDAG continues to draw substantial investments, underscored by its $50.4 million pre-sale achievement.\n\nThe app’s seamless mining experience and strategic marketing in major global tech hubs position BlockDAG as a significant player in the cryptocurrency industry. For those looking to invest in the next big thing, bypassing traditional Bitcoin mining calculators and exploring BlockDAG’s X1 app offers a lucrative opportunity.\n\nInvest in the BlockDAG Presale Now:\n\nPresale: https://purchase.blockdag.network\n\nWebsite: https://blockdag.network\n\nTelegram: https://t.me/blockDAGnetwork\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nThe subject matter and the content of this article are solely the views of the author. FinanceFeeds does not bear any legal responsibility for the content of this article and they do not reflect the viewpoint of FinanceFeeds or its editorial staff.\n\nThe information on this page does not constitute advice or a recommendation on any course of action and does not take into account your personal circumstances, financial situation, or individual needs. We strongly recommend you seek independent professional advice or conduct your own independent research before acting upon any information contained herein."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPM0x6TE5tMWI3VER3SU5aVEdzcDlTTDFkVm1BTDdHNkZrc2FlWkVPZVJLbWU0TU9BOTdyLXQ5MGw3UnVjeU05R000R21MV0VDc3VTQl9uQ2JPdlV1VlNVYXQ5aF9YVWZjc1A3M2x0bU5ET1djQ0VLQ1dycUNFUjJHaGxDSHbSAYoBQVVfeXFMUE5WckQ5eUNKMjlPSjBQYkFGWm92N0dnQV9UdE1ibFN5UTVaRzJfdG9laGMwbGx6YXlZMGNER2s3dlVzTzdDWnVxMTl3Vi1pZDBIRlNXUU5zUUtqblFUMFM1OUt1Si05N0VjNTRLN2YtcWRicGJWdDA0Q2xQODQ0ZE0xa0p0WnR2S0J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Will the price of Ethereum grow as whale interest rises? - AMBCrypto News",
        "content": "Whale accumulation of ETH grew, according to recent data.\n\nNetwork growth and velocity of ETH fell materially.\n\nEthereum’s [ETH] recent dip in price did not reduce the optimism that traders and investors had in the slightest.\n\nEthereum whales start to buy\n\nRecent data showed that Ethereum whales, or large-scale investors, have accumulated over 700,000 ETH in the past three weeks, representing a total of approximately $2.45 billion.\n\nThis significant buying spree suggested that these whales believe in the long-term potential of Ethereum and view the recent price dip as a buying opportunity.\n\nTheir actions could be a sign of confidence in Ethereum’s future, potentially keeping the cryptocurrency’s price stable.\n\nAt press time, ETH was trading at $3,569.40. After slightly going below the $3,400 levels, the price of ETH bounced back, presumably due to the eagerness of the whales that accumulated ETH.\n\nEven though this uptick was significant, it wasn’t profound enough to break the bearish trend that was established by the price after the 27th of May.\n\nAfter the price exhibited the double top pattern during this period, the price of ETH witnessed multiple lower lows and lower highs.\n\nThe price of ETH would need significant bullish momentum for it to break out and reach new highs. Unfortunately for ETH, the CMF (Chaikin Money Flow) was observed to be declining.\n\nThis meant that the money flowing into ETH had decreased. A declining CMF paints a bearish picture for ETH’s future.\n\nIn contrast to the CMF, the RSI (Relative Strength Index) for ETH had grown materially over the last few days, indicating that the bullish momentum around ETH was rising.\n\nIf this bullish momentum continues to grow, ETH may test the $3,607.30 level again and weaken that resistance. Moreover, the possibility of a reversal would also grow, if this ends up happening.\n\nLooking at on-chain data\n\nAMBCrypto’s analysis of Santiment’s data revealed that the Network Growth for ETH had declined.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nThis meant that the number of new addresses showing interest in ETH had significantly fallen over the last few days. This indicated that new addresses weren’t willing to buy ETH even at the current discounted prices.\n\nMoreover, the velocity of ETH also fell, implying a decline in ETH trades, which is also not a positive sign."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQMmE0Z1VJQS1RdUZaOWVkWUk1TjhfYXBEOXN1VUlRWW9ySWNRejBoTm93ZjlWX1ZUREU2WXBTTGczNHJzT05fRXozWk13RHFqeXdxNVhJY3ZocW5XNmFOcXFtd05WeTc0MlZySkR1eGdOS1RRblJwTThjd0RZRDVEZE95Vjh2OS16aFlvSVlB0gGTAUFVX3lxTE9lSlBpU2diTFBhakhxR19aUXhSSHFEejNTUkpVYWV3R0FLdm9iQVplakZhNUlLWk9BTmU1RmhMLXNfemozUkdsU2theWstQlRrSnlFTlVoZzJhNGpraEdNVy0xZkpMTm4wU0o5cDdmSnJwV1J5Sno0MGJyX2YzTEpEd216cmszb3pJTjJyX0J5b2x0aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum & UNI Price Soars Amid $20M Accumulation, Rally To Sustain? - CoinGape",
        "content": "Ethereum and Uniswap prices have grabbed the crypto community’s attention with slight recoveries driven by significant accumulation from a wallet linked to Amber Group. Notably, the wallet’s substantial buy-up, totaling around $20 million, has sparked optimism about potential price movements and the broader implications for the market amid current volatility.\n\nSo, let’s take a look at the recent accumulation pattern and see the potential reasons that might keep the momentum consistent.\n\nadvertisement\n\nEthereum & Uniswap Price Soars Anticipation Amid $20M Accumulation\n\nA wallet related to Amber Group made waves in the cryptocurrency world by amassing $20 million worth of Ethereum and Uniswap. According to the on-chain transaction tracking platform Lookonchain, the wallet withdrew 987,053 UNI, valued at $10.6 million, and 2,638 ETH, worth $9.2 million, from Binance within just three hours today.\n\nMeanwhile, this large-scale accumulation has fueled a slight recovery in both Ethereum and Uniswap prices. Notably, the news has generated significant buzz among investors, eager to see if this momentum will be sustained in the face of a fluctuating market.\n\nMarket analysts suggest that this substantial purchase by a major player like Amber Group could indicate strong confidence in these assets’ future prospects. However, some caution that while such accumulation can trigger short-term price increases, the challenge lies in maintaining this upward trajectory.\n\nNotably, the broader market dynamics and ongoing volatility play a crucial role in determining whether these gains will hold.\n\nAlso Read: Shiba Inu, Chainlink, Ethereum Exchange Reserve Plunges, Price To Recover?\n\nWill The Rally Sustain?\n\nEthereum’s recent price recovery has been buoyed by expectations surrounding the U.S. Spot Ethereum ETF approval. The SEC has already accepted the 19b-4 filings for Ether ETF as of May 23. Besides, SEC Chair Gary Gensler has recently hinted that the approval for Ethereum Spot ETF could come by the end of summer, adding to market optimism.\n\nIn addition, a senior Bloomberg ETF analyst anticipates that the Spot Ethereum ETF might get approved around July 2. This potential timeline projection has further boosted Ethereum’s market confidence, making it a focal point for investors betting on its sustained growth.\n\nSuch regulatory advances are crucial, as they enhance Ethereum’s appeal to institutional investors, driving potential price support and long-term growth.\n\nOn the other hand, Uniswap has shown significant growth in its Layer 2 (L2) solutions. According to a recent X post from Uniswap Labs, the protocol’s all-time L2 volume has reached $300 billion.\n\nNotably, the timeline to reach each $100 billion milestone has accelerated dramatically:\n\n22 months for $100 billion.\n\n10 months for $200 billion.\n\n3 months to achieve $300 billion.\n\nThis rapid growth underscores increasing user adoption and heightened transaction volumes on Layer 2 (L2) platforms, reflecting a robust uptrend. Besides, this impressive growth trajectory has strengthened investor confidence in Uniswap’s continued expansion and the potential rise in demand for UNI tokens.\n\nAs of writing, Ethereum price soared 0.50% and exchanged hands at $3,533.98, with its trading volume soaring 13% to $16.13 billion. On the other hand, Uniswap price noted a surge of 1.91% to $10.96, while its volume soared more than 34% to $360.5 million.\n\nNotably, as of writing, Ethereum Futures Open Interest rose 2.59% to $15.80 billion, while Ethereum Options Open Interest surged 1.63% to $6.38 billion. Simultaneously, Uniswap Futures Open Interest rose 3.61% to $122.17 million.\n\nAlso Read:\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQX2NjZDBidTJkY25hMWVOdTVWclluM3V3ZXFTeXA1bjhQUUtnR1JqMk1zcTRkbkQ1dTlxalpvRmJnWHB1V1F1OUQ0MmJGOElTaXU2azdteU9aMFA2LW4yOGI4RGgwTTFFRnlDVmNITU1RSjhTbHViSE5haDgyb0twVEZKUmpMZ1NvM0lMRXFLZHNwRUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "3 Ethereum Crypto Losers of the Week: Should You Buy, Sell, or HODL? - CoinGape",
        "content": "With the global cryptocurrency market going through a volatile week with major price changes, investors must decide whether to buy, sell or hold (hodl). This article analyses three Ethereum tokens, Wormhole (W), Floki Inu (FLOKI), and Worldcoin (WLD), which have all seen significant losses during the week. This article will delve deep into details about these top Ethereum crypto losers.\n\n1. Wormhole (W)\n\nLosses: 34.74%\n\nadvertisement\n\nWormhole (W) has recorded 34.74% in losses for its investors in the past week, to trade at $0.4585 today. This price performance has resulted in a market cap of $826.01 million.\n\nExamining the EMA indicators shows a dominant selling sentiment, as both the Exponential Moving Average (EMA) and Simple Moving Average (SMA) indicate a downward trend in different time frames.\n\nThe bearish trend is supported by the MACD Level, which shows selling pressure with a negative value. Moreover, the RSI value indicates a neutral sentiment, suggest that W is neither overbought or oversold.\n\nFibonacci pivot points indicate that there is a level of support at $0.3116 and a level of resistance at $0.7879. Based on the current price, there is a notable gap to the closest support level, indicating possible additional decreases prior to a change in direction.\n\n2. Floki Inu (FLOKI)\n\nLosses: 28.52%\n\nRecording a market cap of $1.97 billion, Floki Inu (FLOKI) has experienced significant price fluctuations during the week. The value of FLOKI declined by 28.52% over the past week, to appear on the list of Ethereum crypto losers today, with a price of $0.0002061.\n\nThe technical analysis of the meme coin mainly a bearish sentiment, as both EMA and SMA indicators signal a downward trend.\n\nThe negative value of the MACD Level supports this belief by showing selling pressure. Additionally, the RSI reading indicates an oversold condition, potentially presenting a chance for investors to buy.\n\nFibonacci support level is at $0.0001608803 while the resistance level is at $0.0003310183. FLOKI is nearing its support level, indicating that it could potentially stabilize in the near future.\n\n3. Worldcoin (WLD)\n\nLosses: 21.77%\n\nWorldcoin (WLD) finalises the list of the top Ethereum crypto losers, trading at $3.49. This demonstrates a decline of 21.77% in its price over the past week, resulting into a market cap of $838.78 million .\n\nThe technical analysis shows mostly bearish sentiment, as both EMA and SMA indicators are signaling a downward trend.\n\nThe negative MACD Level reinforces this view by showing selling pressure. Moreover, the RSI value indicates that a potential buying opportunity could be nearing as the token nears oversold territory.\n\nFibonacci support can be seen at $0.3116 while resistance is located at $0.7879. A price closer to the support level indicates potential stabilization or recovery.\n\nFinal Thoughts\n\nThe recent market crash has resulted in significant opportunities and challenges in the crypto market, including these Ethereum crypto losers of the week. The strong bearish signals for Wormhole (W) indicate a recommendation to sell. Floki Inu (FLOKI) warrants a hold until more clearer signals become apparent due to its mixed indicators. Worldcoin (WLD) has the potential for a speculative buy despite its current downward trend, as it may rebound.\n\nInvestors must always assess their risk tolerance and do additional research prior to making any investment choices,. Keeping up-to-date and being adaptable are essential to successfully navigate the unpredictable crypto market."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNNWdtcmhPV2Y5SGJ5clM4YXNyVE9mTW1raERDZE5OU3ZMMGtIVjFVSk9taFp1NHNZRllGU1FHeW1KS09JQXp4NHBxcExZa2VfcGRTcTI0UGEtRGtpS1NYQUFzcWJqMkwtc1VCdGdLSGtod1diWmhFajY4ek9kWXZsYnpzd21DMU1YNmNpMXVZSk15Y3BJT1dQUm9iQlXSAaIBQVVfeXFMT1VVSUU3aWVGelgzZWdnckNuRWt2NjhPX2F5dEJwc1h3clJkaWhDazMwQ2doTWNub3JrRmp1Q3NWbXpjY2dhVWhFUm1wbVFvT3ZVY241Yi1FWDNaTmhpVjgzd205aVRaQ0I5T1pzR1VNRTZkRk94UWRuWnQ4RVRxbWY3R0NKLURRZ1BiYlAxdkxmWDJ5dlR6MVFpMXBKN0E4ZzZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum continue to see green as self custody rises and whales sell? - AMBCrypto News",
        "content": "Many Ethereum addresses withdrew their holdings on a considerable scale\n\nOverall interest from new addresses in ETH declined\n\nEthereum [ETH] recorded a major correction in price on the charts, despite the anticipation associated with spot ETH ETFs and their impending launch.\n\nEthereum self-custody on the rise\n\nIn fact, Santiment’s data revealed a shift in the distribution of Ethereum holdings. There’s a trend of users moving their ETH away from exchanges.\n\nOn the one hand, the top 100 exchange wallets recently dipped below their May 2018 all-time low. They are now currently holding only 8.41 million ETH – Implying a fall in the concentration of Ethereum on exchanges.\n\nOn the other hand, the top 100 non-exchange wallets were at an all-time high of 68.39 million ETH, signifying a rise in self-custody. This means that more users are now taking control of their own holdings by storing them in wallets they control directly, rather than keeping them on exchanges.\n\nIf this trend continues, it could help Ethereum’s claim to decentralization. A more distributed network, with less reliance on centralized exchanges, aligns with the core principles of blockchain technology.\n\nHowever, reduced liquidity on exchanges, caused by a decline in ETH holdings, could lead to higher price volatility for Ethereum. With fewer coins readily available for buying and selling, price swings could become more significant in response to market changes.\n\nEven though higher self-custody could be seen as a positive development, there are other concerning factors for ETH too. For instance, some large addresses have been selling a significant amount of their holdings, without accumulating.\n\nThis could impact ETH’s price negatively in the future.\n\nIt’s worth noting, however, that retail investors continue to show interest in ETH, despite the dip in price.\n\nRetail interest declines\n\nAnd yet, even though retail investors have been showing interest in ETH, it hasn’t been significant enough to move ETH’s price. Additionally, the network growth for ETH also declined over the past month.\n\nThis meant that the number of new addresses showing interest in ETH reduced. A declining network growth also means that the accumulation of ETH was being done by pre-existing holders.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, the velocity at which ETH was trading also fell over the last few days. Simply put, it implies that the frequency with which ETH was being traded declined significantly."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSGhUODZMVEwtb21wSWM3b0plbk9aeEQtMjV2YVpsZ09hRXMwTzRUdXZqOVdCM2pxRDVSZkJoOC10NVJhVUgwcVFaem9YRXVSeGk4WTQ2QWlIV0ZoQ3ZXTWhpZTdGSXN3cGMzaVJmanBmTzlXVzdvbGZPNlFrYTdHSEFqbU9Zd0lvMG0zakx2UdIBlAFBVV95cUxPWng4VlUwLTBGTjlVSkxtaFZmQ1Fna0ZiUE94REtxY185dGdqSkVBcWdzekpCRTdnaHM4blgtSHBpMFkzWkl6Yi1jWGZzSkxBemJEdU9DODVXOUJfaFVUcV9UM0VBVTJkX3lnMEN5X0M5Y3VocjByeXBSMDdiU0hkTktFWVd3VEpkUjdWLUFLdFdjeXI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs by 2 July? Analyst makes this bold prediction! - AMBCrypto News",
        "content": "Analyst’s remarks hinted at Ethereum ETFs possibly starting on 2 July\n\nBitcoin seems to be underperforming ahead of ETH ETF approval\n\nFollowing SEC Chair Gary Gensler’s promising remarks (“sometime over the course of this summer”) about the approval timeline for Ethereum [ETH] spot Exchange Traded Funds (ETFs), Bloomberg’s Senior Analyst Eric Balchunas is in the news today after he specified a potential start date.\n\nBalchunas prediction: Reality or no?\n\nAccording to Balchunas, Ether ETFs could potentially start trading in the United States as early as 2 July. He said,\n\n“We are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they’re pretty light, nothing major, asking for them back in a week.”\n\nThis news has sparked optimism within the cryptocurrency community, especially regarding Ethereum’s upcoming market opportunities.\n\nIn fact, the analyst also alluded to the fact that the aforementioned launch may be timed to align as closely as possible with 4 July, the United States’ Independence Day.\n\n“Decent chance they work to declare them effective the next week and get it off their plate bf holiday wknd. Anything poss but this is our best guess as of now.”\n\nBitcoin ETF vs. Ethereum ETF\n\nThe delay in approving ETH ETFs stands nowhere close to the lengthy journey of Bitcoin [BTC] ETFs’ approval process.\n\nAll the way back in July 2013, Cameron and Tyler Winklevoss, founders of the Gemini crypto exchange, filed their initial application with the SEC to establish a spot Bitcoin ETF.\n\nFast forward to January 2024, after nearly a decade of regulatory scrutiny and multiple applications, the SEC finally approved 11 Bitcoin ETFs.\n\nDrawing parallels between the approval processes of Bitcoin and Ethereum ETFs, it is noteworthy that after the BTC ETF’s approval, Ethereum saw a significant rally, rising by 9.1% while Bitcoin underperformed.\n\nAnd now, with the anticipation of the ETH ETF approval, Ethereum, the second-largest altcoin, stands out amidst a market downturn.\n\nAt the time of writing, Bitcoin and many other cryptocurrencies were flashing red candlesticks on their daily charts. On the contrary, Ethereum was in the green following a modest hike of just over 1%.\n\nAdditionally, according to a recent report by Farside Investors, spot BTC ETFs saw two consecutive days of outflows on 13 and 14 June, totaling $416.1 million.\n\nPopular analyst Willy Woo pitched in to comment too. He stated,\n\nFuture remains uncertain\n\nOverall, while the dynamics are consistently changing across the crypto market, it is still too early to definitively conclude whether investors are moving away from Bitcoin towards Ethereum.\n\nWorth noting, however, that AMBCrypto’s analysis of Santiment revealed that the social dominance metrics for both ETH and BTC were moving north. Despite this, the Relative Strength Index (RSI) remained flat, indicating no clear signs of either bullish or bearish momentum."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOby1TampIamFtZ002UjVoZ3pVMnhQSHFDYm9mVGhCSlhoZWc4S3YwcTRwMGN2T05KOVROZGJ3dFlCQ2doZ1Z0UkpHSFRBWUFrdENfcHJDMHo3NG00NVJxTWFWbVlpRjBXXzhvM2JiaVphbTJrT2VWaE5DZ2U1N3hWMU0tWk5Famo2dEHSAY8BQVVfeXFMTnVVbGN0Q2dYWkxqcFNZOHBGeG4tS1RRMmkyTnR6UnE0SDBQXzA4ME5rbUFmLWs0Zmt1VGdKaVVRVXc2bVBmanpCZkdVUTJHcFFDUWJkRnN2aHdjbmozclZfU3FLcE11dkVVNk1RbUs3VGZFOXl2SzNtY2JxeTVNN1l3OXZOM0hsX2lwZkRzZTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Why 298,000 ETH tokens were bought in just 24 hours - AMBCrypto News",
        "content": "Ethereum experiences its second-largest buying day, with long-term holders accumulating significantly.\n\nMarket indicators show mixed signals, with decreases in open interest and exchange reserves hitting an eight-year low.\n\nEthereum [ETH], the second-largest cryptocurrency by market capitalization, has recently exhibited some interesting market movements.\n\nDespite an 8% decline over the past week, Ethereum saw a slight uptick of 0.3% in the last 24 hours, bringing its current trading price to $3,519.\n\nThis minor increase comes during a period of overall market uncertainty, particularly following the approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission in May.\n\nLong-term holders capitalize on market dips\n\nAmid these price adjustments, Ethereum has experienced a significant surge in long-term holder accumulation. According to Julio Moreno, CryptoQuant’s head of research, Ethereum just witnessed its second-largest buying day by long-term holders.\n\nOn June 12, about 298,000 Ethereum tokens, valued at approximately $1.34 billion, were purchased by these steadfast investors, capitalizing on a slight 2% price dip within the same 24-hour period.\n\nThis noteworthy accumulation was not far off from the record set on 11th September, 2023, when 317,000 Ether tokens were acquired as prices dipped below $1,600.\n\nThis pattern of strategic buying during price drops highlights the confidence long-term investors have in Ethereum’s value.\n\nFurthermore, this trend corresponds with an increase in large transactions over $100,000, as shown in IntoTheBlock data, where such transactions rose from below 4,000 earlier in the week to over 6,000\n\nThis indicates active accumulation by whales regardless of the prevailing market conditions.\n\nMarket caution and technical outlook\n\nHowever, contrasting this bullish accumulation activity, Ethereum’s market metrics such as open interest and trading volume present a more subdued outlook.\n\nOpen interest in Ethereum has decreased by nearly 2% to $15.41 billion, while trading volume saw a significant decline of 25.77%, now standing at $24.19 billion. These metrics suggest a cautious stance among some market participants, potentially anticipating further price adjustments.\n\nOn the technical front, Ethereum’s inability to surpass its March highs has activated a sell setup on its daily chart, hinting at possible continued downward pressure.\n\nHowever, a shorter-term perspective from the 4-hour chart suggests there might be a temporary rise to around $3,800, potentially providing liquidity for an ongoing downtrend.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIn another vital aspect of market dynamics, the amount of Ethereum held on exchanges has hit an eight-year low, as noted by AMBCrypto.\n\nThis reduction in exchange-held Ethereum, coupled with the launch of spot ETFs, may lead to a significant supply shock, which could, in turn, trigger a sharp price increase."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFByTm8wNmQzQWhaZnhwRGVMMk5qUV8yV1B2UzREU21fUWNtWGNtcUFaSXk0SjZUZlJubmh5SGdKcGlsR2FTSW9KSWFOenJYRGRKRGtZMTFleDhvWFdZS1dV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "What Is ZKsync (ZK): Ethereum Scalability With Zero Security Compromises - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5zSmtaTmFQb2std25QaVhnNVVtMDFMMnNPTTlxMmtPZHZ1Y1BSM3hiOTNsY0s3cUxrcWRqa0xUdVZOLWUzdk15MkpnalFoVlA5RU5FeTFGNVNYUXV60gFiQVVfeXFMT2RaRXVQdGFLWGVmZkRfWG95bll0NmNRaFE4d0U0Q0dTcGIxU3QyNnV3RTNlMnRTREJJdjNWY255QUJLaFk0bWZlOEZXOGxmZmJBVW9QMDZ6ajBDbTRIeW4tQUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Cardano Founder Reveals The Crypto Project That Almost Overshadowed Ethereum | Bitcoinist.com - Bitcoinist",
        "content": "Cardano (ADA) founder Charles Hoskinson recently revealed the crypto project that almost overshadowed Ethereum (ETH) during its early stages. This revelation followed Hoskinson’s remarks about his greatest fear while he was the Chief Executive Officer (CEO) of Ethereum.\n\nThe Crypto Project That Almost Overshadowed Ethereum\n\nIn an interview with Altcoin Daily, Hoskinson mentioned NXT as the crypto project that could have displaced Ethereum while it was still in its early stages. He claimed that NXT scared him the most among other cryptocurrencies while he was still the Ethereum CEO between 2013 and 2014.\n\nHe further explained that he was scared of the crypto project because it came out of nowhere and achieved impressive growth in under three months. He noted that NXT was built on Java and had an “incredibly engaged community.” Hoskinson added that NXT was also adding features to its product offering and had user-driven assets.\n\nInterestingly, NXT was already on proof-of-stake then (while Ethereum was still running a proof-of-work mechanism) and had made plans to implement smart contracts on their network. The Cardano founder sounded intrigued by the NXT’s growth as he mentioned how they were “running” and going “so fast.” However, things didn’t end well for NXT, with Hoskinson mentioning what he believes led to the project’s downfall.\n\nHoskinson claimed that their token distribution wasn’t so good, although he quickly added that that could have been fixed. The Cardano founder mentioned that the more “important” thing that “killed” the project was that they didn’t have a good governance system, which caused the team to fracture and break out into several other new projects.\n\nHoskinson remarked that Ethereum “wouldn’t exist” if NXT had the right governance system, as the latter would have been “number one” and had just continued to grow immensely. He added that NXT would have absorbed everybody and was a “sexy project” because it was new and had an interesting technology.\n\nGovernance Matters A Lot\n\nHaving explained what led to NXT’s downfall, Hoskinson further highlighted the importance of governance in the crypto ecosystem, stating that it is the “core differentiator between whether a project is successful or a project will fail.” He added that poor governance would kill a project and noted how poor governance made Microsoft fall behind Google, Apple, and Facebook.\n\nInterestingly, Hoskinson also alluded to decentralized governance, suggesting that it was a better way to run a crypto ecosystem, as everyone having a say would make things run better. He stated that this is what they are hoping to achieve with Cardano, and this is why Cardano stands out from the rest of the pack.\n\nCardano is on the verge of undergoing the Chang Hard Fork, which will usher in the “Voltaire” era, which focuses on decentralized government. Once this network upgrade occurs, Cardano’s ecosystem will become community-driven. Hoskinson boasts that Voltaire would be the “most advanced blockchain governance system.”\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNUi1jdDBuTjJ3b1RQbUROYkRRZ0JFZkFiR05YSmRpaU9jTEJ0UE1SODRBemhtaWxoZ1ZHbDN5anhmaDRZdTZsenZCX1c2blVBWlVJSjIxdVAzVkRjTWdvUTJzcXV6ejQtZnI1ZnkwczBQVktXSmhPeFRBV1pBMzY3Qkw2ZXUyRE51OTJ4OWZNVVVCN2MtMXRZUUdIYWtwZ2JBb3U2Rl9OV1hSdFl0cTNfQ3ZFYlpWQzhleW00VUl0UGZTaUVhSXhTZtIB1gFBVV95cUxOVThjTmJVd29hRHBMY2dDbGl1OUlPWERIcm9qTmpITWpKRGNGZTZBazVYdTdqeWREMGwyOXFRcFpDR25sR09TdjgwN001bGE2QlcxRnI2Z1BRdVcyR2h5bnJHMTl1RVF3b011V29FcDFHVjg5WUY1aDJBY1hRcTJMemNvX0g2Tks5LWRpUG83T3dqNW1iM2RBYThtdlBlbkxFMXVEcjU2anZQT0J0b1R3R1lVOUpqd1NDVkd0LTYwV0lONmRuSTlocENxOUNGcEtDVGVxNHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Price Rallies Amid Whale Activity and Spot ETF Anticipation - Analytics Insight",
        "content": "There has been a lot of changes in the price of Ethereum in the recent past. ETH price fell to $3,368 on June 14 before rising to $3,512 and remaining above $3,500 at the time of writing. At the moment, ETH is trading at over $3,548, which has risen by 0.34% in the last day even as it fell by 2.96% in the past week. These price movements have been felt in both the long and short positions in the market.\n\nOther on-chain metrics include changes in ETH’s realized profit, which is the total value of all coins that have been moved and sold at a price lower than the current market value. The realized profit for ETH was $55.18 million on June 12 and increased to $104.58 million by June 14.\n\nThis increase may therefore be an indication of the holders taking profits which if the pressure is sustained may lead to a price drop. Nevertheless, if the profit taken hits the market at $3,400 – $3,600 levels, it might trade between this range in the coming days."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOai1lSm92TmpvcEJmcXZpd0gtb0hPcmZyempnTVJGbEpBZVJDU3ZrMUVVQndkYzBSLXJsYzhDVDFqZHVsZ3ZKM1R3bko0bEpTcG1DN0dZalBVNk9FRE83ZlFsTHc0RGI0Y0M2ZWpfV2kxUmdhOVF3WDJoZ1o4UjM1UXJfRWpfMVHSAYwBQVVfeXFMTTNoZEhKa1NONi1fNDRDOHpGeU5RbmNOb3RNSjZyZkVPNHE5U19VNE5jbF9md2h5TDl2T01NYnlFeHE3S3BsSElKZTNEdnJqTWpLRVhEY2RxMk1vWk5LNG4wLXRsdHI0dHBpWlNWbTk5cGVjYU1ieUFuQk9vUjFGZ3ROcm96a3F5bW9NVVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "What Ethereum’s rising demand says about ETH’s price action - AMBCrypto News",
        "content": "Demand for ETH grew as put-to-call ratios declined\n\nETH’s price action remained stagnant as prices fluctuated\n\nEthereum [ETH] has remained stagnant around the $3500-mark for quite some time now. Despite its sideways movement, however, bullish sentiment around ETH has been growing.\n\nEthereum demand surges\n\nAccording to recent data, 200,000 Ethereum options contracts recently expired, and the data surrounding this event hinted at a surge of bullish sentiment in the Ethereum market. The Put-Call Ratio, a key indicator of market bias, sat at a low 0.36 at press time.\n\nThis means there has been significantly less buying of put options compared to call options – A sign that most options traders anticipate Ethereum’s price to rise. Further adding to the optimism is the maximum pain point of $3,600. This price level signifies the point where most options contracts expire worthless.\n\nIf Ethereum surpasses $3,600 at expiry, most call options will be profitable, again reflecting a bullish bias.\n\nFinally, low implied volatility (IV) below 60% across all short-term ETH options contracts further fueled the bullish outlook. Here, implied volatility reflects expected price movement, and lower IV suggests investors anticipate Ethereum’s price to remain stable or hike in the near term.\n\nLooking at the price movement\n\nAt press time, ETH was trading at $3,512.52. While the price of ETH has appreciated significantly after 20 May, as time went on, the bullish sentiment around ETH depleted itself. In fact, as the altcoin’s price fell again after 27 May, its market trend reversed itself too.\n\nIf bearish sentiment persists, the price of ETH could go down to the $3,000-level. The CMF (Chaikin Money Flow) for ETH fell significantly during this period as well.\n\nThis indicated that the money flow for ETH fell materially. The RSI (Relative Strength Index) for ETH was also relatively low. The declining RSI could be a sign of ETH’s bullish momentum waning on the charts.\n\nHow will new addresses adapt?\n\nAMBCrypto’s analysis of Santiment’s data revealed that the network growth for ETH also fell materially as the price of declined. The falling network growth implied that new addresses have been losing interest in ETH and were not willing to buy the altcoin at the recent discount.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nIf this trend continues and addresses the refusal to buy more ETH, it may further impact the price of ETH negatively.\n\nMoreover, the velocity of ETH also plummeted during this period, implying that the frequency at which the trades were occurring had also fallen significantly over the last few days.\n\nHowever, if the popularity of ETFs continues to rise, the overall interest in ETH will also grow significantly as Wall Street money flows in."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQX2JCeFA0SkRMUmJYRDAxQUJxNDJuckNDdnAwVU5taEFNeEVFWENpVjF2ZDVuSzRvempLY3NvSTEwMnY5NldXdExDdUt3Rm5mSW5Icjc5Mi1aWXpLV19TT01sbXlfR3c3YXpSNmprYVZFSER5V2R5bEd4YmdWQksxSll3RVRXNXhId0JERkhCZ9IBlAFBVV95cUxOTzlIZ0JxaUtlTHh6WG43b0VQZmwyQkR5bVRJSXZRSnFPMjRsTnU1cVZQc3BMNmRFNTFaUVJMVUZDNzctS3ViTkRZOEN5anRaZEZicDMzLXRqdk1oTGgtcDNRcm9kWHBvZF9veWlicEZ3Rmk2cmpoQTlBQThyX1dxUkhCOXZWZWgxYVRNUFI5VzY1Wl9V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Notcoin’s price surge – Here’s how it outperformed Bitcoin, Ethereum - AMBCrypto News",
        "content": "NOT followed TON’s price direction as demand pushed the volume to $1.37 billion\n\nToken seemed overbought, pointing to a possible fall to $0.016 on the charts\n\nNotcoin [NOT] defied the broader market “red period” as the price climbed by 7.22% in the last 24 hours. According to CoinMarketCap, this happened at a time when Bitcoin [BTC] slid to $65,103 before slightly recovering above $66,000.\n\nEthereum [ETH] also registered a decline to $3,381 around the same time. The performance underscores Notcoin’s next-to-nothing correlation with the top two cryptocurrencies.\n\nAt press time, NOT changed hands at $0.020. On 14 June, however, the token had initially tapped $0.022 on the price charts.\n\nNOT sentiment bullish, goes with TON\n\nHowever, Notcoin is not alone in its rise as fellow Telegram-linked project Toncoin [TON] joined in too. A few weeks ago, AMBCrypto had reported how NOT did not follow the same trend as TON.\n\nOn the back of the latest price hike, it would seem now that the two have aligned.\n\nFrom an on-chain perspective, we also found that sentiment around Notcoin has been incredibly bullish. Using the Weighted Sentiment metric, for instance, AMBCrypto observed that the reading was 0.178 on 13 June. However, at press time, the same metric had hit 0.617.\n\nThe notable hike within a short period implies that online comments about NOT were much more positive than those that were bearish about the token.\n\nApart from the price hike and bullish sentiment, Notcoin’s volume surpassed the $1 billion mark. The increase in volume constituted a 131% hike in the last 24 hours.\n\nTrading volume is crucial for a cryptocurrency’s price and direction. It indicates if market participants are interested in a token.\n\nHeavy movement of the volume, alongside a price increase, suggests an increase in buying pressure. On the other hand, if the spike comes with a price fall, it implies a hike in selling pressure.\n\nNotcoin’s price may go down later\n\nFor NOT, it was the former. However, it is unlikely that NOT’s volume would hit $4 billion like it did when the price hit an all-time high of $0.029 on 2 June.\n\nEvidence of this was reflected in the Relative Strength Index (RSI). The RSI is an oscillator that measures speed and changes in price movements.\n\nA value of over 70 indicates that an asset is overbought. When it is less than 30, it means that it is oversold. In Notcoin’s case, the RSI on the daily chart had a reading of 74.27.\n\nSimply put, the token was overbought. Thus, the price might begin a slow reversal down the chart. If this happens, the price of NOT might fall to $0.016 within a few days.\n\nHowever, this prediction would be invalidated if the broader market condition changes. Assuming prices across the board begin to move north, NOT might follow suit.\n\nRealistic or not, here’s NOT’s market cap in BTC terms\n\nShould this be the case, the value of the token might jump to $0.022 once more. Besides that, market participants should be on the lookout for developments or announcements around the project as this could also impact the price."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOOExlQlNuM1lFY0N5S2NVeVhfbW9MV2Z4V3JtTDVCYVlCMC1jQkEtVU5OVmZqdEd2X1ZSYWVHQThCUGYxVi1lZVhFaWZUa3VHZGZ0S3ZtbktsUXU3cU1DUkpXN3ZmYTc5ekNzUXE1N3NvbjBxTDROSVZ1VUMxbnpjejZWd1ZPdzBydkpCV0VobW1hVTDSAZgBQVVfeXFMTTN3azdOQ1UzbDNDU2MySnNXcXp4UlBqWHNVYW9tVFJYRWxvVzI5NlZpTlZwRXhRZ1plaW5VaTVqeWVNblVZZlo2TVFDVnM0aWxWRWt5UlJPNmhUMTdMWXFTdXk5dlBYel9fVjBqcThXb1Vkb3ZibVlaTWxmV2lGUENhT0prVFVFX1J5SDNHQzFqZ1huWW13TU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s bullish flag: A signal for investors to prepare for gains? - AMBCrypto News",
        "content": "Ethereum’s price dropped by more than 7% in the last seven days.\n\nMost metrics and market indicators hinted at a trend reversal.\n\nThe end of May for Ethereum [ETH] was bullish as the token’s daily chart showed a massive green candlestick. But last week wasn’t in investors’ interest as the token dropped substantially.\n\nHowever, the declining price trend might change soon, which might allow ETH to retest its March highs.\n\nEthereum enters a bullish pattern\n\nCoinMarketCap’s data revealed that Ethereum’s price dropped by more than 7% in the last seven days. At the time of writing, ETH was trading at $3,516.89 with a market capitalization of over $422 billion.\n\nInvestors’ shouldn’t get disheartened as a bullish pattern emerged on the token’s daily chart. AMBCrypto found that ETH’s price has been consolidating inside a bullish flag pattern.\n\nThe token entered the pattern after reaching its May high. At press time, the token’s price was testing the support near the lower limit of the bullish flag pattern.\n\nA successful test could initiate a bull rally. If that happens, then it would be surprising to see Ethereum retest its March highs of $4k in the coming weeks.\n\nWill ETH test the pattern?\n\nIt will be crucial for ETH to register a few green candlesticks in the coming days in order for ETH to test the bullish flag pattern. To see whether that’s possible, AMBCrypto analyzed CryptoQuant’s data.\n\nAs per our analysis, ETH’s exchange reserve was dropping, meaning that buying pressure on the token was high. Additionally, the total number of coins transferred has increased by 13.93% over the last 24 hours, which can be inferred as a bullish signal.\n\nThings in the derivatives market also looked optimistic as ETH’s funding rate rose. This meant that long-position traders are dominant and are willing to pay short-position traders.\n\nAMBCrypto’s look at Glassnode’s data pointed out that ETH’s NVT ratio dropped last week. Whenever the metric drops, it means that an asset is undervalued, which usually results in price upticks.\n\nEthereum’s price touched the lower limit of the Bollinger Bands, hinting at a rebound. Moreover, its Relative Strength Index (RSI) also registered an uptick and was headed towards the neutral mark.\n\nNonetheless, the MACD displayed a bearish advantage in the market, which could cause trouble for ETH’s recovery.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAMBCrypto then checked ETH’s liquidation heatmap to look for possible support and resistance levels. We found that if ETH turns bullish in the coming days, investors might witness ETH touch $3,675 in the coming days.\n\nHowever, if ETH fails to test the bullish flag pattern, then the token might drop to $3,500 in the short term."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxNNjVnYnE3aFVXTzNHenV2bTcwdHJMYWZnQ2kwbHBEVnhZcTA3WWZLN1B4QTRncWNmcEVhclZWemFkWU1wMmswN2lJMWswcjJfTFlNWU13WEdJdUVsUUNGY1pyV2JLaVo5eW9YOVpZRG1NTjF2SEN6N2V6ZnlNQ05QeE8zZ2ZBWk1mdWJZME9Pb2dKYmJ1OWdfSWd5M3JQeGFneTZUYTJGdkxnSS1QS2ZwclYzQ3czU3BJQm5XTHpsUl90ejluQzlhX3VQaE9Ucm10U2tRQjI5VzRlUlJiRDEtcU9tdHZjSHMtSjM4UTRjdnZNOFQ2Q0FuQi0zRdIBiAJBVV95cUxQTk5uYTd6WEdhMGRWd0EyZFlnOUVEaWhadklEdkxGSFlHUUluODBMLXNraXViZHZKUlZ1T3piS2pRQm8yNGx1eV9GMUVWelFoQVQtZmVaMGpHRFFhM0M3cTVvN0luUWZSVFFnY0I5VnZjbTUwbDVXNkYyVGlmRlZFNUE0XzVabmp0aFM3Z3FrSDdBMmZYY2Z2TzAxRjlncFhGcnMyVkNGbndzVVRqMWxyQ0ltZFBHMVhRYU44cFViN2VMUGZhemJoRmpoMGFzRF9DdWFHa0tiZXZZeW5PYWswNGZmZ2NyVFFfNnBTYldsNjd0RlFRNjFTeXZ4cXYyVDAxSkZBQXlUNms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Drops From Bull Pattern But ETH ETF S-1 Approvals Likely In The Summer Could Turn it Around - Analytics Insight",
        "content": "The launch of a spot Ethereum ETF would likely drive the price to new all-time highs above the previous record of $4,878 set in November 2021.\n\nOn chain data from CryptoQuant is currently painting a bullish outlook for Ethereum as well. Over $1.5 billion worth of Ethereum has been withdrawn from exchanges since June 9th. Exchange reserves of ETH have declined by 1.2 million ETH (over $4 billion) since late May. This is often interpreted as investors pulling coins off exchanges to hold long term rather than selling.\n\nFrom the technical point ETH recently broke down from a bullish flag after recording a $3,973 high on May 27th as analyzed in our previous report . This is after it dropped and closed below the bullish flag, invalidating bullish pressure in the near term.\n\nSince then price has been trading bearish and looks set to get support at the demand zone marked on the chart after the price broke out of the ranging channel impulsively on May 20th."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNNWtIVmFMZlRWZnI4TjRrOVl5OXU2dzliYTBGUDZGRGJ2akRlQVhzUjB3MmF4RzZPcUhWM1UyUnZpTEtJU3ZHOWg2akNUdHE2Z2ozYlFyXzgxaGlVSFU1Mi1hdXB0b3EyTGpFYUk1ZVQtRVBWbVBUQUVZNUMxa2lmTzJPaFBBclNUaVN1QnpqUXdNZ3VLTjVHSmdPLTE4MlNILXFJLUZZSUMxWlpza29mcEhiQUVhdm9tNmltVVNRRWNBdVlOY2VpVW5YZ3I5TUVQRDFOaUxxV3c4UlA4Q3FRTDRtdUU0SjJ2ZWMwZkJaOURJV3Jx0gGCAkFVX3lxTFBUcE5rbi1MUXBid1d4TkgwUnVleXhqNEppTkZTNGY0cFBWc1VHZ1BBdENwZ1FxUDZ5ODlDdUhZNVk2aDZmRldjRTAwLUdRMjltT1E1U1ZyTEFUVldCeFk1QzdfWW9DT1lLZnRuMnpGMmVDNks0RG05NmtCZmRPWFk4SnRqanQ5bF9tVXNaZnpvWkdlSURsU3d3TGJNRWlOb2JGcTJETkM5aTVuQ0FpSzRhdGFDZklpN1JvUmlyd215OUt3d1lKaHdZOWMtTHhGaWFnMkJBekd1VFVwUXBTeDFoWWZOVzNieDZYemZBV2h6eVdxb1ZSNFlnNklkR0xoUEtKdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Crypto Trader that Predicted Solana’s 212% Rally Thinks This Ethereum Token Will Double In 40 Days - Analytics Insight",
        "content": "In addition to Solana, Altcoin Sherpa is known for offering insights into several other crypto trends. Recently, he highlighted Avalanche (AVAX) as a potential candidate for a significant rally.\n\nDespite AVAX dropping slightly from its recent highs to around $32.07, Sherpa remains optimistic. He has pointed out that AVAX has shown resilience by holding the $31.18 support level, which could signal a bullish continuation if market conditions stabilize.\n\nAvalanche (AVAX) positions itself as a scalable blockchain platform capable of handling high throughput and supporting decentralized applications. It is a layer one blockchain that allows blockchain developers to develop and launch decentralized applications and custom blockchain networks.\n\nIt is one of Ethereum’s rivals, aiming to unseat Ethereum as the most popular blockchain for smart contracts alongside Solana, which has also seen increased activity, especially with the launch of meme coins."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZjhiMGowaThlbmFtclJsTl9BZmltSjdnNXZuNjdzcnY0Q3ZyNWd0dGZtSVRVdFpUOGswMjN1eUk3VnVHcTZpekxCU3FzcC1LTUhpeEI0ek1oNm1XdG9sVFF4ZHRMTk5NOFNvNzRRMHhaU0FXZTFxbU9OV2pkcVZIZkVGdmc4dUXSAYwBQVVfeXFMTkQxV1BYT3IxeWFnSy1MX0dUYWRKNlQ2cFdsN0FpT04tdjBfbjFseHVGVXF4V2RURjJMYWpGTUlHOXBsMnRmNTh1ZE0xUnlOVW1wa0JGbE9JVklhajNYSk41YzJJNGxfM3RHVy02NkxyOTM2Y1ZmVk1YaU1sb2h0VDU0bmhuN0tXWXNLVlg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s $50M liquidations – Here’s what traders should know - AMBCrypto News",
        "content": "Both longs and shorts experienced a turbulent time after ETH’s price went up and down\n\nRealized Profits increased, indicating that the value may fall below $3,400\n\nThe high volatility in the market caused liquidations in the market to hit $215 million. Out of this, Ethereum [ETH] contracts accounted for $50.61 million, according to data from Coinglass.\n\nLiquidations occur when a trader does not have a sufficient margin balance to keep a position open. The forceful closure is necessary to avoid further losses.\n\nStormy season for the market\n\nFor ETH, the high liquidations could be linked to the cryptocurrency’s price. A look at the price action revealed that it dropped to $3,368 at some point on 14 June. Later on, the value rose to $3,512, before settling above $3,500 at press time.\n\nAs a result of these price swings, both longs and shorts were not spared. Longs refer to traders betting on the price of an asset to hike. Shorts, on the other hand, are traders with stakes on a price decline.\n\nHowever, traders seemed to expect the depreciation in price. This, because of the Put/Call ratio before Friday’s options of expiry. According to Deribit, the derivatives exchange, Ethereum’s Put/Call Ratio was 0.37.\n\nSince the ratio was below 0.50, it meant that expectations have been bearish. However, it did not seem the participants anticipated the high level of volatility.\n\nIn terms of the price, AMBCrypto looked at the Realized Profit too. As the name implies, this denotes the total of all moved coins whose last price was lower than its press time value.\n\nETH plans to swing between $3,400 and $3,600\n\nOn 12 June, ETH’s Realized Profit was $55.18 million. By 14 June, the value had risen to $104. 58 million. An increase in this metric implies that holders are booking profits, and this could lead to a price fall on the charts.\n\nHowever, if the metric stabilizes itself, selling pressure reduces across the market. For Ethereum, Realized Profit seems to have settled around the aforementioned value. Therefore, it might be likely for the altcoins to trade between $3, 400 and $3,600 over the next few days.\n\nAMBCrypto also analyzed Exchange inflows and outflows to assess ETH’s next movement. Exchange inflows track the number of coins sent into exchanges.\n\nIf this increases, it means that holders are planning to sell. When this happens, the price of a cryptocurrency usually decreases. Exchange outflows, on the other hand, measures the number of coins sent out of exchanges.\n\nAt press time, ETH’s Exchange inflows were $34,400 while the altcoin’s outflows were 24,100. The difference in the flows implied that there were more ETH up for sale, than those retired to cold wallets.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nIf this continues, the price of the cryptocurrency might drop below $3,400 like it did on 14 June. On the other hand, a fall in selling pressure could halt this decline and ETH might keep consolidating on the charts."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOWkxjdjlDd0V1cXRFeHFzZ1pSSlMxbzZNdUV3anlhZ2pYSVBuNTU3YTc0UnFENEFGVmdIMVRodl80Ml83NF9MQnZib3B0bmNwVEhnVHhodG1aNWpEZlVlVVMyd1BVbDZCWkJCMFpvcUNmWllOVmFKQWVZWmNoZXNLSllaONIBiAFBVV95cUxNd004LVdMNHhqV05tVWtLdmVtWGVzYlJHZGtEUE1iZVdaVkFXODB3c0U2M1FWZVk2VWJNZ21xREJRSDdPbjEyUVJOcmNpQWI3R1dhVW01WGhNTGd3b2lEcXRheUVoWk9hNTlETmZsY0RyZS1NVTdCQ0ZtLWZpemgtRkRVTktMVUoy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "NFT sales: Bitcoin’s $43M vs. Ethereum’s $40M and that means… - AMBCrypto News",
        "content": "Bitcoin’s network saw more NFT sales than Ethereum’s over the past week.\n\nFloor prices of BAYC and CryptoPunks fell to multi-month lows too\n\nThe sales volumes of non-fungible tokens (NFTs) on the Bitcoin [BTC] network surged last week, exceeding that of Ethereum [ETH], according to data from CryptoSlam.\n\nOver the aforementioned period, Bitcoin’s NFT sales volume totalled $43 million, rising by 26%. Although Ethereum’s weekly NFT sales volume also rose by 17%, it amounted to “just” $40 million.\n\nThis, notwithstanding the fact that 99,297 NFT transactions were completed on Ethereum last week. Bitcoin, on the other hand, recorded 55,351 NFT transactions.\n\nOver the last 14 days, the total value of all NFTs sold on the Bitcoin network was $77.02 million. According to CryptoSlam, Ethereum’s NFT sales volume over the same period was $71 million.\n\nState of the NFT market\n\nThe previous week was marked by a decline in the general cryptocurrency market. In fact, global cryptocurrency market capitalization dropped by 4% in just 7 days.\n\nThis decline affected the NFT ecosystem, which also fell in value. According to NFTGo, last week’s NFT trading volume amounted to $85.39 million, dropping by 3% on the charts.\n\nThis led to a fall in NFT market capitalization – worth $7 billion at press time – after depreciating by 11% in the last seven days.\n\nFloor prices hit new lows\n\nA look at the leading NFT collection, Bored Ape Yacht Club (BAYC), revealed a decline in its floor price over the past few weeks.\n\nAfter peaking at 13.7 ETH on 31 May, the floor price of an NFT in the BAYC collection has since declined by 25%, as per NFTPriceFloor.\n\nThe last time BAYC’s floor price was this low was on 15 April.\n\nOver the past month, BAYC has seen a decline in sales volume as the daily count of traders buying and selling NFT pieces from the collection decreased. In the last 30 days, BAYC’s sales volume totalled $12 million, having plummeted by 34%.\n\nAs far as the CryptoPunks NFT collection is concerned, its floor price was 27.42 ETH at press time, representing its year-to-date lowest.\n\nAfter peaking at 63 ETH on 24 January, the average price of an NFT in the collection has since fallen by a massive 57%."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE4wcUtiSDZEV1pQb2YyVUdRWTFCZFdxYlVWbHNWVi16dTdkSFZIWEc5VnUwYVBKNzN3ZWw0Tmh0cjNqdTBkMlJhWlVFa0Z2czQyNVR0RGhoZUdTZS1fTXNiVnlDZjBmMWJIMldONUItVmvSAXZBVV95cUxNbThDTkpCbGZIcDFCSlV0U2Z6RGZnRFphYWdPaHc4WERvQVFoYklBQUU1cnZhTEJuel95UjJ2cEFRY3E4WWVWWGlHdVQtMFNZRnRhOFlwSzhrVEJMWlowMG9XOUNpZmNXdEtFNXhQNlRtQ1hoa3ZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 16:02:31 GMT",
        "title": "Spot Ethereum ETFs Expected To Begin Trading On July 2, Can This Propel ETH To $10,000? - NewsBTC",
        "content": "Discussions around when the Spot Ethereum ETFs will likely begin trading have continued to heat up. This time, Bloomberg analyst Eric Balchunas and fellow Bloomberg analyst James Seyffart have shared an update on when they expect these funds to begin trading.\n\nSpot Ethereum ETFs To Begin Trading By July 2\n\nBalchunas stated in an X (formerly Twitter) post that they are moving their “over/under date” for the launch of the Spot Ethereum ETFs to July 2. He revealed they had heard that the Securities and Exchange Commission (SEC) sent fund issuers comments on their respective S-1 filings. These comments are said to be “pretty light” and nothing major, with fund issuers set to file their amended registration statements within a week.\n\nRelated Reading\n\nDogecoin Sees Monumental Surge In Transactions As Whales Spend $129 Million 3 months ago\n\nThe Bloomberg analyst claimed that there is a decent chance that the SEC will declare these S-1 filings effective the next week and that the Commission will work towards approving them before the holiday weekend. He added that anything is possible but that is the timeline they are working with for now.\n\nThese Bloomberg analysts had previously put July 4th as their over/under date for the launch of the Spot Ethereum ETFs. Balchunas acknowledged that the recent shift from July 4th to 2nd wasn’t a major one but was still significant, considering it was beginning to feel like it could take longer before the Spot Ethereum ETFs launch.\n\nHe also clarified that they decided on July 2nd as the over/under date because this is when they remain undecided about whether to go lower or higher. Their latest projection is also good news, considering that SEC Chair Gary Gensler had thrown the crypto community into a bit of limbo with his latest comment.\n\nWhile addressing the Senate Banking Committee on June 13, Gensler told Senator Bill Hagerty that the S-1 filings for the Spot Ethereum ETFs will likely be approved “over the course of this summer.” This statement raised the possibility of these funds not being approved until the end of the summer, which will be sometime in September.\n\nSpot ETFs To Propel ETH To $10,000\n\nThe Spot Ethereum ETFs are expected to have a huge impact on Ethereum’s price once they begin trading. Crypto expert Ash Crypto recently mentioned that Ethereum reaching $10,000 is just a “matter of time,” with these funds set to start trading soon. Crypto analyst Eljaboom also alluded to the Spot Ethereum ETFs when he stated that $10,000 is “programmed” for Ethereum in this cycle.\n\nRelated Reading\n\nCrypto Analyst Lists The Cardano Developments That Will Drive ADA Price To $3 In 2024 3 months ago\n\nCrypto analyst CrediBULL Crypto stated that $10,000 is his minimum target for Ethereum in this bull run and added that the second-largest crypto token could even rise to $20,000 because it matches Bitcoin’s top in the 2017 bull run.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPWmVNSlgwbDNKNENUVzY0M0phUWM2VldRMFY2NlRDZ1JqRHVNQmlZYllMbU9tTnl5OUd1REpNVWxvT1ZHNFpIN0lucVZqaVFFUHI1eGxtcGpUYU5ybHVEZ25pVm5INEdvc28yUUkydVZueVJoZHJia0FuQ2RVcmFqYTVyVkpaMnZCbnNIQXYtWjBnSTkyOUJYajJmLWdYMVlMTWF3adIBqgFBVV95cUxOdEpvOG1TNUNOX1kwQjE4cG05UXBsTk9QYmVoakZOZ3NDc09Kb2tSQXZRUTVnblNCN0tqVGVzVGVoaVFkNUFNUnhRYXhHZ0NrQng5d2hCcmsyV3JJaW9LTUp2ejV1Z08wS3hicGVTZC0wN3RzYTZXaDZhdU9JOXRxTFg0UGtZSnI1OUp0a1hQZHVpWFlqUlRhTnFsckNMbUhZSG9xQ2FfbnJydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, And XRP Price Prediction: Is The Bull Rally Over? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe crypto market continues to record significant price volatility, highlighting increased price action in the crypto space. However, top tokens display a negative influence, indicating a rising disinterest of investors in it.\n\nMoreover, elite cryptocurrencies such as Bitcoin, Ethereum, and Ripple fail to hold their respective price above their important support levels. This escalated the concerns of investors about their investments in these crypto tokens.\n\nDive in as, in this article, we have covered the market sentiment and price analysis of the top 3 cryptocurrencies and mentioned their respective possible targets for the month.\n\nBTC Price Breaks Its Important Support Level:\n\nDespite a bullish jump post-CPI data release, the Bitcoin price has failed to regain momentum, resulting in the market leader erasing all its gains. Furthermore, the BTC token has plunged below the $67,000 mark, highlighting an increase in the negative influence in the crypto space.\n\nTradingView: BTC/USDT\n\nThe Cross EMA 50-day displays a bearish crossover in the 1D time frame, suggesting an increase in the negative sentiment for the BTC price in the crypto market.\n\nOn the other hand, the technical indicator, MACD, shows a rising red histogram, highlighting increased selling-over-buying pressure. Furthermore, the averages record a negative price trend, suggesting the Bitcoin price will continue trading under a bearish influence over the weekend.\n\nIf the bulls regain momentum, the price of Bitcoin will retest its resistance level of $67,775 during the upcoming week. However, if the bears continue to dominate the market, the BTC coin price will plunge toward its support level of $600,820 this month.\n\nETH Price Continues To Hover Above Its Crucial Support Of $3,400:\n\nWith the rising bearish sentiment in the cryptocurrency market, the Ethereum price has failed to hold its price above the important support level of $3,730. This resulted in the altcoin experiencing a significant correction in its portfolio over the past few days.\n\nTradingView: ETH/USDT\n\nThe ETH price has added approximately 1% with a trading volume of $16.20 Billion, a jump of 15.63% within the past day. Moreover, the altcoin has lost 4.17% within the past week but has added 17.84% over the past month, indicating a mixed sentiment for the crypto token in the market.\n\nThe Relative Strength Index (RSI) shows a bullish reversal in the price, indicating increased bullish sentiment for the altcoin leader in the crypto space. Moreover, the average trendline shows a potential bullish convergence, suggesting a bullish outlook for the ETH coin price in the coming time.\n\nIf the market continues to trade under a bullish sentiment, the Ethereum token will prepare to test its resistance level of $3,730 this month. Conversely, if the bulls fail to regain power, the ETH crypto will retest its support level of $3,400.\n\nXRP Token Breaks Down Its Crucial Support Level:\n\nDespite recording a jump of approximately 1% within the past day, the Ripple price continues to display a weak price action by recording a correction of 3.45% within the past week and 4.18% over the past 30 days. Moreover, the altcoin has a YTD of -22.02% in valuation.\n\nTradingView: XRP/USDT\n\nThe Simple Moving Average (SMA) constantly acts as a resistance to the price chart, highlighting a negative price sentiment for the XRP coin price in the crypto space.\n\nThe RSI indicator continues to hover close to its oversold range, indicating a weak price action for the Ripple token in the market. Furthermore, the averages display a constant decline, suggesting uncertainty for the altcoin in the crypto market.\n\nIf the market pushes the Ripple price above the resistance level of $0.480, the bulls will regain momentum and prepare to test its upper resistance level of $0.5340. However, bearish price action could pull the price toward its lower support level of $0.420 in the coming time."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSUNFQnZZeHBneWRrRHFCUDc3Q1pCSGx6RGhBa0dodlJITlhBS1dSNFpyb1BLY3NxNEFzcDhTcndlMUhCYUlHUktpWXRqZWtrd2NrMFQzaDdRYURWZ3dYdGo4aGJuVDNIVDVGWmtoYlZkNVFkRW9NdnRfQmxsd1NUakRvdThCeWJPNTRybVpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Opportunity? ‘Most bullish altcoin’ Ethereum signals imminent surge - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has once again captured the spotlight with its recent price movements and the emergence of a bullish pattern on its charts.\n\nThis pattern, often seen as a precursor to further price increases, has ignited discussions among investors and analysts about Ethereum’s potential to revisit previous highs.\n\nOver the past week, Ethereum has experienced notable volatility, marked by a 7% decline in its price. The cryptocurrency’s performance in the previous month was characterized by a strong uptrend that significantly boosted its price.\n\nHowever, a recent correction has tempered short-term investor optimism. Despite this performance, analysts believe that Ether still remainsone of the altcoins displaying the most upside potential at the moment. Ethereum’s underlying fundamentals and market indicators suggest a potential upward trajectory.\n\nAnalyst perspectives and historical trends\n\nProminent analyst Yoddha has highlighted that historically, Ether’s return above yearly highs has often preceded exponential price growth. He suggests that if history repeats itself, ETH could embark on a parabolic uptrend with an upside target set around $20,000, making it “one of the most bullish” cryptocurrencies.\n\n#Ethereum is one of the most bullish Altcoins right now. It's already trading above the previous yearly high. pic.twitter.com/UrViL9dY1V — Yoddha (@CryptoYoddha) June 13, 2024\n\nEther’s bullish outlook is further supported by the data from CryptoQuant which shows an increased investor accumulation and significant outflows from centralized exchanges.This accumulation activity may be driven by bullish events on the horizon, such as the anticipated debut of a spot Ether exchange-traded funds (ETFs).\n\nEthereum outflow from centralized exchanges. Source: CryptoQuant\n\n\n\nAnalyst Ali Martinez noted increased whale activity, with large holders taking advantage of recent price dips to accumulate more Ether. On-chain data from Santiment shows the top 10 exchange wallets saw an 8.6% drop in ETH holdings as traders moved assets to private wallets\n\nThis high demand-side pressure, combined with reduced supply on exchanges, is likely to create a supply deficit that could push Ether’s price above $4,000 and into a parabolic uptrend.\n\nMoreover, according to data, over 200,000 ETH options recently expired, and the crypto community eagerly awaits the direction of the Ethereum price.\n\n14 June options delivery data\n\n20,000 BTC options expired with a Put Call Ratio of 0.49, a maximum pain point of $68,500 and a notional value of $1.35 billion.\n\n200,000 ETH options expired with a Put Call Ratio of 0.36, a max pain of $3,600 and a notional value of $710 million.… pic.twitter.com/42ruZLLtqc — Greeks.live (@GreeksLive) June 14, 2024\n\nThe majority of the expiring ETH options are call options, meaning buyers are betting the price will rise. At the same time, the put-call ratio is at 0.36, indicating that market participants are currently buying more call options than put options.\n\nMarket indicators and analysis\n\nIn addition to the outflow from centralized exchanges, fundamental and technical indicators offer insights into Ethereum’s current market dynamics and future potential.\n\nA decline in Ethereum’s exchange reserves indicates a reduction in available supply, suggesting strong buying pressure from investors.\n\nAn increasing funding rate in the derivatives market shows that long-position traders are willing to pay premiums to hold their positions, typically favoring upward price movements.\n\nHowever, on-chain data from Santiment shows a high Ethereum Network Value to Transaction (NVT) ratio, which compares market capitalization to transaction volume, suggesting that Ethereum might be overvalued relative to its on-chain activity.\n\nEthereum NVT ratio. Source: Santiment / Finbold\n\nThis high NVT ratio implies that despite strong market interest and price performance, the on-chain transaction volume does not fully support Ethereum’s current valuation, indicating potential caution for investors.\n\nCurrently, Ethereum is trading at $3,562.24, with a 24-hour increase of 0.23%. Demand for Ethereum is spiking, signaling that traders expect the price to continue rising in the near term.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]