[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQd095X01xVE11SFJCRjVmSjFwczh3c0tNa3A0SEg2US1KWHdtUElYOUdFZ3FVa2x2N2ZtTVhDZnQyNXV2eC11WmFFMXBIcVZvU2tMcDJZOGNOdFhSTzJheGxlNmxGYUwtWEpNdS1RbS1VMDk4QVhmbkRMMWFhUjdkcGlIb3lPSkdrWnZlcVpOeW9vc3hURzQ3eVhKVmlyY1JlS2JIM0JUM3Fwb2RQVzEyelZlX2g3YzNlNXpZY29oVGx0SUdQaGpGREJPTXRxUW05bXVxZWhFQ0R0UDNqUGcxQjY2TkFBN0I1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "EY launches OpsChain Contract Manager solution to support secure private business agreements on public Ethereum - EY",
        "content": "Facilitates the fulfilment of complex, multi-party business agreements, supporting confidentiality and helping improve time efficiency and cost reduction\n\nUtilizes public blockchain's security and accessibility with data privacy through zero-knowledge proofs (ZKPs), enhancing contract integrity and mitigating value leakage\n\nAddresses the enterprise challenge of managing multi-party contracts across siloed systems, internally and with business partners\n\nThe EY organization today announces the launch of EY OpsChain Contract Manager (OCM), a transformative blockchain-enabled solution for contract management. EY OCM helps enterprises to execute complex business agreements, supporting confidentiality, helping improve time efficiency, and achieving cost reduction, with automatic adherence to the agreed terms.\n\nLaunched at the annual EY Global Blockchain Summit, EY OCM helps address the enterprise challenge of managing business agreements that run across internal and external operational and technology siloes. EY OCM synchronizes data across business partners and uniformly enforces key business terms such as standardized pricing, volume discounts, rebates and strike prices.\n\nEnterprises often struggle to fully implement and capture value from their business agreements. Spend gets fragmented across internal enterprise barriers, making it hard to track and qualify for agreed-upon discounts and rebates. Smart contracts enable aggregation of spend across systems and even external business partners and then consistently applies contract terms.\n\nDriven by this value proposition, Zion Market Research predicts that the global smart contracts market will grow to an estimated US $1 billion by 2030 with a compound annual growth rate (CAGR) of roughly 24% between 2023 and 2030.\n\nThe solution runs on the Ethereum public blockchain, enabling truly decentralized operation in a trust-worthy environment. This helps avoid giving a strategic advantage to either a buyer or a seller and assists in eliminating the high costs of setting up and running a private network, as well as the risks that come from sharing sensitive business information with a centralized industry portal. The system maintains enterprise privacy using Zero Knowledge Circuits.\n\nThe EY OCM solution can be easily used in existing enterprise systems through a standardized API. Most business contract types can be supported including volume purchase agreements, standardized rate cards, volume discounts, rebates, and price models that depend on market data feeds. The first test users of the solution are implementing complex Power Purchasing Agreements (PPAs) that include market prices, strike prices with minimum and maximum purchase criteria.\n\nPaul Brody, EY Global Blockchain Leader, says:\n\n“We’ve identified from past client work that contract automation can improve accuracy while cutting cycle times by more than 90%, and overall contract administration costs by nearly 40%. With our zero-knowledge privacy technology, we have industrialized this capability, and we can now get these benefits at a fraction of the up-front cost. Deploying on a public blockchain is not only cheaper, but also much more scalable, helping enable many-to-many integrations on an open platform with no one company having an unfair advantage by controlling the network.”\n\nFor more information about EY Blockchain, visit: https://www.ey.com/en_gl/services/blockchain.\n\n-ends-\n\nAbout EY\n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\n\n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\n\nEY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. Information about how EY collects and uses personal data and a description of the rights individuals have under data protection legislation are available via ey.com/privacy. EY member firms do not practice law where prohibited by local laws. For more information about our organization, please visit ey.com.\n\nThis news release has been issued by EYGM Limited, a member of the global EY organization that also does not provide any services to clients."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOZ09zdzk2UVZEOGJOTXMzY1N1X1AzOGs2R1pzRkFqR0VWeVBTOUNGY21Cd2d5Q1hPRFkzQU5BOHZYemZZaEYzT2t1aWZUYjNJYW9HeDBjSko2UG1JQnpNWVZYOGliYTdDcUlBaDZ4RWp5ZjVXa21OWlhIN2N6ak0yeGtPY3lKZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Cathie Wood's Bullish Ethereum (ETH) Prediction: How Much $1,000 And $10,000 Invested Could Be Worth - Yahoo Finance",
        "content": "Cathie Wood's Bullish Ethereum (ETH) Prediction: How Much $1,000 And $10,000 Invested Could Be Worth\n\nWhile Bitcoin has made headlines in 2024 with the approval of spot exchange-traded funds (ETFs) and the upcoming halving, Ethereum (ETH) is potentially positioned to make waves in the coming months and years, according to Ark Invest CEO Cathie Wood.\n\nArk Invest held its Big Ideas event, an annual opportunity to review high-level market trends and potentially disruptive technologies. At one of these events, Wood asserted that Ethereum could reach a market capitalization of $20 trillion by 2032.\n\nDon't Miss:\n\nDogecoin millionaires are increasing — Investors with $1M+ in DOGE revealed\n\nAbout 22% of the adult population in the U.S. own a share of Bitcoin, how much would $10 get you today?\n\nThe current market cap of ETH is around $400 billion and has approached $500 billion in 2024. The market cap of the S&P 500 is around $40 trillion to 45 trillion. If ETH were to amass a market capitalization of $20 trillion, the price per token would be around $166,000.\n\nThe Ark Invest CEO believes the mainstream adoption of ETH as a financial tool will be the main catalyst for this price prediction. Ethereum is a way for people to access decentralized finance applications. The applications allow anyone to interact with different financial actions, such as trading, lending, borrowing and staking, without going through a centralized intermediary. If these applications are adopted on a large scale, the demand for ETH — and its price — could increase.\n\nTalks of spot Ethereum ETFs are ongoing. Releasing the ETFs could have an impact similar to that of spot Bitcoin ETFs, which brought in huge amounts of inflows and propelled the price of Bitcoin higher.\n\nTrending: If you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nBut potential ETF sponsors must face several regulatory hurdles, particularly related to the Security and Exchange Commission's (SEC) classification of ETH as a security rather than a commodity as BTC was classified. Despite this, some are still confident that ETH ETFs could come as soon as this year, which could positively affect the price of Ethereum.\n\nWood is known for making extraordinary predictions about tokens well into the future. For example, at Bitcoin Investor Day in March, she predicted that Bitcoin would reach a high of $3.8 million by 2030. While these predictions may have some merit, they are largely speculative and may be influenced by Ark's entanglement with the assets. The company was one of several that released a spot Bitcoin ETF (ARKB) and also offers an Ethereum futures ETF (ARKZ). So, Wood could be giving these predictions as a way to increase engagement with her firm's products.\n\nStory continues\n\nIf ETH reaches $166,000 per token by 2030, it would create huge gains. Specifically, an investment of $1,000 would be worth $54,330. An investment of $10,000 would be worth $543,300. These huge profits may not come to fruition, but according to Wood, it is a possibility.\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Cathie Wood's Bullish Ethereum (ETH) Prediction: How Much $1,000 And $10,000 Invested Could Be Worth originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQT0xYWW1tNGtCbUc2R05qaWxDbUtQLU40TFYyeUxlUWo5TVZqNV9GSnF4amltZHhJSFJwTDJ3dWhOMFBCQ2ZRdGJULXZfWjdSYkVMZTk5eWhHNjc4VnBnVUF3T2p4d3B5SmNlNWxTMm52MmVMUFJ6czZXOFNPWGZnN1JETFVEb0dZQ3RfMTJ5Rml1Z0JENXBGeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "1 Top Cryptocurrency to Buy Before It Soars 5,000%, According to Cathie Wood - The Motley Fool",
        "content": "The closely followed growth investor expects Ethereum to blast off.\n\nEarlier this year, Ark Invest's Cathie Wood stunned cryptocurrency investors by predicting that Bitcoin's (BTC -2.27%) price would reach $1.5 million by 2027. Wood believes the recent approvals of Bitcoin's first spot exchange-traded funds (ETFs), more institutional purchases, and the impending halving of Bitcoin (which will make it twice as hard to mine the cryptocurrency) will all drive a stampede of bulls to the world's largest cryptocurrency.\n\nBut Wood made an even more bullish prediction for Ethereum (ETH -0.40%), which currently trades at about $3,200. In Ark Invest's \"Big Ideas\" presentation early last year, Wood said Ethereum's market cap could exceed $20 trillion -- which would require a market price of more than $166,000 per token -- by 2032. Could Etherium's price actually soar by over 5,000% to hit that target?\n\nHow is Ethereum different from Bitcoin?\n\nEthereum is the largest cryptocurrency on the open-source Ethereum Network, which differs from Bitcoin (BTC -2.27%) in two key ways. First, miners can only mine for Bitcoin tokens on the Bitcoin blockchain, but developers can create their own tokens, decentralized apps (dApps), and non-fungible tokens (NFTs) on the Ethereum Network. That flexibility makes Ethereum a core pillar of the Web3 movement, which aims to disrupt centralized app platforms like Apple's App Store and Alphabet's Google Play with decentralized applications and payment methods.\n\nSecond, Ethereum requires much less power to mine than Bitcoin. The Ethereum Network previously used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it in September 2022, it transitioned to the more energy-efficient proof of stake (PoS) method. That transition, dubbed The Merge, reduced the network's total mining energy consumption by 99.95%. Ethereum bulls believe that upgrade will make it easier to expand the Ethereum Network and support more Web3 projects.\n\nWhat are Ethereum's main catalysts?\n\nEthereum is now the world's second-largest cryptocurrency after Bitcoin. It's also one of eight cryptocurrencies -- which include Bitcoin and six stablecoins from PayPal (PYPL -2.75%) and Gemini (GUSD) -- on the New York State Department of Financial Services' \"green list\" of pre-approved cryptocurrencies. That relative stability suggests the U.S. Securities and Exchange Commission (SEC) might eventually approve spot Ethereum ETFs.\n\nHowever, the SEC recently reiterated its view that Bitcoin was the only cryptocurrency that could be classified as a commodity instead of a security since it still uses the PoW method, which is comparable to physically mining precious metals. The SEC said the PoS method, while more environmentally friendly, makes the cryptos that use it more similar to derivatives contracts -- so Ethereum is more similar to a security than it is to a commodity.\n\nThe SEC also recently requested more information from the Ethereum Foundation, and it remains committed to reclassifying Ethereum and other Ethereum tokens as securities. That position implies the SEC probably won't approve any spot ETFs for Ethereum -- since commodities are more commonly valued by their spot prices -- in the foreseeable future.\n\nBut despite that, Ethereum's periodic burning of its tokens could stabilize its price in the near term. The upcoming upgrades for the Ethereum Network could also make it even easier to facilitate financial transactions and develop more decentralized tokens and apps. More companies could also begin accepting ether, the coin that powers the Ethereum blockchain, as a payment option, and institutional investors could accumulate more of the crypto -- even if it's not as easily accessible as Bitcoin through spot ETFs.\n\nShould you believe Wood's bullish prediction?\n\nInvestors should take Wood's $166,000 price target with a grain of salt. First, the famed growth investor has made plenty of wrong calls. Her firm's flagship Ark Innovation ETF (ARKK 1.29%) has actually declined by 4% over the past five years as the S&P 500 rallied 76%. Ark also offers its own Ethereum futures ETF and is trying to get a spot Ethereum ETF approved, so Wood's opinion is arguably more subjective than objective.\n\nThat said, Wood adamantly believes the expansion of Ethereum's developer base and its potential to \"displace many traditional financial services\" and \"take share from existing financial intermediaries\" will drive its price toward her sky-high target of $166,000. I personally think Ethereum could come up far short of that lofty price in 2032 -- but it could certainly stabilize and head higher over the next few years if the Ethereum Foundation upgrades its network and keeps up with Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9ud1h2UWIyZlFWcER1ZndyMWZvTC0xQWx4WXptYW5abGRVdE9IMUwxc3QxdUVzRWduUzdfSHl6U0Mxd0hZN0pydlpLNzcyTzNjRllTc3h2ZFRSLURmOEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "No, ETH isn’t suddenly a security now - Blockworks",
        "content": "The Securities and Exchange Commission is investigating whether the Ethereum Foundation’s sale of ETH since the September 2022 “Merge” constitutes an unregistered securities offering in violation of US law, according to Fortune.\n\nIf the reports are true, then this investigation — just ahead of the SEC’s May deadline for a decision on an Ethereum spot ETF (more on that later) — raises the question: Did Ethereum’s switch to proof-of-stake transform it into a security?\n\nThe short answer is “no.”\n\nThe slightly longer answer is “still probably no.”\n\nETH tokens are not, in and of themselves, “securities” in the way that stocks or bonds are. They do not confer legal ownership of any business entity or contractual rights to any kind of payments — they are just code in a decentralized database.\n\nWhen we talk about ETH “being a security,” we are instead actually asking whether the offer and sale of ETH tokens (in a particular context, between a particular buyer and seller) constitutes an “investment contract” under the dreaded Howey test. Under the Howey test, the offer and sale of an asset like ETH constitutes an investment contract if (1) someone invested money, (2) in a “common enterprise,” (3) in the expectation of profit and (4) where that expectation is based on the “essential managerial efforts of particular others.”\n\nThe four Howey “prongs” have already been discussed and debated to death in the crypto space, so I’ll avoid beating a dead horse here. But if you look closely at the language from Howey, I think two things quickly become apparent about the sale of ETH tokens over time:\n\nFirst, the sale of pre-mined ETH tokens to investors in Ethereum’s 2014 ICO sure looks a lot like an “investment contract.” ICO participants invested money (BTC) in order to receive their allocation of ETH (Howey prong #1). That BTC was pooled to fund a common effort led by Vitalik and the Ethereum Foundation to develop the Ethereum blockchain and produce the ETH tokens (Howey prong #2). Given that the Ethereum blockchain “pre-launch” at the time of the ICO, the only plausible motivation to take part in the ICO was to make money on the price appreciation of ETH (Howey prong #3). And, at the time of the ICO, if Ethereum was going to succeed as a protocol and ETH was going to succeed as an asset, Vitalik and his developers were going to have to roll up their sleeves and put in some good old “managerial efforts” to make the tokens worth anything (Howey prong #4).\n\nHad the SEC brought suit around the time of the Ethereum ICO, they would have almost certainly won in court, and that may well have been the end of ETH.\n\nHowever, the SEC didn’t bring suit, and the statute of limitations for such a claim (typically five years) would have run out in 2019. And importantly, the Ethereum ecosystem has evolved in ways since its ICO that make current sales of ETH tokens look less like an investment contract than they once did.\n\nFor one thing, the proliferation of applications (think DeFi and NFTs) utilizing ETH for “gas” provides a “consumptive utility” for ETH tokens that challenges the notion that current-day purchases of ETH are solely, or even mainly, based on profit expectation.\n\nEven more important, however, is the so-called “Hinman speech” delivered in 2018 by Bill Hinman, then the director of corporation finance at the SEC, where he proposed that a digital asset’s classification under Howey could evolve over time.\n\nAccording to Hinman’s logic — to the extent that Ethereum’s success no longer hinges on the efforts of a particular entity, like Vitalik or the Ethereum Foundation — the sale of ETH tokens would no longer fulfill the requirement of the final Howey prong that there be “particular others” upon whose efforts a buyer would rely for their profits.\n\nRead more from our opinion section: Staking or not, ETH is no security\n\nTherefore, regardless of the legally dubious nature of the ICO, the Ethereum network (at least from 2018 onwards) has become “sufficiently decentralized.” This means that its native token constitutes a digital commodity like bitcoin, rather than an investment contract, subject to SEC jurisdiction.\n\nSince the Hinman speech, the securities law status of ETH has been at a bit of a stalemate. The SEC has never explicitly endorsed the notion that ETH (even pre-merge) is a digital commodity — which they readily concede with regard to bitcoin. And Gary Gensler regularly ties himself in knots before Congress trying to evade questions about his view on ETH’s current legal status.\n\nBut the fact remains that (at least until now) the SEC has never brought an action specifically alleging that primary or secondary sales of ETH constitute investment contracts under Howey (like they did with over a dozen other tokens in the Coinbase, Binance and Kraken lawsuits). The SEC even went as far as to approve the listing of ETFs based on ETH futures contracts that trade on the CME, which would be hard to understand if the Commission felt that ETH tokens traded as unregistered securities.\n\nBut what about Ethereum’s migration to proof-of-stake? Does the fact that ETH tokens can be staked for “yield” change the legal situation and turn either (A) current-day sales of ETH, or (B) the act of staking ETH into securities offerings under Howey?\n\nIn my opinion (and I spend an unhealthy amount of time thinking about crypto securities law), no.\n\nWith regard to present-day sales of ETH tokens — whether directly from the Ethereum Foundation or on the secondary market — I don’t think ETH’s staking functionality makes much of a difference under Howey. That is, the ability to stake does not make ETH tokens any less useful for individuals who might buy them for their consumptive utility (i.e. gas fees).\n\nAnd while the Ethereum Foundation does indeed still hold a large supply of ETH tokens, there is no reason to think that the introduction of staking makes the foundation’s “managerial efforts” “essential” to the financial success of ETH in some way that was not the case at the time of the 2018 Hinman speech.\n\nThe question of whether the act of staking ETH in order to receive “yield” in the form of staking rewards constitutes an investment contract under Howey is more nuanced — but properly understood, the answer should still be no.\n\nRead more from our opinion section: Ether is the Schrödinger’s cat of crypto\n\nWhen you run a validator node and stake 32 ETH tokens in exchange for rewards, what you are actually doing is providing a service to the Ethereum network and getting paid for that service. You only get the reward if you honestly validate blocks, and you stand to lose your stake to “slashing” if you attempt to validate dishonestly.\n\nThis is very different from the type of passive “yield” you might expect to receive from holding a bond or a dividend-paying stock or real estate asset (which rewards ownership and not activity). Unlike with these traditional financial instruments, you are not relying on “managerial efforts” of other people in order to profit when you stake ETH directly, but rather on your own skill and honestly as a validator.\n\nThis question becomes trickier, however, when we move from direct proof-of-stake validation to “staking services” such as those run by exchanges like Coinbase and collaborative staking protocols like Lido and Rocketpool.\n\nAt one end of the extreme, you could see an argument for how custodial staking services could look quite security-like under Howey (given how reliant depositors would be on the staking service provider’s efforts in order to earn yield).\n\nAt the other end of the spectrum, you could imagine a purely on-chain tool that allowed users to jointly stake their ETH in collective, automated, validator nodes with clearly defined behavior looking much more like direct staking than an investment contract.\n\nWhere the specific services by Coinbase, Lido and Rocketpool fall on this continuum is very much an open legal question — and one that in Coinbase’s case is being actively litigated in federal court in the Southern District of New York.\n\nBut none of this makes ETH itself, even when being used for staking purposes, an investment contract and therefore none of this seems to justify the SEC’s new investigation.\n\nWhy, then, might the SEC be pursuing this type of weak claim about Ethereum?\n\nObserving the success of the Bitcoin ETF — and the SEC’s dissatisfaction with its launch — suggests that the investigation into Ethereum might be a pretext to deny the upcoming spot ETH ETF application.\n\nMoreover, acknowledging Ethereum’s transition to a commodity despite its seemingly illegal ICO genesis could concede a legal strategy meant to apply to other token projects that the SEC believes aiming to circumvent securities classification (in other words, creating a loophole).\n\nThe SEC’s actions could be seen as a strategic move to maintain regulatory leverage over the crypto market, rather than a clear-cut determination of Ethereum’s status as a security.\n\nZack Shapiro is the Managing Partner at Rains and leads the law practice. Previously, he was co-founder and general counsel of BZR, a startup backed by Founders Fund, Greycroft, and Abstract Ventures. Zack is a graduate of Williams College and Yale Law School, and started his legal career clerking in the federal courts for the S.D.N.Y. and the 2nd Circuit, and at Davis Polk & Wardwell. Zack serves in various advisory roles in the crypto industry, including as a member of the Pleb Lab Accelerator advisory board, and as a Legal Fellow at the Bitcoin Policy Institute.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQm1QdTVmZV9oclY1cmJjYWwzTmwxak1NV1pqeGE2d1RIb3FCLV9KVm0wb3FxUDNjU0ktNWhDdHZpS3JaeUhGd1R6WlY0bFNhRE5EU3luVHNsSFJKTjRSSFZBNTMzUmZ4X3FHcm1BeTJKcjdZWXI4cFF0bE44Rzh4alR6dXF3b1BXVjA4VkE3QXZZM3doX0RFVTBjSVNCZFdoQzNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum falls to lowest level against Bitcoin in 3 years amid panic selling - CryptoSlate",
        "content": "Ethereum fell against Bitcoin to its lowest point in three years amid the carnage that followed Bitcoin’s fall from $70,000 over the weekend. The ETH-BTC chart reached as low as 0.0462 BTC on Saturday, April 13, down 24% from the year-to-date high of 0.085 BTC.\n\nEthereum’s all-time high against Bitcoin came in 2017 when it touched 0.16 BTC before closing the year around similar levels to now at 0.048 BTC. It has since recorded lows around 0.018 BTC in late 2019 before rising significantly throughout the 2020 – 2021 bull market.\n\nThe cycle peak of 0.088 BTC was met with a steady decline throughout 2023, 2022, and 2024. The 0.05 BTC level had been acting as a lower support level until it was breached this month. While the price remains within 7% of the support, it has been almost three years since we’ve seen these prices.\n\nThe decline has been gradual and steady since the start of 2023, with a few bullish breakouts shut down within a couple of months.\n\nWhile Ethereum remains below the 0.05 BTC support level, it has recovered almost 7% from its weekend lows, holding relatively steady amid Bitcoin’s continued struggles. Bitcoin fell from $70,000 to $61,700 over the weekend before recovering to $66,000. However, Bitcoin has retested $61,700 again and is trading around $62,000 as of press time. Ethereum initially followed Bitcoin down from $3,600 to $2,800 – it has since consolidated around the $3,000 mark, aiding it in its price war with Bitcoin.\n\nWhile the overall crypto market often follows Bitcoin, much of the altcoin market follows Ethereum. The ETH-BTC chart highly influences the delicate relationship between digital asset price movements, and it is one of the staples of the industry. Bitcoin dominance, another critical factor, reached a 3-year high this weekend, touching 57%, while Ethereum dominance dropped to just 15% from a recent high of 19%.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPYlphX1pjbmVjSWdrMGx4UFRwYkZHWENiWlhiS0psUDZ0NlR1TTVMS3ptSjg1SmhnakNWYjZoeERwUWRUWmh5czh3cDdrQWNqM0V0aWhHd19xV1pnYWpjbkw5Y25QbzJ4VW0zMkR2MVBnMl8wWktReDJlY0x5LXZpU1l4NWpDRHZ4VWlacFBmX3dRb3JoZmFuLTVUQXVUbWs0TkpZekRmb19TVjM50gGyAUFVX3lxTFBnd0l4RGU3OHhJZFI4SzJnLXFfNVFHQXVmbTN0RFhtN0NNdUxoVUtZQVduMzZXS2doZXF1SGRDOGVWOXZUWU1qMEl0aGtPMUxqRXlwTUpNdXBjNXBEWlJlT1VJSkUxaUhFcVRjdXRmQks0dGhsSlNiTWlFdVcweE1aNWlzcm45cFdQN1pwTkJ1OXRBMzlfS2VGT19KVFJNMkNsWE5leGRKV2FzcDYwcUJsUEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Cramer's Lightning Round: Instead of Marathon Digital, buy Ethereum or Bitcoin - CNBC",
        "content": "Stock Chart Icon Stock chart icon Exxon Mobil's year-to-date stock performance.\n\nExxon Mobil : \"Parabolic move, my friend. We don't like parabolic moves, that's a very good example.\"\n\nStock Chart Icon Stock chart icon Marathon Digital's year-to-date stock performance.\n\nMarathon Digital : \"If you want to own Marathon Digital, just go buy either Ethereum or buy Bitcoin, ok. Let's not fool around.\"\n\nStock Chart Icon Stock chart icon NuScale Power's year-to-date stock performance.\n\nNuScale Power : \"When it comes to data centers, I am inclined to say that no power company is going to make money off of it. Better to buy Vertiv or Eaton. That's the way to do it.\"\n\nwatch now"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPNjZGZHppUW96MC1BN0Y2Y1JNdmFRX2h6aGdNdm1Kd3RuRmNla3R6ZkxMbXJzREVXMWtaZjNzTlVHc1U4X1Mzalo4ME4zMUZONTgzemdHV3lSeERDdmlndGd4cHdFc0NaMTZxQjZiVDd3RUFUMl8yYnp3clRzTkM3aDROQ2x5UzBUN0RBQm03bGNmRndJQ0N1cNIBngFBVV95cUxNaVFwb2JQb1p0MkRXUWQyX3ZMQXh6eEFKM2ZGczdYSlkzQThLU2NHVFZfamN0ZjZEQXFOU1k1V3BGOHBoSmRZbDQxV3JyRFo5V05WWlA0Z2hiWDRjLU94MDc5V253S0VvdnIyZlBmX0pXY0YzQ1RjMV9rM19fRG9hNGs5X1F0WGhGLUNLRWdiaUlTbWFkQU9jTHZoNmwxUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "How fast can Ethereum recover from its latest dip? Key indicators say… - AMBCrypto English",
        "content": "Ethereum’s social activity has risen in the past 24 hours.\n\nHowever, bearish sentiments continue to climb.\n\nLeading altcoin Ethereum [ETH] has seen a spike in social activity following reports from multiple issuers in Hong Kong that their applications for spot bitcoin and ether exchange-traded funds (ETFs) have been approved, according to Santiment.\n\n?️ As #crypto prices have been on the decline, #Ethereum is seeing the fastest rise in discussion rate. The new #ETF has caused more interest in the #2 market cap asset, even though #shorts are rising rapidly. Also, keep an eye on #Beam's rise in interest. https://t.co/0bfF7HR4lw pic.twitter.com/j6zyJqpiMT — Santiment (@santimentfeed) April 16, 2024\n\nOn 15th April, in a series of announcements, China Asset Management, Harvest Global Investments, Bosera Capital, and other applicants confirmed that the Hong Kong Securities and Futures Commission (SFC) had approved them to list spot BTC and ETH ETFs in the region.\n\nThis resulted in a rally in ETH’s discussion rate on social media platforms.\n\nETH reacts but negatively\n\nDespite the spike in ETH’s social activity, its price has failed to see any significant price reaction. Exchanging hands at $3,086 at press time, the altcoin’s value has declined by 5% in the past 24 hours, per CoinMarketCap’s data.\n\nOn-chain data provider Santiment also noted that the period under review has been marked by a spike in ETH shorts positioned open. According to its post on X, this had grown by 54%, signaling the rise in bearish sentiment.\n\nAlthough ETH rose briefly to trade above $3,200 after the announcement of the series of ETF approvals granted by the Hong Kong regulator, bearish sentiments quickly overshadowed these gains.\n\nKey indicators assessed on a 1-day chart revealed the possibility of a further price dip in the short term. For example, the dots that make up the coin’s Parabolic Stop and Reverse (SAR) indicator rested above its price at press time.\n\nThe Parabolic SAR indicator is used to identify potential trend direction and reversals. When its dotted lines lie above an asset’s price, the market is deemed to be in a downtrend.\n\nMany traders interpret this as the time to exit long positions or initiate short positions.\n\nFurther, readings from the coin’s Moving Average Convergence Divergence (MACD) indicator confirmed the growth in bearish sentiments in ETH’s market.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAt press time, the coin’s MACD line rested under its signal line and below the zero line.\n\nWhen an asset’s MACD line crosses below its signal line, the short-term moving average is below the longer-term moving average. Traders interpret this to mean that the downward momentum is stronger in the short term."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1BUGs5SFpIamRoRWRzNHNjYVphRzNqaFNkcy1rMUtrMGpkMGpleHVGcm9TajBOeUw1NnN0eWREUFFzLXJhSUcwTlVod1pBX2tDbklScE84TnhvZThnTnFpS0s4UHhadUMtMVREMUk3UVIxeU1rUENmM1lFUdIBgAFBVV95cUxOVkpWNXEtWTZSVTBPWXFmUHpBcURJV2dJNkRMb0d6R3lzcG5xLWs5VnFqNU15ZHRzMUJpZkhKUkZhdWFrcmZRZW1RM1ZkbGUxUE80YzllTUhpUDd1d0VUbVBKY0o5T05TVVlWbkhwd2M2QWdmb2ZsU1p2OGE2RV8tcQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum vs. Bitcoin: Is 60% ETH Price Collapse on Horizon? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBenjamin Cowen, a crypto analyst and trader, has raised concerns about the potential significant price collapse of Ethereum (ETH).\n\nAdvertisement\n\nIn a recent analysis, Cowen hinted at the possibility of a 60% plunge in the price of ETH, citing the loss of crucial support levels for the ETH/BTC trading pair.\n\nThe ETH/BTC trading pair, which compares the value of Ethereum to that of Bitcoin, is widely regarded as an important indicator of market sentiment and relative strength between the two largest cryptocurrencies.\n\nAccording to Cowen's analysis, the recent loss of important support levels in the ETH/BTC pair could signal further downside for Ethereum's price in the near term.\n\nAccording to the crypto analyst, on the past two occasions, ETH/BTC broke major support, and the ETH/USD pair fell 60% from its previous local high in three to six months. He mentioned that ETH/BTC has just lost support, and the implications of this development are unknown presently.\n\nThe last 2 times that #ETH / #BTC broke support, #ETH / #USD dropped 60%+ from the prior local high over the next 3-6 months.\n\n\n\nAgain, #ETH / #BTC just broke support.\n\n\n\nNothing with investing is guaranteed, but please consider all outcomes. pic.twitter.com/RUMYEJwCaM — Benjamin Cowen (@intocryptoverse) April 16, 2024\n\nCowen's warning comes amid a period of heightened volatility and uncertainty on the cryptocurrency market, with Ethereum experiencing fluctuations in its price and trading volume.\n\nThe loss of support for the ETH/BTC pair adds to the uncertainty surrounding the Ethereum price as it fights to maintain the crucial $3,000 level.\n\nETH was down 3% in the last 24 hours to $3,055 at the time of writing. According to crypto analyst Ali, the next critical support zone for Ethereum is currently between $2,000 and $2,430, where around 9.37 million addresses hold nearly 53 million ETH.\n\nWhile the prediction of a 60% drop made by Cowen is stark, it is important to realize that predictions are not certainties. While historical trends and potential outcomes might be crucial to consider, past performance might not indicate future results.\n\nIn separate news, the Ethereum community is debating a change to the ETH monetary policy in response to proposals aimed at limiting the staking pool's rapid expansion. This discussion was triggered after two Ethereum researchers proposed slowing ETH issuance and thereby reducing staking incentives."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQbFRzZWRVMUpyUVZkX0pYaG8zMUNWTThGZmZTdHJOTURXcy1telFpUnV0UlFJOVpjakZqaXZCdzFleWU5QzRFRlJsMnFueTU0SXVxQm1ZeHhmR3gwaWxISXBkLU9DQTR3YzdYYmpaeVpjendPM0pyamdXQWdBbk5WLW96VTdEeXpXN2RtcFRCblpKX3dxaE5GVmZBTld1alRIcnM1eFpUd2wtYjJWckYtaGJNU0JnWHZJOXVaY1U1WU9TN05DSjRNd1F2YmVsckpIdktLa19CQVNJTUdmMnJsOHp3UFhjZ9IB6wFBVV95cUxPa2E4NUNob1VRZVdrekVNSUNaTEhrUzhuekpsZ1M1dVdKNkVpQ1BXSkZ6TGZISkhxdUZ5cF9hMGJEcjhxZ2Y5ejYtTkxnQmJvLU5jR0xyd3dIYndfU2VWRk0zNnJ0X1Y4Tl8wSDRRTDdfcllMRjYzR05DcThtVlpMZC1FVHRtSDhQUTQwQWd3TmlzakI2eVRjV05pTGM1WlQ4dElEMlB6OXRKdWw1VTZXSmctU2FGVnhCejd1dGFaRFlVck1XYVFIaG1wTnJLWm9FZ1k1R0JnQllrMVlQV0RRcE1RUmpnY0xaVGZj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum declines as crypto market crash increases bearish sentiment - FXStreet",
        "content": "Ethereum risk reversal sunk by 20% on Tuesday following nervousness surrounding the recent crypto market crash.\n\nETH liquidated long positions reached $67.37 million in the past 24 hours as short traders prevailed.\n\nGlassnode shared insights into the recent Ethereum issuance reduction proposal that has sparked criticism from the crypto community.\n\nEthereum's (ETH) price briefly dipped below $3,000 on Tuesday after tensions surrounding a potential Iran-Israel conflict suppressed the effect of Hong Kong's spot ETH approval. Regardless of the price dump, the recent ETH issuance reduction proposal has made the rounds again following research firm Glassnode's report.\n\nRead more: Ethereum recovers from dip as Hong Kong ETH ETF approval sparks whale buying spree\n\nDaily digest market movers: risk reversal dips, liquidated long positions, ETH issuance\n\nEthereum headlines the crypto market again with increased attention surrounding it. Here are your key market movers:\n\nEthereum investors are showing increased nervousness as ETH risk reversals have sunk 20% on Tuesday, according to QCP Broadcast. Generally, crypto bulls are exercising caution as Bitcoin and other altcoins have also posted losses following the prevalence of the Iran-Israel conflict. QCP further highlights that the market is shorting ETH gamma, indicating a sharp move either upward or downward could be amplified.\n\n\n\nFollowing the Hong Kong spot ETH ETF approval, the second largest digital asset saw increasing discussions, making it the most trending token among traders, according to data from Santiment. Despite the increased attention, ETH shorts have risen by 54% as bearish sentiment around the digital asset continues increasing.\n\n\n\nThe crypto market liquidation heat map validates this as Ethereum has seen over $81.9 million in liquidations in the past 24 hours, according to data from Santiment. Liquidated long positions account for $67.4 million of the total ETH liquidations, with the largest coming from an ETH-USD swap valued at $6 million.\n\nAlso read: Ethereum price stagnates as EIP-3074 brings smart contract functionalities to wallets\n\nThe Ethereum Foundation's proposal to reduce ETH issuance still faces criticism despite clarifications that the aim is to maintain Ethereum's status as money and a balance in the network's governance power, according to Glassnode.\n\n\n\nThe rise of restaking and liquid restaking tokens increases ETH's inflation rate and impacts several ETH holders. \"In other words, there is a wealth transfer taking place from a shrinking pool of non-staked ETH holders, towards a growing pool of staked ETH holders,\" says Glassnode.\n\n\n\nAs a result, the \"real yield\" could shift the \"role of money\" within the Ethereum ecosystem from ETH to liquid staking tokens or restaking tokens because of their significantly high yields. \"A side-effect of such a development would be the projects which issue these derivative tokens gaining an outsized influence over the governance and stability of Ethereum's execution and consensus layers,\" stated Glassnode.\n\nTechnical analysis: ETH to trade below $3,301\n\nEthereum bears prevailed in the past 24 hours as its price has found it difficult to recover from the weekend slump. After a brief move toward $3,300 on Monday, expectations were that it would maintain a sideways movement in the $3,210 to $3,406 range. However, ETH declined further, settling around the $3,000 support.\n\nETH/USDT 1-hour chart\n\nRead more: Ethereum price recovers slightly as whales begin accumulation spree\n\nConsidering current volatility, ETH may trade inside the range of $2,852 and $3,301, both formed on Saturday. A move above the range may see it breaking past the $3,406 resistance of April 7 and testing the 3,618 key level of April 11. A further upward move will see ETH sustain bullish momentum. However, a move below the range will see ETH entering a bearish trend.\n\nThree factors will affect this thesis: the upcoming Bitcoin halving, a potential Iran-Israeli conflict, and the Securities & Exchange Commission’s (SEC) decision on a spot Ethereum ETF.\n\nEthereum is trading around the $3,000 support at the time of writing."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNTlV3NzJPUGpySWNiaHFoM0JKSTU0aVpBVlRtT1piaXRFT0ZXcVJYbXpnNEltTk5LR2R4cW1BaTVwTTBIM3dfbU9EQ2c5UlNBcnpFc2gybGF5WHF0NGJxWlJCUzZCM0xBYzdVRGEtLXd2MzdnalN0SnRRclNhVnVpWVlIRnFaTzZncWY2UjFvYUFGQVJfY05wbVJaWTVRUTZLX19uaHJuNVJIUVRMWXFuSnlRRDFpSy00T25V0gHAAUFVX3lxTE4zd2RiMHp3ZXJOWDcydk16d0xRWEQ5NzZoZTdnQU81WkVWUW1tTzRrNWlVNjdQaVRNN1lndWY1YXl3S1J1cWVPUVF5YTFJRnVmRE5GTW16RGpZSC12dHZDaWgyT0ZkTktMN29pcGVlYVdHbnFPVWpfalZmTlE1ekk4amxNMmlBUVRzV3BXSGtORmtISXRXbW5MNm1iN3dIWHVOa3RlbnJIdXlmSjZBeFNKSy1zdm8zektweFJyNmJ5UA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Crypto Whale Loses $4,500,000 Attempting To Leverage Long Ethereum (ETH) Twice: Lookonchain - The Daily Hodl",
        "content": "A crypto whale recently lost more than $4.5 million attempting to long Ethereum (ETH) twice, according to the digital asset tracker Lookonchain.\n\nLookonchain notes the whale lost $500,000 on their first attempt to long the top smart contract platform, then lost a lot more on their second try.\n\n“This whale sold all 10,701 ETH ($33 million) on Binance to repay debt two hours ago, losing more than $4 million again!\n\nHe went long ETH by depositing ETH on Compound and borrowing USDT to buy more ETH.”\n\nCompound (COMP) is a decentralized lending platform.\n\nLookonchain notes that other whales are accumulating Ethereum. One withdrew 10,000 ETH worth $31.5 million from Binance on Monday and staked it into the decentralized finance (DeFi) project Pendle (PENDLE) and Renzo, a liquid restaking token for EigenLayer. EigenLayer is a restaking protocol built on ETH.\n\nThe other whale withdrew 5,282 ETH worth $48.2 million from the crypto exchanges Binance and OKX on Monday.\n\nETH is trading at $3,093 at time of writing. The second-ranked crypto asset by market cap is down nearly 12% in the past week and more than 14% in the past month.\n\nEthereum is also more than 36% down from its all-time high of $4,878, which it set back in November 2021, according to CoinGecko.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOcW5WdGZEZTNjbUdMWDJNYkdZMG0zbkF6TFRFM1IyVFZITTNaMlhHUndHZ1l4bUw0WlJXRVpuYWJyeHpYbTdobFBNMWE0Sm5fVmRWOUpUR093QVYySU5RVnBIMUtBYnFjOGkxVVhXNEhrU2dxSEExVldaSmgwNnpNRkQ4eGZEX0FlQjI4UG530gGWAUFVX3lxTE9sN3o0WDE2azd4eUVtVC1xdDVnTDFJbEJoZWJnMjBtTnY3UVBVQUpUNlhrUzgyZWNKeFpJUTBHZ3BUdWJxSnZqYkNJLW4tczlSblRtU1lHWDZVd0ZObVVDdW91R0dTRWlXNi00OGp3MHZ0ckZiclQzWHJjeHF1dFlLbnJDZ1cxZmFTRnNpMGFiQ01wOF9udw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong's Bitcoin and Ethereum ETFs Could Fetch $25 Billion—If China Plays Nice - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHong Kong’s spot Bitcoin and Ethereum exchange-traded funds (ETFs) could begin trading by the end of the month, the veteran analyst behind 10x Research told Decrypt.\n\n“While no trading date has been set, expectations are for April 30,” said 10x Research founder Markus Thielen. He also writes research reports for Singapore-based trading platform Matrixport and was previously its Head of Research and Strategy.\n\nThielen's comments come the day after Hong Kong gave conditional approval for a number of spot Bitcoin and Ethereum ETF applications managed by China Asset Management, Harvest Global, Bosera, and HashKey, respectively.\n\nAs a result of the U.S. approving spot Bitcoin ETFs in January, there was a substantial increase in demand for crypto asset exposure, which has helped push along the most recent bull run. But according to Thielen, the level of success of Hong Kong ETFs heavily depends on whether Chinese mainland investors can purchase them.\n\nAD\n\nAD\n\nThe Shanghai Stock Exchange’s southbound stock connect allows qualified mainland China investors to access eligible Hong Kong financial assets. The southbound connect has a daily quota of ¥42 billion—and if exceeded, trades will be rejected. But in recent years, this quota hasn’t been reached.\n\n“This program allows mainland investors to buy up to ¥500 billion ($69 billion USD) of Hong Kong-listed stocks annually—or equivalent to HK$540 billion annually,” Thielen told Decrypt. “During the last three years, the annual spare quota was HK$100 billion to HK$200 billion ($15 billion to $25 billion).\"\n\n\"If Chinese investors could buy,\" he added, \"this is how much mainland investors could allocate—as an upper limit.\"\n\nHowever, this future seems unlikely for now, as Thielen believes that the ETFs will not become part of the southbound program for at least six months.\n\nAD\n\nAD\n\n“Most market participants expect Chinese mainland investors to be unable to buy these products and that they will not be added to the southbound connect program,” Thielen explained. “Currently, Hong Kong ETFs need to have been listed for six months, but regulation could always change.”\n\nThat said, Thielen suggested that due to “China’s property worries” and decade-long weakness in the stock market, the country could look to Bitcoin to diversify its assets.\n\n“Although some forms of Bitcoin activities are banned in China, the ban might be primarily motivated by the fear of social unrest due to scams, illegal capital raising, etc,” Thielen said. “A regulated product like the Bitcoin and Ether ETFs is more favorable.”\n\nDespite China’s ban of crypto trading and mining in 2021, the country has remained at the forefront of crypto conversations. In 2023, top crypto exchange Binance processed $90 billion of Chinese transactions in a single month—accounting for 20% of Binance’s worldwide volume at the time.\n\nSince then, Hong Kong has positioned itself as the next crypto hub—opening trading to retail investors and now approving crypto spot ETFs—which experts told Decrypt could be China using the territory as a “testing ground.”\n\n“Nothing happens in Hong Kong without China's blessing—not even a raindrop,” Thielen added. “So when the two leading financial market authorities (HKMA and SFC) approve Bitcoin and Ethereum ETFs, there must be a conscious decision and a calculation around the impact this might have.”\n\nHowever, Thielen suggested that this might not be as bullish as many crypto enthusiasts first thought, due to cultural differences in investing.\n\n“ETFs have limited success in Asia as investors like to take direct/concentrated bets, instead of buying a basket of something,” he said. However, in this case, as the ETFs represent a single asset rather than 10 to over 100 stocks, it’s much closer to being a direct bet.\n\nAD\n\nAD\n\n“Therefore, the success rate could be much larger than that of other basket-time ETFs,” he added.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNWW9yYWN6Q0k3S190Mm05Yk1tdUdjYVAyUkNLdWpRTENZTDNycUo4VDZVb1NwVTI4ak9VWURYdmRKRjBoNjdFdGhIemx1SWItVnhXX3NMa211TnE0ZGNvVGRQeVJjaFUyWHc1cHE4Y2prcEFPb3U3MlplZUJQNjVieWtuaXRub21Ldlk2eFA1cHNTWFJ4YXFzOHZXZjFSazVVaHhadm5lOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Top 4 accounting firm turns to Ethereum for blockchain-based business contracts - CryptoSlate",
        "content": "Big Four accounting firm Ernst & Young (EY) unveiled its new service for managing enterprise contracts via blockchain technology called OpsChain Contract Manager (OCM) on April 17.\n\nThe tool is designed to manage complex, multi-party business agreements with enhanced security and privacy via blockchain technology. The service is currently running on the Polygon proof-of-stake (PoS) blockchain and is slated for a future upgrade to the Ethereum mainnet.\n\nOCM\n\nOCM is designed to facilitate the secure handling of business contracts on a public blockchain, ensuring privacy by utilizing zero-knowledge proofs to maintain contract integrity and confidentiality while also improving time efficiency and reducing costs.\n\nIt integrates with existing enterprise systems through a standardized API and supports various contract types, including volume purchase agreements and price models dependent on market data feeds.\n\nWhile the service is currently promoted as operating on Ethereum, it actually utilizes Polygon PoS to capitalize on the lower transaction fees that are attractive to EY’s industrial user base, based on a report by the Block.\n\nPaul Brody, the head of EY’s blockchain division since 2016, said Nightfall — the technology behind the service — originated on Ethereum and has been tested on its test network. The forthcoming update will transition Nightfall to Ethereum’s mainnet and might include a Layer-3 upgrade to improve scalability and functionality.\n\nBenefits of public blockchains\n\nBrody also commented on the operational advantages of the OCM, noting that contract automation can significantly reduce cycle times and administration costs.\n\nHe emphasized the scalability and neutrality benefits of deploying on a public blockchain, which prevents any single party from controlling the network. Brody also noted that the future of corporate blockchain applications is increasingly leaning towards public blockchains, as they provide superior privacy and transparency compared to private blockchains.\n\nThe development comes in the wake of increased blockchain adoption by major financial players. Notably, BlackRock recently launched a tokenized fund on Ethereum, marking a significant step toward institutional engagement with blockchain technologies.\n\nWith the introduction of OpsChain Contract Manager, EY aims to improve how enterprises manage contracts, enhancing process efficiency and transparency through blockchain technology. The initiative positions EY as a pioneer in integrating blockchain into conventional business practices, setting a benchmark for the industry’s movement toward embracing this technology in routine operations."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQm5iaFZwUWhRLWVjbHFxWFdvWXFqMk45RGdkVmJWb05yRHRubWtTWjM2bThabjlOVnZLaUYtM1BZcVYzQjNHM3pBUEZNelVRREx5YXM1Ym5EMEI2dENCd0JRcXBibTVSV2JfQTQtSHhIdVVEazg1Rm5tUU1yVndZZDF5RHJxQdIBiwFBVV95cUxPRy1SMmJ6QmpTMlBLWWttSktyVTk1b0VSejlUWVg5MWZqODRQT05vaDJKemNiZnFxM1Z2Z2EwS3hpbkVyVnBLb0t1QUdFQ0MwTHE0NVo5QkZYYm5oV3Vod2lOQ1F0TmdnelkzbmZ6MEhRbC1TM0Z1VmNuWm1XaDZsdnMxaUJpbWY5aFh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum is at a real risk of falling below $3,000 - AMBCrypto English",
        "content": "ETH was down more than 16% over the week.\n\nSelling pressure was dominant, with no signs of whale accumulation.\n\nThe world’s second-largest cryptocurrency, Ethereum [ETH], was witnessing intense sell-offs and seemed to be in danger of sinking below $3,000.\n\nAccording to CoinMarketCap, the leading digital asset dipped 5.43% in the last 24 hours, and more than 16% over the week, owing to a mix of crypto-specific, macroeconomic, and geopolitical triggers.\n\nThe On Balance Volume (OBV) indicator, that measures buying and selling pressure, was falling faster than ETH’s price. This meant that there was a higher likelihood of further downsides in the days to come.\n\nWatch out for these levels\n\nIn a downtrend, strong support levels become an area of keen interest for market traders.\n\nProminent on-chain analyst Ali Martinez flagged the zone between $2,000 and $2,400 as “critical” for nearly 9.37 million addresses bought 53 million ETH at these price levels.\n\nThis suggested that if the slide continues, Ether may hit a bottom at the aforementioned level and then bounce.\n\nWhat are ETH whales up to?\n\nWhile discussions on corrections and rebounds happen, whales were quietly snapping up ETH at lowered prices.\n\nAccording to on-chain tracking platform Lookonchain, two whales were seen accumulating a combined amount of more than 15,000 ETH coins Monday, worth nearly $70 million at prevailing market prices.\n\nInterestingly, one of the whales staked their share of the withdrawn amount, around 10,000 ETH, into decentralized finance (DeFi) protocols like Pendle Finance and Renzo.\n\nAMBCrypto took a bird’s eye of the ETH market using Santiment, and noticed a drop in large whale transactions in the last few days.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nMoreover, holdings of major whale cohorts dipped significantly during this time, suggesting that most investors were transferring their ETH to the aforementioned protocols.\n\nMeanwhile, the Ethereum Fear and Greed Index flashed a neutral market signal, implying a balance between bullish and bearish sentiments."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOMjR1enVvTDJPenJhV2dIQms3UjZrQzRrMVFQazZrazZNN05IWnhoWkZlU3NFUWczNU9CVVByRGlGVWt1ekktX3Z2ZVpNMTN5dTAwWlhuWk54REpFdlZRWEMwbWZDMU4zZTZFUGY3UnhNRlBpejRUWnpid1dLcjRDSG81aDdLZ3lCSlRuaWtQVEJGcURGSDcteGZqdHFsUnhkVThBV1gzc0tkaGNrcjRweUZUNVNmMjZqNmphQUJsT2p3c1p1LVNYYzhSZGJ1SC1seDRvbC1OOFh3el9lcEc2ZNIB5gFBVV95cUxQTW1EZkdHakxneTZlOWV1VWw4Z0JXZUc5Vm9TNU8wb0Fod1hVMjJWMVM4bXBRLXBELXVyNW5LTWUzZ2VkYzBZTjFtbU8tY09hXzFxNG9kZWQzbmFDSF81aXNEbjJhNmpwX1gtdm1hbzlHdzI3OEZBWm9xRl9ITnNEVkVOcF91VVZjNXVuRkthZnpMV096czh4OHlUcXNSNDNtLW9OWUQya0hocWoxa0JnUWxjNm5RcTdsRnFYLTh4RjVWV0ptMGJ3eTZOZ19WZWJ0SDhMbUJLWW5yNktOd2JweTQzWlJIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum moves sideways as Q1 report indicates token burns are making it deflationary - FXStreet",
        "content": "Ethereum validator queue increase shows that restaking boom may be attracting more investors.\n\nEthereum shows deflationary signs as its burn rate outpaces emissions.\n\nEthereum may continue trading sideways as bears seem to be running out of steam.\n\nEthereum (ETH) continued a sideways movement on Wednesday as investors seemed to be waiting for an upward or downward price catalyst. Despite the price stagnancy, the ETH validator queue - possibly fueled by the DeFi restaking boom - rose sharply.\n\nRead more: Ethereum declines as crypto market crash increases bearish sentiment\n\nDaily digest market movers: validator queue, restaking boom, token burns, whale deposits\n\nEthereum's price is yet to show signs of appreciation on Wednesday as the market is moving slowly. Here are key market movers for the number one altcoin:\n\nEthereum's validator queue saw a sharp increase in April, growing more than 150% in the past month to reach 21,551 - its highest level since September 2023 - according to data from Validator Queue. Active validators within the network are also approaching the one million mark, growing from around 902,884 validators on January 1 to 984,375 on April 17.\n\n\n\nThe surge in validator interest can be attributed to the popularity of maximizing yields through Ethereum restaking. Made possible by Eigenlayer, users can earn additional rewards by using their staked ETH tokens to provide security to other protocols like bridges, oracles or rollups. In Q1, total restaked ETH grew by 36%, with over 4.3 million tokens restaked on Eigenlayer, according to CoinGecko. Liquid restaking protocols accounted for 2.28 million restaked ETH.\n\n\n\nETH burn rate is outpacing its emissions as more than 113,000 ETH were taken out of circulation in Q1, according to CoinGecko. The total number of ETH burned in Q1 was about 333,600 ETH compared to an emission of 270,500 ETH. This indicates that token burns are gradually making ETH deflationary despite not having a supply cap.\n\nAlso read: Ethereum recovers from dip as Hong Kong ETH ETF approval sparks whale buying spree\n\nCoinGecko also highlighted the increase in Ethereum Layer 2 adoption in its crypto industry Q1 report. L2s saw more than 900 million transactions in Q1 after the Ethereum Improvement Proposal EIP-4844 implementation in the Dencun upgrade saw gas fees reduced.\n\n\n\nWhile some whales bought the bottom by moving ETH over exchanges in the past week, FUD surrounding the second largest digital asset has been increasing recently following the market dump, according to Santiment. Celsius network deposited 8,091 ETH worth $24.5 million to Coinbase on Wednesday - their largest ETY deposit in three months - according to Spot On Chain. Between November and January, Celsius moved 847,626 worth an average of $1.9 billion to several centralized exchanges.\n\n\n\nAnother whale who bought 96,638 ETH from Coinbase at $1,567 in September seemed to be taking profit as he deposited 5,000 ETH to Kraken on Tuesday, according to Lookonchain.\n\nTechnical analysis: ETH to maintain sideways movement\n\nEthereum has struggled to enter an upward trajectory on Wednesday as it still hovers around the $3,000 support. It has continued a sideways downward-like movement as there's no catalyst to cause a significant price shift yet.\n\nWhile ETH continues filling the liquidity void formed on Saturday, a short-term Bitcoin halving effect could cause it to move upward briefly to cover the previous liquidity void of April 12. However, ETH faces a key resistance of $3,406 formed on April 7.\n\nETH/USDT 1-hour chart\n\nAs stated previously, ETH may continue trading within the range of $2,852 and $3,301 in the next few days, except if major factors prevail. These factors include the Iran-Israel conflict, Bitcoin dominance, and the Securities & Exchange Commission's (SEC) decision on an ETH approval.\n\nRead more: Ethereum price stagnates as EIP-3074 brings smart contract functionalities to wallets\n\nAnother factor to note is that ETH long liquidations have slowed down compared to the past two days. Long liquidations in the past 24 hours are at $29.3 million. This indicates that bear traders may be running out of steam; hence, a further price decline below the range given above isn't expected.\n\nETH is trading at $2,989 at the time of writing."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZXQ1RFF1V2RUTkI5YndpRXVaMDFKQW1XS09xV0tkYW9WZjJFQ0phdnlnSFVPLW5SRmxtVEhVSzlGZmpLdGxJOGk1eWNtNnU0STNLNHVrNThZeFVISHNnWWlTUklaTEgyZTl0WUdiRi1CRkl1VEtrV1NMQ3FUMFZNcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Dominance Hits 52.86%, Ethereum (ETH) Tests $3,000 Support, and Furrever Token (FURR) Secures $800,000 in Presale Phase - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 17, 2024 (GLOBE NEWSWIRE) -- In a turbulent weekend for the financial markets, cryptocurrencies felt the strain of geopolitical tensions, with Bitcoin (BTC), Ethereum (ETH), and Furrever Token ( FURR ) each navigating the upheaval in distinctive ways. Bitcoin showed resilience despite significant losses, Ethereum struggled to maintain key support levels amidst declining prices, and Furrever Token capitalized on the volatile market environment, boosting its presale figures significantly as investors looked for promising opportunities in the lead-up to the Bitcoin halving.\n\nDespite a Dip Over the Weekend, Bitcoin's (BTC) Market Dominance Reaches a New High Since April 2021\n\nThis past weekend saw a downturn in asset values as traders adjusted their portfolios in response to conflicts in the Middle East. By late Saturday, it appeared that most assets had reached their lowest points.\n\nOver the weekend, while the stock market was closed and unable to react to the escalation involving an Iranian drone targeting Israel, the cryptocurrency market was active and responsive.\n\nThe general trend saw a decrease in asset prices as traders reevaluated their positions and reduced exposure to higher-risk investments. Bitcoin, despite being the least affected among major cryptocurrencies, dropped from a high of over $70,000 on Friday to just above $63,000 by the end of Saturday, marking an 11.6% decrease.\n\nBitcoin's resilience was notable compared to other cryptocurrencies. Coinglass reported that long liquidations on centralized exchanges totaled over $757 million on Saturday, with Bitcoin accounting for $261 million of those liquidations.\n\nCryptocurrencies like Bitcoin are considered less risky compared to more speculative ones such as Dogecoin, which experienced nearly a 30% drop from its peak on Friday to its trough on Saturday.\n\nThere was a modest recovery across most assets after hitting what seemed to be a floor late on Saturday. Theoretically, Bitcoin could have seen a surge during this turmoil, as it is often considered a \"safe haven,\" akin to gold. Recently, gold has seen significant gains due to the Middle East conflict, potentially benefiting Bitcoin, frequently dubbed \"digital gold.\"\n\nHowever, with the stock market closed, cryptocurrencies like Bitcoin had to absorb the full impact of the market's reaction. Despite these challenges, Bitcoin still emerged as a top performer.\n\nOver the weekend, Bitcoin's market dominance—its market cap's proportion relative to the total cryptocurrency market cap—rose to 52.86% on Sunday, marking the highest point since April 2021.\n\nStory continues\n\nThis increase in dominance comes after a low in February when Bitcoin's dominance fell to 43% due to a surge in altcoins, representing the smallest share since March 2023. This reversal underscores Bitcoin's renewed strength in the market, achieving its most substantial market share in three years.\n\nEthereum (ETH) Remains Above the $3,000 Support Level\n\nEthereum (ETH) has recently faced challenges as its price has seen a decline of 21% between April 9 and April 14, reaching a 50-day low. Despite recovering some losses, Ether continues to struggle, especially after failing to break through the $3,200 resistance on April 14. Currently trading at $3,066, Ether has experienced a daily decrease of 1.46%. This ongoing instability raises concerns about the sustainability of its $3,000 support level.\n\nIn the derivatives market, there is a notable shift in sentiment among professional traders, indicating a decrease in risk appetite. This sentiment is reflected in the ETH options market, where the delta skew metric has reached its highest bearish level in over two months, suggesting a growing demand for downside protection.\n\nAmidst this market uncertainty, there is cautious optimism regarding the approval of a spot Ether ETF in May, although analysts remain mixed due to the conflicting signals from on-chain and derivatives data. Senior Bloomberg ETF analyst Eric Balchunas pointed out the low likelihood of ETF approval given the lack of critical feedback from the SEC during recent meetings.\n\nComparatively, Ether's downturn has been more pronounced than other major cryptocurrencies like Binance Coin (BNB) and Tron (TRX), but less so than that of Solana (SOL). It should be noted that Ethereum's network total value locked (TVL) has surged to its highest in 13 months on April 15, reaching 16.4 million ETH, which is a 14.8% increase month-over-month.\n\nDespite these challenges, the anticipation of a decision on the spot Ether ETF in May could still provide a positive impact on Ether's price and on-chain activity. However, the increasing risk aversion among professional traders, as evidenced on April 16, suggests that the potential for further price corrections below $2,900 should not be overlooked.\n\nFurrever Token (FURR)’s Presale Raises Over $800,000 as Bitcoin Halving Approaches\n\nFurrever Token (FURR) is distinguishing itself as a strong contender, demonstrated by an impressive presale that has already exceeded $800,000. As the crypto community braces for the Bitcoin halving, FURR is strategically positioned to capitalize on the increased interest and investment that typically accompany this event.\n\nOffering a compelling entry at just $0.000564 per token, Furrever Token has attracted a wide array of investors, drawn by the potential for significant returns. This vibrant investment interest is bolstered by FURR's dynamic community, which includes over 4,100 active members on its Telegram channel, providing robust support and fostering lively discussions that enhance the token’s market presence.\n\nAs the market anticipates the Bitcoin halving, Furrever Token is not just riding the wave but actively preparing to leverage this period of heightened activity. The team behind FURR is pushing forward with strategic partnerships and innovative features aimed at boosting the token's adoption and enhancing its value. These efforts are designed to align FURR’s trajectory with the broader market dynamics expected post-halving, ensuring that the token remains appealing to both new and existing investors.\n\nWith its strong presale performance, active community engagement, and strategic market initiatives, Furrever Token is poised for significant growth. As it continues to navigate the evolving cryptocurrency landscape, FURR stands out as a promising investment opportunity, ready to benefit from the upcoming market momentum and deliver substantial returns to its holders.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support(at)furrevertoken.com to avoid potential scams.\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE93MHU4TFk2a2dMamhiTHBOWHoyS0pQYkhLbjBvWFRCMXl1RkNMYTZQSkRWcWJnQ3h1UDBHZ1FHYzBJU1hiTnBScE84OTlnSHJ6bldYX2RlRHdmOXdnZkxwQXI1eDVRTlRORFFNN1pxZWE3S1VLWHRhNVJsSHF0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "VanEck enables staking on ethereum ETP - ETF Stream",
        "content": "VanEck has enabled staking on its ethereum exchange-traded product (ETP) to generate additional income.\n\nThe group said investors in the $143m VanEck Ethereum ETN (VETH) will be able to earn up to 5% in staking rewards.\n\nStaking is the process of depositing crypto assets on the blockchain to validate transactions, generating a premium that is returned to investors.\n\nValidators are more likely to be selected based on the amount of cryptocurrency they hold and are willing to sell as collateral.\n\nVanEck added some of the staking rewards may be reduced due to staking service provider fees.\n\nVETH launched in March 2021 and has a total expense ratio (TER) of 1%.\n\nMartijn Roezemuller, CEO of VanEck Europe, said: “Following ethereum's switch from the so-called proof-of-work (PoW) to the so-called proof-of-stake (PoS) consensus mechanism, it was clear to us that we would follow the developments in the second most important cryptocurrency.\n\n“By changing the consensus mechanism, ethereum consumes significantly less computing power and electricity. Staking can now be considered a key aspect of securing and maintaining the integrity of this blockchain network.”\n\nThe move follows CoinShares, which enabled staking on the $197m CoinShares Physical Staked Ethereum ETP (ETHE) in February."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZnZxUGNFZTRKcUo4MEJpRnpNeGN3b3BfYTB5T3ExcXh4QzhZYmEzdTR0VTRxTXRhYWlNMDZTX00wRTNJRV80NHVOUnIxMWtTZ1Exd2RDdi1iWDJ5bjVDVlUzd0Roa0pSWm4wdERUNWpPaHVUaFl2WlVIMEdwcjhMaXNoZmptZU0y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Furrever Token Foreseen to Deliver ROI Comparable to Bitcoin (BTC) and Ethereum (ETH)'s Success in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 17, 2024 (GLOBE NEWSWIRE) -- The markets have been bleeding out over the past couple of days, with both Bitcoin (BTC) and Ethereum (ETH) experiencing a 2% dip in their prices. However, amidst this downturn, Furrever Token (FURR) has emerged as a bright spot, surpassing the significant milestone of $800,000 during its sixth presale stage. This contrast highlights the dynamic nature of the cryptocurrency landscape, where while some major players face temporary setbacks, newer projects like FURR demonstrate resilience and potential for growth.\n\nBitcoin Faces Geopolitical Headwinds Amidst Price Volatility: Dipped 3.4% Since Yesterday\n\nBitcoin's recent attempt at recovery was abruptly halted yesterday afternoon following renewed geopolitical risks, causing the digital asset to turn downwards once again. The largest cryptocurrency witnessed a 3.4% decline, retracing its gains from the previous day and closing around the $63,400 mark. Today, Bitcoin briefly dipped to the $61,000 range before bouncing back to the $63,000 zone with the opening of the European session. Amidst continued volatile movements in the Bitcoin market, significant liquidations persist in futures crypto trading, with $274 million worth of positions closed in the past 24 hours, 200 million of which were long positions, indicating investors' maintained optimism despite the downward trend.\n\nExternally-driven news dominates the Bitcoin market, with a brief upward movement towards $66,000 seen after the Hong Kong news yesterday, but this positive development was short-lived. However, investors are keeping a close eye on the upcoming halving event scheduled for April 20th, anticipating its potential impact on Bitcoin's supply dynamics and market sentiment.\n\nEthereum Faces Crucial Support Levels Amid Market Turmoil\n\nAmidst a widespread selloff in the cryptocurrency market, Ethereum (ETH) faces scrutiny as its price dips by 2% to approximately $3,059, according to coinmarketcap.com. With attention turning to critical support levels, renowned crypto analyst Ali Martinez highlights a pivotal zone between $2,000 and $2,430, where 9.37 million addresses collectively hold nearly 53 million ETH. Martinez's analysis underscores the significance of this range in determining Ethereum's price direction amidst market volatility.\n\nDespite the downturn, optimism persists within the crypto community, buoyed by recent regulatory approvals such as Hong Kong's green light for Bitcoin and Ethereum ETFs. Moreover, the anticipation surrounding the upcoming Bitcoin Halving event adds intrigue, although concerns over short-term volatility linger. As investors navigate uncertain terrain, Martinez's insights offer valuable guidance, emphasizing the importance of monitoring market dynamics and expert analyses.\n\nAmidst the price dip, Ethereum's one-day trading volume remains near the flatline at $22.42 billion, with the ETH price down 7.48% over the last 24 hours and nearly 16% over the last seven days. The Ethereum Futures Open Interest has also declined by 6.01% to $10.91 billion, indicating ongoing market turbulence.\n\n\n\n\n\nFurrever Token (FURR): Riding the Wave of Market Downturn with Resilience\n\nDespite the broader market downturn, Furrever Token (FURR) stands out as a beacon of resilience, navigating the choppy waters of the crypto landscape with unwavering momentum. Surpassing the significant milestone of $800,000 during its sixth presale stage, FURR demonstrates a remarkable ability to thrive amidst market volatility. This success can be attributed to the project's unique value proposition, centered around infusing the crypto space with an irresistible dose of cuteness. By leveraging the universal appeal of adorable cat imagery, FURR offers users a one-of-a-kind experience that transcends traditional use cases, capturing hearts and garnering enthusiastic support from its growing community.\n\nAt the heart of FURR's appeal lies its commitment to creating a whimsical and heart-warming crypto ecosystem. From cute cat-themed stickers and emojis to captivating visuals, every aspect of the project is meticulously designed to evoke joy and foster a sense of camaraderie among users. This emphasis on community building extends beyond mere aesthetics, as FURR actively cultivates a warm and inclusive environment where members can connect, share experiences, and revel in the shared love for all things adorable.\n\nCentral to FURR's success is the active engagement of both its team and community members. With a shared vision and a passion for spreading happiness through crypto, the FURR community is united in its pursuit of creating a more enjoyable and fulfilling experience for all participants. Whether through lively discussions on social media channels or collaborative efforts to support the project's growth, every member plays a vital role in shaping the future of Furrever Token.\n\nAs of now, FURR is trading at a price of $0.00048 and holds the potential for up to 15X returns, offering investors an enticing opportunity to capitalize on its unique value proposition and strong community engagement.\n\nIs Furrever Token (FURR) Legit?\n\nFurrever Token (FURR) boasts legitimacy with an audited smart contract, a planned PancakeSwap launch, and no buy/sell tax. Team token lock-up and community-driven governance further enhance credibility. With nearly 4,000 Telegram members, support@furrevertoken.com is the sole trusted email address for communications, safeguarding against potential scams.\n\n\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQN2FIeHl2WjAxVmtxVVdhOWxrUHp3bUMxc2FTOGhTUWx6VnVQUTg1bU5PQmd0blF4bHJDMC1IWU8yTTQ5c0RsVEwyS01xQXBjNlVsX3BzNHpVNGo2d0R1UmpmMHJ6Wk1QdzhJUDJob29Xb3I0aTFHWDY1b3FqNTRnTmFKU0szUW9tVVk1WkJYQU03U21GU19DdjJ4LVQ3MTdWU0l1YmF6UnRfOW5yQnpHaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong’s Bitcoin, Ethereum ETFs projected to hit $1 billion in assets within two years - CryptoSlate",
        "content": "Bloomberg analysts have revised previous inflow predictions for Hong Kong’s newly approved Bitcoin and Ethereum exchange-traded funds (ETFs) to $1 billion within the first two years.\n\nBloomberg senior ETF analyst Eric Balchunas had previously estimated the funds to garner roughly $500 million in inflows over a similar period due to doubts over Chinese investor eligibility and a lack of maturity in the Hong Kong ETF market.\n\nChinese investors exposure\n\nEric Balchunas, Bloomberg’s senior ETF analyst, highlighted the challenge faced by Chinese investors seeking exposure to newly approved ETFs in Hong Kong.\n\nCiting a research note from colleague Rebecca Sin, Balchunas emphasized that China’s ban on the underlying assets related to these ETFs complicates accessibility for interested investors within the jurisdiction.\n\nChina has long upheld strict regulations on the burgeoning crypto sector. The country initially banned cryptocurrencies in 2013 and extended the restrictions to mining in 2021.\n\nMoreover, Sin’s analysis noted that retail Chinese investors might attempt to bypass this restriction by leveraging the $50,000 remittance quota to invest in these ETFs.\n\nHowever, the feasibility of this investment route remains uncertain due to its limited functionality and the potential regulatory hurdles that might emerge for institutional investors.\n\nAUM to hit $1 billion\n\nWhile these restrictions pose a significant challenge for the Hong Kong-listed crypto ETFs, analysts still foresee them attracting substantial interest and predict they will hit $1 billion in assets under management (AUM) within the first two years.\n\nBalchunas explained that the $1 billion milestone relies on significant enhancements in Hong Kong’s financial infrastructure and ecosystem.\n\nPresently, Bitcoin ETFs in the Asia-Pacific region command $250 million in AUM, distributed across five ETFs, three based in Hong Kong and two in Australia. The largest fund, the CSOP Bitcoin Futures ETF listed in Hong Kong, boasts $121 million in AUM.\n\nAmong the three firms poised to introduce spot ETFs, Bosera and Harvest collectively manage $50 million across nine ETFs. In contrast, ChinaAMC, with 15 ETFs and $3.6 billion AUM, is a significant player expected to have a considerable impact upon launching its spot crypto ETFs.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQdHNObkFWN0RGN2F5Wm5TeFZwX19pTTQwWmdtR19JSjdhNXdyZlNXcVVLTC0zX3NwVlJHcW1sdGozcWZnbHBfd29tZUFmYUZEVGRCZy1hbm9vVUVyWkZISFZGdzczQXprZUdlVndPYnJENHB3UHI3T3FhT3BMX1RMZ090LTJkYk9CR1dxakFfeEl3U2ktQTdBNjVSSXItUHhacHpXN1dESmMzcWMzTzFBNU9KODNqV1k3M2NyQnZ4RGN1T0d5VzJj0gHMAUFVX3lxTE85OU5VdFdmUGdUcWh2NV9DOHlUeW1Kd1FKWHRjTHdEMF9wcFcybTB1Y2c5OHhINFp1RTc0Y2NET1FnQ3Z2RkpmWXdEc2ctVHhXeS1BMDZyWldMWkN5c2pEaGpVUXg2bEFZQllzR3I1MThUdkd4UXJ0ZDdVcGJLVVZVSE41MFpoOVpTcTk2dWZnRlYxdGhBN1c4UFB6UU9yaEdnWkNmdjB3aUZGMlU0VElzYVdSeFRqRVVBQVNGRVI4NVNVN2NKby16OWFZNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says 80% of His Crypto Portfolio Allocated to One Ethereum Rival - The Daily Hodl",
        "content": "Macro guru and ex-Goldman Sachs executive Raoul Pal is revealing that he’s heavily invested in one Ethereum (ETH) competitor.\n\nPal says in an appearance on the Bankless YouTube channel that the native token of the layer-1 blockchain Solana (SOL) comprises about four-fifths of his crypto holdings while the rest is in memecoins, digital collectibles and in a digital assets-focused investment vehicle.\n\n“I am 80% SOL. All of my ETH is now NFTs (non-fungible tokens), I have been buying high-end art NFTs.\n\nI then have a bunch of the portfolio in the fund of hedge funds in Exponential Age Asset Management.\n\nAnd I have 1% in stupid s**t like dogwifhat, Dogecoin and Bonk. Got all of those. But that’s 1%… just to be clear I’ve got like in all of memecoins and everything else, 1% of my portfolio. I am 80% Solana.”\n\nOn what convinced him to bet heavily on Solana, the former Goldman Sachs executive says,\n\n“The chart that was a standout in 2022 was the Solana/Ethereum chart. And that was the chart that got me buying Solana and then going all in. Much like I went into Ethereum all in about September 2020. I just did it earlier in Solana.”\n\nSolana is trading at $133 at time of writing, up by over 1,240% from the 2022 closing price of about $9.89.\n\nOver the same period, Ethereum has increased by around 155% from the 2022 closing price of around $1,200 to the current $3,062.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBBY3FRaExGTUxHMjdPdE90cEpIbGlkSmF5eUt5cTRiVEZoaVVMZDRoQ0NpTm5Nc3oxdG13ZVNjTzhwaVBHdVAyb1VpdU5tbDJld3BYc0lNNGhNMl9yMURudHg5MGtqekFYY2VaQ3ZMa0hTajg4Q3lzbUJNNy0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price : Will ETH Price Recover In 2024 ? - CoinGape",
        "content": "Ethereum has been facing challenges in holding onto its top spot in the market among altcoins. The bears causing the global cryptocurrency market decline are also dominating ETH. After dropping more than 11% in the last month, it appears the coin is loosing ground to Bitcoin. With the Bitcoin halving event on the horizon for April 20, 2024, the crypto community is eagerly anticipating whether the price of Ethereum will see a rebound. Let’s explore thoroughly to discover the potential.\n\nMarket Performance of Ethereum Price\n\nadvertisement\n\nIn the last 24 hours, Ethereum experienced a 5.19% drop in its price, falling to $3,086.39. The significant drop in its market performance has also been highlighted by the significant decrease of ETH, by 14.27% and 11.36% in the last week and month respectively.\n\nAccording to CoinMarketCap, Ethereum holds the title of the second largest cryptocurrency with a market capitalization of $371.15 billion. Moreover, the coin experienced a drop of around 5.86% in its trading volume, reaching $21.77 billion, in the last 24 hours. This decrease shows lower liquidity and trader interest in the coin.\n\nETH price reached its highest point at $4,891.70 on November 16, 2021. After that, Ethereum has experienced a decrease of around 36.67% reaching the current price.\n\nFactors Determining the Recovery of Ethereum Price\n\nVarious factors play a role in the recovery of ETH price as discussed below.\n\n1. Bitcoin Halving\n\nBitcoin Halving might also impact the rise in ETH trading price. The event that takes place after every four years, has a notable effect on the cryptocurrency market. It could impact the Ethereum (ETH) price in different ways. Initially, the halving decreases the amount of new coins being introduced into circulation. This limited availability may result in higher demand as investors look to spread out their investments. If the price of Bitcoin increases after the halving, Ethereum and other cryptocurrencies are expected to also see price hikes because of the increased interest in the market.\n\nAlso, Bitcoin halvings result in excitement and speculation within the investment community. This feeling can also affect other cryptocurrencies. Anticipating positive impacts from Bitcoin halving, individuals might choose to invest in other cryptocurrencies such as Ethereum, leading to an increase in their value.\n\n2. Ethereum ETFs\n\nIncreased attention from institutional investors and major companies in Ethereum may bring stability and boost the price. The potential launch of new spot Ethereum exchange-traded funds (ETFs) in May, 2024 could lead to a surge in Ethereum’s value, similar to the impact of Bitcoin ETFs. However, analysts are concerned about the SEC approval process, with the likelihood decreasing from 70% to 30% due to a lack of communication from regulators. Investors should be cautious about expectations surrounding the approval of Ethereum ETFs.\n\n3. General Cryptocurrency Market Recovery\n\nA recovery in the cryptocurrency market can result in Ethereum’s price bounce due to various factors. Firstly, as investor confidence grows with the market’s rebound, more individuals are likely to invest in Ethereum. Secondly, renewed capital inflows into cryptocurrencies typically include Ethereum due to its reputation and use cases. Additionally, Ethereum often follows Bitcoin’s trends, so when Bitcoin’s price rises during a market recovery, Ethereum’s price also tends to increase. Moreover, market liquidity and trading volume can rise during a recovery, leading to smoother price movements and potential upward pressure on Ethereum’s price. Furthermore, increased interest in blockchain technology and decentralized applications can drive further demand for Ethereum. Institutional investors may also be attracted to Ethereum during a recovery, contributing to its price growth.\n\n4. ETH’s Price Forecast\n\nBoth the Exponential Moving Average (EMA) and Simple Moving Average (SMA) show that short-term periods of 10, 20, and 30 days are signaling a bearish trend based on technical indicators. The Ethereum price is below thes moving averages, showing the possibility of a price drop in the short-term.\n\nSimilarly the EMA and SMA for extended durations like 50, 100, and 200 days are also indicating a downward trend. indicating a bearish direction. The current price of ETH is below these moving averages, showing that the overall price movement of Ethereum remains bearish.\n\nThe MACD with 12 and 26 periods is giving a Buy signal, suggesting a possible short-term turnaround.\n\nThe MACD, which is a momentum indicator, calculates the variance between two moving averages, and the Buy signal could indicate a slight move towards an upward trend for ETH.\n\nHowever, there is a Sell signal shown by the EMA across different time periods, ranging from 10 days to 200 days. This indicates that Ethereum’s price might keep experiencing downward pressure in the near to medium future. The RSI (Relative Strength Index) at 37.6 is in the neutral range. It indicates that ETH’s price is neither overbought or oversold, suggesting there may be potential for a price reversal if the RSI moves further towards either extreme.\n\nOn the downside, should the price of ETH, it will find support at $2698.5. Should the decline further past the level, it will find another key level at $2698.5. Any more losses might see the price drop further to $2361.2\n\nIf the bulls fail to protect the $2698.5 support, the price might decline toward $2361.2.\n\nOn the upside, the price is now facing resistance near the $3581.4 level and the trend line. The next major resistance is near the 3789.7 level. A clear move above this level of resistance could send the price toward $4127.\n\nConclusion\n\nDespite facing hurdles and declines, Ethereum price shows indications of potential recovery and opportunities for a comeback. The future Bitcoin halving and possible introduction of Ethereum ETFs may have a positive effect on the price of Ethereum. Moreover, the collective rebound of the crypto market could help reverse the direction of Ethereum’s price movement. Investors need to monitor important support and resistance levels, alongside changes in technical indicators like RSI, EMA, and MACD, to detect any shifts in momentum. Ultimately, Ethereum’s future success will be influenced by various factors, making it crucial for investors to remain informed and prudent."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBaSm04UmFNQWZkMmNMbnVVNUV2QWJGbHh2em42a3pYa3A1VkZ5dDIyN3owdmNDdElsUDczbFgzeVo0UVk2bm90RHhoLWxYcDJvR0F2TTR3MUVQYVBobENGanhzLU45LUJhYUU4RWFJYzN6VUdiaVpUMDJvUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Why Are Ethereum Investors Flocking to BlockDAG? - NFTevening.com",
        "content": "Cryptocurrency investment is shifting focus from traditional stalwarts like Ethereum to newer, high-potential projects like BlockDAG. The appeal of BlockDAG is undeniable, with the project recently accumulating $17.9 million from its presale and an additional $2.1 million from miner sales. As debates intensify within the Ethereum community about its future issuance policies, BlockDAG is seizing the spotlight with promises of a 30,000x ROI, courtesy of its groundbreaking mineable network and a keynote video teaser on the Moon.\n\nEthereum’s Present Challenges\n\nCurrently, Ethereum is facing internal contention regarding its issuance curve as it transitions to the Electra upgrade. The community is divided over proposals aimed at reducing token issuance to support solo stakers, with notable figures like Eric Conner and Ahmad Bitar vocal in their opposition. They argue that such changes might compromise Ethereum’s role as a decentralized currency, spotlighting the ongoing struggles to balance evolution with core values.\n\nBlockDAG’s Impressive Presale and Promising Roadmap\n\nBlockDAG is making waves in the crypto presale scene with over $17.9 million already secured in its latest funding rounds, alongside significant earnings from miner sales. The platform’s forthcoming keynote, featuring an innovative display of BDAG on the moon, is set to captivate a global audience. Additionally, promises of enhanced market liquidity, potential listings on major exchanges such as KuCoin and CoinEx, and an initial listing price of $0.05 reflecting a nearly 4900% increase from initial offerings; underscore its ambitious growth plans.\n\nBlockDAG leverages a novel approach to blockchain technology at its core, offering developers a dynamic environment to build, deploy, and monetize their applications efficiently. The platform facilitates various blockchain functions, from crafting smart contracts with popular development tools to running applications on a test network before a full-scale launch. Opportunities for developers to generate income through various channels, including transaction fees and token sales, position BlockDAG as a vibrant ecosystem for blockchain innovation.\n\nFurthermore, BlockDAG’s adoption of Directed Acyclic Graph (DAG) technology ensures that scalability and performance are maintained as the network grows, supporting a diverse array of business applications and fostering ongoing innovation and community engagement.\n\nConcluding Thoughts\n\nAs the crypto community continues its search for the next ample investment opportunity after Ethereum’s monumental success, BlockDAG presents a strong case with its potential for a 30,000x return on investment. Facing internal debates and growing concerns within the Ethereum community, BlockDAG emerges as a more attractive option for discerning investors. With substantial presale revenue of $17.9 million and a supportive community excited by its innovative solutions, BlockDAG is well-positioned to transform the investment landscape following the keynote video teaser over the moon a feature not dared by any crypto before.\n\nThis emerging platform promises significant returns and boasts a robust technological foundation and an ambitious roadmap, making it an appealing prospect for early investors. Discover BlockDAG by visiting their website and considering the investment opportunities available in what could be the next breakthrough in the crypto sector.\n\nBuy BlockDAG Now\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE44NnZBUXgtSTNycGRkT1IyUlkwT1I3SG9zNTczcjJXQ2ZjWmFjS1IzWUMwZGNpS3l2b21aZWdPRUdPTWhMd1huNmVPbUNTWmRKNjdwYmRnUy1zQkdNc09HMWdnei1kVmM0Ym9UV2ItQVA1SExzdzlrMHln0gF_QVVfeXFMTzZMV2ZxQXVqb0tzenFmVnFLbmVCLXV5VmF1ZHJRQUJIU0lnWXdmVzVSekVGamhPMmpWTllMUWVzRkE0bUFmN0wxYW9EUmNRclFkZXlXY2Y2Wk14MHMxeXZsYmNvUS1kS2xqX0JCcllqaDRoWHRHVFBSNzctQWx2NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Ethereum Wins Big' With New US Stablecoin Draft Bill: Expert - Bitcoinist",
        "content": "The introduction of a new draft bill aimed at regulating stablecoins in the United States has ignited a firestorm of debate within the cryptocurrency sector. This legislative development, while still in its formative stages, is positioned to significantly alter the operational landscape for digital currencies, particularly Ethereum and its associated stablecoins.\n\nA Big Win For Ethereum?\n\nRyan Berckmans, a prominent member of the Ethereum community and an investor with extensive experience, provided an enthusiastic analysis of the draft bill. He shared his thoughts via X, a popular social media platform, where he described the bill as “extremely bullish” for Ethereum.\n\nAccording to Berckmans, the draft bill’s most significant feature is its broad legitimization of stablecoins on public chains, particularly Ethereum, where a significant majority of stablecoins are minted. “My initial read is that the bill is extremely bullish and legitimizes Ethereum like never before. The bill broadly legitimizes stablecoins on public chains in America, where 59% of all stablecoins are minted on Ethereum, rising to 93% when excluding centralized platforms like Tron,” he stated.\n\nHe further elaborated that the legislation “opens floodgates for US banks to obtain stablecoin licenses and for certain private companies to issue up to $10 billion in stablecoins without a license.” This provision could potentially transform the banking sector’s approach to digital currencies, integrating them more deeply into the financial mainstream and broadening their use across a range of economic activities.\n\nFurther elaborating on the positives, Berckmans was pleased with the bill’s approach to assets not pegged to the USD, such as on-chain euros and gold. The bill, according to his interpretation, does not impose regulatory measures on these assets, which could maintain a free and globalized market for them and enhance their appeal as alternative reserve currencies or investment assets.\n\nHowever, Berckmans also identified several areas of concern within the draft bill. Notably, the bill imposes strict regulations on unlicensed USD-pegged stablecoins, potentially prohibiting their issuance to US persons residing in the United States. This could impact popular decentralized stablecoins like DAI. Additionally, he criticized the bill’s definition of “algorithmic payment stablecoin” for being overly broad, which could encompass a range of decentralized stablecoins that use algorithms to maintain their peg to the dollar or other assets.\n\n🚨New stablecoin bill draft🚨 My initial read is that the bill is extremely bullish and legitimizes Ethereum. Disclaimer: I'm not a lawyer or regulatory expert. I read through chunks of the new bill[1] and analyzed it with GPT4. Analyze it yourself[2] TL;DR\n\n– Ethereum wins big… — Ryan Berckmans ryanb.eth (@ryanberckmans) April 17, 2024\n\nConcerns And Criticisms\n\nContrasting sharply with Berckmans’ optimistic perspective, Jake Chervinsky, Chief Legal Officer at Variant Fund and a former CLO of the Blockchain Association, provided a much more critical viewpoint. Chervinsky expressed his concerns via X, stating, “The bill published today is deeply flawed: it appears to ban nearly everything except a narrow band of centralized, custodial stablecoins.”\n\nStablecoin legislation should be a top priority for everyone who cares about crypto policy. But the bill published today is deeply flawed: it appears to ban nearly everything except a narrow band of centralized, custodial stablecoins. This would be far worse than status quo. — Jake Chervinsky (@jchervinsky) April 17, 2024\n\nChervinsky also pointed out that the draft bill seems to contravene several principles he advocated for in his testimony to Congress last year. According to him, a focus on custodial stablecoins should be paramount, but the bill instead appears to create anti-competitive regulatory moats that could hinder further development in the space.\n\nDespite these divergent views, Berckmans remained hopeful about the broader implications of the bill. He envisioned a scenario where the restrictions on USD-pegged stablecoins could inadvertently boost the market for non-USD stablecoins, allowing them to flourish and diversify the stablecoin market significantly. He speculated that in the future, the dominance of USD-pegged stablecoins could decrease, making way for a more balanced stablecoin ecosystem.\n\nAs the cryptocurrency community continues to analyze and debate the draft bill, it is clear that the final version of the legislation will be critical in shaping the future of stablecoins and blockchain technology in the United States and possibly globally.\n\nAt press time, ETH traded at $2,984.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9fNEpsZFd3dUR4Z19ScTVtNHZXUXlsZmtweFowcHlmVlJ6Tjhfc1JDVU9CS0M3NDlBN0l3SjZzU2pQbHBheEFkV0hBSy1oWlJ0RnJZRUJZcnBlWDF2amltcEJfcFdRaU1BS292TUVhcmZjWEZnLW51RU5R0gF_QVVfeXFMTnFOcWNoR09rRUdNVlZGVjBjTWoxTUJyeTdXRWc4elhFVm0zSWw2eEFJdl9kVTVXUjJGNUV2RlhxSy1qQUp1WWNreVdRRlVXQkNiYW1iWEtvRldkUi1lSkFHSzAydVNVWWp6eHlJdm1NQ0IxUEFhUmdRY21lTDczZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ancient Ethereum Whale's 5,000 ETH Sell-off stirs market - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain analytics firm Lookonchain, an Ethereum whale who accumulated a substantial amount of ETH at the market bottom in September 2022 has made a notable deposit of 5,000 ETH to popular cryptocurrency exchange Kraken.\n\nAdvertisement\n\nBack in September 2022, when the Ethereum network transitioned to a proof-of-stake consensus, the whale took advantage of the opportunity to buy ETH at what was considered the market bottom. The timing seemed right as the price of Ethereum was nearly $1,567 per ETH, totaling a value of $151.42 million for the bulk purchase.\n\nAccording to Lookonchain, the ETH whale withdrew 96,638 ETH worth $151.42 million at the time from Coinbase at $1,567 from Sept. 3 to Sept. 7, 2022.\n\nThe whale that bought $ETH at the bottom in Sept 2022 appears to be selling $ETH at a profit again.\n\n\n\nHe deposited 5K $ETH to #Kraken 56 minutes ago.\n\n\n\nHe withdrew 96,638 $ETH($151.42M at the time) from #Coinbase at $1,567 from Sept 3 to Sept 7, 2022.\n\n\n\nAnd he currently has 76,638… pic.twitter.com/5FR0TXRGF5 — Lookonchain (@lookonchain) April 16, 2024\n\nFast forward to now, and the same whale has transferred 5,000 ETH to Kraken, presumably to sell it at a profit. When whales deposit their tokens into exchanges, it typically suggests a potential sale, while withdrawals signal an intent to buy.\n\nAt the time of the deposit, the price of Ethereum had risen, indicating a significant profit margin for the investor. The whale still has 76,638 ETH worth $233.56 million remaining, for a total profit of more than $153.7 million.\n\nThe whale's action indicates that the perfect combination of timing and market sentiment can lead to significant returns. The wrong timing might lead to ultimate losses, which was the scenario of another ETH whale who saw significant losses as the ETH price dipped.\n\nEthereum saw selling pressure at the start of the week after reaching highs of $3,281 on April 15. The drop persisted, with Ethereum falling for two consecutive days before slightly rebounding. At the time of writing, ETH was up 0.43% in the last 24 hours to $3,058.\n\nAs reported, an ETH whale sold their 10,701 ETH stash worth $33 million, losing more than $4 million for the second time after going long on ETH. The first time, they lost almost $500,000."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNVU9TcWFBZHJmbVBPVnZfY0lVWEhESkVFZGtNYlN4NEp0TEZRX2l0R0g5ZVpDN3RtSkFvM1lfM0tSYVFGeFdWV1QwLXpQWnZnVXo2VjV6MnExX1ZNdkRoY2pJRks5V2ViMUZsMDQwOVZZenpFQlRaQ3BCMGZlUzNkX0xjZG9aWU1vSkZPMWRSUWxDMmZ4SEFFeGJmdU1ESF9aTXB1b1FqLXVid9IBrwFBVV95cUxNLTR3SGFaY3ZuUUpCNkN2V0Q3dU93UmJicEhfenRVQWR1VENNTlpMR1FNVEdOSjdxN1FuN2dVOU1PNUVyOFRMRWRtVnlCbFpLR1NhMFpoM2VVQ3luZmQ5cEQxcl9ILUI1NDBwajZCUnhkY3VDYU9QNFk0LTh5bG9tNXdHZGtvM3YtRmcySll3ZGpIVEU3bmxvQVgwVkM3cFBrV3RNNFRNM3lOTUIxTDU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin, Sam Altman's Crypto Project, Is Building a Layer-2 Chain - CoinDesk",
        "content": "World Chain will be based on the OP Stack, a blockchain-building framework that has become a popular choice among bootstrappers and was used by Coinbase to build its Base network. Like other layer-2 \"rollups,\" the chain will bundle up transactions from users and pass them down to Ethereum where they get cemented permanently. The setup will allow World Chain to offer users cheaper fees than they'd get by transacting directly on Ethereum."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOMUV2YnZsQVVyc3BvQzY0cHh5T0N5NU9EWThlUFJpLTItWHZyXzhWQklJYnpGdjgxZU1KSS0wQk4xb0tVZHR1RVFMQkx5OF94YXNkOHNMRG9JYXg5MkNham1TdkxZYnF0dDBia3JiX2JKY1B3c19QVEJVcG5sZlE3N2c5cno4NnBYMmdiOTR4Szk3Qlk3aG5qUThNdnJqSUlIamJpbzE2TXA5ZFhsNm5KM2p4RU9leDZfTFVxSG5rY9IBxAFBVV95cUxQS1hhWERfT2JOQVRJLXNSamNiU2psTDVXSGlkaVN5d3p6SGpSamdiOHlfc0hnaUVWZFVRa0hQMmRQcHJabk53YmY2Zmpabl9ZZUFrSDZCb3FMSEM4QkdXMG0yd2RmZi1ubGJXODlNUEZSZnVEOGEzWnRfRlBGNmVrbWVYU2Vid0RuMVRxZ0c4ZEN6NHlIX1RDUXhNLWZKcFRlNE5qRWd2TU5HeEJzbXF6dkRzZlNjR1dfd0M5WFpsOGMwbmhm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Binance and Coinbase Add Support for New Ethereum Altcoin Project Focused on Rollup Tech - The Daily Hodl",
        "content": "Two leading crypto exchanges are adding support for a newly launched Ethereum (ETH)-based altcoin project.\n\nIn an announcement via the social media platform X, top US crypto exchange Coinbase says it’s adding Omni Network (OMNI) to its trading platform.\n\nThe Omni Network aims to integrate Ethereum’s rollup ecosystem into a single, unified network.\n\nSays Coinbase,\n\n“Trading will begin later [April 17th] if liquidity conditions are met. Once sufficient supply of this asset is established trading on our OMNI-USD trading pairs will launch in phases.”\n\nThe altcoin comes with Coinbase’s “experimental label,” a designation the exchange established for riskier, lower liquidity tokens.\n\nMeanwhile, top global crypto exchange Binance previously announced it was adding OMNI to Binance Launchpool, which lets users stake coins to farm new assets, ahead of listing the token for spot trading on April 17th.\n\nBinance is attaching a seed tag to OMNI, which the exchange applies to lower-liquidity projects that may exhibit higher volatility compared to other listed tokens. Binance requires users who own assets with seed tags to pass quizzes every 90 days to ensure they’re aware of the risks before trading the tokens.\n\nSays OMNI project developers,\n\n“Omni is an Ethereum-native interoperability protocol that establishes low latency communications between all Ethereum rollups. Omni offers a secure, performant, and globally compatible architecture that presents Ethereum as a single, unified operating system to both users and developers.”\n\nOMNI is trading for $31.15 at time of writing, after fluctuating between a high of $53.81 and a low of $29.91.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBWZXJLMGpCQmdRS2Z4eDJOZGxrcGdtM1hmbGdzOThQWmZ4WGhRSU0zVlhjZkFnajE1dE5JVldfX0MxWnlqTHFYQWxCM2tlUHFCeHdodTI1dExKME94OEVueTFGT2g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin to debut Ethereum layer 2 \"World Chain\" this summer - Crypto Briefing",
        "content": "World Chain aims to offer verified humans priority access and free gas on Ethereum's L2.\n\nShare this article\n\nWorldcoin, the brainchild of OpenAI CEO Sam Altman, unveiled today its latest development: World Chain, an Ethereum layer 2 (L2) network powered by Optimism’s OP Stack. With this new blockchain, Worldcoin’s vision is to build an open and collaborative network “by humanity” and “for humanity.”\n\nIntroducing World Chain, a new blockchain designed for humans ⚪️ pic.twitter.com/qNb7S3vqut — Worldcoin (@worldcoin) April 17, 2024\n\nAccording to Worldcoin’s blog announcement, the new blockchain is designed to prioritize humans over bots, offering verified individuals priority blockspace and a gas allowance for everyday transactions.\n\nWorld Chain aims to provide developers with access to millions of real users globally, focusing on practical applications in daily life, the team noted. The integration with the Worldcoin protocol is set to spur growth and utilize World ID’s Proof of Personhood to ensure security and scalability within the Ethereum ecosystem.\n\nThe network will be permissionless, and open-source, and is planned to be governed independently by the community. World Chain’s anticipated launch is later this summer.\n\nIn just nine months, Worldcoin has achieved impressive adoption with over 10 million users across 160 countries creating World IDs and wallets, facilitating a staggering 75 million transactions, the team shared. This rapid expansion is driving the Worldcoin team to push the boundaries of blockchain technology, focusing on efficiency, user experience, and utility enhancements.\n\nAccording to the team, World Chain is being built to enhance capacity, allowing for the continued growth of its user base and providing a more efficient transaction experience.\n\nBy reducing congestion, World Chain aims to make transactions faster and less expensive. With World ID, users can prove they’re a real person, anonymously, which can get them priority for their transactions and even some free gas. This makes it easier for new people to join without worrying about high fees.\n\nFor developers, World Chain represents a new frontier to engage with on-chain users at scale, offering a suite of decentralized financial and identity applications that cater to everyday needs, the team highlighted. This ecosystem combines the power of Worldcoin ID for secure identity verification with the functionality of Worldcoin, stablecoins, and various financial services.\n\nWorldcoin said it will continue to contribute to Ethereum’s network and collaborate with the broader Superchain ecosystem to advance shared goals in scaling, security, and interoperability.\n\nOptimism also shared its excitement about the introduction of World Chain. Notably, Coinbase’s L2 network, Base, also leverages the OP Stack, highlighting the growing adoption of this innovative scaling solution.\n\n🔴 The Optimism ecosystem continues to grow: @worldcoin announces World Chain will be built on the Superchain. Another L2 choosing the OP Stack:\n\n🧑‍🤝‍🧑 10M+ users joining the Superchain\n\n📈 Revenue contribution to the @Optimism Collective\n\n✨ Collaborative ecosystem development — Optimism (@Optimism) April 17, 2024"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOLWl5aDM1LUpERnRVcHEzS1N5YkRTcWI1R0o0aDh3VVhlN0pHMmtUNHJWQlVHRVBGVzJNTE1OMEFGRVo3c3F0bFhsbGdyS09LRmMyZXVFVmhfbVhXanB0QTNfdklSdHFLdkthVk5oUkZDSVB4T1JCbU91OFZoZmZ6d2FnWUtCSzRvNnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Can Ethereum (ETH) Hit All-Time High After Bitcoin Halving? - Watcher Guru",
        "content": "The highly anticipated Bitcoin halving event draws near, set to occur on April 20, 2024, according to Watcher.Guru’s active tracking. The cryptocurrency community is abuzz with speculation about the potential impact on various digital assets following the event.\n\nAmong the coins garnering significant attention is Ethereum (ETH), the second-largest cryptocurrency by market capitalization. Many enthusiasts and investors are now pondering whether ETH has the potential to reach its all-time high of $4,891.70 in the aftermath of the halving.\n\nThe Bitcoin halving, which takes place approximately every four years, has historically been a catalyst for substantial growth across the cryptocurrency market. This event reduces the reward for mining new Bitcoin blocks by 50%, thereby reducing the supply of new Bitcoins entering circulation.\n\nA surge in Bitcoin’s price often results from this reduction in supply and steady or increasing demand. This has positively influenced the broader crypto market, including altcoins like Ethereum.\n\nAlso read: Shiba Inu (SHIB) & Dogecoin (DOGE) Price Prediction This Week\n\nChangelly Analysis Predicts Significant ETH Price Increase\n\nAccording to a recent analysis by Changelly, a prominent cryptocurrency data provider, Ethereum could hit $3,171.61 on April 21, 2024, just one day after the Bitcoin halving.\n\nFurthermore, Changelly’s long-term forecast for Ethereum is even more promising. The analysis indicates that by June 2025, ETH could potentially reach $4,964.07, surpassing its previous all-time high and setting a new record for the cryptocurrency.\n\nIn addition, Changelly has also provided their insights on Ethereum’s potential price trajectory for April 2024.\n\nAlso read; Cryptocurrency: Whales Scooped Up These Coins Amidst Market Dip\n\nBased on the price fluctuations observed at the beginning of 2023, these experts expect the average ETH rate to be $3,139.16 in April 2024. They have also provided a range for ETH’s minimum and maximum prices, with $3,088.52 and $3,189.79, respectively.\n\nThese predictions still indicate a significant upside potential for Ethereum in the coming year. As the Bitcoin halving approaches and market sentiment remains bullish, many believe that ETH is well-positioned to benefit from the anticipated market-wide growth."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE90b2FwNy0zQWRMUnJ6UjhYc0czd1M0MThIVVpPRTVUZ0NfdXZEMDAwY1pmOHg2Ukg5bE9YYW1YQzlRNWVkZ0drOUVlVm02elVkY3daTVBuMURmTk5PYl9wQ1EzdUZFWk9uZ1BMLdIBckFVX3lxTFA3dVZ4QnQ3YXNYY2lXUXZtUU1PVTdOM0p3X002UHM0d2luZ29OSmdXUVpGcnRwMnpqZndidTNVdUxLekRxR08wWDkyaU1kakVrbWwyeFFGVWpkSTZYTTBHYno5WllvaElSblN4N3dXWTVyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "OKX debuts Ethereum L2 network X Layer - Forkast News",
        "content": "Cryptocurrency exchange OKX has launched X Layer, an Ethereum layer-2 scaling solution, to its public mainnet.\n\nDeveloped using Polygon’s Chain Development Kit, X Layer uses zero-knowledge proofs to enhance security and interoperability.\n\nThe newly introduced X Layer is fully compatible with the Ethereum Virtual Machine (EVM).\n\nX LAYER aims to unlock and accelerate the global adoption of the Web3 economy, ensuring greater individual freedom and opportunity for millions worldwide. We’re incredibly excited about what’s to come and welcome you to join us as we work to bring the vision of X LAYER to life.\n\n“X LAYER is integrated with OKX Exchange (CEX) and the OKX Web3 Wallet,” OKX Chief Marketing Officer Haider Rafique said in a statement on Tuesday.\n\n“Users can seamlessly bridge assets from the two platforms to LAYER to interact with the DApps deployed on the network.”\n\nRafique expanded on three of X Layer’s long-term purposes: to simplify on-chain decentralized applications, to empower creators, and to make transactions faster and cheaper."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxONDhXajBlSk9PeG9CUkpxNmhUeXg2TVRYRmZ0NFRHb1V5NkdETHFlQ2F0bmpYbUc2WGRTeEhpUVNldGdjYWlNd2pGZVRUSkdtN2g3VG1rdDlSUS1oNFVCNVpqQlhYTGE5TFEtT2F4ZlA0a0pQZmNyeVJ6SVNoTVpJR25kdGJHSjM5RmZXVHQ3b25DYzdT0gGaAUFVX3lxTFBQZ0NhQnNKN1ExV29vZ3prbHVkUFdld3BmVEg3Z1Bwd1M0dkw5RVNVUEJZdHl2dnpHWkgyXzRJbUdreWNJYTlHYVFNWXJESUhudUxTZE10QWVhRElhM0FxUWJLNVdTc2ZkRDQ1MUxKY0lFZjEyVk1hNEJacThJVS1TcGhLQ1R6VDI4dmNfenZkS2dPZzZZcGZyUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Weighs-In On Default Transaction Privacy on Ethereum - CoinGape",
        "content": "Conversations regarding privacy on the Ethereum blockchain have taken a new twist in the crypto community. At its core, the discussion centers on whether Ethereum, as a foundational layer of blockchain technology, should inherently provide transaction privacy. Recently, Vitalik Buterin, co-founder of Ethereum, offered his insights into this contentious issue.\n\nThe question raised is pivotal “Should a base layer like Ethereum offer transaction privacy as a default feature?” This query encapsulates broader concerns about the balance between privacy, transparency, and stability within blockchain networks. By delving into Buterin’s perspective, we can gain valuable insights into the complexities of this debate.\n\nadvertisement\n\nVitalik Buterin’s Opinion\n\nVitalik Buterin’s perspective on default transaction privacy aligns with the analogy of the Transmission Control Protocol (TCP). He draws a parallel between Ethereum’s protocol and the operation of TCP, which functions in a clear text manner, leaving encryption tasks to higher layers. Buterin argues that Ethereum could adopt a similar approach, delegating encryption responsibilities to upper layers while maintaining a stable base layer.\n\nThis viewpoint highlights the importance of adaptability and resilience in the face of evolving encryption protocols. By separating encryption concerns from the base layer, Ethereum can ensure stability while accommodating advancements in privacy technology. Buterin’s stance underscores the pragmatic approach needed to navigate the complex interplay between privacy, security, and technological progress in blockchain networks.\n\nAlso Read: BlackRock Co-founder Predicts Market Comeback, Cites $9 Trillion Cash Pool\n\nImplications and Discussion\n\nButerin’s perspective carries significant implications for Ethereum and the broader blockchain ecosystem. The adoption of default transaction privacy at the base layer could enhance user privacy and security, addressing concerns about data surveillance and identity theft. However, it also raises challenges related to regulatory compliance, as opaque transactions may hinder efforts to combat illicit activities such as money laundering and terrorism financing.\n\nFurthermore, the implementation of default transaction privacy may impact network scalability and efficiency, as cryptographic operations can impose computational overhead. This trade-off between privacy and performance underscores the need for careful consideration and strategic decision-making in blockchain protocol design.\n\nAlso Read: Shiba Inu Community Burns 774M SHIB Despite Market Crash, What’s Next?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQdkVSQS15M0lGbi1nVVduMVJyb1lKZ19FOC1ScEVDQlVxVGNDd0tPWkM3c2lDRVRDTldXVWQ1a2pMOXEyZWsyMVhOS3hhbDQzVVJMRFNQUGhCX3E0bGdoN3NJbmRCZEhLanFNT0RybjFNU0hLdDZNUUd4VjNpMW0tR195SkpLM2hSWEpGcTYtU0R4MENSLTVCZGRlMjFTc3JmYWxHcThJTU9ObWRrTFhpNWhCR0Jka2tWQ28taDhPM080TzlEYUVPWUJnVjVfbHJsNlhQbEY4cW5OeUNUVkhiOVhqU0MxeE52?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal Says 80% Of His Crypto Investment Is In This Ethereum Rival: 'And I Have 1% In Stupid S**t Like Dogwifhat, Dogecoin And Bonk' - Benzinga",
        "content": "In a surprising shift within the cryptocurrency investment landscape, former Goldman Sachs executive and macro guru Raoul Pal has revealed a substantial reallocation of his digital asset portfolio, favoring Solana SOL/USD over other cryptocurrencies, including Ethereum ETH/USD.\n\nWhat Happened: Pal, during a conversation on the Bankless YouTube channel, disclosed that roughly 80% of his crypto investments are now in Solana, The Daily Hodl reported on Wednesday.\n\nThe macroeconomic expert has replaced his Ethereum holdings with high-end art NFTs and has also invested in Exponential Age Asset Management, a digital assets-focused fund. \"I am 80% SOL. All of my ETH is now NFTs (non-fungible tokens), I have been buying high-end art NFTs.\n\n“And I have 1% in stupid s**t like dogwifhat, Dogecoin and Bonk. Got all of those. But that's 1%… just to be clear I've got like in all of memecoins and everything else, 1% of my portfolio. I am 80% Solana.\"\n\nHe justified his heavy investment in Solana by referring to the Solana/Ethereum chart’s performance in 2022, which led him to go “all in” on Solana, paralleling his earlier decision to invest heavily in Ethereum in September 2020.\n\nSee Also: Will Bitcoin Slump To $20K Amid Increasing Middle East Tensions? Peter Schiff Doesn’t Rule Out Possibilit\n\nWhy It Matters: Pal’s strategic shift to Solana comes at a time when the cryptocurrency is making significant updates to address network issues. on Monday, Solana launched a mainnet beta update to manage network congestion, which was partly due to the high demand for Solana block space from soaring meme coin transactions.\n\nMoreover, the cryptocurrency market has seen a growing interest in meme coins, as highlighted by researcher TradeTheFlow. His thesis suggests that meme coins reflect a societal shift towards high-risk, high-reward investment strategies and are not just a passing trend.\n\nAdditionally, the Ethereum ecosystem has faced skepticism from some market participants. A Bitcoin trader and advocate, Fred Krueger, expressed a pessimistic outlook for Ethereum, indicating that it might be losing its market position.\n\nRead Next: Crypto Markets Tumble Following Iran’s Drone Attack Against Israel, Investor Warns Of Continued Selloff\n\nImage via Shutterstock"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQUTJYSGNmYXEwQkhIWE81QXYyaHVlelJBQ2VOY2xWY2FmenRJdUJsQjNOU21VcGViZTdBWUN4aGU5NXZEeTlvbkR1RTlGaWIxclZQN1pmZ2FMX0Z2SHhMOHhLenhhYnVRWXRXaFctRWV6NUNHTFFZaGVxdDU4MG9DWnBrWGF5Tmdma3lSWEtyT0ZRUjRDZ2lNMkg0TzZFTHc1QUdOcVRscVJiM2hWYktvRXJHUDg5d3dBVDltVzFMbHEtOUQ1NjFZZFh5My1Sb2NOVVZwMnQ3S2hlS1NsSXRYWEd2eHRFakxG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Jim Cramer Says Just Go Buy Ethereum Or Bitcoin Instead Of Marathon Digital: 'Let's Not Fool Around' - Benzinga",
        "content": "In a recent episode of “Mad Money,” host Jim Cramer advised against investing in Marathon Digital Holdings Inc. MARA and instead recommended Bitcoin BTC/USD or Ethereum ETH/USD.\n\nWhat Happened: Cramer, in his “Lightning Round” segment, discouraged viewers from purchasing Marathon Digital, a company involved in Bitcoin mining, reported CNBC. He suggested that investors consider Bitcoin or Ethereum as alternatives.\n\n\"If you want to own Marathon Digital, just go buy either Ethereum or buy Bitcoin, ok. Let's not fool around,\" Cramer said.\n\nMarathon Digital’s stock has experienced a tumultuous period, with its value dropping by over 20% in the past month. This decline is attributed to the overall volatility in the cryptocurrency market.\n\nSee Also: NFLX, AMC,UAL, WISA, TSLA: Top Trending Stocks Today\n\nWhy It Matters: Cramer’s advice aligns with the current state of the crypto market. On Tuesday, cryptocurrency analyst Ali Martinez highlighted the importance of Bitcoin’s $62,000 support level. Failure to maintain this level could shift focus to the next significant demand area, approximately $51,500. Conversely, a climb back above $66,250 could significantly boost the chances of a resurgence in the market.\n\nDespite concerns about the crypto market, Wall Street experts remain confident in the bull market‘s continuation. They cite a robust U.S. economy and the potential of artificial intelligence (AI) as key drivers.\n\nOn the broader market front, Cramer has also outlined potential factors that could lead to further market decline, advising investors to be cautious about their buying and selling decisions. His recent advice regarding Marathon Digital is in line with his cautious approach to the current market conditions.\n\nPrice Action: While Marathon Digital Holdings closed at $14.63 on Wednesday, marking a modest 0.21% increase, the stock has experienced a significant decline of 36.20% year to date. In contrast, Bitcoin is currently trading at $61,562, showing a 0.48% increase in the last 24 hours and a notable 39.37% gain year to date. Ethereum, on the other hand, is trading at $3,000, with a 0.61% increase in the past 24 hours and a solid 27.54% gain year to date, according to data from Benzinga Pro.\n\nRead Next: Macro Guru Raoul Pal Says 80% Of His Crypto Investment Is In This Ethereum Rival: ‘And I Have 1% In Stupid S**t Like Dogwifhat, Dogecoin And Bonk’\n\nImage Via Shutterstock"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9ITkM3V2lQRGJieV9nYWExRHdZRkVLUDNwQjJXYkl6YWxNelhXb0E2Vlg0NzAzZGhBbHg0d1pZdHE4Z2RaQ0JNc1pWUUxTWWJ3dlJWNlB2QXp4ODVOX2h0VDRFUVl5blBDTE01ZmVQNm9HQTBHM05J0gF_QVVfeXFMUFZZcHYtWVNmeGVvZ05HNWQ1b0RjZmhNdW9JRWVlQk42dnBmTm1XeGs3bWZFLVNXU3ZJQzM4QXZfMV8wQ01NLWpqMnBHM1VGRE1FU3JlcVJHV2k5TTNVWmFVMlNkN2hSQVprQ1ZCei1MSGstNGxWX3AzOUQ5YVpqNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Guy Explaining' Nightclub Meme to Be Sold as Ethereum NFT - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA popular meme photo of a guy at a club yelling into a girl's ear—about something that she doesn't appear to be into—is going up for auction as an Ethereum NFT on Foundation.\n\n“Milk Edinburgh” received its name from the nightclub where it was taken—Milk, in Edinburgh Scotland. The picture was originally shared around the internet with a watermark of the club's moniker on it, which is why the name stuck, and it’s since been widely used as an example of a “guy explaining” or “mansplaining.”\n\nThe photograph was originally taken in 2018 by David Wilkinson—who along with the help of pseudonymous Feisty DAO member Cryptopathic—is now offering the original artwork for sale as an NFT.\n\nA member of Feisty DAO was able to get ahold of Wilkinson, and found out that he had actually minted the image as an NFT back in 2021 but it had never sold; Cryptopathic and FeistyDAO offered to step in and host the auction for him free of cost.\n\nAD\n\nAD\n\nThe next meme to be auctioned is \"Nightclub Meme\" by David Wilkinson. The reserve will start at 15 ETH, for a 3 day auction beginning at 10am BST on Monday the 22nd of April. pic.twitter.com/40gkrIUbFg — path.eth 🛡️ (@Cryptopathic) April 17, 2024\n\nThis isn’t the first time that they’ve connected with the creator of a meme to sell it as an NFT. He helped the owners of the dog depicted in the Dogwifhat (WIF) meme coin auction off their pet’s photo for $4.1 million in a similar auction. Previously, they helped the owners of Kabuso—the dog used for the logo of crypto’s first dog-themed meme coin, Dogecoin (DOGE), sell NFTs.\n\nPath told Decrypt that their motivation behind all of this is to onboard more creators into crypto, and show them that NFTs are a beneficial way to monetize their work.\n\n“Many of these creators are approached by predatory teams that are looking to take huge cuts, or hugely underpay the artist—making it seem that this space is just as bad or worse than the rest of the art industry,” he said. “With our model, we are happy to benefit purely from PR, and really show people how easy it is to take control of their work in this way.”\n\nAD\n\nAD\n\nThe meme will go up for auction on Monday, April 22 on Foundation at 5am ET. The NFT will have a reserve price of 15 ETH, or about $45,000 at present.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9Sc09XUkpNZ1F3aG1pOXhudmlzNU1VVGlMeEswX2gySkdHOTNyYVRzN1RJenR0VFRLQWg2a1lSX3IyWUhybE9uU0F2eW4xZ0JMSHJmcTRIUHNLSmczcVgzaGdqU2xWSHI0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "What is Ethereum's Pectra upgrade? Bringing smart contract functionality to wallets - OKX",
        "content": "What if managing your Ethereum wallet could be as easy and secure as sending an email? The Ethereum network has introduced a big change that aims to deliver this kind of simplicity to users, called the Pectra hard fork. The update is expected to make transactions safer, bring added stability to the network, and introduce a host of new features.\n\nEIP-3074 is a key part of the Pectra upgrade. It'll change how transactions are handled, making the network more accessible and bring smart contract functionality to wallets. How will these modifications affect the blockchain community? Read on as we explore the Pectra hard fork and what it means for users of the Ethereum network.\n\nTL;DR\n\nPioneering change: The Ethereum Pectra hard fork aims to change how people use their wallets and make the network more efficient.\n\nEIP-3074 introduction: The proposal allows regular digital wallets to use smart contracts, enabling you to make more complicated transactions that are also safer.\n\nStreamlined transactions: Grouped transactions and paying fees to third parties aim to make usability easier.\n\nSocial recovery feature: The update introduces a new way to regain lost funds, using trusted contacts instead of traditional seed phrases.\n\nCommunity impact: Greater simplicity and safety from Ethereum and its wallets can help increase people's trust in and use of decentralized applications.\n\nWhat is the Ethereum Pectra hard fork?\n\nThe upcoming Ethereum Pectra hard fork is a major milestone in Ethereum's history. It aims to improve wallet capabilities and the overall efficiency of the network. The update, which introduces numerous Ethereum Improvement Proposals (EIPs) — and notably EIP-3074 — is scheduled for launch in late 2024 or early 2025.\n\nThis proposal is designed to change the way Ethereum handles transactions by allowing digital wallets to use smart contracts. EIP-3074 includes capabilities such as grouped transactions, which let users sign a transaction once regardless of how many tasks it contains. The proposal also allows for endorsed transactions, which enable someone other than the asset owner to pay for transaction fees.\n\nThese improvements are intended to simplify a user's interactions with the Ethereum network, greatly enhancing the overall experience by removing transaction complexities and expenses. Meanwhile, EIP-3074 comes with a new \"social recovery\" feature. The feature lets you regain access to your assets without needing the usual seed phrases.\n\nImpressive, but it doesn't end there. These latest upgrades are part of a wider plan to future-proof the Ethereum network and strengthen its status as one of the leading platforms for decentralized applications (DApps) and smart contracts.\n\nWhat are the security implications of EIP-3074?\n\nWhile EIP-3074 helps to make Ethereum more secure and easier to use, it's important to be aware of some security implications brought by the proposal's introduction. For example, the AUTH and AUTHCALL opcodes allow for more flexible transaction management but do introduce potential new vulnerabilities.\n\nSecurity benefits\n\nFormal audits and verification : EIP-3074 went through security audits to ensure safety. Audits are essential for finding and fixing vulnerabilities before they're exploited.\n\nEnhanced user control and recovery: With EIP-3074, you can use digital signatures to give control of your Ethereum accounts to a smart contract. This makes it easier to get your assets back or manage them without risking the safety of your private keys.\n\nSecurity risks\n\nPotential for misuse of invoker contracts : One of the main risks associated with EIP-3074 is the potential misuse of invoker contracts. If these contracts aren't implemented securely, they could be exploited to perform unauthorized transactions or access funds without the user's consent.\n\nNeed for trusted invokers : Building on the point above, transactions made with EIP-3074 need invoker contracts that can be trusted. Developers should use measures like whitelists to allow only confirmed safe entities to be involved in transactions.\n\nComplexity in transaction authorization: Using more complex ways to approve transactions can make new and old contracts easy to attack. Greater complexity occurs because the AUTH opcode changes who's seen as the \"sender\" in transactions. Vulnerabilities can arise if this process isn't managed carefully, putting users at risk of attack.\n\nMitigation strategies\n\nComprehensive auditing: Regular checks of the EIP-3074 implementation and the invoker contracts are important to protect users. These checks can help identify and fix vulnerabilities before they're exploited.\n\nStrict validation of commits: To avoid issues like unauthorized access or replay attacks, commits must include ways to make sure each transaction is authorized correctly and can't be misused. One way to do this is by using unique identifiers or nonces.\n\nHow does the social recovery feature work with EIP-3074?\n\nThe social recovery feature brought by EIP-3074 is one of the most noteworthy updates coming to the network. Let's explore how it works in more depth.\n\nDigital signature for asset control : First, you give control of your assets to a special contract by using a secure digital signature. This step is important because it lets the contract manage the assets, but you can still get them back if needed.\n\nInvoker contract : When the assets move to the new contract, that contract will handle all future actions for you. This setup lowers the chance of losing access to your assets if you forget your private keys.\n\nOperational codes - AUTH and AUTHCALL :\n\nAUTH : This code checks that your digital signature and transaction details match your original instructions.\n\nAUTHCALL : After checking, this command lets the contract send crypto. It also allows others to know you've sent assets, so people can see the link between you and the contract's actions.\n\nSecurity and asset recovery : The digital signature contains a unique code that guarantees you can retrieve your assets if you lose or forget your seed phrase, making it an invaluable feature.\n\nEnhanced security measures: Despite the new features, there are risks of dangerous invoker contracts. To protect against losing assets without permission, the update includes ways to use invoker contracts that have been officially checked and reviewed.\n\nHow will EIP-3074 affect transaction processes on Ethereum?\n\nEIP-3074 will alter the processes involved in Ethereum transactions by adding new features that bring welcome simplicity.\n\nBatch transactions : EIP-3074 lets you combine multiple transactions into a single one. This should make transactions more efficient and may lower fees by distributing costs across multiple actions within the same transaction.\n\nSponsored transactions : Sponsored transactions are a new feature with EIP-3074. Here, a third party can pay the transaction fees instead of the asset holder. This could incentivize the use of DApps as asset holders no longer need to pay gas fees.\n\nSmart contract-like capabilities in EOAs: Now, regular user accounts can do some of the same things as smart contracts. They can give permission to smart contracts to perform actions autonomously.\n\nAlongside reducing the complexity of transactions made through the Ethereum network, the Pectra hard fork also introduces new ways for developers to make disruptive and easy-to-use apps.\n\nWhat other EIPs are included in the Pectra upgrade?\n\nVarious other proposals are set to be introduced as part of the Pectra hard fork, each bringing additional functionality to the network.\n\nEIP-7610 : This proposal is designed to make the system more secure by only letting addresses with storage space create smart contracts. In theory, this change will make it easier to upgrade the system in the future, especially via Verkle trees.\n\nEIP-7523 : EIP-7523 focuses on making the Ethereum network more efficient. With the proposal, empty accounts will be removed from the Ethereum state. This helps reduce the state's size, making the network faster and easier to use.\n\nEIP-7251 (Maxeb) : This addition aims to make the network more scalable by simplifying the management of validators. This is achieved by increasing the maximum effective balance for validators from 32 ETH to 2,048 ETH. Doing so reduces the need to manage multiple validators, which reduces complexity.\n\nEIP-2537 : The EIP-2537 update brings new pre-built functions to the BLS12-381 curve. These functions help make cryptography processes more efficient. Better cryptography means better security and verification on the network.\n\nEIP-3074, 5806, and 7377 : Account abstraction EIPs make it easier to process transactions. EIP-3074 adds new commands (AUTH and AUTHCALL) that allow for transaction contracts to be verified and executed autonomously once certain permissions are set. This helps with complicated tasks like combining multiple transactions into one or having someone else pay for a transaction.\n\nEIP-5920 (PAY opcode): EIP-5920 provides an easier way to share ETH by sending tokens directly without activating the receiver's contract code.\n\nEach EIP contributes to the broader goal of making Ethereum more scalable, secure, and user-friendly, laying the groundwork for future advancements in the blockchain space.\n\nWhat comes after the Pectra hard fork?\n\nFurther updates are planned following Pectra's release in late 2024 or early 2025, most notably the addition of Verkle trees.\n\nAfter Pectra, Ethereum is planning more updates. One important step is adding Verkle trees, which upgrade Ethereum nodes to validate blocks without needing to store large amounts of state data. This upgrade is a significant step towards 'statelessness' for the network. A stateless client doesn't need to store a full state database to validate incoming blocks.\n\nVerkle tress and progress towards statelessness complements Ethereum's wider ambitions to improve scalability through advanced technologies like sharding, which aims to increase the number of transactions the network can process at once. This scalability solution has been a major focus following the network's move to Proof of Stake with the 'Merge' event.\n\nThe final word\n\nThe upcoming Ethereum Pectra hard fork promises to permanently alter how users make transactions on the network and manage their wallets. Efficiency, safety, and uprated features are all key benefits set to be brought about by the development and the arrival of the EIP-3074 proposal.\n\nAlthough this next phase of evolution for the network isn't without its challenges — notably, concerns over potential security vulnerabilities — it marks fresh change for Ethereum and added competitiveness for the network."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOVk1FcGROdEFxeGhJQl9kQk02dzBIZk9aZXVFaDV0a2VBempvOU1hLVhsS3Vrc1c0YXNnMW4tQnBOXzRFZkM0U1BmaW85d3psbm9tSUFReTRKblMzWmhJdmxoMXFpeWJPTDNQb3BTVFpPeXZJMXhaWGEtNXBCTXByTUtRR0Zjai0tZHZuemd30gGTAUFVX3lxTE5BSHBjRkNjZGlhWHhrc1h4QU5xNkFIbkwxWFVnVkFzLUdvNXdPOEpndW53Z2ktSDB1Z2xnUDRqdHI3VnRKdjQ5S0s1Ni1YOExycjRiZnJROHoyTWJtRFpzX0E2NE9qN2xZQmFfWm5oTWNTOFhnR0l3SWctVFNjN2FSNFhwNmRHY214U2NhdktwZ1R5WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum and Bitcoin Investors Are Destroyed, But It Could Be Positive - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAfter a tough weekend that saw Bitcoin dip to around $61,500 and Ethereum to $2,890, the chatter has been mostly dark. Yet, this surge of FUD among traders may not be as bad as it sounds.\n\nAdvertisement\n\nAs markets start to bounce back, going against the crowd's doomsday predictions, there is a lesson to be learned. When everyone is selling in a panic, it often sets the stage for a turnaround. This is where we are now – at a potential tipping point where the pessimism has gone so far that it might just flip the other way.\n\nAccording to sentiment analysis, negative tendencies on the market could indicate a coming rebound, as the markets have a history of moving contrary to the crowd's fears. The expectation is that this trend could hold up until the hype and excitement (FOMO) surrounding the halving event take center stage again, just as they did a few weeks ago.\n\nAdvertisement\n\nOn the price chart, Bitcoin and Ethereum have crucial levels to watch. For Bitcoin, the resistance to beat is around $67,000. If it manages to rise above this, it might signal a larger recovery. Ethereum faces resistance near $3,500 and has support at $2,700. If it holds above support and breaks past resistance, it could be a sign of a more sustained upswing.\n\nWhile the current sentiment is in the dumps, history has shown that such sentiment extremes can precede market recoveries. The collective mood swings of investors, from fear to greed and back again, are part of the crypto industry.\n\nJust as panic can spread quickly, so too can a recovery start – often when it is least expected. Keep an eye on those critical price levels."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNOWpoVmxEeXdBcHhZRGlBeHVSZmhxTVY1ZkI4ZzQtdFR2OHlYNFRkZ0JfQVEtU25LQjJFcUpBOEJGQmxRUjZTTGhxNFpDckhsTFAxbVU0OWwwanAzNlJqZlhuWXo1SXh0Y2M3eWk4RVBLQW9jYjAwSXRXYVJNM3RxR1FwcnBxNTc4bmfSAY8BQVVfeXFMTVRZUWZnM1RpbVlFRU14SnVmczhFTDJKemdkOXNMcHB2VUMxc19MZGlhUFFyTGRrQ3BSSlRHbUFBOGJ3b3dZdnBabGdmdEZTcmlQSGtwNVdIV2ZXTy14cFE4V3Nxa2RmS1BmR1ZVRjZveWZBcEhfTnBkOVpibmJYbUlHeG9JVGkzWU9YS0NBc28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: ETH Key Support Level To Watch Amid Mass Selloff - CoinGape",
        "content": "Amid a widespread selloff in the cryptocurrency market, the Ethereum price trajectory has attracted significant attention from traders and analysts alike. Meanwhile, the recent decline in the Bitcoin price has further contributed to the decline in the broader crypto market.\n\nNotably, as discussions intensify regarding the potential for further declines, key support levels for Ethereum emerge as crucial indicators for market sentiment and future price movements.\n\nadvertisement\n\nAnalysts Unveils Crucial Support Zone For Ethereum\n\nAs Ethereum faces downward pressure amid the ongoing market turmoil, attention turns to critical support levels that could influence its trajectory. Notably, renowned crypto analyst Ali Martinez highlights a key support zone for Ethereum, ranging from $2,000 to $2,430.\n\nMartinez said that within this range, approximately 9.37 million addresses collectively hold nearly 53 million ETH, underscoring its significance as a potential turning point for Ethereum’s price direction.\n\nMeanwhile, Ali Martinez’s analysis sheds light on the intricate dynamics shaping Ethereum’s current price momentum. Highlighting the importance of the critical support zone, Martinez’s insights serve as a focal point for cryptocurrency market participants evaluating Ethereum’s resilience amid market volatility.\n\nWith speculation rife over the possibility of further selloffs, Martinez’s observations prompt a reevaluation of Ethereum’s market fundamentals and potential recovery paths.\n\nAlso Read: Bitcoin Selloff To Continue During Bitcoin Halving Event\n\nWhat’s Next?\n\nDespite the prevailing market downturn, optimism persists within the crypto community, fueled in part by recent regulatory approvals. Notably, Hong Kong’s green light for Bitcoin and Ethereum ETFs has injected a sense of confidence, echoing the positive sentiment following the U.S. Spot Bitcoin approval. Besides, the anticipation surrounding the upcoming Bitcoin Halving event adds another layer of intrigue, as historical data suggests a potential uptick in market momentum post-Halving.\n\nHowever, it’s worth noting that while historical trends offer insights into potential market movements, they do not guarantee future outcomes. Concerns over short-term volatility, particularly in the lead-up to the Bitcoin Halving, raise questions about Ethereum’s immediate price trajectory. As investors weigh the implications of market dynamics and regulatory developments, Ali Martinez’s analysis serves as a guidepost for navigating the uncertain terrain of the crypto market.\n\nAs Ethereum grapples with the fallout from the broader market selloff, attention shifts to critical support levels and expert analyses for guidance. While challenges persist, the crypto community remains cautiously optimistic, drawing on past precedents and regulatory developments to chart a course forward.\n\nMeanwhile, the Ethereum price was down 7.48% and traded at $3,013.42 during writing, while its one-day trading volume stayed near the flatline at $22.42 billion. Amid the recent price dip, the ETH price has lost nearly 16% over the last seven days. Notably, the Ethereum Futures Open Interest lost 6.01% to $10.91 billion over the last 24 hours, CoinGlass data showed.\n\nAlso Read: Vitalik Buterin Weighs-In On Default Transaction Privacy on Ethereum\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQc1l5UkRQZGp0a0ViTmx0cW9TWmp2LTJXTjZwNGNPZmJnSHF3S3QtZ2E0Q3JVWEVXWUw3RVFOVGI2XzJqTVNkd1cwYzJydWRacTlPT0d6d3lhdEM2YU5xc2tuLUplNllTSkNROXZyTExuX2EwNVhPS09USy1sVGpHTzNtMDNOUDJDWnBhTVlON1Q2V25sWGY4UzEzeV83NTlhRXllWWw1Rk5XdGV2YVHSAbMBQVVfeXFMTWRIOUFxUkNxdFhPbFJXRFFYYmNPU2tzZEJLYXRudnRhQmNadFFUamt0SXdWU2VuT3hTQXZibGdqa0RseUJaYzVYT3lCWUtGVDdFMGFQcjJnQ1doLU54dk1RVUVkRGJHT3ZxUXk0V2gtSUh1QjFWQ1oxeW11dE1BT1NXTVRhUS1yZk5Oa2NTMkxKYlNweFY4UDU2YTJlVF9pcUtRalRDdTZPSG5HNndybFktUVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Issues a Warning for the Upcoming Hong Kong Bitcoin, Ethereum ETFs - CryptoPotato",
        "content": "Hong Kong regulators recently approved spot Bitcoin and Ethereum exchange-traded fund applications, but Bloomberg ETF analyst Eric Balchunas predicts that the local ETF market may not perform as well as the US due to the current lack of big players and the possibility of high fees.\n\nAccording to Balchunas, the Hong Kong Bitcoin and Ether ETF market may generate $500 million in inflows, which is small compared to the over $15 billion from BlackRock’s spot Bitcoin ETF product alone in the United States.\n\nHong Kong Spot BTC ETF Smaller than the US\n\nThe Hong Kong Securities and Futures Commission (SFC) on April 15 granted in-principle approval for spot Bitcoin and Ethereum ETF products from China Asset Management, Harvest Global Investments, and Bosera Asset Management in partnership with HashKey Capital.\n\nWhile the spot crypto approvals are a major milestone for Hong Kong, which is determined to position itself as a central digital assets hub, there are speculations that the city-state may not witness large inflows like in the United States.\n\nBloomberg ETF analyst Eric Balchunas, in a tweet, predicted that the Hong Kong ETF market could see an inflow of $500 million, debating another prediction that estimated $25 billion.\n\nAccording to Balchunas, key factors such as the absence of major players in the Hong Kong ETF market and the possibility of these issuers charging high fees could hinder demand for the products.\n\nThe ETF analysts added that the potential local issuers are small compared to the behemoths in the United States. The US boasts financial giants such as the world’s largest asset manager, BlackRock, and Fidelity, which has nearly $5 trillion in assets under management (AUM).\n\nIn terms of fees, one to two percent, as speculated by Balchunas, may prove uncompetitive for Hong Kong Bitcoin ETF issuers, with US ETF providers offering 0.25% and lower.\n\nAs previously reported by CryptoPotato, Grayscale, which currently charges 1.5% for a management fee on its spot Bitcoin ETF, said there would be a reduction over time, following the maturity of the ETF market.\n\nThe company’s management fee is significantly higher than its rivals and has seen continuous outflows compared to competitors such as BlackRock, which continues to record gains.\n\nWhen Spot Ethereum ETF in the United States?\n\nMeanwhile, the Hong Kong spot Bitcoin ETF market could see an uptick if bigger players are involved and mainland Chinese investors are allowed access to the product, according to Balchunas.\n\nAlthough the US spot Bitcoin ETF market is larger than Hong Kong’s, the latter may have an edge over the United States, being one of the first jurisdictions with an approved spot Ethereum ETF.\n\nSince greenlighting almost a dozen applications in January 2024, the US Securities and Exchange Commission seems to be reluctant to give its approval for a similar product tracking the price of Ether, the second-largest cryptocurrency by market capitalization.\n\nBlackRock, Grayscale, Frank Templeton, Fidelity, and Invesco are among the applicants for a spot Ether ETF. The American regulator recently delayed its decision on Ethereum filings from BlackRock and Fidelity after previous delays on other applications.\n\nHowever, some analysts believe the SEC’s approval of a spot Ethereum ETF in the United States may not happen in 2024."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxON00wYVRzRkdzU1BPZUdaajloX1RIc3ZSQVBJWDFBMmhHUF9Wc0UzRnJIa3F3a3hDdUJOQjNhQ1VVcGx2SWx6S053OE1YRUhRdUR5ZTBiXzNDSng3Smd2bTBqbWgtYVFDeTNuSzNab01aZjZ3SEtPWmk5OFlzSkVDQXZBSV9FZ9IBiwFBVV95cUxOc2RiRUt0UGpmRU1KaDdHUXV1eXhUVmh1SWQ4M3U0ZXJhNXBSQUszTFJRYWVPV2piZlpXZHVSUjZyWUZhMFVGZFhJSGp5czhxVjhZbHJ0WWktOE5jbWluSjZBbUdJQU1BS0E0d2JQLWxKaEtjcnFMLVY3QmhGa2M3aW5kOUlyY2JPbl9j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum turning bullish? This indicator is the key - AMBCrypto News",
        "content": "Ethereum’s Taker Buy Sell Ratio attempts to breach the center line in an uptrend.\n\nHowever, bearish sentiments continue to grow.\n\nEthereum’s [ETH] Taker Buy Sell Ratio is poised to cross above its center line, signaling a rise in bullish sentiment amid recent market troubles, data from CryptoQuant has shown.\n\nThe Taker Buy Sell Ratio is a metric that measures the ratio between the buy volume and sell volume in an asset’s futures market.\n\nA value greater than 1 indicates more buy volume than sell volume, while a value less than 1 indicates more sell volume than buy volume.\n\nAt press time, ETH’s Taker Buy Sell Ratio was 0.96, per CryptoQuant’s data.\n\nThe bears remain in control\n\nDespite the spike in ETH’s Taker Buy Sell Ratio, an assessment of the coin’s spot and futures markets revealed that bearish sentiments remain significant.\n\nFor example, ETH’s Futures Open Interest has fallen to its lowest since the 28th of February, according to Coinglass data. It peaked at $15 billion on the 9th of April and has since declined.\n\nAt $11 billion as of this writing, ETH’s Open Interest has plummeted 27% in the last seven days.\n\nAn asset’s Open Interest measures the value of its Futures contracts that are yet to be closed.\n\nWhen it declines this way, it suggests that market participants are closing their positions and exiting the market without opening new ones.\n\nDuring the last week, ETH’s funding rates briefly turned negative on 14th April, when a significant number of market participants opened trades against the coin’s price.\n\nThis marked the first time ETH would record a negative Funding Rate since the bull market rally began in October 2023.\n\nIn its spot market, key technical indicators observed on a daily chart hinted at the possibility of a decline below $3000 if bearish sentiments linger.\n\nETH’s Awesome Oscillator, which measures market momentum, posted downward-facing red histogram bars at press time. This trend has been present since 13th April.\n\nDownward-facing Red bars on an asset’s Awesome Oscillator are often interpreted as a bearish sign, suggesting a hike in selling pressure.\n\nLikewise, readings from ETH’s Parabolic Stop and Reverse (SAR) showed the dots that make up the indicator resting above the coin’s price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe Parabolic SAR indicator is used to identify potential trend direction and reversals.\n\nThe market trend is considered bearish when its dotted lines are placed above an asset’s price."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQekJRMUJtOGRsSUJEbWE4YlJDalJRMUdCTm1raXNZRDM4cjh4bXZrYXdDTXFpV3oyNlhpdHNUQUs1dkxuWjJ2Sl84bWFUTHFXRmluQ1hLTVl3cElMZEh6dFYzc0taNlhWVVpPNXNBal9JYWZlVE5ldndBanFTYURvUlpTWHg1eEtibWVUS0x6cW1xWFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "SOLOWIN HOLDINGS Selected as a Key Participating Dealer for Harvest Global’s First Spot Bitcoin and Ethereum ETF in Hong Kong - Yahoo Finance",
        "content": "Solowin Holdings\n\nHONG KONG, April 16, 2024 (GLOBE NEWSWIRE) -- SOLOWIN HOLDINGS (Nasdaq: SWIN) (“SOLOWIN” or the “Company”), a securities brokerage company that offers comprehensive financial services primarily to Chinese investors, today announced that Solomon JFZ (Asia) Holdings Limited, its operating subsidiary, has been selected as one of the three participating dealers for Harvest Global’s spot Bitcoin and Ethereum ETF in Hong Kong. Harvest Global was one of the just three ETF providers to receive conditional approval from the Hong Kong Securities and Futures Commission (SFC) this week to launch spot Bitcoin and Ethereum ETFs.\n\n\n\nMr. Thomas Tam, Chief Executive Officer of SOLOWIN, commented, \"We are excited to play a crucial role in the launch of Harvest Global’s first spot Bitcoin and Ethereum ETF in Hong Kong. This milestone will not only provide investors with new asset allocation opportunities but also reinforces Hong Kong's reputation as a top international financial centre and a hub for virtual assets. As a key participating dealer, we will leverage our expertise in financial products and our deep understanding of the local market to offer the ETF to a broad spectrum of investors and clients. Our partner, OSL Digital Securities, will act as the trading platform and sub-custodian for the ETF. We are committed to providing the highest quality of services to clients and upholding the highest standards of regulatory compliance and security. Being part of this groundbreaking initiative will position us to attract a wider range of investors and strengthen our position in the virtual asset market.”\n\nThe conditional approval, coming just three months after the U.S. introduced similar ETFs which attracted around US$12 billion in investments, marks a significant regulatory advancement for Hong Kong’s aspirations to be a global virtual asset hub. The virtual asset spot ETFs in Hong Kong will also introduce an in-kind subscription mechanism that allows investors to buy into the ETF using Bitcoin or Ethereum directly. This is expected to act as a transformative vehicle for channelling significant investment into the virtual asset space.\n\nAbout Solowin Holdings\n\nBased in Hong Kong, SOLOWIN HOLDINGS is a versatile securities brokerage company strategically focused on high-net-worth investors worldwide. It offers a wide spectrum of products and services, spanning from traditional assets to virtual assets through its advanced and secure one-stop electronic platform, Solomon Win.\n\nExperiencing robust growth since 2021, SOLOWIN HOLDINGS distinguishes itself through its subsidiary, Solomon JFZ (Asia) Holdings Limited (“Solomon JFZ”), licensed by the Hong Kong Securities and Future Commission. Solomon JFZ empowers the company to deliver unparalleled one-stop financial solutions to both individual investors and corporate clients. The diversified offerings include Securities Brokerage, Investment Banking, Asset Management, Virtual Assets, and cutting-edge FinTech Services. For more information, visit the company’s website at http://ir.solomonwin.com.hk .\n\nStory continues\n\nForward-Looking Statements\n\nCertain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations and projections about future events that the Company believes may affect its financial condition, results of operations, business strategy and financial needs. Investors can identify these forward-looking statements by words or phrases such as “may,” “will,” “expect,” “anticipate,” “aim,” “estimate,” “intend,” “plan,” “believe,” “is/are likely to,” “potential,” “continue” or other similar expressions. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations that arise after the date hereof, except as may be required by law. These statements are subject to uncertainties and risks including, but not limited to, the uncertainties related to market conditions and other factors discussed in the “Risk Factors” section of the registration statement filed with the SEC. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to review other factors that may affect its future results in the Company's registration statement and other filings with the SEC. Additional factors are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov .\n\nFor investor and media inquiries please contact:\n\nSOLOWIN HOLDINGS\n\nInvestor Relations Department\n\nEmail: ir@solomonwin.com.hk\n\nAscent Investor Relations LLC\n\nTina Xiao\n\nPhone: +1-646-932-7242\n\nEmail: investors@ascent-ir.com\n\n\n\n"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQd3JyS0g1ZE9KNGpleWgtZEN3MkhFVDJHQzBvOHVaNnpWdGxzV3RBV1BINHRUV1QzbmxrX18zRHdiNG1VTmdWNjVzMjhycDV0UFZaai1sQlNmblh4Ykg5Q3dVSGlvUGJ4MnlRUVg0dWh3Qjg3ZkhlVHZwRWlHNHR1QTF1dWdwY2hvb0NidnJEMU9tVGV2VWdIbXhoaFg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin pushes Tornado Cash alternative: ‘Privacy is normal’ - DLNews",
        "content": "GM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nThe restaking rush continues with EigenLayer and Karak launches.\n\nUpgradable code costs Blast DeFi users $26 million.\n\n“Privacy is normal,” says Vitalik Buterin after using Tornado Cash alternative Railgun.\n\nKarak challenges EigenLayer in restaking race\n\nEigenLayer just hit a new milestone on its restaking road map, letting those who have deposited tokens to the protocol delegate them to node operators.\n\nNode operators are individuals or organizations that let users delegate their restaked Ether to them. They then opt in to provide actively validated services, which earn delegates a boosted yield on their restaked Ether.\n\nDelegated tokens will secure EigenDA, the first of many protocols expected to benefit from restaking on Ethereum. However, restakers will have to wait a few more weeks to start earning boosted yields.\n\nAnd EigenLayer isn’t the only one. Karak, EigenLayer’s main competitor, has launched private access, letting those with an invite start to restake on the protocol.\n\nSo far, Karak has drawn in $195 million in deposits — still far below EigenLayer’s $12.6 billion.\n\nLike EigenLayer, Karak has launched its own points system, called Karak XP.\n\nJoin the community to get our latest stories and updates\n\nPoints systems usually indicate a DeFi protocol is planning to launch and airdrop a token.\n\nWith two restaking protocols offering potential airdrops, whichever one announces a token first should receive a big boost from the attention.\n\nPac Finance users lose $26 million in seconds\n\nA sudden, unexpected code change at Blast lending protocol Pac Finance cost users $26 million, highlighting the risks of upgradable smart contract code.\n\n“This was a result of the liquidation threshold being altered unexpectedly without prior notification to our team,” Pac Finance said on X.\n\nPac Finance is a fork of Aave, the biggest lending protocol in DeFi.\n\nA fork is where a developer team uses the open-source code from an existing DeFi protocol to launch a similar protocol — often on a different blockchain or with minor changes.\n\n“Fundamental problem with forking code is the lack of in-depth knowledge of the software and the parameters,” Stani Kulechov, founder and CEO of Avara, the company behind the Aave protocol, said in an X post.\n\nThe incident highlights the risk of upgradable code in DeFi protocols. If a protocol chooses to keep its code upgradable, those with permission can change the rules that govern the protocol at any time — often without warning.\n\nNot all DeFi protocols allow for code upgrades. Uniswap, Curve Finance, and many other protocols make their code immutable, meaning once it’s deployed on a blockchain, it cannot be retroactively changed.\n\nVitalik on privacy protocol Railgun\n\n“Privacy is normal,” Ethereum co-founder Vitalik Buterin said in an X post on Monday, responding to the fact that he had just transferred 100 ETH — worth about $310,000 — through privacy protocol Railgun.\n\nPrivacy is normal.\n\n\n\nRailgun uses the privacy pools protocol ( https://t.co/DekkatsMR5 ) which makes it much harder for bad actors to join the pool without compromising users' privacy.https://t.co/MG0huDzpAu — vitalik.eth (@VitalikButerin) April 15, 2024\n\nPrivacy is normal.\n\n\n\nRailgun uses the privacy pools protocol ( https://t.co/DekkatsMR5 ) which makes it much harder for bad actors to join the pool without compromising users' privacy.https://t.co/MG0huDzpAu — vitalik.eth (@VitalikButerin) April 15, 2024\n\nRailgun is similar to sanctioned protocol Tornado Cash in that both allow users to break the chain of traceability between blockchain transactions.\n\nHowever, Railgun uses the Privacy Pool protocol, an idea put forward in an academic paper co-authored by Buterin in September.\n\nPrivacy Pools tries to solve the issues with Tornado Cash — namely that it has facilitated an estimated $1.2 billion worth of illicit transactions for criminal organisations such as North Korea’s Lazarus Group.\n\nIt lets honest users create a cryptographic proof that shows the money they put into the protocol didn’t come from wallets associated with stolen funds or illicit activity, while at the same time keeping the origin of the money secret.\n\nThe hope is that if all honest users generate these proofs, bad actors attempting to launder money through the protocol will be the only ones left without them, letting crypto exchanges and law enforcement identify and exclude these users.\n\nData of the week — Railgun overview\n\nPrivacy protocol Railgun’s popularity has grown, even before Buterin mentioned it in his X post.\n\nRailgun has facilitated almost $1 billion in transaction volume since its launch in May 2022.\n\nrailgun Railgun is processing more transaction volume in recent months. (@railgun_project)\n\nThis week in DeFi governance\n\nVOTE: Uniswap DAO votes for Manta Pacific onboarding package\n\nPROPOSAL: Arbitrum DAO wants to activate the blockchain’s Stylus upgrade\n\nVOTE: SafeDAO votes to make its SAFE token tradable\n\nPost of the week\n\nPseudonymous crypto trader GCR made their first X post in almost a year over the weekend as Iran’s drone attack against Israel jolted the crypto market.\n\nGCR is one of the most revered crypto traders on X, building a strong reputation by making numerous accurate predictions.\n\nWhether you buy into their takes or not, GCR’s posts have the power to move markets and sway sentiment — so they’re definitely worth paying attention to.\n\nIf you've been sidelined, believe this is a good opportunity to scale into high conviction tokens\n\n\n\nIf you're fully invested, just survive, hold your spot positions and do not capitulate\n\n\n\nSomeone once said, liquidations are a forced transfer of wealth from traders who need… — GCR (@GCRClassic) April 13, 2024\n\nIf you've been sidelined, believe this is a good opportunity to scale into high conviction tokens\n\n\n\nIf you're fully invested, just survive, hold your spot positions and do not capitulate\n\n\n\nSomeone once said, liquidations are a forced transfer of wealth from traders who need… — GCR (@GCRClassic) April 13, 2024\n\nWhat we’re watching...\n\nGM\n\n\n\nTether's tokenisation platform will soon be available to everyone.\n\nA masterpiece.\n\nFully non custodial.\n\nMulti chain.\n\nMulti asset type.\n\nSuper customizable.\n\n\n\n+T — Paolo Ardoino 🍐 (@paoloardoino) April 14, 2024\n\nGM\n\n\n\nTether's tokenisation platform will soon be available to everyone.\n\nA masterpiece.\n\nFully non custodial.\n\nMulti chain.\n\nMulti asset type.\n\nSuper customizable.\n\n\n\n+T — Paolo Ardoino 🍐 (@paoloardoino) April 14, 2024\n\nTether CEO Paolo Ardoino hints at his firm’s new tokenisation platform.\n\nThe move comes on the back of BlackRock’s tokenised fund BUIDL, which has attracted almost $300 million on Ethereum.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNcVY1WGxyQVZYYVJ6VXhTVXItWHdYRGpnYW1EazhLVXRIOXRUX0FMV0sxd3VhRm9vTzY2REhvSFQxdDlCQk53TW9SbFBUTmtXN2EwN3Z2RHFsVDFXU2FnV3NXQjZLUUNiYWVBRnFSa0JzdVU3aHVMd0VQLW43TFJPOEJRWEtLQ1RFU1RobGEtd1lCZEZ4elhV0gGcAUFVX3lxTFA1eFNtVC13dXp1VDZobjF4ZXN3LXpyNVl6RjAxVm1QalJscFhUQWt2Z2ZDUWZodTk5UmtpOTdCdFQ2eVU4ZGJ1Y3JfUFhjTXN1N1pzM2JZQXZoRmU4MmxRakVERlRQWjR0QjhGMGk3Uno3TW5yQ1E0ZWdiQjUzd0pGOWZjVWZhS2xNRm1UNGZHdjd0Rm5qODZQejFUbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Bitcoin & Ethereum ETF To Attract Only $1B AUM: Bloomberg Analyst - CoinGape",
        "content": "Bloomberg analyst Eric Balchunas, in collaboration with analyst Rebecca Sin, has adjusted estimates for the potential assets under management (AUM) of Bitcoin and Ethereum Exchange-traded Funds (ETFs) in Hong Kong. The AUM expectation for the Hong Kong Bitcoin and Ethereum ETFs has been lowered to $1 billion.\n\nHong Kong Bitcoin & Ethereum ETFs Might Face China’s Regulatory Scrutiny\n\nBalchunas shared insights indicating that mainland China investors may not be eligible to purchase these ETFs due to restrictions on virtual asset investments. Consequently, the analysts have revised the AUM target down from $25 billion to $1 billion for the first two years.\n\nadvertisement\n\nDespite the lowered projection, Balchunas still considers the $1 billion estimate for the Hong Kong Bitcoin and Ethereum ETFs as healthy. However, he emphasized that it falls significantly short of the previously speculated $25 billion mark. In addition, he noted that the speed of attaining this revised target largely hinges on improvements in infrastructure.\n\nMoreover, Balchunas also noted that although mainland China investors face restrictions, there are alternative routes available for investment. However, these methods utilize less utilized channels that could potentially face regulatory scrutiny.\n\nEarlier, the analyst also noted that the inflows of Hong Kong Bitcoin and Ethereum ETFs would be lower than expected. The biggest restriction was the size of the Hong Kong crypto market being relatively smaller than that of the U.S. In addition, the restraints on the Mainland China investors adds to the challenges.\n\nAlso Read: Top Analyst Sees Bitcoin (BTC) Hitting $650K Amid Hong Kong’s Bet\n\nHong Kong SFC Offers Greenlight\n\nEarlier, on Monday, April 14, the Hong Kong Securities and Futures Commission (SFC officially sanctioned the trading of Spot Bitcoin ETFs and Ethereum ETFs, marking a significant milestone. Moreover, Hong Kong now stands as the first jurisdiction to introduce a Spot Ethereum ETF, while similar discussions are underway with the US SEC.\n\nDiverse financial institutions such as China Asset Management, Bosera Capital, and HashKey Capital Limited have received the green light from the Hong Kong SFC to launch Bitcoin and Ethereum ETFs. This breakthrough empowers investors to invest in Bitcoin and Ethereum by obtaining shares in these ETFs.\n\nAlso Read: Bitcoin ETF Outflows Cross $58 Million, GBTC Outflows Slow Down\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUjVBTTM1TkY1UmZ5aHBuOHZrWEd5RC13WUROZ19vVEE2Z2dTNUtFVFVDV0pmVHVtNEdIYnhoWjVBZnJIOHoyVGFXLU1wY21wUGZjTlE4T1gtWUdEaU05bG4zcF9nZDl1RmNLMlpXRzNJTi0tWGtROHl6QWRUM1A1NTVRd3pvZ0Ez0gGQAUFVX3lxTE1vUzl2MXczRjA2WGtHR01YTXdfTnRCaEpSTTU3U0h1aGZLWUZNZkpyU1lJUjdyZWVaeXJOalZSYXRCRW82enlQMDZ0M185VzBpdzZ4Rjk0QUs0WHJVWTZBYjR1LUE3cFBtU1psMnVyM2VJNUxXajRVSkFuRnpSODdLLV9ZZUhBNlg3VkhISkwxag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Saga Reveals Massive Airdrop With Ethereum, Solana, and Avalanche Projects - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGaming-focused layer-1 blockchain Saga has announced an airdrop campaign so huge, the team is calling it: Power-Level Over 9000! It’s a “Dragon Ball Z” reference that spawned a memorable internet meme, and now it’s conveying the scale of this sizable rewards push.\n\nIn partnership with over 100—not quite 9,000—projects and games across various blockchain networks, users who stake their SAGA tokens will be eligible for bundles of token and NFT airdrops “over the coming months,” the announcement says.\n\nEach airdrop is grouped in “vaults” that feature multiple projects giving out various prizes. Notable games across various chains, such as Avalanche first-person shooter Shrapnel, Ethereum metaverse game The Sandbox, and Ethereum racing game Wilder World are all involved in the campaign, with more to be announced.\n\n“At Saga, we take immense pride in fostering collaboration and unity within the Web3 gaming community,” Saga said in the announcement, “With partners hailing from diverse ecosystems, including Ethereum, Solana, Cosmos, Polygon, and Avalanche, our airdrop campaign serves as a testament to our unwavering commitment to bringing the Web3 gaming community together.”\n\nAD\n\nAD\n\nWhile there are projects outside of the Saga ecosystem participating in this event, the “majority” of drops will come from “chainlets” that use the Saga network.\n\nSaga is a layer-1 network that enables developers to launch their own layer-1 chains, instead of deploying projects on the Saga mainnet. The chains that developers launch are called chainlets and can support other chainlets within the Saga network.\n\nThe fresh-faced layer-1 network made a name for itself with its previous airdrop campaigns, which led to a record-breaking $13.4 billion staked on Binance to earn SAGA token rewards.\n\nAD\n\nAD\n\nLast week, Saga launched its mainnet alongside its token listing on major cryptocurrency exchange Binance. This new airdrop campaign is its first big marketing push now that the token is live.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOU2QwTXVUUlZYOEpSdGZqdUFzNmhhNGZPS211Q0xSM25FY3pHRnhDd2ZqVTNKTzZoS1YzdWMtcFMtXzBvcER0Tk8zS19ueUk5TDRrenl0WHEyWU5vS0d5UFZqRHUzbFNFTjZmREN2dHJNak1PSERiUndyOS1QRVNYeE5zaE84ME9GUXhoZjRmaFo0d243UWJiV01wZnZEcU9USGVZSGhnNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Blockchain: the queue of validators is sharply increasing - The Cryptonomist",
        "content": "The queue of Ethereum Blockchain validators is sharply increasing, reaching the highest levels since September 2023. Currently, the waiting list of validator nodes has risen above 21,391.\n\nEthereum Blockchain: the number of validators reaches 21,391\n\nAccording to data from ValidatorQueue, it seems that the Ethereum blockchain validator queue rose to 21,391 yesterday. Nothing to do with the 7,045 validators waiting reported last February.\n\nThis means that the number of users queuing up to register as validators of the network continues to increase, which will be possible by staking their ETH.\n\nNot only, this current level of expectation to become a validator node of the Ethereum Blockchain, is the highest level since September 2023.\n\n​​https://twitter.com/esatoshiclub/status/1780280839688933491\n\n“The Ethereum validator queue reaches its highest level since September 2023. This surge aligns with the increasing interest in restaking, which allows participants to earn additional returns.”\n\nAt the time of writing, the number of active nodes on the network is 984,546, just shy of a million.\n\nEthereum Blockchain: the queue of validators is increasing rapidly due to restaking\n\nIn addition to staking, what has become known is that the motivation behind this surge of interest in becoming a validator of the Ethereum blockchain, is also restaking.\n\nRestaking allows users to stake the same ETH on both Ethereum and other protocols.\n\nPlatforms like EigenLayer leverage Ethereum’s validators and tokens, allowing smaller and newer blockchains to benefit from its security and trust system.\n\nJust in its latest update from a week ago, EigenLayer was launched on the Ethereum mainnet, along with its data availability layer EigenDA.\n\nActually, this launch opens up the possibility for platform restakers to start earning additional returns on their staked ETH, something that did not happen before.\n\nCoinbase Cloud and Google Cloud are among the first operators of the protocol, which on Friday announced six actively validated services that will be guaranteed by EigenLayer’s restaking.\n\nThe opportunities of restaking and the price of ETH\n\nAt the beginning of April, the new earning opportunities in the Ethereum restaking sector were explored, increasingly targeted by crypto airdrop hunters.\n\nSpecifically, Renzo and Etherfi’s airdrops (2nd round) have been analyzed, both besieged by ether stakers in the last month, with a significant influx of capital coming in.\n\nDespite this restaking movement, the price of the crypto ETH is down -12% in the last seven days. At the time of writing, ETH is worth $3,085.\n\nThis trend follows closely that of the market leader, Bitcoin (BTC), which also dropped by -8% in the last week.\n\nNot only that, despite the long wait for Ethereum blockchain validators, the volume of ETH exchange has dropped by -22% in the last 24 hours."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE92VUFObnJTODVkdU9nOFpTQS1QVGpDWkdnNFZmVmpqZFlxSFNfd0lrTXBSV3BIbkswd0xaY0FiZnRqUUl3UGZidWRscWhBMF84SHltaGhuUHVvMnN3cnlDcEduX19oV3BoZFI2RjdDOTV4a0lBemxmUW5vOHlxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Could Drop To $2,000 Level: Here’s Why - Watcher Guru",
        "content": "Ethereum is on the verge of a significant price decline, according to a recent technical analysis by Alan Santana, a well-known crypto analyst. Santana forecasts that Ethereum will reach a price of $2,000 within a few days or weeks, advising investors to brace for the impending decline.\n\nThe analyst points out that Ethereum has been drooping for six weeks straight, yet many investors are still waiting for new highs. Santana presents a compelling five-step sequence that draws parallels between the current market situation and the events that unfolded in November 2021.\n\nAlso read: Can Ethereum (ETH) Hit All-Time High After Bitcoin Halving?\n\nFrom All-Time High to Bearish Momentum\n\nIn early November 2021, Ethereum reached a new all-time high (ATH) but immediately turned red, signaling a potential reversal. Santana emphasizes that while the market is at its most bullish when hitting a new ATH, it also opens up the highest bearish potential.\n\nHe notes that the best time to sell is when prices are trading high and near resistance, as waiting for full confirmation from the market often leads to missed opportunities.\n\nFast forward to early March 2024, Ethereum once again produced a peak, reaching a multi-year high before turning red and starting to drop with bearish momentum growing last week. This pattern closely resembles the events that followed the November 2021 ATH.\n\nAlso read: Can Solana (SOL) Hit $200 After Bitcoin Halving?\n\nEthereum EMA10 Breakdown Confirms Top Is In\n\nFollowing the November 2021 ATH, Ethereum dropped below the 10-week exponential moving average (EMA10) as it turned red. The break and close below EMA10 confirmed that the top was in, and a new bearish wave had begun, leading to the “first drop.” Similarly, last week, on April 8, 2024, Ethereum moved below the EMA10 on the weekly timeframe, confirming that the top is once again in.\n\nFollowing the top confirmation, Santana now anticipates the “first drop,” which could lead to a target range of approximately $2,222 to $2,400. A dead-cat bounce, a temporary recovery in a declining trend, may follow this drop, ultimately leading to a lower low and a bearish impulse.\n\nAlso read: Shiba Inu (SHIB) & Dogecoin (DOGE) Price Prediction This Week\n\nThe analyst suggests that the major flush could reach $2,000, around the 200-week moving average (MA200), which is considered a significant support level. While the price could potentially go lower, Santana identifies this as the key support area to watch."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPOXNxajhlVGJITnFzRVpEOW1UeW44ejlSWVdHVWVJSzJTQnJ4TVA5Um9VSEYtc0dsaE5oX3REejF4aWVHY1YtZU0yNGU5d3h5a1QxVXlLMU9qd3luZmZHQXdUcklsLU9Gd0R1Z3dESGstcXJPSFFYQUFhbEw2SERFZm9xck00eG11TUxQRmV3cV9OY3ZCX1o1YV9odm4tQUs3SnVYclNaNjhBcGVvTGwyWmc3c9IBuAFBVV95cUxPYnhTcGFmYXRkWXJFaTFXeXVKVVhrdklDUXA2dmE5SlBQc0JiaG9WeHVpOG9OYi1Dc1pPRXUyMTZ1WkVIMjc1X0pYSFcyV2Nac25CNldMVE1kc2JTZG1jVmhBZG5JOW13NFdPeEpBa3EycmNrdU95a0pOaUJKQWpGQ0NxRzZ0d1N6MUgzWUwzV3hFbmtoNHVZTUpLS294SjFYTkZDaW5faldjaUM2TTNnUkcxU04tNFox?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Secures $3,000, Cardano's (ADA) Dramatic Drop Irrelevant, Will Shiba Inu (SHIB) Recover After 30% Plunge? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCardano has witnessed a substantial drop to the $0.4 region, suppressing the price by over 20%. Despite the dip, the ascent suggests a potential rally through the 200 EMA, challenging the downtrend with limited volatility and apathetic trade volume.\n\nCardano's price action has been a roller coaster, with its recent plunge to the $0.4 support level and a subsequent bounce back. At the time of writing, ADA has seen its value soar above $0.48, instilling a fresh wave of inflows into the market.\n\nIt is noteworthy that the descent has not influenced the coin’s longer-term trend, which has been bearish with an absence of significant volume — a hint that the market is still in search of a solid direction. However, the surge above the 200 EMA will push the coin into the bullish zone once again.\n\nIf ADA fails, the $0.4 level remains a crucial bastion of support, and its endurance will be critical in preventing further declines. However, if the marketwide recovery continues, there is a good possibility of a prolonged continuation of the rally.\n\nAdvertisement\n\nShiba Inu takes hit\n\nShiba Inu has seen a sharp 30% decline. But one way or another, the only question in most holders' minds is: \"Will Shiba Inu really recover?\"\n\nThe token's dip to the $0.00002165 mark has been met with a mixture of concern and anticipation. A rebound from this level could signal a strong support base, potentially pivoting SHIB back into an uptrend.\n\nAs for the chart, the Bollinger Bands have been preceding the drop as their narrowing was a strong signal of an upcoming price surge. Now, with SHIB having slipped below the crucial 50-day moving average, the only thing left is to wait for a return above this aforementioned level.\n\nThe trading activity is pretty quiet, which shows that people are not too confident about SHIB right now. The RSI is suggesting that selling pressure prevailed over buys on the market, pushing the value of the token down.\n\nSHIB will face its first big test at the $0.00002880 level. If it can go beyond that, we might see the price move up toward $0.00003.\n\nAs for what's next for SHIB, it is really tough to say, considering the lack of fundamental development around Shiba Inu. However, there is always the possibility of a further price reversal and the return of the buying power on the market in general, which is going to push the value of tokens like Shiba Inu further up - especially if the risk appetite among investors returns.\n\nEthereum's comeback\n\nEthereum has made a strong and sufficient comeback, easily returning above the $3,000 threshold. The pivot suggests that Ethereum could continue its path upward despite this minor setback.\n\nFollowing the dip that moved the market, the price action has been affirmative, reclaiming the $3,000 mark with conviction. This level now forms a bedrock of support, cementing the current price range.\n\nSpecifically, the key support at approximately $2,700 is highlighted, a level where the asset has previously beaten the substantial buying pressure. The resistance can be found around the $3,600 zone.\n\nAs the price started rising, the volume started moving up, showing a lot of interest on the market. This rise in trading, along with the clear increase in price, has helped the upward trend to gain strength.\n\nThe intersection of technical indicators with market sentiment heralds a bullish scenario, where the previous peak at approximately $3,950 is not unreal.\n\nHowever, the most recent surge of volatility on the market might not go unnoticed, and it is important to avoid any risky moves that might drastically affect your portfolio."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPbTRSaWVYN0Nqc1VsLXUwSndzTWY2MGJYeW5iRkRJLVFHejc0ZUh6d1F5ekZ3cHNYTlFxNlpWZzhqM3NwME1RcTFoM1VGb05vYWN2bHNiNjk4cUlxZl9XWFcwM0hkVXo5RTFHUXhsN3ZPVU04MFY2aFRFYTFBTExCMGlBSEstcXBGOXE0cdIBlAFBVV95cUxPcGNfeWtHQzl3Y252Sk1obnhDVGMybVRpYUl0ajV6TUFsM2g5NzUyNTdmaXhWTG01VEw1a2QyYUV1MFVVbWc3SUxxRkZ6Ulo0ejBBdDl5eFBWdDlhZDA0Qm00MVFEbHc0T0pDbXkwWnVobldBWGpaX01WUTZtdy1MZklrZmxveG9yUVZ2SlQ4N0tQRnJw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "ApeCoin Nears All-Time Low as Bored Ape Ethereum NFT Prices Plummet - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nApeCoin, the Ethereum-based token tied to Yuga Labs’ namesake NFT collection, is firmly in the doldrums alongside its Ape-themed analogs following a tumultuous week for the broader crypto markets.\n\nThe token has slipped 30% over the past seven days amid market turbulence sparked by growing geopolitical tensions in the Middle East. Extending losses over the past year, the price of ApeCoin has plummeted 74% since this time last April to a current price of $1.19, according to CoinGecko.\n\nApeCoin’s brush towards its all-time low price of $1.01 (set last October) comes as the token’s official steward, the ApeCoin DAO, weighs several proposals from community members. Notable initiatives include establishing a “dominant presence” at an upcoming NFT conference in Portugal and a rewards app for ApeCoin and Yuga NFT holders.\n\nMeanwhile, the Bored Ape Yacht Club’s floor price, representative of the cheapest NFT from the collection listed for sale on a marketplace, has fallen 67% over the past year to $33,000 (11 ETH) from $103,000 (52 ETH), according to data from NFT Price Floor.\n\nAD\n\nAD\n\nThat leaves the floor price for Bored Apes within 1 ETH striking distance of other notable PFP collections, including Pudgy Penguins, CyberKongz, and Grifters by XCOPY—despite broader headwinds in the NFT market over the last year-plus.\n\nPublished at the exact BAYC top pic.twitter.com/xFBSzdR0JP — UubzU (oob-zoo) (@UubzU) April 15, 2024\n\nThe Bored Ape Yacht Club became synonymous with NFTs as pricey, digital status symbols in 2021 and early 2022. And as Yuga Labs’ Otherside game took aim at the metaverse, for example, Bored Apes peaked in floor price, reaching a minimum price of 152 ETH, or $429,000 in April 2022.\n\nApeCoin is expected to be the de facto currency for Yuga Labs’ new projects, including the Otherside, which has held limited playtests but has yet to open up to players on an ongoing basis.\n\nAD\n\nAD\n\nIn February, Otherside General Manager Eric Reid addressed the project’s pace in a blog post, acknowledging that “people are skeptical—if not downright pissed—from the lack of regular information on Otherside.”\n\n“Building something like Otherside is measured in years, not weeks or months,” he continued. “Building the platform and refining our long-term vision has been challenging.”\n\nEarlier this month, the Bored Ape community was confronted with a cultural loss. Two years after it opened, the Los Angeles-based burger joint Bored & Hungry shuttered its doors, hanging up its hat—for the time being—on monetizing IP from the NFT collection in the United States. But there are locations still open in Asia.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOemlFTjNmU0V5NS1POURtNm8tbUhRQWFTZGItZXNyOHF6Z1hkcUJFYlZJT2hKNEplU0lPbndwdDI3YmlKcG9PdG1lZzdXeHRNeUhzS0dWd0R4MVdMRkdTWHExZFNtSU5aOUtZSTM0S1hDVzFFVHBLdjJVTG1OTGdsdFIzVEZraE96MldRQ25PaDBldmFXa2haZF9XMF90Q3hXS1V2SjhvU19PREV3ajJNUnhTS1pnODRLMUVoY2FVTDDSAcYBQVVfeXFMTl9sOW9OTzM2cGNwWDVMMzFSNVcxQnU3V3A2R3h1UFlSRlNsT1g2c3ZCVDl6clhfbDFvSEVmOERaU1BMUk9vUXFROVllVXJOVXlmNG9VWXBfbEc1Y05Wc2h4blZOXzNVWUtyTHY2MzhUTHl5Q1NzMWJqWHhZcDJSSzFkTkQxZ3N6NEhyVEhwNjR0Q1FycmJXNU5ualN3VWJGSDJJb1psbDhPYkRYRHF2SkVJN3BoWFlaLVVCU2dXc0FTSGNCeTh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Lido DAO announces new phase on Ethereum with Simple DVT module - FXStreet",
        "content": "Lido DAO voted on the deployment of the Simple DVT module nearly six months ago, it is ready for mainnet as of April 17.\n\nSimple DVT helps to make Lido’s technology accessible to more users.\n\nLDO price is down nearly 3% in the past day.\n\nLido DAO (LDO) announced that the Simple Distributed Validator Technology (DVT) is now officially ready for mainnet deployment. Lido DAO voted on this module nearly six months and laid the groundwork to diversify their node operators with the help of users that stake their assets with Lido.\n\nLDO price lost nearly 3% of its value on Wednesday.\n\nLido DAO plans to bring Simple DVT to stakers, diversify node operators\n\nLido DAO, a Decentralized Autonomous Organization that decides on the key upgrades and key parameters of liquid staking protocols, is ready to release the Simple DVT module on its mainnet. The clusters labeled Obol Cohort 1 are ready to accept Ethereum (ETH) deposits.\n\nThe Ethereum staking protocol’s goal was to diversify the Node Operator set with the participation of community and solo stakers within its ecosystem. The new depositable Ether will flow into the Simple DVT Module, and once it reaches capacity, it will go to the Curated Module.\n\nLido announced in its official blog that the third Obol testnet run in preparation for bringing Simple DVT to the mainnet, surpassed all minimum performance benchmarks.\n\nLido’s post says that the mainnet onboarding of 12 clusters is underway and the performance metrics are currently above the benchmarks.\n\nLDO price failed to keep up with the developments in the Lido ecosystem. LDO price shaved off 3% of its value in the past day and the token is down nearly 28% on the weekly timeframe. At the time of writing, LDO price is $1.947."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQWF9wQUQycFI0TDRVMVJMX3BCNWVmd0VQaEhNOTZRLUQyZHBTLWJLRmtHeWdIdlhpUzVPRnNPNGNLVk1NMkd5d0owOTVfWEVwSFBXOUs2aHl5NzJibjV2MGdqVy1YU0tRQzFnUjlQaF9IZTY3cnJCNExuVzdwc1hMcmVKcy1wMXdT0gGQAUFVX3lxTE84Q2tNajgyTjZHbUhaaVBjSGRlQjItZUlDR2FkWkh5VUFrWUU1a2dpR1M5c0xEQnZBdTFRTURpaWsyemdXaVM4bW9SaTVMMm43M2RGTjZCaEotSWdsZmdrZFpkX0lQdG9IZ3pyaEozWFZ1NjBMbmEwM21rUGJadmRyaGlwQm0xUlgxZERHSW9NZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Ragnarok Online' Franchise Coming to Ethereum Gaming Network Ronin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe classic Ragnarok Online gaming franchise is coming to Ethereum thanks to a partnership between developer Gravity and Ronin, a sidechain gaming network. Gravity will launch Ragnarok: Monster World, a strategy game based in the Ragnarok Online universe, on Ronin.\n\nRagnarok Online, an iconic massively multiplayer online role-playing game (MMORPG) that has amassed over 167 million downloads globally since its 2002 launch in South Korea, is making its blockchain debut with Ragnarok: Monster World.\n\nDeveloped by Web3 studio ZERO X AND, the game combines tower defense and monster collection elements. The game was first announced in December.\n\n\"Ragnarok holds a special place in the hearts of our core audience in South East Asia, including many of our own team members who grew up as avid fans,\" said Trung Nguyen, CEO and co-founder of Sky Mavis, the studio behind the Ronin network. \"We are committed to bringing IP that will transcend gaming culture through our bleeding edge technology and can't wait to see the ‘Ronin Effect’ on Monster World.\"\n\nAD\n\nAD\n\nScheduled to launch on Ronin in Q3 2024, Ragnarok: Monster World will allow players to tame and collect Ragmons, the game's unique monsters, and then train them and engage in player-vs-player (PvP) battles to earn rewards. Future updates will introduce additional features, as well as benefits tied to community participation.\n\n\"We're thrilled to collaborate with the team behind Axie Infinity, who has spearheaded a new paradigm for play-to-earn and NFTs,\" said Seokjun Kim, founder of ZERO X AND, in a press release. \"By leveraging the skills of our team members experienced in Web2 alongside Sky Mavis' Web3 expertise, we aim to cultivate a stronger gaming and blockchain community.\"\n\nBREAKING: RAGNAROK: MONSTER WORLD IS COMING TO RONIN Today is a glorious day. Welcome to the family, @ragmonnft ⚔️ Ragnarok is more than a game: it’s one of the most iconic gaming universes in the world. It’s a billion-dollar transmedia IP that has amassed over 68 million… pic.twitter.com/jcAoDAaVyg — Ronin (@Ronin_Network) April 17, 2024\n\nRonin was launched alongside Sky Mavis’ Axie Infinity game, and has since expanded to onboard games from third-party studios. The network recently saw a jump in activity around the debut of Pixels, a crypto farming game, plus it supports other games such as Apeiron and The Machines Arena.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNb3p5RmV0M0dyU0J2aFBuNGZtSmtTaENhVlBocG1EaTk0RDE1dmhNcDZoTnVWMkFRWXlMNFdUNTBhVlhhRVdvOFpmOThoMkJIaHRrT2JCcHBGaE1JTG1uc0JMRVU3TFF1cmtfRFQ1UUFEUnM0Z3p6ckxnZVk4NHlkYmNvQnFoaWlXVDFhRFJMNDJfcVVDNUJ0TEdfT0NQa2ZKdGZ3OEZjNjRFNG9GSkE0NC1qbi1iTnN2emR1Z1lkOGRNYjTSAcgBQVVfeXFMTU9vMERuU1JoZjl4bWpOSi1uNTNkVjBLcWVLTjdrZmlVUzFDc25UbHhGYVAyYlJSeXNfcnV1TzY5SUpvM2VETjl6LVVPVFh2cGNuVnpDcDJLTEJrel9ZeHdYRW9aN2FfSnl4ZE9qYVBZZEZWOURMMXJIbVR4ZDQ0Y2xOOU1NMUtzYnFJdTNOeEk4UlFJSmxFclB2cHpnOGdPRnJYdTZtZ3ljbWw4MmpGZU1qMWNwYWF1cFVDYVlRVzd1Sm1xYVF0QnU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Forget Ethereum: BlockDAG’s 30,000x Potential Draws Crowds with Its Video Trailer on The Moon - Crypto News Flash",
        "content": "Once an obscure investment, cryptocurrencies like Ethereum have turned ordinary backers into billionaires. Today, Investors are shifting their focus from Ethereum to BlockDAG, attracted by its potential for astronomical returns. BlockDAG’s presale events have already generated impressive numbers, with $17.8 Million raised from presale activities and an additional $2.1 million from miner sales. As Ethereum faces internal debates over its issuance curve, BlockDAG captures the investment community’s attention, promising a 30,000x return on investment through its innovative mineable network.\n\nEthereum’s Current Climate\n\nThe recent debates over Ethereum’s issuance curve have the community in an uproar. As Ethereum moves into its next upgrade phase, Electra, proposals to decrease issuance to preserve solo staker viability are hotly contested. Figures like Eric Conner and Ahmad Bitar oppose these changes, fearing they undermine Ethereum’s established role as a digital currency by responding excessively to unfounded centralisation worries. This division presents a crucial moment for Ethereum, reflecting broader uncertainties in the crypto market.\n\nThe community is divided amid the discussions around Ethereum’s proposed issuance curve adjustments. Proposals for reducing issuance to benefit solo stalkers face strong opposition from prominent developers who argue that these changes could undermine Ethereum’s utility as a decentralised currency. This controversy highlights the challenges of evolving a principal cryptocurrency while maintaining its foundational principles and community trust.\n\nBlockDAG To The Moon Over $17.8 Million In Presale\n\nBlockDAG stands out in the bustling crypto presale market, having already raised over $17.8 Million in presale and $2.1 Million in miner sales. Its upcoming keynote promises an exhilarating revelation with BDAG on the moon, sparking widespread excitement. The current Keynote video denotes a 100 Million market liquidity promise, prospects of Top exchange listings like KuCoin, CoinEx, Gate.io, and Bitget plus a $0.05 listing price a jump of over 4900% from its earlier batch, BlockDAG’s roadmap is impressively ambitious.\n\nAt the heart of BlockDAG’s appeal is its innovative approach to blockchain technology. According to their latest technical whitepaper, BlockDAG enables developers to build, deploy, and earn efficiently.\n\nThe platform supports many blockchain activities, from creating smart contracts using popular development tools to deploying applications on a testnet before launching them on the mainnet. Furthermore, the potential for developers to earn through transaction fees, subscriptions, and token sales makes BlockDAG an enticing ecosystem for blockchain innovators.\n\nMoreover, BlockDAG utilises Directed Acyclic Graph (DAG) technology, ensuring scalability and performance remain robust as the network expands. This technical foundation facilitates many business models and encourages continuous innovation and community engagement.\n\nThe End\n\nAs the crypto community seeks the next lucrative investment following Ethereum’s historic rise, BlockDAG offers a compelling case with its potential 30,000x ROI. As Ethereum contends with internal conflicts and the crypto community’s growing concerns, BlockDAG positions itself as the preferred alternative for savvy investors. With over $17.8 million in presale revenue and a vibrant community rallying around its innovative offerings, BlockDAG is poised to redefine the investment landscape.\n\nThis burgeoning platform offers a significant ROI and showcases a robust roadmap and technological prowess, promising a lucrative future for early adopters. Join the movement by visiting BlockDAG’s website and exploring investment opportunities in what could be the next breakthrough in the crypto space.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPeXpPRDNmS29YUmpjVk5aT2lnNk9tYnNyNGRzU1YyQTRFcXNoY1ZMaTRaVmlVNlZWU1FJRFFMUll1SlRFQjVoOFhYOWJfclFfYXJoTlJ5Q0xJSmpickgySm9mY09VSVN5XzVrS1I0THlyZkxPeS14aUQ0VmhsU0VueGRPbGVYNUJWdHVJcUxkM3JYSFJzRjlaelpTT0NrRWU1YU5DNGVoVmZyM1Q3NjB2XzIwTVFaVDFvTkU3WUpqc3lFekl2ZlB2bG9TQlFWa3JwazBZeFU4bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "MetaWin Announces Innovative TOKENIZED Tesla Cybertruck Contest on Ethereum's Base Layer 2 Blockchain - CryptoSlate",
        "content": "Chainwire MetaWin Announces Innovative TOKENIZED Tesla Cybertruck Contest on Ethereum’s Base Layer 2 Blockchain MetaWin launches the first tokenized Tesla Cybertruck NFT on Ethereum's Base Layer 2, offering a unique contest for blockchain enthusiasts. Chainwire · · 2 min read\n\nDisclaimer: This is a sponsored press release. Readers should conduct their own research prior to taking any actions related to the content mentioned in this article. Learn more ›\n\nLondon, UK, April 17th, 2024, Chainwire — In a pioneering move within the industry, MetaWin in collaboration with law firm BCLP, has successfully tokenized a Tesla Cybertruck, transforming it into a digital asset wrapped in a legally binding contract and minted as a Non-Fungible Token (NFT). This NFT, which represents full ownership rights to The Cybertruck, has been launched on the Ethereum Base Layer 2 blockchain operated by cryptocurrency giant Coinbase.\n\nThis contest marks a significant milestone as the world’s first tokenized vehicle asset, offering participants an opportunity to win a Cybertruck through a transparent, on-chain process. Entry into the competition is free and easily accessible via a Web3 wallet, with significantly reduced gas prices on the Base Layer 2 blockchain compared to Ethereum’s Main Net.\n\nRebecca Hanwell, Operations Manager at MetaWin, highlighted, “By leveraging the Ethereum Base Layer 2 blockchain, we not only minimize transaction costs but also ensure complete transparency and immediate transfer of ownership for every aspect of this contest – from entry registration to prize allocation.”\n\nParticipants can enhance their chances of winning by acquiring MetaWin NFTs directly from the platform. Each purchase includes complimentary entries, seamlessly registered on-chain at the time of purchase. At the conclusion of the competition, the winner can choose to have the Cybertruck delivered or opt for an alternative prize of $125,000 in USDC/T, if delivery is not feasible.\n\nThe Tesla Cybertruck, renowned for its unique design and celebrity endorsements, serves as an extraordinary prize. It remains under the stewardship of MetaWin, with its VIN number detailed in the NFT contract.\n\nRebecca Hanwell further noted, “The Cybertruck not only represents an exceptional vehicle but also embodies the technological innovation driving our vision at MetaWin. Hosting this contest on the blockchain ensures that every step of the process is as revolutionary as the prize itself.”\n\nThe competition is now open for entries, with the drawing scheduled for June 1, 2024. The winner will receive their prize promptly upon the contest’s conclusion, showcasing the efficiency and potential of blockchain technology in modernising traditional asset ownership. For more information and to participate in this extraordinary contest, visit MetaWin.com.\n\nAbout Metawin\n\nMetaWin is the premier platform for on-chain prize competitions and instant win games, offering a diverse range of entertaining challenges for users to enjoy. By harnessing cutting-edge blockchain technology, MetaWin provides a transparent, fair, and secure gaming environment, making it the go-to destination for blockchain enthusiasts and gamers alike.\n\nFollow us on social media:\n\nX| Instagram\n\nJoin our community:\n\nTelegram | Discord\n\nContact\n\nPR Team\n\nMetawin\n\n[email protected]\n\nShare"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPSm1wbmtqWmpfc2R6WE44OWotNXJDTkpnNmZKRkw5OWV1ZHM2dUM1bnRaazJHVlZjSFpCeE10VXFFc2dlYzBKUEhYTmZLdEVaMHhJa2F2MnRfZ2Fzd2IyMVlzeV84bnA5TTFyUUVycGJwU3VNZUZ1TExjSVNvVi1VTUV5M2RIX1dCdFhGS3VVRHhfQjBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Pepe vs Shiba Inu: Which Ethereum Memecoin To Buy Before Halving? - CoinGape",
        "content": "As the crypto community prepares for the fourth Bitcoin halving on February 20, 2024, the question of which Ethereum-based meme coin—Pepe Coin or Shiba Inu—to invest in becomes a significant topic of discussion. Both tokens share some common traits such and dedicated community and meme-inspired origins, yet their market performance and technical indicators set them apart in terms of their potential as an investment before the halving. In this article we share insights to empower you in making investment decisions, between PEPE and Shiba Inu.\n\nPEPE vs Shiba Inu: Price Market Performance\n\nPepe and Shiba Inu are two popular digital currencies that have attracted a lot of interest in the cryptocurrency market. Despite their similarities as memecoins, they exhibit differences in their price market performance and metrics.\n\nadvertisement\n\nAccording to CoinMarketCap data, SHIB boasts of a market cap of $13.23 billion, earning its position as the 12th largest cryptocurrency by market cap. In contracts, PEPE has a market capitalization of $2.23 billion, securing the 47th position, among the top 50 cryptocurrencies. This shows that Shiba Inu has a significantly greater market presence than PEPE.\n\nPEPE saw a 4.21% rise in price daily and a 24.87% increase weekly, yet encountered a significant 31.33% decline in the past month. On the other hand, Shiba Inu experienced a less significant daily gain of 2.87% and a monthly decline of 10%. SHIB’s weekly decrease was also 18.86%. This implies that although PEPE has faced substantial short-term fluctuations, its long-term results have been more inconsistent.\n\nWhen it comes to daily and weekly performance, Pepe coin experienced an increase of 4.21% in its value over the last week, and a 31.33% drop in the past month. On the other hand, Shiba Inu tokens recorded a slight gain of 2.87%, although it experienced losses of 18.86% and 10% over the past week and month respectively. This implies that although PEPE has faced substantial short-term fluctuations, its long-term results have been more inconsistent.\n\nIn terms of volume, both tokens have been actively traded in the market. PEPE had a trading volume of $722.3 million over a 24-hour period, whereas Shiba Inu’s volume was higher at $846.18 million. PEPE has a volume-to-market cap ratio of 32.53%, showing a greater level of trading compared to its market cap. SHIB’s ratio sits at 6.43%, indicating decreased trading activity in relation to its market cap.\n\nPEPE achieved its all-time high of $0.00001074 just slightly over a month ago, on March 14, 2024, but has since dropped in value by 50.68% to its current price of $0.000005293. On the other hand, Shiba Inu price reached its all-time high of $0.00008845 two years ago, in October 2021, and likewise, it has witnessed a dropped of approximately 74.67% to record $0.00002246.\n\nPEPE vs Shiba Inu: Price Forecast\n\nIn comparing the technical analysis of Pepe Coin and Shiba Inu, we observe distinct trends and patterns in terms of moving averages, oscillators, MACD, RSI, and Fibonacci support and resistance levels.\n\nBeginning with the moving averages, both Pepe Coin and Shiba Inu are showing decreasing patterns in their short-term signals. The 10-day exponential moving average (EMA) for Pepe Coin is 0.000005928279, while the simple moving average (SMA) is 0.000006150416. Shiba Inu has a 10-day EMA of 0.00002415 and an SMA of 0.00002476. Both sets of data indicate a bearish signal since the current prices fall below the short-term averages. In addition, the 100-day and 200-day EMAs and SMAs suggest a possible change in trend, with Pepe Coin displaying a more robust buy signal than Shiba Inu.\n\nRegarding oscillators, both cryptocurrencies present a neutral outlook. The Relative Strength Index (RSI) of PEPE stands at 40.21, while Shiba Inu’s RSI rests at 39.99. This shows that both coins are not experiencing any overbought or oversold conditions.\n\nLooking at MACD analysis, both the Ethereum meme coins indicate ‘sell’. SHIB exhibits a MACD level of -0.00000126, while PEPE’s MACD level is at -0.000000471995. This indicates a potential downward trend coming soon for both coins.\n\nWith regards to Fibonacci levels, should the price of Pepe Coin drop, it will find a strong support level at 0.000007435425, and Shiba Inu will find its support level 0.00002964 should its price drop. Both cryptocurrencies have various levels of support and resistance, but Pepe Coin is closer to its support levels, indicating potential price volatility. Shiba Inu, on the other hand, seems to have more distant support levels, which could imply greater stability in its price movements.\n\nWhich Ethereum Meme Coin Should you Buy?\n\nPepe Coin and Shiba Inu both provide distinct investment opportunities, but they appeal to varying levels of risk tolerance. Pepe Coin’s potential for future expansion makes it an appealing option for individuals looking for greater returns despite the increased risk involved. The market presence and stability of the Shiba Inu coin could attract investors looking for a safer and more consistent choice. In the end, choosing between Pepe Coin and Shiba Inu will be determined by personal investment objectives and willingness to take risks as the halving event nears."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNc2J1Q3pjSEVGSE9MZG9tNXRhMjJlY19xTUFuTzN1QUY3bGlucDlNc0YydVlpU3JDV2YyNnZfSUhEcjRsRnZYSjQtVGUzRUQ4Zm1VTmdERHkyMThmcWljajlzMEdEeUlTeGxpVGJ3YlY2dk8teTlhWXV2Rmt3M292WFlmaDZfUDdNUXpSeGVlQTVhUdIBlwFBVV95cUxOZ2c3aGtzSkJUTnpNUXJLVkIwOUxhWGNENENxSHpNaWR1a2I0elFuaXhwMGI4cXpGWkx0WmNzNWJKM0p0c2FEUW1NaWhac2hZMklPV2hRMWwtTkNCODNyUnNQaEdjLUtVNkZpX29uamhLN0lja1h1dGpNR2I0T1VYTXJ2ckUzUHdieENXd2Y4M2JKUFRaUEhV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "‘Dogecoin purer than Ethereum:’ Elon Musk, execs react to Top 10 move - AMBCrypto News",
        "content": "DOGE surges 4% with Elon Musk tweet amid memecoin frenzy.\n\nDeFi regulations could boost DOGE, paving the path to ETF eligibility.\n\nIn light of the recent crypto bloodbath stirring the crypto market, Dogecoin [DOGE] was amongst a few altcoins that spiked a little amidst the market crash.\n\nThe dog-themed cryptocurrency saw a slight uptick of over 4% in its price following a recent tweet from Elon Musk.\n\nThe memecoin craze\n\nRecently, Musk humorously compared mainstream media to characters from “Monty Python’s Life of Brian,” who have been struggling to report on Dogecoin’s rise amongst the top cryptocurrencies.\n\nThis playful portrayal highlighted the nature of Dogecoin’s success and the influence of social media culture on financial markets.\n\nAs the market turns on the path to recovery, social media is abuzz with memecoin mania, as highlighted by @ApeCryptos in his recent X post,\n\n“U Can’t Stop #Meme Coins.”\n\nShedding light on the regulatory actions against DeFi projects, Will Clemente, co-founder of Reflexivity Research in conversation with Laura Shin, host of “Unchained” podcast, saw this as a potential benefit for meme coins.\n\nHe said,\n\n“I think the one that has the highest likelihood could actually be Dogecoin because it’s a commodity right? I mean I would argue that it’s a much purer commodity profile than like Ethereum.”\n\nClemente believes that if DeFi projects face shutdowns or regulatory hurdles, investors might turn to meme coins as an alternative investment option.\n\nAdditionally, he outlines that the regulatory environment could pave the way for meme coins to gain traction and potentially become eligible for inclusion in cryptocurrency ETFs.\n\nWhat lies ahead for DOGE?\n\nNotably, Even though DOGE has seen losses recently, there are still many holders who refuse to waver.\n\nOn-chain data reveals a notable 18% decline in value over the past week, yet Dogecoin’s long-term investors stand strong while navigating the market with resilience.\n\nMoreover, insights from IntoTheBlock reveal that a staggering 81% of DOGE wallet addresses are still basking in profitability, even amid the recent downward spiral.\n\nEchoing similar sentiments, Crypto Daily Trade Signals, added,\n\n“#Dogecoin will do this soon $1 #Doge coming faster than you think!!”\n\nErgo, despite DOGE currently treading water in its consolidation phase, its potential to shift market sentiments from bearish to bullish remains positive."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZ3JHbmVDNG1fTHNpQWdBYVAwU2FvVTRFd2N6VTVYcllNck5mMGhZU0JuMGdLOS1XRl9aX2ZtYXlhdjdNaGNhSEF4QU1kVktXOFl1RWtKejBJTG9OeG9BVk1HNzhscVllZ25TcC1Cc0hheF9ha0RETnFaMGt5MHlDeEZ1SVh6d1hHT3Z0SA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "China To Carry Out Bitcoin, Ethereum, XRP Price Inflation: Report - CoinGape",
        "content": "China may be about to explode in XRP, Ethereum, and Bitcoin prices with the latest launch of ETF. Forbes reports that crypto investors already anticipate that Hong Kong and the United States will battle for cryptocurrency inflows into their respective funds due to the revelations.\n\nChina To Inflate BTC, ETH, and XRP Price\n\nBosera Capital, Harvest Global, and China Asset Management have announced that they have received approval to sell spot Ethereum and Bitcoin ETFs in Hong Kong. Forbes highlights that crypto investors already anticipate that Hong Kong and the United States will battle for cryptocurrency inflows into their respective funds due to the revelations.\n\nadvertisement\n\nThe demand that these ETFs are going to create might be way more than what is in supply. This could create a surge in price for Bitcoin, Ethereum, and even XRP.\n\nRead Also: Bitcoin’s Funding Rate and Resistance Threatens Price Rebound\n\nBitcoin ETF’s Success in The US\n\nForbes states that over $50 billion in assets under management have been drawn to the fleet of new spot Bitcoin ETFs allowed by the U.S. Securities and Exchange Commission (SEC) in January. Ever since the approval came, investors flocked to gain exposure to Bitcoin after ten years of application denials.\n\nWith assets under management of about $15 billion and $9 billion, respectively, Wall Street behemoths BlackRock and Fidelity have emerged as the two biggest of the new Bitcoin ETF issuers.\n\nWith the success of ETFs in the US, the likelihood of these ETFs performing exceptionally well in Hong Kong is being priced in by market participants.\n\nWill Mainland China Purchase Bitcoin ETFs?\n\nAs of right now, the territory is completely prohibited from cryptocurrency in Mainland China. Thus, at this point, it appears unlikely that it will have access to Ethereum and Bitcoin ETFs that are listed in Hong Kong. Hong Kong issuers have confirmed that regulatory restrictions prevent mainland Chinese funds from purchasing exchange-traded funds (ETFs) related to cryptocurrencies.\n\nRecent correspondence from ETF providers headquartered in Hong Kong has dispelled myths regarding the financial acumen of mainland Chinese participants in the Southbound Stock Connect program. The Southbound Stock Connect program, which was created to promote cross-border investment between mainland China and Hong Kong, does not include digital currency products due to China’s position on bitcoin risk.\n\nRead Also: Mark Cuban Wires $275M In Taxes, Sends Crucial Message To Community\n\nNausheen Thusoo\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxOSkdXVlRVME1CTHRDSDFaRkFrdkZMNWdRM0x6d0YzTHZQVXZsdnB1ZTktMVlNcGFoZkVxVFpRQUo0SUZpNVhfYkZZbWI2TkJJMUlyYlVURktXR1lmTHdNNEFqWS1rUEVqWjE0NTRvbWlTMkdXS3lhZW9FbUE4SDB0T2pIMjRWcG56VnhsbzJXRUFHZm8wU0J5a2dyRVp5S29VZjkzWG5MM2lPTnNHN2RJeTR1amJZN09fWFZMR2VIeWo0MVE4cGlPSHdvOGwwejJWVmxPVUVkYWx1NGZqM2dkMWVtZ1dua1ltMmZiUFpycjhaY1BhUWNYUW16YTVndllpbGhFX1lkRl93eVdqbjNvNDlBR0RtTElB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Approves Spot Bitcoin and Ethereum ETFs, Enabling In-Kind Redemptions and Anticipated to Energize Local Crypto Market - China Money Network",
        "content": "UNLOCK DATA\n\nSubscribe & Access the Best Data and Intelligence on Chinese Venture Capital and Tech\n\nRegister Now\n\nWant to read this important story?\n\nAccess thousands of news articles and data posts over the past 9 years!"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxObVV3czJsZWF4T3BYbWlZLXp0bEJpUXZFWEVMYTR1bUpSYXJQLXh2SmdGaml2VzJ6UXc2akdWUklPY2pMLTVsWFNGZnU1OHpkUWlPdUlESUJqNXRBOGlIdVBDdGthYTFMaXdqREFKVU8wYm0tRER6cmdTRGtacFJRU3EwMGNxZDFwMTdqdHBfRXdEY3UwSlHSAZsBQVVfeXFMTlByREF3cVBnd0Z6R2hGNWNxQ2NGdmhVRTBuc3J4WUZ0bFdJczBqYnh0ZV93NVBGampwOWJNTVloSW5vQ0R2ckpUUVpIZmZnX3RmUFc3cjFXSzdMUUxVdmRyd2Q2cmE3bHJFeENycUd4VEZLS1FLNjBBQ082ZE9CN21BWlo0U21RaGFTRU1mMGpLd2QwemV1SEEyUUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "‘Ethereum L2s can steal user funds right now’ – Are the allegations true? - AMBCrypto News",
        "content": "Exec claims Ethereum L2s can “steal user funds.”\n\nIndustry figures propose multi-signatories to eliminate single points of failure.\n\nIn a surprising disclosure, it has been revealed that the safety of user funds in Ethereum [ETH] L2s is not guaranteed.\n\nAccording to founder and CIO of crypto-focused Cyber Capital, Justin Bons, L2s like Arbitrum [ARB], Optimism [OP], Base, Blast, Starknet [STRK], and ZkSync can all “steal user funds.”\n\n“Arbitrum, Optimism, Base, Blast, Starknet & ZkSync all have admin keys! All of the top L2s can steal all user funds right now.”\n\nThis is even more disturbing because, according to VanEck analysis, the space is projected to reach a $1T value by 2030.\n\nThe exec compared the current state of L2s to legacy banking and took a swipe at Ethereum for being a “lip service” to decentralization.\n\n“If this is considered safe, then we might as well go back to legacy banking. ETH gives decentralization lip service, but actions speak louder than word”\n\nReaction to safety concerns in Ethereum L2s\n\nSolana [SOL] co-founder Anatoly Yakovenko suggested a “multi-sig” shared sequencer as a solution to the “single admin key.” He stated,\n\n“Each one should volunteer a tribute to be a member of the multi-sig for the shared sequencer.”\n\nMulti-sig means having multiple signatories to increase decentralization, transparency, and eliminate the risk of a “single admin key.”\n\nRaj Gokal, another Solana co-founder, called for an expedited solution,\n\n“Hope this gets fixed soon…”\n\nHowever, the founder and CEO of Helius Labs, a Solana developer platform, vouched for Ethereum [ETH] L2s and preferred them over Binance [BNB], Cardano [ADA], or Ripple [XRP].\n\nHe reiterated,\n\n“Fine, I’ll say something positive about L2s: I’d be much happier if they were in the top 10 instead of Cardano, XRP, and BNB.”\n\nAsked whether Solana should consider some L2s as well, the Helius Labs’ exec quipped,\n\n“Could make sense in some cases.”\n\nA recent AMBcrypto analysis established increased transactions within L2s post-Dencun upgrade, which could tip ETH’s value.\n\nHowever, ETH faced key headwinds, including the SEC’s silence on spot ETFs and ongoing Middle East tensions. At the time of writing, it was barely holding above $3K."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRzZQOFRlS0N3MTFkYVBPNWt4YlF2Wi1GMktzYnFjQnpyOHlVbGg0SWdOUEE2WFU2LVlRVW4ySGt1WXFsb1RRRlk5WFdYeUFqTUhGMFBlbWNwZjJEOWctNnJxTEdUamZuTEFsTFEyaExIX1AzdUZST19RaVo0WkVfOXRtMFRTemJtWVdiM2hXa2lXMDBpOEpyTUxnMHpFLXo1YWdF0gGoAUFVX3lxTFAtam1Ick9VWEstS01UVVEyVzl1ejJNakYwOVAzRlVYRlgxQjNtRG9TT1k3UjNKNzhEbG1YZWdpT0wwNlFKRkxINGRXdmpBZk4yTm1DUF9GcFdmYTlWRGp1M3NqeGg3cW12TWtHSkQtSkl5ei1pRmhsbXBJNHpKNjI2SWV0UHhfM05kd21hX3hCZWJMbWh2ZXIxQjVJa2JCOVlhZTNsbXRoUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 17: Bitcoin At $64K, Ethereum Above $3100, SOL & XRP Recover - CoinGape",
        "content": "The top crypto prices today registered a rebound as the Bitcoin (BTC) price traded below the $64,000 level. In addition, the Ethereum (ETH) price soared past the $3,100 mark. Meanwhile, other top altcoins, such as Cardano (ADA), Solana (SOL) and XRP rebounded notably.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 2.99% reaching $64,209.56 at the time of writing on Wednesday, April 17. On the other hand, it’s trading volume slumped 8.94% to $40.08 billion in the last 24 hours. Whilst, the crypto held a market capitalization of $1.26 trillion.\n\nadvertisement\n\nIn the altcoin arena, the Ethereum price gained 3.04% to $3,115.86 at press time with a market valuation of $374.12 billion. Whilst, ETH saw its trading volume plummet by 21.31%, reaching $17.64 billion. Meanwhile, the Binance Coin (BNB) price was up by 1.51%, reaching $546.11. On the contrary, its 24-hour trade slipped 16.93% to $1.26 billion.\n\nThe Solana price sustained above the $140 mark today. The Solana price surged by 7.76%, settling at $142.59. In addition, SOL witnessed a 13.46% slump in trade volume to $4.94 billion in the last 24 hours. Whilst, the XRP price hit the $0.50 mark again. The XRP price recorded a gain of 3.69%, reaching $0.5001. On the other hand, XRP’s trading volume plummeted 29.14% to $1.71 billion.\n\nMeanwhile, the Cardano price was up by 2.25% to $0.4636 today. Whilst, ADA recorded a decline of 31.53% in its 24-hour trading volume, settling at $484.74 million. As the top crypto prices recovered from losses, the popular meme coins followed suit. The Dogecoin price rose 3.45% to $0.158 while its rival, Shiba Inu price rallied by 8.21% and traded at $0.00002283.\n\nAlso Read: Bitcoin Price Drops as Powell Signals Delay in Interest Rate Cuts\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a Solana meme coin, rebounded significantly today. At press time, the Pepe Coin price was up by 12.10% to $0.000005416 with a market valuation of $2.28 billion. In contrast, the 24-hour trade volume for PEPE slumped by 17.97% to $732.55 million.\n\nCelestia Soars 11%\n\nCelestia (TIA), a trending crypto, registered an phenomenal rally of nearly 11% and ranked the top crypto gainer today. The Celestia price was up by 10.98% to $10.99 at the time of reporting. Moreover, its trade volume spiked 21.22% and stood at $292.78 million. Furthermore, the TIA crypto attained a high of $11.56 amid the rally today.\n\nAlso Read: Solana Mining Protocol Ore Pauses Operations Due To Congestion\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQSDFaazhVdFp5RDlUZGNVZ3VzREFObDUxSmFOTG5rOGZVaGhjQUNNb25DTENLUzE0dE50LTZQVjg5TTB0T0hSajh4d0tZR0Z0NWNXU1NlbjNsWU9ibmlQTGlodTJfellBYlJGUW45dGhtQ0dOeHZxdVhjazFUOUpENkhOV29MdTNRSC1nTlZjWdIBlAFBVV95cUxPelBiQ1hLUWVYSTNvTzFWa3RoS3ZNUUY0Vlp1ckpvWFVnamlYQ2FSWXROc2Z4SjE3NngtZmQ3cU9FalZSQ2YzTzVDNEdZZ0JlZmkxX1JxbnNvWHJXUkF4SFhROC1tY18yVHNER3RuWEttVkctRU9mRlItX2VfV1JEMzVieDZfbExnbWh6OGZzODhPcldz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum regains its groove? All about ETH’s 7% uptick in 24 hours - AMBCrypto News",
        "content": "ETH was up by more than 7% in the last 24 hours.\n\nMetrics and indicators looked bullish on the token.\n\nEthereum’s [ETH] massive price decline seemed to have come to an end as the king of altcoin’s price increased in the last 24 hours.\n\nIn fact, as per AMBCrypto’s analysis, things might turn bullish for the king of altcoins, which might allow ETH to recapture its lost value.\n\nEthereum is buckling up\n\nThe crypto market witnessed a crash on the 12th of April, which had a major impact on ETH’s price.\n\nThe downtrend pushed the king of altcoins’ price under $3k, which raised alarms and caused panic among investors.\n\nHowever, the last few hours witnessed a change in market trend as most cryptos daily charts turned green.\n\nSjuul, founder of AltCryptoGems and a popular crypto analyst, recently posted a tweet revealing that if ETH manages to go above $3,050, a bull run might begin.\n\nThe good news was that ETH managed to move above that level. According to CoinMarketCap, ETH was up by more than 7% in the last 24 hours.\n\nAt press time, it was trading at $3,257.33 with a market capitalization of over $391 billion.\n\nTo see whether this is the beginning of a full-fledged recovery, AMBCrypto checked Ethereum’s on-chain metrics.\n\nOur analysis of CryptoQuant’s data revealed that its exchange reserve was dropping, signifying a drop in selling pressure.\n\nUpon further analysis, we found quite a few other bullish metrics. For example, the token’s active addresses increased by 12%. Meanwhile, its transaction count also surged by nearly 10% compared to yesterday.\n\nAdditionally, ETH’s Funding Rate was green. This meant that long-position traders were dominant and were willing to pay short-position traders.\n\nWhat are the next possible targets?\n\nAMBCrypto then analyzed Ethereum’s daily chart to see the possibility of the token continuing its price uptick. ETH’s Relative Strength Index (RSI) registered a sharp uptick on the 15th of April.\n\nThe Money Flow Index (MFI) also followed a similar trend, hinting at a continued price increase. ETH’s price rebounded from the lower limit of the Bollinger Bands, further suggesting that the bull rally might continue.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nOur look at Hyblock Capital’s data pointed out quite a few levels that ETH might reach this week if the bull rally actually sustains. The first target for ETH might be $3.34k, as liquidation would rise at that level.\n\nIf a successful breakout happens above that, then ETH might as well touch $3.6k or even $3.8k in the following days."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE81SzZGMFY5V0ROOVA2OFNwZnJXamJHSEllUlJnbHo5Y3J2WWE2dmh2QV9MdWdfUWttQTQ4NGg3ME5GVzVNYXcyR3ZyWVdqYnhRbWNvaDZnQW10V2tUbG95aThQbUVqUF9tU1HSAW9BVV95cUxOWWJTZGVGa2JBaGZncEhKVmcxS2J1d3BlaEREdDBMU0tqUmEzXzNmaE1wT1NPYlhWMExYT0hhQ1NPWGsyX3JnR1VlbVQzM2NNbWw5clM5UmhSdlFLRWxLSlA1eGVkN2pLX1F3dTVqTW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum behind Render’s 18% rally? - AMBCrypto News",
        "content": "The token’s value increased, and so did ETH.\n\nRNDR’s popularity grew among traders, suggesting a significant price hike in the long term.\n\nRender [RNDR], the native token of the distributed GPU network built on Ethereum [ETH] jumped by an incredible 18.85% in the last 24 hours.\n\nThis performance made RNDR one of the top assets with the best recovery rate after the broader market experienced a drawdown. Interestingly, the bounce happened as ETH itself was able to reclaim $3,000 and rise above it.\n\nHowever, there were other reasons the price of RNDR increased. The first thing AMBCrypto noticed was the increase in social dominance.\n\nDid ETH “Render” help?\n\nAnalyzing data from LunarCrush, we observed that Render’s social dominance increased by a mind-blowing 116% within the same timeframe the value skyrocketed.\n\nThe increase in social dominance implied that the project’s popularity among traders surged. From our findings, traders were attracted to RNDR because of its fundamentals.\n\nAnyone conversant with the market would have observed that many market participants are bullish on projects with the DePIN narrative. DePIN stands for Decentralized Physical Infrastructure Networks.\n\nIn the crypto space, projects built around this narrative like Render, use tokens to incentivize holders who utilize the protocol.\n\nFurthermore, AMBCrypto observed another proof of the interest in RNDR. This time, it was the trading volume. According to Santiment, Render’s trading volume rose to 556.65 million on the 14th of April.\n\nThis increase represented a 37.72% jump from the value on the 13th. However, the volume decreased slightly at press time, indicating that RNDR might not have a solid backing to continue its upswing.\n\nSentiment stays the same\n\nDespite RNDR’s potential, it seemed traders were not yet convinced about its short-term performance. This was evident from the Weighted Sentiment analyzed on-chain.\n\nThe metric tracks the average positive or negative comment about a project. If the reading is positive, it means most market participants have a bullish view. On the other hand, a negative reading suggests a bearish perception.\n\nAt press time, Render’s Weighted Sentiment was -0.45. With this position, demand for RNDR might decrease in the short term. Should this be the case, the price of the token might fall below $9.\n\nBut that does invalidate the long-term optimism around the project. AMBCrypto concluded this after checking the amount of holders.\n\nOn the 25th of March, the total amount of RNDR holders was less than 80,000. However, that figure had increased to 85,600 at press time.\n\nRealistic or not, here’s RNDR’s market cap in ETH terms\n\nAn increase in the number of holders was a sign of traction on the network and adoption of the token. If this continues, RNDR’s price could head to new highs.\n\nHowever, it is important to note that there might be corrections in the process. But as long as the DePIN narrative remains relevant in the market, the token might be destined for a higher value."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOU2Z2ZlFHd2dKV1JfMXhWY05qbFpNS01tY014MHFuRldsakF5VVhiN2FYOXNIRmVfRFN0RFh6cE1SdFJGSUlyQVRUaVZpWjhHTlZ6TWFEWnRnQ0cyZkg4WThxSzZvRlY4Z1AwanJLbUFHTi1sdHRqZE5waVQwanFTZzdCSDZPZG1SR3VLcGh6VTVpcl9aemJGYThXTnVWMUIyZ1FmZHFIeFB5d1pHZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Finding Support Level at $3K as Bitcoin Halving Approaches - FX Leaders",
        "content": "eth-usd\n\nThe cryptocurrency market is eagerly awaiting Bitcoin halving to see what will happen to the values of key cryptocurrencies.\n\nEthereum (ETH) is up today but has lost much of its recent gains. The coin is hanging close to the $3K mark with a price of $3,076 (ETH/USD). For now, the coin is down 15% over the last month. That mirrors Bitcoin’s performance over the last 30 days as well- slightly up today, but significantly down overall.\n\nBoth coins have been struggling lately and may continue to do so unless the halving can inject some momentum into them. Ethereum’s trade volume is dipping, down 9% from the previous day, and many investors seem to be adopting a stance of wait and see what happens after the halving.\n\nHow Ethereum Could Hit $4,000 This year\n\nIf the ETH price is going to make it to $4,000 in 2024 as many industry insiders say, then a few key factors will have to work in its favor. The first of those is Bitcoin’s halving, which could give Bitcoin, Ethereum, and many other crypto coins a significant boost.\n\nNext, ETF approval for Ethereum could help it along as well, making Ethereum seem more stable, at least in one of its forms. ETF approval is still pending in some parts of the world, but a number of countries have approved ETFs already. The latest of those was Hong Kong, which gave the legal nod to ETFs on Monday. Because ETF approval is an ongoing process, we could see major ramifications for Ethereum all throughout the year from this sector.\n\nThere are also a number of cryptocurrency regulations in the pipeline that could be approved or denied, and these are proposed laws from many different countries. If some of those are passed in favor of crypto currency, Ethereum will be able to enjoy some positive press and greater consumer confidence."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNVmRUUU1uS0NudTJIb0hlUlI1QUdJMV84bTd1dVpYLV8tek5COTRkcGFTanpBSllqUHI4MkFoZ2tpWEc3YWVObjlWV0NHeUFMVF9pMHU3MDN1QUZkeFdCRDJybW0zY2lQd011Y1N1VmpnS0lkSWd0Vko5elFVNDJMNDlvaWlDWUxLWk95bdIBkgFBVV95cUxQdjhGdXk0U1RILWVGZGdvcF9nX0dGS1c5akVSRUhJelE5bl9MZzJVN0NDT3hSZldMQlNKRVM3d2x2c3RaQ2NRQzFDSG55NDBpbWdQRkxjNGI2Sk8zOWtEZ1dSWU5ESW54TTBwUnNDTDlYWkY5cU85SEdvZGNkcnQ0dFRCRGRJLXhLcU5JX0pqc3VkZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Breaking: Worldcoin (WLD) To Launch World Chain As L2 on Ethereum - CoinGape",
        "content": "Sam Altman’s Worldcoin is looking to launch its Layer-2 blockchain dubbed World Chain, to improve its efficiency as it continues to onboards new users.\n\nWorld Chain to Improve Worldcoin Efficiency\n\nThe upcoming project was announced by Tools for Humanity, the core developer behind the Worldcoin project. According to the company, World Chain will be secured by the Ethereum network and only “verified” humans will be allowed to “enjoy priority blockspace over bots and some free gas.”\n\nadvertisement\n\nWith this new blockchain, developers can reach millions of real users around the world, with applications that are focused on utility for everyday life. Markedly, the team behind the tool is working to officially release it this summer.\n\nPer a published statement, World Chain is designed to “increase capacity so new people can continue to join at scale, and existing users can enjoy faster, cheaper, and more reliable transactions.”\n\nFor this blockchain to accelerate growth and leverage World ID’s Proof of Personhood, World Chain will have deep integration with the Worldcoin project that is currently under Altman’s watch. Noteworthy, the popular Worldcoin project assigns World IDs to people who must have proven that they are human through an iris scan called Orb verification.\n\nPeople who sign up for this service are given cryptocurrency in the form of WLD tokens. The official website of the project shows that over 5 million people have signed up for Worldcoin. The Worldcoin project was launched to help the internet tell humans apart from non-human actors.\n\nWorldcoin Addresses Global Regulatory Concerns\n\nThe launch of the L2 on Ethereum comes as the company faces global regulatory challenges. Last month, the global digital identity and cryptocurrency initiative had to address its legal standing and compliance. Worldcoin went as far as shedding light on its operational, regulatory, and compliance status in different service regions.\n\nDue to this mounting global pressure, the company announced the implementation of additional privacy features. The new package revolves around Personal Custody and introduces a new Unverify World ID option. Also, the feature leverages cutting-edge technology like zero-knowledge proofs (ZKPs).\n\nThis will give users greater control over their personal information while maintaining the integrity of the network. Noteworthy, this is one strategy that demonstrates Worldcoin’s commitment to ensuring users’ privacy.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUVFwbG81Rkd0c0dIaVRDRFZiVVpySGxFb3JrOHI1Q2FOb1dGRDI0NG5OanBVYVI3cnYyTE9ObUxsV0pVTjNXbFBNRWFpY3Q5U1dDeW9YVVdGM0JnQkg3eUVCNmxnX3ZhU3hwaFFSMjRnSzE1RXFNT1pUMGxRbi1Rdk4xRTFVUExwMGdYZGI5UWJUaUpmQTc4R3owVlhOd3FsNURvSUpNSTRwQdIBrwFBVV95cUxNck5PdHVZazYzbWtIeWh4M0Jpc2NpSV9nNFZhLVBZWUhXREZaM3ltTVMzRFBGNXNlUU95bHBDWUZELU4wYllpMEFQcTQtRE51eU9OdDFBMlpRTVRFbGw0ZTdRTkJVQ0VYTWR6d3JCTnh1REllWVpRd2U1bVJhaS1JQ2IwRDdrS2Z1TWNHVnpCUmVidk9qaFc4Y3RVSEhhZUhzOXhvZWE2Tnh2SnFNX0E4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in Eye of Storm? - Action Forex",
        "content": "Market picture\n\nThe crypto market avoided sharp moves on Tuesday, showing low volatility over the 24 hours and remaining near $2.3 trillion. The Crypto Fear and Greed Index added 2 points to 67 (greed) by Wednesday.\n\nBitcoin’s share of the entire crypto market capitalisation exceeded 54%, maintaining its upward trend since December 2022. This is the clear impact of the Bitcoin-ETF, but we also note the diminishing enthusiasm for altcoins.\n\nThe technical picture for Bitcoin is rather worrying, as we saw no rebound after the price drop on Friday and Saturday. On the contrary, the market seems to be getting used to current prices in anticipation of a halving.\n\nSimilarly, Ethereum sold off powerfully at the end of last week from the 50-day MA. Now, the second largest cryptocurrency holds near the psychologically significant $3000 level.\n\nThe pattern of cryptocurrency behaviour this week indicates that we are more likely to be in the eye of the storm, i.e. a temporary lull between violent gusts of wind. If this prediction is correct, Bitcoin could fall towards $52-55K, and Ethereum – to $2500.\n\nNews background\n\nThe crypto market is “halfway to bitcoin euphoria,” according to CryptoQuant. New bitcoin miners, who have held their assets for less than 155 days, hold up to 9% of the circulating BTC volume and continue to build up inventories in anticipation of rising prices. The imbalance between BTC supply and demand will increase over the next six months, potentially driving prices higher.\n\nHong Kong-listed cryptocurrency ETFs will be “lucky” if they manage to raise $500 million in aggregate, Bloomberg said. The agency called Matrixport’s projected $25bn “insane”.\n\nAccording to CoinGecko, there are more than 2.52 million crypto assets in existence today, which is 5.7 times the number at the end of 2021. The pace of new coins accelerated in 2024 when 0.54 million tokens have already been created, which means an average of 5,300 pieces launched per day.\n\nBlockchain team The Open Network (TON) has announced the launch of the Memelandia hub for meme coin developers. The project is part of The Open League’s programme, which was created to support new meme coins and raise awareness of them."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxONkNfVkVhQTQ3TEtYVUpOT1VDNy1Pdy1QVjExWU1NRm1ZbUlPdTVtTFBKeXRGOFlTem01Zm85VktkOUxTY2dUT2NNSWVZaENCUDZ5ckN4S3l0dXNyVUJhLXE5MVJYQ1lQTW1WU19NWWNGcTNkY0dCZ2JtME9MUkR4NGdpN2VhWVlNcXNPcDdjMlFZUmtyUzBnbmNUTDZpMDBJeTQwazExTTVBZlVpQjFqb2kwZklhNlpB0gHGAUFVX3lxTE5GcWZaQVJSYmhNUVVtZGxRQVptMkJQSUw3bTk2T0VUSlBOUmg0RTF1Z2d3ZkFoNGJqVDhuY2R1bzJucnpVLWF4MUNEX0I3WkdGRmZmcjVoc005MlY4ZWNjRnBUX0RNakljY3BlSVJ0ZXZ1OGIyUDFxMkNYdXJ0RFRnN0dmUmwwQkN0UDRRR3FkTzdXLWlwWlRwaXBQejBscFc3RktzT3kydXhIeWh6TW04ZkRaVzdFT1o1LUJyVWhMbU1sb3pCQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Solana Plunge As CORE Pumps 35% - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxPUHJuU0I2ZnQ1UGI1ZlNJUHYwOGVEMnRXQnItaVNob3N1OXB5M0M5Ymkzc0hKVDEwd2wweHBzdms5TkNpSXBRU2RSc1VwVmN5dEVhZTUya2c4cmc5V3BHcURlWUlLclhfTkR0Um4wVDhVQ3FxeUtUWlcweC1lcE5HLWk4NFM2TzlYdThxQlFfTGd0N1NjU0VsbEN3UFZ3M2NaeElzd1JrT3JNNVktVjFzNC1GRFhxVTFzYmZydHBFLW1vUC01b3psTmRLT0pZWTNma0RzRFZmQzJ0R2FUcDBtQld1TGZ5dlZnbXllQ1FWV3dLYXZpVEU1QzM4S3FzQdIBiwJBVV95cUxQOWp4cXU4bWxZNjY2YW9TN09VdTBOWUFqVDRQR3VvMGN3c0doUFhrREhtX05xUFNnVElnVlpzYzhia293Z0hFTkE5amRTVVhqemlTUGtEMlBlTVBuS2FQbkNZSjRDVUxQOThVUUhGc0JrY1JCaU9pMnA0OWJuc2huMVlSYWxlSm5YYURZWGFlRVpoUm9WaHZRd1VOZGpxa2FJZVJrSTQtU1F0Znd6ckhLTDFyelQ5WkRCNTVZMjR5V3ZJX0tTV3liMVM4TFFNQUZJUWsyaW0zQ1VaN3VqQVRQWUQ3dXB6WWprU2QybGFOc2o3LWo5OEdZSXdYNi11eUdGQWNjWDhoMUl4VEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Holds Above $63K, Ethereum Drops Toward $3K, Other Altcoins Show Mixed Signals Before Halving Event - Analytics Insight",
        "content": "The SEC just declared war on crypto.\n\nUniswap is the LARGEST decentralized exchange (DEX) in existence.\n\nHas over $2 trillion in total volume since its launch in 2018.\n\nRanked #1 in most metrics including over $6.1B in TVL.\n\nToday Uniswap Labs received a Wells Notice from the… pic.twitter.com/D5G7EWUFD7\n\n— Altcoin Daily (@AltcoinDailyio) April 10, 2024"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNTmxfemhKd1UtR0luZkxIRm14OWs4Z0R6eTlhQ1AyZXRoTS1KQWVWRGR2eWt1d3N6andVUUFJRklBazZMV2Jpdy10dkNsUW9pZTloVVlPNDdRTXRNRzc2eVM4Z21MVXZOd3hQVUs2VGFBU3pBMFZTQ2hwMThmWTllT2o0R09JbGM4R0ZMTTlYdW1qcld4MEktS0FkVS1CWF9jOE9RUlVWbnZ1eWpPei1tSk9CS3JZT3kxQ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "ETHEREUM PRICE ANALYSIS & PREDICTION (April 17) – ETH Continues Selling, Negotiating $3k For Next Big Move - NullTX",
        "content": "Ethereum resumed selling pressure this week after experiencing a little retracement last. While on the verge of breaking down a key price level, it has posted roughly 7% loss in the past week.\n\nRejecting $4,100 and $3,700 in the past weeks, Ethereum has found it difficult to push above the $3,300 level in the recent bounce as it lost momentum again due to the latest decline.\n\nTaking that bounce as a retracement of last week’s drop, the price is now on the verge of dropping off the important $3,000 level. A successful bridge from there could drive the price back to $2,852 – the current holding support.\n\nTechnically, that holding support recently acted as a sub-level to the crucial $2700 level that flipped as resistance during February’s surge. Once the crucial level is retested (probably as this week’s low) in this leg down, we can expect a quick price recovery in no time.\n\nHowever, it is important to note that ETH may extend bearishness below this key retest level if the weekly supply continues to outweigh demand. The $2,500 – $2,400 zone would be an oversold area to watch for a major buyback.\n\nAs of now, there are no signs of the bulls. A reversal pattern above the mentioned holding support could bring them back into the market. But as it stands, the bears are taking charge.\n\nETH’s Key Level To Watch\n\nWhile the bulls are in disbelief of the recent price movement, they may suffer more losses if the price slides through the vital $3,000 support level. Breaking the $2,850 support will activate more drops.\n\nThe $3,202 level now stands as immediate resistance. If the price recovers above $3,300, the resistance levels to watch above it are $3,450 and $3,723.\n\nKey Resistance Levels: $3,202, $3,450, $3,723\n\nKey Support Levels: $3,000, $2,852, $2,712\n\nSpot Price: $3,042\n\nTrend: Bearish\n\nVolatility: High\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services.\n\nFollow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !\n\nImage Source: fellowneko/ 123RF // Image Effects by Colorcinch"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOV2FjVlo2aG5KekJQdHd3eXhqT0tDSW9kc2kzVDR3eEpkVGFVZkswSWRONW5oVkFDWEhmdFg5RkFsTzdmMWJlYUVKSEpwTFRCZXJkZTVWUzBxOGJHVTROTzZjVjdUUkJJam02V0FtQkZISTFxZW5TU01YTWNHeTBLTUpvX3RNT2NVNEttTm9TUGdFUXdGclFJSVlKNF84TjlQZDZNRWp1UmNkRVVQMjB6dTBSTXBoLU1meU8ybTNGQlFZYUlaOGg4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here's Why - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nEthereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here’s Why\n\ncrypto analyst Lark Davis forecasted Ethereum price soaring to an astounding $15,000 this crypto cycle.\n\nHis prediction is backed by compelling catalysts that could propel the leading smart contract platform to new heights.\n\nCoinbase Base Chain Onboarding Surge\n\nThe first reason Davis highlights is that Coinbase’s Base Chain as a pivotal catalyst driving Ethereum’s price surge. With Coinbase’s imminent launch of Base Chain and its smart wallet, the platform is set to onboard its vast user base of 120 million customers, creating an unprecedented surge in Ethereum demand.\n\nAs users flock to Base Chain, Ethereum stands to benefit immensely, with every transaction requiring ETH as fuel, potentially leading to substantial price appreciation.\n\nLayer Two Narrative and Ethereum’s Dominance\n\nBeyond the Coinbase hype, Ethereum’s position as a leader in layer two scaling solutions further strengthens its bullish case. Davis emphasizes Ethereum’s integral role in the broader layer two narrative, with projects like Arbitrum and ZK Sync gaining traction.\n\nAs users embrace layer two solutions for scalability and cost-effectiveness, Ethereum’s dominance in the smart contract space solidifies, driving investor confidence and adoption.\n\nEthereum Staking and Wealth Creation\n\nAnother key catalyst highlighted by Davis is Ethereum’s staking ecosystem, which promises substantial returns and wealth creation opportunities. With the launch of the Ethereum 2.0 beacon chain and the upcoming integration of staking protocols like Igen, Ethereum holders are incentivized to lock up their ETH, further reducing circulating supply and driving up prices.\n\nAdditionally, Ethereum’s thriving DeFi ecosystem and burgeoning NFT market contribute to the platform’s overall economic activity, reinforcing its status as a blue-chip asset in the crypto space.\n\nAlso Check Out : Crypto Expert Lark Davis Reveals 9 Altcoins Set for 9x Growth in 2024\n\nThe ETF Potential\n\nDavis underscores the significance of an Ethereum ETF approval, despite the expected denial of BlackRock’s application in May. While initial rejections may dampen short-term sentiment, Davis remains bullish on the eventual approval of an Ethereum ETF, citing BlackRock’s track record and legal precedents.\n\nOnce approved, an Ethereum ETF could unleash a flood of institutional capital into the market, driving prices to unprecedented levels.\n\nIn Conclusion\n\nWith a confluence of bullish catalysts on the horizon, Ethereum’s journey to $15,000 appears increasingly plausible. Davis’s forecast sheds light on the fundamental drivers behind Ethereum’s potential surge, offering investors valuable insights into the platform’s long-term growth prospects."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPaGNDTVN0a0w1dHNjR3R6cXBaZ1FDMVJaRGlCMlRGdVpsMVdEN1otYktoSlNNY3lmQXlOSHE1LUNwX3dHQm1SUUhvS0FKRG8zbDVyRGFIQ29YQkxwc19ReGRmZXhaNlowLVdhMDU1MnBhQnFwcEdZZTBVV0Nlb3IzaGREc1BPaU5xa01vWkMwMC1yTVFEcnNJMDY0TG1ZMlNxd1J6N9IBqgFBVV95cUxOZXktem1IZTkyWEYtQjQzLWJYQ3ZYbTVFZ3ROVkY1MnRISGRLRWZtTUk1T3dDdzE0UlIwdGctTGkybzJicWZxblNueVA0YnJrOW9iODdnTzRLOWN2RzdLOHE0UkJrYm0tSnFtSzJ2NFZNUGc1akoxajM3TEpGYUtuQmdKb2wzdFI0ZzBaYUJqMTdZY2p0ek1SVzVzRW8tTXFhVjltZXNWaWJkQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum To Plunge To $2,500 This Month? What’s Next For ETH And ENA? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nEthereum To Plunge To $2,500 This Month? What’s Next For ETH And ENA?\n\nWith only 395 Blocks remaining for the next Bitcoin Halving, the cryptocurrency industry continues to display a significant correction in valuation. Top tokens continue to hover close to their important levels, indicating increasing selling pressure in the crypto space.\n\nThe Ethereum blockchain continues to bleed with the leader of altcoins, ETH price, losing over 15% in its portfolio during this time. Moreover, the blockchain’s latest token, the Ethena (ENA) price has displayed a similar trend by following in the footsteps of its leader.\n\nEthereum (ETH):\n\nAfter displaying a correction of 12.65% and witnessing a bearish price sentiment for over a week, the ETH coin price has recorded an uptrend of approximately 3% within the past day, indicating a decline in the selling pressure within the cryptocurrency space.\n\nTradingView: ETH/USDT\n\nThe Ethereum token has recently formed a symmetric triangle pattern and is trading within it. Moreover, the ETH coin is hovering close to its resistance level of $3,149 and its support trend line of the triangle, highlighting uncertainty in the future price action for the altcoin leader.\n\nThe EMA 50-day shows a bearish convergence in the 1D time frame. On the other hand, the technical indicator, MACD, shows a constant red histogram with its averages showing a constant decline in the chart.\n\nIf the bulls regain momentum, the price will break out of its resistance trend line and attempt to test its upper level of $3,697. Conversely, a bearish sentiment could result in the price falling to test its low of $2,800 in the coming time.\n\nRead More : Ethereum Price Could Drop to $2.5K Soon! Is This a Good Buying Opportunity?\n\nEthena (ENA):\n\nThe Ethena token gained significant attention from the market following its launch, resulting in the ENA price recording a high of $1.523. Following this, the bulls lost momentum and recorded a correction of approximately 25% in valuation. Since then, the price has been displaying a neutral trend in the chart.\n\nTradingView: ENA/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a rising green histogram, indicating an increase in the buying pressure within the crypto industry. Furthermore, the averages show a bullish convergence, suggesting a positive price action for the altcoin in the coming time.\n\nIf the market breaks out of its resistance level at $1.070, the bulls will regain momentum and prepare to test its upper resistance level of $1.280. However, if the bulls fail to gain momentum, the ENA price will plunge toward its low of $0.875 this month.\n\nAlso Check Out : Ethereum Hovers Around $3,000 Following $300 Million Selloff! Will Bulls Lose Their Defense?"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9TTFdSTkg1cnh2NGdWYkR4M2hLR29GREZjeTJKWEF5OXU0cGpNaG5lUTlVRWdDdDJGZFIwczB3OUZJTU5mWEF4TnpJOWhhUEt4bXctcExHZkx6MEJib3U2aEhnZS1XVFM1ajdkMzFiQ2xhSmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in Trouble: What’s Going On? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nBitcoin and Ethereum in Trouble: What’s Going On?\n\nStory Highlights Major cryptocurrencies like Bitcoin and Ethereum are down significantly, likely due to recent geopolitical tensions.\n\nDespite typical pre-halving surges, the market is tumbling instead, causing investor panic and selloffs.\n\nWhile investors flee, traders are jumping in, but this doesn't indicate overall bullish sentiment.\n\nThe crypto world is once again engulfed in a downward spiral, with major players like Bitcoin and Ethereum showing significant losses. As of now, Bitcoin has dropped by nearly 5% in the past day, while Ethereum’s decrease exceeds 5%. Even BNB and Solana haven’t escaped unscathed, experiencing declines of 7% and 10% respectively.\n\nThe Pre-Halving Frenzy\n\nWith investors scratching their heads over the market’s turmoil, it’s essential to delve into the factors driving this dramatic downturn.\n\nThe much-anticipated Bitcoin halving is just around the corner, set to happen in about four days. Historically, halving events have been met with excitement, leading to significant price surges before, during, and after. At the start of 2024, Bitcoin broke not one but two all-time highs, sparking optimistic predictions from industry experts and outsiders alike. FOMO was rampant, driving market activity into a frenzy. It seemed like smooth sailing for cryptocurrencies.\n\nBut It Was a Bust!\n\nThe party didn’t last long. Corrections, a typical occurrence before halving events, soon kicked in. Experts reassured investors, but over the weekend, the market witnessed a plunge reminiscent of the early-year volatility.\n\nGlobal Turmoil Meets Crypto Chaos\n\nThe brewing geopolitical tensions between Iran and Israel spilled over into the crypto world, as cryptocurrencies became the go-to assets during the crisis. Investors panicked and swiftly sold off their holdings, triggering a market-wide downturn.\n\nThis sparked a flurry of sell-offs, with hundreds of millions of dollars being dumped in just two days. Interestingly, this chaos led to a surge in trading activity on major exchanges like Coinbase, Binance, and Bybit.\n\nAn Opportunity for Investors?\n\nWhile investors fled, savvy traders seized the moment. It’s a common trend; when markets go haywire, opportunities for traders abound. However, it’s important to note that this doesn’t necessarily signal bullish sentiment. Recent data from Coinglass highlights a significant increase in Bitcoin derivatives trading, with volumes soaring by over 10% in a single day, reaching a staggering $99 billion. The prevailing long/short ratio suggests a predominantly bearish sentiment among traders.\n\nDespite the turbulence, experts remain optimistic, maintaining their predictions of Bitcoin soaring to $100k, Ethereum reaching $10k, and BNB hitting $5k."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPdzBkcVdXRS1hLUdheHlWVFhnNHFPYm1UUmxQb3J5UV9EQldzWlJnb3gxbHo1QW14bzZXSGlmV0RLSUc4eU1NVDk4MDZVZVlmMVY4VWRhME1yQUVnZHVwTVd3c0FtWXBzeExlaVhMbm9OWXRPQkFfY2JoVDZSNl9kckNQWTkxRzVLZkVRem85NVhYZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Meet World Chain, Worldcoin’s (WLD) New Layer-2 Ethereum Blockchain - Coinfomania",
        "content": "Worldcoin, a pioneering biometric digital identity project utilizing iris scanning, has announced a strategic partnership with Alchemy, a prominent Web3 development platform.\n\nThis collaboration aims to fortify the infrastructure of the World Chain ecosystem, facilitating a more robust framework for developers. The announcement was made on June 26, marking a significant development in the integration of biometric technology within blockchain applications.\n\nThe partnership provides World Chain developers immediate access to Alchemy’s extensive suite of Web3 development tools.\n\nThis suite includes core and data APIs, indexing solutions, and a sophisticated account abstraction infrastructure, which enhances the safety and security of self-custodial wallets.\n\nAlchemy’s integration will also extend to incorporating World ID, Worldcoin’s digital ID technology, offering millions of developers worldwide an opportunity to engage with this cutting-edge technology.\n\nWorld Chain was initially introduced in April 2024 as a part of a larger initiative by Tools for Humanity, spearheaded by OpenAI CEO Sam Altman.\n\nSource: Worldcoin\n\nAlex Blania, who is centrally involved in the development and promotion of the Worldcoin project, plays a crucial role in the ongoing development of this blockchain network.\n\nDesigned explicitly with human-centric principles, World Chain intends to operate alongside other major blockchain ecosystems such as Optimism, Coinbase, and the broader Ethereum network, collectively known as the Superchain.\n\nThis blockchain is particularly tailored to prioritize human interactions over automated processes. By leveraging verified World IDs, World Chain offers holders priority block space and a free gas allowance for regular transactions, thereby reducing the prevalence of bots.\n\nThis design not only secures the network against automated interferences but also ensures that developers have clearer access to real users, enhancing the overall user experience and reliability of blockchain applications.\n\nStrategic Partnership Bolsters World Chain’s Ambitions\n\nSteven Smith, the head of protocol at Tools for Humanity, emphasized the importance of this partnership with Alchemy.\n\nHe noted that Alchemy has demonstrated proven expertise in ensuring guaranteed uptime and reliability for major enterprises, a crucial element as World Chain aims to establish itself as the first human-centered blockchain and the largest entry point for human participation in the blockchain space.\n\nJust in: Worldcoin is partnering with @AlchemyPlatform to bring World Chain to life ⚪️ pic.twitter.com/ECKikbkXby — Worldcoin (@worldcoin) June 26, 2024\n\nThe partnership is expected to make significant strides toward achieving Tools for Humanity’s goal of bringing a billion users into the blockchain ecosystem.\n\nIt aims to increase opportunities for developers to create applications that are not only effective but also intuitively align with human needs and experiences in digital spaces.\n\nWorldcoin Expands Operations Globally\n\nIn addition to its technological strides, Worldcoin is expanding its operational footprint globally. As part of its expansion efforts, Worldcoin has initiated its European operations by launching World ID orb verifications in six locations across two European cities.\n\nThis move marks the project’s initial steps into Europe following successful implementations in various Latin American countries and represents a critical phase in Worldcoin’s strategy to broaden its global influence.\n\nDespite these positive strides, Worldcoin has experienced a minor setback in market dynamics. Over the past 24 hours, there has been a slight decline in open interest by 0.85%, bringing its current valuation to $107.9 million.\n\nSource: Worldcoin\n\nFurthermore, the price of Worldcoin’s token (WLD) has seen a decrease of 1.22% during the same period, with its price currently standing at $2.83 and a trading volume of $193.8 million.\n\nThis partnership between Worldcoin and Alchemy represents a transformative step in making blockchain technology more accessible and tailored to human needs, potentially leading to widespread adoption and innovation in the blockchain sector.\n\nAs World Chain continues to develop, it holds the promise of becoming a pivotal platform in the evolution of blockchain technology, focused on enhancing user engagement and security."
    }
]