[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4cUQ4bDB3ZHhsXzF1cWlGRExiWlZrMDctMTBZZ2gtcTNFcUFpQUZsbzU3Y1U0cWtpQ2R2Mmp3R0hxUUk2WDRkQll3cmZkcUJoVUhoRlVlczVndkZvUXZpYTBjRXRFdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency Explained With Pros and Cons for Investment - Investopedia",
        "content": "What Is Cryptocurrency?\n\nA cryptocurrency is a digital or virtual currency secured by cryptography, which makes it nearly impossible to counterfeit or double-spend. Most cryptocurrencies exist on decentralized networks using blockchain technology—a distributed ledger enforced by a disparate network of computers.\n\nA defining feature of cryptocurrencies is that they are generally not issued by any central authority, rendering them theoretically immune to government interference or manipulation.\n\nKey Takeaways A cryptocurrency is a form of digital asset based on a network that is distributed across a large number of computers. This decentralized structure allows them to exist outside the control of governments and central authorities.\n\nSome experts believe blockchain and related technologies will disrupt many industries, including finance and law.\n\nThe advantages of cryptocurrencies include cheaper and faster money transfers and decentralized systems that do not collapse at a single point of failure.\n\nThe disadvantages of cryptocurrencies include their price volatility, high energy consumption for mining activities, and use in criminal activities.\n\nInvestopedia / Tara Anand\n\nUnderstanding Cryptocurrency\n\nCryptocurrencies are digital or virtual currencies underpinned by cryptographic systems. They enable secure online payments without the use of third-party intermediaries. \"Crypto\" refers to the various encryption algorithms and cryptographic techniques that safeguard these entries, such as elliptical curve encryption, public-private key pairs, and hashing functions.\n\nCentral to the appeal and functionality of Bitcoin and other cryptocurrencies is blockchain technology. As its name indicates, a blockchain is essentially a set of connected blocks of information on an online ledger. Each block contains a set of transactions that have been independently verified by each validator on a network.\n\nEvery new block generated must be verified before being confirmed, making it almost impossible to forge transaction histories. The contents of the online ledger must be agreed upon by a network of individual nodes, or computers that maintain the ledger.\n\nExperts say that blockchain technology can serve multiple industries, supply chains, and processes such as online voting and crowdfunding. Financial institutions such as JPMorgan Chase & Co. (JPM) are using blockchain technology to lower transaction costs by streamlining payment processing.\n\nTypes of Cryptocurrency\n\nMany cryptocurrencies were created to facilitate work done on the blockchain they are built on. For example, Ethereum's ether was designed to be used as payment for validating transactions and opening blocks. When the blockchain transitioned to proof-of-stake in September 2022, ether (ETH) inherited an additional duty as the blockchain's staking mechanism. The XRP Ledger Foundation's XRP is designed for financial institutions to facilitate transfers between different geographies.\n\nBecause there are so many cryptocurrencies on the market, it's important to understand the types. Knowing whether the coin you're looking at has a purpose can help you decide whether it is worth investing in—a cryptocurrency with a purpose is likely to be less risky than one that doesn't have a use.\n\nMost of the time, when you hear about cryptocurrency types, you hear the coin's name. However, coin names differ from coin types. Here are some of the types you'll find with some of the names of tokens in that category:\n\nUtility : XRP and ETH are two examples of utility tokens. They serve specific functions on their respective blockchains.\n\n: XRP and ETH are two examples of utility tokens. They serve specific functions on their respective blockchains. Transactional : Tokens designed to be used as a payment method. Bitcoin is the most well-known of these.\n\n: Tokens designed to be used as a payment method. Bitcoin is the most well-known of these. Governance : These tokens represent voting or other rights on a blockchain, such as Uniswap.\n\n: These tokens represent voting or other rights on a blockchain, such as Uniswap. Platform : These tokens support applications built to use a blockchain, such as Solana.\n\n: These tokens support applications built to use a blockchain, such as Solana. Security tokens: Tokens representing ownership of an asset, such as a stock that has been tokenized (value transferred to the blockchain). MS Token is an example of a securitized token. If you can find one of these for sale, you can gain partial ownership of the Millennium Sapphire.\n\nIf you find a cryptocurrency that doesn't fall into one of these categories, you've found a new category or something that needs to be investigated to be sure it's legitimate.\n\nHow to Buy Cryptocurrency\n\nIf you want to use cryptocurrency to buy products and services, you will need to visit a cryptocurrency exchange. These are businesses that allow you to buy or sell cryptocurrencies from other users at the current market price, similar to a stock. After buying the coins, you will need to transfer them to a digital wallet or use a third-party service like Coinbase to store your coins.\n\nIf you only want to buy cryptocurrency as an investment, you may be able to do so through your brokerage. For example, Robinhood allows users to invest in bitcoin and other cryptocurrencies, although you cannot withdraw them from the platform for purchases. In addition, there are several crypto ETFs that provide exposure to the crypto asset class without requiring the investors to maintain their own wallets. For instance, as of May 2024, investors may choose to hold Bitcoin futures ETF shares. The SEC has also approved the listing and trading of Ether spot shares.\n\n\n\nIs Cryptocurrency Legal?\n\nFiat currencies derive their authority from the government or monetary authorities. For example, the U.S. dollar is recognized and issued by the government as the official currency of the United States and is \"legal tender.\"\n\nBut cryptocurrencies are not issued by any public or private entities. Therefore, it has been difficult to make a case for their legal status in different financial jurisdictions throughout the world. It doesn't help matters that cryptocurrencies have primarily functioned outside most existing financial infrastructure.\n\nIn the U.S.\n\nThe legal status of cryptocurrencies creates implications for their use in daily transactions and trading. In June 2019, the Financial Action Task Force (FATF) recommended that wire transfers of cryptocurrencies should be subject to the requirements of its Travel Rule, which requires AML compliance.\n\nAlthough cryptocurrencies are considered a form of money, the Internal Revenue Service (IRS) treats them as financial assets or property for tax purposes. And, as with most other investments, if you reap capital gains selling or trading cryptocurrencies, the government wants a piece of the profits. How exactly the IRS taxes digital assets—either as capital gains or ordinary income—depends on how long the taxpayer held the cryptocurrency and how they used it.\n\nIn the United States in July 2023, courts ruled that cryptocurrencies are considered securities when purchased by institutional buyers but not by retail investors purchased on exchanges.\n\nEnthusiasts called it a victory for crypto; however, crypto exchanges are regulated by the SEC, as are coin offerings or sales to institutional investors. So, crypto is legal in the U.S., but regulatory agencies are slowly gaining ground in the industry.\n\nAs of June 2024, El Salvador is the only country to accept Bitcoin as legal tender for monetary transactions. In the rest of the world, cryptocurrency regulation varies by jurisdiction.\n\nIn Asia\n\nJapan's Payment Services Act defines Bitcoin as legal property. Cryptocurrency exchanges operating in the country are required to collect information about the customer and details relating to the wire transfer.\n\nChina has banned cryptocurrency exchanges, transactions, and mining within its borders, but has a Central Bank Digital Currency (CBDC).\n\nIndia was reported to be formulating a framework for cryptocurrencies, but until it is enacted, crypto is not yet illegal. Exchanges are free to offer cryptocurrencies.\n\nIn Europe\n\nCryptocurrencies are legal in the European Union. Derivatives and other products that use cryptocurrencies must qualify as \"financial instruments.\" In June 2023, the European Commission's Markets in Crypto-Assets (MiCA) regulation went into effect. This law sets safeguards and establishes rules for companies or vendors providing financial services using cryptocurrencies.\n\nIs Cryptocurrency a Safe Investment?\n\nCryptocurrencies have attracted a reputation as unstable investments due to high investor losses from scams, hacks, bugs, and volatility. Although the underlying cryptography and blockchain are generally secure, the technical complexity of using and storing crypto assets can be a significant hazard to new users.\n\nIn addition to the market risks associated with speculative assets, cryptocurrency investors should be aware of the following risks:\n\nUser risk : Unlike traditional finance, there is no way to reverse or cancel a cryptocurrency transaction after it has already been sent. By some estimates, about one-fifth of all bitcoins are now inaccessible due to lost passwords or incorrect sending addresses.\n\n: Unlike traditional finance, there is no way to reverse or cancel a cryptocurrency transaction after it has already been sent. By some estimates, about one-fifth of all bitcoins are now inaccessible due to lost passwords or incorrect sending addresses. Regulatory risks : The regulatory status of some cryptocurrencies is still unclear in many areas, with some governments seeking to regulate them as securities, currencies, or both. A sudden regulatory crackdown could make it challenging to sell cryptocurrencies or cause a market-wide price drop.\n\n: The regulatory status of some cryptocurrencies is still unclear in many areas, with some governments seeking to regulate them as securities, currencies, or both. A sudden regulatory crackdown could make it challenging to sell cryptocurrencies or cause a market-wide price drop. Counterparty risks : Many investors and merchants rely on exchanges or other custodians to store their cryptocurrency. Theft or loss by one of these third parties could result in losing one's entire investment.\n\n: Many investors and merchants rely on exchanges or other custodians to store their cryptocurrency. Theft or loss by one of these third parties could result in losing one's entire investment. Management risks : Due to the lack of coherent regulations, there are few protections against deceptive or unethical management practices. Many investors have lost large sums to management teams that failed to deliver a product.\n\n: Due to the lack of coherent regulations, there are few protections against deceptive or unethical management practices. Many investors have lost large sums to management teams that failed to deliver a product. Programming risks : Many investment and lending platforms use automated smart contracts to control the movement of user deposits. An investor using one of these platforms assumes the risk that a bug or exploit in these programs could cause them to lose their investment.\n\n: Many investment and lending platforms use automated smart contracts to control the movement of user deposits. An investor using one of these platforms assumes the risk that a bug or exploit in these programs could cause them to lose their investment. Market Manipulation: Market manipulation remains a substantial problem in cryptocurrency, with influential people, organizations, and exchanges acting unethically.\n\nDespite these risks, cryptocurrencies have seen a significant price leap, with the total market capitalization rising to about $2.4 trillion. Despite the asset's speculative nature, some have created substantial fortunes by taking on the risk of investing in early-stage cryptocurrencies.\n\nAdvantages and Disadvantages of Cryptocurrency\n\nCryptocurrencies were introduced with the intent to revolutionize financial infrastructure. As with every revolution, however, there are tradeoffs involved. At the current stage of development for cryptocurrencies, there are many differences between the theoretical ideal of a decentralized system with cryptocurrencies and its practical implementation.\n\nAdvantages Removes single points of failure\n\nEasier to transfer funds between parties\n\nRemoves third parties\n\nCan be used to generate returns\n\nRemittances are streamlined Disadvantages Transactions are pseudonymous\n\nPseudonymity allows for criminal uses\n\nHave become highly centralized\n\nExpensive to participate in a network and earn\n\nOff-chain security issues\n\nPrices are very volatile\n\n\n\nAdvantages Explained\n\nCryptocurrencies represent a new, decentralized paradigm for money. In this system, centralized intermediaries, such as banks and monetary institutions, are not necessary to enforce trust and police transactions between two parties. Thus, a system with cryptocurrencies eliminates the possibility of a single point of failure—such as a large financial institution setting off a cascade of global crises, such as the one triggered in 2008 by the failure of large investment banks in the U.S.\n\nCryptocurrencies promise to make transferring funds directly between two parties easier without needing a trusted third party like a bank or a credit card company. Such decentralized transfers are secured by the use of public keys and private keys and different forms of incentive systems, such as proof of work or proof of stake.\n\nBecause they do not use third-party intermediaries, cryptocurrency transfers between two transacting parties can be faster than standard money transfers. Flash loans in decentralized finance are an excellent example of such decentralized transfers. These loans, which are processed without requiring collateral, can be executed within seconds and are mostly used in trading.\n\nThe remittance economy is testing one of cryptocurrency's most prominent use cases. Cryptocurrencies such as Bitcoin serve as intermediate currencies to streamline money transfers across borders. Thus, a fiat currency is converted to Bitcoin (or another cryptocurrency), transferred across borders, and subsequently converted to the destination fiat currency without third-party involvement.\n\nDisadvantages Explained\n\nThough they claim to be an anonymous form of transaction, cryptocurrencies are pseudonymous. They leave a digital trail that agencies like the Federal Bureau of Investigation (FBI) can follow. This opens up the possibility for governments, authorities, and others to track financial transactions.\n\nCryptocurrencies have become a popular tool with criminals for nefarious activities such as money laundering and illicit purchases. The case of Dread Pirate Roberts, who ran a marketplace to sell drugs on the dark web, is already well known. Cryptocurrencies have also become a favorite of hackers who use them for ransomware activities.\n\nIn theory, cryptocurrencies are meant to be decentralized, their wealth distributed between many parties on a blockchain. Ownership is becoming more concentrated, as witnessed by companies purchasing and holding them for price appreciation and investment fund managers buying them to hold in their funds.\n\nOne of the conceits of cryptocurrencies is that anyone can mine them using a computer with an Internet connection. However, mining popular cryptocurrencies requires considerable energy, sometimes as much energy as entire countries consume. The expensive energy costs and the unpredictability of mining have concentrated mining among large firms whose revenues run into billions of dollars.\n\nOnly 61 (1%) of the 4,568 Bitcoin blocks opened from May 15, 2024, to June 15, 2024, were opened by unknown addresses. The other 99% were opened by mining pools.\n\nThough cryptocurrency blockchains are highly secure, off-chain crypto-related key storage repositories, such as exchanges and wallets, can be hacked. Many cryptocurrency exchanges and wallets have been hacked over the years, sometimes resulting in the theft of millions of dollars in coins.\n\nCryptocurrencies traded in public markets suffer from price volatility, so investments require accurate price monitoring. For example, Bitcoin has experienced rapid surges and crashes in its value, climbing to nearly $65,000 in November 2021 before dropping to just over $20,000 a year and a half later. Bitcoin prices had roared back by mid-2024. As a result of this vast range of volatility, many people consider cryptocurrencies a speculative bubble.\n\nIs Crypto Actually a Good Investment? Crypto can be a good investment for someone who enjoys speculating and can financially tolerate losing everything invested. However, it is not a wise investment for someone seeking to grow their retirement portfolio or for placing savings into it for growth.\n\nIs Crypto Real Money? One definition of money is something that is generally accepted as a medium of exchange, a measure or store of value, and a unit of account. By this definition, cryptocurrency is real money.\n\nHow Does Crypto Make You Money? There are several ways cryptocurrency can make money for you. Decentralized finance applications let you loan your crypto with interest; you can stake a compatible one on a blockchain or at certain exchanges for rewards, or you can hold on to it and hope its market value increases. None of these methods are guaranteed to make money, but many people have benefitted from them.\n\nThe Bottom Line\n\nCryptocurrencies are digital assets that are secured by cryptography. As a relatively new technology, they are highly speculative, and it is important to understand the risks involved before investing.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBDSUVhS29FMnhESkZvTUNzOVFIbXY5bFFweEowbWxPM2Z6TjAwYTJXcHBxYnpnanF3ZVBWVk9vaWZvRUFkRjc0bUN6TkpEQjA1TFV1ZWE3QlpRWjhqbkJFQ1BR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum spot ETFs to start trading July 2nd: Bloomberg analyst - Crypto Briefing",
        "content": "SEC's nod to Ethereum ETFs could trigger a 60% ETH price rally.\n\nShare this article\n\nThe highly anticipated launch of spot Ethereum ETFs is expected to occur on July 2nd, according to Bloomberg ETF analyst Eric Balchunas.\n\nBalchunas revealed that the SEC has sent light comments on S-1 filings to ETF issuers, requesting their response within a week. This development suggests a strong possibility that the SEC will declare the ETFs effective the following week, allowing them to begin trading before the holiday weekend.\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nThe SEC has approved 19b-4 forms for eight Ethereum ETF issuers, including BlackRock, Fidelity, VanEck and others. However, the SEC must approve the S1 forms before the ETFs can officially begin trading.\n\nSEC Chair Gary Gensler recently hinted at the potential approval of the S1 for an Ethereum ETF during the summer, as stated in his testimony at a Senate Appropriations Committee hearing earlier this week.\n\nAsset manager VanEck has projected Ethereum (ETH) to reach $22,000 by 2030, based on its anticipated generation of $66 billion in “free cashflows.”\n\nThe launch of spot Ethereum ETFs is anticipated to attract substantial institutional capital, with Standard Chartered’s Geoff Kendrick estimating inflows of $15 to $45 billion within the first year.\n\nSingapore-based crypto trading firm QCP Capital predicts that the approval of spot Ethereum ETFs could lead to a 60% rally in ETH prices, similar to the market reaction seen after spot Bitcoin ETFs were approved in January."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1lUndHN3dfWTJlcmtQTXFNaXNLN3AyZ3FnV1JFNnBNOFZoWEM4QlBhXzRBV1JVc0t6b3FjczF3TzZtWFFjYmcyUHpMNFpOdGd1b1Z4amdYV29vOGtuQ3c4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "The Ethereum ETF is Coming - Bitcoin Market Journal",
        "content": "In my ten years of investing in crypto, we have one of the most interesting opportunities I’ve seen: this is a unique moment in history for buying and holding Ethereum (ETH).\n\nThe reason is that Ethereum ETFs have been approved, but are not yet available to the public.\n\nThis week, SEC Chair Gary Gensler acknowledged in a formal Senate hearing that Ethereum ETFs have been approved, and are just waiting for the final paperwork, meaning they should be available sometime this summer.\n\nThis is like a hotly-anticipated IPO, where excitement is building because everybody knows it’s coming. But here’s the difference: any of us can easily buy and sell Ethereum, right now, before ETH ETFs are open to the masses.\n\nThis is 100% legal and ethical: it’s another one of those unusual investment opportunities that you’ll only find in crypto.\n\nToday I’ll unpack this opportunity and show you how to take advantage of it (TLDR: the strategy is to buy and hold ETH now).\n\nThe Recent History of Bitcoin ETFs\n\n“History doesn’t repeat itself, but it often rhymes.” – Mark Twain\n\nIf you had invested in bitcoin at the beginning of this year – in January! – you would have already increased your investment by 50%. Your wealth would have grown fifty percent, in five months.\n\nThese eye-popping returns have been driven by the insatiable demand for spot bitcoin ETFs, which were approved in January 2024 and have since attracted over $15 billion in investor dollars.\n\nTo give some context, that’s bigger than Rivian’s IPO ($12 billion), Uber’s IPO ($8 billion), and Reddit’s IPO ($750 million).\n\nThe bitcoin ETF, as I explained in The Parable of the Bitcorn, gives ordinary investors access to buy BTC. Instead of using confusing software wallets or meeting strangers in a coffee shop, you can now just buy the ETF in your ETRADE or Robinhood account – and the ETF holds the bitcoin for you.\n\nAfter the bitcoin ETF approval, all that pent-up demand for bitcoin caused the price to surge this year. I repeat: fifty percent growth in five months.\n\nOf course, we don’t know if Ethereum will see the same price pop after the Ethereum ETFs go live.\n\nBut we do know that the bitcoin ETF opened the asset to millions of new investors. The Ethereum ETF will do the same.\n\nThe History of Gold ETFs\n\n“History doesn’t repeat itself, but it often rhymes.” – Mark Twain\n\nPrior to 2004, investing in gold was a hassle. You had to buy gold bars or coins. You had to store them safely. You had to buy insurance. For many investors that wanted to buy gold, all the friction and worry was not worth it.\n\nThe first gold ETF was launched in November 2004, allowing U.S. investors to “own” gold without having to physically hold it. Like the bitcoin ETF, this allowed millions of investors to buy gold as easily as buying a stock – and the ETF bought the gold for you.\n\nThis caused a surge of demand for gold: within the first three days of trading, the ETF saw an inflow of $1 billion, and a few months later the price of gold had soared 20%. Twenty percent gain on a precious metal that had been around since – well, since the Earth was formed.\n\nSavvy investors bought up physical gold before the ETF, which of course was perfectly legal. Then they waited for the masses to pour in, driving the price up.\n\nThe power of these ETFs is they make difficult investments easy. It was a hassle to hoard gold coins, unless you were a troll. It was a hassle to buy bitcoin, unless you were a nerd. And today it is a hassle to buy Ethereum, unless you are Vitalik Buterin.\n\nAll that is about to change: the SEC has approved the Ethereum ETF. We’re just waiting on the final paperwork. Which presents a magnificent buying opportunity.\n\nWhy We Love Ethereum\n\nWe have written extensively about what makes Ethereum a great investment, so here’s the quick summary for those who are new to crypto:\n\nEthereum is the second-largest crypto behind bitcoin . This gives it tremendous market power, resiliency, and trust.\n\n. This gives it tremendous market power, resiliency, and trust. Ethereum is the #1 smart contract platform in the world . I think of it like an operating system that runs crypto apps: like the Windows or MacOS of crypto.\n\n. I think of it like an operating system that runs crypto apps: like the Windows or MacOS of crypto. Ethereum has a huge community . More investors -> more developers -> more apps -> more users, and the flywheel keeps turning. This will likely accelerate post-ETF.\n\n. More investors -> more developers -> more apps -> more users, and the flywheel keeps turning. This will likely accelerate post-ETF. Ethereum has a huge competitive moat . Because of its leading position, it is unlikely to be toppled from its top spot anytime soon (though many L1 crypto competitors are trying).\n\n. Because of its leading position, it is unlikely to be toppled from its top spot anytime soon (though many L1 crypto competitors are trying). Ethereum has a track record of innovation . Ethereum keeps pulling off major upgrades (the massive move to Proof of Stake in 2022 was a huge technological feat, as but one example).\n\n. Ethereum keeps pulling off major upgrades (the massive move to Proof of Stake in 2022 was a huge technological feat, as but one example). Ethereum is energy efficient . Since its move to PoS, its energy use dropped by an astonishing 99%. Today Ethereum consumes less than 0.01% of the energy of bitcoin.\n\n. Since its move to PoS, its energy use dropped by an astonishing 99%. Today Ethereum consumes less than 0.01% of the energy of bitcoin. Ethereum is fully decentralized . Unlike most other crypto investments, no one person controls the network. That is a massive advantage in determining its future legality.\n\n. Unlike most other crypto investments, no one person controls the network. That is a massive advantage in determining its future legality. Ethereum has an unofficial leader . At the same time, co-founder Vitalik Buterin is one of the most thoughtful and hard-working leaders in crypto, providing wise guidance and inspiration.\n\n. At the same time, co-founder Vitalik Buterin is one of the most thoughtful and hard-working leaders in crypto, providing wise guidance and inspiration. Ethereum has a vision and a plan . Unlike bitcoin, Ethereum knows what it wants to be when it grows up. (See the roadmap here.)\n\n. Unlike bitcoin, Ethereum knows what it wants to be when it grows up. (See the roadmap here.) Ethereum has been approved by regulators. The SEC has approved an ETF, a huge stamp of approval that should put all worries to bed: ETH is now really and truly 100% legal.\n\nWhen you’ve got a hot tech stock that’s about to IPO, ordinary investors like us can almost never buy the stock before the public offering. That’s reserved for the company founders and big VC funds.\n\nI’d argue that we are in a unique situation, where ordinary investors can buy into Ethereum, before it becomes “available” to the general public. It’s a situation very much like the bitcoin and gold ETFs.\n\nWe don’t know if history will repeat itself. But, as you may have heard, history often rhymes.\n\nTiming the Investment\n\nLongtime readers know that we’re not big on timing investments.\n\nOur approach remains the same: buy and hold quality crypto assets, making monthly investments regardless of price, and hold for five or more years. (Read more on our approach here.)\n\nBut let’s just say if you’re going to set up such an investment plan, now might be a really good time to do it.\n\nAnd you really, really might want to include Ethereum. Because the Ethereum ETF is coming, and ETH is coming to the masses.\n\nYou can be there first.\n\nDisclaimers: I am not a financial advisor, just a 10+ year crypto investor who’s written two books and several hundred columns on crypto assets. I have been a long-term ETH investor for 8 years, so my opinion may be biased. All investing involves some risk; see our investing approach for how we manage risk through diversification. Never invest more than you’re willing to lose, and see losses as learning."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOOTZFRDc4NDJiR1g5ZDZBTTBKS3Q4cllzSGdldTIxVFhTS05GbmEzcVJxdFYxdFVBNkwxWmc2aEhDZ2stMGQ2dFRTMjhZNktid0x1U1ZTcmtqWW1fTHFmdk1xS3c5LVFrbmM2azgteUNkdTNlWHpsWWNWT0wxRkNVeEN1UTRhRk9jUEk0ZWVFbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "$MAGAA Token Launches on Ethereum - and Celebrates Trump’s Birthday with Airdrop - Yahoo Finance",
        "content": "MAGAA\n\nRecord-Breaking Success in Twitter Spaces Featuring Donald Trump Jr., Dan Bilzerian, Andrew Tate, and More\n\nWashington, DC, June 14, 2024 (GLOBE NEWSWIRE) -- MAGAA is a PolitiFi memecoin launched on the Ethereum blockchain, aimed at representing political movements and ideals in the digital age. Backed by a team of experienced marketers and political insiders, MAGAA seeks to create a cult-like following around shared belief systems and drive significant market impact through strategic influencer engagement and media partnerships.\n\nTo mark and celebrate the birthday of Donald Trump, 10 million $MAGAA tokens are being sent to his ERC-20 wallet, which is currently valued at $15.3 million USD in crypto assets. The 10 million $MAGAA token donation is valued at roughly $360,000 USD, making it the 5th most valued asset in Trump’s public portfolio.\n\nA Record-Breaking Twitter Spaces Event\n\nThe highlight of MAGAA’s launch was a groundbreaking Twitter Spaces event that drew an astounding 273,000 listeners, making it one of the largest in history. The event focused on the impact of memecoins in politics, showcasing the power of these digital assets to drive political discourse and secure financial freedom.\n\nInfluential Figures Join the Conversation\n\nProminent figures such as:\n\nparticipated, bringing a diverse array of perspectives to the discussion.\n\nOne of the most notable moments came when a speaker asked, \"What do you think of political memes coins, like MAGAA, being used as a vehicle to address conservative issues?\" Donald Trump Jr. responded, \"I like what it does (Political meme coins) to create a community, creating momentum and movement - it creates another avenue for people to be vocal.\"\n\nDan Bilzerian added, \"Memecoins are more about a movement - going against the system,\" highlighting the rebellious spirit that often fuels these digital currencies.\n\nMartin Shkreli, known for his controversial past and prison sentence, shared his thoughts on the broader implications of cryptocurrency, stating, \"Crypto is a way to escape the confiscatory government. Every lawyer said to me, 'It's not because of what you did, Martin, it's because you wouldn't kiss the ring.' People don't like Trump because he also won't kiss the ring,\" Shkreli added, \"If the government comes to you and says, 'I want all of your money,' crypto adds an escape valve.”\n\nStory continues\n\nExplosive Financial Success\n\nFollowing the Twitter Spaces event, $MAGAA's market cap skyrocketed from $4 million to an impressive $84 million. This explosive growth underscores the strong support and belief in the token's mission and potential. The influential Reddit community WallStreetBets also joined the $MAGAA movement, further amplifying the token's reach and impact.\n\nThe Power of Memecoins\n\nThe success of $MAGAA illustrates the relevance and power of memecoins and their communities to drive political discourse and achieve financial freedom. Memecoins like $MAGAA are not just cryptocurrencies; they are movements that unite people around shared ideals and create momentum for change.\n\nQuote from the Founding Team of MAGAA\n\n\"We're really excited about these partnerships and relationships with these massive influencers. We're donating a large amount of money to conservative movements, and we will be making an extremely large donation to President Trump’s Ethereum wallet to show our alignment. There are some massive announcements coming, and our community couldn't be more passionate and excited.\"\n\nFor more information, visit https://magaa.io/,\n\nFollow on Twitter at https://x.com/MAGAAtoken,\n\nand join the Telegram chatroom at https://t.me/MAGAAtoken.\n\nAbout MAGAA\n\nMAGAA is a revolutionary memecoin launched on the Ethereum blockchain, aimed at raising awareness for conservative ideals within crypto. Backed by a team of experienced marketers and founders, $MAGAA seeks to create a cult-like following around shared conservative belief systems and drive significant market impact through strategic influencer engagement and media partnerships.\n\nMedia Contact: contact (at) magaa.io\n\nDisclaimer: The information provided in this press release is for informational purposes only and does not constitute financial advice. Cryptocurrency investments are subject to market risks, and individuals should conduct their own research before making any investment decisions.\n\nCONTACT: Xenia Von Wedel President Transform Group xenia (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOWUpLNkRHMzJZckRLdGhpVHZXU3NiT1RqaDE5UlA5RnU1enVKYnJDakhwTk9UTTVVbFZGR08ycGdZejAxOW5jYzNqY0hHMU5PVXNXR3VmWkZOZTJmUkVqeHlPWHdpU0VFeGU5R3FpNDFFS1J5OXhxb1BmYkpnYkN2RWxoTXhUU050Y3FuRmUtb1lfZEc5RnZ3NEZXU29GdFpZ0gGoAUFVX3lxTE9OdXU5cl85dnRRRElSRXZqRVNvWXRQNG1OaWRRT2xSMkFOUXFWeklvdV9LbF9CYjFCSzVJaXJFMU80NWJjMURjOFYzM1l6bGZjaC0wWklpY1VhVGdwa1dsdjdmWmV4MXc0ZHo0cjE2cUdNb2pSMGJwTkVwcGFzaDRfZzBjWHZGVnp0Mm04ZVZxUWVxVnZ1dE02QWpBeExNaHVFSF9WYnZBQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs' Last-Minute Approval Reveals a Massive Shift - ThinkAdvisor",
        "content": "What You Need to Know The SEC approved the funds in late May, but investors can't buy them yet.\n\nThe industry is banking on Republicans winning the White House or gaining control of Congress.\n\nFederal regulations prohibit banks from providing custody services for crypto, but a massive lobbying effort is at hand.\n\nYay.\n\nThe Securities and Exchange Commission approved spot ethereum exchange-traded funds on May 23, so, yeah. Yay. But the way this approval happened is astonishing, portending big implications for crypto come the November elections.\n\nQuick background: Ethereum was invented in 2015 and is known as “programmable money” or “smart contracts” — meaning you can control the timing and conditions of your transmittals. You can’t do that with bitcoin, and this feature explains why ethereum is now the second-largest digital asset by market capitalization.\n\nNowadays, bitcoin is popular mostly for its function as a store of value, while ethereum is valued primarily for its commercial applications. Indeed, many of the world’s biggest brands, including Nike, Google, PayPal, UBS, BlackRock, Tiffany’s, Breitling and Burberry, are building projects on the ethereum blockchain. It is also the primary platform for stablecoins and decentralized finance, each worth more than $150 billion.\n\nThis enthusiasm underpins the excitement over the new spot ethereum ETFs. In fact, Standard Chartered predicts that up to $45 billion will flow into these ETFs within the first 12 months.\n\nBut there’s a catch: You can’t buy them yet, because the SEC has bungled the process. The agency had a statutory deadline to approve or reject the first of the ethereum applications, Van Eck’s, by May 23.\n\nEveryone monitoring the situation was pretty sure that the SEC was going to reject all the applications — with the best evidence being that there had been virtually no communication between the SEC and the eight ETF providers that had filed applications. (Typically, when an application is under consideration, there’s substantial engagement between SEC staff and the fund company.)\n\nThen, just 72 hours before the May 23 deadline, the SEC initiated intense engagement with all the ETF sponsors, not just Van Eck, including requests for urgent amendments to their applications. This sudden activity was quite a surprise and indicated that approval was imminent. Overnight, Bloomberg went from 25% likelihood of approval to 75%.\n\nIndeed, approval came on the Thursday evening before the start of the Memorial Day weekend, the lack of notice leaving the crypto and financial services communities unprepared. And, in the end, the SEC’s last-minute dash left work unfinished; Although all the 19b-4 forms were completed and approved, none of the applicants’ S-1 forms were.\n\nConsequently, the ETFs have not yet entered the marketplace. People I’ve talked to couldn’t recall the last time an ETF approved by the SEC wasn’t able to start trading immediately. The sponsors of these ETFs say it could be months before trading starts.\n\nWhy did the SEC wait so long to work on the ethereum ETFs?\n\nThe answer speaks volumes about a massive political shift on Capitol Hill — with massive implications for the future of crypto.\n\nIf Republicans win the White House or gain control of both houses of Congress, the crypto industry will enjoy explosive growth in the United States. But if President Joe Biden remains in the White House, or Democrats control Congress, the crypto industry might well abandon the United States in favor of countries that are more welcoming — including Japan, South Korea, France and the United Kingdom."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNNEEzTjdkeWZOS0ZIeENWdWxhUDZFTTZyQzV2Vnl3dE1UYTVNNkp6cnVXdlBCaEZpeDl4dzJfcXFvbDk5YmQzMEpJSXh4OGFnLTBmMXhnUmtVWGRUTVEtaHgyNWtpZjgxUDhCNWNnU1BxcjgyVGtTVnduQnhBNzM2enZlam5fZXBEQzU0bFFYQnVaRGRETjNybHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Updates Spot Ethereum ETF Launch Date - Crypto Times",
        "content": "The anticipated launch of a spot Ethereum ETF is getting closer. According to analyst Eric Balchunas from Bloomberg, the estimated launch date has now been set to July 2, 2024.\n\nThis updated timeline comes after the Securities and Exchange Commission (SEC) staff provided feedback on the applications (called S-1 filings) submitted by companies seeking to launch Ether ETFs. Balchunas reports that the SEC’s comments were relatively minor, requiring only a few changes to be made within a week.\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\n“Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend,” Balchunas said, suggesting the SEC wants to finalize the approval process quickly.\n\nThe launch date aligns with SEC Chair Gary Gensler’s recent statement that Ether ETF approvals could happen “by the end of this summer.”\n\nEther ETFs are expected to provide institutional investors with a regulated means of investing in Ethereum, thereby potentially increasing its market activity and affecting its prices.\n\nThis development comes after Bitcoin-based ETFs successfully launched earlier this year and have already begun influencing market trends."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE4tMEJUZWRKLTNaLUxCbHVmanlpN1NFUFdkcVBRY1VjWU8tSVpTaUdLb0NiRk1QVEtPMzBZbG1ZbFVrUkN2MzBLcnFTTTJKX3hYa1BCbHIzM2N2VmxycDUxdVcteDhFQUNvNk5PQUMxclAzX1lVR2NYVlcxS2diQ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Sees Surge in Long-Term Holder Accumulation Amid Price Dip - Yahoo Finance",
        "content": "Ethereum (ETH) Sees Surge in Long-Term Holder Accumulation Amid Price Dip\n\nEthereum (ETH) has experienced a significant boost in long-term holder accumulation, taking advantage of a recent 2% price drop over the past 24 hours. This surge marks one of the largest days for accumulation in the cryptocurrency’s history.\n\nOn June 13, CryptoQuant's head of research, Julio Moreno, highlighted the dramatic increase in Ether demand. In a post on X, Moreno revealed that 298,000 Ether tokens were acquired by accumulation addresses over a 24-hour period on June 12. This accumulation is valued at approximately $1.34 billion at the time of publication.\n\nMoreno noted that this influx was only 6% shy of the record set on September 11, 2023, when long-term holders scooped up 317,000 Ether as the price fell below $1,600 This surge in demand comes amidst a broader 8.49% price decline for Ether over the past week. Initially dropping below $3,800 on June 8, Ether has struggled to rebound but has managed to stay above $3,400, according to data from CoinMarketCap. As of this writing, Ether is trading at $3,503.\n\nIn parallel with these market movements, regulatory developments may provide further context for Ether’s future. On June 13, SEC Chair Gary Gensler indicated that spot Ether exchange-traded funds (ETFs) could potentially receive final approval for trading before the end of September. This forecast was shared during a Senate Banking Committee hearing, where Gensler suggested that the regulator might sign off on the final approvals for listing and trading shares of spot Ether ETFs within three months.\n\nThis follows the SEC’s preliminary regulatory approval on May 23 for spot Ether ETFs in the U.S., approving 19b-4 filings from eight applicants. However, trading can only commence once the S-1 registration statements are also approved."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNNEhjMzVJNldxX2Q5Q0xaVFdYcm00NXFmcnRlbm1VcVFRaFZFR3c5bzRIVF84czdvUGpKb2toVnkxNG1RV1dId045SHJDX2RtYTVJUi1JeHdKaklLOC1TZzR6aGI1TlotaENsX292VGtvc3Z3VDBUVkFwSllBQzVpRW5nbi0zb2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "“Crypto-Breakthrough” Bill Could See Bitcoin, Ethereum, and BlockDAG Network Prices Skyrocket “Very Soon” - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, June 14, 2024 (GLOBE NEWSWIRE) -- Bitcoin and other major cryptocurrencies, including Ethereum and XRP, have surged in 2024 after hitting their lowest points in 2022. The Bitcoin price has rebounded to its previous all-time high of around $70,000 per BTC and could potentially surge further to anywhere between $100,000 to $150,000 as traders and analysts are noticing a bullish price pattern. Meanwhile, Ethereum, BlockDAG Network, and other altcoins are preparing for a significant but positive impact from Wall Street.\n\n\n\n\n\nAmid the political landscape, where both President Joe Biden and former President Donald Trump are making moves related to cryptocurrency, a potentially transformative bill has emerged. Passed quietly by a Senate committee, this bill could become the most crucial U.S. crypto policy if it becomes law.\n\nSenate Committee Passes Crypto Provision\n\nThe U.S. Senate Select Committee on Intelligence recently passed its funding package, which includes a little-noticed crypto provision. This provision mandates crypto companies to collect more information about their users or face sanctions designed to prevent terrorism financing. According to Coindesk, this move would \"speed and automate the process to sanction 'foreign digital asset transaction facilitators,' including crypto exchanges linked to users who support terrorism groups.\"\n\nThe Intelligence Authorization Act (IAA) passed unanimously with a 17-0 vote. However, the crypto section was not highlighted when Senator Mark Warner, the Democratic chairman of the committee, announced the vote. Warner emphasized that the bill enhances the U.S. intelligence community's ability to identify and counter technological threats from adversarial nations and designates foreign ransomware organizations as hostile cyber actors.\n\nCrypto Industry Response\n\nDespite the significance of the bill, crypto industry insiders believe the provision might not survive the budget process. Cody Carbone, the chief policy officer for the Digital Chamber, told Coindesk that there would likely be pushback from the industry, potentially leading to its removal from the National Defense Authorization Act (NDAA). This potential removal could ease concerns and further boost confidence and investment in the crypto market.\n\nLast month, the U.S. House of Representatives passed the Financial Innovation and Technology for the 21st Century Act (Fit21). This act splits responsibility for cryptocurrency regulation between the Securities and Exchange Commission (SEC) and the Commodities Futures Trading Commission (CFTC) and has received broad support from crypto companies and pro-crypto lobby groups. Such regulatory clarity and support are likely to attract more institutional investment, driving up the value of cryptocurrencies.\n\nStory continues\n\n\n\n\n\n\n\n\n\nTrump’s Endorsement and Industry Growth\n\nThe Biden administration has softened its stance on Bitcoin and crypto recently, following Donald Trump’s pledge to support the crypto industry. Last week, Trump conducted a crypto-friendly fundraiser in Silicon Valley, hosted by investors David Sacks and Chamath Palihapitiya, raising around $12 million. Trump declared his intention to be the \"crypto president\" and promised that the Biden-Gensler crackdown on crypto would end swiftly if he were re-elected.\n\nTrump's endorsement of crypto and digital assets could mean a significant increase in industry value and individual projects growth as soon as 2025. His support, combined with technological advancements and favorable regulatory changes, creates a positive outlook for the market.\n\nBlockDAG Network: A Revolutionary Technology\n\nIn the evolving world of cryptocurrencies, BlockDAG Network is an emerging revolutionary technology. Unlike traditional blockchain, which relies on a linear sequence of blocks, BlockDAG (Directed Acyclic Graph) allows for multiple chains of blocks to coexist and interconnect. This structure significantly increases transaction throughput and scalability while reducing confirmation times.\n\nBlockDAG Network can handle a higher volume of transactions without compromising security or decentralization, addressing one of the most critical challenges faced by traditional blockchain networks. As cryptocurrencies gain more mainstream attention and political endorsement technologies like BlockDAG Network could play a crucial role in the industry and lead to substantial returns for both new and existing venture capitalists.\n\nThe legislative developments, coupled with favorable regulatory changes and high-profile endorsements, set the stage for a significant market rally. investors should prepare for a potential surge “very soon,” as the bill's positive impact on the crypto ecosystem could trigger a substantial increase in the value of many digital assets including Bitcoin, Ethereum, BlockDAG Network, and other major altcoins, making the industry more robust and appealing to more investors.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nCONTACT: Brown Williams support (at) blockdag.network\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPd2d4RWdwbVlNLWZYeThDMDdFN0pkX085b0gzaml4ZkU1TlZUbGZWZk1CeTJ0Y2VTSWp5b0UxTXhYMHFBTVM2Q0tpbUlzSFFEWFlrOW9mVmVsRkR4ekZJcFptN0wwWmtabHdlUC0yT2FIOEt1SllfdXVfcUtzS2RfRlo4blJOdjRBSzhz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Beginner Investors Beware! Why Bitcoin, Ethereum, and Furrever Token Are Must-Have Investments in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 14, 2024 (GLOBE NEWSWIRE) -- As the cryptocurrency market continues to evolve, new investment opportunities are emerging, making it an exciting yet challenging space for beginners. Among the many options, Bitcoin, Ethereum, and Furrever Token are standout investments for 2024.\n\nBitcoin, often referred to as digital gold, has a long-established history as the first and most prominent cryptocurrency. Since its inception in 2009 by the pseudonymous Satoshi Nakamoto, Bitcoin has maintained its market leadership. As of mid-2024, Bitcoin is on a strong upward trajectory, nearing $100,000 per BTC, with a market cap surpassing $1 trillion, solidifying its status as a stable and reliable investment. Adoption of Bitcoin has accelerated, with major financial institutions like Fidelity and BlackRock integrating it into their portfolios. Additionally, Bitcoin ETFs have gained traction, providing investors with easier access to this digital asset. With increasing regulatory clarity and acceptance, Bitcoin's role as a hedge against inflation and a store of value continues to strengthen.\n\nEthereum, not just a cryptocurrency but a decentralized platform enabling smart contracts and decentralized applications (dApps), is another key player. The transition to Ethereum 2.0, introducing a proof-of-stake (PoS) consensus mechanism, promises significant improvements in scalability, security, and energy efficiency. This upgrade is expected to attract more developers and projects, further solidifying Ethereum's position in the crypto ecosystem. Ethereum is the foundation of the booming decentralized finance (DeFi) sector and the non-fungible token (NFT) market. With most DeFi projects and NFTs built on the Ethereum blockchain, its utility and demand continue to grow. The potential approval of Ethereum ETFs by the SEC also signals a positive outlook for institutional adoption.\n\n\n\nFurrever Token (FURR) is emerging as a new player in the meme coin space, offering a unique blend of financial incentives and engaging cat-themed content. Unlike many meme coins that rely solely on hype, Furrever Token integrates tangible value through its innovative features. The token has already raised over $1.3 million in presale stages, highlighting significant investor interest.\n\nOne of the standout features of Furrever Token is its referral system, which allows investors to earn 10% in $FURR Tokens for every deposit made through their personal referral link. This incentivizes community-driven growth and promotes widespread adoption. Currently priced at $0.000732, Furrever Token offers up to 15X returns, making it an attractive option for investors looking to capitalize on early-stage opportunities.\n\n\n\n\n\nStory continues\n\nThe increasing institutional interest in cryptocurrencies like Bitcoin and Ethereum adds a layer of credibility and stability to these investments. Large-scale investments by hedge funds, publicly traded companies, and financial institutions signify confidence in the long-term viability of these digital assets.\n\nThe overall market sentiment for cryptocurrencies is positive, with Bitcoin and Ethereum showing strong performance indicators. Bitcoin’s recent rally towards $100,000 and Ethereum's advancements with Ethereum 2.0 create a favorable environment for both seasoned and beginner investors.\n\nInvesting in Bitcoin, Ethereum, and Furrever Token offers a balanced approach to portfolio diversification. Bitcoin provides stability and long-term value, Ethereum offers exposure to the rapidly growing DeFi and NFT sectors, and Furrever Token presents high-growth potential in the meme coin market. This diversified strategy helps mitigate risks while maximizing potential returns.\n\nFor beginner investors, the availability of educational resources and community support is crucial. Bitcoin and Ethereum have extensive online communities, forums, and educational content to help new investors understand the market. Furrever Token, with its community-centric approach, also offers robust support, making it easier for beginners to navigate the investment landscape.\n\nConclusion\n\nAs the cryptocurrency market continues to mature, Bitcoin, Ethereum, and Furrever Token present compelling investment opportunities for 2024. Bitcoin's market dominance and institutional adoption, Ethereum's technological advancements and market utility, and Furrever Token's unique value proposition and high potential returns make them must-have investments. By understanding these assets' strengths and staying informed about market trends, beginner investors can confidently enter the crypto space and capitalize on its growth potential.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNV2Q3UExtaWY2X0V3LWhNTmlpRE9LUF82NWszSXRmdS1xS1JicnIwQVlvb3RkUnV3TUhsTk5vMHJiRWY0SnQzUFJaZ3lzNXV0MUZsSk1HRTZOZEJuQkduVDdCVV9EcDlHN0lHSU5Nd2MxME5kMXJrSjJ1ckFXekRKZ2Nn0gGHAUFVX3lxTFAtcHc3MGNTZFFmMEZjMGdPV0l5bFdKVWdXU05GNm1NNENqWXYtd2RPUW9qM1M3QnBwWXZ4dDhOeTFkWXdTOG05MVlraVM1SjBIS1lpcDU1NHExOTV2X1Z2NU12QXg1Rkt4OG9GclQwejRFVXBTV0o5QUVDdjcxLXpzd2FYbWd6cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "114 Billion PEPE Trader's Surprising Ethereum Shift; Here's Why - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a dramatic turn of events, a PEPE trader has capitulated, selling all of his 114.7 billion PEPE tokens for 366.5 ETH, worth approximately $1.27 million.\n\nAdvertisement\n\nAccording to Lookonchain, the trader initially purchased the 114.7 billion PEPE tokens on May 14 and May 15 for $0.000011 per token, totaling $1.27 million.\n\nThis entry point seemed promising as the PEPE was gaining traction and attracting considerable interest within the crypto market. PEPE would later surge to all-time highs of $0.00001718 about 14 days later.\n\nThis $PEPE trader capitulated and sold all 114.7B $PEPE for 366.5 $ETH($1.27M) at a breakeven price.\n\n\n\nHe bought 114.7B $PEPE($1.27M) at $0.000011 on May 14 and May 15.\n\n\n\nThe price of $PEPE broke through $0.000017 on May 27, at which time his profit was $670K(+50%), but he did not… pic.twitter.com/aPxuftE1yI — Lookonchain (@lookonchain) June 15, 2024\n\nOn May 27, the price of PEPE surged, breaking through the $0.000017 mark. At this peak, the trader's holdings were valued at $1.94 million, presenting a potential profit of $670,000, or 50% gains. Despite the substantial gain, the trader chose not to sell, possibly holding onto the tokens in anticipation of further price increases, which proved costly.\n\nHowever, the market took an unfavorable turn as PEPE's price began to decline. The downward trend continued, and the value of PEPE fell below the trader's breakeven point of $0.000011.\n\nFacing the sustained drop in PEPE's price, the trader ultimately decided to sell all 114.7 billion tokens. The sale was made at a breakeven price, yielding 366.5 ETH, nearly equivalent to his initial investment of $1.27 million.\n\nAlthough the trader did not incur a financial loss, the missed opportunity for a substantial profit underscores the significance of timing the market perfectly. More often than not, market timing has been found to significantly impact trading outcomes.\n\nAt the time of writing, PEPE had dropped 0.79% in the previous 24 hours to $0.00001204. The frog-themed cryptocurrency has slowly decreased since reaching an all-time high of $0.0000171 on May 27. PEPE struck a low of $0.00001057 in yesterday's trading session as profit-taking continued and the market saw a slump before rebounding rapidly."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNZFdMZVBGeFFodTg3TlAwMkRmcEhsZWY4QXAzNUkyeE13RjNTc2pyWkhVMi1wMXBIckd3ZlBzbkhLZnlkMHZMdnR2R1BKYU51YjVhZEZ2RjFUajZGWEc5T3JsaEszT2MxWU1JcWpMYUtjN3pPNFhmUnRGNk5XTXpZQTJJRVJfeC13bnE2VFg3UWlPZ3lla2hCMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s 2% Price Drop Spurs Second-Biggest Buying Day - Crypto Times",
        "content": "Investors strategically capitalized on a 2% price drop in Ethereum over 24 hours, leading to its second-highest day in long-term holder accumulation.\n\nCryptoQuant’s head of research, Julio Moreno, highlighted in a June 13 X post that 298,000 Ether tokens, worth approximately $1.34 billion, were purchased by accumulation addresses on June 12. This amount was just 6% below the record set on September 11, 2023, when 317,000 Ether were bought as the price dipped below $1,600.\n\nEthereum demand has spiked.\n\n\n\nBuying by permanent holders was the second highest on record yesterday: 298K ETH.\n\n\n\nThe record daily buying was last September 11: 317K ETH. pic.twitter.com/0qMVpNU8ht — Julio Moreno (@jjcmoreno) June 13, 2024\n\nThe 8.49% price decline in Ether over the past week drove this buying activity, with Ether trading at $3,472 as per CoinMarketCap data, after dipping below $3,800 on June 8 and struggling to recover while staying above $3,400.\n\nThis price level around $3,500 has historically been a significant resistance point for Ether, with past price action in this range leading to further declines, such as a similar dip below $3,500 on April 11 resulting in a 25% drop to $2,817 by May 2.\n\nDuring a Senate Banking Committee hearing on June 13, SEC Chair Gary Gensler hinted that spot Ether ETFs could receive final approval for trading by the end of summer, with the SEC potentially signing off on the approvals within three months.\n\nThe SEC granted preliminary regulatory approval for spot Ether ETFs on May 23, approving 19b-4 filings from eight applicants. However, trading can only begin once the S-1 registration statements are also approved.\n\nThis surge in long-term holder activity and potential regulatory advancements indicate a pivotal moment for Ether and its investors."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOX2tod0liTmk4WFR6OTRiSXRmMDlldjNGanVmajdBU2cwM3p0RXlYeVRUUDRaWEZFSEFNQXA2b2pPdHRVRHduRTVWQWNXbnBEcGwyd3B4ejc2MG41TTZrMWFEbTJ6SjN4VGJGLWN3WmZwWHFkdDQxS1lhdUVvUkw4N2w4bVdNd3lZWmQ5YXg1TEpKYmUxSEo2R1ZRWHJrcFJ0aVFBV245VFZyUUtVLWYyYUx2MlNLYWpLSTNLQmo4NDlIY2g3MGVLRC1TRzdVQnpjejh3ZG1HQXZvcjTSAeABQVVfeXFMTnRWZzRFRnhkcXhnWTJ5VmNqNHZwZjhtT0VHSkhSczhieEZMWVdWekRvUXNycHpibXRSRkY0NVB0V2l2UXM1emp4clZGeWJjU1FycGd1T1NtYWNyQTd3bC1MN05FZFd5WXJsNXRudWNPN2lITGlZZ0xRc0EzZjV4VkJaWDJ5N3JiZHNQZlBfMjg3S29Id1JKVXgzNkl5eGNpcDljZTc0VERwY203YjhlR2hCMFg4VTU4Q1d3Ym54UzE3dmdTUnhxM3VvYVlEV2wxU2stYmV6ektQNF9RbHdYd1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Tailwind: How the SEC ETF approval boosted Memecoin mania - The Economic Times",
        "content": "Why the Ethereum ETF Effect?\n\nA Look at Key Ethereum Memecoins\n\nLong-Term Impact: A Speculative Future\n\n\n\nInstitutional Interest: A Long Road?\n\n\n\nMemecoins: Flavour of the season\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bitcoin ETF, particularly BlackRock 's IBIT, has been the fastest-growing ETF to date, reaching $20 billion in just 137 days. In comparison, the next closest, JEPI, took nearly 1,000 days to achieve the same milestone. Now that the money men have tasted blood, and Ethereum spot ETFs to be listed, there are some interesting developments in the crypto market.While the primary impact is directly on Ethereum, there's been a fascinating secondary effect – a surge in the valuations of memecoins built on the Ethereum blockchain. Let's understand how this development is impacting the memecoin landscape and what it means for the future.Memecoins, often known for their viral appeal and sometimes questionable utility, have seen significant price boosts following the Ethereum ETF announcement. Notable memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) experienced double-digit percentage gains, while lesser-known tokens like Floki Inu (FLOKI) and Dogelon Mars (ELON) skyrocketed by even higher margins.Several factors contribute to this phenomenon. The approval of an Ethereum ETF signifies growing mainstream acceptance of cryptocurrencies. This is also a major development in the industry after the Bitcoin ETF approval which witnessed large volumes of institutional money inflows. This can attract new investors, particularly those with a risk appetite who might explore memecoins as a volatile yet potentially high-reward entry point into the Ethereum ecosystem.The ETF reinforces confidence in Ethereum as a blockchain among users which partially translates to interest and enthusiasm in memecoins built on Ethereum. Compared to memecoins on alternative blockchains like Solana, Ethereum's established developer community, network security, and scalability efforts (like Ethereum 2.0) provide a perceived edge.: One of the OG memecoins, thanks to Elon Musk’s endorsement, DOGE has seen renewed interest. While its utility remains debatable, its brand recognition and loyal community stand to benefit from the Ethereum ETF tailwind.: Known as the \"Dogecoin Killer,\" SHIB has also enjoyed a price increase. Its efforts to build a decentralised ecosystem with its SHIB token, Shibarium Layer 2 blockchain and LEASH governance token might attract investors seeking a more feature-rich memecoin experience within the Ethereum network.: Inspired by Elon Musk's dog of the same name, FLOKI positions itself as a memecoin supporting various charitable causes. The Ethereum ETF effect, coupled with FLOKI's community based initiatives, could attract impact-driven investors seeking memecoin exposure.: This space-themed memecoin, referencing Elon Musk's Mars ambitions, has seen significant gains. While its long-term viability remains to be seen, current market sentiment favours this token as a part of the overall market gains.The long-term impact of the Ethereum ETF on memecoins remains a grey area. While the current surge suggests renewed interest, memecoins are inherently volatile and prone to market corrections. Their long-term success hinges on developing real utility beyond mere hype, something that could be achieved by clear community guidelines and consensus, and of course a concrete regulatory framework.The Ethereum ETF approval gives Ethereum-based memecoins a temporary advantage over those on Solana. While Solana offers faster transaction speeds and lower fees, Ethereum's established reputation and developer base currently hold more sway in market sentiment. However, as market dynamics evolve and Solana continues to develop, this advantage could shift.Apart from reputation risk and uncertainty, institutional interest in memecoins isn't completely unfathomable. Despite their volatility, some memecoins boast massive market capitalizations and active communities. Institutions might see a potential for controlled exposure to capture some of this growth. A small allocation of memecoins could serve as a diversification tool in their broader portfolio. Some memecoins are exploring ways to develop utility, such as integrating with decentralised finance (DeFi) protocols or play-to-earn gaming platforms. This could attract institutions seeking exposure to these emerging trends. If memecoins gain wider mainstream acceptance like in the gaming community or other metaverse projects, and demonstrate long-term stability, institutional attitudes could shift.In May alone, 455,000 tokens were launched on Solana. During the same month, 177,000 tokens were introduced on Base, while Optimism and Arbitrum each saw the launch of 20,000 new tokens. Most of them were memecoins. Virtually everyone understands that investing in meme coins is gambling. In a casino, one is gambling against the house, everyone knows the house always wins. Many people view the stock market in a similar light, which is why GameStop and 'Roaring Kitty' gained traction—because it felt like someone was sticking it to the house. However, people recognize that the house always wins. Meme coins, on the other hand, offer a different dynamic. They provide a sense of peer-to-peer competition rather than betting against the house. It's more about competing with fellow enthusiasts, which is a more exciting and less disheartening game. The PVP (player versus player) nature of it gives people a sense of having a chance. These activities are not controlled by Wall Street suits, which adds to their appeal. It's a way of rebelling against a system perceived as rigged against the average investor.The SEC 's approval of the Ethereum ETF has had an unexpected but fascinating consequence – a resurgence in Ethereum-based memecoins. While the long-term viability of these tokens is uncertain, the current market sentiment favours established blockchains like Ethereum. This, along with the potential influx of new investors, has created a short-term boost for these memecoins. However, for the enthusiasm to continue, these tokens will need to evolve beyond mere internet hype and demonstrate tangible utility."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE83TlgzWVNUMWFCdjFfcFJOT1NVN2lISTVYSWtqNEFzMnlRNGNURjNWamloZWtEZXZqY2kxa1U5NUFUVFgzeVhQeXFCNlBjdXR1U1Y4d0ZjQ1V2U3FVRW9fN1R2a2FTQWVyNThQYWlrVHrSAXZBVV95cUxNUDVXYVNqM19lcDU3Rm9ydWREaDY0Q0Qwb0EyMmJKb1YwTXJmeUFLT2xZVWhrQnJNaDdJUEd5Wm5XUDUydjI2U2NvM1JRUGk3bFFMalBiTWJoOTFCZ0dlT2QxTzNaOWJTUmpXVXBkX2RJbGlCOXZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "298,000 Ethereum (ETH) in 24 Hours, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThere is a growing demand for Ethereum (ETH) on centralized trading platforms as the approval of the spot ETF is driving bullish sentiment. According to CryptoQuant’s Head of Research Julio Moreno, Ethereum demand has spiked significantly.\n\nAdvertisement\n\nEthereum buying breaks major record\n\nAs Moreno pointed out, Ethereum buying by permanent holders marked the second highest buying on record on June 13, with a total of 298,000 ETH acquired.\n\nEthereum as a digital currency is not new to intense buying activity overall. Besides this recent spike in buying activity, Ethereum’s highest buying date ever came last Sept. 11, when a total of 317,000 ETH were acquired in 24 hours.\n\nEthereum demand has spiked.\n\n\n\nBuying by permanent holders was the second highest on record yesterday: 298K ETH.\n\n\n\nThe record daily buying was last September 11: 317K ETH. pic.twitter.com/0qMVpNU8ht — Julio Moreno (@jjcmoreno) June 13, 2024\n\nThe explanation for this increased buying momentum is not far-fetched. Prior to the entry of institutional capital that might showcase a high affinity for spot Ethereum ETF, most retail buyers are taking positions as needed. This is a major coping mechanism for the intense liquidity war that might be activated very soon.\n\nThe ongoing accumulation will grant current holders a major headstart should the price of Ethereum make a push toward new highs. One intriguing trend seen in Ethereum is the price slump over the past week.\n\nThe coin is down by 7.60% over the trailing seven-day period, and the June 13 accumulation comes at a time when the coin flashed a major discount. The accumulation has sparked a mild trend reversal, jumping by 0.6% at the time of writing to $3,519.20.\n\nWhat to watch out for in Ethereum\n\nBesides the numerous upgrades the Ethereum protocol has welcomed in the past year, the most important event to watch out for is the approval of S-1 registrations for the spot Ethereum ETF product.\n\nWhile the timeline remains speculative, the commencement of Ethereum ETF trading will mark a new era for the coin and likely open it up to an intense rally."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNZDM1SmJaV19VVlFKcGd6d0hXRGVJWnRDby1ZNFhBaGc0T1oxdFRoRVE0dEtnTWpFU3VVbE12aWlxM3RYekd6VHhLcGdiNnE4MkFaZTBUNlFPRmFqQWVKSjM1WG1wbFFSSFdVWGFObmpmRHFCR0R4TUg4VG10MWo1LW5GT0JyNkFZb3pINmlTZEc3blBDaUluMFRHdzVsOEZHaW5PcUN4dkt4NUJ2NFdCUUk3dDhqUdIBuwFBVV95cUxQak5aX296Q1J3YVVPUV9pdTgxMTNBbWpmTGVqWEtHZFJUeHJEeFdtb24wMDZTeHJ6NDh4R3BEaXlIdWd4SVZYRGZVLVJoeHVnV0QtLVZGSkN1WXVIZzhuUWh2Vm1QZlAyaEZOclM4YlNGLUtPVmtCQlBYMmN2cHYzeEMtc01vR3JwVVFRMExMT2NpdnM2QjdnUjZjTEpzZkFwczhmRGp2bWxUcVg2eEF5alkwb3ZCMXhTX1pZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Gains BlackRock’s Favor Over Permissioned Blockchains – ETH Price to Rally? - Crypto News Flash",
        "content": "Ethereum (ETH) is tipped for a bullish run following the recent shift of BlackRock towards permissionless blockchain.\n\nBlackRock recently launched its first tokenization project on the Ethereum blockchain.\n\nThe longstanding argument between a non-restrictive, permissionless distributed ledger system and its permissioned counterpart crept into a panel discussion at Coinbase’s State of Crypto Summit 2024 on June 13, 2024. Here, Ethereum’s permissionless blockchain seemed to have emerged at the top with Samara Cohen, the Chief Investment Officer of BlackRock for ETF and Index Investments, narrating the evolution of this technology from years back.\n\nAccording to her, private permissioned blockchains were expected to lead a few years back, however, public blockchains have defied all odds to take the lead in the ecosystem. Interestingly, experts have concluded after a broader consultation and observation that open source platforms like Ethereum are mostly preferred to avoid fragmenting liquidity and ensure wider and more efficient market participation.\n\nBlackRock Takes Action Towards Permissionless Blockchain\n\nSamara Cohen’s recent remark comes soon after BlackRock launched its first tokenization project on the Ethereum blockchain. In collaboration with a US-based firm Securitize, BlackRock tokenized the “Institutional Digital Liquidity” fund, bringing an initial liquidity of $100 million. Our investigation shows that the fund primarily invests in cash, short-term debt securities, and US Treasury bonds while leveraging Ethereum’s architecture to facilitate its operation.\n\nBlackrock CIO of ETF & Index Investments @Samaraepcohen said today at the Coinbase event that permissioned blockchains have lost, & that traditional market participants are coalescing around open-source #Ethereum for tokenization, so as not to fragment liquidity 👍 — matthew sigel, recovering CFA (@matthew_sigel) June 13, 2024\n\nIn line with the presentation of BlackRock’s CIO, Hunter Horsley, CEO of Bitwise has confirmed that BlackRock has embarked on a remarkable shift towards public blockchain. Speaking on this, Horsley stated that there is no debate as permissionless blockchain currently stands tall among permissioned distributed ledger systems.\n\nExperts Speak on the Impact of BlackRock’s Remark on Ethereum\n\nAccording to Anthony Sassano, a renowned angel investor, advisor and founder of The Daily Gwei, Ethereum is obviously the future as confirmed by BlackRock. To him, this could trigger a bullish reaction and send ETH to a new height.\n\nSeriously read and digest this. An executive at BlackRock (the largest asset manager in the world) is telling you that the future is public blockchains – specifically, that the future is Ethereum! If this doesn’t make you bullish, nothing will.\n\nOur review of the State of Crypto Summit 2024 took notice of the insights of key figures such as “Sandy Kaul, Senior Vice President at Franklin Templeton, and Alesia Haas, CFO of Coinbase.” Per their discussion, the year 2024 was underscored as pivotal for the crucial integration of cryptos and Traditional Financial (TradFi) via Exchange Traded Funds (ETFs) and the tokenization of assets.\n\nAlso, it was agreed that integrating blockchain technology into mainstream financial practices has encouraged the acceptance of platforms that provide transparency, accessibility, and governance.\n\nIn reaction to this development direction, analysts expect the ETH price to surge with Analyst Michaël van de Poppe predicting the market to explode with the expectation of Ether ETF going live in early July as reported by Crypto News Flash.\n\nEthereum has corrected in the past three weeks, but slowly but surely, the momentum toward listing the Ethereum ETF will start to emerge. The expectation is that the ETF will go live in July. I’m betting on the ETH ecosystem and it holds a crucial support level.\n\nAt press time, ETH was trading at $3,531 after surging by 0.28% in the last 24 hours and declining by 4.4% in the last seven days.\n\nRecommended for you:"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNYkxITms2eUpadVVVZWdMc1o4TlMtQ25HYktibm1GcXBYNHBSQTFKcGs0UTh3SGZfNUFkWTNPcWhkU0ZncEYzMllBSFkwZ3JGTC1uaVB5S29UTk5jZnZ0Zk1FblBLMUpVX2NCUnR2ZzMwbGxhTGtRSmVuU0xiemwxOEt6UGFnYmZVcUMtdlFNSmgzYjBUZ2hoUjBVa3FSY3hWalJYc2pFTjnSAa4BQVVfeXFMTWl0cWVPU3k1dVJ6aTQ1QjVOaFcwaml0ajhNX25Cd3RMd2JRcGlqZExVQ1EzY2sxMGFSTnFZdk9QZ2M1cDJaLTdDZ3RQU1pZSzlOSWY2ZXJGc1hRRm5IcG1OWV82ck50Y1hnUGxDeEdPLVd0QWpyYm1fOUIwbjFfLWFKOUx0em1xYXV0RGpDbXVKYmx5V0NDQXVob2Q5ZGE5dm16STB3T2JRcVN3N3FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Good News for Ethereum (ETH) ETFs in the US, But With a Catch: Bloomberg’s Balchunas - CryptoPotato",
        "content": "After the US Securities and Exchange Commission made history earlier this year by approving almost a dozen spot Bitcoin ETFs, all eyes in the community turned to the next digital asset in line – Ethereum.\n\nWhile the landscape didn’t look promising at first, it changed several weeks ago when, somewhat surprisingly, the agency greenlighted eight spot Ethereum ETFs. However, the launch date is still unknown.\n\nWhen the spot BTC ETFs were approved by the securities regulator, they went live for trading on the very next day, which caused tons of volatility but has been among the most bullish developments in the industries ever since.\n\nThe situation with the Ether ETFs is quite different. Although they have been technically approved, there are some irregularities with most S-1 filings and the question of whether they will allow staking, which is a major part of the Ethereum ecosystem. This is why the launch date remains a mystery.\n\nAccording to Eric Balchunas, Bloomberg’s ETF expert, there’s some good news on that front, as the Commission’s staff has recently made only minor comments to the S-1 applications.\n\nHe believes there’s a good chance the documentation will be handled within the next ten days or so, so they could “get it off their plate” before the July 4 US holiday. In other words, Balchunas suggested that the Ethereum ETFs could see the light of day by July 2.\n\nNote: our previous over/under was July 4th so this isn’t major shift but 1) we startted to feel like it would take longer so this is kinda good news and b) we basically decide the over/under on where are most torn 50-50 on where to bet and July 2nd is that date right now. — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nRecall that BTC’s price went on a massive rollercoaster in the first few days after the launch of the ETFs. Since then, though, these financial vehicles have attracted billions of dollars and propelled a price surge toward a new all-time high for the underlying asset.\n\nETH also saw impressive gains ahead of the ETF approvals, but there will likely be lots of fluctuations once they go live for trading."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNNHlYd1VsdkEyUFNVOVY1ZTJEOGNES3BPdWgwNE5UXzRmZEgwVVFZTWl0aHM1dDY0NEw2ekZWeTAyRjFPUFJKRHg0d21VeXRNVXBtcXlqdFFhMW9qUlRMX3lULWJvdVRmM0l4THJLQ09kNWRnMkpabjJMQ0hUcVZOOGVzYWprVVBuLUxMcmVWb2dpNExPYWViUGVvMHExd2RfbWdNRjc0UDZXZDRFSVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum powered by BlackRock: A €100 million alliance that changes everything - Cointribune EN",
        "content": "Sat 15 Jun 2024 ▪ 3 min read ▪ by Ariela R.\n\nThe world of traditional finance is in the midst of a transformation with BlackRock’s decision to favor public blockchains, especially Ethereum, for its blockchain-based financial products. This major shift marks a turning point in the adoption of public blockchains. It also opens the door to a deeper integration of this technology into the workings of financial markets.\n\nPublic blockchains, particularly Ethereum, represent the future (Source: Twitter)\n\nBlackRock and public blockchains: a new direction\n\nUntil now, BlackRock tended to favor private blockchains. However, experience has shown that public blockchains, like Ethereum, offer significant advantages in terms of transparency, accessibility, and governance.\n\nTransparency on Ethereum\n\nTransactions on Ethereum are visible to everyone, allowing investors to track capital flows in real-time and ensure the proper execution of operations. This increased transparency is essential for:\n\nstrengthening trust in blockchain-based financial products,\n\nattracting a broader audience of investors.\n\nAccessibility\n\nPublic blockchains (like Ethereum) are open to everyone. This allows anyone to participate in the network and interact with decentralized applications (dApps) built on them. This open accessibility fosters innovation and the creation of new financial products.\n\nGovernance\n\nEthereum and all other public blockchains are managed in a decentralized manner.\n\nExplanation: users have a say in the development and evolution of the platform. This participatory governance promotes accountability.\n\nBlackRock’s first tokenization project on Ethereum\n\nTo solidify its commitment to public blockchains, BlackRock launched its first tokenization project on the Ethereum blockchain.\n\nThis project involves converting a traditional investment fund, “Institutional Digital Liquidity,” into digital tokens based on Ethereum. These digital tokens, denominated in USD Coin (USDC), provide investors with transparent and secure access to portfolio diversification.\n\nBlackRock’s decision to adopt Ethereum is a strong signal of the growing maturity of the cryptocurrency market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPN1drQjY1dXhJdzBDTk56UDBRcmhuY0ZoS0xuUGY3SDZOQTdPQXlnTDBzenFfLUx5OVJNaVgxZ1k2MXNibnRXYUVOelFnWnB0cXdfTXh6TUZ6eTVpbWd3bEt6ZWNtMHRVQ2MtU2ZhZDB5TjhzVG1QemVyVXJrMDZaM2JacFRoM0ZtMnA3Vl9WSDJDckJCT3g2MHBVWUVlN3VaV0JQSVJ1SE10WGtZaXIxYVNxS1VBcTE5RXk2NE5oMjFoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum HODLers Scoop 298,000 ETH In 24 Ahead Of Spot ETF Trading - TradingView",
        "content": "Ethereum is under pressure at press time, tumbling roughly 15% from March 2024. As sellers press on, reversing all gains posted from May 20, on-chain data points to a bullish picture.\n\nEthereum HODLers Scoop 298,000 ETH In 24 Hours\n\nTaking to X, one analyst notes a spike in ETH demand, especially from permanent holders. Most likely, these permanent holders are institutions with deeper pockets and are willing to hang on. Unlike retailers, these entities can often choose to hold for longer and won’t be shaken out by market volatility.\n\nNewsBTC\n\nCiting CryptoQuant data, the analyst said these permanent holders, according to records, are responsible for the second-highest daily purchase. On June 12, when prices briefly rose, they bought a staggering 298,000 ETH. Impressively, this figure just falls short of the all-time high of 317,000 ETH purchased on September 11, 2023.\n\nIn light of this, despite the wave of lower lows clear in the daily chart, the surge in demand points to strong bullish sentiment.\n\nAlso, considering the amount of ETH scooped from the markets, it could signal that institutions, possibly hedge funds or billionaires, are beginning to position themselves in the market.\n\nThey appear to be taking advantage of the lower prices.\n\nAt press time, there is weakness in Ethereum, evident in the daily chart. Even with the bounce on June 12, bulls didn’t completely reverse losses of June 11. The dip on June 13 means sellers are back in the equation, and prices could align toward the conspicuous June 11 bar. www.tradingview.com/x/Vk7s6tvO\n\nFrom the candlestick arrangement in the daily chart, $3,700 is emerging as a resistance level. After the breakout on June 7, ETH has been free-falling to spot rates, actively filling the May 20 gap.\n\nIf the dump continues, it is likely that ETH, even with all the optimism across the crypto scene, will once more re-test $3,300.\n\nSpot ETFs To Begin Trading This Summer: Gensler\n\nWhether prices will recover from current levels or slip towards $3,300 remains to be seen. Overall, the market is upbeat, according to comments from Gary Gensler, the chair of the United States Securities and Exchange Commission (SEC).\n\nAppearing in a senate hearing, Gensler said the spot Ethereum exchange-traded fund (ETF), whose 194-b forms were approved in May, may begin trading at a tentative time in summer. BlackRock has already resubmitted its S-1 filing and is waiting for approval.\n\nIf the product is approved in the next few weeks, it will be a major liquidity boost for ETH. Like spot Bitcoin ETFs, institutions will likely channel billions to ETH, allowing their clients to get exposure."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNclEtXzlCZDg4UXZfRWt1WWZRUThKbHZycU5IbV9MdUVrVlE2ZG43N1BwQk9YdVZxR1lNLUZCdTlNN2lWVUpZU1NQb3J4blN0R3dvN2t0NU9QQ1hqNUZ3UUxMM3UyajhvbXJCczVGVW5BWkJYV2c5TXR0WEM5c1ZTemZuYjVRWVZJbHdvcWhodlU2Z2hQUm9DQ19paHZ5WlR3MklnV2pwZGJLTXlkV0RzX3E3WWxQU0RlY1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum options expiring: a $2 billion earthquake ready to shake the market - Cointribune EN",
        "content": "Fri 14 Jun 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe crypto market is bracing for potential volatility as Bitcoin and Ethereum options with a notional value of $2.06 billion are set to expire on Friday. This massive expiration could cause fluctuations in BTC and Ether prices.\n\nBitcoin and Ethereum Options Surge of $2 Billion\n\nThe crypto traders are in a stir as a true wave of Bitcoin and Ethereum options worth over $2 billion are set to expire today.\n\nAccording to data, approximately 20,276 Bitcoin options contracts representing $1.35 billion, with a very high maximum strike price of $68,500, are set to expire.\n\nSimultaneously, no less than 201,647 Ethereum contracts worth $709.76 million, with a maximum strike price of $3,600, are also due to expire in a timing that is not coincidental.\n\nThe put/call ratios, indicators measuring the balance between outstanding buy and sell options, are at 0.49 for Bitcoin and 0.36 for Ethereum. These levels below 1 suggest a predominance of long positions over short positions, a potentially bullish signal to watch closely.\n\nHowever, savvy investors will remain vigilant, as such massive options expirations generally translate into bouts of market volatility, at least in the short term.\n\nExperts’ Views on the Major Event\n\nAdam, a macro researcher at Greeks.Live, an options trading tool, shared his insightful analysis on the upcoming expiration. According to him, although the week is crucial for macroeconomics, the crypto market has recently experienced disappointing performances, with mainstream coins and altcoins dropping significantly.\n\nHe also noted that the implied volatilities of Bitcoin and Ethereum are currently at relatively low levels, offering buyers a high cost-effectiveness ratio. Adam suggested that traders prepare for the potential approval of an Ethereum Spot ETF by the end of the month, by planning in advance to buy options for the next month.\n\nBitcoin and Ethereum experienced price drops before this major expiration. BTC, which was trading at $71,643 on June 7, briefly fell to $66,254 on June 11 before rebounding to $69,945 on June 12.\n\nCurrently, Bitcoin is trading at $67,064, a 6% drop over the past week. Meanwhile, Ethereum has fallen by 7.8%, trading at $3,519.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQMmE0Z1VJQS1RdUZaOWVkWUk1TjhfYXBEOXN1VUlRWW9ySWNRejBoTm93ZjlWX1ZUREU2WXBTTGczNHJzT05fRXozWk13RHFqeXdxNVhJY3ZocW5XNmFOcXFtd05WeTc0MlZySkR1eGdOS1RRblJwTThjd0RZRDVEZE95Vjh2OS16aFlvSVlB0gGTAUFVX3lxTE9lSlBpU2diTFBhakhxR19aUXhSSHFEejNTUkpVYWV3R0FLdm9iQVplakZhNUlLWk9BTmU1RmhMLXNfemozUkdsU2theWstQlRrSnlFTlVoZzJhNGpraEdNVy0xZkpMTm4wU0o5cDdmSnJwV1J5Sno0MGJyX2YzTEpEd216cmszb3pJTjJyX0J5b2x0aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum & UNI Price Soars Amid $20M Accumulation, Rally To Sustain? - CoinGape",
        "content": "Ethereum and Uniswap prices have grabbed the crypto community’s attention with slight recoveries driven by significant accumulation from a wallet linked to Amber Group. Notably, the wallet’s substantial buy-up, totaling around $20 million, has sparked optimism about potential price movements and the broader implications for the market amid current volatility.\n\nSo, let’s take a look at the recent accumulation pattern and see the potential reasons that might keep the momentum consistent.\n\nadvertisement\n\nEthereum & Uniswap Price Soars Anticipation Amid $20M Accumulation\n\nA wallet related to Amber Group made waves in the cryptocurrency world by amassing $20 million worth of Ethereum and Uniswap. According to the on-chain transaction tracking platform Lookonchain, the wallet withdrew 987,053 UNI, valued at $10.6 million, and 2,638 ETH, worth $9.2 million, from Binance within just three hours today.\n\nMeanwhile, this large-scale accumulation has fueled a slight recovery in both Ethereum and Uniswap prices. Notably, the news has generated significant buzz among investors, eager to see if this momentum will be sustained in the face of a fluctuating market.\n\nMarket analysts suggest that this substantial purchase by a major player like Amber Group could indicate strong confidence in these assets’ future prospects. However, some caution that while such accumulation can trigger short-term price increases, the challenge lies in maintaining this upward trajectory.\n\nNotably, the broader market dynamics and ongoing volatility play a crucial role in determining whether these gains will hold.\n\nAlso Read: Shiba Inu, Chainlink, Ethereum Exchange Reserve Plunges, Price To Recover?\n\nWill The Rally Sustain?\n\nEthereum’s recent price recovery has been buoyed by expectations surrounding the U.S. Spot Ethereum ETF approval. The SEC has already accepted the 19b-4 filings for Ether ETF as of May 23. Besides, SEC Chair Gary Gensler has recently hinted that the approval for Ethereum Spot ETF could come by the end of summer, adding to market optimism.\n\nIn addition, a senior Bloomberg ETF analyst anticipates that the Spot Ethereum ETF might get approved around July 2. This potential timeline projection has further boosted Ethereum’s market confidence, making it a focal point for investors betting on its sustained growth.\n\nSuch regulatory advances are crucial, as they enhance Ethereum’s appeal to institutional investors, driving potential price support and long-term growth.\n\nOn the other hand, Uniswap has shown significant growth in its Layer 2 (L2) solutions. According to a recent X post from Uniswap Labs, the protocol’s all-time L2 volume has reached $300 billion.\n\nNotably, the timeline to reach each $100 billion milestone has accelerated dramatically:\n\n22 months for $100 billion.\n\n10 months for $200 billion.\n\n3 months to achieve $300 billion.\n\nThis rapid growth underscores increasing user adoption and heightened transaction volumes on Layer 2 (L2) platforms, reflecting a robust uptrend. Besides, this impressive growth trajectory has strengthened investor confidence in Uniswap’s continued expansion and the potential rise in demand for UNI tokens.\n\nAs of writing, Ethereum price soared 0.50% and exchanged hands at $3,533.98, with its trading volume soaring 13% to $16.13 billion. On the other hand, Uniswap price noted a surge of 1.91% to $10.96, while its volume soared more than 34% to $360.5 million.\n\nNotably, as of writing, Ethereum Futures Open Interest rose 2.59% to $15.80 billion, while Ethereum Options Open Interest surged 1.63% to $6.38 billion. Simultaneously, Uniswap Futures Open Interest rose 3.61% to $122.17 million.\n\nAlso Read:\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1HTWlveXdpUkdlNHJ4bWF4RnlveGRlaU5CeTJqMFpYbkNKTFJEWm9TekFCeVlWU1ZPenhuU0VfWEg1ZDhCMUFwcXVZT3BhcEYyTE5jQm9mWGpUX01QSGhvdS16S29DVmhIY3ZkTmM0eXJTZDgxb1RxMGp6WVjSAYIBQVVfeXFMUFYwWjJDR1EwdktWVlpZdlBOZE9IWlRPdHRRQm9BZGZYRTRaQ2lLMzhZTy1EM3BBeGhHUkl2VFNZVDFVRm9QMlR3cGo5TzhoZmdpb050VEF3MjM5d3BzWmRPR002NVdrVFNhTFRZVEcxZkhPdjdiUlBoZW1qSVdXc0ZLZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs To Make Trading Debut In July - Here’s The Date | Bitcoinist.com - Bitcoinist",
        "content": "Following the approval of the Ethereum spot ETFs (exchange-traded funds), potential issuers have had to wait for the trading debuts of their products. This has led to much commentary and speculation on the possible date for the final approvals of the Ether ETFs.\n\nBloomberg analyst Eric Balchunas is the latest personality to predict when the Ethereum spot ETFs could begin trading in the United States.\n\nWhy Ethereum Spot ETFs May Start Trading By July 2\n\nIn a recent post on the X platform, Balchunas put forward July 2, 2024, as the new projected date for when the spot Ethereum exchange-traded funds could begin trading. This update is based on the Securities and Exchange Commission’s (SEC) response to issuers on Friday, June 14.\n\nAccording to the ETF expert, the SEC made “pretty light” comments to the issuers’ S-1 forms, with no major issues to address. Balchunas also mentioned that the commission expects issuers to reply to these comments in a week.\n\nThe SEC has approved the 19b-4 forms for eight potential issuers, notably BlackRock, Fidelity, VanEck, and Franklin Templeton. The agency would also need to greenlight the S-1 forms for the Ethereum spot ETFs to go live.\n\nBalchunas wrote in his post on X:\n\nDecent chance they work to declare them effective the next week and get it off their plate before the holiday weekend. Anything is possible but this is our best guess as of now.\n\nNote: our previous over/under was July 4th so this isn't major shift but 1) we startted to feel like it would take longer so this is kinda good news and b) we basically decide the over/under on where are most torn 50-50 on where to bet and July 2nd is that date right now. — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nRecently, SEC chair Gary Gensler said to senators during a budget hearing that the final approvals for the Ethereum spot ETFs should be finished by summer. The final launch of these products is expected to attract significant capital inflow into the second-largest cryptocurrency and the market.\n\nEthereum Demand On The Rise Ahead Of ETF Launch\n\nThe latest on-chain data shows that there has been an increased demand for Ethereum, especially from permanent investors. This revelation is based on a significant spike in CryptoQuant’s Permanent Holders Inflows metric.\n\nPermanent holders, or hodlers, refer to participants who can choose to hold a cryptocurrency for longer periods and won’t be taken out easily by market volatility. According to the on-chain analytics firm, this class of investors scooped up 298,000 BTC on Wednesday, June 12.\n\nConsidering the amount acquired by the permanent holders, it is likely that institutions are responsible for this acquisition, as they try to position themselves well in the market ahead of the impending launch of the Ethereum spot ETFs.\n\nETH price approaching $3,600 on the daily timeframe | Source: ETHUSDT chart on TradingView\n\nFeatured image from Bernard Marr, chart from TradingView"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPSUd4aHBUX2tPRW5vSmpzallFNHkwcXhjTVI5Mk1XUXRXbDQxZ2I2Nk1EUUFkR0ZObnhOOUlNVjFhcy1hZlJZS01BcVVfNDhYOUhqa2R3dG9XWUdYQTZ3WHlMNkt6N21BZHdrRVVfYW1XSFFUUnVETmRiOHFsOElqaEdvdFFHTDhTZTRkb0laQ1AxaHZoZVHSAZsBQVVfeXFMUDdVdUFmRDEwcEd4VlBTVG9mSzNHVlBjX0dBci1XUDJRcWJQNFl3azdtTk1XS2RGenVpVEswVVZyQ1FHSUR1d2Q2a19WYkFqdXdHRGJWTVdOcXI0TFVRclhPT0F6ekhPbDlNZm45S2VYZ0kxSVRrbFIyYlJIeVZmeDNSczAwLTBIZ3VFcjRuajNmTUphWDBUbl9WVnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF update: ProShares steps up with S-1 filing as ETH slides - AMBCrypto News",
        "content": "ProShares filed an S-1 to launch an Ethereum ETF.\n\nETH’s price continued to decline along with its network growth.\n\nOver the past few days, Ethereum [ETH] fell victim to the larger bearish sentiment prevailing in the market and witnessed a correction.\n\nIt’s raining ETFs\n\nHowever, financial institutions did not lose any enthusiasm and ETF applications continued to be submitted to the SEC.\n\nETF issuer ProShares took a significant step towards launching its spot Ethereum ETF by filing an S-1 registration statement.\n\nAccording to the filing, Coinbase Credit will act as a critical partner by providing ProShares with a trade credit line.\n\nThis essentially allows ProShares to borrow Ethereum and cash for certain transactions that go beyond their immediate trading balance.\n\nMeanwhile, Bank of New York Mellon (BNY Mellon) will take on the role of transfer agent. This means they’ll be responsible for processing both purchases and redemption orders for the ETF, essentially keeping track of who owns shares within the fund.\n\nThe filing also clarified some previously announced roles. For instance, BNY Mellon will also serve as administrator and cash custodian, while Coinbase Custody will handle the safekeeping of the Ethereum assets.\n\nIt’s important to note that the filing allowed for some flexibility in these roles.\n\nWhile BNY Mellon’s administrator role is initially set for a two-year term with annual renewals, ProShares has the option to make changes after that period.\n\nSimilarly, the ETF can add or remove custodians for both Ethereum and cash, as well as switch prime execution agencies at any time. Interestingly, Coinbase also retains the right to step down from its role as cash custodian.\n\nHow is ETH doing?\n\nDespite the enthusiasm showcased by ProShares, the price of ETH continued to decline. At press time, ETH dipped below the $3,500 mark and was trading at $3,497.81.\n\nEven though the decline in price was significant, the overall trend for ETH looked mostly positive.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nSince the 19th of May, the price of ETH moved upwards while exhibiting higher highs and higher lows, indicative of a bullish trend.\n\nHowever, AMBCrypto’s analysis of Santiment’s data revealed that the network growth for ETH had declined along with the price, indicating that new addresses were losing interest in ETH."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPQTljNEtqd3Zwa3RZdkRXSm5rSnJjYWw1RnNsZ3hwandNU2ItMEd6R2hpdnp3MHVmQl9zMUlJeUE0Z1M5TlZ6Nk84enk3cmJVVFVlbGxDU0pmeWt4cE1MNHotdFRrajJwd1hLcVdyMjIyWHIxMy1HTkQ0NWVCajJTVnVtM1RMZDdvbFpCRVFBUXFaRVVFdDAxRtIBngFBVV95cUxNOUdDVDRsQVVUV1JWcUZodTBLeXVZZW00bHR6NFlSWW5hQjZrSXlPRl93LVJBbGtWZlRZZlVxdmxxZDlXMW5hZHdrbm5tU3JwUVZKajE4MWVRenJ5RjU5SnIxMzVHb2s3OWlyRHY1bTZTRFItMExkQkZOWTVCdnh4R25YMTgydEN4b3JFOWtCNW5vbFdWQXYwWmYtVjlYdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Permanent Holders Scoop 298K ETH In A Day, ETH Price Rally Soon? - CoinGape",
        "content": "All eyes are currently on Ethereum as the U.S. Securities and Exchange Chairman Gary Gensler stated that the approval of the spot Ethereum ETF will happen by the end of this summer. Although this news brought some optimism to the ETH community, it has yet to reflect in the Ethereum price which is trading under $3,500 as of press time.\n\nEthereum Demand Skyrockets\n\nJulio Moreno, the head of research at CryptoQuant stated that there’s a significant surge in the Ethereum demand currently in the market. As per Moreno, the permanent ETH holders bought a staggering 298,000 ETH yesterday, making this the second-highest daily purchase on record.\n\nadvertisement\n\nThe record for the highest daily buying remains on September 11, 2023, as of now, when the ETH holders scooped 317,000 ETF. However, even the current spike in Ethereum demand highlights the growing interest and confidence among long term investors in the crypto market.\n\nThe massive surge in demand for Ethereum has come as the ETH price has corrected more than 9% in the past seven days. However, as we saw, the on-chain metrics continue to show strength for the world’s second-largest cryptocurrency.\n\nAs reported by CoinGape, Ethereum’s withdrawal from the Coinbase exchange surged to a massive 300K, thereby making it one of the largest outflows in 2024. With this, the total value of the Ethereum withdrawal has surged past $1 billion.\n\nETH Price Action Ahead?\n\nDespite the positive on-chain indicators, the ETH bulls haven’t gained enough control to trigger a rally past $4,000. Currently, Ethereum is trading just under its crucial support zone of $3,500.\n\nLast time, the ETH price dropped under $3,500 back in April, it led to a 25% decline hitting the low of $2,814 by May 2. All eyes will be on how swiftly the SEC chair gives a go-ahead to the spot Ethereum ETF to go live for trading. This is likely to infuse major capital inflows as we saw after the approval of the spot Bitcoin ETF.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQX2NjZDBidTJkY25hMWVOdTVWclluM3V3ZXFTeXA1bjhQUUtnR1JqMk1zcTRkbkQ1dTlxalpvRmJnWHB1V1F1OUQ0MmJGOElTaXU2azdteU9aMFA2LW4yOGI4RGgwTTFFRnlDVmNITU1RSjhTbHViSE5haDgyb0twVEZKUmpMZ1NvM0lMRXFLZHNwRUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "3 Ethereum Crypto Losers of the Week: Should You Buy, Sell, or HODL? - CoinGape",
        "content": "With the global cryptocurrency market going through a volatile week with major price changes, investors must decide whether to buy, sell or hold (hodl). This article analyses three Ethereum tokens, Wormhole (W), Floki Inu (FLOKI), and Worldcoin (WLD), which have all seen significant losses during the week. This article will delve deep into details about these top Ethereum crypto losers.\n\n1. Wormhole (W)\n\nLosses: 34.74%\n\nadvertisement\n\nWormhole (W) has recorded 34.74% in losses for its investors in the past week, to trade at $0.4585 today. This price performance has resulted in a market cap of $826.01 million.\n\nExamining the EMA indicators shows a dominant selling sentiment, as both the Exponential Moving Average (EMA) and Simple Moving Average (SMA) indicate a downward trend in different time frames.\n\nThe bearish trend is supported by the MACD Level, which shows selling pressure with a negative value. Moreover, the RSI value indicates a neutral sentiment, suggest that W is neither overbought or oversold.\n\nFibonacci pivot points indicate that there is a level of support at $0.3116 and a level of resistance at $0.7879. Based on the current price, there is a notable gap to the closest support level, indicating possible additional decreases prior to a change in direction.\n\n2. Floki Inu (FLOKI)\n\nLosses: 28.52%\n\nRecording a market cap of $1.97 billion, Floki Inu (FLOKI) has experienced significant price fluctuations during the week. The value of FLOKI declined by 28.52% over the past week, to appear on the list of Ethereum crypto losers today, with a price of $0.0002061.\n\nThe technical analysis of the meme coin mainly a bearish sentiment, as both EMA and SMA indicators signal a downward trend.\n\nThe negative value of the MACD Level supports this belief by showing selling pressure. Additionally, the RSI reading indicates an oversold condition, potentially presenting a chance for investors to buy.\n\nFibonacci support level is at $0.0001608803 while the resistance level is at $0.0003310183. FLOKI is nearing its support level, indicating that it could potentially stabilize in the near future.\n\n3. Worldcoin (WLD)\n\nLosses: 21.77%\n\nWorldcoin (WLD) finalises the list of the top Ethereum crypto losers, trading at $3.49. This demonstrates a decline of 21.77% in its price over the past week, resulting into a market cap of $838.78 million .\n\nThe technical analysis shows mostly bearish sentiment, as both EMA and SMA indicators are signaling a downward trend.\n\nThe negative MACD Level reinforces this view by showing selling pressure. Moreover, the RSI value indicates that a potential buying opportunity could be nearing as the token nears oversold territory.\n\nFibonacci support can be seen at $0.3116 while resistance is located at $0.7879. A price closer to the support level indicates potential stabilization or recovery.\n\nFinal Thoughts\n\nThe recent market crash has resulted in significant opportunities and challenges in the crypto market, including these Ethereum crypto losers of the week. The strong bearish signals for Wormhole (W) indicate a recommendation to sell. Floki Inu (FLOKI) warrants a hold until more clearer signals become apparent due to its mixed indicators. Worldcoin (WLD) has the potential for a speculative buy despite its current downward trend, as it may rebound.\n\nInvestors must always assess their risk tolerance and do additional research prior to making any investment choices,. Keeping up-to-date and being adaptable are essential to successfully navigate the unpredictable crypto market."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxOZjIwVEZjVXZkaHp4bTFTczl3TTlyaWJEUENsRmN6RkhmUURLQnluOTFsSVlGUG9UWlQxSG5mX3NpU21JY0E1LTI1YThpRHdkX0hJS28tcXlYZjhTd0p1TVV5dVVBRDlJRllPWjV5SVpDVHA4akVucEhoRTZVbWtaYlpuamVCekFoTl9hWHNVZ2szemFxU1pXUXpSZHFxcWpxeU9BVVhrc2NfVXlmRTBwY0VyX2Vla0NBdEJQYnExRFJCcHAySEFHbVJQdjlOQ2VCekNKZXFadWdnaklUbmk0clBiMU14Z0xtUEd0dWhn0gHzAUFVX3lxTE5CMzRyTFdtaDRkdkpKWEdISlhzSF9TRERaU0NEd0x0OW9CUjBYNTl4VUFsd3JHaGJHTnZVeUE1M3QxaGNWQVZmTHpFN2NJcnh4R2VsV2hleTlzRGVKZ0lqc0hLYkl2M2dOaVNyeDJyMGdsQW85VU00dkdEQ2FnZXB4MEJrUk9IZWlNWnN4dFZjb1R0TG1tSHgzUVZHcUZDdkNhelZTa3hLMlBuS3Y4c0hiR016bzE4Zy1xTmJzWjE0NWdsQVl2Mld6ZXBrazBTVEtVTlZ6eDJzb3NHNkx5a0s2WWdMa1J5NjB2LW5tOTMtXzVScw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin braces for potential short-term correction - FXStreet",
        "content": "Bitcoin price daily candlestick closes below the weekly support level of $67,147.\n\nEthereum price is weakening and could retrace to its immediate support at $3,321.\n\nRipple price fails to close above the 50-day Exponential Moving Average.\n\nBitcoin (BTC) price may initially dip before experiencing a rally, and Ethereum (ETH) and Ripple (XRP) are likely to follow suit, dipping before their potential rallies.\n\nBitcoin price could sink deeper amid corrective mode\n\nBitcoin price daily candlestick closes below the weekly support level of $67,147 on Thursday.\n\nBTC could have a short-to-mid-term downward correction in the coming days, tagging the midpoint level of the price imbalance between $63,118 and $64,602 at $63,813.\n\nThis midpoint level also roughly coincides with the 50% retracement level at $64,240, calculated from the swing low of $56,523 on May 1 to a swing high of $71,994 on May 21.\n\nIf BTC bounces off $63,813, it could rally 12 % to reach its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if BTC breaks and closes below its daily support level of $60,800, the bullish thesis could be invalidated, leading to a 4% crash, its weekly support level of $58,375.\n\nEthereum price gears up for further downward adjustment\n\nEthereum price crashed 11% in the last seven days as it failed to close above $4,000.\n\nETH could have a short-to-mid-term downward correction in the coming days, tagging in the $3,279, the 61.8% Fibonacci retracement level, calculated from the swing low of $2,864 on May 13 to a swing high of $3,984 on May 27.\n\nThe $3,276 level roughly coincides with the midpoint of the price imbalance between $3,146 and $3,498 at $3,321.\n\nIf ETH bounces off $3,321, it could rally by 20 % to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nHowever, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 9% crash to the previous support level of $2,600.\n\nRipple price braces for a correction\n\nRipple price declined 4% on June 7 and made a daily low of $0.450 after failing to close above the 50-day Exponential Moving Average (EMA) at around $0.527.\n\nRipple price could have a short-to-mid-term downward correction to its recent low at $0.450.\n\nIf this support level holds, XRP could rally 1 % to $0.519, the 50-day EMA level.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple daily candlestick closes below $0.450, XRP could crash an additional 7% to its previous support at $0.419."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSGhUODZMVEwtb21wSWM3b0plbk9aeEQtMjV2YVpsZ09hRXMwTzRUdXZqOVdCM2pxRDVSZkJoOC10NVJhVUgwcVFaem9YRXVSeGk4WTQ2QWlIV0ZoQ3ZXTWhpZTdGSXN3cGMzaVJmanBmTzlXVzdvbGZPNlFrYTdHSEFqbU9Zd0lvMG0zakx2UdIBlAFBVV95cUxPWng4VlUwLTBGTjlVSkxtaFZmQ1Fna0ZiUE94REtxY185dGdqSkVBcWdzekpCRTdnaHM4blgtSHBpMFkzWkl6Yi1jWGZzSkxBemJEdU9DODVXOUJfaFVUcV9UM0VBVTJkX3lnMEN5X0M5Y3VocjByeXBSMDdiU0hkTktFWVd3VEpkUjdWLUFLdFdjeXI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs by 2 July? Analyst makes this bold prediction! - AMBCrypto News",
        "content": "Analyst’s remarks hinted at Ethereum ETFs possibly starting on 2 July\n\nBitcoin seems to be underperforming ahead of ETH ETF approval\n\nFollowing SEC Chair Gary Gensler’s promising remarks (“sometime over the course of this summer”) about the approval timeline for Ethereum [ETH] spot Exchange Traded Funds (ETFs), Bloomberg’s Senior Analyst Eric Balchunas is in the news today after he specified a potential start date.\n\nBalchunas prediction: Reality or no?\n\nAccording to Balchunas, Ether ETFs could potentially start trading in the United States as early as 2 July. He said,\n\n“We are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they’re pretty light, nothing major, asking for them back in a week.”\n\nThis news has sparked optimism within the cryptocurrency community, especially regarding Ethereum’s upcoming market opportunities.\n\nIn fact, the analyst also alluded to the fact that the aforementioned launch may be timed to align as closely as possible with 4 July, the United States’ Independence Day.\n\n“Decent chance they work to declare them effective the next week and get it off their plate bf holiday wknd. Anything poss but this is our best guess as of now.”\n\nBitcoin ETF vs. Ethereum ETF\n\nThe delay in approving ETH ETFs stands nowhere close to the lengthy journey of Bitcoin [BTC] ETFs’ approval process.\n\nAll the way back in July 2013, Cameron and Tyler Winklevoss, founders of the Gemini crypto exchange, filed their initial application with the SEC to establish a spot Bitcoin ETF.\n\nFast forward to January 2024, after nearly a decade of regulatory scrutiny and multiple applications, the SEC finally approved 11 Bitcoin ETFs.\n\nDrawing parallels between the approval processes of Bitcoin and Ethereum ETFs, it is noteworthy that after the BTC ETF’s approval, Ethereum saw a significant rally, rising by 9.1% while Bitcoin underperformed.\n\nAnd now, with the anticipation of the ETH ETF approval, Ethereum, the second-largest altcoin, stands out amidst a market downturn.\n\nAt the time of writing, Bitcoin and many other cryptocurrencies were flashing red candlesticks on their daily charts. On the contrary, Ethereum was in the green following a modest hike of just over 1%.\n\nAdditionally, according to a recent report by Farside Investors, spot BTC ETFs saw two consecutive days of outflows on 13 and 14 June, totaling $416.1 million.\n\nPopular analyst Willy Woo pitched in to comment too. He stated,\n\nFuture remains uncertain\n\nOverall, while the dynamics are consistently changing across the crypto market, it is still too early to definitively conclude whether investors are moving away from Bitcoin towards Ethereum.\n\nWorth noting, however, that AMBCrypto’s analysis of Santiment revealed that the social dominance metrics for both ETH and BTC were moving north. Despite this, the Relative Strength Index (RSI) remained flat, indicating no clear signs of either bullish or bearish momentum."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOby1TampIamFtZ002UjVoZ3pVMnhQSHFDYm9mVGhCSlhoZWc4S3YwcTRwMGN2T05KOVROZGJ3dFlCQ2doZ1Z0UkpHSFRBWUFrdENfcHJDMHo3NG00NVJxTWFWbVlpRjBXXzhvM2JiaVphbTJrT2VWaE5DZ2U1N3hWMU0tWk5Famo2dEHSAY8BQVVfeXFMTnVVbGN0Q2dYWkxqcFNZOHBGeG4tS1RRMmkyTnR6UnE0SDBQXzA4ME5rbUFmLWs0Zmt1VGdKaVVRVXc2bVBmanpCZkdVUTJHcFFDUWJkRnN2aHdjbmozclZfU3FLcE11dkVVNk1RbUs3VGZFOXl2SzNtY2JxeTVNN1l3OXZOM0hsX2lwZkRzZTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Why 298,000 ETH tokens were bought in just 24 hours - AMBCrypto News",
        "content": "Ethereum experiences its second-largest buying day, with long-term holders accumulating significantly.\n\nMarket indicators show mixed signals, with decreases in open interest and exchange reserves hitting an eight-year low.\n\nEthereum [ETH], the second-largest cryptocurrency by market capitalization, has recently exhibited some interesting market movements.\n\nDespite an 8% decline over the past week, Ethereum saw a slight uptick of 0.3% in the last 24 hours, bringing its current trading price to $3,519.\n\nThis minor increase comes during a period of overall market uncertainty, particularly following the approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission in May.\n\nLong-term holders capitalize on market dips\n\nAmid these price adjustments, Ethereum has experienced a significant surge in long-term holder accumulation. According to Julio Moreno, CryptoQuant’s head of research, Ethereum just witnessed its second-largest buying day by long-term holders.\n\nOn June 12, about 298,000 Ethereum tokens, valued at approximately $1.34 billion, were purchased by these steadfast investors, capitalizing on a slight 2% price dip within the same 24-hour period.\n\nThis noteworthy accumulation was not far off from the record set on 11th September, 2023, when 317,000 Ether tokens were acquired as prices dipped below $1,600.\n\nThis pattern of strategic buying during price drops highlights the confidence long-term investors have in Ethereum’s value.\n\nFurthermore, this trend corresponds with an increase in large transactions over $100,000, as shown in IntoTheBlock data, where such transactions rose from below 4,000 earlier in the week to over 6,000\n\nThis indicates active accumulation by whales regardless of the prevailing market conditions.\n\nMarket caution and technical outlook\n\nHowever, contrasting this bullish accumulation activity, Ethereum’s market metrics such as open interest and trading volume present a more subdued outlook.\n\nOpen interest in Ethereum has decreased by nearly 2% to $15.41 billion, while trading volume saw a significant decline of 25.77%, now standing at $24.19 billion. These metrics suggest a cautious stance among some market participants, potentially anticipating further price adjustments.\n\nOn the technical front, Ethereum’s inability to surpass its March highs has activated a sell setup on its daily chart, hinting at possible continued downward pressure.\n\nHowever, a shorter-term perspective from the 4-hour chart suggests there might be a temporary rise to around $3,800, potentially providing liquidity for an ongoing downtrend.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIn another vital aspect of market dynamics, the amount of Ethereum held on exchanges has hit an eight-year low, as noted by AMBCrypto.\n\nThis reduction in exchange-held Ethereum, coupled with the launch of spot ETFs, may lead to a significant supply shock, which could, in turn, trigger a sharp price increase."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOV3ZiMTk4Q3hzRkhOWkhnaENEV2ZybkpjMFBrYk9KR3JEdWllWXZQMjBacHVKRVJUS1dpNUk5X2FiSFZtUC1CZk1NZEZSamFiSzJrakFzOEUwNnA2T1NZcm1LSnVYYkxCVUFSWHdyUHFBLUxFNXRWdmRDQ0VYZXozRTRESDR1d19jcXNYQXV6dW1WWEgxYW1iQUFoX2xfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Lists PIRATE Token from Pirate Nation Game on ETH - Crypto Times",
        "content": "PIRATE- the native token of the latest crypto game “Pirate Nation” was listed on Coinbase, shortly after its debut on Thursday. The latest inclusion of PIRATE token showcases the growing intersection between blockchain technology and gaming as the industry gains momentum in the crypto space.\n\nThe ERC-20 token, named PIRATE, operates on the Ethereum Mainnet and functions as a utility token within the game.\n\nCoinbase will add support for Pirate Nation (PIRATE) on the Ethereum network (ERC-20 token). Do not send this asset over other networks or your funds may be lost. Transfers for this asset are available on @Coinbase & @CoinbaseExch in the regions where trading is supported. — Coinbase Assets 🛡️ (@CoinbaseAssets) June 13, 2024\n\nManaged by FarmVille co-creator Amitt Mahajan, Proof of Play received backing from a16z crypto, Anchorage Digital, and Naval Ravikant in a $33 million seed round last September. “We believe that Proof of Play points is a way to recognize & reward players for their participation in the Proof of Play ecosystem,” Mahajan stated.\n\nThe availability of the “Pirate Nation,” along with other main products such as “Shrapnel” and “Illuvium” points to a rising trend in the web3 gaming sector. Consequently, even basic 2D titles like ‘Hamster Kombat’ are rising, dictating large player numbers.\n\nThe PIRATE Ethereum network generated a contract address: 0x7613C…f6f8DC. Coinbase advises against sending PIRATE over other networks to avoid potential loss of funds.\n\nTrading will commence once liquidity conditions are met, with support for PIRATE subject to jurisdictional restrictions in some regions."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNXZucUx3VUVKTS1sSVcxOG5MQ0VmX2pYSEVuMHpQV2NKemhONFkxeV9BYUpDVWxva1RCRmV1YzRmRTAtT3hkdGNDMG8tQTRES0dBZnIzanl6R1ZEczVMYVQ1MzVRWDJUc2RNUGFLZXVZRTI2Sy1FZk1FR2RmdXhXblpIYzZ3VkxSQnBZWkxINGRoRDBTOWRUNVYxMjLSAaIBQVVfeXFMTmx6TlRYWVRNTTdhQ3l5cEFkU2JDcmpaQ3lMWUVjckxRcE95NUhQNGNUTkVERk9hNmJLeS16bUdRZVlabmVEUmlmazFjdE5MUzlTMzZDX1FLN2FNY1JJVjhsLS1ZX1ZBRHlOdG9IdG5EZm9RUU9idmhSWTRHU3RnRi00aUt1enB0enliNTdQUDJ0dFJUWTFpM3JpX0NUUnFISy1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Altcoins: Shiba Inu, Chainlink, Ethereum Exchange Reserve Plunges, Price To Recover? - CoinGape",
        "content": "In latest developments, the top 10 exchange wallets for altcoins like Shiba Inu (SHIB), Chainlink (LINK), and Ethereum (ETH) have seen a significant decrease in their holdings since May 27, 2024. To be specific, Shiba Inu’s exchange supply has shrunk by 2.4%, Chainlink by 2.9%, and Ethereum by 8.6%.\n\nMoreover, such reductions in exchange reserves are generally interpreted as bullish indicators by traders. Hence, a potential for price recovery could be witnessed for SHIB, ETH, and LINK. Currently, all these cryptocurrencies are grappling with a downtrend.\n\nadvertisement\n\nShiba Inu (SHIB) Price Analysis\n\nAt the time of writing, the SHIB price was $0.00002175, up by 0.38% on Friday, June 14. This price movement places Shiba Inu at a pivotal point, encountering a significant barrier at $0.000022. If Shiba Inu can surpass this resistance, it may climb to $0.000025, with the possibility of reaching $0.00003.\n\nOn the other hand, increased selling pressure could push Shiba Inu down to $0.000021, and it might fall further to $0.00002 if market sentiment deteriorates. Whilst, technical analysis indicates that SHIB might be entering a consolidation phase. The MACD indicator reveals a convergence towards the signal line, hinting at a possible slowdown or reversal in momentum.\n\nWith the MACD line currently beneath the signal line, it signifies weak bullish momentum. Currently, the Shiba Inu RSI is at 37, suggesting a neutral market stance, as SHIB is neither overbought nor oversold. However, the RSI is nearing 30, which signals a oversold condition is looming. In the aftermath of such conditions, the price generally rebounds.\n\nMoreover, the reduction in Shiba Inu supply due to decreasing exchange reserve and frequent burns could also catalyze a rebound. On the flip side, most oscillators and moving averages on the daily chart are issuing sell signals. The 50-EMA being above the 20-EMA suggests a potential downward trend.\n\nAlso Read: Shiba Inu Coin Bull Run Ahead As SHIB Burn Rate Spikes Further\n\nChainlink (LINK) Outlook\n\nAt press time, Chainlink is traded at $15.32, down by 0.90%. This decline has triggered long liquidations, which account for over 95% of total liquidations, signaling a short-term price decline. However, the diminishing exchange reserve could lead to a rebound in the long term due to a reduced supply.\n\nAs exchange supplies decrease, it often points to accumulation by investors, which can drive prices up as supply dwindles. Moreover, the Chainlink price has sustained a profit of over 14% in the last 30 days despite the recent bearish turn. Hence, it could mirror the momentum for a reversal as the LINK open interest has also surged.\n\nEthereum (ETH) Prospect Following ETF Approval\n\nAccording to Santiment, Ethereum’s exchange supply has seen the most significant reduction among the three cryptocurrencies, dropping by 8.6%. This substantial decrease is viewed positively by bullish traders as it may indicate strong accumulation and potential for future price increases.\n\nRecently, Ethereum’s market narrative is also being shaped by regulatory developments. Crypto analyst Michaël van de Poppe highlighted a statement from SEC Chair Gary Gensler, suggesting that an Ethereum ETF might be listed during the summer. This anticipation signals a final correction before a substantial price surge, according to Poppe.\n\nThe approval of Spot Ethereum ETF S-1 filings is expected to have a profound impact on ETH’s price. It could potentially push the ETH price above $4,000 immediately after the ETF listing. Furthermore, Standard Chartered has projected that this development could even drive Ether’s price to exceed $8,000 by the end of the year. Such optimistic forecasts are underpinned by the expected influx of institutional investment following the ETF’s approval.\n\nAlso Read: Whale Heavily Bags SHIB, ETH, CRV, & Others, What’s Next?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOZVJZaDl6cDlweVFCQXdubFhZVEp5OVg4dWlMR0FjVGpzX0Y3aldtM04taUVtTkFmcFhwSGFMZ0J6ZVpNMXVSdEU4UGRENzJ6bU5DMFcxT2V6R29GWmp1aHZ5ck1adjgxVVg3MTVRZDJvWEtoRzdDMkFtN2JGSWZSbXMwR0RQNDctVGpiak10Y2FQTGY4S3pKd3dqbkfSAaQBQVVfeXFMTTFPVGhha2lZM0VZSXdCT3BlSmZVZFZ6OG5vXzQ0aFFUdFdBWHdWeGRnZmhFUzVVSlJKTnZqSGFhdkRadmx1MFRfSFJvSVU2anppSzlSdzRZWVp0dHNDWDJZUmVCUmZ5ekx3NnZGYko2alVDNHZURm1qM1VpeS1tZzVzeEhyZGx3U0FkT0ZyNzNpbnR4ME95Ry1wRXN0d1ljVTJSYlY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Notcoin Posts 10% Gain as TON Daily Active Wallets Match Ethereum Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTelegram-based clicker game Notcoin (NOT) is the top gainer out of the top 100 crypto tokens, after leaping 10% in the past 24 hours. This comes amid The Open Network (TON), the blockchain that Notcoin uses, matching Ethereum for daily active wallets.\n\nNotcoin has racked up a player base of 35 million users, hitting a peak of five million daily active users back in March. But it wasn’t enough for TON to flip Ethereum’s daily active wallets. It wasn’t until May 17 when TON flipped Ethereum for the first time.\n\nThe two networks traded places a couple of times until June 2 when TON led the charge for nine consecutive days, according to Artemis Terminal. Since June 10, the pair have been neck and neck. At the time of writing, TON is currently trailing by only 4,000 daily active addresses.\n\nIn turn, TON is up 5% in the past 24 hours and 5.5% over the past week, according to CoinGecko data.\n\nAD\n\nAD\n\nThe Open Network has had a good 2024. After the success of Notcoin, a slew of new Telegram-based games launched. And the team has said it has plans of releasing a token on the network.\n\nRecently the clicker game Hamster Kombat hit 100 million players, claiming the crown for the single largest Telegram channel. Now the game is planning a tentative token launch in July, which will see players convert in-game points to crypto tokens.\n\nTapswap and Yescoin are two new Telegram games looking to launch tokens on TON. The former, which claims 50 million players, previously offered Solana wallet integration but is now looking to launch its token on TON. While the former, Yescoin, is looking to bring its 18 million users to The Open Network, with over 6 million already connecting their wallets.\n\nThis explosion of new games launching with tokens on the horizon has led to TON becoming the 10th largest crypto token by market capitalization, according to CoinGecko, beating out Cardano for the spot.\n\nAD\n\nAD\n\nEdited by Stacy Elliott."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5zSmtaTmFQb2std25QaVhnNVVtMDFMMnNPTTlxMmtPZHZ1Y1BSM3hiOTNsY0s3cUxrcWRqa0xUdVZOLWUzdk15MkpnalFoVlA5RU5FeTFGNVNYUXV60gFiQVVfeXFMT2RaRXVQdGFLWGVmZkRfWG95bll0NmNRaFE4d0U0Q0dTcGIxU3QyNnV3RTNlMnRTREJJdjNWY255QUJLaFk0bWZlOEZXOGxmZmJBVW9QMDZ6ajBDbTRIeW4tQUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Cardano Founder Reveals The Crypto Project That Almost Overshadowed Ethereum | Bitcoinist.com - Bitcoinist",
        "content": "Cardano (ADA) founder Charles Hoskinson recently revealed the crypto project that almost overshadowed Ethereum (ETH) during its early stages. This revelation followed Hoskinson’s remarks about his greatest fear while he was the Chief Executive Officer (CEO) of Ethereum.\n\nThe Crypto Project That Almost Overshadowed Ethereum\n\nIn an interview with Altcoin Daily, Hoskinson mentioned NXT as the crypto project that could have displaced Ethereum while it was still in its early stages. He claimed that NXT scared him the most among other cryptocurrencies while he was still the Ethereum CEO between 2013 and 2014.\n\nHe further explained that he was scared of the crypto project because it came out of nowhere and achieved impressive growth in under three months. He noted that NXT was built on Java and had an “incredibly engaged community.” Hoskinson added that NXT was also adding features to its product offering and had user-driven assets.\n\nInterestingly, NXT was already on proof-of-stake then (while Ethereum was still running a proof-of-work mechanism) and had made plans to implement smart contracts on their network. The Cardano founder sounded intrigued by the NXT’s growth as he mentioned how they were “running” and going “so fast.” However, things didn’t end well for NXT, with Hoskinson mentioning what he believes led to the project’s downfall.\n\nHoskinson claimed that their token distribution wasn’t so good, although he quickly added that that could have been fixed. The Cardano founder mentioned that the more “important” thing that “killed” the project was that they didn’t have a good governance system, which caused the team to fracture and break out into several other new projects.\n\nHoskinson remarked that Ethereum “wouldn’t exist” if NXT had the right governance system, as the latter would have been “number one” and had just continued to grow immensely. He added that NXT would have absorbed everybody and was a “sexy project” because it was new and had an interesting technology.\n\nGovernance Matters A Lot\n\nHaving explained what led to NXT’s downfall, Hoskinson further highlighted the importance of governance in the crypto ecosystem, stating that it is the “core differentiator between whether a project is successful or a project will fail.” He added that poor governance would kill a project and noted how poor governance made Microsoft fall behind Google, Apple, and Facebook.\n\nInterestingly, Hoskinson also alluded to decentralized governance, suggesting that it was a better way to run a crypto ecosystem, as everyone having a say would make things run better. He stated that this is what they are hoping to achieve with Cardano, and this is why Cardano stands out from the rest of the pack.\n\nCardano is on the verge of undergoing the Chang Hard Fork, which will usher in the “Voltaire” era, which focuses on decentralized government. Once this network upgrade occurs, Cardano’s ecosystem will become community-driven. Hoskinson boasts that Voltaire would be the “most advanced blockchain governance system.”\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPQno5eTEyLUgxWVdhMGU2NGJMekN1bXVlbTdhdmJfWFJuZ0w5RFp1NXlWOFc1NFRqQmd3dWRreHA0TnRQTXRNZTMxUENsaDk4YkxYQ2VzOFdxOVUtRGdPaFQ0Zk9ON1NXaHU4LVdnVjh4eElCdnAzWUdOQ2ZCY3FnUmRrcW7SAZIBQVVfeXFMTUtveHc0Ym9qRWVnSmN0OC1hTDBtT0RJeERNekFEYkEzVTlpMWZrMVI1SnI3ZFVHVmJna2ZmY1RNNTRRQWNWWFRmbDUySDh1Zm1qM2RnQ1MzQUM4NkdGNTZEMTBZb1F6YlhZMm5TMzV4VUFuU2szUE5lNkQyMF85YnBxZWZsZ004NzlmWURKV3RzLWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: June 14, 2024 - Analytics Insight",
        "content": "Support Levels: Ethereum found some support at US$3,430. 49 level, to inmates ranging from buyers who always intervene in defence of enormous downward Ethereum price slips.\n\nResistance Levels: The US$3,657 to US$3,713 range continues to present resistance, where selling pressure has capped immediate upside movements."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNcXc1djZrMkJVeG56bkdhdUV1elN5TFZ3X1d0eFE5ZkxGNC1sR3IzUUhXV0RaSUQ3MjJ0RDE3Z0NDYzNTUEZKcnYzR3RZUVkzbnpaZzd4RERSdmloRXlWbDJsX2puN0VRMjd1bUw1dTlsc0s4Nk5GX3JCN1lpNU9FM2x1dzZNSG01QkZyNUpQd9IBlAFBVV95cUxNOGdCV05YWHYwaWlza1A2eDN1NzBINm42bDdndWdTdGxQTE9wMjRPVF9wZ0UwQzJQY2lYay1YN25WZk1hOWpQSkFfeWxxWVVLR0lSUkJ0X1l2bktIWGJlMmN4djNIR3hCV2phSzh4cUtpc2dEdHlrcjFTeXg0YUl5SGFvSy04c2xlWkJubzNJNGZqVDJU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Aethir Ethereum launch sends ATH token soaring 100%, details here - AMBCrypto News",
        "content": "Aethir has launched its decentralized cloud computing network on the Ethereum mainnet.\n\nThe value of its ATH token may plunge in the short term.\n\nAethir, a decentralized physical infrastructure network (DePIN) provider, launched its decentralized cloud computing network on the Ethereum [ETH] mainnet on 12th June.\n\nThe protocol allows users to rent high-performance computing resources needed for training artificial intelligence (AI) and rendering digital content.\n\nThis service is crucial for organizations that require significant computational power as it offers flexibility and scalability for their operations.\n\nAethir’s mainnet launch comes with a native token, ATH.\n\nATH is required for governance and security within the Aethir ecosystem, staking on the Ethereum network, and payment to compute providers through Arbitrum [ARB].\n\nThis mainnet launch comes seven months after its testnet launch on 7th November 2023 on Arbitrum, a layer-2 scaling solution for Ethereum.\n\nIn its announcement, Aethir confirmed that its user base exceeded 500,000 on its testnet, and it completed a $146 million node sale.\n\nATH pursues new lows\n\nFollowing ATH’s launch, its price skyrocketed by almost 100% before correcting. At press time, ATH exchanged hands at $0.073. According to CoinGecko, its price has declined by 14% in the past 24 hours.\n\nIts daily trading volume totaled $261 million during that period, rising by 38%. The opposite movements of ATH’s price and trading volume indicated the presence of significant bearish sentiment in the token’s market.\n\nWhen an asset’s price declines while its trading volume surges within the same period, it signals a spike in selling pressure. This means that most token holders are looking to sell their positions, hence the downtrend in the asset’s value.\n\nAn assessment of ATH’s key technical indicators on an hourly chart confirmed the steady decline in the demand for the altcoin.\n\nFor example, its Relative Strength Index (RSI) and Money Flow Index (MFI) were 44.88 and 34.85 at press time.\n\nThese indicators measure an asset’s overbought and oversold conditions by tracking its price momentum and changes. At these values, ATH’s RSI and MFI suggest that market participants prefer to sell their holdings rather than accumulate new tokens.\n\nThis trend was confirmed by ATH’s Chaikin Money Flow (CMF), which measures the flow of money into and out of its market. As of this writing, this indicator’s value was -0.23.\n\nA negative CMF value is a sign of market weakness. It signals liquidity exit from the market, a precursor to further price decline.\n\nIf ATH’s selling pressure continues to increase, its price might decline toward $0.048.\n\nHowever, if the bulls re-emerge and token accumulation begins to climb, ATH’s value might rally toward $0.078."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOai1lSm92TmpvcEJmcXZpd0gtb0hPcmZyempnTVJGbEpBZVJDU3ZrMUVVQndkYzBSLXJsYzhDVDFqZHVsZ3ZKM1R3bko0bEpTcG1DN0dZalBVNk9FRE83ZlFsTHc0RGI0Y0M2ZWpfV2kxUmdhOVF3WDJoZ1o4UjM1UXJfRWpfMVHSAYwBQVVfeXFMTTNoZEhKa1NONi1fNDRDOHpGeU5RbmNOb3RNSjZyZkVPNHE5U19VNE5jbF9md2h5TDl2T01NYnlFeHE3S3BsSElKZTNEdnJqTWpLRVhEY2RxMk1vWk5LNG4wLXRsdHI0dHBpWlNWbTk5cGVjYU1ieUFuQk9vUjFGZ3ROcm96a3F5bW9NVVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "What Ethereum’s rising demand says about ETH’s price action - AMBCrypto News",
        "content": "Demand for ETH grew as put-to-call ratios declined\n\nETH’s price action remained stagnant as prices fluctuated\n\nEthereum [ETH] has remained stagnant around the $3500-mark for quite some time now. Despite its sideways movement, however, bullish sentiment around ETH has been growing.\n\nEthereum demand surges\n\nAccording to recent data, 200,000 Ethereum options contracts recently expired, and the data surrounding this event hinted at a surge of bullish sentiment in the Ethereum market. The Put-Call Ratio, a key indicator of market bias, sat at a low 0.36 at press time.\n\nThis means there has been significantly less buying of put options compared to call options – A sign that most options traders anticipate Ethereum’s price to rise. Further adding to the optimism is the maximum pain point of $3,600. This price level signifies the point where most options contracts expire worthless.\n\nIf Ethereum surpasses $3,600 at expiry, most call options will be profitable, again reflecting a bullish bias.\n\nFinally, low implied volatility (IV) below 60% across all short-term ETH options contracts further fueled the bullish outlook. Here, implied volatility reflects expected price movement, and lower IV suggests investors anticipate Ethereum’s price to remain stable or hike in the near term.\n\nLooking at the price movement\n\nAt press time, ETH was trading at $3,512.52. While the price of ETH has appreciated significantly after 20 May, as time went on, the bullish sentiment around ETH depleted itself. In fact, as the altcoin’s price fell again after 27 May, its market trend reversed itself too.\n\nIf bearish sentiment persists, the price of ETH could go down to the $3,000-level. The CMF (Chaikin Money Flow) for ETH fell significantly during this period as well.\n\nThis indicated that the money flow for ETH fell materially. The RSI (Relative Strength Index) for ETH was also relatively low. The declining RSI could be a sign of ETH’s bullish momentum waning on the charts.\n\nHow will new addresses adapt?\n\nAMBCrypto’s analysis of Santiment’s data revealed that the network growth for ETH also fell materially as the price of declined. The falling network growth implied that new addresses have been losing interest in ETH and were not willing to buy the altcoin at the recent discount.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nIf this trend continues and addresses the refusal to buy more ETH, it may further impact the price of ETH negatively.\n\nMoreover, the velocity of ETH also plummeted during this period, implying that the frequency at which the trades were occurring had also fallen significantly over the last few days.\n\nHowever, if the popularity of ETFs continues to rise, the overall interest in ETH will also grow significantly as Wall Street money flows in."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNS1hmSU01Znd0Z2lnRWxmRkZyV012QkVGQ3htNDY5MGZxc3FJaHJIQXdUa3dsX2dZTUhpWkVuSFhBUFNlU2lkTzBXMXRRZDFpYjB2T0tjcFF5Q1owd192aWhUSFBDZWl5SlBwSGRqUVB2bWU4VHNmZTdDU3hYdGJqMzJGY0FHaWFvNkd2b2RlNDNkeEXSAZgBQVVfeXFMTlFaejVFbEdVaV9HbkhZVk5mcERRMWUyTnpNdVFVZnNaVE1zR08zdFlpX2IxZk1VeDBQMnlYZkdmUWFJa1FfLS1uakp6dlktRWxidThxZHRydHdnSnQ1VHFwaF9lSnFqa1phaU5zQTEzNXAtbWE5WXprYVVsVUpVR0lIWm93UDlxeUdaYVhOT3ZSQlZnN0JJZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Ethereum staking: How MetaMask’s new offering stacks up against Lido - AMBCrypto News",
        "content": "Lido leads Ethereum staking with over 27%.\n\nMetaMask has launched a new staking feature similar to Lido’s\n\nEthereum [ETH] staking has gained popularity ever since the network transitioned from Proof of Work (PoW) to Proof of Stake (PoS). Numerous platforms have been offering staking services for retail stakers, and recently, MetaMask has joined the fray by providing its staking services.\n\nNew Ethereum staking feature unveiled\n\nIn a recent development, ConsenSys announced that MetaMask is launching a pooled staking feature for its users. This new feature will allow Ethereum holders to stake their holdings without needing the standard volume required of validators.\n\nEthereum staking usually involves locking up 32 ETH, which is currently valued at approximately $112,000.\n\nHowever, MetaMask is not pioneering this feature. Platforms like Lido and Rocket Pool have long provided similar staking opportunities.\n\nLido, for instance, offers stETH in return for staked ETH, allowing holders to use stETH for additional activities. The option was not part of the ConsenSys offering. Also, according to their announcement, this service will not be available in the US and UK.\n\nLido leads Ethereum staking\n\nMetaMask’s pooled staking will be supported by Consensys Staking. According to an analysis of data from Dune Analytics, Consensys ranks 28th among staking platforms.\n\nThe data revealed that it currently manages approximately 101,000 ETH and operates around 3,000 validators.\n\nFurther analysis showed that over 33 million Ethereum has been staked as of this writing, representing 27.56% of the total ETH supply.\n\nThe study also indicated that Lido holds a 28.76% share of the staked volume. This equates to about 9.5 million ETH staked with Lido, supported by around 297,000 validators.\n\nThis makes Lido the platform with the largest share among Ethereum staking platforms.\n\nNew Ethereum stakers drop\n\nAnalysis showed that although the total value of Ethereum staked has been increasing, the number of new stakers has been declining.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAn analysis of new depositors on CryptoQuant showed a notable drop in the last few days.\n\nThe chart indicated that as of 9th June, the number of new daily depositors was over 3,700. As of this writing, the number has dropped to around 540."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOOExlQlNuM1lFY0N5S2NVeVhfbW9MV2Z4V3JtTDVCYVlCMC1jQkEtVU5OVmZqdEd2X1ZSYWVHQThCUGYxVi1lZVhFaWZUa3VHZGZ0S3ZtbktsUXU3cU1DUkpXN3ZmYTc5ekNzUXE1N3NvbjBxTDROSVZ1VUMxbnpjejZWd1ZPdzBydkpCV0VobW1hVTDSAZgBQVVfeXFMTTN3azdOQ1UzbDNDU2MySnNXcXp4UlBqWHNVYW9tVFJYRWxvVzI5NlZpTlZwRXhRZ1plaW5VaTVqeWVNblVZZlo2TVFDVnM0aWxWRWt5UlJPNmhUMTdMWXFTdXk5dlBYel9fVjBqcThXb1Vkb3ZibVlaTWxmV2lGUENhT0prVFVFX1J5SDNHQzFqZ1huWW13TU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s bullish flag: A signal for investors to prepare for gains? - AMBCrypto News",
        "content": "Ethereum’s price dropped by more than 7% in the last seven days.\n\nMost metrics and market indicators hinted at a trend reversal.\n\nThe end of May for Ethereum [ETH] was bullish as the token’s daily chart showed a massive green candlestick. But last week wasn’t in investors’ interest as the token dropped substantially.\n\nHowever, the declining price trend might change soon, which might allow ETH to retest its March highs.\n\nEthereum enters a bullish pattern\n\nCoinMarketCap’s data revealed that Ethereum’s price dropped by more than 7% in the last seven days. At the time of writing, ETH was trading at $3,516.89 with a market capitalization of over $422 billion.\n\nInvestors’ shouldn’t get disheartened as a bullish pattern emerged on the token’s daily chart. AMBCrypto found that ETH’s price has been consolidating inside a bullish flag pattern.\n\nThe token entered the pattern after reaching its May high. At press time, the token’s price was testing the support near the lower limit of the bullish flag pattern.\n\nA successful test could initiate a bull rally. If that happens, then it would be surprising to see Ethereum retest its March highs of $4k in the coming weeks.\n\nWill ETH test the pattern?\n\nIt will be crucial for ETH to register a few green candlesticks in the coming days in order for ETH to test the bullish flag pattern. To see whether that’s possible, AMBCrypto analyzed CryptoQuant’s data.\n\nAs per our analysis, ETH’s exchange reserve was dropping, meaning that buying pressure on the token was high. Additionally, the total number of coins transferred has increased by 13.93% over the last 24 hours, which can be inferred as a bullish signal.\n\nThings in the derivatives market also looked optimistic as ETH’s funding rate rose. This meant that long-position traders are dominant and are willing to pay short-position traders.\n\nAMBCrypto’s look at Glassnode’s data pointed out that ETH’s NVT ratio dropped last week. Whenever the metric drops, it means that an asset is undervalued, which usually results in price upticks.\n\nEthereum’s price touched the lower limit of the Bollinger Bands, hinting at a rebound. Moreover, its Relative Strength Index (RSI) also registered an uptick and was headed towards the neutral mark.\n\nNonetheless, the MACD displayed a bearish advantage in the market, which could cause trouble for ETH’s recovery.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAMBCrypto then checked ETH’s liquidation heatmap to look for possible support and resistance levels. We found that if ETH turns bullish in the coming days, investors might witness ETH touch $3,675 in the coming days.\n\nHowever, if ETH fails to test the bullish flag pattern, then the token might drop to $3,500 in the short term."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxNNjVnYnE3aFVXTzNHenV2bTcwdHJMYWZnQ2kwbHBEVnhZcTA3WWZLN1B4QTRncWNmcEVhclZWemFkWU1wMmswN2lJMWswcjJfTFlNWU13WEdJdUVsUUNGY1pyV2JLaVo5eW9YOVpZRG1NTjF2SEN6N2V6ZnlNQ05QeE8zZ2ZBWk1mdWJZME9Pb2dKYmJ1OWdfSWd5M3JQeGFneTZUYTJGdkxnSS1QS2ZwclYzQ3czU3BJQm5XTHpsUl90ejluQzlhX3VQaE9Ucm10U2tRQjI5VzRlUlJiRDEtcU9tdHZjSHMtSjM4UTRjdnZNOFQ2Q0FuQi0zRdIBiAJBVV95cUxQTk5uYTd6WEdhMGRWd0EyZFlnOUVEaWhadklEdkxGSFlHUUluODBMLXNraXViZHZKUlZ1T3piS2pRQm8yNGx1eV9GMUVWelFoQVQtZmVaMGpHRFFhM0M3cTVvN0luUWZSVFFnY0I5VnZjbTUwbDVXNkYyVGlmRlZFNUE0XzVabmp0aFM3Z3FrSDdBMmZYY2Z2TzAxRjlncFhGcnMyVkNGbndzVVRqMWxyQ0ltZFBHMVhRYU44cFViN2VMUGZhemJoRmpoMGFzRF9DdWFHa0tiZXZZeW5PYWswNGZmZ2NyVFFfNnBTYldsNjd0RlFRNjFTeXZ4cXYyVDAxSkZBQXlUNms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Drops From Bull Pattern But ETH ETF S-1 Approvals Likely In The Summer Could Turn it Around - Analytics Insight",
        "content": "The launch of a spot Ethereum ETF would likely drive the price to new all-time highs above the previous record of $4,878 set in November 2021.\n\nOn chain data from CryptoQuant is currently painting a bullish outlook for Ethereum as well. Over $1.5 billion worth of Ethereum has been withdrawn from exchanges since June 9th. Exchange reserves of ETH have declined by 1.2 million ETH (over $4 billion) since late May. This is often interpreted as investors pulling coins off exchanges to hold long term rather than selling.\n\nFrom the technical point ETH recently broke down from a bullish flag after recording a $3,973 high on May 27th as analyzed in our previous report . This is after it dropped and closed below the bullish flag, invalidating bullish pressure in the near term.\n\nSince then price has been trading bearish and looks set to get support at the demand zone marked on the chart after the price broke out of the ranging channel impulsively on May 20th."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNNWtIVmFMZlRWZnI4TjRrOVl5OXU2dzliYTBGUDZGRGJ2akRlQVhzUjB3MmF4RzZPcUhWM1UyUnZpTEtJU3ZHOWg2akNUdHE2Z2ozYlFyXzgxaGlVSFU1Mi1hdXB0b3EyTGpFYUk1ZVQtRVBWbVBUQUVZNUMxa2lmTzJPaFBBclNUaVN1QnpqUXdNZ3VLTjVHSmdPLTE4MlNILXFJLUZZSUMxWlpza29mcEhiQUVhdm9tNmltVVNRRWNBdVlOY2VpVW5YZ3I5TUVQRDFOaUxxV3c4UlA4Q3FRTDRtdUU0SjJ2ZWMwZkJaOURJV3Jx0gGCAkFVX3lxTFBUcE5rbi1MUXBid1d4TkgwUnVleXhqNEppTkZTNGY0cFBWc1VHZ1BBdENwZ1FxUDZ5ODlDdUhZNVk2aDZmRldjRTAwLUdRMjltT1E1U1ZyTEFUVldCeFk1QzdfWW9DT1lLZnRuMnpGMmVDNks0RG05NmtCZmRPWFk4SnRqanQ5bF9tVXNaZnpvWkdlSURsU3d3TGJNRWlOb2JGcTJETkM5aTVuQ0FpSzRhdGFDZklpN1JvUmlyd215OUt3d1lKaHdZOWMtTHhGaWFnMkJBekd1VFVwUXBTeDFoWWZOVzNieDZYemZBV2h6eVdxb1ZSNFlnNklkR0xoUEtKdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Crypto Trader that Predicted Solana’s 212% Rally Thinks This Ethereum Token Will Double In 40 Days - Analytics Insight",
        "content": "In addition to Solana, Altcoin Sherpa is known for offering insights into several other crypto trends. Recently, he highlighted Avalanche (AVAX) as a potential candidate for a significant rally.\n\nDespite AVAX dropping slightly from its recent highs to around $32.07, Sherpa remains optimistic. He has pointed out that AVAX has shown resilience by holding the $31.18 support level, which could signal a bullish continuation if market conditions stabilize.\n\nAvalanche (AVAX) positions itself as a scalable blockchain platform capable of handling high throughput and supporting decentralized applications. It is a layer one blockchain that allows blockchain developers to develop and launch decentralized applications and custom blockchain networks.\n\nIt is one of Ethereum’s rivals, aiming to unseat Ethereum as the most popular blockchain for smart contracts alongside Solana, which has also seen increased activity, especially with the launch of meme coins."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOWkxjdjlDd0V1cXRFeHFzZ1pSSlMxbzZNdUV3anlhZ2pYSVBuNTU3YTc0UnFENEFGVmdIMVRodl80Ml83NF9MQnZib3B0bmNwVEhnVHhodG1aNWpEZlVlVVMyd1BVbDZCWkJCMFpvcUNmWllOVmFKQWVZWmNoZXNLSllaONIBiAFBVV95cUxNd004LVdMNHhqV05tVWtLdmVtWGVzYlJHZGtEUE1iZVdaVkFXODB3c0U2M1FWZVk2VWJNZ21xREJRSDdPbjEyUVJOcmNpQWI3R1dhVW01WGhNTGd3b2lEcXRheUVoWk9hNTlETmZsY0RyZS1NVTdCQ0ZtLWZpemgtRkRVTktMVUoy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "NFT sales: Bitcoin’s $43M vs. Ethereum’s $40M and that means… - AMBCrypto News",
        "content": "Bitcoin’s network saw more NFT sales than Ethereum’s over the past week.\n\nFloor prices of BAYC and CryptoPunks fell to multi-month lows too\n\nThe sales volumes of non-fungible tokens (NFTs) on the Bitcoin [BTC] network surged last week, exceeding that of Ethereum [ETH], according to data from CryptoSlam.\n\nOver the aforementioned period, Bitcoin’s NFT sales volume totalled $43 million, rising by 26%. Although Ethereum’s weekly NFT sales volume also rose by 17%, it amounted to “just” $40 million.\n\nThis, notwithstanding the fact that 99,297 NFT transactions were completed on Ethereum last week. Bitcoin, on the other hand, recorded 55,351 NFT transactions.\n\nOver the last 14 days, the total value of all NFTs sold on the Bitcoin network was $77.02 million. According to CryptoSlam, Ethereum’s NFT sales volume over the same period was $71 million.\n\nState of the NFT market\n\nThe previous week was marked by a decline in the general cryptocurrency market. In fact, global cryptocurrency market capitalization dropped by 4% in just 7 days.\n\nThis decline affected the NFT ecosystem, which also fell in value. According to NFTGo, last week’s NFT trading volume amounted to $85.39 million, dropping by 3% on the charts.\n\nThis led to a fall in NFT market capitalization – worth $7 billion at press time – after depreciating by 11% in the last seven days.\n\nFloor prices hit new lows\n\nA look at the leading NFT collection, Bored Ape Yacht Club (BAYC), revealed a decline in its floor price over the past few weeks.\n\nAfter peaking at 13.7 ETH on 31 May, the floor price of an NFT in the BAYC collection has since declined by 25%, as per NFTPriceFloor.\n\nThe last time BAYC’s floor price was this low was on 15 April.\n\nOver the past month, BAYC has seen a decline in sales volume as the daily count of traders buying and selling NFT pieces from the collection decreased. In the last 30 days, BAYC’s sales volume totalled $12 million, having plummeted by 34%.\n\nAs far as the CryptoPunks NFT collection is concerned, its floor price was 27.42 ETH at press time, representing its year-to-date lowest.\n\nAfter peaking at 63 ETH on 24 January, the average price of an NFT in the collection has since fallen by a massive 57%."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9SbXVJQjZrWktTNGhqdkp4V3gtQk9jbnJWdHVQRnRETXBtcUFUcmc1WEZGYklXd0N2WldMdms4TXJIdXV4b2lMZXhvY2I0VThnLUlxdXN2RDB0bVpWdGVzU3FJR3o2dTdlQXJVeVBhSFVMRERtVDgzRzduSdIBgAFBVV95cUxPUm5mc1R5V1dxNlk1ZHlFdnlqRGVxS0lCYTBSX1M1WUJteVVYaHl1Y3cwVlRTUGdxb0pjU2Noak5MU09Vam8zdGw2QnZwckkycjFtZTNvbk8zcFN6aXdOcDFaMWVFcDdRMV9QUnRVUHZRb1hiMmNaODhpY1czRjBoeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 20:04:19 GMT",
        "title": "Ethereum Withdrawals From Coinbase Top $1.2 Billion, What’s Going On? - NewsBTC",
        "content": "Ethereum has seen a number of notable withdrawals that suggests that crypto whales are expecting a recovery in price. These large withdrawals has caused the ETH balances on centralized exchanges to fall to their lowest level since 2016.\n\n336,000 ETH Withdrawn From Exchanges\n\nCrypto analyst Ash Crypto took to X (formerly Twitter) to reveal a notable change in the amount of ETH that is being held on centralized exchanges currently. Notably, there has been a marked increase in the withdrawals of small and large investors alike, leading to the highest withdrawal trend of 2024 so far.\n\nRelated Reading\n\nDOGE To The Moon: This Dogecoin Metric Just Turned Bullish For The First Time Since 2020 3 months ago\n\nThe report focuses on the withdrawals from the Coinbase exchange, which is the largest crypto exchange in the United States. The uptick in the withdrawal trend saw a whopping 336,000 ETH withdrawn from the exchange’s wallets in just 48 hours. This translates to the highest withdrawal trend from the exchange so far this year.\n\nHowever, Coinbase wasn’t the only crypto exchange hit hard by the Ethereum withdrawals as the cumulative exchange addresses saw their ETH balances fall drastically. As the on-chain tracker Santiment revealed in a report, the total ETH held on centralized exchange wallets has fallen 8.6% in the last two weeks alone.\n\nThese withdrawals have greatly impacted the exchange balances, causing them to fall to their lowest point in 8 years. This means that the last time that the exchange balances were this low was back in 2016, which is three bull markets ago.\n\nWill This Propel Ethereum Price To $10,000?\n\nNaturally, the withdrawal of Ethereum from exchanges is bullish given that this is a trend that suggests investors are choosing to hold their Ethereum coins rather than sell them. If coins were moving the other direction and being deposited on exchanges instead, it would’ve been bearish for the price as it meant that investors were looking to offload their holdings for profit.\n\nRelated Reading\n\nXRP Continues To Struggle Below $0.5, Ex-Ripple Director Reveals Why Price Action Remains Muted 3 months ago\n\nCrypto analyst Ash Crypto shares the sentiment that the withdrawals are bullish for the price. According to the analyst, with Spot Ethereum ETFs set to start trading in 2024 in addition to this, it means that the ETH price trading above $10,000 is just a matter of time.\n\nPresently, the ETH price is still closely following the Bitcoin trend. It has recovered above $3,500 once more after initially falling below this support level on Thursday. Nonetheless, it continues to nurse losses on the weekly chart, with CoinMarketCap data showing a decline of 7.88%.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOeUlDQS1GQjQyOWt5aDdZeVFjbHFLTl9JQ1ROc3JuWUgtQXRwcWJUa3hyZWNVdG9TYTdKRDZfVVZBaG5JemFEYTB2VmNMNjAzX1RWU0dVWVlpNFNlczc1bjhyS05UdWphZ1hjblR2OWhQYUNFbVI5bE11SEV4anBzeGE4azRNa1BmN3ZTdGt0NVkwMjFkeDEyZ0J30gGfAUFVX3lxTE03WUpYSkp6bGxyMzZaeFBJTlhBS1d1aUw1V0lvNDBmS0JfX0dTdzdneU55WGs3RDNQTlp3RmFZQ0pQRG43QUNRNWZWSWhmME84cXV4WGVQajFwNjNRQUJQN0w1VjFWUFlsMEhHR2V4a0xURTV1cEpXWVh3V1BqdWotUWFQVGE5NFpBX2laMG10d3lkT0tndkR0NGZvT3A3OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Top Reasons Why Ethereum Price Could Break $10,000 Soon - Coinpedia Fintech News",
        "content": "Vignesh is a young journalist with a decade of experience. A proud alumnus of IIJNM, Bengaluru, he spent six years as a Sub-Editor for a leading business magazine, published from Kerala. His interest in futuristic technologies took him to a US-based software company specialising in Web3, Blockchain and AI. This stint inspired him to view the future of journalism through the lens of next generation technologies. Now, he covers the crypto scene for Coinpedia, uncovering a vibrant new world where technology and journalism converge.\n\nStory Highlights Large Ethereum outflow from Coinbase suggests reduced selling pressure and potential price increase.\n\nLowest Ethereum supply on exchanges in 8 years could lead to a more stable market and higher prices.\n\nUpcoming Spot Ethereum ETFs might attract more investors, increasing demand and driving up the price.\n\nEthereum’s price could potentially soar, possibly exceeding $10,000, says cryptocurrency expert Ash Crypto. This prediction is based on recent market changes and developments in the cryptocurrency world, shared by Ash Crypto in a tweet on the X platform.\n\nBut what’s driving this bullish prediction? Dive deeper to uncover the recent market dynamics and developments fueling Ethereum’s exciting future!\n\nThe Market is Shifting, Folks!\n\nRecently, over $1 billion worth of Ethereum was withdrawn from Coinbase, marking the largest single withdrawal of Ethereum from the exchange this year. This significant outflow of 336,000 ETH, valued at approximately $1.209 billion, suggests that holders are moving their assets to private wallets or other platforms. Such a large withdrawal usually means reduced immediate selling pressure, as holders often choose long-term storage, leading to price stability or even increases.\n\nEthereum Supply at an Eight-Year Low\n\nThe amount of Ethereum held on centralized exchanges is now at its lowest point in eight years. This reduced supply on exchanges could lead to a more stable market and potentially higher Ethereum prices. With less ETH available for immediate sale, the chances of price surges increase, especially if demand remains high.\n\nUpcoming Spot Ethereum ETF\n\nAdding to the positive outlook, a Spot Ethereum ETF is expected to start trading soon. An ETF allows investors to gain exposure to Ethereum without directly buying and holding the cryptocurrency. This could attract more institutional and retail investors, further increasing demand and, consequently, the price.\n\nRecent Price Movements\n\nJust before the US SEC gave green signal to the Ethereum Spor ETFs, the price of Ethereum had seen a major boost. On 20th May, 2024, we saw a long green candle, in which the opening price was as low as $3,069 and the closing price was as high as $3,662. That trend continued till 11th June, when we saw a red candle, bringing the price down to the mark of $3,500.\n\nCurrently, Ethereum is priced at $3,526.3. Over the past seven days, Ethereum has experienced a -7.9% change, but its 30-day change is a positive +21.1%. These fluctuations show the dynamic nature of the cryptocurrency market.\n\nAlso Read : Historical Trends Suggest Altcoins Will Peak in October 2025, 546 Days Post-halving\n\nWould you consider investing in Ethereum based on this news? Share your investment strategies!"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOQmxHazdaWDYxV3VSOUl6RTI2UHF3X3J6Um9wakt0eHdzU21CWDdna0g4TW9xeVZWcW05LUo1YXpBa1pFMUVCaXc2eEFMUG9XR2x6WDk1MU1OdC1LQVJveTZtcnZab2N3Z243OFlOeEE5QUE2UXNqRjR2NzE0S0JtNzZJOWZ5NlBGelNsTGJQQ2V1V3pVeW9feTY4N2pQdmtac3hxbjNVb9IBrAFBVV95cUxPX21fWmktNkx1NWZaQWRFY0w4RHBSR1FYZkRMUDdMN2lsa3ppMnhPYzNrQ2xIRjVlOVdWUHdlY3RveEZWZk1KOUNTZ2JlbGFubzNaSno3Q01HZXI2WlB2R2NhdTR1aVVvZ2NYUkh3d2o5U0RYM1JMSDRFaWdWTUVCVFg5blBwQW8xWkJTUUNaVGVSR0x6akhqRGtnOWlad3dNa0lIUTVweWYyYXJG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Hold or Buy? Crypto Expert Reveals Bitcoin & Ethereum Trading Strategies - Coinpedia Fintech News",
        "content": "Vignesh is a young journalist with a decade of experience. A proud alumnus of IIJNM, Bengaluru, he spent six years as a Sub-Editor for a leading business magazine, published from Kerala. His interest in futuristic technologies took him to a US-based software company specialising in Web3, Blockchain and AI. This stint inspired him to view the future of journalism through the lens of next generation technologies. Now, he covers the crypto scene for Coinpedia, uncovering a vibrant new world where technology and journalism converge.\n\nStory Highlights The expert predicts a possible short-term price drop for Bitcoin, potentially followed by a rebound to $70,000 or a steeper decline to $60,000-$62,000.\n\nThe expert believes Ethereum is a good buy between $3,250-$3,300 but is waiting to see how Bitcoin performs first.\n\nThe expert emphasizes a cautious approach, waiting for strategic entry points based on price movements.\n\nBitcoin and Ethereum, the two biggest players in the crypto world, have been teasing new highs but remain stuck in a holding pattern. Is a breakout on the horizon, or are we due for a correction? Crypto expert Jacob Canfield shares his insights on what could be next for these digital giants, outlining two potential scenarios for Bitcoin and a strategic buying zone for Ethereum.\n\nCanfield’s analysis and strategic plan offer valuable guidance for crypto investors. Before we explore the insights of the expert, let’s understand the current market scenario of Bitcoin and Ethereum.\n\nMarket Overview: Bitcoin and Ethereum\n\nAs of now, Bitcoin is priced at $66,326. In mid-March 2024, Bitcoin’s price was above $73,000. It has attempted to reach this peak several times in early April, late May, and early June. The 7-day change for Bitcoin stands at -4.5%, while the 30-day change is +0.6%.\n\nEthereum is currently priced at $3,552. In mid-March 2024, its price was over $4,000. Similar to Bitcoin, Ethereum also attempted to touch its peak in late May and early June. The 7-day change of Ethereum is -4.2%, while the 30-day change is +17.2%.\n\nCanfield’s Insights: Two Possible Scenarios for Bitcoin\n\nScenario 1: A Minor Drop and Quick Rebound\n\nCanfield predicts that if Bitcoin’s price drops to around $66,000, it could quickly bounce back and rise to $70,000. This scenario suggests a minor correction followed by a strong upward trend.\n\nScenario 2: A Deeper Decline\n\nIn this more bearish scenario, Canfield sees Bitcoin falling sharply to between $60,000 and $62,000. This deeper drop would require more caution and could signal a more prolonged correction period.\n\n$BTC / #Bitcoin –\n\nTwo scenarios I’m watching:\n\n1.) Sweep $66,000 low with a strong reaction bounce reclaim to head towards $70,000.\n\n2.) Deep capitulation wick down to $60k-$62k.\n\n\n\nNo positions at the moment, but observing the reaction at the lows.\n\n\n\nI think $ETH will be a good… — Jacob Canfield (@JacobCanfield) June 14, 2024\n\nCurrently, Canfield is not holding any positions. He is waiting and watching how Bitcoin behaves at these critical lower price points before making any trading moves. This cautious approach underscores the relevance of strategic timing in crypto trading.\n\nCanfield’s Ethereum Investment Strategy\n\nCanfield believes Ethereum will be a good buy if its price drops to between $3,250 and $3,300. This specific price range represents a strategic entry point for Ethereum investments. The crypto trading expert is waiting to see how Bitcoin performs at its lower prices before making any decisions on Ethereum.\n\nHis analysis provides a clear and strategic approach to navigating the current crypto market.\n\nStay tuned to Coinpedia for more insightful updates on crypto trading!\n\nAlso Read: Veteran Crypto Trader Predicts Bitcoin’s Market Cap to Equal Global Gold Reserves"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNZDVHWE4tc2N6R0Z0X0dheEpjLWFDYUd3Zmg4VDI2Um9uX29nQVZqeFl6dVdhRWhHVDJiT0hiWDNHUmI2M1FJRFJnV2NrZWFFYk5KQVVHTGQ5cHZMaG9CTWxzN0xkT0o1dll5dnE0dXYtSGlZVHZla055Y2tyQ0hvM1FnR1phUWlLcks4QU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "TON surpasses Ethereum in daily active users; What’s next for Web3 - Finbold - Finance in Bold",
        "content": "The Open Network (TON), originally developed as Telegram Open Network to enhance the popular messaging app, has outperformed Ethereum (ETH) in daily active addresses throughout June.\n\nDespite Telegram stepping back due to regulatory issues, an independent community has driven TON’s growth, leveraging Telegram’s 900 million users and integrated crypto wallet.\n\nDelphi Digital highlighted TON’s impressive growth in a recent post on X (formerly Twitter), noting that TON’s daily active addresses have surpassed Ethereum’s.\n\nThe Flippening CT ignores 🔍\n\n\n\nTON's quiet growth, fueled by Telegram's 900M user base, has driven its daily active addresses above Ethereum.\n\n\n\nAt its core, TON is a bet on Telegram's distribution. Though the ecosystem is nascent, its early growth is promising. But is it enough? pic.twitter.com/k2b2SMiQJD — Delphi Digital (@Delphi_Digital) June 10, 2024\n\nThey attributed this achievement to Telegram’s massive user base but questioned whether TON’s growth could be sustained long-term to permanently surpass Ethereum.\n\nTON and Ethereum compete in active addresses\n\nDaily active addresses (DAA) are defined by Artemis as the number of unique wallets engaging in transactions on a blockchain each day.\n\nDaily active addresses and daily transactions in Ton and Ethereum networks. Source: Artemis\n\n\n\nSince May 17, TON and Ethereum have been closely matched. However, TON gained an edge at the beginning of June, surpassing Ethereum on 10 out of the first 11 days.\n\nOn June 3, TON reached a record 568,300 DAAs, a level Ethereum hasn’t seen since September 13, 2023.\n\nDespite these impressive figures, Ethereum has been actively pushing transactions to layer 2 scaling solutions, which have attracted significant user activity.\n\nOn June 11 alone, three of Ethereum’s top layer 2 solutions—Arbitrum (ARB), Base, and Optimism (OP)—boasted a combined 1.3 million daily active addresses.\n\nFactors driving TON’s surge\n\nThe recent surge in activity on TON is driven by an ecosystem of mini-applications, including chatbots and games.\n\nNotcoin, a free game on Telegram with over 35 million users, launched its cryptocurrency NOT in May, reaching a market cap of $2.1 billion. Other popular games like Hamster Kombat and Catizen have nearly 33.6 million and 3.6 million users, respectively.\n\nTelegram also hosts TON-native trading bots like sTONks, which are expected to enhance the user experience for traders. Additionally, the introduction of Telegram Stars, an in-app currency for digital purchases, has further enhanced user interaction.\n\nThe future of TON and web3\n\nThe Total Value Locked (TVL) in TON has grown dramatically from $22.9 million to over $500 million since March, marking an impressive increase within just three months.\n\nBREAKING: $500M Total Value Locked (TVL) 🔥\n\n\n\nThe GDP of a small country is in use across #TON's apps. This incredible achievement is yours, TON Community!\n\n\n\nFrom $22.9M TVL in March 2024 to more than half a billion today – over 2,000% increase. 📈\n\n\n\nIt’s still only the beginning.… pic.twitter.com/bE3xqohACG — TON 💎 (@ton_blockchain) June 13, 2024\n\nThe number of active Toncoin wallets has surged from 1.28 million at the start of 2024 to over 8 million. This growth reflects the network’s expanding user base and the increasing adoption of Toncoin for various financial activities.\n\nIf you are starting on crypto, I will strongly recommend you to have a look at $TON / @ton_blockchain\n\n\n\nSuper early. Super quick. Easy to build.\n\n\n\nMoreover, run by @telegram .\n\n\n\nFew more weeks, you will see $TON over 10$ 🔮 pic.twitter.com/ONRBCFKsmc — Crypto King👑💎.eth.sol (@cryptosanthoshK) June 11, 2024\n\nCrypto influencer Crypto King recently recommended Toncoin to new investors, emphasizing its fast and user-friendly blockchain infrastructure. He noted the credibility of the development team, which also developed Telegram, suggesting that this could lead to a significant price spike for Toncoin, potentially reaching $10 in the near future.\n\nIn a technical analysis, crypto analyst Ali Martinez identified a potential 40% breakout for Toncoin, targeting an ambitious price point of $11.\n\nAt press time, Toncoin is trading at $8.03, reflecting a 6.63% increase over the past 24 hours.\n\nThe rise of TON reflects broader trends in the crypto ecosystem, where platforms that successfully integrate blockchain technology with existing user bases can achieve rapid growth.\n\nWhile Ethereum continues to be a major player with its layer 2 solutions, TON’s success illustrates the dynamic and competitive nature of the crypto market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]