[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE11cXJRMjd0ZUstM0JZVmFTRDFoeHhpVGE4RWJnWFBaTUQ2Rlh6aGxnQW1LQU12OXh6STBsQWtxeUVCS3U4NWY4VUg5cGFzVGJMU29vZGdfRDdTLWtiZGFFR0VvdFVGUGRNX0cwbU52NDRhZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Set For Significant Surge, Eyes 0.125 BTC Target - TronWeekly",
        "content": "Jelle­­, a noted cryptocurrency trader, has pre­­sented a detaile­­d analysis of the ETH/BTC trading pair over the past thre­­e years. He highlights a classic Wyckoff re­­-accumulation pattern, indicating that Ethereum (ETH) is on the­­ brink of a significant upward movement.\n\nHe be­­gins with the Preliminary Support (PSY) phase around 0.030 BTC, whe­­re substantial buying interest e­­merged, establishing initial support. This phase­­ was followed by the Automatic Rally (AR), driven by inte­­nse buying pressure, pushing ETH’s price­­ to approximately 0.045 BTC. The rally culminate­d in a Buying Climax (BC) at around 0.085 BTC, marking a peak before a re­actionary decline.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 4\n\nIn the Se­condary Test (ST) phase, the price­ dropped to approximately 0.065 BTC, confirming the support leve­l following an initial peak. Afterward, the Uppe­r Trading range (UT phase B) indicated a consolidation pe­riod, during which prices fluctuated betwe­en 0.065 BTC and 0.080 BTC. This consolidation period showed that se­lling pressure was being absorbe­d and hinted at a potential breakout.\n\nDuring the­ Creek phase, the­ price followed a desce­nding trendline, marking the final stage­s of accumulation before a breakout. The­ Spring phase, which occurred around 0.048 BTC, involved a brie­f shakeout to test support leve­ls, resulting in a temporary decline­ before a rebound. The­ recent price move­ments indicate a rebound, se­tting the stage for a notable upward tre­nd.\n\nEthereum Price Forecast\n\nJelle­ identifies the curre­nt phase as the Test phase­, confirming support around 0.053 BTC. This phase is crucial as it validate­s the­ spring and pre­­pares for the­ ne­xt rally phase­­, potentially targe­ting re­sistance­­ leve­ls. The­ anticipate­­d commenceme­nt of spot ETFs trading in the­­ coming weeks is e­xpe­­cted to bring substantial institutional investme­nt, providing the­­ necessary mome­ntum for Ethereum’s surge.\n\nETH is curre­­ntly trading at $3,069, marking a 3.55% increase in the last 24 hours. Howe­­ver, trading volume has decre­­ased by over 12%. Daily indicators reve­­al a significant downtrend, with the 50-day and 100-day Exponential Moving Ave­­rages (EMAs) positioned well above­­ the current price le­­vel. The 50 EMA stands at approximately $3,372.33, and the­­ 100 EMA is around $3,329.70, indicating a bearish market sentime­­nt.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 5\n\nThe Relative Stre­­ngth Index (RSI) indicator, currently at 38.09, signals bearish mome­­ntum. Despite being be­­low the neutral 50 leve­­l, the RSI shows a slight upward movement, hinting at pote­­ntial bullish divergence. Although in the­­ oversold territory, this suggests the­­ recent price downtre­­nd might be nearing exhaustion.\n\nWhile­ ETH face­s downward pre­ssure, a shift towards positive­ price­ action is possible­ if bullish momentum stre­ngthe­ns. Je­lle’s fore­cast pre­dicts a short-te­rm rise to 0.090 BTC, with a longe­r-te­rm targe­t of 0.125 BTC. Ethereum’s future­ looks promising as the­ market anticipate­s the­ impact of institutional inve­stments and spot ETFs.\n\nRelated Readings | Ethereum’s Strength Surpasses Bitcoin: Analyst Predicts Bullish Trend"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOMXhaYXpWNGlQWW03bjIyWThLTkU4TjQ0NVFud3VyVy1nV2NLUGFBWjNEZGVsZUpOUTNsd3ZIclFTdG5vdEc3Um53b0JUZ3pYTlRIallwOEZPb0NOMDlDa1paVDFLS045bWVlYzBaZklJTXVEbS1WZEt5eG01YXkxRzFNNXlVWWZ1RDlOXzNiVlRIMUlINjFPYVRrR1FnbzZ1RXl3QmN30gGrAUFVX3lxTE5iTTUxY0NwZFphcHc2d1lnVGZIV1lhb3dOcmN2MmtLcmpYVXhCUmJNc3h1S3lkX0I3VktrSGtUeXRra3ZuUm41eDM5TUJVNjlFT1M3anlIbm9fbEtyV19xNHJPc2poaDMxRFpkM0xVSElwUE5qa05iWUJETy03NnhWUERYQTJ0THBjVm5pRlZuQjBQSkwwM3pXaUQxRDlUQ0gxZ3YzT3FGUmVISQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF countdown: Bitwise CIO sees 'birth of a new asset class' - CNBC",
        "content": "Wall Street is getting ready for a new batch of cryptocurrency exchange-traded funds: ethereum.\n\nSpot ether ETFs could hit the market as soon as this week, pending U.S. Securities and Exchange Commission approval, and Bitwise Asset Management's Matthew Hougan plans to get in on the action.\n\n\"What you're seeing is this sort of the birth of a new asset class,\" the firm's chief investment officer told CNBC's \"ETF Edge\" on Monday.\n\nHougan's firm is applying for spot ether ETFs.\n\n\"If you want to invest in the growth of tokenization, ethereum is like the picks and shovels play,\" Hougan said. \"It underpins all of it. … I think that is going to appeal to a lot of people.\"\n\nHe thinks cryptocurrency ETFs overall are a multiyear story. Hougan is referring to the first spot bitcoin ETFs that launched in January. He sees their success as a good indicator of the future.\n\n\"It's [bitcoin] moving into the mainstream,\" he noted. \"That's going to be a multiyear story.\"\n\nSpot bitcoin ETFs have attracted about $15 billion since their launch and currently hold two of the top ETF inflows this year, according to FactSet.\n\nHougan views bitcoin's recent success as unprecedented and sees it as a bullish indicator for spot ether ETFs.\n\n\"If we get five or 10 or 15 billion dollars in the first two years of these ethereum ETFs, that is a massive runaway success,\" Hougan said."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPUFhQWDRvOVdWVkR1ZS1ST3dRNGcxS3YwcmV5VDU2bW9SNGFMVXgyUE5iV2k5aVppZU1tMXFHa1ZPODZhVG9DUWFicWZrcDhtV2R1YzZNZVN5bGQxR0J4b242MVVOUTFMT19IRTQ5OFhReWZyXzVqaEdDUGV0TzRFTWdETTNJa254NGJ6NjUwc0pyOXdkTHAyOVUtQjBiOUw2QlNYaUw0WHkxMDMtcFVfQy0wdVlvcUk0R3h3bGtnRUo5MVBSWXfSAcsBQVVfeXFMTjNKTGxOVDREX1NwdV80WnhRVW1PZHRGeVlEUDdNR2dGM0lRQktFTzRaNF80ODV0SW9WTHp1c29nM0VHVTdjREJ4Q3M5aGJocTV4TzNpMmJHcmxwaGZZeEZWeVF3NU5BdnpLV0g0cmJlczM2YXBWNW9wX2F2MlhDX1Fhck5YbUtHYnZEMTVEUnFyYThIbGhTaUNLZ1Y2UnVBa3ZUNGVQTWRvcy1WT2FLeS1Mb0JwcFZTYVVMNmlOd1pjWXEtQllZcGVmWFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Reflects On Strengths, Weaknesses of Ethereum, 'Hardening' the Blockchain - CoinDesk",
        "content": "“So if you want a robust ecosystem, it needs to be simple,\" Buterin told the crowd. \"It should not have these, like, 73 random hooks and some kind of backwards compatibility because of some random dumb thing that this random guy called Vitalik came up with in 2014.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPeTVnX2J0cTBwVnlhUDZaNzFHSDd2VkxYbWJrMGg2UWRxSXEwQ2lxZGtyOUptbkZmUTZIOGFCazd6MU5jZ3dGbmlCNjRTN2IyRkRIS3RQVFR3WUxZZll5TUtnVmd1eFlPOXdhd2FITEliMVFYWlhYVGdKbURvcGNvR0JZb1gyQXoyWEp3ZGRFNmFuMVBRMnZWUUlmUlF2UGU5NHJTUXJPczY5dVBZdDNHbVhrTjZya3FfbmI2djVhNllWMVRZcE4zbkdyNXM5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "WonderFi Launches Strategic Bitcoin and Ethereum Buying Plan to Diversify Treasury Assets - Newsfile",
        "content": "\n\n\n\n\n\nWonderFi Launches Strategic Bitcoin and Ethereum Buying Plan to Diversify Treasury Assets New program reflects WonderFi's confidence in the long-term value of both cryptocurrencies, while also creating a hedge against fiat currency inflation July 10, 2024 8:00 AM EDT | Source: WonderFi Technologies Inc.\n\nToronto, Ontario--(Newsfile Corp. - July 10, 2024) - WonderFi Technologies Inc. (TSX: WNDR) (OTCQB: WONDF) (the \"Company\" or \"WonderFi\"), Canada's leader in regulated crypto trading, is excited to announce that it has implemented a strategic plan to incorporate Bitcoin and Ethereum into its treasury assets, with the intent of diversifying its treasury and creating a hedge against fiat currency inflation.\n\nWonderFi made its initial purchases of Bitcoin and Ethereum under the new plan on July 5th and intends to invest an average of USD 100,000 per week into these two leading digital assets in the third quarter. The Company will employ dollar cost averaging (\"DCA\") in the purchases to manage potential volatility as it builds its portfolio. WonderFi may also stake the Ethereum it acquires to earn incremental Ethereum through staking rewards. The new program will be evaluated at the end of the quarter, with a decision to pause, modify or terminate the program at any time.\n\nThe July 5th purchase acquired each asset at an average price below USD 56,500 and USD 2,980, respectively. This adds to the 40 Bitcoin and 320 Ethereum that the Company already holds in treasury.\n\n\"WonderFi is deeply committed to the crypto ecosystem and now is an ideal time to demonstrate our confidence in the long-term value of both cryptocurrencies,\" said Dean Skurka, President and CEO of WonderFi. \"The crypto market continues to evolve meaningfully, and this program is an excellent opportunity to take advantage of the long-term upward momentum we're seeing.\"\n\nOver 324,000 Bitcoin, with a current market value of over USD 18 billion, are currently sitting in corporate treasuries, according to BitcoinTreasuries.net.1\n\n1. As of July 9th, 2024, publicly disclosed Bitcoin treasury holdings can be found here: https://bitcointreasuries.net.\n\nABOUT WONDERFI\n\nWonderFi is a Canadian leader in regulated crypto trading with over $1.5 billion in assets under custody across all brands, including Bitbuy and Coinsquare.\n\nDesigned to provide investors with diversified investment exposure across the global digital asset ecosystem, the company has expanded its presence internationally to include operations in Australia, and through SmartPay, a global crypto payments platform.\n\nFor more information, visit www.wonder.fi.\n\nThis news release constitutes \"a designated news release\" for the purposes of the Company's prospectus supplement dated December 23, 2022, to its short form base shelf prospectus dated September 7, 2022.\n\nMedia / Investor Relations\n\nFor additional information, please contact:\n\nHayley Sucharek\n\nKaiser & Partners\n\nHayley.Suchanek@kaiserpartners.com\n\n289.681.2477\n\nCharlie Aikenhead\n\ninvest@wonder.fi\n\nForward-Looking Information and Statements\n\nThis press release contains certain \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable Canadian securities legislation and may also contain statements that may constitute \"forward-looking statements\" within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Such forward-looking information and forward-looking statements are not representative of historical facts or information or current condition, but instead represent only the beliefs of WonderFi Technologies Inc. (\"WonderFi\" or the \"Company\") regarding future events, plans or objectives, many of which, by their nature, are inherently uncertain and outside of the Company's control. Generally, such forward-looking information or forward-looking statements can be identified by the use of forward-looking terminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\", \"projected\", \"planned\", \"estimated\", \"soon\", \"potential\", \"anticipate\" or variations of such words.\n\nBy identifying such information and statements in this manner, the Company is alerting the reader that such information and statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such information and statements. In addition, in connection with the forward-looking information and forward-looking statements contained in this press release, the Company has made certain assumptions. Among the key factors that could cause actual results to differ materially from those projected in the forward-looking information and statements are the following: taxation, controls or regulations and/or changes in the administration of laws, policies and practices and political or economic developments in Canada and other jurisdictions in which the Company carries on business or in which the Company may carry on business in the future; and material adverse changes in general economic, business and political conditions, including changes in the financial markets and compliance with extensive government regulation, decisions to modify, pause or discontinue certain treasury management strategies. These risks are not intended to represent a complete list of the factors that could affect the Company; however, these factors should be considered carefully. Should one or more of these risks, uncertainties or other factors materialize, or should assumptions underlying the forward-looking information or statements prove incorrect, actual results may vary materially from those described herein. The impact of any one assumption, risk, uncertainty, or other factor on a particular forward-looking statement cannot be determined with certainty because they are interdependent and the Company's future decisions and actions will depend on management's assessment of all information at the relevant time. A more fulsome description of risk factors that may impact business, financial condition and results of operation with respect to WonderFi is set out in its management's discussion and analysis and financial statements for the period ended March 31, 2024, available on its SEDER+ profile at www.sedarplus.ca.\n\nAlthough the Company believes that the assumptions and factors used in preparing, and the expectations contained in, the forward-looking information and statements are reasonable, undue reliance should not be placed on such information and statements, and no assurance or guarantee can be given that such forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information and statements. The forward-looking information and forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake to update any forward-looking information and/or forward-looking statements that are contained or referenced herein, except in accordance with applicable securities laws. All subsequent written and oral forward-looking information and statements attributable to the Company or persons acting on its behalf is expressly qualified in its entirety by this notice. All financial amounts referenced herein are in Canadian dollars unless otherwise expressly identified.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/216058"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQX0F5bF9XaUUzWmxQWjBUT2dyV21VUUxlcUlvcm45b3dsYUUzb0VqcWYwdERLSUp3WGdmQ1gwTWhjeUVmM3U5RHlhcWtXcXl1VTRqZ0JNRksxLU1oWWFpQ1ZZZXhKSnB0TGNodkxNc0RramJoeXUwdXY4d29TZGNCTkhvQ0Y1bDVQc0dOX1d2b2p4eVhBMVFGRDNkT0x2LUxmUElIUU9MckQwQUtxQkc3WThaRkFfa0ZOTU90Y2lvSldtc0tJWTdCRkFnLUxYMy1NcW9KN1FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum's Bull Case: '$5,000+ In 2024, But It Won't Be A Straight Road,' Says Trader - Benzinga",
        "content": "Crypto trader and researcher Teng Yan predicts a bullish future for Ethereum ETH/USD, forecasting a value of over $5,000 in 2024.\n\nWhat Happened: In a Tuesday post on X, the trader anticipates the launch of spot Ethereum ETFs around July 15, which he believes could trigger a relief rally.\n\nYan also expects the initial spot ETF flows to surpass expectations over 12 months. He argues that traditional finance investors who have invested in the Bitcoin BTC/USD ETF will likely diversify by buying ETH as well, thus capturing a broader segment of the crypto market and reducing perceived single-asset risk.\n\nThe trader expects Ethereum prices to reach $5,000 or higher in 2024 and also there is a lot to be bullish about in the near-midterm. However, he cautions it will not be a \"straight road.\" He added, \"With the summer holidays, big capital may not be available to buy until August.\"\n\nAlso Read: Ethereum Traders Offload $41M In ETH, But ‘Bears Will Get Exhausted,’ Trader Asserts\n\nWhy It Matters: Yan’s bullish forecast comes at a time when Ethereum sentiment is at its lowest despite the imminent ETF launch. He believes that many sidelined investors and traders perceive the current market as a bear market inflection point. However, if prices start rising convincingly, these investors will likely buy back in.\n\nYan also points out the improving macro environment, with markets pricing in a 73% chance of a rate cut in September. He also mentions the possibility of Trump winning the election, which could result in a better regulatory outlook for crypto.\n\nThe trader also foresees a better regulatory outlook for crypto as Donald Trump holds a good chance of winning the election.\n\nWhat’s Next: The influence of Ethereum as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQTUU4TDVMRzNxeWcyb3dDcl9pVXhhRFlCUy1la2x5M3kya2drVXZxRWUxM183WUZJTXJadE4zLTRfMEUyNHpMQlhKRVRhUlVEa0FHZFdCN2czMFNuNEYwdnRWRHVnajFfOTFUM0FlM3NRY0Z2VVBVTVpXRml2V1lvN29PN2NrNV9HWENTVF9vOFNRQmh5UXpPeTRFMW9NdzZyU0tRMlF4aXItWEhtNThWTGJadDdVX3M4c2lBRHNRNmZsNkktSUF1X2dJSjZsUWZfUEFVU0RfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "ETH Price Analysis: Staking Deposits Hit $100 Billion ahead of Ethereum ETF Official Launch - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPYUZMMWs2MmpjdlFpY25XRnJBbUhnZjBrWjBUX1E4bmpMTnl2X3c4RE42Zkt4V2tIaUtxcXVtdkRDdnhjQ2JWMGVodzZiU1REdTBHWXFZQzZuRDQ1NVR2RUExT2had3hxVUp5eTAtckNHRnBLemhtdTVpZ3BwVkRRNE1sOUNxdUtIWFUtd1gzM0kwRVJNYm4xMVgzeXl3SERyYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CCO says Ethereum ETFs ‘close to finish line’, SEC open to other funds - CryptoSlate",
        "content": "Bitwise CCO Katherine Dowling said spot Ethereum ETFs are “close to the finish line” while noting that the SEC is “quite welcoming” about discussions regarding other products.\n\nOn July 9, Dowling told Bloomberg that the SEC and ETF issuers are addressing fewer issues in each S-1 amendment, pointing to a close launch.\n\nDowling affirmed SEC chair Gary Gensler’s assertion that the agency will fully approve issuers’ registration statements over the summer but described an open time frame. She said:\n\n“You know, everyone has a different definition of summer. It’s been a little bit of a long, hot summer for the issuers waiting ….”\n\nDowling said that Bitwise intends to set itself apart from other applicants, including giants such as BlackRock and Fidelity, as a “crypto specialist” with years of focus on the sector.\n\nBitwise filed its most recent amendment on July 3, while many other applicants filed on a July 8 deadline. Applicants must still add certain details, including sponsor’s fees, in future amendments.\n\nSEC welcoming to other discussions\n\nDowling also said that Bitwise has spoken to the SEC about potential new products “coming down the pipe.” She described the conversations positively, stating:\n\n“I think our communication with the SEC about the prospects for these products has actually been quite welcoming.”\n\nHowever, she agreed with Bloomberg ETF analyst Eric Balchunas that some products may only be approved under a new SEC chair.\n\nOtherwise, she said, it could take considerable time to bring the products to market due to the history of previous product approvals and the lack of future markets underlying the potential products.\n\nDowling did not identify the products in question. Currently, the only other pending spot crypto ETFs are VanEck and 21Shares’ spot Solana (SOL) ETFs.\n\nBitwise has not applied for a similar product as of press time.\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQR19qalNKX1JUcXNmcE9JaDhEcHV1Qm5fZzVnck1PNGlYTHYyaUEwcmFoVmViOGpWblBxS05NcHZrZTZoMm5VdUM5Ty1abW14WF9hUEZGSENCalI4MFVWV1dLbjdSUkFfVlo4RDc4T1JMSExuZlFhRm8wdEZHakhWMFpmTEI3T2ZlUW1TSEN6YW9ITnVDY1JKekFRQVFsa09hT0cyWHB4VURyLVEybUdDckluQdIBuAFBVV95cUxPWjk4UjAwSG1UZVdMSFBUeGd1NU01dDlQOS1OWTJubjVMcGNYMmkxNWd4VThaMm1HTXJfQU5BYUNfdWFreG5uVkpfLXVaZWJEeEZUdXd3bThBQnY4OFNOQnVPUDVsWGVtNnE1Wm9STV9CUUtwS1BjYWM3c1lkTHlxSF94UEVPOFBDb2xVUl9JZXp0b0JFeXNzRC1LSmVkcTRVM1ZLOVVCem9WZjVuNFVMSEV5ZDRkV2hC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top Crypto Analyst Predicts Swift Ethereum Recovery, Says Big Run Coming for ETH - The Daily Hodl",
        "content": "A widely followed crypto strategist believes that the leading altcoin Ethereum (ETH) is close to carving a mid-cycle bottom.\n\nIn a new video update, pseudonymous analyst Bluntz tells his 264,400 followers on the social media platform X that Ethereum is about to conclude its ABC corrective wave.\n\nBluntz practices the Elliott Wave theory, which states that a consolidating asset tends to witness an ABC correction before igniting a fresh five-wave surge.\n\n“Looking at ETH/USD, we’re basically down here at the lows again, but I think it would be very odd if we just moved up from here…\n\nI think ultimately ETH needs to sweep $2,800, take out the low and reclaim it and then finally we would have what looks like a proper ABC down on Ethereum… [I think] we go sideways here on ETH for a little bit and take the lows and then look to bounce.”\n\nAccording to the analyst, Ethereum’s ABC correction will eventually resolve to the upside, sending ETH initially to a new all-time high of $6,000 before pulling back and rallying to a cycle top of $8,000.\n\n“I still firmly believe ETH has not had its big run yet and I do think it will definitely be coming this cycle. It’s just late.\n\nIt’s probably going to be induced by the ETH ETF narrative, which is supposedly coming out any day now. Everyone’s talking about it, everyone’s expecting it to be this giga-bullish ETH news. So I think what will most likely happen in my opinion is ETH will sell off first, take the lows, f**k everyone over and then start to get bid up heavily.”\n\nAt time of writing, Ethereum is worth $3,048.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE4zWURYZjBEZ2pCZGxoZHNVM0NrNENWaktUTU5fZklWRU1mU05iUmRjcHhvaGlKemFuaHNrdS1ULUFRQUE2TEZGdU1LVkI4cFJVSDlESG5MNzdIYzNtc1ZhRzdhZmxPTGZjN2fSAW9BVV95cUxPZENUZkxkTnc4OVZqVmdWOEJudEtBQW5YVFVrOWVGUWxPMkpWclJlcFBuR01uY3pPRzBVeFFEdnhqa3pHYWw4akhJalFVbXphemVJWGE5b1dvWXhyMS1EUnZ6c0tqVmQyNkZlMjBLbms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Will Ethereum ETFs Flop? Opinions Are Mixed - U.Today",
        "content": "The leading analysts and pundits are divided when it comes to predicting how Ethereum exchange-traded funds (ETFs) are going to perform following their much-anticipated launch.\n\nAdvertisement\n\nBloomberg’s James Seyffart recently spoke about this sentiment. The analyst says that half of his audience thinks that Ethereum ETFs attracting at least 20% of the assets recorded by Bitcoin ETFs would be considered to be very bearish. At the same time, the other half would view such inflows as super bullish. “No one knows anything,” the analyst summarized.\n\nFor instance, banking titan JPMorgan is convinced that they are going to attract only a small fraction of the inflows logged by Bitcoin ETFs. Its researchers estimated that its inflows could be as low as $1 billion this year. This, of course, would not bode well for Ether bulls given how dominant the ETF narrative has been over the last few months.\n\nAdvertisement\n\nMike Novogratz's Galaxy Digital is way more optimistic, predicting that these products could attract up to 50% of the net flows into Bitcoin ETFs in just five months. Cryptocurrency exchange Gemini has predicted that Ether ETFs could see up to $5 billion worth of inflows.\n\nIt is worth noting that the launch of Ethereum futures ETFs was a massive flop with \"shockingly low\" volumes. This is unlikely to be the case for spot ETFs due to the involvement of major names such as Blackrock and Fidelity, but it remains to be seen whether they will be able to hold a candle to their Bitcoin counterparts.\n\nAs reported by U.Today, the SEC is expected to complete the approval of several spot Ethereum ETFs this month after several potential issues submitted their S-1 forms earlier today."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNeHZoVmxYX0l2aUJCb2NzMEQtR0JPQy1QX3NCbXlLSV9SdmZjYWZybDhaSVI4TDdWMjZzYmVSUUdCRS1vc3NwTVphazA5S2UwSmtSZjlndFNRSjZsSWhITWdUQjVVNU14Szlqc0liR0g3dFdjYjZkOGgtbUZFcUgwcVphZmhlY2VnZ0NRSG90WlJHXzRYWVHSAZsBQVVfeXFMTlZHaDhPYmY2UnNybF93NGhPbzBzREoxbml1Sm5HcGlWVEMwNTQ4ZzI1S3dlN0FuMXZybURteUxCUUhpbHhRNUxranlxeE13MElKNmpYNU5NaDRnbjNSSW14SUpkaU9Ea3dzYV9PN0hrWUdDeC1XOHhrUVhXRllfSE9TZFdTQ2wza0JnZHZzLUdEeWlyNXY2ZWRUb00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum rebounds, whales scoop ETH: Will the ETF approval boost gains? - AMBCrypto News",
        "content": "Ethereum whales are actively accumulating, with recent large transactions signaling renewed confidence.\n\nAnticipation of Ethereum ETF approval drives significant institutional inflows, suggesting bullish sentiment.\n\nEthereum’s [ETH] price increase has triggered heightened activity among large holders, commonly known as whales.\n\nFollowing a week of downward momentum, ETH’s price has seen a resurgence, leading to substantial transactions by whales.\n\nAs of the time of writing, Ethereum was trading at $3,113.58 with a 24-hour trading volume of $14,340,649,075, according to CoinGecko.\n\nThis was reflected in a 1.07% price increase over the past 24 hours, although the cryptocurrency has experienced a -7.46% decline over the past seven days.\n\nThis uptick in price has catalyzed increased accumulation by whales, signaling a potential shift in market sentiment.\n\nSignificant whale movements\n\nRecent on-chain data indicated substantial activity among Ethereum whales.\n\nNotably, Spot On Chain, an on-chain data provider, reported that an Ethereum whale withdrew 16,449 ETH, equivalent to $50.3 million, from the crypto exchange Binance [BNB].\n\nThis move came as ETH surged past $3,000, marking the first notable accumulation by a new whale address. The withdrawn ETH has since been transferred to a new wallet and remains there.\n\nFurthermore, Whale Alert noted another substantial transaction involving 9,966 ETH, equivalent to approximately $30.6 million, transferred from the Kraken exchange to an unknown wallet.\n\nThis activity aligned with a broader trend of whales resuming their accumulation of ETH following a period of distribution.\n\nAli, a known analyst on X, commented,\n\n“After a brief distribution period, #Ethereum whales are back to accumulating $ETH!”\n\nThe number of addresses holding over 10,000 ETH has declined since mid-April and began to rise again in early July.\n\nThis trend suggested that some mega-whales reduced their holdings during the price decline but are now increasing their positions.\n\nThe timing of these large-scale withdrawals and accumulations coincided with the market’s anticipation of the Ethereum ETF, which is expected to go live next week.\n\nThis development is a potentially bullish signal for Ethereum, as it could attract further investment and drive up prices.\n\nPotential impact of Ethereum ETF approval\n\nKatherine Dowling, Bitwise’s Chief Compliance Officer, has affirmed that the approval of the spot Ethereum ETF in the U.S. is approaching.\n\nWith issuers submitting their S-1 amendments, analysts expect the approval around the 18th of July.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThis has led to a surge in inflows into Ethereum investment products, with institutional players accumulating ETH ahead of the ETF approval.\n\nLast week, Ethereum investment products saw inflows of $10.2 million, indicating growing interest from institutional investors."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPc3BhVnBERjVfTVFmbzZkUExjUDdwemg3dmo3dGd5S0ZKczJ6SGxDMnhtS1h3bmg5SVNPaGxfRjh5b3lndUVLdHpRYl9NUHFpb3JiSTBCajBraUhUb09wWjI1QXZDa19nY2J3QlRJTG5IOVdNLWZEV1h3ZkJSLU91QVlFa0NCSno1YWN0OXl3eFJJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "How to Convert (Swap) Ethereum (ETH) to Bitcoin (BTC) - Finance Monthly",
        "content": "Imagine standing at the crossroads of the digital currency universe, where two of the most influential cryptocurrencies, Ethereum (ETH) and Bitcoin (BTC), intersect. This is not a mere intersection, but a gateway, a portal that allows you to convert one cryptocurrency into another. As a result, the question of how to swap ETH to BTC arises. Today, we will guide you on the journey of ETH to BTC swaps.\n\nThis journey is not just for the seasoned crypto navigators but also for those who have just set sail in the vast ocean of digital currencies. Knowing how to convert Ethereum to Bitcoin is like having a magic key that can unlock new opportunities for investment and diversification. Follow this guide to navigate the process and learn all about the exchange of two major players on the market - ETH to BTC.\n\nWhat is Ethereum (ETH)?\n\nEthereum (ETH) is not just a cryptocurrency but more of a decentralized global computer. It was funded through crowdfunding, making it decentralized from the start. Ethereum is in the process of a significant change from Proof-of-Work to Proof-of-Stake. With a market cap of $198 billion, Ethereum is the second-largest blockchain network in the world. It hosts nearly 6,000 decentralized apps (DApps) and functions as the base infrastructure for several crypto trading platforms, DeFi protocols, and NFT marketplaces.\n\nWhat is Bitcoin (BTC)?\n\nBitcoin, although less mysterious and more widespread, also has some intriguing aspects that are not widely known. For instance, a bug in 2010 led to the accidental creation of 184 billion BTC, far exceeding the intended maximum limit of 21 million. However, this issue was quickly rectified, and the maximum limit was reinstated. Another interesting fact is that the smallest unit of bitcoin is called a “satoshi,” which is equal to 0.00000001 BTC. Together, all these make the question of how to swap ETH to BTC even more important.\n\nWhy Do Users Swap ETH to BTC?\n\nUsers might look for ways to convert ETH to BTC for various reasons. One of the primary reasons is portfolio diversification. By holding a diverse range of cryptocurrencies, investors can mitigate risk across different assets. Due to the high volatility in cryptocurrency values, maintaining a variety of assets can safeguard investments against market fluctuations.\n\nWhere to Swap ETH to BTC?\n\nThere are several platforms where users can swap ETH to BTC. These include places like Coinbase, Binance, Kraken, and more. However, the majority of our readers prefer SimpleSwap as a convenient way to convert ETH to BTC. The platform stands out as a reliable and user-friendly platform for swapping ETH to BTC\n\nHow to Swap ETH to BTC: Swapping Guide\n\nOne solution for those wondering how to transfer ETH to BTC is through a platform like SimpleSwap.\n\n1. Choose the crypto pair.\n\nSelect ETH in the “You send” section and enter the amount you wish to exchange. Then choose BTC in the “You get” section. Click “Exchange”.\n\n2. Add the recipient’s address.\n\nEnter the recipient’s address. The ETH will be sent to this address after the exchange.\n\n3. Send the deposit\n\nYou’ll see an address to send the indicated amount of BTC to continue your swap.\n\n4. Get cryptocurrencies\n\nAfter receiving your deposit, SimpleSwap will convert it and send the ETH to the wallet address you provided.\n\nHow the Exchange (Swap) Process Looks Like\n\nBefore we delve into the specifics of how to exchange ETH to BTC, let’s pause to comprehend the procedure. By following a well-defined and organized approach, you can facilitate the exchange process with ease and efficiency. It’s important to note that this procedure is not exclusive to the method to buy Bitcoin with Ethereum - it can also be applied to any crypto pair.\n\nBenefits of Exchanging ETH to BTC\n\nSwapping the two can offer several benefits, some of which are discussed below:\n\nDiversity of Your Cryptocurrency Portfolio\n\nThe exchange allows you to distribute your investments across multiple cryptocurrencies, taking advantage of the distinct strengths and opportunities each coin presents. This strategy can reduce the impact of volatility in any one cryptocurrency and potentially improve the overall performance of your portfolio.\n\nPotential for Higher Returns\n\nHistorically, Bitcoin has demonstrated higher returns than Ethereum. While past performance does not guarantee future outcomes, many investors exchange ETH for BTC with the aim of benefiting from Bitcoin's market trends and its potential for high returns. However, it’s crucial to understand that higher potential returns also come with greater risk.\n\nLarger Market Volume and Broader Application\n\nBitcoin, being the first and most widely adopted cryptocurrency, has a larger market volume and broader application than Ethereum. This means Bitcoin is accepted and recognized by more businesses and individuals worldwide, making it potentially a more liquid and versatile investment. Swapping ETH to BTC could therefore offer more opportunities for use and potential appreciation.\n\nLower Transaction Fees\n\nBitcoin transactions generally have lower fees compared to Ethereum, especially during periods of high network congestion. This can make Bitcoin a more cost-effective option for frequent transactions. However, transaction fees can vary and should be checked at the time of the transaction.\n\nConclusion\n\nIn conclusion, the choice of how to convert ETH to BTC can be a strategic move both in the short term and in the long term. While the process may seem complex at first, platforms like SimpleSwap make the process straightforward and accessible. As with any financial decision, it’s important to do your research and understand the potential risks and rewards."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9kQmlhUmFyNlVQbUQtVm44UVZzN0M3YnFtbWhPZnJzX28weVNtT1VOOHlsbVhpenhzUUZVR28tbjkzeFdSa1R3VWY5VjdGMHM4LThUYmNKVVpvRDZfWEpobm01VkNDVEVDU2pvMmFCODNtUDZRSW5CdUtR0gF_QVVfeXFMUEdFVUxlWU5wVFVEVDdqLVNkclhmcm1XbnIwZm91eVpWMU5sYW84eEV4b3p3am90b3o2dHhjMVN3bG52ZUxOdEw3T0tUQWxsa0pOeTJ3VDFNZE9WSVljT3BxNFgtbHFmcUNJR0ZNUkdmMXpZUC1ab29FNXRObHJySQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Free From Massive Sell-off From Top Whale - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) has just been freed from an aggressive sell-off by a top whale, spotted about a week ago. According to data from crypto analytics platform Lookonchain, the Ethereum whale, identified as the open-source decentralized computing platform the Golem Project, just staked 40,000 ETH. This staked fund is worth $124.6 million as of the time of staking.\n\nAdvertisement\n\nEthereum freedom after intense Sell-off\n\nPer previously referenced posts by Lookonchain, the Golem Project started sending thousands of ETH to centralized exchanges on July 8. In the first wave of the sell-off, the protocol sent 24,400 ETH worth approximately $72 million to Binance, Coinbase and Bitfinex.\n\nGolem Project was one of the foundational beneficiaries of Ethereum ICO as far back as 2016. At the time, the protocol raised 820,000 ETH when the price of the coin traded for just $10.2.\n\nWith the sell-off activated, this week, the outfit also moved another 4,600 ETH, valued at $14.1 million, to Binance and Bitfinex, as of July 9. On July 10, another 3,000 ETH deposit was made to Binance, Bitfinex and Coinbase.\n\nThe staked Ethereum was also moved on July 10, and while many feared further selling off, the Golem Project decided to lock up the funds for now.\n\nPerfect timing\n\nEthereum is the second major cryptocurrency responsible for the broader market sell-off at the moment. While the spot Ethereum ETF sentiment is expected to sustain sentiment and price growth, the reversal is the case.\n\nIn the early stages, investors looked to the ETF as a major catalyst to drive growth and, hence, went all out to buy the coin. With Bitcoin losing its position in the industry, the ripple effect on Ethereum saw many HODLers offloading their bags.\n\nKnowing its sell-offs might trigger a market slump, the Golem Project decided to sell its bag at a time when the impact would be least felt."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQcFBETVhPM0xONWVpX1BXMDhYaldob3ZSdWRfUHE0dHNqY1VmTVI4VUllNFBNVUwwV290RVB1bklVQ2N0ajlLMFNhdTR3c1F4UXpOZENiTXo0dXJTdHlxYjhpRk9NNWJvd2s2WFdFcHFZc0phUTBsaHpaT3EzLTQxa3U3RDU2M0Z1QWw2UldZcEVzVU1oZXp4dXkyckxBbXEwNkt3ZFVsUUbSAa4BQVVfeXFMT0M4dGd3VVNUdHV3WXJxa0tkdnpzOURlQXRVVGtCWDBUZkdNaUVHa2pSLWh0WUVqd3RzMHdnUlU1Q3NXTHBob0JGNmh1V1MyNlIteEpwamJ2WU9jVmZIcXZNVDBHR2RfLXNleVNTaXFnNHNqWXFPVGxUTUY1ZHhDVU96NWNuQzFVTF9KM0N4dk51NEpkNlVuSllsWlpUbEY2YmNJaFpaUEREMXZXUjln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "How Staking Rate Benchmarks Can Build Digital Assets Markets - CoinDesk",
        "content": "The CESR benchmark offers a tool for operators to measure and enhance their performance within the Ethereum ecosystem. By leveraging CESR alongside operational metrics like Rated RAVER , operators can achieve greater transparency, trust, and efficiency. As the Ethereum network continues to evolve, these benchmarks will play an increasingly vital role in guiding and evaluating validator success. CESR will continue to be used by market participants, validators and financial institutions worldwide when engaging in products that reference Ethereum as the first bedrock financial rate of return for the Internet."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPM2luVTBCNVc0SExLNndvWkE0OVY3WVFheTZmVUhxTk1NalRmRlZ1ZlZlX1h6YkZhWDFPdVFQV2ZWdGdGdGJ3ZGpGWnMwOUVLeHdoYnpTODBINjlSbUZsQWRSdUZpTGU1eUxZRTI2dWsteUhBaUdPcW9qNDVqWGE2cjYtTF9XTk1nWHJhYnJVeGxXa1Nr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum braces for spot ETF boost as 40% of supply remains locked - CryptoSlate",
        "content": "Approximately 40% of Ethereum supply is locked as the market anticipates the final approval for ETH spot-based exchange-traded funds (ETFs).\n\nA breakdown of this “locked supply” shows that over 33 million ETH is staked on the network, representing around 28% of Ethereum’s total supply, according to Dune Analytics data.\n\nProof-of-stake networks like Ethereum require users to “lock up” their digital assets to support its security and operations, and in return, they earn rewards.\n\nAdditionally, 12% of the supply is locked in smart contracts and bridges, which are seeing high adoption lately. For example, A.J. Warner, Chief Strategy Officer at Offchain Labs, noted that ETH in the Arbitrum One bridge has consistently increased over the past three years.\n\nMarket observers believe this substantial ETH lockup and the impending ETF approval will boost ETH prices. Tom Dunleavy, Managing Partner at MV Capital, pointed out that the approval of spot Ether ETFs will significantly impact the market. He stated:\n\n“The spot ETH ETF flows are going to rapidly move this market.”\n\nETF approval\n\nMeanwhile, anticipation continues to grow surrounding the final approvals for a spot Ethereum ETF in the United States.\n\nOn July 9, Bitwise’s Chief Commercial Officer, Katherine Dowling, said the ETFs are nearing approval, pointing out that the Securities and Exchange Commission (SEC) was addressing only a few remaining issues.\n\nDowling suggested the products might be approved over the summer, a sentiment echoed by Bloomberg ETF analyst James Seyffart.\n\nSeyffart speculated that approval could come by the end of the month despite his low confidence in exact launch date predictions. He said:\n\n“I have fairly low confidence in those launch date predictions at this point. There’s no deadline & SEC’s Corp Fin is taking its time here (I don’t blame them). But these changes were very minimal and [i don’t know] why the ETFs wouldn’t be ready to go within a couple of weeks.”\n\nMeanwhile, crypto bettors on Polymarket expect the products to launch before the end of the month, with an 87% chance of being listed for trading by July 26.\n\nMentioned in this article"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBtdzNIakdkeEliN01BYXZGd0tFcmhpWDN5a3FEamlKVTMxSGsyRXhuYVVsdWxNQmtJWHpUNlc0T3hYc08yNU1MbTJZM2hCLVVJS1plVXI5MmRaeG9WYmp5Y1VwRk5VN0V0dktB0gFwQVVfeXFMUFdOQXBjQ3dVTjJjWXF0YWI0SGxzalFOUTNRLUY5S1l5bE1Xb2Uzd1hTN2szT0RuazdSbnBCNF8wRG56ZXk0QTgtc1lXWXlRNWFINVBHS19hOWxNVGNMWEpsUlR0UE5pZ21QMmJyZV9fOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "What is ENS? Ethereum Name Service Explained (Updated 2022) - CryptoPotato",
        "content": "Back in the days, when the Internet wasn’t so mainstream, one of the main problems that users faced was that domain names hadn’t been matched up to Internet protocol (IP) addresses.\n\nThis made them very unfriendly towards the average Joe, who had to type in the IP address of the website they wanted to visit, as in to type in the numbers literally.\n\nUnlike traditional IPs, cryptocurrency addresses represent even longer strings of numbers and letters. If a user wants to send another user funds over Ethereum’s network, they would have to input the address and make sure that each number and letter is written correctly.\n\nQuick Navigation\n\nIt’s also important to know that blockchain-based technology is very punishing in this regard. If you fail to input the address correctly and mistype a letter, the funds you send will be irreversibly lost. There’s no central authority to contact to reverse or refund the transaction—that money is lost.\n\nAnd just like Domain Name Services (DNS) came to life when using the Internet, the Ethereum Name Service (ENS) came to be.\n\nWhat is Ethereum Name Service (ENS)?\n\nEthereum Name Service (ENS) uses the same concept as the Domain Name Service (DNS) but adjusts it for the needs of Ethereum users. At its core, the Ethereum Name Service is a distributed, open, and extensible naming system operating on the Ethereum blockchain.\n\nIt aims to map human-readable names to machine-readable identifiers. In this case, the human-readable name can be something like “cactus.eth,” whereas the machine-readable identifier can be the Ethereum address (or other cryptocurrency addresses, for that matter.)\n\nIn the image below, we have given an example of what it looks like. The address belongs to the Ethereum Foundation. The ENS domain name that we created is just an example for the purpose of this guide:\n\nThe standard Ethereum Address is converted into human-readable text (foundation.eth). This means that users can send funds or interact with “foundation.eth” instead of the standard address. Obviously, this makes it much easier for regular users and also considerably tightens the possibility of a mistake.\n\nAccording to the official ENS documentation, the system “has similar goals to DNS, the Internet’s Domain Name Service, but has significantly different architecture due to the capabilities and constraints provided by the Ethereum blockchain.”\n\nSimilar to DNS, ENS operates on a system of dot-separated hierarchical names called domains. The owner of a domain also has full control over the subdomains.\n\nHow Does ENS Work?\n\nThere are two core components to the Ethereum Name Service. Namely, these are the registry and the resolvers. The architecture of the system looks like this:\n\nRegistry\n\nThe registry is composed of a smart contract designed to maintain a list of all the domains and subdomains while also storing three essential pieces of information about each. These pieces are:\n\nThe owner of the domain\n\nThe resolver of the domain\n\nThe caching time-to-live for all the records that are under the domain\n\nThe purpose of the ENS registry is very straightforward – it’s to map from a name to the resolver who’s responsible for it. Meanwhile, owners of domains in the ENS registry are allowed to:\n\nChange the ownership of the subdomains\n\nTransfer ownership of their domain to another address\n\nSet the resolver and the time-to-live (TTL) for the domain\n\nResolvers\n\nResolvers, on the other hand, are responsible for translating names into addresses. Every contract that implements the required standards can be a resolver in the Ethereum Name Service. However, resolving a name in ENS is a process that is composed of two steps.\n\nThe first one is to ask the registry what resolver is responsible for the said name. The second one is to ask that particular resolver for the answer to the query. In terms of architecture, it looks like this:\n\nThe Difference Between DNS and ENS\n\nThe Domain Name Service (DNS) was created in 1983 by Paul Mockapetris, a US computer scientist. It followed the research of another American scientist, Elizabeth Feinler.\n\nPut in simple terms, the purpose of DNS is to match internet protocol (IP) addresses with human-friendly domain names. This allows users to type in the website’s name instead of having to input the literal numeric IP address.\n\nIn a similar yet different way, Ethereum Name Service attempts to make it easier for people (and applications) to read and share cryptocurrency addresses.\n\nHow to Register an Ethereum Name Service (ENS) Domain?\n\nRegistering an Ethereum Name Service domain is pretty straightforward. All you need is a hot wallet such as MetaMask.\n\nGo to app.ens.domains (the official website for registering an ENS domain), and type in the domain name that you want to register. This will check its availability.\n\nOnce you have selected your name, all you need to do is follow the instructions given below:\n\nEthereum Name Service Governance\n\nThe Ethereum Name Service is governed by several different arms, each with its own significance.\n\nENS Token + Distribution\n\nThe ENS token is a standard token using the ERC-20 standard on the Ethereum blockchain. Its main purpose is to be used for the governance of the system.\n\nToken holders can submit proposals and cast their votes. The main place where community members can discuss ideas and have governance-related discussions is the forum discuss.ens.domains.\n\nThe ENS token was airdropped to early adopters who had previously registered an ENS domain name. The claiming process started on November 8th, 2021, and users had until May 4th, 2022, to claim their allotted tokens.\n\n25% of the total supply was distributed through the airdrop, while the rest is designated as shown in the following piechart:\n\nENS DAO\n\nIn the spirit of decentralization, the Ethereum Name Service is operated by a decentralized autonomous organization (DAO). The DAO is governed by holders of the ENS token, who can submit proposals and vote on them to determine the protocol’s future development.\n\nENS Foundation\n\nThe ENS DAO itself is represented by an existing Cayman Islands Foundation called the ENS Foundation.\n\nIt has a few purposes, including:\n\nTo comply with tax requirements because without a legal entity, DAO participants may be responsible for a certain proportion of the DAO’s income, even if they don’t have access to these funds.\n\nTo enter into contracts with other companies.\n\nTo provide limited liability for participants in the DAO for the actions of the DAO.\n\nConclusion\n\nENS is a critical advent in the cryptocurrency field and a step towards solving some of the pressing issues that riddle the industry – namely, user experience.\n\nHaving to deal with long strings of random numbers and letters is oftentimes the reason for mistakes, and in the field of crypto, mistakes are quite commonly very expensive. Normalizing addresses and presenting them in a human-readable and friendly way is a step towards improving the overall user experience, the way DNS improved the UX for Internet users.\n\nAt the same time, though, DNS records of domains and names are typically stored on centralized servers, making them prone to hacks. ENS, on the other hand, are secured by Ethereum’s blockchain, making them multifold and more secure.\n\nThat said, the Ethereum Name Service is undoubtedly an important invention and innovation that’s quickly become widespread and used by thousands of people."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5xWWxqdlBFM0x3ZXhVcmlXaVBRRXh3RXhLRkR1OVdleUVIOXRVSXRwQU9SOG8wbnIyWEI2d0FNVzg5Q2ZXTWwyLUJjUlcxYXdKWmRHdzdEWDJpODdRT2F1aml5eDg4R1Qtck5aTE9kNlVUejjSAXhBVV95cUxQRGhZNnUtRnE4eHhGdFpkaWRDZXAxWkIyb3JfWWhhN1ZKelYzNlFRWXl6MTNiTWg3ejRMRW5zdFgxeDlpb0lEVDVMZ3FjQkVIZDVDX0syWWdnX1pvTlZZc1VMaTV6dWlVSXMzMUQwRnBja05QbHBtaXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 11:37:14 GMT",
        "title": "Ethereum (ETH) Sets Major Staking Milestone: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain analytics firm Santiment, Ethereum (ETH), the second largest cryptocurrency by market capitalization, has just set a major milestone - this time in staking.\n\nAdvertisement\n\nStaking refers to the act of depositing 32 ETH to activate validator software. However, there is some flexibility, as any user with any amount of ETH can help secure the network, while earning rewards based on how much they want to stake. While 32 ETH might be required to activate being a validator, it is possible to stake less.\n\nValidators are responsible for storing data, processing transactions and adding new blocks to the Ethereum blockchain. This helps to secure Ethereum, while also allowing users to earn ETH rewards.\n\nAccording to Santiment, the ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high of 47.36 million ETH. Santiment regards this as positivity, with this figure accounting for 33.9% of the entire ETH supply.\n\n🤯 The ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high 47.36M ETH, This is good for 33.9% of the entire supply, and more than tripling since the 10.9% it held two years ago. pic.twitter.com/aCnEhfClfb — Santiment (@santimentfeed) July 10, 2024\n\nSantiment noted a trend of growth in ETH staked, pointing out that this has more than tripled from the 10.9% the ETH2 Beacon deposit contract held two years ago.\n\nThis milestone remains significant as the network gets stronger against attacks, as more ETH is staked because it requires more ETH to control a majority of the network.\n\nIn another significant milestone, Blackrock's BUIDL fund operating on the Ethereum network continues to attract new investors. The fund requires a minimum entry of $5 million, and its total assets have nearly reached $500 million.\n\nEthereum price action\n\nAt the time of writing, ETH was trading down 0.29% in the last 24 hours at $3,079. In the short term, the $2,850 level is being eyed as a solid support for ETH's price action.\n\nThe $2,850 support cracks, the selling may increase and Ethereum may begin a downward trend to $2,200. The bulls are likely to strongly defend this level.\n\nAlternatively, if the ETH price bounces off its current level and goes above $3,110, it might signal the beginning of a relief rally above $3,200."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBlZGw1eDhyY2pYMzRQQUFYU3NJakFmY01ucGJDV1doOEZEUk1vUGp1MFM5OTlrc2JqVkw5eUZIVzNCdm1lejAycS0wVFJ4REI1YXVjM2hiYl8yMXI4UmdjS0hMWU9LU2JYSTBjYUNOS1p5eUcxSHROeS1yRGNiY2vSAYQBQVVfeXFMTnZwOHc3VlN4bWJQRUp6SlZaUmpyWXJwMS1ONjh0akpFd3dWNWdQLW01MHVfdmNBdV9tTGhNV3RaVjFYR0dqSjFaeUt5ZVltMkxkUEx1VHdZWFl4Z1B4LWxYQUdMS0JhRWtITGE2alBVYjQ5REtHZmdveTlLQjJhUEkyQWdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, has once again sparked speculations among crypto market participants. Meanwhile, all eyes are on the crypto amid soaring anticipation over a potential Ether ETF launch soon.\n\nHowever, ETH has recently reclaimed the $3K level, but on-chain data indicates that it faces significant resistance at $3,200. So, let’s take a closer look at why the $3.2K level poses a significant threat to Ethereum’s price.\n\nadvertisement\n\nEthereum Holders Ready To Sell ETH\n\nA recent Into The Block data revealed that approximately 2 million addresses that previously traded Ethereum at around the $3,200 price level are currently holding ETH at a loss. This paves the path for potential selloffs as these addresses break even with price gains ahead, adding selling pressure to the asset.\n\nHowever, a bullish catalyst in the pipeline might prevent this from happening. For context, the approaching launch of an ETH ETF (exchange-traded-product) could serve as a catalyst for a remarkable rising price action in the future. Aligning with this, the commencement of ETF trading could counteract the selling pressure, in turn generating positive momentum in the asset due to money inflow.\n\nHowever, it’s worth noting that Ethereum has continued to struggle to reach its resistance level of $3,200.\n\nAlso Read: Institutional FOMO On Spot Bitcoin ETF As German Govt Continues BTC Sell-off\n\nETH Price Faces Turbulency\n\nAt press time, the ETH price showed a 0.20% dip in value, trading at $3,100.56. The token’s 24-hour bottoms and peaks were $3,025.51 and $3,129.02, respectively.\n\nCoinglass data further validated ETH’s turbulent movement, spotlighting an uncertain investor sentiment in the market. ETH Futures OI jumped 0.51% to $12.67 billion, while its derivatives volume dipped 30.71% to $21.15 billion. Notably, the RSI was recorded to be hovering at 40, underscoring that the asset is neither overbought nor oversold.\n\nHowever, it’s crucial to note that the current market sentiments could take a paradigm shift ahead with the approval of spot Ethereum ETFs. CoinGape Media recently reported that a whale bagged a staggering 16K ETH in light of the looming ETF.\n\nAltogether, broader market sentiments remain optimistic about Ethereum’s future price movements, although traders and investors currently exercise caution due to the highly volatile nature of the crypto realm.\n\nAlso Read: Solana ETF Approval Stands Strong: VanEck Exec\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOeUNIQjJJODBQX3hjN1hyMzV3ZVdyUFphWURGZkhDUEVsclNCaVBZbHpHRERrZDZKQ0xkUkdJcGJPcTFqanVEWk9vM1c1dGtEMFVYX3lrY2JTR251YXMxc2VJYWJ3YlNTZVkyRk5TSEdBSEQ4QzVmbldpdC1HTmJJQkRuSFFWUWlURVk0N3gtaHpScHpUNjRoT1l1Unk5RXFqY2V3OHozaGhlcWl3b2R6ZFVNd2hmWVhBeUo5OUpWelhCOU9zOUFxQVRGV3d2Sm5iUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "The strengths and weaknesses of Ethereum according to Vitalik Buterin - The Cryptonomist",
        "content": "The co-founder and intellectual leader of Ethereum, Vitalik Buterin, recently shared his thoughts on the strengths and weaknesses of the blockchain during the EthCC (Ethereum Community Conference) held in Bruxelles.\n\nAddressing a packed room, Buterin offered an honest assessment of the current state of the platform, outlining both the challenges and opportunities that await Ethereum.\n\nThe strengths of Ethereum according to Vitalik Buterin\n\nButerin began his speech by highlighting the numerous strengths that have contributed to the success of Ethereum. One of the key aspects he pointed out is Ethereum’s ability to support complex smart contracts, which have enabled the creation of a vast ecosystem of decentralized applications (dApp). These applications range from decentralized financial services (DeFi) to non-fungible tokens (NFT), demonstrating the versatility and breadth of the Ethereum blockchain.\n\nFurthermore, Buterin spoke about the robust development of the Ethereum community. The platform is supported by a global community of developers, researchers, and enthusiasts who constantly contribute to the improvement and security of the network. This community not only develops new technologies and applications, but is also engaged in the governance of the network, ensuring that Ethereum remains a decentralized and democratic platform.\n\nAnother strength cited by Buterin is the transition to Ethereum 2.0, which represents a crucial shift from proof-of-work (PoW) to proof-of-stake (PoS). This change will not only significantly reduce the network’s energy consumption but also increase the scalability and security of the platform, making Ethereum more sustainable and capable of handling a larger number of transactions.\n\nThe weaknesses of Ethereum and the solutions\n\nDespite the numerous successes, Buterin has openly acknowledged the current weaknesses of Ethereum. One of the main problems is scalability. The Ethereum network has struggled to handle a high volume of transactions, resulting in high fees and long confirmation times. This problem has become particularly evident during periods of high demand, such as the bull of DeFi and NFTs.\n\nButerin also spoke about the challenges related to security. Despite the ongoing efforts to improve the security of the network, Ethereum remains vulnerable to various types of attacks, including smart contract exploits and network-level attacks. The complexity of the platform and the wide attack surface require constant vigilance and continuous innovations to maintain the security of the network.\n\nAnother area of weakness concerns usability. Buterin emphasized that, despite significant progress, the user experience on Ethereum remains complicated for non-experts. The setup of wallet, the management of private keys, and the interaction with dApps can be discouraging for new users, limiting the mainstream adoption of the technology.\n\nButerin concluded his speech by outlining strategies to “strengthen” Ethereum and overcome its weaknesses. The solution to scalability, he explained, lies in technologies such as shards and rollups. Shards will allow Ethereum to divide the workload among different parallel chains, significantly increasing the network’s capacity. Rollups, on the other hand, aggregate many transactions into a single one, reducing the amount of data that needs to be processed by the main network.\n\nRegarding security, Buterin emphasized the importance of continuous research and collaboration with security experts to develop new protection mechanisms. He also highlighted the importance of bug bounty programs and security audits to identify and fix vulnerabilities before they can be exploited.\n\nTo improve usability, Buterin has proposed a series of initiatives aimed at simplifying the user experience. These include the development of more intuitive interfaces, user education, and the implementation of safer and easier-to-use custody solutions.\n\nConclusion\n\nThe intervention of Vitalik Buterin at EthCC provided a clear and honest view of the current state of Ethereum, highlighting both its strengths and weaknesses. His reflection was a call to action for the Ethereum community, encouraging developers and users to collaborate to overcome challenges and continue to innovate. With the right strategies and a collective commitment, Ethereum is well positioned to strengthen its position as a leader in the world of blockchains and smart contracts."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOU1JRZFYtZUJuam9Fd2RoZ0NEbEY1QTQ0NExFY3RSLWlXSUV1TUNldWMxbWIwZ1VrYllLSndsVGhiSnEwbUp2RFVZTkkxOU1FYmU3QkctXzhWa3d1MGdqVy1rckZCY1JORGc5bUFTcGc3QmgyMTFtbmdkVktXRzFBX3F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities - Yahoo Finance",
        "content": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities\n\nThe chief of the U.S. Commodity Futures Trading Commission (CFTC), Rostin Behnam, has once again advocated for his agency to oversee Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, by classifying them as commodities. Speaking before the U.S. Senate Committee on July 9, Behnam referenced a recent Illinois court ruling that reinforces this classification.\n\nThe court decision on July 3 was part of a $120 million Ponzi scheme case involving an Oregon man accused of fraud. The Illinois district court judge declared that both Bitcoin and Ethereum qualify as commodities under the Commodity Exchange Act. The ruling also extended this classification to Olympus (OHM) and KlimaDAO (KLIMA).\n\nBehnam also cited a 2022 report from the Financial Stability Oversight Council (FSOC) that pointed out a regulatory gap in the spot market for digital assets that are not securities, suggesting that the CFTC should play a more significant role in overseeing digital commodities.\n\nBehnam emphasized that the lack of action from other U.S. regulators would not diminish public interest in digital assets and could potentially increase risks to financial markets and investors. “In short, our current trajectory is not sustainable. Federal legislation is urgently needed to create a pathway for a regulatory framework that will protect American investors and possibly the financial system from future risk,” he asserted.\n\nThe CFTC Chair outlined five key legislative priorities he believes his agency could implement to better regulate digital commodities. These priorities include crafting rules tailored to the unique risk profile of cryptocurrencies, establishing a permanent “fee-for-service” funding model, requiring comprehensive disclosure from registrants about their crypto assets, and enhancing the CFTC’s Know Your Customer (KYC) and Anti-Money Laundering (AML) capabilities."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZnNZMWtQYTdPNC1HbjFQZmZKTkdyVDNlX05Ga1lqTjRXNlB5Q3BYdjlCRmhRcDZzb2tPZFZTa3BNQzR4MXpXbXdiUkxRWkVkbmtyNWF5VzRVUHp5NUNMU2ppSFoyWE0zVnRhWmdqSEtqQzNoSHBZa0szS3B5U1NGRi10UlVxd9IBiwFBVV95cUxPUlVDd005aXViVWdmeWxQWC1zVFlkUE1GMnVlbWNDcGNjTjJCMWdVbkViT3BrTmJJaUVuN2R2SjlvX3NTdWZLM0R6S3BlYlZVajVGM3J1YjZYMV9VUHdKdi01RWpKMHpEZFFGUWFsdFdhQU5EbXBiYkxHeGlIdFlIZDRjQnhSdmVYZkZF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun’s big Ethereum bet: Whales eyeing ETH ETF gains? - AMBCrypto News",
        "content": "TRON founder Justin Sun purchased 1,614 ETH as the approval of Ethereum ETF nears.\n\nEthereum’s price action was looking bullish and it may hit the $3,300 level.\n\nThe cryptocurrency market is turning neutral and seems to be recovering after a major decline. Despite the attempt at recovery, the market sentiment remains bearish.\n\nHowever, few investors are looking forward to the approval of the spot Ethereum [ETH] ETFs (Exchange-Traded Fund) as they started ETH accumulation.\n\nJustin Sun buys $5 million worth of ETH\n\nOn 11th July, an on-chain analytic firm spotonchain made a post on X (previously Twitter) stating that TRON founder Justin Sun purchased 1,614 ETH worth $5 million.\n\nThe average buying price of this massive ETH was somewhere around $3,097.\n\nBesides this recent ETH purchase, he has also deposited a notable $45 million USDT to Binance which signals a likely future ETH purchase.\n\nSince February 2024, Sun has been continuously accumulating ETH. According to the data, he has purchased nearly 362,751 ETH worth $1.11 Billion at an average price of $3,047 through three wallets.\n\nOn the other hand, another whale named Golem appears to have stopped dumping ETH.\n\nAdditionally, Golem has staked a significant 40,000 ETH worth $124.6 million, according to Lookonchain. This recent activity by Justin Sun and Golem, signals potential upcoming bullish momentum across the market.\n\nEthereum technical analysis and key levels\n\nAccording to expert technical analysis, ETH is looking bullish as it gave a neckline breakout of a bullish double-bottom price action pattern in a 4-hour time frame.\n\nOn 11th July, 2024, if the ETH 4-hour candle gives a closing above the $3,135 level then there is a high possibility that ETH could reach the $3,300 level.\n\nAdditionally, on a daily time frame, ETH has moved above the 200 Exponential Moving Average (EMA). A price above 200 EMA indicates that the asset is in a bull cycle on a higher time frame.\n\nFurthermore, the Relative Strength Index (RSI) a technical indicator also indicates a bullish reversal.\n\nHowever, this bullishness will continue once the SEC approves Ether ETF. Recently, Bloomberg ETF expert Eric Balchunas has predicted that there is a high possibility that the SEC may green light spot Ether ETF by 18th July, 2024.\n\nIn a post on X, he stated that,\n\n“We don’t have a new over/under launch date yet because we haven’t heard what the SEC’s game plan is. Hope to hear soon. But if you forced me gun to head style to give my best guess for date I’d go with July 18th.”\n\nDespite the bullish outlook for ETH, in the last 24 hours, the open interest (OI) has been negative (-0.53%) which suggests lower interest from investors and traders in this current fearful market.\n\nLiquidation and price-performance analysis\n\nData from CoinGlass for the last seven days also signals that bulls are back to supporting Ethereum. If ETH reaches $3,300, approximately $1.18 billion worth of short positions could be liquidated.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nMeanwhile, if ETH fails to sustain the current breakout and falls back to the $2,900 level, approximately $1.46 billion worth of long positions could be liquidated.\n\nAt the time of writing, ETH was trading near $3,115 and it experienced a 0.5% upside in the last 24 hours."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOUDRxTEE3OFJyRV9ra0lsOGJYTzlLTzdKMVdJU2F0al8tdExyMzJpNTM1RUg0OW1zaVAyUUlweS1wbUstX3lfdzBlQzRQTTM2V0o0VWZXdW1xeUVWQWJzeWhPeXFUSC0zVUZzT01OY1JiUDN2eUJzajFoRGpuYXRXZFQwZTBRMGtOWW5hRG9KbXFQT2dCWWRrWDZJZkJSVjNUd21Vel9GVXBDUDVTc2Zobi02NktyMU5FWWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Bounce May Be Short-Lived - Watch Out for Renewed Selling Pressure - Investing.com",
        "content": "Crypto market rebounds after Bitcoin sell-off, but recovery remains uncertain.\n\nEthereum finds support, eyes resistance as spot ETF news fuels buying.\n\nThe crypto faces crucial levels as SEC decision on spot ETFs looms.\n\nInvestingPro Summer Sale is live! For less than $8 a month, unlock the AI-powered stock picks beating the market by 18.6% this year.\n\nThe cryptocurrency market has finally found some relief this week, pausing its persistent decline. While the sell-off has been the primary culprit behind the market's downturn, altcoins have also suffered. Despite significant challenges, such as the Mt. Gox situation and Bitcoin sell-offs by the German government, a surge in demand for US-based Bitcoin ETFs has provided a buffer against further declines.\n\nThis week, the cryptocurrency market halted its downward trend, providing a much-needed respite for investors. The primary driver of the decline has been the Bitcoin sell-off, which has also negatively impacted the altcoin market. Recent developments, such as the Mt. Gox situation and the German government's Bitcoin sell-offs, have cast a shadow over the market for the past month. However, the rising demand for US-based Bitcoin ETFs has offered some support against further declines.\n\nDespite this, it's too early to declare a market recovery. The total cryptocurrency market capitalization has not yet recouped the losses incurred in early July, despite this week's partial recovery. For a full recovery, the market capitalization needs to close above $2.15 trillion (Fib 0.236) on a weekly basis, breaking through resistance up to $2.3 trillion. This could happen if the Bitcoin sell-off ends and positive developments materialize, such as the launch of spot Ethereum ETFs.\n\nEthereum Rebounds From Buy Zone\n\nhas shown more resilience compared to the broader market throughout June. However, the SEC's delayed approval for ETF issuance dampened demand, leading to a significant drop in early July. Last week, Ethereum tested its April-May lows, falling to the $2,800 range, but saw rapid buying in this demand zone. This week, Ethereum has experienced positive price movements due to new developments for spot ETFs, reaching the critical resistance point of $3,100.\n\n\n\n\n\nEthereum Faces Crucial Resistance Levels Amid SEC Decision Anticipation\n\nEthereum (ETH) is approaching significant resistance levels that could determine its short-term trajectory. Based on the last bearish cycle, $3,125 aligns with a Fib 0.236 level, making it a critical resistance point. A clear daily close above this mark is essential for Ethereum to aim for $3,350, the 3-month exponential moving average, which could signal a trend reversal into positive territory.\n\nA key catalyst for Ethereum's price movement will be the potential approval of the SEC's spot ETH ETF. While approval could boost demand and drive prices higher, it might also trigger a sell-off once the expectation materializes. Hence, Ethereum's ability to respond positively to the SEC decision is crucial for a sustainable recovery. If ETF inflows significantly increase demand, any initial selling pressure could be mitigated.\n\nFor Ethereum to break its short-term downtrend and target $3,350, it must first clear the resistance at $3,125. In the event of a pullback, $3,000 serves as the immediate support level. Failure to overcome current resistance could see a retest of this support. Holding $3,000 may pave the way for a stronger move past $3,125, while a break below $3,000 could trigger a decline towards the $2,800 demand zone.\n\nThe $2,800 support has held since April, but each test weakens it, raising the risk of a break. Should this level fail, Ethereum's next support could form around $2,600.\n\nIn conclusion, the Ethereum market is closely monitoring developments around ETF approval. A confirmed trend reversal requires Ethereum to establish a firm floor above $3,350 this month. Until then, traders should watch the $3,125 and $3,000 levels closely as indicators of potential movements.\n\n***"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdm5RcjNUWlVHT3NPdHl5VnBMLUE0dDBmc1JXLXdnQ2VzaUN4dy05WVJseVlZeF9lSkNsbGliVUNScHdsMXUyZ08tUk5GOWhYSkc2Yk9tdzVMWE9ydHR6Tkt6aDItUllkMlpwWXhRT1NMaHR3ZlAxN0toWEJ1T2ZrcXU4bndBVHViZVI2OE1wbzY5Z2oyN2t3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Countdown to Launch: Spot Ethereum ETFs Could Debut This Friday - TipRanks",
        "content": "Spot Ethereum (ETH-USD) ETFs could be listed as soon as this Friday. With all eyes on the SEC, the anticipation is building for what could be a major milestone in cryptocurrency investment.\n\nThe Race to Approval\n\nThere’s a mad dash to get these spot Ethereum ETFs approved and listed. Last week, several issuers submitted their amended S-1 forms, a critical step in the process. Notably, these filings didn’t include fee information, which means there’s still some back-and-forth to be expected with the SEC.\n\nAccording to CoinDesk, Invesco and Galaxy have already set their fees at 0.25%, while VanEck was ahead of the curve by publishing their fee structure earlier. This indicates that progress is being made, but there’s still some fine-tuning needed before the final green light.\n\nTiming Is Everything\n\nUnlike the 19b-4 filings for spot Bitcoin ETFs approved in May, there’s no hard deadline for the SEC to make a final decision on the ether ETFs. This means we’re looking at a fluid timeline that could see approvals rolling in either by the end of this week or in the next few weeks.\n\nNate Geraci, president of the ETF Store, expressed his optimism on X, suggesting that the week of July 15 is a likely time frame for these listings. Geraci’s insights are backed by the recent flurry of activity and the SEC’s history of quick turnarounds once all requirements are met.\n\nOn the Edge of Approval\n\nIf the SEC provides feedback by the end of Tuesday, issuers could file their final amendments by Wednesday. Historically, the SEC has taken about two days to issue final approvals after receiving the necessary documents. This timeline aligns with the possibility of spot Ethereum ETFs starting to trade by Friday, provided everything goes smoothly.\n\nImpact on Price of Ethereum\n\nThe listing of spot Ether ETFs may have an impact on ETH’s price. As noted by Nate Geraci, the approval and subsequent trading of these ETFs will provide a more accessible and regulated way for investors to gain exposure to Ethereum. This increased demand could drive up the price of ETH. Historically, similar events with Bitcoin ETFs led to a surge in Bitcoin prices, and many analysts believe Ethereum will follow a similar trend. The anticipation alone has already sparked increased interest and activity in the market.\n\nAt the time of writing, Ethereum is sitting at $3,085.\n\nA New Era for Investors\n\nThe launch of spot ether ETFs will open the doors for more regulated investment in Ethereum, the second-largest cryptocurrency by market cap. This development is not just a win for institutional investors but also for the average investor looking for a safer way to gain exposure to Ethereum.\n\nSo, as we count down the days, it’s clear that the launch of spot ether ETFs is closer than ever. Whether it’s this Friday or a few weeks down the line, the crypto community is on the edge of its seat, ready for the next big leap.\n\nFor now, we wait and watch, as the SEC’s final decision could come any day. And when it does, the world of cryptocurrency investment will never be the same."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOdjRzRnYzMkoydEdxeDBVZ1kyY3RHbjdiQlBxTUljaERFeHBqUFRvZDU2cHp3SU5uVV9JcUdrMGNOTlIwZEc3eFlpdG9kMzZsb21WYWtmMzBSNkF1YXpSQXdlRGE2U0pVdUJRdExQNkRlTzEzZDkxU2pkMGd5OHoweVlLNEszN0RUai05cXI2Rk1xTE5pdHhUTnB3c040N3BPNDl2Mno3M0JKdEotVWd4S01HdEdVSzZFM2F1SFJ1WG9Id9IBxwFBVV95cUxPeVRkXzVPZ0l0VGkxaW5nLUdVeTN6Vkh5UWlHUXdjYjZpQlNEbVowdV9YbTdWLW1XQmNhQTUxNDZoeEcxWk1LZFJIMkpYZkZDMHlwa2pTbWtkQ0ZKVW9ENFJwRmg1QWZhQmM4NlZtQnRTcWZfSVJwcVZ3S0RJOG1XbG9xQ3RBS2JkUzBucGhvazJ6SVpRVk52U1NOVTJIcXRQeXFzOXljOHpFY01SY1lHdU92TWpiLXAzanFNYm54Tm9ELTd6N3lv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Key dynamics to watch ahead of launch of Ethereum ETFs - FXStreet",
        "content": "Ethereum ETFs close to finish line, says Bitwise executive.\n\nEthereum investors are buying the dip despite FUD from potential Golem selling spree.\n\nEthereum bearish pressure has slowed, but key resistance could prove critical ahead of ETH ETF launch.\n\nEthereum (ETH) is up 2.3% on Wednesday as investors continue buying the dip in hopes of a rally following the launch of spot ETH ETFs. However, other key metrics like break-even prices and Golem sales provide a deeper understanding of what to expect as the launch draws nearer.\n\nDaily digest market movers: Ethereum accumulation, Golem sales\n\nWith the potential launch of spot ETH ETFs drawing closer amid the wider market stagnancy, investors are readjusting their portfolios. Bitwise chief compliance officer Katherine Dowling confirmed that the launch is \"close to the finish line.\"\n\n\"We're seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC,\" said Dowling in a Bloomberg interview.\n\n\"So that points all signs in the direction that we are close. We're close to the finish line on the launch,\" she added.\n\nThe Securities & Exchange Commission (SEC) approved spot ETH ETF issuers' 19b-4 filings in May, but the agency needs to greenlight their S-1s before the products can begin trading.\n\nEthereum's recent descent saw more investors accumulating the altcoin, as revealed in CryptoQuant's data. These investors are considering the dip as an opportunity to purchase ETH at a discount before ETH ETFs launch in tandem. The lower ETH goes, the more investors buy.\n\nETH New Accumulating Adresses Balance\n\nSantiment data shows that some of these purchases have been flowing into staking platforms. The Ethereum 2.0 staking contract now holds 47.36 million ETH or about 34% of ETH's entire supply. Notably, the contract's holdings have more than tripled from just under 11% of ETH's supply it held in 2022.\n\nETH2 Beacon Deposit Contract\n\nMeanwhile, Golem, which raised 820,000 ETH through an ICO in 2016, has been on a potential selling spree. After transferring 40,000 ETH to address \"0x159a\", the address deposited 3,000 ETH worth $9.3 million to Binance, Bitfinex and Coinbase in the past few hours, according to Lookonchain. Golem has deposited about 32,000 ETH to exchanges in the past six days.\n\nETH technical analysis: Ethereum faces a key resistance at $3,200\n\nEthereum is trading around $3,130 on Wednesday, up 2.3% on the day. ETH's total liquidations in the past 24 hours are at $33.58 million, with long and short liquidations accounting for $23.18 million and $10.40 million, respectively, according to data from Coinglass.\n\nETH's long and short ratio shows traders are slowly reducing their bearish sentiment as the ratio has increased to 0.989. However, Ethereum's Fear and Greed Index is at number 30, indicating fear persists in the market despite increasing accumulation from whale addresses.\n\nInto The Block's data shows that more than 5.6 million addresses broke even after ETH reached $3,000, a potential sell sign for these addresses.\n\nIt could be that whales bullish on the ETH ETF approval accumulated selling pressure from retail traders who potentially sold off their tokens after ETH reclaimed the $3,000 psychological level.\n\nAs ETH's price slowly tilts toward the upside, it may face a resistance at the $3,200 level. According to IntoTheBlock, approximately 2 million addresses that purchased ETH around this level could sell if they break even. However, a price catalyst like the ETH ETF going live can prevent such a move.\n\nETH/USDT 4-hour chart\n\nOn the downside, the $2,800 to $2,852 level remains a key support if the bearish pressure increases.In the short term, ETH could bounce off the $3,064 level, where $3.32 million ETH longs risk liquidation."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1hZHF4MHI1VlUwMERZajZsaFZ1LTFuY2pRTW9VSXQ0M2xKa0JjbThhZUE5QVRwcTBnV1lzR25xblRGMzhDMkxSS1p5ZC1rYmlZX0hyUnNKYnpGZC0xdGVLeGFMUlcwTTF4S24tZjF1czREZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Can Ethereum [ETH] Hit $3,500 This Weekend? - Watcher Guru",
        "content": "Over the last seven days, Ethereum [ETH] has dropped by 7%. The largest altcoin took a hit similar to the rest of the market. At press time, ETH was trading at $3,090.81 with a daily surge of 0.33%. During its recent rally, the community expected ETH to revisit its all-time high of $4,891.70. But things did not go as expected. The real question is whether Ethereum will continue trading at its current level or witness an upgrade to $3,500 this weekend.\n\nChangelly revealed that Ethereum will indeed have a bullish week ahead. The altcoin is expected to surge to a high of $3,172.27 following a 2.85% rise from its current levels. While the altcoin is still away from the $3,500 zone, the upcoming days could build ETF to reach its milestone.\n\nFactors like market sentiment, regulatory concerns, and the launch of exchange-traded funds [ETFs] could boost the price of Ethereum.\n\nAlso Read: Upbit Lists Ethereum Name Service: A Market Impact Analysis\n\nEthereum ETFs To Hit the Market Sooner Than Later?\n\nThe Securities and Exchange Commission [SEC] and potential ETF issuers are arguing about “fewer and fewer” concerns in the S-1 filings, according to Katherine Dowling, chief compliance officer at Bitwise. Currently, there are eight spot Ether ETFs in the market. But Dowling also notes that the precise date is still pending. She said,\n\n“We’re seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC. So that points all signs in the direction that we are close. We’re close to the finish line on the launch.”\n\nDetails on the issuer and the securities they want to offer are included in Form S-1s. When authorized, the Ethereum ETFs can go on sale.\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNalpZOVc2Nk9DaHFqcGthZE1CYVBDWU0zOG1pOUQ3OTMzUDFDNW1qWlJPOU9XeUc2OUZQWGtOWnppOWRRMzVOZ2ZkLWc4YU9teTJ1OHM0YnJlSTFhX2FzMF8zUXk2MGZ6WW5FUDVCeXZZbXlYelZkSmhhTTBHSzlVUtIBhgFBVV95cUxNalhoUDliUFZET1B0UEQzMGFTaDIyZTdMbEJ6Y25HTk5BNXlPd3A2N2ZjS0oxMnlBN21lRThBTTZrR0hVTFF3WGg4dGY4OTZkSDFNWVhnYXlFTUtRNEREVjdEYkVKRWM1allyeU1rOGJOeGVfdWxDY2s2bUZSREliZHdBNVZiUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Staking frenzy grips Ethereum: 33.9% of ETH now staked - AMBCrypto News",
        "content": "Interest in staking Ethereum surged significantly over the past few days.\n\nNetwork growth for ETH fell materially despite the surge in price.\n\nOver the last few days, Ethereum [ETH] has seen massive volatility in terms of price movement, which has impacted sentiment around the token significantly.\n\nInterest in Ethereum staking surged\n\nThe ETH2 Beacon Deposit Contract, the backbone for staking deposits in Ethereum 2.0, has reached a new peak, locking in a whopping 47.36 million ETH. This represents a significant chunk of the total supply, amounting to 33.9%.\n\nThe value is more than triple the amount staked just two years ago, which was only 10.9%. The surge in deposits indicates growing confidence in Ethereum 2.0 and its potential to revolutionize the Ethereum blockchain.\n\nWith a significant portion of ETH locked up in staking deposits, the circulating supply of ETH effectively decreases. This can lead to upward pressure on the price due to basic principles of supply and demand.\n\nMoreover, since staked ETH is locked up for a period of time, it’s less likely to be sold on the open market in the short term. This can help reduce downward pressure on the price, especially during periods of market volatility.\n\nDaily activity on the network fell\n\nHowever, despite the surge in ETH staking, the overall interest in the Ethereum ecosystem waned.\n\nAMBCrypto’s analysis of Santiment’s data revealed that the overall active addresses on the Ethereum network declined significantly over the past month.\n\nMoreover, this decline in activity coincided with the number of NFT trades occurring on the Ethereum network falling.\n\nThis suggests that despite the potential benefits of staking, fewer people are actively using the Ethereum network for other purposes.\n\nThis could be due to a number of factors, such as high gas fees, a lack of new applications, or a general bearish sentiment in the cryptocurrency market.\n\nAt press time, ETH was trading at $3,087.00 and its price had grown by 10.91% since the 10th of July. Despite the surge in price, the overall trend for ETH remained bearish.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, the network growth for ETH fell materially, indicating that new addresses were losing interest in ETH.\n\nCoupled with that, the velocity at which ETH was trading at had also fallen,, implying that the frequency at which ETH was being exchanged had declined."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPX09jaGxjOFJYTTVNd2xqaEg2WUtyMkEzbWZ6dWthc2dDSUZFdXkzbzlDSm5xRWcwTHdqcDFhLU5OeXJnXzIzaXZQanNFRk1hVi15eUlBdndBQW5lNHFhVjNMTTdubk1VVVJ3ZUFZWnoyOTVQMGFHMUtnUDlOWFhYSVh6Vnh1VFpjVVhZMUxHTXl5cHhsUTdNSdIBoAFBVV95cUxQRk9GUVFWcjFaUG50NVVqNG9vNHVVOWZ6RjhwWG03SGtIemdCQVpyU0lmLVl4bUxkZV9aajJQdWpJQW55Q1NJWDU0bW9aal9aY2wxTmVqeUtsRUw2Sjh3RmpRRDBCX1ppMFhMQXNwcHRzaTRzR2JobC1uZng3US0zVHhuVm5OQy1XNzV1czBVcjdCeDZ1T2ZoOENaVUtzMlRz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chairman Says Bitcoin and Ethereum Are Commodities—Case Closed? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto Twitter was quick to celebrate Wednesday following congressional testimony from Rostin Behman, in which the chairman of the Commodity Futures Trading Commission (CFTC) said a recent federal court ruling reaffirmed Bitcoin and Ethereum’s status as commodities.\n\nWhile the Securities and Exchange Commission’s (SEC) Chairman, Gary Gensler, has said that Bitcoin isn’t under his agency’s regulatory purview, a cloud of uncertainty still lingers around crypto’s second largest coin—despite the abrupt approval of spot Ethereum ETFs in May.\n\n“In its decision, the court reaffirmed that both Bitcoin and Ether are commodities under the Commodity Exchange Act (CEA),” Behman said, referring to a fraud case pursued by the CFTC in the U.S. District Court for the Northern District of Illinois against an unregistered entity.\n\nBTC and ETH are commodities. pic.twitter.com/HKzgkRaWkn — Dan (@DN_Founder) July 10, 2024\n\nAD\n\nAD\n\nDecided by Judge Mary M. Rowland, the case’s defendant argued that the CFTC’s statutory authority, when it comes to regulating commodities, “does not extend to any cryptocurrencies.” However, the judge ruled that Bitcoin and Ethereum are well within the CFTC’s regulatory scope based on the case’s similarity with other decided cases and language within the CEA.\n\nBut Rowland's decision, and Behman's citation, doesn't mean Ethereum's status is set.\n\nEven though other courts can take the decision into consideration, which was reached in trial court, Rowland’s ruling isn’t binding within the Northern District of Illinois—let alone the rest of the country—Anthony Tu-Sekine, a partner at Seward & Kissel, told Decrypt.\n\n“Anything that happens on the trial court level is not really binding on the other courts in that jurisdiction,” he said. “This is good news, not bad news, but it’s probably not that big.”\n\nAD\n\nAD\n\nCFTC officials first described Ethereum as a commodity in 2019, when then-chairman Heath Tarbert spoke at Yahoo Finance's All Market Summit. While the SEC has never claimed that Ethereum is a security, a since-dropped investigation into “Ethereum 2.0” raised questions.\n\nWhen it comes to the intersection of crypto and securities laws, judges within the same jurisdiction have issued conflicted rulings. For example, in the U.S. District Court for the Southern District of New York, Judge Analisa Torres found in the SEC’s case against Ripple that the sale of certain cryptocurrencies on secondary markets isn’t subject to securities laws.\n\n“There's another case in the Southern District where the judge actually disagreed with [Torres’] conclusion,” Tu-Sekine said, referring to a ruling in the SEC’s case against Terraform Labs.\n\nU.S. District Judge Jed Rakoff declined to extend Torres’ reasoning while letting the SEC’s case proceed last summer, citing the Howey Test, a framework outlined by the Supreme Court which is used to determine whether an asset is a security.\n\n\"Howey makes no such distinction between purchasers, and it makes good sense that it did not,\" Rakoff wrote. \"The court declines to draw a distinction between these coins based on their manner of sale.\"\n\nStill, the SEC implicitly signaled that Ethereum is a commodity when it approved applications for spot Ethereum ETFs in May, Tu-Sekine said.\n\nIf an investment vehicle invests in securities, there are certain regulatory forms that are required along with that, which isn’t the present case among asset managers currently jockeying for a spot Ethereum ETF, Tu-Sekine noted.\n\nStill, Behman’s comments Wednesday were hailed on Crypto Twitter as a major development, as influential accounts like Degen News blasted out tweets in all-caps.\n\nAD\n\nAD\n\n“What a time to be alive,” one user commented.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQUFFKQWVYSUgxSXlZdXNRd3BUWU95MUJoNXByZF9wSDFGVGRPT0ZETjRRdDdfdFo2SU1seHNuUkpiOGd6WEt6WkwydFJobHY5OHVDNWw0cmNtS2kxZ2ZkbFN5WUpLZ3o3emxmZVU0eVpWclJ3N2I1QkRVOGtxNkRMQWVMY2NBWW5OVHdGUDFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH - Watcher Guru",
        "content": "Ethereum ETF inflows could spark a new all-time high for the asset upon the launch of the ETFs, according to analysts. The recently approved Spot Ethereum ETFs are earning a lot of attention before their launch, with experts predicting how high they will send the Ether asset. Cryptocurrency exchange Gemini recently predicted that the ETFs can expect to see $5 billion in net inflows over its first 6 months. However, new analysis suggests that that number may double.\n\nTom Dunleavy, a managing partner at crypto investment firm MV Global, believes that the Ethereum ETF inflows could soar beyond $10 billion. “We saw $15 billion in flows for Bitcoin. I think we’re probably going to see $5 billion to $10 billion for Ethereum,” Dunleavy said speaking to CoinTelegraph. “I expect a very positive price impact sending us to new all-time highs by early Q4.”\n\nAlso Read: Golem Network’s ETH Sale: A Strategic Ecosystem Move\n\nHow Will Ethereum Fare Once ETFs Launch?\n\nImage Source: WatcherGuru\n\nCurrently, nearly a dozen Ethereum ETF filings are awaiting final approval before the asset can launch on the market. Following the approval of Spot Bitcoin ETFs in January, the assets exploded in the first few weeks, catapulting BTC to an all-time high in March. Spot Ethereum ETFs are expected to do the same for Ether, which is currently the second-highest-performing crypto asset by market cap. Ether currently trades at $3,136.48, and its all-time high was $4,721.07 in May 2021.\n\nDunleavy said he expects ETH ETFs to attract around $1 billion per month as a “base case” for the next few months. Since the asset is “less available on exchanges” according to the MV Global representative, it may see more hype and demand, thrusting the currency to new highs quickly.\n\nAlso Read: Can Ethereum [ETH] Hit $3,500 This Weekend?\n\nThe last 24 hours have seen Ether increase almost 2%. Currently trading above $3,100, there are still investors disappointed in the asset’s performance. However, the long-term outlook for Ethereum post-ETF launch is extremely bullish. Just last week, VanEck, Fidelity, and other Spot Ethereum ETF issuers filed amended S-1 forms with the SEC. That brought the product one step closer to launch. Moreover, experts are now predicting the investment vehicle will begin trading within the next two weeks.\n\nIf this launch date prediction rings true, Ether could explode in price by the end of 2024 as Tom Dunleavy suggests. The ETF asset is likely going to mimic the performance of Bitcoin ETFs earlier this year. Therefore, expect a frenzy around Ethereum post-ETF launch, and watch out for a huge surge in inflows during the opening days of the ETF’s arrival."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQdWM2NDFJMlh6Y25lREltcy0yQzVWV0VJZ2wxVVpsaEZOeGRhYkZ2aW9Tb2VvZy1DWUhESVhDbVVtRndacVFMMTNqYlJBLWRkLUVqelRUdGdWQ2g4am5PWmVqUXZvRVNqYzcwMFZvNm53dXg3enB4bDlaS2VZUEFJcWVKd2oteVhJdWtqRDZWVDc3a25DMTdXenk5S3BneTJLZkdhbjNjaVBoVFhoVTExczhCUVpTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Prices and forecasts on crypto Bitcoin (BTC), Ethereum (ETH), and Binance Coin (BNB) - The Cryptonomist",
        "content": "For some time now, there have been three cryptos dominating the markets, Bitcoin, Ethereum, and BNB: today we will analyze some predictions of their prices.\n\nBitcoin is the first ever to be created and the one that alone capitalizes more than half of the entire crypto market.\n\nThe second is Ethereum, which is the main altcoin that is often followed by all the others.\n\nThe third is BNB, the cryptocurrency of the main crypto exchange in the world (Binance).\n\nPerformance of BTC: which crypto is performing better among Bitcoin, Ethereum, and BNB?\n\nThe trend of the price of Bitcoin underwent a significant change a few days ago.\n\nFrom February 28 to July 3, 2024, for more than four consecutive months, it had effectively moved sideways within a wide range between $57,000 and $72,000, with small and brief excursions a bit above and a bit below.\n\nInstead, starting from July 2, it began a descent that on July 4 led it to break down the bottom of that range.\n\nTo tell the truth, already on July 7th it had returned above $57,000, but on July 4th the medium-term trend seems to have changed.\n\nIt is not yet clear if the new trend is descending, or if it is just a lowering of the bottom of the lateralization range.\n\nThe latest predictions on the price of Bitcoin (BTC)\n\nThe analysts do not agree with the forecasts, but what happened between yesterday and today seems to have definitively ended the decline that began on July 2.\n\nFrom $63,000 back then to $53,500 on July 5th, the drop was 15%, but it has already been partially absorbed. The current situation seems to have returned to perfect normality, so that drop seems to have completely run its course.\n\nHaving said that, there are no certainties that another one cannot be triggered.\n\nThere are several analysts who expect further similar declines in the coming weeks, so much so that some are hypothesizing a bottom at $52,000, $51,000, or even below $50,000. There are also many other even more pessimistic forecasts circulating, but they generally do not come from expert analysts.\n\nIt should be noted, however, that there are also many analysts who instead hypothesize only the beginning of a new phase of lateralization, simply within a lower range, whose bottom would be between $51,000 and $53,000, while the top is not yet clear (it could also be above $60,000).\n\nMany, however, expect a change in trend in the autumn, perhaps already anticipated at the beginning of September or the end of August. Among those who expect this change in trend, optimism seems to prevail.\n\nPerformance of Ethereum: the crypto between Bitcoin and BNB\n\nThe trend of the price of Ethereum has been following that of Bitcoin quite closely since the end of May.\n\nThis thing, however, appears anomalous, given that precisely between this week, or at the latest next week, the spot Ethereum ETFs should land on the US stock exchanges for the first time.\n\nThe upward movement of ETH’s price at the end of May was due precisely to the news of the approval of these ETFs, but since then it has simply started to follow those of BTC.\n\nComparing the price of Ethereum with that of Bitcoin, one realizes that in May ETH had risen from 0.046 BTC to 0.057 BTC, but then it stabilized.\n\nIndeed, in mid-June it had also fallen below 0.052 BTC, and now it is around 0.053 BTC.\n\nAt this moment, despite the imminent arrival of ETFs, the price of Ethereum does not seem to have the strength to move independently compared to that of Bitcoin, at least in the short term.\n\nPredictions on the price of Ethereum (ETH)\n\nAfter the actual launch on the stock exchange of spot ETH ETFs, many believe that the price of Ethereum could fall.\n\nObserving the chart of the last few weeks, it indeed seems that the markets do not believe that these new financial derivatives can achieve a great result, at least in the immediate future.\n\nFurthermore, there is always the risk that the Grayscale Ethereum Trust, once transformed into an ETF, may start liquidating large amounts of ETH, just as happened with BTC in January.\n\nBut if in the medium-short term many are not optimistic about the price of Ethereum, in the medium-long term the expectations change.\n\nIn fact, should Bitcoin wake up in the autumn, the presence of ETF on ETH spot on the US exchanges could benefit the price of Ethereum quite a bit.\n\nJust think that after the arrival of the spot Bitcoin ETFs the price of BTC rose from about $45,000 to over $70,000, after initially dropping below $40,000.\n\nThe trend of BNB\n\nThe trend of the price of BNB follows that of Bitcoin, and of Ethereum, but it also follows the alternating fortunes of Binance.\n\nTo tell the truth, for years now Binance has been the largest crypto exchange in the world, and its dominance seems to be unchallenged, but last year it had several problems with the authorities, especially in the USA.\n\nTaking Ethereum as a reference, the price of BNB last year fell below 0.1 ETH, after being above 0.26 ETH at the end of 2022.\n\nIn March of this year, however, it started to recover, first climbing to 0.17 ETH and then even above 0.20 ETH. Now it has returned to 0.17 ETH.\n\nTaking instead as a reference the US dollar, a month ago it recorded its all-time high, at around 717$. It should be noted that Bitcoin also recorded its new all-time high this year, in March, while Ethereum did not.\n\nSo during the course of 2024 BNB has performed better than ETH, so much so that it is now at +64% since the beginning of the year. However, it should be remembered that in 2023 it had not performed well, while both ETH and BTC had already recorded really interesting gains.\n\nPredictions on BNB and the Binance ecosystem\n\nMaking predictions about the price of BNB is more difficult, because much depends on the alternating fortunes of Binance.\n\nAlthough today it is possible to state that in the event of a new bull run Binance seems destined to perform well, and consequently BNB, last year, for example, it was very difficult to predict that Binance would solve all its problems, as it eventually did, allowing the price of BNB to take off again.\n\nIn this case, in fact, in addition to the simple movements of the market, and the law of supply and demand, the economic results of Binance also matter, which are not easily predictable."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOQVZyQ2owUGZJRmdXemFDNHV1S2pOWGoxeFhqa1U3TWJzZG1MUFNKWUtrV0YxUXBMY2xscEhSelRXTVJoVHlSOGhKeHV4UEhaT1FnSTIza1BCU20tWG1DR29Rc3pBX3hIem8teE42cTVWN3RyY2RNQ2RUMGNCcGxGbUN30gGHAUFVX3lxTFBOTkEybUpubFBFam1ELUFSV214V294ay1wRWdqQzZieVBfZ2RBX2hteG1YOWtDMXY0Nl9lTnl0RmcxU0kyN1RIWEM1cVkwQUZqNTBIS0FlYkFkMDZnLTJqbXJCM3ZOMHlUaWxiOFc5U1cwMHFHYXhEaVYzTUQ3WWRYVjFuRkJOSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Buys $5 Million in Ethereum (ETH), Price Rally Coming? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSpotOnChain has reported that a suspected wallet of TRON founder Justin Sun is buying the Ethereum (ETH) dips. He reportedly purchased 1,614 ETH at the $3,097 price level. Sun spent around $5 million in USDT to make this purchase.\n\nAdvertisement\n\nThis is a notable development for ETH as it comes at a time when the coin has been trying to recover from its recent losses. Moreover, Justin Sun is a notable personality in the crypto realm. Such moves by Sun can leave a strong impact on the market.\n\nAdditionally, SpotOnChain revealed that the TRON founder has been buying ETH continuously. He has allegedly acquired 362,751 ETH since Feb. 8. Three different wallets were used to buy these coins at the price level of $3,047. The estimated cost of these ETH purchases is around $1.11 billion.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097.\n\n\n\nSince Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇).\n\n\n\nNote that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nIt appears that Justin Sun is not done with Ethereum yet. Per SpotOnChain, he has also deposited around 45 million USDT to crypto exchange Binance recently. This move shows that he may be using this USDT holding to buy more Ethereum in the coming days. These potential purchases are expected to boost ETH.\n\nAdvertisement\n\nImpact on Ethereum price\n\nAs mentioned above, significant purchases by market leaders like Sun can leave a positive impact on a coin. In the case of Ethereum, Sun already has a major holding, as he may buy more coins. This can have a positive impact on the ETH price and the broader crypto market in the long term.\n\nAs of writing this article, Ethereum is trading around $3,126.54, an increase of 1.5% over the past day. While this is a minor upward trend, it is still a positive move, as it appears that ETH is trying to initiate a recovery. Moreover, Justin Sun’s significant ETH purchases are expected to inject bullish momentum onto the market."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQQ3p4N0xHblhUVFVIdmZNZ2VKUmxjOU5lb1BTS3k0OGs5OFdZS2pKd2x2Xy1DNWd3b0J1cE8tRUl5Nm5WeUJtcFZVOVRUbEVlZTdSRHROcmRjMVBfZklVMjcwc3lja3BxRnM3SVphZkRWUFpRX0ljUGhfVXJGS2ZkMGl2bUc3V3BFQUx4TFBsaVZJQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "How High XRP Could Go if Ethereum Surpasses $50,000 - The Crypto Basic",
        "content": "This article explores the potential for XRP’s value surge if altcoin leader Ethereum reaches $50,000, as industry pundits anticipate.\n\nXRP and Ethereum have both lost significant percentages of their values in recent times as the crypto asset market battles with bearish forces. At a market value of $2,960, Ethereum currently sells at a month’s low.\n\nIn particular, ETH investors are nursing a loss of approximately 20% in the last 30 days. On the other hand, XRP is trading at a year’s low at $0.4245, though it reflects a 15% loss in the last 30 days.\n\n- Advertisement -\n\nWhile XRP and Ethereum currently exhibit underwhelming performances, the crypto community remains ambitious about their prospects. One such audacious view is the expectation of the altcoin market leader to be worth $50,000. With XRP closely following ETH on the ranking, The Crypto Basic assesses XRP’s potential value while Ethereum trades at $50K.\n\nXRP Potential Price When Ethereum Hits $50K\n\nAmong the believers in an Ethereum price point of $50K is U.S. investment firm VanEck. The billion-dollar asset manager made the proposition last year based on a detailed examination of the asset. VanEck expects this outlook to materialize by 2030, a timeline analysts at the Changelly exchange agree with.\n\nAt its current market value of $2,960, Ethereum needs to advance by 1,590% to attain the $50K threshold. While the altcoin leader boasts a market cap of $355 billion, the $50K price would elevate this valuation to over $6 trillion.\n\nMeanwhile, with XRP exchanging hands at $0.4245, the fourth largest altcoin could potentially be worth $7.1 should it perfectly replicate Ethereum’s 16X surge to $50K.\n\nThis figure aligns with the estimation of OpenAI’s ChatGPT when consulted. However, the AI chatbot issued a disclaimer that the $7.1 is merely a simplistic estimation, stressing that the actual values of XRP could vary based on multiple elements.\n\n- Advertisement -\n\nWhen Can XRP Attain $7.11?\n\nLike ETH, a $7.11 price point for XRP would mark an unprecedented history. At this point, XRP could wield a fully diluted market cap of $717 billion, a significant advancement from the current $42.45 billion.\n\nInterestingly, Changelly’s analysts believe XRP could achieve the $7 price region by 2030, coinciding with their projected timeline for Ethereum to hit $50K. However, ambitious voices in the XRP community believe $7 is a realistic target for this bull market.\n\nIt is worth noting that while XRP ranks closely with Ethereum, XRP’s recent performance pales compared to that of the altcoin leader. For instance, Ethereum was among the best-performing assets during the Q1 bull frenzy. In contrast, XRP underperformed 61% of the top 100 ranking crypto assets in Q1, which worsened to 77% based on the most recent data."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPb2hRNVA3b3BiSEtoUTNtaXZoTkpJd2NZdkVaMW1GQ1d2c2Z6LWZ2WXE1VmZwOVlORnlJMnBNVnNOck5rdGdMcG12YTRGRk01NElkbEp5cjV0d29heTlqTzlFeFJSN0ltZnpLLXUwZDR1TDBuN0NQU2hodE5lN1NYUERBM3A2b0xORzRlcVRmRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Says SEC is Open to Solana ETF After Ethereum Launch - Watcher Guru",
        "content": "Cryptocurrency asset management firm Bitwise has recently said that the US Securities and Exchange Commission (SEC) is open to a Spot Solana ETF after the previously approved Ethereum iteration launches. Indeed, the ETH investment product is expected to begin trading in the next week.\n\nSpeaking to Bloomberg, the firm’s CCO Katherine Downing noted that the agency appears “quite welcoming” to the idea of other crypto-based ETFs. Additionally, Downing said that the Ether ETF is “close to the finish line.” Many issuers have already filed the amended S-1 forms this week.\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks\n\nSolana ETF in the Works After ETH Debuts?\n\nBitwise’s Downing discussed the potential for investment products like a Solana ETF amid the ongoing Ethereum process in the recent interview. She noted that issuers have “dialogue with the SEC about the possibility of what’s coming down the pike with new products.”\n\nHowever, Downing did note that those products “may have to wait on a new SEC chair,” if Gary Gensler is removed in January of this year. She maintained that he could get in the way. Specifically, Downing noted Gensler’s involvement creates a “long haul” to get products to market. Especially given his history with the industry.\n\nAlso Read: Solana Mirroring 2021 Bull Run Pattern: New All-Time High Soon?\n\nStill, Downign described the agency’s response to talk regarding more products as “quite welcoming.” That certainly increases the odds of a Solana-based ETF. Applications for such an investment product have already been filed by asset managers like VanEck.\n\nEarlier this month, GSR Markets released a report on the potential product. There, they noted SOL has “cemented itself as part of Crypto’s Big Three.” Therefore, it is only natural it follows ETH and BTC with the next crypto-based ETF. Yet, the question now is when. With two approvals in 2024 already, many expect a Solana ETF to not be viable until 2025."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUHF0M0dLamwySHMzMFdBZ0kxTUY3SkFlVS1BQl9VSVM4WU9PMDI1SndXVkU3LUhPNzlRd29KYzI4UmFCWmt1dnBIMkFrem82Z0pCamZLSW5kOGNEeklQOWxLMHV0U0U4MGtOOElsVlRyQjBZb3lJbVFlcGxHWjFEUUJtb3NJODIxeVlrZVQ2STNIbEtWVmpZdDhn0gGfAUFVX3lxTE54UFR3YTBfb3I2UHNzbjB5OExiY2JhZmlJbFFFbzFGOV9BM1BGN1RNcVlXTGlWa1lPS3dVTE1RZWRjNG1uMHlZMFpGTTExWlpRYjBCR29tYkdjaFJIbE16WnFXVEdDRVYxc01uRWkzU3VZcDJSN2cyemlCdUlCR0dXUGlKX2dDV2VuZ3Jjb3ZTWWNsREhQeVI3WThNQkJ1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Dwindling Open Interest Hints Sluggish Climb To $4,000 - CoinGape",
        "content": "Since last weekend, the cryptocurrency market has showcased a sluggish trend with most of the major assets wavering sideways. However, the second-largest crypto by market cap Ethereum has maintained a better position amid the development in Spot ETH ETFs. After the recent market correction, the Ether price has established firm support at $2815, providing buyers with an opportunity for a counter-attack. But will the current market dynamic support this rally?\n\nAlso Read: Ethereum Price Analysis Warns $2500 Breakdown As Bearish Pattern Emerges\n\nadvertisement\n\nEthereum Price Forecast: Can ETF Speculation Drive Prices Higher?\n\nThe Ethereum price has been under an active correction trend since May end. From the peak of $3974, the altcoin tumbled 29.27% before finding suitable support at $2815. The horizontal level coincides closely with the 23.6% Fibonacci retracement and 50W EMA creates a strong accumulation area for investors.\n\nA bullish upswing this week has uplifted the asset 10.3% to trade at $3116, while the market cap jumped to $373.9 Billion. This recovery likely followed the recent update to the S-1 registration statement by ETF issuers of Ethereum, along with market speculation that this instrument will start trading by mid-July.\n\nHowever, until final approval is secured, Ethereum may struggle to gain sufficient recovery momentum.\n\nAlso Read: Crypto Prices Today July 10: BTC Touches $59K Amid ETF Inflows, ETH Holds Above $3K\n\nMoreover, the Ether coin experienced a significant drop in Open Interest during the early July sell-off. According to data from Coinglass, Ethereum’s Open Interest fell from $14.98 billion to a low of $11.97 billion, marking a 20% decrease.\n\nThis substantial reduction in OI suggests a decline in traders’ commitment or market liquidity for ETH, potentially indicating decreased confidence or interest from investors.\n\nIf the market supply pressure persists, the ETH price could rechallenge the $2815 support. The horizontal level, which also serves as the neckline of a double top pattern, could intensify selling pressure and potentially lead to a drop toward $2000.\n\nOn a contrary note, if the ETF excitement pushes the Ethereum price above $3325 resistance, the sellers will start losing grip over this asset. A potential breakout from the downsloping resistance trendline will signal major market change and bolster crypto buyers to chase $4000.\n\nTechnical Indicator\n\nEMAs: The 50D and 100D Exponential Moving Average wavering around $3325 increases the resistance power for this level\n\nADX: The Average Directional Index slope rising to 37% indicates that the downward momentum remains strong, showing no signs of weakening.\n\nFrequently Asked Questions (FAQs) 1. What does Open Interest mean? Open Interest refers to the total number of outstanding derivative contracts, such as futures or options, that have not been settled. 2. What is the S-1 registration statement? The S-1 registration statement is a filing required by the U.S. Securities and Exchange Commission (SEC) for companies planning to go public, including ETFs (Exchange-Traded Funds). It provides detailed information about the ETF's business operations, financial condition, and risk factors. 3. What is a Double Top Pattern ? A Double Top Pattern is a bearish technical analysis pattern that occurs when the price of an asset hits a high, retraces, rises again to a similar high, and then declines.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBwa1dnRE81ZVNTMktrd0RQaG9DOUxNRldlZEtWa1dJWWdTUmFoU0xkWmJKTTBHTWhRVzZEcXlaNUJnLXdjVDAwNENJVVh3Sy1rVVluSm80TWc4M3dlOUZRUm9pRDB1Ukp4VHfSAW9BVV95cUxNcURLUzBMczBsZGI0QmdGN0VHcUhiOVZlOHE2QkRfZGs5RHN2cHVXb1ZPR1ZIbGd5VDc3LW1LTWxWN2UwNHRaSm1OODFwQWU3TVpUeFQwb2ctSl9aNHM4UmFrMGMyUENMU09RSDRFVkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 12:38:59 GMT",
        "title": "Is Ethereum (ETH) Forming Double Top Pattern? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIf you take a closer look, you might notice a double top pattern, but a reverse one. The reverse double top is actually bullish for the asset and hints at an upcoming price reversal.\n\nAdvertisement\n\nTraditionally speaking, the double top pattern is a bearish signal that denotes a change in trend from an upward to a downward one. But it can also indicate the opposite when it is reversed. It appears that a bullish reversal may be approaching, as this reversed double top pattern is forming on Ethereum's four-hour chart.\n\nAccording to this pattern, ETH has encountered resistance at this point but has not declined noticeably, maintaining its bullish outlook. If buyers continue to build strength, there may be a breakout above the resistance level, as indicated by the second peak forming higher than the first.\n\nA reverse double top pattern may be a sign that bullish sentiment is replacing bearish sentiment on the market. This is how to do it:\n\nAdvertisement\n\nEnhanced purchasing pressure is indicated by the double top itself and the formation of higher lows. Investors and traders may be looking to buy now in anticipation of a breakout.\n\nSupport levels: The price is still firmly positioned at $3,080 and has not dropped below important support levels. This consistency frequently comes before a bullish move.\n\nIt is important to pay attention to the trading volume during the pattern's formation. The strength of the bullish reversal is confirmed if the volume rises in tandem with the price.\n\nIn light of the present setup, ETH might see a sharp rise in price if it breaks above the $3,130 resistance level. If this threshold exceeds $3,200, then $3,300 might be the next target. However traders should also be cautious of false breakouts."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPMHVoeGNKSmhuck1FV3Z2U2YtZG9TeDFRbjlHZDlFR0ZObEczVExXUWdkZlhDNk9PUXZVS0Mzd1pjR0JDXzRQN1BqQ0V6cGE2TnFja3BFcDhBaDNjYTBoX29vVlFfbXhLNHpYZUdfRmdLZkgwdXZpNGlMOXhVM0lKWENFamxIYTVoMU0zZTdQVjBfVExTbHZ30gGcAUFVX3lxTFBveU5WZ0NUbmdWZFNwSkJIbnVTMlhyYThMcmVfOHNRWWl1bTRKcmpSVjFpZFhlbDlQaS0xZFNyeHN6TmI5TlFvZ2xzUG5HcWNoMGFyOWpzVEtmWlNrbXJtWTRRYzZWMVBpYjZWNFpIWGtEZXJqSEZqdjBRXzY5ZlhmaEhPTW1FUlFSRm1XcWNKcTBoSWduTWVzakxSRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum finally breaks above $3K: How ETH was able to regain its highs - AMBCrypto News",
        "content": "Ethereum has finally caught a breather in the last 48 hours.\n\nThe price held steady above the $3,000 price range.\n\nEthereum [ETH] maintained a stable trading range in the $3,500 zone until it encountered significant declines that substantially reduced its price.\n\nDespite this downturn, the flow of Ethereum across exchanges has been mixed, reflecting varied sentiments among traders.\n\nEthereum recovers from declines\n\nAMBCrypto’s analysis of Ethereum on a daily time frame revealed a volatile start to the month. On the 1st of July, ETH was trading at approximately $3,430.\n\nThe following day, it experienced a slight decline but stayed within the $3,400 range.\n\nHowever, the subsequent days brought more pronounced decreases, and by 5th July, Ethereum’s price had dropped to around $2,980.\n\nETH experienced more fluctuations after that, oscillating between gains and losses. By the 8th of July, there was a noticeable recovery with a nearly 3% increase, bringing its price to about $3,018.\n\nAs of this writing, it was trading with an increase of over 2% at approximately $3,083.\n\nAdditionally, the Relative Strength Index (RSI) also showed a slight increase in tandem with the price.\n\nDespite this improvement, the RSI sat below the neutral 50 mark at press time, specifically around 40, indicating that while the market sentiment is recovering, it still remained bearish territory.\n\nEthereum’s stable sentiments\n\nThe analysis of Ethereum’s exchange netflow from CryptoQuant revealed a fluctuating pattern between inflows and outflows, indicative of mixed trader sentiment.\n\nOver the past two days, the netflow has been positive, meaning that more Ethereum has been deposited into exchanges than withdrawn. This suggests that traders are likely preparing to sell or trade, anticipating either taking profits or mitigating losses.\n\nConversely, in the days leading up to this, the netflow was negative, indicating that withdrawals of Ethereum from exchanges were more prevalent than deposits.\n\nThis trend is typically associated with traders moving their holdings to private wallets for long-term holding or reducing exposure to exchange-related risks.\n\nThe fact that there hasn’t been a significant skew towards either heavy inflows or outflows suggests that traders’ sentiment has remained relatively unchanged, and normal market dynamics continue.\n\nVolume confirms buyers’ dominance\n\nThe analysis of Ethereum’s trading volume over the past 48 hours indicates a noticeable increase, suggesting a revival in market activity.\n\nAccording to data from Santiment, there was a brief dip in trading volume to around $10 billion on the 7th of July.\n\nRealistic or not, here’s ETH market cap in BTC’s terms\n\nHowever, this decline was short-lived, and by the 8th of July, the trading volume had surged to over $21 billion. As of this writing, the volume remained high at over $19 billion.\n\nThis increase in trading volume, particularly with the current price trend, implies that buying activity has been more dominant than selling."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNTDdKMXNacXlLY0RwWnZQZEVMZDUtQ1FPN1BHRW5MUC1RN09ZdFg2a1lZNWZPNVJxWGIzTFdHSHdsNXB1OE1XYXFEV19HdXA4bHZDZWRIdXh2eW44OHJ5bWJoaV9PNXBVWW1vQWhxQmNtQ084V1RLQ09lcjdxS0pzTm9CcDRZbEdXRVB3V0FnTWwweGo0WlJ3TExXTDc4WWJnZV9lUWtndEZMS19mc1lDcm5rMHNZS0dLY1N3Y1JsaHp4TDVVRkZLemdQNW8tQ0lr0gHWAUFVX3lxTE5sbjVWNXBINjhpTVdDN3AtQTg4Y3l2UVl5SVI2dEtEN09Fc3paS19EYldtTWlNS2JFS2hhLU85S0NXRG1WT01CSUs5QXhUQUpKSGs4YTdpaHFDQnhsQll5NFBtbGtPRlVBWVZPMlZIVHVOY0JEcTF3bmhrY291MnVpUHhzR2hlcGtQWkQ2MGdrT3dfTVA1QnU5OVI5WllIM1dtZ3Vzemh6bzVuNjR5RzlRbnNvTzlod0JmWm5wNG5Wbnd6UDhuNXhCemtQdjJMcVEwb0FGdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Trader Says Ethereum Rival To Perform Well Over Coming Months, Updates Outlook on Bitcoin and Celestia - The Daily Hodl",
        "content": "A popular crypto trader thinks one Ethereum (ETH) rival is primed to perform well over the coming months.\n\nThe pseudonymous analyst known as Altcoin Sherpa tells his 217,800 followers on the social media platform X that he’s “pretty neutral” on Solana (SOL) over the short term but more optimistic on the asset as 2024 winds down.\n\n“I still believe $120-170 is a decent region to accumulate SOL overall, and I think this still does pretty well in the second part of the year. Not really expecting this one to move until the overall market environment improves though.”\n\nSOL is trading at $140.87 at time of writing. The 5th-ranked crypto asset by market cap is down more than 1% in the past 24 hours.\n\nAltcoin Sherpa also shares his prediction on Bitcoin (BTC).\n\n“Expecting a few days of green, after that, I have no clue. Next week should be pretty telling if we’re headed back within the range or not. Short-term bullish but mid-term, no clue.”\n\nBTC is trading at $57,519 at time of writing and is down more than 1% in the past 24 hours.\n\nThe analyst also says he plans to watch the native asset of the modular blockchain network Celestia (TIA) for a potential bull flag.\n\n“Modular is back and sexy. I’m looking to buy TIA at $6.00 or a bit lower. Let’s see if/when it comes.”\n\nBull flags, as the name suggests, are typically seen as bullish technical setups that imply an upward impulse and then a brief consolidation before another move up.\n\nTIA is trading at $6.82 at time of writing. The 66th-ranked crypto asset by market cap is down more than 3.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdS1FWXpZMzJEX2JtX1FxSVd2Nm4ybFF2Ym1vU0dJd3BhaDVCS3JxZmFNcmtRRlVXbDhaX2tqTGhwRGxBLW9qYnIwVlc4T0NpUmVXWlMwZ00zRl9lT1poSkZ0cEZ3dmFWMmgzUmZ6dGI2cTh1SGJYRVhXb2dmd2ExQzF30gGHAUFVX3lxTFBSYjQzck1kdjhBQi1NZV9JOFAySGxIRkItT091RjVtNmFKQjBkazg0T0RjaXBtYkZCaTZrVnZjbE5DRkQ5dzh2SGx3b2ZOUndmTE85ZHpwM3FvLTJPdmNnbUFadm9NUG1sNFgwYmU1Q2R2ZnhxZWd1d1ZQVHI2UXRYN1RFOE1Ncw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Buys $5 Million In ETH Ahead of Ethereum ETF Approval - CoinGape",
        "content": "Amid the current market volatility, the Ethereum (ETH) price is showing strength and holding steady around $3070 levels. There’s a massive whale activity currently happening around Ethereum, with Tron founder Justin Sun trying to absorb all the selling pressure before the upcoming approval of spot Ethereum ETF, scheduled within the next two weeks.\n\nJustin Buys Ethereum in Huge Quantity\n\nAs per on-chain data provider Spot on Chain, Tron founder Justin Sun spent a total of $5 million USDT in order to acquire 1,614 ETH at a price of $3,097 per token.\n\nadvertisement\n\nSun has been on an Ethereum accumulation spree since the beginning of the year. Spot on Chain reports that since February 8, Justin Sun has reportedly accumulated a total of 362,751 ETH across three different wallets, for an estimated total investment of $1.1 billion, and an average price of $3,047 per ETH.\n\nAlong with these purchases, Spot on Chain also noted that Sun recently deposited 45 million USDT to Binance, suggesting the possibility of future Ethereum acquisitions.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097. Since Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇). Note that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nInterestingly, the ETH whale accumulation has been happening just ahead of the spot Ether ETF approval, likely to happen before the end of July.\n\nAlso Read: Justin Sun Confirms Development Of Gas-Free Stablecoin Solution\n\nEthereum Whale Activity Jumps\n\nWhile Justin Sun has been picking up Ethereum from the exchanges, there have also been huge ETH deposits taking place recently. In the last 24 hours, the Golem Project was one of the major depositors of ETH to crypto exchange Binance. However, on-chain data shows that they have reportedly stopped selling ETH, while simultaneously staking a total of 40,000 ETH.\n\nMoreover, Elwood Technologies has also deposited 26,811 ETH worth over $84 million to crypto exchange Binance in the last three days. However, some of the Elwood-related addresses also withdrew 24,463 ETH from Binance during the same time.\n\nAs of now, the ETH price is holding firmly above $3,000 despite this massive whale activity. Technical indicators suggest that the Ethereum bottom could already be in.\n\n$ETH – Thought we were gonna bounce at the first support (red line) but that broke. The good news is this support is looking much stronger and that’s a much better response. I’m hoping that was the low of Q3. pic.twitter.com/GzitxuQN8i — IncomeSharks (@IncomeSharks) July 10, 2024\n\nAlso Read: Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUDhBNW1lUEhGZUhLNTRiQVE4YjlNOFJldkYwQWVDM3B6REFCWWh0eEZ6VEkzc3hnOExKRmU5cjNpYTVmbGd3bkdyMHJELUktZEdrcmh3MktPaDNZRkN2cEYyMXRtaHNNdHZleEZNeWJibWlsRC1zYjMyTlo2SzJ4Zmc0NXBqOWVNVTFyTNIBkgFBVV95cUxQOW9uU2taS2FvTG8zSFBYUGs1ZlpRTm1lVFEtOHJVdWJpem1MeUtlNGlLSVJJbl9NTjNpMndRcnlrUVRMT1pTaXREX3U2Wm9LYnAwc3dsNVdJSy10RGpZbHQzOVY3cGw5TUh6RW96OUtkaWMybnF1RVBnajk4blVMS3UyZUliSmZtU1ZVUDczeEduZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs ‘close to the finish line,’ celebrates Bitwise CCO - AMBCrypto News",
        "content": "The launch of Ethereum ETFs remained uncertain despite Gensler’s summer prediction.\n\nSEC’s cautious crypto stance contrasted with the Bitcoin ETF approval under Gensler.\n\nAmid mounting anticipation, the upcoming launch of a spot Ethereum [ETH] exchange-traded fund [ETF] has garnered significant attention.\n\n\n\nRemarking on the same, Katherine Dowling, Bitwise’s chief compliance officer, emphasized the uncertainty surrounding the exact launch date.\n\nBitwise CCO on ETH ETF\n\nDespite SEC Chair Gary Gensler predicting a summer debut for the ETH ETF, Dowling in a recent conversation with Bloomberg, said,\n\n“We’re seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC.”\n\nShe further added,\n\n“So that points all signs in the direction that we are close. We’re close to the finish line on the launch.”\n\nTime for a crypto-friendly SEC admin?\n\nThis is quite surprising because Bitwise was one of the first issuers to take proactive steps by submitting an amended S-1 form to the SEC ahead of schedule, on 8th July.\n\nThis move had back then sparked excitement within the crypto community about the imminent approval of the ETH ETF.\n\nHence, the delay and uncertainty in approval highlight the SEC’s cautious stance on crypto during the Biden administration.\n\nExpanding on the topic, Eric Balchunas, Senior ETF Analyst at Bloomberg, put it well when he said,\n\n“Looks like Solana ETFs are going to have a final deadline of mid-March 2025. But between now and then the most imp date is in November. If Biden wins, these likely DOA. If Trump wins, anything poss.”\n\nReiterating the same, Dowling added,\n\n“I think it’s going to be a really long haul to get some of these products out in the market, given the history we’ve had with getting these products to market and the fact of not having futures trading in some of these potential products.”\n\nNot all bad things!\n\nHowever, she also highlighted the SEC’s potential for positivity during the ETF approval process when she said,\n\n“But it’s an act of dialogue and I think our communication with the SEC about the prospects for these products has actually been quite welcoming.\n\nThis is important because, despite the SEC’s historical lack of interest in crypto, the current leadership under Gensler approved a decade-long-awaited Bitcoin [BTC] ETF.\n\nNeedless to say, the performance of the BTC ETF has been phenomenal since its debut on the 11th of January. As of the latest update on the 9th of July, the BTC ETF recorded inflows totaling $216.4 million as per Farside Investors."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOLVVIb3BaVEdJdTZKNTdCLUhsYlZxYXItakNRbGlsSGJQVXpHaW8tdXA0LXZSSHR5SnJ5TWY3RDFvR1pMRTl6SlVZWkE3MXYxZjJCY01hb0lVN29pQlhTS2F0YU5MZGIwSU5iWTNFTGJ3WXpadFdyZ1dsT3JaZnRJdVVqa9IBiAFBVV95cUxQR2NQdzJ6c0tYTFdldkJmekFSOHp5TjFyRjNJSjZRZ2ZPOWNNblowUnJlWFBGVllEdTF1eXZLMnhKcm1NY1NOUk8wNHJPSHd1cFlqSWhPUjFZVU9pN1p6Q0pFQmZXSmlyeEs5VWtqWTFDd1pNWDFrNExjcWV0UXJKZmg5eVE5VmFq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin v. Ethereum: Why BTC is Dominating the Battle - CryptoPotato",
        "content": "The 2023-24 crypto cycle has witnessed a deviation from historical norms in the ETH/BTC ratio. The ratio, in question, is a key indicator of capital rotation and risk appetite in the market.\n\nDespite the beginning of a bull market in late 2022, the ratio has unexpectedly continued to decline. Experts suggest that there are two factors at play with regard to this relative underperformance.\n\nUnexpected ETH/BTC Ratio\n\nAccording to the latest joint report by Glassnode and CME Group, the approval of spot Bitcoin ETFs in the US in January 2024 is the first factor that significantly boosted buy-side pressure for the leading crypto.\n\nSecondly, the intense competition among Proof-of-Stake (PoS) blockchains has been challenging Ethereum’s dominance in areas such as liquidity, capital attraction, user experience, and, most importantly, scalability.\n\n“Historically, the largest asset, Bitcoin, tends to lead the market during bear markets and early bull markets but lags during the more speculative phases of late-stage bulls. The ETH/BTC ratio is a tool many analysts consult as a gauge for the degree of capital rotation taking place, which is based on Ethereum serving as a bellwether asset for general risk appetite. However, an interesting shift from the cyclical norms has occurred during the 2023-24 cycle.”\n\nHowever, experts from Glassnode and CME Group expect this landscape to evolve as the introduction of spot Ether ETFs in the country could potentially catalyze a reversal of this downtrend.\n\nInvestors are eagerly waiting to spot Ethereum ETFs. This week, several prominent asset managers, VanEck, Grayscale, Fidelity, BlackRock, 21Shares, Franklin Templeton, and Bitwise, have submitted their revised spot ETH ETF S-1 registration statements with the US Securities and Exchange Commission (SEC).\n\nThe regulator set July 8 as the deadline for issuers to submit their amended drafts. Industry experts are optimistic that the securities watchdog could approve the drafts within the next two weeks as issuers have already completed a significant portion of the necessary preparations.\n\nIt’s worth noting that while the SEC approved issuers’ spot ETH ETF 19b-4 applications on May 23, they also need to greenlight their S-1s before trading can begin.\n\nEthereum On-Chain Metrics\n\nAmidst improved sentiment, Ethereum has managed to retain its position above the $3,000 level.\n\nMoreover, the latest data suggest that the altcoin is currently near a potential bottom, as evidenced by the Ethereum Realized Cap, which currently stands at $240 billion. With the market cap close to or below the realized cap, many holders are at a loss. Historically, this indicates a late-stage bear market, implying that Ethereum’s price might be poised for a bullish reversal.\n\nMeanwhile, Ethereum’s current Market Value to Realized Value (MVRV) ratio is showing signs of improving profitability and is in the recovery and bull market phase. The MVRV ratio has been steadily increasing since mid-2023, which was depicted as the late stage of a bear market, and is now above 1.0, indicating that the average Ethereum investor is holding unrealized profits."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQNmFqZXBNVVhYUmZubS1GZmN6WThTV2hWaWo2X2RvZVpJdDMyazhDSlZvaHhEUVRaQ3EtaU9PSDAwNnIzanVMU0tyUk84S1JrMkh0NjB0N0VhMW1yZ1VaZFNrOS1CR194V0hlZ2ZNbEY3Ui1CTnF1Tjg1cUhSQ2RudTNsQ2FFX1dMUm14cHQtRUROc1lxLVhYU3BrUzJSYjB6dVJablA4Sjg3bXMwU095aTc1b3HSAboBQVVfeXFMUHh3MEdndW5kZXowMnRnN2RYem54RnE2ckZFR29NUmY3VWFDY2dDLW1jWkRYRk90ZWJ1NGRyQnVEcW9OSG1FT1RldGQyUmd4TTByQnpnUXNIN3cteHFrRENVV1lmUnhodWFsNVFSX0FNbDVjTjhVNWNkVFZUTXRQYjV1UlBma2Frb0JWa29UUVo5R0RRTHpjR1BLV0Z3Y1dJdkNCelQySElHU3NySmlKVHdPMnRXdnplQ19n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Hitting New Records: 47.36 Million ETH Stake in the ETH2 Beacon Deposit Contract - CryptoPotato",
        "content": "Ethereum 2.0 staking has seen significant growth, and a major milestone has been reached. As such, the deposit contract for staking Ethereum on the Beacon Chain reached an all-time high of 47.36 million ETH this week.\n\nInterestingly, this accounts for 33.9% of the entire Ethereum supply.\n\nETH2 Staking Milestone\n\nAccording to the data shared by the crypto analytic platform Santiment, this is a dramatic increase from two years ago when it held only 10.9% of the supply, effectively more than tripling its share.\n\n“The ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high 47.36M ETH, This is good for 33.9% of the entire supply, and more than tripling since the 10.9% it held two years ago.”\n\nSantiment also highlighted the redistribution of ETH over different wallet tiers. As such, wallets holding more than 10 million ETH, representing the Beacon Deposit Contract, increased their share by 23% of ETH’s supply in the past two years.\n\nOn the other hand, holdings for other wallet categories have declined, with 10K+ETH wallets (excluding the Beacon Deposit Contract) dropping 5.3% and wallets with 10K or less ETH decreasing by 17.7% over the same period. This shift signaled a growing participation in Ethereum 2.0 staking.\n\nImpact of Growing Participation in Ethereum Staking\n\nDespite the growing inclination towards staking, data suggests that both staking reward rates and inflation rates have unexpectedly decreased.\n\nThe reward rate represents the annual percentage return for staking ETH, similar to interest earned for contributing to network security. Meanwhile, the inflation rate measures the pace at which the total ETH supply grows, with new ETH minted as staking rewards contributing to the inflationary trend.\n\nThe lower reward rate implies that stakers will receive less new ETH per staked token in the near term. However, the reduced inflation rate means the overall ETH supply is expanding more slowly. This could benefit ETH’s value in the long run."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWXRJM3RQNDV6a294Mmg2QlhvTlAxRXJFeTdMVzBVTU4zMHVzR3VnRXFtbi1lNmZDbUs2c0dmWnlzZksxZFJXSllhSlJmMUp1UkQwbTZEbTB1R3g3QUdJS0JQOTdyYkVSbmgxYmJwSXFZV3JpRnd3RE5RV1owR25LUnhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Crypto : Ethereum au bord du gouffre ? - Cointribune EN",
        "content": "Wed 10 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nAs Ethereum is not far from the critical zone of $3,200, sell signals are multiplying among investors. This resistance, combined with expectations regarding the launch of an ETF on Ether, creates a tense and uncertain market climate. The current volatility could have major consequences for the future of the second-largest cryptocurrency.\n\nEthereum facing resistance at $3,200\n\nEthereum, the second-largest crypto by market capitalization, recently crossed the $3,000 mark, but it encounters major resistance at $3,200. This price barrier is critical, on-chain data shows that about 2 million addresses that bought Ethereum around this level are currently at a loss. These investors might choose to sell their cryptos to recover their initial investments, increasing the selling pressure on the market.\n\nHowever, the imminent launch of an ETF (Exchange-Traded Product) on Ether could change the game. This event is likely to inject new capital into the market, counterbalancing the selling pressure and generating a positive momentum for prices. Despite everything, Ethereum struggles to break through the $3,200 resistance, illustrating the current fragility of its position.\n\nMarket sentiments and projections\n\nDespite the optimism surrounding the launch of the ETF on Ether, the price of Ethereum remains unstable. Currently, ETH is oscillating around $3,100, with recent fluctuations indicating uncertainty among investors. Data from Coinglass shows a slight increase in Open Interest in ETH futures, reaching $12.67 billion, while the derivatives volume has dropped significantly. This combination highlights a sense of caution and expectation in the market.\n\nThe Relative Strength Index (RSI) of Ethereum, currently at 40, indicates that the asset is neither overbought nor oversold, marking a neutral position that could shift either way. The situation is worsened by large purchases, such as the recent acquisition of 16,000 ETH by a whale, showing that some investors are anticipating a rise due to the ETF.\n\nThe short-term outlook for Ethereum is thus marked by high volatility and persistent uncertainty. The selling pressure at $3,200 remains a major obstacle, but the launch of the ETF will undoubtedly bring a capital influx that will change the game.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQOE00U2t3czRIdmJ4VlhoamtLdnU4YUxBaTlKQnVVUlpoRUhKYmJtRzRuT0VmTnotTkFPRTBoOXpOMldMelEtdUJkOTZpczE1Tlo4NkRJMTQzNElvTWRtSjZVZkpzM0t6RzVsaWFpRktXaFJ4YXVEck05dkR3bG01VERPX2IzMjJibHoyYU9QN1pNbWoxLVA5MF9EOEJCQk94SW50RUdpWkFqYk8yc2NWT2g4eTYxUURRSFd3cnp2MkFUZk5nRDZoMlJ1bFNXWHhrUHM1YTJsLWFjd2o0YnpCeHpwSGNDVFY20gHuAUFVX3lxTE1mQWc4S3NiQlpMNEtiUjZTRnZpajBYNG8xdXp1eHJXa0NhamZ4QTdrcUZEUzhSVVJJaGpCdzhHRHJuNEFtQ3U1RTJseFdkZE9ickppTUlWTWJhRzdqbzdqRnFONHpHZGJLTXNGVVQ5QlhLeW9DUm1NbENEMTJsV3VITEhia1YyU05OYlBYajFJeklVSlJkNUdsMWNDaW5CelBITTk0STRTeHB3UWszcjRONmdsT2tHWk9vLVVQWi1fUUFVTnFBYlZ6VUJ1X1pKbDBnTUZrZDZtQmFLZ05uN3c4RDhUb0V1ellUVTFDZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin eyes upside move on bullish technicals - FXStreet",
        "content": "Bitcoin price action shows a bullish divergence on the momentum indicators, signaling a bullish move.\n\nEthereum finds support around the key level at $2,817, with an impending rally eyed.\n\nRipple price finds support around the weekly support level of $0.413, with potential recovery on the cards.\n\nBitcoin (BTC) price action indicates a bullish signal from the Relative Strength Index (RSI) and the Awesome Oscillator (AO) indicators, foretelling an upward trend. Ethereum (ETH) and Ripple (XRP) are mirroring Bitcoin's path, finding stability at critical levels and suggesting potential price increases shortly.\n\nBitcoin price looks promising as technical indicators show bullish divergence\n\nBitcoin price encountered resistance at the weekly resistance level of $58,375 in the past four days and trades below it around $57,810, 0.56% down on Wednesday.\n\nAdditionally, the formation of a lower low in the daily chart on July 5 contrasts with the Relative Strength Index's (RSI) higher high during the same period. This development is termed a bullish divergence and often leads to the reversal of the trend or a short-term rally.\n\nIf BTC closes above the $58,375 weekly resistance level, it could rise 9% to revisit the daily resistance at $63,956.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes below the $52,266 daily support level and forms a lower low in the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 4% decline in Bitcoin's price to revisit its daily low of $50,521 from February 23.\n\nEthereum price eyes rally following support retest\n\nEthereum price found support on Monday at the $2,817 low of May 1, bouncing 1.58% the next day. At the time of writing, it trades 0.49% down at $3,059 on Wednesday.\n\nIf ETH closes above the $3,240 level, it could rise 8.8% to retest its daily high from July 1 at $3,524.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective neutral levels of 50 and zero. For bulls to sustain momentum, both indicators must rise above these critical levels, potentially supporting the ongoing recovery rally.\n\nAdditionally, if ETH closes above the $3,240 level, it could extend an additional rise of 5.5% to retest its next daily high at $3,717 from June 9.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below $2,817, forming a lower low in the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 7% decline in Ethereum's price to revisit its daily support at $2,621.\n\nRipple price shows potential recovery rally\n\nRipple price found support around the weekly level of $0.413 on Monday and bounced 1% the next day. At the time of writing, it trades 0.2% down at $0.434 on Wednesday.\n\nIf XRP’s daily close above the $0.450 level, it could rally 11% to revisit its daily resistance at $0.499.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective neutral levels of 50 and zero. For bulls to sustain momentum, both indicators must rise above these critical levels, potentially supporting the ongoing recovery rally.\n\nAdditionally, if XRP closes below the $0.499 level, it could extend an additional rise of 6.4% to retest its next daily high at $0.532 from June 5.\n\nXRP/USDT daily chart\n\nConversely, if the Ripple price daily candlestick closes below $0.413 and forms a lower daily low, it could indicate that bearish sentiment persists. Such a development may trigger a 16% crash in Ripple's price to revisit its low of March 12 at $0.347."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQMDlmc2xSb0syaXQyTFlVNHN5aV82RFR5SzJwQjZ3RnEzb1Q5d1NuN0xiOU5ULVZmc1dpYUc4VmVBYmJMdzJVVzFNdkg5N1pBbXN5RnBHUG5pNG5nVWRydlRpQ2FEV1lqTUxveGdIMHdxT2I5MnpmQnM4YTRsVTFWSm1ZaHBKM2Vkek9QMl9B0gGTAUFVX3lxTFBCMFVsUVhTaFRxNUVpWjVBekdVbHVyaVI2QXhhaDlTSDRHRVVhenBoTEFpdjVuRGtzYjBoODkyaTl3djNUYjhqcnZ5cHljTVJlcFJ3aXBSYnhIcGhpc211SkFvSmtZb1pRbUllUkN3U0llMlRwTlZfVlF4SlpsQzVqd2JFMURuM04xb3pNSDQ5bFZnZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Executive Says Ethereum ETF Is Close to the Finish Line - CoinGape",
        "content": "Katherine Dowling, the Chief Compliance Officer of Bitwise has expressed optimism on a near approval of spot Ethereum ETFs in the United States. This comes on the heels of spot ETFs S-1 amendments filed by issuers to the Securities and Exchange Commission (SEC). Crypto users await possible approvals to drive inflows in the market.\n\nBitwise Executive Points to Approvals\n\nBitwise CLO Katherine Dowling stated that Ethereum ETFs are close to the finish line of the launch. In a recent Bloomberg interview, she highlighted the status quo including other developments with the financial regulator. Responding to talks of Ethereum being a harder-to-sell asset than Bitcoin, Dowling answered in the negative noting that the asset has its market structure.\n\nadvertisement\n\n“It is explainable, not as easily explainable as the qualities of Bitcoin, but we are six months behind here and close to a launch of these spot ETH ETFs. Chair Gensler said it’s gonna be sometime over the summer; everyone has their different definitions of summer… but we’re seeing in the S-1 amendments that there are fewer issues vetted back… that points to all signs that we are close to the finish line of the launch.”\n\nFurthermore, she added that products can be marketed more than currencies used to buy items but technology innovations with Bitwise increasing investment education efforts. Recently, all potential ETF issuers filed their amended S-1 with the SEC. Bitwise filing includes waiving the sponsor for $500 million in assets.\n\nCompetition Good For The Market\n\nThe Bitwise executive noted that it is great for investors for multiple issuers to get approved at once adding that the company sets itself apart as the crypt market specialist. Highlighting the company’s strengths, she pointed to efforts with traders and other market factors. Several crypto users also share similar sentiments on the benefits of diverse ETF issuers. The launch of these products will drive investment in the market as it opens up a new investment window.\n\nAlso Read: Decade Old Dormant Bitcoin (BTC) Address Wakes Up To 10,419% Profit\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOY2VzQjBUSHhKVUM2aFFOOEhfRTNPN3dpTkNDXzU0SnREU3dwYzJ2Q0RYeElQM3RTbVdUUG9rVXZ0djRBR3FTWHpsNkJtcldXLWdaWFhKNFJudTNhSUpkVUtMazUwZ3U0ZXJveEQ1bGt2Q3FabFJ3UDVXcWlCS09CaWU0ZVZrT3hkVVYyUjNMNXZObmM1aGJKRHlsVVdWZ9IBowFBVV95cUxNOEx2aWJ3TnBMenhCVXRsczAwUWlScl9VSU1iR2R5blF3cEk5LXVaTlhRN3VPVGtESDNtRHBMSXdkM08zU2lVLWhkTVFtalZ3WldyajRoT0xacWRva1MtM3BCT283TGZWYm56TzVzWEd3VXJJZ3hUWFZneVBRQ3htaEdMYU9uS0k0MWVGMFZlLXh6d29pVlBJUldpT0paX3RNcHRV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service Price Prediction: Why ENS Lags Despite Network Growth - CoinGape",
        "content": "The Ethereum Name Service (ENS) price decreased by 3.4% in the last 24 hours to trade at $26.03 during American trading hours on Thursday. The price drop negates the substantial growth ENS is experiencing in network adoption and integration. Can ENS price catch up to its fundamentals?\n\nEthereum Name Service Price Analysis: Rising Channel Hints 21% Short-Term Gains\n\nENS price has been trending inside a sizeable rising channel since July 5. Rising channels are famous for breaking out to the downside. The price of ENS also recently broke downward from a short descending channel, reaching the bottom trendline of the rising channel.\n\nadvertisement\n\nThe price action of ENS is also trending below the 21-day, 50-day, and 200-day simple moving averages. The 200-day SMA is currently offering some resistance to the asset’s price. A break above this indicator may result in a 4.11% surge that places the ENS price at $26.65, which coincides with a falling trendline acting as resistance. If ENS breaks above this trend line, it may increase by 17% to trade around $31.83.\n\nData from Santiment shows that altcoins like Ethereum Name Service (ENS) have grown in their networks in the last 24 hours, with 741 new wallets created. However, the ENS price still lags.\n\n📈 Altcoins like Ethereum Name Service (ENS) and Treasure (MAGIC) have erupted in network growth over the past 24 hours, surpassing major milestones. Historically, when projects see these spikes while at a flat price performance, there is an increased chance of a breakout. pic.twitter.com/9Ejnbd2IzW — Santiment (@santimentfeed) July 10, 2024\n\nMarket Speculation Impacts Ethereum Name Service Utility\n\nWhile ENS provides a valuable service, the token’s utility is currently overshadowed by speculative trading. This is further supported by the Chaikin Money Flow (CMF), which is below the zero line and heading downward. It indicates that the selling pressure on ENS is growing.\n\nNevertheless, the ENS Market Value to Realized Value (MVRV) Z-Score is below the zero line, indicating that it may be an opportune time to accumulate ENS as it is undervalued.\n\nGeneral Market Downturn is Pulling ENS Price Down\n\nENS is part of a bigger market that is greatly influenced by Bitcoin price movements. The recent BTC sell-off affected many cryptocurrencies, including ENS. However, given the robust network growth, a slight market recovery may result in significant price surges for the token.\n\nBesides, the total supply of ENS tokens is capped at 100 million, and their distribution can affect their price. Santiment shows the ENS Gini Index (a measure of the inequality among the values of a frequency distribution) at 0.903, indicating that the ENS distribution among holders is near perfect equality. The risk of whale dumps and sell-offs on ENS is almost 0.\n\nBottom Line\n\nDespite significant Ethereum Name Service network growth, the ENS token price has not kept pace with these developments. This disconnect between network adoption and token value suggests that other factors, such as market sentiment, may be influencing ENS’s price performance.\n\nFrequently Asked Questions (FAQs) 1. Why is the ENS price lagging despite network growth? The ENS price lags due to factors such as market speculation, selling pressure indicated by the Chaikin Money Flow (CMF), and general market downturns influenced by Bitcoin's price movements, overshadowing its network growth. 2. Is now a good time to invest in ENS? With the Market Value to Realized Value (MVRV) Z-Score indicating ENS is undervalued and the Gini Index showing near-perfect equality in token distribution, it may be an opportune time to accumulate ENS, despite the current price lag. 3. What is ENS? The Ethereum Name Service (ENS) is a distributed, open, and extensible naming system based on the Ethereum blockchain. ENS aims to map human-readable names, such as \"example.eth,\" to machine-readable identifiers, including Ethereum addresses, other cryptocurrency addresses, content hashes, and metadata. This system simplifies the process of interacting with Ethereum addresses and other resources, making blockchain technology more accessible and user-friendly.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQZHZWd3JRbi0walJBdGpRUmlMYkZwZ0R3RDhpMmZNbk83eUd3QmtjdW1XbnpDNmpETUp6ZDlmNS11ZXl6dDN1WUlHUEYzdHAzLUhINHVwS2VQSmtWTnM2Y2kydFh1UTc2NnNkTGMtVDVrVDQtSHNscUVCYWV3ZGZtaTJkclhZajhPSDQ1cjQwV3I1eGFhSVYtZXR4SkY0RGNUT29rb9IBqgFBVV95cUxQcHVjcVZudjF1Y2pPN0ZoSHB5UUR4Y1g3aVZaVG40Q0VkN3dfRnNELTg4bDRXSjYxMXM3UEVDeUVKYzl2OHc3YnRENWhkTHhGZ0NyTV9TQlRVQVNCQnkyVXUwMHFxTUxpQmhpdGc3c0FVNTV4RU5EV1JidEZWREZOVlVHbktUU1hNQVNvamZrMklYWkk4dktHa1NDUXVDdDhMLVUwcXhyRU9iUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Staked Ether Close to All-Time High as ETF Approval Nears - CoinDesk",
        "content": "The increasing supply of the second-largest cryptocurrency is a sign it has returned to being an inflationary asset, undermining its capability to act as a store of value over time. There are ways to counter this such as staking, which locks ether for a fixed period of time, and burning – or permanently removing from circulation – a portion of the transaction fees paid by users."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTlQyNWUwUUtQUEtWMDVSeEtfd2twMjVyTXhkSHFZbzJMaGJHWnhnZU1fMDhoeFRZcFV3ZFRXVmt1VXd5UFNTbl9sbUZ0dHNfeFVNNW9iSzN2aEtiUlZ3azh1SkFmQXpQMW5QWkZUQ09ENHFoRHdCeXFDSzVxZTF3LXdvdVh0S3lmTU5vbDhJT1pHNW9oNmZNWnE1MjfSAaoBQVVfeXFMTnZQNE9WdDBWbDVhYmFJb1luTi1uV0pabTVEaDVNWGVkTlNQY19oWDJKaUplZ2JuRWFuUmN4bTV2MzdXeFltYzI2dlNWOVdPZW8zQ1RKd1VNbl84VEJDMXhRRWZmblkxeFd3MjBBdVROTm1mYk1jUXlIM0FwdXZrRGE5Q1VvOTNEdkRneEhkZDIzLVJXNVVNMnA5Q09BamZmTDllcWlwR1lKS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Code Review 2024 – Is It A Legit Trading Platform? - Outlook India",
        "content": "What is Ethereum Code?\n\nEthereum Code is an online trading and educational platform that offers a wide range of trading and learning perks. It has been created to assist users with various needs and delivers reliable information and trading sources to begin with.\n\nThe user-friendliness of Ethereum Code allows users to get a personalized experience that can be achieved by customizing the dashboard easily. Moreover, the platform features comprehensive learning resources that can be used for upskilling trading techniques by users of all kinds. It features:\n\nAccess to the crypto market for trading needs\n\nHigh-end trading tools for accurate trading\n\nRisk assessment and tips\n\nEducational resources for learning needs\n\nPersonalized organizational dashboard\n\nHow Does Ethereum Code Work?\n\nOne of the best things about Ethereum Code is that it operates as a bridge between users, trading brokers, and educational companies. It allows users to access market insights for trading while learning from reputed educational sources.\n\nExplore Ethereum Code’s Official Website\n\nUnlike other trading sources, it uses high-end and sophisticated trading bots that assist traders in their journey. In addition, it carefully sources educational materials so that traders can benefit from what they learn and implement it practically.\n\nWhile trading, it analyzes the preferences of the users and finds opportunities in the market accordingly. Hence, it's like a trading assistant that you can assign a task and let it handle the rest. All you have to do is sign up, check out the opportunities waiting for you, and trade to earn the benefit.\n\nFeatures of Ethereum Code\n\nLet’s check out some appealing features of Ethereum Code:\n\nPersonalized Platform Experience\n\nAn attractive thing about Ethereum Code is that it allows users to customize their dashboard according to their preferences. This feature is usually limited in other platforms where you can only add limited resources to your dashboard.\n\nHowever, with Ethereum Code, you can easily add resources from educational to trading and tools on your dashboard. This kind of personalization makes navigation easy and the interface clean, giving the user good control over what they want to interact with.\n\nSupports Different Cryptocurrencies\n\nWhile working with any trading platform, users need to consider the kind of currencies it supports and allows trading with. Fortunately, the Ethereum Code allows trading in various currencies, including but not limited to Ether, Shiba, etc. as well as mixing these currencies for trading needs.\n\nHigh Success Rate\n\nSuccess rate matters a lot when choosing a trading platform. Success rate defines the rate of positive trading returns based on the insights the trading bots share. If the success rate is low, then you shouldn’t be bothering with the platform at all.\n\nFortunately, with Ethereum Code, you can rest easy as it offers more than a 95% success rate. Although this rate is claimed, it's not entirely true and can vary based on the trading processes used by the traders.\n\nHowever, the platform creators still state that the platform features a high success rate, which makes it a compelling choice for a trading platform to begin with. Again, it's strongly recommended that the users adopt only legitimate ways of trading and investing only the amount that they can risk losing while working with a broker for risky trades.\n\nEasy Withdrawals\n\nWhile using most market platforms, it was discovered that the users had a hard time withdrawing their invested money. Moreover, it was also identified that users faced difficulties while trying to withdraw their profits. But thankfully, Ethereum Code facilitates the users in this matter.\n\nIt not only allows the users to withdraw their profits or transfer them to other sources but also withdraw their entire capital to close the account or for any other reason. After proper authentication, customer support assists the users in proceeding with their withdrawals, which are usually processed in 48 hours.\n\nDemo Account\n\nWhile it features numerous learning resources to begin your trading journey with, it also facilitates the users with practical trading through a demo account. The demo account is formed just to give a hands-on experience to the users of how the platform and trading with it works.\n\nIn other words, the demo account is filled with the exact features and tools that one can find in the real-time account except it features demo money. Hence, the users can trade without the fear of losing their investment.\n\nOnce the users have experienced trading, they can easily switch to the real account and start trading. The demo account is always available for the users whenever they want to switch and strengthen their learning or test various trading techniques.\n\nRobust Customer Service\n\nCustomer service plays an important part in the functionality of any trading platform. From entertaining the queries to resolving the issues, it has to be readily available so that the users can reach out to it in times of distress.\n\nFortunately, Ethereum Code features such robust customer service that is available to the users 24/7. Whether it’s an issue with withdrawals, payments, etc. or you want to know how to get started with Ethereum Code, the customer service will entertain your queries and will assist with everything.\n\nCatalog of Useful Educational Resources\n\nAs it’s an investment learning platform, Ethereum Code features numerous educational resources. These resources are carefully sourced so that they can entertain queries related to trading, eventually helping the users strengthen their concepts.\n\nMoreover, some of these resources are free to access and easily available when you sign up for the platform. As for others, these carry a small fee since they offer certifications and can help you earn a reputation as a well-versed and certified trading expert.\n\nHowever, it’s a small fee to pay for such an organized and useful catalog of educational sources, which is why Ethereum Code is reliable enough.\n\nHigh-End Security\n\nWhen it comes to choosing a trading platform, you cannot overlook the level of security and safety the platform has to offer. Crypto trading platforms hold sensitive information regarding payment methods as well as user profiles. Hence, it's only evident that this information is secured with high-end measures.\n\nThankfully, Ethereum Code ensures that its platform, the data, and the users are protected at all costs. It uses strong encryptions and two-factor authentication methods to guarantee only legitimate users are accessing the platform.\n\nSome Downsides to Ethereum Code\n\nEven though the platform offers a series of compelling perks and features, to begin with, it still has some downsides that the users should be aware of:\n\nLack of an App\n\nSimply put, there isn't any Ethereum Code app; however, the creators are vigorously working on creating and launching one.\n\nAvailability Issues\n\nEven though Ethereum Code is available to users in countries such as Germany, China, the UK, etc. it's not available to users in the US. Hence, in order to access Ethereum Code in the US, you'd need to use a VPN. However, VPN use isn't recommended for high-end trading since internet fluctuations can cause errors in the reports and insights fetched by the platform, causing losses.\n\nHow to Get Started with Ethereum Code?\n\nNow that we’ve gone through what Ethereum Code is, how it operates, and its features, it’s time to let you know how you can join and get started with it. Check out the process below:\n\nSigning Up\n\nThe first step is signing up with Ethereum Code. You need to visit the official website of Ethereum Code and click on register or sign up to create your account. Once you do, you’ll be directed to a form where you’d need to input your contact information including username, email, contact information, etc.\n\nExplore Ethereum Code’s Official Website\n\nConnecting with an Expert\n\nOnce you input your details, you’ve officially created your user account. Shortly afterward, you’ll receive an email on your provided address, indicating that you need to verify your account.\n\nOnce you do, you’ll connect with a customer service representative that will ask some basic questions. These questions will include your investment and trading goals, risk approaches, and other metrics.\n\nThe representatives will ask these so that they can customize your dashboard layout as well as feature relevant educational materials for you to begin with.\n\nInitial Deposit\n\nAfter connecting with an expert and sharing your trading requirements, you'll be directed to a payment form where you need to share your payment details. This will be used for depositing your initial capital of $250.\n\nThis amount is required to complete your registration as a legit user as well as provide initial capital that you can use later for trading. In addition, you can also add more funds to this capital amount and use it later instead of re-depositing the amount again.\n\nChoosing Your Account Type\n\nFollowing the submission of your investment capital, you’ll be directed to the page where you need to choose the account that you need to begin with. This includes the demo account that we mentioned earlier.\n\nIf you're a beginner or even a professional who wants to begin your journey experiencing the platform, then you can choose the demo account right away. Once you've done getting hands-on experience, you can switch to your manual account easily.\n\nHave Celebrities Endorsed the Ethereum Code?\n\nAs far as our Ethereum Code review shows, the platform hasn't been endorsed by any celebrities. Hence, it's safe to say that any website claiming that Elon Musk or Jeff Bezos supports the Ethereum Code is false and users should abstain from following such sources.\n\nMoreover, it’s also recommended that the users only follow the news sources provided by the platform itself instead of following any other material online. Ethereum Code has a community page as well where it shares recent updates in the market as well as news about the platform.\n\nIn any case of collaboration or official launches, users can easily refer to this page or reach out to customer service to know the details.\n\nIs There a Dedicated Ethereum Code App?\n\nUnfortunately, there is no Ethereum Code app in the market and the creators are working diligently to create and launch one. Hence, Ethereum Code is under work; however, it's recommended that users not trust any such apps available on the market since they are not legit.\n\nThe platform creators have clearly shared that any such applications are not legit and they don't take any responsibility for losses or scams occurring through these apps. It's only recommended that users stick with the official website of Ethereum Code for updates on its app launch.\n\nIs Ethereum Code Legit?\n\nPerhaps one of the reasons why the Ethereum Code is quite recommended for traders is that it operates as an investment educational platform. It not only allows traders to invest and trade cryptocurrency but also allows them to learn from its numerous educational resources.\n\nThe availability of online resources, robust customer service, and amazing workability and design allow Ethereum Code to feature competitive trading perks for users. Hence, it's well-equipped to offer risk assessment and trading expertise, giving better insights into trading even on other platforms.\n\nFinal Thoughts\n\nEthereum Code is a legit platform that has a trading success rate while offering great means for users to learn more about trading. The customer service is readily available to assist with all matters and the high-end security measures make it quite compelling to be chosen for a trading platform."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOR2FveW1wY3dtZmRZNFhxSEctSmhPVUpzVHpxNXgwbng2ZkV5LUJROHVnd1RwbWJ5YkRoU01FZXNJcHpPOTQ4WEFTY0tEUjdpUm5UX0VGU0thOFRoMXhfdlBUZHpXX1pCZURwWURlb0Fia3VWaVo1NlNEX3hjekNsTmlyQnZqX1gyZExiM3pXVXFtcGhoUkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Ruled as Commodities in Illinois, CFTC Chair Says - Watcher Guru",
        "content": "At a Senate Committee hearing today, CFTC Chairman Rostin Behnam said both Bitcoin and Ethereum were ruled as commodities in the state of Illinois. Indeed, Behnam noted that last week saw a district court rule in favor of the agency in a fraud case, offering a judgment with important ramifications.\n\nBehnam noted that the decision, “reaffirmed that both Bitcoin and Ether are commodities under the Commodities Exchange Act.” The question of the cryptocurrency’s status as a security or a commodity has been a consistent issue between the industry and the US Securities and Exchange Commission (SEC).\n\nJUST IN: 🇺🇸 CFTC Chairman says Illinois court ruled #Bitcoin & Ethereum are commodities. pic.twitter.com/zkmvQQ8ThN July 10, 2024\n\nAlso Read: Donald Trump to Spark a Bitcoin Rally in the Second Half of the Year if Elected\n\nCFTC Chair Reaffirms BTC and ETH Commodity Classification\n\nSource: Blockchain Reporter\n\nIn the United States, there is an important difference between a security and a commodity. The latter is a basic good that is used in commerce and interchangeable with similar goods. Assets like gold, oil, or agriculture would be various commodities.\n\nAlternatively, a security is an asset that indicates ownership stake in a publicly traded company. Moreover, who governs the assets is an even more important distinction. Commodities are patrolled by the CFTC, while securities are overlooked by the SEC. The lack of clarity on crypto has led the latter to embrace increased enforcement over the market.\n\nSource: Bloomberg\n\nAlso Read: CFTC Calls Ethereum & Litecoin Commodities in KuCoin Lawsuit\n\nHowever, according to Behman, anywhere between 70% and 80% of all cryptocurrencies are non-securities. For Bitcoin and Ethereum specifically, the CFTC Chair notes that a recent court ruling affirmed their commodity status. If this sets off a trend of similar rulings, there could be an overwhelming shift in the crypto market.\n\nThe presence of crypto-based ETFs for both BTC and ETH is a good sign. That set’s a precedent for both, with it classifying the assets as a commodity ETF. Moreover, it could lessen the industry’s continued difficulty with Gary Gensler and the SEC. The SEC Chair has been outspoken in his unsavory opinion of the market as a whole."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQbWZ6QUh6b29VdWdZMjg0MWlGWFlBaHpFQmg0dkpOdGxaaGdEakVYczlGbWxqb0RPTzBPVUt0WXA5MG1oQUJPN0xBSWF5a0F3TUF2NzgtQk9QeXZHQi1aa2ZyTGdDV1pmRm52ZWxGZjVUUFN2bmtCYXFBallHRUxPNmZmQkY5YzVkYWd4WXJlNjBHazI0c3JQZzF4UnpzdG9fNWxYdE95d0RvUk1RQkZlUVVmS0o0d3A4NUpWV3Z6cjU2Z2xHWFRLb19yTGc4WDN1Y2cwMnFCVkNOUWFNVExhd2c5WWFLVU50X1lneE9XY0V1RHpVdG9GS9IB_gFBVV95cUxNOFJtWWRyTGFhZ3FWbng5VkpuZ1dSTGdCcTRZYTNtREszaFRKM2xXTzRUYVE5UGVUWXZHdVlkeUFWN1VVR2d2WEZiQ1pkSF9MVDJWVTV5SmxsaHlZWlVzU05ERWVCeEwyMTBjMzRsMkdZMjViM25FTVk2dUMxR0gzc3FrZDNOcXhyZG50UGo0eV9SQ2YxV3ZiMDBkLVotUVpya3FDbUE5dk8tbmQxbmluNFpFb2hXVE5xeFpVeHZKODJGRHp6RU00dGlzZUtNbzI0c0pxdHFFajliYWNOWlNYWFozWTA5Y0czM0w2aEpJQmt5VzRzdXUzMGxsaHh0dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum and Ripple rally even as whales make big moves - FXStreet",
        "content": "URGENT: The Compound Labs website (compound[.]finance) has been compromised. Please do not visit the website or clink any links until further notice. An update will be provided when available. This is our final message // end of tweet.\n\nOne of the greatest minds in crypto, @VitalikButerin just held a keynote at @EthCC . Topic: How to strengthen the Ethereum ecosystem. In case you missed it, here are the best parts of Vitalik's talk ⤵️ pic.twitter.com/10dwe8y6rI\n\nThat’s nice and all, but we can see by looking at Ripple’s financials in the years after this video 2017-2020 that their software revenue is around 2% and the other 98% is selling XRP. By looking at their expenses, we can see they would be out of business with XRP sales. pic.twitter.com/51RII7Tksl\n\nONDO is trading around $1.000 at the time of writing. ONDO is likely to rally 8% and extend gains to $1.093, the upper boundary of the Fair Value Gap (FVG), as seen in the daily chart above.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOY0lVaDRackxuUlhLYjZnbzJyRmJCLTkyeExSb3JobzBDVzZBUzlseDlaRmh4Sm1sSXByWU4tOVRFVFdPMHpHY2pYeTIyM01WdGdmTDY5N0xRSFkzM3NZNzMwTlpMQUt5N055azJRMTFlQjdpb1ZybWwtdktPdjhnSGZwLVAtMkNobHVUbnljbllydTl1T0NMMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin visits Waterloo - University of Waterloo",
        "content": "On Saturday, July 6, nearly two hundred students gathered for an ask-me-anything event with Vitalik Buterin, the co-creator of the Ethereum blockchain and a former University of Waterloo student.\n\nButerin studied computer science at Waterloo and worked as a research assistant for cryptographer and computer science professor Ian Goldberg. In 2013 he wrote a white paper proposing Ethereum. Buterin was awarded a $100,000 USD grant from the Thiel Fellowship in 2014 and subsequently left Waterloo to work on Ethereum full-time. Today, Ethereum is second only to Bitcoin in market value.\n\nIn his talk, Buterin discussed the math behind the blockchain, areas for innovation and the future of cryptocurrency. “Will crypto become the Esperanto of finance, the Linux of finance or the Internet of finance?” he asked rhetorically. “I think it depends — there are a lot of countries, particularly in the developing world, where there is a lot of demand for cryptocurrency because the traditional banking system is not effective.”\n\nButerin also distinguished between early-stage technologies (like cryptocurrency, AI and space travel) and later-stage technologies (like the pharmaceutical industry), arguing that early-stage technologies are an ideal space for ambitious thinking, innovation and employing pure math, engineering and science. “There’s a real focus right now on building amazing things,” he said.\n\n“We are incredibly lucky to have Vitalik come into town to talk about Ethereum and its future roadmap,” said systems design engineering master’s student Monica Tsang. “He encouraged us to work on the optimistic, idealistic side of blockchain development instead of chasing quick money. Being a jack-of-all trades will help us learn new knowledge fast in this quickly changing blockchain space!”\n\nButerin emphasized the importance of shared values in technological ventures, both for practical reasons and for ethical ones. “Make sure you and your co-founders are aligned on values, both in terms of what you want to achieve in the world and also what you want to get out of the project,” he said. “Consider what kind of relationship you want to have with each other, with your investors, with your users and with your community.”\n\nButerin’s talk was the finale of a four-day workshop series, “Solidity 101 Bootcamp,” sponsored by De University of Ethereum, VentureMiner and the Faculty of Mathematics. The bootcamp was billed as a comprehensive educational program designed to empower the next generation of blockchain developers.\n\n“It was such a thrill hosting Vitalik Buterin,” said Stephanie Whitney, director for Research & Innovation Partnerships in the Math Innovation Office. “The audience was blown away by how thoughtfully he outlined avenues for contributing to the blockchain ecosystem. We can’t thank him and the Ethereum Foundation enough for this amazing opportunity.”\n\nYou can learn more about Ethereum on the Ethereum Foundation website. You can learn more about the Math Innovation’s Entrepreneurship and Impact Series, including future visitors, on the Math Innovation Website."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPMjJrZDRpTDVMcmY4RHY5VXpXbDZmWm0zTkZJejJwbk13RzVMSDdCazI2WktUZnNSWEJhMnYwMWVmTlBEaE04VGdNanliWWFxdzlfaUVyX0cyZW8xMkM4a1hwZlI5STV2R0llNnhjaHYwYzNRdGdFd3RXS0ZqUFBMYTBQTWdrQXhLQ2hoeXhCdGNRaS1DdW9xV1ZDZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Goes In-Depth on Ethereum and How to Make it Stronger - Watcher Guru",
        "content": "One of the creators of the largest smart contracts blockchain, Vitalik Buterin took the stage at the Ethereum Community Conference (EthCC) to discuss the network, its strengths, weaknesses, and how to make it even better. At the Brussel’s event, Buterin noted the strides the blockchain has taken, but what work lies ahead to optimize its offerings to a growing user base.\n\nThe keynote speech, to a room of more than 1,000 onlookers, covered a variety of topics. Among them was Buterin’s concerns regarding transaction censorship. Moreover, the co-founder revealed a unique proposal to those in attendance that would have a massive impact on the overarching issue.\n\nSource – Watcher Guru\n\nAlso Read: Ethereum: Vitalik Buterin Wants to Redesign the Network\n\nButerin Talks Ethereum’s Strengths, Weaknesses, and ‘Hardening’ The Network\n\nIt's time! It's time! @VitalikButerin is speaking right now in the Gold Hall 🥳\n\n\n\nWe have a full house of eager beavers ready to hear his keynote 🦫✨\n\n\n\nIf you can't find a seat, please check out the streams in the Silver and Copper Halls 🫶 pic.twitter.com/e9xpRFy29s July 10, 2024\n\nThe network’s co-founder, Vitalik Buterin, recently spoke on Ethereum at a keynote talk. There, he expressed his belief that Ethereum thrives as a “large and reasonably decentralized staking ecosystem.”\n\nThis proved to be its greatest strength, according to Buterin. Moreover, it is supported by a growing community that is both international and highly intelligent. Yet, there is still room to make it better. The co-founder noted that solo staking is still very difficult. Currenlty, the process requires 32 ETH to become a validator, while running a node is increasingly complicated.\n\nHowever, Buterin did note that these issues, “are very addressable.” Specifically, he discussed various improvements that would allow for a simplified protocol. “So if you want a robust ecosystem, it needs to be simple,” he said. “It should not have these, like, 73 random hooks and some kind of backward compatibility,” just because it was created by Vitalik himself.\n\nSource: CoinDesk\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks\n\nHe also voiced his worry about the 51% attacks on the blockchain. However, he noted a solution isn’t all that simple. Buterin said it “depends on a lot of assumptions around coordination, ideology, and various other things, and it’s not clear how to do something like that as well in 10 years.”\n\nButerin did share a proposal with attendees. He noted the difficulty in recovering from attacks when the chain finalizes. Therefore, he proposed increasing the quorum threshold from 75% to 80% to prevent that.\n\nIn the end, the Ethereum leader noted a clear path forward for the newor. “I think there’s value in really doubling down on these strengths and at the same time, recognizing and fixing our inadequacies and making sure that we actually live up to our very high standards.”"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxPR0M2WTB5d2J0SEthNkg5Ymg3eS1vVWx5ZXlqdDN0RVdCNDI2WVZnc2Fab2ViZHFZaWhRa0JRTU9wMmlySlp4a1lrQUlJYnhDUTVRNGlyRVlCLWVGVmw5QlN0UnZhTFZCN2VVUDRvYzRwN1NSNFRoenlHRzJuajZuRm54Qkw0eVAwQVJhVUlDVE1CV0k0TzJSQ1VfZUtIN1NzX0ZVcWxOS29rVWZxcm9jeHNpNlVDZk1MTndJd19LeG1USnFGQ1hCclVsRlBMWWlPUWtEdzd3aTJMN182VHpxVy1kSmkzMFdoMU9QeklTX3NJSV84VnNhQWxpV3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrency Crash: Ethereum Down 15% This Week, MATIC Heading Towards 30 Cents, Investors Hedge With Rollblock As Price Soon To Jump - Techpoint Africa",
        "content": "With crypto markets in a serious slump the Ethereum ecosystem is grinding out new support levels. After a legendary run up from 2019-2021, the price of Ether ($ETH) has underperformed Bitcoin and most other majors. Investors are left wondering where the edge is today.\n\n\n\nL2 networks on Ethereum have led the slide downwards over the past weeks, with Polygon ($MATIC) settling last week at levels not seen since the bear market in 2022. With more losses expected in July, keen investors are turning to new protocols such as Rollblock ($RBLK) which is defying market conditions after raising more than $1Million and generating gains in excess of 55%!\n\nEthereum ($Eth) Struggles To Maintain Price Parity With Bitcoin\n\nDespite continued development of features and the switch to the ESG friendly Proof-of-Stake protocol, Ethereum ($ETH) has failed to keep pace with Bitcoin. It’s continued to underperform even with an upcoming ETF approval in the pipeline, slipping under the $3000 mark routinely over the past week.\n\n\n\nNew major networks such as Solana and The Open Network attract retail investors, while institutions continue to favor the stability and trust of the Bitcoin network. There appears to be no love for the middle as the jack-of-all trades Ethereum misses the mark with both speculators and long term capital allocation.\n\nPolygon ($Matic) Fails To Attract New Investors\n\nPolygon ($MATIC) blockchain was the first network built on top of Ethereum ($ETH). Designed to enable cheaper and faster transactions while maintaining the security of the base network, Polygon initially attracted investors looking for $ETH beta. This thesis has not played out the way they anticipated, with dozens of rollup networks now built on top of Ethereum, Polygon is struggling to remain relevant.\n\n\n\nPolygon has also failed to keep investor money on the protocol. With less than $1 billion of funds on the network after reaching a high of over $10 billion in 2021, the Polygon network appears to be largely forgotten by keen speculators. With a price of just 50 cents at the time of writing, Polygon is down over 80% from its bull market highs.\n\nRollblock ($RBLK) Soars Amid Market Declines\n\nHaving crossed the million-dollar mark in less than two months, Rollblock is becoming one of the markets most popular crypto presales. This highly lucrative project combines the best of DeFi innovations with traditional betting, offering a comprehensive experience not available elsewhere. The project uses blockchain and AI to offer greater security than traditional casinos, making it impossible to change bets once placed while recording all transactions on the blockchain.\n\nThe casino itself hosts over 150 games, including classics like roulette and slots, as well as digital games. These will soon be complemented by sports betting, which will let players place wagers on sports such as the NFL, NBA, soccer, golf, and more.\n\nTo support both users and investors, Rollblock has implemented a revenue share model that shares up to 30% of the platform's revenue with $RBLK token holders. To achieve this, Rollblock will use revenue to buy $RBLK from the open market. To create a deflationary effect, half of these tokens will be burned, and the remaining half will be allocated to staking rewards, where stakers can earn some of the highest APYs in the market.\n\nAnother key element of the Rollblock ecosystem is its ease of access. Unlike traditional casinos which require extensive background checks, Rollblock requires no KYC to get started. Instead, players can sign up using their email or cryptocurrency wallet. After signing up they can deposit over 20 major cryptocurrencies. This ease of access has sped up Rollblock adoption, with almost 5000 users signing up in Q2.\n\n\n\nRollblock is currently in the third stage of its presale, and $RBLK is selling for $0.0154. The token has already seen two price increases over the last week, and as a result thousands of investors are doubling down on what experts are calling the hottest presale of the year. As the project's momentum snowballs, analysts believe that 100x returns could be on the table.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5XbndqSXAzR1ZBXzRSSHNhTVdaNlEwVlBOOEtPcjZ2d3Z1cUNtYW5Obm81VHFvZlluM1hIMXNnVWJHNFNWUlZkM01PQnlsSkgwZVhBbU4ydzI3Vjhza1RLYkdya3BqN2RaY3pkano1Z3nSAXZBVV95cUxPSm9jT25haTd6RTZ0OWt1bTBDS3NEbmlwZUQ3Uk5mVVdIODczSDlUcnFfQV9GRTM4eFNQTnY1b2tWRDFKTHFubUo3R3JSdE5pZlJIaVVJYkxqTkJJRUFwVTE0LWJic01EMnN5aWR5S3JwRWltVnVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 03:29:03 GMT",
        "title": "Ethereum Price Sets Sights on Upside Break: Indicators Turn Green - NewsBTC",
        "content": "Ethereum price is moving higher above the $3,080 resistance zone. ETH could gain bullish momentum if there is a close above the $3,150 resistance.\n\nEthereum is slowly moving higher above the $3,050 level.\n\nThe price is trading above $3,050 and the 100-hourly Simple Moving Average.\n\nThere was a break above a short-term bullish flag with resistance near $3,090 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above the $3,150 resistance zone.\n\nEthereum Price Could Extend Gains Above $3,150\n\nEthereum price extended its recovery wave above the $3,000 resistance zone. ETH even climbed above the $3,050 resistance. There was a break above a short-term bullish flag with resistance near $3,090 on the hourly chart of ETH/USD.\n\nThe pair even spiked above the $3,110 resistance, outperforming Bitcoin. It tested the $3,150 resistance zone. A high was formed at $3,149 and the price is now consolidating gains. There was a minor decline below $3,120. The price tested the 23.6% Fib retracement level of the upward move from the $2,895 swing low to the $3,149 high.\n\nEthereum is now trading above $3,050 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $3,120 level.\n\nThe first major resistance is near the $3,150 level. The next major hurdle is near the $3,220 level. A close above the $3,220 level might send Ether toward the $3,320 resistance. The next key resistance is near $3,400. An upside break above the $3,400 resistance might send the price higher toward the $3,500 resistance zone in the coming days.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,150 resistance, it could start another decline. Initial support on the downside is near $3,080. The first major support sits near the $3,020 zone and the 50% Fib retracement level of the upward move from the $2,895 swing low to the $3,149 high.\n\nA clear move below the $3,020 support might push the price toward $2,955. Any more losses might send the price toward the $2,880 support level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,020\n\nMajor Resistance Level – $3,150"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBfU3lZeUgtS2JnU045dURBU05NSUZjRGxob1REOW1yYUZpRTFMQlFJRW5VZXlRTUp5ck54dUtxWGFVYkFnajhPZTFfWExnd0Ezb0hSYkJwVGVMYkxLbThNT25GWHprOThrYUJwQkp4VnU1bF9LV2hDd3FISmzSAYIBQVVfeXFMTVhyM0dMNE5tdno2dDdHMnlHZlZqUFV0cW1jckU0VEZjNFZkLXMyWmhGbVpzMEJ2UUpRSWljcGV4V2RJVkVZV3o0dV80VlR1a1ZaVDVRcDdCdmdFcnZHWjREMkpocHFuendVLXQ1WTdheDRacjVIR014VC1PelN1aGpHdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 20:01:51 GMT",
        "title": "Ethereum Whale Sparks Sell-Off Rumors With 11,215 ETH Coinbase Deposit - NewsBTC",
        "content": "An Ethereum whale has caused panic among community members following a recent transaction suggesting they might be looking to offload their holdings. This comes amid a recent prediction by research firm Matrixport that Ethereum’s price could significantly rebound from its current price level.\n\nEthereum Whales Transfers 11,215 ETH\n\nOnchain data shows that the Ethereum whale transferred 11,215 ETH ($34.3 million) to the crypto exchange Coinbase. A trader usually makes such a move when selling these tokens, and considering the amount of tokens involved, such a sale could significantly impact ETH’s price. However, data from the market intelligence platform IntoTheBlock shows that there might be a demand for these tokens if, indeed, this whale is looking to offload their tokens.\n\nRelated Reading\n\n83% Of All Bitcoin Holders Still In Profit Despite Drop Below $60,000 2 months ago\n\nThere has been an increase of 132% in the large holders’ netflow to exchange netflow ratio in the last seven days, which suggests that Ethereum whales are actively accumulating more ETH. The flow metrics also paint an accumulation trend among Ethereum holders, with inflow volume into exchanges down by over 11% in the last seven days.\n\nDuring this period, the outflow volume from these exchanges has increased by 3%, further confirming that Ethereum investors are looking to hold their positions and accumulate more ETH at this point. This is undoubtedly a positive development for Ethereum’s price, which could witness a significant rebound thanks to this wave of accumulation.\n\nResearch firm Matrixport also predicted that ETH’s price would rebound from its current price level thanks to the Spot Ethereum ETFs, which they claimed could launch as early as this week.\n\nWhile that remains uncertain, market experts like Bloomberg analyst James Seyffart have suggested that it shouldn’t be long before these Spot Ethereum ETFs begin trading. This is because fund issuers have implemented most of the comments that the Securities and Exchange Commission (SEC) had on their S-1 filings.\n\nETH Is Primed For A Rally\n\nCrypto analyst Leon Waidmann mentioned in an X (formerly Twitter) post that Ethereum is primed for a rally. He made this assertion based on Ethereum’s dwindling supply. He noted that 40% of Ethereum’s supply is locked up, with 28% staked and the other 12% in smart contracts and bridges.\n\nAdditionally, Waidmann expects this supply to continue to reduce once the Spot Ethereum ETFs begin trading, with institutional investors taking a huge chunk of the supply off exchanges. Based on this, Ethereum could rally on the back of the supply and demand dynamics since demand is bound to outpace supply at some point.\n\nRelated Reading\n\nBitcoin Crash: Here’s What The Data Says About Buying The Dip 2 months ago\n\nCrypto analyst Follis mentioned that Ethereum’s chart looks identical to Bitcoin’s just before it pumped over 200% last year. He suggested that the Spot Ethereum ETFs could be the catalyst that sparks a similar rally for ETH.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPeEhyWGl5Q3U3VHRSMXdTZzBjbDQ4alA1cGhueG1yMmtlMlZMOGZPTjc4dF9ZTVR0YUpFdmdaUkxaV0N1b0ZsbzF5T3lCSktfQjBPdWMtaG9qcGdJT3BCcXExX01tVXRMM3lyNVZ4M0lzdGx5N3NqZHEzdzc1TXc3Vll6bUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Rainbow chart predicts ETH price for end of 2024 - Finbold - Finance in Bold",
        "content": "After threading above the $3,000 mark for most of 2024 and even surpassing $4,000 briefly in March amid a broader cryptocurrency market surge, Ethereum (ETH) has been hit by the recent drawback as its price fell below $3,000 briefly on July 8.\n\nDespite this, ETH remains in the green so far in 2024, as it added 32.34% to its value on a year-to-date (YTD) basis.\n\nAs of July 11, the previous 24 hours have brought gains of 0.75%, which helped reverse the damaging 1.86% loss during the last week.\n\nEthereum 24-hour price chart. Source: Finbold\n\nAmid the current atmosphere of fear and unpredictability, the Ethereum Rainbow Chart, which employs a logarithmic growth curve to reflect investor sentiment across different price points, can provide essential insights into Ethereum’s potential future movements in the crypto market.\n\nThe 2024 Ethereum Rainbow chart\n\nThe Ethereum Rainbow Chart consists of nine distinct color-coded zones, each symbolizing a specific price range and the corresponding market sentiment. These zones range from “Fire Sale,” indicating extreme bearish sentiment at the lowest prices, to “Maximum Bubble Territory,” suggesting that the cryptocurrency’s price has soared to unsustainable levels and is likely to drop.\n\nCurrently, ETH is in the “Steady” zone, which can best be described as a neutral zone where neither buying nor selling pressure dominates the sentiment. Traders’ best move is to wait and see in which direction the price moves on the chart.\n\nEthereum Rainbow chart. Source: BlockchainCenter\n\nEthereum Rainbow chart predicts its price for end of 2024\n\nThe Rainbow Chart illustrates Ethereum’s historical performance within the context of market sentiment and provides some foresight into the potential future prices of the world’s second-largest cryptocurrency.\n\nIf ETH drops below $1,037.78 by late December, the current bull market is ending and a crypto winter is approaching. Conversely, trading above $8,930.22 would indicate that Ethereum is entering bubble territory, with consistent closes above $12,791.09 almost confirming an impending major correction.\n\nEthereum Rainbow chart for the end of 2024. Source: BlockchainCenter\n\nThe Rainbow Chart also shows that ETH would be most stable at the end of 2024 if it remains within the $2,915.49 to $4,210.36 range, known as the ‘HODL’ zone. It would still be relatively stable between $4,210.36 and $6,124.88, the ‘Is this the Flippening?’ range, though investors should remain cautious.\n\nAdditionally, the tool suggests that late 2024 would be a good time to buy Ethereum if it trades between $1,442.45 and $2,039.02, labeled as the ‘Accumulate’ zone. Prices up to $2,915.49 are also considered relatively inexpensive.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBOVmZEMHBkRWw5N3dMOW1JNnQ3V3ZCbGNTdWxUVUhUMVVLSm5EOU53eDU1dVE3WXUwbk5XeWpJZHNwYTRaS0xPWHZMNUpsdV9xNkdsYW56dHpvSlUxVGdqTUI5TnpRVXVJcnhfQUlTRXNXZzVkckdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction July 2024 - Is ETH About to EXPLODE? Buy Before It's Too Late! - Coinfomania",
        "content": "Different predictions on the future price trajectory of Ethereum (ETH) have been triggered by the upcoming launch of spot Ethereum ETFs.\n\nOf these forecasts, one that stands out the most is that ETH might replicate the remarkable gains that Bitcoin (BTC) made between 2023 and 2024. Bitcoin increased from $26,000 to an all-time high of $73,750 over that time.\n\nEthereum ETF Could Ignite Another Bull Run, Analyst Predicts\n\nAn anonymous analyst on X Follis stated that the expected Ethereum ETF might cause ETH’s price to move like BTC has in the past, with a possible 200% rise. Ethereum is now priced at $3,130, but the analyst predicts that price will grow to $9,324 by the end of the year.\n\nDemand would need to rise significantly in order for such a price hike to occur. The first signs of this increased interest were when ETH whales moved a sizable amount of money, as reported by Spot On Chain.\n\nEveryone focussed on Germany and Mt Gox\n\n\n\nMeanwhile the Ethereum ETF is about to launch and the $ETH chart looks identical to $BTC before it pumped +200% last year\n\n\n\nStudy ETF rallies pic.twitter.com/VWENNnO8dN — フ ォ リ ス (SG 🇸🇬) (@follis_) July 9, 2024\n\nA whale was observed to have taken out $50.30 million worth of ETH early on July 10, which was the first significant build-up since the Ethereum ETF started to garner more attention.\n\nThe recent events, in which a whale sold $12 million worth of Ethereum, stand in stark contrast to this claim. This change in behavior among Ethereum whales—from spreading their holdings to making bulk purchases—is corroborated by other Glassnode data.\n\nThis is demonstrated by the rise in addresses with $1 million or more in Ethereum valued at the time of reporting, from 14,217 on July 7 to 14,823 at that time. This suggests that there is increased demand for Ethereum and hope for the approval of the spot ETF.\n\nIn contrast to Bitcoin, Ethereum has experienced a more severe price correction. The price of ETH dropped by 24.65% between May 28 and July 9, while the price of Bitcoin dropped by a smaller amount, 19.43%.\n\nIn spite of this, according to market valuation, Bitcoin is still the most valuable cryptocurrency and is still outperforming Ethereum according to bullish signals.\n\nCautious Optimism\n\nHowever, historically, ETH’s more severe price drops have presented chances for large rebounds. A double bottom formation is currently visible on the daily ETH/USD chart, indicating a possible bullish reversal.\n\nTwo low points that are located close to the same price level and suggest a stabilization and possible upward trajectory help to identify this formation.\n\nThe last time such a pattern appeared on the Ethereum chart was in January 2024. After that, the price of ETH increased by 81.94%, reaching $4,067 by April.\n\nIf past events are repeated in a comparable manner, Ethereum’s price may reach $5,625 by the end of September. Nevertheless, Ethereum’s near-term outlook is still positive, provided that bulls can hold into their $2,934 support level.\n\nIs ETH About to EXPLODE? There could be Potential for a Bitcoin-Like Rally\n\nAnalysts are optimistic about Ethereum’s future, with some forecasting a rise similar to Bitcoin due to the impending introduction of spot Ethereum ETFs. The likelihood of more demand—especially in light of recent whale activity—fuels the possibility of a price spike.\n\nSource: Glassnode\n\nEthereum’s price adjustment is more noticeable than Bitcoin’s, but there appears to be a growing interest for the cryptocurrency based on the change from whale selling to accumulation and the rise in high-net-worth Ethereum holdings.\n\nShould the expected flood of institutional capital via ETFs come to pass, ETH may see a price increase like to that of Bitcoin during its 2023–2024 surge."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQajNzYkJjOGVJMG9fdmhzYndrLWpzZUR1VmkyU2N5VnBlMnhETWhFYmNxenA2MEZPNnFOWU4yWUNEa1NVYjkwczB1SFR1bzFyVFIwTEZkMXRFTFNYR0F5M2dRV25HdGJxLVdYMHpNYXU5d3A3X1FPSHpCZkFuM05nZFdQZDRaRHpOUFNyWlJCRjlrVXNu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Tron Founder Bets Large on Ethereum ETF, Splashes $5 Million on ETH - Coinfomania",
        "content": "Last year was an interesting one for smart contract platforms as the stiff competition continues in the DApp market, with the total on-chain transactions hitting $23 billion.\n\nWhile the Ethereum continues to hold its position as the market leader, possibly because of its first-mover advantage, the 2019 annual report published by DappReview, a DApp data tracking platform, shows that TRON blockchain dethroned EOS as the second most popular blockchains for DApps.\n\nTRON: Las Vegas on the blockchain\n\nIn 2018, EOS was ranked as the second blockchain after Ethereum in terms of DApp users and transaction volume. EOS recorded a total volume of $3.5 billion in DApp transactions, the largest in the smart contract market in 2018.\n\nHowever, the table turned in 2019 as TRON blockchain gained a total transaction value of $4.4 billion to outperform EOS, IOST, STEEM, NEO, ONT, LOOM, TOMO, WICC, WAVES, and WAX, according to the report.\n\nDappReview, which described the TRON Dapp ecosystem in 2019 as “Las Vegas on the blockchain,” noted that 8 out of TRON’s top 10 apps are mainly Casino DApps. The Casino DApps contributed about $3.9 billion to the total transaction value.\n\nCasino DApps accounted for 60.81% of daily active users on TRON blockchain. The user number for exchange DApps accounted for 10.93%, while game DApps has only 11.36% of all the users. Casino DApps further dominated TRON transaction volume on a 90.39% count, while the exchanges accounted for 8.27%.\n\nA tough year for EOS\n\nOn the side of EOS, which experienced many difficulties at the end of the year, Casino and Other DApps played well. They accounted for 40% of the total users in the first half of 2019, not until EIDOS was launched in November. Many believed it led to the prohibitive cost of resources and other controversies that nearly paralyzed the entire EOS ecosystem.\n\nEIDOS was released as a smart airdrop contract, distributing tokens to users who sent any amount of EOS to the contract, with 0.0001 EOS as the minimum amount. In this course, many users initiate several transactions to earn the EIDOS tokens almost for free.\n\nTechnically, an average of 1.69 million transactions was sent to the contract every day, thereby leading to the rise in the price of EOS mainnet resources. An average user now has to stake 30 EOS to get network resources to initiate a simple token transfer, an irony for an ecosystem that once promoted itself as a zero-fee dApp platform.\n\nThe EOS mainnet congestion affected users playing Other DApps, which led to the decline of users for the two categories of DApps; Casino and Other DApps.\n\nEthereum maintains global dapp leader\n\nEthereum has maintained the leading position in the game of smart contracts; perhaps it has remained the first choice and the most preferred platform for developers. The report shows that 1,223 Ethereum DApps were still active at the end of 2019.\n\nGame DApps dominates the Ethereum platform by 46.5%, followed by Decentralized Exchange (DEX) by 20.9%. Despite having the highest percentage of DApps, Game DApps have the lowest transaction volume than others from an estimated DApp transaction volume of $12.8 billion on the Ethereum blockchain.\n\nExchange DApps account for 61.05% of the transaction volume, while Finance DApps holds 29.98%. The reason could be related to the fact that most transactions in the Game may not involve token or asset transfers. Also, many game assets are exchanged in the form of NFT, which usually trades on NFT exchanges.\n\nThe report today not only provides insight into the usage of public chains, but it is also confirmed the massive adoption of blockchain in 2019."
    }
]