[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNaE01dExmY0NITGFwRnc3R2hwUUV4TTdCbWlIRVpjR1FNZks3cnpxUzdJMnh1SWFFSnl1LTF3MUtfNnVwX3VXd0lSR2JUdW9hV3VZREhRUWZYbU5CMlJieVk4ZWtoWVZWcnFBNER1Tk8ySk5kVlZadlpCVFYwWl9vaF8yQWlGdDZqVmVvMk1ncWVXVGJSZFVTS01EUGY2U01RZWptSkdsZWhUZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Why (Almost) Everyone in Ethereum Is So Excited About a Wallet-Related Proposal - Unchained",
        "content": "While EIP-3074 offers a potential leap in the Ethereum wallet user experience by enabling batch transactions and smart contract-like features, some experts have concerns about its security and long-term impact.\n\nEthereum Improvement Proposal (EIP) 3074 will go live during Ethereum’s next hard fork, dubbed ‘Pectra,’ and many in the Ethereum community are very excited that it’s finally coming to fruition.\n\nInitially proposed by Ethereum researchers Sam Wilson, Ansgar Dietrichs, Matt Garnett, and Micah Zoltu in October 2020, EIP-3074 will be included in the next fork, as decided on Thursday on Ethereum All Core Developers call, and is designed to improve Ethereum wallet usability. It proposes a new set of code changes that would allow users to batch multiple transactions together and confirm them in a single action, unlike now where users usually have to sign at least two transactions to, for example, swap an asset on a decentralized exchange.\n\n“This is a big deal. Wallet [user experience] will 10x,” wrote Georgios Konstantopoulos, research partner at crypto VC Paradigm, on X.\n\nEIP-3074 suggests a novel way to extend the functionalities of externally owned accounts (EOAs) by delegating control to a smart contract. This method allows users to enjoy some of the advantages of smart contract wallets while keeping the straightforward approach of EOAs. Unlike account abstraction (ERC-4337), which focuses on transaction sponsoring and relaying, EIP-3074 lays the foundation for these new features to be possibly added in future proposals.\n\nBy enabling EOAs to interact like smart contract wallets, EIP-3074 could redefine how wallets operate, easing the transition to advanced wallet systems without requiring users to undertake complex migrations. “This is huge, because it allows EOAs to be magically converted to Smart Accounts,” wrote Ivo Georgiev, CEO of Ambire, on social media.\n\nLearn more: What Are Externally Owned Accounts (EOAs) in Ethereum?\n\nThe proposal also aligns with the broader goal of ensuring a smoother user experience across multiple EVM-compatible chains, maintaining consistency as users navigate different platforms.\n\nThe community’s support for EIP-3074 reflects its potential to simplify transaction processes and enhance the Ethereum network’s usability, making it a significant upgrade anticipated by both developers and users alike. Hayden Adams, founder of prominent DEX Uniswap, posted on X: “EIP-3074 inclusion will be a monumental upgrade to Ethereum UX.”\n\nMeanwhile, Dan Finlay, MetaMask’s cofounder, said: “3074 couldn’t come at a better time: There’s momentum to define an onchain permissions system for smart contract accounts, and 3074 can allow EOAs to still enjoy some of its benefits.”\n\nNot Everyone Agrees\n\nWhile there is significant excitement around EIP-3074, not everyone in the Ethereum community is equally enthusiastic.\n\nMartin Köppelmann from Gnosis voiced his concerns, saying that the EIP “brings us in a weird state with EOAs getting some of the benefits but not all, such as no option for key rotation.” He explained that instead of moving towards a unified and improved future, EIP-3074 could solidify the division between two different types of wallet technologies—smart contracts and traditional EOAs.\n\nMoreover, Köppelmann criticized its revocation capabilities, arguing that they provide only a “fake sense of security.” He wrote: “After 3074, an EOA will always have the danger that signing one wrong message can mean you lose anything this account controls.”\n\nKöppelmann’s criticism was echoed by 0xngmi from DefiLlama, who pointed out that with EIP-3074, “it’ll be possible to fully drain an address (all tokens, all nfts, all defi positions…) with only one bad signature.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNUFZQc1M4Qi1TMTBnYWNFVURZbmpmZC15R2NPR3ZOTFY0Ul9CQnp6a1ZJTVM4TXlscURUdDlCQ05pdU9BcUk5SWphVll0MmJHMDVJZGtDQWwxWEpvR2UxamxNVWc3c2JYRlM5Z0tCU2FCTEdqNnlkUUdxMmQ2U0pWRFRxZE51R2VqYTJKU2pnempiUzN2VjBHMGZvejlydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "This $104M Signal saw Ethereum Price outperform BTC, SOL -What Next? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFA5QXVJTkFibEJFTldWZ3E1bHpBc0VyUTdHOEtyMW5naTZuejZkQWZrRDFCdG5CUDNzUnZid2ZYcVREQTU2WjdvejBWZW0wY1ZVNnJsa1EyUi1fZE9sOTU3Y3F5ejh3MzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum spot ETFs may hit Hong Kong markets as early as Monday: Bloomberg - Crypto Briefing",
        "content": "Mainland China's investors may soon channel billions into Hong Kong's crypto ETFs.\n\nShare this article\n\nMajor Chinese asset managers are on the brink of launching spot Bitcoin and Ethereum exchange-traded funds (ETFs) in Hong Kong, possibly as early as Monday, Bloomberg reported on Friday, citing anonymous sources familiar with the matter. The timeline, however, remains tentative, sources noted.\n\nHarvest Fund Management Co.’s international division and a joint venture between Bosera Asset Management (International) Co. and HashKey Capital are the two potential ETF issuers, Bloomberg’s sources said.\n\nAs noted, the two entities plan to roll out their ETFs by the end of the month, pending approval from the Securities and Futures Commission (SFC) and finalizing listing arrangements with Hong Kong Exchanges & Clearing Ltd.\n\nThe report follows news earlier this week that prominent Chinese asset managers have applied for spot Bitcoin ETFs through their Hong Kong subsidiaries. According to Bloomberg, on April 9, SFC granted Harvest and China Asset Management clearance to provide virtual-asset-related fund management services.\n\nHong Kong Bitcoin ETFs poised to attract $25 billion\n\nThe potential approval of Hong Kong-listed spot Bitcoin ETFs could unlock up to $25 billion in demand from mainland China as qualified Chinese investors may be allowed to access the funds through the Southbound Stock Connect program, said Matrixport in a Friday report.\n\n“A likely approval of Hong Kong-listed Bitcoin Spot ETFs could attract several billion dollars of capital as mainland investors take advantage of the Southbound Stock Connect program, which facilitates up to 500 billion RMB (HK$540 billion and $70 billion) per year in transactions,” said Matrixport. “Based on the (potential) available capacity, this might result in up to 200 billion Hong Kong dollars of available capacity for those HK Bitcoin ETFs—or US$25 billion.”\n\nThe Southbound Stock Connect program sets a yearly limit of HK$540 billion for Chinese investment in Hong Kong-listed stocks. However, 360MarketIQ’s data shows the quota hasn’t been fully used in the past three years, leaving around HK$100-200 billion annually unused capacity.\n\nMatrixport suggested that this unused quota could be directed towards the Bitcoin ETF if approved.\n\nAfter the debut of US spot Bitcoin ETFs, global investors have seen Hong Kong as the next hub for crypto ETFs due to the country’s regulatory environment.\n\nIn late December last year, the SFC and the Hong Kong Monetary Authority (HKMA) issued new rules addressing the possibility of investment funds, brokerages, and asset managers offering crypto ETFs. The move was seen as preparation for upcoming crypto ETF products."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNSTI1ODN5WWpGUVdZWDg4eC0yQ3ExcC1JU3BmSUJDQmZIcldTVlgxX1lwcUJWSW5TUzRYbGUxc2RLY0tmczNMckRYMG9GWGZlN0V5X3FmZmxXWDVxOTVzSjRlRHVVWE5OaTU4aE9PTVNDMkltZm5pT3lBcHlRNkN5aVB6emdIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum startup Aligned Layer nabs $2.6m in venture capital - crypto.news",
        "content": "Aligned Layer, a startup touted as a “universal verification layer for Ethereum,” confirmed Sunday, April 14, that it raised $2.6 million in seed funding.\n\nLemniscap, a seven-year-old firm that has backed multiple companies in the crypto blockchain space, led the effort. The firm previously led the $2.4-million funding round for web3 startup Safary in January.\n\nBankless Ventures and Paper Ventures are also backing Aligned Layer, along with StarkWare, O(1)Labs and Ingonyama CEO Omer Shlomovits.\n\nAligned Layer announced the capital raise via social media. See below.\n\n1. We're excited to announce that we've raised $2.6M in our Seed Round, led by @Lemniscap , to enable developers to access affordable and fast proof verification for all proof systems.\n\n\n\nAligned Layer helps Ethereum become a better, faster and cheaper settlement layer for validity… pic.twitter.com/pFCOFRAh8R — Aligned Layer (@alignedlayer) April 14, 2024\n\nAligned Layer is touted as the first decentralized ZK Proof verification layer for Ethereum. It’s also powered by Eigen Layer — a restaking mechanism that allows ETH stakers to reallocate their staked ETH and Liquid Staking Tokens (LSTs) to improve security for other protocols.\n\nYou might also like: Blockchain fraud group strikes again, launches fresh scheme on Blast network\n\nAligned Layer goals\n\nThe company will put the proceeds of the capital raise toward expanding its operations and accelerating Aligned Layer’s mainnet launch, scheduled for the second quarter of 2024.\n\nAs an infrastructure provider, Aligned Layer aims to lower costs and improve speeds for developers that are building applications like L2s, or layer-2 networks.\n\n“Today’s announcement is a testament to our team’s shared dedication to making Ethereum the most cost-effective and efficient platform for ZK verification by using Eigen Layer,” Aligned Layer co-founder Roberto José Catalán said in a prepared statement.\n\nThe seed round also included participation from several angel investors, including Sreeram Kannan, Brandon Kase, Daniel Lubarov, DCbuilder, Chainyoda, Weikeng Chen, Sam Benyakoub, Lucas Kozinski and Peter Fittin (SizeChad). See below.\n\nhttps://twitter.com/SizeChad/status/1779570022664245589\n\n“At Aligned Layer, we firmly believe that developers should be able to use the proof system that best suits their needs, without being constrained by the settlement layer,” Catalán added.\n\nThe funds are expected to give the company enough runway to execute near-term goals.\n\nThe Aligned Layer funding comes on the heels of a busy week for crypto venture capitalists. New York-based Monad Labs, for example, scored $225 million in funding as part of a round led by Paradigm. Monad is a layer-1 blockchain compatible with the Ethereum Virtual Machine but can process transactions using the same set of rules faster.\n\nThere was also Bitcoin layer-2 network Mezo. The startup raised $21 million in a Pantera-led funding round.\n\nDuring the first three months of 2024, global investors put $2.5 billion into crypto-related startups, according to PitchBook.\n\nHowever, investors don’t appear to be warming up to blockchain-related gaming companies. According to data from DappRadar, the sector secured $288 million in funding for the first quarter of 2024. That’s a 57% decrease compared to the previous three-month period."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSUlEYm1uT3VMdS1TZGFmcFQxajJmbUxhcnNqN3dFTHlqTzBJYTFBNmhoTDN4OUFJNGpPcWFpaDJrN3FwUFVDMHNVQ2hEMGp2Ti1saWVqZjN0Q0J0Rno1OVdFV0VsTTZWRzFvYmZEeWxMNTF6U0ZxeFBJWnlLOE01bTZTOG5oQmhzMnBBVdIBkgFBVV95cUxOOXBKVGJ6c2N1UmdoR2lldUJ0SXBoMXgzVndkdHU4S2xaazcxTDBfMkctcGJ4ODhaV0hPQXFwLTUtdnFiYTRhd0FWeEVtVktNYXBRUDJ5YXkyT1o0MUVaQ0dHZXVmRHR4VWpzLWphZkU0M2dRWW1SSTlzRDZfUERkMEkzRjd0VU1KYV9MNzk5bDVCZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Here’s How Much Bitcoin and Ethereum the US Govt Holds: Data - CryptoPotato",
        "content": "Over the past decade or so, countries around the world have resorted to seizing cryptocurrencies. The United States government stands at the forefront, boasting crypto holdings of almost $15.27 billion.\n\nThis substantial stash includes 212.847k BTC and 45.654k ETH.\n\nUS Leads with Holdings of $15.27B\n\nSilk Road is perhaps the most infamous case where the US government seized approximately 144,336 BTC in 2013. Silk Road was an online black market known for facilitating the sale of drugs and other illegal goods using Bitcoin.\n\nAnother popular darknet marketplace called AlphaBay was targeted by the US authorities in 2017. While the exact amount of seized cryptocurrencies is not known, it was previously reported that the stash included Bitcoin, Ethereum, and Monero, among other tokens.\n\nThree years later, the US Department of Justice seized approximately $3.6 million worth of Bitcoin as part of an investigation into alleged money laundering and fraud involving the cryptocurrency exchange Bitfinex and its affiliated stablecoin issuer, Tether.\n\nFollowing closely behind the US is the British government, which holds 61.245k BTC, valued at around $4.34 billion, according to the data compiled by Arkham Intelligence.\n\nMeanwhile, the German government currently possesses 49.859k BTC, with an approximate value of $3.53 billion.\n\nNotably, the Salvadoran government has emerged as an active participant, with holdings of 5.718k BTC, valued at approximately $405 million, largely attributed to proactive purchases.\n\nCrypto Seizure\n\nThe majority of these countries’ crypto assets stem from confiscation for several reasons. This includes criminal investigations during which cryptocurrencies are used in illicit activities such as money laundering, drug trafficking, terrorism financing, and cybercrime. Law enforcement agencies seize crypto assets as part of investigations to disrupt criminal operations and hold perpetrators accountable.\n\nGovernments may seize cryptocurrencies from individuals or businesses suspected of evading taxes by not reporting crypto-related income or transactions. Seizures serve as a means to enforce tax compliance and ensure that taxpayers fulfill their obligations.\n\nAdditionally, cryptocurrency exchanges and other platforms may be subject to regulations related to anti-money laundering (AML) and know-your-customer (KYC) requirements. Seizures may occur when entities fail to comply with these regulations or engage in fraudulent activities."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTFAyS2N1R1Z4TnlvSzlIdlhpTVNkaEwzRlA1SnRMTG9Ra1BiYTVjRGJ4S2twZWcwQURudmZ2RE1iY2lpV3FLSmdtZjlHT3dpWHRpU1VSZ2s1Yk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Crypto hack 2024: Ethereum is the most hacked chain to dateCrypto hack 2024: - The Cryptonomist",
        "content": "For the “crypto hack 2024” column, it seems that Ethereum is the most violated chain so far, with 33 hacking incidents, scams, and more. Currently, the estimated total losses amount to 437 million dollars.\n\nCrypto hack 2024: the most targeted blockchain at the moment is Ethereum with 33 incidents\n\nAccording to a research conducted by experts from Smart Betting Guide on crypto hack 2024, it seems that Ethereum is the blockchain most targeted by scams and hacker attacks.\n\nAnd in fact, Ethereum seems to already have 33 incidents. Following that, there is BNB Chain with 14 incidents, Arbitrum with 6, Solana and Bitcoin both with 2 attacks each.\n\nIn general, experts also point out that the most vulnerable crypto sector for this 2024 remains DeFi, due to all the incidents that have occurred.\n\nAnyway, making an estimate on the total, Smart Betting Guide reveals that this year’s crypto hacks have already caused losses of over 437 million dollars.\n\n“Crypto hack 2024”: Ethereum and DeFi remain the most vulnerable\n\nLast month, even MarketWaves analyzed reports on crypto hacks in the DeFi and Web3 world, sharing the De.Fi REKT report.\n\nAnd in fact, the latter had reported that the losses for the month of February 2024 alone were already 82 million dollars.\n\nBasically, during the month in question, the DeFi sector would have experienced a significant increase in security-related incidents. Specifically, the total lost due to various exploits on different chains and platforms was $82,287,101.\n\nHowever, it seems that efforts to mitigate these losses have led to the recovery of $1,325,932, highlighting the ongoing battle between hacking and security in the crypto sector.\n\nOnly in the month of February 2024, there have been several significant events with the platforms PlayDapp, Fixed Float, and Jeffrey Zirlin among the most affected.\n\nSome tips on how to keep your crypto safe\n\nExperts from Smart Betting Guide, in light of the already significant presence of crypto hacks in this 2024, wanted to share a guide on how to keep your crypto safe.\n\nFirst of all, the most useful advice of all, concerns the storage of the password and seed phrase of the various crypto wallets or exchanges where you hold your cryptocurrencies, which should absolutely not be stored on the Cloud.\n\nDespite the convenience, the Cloud could be violated, therefore the best way is to save them in writing or have them engraved on a metal card (to protect them from water damage or fire) to be kept in a safe place.\n\nGoing forward, Smart Betting Guide recommends not using exchanges but hardware wallets to store your crypto in a safer way.\n\nIt is important to always stay updated through DYOR – Do Your Own Research (Do your own research). In fact, it is only in this way that you can understand any crypto hack techniques such as rug pull, before falling into the scam.\n\nNot only, for the experts at Smart Betting Guide, when you want to invest in new blockchains or crypto projects, users should consider who the team and developers are, read and verify the quality of the Whitepaper.\n\nIn DeFi, it is also important to verify that the new project has a Total Value Locked (TVL) and that this value should be between 80% and 100%, as well as complying with standard practices of external audit."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQWZ5aDVUYU5XZ2ZvQ3RqcG8wS01XTE83dzdFcHY5aGJFWWtlcWFTREV2QTZqUTJtdlBhN2U4bWp4NklybEM4ZXNUazI2aW9LSmpzVnJmSjFpbHF3Z250V1BwUm1jQ0NRUlY5UHd0YjU3XzJtYWVJRHROYmlINXh6NW8yTGRIUdIBiwFBVV95cUxQZVdwRGlUeW5XeEFQVEpzTnJzb0ZuUzdTdkc1aGt1R2NvSGhsY0ZVeGI0RFY3b0VVTTYtbEhBQnBfY1J1VDZJcUpxNW5jYndlLVNiY25nWVV6MFJNdVJ5WWhnTHh5eVlmRWE5Uk1ZVDNJSDNPVXVENk9NQURXdERQQ3BmZGhFX3J4d3RV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Crash: Whales Dive In as $3,000 Support Falters - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs Ethereum, the second largest cryptocurrency by market capitalization, experienced a rapid price decrease, a fascinating development emerged: Ethereum whales began to accumulate massive amounts of ETH, showcasing a strategic play in the face of uncertainty.\n\nAdvertisement\n\nThe term \"whale\" is used to describe individuals or entities that hold a significant amount of a cryptocurrency, and their recent action in the wake of a broader market downturn has prompted attention and speculation across the crypto community.\n\nAs the Ethereum price sharply fell to lows of $2,850 on April 13, on-chain data captured a strategic accumulation made by an ETH whale or large holder.\n\nAccording to Spot On Chain, the Ethereum Whale \"0x435\" spent 70 million USDC to buy 23,790 ETH as Ethereum fell to nearly $2,942.\n\nDespite the recent 8% correction in the $ETH price (24H), whales are still buying $ETH!\n\n\n\n1. Whale 0x435 spent 70M$ USDC to buy 23,790 $ETH at ~$2,942 4 hours ago:\n\n\n\n• In total, the whale has accumulated 60,808 $ETH ($191M) from #Binance and DEX in the past 15 hours, after each… pic.twitter.com/ujZRULGAkX — Spot On Chain (@spotonchain) April 14, 2024\n\nBased on data from on-chain sources, the whale's buying frenzy began days ago, when the ETH price began to plummet, and included withdrawals from Binance and decentralized exchanges.\n\nOn-chain analytics firm Lookonchain reports one of the said whale transactions, which involved a withdrawal of 37,018 ETH worth $120.7 million from Binance.\n\nThe said whale has accumulated 60,808 ETH worth $191 million from Binance and DEX following each sharp drop in the last 24 hours and has withdrawn 62,141 ETH worth $202.6 million from Binance in the past five days.\n\nCurrently, the whale has 85,931 ETH worth $278 million, as well as $136 million in USDT and USDC stablecoins in Aave.\n\nThe whale's actions coincided with a broader trend of Ethereum accumulation by large holders. Another mysterious whale, a fresh wallet tagged as \"0xE347,\" was said to have withdrawn 7,300 ETH worth $23.8 million from Binance and transferred it to Pendle Finance. A cVault.finance deployer paid 6 million DAI to buy 2,018 ETH for almost $2,973, according to Spot On Chain.\n\nAt the time of writing, ETH was down 6.05% in the last 24 hours to $3,060, up from intraday lows of $2,911, mirroring the broader crypto market crash. Ethereum declined for three days in a row from highs of $3,617 to lows of $2,850 on April 13 before slightly recovering."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1oLXY5RERETGluY3FYWXNyaTNMV3ZoQlRQUnZFY0hvOU1oTjFSM1U4MWZiOTV4cTIyempXV2lPV09KaHNmaFdxTXd0N3YwNHBGREJkbWRDVTdnRDFmcVkweVVCd2REOHhSNXpBY20tX1hUcWI0X19iMENR0gF_QVVfeXFMTkZ1WDVTZGFNU3pFeWNQMVlSWk5seVh4a2pFTW0yVktPY3REZ2lLeUdUbzByWlhLckhFbUptdVFPc2Zqd1kzUlBpZXlvME5VLUlmTGgzYlZrNnlTX0NaOTFiVXpJeDZmZzVEbDNZa2VuNGJPTy1xbFBUdC1NZk83VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum rises 7%: Can whales push ETH’s price to $4K now? - AMBCrypto News",
        "content": "ETH was up by nearly 7% in the last seven days.\n\nWhales have increased their accumulation over the past week.\n\nEthereum’s [ETH] price rallied last week, allowing it to sit comfortably above the $3.5k mark. Though this already looked optimistic, things might get even better as the big players stockpile more ETH.\n\nWhale activity is rising\n\nAccording to CoinMarketCap’s data, ETH investors earned profits last week as its value surged by nearly 7%. At the time of writing, ETH was trading at $3,520.80 with a market capitalization of over $422 billion.\n\nInterestingly, while the token’s price increased, whale activity around the token also increased.\n\nLookonchain’s recent tweet revealed that whales have started to accumulate ETH. As per the tweet, a whale withdrew 22,251 ETH, worth $80.06 million, from exchanges.\n\nAnother whale also withdrew 3,092 ETH, which was worth $11.12 million from Binance. This suggested that whales were confident in ETH and expected its price to rise further, hinting that ETH might soon reach $4k.\n\nTo see whether buying pressure from whales was high, AMBCrypto took a look at Santiment’s data. We found that ETH’s supply held by its top addresses increased over the last week. Its exchange outflow also spiked, signaling a rise in buying pressure.\n\nOur analysis of CryptoQuant’s data also showed a similar trend. Ethereum’s exchange reserve was dropping. However, it was surprising to see that ETH’s Coinbase Premium turned red. This meant that selling sentiment was dominant among US investors.\n\nEthereum’s next target: $4k?\n\nAMBCrypto then checked Hyblock Capital’s data to find the possible targets ETH might reach if whale accumulation translates into a bull rally.\n\nWe found that before hitting $4k, ETH has to go above a few key resistance levels. If a bull rally happens, it will be important for ETH to reach $3.65k and $3.8k before touching $4k, as ETH’s liquidations will increase at those levels.\n\nTo see how likely it is for Ethereum to begin a bull rally, we then analyzed the token’s daily chart. Our analysis revealed that Ethereum’s Relative Strength Index (RSI) has been moving sideways for multiple days in a row.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, its MACD displayed that the bulls and the bears were in a tussle to gain an advantage over each other. However, the Chaikin Money Flow (CMF) looked bullish as it registered a sharp uptick.\n\nIf the CMF is to be believed, the chances of ETH gaining bullish momentum seem likely in the coming days.\n\n\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5uR2c5d05FNGpaTUFVRmx5b2t6cTZDSmo2VEkteVJDZlhkZVI0dTFvZ0l4WkNwUFRBUWVJVVhXSDZDRE0wS0UtLTN2bWxKUXR6ZGNWZjIySzhzdkhCNWxMYWZmdGc4eFNVWU85YVgwRHp6Tkpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Cronos (CRO): Overview and Examples in Cryptocurrency - Investopedia",
        "content": "What Is Cronos (CRO)?\n\nCronos (CRO) is the cryptocurrency token for a blockchain developed and run by the cryptocurrency exchange Crypto.com. The Cronos network is designed to be a high-performance, interoperable blockchain that can support decentralized applications (dApps) and apps without central intermediaries, which tend to run on a variety of Ethereum-based blockchain spinoffs.\n\nKey Takeaways Cronos is a blockchain with a native token CRO, designed as a nexus for decentralized finance (DeFi), non-fungible token (NFT), and metaverse projects in the decentralized application (dApp) ecosystem.\n\nCronos's interoperability can connect it to the Ethereum and Cosmos blockchains behind many dApps.\n\nCrypto.com offers a variety of benefits for holding and using CRO, including lower trading fees, staking rewards, exclusive access to products and features, and more.\n\nHistory of Cronos and CRO\n\nCronos is an open-source blockchain and token that was launched in November 2021 by Crypto.com, one of the world's largest cryptocurrency exchanges, to support a growing demand for dApps in the decentralized finance (DeFi), non-fungible token (NFTs), and metaverse space. Because most of these dApps overwhelmingly run on disparate derivatives of Ethereum, a blockchain was needed to bridge them together and process the high volume of transactions that would result from such cross-integration.\n\n\n\nCronos stepped in to address Ethereum's dApp and scalability limitations with interoperability frameworks and consensus engines that allow multiple blockchains to connect and exchange assets and data at significant loads without the need for intermediaries. Cronos is claimed to have the ability to process over 10,000 transactions per second (TPS), which is significantly higher than Ethereum's TPS, which averages about 13.\n\nIn addition to being able to connect multiple dApps at the same time, Cronos allows developers to create and host dApps from different blockchains. Cronos's interoperability standards allow the network to run smart contracts from various Ethereum-like blockchains with little to no modifications. Smart contracts are self-executing programs that can be used to automate various actions on a blockchain and do things other than simply transfer a cryptocurrency.\n\nCronos vs. Other Popular Blockchains\n\nOne of the most significant differences between Cronos and popular blockchains like Ethereum and Bitcoin is that it uses proof-of-authority (PoA) consensus and validation rather than proof-of-work or proof-of-stake.\n\nValidators are chosen by invitation only, with developers occasionally opening periods for accepting applications. Cronos' PoA uses 24 hand-picked validators to verify transactions and open new blocks, giving the consensus mechanism \"authority\" because the chosen validators have been vetted and are trusted.\n\nThis is a stark contrast to other chains that use systems of anonymous validators. Cronos is thus a hybrid of public and private blockchains, a decentralized private blockchain that is open to the public for use.\n\nTypes of Apps That Use Cronos\n\nFive billion CRO, a significant portion amounting to around 17% of the total CRO supply, was allocated to Crypto.com and its affiliates, including the Crypto.com team, advisors, and reserves for future development. Pre-allocated tokens can concentrate power and decision-making in the hands of a few and give insiders an advantage over public participants. For example, pre-mined tokens dumped on the market can negatively crash the token price and discourage later investors.\n\n\n\nCRO Token's Role in Cronos\n\nMuch like the ether (ETH) token for the Ethereum blockchain, the CRO token plays a crucial role in the Cronos blockchain ecosystem as a native utility token driving various aspects of its functionality. CRO is used for transactions, staking, and governance, incentivizing users to hold and participate in the network. Demand for CRO as a utility token fuels its liquidity and contributes to the stability of the Cronos ecosystem, creating a positive feedback loop.\n\nCRO is the primary currency used for paying transaction fees on the Cronos network and facilitating seamless asset transfers between Cronos dApps without having to swap into multiple tokens. Every interaction with the Cronos blockchain requires users to spend a small amount of CRO to promote responsible network usage and prevent spam.\n\nCRO holders can participate in staking, where they lock their tokens to a whitelisted validator for a specified period to support the network's security, stability, and decentralization, deterring the blockchain from threats. In return, they earn rewards in the form of additional CRO tokens and voting rights for governance decisions about the blockchain's future direction, including proposing upgrades, fee structures, and new integrations with other blockchains.\n\nCronos doesn't use a consensus mechanism like Bitcoin's Proof-of-Work (PoW) model, which involves competitive cryptographic problem-solving and network-wide consensus to agree to the validity of transactions. Cronos's Proof-of-Authority (PoA) consensus mechanism relies on staked validators that have already been trusted to process and reach consensus on transactions and the state of its blockchain. It is also different from Ethereum's Proof-of-Stake (PoS) model, which randomly chooses its staking validators.\n\nConcerns About Cronos\n\nCrypto.com, a cryptocurrency exchange, is the parent company for Cronos (CRO), using it in its blockchain operations. The company shut down U.S. institutional trading in June 2023, claiming there was not enough interest from this group to justify keeping the platform open to it.\n\nRetail U.S. investors can still trade on Crypto.com, but the liquidity generally provided by institutional traders in the United States is not present on the platform. This can cause issues for investors who use it. For instance, there was $35.2 million in 24-hour trading volume on April 14, 2024, much less than many other cryptocurrencies.\n\nAdditionally, there were only 8,554 active Cronos addresses on April 12, 2024, suggesting that there are only a limited amount of people using the blockchain. Investors looking for trading opportunities or the ability to move in and out of positions quickly might consider other cryptocurrencies to ensure they are not caught in liquidity traps.\n\nIs Cronos on Ethereum? Cronos is built on the Cosmos SDK, so it is not on Ethereum. However, it is a highly interoperable blockchain that can communicate with Ethereum.\n\nDoes CRO Have a Blockchain? Yes, CRO is the native token for the Cronos blockchain.\n\nIs Cronos a Layer 1 Blockchain? In blockchain terms, \"layer\" refers to other chains that operate in tandem with a primary blockchain, completing tasks for that blockchain. Layer 1 is the term used to refer to primary blockchains, so Cronos is a layer 1 blockchain.\n\nThe Bottom Line\n\nCronos is a fast, interoperable blockchain, with its own native token CRO, that aims to be a user-friendly hub for DeFi, NFTs, the metaverse within the broader dApp environment.\n\n\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author owns/does not own cryptocurrency.\n\n"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNNmZHSUNFWE1CSUF4ZnZrck9YdVF4Q05lek15clhsdy15OExoWXBfd2c0RUs1enVxd0dmTGpJdDZvS0hQUVdlWEEwR0t5VzNXRTJwWHVvQTF6eUpsVkY2Q3NDcUoyZ2wyZ0d6S3FjcjFQRlFaSmd5dmZKa3JhZjFvdGg5MmdGd9IBiwFBVV95cUxOT3ZmZFNSY1ZRcm9fQWlGc2dPekhpTjVWb25GNVJzOFN1Z3JhdkZubXZxSGZJeUt4bVhPaFRlLU9qRy1lWHVSeWRqRUxsX2Z1TUFhcnJvU0oza1pNSVFYUGdhaDdiWnU1U0VMY1RwajF2ZVpiZkFFRk0tQ0RpLTlqcUlOLWVLa0ZxdnFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Finds Demand at 38.2% FIB Amid Market Sell-off; Buy this Dip? - CoinGape",
        "content": "This week saw a notable increase in the cryptocurrency market’s volatility, spurred on by the anticipation of the upcoming Bitcoin Halving event. The early week recovery in the market reverted quickly on the weekend as the BTC price fell to a low of $65133 on Friday. Amid this downfall, the ETH price plunged to swing low support of $3100, seeking stable support to prevent a prolonged downfall.\n\nAlso Read: Ethereum Whale Buys $121M ETH From Binance, Price Recovery Ahead?\n\nadvertisement\n\nBuyers Eye ETH’s 100-Day EMA Support for Potential Recovery\n\nThe Ethereum (ETH) coin has been under a correction trend for over a month, showcasing prices dropping from $4095 to $3100, registering a 25% downfall. However, the lower level coinciding with the 38.2% Fibonacci retracement level and currently with a 100-day EMA slope creates a high area of interest(AOI) for buyers.\n\nThe ETH price currently trades at the $3258 mark and with an intraday gain of 0.57% it shows a long-tail rejection at $3100 support, indicating the demand pressure is intact.\n\nFor buyers to sustain above this level in the coming days is crucial to indicate the sentiment of ‘buying the dip’ is intact. The renewed recovery may surge the ETH price by 14% to break the $3730 resistance, followed by a prior swing high of $4100.\n\nAlso Read: Crypto Price Prediction 4/13: Last Drop Before the Bitcoin Halving Rally?\n\n$106M Worth of ETH Hits Exchanges During Market Dip\n\nLookonchain, the on-chain data tracker reported that during a market dip, four significant Ethereum stakeholders have collectively moved 31,683 ETH to exchanges, a sum equating to approximately $106 million.\n\nThe transactions saw Cumberland depositing 17,206 ETH; another entity, associated with the wallet address starting with 0xc3f8, sent 7,976 ETH to Binance; the wallet beginning with 0x1717 moved 4,000 ETH; and Alameda Research transferred 2,500 ETH to Binance. This considerable movement of funds is causing a stir in the crypto community amid market correction.\n\nA breakdown below $3100 will favor sellers to lead to a prolonged downfall.\n\nTechnical Indicator\n\nExponential Moving Average: the trend-defining 100-day EMA has acted as a dynamic support for investors during major corrections.\n\nRelative Strength Index: The daily RSI (80%) slope waving around the mid-line reflects an indecisive sentiment among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOaTUwVjBhcEdZR0x6UEo0dlppWjhfNEpiMXdzWkhvZWdPRFVKd3lTcjV2N2xOOFM0ZzVLbHZmcGdpdmdpYm1Gb0NNQmszMkRWeXM2YjU1U1FyZnZnVGlrWlBHRmdoVmdPMkczZk1sOHlydlVzLV9rZ1loVVJYamxCalRqUTh5UTVPTnZyVEE2a050UdIBlwFBVV95cUxQeUhOUm9VQ0daeUNBUTRfSUE4ZzNRUG5hLUtjTHpHaVNpV0JEb2d5ZGg3UkFoaENUeFpRaFk5ZzIyX0lHMi03WU8wcjlvOFNjTjRFUlBqQ05NRTllclNveXZ2YTloVXhkNUNwcUtNel9UdEFOaUZTYUp6VkdlR1poYmNFN3RRVEMzYTVlZ2NGNkFDc3I1aXV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Reveals Technology That Will Help Ethereum's Main Network - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVitalik Buterin recently discussed a technology that could significantly enhance Ethereum's main network. This technology involves switching Ethereum's current system to \"Verkle trees,\" making the network more \"zk-friendly\" — in other words, more compatible with zero-knowledge proofs, which are methods of proving knowledge of some information without revealing that information itself.\n\nAdvertisement\n\nButerin points out the current limitations with \"keccak Merkle Patricia trees,\" part of Ethereum's underlying structure. The main issue is the enormous \"witness sizes\" — the amount of data needed to prove a transaction — which can be up to 300 MB. Such sizes are impractical for processes that need to be lean and efficient, like zero-knowledge proofs.\n\n\"Verkle trees,\" on the other hand, are designed with zero-knowledge proofs in mind. They use a different type of cryptographic technique and are based on a specific kind of mathematical curve that is better suited for this purpose. The switch to Verkle trees would assist the application of zero-knowledge proofs to Ethereum's Layer 1.\n\nAdvertisement\n\nAdvancements in the aforementioned technology by Polygon's zkEVM Type 1 were acknowledged. The network processes proofs quickly with the requisite computational power. The Ethereum community leans toward adopting Verkle trees rather than adjusting the existing system as suggested in proposals like EIP-3102.\n\nEnhancements that improve efficiency and scalability typically have a positive impact on the value of digital assets. However, implementing Verkle trees could lead to faster transactions and lower costs, which may attract more users and developers to the Ethereum network. This increased activity and demand could, in turn, push the price of Ethereum upward."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPVUFTMGJtZFVvVXlMRmhPTWlnTE5vNUxrUXJrZUVOajNaNVhnRUhMWHRLQklvSnJfWlFQbnZTRS1YbXFkRzQ1X29IeEFmWDVoT0w1YlgtUnJ0RERBLXhXU29iQmUySU9ONHRLSG90bmpma3hCZ2x0dzFfY3phNkRrOHkzMEVuS0RIWkHSAY8BQVVfeXFMUEMtOFZuZjJGU3VpWEo3NS03cEdjTXNGMVZuRlhyVUd2OHBvTkw1cWZQWWxMWE01OXhJa3htR1RORFNPbEYyRnNYb1A4Ty0zMmlPM0E3Xy1IelNVaGthWURjSi00LUhQWHVxR1BzNlBObnljQUFydVNZMV9xRmgxUDZ2bVMxbU9QN1ZzMXVxSTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: Short-term pain or long-term gains for ETH holders - AMBCrypto News",
        "content": "Ethereum’s price fell while network growth and velocity plummeted\n\nOn a macro level, Ethereum’s network continues to see growth\n\nEthereum [ETH] recorded a massive decline in price over the last 24 hours, along with the rest of the cryptocurrency market. At press time, ETH was trading at $3,267.60, with its value down by 7.22% on the charts.\n\nEthereum takes a hit\n\nOver this period, the network growth for Ethereum declined significantly. This indicated that new users were losing interest in ETH and the number of new addresses willing to buy ETH at this rate was very low. Moreover, the velocity for ETH also fell, suggesting that the frequency with which ETH was being traded had declined.\n\nMoreover, Ethereum’s MVRV ratio fell, indicating that the number of addresses that were profitable had fallen. Long/Short difference for ETH hiked as well, indicating that the number of long term holders of ETH had increased.\n\nLooking at the larger picture\n\nEven though in the short term it looks like ETH is struggling, the big picture is much more promising. In fact, it can be seen that Ethereum’s network has come a long way since last year.\n\nFor example – Staked Ether has seen significant growth over the past year, according to Nansen data, surging from 20 million to 32.2 million ETH. Despite a minor dip in staked ETH due to withdrawals from centralized exchanges following the roll-out of Shapella, there has been a remarkable 61% surge in staked ETH.\n\nThis represents a staggering $42 billion influx into Ethereum’s staking infrastructure, based on recent pricing.\n\nValidator numbers have also seen significant growth since Shapella, alleviating concerns within the Ethereum community about a potential mass exodus of validators. According to Austin Blackerby, EVM Analytics Manager at Flipside Crypto, this growth has eased many fears.\n\nThis time last year, there were nearly 563,000 validators securing Ethereum. Since then, this figure has surged by over 74% to approximately 981,000 validators.\n\nSustained growth in validators has raised additional concerns among protocol developers and researchers, as outlined in a September 2023 report. A large validator set size strains peer-to-peer networking and messaging, potentially causing node failures due to high computational load and bandwidth requirements.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, a sizeable validator set makes future upgrades harder and riskier to achieve. The upcoming upgrade, “Electra,” is expected to address the challenges posed by the expanding validator set.\n\nSimply put, the world’s largest altcoin’s long-term future seems more secure and promising than its short-term."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQ3FjN1JnVlNrZ0tKcnYybGZRMHBmV1dRM0JkZjBMcmlSM1Y3STg4a2lEUmVPZHgyWXNaMDJRLTB6M1BnaWpPSjJZbXR0WW45UlhFa3h1aFYzOWdjNzQ3czh2UERva3d5LUFjRXJEUG1peWR6Q3l1eUV5VThLUC01djBzdmd6TDJyMlI1d0p0R3MyaDU0U1VJ0gGcAUFVX3lxTE94U0ZTSDRXQmxMVFJCS0RidFkxdmdWODhLSzJ1VEFpT2FVTk1LUTI1bTNnZ1hwUm1rWG5YZ2h4LTNra2o4Y29QT2RWejZXeW02REhSM3BVeTljVXk4dGMyeTduNzAycFBnRkl3UFpsb1N0c1dkZFh2RkxNdWZqVXpOb0E4YVEtV0R2THZmZ3hFTEJoS3VGYWNHcnUtRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Restaking Platform EigenLayer Launches EigenDA to Mainnet - CryptoPotato",
        "content": "On April 9, the EigenLayer team announced that the platform’s EigenDA, the first Available Validator Service, had launched on the Ethereum mainnet.\n\nThe team added that over 4.1 million ETH had been restaked on EigenLayer, and over the past few weeks, 70% of all new Ethereum validators restaked to the platform.\n\nMoreover, restakers can now delegate their entire stake to an operator that has opted in to run available validator services like EigenDA.\n\nAnnouncing: EigenLayer ♾ EigenDA Mainnet Launch pic.twitter.com/bTp5BfnsKE — EigenLayer (@eigenlayer) April 9, 2024\n\nRestaking Narrative Grows\n\nRestaking allows users to stake the same ETH on both Ethereum and other protocols. Platforms such as EigenLayer leverage Ethereum’s validators and staked tokens, enabling smaller and newer blockchains to benefit from its security and trust system.\n\nEigenLayer also faces a tradeoff between neutrality, allowing free market behavior, and decentralization, thus preventing dominance by a single staking provider.\n\nMoreover, EigenDA provides hyper scalability, cost flexibility, and ease of integration for rollups. It aims to be the endgame solution for data availability on Ethereum.\n\nRollups can onboard to EigenDA mainnet after the operator set and delegations stabilize, it said.\n\n“Over the next few weeks, we expect high operator turnover in the top 200 active set as new operators, delegations, and AVSs come online.”\n\nIn-protocol payments from AVSs to operators and slashing mechanisms are not included yet, but will be added later in 2023, the announcement noted.\n\nAn AVS is essentially a middleware or service that runs on top of the EigenLayer protocol to provide specific functionality. AVSs act as a layer between Ethereum’s execution layer and the various rollups, blockchains, and networks built on top of the L1 network.\n\nEigenLayer total value locked is currently $13.3 billion, having skyrocketed 1,100% since the beginning of this year, according to DeFiLlama.\n\nEthereum Staking Outlook\n\nThe Ethereum staking ecosystem is extremely healthy, with around 27% of the total circulating supply currently staked.\n\nThis works out at 32.2 million ETH, according to Dune Analytics, worth around $112 billion at current spot prices. Ethereum also has just over a million validators, making it one of the most secure blockchains in the crypto space.\n\nLido remains the dominant liquid staking provider, with 29% of the total amount staked, or $33.2 billion worth of ETH."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVnJORGcyY2RKRmNoR1dCT3pQZEl4Q0xsWTh2QzJ4N3UwTmc2eDYxQV91dkxzOGdjaGJELTlGVFNLcjJ2SG5GVEtwWXhhVG9DdHVyMDhFWEZjUUJjbmZHMHJhVEdmcG9menJvX0NJRGpKd09zUlB2cUpVelREQldjdUF5V3HSAYoBQVVfeXFMTVRwMUFqdFJpZ1FUMHlubzdIRndUQkZHUXRpby1HSEpGemtNM1NSdFp5c0Jqd0JLV1dfcFYxa3prMUUyMkZkZUpFb19zbjhjSlVEYmNmamZYSUJfQ2F0U3Z1M09vb3AyRTZUYmgzM3BFcjJuQUk1bThGaDVwX0c1M0JmUFJVZ2J1Y1lR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Shares Take on Verkle Trees Coming to Ethereum - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe conversations around Ethereum (ETH) and its data storage for optimal functionality have made it to crypto X with Polygon co-founder Mihailo Bjelic and Vitalik Buterin debating the possibilities. The conversation started with Bjelic posting a question in which he sought to know if developers are sure it is right to switch Ethereum to Verkle trees, given that its zk-fication is quite likely.\n\nAdvertisement\n\nWading into the conversation, Vitalik Buterin said, \"ZK-ifying keccak merkle patricia trees with worst case 300 MB witness sizes is a non-starter.\" Notably, the Merkle Patricia trees form the current or primary data structure that is being used within the Ethereum blockchain. This data storage structure has its limits, and the plan soon is to replace it with Verkle trees with shorter proofs and increased bandwidth.\n\nTo Bjelic, the current structure, according to the capacity of Polygon zkEVM, can handle the 300 MB benchmark noted by Buterin. The Polygon founder noted that the protocol could even do this easily with a total block time of 12 seconds. He, however, acknowledged that for this to work, it would need approximately 10 server-class CPUs.\n\nButerin's lasting solution\n\nPer the presentation made by Vitalik Buterin, Merkle trees were not designed to be compatible with ZK technology. However, he noted that Verkle trees with a vector element are designed to help achieve this goal ultimately.\n\nZK-ifying keccak merkle patricia trees with worst case 300 MB witness sizes is a non-starter.\n\n\n\nThe verkle tree spec is designed to be zk friendly (eg. choice of curve, using pedersen as the hash)\n\n\n\nSo switching to verkle helps with ZKing the L1. — vitalik.eth (@VitalikButerin) April 12, 2024\n\nPer the design of the entire Ethereum architecture, ZK protocols are mostly embodied as Layer-2 scaling solutions. While these L2s have better throughput, scalability, gas fees and data storage, Ethereum still battles to keep up with scaling up amid the demand.\n\nTo convert Ethereum to a ZK-tech compatible network, Vitalik Buterin highlighted how this can only be achievable using Verkle trees. If this is achieved, ultimately, Ethereum may also benefit from the impacts of the Dencun upgrade in the long term."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPSk5VNm1pWkpfYzE1Q25mY2g1YzI5bkFUM0dtUUpST29NQ0FXUWZJMGRDMDRVMUcwMTlBM0JkVnZRcGZZRjdZLTY4NUQ4azdHbFdPa2JHSXBkYVAzWGJHX3JzSEU2OU44a1ZwR29QSXUwRHh3c0otSXVtMGtiM2wxaUlCWXbSAYoBQVVfeXFMTzRQakRqLVpRRE1YRkI5eVQ4c25yLUxtSThTZGItVUs4WDR6TWk3LTZHeUExeHNBdWhlcTBLMGk1NFRfcnhZMURza3lGVGpRRFJIRlF0enQyN0lDay1lVm5Cam1ZNjV0YXdqVncweElRNDJ1eEtLV0tsMDdqUW9oYWN3Sk1YRUpxTUZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: These 4 ‘culprits’ fueled sell-offs, 7% price fall - AMBCrypto News",
        "content": "Institutions sold ETH worth $105 million during the latest correction\n\nOn-chain data suggested the decline could be an opportunity to buy before another rally starts\n\nFour whales including notable institutional investors took part in selling off some of their Ethereum [ETH] holdings as the altcoin’s price collapsed on the charts. In fact, ETH depreciated by over 7% in just 24 hours.\n\nAccording to Lookonchain, Cumberland, a trading firm, sent a total of 17,206 ETH to exchanges. At the time of the transactions, the coins were worth $57.3 million. FTX also deposited $8.33 million worth of ETH to Binance. Finally, the other two institutions sold a combined $39.92 million in ETH.\n\nOnly the short-sighted may be affected\n\nWhales sell their assets for different reasons. For some, it could be a normal profit-taking event. For others, it could be an avenue to let go after a cryptocurrency has underperformed. However, this altcoin does not seem to fall into this category.\n\nAt the time of writing, AMBCrypto could not confirm why the parties sold. But one thing was certain— The sell-offs played a big role as Ethereum’s price fell to $3,169. At press time, ETH was valued at $3,262, indicating that the cryptocurrency recovered slightly. However, it is important to check if the cryptocurrency can sustain this mild uptrend.\n\nTo do this, AMBCrypto looked at some metrics which could affect the value. First on the list was the Mean Dollar Invested Age (MDIA).\n\nThe MDIA is the average age of coins held in the same wallet. If the metric increases, then it means many coins are less active, and have remained in the same place for a long while. On the other hand, a falling MDIA implies that old coins are moving. For Ethereum, on-chain data from Santiment revealed that the 90-day MDIA spiked.\n\nHistorically, a massive decline in the metric was accompanied by a local top. Therefore, the recent increase suggested that ETH could be undervalued, and the latest correction could be a chance to buy at lower prices before its potential rally begins.\n\nIs the next path great?\n\nNetwork growth was another metric AMBCrypto analyzed. This metric gauges user adoption over time. If it increases, then it means a project is gaining traction. If it decreases, it implies that the project is losing traction.\n\nOn 12 April, Ethereum’s network growth was 128,000, indicating that a lot of new addresses interacted with the project.\n\nHowever, it seemed that the price decline caused the number to fall to 36,100. If network growth improves, demand for ETH might help the price action jump.\n\nConversely, a decline in the metric could result in stagnancy for the value. In addition, the one-day circulation dropped to 230,000, reinforcing the notion of decreased usage.\n\nIs your portfolio green? Check the ETH Profit Calculator\n\nThat being said, the drop in circulation could be good for ETH as it could be a sign of less selling pressure. Should the number of coins used continue to fall, then ETH’s price might exit the awful state it has been in over the last 24 hours."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQYkowYnNyQ3JOcFZzcmJUZTIwTTFpSVZyX0J1bHBESWEwSkhXWmF6TnA4d01ld1VsNXJDSzV1UmdFb0FpRVUyTkZsTGo3aDJtRE16UlhiaHBaZWk4VkRXN3F3Z3BfOElFNlF0MlFyaXRSc1A5Umx2UGV5cExiRUNSOWNxX2ZvZHN4OUtUX1NkMnplT1k10gGaAUFVX3lxTE5uTFdpUFlHbDZDRFpTZjJxQ1lqRVJ2b2lUaWFmd3gzel8zWlNwVmlOd08wbFptVTJ1bWZQZml6bTVqR3loZUxaYzY4cDd3RTF0dVVMM0E1dTM0NmdZM0NxYjc3OU5uejVOanhWa1dxZTIwY3ZWRXZtRjJjWENOSmtXdU5yU1hTMmFoLS0xWmFUWVJNWUkwZUZ2S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, Solana prices crashed to trigger $950M liquidations - AMBCrypto News",
        "content": "Bitcoin, Ethereum, and Solana fell significant on the price charts\n\nAlmost $1 billion worth of positions were liquidated in the last 24 hours\n\nFollowing a surge in its price over the past week, Bitcoin [BTC] recorded a significant correction over the last 24 hours. Over the said period, the cryptocurrency’s price fell by 4.95%, with BTC trading at $67,829.94 at the time of writing. Bitcoin fell on the back of traditional markets tanking owing to the geopolitical uncertainty associated with Iran possibly attacking Israel. Accordingly, both the S&P500 and Nasdaq fell, with the value of traditional safe havens like gold appreciating.\n\nThe decline in Bitcoin’s price had a cascading effect, leading to other cryptocurrencies depreciating on the charts too as well.\n\nAnother one bites the dust\n\nDue to the high correlation with Bitcoin, Ethereum [ETH] and Solana [SOL]‘s prices also fell dramatically and suffered a worse fate. SOL fell by 11.93% over the last 24 hours and ETH declined by 8.33% over the same period. Thanks to the same, both SOL and ETH broke past their previously established higher lows, disrupting their ongoing bullish trend on the charts.\n\nIn fact, the price of ETH fell all the way to $3099 during this drawdown. However, after testing this level, it managed to climb back up to $3256.96, at the time of writing.\n\nPreviously, Ethereum had tested this level on 20 March. If Ethereum follows a similar trajectory going forward, it may attain the $3384-level soon.\n\nSolana traced a similar trajectory. Even though the correction was fairly recent, the price movement of Solana since 1 April hinted at a potential decline in price. Since the beginning of the month, SOL had exhibited multiple lower lows and lower highs, indicative of a bearish trend.\n\nIn order to rally, a massive resurgence in bullish momentum would be required for both ETH and SOL.\n\nAre whales to blame?\n\nDespite these price corrections, however, interest in BTC and ETH remains high. In fact, AMBCrypto’s analysis of Santiment’s data revealed that the number of addresses holding BTC and ETH grew materially over the last few weeks.\n\nThis indicated that the recent decline in prices could have been caused by the behavior of a few whales who were indulging in profit-taking.\n\nHow are traders holding up?\n\nIn the last 24 hours, $947 million worth of positions were liquidated. Out of this, $824.94 million were long positions. Traders that were bullish on BTC, ETH and SOL lost the most amount of money. At this point in time, however, it’s too soon to say which direction BTC will head in, especially with the halving just over the horizon."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNUEZibkhsOTVEaXg3ckpFWHNLckRSWm5EenF3VFdhU0xPRGZIX01fWVF4QnVXNTV5V3Z5dGo2SkNrUm5nYzZzQVhFQzZwdUQ0Umd1bFRLY2p0ZVRGTHRHUHJuSzM0b2xGd0lkcjI5SlBLeU5sSW9KbzV5QUhoUjJvbnZvem9HZ3pDWUHSAY8BQVVfeXFMTlZ5V1VYT0lmYy0tUEp6TTdaWjdkZ0JZQWRrcGRJeDZXOTBpeFVCMS1OQXRvc3NWZFF1TW5BNG4yYVpobkFfdWNfQmRmOExQaU1rOEVpWUZQQ3hEa25JeXFHYVpBeWczU08tcy10aHMtbktzOExVcXN6eDA3d1JmbUtVeDBsUVhmaUZqM05pMk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: Is your ETH safe? New data raises some Qs for you… - AMBCrypto News",
        "content": "Security concerns around Ethereum were explored by analysts.\n\nActivity on the Ethereum network remained high, and interest in NFTs fell.\n\nEthereum [ETH] is known for its reliability and hasn’t faced any major issues. However, questions were raised about the network’s security recently.\n\nLooking into the security aspect\n\nAccording to the findings of crypto analyst Christine Kim, Ethereum’s security model poses certain vulnerabilities. Her analysis delves into potential exploits that attackers might employ against Ethereum’s proof-of-stake consensus protocol.\n\nIt examines scenarios such as reorganizations and finality delays, particularly concerning attackers with varying proportions of the total staked ether.\n\nA key insight is that attackers with more significant stakes wield greater influence, as their stake translates into voting power, enabling them to sway the contents of future blocks.\n\nAs the attacker’s stake reaches certain thresholds, their power escalates, leading to outcomes like finality delays, double finality, censorship, and control over both the blockchain’s past and future.\n\nHowever, attacks involving 34%, 51%, or 66% of staked ether might necessitate out-of-band social coordination for resolution. While this could pose challenges for the community, the Ethereum social layer serves as a robust defense mechanism.\n\nAny technically successful attack could potentially be neutralized by the community’s agreement to adopt an honest fork.\n\nThis dynamic creates a race between the attacker and the Ethereum community, where swift social coordination could render the attacker’s investment futile.\n\nHow is Ethereum doing?\n\nDespite these security concerns, it was business as usual on the Ethereum network. AMBCrypto’s analysis of Santiment’s data revealed that the gas usage on the Ethereum network had remained consistent over the last month.\n\nThis indicated that activity on the network had remained the same. However, interest in the NFT sector declined significantly during this period.\n\nThe declining NFT trades on the network suggested that the rising activity on the Ethereum network wasn’t driven by interest in NFTs on the network.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nComing to ETH’s price, it was trading at $3,522.12 and its price had declined by 1.92% in the last 24 hours. Moreover, the network growth of ETH had also plummeted indicating that new addresses had started to lose interest in the token.\n\nAdditionally, the velocity at which ETH was trading at had also fallen, implying that the trading frequency of ETH had decreased."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPNTA4U0hhUXNLSFNrZWI0MFgtS0E3bk84dUZPWDRjWUo3dzh3d0drRHR3Vm8yMzZ1YVc4YnNhUVFWVXVaLTlJZmkzdlBib2pBT1E0Y2lId1JSREdydTMxN1hMVWF3VmViUUpMR2N5Y3d6S1BtT01zRV92d05qRjhRUkFoeUduVGRaY21BWk1pMzE0NVVObU5BbE42cHEtLVhDNnA1d1NlRVNDT1V4N1l4N9IBtgFBVV95cUxNemg5bExlV2xYejJKTldKNGpycGNiWGlTdFF2SElkWVJySHFHeTRZNHNaVl9vb2pOZWNORXBSdHFONDhwUmtIWjE5cGpBeHlnakVJVmdKZXlNRkZOUVlqZzNxWk9KdVVBWFMwdFppeWV0bDMyeV9mZGhrcDM1V3kxRmxQSGpjekhGeU5pX3ZHU2tNSWxOMXNzSEI5ZmRoYnV1Q29LZTFCSWJhWVFrd0RDNkZiclpmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC), Ethereum (ETH), and other cryptos bleed as tension escalates in the Middle East - AMBCrypto News",
        "content": "Bitcoin and the rest of the crypto market registered a massive loss after Iran officially launched an attack against Israel\n\nThe biggest loss bearers of this event among the top 20 coins were SHIB, AVAX, and XRP, with over 10% loss in the past hour.\n\nThe cryptocurrency market has registered a massive reaction to the escalating tensions in the Middle East. Bitcoin (BTC), the king coin, has lost nearly 8% of its value within a few minutes, while other cryptocurrencies have registered a loss exceeding that. The great crypto plunge follows news of Iran’s official attack on Israel, confirmed by Israeli authorities.\n\nAccording to CoinMarketCap, at press time, Bitcoin (BTC) was trading at $62,049 with a market cap of over $1 trillion. The coin has registered a downtrend of 7.51% in the past hour, while its past-day trend shows a similar pattern.\n\nEthereum (ETH), the second-largest cryptocurrency in the market, has also lost a huge portion of its value in the past hour. According to CMC, ETH lost nearly 9% of its value, with the coin trading at $2924 at press time. The market cap for ETH stood at over $353 billion, while the trade volume was at over $41 billion.\n\nNotably, the three biggest losers among the top 20 cryptocurrencies in the past hour were Shiba Inu (SHIB) with nearly 13. 01%, XRP with a drop of 13.89%, and Avalanche (AVAX) with 12.46 % drop.\n\nBitcoin bears the brunt of escalating situations in the Middle East\n\nThe price of the crypto market plunged collectively after reports confirmed that Iran has launched a direct attack against Israel. This move comes across as a significant one as it is the first time the Iranian regime has launched an attack directly against Israel from its soil.\n\nIran has launched dozens of drones at Israel and the target of the attack remains unclear. The move comes as a response against Israel for IDF’s attack on the country’s consular annex in Damascus. Along with the market’s response, the attack has led to the closure of Israeli airspace and planes have been diverted from any Israeli destination."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxObHh5UW1UY3VVVTZ2T1dxendLbWNUbE01a3ZMRU9CNklWNHl5cGFVaVVGOWtnV2dPZk5mVkZ4emE4QV80aEVpV2tqNmw4MV9sYTlHR0IyVHJBMk1LdHNqalVwY1Z3Ry1pYVBvRDdFT1lsQlNwMzNKMGtvLU1CeVMxX3JsOEVaRWQ0QlZRekQwZkczaWRpRzV4VnItdnh5V3d5ekx2Tk1iMy1jY2wtbjN4Y0dtMGsyTTYzQ2ljRTAyYTdldw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Aptos and Ethereum Classic Anticipate Incoming Rally, As Presale Star KangaMoon Nears $5M - Techpoint Africa",
        "content": "Despite Aptos (APT) and Ethereum Classic (ETC) trading within narrow ranges, both coins maintain solid support from investors. While Aptos hovers between $12.1 and $14.7 throughout the week and Ethereum Classic aims for new highs, attention turns to KangaMoon (KANG). Having raised over $4.7 million in its fifth stage of its ongoing token presale, KangaMoon is attracting an influx of investors, many of which expect the value of the native KANG token to increase over time as the project develops and gains mainstream adoption.\n\nKangaMoon (KANG) Finally Hits the $4.7 Million Price Milestone\n\nIn the meme coin market, KangaMoon (KANG) exhibits its promising potential and unique features. By combining SocialFi with GameFi’s Play-to-Earn concept, KangaMoon lets users earn rewards by participating and engaging in battle contests, periodic challenges as well as through speculative betting. Speaking of which, users can win different rewards, including the native KANG tokens or even high-value in-game items, which can be traded for real cash on the platform’s dedicated marketplace.\n\nRight now, KangaMoon is in its fifth stage of the token presale and has already raised over $4.7 million, with projections of hitting $6 million by the end of the month. Having started at an initial offering price of $0.005, the KANG token witnessed a price increase to $0.0196, delivering to early buyers a 290% ROI.\n\nMeanwhile, KangaMoon has a growing community of over 6,000 token holders and 20,000 users. As the presale continues, these numbers are projected to increase further. As such, analysts believe the token could increase by 1000% from its current value shortly after it enlists on top-tier exchanges, offering huge potential for early investors.\n\nConclusively, KangaMoon is strategically positioning itself as a top meme coin project in the broader crypto market, especially as it leverages its innovative tactics and community-focused vision. Furthermore, key activities such as social media promotion, account verification, and active community engagement, with a growing referral program, add to its appeal, further solidifying KangaMoon's position among the top meme coins.\n\nAptos (APT) Token Recently Forms Partnership to Boost Network Activity\n\nAptos (APT) is showing signs of a potential market breakthrough, with increased trading volume and positive technical indicators. However, on the monthly chart, the native APT tooken saw about a 7% decline, and a nearly 17% drop on the weekly price chart, trading between $12.1 and $14.7. Despite recent sluggish momentum, Aptos reached $18.1 this year, giving hope to investors.\n\nMeanwhile, in a recent post on X, Aptos highlighted efforts to make AI technology more accessible within its ecosystem and beyond. Partnering with Ionet, Aptos network aims to offer distributed and scalable GPU resources, alongside various AI models and products. This collaboration seeks to utilize Aptos' safety, speed, and performance to support innovative AI solutions by ionet, potentially boosting both Aptos' price and investor confidence in acquiring more Aptos tokens.\n\nEthereum classic (ETC) Network Anticipates a Rally in Coming Weeks\n\nEthereum Classic (ETC) is hoping for a price surge soon, as it has only seen modest gains in April. Traders are waiting for a possible rally, which could lead the Ethereum Classic price to new highs. Currently, the ETC token is trading around $32.57, but if the rally doesn't happen soon, it might drop.\n\nAmidst this anticipation, Ethereum Classic aims for a breakout as it has been stuck between $34 and $38 since the beginning of the year. Although Ethereum Classic price dropped by 11.53% last month, it went up by 7.49% this week, from $30.1 to $35.8. Given these developments, investors are now turning their attention to KangaMoon, finding it the best crypto option with promising features and growth potential.\n\nDiscover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!\n\nWebsite: https://KangaMoon.com/\n\nJoin Our Telegram Community: https://t.me/KangaMoonofficial"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPcUFsRFRSdldwX2dhZkhSNjlKay12SjZjTU9QRHN4c2QyUVhqZnl1dlJiOWZMbHJCRHpTMG9pYW5TaFRFdU5FM3ltNGc4VW5tSTFNVDBCSldCZDlTcWR1U0ZqU0xVeWR6aGRkTWlpQlAwZkM0NjlmMzJ4eWg4blJGYmhhckpGVmxJQmxVWdIBkgFBVV95cUxPQ0hPb2w3ZmZTS1ZFZjk0MjdkUFE3UFpnQm5UdzNfZ09qQUFhRlNvQkZqNWN4dGZoNGc3cGFkSWhpX3lHc1Q4Z3F2REd1NllQOWJEak5wenVPWXFvdTBadi1YZHpHYVlkOXYwOHlfcGZvUkhBTW5jQlVPR0lfM2x5UC1uaUl1LWNGQ2EyTXBrb2tKZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Chainlink-Ethereum integration – Brace yourself for bad weather? - AMBCrypto News",
        "content": "LINK gained traction after the project disclosed the update with ETH cross-chain transfers.\n\nThe price of the token might drop below $14 in the short term.\n\nThe number of new Chainlink [LINK] addresses has been increasing since the 11th of April, AMBCrypto discovered. According to Glassnode, new addresses on the network were 778 on the 10th of April.\n\nBut as of this writing, that number had increased to 1123. A rise in new entrants into a network is a sign of improved adoption, which could increase demand for the token involved.\n\nMore bridges, more expansion\n\nSince hitting a yearly high in March, Chainlink had found it difficult to attract newbies to its ecosystem until recently. However, there were reasons attached to the increase.\n\nAccording to AMBCrypto’s findings, it was no coincidence that the metric began to rise after the project’s recent integration with Ethereum [ETH].\n\nOn the same day LINK’s new addresses began to increase, Chainlink put out an announcement, noting that the CCIP has been extended to ETH and some Layer-2 networks under the blockchain.\n\nCCIP is an acronym for Cross-Chain Interoperability Protocol. This protocol enhances the bridging of assets on multiple blockchains. In the recent announcement, Chainlink explained,\n\n“This upgrade means that CCIP now supports the cross-chain transfer of native ETH between different blockchain networks, starting with Ethereum, Arbitrum, and Optimism, which is made possible by WETH lock and unlock token pools.”\n\nHowever, an increase in traction was not the only after-effect of the development. AMBCrypto’s further examination showed that there was a change in the smart contract supply.\n\nFor those uninitiated, the introduction of Ethereum was what made it easy for other projects to allow smart contracts development.\n\nOn-chain data showed Chainlink’s supply in smart contracts was about 52% at the beginning of April. However, the supply had increased to 53.81% at press time.\n\nSome things take time\n\nWith the increase, LINK holders might be able to bridge more assets to other chains, including Ethereum. But in the short term, LINK’s price might have to cope with the turbulence in the market.\n\nThis was because of the state of the exchange inflow and outflow. When exchange inflow increases, it means traders are contemplating selling their assets. But a decrease suggests otherwise.\n\nFor exchange outflow, an increase implies a decision to hold for potentially better gains. At press time, LINK’s exchange outflow was 4086 while the inflow was over 13,000 tokens.\n\nRealistic or not, here’s LINK’s market cap in ETH terms\n\nThis disparity in these metrics was a testament to the sell-offs going on in the market. Should the inflow continue to outpace the outflow, LINK’s price might fall below $14.\n\nHowever, if bears decide to halt selling, and bulls accumulate, the price might bounce."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNaG5YSzZhdE5ONkNvc2t4QW41N0xXdU9hTGFYRDBlekVnWGtZYkFNbzl5RkxfVjdKbTVRR2JJNnZXQWFCTjlHdHVtQk1zU0lqNEJ6RXFZM3QwNTR0QVdDRzRPQUp0cjRtYW5sVXBVYmhDZ2dBTjhsLTVMS3B5WnFSeVVNS3RvY21yYzNuOVpjcTFGaXkzWmFiNVZhX2Y2Z1VydGg0VGlrR3FWLUUwQTRIdHF5V3Rzekp0QVU4WXM3LUlBUdIBxwFBVV95cUxOQm5wWE5OSHdtaE9Rb2hUaU1vMXVQNk9jdUsyc1Y0bFhTcUZ2cWhhRDhfQkJhMURWX2xGRURGWDVSZHdid202NG1ZdzVvM0tkR1gydUVCYURtR2UtNDFXOVVEdGdiWFM2UGVfVWtNdEk1VW9kV3NUZFN0WkFIZUU0UWhoS0dNNm44aVlITXNNQ0c4WUtoNUd2dlVnNkhRaDU3Ql9YNTJhbmJiTzBMVGhqcEJPMWtOXzhwSGhKYXE3bTZUaWJEYVUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum & Cardano Displaying Acute Weakness Against Bitcoin, Has AltSeason 2024 Differed? - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nStory Highlights Bitcoin against the USD has been displaying weakness and hence the altcoins have also jumped into the beamish well\n\nTop tokens like Ethereum and Cardano are displaying huge bearish signals as they have plunged before their respective key support levels\n\nThe market dynamics appear to have changed to a large extent as the prices of the majority of the cryptos have plunged below the crucial support as Bitcoin slumped hard to close to $60,000. During the previous pullback, many speculated a drop below the levels, but the token underwent a rebound from the levels similar to the previous day. Therefore, it is quite obvious that the market participants are no doubt bullish on Bitcoin but wish to accumulate below the lower support.\n\nWith this, the second-generation and third-generation cryptos, Ethereum & Cardano, have fallen weak and display a huge possibility of reaching the lower support zone, this summer. A popular analyst, Benjamin Cowen, believes the ongoing pullback is quite natural in the BTC price rally, but has also mentioned its reverse impact over the other top altcoins as well. For instance, the ETH price, which has slumped below $3000, holds a huge possibility of witnessing another pullback before initiating a rebound.\n\nConsidering the above chart, the analyst says that the ETH/BTC has been closely following the previous trend. According to this, the pair had a bottom just after the first rate cut after breaking the support. Therefore, a similar rally can be expected at present wherein the pair could find its bottom somewhere below 0.035 BTC.\n\nOn the other hand, the analyst shares a similar view on Cardano, as the ADA/BTC pair is closely following descending support.\n\nMuch like the ETH price rally, the ADA price is also following a previous trend as ADA/BTC is trading, sticking along the lower trend line. Therefore, the current trade setup suggests the pair could eventually bottom at 0.0000035 BTC, which may further trigger a massive bullish spell. However, the analyst believes both pairs may find their bottoms during the summer, beyond which a healthy rebound can be expected."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNejNaQzNjRWI3NlkyZmEtcWpYNXBINXoxLTk3b3JlRnhMWVZHUU5KT0F5NmI5N2k0UG1tdDNhbVktclpEa1B2c3pHV2ZSWGVtMmxkTmluanFsc1FRTkIydW0xNDd0eUZVcVJUX2hPc2c2VjFUZWotSjFDZkMwSEhJRklvZjh0bzZJMFJFbndPUFZtRURWZWpVaEdoTlhFLTlmaVdjVFNPZ1RvOGU3MmfSAbIBQVVfeXFMTzBPeE1GdHFFZ3pEYmhydkdrRHJoVnZqbnNiWEpwMl90Ty1sSktOazVhNm1BVjBBZEhSb25kbENSUWZ4aE96cS1JMFV5R2FhTHhyYjhpaG45Q1MyXy1Tci0xT3RBU3BLTFMzS1V2eDUwei1oV0pBd09hdEEydWdvWFFwUEZzYW1fWHZMZDV5MnlOd213bHRQazdGSWdudl95aF9zM0FUYnhoWWpFcnFfcHdIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Octoblock Holders Collect First Airdrop While Ethereum Users Take Notice - CoinCodex",
        "content": "Octoblock recently made waves in the crypto market as its investors collected their first airdrop rewards. This led to a surge of interest from Ethereum (ETH) users seeking innovative and potentially lucrative opportunities.\n\nWhat is a crypto airdrop?\n\nA crypto airdrop refers to the distribution of new coins or tokens to existing cryptocurrency holders or users who perform specific tasks. These tasks could include actions like joining a social media channel, participating in a project's community, or completing certain activities outlined by the project team. Airdrops are commonly used by blockchain projects as a marketing strategy to increase awareness, attract new users, and incentivize engagement within their ecosystem. The tokens awarded can be held or traded on cryptocurrency exchanges to earn profits.\n\nEthereum price exhibits significant strength\n\nAmid the broader market recovery, the Ethereum price has exhibited significant strength, surging by over 7% on April 9. An analysis of the daily chart shows Ethereum’s resilience against heightened selling pressure, with ETH finding robust support around the $3,200 level. This zone aligns with pivotal Fibonacci retracement levels ranging from 0.5 at $3190 to 0.618 at $2972, bolstered further by the 100-day moving average at $2972. Nonetheless, ETH is presently in a phase of sideways consolidation, with many market participants anticipating a bullish resurgence to reclaim the yearly high of $4,100 in the medium term.\n\nWhat is Octoblock?\n\nOctoblock is a revolutionary decentralized finance (DeFi) protocol the Binance Smart Chain looking to build an ecosystem with a variety of features and services that cater to a wide array of financial needs.\n\nThe Octoblock cFyF (Crowd Funded Yield Farming) mechanism will enable DeFi participants to collectively participate in yield farming activities by contributing funds to a communal yield pool. The pooled funds will enable cFyF participants to access higher-yield farming opportunities than they would individually, leading to better returns.\n\nAdditionally, OCTO holders will get 45% of the profits made by Octoblock's revenue-generating system, the Nautilus Trove. Octoblock also has an enticing sweepstake known as Saltwater, designed not just for entertainment but also to offer tangible rewards. The sweepstake will share 5% of the proceeds with randomly selected addresses within the community.\n\nMoreover, Octoblock, through its Tentacle Trust, will aid organizations involved in the conservation of our oceans and marine life. The OCTO holders will vote monthly to choose the trust’s beneficiaries, contributing effectively to the fight for environmental sustainability.\n\nGoing further, Octoblock will introduce a comprehensive one-stop platform meticulously designed to facilitate seamless bridging and swapping of assets across blockchain networks. This will eliminate the need to navigate through multiple platforms, paving the way for unprecedented ease and functionality in the crypto space.\n\nThe Octoblock ICO airdrop\n\nThe Octoblock Initial Coin Offering (ICO) entered Phase 3 on April 10, selling OCTO at $0.037 with a 13% bonus. As part of its commitment to community engagement, Octoblock initiated a staking mechanism that will immediately incorporate any tokens bought during the ICO. The mechanism is designed to release weekly payouts to investors, with APYs (Annual Percentage Yields) calculated based on the price of OCTO at that particular phase of the offering.\n\nOctoblock announced their first airdrop on April 9 2024. $100 of OCTO would be worth $124 at the time of allocation, meaning an APY of 185.5%. Notably, the project is set to include USDC in the very next airdrop alongside the OCTO token, further enhancing incentives for participation.\n\nMoreover, each token bought in the ICO is regarded as an entry to Octoblock's exclusive giveaway, where one lucky participant will get a new, full-option 2024 Tesla.\n\nFor more information on Octoblock:\n\nWebsite: https://octoblock.io/\n\nBuy OCTO: https://reef.octoblock.io/register\n\nDisclaimer: This is a sponsored article. The views and opinions presented in this article do not necessarily reflect the views of CoinCodex. The content of this article should not be considered as investment advice. Always do your own research before deciding to buy, sell or transfer any crypto assets."
    }
]