[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPYkxOS05VN1FDaFp1akRWNEM5Y2tiZFdNY3NXQTQ4NXFuUC1zYjZWakNSQ1poRWJEcUhSYTNlZDJBYjN5RDdUQklJZUJNVjFzVkN6ZkdpMVBBX0hfTENqb2N6WTE0NlNBeVZ1bUhpcWFHWXNXQ20zUW8ta2JVMmoxZVNNc1J6R1BNV1p4UXk4WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Top 15 Ethereum Competitors and Alternatives in 2024 - Yahoo Finance",
        "content": "In this article, we will discuss the top 15 Ethereum competitors and alternatives in 2024. If you want to skip our analysis about some of the key players in the cryptocurrency market, you can proceed to the section highlighting the Top 5 Ethereum Competitors and Alternatives in 2024.\n\nThe Global Cryptocurrency Market and a Comparison of Giants\n\nAccording to a report by Grand View Research, the global cryptocurrency market was valued at $4.67 billion in 2022 and is projected to grow at a compound annual growth rate (CAGR) of 12.5% from 2023 to 2030, to reach $11.71 billion by the end of the forecasted period. You can also take a look at 15 Best Blockchain and Bitcoin ETFs.\n\nBitcoin and Ethereum are the two most traded cryptocurrencies in the world. Both Bitcoin and Ethereum utilize blockchain technology, however, they have different purposes and technical architectures. Bitcoin was introduced in 2009 by the mysterious Satoshi Nakamoto as a decentralized digital currency primarily tailored for peer-to-peer digital transactions without the involvement of financial institutions. Bitcoin emphasizes security, and scarcity with its blockchain optimized primarily for monetary transactions. Bitcoin is powered by the energy-intensive Proof-of-Work (PoW) consensus mechanism and operates on the SHA-256 hash algorithm, Bitcoin has the highest market capitalization among all cryptocurrencies, valued at over $1.3 trillion on April 14. However, its smart contract capabilities are limited compared to Ethereum. You can 15 Countries Where Bitcoin is Legal and Illegal.\n\nEthereum on the other hand was launched in 2015 and is a global, open-source platform for decentralized applications that empowers developers to build decentralized applications (dApps) and execute smart contracts, which are self-executing agreements encoded in code. Examples of decentralized apps that can be built on Ethereum include tokens, non-fungible tokens, decentralized finance apps, lending protocols, and decentralized exchanges. Tokens are interchangeable digital assets that represent value on a blockchain. Non-fungible tokens (NFTs) are unique, non-interchangeable tokens that represent ownership of digital items such as art, collectibles, or virtual real estate. Decentralized finance (DeFi) apps are blockchain-based financial applications that operate without centralized intermediaries, Lending protocols are DeFi apps that allow users to lend and borrow cryptocurrencies, which often use NFTs as collateral and Decentralized exchanges (DEXs) facilitate the trading of cryptocurrencies in a decentralized manner, without any intermediaries. As of April 14, Ethereum has a market cap of over $386 billion.\n\nStory continues\n\nEthereum charges a fee for transactions and smart contracts on its blockchain network known as Gas which is paid entirely in Ethereum coins. Gas is measured by the amount of computational effort required to execute an operation or a smart contract, the more complex the execution operation is, the more Gas is required to fulfill that operation, and can vary from time to time depending on the network’s demand. Gas fees for Ethereum transactions can range from $0.0001 to over $100, depending on the blockchain’s demand.\n\nKey Players in the Cryptocurrency Market\n\nCompanies offering user-friendly cryptocurrency exchange platforms and providing services such as trading, lending, and wallets have contributed significantly to the growth of the cryptocurrency market and have also established themselves as key players in the digital finance industry. Some of the largest companies offering platforms and wallets for the cryptocurrency market include Coinbase Global Inc. (NYSE:COIN), Robinhood Markets, Inc. (NASDAQ:HOOD), and Block, Inc. (NYSE:SQ).\n\nCoinbase Global Inc. (NYSE:COIN) operates a cryptocurrency exchange platform and is the largest cryptocurrency exchange in the United States in terms of trading volume. On April 3 Coinbase Global Inc. (NYSE:COIN) announced that it had obtained registration as a Restricted Dealer by the Canadian Securities Administrators (CSA), making it the first and largest international cryptocurrency exchange registered in Canada. The registration marks a significant milestone in Coinbase Global Inc.’s (NYSE:COIN) commitment to the Canadian market, following its Enhanced Pre-Registration Undertaking in March 2023 for regulatory compliance and formally launching its services back in August 2023. Coinbase Global Inc. (NYSE:COIN) plans to establish partnerships with local financial institutions and stakeholders in Canada to encourage the adoption of digital assets and promote economic development. On April 11 Coinbase Global Inc. (NYSE:COIN) announced the launch of margined Bitcoin Cash and Litecoin futures contracts by Coinbase Derivatives, making it the first CFTC-regulated exchange to offer such contracts. Dogecoin futures contracts are also expected to launch later this month. Coinbase Derivatives aims to improve access to digital asset trading by reducing upfront capital requirements and ensuring regulatory compliance.\n\nRobinhood Markets, Inc. (NASDAQ:HOOD) provides a user-friendly platform that can be used to trade stocks and cryptocurrencies. On March 19, Robinhood Markets, Inc. (NASDAQ:HOOD) announced its official launch in the United Kingdom and offered key features and benefits for investors including options trading, 5% AER (Annual Equivalent Rate) on uninvested cash, access to over 6,000 global companies, commission-free trading, and no foreign exchange fees on trades, in comparison to the significant fees charged by other UK brokers. On February 29, Robinhood Markets, Inc. (NASDAQ:HOOD) announced its collaboration with Arbitrum, a Layer 2 scaling solution that will give Robinhood Wallet users access to Arbitrum swaps through decentralized exchanges. Robinhood Wallet users can now benefit from reduced transaction fees and faster transaction speeds on some of the most prominent networks in the cryptocurrency market. Over the next few months, Robinhood and Arbitrum will also collaborate to facilitate access to cross-chain swaps and other initiatives that are aimed at lowering the barriers to using web3 on Robinhood Wallet. Commenting on the event, Johann Kerbrat, General Manager of Robinhood Markets, Inc.’s (NASDAQ:HOOD) Crypto Divison said:\n\n“Ethereum gas fees are an essential part of securing the network, but these same fees can hinder adoption, Layer 2s like Arbitrum, which is currently the leading chain by total-locked value, help solve this problem for our users. Accessing and transacting on L2s has historically been difficult to non-crypto natives, but Robinhood Wallet now helps strip away the complexities to help onboard those new to web3.”\n\nBlock, Inc. (NYSE:SQ), formerly known as Square, Inc. is a global technology company with a focus on financial services and owns Square, Cash App, TIDAL, and TBD. On December 07, 2023, Block, Inc. (NYSE:SQ) launched Bitkey a self-custody cryptocurrency wallet in over 95 countries across six continents that consists of three components: a mobile app for seamless transactions on smartphones, a hardware device for securely storing cryptocurrencies offline, and a set of recovery tools in case customers lose their phone, hardware, or both. Unlike traditional self-custody wallets, Bitkey uses three keys to secure cryptocurrencies: one integrated into the mobile application, another in the hardware device, and the third stored on Bitkey’s server. Any two keys can be used to move cryptocurrencies or approve other security-related actions such as initiating recovery or modifying security settings. Bitkey has also partnered with prominent platforms like Coinbase and Cash App, enabling seamless transfers of cryptocurrencies from exchanges to the Bitkey wallet.\n\nEthereum's decentralized platform not only facilitates digital transactions but has also transformed the landscape of decentralized applications as they operate on a distributed network of servers and are not prone to censorship and fraudulent activities. As the cryptocurrency market continues to evolve, innovations in blockchain technology will further expand the possibilities within the cryptocurrency industry. With this context, let’s take a look at the list of the top 15 Ethereum competitors and alternatives in 2024. You can also take a look at the best day trading tips for beginners.\n\nTop 15 Ethereum Competitors and Alternatives in 2024\n\nnick-chong-0bO235Rhqec-unsplash\n\nOur Methodology\n\nTo come up with the top 15 Ethereum competitors and alternatives in 2024, we employed a consensus approach. We consulted more than 10 articles on the internet to find the top Ethereum competitors and alternatives in 2024. Of them, we picked cryptocurrencies that appeared in 50% of our sources and ranked them according to their market cap as of April 14, 2024. Here are the top 15 Ethereum competitors and alternatives in 2024.\n\nTop 15 Ethereum Competitors and Alternatives in 2024\n\n15. Filecoin (FIL)\n\nMarket Cap as of April 14: $3.42 billion\n\nFilecoin (FIL) is an open-source, public cryptocurrency and digital payment system made by Protocol Lab. Filecoin (FIL) allows users to rent out their unused storage space and earn tokens in return and creates a decentralized marketplace where one can store information securely and efficiently. Filecoin (FIL) ranks 15th on our list of top 15 Ethereum competitors and alternatives in 2024.\n\n14. Polygon (MATIC)\n\nMarket Cap as of April 14: $7.31 billion\n\nPolygon (MATIC), formerly known as Matic Network, is one of the top Ethereum alternatives in 2024 for processing transactions faster and cost-effectively. Polygon (MATIC) provides a solution for the Ethereum blockchain by offering a way to process transactions off the Ethereum blockchain and then commit them back to the main blockchain. Polygon (MATIC) plays a pivotal role in facilitating transactions and decentralized applications as Ethereum’s blockchain can be slow and expensive to use.\n\n13. Chainlink (LINK)\n\nMarket Cap as of April 14: $8.58 billion\n\nChainlink (LINK) is a decentralized oracle network designed to connect different networks and protocols. Chainlink (LINK) enables smart contracts to securely interact with external data sources, APIs, and payment systems to expand their capabilities. Chainlink (LINK) supports data movement between all blockchains worldwide and is one of the top 15 Ethereum competitors and alternatives in 2024.\n\n12. USD Coin (USDC)\n\nMarket Cap as of April 14: $9.69 billion\n\nUSD Coin (USDC) is a stablecoin pegged to the US dollar on a 1:1 basis. USD Coin (USDC) is issued by regulated financial institutions and is fully backed up by reserved assets. USD Coin (USDC) is commonly used for trading, investing, and transferring value on blockchain networks. USD Coin (USDC) ranks 12 in our list of top 15 Ethereum competitors and alternatives in 2024.\n\n11. Tron (TRX)\n\nMarket Cap as of April 14: $9.87 billion\n\nTron (TRX) is a blockchain and peer-to-peer (P2P) network that enables content creators to sell their content directly to consumers without any intermediaries and transaction fees. Tron (TRX) is developed by the Tron network and is used for various purposes, including transactions, smart contracts, and voting on network governance. As of 2024, Tron (TRX) is one of the top competitors and an alternative to Ethereum.\n\n10. Polkadot (DOT)\n\nMarket Cap as of April 14: $9.98 billion\n\nPolkadot (DOT) is a scalable, secure, and decentralized multi-chain network for the next web and is built on the Substrate framework. Polkadot (DOT) allows independent blockchains to share information and assets securely and creates an interconnected and scalable ecosystem. Polkadot (DOT) is one of the top Ethereum competitors and alternatives in 2024, developers can use the Polkadot (DOT) infrastructure to create custom blockchains with larger design spaces for decentralized assets and applications.\n\n9. Avalanche (AVAX)\n\nMarket Cap as of April 14: $14.10 billion\n\nAvalanche (AVAX) is a blockchain platform that offers tools for creating decentralized finance (DeFi) applications, financial assets, and enterprise-scale financial solutions and is one of the top competitors and alternatives to Ethereum in 2024. Avalanche (AVAX) is also compatible with Ethereum and its network is designed on multi-chain linear scalability which can process over 4,500 transactions per second.\n\n8. Shiba Inu (SHIB)\n\nMarket Cap as of April 14: $14.21 billion\n\nShiba Inu (SHIB) is a meme-based cryptocurrency inspired by the Dogecoin community and is one of the top competitors and alternatives to Ethereum in 2024. Shiba Inu (SHIB) creates a decentralized ecosystem for artists, creators, and developers to collaborate and build projects. Shiba Inu (SHIB) is the native token of the ShibaSwap decentralized exchange and is used for various purposes including as a peer-to-peer digital payment system.\n\n7. Cardano (ADA)\n\nMarket Cap as of April 14: $17.65 billion\n\nCardano (ADA) is a decentralized Proof-of-Stake (PoS) blockchain that requires less energy to operate compared to the Proof-of-Work (PoW) mechanism. Cardano (ADA) was developed by Ethereum’s co-founder Charles Hoskinson as a platform for Web3 applications. As of 2024, Cardano (ADA) is one of the top competitors to Ethereum.\n\n6. Dogecoin (DOGE)\n\nMarket Cap as of April 14: $23.95 billion\n\nDogecoin (DOGE) started as a joke based on the popular \"Doge\" meme and since then has gained a significant following and community. Dogecoin (DOGE) is a decentralized cryptocurrency that can be used for peer-to-peer transactions, tipping, and charitable donations and is one of the top 15 Ethereum competitors and alternatives in 2024. Dogecoin (DOGE) is known for its strong community spirit and has been supported by various celebrities and influencers.\n\nClick to continue reading Top 5 Ethereum Competitors and Alternatives in 2024.\n\nSuggested Articles:\n\nDisclosure: None. Top 15 Ethereum Competitors and Alternatives in 2024 is originally published on Insider Monkey."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE52Z0ZEQThIcS0tNzZ6M1VuNlhVS1Q0T1p6Q0J2aDJkdjJFY0xqS2dUa2ZvanVVQWJTN21BU0ZQNzBaaTJoclNRTGdIbkRmN2xTNWRqWUxubTVoWWRzSmpieUN5bkxzam5VanItVUVrZGF4SDMxbmRNQWllb2E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Franklin Templeton's Ethereum spot ETF listed on DTCC - Crypto Briefing",
        "content": "The listing represents a preliminary step in the trading process, yet it does not ensure that the SEC will grant approval for the fund.\n\nShare this article\n\nFranklin Templeton’s proposed spot Ethereum ETF has appeared on the Depository Trust and Clearing Corporation’s (DTCC) new securities list with the ticker EZET. This development occurred just a day following reports of the SEC’s probable rejection of spot Ethereum ETF applications.\n\nThe DTCC listing represents a preliminary step in the trading process, yet it does not ensure that the SEC will approve the Ether Spot ETF. The SEC’s decision on the fund remains pending.\n\nFranklin Templeton filed for spot Ethereum ETF in February, joining other industry giants like BlackRock, Grayscale, VanEck, and ARK Invest, in the race. However, the outlook for Ethereum-based funds is not as promising as it was for Bitcoin-based predecessors.\n\nBloomberg ETF analyst Eric Balchunas estimates there is only a 25% chance of SEC approval for a spot Ethereum ETF. He cites a noticeable absence of engagement from the SEC, contrasting with the Bitcoin ETF approval process. Balchunas interprets this silence as a deliberate ‘tactical’ decision rather than mere ‘procrastination.’\n\nJPMorgan analysts anticipate a protracted delay in the regulatory approval of the spot Ethereum ETF, though they suggest that approval could eventually follow a legal challenge similar to Grayscale’s lawsuit, which compelled the SEC to reassess spot Ethereum ETF applications.\n\nMeanwhile, Ethereum’s market performance has stagnated post-Bitcoin’s fourth halving, with its price staying between $3,100 and $3,200, according to CoinGecko. At press time, Ethereum is trading at around $3,100, down 1% in 24 hours."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE40NHdhWFRTekIzUnI2RGs4Qnk0SGVQV1VrakZmMGR0T1M3d3kyWm1aZ0N5el9ZcndJVnpIYUp4U0cyNjRCbXRKYlV1WTROQ2p4VkxVVFdhNk5tb2NUdWtGR1V4MUE1cDNCbGd0Wk5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: How to Trade ETH After Approval of Spot ETFs - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFAxM0djNFY5Ylo2ZGRFX0VlcGpndmx1ZkZxNkRuSU1LU2w3eXRCR2gyTE94SFQ4UGdmeWU5QWVaR0JhWnhIR3lOdzgzN2VkZUlkUXRiYl9UeDRWbS1maWFwUnVOVGNYRlpSM0c2YTc5SDlzRzAybE10bmlB0gF_QVVfeXFMTUFhMGM0ODJvbTJqRFNYOWUtb2JXTDlzeWswaWpNN2NfMG5HS1NWeEJtOXRwTk9WeE9GQUM0dG1kY2hlNnJtRl9ZWmM3THdHUWJXY29vVjkwbkNhaXZ2dnV5ZDEzMldrcm1iR0dRZEl5bk5wU1dheTNLWXlUdG1vdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Binance Seeing Ethereum Whales Outflow: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBinance has experienced significant outflows: 14,146 ETH, valued at approximately $46.74 million, within 24 hours. Notably, a fresh wallet also extracted 95.67 million USDT along with 7,402 ETH, equating to around $23.3 million. The activity mirrors the withdrawal patterns of two other wallets known for moving large quantities of ETH and stablecoins off the platform.\n\nAdvertisement\n\nThe smart money tracking service Lookonchain even raised a question: Could these transactions be linked to Justin Sun, known for his substantial funds movements, or are they simply routine redistributions? While the identity of the wallet owners remains unconfirmed, the movement of such large sums is not necessarily an alarm signal. It is often a simple transfer of funds.\n\nRecently, Binance has been witnessing continuous outflows and a dip in market share. This could suggest a trend of whales gradually reducing their presence on the exchange. It is important to consider these movements within the market's current tendencies.\n\nEthereum price chart suggests the second-biggest currency is currently in a mixed position. Ethereum's price appears to be consolidating with current support at the $2,900 level. If there is a potential growth scenario toward resistance at $3,400, ETH would need to maintain the current pace. A break beyond that could see Ethereum challenging higher levels, possibly around the $3,650 mark.\n\nAdvertisement\n\nHowever, if support at $2,900 is breached, Ethereum might face a slide toward the next support region near $2,800. Whales' actions, like those possibly associated with Justin Sun, can influence market sentiment, but the price chart suggests a steadiness that may not be easily swayed by individual transactions, regardless of their size.\n\nWhile the outflows from Binance and market share reduction could be part of a funds redistribution by large-scale investors, Ethereum's technical indicators and support levels remain mixed."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPRUJ3NVBZZHEyN09vZEd5SWl4Wk9TdmNDVnNQMUpORXNkWWM5a3NrWHlPNWk2TUxlU25OVEk0TTQtUU83bDY3NXViRW1OcmhubTlmdUs2bUJCb0x4Q1BfMU1zNlA1VzJ3LXVROG5JSUhMM0trQzdHdTZ2TkpjcVl1Vjd0WXZmQ1Y0elRhX0FRM1BvOVZNQWVobXlzUEJrcktCdEgwaktnSHZHZkpYSU0tSkR1aXJleVBlZHhWX3lBZkpmeDhJazlmQ21hNTRhQ1lxM2fSAdcBQVVfeXFMUG1ZWlYzWGFfWExFVTBxQzUzbUdKMVBQN2luRGtsTU1RbktzcmJGX1pleHp1QWJram9YR2FpU1poVnUwclJzQzg0bWt1eTdLYW0weFptYTE0ZUN6ZFhpdzhkeW95emFGZEhObWxpWXQyUENIRTd4dDlaOFdvSXo4UncxRGwybzZUb0dtYXhpalRlMmFDVVZXTnNVNTJYa1JvNmRja0xUTEZHUFc5T3FKdDlYaGZwZ1FydVp4VUhleEJCcW55SE5KS2RSTmFvNzUtU3FwcS01SzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Franklin Templeton’s Ethereum ETF listed on DTCC, no guarantee of SEC approval - FXStreet",
        "content": "Franklin Templeton has launched its Ethereum ETF coded as EZET, as seen on the DTCC website.\n\nFranklin Templeton’s Spot Ethereum ETF listing on DTCC does not guarantee S-1 filing approval by the US SEC.\n\nETH price is $3,125 at the time of writing, down nearly 3% from Monday’s close.\n\nEthereum (ETH) holders have long awaited the approval of the Spot Ethereum ETF by the US Securities and Exchange Commission (SEC). The firm’s ETH ETF, dubbed Franklin Ethereum TR Ethereum ETF was listed on the Depository Trust and Clearing Corporation (DTCC) website.\n\nSpot Ethereum ETF approval anticipation brews\n\nFranklin Templeton, the $1.5 trillion asset management firm has listed its Ethereum ETF on the DTCC website. The website lists the ETF and indicates that it is available for creation and redemption. The DTCC listing however does not imply an approval of the S-1 filing with the US Securities and Exchange. Franklin Templeton submitted its Spot ETH ETF application on February 12.\n\nEthereum ETF appears on DTCC website\n\nWhile not directly related to the S-1 filing, listing on the DTCC is a crucial step that allows for supply adjustment of ETF shares to help keep up with their demand in the market. It helps keep an ETF’s market price closer to its net asset value (NAV).\n\nIn previous instances, the website has listed securities that are eligible for trading and settlement once ETFs complete registration and compliance procedures. The SEC postponed its decision on Franklin Templeton’s Ethereum ETF application on April 23. The final deadline is now June 11, this offers the regulator an additional 45 days to make its decision on the Spot Ethereum ETF application.\n\nEric Balchunas, Bloomberg ETF analyst says that the chances of an approval by the SEC are 35%.\n\nETH price is $3,125 at the time of writing, down nearly 3% from Monday’s close."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPakludWU5V3htZ3hqX0xHdUpicEliNjlHSGdzRTBSZjJLSW9PVGNib0tvV3czVUlaUkRFR0FVU1NPa0cwMHBCbTJKS0pkQXN4V2o5UzlvRGZNSnRyY3ZOVTJ1MllvTW9SaVJJZk1PWmFsNHVzc3lQeFF4eTFMN2VnWmtRUFNBRlJxS2VYZGVCYkYySnhXM2tERnJ1LUllZzIyMVd1TtIBrAFBVV95cUxOY3p2LXlYWjVIYVpoTkxrUGMtM1o3d3hpMHdTd21aaDBCRmY5Ykl5QjJwOGhwRFlFd08tT2kxTzkwZ3VlQjkzWW9QS0YxSzVOczBGbDdpYk1taUFXamVMUlRFcUNneFJWTkQwQjU2cUgzQjVZQTI2d0I3b2lHZUxNMFRidXhQT2tLMXNXYnB6VVFKUFNkS2gtNllOTG0yakdxeElBLXpabFV5OUV6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "This Week on Crypto Twitter: Bitcoin Runes Mania and More Ethereum Legal Drama - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt\n\nCrypto Twitter this week was dominated by the industry’s new hottest topic, Bitcoin Runes—plus a steaming hot serving of legal drama in the form of a preemptive lawsuit filed by Ethereum software giant against the U.S. Securities and Exchange Commission (SEC).\n\nEver since Bitcoin’s latest halving, Runes—a new Bitcoin-based protocol that can support fungible tokens like meme coins—has surged in popularity. DOG, a new Runes meme token, was airdropped on Wednesday to holders of the Runestones Ordinal project. The distribution to tens of thousands of wallets immediately made DOG the most popular Runes token yet created.\n\nCheck your wallets! 100,000,000,000 $DOG has been successfully airdropped to Runestone holders. Shoutout to giga-chad volunteer community member @gm7t2 for flawlessly executing it. The journey to $1 has begun 🐕🚀🌕 pic.twitter.com/XPL7q6m7VG — Leonidas (@LeonidasNFT) April 24, 2024\n\nAD\n\nAD\n\nRunes fever took such hold over the cryptosphere this week that activity on the protocol quickly surged to dominate the entire Bitcoin network.\n\nBREAKING: Runes accounted for 72.7% of all Bitcoin transactions in the past 24 hours — Ord.io (@ord_io) April 24, 2024\n\nSome crypto users bemoaned the spike in Bitcoin network fees caused by the Runes frenzy. But other protocol supporters remained steadfast in their conviction that hype around the new class of tokens was only just beginning.\n\noverwhelmed by the number of absolute mid curve takes from people who are fading runes. “sit on your hands for now see how it goes” “all these tickers suck” “the fees are too high for meme coins” bruh you will be buying rune 1 from me for 100x sooner than you think. EZ game. — faXx 🎈| 824.eth (@faxx_eth) April 24, 2024\n\nOver on Ethereum, bullish news was found this week in the eye-popping, multi-million dollar sale of yet another CryptoPunk NFT. Punk #635, an ultra-rare Alien Punk, sold on Thursday for a whopping $12.38 million to an anonymous collector.\n\nAD\n\nAD\n\nThe sale marked the third occasion within weeks that an Alien Punk had traded hands for north of $11 million.\n\nCryptoPunk 635, the Alien originally owned by Larva Labs and sold at the Christie’s Contemporary Art Evening Sale in May 2021, has just been acquired by an anonymous collector in a deal brokered by Fountain. We’re honored to have played a small role in this sale. Congratulations… pic.twitter.com/glisy3MZpv — Fountain (@Fountainxyz) April 25, 2024\n\nIt wasn’t all smiles for everyone in the Ethereum NFT ecosystem, however. On Friday, Yuga Labs, the multi-billion dollar company behind the once-dominant NFT collection Bored Ape Yacht Club, laid off an undisclosed number of employees. In a message to employees, the company’s CEO and co-founder, Greg Solano, conceded that the company has “lost its way.”\n\ngm, really tough day today. I am hellbent on transforming yuga and getting us back to our roots, and that means making hard decisions. by far the hardest is saying goodbye to some talented team members. here was my message to the team this morning. pic.twitter.com/gBkoNf2iK3 — Garga.eth (Greg Solano) 🍌 (@CryptoGarga) April 26, 2024\n\nThe biggest bombshell of the week, however, came on Thursday, when Ethereum software giant Consensys revealed in a proactive lawsuit against the SEC that the federal regulator is allegedly seeking to sue the company and potentially declare Ethereum to be a security in the process.\n\nToday, Consensys filed a lawsuit against the Securities and Exchange Commission. The goal behind this is to ensure that Ethereum remains a vibrant and indispensable blockchain platform and to preserve access for the countless developers, market participants, and institutions… — Consensys (@Consensys) April 25, 2024\n\nIndustry leaders immediately took to Twitter to vocally support the suit, castigating the SEC for potentially attempting to effectively outlaw Ethereum after several other American government entities have indicated that ETH is not within the SEC’s jurisdiction.\n\nI know ETH is a commodity. You know ETH is a commodity. The CFTC knows ETH is a commodity. It's time for the SEC to admit that it still knows ETH is a commodity too. No more games. Thank you to @Consensys for standing up against the SEC's unlawful expansion of authority. https://t.co/8w7A4PBwUK — paulgrewal.eth (@iampaulgrewal) April 25, 2024\n\nAD\n\nAD\n\nHayden Adams, founder of decentralized exchange (DEX) Uniswap, likened the suit to a battle cry for the crypto industry to finally take an aggressive, collective stance against the SEC in a Lord of the Rings-esque battle. Uniswap revealed earlier this month that it, too, is being sued by the SEC for alleged securities violations.\n\nSue the Exchange Commission Thanks @ethereumJoseph and @Consensys for fighting back and defending our industry We're tired of the overreach and harassment https://t.co/yDTjjiaJWl pic.twitter.com/vtWxqKxv9n — hayden.eth 🦄 (@haydenzadams) April 25, 2024\n\nDisclosure: ConsenSys Mesh is one of 22 investors in Decrypt. Edited by Ryan Ozawa."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxORHNFclhpQ0dKYjRyTG9GS3BSNW9oRWJaSlNyekp5LTY5b1EzcllfdFUyVnY3dnlZR3N3d3VEcmlpc3VIc1FXVXRMTGxQbVQxMl9lMkc5U28yY2puQXVtbnRpeVRDT0RUbzNCNEZ4S2dQVmRidzBlN1dPYXYzSlFyM1lfMknSAYoBQVVfeXFMUFp6aUV5d2dQT3gzZUdJNW5qTkFlUnRZS0FXRlpiQkEzMmpYaXJNNnBCbnVDaVN1T29TYVdaSThwNXRONkZIdVhCOGxubS1melBLT1dBWjVnMnZxSFJlbG5IMG5SUkc2blhsTDZ4T1puTkh0OGk0Y0JlaThmblRWU2htRGZQbHJoUl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum responsible for the delay in altcoin season? - AMBCrypto News",
        "content": "The Altcoin Season Index at 35 suggested that the many tokens were not out of depression.\n\nA decline in ETH’s network growth and volume might hinder the upswing.\n\nIf there is one phrase that has been trending in the market for months without almost nothing to show, it’s “altcoin season.”\n\nFor the anticipated period to come to life, Ethereum [ETH] and other non-Bitcoin [BTC] cryptocurrencies have to outperform BTC.\n\nBut that has not happened. In fact, AMBCrypto’s analysis of Blockchaincenter.net revealed that the time was not close. According to the platform, the Altcoin Season Index was at 35.\n\nAlts fails to sustain the preview\n\nTo confirm an altcoin season, the reading has to be at 75. Interestingly, the index hit this height in the last week of January, and the first week of March. But it melted away within days.\n\nA look at tokens like ETH, Cardano [ADA], and Ripple [XRP] showed that their prices decreased in the last 90 days. Unless 75% of the top 50 cryptos outperform BTC, there will be no altcoins season.\n\nConsidering the press time circumstances, one can assume that the period was not close. Apart from the index, one factor that could determine is ETH.\n\nIn 2021, the surge in Ethereum was one of the first movers that activated the price increase that many altcoins experienced.\n\nNotably, less than 20 altcoins out of the top 50 have outperformed Bitcoin in the last 90 days.\n\nBut ETH was not part of them. Furthermore, the cryptocurrency has not been able to make the kind of moves it did in the last bull market.\n\nETH dashes the hope\n\nHowever, if demand for ETH surges, the condition might change, and the price of the token might climb to test its all-time high. For this to take place, a lot of new addresses have to come into the Ethereum network.\n\nTo track this, AMBCrypto looked at network growth. At press time, network growth on Ethereum was 3131, suggesting that the adoption of the cryptocurrency has been unimpressive.\n\nIf the metric continues to decline, ETH’s price might find it challenging to move northward. In this case, altcoin season might continue to be delayed.\n\nOn the other hand, a surge in network growth might spark a rally for the cryptocurrency and other top tokens. In the meantime, an assessment of the volume showed that it was $10.31 billion.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAt the beginning of ETH’s rise to its all-time high, the volume was over $40 billion. Rising volume indicates interest in a cryptocurrency. If consistent, it could lead to higher prices.\n\nWith the low volume, a notable price increase for the altcoin could be unlikely over the next few weeks. In addition, altcoins might need to look away from waiting for ETH before going on months-long rallies."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOWjJ4RXlwaW9UMUVmS2hUMm1NMzh1RGZJYmF1VF9FMDlFRHZSMERibEJXTFRXa2V6ZEpOcVp1TV9meDM3Z2taZG95cEVLTFhWUkFhN1VqOTNJNlFFN3VFRUNLcUp3ZXZhZDc3T090VFhNTE53ckZ0M3NIMGM0MzV5dVIzZEzSAYoBQVVfeXFMTzlMU25HMkw1MGFXaVlSa1ZaXzE1UnFiS3p5Y1VMaUpXZ2ZBWmJDelI0SzcteW9UUVdFT3dBWXBJeTN4OF9VNE1VVmJmYjY1TUlMTU1LTHh0b1ZxMC1vM1FjMHBuT2J1M2FlTlgzVW1GSUZvOHhpQmJDcFlvVmVNazdMbkNGY3R1TzNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Best Time To Buy Longs In Bitcoin (BTC) and Ethereum (ETH): QCP Capital - CoinGape",
        "content": "Crypto trading firm QCP Capital on Friday recommended buying Bitcoin and Ethereum, saying “If you are still a bullish believer, a consolidating market could be the best time to accumulate longs.”\n\nBitcoin and Ethereum prices are consolidating near $63,000 and $3,100 levels for a massive rally this year. Santiment reported that Bitcoin active wallets are rising quickly despite choppy prices.\n\nadvertisement\n\nBitcoin and Ethereum Fall Raises Questions\n\nPost-Bitcoin halving performance of Bitcoin (ETH) and Ethereum (ETH) prices raised questions of whether the market has lost faith or is this just a short pause in a longer-term bull run.\n\nQCP Capital, a Singapore-based digital asset trading company, in a new trade idea on April 27 noted the volumes in Bitcoin and Ethereum options have compressed drastically. This week, heavy selling of BTC options has seen the vol curve collapse, with Bitcoin vols further compressing from 70% to 50%. The company added that if people are looking to buy BTC and ETH, then this consolidating market is the best time to accumulate longs.\n\nOther the other side, the downside skew in Ethereum (ETH) risk reversals has also dropped further to -13%, said QCP Capital. This could be due to recent reports of SEC possibly denying or further delaying spot Ether ETF. According to people familiar with the matter, the SEC and its staff have shown no interest in the spot Ether ETF and its potential. Four people who participated said the discussions were one-sided.\n\nAlso Read: Shiba Inu or Dogecoin: Which Is Better & Likely to Outperform This Year\n\nHong Kong’s Spot Bitcoin and Ether ETF Going Live\n\nSpot Bitcoin and Ether ETFs to begin trading in Hong Kong on April 30. QCP Capital says this is potentially a big positive catalyst next week as Hong Kong financial industry joins other financial markets such as the U.S. and Europe to invest in spot Bitcoin ETF.\n\nExperts predict market reaction similar to the United States, which saw massive buying by institutional investors. Interest is growing in what could be a gateway for the inflow of Asian institutional capital, said QCP Capital.\n\nQCP Capital suggests BTC Accumulator and ETH Accumulator strategies for options traders, which a weekly buying call at a discount of the spot prices of BTC and ETH.\n\nBTC price fell over 2% in the last 24 hours, with the price currently trading under $63,000. Meanwhile, ETH price trades at $3,116, down more than 1% in the past 24 hours.\n\nAlso Read: Bitcoin ETF Records First All Net Outflow Of $83M Since Launch, Bitcoin Bottomed?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE02SEoxWHJGNzN1bDRJWjlHZlpsVklISFQ1VTFRdW4wYndreGVVYkdZd1FYTGk4Zk5FV2FNQ0FnQmt5WmtsSnE0WXFKdkRMOXdPUWJ1OGx4bzltdUdMQ25NY083eDg5Z3RKdDZmXzA1aFJ3c0ZVT0ww0gF8QVVfeXFMTjNvbjJ6MkVWN3dOXzMxOXdueTZXZkFSb0Y2UmhrbDhWTndKTUE5OWJHUHhzWWE3c0U4amhkc2owSTNTRmZXUURFZXo2dTJvR0MwM1VWY3hheEtCTlU4QzlLMGE0TTRKc3pGNG1aT09abnRQZzVJaktSV3d3WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Crushing Bitcoin (BTC) with 6% Price Spike - U.Today",
        "content": "Advertisement\n\nThe price of Ethereum , the second-largest cryptocurrency, has surged more than 6% over the past 24 hours.\n\nETH is currently trading at $3,320 on major spot exchanges, according to data provided by CoinGecko .\n\nBitcoin's dominance is currently sitting slightly above the 50% level.\n\nThe ETH/BTC pair is currency sitting at 0.051 BTC after peaking at 0.052 BTC earlier today. The pair is now up nearly 13% over the past two weeks alone. However, the pair is still down 15% from its 2024 peak of 0.061 BTC that was achieved on Jan. 12.\n\nAdvertisement\n\nA major resistance level\n\nAccording to the 100eyes Crypto Scanner account, the second-largest cryptocurrency has now approached a key horizontal resistance at the $3,300 level.\n\nThe largest altcoin came close to surpassing this resistance level on Apr. 24. However, this attempt resulted in a significant correction.\n\nMajor headwinds\n\nEthereum's price recovery came despite the fact that Consensys, the key backer of the second-largest cryptocurrency network, recently sued the U.S. Securities and Exchange Commission after receiving a Wells notice from the regulator.\n\nThe SEC wants to expand its jurisdiction by classifying the flagship altcoin as a security, the firm alleges.\n\nConsensys has already hired some of the best lawyers from Manhattan-based firm Watchtell, meaning that the industry is about to witness another contentious legal battle.\n\nMoreover, some analysts believe that the SEC could potentially face another lawsuit from Grayscale over its refusal to approve a slew of spot Ethereum ETFs in May."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOQTJkTmJMdWN4dHprMVhZX2VBeTBBenlOQnFCQnVjWE5NeEVvelh4alA5Tnd4WUhxS1otRy1icTgweGFtWlJDNWxwZmtUdUVjVkI0LWY3OWowR0J1MHFpMkVrT2NRd0p0Qm95V2hJUnRjQ1o5RlFEOXpxMktwQ0M4aUpqYjMycHpWM2RhOEJnRExpZVRKcVlKNDZFTExBc3pZQkF5VHpaZ1c2V2hWdVNTSkhaNzNaaEx1WFUtVjB0SFB2MFhHbmpUYTNxQkNRYVXSAdQBQVVfeXFMT3JzWGE3d3B2S2dMc29SMmdfb3RidzZmM2xtUlVueEtKV0ozelk1T3JPZ1VRamtuSE1aMWFsam5maFBncmRWNS1WcDZ2cXJLNm51bHh3bW9YdklwRGNaU0NrOG5kNDlGTXdrMmR0TFFCSjBGMkhGdnYtZE1IaXVlNGY0amxaNXNjVFJjckRhdG9yVm8tVWhjUzFvSWdKSVlVdTNzOVVVQVpvN1QzN2V2WEFnM2VSTzF2cmhyN2Z3RUlTREdTR1hldUtKVFI2azB0VXhQVk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum fees drops to lowest level since October, ETH sustains above $3,200 - FXStreet",
        "content": "Ethereum supply is inflating despite relatively high throughput.\n\nAverage fee has nosedived to $1.12 per transaction, lowest since October.\n\nEther sustained above $3,200 on Sunday, up 4% in the past seven days.\n\nEthereum’s high transaction fees has been a sticky issue for the blockchain in the past. This led to Layer 2 chains and scaling solutions developing alternatives for users looking to transact at a lower cost.\n\nThe issue seems to have de-escalated with Ethereum’s average fee level dipping to $1.12 per network transaction. This is one of the lowest levels noted since October 18.\n\nEthereum transaction fee declines\n\nData from Ultrasound Money shows that Ether’s circulating supply has surged, climbing to the highest level witnessed since March. A little over 120 million Ether is in circulation now and the sharp increase in supply can be attributed to the consistent decline in burn rate, in the past two weeks.\n\nGas fees is currently 7.19 Gwei, up from a low value of 4.48 Gwei, as seen on Ultrasound.money. Gas fees is currently $0.62, as seen in YCharts, down from the May 2023 peak of $3.788.\n\nEthereum gas fees\n\nThe Ethereum supply chart shows inflation, and the recent increase sprung on ETH holders as a surprise, after five months of steady deflation. The ETH supply chart below shows the sudden increase in supply.\n\nETH supply\n\nThese catalysts have failed to have a significant impact on Ether price. The altcoin has sustained above $3,200 on Sunday, after relatively less significant moves since the Bitcoin halving. ETH holders are awaiting the Securities and Exchange Commission’s (SEC) decision on Spot Ether ETF and this is likely to emerge as the most significant catalyst for Ethereum."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZEEybkpZTTI1VHNrbVg4N0V0bzBPQWZZTFlubnZTanJadlVSNmRfQkVYRXA5TGpaaHZIaDRNWVJqNmhvbll0SThFTFp3ZHNjOGlMMGZFT1VZYXFlSnVMQ0toaFFuUkhJQTRDUWVjQUJQdi0tdnVFQTJxNUxRVTJJS3VkczJXbDRrTEJ0M9IBkgFBVV95cUxNTk9NbnNDUDVvaDdycXJvcGxyQTVadVRmRlNRQTdBczAwVWhnLS1sMi1lOWZqOHdVcWk4S0pWNlhya3N3UFQ4RUo0OWFUWFJOb3F4NGQ0MzdEVFBmWTRTMk1kRE9tMnJ4UDQ4X2Q3a0MzMzRRX3VTbEJfcWI0U3gyakxMMEhBU3pGTkQ0VFc4dFhidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum & Consensys vs SEC – An ‘unlawful power grab’ or a ‘cover-up?’ - AMBCrypto News",
        "content": "Consensys sued the SEC in Texas over Ether’s classification\n\nOrg has challenged the SEC’s allegations, while advocating for fairness and clarity\n\nWith the debate around Ethereum’s [ETH] possible classification as a security becoming long and tiresome, Consensys, a blockchain software giant, recently made news. It did so by taking a bold step and initiating legal action against the United States’s SEC and its five commissioners.\n\nLaura Brookover’s insights\n\nRemarking on the same, Laura Brookover, Senior Counsel & Head of Litigation and Investigations at Consensys, on a recent episode of “Unchained,” claimed,\n\n“I never expected to one day be suing the SEC, but here we are. We’ve sued the SEC in our home state of Texas to defend Ether and the Ethereum network from Chair Gensler’s unlawful power grab.”\n\nShe added,\n\n“It’s really time they saw the light of day because these are important critical issues for our industry.”\n\nAccording to the exec, the SEC is not only targeting Consensys’s product – Metamask, but also their finance team. They are doing so by asking about the sales of Ether and Ethereum developers.\n\nShe went on to say,\n\n“If Chair Gensler gets away with misclassifying Ether as a security it’s really catastrophic in the United States.”\n\nConsensys’s defense mechanism\n\nWhile highlighting the fundamental differences between proof of work and proof of stake mechanisms, Consensys has consistently refuted the SEC’s potential theory that staking turns Ether into a security. In fact, Brookover went on to challenge the SEC’s differentiation between Bitcoin [BTC] and Ethereum ecosystems, claiming,\n\n“There’s really no reason to treat them differently, it’s arbitrary. So, I think that’s one of the things we’ll probably point to, as showing that the SEC really has no basis here.”\n\nThat’s not how everyone feels though. For instance, according to crypto-lawyer Bill Morgan,\n\nOn the contrary, Steven Nerayoff, a former Ethereum advisor, believes that Ethereum has functioned as a centralized entity since its ICO and thus, warrants classification as a security. He added,\n\n“This move is to distract people from the truth and just another cover-up.”\n\nThe Wells Notice\n\nWhile discussing the SEC’s Wells notice targeting Consensys for allegedly operating as an unregistered securities broker, Brookover highlighted Consensys’s metamask swaps and staking features. In contesting this accusation, she argued that Metamask serves as a communication tool for liquid staking protocols, rather than engaging in securities distribution.\n\nErgo, Brookover is optimistic that a successful outcome in the lawsuit would provide much-needed clarity to the regulatory uncertainty surrounding cryptocurrencies."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQMWhBMTEtek5KY084VWhXcEs3dWFQSW52SU1VaDJlQUZuY2pyZ1hteUhtcjJpdENia2FCSzM1VEttMFBIQk5PUTlvd2RSOW9IbVdDZGdEeUpOS1AyVXhid3NUR0NZdmFMV3A5UU1Va2kxTDV3TmFMRnp0c0dkSFJtZVpXa2g1QmV5MHJnLWlyTDlzSjJ0QnFN0gGcAUFVX3lxTE1SZWVreUNMNHNadjZfb1JRc0pueWtYQVlSdjR3dUh2dmVpS3I2a01xTEUzNU1hTXZIUnl0TGlxNEY1dXJ3R25lWi0zcWtRVHRMN3U1aGZmT3ZFMWlNaHBJdEZwSjluY182WTc1M0NrUGRSR2dMbHh2ZWd3azB6MFJVUzlMNlRNbjJXdElYTUFtMFl4Rkk1dnlqTEUzdQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s correction – $2,700 and ETH price’s other targets if it falls again - AMBCrypto News",
        "content": "Selling pressure on Ethereum rose over the past week\n\nMost market indicators looked bearish on ETH’s charts\n\nEthereum’s [ETH] price managed to climb past $3.2k last week. Soon after, however, the altcoin turned bearish as ETH was unable to hold its position on the charts. Given how everything has panned out, if the worst scenario is to be considered here, ETH might fall to its $2.7k support level.\n\nMore red for Ethereum\n\nAccording to CoinMarketCap, ETH’s price appreciated by 2% last week, allowing it to go past $3.2k on 24 April. However, the uptrend didn’t last long as its price dropped over the last 24 hours. At the time of writing, ETH was trading at $3,118.13 with a market capitalization of over $380 billion.\n\nAccording to IntoTheBlock’s data, 79% of Ethereum investors are still in profit. The decline in ETH’s price also affected its social volume negatively. Additionally, after a spike on 25 April, its weighted sentiment dropped on the charts. This alluded to bearish sentiment around ETH being on the higher side.\n\nThings can get worse, however, as if ETH records more price corrections, its value might drop to the $2.7k support level in the coming days, as per a recent tweet from Crypto Tony, a popular crypto analyst. The possibility of ETH hitting that support level would increase if it fails to go above $3.6k.\n\nTherefore, AMBCrypto took a look at Santiment’s data to see whether metrics seemed bearish.\n\nWe found that selling pressure on the token has been increasing. This was evidenced by the hike in its exchange inflows over the past week. The fact that selling pressure was high was further proven by ETH’s supply on exchanges, which rise.\n\nOn the contrary however, whales remain confident in ETH as its supply held by top addresses went up.\n\nEthereum’s immediate support levels\n\nAMBCrypto then checked ETH’s daily chart to find whether a sustained downtrend is inevitable or not. We found that the Money Flow Index (MFI) went north – A sign predicting a price uptick.\n\nNonetheless, the rest of the indicators seemed bearish. For instance, both ETH’s Relative Strength Index (RSI) and Chaikin Money Flow (CMF) headed south, meaning that the chances of a further price drop were high.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nFinally, AMBCrypto’s analysis of Hyblock Capital’s data revealed that ETH has a strong support level near $3.1k if a price correction happens.\n\nA drop below that level could result in ETH plummeting to $2.8k before it reaches its tested support level at $2.7k in the coming days or weeks."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVFkxNFJOZnIzS0R0Uy1oVlJPajlIcUFzX251SlBLbUI4ZVdSQndFQ1gxc2NoTTRVaEFobHNGOWNZclhrWGtMWjRkd3BsQ1l6MUFSQW9QVzYtMEJLTjEzMXZUaHlHQnctMlpyZmktYk05dWtxMzN0ZHZmX2oyc3pvLUtEWktTTG84eWd1VjEtaVhZMC1H0gGaAUFVX3lxTFBIYktnbkpQSlN2UW1LNUFIVlNuYzViUjdJQ1FYRGhBWVRoNnExWDlBQkowR09OYzdqTHBrTm5Xa2U4cnFaenVMOTZMVFNBbmpwT2xxQkROZFlNdkczVWZjbzNIeDJuUTlQaEJSYk1PQnowTEpvQ2JMR01JeDI5emFsSEZQWmtMeVZDdE1WcnprbnZvcl8wMUlDbFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Polkadot vs Ethereum, BNB Chain – Here’s what the stats are telling you - AMBCrypto News",
        "content": "Though dev activity dropped, Polkadot’s network activity hiked on the charts\n\nA trend reversal could be on the cards for DOT’s price action\n\nPolkadot [DOT] has been renowned for having robust development activity consistently over the years. However, as per recent data, other blockchains like Ethereum [ETH] and BNB Chain have emerged to overtake its levels over the last few days. While this shift happened, DOT’s price action turned bearish on the charts.\n\nPolkadot’s development activity drops\n\nCoin98 Analytics recently shared a tweet mentioning a list of blockchains ranked in terms of their development activity. As per the tweet, Polkadot registered 827 developers last week, with the blockchain witnessing over 5000 weekly code commits.\n\nThough the number by itself wasn’t low, it was lower than other blockchains. For instance, ETH had more than 2000 weekly developers who executed over 19,000 commits. Polkadot was also behind BNB Chain, whose weekly commits exceeded 6,000.\n\nOther blockchains that outshined DOT were Polygon [MATIC] and Optimism [OP], whose weekly commits stood at 6,300 and 5,200, respectively.\n\nAMBCrypto’s analysis of Santiment’s data also revealed a similar story. We found that DOT’s development activity dropped sharply over the last seven days. However, despite the drop in dev activity, the blockchain’s dev activity contributor count spiked multiple times last week.\n\nHere, it is interesting to note that while the blockchain’s dev activity fell, its network activity registered a massive spike last week.\n\nAMBCrypto’s look at Artemis’ data revealed that after several days of dormancy, DOT’s daily active addresses shot up considerably on 24 April. Thanks to the rise in active addresses, its daily transaction count also followed a similar trend.\n\nBears are attacking DOT\n\nIn the meantime, Polkadot bears buckled up as the token’s price dipped on the charts. According to CoinMarketCap, DOT lost more than 1.5% of its value in the last seven days. In fact, in the last 24 hours alone, the token’s value dipped by 2%. At press time, DOT was trading at $6.70 with a market capitalization of over $9.6 billion.\n\nDOT’s funding rate has risen over the last few days too. This is a bearish development as prices tend to move in the opposite direction from the funding rate.\n\nNonetheless, Polkadot’s open interest also went down. A decline in the metric is a sign that chances of the ongoing market trend changing are high.\n\nRead Polkadot’s [DOT] Price Prediction 2024-25\n\nDOT’s Money Flow Index (MFI) also registered a sharp uptick and was heading further above the neutral level, suggesting a possible price hike.\n\nFinally, as per the Bollinger Bands, DOT’s price was resting under its 20-day Simple Moving Average (SMA). A successful breakout above that level could result in a fresh bull run for the altcoin on the charts."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNNVNRb2JPcFRtT2ljcU1xa2NFNGU5ekQtTjdaTGJfZXYwaDltOTNrWlJENHF0aTJOQjlCb0NwR2FNenl6aTdOa0pIU1JKS0ttRzkyZFk5RXlER2NNaXJBemktdHU5TVo4YTlfcGpkUzhlZVF3MkZpOXU4dldET081emNiVHlTUENSSVVEcjlqUnhyZWQzOGhvWTBzMF9Qa3QxclFiTm1VeWV3RkVQN1I0dzVjWGFhT2PSAbwBQVVfeXFMTmNZUkJ2S3NyVzQ1bERqNklZQkp3SV9jUEFzNk5CYXJvNE1kaFNFRG5XcVpxMjZHcWNfaXFvQTVkR2dFQzhZMDdGRHlQTHpxc1FZWDV5Z2JTUHNobldUZlpjTXlOVFFMblZpS3k0VXZ2QnR5ZTNaaGh3aWN2YTNpS0RBUXdqVzlqdlA3VjFRQXJuNnFFNm5mY28xbWEtR0xUdENNcjBXTHN3MlhkenlCNVRHYmswdDZZazAwVkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, And XRP Price Prediction: Will Bulls Make A Comeback This Week? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nDespite increased price volatility in the cryptocurrency industry post-Bitcoin-Halving, the top tokens constantly display a neutral sentiment in their respective charts, indicating uncertainty in the market’s future course.\n\nMoreover, the mid-cap and low-cap altcoins have experienced the highest gains since Halving, highlighting a high possibility of a switch of investor’s interest toward other projects to maximize their profits.\n\nWith the current market sentiments, will the industry leaders Bitcoin, Ethereum, and XRP tokens record a comeback during the coming week?\n\nBTC Price On The Verge Of Testing Its Major Support:\n\nThe market leader, Bitcoin price, has recorded a neutral sentiment post-halving by losing approximately 2% within the past week. Moreover, it continues to trade in a consolidated range between $61,025 and $73,754 since the start of March, indicating a weak price action for the BTC price.\n\nTradingView: BTC/USDT\n\nDespite recording a correction of 10.45% within the past 30 days, the Bitcoin price has a Year-to-Date return of approximately 50%, indicating a high possibility of a bullish price action in the long-term perspective.\n\nThe technical indicator, MACD, displays a constant red histogram in the chart, highlighting a strong bearish influence in the crypto space. Moreover, the averages show a downward trend, suggesting the price may continue losing value in the coming time.\n\nIf the market experiences a bullish reversal in the chart, the BTC price could attempt to achieve a new all-time high (ATH) of $80,000 during the coming month. Conversely, bearish price action could result in Bitcoin price testing its low of $61,000.\n\nAlso Check Out : Bitcoin (BTC), Ethereum (ETH) and Solana(SOL) Price Prediction For This Week\n\nETH Price Forms A Bearish Pattern:\n\nThe Ethereum price continues to hover close to its support trendline within the symmetric triangle pattern, highlighting a strong bearish influence in the crypto space. Moreover, the EMA 50-day acts as a resistance trendline, resulting in the ETH token trading close to its crucial support of $3,150.\n\nTradingView: ETH/USDT\n\nAfter trading under a bullish influence and recording a yearly top of $4,094, the leader of altcoins, the ETH token, has recorded a correction of 23.76% in valuation. However, Ethereum price has a YTD of 36.86%, highlighting a positive outlook for this altcoin in the coming time.\n\nThe Moving Average Convergence Divergence (MACD) shows a constant flatline in the chart, indicating a weak price action for the leader of altcoins in the market. Furthermore, the averages show a neutral sentiment, indicating uncertainty in future price action.\n\nIf the bulls break out of their resistance zone, the ETH price will regain momentum and attempt to test its upper resistance level of $4,000 during the coming month. However, if the bears overpowered the bulls, the price will fall toward its low of $2,630.\n\nWill XRP Price Ever Rise Back Up?\n\nThe XRP price has leveled all its gains post-halving, indicating a bearish price sentiment in the crypto industry. Furthermore, the Cross EMA 50/200-day shows a Death Cross in the 1D time frame, highlighting a high possibility of a bearish price action for Ripple token in the coming time.\n\nTradingView: XRP/USDT\n\nThe MACD displays a constant green histogram, indicating an increase in the buying pressure within the crypto space. However, the averages show a constant flatline, indicating a mixed sentiment in the crypto industry.\n\nIf the market pushes the XRP token above the resistance level of $0.5340, the bulls will regain momentum and prepare to test its upper resistance level of $0.60 during the coming month. Negatively, if the bears continue to dominate the market, it will plunge and fall to test its low of $0.47.\n\nRead Also : Bitcoin (BTC) Price Might Drop Below $50K Level: Here’s Why"
    }
]