[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT3JFWTFBSWpjNE84T09xUTRTTThQMTI3ZEh0dHlUaEIzZXNhV3Q3UFdld2dDN0liY3J3Qmppel92OEhMb2lwTGppVnFfVlViMWVEdlpESGlRcFB3WnFmcGFzLUxqaEJZOVJsVlVNbXVSMTY0TDZrYmpmbk1lOFJRT2JsLWNta09JZlRoVk1kRWVjTzV3SGRyem1DdnBJdFdrRUlR0gGrAUFVX3lxTE5kWHZiekZnZXhHR3RXdExLSnFIeER0dmhxaFBTXzlwTDhMdnRCblFFazdEb1BRM3FhU01Uemh0S2R4aHYtSnMyeWN5YUsweE1tbXIydkdDT3NkRVQ4cGsyVUlwM1pLdGw3NWhrNFE4RWJyRFdMd1dXNTNoTmstd3BLTENhVVRZNmhENWUzMjlrYjVEMlZSZjQtUGk5NERaUktJWnloVEZTMFVMWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Could Top $14,000 Next Year Alongside Bitcoin Boom: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational Standard Chartered isn’t just bullish on Bitcoin—Ethereum is also going to the moon, its analysts say.\n\nA Monday report from the bank claimed that the second-biggest digital asset could hit $8,000 by the end of this year, and $14,000 is possible by the time 2025 is up.\n\nIf, that is, spot Ethereum exchange-traded funds (ETFs) get approved, Geoffrey Kendrick, head of forex and crypto research at the firm, said in the note.\n\nThe price of Ethereum is currently hovering slightly above $3,500 per coin, CoinGecko data shows.\n\nAD\n\nAD\n\nSeveral high-profile fund managers have filed paperwork with the Securities and Exchange Commission (SEC) to release Ethereum ETFs. Such investment vehicles would expose traditional investors to the cryptocurrency via shares that trade on a stock exchange.\n\nKendrick wrote in the note that the bank expects the ETFs to get the green light from the SEC by the summer.\n\n“Ethereum is currently between two important events that we see driving price upside,” wrote Kendrick. “It has just had a structurally significant upgrade, and U.S. regulatory approval of ETH ETFs is expected in May.”\n\nKendrick also said that the network’s recent Dencun upgrade could be the reason for Ethereum shooting up rapidly.\n\nAD\n\nAD\n\nThe network behind the second-biggest cryptocurrency was upgraded last week. Developers say the improvement will make transaction fees on the blockchain super cheap.\n\nKendrick added that the upgrade and lower costs on the network make Ethereum “more competitive.”\n\nStandard Chartered said in a different research note Monday that Bitcoin could hit $150,000 per coin by the end of this year if the newly approved ETFs continue to be popular.\n\nIn January, the U.S. Securities and Exchange Commission approved 11 of the investment vehicles.\n\nThey have so far been hugely popular with investors—and the massive inflows have pushed the price of Bitcoin up significantly.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTkFjSVUySnhTNmNaSHJuazVQazhpYzdrb0JLTFBOSGI4dnFLUjNTZzQ4cUpMVk9EX2pwd0lyTWQ5VFRTcjJRYnFsVjdhenhsd3J5RFhUR3RFT2RaZFdxZngyV0N5ZFFQVkRmOWNjLUF2QVN6UFZLSGVXUzZtOVlNZ0hkVGFGRnRCc0NuYVBvTjFXWG4tQk80?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Could Ethereum Hit a New All-Time-High of $5,000 by the End of 2024? - The Motley Fool",
        "content": "Ethereum has two solid catalysts in place for 2024, but will they both deliver as planned?\n\nNow that Bitcoin (BTC 0.30%) has hit a new all-time-high, could Ethereum (ETH -0.08%) be next?\n\nCurrently, Ethereum is trading at just under $4,000, within striking distance of its all-time-high of $4,891.70. Given that Ethereum is already up about 70% for the year, it wouldn't seem to require much for Ethereum to rise another 25% before the end of 2024.\n\nAnd indeed, there are two potentially major catalysts in place this year. If Ethereum is going to soar to an all-time-high of $5,000, it's likely that both of these are going to be needed. Let's take a closer look.\n\nNew tech upgrade\n\nThe first major catalyst is a brand-new tech upgrade (Dencun). It is the biggest change to the Ethereum blockchain since The Merge, which took place nearly 18 months ago. So understandably, analysts are getting excited about what this new upgrade might mean for Ethereum's growth prospects.\n\nThe Dencun upgrade has two major goals: to improve the scalability of the Ethereum blockchain (which can still suffer from congestion and slow throughput times), and to lower the costs of transactions within the Ethereum ecosystem. If Dencun can deliver on both, it would help to cement Ethereum's role as the preeminent smart contract platform in the world. Even better, Dencun is setting the stage for Ethereum's next upgrades, all of which have been carefully laid out by Ethereum co-founder Vitalik Buterin in the blockchain's latest annual roadmap.\n\nSo far so good, right? You have a tech upgrade promising major performance enhancements, and you also have a roadmap for future growth. But not so fast. A number of blockchain analysts are taking issue with the Dencun upgrade.\n\nAs they see it, Dencun is not a long-term fix because it relies too much on third parties (known as Layer 2 scaling solutions) to make all the performance enhancements work. In a worst-case scenario, reliance on these Layer 2 scaling solutions could lead to all kinds of interoperability issues, fragmentation within the Ethereum ecosystem, and a loss of cohesion among Ethereum developers.\n\nSpot Ethereum ETFs\n\nThe second big catalyst is the potential launch of new spot Ethereum exchange-traded funds (ETFs) as early as May. Given all the enthusiasm and excitement around the spot Bitcoin ETFs, it's easy to see why a new spot ETF investment product could send Ethereum soaring.\n\nAs in the case of Bitcoin, it would become remarkably easy for any investor to buy Ethereum. If these investors decide to allocate even 1% of their portfolios to Ethereum, that could send the crypto soaring.\n\nThe only problem, from my perspective, is that analysts seem to be vastly overstating how easy this process is going to be. As they see it, the Securities and Exchange Commission (SEC) has already bought into the idea of spot ETFs for cryptocurrencies, and thus, new approvals are going to be coming on a regular basis from here on out.\n\nBut what they fail to take into account is that the spot Bitcoin ETF process took years to achieve, and only after very specific milestones had been met. Even up until final approval in January, there were serious doubts about the SEC finally approving them.\n\nAnd we're starting to see the same thing with the spot Ethereum ETFs now. The probability of an SEC approval taking place in May has recently been lowered from 70% to 30%, according to a top Bloomberg analyst.\n\nThat's because the SEC has maintained what can only be described as radio silence ever since the spot Ethereum ETF applications were filed. There has been no outreach to the investment firms trying to bring them to market, and no indication that regulators are now ready to sign off on other cryptocurrencies beyond Bitcoin.\n\nIs the glass half-full or half-empty?\n\nIf you're an optimist and see the glass as half-full, the new Ethereum tech upgrade in 2024 is worthy of the same type of acclaim as The Merge was back in 2022. You probably also think that a fresh batch of spot Ethereum ETFs are on their way before the start of summer.\n\nHowever, if you're a skeptic and see the glass as half-empty, the new Dencun upgrade is at best a temporary fix for problems that have been plaguing Ethereum for years: high transaction fees and slower transaction processing speeds compared to many other blockchains. Moreover, you're probably also thinking the SEC will take its time with the spot Ethereum ETF approvals, much as it did with the Bitcoin ETF approvals.\n\nMy concern right now is that the optimistic scenario has already been baked into the price of Ethereum. How else to explain the fact that Ethereum is up just as much as Bitcoin this year?\n\nThus, if either of these two catalysts fail to deliver as expected, we could see a pullback in the price of Ethereum. For that reason, I'm taking a wait-and-see approach with Ethereum right now."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPQ2tfRVdfSEtLNk5XMGRZTGVBOTFLallFSXpDQVZfZFdyclRHeC1WQWJaOWxibGZpamJTZkFIWUlzeFgxd2JiYTM0dTZjRndIbnRVRWxYU29xdGoyRjBON2lKVmRNQVBLaDV5VFBJOG9GUVVhdlZmNHUyRXF6OVpZaGczOFpVSF8tUkJITkRTWTJqNHFZZ0h5V1ZCQkowanps?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s CREATE2: A Double-Edged Sword in Blockchain Security - Check Point Research",
        "content": "By Oded Vanunu, Dikla Barda, Roman Zaikin\n\nEthereum’s CREATE2 function is being exploited by attackers to compromise the security of digital wallets, bypassing traditional security measures and facilitating unauthorized access to funds.\n\nThe attack method involves tricking users into approving transactions for smart contracts that haven’t been deployed yet, allowing cybercriminals to later deploy malicious contracts and steal cryptocurrencies.\n\nThis vulnerability highlights the need for enhanced security measures in wallet security products to adapt to the evolving tactics of cybercriminals, ensuring the safekeeping of digital assets in the face of innovative exploits.\n\nIn the digital realm of blockchain and cryptocurrency, Ethereum stands out as a platform of innovation and versatility. Its capacity for adaptation and development makes it a critical player in the tech space. However, the very features that make Ethereum remarkable also expose it to potential vulnerabilities. One such feature is the CREATE2 function, which, while showcasing Ethereum’s advanced technological capabilities, has unfortunately also opened the door to new security threats against digital wallets.\n\nThe Intricacies of CREATE2\n\nIntroduced in Ethereum’s Constantinople upgrade, the CREATE2 function has been hailed for its ability to deploy smart contracts with deterministic addresses even before the creation of the contract’s bytecode. This function significantly enhances the predictability and efficiency of smart contract interactions, offering a boon for the complex ecosystems of decentralized applications (dApps). It allows for the pre-orchestration of interactions between multiple contracts, a feature critical for the seamless operation of dApps.\n\nThe Security Concern\n\nHowever, the innovative CREATE2 function also presents a significant security loophole. Cybercriminals have quickly leveraged this function to bypass conventional wallet security measures, creating a new method for exploiting unsuspecting victims. The core of the vulnerability lies in CREATE2’s ability to deploy a smart contract at a known address in the future, enabling attackers to deceive users into approving transactions with a contract that doesn’t yet exist. Once the user grants approval, the attacker can deploy a malicious contract to that address, hijacking the transaction and draining the victim’s cryptocurrency wallet.\n\nA Closer Look at the Attack Mechanism\n\n1. The attacker begins by convincing the victim to approve or increase the allowance for a yet-to-be-deployed contract.\n\n2. Since the contract hasn’t been deployed at the time of approval, it evades detection by security solutions, which cannot identify potential threats in non-existent contracts.\n\n3. After securing the victim’s authorization, the attacker deploys the malicious contract, exploiting the victim’s funds.\n\nThis method not only underlines the creative misuse of Ethereum’s features by malicious entities but also highlights a critical challenge for security products. Most security solutions are calibrated to analyze and validate transactions based on existing contracts and known behaviors. CREATE2, by facilitating interactions with future contracts, effectively bypasses these security frameworks, leaving digital assets at risk.\n\nThe Technical Side of CREATE2\n\nDelving into the technical aspects, CREATE and CREATE2 are both opcodes in Ethereum blockchain development that support the deployment of smart contracts. They differ primarily in how the address of the new contract is determined. While CREATE bases the contract’s address on the creator’s address and a nonce, CREATE2 allows for a more flexible approach by incorporating a user-specified salt, the creator’s address, and the contract’s initialization code into the address computation.\n\nIn the context of Ethereum blockchain development, both CREATE and CREATE2 are opcodes that facilitate the deployment of smart contracts, but they differ in how the address of the new contract is determined.\n\nThe CREATE opcode generates the address of the new contract based on the address of the creator (the sender of the transaction) and the nonce. On the other hand, CREATE2 offers a more flexible approach by allowing the contract’s address to be determined based on a user-specified salt, the creator’s address, and the contract’s initialization code.\n\nThe address of the contract in CREATE2 is computed by using 4 parameters:\n\nkeccak256(0xff + sender_address + salt + keccak256(initialization_code))\n\nConstant prefix – A fixed prefix that is part of the hashing process, which is 0xff. This is used to differentiate CREATE2 addresses from those created with the CREATE opcode. Sender’s Address – The address of the account creating the contract, typically a smart contract itself when using CREATE2. Salt – A 32-byte (256-bit) value chosen by the creator. The salt allows the creator to deploy multiple contracts with the same initialization code to different addresses. Initialization Code – The bytecode of the contract being created. This includes the bytecode that results from compiling the smart contract source code, along with any constructor arguments encoded into it.\n\nTo demonstrate how CREATE2 can deploy another contract with a deterministically computed address, we will use the below simple example that includes two Solidity contracts: Factory and Child. The Factory contract uses the CREATE2 function to deploy the Child contract to a specific precomputed address.\n\nBy deploying the Factory contract to the testnet and using 123456 as a salt, we will be able to precompute the child contract address:\n\nFactory Contract Address is (https://goerli.etherscan.io/address/0xb74025567acdc922507821516014dc5fe659483f):\n\nNow by using computeChildAddress function, we will be able to precompute the child address which is\n\n0xe41Ba18D5e667b0B391b33b848520FA6F041C092:\n\nThis address does not exist yet because we didn’t deploy the contract:\n\nNext, the attacker will try to trick the victim into approving this contract as a spender for a specific token he wants to steal, and because the contract has not been created yet, this transaction evades all forms of wallet security measures the victim possesses, which rely on the historical record of the contract address.\n\nAfter the attacker tricks the user to sign the approval request, he will be able to deploy the contract by using the same salt 123456 in the function deployChild:\n\nAn Example from the Wild\n\nA stark illustration of this vulnerability in action involved a user losing $3.5 million due to such an exploit. The victim approved a transaction for a contract that hadn’t been created yet. The contract was deployed shortly after the approval, and the attacker executed a function to transfer the victim’s funds to their own address.\n\nAt the time of the transaction, the contract a01dee645e4dbaaa8aa2089cc4b1cc34d36fa71c which is approved for the allowance had not been created yet:\n\nhttps://etherscan.io/tx/0xb5f03259859c10243a85f7a9ca27d8b45e67ce6463800193634d27718ba162a0\n\nThis transaction executes an unverified function that performs various checks and then creates the approved contract address by using CREATE2 as we demonstrated before:\n\nTarget – Which is, in this case, SUPER token\n\ncallData – This is the bytedata of the function the attacker wants to perform.\n\nin this situation, the attacker performs the transferFrom function and uses the allowance from before to transfer the balance from the victim to the following address 0x8f9278aab84290fe6e78515b7938b3136b89a1e2:\n\nSecuring the Digital Frontier\n\nThe exploitation of the CREATE2 function underscores the ongoing battle between innovation and security in the blockchain space. As Ethereum continues to evolve, so too must the security mechanisms designed to protect users from such sophisticated attacks. Awareness and education are the first steps in safeguarding digital assets against emerging threats. Blockchain developers and users alike must remain vigilant, continuously updating their knowledge and security practices to navigate this ever-changing landscape securely.\n\nThe Threat Intel Blockchain system, developed by Check Point, continues to accumulate valuable information on emerging threats, and this intelligence will be shared in the future. In this collaborative effort, we aim to empower investors with the knowledge needed to navigate the crypto space securely and protect themselves from potential pitfalls. For more information contact us at: [email protected]"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUUgxM1pacTFsSW9OSVRMak9lNklaN1E0Z2F1di14MWRSeFBYdnVFX0NVMkFRbzJrSzI2eHhpMW5NTFFfOEtjU01yTzk4Yy1qb3hFd2xWakpYbGZmLVNDM2Y1YWpadDFHLVc0Rm5qd2dKTXdLMXV2bVgzUkhlcDhkTnQ4Q1BiazlXRnNJTE9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’ - Yahoo Finance",
        "content": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’\n\nThe Solana network experienced a surge in activity over the weekend, surpassing Ethereum in total trading volume. However, the network struggled to keep up with the influx, leading to frequent transaction failures and delays.\n\nSolana's 24 hour trading volume reached nearly $3 billion on March 17, beating out Ethereum's daily volume of $2.04 billion. The network also reached a new record of $3.79 billion in trading volume on March 15. The surge in activity was driven by a speculative frenzy for new Solana-based memecoins. Book of Meme (BOME) rallied from near-zero to a market capitalization of $1.45 billion in just 56 hours.\n\nThe surge in trading activity overwhelmed the Solana network, causing ping times to spike and transaction failures to increase. According to data from Solana Validator, Solana's ping time ran as high as 46 seconds on March 18, resulting in approximately 30-40% of transactions failing.\n\nHowever, this hasn’t stopped the price of Solana (SOL) rallying to $203, up 8.69% over the past 24 hours and 45% in the last week alone. Solana's market capitalization also reached a new all-time high of $89.3 billion, overtaking BNB (BNB) to become the fourth-largest cryptocurrency by market cap."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNaHZMUE94Z3NYQUkxT1NZdEdmN1JJMnJKcjVNNUNXZ29nWWxpNXVKWE5CZEhJbzNoamZGVWExdWROWnFpSk5kUjNteDhiRzVVdXYzQUhDanRLUWNON2RwT1NCYWVnRlZYYV91M3hRLTh3ZGZaUGxSQ1YtTk1qZ2RCdjVYRUN2SWo0TGNSNmtKbnBaMTdCb3h1ZWVaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Fidelity adds staking to Ethereum ETF application amid mixed reception - CryptoSlate",
        "content": "Fidelity Investments has amended its application for an Ethereum (ETH) spot exchange-traded fund (ETF) to include a staking feature, according to a regulatory filing.\n\nThe amendment was filed with the US SEC on March 18 and has stirred significant interest in the industry, but market analysts and observers have mixed feelings. It introduces the possibility for the ETF to engage in staking activities, a core aspect of Ethereum’s functionality following its shift to a Proof of Stake (PoS) model.\n\nThe amendment comes days after US politicians wrote to the SEC to block further crypto-related ETFs due to concerns over the risk posed to retail investors.\n\nETF with staking\n\nThrough the proposed amendment, the ETF could allocate a portion of its holdings for staking through designated staking providers, which may include affiliates of Fidelity.\n\nStaking involves participants locking up digital assets to support the network’s security and operations in return for rewards in the form of additional crypto. Fidelity’s move aims to explore the income-generating potential of staking within the framework of a regulated financial product.\n\nAccording to the document:\n\n“In consideration for any staking activity in which the Fund may engage, the Fund would receive certain network rewards of ether tokens, which may be treated as income to the Fund as compensation for services provided.”\n\nThe SEC has historically been highly cautious toward crypto-related financial products and, notably, rejected spot Bitcoin ETFs for years before finally relenting after a court ruled against its decisions.\n\nThe regulator has yet to decide on the Ethereum ETF applications and is expected to either approve or reject them by a May deadline. Experts were initially optimistic about the approval but have since revised the odds to roughly 35%.\n\nMixed feelings\n\nThe inclusion of staking in Fidelity’s ETF application raises intriguing questions about the SEC’s reception and the future regulatory landscape for digital assets. The move has caused mixed reactions within the industry but failed to shift sentiment toward optimism.\n\nBloomberg analyst James Seyffart remains skeptical about the SEC’s willingness to greenlight an Ethereum and said the amendment has not changed the base case for approval, which remains negative.\n\nHe added:\n\n“To be clear — I don’t think they *should* be denied. But at this point I think they will be.”\n\nMeanwhile, Zack Guzmán, a former Yahoo Finance reporter, suggested that Fidelity’s decision to add staking to its ETF application could either be a strategic move to align more closely with the SEC’s expectations or a potential point of contention that might complicate approval.\n\nAs the SEC reviews Fidelity’s amended Ethereum ETF application, the decision could set a precedent for future crypto ETFs, especially those seeking to incorporate staking or other native blockchain functionalities.\n\nThe outcome will be closely watched by investors, regulatory bodies, and the digital assets community, as it could mark a pivotal moment in integrating traditional financial products with the innovative features of digital assets.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNeWR6bnJUUHhaZFo2MjBCZjkyZkhQNlBuVHBqMUNMcmFISXJ6TGhyYXU0VnNseE9KT0tnbU0tM0ZDYmZmX1NHUkwwS3Axa25GV0RkX2VjZElWUnNod2w4aXFTcjM5UmRGSlg4YnV5MS1iY1BfbjQxQ3RHZnA1U3lMbGFva1JQTEhE0gGOAUFVX3lxTE1SZlZSMFJrRWt6ODZNRjlEa2FYMXo0enJmSWtqcHdkYkllR2R2NlhET1dFTzItUE9EU09YZTFIbGY1ZDhDVG84WV9HbGJKemFETkNzaXB2cFJGMjlwSVcwMTkzenJSVVAybmk1UUliNGNOOUNOZHJDYmhmeTlJVTBpakNyZ1VoNllOYVVlakE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum: Will fresh demand again push ETH past $4K? - AMBCrypto News",
        "content": "New demand for Ethereum now sits at a year-to-date high.\n\nIts DeFi and NFT sectors, however, witnessed declines in the past week.\n\nThe daily count of new addresses on Ethereum [ETH] assessed on a seven-day moving average reached a year-to-date (YTD) high of 116,000 on 14th March, according to The Block’s data dashboard.\n\nThis marked a 35% increase from the 86,000 unique addresses that appeared for the first time in a transaction of the native coin in the network on 1st January.\n\nEthereum’s rally in new demand to a YTD high came amidst a surge in its on-chain volume. AMBCrypto found that transaction volume on the network, also assessed using a seven-day moving average, attained a YTD high of $7 billion on 11th March.\n\nAs transaction volume rallied, the average fee paid per transaction on the network also climbed. According to The Block’s data, this reached a YTD high of $25 on 11th March.\n\nThe DeFi and NFT sector fails to react\n\nDespite the recent uptick in demand for the Ethereum network, its decentralized finance (DeFi) and non-fungible token ecosystems have witnessed declines.\n\nFor example, the total value of assets locked (TVL) across the DeFi protocols housed within the chain declined by 5% in the last week. Per DefiLlama’s data, Ethereum’s TVL was $53.4 billion.\n\nOut of the top 10 DeFi protocols on Ethereum, only one (ether.Fi) recorded a TVL hike in the past seven days. The rest of them witnessed a decline.\n\nThe network’s NFT sector recorded a 21% decrease in sales volume in the last seven days.\n\nAccording to CryptoSlam’s data, despite the 90% uptick in the number of traders trading NFTs on the network during that period, the transaction count fell by 2%.\n\nIn the last seven days, 166,000 NFT transactions worth $130 million were completed on the Ethereum network.\n\nLook before you leap\n\nThe network’s native coin ETH sold for $3,721 at press time. Per CoinMarketCap’s data, its value dropped by 6% in the last week. The decline followed a sharp fall in Bitcoin’s value on 14th March, when its value was below $68,000.\n\nHow much are 1,10,100 ETHs worth today?\n\nAn assessment of ETH’s performance on a daily chart revealed that its Awesome Oscillator (AO) indicator has posted red upward-facing histogram bars since 11th March.\n\nAn asset’s AO measures market trends and changes in momentum. When it displays red upward-facing bars, it suggests increasing negative momentum in the market. Traders often interpret this as a signal to consider selling or entering short positions."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQdGhPYTMzaDROQ0hsc2Nqc3JYTTBQRk1lTzNPaEM5Qlk1ekJtZlpFNXBaNHA1YzNXOGx4RU9ibUtyM2hkbHUzLVUwR1NFd3MtZ2JMMDh3cFVyOUpmLTlEODREdDY1dWlNUWVSMi1zUExTdUFreENodWxnSVVtMjkzM21GVG00bkJNMTZPY1hJOHlwU0J1TW1keG9Hd0o2REhuVGJxWFlyVnlDaVlEZ0JnTFZCWGUwT2VORTNoRTln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Cryptocurrency Market News: Bitcoin and Ether Prices Fall After Dencun Upgrade - Investopedia",
        "content": "Key Takeaways Bitcoin hit another high to start last week, but ended it sharply lower.\n\nFees on various Ethereum Layer 2 networks fell dramatically last week after the Dencun upgrade, but ether prices also declined.\n\nGovernment prosecutors in the trial against Sam Bankman-Fried recommended up to 50 years in prison for the former FTX CEO.\n\nDigital asset manager Grayscale filed for a second bitcoin exchange-traded fund (ETF), to use the BTC ticker.\n\nThis week, analysts are tracking the inflows into bitcoin ETFs, and the numbers from March already have dwarfed those from January and February.\n\nWhat Happened in Crypto Markets Last Week?\n\nLast week proved to be a roller-coaster ride for bitcoin (BTC) investors, as the largest cryptocurrency by market capitalization topped another lifetime high of $73,000 to start the week but fell below the $65,000 mark by Sunday after a sell-off. Ethereum's Dencun upgrade fulfilled its intended goal by lowering fees on various Layer 2 networks but ether (ETH) prices also weakened at the end of the week.\n\nElsewhere, prosecutors recommended that former FTX Chief Executive Officer (CEO) Sam Bankman-Fried receive up to 50 years in prison for charges related to fraud and money laundering. Additionally, digital asset manager Grayscale Investments has filed for a second spot bitcoin ETF in an effort to offer lower its management fees.\n\nDencun Upgrade Leads to Lower Fees on Ethereum Layer 2 Networks\n\nFollowing the Dencun upgrade on Ethereum's mainnet on March 13, Ethereum Layer 2 (L2) protocols have experienced a remarkable reduction in transaction fees, with some protocols slashing fees by as much as 99%. Dencun, hailed as a pivotal scalability-focused upgrade, is being called one of Ethereum's most significant advancements since The Merge.\n\nProminent L2 protocols have marked an impressive 99% decrease in gas fees post-upgrade, with current fees for some like Starknet plummeting to 2.7 cents. The introduction of data blobs through EIP-484 during the Dencun hard fork has improved transaction data processing, offering faster and more cost-effective transactions for L2s.\n\n\n\nProsecutors Recommend Up to 50 Years for Former FTX CEO Bankman-Fried\n\nFederal prosecutors are advocating for a substantial sentence of up to 50 years for the disgraced cryptocurrency prodigy Sam Bankman-Fried, according to court documents unveiled on Friday. Bankman-Fried, the former CEO and co-founder of the failed cryptocurrency exchange FTX, was convicted of multiple criminal charges including wire fraud and money laundering.\n\nThe prosecution contends that his actions warrant a sentence commensurate with the scale of his offenses, emphasizing the necessity for justice in the face of widespread harm and flagrant disregard for the law. As the March 28 sentencing date approaches, the severity of the recommended punishment stands in stark contrast to the comparatively lenient request put forth by Bankman-Fried's legal team.\n\nGrayscale Files for New Bitcoin ETF with BTC Ticker\n\nDigital asset manager Grayscale Investments made headlines last Tuesday by filing for a spin-off of its Grayscale Bitcoin Trust (GBTC), a move aimed at providing investors with more cost-effective exposure to bitcoin.\n\nThe spin-off, designed to reduce fees associated with GBTC, comes in response to investors' preference for lower-cost alternatives, particularly as GBTC's fees have been comparatively higher than its competitors'. Grayscale plans to introduce the Grayscale Bitcoin Mini Trust—which will hold a portion of the bitcoin currently held by GBTC—with existing GBTC shareholders receiving shares in the Mini Trust in exchange.\n\nDespite bitcoin's surge to record highs, GBTC has experienced significant capital outflows of more than $11 billion since January, versus inflows at competing ETFs such as BlackRock's iShares Bitcoin ETF (IBIT) and Fidelity Wise Origin Bitcoin Fund (FBTC). While Grayscale has yet to finalize the fees for the Mini Trust, the spin-off signals a strategic move toward independent operation for both GBTC and the Mini Trust after regulatory approval earlier this year, marking a significant development in the evolving landscape of bitcoin investment opportunities.\n\nWhat To Expect in The Markets This Week\n\nSpot bitcoin ETF volumes in March already are much larger than they were in January and February. In addition, BlackRock has accumulated more than 230,000 bitcoin via its IBIT offering. That said, inflows appear to be slowing after peaking at more than $1 billion on March 12, according to data from Farside Investors. This week, analysts will be watching to see if inflows into these ETFs continue to slide."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNNUgzMW9RRUl2b1hzd2tIc1VWSEsxRzRtVFNRS0ZYUHdJa3RiWURVTlJHUUV3c3duZ2JWa0d4eUhldUhFZkp1b0hDQTBRUFY2ckxON0NMNld6a3czRzFPUVZSVG1SNjlOY1BRdlk0TGkwV0dzS29iMHRzSFFwdGdncUJDVkU4N0dGRFQxY29EV0V1NVdCZ2FPcGxkOEVVZzVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Expert Establishes Connection Between Shiba Inu and Ethereum - The Crypto Basic",
        "content": "A notable figure in the Shiba Inu community has established a connection between SHIB and Ethereum.\n\nIn a recent post on X, acclaimed crypto expert Del Crxpto attempted to forge a link between Shiba Inu and Ethereum, drawing on the co-founders of both projects.\n\nSpecifically, Del Crxpto recounted when Ethereum co-founder Vitalik Buterin donated multi-billion dollar worth of Shiba Inu to a COVID-19 relief effort. Del Crxpto claimed Shiba Inu ecosystem lead, Shytoshi Kusama, transferred the tokens to Buterin.\n\nThe $SHIB / $ETH Connection: Who remembers when @ShytoshiKusama sent Billions worth of $SHIB to @VitalikButerin, who used it for COVID-19 relief? Who remembers how the entire space just figured it was a coincidence? No one should be surprised by what the future holds… the… — Del Crxpto (@DelCrxpto) March 14, 2024\n\n- Advertisement -\n\nEthereum and Shiba Inu Connection\n\nInterestingly, the COVID-19 relief initiative concerned Crypto Relief India, a crypto-based humanitarian endeavor.\n\nThe foundation received a staggering $1.5 billion in Shiba Inu from Vitalik Buterin to finance its COVID-19 relief effort. Accordingly, Crypto Relief India liquidated a portion of the Shiba Inu donation to raise $460 million.\n\nIn a separate development last year, Buterin contributed over $150,000 to a wallet endorsed by Shiba Inu’s leader. The fund was directed towards aiding victims of earthquakes in Turkey. Moreover, the SHIB Army contributed to a charitable initiative Buterin established in response to the global pandemic.\n\nConsidering these developments, Del Crxpto prompted the SHIB Army to recollect how the broader community initially perceived the interaction between Kusama and Buterin as a mere coincidence.\n\n- Advertisement -\n\nIn parallel, he emphasized that nobody should be taken aback by what the future holds for SHIB, asserting that “the signs were always there.” In reaction, another Shiba Inu enthusiast echoed a similar sentiment, speculating:\n\n\n\n“Vitalik knows who created SHIB for sure—the OG pic with ‘supposedly’ Shytoshi. Then, magically, billions were sent to his wallet. Like, how did they know that address…”\n\nEssentially, these voices sought to establish that Vitalik Buterin has more profound relationships with the Shiba Inu ecosystem than the public knows, suggesting SHIB is bound to follow ETH’s success.\n\nSignificantly, in 2021, the Ethereum founder reportedly destroyed 90% of his Shiba Inu tokens, valued at over $6.5 billion, compounding the asset’s growth. Buterin further pledged to contribute his remaining Shiba Inu tokens to charity causes."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOZG11MnVUV2tzUTV1amxXRkZvdjBEZkUtaWs3WWVxX3hqenVGWUVjWldTcG9tSUpoakZtRlcyaWF5VG5GLW1YZWJCM2FmSVZ2aVFWTWFFRTA0NElydHhob0N3TUM2U1RubkpxYkRDQ1hlX0ZZVnp1czh0Wkg0UkZ2VnhrRHhabVZ5M3dwQnJBU1Fqa3Mwd1p1NXZzSHlVT1Biam5kc2ZMM3NoNlhpY2dN0gG0AUFVX3lxTFA1MnozSjNzXy0zQlJzMFlCekhrcWdQTTQzMEpyTmotYWdodGFzZnd3MGF2UzFnMllnS0x4Wk1zbmRGQ2hlVGN3N3QtcWJrQnNEUW9ZbGMzbGU1SDVsUUZhWGlJZ3RjNzdWcUtHZFlyc0hzaU5QSlRLeDNIQW4tUHpDWThzcDhqT1p1ZFpZMzgwRnAtUmtGUm5uNU9xaXpERF9ZZ3B5QTF2dTNzYm9ZSWxiSk5VcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Fidelity Adds Staking to Ether ETF Application, Sending LIDO Up 9% - CoinDesk",
        "content": "Money management giant Fidelity wants to allow traders of its potential ethereum fund to be able to stake some of the assets, it wrote in an amendment with the U.S. Securities and Exchange Commission (SEC). (Marco Verch/Flickr)"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOdWpRXzU1SlFveHJWMDkwRUwwblhTc3E0Q2Z1QjVDTnprTGdON0toRzFaNTJuLTlUM2FsTUI5YjQ0V2o0eHpIRjY2ZGpGX2JKSGNBbXdDMmd2SG5JZi10OGJ6MGUyV1YwZzlpVFM2eG1Cc1haeWxiN181akE0M2JqV3pWTjlDaGtwb1lXNXkyQmdtX211Znd6cml0LUU4bnBYQ0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "The decline of the supply: analysis of Ethereum price activity - The Cryptonomist",
        "content": "The price activity of Ethereum is reducing the supply of the crypto to the lowest levels recorded since August 2022. Furthermore, the decline in ether supply has marked its fastest decrease since May 2023.\n\nAt the same time, several on-chain metrics are approaching or even reaching new twelve-month highs. Let’s see all the details below.\n\nThe rapid decline in Ethereum supply and price trends\n\nAs we know, the latest Dencun update of Ethereum was implemented on March 13th.\n\nHowever, it was the previous major update that significantly impacted the total availability of ether.\n\nMid last week, the total amount of ether dropped to the lowest level recorded since August 2022, as indicated by data provided by CryptoQuant and reported by CNBC.\n\nIt is precisely during that period that Ethereum introduced its most significant upgrade to date, moving from proof-of-work to proof-of-stake, known as The Merge.\n\nFurthermore, the rate of decrease in the supply of ether is currently the fastest since the beginning of May 2023.\n\nIn the recent 30 days, the supply of ether has decreased at an annual rate of 0.872%, according to data from ultrasound.money. For comparison, since the Merge itself, the rate of decrease has been 0.246%.\n\nJulio Moreno, head of research at CryptoQuant, highlighted that the high activity on the Ethereum network has led to high transaction costs and, consequently, to a greater amount of ether being burned.\n\nIn concrete terms, over 1.56 million ether have been burned by the Merge, while less than 1.12 million ether have been issued.\n\nThis has caused a sharp decrease of over 446,000 ether, equivalent to almost 1.62 billion dollars at current prices.\n\nActivity record and on-chain transparency\n\nAlthough the focus is mainly on activity on the Solana network, the Ethereum ecosystem continues to show distinctive signs of vitality.\n\nA seven-day moving average of transactions on Ethereum is approaching its annual peak recorded in January, with 1.26 million transactions recorded just yesterday, according to recent data.\n\nJulio Moreno highlighted that “total daily transactions are at record levels, not seen since May 2023”, pointing out an increase in network fees, an increase in burned fees, and a reduction in the total supply of ether.\n\nAt the same time, the number of active addresses on Ethereum is at its highest since the beginning of the year and for the past 12 months, with approximately 540,000 active addresses registered just yesterday.\n\nFurthermore, the number of new addresses on the Ethereum network is also at its highest since the beginning of the year and for the past 12 months, with more than 120,000 new Ethereum addresses.\n\nFinally, the on-chain volume of Ethereum has reached new highs since the beginning of the year and for the past 12 months, with over $7 billion in volume recorded just yesterday, according to data from The Block.\n\nBearish correction for Ethereum: potential recovery towards $4,000?\n\nThe price of Ethereum has started a correction lower below $3,650, but is currently attempting a decent recovery wave in the short term.\n\nThe correction of Ethereum has crossed the levels of $3,800 and $3,700, following Bitcoin, and then dropped below the key support at $3,650, entering a temporary bearish phase.\n\nThe price has even exceeded the critical threshold of $3,500, touching a minimum of 3,414 dollars, but now shows signs of recovery. Ether has recovered above 3,500 dollars and the Fibonacci retracement of 23.6% from its high to low.\n\nCurrently, the price of Ethereum is below $3,700 and the 100-hour simple moving average, with immediate resistance around $3,650 and a clear downtrend line at $3,660.\n\nFuture prospects indicate a possible recovery towards $3,750 or a 50% Fibonacci retracement at $3,830, beyond which it could gain momentum towards $3,925 and, eventually, $4,000."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOUURiNWR4UzFSY0lmSFpoZE84NThwbEZmcVJXbFV1MFB4bGFOdDhTY0JQQnhpVlhoRGd4WlpYbUUtVHE1MzFnRlJHeUZ3YXh5amZ6WXFyTTlwOGhqRW5BaXUyckw5U2prVFJtekhzUlNCRHlESmduZDk1YTlCcGZXc1J5dDRxeHpsVWpkR284enRmR01WNjVBZWw3RXkxTDR1NWhnTlJ4WmRZUFlsaGtKZi05U2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Grinds Lower, Why Pullback Is Not Over Yet - TradingView",
        "content": "Ethereum price started a downside correction below $3,650. ETH traded below $3,500 and is currently attempting a decent recovery wave in the near term.\n\nEthereum started a downside correction below the $3,700 zone.\n\nThe price is trading below $3,700 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance at $3,660 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $3,750 resistance zone.\n\nEthereum Price Dips\n\nEthereum price started a downside correction below the $3,800 and $3,700 levels, like Bitcoin. ETH declined below the $3,650 support level to enter a short-term bearish zone.\n\nIt even spiked below the $3,500 support zone. A low was formed at $3,414 and the price is now attempting a recovery wave. There was a move above the $3,500 level. Ether climbed above the 23.6% Fib retracement level of the downward move from the $4,084 swing high to the $3,414 low.\n\nEthereum price is now trading below $3,700 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $3,650 level. There is also a key bearish trend line forming with resistance at $3,660 on the hourly chart of ETH/USD.\n\nThe first major resistance is near the $3,750 level or the 50% Fib retracement level of the downward move from the $4,084 swing high to the $3,414 low. The next major resistance is near $3,830, above which the price might gain bullish momentum.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nIn the stated case, Ether could rally toward the $3,925 level. If there is a move above the $3,925 resistance, Ethereum could even rise toward the $4,000 resistance. Any more gains might call for a test of $4,080.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $3,650 resistance, it could start a fresh decline. Initial support on the downside is near the $3,520 level.\n\nThe first major support is near the $3,500 zone. The next key support could be the $3,420 zone. A clear move below the $3,420 support might send the price toward $3,350. Any more losses might send the price toward the $3,250 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,500\n\nMajor Resistance Level – $3,650"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPR2FnOHFQZWFVWUNrVFNuNUUwWFNTTkFaSHNtWnd0b1ZZeUhZb1pmT2RDck8zQXhTTnRsa29lcmQxVGZxcTRwNk1DMkloQ2dwUE50a0dtWEhYUXhjMnoza1JFNjdmb1l1ZjBJa0xRWWFZd0RkMG5hOHZjd3FSQ1BhQ3BSMU9xWmdKSjVfNlBveFpfYjc1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum will become the backbone of a new financial system - Yahoo Finance UK",
        "content": "Looking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called 'Layer 2s.'\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nWhen cars first started to appear in the 19th century, they were a truly ridiculous sight. Clunky, noisy and big, it was hard to imagine for most contemporaries that these machines would ever be good for anything. Worst of all? There just was not much use for them. After all, most roads were not in a state to support cars. Fast forward 100 years and the picture had changed.\n\nLooking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called ‘Layer 2s.’ While the upgrade itself was a major milestone, it also shows that the Ethereum roadmap is progressing towards scalability, security and decentralisation. In the public perception of many, blockchains may live somewhere between memecoin gambling and vaporware. This is similar to how cars were seen before the advent of infrastructure designed to support them. But some of the best computer scientists and cryptographers in the world are busy building these roads.\n\nLooking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called 'Layer 2s.'\n\nThe endgame for blockchains seems to be a so-called modular approach: different Layer 2s with their own setups provide varying degrees of speed and decentralisation. Corporations might gather around ‘permissioned’ Layer 2s where participants have to go through KYC. Specific applications that require large throughput might use their own Layer 3, a so-called ‘app-chain.’ Ethereum’s Market Cap of close to $500 billion provides substantial economic security for this ecosystem. It will also be built around Ethereum’s ethos of credible neutrality and permissionless-ness at Layer 1. Eventually, the ability to have finance ‘natively’ built into the digital world will allow use-cases that we cannot even imagine today. From machine-to-machine payments, a more equitable global financial system and hundred times lower cost of trade finance and cross-border payments, the transition to blockchain-based finance will happen slowly, then suddenly.\n\nThe main challenge on the way is to ensure that all these blockchain ‘modules’ keep the main benefits of the system. These are the shared liquidity that enables financial use-cases on a large scale. It is also the composability that allows programmers to connect with applications across all platforms. But as Dencun’s successful launch shows once again, Ethereum is quietly executing on its roadmap."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOM0xfQ3E5LXdvT1NVamY3LWl2X3FKTDVWMXlFbWlkTnlkLVY2a3hUQWUxVy10cVByY21ISUotN3pkMzY3Ykg5VVpxMkREcWtWc0RjNFQwOVd4Zno3aVVHaTdRUG9EaTRkSUlnZ1Q1dEh5bjJGOWJlRDdVY0JWR25Yazc3Q0ZsVWo5Yk8xVdIBkgFBVV95cUxQLVVvZGN3ZHpIT1UxVDAxSGdjN0hTLTZDTl9rVUt2aEJDYzVPUGNMeDQxWWVwd0R3cUxxc0ZmbUYweGZUVi1tN3JtRkgyRlVNMElOT0hURTNESWd0SmdvQkQ2ZUhMN19CXzlZRmo2OXBuODI1Z3AzSkFLTml0SllzMkhuOWZxcVk2cnBNaHdHekpmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum could drop as low as $3100 – Time to rethink your moves? - AMBCrypto News",
        "content": "Ethereum broke its lower timeframe bullish structure.\n\nThe liquidation levels heatmap outlined two support zones.\n\nEthereum [ETH] saw a sizeable pullback over the past few days after its steady bullish march over the past month. The $4.1k level was almost reached before the bulls were forced to retreat. Investors need not worry about this dent in prices too much.\n\nBitcoin [BTC] also faltered just above the $73k level and dragged the rest of the market down. While the rally is expected to continue higher in the long run, further losses are anticipated over the next few weeks.\n\nTraders need to be prepared for a fall below $3500\n\nThe 12-hour chart showed that the bullish bias remained intact based on the price action. Yet on the 4-hour timeframe and lower the structure has flipped bearishly. Even the 12-hour RSI fell below the neutral 50 mark to reflect bearish momentum was rising.\n\nThe recent pullback is not a flush of the overleveraged bulls as we saw on the 5th of March. The rally saw its momentum stutter after the 12th of this month, followed by an increase in selling pressure.\n\nThe OBV began to drop lower to support this idea. The Fibonacci retracement levels (pale yellow) highlighted that the 61.8%-78.6% region at $3100-$3315 would likely be retested as support. The $3463 level could also halt the bearish progress.\n\nLong-term investors need to brace for further losses\n\nAMBCrypto’s analysis of the liquidation levels heatmap showed that ETH would likely post more losses. The $3560 level was estimated to trigger $2.6 billion worth of liquidations.\n\nThese large liquidation levels were concentrated in the $3520-$3560 region, marking it as a support zone. Ethereum could see a bullish reaction from here.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nBelow the $3520 level, the next large liquidation levels sat at $3300 and $3130. The former was estimated to have $2.2 billion in liquidations, and the latter to have $5.4 billion.\n\nIt also had confluence with the 78.6% retracement level at $3102.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPTUpJSzJ1N0dMdHEtVnNmLVFNWWtXYmJwVTlZbTRXLTNrdkh6TzJYWHY5bDBEbEZtNmhyTkhaMzNMWG90aDFtekxFcFlIcFdxb0VNSzF6MlJyVGJFMnJVNExIRGtRS2xCbEV6dWxQcFZzTG5MTDJjYTJRTW1GSUlpZHhHQXhWZ0VUMkhZeTBDNDZuMHdUTE9ES1RvSDltYWdZb2hNajlvT2owcUHSAbABQVVfeXFMTTl1dWUtaDBYSWFiMEJjbDd6a21ldFpaRG0tbnFHZEdMaHJ2MWxiZjdhM2hCaHJobk1pWF81NC00bjJXa3FDYWxCMTFFclMxTHFDbkpfRGVIeFRoX1BFNzctd1d0WXU3d2xjODhkaW5RTy1RVVJaUExfR2ZvUndyeTh1b0VlbHo5Rm9Zd1FoaHVqc0I2Z1hJUnNva1dIRGw5SUJ4U3FiS3ZyU2NqWEotSFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin Rebounds But Concerns Mount as Ethereum’s Perpetual Funding Turns Negative - CryptoPotato",
        "content": "Over the past weekend, the crypto market experienced a tumultuous blend of emotions, characterized by fear and greed, as Bitcoin plunged to lows of 64,500. However, it swiftly rebounded, with the leading asset surging back above the 67,000 mark.\n\nWhile Bitcoin has exhibited significant resilience, the same cannot be said for Ethereum.\n\nEthereum’s Rocky Road Amidst Bitcoin’s Resilience\n\nThe heavy selling of BTC put options indicated a dissipation of fear among investors, who seemed eager to capitalize on the dip.\n\nInterestingly, amidst this sentiment shift, there’s a notable inclination towards greed, evidenced by the increasing interest in long-dated Sep and Dec BTC calls targeting lofty price levels of $100-150k. According to the latest analysis by QCP Capital, this optimism reflects a bullish outlook despite recent volatility.\n\nThe Singapore-based digital assets trading firm said Ethereum presents a contrasting narrative as concerns loom as perpetual funding rates turn negative and risk reversals portray a “downside skew,” signaling apprehension within the market about a potential downturn in the crypto asset’s price despite the continuing rally in alts.\n\nDespite Ethereum reaching a peak of over $4,000, its highest value in two 3years, QCP previously observed a change in market sentiment, evident in the negative risk reversals. These reversals indicate the contrast in implied volatility between call and put options, a shift likely attributed to the decreased chances of a spot Ethereum ETF approval in the US in the near future.\n\nFollowing the long-awaited Dencun upgrade, which QCP had anticipated, the crypto asset saw a decline to under $3,500 over the weekend amid a market-wide slump.\n\nIs Ether Overvalued?\n\nA different analysis by CryptoQuant revealed that ETH’s total supply is diminishing as a result of heightened network activity and the utilization of transaction fees for burning. The subsequent uptick in staking participation was also observed, with over 31 million ETH staked, indicating growing confidence in the asset’s long-term prospects.\n\nIts network also witnessed a notable surge in activity, characterized by increased daily transaction volumes and ETH transfers. However, the current elevated MVRV Ratio implied that ETH might be overvalued.\n\n“The current high MVRV Ratio suggests that ETH might be overvalued, which calls for a cautiously optimistic approach. Despite these challenges, the Dencun upgrade reinforces Ethereum’s strong fundamentals. Yet, the market’s recent preference for SOL over ETH signals that we might see some adjustments ahead.”"
    }
]