[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPcTE4NEM1dldvaW5tQzJ4RzBkVDJ0aVdmQXRSMGFJR2R4MXZwZGdZbThVYUo5YkNwVW5NemhJOWNnNEZaM08zNjRObWhFdzE5Y2NiYnN0QjdmY1pxYlpHcmJhMkFwdUp5QUg3TXp3QlRKWDZoMnJiS3JOSWN2QmgxRjVGX2d6TE15MXZtLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "3 Must-Know Facts About Ethereum, Before You Buy the Cryptocurrency - The Motley Fool",
        "content": "This top cryptocurrency is certainly on the radar of most investors.\n\nWith a current market cap (as of the afternoon of April 17) of $360 billion, Ethereum (ETH -1.03%) is the world's second most valuable cryptocurrency. It's behind only Bitcoin when it comes to market domination.\n\nJust in the past five years, Ethereum's native token has skyrocketed nearly 1,700% in value. That would have turned an initial $1,000 investment into a jaw-dropping $18,000 balance today.\n\nEthereum has also been on a fantastic run since the start of 2023, benefiting from the broader crypto market's rally. But this digital asset remains 36% off its high. Before you rush to buy the dip, here are three things you should know about Ethereum.\n\nAiming to boost functionality\n\nEthereum's key characteristic is that it allows for the functionality of smart contracts. These are computer programs that automatically execute once separate parties in a transaction satisfy their ends of the agreement. Think about an escrow account immediately releasing funds as soon as a home buyer meets certain conditions. In theory, Ethereum could handle this without human intervention, which could lower costs.\n\nThis feature is what makes this cryptocurrency much more useful when compared to Bitcoin, according to what Ethereum bulls believe. In fact, Ethereum has a sprawling ecosystem of decentralized applications (dApps), ranging from gaming and finance protocols to non-fungible tokens and the metaverse. Smart contracts enable these types of use cases, which could disrupt traditional industry structures.\n\nGiven this background knowledge, it's not surprising that Ethereum is often dubbed the \"world's decentralized computer.\"\n\nA sustainable future\n\nLike Bitcoin long has, Ethereum used to operate a proof-of-work consensus mechanism. This is an energy-intensive way to process transactions and secure the blockchain. Estimates point to how Bitcoin's network uses the same amount of energy as a small country.\n\nBelieving that this was harmful to the environment and not on a sustainable path, Ethereum's developers successfully transitioned the network to a proof-of-stake (PoS) system in September 2022. After the so-called Merge, in this setup, token owners who lock up their holdings have the right to validate transactions. According to Ethereum's website, the PoS consensus mechanism reduces energy usage by over 99%.\n\nThe other hope for the PoS transition is that it'll make Ethereum a much faster and cheaper network. It can only handle 14 transactions per second. And when demand is high, fees can soar. In order for Ethereum to one day usher in multiple new use cases, as many hope it can, the throughput needs to increase. There are other planned upgrades in the pipeline to one day make this a reality.\n\nOngoing technical risk\n\nBesides the Merge, Ethereum's developers have four main updates planned in the future. Each one focuses on a specific area of improvement. The end goal is to have a fully functioning Ethereum network that is good for the environment, fast, cheap, and able to have a vast dApp ecosystem operating on top of it.\n\nOf all the cryptocurrencies in the world, Ethereum has the most developers working on it by far. This bodes well for its future because it means there are smart people focused on solving complex problems to keep progress going. I always say that I believe the ultimate success of a cryptocurrency depends on its ability to bring about real-world utility. Ethereum is trying to do this.\n\nThe issue, though, is that no matter how smart the upgrade pipeline looks on paper, it introduces immense technical risk. We can't forget that blockchain technology is still in the early innings. There is a lot that needs to be learned. Constantly tweaking and messing with the software means there will always be the possibility that something will break along the way.\n\nIf you are bullish on Ethereum, understanding these three key areas should help give you a better understanding before you put your money to work."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9YdG9JTmhQUTZvX05jZGRMMmdiOUNpSEZQeDRCQUpidDIwbHg4WDZZMDllWF9mVHg1SDBIa0NGaENTTlJwQWp1UmxGMnVUUXhWT3BHTXNsXzMyZzFQaldfTTJhTEVxcU0yZnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 18:28:30 GMT",
        "title": "Ethereum (ETH) Price Prediction 2024 2025 2026 2030 – 2040 - Investing Haven",
        "content": "Ethereum Historical Prices\n\n2013: The Birth of Ethereum\n\nIn 2013, the cryptocurrency landscape was dominated by Bitcoin, which had a focus on payments only. Vitalik Buterin, a young programmer, proposed a new platform that would revolutionize the blockchain world in many ways. Ethereum was born, offering not just a digital currency but a decentralized platform for smart contracts and decentralized applications (dApps).\n\n2014: A Humble Beginning\n\nEthereum faced a slow start in the market. Its price hovered around $0.30 per ETH at its ICO and for most of 2014, with limited trading volume and investor interest. Despite the skepticism from some quarters, the Ethereum team continued to develop the platform, laying the groundwork for future growth. Initially, one ETH was equivalent to about 2000 BTC. This is now closer to 20.\n\n2015: The Genesis Block\n\n2015 marked a significant turning point for Ethereum. The platform’s developers released the Frontier network, allowing users to mine and trade ETH. Prices remained relatively stable throughout the year, ranging between $0.50 and $3.00 per ETH. The focus was on building a robust ecosystem and attracting developers to create innovative applications on the platform.\n\n2016: The Rise of Ethereum\n\nAs Ethereum gained traction, its price began to climb steadily. In early 2016, ETH was trading at around $1.00, but by the end of the year, it had surged to over $8.00 per token. Growing investor confidence in Ethereum’s potential to disrupt traditional industries and enable new forms of digital interaction fueled investor sentiment. 2016 also saw a huge split with the collapse of the DAO, resulting in Ethereum Classic.\n\n2017: The ICO Boom\n\nThe year 2017 saw Ethereum catapulted into the spotlight as the platform of choice for ICOs, and it really took off. Hundreds of projects launched their tokens on the Ethereum blockchain, driving up demand for ETH. Prices skyrocketed initially but tumbled soon thereafter, with ETH falling below $100 by the end of the year. It started a “Crypto Winter” and people had to reevaluate their strategies.\n\n2018: Reevaluation of The ICO Model\n\nIn 2018, the price of Ethereum experienced significant volatility, mirroring the broader cryptocurrency market. ETH reached an all-time high of over $1,400 in January before undergoing a sharp correction, falling below $400 by April. Regulatory uncertainty, security concerns, and the bursting of the ICO bubble influenced market sentiment. In spite of a harsh reality check for many, development continued and Ethereum moved forward.\n\n2019: Consolidation and Recovery\n\nDevelopers focused on improving the platform’s scalability and usability, laying the foundation for future growth. Prices remained relatively stable throughout 2019, fluctuating between $100 and $300 per ETH. This period of consolidation allowed the Ethereum community to regroup and prepare for the next phase of development. This was also the start of a wider COVID-19 pandemic which triggered wider economic collapse.\n\n2020: DeFi Explosion\n\nIn 2020, Ethereum emerged as the backbone of the decentralized finance (DeFi) movement. A wave of projects leveraging smart contracts and decentralized exchanges proliferated, driving demand for ETH. Prices surged once again, reaching over $600 per token by the end of the year. The explosive growth of DeFi highlighted Ethereum’s potential to disrupt traditional finance and usher in a new era of decentralized applications.\n\n2021: The NFT Craze\n\nThe year 2021 witnessed another boom in Ethereum’s price, fueled in part by the rise of non-fungible tokens (NFTs). Artists, creators, and collectors flocked to Ethereum’s blockchain to buy, sell, and trade digital assets, pushing ETH prices to new all-time highs. By May 2021, ETH had surpassed $4,000 per token, propelled by the growing mainstream adoption of NFTs and continued interest in DeFi. Ultimately, the NFT industry would go through a similar boom, bust, and recovery as the ICO model, with multiple scams and overvalued trades taking place.\n\n2022: Market Volatility\n\nIn 2022, Ethereum faced increased volatility as regulatory uncertainty and macroeconomic factors weighed on the cryptocurrency market. Prices fluctuated between $1,500 and $3,000 per ETH, reflecting the broader instability in global financial markets. Despite the challenges, Ethereum’s underlying fundamentals remained strong, with ongoing development efforts and growing institutional interest supporting its long-term outlook.\n\n2023: Maturing Market\n\nBy 2023, the cryptocurrency market had matured significantly, with Ethereum firmly established as a leading blockchain platform. Prices stabilized around $2,500 to $3,500 per ETH, reflecting a more balanced market sentiment and investor confidence. Continued innovation in DeFi, NFTs, and other blockchain applications further solidified Ethereum’s position as a key player in the digital economy.\n\nLooking Ahead\n\nAs we look ahead to the future, Ethereum continues to face both opportunities and challenges. Scalability remains a pressing issue, with the upcoming transition to Ethereum 2.0 expected to address these concerns. Institutional adoption of Ethereum is also on the rise, with major corporations and financial institutions exploring the potential of blockchain technology."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE95cGN1elFLMHU0MEV4aW9KWk5aMnFJY18xNUtEdmhLdVZRbWNLUUozMk55Yl9qc2pITXQ3V0JkVlUtWFZtQ0pOX2R0WDB0bXlERlltbXFJSUhHcmZpTE0tUnpaQ3NwdWlkdWpLSlVWMnVjU3o3aGlJ0gF8QVVfeXFMT3RhTmphQklWR1VtREZZb1o4VkNVQW9CZExPM1Jxa3Q2Mm02eGVCSjZtVXhiamczd2xEWTdEX3JUX21EeHhabkJOZkxmR3NGTDVXejVvRWJqNU5PMXcwZnZYaC1KbzJhSk1oTWZueXlsc0dob0QyRm5XdWFYVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Not Happening in May, Top Analyst Claims - U.Today",
        "content": "Advertisement\n\nNate Geraci, president of the ETF Store, has noted that the general consensus is that the U.S. Securities and Exchange Commission is not going to approve spot Ethereum exchange-traded funds (ETFs) this May.\n\nThis is due to the lack of engagement with issuers over the past few weeks.\n\nEarlier this month, Barron's reported that discussions about spot ETFs have been \"very one-sided.\" This is very different from the constant \"back-and-forth\" that was observed on the cusp of the approval of multiple Bitcoin ETFs.\n\nAdvertisement\n\nThe SEC was not willing to offer any feedback about Ethereum ETFs, meaning that their approval is highly unlikely as of now.\n\nEric Balchunas, Bloomberg's senior ETF analyst, succinctly summarized that \"silence is violence\" when it comes to the SEC's interactions with potential issuers.\n\nAnother lawsuit?\n\nWith that being said, the SEC could potentially face another lawsuit if it rejects a slew of Ethereum ETF applications, according to Balchunas.\n\nBack in August, Grayscale managed to score a legal victory against the SEC, with the U.S. District of Columbia Court of Appeals ruling that the regulator was wrong to shoot down its Bitcoin ETF application.\n\nGeraci now believes that Grayscale could bring another lawsuit against the SEC over its reluctance to approve Ethereum ETFs:\n\n\"Have to assume Grayscale, but some other enterprising ETF issuer w/ deep enough pockets could view this as a basic marketing expense…Basically brand themself as “pro-crypto” & willing to go to bat for innovation,\" he said.\n\nDoes anyone care about Ethereum ETFs?\n\nSome have questioned the significance of spot Ethereum ETFs given that futures-based ETFs that track the value of the largest altcoin have attracted little attention.\n\nHowever, given the stunning success of Bitcoin ETFs, Geraci believes that Ethereum ETFs are still a big deal.\n\nEthereum's $379 billion market cap makes it a \"big enough deal\" for analysts and issuers to pay attention."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPQ20xd2pfU3RUVEQxUjY1cC0tNE4wcDZoOURRbzg2a1Z1bzZaN2Z4bF8wUmsyeVE0aDJQVVY1dzlSVXF1Mm02aWMzbUhFN1dnV2FoaS15em1iUG1lTlJPOC1PclRSbkE2TE15QXFZY2JncE84MEl0Z25sRWRSWk9KNFd2Q09odUlaODFMZU9oXzlqT3VZQ0VQVkJ0N3BrcnZi0gGoAUFVX3lxTE1MVzNwRXVQek1Ub2R1UkZZRUZwNzRsaEJkYXNGSDNpT0ZSbzVBaE9CWGFvb2d2NzJNR2xEa3lkeDExbTN1cEl5RFVXRnl1VEt1eUYxTzBlMFFXcXVOZXhtODhzLXFUcHdfX2kzdDR1VEJGaVRzVXp3ZzNMTXVEbVVGOWdXTVlraUNUbXdLbVlPNWYyZ3p4WUxaSURHQWwyRFpZMm9ZemFKQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Price Reclaims $66,000, Ethereum Sees Modest Gains After BTC Halving - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum, which experienced a spate of last-minute volatility ahead of the BTC halving on Friday, have since recovered from their roller coaster ride.\n\nAt the time of writing, the Bitcoin price is up 1.6% in the past day, hovering around $66,000 after having reclaimed that milestone for the first time in a week.\n\nThe cryptocurrency's block reward halving, which occurred on Friday, saw the reward paid to Bitcoin miners reduced from 6.25 to 3.125 BTC. Although it's usually the catalyst for bullish price action, the effect isn't always immediate.\n\nThere's one thing that did change right after the halving: Bitcoin transaction fees. For a short time over the weekend, the average fee to send BTC soared to an all-time high of $127 according to Bitinfo Charts. That's largely down to the launch of Casey Rodarmor's Runes protocol.\n\nAD\n\nAD\n\nThe Runes protocol picks up where BRC-20s left off. BRC-20 is a fungible token standard, which itself makes use of the Ordinals protocol and was developed by the pseudonymous dev domo. Runes is an attempt to make the process of creating fungible tokens on Bitcoin more efficient.\n\nSo where does Bitcoin go from here? Analysts at IntotheBlock, a blockchain analytics firm, say that BTC is currently sitting a strong support level—which they argue could make it more resistant to downward pressure.\n\n\"Bitcoin is currently positioned right on top of a key demand zone, with 1.66 million addresses having purchased it at an average price of $64,800,\" they wrote on Twitter. \"This price point could potentially act as a strong support level should the market experience further downward pressure.\"\n\nETH, meanwhile, bounced back above $3,000 on Friday and has managed to maintain that price level throughout the weekend. At the time of writing, the Ethereum price is sitting just above $3,200. That's a 1.3% gain in the last 24 hours and only around 1% shy of its price this time last week.\n\nAD\n\nAD\n\nThere could potentially be some good news on the horizon for Ethereum and Bitcoin. Hong Kong has conditionally approved spot ETFs for both assets. Firms there believe they'll get the green light to begin issuing shares before the end of the month. When trading does begin, analysts are predicting that it could help dispel unease around cryptocurrencies in the region, potentially bringing $25 billion worth of new liquidity into the market."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNX1E4OGxEdjMxU1d1MmVUWkc2UTNoeVRNa0RqdVQzbXljc2lQMjUwdkhWc2phYm0yRGtqeDRBWmRPUWtDd0NGaTU1Wi1xbmZ4WmNDcHEwRHFETGRzdXVHYkNVbGpmd3NFaG5Qb3FMVFdBLUt2NE8zdnl4TlBxbV9WTEFadERTN0g0S1ZqejZURm9fR0JPbGlaTkZ5OTR0UVV3SGJZY3BoM09RaUJrYkJ5dzV5Mm16RjFyWHlCMlVwZ9IBxAFBVV95cUxOcHlad2g1UzJBek5OZ05YdEtkekYzaGoyZnJISTNtUFd2eEtkTWJfamp3VE5QWGdScEl1Q1pWeFFSR3RnT1M1OG9COWd2ek0zOWhINW45eTFIS3k2Y0FzQndzaUVkS2lkQ0ZtMXQyQUZIcEZYTmwwR2p2OW1lYl9lZXpSOG5Hd3AxbzVwVTVKdHRaUUk5cVdMc09VeXZ4eUNDNWNyVUIwOVlaRFpMY3JJLW9ONV9PdG9pMVNQOUlDbldXamd0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Giant Whale With $405,190,000 in Ethereum Starts Withdrawing ETH From Binance: On-Chain Data - The Daily Hodl",
        "content": "Crypto whales are currently on the move as one large entity with nearly half a billion dollars worth of Ethereum (ETH) was spotted withdrawing coins from crypto exchanges.\n\nFirst seen by blockchain tracking firm Lookonchain, an address beginning with “0x4359” was spotted taking their ETH out of Binance and decentralized exchanges (DEXes).\n\nLookonchain says the whale has accumulated about $405.19 million worth of ETH in less than two weeks.\n\n“This giant whale withdrew 10,119 ETH ($31.85 million) from Binance…\n\nHe has bought 127,388 ETH ($405.19 million) from DEX and Binance since Apr 8th, with an average buying price of ~$3,172.”\n\nOn the same day, another unknown entity was spotted by whale tracking service Whale Alert sending 14,408 ETH worth over $45.745 million to crypto exchange OKX.\n\nWhale Alert also tracked down a wallet that was involved in the initial coin offering (ICO) of Ethereum move 197 ETH worth $622,685. The wallet had been dormant for nearly nine years prior to the latest transfer, according to Whale Alert.\n\nAnother whale was seen attempting to leverage-long Ethereum, after previously losing millions trying to do the same move. Lookonchain identified the entity borrowing USDT from the lending platform Compound (COMP) to long ETH.\n\n“This whale went long ETH again.\n\nHe lost two times while long ETH, for a total loss of $4.5 million!\n\n[On Sunday], he withdrew 8,249 ETH ($26.18 million) from Binance and deposited it into Compound, then borrowed 17.3 million USDT from Compound.”\n\nAt time of writing, Ethereum is trading at $3,222.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNc3FUVGl0XzAwLTR3TzVGLW5COFpFRUt5S1dhSXpXN3ZrZk5JQi1qZjVOS19hblBrZ3hhZnIxTDNJa2xfWE1xQlZUOE1hM21SUlIzN3E2YVNBMzg1Z2ZCMWlGSWtDeWJCWU9LVzZ6OWdkSHZfTEMzQUVKVTF2ZXMxZDZ1RDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Furrever Token Presale ROI Soars, Catching Attention of Bitcoin (BTC) and Ethereum (ETH) Enthusiasts - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 22, 2024 (GLOBE NEWSWIRE) -- As Bitcoin (BTC) and Ethereum (ETH) continue to ride the wave of excitement surrounding their recent halving events, cryptocurrency enthusiasts are eagerly anticipating whether Furrever Token ( FURR ) will seize the momentum and catch the presale hype train. With BTC and ETH experiencing slight climbs post-halving, investors are speculating whether FURR, with its unique approach to infusing cuteness into the crypto space, will capitalize on the current market sentiment to propel its presale to new heights. Join us as we delve into the intersection of traditional cryptocurrencies and the whimsical world of Furrever Token.\n\nBitcoin (BTC) Halving Day and ETF Inflows Surge on 4/20 Caused a Slight Climb\n\nBitcoin (BTC) is currently trading around $65,177.84, marking a 2.5% increase since the halving event that took place yesterday. The timing of this halving has sparked curiosity, as it coincided with the infamous \"4/20\" meme date, leading to a curious alignment observed by Eric Balchunas, an ETF analyst at Bloomberg Intelligence.\n\nDespite a slowdown in inflows for Bitcoin ETFs since their peak in March, BlackRock’s iShares Bitcoin Trust (IBIT) continues to attract consistent inflows, with 69 consecutive days of positive inflows. Other ETFs, including those operated by Fidelity Investments, also saw significant inflows on April 19, signaling a potential return of momentum.\n\nWhile outflows from the Grayscale Bitcoin Trust (GBTC) were modest on the day, recent Form 13F filings have raised concerns about the penetration of Bitcoin ETFs into the mainstream investment landscape. However, Balchunas remains optimistic, likening the asset managers' approach to Bitcoin ETFs to \"hot sauce,\" suggesting that while the number of holders may be relatively small, there is significant potential for growth and adoption.\n\nOverall, the surge in ETF inflows on 4/20 raises questions about the future trajectory of Bitcoin's price and the broader adoption of cryptocurrency ETFs in traditional investment portfolios.\n\nEthereum (ETH) Surges 4% Post-BTC Halving: Whales Return as Investors Seek Alternatives\n\nEthereum (ETH) has surged by 4% to reach approximately $3,163.71 following Bitcoin's halving event and the ensuing market hype. This uptrend in Ethereum's price mirrors the overall positive sentiment across the cryptocurrency market, with total market capitalization rising by 3.5% in tandem. Notably, the gains in Ether versus the U.S. dollar are largely attributed to capital inflows from the Bitcoin market, driving the ETH/BTC pair up by roughly 2.5% to 0.048 BTC on April 21. This ETH/BTC ratio surge, along with the Ethereum Dominance Index (ETH.D) growth of over 1%, reflects a pattern observed after previous Bitcoin halving events. Historically, Ethereum has seen increased capital inflows from Bitcoin investors seeking new growth opportunities post-halving. Furthermore, Ethereum's latest gains coincide with a period of accumulation among its wealthiest investors, as highlighted by the increase in Ether supply held by addresses with significant balances. Technical indicators also suggest strong support for Ether's price, with key support levels aligning closely with Fibonacci retracement lines and moving averages, indicating an attractive entry point for traders.\n\n\n\n\n\nFurrever Token (FURR) Rides the Crypto Resurgence: Presale Momentum and Up to 15X Returns Propel its Charm\n\nIn the midst of the crypto market's resurgence following Bitcoin's halving and Ethereum's notable surge, Furrever Token ( FURR ) emerges as an intriguing contender poised to capitalize on the renewed enthusiasm. Priced at an enticing $0.000564, FURR offers investors an opportunity to partake in a project that transcends the traditional boundaries of cryptocurrency, infusing the space with an irresistible dose of cuteness and charm.\n\nAs FURR continues its journey, it is currently in the midst of its presale phase, which has already garnered significant attention and support from investors. With over $1,000,000 raised thus far and nearing the completion of stage 7 out of 10, FURR demonstrates strong momentum and investor confidence. The presale, with its ambitious target of raising $1.9 million, presents an opportunity for investors to participate in the project's growth at an early stage, potentially reaping substantial rewards in return.\n\nOne of the most compelling aspects of FURR's presale is its offer of up to 15X returns, a tantalizing prospect for investors seeking high-growth opportunities in the crypto market. This generous return potential underscores FURR's commitment to delivering value to its early supporters and incentivizing participation in its presale. Moreover, the absence of buy and sell taxes when trading FURR further enhances its attractiveness to investors, offering a streamlined and cost-effective investment experience.\n\nWith its unique blend of cute cat-themed imagery, engaging community initiatives, and robust tokenomics, Furrever Token (FURR) stands at the forefront of innovation in the crypto space. As it rides the wave of excitement generated by Bitcoin's halving and Ethereum's rise, FURR has the potential to further increase its momentum and solidify its position as a leading project in the crypto landscape. By leveraging its current market momentum, FURR can continue to attract investors, drive community engagement, and deliver on its promise of revolutionizing the crypto space with cuteness and charm.\n\n\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPTDA4WVZwbGt0QzJoX1hoMl9DU2NoOUNwOHM1dHlmTHhOXzd0ekwwVFQ3b1d0SGc2T2ZlSVV4TGdtTm5YUlVmbGNQQUxmLWNDX1k5RUxkWU5vRkRhbVdRZ3NXam5TTUpmQUN0SWtEVGNydWU2bUVNTVk1eEZFWHd4MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: 2 Reasons Why ETH Price is Rising ? - CoinGape",
        "content": "The long anticipated Bitcoin halving is finally completed, after Ethereum (ETH) saw slow growth amid the recent market crash. This was partly fueled by the fading expectation of SEC approving Ethereum ETFs in may. ETH experienced losses by 15% slightly over a week ago, losing ground to Bitcoin. Although there was no immediate reaction to the halving event by top cryptocurrencies including Bitcoin itself, Ethereum (ETH) has since seen an uptick of approximately 0.8% in its market value. As investors and enthusiasts closely monitor the next move of Bitcoin and altcoins, let’s unravel why Ethereum price is rising.\n\nCurrent Market Performance of Ethereum Price\n\nadvertisement\n\nOver the past day, the price of Ethereum has risen by 1.39% to $3,214.11. This increase maintains a favorable pattern for the week, increasing by 2.16%, but exhibits an 8.40% drop over the month. This shows potential volatility and market correction in the long-term\n\nEthereum holds the second position in market capitalization, according to CoinMarketCap, amounting to $385.8 billion. The token has experienced a slight increase of approximately 1.8% in its trading activity, by recording a trading volume of $10.16 billion over the past 24 hours.\n\nETH has been trading between a low of $3,119.55 to a high of $3,210.30, indicating moderate volatility within the day. However, when compared to its all-time high of $4,891.70 it achieved on November 16, 2021, the token has recorded losses of 34.69%, indicating a notable pullback from its highest point.\n\nWhale Activity\n\nThe recent surge in Ethereum’s price is underscored by significant on-chain transactions, particularly one involving a substantial withdrawal of 10,119 ETH from Binance, indicative of a notable Ethereum whale activity. According to Lookonchain investor has been progressively accumulating Ethereum, amassing a total of 127,388 ETH since April 8, totaling around $405.19 million.\n\nNotably, the average purchase price of this whale, standing at $3,172 per ETH, signals a bullish long-term outlook on Ethereum’s potential within the market.\n\nAdding to the rumors is the participation of Justin Sun, the creator of Tron (TRX), a well-known figure in the crypto world recognized for his financial ventures and public remarks. Claims imply that Sun has been buying Ethereum, with evidence suggesting that a wallet reportedly linked to him has been accumulating a substantial quantity of ETH since the start of April.\n\nThis wallet’s activity aligns with a pattern observed from March 31, wherein large sums of stablecoins were moved from Binance to Ethereum, followed by substantial purchases of ETH from both Binance and decentralized exchanges (DEXs).\n\nThe similarities in transaction behavior between this wallet and another previously linked to Justin Sun, which acquired Ethereum in February, further bolster the speculation that Sun may indeed be behind these transactions.\n\nIn total, the suspected wallets attributed to Sun have reportedly acquired 295,757 ETH, valued at approximately $891 million, since February 12, at an average price of $3,014 per ETH.\n\nThese transactions, coupled with the ongoing interest and investments from notable figures like Justin Sun, contribute to the upward pressure on Ethereum’s price.\n\nCurrently, Ethereum is still being traded at $3,206.30, indicating the current market trends and investor feelings towards the digital currency. The participation of powerful people like Sun illustrates the changing interactions within the Ethereum community, emphasizing its importance and possibility for more expansion.\n\nStrong Support Levels and Bullish Technical Patterns\n\nVarious crucial factors can be credited for the recent increase in Ethereum’s price. During the pre-halving consolidation phase in the wider cryptocurrency market, Ethereum successfully held its position above the important $2,875 level. This level aligned with the 38.2% Fibonacci retracement level, giving buyers a strong base to take charge of the market direction.\n\nFurthermore, the strong pullback seen in Bitcoin’s halving phase helped boost Ethereum’s price, driving it to peak at $3,198. Upon further analysis of the 4-hour chart, it is evident that a double bottom pattern has emerged, which is a common technical formation seen at the end of a downtrend, indicating the possibility of a substantial increase in price. This trend, along with the strong market momentum, boosted buyers’ confidence.\n\nWith Ethereum’s price showing positive momentum, there is hope it will exceed the key resistance level of $3,300, boosting buyer confidence and possibly extending the recovery process. If this breakout occurs, Ethereum may reach higher price levels, with forecasts suggesting a potential rise to $3,730, then $4,100.\n\nConclusion\n\nAs Ethereum continues to defy market pressures, its resilience above key support levels and the formation of bullish technical patterns signal a potential uptrend. With buyers eyeing critical resistance levels, the stage is set for further price appreciation in the near term."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQdXlDRGx1Z21uMEZzMVBTM0hlREZkR3h5N3JScHNQdU9JT293SEsxTzlOTVVPd2RnLVhEZ25ZcmJweUlvNmRaQXF3VkQtUTNocDdsSU5EV24zaFBFZDZBVjIxYzJCWDdsUVp6Q01ReDk2TF96NTJDS2VpWDFxd2FMVGR0d9IBiAFBVV95cUxQeFc2SVpDcEFJSElXb3dKMk44UHpLVGNjVDNneWU5Y1pCUkxJNjlka3Y1UEhGeFFJTW9zZVJTSlRHckY1alBZVVR2T01NaDl4MTZRY2hVVGZuak5BdUFzVVY0SDRDVGhZYnY1X3M5SHdTcUF3R1NJTUgwM3oxUC1qZGduY0RBSEc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "All about the state of Ethereum after Bitcoin’s halving - AMBCrypto News",
        "content": "Ethereum sees more outflow but fewer new stakes.\n\nETH continued its recovery post-BTC halving.\n\nAs the Bitcoin [BTC] halving approached, altcoins experienced a price decline. Analysis indicated that Ethereum was among the assets that witnessed substantial recovery following the halving.\n\nHowever, the recovery of ETH staking remained elusive.\n\nEthereum daily staking drops\n\nAMBCrypto’s examination of Ethereum’s staking chart showed a significant downturn in the volume of new stakes over the past few days.\n\nThe chart indicated that at the beginning of the previous week, there was an uptick in the volume of staked ETH, peaking at over 115,000 by the 15th of April. However, this volume began to decline.\n\nAt the time of this writing, the volume of new stakes was 31,441, marking a decline of over 80,000.\n\nThough not the lowest daily figure recorded for ETH, if this decline persists, it could set a new record low. Additionally, the total ETH staked surpassed 43.9 million at press time.\n\nDespite an overall increase, a detailed analysis of the chart suggests that the progression has been nearly stagnant, indicating a lack of significant influx in recent times.\n\nOutflows dominate the Ethereum flow trend\n\nExcept for the 20th of April, Ethereum has witnessed more outflows than inflows in recent days.\n\nAMBCrypto’s analysis of the Netflow chart on Glassnode revealed that by the end of the date, ETH experienced an inflow of over 20,000, significantly lower than the volume of outflow.\n\nOn the 18th of April, ETH encountered an outflow exceeding 144,800, marking one of the largest outflows recently.\n\nAt the time of writing, over 14,000 outflows had been recorded, indicating a trend where more ETH is leaving exchanges.\n\nBased on the trajectory of the staking chart, it’s evident that most of the withdrawn ETH is not being staked. This presented a positive indicator for the asset, suggesting that holders anticipated a price increase.\n\nThis sentiment was particularly strong given the recent Bitcoin halving, fostering beliefs that a rally may commence.\n\nETH remains in bear trend\n\nAMBCrypto’s look at Ethereum on the daily timeframe revealed a positive conclusion to the week. ETH experienced a more than 3% increase, reaching approximately $3,157 by week’s end.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIt commenced the week near $3,158 but faced several days of declines after that. At the time of this writing, it was trading at around $3,177, with a rise of less than 1%.\n\nIts Relative Strength Index (RSI) indicated that it dipped below the neutral line on the 11th of April. At the time of this writing, it remained below this line, though there was a noticeable improvement."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOa0NjRWhSQVhWdlZVaWJ0bGZtRng1dnBBTlNxRXpSb2RuSGE5UE5zcnN0bVJGeHh3bjV1dElWNE44NlVEb3FkN1NLeW1fa1k3dXJrb3lQUU5lWWJBbFJPWGE5d2JxaFlUS1hLWjBKUWJhTGNDVDZlNkpXMk04UUtuckJ4SEg2WkFxMHdrcWhua245STJrdXZSQ0xOZFlIZVF5Ujg00gGoAUFVX3lxTE1YbzdOMnV4WGlObFJyc2s1bXppZF9jT2JjVzlCOGtyS0dWcFFsTmxoU1RCY2xKT1doOFF4aXo5SnVaRklZemdRUUpKSTBiV2NsX08weHZOaHlmdDN0eW1WdDdmaVRLYVVVZFYwbVpiMDJ5Uzh5YXV6enBpS3Uxc3A0dmdkQmcyU1lLV0M1VHhtelRGT3BNdm40bFZKYW90SURPd2Rub0dfNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Over $500M Ethereum (ETH) Left CEXs as Market Prepares for Impulsive Move: Data - CryptoPotato",
        "content": "Data from IntoTheBlock revealed that investors withdrew approximately half a billion ETH from centralized exchanges last week, the highest the asset has seen since February.\n\n$500M ETH Leaves CEXs\n\nThe withdrawal of large amounts of ETH from centralized exchanges signals investor confidence in the long-term price trajectory of the asset. Market participants usually withdraw their cryptocurrencies from centralized trading platforms to hold the assets in their private wallets or cold storage in anticipation of higher prices.\n\nSuch large withdrawals have been considered an indicator of bullish sentiment and holding attitude among investors. Most of the time, ETH has recorded substantial gains in the weeks following large withdrawals from exchanges.\n\nAnticipation for higher ETH prices could be attributed to the approval of spot Ethereum exchange-traded funds (ETFs) in Hong Kong and the just-completed Bitcoin halving event, which has historically triggered bull rallies across the market.\n\nWith huge amounts of ETH leaving exchanges, supply could decline on such trading platforms and high demand from large entities like the spot ETF issuers could propel the digital asset’s price upwards, per the laws of economics.\n\nFutures Market Poised for Impulsive Move\n\nWhile investors reduce their ETH holdings on centralized exchanges, the Ethereum Futures market shows that it is on the brink of a resurgence of long or short positions. A CryptoQuant Quicktake by pseudonymous analyst Shayan disclosed that the Ethereum market may be on the verge of a fresh and impulsive move either northwards or southwards.\n\nShayan explained that futures market sentiment significantly impacts price movements because the intensity of long and short positions, as well as the possibility of large liquidations, acts as a catalyst for volatility. This sentiment can be determined by the state of open interest, which indicates the number of open perpetual futures contracts across several cryptocurrency exchanges.\n\nNotably, open interest in Ethereum declined during ether’s recent plunge to $2,900 amid escalated tensions in the Middle East. The fall suggested a pipedown of activities in the futures market.\n\n“Consequently, the market appears poised for the resurgence of either long or short positions, potentially initiating a fresh and decisive market movement in either direction,” Shayan said."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPSnNZdVZaSW1mYzdITWZDODNjWFVfRkZkQnZMMXA0TzFnN3ZVemtLbVh4MXVRNkJueWhScEk4SzlabUJqU1pnRTBzM3RibnFnR0JlYjl5d0l4U3U2R0NnYXBJSmNVUGw2cWxPQjc2SFBoYUgxQTBVeFFWdmpCdmNyaU9mMnk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum April-End Price Prediction: Can ETH Hit $4,000? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, rising by 1.2% in the last 24 hours. At press time, ETH is trading at $3,216, according to CoinGecko data. ETH is up by 73% year-to-date and has regained the $3,000 level recently.\n\nAlso read: Cryptocurrency: Top 3 AI Coins To Buy For 2X Profit\n\nSource: CoinGecko\n\nEthereum Price Prediction for April-end\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for April end. According to their analysis, ETH is expected to reach a minimum price of $3,049 and a maximum price of $3,151. The average price is expected to be $3,100.\n\nThe prediction reveals that ETH is unlikely to hit the $4,000 level by the end of April. The recent surge in Ethereum’s price has been largely attributed to the pump after the Bitcoin halving. With Bitcoin once again back above $66,000, ETH has renewed its rally.\n\nAlso read: Shiba Inu April End Price Prediction: Can SHIB Delete A Zero?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxOTzEwcjI1amgtMEJEWUtzVlVCR2hGblN2eTNCa1J0Sl9JQ1paWW9vMlF2ZTJQR1R2OU8xUkl4OGMxSmJwNXctX29jOFhDOEYzSkRtcWIxZWdnX0FualpCN1hfSEduSm9HRm9WMGw0Z1Y0VDhnZjJ4TmNTZGJWbEJ5RGFHaklFSV9KY0RrWkE2UVJjYUlrUHdldmVQdlh2N2ExTkYzZklTREM0VlREcjNDOHktUS1qdU9hSncxOG0yeTUwVTh3SWJJdUp6SHJYVW02ZjlESWJRR0xFZ2JUTmtodE4xTDJIMUnSAewBQVVfeXFMTnY0VEtURFFXSk9ldVAxa2IteTBkX3NTamhjWWtDbnJFazJrb0F5Mm5MQlhMX2plT083WGFqTVhLdGQ3a005a1NneFotY2JBUVEyQnFWZGZUTGgtazJiLU93Z3hnaWtQVVpwTWFCWDM5NEdCTzB5M0N3RVJQd2tIWmxGTl9GWEltUUdSRkRzbVhVRkhVdFNWcjlQZjZIY24xZVZFeGhkOE8yRVVjbFBFaVFTQ25aVVNmLU40UkhZY0plLU8xMFpQei02U0w3NjFtXzliaU5uZS1fbnR3Q3FJM1d3cXltZGo0Tmsxc0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC dominance drops as rotation starts slowly - FXStreet",
        "content": "Bitcoin price is likely to suffer rejection as BTC market shows cautious optimism after halving.\n\nEthereum price making a strong close above $3,238 could kickstart a 15% rally to $3,750.\n\nOnly a candlestick above $0.6791 would make Ripple token attractive to buy for XRP bulls.\n\nBitcoin (BTC) price is trading with a bullish bias following a successful halving event that has since renewed optimism in the market. With it, Ethereum (ETH) and Ripple (XRP) prices are showing promise, amid calls of a looming altcoin season.\n\nPost-halving, markets are gathering modest gains. Meanwhile, Bitcoin dominance is going back down after establishing a peak of 57.03%. As it continues to drop, the rotation is slowly gaining steam in favor of altcoins. A drop in dominance below 54% could be a good confirmation.\n\nBTC dominance\n\nAlso Read: Is Bitcoin sucking liquidity from altcoins, or will alt season begin again?\n\nBitcoin price at the cusp of a pullback\n\nBitcoin price is stuck within the lower section of the market range, confronting overhead pressure from the 50% Fibonacci placeholder of $66,727. The market is leaning in favor of the downside, with the Relative Strength Index (RSI) appearing subdued after spending quite some time barely above the 50 mean level and hinting at buyer exhaustion.\n\nThe Moving Average Convergence Divergence (MACD) is in negative territory. While it is above the signal line in the 12-hour time frame, the positions are reversed in the daily time frame, showing a continuation of the bearish sentiment. The Awesome Oscillator (AO) indicator in negative territory accentuates this.\n\nBitcoin price is likely to reverse to $63,284, followed by a subsequent drop to $60,000 before a possible pullback. Notably, there remains some uncollected liquidity below this level, marked by the March 5 low of $59,005 and whose residue needs to be collected for balance.\n\nBTC/USDT 12-hour chart\n\nHowever, if the bulls can manage to breach the $66,727 roadblock and move above the most crucial Fibonacci retracement level of 61.8% at $68,391, it could open the expanse for extended gains, potentially as high as a new peak above $73,777.\n\nAlso Read: Bitcoin price nicks $66K after halving as BTC transaction fees reverse\n\nEthereum price could rally 15%\n\nAmid speculation of an altcoin season, Ethereum price could rally 15% to $3,750, levels last tested around mid-March. This could be driven by an altcoin season, with ETH bulls primed for a rally as showed by the buy signals on both the RSI and MACD indicators, which have already crossed their respective signal lines.\n\nIn a highly bullish case, the Ethereum price could extend a neck higher to $4,093, nearly 30% above current levels.\n\nETH/USDT 12-hour chart\n\nConversely, if traders succumb to their profit appetite, Ethereum price could retract 6%, losing all the gains made over the past few days. In a dire case, the slump could extend to the April 13 low of $2,850, 10% below current levels.\n\nAlso Read: Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies\n\nRipple price must rise 25% before XRP bulls flock the scene\n\nRipple price is bending to the alt season narrative, but XRP bulls will only come in after the price closes above the 78.6% Fibonacci retracement level of $0.6791. With the RSI and the MACD teasing with buy signals and the AO showing a bold resolve by the bulls to recover the market after multiple successive green histograms, the upside potential for XRP continues to grow.\n\nXRP/USDT 1-day chart\n\nConversely, a rejection could send the XRP price south to find initial support at the $0.5000 psychological level or lower at $0.4500. A lower low below $0.4188, however, would invalidate the bullish thesis.\n\nAlso Read: XRP Price Outlook: A breakout or significant price movement may be imminent for Ripple’s token"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQTkc1NmJBM1IxMDZLVW1KSzlrNWhqUkE3YjQ4Zlpqc25aRWNjZEdwMkJidXVNdVRCajNxNkR1T2ViYkl6bUxRNllzZWdEOTFDcHozWWJ5STgwcEp5TE4tM2wxTFZhbDNEZk1MaTJRZS1JcVdJVE92eHdFb1Rvc0QtNFJCTERFME1kbC1kbVdGVGZzUDdOTkhwTmN5MWlDYTJTWU92bTYwNzFlWG96ZVBLNzFjb1QtelBFWktOY09lZ0xXQdIBxwFBVV95cUxNaDM0ZmlvUGR1WVBIQWJHNHpOUk1wYTAwN2ZWN0kyMnFENWhzX0JkZmd4TE5WdC1Mb1pHYXdlVHFWcEJ3MDYwWGZ0U1dJZElVbmRsbE9DaHJsbjdPOHp4dVAycXVuRkZ2emVwNXJKaDJ6cVhzMVFMTTA0aU1Yb2R0S3lwNzhJTXpLUGRqYmp4VFJiMk1YZ0xyemV1dTY1Q19GZWtOcmhRanp2cDZPdkJwalJrb3VaSzNPN0NNdUcxSmUtQmlDNVFj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "‘This Time for Real’ – Trader Predicts Ethereum Rally, Updates Forecast on Two Low-Cap Altcoins - The Daily Hodl",
        "content": "A closely followed crypto trader says Ethereum (ETH) is gearing up for a rally, and that he’s bullish on two other altcoin projects.\n\nPseudonymous analyst Inmortal tells his 212,000 followers on the social media platform X that ETH is setting up for its “real” rally after bouncing off support near $2,900.\n\n“This time for real.\n\nETH.”\n\nLooking at the trader’s chart, he seems to predict that Ethereum is almost ready to rally toward his target at around $3,600.\n\nAt time of writing, Ethereum is trading at $3,226.\n\nThe analyst is also bullish on Seedify.Fund (SFUND), an incubator and launchpad specializing in blockchain gaming.\n\n“Wow.\n\n> Double bottom\n\n> -50% dip into support\n\nLast time we dipped into this zone price bounced +100%\n\nSFUND.”\n\nInmortal also says once SFUND breaches the $3 level, that’s when the “magic” will happen. At time of writing, SFUND is trading for $3.12 at a $197.841 million market cap.\n\nThe trader also has his radar locked on Radix (XRD), a decentralized finance (DeFi) focused layer-1 blockchain project.\n\nAccording to Inmortal, XRD has gone through more than 500 days of accumulation, implying that a breakout of the range to the upside is overdue.\n\nSays the trader,\n\n“Retesting a +500 days accumulation\n\nJust bought some.”\n\nAt time of writing, XRD is worth $0.055, still more than 91% down from its all-time high of $0.6513.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPV1ViQ1FXbE9ocXY0T2FSSXRtSEYtUVZEb1NiUk5UQUQ5NmlwSHF4Mk9objNDTFluUWJDdjgtOFpqNEpGWTBQQzFFRFg5dE9HczZlNERCSEdrR3hqLWgtMjlGTWs3cVBJQmVjM2NxQWk5RzFZRWRPWm5kOS1uY3FQeUFXMklQY1pQdGtCWdIBlAFBVV95cUxNU1FrbUl4Wk1SMWdWVUdkREY5cjl0ZXo3NU5lVnZ6VHZGeWJEQnNWZFdqaXN5V2o0VFhqT01xaTMxNkdNcFliczVlM2NVTm1YNUp0TDNZNG1pZWJWM0Z2VXM3UTlFM1hubDY4ZF9JWTAyWFYzbzV5TFhPLTFzZFVvQUFZb1JUM2Y4allKdFRnZ09rRXR4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Meme Coin Pepe Surges 16% on Coinbase Perpetual Futures Listing - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe cryptocurrency market is starting the week on a relatively calm note following the buzz around the Bitcoin halving, with the global crypto market cap sitting at $2.56 trillion, a 2.7% change in the last 24 hours according to data from CoinGecko.\n\nBitcoin and Ethereum are both up less than 3% today, and the trend is pretty similar among the biggest tokens in the crypto industry. However, the Ethereum-based PEPE, one of the most popular meme coins of 2024, is defying market trends and is one of the best performers in the top 100 coins by market cap today.\n\nIn the last 24 hours, the price of PEPE went from $0.00000572 to its current price of $0.00000666 for a 16% spike, and a sizable 30% jump in the last seven days. Although it's down nearly 13% in the last 30 days after suffering a major correction, the token's technical indicators suggest that it's recovering and could be bouncing back to a bullish trend.\n\nThe price surge comes after Coinbase International, the global branch of the largest U.S. crypto exchange, announced the listing of PEPE perpetual contracts. This move is significant as it adds liquidity and increases the asset's exposure.\n\nAD\n\nAD\n\n@CoinbaseIntExch will add support for Pepe perpetual futures on Coinbase International Exchange and Coinbase Advanced. The opening of our 1000PEPE-PERP market will begin on or after 9:30am UTC on 23 APR 2024. — Coinbase International Exchange 🛡️ (@CoinbaseIntExch) April 22, 2024\n\nThe opening of Coinbase's 1000PEPE-PERP market was originally planned for April 18, but was delayed for technical reasons. Trading will now begin on Tuesday, April 23.\n\nAnd of course, such an event was met with enthusiasm—and memes—all over Crypto Twitter. Coinbase also announced perpetual futures around Dogwifhat (WIF), a leading Solana meme coin, with trading set to begin on April 25.\n\nIn addition to the Coinbase announcement, PEPE's technical indicators suggest a positive trend. The coin's price trend has finally broken past the EMA55 mark (the average price of the last 55 days), indicating a potential recovery from the previous crash and a possible return to bullish behavior.\n\nAD\n\nAD\n\nThe EMA10 (the average price of the last 10 days) is also on target to surpass the EMA55 mark. This event, known as a golden cross, is usually a confirmation of a bullish phase in which prices tend to go up faster with time.\n\nImage: Tradingview\n\nThe Relative Strength Index (RSI) is currently at 51, suggesting a balanced market with neither bears nor bulls dominating (more accurately, 51% buyers and 49% sellers). The Average Directional Index (ADX) at 20 is also weak, showing that the power of the bearish correction is starting to diminish. The Squeeze Momentum Indicator, which is used to determine which phase the markets are in, suggests that the bearish trend has lost force and the price is compressing in preparation for a bullish impulse.\n\nIn an optimistic scenario, PEPE could continue its bullish momentum and meet a first resistance at around $0.00000754 (for a 14.5% growth) or $0.00000882 (for a 33.6% growth, green line). However, in a pessimistic scenario, PEPE could fail to maintain momentum and test again the support of the last week at around $0.00000468 (for a -29% dip, red line).\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPRF83dGZDRC16MGlSWHZCUS1ydFdhVE5XbWxNZXBkblZjSTBtNlJQQm1DZEtWc0FvMHBCVTZOM0N4V1huZ0p0VFFiaG0wUzljRGdYdkQxTW9VSUJwRFlmTUNZT1dLcHlyeDNKaEY5YVNzVFV3M19UeVprZkRHMmxfcXJWYjdRb3F4LXVSQdIBkgFBVV95cUxNWUYycGlVYS1wb0FWUk5FaHZOU2lZMUF6dUg0cWVlaTR5Uy0xMUY4dEdPMXB1TER0ZTV0MEgxV05vVEduNk1xMVpIOURvTHJrZi1kc0RlYUVhQ1FMbjI0dkxqbko0Z2d4VUR2ajZVOFFFU2tldG9TTGkxQ1hMZWxpbFplVS1lblBEeGVuc04taWs2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: These 2 major factors will help shape ETH’s Q2 prices - AMBCrypto News",
        "content": "Bullish Ethereum whales got liquidated due to highly volatile price movements.\n\nHolders remained unprofitable despite rising prices.\n\nEthereum [ETH] has experienced massive volatility over the past week, causing traders to lose money left right and center.\n\nWhales see red\n\nNot only retail investors, but some whales have also been subject to liquidations over the past few days.\n\nAccording to Lookonchain’s data, a whale, despite previous losses totaling $4.5 million, doubled down on its ETH position, demonstrating confidence in the asset’s potential, and ended up losing money.\n\nThe investor also made a move involving the withdrawal of 8,249 ETH from Binance [BNB], converting it to Compound [COMP], and borrowing 17.3 million Tether [USDT] from the platform to make the sizeable bet.\n\nOther traders got liquidated as well. According to Coinglass’ data, $6.28 million worth of long Ethereum positions were liquidated within a 24-hour window.\n\nDespite these setbacks, the growing number of long positions taken towards ETH grew significantly.\n\nThis suggested a rising optimism among traders, reflecting a bullish sentiment towards Ethereum’s future prospects.\n\nImplied Volatility for ETH also surged in recent days, mirroring the heightened uncertainty and risk prevailing in the market.\n\nEven though a high IV is more bearish in nature and most traders prefer to short an asset during periods of high IV, the overall sentiment towards ETH has remained positive.\n\nLooking at the data\n\nIn the last 24 hours, ETH’s price grew by 3.78% signifying short-term bullish momentum. However, according to AMBCrypto’s analysis of Santiment’s data, the network growth around ETH declined.\n\nThis indicated that new addresses were losing interest in the ETH token.\n\nWhile Network Growth had declined, indicating a potential slowdown in new user adoption, the rise in velocity suggested increased trading activity and liquidity in the market.\n\nRead Ethereum [ETH] Price Prediction 2024-2025\n\nDespite the surge in price, the MVRV ratio for ETH remained negative at press time, signaling that Ethereum holders were yet to realize profits.\n\nThis scenario implied a continued holding pattern among Ethereum investors, potentially supporting further upward momentum for ETH’s price as holders awaited more favorable market conditions."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOMWtnWEhibDRTV1VUQjRXSzhfMW1mSzFaNzM0WjVwYXJ1Yi1nbGwyVnd4TlJGWE10bXE4Y2cwa2R2VjlqRnY1X1NTazdsaS1pWUhWaWdEQUJJd3VCcnVLblRsSldicHJhNGN3a1NMLUcwV1ZFX3pZRkZvV1JTOEluV1dUeVhHcEFFMmwxUGFVczbSAZgBQVVfeXFMUFhpQWp1V2dRMDkxUW5qSVVtUmxkSzdYZ1FrZmJoVmFUejhra1JnQ2V3YzNaMnpPbEp1elJocE9meGltaXZiS0M1Z3JjdTFnbERXLVJpUUQ1M0FoOFdBQXg4QS1VdDVOZE50NjQ5S0k1QjNiR3RUaXZXaThGWGJQMDlCeGIwLXR3dG5qaUZRWlAtMlVLZW9RbGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Solana, Ethereum Meme Coin Prices Blast Off as Bitcoin Stays Steady After Halving - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe latest Bitcoin halving took place late Friday, cutting miner rewards in half for the fourth time in history—but BTC itself is hardly the biggest winner in the crypto markets this weekend. Instead, it’s meme coins leading the charge, with some prominent tokens marking sizable double-digit percentage jumps in the last day.\n\nDog-themed coins are the biggest winners so far this weekend, with the Solana-based BONK charting a massive 37% jump in price over the last 24 hours alone, jumping to a current price of $0.000021 per data from CoinGecko. BONK has effectively returned to where it was before plunging on April 12 alongside much of the rest of the market.\n\nWhile BONK has seen the largest swing so far among the top 100 coins by market cap, other pup-centric meme coins on Ethereum are faring well too: FLOKI has jumped nearly 19% over the last day to nearly $0.00017, and Shiba Inu (SHIB) is up 14% to a price above $0.000026.\n\nOther hot meme coins at the moment include Ethereum’s PEPE, up 13% to nearly $0.000006, and the Solana-based Dogwifhat (WIF), which has climbed almost 8% to about $3.00.\n\nAD\n\nAD\n\nEthereum and Solana meme coin traders may be returning to familiar, established meme coins while other traders explore the new frontier of tokens minted via Runes, the new Bitcoin fungible token standard that launched alongside the halving. The protocol was created by Casey Rodarmor, inventor of the NFT-like Ordinals protocol.\n\nThere’s been immense hype around Runes as project creators raced to be one of the first to launch a Bitcoin token using the protocol, and users collectively spent millions to create and mint tokens during the first few blocks after the halving late Friday. But trading volume so far has been relatively modest, per data tracked by the OKX marketplace.\n\nThe most-traded Runes token over the last 24 hours, per OKX, is Satoshi Nakamoto, aptly named after the pseudonymous inventor of Bitcoin. The token has about $2.7 million worth of trading volume during that span, with a market cap of $136 million and a price of approximately $6.50 worth of Bitcoin.\n\nThat kind of market cap wouldn’t put the Satoshi Nakamoto token anywhere near the top 100 overall cryptocurrencies by market cap, per CoinGecko, which gives some sense of the current size of demand for early Runes. But some traders are betting that these early Runes will see wider interest in time as trading tools improve and the protocol becomes more established.\n\nAD\n\nAD\n\nBitcoin itself has failed to generate much short-term momentum after the halving. It’s up about 1.5% on the day to a current price just below $65,000, and at most has only climbed to about a 3% gain since the Friday night event.\n\nBut historically, Bitcoin’s biggest post-halving gains come several months later as the effects of the slowing supply increase start to be felt across the ecosystem.\n\nBesides, this has been a unique cycle in that Bitcoin actually set a new all-time high price in March, breaking its 2021 peak ahead of the halving, amid the rise of spot Bitcoin ETFs. Post-halving price action this time around is entering uncharted territory.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeThLa2NyODExdkpwOC1xYkVFNFpPTHFNWnU0M1ZXWEpDYTVmbjFVM0Jrb0ZJbHVPVmRIaVN0UWVBNWZ5LVQ0LWxZSEJ3T2RaYnhVWXJNczhSeU96MFRpWFZldkRXSGhsbllmRVRTeXljYzByM2l6MFl6blA5LUswQ1hLTmdRY2VMRzJj0gGQAUFVX3lxTFBCR3pZYlZ2ZGVOTWRqTjdrd3lvWUFXVTRMS2dEbHRsekx4Sjd2REQxNkkzamhxbFZiYkpyMml6QndrYjBkVnFINUtSX0phb0o4NVg1dzRTRkZGbm9KSkdiS3pRODFPSmk4LU9DUkNlNHYyaVJxU2JTTXRZZDgwT011bzJ0Nm5RTVI1VWtzcnR3aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Surges 3.66% Amid Ancient Wallet Activation - CoinGape",
        "content": "The cryptocurrency market has witnessed a surge in Ethereum (ETH) price by 3.66% over the last 24 hours, reaching $3,175. This surge coincides with the reactivation of an ancient Ethereum wallet that had been dormant for nearly 8.7 years, according to data from the crypto tracker Whale Alert. The dormant wallet, holding 197 ETH valued at $622,685, has sparked intrigue and speculation within the crypto community.\n\nSpeculation Surrounding Dormant Wallet’s Activation\n\nThe sudden awakening of the long-dormant Ethereum wallet has prompted speculation regarding its owner’s identity and intentions. Some suggest the possibility of the owner rediscovering lost keys, while others speculate that it could be a strategic decision to “hodl” until now. The wallet’s anonymity adds to the mystery, with no clear indication of the early ETH adopter’s identity or the reasons behind its prolonged dormancy.\n\nadvertisement\n\nSome members of the crypto community speculate about potential market movements signaled by the activation of the dormant wallet. In contrast, others view it as a personal decision by an individual or entity. Despite these speculations, the exact reasons behind the wallet’s sudden awakening remain undisclosed, leaving the mystery surrounding it largely unsolved for now.\n\nAs Ethereum regained the $3,000 price mark, on-chain sources reported a significant withdrawal of 10,119 ETH worth $31.83 million from Binance. Withdrawals of this magnitude are often interpreted as a signal of intent to buy within the market. The whale behind the withdrawal has been actively accumulating ETH, purchasing 127,388 ETH worth $405.19 million from decentralized exchanges (DEX) and Binance since April 8. This activity indicates a bullish sentiment towards Ethereum, with the whale consistently buying at an average price of approximately $3,172.\n\nICO Participant Sells Ethereum Holdings\n\nIn a recent development, Coingape reported on an Ethereum whale who acquired ETH during the Initial Coin Offering (ICO) phase and subsequently sold a portion of their holdings. The whale, who initially acquired 33,213 ETH during Ethereum’s Genesis ICO in 2015, has deposited 5,110 ETH to Kraken or sold via DEX at an approximate price of $2,545. Despite this sell-off, the whale still retains a significant amount of ETH, holding approximately 29.7K ETH valued at $89.4 million across three wallets, primarily within staking platforms.\n\nRead Also: XRP Lawyer Bill Morgan Criticizes SEC: Questions $2B Ripple Settlement\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOenkxOTNPcmMzWXJPcTVHQXpsQ1ByLUFsdlo2bVpIVklvSzhZVFd2RUQwcWdmd2J3M080Y0FiUU1abVVhZE1Ka0RPM3NoWldwNDNPeG05Rjl0X0MxWVlTU2N5WjBPOHdUamtBdDZFV2ZiNm9qRDlhb1BOSU9DcURfU0ROUGJubGVXZE00SWdpdWhQMFM4bFHSAZsBQVVfeXFMTkZ4QVI1QXRUMEhfWEJQVVl4SG1RQUNoRFA1SmN6NjBNRk5QV2NTYlE4ZWx4amNUS2VVSEFyM3FSdVR4XzZkRW9NWnFzRURRbmthdVlQeVByclFVTHJNNWdWUzBBRWY4U2tCS1hzbm1lQ0VzS3gxV1RGTDlKOEUyUTc2X1d1Vkp2bzZHTVBwOW56aUxMZnVXOVBueWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum spot ETFs – Why the SEC’s expected rejection isn’t all bad news - AMBCrypto News",
        "content": "Bitcoin’s post-halving hours saw a 2.31% dip, but ETF inflows surged and boosted investor confidence\n\nPotential expansion of crypto-ETFs beyond Bitcoin and Ethereum could drive mainstream adoption\n\nLooks like Bitcoin’s [BTC] halving brought its own share of surprises! After all the hype surrounding Bitcoin’s halving, BTC hit a bump on the road, falling by 2.31% in just 24 hours. This, despite the Bitcoin ETF market noting such a significant change. After five days of outflows, there was a sudden influx of positive net inflows right before the day of the halving.\n\nIn fact, according to Farside Investors’ data, five out of 10 ETFs recorded positive inflows totaling $59.7 million.\n\nThis underlined the growing confidence in Bitcoin’s pre-halving and post-halving performance among investors in the ETF space.\n\nExpansion of ETFs leading to crypto-mainstream adoption\n\nDiscussing the potential expansion of the crypto-ETF space beyond Bitcoin and Ethereum [ETH], Sergey Nazarov, Co-founder of Chainlink, in a recent interview claimed,\n\n“I think what’s next is more ETFs about coins other than Bitcoin and Ethereum. So, I think the ETF dynamic is going to continue during this year and just grow and grow and grow.”\n\nHis comments highlighted the potential for ETFs to drive broader adoption of digital assets and advance the mainstream integration of Web3 technologies.\n\nHere, it’s worth noting that in a separate interview, Anthony Scaramucci, Founder of SkyBridge Capital, also chipped in on the subject.\n\n“Bitcoin is on an adoption curve.”\n\nHe added,\n\n“You won’t see this inflation hedge, or a store of value as other pundits are saying until you get over a billion users. So, right now it’s gonna be way more volatile than the people like.”\n\nAll eyes on Spot Ethereum ETFs\n\nOn the back of Hong Kong’s recent approval of Bitcoin and Ethereum ETFs, positive steps are being taken towards mainstream adoption. However, while U.S-based ETFs have accumulated nearly $60 billion in assets since their launch, Hong Kong’s new ETFs’ success projections vary.\n\nEchoing similar sentiments, senior Bloomberg ETF analyst Eric Balchunas recently commented,\n\n“Other countries adding BTC ETFs is no doubt additive, but it’s nickel-dime compared to the mighty U.S market.”\n\nAll this leads us to a question – Will the SEC reject the spot Ethereum ETF applications?\n\nIn response to the aforementioned question, Hashkey Capital’s Head of Research Jupiter Zheng, responded,\n\n“If the ETF is denied, it will not be that bearish, as the market is not pricing in it yet. And, we still have Bitcoin ETFs as the entrance for traditional funds.”\n\nWhat dictates entry into the crypto-market though? Well, according to Nazarov, adoption does.\n\nAccording to the exec, to address concerns about mainstream adoption, the crypto-industry must focus on enhancing usability, scalability, connectivity, and privacy. Improvements in these areas would not only attract broader adoption, but also drive the industry forward by pushing its boundaries, he concluded."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNaEJZbDJqOHhDT2tYTEZXaHNLU2oyNWxSS1UxekptWVpXeHUwQmVoLTZBbjJrZVhGazl6RDkwMEItbDVKWER0MU1lRkxweklTWHEzb0d6cFM3TFVGTkRVWHFsX3ZCSUd0aXZYalZWTGM5U0ViNXlaN0picWNlS2VxX3Naand2aWo3NUg5XzZzVXlHTTZoNjFWSG00YnVzZEdleEZzN0l30gGrAUFVX3lxTFAtSmhXMzRzZ2R2SlBqZW1kV3pfTkJ3bjBLSVR5ZWtpdENOT2VKNTFMaHphVTBIYTliWlVFOTNnOEM0dE1rRkwyTFNZN1lNeDFZZzZpSDZBVDNROVh2STR5YUpmcFV6ZFBDVUNUMHgwUmFWNm1qRzlPTnRRUjFXdlZRTHc5ci11OFd2TFVqNGk0TjZ3Nnk5TGRjbkRSbEJVb2xMVUhnUXRsQnppcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Justin Sun Reportedly Scooped $890 Million Worth of Ethereum, ETH Price surge Ahead? - CoinGape",
        "content": "In recent developments, questions have arisen regarding whether Justin Sun, the prominent figure in the crypto space, has acquired a substantial amount of Ethereum (ETH). If true, this could further help boost the ETH price gain momentum to $3,500 and above.\n\nJustin Sun Wallet Shows Strong Ethereum Buying\n\nLookonchain, an on-chain data provider, highlights intriguing activities in whale wallets suspected to be associated with Sun. Since April 8, a wallet suspected to be Sun’s has purportedly acquired 127,388 ETH, amounting to $405.19 million.\n\nadvertisement\n\nNotably, this wallet deposited a significant sum of 787 million USDT to Binance on the Tron network starting March 31. Additionally, on the same date, a mysterious wallet emerged on the Ethereum blockchain, withdrawing $96.8 million in stablecoins from Binance.\n\nCuriously, this wallet commenced purchasing ETH from both Binance and decentralized exchanges, accumulating a total of 127,388 ETH valued at $405.19 million, with an average price of $3,172. These actions mirror those observed in a wallet previously linked to Sun, which acquired 168,369 ETH valued at $487 million between February 12 and February 24. If these wallets indeed belong to Sun, his ETH holdings would amount to a substantial 295,757 ETH, valued at $891 million, acquired at an average price of $3,014 from Binance and decentralized exchanges since February 12.\n\nDid #JustinSun buy 127,388 $ETH($405.19M) since Apr 8? The wallet suspected of being #JustinSun has deposited 787M $USDT to #Binance on #Tron since Mar 31. Also on Mar 31, a mysterious wallet was created on #Ethereum and withdrew $96.8M stablecoins from #Binance.\n\nIs this a… pic.twitter.com/OcEovodUrc — Lookonchain (@lookonchain) April 22, 2024\n\nETH Price Action Ahead\n\nAs of press time, the Ethereum price is trading 1.58% up at a price of $3,226 and a market cap of $387 billion. Analysis of the ETH/USD pair’s hourly charts reveals a significant breakthrough, as Ethereum breaches two interconnected downtrend lines positioned at the $3,070 and $3,150 marks.\n\nCurrently, Ethereum’s value exceeds $3,190 and maintains a position above the 100-hour Simple Moving Average, signaling a bullish outlook. Initial resistance is observed at $3,200, with notable barriers at $3,250 and $3,280. Overcoming these obstacles may propel Ethereum towards $3,350 and potentially beyond.\n\nConversely, failure to breach the $3,250 resistance could lead to a downtrend. In such a scenario, critical support is anticipated around $3,150. Further decline below the $3,120 level and the 100-hour SMA could escalate selling pressure, potentially driving prices toward $3,020 and even as low as $2,965.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQRVI3OVpidlI3UjVueWptTkVpXzRBVlNVdzhJWXR6emJFeXpoUmxlek5VU2lidzA0YnF5Uk9HZXVZemtMYUp0WXAzZ0paMkVYVU1QcHVhckhhdHg4TVhEUWxiMVoweVIwREp0MW1wYTI1ZEFxaDVNTTVRaDlnZ0lLa9IBhgFBVV95cUxNUjM2bGZNWmhsdlEzeWRhbHdyb2hHNV9yaXVNbVlWeTlzOGpkNnJUTGlkUkk3eFlXelB0UVRSS055YVZaVUJ1R1BUWnhzd1BqSlFsOUVCaFR5alZkbmIzOENOV2owSXh2UktnTWFaU2dSVktGT0trd0g2VVhueVpETDljQ3FrZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETFs may be coming soon – THIS is a huge sign - AMBCrypto News",
        "content": "Exchange outflows hit a yearly high, suggesting bullish conviction.\n\nETH’s price may find it challenging to surpass $3,255 in the short term.\n\nUnknown to many, Ethereum [ETH] registered its highest exchange outflows in 2024 on the 18th of April. On this date, market participants withdrew 143,000 ETH from platforms, per CryptoQuant.\n\nExchange outflow is a sign of unwillingness to sell, suggesting that the altcoin might not experience a severe capitulation. The last time ETH witnessed such was on the 7th of February and the 26th of March.\n\nWhen the accumulation happened in February, ETH’s price was $2,372, and by the end of the month, the value of the cryptocurrency was $3,386.\n\nBut the outflow in March did not bring the same result as the price fell later. However, AMBCrypto found that there were reasons the outflow jumped.\n\nDogged holders keep the faith\n\nOne of them is the rising enthusiasm that the U.S. SEC would approve Ethereum ETFs by May. While some participants were convinced that approval would happen, some skeptics thought otherwise.\n\nBurakkesmeci, an author on CryptoQuant, also seemed to agree with the viewpoint, mentioning that,\n\n“We witnessed a significant amount of BTC leaving exchanges before the Bitcoin spot ETF approval. I can’t say the same is happening, but we should keep this possibility in mind.”\n\nAnother reason for the rise could be linked to the belief that ETH’s price is destined to outperform Bitcoin [BTC] this cycle. While this school of thought remains unfounded, AMBCrypto checked the LTH-NUPL.\n\nLTH-NUPL is an acronym for Long Term Holder — Net Unrealized Profit/Loss. This metric shows the behavior of holders who have held the cryptocurrency for at least 155 days.\n\nAs of this writing, the LTH-NUPL was in the optimistic (yellow) region, despite moving closer to the euphoria side earlier. But that has not had a significant impact on the value.\n\nETH targets a lower low\n\nAt press time, EHT changed hands at $3,175, representing a 3.67% increase in the last 24 hours. From a technical point of view, momentum around the token increased.\n\nThis was evident in the Relative Strength Index (RSI) whose reading was 58.64. Typically, this is supposed to bring about a further increase in the price action.\n\nHowever, the Exponential Moving Average (EMA) showed a different signal. As of this writing, the 20 EMA (blue) was above the 50 EMA (yellow), indicating a bearish trend.\n\nIn addition, the Supertrend flashed a sell signal at $3,255. Therefore, if the cryptocurrency’s price keeps appreciating, it could face rejection at the aforementioned price.\n\nRead Ethereum [ETH] Price Prediction 2024-2025\n\nLike the Supertrend, the Money Flow Index (MFI) also displayed a bearish sign. With its downtrend, the MFI indicated that capital flowed out from the ETH market.\n\nAs such, the price could fail to break through the resistance at $3,500."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOeFA1bm45OUVqOG9uWXRrT0hoOXMzN3JmcnlRTUhiSVVJcld3RGZTb0tzMEstYkJuMjROcHN4b0hrczVjb0pXRDBxVlRMa0lIZ2NrN0FhQ2tWS3o2SlhMNklHdUZnQzhIQ1h1bF9lRXlhdFk3LUJ6SVhLOS1jbTVSWkFRbjMxTzhrb0xzR0NHOWJzUFk0SUVkS1BVME82Yk3SAaQBQVVfeXFMT3lVcXZjV2U2SHY0cWphM0VPZXNzbmcxN1d4MGpPZzhBUndiWlhYaklKS2ZYM3VLV1hvdnhwSjV3aXBNUlAtRVk1eThZOHBVdVdoN2tkTXBVeUt4enBQdEtSV2tGOS01eDRTUkZmOEZZdVlOVlVaU0FIQjlEbGQ2bWNVd3JBQWVLdXQ0dGRobFFlc01EREY0Tl9YYllXalFBWXBPZHY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 22: Bitcoin Holds $65K, Ethereum Closer To $3200, XRP & Core Rally - CoinGape",
        "content": "The top crypto prices today continued gaining as the Bitcoin (BTC) price neared the $66,000 level. In addition, the Ethereum (ETH) price inched closer to the $3,200 mark. Moreover, other top altcoins, such as Cardano (ADA), XRP, and Solana (SOL) rebounded notably.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 1.01% reaching $65,777.16 at the time of writing on Monday, April 22. On the other hand, it’s trading volume rose 4.92% to $23.31 billion in the last 24 hours. Whilst, the crypto held a market capitalization of $1.29 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price gained 0.54% to $3,197.07 at press time with a market valuation of $383.77 billion. Whilst, ETH saw its trading volume gained 0.66%, reaching $10 billion. Meanwhile, the Binance Coin (BNB) price was up by 4.14%, reaching $598.19. In addition, its 24-hour trade spiked 40.69% to $995.37 million.\n\nThe Solana price extended above the $150 mark today. The Solana price surged by 0.97%, settling at $151.10. In contrast, SOL witnessed a 11.76% drop in trade volume to $2.36 billion in the last 24 hours. Whilst, the XRP price neared the $0.54 mark. The XRP price recorded a hike of 1.63%, reaching $0.5367. On the other hand, XRP’s trading volume slumped 10.64% to $1 billion.\n\nMeanwhile, the Cardano price gained 0.51% to $0.5095 today. Whilst, ADA recorded a plunge of 31.87% in its 24-hour trading volume, settling at $351.84 million. As the top crypto prices recovered, the popular meme coins defied the trend. The Dogecoin price slipped 1.44% to $0.1613 while its rival, Shiba Inu price dipped by 1.21% and traded at $0.00002728.\n\nAlso Read: Bitcoin Price Upper Limit Set At $4.5M For 4th Halving Cycle\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a popular Solana meme coin, surged significant today. At press time, the Pepe Coin price was up by 8.50% to $0.000006509 with a market valuation of $2.73 billion. In contrast, the 24-hour trade volume for PEPE soared 39.10% to $877.22 million.\n\nCore Rallies 13%\n\nCore (CORE) surged nearly 13% and ranked the top crypto gainer today. The Core price was up by 12.71% to $2.44 at the time of reporting. Moreover, its trade volume skyrocketed 103.73% and stood at $242.91 million. Furthermore, the Core crypto attained a high of $2.58 amid the rally today.\n\nAlso Read: Pepe Coin Price Eyes $0.00001 High As Chart Pattern Hints End-of-Correction Trend\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQalJ5UGphWnAzbncxZzBnaGs3TVFWQzBEdjN4em5idmpEZzYtSElpWmdBQVdYejh1ZHB5b184VWVialpSczV5RFlPZ1BnUWxhTFh6UEg0T0tjb2thYWR5Z3NGT25GOW55ZXZHczc1OVBONnBIVWhLYW5XWEltRDRyVzYzZXdmTnFOV0hYOGRObXo1TUdCM1p0X0FwdG4xS21wQ29pSXZtSGRQZ2hQYW5xOTJOTdIBuwFBVV95cUxPSFYxdXNOSGQ2M3A3dExmM0xBUmJYYnB5WkNNbXlmZXFDa0ZKSkFNa3ltM01ZcUM1eGVaM1BmYXVPMFd0YVJodkVCLWVKblgzMkJDY1BWLU1PMDJfYzAwY2RhSzhPWXdQTWxEcFZ6VVhsbmlhVklTckl0N1Q3YTFwV3FXdXJOYzFXWWlBM2NrSTdIZ0pKVlBzYm1HM2JZRmlnYU1XdVVyME9Nb2U0U2tjSFl3TmpTZTYyRUZj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin price hits $66,000, Ethereum slightly gains after bitcoin halving event - Nairametrics",
        "content": "Bitcoin and Ethereum which experienced some volatility prior to the halving event has since resurged in prices with Bitcoin hitting $66,000 in price and Ethereum slightly gaining too.\n\nAccording to Decrypt, Bitcoin is up 1.6% in the past day hovering around $66,000 and have reached this milestone for the first time in a week.\n\nThe cryptocurrency’s block reward halving, which occurred on Friday, saw the reward paid to Bitcoin miners reduced from 6.25 to 3.125 BTC. This is always a catalyst for a bullish crypto market but the effects are felt immediately.\n\nAnother significant effect of the halving in the crypto space is the change in transaction fees of bitcoin. For a short time over the weekend after the halving the average fee to send BTC soared to an all-time high of $127 according to Bitinfo charts.\n\nCrypto experts at IntotheBlock, a blockchain analytics firm say that Bitcoin is currently sitting at a strong support level which they believe could make it more resistant to downward pressure.\n\n“Bitcoin is currently positioned right on top of a key demand zone, with 1.66 million addresses having purchased it at an average price of $64,800,” they wrote on Twitter.\n\n“This price point could potentially act as a strong support level should the market experience further downward pressure.”\n\nEthereum on the other hand experienced a price surge above $3000 on Friday and have managed to have remained there throughout the weekend. At the time of writing the Ethereum price is sitting just above $3200.\n\nThat’s a 1.3% gain in the last 24 hours and only about 1% shy of its price last week.\n\nBitcoin and Ethereum are two leading cryptocurrencies in market cap and user adoption.\n\nWhat To Know\n\nThe future for Bitcoin and Ethereum looks good as Hongkong conditionally approved Spot ETFs for both assets. Firms there believe they could resume issuing shares before the end of the month.\n\nAnalysts believe the conditionally approved spot ETFs for both Bitcoin and Ethereum will help reduce unease about cryptocurrencies in the region potentially bringing $25 billion worth of liquidities into the market."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNTm8tUHotZENTS1J3VlJmX0dvd1FKd21rdktvU09aTTZGWXFiMVcteHh5TVpYb3ZSR2l6MTRWMnRhbVcwTmRsb1R6aDAwTmdaMXNHTHp6UnhWam94SFptWE1lWklJN2lWZ2JlNmVoQU1vQ3JkWDFQMERTbGxaVHhJV2lqY1Y3cWtvYkdGdXJWNThBTlQ5cDI0Yk9vcktydWd0SGZENjVvaTAtanB5NnJlUU5OS3dtc2k4Ry1RMDFCS2ZFeGFHOVoxUUpKdDhzT1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "JPMorgan gives Ethereum ETF a 50% approval score; A significant upsurge expected for this AI Altcoin - Cyprus Mail",
        "content": "As the spot exchange-traded fund (ETF) momentum continues to take center stage in the crypto news scene, the primary focus is being shifted to the spot Ethereum ETF with banking giant JPMorgan recently stipulating that its approval by May was fifty-fifty.\n\nMeanwhile, Borroe Finance ($ROE) is taking the crypto sector by storm thanks to its groundbreaking Web3 solution of taming short-term liquidity challenges through an NFT-based and AI-powered marketplace.\n\n>>BUY $ROE TOKENS NOW<<\n\nBorroe Finance’s unique Web3 Revenue financing approach\n\nSince the revenue financing sector is not usually friendly to both startups and existing businesses, Borroe Finance ($ROE) does not put this factor into oblivion since it tackles it head on through its peer-to-peer (P2P) marketplace.\n\nAs a result, Borroe Finance is materializing as one of the prominent new DeFi projects that are rendering real-world solutions.\n\nSpecifically, Borroe Finance enables Web3 participants to get immediate loans by using their future earnings as collateral, which are already converted to non-fungible tokens (NFTs) for a seamless trading experience.\n\nThese NFTs are then sold off on Borroe Finance marketplace, enabling Web3 players to get instant working capital.\n\nAs a result, Borroe Finance is coming out as the best new crypto to invest in thanks to its long-term goal of taming the short-term liquidity pain point in Web3.\n\n>>BUY $ROE TOKENS NOW<<\n\nBorroe Finance is a haven of technological innovations\n\nThrough the incorporation of cutting-edge technologies, such as blockchain, artificial intelligence (AI), NFTs, and smart contracts, Borroe Finance has shown its outstanding commitment to revolutionizing the Web3 revenue financing field.\n\nAI plays an instrumental role in taking risk assessment a notch higher since Web3 users are provided with authentic credit scores that determine their loan eligibility. As a result, fraud is amicably averted.\n\nAs Borroe Finance continues to showcase itself as a top crypto to buy, the network is powered by the Polygon blockchain and this plays an instrumental role in making transactions fast, cheap, and efficient.\n\nThese factors are playing an instrumental role in making Borroe Finance one of the top DeFi coins as its governance token called $ROE continues to experience a soaring adoption rate.\n\nFor instance, more than $3.7 million has been raised at presale, with at least 286 million $ROE tokens purchased, making it one of the viral token launches.\n\n$ROE has a bright future thanks to the token burn strategies and deflationary tokenomics incorporated, making it the best crypto to invest in now.\n\nWill a Spot Ethereum ETF see the light of day?\n\nAccording to JPMorgan, the approval of a spot Ether ETF by May stands at not more than 50%.\n\nThe leading bank also stipulated that if the approval does not happen by then the United States Securities and Exchange Commission (SEC) might find itself in hot soup because litigation would follow.\n\nJPMorgan stipulated, “If there is no spot ether ETF approval in May, then we assume there is going to be litigation against the SEC after May.”\n\nNevertheless, JPMorgan acknowledged that the spot Ethereum ETF would eventually be approved.\n\nTherefore, this will be a welcome move in the Ethereum ecosystem because spot ETFs trigger a significant HODL culture thanks to notable capital inflows.\n\nFor instance, the approval of a spot Bitcoin ETF in January by the SEC recently played an instrumental role in enabling the leading cryptocurrency to hit a new all-time high price of $73,800.\n\nAs Ethereum continues to be one of the altcoins to watch, time will tell how its spot ETF journey shapes up.\n\nLearn more about Borroe Finance ($ROE) here:\n\nDISCLAIMER – “Views Expressed Disclaimer: Views and opinions expressed are those of the authors and do not reflect the official position of any other author, agency, organization, employer or company, including NEO CYMED PUBLISHING LIMITED, which is the publishing company performing under the name Cyprus-Mail…more"
    }
]