[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPVW9FaHd6dkt2OE9XLXNTbU95SHIybHdZUkZ4Ul8ta2ExLXNZODVmMHJBbHVCOGQ0MVljTFZwOFg5VmRocDZMelVoc1BOTmhsVHZ0czFXSGgwYndSWGR5Q1BWVWZocXFvUGQ3YUt0QVRRMkpDR3M2SmE4Skl2N1RoTGZ0dHBtZmVuajhMMDI1dEYtbmVHYzZlTlYwaFVIV1BLVG1KeHQxdUhJZHlJdzVQMWQ0T09uRVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Rallies 5% To $3,300: Are ETFs Coming This Week? - Benzinga",
        "content": "Ethereum ETH/USD is back above $3,300, fueled by a wider market rally and hopes of an imminent ETF launch.\n\nWhat Happened: Ethereum is currently trading around $3,360, a 5.5% increase over the past 24 hours.\n\nNate Geraci, an ETF analyst and president of The ETF Store, stated that there’s no valid reason for any further delay in the launch of the eight spot ETH ETFs beyond this week. This prediction aligns with an unnamed source close to the proceedings who also anticipates the ETFs to launch by the end of the week per a CoinTelegraph report.\n\nSeveral issuers, including VanEck and 21Shares, have revised registrations in the past week, hoping to secure the SEC’s final approval to list spot Ethereum ETFs. Analysts believe the launch of these ETFs could significantly influence ETH’s price in the coming months.\n\nTom Dunleavy, managing partner at crypto investment firm MV Global, told CoinTelegraph the funds could attract up to $10 billion in new inflows following their launch and potentially propel Ethereum to a new all-time high by the end of the year.\n\nAlso Read: Long-Inactive Bitcoin Wallet Unleashes $60M Amid Market Rebound, Stands To Profit 497X On Sale\n\nWhy It Matters: The anticipation of the ETFs comes amid a record inflow of over $17.8 billion year-to-date (YTD) into digital asset investment products per the latest CoinShares report. Bitcoin BTC/USD and Ethereum saw inflows of $1.347 billion and $72 million, respectively.\n\nCrypto analyst Michaël van de Poppe presented a bullish outlook for Ethereum, describing the asset as having a “tremendously low valuation.” He pointed out a significant gap between the ecosystem's fundamental growth and the sentiment surrounding its price levels. This suggests that the launch of the ETH ETFs could bridge this gap and drive Ethereum prices to new heights.\n\nThese topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nWhat’s Next: Attendees of Benzinga’s upcoming Future of Digital Assets event on Nov. 19 will explore the influence of Ethereum as an institutional asset class.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNcDJlaTY1cHFMdzdvYlJEdkFMU3lZMElUbWp3WVpjTmtndGE2QVFTU29aeDR2bmZBVVlpRVhiY2piWHdMa2hlNVBodGNrWHNJZFhBNHpCOThJWWN6eU9wdDRiZldUclFTRnhBSm4ycWpxQ1p2UlA4dWFNazdta0oyX01Jcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "What Is The Ethereum Foundation? - DisruptionBanking",
        "content": "The Ethereum Foundation is a pivotal entity in the cryptocurrency sector. Founded in 2014, this Swiss-based non-profit organization has been the backbone of the Ethereum blockchain, spearheading its development and ensuring its sustainability. Ethereum, often described as the world’s programmable blockchain, owes much of its success and innovation to the efforts of the Foundation.\n\nEthereum Foundation: Company or Charity?\n\nOne common question is whether the Ethereum Foundation operates as a company or a charity or is the same organization as Ethereum.\n\nThe Ethereum Foundation (EF), also dubbed “Stiftung Ethereum,’’ established in 2014 in Zug, Switzerland, is not quite a company and not exactly what you’ll call a charity in the conventional sense, at least. Technically, it’s a non-profit organization that functions similarly to a charity, with a central mission: to shepherd the development and widespread adoption of Ethereum — the second-largest blockchain platform after Bitcoin — and the technologies surrounding it. However, its role extends beyond traditional charitable activities.\n\nMission and Goals: A Public Good for All\n\nThe EF’s mission is to secure a prosperous, decentralized, and enduring future for the Ethereum ecosystem.\n\nIf the Ethereum Foundation can be viewed as a public good entity that focused on harbouring & nurturing an early community of missionaries…\n\n\n\n… then L2s can also be viewed as the new business development & partnership arm of Ethereum that brings in the next generation of Web2… — Patrick McCorry (💙,🧡) (@stonecoldpat0) June 19, 2024\n\nIt’s not about leading or controlling Ethereum but nurturing its growth and supporting benevolent actors within the ecosystem. The EF’s goals are to maintain Ethereum as a public good — directed by none and useful for all. This includes funding research and development, supporting infrastructure, and fostering community growth.\n\nSignificance and Key Contributions of the EF to the Ethereum Ecosystem\n\nsell 70,000 ETH, totaling, approximately, $100 million for the foundation. The Ethereum Foundation has helped ETH grow. Without the Ethereum\n\nFoundation, ETH would be less successful. It was gifted ETH and it used it in order to fund\n\nventures to help promote itself and ETH. — John E Deaton (@JohnEDeaton1) January 6, 2021\n\nThe influence of the EF on the cryptocurrency environment is substantial. It dedicates resources to essential projects, benefiting developers and researchers devoted to enhancing Ethereum’s capabilities. The EF nurtures the ecosystem and champions positive contributors through grants, research endeavors, and programs like the Ethereum Fellowship, which focuses on untapped talent and areas ripe for blockchain innovation. It’s one part of a much larger ecosystem that serves as a catalyst for innovation within the Ethereum ecosystem.\n\nThe EF’s support extends to a broad scope of projects, including solutions for scalability, community building, security, privacy, and more. Here’s a breakdown:\n\nAcademic Grants:\n\nThe Ethereum Foundation endorses scholarly grants aimed at advancing research related to Ethereum. In its 2023 initiative, the foundation supported 43 projects spanning 20 nations, covering fields including cryptography, economics, security, and consensus mechanisms. These grants have helped advance knowledge, foster collaboration, and drive innovation within the Ethereum community.\n\n📣 The first ZK Grants Round is now open!\n\n\n\nThe Ethereum Foundation, in collaboration with Aztec, Polygon, Scroll, Taiko, and zkSync, contributed $150K each to the shared prize pool, totaling $900K.\n\n\n\nApply before March 18th! 👇https://t.co/u1lGRfc4CV — Ethereum Foundation (@ethereum) February 21, 2024\n\nCommunity Engagement:\n\nThe Ethereum Foundation actively engages with the community through platforms like GitHub and Discord.\n\nTheir efforts have increased contributions, with GitHub contributors rising by 57% and Discord community members nearly doubling.\n\nDevcon Conferences:\n\nDevcon, organized by the Ethereum Foundation since 2014, has become a premier event for enthusiasts, developers, and researchers. These conferences foster collaboration, knowledge sharing, and the birth of new ideas that drive Ethereum’s evolution.\n\nwhat to expect as a Scholar: financial support, pre-Devcon community & programming, an amazing week at Devcon in Bangkok, and a post-Devcon learnings.https://t.co/FAwBYd90PM — Deva the Devcon Unicorn (@EFDevcon) July 5, 2024\n\nEcosystem Support Program (ESP):\n\nAs an extension of the Ethereum Grant Program, ESP provides financial and non-financial support to projects within the Ethereum ecosystem.\n\nBy nurturing promising initiatives, ESP has contributed to the growth of decentralized applications, tools, and services in the past and present day.\n\nFellowship Program:\n\nThe Ethereum Foundation Fellowship Program aims to address gaps in representation across cultures, nationalities, and economic classes. It identifies and supports unique and talented individuals, breaking down barriers to entry for underrepresented people and communities in the Web3 space.\n\nEthereum for the Next Billion: Today, @AyaMiyagotchi unveils the new EF Fellowship Program, and discusses the Foundation's role and a vision for #Ethereum's long-term sustainability in a decentralized world.\n\n\n\nRead more: https://t.co/BNnAdH7erH — Ethereum Foundation (@ethereum) May 7, 2021\n\nImpacts and Achievements\n\nThrough all the key contributions of the Ethereum Foundation highlighted above, the Ethereum ecosystem now boasts of many achievements and giant strides, with tens of crypto projects successfully executed and DeFi startups birthed under their belt. To list a few:\n\nDecentralized Finance (DeFi):\n\nEthereum birthed DeFi, a movement that transformed traditional financial services. Notable platforms include:\n\nUniswap, launched in November 2018, introduced automated market-making (AMM) and liquidity pools, enabling decentralized token swaps. Aave, founded in January 2020, pioneered flash loans and became a leading lending protocol. MakerDAO, established in December 2017, its DAI stablecoin provided stability in a volatile market.\n\nEthereum’s Robust DeFi. Source: The Block\n\nBy July 2024, DeFi protocols collectively held over $100 billion in Total Value Locked (TVL).\n\nNFT Renaissance:\n\nEthereum’s smart contracts remodeled NFTs for the crypto industry. The Ethereum Foundation established NFT standards (ERC-721 and ERC-1155) that shaped the NFT ecosystem.\n\nScaling Solutions:\n\nOptimistic Rollups , introduced in 2022, enhance scalability by batching transactions off-chain and submitting proofs on-chain.\n\n, introduced in 2022, enhance scalability by batching transactions off-chain and submitting proofs on-chain. Zero-knowledge Rollups (zk-Rollups), deployed in 2023, further reduce fees and improve user experience.\n\nEth2 Beacon Chain:\n\nProof-of-Stake (PoS) Transition: The Beacon Chain shipped on December 1, 2020, and formalized PoS as Ethereum’s consensus mechanism with The Merge, aka the “Shanghai Upgrade,” on September 15, 2022. During this event, Ethereum successfully switched from “Proof of Work” (PoW) to another system known as “Proof of Stake” (PoS). This change was a huge accomplishment because it significantly decreased the network’s energy, making the platform much more environmentally friendly. This marked the beginning of a new, more sustainable phase for Ethereum.\n\nThese contributions demonstrate the Ethereum Foundation’s commitment to advancing the ecosystem, which continues to grow in leaps and bounds to date.\n\nThe Names Behind the Ethereum Foundation\n\nAt the heart of the Ethereum Foundation is Vitalik Buterin, a prodigy in the crypto world. Alongside Vitalik, other key figures include Aya Miyaguchi, the Executive Director, and a team of dedicated developers and researchers who work tirelessly behind the scenes.\n\nVitalik Buterin\n\nEthereum co-founder Vitalik Buterin has significantly influenced the blockchain space, contributing to high-level roadmaps and technological advancements, including the Ethereum Improvement Proposal (EIP) 7702. His work has earned him recognition, such as a spot-on Forbes’ 30 Under 30 list in 2016.\n\nEthereum's co-founder, VitalikButerin, clarifies his recent ETH transactions. They're not personal sales, but donations to support charitable causes. His unwavering commitment to Ethereum's future shines through!\n\n\n\n#Ethereum #CryptoPhilanthropy pic.twitter.com/x4u6xXpNAH — Hamid (@HaMidOwAiSi3) October 18, 2023\n\nGavin Wood\n\nGavin Wood, co-founder of Ethereum and creator of Polkadot, invented Solidity and defined the Ethereum Virtual Machine (EVM) in 2014. He served as the Ethereum Foundation’s first CTO.\n\nDr. Gavin Wood appreciation tweet.\n\n\n\n✅ Co-founder of Ethereum with Vitalik\n\n\n\n✅ Proposed & helped develop Solidity language\n\n\n\n✅ Released the Yellow Paper defining Ethereum Virtual Machine\n\n\n\n✅ Founded Polkadot & the Web3 Foundation\n\n\n\n✅ Donated $5.8 million in crypto to Ukraine pic.twitter.com/2ci4S407i2 — Hamza ⚡ Marmooz (@marmooznet) March 18, 2022\n\nMing Chan\n\nMing Chan, as the Executive Director of the Ethereum Foundation from 2015 to 2018, significantly improved the Foundation’s efficiency and reduced costs through reorganization. She also fostered relationships with academic groups like IC3.\n\nLittle known fact, #Ethereum owes it's existence to @mingchan88, for keeping the Foundation afloat long enough to pass Swiss regulations and gain access to its genesis Ether. Without her, high chance the EF would have gone bankrupt before Ethereum's 1st birthday. https://t.co/x4G4b6N0TO — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) December 2, 2020\n\nAya Miyaguchi\n\nAya Miyaguchi, the current Executive Director of the Ethereum Foundation, leads its support for the Ethereum ecosystem through research, development, and education. She aims to preserve Ethereum’s open-source, inclusive, and permissionless nature.\n\nApart from Vitalik Buterin, Aya Miyaguchi, and co, there are several other key figures in the Ethereum Foundation and the Ethereum ecosystem, by extension, including the likes of Joe Lubin and Charles Hoskinson (both co-founders of Ethereum), Jeffrey Wilcke (as part of the Technical Steering Group), Patrick Storchenegger, and Jeremy Wood.\n\nMay 16, 2019\n\nAya Miyaguchi, Executive Director, Ethereum FoundationShe is on the @EMPOWR_us list of EEA members who may have communicated with Bill Hinman.(List Below)\n\nAn entire discussion on how they are using Ethereum to fund the foundation. pic.twitter.com/gegnKLlXBh — Digital Asset Investor (@digitalassetbuy) April 26, 2022\n\nThese individuals have made significant contributions to the Ethereum Foundation and the broader Ethereum ecosystem. Their collective efforts have helped shape Ethereum into the powerful and versatile platform it is today.\n\nThe Ethereum Foundation is a unique entity that blends the characteristics of a non-profit with the dynamism of a tech company. Under the leadership of visionaries like Vitalik Buterin and Aya Miyaguchi, it has made significant strides in advancing the Ethereum ecosystem. With ongoing projects and a clear vision for the future, the Foundation’s role in the crypto world is set to grow even more influential.\n\nAuthor: Ayanfe Fakunle\n\nThe editorial team at #DisruptionBanking has taken all precautions to ensure that no persons or organisations have been adversely affected or offered any sort of financial advice in this article. This article is most definitely not financial advice."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE15czVoaEczNUxIM0g3Y1pwVmhGN0tnTlRkTEVpaWlZdGY3WkZoRGhyaFo1eHhtZ0FESTNrMy01aU1GY19ZdlpTaXdXaDFlSlp3OXdIMERGV3U3SUJ6azI5NU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch July 23, Bloomberg analyst says - Crypto Briefing",
        "content": "Ethereum ETFs to coincide with Bitcoin Conference, potentially boosting market attention.\n\nKey Takeaways Ethereum ETFs are scheduled to begin trading on July 23, as reported by Bloomberg analyst.\n\nBitwise CIO projects $15 billion in inflows for Ethereum ETFs by the end of 2025.\n\nShare this article\n\nThe starting date for spot Ethereum exchange-traded fund (ETF) trading in the US is July 23rd, according to Bloomberg ETF analyst Eric Balchunas. He shared on X that the SEC is answering issuers today, asking them to return their final S-1 forms on Wednesday, July 17th.\n\n“And then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course,” he added.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nThe Ethereum ETF issuers filed their S-1 forms on July 8th but most of them left the fees out of their forms. According to Balchunas, this is likely a strategy from the asset managers to check how competitive the funds’ fees are, especially BlackRock’s.\n\nNotably, the S-1 form is an initial registration required by the US Securities and Exchange Commission (SEC) before a security can be publicly traded.\n\nAs highlighted by Balchunas’ fellow ETF analyst James Seyffart, this could mean that the Ethereum ETFs will start trading the same week as the Bitcoin Conference, set to happen in Nashville.\n\nThe launch of the spot Ethereum ETFs is a key step for crypto adoption by mainstream investors, as it solidifies the altcoin as a sound asset among institutional investors. An estimate by Bitwise CIO predicts that these investment instruments will capture $15 billion in inflows until the end of 2025, as reported by Crypto Briefing.\n\nMoreover, the Ethereum ETFs open the door for the approval of exchange-traded funds indexed to other crypto. VanEck and 21Shares both filed their form for the approval of the first spot Solana ETFs in the US on the last week of June."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQSFAtUElOT1Ridms2OThnZVhkLW02Y0FQR3lfMnB2QjJpaEtCdGNUc0o4M2IxaWFDUHZPN0ZpS09aaHZySHlqQ1pkam0yYk1iT1IzaDE2SUFwNnRza2lhaHNaQ2p4NUo4cGdKZDhxODV0TEw4MDNNMHgydXUtdDRZZGFPQXV5ZEFaWGVxSWpFYkdmSjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg analyst confirms Ethereum ETFs set to launch next week - CryptoSlate",
        "content": "The Securities and Exchange Commission (SEC) is anticipated to approve the spot Ethereum exchange-traded funds (ETFs) next week, with trading expected to begin on July 23, Bloomberg senior ETF analyst Eric Balchunas reported on July 15, citing industry sources.\n\nThe development follows recent communications between the SEC and ETF issuers, signaling a potential green light for the much-anticipated financial products.\n\nBalchunas revealed via social media that the SEC has instructed issuers to submit their final S-1 forms, including necessary fees, by July 17. The SEC is expected to request effectiveness after the close of business on July 22, paving the way for a Tuesday trading launch for the Ethereum ETFs.\n\nHowever, Balchunas added:\n\n“This is provided no unforeseeable last min issues of course!”\n\nThe news comes amid growing anticipation in the crypto community, with ETF Store President Nate Geraci, predicting this week as the likely approval period for spot Ethereum ETFs. He tweeted earlier in the day:\n\n“Welcome to spot eth ETF approval week… I’m calling it. Don’t know anything specific, just can’t come up w/ good reason for any further delay at this point. Issuers ready for launch.”\n\nThe timing of the SEC’s expected approval coincides with the largest Bitcoin conference of the year, adding to the excitement within the crypto sector.\n\nThe introduction of spot ETH ETFs is seen as a significant milestone for the crypto industry as it will provide investors with a new avenue to gain exposure to Ethereum through a regulated financial product.\n\nFollowing the launch, market observers anticipate substantial investment flows and the potential introduction of additional cryptocurrency-based financial products, including those based on Solana and other digital assets.\n\nBalchunas suggested that this marks the start of crypto ETFs, with other tokens set to follow in the footsteps of Bitcoin and Ethereum, starting with Solana. He said:\n\n“Keep in mind after launch there’s flows and then add’l eth products I’m sure, then Solana, and then… it’s prob never going to end. The dam has broken.”\n\nAs of press time, Ethereum was up 5.23% over the last 24 hours and trading at $3418, based on CryptoSlate data.\n\nEthereum Market Data At the time of press 12:27 am UTC on Jul. 16, 2024, Ethereum is ranked #2 by market cap and the price is up 6.94% over the past 24 hours. Ethereum has a market capitalization of $419.56 billion with a 24-hour trading volume of $18.13 billion. Learn more about Ethereum › Ethereum $3,489.98 6.94% Crypto Market Summary At the time of press 12:27 am UTC on Jul. 16, 2024, the total crypto market is valued at at $2.37 trillion with a 24-hour volume of $84.72 billion. Bitcoin dominance is currently at 53.80%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPQVp0d1BXVWNJcmtJclBYUTRhbGlMTlBwakt0a2lTdFJQTGhtNGhWZjJYVGljUzB4LURtREpfdWxGSUpXbmJvRFJaMmpYOGFlUUtnLWJ0ZHA3T1k3QjVQQUZZc2lqbUcwNjc5dlo1UHJ1em4zMTlDUGZ2WFNNSVFFOVFGQzl6UFpvbDlwdE9ORUd0T0NfZU9NMHFPRVN4eHlIalowZGtQX3JybkF1S2hB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Moves Toward $4K on Imminent ETF Launch Hopes - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNa1pXS0tUY0I4LVVTOHZBbS0wMXJOYTJPVGJqeWdnZDVzZnBsU05oUjRDeTJqNnowVW8yajhYMU1GV2c2cGxndzBrNVV1ZXoxTFBibld4OXdHSjZZazBOejhva1ZKYlNxaFpTMTE4b1dXTkJZb0R2Wk1DcU80ZnRSVkk2QjJlSUdGUzJQR3U5eGx3OUFNdndFeWxHSTBGZUlVOTByXzkwSWtNOVRJZHc3UDYzWThQSGc0cVJXV3dQTkEtTnN3R0lranBwWGotRjV3T2cxa25RSkMyZmhFMi02YWpmTlZWY1JkOXNoLVBn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs Likely To Start Trading By July 23 Provided 'No Unforeseeable Last Min Issues' Occur - Markets Insider",
        "content": "The SEC has provisionally sanctioned at least three Ethereum (CRYPTO: ETH)-based exchange-traded funds. The trading for which could begin as early as July 23.\n\nWhat Happened: A Reuters report on Monday revealed the latest development, citing industry sources. The approval hinges on the applicants submitting final offering documents to regulators by the end of this week. All eight ETFs applications are expected to launch simultaneously.\n\nSee Also: Benzinga Bulls And Bears: Apple, Nvidia, Palantir, MicroStrategy And Shiba Inu’s Ambitious Trillion-Dollar Vision\n\nAmong the eight asset managers whose applications are likely to be approved by the SEC next Monday afternoon are BlackRock, VanEck, and Franklin Templeton. Trading in the products is expected to begin the next day, the report added.\n\nAdditionally, Bloomberg ETF analyst Eric Balchunas revealed that the SEC got back to applicants, asking them to submit final S-1 documents, including the information on fees, by Wednesday this week. He too anticipated a July 23 launch provided “no unforeseeable last min issues” occur.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nWhy It Matters: Following the launch of U.S. spot Bitcoin (CRYPTO: BTC) ETFs in January, the Ether products would mark another major win for the cryptocurrency industry’s push to mainstream digital assets.\n\nCryptocurrency exchange Gemini anticipates a bright future for Ethereum with the imminent launch of spot ETFs in the United States. Gemini’s research report suggests a surge of investor interest, estimating net inflows of up to $5 billion within the first six months of trading. This influx of capital could push Ethereum's value in U.S.-based spot ETFs to $13-$15 billion by the end of the year.\n\nPrice Action: At the time of writing, Ethereum was exchanging hands at $3,473.37, following a 5.95% spike in the last 24 hours, according to data from Benzinga Pro.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next:\n\nDogecoin Up 8% But One Indicator Shows It Could Explode 75% Higher Still\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQX2dpMnRpYW5sZlNFc3V6LWE4QlRBSmF0MmdDYVNjYkpTc1NJRHg4Ykl0ZWF1d3dRT1NRZ2poaWMwb3VHUndzbWZkZEFyMVFueTRDZ2toclhWVEpVMXVLd0RuSUNGOFdBa2RsOUFtSkFka2loRFctZ2xvdDRuY24ybEN3YXBjeTDSAYwBQVVfeXFMTlJLVmxwQmUzQnNlRVRUVHhCLTNKMzVUWWFwaTFoOFlBX3lkZVpjVWFPOU5yejUtQmczLTVVbEdMTlY4VktmTmlBYWJSMGZkMTJXTVBEOFJ2VkU3S3hJSUIyT05YSTZpUVl3ZjcwcEZPTENtR0dpQUh4ZTA3b0xKdzFXYU5fbWxyaTdZQnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Might Change Crypto Market in Unusual Ways - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSince May, the crypto ecosystem has been anticipating the approval of S-1 registration for the spot Ethereum ETF. While top market experts have exhausted their projections regarding the timeline on which the product will launch, ETFStore President Nate Geraci said he sees no reason why the product would not go live this week.\n\nAdvertisement\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs it stands, prospective Ethereum ETF issuers have come to terms to satisfy the United States Securities and Exchange Commission (SEC) by making amendments to their respective S-1 registration forms. With compromises already being recorded since spot Bitcoin ETF approval days, the market is not expecting any further delays.\n\nHowever, the concerns of many lie in what will become of the industry should the Ethereum ETF start trading. The conversation rests on its immediate impact on the market in terms of price gains.\n\nWhen the SEC approved 19b-4 filings in May, the update fueled a massive spike in the price of the coin, with a ripple effect on Bitcoin and altcoins more broadly. This rally, though short-lived, might get replayed when Ethereum ETF products start trading.\n\nThe bullish sentiment in price is already creeping in. At the time of writing, the price of Ethereum and trading volume are up 4.14% and 34.43% to $3,334.51 and $13,196,383,402, respectively.\n\nBesides price impact, the launch of the Ethereum ETF effectively lifted limitations for other altcoins gunning for similar product acceptance on Wall Street. Already, there are active applications for a Solana ETF from VanEck ⁠⁠⁠⁠⁠⁠⁠, and 21Shares has already broken the push for the product with a Bitcoin and Ethereum duopoly.\n\nThe Ethereum ETF trading and potential capital injection might confirm what crypto proponents have been projecting for a while now: fact that there is a subtle demand for mainstream, regulated crypto products."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOOEV2UGo5YW9jYlQtUGtZdWJwS2RiM0laZ0pzN19jNEJTeC1xcG40VE1Vbmwyb2pfLVRTM2QtUjJ3UFY0ZUN4dk1fZnp5N0VRWE5jdXJzbkVZcjZQZlhtY0dGVi1FSm1UOHBMSUxjOWpiaFZtcWh3MW1zWFJoRWJlVHMzTWFRU1RoaXBHV0xzZU91QnhMc1A2WUItdF9MX3FCaE51Q1lJTUVEeDltU0RtRE1sVVMzOEpQMC1XTVJSNm1LVEpwMnAtdzJNZHRlbEdCNW5tVXdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "The increase in the price of Ethereum and some predictions for ETFs: what does it mean for the market? - The Cryptonomist",
        "content": "The price of Ethereum recently surpassed $3,300 as investors anticipate some predictions regarding the imminent approval of exchange-traded funds (ETF) based on ETH, expected this week.\n\nLet’s see all the details below.\n\nGrowth forecasts for the price of Ethereum after the launch of ETFs\n\nAs anticipated, Ethereum has marked a new peak of $3,331 this week, driven by the growing expectations regarding ETH ETFs.\n\nNate Geraci, ETF expert, stated that there is no reason for further delays in the approval of spot ETFs on Ethereum, expected by the end of the week.\n\nAccording to Geraci, several companies, including VanEck and 21Shares, have updated their filings in the hope of obtaining final approval from the SEC to launch ETFs on Ether.\n\nThese funds are seen as a crucial catalyst for the price of ETH in the coming months. In particular with forecasts of a significant influx of capital, potentially up to 10 billion dollars.\n\nTom Dunleavy, managing partner of MV Global, has predicted that this new form of investment could lead Ether to reach new all-time highs by the end of the year.\n\nContrary to common perception, Dunleavy believes that ETFs on Ethereum may represent a more attractive opportunity for traditional investors compared to those on Bitcoin. This is due to the clarity of the narrative and the robustness of Ethereum’s technology.\n\n“Ethereum has cash flows. It can be described as a tech stock, the app store of cryptocurrencies, or an Internet bond. This is a much easier sell for financial advisors compared to digital gold.”\n\nAccording to the data from TradingView, Ethereum has grown by 16% compared to the previous week, rising from $2,909 to $3,331.\n\nThis increase reflects not only the confidence of investors in the potential of ETH ETFs, but also a renewed focus on criptovalute in a broader market context.\n\nThe future of Ethereum now seems tied to the decision on the listing of ETFs, with analysts estimating a significant impact on prices and a potential to rebalance the gap accumulated compared to Bitcoin in the last 18 months.\n\nThe sale of Bitcoin by the German government shakes the market: Ethereum shows resilience\n\nThe recent announcement by the German government to liquidate 5,000 Bitcoin, equal to 90% of its reserves, has triggered a significant drop in the price of Bitcoin, falling below $57,000.\n\nThis happens despite Bitcoin’s attempt to reclaim the $60,000 threshold, demonstrating the difficulties in maintaining this level. In contrast, Ethereum has maintained a remarkable stability, highlighting its resilience in the face of market turbulence.\n\nThis difference in performance between Bitcoin and Ethereum has captured the attention of analysts and investors. Specifically, considering it a crucial testing ground for Ethereum’s ability to withstand market fluctuations.\n\nIf Ethereum continues to remain stable, it could indicate a reduced dependence on Bitcoin’s price fluctuations, representing an important step forward for the bull sector of cryptocurrencies.\n\nIn the context of this Bitcoin sell-off, the cryptocurrency community is awaiting the approval of an ETF on Ethereum.\n\nWhile some analysts remain optimistic about the trajectory of Ethereum’s price, technical analyses offer a mixed picture.\n\nVarious cryptocurrency experts predict that Ethereum could reach $5,000 soon, identifying key support and resistance levels crucial for its future price movements.\n\nThe experts have identified a significant support zone for Ethereum between $2,800 and $3,300, considered essential to maintain a bull perspective.\n\nIf Ethereum continues to be traded in this range, it could be on the right track to reach $5,000.\n\nDespite the positive forecasts, the market shows mixed signals. According to CoinCodex, the price of Ether should increase by 3.68% by August 13, 2024.\n\nHowever, the fear and greed index reflects a negative sentiment, with Ethereum having recorded only 50% of green days in the last month."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9tVllSV0VaRmVDMklOU3E3UDNXTWIzbWZmQWw0TThZanoxUnlmTlNKYW5kNUZOYncyYUJsMmVxQk1iNlFranluaDNuODNQVDluQk5KQ2NoSDdEOGJSX2xRX3RGOFdvd3JxZWtNX2RFQnFQcjNBYXFKZG9IYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum surges 5% to $3,300 ahead of key ETF decision - Crypto Briefing",
        "content": "ETF expert Nate Geraci predicts that the SEC will approve trading of spot Ethereum ETFs this week.\n\nKey Takeaways Ethereum's price surpasses $3,300 as the market awaits the SEC's trading approval of spot Ethereum ETFs.\n\nAnalysts and industry leaders believe the imminent approval will boost Ethereum investment.\n\nShare this article\n\nThe price of Ethereum has rallied 5% to over $3,300 ahead of the key spot Ethereum exchange-traded fund (ETF) decision, according to data from TradingView.\n\nThe US Securities and Exchange Commission (SEC) is expected to greenlight the launch of several spot Ethereum ETFs by the end of this month. While the specific date remains speculative, ETF experts estimate that approval will come the week of July 15.\n\nNate Geraci, the president of the ETF Store, reiterated his prediction that the SEC will approve the S-1 filings this week after weeks of delays following initial listing acceptance in May. He believes there’s no reason for further delay because issuers are ready for launch and recent filings require minimal changes.\n\n“Welcome to spot [ETH] ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up [without] good reason for any further delay at this point. Issuers ready for launch,” Geraci stated in a Sunday post.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart previously predicted the spot Ethereum ETFs could be approved and begin trading as soon as mid-July.\n\nSeyffart noted that Ethereum ETF issuers have been filing their final S-1 registration statements, which is the last regulatory hurdle before approval. Balchunas said the SEC’s minimal feedback on these latest filings suggests they are close to being satisfied with the applications.\n\nMatt Hougan, the Chief Investment Officer at Bitwise, confirmed that minimal amendments suggest imminent approval.\n\nThe approval of a spot Ethereum ETF is anticipated to have a major impact on the Ethereum market and the broader crypto industry. It could drive remarkable inflows of institutional and retail capital into Ethereum, potentially mirroring the success of spot Bitcoin ETFs.\n\nIn a recent report, Hougan suggested that spot Ethereum ETFs could attract $15 billion in net inflows by the end of 2025."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4waHc3ZzQxWDdYbFZUQlpfamtxYTlJSFBvM0FiTGV3a01tV0JtWDY3Y0ZTTFR0VzZSVU4wTTlVV1g4V3M1bU5ndEl0NWFPWWxOcm4tVWJfLXBudHVFVC1WZ2dkTGc2MWQzVTRDdVBTNmlJQdIBd0FVX3lxTFBVOWRpTFZTekRWT042SUpRRk4tenFTemtWVWRZYmtXcXNaRk90T0oyTmxmakp1OGZ0aERieEU0N0ZSazJMd25sRUV0cVRRSXNqeFozbU14X2hWMG14NGk5VTdXSzA2azdXRUFXc28wNmhOdUxmOTQ4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch Date Announced by Top Analyst - U.Today",
        "content": "According to Eric Balchunas, Bloomberg's senior ETF analyst, Ethereum exchange-traded funds are set to be launched on July 23.\n\nAdvertisement\n\nProspective issuers have been asked to re-submit their final S-1 forms on Wednesday by the U.S. Securities and Exchange Commission.\n\nNotably, the launch of Ether ETFs will take place right in the middle of the Bitcoin 2024 Conference.\n\nIt is worth noting that the launch of these products could still be delayed due to last-minute issuers.\n\nAdvertisement\n\nEarlier today, Nate Geraci, president of the ETF Store, said that he could not come up with a \"good reason\" for the SEC to further delay the launch of these products, adding that issues are ready.\n\nAs reported by U.Today, the SEC approved 19b-4 filings for various spot Ethereum ETFs back in May in what appeared to be a major U-turn. Just days before the approval, these products were widely expected to be rejected by the SEC.\n\nHowever, there is still a lot of uncertainty regarding the level of demand that these products will manage to attract.\n\nFor instance, banking giant JPMorgan has predicted that these products will severely underperform compared to Bitcoin ETFs. However, crypto-native firms of the likes of Gemini expect Ethereum ETFs to be moderately successful.\n\nNotably, Coinbase researchers have forecasted that the launch of Ether ETFs could be either bullish or bearish for crypto markets depending on the amount of inflows.\n\nRegardless of how successful these products are going to be, the launch of the first spot altcoin ETFs would mark a historic shift.\n\nIn the meantime, VanEck and 21Shares have already submitted Solana ETF applications. However, analysts believe that their approval is unlikely to happen this year."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFB1NkdKU3JWTENIbFYyTkN1T1RiU0ZrUnZGa3NxYjI0aW8xSHN1OHBBX3plcmtlVl9GeTY0Y2l0Mk03ekxaTDRMTGphY0ZtdDRBWEtLZU1nbDFiWk8xZzJ3a2VXdXVHY0VuZEdsankwNVQ0N3o2Z0NSQUlB0gGCAUFVX3lxTE9ydnNpME5wNmhBRWtPc1pROGJucVpiOUhkd0Fmc0hJZXNndlA1VUcxdWNKLXcwRUpDcEJucUZ6eHZndGVrbGM4TFpTYXF5SU5kd3VzbzFsQWdMbGhNWS03VjhocFdxOVJrcFBDaEgwQ3JLSTFMLXRoSHF0N3RfdjYydmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to Start Trading Next Week as SEC Gathers Final Drafts, Sources Say - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Securities and Exchange Commission (SEC) is telling asset managers to submit final versions of registration statements for spot Ethereum ETFs by Wednesday, with the products’ launches slated for July 23, two sources familiar with the SEC’s process confirmed to Decrypt.\n\nThe approval process for spot Ethereum ETFs has been notably slow since the regulator’s abrupt approval of spot Ethereum ETFs in May. Allowing investors to gain exposure to Ethereum through a traditional brokerage account, anticipation has increased steadily since.\n\nThe SEC’s recent communications with asset managers were first reported Monday by Bloomberg ETF Analyst Eric Balchunas, who wrote on Twitter (aka X) that the finalized registration statements should also include each fund’s respective management fees.\n\n“Hearing [the] SEC [has] finally gotten back to issuers today, asking them to [...] request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH,” he wrote, adding that the timeline could change due to “unforeseeable last min[ute] issues.”\n\nAD\n\nAD\n\nThe details were confirmed to Decrypt by two separate sources, one of whom affirmed receiving similar communications from the agency.\n\nWhile the SEC approved key filings for spot Ethereum ETFs in May, the regulator has yet to green light individual s-1 filings from eight asset managers, including BlackRock, Fidelity, and Grayscale. Previously, SEC Chair Gary Gensler said that the approval process is dependent on ETF hopefuls providing investors full disclosures—but that it was still “going smoothly.”\n\nFollowing the approval of spot Bitcoin ETFs in January, which have seen around $15.8 billion in inflows so far this year, the launch of spot Ethereum ETFs could be a relatively big moment for crypto’s second-largest coin by market capitalization. Per K33 Research, spot Ethereum ETFs could draw up to $4 billion in inflows within their first five months.\n\nStill, as the approval process has played out, Ethereum’s price has faded from a peak in May of around $4,000. The asset’s price has climbed 15% over the past week to around $3,400, yet it plunged as low as $2,900 earlier this month.\n\nAD\n\nAD\n\nAdditional reporting by Liz Napolitano. Edited by Ryan Ozawa."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFA0ZENWMzF2MXJSVVFNVHA4SDdGaHVObVJnSF9hOEVGVDc5Sk1IcnJkVkRYc2JtYUU5elk5WlU2S1p5YWw5NEwzZ0VMRzU0bENEYUZncV9hS3FsWjZtaXYzandjRTdPajBZMzRzQXltRXVRaXRRRkNWNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Hits Record $3.3K Amid ETF Hype - TipRanks",
        "content": "In a whirlwind week for Ethereum (ETH-USD), the cryptocurrency soared past the $3,300 mark, buoyed by growing anticipation surrounding the imminent approval of spot Ethereum exchange-traded funds (ETFs). According to Cointelegraph, analysts like Nate Geraci are betting big on this development, predicting that the SEC could greenlight up to eight ETH ETFs by week’s end.\n\nETF Approval Imminent\n\nNate Geraci, known for his sharp analysis at The ETF Store, is feeling positive about the chance of spot ETH ETFs launching this week. According to Cointelegraph, Geraci and insiders close to the process believe there aren’t many hurdles left, hinting that ETF approvals could happen smoothly.\n\nEthereum’s Meteoric Rise\n\nEthereum’s price shooting past $3,300 shows how confident the market is about ETFs. Experts like Tom Dunleavy from MV Global predict a flood of money from big investors once these ETFs kick in. Dunleavy, speaking to Cointelegraph, described Ethereum’s appeal as a tech stock of the crypto world, simpler for regular investors to grasp compared to Bitcoin.\n\nEthereum’s Recent Developments\n\nWhile ETFs are in the spotlight, Ethereum’s basic setup is making big improvements. According to Cryptoquant, Ethereum developers are talking about projects like Pectra and PeerDAS. These projects aim to make Ethereum faster and safer, which is crucial for its long-term success.\n\nWhat Lies Ahead for ETH?\n\nWith ETH now trading around $3,357 and climbing, all eyes are on what’s next for Ethereum. The big focus is on two things: how regulators will decide on ETFs and what new tech updates are in the pipeline. Analysts and investors are glued to these details, expecting them to shape how Ethereum performs in the months ahead. Additionally, if these spot ETH ETFs get the green light, it could turbocharge Ethereum’s price even more."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxORVp3R2cySnFfUnN3S0hKb3oxUVlmbG1SSXhFd3FheFFwS3R2ZWdvRTZ2VXRmeURaZDNNVW5YNEpsWkhEdXhRUWRoNFBEVVpXMXFlWlNHMW8tWVZfeno4MWJUSnFjN24ySE1sSW9CZUtTVm1uVDN2bnVvdjFlc3VxaEw4bkNJQVFLQjY4YzlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval: A Turning Point for The Crypto Market - Watcher Guru",
        "content": "Ethereum ETF approval will reshape the crypto landscape from its base. This change could be an essential milestone for digital assets.\n\nThe anticipation is, of course, building by the day, as Ethereum ETF approval will have a major impact on the broader market. This makes Ethereum ETF a focal point for investors and analysts.\n\nAlso Read: Top 3 Cryptocurrencies That Could Hit ATH Post Ethereum ETF\n\nExploring the Impact of Ethereum ETF Approval\n\nAnticipation Builds for Imminent Launch\n\nThe crypto community is buzzing with excitement about the possible launch of spot Ethereum EFTs. Industry leaders, including Nate Geraci (president of ETF Store), expressed optimism about the U.S. Securities and Exchange Commission (SEC) finally giving the green light.\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs you can see above, in a recent post, Geraci stated:\n\n“Welcome to spot ETH ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up with a good reason for any further delay at this point. Issuers are ready for launch.”\n\nBloomberg analysts Eric Balchunas and James Seyffart also have the same opinion. They suggest that these ETFs could debut in mid-July.\n\nThe SEC is well-known for giving minimal feedback on final registration statements. This can be interpreted as a positive and can suggest that the application is nearing approval. Furthermore, the SEC has made minimal changes to the latest filings.\n\nWhat Will the Market Response Be?\n\nThe anticipation about a possible Ethereum ETF approval has already boosted its price. ETH is currently trading at $3.342, with an enormous jump from $2.909 just a week ago.\n\nThe technical analysis of the charts shows a bullish trend, with Ethereum trading above $3.280 and the 100-hourly Simple Moving Average.\n\nAlso Read: Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH\n\nPotential Ripple Effects on the Crypto Ecosystem\n\nInstitutional Interest and Investment Inflows\n\nSpot Ethereum ETFs, as mentioned previously, have generated quite a bit of excitement for investors and financial advisors.\n\nBitwise Asset Management projects that these ETFs could attract $15 billion in net inflows until the year 2025 ends.\n\nIf this is true, this influx would explore Ethereum’s value and validate its current price revival.\n\nPaving the Way for Other Altcoin ETFs\n\nThe approval of Ethereum ETFs might put its foot in the door for other altcoins that want a similar product acceptance on Wall Street, and here are some of them:\n\nActive applications for a Solana ETF from VanExck\n\n21Shares has expanded beyond the Bitcoin-Ethereum duopoly\n\nAs a result, we could expect a more diverse range of crypto investment products in the future.\n\nAlso Read: VanEck Officially Files S-1 for Spot Ethereum ETF\n\nThe approval and the following trading of Ethereum ETFs could be an excellent marker of the growing demand for more mainstream and regulated crypto products.\n\nIt remains to be seen if the SEC’s decision will boost ETH ETFs to a new level. We’re eagerly awaiting their conclusion."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNbjlGbTNseEpyMlNGSEd1OEk3QU9rdE1nUlNVejNTcU5jRExTVkpaYjNWbC1Ob0l3ci1UUEtDbDhubFNraGR6NlR1bVI5T05OYTN0VlFQVXJDZzFjODBFSTZzVjUxeDBuUE9yVHF0TGZfUFdibjM3cXVvdWU1MFJrdXJvV01DVGNhLVdBRDFQZlhlRE5qN2xDOG5pVHdYdWlEc3RDeHMxM3ZhSW1vNzZFc9IBtgFBVV95cUxNSk5aSWdwTkoxQUxSNHBPV01ESV9URnpoaU5zOUR4UHV2aFFuOU5wMVBXOGxpUXpWaVp1S2Vfd09KMGZUVUdTOWJOTGE5TVE2M1ZKNTI2dnA4cDdIS3hSX1JQenBhZC1CNWdyTjdoanVaY3ZIT1RwM25hYV9XeWwxUExqcFJmWV92RWVlMVpFN1BXanQyRHFjQUZrQThxY0xpX0EtbWlIRzNYN2ZjOExySnNPOXpMUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Retakes $3.3K As Analyst Sees No Good Reason For ETH ETFs Not To Launch This Week - ZyCrypto",
        "content": "Advertisement\n\nThe price of Ethereum’s Ether (ETH) has rallied back above $3,300 as the long-awaited spot ETF exchange-traded funds (ETF) move closer to reality in the United States. One popular analyst anticipates that the ETH-based products could debut as soon as this week.\n\nAs of press time, Ether is trading for $3,375, up 13.6% from a price of $2,905 in the last week, according to CoinGecko data.\n\nPath To The Spot ETH ETF\n\nThe U.S. Securities and Exchange Commission (SEC) is expected to soon greenlight the launch of a handful of Ethereum-based exchange-traded funds (ETF) that can directly hold ETH.\n\nNate Geraci, president of the ETF Store, believes these ETFs will begin trading by the end of this week. In his opinion, there’s no reason for further delays as potential providers are ready for launch and recent filings require few modifications.\n\n“Welcome to spot ETH ETF approval week. Don’t know anything specific, just can’t come up [with] good reason for any further delay at this point,” Geraci posited in a July 15 post on the X (aka Twitter) platform.\n\nAdvertisement\n\nAnticipation for the trading of spot Ethereum ETFs has risen drastically since the SEC’s last-minute approval in May. While the regulator approved eight form 19b-4s, it has yet to green light individual S-1 filings from asset managers, which are required for trading to kick off.\n\nSeveral would-be issuers, including VanEck and 21Shares, submitted amended filings this week in hopes of securing the SEC’s final regulatory blessing to start listing spot Ether ETFs on U.S. exchanges. It’s worth mentioning that applicants edited out the parts of their applications that would have allowed staking the ETH holdings in the fund to appease the regulator.\n\nImplications For Ether\n\nThe race to launch an ether ETF is already heating up. Asset managers Invesco and Galaxy revealed they would charge a 0.25% management fee for their proposed spot ETH ETFs, a little higher than VanEck’s 0.20%.\n\nIndustry pundits foresee the approval of spot ETH ETFs having a huge impact on the Ether market as well as the wider crypto industry.\n\nThese spot ETH ETFs could attract remarkable retail and institutional capital into Ether, potentially mirroring the resounding success of spot Bitcoin ETFs. Bitwise CIO recently suggested the ETFs could draw in well over $15 billion in inflows within the first 18 months after the official launch — which would spark a massive surge in Ether’s spot price.\n\nNotably, other analysts expect Ether to outperform Bitcoin after the rollout of ETH ETFs."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA4N2VRNDJPbjFGajlOUklVREtaQWhuSWFFWGZ5a0ppZlI2N3FnZkRpR3l0bGNaNnRVZEtfcXdaLW5mT2FFU2NjZlpOUGdNYzlZRjZuMkNlVDBnY09ncGRfUEs5VHF3Xy1LTXNCUWpYSC1NekxKcFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Why Is Ethereum (ETH) Price Soaring Above $3,300? - CoinGape",
        "content": "With a total market value increase of more than 4%, the global cryptocurrency market is witnessing a recovery, and the current Bitcoin price stands at $62,000. Ethereum (ETH) has also kept up with the times. The value of the second top cryptocurrency surpassed $3,300, drawing the interest of both investors and analysts. This rise is not merely a small event, but a substantial uprising driven by several important factors. Let’s examine the factors behind the rising of Ethereum price and what is fueling this excitement.\n\nCurrent Market Performance of Ethereum Price\n\nadvertisement\n\nEthereum price has experienced an upward trajectory, breaking through the $3,300 resistance level with notable momentum. The cryptocurrency has moved from a stable base around $3,150 to new heights. This reflects a robust bullish trend that suggests the potential for further gains.\n\nETH is currently trading at $3,353.64, showing an increase of 5.00% and 15.11%, over the past day and week respectively. Even though the coin declined in value by 5.18% over the past month, it has seen a rise in both market cap and trading volume.\n\nOver the last 24 hours, the market cap reached $403.08billion, while trading volume hit $13.74 million.\n\nKey Factors Driving the Surge of Ethereum Price\n\n1. Technical Momentum\n\nMACD and RSI: The MACD indicator indicates growing momentum in the bullish area. The RSI is well above 50, indicating significant bullish sentiment and persistent buying pressure.\n\nETH is currently trading comfortably above the $3,280 level and the 100-hourly Simple Moving Average. An upward trend line at $3,270 provides strong support. Meanwhile, resistance levels at $3,340 and $3,350 are being tested.\n\n2. Institutional Interests\n\nSpot Ethereum ETFs: The upcoming approval of spot Ethereum ETFs by the SEC is a significant factor in the recent rise of Ethereum. Nate Geraci, ETF Store’s president, has forecasted that the approval could occur very soon. Geraci feels more assured because he has seen that issuers are prepared and there are few reasons for more delays.\n\nIndustry Support: Industry experts and leaders, such as Matt Hougan from Bitwise Asset Management, are also optimistic like Geraci. Hougan points out that slight changes in recent submissions indicate that we are getting closer to the end of the approval process. The authorization of these ETFs could greatly enhance Ethereum’s market visibility, just like how Bitcoin ETFs have already made an impact\n\nMarket Impact: Geraci expects that Ethereum ETFs could achieve similar success as Bitcoin ETFs, possibly becoming the second most successful ETF launch in history. This might result in significant increases in investments in Ethereum, causing its price to rise even more. Market experts Daan Crypto and Michaël van de Poppe foresee a promising price movement after the ETF release, suggesting Ethereum will maintain its positive momentum\n\n3. Market Sentiment:\n\nInvestor Confidence: Investor confidence in Ethereum is high due to the positive outlook on regulatory approval and the possibility of institutional investment. Investor interest remains high as Ethereum’s progress and increasing use in the cryptocurrency sector generate excitement.\n\nPotential Risks and Considerations: Although the present forecast outlook is positive, there are possible dangers. Should Ethereum face difficulties keeping up momentum and struggle to surpass resistance levels, a potential downside correction might take place. Important levels of support to monitor are at $3,270 and $3,220. Breaking below these levels may drive ETH down to $3,150 or possibly even further.\n\nWhat’s Next for Ethereum?\n\nAs Ethereum’s value surpasses $3,300, the main question is if it can maintain its momentum and exceed crucial resistance points. The expected approval of spot Ethereum ETFs is a major factor that could lead to more profits.\n\nNevertheless, investors must stay vigilant and monitor technical indicators and market sentiment to navigate possible downturns.\n\nConclusion\n\nThe Ethereum price surged over $3,300 because of strong technical signals, anticipated regulatory approvals, and positive market sentiment. The potential approval of Ethereum ETFs is a major factor driving the current bullish momentum. Being prepared for any fluctuations in the market is crucial with the ongoing increase in ETH value."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFA5aTJ2TTVrdkZNT2VuSEdwVmFNNE1zYnNncVdYcWJlZUxteDFfZmxJUlNXNlcxUUQwSjNjU1ZFd2hZUEVVR3hTQjV3UEFqZEl4NExLM1huUnZFQXF5OXluUlpwdEQydDEyUTA3X0w4NWjSAXZBVV95cUxPSWhaSkk2cHEtM01YNjFLTm1PM0hIZ3dLV2tqNlBVeEVIWjh1SnhhX0cxRVduR2lKanYwbGRWMnVzRlFmZFNGUDlCU3JucjB1Mi1ra1J5QU9DRk5fUDNMWVBnUVdGRERzeU5DVzVaRjJPS0FiQVhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Here's Why Ethereum's Buterin Is Getting 'Canceled' - U.Today",
        "content": "Ethereum co-founder Vitalik Buterin has joked about getting \"canceled\" on social media after speaking out about the importance of cleaning up indoor air.\n\nAdvertisement\n\n\"Me, early 2024: hmm I haven't been canceled for a while, maybe I should say something spicy and do another round… Me, Jul 2024: canceled for... trying not to get airborne diseases,\" Buterin added.\n\nOn Saturday, the Canadian programmer attached a photo of himself wearing a face mask on a plane next to an air quality monitor that shows elevated levels of CO2.\n\nAdvertisement\n\nHe has clarified that modern planes typically have relatively clear air due to ventilation and filtration, but those mechanisms typically tend to be turned off when the plane is on the ground.\n\nButerin is concerned about a lot of various viruses that can potentially contaminate the air.\n\n\"It's not the CO2 itself that's the (main) problem, rather it's a proxy way to measure that ∼7% the air I would be inhaling is air that has been breathed out by other people. 3000+ ppm means *lots* of various viruses,\" Buterin added in a post on the X social media network.\n\nButerin has long been focused on improving indoor air quality and air hygiene. With that being said, the reaction of the cryptocurrency community, which is teeming with anti-vaxxers and conspiracy theorists, was expectedly unhinged. Plenty of users half-jokingly stated that they were considering selling their Ether holdings in response to Buterin's post. Some also resorted to using ad hominem insults.\n\n\"The delta between the minds behind crypto and the minds of crypto consumers is pretty awesome to behold,\" one social media user noted."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPN180RHdjRUU1aF9FdmhpdHdCa21qV01OLUlLSTBZLWg3dklmT0tyUDc4ZXBBMTA4Yi1qcUVfU2VLbjlCQ3dvWDFxdVZ4TVRuMWJvLVFrUzdOczN0THoyUFdOT3o2b0Q4ek1jc0R3cmw3UXp0Y1NwcGpmcUpHQVBlWDdnMVhWdmdjQ1l5YTBlSVlPaUdzeUE00gGcAUFVX3lxTE81TVVMUUpXbm5iUlAya1VqTGVrdW4yVkZacFRiOWxTR1FST0JGSWNscnFJZEhFb0JJTjM5VzN0NXg2Ym5GUmhjUFBGb3pJVGF6VnA0WmNuSEVBZnItcEpXZUNaNmhDZWtyejlXTmRoNlNmWHQ1Vms4c3hlb1RnSTh1NnVnR0phaVNTV3JpTWl6NlFDVDNQd25VTkhxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Exploring the effect of PEPE whales’ exit ahead of Ethereum ETF launch - AMBCrypto News",
        "content": "PEPE’s large holders sold off significant portions of their holdings in the last 30 days\n\nOn-chain data revealed that the memecoin was undervalued and could rally after the event\n\nMany investors in the market consider the upcoming Spot Ethereum [ETH] ETF launch to be bullish. However, AMBCrypto found that large holders of Pepe [PEPE] seem not to share a similar sentiment.\n\nWe found this information after examining the addresses by holdings data. This indicator groups addresses into different segments and shows if they are accumulating or selling off their assets.\n\nIs the memecoin in chains?\n\nAt press time, AMBCrypto noticed that PEPE addresses holding tokens worth $100,000 to $10 million fell by double-digits. This decline implies that they have sold off some of their tokens within the last 30 days.\n\nThis is a surprise, primarily because PEPE is the top memecoin on the Ethereum blockchain. Therefore, it was expected that the big wigs of the memecoin sector would give the same bullish cues as the rest of the bullish market.\n\nIf this stays the same when the spot Ethereum ETFs go live, PEPE’s price might hike as a result of the development. However, it could be challenging to sustain the hike unless buying pressure increases.\n\nAt press time, the value of PEPE was. $0.0000087. This price meant that it was down 49.27% from the all-time high it hit on 27 May.\n\nGoing by the analysis above, further distribution could drag the price, and the token could be 55% down for the highs. However, post-Ethereum ETF’s launch, the token might perform well on the charts.\n\nHigher highs will come later\n\nThis was the signal the Market Value to Realized Value (MVRV) ratio gave. This ratio provides insights into profitability in the market.\n\nWhen the ratio rises, it means that the market cap is outpacing the realized cap. In this instance, holders of a cryptocurrency have motive to sell. However, if the ratio falls, it means that the realized cap is much more than the market cap.\n\nMost of the time, this brings about unrealized losses and there is little to no motive to sell. At the time of writing, PEPE’s 30-day MVRV ratio was -10.90%, indicating that it experienced a poor level of demand dynamics lately.\n\nHowever, the good part is that the negative ratio might force market participants to hold on to the token. Therefore, the memecoin could be termed undervalued relative to its current market conditions.\n\nAs such, if buying pressure intensifies much later, we could see the price attempt to revisit its May highs. Despite the bearish signs pre-ETF launch, some analysts believe that the memecoin would gain from the development.\n\nRealistic or not, here’s PEPE’s market cap in ETH terms\n\nOne of them is Donny Dicey, an analyst on X. The quote below is what Dicey thinks of the token’s reaction to the Ethereum ETF launch."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNeFBFVGprbHdyQVoyZzlyUmtWT2JIRFdWRGpGYUdUNV9Mc3hFazI4STVWa0Vjd2ZNb3IxcUdJdlIwUG9rNjJ5TjlteFJyQWRRRnQ4d08ydXhVOGFKNjNndTAzLTVIWXVHNThoX3VSX3JlSEY3bG44Nkd5SXFNbTNOV25yQk1aY3loLVBhLdIBkgFBVV95cUxObVdxSXdjRHM4QUkteXcwbjMyazlLTzh2YkhkeVNCS0F3TDBnaG9hVjRfYmFUWVRzVUwzc2gzOG1zZXN6V1oxV2ZZSC1DWDY5ZmdqRFdIdWkxVHBOSnVrTjE2S1lQdmhJUWNhWFZHTkhqbmxBRUZ1ZXEwWHNLQ0JJTlZ6UnpIdXE4dGc4VjlSck9pdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Declining Volume Sparks Doubts on $3000 Breakout - CoinGape",
        "content": "The Ethereum price analysis showcased a fresh relief rally in the second week of July. The bullish reversal uplifted the asset from monthly support of $2825 to $3196 registering a weekly gain of 13.2%. This recovery followed a market excitement towards the potential approval of spot ETH ETFs in the coming week and eased from broader market supply. Is the correction trend over?\n\nAlso Read: Bitcoin & Altcoins In Focus As Market Eyes Ether ETF, Fed Chair Comment, & Other Events\n\nadvertisement\n\nEthereum Price Analysis: Will Spot ETH ETF Approval Propel ETH to $4000?\n\nThe mid-term trend from the Ethereum price analysis shows a sideways action in the daily chart. The formation of a new lower high at $3974 and recently the same swing low at $2815 projects ETH price entering a consolidation trend to recuperate exhausted bullish momentum.\n\nA recent reversal from the $2815 support has uplifted the asset to $3191 within a week while the market cap jumped to $383.5 Billion. However, the declining volume accompanying the upswing suggests a diminishing interest among market participants to initiate long positions.\n\nThis lack of conviction from buyers suggests an unsustainable recovery and a potential for further correction in ETH. If the coin price reverts from the overhead trendline (downsloping blue line), the sellers could rechallenge the $2815 floor to extend the current correction.\n\nThe potential breakdown could accelerate the supply pressure and push the asset to $2400.\n\nHowever, the potential approval of spot ETH ETF could counter the bearish thesis to change market sentiment.\n\nAlso Read: Ethereum Price To Hit $5,000 As ETH ETF Speculation Ignites Bullish Comeback\n\nNate Geraci, President of the ETF Store, recently tweeted that the SEC’s approach to the spot Ethereum ETF S-1 filings closely mirrors their handling of the 19b-4 filings, marked by significant discretion. Geraci remains optimistic about the approval, anticipated next week, emphasizing that there is no justifiable reason for any delay.\n\nIt appears the SEC is playing the spot eth ETF S-1s similar to the 19b-4s… *Extremely* tight-lipped. Still think approval next week. Absolutely no reason for delay. — Nate Geraci (@NateGeraci) July 12, 2024\n\nThus, the potential approval could intensify the buying momentum and propel the ETH price prediction target above the $4000 mark.\n\nTechnical Indicator\n\nEMAs: The 20-day and 50-day Exponential Moving Averages (EMAs) serve as dynamic resistance levels during a bullish upswing, signaling a strong downward momentum in progress.\n\nRSI: The Relative Strength Index (RSI) reverted to 45% indicating a neutral sentiment among market participants.\n\nFrequently Asked Questions (FAQs) 1. What is the significance of the spot ETH ETF approval? The potential approval of a spot ETH ETF (Exchange-Traded Fund) is significant because it could increase institutional and retail investment in Ethereum. 2. What is a relief rally? A \"relief rally\" refers to a temporary increase in the price of an asset after a period of decline. 3. What is the Relative Strength Index (RSI)? The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements on a scale from 0 to 100.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxNQXpONkltelhFR05BeFgxeEJMQUlSb0pibHdxNW9NN0NVN2JmUGVzNVhYcFNCRERrX0piOHpOallTUEtsUTQ4azg3MXByZkdXSnd4UHI5Qk1ILTVRTlQtTkhPMkIyd253WnVURmUxVE1JMl8zb1V5dG5UZ3BIODR2V0pKZ2dwOHIxV1ZFLVA2YUFnUGtGelZoeC1nejcyQ3o4a0JndG1mT0ZSTWtpaGdDOWl1TmJVSmhoZnhVOHVTUjVBM2RqSGo5T2pSdHZmeXhsdWdfRWt3SXBZSlRzVGJyZU5PUFlJR2NwNG4zdlVsTDF0MXlucGhv0gH8AUFVX3lxTE12Tlp4U1hLZkNOWTc3ODdHT3NCRDdCY2hfSF9UUkpSY1dLbU94VXdTeG5LQnFrRG1jdzJMS19McFB2Mm1HMmJXX0RSMTdxVUVaZnhjbm9VbTJidnZ2ckJDT0JCdXVvYnJXVE1iQmNEa2FfcjlSR0tJQllaN1Y3N1MxQkdrSjVfcGdJUVZmSkI0T1ZVYU52TWN5eHJIQ21YSUVhYVdOSzBFbjhBaHU1YXdWUy1Udkt1V05fQ1lOdkp4ZkxlTTRvc3JLbTVMYWQ3Z3p2VDhuZ0RGUl9VbnR4bVEtMjZzVmoySFJ1ZVFyak1BYnFKdVhtalpxeloyVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "What to expect from Bitcoin, Ethereum and XRP when SEC treats cryptos as securities - FXStreet",
        "content": "The meme coin is primed to extend gains by over 15% and rally to the lower boundary of the Fair Value Gap (FVG) at $0.000183, as seen in the daily chart above. The momentum indicator, the Moving Average Convergence Divergence (MACD), supports the thesis with green histogram bars above the neutral line and the MACD line crossing above the signal line.\n\nFLOKI, a meme coin that ranks in the top 100 assets by market capitalization, extended gains and erased losses from the second week of July. FLOKI trades at $0.000159 at the time of writing.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOak5yaldDRTFVOTJOT1duQ2Zxc2VsbEt4QzVEeHRpcHlKMkJraVIzQ2dobURhUjBDcmRLN0RhSjVyWHk1ZEwxTkkzYmxhQWNVT1gteUNUVU5Ib2dtQUJGNzNFTWttb2tXWVhIZHliZGExTXhlb1lkdFRpV0tiNlVhUXNtZE5QdXFDSkJaYzlHMlhRVmo0UXVKZXUzeDNqcGJYbGpjYUlxZ2dkQzNsTFZGYmpKQ1g1dTBDUmVrakM1WEZyV1hzM0l0UE5VdlFKTVBmOTRPdzFR0gHbAUFVX3lxTE5YSklid3FBemtaYzRPRktuUmM0Q0xaSDR2aTloZldHcFJGRC1ZYktOTWZZdldKUGxrV21ZQjJtSUtCT2c2WFpMS2J4Y0F1MFhoMlhoRVotQ0tPRmhjbTZ5dnhFYWZmYXlhX0R5c0VzV0pCQTNXcFVLRzVIbXBXQ200THN1cnliRDlaZURrMkZ4U1RsNmxjbGlSOFQ5a1A2U1E2V3EtSWpqMmV3NkxEay1RV3NVbXp4aU9vY1RvaXZ1U01BUU1wam5zWmxaRklsRGJNRkFoSlZSeEVabw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Cryptos & Ripple – American Wrap 15 July - FXStreet",
        "content": "Ethereum is up nearly 7% on Monday following updates from Bloomberg analysts that the Securities & Exchange Commission (SEC) would potentially greenlight spot ETH ETFs to launch next week Tuesday. The increased inflows across global Ethereum investment products also align with the new development, as traditional investors seem to be preparing for a potential rally ahead of the launch.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQWUxINm5OQU5FanBFeGs4NVNfSUhpd2I0YUR4dndjbE9UYy1Qb3laVk9fRGNseW90MVpER3lkQlpPX2NlaDRTcFFKaXBiNTV5V2NaMy1LWE9qQVpJUEdlbGNGR1VHNnRZOEVMVzNsaXRYdl9nTlpMam05UE5jZmtFaTlCTEZ1Smk0cEQ3NVhjanMzRFBaY1BfQ2lJWm7SAaIBQVVfeXFMUF9FcmhyYUY0V1F5Ul9RZGlnSGtYcDhtaWRDQk5jd3RUOWJMZEFSVXpyV0JWdW0xU1Rsa1ZRYzUyOVRCWEkzS28xcFoxbmpLbWdjb3VoanNPQVZwMlFTNzFNeWZ4YlcwX2czeTZWM3ZDYTUwRmljSUpGLU5HMVg3RmNJUDZRaVl3Y0dFSnlpeVRuclAyb09zOUxqMzd3cmpycTFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Eyes $3.5K as ETF Launch Anticipation Grows - CryptoPotato",
        "content": "Ethereum has recently seen an uptick in demand near a crucial support level, leading to a notable rebound above the 200-day moving average at $3,134 and reaching the 100-day MA.\n\nThis price action highlights the potential for a bullish reversal if the price recovers above the 100-day MA of $3,342.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA detailed analysis of Ethereum’s daily chart reveals that after a prolonged bearish trend, the cryptocurrency briefly broke below the 200-day moving average at $3,081, introducing significant fear and uncertainty into the market, as this MA is a vital support level for the price.\n\nHowever, Ethereum found strong support at the substantial and decisive support region of $3K, resulting in a notable bullish rebound. The price has now climbed above the 200-day MA and continued surging toward the 100-day MA, indicating a potential bear trap and false breakout.\n\nCurrently, ETH has reached the 100-day MA of $3,142 and is on the verge of reclaiming it. This MA also aligns with the tactical resistance region of $3.3K, making it a robust barrier to buyers. Yet, if it stabilizes above the 100-day MA, this could confirm a bullish revival in the mid-term, with the next target being the $4K yearly high.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, Ethereum faced rejection near the multi-month descending trendline at $3.5K, entering a sustained and impulsive bearish trend. Upon reaching the decisive and psychological support region at $2.8K, the bearish momentum faded, resulting in the formation of a notable double-bottom pattern.\n\nFollowing this consolidation, an increase in buying activity led to a bullish rebound, breaking above the neckline and subsequently forming a successful pullback to the broken level.\n\nThereafter, the price experienced an impulsive surge, which clearly hinted at a bullish revival in market sentiment. Ethereum is now at a crucial resistance region, encompassing the significant $3.4K psychological mark and the multi-month downtrend line, where selling pressure may increase.\n\nIf Ethereum reclaims this resistance area, the bullish trend could continue toward the $3.7K mark. Conversely, a rejection at this level would likely result in the continuation of the bearish trend, targeting the critical $2.8K support.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum has recently experienced a bullish rebound, surging significantly toward the critical $3.5K resistance zone. Understanding the potential targets for the bullish trend is essential for predicting future price movements.\n\nThe accompanying chart identifies potential liquidation zones within Ethereum’s price action, offering insights for mid-term strategies by informed traders. Following the recent bearish decline below the $3K threshold, the price has tapped into the liquidity pool below $3K, primarily comprising sell-side liquidity from long positions opened near this mark.\n\nLooking ahead, significant liquidity is observed around the $4K resistance region, primarily consisting of buy-stop orders triggered by aggressive short positions during the previous impulsive bearish trend. In the mid-term, a plausible scenario involves the continuation of the bullish trend to capture liquidity near and above the $4K resistance level. This approach aims to exploit these liquidity zones strategically, potentially supporting further upward momentum in Ethereum’s price."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1leHdYWjRWQUxYcG9Yb1dVWnBOeDIxdmRRb0ViWm5PZ2w4SUlSWlI2NlUyaU1PSUNrbnJJMWpLOXpESFJyVFljQ3NFbVFUYTJZUExqd0V2Z1dRSkd5TFFYQkpkTGIxNU9nb1VnZEFHbnI5MzJBa3RCQTgydDBiTGfSAYQBQVVfeXFMT2dmZnNiMndNMWJ2dlBiQXo0QUd1MjJ5R2pqTVdSVk1wQzVGVk85bHZOYmZWN3JLRVBVS1dSN3BUNW5vN0tmWmJEemtaT1h1LU1rc3pwdGJ1bkYwUmMtVERHTlFaVzMzbDljMDFpSjBMM1Y1WVh3ODJEN3VneVdhMkZQLTdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "How Solana flipped Ethereum, Bitcoin in NFT Adoption - AMBCrypto News",
        "content": "Despite outshining BTC and ETH, SOL’s number of NFT sellers and buyers dropped.\n\nSOL was up by 4% in the last 24 hours, but a few metrics looked bearish.\n\nSolana [SOL], which nowadays has been in the limelight for its high network activity, has once again made an achievement in the NFT ecosystem.\n\nThe blockchain has managed to outshine top players like Bitcoin [BTC] and Ethereum [ETH] on a key front. In the meantime, its price action has also turned bullish.\n\nSolana’s promising NFT performance\n\nSolanaFloor, a popular X handle that posts updates related to the blockchain’s ecosystem, recently posted a tweet highlighting an interesting development.\n\nAs per the tweet, Solana outshined all other blockchains in terms of daily NFT blockchain user adoption. SOL’s number increased by almost 34% in the last 24 hours. Apart from SOL, Polygon [MATIC] and Ethereum made it to the top three on the same list.\n\nAMBCrypto’s look at DappRadar’s data revealed that Frogana, Retardio Cousins, and SMB Gen2 were the top three NFT collections on Solana over the last 24 hours.\n\nAs per Sanrtiment’s data, SOL’s NFT trade count spiked last week. Its NFT trade volume in USD also increased over the past few days.\n\nAMBCrypto’s analysis of CRYPTOSLAM’s data revealed that Solana also witnessed an increase in its NFT sales volume last week. To be precise, the number grew by 8%.\n\nHowever, not everything looked favorable. For instance, SOL’s number of NFT sellers dropped by 59% last week. A similar declining trend was also noted in terms of SOL’s number of NFT buyers, as the figure dropped by more than 66%.\n\nSOL turns bullish\n\nWhile all this happened, Solana bulls buckled up as its daily chart remained green.\n\nAccording to CoinMarketCap, SOL’s price increased by over 4% in the last 24 hours. At the time of writing, SOL was trading at $146.67 with a market capitalization of over $68 billion, making it the 5th largest crypto.\n\nHowever, SOL might soon lose its bullish momentum. At the time of writing, SOL’s fear and greed index had a reading of 68%, meaning that the market was in a “fear” phase.\n\nWhenever the metric hits this level, it suggests that the chances of a price correction are high.\n\nTherefore, AMBCrypto planned to have a look at SOL’s daily chart to better understand what to expect from the token. As per our analysis, the technical indicator MACD displayed a bullish advantage in the market.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nThe Relative Strength Index (RSI) registered an uptick and was headed further up from the neutral mark, indicating a continued price increase.\n\nNonetheless, the Chaikin Money Flow (CMF) went southward, which could restrict SOL’s price from moving up in the coming days.\n\n\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxObDRSeDRrTTdMMUZfNnphTTZBY29lWDQzMlFQUmxlZ0tjcnRpeHpXNkFwTkM5bEpJTFkwVzJQNVBldldMSmRJbFIwYTJjbkFWaFE2Vy1Vb1g0ckVEczBIREtmeTA1eHJ1Ui1ySGU0cG5ra3BfTXdhQ0N3ZXBCRXY4T2pqU3FaZFZtZ1lF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Clandeno (CLD) Presale & Ethereum (ETH) Both Surge Amid Binance Coin (BNB) Uncertainty - The Cryptonomist",
        "content": "SPONSORED POST*\n\nTL;DR\n\nEthereum (ETH) has retaken critical support levels of $3,000, rising to $3,200 as of press time.\n\nMeanwhile, the uncertainty surrounding Binance Coin (BNB) has led to a very modest gain compared to other big-cap altcoins.\n\nThe modest gains of both Ethereum (ETH) and Binance Coin (BNB) has led investors to reallocate their profits to low-cap gems like Clandeno (CLD), currently in its ICO phase.\n\nClandeno (CLD) is a peer-to-peer (P2P) e-commerce platform that uses blockchain technology to facilitate safe transactions between consumers and sellers. According to experts, it has the potential to skyrocket this summer.\n\nClandeno (CLD) Presale Brings In Millions\n\nClandeno (CLD) was one of the revelations this summer. The decentralized e-commerce platform has amassed $2 million after launching its presale earlier this month, indicating the major traction it has gained with its exciting Web3 take on e-commerce. Clandeno (CLD) is ushering a new era in the trillion-dollar online shopping industry with the launch of its decentralized online marketplace. The project is being widely expected by analysts to be among the biggest gainers of 2024 thanks to its features and innovations. Analyst price predictions peg Clandeno (CLD) to turn in outsized ROIs this summer, outperforming Ethereum (ETH) and Binance Coin (BNB) end-of-year price predictions.\n\nEthereum (ETH) Pumps Strong; Binance Coin (BNB) Slow on the Bounce\n\nEthereum (ETH) had been struggling mightily to start off July, falling all the way to $2,700 in the wake of the Bitcoin (BTC) crash. However, the recent Ethereum (ETH) approval and the recent recovery of Bitcoin (BTC) to $60K catalyzed a pump that pushed Ethereum (ETH) prices to $3,200 as of press time. However, Binance Coin (BNB) failed to show the same robust growth over the past week, recording a modest 5% gain compared to Ethereum (ETH) and Bitcoin (BTC). One of the major concerns for investors is Binance Coin (BNB) issuer Binance’s legal woes, which have contributed to an overall bearish trajectory of Binance Coin (BNB). Currently, Binance Coin (BNB) trades at $538.\n\nClandeno (CLD) Could Deliver Massive Gains for Early Investors\n\nClandeno (CLD) is introducing blockchain technology and combining it with Web3 to create an online marketplace with exciting DeFi and decentralized e-commerce features. Clandeno (CLD) will connect merchants and sellers under one roof and provide the most viable decentralized alternatives to eBay and Amazon. With the trillion-dollar e-commerce industry only set to grow exponentially in the coming years, Clandeno (CLD) Token prices are as low as they ever will be. Don’t sit this presale out!\n\nConclusion\n\nForget Binance Coin (BNB) and Ethereum (ETH) if you wish to make serious and tangible gains worth your investment. To get the most out of your capital, the best opportunity on the board is THE most awaited ICO of July: Clandeno (CLD).\n\nTo find out more about the Clandeno presale, visit their website here"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQSUE1Tkw1SW1GZWl2MG02b0hhc2dSamRaWFE4UV9xaFowLU1aclo2Z0hIT2E2NTdKSG9kci1nLVVSa2NWRmY0ckp1b29abThuYUF5Z1Fkczdlb01raFpITkhOUW5NcHZZY2pmMGxvYmdXaUx0TU1lS3BqZjdVQjVWVkI4ZG5rQXAtVnfSAY8BQVVfeXFMTmNiMFBldzBOMkJlVVpWTVo0czdiM0Jhd1FxT3QtZHpmNENueTZ3TDRQX0xWNkZOM3dQZzItc1lKYUluLWpjTEdQaElrZDdqckZsTlBGRUlqZzhfMWQ2aENFRUNaV0R2MW9QNzB1YmhOU0hWQnRLRnd6TFlVeUtUSURjRXpraVE3cklmLTVIYzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Ethereum sees rising demand from U.S. investors – Price impact? - AMBCrypto News",
        "content": "The increase in the Coinbase Premium Gap suggests a price increase for ETH.\n\nHowever, ETH might not reach $4,000.\n\nAccording to data from CryptoQuant, crypto investors have been buying Ethereum [ETH] in large numbers. This was evident from the trend of the Coinbase Premium Gap.\n\nThis metric measures the difference between the ETH price on Coinbase and that of Binance. When it decreases, it means that investors from America are selling ETH or refraining from buying.\n\nAmericans now trust in the altcoins\n\nBut high values, like its recent rise to 0.78 suggest strong buying pressure from the U.S. As per AMBCrypto’s findings, increased exposure to Ethereum might be connected to the imminent Ethereum ETF launch.\n\nBut apart from that, it provides the altcoin price with a higher chance of increasing. For example, in March 2023, the Coinbase Premium Gap dropped to one of its lowest point ever.\n\nThis led ETH price to drop below $1,400. Fast forward to March 2024, the same metric hit a high point. At that time, ETH jumped to $4,065.\n\nAt press time, the market value of ETH was $3,194. This was a 34.70% decrease from its all-time high. However, if buying pressure continues to improve in the U.S. and other regions globally, we could see the price erase some parts of this drawdown.\n\nFurthermore, data tracked by IntoTheBlock gives context of price Ethereum can reach should accumulation intensify. The specific metric AMBCrypto looked at was the IOMAP.\n\nETH set to retest $3,437 despite neutral sentiment\n\nIOMAP stands for In/Out of Money around Price. In addition, this indicator spots buying and selling zones that are supposed to act as support or resistance.\n\nIt classifies addresses based on those making money, at breakeven point, and those out of money.\n\nThe larger the cluster of addresses at a price range, the stronger the support or resistance it offers. As of this writing, 3.56 million Ethereum addresses were in the money and purchased 2.47 million ETH at an average price of $3,140.\n\nTo the right, 2.02 million addresses bought 4.01 million ETH around $3,242, and are out of the money. Considering the larger addresses in the money, there is a chance ETH might break the resistance at $3,242.\n\nIf this is the case, the next area for the cryptocurrency to reach could be $3,347. AMBCrypto checked the Ethereum Fear and Greed Index to see if it could be a good time to buy ETH.\n\nFurther, this index ranges from o to 100. Values close to 0 indicates fear and those close to 100 indicates greed. As of this writing, the index was 39, meaning that there was neither extreme fear nor greed.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the reading provides an opportunity to purchase the altcoin especially as the ETF launch is seemingly a bullish event.\n\nWhile the price of ETH seems in line to increase, a decrease in overall interest could invalidate the prediction."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQRWlpV05XMG1tWVY0NEZoQWZ5NWV3cERsb09HQVllYVh5ZlppaXVMbWVIWUpndW1mZlJZb1F1bWhGTFRHYkk2aDh2N1BuczJZc0FGT3d0Q3lNalFNUFl4RkIwUTFVd0FqTEI3bzhQTTJ4anZ2ZV9FTDFnaEJuYnVmUFZkT0hpSzRzZEVMbmxB0gGTAUFVX3lxTFBGOTdaeS02WnBnS2p5SHBrZ3dWY0FtSUxITWN6bm9RbXl0dk8yRDlkTjRYdzhmNEIzdUFLNnhpb2FhMHIyUUVXck5yeHNKVWQ1TGtfNE03cThVQTJESHg1NFI0UEl2VlJ3MlRCOE5VOGdoeWMyU2tUVkZJSVRGQjJZOEo5eU54a2VVRzVFTU5iUHBiaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun buys Ethereum worth $45M from Binance: What’s his plan? - AMBCrypto News",
        "content": "Justin Sun’s recent 14,436 ETH purchase from Binance continued his strategic investments in Ethereum.\n\nSun’s history of buying ETH has revealed a calculated investment pattern, resulting in over $50M in unrealized profits.\n\nJustin Sun, the founder of Tron [TRX], has reportedly made another significant transaction involving Ethereum [ETH].\n\nAccording to on-chain analytics provider Spot On Chain, Sun allegedly redeemed 14,436 ETH from Binance [BNB].\n\nThe transaction in question involved the withdrawal of 14,436 ETH, worth approximately $45.51 million, from Binance by the wallet 0x43594da5d6a03b2137a04df5685805c676def7cb, which is believed to belong to Justin Sun.\n\nThe transaction ID for this withdrawal is 0x49856fe8819766a4788d92430bdb2281a1903d43d5cc920633c08753441884bf.\n\nMoreover, the withdrawal took place around 22 hours ago, following a deposit of 45 million USDT to Binance three days prior. This makes the purchasing price around $3,117 per ETH.\n\nJustin Sun’s history of buying ETH\n\nSince the 8th of February, Sun has potentially acquired 377,188 ETH at an average price of $3,049. All these transactions were completing by using three separate wallets.\n\nThe aforementioned purchases included 169,604 ETH in February at an average price of $2,870, 192,168 ETH in April and July at an average price of $3,175, and 15,416 ETH in June at an average price of $3,474.\n\nThese acquisitions have led to an unrealized profit for Justin Sun, exceeding $50 million at press time, reflecting a gain of about 4.4%.\n\nMarket reaction\n\nWhen Sun made his recent withdrawal, the price of ETH dipped by approximately 10%, causing significant unrealized losses.\n\nDespite this, Sun has continued to make notable acquisitions. Tron’s co-founder reportedly used another 5 million USDT to buy 1,614 ETH at around $3,097 per ETH.\n\nHis strategy typically involves depositing stablecoins to exchanges before purchasing ETH, indicating his ongoing interest and engagement in the Ethereum market.\n\nAs of press time, ETH was trading at $3,353.33, with a 24-hour trading volume of $12,181,635,567, per AMBCrypto’s look at Coingecko’s data.\n\nThis marked a 4.89% price increase in the last 24 hours and a 15.47% increase over the past seven days."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQYUpMNTBpWmZ5N29fVjBkQTJOYk9YdlJsc2JzRUNTV0F6MXVzRWhnR0I1djFmbVl4aTRjTVZ0VmdyaGF4ZTluVzdkR3JuZWdWaWZHazVhbThuMFVja3VfajNJUlZfdl8tSXJHQk9jbU1ZQzhmSGtDTVIxYUl5SVBZUWZLWkU5SWRRY2xoUlVDQ3hHdzAxajZWRjBmWG9veG1ZT196R0l5dEhkSnZ5NEJYeUVteC1ic00z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "What’s the go with crypto: Is Bitcoin still a good investment? - Sydney Morning Herald",
        "content": "Money editor Dominic Powell and our experts share tips on how to save, invest and make the most of your money.\n\nReal Money, a free weekly newsletter giving expert tips on how to save, invest and make the most of your money, is sent every Sunday. You’re reading an excerpt − sign up to get the whole newsletter in your inbox.\n\nAround the start of 2017 as a bright-eyed, [AGE REDACTED]-year-old, I remember stumbling onto an article discussing a relatively new cryptocurrency called Ethereum. The article made a raft of claims about how it and various other digital currencies would revolutionise the internet and entirely change how we interact, transact and work online, which sounded pretty cool at the time.\n\nInvesting in the cryptocurrency space can be daunting. Credit: Michael Howard\n\nObviously, none of that happened and almost certainly never will (despite constant assurances from crypto fanatics), but what did happen since 2017 is the price of Ethereum went from $20 to about $4500. Similarly, the price of Bitcoin, the most well-known cryptocurrency, jumped from being worth about $2000 to $85,000 today, great news for anyone who got in when it was cheap. For a detailed description of what cryptocurrency is, check out this Explainer I wrote a while back.\n\nFast-forward to today, and the launch of new crypto products, such as Australia’s first exchange-traded fund with Bitcoin as its underlying asset, tends to come with far less hype than, say, the heady days of non-fungible tokens and Dogecoin. And the major cryptocurrencies (Ethereum, Bitcoin), although still volatile, tend not to experience the same wild price swings of even a couple of years ago − even if there’s still a bunch of smaller, useless “meme coins” operating effectively as pump and dump schemes trying to entice unfortunate investors."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE45R25KZWtMV0FhTl9BQ25CTGoteS1FRC1fOEJiTWNyVUI5RHZESDlRN0NrUkJvc2VyeDBaSU9MQVhIT3dvMmYzZ3UwZlVUdHFKdGNCWjE4Mmw5d2RxWVEtclF4Y2hlUUx2UGlhWlpiaE03bl9OcDdzcFpmWF_SAYIBQVVfeXFMTWVhS0lLa0FLM3IwVm5kTXdaTTJPeVlXYXVPZXYtNTFVbmFIZlJMOFJQZXhXYk8tVEhVYXhSV1BhUFRhSXd1NXZIRFBiWFI0OVhJUWI2c0dadjFnaHNmUXFrREtYcjhsdkc2MWhxXzY1aFhKWG1Zc29Rck56WmdQTW5WZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Etheruem’s next price target: ETH can cross $3700, IF… - AMBCrypto News",
        "content": "Ethereum has a bearish market structure on the daily chart but still targets the next key resistance zone.\n\nThe volume has been sub-par in recent days, hence a retracement next week is possible.\n\nEthereum [ETH] clambered back above the $3k level, and in an interesting turn of events for the bulls, the $3.1k former resistance zone was flipped to support.\n\nThe balancing act between whale deposits and exchange reserves showed that the recent deposits were minor compared to the outflows of the past two months.\n\nThe Ethereum network’s gas fee reached May’s lows, a sign of reduced network activity. This was not a positive sign and reflected reduced on-chain demand and slow growth.\n\nVolume indicators ambivalent despite the breakout\n\nOn Saturday the 13th of July, Ethereum closed a daily trading session at $3,201, breaking out of the resistance zone in the $3.1k area. Despite this achievement, the market structure and momentum were bearish in the daily timeframe.\n\nMoreover, the CMF showed a reading of -0.05 which signaled notable capital flow out of the market. The OBV was unable to start an uptrend as buying volume stuttered over the past ten days. This meant that the volume was too weak to be taken as a clear signal of bullish strength.\n\nThe daily RSI was at 45 to signal bearish momentum but has crept higher over the past week. As things stand, Ethereum might not be ready for a swift upward move unless more volume enters the market.\n\nLiquidation heatmap’s clues on the next resistance\n\nThe $2.7k-$2.8k zone to the south was an attractive pool of liquidity. It was tested in the first week of July but not wholly swept.\n\nThe subsequent price bounce above $3.1k meant the next liquidity cluster at $3.5k-$3.7k would be the target for bulls.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe Open Interest has climbed alongside the prices and the funding rate was positive. The sentiment was strongly bullish, and the spot CVD was recovering too.\n\nIf the trend remained intact, the chances of an ETH move toward $3.6k would become healthier.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9zcnU2X01GVXc5c3FMSV96cUVsZDJuZDd1UE5lMnkwOWRlRVR1eDV3b0JMVTNOWlRhOXkyTlVNRnVpS3M0Z0lWV0tIX2lEczNlV0dwNkM0WnZxam5qQ05sSWdHOXRES2dFN1F0MkpsUWYtdFFXV0HSAXtBVV95cUxQcVloZGtzOGZKUDllNWN5SlBGc00tR2xUYlBLNGp3RGZMZmNqMU5vOGRkYlA1TzRMT0RNZG5vLUxZRTF2Y1RwQTJJdnRwMFA1Z3lXLV9XbzhYQ3dhdWcwNGxxTW9ZODRnamxVT2F4ek8xWGdCYlI1OGg5T2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 04:22:20 GMT",
        "title": "Ethereum Leaps 5%, Crosses $3,300: Bulls Command The Market - NewsBTC",
        "content": "Ethereum price started a major increase above the $3,250 resistance zone. ETH even surpassed $3,300 and aims for more upsides in the near term.\n\nEthereum is gaining pace above the $3,250 level.\n\nThe price is trading above $3,250 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bullish trend line forming with support at $3,270 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise above the $3,320 and $3,350 resistance levels.\n\nEthereum Price Regains Strength\n\nEthereum price started a steady increase above the $3,150 resistance zone. ETH even climbed above the $3,250 resistance to move into a positive zone. Finally, there was a move above the $3,300 resistance, like Bitcoin.\n\nIt tested the $3,250 resistance zone. A high was formed at $3,339 and the price is now consolidating gains. The bulls seem to be active well above the 23.6% Fib retracement level of the upward move from the $3,084 swing low to the $3,339 high.\n\nEthereum is now trading above $3,280 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support at $3,270 on the hourly chart of ETH/USD.\n\nOn the upside, the price is facing resistance near the $3,340 level. The first major resistance is near the $3,350 level. The next major hurdle is near the $3,420 level. A close above the $3,420 level might send Ether toward the $3,500 resistance.\n\nThe next key resistance is near $3,550. An upside break above the $3,550 resistance might send the price higher toward the $3,650 resistance zone in the coming days.\n\nAre Dips Supported In ETH?\n\nIf Ethereum fails to clear the $3,340 resistance, it could start a downside correction. Initial support on the downside is near $3,270 and the trend line. The first major support sits near the $3,220 zone.\n\nA clear move below the $3,220 support might push the price toward $3,200 or the 50% Fib retracement level of the upward move from the $3,084 swing low to the $3,339 high. Any more losses might send the price toward the $3,150 support level in the near term. The next key support sits at $3,050.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,270\n\nMajor Resistance Level – $3,340"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQaWJQa1pOYUNIblEyOHJCam1LTjd3NDFnRi01ZDk0clRieExVVEdRaVItVXN4VnQ4bDUzLWV0UnZWdUliYjdOaXVieS1LYVN1MllKRFNFVzBSN1RrQldLMVo5bE1tbnRRWWxKQW10OVpJUDdobnA4bVo1VVNUNmx3bjlYaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Here’s when Ethereum will reach $4000, according to analyst - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is currently showing signs of recovery after a recent sell-off phase. This has led to a notable rebound, suggesting the potential for a continued uptrend.\n\nOver the past two months, Ethereum has outperformed Bitcoin (BTC), with analysts predicting a significant price increase in the coming days due to the anticipated launch of an Ethereum ETF.\n\nThis event is expected to strengthen ETH against BTC, particularly given the bearish divergence on the BTC weekly chart.\n\nDespite the optimism, there is no clear timeline for the launch of the much-anticipated spot Ethereum ETF, causing confusion among issuers about the delay.\n\nNevertheless, major market participants and Ethereum whales have been accumulating ETH in preparation for ETF approval, anticipating a substantial price increase once the approval is granted.\n\nIn a TradingView post on July 13, analyst RLinda pointed out that the daily chart of ETHUSDT shows that bulls are actively maintaining the price above a crucial support line.\n\nTechnical analysis and market outlook\n\nAccording to the analysis, the area above the 200-day moving average (MA) indicates consolidation, which is a positive sign for a bullish structure.\n\nETH price analysis chart. Source: TradingView/RLinda\n\nThe current resistance level is around $3,200, and a breakout could lead to significant upward movement, potentially targeting the $4,000 to $4,800 range.\n\nOn a shorter, four-hour timeframe, the price movement is characterized by consolidation. A large player appears to be actively purchasing ETH, anticipating important news and reinforcing the intermediate bottom zone.\n\nThis period of consolidation, supported by increased volume, indicates strong buying interest and a likely continuation of the uptrend. The key support levels here are around $3,056 to $3,152, which have consistently held firm.\n\nETH weekly price analysis chart. Source: TradingView/RLinda\n\nThe weekly chart supports this bullish outlook, showing a pattern of higher lows indicative of a long-term bullish trend. The key support level at approximately $2,852 has proven resilient, with buyers preventing further declines.\n\nA breakout above current resistance levels on the weekly chart could lead to a significant rally, targeting the $4,000 to $4,800 range.\n\nTimeline for reaching $4000\n\nGiven the current market conditions and the anticipated approval of ETH-ETFs, Ethereum could reach the $4000 mark within the next 4 to 6 weeks.\n\nThis projection is based on the expected approval of ETH-ETFs within the next 1-2 weeks, technical indicators suggesting a strong uptrend, and positive market sentiment with strong buying interest.\n\nAs of the latest update, Ethereum is trading at $3,201.78, reflecting a 2% increase on the daily chart.\n\nETH seven-day price chart. Source: Finbold\n\nThis upward momentum is bolstered by both fundamental and technical indicators pointing towards a bullish future.\n\nIn the short term, maintaining consolidation above MA-200 and breaking through key resistance levels are crucial.\n\nIn the longer term, sustaining the support levels and continuing the bullish trend could see Ethereum reaching new highs.\n\nThe alignment of both fundamental and technical factors suggests that Ethereum could reach the $4000 mark soon, particularly if the anticipated ETF approval materializes.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOTzZWYlZLS1N6WnJ3QXRxU000bnZGY294aV9XeGFIYUhKSzZUQ2RIWWFOYzlObjAtTmV2cDRIUDBjalpjdmtkTWZPVDRwVnhFWFlfSEljQUgxZnk2Yk04eG4zUDMzUkdEc2F2ZkNVdUltcVUwUnBhVERFSlJQYlRCM0NFZi1rcEI4UlY4VlVubmxaMUlYMjBwM2NmTXJvRzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jul 2024 07:00:00 GMT",
        "title": "Ethereum or Cardano? We asked ChatGPT-4o which crypto is a better buy for 2024 - Finbold - Finance in Bold",
        "content": "Ethereum’s (ETH) position as a leading decentralized finance (DeFi) crypto project faces significant competition from other established entities.\n\nNotably, Cardano (ADA) is among the prominent projects vying for Ethereum’s throne. Cardano has undergone significant developments, building the potential to replace Ethereum.\n\nIndeed, based on this unique position, the crypto tokens underlying projects can serve as unique investment opportunities. In this vein, Finbold consulted OpenAI’s most advanced artificial intelligence (AI) tool, ChatGPT-4o, to gather insights on which crypto is a better investment for 2024.\n\nThe AI tool noted that deciding whether to invest in Ethereum or Cardano in 2024 involves analyzing several factors, including their performance, development progress, market position, and future potential.\n\nComparative overview\n\nThe AI project acknowledged that Ethereum has rallied by 40% in 2024, indicating strong investor confidence and market performance. It boasts a well-established ecosystem with many decentralized applications (dApps) and smart contracts.\n\nThe Ethereum network’s transition to Ethereum 2.0 improves scalability, security, and energy efficiency by introducing Proof of Stake (PoS). Additionally, Ethereum has a large and active developer community that is continuously innovating and improving the platform.\n\nHowever, ChatGPT-4o noted that Ethereum still faces challenges despite recent improvements, such as high transaction fees. These high gas fees can be a barrier for small transactions.\n\nEthereum strengths and weaknesses. Source: ChatGPT-4o\n\nOn the other hand, Cardano‘s price dropped by 28% in 2024, suggesting a decline in market confidence or other challenges. Cardano is known for its rigorous academic research and peer-reviewed development process, which aim for a highly secure and scalable blockchain.\n\nIt uses a PoS consensus mechanism, which is more energy-efficient than Ethereum’s previous Proof of Work (PoW) model. The Cardano team continues to roll out significant upgrades and developments, such as smart contract capabilities with the Alonzo upgrade.\n\nDespite these strengths, ChatGPT-4o noted that Cardano’s ecosystem is less mature or widespread than Ethereum’s, with fewer dApps and projects running on its platform. The recent price drop may reflect broader market sentiment or specific issues within the Cardano community or technology.\n\nCardano’s strengths and weaknesses. Source: ChatGPT-4o\n\nThe verdict\n\nWhen choosing between the two, the AI tool pointed out that given Ethereum’s strong performance, established ecosystem, and upgrades with Ethereum 2.0, the asset might be the better buy for 2024. This year’s rally indicates strong market confidence, and its mature ecosystem offers more immediate opportunities for investors and developers.\n\nIn contrast, ChatGPT-4o stated that while Cardano presents an innovative approach and energy efficiency, it faces challenges in adoption and market confidence. However, it could present a buying opportunity if investors believe in its long-term potential and the success of its ongoing developments.\n\nHowever, it noted that Ethereum might offer more stability and immediate opportunities, while Cardano could be a higher-risk, potentially higher-reward option. The tool advised diversifying investments across assets to balance potential rewards and risks.\n\nETH vs. ADA investment verdict. Source: ChatGPT-4o\n\nIn summary, the AI platform noted that when considering an investment between the two, it’s important to put into perspective the risk tolerance and investment horizon.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]