[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPZ25Zc1M5Q19CUUtxUE9hMGw2cGVpdVY1cUJmZHhKNjVDd2g0dGpNWFJKVFVDeU5tS1FQemVWOUl6UTJfVWFaZ2pDdE9kcnZ0VG1YVFUyR25JSFljTzRrRk9FM0E1MlRhcWotUWk3UGdDYVdMMjFmVmMzQVd2cWlSTw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "The Investment Case for Ethereum in 2024 - VanEck",
        "content": "Please note that VanEck has exposure to Ethereum.\n\nSince its release in 2015, Ethereum adoption has grown exponentially, attracting hundreds of millions of users, and gaining the attention of mainstream investment firms and payment applications. As a decentralized platform enabling smart contracts and distributed applications (dApps) to be built and run without any downtime, fraud, control, or interference from a third party, Ethereum stands out in the cryptocurrency world. This article evaluates Ethereum’s potential as an investment, considering its unique position and future prospects in the evolving financial landscape.\n\nUnderstanding Ethereum: More Than Just a Cryptocurrency\n\nEthereum leverages blockchain technology but extends beyond being just a cryptocurrency. The Ethereum Virtual Machine (EVM) is central to its operations, differentiating it from other digital currencies. The EVM, a sandboxed virtual stack embedded within each Ethereum node, executed bytecode and smart contracts – self-executing contracts with terms directly written into code, operating without downtime, censorship, or fraud. This innovation shifts the paradigm from traditional contracts requiring intermediaries to automated, trustless transactions.\n\nMarket Dynamics: Assessing Ethereum's Investment Viability\n\nPrice Influences: Market Sentiment and Global Trends\n\nThe price of Ethereum is influenced by market sentiment, driven by news, social media, and overall attitude towards the crypto market, which significantly impacts Ethereum’s price. Positive news about institutional adoption can lead to price surges, while negative sentiment, such as fears of regulatory crackdowns, can cause price drops.\n\nMarket Sentiment: Investor sentiment plays a crucial role in the cryptocurrency market, often driven by news, social media, and overall investor attitude towards the crypto space. For example, positive news about institutional adoption of Ethereum can lead to price surges, as seen when large financial institutions announce their support for Ethereum or when there's a growing interest in decentralized finance platforms built on Ethereum. Conversely, negative sentiment, such as the spreading of unfounded rumors or fears of a regulatory crackdown, can lead to significant price drops.\n\nGlobal Economic Trends: Macroeconomic factors such as inflation rates, interest rates, and economic policies in major economies can significantly impact Ethereum's price. For instance, during times of high inflation, some investors may turn to cryptocurrencies like Ethereum as a hedge against their local currency's devaluation. Similarly, changes in monetary policy, such as the Federal Reserve's interest rate decisions, can influence investor appetite for riskier assets like Ethereum.\n\nRegulatory Changes: The regulatory environment surrounding cryptocurrencies is continually evolving and can have immediate impacts on their prices. Positive regulatory news, such as a country legalizing cryptocurrencies or clarifying tax guidance, can lead to price increases. Conversely, negative regulatory actions, such as bans or restrictive regulations in significant markets like the US, China, or South Korea, can lead to sharp declines in price. For example, China's crackdown on cryptocurrency mining and trading in 2021 led to a significant drop in the price of Ethereum and other cryptocurrencies.\n\nTechnological Developments: Advances in Ethereum’s technology or its ecosystem can also influence its price. The transition from Ethereum 1.0 to Ethereum 2.0, with its shift to proof-of-stake (PoS), aimed to reduce transaction fees and increase transaction speed and energy efficiency. Such upgrades can lead to positive price movements as they address scalability and cost issues. However, delays or problems in these technological upgrades can lead to negative market reactions.\n\nHistorical Price Analysis: From Launch to 2024\n\nEthereum has experienced significant volatility since its launch, reflecting market dynamics, technological milestones, and investor sentiment.\n\n2017 Boom: Ethereum’s first major price increase occurred in 2017, peaking at around $1,400 in early 2018, alongside a broader cryptocurrency market boom.\n\n2020-2021 Growth: Significant growth in 2020 and 2021 saw Ethereum reaching new highs above $4,000, driven by its growing adoption and the booming DeFi sector.\n\nCrypto ETFs: The adoption of Exchange-Traded Funds (ETFs) has further boosted Ethereum’s price. ETFs provide a regulated way to gain exposure to cryptocurrencies, attracting both individual and institutional investors and increasing demand for Ethereum."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOZWVlLUJzYkE4cFpJMWxaZWJrLXlqMU40YnFmUDdYbGFqTXppN1BUeWFtOUctcWNSY3JZdlluUTJHbkZBQld3TER4SUFWSjhUWXAtTlNDb0MzendudlZCS1dHV0VtMzdJZGhhNlNJZktPYUhsVFRpbnJSbWhGZkp5cnRNSFpDdzdrV3BzRGJQVkN2a2xzOGNkOWp1OUw4enExRnV1dmIxSkFWaGFVOGJzMUZwZWRHajNx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "BlackRock’s iShares Ethereum Trust ETF Set to Launch - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--The registration statement for BlackRock’s iShares Ethereum Trust ETF (ETHA), has been declared effective by the U.S. Securities and Exchange Commission (SEC). ETHA seeks to track the price of Ethereum’s native token, ether, and is expected to begin trading on Nasdaq on July 23, 2024. ETHA carries a 0.25% sponsor fee with a one-year waiver reducing the fee to 0.12% on the first $2.5B assets under management (AUM)1.\n\n\" Our clients are increasingly interested in gaining exposure to digital assets through exchange-traded products (ETPs) which provide convenient access, liquidity and transparency,\" said Jay Jacobs, U.S. Head of Thematic and Active ETFs. “ Ethereum’s appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries.”\n\nThe iShares Ethereum Trust ETF (ETHA) offers exposure to the Ethereum's native token, ether, the second largest cryptocurrency by market capitalization.2 Ethereum, a global technology platform, is similar to an app store that generates value for ether as usage increases and more applications are built on top of it.\n\nOver the last 12 months, iShares has launched 170 ETFs and ETPs including the iShares Bitcoin Trust (IBIT), driving innovation and providing investors with more choices to help them meet their investment goals.\n\nWith over 20 years of experience and more than 1,400 ETFs globally, iShares has helped millions of investors access different corners of the market. Every iShares product is underpinned by decades of investment expertise and institutional grade technology.\n\nTo learn more about the iShares Ethereum Trust ETF filing visit: https://www.sec.gov/Archives/edgar/data/2000638/000143774924023199/iset20240720_424b3.htm\n\nAbout BlackRock\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading provider of financial technology, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit www.blackrock.com/corporate | Twitter: @blackrock | LinkedIn: www.linkedin.com/company/blackrock\n\nAbout iShares\n\niShares unlocks opportunity across markets to meet the evolving needs of investors. With more than twenty years of experience, a global line-up of 1400+ exchange traded funds (ETFs) and $3.86 trillion in assets under management as of June 30, 2024, iShares continues to drive progress for the financial industry. iShares funds are powered by the expert portfolio and risk management of BlackRock.\n\nImportant Information\n\nA registration statement has been filed for the iShares Ethereum Trust ETF (“the Trust”) and the registration statement has become effective. However, shares of the Trust are not yet available for purchase or sale. Carefully consider the Trust’s investment objectives, risk factors, and charges and expenses before investing. This information must be accompanied or preceded by a current iShares Ethereum Trust ETF prospectus and iShares Bitcoin Trust Prospectus. Please read the prospectuses carefully before investing.\n\nThe iShares Trusts are not investment companies registered under the Investment Company Act of 1940, and therefore are not subject to the same regulatory requirements as mutual funds or ETFs registered under the Investment Company Act of 1940. Investments in these products are speculative and involve a high degree of risk.\n\nInvesting involves a high degree of risk, including possible loss of principal. An investment in the Trust is not suitable for all investors, may be deemed speculative and is not intended as a complete investment program. An investment in Shares should be considered only by persons who can bear the risk of total loss associated with an investment in the Trust.\n\nInvesting in digital assets involves significant risks due to their extreme price volatility and the potential for loss, theft, or compromise of private keys. The value of the shares is closely tied to acceptance, industry developments, and governance changes, making them susceptible to market sentiment. Digital assets represent a new and rapidly evolving industry, and the value of the Shares depends on their acceptance. Changes in the governance of a digital asset network may not receive sufficient support from users and miners, which may negatively affect that digital asset network’s ability to grow and respond to challenges Investing in the Trust comes with risks that could impact the Trust's share value, including large-scale sales by major investors, security threats like breaches and hacking, negative sentiment among speculators, and competition from central bank digital currencies and financial initiatives using blockchain technology. A disruption of the internet or a digital asset network would affect the ability to transfer digital assets and, consequently, would impact their value. There can be no assurance that security procedures designed to protect the Trust’s assets will actually work as designed or prove to be successful in safeguarding the Trust’s assets against all possible sources of theft, loss or damage.\n\nThe Trust may incur certain extraordinary, non-recurring expenses that are not assumed by the Sponsor.\n\nThe iShares Ethereum Trust ETF (the “Trust”) is not sponsored, endorsed, issued, sold or promoted by Stiftung Ethereum (the \"Ethereum Foundation\"), nor does the Ethereum Foundation make any representation regarding the advisability of investing in the Trust. BlackRock is not affiliated with the Ethereum Foundation. Ethereum Marks are owned by the Ethereum Foundation, used under license.\n\nShares of the Trust are not deposits or other obligations of or guaranteed by BlackRock, Inc., and its affiliates, and are not insured by the Federal Deposit Insurance Corporation or any other governmental agency. The sponsor of the trust is iShares Delaware Trust Sponsor LLC (the “Sponsor”). BlackRock Investments, LLC (\"BRIL\"), assists in the promotion of the Trust. The Sponsor and BRIL are affiliates of BlackRock, Inc. The bitcoin and ether Custodian is Coinbase Custody Trust Company, LLC, which is not affiliated with BlackRock, Inc. The Sponsor is not responsible for losses incurred due to loss, theft, destruction, or compromise of the trust's bitcoin or ether.\n\n©2024 BlackRock, Inc. or its affiliates. All rights reserved. iSHARES and BLACKROCK are trademarks of BlackRock, Inc., or its affiliates. All other trademarks are the property of their respective owners.\n\n_________________\n\n1 BlackRock will waive a portion of the Sponsor’s Fee for the first 12 months commencing on July 23, 2024, so that the fee will be 0.12% of the net asset value of the Trust for the first $2.5 billion of the Trust’s assets. If the fund exceeds $2.5 billion of the Trust’s assets prior to the end of the 12-month period, the Sponsor’s Fee charged on assets over $2.5 billion will be 0.25%. All investors will incur the same Sponsor’s Fee which is the weighted average of those fee rates. After the 12-month waiver period is over, the Sponsor’s Fee will be 0.25%.\n\n2 Source: The Block, as of May 21, 2024. Ethereum’s market capitalization of $450 billion is measured by its native token, ether."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPSmxyR3pkekt4YkVkRzEzVVdVRkx5NkpBaWN4eTVnQUtWdkNNa21LeUxaMWFhZXJHNERVd1lzeE1IWW9hSG1fYzJuOUp4TWlFWEFqNVpuUWd1SEx2NFFNN056eDdiRGd2R3o0dDVfREgwOGlweWxEQ0VsSS0zdU80bHlwQdIBiAFBVV95cUxQZ3ZrSUZ2TDRHc1BHUFA0SXk1N2xSeXV4eHFxenZtU3NpdF9CSlpoMjdEMGY4YVZNSmhJbjdUSFpxODNCTDdnbHVaUTlxbi1UUU1ENExHNlYtMm85djFaeE9oaEhvRnlfQ3NtLVAwWkcyTXBfeVNyRk0tT0tMN0R6V0kyTXR6Ny1I?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Approved by SEC, Bringing Popular Funds to Second-Largest Cryptocurrency - CoinDesk",
        "content": "\"Being the first to file for an Ethereum ETF back in 2021, we have long believed investors should have access to Ethereum exposure in a vehicle they find accessible and familiar,\" said Kyle DaCruz, head of digital assets at VanEck. \"If Bitcoin is digital gold, then Ethereum is the open-source App Store and the gateway for exposure to the thousands of applications that will utilize blockchain technology.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE15aVFRWllQUDVYVHEtZUZRRU5PMlExSjFNM3FJN1p0ZDl5X3RiVmhnX3o2MVBYTWRDcDNQQndMOEhmUjBjNXc4cjM0MHNrakJfNFpGbzl1UWhMVnNGYlBRNnYwb1ZEZll0M3plS1cxVXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC approves ether ETFs as crypto moves closer to mainstream - Financial Times",
        "content": "Print this page\n\nThe US Securities and Exchange Commission has approved the first spot ethereum exchange traded funds, another landmark for cryptocurrency advocates and investors following the debut of bitcoin ETFs earlier this year.\n\nThe nine ether ETFs, including the conversion of a $9.3bn Grayscale Investments trust and new launches from bitcoin ETF giants BlackRock and Fidelity, gained approval from the SEC on Monday afternoon, and trading began on Tuesday morning. The SEC did not immediately respond to a request for comment.\n\nEther is the native cryptocurrency of the ethereum blockchain and is the second-largest crypto token in the world behind bitcoin with a market capitalisation of about $415bn. The price of ether ticked up about 1 per cent after trading began on Tuesday and is up more than 47 per cent since January 1.\n\nThe approvals, which follow those of ether futures ETFs last year, give crypto a firmer toehold in traditional US finance after January’s launch of the first US spot bitcoin ETFs. The price of bitcoin was up more than 51 per cent year to date on Tuesday morning.\n\n“Traditional asset management can no longer ignore crypto as an asset class,” said Matt Hougan, chief investment officer of crypto fund sponsor Bitwise. “I think you’re going to see effectively everyone embrace this space.”\n\nCboe Global Markets, which lists five of the ether ETFs, said initial trading showed “good market quality”.\n\n“All products opened for trading smoothly, with strong participation from our dedicated market makers who have been actively quoting and providing liquidity from the outset,” Cboe said in a statement.\n\nAs was the case with bitcoin, ethereum ETF issuers are jostling for investor interest with a relatively tight range of fees. Final expenses for all but one of the products would be below 0.25 per cent, with at least five issuers planning to entirely waive fees at first, according to data compiled by Bloomberg Intelligence.\n\nThere is a glaring exception in the pricing war: Grayscale will keep in place the 2.5 per cent management fee for its large converted ethereum ETF while seeding a “mini” version with 10 per cent of the larger ETF’s assets. The smaller sibling is expected to have the lowest post-waiver fee of the initial ether ETFs at 0.15 per cent.\n\nGrayscale in January also kept the fee for its bitcoin ETF management fee at 1.5 per cent — down from 2 per cent initially, but still way above its competitors. That decision has generated $160mn in fee revenue for Grayscale’s bitcoin ETF so far in 2024, the third-highest of any US ETF and good for 2 per cent of all US ETF revenue, according to Bryan Armour, Morningstar’s director of passive strategies research.\n\nThese ether products are not initially expected to bring in as many assets as the bitcoin ETFs into which investors have put more than $17bn in new money over the past six months since their launch.\n\nWhile the ethereum blockchain has a wide range of uses beyond storing value, investors might not be able to wrap their heads around it as opposed to bitcoin’s common reference point as “digital gold”, said Tim Ogilvie, global head of institutional with Kraken, a US cryptocurrency exchange.\n\n“I would be surprised if you saw a similar explosive start for ETH,” Ogilvie said.\n\nHougan has predicted that ether ETFs would attract about $15bn over their first 18 months on the market. He added that flows into the new funds “could be a little squirrelly” in the summer."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQOGtRV0NFVTVYMXcwOWQ2bW1YZ01tb3JlSEc1TlJTWlQ1bEV3UXc0OFlRNk9VM3pFMjNLUWNRX0VGdm1CRGw0bUtORVZKU1FDX1FhZGtrZ2dldHdFUnJ4TFd3TUJHN0RTWHFLZHlZYnA1OWFYY1RYdG5zckVNdTNFRDJ2aDc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Cboe Confirms Spot Ethereum ETFs Will Start Trading on July 23 - Yahoo Finance",
        "content": "Cboe Confirms Spot Ethereum ETFs Will Start Trading on July 23\n\nThe Chicago Board Options Exchange (Cboe) has confirmed that several spot Ethereum exchange-traded funds (ETFs) will commence trading on Tuesday, July 23. Notices posted on Cboe’s website on Friday announced the listing of multiple spot Ethereum ETFs. The ETFs set to begin trading include the 21Shares Core Ethereum ETF (CETH), Fidelity Ethereum Fund (FETH), Franklin Ethereum ETF (EZET), Invesco Galaxy Ethereum ETF (QETH), and VanEck Ethereum ETF (ETHV).\n\nThis move follows the unexpected approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC) in May, a surprising shift from the regulator's previous scrutiny of Ethereum-focused firms. The approval came just four months after the first spot Bitcoin ETFs began trading in the United States. Each listing states, \"We are pleased to announce that One (1) Exchange Traded Product ('ETP') will be listed on Cboe and will begin trading as a new issue on July 23, 2024, pending regulatory effectiveness.\"\n\nEthereum, the world's second-largest cryptocurrency by market cap, has seen significant interest from investors. The approval and upcoming trading of these ETFs are expected to further boost Ethereum's accessibility among traditional investors. According to CoinMarketCap data, ETH is currently trading at $3,529, rebounding from a dip following the sudden news of President Joe Biden exiting the Presidential race. ETH is up 6.21% over the past week.\n\nThe SEC’s initial approvals in May marked a turning point, as the regulator had previously been cautious about Ethereum, seemingly treating it differently from Bitcoin. However, the success of spot Bitcoin ETFs likely influenced the SEC’s decision to extend similar approvals to Ethereum ETFs. The SEC recently dropped its investigation into Ethereum 2.0, paving the way for greater regulatory clarity on the second-largest cryptocurrency."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOM09nOUNCWGpLbXJRWE9adURTQkFzZ2llWEtfWklibk9Ody0xVzNST1RraVFwVzdHdUp3bWxTYk9HU0V4RVp6MU4zM3IyZWQ5SWsyMk8yZEZJazlnWTYxcHpSZXdtcXlRaHBHVDFqQ2FOUXp6QUpNQlQzTkJiXzdLdHRYME1GcFgz0gGOAUFVX3lxTFA2Z3lGQnZPOGFOV0xTTWJMOE5YWXRBSU9YcHVGRXVfbk10WjN3S1U3X2N1ckNGNUVvamRKRDQzTGhYMzVMQkFVcy1GZC13NDltNDYzTldDNzJTYmJCV19ZQkw5V0Y3WEt5QWx4RGVqVXRnWnBwUHhjRWQzcjh0ejl3WnN0VHZ5U25BOFJ1M1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ether ETFs Make Their Bow, With Uncertainty Ahead - PaymentsJournal",
        "content": "Five spot ether exchange-traded funds (ETF) are slated to begin trading on the Chicago Board Options Exchange. They follow the nine bitcoin ETFs that began selling earlier this year as the only two cryptocurrency plays available to investors on the regular stock market.\n\nThe new ETFs include the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF. To jumpstart the introduction, virtually all of the ETH ETF issuers have announced plans to temporarily waive or discount their fees. The discounts run from 50% fee reductions to full waivers and will be in place anywhere from six months to a year.\n\nThe bitcoin ETFs have been highly successful, with more than $17 billion in net inflows since their introduction. The ether ETFs will face an uphill climb in replicating that success, with some industry experts expecting them to garner anywhere between 10% and 20% of the inflows garnered by the bitcoin ETFs.\n\nAs a less widely traded asset, ether is expected to endure more price volatility than bitcoin. As the world’s second-largest cryptocurrency, ether has a market cap of just over $400 billion, while bitcoin’s market cap is well over $1 trillion. Analysts looking at the ether ETFs are expecting significant price fluctuations after the introduction. For instance, data from research firm Deribit shows that the implied volatility of ether options rose from 56% to 70% in the past week.\n\nNot Mined but Staked\n\nOne key difference between the two cryptocurrencies is that bitcoin is mined, while Ethereum has switched to staking. In September 2022, Ethereum replaced its energy-intensive Proof-of-Work (PoW) mining mechanism with a Proof-of-Stake (PoS) mechanism rooted more in financial transactions. Technically speaking, Ethereum is the blockchain platform, while ether is the cryptocurrency derived from that platform.\n\nThis change transformed how new Ethereum is created, making traditional mining obsolete. Staking involves committing ether as collateral to validate transactions on the Ethereum network, which allows you to earn more ether.\n\nOne upshot of the ether ETFs is that they will almost certainly increase demand for the cryptocurrency, potentially leading to a severe supply shortage. The Ethereum Exchange Reserve, which tracks the amount of ether available on cryptocurrency exchanges, is already at multi-year lows."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPbkdiNjY1ZUJ4QzFGSTQxUzJhaTdwc19kM2xsdkkxaWZfanFIS05wU0NQUTJxOXNWaGhZVkF2TzFGVWs2dUFjMmJCejMtUEcwMGdhSG1aVzVTMXg2b1dYelVqV0Zvazlwd1NqdlIzYjlraW5QTEduQ2FFMW4xQXVhNy1MVlY0WEFJNlRiQldROG9kX2tkalpTTng4aWNhX3VYLVp4aW56N25reG5ZRi1xRWRmdTYtNGZBRlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Superstate launches high yield carry fund for Bitcoin and Ethereum using tokens - Fortune",
        "content": "For crypto traders, there has long been an arbitrage opportunity in the spread between the price of Bitcoin in the futures market—which is typically more bullish—and the spot market price. The trouble is that taking advantage of this corner of finance, which is known as the cash-and-carry or basis trade, requires considerable time and attention. That’s why Superstate, a crypto firm that specializes in tokenizing conventional financial services, has created its new Crypto Carry Fund that lets wealthy investors get exposure to spreads in the spot and futures market in the form of an Ethereum ERC-20 token.\n\nSuperstate was founded by Robert Leshner, a former banker who is well regarded in the crypto world for building Compound, one of the first and most successful DeFi platforms. In an interview with Fortune, Leshner said some sophisticated investors have for years earned a yield premium on the arbitrage opportunity in spot and future crypto prices. But by creating a token to carry out the trade, he says, Superstate has made the process more accessible—and also more liquid since traders will be able to swap the tokens—known as USCC—with each other.\n\nSuperstate raised $14 million late last year, and launched its first fund in early 2024, offering tokenized versions of familiar products like Treasury Bills. The new Crypto Carry fund will primarily invest in both Bitcoin and Ethereum arbitrage opportunities but, during times when the spread does not offer a problem, will put investors’ money in T-bills and other safe investments instead. Unlike hedge funds, there is no lock-in and returns will be available on a daily basis.\n\nSuperstate co-founder Jim Hiltner says the new Superstate fund will charge customers a fee of 75 basis points, and added this a better deal for investors than seeking exposure to the crypto carry trade through hedge funds, which charge a so-called two-and-twenty rate. Hiltner also stated that the fund is structured so that it will not be vulnerable to margin calls, and that it will carry a cash buffer in any case.\n\nThe biggest catch for most investors is that the new fund is only open to so-called qualified purchasers who have $5 million in assets, while the lowest buy-in is for $100,000. The Superstate founders say they hope that, in time, the assets will become more broadly accessible but that, for now, the new fund is groundbreaking because it is totally compliant with existing U.S. regulations.\n\nIn the bigger picture, SuperState is at the vanguard of a growing corner of the crypto industry that seeks to tokenize conventional assets. While firms, including banks, have dabbled with the idea of “real world assets” on the blockchain for years, the idea appears to be finally gaming momentum as Wall Street comes to fully embrace crypto. Indeed, giants of traditional finance are making a push, including Goldman Sachs, which says it will launch three tokenization projects by the end of the year.\n\nLeshner notes that SuperState’s first fund has already amassed $100 million in assets, and that some big names from traditional finance will soon join a recently-launched industry council dedicated to tokenizing real world assets.\n\n“We’re getting exactly the traction we wanted,” says Leshner. “More important than AUM is that intermediaries such as prime brokers are getting wired into crypto.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYzBsRlA0T0lMenBtLS1xUXJIcjlVbjFCWXY5N0xrRTRRQXlWRVhhOGMxYm9VLVNsTWJxOE1NQlFDN1VIaGNTNUJLSWlldV9vcVl6M2ltc2FTZkdFZHh2cVoyalRaLXV5eVZObjY4V1VQVFFob3dtNXFCRngxZWh1VXdISXZhVmlJSkE2ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Will Hit $5,000 by 2025 - The Motley Fool",
        "content": "There are two key catalysts that could propel Ethereum to a new all-time high next year.\n\nUp more than 50% through the first half of 2024, Ethereum (ETH -7.12%) now appears to be on track to regain its all-time high of $4,891 from the previous crypto bull market rally. Given Ethereum's current price of $3,400, that would imply a rally of more than 40% within a relatively short period of time.\n\nThat's certainly possible, given how well Ethereum has performed over the first half of the year. But a lot still needs to go right. Here's a closer look at two key factors that could propel Ethereum to the $5,000 mark by 2025.\n\n1. Continued growth of Ethereum's blockchain ecosystem\n\nFirst and most importantly, Ethereum needs to see continued growth in core segments of its sprawling blockchain ecosystem. One of the most important of these segments is known as decentralized finance (DeFi), which refers to traditional financial products and services reinvented with the help of blockchain technology. As such, DeFi offers the potential for faster, cheaper, and better solutions than those currently offered by traditional Wall Street providers.\n\nIn order to come up with a reasonable future price forecast for Ethereum, it is important first to come up with a ballpark figure for how much market value Ethereum can realistically create over the next few years. Cathie Wood of Ark Invest, for example, has crunched the numbers and determined that blockchain networks such as Ethereum could potentially generate $5 trillion in new market value by 2030.\n\nThat may sound like a huge, pie-in-the-sky number, but not when you take into account emerging trends such as asset tokenization, which refers to the process of transforming traditional financial instruments into digital assets that live on the blockchain. The faster that the process of asset tokenization takes place, the more valuable Ethereum becomes. According to consulting firm McKinsey, asset tokenization could be a $2 trillion market opportunity by 2030, and Ethereum stands to be a key beneficiary.\n\n2. Mainstream investor acceptance of Ethereum ETFs\n\nEven if you don't buy into the idea of blockchain-powered financial products transforming the modern financial system, there is one other path to Ethereum soaring to the $5,000 mark: the imminent launch of the new spot Ethereum ETFs, which are scheduled to begin trading this summer. In a bullish scenario, as much as $4.8 billion in new investor money could flow into these new ETFs, helping to boost the price of Ethereum.\n\nTo get a sense of how much of a boost these ETFs may provide, consider the example of the spot Bitcoin (BTC -4.33%) ETFs, which began trading in January. Over the ensuing six months, the price of Bitcoin soared from approximately $45,000 to $70,000, for a gain of nearly 55%. For the sake of argument, let's assume that the new Ethereum ETFs are not as successful as the Bitcoin ETFs, and the gains are not as significant. But even a rally of 40% would still be enough to propel Ethereum to the $5,000 mark by 2025.\n\nIs Ethereum a $2 trillion asset?\n\nIn fact, a price forecast of $5,000 may turn out to be conservative. For example, investment firm VanEck came up with a base-case price forecast of $22,000 for Ethereum for the year 2030. This assumes that Ethereum can continue to make inroads in areas such as DeFi and Web3, and that key blockchain metrics continue to see improvement over the next five years. At a price of $22,000 per coin, Ethereum would have an implied valuation of more than $2 trillion, making it more valuable than all but a handful of companies in the world.\n\nIf you are thinking about investing in Ethereum, keep in mind that crypto can be incredibly volatile and unpredictable. There's always the chance that Ethereum will no longer continue to see rapid gains after a remarkable first decade of growth. Tech issues could prevent it from scaling past a certain point, and the arrival of new competitors could blindside it.\n\nThat being said, if you think that we're on the cusp of a major bull market rally, Ethereum should definitely be on your radar as a cryptocurrency capable of soaring in value over the next several years."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQYk1yazZLcjB5dXlSSkt5Qk1ETzdHclVaQXpGLWE3YmlQb2plQ3F1ZjItSVphT0FjNXdWYllBa2ZvOUY5akVEWmRNLUFCY0NWUG5XZ1J5QTJlcmlreWVTdDIyNXgzRzlGODgzRVh2REhfS00yNjd6NERlZ0ltNnpKZlBfNVpvMF9EYkNiN1BmU3FhaEs1ZmUzZWNZSnV4bjNidVZua1I1bjExZngwR0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Expected to See a Fraction of Inflows Compared to Bitcoin Funds - Wealth Management",
        "content": "With the SEC’s final authorization of spot Ethereum ETFs now official, trading of the ETFs is set to begin Tuesday morning. There is a buzz about the potential appeal of these new products. However, initial demand from RIAs is expected to be muted.\n\n“We think if the Ethereum product gets somewhere in the range of 20% of where the Bitcoin products are, that would be a good outcome,” said Aniket Ullal, vice president of ETF data and analytics with research firm CFRA.\n\nRelated: Wealth Management EDGE: Bitcoin ETFs Are Winning Over Skeptics to Crypto\n\nEthereum is a cryptocurrency with a current market cap of approximately $416 billion, second only to Bitcoin, with a market cap of $1.32 trillion. The SEC provisionally approved eight spot Ethereum ETFs in May. The SEC asked the issuers to amend their S-1 filings before giving the final greenlight this afternoon.\n\nOn Friday, the Chicago Board Options Exchange (CBOE) posted notices that several Ethereum ETFs will begin trading on Tuesday, pending final SEC approval, which has now been received. The five funds listed by CBOE include Fidelity Ethereum Fund (FETH), VanEck Ethereum ETF (ETHV), Franklin Ethereum ETF (EZET), Invesco Galaxy Ethereum ETF (QETH) and 21Shares Core Ethereum ETF (CETH). The fees on these will range from 0.20% to 0.25%, with most of the issuers planning to waive the fees from six months to a year, depending on the investment amount.\n\nRelated: Several RIAs Take Big Stakes in Bitcoin ETFs\n\nIn addition, Grayscale Ethereum Trust, a futures-based Ethereum ETF (ETHE), would be converted to a spot product with a fee of 2.5%. (Grayscale has separately filed for the Grayscale Ethereum Mini Trust (ETH), with a 0.15% expense ratio.) NYSE Arca, meanwhile, has approved both ETHE and the Bitwise Ethereum ETF (ETHW), with trading also beginning tomorrow. Meanwhile, the iShares Ethereum Trust ETF (ETHA) has been approved by NASDAQ.\n\nWhile market observers expect to see some demand for spot Ethereum ETFs from RIAs, it will likely trail the industry’s appetite to date for spot Bitcoin ETFs. According to Ullal, there are at least two reasons for this. The first is that Bitcoin products tend to be a more popular choice among investors. Ullal noted that Bitcoin currently represents approximately 53% of the total crypto market, while Ethereum represents only 18%.\n\nIn addition, the adoption of spot Bitcoin ETFs has tended heavily toward individual investors and very small RIAs. CFRA has no way to gauge the exact breakdown of spot Bitcoin ETF investment between RIAs and individuals acting on their own, but a May analysis of 13F forms filed by asset managers with at least $100 million in AUM revealed they own roughly 15% to 20% of total Bitcoin ETFs shares outstanding. “We do know that it’s very much a retail demand, just based on our conversations with investors and looking into 13Fs,” said Ullal.\n\nSimilarly, Ric Edelman, founder of the Digital Assets Council of Financial Professionals, forecasts that in the first year after their launch, spot Ethereum ETFs will likely amass a third of the assets that spot Bitcoin ETFs currently have. He noted that it would take time for RIAs to get comfortable with the product and for spot Ethereum ETFs to become available on wealth management platforms.\n\n“There will be less demand initially,” Edelman said. “Over the next year, we are expecting tens of billions of dollars to flow into these ETFs, but it won’t be immediate. I expect Ethereum ETFs to have a third of the assets that the Bitcoin ETFs have and that reflects the current market cap. As advisors gain more knowledge about the differences between Bitcoin and Ethereum, the enthusiasm for Ethereum will grow.”\n\nChris King, CEO of Eaglebrook Advisors, a crypto investment platform for RIAs that offers Ethereum and Bitcoin SMAs, agreed with that assessment. He said the majority of RIAs can’t recommend spot Bitcoin ETFs right now, as there are still wealth management platforms that haven’t approved them. As a result, the initial buy-in into Ethereum ETFs will likely come from self-directed retail investors and institutions.\n\n“I think the majority of the initial flows, similar to Bitcoin ETFs, are not going to come from the wealth management channel or the advisor channel,” King said. “In the short to medium term, it’s not that demand is going to be low; it’s that there is still going to be a little bit of friction to access.”\n\nHowever, King said within about eight to 12 months, the majority of flows into spot Bitcoin and spot Ethereum ETFs might start coming from the wealth channel. During that time, interest rates might fall, more wealth management platforms are likely to approve these ETFs, and upward price momentum is expected if current trends hold.\n\n“I think there is going to be an increasing demand for risk assets, and crypto has typically been the fastest horse in the risk asset race, just like it was in 2020 and 2021,\" King said.\n\nRandy M. Long, a registered financial advisor with Long Family Office, based in Reedley, Calif., noted that his firm already has a positive outlook on spot Ethereum ETFs.\n\n“We very much support these,” he wrote in an email. “We have invested our portfolios in GBTC and ETHE for a few years now, pretty much before any other firms of which I was aware.”\n\nAccording to the independent research and consultancy firm ETFGI, at the end of June, global listed crypto ETFs and ETPs reported year-to-date inflows of $45.6 billion, the highest level on record and up from roughly $566.6 million during the same period the year before. The jump in inflows reflected the SEC’s approval of spot Bitcoin ETFs. At mid-year, there were 68 Bitcoin ETFs/ETPs globally, with total assets of $65.97 billion and net new assets of $45.0 million year-to-date. There were 41 Ethereum ETFs/ETPs, with net new assets of $4.1 billion and net new assets of $116 million."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNblJXbXk3RTl6NzlRY3hJY1hOY1luRHMycVBDbWdRQ2d0WXhUX0ZSTy1sZU5md0pGLVFIa00yalR3bHV3bmxSNXVRaEVKcnlBREtFVWl2bzItNUFTWXNrUlF5cE03VWMxZWxlemktWmVhNXowbkpkUjZaRDJ5aXY4TmJjZlAyNEd0a2pZYlpwc0pRWmtQMGdEZV9DaUxGMWx2dk1pM0VXY0t6SFdIWFMyNXhLYlhqaDc0bjVyMlp2U0RhM0VCOWJPajNzVjF4Y0dpaXR3OU5hbV9MOEY4dEdmV1VNaDM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Why Are Ethereum Classic And Ethereum Name Service Shooting Up On Spot ETH Approval Day? - Benzinga",
        "content": "The first-ever Ethereum ETH/USD spot ETFs have been greenlighted by the SEC and are set to begin trading tomorrow morning. Interestingly, two relatively lesser-known Ethereum-branded coins seem to have outperformed the marquee asset in 24-hour gains.\n\nWhat Happened: Ethereum Name Service popped more than 5%, emerging as the best-performing cryptocurrency in the last 24 hours. The coin's trading volume jumped 66% to $191 million, signaling significant buying activity.\n\nSimilarly, Ethereum Classic popped 3% to hit a monthly high. ETC's trading volume nearly exploded 184% to $452 million in the last 24 hours.\n\nCryptocurrency Gains +/- Price (Recorded at 10:44 p.m. EDT) Ethereum Name Service ENS/USD +5.63% $28.08 Ethereum Classic ETC/USD +3.06% $24.78\n\nThese increases come despite a drop in Ethereum, which has lost 1.47% in the last 24 hours.\n\nEthereum Classic was created as a hard fork of the original Ethereum chain back in 2016 over disagreements within the community following a hack. The new chain inherited the name Ethereum as we know it, while the original one functions as Ethereum Classic.\n\nAdditionally, ENS is a token associated with Ethereum Name Service, a decentralized naming system that converts complex, machine-readable names to ones easily understandable by humans.\n\nSee Also: Dogecoin Up 15% In 7 Days And One Indicator Shows It May Be ‘Primed For An Aggressive Up Move’\n\nWhy It Matters: ENS and ETC are fundamentally different from Ethereum, but many retail investors see them as cheaper alternatives.\n\nIt is worth noting that both ENS and ETC have much lower unit prices than ETH. So, while ETH gains popularity among institutions, individual investors may be tempted to shift their focus to lower-cap ‘Ethereum’ coins\n\nPrice Action: At the time of writing, Bitcoin was exchanging hands at $67,503 trading mostly flat in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNWWFYVUdLMVZOa3BDZEhnVXB2dlJTeW43RFdiX2xIdW8zM1JQWDl6bGRnSVhNMmd3aEl6amxEazdHT0UtcUJYdFVEeW0tSUt2QTk5Ni1fdkpqcHRrcDREdGJleHlqRlZHOEdZTERXdkl1YzJTM21BTmVjZ09IaExvWjdTYi1ET1lya3Z4UUYteGREOVQxbllwSVpha2FNTXV1UmYxeUxVdHR6VldEekRwRnkwWklpTF9GVmhXUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Get Final Go-Ahead From The SEC: What Happens Next? - Markets Insider",
        "content": "In a landmark development, the SEC has approved the commencement of trading for spot Ethereum (CRYPTO: ETF) exchange-traded funds Monday, exposing mainstream investors to the price moves of the world’s second-largest cryptocurrency.\n\nWhat Happened: Bloomberg senior ETF analyst Eric Balchunas confirmed the news, as the 424(b) forms are now available on the SEC site, meaning the regulator has cleared them for trading from tomorrow.\n\nThe SEC has given its approval to registration forms from 21Shares, Bitwise, BlackRock, Fidelity, Franklin Templeton, VanEck and Invesco Galaxy. The only funds that don’t have effective documents from the SEC are Grayscale’s Trust and Mini Trust, which analysts expected to come tomorrow morning before trading commences.\n\nIt's official: Spot Eth ETFs have been made effective by the SEC. The 424(b) forms are rolling in now, the last step = all systems go for tomorrow's 930am launch. Game on. pic.twitter.com/9MaBDBA8co — Eric Balchunas (@EricBalchunas) July 22, 2024\n\nCoinbase Global Inc. (NASDAQ:COIN), which happens to be the custodian for 8 of the 9 newly approved ETFs,also announced the clearance, describing it as an important milestone for cryptocurrencies.\n\nETH ETFs have arrived.\n\n\n\nToday, the SEC approved 9 spot ETH ETF applications. Their much celebrated arrival marks another important milestone for crypto in expanding access to and diversifying our cryptoeconomy.\n\n\n\nHere's why 🧵 pic.twitter.com/o6KfgGlUDn — Coinbase 🛡️ (@coinbase) July 22, 2024\n\nThe websites of the new investment products, including Blackrock’s ishares Ethereum Trust, also went live, unlocking a new era of trading for cryptocurrency-based funds.\n\nSee Also: Elon Musk Jokes He’s An ‘Alien Scientist With A Japanese Pseudonym,’ But Dogecoin Designer Clarifies Tesla CEO Is ‘Not Satoshi Nakamoto’\n\nWhy It Matters: Despite an initial lack of engagement between the SEC and issuers, the approvals were granted unexpectedly. Firms had received approval of 19b-4 forms in May but needed their registration statements to go effective before launching.\n\nPrior to the anticipated launch of spot Ethereum ETFs in the U.S., Citi projected up to $5.4 billion in inflows within the first six months. The bank cautioned that actual inflows and returns could be lower than projected.\n\nAnalysts led by Alex Saunders noted that Ethereum offers long-term diversification benefits due to its varied use-cases. However, these benefits are not currently reflected in the market.\n\nFurthermore, Michaël van de Poppe, a widely-followed cryptocurrency analyst, anticipated a surge in activity and value of tokens in the Ethereum ecosystem after the approval.\n\nPrice Action: At the time of writing, Ethereum was exchanging hands at $3,470.06, down 1.42% in the last 24 hours, according to data from Benzinga Pro. Shares of Coinbase closed 2.86% higher at $265.15 during Monday’s regular trading session.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next:"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE56SFhqS2dRaV80SXE1Sjhwem1hVW1EcTE3UTdoSFNnbmpaV2NsemlsaXhBcW5QdUZ6VTk3UEFhVzhvTnNYUjFKMGRaZXg1Q2s5M2JfaEMyVmNyRnNQNklIQ3VqckVlOW1WMlVONU1keHJtcW9KNXVxVTd4YWI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "US Spot Ethereum ETFs Due to Start Trading - Markets Media",
        "content": "Daily Email Feature US Spot Ethereum ETFs Due to Start Trading\n\nThe US Securities and Exchange Commission has approved the start of trading of spot ethereum exchange-traded funds just six months after spot bitcoin EFTs launched in January this year.\n\nTom Duff Gordon, VP international policy at Coinbase, said in an email that the approval marks a significant milestone in the crypto ecosystem, emphasising the ongoing shift towards the global transition to digital assets. He added: “This development highlights that crypto is not merely a trend; it illustrates the transformative digital shift in the financial system. We’re proud to be the custodian for eight of the nine newly approved ETH ETFs, entrusted by many leading financial institutions as a reliable,safe, and secure partner.”\n\nHistory often happen gradually, then suddenly. Crypto is no exception. The approval of spot ETH ETFs today is yet another one of those moments. And it validates what we’ve been saying for years: ETH is not a security. https://t.co/1OGfaNr6ro — paulgrewal.eth (@iampaulgrewal) July 22, 2024\n\nThe SEC approved the launch of bitcoin EFTs in January this year when 10 new ETFs began trading and digital asset manager Grayscale Investments also converted its the Grayscale Bitcoin Trust into an ETF. In May this year the SEC also approved spot ethereum ETFs with market participants expecting trading to begin on 23 July 2024. Ether’s $420bn market cap was second only to bitcoin’s $1.3 trillion market cap as of 19 July 2024, according to data provider Morningstar.\n\nIssuers of ethereum ETFs have already listed bitcoin ETFs – Fidelity, iShares, Bitwise, VanEck, 21Shares, Invesco Galaxy, Franklin Templeton, and Grayscale added Morningstar. The data provider said in a report that WisdomTree and Valkyrie are the two spot bitcoin issuers missing from the spot ethereum list, while 21Shares is issuing its ethereum ETF alone, after joining forces with Ark Invest on its bitcoin ETF. Grayscale Investments will convert its Grayscale Ethereum Trust into an ETF, as it did with its bitcoin trust.\n\nRegardless of your feelings about ether or crypto, this kind of first class TradFi treatment (translating benefits into Boomer-ese and and delivering it in the most preferred inv vehicle on Planet (the ETF) is a major deal. These issuers have over $15T in collective aum. pic.twitter.com/uXR1AL1BxX — Eric Balchunas (@EricBalchunas) July 22, 2024\n\n1/ Hello, X! This is Jenny Johnson, CEO of Franklin Templeton, taking over the account. Our lawyers help keep me measured in my comments, but to say the least, I am THRILLED about $EZET, our second crypto ETF to launch in the market. 🧵 pic.twitter.com/SFyfyDj5Xj — Franklin Templeton (@FTI_US) July 23, 2024\n\n“If spot bitcoin ETFs are an indicator, expect iShares and Fidelity to quickly take over Grayscale as the top ethereum ETFs by assets and volume,” added Morningstar.\n\nBlackRock said in statement that the registration statement for BlackRock’s iShares Ethereum Trust ETF (ETHA), has been declared effective by the SEC and is expected to begin trading on Nasdaq on 23 July 2024. The ETF carries a 0.25% sponsor fee with a one-year waiver reducing the fee to 0.12% on the first $2.5bn assets under management. The asset manager described ethereum, a global technology platform, as similar to an app store that generates value for ether as usage increases and more applications are built on top of it.\n\nJay Jacobs, U.S. head of thematic and active ETFs at BlackRock, said in a statement: “Our clients are increasingly interested in gaining exposure to digital assets through exchange-traded products which provide convenient access, liquidity and transparency. Ethereum’s appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries.”\n\nAnnouncement: Today, the Bitwise Ethereum ETF (ETHW) became the first U.S. ETP to publish its Ethereum addresses and set ENS subnames for each address. 1.ethw.bitwise.eth -> 0xa15c…2A69\n\n2.ethw.bitwise.eth -> 0xEd92…b4eF\n\n3.ethw.bitwise.eth -> 0x3339…7cB5\n\n4.ethw.bitwise.eth… pic.twitter.com/SdOGiXkyqP — Bitwise (@BitwiseInvest) July 23, 2024\n\nMany of the largest tradfi asset managers in the world are launching crypto ETPs. It's one of the best things that has happened to the space. They bring a huge endorsement to the validity of this asset class to mainstream investors who were unsure, and they have incredible… https://t.co/vO61qd63mF — Hunter Horsley (@HHorsley) July 22, 2024\n\nOn the eve of the launch of the first spot Ethereum ETFs, a look at the current state of play in #bitcoin ETFs. Most striking (but least surprising) to me is just how much these have traded. Since they listed, this group's turnover (total value traded/avg. daily assets) has… pic.twitter.com/hQ8KKzIBZO — Ben Johnson, CFA (@MstarBenJohnson) July 22, 2024\n\n💥BREAKING💥 BlackRock’s #Bitcoin ETF has surpassed the Nasdaq ETF $QQQ in flows this year Most successful ETF launch ever! pic.twitter.com/C4zY9Ps5cB — Quinten | 048.eth (@QuintenFrancois) July 22, 2024\n\nMorningstar added that SEC only approved ether ETF filings after staking was disallowed, and the average annual reward for ether staking is roughly 2%-4%. As a result, unlike bitcoin, holding ether directly could hold a meaningful performance edge over spot ether ETFs for investors willing to engage in staking.\n\nCrypto ETFs and ETPs listed globally gathered net inflows of $44.5bn through to the end of May this year according to ETFGI, the independent research and consultancy firm. ETFGI said in a report that this is a contrast to the $135.6m of net outflows at the same time last year.\n\nSubstantial inflows can be attributed to the top 20 ETFs/ETPs by net new assets, which collectively gathered $3.1bn during May according to ETFGI. BlackRock’s iShares Bitcoin Trust (IBIT US) had the largest individual net inflow of $1.2bn in May.\n\nBlockworks Research said in a report that the majority of the eight issuers filing for the ether ETF have set fees between 0.19% and 0.25%, with the exception of Grayscale. The Grayscale Ethereum Trust ETF will maintain a fee of 2.5%, and the mini trust will offer a 0% fee for the first six months of trading, up to $2bn in assets under management. Then the mini trust will then charge 0.15%, undercutting all the competitors’ currently advertised rates.\n\n“Interestingly, the mini trust will be seeded with 10% of trust’s current AUM, and investors will receive a proportional distribution of the mini product at creation,” added Blockworks. “Grayscale is likely moving some of its client’s capital into this lower fee product in an attempt to dampen the exodus of funds that was observed with bitcoin trust’s conversion to an ETF. As trading begins, we’ll get our first glimpse into how well this strategy may work for them.”\n\nLaw firm Foley & Lardner said in a blog that the ether ETF approval is a significant milestone for increased institutional and retail investments in crypto ETFs.\n\n“The approval of these applications occurred without much resistance, which is a notable departure from the contentious process that preceded the approval of bitcoin ETFs,” added the law firm.\n\nThe SEC was forced to approve bitcoin ETFs after losing a lawsuit against Grayscale Investments, which had challenged their previous rejections. However, the SEC approved ethereum ETFs without a lawsuit.\n\n“While this maneuver might have been to avoid more litigation and public scrutiny, the approval shows a steady departure from “regulation by enforcement” and a movement toward actions that promote growth in the cryptocurrency industry and investor freedom,” added the law firm.\n\nFoley & Lardner highlighted that the SEC noted the high correlation between spot ether prices and the CME’s futures market. Morningstar also added that the SEC is unlikely to approve another spot cryptocurrency ETF without them first having a regulated market, which has so far been the CME futures market.\n\n“The CME doesn’t currently list any other cryptocurrency futures,” said Morningstar. “It stands to reason that ETF approval is distant for cryptocurrencies other than bitcoin and ethereum.”\n\nInstitutional interest\n\nFoley & Lardner said: “In the coming years, it is very possible we will view the SEC’s decision to approve ether ETFs as an important step in what became a trend of integrating cryptocurrency assets into traditional finance networks through ETFs and other financial instruments.”\n\nCrypto ECN Finery Markets said in its second quarter over-the-counter (OTC) review that the recent approval of crypto-related vehicles has sparked institutional interest in adopting crypto for the long term, demonstrated by the increase in crypto OTC flows. In the first half of this year, the OTC institutional crypto market’s total spot transaction volume rose 95% from the first six months of last year.\n\n“The approval of ETH ETFs may further drive institutional participation in the market,” added Finery Markets “However, we believe that the full impact of ETF approvals on the market may not be fully realized until six to nine months later, as it typically takes this amount of time for innovative products to be fully integrated into financial players’ product portfolios and widely adopted.”\n\nFinery Markets noted that the recent launch of a bitcoin ETF in Australia, and similar launches in the US and Hong Kong, reflect global interest in crypto investment vehicles. In addition, issuer VanEck’s recent application for a Solana ETF highlights this growing trend.\n\nWe at @vaneck_us are pleased to announce that @CBOE just filed our 19b-4 to list and trade shares of the FIRST Solana exchange-traded fund in the US! We look forward to engaging with the SEC during the review period. — matthew sigel, recovering CFA (@matthew_sigel) July 8, 2024\n\n“These developments signify a changing regulatory environment that is becoming more favorable towards digital assets,” added Finery. “This shift is important as it provides traditional financial institutions with a clear path to enter the crypto space using established financial instruments, taking advantage of current market conditions.”\n\nFuture trends\n\nNate Geraci, president of The ETF Store, said:\n\nPrediction… An ETF issuer will file for combined spot btc, eth, & sol ETF in next few months. We’re quickly heading down path towards index-based & actively managed crypto ETFs. — Nate Geraci (@NateGeraci) July 22, 2024\n\nBrett Harrison, founder and chief executive of Architect Financial Technologies, said:\n\nNow that spot ETH ETFs are set to begin trading next week, a question remains — what is holding the SEC back from approving spot BTC ETF options? Options on BTC future ETFs were available within days of their underlying ETFs’ listings, but to list options on spot commodity ETFs… — Brett Harrison (@BrettHarrison88) July 17, 2024\n\nIn May this year the New York Stock Exchange said in a statement it is collaborating with CoinDesk Indices to launch cash-settled index options tracking the CoinDesk Bitcoin Price Index, which has been operating since 2014.\n\nThe XBX index benchmarks $20bn in ETF assets under management, and tracks the spot price of bitcoin, denominated in U.S. dollars, in real time across multiple crypto exchanges. It is calculated and published once per second, 24 hours per day, 365 days each year.\n\nAndy Baehr, head of product, CoinDesk Indices, said in a statement at the time: “Collaborating with the NYSE to launch XBX index options opens a new chapter in digital assets, placing important and familiar risk-management tools in the hands of U.S. and global investors.”\n\nIn July this year Eurex said it is expanding its crypto derivatives portfolio with the launch of FTSE Ethereum index futures and options as of 12 August 2024. The derivatives arm of Deutsche Börse Group launched FTSE Bitcoin Index futures and options in 2023 and more than 100,000 contracts, equivalent to over $3.5bn in notional, have been traded.\n\nFTSE Russell developed the index with Digital Asset Research. The index captures data from vetted assets and exchanges to meet EU Benchmarks. The final settlement rate of the Eurex contracts is determined as the volume time-weighted average of the FTSE DAR Digital Asset Price over a 15 minute period prior to the fixing time."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPVFdXQXpvSm40QUFlSTdjRGFka1VnS2NLQUJEcVJ5aUVDRldsUXN4R3hEVi1HSDNkMkcxVm1yVzBjdEI3ZHpNaWs3VC1ud3ZiWVFDU01IRGZET2MyQVRvR29vNV9UWDMtNG53RDBVRXhXazh4UUx2d19kWjRWZTU0SUNQONIBiAFBVV95cUxNU3VwVGF6dE80Sl9oYVBaU2lLU2pqM1lxSUQwbkVSbDZ6bENJV3ZrZldDXzZuYkdKSWExUjRIVmRXbzdyd3Vrb2lvcHRPR1ZpdXRaY1JhWGQyYnItTmhGcGE5N3JSamNxejNneVljdkUzUlZlVkRUd3djUk9JQW1XSmR1RU5HVEhF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Turns 10: A Decade of Blockchain Revolution - CryptoPotato",
        "content": "Over the past ten years, Ethereum has transformed the blockchain landscape.\n\nFrom its initial coin offering to becoming the second-largest crypto by market cap, Ethereum has continuously evolved, implementing major upgrades like the shift to Proof-of-Stake (PoS) and Layer 2 scaling solutions and cementing its position as a cornerstone of the Web3 ecosystem despite the emergence of several alternatives over the years.\n\nEthereum’s 10-Year Journey\n\nReflecting on its origins, Ethereum Foundation researcher Justin Drake pointed out that Ethereum’s initial coin offering (ICO) began on July 22, 2014, with the price being 2,000 ETH per sale unit per BTC in a fully permissionless environment devoid of venture capital influence or vesting periods.\n\nThis rate only applied for the first 14 days. After that, the price began to decrease gradually, with each subsequent day offering fewer ETH per unit. By the end of the sale period on September 2, 2014, the rate had dropped to 1337.077 ETH per unit.\n\nFast forward to today, and the value dynamic has shifted dramatically. Now, 1 BTC buys less than 20 ETH. Drake pointed out that few assets have matched Bitcoin’s performance over the past decade, and even fewer have surpassed it by a factor of 100.\n\nEthereum has evolved into a crucial component of the blockchain ecosystem. So far, 4.3 million ETH has been burned for gas fees since the introduction of EIP-1559, and many more are expected to be burned with the introduction of blob transactions.\n\nAdditionally, Ethereum’s staking mechanism now provides $100 billion in economic security, ten times more than Bitcoin, and supports DeFi and restaking, vastly improving the Internet of Value’s economic bandwidth.\n\nEthereum’s Institutional Journey Begins\n\nAll eyes are on the spot Ether ETF, which, according to Drake, further signified Ethereum’s growing recognition as a digital commodity, marking the beginning of the crypto asset’s institutional journey.\n\nThe Chicago Board Options Exchange (CBOE) will debut five spot Ethereum exchange-traded funds (ETFs) on July 23, pending final regulatory approval, as announced by the agency last week. This follows the US Securities and Exchange Commission’s (SEC) approval on May 23, which greenlighted the listing of several spot Ether ETFs.\n\nThe five Ethereum ETFs scheduled for launch are the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF.\n\nTo attract investors and secure a market position, most of the ETH ETF issuers are planning to offer temporary fee reductions or waivers as the funds start trading."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPY1VyQUhUVGZ5LXpJQ1R3cUdONnZmRDhaVnVYOTlnc3BrZC1Sd1V4NTJrOGU2WVBUb1MtQzNuZEF1TF90TjZfUzdSRXEzOTZEbEJHRENaZUEzM01CRHI2REcxVF9DUUlITGZkdzlhMUI3X0ZJUzFwV3AxTjhWZTdIUXBobjdKaFh2UEVPcVN5ekMxbTdpN3BDMFI4R2ZqUDJzcnAwa1JYQ1o3UdIBsgFBVV95cUxOSE9uQTBweHRFZU9zMXRSQTN3cDFHUXVYQUpDcnA2Q2RTZXdCTzhsTmFzRkdtZmNzQ3lCbjFLNVFUYTlPWkV2RHRhbkxrX2pTRnFFMXB0aWRrR2tMZ3hKNFhHMW5wRGNoOE5uZTg4RWpMeVBWQ19heFZpcnFhUWdQNTRhczN0T1NfMnU2UHNjX0FDd01NNmpTNTFYUlI4Zm1yYV9XQy1kV0NiVXF3OUpMMlJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Shifts $1 Billion in Ethereum to Coinbase Ahead of US ETF Trading Debut - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto asset manager Grayscale has transferred a hefty sum of Ethereum to Coinbase Prime as exchange-traded funds (ETFs) associated with the asset gear up for a trading debut in the U.S. this week.\n\nGrayscale's transaction of $1.01 billion to Coinbase Prime on Wednesday prompted market participants to suggest Grayscale might be preparing for a sell-off to reinvest in another crypto, such as Solana.\n\nJon Campagna, managing partner at crypto hedge fund Nexyst Digital and formerly associated with Coinfund and Blackrock, dismissed these claims in a Tuesday post on X, saying Grayscale is unlikely to reallocate its Ethereum holdings.\n\nIt comes as Grayscale tipped 10% of its Grayscale Ethereum Trust (ETHE) holdings into its separate Ethereum ETF (ETH) on July 18, Campagna explained.\n\nAD\n\nAD\n\nThe new fund is expected to become active on Wednesday, with ETHE holders receiving their proportional ETF positions.\n\nTo facilitate the move, the asset manager transferred $1 billion, or 10% of their $10 billion AUM in ETHE, to Coinbase Prime, as announced a week earlier by Grayscale, Campagna wrote.\n\n\"What will be interesting is to see the outflows from ETHE as they refuse to lower their ... fee,\" Campagna said. \"My guess is those outflows get recycled into inflows into the lower-cost ETFs, like Grayscale's own 15 basis point fee ETH ticker. Brilliant move by them as they quasi-guarantee more assets stay in-house this way.\"\n\n\"Grayscale is not lowering at all,\" Eric Balchunas, an ETF analyst at Bloomberg, wrote in a post to X on July 18. \"This means they are ten times higher than competition.\" Grayscale is expected to maintain a 2.5% fee on ETHE.\n\nAD\n\nAD\n\nWhile algorithmic trading firm Wintermute has indicated that the demand for Ethereum ETFs might be lower than expected, analysts remain optimistic about their debut on Wednesday.\n\nMatt Hougan, chief investment officer at Bitwise Asset Management, has said Ethereum could reach as high as $5,000, Decrypt previously reported.\n\nEthereum has already begun to move higher, surpassing $3,500 on July 17 after a significant drop earlier in the month.\n\nGrayscale is among several major investment firms, including BlackRock, Fidelity, and Franklin Templeton, preparing to launch Ether ETFs.\n\nDemand for the funds is projected to be between $3.2 billion and $4 billion.\n\nEdited by Sebastian Sinclair"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNcEJCZWJ5bjJyQWwxSlM5djhYQW9Gdm1wWHRyNzZETHhRd1hnTzRkbnlodGxtZHZtMDNUcjNMcmV2dWtMcmN3NHFsT3IyQkdvQXpHeGk0azZvRTlMS2kwZ2JhemNwLUhhYmlqcm43OTBKS1hvY2w4UFVKdkdIWXR2TVl3LWZralVZbWlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst - Yahoo Finance",
        "content": "Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst\n\nBitcoin and Ethereum consolidated, while Dogecoin rose as President Joe Biden announced his withdrawal from the 2024 presidential race.\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded 9:15 p.m. EDT) Bitcoin (CRYPTO: BTC) +1.52% $68,136.71 Ethereum (CRYPTO: ETH)\n\n+0.83% $3,540.81 Dogecoin (CRYPTO: DOGE) +5.50% $0.1397\n\nWhat Happened: The world's largest cryptocurrency, Bitcoin, traded flat until the news of Biden dropping out of the contest broke, injecting positive volatility in the market. King Crypto recorded a weekly close above $68,000 and is up more than 10% over the week.\n\nEthereum moved in the $3,500 zone, anticipating bullish impetus as it awaits the final approval of exchange-traded funds tracking its spot price. The investment products are likely to go live this week.\n\nIn the last 24 hours, 56,837 traders were liquidated, with the total liquidations at $165.54 million, More than $100 million in bullish bets were liquidated.\n\nDon’t Miss:\n\nBitcoin's Open Interest rose 1.08% to $37.21 billion in the last 24 hours, complementing the price increase. This is typically indicative of a bullish sentiment.\n\nThe Cryptocurrency Fear & Greed Index flashed \"Greed\" at the time of writing, signaling significant buying sentiment in the market.\n\nTop Gainers (24-Hours)\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded at 9:15 p.m. EDT) Celestia (TIA) +16.30% $7.55 Core (CORE) +15.12% $1.65 Avalanche (AVAX) +12.27% $32.54\n\nThe global cryptocurrency market stands at $2.48 trillion, up 1.65% in the last 24 hours.\n\nStock futures edged higher Sunday night. The Dow Jones Industrial Average Futures gained 0.12%, as of 9:15 p.m. EDT. Futures linked to the S&P 500 added 0.22%, while Nasdaq 100 Futures rose 0.36%.\n\nTraders monitored political developments in the wake of Biden dropping out of the 2024 presidential race. It will be interesting to see how the market opens this week in response to this significant development.\n\nLast week, major indices like the S&P 500 and the Nasdaq Composite registered their biggest weekly losses since April.\n\nSee Also: Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield.\n\nAnalyst Notes: Popular cryptocurrency trader CrypNuevo anticipated significant volatility in the Bitcoin market after Joe Biden's announcement.\n\nStory continues\n\n\"Expecting a volatile price action instead; therefore, I think it’s likely to see a move down first. Then we can go up to liquidity at $68,900,\" the trader predicted.\n\n\n\n\n\n$BTC Sunday update:\n\n\n\nIt was going to be a quiet week ahead, but Biden just announced that he is not running for re-election.\n\n\n\nExpecting a volatile price action instead; therefore, I think it's likely to see a move down first. Then we can go up to the liquidity at $68.9k.\n\n\n\n🧵👇 pic.twitter.com/3XfaZITYWL — CrypNuevo 🔨 (@CrypNuevo) July 21, 2024\n\nWidely-followed analyst Rekt Capital stated that a weekly close above $65,000 could bolster Bitcoin's chances of reclaiming $71,500 in the following week.\n\nWith the apex cryptocurrency closing near $68,000, it’ll be intriguing to see if the predictions come true.\n\n\n\n\n\n#BTC\n\n\n\nEvery time Bitcoin Weekly Closed above ~$65000 (blue) in an uptrend...\n\n\n\nBitcoin would revisit ~$71500 in the following week\n\n\n\nCould history repeat itself?\n\n\n\nWe know it often does\n\n\n\nWhat about this time?$BTC #Crypto #Bitcoin pic.twitter.com/KosyX2ezIh — Rekt Capital (@rektcapital) July 21, 2024\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORlRBZi0tSHI5YTlBYXd5bUpGZ0FzN21iRFFxSUJxWVc4NnBFMVI1MnVCSFFTbGpFVXNDRTZxc3hfQU9iWk14c3BFMDNJMlU5a0NHMWJVOFZCbE1QTzdieFJrblBGdVpmX1hHVVdmdG5zMFlsbVRpdHB4U2dzNzJ6N0Z3bnpxdVNKLUhLQXdnQjhtZEY1SkNkam1lWnphSnB2T0ZMc0VLTDhHWTNTTE9vdko2eXJWNWNBR0djcFdxR21nN1RlUExsVkI0UkhuaEM0aElCM1ZDemTSAd4BQVVfeXFMTXVsRWVVa0EyTjBtcEd1R0M4YWlzSjg2b1hJQk8zd3BuTlFCVGFzSVdYcUlRejNfdzNIQ2E2MGFTSmxkVmlCQmxBQmVyZFRyVG1EdGpxNHgxNjJhZXRUdFE0TUp5V2Z0NWYtVGoydnBOWXJlZzhLbGs2V1JWTUkzV2wzMzdKR1BjTkFTQ3dXUnA1aUMtTmkxc09oY29uenBQYm5uT285ellkbWpHWjVMNlVaU0o5TzNIaDFObTBQOHdPMF9ISEJqc3dXU0R4WGRka1BaNjc0SVFQMWIyTkN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Overtakes Solana With Most Altcoin Inflows Year-to-Date As Positive Sentiment Continues: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto investors are going in heavy on the leading altcoin Ethereum (ETH).\n\nIn its latest Digital Asset Fund Flows report, CoinShares says crypto investment products enjoyed $1.35 billion in inflows last week.\n\n“Digital asset investment products saw further buying with inflows of US$1.35bn last week, bringing the last 3 week run of inflows to US$3.2bn. ETP (exchange-traded product) trading volumes also increased substantially, up 45% week-on-week to US$12.9bn, but representing a lower than usual 22% of the broader crypto market volumes.”\n\nRegionally, the United States and Switzerland saw inflows of $1.3 million and $66 million, respectively.\n\nMinor outflows were experienced in Brazil and Hong Kong to the tune of less than $7.5 million in total.\n\nBitcoin (BTC), per usual, enjoyed the lion’s share of inflows at $1.27 billion.\n\nHowever, the biggest story of last week’s inflows was Ethereum, according to CoinShares.\n\n“The outlook for Ethereum seems to have turned a corner, seeing a further US$45m of inflows last week, overtaking Solana for the altcoin with the most inflows year-to-date (YTD) at US$103m.”\n\nSolana (SOL) enjoyed $9.6 million in inflows. Multi-asset crypto investment vehicles enjoyed $16.7 million in inflows. Litecoin (LTC), Chainlink (LINK), XRP and Cardano (ADA) also brought in inflows of $2.2 million, $0.7 million, $0.5 million and $0.4 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPLTI4NGVnLTJVb2c2aTNRRjdWRzZUOVNVUWFhejNVbnVhai00X000ZG5UNDlaeU5uRVBHNWhXWDJESVU4dXlhNjRlOFZTV0RuZGJzRnI5d0s1SnRzOFRKMGdXOUJGNm1JMUdVSi1pV2dtQ1ZkRGZrMnpvWVB2S3lkSmNB0gGKAUFVX3lxTE5Qc3d3TUR1OVJmV2pTOTE3aWhWMllCTmR1TkE4THJVUkJqV2JOTHkwVm9UbDF3Y1hrVVBBSUZzTzlPaW1jQUtMX1Rxa0pHZGF1WXNVNmdCTnYwUVB5UHdWTU9XS1NEckZ5eDVsR3VvZDQ4eHZwWjBtSUFVR1U1MGFEVVlvVmtkVGlnUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs May See ‘Lower-Than-Anticipated Demand’: Report - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the cryptocurrency market eagerly anticipates the launch of Ethereum exchange-traded funds (ETFs), demand may not be as strong as many analysts have predicted, according to algorithmic trading firm Wintermute.\n\nThe expected introduction of Ethereum ETFs comes six months after the successful introduction of Spot Bitcoin ETFs, which amassed an impressive $13.8 billion in their first 100 trading days.\n\nWhile the imminent launch of Ether ETFs on July 23 has generated significant interest, market experts are divided on their potential performance.\n\n“Analysts hold varying views on Ethereum ETFs, with most estimates putting year-one annualized flows in the $4.8-$6.4 billion range,\" a new report by Wintermute stated.\n\nAD\n\nAD\n\nThe firm's own analysis, however, suggests a more conservative outlook.\n\n\"Our view is the ETFs will likely see lower-than-anticipated demand, closer to $3.2 to $4 billion,\" the report states. With a “baseline expectation” that Ethereum ETFs will see 15% to 20% of the flow observed for Bitcoin ETFs, Wintermute forecasts a price increase of 18% to 24%.\n\nThat is lower than some analysts project, with one recently predicting that the price of ETH will hit $5,000 following the launch of Ethereum ETFs, a 50% increase.\n\nThe report attributes this less optimistic forecast to two key factors. First, \"the absence of a staking mechanism diminishing Ethereum's appeal as an ETF vehicle.\"\n\nAD\n\nAD\n\nThe inability to stake Ethereum within these ETFs could make them less attractive to yield-seeking investors who might otherwise be drawn to the potential returns offered by direct Ethereum holdings, the firm said.\n\nSecondly, the report cites \"the lack of a shared narrative to attract investors\" as a potential hurdle for Ether ETFs.\n\nUnlike Bitcoin, which has successfully tapped into the \"digital gold\" narrative, Ethereum's more complex ecosystem and diverse applications may make it challenging to present a unified investment thesis to potential ETF buyers, Wintermute said—noting that Ethereum's flexibility could still appeal to some.\n\n”Within the ecosystem, Ether operates not only as a digital currency but also as a robust platform for decentralized applications (dApps) and smart contracts,” the report said. “This dual functionality has the potential to attract investors who are keen on technological innovations and the diverse applications of blockchain technology.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOYS1DN1BJVngwM2RHMkVydjJNT2F1ZjJpZGx2NG9KOExkSjhDM0IyR0J0NDV2TzQ5WXF2ZE5uZ3YyTWh2TGtCRFh5WGNRQnl1X0ZuUFVIck1TdkZBLVZ6OHVzSmxoQU9kWmx3ZEJzTlB6RENCaWZ5QXk4MmpaQlBjMmFrMGNxTmtQb0QxcTFIbDBOVl9ORFB2Qg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a No-Brainer Buy After the Bitcoin Halving? - The Motley Fool",
        "content": "If history is any guide, Ethereum could be on track to post stellar gains during the current Bitcoin halving cycle.\n\nThe Bitcoin (BTC -4.33%) halving that took place on April 19 was one of the most eagerly anticipated events of the year for crypto investors. Three previous halving events in 2012, 2016, and 2020 have led to spectacular gains for Bitcoin, and the expectation was that this year's halving would kick off yet another bull market cycle.\n\nWhat many investors may not realize, however, is that other cryptocurrencies can also post spectacular gains once the Bitcoin halving cycle starts. One crypto on my radar right now is Ethereum (ETH -7.12%), which could be on track for rapid price appreciation over the next 12 months. Let's take a closer look at why.\n\nBitcoin's impact on the Ethereum ecosystem\n\nKeep in mind that Ethereum is both a cryptocurrency as well as a blockchain ecosystem. This is important, because any new bullish sentiment around Bitcoin tends to benefit the components of these blockchain ecosystems, simply due to the greater interest that investors have in everything crypto-related. This can include everything from non-fungible tokens (NFTs) to decentralized finance (DeFi) exchanges, all of which are built on top of the Ethereum blockchain.\n\nIn many ways, then, the Bitcoin halving is a rising tide that lifts all blockchain boats. This is exactly what happened during the previous Bitcoin halving cycle that kicked off in May 2020. Growing excitement around the Bitcoin halving led to investors looking for other cryptocurrencies that could benefit, and that naturally led them to Ethereum, which has the largest and most diversified blockchain ecosystem of any cryptocurrency.\n\nAs a result of all the new money flooding into the Ethereum ecosystem from crypto investors, the value of Ethereum began to soar. Over a 12-month period starting from the date of the Bitcoin halving in May 2020, Ethereum soared by more than 1,732%.\n\nOf course, there's no guarantee that this same phenomenon will occur yet again for Ethereum in 2024. After all, past performance is no guarantee of future performance. But there are simply so many use cases for Ethereum that I'm increasingly confident that investors will find new sources of value within its sprawling blockchain ecosystem.\n\nLaunch of the new spot Ethereum ETFs\n\nThe second reason why Ethereum could soar in the post-halving cycle has to do with the imminent launch of the new spot Ethereum ETFs. The Securities and Exchange Commission officially gave the go-ahead for these new Ethereum ETFs at the end of May. By coincidence, this happened to line up with the date of the Bitcoin halving in mid-April. So it's now only a matter of time before investor money starts to flow into these ETFs, helping to push up the price of Ethereum.\n\nAdmittedly, there's not as much investor demand for the spot Ethereum ETFs as for the spot Bitcoin ETFs. But as much as $3 billion might flow into these ETFs by the end of 2024. At the very least, this new influx of money would help to soak up any new selling pressure in the crypto market.\n\nHow high can Ethereum go?\n\nThe combination of these two factors could send Ethereum higher over the next 12 months. A growing number of analysts and investors now think that Ethereum could regain its all-time high of $4,891 sometime by the end of 2025. And, from there, Ethereum could soar as high as $22,000 by the year 2030, according to investment firm VanEck.\n\nObviously, a lot needs to go right for Ethereum to skyrocket in value. So keep your eyes on the shifting sentiment around the Bitcoin halving, and how that influences investor perceptions of the value that can be unlocked within blockchain ecosystems. If history is any guide, Ethereum might end up being the no-brainer buy of this Bitcoin halving cycle, just like it was in 2020."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNdk9GQW5EVXFEcGxqYWhZa25UVmZ4UHdXQ0ItQllxWUI3WjZ1dUpCcC1seWdTSE5TVVZibktPYUxITmlVbFVXWm0zTWdUZENYVzF0WDBDczVOa2JaU2llaFpYb1hPT0lRQ1JWdjZNQzllUlc3SDlmcFVEUk5jRTJaRlRVb0U2MlhNLXNkeWRGS1ZlV1VXSUNVVl8yLS1aUdIBowFBVV95cUxOUnJnZkRLOTNJYjJ3OW82ZXlEX194SHVBQWV5UWJzN1JKNFZaVDhtcnRWOTNVUUhTZkVFTld5S2JLZGpEV3JtcWdBb1dSeHpVNFhoNW5nWmFITGNQWEFwQWVkTmUtTllWa01VVXl6bHMxWFFJSzhtQWZWNEpJQXI5cDhnLVhYenFMRW9Kb0t3bURMcFEzRVMtM29Ob3NyM2dycHdZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF’s to Start Trading Tomorrow – Will ETH Price Explode? - Crypto News Flash",
        "content": "Ethereum ETFs debut, signaling significant market expansion and institutional acceptance of digital assets.\n\nAnalysts predict ETH price surge, potentially mirroring Bitcoin’s historic rise and impacting financial services.\n\nIn line with our previous update on Grayscale’s Mini Ethereum ETF receiving SEC approval, trading is imminent, starting July 23. The Cboe exchange will launch five new Spot Ethereum ETFs, marking a notable expansion in cryptocurrency investment options.\n\nAs listed in the Cboe listings, five new ETFs will begin trading on July 23: 21Shares Core Ethereum ETF (CETF), the Fidelity Ethereum Fund (FETH), the Franklin Ethereum ETF (EZET), the Invesco Galaxy Ethereum ETF (QETH), and the VanEck Ethereum ETF (ETHV). Detailed in today’s CNF YouTube video below, these ETFs will follow Ether, the token of the Ethereum blockchain.\n\nSince Ether is the second-largest digital asset, these ETFs represent a new milestone for U.S. markets, aligning with the SEC’s recent approvals of similar cryptocurrency products.\n\nWill ETH Price Explode?\n\nThis initiative, partly driven by political dynamics in an election year, indicates growing institutional acceptance of digital assets, despite ongoing debates about investor readiness for such innovative investment tools. Analysts are keenly observing, expecting potentially significant impacts on financial services through decentralized smart contract networks, even suggesting ETH could mirror Bitcoin’s 200% surge as reported in a previous CNF report.\n\nAs of now, according to CoinMarketCap data from today, Ethereum (ETH) trades at $3,498.36, having surged by 4.49% in the past week. See the price chart below.\n\nRecommended for you:"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQYVdjNU9PWGhFdE4xLXJkYzdlMmFDVU92YjF1WURxZjVIZm1uQS13VGFmRzFKRVEzZW9FbWdWem5YY09BSTF2MzFJaUdXcmdTVVpYUGdwTzVSQXdDejV1RWZzbGJodkpmU1pLYzRZN3U1UHVacmlRT1BWM0hmajc2SlVJdlVHOHAyUURYTHJfVmVYclhxRzU5ZG04VGp3N0pnUnpFc0M5Y3VGZmdjTFJVdnZ4MnpYWlnSAbwBQVVfeXFMT24tME94TGpNN2pKY2VUWjJYSS1CcjY0TWlGYzc1SHBGM0VUc2ltMTEtU0U4MXRBYW5OaDhPbGpSTFM0NnUyOUg2SVo5aEtTN3kwTnZlZE9LRjR6cGMxVHdteENyaFRtb0hiTWJOUEFvU0EzRDdmU2tZSTFQc0I1TkdVVUo0TWtBSU56dmpJWEVHQlQ0VV9kdHJaazRiRHduSHVSa3dJanJNNFM5Zl9LSlhwWkh3aVF5TXR5Mjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Could See Underwhelming Demand, Partly Due to Lack of Staking, Two Research Firms Predict - CoinDesk",
        "content": "Wintermute, a major market maker, sees ether ETFs collecting $4 billion, at most, of inflows from investors over the next year. That's below the $4.5 billion to $6.5 billion expected by most analysts – and that latter number is already roughly 62% less than the $17 billion that bitcoin ETFs have so far collected since they began trading in the U.S. six months ago."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE84S2Y3RFlQcFJuek5OcFEzemNtb0xqR0M0dFB1VWU5OWZWMjJBSDhVUGlqVXpvWVhjUnc2a2gwd185dEpxN3ZMMEkwekJaWXJYR2dubTJqbTgzamZWenJBSW8wczdMR2oxSjBOOGF4NNIBd0FVX3lxTE40aUxhTmExQklNYXlIak95Q2FvT05kTy1KaENOcUtmT21FVjJYTTFTbGdsRkF2ckxiTWZGMU5IUnFlb1VTc2o1Z0ttTFRXeHM4TlBuaksxZGRteGlJVlFZTHY2LUo4TGtZWkpUcVBNSHIzUEtkQmFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Finally Start Trading Tomorrow—Here’s What to Expect - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum exchange-traded funds will finally hit U.S. markets tomorrow after the Securities and Exchange Commission said yes to the products in May and signed them off for trading today.\n\nThe Bitcoin equivalent has been a roaring success following its launch in January. The funds—which allow investors to buy shares that track the price of the cryptocurrency—received lots of attention as traditional investors previously spooked by the complex crypto space could finally get exposure to an asset on a traditional stock exchange.\n\nSo will traders repeat the rush and flood the new Ethereum funds with cold, hard cash? Can we look forward to an all-time high price for ETH, as some have predicted?\n\nAD\n\nAD\n\nHold your horses, market experts told Decrypt. Things might take a while to settle out.\n\n“I think the inflows are going to disappoint for the ETH ETFs,” Greg Magadini, derivatives director at blockchain data provider Amberdata, told Decrypt. He pointed to demand for Ethereum futures being “lackluster” ahead of the launch.\n\nBefore the Bitcoin ETFs dropped, Magadini said, traders were desperate for exposure to the asset, and the derivatives market—which allowed people to bet on the future price of an asset—was buzzing.\n\nThis is simply not the case this time round. “Therefore the demand for ETH exposure is likely to be underwhelming compared to BTC,” he added.\n\nJames Butterfill, head of research at Jersey-based asset manager CoinShares, pointed to another potential downside: Grayscale.\n\nAD\n\nAD\n\nThe top crypto asset manager will launch two products: a main ETF and a mini one. The main one will be a conversion from a fund that operates like a closed-end product to an ETF. ETFs, by their very nature, are easy to cash out of.\n\nIt’s expected, Butterfill told Decrypt, that investors will want to cash out of the main Grayscale ETF as soon as it launches—which is exactly what happened when Grayscale converted its Bitcoin trust into an ETF in January, putting downward pressure on the asset’s price.\n\n“It is highly likely the initial weeks will be marred by outflows from the Grayscale ETH product, in a similar way to the Bitcoin closed-end fund that saw outflows when it became an ETF—investors had been ‘locked in’ due to the steep discount to net asset value,” he said.\n\nHe did add that the approval was positive for the digital asset sector as a whole, and eventually “may enhance market stability and investor confidence.”\n\nAs for the mini fund, Billy Luedtke, CEO and founder of Ethereum-based authentication protocol Intuition, said that the mini trust could help push the price of ETH up.\n\n“The [mini trust] offers investors an exchange to the new ETFs without tax liabilities, providing a more attractive fee structure to those who might be skeptical,” he told Decrypt. “With reduced barriers to entry, enhanced investor attractiveness through improved fee structures and tax benefits, and increased awareness, substantial inflows into Ethereum can likely be expected.”\n\nFinally, Patrick Felder, Prismatic Capital founder and CIO, told Decrypt that the market is expecting flows of around 15-25% of what we're seeing with the Bitcoin ETF.\n\nHe added that if inflows come in stronger than that, “we’ll see a big move up in ETH price as market expectations reset.”\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNeXpnXzlvcUFaX1g1SFpmeDFFanJKNHdpVUZFZHFwaTU4N2J1cWU5VXBER3NrTUgzcUU0Q2dFWk8tMjF1MURocF9XelM0aVVra2psTTFaWjBDaGt5V19GSERFTkZsZnR3eE1qdDF6dVFFMmZDbzZkRWQ5ZDFmeEFYZFptVVdjbGZFRFI3OU82ekVwVXBkN05tV3FPR0RPLUc1c0J1ajZuR3MwZnZJRlVZNjdiOXhQUWdhSzJfVm1yYUxzVTlYMWptWGp2TFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Biden Bowing to Trump Could Clear $704M Resistance for ETH - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNMC15d28wTmVPdzFkODhCckx5Nk40TkhIR1NqbG1Cb2xOa2tNZUFnZi1iajVvMUpsVWVHWFhWazNTZ1lzMTltLWt2ckpLOWRVa2t1OE5tTkt6VGNRbkxOYW1wZ0JISkdHdHIzMzdKaU9XYVFYR2JWN2liOFA3bjJnamFyM3U3Z2NCWWM0NS1UR3FxcTB5ODBsRHFtQjRRQl800gGmAUFVX3lxTFBqWTFGREhraHd0V1BlQU11TlNadmZWakp5bFZPekJsNlhKWHVtZ2VGb180QVV4N3dRTVNZdV95U2tfR2hjb1M3TFJmVmhJRFhHM3ZnQXFEZjJHUzltd3ZGSVQ1VUEzNV9mUWVJZVRrUVdRRjlTUWlfODFRUFRublZMOVNFRkV2T0thX2dYbVZTZGlrcU1TM0lKTG1BYU94d1ZKTjhJMlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Cboe Unveils the Official Launch Date for Five Spot Ethereum ETFs - The Daily Hodl",
        "content": "The Chicago Board Options Exchange (Cboe) is giving the launch date for five spot market Ethereum (ETH) exchange-traded funds (ETFs).\n\nCboe’s new listings page shows that Ethereum ETFs from issuers 21Shares, Fidelity, Franklin Templeton, Invesco and VanEck are scheduled to roll out on Tuesday, July 23rd.\n\nLast week, Bloomberg senior ETF analyst Eric Balchunas said Ethereum ETFs are likely to begin trading on Tuesday after the U.S. Securities and Exchange Commission (SEC) asked issuers to make final changes to their form S-1 registration statement.\n\nCrypto market participants have been anticipating the rollout of Ethereum ETFs since May when the SEC abruptly shifted its stance on the investment products.\n\nAnalytics firm IntoTheBlock says that deep-pocketed crypto investors are rushing to load up on Ethereum in anticipation of the ETF launch.\n\n“$126 million worth of ETH was withdrawn from exchanges [last] week, signaling accumulation ahead of the ETF launch.”\n\nWhile whales appear to be bullish on ETH, crypto analyst Kaleo thinks the ETF launch will lead to a brief price spike before Ethereum witnesses a correction. According to Kaleo, the ETF launch will turn out to be a sell-the-news event.\n\nBut after the pullback, the trader predicts that ETH will soar above $4,550.\n\n“If you’re really bullish on this cycle, one more sweep of the lows would be an absolute gift. We’re heading way higher from here – just think we might need a bit more patience before the fun really starts.”\n\nAt time of writing, Ethereum is worth $3,521, a slight increase on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQZnN3N0NkNHlnaDdIUXUtdlNWbm1aRkRUUTl5UlRWQV9KZW1EY1k5dHM0UDZLMlFIWXRSREttUEpEU3FpX29XSnRVMDRvV0NoVldOVzBSeGVjWXdYT2hUQU1VSFMteERrTTBCdXgzT2I5dm1JZ1hrbVBBT3ZvYk5RaURvMmlicVRPUEF0Q3NaYlE1WkFDcE1OcGp5SjVIZGlkSkdr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC issues final approval for spot Ethereum ETFs to begin trading on July 23 - CryptoSlate",
        "content": "The SEC officially issued its final approval for spot Ethereum ETFs on July 22 and the funds’ respective webpages are now live.\n\nThe ETFs are scheduled to begin trading as US markets open at 09:30 Eastern Time on July 23.\n\nBloomberg senior ETF analyst Eric Balchunas confirmed the approvals, saying:\n\n“It’s official: Spot Eth ETFs have been made effective by the SEC. The 424(b) forms are rolling in now, the last step = all systems go for tomorrow’s 930am launch. Game on.”\n\nThe approval confirms rumors from last week and opens up Ethereum to investors seeking regulated exposure. Market experts believe these funds will attract a significant amount of money from investors who have been hesitant to invest in crypto due to regulatory concerns.\n\nCiti recently predicted the ETFs will attract $5.4 billion in the first six months of trading, while more optimistic estimates place the inflows at up to $15 billion.\n\nMost analysts agree that the funds are unlikely to attract the same level of investment as their Bitcoin counterparts. However, the launch is expected to catalyze a rally in Ethereum, which will also “lift all boats.”\n\nMeanwhile, CryptoQuant research recently revealed that the amount of ETH held on exchanges has fallen to multi-year lows amid anticipation of the ETF launch. Exchange balances are down 10% since the start of the year to 16.9 million Ethereum, the lowest level seen since July 2016.\n\nEthereum was trading at $3480 as of press time, based on CryptoSlate data.\n\nThe story is developing and will be updated as more information is released.\n\nEthereum Market Data At the time of press 10:13 pm UTC on Jul. 22, 2024, Ethereum is ranked #2 by market cap and the price is down 0.56% over the past 24 hours. Ethereum has a market capitalization of $418.59 billion with a 24-hour trading volume of $18.7 billion. Learn more about Ethereum › Ethereum $3,481.60 -0.56% Crypto Market Summary At the time of press 10:13 pm UTC on Jul. 22, 2024, the total crypto market is valued at at $2.46 trillion with a 24-hour volume of $87.93 billion. Bitcoin dominance is currently at 54.53%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE11TTRTekxsZHJpQ0xfRDlwc1lobzlMbmQ0WDgyUDBMWGV4XzVCa0xxOFJ2ZTR1VElsLXFzZzJjdW83TjJxX05FSFd2OF9sUWp6XzVzbTJnbTA5bm9NSk02dtIBZkFVX3lxTE05ZHdkNW5hZm5RY3U1bmJZaGNDYkJCbE9WcGRjTklmRk84SHJzeTQtMWVhSXNCdkQ3eG01WTRvVkJVdUhXYWpwcWFab1B2TXBTNDVWN1JKT0xGX0VRREJ5bkVobDkwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "What is Optimism (OP): Guide to One of Ethereum’s Layer-Two Scaling Solutions - CryptoPotato",
        "content": "The cryptocurrency industry, in general, has become much more popular in the past couple of years. This saw the development and launch of hundreds if not thousands, of decentralized applications (dApps) in various fields, such as DeFi, gaming, learning, trading, investing, and so on.\n\nThere are many reasons for this, including but not limited to the massive bull run in 2021, the rise of non-fungible tokens, the popularity of memecoins, and more. This saw hundreds of thousands of users flocking to whatever the next trend may be.\n\nUnlike previous cycles, however, this time, we also saw regular users take advantage of on-chain availabilities and interact with various dApps such as Uniswap, OpenSea, and so forth. And while this had a massively beneficial effect on the industry’s growth and valuation, it also highlighted some very critical issues.\n\nBlockchains like Ethereum—where the lion’s share of dApp activity takes place—struggled in terms of affordability, scalability, and even accessibility. Layer one alternatives like Solana also proved insufficiently effective in handling the massive load of user requests.\n\nThis brought up a topic that’s been largely discussed in the cryptocurrency community for years—scalability. Now that scaling solutions have become essentially imperative for the industry’s future growth, projects like Optimism have seen the light of day.\n\nOne of the most popular Ethereum scaling solutions, Optimism aims to solve some of the network’s underlying issues, with a particular focus on scaling.\n\nQuick Facts About Optimism\n\nOptimism’s mainnet went live on December 2021\n\nOptimism launched its native token (OP) on May 31st, 2022.\n\nA total of 231,000 addresses were eligible to claim 214 million OP tokens.\n\nQuick Navigation\n\nWhat is Optimism?\n\nOptimism is an Ethereum scaling solution. In essence, its purpose is to help the main network run smoothly by taking some of its transactional load. In technical terms, Optimism is an “Optimistic rollup,” and it’s important to understand what rollups do before diving deeper.\n\nWhat is a Rollup?\n\nRollups are one of the multiple scaling solutions intended to help Ethereum achieve a higher transaction throughput.\n\nThe Ethereum Foundation explains that they “perform transaction execution outside layer 1, and then the data is posted to layer 1 where consensus is reached.”\n\nThe main benefit of this is that it reduces the load on the main network while also guaranteeing the broadcasted information by its native security.\n\nThere are two main types of rollups, mainly differentiated by their security models:\n\nZero-Knowledge (ZK) Rollups – these run the computation off-chain and then submit proof of validity to the chain.\n\n– these run the computation off-chain and then submit proof of validity to the chain. Optimistic rollups – these assume that transactions are valid by default and only run computation through fraud-proof if there’s a challenge.\n\nOptimism falls within the second category, and, as you may have probably guessed already, its parent chain is Ethereum.\n\nHow Does Optimism Work?\n\nThe big idea that makes Optimism interesting to most is the Optimistic Rollup. The following is a brief explanation of the concept’s fundamental principles.\n\nHowever, the TLDR is that an Optimistic Rollup is another way of calling a blockchain designed to take advantage of the security of another network that acts as a parent one.\n\nBlock Storage\n\nAll of the blocks on Optimism are stored within a specific smart contract that’s built on Ethereum and is called CannonicalTransactionChain – CTC to make it easier. They are helped within a list that’s inside of the CTC, and it’s append-only.\n\nThe CTC contains code that guarantees that the current list of blocks can’t be altered by newer transactions on Ethereum. However, this guarantee can be broken if the Ethereum network itself undergoes a reorganization (reorg) and the order is changed.\n\nBlock Production\n\nThe ‘sequencer’ is the single party that manages block production on Optimism. It helps with the network by delivering the following:\n\nInstant transaction confirmations and state updates;\n\nConstructing and executing layer-two blocks;\n\nSubmitting user transactions to layer one.\n\nIt has no mempool, which means that the transactions are accepted (or rejected) immediately. This happens in the order they are received. When someone sends a transaction, the sequencer will check if it’s valid (pays a sufficient fee) and apply it to the local state as a block that’s pending. These pending blocks are then batched and periodically submitted to Ethereum’s network for finalization.\n\nThe main goal of this batching is to reduce the overall transaction fees by spreading certain fixed costs over all of the transactions within a single batch. Of course, this fee may vary depending on the network load at the time when the transactions were sent to the sequencer.\n\nBlock Execution\n\nIt’s important to understand that Ethereum nodes download blocks from Ethereum’s network that’s peer-to-peer. Optimism nodes, on the other hand, download blocks directly from the CTC append-only contract.\n\nTwo primary components make up Optimism nodes: the Ethereum Data Indexer and the Optimism Client Software.\n\nEthereum Data Indexer\n\nIt’s designed to reconstruct the optimism blockchain from blocks that are published to the CTC contract. It’s also called the data transport layer.\n\nOptimism Client Software\n\nThis one closely resembles Geth, which means that Optimism, overall, is very similar in its design to Ethereum. This is also because Optimism shares the same Ethereum Virtual Machine (EVM), account and state structure, gas metering mechanism, and fee schedule.\n\nFault Proofs\n\nUsing an Optimistic Rollup means that state commitments are published to Ethereum’s network directly without requesting proof of their validity. Fault proofs are requested when a state commitment is challenged. If it’s challenged successfully, it is removed and eventually replaced by another one.\n\nThis documents provide a more in-depth and technical explanation of the terms and overall process described above.\n\nHow to Bridge Assets Between Layers\n\nWith layer-two scaling solutions such as Optimism, being able to swap assets between different layers is obviously of paramount importance.\n\nThere are multiple ways to do it. First and foremost, you can hop on the official website and use the bridge provided there. This would only require you to have a Web3 wallet such as MetaMask.\n\nFrom there, you have to select the network from which you want to bridge tokens. This is the supported list:\n\nThere are also options to bridge from centralized exchanges, but it’s critical to note that these happen through providers that Optimism has simply linked to—meaning there’s no endorsement. You should proceed with caution and after conducting thorough due diligence.\n\nFrom there, the process is particularly simple, as all you need to do is confirm the amount and sign the transaction in your wallet.\n\nThere are a couple of options for bridging assets from optimism. You can use a third-party bridge or the official bridge instead. The following is an example of the latter, but keep in mind that bridging from Optimism to Ethereum takes seven days.\n\nAll you need to do is click the arrow in between the value boxes, and this will switch the above transaction. If you haven’t added Optimism to MetaMask, this will also handle it for you. From there, you only have to confirm the amount and sign the transaction:\n\nGovernance: Optimism’s Model\n\nThe native cryptocurrency of the Optimism ecosystem is the OP token.\n\nOptimism is governed by the so-called Optimism Collective. According to the official website, the collective is:\n\n“… a band of companies, communities, and citizens working together to reward public goods and build a sustainable future for Ethereum.”\n\nThat said, the governance of the Optimism Collective itself will consist of two separate houses: The Token House and the Citizens’ House. Let’s break it down.\n\nThe Token House\n\nThe launch of the OP token and the Token House set forth the beginning of the governance of Optimism. OP itself was distributed to hundreds of thousands of addresses, who engaged in community-oriented behavior through the first airdrop (more on that later.)\n\nIn any case, members of the Token House are responsible for deliberating, submitting, and voting on various proposals. To do so, OP holders can either vote directly o choose to delegate their voting power to a third party.\n\nIn essence, the Token House votes on proposals of the following types:\n\nProtocol u grades\n\nInflation adjustment\n\nTreasury appropriations\n\nRights protection\n\nGovernance fund grants\n\nThe Citizens’ House\n\nAt its core, the Citizens’ House is an experimental attempt at a non-plutocratic governance model. It is responsible for retroactive public goods funding.\n\nThe above brings us to our next point, which is the OP token.\n\nIntroducing the OP Token\n\nThe OP token was launched through an airdrop, which distributed a total of 5% of the total supply.\n\nThat said, qualifying users included:\n\nDAO voters\n\nMulti-Sig signers\n\nRepeat Optimism users\n\nGitrcoin donors\n\nIf you suspect you are eligible, you can check out any associated wallets on the official claim page.\n\nMany wonder if there will be a new airdrop, and the short answer is – yes. The team has made it clear that it plans to allocate a total of 19% of the supply for this purpose. Here’s what the overall tokenomics of OP look like:\n\nPlease visit the official website for a more complete look at the economics behind the Optimism ecosystem.\n\nConclusion\n\nOptimism has quickly become one of the most popular Ethereum scaling solutions. Most recently, the Optimism Foundation released a proposal to upgrade the Optimism mainnet to Bedrock, which is a new generation of decentralized Rollup architecture developed by Optimism Labs. Speaking on the matter, the team said:\n\n“We are confident that the post-Bedrock experience will be a positive change for developers in the Optimism ecosystem and have received consistent excitement for the upgrade from our partners. We are committed to making this upgrade a success and are eager to see the results in the months and years to come.”\n\nIt’s also very interesting to monitor how the different layer twos fare in the coming years as the battle between optimistic rollups and ZK-rollups continues."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQWHVZMjJ3YTBXLW1SdnhWY2Z6NDNwYThVMVFXR1ZwZnNvTVZBQUxaMEN4TkhLRGNQdkdSc3QxZzRUNGJnYXJsOC04cTZTWUJDTVdNU0cxZUVPdkl5azg5UDdEZ0tkLS1sM001OHlqY0hfa0tsTUlFY1JIT0VKRHRIWi1nekstczVwNm9NSUR1czFUNUZUT1ZxRUlOeEpLOW5NWDlLSF80Sng1cDJ1X0cwc1NKSmdmOTFwblVidHVxdjZqaXA5NlVrdG1vcV9pdnVXVE9WN2NaQdIB3AFBVV95cUxObUppNXVCdTBUTVd5cUdZSVVmcXl3a3dncUh5RTdrU0wwdjAtbnRyX0xZWG5mRVRwdHRkUWIxN3dwb2tqME5fSU92dGpEWGFMTDBqekJocGN5X2RqeHFLZHRNaVNrQnd4X3diSkhiSjBrbHVUaHhKU20xbFF5SWNSMi1nbnFLQ0E1NkpwM2J4YW1KSkpaQmVueFM0QjFlREpUcFh3ZE1xcFAxWTZQV0hYOVR5ZF85QUl1bTYzV3U0SVlnTVI4V3Y0V3lOVHlPNFJ1NlpWS1lRZDlsZmlh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "This week could be explosive for ETH: Ethereum ETFs to debut in the US on Tuesday - FXStreet",
        "content": "Ethereum ETFs set to launch on Tuesday as the SEC declares issuers' prospectus effective.\n\nBitcoin Conference coinciding with ETH ETFs launch week could help drive a rally for Ethereum.\n\nEthereum traders display uncertainty despite bullish predictions surrounding ETH ETFs' launch.\n\nEthereum (ETH) is down nearly 1% on Monday as the Securities & Exchange Commission (SEC) confirmed via its website on Tuesday that it has given the final approval for spot ETH ETFs. Considering the ETH ETF launch and the upcoming Bitcoin Conference, this week could prove crucial for Ethereum.\n\nDaily digest market movers: Ethereum ETFs, Bitcoin Conference, ETH inflows\n\nEthereum may be set for an explosive week ahead with several potential bullish catalysts on the horizon:\n\nAccording to SEC updates on its website, it has approved the S-1 registratements of spot ETH ETF issuers.\n\n\n\nEthereum ETFs\n\n\n\nThe Exchange NYSE Arca confirmed that it has approval to list and begin trading Grayscale Ethereum Trust and Bitwise Ethereum ETF on Tuesday. The Chicago Board Options Exchange (Cboe) had earlier revealed that Fidelity Ethereum Fund, Franklin Ethereum ETF, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF and 21Shares Core Ethereum ETF will also begin trading on Tuesday.\n\n\n\nThe Bitcoin 2024 Conference will kick off on July 25, and with Republican nominee Donald Trump set to discuss a potential US Bitcoin strategy during the conference, Bitcoin is expected to see a brief rally. Many expect ETH to largely benefit from the rise due to its positive correlation with Bitcoin and Ethereum ETFs launching in the same week.\n\n\n\nTraditional investors seem to be bullish on ETH ETFs' launch as Ethereum investment products recorded $45 million in inflows last week, according to CoinShares data. The move brought its year-to-date net flows to $103 million.\n\n\n\nSeveral experts including analysts from Bitwise and Galaxy have predicted that ETH ETFs will see inflows of about $3 billion to $5 billion within the first six months of launch.\n\nETH technical analysis: Ethereum traders are uncertain despite upcoming Tuesday ETH ETF launch\n\nEthereum is trading around $3,460 on Monday, down about 1% on the day. In the past 24 hours, ETH has seen $39.87 million in liquidations, with long and short liquidations accounting for 76% and 24%, respectively.\n\nEthereum is expected to see increased volatility this week following Tuesday's potential launch of ETH ETFs. This is evident in ETH options' implied volatility, which jumped from 56% to 70% last week, according to data from Deribit.\n\nIn addition, ETH options with a notional value of $1.89 billion will expire on Friday. The strike price of these options is heavily concentrated around $3,700, with a Put/Call Ratio (PCR) of 0.45. Since the PCR favors calls, it signifies that most traders are bullish, betting on the price of ETH to rise above $3,700 before the month ends.\n\nEnd-of-month options expiry has triggered a significant decrease in ETH options open interest in the past two months. If a similar move occurs this time around, it may signify uncertainty among ETH investors. ETH futures open interest declining slightly by 1% in the past 24 hours also aligns with the uncertainty among options traders.\n\nAnother key metric to watch is the ETH futures Long/Short Ratio, which is at 0.88. This indicates that a larger portion of ETH futures traders are bearish.\n\nETH/USDT 12-hour chart\n\nWith uncertainty brewing in the market despite the confirmation of ETH ETFs' launch, the bullish sentiment from inflows may not be able to trigger a massive rally this week, as many predict. On the upside, ETH could rise by 8% to the $3,731 key level while finding support around $3,205 on the downside."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQX1FnN1VSQVBzVGw5dzNYN1BpbnA0QlJUWERBYTdQbjlwVHhDYWJWRGdHUTdWeVB0bkhzSVpNczBZNDRjbi15ckF2N01xU1l0RnZUb1IySV9MTkYxY2R0U3M1VFZycWFadmp1bUJIa01JYkNIVV9tMXd1ZUctVVJWVXlLaE5ScUx4dkowU1k1MWJnb2h1c2hZY2dxLWJsTjdZWnkwNUxtQW1tTXNrOVlIdXFBMlJISy1na3FUWDFDZzFFaVlxclpkRWltVmhVRzBNMHVaS1V3TmlYbVUtWWNQRdIB5gFBVV95cUxQSmtVRVpmZU55M1VnSm5VTGxiYjRvT21YUzQ1RlBPR2xQYUs3LTdSQ1ZUbW15Yk5xN1E3VFlCWjcxY0NrbW56aFM3WlEtZVFYSmpsTjAzZUd3SG9Ma0UxcnRNZ3VNam5GQS1maWZ0azhsclhPWmV4LUljYlVrelktVXlPTThyUUo3RDY4UmhWRS05eFJ6bHNWZ2FOYTU2MWtJR1VENVJnNFJ4M1V4LU9FTk0xS2ZlS0NPQ2VkM0dBeXdEUmRsT2doZDlNRlpaTzdLNkhBRWk1QVp1bE1kV2ZtTlRETnNGQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Solana and Crypto Markets Look Ready To ‘Send’ As Stars Align, According to Investor Chris Burniske - The Daily Hodl",
        "content": "Crypto investor Chris Burniske says that Bitcoin (BTC), Ethereum (ETH), Solana (SOL) and the crypto market in general look ready to make a run.\n\nThe former head of crypto at ARK Invest tells his 292,200 followers on the social media platform X that several catalysts are now lining up, hinting that digital asset markets are on the verge of a rally.\n\nAccording to Burniske, a partner at venture capital firm Placeholder, the highly anticipated launch of Ethereum-based exchange-traded funds (ETFs), Republican presidential candidate Donald Trump speaking at an upcoming Bitcoin event and the current state of BTC, ETH, and SOL charts all suggest major bullishness for crypto markets.\n\n“With ETH ETFs slated to go live, Trump speaking at The Bitcoin Conference, and BTC, ETH, SOL charts that look like [they do] (while equities are weak), it’s hard to see a world where we don’t send next week.”\n\nReuters recently reported that preliminary approval for ETH ETFs was granted while The Bitcoin Conference is set to take place from July 25th-July 27th.\n\nBTC, ETH, and SOL are trading for $67,333, $3,528 and $174 at time of writing, respectively.\n\nThe venture capitalist also provides an update on his prediction that the total market cap of crypto assets will eventually reach $10 trillion. According to his chart, the road to $10 trillion is currently “23%” complete as it sits around $2.2 trillion.\n\nEarlier this month, Burniske said in an interview with Real Vision CEO Raoul Paul that he’s keeping a close eye on the Move ecosystem, which was originally built by social media giant Meta and then used to develop layer-1 blockchains Sui (SUI) and Aptos (APT).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQNl8teW1PeFBqaG53aGtRclkwNG5adHQ2cUNDaXk1Z1VSbUk3X0ZlS3Z4RU9kVmpETEU0OVBLdmRYbjFqYmVRaWxLcFRWVy1Bdkl2TjJtVnpWeVcta0NhZzdycWRhcnJwYXRNQk1tcDV0QlZFNWNmMUFfUWEzd1pTQWtmN1hnazZGNXVMNkZ6UnNWZUstWUpKY0RVZUlpTkVoOW1qS3o3Ry1ZRTIxaHJ0QS1iRDZXN2hCODhoMmhudXo2RncwS2lPYkpER3lyaVFZOUduc19FWGlYSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Top Crypto Trader Reveals Why He's 'More Interested' In These Ethereum-Linked Coins - Benzinga",
        "content": "Widely-followed cryptocurrency analyst Michaël van de Poppe detailed his altcoin trading strategy, highlighting a substantial allocation to coins in the Ethereum ETH/USD ecosystem.\n\nWhat Happened: In a video shared on his official YouTube channel, Van de Poppe underlined the significance of investing in the right coins amid a hype-based market sentiment. He informed that he's \"heavily\" into the Ether ecosystem.\n\nThe analyst specifically pointed out the high expectations he has from the two Layer-2 network tokens, Arbitrum ARB/USD and Optimism OP/USD.\n\n\"I’m even more interested in them because there is more activity going into the Ethereum ecosystem and due to the spot ETFs, it’s going to be even better,\" he remarked.\n\nSee Also: Bitcoin Critic Elizabeth Warren Backs Kamala Harris For Presidency After Biden Withdraws From The Race: ‘She’s Ready To Step Up’\n\nVan de Poppe revealed that he will continue to HODL these coins at this time as they are vastly undervalued. \"There's no point in selling them quite early.\"\n\nWhy It Matters: This commentary comes a week after Van de Poppe emphasized Ethereum’s low valuation and long-term upside prospects.\n\nHe had predicted that Ethereum would reach a new all-time high faster than the rest of the market and described the upcoming launch of spot ETFs as a major catalyst.\n\nAs things stand, the funds tracking the spot price of Ethereum are set to debut this week, marking a new milestone for the world's second-largest cryptocurrency.\n\nPrice Action: At the time of writing, Ether was exchanging hands at $3,508.72 trading mostly flat in the last 24 hours, according to data from Benzinga Pro. Arbitrum rose 1.01% to trade at $0.7872, while Optimism gained 1.85% to be valued at $1.94.\n\nRead Next:"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9GdUQxaGZWUlJDbUdEdzRUTHdWTGsxdEJhYVZXYlN3anlwbV9KOGVwbE80WkhwS2toOFRUUE9RLWYtaG9SYU1uZ2lDckhWQm5ONmdvM25IMk1KeFUybXkzNkdRV0xXZGhWRkIzZEJSWdIBdEFVX3lxTE9tWmpENzQ0amJMclJESXM5VWhiLVhKbDVxcTVWVTlkeDdueDEwUUNPNXJFUkVScVpSd0RUS0ZTNGN2VEc4cVI2TUFuT2wySjdMSEFydm1XOHQzTUhHd01Sa0UtNm9keVY1VEpBOG12R3VYdXp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Excitement Leads Crypto Whales to Scoop Up 426,000 ETH, Price Rally Next? | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum whales also known as major investors are gradually returning to the market following recent positive developments around ETH, which demonstrates renewed optimism among institutional and retail investors around the crypto asset. Current data shows that the whales have amassed 426,000 ETH in light of rising excitement over the introduction of spot Ethereum Exchange-Traded Funds (ETFs).\n\nEthereum Whales Acquires 426,000 ETH In One Week\n\nBurak Kesmeci, a verified author and analyst at leading on-chain analytics provider, CryptoQuant, spotted the recent rise in ETH accumulation among major investors, which has triggered hope within the community about an impending potential price rally for the crypto asset.\n\nAfter observing recent data, the expert reported that Ethereum whales acquired 426,000 ETH, valued at approximately $1.4 billion at its current price in one week, particularly between July 22 and July 28. The analyst also pointed out that the whale wallets holding at least 0.1% of the total amount of ETH have continuously displayed positive net flows, throughout the previous month.\n\nAccording to Burak, this spike in accumulation was identified after a price recovery from recent lows below the $3,000 threshold. The expert also attributed the uptick to the frenzy around the launch of the spot Ethereum ETFs last week, garnering significant inflows since its inception.\n\nFollowing the launch of the spot ETFs last week, Blackrock’s fund, ETHA, has seen the highest inflow, recording a net inflow of $442 million. Bitwise’s ETHW, takes the second spot with over $265 million in net inflows, while Fidelity’s FETH saw a net inflow of about $214 million. Despite witnessing significant outflows on day one trading, Grayscale’s ETHE has managed to amass a net inflow of over $164 million.\n\nBurak highlighted that in just 4 trading days, spot Ethereum ETFs excluding ETHE have received investments totaling more than $1.17 billion. Due to the rate of these substantial inflows, Burak is confident that a rally could be on the horizon for ETH as seen with Bitcoin following the inception of spot BTC ETFs in January. “Of course, as adaptation increases and becomes easier, a rally similar to what we see in Bitcoin is expected to occur in ETH,” he stated.\n\nETH Price Begins The Week On A Positive Note\n\nThe price of Ethereum is currently demonstrating positive momentum, triggering sentiment about further gains. After falling to $3,200 on Sunday, the crypto asset has experienced a slight rebound, targeting the $3,400 price level.\n\nThis price rebound might be attributed to the current whale accumulation, as such heightened interest and adoption around a crypto asset is mostly considered a bullish factor that could impact prices.\n\nAt the time of writing, Ethereum has recovered by about 3.90% in the past day, trading at $3,385. Its market cap has attracted an uptick of over 3.71%, but its trading volume is still displaying negative sentiment, falling by more than 19% in the last 24 hours.\n\nFeatured image from LinkedIn, chart from Tradingview.com"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBoQ3llMldpWWFFZG5hMDItczlMZ1pFUDZQTFVvRW9DMEhuV2pzMzlPZE01X0xBTUUxRHZkZG5ZRmdFWGtmS1lvRkI4SlVRUi0wTm9Ha1JyQmdvYThSME5xemprYXpCOEww0gFuQVVfeXFMT0hJYjdJcXF1NkFuX3dwMjZFaXdwUVI3ekZRY0JKSUlQelFBdzE3bFM2ZXlDbF9OLXVxZWQzdGNDMDItMTM0SmZyMXJRX3lSZ3NhTHh1NDBqZmx0dG9DTHFRM2pjT1g2WnFvOUxscWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 14:00:24 GMT",
        "title": "Ethereum (ETH) Price Prediction for July 21 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe prices of some coins keep rising, while others have returned to the red zone, according to CoinMarketCap.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe rate of Ethereum (ETH) has almost remained the same since yesterday. Over the last week, the price has risen by 9.61%.\n\nImage by TradingView\n\nOn the hourly chart, the price of ETH has made a false breakout of the local support level of $3,483. If the daily bar closes near it, one can expect a blast to the $3,450 zone shortly.\n\nImage by TradingView\n\nOn the bigger time frame, one should pay attention to the nearest level of $3,547. If a breakout happens, the accumulated energy might be enough for a continued upward move to the $3,600-$3,700 range.\n\nImage by TradingView\n\nFrom the midterm point of view, bulls are trying to hold the gained initiative.\n\nIf the weekly candle closes around the current prices, traders may witness a further rise by the end of the month.\n\nEthereum is trading at $3,502 at press time."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOVnZ5bVIwT04tSjJka2tIMWdqSzJ4VUlSWWNldjEyWFl4a3Jzd3A3MUwzWmRZZWhlQkJ0Ymxta3p6d1BBcW5hWTBHZUozTWNrSEMxWV9JYV9hTmFHcmRUdW1RTi1LY2pQbDBhdXNBTkwzdHhReURoSkJNR3g0QXE4MjlEeGtNcWRNZExFMGRGM3B0Q1ZfdV8zVHdqenJVUndtTV91TUt3WENzUTh5OC1aTGVHbGlKWEhoeVYwenVudERRZm1FbE5MRFIzeVV1SVJST3hR0gHYAUFVX3lxTFAtZ1FSems3elhlY2VPLTlELWY4dGJOTl9lZ2VxNlBUSDlpUTBlNGNvdGxwSkhkWWxHMzJFQ3VRZ2lEX2c3U2Qxb2Y1TUtYdXpuYUZlNWN3OElYZmVoUktvS2c3anFjdHRnY1diNV82WGl4LUpVaTZlUk1kWlhLSDZ6S3REM1QzVVpUQ1V5ZkR2ZElXZS1wQUhHdXcxU1RFaEM2TDcyQ0xPaDFobVN0Q2k0VHlKckFFb1BoQXk5Z2ljaGRYTDZjR2Z0LU9qSURfRkF5d3BVUGxyaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC gives final approval for Ethereum ETFs to begin trading - FXStreet",
        "content": "The Securities and Exchange Commission (SEC) approved the S-1 registration statements of spot Ethereum ETF issuers on Monday, making it the second digital asset ETF to go live in the US, according to the latest filings on its website. The approval is also visible across the websites of the various asset managers that applied for the product.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxORm5kSk8yMk9MLWpzUzExQ1p3NFRwTy1HLWYxQnY4T0NLa0RWNkxfVGhZLXRsbEFITG5HUU1IaXNoa1Y3WjR4a0kwdjVqY0ZIX2xVWHJfRGF6cXFHY3dUa0hGaTlDWjREaFVPU1RDS1cxNjhzbmpoZUl2OUJKWnVpdU5jcXF3TTN5SEJudmVUY2dRQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC Officially Approves Spot Ethereum ETF Trading for Tomorrow - Watcher Guru",
        "content": "The SEC has officially approved the trading of Spot Ethereum ETFs for tomorrow, July 23. U.S. regulators have given final approval for the S1 forms for ETFs that hold Ethereum’s ether. The Ether ETFs will be available for trade upon the opening bell.\n\nBREAKING: 🇺🇸 SEC officially approves spot Ethereum ETF trading for tomorrow. — Watcher.Guru (@WatcherGuru) July 22, 2024\n\nThe asset is set to be only the second crypto-based ETF in the United States. Moreover, the market is hopeful it can mirror Bitcoin’s success. The leading cryptocurrency debuted its ETF in January. Just three months later, the BTC reached an all-time high price of $73,000.\n\nThe decision caps a years-long process to get ether ETFs approved by the SEC, giving investors a new crypto asset to invest in. Ether ETF applicants first received 19b-4 form approvals back in May. However, many delays on the SEC’s end in looking over the final documents occurred. Now, we are less than 24 hours away from the first trades of a Spot Ethereum ETF.\n\nAlso Read: Ethereum: Is ETH a Lock for $4,000 After ETF Launch?\n\nHow Will Ethereum Perform Against Bitcoin After Spot ETF Launch?\n\nFurthermore, an interesting note is the timing of the approval. The SEC is greenlighting the launch date of the Ethereum ETF during the biggest Bitcoin conference of the year. This week isn’t just about Bitcoin anymore, as Ethereum is joining the spotlight with its ETF launch tomorrow. BTC and ETH represent the only two cryptocurrencies with an ETF in the US, but more are expected to be launched in the coming year. The first Solana SOL-based ETFs have already gotten applications sent out, and other cryptocurrencies like XRP expect to join the ETF conversation as well.\n\nCboe will house most of the first trading of Ether ETFs, with more exchanges likely jumping in shortly after trading commences. Upon the Ethereum ETFs’ debuts, the entire cryptocurrency market expects to jump as it did following the approval of Bitcoin ETFs in January."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOTVVwR1JCTXJIbUpGcVpOb3d5Y2lfSk95UlpGNk1iWDRsMGE2bEh5MVBGZjVNQmJTbTRNem1kQjk3cllGZHBiNEZFeElIOU1DYXFZYTJ5Ym92Tk1VWnBwcFdDNURZVFl0Uy1mNDZNSXBfWDZfbWJ0bmM0TTIzZXZhSkhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Futures signal a bull market! - Cointribune EN",
        "content": "Sun 21 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum futures market is currently in the spotlight, with recent data indicating a significant increase in open interest. This situation raises questions about the future direction of ETH crypto: are we facing a bullish or bearish trend?\n\nAnalysis of the Ethereum Futures Market\n\nOpen interest for Ethereum futures has recently reached all-time highs, reflecting increased investor confidence in the future rise of ETH prices. A key indicator, the taker buy-sell ratio, shows a strong increase in buy orders. Suggesting a bullish trend for the crypto.\n\nOpen Interest for Ethereum Futures\n\nBinance and Bybit dominate this market with respective open positions of $4.55 billion and $2.4 billion. Significantly influencing price movements. This concentration of activity on a few major crypto platforms can have a noticeable impact on the overall market.\n\nWill ETH Crypto Soon Explode?\n\nBased on funding rates, they can signal excessive optimism if they are high. When funding rates exceed 1.2% per week, it can indicate that the crypto market is overheating and likely to correct. Currently, the funding rate is at 0.04%, or about 0.8% on a weekly basis. This could indicate moderate but noteworthy growth.\n\nExperts agree that ETH could see significant growth in the coming weeks. According to some analyses, ETH price could reach around $6,216.99 by the end of 2024. Other long-term forecasts suggest that ETH could reach up to $40,000 by 2030. These predictions are based on the growing adoption of dApps and continuous improvements in blockchain technology.\n\nCurrent data from the Ethereum futures market shows a moderately bullish trend! Supported by high open interest and an increasing buy ratio. However, investors must remain vigilant for signs of excessive optimism that could precede corrections. By closely monitoring key indicators and staying informed on crypto market trends, investors can better navigate the volatile environment of Ethereum futures.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPMTFFVjJOZF84VjNIVFhfTGd3ejVOQjJFYklRNGM3UnZaWmZqcDdyQ1BXVGd5dTV0RVczM0ZIeDF5ai1FN1lXWGVuLXVabWVzWjZTTHl0dE5sQWRQMFJQSm5lTF9IMkJQRkdWY0J1TXEzSVJnekw0b1dPQUk5dlM5RHJtdG1HS2M2RW9vZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Explodes Past $2K! $14B Volume Signals Massive Surge - Watcher Guru",
        "content": "ETH has surged past $2000 with a $14 billion trading volume, making waves in the market and signaling potential growth.\n\nAlso Read: Five Spot Ethereum ETFs To Launch on July 23, CBOE Says\n\nWhat Drives the $14B Ethereum Surge?\n\nBullish Market Sentiment\n\nHaving a positive market sentiment has been crucial in the ETH’s recent rally. The crypto market has seen a significant shift in investor confidence. The newly-refreshed optimism is shown in the $14 billion trading volume.\n\nTechnical Analysis\n\nEthereum’s price charts show a significant breakthrough. The 24-hour chart shows considerable volatility, with ETH prices going between $3420 and $3560.\n\nSeeing this surge go past key resistance levels has captured the attention of traders, and this could, in turn, attract more market participants.\n\nBroader Crypto Trends\n\nEthereum’s strong performance is a sign that the whole cryptocurrency market is doing well. The 7-day chart shows ETH prices moving between $3,300 and $3,550, showing ongoing interest. Bitcoin’s performance often affects other digital coins, including ETH.\n\nAlso Read: Ethereum: Will ETH ETF Have a Bigger Impact Than Bitcoin Did?\n\nEthereum Network Developments\n\nRecent upgrades to the Ethereum network have been well-received. These improvements aim to make the network faster and more efficient. The move to Ethereum 2.0 is significant, aiming to fix some long-standing issues.\n\nMore Large Investors Joining In\n\nLarge investors are showing more interest in Ethereum. This growing adoption by big financial players helps support ETH’s price and trading volume. When these big players get involved, it’s seen as a sign of trust in Ethereum’s future.\n\nPrice Trajectory and Future Prospects\n\nThe 1-month chart shows more considerable price changes, including a sharp drop in early July from about $3,400 to $2,800, followed by a steady rise. While the current surge is impressive, it’s essential to be careful with cryptocurrency markets as they can change quickly.\n\nETH Price Projections\n\nWhile no one can predict prices with certainty, some experts have suggested the following:\n\nShort-term (1-3 months): ETH might reach $4,000 if it keeps increasing. Medium-term (6-12 months): ETH could hit $5,000-$7,000. Long-term (2-5 years): A few optimistic guesses say ETH could go to $10,000 or higher. Very long-term (5-10 years): Some analysts believe ETH could reach $20,000-$50,000, citing increased adoption, technological advancements, and the growth of decentralized finance (DeFi).\n\nEthereum’s big jump past $2,000 and the $14 billion in trading volume are important milestones.\n\nAlso Read: Shiba Inu and Ethereum: Price Prediction Analysis\n\nWhile the surge and future guesses are exciting, staying cautious is best. As always with cryptocurrencies, be ready for quick changes and market ups and downs."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPbFBZU3hwMXBvbk1CbnFwVnF5MEgzVVdCNDMtYXdTSDd3V1JSTU96WmpMcGFrWmZ1bUpQLWloN3YxZGhjOXNXUUUyN2F5X2hhc1lYWG5yMWsxZDQ0WjJOYWVDVkJKWXgtcVFSdk9JbjgzODNZdlBWUzIwaEUtYnRTSXNpb3lFd3NET1Z3UFFNSkpYQ0E0cEhoNzNtWi1OWUxUc3pzcTljc3A0R2lsSmpyZ2NIbzM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs launch on Tuesday: Will they spark another crypto bull run? - Kitco NEWS",
        "content": "Jordan Finneseth Jordan Finneseth is a Crypto Market Reporter for Kitco Crypto. Coming from a background in Psychology and Human Behavior, he began to focus his attention on the cryptocurrency space in early 2017 after noticing the rapid growth of this emerging market. Since that time, Jordan has worked as a content creator for multiple projects and as a crypto news journalist reporting on the latest developments within the cryptocurrency market. Jordan holds a Master of Science in Clinical/Counseling Psychology and a pair of Bachelor's degrees in Psychology and Environmental Health Science. You can reach out Jordan Finneseth at 1- 514.670.1372.\n\nShare"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQVTUtNlJydmcxMUY1cFROUzRhU3NzTWVEZEM4eEJ6YmRkUTN0WE9Ya1NjRmc4eHp1SWlFVmg0b0VvdjByU1pmU1hJYjJsWHlONEhjSC1Fb2hxWFdCOUZSV0NNcGNJS1BrZHlSQnhVeGlJWkk5QndpVW52TnpWTzA5ZDBR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin: Can Ethereum ETF Arrival Spur BTC to $70,000? - Watcher Guru",
        "content": "With the leading cryptocurrency performing well last week, all eyes are on if Bitcoin can capitalize on the arrival of Spot Ethereum ETFs. The investment products are confirmed to launch Tuesday. Could that serve as the catalyst for Bitcoin returning to the $70,000 mark?\n\nThe asset is currently just 8% away from that notable price point. Over the last seven days, the crypto has increased by more than 7%, according to CoinMarketCap. Bitcoin last surpassed the crucial $70,000 mark in March of this year, reaching an all-time high of $73,000.\n\nSource: Watcher.Guru\n\nAlso Read: Ethereum ETF: BlackRock Reveals 0.25% Fee in Updated Filings\n\nCan Ethereum ETF Lead Bitcoin Back to $70,000?\n\nSpeaking to Bloomberg earlier this month, Kraken executive Thomas Perfumo called the ETH ETF arrival a “rising tides lifts all boast story.” He reiterated that the investment product is “a big deal,” while noting it is set to bring both attention and “capital flows,” to the asset class.\n\nThat could be good news for the leading crypto. Indeed, Bitcoin may continue its positive performance when the Ethereum ETFs debut, as it looks to target $70,000. Although it has retreated slightly, the token reached the $68,000 mark on Monday. That could set the tone for a continued increase.\n\nThe token did fall some on Sunday. US President Joe Biden’s announcement of his withdrawal from the 2024 election led to $159 million being liquidated in futures contracts, according to Coinglass. However, that didn’t stop Bitcoin from facing a notable comeback to its current price.\n\nSource: Watcher.Guru\n\nAlso Read: Donald Trump’s $844K Bitcoin Roundtable: Worth It?\n\nBRN Analyst Valentin Fournier believes market volatility will lead to a price surge. “If this trend persists, Bitcoin could cross $70,000 tomorrow with the launch of Ethereum ETFs,” the analyst told Decrypt. “Although a parabolic acceleration for Bitcoin seems unlikely at this time, positive ETF inflows could sustain the rally longer than previously expected.”\n\nThe ongoing macroeconomic factors could also play a role. Although BTC is not expected to reach the heights it had hit in March, it is still expected to react positively. A surge to $70,000 should not be ruled out by traders. Yet, how long it lasts at that level is the most important question."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNTE5jUUVIYjA1UkQ0MUZCZW1jOWRjUkx3UWhQbndWajVLQmVCc0NvWkwtX2p6VzFDSlhybHV4MDA1WXA4WlNEUE5tZEVkYl9GTEVVVlVtN1dJZnhsSGQyeUJfbWEtbWJ3Z3pWdEVsYXhRRGNYZzljVTVEcTh4Vk5Ta0lSY2xQVFEyUGtiQUJkODhhSkFsLWJRTmx4VDQtSDTSAaQBQVVfeXFMTW9EWGlDeENKTE4wSmNPU193blFEUEdrZ2JsQXpQVUJpSjViVGxMSjJTRTlyUE5BdTUtakpIYVJPbUFlTDdvaFdoSnd3UjVhNXVHdzBXWkV2a0s5VlFOY3VnU2M2aGRMd0x3WlNIV3hodlhZVTZ1bEZtYmxrUzFUWDdHajM4TmFQQklUaDZEZ1hKZXlnY2tGbnJlYUV3Yy00SGFBckQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will Spot ETH ETF Be A Sell The News Event? - CoinGape",
        "content": "The second-largest cryptocurrency is on the brink of making history with the launch of spot Ethereum ETFs in the US. Traders are on high alert with Ethereum price analysis revealing that a breakout above $4,000 could be inbound not to mention the possibility of ETH reaching new record highs.\n\nA notable 2.3% increase in the last seven precedes the launch of ETFs. However, due to resistance at $3,500, bulls must be deliberate when pushing for a breakout. Should whales decide to sell ETH following the event, a short-lived fall to $3,200 may come first before the next major trend reversal.\n\nadvertisement\n\nEthereum Whales Deposit Into Exchanges Ahead Of ETF Launch\n\nThe Chicago Board Options Exchange (CBOE) unveiled last week that five spot exchange-traded funds (ETFs) will start trading on the platform on July 23 with the only condition being “pending regulatory effectiveness.”\n\nIn May, the Securities and Exchange Commission (SEC) licensed rule changes allowing the exchanges to list several spot Ethereum ETFs. Despite the achievement, the agency needed time to sign off on all the operators’ S-1 registration documents.\n\nFollowing last week’s developments, the list of the spot ETH ETFs expected to start trading on Tuesday includes Franklin Ethereum ETF, 21Shares Core Ethereum ETF, VanEck Ethereum ETF, Fidelity Ethereum Fund, and Invesco Galaxy Ethereum ETF.\n\nIn preparation for the live trading, Ether ETF issuers have announced a raft of measures including temporarily waving and discounting fees to gain the first mover advantage.\n\nIt has been estimated the Ethereum ETFs will attract fund inflows in billions over the next few months. With such a trend, Ethereum price could gain tracking taking out the $4,000 resistance in the quest for a new record high above $5,000.\n\nMeanwhile, Ethereum whales seem to preparing for a sell-the-news event considering noticeable blockchain activity in the last 9 days. According to Spot On Chain, two large-volume investors transferred 25,865 ETH worth approximately $89 million to centralized exchanges (CEXs).\n\nThe first investor whose address starts with 0xbec moved 11,965 ETH to Binance worth around $41.4 million at an exchange rate of $3,457. This whale currently holds 51,462 or $180 million, sitting on $29.9 million in profit.\n\nAnother whale, the multisign 0x7d6 transferred 13,900 ETH to OKX, worth roughly $47.6 million at an exchange rate of $3,427. This whale holds 188,070 ETH approximately $657 million spread across 2 wallets.\n\nIn the 9 days ahead of tomorrow’s #Ethereum ETF launch, two giant whales deposited 25,865 $ETH ($89M) to CEX! 1️⃣ Whale 0xbec moved 11,965 $ETH to #Binance at ~$3,457 ($41.4M) in the past 5 days. • Last action: 12hrs ago\n\n• Holding: 51,462 $ETH (~$180M)\n\n• Est. profit: $29.9M… pic.twitter.com/q4Cs8LhkX6 — Spot On Chain (@spotonchain) July 22, 2024\n\nIncreasing exchange deposits often signal incoming selling pressure. Investors transfer their holdings to exchanges intending to sell and what better time to offload the ETH than post ETF launch?\n\nTherefore, Ethereum price analysis would help assess the future of the second-largest cryptocurrency—whether traders should expect a sell-the-news event or a breakout past $4,000.\n\nEthereum Price Analysis: ETH Bulls Gearing Up A Major Breakout\n\nEthereum price is on the cusp of breaching the $3,500 resistance during Europe business hours on Monday. Holding as immediate support is $3,450—a confluence area formed by the Bollinger bands’ middle curve and the 20-day Exponential Moving Average (EMA).\n\nThe yellow band highlights the barrier that bulls must overcome to launch ETH price forecast toward $4,000. Traders would be looking for support above this level and a daily close to ascertain the uptrend’s continuation.\n\nShould whales counter the Ethereum ETF launch, support areas at $3,400 (the grey band) and $3,200 would function as liquidity sources for a stronger rebound to achieve new record highs.\n\nFrequently Asked Questions (FAQs) 1. When will spot Ethereum ETFs start trading? According to the CBOE listings, Ether ETFs will begin trading on July 23, 2024. 2. Are whales preparing to sell the news? Some whales have been transferring ETH to exchanges hinting at incoming selling pressure. The transfers precede the launch of Ether ETFs, risking the expected rally above $4,000. 3. Can Ethereum reach new ATH in July? The launch of Ethereum ETFs is a historical moment for the crypto industry. It has been projected that the products will attract billions of dollars in the coming months. This could fuel ETH price to new all-time highs.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE8zdVFac1huXzF6RFU2OVp3WGdCLWRhVjBQOGoxM1pjcG5hRnRndGNGMDB1UmNkYzNOWG1hMU9zUmE3NlRBY2xQeU5XaXN5S09xUnhQTGIzOVdCUmh3Yzg2Z9IBZkFVX3lxTFBPUGNBMHRPOWNtZVFySlhKbTgtaTA3SXI5Y0dWcVZMS0xoQmdxNFY0cVN2djROcXk3SnExbnpBNmZYTXVBY2VTa1NhQWxacTdKYTloSXJNRkk4M0ZIQ0dDTzYtZVlkUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Whales Buy $440 Million In ETH In One Day, Do They Know Something You Don’t? | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum has been experiencing a prolonged period of bearish price action. The altcoin has been relatively quiet, with its price declining, leaving many investors and traders feeling uncertain. However, a notable bullish proponent continues behind the scenes, indicating a potential shift in market dynamics.\n\nIn the last few days, on-chain data has revealed a significant accumulation pattern for ETH. This bullish catalyst has materialized in the form of whale accumulation, where large investors, commonly called “whales,” have been making substantial purchases of Ethereum. These whales have acquired hundreds of millions of dollars worth of ETH, signaling their anticipation of an imminent price surge.\n\nEthereum Whales Buy $440 Million Worth Of ETH\n\nThis intriguing accumulation pattern was brought to light on social media platform X by renowned crypto analyst Ali Martinez. According to the data shared by Martinez from CryptoQuant, Ethereum whales have recently made a significant move by accumulating 126,000 ETH, valued at approximately $440 million, within a remarkably short span of 48 hours.\n\nThe CryptoQuant analysis chart revealed that this buying trend was primarily driven by addresses holding more than 100,000 ETH each, classifying them as ultra-whales. These ultra-whales represent the most influential and substantial investors in the Ethereum market, and their activities often have a pronounced impact on market trends and investor sentiment.\n\nFurther analysis of the chart indicates a notable increase in the total balance held by this elite group of traders. On June 28, the cumulative holdings of these ultra-whales stood at around 5.1 million ETH. However, by June 30, this figure had surged to over 5.23 million ETH. This upward trajectory in holdings becomes even more pronounced when we consider the balance from an earlier point, which was 5.05 million ETH on July 22.\n\nWhy The Accumulation?\n\nThe accumulation can be attributed to whales positioning themselves for a well-anticipated bull run in light of Spot Ethereum ETFs. Investors are beginning to perceive a shift in these spot ETFs, with collective inflows into other Ethereum ETFs starting to outpace outflows from Grayscale’s ETHE.\n\nThe launch of these Spot Ethereum ETFs has yet to translate into a price rally for Ethereum. Their launch has kicked off a sell-the-news event. Since launch, ETH has experienced a decline of approximately 12.8% and recently bottomed at $3,090. Despite this downturn, many analysts maintain a bullish sentiment for Ethereum. This shows that investor confidence remains strong, even if this sentiment is largely psychological.\n\nAt the time of writing, Ethereum is trading at $3,150. On-chain buying trend shows that many whales are preparing for an altcoin rally that’s set to be spearheaded by Ethereum. On-chain data from CryptoQuant reveals that limit buy order volumes for altcoins are increasing across various exchanges. This has caused the creation of huge buy walls, which in turn reflect preparations for an altcoin rally.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPU2ZLWWV4UzlGdkY3d0xKVXJqNjBFZklQREJJVnEzTF9XOUlMcENJaGtFVVVTd3ZoTzZtZmVYNkF4cUpMZmdDb3VwcU9MSFp6aU1wNy1JcEE5eFVTMUc5dXNaa2dQRmxkQXlBelVHU3dXT0xtVFVzb1preUZ4aFh2YWRic0YycWxNQWVzbEE2V20xVkVmdXBoTVZma9IBoAFBVV95cUxOVGhEMW1BOVIxajJtVmdPaGExWXM4VnhkVk50TmZyVkt5YVhRMXZsZXZFc3F6U2FlOWM1bU1ZT25kc3E1ZjQzOTlpTy04RnJ4dVpsd2xmVnlhckZ5SEU3dFpvaE1tRm5wUDdFdWZkbTRVUjhhQWpWclRocXVsQWl1TUZRSENHcncwdHktOUZXc3FsUHh2MWZWM3BOSEh5THlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Polygon ranks second to Ethereum for tokenized assets – Will it help MATIC? - AMBCrypto News",
        "content": "Polygon network has seen a surge in RWA interest, including a recent ECB trial.\n\nMATIC traction on the price charts has slowed slightly, with $0.51 as a key price level.\n\nPolygon [MATIC] founder Sandeep Nailwal has acknowledged rising Real World Asset (RWA) interest in the Ethereum [ETH] L2 network. His remarks followed the European Central Bank’s (ECB) recent bond issuance trial.\n\n‘So many RWA’s launching on Polygon organically is very encouraging…Polygon POS is already second only to Ethereum mainnet in terms of the RWA value created.’\n\nHowever, according to RWA.xyz data, the statement was overstated. The platform showed that Polygon was the fifth-largest network based on total market cap, especially in the US tokenized securities market.\n\nWill the RWA interest boost MATIC price?\n\nThe rising RWA interest revealed some positive network effects, as denoted by a surge in MATIC’s daily active addresses, per Sentiment data.\n\nAdditionally, the news update on the ECB trial on the network flipped MATIC’s Weighted Sentiment to positive. However, the metric dropped towards the neutral level as of press time, which could dent market sentiment on MATIC.\n\nAt the time of writing, the daily active address also tanked, which could derail further price upside with fewer users engaging with the altcoin.\n\nMATIC recovery cooled off\n\nOn the price front, MATIC surged 3% on 19th July after Nailwal’s remarks. However, MATIC’s overall recovery in July stalled above $0.55 and retraced to $0.51. The mixed reading on key price chart indicators signaled traders’ caution.\n\nNotably, the RSI (Relative Strength Index) recovered but remained muted below the average level (50). It meant that the recent recovery didn’t gather enough buying pressure to guarantee a stronger upside.\n\nAdditionally, CMF (Chaikin Money Flow) was above average but hovered near the equilibrium level, denoting inflows surged but stagnated in the past few days.\n\nThe above readings suggested that MATIC could struggle to break the overhead hurdle and daily order block above $0.55 (red).\n\nHowever, the $0.51 level was also a crucial demand interest level, as shown by the chart and whale order data.\n\nThe bounce at $0.51 was marked by about $26 million in buy orders in the derivatives market on Binance exchange. Additionally, demand surged in the MATIC spot market, with over $500K in bids at the level.\n\nHence, given the whale interest and massive volume at $0.51, it was a crucial level for any MATIC speculator looking for market entry into the altcoin."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNbTYzdVJMWmJiaU8wNmJQYUtBZ0RwNjU0T2g0TFBUTzZ6MnVoeWVzbm5TTGlkUkxrdHB4cjlfN3lDcy1FYU1uZWI1Zjd0TmZlV09sMUdfLXoybnhTYW1iQ04xZ0xKRlUwRU9TelNkaEhmQlNwTElzQ1pCZmMtZG8zdWdKT0xpS0huS3B0MFRhSWFJdEM5eWc0MVMyOXZTWWxnTk1RU3NpTTB5RmI2WFZpcGNaM3Z0SDBPbnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Binance, Ethereum, Solana, and Ripple: The Biggest Crypto News of the Past Week - Cointribune EN",
        "content": "Mon 22 Jul 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nBetween revolutionary announcements, technological developments, and regulatory turmoil, the crypto ecosystem continues to prove that it is both a limitless territory of innovation and a battlefield of regulatory and economic battles. Here is a summary of the most notable news from the past week around Bitcoin, Ethereum, Binance, Solana, and Ripple.\n\nBitcoin surpasses Visa and Mastercard in transaction volume\n\nBitcoin has reached a historic milestone by surpassing Visa and Mastercard in terms of daily transaction volume. According to data from Glassnode, the leading crypto asset recorded a volume of $46.4 billion, compared to $6.5 billion for filtered economic transactions. This surge is due to increasing adoption and innovations such as the Runes protocol. With a market capitalization of about $1.3 trillion, Bitcoin is redefining traditional payment systems.\n\nBinance can invest in US Treasury bonds\n\nThe world’s leading crypto exchange, Binance has received approval to invest customer funds in US Treasury bonds. This strategic decision allows the company to diversify investment options for its users. It offers greater security and stability compared to more volatile crypto assets. The announcement also led to a notable increase in the price of Binance Coin (BNB). This reflects investor confidence in Binance’s fund management and paves the way for similar initiatives.\n\nJD Vance: Trump’s Pro-Bitcoin Running Mate for 2024\n\nDonald Trump has chosen Ohio Senator JD Vance as his running mate for the 2024 presidential election. Vance, known for his support of cryptocurrencies, owns between $100,000 and $250,000 in Bitcoin and advocates for a crypto-friendly legislative framework. This nomination aims to attract the crypto-enthusiast electorate and marks a pro-crypto shift for Trump, who now accepts cryptocurrency donations for his campaign.\n\nThe Ethereum ETF hits the market on July 23\n\nThe long-awaited launch of the first spot Ethereum ETFs is scheduled for July 23, 2024, according to a recent confirmation from the Chicago Board Options Exchange (Cboe). Listed funds include the 21Shares Core Ethereum ETF (CETH) and the Fidelity Ethereum Fund (FETH). These ETFs offer a regulated and secure option to invest in Ethereum. They could attract more institutional investors and strengthen the legitimacy of the crypto market.\n\nWhale transactions destabilize XRP price\n\nRecent massive XRP transactions made by whales have caused significant volatility in the token’s price. After accumulating more than 130 million, these investors managed to push the price of XRP to 63 cents. However, the crypto asset’s price then fell by 8% to around 55.8 cents. These large holders’ significant movements demonstrate their direct impact on the market and the difficulty in maintaining price stability in the short term.\n\nThat’s the essentials to remember for this week. But if you want a more detailed recap and in-depth analysis delivered directly to your inbox, don’t hesitate to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPOHlGQVlBMEVoUDh4a2l5eVdBQzNHcnRId3hCYWxreDJrMlgzREU5eWJrUWJqSGxQNEtfeS1MaXBfc1RsVks3RmJJdmxqdGxiMUl6RUd3b0RzV3hSQjNEdGhNdUVpWmQtRWZ6bFh3eEp6Tnl6bDRyRkhyT3JCTHVHLVhuNV9HazJGWTFFcTZYeGhXTjd4RmRz0gGcAUFVX3lxTE1nRlpiS2gzWTRDTWZFdEhKVFJyTkU4V0pHeW1lOUg3T1dxU1FnWjlZRVEycWVZVEVwbkRIeVBUTGlpTXdIYVNITkI5ZEYzNW9TdFlhaVF2Vm5GS0ZGNlNRYnBVcVZOcXM1SGlxcDRaMGZhbVVrZHRRemVWVERWZ1dfVjBxd0lsaGkxR0V2dWtFemJWcWVVcmFoLTJhRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs See $1.2B Inflow as CBOE Sets Ethereum ETF Launch Date - CryptoPotato",
        "content": "Spot Bitcoin ETFs have racked up around $1.24 billion in inflows over the past week as spot markets recover.\n\nPreliminary figures from Farside Investors suggest that Friday, July 19, saw inflows of $384 million, with Fidelity leading the pack at $140 million inflows.\n\nThis marks eleven consecutive trading days with a positive flow to these institutional investment products. Even Grayscale saw an inflow of $20 million to its GBTC spot ETF on Friday, the first positive flow day for the fund for a week.\n\nEthereum ETF Dates\n\nOn July 19, the CBOE announced that five spot Ethereum ETFs will begin trading on July 23, “pending regulatory effectiveness.”\n\nThe five products set to start trading next week are the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF.\n\nCboe new listings… It’s happening. Almost go time. pic.twitter.com/V1wCcxYoCH — Nate Geraci (@NateGeraci) July 19, 2024\n\nHowever, the Security and Exchange Commission has yet to officially sign off on S-1 documents for the respective funds.\n\nMost of the issuers have stated that they will temporarily waive or discount fees to compete for market share, as reported by CryptoPotato.\n\nAlso, on July 19, Grayscale announced plans to spin off a portion of its flagship Grayscale Bitcoin Trust (GBTC) into a new ETF, the Grayscale Bitcoin Mini Trust (BTC).\n\nThe firm will allocate 10% of its spot Bitcoin ETF assets to the new fund, which is likely to have a more competitive fee structure than the 1.5% charged on GBTC.\n\nMoreover, the firm will do the same thing when its Ethereum product is converted to a spot ETF. Existing ETHE shareholders will receive a proportional distribution of shares in its new Grayscale Ethereum Mini Trust (ETH) on July 31.\n\nOn July 19, Bloomberg ETF analyst James Seyffart said that from a value point of view, “a theoretical person has $1,000 in ETHE or GBTC. After the spinoffs occur, it should essentially be $900 in the original fund and $100 in the new mini ETFs.”\n\nDoing a thread on the situation for @Grayscale‘s spinoff for $ETHE & $ETH because I’ve gotten about a million questions on it. The mechanics will be essentially the same for $GBTC & $BTC spinoff. If you own 1,000 shares of $ETHE, you should receive 1,000 shares of mini $ETH. 1/ pic.twitter.com/Er66mj5L46 — James Seyffart (@JSeyff) July 19, 2024\n\nETHE Exodus?\n\nThere are currently 271,793 BTC worth around $18.2 billion in Grayscale’s GBTC ETF and $9.2 billion in Ethereum in its yet-to-be-converted ETHE fund.\n\nGrayscale’s crypto funds are among the longest-running in the industry, with GBTC launching in 2013 and ETHE in 2017.\n\nThere has been concern about an exodus similar to that from GBTC from ETHE when it gets converted, but distribution to the more competitive Ethereum Mini Trust should alleviate some of the outflow pressure."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYWN2VVlhb3FsbEZDQzRTSHNpSDR3Q3VBM2VtdmV0THhpMS1YU0dsakg2c2habE4taUd4UUJ0WXpVcFpLTXBHaGFYaGRTY3ZmRnlpbURCQTdJaVRYcTRINWRHcXVBRFZ2YmFjcVZSb0hJYzhwQ3NiMTBXdkE0NGlQeWc1QlU2aE5OQmI1cEZTUdIBlAFBVV95cUxOUVgzSG5RWHVJSDJ3Z0lRNHQ3LUR6ZnlFX1lBS2V5LU83LU1yV29xbm5Mc3hUTGVrcW04aEIzY3pUbmlJOFRhbXg2dkdSZXFNZmRSYURSbTN0U1ZDYTNYWmJkc05SRHhoM3duRnBuTkstWm9iQWV5WlA2SjI2TWphUkVKY2VNMHlBbTJka0dkem5vUXlH?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF: Here Is The Last Sign To Watch Ahead of Launch - CoinGape",
        "content": "After months of anticipation and several regulatory hurdles crossed with the United States Securities and Exchange Commission (SEC), the spot Ethereum ETF is set to go live for trading. The eight approved digital products are likely to go live on the Chicago Board Option Exchange (Cboe) and NYSE Arca on July 23.\n\nKey Developments and Expectations\n\nJames Seyffart, Bloomberg Senior ETF Analyst in an explanatory post on X regarding the much anticipated digital asset, shared what investors and stakeholders can expect once spot Ethereum ETF begins trading. One of the notable developments will be on the official website of the SEC.\n\nadvertisement\n\nWhat are we expecting today for the Ethereum ETFs? We expect them to begin trading tomorrow. That means we should see a bunch of filings on SEC site today that say the ETFs’ prospectuses have gone “effective”. Likely after or around market close. Here are the race entrants: pic.twitter.com/AkBxEjBRvv — James Seyffart (@JSeyff) July 22, 2024\n\nAccording to Seyffart, after the close of market on July 22, the SEC website will have to update its platform with new filings. The update will signal to the global community that the ETFs prospectuses are now effective.\n\nNotably, the entrants on the Cboe include Franklin Ethereum ETF, VanEck Ethereum ETF, 21Shares Core Ethereum ETF, Fidelity Ethereum ETF and Invesco Galaxy Ethereum ETF. Each of the aforementioned have a waiver on transaction fees ranging from six months to one year except Invesco Galaxy Ethereum ETF with no waiver granted by the issuer.\n\nAdditionally, the five issuers trading on the Cboe have Coinbase as their custodian with the exception of VanEck Ethereum ETF. Gemini will serve as the custodian for VanEck.\n\nImplications of Spot Ethereum ETF Launch\n\nMeanwhile, Grayscale Ethereum Mini Trust, Bitwise Ethereum ETF and Grayscale Ethereum Trust will be trading on the New York Stock Exchange. The trio also have Coinbase as their custodian.\n\nThe broader crypto community will be keenly watching the milestone event when trading goes live, particularly, investors in Ethereum ETF and how it will impact on the price of ETH. Principally, stakeholders will be interested to see if the development will cause market excitement with visible trading surge.\n\nWhile there have been several bullish predictions for the effect trading of spot Ethereum will have on price, some analysts consider the SEC’s approval and listing for trading a major win already. According to them, this is another giant step towards the legitimization of crypto products.\n\nAt the moment, the price of ETH is priced for $3,469.57, down 1.53% in the past 24 hours.\n\nRead More: Binance Reveals Major Backing For Sam Altman’s Worldcoin, WLD Price To Rally?\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcWJVc3pmNnJtSENFSVhoZHB6NlI0NTFhWWppb3BITUxZRmRXN1E0OFp3bnlvR0JfRjY2WHdwZHQ1UXp1YlRmcnRIdlZVMC1WREpiVXpPcUNSQkZHVWtRbWhzdEdfSVNNX3ZBMG00MmlkQUoxcjlqY0ZwTjBMUF9MOVpUeTFNMWxGdGfSAY8BQVVfeXFMT2ZXUnNfOUJwTkl0ODV1dFZ3WlI2Y3NjbXZzUldpdnlkbDJoS2ZYOTc0amRsd3BnMGE4Wnh2YXRvZ3JWNkV4ZENONk1MakRYVFI0dzluSzJMdkJuVU1MY3VVNl9ZNWZpbXNRdGoxWVd2Tm8ybUxsbVFiaXo5WlI3LUo5ZHhjZlVyX2l0NDVTcTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum’s road to $3.9K – Here’s what can and should not happen! - AMBCrypto News",
        "content": "Ethereum has been on the verge of surging past the $3.5k resistance level over the last five days\n\nTraders can anticipate a rally towards $3.9k, but chances of a bearish reversal thereafter would solidify\n\nEthereum [ETH], at the time of writing, was trading below the $3.5k-$3.6k resistance zone. Its momentum has stalled over the past week. In fact, a recent report revealed that the taker buy-sell ratio fell below 1 too.\n\nThis indicated a reduction in buying pressure in recent days.\n\nThe daily RSI signaled bullish momentum, but the OBV was closer to the lows of a range from May. This was not a good sign for the bulls.\n\nHence, AMBCrypto investigated whether the on-chain metrics leaned bearishly or bullishly.\n\nRecent positive netflows explain stalled momentum\n\nThe exchange netflow data revealed that over the past week, 57.98k ETH flowed into exchanges. Over the past month, 70.11k ETH flowed in.\n\nThis meant more inflows than outflows, which in turn precipitated potentially greater selling pressure in the altcoin’s market.\n\nAdditionally, the in/out of the money graph revealed that by volume, the $3171-$3276 zone was the strongest demand zone.\n\nMeanwhile, the $3.5k and $3.7k resistance levels might pose as opposition to the market’s bulls.\n\nOn-chain metrics underline Ethereum’s stagnancy\n\nThe 180-day mean dollar invested age (MDIA) metric has been trending higher since April. A prolonged uptrend is not welcome as it indicates reduced network activity and investments getting stagnant.\n\nOn the other hand, the development activity has been robust regardless of ETH’s price trend, which long-term investors would appreciate.\n\nThe daily active addresses and network growth saw a spike on 22 June, but both metrics have receded since. The age-consumed metric has also been quiet over the past week.\n\nOverall, the metrics showed that Ethereum would have a tough time climbing past the $3.6k-$3.7k resistance.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis point was reinforced by AMBCrypto’s analysis of the liquidation heatmap. After sweeping the pool of liquidity at $2.8k, Ethereum has rebounded healthily. Two liquidity clusters at $3.7k and $3.9k loomed ahead.\n\nIt could attract prices to them and reverse the trend, just as investors get excited about the potential for Ethereum to break the $4k resistance level."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPNkZzTk95SlhldDBaOTFoR1NwSHBYTGVXNEgxajdYQWZvem9kaC0zelFJRWVJNi1OVngzVFFXck5ua1NrZUJQc0VwVDN4cUhSTjViSV9IZGpZSXhhdWMwYTJGdElpcUY2Q1dkdHVaQ2tHZ0tqT3JDa0Vxc09LemNrb2tmS0FzY2FoQmtWbnoyc9IBlAFBVV95cUxPODZnb1VyNHU2dlZGa21FVmVnbWV1YlZQZUU1UUYzUnJjZmZDS0t2U3NHNHVwUjBKbTlRX3BqbUdNaVpKb3BhTzJBVy1PQ21FcFNEN1dnWE5RSVlqOUc0Y21ldTVqbjlLdXAxZU1oZ2MxOGxqSExOcFp5TVYwdVFCMDEzQVhwUXVrQTN6UUVmSnVUN2RK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Breaking: Mt Gox Set For Large Bitcoin Repayment Ahead Ethereum ETF Launch - CoinGape",
        "content": "Mt Gox, the infamous Bitcoin exchange that collapsed in 2014, appears to be gearing up for a significant repayment to its long-waiting creditors. This development comes at a crucial time, coinciding with the imminent launch of Ethereum ETFs. The intersection of these two events has sparked intense speculation about their potential impact on the crypto market, particularly on Bitcoin and Ethereum prices.\n\nMt Gox Prepares for Major Bitcoin Repayment\n\nAccording to data sourced from Arkham, Mt Gox has recently caught the attention of on-chain analysts with a series of small Bitcoin transfers. The most recent transaction involved 0.021 BTC (valued at approximately $1,390 USD) sent to an address 1C9Vo…t81Fa. This transfer occurred just minutes before the report was issued and mirrors a similar transaction made exactly six days prior.\n\nadvertisement\n\nThese micro-transactions are believed to be part of a testing phase for their transfer capabilities. The duplicate nature of these transactions, both involving 0.021 BTC from a Mt Gox-associated address, was also confirmed by Arkham. Speculations have arisen stating that these small-scale transfers could be a precursor to larger movements.\n\nThe cautious approach adopted is particularly noteworthy given the exchange’s troubled history and the significant assets still under its control. Reports indicate that their related addresses hold approximately 138,000 BTC, currently valued at around $8.91 billion.\n\nAlso Read: Real Bedford FC Purchases Additional $4.5 Million Worth of Bitcoins\n\nEthereum ETF Launch and Market Outlook\n\nThe cryptocurrency market is showing strong signs of recovery, buoyed by bullish sentiment surrounding the anticipated launch of spot Ethereum ETFs on July 23. This optimism has been further fueled by predictions from industry experts like Nate Geraci, president of The ETF Store, who suggests that the market may soon see the filing of a combined spot BTC, ETH, and SOL ETF.\n\nThis development has contributed to the overall positive market sentiment, Bitcoin price surpassed $68,000 but however trades at $67,346.8 and Ethereum price on the other hand rose above $3,550 but has also slightly dropped, trading at $3,496. All these come in anticipation of the spot Ethereum ETF launch. The market’s enthusiasm is reflected in the significant increase in total cryptocurrency trading volume, which has risen by more than 43% over the last 24 hours.\n\nAs the launch date for Ethereum ETFs approaches, market participants are closely watching for potential shifts in investment patterns and regulatory responses that could shape the future of cryptocurrency adoption and integration into traditional financial systems.\n\nAlso Read: Ripple CTO David Schwartz Bets on Joe Biden’s Replacement for Crypto Vote\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMirgJBVV95cUxPbGw3cVNsWWpURWZreG5FbGQxNDJLTkVFQVVJbWplci10bzBVZWZJVGplRlF6dFdiUHpZQlY2YWoyV1lSWjBlNWRqbm1xMDRtdmRMOUxsSHplTF9pWl9DYWRjbUxYcHpyWHcxUXdlZzFwckxVNlF6WVlXY0k4UzdLcGVaTi1NNXg1c2hyUWFJc2wtR2J4eFhUU0NFV0lyNFRhY2JNUU5LclFlVVFTWXc0dTdGTU9DWGVjS2VzMGhhalJNWnBkLWt4Z3hmb1RQRGtOUnJJOWNSSUxhcWl5VjNDWnp4blZodjNKV3JNR2tSTlRQTVRWamtWREdJbnBZVFRfVTN6d3ZySmZNbTJkUEswR3RPUG1NUlJ2WEszdmRZLWFDZWNMWlRiUURRM2lCQdIBuwJBVV95cUxQd0Y5aVpjNW15R3U5ZDlSQ052QWoycWZJNlJKSWYwRmZ1ekhVY3RhYVBOd29qVW5xa1RBbnlqUU13Q3FIc00wSEVrTWpHQnRZMGVkTkR3d1czRjIxemNzaFNBTVZJbC1mR05OZEdVOTRKVE93NmhZaDVwdDNsSzl5V1NNY2lyaEdydkdNZVg1cktaOHpwM0ZjYmthb2dza3VTN01PdVQxWTNnQlpNWjd6NTl6Ni11VnpMamVMS1dPODYzMnJJaFd5V3gtYm5LR0VmTFdPUl9oWWlvclpCeUxKb2hONHdlQlFFalhucE81LWZ0UHBESFA0YlVRVDVIQ20tVUJzWWZleWFkS1JhS01VODFCYURxSDRkQ1g5LWk1NE15SEx6MWwwakdGWGlzdkpOS09aOVlnOEJhdHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Poised for Breakout as It Expects an Important Week of ETF Decision Amid SEC Commodity Classification - Bulls Target $4K by July End - Analytics Insight",
        "content": "This classification is of great significance for the cryptocurrency industry and this will allow other crypto assets to possibly change their regulatory status over time giving some reprieve to founders and investors in this space.\n\nSeveral economic indicators and regulatory developments are expected this week making it a crucial one for the cryptocurrency market. There is particular excitement around the SEC pending decision regarding spot Ethereum ETF approval. Moreover increased expectations on US Q2 GDP growth from 1.4% to 1.9% could add more fuel to investor optimism.\n\nETH Technical Analysis\n\nEthereum's price action has been dynamic in recent weeks. After reaching a high of $3,973 on May 27th ETH experienced a breakdown from a bullish flag pattern temporarily invalidating the short-term bullish pressure. The price found support around $2,809.41 on July 5th creating a low point."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1VLTFTQUVsbS1KVjRCRE5iWDFBdDRodTNvc05qcnNIdjhnU3U3dzQ5OXhRaUVFS0hHZ1hVVlVRdW9FSGtzY2V2ZUpIR1FsX1Vyem1WSGhnUUc5eGN2RTRBaWZaVGpVcGRxcHVyVnFkQWo5QdIBd0FVX3lxTE45MWJuZHpZbl9jVDFWazJ4ZFFFZ1c5cDV5cnE0ZDJENVhZLUVFdXNVTnl6UERqbmcybmRmd0JJV2c0MGlkYjdCcVBFc0dwMXZaY1ZyNzNoeS1lRS1kSk9yRjZfdzgtR0VxWmlpbjdfdHJyWHFFb0F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 03:31:06 GMT",
        "title": "Ethereum Price Climbs: Will It Challenge the $3,700 Mark Again? - NewsBTC",
        "content": "Ethereum price started a downside correction from the $3,500 resistance zone. ETH declined below $3,440 and might struggle to stay above $3,380.\n\nEthereum is moving higher above the $3,500 zone.\n\nThe price is trading above $3,520 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bullish trend line forming with support at $3,450 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise if there is a clear move above the $3,565 resistance zone.\n\nEthereum Price Reclaims $3,500\n\nEthereum price remained in a bullish zone above the $3,350 resistance zone. ETH extended its increase above the $3,500 resistance but lagged Bitcoin. There was a spike above the $3,550 level and the price traded as high as $3,563.\n\nIt is now consolidating gains near the 23.6% Fib retracement level of the upward move from the $3,412 swing low to the $3,563 high. Ethereum is now trading above $3,500 and the 100-hourly Simple Moving Average.\n\nThere is also a connecting bullish trend line forming with support at $3,450 on the hourly chart of ETH/USD. The trend line is close to the 76.4% Fib retracement level of the upward move from the $3,412 swing low to the $3,563 high.\n\nIf the price stays above the 100-hourly Simple Moving Average, it could attempt a fresh increase. On the upside, the price is facing resistance near the $3,550 level. The first major resistance is near the $3,580 level. The next major hurdle is near the $3,650 level.\n\nA close above the $3,650 level might send Ether toward the $3,700 resistance. The next key resistance is near $3,720. An upside break above the $3,720 resistance might send the price higher toward the $3,800 resistance zone in the coming days.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could start a downside correction. Initial support on the downside is near $3,500. The first major support sits near the $3,470 zone and the 100-hourly Simple Moving Average.\n\nA clear move below the $3,470 support might push the price toward $3,440. Any more losses might send the price toward the $3,350 support level in the near term. The next key support sits at $3,320.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,500\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5QSnJWcVQ5OVF3b2JkcmVNNkFGR2QzRE4yTjk0UC1wLXB3Ykl5b09KRzZSNHNzNGdRLURyZnBhSTFVd2lvZlNSdTZ2QjBkU1k5T09PdDgyUDhhQzhkaWlPMVRQNG9TNDJjQnJ4YV8zeEhYT3YyYW01WTdyR3Jsd9IBgwFBVV95cUxQNWxVSVktV1lkeDJEVGgtOHE2Q1VEYnpGWUs5VElrdWw3dlJlRnVydzR0MnNXMm1ldjZUNnRIcGZ3bHExY3RvM0tIeU80d1FFQ0JLWFZIN1RKVXh5a0RJX1JKRUE2MTBHN0lNRHRoTWs1Yy1tT2VPX2otUDN4b29LcHgwSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Solana Joins “Big Three” Cryptocurrencies as Spot ETF Hopes Rise - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Crypto market will see a Trio of combined Spot ETFs for BTC, ETH, and SOL soon.\n\nSpot crypto ETFs have rapidly drawn billions from investors, reflecting high interest.\n\nCombined ETFs could offer diversified exposure, increasing demand and reducing risk.\n\nSolana (SOL), the fifth-largest cryptocurrency by market cap, has established itself alongside Bitcoin and Ethereum as part of crypto’s Big Three. With Bitcoin and Ethereum already having spot ETFs or about to launch them, it’s likely that Solana will get one too. This could significantly impact SOL, potentially even greater than what we’ve seen with Bitcoin and Ethereum.\n\n\n\nNate Geraci, President of The ETF Store, has speculated that issuers might soon pursue a combination of spot ETFs encompassing Bitcoin (BTC), Ethereum (ETH), and Solana (SOL). This prediction highlights the growing anticipation surrounding multi-crypto ETFs.\n\nCould this be the next big thing?\n\nThe Surge of Spot Crypto ETFs\n\n2024 has been a landmark year for spot crypto ETFs, which have captivated the market and attracted billions from eager investors. The approval of spot Bitcoin ETFs on January 11 injected fresh optimism into the crypto space, paving the way for similar offerings for Ethereum. The success of Bitcoin ETFs has not only sparked increased investor interest in Ethereum but has also driven Bitcoin prices up to $74,000.\n\nWith Bitcoin and Ethereum ETFs launched, more crypto exchange-traded products are now possible, including a potential ETF for Solana. The success of these initial ETFs shows that investors are eager for more options and managed crypto investments.\n\nThe Industry is Changing\n\nIn a recent tweet post, Nate Geraci, president of The ETF Store, believes that issuers may soon apply for combination spot ETFs that include major cryptocurrencies such as Bitcoin, Ethereum, and Solana.\n\nPrediction…\n\n\n\nAn ETF issuer will file for combined spot btc, eth, & sol ETF in next few months.\n\n\n\nWe’re quickly heading down path towards index-based & actively managed crypto ETFs. — Nate Geraci (@NateGeraci) July 22, 2024\n\nThis move is expected to offer investors a diversified exposure to the top-performing digital assets, reflecting the growing interest and maturity in the crypto market.\n\nGeraci further noted that the ETF industry is swiftly moving towards the adoption of both index-based and actively managed cryptocurrency ETFs. This transition reflects a growing demand for diversified and strategically managed crypto investment options.\n\nBy combining major cryptocurrencies like Bitcoin, Ethereum, and Solana into a single ETF, investors would gain exposure to a broader range of assets, potentially reducing risk and increasing investment appeal.\n\nPositive Signs for the Markets\n\nThe rise of crypto ETFs marks a big shift, changing the view of crypto from just a speculative asset to a key part of investment portfolios. More involvement from financial institutions adds credibility to crypto assets.\n\nThis positive development has boosted the crypto market, with Bitcoin trading at $67,878. Meanwhile, Ethereum is hovering around $3,514, and Solana is trading at $181.\n\nAlso Check Out: SOL Price Prediction: Post 40% Jump, Solana Eyes $200 Break To Hit $250!\n\nSolana is gaining traction. Do you see it as a solid investment? Let us know."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdG9pNjYwQzRsdXpsMHVrV2F4bXptUF9mUEQyb0VFSHNaSXBpU1hZdjJwU3hyZmt4WHVJNDdzc1RZREs5QkJxR1pHWjRzbnp6emZUc0JhUDRrZjlsZ3FIUmVEMGRBQ3ZneWd0UTZmbzh3ZlJNUEVKa1NfTjVmNzhWRE81a2VnWEdoVFQw0gGQAUFVX3lxTE5LV3hsdVl2enE1c2VSSjlOOFV4bHNCVi1faXlmbGhraUxqVWZmaXNMbzdQREFQM3o1R0RBeFdIZ2Y5Tm5aczNLdllQblVnS1JwWERCMDRoenNOck0tc0wwOUtnRW1qZnl1R0c4cGRfVlZLTHFEby1ZWGF6WHotVWFaVDVSUTRzLW5SZjJEbHZ2Tw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Clear NYSE Arca Hurdle, Await SEC Green Light - CoinChapter",
        "content": "Ethereum ETF\n\nYEREVAN (CoinChapter.com) — The NYSE Arca has approved the listing and trading of spot Ethereum exchange-traded funds (ETFs) from Grayscale and Bitwise. According to documents filed with the United States Securities and Exchange Commission (SEC) on July 22, the exchange has certified “its approval for listing and registration of the common units” of Grayscale Ethereum Trust and Bitwise Ethereum ETF.\n\nNYSE Arca Approval Notice. Source: NYSE Arca Certification Letter, July 22, 2024\n\nHowever, these funds are still waiting for the SEC’s final authorization. Analysts expect the launch to happen on July 23, pending the SEC’s approval of the initial securities registration S-1 forms. Bloomberg ETF analyst James Seyffart mentioned on X,\n\n“We expect them to begin trading tomorrow. That means we should see a bunch of filings on the SEC site today that say the ETFs’ prospectuses have gone ‘effective.’”\n\nETH ETFs Trading Tomorrow. Source: James Seyffart\n\nCBOE Confirms Launch of Five New Ethereum ETFs Pending SEC Approval\n\nOn July 19, the Chicago Board Options Exchange confirmed the launch of five more Ethereum ETFs for trading. These include the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF. These funds are also waiting for regulatory effectiveness from the SEC.\n\nThe approval of these ETFs marks a new phase in the crypto market. The SEC must greenlight the funds’ initial securities registration S-1 forms before they can start trading. On May 23, the agency approved the issuers’ 19-b form proposing rule changes.\n\nHow to Buy Ether ETFs: Options and Fees for Investors\n\nOnce approved, retail investors can purchase Ether ETFs through brokerages that list these funds, such as Robinhood or Fidelity. The process is similar to buying and trading other ETFs and stocks. The management fees for most Ether ETFs will range from 0.15% to 0.25%.\n\nEthereum ETFs Fee Structure and Details. Source: James Seyffart\n\nRising Institutional Demand Boosts Ethereum Price and Market Activity\n\nInstitutional demand for ETH could lead to a supply shortage. A recent report from Kaiko highlighted that Ether’s 1% market depth is low, indicating reduced liquidity. This could result in increased price volatility and drive ETH’s price higher amid rising demand.\n\nThe cryptocurrency Ethereum (ETH) is trading at $3,474.83, up 1.54% over the past 24 hours. The market cap is $417,773,194,543, and the 24-hour trading volume is $20,443,172,102, which has increased by 97.18%. The circulating supply of Ethereum is 120,228,315 ETH.\n\nEthereum Price Surge Details. Source: CoinMarketCap\n\nBloomberg ETF analyst Eric Balchunas commented,"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxONm1nd0VFZzY4RXE2cmFBZkEzeGJSUFZjTGZhTkNyNzVKZXpsRFQxbWNJVTd4Z2pQTXhMTzVtcmc3bFptb0h5eGNXdGpXRTdVSF91MU5Wb09Xb0VHZnNYMV9qZDFnQW9nYk84WXdOU2cyZDZFYjJ2QlZFRGlHVkxpSjFJRmZPcEp2MmprdGV2cHdfbGdRWFlYMHl6Z21HRjRNekVVYWZZOHFDWDk1cFo5UmZoRlFETE1kYjlnMi02N3dlNjRacjMybUlfR2RJbUFqRjItU05n0gHbAUFVX3lxTE5PUy1BaGtTdVpJX0Z5R2s2UVpIMG1ELXVKWkcxN2t0dXNlZF9jWWxOcGhDa2x6TGZxREo2M2ltaWdDODVhekhBRGhNSkFUUlVXUk8xR21iOHlCUVZrSGtxeXpmWE5ucjZMQWUwQnpxTDlUSENBd1JNdjlvakk1WVd4YjZ1bTd3UkNsSjg4Q1FNU1l4eUZxMi0xMkNndFh2NXNYWGZJZnFGVjR2a1BEMnY0c1B3NWtVRjhqd2M0c1NaQVJwNlE4enZLbDNKYXhPd0RlYlFtcWwxakFrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch is Just a Few Moments Away: Will This Be the Turning Point for the ETH Price Rally? - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nEthereum ETF Launch is Just a Few Moments Away: Will This Be the Turning Point for the ETH Price Rally?\n\nStory Highlights The spot Ethereum ETF is expected to launch in the next 24 hours, while the ETH price consolidated below $3500\n\nThe historical pattern suggests the price has experienced a significant drop after each event and hence a similar pattern is feared to reciprocate\n\nThe Ethereum price is testing one of the crucial supports after the bears intensified their activity since the start of the day. Besides the market, participants remain vigilant ahead of the spot Ethereum ETF launch as they continue to hold crucial support. With this, the possibility of a major swing continues to prevail over the Ethereum price rally, but at the same time, the probability of a fakeout also haunts the rally.\n\nThe weekly chart displays that the price continues to trade within a pattern and hence it suggests that one final dip may begin a parabolic run towards a new ATH, maybe to a 5-digit figure. The ETH ETF is set to go live in the next 48 hours, and the sentiments have absorbed the Bitcoin selloff from the German government. Therefore, the launch is expected could bring new money and energy into the crypto space. Amid the bullish sentiments, is the ETH price prone to a pullback before the launch?\n\nAfter the bullish weekend close, the ETH price reached one of the crucial price zones which may trigger a 30% rise as it happened earlier in February. Previously, the price marked a pivotal resistance and consolidated for a range which triggered a massive run to mark a yearly high above $4000. Therefore, the upcoming price action suggests, that even if the price breaks the support at $3486, it may drag the price with a small range as the bulls could hold a strong base at $3350.\n\nThe MACD is displaying a drop in the selling pressure but the DMI is neutral, remaining within the bearish range. Although the +Di & -Di underwent a bullish close, the levels failed to maintain an ascending trend while the ADX continued to trade towards the south. On the other hand, the Ichimoku cloud is close to turning bullish which is flashing huge bullish signals for the upcoming ETH price rally.\n\nThe launch of the spot ETH ETF is expected to have a nominal impact on its price and also on the entire market. However, after a small pullback, the journey towards a new ATH above $5000 may be imminent."
    }
]