[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdG1DcU0xM3dBd1dlWm9SSTIwdVVUN1FEbi1PTE8wOGZCOW9JbEgtcnlfeGtyZ3BmUFI4S3JZX2NWU0xLNEJUQXczek85eFZsUEdpTU9ydldyUnF4V2hrWTFXLWVEYUpJd3l4d1k2d09TQ1pzNE9oWFd1UFp6VldRWlpZRm43amUxd25j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Slipped Over the Weekend - Yahoo Finance",
        "content": "In the cryptocurrency world, Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH) and Dogecoin (CRYPTO: DOGE) remain three of the most-watched tokens for good reason. Unfortunately, onlookers have seen mostly downside price action over the weekend. Since market close on Friday, these three top digital assets have sunk 4.2%, 2.5% and 11.2%, respectively, as of 12:45 p.m. ET on Monday.\n\nAn initial sharp decline was seen in all three tokens in early Saturday trading, in line with the reported escalation of the ongoing conflict between Iran and Israel. While each of these three tokens has made up some of this weekend's initial losses, it's clear that cryptocurrency is not immune from the geopolitical forces driving capital in and out of assets in times of uncertainty.\n\nThese moves are also significant because they come ahead of this week's expected Bitcoin halving, in which block rewards for miners will be cut in half. Typically, previous halvings have resulted in a booming price, which has bled into other crypto assets as well.\n\nBut given the anticipation around this rise, as well as capital inflows into spot Bitcoin ETFs, some investors appear to be betting that much of this rally might have already taken place, leading to caution heading into this key catalyst.\n\nLet's dive into some other key factors to consider when it comes to these three top tokens and their price action today.\n\nWhy all the negativity in the large-cap crypto space?\n\nBitcoin's move is perhaps most important to watch, as the largest cryptocurrency in the world heads into its latest halving, expected to take place on or about April 20. We'll have to see how the network responds, and how investors value the network as its inflation rate is halved yet again.\n\nThe fact that Bitcoin did not rise on increased Iran-Israel tensions suggests that investors are continuing to view it more as a risk asset and less as a hedge against uncertainty. We'll have to see if this narrative shifts, particularly if some response from Israel is seen in the coming days.\n\nEthereum's move, while negative, has been the strongest of the three over the weekend. This is likely due to news that the Securities and Exchange Commission (SEC) has approved applications from three Chinese companies to list Bitcoin and Ethereum spot ETFs in Hong Kong.\n\nNo official report from the SEC has been released, but this could signal that a spot Ethereum ETF approval in the U.S. is likely to be seen in short order. For now, overarching macro concerns appear to be stealing the spotlight from this otherwise positive catalyst. I would expect Ethereum to continue to outperform its fellow large-cap tokens in the coming weeks, as investors price this catalyst in.\n\nStory continues\n\nDogecoin's double-digit move lower over the weekend once again exemplifies this token's nature as a high-risk and high-leverage bet on momentum within the crypto space. A lack of any meaningful rhetoric from Elon Musk (and negative sentiment building around Tesla and its recent layoffs and full self-driving announcements) have investors seemingly looking for other options in the crypto realm right now.\n\nIs there upside on the horizon this week?\n\nCertainly, there are a number of bullish catalysts that could take these three top tokens higher this week. The Bitcoin halving and the reported approvals of spot Ethereum ETFs should be broadly bullish for the top two cryptos by market capitalization (and Dogecoin by default).\n\nThe thing is, uncertainty remains high right now, and investors remain on edge waiting to see if we're heading into yet another war. The feeling in financial markets is glum right now, meaning these catalysts could be overshadowed by this overarching sentiment, at least in the short term.\n\nIt will be interesting to see how these top tokens perform next weekend, as additional news arises around the two aforementioned key catalysts every crypto investor is watching right now.\n\nShould you invest $1,000 in Bitcoin right now?\n\nBefore you buy stock in Bitcoin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of April 15, 2024\n\nChris MacDonald has positions in Ethereum. The Motley Fool has positions in and recommends Bitcoin, Ethereum, and Tesla. The Motley Fool has a disclosure policy.\n\nWhy Bitcoin, Ethereum, and Dogecoin Slipped Over the Weekend was originally published by The Motley Fool"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBHREdHb0tKUGoyVmI5LUNkWS1UUlRjZGV5SU1ldno2ZWVSdnU4LTRfRmtOSWJtdjdraFQwM1g3RzJIXzM4VGtqOEd3UVRXZmJaUW5WMUJzTXdBZUtUX0ttVzhmVUxrZXR4UllmUzNYcXFtNUVfWERYONIBfkFVX3lxTFA1Vkh5SXZKZlNkU1YzR1dEcHlySmhpX0FUMk9NTnpaY19xbDA1Qnd0NGw2ZkFLb05nUG1HZTlGZmlNQjlfTzZydkw3bEF5SzRweVJVckwyeTdPZjlhSm9PUTFUTk5ReDFOZ2FuTFdjbWNKWmZRb1E1TGtuOHpTUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Whales Buying Ethereum Like Crazy Amid ETH Price Drop - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn the midst of heightened global tensions, the cryptocurrency market witnessed a significant downturn, with the TOTAL index plummeting by a staggering 17% over the weekend, marking a loss of nearly $430 billion in market capitalization. While this turbulence affected all digital assets, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, took a notable hit, experiencing an 18.43% decline, reaching a low of $2,852 per Ethereum.\n\nAdvertisement\n\nHowever, amid the market chaos, a fascinating trend emerged – prominent players in the crypto sphere, often referred to as \"whales,\" showed unwavering confidence in Ethereum's potential. Notably, large addresses were observed accumulating substantial amounts of ETH during the price drop.\n\nETH to USD by CoinMarketCap\n\nWhale activities\n\nOne such whale, identified as \"0xE34,\" seized the opportunity to accumulate 1,000 ETH, worth approximately $3.15 million, from Binance at the market's lowest point. This particular address went on to accumulate an impressive 8,300 ETH, valued at around $25.12 million.\n\nAdvertisement\n\nFurthermore, another significant player, a wallet associated with Matrixport, made a decisive move by withdrawing 16,300 ETH, amounting to a staggering $51.1 million, from Binance amid the market turmoil. This wallet has been consistently withdrawing ETH from exchanges since March 29, accumulating a total of 67,286 ETH, valued at approximately $228.33 million, at an average price of $3,393.\n\nMatrixport, a prominent player in the crypto financial services sector, has been actively involved in facilitating digital asset management and trading for institutional and retail investors globally.\n\nThese substantial purchases of Ethereum during a period of market instability highlight the confidence of several major players in the potential of the leading altcoin. Despite geopolitical uncertainties and market volatility, Ethereum continues to maintain bullish sentiment among key holders."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbzVWNUFqQXVVdDYxWENEZ1B0TC1JU3V5ZlBWbWpnbnVVY2RNQVNPemhFalFndzNNN1pYV2hQMUd6OU5rLWZsYUs1T3hvb2dJYjYyTEYyYmMxTkxDckphX1BYNXRoX3ZhSGR0aHVBdnpuMFdWMjVBdGduUjdwMk9jdUJuVXkwSVdZZ0hFX0k3YUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s EIP-3074 ‘upgrade’ could let wallet makers steal your money - Protos",
        "content": "With momentum carried over from the relatively smooth hard fork upgrades Shapella (Shanghai+Capella) and Dencun (Deneb+Cancun), Ethereum’s next hard fork was supposed to be a breeze. Nevertheless, several analysts are waving red flags about one of its code changes, EIP-3074.\n\nThrough EIP-3074, Pectra will introduce codes that permit users to delegate all of their Ethereum assets to so-called Invokers — externally owned accounts (EOA) that users must trust to not steal their money.\n\nFollowing the naming convention of ‘star + city portmanteau,’ the upcoming hard fork Pectra (Electra+Prague) will introduce two new operation codes: AUTH and AUTHCALL. Together, these codes make up Ethereum Improvement Proposal number 3074 (EIP-3074).\n\nThe two codes are easy to understand. AUTH delegates power to an Invoker to conduct transactions while AUTHCALL calls that prior authorization to conduct subsequent transactions using that authorization.\n\nIncredibly — and for the first time in Ethereum’s history — these two codes allow a third-party entity to send or transact Ethereum assets, including NFTs and ERC-20 tokens like USDC, inside your wallet forever. Unless developers modify the EIP before Ethereum hard forks later this year, the delegated powers remain with the Invoker permanently.\n\nRead more: Ethereum Foundation ditches ‘warrant canary’\n\nEIP-3074 gives wallet makers even more power\n\nAlthough further details of the AUTH and AUTHCALL codes are quite technical, a final item of general importance to most crypto participants is EIP-3074’s entrusting of unprecedented powers to wallet makers.\n\nBecause Ethereum developers realize the expansive and permanent power of AUTH instructions to the Ethereum Virtual Machine (EVM), they have decided to limit the EOAs to which users may delegate their assets. Specifically, they have proposed limiting EOAs to a whitelist maintained by pre-approved wallet providers like MetaMask.\n\nThe solution to this blockchain problem? Trusted third-parties.\n\nEIP-3074: Trust us, bro.\n\nChainArgos CEO Jonathan Reiter explained Invokers’ newfound powers in EIP-3074 even more explicitly, saying, “I delegate authority over my account to an Invoker — something that can now call code over my assets — and that thing now has the ability to do stuff with my assets. And there’s no way to revoke that delegation… The problem here is, because you can’t revoke it, if I delegate to a contract — even if I think that contract is okay today — if it’s upgradeable, they can steal my tokens in the future.”\n\nSecurity researchers and auditors have raised similar concerns. Indeed, it’s not enough for the user to simply ensure that they delegate only to presently trustworthy EOAs. If those EOAs are upgradeable smart contracts, the owner of those EOAs’ private keys could swap honest code for malicious code in the future.\n\nWorse, even if an EOA is immutable, if that EOA interacts with additional smart contracts and those third-party smart contracts are upgradeable, EIP-3074 could expose users’ assets to theft via malicious, third-party code upgrades in the future.\n\nRead more: Blast L2 hack prompts debate over centralization of Ethereum rollups\n\nWhy are we further empowering the most powerful?\n\nGiven all of these risks, what exactly is the point of EIP-3074 in the first place? Mostly, in the opinion of co-author Matt Garnett, the code will save users time and money — assuming Invokers stay honest. Consider a first-timer’s experience using Uniswap. First they must manually sign to authorize Uniswap. Then they need to pay to activate ETH on Uniswap before signing up and paying gas to activate USDC. Then they sign and pay gas to swap ETH for USDC and if more assets are involved, each one must also be activated with a separate signature and gas fee.\n\nIn the post-Pectra hard fork world, many of these signatures and gas payments could consolidate. For the user, they would only sign once to AUTH an Invoker with permission to perpetually trade their ETH or USDC on their behalf — without subsequent signatures.\n\nIn summary, EIP-3074 adds more trust and power with centralized and already quite powerful corporations like MetaMask by Consensys. Unless developers rethink this software change, the upgrade will entice users to entrust perpetual authority with third-party Invokers. These entities may now control users’ wallets and might, by way of their own or third-party smart contract upgrades, change the rules of the game in the future to simply steal users’ money.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE5ILTNIakF4RFFkNEVUYnZnMnI4YVdLX3FOdjNYUHQzN2hvalVuZVVGdTBESktjZ2FWazBCV3o2dUZCU0lSZC1zZ1FQejJRWTdiT3pidmZ6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum: will SOL's growth threaten ETH dominance? - OKX",
        "content": "With teams debuting their shiny new crypto projects every other week, navigating the world of crypto can be overwhelming for newcomers to the space. As you start to build a long-term, high-conviction trading strategy, it's likely you'll be researching prolific projects at the forefront of blockchain technology.\n\nOf today's crypto market leaders, two similar technologies that deserve exploring are major Layer 1 players Solana and Ethereum. As both Solana and Ethereum represent established Layer 1 blockchains backed by passionate communities and vibrant ecosystems, it can be difficult to separate the two given their strengths and unique selling points.\n\nEager for clarity? This guide aims to provide an objective comparison of Solana vs Ethereum as we demystify their technical attributes and explore what differentiates them. From exploring how each Layer 1 blockchain fares against the blockchain trilemma to understanding their future developments, here's everything you need to know when comparing Solana and Ethereum.\n\nWhat is Ethereum?\n\nLaunched in 2015, Ethereum is the first blockchain platform to popularize smart contracts and self-executing programs that power decentralized applications (DApps). The leap forward with autonomous smart contracts sparked a wave of development in the decentralized space and established Ethereum as a DeFi pioneer, where users can borrow, lend, and trade crypto without relying on traditional financial institutions. Beyond DeFi, Ethereum's robust ecosystem encourages fresh innovation across various sectors, ranging from NFTs and GameFi to real-world asset (RWA) marketplaces and prediction markets. Overall, Ethereum's established developer community, strong security measures, and ever-evolving feature set solidify its position as a leading force in the blockchain world.\n\nWhat is Solana?\n\nA next-generation blockchain that improves upon the innovations of its predecessors, Solana debuted in 2017 amid scalability bottlenecks and rose to prominence because of its Proof of History (PoH) function. By timestamping transactions in a decentralized manner, Solana nodes can organize transactions more efficiently, leading to rapid confirmation times and affordable gas fees. This makes Solana a haven for fast-paced DApps that demand high transaction throughput. Beyond speed and affordability, Solana boasts a vibrant developer community drawn to its user-friendly programming languages and its potential for on-chain scaling solutions. This dev-first focus has fueled the creation of innovative projects within the Solana ecosystem, including play-to-earn games with immersive experiences and serialized NFT projects that allow ongoing content updates.\n\nHow Ethereum and Solana fare against the blockchain trilemma\n\nBefore diving into our Solana vs Ethereum comparison, it's important to first understand the concept of the blockchain trilemma. In short, the blockchain trilemma is a concept coined by Ethereum co-founder Vitalik Buterin that suggests developers for decentralized blockchains will encounter three main factors: security, decentralization, and scalability.\n\nDespite their best efforts, developers will be forced to sacrifice one factor as a trade-off to meet the needs of the other two factors. One example of this would be Bitcoin. Known for its high level of security and decentralization, Bitcoin is often seen as the gold standard among decentralized networks. However, Bitcoin struggles with scalability, meaning it can only process a limited number of transactions per second. This is a major drawback for widespread Bitcoin mainstream adoption, as it can lead to slow transaction times and high fees.\n\nUltimately, understanding the blockchain trilemma is essential for evaluating different blockchain projects. Each project makes its own trade-offs between the three core principles mentioned above, and the ideal choice for you'll depend on your specific needs and priorities. Now that we have a clear understanding of the blockchain trilemma, let's dive into the security, decentralization, and scalability of Ethereum and Solana to see how these popular blockchains fare against such metrics.\n\nSecurity\n\nBoth Ethereum and Solana prioritize security, employing robust mechanisms to safeguard user funds and network integrity. In both cases, validators stake their own tokens (ETH for Ethereum, SOL for Solana) to verify transactions. The potential loss of their staked tokens incentivizes validators to act honestly, as malicious behavior could result in penalties and loss of their stake. Ethereum's long history and battle-tested security measures inspire confidence in many users, but it's important to remember that security for any blockchain is an ongoing process, and vulnerabilities can still emerge. However, their approaches differ in their nuance of Proof of Stake (PoS) implementation. Ethereum's current PoS implementation is still under development compared to some established PoS blockchains, while Solana's PoS applies PoH alongside it.\n\nEthereum's security\n\nEthereum's current security relies on PoS, a consensus mechanism where validators stake their own ETH tokens to verify transactions. The potential loss of their staked tokens incentivizes validators to act honestly, as malicious behavior could result in penalties and loss of their stake. While the PoS implementation is a recent development, Ethereum's history with its previous Proof of Work (PoW) system and the ongoing security audits and improvements during its transition to PoS inspire confidence in its ability to protect user funds and network integrity. This established track record is a major advantage for users who prioritize a security model that's been thoroughly tested and refined over time.\n\nSolana's security\n\nSolana leverages a unique combination of PoH and delegated PoS (DPos) for security. PoH creates a verifiable record of time between transactions, preventing issues like replay attacks due to streamlined transaction ordering. Delegated PoS requires validators to stake not only SOL tokens but also Solana hardware, raising the potential cost of malicious activity. While Solana's security architecture is innovative and shows promise, its relative novelty compared to Ethereum's PoS system might lead some users to favor Ethereum's established track record.\n\nOverall, both Ethereum and Solana prioritize security with strong mechanisms to protect user funds. Ethereum's established track record with PoS inspires confidence in many users. However, Solana's innovative approach with PoH and bonded PoS offers additional security features and a potentially higher barrier to malicious actors. While Ethereum's PoS is well-understood, Solana's complex architecture with PoH may be less battle-tested, introducing the possibility of unforeseen vulnerabilities. Ultimately, the choice between these two platforms from a security standpoint depends on your individual risk tolerance and how you weigh a proven track record against advanced and disruptive features.\n\nDecentralization\n\nDecentralization is a core principle of blockchain technology. It refers to the distribution of power and control across a network, eliminating the need for a central authority. Both Ethereum and Solana aim for decentralization by applying the PoS consensus mechanisms. With PoS, validators who stake their own cryptocurrency tokens are responsible for verifying transactions. This economic incentive aligns validator interests with the health of the network, as malicious behavior could result in slashing and the loss of their stake. Additionally, both platforms aim to achieve a degree of resistance to censorship by distributing the validation process across a global network. This means no single entity can control or block transactions on the network.\n\nEthereum's decentralization\n\nThe Ethereum network is arguably one of the most decentralized in the world. With an estimated validator pool exceeding one million, Ethereum's validator base is constantly expanding, with plans to become even more distributed in the future. However, concerns remain about the potential influence of large staking pools that could hold a significant portion of the total staked ETH. As of writing, Lido dominates the staking landscape on Ethereum, controlling over 30% of staked ETH at one point. This concentration raises concerns about potential centralization, as Lido could potentially influence the network if it wanted to. Thankfully, the Ethereum team is actively working to mitigate this risk. The upcoming sharding upgrades as part of the Ethereum roadmap aim to further decentralize the network by increasing the number of validators required per shard. Overall, this will make it more difficult for any single entity to gain control, since the implemented upgrade will increase the number of validators required and lower the barrier to entry for individual stakers.\n\nSolana's decentralization\n\nAlthough Solana has been praised for its impressive throughput, its string of outages expose a potential vulnerability in this methodology. Solana adopts a different approach to decentralization and applies a DPoS system where validators are chosen based on factors like stake size and network performance. While this approach allows for faster transaction speeds, it also raises concerns about centralization as the validation power is concentrated among a smaller set of chosen validators.\n\nAdditionally, Solana's validator set is currently permissioned and employs a validator selection process with delegated PoS, meaning new validators need approval from the network to join. While this allows for faster transaction speeds, Solana's reliance on a specific set of validators for its PoH system raises questions about its true level of decentralization and reliability. This is especially true when compared to Ethereum's more geographically distributed validator network.\n\nThe perceived lack of reliability has also been underlined by Solana's network disruptions. To tackle this, Solana is working towards a permissionless validator set through its hotly anticipated validator client software, Firedancer. Firedancer implements Solana's version of PoS and aims to address some of the platform's current centralization concerns. By enabling anyone to run a validator node without prior approval from the network, Firedancer has the potential to significantly distribute validation power more evenly and greatly improve network decentralization in the long run.\n\nUltimately, the choice between Ethereum and Solana regarding decentralization depends on your priorities. If complete openness and permissionless participation are paramount, Ethereum might be the better choice despite its current scalability limitations. If faster transaction speeds are a priority, you might be willing to accept some centralization trade-offs with Solana, keeping in mind its ongoing efforts to become more decentralized in the future. However, if a technical issue or malicious attack disrupts the validator network, the entire Solana network can grind to a halt. This undermines the security and reliability of the platform, especially compared to more decentralized blockchains like Ethereum.\n\nScalability\n\nScalability refers to a blockchain's ability to handle a growing number of transactions without compromising processing speed or incurring high fees. This is a critical factor for the widespread adoption of blockchain technology, as expensive gas fees are often a deterring factor when it comes to regular usage and transactions. Scalability presents a contrast between Ethereum and Solana as each network has its own way of dealing with high transaction volume.\n\nEthereum's scalability\n\nAlthough it's established with a robust ecosystem, Ethereum has historically struggled with scalability due to its previous PoW consensus mechanism. This resulted in numerous scalability bottlenecks such as high transaction fees and slow processing times, which were major pain points for users looking to actively interact with Ethereum's ecosystem. In fact, it's this bottleneck that inspired many developers to strike out on their own and create their own scalability-focused Layer 1 blockchain, leading to the innovations in blockchain scalability that we see today.\n\nFortunately, the Ethereum Foundation has been hard at work upgrading the network with improved scalability in mind. From its PoS transition to numerous network upgrades like Dencun, the developments aim to significantly improve scalability by distributing the workload across multiple shards, potentially handling thousands of transactions per second. With the execution of its roadmap, we could see Ethereum reach a single block finality of 12 seconds. This is a fraction of its current 30-minute duration, and achieving this will dramatically improve the user experience and network efficiency.\n\nSolana's scalability\n\nMeanwhile, Solana is a high-performance blockchain that prioritizes scalability from its core design. Since its inception, Solana has had a laser-like focus on speed. Thanks to the network's introduction of innovations like PoH and tower byzantine fault tolerance (BFT), Solana is theoretically able to achieve a blistering throughput of up to 65,000 transactions per second. On top of this, Solana also boasts gas fees that are mere fractions of a penny, making it significantly cheaper to interact with the network compared to Ethereum's historically high gas fees.\n\nThe combination of blazing-fast transaction speeds and negligible fees puts Solana's scalability in a league of its own compared to Ethereum's current state, as Solana is becoming the platform of choice for a wide range of DApps, particularly those requiring high throughput and cost-effectiveness. While Solana has yet to achieve its theoretical maximum throughput, it's certainly on its way to hitting this thanks to progress made with Firedancer. With its ability to process 600,000 transactions per second in test environments, Firedancer could be influential in markedly improving Solana’s overall scalability.\n\nWhen considering scalability between Ethereum and Solana, both networks offer compelling options for developers and users seeking a scalable blockchain platform. While Ethereum focuses on a robust ecosystem and future scalability improvements with a strong emphasis on decentralization, Solana prioritizes raw speed and boasts impressive transaction processing capabilities at a fraction of the cost. Ultimately, the choice between these platforms depends on the specific needs of the project or user, with factors like transaction speed, cost, desired level of decentralization, and application type playing a key role in the decision-making process.\n\nSolana's potential threat to ETH dominance\n\nFor those unaware, ETH dominance refers to the ratio between the market cap of Ether to the total market cap of the entire cryptocurrency market. Like with Bitcoin dominance, ETH dominance is often used to track Ether's value relative to other big-name cryptocurrencies. This is used to signify how ETH fares against the competition.\n\nA chart showing ETH dominance (source: tradingview.com)\n\nA chart showing ETH dominance (Source: tradingview.com)\n\nReferencing the chart above, we can see that ETH dominance is currently on a downward trend. This is based on how a recent death cross was formed on the daily time frame as the 50-day moving average recently crossed under the 200-day moving average. Additionally, the relative strength index shows that ETH dominance is declining from its current value of 44.1. With these indicators in mind, we can conclude that ETH dominance could decrease in the near future, hinting that there might be a relative increase in the value of altcoins as traders rotate out of ETH into promising crypto projects and altcoins like SOL. This trend has also been a huge reason why crypto traders have been speculating that Solana might threaten ETH dominance over time as it offers a faster, more scalable alternative with significantly lower transaction fees. This speculation is further fueled by the ongoing developments of Solana's Firedancer validator client software, which aims to address concerns about decentralization and news of how Solana recently overtook Ethereum in terms of DEX trading volume.\n\nThe future of Solana vs Ethereum: can both Layer 1 powerhouses coexist?\n\nThe competition between two leading Layer 1 blockchains like Solana and Ethereum is fierce. While Ethereum boasts a robust and established ecosystem with a strong focus on decentralization, Solana offers blazing-fast transaction speeds ideal for high-throughput applications.\n\nAs both platforms continue to evolve, one important question emerges: can both Layer 1 powerhouses coexist in the future blockchain landscape? The answer might lie in specialization. Ethereum's upcoming sharding upgrades could address its scalability issues while maintaining its focus on security and decentralization. This would solidify Ethereum's strong positioning for complex financial applications and trading TradFi instruments like RWAs. Conversely, Solana's speed advantage could make it the go-to platform for applications requiring real-time transactions, such as DeFi markets with frequent trading or high-traffic GameFi titles.\n\nBeyond competition, we've seen a rise in cooperation between Solana and Ethereum. Thanks to the rise of decentralized interoperability bridging services like OKX Swap, both Layer 1 blockchains can seamlessly communicate with one another and enable asset transfers. We've even seen the emergence of shared developer tools and cross-chain projects fostering a more collaborative environment. Ultimately, the future might see a scenario where both Ethereum and Solana thrive, catering to different user needs and fostering innovation within the broader, interconnected blockchain space.\n\nFinal words on Solana vs Ethereum\n\nMany would agree that Solana may be the best option if speed, scalability, and low fees are important to you. This will likely be the case if you're interacting with high-frequency DeFi applications where every millisecond counts, or if you frequently trade Solana memecoins. However, if a robust and battle-tested ecosystem with a strong focus on decentralization is your priority, Ethereum might be the better fit. This could be ideal for DApps requiring greater security for valuable assets or projects seeking a more established user base and compatibility with existing Ethereum-based DApps.\n\nUltimately, the best approach might not be a \"which is better\" scenario. As the industry continues to develop, we might see increased interoperability between blockchains like Ethereum and Solana. This would allow users to leverage the strengths of each platform seamlessly. For instance, imagine seamlessly transferring assets between Ethereum and Solana for lower transaction fees while maintaining the security of the Ethereum network. The future of blockchain development is bright, with both Layer 1 blockchains like Ethereum and Solana leading the charge. By staying informed about their ongoing advancements, you'll be well-positioned to make informed choices as the blockchain landscape continues to evolve.\n\nKeen to trade either Solana or Ether? Check out our spot trading pairs for SOL and ETH to get started with your crypto trading journey today.\n\nFAQs about Solana vs Ethereum\n\nIs Solana faster than Ethereum?\n\nYes, Solana is significantly faster than Ethereum in its current state. Solana boasts theoretical transaction speeds exceeding 65,000 transactions per second, compared to Ethereum's current average of 15 to 45 transactions per second. This difference is due to Solana's unique architecture designed for scalability, while Ethereum is still undergoing upgrades to improve its speed.\n\nIs Solana cheaper than Ethereum?\n\nYes, Solana transactions typically incur significantly lower fees compared to Ethereum. Solana gas fees are a fraction of a penny, while Ethereum gas fees can fluctuate and sometimes reach high levels depending on network congestion.\n\nIs Solana more secure than Ethereum?\n\nWith its established and battle-tested network and a larger validator base that offers greater decentralization, Ethereum is generally considered more secure than Solana. This can also be seen in how often Solana faces network outages compared to Ethereum.\n\nWhy does Ethereum have higher TVL (total value locked) than Solana?\n\nTVL refers to the total value of cryptocurrency locked within DeFi protocols on a specific blockchain. Ethereum has a significantly higher TVL compared to Solana. This can be attributed to factors like Ethereum's first mover advantage that led to it having a more mature and established ecosystem. Specifically, Ethereum supports a wider range of DeFi applications and protocols, while the network effect could have caused the existing user base on Ethereum to attract further projects and users that reinforce its dominance in the DeFi space.\n\nCan Solana overtake Ethereum?\n\nThe future is, of course, uncertain. While Solana offers superior speed and lower fees as of writing, Ethereum is actively working on scalability improvements. Additionally, Ethereum's established ecosystem and user base are significant advantages. It's more likely that both platforms will coexist, with users choosing based on their specific needs. The rise of interoperability bridges could further enhance this coexistence by allowing users to leverage the strengths of each platform seamlessly."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9fR3ktcU9RTWNRd3h4azU1VXF4dVQxdkhNc3lRbEQteGg4dkFPQ2ZIUGdIOGRYLUFaU2xyUWtuSzk3RFdCdzJHLTlBVzctZzY0UVFQZWRwYWMyQy02NW1DT1JWN2ZjWDRFTGZYVFJGMW52UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "How to Stake Ethereum on Coinbase - Benzinga",
        "content": "Making More Out of Ethereum: A Simple Guide to Staking on Coinbase\n\nSHORT ANSWER: To stake Ethereum on Coinbase, deposit ETH into your account, navigate to the staking page, stake ETH and start earning rewards.\n\nWant to make more Ethereum without lots of complicated moves? Staking Ethereum on Coinbase is the answer. Since Bitcoin does not support staking, doing it with Ethereum is like helping out Ethereum and getting rewarded for it. This guide is for everyone, whether you're new to crypto or already know a bit. Here’s how to stake Ethereum on Coinbase step by step. By the end, you'll understand why staking is beneficial, how to do it easily and how it can boost your Ethereum stash.\n\nCoinbase ETH Staking Overview\n\nStaking Ethereum (ETH) is like being a guardian of the Ethereum network, and in return, you earn rewards. When you stake ETH on Coinbase, the most popular cryptocurrency exchange, it becomes staked ETH, and its price stays the same as regular ETH. Coinbase is a trustworthy platform for staking ETH. It makes it easy for anyone, even if you have a tiny bit of ETH, to start staking without needing a full Ethereum setup.\n\nWhy Should You Stake Ethereum?\n\nStaking is a way to participate in the Ethereum network's security and operation actively. By staking, you help verify transactions and create new blocks, which earns you ETH rewards. When you stake on Coinbase, ETH gets locked into a smart contract, making it secure from certain risks like price changes. But be cautious because not following the rules might mean losing ETH as a penalty.\n\nIs Staking ETH with Coinbase a Good Idea?\n\nFor many people, yes! It can be safe and simple way to earn rewards. Plus, you can stake any amount of ETH you have, and you don't need to worry about setting up complicated software. Although Coinbase doesn't charge a fee to stake or unstake, it charges a commission based on the rewards you receive from the network. You could face network fees to process transactions on the Ethereum network.\n\nThe rewards you earn from staking might be taxable, so it's a good idea to talk to a tax expert if you're unsure. Staking ETH on Coinbase can be a smart move for many users. You get to earn rewards and support the Ethereum network, and it's hassle-free.\n\nHow to Stake Ethereum on Coinbase\n\nHere's a step-by-step guide on how to stake Ethereum on Coinbase.\n\nCreate a Coinbase Account\n\nBegin by creating an account on Coinbase if you haven't already. You can do this by visiting the website or downloading the Coinbase app. Follow the prompts to set up your account and complete the necessary verification steps.\n\nDeposit ETH into Your Coinbase Account\n\nTo start staking, you need Ethereum (ETH) in your Coinbase account. You can transfer ETH from another wallet or buy ETH directly on Coinbase.\n\nNavigate to the Staking Page\n\nOnce you have ETH in your Coinbase account, go to the staking page. Look for the option to stake ETH. It's usually easy to find in the navigation menu.\n\nStake ETH\n\nClick on the Stake button and follow the instructions to stake ETH. You can stake any amount of ETH up to the Coinbase maximum limit of 10,000 ETH.\n\nWait for Confirmation\n\nAfter you've initiated the staking process, Coinbase will review your request and confirm the transaction.\n\nMonitor Your Staking Rewards\n\nOnce ETH is staked, you'll start earning staking rewards. These rewards will be automatically reinvested into your staking balance. You can keep track of your rewards on the Coinbase staking page.\n\nUnstake ETH\n\nIf you want to unstake ETH, you can do so at any time. There might be a waiting period before ETH is fully unstaked and available for withdrawal.\n\nStaking Ethereum on Coinbase is a safe and convenient way to earn passive income through rewards. There is no minimum limit to stake ETH on Coinbase. Staking rewards are taxable income in the U.S.\n\nPros and Cons of Staking Ethereum on Coinbase\n\nLet's take a closer look at the pros and cons of staking Ethereum on Coinbase.\n\nBenefits of Staking ETH\n\nStaking Ethereum on Coinbase comes with several benefits.\n\nEarn passive income: Unlike trading on bots, by staking ETH on Coinbase, you're putting Ethereum to work for you. Through the rewards provided by the Ethereum protocol, you can earn passive income. This feature is appealing for investors with a long-term outlook, as it offers a way to try to grow their ETH holdings passively.\n\nUnlike trading on bots, by staking ETH on Coinbase, you're putting Ethereum to work for you. Through the rewards provided by the Ethereum protocol, you can earn passive income. This feature is appealing for investors with a long-term outlook, as it offers a way to try to grow their ETH holdings passively. Support network security: When you stake ETH, you play a role in the security and integrity of the Ethereum network. Your staked funds help validate transactions and create new blocks, contributing to the overall strength of the network. This practice helps ensure that Ethereum remains a robust and reliable platform for all users.\n\nWhen you stake ETH, you play a role in the security and integrity of the Ethereum network. Your staked funds help validate transactions and create new blocks, contributing to the overall strength of the network. This practice helps ensure that Ethereum remains a robust and reliable platform for all users. Environmentally friendly: Unlike Bitcoin mining, which consumes large amounts of electrical energy, Ethereum's proof-of-stake model is more environmentally friendly. Staking requires only a fraction of the energy used in traditional mining, making it a greener option for investors who are concerned about the environmental impact of cryptocurrency.\n\nUnlike Bitcoin mining, which consumes large amounts of electrical energy, Ethereum's proof-of-stake model is more environmentally friendly. Staking requires only a fraction of the energy used in traditional mining, making it a greener option for investors who are concerned about the environmental impact of cryptocurrency. Easy to use: Coinbase is known for its user-friendly interface, and staking on the platform is no exception. The process is simple, making it accessible to a wide range of investors regardless of their technical expertise.\n\nCoinbase is known for its user-friendly interface, and staking on the platform is no exception. The process is simple, making it accessible to a wide range of investors regardless of their technical expertise. Flexibility: One of the advantages of staking on Coinbase is the flexibility it offers. You can stake any amount of ETH, even as little as 0.01 ETH, without needing to own the full 32 ETH required for solo staking.\n\nOne of the advantages of staking on Coinbase is the flexibility it offers. You can stake any amount of ETH, even as little as 0.01 ETH, without needing to own the full 32 ETH required for solo staking. Automatic restaking: Staking rewards on Coinbase are automatically restaked, allowing you to try to compound your earnings over time without manual intervention. Your staked ETH continues to work for you, earning rewards and helping to secure the network, without requiring additional effort on your part.\n\nRisks of Staking ETH\n\nHere are the cons and risks of staking Ethereum on Coinbase.\n\nCentralized exchange risks: Staking on a centralized exchange like Coinbase means trusting a third party with your assets, which could expose you to risks such as security breaches or regulatory issues.\n\nStaking on a centralized exchange like Coinbase means trusting a third party with your assets, which could expose you to risks such as security breaches or regulatory issues. High commissions: Coinbase charges a 25% or higher commission on rewards earned from staking, which can significantly reduce your earnings.\n\nCoinbase charges a 25% or higher commission on rewards earned from staking, which can significantly reduce your earnings. Limited control: Staking on Coinbase means relinquishing some control over your staked assets, as they are locked in a smart contract and subject to Coinbase's terms and conditions.\n\nStaking on Coinbase means relinquishing some control over your staked assets, as they are locked in a smart contract and subject to Coinbase's terms and conditions. No immediate liquidity: Staking ETH involves locking it up for a period, which reduces your liquidity and makes it challenging to access your funds quickly if needed.\n\nStaking ETH involves locking it up for a period, which reduces your liquidity and makes it challenging to access your funds quickly if needed. Slashing events: Although rare, slashing events can occur in staking. If a validator fails to fulfill their role, they can be penalized, resulting in a loss of staked ETH. Delegated ETH can also be slashed if the validator fails.\n\nAlthough rare, slashing events can occur in staking. If a validator fails to fulfill their role, they can be penalized, resulting in a loss of staked ETH. Delegated ETH can also be slashed if the validator fails. Protocol changes: Staking protocols and network conditions can change over time, affecting rewards. Past rewards don't guarantee future payouts.\n\nStaking protocols and network conditions can change over time, affecting rewards. Past rewards don't guarantee future payouts. Lack of control over validators: When staking on Coinbase, you have no say in which validator it chooses to work with. While it collaborates with reputable validators, events like slashing can occur because of factors beyond Coinbase’s control.\n\nWhen staking on Coinbase, you have no say in which validator it chooses to work with. While it collaborates with reputable validators, events like slashing can occur because of factors beyond Coinbase’s control. Gas fees: Staking and unstaking transactions on the Ethereum network require gas fees, which can vary. These fees can impact profitability, especially for smaller stakers.\n\nHow Much Ethereum Do You Need to Stake on Coinbase?\n\nUnlike solo staking, where you usually need the full 32 ETH, Coinbase allows users to stake any amount of ETH. You can stake as little as 0.01 ETH on Coinbase. This flexibility makes staking accessible to everyone, regardless of the amount of Ethereum they hold.\n\nHow Much Can You Earn Staking ETH on Coinbase?\n\nWhen staking Ethereum (ETH) on Coinbase in mid-April 2024, the estimated reward rate is approximately 2.61% if you stake for 365 days. This rate isn't fixed and can vary over time. You can check the latest applicable rates directly within your Coinbase account. Commission charges reduce your actual returns.\n\nRewards are distributed every four to five days after the activation period. However, the rewards may not settle in your account immediately because of network conditions. While the estimated reward rate gives you an idea of what you can earn, the actual rewards may take some time to reflect in your account.\n\nHow Long Does It Take to Unstake ETH on Coinbase?\n\nTo unstake ETH on Coinbase, you follow a specific process. Once you initiate the unstaking action, your assets will enter an unbonding period. After this period ends, you can withdraw the asset. However, there's an additional step: unbonded assets must be included in a batch before withdrawal. You'll need to wait until the unbonding transaction is part of one of Coinbase's batch times.\n\nFor U.S. clients, batch times are Monday-Friday at 12:00 a.m., 4:00 a.m., 8:00 a.m., 12:00 p.m., 4:00 p.m. and 8:00 p.m. PST; and Saturday-Sunday at 2:00 p.m. PST. Non-U.S. clients have different batch times: Monday-Friday at 8:00 a.m., 12:00 p.m., 4:00 p.m. GMT; and Saturday-Sunday at 4:00 p.m. GMT.\n\nUnstaking ETH on Coinbase involves an unbonding period followed by waiting for batch withdrawal times. Be aware of these timelines when planning to unstake ETH.\n\nCan I Sell Staked Ethereum on Coinbase?\n\nYou cannot directly sell staked Ethereum on Coinbase. You would go through the process of unstaking it first, which typically takes one to four days depending on network conditions. Once the unstaking transaction is processed, you'll be able to claim your funds and sell them.\n\nUnstaking and claiming are separate blockchain transactions, and both require gas fees, resulting in costs associated with both processes.\n\nIf you have staked Ethereum on Coinbase and want to move it, you have a couple of options. You can unstake it and sell it or you can wrap it into cbETH and trade it as a liquid staking token. However, cbETH trades at a discount, so if you're looking to sell at the full value of your staked Ethereum, unstaking and selling it may be the better option.\n\nCoinbase Stakers Earn Rewards\n\nStaking Ethereum on Coinbase offers a straightforward and accessible way for users to actively participate in the Ethereum network and earn rewards. With Coinbase's user-friendly platform, you can stake any amount of ETH, even as little as 0.01 ETH, without the need for a full Ethereum node. While there are potential risks and considerations to keep in mind, such as centralized exchange risks, commission charges and gas fees, the benefits of earning passive income, supporting network security and contributing to a more environmentally friendly blockchain ecosystem can make staking on Coinbase an attractive option for many investors."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOb2s1YlNNQUp3UjRJMWpzQlJiTklGd3NBc0VRalZBakxENkRXVGFJYm12Y2R2MzdzajFzbndNbTRzczJndGNtUGlMY2hDXzJmWWgxMXl5QVljc3NsTzZ4M3d5MHNCbFlHQkVfSU5ScVUwVGZCSWRkbHh6d0dRMDMyck9kMndzUEhCVDdXN0RXSWVIMlk2R2pJclNVMFJlYTFxTllxaEEtMnRhRVI1Tk9hQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Officially Approved – ETH Price Predicted to Hit $4k Next ? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFA5QXVJTkFibEJFTldWZ3E1bHpBc0VyUTdHOEtyMW5naTZuejZkQWZrRDFCdG5CUDNzUnZid2ZYcVREQTU2WjdvejBWZW0wY1ZVNnJsa1EyUi1fZE9sOTU3Y3F5ejh3MzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum spot ETFs may hit Hong Kong markets as early as Monday: Bloomberg - Crypto Briefing",
        "content": "Mainland China's investors may soon channel billions into Hong Kong's crypto ETFs.\n\nShare this article\n\nMajor Chinese asset managers are on the brink of launching spot Bitcoin and Ethereum exchange-traded funds (ETFs) in Hong Kong, possibly as early as Monday, Bloomberg reported on Friday, citing anonymous sources familiar with the matter. The timeline, however, remains tentative, sources noted.\n\nHarvest Fund Management Co.’s international division and a joint venture between Bosera Asset Management (International) Co. and HashKey Capital are the two potential ETF issuers, Bloomberg’s sources said.\n\nAs noted, the two entities plan to roll out their ETFs by the end of the month, pending approval from the Securities and Futures Commission (SFC) and finalizing listing arrangements with Hong Kong Exchanges & Clearing Ltd.\n\nThe report follows news earlier this week that prominent Chinese asset managers have applied for spot Bitcoin ETFs through their Hong Kong subsidiaries. According to Bloomberg, on April 9, SFC granted Harvest and China Asset Management clearance to provide virtual-asset-related fund management services.\n\nHong Kong Bitcoin ETFs poised to attract $25 billion\n\nThe potential approval of Hong Kong-listed spot Bitcoin ETFs could unlock up to $25 billion in demand from mainland China as qualified Chinese investors may be allowed to access the funds through the Southbound Stock Connect program, said Matrixport in a Friday report.\n\n“A likely approval of Hong Kong-listed Bitcoin Spot ETFs could attract several billion dollars of capital as mainland investors take advantage of the Southbound Stock Connect program, which facilitates up to 500 billion RMB (HK$540 billion and $70 billion) per year in transactions,” said Matrixport. “Based on the (potential) available capacity, this might result in up to 200 billion Hong Kong dollars of available capacity for those HK Bitcoin ETFs—or US$25 billion.”\n\nThe Southbound Stock Connect program sets a yearly limit of HK$540 billion for Chinese investment in Hong Kong-listed stocks. However, 360MarketIQ’s data shows the quota hasn’t been fully used in the past three years, leaving around HK$100-200 billion annually unused capacity.\n\nMatrixport suggested that this unused quota could be directed towards the Bitcoin ETF if approved.\n\nAfter the debut of US spot Bitcoin ETFs, global investors have seen Hong Kong as the next hub for crypto ETFs due to the country’s regulatory environment.\n\nIn late December last year, the SFC and the Hong Kong Monetary Authority (HKMA) issued new rules addressing the possibility of investment funds, brokerages, and asset managers offering crypto ETFs. The move was seen as preparation for upcoming crypto ETF products."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNVHU1S3NyanU4UWdKODl1R1E2aXZLQU5JMVBsWnJrVkpQSFYta0M5N0w4QU1TOUM0U0tKV2taM0FKOS02NWZHRHJkMWR6MW4yYm9qSTZDT1lFZG9qRkpsZy0zU1JXNHpPSXhrWkV3bVI4cldWTjZfY0dzWVZ5NUVaZFlzc3RqZjlPS1ZfRU5YbGN2aV9CY0p3MkNBUUJveGJL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong approves Bitcoin and Ethereum ETFs as US lingers on ETH approval - CryptoSlate",
        "content": "Hong Kong further solidified its status as a crypto hub, with several issuers reporting approval of their spot Bitcoin and Ethereum Exchange-Traded Funds (ETFs) applications on April 15.\n\nHowever, Hong Kong’s foremost financial regulator, the Securities and Futures Commission (SFC), has yet to release an official statement on this development.\n\nSFC has not responded to CryptoSlate’s request for comment at press time.\n\nSpot Bitcoin ETFs\n\nChina Asset Management, one of the issuers, disclosed that its Hong Kong entity received regulatory approval to offer virtual asset management services, paving the way for Spot Bitcoin and Ethereum products.\n\nIts statement reads:\n\n“China Asset Management (Hong Kong) has received approval from the Hong Kong Securities and Futures Commission to provide virtual asset management services to investors. It now plans to issue ETF products that can invest in spot Bitcoin and spot Ethereum.”\n\nChina Asset Management aims to launch the products by teaming up with OSL Digital Securities. BOC International Prudential Trusteeship has been selected as its custodian.\n\nSimilarly, Bosera Capital and Harvest Global Investments announced that the financial regulator has approved their applications for Bitcoin and Ethereum spot ETFs. However, these announcements have been deleted as of press time.\n\nMeanwhile, market observers believe that the approved crypto ETFs would attract fresh investments to the region and revolutionize the market by providing a more efficient and less risky way of managing assets through the in-kind creation model.\n\nCrypto hub status\n\nThe reported approval of these crypto ETFs further positions Hong Kong as a pioneer crypto hub within Asia.\n\nOver the past year, Hong Kong has attracted significant attention and praise from the crypto industry due to its pro-crypto regulatory approach.\n\nCathie Wood, CEO of Ark Invest, recently lauded the country’s robust pro-crypto regulatory framework, saying:\n\n“Hong Kong is the ‘leader’ in terms of policy. It strongly encourages the development of innovative technology and entrepreneurs. The system of investment and mutual cooperation with the government has given the institution a good model.”\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQeGl5aUdYMzJXNUZFcEluRXQ3UDZIWmNRb0hKNWRCYkxsLVg2OXA1Tk9xQ2tsZGx3SkNVTUgyZ3B5Y2ZCUzZtaTBSS0lFN3A0NmV2TExWbWdqbDVLOWNaS3FWY0gweEZPM2JKQ294bEU0YU02UUpwai1UbWcta3RnbDVaVXZLZDNJOThFbVRMWW53ZkVmQlZEdnVzNXE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Markets Regulator Approves Bitcoin and Ethereum Spot ETFs - Unchained",
        "content": "Four Hong Kong-based asset managers have been given the green light to launch spot Bitcoin and Ethereum ETFs.\n\nThe Hong Kong SFC has given in-principle approval to four asset managers to launch spot BTC and ETH ETFs.\n\nThe Hong Kong Securities and Futures Commission (SFC) has given the initial approval to a first batch of firms to launch spot bitcoin and ether exchange-traded funds (ETFs).\n\nChina Asset Management, Bosera Capital, HashKey Capita and Harvest Global all disclosed that they had received in-principle approval from the markets regulator late on Monday afternoon Hong Kong time.\n\nIt is now a fight for capital between Hong Kong and New York to flow into their Bitcoin ETFs Game theory at work! Love to see it — Alistair Milne (@alistairmilne) April 15, 2024\n\nChina Asset Management has partnered with OSL Digital Securities and BOC International Prudential Trusteeship to provide infrastructure and custody services for the firm’s proposed spot crypto ETFs.\n\nLast week, a Matrixport report seen by CoinDesk suggested that the approval of a Hong Kong-listed Bitcoin Spot ETF could attract “billions of dollars of capital” from investors in mainland China.\n\nThe report’s authors said their assumptions were rooted in the fact that these investors would capitalize on the Southbound Connect program, which allows mainland Chinese investors to acquire up to HK$540 billion worth of Chinese stocks per year.\n\nHowever, Chinese blockchain reporter Colin Wu later said that Hong Kong bitcoin ETF issuers he had spoken to had clarified that their spot crypto ETFs would definitely be off limits to investors from mainland China, which still has a blanket ban on the trading and ownership of digital assets.\n\nSeveral issuers of Bitcoin ETFs in Hong Kong told WuBlockchain that southbound funds from mainland China are definitely unable to buy cryptocurrency ETFs, and the Matrixport report is false. An earlier Matrixport report indicated that Bitcoin spot ETFs listed in Hong Kong are… — Wu Blockchain (@WuBlockchain) April 13, 2024\n\nSpot bitcoin ETFs in the U.S. have seen an overwhelming response since their launch in January – the funds (barring Grayscale’s GBTC) boast a cumulative $53.3 billion in assets under management (AUM)."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9JZk05bjZuMjlxSlNVc05JU1ZBMVJVQVRMaU1zSXp1c0tFTWl5Ul9yeGpvWFU4cWE5T3VJUEZzOVNZTXV6MWJLR01EWlZSMmpSWGtUSzNTYkxWc01vMGUxNF9TaDJ0T05CMnRmeTYxaEpTXzMyb2lpX2ZQV1ZDelnSAYcBQVVfeXFMTnZINldReXFnamdDZkVNakE2bkNzem5UeURwNVE5VEdPdU4zUEFDdWR5NHlVQ0RsTGpGMGFvOEhOVGFsckUtMlE4VFJ4Rmotb3Nqa2hHMUlncnNUOHVhdzl1UWM3My1jNG9ScW9DRzRjc1hFQklSdU5rZFlHaWNPY2lqdUhEc3BZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Spot Bitcoin, Ethereum ETFs Approved in Hong Kong - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHong Kong's securities regulator has given conditional approval for a number of spot Bitcoin and Ethereum ETF applications.\n\nIn separate statements Monday morning, China Asset Management and Harvest Global Investments announced the in-principle approval of their applications by the Hong Kong Securities and Futures Commission (SFC). Harvest Global Investments subsequently deleted its statement, likely pending an official statement from the regulator.\n\nDigital asset platform OSL announced in separate press releases that it would act as the \"sub-custodian partner\" for China Asset Management and Harvest Global Investments' ETFs.\n\nBosera Asset Management also reportedly announced that it had received conditional approval for its ETF application, which will be jointly managed with HashKey Capital.\n\nAD\n\nAD\n\nIn a statement, OSL CEO Patrick Pan said that its appointment as sub-custodian to China Asset Management, \"demonstrates our commitment to advancing digital asset investments in Hong Kong, mirroring the trend of reputable partnerships seen in the U.S. market.\"\n\nThe news comes just months after the U.S. Securities and Exchange Commission (SEC) granted approval to multiple spot Bitcoin ETF applications, which have seen billions of dollars in inflows since their launch in January.\n\nHowever, the U.S. SEC has proved more reluctant to approve a spot Ethereum ETF, delaying its response to multiple applications. Meanwhile, the Ethereum Foundation revealed that it is being investigated by a \"state authority\"—which, while not confirmed to be a U.S. regulator, has contributed to a growing pessimism among analysts as to the chances of an Ethereum ETF being approved.\n\nWhile the Chinese mainland has engaged in a years-long crackdown on cryptocurrency, Hong Kong has embraced the sector, rolling out a Virtual Asset Trading Platform (VATP) licensing regime in June 2023 in a bid to position itself as a crypto hub.\n\nAD\n\nAD\n\nIn August 2023, HashKey and OSL became the first licensed crypto exchanges to offer services to retail users in Hong Kong."
    }
]