[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE10V0hDNDBOQTd4dnNHOS02b0pwS081Rk9oTTgyTUZVNkpveFpBTE1xNWo5cDEtWElMZzNXb3IxLU1FUnpHYjQwZnVPMEJWbTktT09WbDhXNl9jN3VBUnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum spot ETFs are next - Blockworks",
        "content": "The new bitcoin spot exchange-traded funds mark the brink of an era that will see trillions pour into tokenization.\n\nThe moment BlackRock filed its iShares Bitcoin Trust application with the US Securities and Exchange Commission, it was obvious it would get approved. The evidence was on page 36 of the 111-page filing, which references the “surveillance-sharing agreement” between NASDAQ and a US BTC Spot Market Platform (read: Coinbase). Add to that BlackRock’s 575-1 ETF application approval record, and the writing was on the wall.\n\nBut the SEC was also explicit about its real concerns with crypto market manipulation. Manipulation related to bitcoin prices was cited in most, if not all, previous ETF rejections. The SEC isn’t convinced Coinbase and other crypto exchanges can be trusted to “prevent fraudulent and manipulative acts and practices.”\n\nAfter the ETF approval, we may not be experiencing the record flows of billions of dollars in its aftermath that reporters predicted. But, we are experiencing “crypto’s top enemy” and arguably the largest opponent to blockchain adoption in the US finally acquiescing to its place in the market.\n\nIncoming will be an imminent approval of an Ethereum spot exchange-traded fund with parallels to the legal precedents set by the bitcoin spot ETF.\n\nI’ve been in the tokenization space since 2017. And I’ve been saying since then that every financial asset will one day be on a blockchain. Larry Fink, the CEO of BlackRock, finally agrees. ETFs, he says, are just a mere stepping stone to “the technological revolution in financial markets” that includes “the tokenization of every financial asset.” Fink’s future vision looks something like this: “Every bond will have its own CUSIP, it will be on one general ledger” and “this eliminates all corruption, by having a tokenized system.”\n\nHistorically, markets have been plagued with integrity issues. Transactions require trust that the other party will uphold their end of the bargain. Financial institutions, both commercial and regulatory, have blossomed as a way to mediate this. Yet, all this does is require participants to place their trust in centralized third-parties whose operations are opaque and, quite frankly, not immune to corruption.\n\nBlockchain technology reduces this reliance on third parties and the risks it brings. It’s optimistic for Fink to say blockchain can eliminate all illicit behavior — criminals will always find a way to be criminals. But blockchain can offer more transparent, traceable transactions in real-time that prevents fraud and lets regulators track illicit behavior much more easily and effectively.\n\nRead more from our opinion section: Bitcoin ETFs are not crypto’s finish line\n\nMore industry players like Fink, and even more regulators, are now starting to see the real, tangible benefits of blockchains. That’s why I predict that it will be hard for the SEC to justify not approving many other products once it approves the Ethereum spot ETF. We’ll have NFT ETFs, DeFi ETFs and even ETFs for the top tokenized real-world assets.\n\nInstitutions with trillions in capital will finally be able to access tokens via regulated vehicles on venues with approved counterparties. They’ll push for blockchain in use cases of greater institutional benefit, like the tokenized bonds we’ve seen issued in Europe or the tokenized securities now legal throughout nations in APAC. Legacy finance in the US will finally open to tokenization.\n\nBut this tokenization won’t be on one public ledger as Fink hopes. While it would be great for BlackRock if everything happened on Ethereum — this would drive value to its future Ethereum spot ETF — it’s just not what regulators or markets want.\n\nRegulators and institutions have repeatedly indicated a preference for public permissioned networks or private permissioned networks.\n\nIn a report by EY Parthenon, 60% of institutions said they preferred a public permissioned network for asset tokenization. Likewise, public permissioned networks were of interest to regulators interviewed for a report by the Global Financial Markets Association and Boston Consulting Group.\n\nPermissioned networks will be the networks of choice for many. They’re either comparable to existing infrastructure in capital markets (private permissioned), or come with frameworks for regulatory and institutional risk-management and tools to enable know-your-customer/AML compliance (public permissioned).\n\nIs the SEC’s approval of the bitcoin spot ETFs exciting?\n\nYes.\n\nIs it giving the greenlight for institutional capital to pour into crypto and tokenization?\n\nYes.\n\nBut, we’re only in the first inning of this revolution. We haven’t seen anything yet.\n\nGraeme Moore is the Head of Tokenization at the Polymesh Association, a not-for-profit dedicated to the growth of the Polymesh blockchain ecosystem. He is also the author of B is for Bitcoin, the first ever ABC book about Bitcoin. Prior to Polymesh, Graeme was the first employee at Polymath; the creative director at Spartan Race; and an associate at Canada’s largest independent investment advisory firm.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOTmFFWWowNjYxTDREaElRbWUyQ1dPOXh5T19KamhrbEVCN1plUDIyWGpXX1ZBVWpqSWJXRVdFM3hoRExBbUpfZk1pb08tRTdPTXhGYTRiSHZZRUlUUGUtTnRXQ0dGelA0QTBjemtvT3JSckVzeTdrMmtZYUo0STh5eHZKZ3BaZEUzWWdWclI2MC1JUTR6cVFObVVxTEJhNlJxLVVaU0lLcGJIMnNaR3ZkNtIBtgFBVV95cUxNSXNYU0U3NHN4MEpmcnVIcjR6dnlTMmtqaXpBcmJBdk1iS1c1dUJUbVpYT2ZfcDJGaDJ3MjlZUVAzSnF5U1ZJV1dVN0hwaUs2QnZVRFEzVGFXeTdPY2ZDdHNuYzF6dzhtTjBSWnhxMmpsS284T2FISVM4clNJVjZaaHVkaUZRWl9aYThFcU5xdUtXOUY5ZkpMNkI1OEw0dVdXZXdFX1FYSWZJUTNCalpVNGppNTVnUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Validator Entry Queue Signals Renewed Interest in Staking - CoinDesk",
        "content": "While the number of stakers looking to join the network has spiked, the tally remains well below the figures over 75,000 seen following Ethereum’s Shapella upgrade in April last year. The Shapella upgrade opened withdrawals of staked ether for the first time, de-risking the process of locking coins in return for rewards."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBDb0t5TmJJeF9zRWZSc1Vha1B5MTdLeG4zanJOVGpnNEEwX3NCOXl1VUhieDJZZ2kwRXJtOW9lM19WVWtfWFpkdHFyVWhRR0RDYVBYdU5DM19hSFI3QWFLcmxGdnpKSmg0Yk1qaVBNeGxsdWxm0gF6QVVfeXFMT1E1eGM3ZTI4MC1EelNVR3RVQ3didlhlb3liM25lOFR1Wk1wNlNhc0kzWEk1YlR5S2doNzRteEFXQ1g0clVIUk44M013enpxS255ZkdQS2pGdWYyWWtyVUtHbFFZU3E5akRZVTRqNlB3dXdZLVU2ZVZRR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Crosses Big Staking Milestone: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum, the second-largest cryptocurrency by market capitalization, has surpassed a new staking milestone.\n\nAdvertisement\n\nAccording to on-chain analytics firm IntoTheBlock, the Ethereum staking participation rate has risen above 25%.\n\nThe Ethereum staking participation rate is a reliable indicator of how many users are participating in securing the Ethereum network in exchange for a reward. An increase in this rate indicates increased interest in the Ethereum blockchain and faith in its proof-of-stake consensus mechanism.\n\nThe Ethereum staking participation rate is now >25%. pic.twitter.com/RuQZ4qq0Wc — IntoTheBlock (@intotheblock) February 12, 2024\n\nCurrently, the total ETH staked, which refers to the cumulative amount of ETH staked by participants, was 38.69 million ETH as of Feb. 11.\n\nThis indicates the total amount of ETH allocated to the Ethereum staking contract over time.\n\nA growing number of ETH staked might suggest how resistant the consensus mechanism is to external economic attacks. The potential attackers would need to own and stake a considerable percentage of the total staked amount. For this reason, the higher the staking amount, the more secure the Ethereum blockchain.\n\nEthereum on brink of major updates\n\nEthereum is about to undergo multiple technological upgrades, the most notable of which is the impending Dencun upgrade.\n\nThe upgrade, scheduled for March 13, intends to increase network efficiency and layer-2 support by delivering significant scaling upgrades such as proto-danksharding.\n\nEthereum's native token, ETH, experienced a notable surge in the past week, climbing over 10%. In the past week, the Holesky testnet successfully upgraded to Deneb, a big milestone for the ETH blockchain.\n\nAt the time of writing, ETH was up 0.58% in the last 24 hours to $2527. According to crypto analyst Michael Van de Poppe, this period represents a \"waiting game until Ethereum starts to pick up pace.\" He added that Ethereum has \"flipped the $2,150 level for support, currently waiting for a breakout for continuation to $3,500.\""
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE4tZXZPcGQwdkhXU29XVXpRVm01Q2VmVFppTi12X1FZelhXLW5qb2pFWlBSMDRmTGx2cHAyYWxpZlY0T1NPV01nbGl5eDliY1NOOWhiWlZjMlllRGhiLXFSVGN0RkNtYW5xVGlmWW5UY083alI0VTJ3b29XVGc3WWvSAYcBQVVfeXFMTTJ6SXc5X1ZRcm9lZml0cUFvampVSDk0Mm51NGJ0SG1VV2tiWW1ISk41RlVxOVN3MXZVRW1FOGxiRTlIRGlxcllKQ0pzdzdjOXJ6VFRwaDNVWkI0cE9iUklPXy12d2VySFVGYUlZaTRBTE9sNUE3YU56WnBaQ25aeVJOa2lLQ2cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Wall Street Titan Franklin Templeton Enters Spot Ethereum ETF Race - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe spot Ethereum exchange-traded fund (ETF) race continues to heat up, with today's entry from notable Wall Street institution Franklin Templeton, which filed a proposal with the Securities and Exchange Commission.\n\nA prestigious firm with $1.4 trillion in assets under management, Franklin Templeton wants to launch a fund that exposes investors to the second-biggest cryptocurrency by market cap, ETH.\n\nThe firm's S-1 registration form says that the proposed \"Franklin Ethereum Trust\" would hold ETH and \"may, from time to time, stake a portion of the Fund's assets through one or more trusted staking providers.\"\n\n\"Staking\" refers to the process of \"locking up\" digital coins or tokens to help keep a blockchain network running. Those who stake earn token rewards in the process.\n\nAD\n\nAD\n\nIt's a controversial practice among tradfi players and regulators, however. The SEC has already fined major crypto companies—including Coinbase—for allegedly selling unregistered securities via staking services.\n\nIn January, the SEC gave the green light to 10 spot Bitcoin (BTC) ETFs to start trading. After a decade of denials, the investment vehicles now trade on stock exchanges, giving traditional investors the ability to invest in crypto, without having to actually own crypto.\n\nFranklin Templeton is one of the major fund managers that got the green light from the regulator with its Franklin Bitcoin ETF.\n\nOther major players proposing a spot ETH ETF include BlackRock, Grayscale, and VanEck.\n\nAD\n\nAD\n\nSince the approval of spot BTC ETFs, billions of dollars have flowed into the funds, pushing the price of the cryptocurrency up.\n\nBritish multinational bank Standard Chartered last month said in a report that it expected ETH ETFs to get approval from the SEC by May.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNGwyOVh3dkswWnZhejlvVlVXSVZrUVY3ZkNCY3BIemItYWlaQVdUYzRqZmFWeHVfOW85VmR5VEtCa2Q3ZTVrVUdvUDdfWm1zdXhlT1JkT0dtQ0JUWUl5aWtTWS1xOXVaS0lzQ1l5c1dSR2ZFblA0QVFBRkJlTEVBMTNLNFRLRVNlZlZuelBLQ3l1VURnN2dUVVdfYm4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton joins BlackRock, ARK Invest in Ethereum spot ETF race - Crypto Briefing",
        "content": "Coinbase will be one of the fund’s custodians.\n\nShare this article\n\nFranklin Templeton, the company that manages $1.5 trillion in assets, has become the latest Wall Street giant to file for a spot Ethereum exchange-traded fund (ETF), according to an S-1 form registration dated February 12, 2024. The firm now joins BlackRock, ARK Invest, and five other asset managers in the spot Ethereum product race.\n\nFranklin Templeton has selected Coinbase Custody Trust Company and the Bank of New York Mellon as the fund’s custodians. As an ETF custodian, Coinbase is responsible for the safekeeping and management of the cryptographic keys that control the underlying assets of an ETF.\n\nLike BlackRock and ARK Invest, Franklin Templeton has also adopted a cash-only policy for the creation and redemption of shares. The proposed ETF is slated for listing and trading on the CBOE BZX Exchange, offering investors an accessible avenue to gain exposure to Ethereum without the complexities and operational challenges typically associated with direct crypto investments.\n\nFranklin Templeton previously shared a bullish outlook for the future of Ethereum, Solana, and other layer 1 chains. The firm also generated headlines when it embraced the “laser eyes” meme, a social media trend in the crypto community where individuals, especially crypto enthusiasts, edit their profile pictures to include red laser beams coming out of their eyes.\n\nThe new filing comes on the heels of a recent move by the US Securities and Exchange Commission, which sought public feedback on a proposed rule change to list and trade an Ethereum spot ETF from Galaxy Digital and Invesco."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPdkJrZkcwdWtTWUN6VnZ6bkd4cE1JZkptOWRqOFNtRmtES0hqYmZNVEFDNG9MdVVoV3RnZnpFbGlHUXV4M1BCaU9abExHVXRBa2N2YUpQS1FCampfcmEwejg2cXVHUmZnRkhVTUJlZHB0azNKY1ppQXAxUGk3bUdfV2ZqTmVsOEpCbldUQW85aXpfRU05UzdNelVDYzNFZ1QwZXF6WlMwYXR6RHN4ZTRjd1pKdmR5WGxVU3VveGZ3QlQzekVvYndWNXM1TnA4dTI0Yi1lVmJpRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in 2024: PoS, Scalability, and Market Predictions - The News Leader",
        "content": "William Mullane\n\nContributor\n\nStory by Binance\n\nEthereum is set to be one of the names to watch out for in crypto in 2024. Transitioning from an old way of operating (Proof of Work) to a new method called Proof of Stake, or PoS for short, Ethereum is getting a notable update. This makes it more energy-efficient and fair for everyone involved. Investopedia explains that this could be a game-changer for Ethereum's market worth.\n\nWhy is PoS Important?\n\nThe transition of Ethereum to Proof of Stake (PoS) marks a big change. Previously, Ethereum relied on a system known as Proof of Work (PoW) which involved computer competition to solve puzzles for transaction processing and Ether creation. This process consumed large amounts of energy.\n\nHowever, with the implementation of PoS, efficiency has improved. PoS allows users who hold and 'stake' their Ether to process their transactions, instead of heavily relying on mining. This approach significantly reduces energy usage, thereby making Ethereum more environmentally friendly.\n\nIt's not just about being environmentally friendly. The implementation of PoS in Ethereum aims to enhance the network's security. In the PoW system, an individual attempting to manipulate the Ethereum network would need to control over 50% of its computing power, which is an extremely difficult and costly task. However, with PoS they would have to possess than half of all staked Ether making it more complex due to the substantial investment required. Consequently, this makes the network more resilient against attacks.\n\nMoreover, PoS has the potential to bring fairness to Ethereum. Unlike in the PoW system where individuals with expensive computers have a significant advantage over others, PoS levels the playing field as it does not necessitate super powerful hardware; instead it depends on how much Ether one is willing to stake.\n\nCan Ethereum Handle More Traffic?\n\nScalability has been one of the big headaches for Ethereum for ages now. When too many people use it at the same time, it gets slow and expensive to use. Imagine a highway jam-packed with cars — that's been Ethereum on a busy day. But now, they're working on splitting this traffic more efficiently (something called 'sharding') and even creating express lanes (these are the Layer 2 solutions like Optimism and Arbitrum). A recent Forbes issue highlighted how these upgrades could make Ethereum faster and cheaper.\n\nWhat's the Word on Ethereum's Money Value in 2024?\n\nTalking about money, especially in crypto, is like predicting the weather — you know the general trend but can't be sure if it will rain or shine. However, the general feeling among experts, like those analyzing the market on Binance, is pretty optimistic for Ethereum. They think its value could go up with all these updates and that Ethereum is becoming rarer to own (thanks to the PoS model). But remember, crypto can be unpredictable, and government regulations can shake things up.\n\nThe Takeaway\n\nEthereum is transforming itself in a big way, becoming more attractive to everyday users and big investors as it looks to be faster and greener. However, there are challenges, especially with all the rules and regulations still being figured out in the crypto world. For those considering Ethereum, it is certainly a space to watch.\n\nThis article is for informational purposes only. Investing in digital assets carries a high level of risk and may not be suitable for all investors. Potential investors should ensure that they have an understanding of the risks involved, seeking professional advice where appropriate."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxON1FTcDdDelltMHhOSW1tUlpoWFdYSnVvYTljaVhfcm9QUTc1S3pTaUo0OFB5N2dQWHpnOVc3T0VtVkpfRS11QzVoZUkzVmxPNXJSZXlENjh1S0hjVEoxTjBaZHVTUmthdExRSjhiN0trTXNteXpNUWpxNjE2UHpESGJ6OWNEM1FTQjdQZVR30gGTAUFVX3lxTFBUbk5uYXhfOHpxZXJfM1hkektqTHB2N0lLT0U3NWR2bU9aaUN0UXVraEpsME9rWVY3SkVyOHp0Ti0tWXEwRUowQmtfRzgyR05DNmNGaXFLRXI4c0xNUjlPcjEwbG9NQW1Hem5qa2p6NmxzZjRhQWlQNVl1OF9aVzVUaGxRcVF5M3k1a3hBZDMwMXVYWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Break Above $10,000 in 2024? - CryptoPotato",
        "content": "Altcoin analyst Altcoin Gordon told over 400,000 X followers Friday that his year-end target for Ethereum is $11,250. That would be a 3.4X increase compared to current prices.\n\nBitcoin has received plenty of attention from the media since October between the SEC approval of Bitcoin ETFs in January and the upcoming fourth Bitcoin halving in April.\n\nEthereum supply dropping. Ethereum demand increasing. Do you understand? pic.twitter.com/txH5g9Eq4w — Gordon (@AltcoinGordon) January 18, 2024\n\nBut an Ethereum ETF is also in the works this year, and the network has been deflationary in supply ever since a very significant upgrade in 2022.\n\nMeanwhile, JP Morgan analysts are anticipating the Proto-Danksharding upgrade this year.\n\nEthereum Price Prediction: $11,250 By 2024\n\nAltcoin Gordon is targeting an Ethereum price of $11,250 by the end of 2024. He also predicts $27 Cardano (ADA), $111 Chainlink (LINK), and $0.47 Ripple (XRP).\n\nPrice targets for end of 2024 BTC $98,750\n\nETH $11,250\n\nADA $27\n\nLINK $111\n\nCOTI $3.27\n\nETHEREUM $9,800\n\nXRP $0.47\n\nUSDT $1.40 Too bullish or not bullish enough? 👀🤔 — Gordon (@AltcoinGordon) February 9, 2024\n\nThink that’s crazy? Web3 super-user, educator, and angel investor, Defi Dad says he could see Ethereum “ripping to $20K- $25K” this market cycle.\n\nHis remark was in response to hiFramework founder Vance Spencer pointing out the “Ethereum onboarding funnel” in 2024 will feature a diverse set of applications, from Gaming L2s, to Corporate L2s, to Social L2s, to “All of the other (hundreds?) of L2s spitting out tokens to acquire users.”\n\nEigenlayer Staking, Dencun, and Spot ETH ETFs\n\nEthereum expert Anthony Sassano recently told Forbes why he’s bullish for Ethereum prices in 2024:\n\n“I think 2024 is going to be a great year for the price of ETH as there are plenty of tailwinds headed ETH’s way, such as the birth of staking via EigenLayer, 2 major network upgrades—Dencun in March and Petra sometime in Q4—as well as spot ETH ETFs going live as early as May.”\n\nIn December, JP Morgan predicted that Ethereum would outperform Bitcoin in 2024 because of the EIP-4844 upgrade.\n\n“We believe that next year Ethereum will reassert itself and recapture market share within the crypto ecosystem,” JPMorgan analysts wrote in a Dec. 13 report."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNTEdwOW9ISG9BUU5MTkVvQU53OFViT1FWNUVOamw1d2s3Z0lWbm5sUGo2MWlZYWZIQUZwajVzYXU3RlVrcjR2ckhhNURiWmxBdWplRGl6WFpVY0Q3QlpJVFd0WkJmVkNaUWUxeVZRMEpKb21FMmNTOGRzaFhzSVRVN0VWT2FUSkd1dDNqSGhUTkFkLWFzckZiVl94QWxxdFhGcXMzZWQxLTlSQkpBVk52Wk1tQ0pnNkIybFpxStIBwgFBVV95cUxOaklqbjFEYlRLNVd1SFNlY2I3Ul91cllnb2dadUlBbEdVcTM0Rm5oYUVXeFNCWGVnZlh6cktKdnBieGY3ZEcyNDVfLTNPOXQxUGlaUG0weDR1VXNPWTl1bWRnWjllMkVxYmp3NE4xNXFjT25TR2c4NzNNQ05Qc0c4N0Zkc3lSZGRvZk96dzRyR3NMWWpYNGNadkRISHhPUjlFbmY0MndwM0h0bHhWbV9DWnZnbmkta1F4bWc3ZFEtQkhBUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Top Analyst Predicts 40% Ethereum Rally Once ETH Takes Out This Level – Here’s His Outlook - The Daily Hodl",
        "content": "A trader who caught the 2023 crypto breakout believes that Ethereum (ETH) may be gearing up for a big surge to a level last seen about two years ago.\n\nIn a fresh strategy session, crypto strategist DonAlt tells his 56,900 YouTube subscribers that Ethereum is one resistance level away from igniting a 40% move to the upside.\n\nDonAlt also says that a breakout on the ETH/USD pair could also force a rally in the Ethereum versus Bitcoin (ETH/BTC) pair.\n\n“I’m looking at ETH/USD weekly and I think if it crosses above $2,500 to $2,550, I think there is a world in which ETH starts squeezing even on the Bitcoin pair.”\n\nAccording to DonAlt, a break of ETH’s resistance around $2,500 could send the leading altcoin to $3,500, a price area last witnessed in April 2022.\n\n“That’s quite the move. That would basically be a 40% move. [A] 40% move on ETH/USD toward resistance and you have 27% on Bitcoin toward resistance, so you could argue that if that breakout happens, maybe you actually have a little bit more potential on ETH/USD.\n\nIt’s a tough one and it’s a risky one but I think it’s not the worst trade in the world.”\n\nAt time of writing, ETH is trading for $2,511, a fractional increase in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/monkographic"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE1ReGNIcmV5WXNYNXNydDM5S0VQRDFxdV9rTUh3NDFtelY4ZU9vYTZ4dmpaSmRXSFFQRXFtdlh0enRCbXh3N2ItVUhqN1FPXzhvaENLRm1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "What Is ERC-404? A Guide to the New Semi-Fungible Token Standard - Unchained",
        "content": "The new, experimental ERC-404 standard combines the elements of ERC-20 and ERC-721 tokens to create semi-fungible digital assets.\n\nEthereum is home to a wide range of token standards that enable specific functionalities for crypto tokens. ERC-20 and ERC-721 are the two most popular token standards on the Ethereum blockchain. ERC-20 is the token standard for fungible tokens, while ERC-721 is the standard for non-fungible tokens (NFTs).\n\nAnd now, a new experimental token standard has emerged called ERC-404. The token standard combines the elements of ERC-20 and ERC-721 tokens into one semi-fungible digital asset.\n\nRead on to learn what the ERC-404 token standard is, how it works, and how it differs from ERC-20 and ERC-721.\n\nWhat Is ERC-404?\n\nThe ERC-404 is an experimental token standard that merges the features of the ERC-20 and ERC-721 token standards to create a ‘semi-fungible’ token with the characteristics of both fungible and non-fungible tokens.\n\nPseudonymous creators “ctrl” and “Acme” on the Ethereum network created the unofficial token standard.\n\nThe ERC-404 standard allows developers to develop fractionalized NFT collections that can be freely used and openly traded in NFT marketplaces. Currently, unlike with fungible tokens, NFT holders cannot purchase fractions of a digital asset.\n\nAlthough fractionalized NFTs exist, they primarily rely on an institution specializing in NFT fractionalization to lock the fractionalized NFTs in a crypto wallet and issue tokens depicting that non-fungible token. While these fractionalized NFTs are freely traded in the market, they may not precisely match the value of the locked NFTs.\n\nAnd this is what the ERC-404 token standard aims to solve.\n\nHow Does ERC-404 Work?\n\nThe ERC-404 token standard enables the creation of semi-fungible tokens by utilizing token burning and token minting mechanics to allow for fractional NFT transfers.\n\nThe token standard links issued tokens to a non-fungible token. The associated NFT is minted to your wallet if you purchase a full token. If you opt to sell a fraction of the token, the linked NFT representing that fraction is burned.\n\nThus, the token standard makes it possible for multiple wallets to hold fractions of one NFT.\n\nA new NFT is automatically minted if a wallet holding multiple fractions of a token buys enough to hold an entire token.\n\nIn short, if ERC-404 goes through the official Ethereum Improvement Proposal (EIP) process and is added to the Ethereum ecosystem, it will provide room for the native fractionalization of non-fungible tokens, which will make it possible to experiment with NFT use cases.\n\nHow Does ERC-404 Differ from ERC-20 and ERC-721\n\nLet’s take a look at how the ERC-404 token standard differs from the ERC-20 and ERC-721 token standards in the table below.\n\nERC-404 ERC-20 ERC-721 EIP Lacks a formal EIP Proposed and introduced through EIP-20 Proposed and introduced through EIP-721 Token standard Semi-fungible token standard Fungible token standard Non-fungible token standard Asset class represented Represents fractionalized digital assets Represents a specific type of fungible digital asset Represents a class of unqiue digital assets Tokens standard creators “ctrl” and “Acme” Fabian Vogelsteller William Entriken, Dieter Shirley, Jacob Evans, and Nastassia Sachs Token IDs Not known Lacks a token ID Features a unique token ID for each asset Status Under development Developed Developed\n\nWho’s Already Using ERC-404?\n\nThe ERC-404 token standard is experimental and hasn’t undergone the official EIP process. Still, developers are already using it when building their projects.\n\nBelow is a list of the three projects created using the ERC-404 token standard.\n\nPandora : Pandora is a newly launched token. It’s the first project employing the ERC-404 token standard to launch. Pandora is made up of 10,000 PANDORA ERC-20 tokens and 10,000 linked ‘Replicant’ non-fungible tokens. A correlated Replicant NFT is minted to your wallet if you purchase a full PANDORA token.\n\nDeFrogs : DeFrogs offers 10,000 Pepe the Frog-based NFTs and is considered the first ERC-404 picture-for-profile (PFP) NFT collection.\n\nMonkees : Monkees is also a PFP collection utilizing the ERC-404 token standard. It comprises 100 NFTs that have six traits and ten attributes.\n\nThe Takeaway\n\nWhile the ERC-404 token standard continues to show the adaptability of the Ethereum blockchain, it’s important to remember that the standard is only experimental and not official. It has yet to be submitted for review as an EIP and hasn’t undergone the required external audit.\n\nAs such, although already being utilized, the token standard could have some unknown flaws, which introduces a risk to token holders. Additionally, as an unofficial token standard, major NFT marketplaces and platforms currently don’t support it.\n\nWhile there’s no denying that the ERC-404 token standard opens up new use cases for NFTs on Ethereum, it remains to be seen whether its developers will successfully propose and get the approval needed for it to become part of the Ethereum ecosystem."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQd0h2VmRucHptQWltOHQwRlBITUpEVDc4blNZdmFLUk04Und4MnVHLVNNd0kzRnM4SEM4N3RKNFN5RTk5VFJhY0FmRkxfekYxWkhCeTJpc1luRTlvRzN2bzQyQk9UUGMxWmFEdENRamJ6MWRaVUhnRFN0X0VrN0ctdFVYUWUydlFHQzBsRTd4VkEwTEpFVFVIUmVLSlQwZ0pzX1k2aFNWMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton files for spot Ethereum ETF, becoming eighth applicant overall - CryptoSlate",
        "content": "Franklin Templeton has become the latest asset manager to apply for a spot Ethereum exchange-traded fund (ETF) with the publication of a Feb. 12 filing.\n\nThe company detailed its plans in an S-1 registration statement with the U.S. Securities and Exchange Commission (SEC). Like other similar proposals, the fund will issue shares representing its assets — primarily Ethereum (ETH), which will be held by a custodian on its behalf. The fund also aims to reflect the price performance of ETH.\n\nFranklin Templeton identified Coinbase Custody as its cryptocurrency custodian and Bank of New York Mellon as its cash custodian, administrator, and transfer agent.\n\nThe proposal only allows for cash creations and redemptions, as opposed to in-kind creations and redemptions that would allow for certain participants to transact in crypto. It also describes how potential Ethereum staking rewards could be treated as income for the fund. Competing applicants Ark Invest and 21Shares also addressed these issues in an amended filing on Feb. 7.\n\nReuters stated that Franklin Templeton is the eighth asset manager to apply for a spot Ethereum ETF. Separately, the firm’s Franklin Bitcoin ETF (EZBC) was one of several spot Bitcoin ETFs to gain approval in January.\n\nSEC must decide on VanEck’s ETH ETF in May\n\nThe SEC must decide to approve or reject a competing spot Ethereum ETF application from VanEck by May 23, 2023 without further postponing its decision. The securities agency will likely decide on several other similar applications with similar content at that time.\n\nOne Polymarket prediction market predicts a 48% chance that a spot Ethereum ETF will be approved in May. James Seyffart expects 60% odds of approval in May, while JP Morgan analyst Nikolaos Panigirtzoglou anticipates 50% odds of approval in May.\n\nStandard Chartered believes that a spot Ethereum ETF will be approved in May, while TD Cowen expects that this type of fund will not be approved until 2025 or 2026.\n\nEdit: This piece originally stated incorrectly that Franklin Templeton is the ninth asset manager to apply for a spot Ethereum ETF.\n\nEthereum Market Data At the time of press 7:36 pm UTC on Feb. 13, 2024, Ethereum is ranked #2 by market cap and the price is up 0.14% over the past 24 hours. Ethereum has a market capitalization of $316.28 billion with a 24-hour trading volume of $20.36 billion. Learn more about Ethereum › Ethereum $2,632.01 0.14% Crypto Market Summary At the time of press 7:36 pm UTC on Feb. 13, 2024, the total crypto market is valued at at $1.85 trillion with a 24-hour volume of $81.83 billion. Bitcoin dominance is currently at 52.26%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOemNNMGVpaEZDeE5PbVVtakNySFhzeHJJbTktU1NBbnljMTZxSEVfSDZCaHZncHpFVDlIcm1TOUlINGt5eTE3N0VaTFp6WDRNVVJOMU5YNHFTU2pDd0VLbHU4M09SeTRMclpVRlpIWGZRTXNEVUhvZmFLRHdsQzBNdk9pcVlMeTJDTnlNRWZ2Tnk5UdIBlwFBVV95cUxON05KT0lta2NNOTUwWDdfUm5mRVdpdjd1Ti11dGc2aGVXWFZvV1h0WHVpQlU1TldGclQ2dFl2Y21TS3NvT2VJUzRUZHJ5dXRVNHNFOWlxTTlFTmRnODZoUlV5Zlp1OW1DYW8wY3RkdXk2TTJ2ZVgzb3praE1acmJpSTVjcHhLcmMxQWNjclhZbXBjWXg5OXA0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton Joins Ethereum ETF Race - CoinDesk",
        "content": "The SEC has so far delayed all decisions to approve an Ethereum ETF, as expected by experts. JP Morgan currently sees a less than 50% chance that such a fund would be approved before May. Although traders from Polymarket, a decentralized prediction platform, seem to be betting, there is a 50% chance that the ETFs will be approved by May 31."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBYcUVKWTU4M2hZSGw1M0V6YkYzZlZYSllIb2ctcWwzTzVoUUR1RldyOEtEM0laOUUzUkpmUnQwUGhBdXk3SVNKbEJYa2NKMlJHT3VmaHpPYTNwQTZ0Xzdsek52X1VkaUM0ZGtNWDc3cEVVODdBQVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Why the US and China are moving Ethereum (ETH)? - The Cryptonomist",
        "content": "SPONSORED POST*\n\nInvestors in the USA and China, two of the world’s biggest economies with a combined GDP of $43.4 trillion, are switching their crypto holdings from Ethereum (ETH) and Cardano (ADA) to Kelexo (KLXO), a promising Web3 lending platform tipped to be one of the top coins to buy in 2024.\n\nLet’s explore what makes Kelexo (KLXO) a top pick over Ethereum (ETH) and Cardano (ADA).\n\nSEC-Compliant Crypto Firm Picks Ethereum (ETH)\n\nPrometheum Inc., the only SEC-compliant crypto firm in the U.S., has chosen Ethereum (ETH) to be the first digital asset that it will handle on behalf of its clients starting at the end of March. This is projected to boost Ethereum’s (ETH) standing among retail and institutional investors.\n\nThe positive development can potentially drive up the price of Ethereum (ETH), the second-largest blockchain by market cap. Ethereum (ETH) saw its price surge from $2,245.17 on February 1 to $2,364.45 on February 7, indicating a gain of 5.31%.\n\nDespite this, analysts have stated that Ethereum (ETH) has little room to wiggle, leaving its investors scrambling to cash out and buy Kelexo (KLXO).\n\nCardano (ADA) Falls 19% Year-to-Date\n\nThe start of the year has not been kind to Cardano (ADA), a proof-of-stake blockchain platform that wants to bring about positive global change. Cardano (ADA) has fallen 19% year-to-date (YTD) after its price decreased from $0.5942 on January 1 to $0.4814 on February 7.\n\nAnalysts have sounded the alarm bells by claiming that the price of Cardano (ADA) could fall to $0.4 or below. As its profits dwindle, investors are pulling the plug on their Cardano (ADA) investment. This is especially true for short-term investors who don’t have the patience to hold for a long time.\n\nThis has seen some Cardano (ADA) investors in the USA and China re-allocating their holdings to new cryptocurrencies such as Kelexo (KLXO).\n\nIs Kelexo (KLXO) the Best Crypto Investment in 2024?\n\nEvery crypto investor is interested in picking the top crypto coins. Kelexo (KLXO), a Web3 marketplace that will connect lenders and borrowers, has all the signs of a future blue-chip cryptocurrency.\n\nKelexo (KLXO) is aiming to fulfill the true ethos of crypto by offering its services to the underbanked and underserved. To achieve this, it will offer lending and borrowing services to people with a poor credit history and will not require the KYC procedure on its platform.\n\nFees on the platform are lower than on Kelexo’s (KLXO) competitors. By helping a broad range of individuals to participate in the financial markets, Kelexo (KLXO) will become a force to reckon with in the DeFi space.\n\nWhat makes Kelexo (KLXO) even more appealing to investors is that it will share its revenue with presale investors for as long as they hold the tokens. Investors can own Kelexo (KLXO) tokens by buying for a low price of only $0.022 during the ongoing and highly subscribed presale.\n\nFind out more about the Kelexo (KLXO) presale by visiting the website here.\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0wVWw3bkZITFE1YjRYV2ZnbTJHLVBKdTl0Tkk1T2Z1SDdfc0RlSVkzX2RQTVJUbW95dlV1QU95YjA5ZlhVbF9Jd1FGSUpXQmZaSV93bFhNSzB2a3dxZWZkdGxn0gFnQVVfeXFMTUVXM09ONTdOREEtcXVERUhSM3NhbURaNGFEZUZzMlJhemNmVnpUSmZORXkwRmJxTDlsSWktWkhGVXU4bThyQnhKWUc0bFFueVJkM0pHYVdEekpWWGFENFBFX2d5V1Jxbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "New Crucial Ethereum Update Released - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nGo Ethereum has announced the launch of Geth v1.13.12, preparing the ecosystem for a major upgrade scheduled for March 13, 2024.\n\nAdvertisement\n\nGeth v1.13.12 incorporates the mainnet fork number for Cancun, marking a decisive step toward implementing a suite of evolutionary Ethereum Improvement Proposals (EIPs). The specifications, which are publicly accessible for review, introduce pivotal changes that promise to refine the operational mechanisms of the Ethereum Virtual Machine.\n\nAmong the notable EIPs included in this update are:\n\nEIP-1153: Introducing transient storage opcodes for optimized data handling. Advertisement\n\nEIP-4788: Incorporating the Beacon block root within the EVM, enhancing interoperability between Ethereum and its Beacon chain.\n\nEIP-4844: Facilitating Shard Blob Transactions to enable sharding and improve scalability.\n\nEIP-5656: Adding a new memory copying instruction, MCOPY, for more efficient data processing.\n\nEIP-6780: Restricting the use of SELFDESTRUCT to the same transaction, improving system resilience.\n\nEIP-7516: Introducing the BLOBBASEFEE opcode to calculate base fees for blob transactions.\n\nThe release also resolves a critical bug related to Geth miner tip enforcement, ensuring the network operates more reliably.\n\nAccompanying the Cancun upgrade, Go Ethereum is providing updated Grafana dashboards for InfluxDB and Prometheus, allowing users to monitor network performance with greater precision. The release packs an array of various improvements, which can be found on the official announcement page on GitHub.\n\nThis Ethereum client update is a testament to the continuous evolution of the Ethereum ecosystem, reflecting the dedication of developers to enhance the blockchain’s capabilities. With these changes, Ethereum takes a step closer to its vision of a more efficient, scalable and interoperable network."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNNTFJZC0zckVpZ0ZMZk5GY1lCaFJBalNBVlhQdHpCV0ZxSnZnZ2Q3ZktPR1N6bzlmUU1JZE5IalRzeEVrYjY1b01VRVFGYVNpWjlOUldTZzF6STBDalBuYWNsU3N2YlM0ZmtybE9LUFF3Q2ttRXZGSVpZdjhJT3lybjVVdE85emZ6V1V3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "7 Cryptos Expected to Outperform Bitcoin in 2024 - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has been on a tear lately, with the price of the world’s largest cryptocurrency recently surpassing $49,000 per token at the time of writing. However, while Bitcoin is set up for more potential gains in 2024 due to major catalysts like the upcoming halving in April, savvy crypto investors know that smaller altcoins can often outperform Bitcoin, especially during bull market cycles.\n\nI will look at seven cryptos that I believe have the potential to outperform Bitcoin’s returns in 2024. A smaller market capitalization leaves a lot of room for upside. That said, some of these picks are still established names that should deliver steady returns, with the majority of these picks centered around more speculative “moonshot” bets that could exponentially increase in value if certain catalysts play out. Let’s dive in!\n\nEthereum (ETH-USD)\n\nA stylized version of the Ethereum logo. Ethereum Price predictions.\n\nSource: shutterstock\n\nEthereum (ETH-USD) has outperformed Bitcoin in every cycle since its inception, and I believe this cycle will be no different. As the primary driver behind Web 3.0 innovation, Ethereum seems poised for tremendous growth in 2024.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe top decentralized applications and NFT projects continue to be built on Ethereum, cementing its status as the leading smart contract platform.\n\nImportantly, Ethereum recently transitioned to a proof-of-stake consensus model. This greatly reduced the issuance rate of new Ethereum tokens, making the world’s second-largest cryptocurrency deflationary for the first time. With Ethereum’s burn rate now exceeding that of its mint rate, a supply shock could strongly benefit prices. Additionally, as more developers build Web 3.0 apps on Ethereum, demand for Ethereum via transactions on its network should continue climbing.\n\nI’m especially bullish on Ethereum due to this network’s ties to some of the most promising metaverse, DeFi, and NFT projects that rely on the Ethereum network. These applications relay on Ethereum to power transactions and run smart contracts. As these nascent sectors grow, Ethereum adoption should surge as well. With strong network effects firmly in place, I expect Ethereum to continue to outpace Bitcoin’s gains.\n\nEthereum also boasts top-notch security with its large community of validators. Attacks are virtually impossible at this scale. Thus, with no serious “Ethereum killer” in sight yet, Ethereum enjoys a dominant position in the world of Web 3.0 infrastructure. Unless unforeseen circumstances arise, I believe the runway is clear for Ethereum to exponentially increase in value in 2024.\n\nStory continues\n\nKaspa (KAS-USD)\n\nHand pointing upward next to upward trend stock chart in purple and blackish blue lighting, symbolizes growth stocks\n\nSource: shutterstock.com/Lemonsoup14\n\nScalability remains one of the biggest challenges in the crypto realm. However, Kaspa (KAS-USD) offers an elegant solution with its cutting-edge blockDAG protocol called GHOSTDAG.\n\nUnlike traditional blockchains, GHOSTDAG leverages a directed acyclic graph structure. This allows parallel blocks to coexist, while allowing the network to maintain quick consensus ordering. As a result, Kaspa can handle extremely high throughput with miniscule transaction confirmation times.\n\nInnovative architectures like GHOSTDAG will become highly valued as scalability pressures increase across decentralized networks. By avoiding the inefficiency of wasted orphaned blocks, Kaspa unlocks a lean and effective scaling approach that is not bogged down by excessive hardware requirements.\n\nFrom my first recommendation of Kaspa back at 2 cents back in July 2023, this token has already climbed 600% to 14 cents at the time of this writing. Yet, its current $3-billion market cap still seems small compared to its potential. As developers recognize the scalability promise of GHOSTDAG, Kaspa could achieve a market cap of $10 billion or more.\n\nIn an era where high Ethereum fees occasionally throttle applications, blockchain projects would do well to evaluate alternatives like Kaspa. Its novel hybrid PoW/PoS consensus and ability to run public and private networks make Kaspa surprisingly versatile. For these reasons, I believe this project has plenty of upside ahead, despite already generous gains for early investors.\n\nLibra Incentix (LIXX-USD)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nLibra Incentix (LIXX-USD) seems positioned for a major breakout in 2024 driven by high-profile partnerships at the intersection of sports and commerce. Libra’s loyalty platform has teamed up with ComAve, an online shopping portal which has surged in popularity due to its partnerships with major football clubs like AC Milan and Crystal Palace.\n\nAdditionally, Libra Incentix is collaborating with Tamias POS, which also continues to secure deals with prominent sports teams and brands. As the exclusive loyalty token provider for these platforms, Libra offers fans a tokenized incentive program.\n\nThis focus on mainstream sports partnerships marks just the initial phase in Libra becoming the most widely adopted crypto loyalty solution. By catering to the massive global sports fan demographic, Libra Incentix can drive significant organic user growth and transaction volume for its network.\n\nThe opportunities appear tremendous still. The sports industry is on pace to reach a staggering $681 billion valuation by 2031, and I think this number could be higher as it benefits from crypto adoption.\n\nWith LIXX serving as the backbone loyalty mechanism across multiple major players in this booming niche, this project’s real-world usage is set to accelerate exponentially. As the LIXX token becomes deeply integrated into mainstream fan experiences and shopping through influential partners, Libra may emerge as one of the most promising crypto projects in terms of user reach.\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nWhile Ethereum remains the dominant smart contract platform, “Ethereum killers” like Solana (SOL-USD) have managed to carve out solid market share in areas like NFTs. With transaction fees under 1 cent, Solana provides a fast and ultra-affordable blockchain environment for developers. This has fueled tremendous adoption, despite Solana’s previous struggles with stability (given a number of big outages).\n\nHowever, the Solana team continues refining the network, and outages are becoming less frequent. As demand for scalable Layer 1 solutions grows exponentially in 2024 and beyond, Solana’s upside remains enormous at these levels.\n\nUnless catastrophic failures occur, significant market share gains from Ethereum seem likely as congestion and high gas fees push developers to seek alternative platforms to build on. I think Solana’s unique infrastructure could solve Ethereum’s speed and cost problem, making this a top token to consider for long-term growth.\n\nAleph Zero (AZERO-USD)\n\nAn image of a speedometer with the words \"exponential technology\" at the maximum\n\nSource: iQoncept / Shutterstock\n\nAleph Zero (AZERO-USD) represents another emerging Ethereum competitor that aims to resolve lingering issues like congestion and uptime struggles. Leveraging a novel consensus protocol, Aleph Zero has achieved exceptional transaction finality in under one second, while being able to handle tens of thousands of transactions per second.\n\nHowever, Aleph Zero’s design compromises raw decentralization for that speed. With just 162 validators securing the network, it utilizes a model similar to Tron (TRX-USD). Still, Aleph Zero directly tackles recurring network capacity and stability problems developers face. With robust functionality catering to builders through EVM support, NFT/token capabilities, and multi-language SDKs, Aleph Zero remains well-positioned to capture dissatisfied talent if ecosystems like Ethereum and Solana stall in providing reliable infrastructure.\n\nConsidering its relatively tiny $188 million market cap, Aleph Zero offers tremendous upside potential if it attracts an influx of builders and users over the coming years as part of the next generation of blockchain ecosystems.\n\nRender Token (RNDR-USD)\n\nThe Render (RNDR) crypto logo displayed on a smartphone screen.\n\nSource: Maurice NORBERT / Shutterstock.com\n\nRender (RNDR-USD) is a decentralized GPU render farm and 3D visualization platform. It is primed to capture tremendous growth as demand for computer graphics and GPU compute resources scales exponentially with trends like the metaverse, AR/VR, 3D modeling, and video gaming.\n\nThe Render network has already rendered 2.36 million frames in Q3 2023, using GPU capacity provided by regular computer owners looking to passively earn crypto. As more digital assets get created for emergent digital worlds and immersive experiences, Render’s spare capacity becomes extremely valuable.\n\nWhile RNDR currently trades 47% below its 2021 high, I expect surging adoption once crypto markets turn bullish again. Relative price resilience shows institutional interest in this low-key project. With a fixed token supply and staking incentives, Render has major upside as its network usage expands.\n\nInjective (INJ-USD)\n\nLogo for Injective Protocol (INJ-USD)\n\nInjective Protocol (INJ) cryptocurrency coin symbol. Blockchain technology. INJ in bubble\n\nDecentralized finance has seen tremendous growth recently. However, I would argue that DeFi remains an under-appreciated crypto sector. That’s because DeFi provides a central value proposition for the entire cryptocurrency sector, enabling private, decentralized financial access.\n\nInjective Protocol (INJ-USD) is one DeFi project uniquely-positioned for massive upside. In recent weeks, Injective has gained traction by offering robust decentralized trading infrastructure for next-generation DeFi innovation. This infrastructure includes a fully on-chain order book resistant to exploitation.\n\nAdditionally, Injective fully supports all major financial instrument types on-chain, including spot contracts, futures, perpetual contracts, and options. Its Cosmos-based blockchain leverages the Tendermint consensus for instant trade finality and lightning-fast 10,000+ transactions per second throughput.\n\nAdvanced interoperability and bridging across Ethereum, alternative networks like Solana, and non-EVM chains also gives Injective a key advantage. It basically provides the flexible core “Lego pieces” for developers to build multi-chain DeFi products.\n\nAs the cryptocurrency sector gets further integrated into mainstream finance over time, critical backbone infrastructure projects like Injective seem primed to benefit.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos Expected to Outperform Bitcoin in 2024 appeared first on InvestorPlace."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOTTIxOEs0aTlBYmlmeHZPOWFPZGdIekZ3MWxxN3lSZ3ctdnd3NF9sSFIzX0k2cUNmNnpzb1BYV0c0aGxJaWJkczcyVEY0aDNXVnhYV3dGMjdDYXBDYmJ0bVR0T2dMNHotUmV0VzhMcUkycmpDWUF5cjhiQTU0dVFmemNEN1RoMGVsSWktajB0OUw3bU5VdFl1NUJoY202aUZENVZnMFBHc1NLdnFuOUhCMG9sb9IBuAFBVV95cUxPTEU2X09KNWdCT2ZkLXhQdzE1SFNtU1NaWFQ3VHN3aHdPbFBSRjNKTGNZTEYtUkpSaVI5RFpsUFZYa0pJeWFYNGZ3QTFMUWNYRnpocGdSbE44SDRmRXFvclVid09FMXlkaGZCR2pVdWpzRlJ2Nzhua0pUcTNXRGVLa0pkMzZhRGlEUWF5RGJTTmk1bGNfekU2MjJ0OWI3b0hXQjAxLXlZZERWOGRwd2x2V25MaUF1WS1m?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "$3,000 Is Next for Ethereum (ETH), Cardano (ADA) Shows Massive Breakthrough, Solana's (SOL) Suspicious Rally - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAs the Ethereum network continues to evolve with its recent ERC-404 token standard being massively implemented, its native asset is finally gaining some traction on the market. It is showcasing promising growth, and its price trajectory suggests that the coveted $3,000 mark may be on the horizon.\n\nAn analysis of Ethereum's price chart reveals a steady upward trend, with the asset recently crossing the $2,500 threshold. The next significant resistance level appears to be at $2,600, a point that has previously seen sellers stepping in. A break and hold above this level could pave the way for Ethereum's ascent toward the $3,000 psychological and technical barrier.\n\nSupporting this potential growth scenario is the continued development of the Ethereum network, including the anticipated benefits of the ERC-404 update. This new standard is expected to enhance the utility and interoperability of tokens on the Ethereum blockchain, potentially increasing demand for ETH as the required \"fuel\" for deploying tokens.\n\nAdvertisement\n\nHowever, there remains a cautionary scenario to consider. Ethereum's rival, Solana, has recently experienced a slowdown due to network outages, which could potentially cause a ripple effect across the broader crypto market. If such events lead to a loss of confidence in blockchain networks or a shift in investor sentiment, Ethereum could face a setback.\n\nA potential price drop scenario could be triggered by technical rejections at the $2,600 resistance level, coupled with negative market sentiment stemming from issues in competing blockchains like Solana. Should Ethereum fail to sustain its momentum, a pullback toward the local support level at $2,300 may occur, where buyers have previously shown interest.\n\nCardano remains strong\n\nCardano (ADA) has recently demonstrated a significant breakthrough in price action, suggesting a bullish trend could be forming. Cardano's price has been tracing an upward trajectory, recently punctuating this ascent by breaching a key resistance level.\n\nA technical analysis of ADA's chart indicates that the cryptocurrency has managed to surpass the resistance near $0.515, which had previously capped several attempts at an upward move. Closing above this level could signal newfound confidence among investors and pave the way for further gains.\n\nOn the growth front, if ADA sustains its momentum above this resistance turned support level, the next target for the asset could be the $0.580 mark. Such a move would represent a significant uptick in market valuation and could attract more attention to Cardano as a viable investment in the blockchain space.\n\nHowever, every market scenario has its counterpart. Should ADA face rejection at higher levels, there is potential for a pullback toward the local support at $0.485. A drop below this point might compel traders to reassess the short-term outlook for Cardano, potentially leading to a consolidation phase or even a deeper correction if broader market sentiment turns negative.\n\nSolana slows down\n\nThe recent price movements of Solana have caught the eye of many in the cryptocurrency community, with its ascent on the charts prompting discussions around the sustainability of its rally. Despite the uptick, there is a pervading sentiment of caution as the momentum behind the rise appears to lack conviction.\n\nAn analysis of Solana's trading patterns reveals that while SOL has made strides to overcome resistance, achieving a local high of approximately $112, the rally's foundation seems tenuous. The support level to watch is around $98.89, where SOL has previously found a degree of stability. Should the asset maintain above this level, it might dispel some of the skepticism surrounding its recent performance.\n\nHowever, the growth scenario for Solana is shadowed by concerns of a potential breakdown. The momentum indicator on the charts suggests that the energy behind the rally is not as robust as investors might desire. If Solana fails to sustain the buying pressure needed to push higher, it could see a retreat back to the support level or even lower, which might trigger a more pronounced sell-off."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQR21hLWg4RndxdVBET2tpQnA3WklxR0tsdkdheGxzYmVENUg2V2RLMW5rY1BRTkM2emNpNzZwZWNzalluSlZzdUl0YzVUQV9PYWlLQ0t4anZ1MjRsZTVCTng2bXBLamNqY25BWXVBZGstSXgwajhjQVRIZmxIOUhOUEpDeWJDZnBBa0U0VTVVT2lyOE1UMTFCOFN0dDNTQWFyZ0RwYnVNSW44N2t4WVNQWnBvRkFSbm1FZThpQW92X1ZUYUwtZGtQMmhiSk1xaE5zcTRsRER5U3rSAd4BQVVfeXFMTUFuRUp4TDdkbDJ2VUhNWDBST05ldC00MGRINTJ4WXBMbjBkb1MyZVBZS1hPVHZZeTJnaXFXYTBxZlhJb0xEbl9wd283RV9aZU1GeDlNR2xzblJac000WFJwUFhnZWswUmFOdUFHeWdUNHd4blFNU0dKbG9sVWhhY3h0Yl9Qd2twdXBubWRySngzUUJqVTEwSmJLVVpZQTdGd3ZYZkRmTnZSaGJ6aWlabXl2WDdRLS1vZml6Qm1Gd2JreDF4SEFYVGw0dDV0UWF6UmIzam5BTHR6YS0yZUFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Whales Abruptly Move $350,000,000 in Bitcoin, Ethereum, Solana, Litecoin and XRP – Here’s Where the Crypto Is Headed - The Daily Hodl",
        "content": "Wealthy crypto investors are moving hundreds of millions of dollars worth of digital assets, including Bitcoin (BTC) and Ethereum (ETH), as a new week begins.\n\nAccording to the address tracker Whale Alert, crypto whales have abruptly shifted $350 million worth of virtual currencies in the last 36 hours.\n\nSeveral gargantuan transactions involving Bitcoin and Ethereum are on Whale Alert’s radar.\n\nAll three transactions sent BTC from unknown wallets to crypto exchanges, where the crypto could potentially be sold on the open market.\n\nBitcoin is trading for $49,777 at time of writing, a 3% increase during the last day while ETH is worth $2,559 at time of writing, up 1.6% in the last 24 hours.\n\nOther transactions noted by Whale Alert involve altcoins Solana (SOL), Litecoin (LTC) and XRP.\n\nThe XRP transactions appear to be connected to the crypto payments company Ripple.\n\nMeanwhile, the Litecoin in question was moved off an exchange, and a multi million-dollar pile of Solana was sent to Binance.\n\nSolana, LTC and XRP are trading for $109, $0.53, and $0.082 at time of writing, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQRGkxMjdBV3R4UVhkZmJvLURDNzAxeHVCb0twS1NVSTlybEJfYmNYLWR1SzJhczJ0YnI1clMtdURFMUR4ZUJ1c3FMS29SOXJFNzRHX1NlN2pWX3VWWjJXa0tuUTIwdVA3blFlUlhUbUtQU1ZZTTJQTi1oaVdZLXZabVQyQlIybmRqc28xM2tjUG9wOUEzbjZSRnljaTVCdHJ3LTA1TUY0TENLb2JqWUY2YXdndkJYN0w5MGJjQjVKVmNMWWd0eUJWc1VnSm5HQdIB0wFBVV95cUxOaHNRdWhjbmtsNHpTWHR6YUZsdXZ5b3poVVFlbjUxdDJaOHR5Z2FuWnR1LTlkU2VKR2VNZDJBQ3gwMk02a0g3MTZ4aUFMVEhabko5THIwOHI2RkdXQzNjeHluZTZKWkZSYzNxY1M3MXdKaGZTWTZrU25IZTktN001eFA0R2dOZlB4eEJka1F0dzRCX21nX3VpQXNONnN0ZGZZMGJZdGQ1RXQtVlNlUUdYeUhINHR2THducWQ3bzRULVRfaTM1U3QzLUxTQndDOXd3Tmtr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Michaël van de Poppe Says Altcoins Will ‘Go Higher Than You Imagine,’ Updates Analysis on Ethereum (ETH) - The Daily Hodl",
        "content": "A widely followed crypto analyst says the collective altcoin market cap will rise much higher than most traders expect.\n\nMichaël van de Poppe tells his 692,800 followers on the social media platform X that altcoins are going to reach unimaginable new all-time highs.\n\n“People are wondering, are altcoins going to break their all-time high?\n\nThe same question was asked in 2020.\n\nAnswer:\n\nYes, they will.\n\nYes, they’ll go higher than you imagine.\n\nProbably most of the heaviest runners don’t even exist, yet.”\n\nLooking at the top altcoin by market cap Ethereum (ETH), Van de Poppe says that ETH is in a ‘waiting game’ till its next big move up.\n\n“Waiting game until Ethereum starts to pick up pace.\n\nFlipped the $2,150 level for support, currently waiting for a breakout for continuation to $3,500.”\n\nETH is worth $2,560 at time of writing, up 11.3% in the last week.\n\nLooking at the top crypt asset by market cap, Bitcoin (BTC), the analyst says BTC is facing resistance, noting that he’s unsure where the crypto king will head after reaching the $50,000 level in a week or two.\n\n“Bitcoin looking at the resistance.\n\nMassive weekly candle, through which Bitcoin is back above $48,000.\n\nI’m personally interested in what price will do around $50,000 in the upcoming 1-2 weeks.”\n\nBTC is worth $49,737 at time of writing, up 16.5% in the last week.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Scrudje/DDevecee"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPZ3dqcTgxMlB6UlBrUFlWdEVQcE1pTG5UUTI3YmxkVFVRNTRuMnYtd1VRbkJ0SmhsWXIxTjVBS0NaeWlhaUdQT24yeDlQMmQwR2NUd3hoZGtYUzVyMk1heVRIbEtLZDRVaF9IWHgyVGR5eEN4UWxLQzVrMU9MY1NITTQ2MEJBMUd1d0NWaWNIOW5iVjhfMHZmNF9NLU5uWWZTdzBadXZST1JLamlVS2ZVSjVlZWhRdVI1TEhxNWdtZEpYOG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: the waiting list for validators sets a new record - The Cryptonomist",
        "content": "The waiting list for Ethereum validator nodes has risen to 7,045, signaling a renewed interest in staking.\n\nEthereum and the increase in the waiting list to become a network validator\n\nAccording to ValidatorQueue’s data, it seems that the waiting list to become new Ethereum validators has increased to 7,045. This value is the highest since October 6, 2023.\n\nThis means that the number of users who have joined the queue to register as validators of the network has increased, which will only be possible by staking their ETH.\n\nNot only that, the current long waiting list seems to represent over 225,000 ETH, equivalent to 562 million dollars. In general, it will take about 48 hours to clear the registration queue.\n\nAnd in fact, Ethereum limits the number of new validators that can join the network for the time it takes to process blocks on the blockchain. In practice, this moment lasts approximately 6.4 minutes.\n\nThe limit causes a backlog of registrations that leads to a waiting list for new validators, who are already ready to stake their ETH.\n\nSpecifically, to become an Ethereum validator, it is necessary to stake at least 32 ETH, in order to participate in the execution of the blockchain through Proof-of-Stake. Each validator, in exchange for the staked amount, receives a constant yield rate.\n\nEthereum: the increase in waiting validators signals a renewed interest in staking\n\nThe long waiting list for the new Ethereum validators, in a way, also signals a renewed interest in thestaking activity.\n\nTo confirm this theory is David Lawant, research manager at institutional crypto-exchange FalconX. In this regard, Lawant says:\n\n“The resumption of staking activity on Ethereum indicates the first signs of renewed vitality”\n\nWhat is perplexing, however, is that this rush to stake future Ethereum validators is not improving the percentage of return obtained.\n\nAnd indeed, this yield percentage on ETH in staking is still 4%.\n\nThe price of ETH recovers ground and forecasts\n\nAt the time of writing, ETH has a price of $2,477, up +7% in the last week, and down -1.8% in the last 24 hours.\n\nIn reality, looking at the monthly chart, it seems that ETH is recovering ground, trying to reach again the $2,600 mark of mid-January 2024, which represents the highest price of the last year.\n\nAnyway, there are those who remain super positive about ETH price predictions, expecting a doubling by the end of 2024. This is the survey conducted by Fintech, which revealed the responses of 40 crypto industry experts who are optimistic about the future of Ethereum.\n\nAnd indeed, the forecasts speak of $5000 by the end of 2024, but also of figures exceeding four zeros within the next six years."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5seUJWLUxfR3FYMjVSYWRzd2h5YzlZUDdYUklESzNHS3lCV0hlODZIV1d6Y3FZXzNSa1hDVkxSRnotQUtEeDdaZG1QaVMyaURzdC1uYXhDRzVlN1AySmNxMmtqdnlDNWZnSktpNTFoZW9CLVFPRS1B0gF8QVVfeXFMT1N4RnpfNnlqZm83cXFTZlBrUTZabmFLclc3NTd1Nm9mYzlyRXZtVDhzMWFhM2hNTnA5a3R6eHJzbFpUTzN4LWFjcEtCNHdSTkRBdkI5NmE5aXRDT3ByNGZxVHdvM3F0TjgwOGlZdTFPaDgyTEo0cTRBbWcwZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum's (ETH) Last Hope Gone? ERC404 Volumes Plummets - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum ecosystem is facing a reality check as the innovative ERC-404 sector on Ethereum experiences a substantial drop. In the past 24 hours, the market capitalization of ERC-404 tokens has plummeted by 29%, with tokens like PANDORA sliding over 15%, DEFROGS tumbling over 22% and RUG collapsing by a staggering 38%.\n\nAdvertisement\n\nThe ERC-404 standard was hailed as Ethereum's beacon of innovation, potentially the new fuel for a bull run akin to the impact of NFTs in 2021 and ICOs in 2017. However, the sharp and swift capitulation in market capitalization raises a lot of unpleasant questions over its viability as Ethereum's \"last hope\" for a resurgence.\n\nThis standard was envisioned to create tokens that are both fungible, like ERC-20, and unique, like ERC-721, adding a layer of value through associated NFTs that could be rare or hold special significance.\n\nTaking PANDORA as an example, purchasing this ERC-404 token on exchanges like Uniswap not only grants the token itself but also an unique NFT, introducing an element of chance and gamification to trading and ownership. Acquiring a rare NFT could potentially amplify an investor's portfolio value, and selling it on platforms like Blur or OpenSea would simultaneously execute the sale of the linked token.\n\nAdvertisement\n\nThe current decline of ERC-404 tokens, however, signals potential trouble for Ethereum. The rapid devaluation challenges the premise that ERC-404 could lead to a new era of growth for Ethereum.\n\nIf ERC-404 tokens continue to lose ground, it could reflect negatively on Ethereum's capacity to innovate and sustain new developmental trends. Ethereum's future now depends on its ability to adapt and overcome the market's skepticism, finding new pathways to innovation that can revive confidence and investment in its ecosystem."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxONU5mcXpwM25UNXhNdlBKbXdoT2lSejl0UkM2Mk56RXpDTkNlZXUzU1ZJeEViWFlNMzJob3Q5UDdUYTBrRFNFMjhfOGZFbVJXT3JjUjFacDJZejhUeDlNd0xBSE1pQU1pZ2FqdjRncmpibWlrNVUwUWJiWWc3QzVlYjUyZ3BtQThVRk9TX3N3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "The crypto ICP is approaching the Kingdom of Ethereum - Cointribune EN",
        "content": "Mon 12 Feb 2024 ▪ 4 min read ▪ by Evans S.\n\nIn the crypto sphere where each day brings its share of news and challenges, a thunderous announcement has just shaken up the landscape: the arrival of the EVM RPC Canister in beta version marks a giant leap towards a long-awaited merge between ICP crypto and colossal Ethereum. This innovation promises to redefine the boundaries of interoperability and security within the blockchain ecosystem.\n\nA revolutionary innovation in the crypto sphere\n\nThe EVM RPC Canister presents itself as a fluid crypto gateway facilitating integration between ICP smart contracts and those of Ethereum. This technical advance eliminates many of the previously insurmountable obstacles for developers eager to merge these two worlds.\n\nBy streamlining the process of acquiring, managing, and paying for API keys for various EVM RPC providers, this service opens the door to more robust and secure decentralized applications (dapps).\n\nOne of the major contributions of the EVM RPC Canister lies in its ability to guarantee the security of dapps. With an ingenious mechanism of automatic consensus inference, each outgoing request to multiple RPC providers ensures unprecedented reliability and crypto data integrity. This aspect is crucial in a field where trust is the cornerstone.\n\nThe management of API keys, often tricky and a source of risky centralization, is greatly facilitated. Developers can now focus on innovation without being hampered by technical complexities and cost constraints associated with Ethereum’s RPC services. The promise of seamless interoperability with Ethereum is now more tangible.\n\nA bridge between two giants\n\nThe process of integrating this innovative crypto service is both simple and intuitive, demonstrating its creators’ commitment to democratizing access to blockchain technology.\n\nAn example of rapid implementation perfectly illustrates the ease with which developers can now weave links between ICP and Ethereum, paving the way for a multitude of unprecedented cross-chain applications.\n\nBeyond technical simplification, this initiative marks a step toward a broader vision of crypto interoperability. By making interactions between ICP and Ethereum not only possible but also straightforward and secure, the EVM RPC Canister lays the foundation for a more integrated and flexible decentralized ecosystem.\n\nA promising future\n\nThe excitement around the EVM RPC Canister reflects the community’s appetite for innovative blockchain interoperability solutions. Developers, users, and visionaries in the sector are now scanning the horizon, eager to discover the revolutionary applications that will emerge from this new dynamic.\n\nAlthough the project is still in its infancy, the prospects for improving and expanding its features are vast. Feedback from the crypto community will play a crucial role in the evolution of the EVM RPC Canister, ensuring its adaptation and refinement over time.\n\nThe arrival of the EVM RPC Canister Beta represents a significant milestone in the quest for smooth and secure interoperability within the blockchain ecosystem. By breaking down barriers between ICP and Ethereum, this service opens a field of unprecedented possibilities, promising an era of collaboration and innovation like never before. The journey is just beginning, and the transformative potential of this technological convergence is immense. Let’s stay on the lookout, for the story of crypto is being written before our eyes, and it promises to be exciting.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPbm1lSHM3Q3dQQkx0TEY1eDdFTEEzS3RDLUZlNVhEUGZaWGo2clBSbnZIMENoZ0V3bkhpMDc3RGxpaFh1NFRCV19GYmVmYmRORnBCalFsVzQwTTZqUVlTRno5bjZubVpCVU5wa21BamtpWUJOWlcyUktBT0JSUS02WGQxdGFIWFYwOWg3UWxFbm12aDZkWks1UVlpbENrSFhHbFNuRU5sZ3BtMVg4ZDlQRU1fYlBMcWk3OF9uc3JoMFdmWVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "In free fall the ERC-404 tokens, while the Ethereum blockchain awaits the Dencun update - The Cryptonomist",
        "content": "A few days ago, the trend of ERC-404 tokens exploded within the Ethereum blockchain, leading to an increase in interest in this new digital innovation and at the same time an increase in network gas fees.\n\nNow the prices of these new coins are plummeting, and they are recording double-digit daily losses.\n\nMeanwhile, Ethereum eagerly awaits the Dencun update, which will be completed on March 13th: ETH, in anticipation of these improvements, could soon see new yearly highs.\n\nAll the details below.\n\nEthereum blockchain: the hype for ERC-404 tokens ends immediately\n\nJust 10 days ago, a new token standard was launched within the Ethereum blockchain, namely ERC-404, which immediately caught the attention of enthusiasts with a crazy increase in the prices of these new experimental resources.\n\nThe most well-known, as well as the first to have made its debut in this new market niche, is PANDORA, which has grown by 400% in just 3 days of trading.\n\nBy itself, the ERC-404 standard represents a mere experiment by the Pandora team, which combines the characteristics of the ERC-721 and ERC-20 standards typical of the Ethereum blockchain, creating a hybrid token between an NFT and a fungible token (a semi-fungible).\n\nThe central idea behind this new standard is that when someone owns less than a whole NFT, the NFT disappears and the user only owns a fraction of a token. If they combine enough tokens to obtain a whole one, the NFT is returned to them, only it might be a different NFT.\n\nOver the weekend, after traders flocked to new ERC-404 tokens like PANDORA, DEFROGS, and MONKEES, causing frightening price increases, the first capital outflows were observed.\n\nSince February 9th, PANDORA, the crypto leader of this new trend, has lost over 50% of its value, seeing more than 100 million dollars evaporate.\n\nEven DEFROGS and MONKEES have dropped significantly compared to weekend prices.\n\nCoinMarketCap: PANDORA-USD chart\n\nThe enthusiasm for this novelty was immediately dampened after the news spread of a team of Ethereum blockchain developers who are working on an alternative implementation of ERC-404.\n\nThis alternative will be called “Divisible NFT“, abbreviated as DN-404, more performant and definitely much cheaper than the previous one.\n\nIts main developer, known as cygaar, said that the new standard could arrive soon, potentially shifting the focus of the degens.\n\nThere are also rumors that the developers of Pandora and those of Divisible NFT have entered into conflict with each other because they are working on similar technology.\n\nFor now, it seems that the market has priced in a greater interest in the upcoming novelty, which will significantly lower the fees of the Ethereum blockchain.\n\nAccording to The Block data, during the past week the 7-day moving average of transaction fees on the network reached $11, after increasing from $4 at the end of January.\n\nParsec Finance has pointed out on X that this rapid increase in fees is mainly due to ERC-404.\n\nAnalysis of ETH price awaiting Dencun: new highs coming\n\nWhile the prices of ERC-404 tokens suffer from competition from new competitors, ETH consolidates its bullish structure waiting for the long-awaited Dencun update of the Ethereum blockchain, scheduled for March 13th.\n\nThis will introduce new functionalities within the network, such as the so-called proto-danksharding, which is a basic version of the scaling solution “sharding”, aimed at compressing the weight of a block by separating data storage, thus managing to lower validation fees.\n\nDencun is mainly focused on making Ethereum’s layer-2, which represent the most solid trend of the past year for the smart contract blockchain, significantly more scalable and cost-effective.\n\nThe ETH crypto at the time of writing the article has a price of $2483, well above the 50 EMA on a weekly time frame.\n\nThe currency quotes, after going through a terrible 2022 and a less encouraging first half of 2023 compared to bitcoin, start 2024 with a bang.\n\nEther aims for $3000 after being rejected at $2700 in conjunction with the approval of the Bitcoin spot ETF on US exchanges.\n\nThe bulls need to break the psychological barrier of $2500 as soon as possible, and subsequently the one of $2700 (with a weekly close above) to fuel the hopes of buyers, while the bears try to crack the chart by bringing prices below $2150.\n\nThe break of one of the two extremes will determine the price action of the coming weeks, which however tends to rise and register new annual highs.\n\nWeekly chart of Ethereum price (ETH/USDT)\n\nIt is also very important to consider the ETH-BTC chart, for a 360° view of what is happening in the crypto market.\n\nThe currency belonging to the Ethereum blockchain is in fact subordinate to Bitcoin, which always and in any case remains the king of this sector.\n\nThe moments in which ETH records its best price performances are in fact those in which it outperforms the trend of BTC.\n\nFor this reason, identifying possible levels on which the ETH-BTC chart can find new bullish strength is essential to predict an increase in value against the dollar.\n\nIn the coming weeks, we could finally see a recovery of ETH on the digital gold, with the threshold of 0.05 sat potentially acting as a shield against further bearish incursions.\n\nIf it were to maintain its level by forming a double bottom, ETH-BTC could easily reach 0.06 sat, reversing the short-term trend and pushing for an appreciation of the asset.\n\nIn an optimistic context like the one described, in addition to ETH and altcoins, even ERC-404 tokens could benefit from it, with the Ethereum blockchain shining among the many decentralized networks in the crypto landscape."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNOU93MjFvTUFjaFRRWGphQ292R2ZnWXpwV090bGZYOHZPQTZVX1Eyb3dMSVZRYVZzTHU4TzM4bS10aXZSRHI5RGg3aTJMcWVkai1YWXpPbGtGYWJjSElOekM1M2MyLWJpcTM0R3ZEOVBjUEJSM3kxanVTOXl0S1FIaFhZMktDNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in danger? The Geth monopoly is worrying! - Cointribune EN",
        "content": "Sun 11 Feb 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nGeth, short for Go Ethereum, is an open-source software client for the Ethereum network. It is a crucial tool for Ethereum developers, miners, validators, and users. Its popularity is due to the numerous crypto benefits it offers. However, over-reliance on this tool can be harmful, according to warnings from several analysts.\n\nA Challenge Involving Ethereum that Endangers Crypto Exchanges\n\nCoinbase, Kraken, and several other major players in the crypto sphere are facing a critical issue within the Ethereum network. It’s their over-reliance on a single software client named Geth.\n\nThis dependency poses significant risks. Experts warn against the potential catastrophic consequences if a bug were discovered in Geth. As a reminder, this client is used by nearly 80% of Ethereum validators!\n\nRecent incidents, such as a bug in the less frequently used software Nethermind, have already highlighted the vulnerability of the Ethereum ecosystem. With Geth dominating the crypto activities involving validators, any bug in this software could disrupt the processing of transactions.\n\nAnalysts are apprehensive of this prospect. According to them, such a scenario would have severe consequences for the crypto industry players. Moreover, such an incident could result in losses for investors and even lead to a fragmentation of the network.\n\nMany Ethereum validators use the same software, fueling worries about what happens if there's a bug https://t.co/Efrroa4iSs — Bloomberg Crypto (@crypto) February 8, 2024 Coinbase and Kraken are looking for alternatives to Geth to diversify and secure operations on Ethereum\n\nPalliative Initiatives Are Taking Shape\n\nIt must be said that some crypto industry players seem to grasp the magnitude of the situation. Criticisms about the lack of diversity among client software used by validators have spurred some crypto providers to explore alternative solutions.\n\nConsequently, Coinbase and Kraken are actively considering the integration of smaller software clients into their platforms to mitigate risks associated with Geth’s dominance. This already marks the beginning of a response to these growing concerns.\n\nBut the urgency to meet these diversification challenges in a sustainable way is evident. Especially when considering the significant financial stakes involved and the broader implications for the stability and growth of Ethereum.\n\nUltimately, the realization of these diversification efforts and increased vigilance are essential to ensure the stability and long-term success of crypto platforms. But also, more broadly, of the crypto ecosystem itself.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQMVZnMXBuaW9falpGdW5oQ0s5WnFRVWJRTXVhbjlpaWttV0N2X2tlb0xDS1NndTAwaTFEcHJkWkVHUTJUdVlZVTJGQ2pqYVpnb2ZvZUJiZjFvR0w4VkdLOGJhcWdPUXdrSDdQeGZfY1pGdzFXRTROWDE3YXA0RGhCT2NyUy1UeVRTdnhJVmg4UkNtN19ORDRlc0RfY0MxSnVVODAzVmZ4TTdIeWJWMDFMQmx4SjA2d9IBuwFBVV95cUxPQ2V1RVJyWFA0QzNBZ3U1c1hIdnBkczFuMnZILVpKVF90YzBkRzg2WnZKUDBYQmVHbTY1ZGIwaFE1c20ySkdMWTl0ckdWTGV0c0tGbV9FY09oa18xWktzUWQyME9HanY2REdzSFVLaGYxRGgza2s0M240N2M2QW1WUEtzZWdfQlprLTVaRTI5QVpqMk94Vm5jbTctWHJyd3ZUTzJRUWJTdXRxc0VZNTlMRnhWemRMT01pZ09z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Upcoming Dencun Upgrade Set to Make Layer-2 Blockchains More Secure: All You Need to Know - Gadgets 360",
        "content": "The Ethereum blockchain's total locked value stands at an estimated $40 billion (roughly Rs. 3,32,144 crore). Recognised as the most commercial blockchain in the world, the developers managing Ethereum keep on their toes to ensure that the usability and security of the blockchain is top notch and subsequently beneficial to the Web3 ecosystem. This year in March, Ethereum is getting ready to undergo a major update that will make Layer-2 blockchains that are built on it more cost efficient and secure.\n\nCalled the Dencun upgrade, this change will slash the requirement for data for maintaining Ethereum-based Layer-2s while also reducing the cost transactions that are processed via Layer-2 blockchains built atop the mainnet.\n\nThis enhancement of scalability and efficiency for Ethereum-based Layer-2 blockchains is technically being referred to as ‘proto-danksharding'. Another name for this update is also Cancun-Deneb.\n\nThe Ethereum blockchain is slated to undergo the update process at around 7:25pm IST (1:55pm UTC) on March 13. The update will be triggered when the Ethereum blockchain touches slot 8626176, as per a Coindesk report.\n\nAlong with improving Ethereum's scalability feature, the Dencun upgrade will also finetune the blockchain's existing security measures. The developers and users of dApps built on Ethereum-based Layer-2s will benefit from the reduction in gas prices linked to this update – thus increasing activities on the blockchain and expanding use cases.\n\nThe crypto community is talking about this upcoming Ethereum update on social media, flooding platforms like X with posts related to #DencunUpdate.\n\n:up: 13th March 2024#Ethereum #Dencun will go live on mainnet.\n\nTransaction fees are expected to be significantly reduced. This will increase the possibilities of using this blockchain. The more people use Ethereum, the more the price of ETH should increase.https://t.co/Op7hirZQmb — Kryptonit:dizzy: (@TrueCryptoPower) February 8, 2024\n\n$ETH low fees soon:fire::nerd_face:\n\n\n\nThe upcoming #Dencun hardfork is important news for the whole community:point_up:\n\n\n\nI'm constantly increasing my #ETH position during corrections:white_check_mark:\n\n\n\nPay attention to MACD crossover:rotating_light:\n\n\n\nHowever, a fair price is in the range of ~ $1200:face_with_monocle:\n\n\n\nNFA:x:@ethereum #ETH pic.twitter.com/ryzettfQaZ — Mr_Dzhi (@fear&greed) (@Mr_Dzhi) February 5, 2024\n\n#Ethereum's #Cancun-Deneb (#Dencun) Upgrade is a game-changer, enhancing scalability, security, and user experience.\n\n\n\n:star2: Dive into the latest, razor-sharp insights on this epic upgrade brought to you by SoSo Value.\n\n\n\n1/ Latest Updates\n\n\n\nScheduled for February 7, the #Dencun… pic.twitter.com/rkusvB0beQ — SoSo Value (@SoSoValueCrypto) February 6, 2024\n\nIn the backdrop of this upcoming upgrade, Ether prices are expected to witness a surge in the coming weeks. At present, ETH is trading at $2,498 (roughly Rs. 2.07 lakh).\n\nPrior to Dencun, Ethereum underwent two other major upgrades – The Merge and Shanghai in the years 2022 and 2023, respectively.\n\nWhile the Merge upgrade converted Ethereum's energy-consuming Proof-of-Work (PoW) mining model to a more efficient Proof-of-Stake (PoS) model, the Shanghai upgrade gave miners the ability to withdraw their staked Ether, bringing more liquidity to the network.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nIs the Samsung Galaxy Z Flip 5 the best foldable phone you can buy in India right now? We discuss the company's new clamshell-style foldable handset on the latest episode of Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNZkJXcUZqbTZ3cGFQYmJadDZTTGZKcnhnODdTRmpLa0dCMGE1UlBtSlNmamZ0QUQ2c3hzYjJHZWItQzVjTnlTUlRfNElGYU9YeHlPbF9oV1RRQjVpbjFDZzVoMjZwbGZDMkNUMl9DYlU1NzFjdUJEYklSNi1hUG5uSnhmb0pZY0xCV29hWWJkSmZmdHJGcUtYZTFUaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Buzzy ERC404 tokens in Pandora and DeFrogs are down bad, but not out - DLNews",
        "content": "Major ERC404 tokens, including Pandora and DeFrogs, fell more than double-digits on Monday afternoon.\n\nThe submarket has recovered some but is still down 5% on the day despite a recent recovery.\n\nERC404 is an experimental token standard that combines standard cryptocurrencies and NFTs.\n\nERC404, crypto’s latest buzzy class of tokens, has lost some of its sheen in the last three days.\n\nStill, the niche’s recent bearish drop may have just been a flash in the pan.\n\nThe wider ERC404 market is down 5%, with many tokens posting massive price drops on the day, CoinGecko data shows.\n\nThough bearish, the performance is a marked improvement from earlier today when the market was down a whopping 30%.\n\nPandora, the largest of the lot by total circulating value, is down 36% from its peak price of $32,495 achieved on February 9. Today, it’s down 7%, but not after experiencing a fierce 15% drawdown this morning before recovering some.\n\nDeFrogs, number two by the same metric, plummeted 22% earlier today before rallying back with a 10% jump in the last hour. It is still down 6% on the day at time of writing.\n\nERC404 is an experimental token standard — a set of rules that controls how a token behaves. It is a hybrid of the fungible ERC20 standard that gave rise to tokens like Shiba Inu and the non-fungible ERC721 standard that enables the creation of NFTs like Bored Apes.\n\nAs a hybrid, ERC404 developers hope to create a token that has qualities from each. The aim is to improve liquidity for NFTs, which can be notoriously illiquid, by making them behave more like tradable crypto tokens.\n\nJoin the community to get our latest stories and updates\n\nERC404 tokens have already ushered in a new speculative frenzy, with Pandora accumulating $484 million in trading volume since its launch on February 2. More than half of that volume has come in the last three days.\n\nThe trading activity has been so frenzied that it has also caused transaction costs on Ethereum to spike during its peak activity period on February 9.\n\nNotably, this flies in the face of claims by the Pandora project founder that ERC404 should reduce gas costs on the blockchain.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9lRWdYVjROZ0E1a01RazdEbzFuSlU1UURNUHFIdm1HWDEwclRLUDZMYlFFZWtCTGJ1YVBTYlF6QWFVcjF1c3hBWEhLbWlEV1gza0pmcUt1U2xSdms2cmh3VXpCTXpBRmNKUTFNME9nN1lqTWp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Why move Uniswap to Kelexo's presale? - The Cryptonomist",
        "content": "SPONSORED POST*\n\nKelexo’s (KLXO) presale has been gaining a lot of traction amongst crypto enthusiasts and it’s easy to see why. With analysts predicting 25x gains from its current low price of just $0.022, Kelexo (KLXO) presents crypto investors with the opportunity for incredible returns this year.\n\nHowever, it’s not just hype driving the interest in Kelexo (KLXO). Savvy crypto portfolio managers are shifting significant portions of their funds out of stagnant cryptocurrencies like Ethereum (ETH) and Uniswap (UNI) into this new protocol. We contacted one fund manager to find out why he believes Kelexo (KLXO) could “25x” investor funds in 2024.\n\nThe Case for Ditching Ethereum (ETH)\n\nEthereum (ETH) has long been a staple of crypto portfolios, but its glory days may be fading. The move to proof-of-stake drained enthusiasm and price momentum has been lackluster.\n\n“Ethereum (ETH) faces too much competition from faster and cheaper layer 1s today,” explains a crypto fund manager. With momentum declining and hype disappearing, he expects Ethereum (ETH) to continue underperforming in 2024 as investors move funds into more promising opportunities.\n\nUniswap (UNI) is in Trouble Too\n\nUniswap (UNI), the leading decentralized exchange built on Ethereum (ETH), faces similar problems according to the same crypto fund manager.\n\nThe Uniswap (UNI) governance token has plummeted from all-time highs of over $44 in may 2021 to just $6.29 today as investor appetite vanishes. With its fortunes tied to Ethereum’s (ETH) declining popularity, analysts think Uniswap (UNI) has little chance of rebounding strongly this year.\n\nThe Kelexo (KLXO) Opportunity\n\nIn contrast, analysts highlight Kelexo (KLXO) as an emerging project with massive upside potential in 2024.\n\n“I’ve shifted 25% of my fund’s Ethereum (ETH) and Uniswap (UNI) holdings into Kelexo (KLXO) because I think it could easily 25x from the current $0.022 presale price,” one analyst reveals.\n\nHe highlights Kelexo’s (KLXO) unique features including an advanced peer-to-peer lending platform, rewards programs and crypto debit card as key advantages over the flagging Ethereum (ETH) ecosystem.\n\nFurthermore, Kelexo (KLXO) provides an innovative lending platform where borrowers and lenders interact directly with no intermediaries. It’s faster, cheaper and more accessible than traditional finance. By eliminating clunky KYC checks, Kelexo (KLXO) offers users instant access to crypto loans and rates as low as 5%. All transactions are recorded transparently on the blockchain too.\n\nWith real utility backing Kelexo (KLXO), analysts predict explosive growth as the platform expands in 2024 and beyond.\n\nA chance at exponential returns\n\nSo for crypto investors looking for mammoth returns rather than marginal gains in 2024, Kelexo (KLXO) presents a compelling opportunity. The presale event makes entry possible at just $0.022⏤an incredible discount compared to its expected value later this year according to experts.\n\nTaking some funds out of tired cryptocurrencies Ethereum (ETH) and Uniswap (UNI) and putting them into this new and exciting disruptor makes perfect sense in 2024. Kelexo’s (KLXO) RISE to dominance lifts off this year according to analysts, making now the ideal moment to dive in.\n\nFind out more about the Kelexo (KLXO) presale by visiting the website here.\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQS0dkNzZlRFhqc25oT19tT0JlUWJobWlWN0lId3NadVlzUW9EeW5RSF9XVEJvSG9JY0QtUzJtOW9SamxualptSGd4U1lzTVFpVnplcHRVNHZ6QnUyZ05Ec0VqeDNqTEc5a0lrdVI3SjR1MGQxNmprcWNBdVRKUXh4RENoWk9vQdIBiwFBVV95cUxPMndRQzMtbUl6SzhHZzJueVdXc0JUVDdGQzJubW0ya2x3VlBpdzhqbzdmc1I1Z1lCY2RtZ0FiOXlER3YzT3Y0RWFscTZ5MWdyWXNlNGdTS0VKYzVCdnZpZklENzBRM0RPSUJwak01bDAyVDFaWE52TkVBTGhxMjJIS2NBaEd4Z1dibF9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Why Arbitrum seems to be the most desired chain for DeFi - AMBCrypto News",
        "content": "Arbitrum accounted for over 50% of ETH’s total transaction volume across top optimistic rollups.\n\nArbitrum had the highest TVL among all ETH scaling solutions.\n\nDespite the emergence of several Ethereum [ETH] scaling solutions in the past year, Arbitrum’s [ARB] dominance in the landscape has remained largely intact.\n\nArbitrum scales Ethereum and how!\n\nAccording to on-chain analytics firm IntoTheBlock, the layer-2 (L2) blockchain accounted for over 50% of ETH’s total transaction volume across top optimistic rollups, including Optimism [OP] and Base.\n\nHowever, it should be noted that in the broader L2 market, Arbitrum lost out its transaction dominance to zk rollup, zkSync Era.\n\nAccording to AMBCrypto’s examination of L2Beat data, Arbitrum clocked a little over 24 million cumulative transactions in the past month. This paled in comparison to zkSync Era’s 30-day tally of 41.3 million.\n\nThe significant disparity in transaction numbers was due to the difference between the fees on the two scaling solutions. AMBCrypto noticed through L2 Fees that a user had to pay $0.14 on Arbitrum to send ETH while the same task could be performed on zkSync Era at a 64% discount.\n\nHowever, Arbitrum proponents in particular, and those of L2 in general, have pinned their hopes on the upcoming Dencun upgrade. The watershed technical transformation was expected to bring about a 10x drop in L2 transaction fees.\n\nL2 transaction fees are expected to drop by 10x from a current average of $0.23 thanks to the upcoming Ethereum Dancun upgrade. pic.twitter.com/9GuLgxky08 — IntoTheBlock (@intotheblock) February 10, 2024\n\nArbitrum outshines competition in DeFi\n\nWhile Arbitrum trailed zkSync Era in network traffic, the former was still the decentralized finance (DeFi) leader in the L2 ecosystem.\n\nAccording to AMBCrypto’s analysis of Artemis data, Arbitrum had over $2.7 billion in total value locked as of this writing. This was head and shoulders above the competition.\n\nFathom this – the combined TVL of the next three scaling solutions in the list was still less than Arbitrum’s tally.\n\nAnother dominant aspect of Arbitrum’s DeFi game was the performance of its decentralized exchanges (DEXes). As seen from the graph above, Arbitrum has solidified its position as the top L2 in DEX volume.\n\nIn fact, Arbitrum DEXes facilitated trades worth over $1.7 billion over last week. In contrast, DEXs on Base and zkSync Era couldn’t even cross $300 million.\n\nRealistic or not, here’s ARB’s market cap in BTC terms\n\nARB lifts 8.5% over the week\n\nAs of this writing, the native token ARB was trading in the green, with weekly gains of 8.5%, according to CoinMarketCap.\n\nThe jump in ARB value could be just sentiment-driven. As is well-known, ARB doesn’t accrue any value from Arbitrum’s on-chain activity and functions just as a governance token."
    }
]