[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQUlhTckdrak5fdnNqMnJNTWhpSGRNaXdiN19NbWtucUJEWG1CSzRVLXdUUUk0bjNBMi00TUdJNk90WERsZmRrNkZfRTNrTjhidkN0WkgzZ05WTGR3NmlWZHJpa2tsNjhLcmlHSGh5VENLZzgxMjdpbVE4SmxBWWpxMGFZbWdXS0FOX2pCaEE1NHpYZ0JnaF9ndFJJdVk4NWd4Mlp5TGtUV0ZPNWswS0l4UmV3SjZnbHNFRFl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "SEC approves stake-free Ethereum ETF proposals - Euromoney magazine",
        "content": "Photo: Pixabay\n\nThe US Securities and Exchanges Commission (SEC) recently approved “on an accelerated basis” rule-change proposals from three exchanges looking to list spot Ethereum exchange-traded products. Most observers had expected the SEC to reject the applications on the basis that they were filed as commodity ETFs and the SEC deems Ether (or ETH, the native cryptocurrency of the Ethereum platform) to be a security.\n\n“The approval order leverages research from Bitwise and the SEC examining the correlation between spot Ether prices and the price of regulated Ethereum futures contracts,” says Matt Hougan, chief investment officer at crypto index fund manager Bitwise. “The fact that there is a large, robust and regulated futures market in Ethereum had a big impact on the decision.”\n\nBryan Amour, Morningstar\n\nAnother factor was removal of staking from the filings. Ethereum relies on staking to ensure the security of the network, rewarding users who participate in block production and validation through a portion of newly created ETH.\n\nHigher staked amounts help secure the network further by making it more immune to 51% attacks. A 51% attack is an attack on a cryptocurrency blockchain by an entity or group that controls more than 50% of the network and thus can prevent new transactions from gaining confirmations and to reverse non-confirmed transactions.\n\nEthereum"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQT0ZiRmk5MU5nN1VZNjdlUThhXzNyVlNqcGtGZW82LWlDdjQ2T25tX2U4VUxrVkRpYXotcDFlWGdaei1sOV9vcy1GQTN1dE1mTzFtV0tsdGc5QS1lVWFCZGRhMlA5Y1NvdVhjcXJJSUNNU2VZNlRZZWhCbVREMkpfWlNlSkRlSlFaQURrN2FGRWp6RVkzNXN5WjZZREdNUFYzSktNdU1ZY0dfeGtXY2pTNG1UMHk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Could Telegram-Associated TON Blockchain Be the 'Next Solana' and Challenge Ethereum? - Unchained",
        "content": "While lagging behind Solana, TON’s daily active addresses have exceeded Ethereum’s figures every day except for one thus far in June. Some believe TON could close the distance in market cap with Solana.\n\nThe price of TON has increased nearly 392% to around $7.40 in the past year, making its market cap stand at $18 billion.\n\nThe Open Network (TON) Blockchain is showing signs it may be the next Solana by virtue of challenging the historical smart contract leader, Ethereum.\n\nDriven by Telegram’s crypto wallet built into every app and the rampant play of mini-games, the TON blockchain has surpassed Ethereum in daily active addresses every day in June except one, a sign of growing popularity for the network connected to Telegram, the popular messaging application with more than 900 million monthly active users.\n\nAccording to blockchain analytics firm Artemis, TON has averaged 465,200 daily active addresses in June with a high of 568,300 on June 3, levels Ethereum has not crossed as the latter has yet to see more than 400,000 daily active addresses on its base layer in the month, excluding its various layer 2s.\n\n“For early ecosystems such as TON, we believe [daily active users] is a better metric to watch than [total value locked] or fees, as gathering users is a higher priority than making money,” wrote Kelly Ye, portfolio manager at liquid venture firm Decentral Park Capital, in her weekly newsletter published on May 20.\n\nDespite having higher levels of daily active addresses than Ethereum, TON’s growing figures still dwindle in comparison to Solana’s which has averaged roughly 1.64 million daily active addresses in June.\n\n“TON is good for the blockchain industry as data shows it’s adding net new activity,” wrote Andrew Van Aken, a data scientist at Artemis, in a Telegram message to Unchained. “Daily active addresses on both Solana and TON have increased over the course of the year, indicating TON is onboarding new addresses.”\n\nTON’s Opt-Out Wallet Launches With Massive User Base\n\nTelegram’s built-in community aided by its in-app crypto wallet has helped propel TON’s level of daily active addresses to where it is currently, argued Jehan Chu, an investor in the TON ecosystem and managing partner of blockchain venture capital firm Kenetic.\n\nThe native crypto wallet in Telegram is “an opt-out wallet, which means other than the 30 or 40 million US users who are geoblocked, the other 860 million Telegram users all have a crypto wallet natively [and] automatically,” Chu said in a conversation with Unchained. “Let that sink in… That is Thanos-level kind of change.”\n\nTelegram has been able to scale its technology as well as the onboarding of its large user base through the official rollout of Telegram’s crypto wallet, launched in Sept. 2023. “What’s interesting about this is it’s not really about wallets. It’s about the seamless integration of web3 technology into where users already are,” namely messaging, “one of the highest traffic destinations for users on a daily basis,” said Chu.\n\n“99.999% of blockchain projects are a tech idea trying to create a community – from nothing. According to CoinMarketCap there are more than 23,000 cryptocurrencies. That’s a hard road for most,” wrote Dan Morehead, CEO of crypto-focused venture firm Pantera, in the company’s May announcement about how TON was its largest investment ever. “Telegram is a community [of over 900 million users] integrating blockchain technology. That’s just got to be easier.”\n\nPantera, which has $4.7 billion in assets under management, cited other reasons in its rationale for investing in TON, including its values as a neutral platform independent of state influence and easy onboarding process.\n\nGames Drive Record Levels of Activity\n\nWhat has driven the recent surge in activity is another factor that led Pantera to its massive investment: an ecosystem of mini-applications which include chatbots and games. Referring to Telegram’s increased levels of daily active addresses, Chu said it arose from “a combination of things – obviously, games are a big driver.” A number of mini-games within Telegram have attracted substantial attention from its users, such as Notcoin, Hamster Kombat, and Catizen.\n\nNotcoin, a free game on Telegram where over 35 million users have tapped their screens to earn tokens, rolled out its cryptocurrency in May and has since garnered a market cap of $1.6 billion, data from CoinGecko shows. Similarly, Hamster Kombat has nearly 33.6 million subscribers in its Telegram channel, while Catizen has over 3.6 million users.\n\nBloomberg also reported on Tuesday that many in the crypto space believe this trend of mini-games in Telegram “could be the ‘killer app’ that will define the current bull market.”\n\nWhile they don’t interact with the TON blockchain, popular trading bots such as BONKbot native to Solana and Banana Gun, which is on Ethereum, depend on Telegram to generate fees from enabling crypto users to trade on their mobile devices. Telegram also has trading bots for the TON blockchain, such as sTONks and TOB Bot.\n\n“We believe that similar TON-native Telegram bots will become the preferred user experience for many traders,” according to Ryan Barney, a partner at Pantera.\n\nThe price of TON has increased nearly 392% to around $7.40 in the past year, bringing its market cap to $18 billion. Despite outpacing the two largest cryptocurrencies by market cap, BTC and ETH, TON’s price performance this last year is not as strong as Solana’s, whose native token soared 860% in the same period to a market cap of more than $68 billion.\n\nAccording to Decentral Park Capital’s Ye, TON has solid potential “to close the gap in market cap with Solana this cycle.”\n\nCorrection (June 13, 2024 11:14 A.M. EST): The previous title erroneously referred to TON Blockchain as belonging to Telegram. Following the SEC’s ruling, Telegram has no relationship with The Open Network (TON) Blockchain, which is now stewarded by the TON Foundation. Unchained regrets the mistake."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBnMnU2aDUxY2tvOXItd2NrdzBkQVBnZk5ZRG1Cd1JjMVdxRTNFeUdRaF9qNkpvQnA1US1SbUI2T0NKOGxVNkJtZjdsOGo4X2dSMnJXSDJnb3hYUTVTbi1VbmR1VG9taVBPdUVNLXpkTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Celestia's Blobstream goes live on Ethereum mainnet - Crypto Briefing",
        "content": "Currently available on testnet, Blobstream is expected to be deployed on L2s following audits and Celestia's upcoming launch.\n\nShare this article\n\nModular blockchain network Celestia has launched its data availability solution, Blobstream, on the Ethereum mainnet, according to the team’s announcement on Monday.\n\nBlobstream 🎇 is now live on Ethereum mainnet. Deploy a high-throughput L2 as *permissionlessly* as a smart contract. pic.twitter.com/74wyw5Xknq — Celestia (@CelestiaOrg) June 10, 2024\n\nDeveloped by Succinct Labs, Blobstream enables Celestia’s data roots to be streamed to an Ethereum light client on-chain. The solution offers high-throughput data availability (DA) for Ethereum layer 2 solutions (L2s), secured by cryptoeconomic guarantees.\n\n“This provides permissionless, high-throughput DA to Ethereum L2s, secured by cryptoeconomic guarantees rather than reputation or hidden trust assumptions,” stated Celestia.\n\nPreviously, Ethereum developers faced throughput limitations, prompting them to move to alternative layer 1 networks or rely on centralized services for DA.\n\nBlobstream allows developers to continue their work within the Ethereum ecosystem. Builders can create customizable, high-throughput blockspace without the need for permissions or committees while ensuring security through cryptographic economic guarantees.\n\nApart from the launch, the Celestia team announced that Blobstream on the Ethereum mainnet is now accessible on Celestia’s blockchain explorer Celenium.\n\nAccording to Celestia’s blog announcement, Succinct Labs has introduced Blobstream X, a zero-knowledge (ZK) implementation that streamlines the verification of Celestia validator signatures on-chain with a single ZK proof. This reduces validator overhead, simplifies the Celestia protocol, and accelerates the streaming of data root commitments for Ethereum L2s.\n\nAs noted, both Blobstream and its ZK implementation are currently available on testnet. Following code audits and Celestia’s upcoming launch, the community will be able to deploy Blobstream on Ethereum Mainnet and L2s to enhance streaming DA.\n\nPrior to this deployment, Celestia had already brought Blobstream to Arbitrum Orbit, Starknet, and Base, marking a continuous commitment to improving the Ethereum ecosystem’s infrastructure."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUTZCMTA3eGNCWGZCT0MxbldsLXZFVHFWeTlDcGNKcGxrRnhBajZNZTFfMXMyU05BZW83SUl6cTlFY0UybmRhbWt5Tl80TDdSX3VXZ1JHZ2l2RHBYaGpPS19YV2ZyUGVZLWNkN1ZSQUtqMmJfRngyX1lFaTlkVHIyQjB3NlNoVWhqbnZYMEIxdHZ3YTViYk1UaXF1MkpVYWw5bDh1Y2VMZ0hwMmZIWTFQQmc1bTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whales Activity Surges: Will ETH Break $4,000 or Drop Below $3,650? Analyst Insight - TronWeekly",
        "content": "Renowned crypto analyst Ali Martinez has brought attention to a notable trend in the Ethereum market. Over the past three weeks, the number of Ethereum addresses holding 10,000 or more ETH has surged by 3%. This increase indicates a significant spike in buying pressure among large-scale investors, often referred to as “whales.”\n\nThis uptick in large holders could signal a positive outlook for Ethereum, as increased accumulation by whales often precedes significant price movements. Investors and analysts alike are closely monitoring these developments, anticipating potential impacts on the broader crypto market.\n\nAs of the latest data, Ethereum’s price stands at $3,698.25, with a 24-hour trading volume of $12.20 billion and a market capitalization of $444.30 billion. Despite this bullish activity among major holders, the ETH price has slightly dropped 0.28% in the past 24 hours.\n\nWill Ethereum Break $4,000 or Drop Below $3,650?\n\nIn a recent analysis, prominent crypto analyst Crypto Patel outlined potential scenarios for Ethereum (ETH) price movements. Patel’s insights delve into both bullish and bearish outcomes, providing a detailed forecast based on current trading patterns.\n\nEthereum (ETH) is currently trading within a bull flag or parallel channel pattern against the USDT. This setup typically indicates a period of consolidation before a potential breakout. Traders and investors are keenly observing these patterns to determine their next moves.\n\nAccording to Patel, a bearish scenario could unfold if ETH breaks below the crucial support level of $3,650. Should this happen, Ethereum might experience a significant drop towards $3,152. This level is noteworthy as it represents the last Fair Value Gap (FVG), a region where prices previously moved quickly, leaving little traded volume behind.\n\nOn the other hand, if Ethereum manages to stay above the level of $3,152 support, then it turns into a bullish one. As Patel predicts, following this, ETH can rally up to $4,000 in the meantime. Go past that resistance, and a hugely bullish wave could knock Ether to $6,000-$7,000.\n\nCrypto Patel’s analysis reiterates the importance of vigilance on important support and resistance levels in this existing trading scenario. Traders must remain alert and change their strategies according to these potential breakout points.\n\nRelated Reading | DOGE Enters Key Wyckoff Phase: Major Spike Predicted Amid Market Volatility"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPNUtvTUhLazlfZ0V1UUtOczB3QXpyS3ZIVnZFRDFMWFJNbTMzQTROb2hYcHdkM1VMRFNveTJRaTU4T2ZmX241ekstbVY5YXd1MjJtV1hldk9tNWZIT2d2a1dZVmd2WXZpUjlOOG5pc1RSQWxlWFJfWmktX2ZOSFl0c0U5ZEstSDIxVHJ4QU1tcXE1RlZxSjdnZkxn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Balances Hit 4-Year Lows Pre-July 2020 - Crypto Times",
        "content": "Bitcoin and Ethereum exchange balances reached their lowest levels in four years, with BTC dipping under 2.3 million coins worth $160 billion and ETH below 16 million worth $59 billion.\n\nIn fact, Glassnode reports that this decline in exchange balances has been a trend since before July of 2020. The study by Glassnode shows that in the past half a decade, various different market situations such as the pandemic, the 2021 peak, the 2022 Terra-FTX crisis, and the spot BTC ETF approval, has shown users active in withdrawing their assets from the exchanges.\n\nExchange Balance Chart: Source – Glassnode\n\nCryptocurrency users’ long-term bullish sentiment, fueled by factors like BTC’s role as an inflation hedge, adoption as legal tender in countries like El Salvador, and institutional demand from firms like BlackRock and Fidelity, underscores their positive outlook on cryptocurrency values despite volatility.\n\nIn 2020, Ethereum launched the Beacon chain, enabling Ether staking, with over 27% of Ether staked currently, valued at over $119 billion, highlighting its role in the optimistic scenario as the second most popular cryptocurrency and a key player in decentralized finance (DeFi).\n\nThe expectation of future spot ETH ETF approvals, DeFi growth, and staking activities have all boosted the bullish sentiments and made users “hodl” their tokens for the longer term.\n\nThis trend is in line with the general belief in the ability of such digital currencies as Bitcoin and Ethereum to increase their value in the future irrespective of the daily fluctuations.\n\nThe crypto community continues to believe in these assets because of the ongoing technological development and integration across different industries."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOeWtSY1lqdU0wczcyZFk4NFdOQzk2bDhZQ3NsNUp0bFY5bi1PMGJzQXdqbEE2UjJ2OWl3T1pKa2NfU2hCc1M2LXBDS0xJMDdhNUhBLWd1ZWtVWGtkN2tCSU9DRGduRDc5N1hudUlGSzBrYUxRYmZucnpzdG1abzduaHRUQdIBiAFBVV95cUxQZEJ1MHZ1Qm9ZeGR4UHc1c1M2bXVjVy1qclRrMS1pTm1HZ0FtTnpSeGtZODdIOWhmM19yQ3dyM0h1enZPME50QXVnMjczNlBObl9IUno1d0F2VU03aVZqUUh6UzVGc3RMWjNPeU5UTjItU25PVlZlQTNaaklkTlJESjVzR052dU4y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Sees Over $1 Billion Ethereum Outflow - What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn a significant development on the crypto market, crypto exchange Coinbase has witnessed the largest Ethereum (ETH) outflow of the year, amounting to over $1 billion. This massive movement, reported by CryptoQuant, has sparked discussions and speculations about its potential implications for ETH and the broader market.\n\nCryptoQuant's data reveals that more than 336,000 ETH were withdrawn from the trading platform, totaling an approximate value of $1.17 billion on June 12, 2024. This event marks the fifth instance in 2024 where withdrawals from Coinbase have exceeded 150,000 ETH. The range of these transactions has varied from $400 million to $1.1 billion, indicating the involvement of substantial market participants.\n\nWho's behind withdrawals?\n\nThe scale and frequency of these withdrawals suggest that they are not driven by individual Ethereum traders . Instead, the transactions are likely the actions of whales or unknown institutional players. This assumption aligns with the observation that such large-scale movements are typically beyond the capacity of retail traders and are more characteristic of significant entities with major holdings and strategic market positions.\n\nThe exact reasons behind this enormous withdrawal remain speculative. However, historical patterns and market behaviors provide some insights. Similar large-scale withdrawals were observed on Coinbase for Bitcoin (BTC) before the launch of Bitcoin spot ETFs earlier this year. This has led to speculation that the current ETH outflow might be driven by anticipation of potential Ethereum spot ETFs in the near future.\n\nAdvertisement\n\nPositive indicators for long term\n\nIf these withdrawals are not merely internal movements by the exchange, they could signal a positive indicator for Ethereum's long-term prospects. Reducing the circulating supply of ETH, particularly in such large quantities, can create scarcity, leading to upward pressure on its price. This supply-demand dynamic is a fundamental principle on asset markets and is especially pertinent on a volatile and sentiment-driven crypto market."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQTTd2ZUNDRUhRV3dtLXFTVVRfbEFSbmVoY1JaUk1QeGd5QWNJZU1HdnpsV3dqQmZ1NGhBU0FsVlI0eVFNWlZYem1ybDBnMl9nNlZiNi1NSnAwcmpYY0pocDkwYmk1Z1BKb3R6N2ZwZ25qcTBkRDNIUDNXcjFlU05Pa1hoT1o4dzBjNmFNR0pCYTZ5ZWEtNmkwV0dsbXhsR1pUUlhGN0tSeFg2eU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "ProShares files S-1 for spot Ethereum ETF, expands on BNY Mellon and Coinbase roles - CryptoSlate",
        "content": "ProShares filed an S-1 registration statement for its spot Ethereum ETF on June 11, confirming and expanding on the roles of various fund participants.\n\nAccording to the filing, Coinbase Credit will serve as the company’s trade credit lender, allowing it to borrow Ethereum (ETH) and cash for certain transactions that exceed its trading balance.\n\nBank of New York Mellon will serve as transfer agent, processing purchase and redemption orders and maintaining fund ownership records.\n\nThe filing also details previously disclosed roles, including BNY Mellon’s role as administrator and cash custodian, Coinbase Custody’s role as Ethereum custodian, Coinbase Inc.’s role as prime execution agency, Delaware Trust Company’s role as trustee, and ProShare Capital Management’s role as sponsor.\n\nThe filing allows for changes to each role, including an initial two-year term for BNY Mellon’s administrator role with annual renewals.\n\nProShares can also add or terminate ETH custodians, cash custodians, and prime execution agents at any time. Additionally, Coinbase has the option to resign from its role as cash custodian.\n\nSome applications from other firms allow for comparable, but not identical, changes among participants.\n\nS-1 follows 19b-4 rule change\n\nThe SEC has acknowledged NYSE Arca’s proposed rule change on behalf of ProShares. If approved, the change will allow the exchange to list and trade shares of the fund.\n\nThe SEC has not yet approved the proposed rule change concerning ProShares’ fund. Based on market projections, the decision is expected to take weeks to months. However, as of press time, there is no clear timeline for the approvals and launch.\n\nBloomberg ETF analyst James Seyffart said the fund may not launch alongside competing spot ETH ETFs, which began to seek approval at an earlier date.\n\nThe SEC approved the eight competing spot Ethereum ETF applications’ rule changes on May 23. It has yet to approve each fund’s corresponding S-1 registrations, which will allow issuers to launch the funds.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcDQ0Z2dmbHlPU2c3OUtiTzZuUkdWcGVsNHdwc19UNXpOWUtDVTc1azNpMFd1T3BRdFNGYmY2UnBTcnNxTkpKeExBUmlkTkN6TVltcnBnQTUxYVFKdzAyTFFVckVTOUthQnlydGlrZXZtQnZoTkgxWkVRNjVMVHNkLTN6RVJBdzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Apple soars, bitcoin and ethereum fall: Tuesday's market trends - Yahoo Finance",
        "content": "Yahoo Finance's Jared Blikre joins Asking for a Trend to break down Tuesday's market trends.\n\nApple (AAPL) has reached a new all-time high, rising about 7% intraday. Blikre notes that the probability of this movement being a false breakout is an unlikely high-risk scenario.\n\nStock volume in the overall market has recently plummeted. Although volume is currently less than average, Blikre believes that it will normalize through the summer.\n\nFinally, bitcoin (BTC-USD) and ethereum (ETH-USD) are having their worst day in five weeks, which he also expects to normalize over the coming months.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Asking for a Trend.\n\nThis post was written by Melanie Riehl"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOdXBVMUFlVjRRSmdMRFJDdkxjQmRRcEIycmlteEJHcndma2x6c3lfUzJ4Y285OUR1cEJXbUl2cHd3WmQ1ODBWMXhvRVA1MGF2Q3ZUMGRtSkZkY2ExWGF2TkRiLTFJZUVrZDRkNXJ0cUEteFdNT3RyU2FheC1DbVlZQTFuWjVCM19MTEVDejZxRl9nY01qWk4xRS1XSWkwU0xiTjd2MnF3QS01dDZiczU0eEx4NEJIaknSAbwBQVVfeXFMT3FWLW9MdmJPR0F2VkU5bmlsbGNJRkt5dlpMUmhZWjhVdHpzNC1WSUZpbXJ5RjhtQl9aU2JtSUJFUG1BS3kwS08yQ19vWF8taDhtZmk2Vmo4RU9ZUGhwYXVxN3NOaGV1T01JQmlZSVJod2F5RWRKcWpURWtNM1lUOHJ1WGRFVG5SSlBHcDZnMEFnamVObnpJMEg0WXhLQTdMbjRGSDc0QkZUNDFJS3VtbFBJTUdFaWdKQWV6V0g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Biggest Bank in the World Says Ethereum Is ‘Digital Oil,’ Bitcoin ‘Digital Gold’: Report - The Daily Hodl",
        "content": "The world’s biggest bank, the Industrial and Commercial Bank of China (ICBC), is reportedly calling Bitcoin (BTC) “digital gold” and Ethereum (ETH) “digital oil.”\n\nIn a new report shared by Matthew Siegel, VanEck’s head of digital assets, the ICBC gives praise to the top two cryptocurrencies by market cap.\n\nThe report also says that market demand is strong for digital assets, pushing innovation in the sector.\n\n“Market demand drives the continuous iteration of digital currencies.”\n\nThe report draws comparisons between Bitcoin and gold while also saying the crypto king has added benefits.\n\n“Bitcoin retains the scarcity similar to gold through mathematical consensus, while solving its problem of being difficult to divide, difficult to identify authenticity and inconvenient to carry. Its monetary attributes are gradually weakening, while its asset attributes are constantly strengthening.”\n\nIn calling Ethereum “digital oil,” the report praises various characteristics of the top smart contract platform’s ecosystem. While ICBC highlights some of the network’s shortcomings, it also believes technological advances will resolve them over time.\n\n“Ethereum has been continuously upgrading its technology in terms of security, scalability, and sustainability, providing technical power for the digital future…\n\nEthereum introduces Turing completeness with its exclusive programming language (Solidity) and virtual machine (EVM), allowing developers to write and arrange for a variety of complex smart contracts and applications, providing a strong platform support for blockchain technology. Its flexibility has been widely recognized in the fields of decentralized finance (DeFi) and non-fungible tokens (NFT), and is gradually extending to the physical infrastructure network (DePin).\n\nIn essence, Ethereum’s Turing completeness enables it to execute any programming instructions under the premise of correct instructions and sufficient resources, but it also poses several practical problems…\n\nLooking ahead, Ethereum developers will continue to work on finding the Pareto optimum between sustainability, security and efficiency.”\n\nBitcoin is trading for $66,502 at time of writing, down 5% in the last 24 hours. Meanwhile, Ethereum is trading for $3,464 at time of writing, down more than 6% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQR2tqZmtmZGZjVlhCeUxQODRmbmRLbW9tNWFkSVhGOU8za1hiOWxhTjloanVqaTV3UmwwMk9YTTFKZHRabE9Vb3FjNTQxVEVYRXZmc1k2WDRGQlN4d3k2YVhVWTR3THhpMTBJbDFidUY0YkY5RFhDQWRFOXNxZy1RZUFFdkRfTVN1d0dCcTh3M1hxMzVadlJUX0pWNGx2VHpqRzI5eWlldHJ0YjRVczV4Wm15NnczeGtoVVJJSDVnTC1ydzFUbGRTRDZueFBBUVZTa0lBTW5B0gHbAUFVX3lxTE1pYjVjc3FoODFFOFNGeFlqbFNWYVh1VUQzUU15cEZsR2RqMDlDTlNPZExsbkZyWGNBTzBRYXY1VEtMeWtST1l2SW1RekhtLWJnY2lNRlhxeEdmRVpuSnMwV2tKN0hYNDhiX2hpOTNnbkFEVUQ2NHBKZVRnTm8yX3RsZHI0T3ZYLVQxbGgwWHlIUG5nLWpibDhSWVh1dWdOeHFTaTVhM3lpLVd5WE1CMkktT3RoNk5sWVJnVVJQR0daTnpuZVRNWnVXa1JZRm13ME16bjdNQ2s3NmVFdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support, receives ‘digital oil’ tag from world's largest bank - FXStreet",
        "content": "Ethereum is termed the \"digital oil\" of the digital future by the world's largest bank, ICBC.\n\nSEC is yet to provide feedback on ETH ETF S-1s despite expectations of the agency's comments earlier on Friday.\n\nEthereum's recent sell-off may be temporary, considering bullish events on the horizon.\n\nEthereum (ETH) is down over 6% on Tuesday as the general crypto market is trending downward. Despite the bearish sentiment, the Industrial & Commercial Bank of China has commended Ethereum's growth, describing it as \"digital oil.\"\n\nDaily digest market movers: SEC stays mute, ICBC commends ETH\n\nIn a recent report, the world's largest bank, the Industrial & Commercial Bank of China (ICBC), hailed the growth of Ethereum and Bitcoin. While comparing Bitcoin to Gold due to its scarcity, the bank also termed Ethereum \"digital oil,\" noting its role in \"providing a strong platform\" for supporting a host of Web3 innovations.\n\nAlso read: Ethereum ecosystem sees impressive Q1 earnings, issuers plan to market ETH as the ‘ultimate app store’\n\n\"Ethereum has been continuously upgrading its technology in terms of security, scalability and sustainability, providing technical power for the digital future,\" the report states.\n\nMeanwhile, the Securities & Exchange Commission (SEC) has yet to respond to prospective spot ETH ETF issuers on Tuesday, more than one week after they filed their S-1 registration statements on May 31. Issuers had expected the agency to comment on their filings on June 7. However, they have yet to get any feedback and now expect the SEC to provide comments this week, a source told The Block. According to Nate Geraci, issuers will file another round of amendments after they receive the SEC's comment.\n\nThe SEC approved spot ETH ETF 19b-4 filings of issuers on May 23. Before spot ETH ETFs can begin trading though, the agency must approve the issuers' S-1 registration statements. SEC Chair Gary Gensler told Reuters last week that the timing of the S-1 approval depends on how fast issuers respond to the agency's comments.\n\nRead more: Ethereum's price suffers slight decline amid Hong Kong's plan to allow staking in ETH ETFs\n\nWhile the wait continues, issuers have stated that they plan to market the ETFs as a “producing tech stock” or the “ultimate app store.”\n\nETH technical analysis: Ethereum's recent setback may be temporary\n\nEthereum is trading around $3,490, down over 6% on Tuesday. The market appears to be in risk-off mode ahead of the Consumer Price Index (CPI) report and Federal Open Market Committee decision on June 12, according to QCP Capital.\n\nThe market decline has accelerated ETH liquidations, with long liquidations accounting for $48.39 million of a total of $52.58 liquidations in the past 24 hours.\n\nAlso read: Is Ethereum price forming a local top?\n\nETH open interest (OI) has declined by about $680 million between Friday and Tuesday. Specifically, ETH options OI also reduced by $1.21 billion in the same time range. Coupled with declining options volume, this confirms the bearish sentiment in the market.\n\nETH/USDT 4-hour chart\n\nETH has breached the $3,618 support and is looking to extend the downward move below the $3,457 price level. With spot ETH ETFs on the horizon, the current sell-off may prove to be a temporary setback and a good accumulation zone. A further plunge below the $3,300 support will strengthen the bearish trend."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1VTEV2VTBKb0pWWWZvRkRrUktXZHE4SjhLb3dvOVZZM3BRYTl4U19EN1BNaW9DNVZWOXVJY1RCR1Y5a2lKejZaOEwzZ242emRUdWhQNnYyVXAwbVhHZGtHU2IxVXVPM1hrZ016cnVwWUVTOEdfcTRrQ3EwZXNoTmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval: SEC’s 2nd Massive Delay Disrupts Market - TronWeekly",
        "content": "Issuers of prospective spot Ethereum exchange-traded funds (ETFs) are still in limbo, waiting for the Securities and Exchange Commission (SEC) to provide feedback on their S-1 filings. According to two sources, these drafts were initially submitted on May 31, with the issuers anticipating comments from the SEC by June 7. Yet, at least two issuers have reported receiving no feedback as of now. One source mentioned that they now expect the SEC’s comments to arrive later this week.\n\nThis delay follows a statement by SEC Chair Gary Gensler on CNBC, where he indicated that the approval process for the S-1 forms would “take some time.” The uncertainty over the timeline remains, with one source previously suggesting that the S-1 forms might need at least two more rounds of draft filings before being ready for final approval.\n\nEthereum ETF Launching Process\n\nThe path to launching these spot Ethereum ETFs involves a two-step process. The initial step was the approval of the 19b-4 forms, which was completed on May 23. The current focus is on the S-1 filings, which, once approved, will pave the way for the ETFs to start trading.\n\nThe draft filings have revealed some intriguing details about the upcoming products. Notably, BlackRock is seeding its ETF with $10 million, indicating strong initial capital backing. Meanwhile, Franklin Templeton has outlined a competitive fee structure, planning to charge a 0.19% fee.\n\nAs the market eagerly awaits the launch of these spot Ethereum ETFs, a significant question lingers: Can they replicate the success of the spot Bitcoin ETFs? Bitfinex’s Head of Derivatives, Jag Kooner, offers a tempered outlook, estimating that the Ethereum ETFs will attract around 10-20% of the inflows that have been directed towards their Bitcoin counterparts.\n\nThe potential launch of these Ethereum ETFs marks a significant milestone for the cryptocurrency market, offering investors a new avenue to gain exposure to Ethereum. However, the timeline remains uncertain as issuers and investors alike wait for the SEC’s next move. The ongoing wait underscores the regulatory complexities involved in bringing innovative financial products to market, reflecting the cautious approach of the SEC in navigating the evolving landscape of digital assets."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNN3ZyZ1BkdmpkZVRFVjd0cTU1SGYxUVE3Z0lVVlFrYzRmb0o2VzAxNmpzMF9ZVEJuRGxHWm1Tc21feHIxcVZZWXQ0ZmZzalZZNkxIZUVMSTcyU2phTHBId25zSjBTSEJWMWxxOUp2OXlhU0NxaFFCSV9tekZjZG81MFM3TnNpSjlRREwzeVpB0gGTAUFVX3lxTE1DdXl6eFRRMzUxNV8wbmxGc2oxWnlhSU1vNEkwN3FFcTlXM04zc2xWcGxKZ21pa0ZNVnlKaFQ5Z0FyNnEzSUJjRDVXZWNzVmdVekt6ZjFBeVpKYzJ1VFpvcVdyci1hVXdmXzdSaVRzUmN6M1RwQUdzb09XZW1udF81UUNNRGtfeVl6amU5VjMwdGRZNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Charts Crypto Path Beyond Meme Coins - U.Today",
        "content": "In a heated online debate about the relevance of meme coins, Ethereum cofounder Vitalik Buterin outlined a compelling vision for the future of cryptocurrencies. The discussion began when a prominent crypto enthusiast expressed frustration with the meme coin hype and questioned its lasting value compared to recent major innovations in the space.\n\nAdvertisement\n\nSome of the important advances in the crypto space listed included decentralized and tamper-proof money, peer-to-peer cross-border payments, programmable money, permissionless financial services and digital asset ownership.\n\nMeanwhile, meme coins, while entertaining and a new way to monetize attention, lack the lasting and inspiring potential of previous crypto trends. This sentiment, concerned crypto enthusiasts claim, is draining the energy out of the crypto community.\n\nAdvertisement\n\nVitalik steps in\n\nIn response, the Ethereum founder outlined several areas where he sees crypto making a meaningful impact on everyday life and expanding its reach today. He mentioned the importance of zero-knowledge technology in improving reputation, identity and credentials, which could revolutionize digital interactions.\n\n* zk reputation/identity/credentials\n\n* p2p cross-border payments (much lower fees and quickly improving UX this cycle)\n\n* decentralized social\n\n* prediction markets (actually usable this cycle)\n\n* privacy\n\n* enterprise apps via zk validiums\n\n* zk + censorship resistant voting — vitalik.eth (@VitalikButerin) June 12, 2024\n\nButerin also pointed to significant improvements in peer-to-peer cross-border payments, noting that lower fees and better user experiences are making these services more viable in this cycle.\n\nIn addition, Buterin highlighted the potential of decentralized social networks, which promise greater user control and privacy, and prediction markets, which are becoming more practical and accessible. He also mentioned enterprise applications via zk validiums and zk-powered censorship-resistant voting, both of which could transform industries and governance."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNWlBsMlo2ODVta0pjUzNsZUpyOVk0RG9WSkZPWkxLMHRaMEZOVkFQRkhPRTlKSFVSOXlNb1FmSDg5TGJvMVVIdDI3cTJnOWxKZFBNZFpNMWJCcTJGMEFyUThwZnd6WkJWNmQ4bGtEUGNqSXZlTHBWQVpwQ2w5RHo1cE8tSzEybHp5WHY0aFEwWTZuNVdlR2VhNm85N01YWmY0RkJmeNIBqgFBVV95cUxOZ3dTblVJMkhDSmgwYXE2dkMtMmNQWVlaY1lMOVliVHJ3NXJYcDhfdXllSTN0MEFwUEl6V0x1TThwWmlVZVJLaU5Ydk5yY0pPVkJVRjVvSjNjY3FhWEt0aVladUFtUWZuRFlRa1hBZWlwcVFrQUVvOGxMQ0JUWXUxaUc5c2NzT2RES2laaW4zX0NQbzlkemhLd01zeU5uZ1NnZTlrdi1pTElIZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "MetaMask Adds 'Pooled Staking' for Cheaper Ethereum Validation - CoinDesk",
        "content": "Staking on Ethereum conventionally requires users to tie up 32 ETH with the network, which at current market prices totals some $112,000. \"Pooled\" services like Lido, Rocket Pool and now MetaMask give more users access to staking by bundling together assets from various people, making it possible for anyone to stake even if they don't have 32 ETH."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPWEFGNWV2UkJIczI3UU9LWS1aTEhna0U1V0Zib29TOHJSaldPamVNT0p0eHlxdThpZ2pSaC1VN1ByVTM0VFp2UFY3eUpUblBkbGJlR3F1X29tRTFGa2l4ZU9UQWNjbjBtY3FyUjdrcWxwOHFuUTB3OUw4STh5XzEySXI5YjB5MXZk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC)’s 200K Potential, Ethereum (ETH)’s Growth, and Furrever Token’s Rewarding Referrals - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 11, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is rife with opportunities and evolving narratives. As we navigate through 2024, Bitcoin, Ethereum, and Furrever Token stand out as significant players with distinct prospects and features.\n\nBitcoin’s 200K Potential\n\nBitcoin, the pioneer of cryptocurrencies, continues to dominate discussions with bold predictions. Analysts are eyeing the $200,000 mark, driven by potential catalysts like institutional adoption, macroeconomic shifts, and technological advancements. Despite recent fluctuations, Bitcoin’s long-term outlook remains optimistic. This price target is not just speculative hype; it reflects Bitcoin’s growing acceptance as a store of value and hedge against inflation. Investors are keenly watching regulatory developments and market trends that could propel Bitcoin to new heights.\n\nEthereum’s Growth\n\nEthereum, the second-largest cryptocurrency by market capitalization, is experiencing a bullish trend. Its robust ecosystem, fueled by smart contracts, decentralized finance (DeFi) applications, and non-fungible tokens (NFTs), positions Ethereum for significant growth. The anticipation surrounding SEC approval for an Ethereum ETF further boosts its prospects. If approved, this ETF could attract substantial institutional investment, driving Ethereum’s price upwards. With Ethereum 2.0’s ongoing upgrades aimed at improving scalability and efficiency, the platform’s potential continues to expand, making it a compelling investment option.\n\n\n\n\n\nFurrever Token’s Rewarding Referrals\n\nAmidst the major players like Bitcoin and Ethereum, Furrever Token introduces a refreshing and engaging twist to the crypto market. Designed with a charming cat-themed ecosystem, Furrever Token aims to provide a delightful user experience while offering substantial financial opportunities. One of its standout features is the new referral program, which allows users to earn 10% in $FURR Tokens for every deposit made through their personal referral link. This system not only incentivizes community growth but also creates a stream of passive income for users.\n\nThe ongoing presale of Furrever Token has already raised over $1.3 million, with the project currently in stage 9, aiming for a total of $1.9 million. The token, priced at $0.000732, offers the potential for up to 15X returns, making it an attractive investment. Furrever Token’s roadmap includes exciting future developments, such as exclusive cute cat content, ensuring continuous engagement and rewards for its community. The project’s commitment to security, validated by an audit from Securi Lab, further enhances its credibility.\n\nStory continues\n\nConclusion\n\nAs the cryptocurrency landscape evolves, Bitcoin, Ethereum, and Furrever Token each present unique opportunities for investors. Bitcoin’s ambitious $200K target, Ethereum’s growth fueled by its versatile ecosystem, and Furrever Token’s innovative referral program create a diverse array of investment options. By staying informed and strategically investing in these promising cryptocurrencies, investors can navigate the dynamic crypto market and capitalize on its potential.\n\nWhether you are captivated by Bitcoin’s bold predictions, Ethereum’s technological advancements, or Furrever Token’s charming and rewarding approach, 2024 promises to be an exciting year in the world of cryptocurrency. Explore these opportunities and make smart investment choices to maximize your returns.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5DTEtXY19CQWlnWmlrVU5mVDJranU0RmVydVozSGd4MXZ6azgydDN5bjY3N3RJR2pyNjNaRWwxdnB4MEZpZEh3UzNqWERXUnN3VDBTd3I5SkFYSnJJd1dYSWN5aFdUYndm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "TON’s Daily Users Beat Ethereum - TronWeekly",
        "content": "The Open Network a.k.a TON has recorded a surge in its daily active addresses count surpassing those of Ethereum, thanks to Telegram’s 900 million user base. Despite its fledgling ecosystem, TON’s steady growth looks promising, driven largely by the immense distribution power of Telegram. Despite these positive indicators, questions remain about whether its growth is sustainable and if it can emerge as a challenge to bigger rivals such as Ethereum in the long run.\n\nThe Flippening CT ignores TON’s quiet growth, fueled by Telegram’s 900M user base, which has driven its daily active addresses above Ethereum. At its core, the token is a bet on Telegram’s distribution. Though the ecosystem is nascent, its early growth is promising. But is it enough?\n\nTON’s Daily Users Beat Ethereum 3\n\nAs critics point to the ecosystem’s nascent stage, its initial adoption metrics are impressive. The token had a blistering rally this year, exceeding Bitcoin’s price by roughly 120%. Apart from this, TON led the altcoin pack with a remarkable surge of 110% growth in non-empty wallets over the past six months. Bitcoin may have the most non-empty wallets, but the altcoin’s growth is the fastest in this category. This surge in wallet activity positions TON as a standout performer in the cryptocurrency market, showcasing increasing interest and engagement from investors and users alike.\n\nWith a net change of 16.8K wallets, the token has seen exponential growth in its user base, indicating growing confidence in the project and its underlying technology. This surge comes amidst a broader trend of heightened interest in cryptocurrencies, fueled by increased institutional adoption, growing mainstream acceptance, and evolving regulatory frameworks.\n\nTON’s Silent Surge\n\nHowever, the latest surge can be due to several factors. Firstly, the integration with Telegram provides an enormous built-in user base, which facilitates easier adoption and use of TON’s services. Secondly, the simplicity and efficiency of TON’s blockchain, designed to handle high transaction volumes with low fees, appeal to users looking for an alternative to Ethereum’s often congested and expensive network.\n\nWith Telegram’s backing, the token has a unique advantage in terms of user reach and engagement. If the network can capitalize on this foundation and continue to grow its ecosystem, it could emerge as a formidable player in the crypto space. In conclusion, while TON’s quiet rise might have been overlooked by many, the underlying trends suggest a significant shift in the crypto landscape."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPYWJzNVdIdlE0U2szMmVqczZYSVdqWC1nbEJqUnpKeUVDeE1zWUd5d0ZNMWVrMVV4RW1IZFV3bzdSX25EMVFEYnJteVNsdEhqU0FQQmszVFNkNVB0MmpfWVliYjNKNVVzY2x3LUZueTdiQnZ6c05mdHJoSVlaS0FwSG9xNDctNXVwVklYeWJmbVNTcWNiaU1jdVFwWDZrd9IBowFBVV95cUxOTEozQzhFdWdlOEJVOVVfMmlHYXpPWF9YaGx3dFFqVVVHb05qRDVQX3plMnVZLW50bzk0RUxMMl9TSkxUQXhGVWdMQ0diOGs0RnhsQm1Ta25aUXFaRmhSRGs4UWFROGFNWUlWZGR1S1JybEVMdGQ1X2RpcE5EMTRHcl8ySC1wdU9PTS1QVVRuZURiWmFBUU10OWZZMlFrSm1SdFBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum price forming a local top? - FXStreet",
        "content": "Ethereum price struggles to surpass the $4,000 mark.\n\nOn-chain data suggests that the short-term whales are booking profits.\n\nETH development activity and active addresses slow down.\n\nEthereum (ETH) price faces struggles to surpass the $4,000 barrier. On-chain data reveals that investors appear to be capitalizing on gains, contributing to the emergence of a potential local peak. This situation can be seen in the decreasing ETH development activity and a corresponding slowdown in active wallet addresses, suggesting a pivotal moment in the trajectory of Ethereum's price journey.\n\nEthereum whale activity\n\nData from CryptoQuant's 7-day moving average of the Taker Buy Sell Ratio reveals the relative aggressiveness of buyers versus sellers. A value above one suggests buyer dominance, while a value below one indicates aggressive selling.\n\nThe chart below reveals that the Taker Buy Sell Ratio has remained below one and has been declining sharply in recent days. This indicates that most futures traders are aggressively selling Ethereum, either for speculative reasons or to take profits. This significant drop in the metric is a bearish signal, suggesting the current downward retracement in ETH could persist if this trend continues and a local top forms.\n\nETH Taker Buy Sell Ratio chart\n\nSantiment’s Network Realized Profit/Loss (NPL) indicator provides daily network-level Return On Investment (ROI) data based on a coin’s on-chain transaction volume, offering insights into market sentiment. Sharp spikes in a coin’s NPL suggest holders are selling at significant profits, while steep dips indicate holders are realizing losses, potentially signaling panic sell-offs and investor capitulation.\n\nFor ETH, the NPL indicator spiked from 36.69 million on June 10 to 1.06 billion on June 11. This positive trend suggests holders are selling at significant profits, hinting at the formation of local tops.\n\nETH Network Realized Profit/Loss chart\n\nSantiment’s data of Active Addresses indicates the number of unique addresses that participate in transactions on a blockchain or cryptocurrency network within a given day. This metric is used to gauge the level of network activity and user engagement. Higher Active Addresses typically suggest increased usage and interest in the cryptocurrency, whereas lower Active Addresses mean weakening demand and diminished confidence in the cryptocurrency.\n\nAs in ETH’s case, the number of Active Addresses is decreasing constantly, from 644,950 addresses on March 20 to 450,000 addresses on June 11. This 30% fall in Active Addresses indicates weakening demand and diminished confidence in ETH.\n\nETH Active Addresses chart\n\nSantiment’s Development Activity indicates project development activity over time based on a number of pure development-related events in the project's public GitHub repository.\n\nAn increase in metric typically signals ongoing efforts to maintain, innovate, and enhance the protocol, which investors and stakeholders view positively. Conversely, a decrease in the index may trigger concerns regarding the project's sustainability, innovation capacity, and community involvement over the long term.\n\nIn ETH’s case, a sharp fall in the index from 329 on May 19 to 270 on June 11 implies that Ethereum's developing activity is constantly decreasing, signals concerns regarding the project's sustainability, innovation capacity, and community involvement over the long term, which adds further credence to the bearish outlook.\n\n\n\nETH Development Activity chart\n\nAnalyzing the declining Taker Buy Sell Ratio, surging Network Realized Profit/Loss, dwindling Development Activity, and diminishing Active Addresses collectively implies a potential local top for Ethereum's price. Nonetheless, a shift in market sentiment fueled by positive US CPI news this Wednesday, coupled with significant institutional investment inflow into Ethereum spot ETFs, has the potential to negate the bearish outlook and propel ETH towards retesting its all-time high at $4,878."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5rU2RmU3gydXpYUlBzM2xueVJtN0pvN1d2QTd0dDRSNFdyS1ZPU0FtTy1MSjVJZkZRRmFVRGluSFBmQkxFb1l5d1ZycHpaWGNjQV8wakNfTHRicnY2aEUxZXczYmROSTZZNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ripple to launch RLUSD stablecoin on Ethereum and XRPL this year - Crypto Briefing",
        "content": "The upcoming product aims to enhance DeFi on XRPL with US dollar backing.\n\nShare this article\n\nRipple has recently shared additional details about the imminent launch of its new stablecoin. In a recent announcement, the company revealed that the stablecoin, named Ripple USD (RLUSD), is set to launch on the XRP Ledger and the Ethereum blockchain later this year.\n\nIntroducing Ripple USD (RLUSD): A 1:1 USD-backed stablecoin, offering transparency and stability on the XRP Ledger and Ethereum. Coming later this year. Sign up to receive the latest stablecoin news, content and availability: https://t.co/ifguG77bO6 — Ripple (@Ripple) June 12, 2024\n\nRipple CEO Brad Garlinghouse also described RLUSD as “Real USD.”\n\n“The name of the Ripple stablecoin [is] RLUSD; I like to call it Real USD or Ripple USD,” said Garlinghouse at the XRP Ledger Apex 2024 this week.\n\nPegged to the US dollar at a 1:1 ratio, RLUSD will be fully backed by a combination of USD, short-term US Government bonds, and cash equivalent assets, as previously reported by Crypto Briefing.\n\nWith the new product, Ripple aims to diversify its stablecoin offerings. In addition, the company expects to enhance support for DeFi applications, including AMM exchanges, by providing a reliable asset solution.\n\nThe announcement follows Ripple’s recent acquisition of Standard Custody and the appointment of its CEO, Jack McDonald, as Senior Vice President overseeing the stablecoin division yesterday.\n\nAdditionally, Ripple has chosen Axelar’s interoperability platform for its XRPL EVM sidechain, favoring its user-friendly approach over the previously considered XLS-38 bridge. The company said Axelar’s integration with prominent projects and its security features were key factors in this decision.\n\n3/ We're migrating to @axelarnetwork for its robust security and efficiency in cross-chain transactions. \"Axelar is a battle-tested, production-ready bridge to bring XRP as a native currency to the XRPL EVM Sidechain.” — @FerranPrat12, @Peersyst CEO. — RippleX (@RippleXDev) June 12, 2024\n\nDespite recent progress, RLUSD has faced regulatory roadblocks. In a legal document filed in May, the US Securities and Exchange Commission (SEC) claims that Ripple’s proposed stablecoin is an unregistered crypto asset. According to the SEC, the stablecoin is evidence that Ripple might keep doing things that violate securities laws."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOaGlyVVo3U2thNE50T09ocUM5MW9wTldKdFNuSmp0SlZJWTJubW5pMzNzVk1lOFpKMHpyblJzSVJEcF9NYmNnX2J4NU1YNXhKcnRYaGMySXlBanluUzU1TkQ5elNXWmotSzJXVkJGMmZpQXNkcWEwdmc3VFB2bjF2dGw0VU5HVWtRUUtyM1ZOTDF4cV9tZVZlS0FMM1N6dzNKcFlvTDdYV09uMWI1Sm1DQ2czUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "How MetaMask says it can beat cheaper rivals as it widens Ethereum offering - DLNews",
        "content": "MetaMask users can now stake small amounts of Ether through the wallet.\n\nThe new offering charges higher fees than market leader Lido.\n\nMetaMask is going all in on the $116 billion market in Ethereum staking.\n\nConsensys, the firm behind the top crypto wallet, announced Wednesday the launch of Pooled Staking, a new offering that will let those with small amounts of Ether pool their tokens and earn staking rewards.\n\n“It’s a simple way to be rewarded for contributing to the security of Ethereum,” Matthieu Saint Olive, a senior product manager at Consensys, told DL News. “This solution will be competitive.”\n\nPreviously, only users with 32 Ether could stake through MetaMask.\n\nThe Pooled Staking launch puts MetaMask on an equal footing with other staking providers that accept small amounts of Ether for staking.\n\nBut it could be an uphill battle for MetaMask to break into this highly-competitive market.\n\nSaint Olive said MetaMask will charge Pooled Staking users 15% of their staking rewards for its service — much higher than leading Ethereum staking provider Lido’s 10%.\n\nThe market for Ethereum staking is huge. Almost 33 million Ether tokens worth $116 billion are staked on the blockchain, earning at least 3.1% per year, paid in Ether.\n\nJoin the community to get our latest stories and updates\n\nLido dominates the market, accounting for almost 29% of all Ether staked.\n\nLido dominates the Ethereum staking market. (Dune Analytics/@hildobby)\n\nBy providing a more accessible option to MetaMask users, Consensys is hoping its Pooled Staking feature can compete against dozens of other options, many of which, like Lido, offer lower fees.\n\nStaking fees\n\nStaking on Ethereum is complex.\n\nIt requires in-depth technical knowledge, a stable internet connection, and a minimum of 32 Ether — worth $113,000. Mistakes can cause significant financial losses.\n\nBecause of this, many Ethereum users choose to stake through a third party provider.\n\nStaking providers usually take a percentage of rewards — between 10% and 25% — in exchange for helping their users stake.\n\nAt the low end, Lido, Binance Staked ETH, and Mantle Staked ETH charge a 10% fee on staking rewards.\n\nCoinbase’s Wrapped Staked ETH sits on the high end, charging 25%.\n\nMetaMask’s 15% Pooled Staking fee, Saint Olive says, falls somewhere in the middle.\n\n“Users care more about the rewards they actually receive, and how secure the solution is, rather than the provider fee itself,” Saint Olive said.\n\nSecurity and convenience\n\nThe new offering may appeal to more casual crypto users because of its convenience.\n\nMetaMask users can start staking their Ether via the wallet’s interface.\n\nHowever, MetaMask also gives users the option to stake through rival staking providers Lido and Rocket Pool — both of which offer lower staking fees — through the same interface.\n\nAs for security, Pooled Staking will use the same staking system used by Consensys Staking, the firm’s enterprise-grade staking product.\n\nConsensys says it has received third-party security certifications for both Consensys Staking and MetaMask.\n\nConsensys Staking has 33,000 Ethereum validators with more than 1 million Ether staked, equivalent to 3.3% of all staked Ether, according to the Pooled Staking announcement.\n\nEven so, it says it has never had one of its validators get slashed.\n\nSlashing is when the Ethereum network takes Ether from validators who don’t publish data when they are supposed to, or don’t publish the correct data.\n\nIn November, Bitcoin Suisse, a company that provides staking services for institutional clients, suffered a $200,000 loss after nearly 100 of its validators were slashed for trying to publish incorrect data.\n\nIn October, 20 of Lido’s validators were also slashed, costing the protocol $45,000.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5kZEVZaG9UTVNJNThSNEtMUEZXT29zSkc4bkdfUERBQ25wOGtaZHF0VTlOZmpBcVVvU3haSmdhajd5SlZtRmJpdmtNc1BFUFpWVFlyMnVEaFA3X1ZTaEFWanpBeS1IMEsxVUczTG5URTluRkN6LVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Name Service Tops NFT Market, Hits $4.27M in Sales - NFTevening.com",
        "content": "In the NFT market, the Ethereum Name Service (ENS) took center stage with revenues exceeding $4.27 million. The Ethereum Name Service uses NFT technology in its decentralized URL method on the Ethereum blockchain, even though it isn’t an NFT collection per se. Users may convert addresses on Ethereum into formats that are simple to read with this method. In essence, an ENS domain registration grants you a distinct NFT that is linked to the domain name of your choice, which you can then transfer or sell as with any other NFT.\n\nDiverse Range of Top Sellers\n\nFollowing closely behind ENS, the $PIZZA BRC-20 NFTs, hosted on the Bitcoin blockchain, secured the second position with $2.18 million in sales. Even though it topped the charts on Sunday with $7.12 million, sales of this collection fell. With $1.24 million in sales, Guild of Guardians Avatars on the Immutable network took third place.\n\nWith sales of $987,910, the Blast’s Fantasy Top collection came in fourth place, and with $635,539 in sales, the Genesis Fanta Field collection on Solana made its debut in the top 10. With $583,411 in sales, the DMarket collection, a component of the Mythos network also left its impact, coming in sixth.\n\nWith $470,907 in sales, the Bored Ape Yacht Club, a flagship NFT from Yuga Labs and the second-highest seller ever, finished the day in eighth place. The OKX NFT Creation series, based in Polygon, came in just behind, taking eighth place with $414,817 in sales. With sales of about $350,000 apiece, two more Polygon collections Matr1x Fire Weapon and TTAvatars rounded out the top 10.\n\nBlockchain Breakdown\n\nRegarding the blockchain, Ethereum, under the leadership of ENS, commanded the most daily sales amounting to $8.45 million, a notable rise over $4.51 million the day before. The daily sales volume on the Bitcoin blockchain was $4.11 million, a decrease from the $11.03 million that was reported on June 9. Sales on the Solana blockchain were $2.68 million, however transactions on the Polygon blockchain totaled $2.44 million, which was a greater volume. Immutable recorded $1.56 million in sales, while the Blast blockchain recorded $988,646 in sales.\n\nIn summary, ENS’s surge in NFT sales, alongside a diverse range of collections and blockchain activity, underscores the growing prominence and dynamism of the NFT market."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPeXNGYWs3N2V6M1BEZ2UzNHhqMkllYWloS2VaaWVpQ21XckF0a2pNX0dBNHpUQlhCT1l0YWlMWE01ZklhU0pkWkp5MUxGQjFEZXNUdjdqd2pJZmRvRFZndXZwd1FzZDF5eWRVVzZrelFxei1WNkdnajJSUnJyeEFBaWxmX2FkR2hRWmFPX1pB0gGTAUFVX3lxTE90bHJIVnIzM1NvTTc3SmZ4TkhxLTR5VTluS1FUckZGSldYUENtbzdER0s4WWJ5QmhkeFRTUTRYREpvT0R5X0N1ejg5Wjl3WDRqWlVyaVRXTzhvZWhvTVpkU2Q4MjhzdGRqdEdkMVV3eEtHWl9hYjliMWIxNXFYTmlDM19GRmJDM01YbWxYaW4yQ2FGdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Faces Bearish Phase as Futures Traders Aggressively Sell - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRecent data from CryptoQuant indicates a bearish outlook for Ethereum (ETH), suggesting that the current downward trend might continue if prevailing conditions persist. Ethereum, struggling to maintain momentum above the $4,000 mark, is facing significant pressure from futures market participants.\n\nAdvertisement\n\n$ETH's plummet might persist in the short term\n\n\n\n“This trend suggests that the majority of futures traders have been selling #Ethereum aggressively, either for speculative purposes or to realize profits.” – By @Greatest_Trader\n\n\n\nLink 👇https://t.co/yz9DVphQ8l — CryptoQuant.com (@cryptoquant_com) June 11, 2024\n\nThe provided chart illustrates the seven-day moving average of the Taker Buy Sell Ratio, an indicator used to gauge the aggressiveness of buyers versus sellers on the futures market. This metric is crucial for understanding market sentiment and potential future price movements. A value above one indicates buyer dominance, suggesting more aggressive buying activity. Meanwhile, a value below one signals seller dominance, pointing to more aggressive selling activity.\n\nIn the context of Ethereum, the chart reveals a troubling trend. The ratio has consistently failed to climb above one and has been on a sharp decline recently. This decline indicates that the majority of futures traders are selling ETH aggressively. This selling could be driven by speculative strategies or the need to realize profits amid market volatility.\n\nAdvertisement\n\nImplications of current trend\n\nThe significant drop in the Taker Buy Sell Ratio is a bearish signal. It suggests that sellers are outweighing buyers, leading to increased downward pressure on Ethereum's price. If this trend continues, ETH might struggle to break through resistance levels, potentially leading to further price declines.\n\nSeveral factors could be contributing to this aggressive selling behavior. For instance, the overall bearish sentiment on the crypto market could be influencing ETH traders to sell off their positions in anticipation of further declines. Moreover, traders might be realizing profits from previous gains, contributing to increased selling pressure."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE92S3RBbXp5VDVQWkZKanRmek5IcUJjNGpkWmxyUzU2THRvc3FURzAwQUxsbUM1UlVxWUZ6XzJTOGNIaEpHZ0RjOTVmbGdvZ2tBUTdJbFBNYjJBVkwzOW9XSUl1NzFVZXBiSDF3ejlwMjJFQWswZ1RsU3MzZTbSAYIBQVVfeXFMUGROa1NHVG8tU3VCMmRtZjJkck5WOUhVOVRTWERITWg0RXFkbFlxQTFLQU03UWJoWk5JUHk0cXdfaFJLYVE2a3R5S0k4OHEteGJSamZBZDdkY2Z1SjktWjJUdU52SUtFQnJCX3h2cTRZbUNaZGxmTTBBRE5WSUZjZkNFUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Major Spot Ethereum ETF Update to Come This Week: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDespite the United States Securities and Exchange Commission (SEC) granting approval for a spot Ethereum ETF, the cryptocurrency world is still awaiting S-1 approval to usher in trading of the asset. Per a source in communication with the SEC, some comments are now anticipated this week. Nate Geraci, an analyst, in a post on X said that at least one of the several prospective issuers that filed an application will receive comments from the regulatory authority this week.\n\nAdvertisement\n\nFwiw, at least one prospective spot eth ETF issuer anticipating SEC comments back on S-1 this week...\n\n\n\nIssuers would then file another round of amendments based on those comments.\n\n\n\nvia @Timccopeland pic.twitter.com/WB1VQcmbh0 — Nate Geraci (@NateGeraci) June 11, 2024\n\nSpot ETH ETF regulatory delays and issuer expectations\n\nNotably, since the May 31 deadline passed to submit the first draft of S-1 registrations, spot Ethereum ETF issuers have anticipated that the regulatory body would provide an update on the status of their application. To date, nothing definite has come from the Gary Gensler-led commission.\n\nInterestingly, issuers were optimistic that the SEC would provide comments on the drafts as of June 7. However, two of the issuers categorically stated that nothing was communicated from the SEC to them. The only communication from SEC Chairman Gary Gensler at a recent appearance on CNBC was ambiguous.\n\nThe back and forth of the SEC prior to granting the 19b-4 approval led some issuers to drop out of the race. Notable among those that pulled out was Cathie Wood’s Ark Invest. The asset management firm, despite filing documents with the SEC in partnership with 21Shares to become an Ethereum ETF issuer, later withdrew.\n\nArk Invest, in an official statement, noted that it continues to believe in Ethereum’s “transformative potential and long-term value.” However, Ark will no longer pursue an Ether ETF product.\n\nStakeholders' concerns about spot Ethereum ETF\n\nAs issuers anticipate clear communication from the regulatory body, some stakeholders are entertaining doubt as to the potential of the spot Ethereum ETF product. Global banking firm JPMorgan believes that these products could attract a much lower share of inflows than expected.\n\nAnalysts are, however, optimistic that if the SEC gives the green light, the product is likely to perform well in the crypto space."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxONWpZRTZsZEthNGZEaGVZZFNzeXRLQzhIRUF6OVNhTGNlZlB5dnIySDBWRXpibWFIakkxSndobU9MQzdzUUN3TGJCQVpRQWJFOG5NRGlGck1WNV9wbVcweXpubk9DcXdiazBTazAwOWRjMGZWbEJUclRydEdYN1ljaFJwVnlMd3JZSzluQkZmOVExdjI3blE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Why will Ethereum drop toward 2500 level for BITSTAMP:ETHUSD by ShinForex1 - TradingView",
        "content": "The information and publications are not meant to be, and do not constitute, financial, investment, trading, or other types of advice or recommendations supplied or endorsed by TradingView. Read more in the Terms of Use"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNdUZaRGdZOWJtVllnWFdOOHZzeWJXb0JzbkJwdlVjUldUeHcxVFRBV2RPSUpuUmhDMUZMS2hpanhMNVJxTE9zcXYtQ1RhRE1rUUUwYXJhSTdXWjdXYjM5WE1fVERXZEowMUNwSE5FdVBMbWdVclNTTnJqS19RWFAxLXFWaDBVUENRYTM2Qjdn0gGWAUFVX3lxTFBRd1BrZ0ZaRDlWYkJXWEJJMVRJQ1RSS0pSNU0tUHd2RkUxbHhlWGRiWWprV0t4UmhGOW0xM3RvNjZQMWdkeHdFdDVQdzdKaDNtZnZDenBTS3E4RDQ1bzhyMFBfUTItaDJRT2d4VW1lM1JEdHpHSG9YQ3V5WU9TSEpvcDJfNkJqMW5HNVRDbUViMm50R0l1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Dip as Fed Signals One Rate Cut Ahead in 2024 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency prices wavered Wednesday as investors parsed commentary from the Federal Reserve that provided new insight into the U.S. central bank’s fight against inflation.\n\nPolicymakers’ move to leave interest rates unchanged for an 11th consecutive month was a foregone conclusion, based on movements in Fed futures markets. At its most restrictive position in over 20 years, the Fed kept its benchmark borrowing rate at a range between 5.25% and 5.50%.\n\nThis month’s release of a so-called “dot plot,” however, suggested shot callers at the U.S. central bank have seen a notable shift in financial conditions since March. The Fed in its most recent Summary of Economic Projections had penciled in three rate cuts through years-end.\n\nThe dot plot released Wednesday suggested Fed policymakers now think one rate cut could be more appropriate—interpreted by the market as a hawkish sign. The projection went beyond the two rate cuts that economists had expected the Fed could telegraph, as it looks to keep rates higher for longer in the face of a strong economy and U.S. labor market.\n\nAD\n\nAD\n\nCryptocurrency prices had risen earlier in the day on news that inflation had slowed to 3.3% in the 12 months through May. The report indicated that consumer prices for American goods and services rose slightly less last month than economists had expected.\n\nFollowing the Fed’s announcement, Bitcoin and other cryptocurrencies fell. Just 15 minutes after the Fed’s move, for example, Bitcoin’s price swiftly fell 1.2% to around $69,000 from $69,900. Meanwhile, the prices of Ethereum and Solana also ticked down at similar rates.\n\nThe Fed has maintained in recent months that it will not cut rates until it has “gained greater confidence that inflation is moving sustainably toward 2%.” Federal Reserve Chairman Jerome Powell affirmed that stance on Wednesday and said, “So far this year, the data have not given us that greater confidence.”\n\n“Recent indicators suggest that economic activity has continued to expand at a solid pace,” Powell added in a statement. “In recent months, there has been modest further progress toward the Committee’s 2% inflation objective.”\n\nAD\n\nAD\n\nBefore the conclusion of the Fed’s policy meeting, futures traders penciled in a 61% chance that the Fed cuts rates in September, likely delivering a boost to the U.S. economy through lower borrowing rates. That figure fell to 59% following the release of Powell’s written remarks.\n\nNot long before U.S. inflation peaked at 9.1% in June 2022, the Fed began lifting interest rates from near-zero to cool a red-hot economy. While inflation has come down significantly since then, Powell affirmed Wednesday that the U.S. central bank’s quest to 2% isn’t over yet.\n\nPowell pointed to Wednesday’s Consumer Price Index report, where inflation was flat on a month-to-month basis in May, as a sign of potential progress. “Let me say that we welcome today's reading and hope for more like that,” he said.\n\n“The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee’s goals,” Powell added, of which one is “maximum employment” among U.S. workers.\n\nThe price of so-called risk assets, including stocks and crypto, typically face pressure as interest rates rise and the payouts on holding cash and U.S. Treasuries become more attractive. Investors anticipate the opposite would happen as the Fed loosens U.S. monetary conditions.\n\n“We can't know what the future holds, but in the meantime, we've made pretty good progress on inflation with our current stance,” Powell said, adding that the Fed is looking for a gradual decline in inflation and greater balance in the labor market. “We’re making good progress here.”\n\nEdited by Andrew Hayward\n\nEditor's note: This story was updated after publication to add a further quote from Powell.\n\nAD\n\nAD"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNSk9xaGZzWEdKQnpyNXQySlFobmpULTNjNmg0aE1rUUZDR0ZsaDlVTFhRT1NaeDBvVWhaclRybFRsVGpnMFpBN1VSSTVSZTNWYUthSS1DM3BycE9lTzBxM2xjb05BTUtrZERodTNNSkdDbU53bDRPNnJqNlhQZGhFQ1BUMDBRQdIBjgFBVV95cUxPOFZjX193Ri1FWndDUnhPeEt2OXF4d3AyRW1aaHAybzZ3cE1PSjExVHdyVEw5Rm5NV3BCRmdUOHJEUkxpbG5iZGZiTWxSbGw2OUJ1RTI5LU90dWhKSFNIcUVVai1rVnpGSG96ZWludUp5bTBmR0V5OTNKdFdqUy16czhxTjI3TmVKQ1hyaVN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Pop as US Inflation Growth Slows - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe prices of Bitcoin and other leading cryptocurrencies popped Wednesday after a widely watched inflation gauge showed that U.S. consumer prices increased last month by less than economists had expected.\n\nThe Consumer Price Index (CPI) rose 3.3% in the 12 months through May, the U.S. Bureau of Labor Statistics said Wednesday, coming in slightly below economists’ forecast of 3.4%. Previously, the index tracking American goods and services showed that consumer prices rose 3.4% annually.\n\nImmediately following the report’s release, Bitcoin jumped 2.8% to around $69,500 from $67,900. Other cryptocurrencies, including Ethereum and Solana, showed gains of over 3% over the past day, but their prices had still fallen over the past week after Friday’s flash crash.\n\nMeanwhile, the S&P 500 and tech-heavy Nasdaq Composite opened in the green. The move came just hours before the Federal Reserve’s June policy meeting, where the U.S. central bank is expected to hold its benchmark interest rate steady for an 11th straight month.\n\nAD\n\nAD\n\nAs the Fed’s decision loomed, Bitcoin is nearing a price of $70,000 as of this writing, showing gains of over 4% over the past day, according to CoinGecko.\n\nOn a month-to-month basis, U.S. inflation was flat. The reading followed a 0.3% bump in consumer prices in April and a 0.4% increase in March and February.\n\nWhile investors had already anticipated that Fed policymakers would leave interest rates untouched Wednesday, rate cut hopes for September strengthened, however. That chance rose after the report’s release to 62% from 46%, according to the CME Group’s FedWatch Tool.\n\nLikely delivering a boost to the U.S. economy through lower borrowing costs, Fed Chair Jerome Powell said last month that policymakers need “greater confidence” that inflation is heading to its target of 2% annually before loosening monetary policy through rate cuts.\n\nAD\n\nAD\n\nShifting rate cut expectations dented Bitcoin’s price in April, knocking the cryptocurrency away from all-time highs above $73,000 a month prior. However, analysts say Bitcoin could test those prices again as a path toward rate cuts emerges with more certainty and a weaker U.S. dollar.\n\n“At this point, my confidence in Fed rate cuts is pretty high,” Grayscale's Head of Research Zach Pandl said on Twitter (aka X), adding that rate cuts becoming a base case again is good for the strength of Bitcoin relative to the dollar in a separate post.\n\nLow Core CPI inflation in May => Fed rate cuts again the base case => bad for Dollar, good for Bitcoin $BTC pic.twitter.com/2Ntlfl3iJs — Zach Pandl (@LowBeta_) June 12, 2024\n\nMarkets largely shrugged at hotter-than-expected U.S. job growth last Friday. Still, hours after the figures were released, Bitcoin plunged alongside the rest of the crypto market, causing hundreds of millions of dollars worth of liquidations in leveraged crypto positions.\n\nOn Wednesday, the dollar value of liquidated positions was comparatively muted. Within the past four hours, $10 million worth of crypto long positions have been purged, while bearish traders saw $39 million worth of short positions be closed, per data from CoinGlass.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQODliLUZTcDNJekdXUmRMR09QR3FvZlJOU3VBbEhSM0toYzVEYTFkVUVJMWxGanFZWmlwQ0hMbFBtYkdsbzhsR3FXenpjZnlFSVh6RmRsXzA2Uk9pVWlnRGN0amV0WlBfaFpCS2ttdC13SDNLLS1BWDFySnZ5a0JuWTY1YklvMWlENXV6ZFZqQ2Q4TjBWakg0NmN6QlVraEHSAaQBQVVfeXFMTXFONVBLWmdjRTNubWRZUjJTcEtrWkgxeVRJMVh0Z0h3U1QxcG44SndNZ2lxZkxOVlUwZ1p0amRPaTJiZTdzMGhRTm9VQW05R1cwMWFlRWd4LXBUM0lWTGpuRmhCcUlod1FKSnFBWHlsckdyM0UwR3dhY19RWDVqakh4UkN1cUZsdTgwZGhsdlNHaU8zTUZjY3Nsd0FvRmRFeHI5dmI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Futures Traders Selling Aggressively, Will ETH Price Drop Further? - CoinGape",
        "content": "Amid the broader cryptocurrency market correction, the Ethereum (ETH) price has faced significant selling pressure, with its price dropping 3.5% to $3,550. Additionally, Ethereum’s daily trading volume has surged by 84%, reaching $14.8 billion.\n\nEthereum Futures Traders Sell Aggressively\n\nWith Ethereum’s price struggling to surpass the $4,000 mark, traders might want to focus on the behavior of futures market participants, as per the CryptoQuant report. The chart below displays the 7-day moving average of the Taker Buy Sell Ratio, which measures the relative aggressiveness of buyers versus sellers. A value above one indicates buyer dominance, while a value below one indicates aggressive selling.\n\nadvertisement\n\nAs shown in the chart, the ratio has failed to rise above one and has been declining sharply in recent days. This trend suggests that most futures traders have been selling Ethereum aggressively, either for speculative purposes or to realize profits. This significant drop in the metric is a bearish signal, indicating that the current downward retracement could continue if this trend persists.\n\nOn the other hand, Santiment’s Network Realized Profit/Loss (NPL) suggests that holders are selling at significant profits, while steep dips indicate holders realizing losses, potentially signaling panic sell-offs and investor capitulation.\n\nFor ETH, the NPL indicator spiked dramatically from 36.69 million on June 10 to 1.06 billion on June 11. This positive trend indicates that holders are selling at substantial profits, hinting at the formation of local tops.\n\nUncertainty Surrounding Spot Ether ETF Approval\n\nAnalysts believe that ETH is failing to catch the bullish momentum as there’s no clarity on how long it would take for the SEC to approve the S-1 filings. Despite the Ethereum investment inflows hitting record last week, investors aren’t sure whether this shall continue further.\n\nHowever, even if the U.S. Securities and Exchange Commission (SEC) approves filings from BlackRock, Fidelity, VanEck, and other firms this week, investors worry that the current market conditions are not conducive to demand for Ethereum ETFs.\n\nFor the Ethereum price, there’s a notable support zone, comprising the 100-day moving average at $3,430 and the 0.5 Fibonacci retracement level at $3,419.\n\nIt will be interesting to see whether the Ethereum whale accumulation continues or not going ahead. Additionally, macroeconomic concerns are showing further signs of stress.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4T0pHTjJsbmpQX1pEdXhUNUstR0lvWG5aS1BDaVViNGY2bjdlcmR0cVVIR2Z5clJMNmlxc3poQzFFR1lCa2ZiT2FBQVQ2XzhadndwbXFTQ2U0eG51Q0V2Y0M1Q2czV1VVb1ItX1REVVppTllxdzB5TFZZS3NlNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum a Good Investment in 2024? - VanEck",
        "content": "Welcome to VanEck\n\nVanEck is a global investment manager with offices around the world. To help you find content that is suitable for your investment needs, please select your country and investor type.\n\nSelect Your Country / Region Austria Belgium Denmark Finland France Germany Ireland Italy Liechtenstein Luxembourg Netherlands Norway Poland Portugal Spain Sweden Switzerland United Kingdom Netherlands Select Investor Type Individual Investor Professional Investor Select Investor Type"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQNFJnVFVQRGdPb2NiTG5fU2JqUEVhX3RQTXpwRWpyRE1aanJZVmJ6b2gtY0ZRRFBHazVUOThnWmVYM0tMQS0zV0NiRmJhVWJ1Umx3anNMX1JFOTNHblo1SXFYSWhRT3pOT0U0Szlkamw0WlpEb3I3cEtxbzBySV82SjYzMU1OTjVSc0lBNXVLR196Vzc5dmdkbl9VYVRBa2RNOEJDYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum in demand as investors buy the dip By Investing.com - Investing.com",
        "content": "Investing.com - Twelve cryptocurrency wallets purchased 156,733 from Coinbase (NASDAQ: ) in the past few hours, valued at approximately $574 million. This transaction was completed at an average price of $3,664 per Ethereum.\n\nHowever, despite these purchases, Ethereum's price is struggling amid corrections that have hit the crypto market in general.\n\nIf you're looking for an opportunity to invest in crypto companies' stocks amid the recent market movements, Investing Pro provides you with the necessary tools to make informed investment decisions. Despite the challenges Ethereum faces after the massive purchase of 156,733 units worth nearly $574 million, there is still optimism for price increases due to the supply on exchanges dropping to a level not seen in seven years. Subscribe now and get an additional discount by using the code SAPRO2. Click here to subscribe.\n\nWill Ethereum's price drop by 7%?\n\nAccording to data from the analysis platform Spot On Chain, 11 out of the 12 cryptocurrency wallets withdrew about 13,059 Ethereum. Notably, one of the wallets – 0xdfa, withdrew a slightly higher amount, 13,084 Ethereum.\n\nMeanwhile, the supply of Ethereum on cryptocurrency exchanges has significantly decreased, reaching its lowest level in seven years, as reported by blockchain data from Glassnode. Lark Davis, an experienced crypto investor, highlighted this trend.\n\n\"The supply of Ethereum on exchanges is at its lowest level in 7 years, and as a result, the price of Ethereum could rise significantly.\"\n\nAt the same time, the crypto community is abuzz with the recent approval from the U.S. Securities and Exchange Commission (SEC) for Ethereum ETFs. This development is a crucial advancement for the cryptocurrency market, opening the door for significant potential investments, reflecting the early success seen with ETFs.\n\nMeanwhile, prominent crypto researcher Bobby Banzai predicts monthly inflows of $569 million into Ethereum ETFs. His predictions are based on the performance of international ETFs and futures data from the Chicago Mercantile Exchange.\n\nDespite these positive developments and market optimism, the immediate impact on Ethereum's price has been unfavorable. Following these large purchases, Ethereum's price has dropped by 4.91% in the last 24 hours and is currently trading around $3,494.18. Spot On Chain attributed this to the possibility that the transactions from new wallets could be part of over-the-counter (OTC) deals, which do not directly affect the market price. The data analysis platform's forecast indicates cautious short-term expectations for Ethereum, predicting a potential 7% correction from the current market price.\n\nNevertheless, Ethereum faced challenges this Tuesday, with the digital currency market undergoing a price correction. If this downward trend continues, Ethereum's next support level could be at $3,302.\n\nIn the last 24 hours, has dropped by about 3%, has fallen around 7%, and has decreased by approximately 7%."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxONzg5ZmZsRVdTZk14V2ZFRFpiUWdTNWg2azNVMVQ5M3B3OGJHS3VYb1FYN1BYUVhNb045NWM1ZU85T0xNRGVXWUdNWTVpcWpURUt2SlpHdDZLNDU5eWQtWFR3NmxENVZoTWtDdVBhT1E3WVo1Z0E4QnEyQ0h2eVBqbGdPSHpSY04wMnF5aFFZOE52SE0xdmk2Qk05VUF4X0otQnVMbUN3cmM4dHpiREZWbjVlQzZ0STN1SFB5aHFGdkFidm5WdUh1V2V3RWc4UWQyb3dkVnFFVjBzTnhCbEp0NGZ6S0J1OEdrb2pmMHVnUznSAfYBQVVfeXFMTmVtY2xPdnFodXhsbjVSTzBnUUQzZmRtZFE1Q044bFVEVlpWWW1SM2c3enZWdnNyM0g2dUNZRVFMSGFSR2VVblJMWTc0MGg3eHdZRFlDOWdTRnZ3ZkJfOS11Z2pzTmstU25NNTdkRUpmYVRjblBib0NsblRETHExVU1oc2VtakhjaWtMM2ZhS2lZZ1gyUWstaDU5TkpEb0FiTkd6YWM1QVBmdHhzMGlkY3NsZHdPX2Q3RUtsY240cE1XNDZibW9ESGEwRG01aDhmX2U4ZEpTc3prMDVSLUZFNXRISXhRRVQzTjd5STBKUWJac3RsVGRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ecosystem sees impressive Q1 earnings, issuers plan to market ETH as the ‘ultimate app store’ - FXStreet",
        "content": "Ethereum ecosystem generated more revenue in Q1 than Etsy, Robinhood or Reddit.\n\nIssuers plan to market Ethereum as a 'producing tech stock' and the 'ultimate app store’.\n\nEthereum could see a bullish reversal in the coming days.\n\nEthereum's (ETH) price is down 1% on Monday as its exchange supply hit record lows following growth in global ETH ETFs' inflows. Meanwhile, issuers plan to market Ethereum as the 'ultimate app store’.\n\nDaily digest market movers: Low exchange supply, high ETF inflows, ‘ultimate app store’\n\nEthereum has recorded several amazing feats in the past few days despite its recent price decline. Here are the latest ETH market movers:\n\nAccording to Glassnode data, only 10.5% of the total ETH supply was left on exchanges as of June 8. Coupled with the declining exchange supply, data from IntoTheBlock shows that large ETH holders (addresses with >10K ETH) recorded a net inflow of 267K ETH on Thursday, the highest daily accumulation since March. This shows that investors are becoming increasingly bullish on ETH, potentially because of the expectation of spot ETH ETFs.\n\nAlso read: Ethereum's price suffers slight decline amid Hong Kong's plan to allow staking in ETH ETFs\n\nRecent Bitwise research revealed that crypto protocols on Ethereum generated more revenue than Robinhood, Reddit, Yelp and Etsy in Q1 2024. \"These applications are a testament to the resilience, creativity, and vision of the global crypto industry,\" said Bitwise.\n\n\n\nGlobal Ethereum ETFs witnessed about $69 million in inflows — their highest inflow since March. Inflows across ETH ETFs will likely continue to rise as investors expect spot ETH ETFs to begin trading in the US in the coming weeks.\n\n\n\nHigh inflows follow predictions from Bitfinex’s Head of Derivatives, Jag Kooner, that spot Ethereum ETFs could attract around 10-20% of flows witnessed in spot Bitcoin ETFs.\n\nHe built his predictions around the historical flows seen in Gold ETFs after they launched in 2004 and how it paved the way for subsequent flows in Silver ETF launches in 2006. Bloomberg analyst Eric Balchunas has previously shared a similar analysis comparing ETFs of Bitcoin to those of Gold and Ethereum to Silver.\n\nAlso read: Ethereum ecosystem active users spike 55% in Q1, 2x ETH ETF records impressive volume\n\nMeanwhile, executives of different issuers, including Van Eck, 21Shares and Franklin Templeton, deliberated on the potential demand for Ethereum ETFs in a recent panel session moderated by Eric Balchunas. According to Balchunas, the executives plan to \"position it (Ethereum) as being like a 'producing tech stock', 'ultimate app store', very different pitch than BTC.\"\n\nETH technical analysis: Ethereum to see a potential bullish reversal\n\nEthereum is trading around $3,661 on Monday after the US Nonfarm Payrolls (NFP) data on Friday cooled signs of any potential breakout above the $3,900 resistance. The NFP news briefly sent ETH below the $3,618 support before a slight recovery. ETH liquidations sit at $9.47 million, with the majority coming from long liquidations worth $6.99 million.\n\nETH/USDT 4-hour chart\n\nAccording to data from Laevitas.ch, the ETH futures premium dropped from around the 15% mark to 13% on Monday — its lowest level since the SEC's position response toward spot ETH ETFs — signaling dwindling investor interest. The futures premium stays around 5% to 10% in neutral market conditions.\n\nRead more: Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time\n\nETH Open Interest (OI) also declined from $16.97 billion on June 6 to $16.37 billion on Monday, a $600 million decrease. However, considering prices declined faster than OI, investors may still be confident of a bullish reversal, indicating the bearish move could be temporary.\n\nAs a result, ETH will likely sustain a horizontal move slightly tilted toward an upward movement. The $3,900 resistance is the key price level for ETH to overcome before any significant breakout. A sustained move below the $3,618 support will invalidate the bullish thesis."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQcXlSN040Zm5YU0FBZG41aG5NT1dHV3IzNkpfS1VXVHJJa2NwaUdQUGVwc3RYMk9ncFJLdlVnZmtoX25fTjNtdDBuRlNfUzRPNUNCNDd5bWhDV3ZsMzRoTUNaT29uRUVjS0hGOUNUVVVRbkVzUXFJeWdTVDVRMXgxdXhfTk5HSGt1LV9MUGRTTl9LQUNTaVc2UGh5Wk8yYkluSk9tZWhobEdORG1aQy1wZENWTDdFSmFHVnNnX0ZPRkVqT1ZqQmVySlk4SFB1OTdFZXlXU2VTRHR4Z3hyUmtXSHZiR056X3AzRjEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) in Critical State, Here's Why Bitcoin (BTC) Can't Reach $70,000, Will XRP Reach All-Time Low? - Investing.com",
        "content": "U.Today - Although was beginning to gain traction on the market, the severe and ongoing consolidation that produced virtually nothing and only pulled ETH at about $3,800 was an important signal pointing to the asset's potential future performance.\n\nDespite its early strong momentum, the price action of ETH has surprised a lot of traders. After hitting resistance at about $3,800, Ethereum entered a consolidation phase. The current decline that we have observed, which is frequently an indication of market indecision, was foreseen in this instance by sideways movement. Over the past few days, Ethereum's price has dropped significantly, approaching $3,500.\n\nThe market had been feeling bullish overall, so many people were surprised by this sudden decline. There are several possible reasons for this unforeseen behavior. Initial liquidity issues could be crucial. Furthermore, macroeconomic factors and investor sentiment are always important. Ethereum's performance may have been impacted by recent global financial trends, regulatory news or even bigger sell-offs on the market. It is also critical to keep in mind that fluctuations in (such as the decline below $70,000) frequently have an impact on the entire cryptocurrency market, including Ethereum.\n\nTechnical indicators show that there was a significant sell-off of ETH in a short period of time. Reentry by buyers onto the market may indicate potential for expansion. Moving averages also show another concerning pattern: the shorter-term MAs crossing below the longer-term MAs, which is typically a bearish signal. Despite the recent downturn, Ethereum's fundamentals remain strong.\n\nBitcoin is struggling\n\nBitcoin is struggling to cross the $70,000 threshold for a number of reasons. The significant lack of purchasing power is one of the main causes. Bitcoin's price previously reached all-time highs due to significant capital inflows.\n\nA decreasing number of new purchasers are nevertheless willing to make these high-level investments, according to the state of the market. The lack of buying interest is making it difficult for Bitcoin to surpass the psychological $70,000 barrier.\n\nThe change in institutional behavior is another important component. Institutions are now shifting money away from Bitcoin ETFs despite the fact that they were crucial to Bitcoin's earlier rallies. This change is partially the result of people looking for better returns in alternative asset classes or new developments in the cryptocurrency industry.\n\nThe potential price of Bitcoin is weakened by diminished institutional support because a significant portion of the buying pressure that raised prices came from these large-scale investors.\n\nFurthermore, strong fundamental drivers that have historically sparked enormous bull runs are absent from Bitcoin at the moment. While the NFT craze played a similar role in 2021, the ICO boom in 2017 propelled Bitcoin to previously-unheard-of heights. There is currently no trend or invention like this propelling investor capital and enthusiasm toward Bitcoin on a large scale.\n\nThe struggles of Bitcoin are also reflected in technical indicators. It appears that neither overbought nor oversold conditions exist as the Relative Strength Index (RSI) has been circling around neutral. This neutral RSI adds to the general sense of indecisiveness and uncertainty on the market, further impeding any meaningful price movement.\n\nin trouble\n\nXRP's current state is really problematic. The asset has lost numerous key support levels like the 50 EMA, psychological levels at $0.5 and others. Such performance certainly puts XRP down on the list of better-performing assets. However, the only question now is: will it reach the yearly low of $0.44?\n\nXRP has been steadily losing value over the last few weeks as it has been in a downtrend. The first real red flag appeared when the 50-day EMA disappeared. After that, XRP dropped below both the critical psychological support level of $0.5, which is represented by the orange line on the 100-day EMA, further deteriorating its technical outlook.\n\nThe annual low of $0.44 is the next significant support level for XRP. The likelihood of reaching this level appears to be growing given the state of the market and technical indicators. There is a long-term bearish trend indicated by the 200-day EMA, which is still significantly above the current price.\n\nThe absence of significant purchasing power is one of the primary causes of XRP's downfall. The asset finds it difficult to hold onto its value, much less increase it in the absence of substantial buy-side interest. Due to investor caution brought on by macroeconomic uncertainties, the overall market conditions for cryptocurrencies are currently not very favorable.\n\nThis article was originally published on U.Today"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOQ2xRVVVBRjRtU2lMLWlzLU1adWVTYmItTnJPTnpWLTU2SG0zR1Q3WnE2U2I0UURud2dmaWlMVUdjVkdIUWV4Zm9TRllkalJ3cDlkcDVpcXFNLVlfeklCMnMzMzNOX2pUNjNRaDY4TldmWXlicW9IS2hPZVRETkdvMm5LenRObXdLeXJRY3pJNkpmbmtWSDY1eDUzbEs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "News on Ethereum ETFs: the SEC has added the ProShares one - The Cryptonomist",
        "content": "Among the news from yesterday, the SEC added ProShares’ request to those that should be definitively approved for the issuance of spot Ethereum ETFs.\n\nIn May, it had approved eight more, but evidently, the one from ProShares had not yet arrived.\n\nThe fact is that, despite having already approved the requests, the process to reach the final approval of all the documentation is not yet complete, and it is assumed that it will not be before July, or at most the end of June, so in fact there is still time to submit new applications.\n\nSEC news: The approval of ProShares’ Ethereum ETF\n\nThe document published yesterday by the SEC reveals that NYSE Arca has proposed a rule change to list and trade shares of the ProShares Ethereum ETF.\n\nThe fund will be simply called ProShares Ethereum ETF, and for now it does not yet have a ticker.\n\nNow the SEC will allow time to submit public comments on this request until the end of the month, and then it will have 45 days to approve, disapprove, or extend the request.\n\nIt is however very likely that the final decision will come along with all the others, just as it happened both in May and January, when in a single day the SEC approved all the requests for the issuance of a spot Bitcoin ETF on the US exchanges.\n\nSo now there are nine requests that should be approved in July, and since for this ProShares request there is time until the end of June to submit comments, it seems likely that the block approval cannot happen before July.\n\nThe approval process\n\nSpecifically, what the SEC approved en bloc in May are the requests to be able to issue an Ethereum spot ETF on the US exchanges submitted by eight companies with the 19b-4 form.\n\nThis is actually just the first step, because to reach the final approval it is necessary for the SEC to also approve the S-1 form.\n\nCurrently, not all eight applicant companies have already submitted this final S-1 form, although at least one (BlackRock) has already done so.\n\nCertainly, it has not yet been presented by the ninth applicant, namely ProShares.\n\nThe approval of the S-1 form constitutes the definitive green light, after which the shares of the ETFs can effectively land on the stock exchange.\n\nIn January, when the S-1 forms of the spot Bitcoin ETFs were approved, the actual landing on the stock exchange took place the day after, because everything was already ready.\n\nThe same thing could happen for those on Ethereum, given that for several weeks now the issuing companies have been preparing for the actual launch.\n\nMoreover, although the SEC will most likely approve the S-1 forms all together, it is not certain that the ETFs will be listed on the same day, so there is a bit of competition among the different issuers to be among the first to have the opportunity to launch the actual trades on the stock exchange.\n\nThe successo\n\nThe spot Bitcoin ETFs launched in January on the US exchanges have had great success from the very beginning.\n\nIt should be noted, however, that in the first weeks the Grayscale ETF took advantage of this to liquidate many BTC, given that previously it was a fund traded only OTC that could not easily liquidate the underlying and that over the years had accumulated as many as 620,000 BTC.\n\nIt is hypothesized that something similar could happen this time as well, given that one of the ETFs is precisely the Grayscale Ethereum Trust which holds more than 10.7 billion dollars of ETH.\n\nThe Grayscale Bitcoin Trust has gone from 28.5 billion dollars to 19.2, and since it is hypothesized that Ethereum ETFs could attract capital equal to about a quarter or a fifth compared to those of Bitcoin, the risk that the current 10.7 billion is too much exists.\n\nTherefore, after the actual stock market debut, it will be necessary to distinguish between daily trading volumes, which could be significant, overall capital inflows or outflows on all new ETFs, and Grayscale liquidations.\n\nIn light of this, although in the case of high trading volumes this launch can immediately be defined as a success, it will be necessary to wait for the situation to stabilize before being able to issue a definitive judgment.\n\nAs for Bitcoin, it was evident from the beginning that the new ETFs were a success, but it took a few weeks before this success could start to have positive effects on the price of BTC.\n\nIt is not a coincidence that the price of ETH is not growing in these days of anticipation, probably also because in reality a drop in its price is expected after the actual landing on the stock exchange of its new ETFs."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9BNjlaR3RlYkswQVFyd3FjZFMyZTdYeW5ualpsbW1ndzdBcDNzWEdNRHVSVFlNZmp3eDdsQTRrNE5fbGlyUXVOeGt1cE1kaUtESUNNd3ZybEpkUGlveXAwa3JCUUhmbjhFUXfSAW9BVV95cUxNbElaelVjcFM0aUZNQ01nV2pZN0h5MTRTZFd6NGQyQXhkblJvZ29Ldjd0TzVLMTZ0S09iVVRMeFlIRXE0VXZPd2JQdmpKTWdnX1VTX0ZCTVkyOVdJbmF4VUEybEh0VDdRZVRMNVFnYVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Protocol Village: Aethir, for Sourcing GPUs, Launches Decentralized Cloud on Ethereum - CoinDesk",
        "content": "June 11: The Cardano network is set to move into the final phase of a multiyear program to become a wholly decentralized blockchain ecosystem later this month, co-founder Charles Hoskinson said in an X post Monday. As a first step, the validating node software operated by the system's stake pool operators, or SPOs, needs to be upgraded to the latest version. Then, the blockchain will evolve into a backward-incompatible version, a process known as a hard fork, and in doing so, enter a new era known as Voltaire. Once the switch is complete, the seven-year-old blockchain will no longer be actively managed by Cardano development firm IOHK, instead wholly run by community members, according to a project roadmap. (ADA)"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOYllHNHV1bElfYXVpdGl6RVY3TUZBbGF6ZmFSemx0MkVpWFVNSWpJbjJRMVhvYV9WN25JcXdaMU83T2ZWTE9KTDBRdXd5c1R2RUtJblRFdF8tRk1LelNDNE5sTUE0ZWNobVF3amtVTnJTc1RfZXp1Tm1feEJNRnozTTdQbnZhbklIWU82d3VkaEpfS25sZU91cGhMM0JLRFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Are Democrats Pivoting on Crypto? - New York Magazine",
        "content": "Neither Gary Gensler nor Elizabeth Warren is a fan of crypto. Photo: Chip Somodevilla/Getty Images\n\nOn a warm evening in late September 2023, Mike Novogratz, the billionaire hedge funder turned crypto investor, walked into a restaurant in Washington, D.C. In town from New York, the CEO of Galaxy Digital had spent the day on Capitol Hill visiting with Congress as part of a contingent of crypto entrepreneurs — most of them young people of color — organized by industry giant Coinbase to send a message to Democrats at a moment when crypto was increasingly seen as a Republican cause. Some key lawmakers hadn’t even shown up to the meetings. “I’m a Democrat, and it’s incredibly frustrating that they don’t see crypto as progressive,” Novogratz, an outspoken progressive who has donated millions of dollars to the party, including to Joe Biden in 2020, told me.\n\nOne Democrat was causing more frustration than any other: Gary Gensler, the chair of the Securities and Exchange Commission. He had spent the bulk of his tenure in the Biden administration attacking crypto, rejecting the need for new industry regulations, suing or threatening a wide swath of crypto companies, and blocking new products like crypto ETFs. And much of the party seemed to be taking their cues from him.\n\n“Gensler is becoming a real problem for our industry,” lamented Novogratz of his former Goldman Sachs colleague. “Part of me wants to take him by the neck and crack it. And I probably would, but I don’t want to get blood on my nice suit.” He gestured to his cream-colored attire.\n\nNow, nine months later, many elected Democrats have done a legislative version of what Novogratz had in mind and offered a meaningful (if partial and hardly unanimous) rebuke of Gensler and the faction of the party — led by Senator Elizabeth Warren — that has been fiercely anti-crypto. In May, the Senate voted 60-38, including 11 Democrats and independent Kyrsten Sinema, to roll back an SEC accounting rule for digital assets, defying a veto threat by President Biden. (The bill would have allowed financial institutions to hold crypto on behalf of customers without having to account for it on their balance sheets, treating it the same way as traditional assets.) Chuck Schumer voted for it, an unusual move by the Democrat and Senate majority leader in that he effectively bucked the will of his party’s leader. So did Senators Cory Booker, Kirsten Gillibrand, and Ron Wyden. Then, a week later, 71 Democrats, including former Speaker Nancy Pelosi, helped pass the Financial Innovation and Technology for the 21st Century Act, or FIT21, in the House, against the opposition of Gensler’s SEC and the White House — a historic event in that it was the first successful vote for a bill that sets out to regulate cryptocurrency at all. Both measures were actively supported by crypto-industry lobbying groups. Late in the evening on the last Friday in May, Biden followed through on vetoing the Senate measure, but the parallel actions by both houses of Congress on two separate pieces of legislation unmistakably signified the moment when the Democrats ceased to be a straightforwardly anti-crypto party.\n\n“In terms of the public policy, Gary Gensler is just wrong about this,” Congressman Wiley Nickel, a North Carolina Democrat who co-sponsored the House bill, told me. He hoped the vote (regardless of the bill’s fate in the Senate) would signal that many Democrats do not share the beliefs of Gensler and Warren. “If Biden allowed Gary Gensler to be the only voice on this, he definitely would lose a significant number of votes,” Nickel added. “If the Democratic Party were the party opposed to web3, to blockchain and crypto, we would only lose votes.”\n\nThen on May 23, another surprise twist complicated the picture even more. After initially signaling that it would block a slate of new financial products (called ETFs, or exchange-traded funds) that would allow average investors a much easier route to purchase ethereum, the second-largest cryptocurrency, the SEC suddenly — and, to many observers, shockingly — flipped and approved eight of them, including one from Novogratz’s company. “The sense is that the tone from the SEC has just changed literally overnight,” Emilie Choi, the president and COO of Coinbase, said at a conference just before the approval. “Probably the administration sensing some panic, I guess.”\n\nThere were signs that in the weeks leading up to these developments, Democrats had indeed begun to panic about the political implications of being pegged as hostile to crypto. Probably not coincidentally, this occurred after Donald Trump announced that his campaign would accept donations in crypto and that he would “build a crypto army moving the campaign to victory on November 5th!” At a campaign event for holders of Trump’s NFTs at Mar-a-Lago in May, the former president called up Ryan Selkis, an influential crypto entrepreneur who had previously voted for Biden, to speak at the podium, and Selkis threw his weight behind Trump.\n\nWell…\n\n\n\nI didn’t expect to share that I was in Mar-a-Lago tonight, but President Trump spoke very highly about crypto and then…invited me and @MihailoBjelic on stage to say a few words.\n\n\n\nFight for crypto.\n\n\n\nSupport President Trump. pic.twitter.com/bPAnvFlxMp — Ryan Selkis (d/acc) 🇺🇸 (@twobitidiot) May 9, 2024\n\n“All of a sudden, the Democrats in crypto, the tenor of their conversation on the Hill and their friends in the White House, changed. It went from ‘Guys, you really should pay attention to this’ to ‘Oh my God, we’re going to lose,’” says a person close to the industry. “You’ve listened to Gary Gensler and Elizabeth Warren for so long, and now we’re backed into a corner.” Warren, of course, has been a chief enemy of crypto for years, making her belief that the industry is primarily a scam a core part of her platform. In a campaign ad last year, she included the Politico headline “Elizabeth Warren Is Building an Anti-Crypto Army.”\n\nPressure had been building on Democrats to extend an olive branch to crypto supporters for months. A Coinbase-backed pro-crypto super-PAC called FairShake, which has raised nearly $100 million this election cycle, helped defeat Katie Porter in the California Senate primary in March, running attack ads against her for being an ally of Warren’s. Recent polls showed that 20 percent of registered voters have owned crypto, amounting to some 35 million Americans, disproportionately made up of young Black men — an important cohort to Democrats. “That’s a very sizable group, and a lot of them are single-issue voters,” says Nickel. “And they were being organized, and real money, material money, was going into it,” says a veteran Democratic strategist.\n\n“This is one of those issues that there’s no one really against it. You’re not going to pick up any new votes for being against crypto,” says the strategist. “There’s only upside politically and policywise to be for it, and only downside politically and policywise to be against it.”\n\nThe crypto landscape has also changed recently. While many in Washington had believed — or hoped — crypto would simply die and disappear after the collapse of FTX and the incarceration of Sam Bankman-Fried, the opposite proved true: Bitcoin recently traded at all-time highs thanks in part to new bitcoin ETFs, approved by Gensler’s SEC in January, that made the cryptocurrency more accessible to regular Americans. Yet the SEC and Congress had yet to lay out a regulatory path for the industry to operate legally, nor had they enacted much in the way of practical protections for consumers. Frustration was growing among Democrats that they had fumbled the issue in a way that might even cost them a meaningful number of votes in 2024. “The approach that both Gary Gensler and Elizabeth Warren have advocated, refusing to regulate the technology on the grounds that that will be the best way to kill the technology, no longer makes any sense — it’s a failed policy,” says a person who has worked in prior Democratic administrations. “Based on our polling, there are millions of voters who are going to vote against Joe Biden on the basis of Gary Gensler’s approach on this issue. With democracy on the line, that’s just a phenomenally irresponsible approach to take.”\n\nWhile Congressional Democrats were reluctant to admit that Trump’s pivot from a not particularly crypto-friendly first term had played a role in how they got a higher-than-expected number of their peers to vote for legislation favored by the crypto industry, Washington lobbyists and crypto advocates said it seemed to break the dam. “The shift is due to a long-term engagement effort by industry with congressional Democrats. The landslide is due to one person: President Trump,” Selkis told me. “The president broke Elizabeth Warren’s evil spell over the Democrats in the Senate, House, and White House.”\n\nWhether the White House will adopt a friendlier crypto stance before the election is still something of a mystery. There are signs that a shift is in progress, though. Notably, Biden did not threaten to veto the House legislation the way he did the Senate measure, saying instead that while he opposed it, he was “eager to work with Congress to ensure a comprehensive and balanced regulatory framework for digital assets.” (Justin Slaughter, the policy director for Paradigm, a crypto VC firm that has been one of the most active industry players in Washington, called it “the most positive statement by this or any White House on crypto, ever.”)\n\nThis is the most positive statement by this or any White House on crypto, ever.\n\n\n\nThe key phrase is “The Administration is eager to work with Congress to ensure a comprehensive and balanced regulatory framework for digital assets” & also states importance of developing them in US. https://t.co/zrG6X8Hzjy — Justin Slaughter (@JBSDC) May 22, 2024\n\nBiden’s late-Friday veto of the Senate bill followed a flurry of efforts by Democrats in Congress to talk him out of it, including coming up with alternative paths to give Biden an out without going back on his word. Nickel, for one, told me he hoped Gensler would just withdraw the rule altogether. There is significant skepticism within the party about whether Biden’s action was the right move. With its anti-crypto tenor, the veto amounts to “political malpractice,” says the Democratic strategist, using a term I heard from other Democrats about the White House’s crypto approach. “I do think the White House, sooner rather than later, is going to make the decision that they don’t want Gary Gensler to potentially impact their ability to win the election. And he has, full stop — he has. Millions of crypto voters are going to vote up or down on this.”\n\nBiden just lost the crypto vote.\n\n\n\nWhat a stupid, stupid mistake. pic.twitter.com/4pk6nTczTl — Avichal - Electric ϟ Capital (@avichal) May 31, 2024\n\nEven for pro-crypto Democratic voters, though, flipping pro-Trump on this single issue is a huge leap. “There’s a lot of soul-searching happening in the industry, and it is quite complicated for a lot of folks who grew up voting Democrat to think on some level, Why does this guy that I voted for, and this party that I voted for, want to put my industry out of business?” says the person close to the crypto industry. “I’ve seen colleagues wrestle with this.”"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOX0RLS0pNNmJfWHJ6bGdzQ253ampYWlM0MjNtaExNck42NV9NcktXdXduamxobEwtZHppdGJoQ1NUMG5tX1owdENzN0lXRkQ4RFVKU05WTllLYzVaRldrV3ZBUUE2ZWtfMEVMNDgxcWZIQkhIajdsdnYySlRuMkZhekwySUlZY3RvZDRId2VSVWdxNGVjeGRuNThVaURZSlM5QVFpR9IBqgFBVV95cUxQT2RUS245cVVhVHpNU0Z0ZktBNHM2VnZHRGVBWl9KVzJhV0YtX1lFMlh6UF9TT2NpS2IyWXpKWXV1aW1kU3pfLVY5ekZOcEh6Y000UEZvaURjajlBd2oxZ0h3QV9FcHpiVFBVMFpJcTJmNDFDakp5MmVVMEptcWlEdWJJWjJ3ZDlucEZWQWRIZUZYQ3cxQXM4R1k3bnY1NEdpYkRUSksxWmZKdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Largest Outflow From Coinbase Topping 300K ETH, Price Gains Loom? - CoinGape",
        "content": "Ethereum, the second largest cryptocurrency by global market cap, has again emerged as the talk of the crypto town today, June 12. The token recorded the withdrawal of over 300K coins from Coinbase recently, marking one of the largest exchange outflows of the year. This colossal outflow from Coinbase has stirred a whirlpool of speculations surrounding ETH’s future price trajectory, tilting the balance toward the bullish side. Let’s take a deeper dive into the token’s on-chain statistics.\n\nOver 336K ETH Withdrawn From Coinbase\n\nAccording to a post shared by CryptoQuant on X, based on this year’s data, it can be clearly seen that on June 11, the exchange outflow totaled 336,284 ETH. Of particular note, this is the fifth time this year that more than 150K ETH has been withdrawn from the exchange. This totals over $1 billion in value, adding a layer of intrigue to the withdrawals and Ethereum’s market dynamics. The large transactions range between $400 million and $1.1 billion each.\n\nadvertisement\n\nAlthough the exact cause of these withdrawals could vary, high chances prevail that whales or as-yet-unknown institutions have driven these withdrawals. Should this be true, ETH’s long-term prospects shine with bullishness.\n\nCryptoQuant previously recorded similar activities orbiting ETH before the commencement of spot Bitcoin ETFs, deeming it to be due to traders’ anticipation of an overall market rally. Similarly, the withdrawal valued over $1 billion comes in tandem with approval in spot ETH ETFs recently. Crypto market enthusiasts continue to extensively eye the token as ETH remains poised to face the implications of reduced supply on exchanges.\n\nAlso Read: Chainalysis Bags Dismissal In $80M Employment Contract Breach Lawsuit\n\nEthereum Price Jumps\n\nWhereas, after the data surfaced in the market, the ETH price gained 3.02% to trade at $3,641. The token’s market cap jumped 3.33% to $437.54 billion.\n\nCoinglass data illustrated that ETH futures OI dipped 1.67% to $15.86 billion, followed by a derivatives volume dip of 1.80% to $25.58 billion. This data aligns with Ethereum’s recent bearish turn, wherein the token plunged from the $3,800 level to even below $3,500.\n\nMeanwhile, the RSI hovered at around 46, hinting that the asset is in neutral territory. Should buying pressure further prevail in the market, as in the abovementioned case, ETH could witness a additional bolstered price movement ahead. Nonetheless, selling pressure encountered by the token poses a risk to price.\n\nAlso Read: Spot Bitcoin ETF To See Majority Inflows Linked To Arbitrage, Here’s Why\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPNjRvSkhGYWhLS09nNXVzSFJxZjNfZFBvcF80bzl5WmNROVJKY2ZOMGJqOFE1SWZUQTRKYWZzVnZXUVJDclZSTk9WZmJYOFJVZHEwcXpiazlBa3k5bC1xSktkRllPam13bmdtamxpbkZESjlfc3QteTUzRjhQbmlVMkpwMGlETllFRi1EMjZ3TG1XYjliVExZ0gGfAUFVX3lxTE5hc2Yxbk5mQkhSRS1EWDhSMUpFQ2ptN2xqNlAzZXFfVUlXS29QVXNEcERYeElSM3A4cGY4YVVCZFJRQ3diXzA4XzY4WjVCdC1fYS0yODlhc2RKV0RoTndPZDd3dVNFbDVhdlBTWFlVeHJ5YVNZQ0pDOW9JbDNVWjJaZzl1emEwSEdYRUZhcWY4N1VOTlU5SzE0ZEVWLW9Fcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "MetaMask Adds Pooled Ethereum Staking Service—But Not for US or UK - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMetaMask, a leading Ethereum wallet and browser extension, has launched its pooled staking service, allowing users to stake any amount of ETH.\n\nEthereum staking is the mechanism by which validators on the proof of stake network participate in consensus, or the verification of transactions before they're added to the blockchain. If their nodes process blocks of transactions that are online and process blocks when assigned, they collect rewards. And if they don't, they can see their staked ETH slashed as a penalty.\n\nBut users need 32 ETH to become a validator—a criteria that 99% of holders fall short of, MetaMask said in its press release.\n\nThe pooled staking will allow MetaMask users to stake any amount of ETH and earn rewards for contributing to the network's security. The service is currently available to a small group of users, with a broader rollout expected soon.\n\nAD\n\nAD\n\nHowever, it will not initially be available in the United States or United Kingdom.\n\nThe crackdown on staking services in the U.S. has been severe. In 2023, the Securities and Exchange Commission fined Kraken $30 million in a settlement over charges that its crypto staking service constituted an unregistered offering of securities. Coinbase saw its staking service curtailed after the SEC made similar allegations against the San Francisco-based crypto exchange.\n\nIn the U.K., things are a bit less dire—but still unclear.\n\nEconomic Secretary to the Treasury Bim Afolami promised in Feburary this year that staking and stablecoin rules would be read in six months. When asked about progress during a Financial Times Crypto and Digital Asset Summit, he said he's still confident the rules will be implemented.\n\nAD\n\nAD\n\n\"What I’m very confident we’ll be able to achieve is the secondary legislation around staking and stablecoins,\" Afolami said during the London event. \"Those two things are absolute priorities in the coming weeks and months.\"\n\nSome members of the Ethereum community have seen the regulatory pressure or lack of clarity as an opportunity to further decentralize the network. As it stands, the U.S. accounts for 50% of all validator nodes on the network, followed by Germany with 12%, South Korea with 6%, and the UK with 4%, according to Etherscan.\n\nMatthieu Saint Olive, senior product manager at Consensys—the company behind Metamask—emphasized the simplicity and control offered by the new service. “MetaMask users now have an easy way to stake ETH in enterprise-grade validators while maintaining full control of their ETH, earning rewards, and making Ethereum more secure,” he said.\n\nMetaMask's pooled staking is backed by Consensys Staking, which manages over 33,000 Ethereum validators and more than 1 million ETH staked. The company boasted in its press release that its has zero slashed validators and a 99.9% validator participation rate.\n\nMetaMask's move into pooled staking pits it against established players like Lido and Coinbase, which does still offer its staking service internationally and in several U.S. states. Together the two providers account for almost 45% of the 33 million ETH—worth $116 billion at the time of writing—that's been staked on the network.\n\nLido, the largest liquid staking platform, allows users to stake ETH and receive Lido Staked Ethereum (stETH) tokens, which can be used in DeFi applications while earning an annual percentage yield (APY) around 3.8%. The project's extensive liquidity and integration with numerous dApps make it a formidable competitor.\n\nMeanwhile Coinbase, though it has had to cut back on its staking service availability, is still the second-largest pooled staking provider by a wide margin. Its 15% portion is three times the size of the next couple competitors Figment, Ether.fi, and Kiln.fi."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1qVWwwUkh1ZVpzRUh5bHVMRk5kSWllU2VnTXVBREdfRmtnZENQa0dIa0RYVi1xakppdmJvdlY4QVBaaU1MUGRUcGJlY2hfU19Rd0ZNOW1LVXZ1aVltb0NxZFczTkh4YUN3RjVQbGVTTTFnaElabW9Vcnlpb29BUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "“Bitcoin’s Next Move Could Be $100,000, But This Is Still Altcoin Season”: Analysts Predict Ethereum and BlockDAG Network Takeover - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, June 11, 2024 (GLOBE NEWSWIRE) -- Analysts are offering a variety of predictions for Bitcoin's future price movements, reflecting a range of optimism influenced by upcoming events and historical trends. However, the broader cryptocurrency market indicates a burgeoning altcoin season, where altcoins, particularly those involved in AI and decentralized finance (DeFi) like BlockDAG Network and Ethereum, might outshine Bitcoin in the short and longer term.\n\n\n\n\n\nThe Bitcoin Trend to $100,000\n\n\n\nOne of the most influential factors in Bitcoin price predictions is the recent Bitcoin halving event, occurred in April 2024. This event, which occurs roughly every four years, cuts the reward for mining Bitcoin in half, effectively reducing the supply of new Bitcoin entering the market. Historically, Bitcoin halvings have been followed by significant price increases. For example, post-halving price surges have been observed in past cycles, leading some analysts to forecast that Bitcoin could reach new all-time highs of $100,000 now two months after the 2024 event.\n\nDan Tapiero, a prominent crypto analyst, predicts that Bitcoin could hit $100,000 by late 2024 or early 2025. Tapiero cites the halving event and the increasing adoption of blockchain technologies by both countries and companies as key factors driving this potential rise. Similarly, Geoff Kendrick from Standard Chartered Bank also believes Bitcoin could test the $100,000 mark next year, driven by banking sector turmoil, the halving event, and the end of the Federal Reserve's rate hikes.\n\nBeyond these optimistic forecasts, other analysts provide a more nuanced view. For instance, projections for Bitcoin's 2024 price range from a low of around $27,341 to a high of $118,102, reflecting the cryptocurrency's inherent volatility. This wide range highlights the unpredictable nature of Bitcoin's market behavior, influenced by various macroeconomic factors, regulatory changes, and shifts in investor sentiment.\n\nLooking further ahead, some predictions are even more bullish. By 2030, Bitcoin's price is anticipated to reach between $149,316 and $265,318, suggesting a potential increase of over 850% from its current levels. These long-term projections are often based on the assumption that institutional interest and mainstream adoption will continue to grow like it has done since 2009, providing an even stronger foundation for Bitcoin's value appreciation.\n\nAltcoins: Ethereum and BlockDAG Network Lead\n\n\n\nAnalysts point out that while Bitcoin may reach new highs, it lacks the explosive potential of many altcoins in the current market environment. The altcoin market shows substantial upside potential, driven by innovations in AI and blockchain technology. For instance, AI-focused cryptos like Bittensor, Fetch.ai, and Openfabric AI are gaining traction due to their novel applications in decentralized machine learning and AI-driven tasks.\n\nMoreover, Ethereum continues to be a critical player, with expectations of significant growth due to its extensive use in DeFi and other blockchain applications. Analysts suggest that Ethereum, along with BlockDAG Network , which offer scalable and efficient blockchain solutions, could lead the next phase of blockchain adoption.\n\nEthereum is poised to lead the altcoin season in 2024, according to several analysts and market experts. This potential leadership is attributed to various factors, including technological upgrades, regulatory developments, and the overall momentum in the cryptocurrency market.\n\nOne of the critical drivers for Ethereum's potential leadership is the upgrades to its network. The most notable of these is the EIP-4844 (proto-danksharding) upgrade, which took place in March 2024 and aimed to significantly reduce transaction fees and enhance scalability. This improvement is benefiting Ethereum's layer 2 (L2) networks like Polygon, Arbitrum, and Optimism, making Ethereum more efficient and attractive for users and developers.\n\nThe approval of Ethereum exchange-traded funds (ETFs) is another catalyst for Ethereum's rise. ETFs make it easier for institutional investors to invest in Ethereum without dealing with the complexities of direct cryptocurrency transactions. The recent approval of Ethereum ETFs in Hong Kong has already generated optimism in the market. There is also speculation about potential ETF approvals in the United States, which could further drive institutional adoption.\n\nMarket Dynamics and Historical Patterns\n\nHistorically, altcoin seasons follow significant events in the cryptocurrency market, such as Bitcoin halvings. Analysts like Michaël van de Poppe and Josh Olszewicz highlight that Bitcoin's recent performance often precedes a shift in investment towards altcoins. They suggest that Ethereum's underperformance relative to Bitcoin recently indicates a potential for a significant catch-up, especially as technological and regulatory developments come to fruition.\n\nCrypto analyst Ash Crypto has pointed out that Ethereum's current price action resembles the bullish breakout observed in 2020. If Ethereum follows a similar trajectory, it could reach new all-time highs overcoming the $4,000 mark and can catalyze a broader altcoin rally, potentially leading to a substantial increase in altcoin valuations.\n\nAt the same time, BlockDAG Network represents a significant advancement in blockchain technology, aiming to address some of the inherent limitations of traditional blockchain systems. Utilizing a Directed Acyclic Graph (DAG) structure, BlockDAG combines enhanced transaction speeds and security with high decentralization, creating a robust framework for the future of decentralized finance (DeFi) and crypto mining.\n\nBlockDAG has garnered significant attention and investment since its inception. It has raised substantial funds through its presale, highlighting strong investor confidence. For instance, the project has already raised over $50 million and is seeing daily inflows of $500,000 that has left analysts claiming it could lead the altcoin market together with Ethereum.\n\n\n\n\n\n\n\n\n\n\n\nAs market dynamics evolve, it is essential to recognize the distinct opportunities presented by different projects within the cryptocurrency landscape. Bitcoin's potential rise to $100,000 reflects its status as a digital store of value, while the altcoin market, especially with projects like Ethereum and BlockDAG Network, promises higher returns driven by technological advancements and new use cases. This diversification highlights the importance of a strategic approach to cryptocurrency investment, balancing between established assets like Bitcoin and emerging technologies within the altcoin space.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\n\n\nPresale: https://purchase.blockdag.network\n\n\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\n\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Alan smith support(at)blockdag.network\n\n\n\n"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQZVA5ZE5PZVVKS2R2cng5Zl9Oc3VvdFAwQ2NIa01XekxpM3lqTW9fd1NPcm5jUGk5SVJfNnBLQUJ5VmRRcDhCd0NrN2FvbmRzMGxScldEUDBpTzJKWEtYV2hTMk4xT2pia1d3RFNCM0k1UXRxSmlEX0JLWWdiZW5TZVhQU3pYYVA0RHJLaWVYbld5d9IBlwFBVV95cUxQMVQ5RFRYWmNjQVRfVUtiUU5IM0YxU2otYVdWT0trWjFHckI1WkVMOUpVM1hDR2RtNUpZWm51N1YwbE5YSS1QT0dCU0lRUENmTFVGUmZxU2h5ZHl3U0luOFdQLW01NzdFRGNuRFNqVmlXT3JwTkRZTkdXWWdqVDdwTFhJbXJHemx4SVZHbTJyMEFEbm9wUktV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Update Key Week Ahead for SEC Comments on S-1 Filings - CoinGape",
        "content": "This week is significant for the crypto market as the SEC is expected to respond to S-1 filings for Ethereum ETFs. Since the inaugural May 31st submission deadline, industry players expect a response from the regulatory body within the week, which may shape the course of Ethereum-based investment products.\n\nEthereum ETF Applicants Await Crucial SEC Feedback\n\nWith the clock ticking on the SEC’s review period for Ethereum ETF applications, issuers submitting their proposals are getting increasingly nervous. After the SEC recently allowed a spot in Ethereum ETF, people anticipated quick action on S-1 registrations. However, until now, issuers have not received any response from the commission, headed by its chairman, Gary Gensler. Following the first draft submission deadline, the timing of this communication has generated a lot of anxiety in the sector.\n\nadvertisement\n\nAs cited on social media platform X by Nate Geraci, sources close to the SEC have indicated that at least one of the applicants is expected to get the long-awaited comments by the end of this week. Based on this information, Stakeholders have expressed hope and doubt, given that the SEC has not been known to act quickly regarding cryptocurrencies. Furthermore, the recent retraction by Ark Invest, which had initially expressed interest in launching an Ethereum ETF in partnership with 21Shares, points to the risks and ambiguity that define this endeavor.\n\nSEC’s Mixed Signals Stir ETH ETF Market Anxiety\n\nAdding to the confusion, the SEC has not been clear on its stand on the matter, which was not helped by SEC Chairman Gary Gensler’s recent comments on CNBC. Although the 19b-4 applications for a spot in Ethereum ETF got the green light, the absence of communication after the deadline has created suspense and concerns among potential issuers. This case shows how the SEC has to walk a thin line between promoting innovation and protecting investors in the risky crypto space.\n\nDespite these challenges, the interest in Ethereum as a viable investment vehicle remains strong. In its official statement, Ark Invest did not change its view on Ethereum’s potential and long-term value, even if it had to give up on its ETF dreams. This sentiment is prevalent across the industry, as the conviction in Ethereum’s establishment in the digital asset ecosystem remains strong.\n\nAs the week progresses, financial analysts watch the SEC’s next moves. Major financial entities like JPMorgan have expressed caution, suggesting that the inflow into spot Ethereum ETF might be less than some expect. However, an approving nod from the SEC could significantly alter this outlook, potentially unlocking a new wave of institutional and retail investment into Ethereum.\n\nAlso Read: Vitalik Buterin Spotlights Ethereum Layer 2 Progress, Hints Next Milestone\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOV2RZbkszMzFNN3VqZVMxNzk4V3R4M080Ynp1U0Q3U0EzZTZ1ZV84eV9CQU03X0xtUm9PbkthZEROYUxIeGU1aE8wNGN1enp5YWRrLWhaN2JMY2JRZlEwODRyb1VqR2wwcXh5Y0FRZWdmSFhFVEltZkVvczY2dWFtUXlsZjJvcHpDcmNBa3JQcDFIakhoMVowUnFtYUzSAaIBQVVfeXFMUFgtakZFZlBRTDVGaDg3SFJlYnRIRTA1OG9WYUdDSEp1SkpOYUh5Uy16RFc5V0JBcmJNTTNtSTdmZzFIc3o5RHZBVURCTFBua2t5V1ljaFd4YlNXZHUyeHAyb2lLeUVXQmZhNXh5SHZOYmo0Rjg1SjEwcFVxaEVVRmh1UXI1R3pWdnYyN05YcU1vbFIzcjUxdnVuUHZZTWNiRWNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Issues Crucial Warning as Ethereum Price Eyes Dump - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader Peter Brandt has recently updated his outlook on the Ethereum (ETH) price chart, highlighting a worrying pattern. Thus, Brandt has identified a controversial head-and-shoulders top formation, which is typically seen as a bearish indicator, suggesting that the price may soon fall.\n\nAdvertisement\n\nThis pattern usually signals a reversal from a bullish trend to a bearish one, often resulting in a significant drop in price.\n\nDespite identifying this bearish pattern, Brandt stressed that he is not short on cryptocurrencies. This is particularly interesting given that just a month ago, in early May, Brandt announced that he was officially short on Ethereum futures.\n\nAdvertisement\n\nHowever, at that time, he made it clear that he refrains from shorting the spot market due to counterparty risk and always uses stop-loss orders to manage his risk.\n\nThis is# an arguable head and shoulders top. I do NOT short cryptos pic.twitter.com/gjC0OPoJm3 — Peter Brandt (@PeterLBrandt) June 11, 2024\n\nBrandt's current stance seems to be a shift from his previous position. While he is now signaling a potential bearish trend, the price of ETH has continued to rise. Currently trading at $3,500, the altcoin has seen a significant increase from its price a month ago, when it was trading at less than $2,900.\n\nThe head and shoulders top pattern highlighted by Brandt could be a critical warning for traders and investors. If the pattern holds true, the price of Ethereum could face a downturn in the near future. However, the market's recent behavior suggests a complex scenario, where traditional chart patterns and market sentiment are not entirely in tune."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUFladEVWZGducDYxa1RBVjJRVTVIODdnY3NYTzdpa1dhSTRTUkNlalp5d2dYM3JZTUlDRG10UmtyRm5yelZ5dHVMUEtfQk1WajhxRWxFMFNpZ2otS0I3dkxmYTk5TWx1UHV2YTg2UjNtaE5VVkRGZzBNWXdWLTQtcTdyeG9uUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Biaoqing, the Biggest Chinese Meme, is Now a Very Successful Ethereum Memecoin, Just announced its first CEX listing - Yahoo Finance",
        "content": "Biaoqing\n\nBeijing, China, June 12, 2024 (GLOBE NEWSWIRE) -- It’s no longer rumour that Biaoqing coin is going to be listed on popular Exchange Bitmart: and other leading exchanges would be coming onboard soon.\n\nBiaoqing Launched on June 9th on the Ethereum blockchain, $BIAO has experienced remarkable price growth. In less than a day, its market cap soared from a few thousand dollars to more $6 million, capturing the attention of the crypto space.\n\nThe team has big plans for the Biaoqing project. They are already listed on CoinMarketCap, the biggest crypto data aggregator, and are marketing in every way possible: billboards in the busiest places around the world, trending on various platforms (X, Telegram, dextools, etc.), partnerships with crypto influencers and crypto hedge funds, and many other initiatives. They are also hosting regular Twitter Spaces to keep the community updated and plan to continue their efforts to market $BIAO internationally.\n\n$BIAO is a memecoin based on the biggest meme that ever existed in China and the eastern world in general: Biaoqing. Biaoqing features a series of facial expressions printed on the head of a panda. It is a real phenomenon in Asia, to the point that it's impossible not to have seen it in any of their group chats. The Biaoqing faces are used as frequently as Westerners use their emojis. Like many other famous memes before them, $BIAO aims to rally memecoin enthusiasts around a meme that has never been truly presented in the crypto sphere.\n\nBecause of its narrative of being the \"Pepe of China,\" $BIAO immediately showed a lot of potential. The numerous Biaoqing memes surrounding the project, as well as their qualitative branding, contributed to its viral potential. The Biaoqing faces are hilarious and have tremendous potential to capture the hearts of every meme lover.\n\nIt is important to note that, like every other successful memecoin before it, $BIAO has a lot of originality. Western memes are saturating the market, and we've seen almost all of them represented by a token. But Eastern memes are still absent from the memecoin space, leaving a big gap to be filled. With Biaoqing being the number one meme in China, this could start a new trend. All of this suggests that $BIAO will most likely have a bright future.\n\n$BIAO is available on Uniswap, a decentralized exchange on the Ethereum network, without transaction taxes. It will also be listed on centralized exchanges, which, considering their tremendous trading volume, should happen very soon.\n\nWith a strong team, hilarious memes, extensive connections, the true originality of being the biggest meme in Asia, and aggressive marketing, Biaoqing shows promise. However, potential investors should conduct their own research before investing. Trade safely!\n\nStory continues\n\nSocials:\n\nWebsite: https://biaoqing.live/\n\nTelegram: https://t.me/biaoerc20\n\nX(Twitter): https://x.com/biaoerc20\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Jing Zhang Biao-at-biaoqing.live\n\n\n\n"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQX3RwTzZIb2F5VWxNUnZEdnlPTTFJcWw4NlpzV3FUUE1fWk9GQlA0UWRQUjVJMTZCeW1zaHZXemFRX2dnTUlQcEtlUENRWkxhX1JsNFJyUWFRSmdrdmJUZHZZajdVYlR0dFQzM1hPRWlnMFh4b0FuWDFUdEZQdElBT2FmNHJydEtfemE1YnplOVNaaHU1amstX0Vn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "SEC Reviews ProShares’ Application for Spot Ethereum ETF - Crypto Times",
        "content": "The U.S. Securities and Exchange Commission (SEC) has started reviewing an application from investment firm ProShares to create an Ethereum ETF.\n\nAccording to a report, the New York Stock Exchange (NYSE) Arca had filed a proposed rule change that would allow it to list and trade the ProShares Ether ETF. However, the SEC publishing the filing doesn’t mean approval yet, but it kicks off the formal review process.\n\nHowever, the SEC said there will be a 21-day period for the public to share comments on the proposed ETF. After that, SEC officials will have 45 days to approve, reject, or extend their review of the application thereafter.\n\nSEC just added the ProShares' Ethereum ETF Filing to its website. (That is extremely quick) Instinct initially says this wont launch on day 1 with the other ETFs whenever that is but who knows. This is interesting. https://t.co/VU0bYo3Gjr pic.twitter.com/npZYnljBmY — James Seyffart (@JSeyff) June 10, 2024\n\nIf approved, ProShares Ether ETF would directly track the price of Ethereum itself. Investors could buy shares to get exposure to Ethereum’s price without actually buying and holding the crypto directly, which can be complicated.\n\nMoreover, ProShares plans to have Coinbase Custody Trust Company hold the actual Ethereum backing the ETF shares.\n\n“This is interesting,” commented Bloomberg ETF analyst James Seyffart regarding the filing. However, he cautioned that the ProShares ETF may not launch simultaneously with several other Ethereum spot ETFs that were approved by the SEC in May but still await final registration clearance.\n\nETFs from issuers like BlackRock, WisdomTree, and Valkyrie could begin trading as early as July according to some experts. Regardless of exactly when the first Ethereum ETF hits the market, its arrival would mark a major milestone for the crypto industry.\n\nIn addition to its proposed spot ETF, ProShares has already launched leveraged and inverse Ether futures ETFs this month that allow traders to speculate on the price of Ethereum. The asset manager was also one of the first to offer a Bitcoin futures ETF in 2021."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOWjBVT0JKdXVpMV9YaXhLREYzTGVOUTZUeFgwRTFxQ21Ra185czg0dWhPcWktR0FWM0RUY3cyOXUzSmR0WlM5aVNzR09zLTJvLVVUalZvSTd6Q2tJOTRzUHgwLXRWS2gxdHBUVDNaalROUHFZYzdQdnJzYzl5RjhKNWZmdi1wU19PT2FZb3RONDE4UUlra19sWXE5a1djODRIakRodTE5d0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "ICBC: the largest bank in the world bets on the crypto Ethereum (ETH) - The Cryptonomist",
        "content": "ICBC, the largest bank in the world, claims that the crypto Ethereum represents the driving technical force of the digital future, defining it as “digital oil”. At the same time, it describes Bitcoin as “digital gold”.\n\nLet’s see all the details below.\n\nAccording to the bank ICBC, the crypto Ethereum is ‘the digital oil of the 21st century’\n\nAs anticipated, the largest bank in the world, the Industrial and Commercial Bank of China (ICBC), is defining Bitcoin (BTC) as “digital gold” and Ethereum (ETH) as “digital oil”.\n\nIn a new report shared by Matthew Siegel, head of digital assets at VanEck, the ICBC praises the two main criptovalute by market capitalization.\n\nThe report indicates that the market demand for digital assets is robust, driving innovation in the sector.\n\n“The market demand drives the continuous evolution of digital currencies.”\n\nThe report compares Bitcoin to gold, highlighting that the cryptocurrency has additional advantages:\n\n“Bitcoin maintains scarcity similar to gold through mathematical consensus, while simultaneously solving issues related to its divisibility, authenticity, and transportability. Its monetary attributes are weakening, while its asset attributes are strengthening.”\n\nDefining Ethereum as “digital oil,” the report praises the various features of the ecosystem of the leading smart contract platform. Although ICBC highlights some shortcomings of the network, it believes that technological progress will resolve them over time.\n\n“Ethereum has consistently improved its technology in terms of security, scalability, and sustainability, providing a technical foundation for the digital future.”\n\nSustainability, security, and efficiency\n\nFurthermore, the report reiterates how Ethereum introduces Turing completeness with its unique programming language (Solidity) and the virtual machine (EVM).\n\nAllowing developers to create a wide range of smart contracts and complex applications, providing strong support to blockchain technology.\n\nNot surprisingly, says the report, its flexibility is widely recognized in the sectors of decentralized finance (DeFi) and non-fungible tokens (NFT), and it is also expanding to physical infrastructure networks (DePin).\n\n“In essence, the Turing completeness of Ethereum allows it to execute any programming instruction with the necessary resources and correct instructions, but it also poses several practical challenges. Looking to the future, Ethereum developers will continue to work to balance sustainability, security, and efficiency.”\n\nEthereum under pressure: bear forecasts dominate the market\n\nEthereum, the second cryptocurrency by market capitalization, is going through a difficult period.\n\nIts price has indeed failed to surpass the threshold of 4,000 dollars, generating concern among traders and investors.\n\nTo better understand the current market dynamics, it is useful to observe the behavior of the participants in the futures market, according to CryptoQuant.\n\nAn important indicator is the Taker Buy Sell ratio, which measures the relative aggressiveness of buyers compared to sellers.\n\nA ratio greater than one indicates that buyers are more aggressive, while a ratio less than one shows greater aggressiveness on the part of sellers.\n\nExamining the 7-day moving average chart of the Taker Buy Sell Ratio for Ethereum, it is noted that the ratio, which has never exceeded one, has collapsed in recent days.\n\nThis indicates that the sellers have been more active in the futures market, continuing to sell short or to cash in the profits from the gains at the beginning of the year.\n\nA drop so marked in the Taker Buy Sell Ratio is not generally a positive sign for Ethereum. In fact, it indicates that the majority of futures traders are bear on Ethereum and expect a further price drop of the cryptocurrency.\n\nIn the macroeconomic context, several factors could reverse this trend. Good news, such as new partnerships, technological discoveries, or regulatory approvals, could restore investor confidence and drive up the price of Ether."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVDVaSzZNbk5EUFJkQ3ZXcXU5NXgxNGw5QUVkalJiMm02cUlRc3JmN0M2bzZjekVfcmVUeHYyMTBaQk9USTNveXAzMUZHRC16cW5LQ1lKUkIzd1Z3Wl9pYXFsaU81UzhJYkhLTmRKSkRDSEU3ZlFlWEFqWGNDaXZxVEtqU002RDh10gGOAUFVX3lxTFBJUWR6a09MYV9rTEtlVGFidlpzTy1aN2MxWlZnOTI5c1RLQmg3YzFuQUhHbXY4RWtqSlZja0YwQ21aS1JwU052QnAwZkVmT0ZYeEN1T0tzbjBlNE94ODJvUWpvVld2bTl5cV9ZN0x2V1ppaXV1R3I5azN1VEdxWWhoVm52RWlkYUZzNHFDdEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Why The World’s Largest Bank Called Ethereum (ETH) Digital Oil - CoinGape",
        "content": "The world’s largest bank, the Industrial and Commercial Bank of China (ICBC) recently tagged Ethereum (ETH), the second largest cryptocurrency by market capitalization “digital oil.”\n\nETH Supports Smart Contracts and DApps\n\nThe top financial institution commended the growth and advancement that both Ethereum and Bitcoin (BTC) has registered over the years. It compared BTC to gold, citing that it “retains the scarcity similar to gold through mathematical consensus while solving [gold’s] problem of being difficult to divide, difficult to identify authenticity, and inconvenient to carry.”\n\nadvertisement\n\nNext, ICBC named Ethereum as digital oil, citing its crucial role in serving as a strong support to numerous Web3.0 innovations including the launch of stablecoins.\n\n“Ethereum has been continuously upgrading its technology in terms of security, scalability and sustainability, providing technical power for the digital future. In addition, the introduction and development of stablecoins provide a bridge for the digital currency market to connect to the real world,” ICBC highlighted.\n\nThe bank acknowledged the fact that Ethereum has its programming language known as Solidity but more importantly, ICBC highlighted how the network supports developers. Per the bank’s published statement, ETH allows developers to deploy complex smart contracts as well as Decentralized Applications (DApps). ICBC believes strongly that this has made Ethereum the mainstay in inventive new fields like Non-fungible Tokens (NFTs) and Decentralized Finance (DeFi)\n\nFurthermore, the top China-based bank sees this sentiment transcending gradually to the physical infrastructure network.\n\nCommunity Awaits Final Approval For spot Ethereum ETF\n\nICBC’s endorsement for the altcoin comes while the crypto industry is waiting for the United States Securities and Exchange Commission (SEC) to finally approve spot Ethereum ETF trading. The regulator has requested the submission of amended and updated S-1 registration from all Ethereum ETF applicants.\n\nLast week, Gary Gensler, the SEC Chairman hinted at the possibility of a slow process for the final spot Ethereum ETF trading approval. In his words, the approval of the necessary S-1 forms “will take some time.”\n\nIt is worthy of note that after the submission of the S-1 applications, the Commission would provide filers with its first feedback which will in turn prompt more changes to be made. Some sources familiar with the process noted that this iterative process may take several weeks with expectation of some SEC feedback this week.\n\nRead More: Shiba Inu Investors Move 4.29 Trillion SHIB to Coinbase; What’s Next?\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQS29ScU5wV2didTZJS2w2dTE3WUNVVU4xYUxYR0VjNW9oVzNQbmd0dThtLXJMbVhfRnRiQWlNQmZoandlNjhzNlRrMy1EVmtXRUpNN3ZrMEg5OUZJWmZYQjdGSFlnX2swdGNzd3FqaTBDWXJ6SUQtOWpZNUlKamc3UjZpWERVaWl0OU9udFd6YVhSRGh4MFlfOWRaU3UxYzk3TGl1Qy05R0QxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Crypto news and price analysis: Pepe (PEPE), Kaspa (KAS) and Ethereum (ETH) - The Cryptonomist",
        "content": "How are the crypto Pepe (PEPE), Kaspa (KAS), and Ethereum (ETH) performing? Below is an overview of current and future prices and the latest news featuring them.\n\nFluctuations in the price of Pepe: return to the all-time high or descent towards critical support?\n\nWhen the price of Bitcoin fell below the crucial support level of $68,000, the meme coin sector experienced a significant contraction, with the main cryptocurrencies in this segment seeing a substantial loss of value.\n\nAmong the most affected tokens, PEPE has continued to show a marked bear trend, recording a correction in the last 24 hours.\n\nWith the bearish sentiment dominating the market, a question arises spontaneously: will the price of Pepe manage to retest its all-time high (ATH) or will it slip towards the critical support level of $0.00000880?\n\nAfter a week of weak performance, Pepe managed to regain momentum, recording an impressive growth of 157.85% before encountering a pullback at the resistance level of $0.00001150.\n\nThe bulls managed to reclaim the support level of $0.00000880, which led to a doubling of the price over the next eight days, culminating in a new ATH of $0.00001718 on May 27.\n\nHowever, after reaching this new all-time high, Pepe experienced a sharp bear reversal.\n\nSince then, the price of the coin has been traded under strong selling pressure, indicating a negative influence for the meme coin in the cryptocurrency market.\n\nIf the price manages to stay above the support level of $0.00001150, the bulls could regain momentum, potentially pushing the price of PEPE to test the resistance level of $0.00001410.\n\nFurthermore, if the bull manage to keep the price at that level, Pepe could be preparing to retest its previous ATH within the current month.\n\nOn the other hand, if the bear were to prevail, the price of Pepe could drop below the support level of $0.00001151 and head towards the critical support of $0.00000880 in the coming weeks.\n\nKaspa ready to reach the all-time high after overcoming the key resistance\n\nThe proof-of-work (PoW) cryptocurrency Kaspa seems ready to reclaim its all-time high of $0.18, after surpassing the long-term resistance level located at $0.14.\n\nBetween April 12 and June 2, the price of KAS oscillated within a range, forming a horizontal channel. The upper part of the channel acts as resistance, while the lower part represents support. KAS found resistance at $0.14 and support at $0.1.\n\nSince the beginning of June, KAS has recorded a significant increase in trading volume. For example, on June 3, the daily trading volume of the altcoin reached 165 million dollars, the highest level since November 2023, according to data from Santiment.\n\nThis increase in trading activity pushed the price of KAS above the upper line of its horizontal channel on June 3, indicating a close above the resistance.\n\nThe analysis of price movements on a daily chart suggests that KAS could continue its bull trend.\n\nThe relative strength index (RSI) and the money flow index (MFI) of the altcoin were respectively at 79.91 and 70.44, confirming an increase in demand. These indicators show that the buying pressure on KAS has surpassed the selling pressure.\n\nThe price of the crypto Ethereum compared to PEPE and Kaspa\n\nThe recent data from CryptoQuant has highlighted a bear phase for Ethereum (ETH), with futures traders showing a strong selling bias.\n\nThe cryptocurrency community is closely watching these developments, especially as Ethereum struggles to stay above $3,500, adding further pressure to an already unstable market.\n\nThe data from CryptoQuant provides an insight into the current market conditions of Ethereum, suggesting a possible continuation of the negative trend. The analysis focuses on the “Taker Buy Sell Ratio,” a key indicator of market sentiment in the futures sector.\n\nThis metric measures the balance between buying and selling activities: a ratio above 1 indicates a predominance of buyers, reflecting greater buying pressure, while a value below 1 highlights aggressive selling.\n\nUnfortunately for investors and Ethereum enthusiasts, this ratio has recently fallen below 1, indicating that sellers are outnumbering buyers.\n\nThis bearish trend is confirmed by the significant drop in the Taker Buy Sell Ratio, which has shown a clear shift towards the dominion of the sellers.\n\nAggressive sales could be driven by traders looking to capitalize on speculative gains or reduce risks in a context of high market volatility.\n\nThe persistence of this trend represents a worrying signal for the short-term prospects of Ethereum, which struggles to find stable support levels.\n\nThe cryptocurrency analyst Shayan BTC, who shared this update on the quick-take platform of CryptoQuant, observed:"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxNNmhxd2RXTVRsZDdvVVBfMDY2U245b3FGSWNrR29IdkFOM3JaZThfcUtkZ2kwb3FleVdPajIwZXlOcC04YmVQQTRHUm9URVFfeTRubjlhTnU4bW1IMmd2d1I0N0ZWVnhnZHFpS3ZSOHlUTXdSb19lQXRUaWZGT05ZRzBYcktsT0xpZVhPODU1SWVWemc2VTV0MzVaSXlSWFU4c3AyR0IwU1J5enppdlpOLWR6MjFKcTRnYjVmNU4zaVAzR1ZBZm81MXVHWFFhRXdhb2Z0ZnY5RFRPck5aQ0xyYjlweHRKSm9DUVHSAe8BQVVfeXFMTTJGVEUzM0dPcFhsVWJmaDVreVhlc2t5NXRTNlFGeG92aWlad0ZqWktkNEtkLXh5dmU4MG9xUENWV0dURUlKTlBoRkVLdGRPbDdiVElvQllVUjVLcDB5NC1ad1VPdTFPV3I5ekNleEJ5ZzAwbk9IQjJOUFhXcVNSUlQxSEJDbWt0U29MRm9lTUNaUS05eUlyNE1OQVZhOTExT1VoQ2FfMlJiZkoyM2tybEZ6bjM5bnp4OVdBdUp0d3c4bkVSaVFqbC1maU5fakRGZHZBUVB0WkVHODJ0ZnRHZ1dzbG1sdG10M1Q5MFRiT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin could see high volatility due to US CPI - FXStreet",
        "content": "Bitcoin price is hovering around the weekly support level of $67,147.\n\nEthereum price finds support around a 50% retracement level at $3,424.\n\nRipple price retests its previous support at $0.467.\n\nBitcoin (BTC) price could undergo an initial dip before rallying, with the release of US CPI data today.\n\nEthereum (ETH) and Ripple (XRP) could also mirror BTC’s pattern, showcasing the synchronized dance of cryptocurrency markets.\n\nBitcoin price could turn volatile\n\nBitcoin price has crashed 7% in the last five days as it faces resistance at the weekly close of around $71,280.\n\nCurrently, it is hovering around the weekly support level of $67,147.\n\nBitcoin price is likely to be volatile because of today's US CPI news. This news could trigger BTC to sweep out buy-side liquidity before rallying upside.\n\nIn such a scenario, BTC could first crash 5% from its current price level of $67,416 to find support on the following levels.\n\nAt $63,860, the midpoint level of the price imbalance is between $63,118 and $64,602. The $64,240 level is a 100% price retracement level, which roughly coincides with the 100-day Exponential Moving Average (EMA).\n\nIf BTC bounces off $64,240, then it could rally 11 % to reach its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if BTC breaks and closes below $60,919, the bullish thesis could be invalidated, leading to a crash of 4%, its weekly support level of $58,375.\n\nEthereum price looks promising\n\nEthereum price crashed 11% in the last six days as it failed to close above its $4,000 mark.\n\nCurrently, ETH is finding support around a 50% retracement level at $3,424, calculated from the swing low of $2,864 on May 13 to a swing high of $3,984 on May 27.\n\nEthereum price is likely to be volatile because of today's US CPI news. This news could trigger ETH to sweep out buy-side liquidity before rallying upside.\n\nIn such a case, ETH could first crash 5% from its current price level of $3,474 to find support at $3,279, the 61.8% Fibonacci retracement level.\n\nIf ETH bounces off $3,279, then it could rally by 20 % to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 9% crash to the previous support level of $2,600.\n\nRipple price seems set for liquidity sweep\n\nRipple price crashed 13% on June 7 after it failed to close above the 50-day Exponential Moving Average (EMA) at around $0.526.\n\nCurrently, it finds support at the $0.467 level.\n\nRipple price is likely to be volatile because of today's US CPI news. This news could trigger XRP to sweep out buy-side liquidity before rallying upside.\n\nIn such a case, XRP could first crash 6% from its current price level of $0.477 to find support at $0.450, which is its previous low.\n\nIf XRP bounces off $0.450, it could rally 17 % to $0.522, the 50-day EMA level.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple daily candlestick closes below $0.450, then XRP could crash an additional 7% to its previous support at $0.419."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPaWRGVzNENUptOWJKSHpNbFhpbU8wOERnZGZyemllTC1tX29Ra3ZuS3pmYkFLM1ZpM2dJRkVkZFY5ZmR6TVBlWS05RlZOcE1weGYySmdObGhPaFdpbWNFMGp1aFluUmltNVBLQzFsU3IzYS11bFBTdWtuQXpKU0RYZTFfZXc4bXNhNlEtbjJCLW5vblAwbnNyVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "2 Cryptocurrencies to Buy Whether Bitcoin Hits Another All-Time High or Not - The Motley Fool",
        "content": "Ethereum and Solana are set to soar higher in 2024, even if Bitcoin continues to trade sideways.\n\nAfter Bitcoin hit a new all-time high of $73,750 in mid-March, crypto investors were understandably excited about where it could head next. The crypto seemed poised to skyrocket past the $100,000 level this year. But Bitcoin continues to trade right around the $70,000 mark, leaving some crypto investors searching for potential alternatives.\n\nIf you're one of those investors, there are two cryptocurrencies to put on your radar screen right now: Ethereum (ETH -0.14%) and Solana (SOL -0.11%). Both will potentially soar higher in 2024, whether or not Bitcoin goes along for the ride.\n\nEthereum\n\nThe big catalyst for Ethereum right now is the recent approval of eight new spot Ethereum exchange-traded funds (ETFs). They're set to start trading soon, and when they do, it could lead to a huge influx of new investor money into Ethereum.\n\nWhile this influx of money isn't likely to be anywhere close to the amount of money that flooded into the new spot Bitcoin ETFs, it's nonetheless expected to be significant. For example, JPMorgan Chase predicts that the influx of new money into spot Ethereum ETFs could be as high as $3 billion over the next six months. And K33 Research, an independent crypto research firm, thinks the number could be as high as $4 billion.\n\nThe thought of so much new money flowing into Ethereum, which is already up 70% for the year, has some investors giddy. For example, some think Ethereum might outperform Bitcoin over the next six months, simply due to the potential impact of the ETF boom. When you add in the fact that Ethereum continues to roll out new tech upgrades to its core blockchain, there's growing cause for optimism.\n\nSolana\n\nLike Ethereum, Solana is up 70% for the year. This comes on the back of a monster year in 2023 when it skyrocketed more than 900%. While Solana's upward trajectory has cooled somewhat of late, there's still potential for an enormous move upward in the second half of the year.\n\nOnce you take a quick look at Solana's core metrics, you'll understand why. Just about every key metric has experienced tremendous growth over the past 12 months. The number of users is way up, transaction activity is way up, and the size of the Solana blockchain ecosystem continues to grow by leaps and bounds.\n\nIn no small part, this has to do with soaring consumer adoption. Solana has become the go-to blockchain for buying, selling, and launching meme coins. Even big-time celebrities (well, OK, B-list and C-list celebrities) are getting in on the action, with rappers, reality stars, and musicians launching meme coins of their own on Solana. Since these celebrities have millions of followers on social media, it's possible to argue that Solana is getting a free marketing blitz directed at its core user demographic (young, tech-savvy, and with plenty of disposable income to spend on crypto).\n\nThe good news is that all of this is uncorrelated with what's happening on the Bitcoin blockchain, so Solana can soar higher, even if Bitcoin continues to trade sideways.\n\nThe Layer 1 investment thesis\n\nEthereum and Solana share one key trait in common: They're both Layer 1 blockchains. This means that they're the fundamental building blocks of the blockchain world. When it comes to any key blockchain niche -- such as non-fungible tokens (NFTs), decentralized finance (DeFi), blockchain gaming, or decentralized Web3 applications -- the core starting point is always the Layer 1.\n\nThat's what has me excited about Ethereum and Solana as potential Bitcoin alternatives. If you buy into the general notion that a crypto bull market rally should help to inject new life into every single niche of the blockchain and crypto world, then Ethereum and Solana should be among the biggest beneficiaries.\n\nA rising tide lifts all boats, and Ethereum and Solana are two of the biggest boats out there. Even if you're on the sidelines about Bitcoin, it might be time to take a closer look at Ethereum or Solana."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQeFY4OUtOZUh4WTlWV1JOSGt0TzZkaVpRcTNjR3JYcEVtbXVkejVhTVo0cnFpYjhBUmtCVWJPM3RaNjc1QkNGS1U3SExwTV9yMHVmYTVVWUN0cTBzbm9OZ0xycXlncVQzTHNGd3IwZ09FT192cjl0elA5dXVYcF9RTXpIdHpHT2Rl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Litecoin (LTC) Beats Bitcoin & Ethereum in Network Activity - Watcher Guru",
        "content": "In a surprising development for the cryptocurrency, Litecoin (LTC) has surpassed both Bitcoin (BTC) and Ethereum (ETH) in network activity. Indeed, the asset has surpassed the two leading cryptocurrencies, as LTC saw a 110% surge in daily active addresses over the last week, according to Santiment.\n\nThe development was the first time that Litecoin was able to surpass the two prominent digital assets. Moreover, its daily active address figures reached heights of 728,000, surpassing BTCs 593,000 and 419,000 by Ethereum. Subsequently, all eyes are on LTCs potential to orchestrate an epic rally from the metric.\n\nSource: Blockchain Reporter\n\nAlso Read: CFTC Calls Ethereum & Litecoin Commodities in KuCoin Lawsuit\n\nLTC Rally Incoming? Litecoin Could Build Off its Victory Over BTC and ETH\n\nThe digital asset market has been at the center of the finance sector, with the midpoint of 2024 fast approaching. Bitcoin had carried its early momentum to an all-time high in March, reaching $73,000. Moreover, Ethereum joined the leading cryptocurrency as the second asset to receive spot ETF approval this year.\n\nHowever, both of those cryptocurrencies were surpassed in one key metric by an unlikely competitor. Indeed, Litecoin (LTC) has recently beaten both Bitcoin and Ethereum in network activity. Specifically, the asset saw a massive surge in daily active addressees that exceeded both the leading assets.\n\nSource: Santiment\n\nAlso Read: Litecoin Transactions Surpass 180 Million in 2023 as Adoption Accelerates\n\nMoreover, the market is now observing how LTC could respond to the metric increase. An influx of daily active addresses shows a growing consumer base, which should impact the price. However, the asset has seen its value decrease over the last several weeks.\n\nLitecoin is currently in the midst of a 4% decline over the last month, according to CoinMarketCap. Trading at $77.74 currently, there is hope that it could surge in the coming days. Over the past 24 hours, its volume has surged almost 60%, which is an interesting part of the growing equation."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOQVFHTmJaeDR6dy1HVmRtUTliaDRWeGJuQ1lFaGFJYl9JOXUzMEpfU19WLUhUNXhzYk5DNzRXdzJGc0NKNGNyanJwRFBfa0VhaFcxS216enRuektLZVRWdGlyWVo3WE5YUkxBcTNqM1lDMUc3S3VTMTlsckx5QXFwOHEycGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Market crash. Bitcoin and Ethereum waver - Cointribune EN",
        "content": "Wed 12 Jun 2024 ▪ 4 min read ▪ by Evans S.\n\nCryptocurrencies are going through a tumultuous period, marked by a significant drop in prices. Bitcoin and Ethereum, the two main cryptos, are particularly affected. This decline raises questions about the future of the market and the forces at play. Let’s analyze this situation in detail.\n\nSelling Pressure: A Threat to Bitcoin\n\nBitcoin, often perceived as a safe haven in the crypto sphere, is not immune to market fluctuations. The crucial support level to watch on the daily chart is $66,205. This threshold coincides with a major resistance line.\n\nA close below this level could intensify selling pressure, leading to a further drop in price.\n\nConversely, the most important resistance level for Bitcoin is $69,667. Recently, this level has generated strong resistance pressure, preventing the price from rising.\n\nA daily close above this threshold could rekindle the hope of an uptrend. However, investors need to stay cautious, as market movements are often unpredictable.\n\nIf the flagship crypto closes below $66,205, selling pressure could accelerate. This situation could push the price to new lows, further eroding investor confidence.\n\nIncreased market volatility heightens risks, making predictions difficult. Traders should therefore closely monitor these critical levels.\n\nEthereum: Between Consolidation and Selling Pressure\n\nEthereum, the second largest crypto, is also under significant pressure. On the daily chart, a consolidation has emerged after breaking out of a triangle pattern.\n\nThis consolidation is often a sign of stability, but the current selling pressure has broken the key support level.\n\nFor the ETH crypto, the most important support level is $3,502. A daily close below this level could trigger an increase in selling pressure, nullifying recent optimistic gains linked to ETFs. This situation would be concerning for investors who hoped for a sustainable rebound.\n\nThe key resistance level for this crypto is the 9 EMA average of $3,689. A daily close above this level could give a boost to the price, paving the way for a recovery. However, the market remains fragile, and investors need to stay vigilant against unpredictable fluctuations.\n\nIn the coming days, Ethereum’s behavior around support and resistance levels will determine its trajectory.\n\nInvestors need to be ready to react quickly to market moves to minimize losses and maximize potential gains. Patience and caution are essential in this uncertain period.\n\nMacroeconomic Factors: A Determining Influence\n\nThe price fluctuations of Bitcoin and the ETH crypto cannot be fully understood without examining macroeconomic factors. The global economic situation plays a crucial role in cryptocurrency movements.\n\nEconomic reports, such as employment data in the United States, have a significant impact on the cryptocurrency market.\n\nFor example, a recent report revealed stronger-than-expected job growth in May, contributing to Bitcoin’s decline. This data influences investors’ decisions and trading strategies.\n\nDecisions by central banks, notably the U.S. Federal Reserve and the European Central Bank, also affect cryptocurrencies. For example, lower interest rates can make risky assets like Bitcoin more attractive. However, uncertainties around future central bank decisions add a layer of complexity to market analysis.\n\nOverall investor sentiment also plays a role. Fear, uncertainty, and doubt (FUD) can lead to massive sell-offs, while excessive optimism can lead to impulsive buying.\n\nInvestors need to stay informed and vigilant, adopting a proactive approach to managing risks. Caution is essential in this uncertain landscape. The future of cryptos remains promising, but the road is fraught with challenges. Indeed, the risk of liquidation persists around 71k.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNTVIRXBKMktDakU1bVdPNHBWSGVkeGJ2WWhHc3NnM2hRdTRmWk1aUzhSajNROUpWMVI3R0FuX29XQkpMVnNNZFh5dnpSNzhWSU83YmY0WkdvN0JhWUZiX3piLV9JTkdHTGZrckc5WVVTQmoyanZMSkF4SDcxRm5iNUNGYjdIZjNLT0ZXZDhvaFZkYjNWNVduM09R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum's momentum disappoints: Analysis of June 12, 2024 - Cointribune EN",
        "content": "Wed 12 Jun 2024 ▪ 5 min read ▪ by Family Trading ▪\n\nAfter a rise of more than 20%, Ethereum’s price is undergoing a bearish correction. Let’s examine the future outlook for ETH together.\n\nEthereum (ETH) Price Situation\n\nAfter rising from $3,000 to $3,800 following the approval of Ethereum spot ETFs, the cryptocurrency’s price stabilized before facing bearish pressure, bringing it down to $3,500. This decline was fueled by Bitcoin’s slight drop, which pulled the entire cryptocurrency market with it. Currently, the cryptocurrency seems to be stabilizing, demonstrating renewed interest from buyers. At the time of writing this article, one Ether is worth slightly more than $3,500. Thus, it is below the $3,800 mark, which corresponds to the point of control noted since its last rebound.\n\n\n\nThe point of control (POC) refers to the price level with the highest trading volume over a given period, indicating a key support or resistance zone.\n\nThe next value area to consider is just below the Ethereum price level, specifically below the $3,000 mark. This area coincides with the identified support zone at the same price level.\n\nEthereum remains above its 50-day and 200-day moving averages, continuing to confirm the idea that the cryptocurrency is in an uptrend. However, it should be noted that Ethereum’s momentum is being revised downwards, as evidenced by the oscillators and Ethereum’s own price.\n\nETH/USD Chart (1D)\n\nThe current technical analysis was conducted in collaboration with Elie FT, an investor and passionate trader in the cryptocurrency market. Today, he is a trainer at Family Trading, a community of thousands of self-employed traders active since 2017. You’ll find Lives, educational content, and mutual support around the financial markets in a professional and friendly atmosphere.\n\nA Closer Look at Derivatives (ETHUSDT)\n\nThe open interest of perpetual contracts linked to Ethereum has recently followed the course of its underlying asset. Coupled with a still-positive funding rate, this demonstrates majority participation from buyers in Ethereum derivatives. However, it should be noted that, although positive, these rates have been slightly revised downwards, reflecting a slight capitulation from buyers. This phenomenon could be explained by increasing selling pressure, but also by liquidations, particularly marked on the buyers’ side.\n\nOpen Interest / Liquidations & Funding rate ETH/USD\n\nThe liquidation heatmap of ETH/USDT over three months reveals that the liquidation zone at $3,700 was recently reached. It seems to have triggered buying interest that was not sustained, allowing the bearish movement to continue. Currently, the most significant liquidation zones are on both sides of the current price. Above, we can note the $3,900 zone. Below, we can note the $3,000 zone. The price approaching these levels could trigger a massive number of orders, thus increasing the risk of a period of heightened volatility for Ethereum. These zones therefore represent a crucial point of interest for investors.\n\nETH/USDT Liquidation Heatmap (3 months)\n\nHypotheses for Ethereum (ETH) Price\n\nIf Ethereum’s price remains above $3,300, we could anticipate a bullish recovery up to $3,900 or even $4,000. The next resistance to consider would then be $4,100. If the upward movement continues, this could mark a new high at $4,500 and even reach Ethereum’s ATH, just below $4,900. At this stage, it would represent a rise of more than 37%.\n\nIf Ethereum’s price fails to stay above $3,300, we could envisage a return to around $3,000. The next support to consider, if the bearish movement continues, would be in a price range between $2,800 and $2,700. At this stage, it would represent a decrease of around -13%.\n\nConclusion\n\nAfter an initial rise followed by stabilization, Ethereum’s price has faced bearish pressure, partly due to a decline in the overall cryptocurrency market. Currently, the cryptocurrency shows signs of stabilization with renewed interest from buyers. Although these fluctuations cast doubt on Ethereum’s future direction, its underlying trend remains bullish, favoring the idea of a potential rebound. However, it will be crucial to closely monitor the price’s reaction to the different key levels to confirm or invalidate current hypotheses. It is also important to stay vigilant against potential “fake outs” and market “squeezes” in each scenario. Finally, let’s remember that these analyses are based solely on technical criteria and that cryptocurrency prices can also evolve rapidly based on other more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPMmlBcngwcHJFNjRmbmFYVDZrR2ZPSkNvTWVlMFZuSXJlaHliaEpFNVItd3dZdFdac2hJR3NoeEE0YTJSNDJBSm1Genl6WS1XZHlraGJhNWI2TWpFWE5va19mSlBaSTdmT1VBb2lHQWozS1hqa2RnX21PRlM0ZFBQeHhsb09xZ0hyWjZCRDhIcEFRMHVkX1VkcUhvVUR1QlU40gGmAUFVX3lxTFBoRVVGX3BiVnh1cEJ1a2hoazhRbWJXYVBzaXNaRGJwekRpdFRNZnVxT29XeEkyQVFsQkhENWZ2WGdtQkZsYkUxREo1eXFjZ2JvNm1IVkkxT1ZuYWRMcThONGlReDlrUG5MdGJSYmlZLXA4MnlXdmQ0ektvZXg0U09ETG9QZ2xGMjYyZWF4TzlhNjZhZXpEOURIeHFva1pVWE03eVU4YWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Can Ethereum Price Pump Ahead Of FOMC? - CoinGape",
        "content": "Ethereum price broke out downward from a consolidation zone, invalidating the previous bullish flag. Meanwhile, the markets eagerly await the Federal Open Market Committee (FOMC) meeting on Wednesday to know whether interest rates will get cut or spike higher.\n\nThe price of Ethereum was $3,448 during American trading hours on Tuesday, a 6% drop in the last 24 hours and a further 9.7% decrease in 7 days, as per CoinGecko data.\n\nadvertisement\n\nETH/USD Price Prediction: Bears Take Hold of the Market, These Are the Support Levels to Watch\n\nETH price was previously trending in a consolidation zone, part of a larger bull flag market structure. Bull flags are bullish, and the markets expected the pattern to resolve upwards. However, the Ethereum price experienced great downward pressure in the early morning hours of June 11.\n\nThe price of Ethereum broke below the range, invalidating the bull flag on the 4-hour timeframe. Nevertheless, on the daily timeframe, ETH price action is still trending above the 50-day and 200-day simple moving averages (SMA), albeit very close.\n\nIf bears persist, ETH price may drop further and find support at the 50-day SMA, which also coincides with the 0.5 Fibonacci retracement level. This will put the price of ETH around $3,400. Further below, key support areas exist around $3,200 and $2,900.\n\nOn the flip side, if the bulls overpower the bears, the ETH price may rally and test the lower boundary of the range around $3,650. If ETH continues to rise, it may re-enter the range and move sideways between $3,700 and $3,950 before breaking to the upside and heading towards $4,200. Currently, $3,650 is the strongest resistance level for Ethereum price action.\n\nWhy is the Ethereum Price Crashing?\n\nThe drop in Ethereum price comes a day ahead of the FOMC meeting and also coincided with Bitcoin’s drop in price. The crypto community thinks that the recent market panic is connected to the FOMC outcome.\n\nThe panic is of FOMC and PPI outcome coming on wed and thurs. My guess is we will pump back strong after FOMC and PPI numbers🙏🙏#Bitcoin #altcoins — ₿ SatMaxx ₿ (@vinee202) June 11, 2024\n\nMarket analysts from Bankrate forecast that the FOMC will leave interest rates at a 23-year high in the upcoming meeting. However, they also estimate that there will be three or fewer rate cuts before the end of 2024.\n\nMeanwhile, Ethereum fundamentals remain strong, as the mainnet continues to dominate in fees over Layer 2s, generating 20X more fees than the top L2s combined.\n\nBottom Line\n\nInvestors remain alert for Wednesday and Thursday since FOMC and PPI data may influence the next direction of Ethereum price and the general markets. Ethereum’s positive fundamentals may help sustain the price if FOMC results and comments turn out negative for the markets\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE0tVW1MVGJtSnhoN3NwNkRJOUFSdXFQZVZZalJBeGVmZjdVQkwwVFl3SW1HYmJoa0VpNG5rbXJWcFQxcXh3VlE4R0tCaFY5VEw5NFhMdkZBMFlDVm5JMWw5Q3dUR2lPNW9RaVFlQXp6TdIBdEFVX3lxTE9CNVhaRmk2X0x4OU52aGNiMmFJVEs4dEVzSHlkOGdCRWpoWGM0V3RSenV0RW1hV01rMVREUW1pTnlVcDZnaVRodUdfVjg2bzk0N25ERWNodXlCMzlRd2Y1YTBnSU5UeHFRX2dhTy1nb3ZRZG5u?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 21:01:22 GMT",
        "title": "Ethereum Struggling With MEV Bots, Executive Argues That Solana Has Succeeded - Bitcoinist",
        "content": "Unlike Bitcoin, where transactions are ordered on a first-come, first-served basis, Ethereum and Solana rely on a pool of validators to confirm transactions and add them to the next block. This process allows for flexibility, as users can expedite their transactions by paying higher fees.\n\nAt the protocol level, prioritizing transactions based on gas fees has inadvertently led to the rise of complex Maximal Extractable Value (MEV) bots on Solana and Ethereum. By exploiting the system, these bots have become a significant factor in the ongoing debate about gas fees.\n\nMEV Bots Pushing Gas Fees Higher On Ethereum?\n\nNow, the debate surrounding validators, gas fees, and the impact of MEV bots on Solana and Ethereum is escalating. Mert Mumtaz, the co-founder of Solana RPC provider Helius, taking to X, highlighted the role of a single sandwich bot, Jaredfromsubway, which was the top source of gas fees on Ethereum.\n\nThis bot alone is responsible for a staggering 142 ETH per day, surpassing fees paid by major players like Coinbase.\n\nWith this MEV bot being the highest source of gas fees on Ethereum, the co-founder argues that by not subsidizing validators, the Ethereum Foundation is indirectly endorsing MEV bot operators to continue “robbing” retail traders.\n\nAs it is, Ethereum, notorious for its scalability issues, is the most expensive network to transact on. Though on-chain scaling is a concern, the proliferation of MEV bots as seen with Jaredfromsubway, could be contributing immensely.\n\nIs Solana Doing A Better Job At Addressing MEV Bots?\n\nIn light of this, the analyst points out that Ethereum developers have failed to address the MEV menace despite years of dedicated research and solutions at various protocol levels.\n\nBecause of this persistent problem and coordinated and extensive research that continues to fail in Ethereum, the analyst thinks Solana is doing much better in handling the impact of MEV bots on gas fees.\n\nSolana currently and actively subsides most of its validators. The subsidy, absent in Ethereum, penalizes operators engaging in MEV operations, discouraging the behavior. Nonetheless, it is crucial to know that the subsidy is on voting costs and not the cost of hardware and operation.\n\nEven so, some think this approach only offers “band-aid” solutions. If anything, they argue that Solana actually “invented” and “weaponized” MEV. There are other claims that SOL holders like Multicoin Capital prioritize chains based on their MEV capture potential.\n\nRecently, some of these subsidized validators were caught enabling MEV to “sandwich” users. While the Solana Foundation swiftly removed their stake, it remains to be seen whether MEV attacks will stop.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQb1dKQ2JXTEY1UE9tbWpNYWVnOG1TNTdQRW02bS1iSmprdEVHNE96Yk5Oa19YMVNwWktkU09mTzl6MHVNN0NfNlh6NnEyZEQ1a2lXLWQzU3Z5TGE1M0FZRmstSmtEMGpqbmw4Z1FPX0doWXl0aXJ5b0lpNDBycmNaWWsxdnFFMXN3TE5tOVNDVFRrSEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "World’s Largest Bank Calls Bitcoin Gold and Ethereum ‘Digital Oil’ - Watcher Guru",
        "content": "In what is certainly a positive note for the entire industry, the world’s largest bank, the Industrial and Commercial Bank of China (ICBC), has recently applauded the evolution of both Bitcoin and Ethereum. In a recently published report, the lender praised cryptocurrencies for their importance in an ever-shifting financial landscape.\n\nSpecifically, the bank compared Bitcoin to gold while highlighting its rapid growth in a more digitized economy. Additionally, it called Ethereum “digital oil” while referencing the power of the ecosystem to power a host of Web3 applications and programs throughout the growing marketplace.\n\nJUST IN: 🇨🇳 World's largest bank, ICBC, says \"#Bitcoin retains the scarcity similar to gold.\" June 11, 2024\n\nAlso Read: BTC: Bitcoin Could Hit $100,000 in the Next 10 Days, Says Analyst\n\nICBC Praises Bitcoin and Ethereum for Rapid Growth and Evolution\n\nThere is no denying that the digital asset market has been a massive part of 2024 so far. With the midpoint fast approaching, there have already been two crypto-based spot ETFs approved by the US Securities and Exchange Commission (SEC). Moreover, the prominence of the asset class has surged in recent months.\n\nThat has seemingly caught the attention of the world’s largest bank, ICBC, which has recently applauded the evolution of both Bitcoin and Ethereum. Specifically, the world’s leading lender published a report that highlighted what makes these tokens so important and impressive. VanEck head of digital asset research Matthew Sigel went as far as to call the report “a love letter” to BTC and ETH.\n\nThe bank compared Bitcoin to gold, noting that the toke “retains a scarcity similar” to the metal. Throughout 2024, both gold and BTC have surged to all-time highs as they have dominated the investment sector.\n\nSource: Bitcoinist\n\nAlso Read: Cryptocurrency: 3 Coins To Buy Now Before Ethereum Hits $5,000\n\nAlternatively, they noted Ethereum is “digital oil” in its potential to power applications across Web 3. The bank highlighted how these two assets are growing and evolving to be better used within the market. Specifically, they reference market demand as leading BTC value as an asset to “consistently” strengthen.\n\nMoreover, they note Ethereum has a similar benefit, in that the asset “has been continually upgrading its technology” in varying areas. The report highlights security, scalability, and sustainability, as the most focused aspects that have yielded impressive returns as far as exposure and adoption.\n\nThese two tokens are currently leading the entire market. They have both received exchange-traded products this year and should continue to grow. This kind of reverence for their trajectory only showcases how mainstream institutions are beginning to value that growth."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQMVpSS0ZVcjFDb0JOSFZHOEZieWxBaWZneGJzMHp3QkZ1ZGV3Z1gxVUFnQllkaVZVM3NSdE03YXUxNU1pdUhLcEFDNWM1V05CVm5iSG85ekQ0TUNsRl9yakhtRFd1SjU5bHZzTDVZM0xQMHlyaVJueG5ucnBPRUdudUppbDlUb1HSAYwBQVVfeXFMUElDbm9jRGVtZ3dXYnhudEZxZVJWTjFYSm9VTGdXcUo5MDRJTXNLT2FNbm9xcFc5VUoxNW1MWE1tRnIwNnZOaE9fdGplX1c4QWZSMm9ETDBlRmdGb21ldFJmdDJocWwydGhRb3VGc05IQWYzbmNyT2NUSzhkNl9DbHlUTW5EaWlPXzc0cGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price dip signaling the start of a new rally? - AMBCrypto News",
        "content": "More whale addresses have accumulated ETH in the last few weeks.\n\nETH’s bull trend has continued to weaken with the price drop.\n\nEthereum [ETH], which has been moving closer to a bear trend over the past few days, has presented a buying opportunity for large investors.\n\nAccording to recent data, big wallets have acquired more Ethereum as the price declined, which is a bullish signal.\n\nWhale addresses scoop up Ethereum\n\nAMBCrypto’s analysis of some major Ethereum addresses revealed a slight increase starting from the end of the previous month. Specifically, wallets holding over 10,000 ETH showed growth beginning around the 19th of May.\n\nAt this point, the number of such wallets was approximately 952, and Ethereum was trading at around $3,074.\n\nThe number of wallets holding over 10,000 ETH grew from around 952 to approximately 980 as of this writing.\n\nDespite the ETH price increase to around $3,700, these addresses have continued accumulating more Ethereum.\n\nAdditionally, AMBCrypto’s look at the mega whale chart over the last 30 days revealed a noticeable development: the trend has flipped to the upside.\n\nThis indicated an increase in accumulation by most of the major wallets, reflecting heightened buying pressure.\n\nWith this move, it is just a matter of time before the price picks up—a trend that these addresses are betting on.\n\nMore Ethereum flows out of exchanges\n\nEthereum’s Netflow on CryptoQuant showed that it had been dominated by negative flows in the last few weeks. The chart indicated that the volume of outflows has consistently surpassed inflows in the new month.\n\nA look at the chart showed that since the beginning of the new month, more ETH has left exchanges than has flowed into them.\n\nThe analysis indicated that from the 1st of June to now, the negative flow volume was over $354 million, while the positive netflow volume was around $226 million.\n\nThis netflow trend, combined with the accumulation by major wallets, is a positive sign for ETH despite its recent price trend.\n\nETH moves closer to the neutral line\n\nAMBCrypto’s analysis of Ethereum on a daily timeframe showed that it has been trending in the $3,600 price range for the past three days.\n\nAs of this writing, it is trading at around $3,670, experiencing a decline of approximately 0.8%. ETH saw a slight gain in the previous trading session, but the recent decline has wiped this out.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nEthereum’s Relative Strength Index (RSI) showed that it was above 52 as of this writing. However, the RSI is on a downward trend, indicating that a further price decline could push it below the neutral line.\n\nThis means that while the trend is currently bullish, it is weakening."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBSQnBnNWJRQ1BjUmpjMEpKNjJfTUtsWTVNenlZMWp2WXpQNl84eXQtN0ZlREpJNkN5dHdxb3ZyTmhWV3lRNFNyRWdMYkQwcUR6UjNZTXoxRWFvM05QUHYtTFRaR2JjSDQzeUxBTW1fQ0g5SGtvOHB6OHM1SFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Here's How Much Trump Could Have Had Today If He Didn't Sell His Ethereum Back In December - Yahoo Finance",
        "content": "Here's How Much Trump Could Have Had Today If He Didn't Sell His Ethereum Back In December\n\nAs the upcoming elections draw closer, former President Donald Trump’s involvement in various sectors, including cryptocurrency, could play a significant role. Many are wondering if Trump is a big crypto investor himself as recent data from Arkham Intelligence reveals that Trump reached a quick $33 million high last week. According to Arkham, he currently holds 475.6 ETH, worth $1.73 million.\n\nDon't Miss:\n\nIn December 2023, Trump sent over 1,000 Ethereum (ETH) tokens to Coinbase, presumably to sell. At the time, the Ethereum was worth $2.3 million. However, ETH has since performed well, and Trump may regret selling too soon.\n\nIf Trump were still holding all 1,075 ETH he sent to Coinbase, they would be worth around $3.9 million, nearly 60% higher than what he sold them for, as ETH reached higher than $3,600 today. If he held and sold now instead, Trump could have had $1.6 million more in his portfolio.\n\nWith many investment management firms aiming to list spot Ether ETFs, some experts believe that Ethereum’s continued market share growth and its leading status among smart contract platforms could propel its value to a $2.2 trillion market cap, or approximately $22,000 per coin, by 2030.\n\nTrending: If you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nWhile Trump might regret his sale, the ETH was free. He acquired the tokens through an NFT project that utilized his name, image, and likeness, granting Trump royalties through his licensing deals.\n\nThe Trump Digital Trading Cards project was minted in December 2022 for $99 each. The 45,000 unique NFTs feature photos of Trump in different settings and poses. Currently, the cheapest NFT is on sale for a little less than $500 (0.14 ETH), and the most expensive sale goes for 37 ETH (worth nearly $150,000 at the time).\n\nHowever, the Trump NFT projects do not stop there. Trump released another project in late 2023, coined the \"Mugshot Edition,\" a nod to his legal troubles. It offered personalized rewards, with those who bought at least 47 Trump cards getting to have dinner with him at Mar-a-Lago and receiving a piece of the suit Trump wore for his mugshot when he was arrested in August.\n\nAs Trump continues to earn royalties and performs well on the campaign trail, it will be interesting to see how he manages his ETH position going into the presidential election in November. Mark Cuban said earlier this week on X, that crypto could be a big factor in tipping the scale in favor of Trump this November.\n\nStory continues\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Here's How Much Trump Could Have Had Today If He Didn't Sell His Ethereum Back In December originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOSVM2R0hacFIzRTRyLUhFTXlmcU45YVpadk1qY3VXM3JLVDl1M0FxaGJmRmtub3QyT2xEYzMzN3ViVHNpN0dmaG16Zk9BYTJmbU14NVItbTBYMGw3ZVRBV0ZKMGowMzZZell1WnpCMzdzNjg2RFZ0U3JfMEttblNPbG9Lcl9WaTR1T1RnaGlLT045aER2WHdicW5Lci0ybEg30gGmAUFVX3lxTFBJSTZyMFZzeThfVlZ2RWoybEtIc2RRZWxSZ3JqR1oyeV9pbUt5dWpWM1RvZ3JOWjBObjJfNU1hV3FvWTVGakdyOWhPcDNXdXZHU2ZlOVBqT0F1Tk4wQ1BzSFh1ejJLMzVTbnhoSlc3TEhlYjVNZlotQXRxX2t1Y3VUTXdSRGtNdkRaWEJOSUduWklPaHl2OGRUNThNT3o3eG5IMmVkZ2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Can Bitcoin Price Reach $70,000 This Week As Ethereum, Solana Scream Buy? - CoinGape",
        "content": "The crypto markets have been swimming in a sea of red in the last few days after Bitcoin price crashed to the $66,000 zone. Investors are now scanning the markets for optimal re-entry positions ahead of the next upward move. Key market-moving events this week include the FOMC meeting on June 12 and the Producer Price Index (PPI) data release on June 13. Market analysts anticipate that Bitcoin will react sharply to these developments.\n\nMeanwhile, Ethereum and Solana are also preparing for their next upward moves. Here is a complete breakdown of how these assets may perform in the coming days.\n\nadvertisement\n\nBitcoin Price Eyes $72,000 as ETF Volumes Hits ATH\n\nBitcoin price traded around $67,405 during European business hours on Wednesday, a 0.2% drop in the last 24 hours. With just 9 hours to go before the FOMC meeting, Bitcoin is struggling to stay above $67,000.\n\nBTC price action is trending above the 50-day and 20-day simple moving averages (SMA), which is a bullish indicator for Bitcoin investors. The June 12 daily candle is also showing signs of a struggle and indecision between the bull and the bears.\n\nThe asset has been trending inside a consolidation zone for the past four weeks. Despite the slide in price, Bitcoin fundamentals remain strong, with BTC Spot ETF total cumulative flow surpassing $292 billion. This signals round 2 of massive accumulation. For comparison, the first round of BTC ETF accumulation saw Bitcoin surge from $38,000 to $73,000.\n\nWith this important metric underway, and with dovish comments from FOMC officials, Bitcoin price may hit and surpass $70,000 this week.\n\nEthereum Price Prepares to Test $3,600\n\nEther dropped by 7.6% to $3,521 over the last 7 days, following the market-wide crash. According to the recent Ethereum price prediction by CoinGape analysts, ETH had previously surged in price after the SEC approved 8 ETH ETFs. However, facts emerging later about the nature of the approved applications killed the hype. BlackRock is still pursuing the approval of its S-1 Form, which many Ethereum investors find bullish.\n\nEthereum price broke downward from a consolidation zone it had been in for about 3 weeks. Initially, the zone was part of a bull flag that usually resolves upwards. However, following Bitcoin’s drop in price, the market structure was invalidated.\n\nEthereum may be preparing to bounce back upward, using $3,300 as support. Investors are waiting for the FOMC outcome in order to make their decisions later today. If bullish news graces the crypto space, Ethereum price may break back into the previous range and touch $4,000.\n\nSolana Price Flashes a Huge Buy Signal, $285 Target in the Works\n\nAlthough the recent general market downturn has affected many cryptocurrencies, Solana’s price has braced the storm relatively well. Solana price prediction shows the staking token trading around $151 during European business hours on Wednesday, a 2% decrease in 24 hours and a further 12.9% decrease in 7 days. Nevertheless, SOL price action remains bullish and in an uptrend.\n\nSitting at a $69.7 billion market cap, Solana has been dominating the markets. Currently, the price action is trending above the 200-day simple moving average (SMA) but below the 50-day moving average.\n\nSOL price has been making higher lows for 275 days straight, an impressive bullish streak. The asset is now in a symmetrical triangle, which may resolve in either direction. However, since Solana’s price is in an uptrend, the chances of resolving upward may be higher than otherwise.\n\nA break above the symmetrical triangle may result in a 59% surge in price that will set the SOL price around $285. This will also be an all-time high price for the asset. Solana network has been an exceptional performer, with nearly half a million tokens launched in May 2024.\n\nOn its way up, SOL price may encounter resistance around $196, $228, and $267. Conversely, $132, $126, and $110 may provide robust support for the asset.\n\nBottom Line\n\nCrypto investors are eagerly awaiting the FOMC announcement in less than 10 hours (at press time). Expert forecasts point to no hikes or cuts, but officials’ comments may either hurt or boost cryptocurrency prices. Investors are hoping for dovish comments from Jerome Powel and his counterparts to avoid further bleeding in the crypto markets.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQY21fZUp0WDU4TnBqbWtNMzNNNEFfNWRPNUhlT1YtRHcyaWpZNHJxVHRtd0ZMNzBmblBBcG1felUzc25KZUtsck5TZWExZWNMUm9SNGdqN0dEMzFOVHpXY2xQbWVxWS1LNDBwcERDbmNZd3RJV19vb2stbDJzX2hibDVPZ29URWIzc09UUTgwaG1kekNuMmVjYTZvU1ZCeVlta0lIVU9iZ29CZm9UTzhxT1ktLUZtaFBCcHR2RFdEYTdDMjYyZkktakFTR1VCMzJUdnNXRHcyV2tvdFNCMjlKaUppX3Bwa2Fhb0RCdjJCQ3ZPeUIwZTl1N9IB_gFBVV95cUxQTGM4VVB3cUt2UHBYLTFGOTA2NGo5ZUdGV2lPUW5MRmFjLTJlelhSS0V2dXlBM05LczJVamlFYXNTSi1ocURCMkN3VWtsUDlRdzVIY2FDbmRxeTI5b0YtRHBCQU9WRjVzV1kxdUtpWE1aR053Q0RlbDlZLWxrYUY3bW5TbHRDdHNfWER2bXNMcjJyd0pnQ0JQTjJMeXFHdlZIdDVZbjJhaUl2eUZEbHh6dU1tRnRPSHNVNUhLZmw1bjNjSm1OaDlkUFJGM251LWN6ZzJDRV9xbnhJSmczalFwMFRIMDJjdW5hU1hNeEtmRjNYV3gxdkxhTDdKdGlKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Is Tron Finally Making Noise? The Dynamic Presale That Has Ethereum Whales Excited! - Atalayar EN",
        "content": "Crypto traders always look out for the best coin to invest in to earn exciting returns. The emergence of meme coins coupled with the value they possess has made them a great option for many investors and companies who trade in cryptocurrency. As time goes by, many more meme coins are introduced into the space, with each of them striving to be the most valuable.\n\nTop cryptocurrency blockchains are not left out in this race. They have created their version of meme coins which has also gone bullish since their day of launch. Two top blockchains with valuable meme coins in the market space are Tron and Ethereum. Even with the growth of these coins, experts still believe that Raboo, an AI-meme coin yet to be released, is forecasted to be the best meme coin. This is one of the best coins to buy now and is promised to have a boost of 100X its presale token on launch day. So here is your chance to invest in a coin that will give you a greater value in the future.\n\nTron Is Rising\n\nThe meme coins on the Tron chain struggled to show significant growth when they were first released into the market. Despite being a part of a top cryptocurrency blockchain, these Tron chain coins showed low performances and holders found themselves regretting their decision to invest. However, recent market trends show that these coins are finally moving in the positive direction, causing holders to hang on a little.\n\nThe price of Tron has increased by 2.7% over the last week, and currently trades at $0.118. Tron's value is on the rise at the moment but is there a guarantee that it will be maintained? This is a question that bothers the minds of holders investing in the coin.\n\nEthereum Whales Predict An Enormous Rise In Value of ETH Soon\n\nEthereum whales are entities that can influence Ethereum cryptocurrency market because they hold a substantial amount of the coin. They wield a level of power and sometimes try to bend the market to their will. With the recent presale token of Raboo, Ethereum whales have hope for the future.\n\nThe current price of Ethereum is $3,518 and its value dropped by 4.7% in the last 24 hours. Now because Raboo operates under the Ethereum network, it could be great news for the coin. It is expected that ETH moves uptrend following the surge of Raboo, making Ethereum whales excited because they could use this to their advantage.\n\nRaboo: AI - Moneda meme que puede traer retornos masivos\n\nInvestors who are always on the market in search of an opportunity they can jump on, have discovered Raboo. With a cheap presale token of $0.0048 and a potential to rise to 233% before the end of the year, investors are not going to sleep on this offer at all. They believe that Raboo isn't just any coin and with time, they are going to enjoy an exponential return.\n\nRaboo is breaking new ground everyday and experts are running out of words to describe its potential. It is one of the best coins to buy now and you don't have to wait till launch day to start enjoying benefits.\n\n$RABT is an exciting coin with quality features that work with AI to produce memes that bind holders together. It fosters a community of meme coin enthusiasts where they can learn more about the basis of crypto and the growth of the $62 billion meme coin market.\n\nConclusion\n\nDespite the growth of Tron and the power of Ethereum whales in the market space, investors continue to focus on Raboo which is yet to be released. The potential of this meme coin is enormous and experts believe that it could be one of the leading coins in the future.\n\nYou can participate in the Raboo presale here:\n\nTelegram: https://t.me/RabootokenPortal\n\nTwitter: https://twitter.com/Raboo_Official"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQOUs0REVzUDk4bzJtYVR5X0RsR214ZWZmUXZxRXhSVjZPYjBicVcxWXB3VkZvZm5JS3ZGTWFHSTFOcHo3dEZDQUZFWWM0alRDNFR2dFNqQnBjVWVUdkhIZjN0X2p0aEJPOU82OEJBN3JwWjh3RVhBd29RU3ZJaUd3MEU0TG5EdVFzdFJHSklnOW0wM0pVR3c3S2UzOUhHTGI3UTM4c0dCQy1PNk9BNk0zRDhTZDhSV0pOb2FHZ3hoaGk0YWY5QnoyNHBQT0d1R2QzbThMZ2hiMGNuQdIB3wFBVV95cUxOS2Vrc29qOEJfcC1vVG9vZlJhd3Zwa05LMUxFb0xycDc3WWpZc1dnczFQenVXVEpBNlNzdkh1VWRpYmRPYW9HZHBpWWVMWmdXUW1MeThudWdQMDJEUVZHV2sxWHBGTzM5dklGYmxVemlXeUlmUnFObDVZZlRNd0tkSWVXUXNTdU9FaVJnZVQwMkxWcTBtcW02N0JwNXJQYzdJY3U3eEZRM19PSU9aOTg0RWZ1UE9acTF2N0pOZUNKdnpKWkR1U2VLempkVlFhY3JKTUY4aDV0Q2pUZ1JBQV8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Meme coins & Solana – American Wrap 12 June - FXStreet",
        "content": "Information on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQTGVBYktQX1ZjWjdua3pSdVBRQUptb3FsNnB4azNXWUMwa3BXbHFFazc5QUYtRmZxUldjUFNDZlFGRjVmb3BDUXJSb0ZteWFHSWoyRU1YaE0wZkkxRk9LdmIzN2xXOEhCYkx5d3VOdUd4MUhnX01uZ3A5Tm81QVJROV9FUUhYVmc5bUFVUUhsZGhyXzZRd1dGNU81WlpiQ0hHWUlyYlZnYVhYZmZNbEdVeU5KU1FiLVFWY0RScw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Analyst Reveals Several Reasons Why Ethereum Could Reach a $150K Valuation per ETH - Crypto News Australia",
        "content": "Spot Ethereum ETFs in the US could drive ETH to new highs; analyst Adrian Zduńczyk disagrees it’s priced in.\n\nZduńczyk cites a US$154K ETH price target by 2030, with significant yearly growth and a solid user base supporting this forecast.\n\nHe advocates a 70% BTC and 30% ETH portfolio for optimal risk-adjusted returns.\n\nThe case of the Spot Ethereum exchange-traded funds (ETFs) possibly coming to the United States is a potential catalyst for ETH to reach new all-time highs. Or is the launch – which is expected to see Ether ETFs trade as early as July – already priced in?\n\nRelated: Fidelity International Introduces Instant Share Tokenisation on JPMorgan’s Onyx Blockchain\n\nCrypto analyst Adrian Zduńczyk, a Chartered Market Technician (CMT) with 651K followers on social platform X, doesn’t think so. Based on a VanEck analysis, @crypto_birb believes that ETH could be worth $154K (AU$233.5K) by 2030, with a base target of US$22K (AU$33.3K).\n\nVanEck’s target for ETH by 2030, source: Adrian Zduńczyk via X\n\nAccording to Zduńczyk and VanEck the optimal crypto portfolio is 70% in BTC and 30% in ETH – and they say adding 6% of crypto to the standard 60/40 portfolio will boost profits.\n\nAdvertisement\n\nVanEck Believes Huge Price Target Driven by US$66 Billion in Free Cash Flows\n\nSo how did the American investment manager come to that lofty price prediction?\n\nIt’s simply a “projection of Ethereum generating $66 billion in free cash flows by 2030 and applying a 33x valuation multiple” says Zduńczyk.\n\n2) Portfolio Boost: 6% Crypto Allocation\n\n\n\nAdding 6% crypto to a 60/40 portfolio boosts the Sharpe ratio, with a minor drawdown impact. Analysis of 169 sample portfolios showed that including 3% BTC and 3% ETH significantly improves the risk-adjusted returns. pic.twitter.com/UKyFhCs7iZ — Adrian Zduńczyk, CMT (@crypto_birb) June 8, 2024\n\nThe analyst explains that Ethereum benefits from a strong set of user metrics, with 20 million monthly active users generating US$3.4 billion (AU$5.2 billion) in yearly revenue.\n\nEthereum ecosystem daily active user growth, source: Artemis.XYZ\n\n71% of Network Revenue to Come from Finance By 2030\n\nAnnually, 0.4% of Ethereum’s total supply is burned, highlighting a deflationary trend in its economic model. The platform’s robust economic activity is further underscored by a settlement value of US$4tn (AU$6tn) and US$5.5tn (AU$8.3tn) in stablecoin transfers, reinforcing these growth figures, he added.\n\nBy 2030 it is expected that 71% of the network revenue will come from finance, based on a strong user base and transaction fees much lower than those of credit card processors and payment apps.\n\nOther bullish forces for ETH are the increasing importance of layer-2 networks and the potential of AI integration.\n\nFurther, Zduńczyk believes Ethereum will become a Sharpe Ratio leader. The Sharpe Ratio assesses an investment’s performance against a risk-free asset, adjusting for risk; a higher ratio indicates better risk-adjusted returns.\n\nThe analyst calculates that a portfolio consisting of 71.4% Bitcoin (BTC) and 28.6% Ethereum (ETH) yields a Sharpe ratio of 1.43. This indicates that this combination of BTC and ETH provides a favourable balance between expected return and volatility when compared to other potential combinations of these two cryptocurrencies.\n\nSharpe Ratio comparison BTC/ETH, source: @crypto_birb via TradingView\n\nRelated: Analyst Miles Deutscher Unveils 20X Portfolio Strategy for the Upcoming Bull Run\n\nFinal words of warning though, Zduńczyk says that 2030 is well past his “timeframe of interest” and in general long-term predictions are obviously fraught with uncertainty. He believes there will be a possibly prolonged bear market in 2026, which is why he will be looking to exit the market in 2025."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNQkEyaVpoM3NuV29RTFZZR1Q5RjEwcHkwanZlQTVKTHNtazFpMm5zeE1LOUJLZF95RFBXY1NLY3lteUE0TVVlZ2VibFdpLTB3TFhiNnlOYVF0a2dmTTh4SmpkUjlFV1haQno0dFl5dWotdndVNG5KcDItNDVPR0tVbWZmVXVxcV94eC02MnNWSWNFOFJVdmRMRFUwYlM2Z2wwMlVWOVJrWEp3S3hrYmoxS05PMUFDVzktekNuRFRsNl9UN2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Highlights L2 Wins; 5thScape Set for 100% Jump in June - Techpoint Africa",
        "content": "The co-founder of Ethereum, Vitalik Buterin, expressed his joy with the developments in layer 2 of Ethereum, paying particular attention to the achievements of optimism in the “Stage 1” decentralization due to innovative fault proofs. Buterin’s recognition appeared as he underlined the development of Ethereum against the previous concerns, stating that every issue has been gradually fixed.\n\nThis is especially the case in L2 protocols such as Optimism, which has seen steady improvements in recent times, and this bodes well for future developments, especially in projects such as 5thScape. Projected to grow by 100 percent in June, 5thScape is expected to reap big from Ethereum’s continuing developments. Hence, it is a good investment for investors and an excellent platform for users. This optimism aligns with Ethereum’s approach to the problems and its vision to expand the horizons of blockchain solutions.\n\n5thScape's Cutting-Edge VR/AR Project: Revolutionizing Gaming\n\n5thScape is an innovative platform built on the Ethereum blockchain that aims to redefine the VR gaming landscape. Leveraging Ethereum's advanced infrastructure, 5thScape offers a diverse library of 3D VR games, providing users with a highly immersive and interactive gaming experience.\n\nThe platform is powered by the 5SCAPE token, which underpins its economic infrastructure and enables a play-to-earn model. This model allows gamers to earn rewards through 5SCAPE tokens, enhancing player engagement and incentivizing active participation.\n\n>>Click Here To Visit the Presale Page of 5thScape\n\nIn addition to its extensive gaming library, 5thScape boasts a fully integrated VR ecosystem. This ecosystem includes a decentralized marketplace where developers and content creators can collaborate and trade digital assets. The platform also offers streaming and learning opportunities, creating a comprehensive environment for both entertainment and education.\n\nFrom an investment perspective, 5thScape presents a high ROI potential, bolstered by its ongoing presale phase and the anticipated growth in the VR market. The presale of 5SCAPE tokens provides a gateway for early-stage investment, allowing investors to capitalize on the project's early momentum. The VR market is projected to grow at a compound annual growth rate (CAGR) of 22.91% between 2022 and 2025, positioning 5thScape ideally for substantial growth and market penetration.\n\nWith its innovative approach to VR gaming, robust economic model, and strategic use of blockchain technology, 5thScape is poised to become a leading player in the immersive reality space. This makes it an attractive platform for gamers and investors looking to engage with cutting-edge technology and capitalize on the burgeoning VR market.\n\n5thScape Positioned as a Top Beneficiary of Ethereum's Growth\n\nAs Ethereum continues to address scalability issues and enhance its L2 protocols, projects like 5thScape stand to benefit significantly. The anticipated 100% growth for 5thScape in June underscores its potential to leverage these technological advancements.\n\nWith a focus on delivering an immersive VR/AR gaming experience and backed by Ethereum's robust infrastructure, 5thScape is well-positioned to attract investors and users alike. This growth trajectory and Ethereum's ongoing improvements cements 5thScape's status as a leading platform in the decentralized gaming market, making it a compelling choice for those looking to invest in innovative blockchain solutions.\n\n5thScape Primed for Significant Growth Amid Ethereum's Layer 2 Advancements\n\nThe co-founder of Ethereum, Vitalik Buterin, recently praised the strides made in Ethereum's layer 2 (L2) protocols, emphasizing the substantial progress in decentralization through innovations like fault proofs. Buterin's positive outlook on Ethereum's evolution, particularly with protocols such as Optimism, underscores a broader trend that benefits projects built on Ethereum's infrastructure.\n\n5thScape is projected to experience a remarkable 100% growth in June, capitalizing on these L2 advancements. This anticipated surge highlights 5thScape as a promising investment and a cutting-edge platform for users in VR/AR gaming.\n\nThe Final Verdict\n\n5thScape stands out as a promising investment and a leading platform in the VR/AR gaming space, thanks to its innovative use of Ethereum's L2 advancements. With a projected 100% growth in June, a robust ecosystem, and high ROI potential, 5thScape is well-positioned to capitalize on the expanding VR market and Ethereum's ongoing improvements, making it an excellent choice for investors and users."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUTlrdlNDNDZNRUdKU3c1SkROQ2NleXZQdzBTQ2JZbmN4VFFnTFBYUEZHTFRuc2FzdW1kbm9aMlpHSUdNTVFwTC1lRldkZTVMdHhLaHdlWmRtNDI5ZDRwdlYzdGlOWVNDUzZJWF94aFdPaUVxWW9LU3p3a2N6UHFGY0wzRzNONE1P0gGWAUFVX3lxTE05VzYyN05scXNlcjhnOHB1VF8xSzZfdThTYVljR3psNmlvUXpPVDhtTEtmNXhiLTl5TDVNMFgtQXZmZE1lT3pGLVlMcUJmbG5WTU1EdXdrbVZPQkZpOFY0Ny10eTlDaVY4N3EwVWhIeFphNXZVQjlPTGJxdldmeGZFdDlwdUFWNWdiN25VWGd4a1lhTDNJQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 11, 2024 - Analytics Insight",
        "content": "Recent data from Glassnode indicates that both Bitcoin (BTC) and Ethereum (ETH) balances on centralized exchanges have reached a four-year low. For Ethereum, balances dipped below 16 million ETH, valued at under US$59 billion. This trend has been consistent since before July 2020, accelerating post-pandemic and through various market cycles, including the 2021 peak and the 2022 Terra-FTX contagion.\n\nA decline in exchange balances is generally looked at as bullish because it gives the narrative that investors are ‘holding’ which means they are transferring their coins to private wallets, a process popular in the crypto markets. This behavior can be best explained by increasing optimism about the future price of Ethereum due to general overall maturity and growth of the Ethereum ecosystem."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOb0VPdkV4NnozUlBRX2J5Mm1GdHlCWnNzZlZrM2RzUW84TFFGWUdNQW9IWjRrRm9GSnpaYVo1VWgzVGQ0amctTE00R0Y2WUw5X01XbDlDc2F0YUdaMkJ0dkxKVVhYMmFja1lKa2g2QWgtaXZlN0VyRUJSa1VwV3BBNFUyR1BQdjJNQ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Understanding AML Checks for Ethereum Addresses - UKTN (UK Technology News",
        "content": "Ethereum, with its smart contract capabilities, is a vital player in the crypto world. Dive into the world of AML check Ethereum address, and gain insights into how they work to ensure the legitimacy of transactions.\n\nEthereum, often hailed as the pioneer of smart contracts and decentralized applications (dapps), has witnessed exponential growth in recent years. As the Ethereum blockchain continues to evolve, ensuring AML (Anti-Money Laundering) compliance on the network becomes increasingly essential. This article will simplify the process of conducting AML checks on Ethereum addresses, making it accessible to all crypto enthusiasts.\n\nUnderstanding Ethereum AML Compliance\n\nAML compliance on the Ethereum blockchain involves a series of measures designed to prevent illicit activities such as money laundering, fraud, and financing of criminal activities. Just as in traditional finance, these checks are crucial in maintaining the integrity of the Ethereum network.\n\nAddress Verification on Ethereum\n\nAddress verification is at the heart of Ethereum AML compliance. It entails verifying the legitimacy of Ethereum addresses involved in transactions. AML for Ethereum employs sophisticated algorithms to cross-reference addresses against watch lists and databases containing known fraudulent addresses. This verification process helps detect and prevent transactions involving suspicious parties.\n\nEthereum Address Tracking and Monitoring\n\nTracking and Ethereum address monitoring in real-time are essential aspects of AML compliance. AML solutions continually observe transactions associated with specific Ethereum addresses, instantly flagging suspicious activity. This proactive approach prevents Ethereum fraud and ensures compliance with regulatory requirements.\n\nSecure Ethereum Transactions\n\nEthereum AML checks protect against fraud and enhance the overall security of transactions on the Ethereum network. By verifying the legitimacy of participants, these checks add an extra layer of trust and transparency to Ethereum transaction security.\n\nPreventing Ethereum Fraud\n\nThe Ethereum blockchain has been susceptible to various types of fraud, including Ponzi schemes and phishing attacks. AML solutions for Ethereum are vital in preventing such fraudulent activities by identifying and blocking transactions associated with known scam addresses.\n\nCompliance with the Ethereum Blockchain\n\nAs governments and regulatory bodies worldwide scrutinize cryptocurrency transactions, AML compliance on the Ethereum blockchain becomes increasingly crucial. Cryptocurrency exchanges, wallets, and other Ethereum-based services are subject to these regulations, and adhering to AML checks is necessary to ensure their legitimacy.\n\nConclusion\n\nIn conclusion, understanding AML checks is essential for anyone involved in cryptocurrencies. These checks go beyond preventing fraud; they also contribute to the legitimacy and long-term sustainability of Ethereum as a blockchain platform. As the crypto ecosystem grows, AML compliance remains a fundamental requirement, ensuring that Ethereum remains a secure and trusted space for all users."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVkZCWlFjTmxPU09SUTAycHNyWlIyOGxzNzBXTVkybG04YjAxUXdVNGtDN2k1aWNmYmVVRVo0clJGeG9zNmZPNHFRQVFXY3NZR1QxVHFZc0ZwT0NjclhZdXpfZkhObHhMMHBJSjNSd1R1bmhNNC1PczNJOFdmMFBkaGl1cFg2Z0V50gGOAUFVX3lxTE44TUNmLVFMNHpPZ3NSXzFvTUxLNVM4M1NydGY0YzlBdUU2eldVQlhFS2JiclZ3RFBrUnlSdmh1MmdoeG52T3lmYmFvNkM3U3h3Tzc1dUJsOEd2d0YxcGZnU1lCNjczTU5qYTJnbms4OUVyZ2Mtd1hiUFBkMERiZEFFSURLcHcyMTUwZ19UMHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "More Ethereum investors start to sell: What should you know? - AMBCrypto News",
        "content": "Ethereum’s T aker Buy Sell Ratio has remained below 1 since the 5th of June.\n\nThis means there is more sell volume than buy volume in its Futures market.\n\nEthereum’s [ETH] Taker Buy Sell Ratio, assessed using a seven-day simple moving average (SMA), has trended downward since the 5th of June, data from CryptoQuant has shown.\n\nAccording to the on-chain data provider, the metric has returned values less than one since then. As of this writing, ETH’s Taker Buy Sell Ratio was 0.96.\n\nAn asset’s Taker Buy Sell Ratio measures the ratio between its buy and sell volumes in the Futures market. A value greater than 1 indicates more buy volume, while a value less than 1 indicates more sell volume.\n\nWhen the value of this metric declines in this manner, it suggests that the Futures market for the asset in question has seen more sell orders than buy orders.\n\nIn a recent report, pseudonymous CryptoQuant analyst ShayanBTC commented on the impact of this on ETH’s price. According to ShayanBTC,\n\n“This trend suggests that most futures traders have been selling Ethereum aggressively, either for speculative purposes or to realize profits. This significant drop in the metric is a bearish signal, suggesting that the current downward retracement could persist if this trend continues.”\n\nETH Funding Rate remains positive\n\nThe brief decline in ETH’s Futures Open Interest, since the 5th of June, confirmed the position above.\n\nAt press time, ETH’s Futures Open Interest was $16.37 billion, having declined by 2% since then, according to Coinglass data.\n\nThe coin’s Futures Open Interest measures the total number of outstanding Futures contracts or positions that have not been closed or settled.\n\nWhen it drops this way, it suggests that some Futures traders are closing their positions without opening new ones. This is often viewed as a shift in sentiment from bullish to bearish.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nHowever, despite some market participants’ bearish bias toward the coin, the majority of ETH’s Futures traders have opened positions in favor of continued price growth.\n\nThis is based on the readings from the coin’s Funding Rate, which has returned only positive values since the 3rd of May, per Coinglass data.\n\nFunding Rates are used in perpetual Futures contracts to ensure the contract price stays close to the spot price. When it is positive, it suggests a significant demand for long positions."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPb003dzkxdzJMTjJLa2loTndObnBoZUVMdGVzN1UyTEJnaUFZNWNFb0J3TUpVek9hLUdqUlhmdUFFMllfV2lrSHoyODh3b09oelpMbDZ4STFwUi1MYzlSelUzNGhTSlZKSWVocDdsWFE4cUpKNkt4S2M5TWZ4OFBqTEFnb29uSXpnWjVzSVhrWmtkaGRva2t0VmxESlJQUEU0bUozTw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Global X lists Bitcoin and Ethereum ETPs on London Stock Exchange - Investment Week",
        "content": "The Global X Bitcoin ETP (BTCX) and Global X Ethereum ETP (ETHX) will track the long-term growth potential of the cryproassets, respectively. Both products are subject to a fee waiver, which was implemented when the options initially listed on the SIX Swiss Exchange and Deutsche Börse Xetra two week ago. Global X ETFs hires CEO from Goldman Sachs AM after senior executive exodus The waiver is scheduled to last until 3 January 2025, after which a 0.29% arranger fee for both products will come into effect. Coinbase Custody International will act as a \"secure cryptocurrency custodi..."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPY2FNc0R0d21lVU9aaXZGcEV5M3RnRldMZFY0SlVFdTdsbUR2UC1IejB5OVF2VklaVVFzRkhQVWhoUHJsY2Jjd3lBV25FUHVsRVU1Qjduc1ItWFF3bGpTUXJpbTQtcWpKblVzcjJmR0V6cGItV2hrNDdZNFNZc0Ztc0UxTDBjTU5IQUJV0gGQAUFVX3lxTFAtUl92QTREMmJnMlpNd2M4TFJzUnhRcGpNMFlBdEVISmVCeWlfcks1MUI0eWVMcDVndmxDejF1eDY0WlE0eE5PYzI1SzJCN0NVa1JJdWNReTczUnROeUY5MHdxWkU3cElJLURXTjZBUGNlY1FKbnJVXzlNY0FPZGFqbGJUQUthUlFiOW9ZZ3RXYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "May market analysis: Ethereum, Solana experience highest gains - AMBCrypto News",
        "content": "SOL and ETH had the highest gains in the market increase in May.\n\nThe assets have declined significantly in the last 24 hours.\n\nAn analysis of a recently released market report showed that Ethereum [ETH] and Solana [SOL] had the highest increases in May. This surge was influenced by the ETF spot approval for ETH and the rumored proposal of a SOL spot ETF.\n\nSolana, Ethereum lead gainers chart\n\nAccording to a report released by Crypto Rank, the market experienced moderate growth in May and was not overwhelmingly bullish.\n\nHowever, Ethereum and Solana saw significant price increases despite the slow trend.\n\nThe data showed that SOL had a 30.1% increase, while ETH increased by 24.68%.\n\nThe chart indicated that these assets were the highest gainers, contributing to shifting market sentiment from neutral to positive.\n\nWhat influenced the Solana, Ethereum price gain\n\nThe primary catalyst for the Ethereum price increase was the approval of its spot ETF. Traders view this approval as a source of extra liquidity entering the market.\n\nAdditionally, the approval is expected to raise the demand for ETH, positively impacting its price. Although trading has yet to commence, the news has boosted positive sentiment.\n\nMoreover, Solana is seen as one of the main competitors to Ethereum. When the ETH spot ETF approval was announced, rumors started circulating about a SOL spot ETF being next.\n\nAlthough no proposal has been submitted to date, the positive sentiment has continued and is reflected in the price trend.\n\nHow SOL and ETH have trended\n\nAn analysis of Solana’s price trend on a daily time frame showed that it started May with consecutive uptrends. Although it experienced some declines towards the month’s end, it finished higher than where it started.\n\nAccording to AMBCrypto’s analysis, Solana’s price was around $134.54 at the end of 1st May, after an increase of over 6%. It closed the month with a decline of around 0.8% but was trading at approximately $165.58.\n\nAs of this writing, Solana was trading at around $153, having declined by over 3%. It was now trading below its short moving average (yellow line), which had previously served as support.\n\nThis trend was the opposite of how it started the previous month.\n\nAn analysis of Ethereum’s price trend showed that it started May with a decline of over 1%, trading at around $2,970.\n\nThe rest of the month was relatively uneventful until 20th May, when its value increased by 19.23%, taking its price to over $3,600.\n\nBy the end of the month, ETH was trading at around $3,760.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nAs of this writing, ETH was trading at around $3,519, experiencing a decline of over 4%. Similar to Solana, it has seen significant declines in June.\n\nHowever, it remained above its short moving average (yellow line), which continued to serve as support around the $3,300 price level."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORVZYdWk1M1BpVjRlYm9IRnZBV0gxdXAwWllTeWFJazhOSUxZVEtfdnJXSkZZOEZ5cms4bTVXeU1DYWJMLXp5WDFYS2VsRzhKc1NPOXhDdmdrazhBQmpPQzVkM250ZnVwcGF6ZURCeDlQNUhCVUdvSzNkZlY1YkVCMHNkcjUtNFhEZC1oX9IBkgFBVV95cUxNZEp6eHFDNjZ3Mk5rckJzUVRMbTI1NXktOXZ4VkEyNUZQX3BxS21mUVdjckROc1JTSUl3SXRTNWxQWS1lSERtck1LNFdVdGRiMDJjbnJWTmxvWlhxdWMwNWs2N3I4Uk9uN2xldjN1YTFhWk9rXzQzVU9sWmE4TjFJQmxmN2V2VzE0TGZ3NTczRWlVZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Amidst Ethereum ETF uncertainty, ETH falls 10% – More losses next? - AMBCrypto News",
        "content": "Spot ETH ETF’s prospective issuers are awaiting feedback from the SEC.\n\nETH has seen significant selling pressure in the past few weeks.\n\nEthereum’s [ETH] selling pressure mounts as prospective spot ETH exchange-traded-fund (ETF) issuers await comments from the Securities and Exchange Commission (SEC) on the state of their S-1 filings, submitted on the 31st of May.\n\nMany had expected the regulator to provide feedback on the state of these filings by the 7th of June.\n\nHowever, none of the eight prospective issuers whose applications were approved on the 23rd of May have received any feedback.\n\nWhile it is uncertain how long this process will take, SEC Chairman Gary Gensler noted in a recent interview with CNBC that the agency’s ​​approval of the S-1 forms would “take some time.”\n\nETH bears the brunt\n\nAt press time, ETH was worth $3,539. According to CoinMarketCap data, the value of the leading altcoin has cratered by almost 10% in the last week.\n\nThis price fall is attributable to the drop in new demand for the altcoin. At the time of writing, its key momentum indicators rested below their respective center lines, confirming the spike in selling pressure.\n\nFor example, ETH’s Relative Strength Index (RSI) was 45.40, while its Money Flow Index (MFI) was 45.69. These indicators measure the momentum and strength of an asset’s price movements.\n\nAt these values, they suggest that market participants favored ETH sell-offs over accumulating new coins.\n\nETH’s dwindling Chaikin Money Flow confirmed this trend. As of this writing, the coin’s CMF was in a downtrend and below the zero line at -0.01.\n\nThe indicator tracks how money flows in and out of an asset’s market. A negative CMF value is a sign of market weakness. It suggests capital outflow and indicates a bearish bias toward an asset.\n\nFurther, the negative values of ETH’s Elder-Ray Index confirmed the bearish bias toward the altcoin. This indicator measures the relationship between the strength of buyers and sellers in the market.\n\nWhen its value is negative like this, bear power is dominant in the market.\n\nAs of this writing, the value of ETH’s Elder-Ray Index was -209.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIf ETH’s selling momentum mounts, its price may drop below the $3500 territory to exchange hands at $3403.\n\nIf invalidated and bullish sentiment returns to the market, ETH’s price might rally toward $3610."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPZXFEWDU5c0txYzFPNFVNb3NkQnVfa3pkcjlRcHhtYjVlblpXWXdUckNxVUdzbFhyaDJsSi1BSndwRWw3ZmtNdkczdzZEUldWSFJ2UXNZRVVKZlBsNUw5bkdPQ1ZtSHRRWWYtUTlMMGNWOE9VLWNBc3YwT3l1UGFMUzF6M2xEZGk0V3U1VEhtbW42LVJkYUtudEE5Y2Q1RGNuMDczRFdDT3Fqc2tobEZESVhGT3hyYTRmMWwzYjdqSjhaNy1UWktJRFFSLXBJeGvSAdwBQVVfeXFMT2EwNVlGcUs5aXItY1k1RjVzRXduUmlTSUYwaU1XSGNnUUJ2SW95ckVNNnhDanJvWkViYllFSzlIdDE2SkVHalpwSFI3WV9sNTBsU3RGS1dHdFAtN1hVWGNnczBqa3BzZThxZkR6ZzlmNVJtTW80bmxneXBzSjZ2NUJWMHdveGFKdlZCR0thb240V0YybGhmVFNqZXN0SThYT2RINFQxVU9sQXBzZUhMSWpEc0g3VWdzOXNzcE1DZFdJRlNHOGpIWG80RlozbkljLUdQVnpRbk56b2VZZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price Today, Live Updates: Bitcoin and Ethereum Experience Minor Setbacks - Analytics Insight",
        "content": "Price Analysis\n\nCryptocurrency Price Today, Live Updates: Bitcoin and Ethereum Experience Minor Setbacks\n\nJoin us on the Cryptocurrency Price Live blog, where we provide you with the latest and most comprehensive updates on cryptocurrency market movements. In today's cryptocurrency market, Bitcoin experienced a 0.72% decrease to US$67,393.1, while Ethereum fell by 1.32%, landing at US$3,515.17. Both cryptocurrencies reflect a slight downtrend in the cryptocurrency market. Dive into our dynamic live blog for a unique perspective on the cryptocurrency market's pulse."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxObzhSN1pWUUZpN1lBRmp2UWF2cjBWMkNiVXBIcjF0QWtyRGwxVkdQbW9pOU1DUTMzamN1MUp1dTNLRTdLQmZqTVczdjVGWTlZTEREYjluMXFqQTV6c2p6a3RWRkdPb0cyajc2TXRjSXE5aXZpV0dCSWxURVZrQlo3amlINkRPNV9JMUJQZnozZWhnNnJRM3hlQ0l6SXRrMjVaVDYwZ0MyVmxBRElNd2gxR292VDI0V1p3U3M4UndmU3B6VUZFZThKM0ZUTThkb2xFUHBsRG50Mjh6b1V3MV9fQnJwMURIaW1LLS1IQTFiMUh4Yi1VcFpFZGVOaHBsN182bzdfSWJTTdIBlAJBVV95cUxOdlQ0Z3o1YzJJY25YbUZRSlVWWTk5SkZ3X3N4ZXdNMUxLMVV1Y0hSYmVzekxYVmZSbGJfdlVJX1lSTTV6azV4a1FMeXp6Y0hMLUVDN0YwTElsNlJ1dGk1dHFXQlNjblNPeVA1RkphSlBSSzFyc0NUZm5JNWpBd19MREU0dU53aUY4SjRGT202bTdwbTJlWWk1azFtaGhKN2pYQmFJamVZaWNkZTNJSW1vbnNfb0dfM3VHak5vXzNJTDh4RjFxNFJRNWViZzVaXzFreDNUYldPM0dNd0hDdUYySFZya0FQWTdzUFB4RGxSZUk4WkJUM0dIOUdsWHItMlVQbUlpQnJld2tmd0pLSlh2RTNkNHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Top Analysts Make Bold Predictions For ETFSwap (ETFS), BlockDag (BDAG), And Retik Finance (RETIK): How High Can They Go? - Analytics Insight",
        "content": "Top analysts are strongly backing ETFSwap (ETFS) to make these massive price surges due to its groundbreaking Web3 innovation — tokenized ETFs, which are leveraged by the raving hype of an incoming spot Ethereum ETFs trading approval. While revolutionizing the Web3 space, ETFSwap (ETFS) is the sole prospectus-based provider of Ethereum-based ETF tokens, offering a complete database of institutionally listed exchange-traded funds (ETFs). Little wonder top analysts make this bold prediction about the native ETFS token as massive liquidity inflow into the Ethereum (ETH) ecosystem is set to trigger a major price push for the native ETFS token."
    }
]