[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQT0xYWW1tNGtCbUc2R05qaWxDbUtQLU40TFYyeUxlUWo5TVZqNV9GSnF4amltZHhJSFJwTDJ3dWhOMFBCQ2ZRdGJULXZfWjdSYkVMZTk5eWhHNjc4VnBnVUF3T2p4d3B5SmNlNWxTMm52MmVMUFJ6czZXOFNPWGZnN1JETFVEb0dZQ3RfMTJ5Rml1Z0JENXBGeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "1 Top Cryptocurrency to Buy Before It Soars 5,000%, According to Cathie Wood - The Motley Fool",
        "content": "The closely followed growth investor expects Ethereum to blast off.\n\nEarlier this year, Ark Invest's Cathie Wood stunned cryptocurrency investors by predicting that Bitcoin's (BTC -2.27%) price would reach $1.5 million by 2027. Wood believes the recent approvals of Bitcoin's first spot exchange-traded funds (ETFs), more institutional purchases, and the impending halving of Bitcoin (which will make it twice as hard to mine the cryptocurrency) will all drive a stampede of bulls to the world's largest cryptocurrency.\n\nBut Wood made an even more bullish prediction for Ethereum (ETH -0.40%), which currently trades at about $3,200. In Ark Invest's \"Big Ideas\" presentation early last year, Wood said Ethereum's market cap could exceed $20 trillion -- which would require a market price of more than $166,000 per token -- by 2032. Could Etherium's price actually soar by over 5,000% to hit that target?\n\nHow is Ethereum different from Bitcoin?\n\nEthereum is the largest cryptocurrency on the open-source Ethereum Network, which differs from Bitcoin (BTC -2.27%) in two key ways. First, miners can only mine for Bitcoin tokens on the Bitcoin blockchain, but developers can create their own tokens, decentralized apps (dApps), and non-fungible tokens (NFTs) on the Ethereum Network. That flexibility makes Ethereum a core pillar of the Web3 movement, which aims to disrupt centralized app platforms like Apple's App Store and Alphabet's Google Play with decentralized applications and payment methods.\n\nSecond, Ethereum requires much less power to mine than Bitcoin. The Ethereum Network previously used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it in September 2022, it transitioned to the more energy-efficient proof of stake (PoS) method. That transition, dubbed The Merge, reduced the network's total mining energy consumption by 99.95%. Ethereum bulls believe that upgrade will make it easier to expand the Ethereum Network and support more Web3 projects.\n\nWhat are Ethereum's main catalysts?\n\nEthereum is now the world's second-largest cryptocurrency after Bitcoin. It's also one of eight cryptocurrencies -- which include Bitcoin and six stablecoins from PayPal (PYPL -2.75%) and Gemini (GUSD) -- on the New York State Department of Financial Services' \"green list\" of pre-approved cryptocurrencies. That relative stability suggests the U.S. Securities and Exchange Commission (SEC) might eventually approve spot Ethereum ETFs.\n\nHowever, the SEC recently reiterated its view that Bitcoin was the only cryptocurrency that could be classified as a commodity instead of a security since it still uses the PoW method, which is comparable to physically mining precious metals. The SEC said the PoS method, while more environmentally friendly, makes the cryptos that use it more similar to derivatives contracts -- so Ethereum is more similar to a security than it is to a commodity.\n\nThe SEC also recently requested more information from the Ethereum Foundation, and it remains committed to reclassifying Ethereum and other Ethereum tokens as securities. That position implies the SEC probably won't approve any spot ETFs for Ethereum -- since commodities are more commonly valued by their spot prices -- in the foreseeable future.\n\nBut despite that, Ethereum's periodic burning of its tokens could stabilize its price in the near term. The upcoming upgrades for the Ethereum Network could also make it even easier to facilitate financial transactions and develop more decentralized tokens and apps. More companies could also begin accepting ether, the coin that powers the Ethereum blockchain, as a payment option, and institutional investors could accumulate more of the crypto -- even if it's not as easily accessible as Bitcoin through spot ETFs.\n\nShould you believe Wood's bullish prediction?\n\nInvestors should take Wood's $166,000 price target with a grain of salt. First, the famed growth investor has made plenty of wrong calls. Her firm's flagship Ark Innovation ETF (ARKK 1.29%) has actually declined by 4% over the past five years as the S&P 500 rallied 76%. Ark also offers its own Ethereum futures ETF and is trying to get a spot Ethereum ETF approved, so Wood's opinion is arguably more subjective than objective.\n\nThat said, Wood adamantly believes the expansion of Ethereum's developer base and its potential to \"displace many traditional financial services\" and \"take share from existing financial intermediaries\" will drive its price toward her sky-high target of $166,000. I personally think Ethereum could come up far short of that lofty price in 2032 -- but it could certainly stabilize and head higher over the next few years if the Ethereum Foundation upgrades its network and keeps up with Bitcoin."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9ud1h2UWIyZlFWcER1ZndyMWZvTC0xQWx4WXptYW5abGRVdE9IMUwxc3QxdUVzRWduUzdfSHl6U0Mxd0hZN0pydlpLNzcyTzNjRllTc3h2ZFRSLURmOEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "No, ETH isn’t suddenly a security now - Blockworks",
        "content": "The Securities and Exchange Commission is investigating whether the Ethereum Foundation’s sale of ETH since the September 2022 “Merge” constitutes an unregistered securities offering in violation of US law, according to Fortune.\n\nIf the reports are true, then this investigation — just ahead of the SEC’s May deadline for a decision on an Ethereum spot ETF (more on that later) — raises the question: Did Ethereum’s switch to proof-of-stake transform it into a security?\n\nThe short answer is “no.”\n\nThe slightly longer answer is “still probably no.”\n\nETH tokens are not, in and of themselves, “securities” in the way that stocks or bonds are. They do not confer legal ownership of any business entity or contractual rights to any kind of payments — they are just code in a decentralized database.\n\nWhen we talk about ETH “being a security,” we are instead actually asking whether the offer and sale of ETH tokens (in a particular context, between a particular buyer and seller) constitutes an “investment contract” under the dreaded Howey test. Under the Howey test, the offer and sale of an asset like ETH constitutes an investment contract if (1) someone invested money, (2) in a “common enterprise,” (3) in the expectation of profit and (4) where that expectation is based on the “essential managerial efforts of particular others.”\n\nThe four Howey “prongs” have already been discussed and debated to death in the crypto space, so I’ll avoid beating a dead horse here. But if you look closely at the language from Howey, I think two things quickly become apparent about the sale of ETH tokens over time:\n\nFirst, the sale of pre-mined ETH tokens to investors in Ethereum’s 2014 ICO sure looks a lot like an “investment contract.” ICO participants invested money (BTC) in order to receive their allocation of ETH (Howey prong #1). That BTC was pooled to fund a common effort led by Vitalik and the Ethereum Foundation to develop the Ethereum blockchain and produce the ETH tokens (Howey prong #2). Given that the Ethereum blockchain “pre-launch” at the time of the ICO, the only plausible motivation to take part in the ICO was to make money on the price appreciation of ETH (Howey prong #3). And, at the time of the ICO, if Ethereum was going to succeed as a protocol and ETH was going to succeed as an asset, Vitalik and his developers were going to have to roll up their sleeves and put in some good old “managerial efforts” to make the tokens worth anything (Howey prong #4).\n\nHad the SEC brought suit around the time of the Ethereum ICO, they would have almost certainly won in court, and that may well have been the end of ETH.\n\nHowever, the SEC didn’t bring suit, and the statute of limitations for such a claim (typically five years) would have run out in 2019. And importantly, the Ethereum ecosystem has evolved in ways since its ICO that make current sales of ETH tokens look less like an investment contract than they once did.\n\nFor one thing, the proliferation of applications (think DeFi and NFTs) utilizing ETH for “gas” provides a “consumptive utility” for ETH tokens that challenges the notion that current-day purchases of ETH are solely, or even mainly, based on profit expectation.\n\nEven more important, however, is the so-called “Hinman speech” delivered in 2018 by Bill Hinman, then the director of corporation finance at the SEC, where he proposed that a digital asset’s classification under Howey could evolve over time.\n\nAccording to Hinman’s logic — to the extent that Ethereum’s success no longer hinges on the efforts of a particular entity, like Vitalik or the Ethereum Foundation — the sale of ETH tokens would no longer fulfill the requirement of the final Howey prong that there be “particular others” upon whose efforts a buyer would rely for their profits.\n\nRead more from our opinion section: Staking or not, ETH is no security\n\nTherefore, regardless of the legally dubious nature of the ICO, the Ethereum network (at least from 2018 onwards) has become “sufficiently decentralized.” This means that its native token constitutes a digital commodity like bitcoin, rather than an investment contract, subject to SEC jurisdiction.\n\nSince the Hinman speech, the securities law status of ETH has been at a bit of a stalemate. The SEC has never explicitly endorsed the notion that ETH (even pre-merge) is a digital commodity — which they readily concede with regard to bitcoin. And Gary Gensler regularly ties himself in knots before Congress trying to evade questions about his view on ETH’s current legal status.\n\nBut the fact remains that (at least until now) the SEC has never brought an action specifically alleging that primary or secondary sales of ETH constitute investment contracts under Howey (like they did with over a dozen other tokens in the Coinbase, Binance and Kraken lawsuits). The SEC even went as far as to approve the listing of ETFs based on ETH futures contracts that trade on the CME, which would be hard to understand if the Commission felt that ETH tokens traded as unregistered securities.\n\nBut what about Ethereum’s migration to proof-of-stake? Does the fact that ETH tokens can be staked for “yield” change the legal situation and turn either (A) current-day sales of ETH, or (B) the act of staking ETH into securities offerings under Howey?\n\nIn my opinion (and I spend an unhealthy amount of time thinking about crypto securities law), no.\n\nWith regard to present-day sales of ETH tokens — whether directly from the Ethereum Foundation or on the secondary market — I don’t think ETH’s staking functionality makes much of a difference under Howey. That is, the ability to stake does not make ETH tokens any less useful for individuals who might buy them for their consumptive utility (i.e. gas fees).\n\nAnd while the Ethereum Foundation does indeed still hold a large supply of ETH tokens, there is no reason to think that the introduction of staking makes the foundation’s “managerial efforts” “essential” to the financial success of ETH in some way that was not the case at the time of the 2018 Hinman speech.\n\nThe question of whether the act of staking ETH in order to receive “yield” in the form of staking rewards constitutes an investment contract under Howey is more nuanced — but properly understood, the answer should still be no.\n\nRead more from our opinion section: Ether is the Schrödinger’s cat of crypto\n\nWhen you run a validator node and stake 32 ETH tokens in exchange for rewards, what you are actually doing is providing a service to the Ethereum network and getting paid for that service. You only get the reward if you honestly validate blocks, and you stand to lose your stake to “slashing” if you attempt to validate dishonestly.\n\nThis is very different from the type of passive “yield” you might expect to receive from holding a bond or a dividend-paying stock or real estate asset (which rewards ownership and not activity). Unlike with these traditional financial instruments, you are not relying on “managerial efforts” of other people in order to profit when you stake ETH directly, but rather on your own skill and honestly as a validator.\n\nThis question becomes trickier, however, when we move from direct proof-of-stake validation to “staking services” such as those run by exchanges like Coinbase and collaborative staking protocols like Lido and Rocketpool.\n\nAt one end of the extreme, you could see an argument for how custodial staking services could look quite security-like under Howey (given how reliant depositors would be on the staking service provider’s efforts in order to earn yield).\n\nAt the other end of the spectrum, you could imagine a purely on-chain tool that allowed users to jointly stake their ETH in collective, automated, validator nodes with clearly defined behavior looking much more like direct staking than an investment contract.\n\nWhere the specific services by Coinbase, Lido and Rocketpool fall on this continuum is very much an open legal question — and one that in Coinbase’s case is being actively litigated in federal court in the Southern District of New York.\n\nBut none of this makes ETH itself, even when being used for staking purposes, an investment contract and therefore none of this seems to justify the SEC’s new investigation.\n\nWhy, then, might the SEC be pursuing this type of weak claim about Ethereum?\n\nObserving the success of the Bitcoin ETF — and the SEC’s dissatisfaction with its launch — suggests that the investigation into Ethereum might be a pretext to deny the upcoming spot ETH ETF application.\n\nMoreover, acknowledging Ethereum’s transition to a commodity despite its seemingly illegal ICO genesis could concede a legal strategy meant to apply to other token projects that the SEC believes aiming to circumvent securities classification (in other words, creating a loophole).\n\nThe SEC’s actions could be seen as a strategic move to maintain regulatory leverage over the crypto market, rather than a clear-cut determination of Ethereum’s status as a security.\n\nZack Shapiro is the Managing Partner at Rains and leads the law practice. Previously, he was co-founder and general counsel of BZR, a startup backed by Founders Fund, Greycroft, and Abstract Ventures. Zack is a graduate of Williams College and Yale Law School, and started his legal career clerking in the federal courts for the S.D.N.Y. and the 2nd Circuit, and at Davis Polk & Wardwell. Zack serves in various advisory roles in the crypto industry, including as a member of the Pleb Lab Accelerator advisory board, and as a Legal Fellow at the Bitcoin Policy Institute.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdG1DcU0xM3dBd1dlWm9SSTIwdVVUN1FEbi1PTE8wOGZCOW9JbEgtcnlfeGtyZ3BmUFI4S3JZX2NWU0xLNEJUQXczek85eFZsUEdpTU9ydldyUnF4V2hrWTFXLWVEYUpJd3l4d1k2d09TQ1pzNE9oWFd1UFp6VldRWlpZRm43amUxd25j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Slipped Over the Weekend - Yahoo Finance",
        "content": "In the cryptocurrency world, Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH) and Dogecoin (CRYPTO: DOGE) remain three of the most-watched tokens for good reason. Unfortunately, onlookers have seen mostly downside price action over the weekend. Since market close on Friday, these three top digital assets have sunk 4.2%, 2.5% and 11.2%, respectively, as of 12:45 p.m. ET on Monday.\n\nAn initial sharp decline was seen in all three tokens in early Saturday trading, in line with the reported escalation of the ongoing conflict between Iran and Israel. While each of these three tokens has made up some of this weekend's initial losses, it's clear that cryptocurrency is not immune from the geopolitical forces driving capital in and out of assets in times of uncertainty.\n\nThese moves are also significant because they come ahead of this week's expected Bitcoin halving, in which block rewards for miners will be cut in half. Typically, previous halvings have resulted in a booming price, which has bled into other crypto assets as well.\n\nBut given the anticipation around this rise, as well as capital inflows into spot Bitcoin ETFs, some investors appear to be betting that much of this rally might have already taken place, leading to caution heading into this key catalyst.\n\nLet's dive into some other key factors to consider when it comes to these three top tokens and their price action today.\n\nWhy all the negativity in the large-cap crypto space?\n\nBitcoin's move is perhaps most important to watch, as the largest cryptocurrency in the world heads into its latest halving, expected to take place on or about April 20. We'll have to see how the network responds, and how investors value the network as its inflation rate is halved yet again.\n\nThe fact that Bitcoin did not rise on increased Iran-Israel tensions suggests that investors are continuing to view it more as a risk asset and less as a hedge against uncertainty. We'll have to see if this narrative shifts, particularly if some response from Israel is seen in the coming days.\n\nEthereum's move, while negative, has been the strongest of the three over the weekend. This is likely due to news that the Securities and Exchange Commission (SEC) has approved applications from three Chinese companies to list Bitcoin and Ethereum spot ETFs in Hong Kong.\n\nNo official report from the SEC has been released, but this could signal that a spot Ethereum ETF approval in the U.S. is likely to be seen in short order. For now, overarching macro concerns appear to be stealing the spotlight from this otherwise positive catalyst. I would expect Ethereum to continue to outperform its fellow large-cap tokens in the coming weeks, as investors price this catalyst in.\n\nStory continues\n\nDogecoin's double-digit move lower over the weekend once again exemplifies this token's nature as a high-risk and high-leverage bet on momentum within the crypto space. A lack of any meaningful rhetoric from Elon Musk (and negative sentiment building around Tesla and its recent layoffs and full self-driving announcements) have investors seemingly looking for other options in the crypto realm right now.\n\nIs there upside on the horizon this week?\n\nCertainly, there are a number of bullish catalysts that could take these three top tokens higher this week. The Bitcoin halving and the reported approvals of spot Ethereum ETFs should be broadly bullish for the top two cryptos by market capitalization (and Dogecoin by default).\n\nThe thing is, uncertainty remains high right now, and investors remain on edge waiting to see if we're heading into yet another war. The feeling in financial markets is glum right now, meaning these catalysts could be overshadowed by this overarching sentiment, at least in the short term.\n\nIt will be interesting to see how these top tokens perform next weekend, as additional news arises around the two aforementioned key catalysts every crypto investor is watching right now.\n\nShould you invest $1,000 in Bitcoin right now?\n\nBefore you buy stock in Bitcoin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of April 15, 2024\n\nChris MacDonald has positions in Ethereum. The Motley Fool has positions in and recommends Bitcoin, Ethereum, and Tesla. The Motley Fool has a disclosure policy.\n\nWhy Bitcoin, Ethereum, and Dogecoin Slipped Over the Weekend was originally published by The Motley Fool"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBHREdHb0tKUGoyVmI5LUNkWS1UUlRjZGV5SU1ldno2ZWVSdnU4LTRfRmtOSWJtdjdraFQwM1g3RzJIXzM4VGtqOEd3UVRXZmJaUW5WMUJzTXdBZUtUX0ttVzhmVUxrZXR4UllmUzNYcXFtNUVfWERYONIBfkFVX3lxTFA1Vkh5SXZKZlNkU1YzR1dEcHlySmhpX0FUMk9NTnpaY19xbDA1Qnd0NGw2ZkFLb05nUG1HZTlGZmlNQjlfTzZydkw3bEF5SzRweVJVckwyeTdPZjlhSm9PUTFUTk5ReDFOZ2FuTFdjbWNKWmZRb1E1TGtuOHpTUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Whales Buying Ethereum Like Crazy Amid ETH Price Drop - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn the midst of heightened global tensions, the cryptocurrency market witnessed a significant downturn, with the TOTAL index plummeting by a staggering 17% over the weekend, marking a loss of nearly $430 billion in market capitalization. While this turbulence affected all digital assets, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, took a notable hit, experiencing an 18.43% decline, reaching a low of $2,852 per Ethereum.\n\nAdvertisement\n\nHowever, amid the market chaos, a fascinating trend emerged – prominent players in the crypto sphere, often referred to as \"whales,\" showed unwavering confidence in Ethereum's potential. Notably, large addresses were observed accumulating substantial amounts of ETH during the price drop.\n\nETH to USD by CoinMarketCap\n\nWhale activities\n\nOne such whale, identified as \"0xE34,\" seized the opportunity to accumulate 1,000 ETH, worth approximately $3.15 million, from Binance at the market's lowest point. This particular address went on to accumulate an impressive 8,300 ETH, valued at around $25.12 million.\n\nAdvertisement\n\nFurthermore, another significant player, a wallet associated with Matrixport, made a decisive move by withdrawing 16,300 ETH, amounting to a staggering $51.1 million, from Binance amid the market turmoil. This wallet has been consistently withdrawing ETH from exchanges since March 29, accumulating a total of 67,286 ETH, valued at approximately $228.33 million, at an average price of $3,393.\n\nMatrixport, a prominent player in the crypto financial services sector, has been actively involved in facilitating digital asset management and trading for institutional and retail investors globally.\n\nThese substantial purchases of Ethereum during a period of market instability highlight the confidence of several major players in the potential of the leading altcoin. Despite geopolitical uncertainties and market volatility, Ethereum continues to maintain bullish sentiment among key holders."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQm1QdTVmZV9oclY1cmJjYWwzTmwxak1NV1pqeGE2d1RIb3FCLV9KVm0wb3FxUDNjU0ktNWhDdHZpS3JaeUhGd1R6WlY0bFNhRE5EU3luVHNsSFJKTjRSSFZBNTMzUmZ4X3FHcm1BeTJKcjdZWXI4cFF0bE44Rzh4alR6dXF3b1BXVjA4VkE3QXZZM3doX0RFVTBjSVNCZFdoQzNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum falls to lowest level against Bitcoin in 3 years amid panic selling - CryptoSlate",
        "content": "Ethereum fell against Bitcoin to its lowest point in three years amid the carnage that followed Bitcoin’s fall from $70,000 over the weekend. The ETH-BTC chart reached as low as 0.0462 BTC on Saturday, April 13, down 24% from the year-to-date high of 0.085 BTC.\n\nEthereum’s all-time high against Bitcoin came in 2017 when it touched 0.16 BTC before closing the year around similar levels to now at 0.048 BTC. It has since recorded lows around 0.018 BTC in late 2019 before rising significantly throughout the 2020 – 2021 bull market.\n\nThe cycle peak of 0.088 BTC was met with a steady decline throughout 2023, 2022, and 2024. The 0.05 BTC level had been acting as a lower support level until it was breached this month. While the price remains within 7% of the support, it has been almost three years since we’ve seen these prices.\n\nThe decline has been gradual and steady since the start of 2023, with a few bullish breakouts shut down within a couple of months.\n\nWhile Ethereum remains below the 0.05 BTC support level, it has recovered almost 7% from its weekend lows, holding relatively steady amid Bitcoin’s continued struggles. Bitcoin fell from $70,000 to $61,700 over the weekend before recovering to $66,000. However, Bitcoin has retested $61,700 again and is trading around $62,000 as of press time. Ethereum initially followed Bitcoin down from $3,600 to $2,800 – it has since consolidated around the $3,000 mark, aiding it in its price war with Bitcoin.\n\nWhile the overall crypto market often follows Bitcoin, much of the altcoin market follows Ethereum. The ETH-BTC chart highly influences the delicate relationship between digital asset price movements, and it is one of the staples of the industry. Bitcoin dominance, another critical factor, reached a 3-year high this weekend, touching 57%, while Ethereum dominance dropped to just 15% from a recent high of 19%.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbzVWNUFqQXVVdDYxWENEZ1B0TC1JU3V5ZlBWbWpnbnVVY2RNQVNPemhFalFndzNNN1pYV2hQMUd6OU5rLWZsYUs1T3hvb2dJYjYyTEYyYmMxTkxDckphX1BYNXRoX3ZhSGR0aHVBdnpuMFdWMjVBdGduUjdwMk9jdUJuVXkwSVdZZ0hFX0k3YUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s EIP-3074 ‘upgrade’ could let wallet makers steal your money - Protos",
        "content": "With momentum carried over from the relatively smooth hard fork upgrades Shapella (Shanghai+Capella) and Dencun (Deneb+Cancun), Ethereum’s next hard fork was supposed to be a breeze. Nevertheless, several analysts are waving red flags about one of its code changes, EIP-3074.\n\nThrough EIP-3074, Pectra will introduce codes that permit users to delegate all of their Ethereum assets to so-called Invokers — externally owned accounts (EOA) that users must trust to not steal their money.\n\nFollowing the naming convention of ‘star + city portmanteau,’ the upcoming hard fork Pectra (Electra+Prague) will introduce two new operation codes: AUTH and AUTHCALL. Together, these codes make up Ethereum Improvement Proposal number 3074 (EIP-3074).\n\nThe two codes are easy to understand. AUTH delegates power to an Invoker to conduct transactions while AUTHCALL calls that prior authorization to conduct subsequent transactions using that authorization.\n\nIncredibly — and for the first time in Ethereum’s history — these two codes allow a third-party entity to send or transact Ethereum assets, including NFTs and ERC-20 tokens like USDC, inside your wallet forever. Unless developers modify the EIP before Ethereum hard forks later this year, the delegated powers remain with the Invoker permanently.\n\nRead more: Ethereum Foundation ditches ‘warrant canary’\n\nEIP-3074 gives wallet makers even more power\n\nAlthough further details of the AUTH and AUTHCALL codes are quite technical, a final item of general importance to most crypto participants is EIP-3074’s entrusting of unprecedented powers to wallet makers.\n\nBecause Ethereum developers realize the expansive and permanent power of AUTH instructions to the Ethereum Virtual Machine (EVM), they have decided to limit the EOAs to which users may delegate their assets. Specifically, they have proposed limiting EOAs to a whitelist maintained by pre-approved wallet providers like MetaMask.\n\nThe solution to this blockchain problem? Trusted third-parties.\n\nEIP-3074: Trust us, bro.\n\nChainArgos CEO Jonathan Reiter explained Invokers’ newfound powers in EIP-3074 even more explicitly, saying, “I delegate authority over my account to an Invoker — something that can now call code over my assets — and that thing now has the ability to do stuff with my assets. And there’s no way to revoke that delegation… The problem here is, because you can’t revoke it, if I delegate to a contract — even if I think that contract is okay today — if it’s upgradeable, they can steal my tokens in the future.”\n\nSecurity researchers and auditors have raised similar concerns. Indeed, it’s not enough for the user to simply ensure that they delegate only to presently trustworthy EOAs. If those EOAs are upgradeable smart contracts, the owner of those EOAs’ private keys could swap honest code for malicious code in the future.\n\nWorse, even if an EOA is immutable, if that EOA interacts with additional smart contracts and those third-party smart contracts are upgradeable, EIP-3074 could expose users’ assets to theft via malicious, third-party code upgrades in the future.\n\nRead more: Blast L2 hack prompts debate over centralization of Ethereum rollups\n\nWhy are we further empowering the most powerful?\n\nGiven all of these risks, what exactly is the point of EIP-3074 in the first place? Mostly, in the opinion of co-author Matt Garnett, the code will save users time and money — assuming Invokers stay honest. Consider a first-timer’s experience using Uniswap. First they must manually sign to authorize Uniswap. Then they need to pay to activate ETH on Uniswap before signing up and paying gas to activate USDC. Then they sign and pay gas to swap ETH for USDC and if more assets are involved, each one must also be activated with a separate signature and gas fee.\n\nIn the post-Pectra hard fork world, many of these signatures and gas payments could consolidate. For the user, they would only sign once to AUTH an Invoker with permission to perpetually trade their ETH or USDC on their behalf — without subsequent signatures.\n\nIn summary, EIP-3074 adds more trust and power with centralized and already quite powerful corporations like MetaMask by Consensys. Unless developers rethink this software change, the upgrade will entice users to entrust perpetual authority with third-party Invokers. These entities may now control users’ wallets and might, by way of their own or third-party smart contract upgrades, change the rules of the game in the future to simply steal users’ money.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE5ILTNIakF4RFFkNEVUYnZnMnI4YVdLX3FOdjNYUHQzN2hvalVuZVVGdTBESktjZ2FWazBCV3o2dUZCU0lSZC1zZ1FQejJRWTdiT3pidmZ6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum: will SOL's growth threaten ETH dominance? - OKX",
        "content": "With teams debuting their shiny new crypto projects every other week, navigating the world of crypto can be overwhelming for newcomers to the space. As you start to build a long-term, high-conviction trading strategy, it's likely you'll be researching prolific projects at the forefront of blockchain technology.\n\nOf today's crypto market leaders, two similar technologies that deserve exploring are major Layer 1 players Solana and Ethereum. As both Solana and Ethereum represent established Layer 1 blockchains backed by passionate communities and vibrant ecosystems, it can be difficult to separate the two given their strengths and unique selling points.\n\nEager for clarity? This guide aims to provide an objective comparison of Solana vs Ethereum as we demystify their technical attributes and explore what differentiates them. From exploring how each Layer 1 blockchain fares against the blockchain trilemma to understanding their future developments, here's everything you need to know when comparing Solana and Ethereum.\n\nWhat is Ethereum?\n\nLaunched in 2015, Ethereum is the first blockchain platform to popularize smart contracts and self-executing programs that power decentralized applications (DApps). The leap forward with autonomous smart contracts sparked a wave of development in the decentralized space and established Ethereum as a DeFi pioneer, where users can borrow, lend, and trade crypto without relying on traditional financial institutions. Beyond DeFi, Ethereum's robust ecosystem encourages fresh innovation across various sectors, ranging from NFTs and GameFi to real-world asset (RWA) marketplaces and prediction markets. Overall, Ethereum's established developer community, strong security measures, and ever-evolving feature set solidify its position as a leading force in the blockchain world.\n\nWhat is Solana?\n\nA next-generation blockchain that improves upon the innovations of its predecessors, Solana debuted in 2017 amid scalability bottlenecks and rose to prominence because of its Proof of History (PoH) function. By timestamping transactions in a decentralized manner, Solana nodes can organize transactions more efficiently, leading to rapid confirmation times and affordable gas fees. This makes Solana a haven for fast-paced DApps that demand high transaction throughput. Beyond speed and affordability, Solana boasts a vibrant developer community drawn to its user-friendly programming languages and its potential for on-chain scaling solutions. This dev-first focus has fueled the creation of innovative projects within the Solana ecosystem, including play-to-earn games with immersive experiences and serialized NFT projects that allow ongoing content updates.\n\nHow Ethereum and Solana fare against the blockchain trilemma\n\nBefore diving into our Solana vs Ethereum comparison, it's important to first understand the concept of the blockchain trilemma. In short, the blockchain trilemma is a concept coined by Ethereum co-founder Vitalik Buterin that suggests developers for decentralized blockchains will encounter three main factors: security, decentralization, and scalability.\n\nDespite their best efforts, developers will be forced to sacrifice one factor as a trade-off to meet the needs of the other two factors. One example of this would be Bitcoin. Known for its high level of security and decentralization, Bitcoin is often seen as the gold standard among decentralized networks. However, Bitcoin struggles with scalability, meaning it can only process a limited number of transactions per second. This is a major drawback for widespread Bitcoin mainstream adoption, as it can lead to slow transaction times and high fees.\n\nUltimately, understanding the blockchain trilemma is essential for evaluating different blockchain projects. Each project makes its own trade-offs between the three core principles mentioned above, and the ideal choice for you'll depend on your specific needs and priorities. Now that we have a clear understanding of the blockchain trilemma, let's dive into the security, decentralization, and scalability of Ethereum and Solana to see how these popular blockchains fare against such metrics.\n\nSecurity\n\nBoth Ethereum and Solana prioritize security, employing robust mechanisms to safeguard user funds and network integrity. In both cases, validators stake their own tokens (ETH for Ethereum, SOL for Solana) to verify transactions. The potential loss of their staked tokens incentivizes validators to act honestly, as malicious behavior could result in penalties and loss of their stake. Ethereum's long history and battle-tested security measures inspire confidence in many users, but it's important to remember that security for any blockchain is an ongoing process, and vulnerabilities can still emerge. However, their approaches differ in their nuance of Proof of Stake (PoS) implementation. Ethereum's current PoS implementation is still under development compared to some established PoS blockchains, while Solana's PoS applies PoH alongside it.\n\nEthereum's security\n\nEthereum's current security relies on PoS, a consensus mechanism where validators stake their own ETH tokens to verify transactions. The potential loss of their staked tokens incentivizes validators to act honestly, as malicious behavior could result in penalties and loss of their stake. While the PoS implementation is a recent development, Ethereum's history with its previous Proof of Work (PoW) system and the ongoing security audits and improvements during its transition to PoS inspire confidence in its ability to protect user funds and network integrity. This established track record is a major advantage for users who prioritize a security model that's been thoroughly tested and refined over time.\n\nSolana's security\n\nSolana leverages a unique combination of PoH and delegated PoS (DPos) for security. PoH creates a verifiable record of time between transactions, preventing issues like replay attacks due to streamlined transaction ordering. Delegated PoS requires validators to stake not only SOL tokens but also Solana hardware, raising the potential cost of malicious activity. While Solana's security architecture is innovative and shows promise, its relative novelty compared to Ethereum's PoS system might lead some users to favor Ethereum's established track record.\n\nOverall, both Ethereum and Solana prioritize security with strong mechanisms to protect user funds. Ethereum's established track record with PoS inspires confidence in many users. However, Solana's innovative approach with PoH and bonded PoS offers additional security features and a potentially higher barrier to malicious actors. While Ethereum's PoS is well-understood, Solana's complex architecture with PoH may be less battle-tested, introducing the possibility of unforeseen vulnerabilities. Ultimately, the choice between these two platforms from a security standpoint depends on your individual risk tolerance and how you weigh a proven track record against advanced and disruptive features.\n\nDecentralization\n\nDecentralization is a core principle of blockchain technology. It refers to the distribution of power and control across a network, eliminating the need for a central authority. Both Ethereum and Solana aim for decentralization by applying the PoS consensus mechanisms. With PoS, validators who stake their own cryptocurrency tokens are responsible for verifying transactions. This economic incentive aligns validator interests with the health of the network, as malicious behavior could result in slashing and the loss of their stake. Additionally, both platforms aim to achieve a degree of resistance to censorship by distributing the validation process across a global network. This means no single entity can control or block transactions on the network.\n\nEthereum's decentralization\n\nThe Ethereum network is arguably one of the most decentralized in the world. With an estimated validator pool exceeding one million, Ethereum's validator base is constantly expanding, with plans to become even more distributed in the future. However, concerns remain about the potential influence of large staking pools that could hold a significant portion of the total staked ETH. As of writing, Lido dominates the staking landscape on Ethereum, controlling over 30% of staked ETH at one point. This concentration raises concerns about potential centralization, as Lido could potentially influence the network if it wanted to. Thankfully, the Ethereum team is actively working to mitigate this risk. The upcoming sharding upgrades as part of the Ethereum roadmap aim to further decentralize the network by increasing the number of validators required per shard. Overall, this will make it more difficult for any single entity to gain control, since the implemented upgrade will increase the number of validators required and lower the barrier to entry for individual stakers.\n\nSolana's decentralization\n\nAlthough Solana has been praised for its impressive throughput, its string of outages expose a potential vulnerability in this methodology. Solana adopts a different approach to decentralization and applies a DPoS system where validators are chosen based on factors like stake size and network performance. While this approach allows for faster transaction speeds, it also raises concerns about centralization as the validation power is concentrated among a smaller set of chosen validators.\n\nAdditionally, Solana's validator set is currently permissioned and employs a validator selection process with delegated PoS, meaning new validators need approval from the network to join. While this allows for faster transaction speeds, Solana's reliance on a specific set of validators for its PoH system raises questions about its true level of decentralization and reliability. This is especially true when compared to Ethereum's more geographically distributed validator network.\n\nThe perceived lack of reliability has also been underlined by Solana's network disruptions. To tackle this, Solana is working towards a permissionless validator set through its hotly anticipated validator client software, Firedancer. Firedancer implements Solana's version of PoS and aims to address some of the platform's current centralization concerns. By enabling anyone to run a validator node without prior approval from the network, Firedancer has the potential to significantly distribute validation power more evenly and greatly improve network decentralization in the long run.\n\nUltimately, the choice between Ethereum and Solana regarding decentralization depends on your priorities. If complete openness and permissionless participation are paramount, Ethereum might be the better choice despite its current scalability limitations. If faster transaction speeds are a priority, you might be willing to accept some centralization trade-offs with Solana, keeping in mind its ongoing efforts to become more decentralized in the future. However, if a technical issue or malicious attack disrupts the validator network, the entire Solana network can grind to a halt. This undermines the security and reliability of the platform, especially compared to more decentralized blockchains like Ethereum.\n\nScalability\n\nScalability refers to a blockchain's ability to handle a growing number of transactions without compromising processing speed or incurring high fees. This is a critical factor for the widespread adoption of blockchain technology, as expensive gas fees are often a deterring factor when it comes to regular usage and transactions. Scalability presents a contrast between Ethereum and Solana as each network has its own way of dealing with high transaction volume.\n\nEthereum's scalability\n\nAlthough it's established with a robust ecosystem, Ethereum has historically struggled with scalability due to its previous PoW consensus mechanism. This resulted in numerous scalability bottlenecks such as high transaction fees and slow processing times, which were major pain points for users looking to actively interact with Ethereum's ecosystem. In fact, it's this bottleneck that inspired many developers to strike out on their own and create their own scalability-focused Layer 1 blockchain, leading to the innovations in blockchain scalability that we see today.\n\nFortunately, the Ethereum Foundation has been hard at work upgrading the network with improved scalability in mind. From its PoS transition to numerous network upgrades like Dencun, the developments aim to significantly improve scalability by distributing the workload across multiple shards, potentially handling thousands of transactions per second. With the execution of its roadmap, we could see Ethereum reach a single block finality of 12 seconds. This is a fraction of its current 30-minute duration, and achieving this will dramatically improve the user experience and network efficiency.\n\nSolana's scalability\n\nMeanwhile, Solana is a high-performance blockchain that prioritizes scalability from its core design. Since its inception, Solana has had a laser-like focus on speed. Thanks to the network's introduction of innovations like PoH and tower byzantine fault tolerance (BFT), Solana is theoretically able to achieve a blistering throughput of up to 65,000 transactions per second. On top of this, Solana also boasts gas fees that are mere fractions of a penny, making it significantly cheaper to interact with the network compared to Ethereum's historically high gas fees.\n\nThe combination of blazing-fast transaction speeds and negligible fees puts Solana's scalability in a league of its own compared to Ethereum's current state, as Solana is becoming the platform of choice for a wide range of DApps, particularly those requiring high throughput and cost-effectiveness. While Solana has yet to achieve its theoretical maximum throughput, it's certainly on its way to hitting this thanks to progress made with Firedancer. With its ability to process 600,000 transactions per second in test environments, Firedancer could be influential in markedly improving Solana’s overall scalability.\n\nWhen considering scalability between Ethereum and Solana, both networks offer compelling options for developers and users seeking a scalable blockchain platform. While Ethereum focuses on a robust ecosystem and future scalability improvements with a strong emphasis on decentralization, Solana prioritizes raw speed and boasts impressive transaction processing capabilities at a fraction of the cost. Ultimately, the choice between these platforms depends on the specific needs of the project or user, with factors like transaction speed, cost, desired level of decentralization, and application type playing a key role in the decision-making process.\n\nSolana's potential threat to ETH dominance\n\nFor those unaware, ETH dominance refers to the ratio between the market cap of Ether to the total market cap of the entire cryptocurrency market. Like with Bitcoin dominance, ETH dominance is often used to track Ether's value relative to other big-name cryptocurrencies. This is used to signify how ETH fares against the competition.\n\nA chart showing ETH dominance (source: tradingview.com)\n\nA chart showing ETH dominance (Source: tradingview.com)\n\nReferencing the chart above, we can see that ETH dominance is currently on a downward trend. This is based on how a recent death cross was formed on the daily time frame as the 50-day moving average recently crossed under the 200-day moving average. Additionally, the relative strength index shows that ETH dominance is declining from its current value of 44.1. With these indicators in mind, we can conclude that ETH dominance could decrease in the near future, hinting that there might be a relative increase in the value of altcoins as traders rotate out of ETH into promising crypto projects and altcoins like SOL. This trend has also been a huge reason why crypto traders have been speculating that Solana might threaten ETH dominance over time as it offers a faster, more scalable alternative with significantly lower transaction fees. This speculation is further fueled by the ongoing developments of Solana's Firedancer validator client software, which aims to address concerns about decentralization and news of how Solana recently overtook Ethereum in terms of DEX trading volume.\n\nThe future of Solana vs Ethereum: can both Layer 1 powerhouses coexist?\n\nThe competition between two leading Layer 1 blockchains like Solana and Ethereum is fierce. While Ethereum boasts a robust and established ecosystem with a strong focus on decentralization, Solana offers blazing-fast transaction speeds ideal for high-throughput applications.\n\nAs both platforms continue to evolve, one important question emerges: can both Layer 1 powerhouses coexist in the future blockchain landscape? The answer might lie in specialization. Ethereum's upcoming sharding upgrades could address its scalability issues while maintaining its focus on security and decentralization. This would solidify Ethereum's strong positioning for complex financial applications and trading TradFi instruments like RWAs. Conversely, Solana's speed advantage could make it the go-to platform for applications requiring real-time transactions, such as DeFi markets with frequent trading or high-traffic GameFi titles.\n\nBeyond competition, we've seen a rise in cooperation between Solana and Ethereum. Thanks to the rise of decentralized interoperability bridging services like OKX Swap, both Layer 1 blockchains can seamlessly communicate with one another and enable asset transfers. We've even seen the emergence of shared developer tools and cross-chain projects fostering a more collaborative environment. Ultimately, the future might see a scenario where both Ethereum and Solana thrive, catering to different user needs and fostering innovation within the broader, interconnected blockchain space.\n\nFinal words on Solana vs Ethereum\n\nMany would agree that Solana may be the best option if speed, scalability, and low fees are important to you. This will likely be the case if you're interacting with high-frequency DeFi applications where every millisecond counts, or if you frequently trade Solana memecoins. However, if a robust and battle-tested ecosystem with a strong focus on decentralization is your priority, Ethereum might be the better fit. This could be ideal for DApps requiring greater security for valuable assets or projects seeking a more established user base and compatibility with existing Ethereum-based DApps.\n\nUltimately, the best approach might not be a \"which is better\" scenario. As the industry continues to develop, we might see increased interoperability between blockchains like Ethereum and Solana. This would allow users to leverage the strengths of each platform seamlessly. For instance, imagine seamlessly transferring assets between Ethereum and Solana for lower transaction fees while maintaining the security of the Ethereum network. The future of blockchain development is bright, with both Layer 1 blockchains like Ethereum and Solana leading the charge. By staying informed about their ongoing advancements, you'll be well-positioned to make informed choices as the blockchain landscape continues to evolve.\n\nKeen to trade either Solana or Ether? Check out our spot trading pairs for SOL and ETH to get started with your crypto trading journey today.\n\nFAQs about Solana vs Ethereum\n\nIs Solana faster than Ethereum?\n\nYes, Solana is significantly faster than Ethereum in its current state. Solana boasts theoretical transaction speeds exceeding 65,000 transactions per second, compared to Ethereum's current average of 15 to 45 transactions per second. This difference is due to Solana's unique architecture designed for scalability, while Ethereum is still undergoing upgrades to improve its speed.\n\nIs Solana cheaper than Ethereum?\n\nYes, Solana transactions typically incur significantly lower fees compared to Ethereum. Solana gas fees are a fraction of a penny, while Ethereum gas fees can fluctuate and sometimes reach high levels depending on network congestion.\n\nIs Solana more secure than Ethereum?\n\nWith its established and battle-tested network and a larger validator base that offers greater decentralization, Ethereum is generally considered more secure than Solana. This can also be seen in how often Solana faces network outages compared to Ethereum.\n\nWhy does Ethereum have higher TVL (total value locked) than Solana?\n\nTVL refers to the total value of cryptocurrency locked within DeFi protocols on a specific blockchain. Ethereum has a significantly higher TVL compared to Solana. This can be attributed to factors like Ethereum's first mover advantage that led to it having a more mature and established ecosystem. Specifically, Ethereum supports a wider range of DeFi applications and protocols, while the network effect could have caused the existing user base on Ethereum to attract further projects and users that reinforce its dominance in the DeFi space.\n\nCan Solana overtake Ethereum?\n\nThe future is, of course, uncertain. While Solana offers superior speed and lower fees as of writing, Ethereum is actively working on scalability improvements. Additionally, Ethereum's established ecosystem and user base are significant advantages. It's more likely that both platforms will coexist, with users choosing based on their specific needs. The rise of interoperability bridges could further enhance this coexistence by allowing users to leverage the strengths of each platform seamlessly."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9fR3ktcU9RTWNRd3h4azU1VXF4dVQxdkhNc3lRbEQteGg4dkFPQ2ZIUGdIOGRYLUFaU2xyUWtuSzk3RFdCdzJHLTlBVzctZzY0UVFQZWRwYWMyQy02NW1DT1JWN2ZjWDRFTGZYVFJGMW52UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "How to Stake Ethereum on Coinbase - Benzinga",
        "content": "Making More Out of Ethereum: A Simple Guide to Staking on Coinbase\n\nSHORT ANSWER: To stake Ethereum on Coinbase, deposit ETH into your account, navigate to the staking page, stake ETH and start earning rewards.\n\nWant to make more Ethereum without lots of complicated moves? Staking Ethereum on Coinbase is the answer. Since Bitcoin does not support staking, doing it with Ethereum is like helping out Ethereum and getting rewarded for it. This guide is for everyone, whether you're new to crypto or already know a bit. Here’s how to stake Ethereum on Coinbase step by step. By the end, you'll understand why staking is beneficial, how to do it easily and how it can boost your Ethereum stash.\n\nCoinbase ETH Staking Overview\n\nStaking Ethereum (ETH) is like being a guardian of the Ethereum network, and in return, you earn rewards. When you stake ETH on Coinbase, the most popular cryptocurrency exchange, it becomes staked ETH, and its price stays the same as regular ETH. Coinbase is a trustworthy platform for staking ETH. It makes it easy for anyone, even if you have a tiny bit of ETH, to start staking without needing a full Ethereum setup.\n\nWhy Should You Stake Ethereum?\n\nStaking is a way to participate in the Ethereum network's security and operation actively. By staking, you help verify transactions and create new blocks, which earns you ETH rewards. When you stake on Coinbase, ETH gets locked into a smart contract, making it secure from certain risks like price changes. But be cautious because not following the rules might mean losing ETH as a penalty.\n\nIs Staking ETH with Coinbase a Good Idea?\n\nFor many people, yes! It can be safe and simple way to earn rewards. Plus, you can stake any amount of ETH you have, and you don't need to worry about setting up complicated software. Although Coinbase doesn't charge a fee to stake or unstake, it charges a commission based on the rewards you receive from the network. You could face network fees to process transactions on the Ethereum network.\n\nThe rewards you earn from staking might be taxable, so it's a good idea to talk to a tax expert if you're unsure. Staking ETH on Coinbase can be a smart move for many users. You get to earn rewards and support the Ethereum network, and it's hassle-free.\n\nHow to Stake Ethereum on Coinbase\n\nHere's a step-by-step guide on how to stake Ethereum on Coinbase.\n\nCreate a Coinbase Account\n\nBegin by creating an account on Coinbase if you haven't already. You can do this by visiting the website or downloading the Coinbase app. Follow the prompts to set up your account and complete the necessary verification steps.\n\nDeposit ETH into Your Coinbase Account\n\nTo start staking, you need Ethereum (ETH) in your Coinbase account. You can transfer ETH from another wallet or buy ETH directly on Coinbase.\n\nNavigate to the Staking Page\n\nOnce you have ETH in your Coinbase account, go to the staking page. Look for the option to stake ETH. It's usually easy to find in the navigation menu.\n\nStake ETH\n\nClick on the Stake button and follow the instructions to stake ETH. You can stake any amount of ETH up to the Coinbase maximum limit of 10,000 ETH.\n\nWait for Confirmation\n\nAfter you've initiated the staking process, Coinbase will review your request and confirm the transaction.\n\nMonitor Your Staking Rewards\n\nOnce ETH is staked, you'll start earning staking rewards. These rewards will be automatically reinvested into your staking balance. You can keep track of your rewards on the Coinbase staking page.\n\nUnstake ETH\n\nIf you want to unstake ETH, you can do so at any time. There might be a waiting period before ETH is fully unstaked and available for withdrawal.\n\nStaking Ethereum on Coinbase is a safe and convenient way to earn passive income through rewards. There is no minimum limit to stake ETH on Coinbase. Staking rewards are taxable income in the U.S.\n\nPros and Cons of Staking Ethereum on Coinbase\n\nLet's take a closer look at the pros and cons of staking Ethereum on Coinbase.\n\nBenefits of Staking ETH\n\nStaking Ethereum on Coinbase comes with several benefits.\n\nEarn passive income: Unlike trading on bots, by staking ETH on Coinbase, you're putting Ethereum to work for you. Through the rewards provided by the Ethereum protocol, you can earn passive income. This feature is appealing for investors with a long-term outlook, as it offers a way to try to grow their ETH holdings passively.\n\nUnlike trading on bots, by staking ETH on Coinbase, you're putting Ethereum to work for you. Through the rewards provided by the Ethereum protocol, you can earn passive income. This feature is appealing for investors with a long-term outlook, as it offers a way to try to grow their ETH holdings passively. Support network security: When you stake ETH, you play a role in the security and integrity of the Ethereum network. Your staked funds help validate transactions and create new blocks, contributing to the overall strength of the network. This practice helps ensure that Ethereum remains a robust and reliable platform for all users.\n\nWhen you stake ETH, you play a role in the security and integrity of the Ethereum network. Your staked funds help validate transactions and create new blocks, contributing to the overall strength of the network. This practice helps ensure that Ethereum remains a robust and reliable platform for all users. Environmentally friendly: Unlike Bitcoin mining, which consumes large amounts of electrical energy, Ethereum's proof-of-stake model is more environmentally friendly. Staking requires only a fraction of the energy used in traditional mining, making it a greener option for investors who are concerned about the environmental impact of cryptocurrency.\n\nUnlike Bitcoin mining, which consumes large amounts of electrical energy, Ethereum's proof-of-stake model is more environmentally friendly. Staking requires only a fraction of the energy used in traditional mining, making it a greener option for investors who are concerned about the environmental impact of cryptocurrency. Easy to use: Coinbase is known for its user-friendly interface, and staking on the platform is no exception. The process is simple, making it accessible to a wide range of investors regardless of their technical expertise.\n\nCoinbase is known for its user-friendly interface, and staking on the platform is no exception. The process is simple, making it accessible to a wide range of investors regardless of their technical expertise. Flexibility: One of the advantages of staking on Coinbase is the flexibility it offers. You can stake any amount of ETH, even as little as 0.01 ETH, without needing to own the full 32 ETH required for solo staking.\n\nOne of the advantages of staking on Coinbase is the flexibility it offers. You can stake any amount of ETH, even as little as 0.01 ETH, without needing to own the full 32 ETH required for solo staking. Automatic restaking: Staking rewards on Coinbase are automatically restaked, allowing you to try to compound your earnings over time without manual intervention. Your staked ETH continues to work for you, earning rewards and helping to secure the network, without requiring additional effort on your part.\n\nRisks of Staking ETH\n\nHere are the cons and risks of staking Ethereum on Coinbase.\n\nCentralized exchange risks: Staking on a centralized exchange like Coinbase means trusting a third party with your assets, which could expose you to risks such as security breaches or regulatory issues.\n\nStaking on a centralized exchange like Coinbase means trusting a third party with your assets, which could expose you to risks such as security breaches or regulatory issues. High commissions: Coinbase charges a 25% or higher commission on rewards earned from staking, which can significantly reduce your earnings.\n\nCoinbase charges a 25% or higher commission on rewards earned from staking, which can significantly reduce your earnings. Limited control: Staking on Coinbase means relinquishing some control over your staked assets, as they are locked in a smart contract and subject to Coinbase's terms and conditions.\n\nStaking on Coinbase means relinquishing some control over your staked assets, as they are locked in a smart contract and subject to Coinbase's terms and conditions. No immediate liquidity: Staking ETH involves locking it up for a period, which reduces your liquidity and makes it challenging to access your funds quickly if needed.\n\nStaking ETH involves locking it up for a period, which reduces your liquidity and makes it challenging to access your funds quickly if needed. Slashing events: Although rare, slashing events can occur in staking. If a validator fails to fulfill their role, they can be penalized, resulting in a loss of staked ETH. Delegated ETH can also be slashed if the validator fails.\n\nAlthough rare, slashing events can occur in staking. If a validator fails to fulfill their role, they can be penalized, resulting in a loss of staked ETH. Delegated ETH can also be slashed if the validator fails. Protocol changes: Staking protocols and network conditions can change over time, affecting rewards. Past rewards don't guarantee future payouts.\n\nStaking protocols and network conditions can change over time, affecting rewards. Past rewards don't guarantee future payouts. Lack of control over validators: When staking on Coinbase, you have no say in which validator it chooses to work with. While it collaborates with reputable validators, events like slashing can occur because of factors beyond Coinbase’s control.\n\nWhen staking on Coinbase, you have no say in which validator it chooses to work with. While it collaborates with reputable validators, events like slashing can occur because of factors beyond Coinbase’s control. Gas fees: Staking and unstaking transactions on the Ethereum network require gas fees, which can vary. These fees can impact profitability, especially for smaller stakers.\n\nHow Much Ethereum Do You Need to Stake on Coinbase?\n\nUnlike solo staking, where you usually need the full 32 ETH, Coinbase allows users to stake any amount of ETH. You can stake as little as 0.01 ETH on Coinbase. This flexibility makes staking accessible to everyone, regardless of the amount of Ethereum they hold.\n\nHow Much Can You Earn Staking ETH on Coinbase?\n\nWhen staking Ethereum (ETH) on Coinbase in mid-April 2024, the estimated reward rate is approximately 2.61% if you stake for 365 days. This rate isn't fixed and can vary over time. You can check the latest applicable rates directly within your Coinbase account. Commission charges reduce your actual returns.\n\nRewards are distributed every four to five days after the activation period. However, the rewards may not settle in your account immediately because of network conditions. While the estimated reward rate gives you an idea of what you can earn, the actual rewards may take some time to reflect in your account.\n\nHow Long Does It Take to Unstake ETH on Coinbase?\n\nTo unstake ETH on Coinbase, you follow a specific process. Once you initiate the unstaking action, your assets will enter an unbonding period. After this period ends, you can withdraw the asset. However, there's an additional step: unbonded assets must be included in a batch before withdrawal. You'll need to wait until the unbonding transaction is part of one of Coinbase's batch times.\n\nFor U.S. clients, batch times are Monday-Friday at 12:00 a.m., 4:00 a.m., 8:00 a.m., 12:00 p.m., 4:00 p.m. and 8:00 p.m. PST; and Saturday-Sunday at 2:00 p.m. PST. Non-U.S. clients have different batch times: Monday-Friday at 8:00 a.m., 12:00 p.m., 4:00 p.m. GMT; and Saturday-Sunday at 4:00 p.m. GMT.\n\nUnstaking ETH on Coinbase involves an unbonding period followed by waiting for batch withdrawal times. Be aware of these timelines when planning to unstake ETH.\n\nCan I Sell Staked Ethereum on Coinbase?\n\nYou cannot directly sell staked Ethereum on Coinbase. You would go through the process of unstaking it first, which typically takes one to four days depending on network conditions. Once the unstaking transaction is processed, you'll be able to claim your funds and sell them.\n\nUnstaking and claiming are separate blockchain transactions, and both require gas fees, resulting in costs associated with both processes.\n\nIf you have staked Ethereum on Coinbase and want to move it, you have a couple of options. You can unstake it and sell it or you can wrap it into cbETH and trade it as a liquid staking token. However, cbETH trades at a discount, so if you're looking to sell at the full value of your staked Ethereum, unstaking and selling it may be the better option.\n\nCoinbase Stakers Earn Rewards\n\nStaking Ethereum on Coinbase offers a straightforward and accessible way for users to actively participate in the Ethereum network and earn rewards. With Coinbase's user-friendly platform, you can stake any amount of ETH, even as little as 0.01 ETH, without the need for a full Ethereum node. While there are potential risks and considerations to keep in mind, such as centralized exchange risks, commission charges and gas fees, the benefits of earning passive income, supporting network security and contributing to a more environmentally friendly blockchain ecosystem can make staking on Coinbase an attractive option for many investors."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOb2s1YlNNQUp3UjRJMWpzQlJiTklGd3NBc0VRalZBakxENkRXVGFJYm12Y2R2MzdzajFzbndNbTRzczJndGNtUGlMY2hDXzJmWWgxMXl5QVljc3NsTzZ4M3d5MHNCbFlHQkVfSU5ScVUwVGZCSWRkbHh6d0dRMDMyck9kMndzUEhCVDdXN0RXSWVIMlk2R2pJclNVMFJlYTFxTllxaEEtMnRhRVI1Tk9hQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Officially Approved – ETH Price Predicted to Hit $4k Next ? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOZjRtN3pJU0FvTEdSM3ZCZW5TYVFXUnJDQm1IN0NkcUFVMUtQSzd3RnNfUlBaSFpGSnY1Rk1NREVpMGVpTnJDVVpwSW1NUEpWaWtkamc0MDFpM0VqVEQ5anNGV0t3OGpnNWFzd19MRkE2eVJGZVF3MlJjLXN3TEdvSnFmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Approves Spot Bitcoin and Ethereum ETFs - Yahoo Finance",
        "content": "Hong Kong Approves Spot Bitcoin and Ethereum ETFs\n\nChina Asset Management, Bosera Capital, HashKey Capital Limited announced that the Hong Kong Securities and Futures Commission (SFC) has approved both spot Bitcoin (BTC) and Ethereum (ETH) exchange-traded funds (ETFs) applications.\n\nHashkey Capital was founded in 2015 by current CEO Dr Xiao Feng, and is a digital asset platforms and investment fund prominent in Asia. It has $1 billion in AUM and recently seeked to raise funds at a $1 billion plus valuation. Shenzhen-based Bosera Capital is one of the first fund management companies in China, and manages $200 billion in assets. Meanwhile, China Asset Management is a prominent asset management firm founded in 1998. It manages one of the largest equity ETF products in China, with a total of $266 billion in assets under management (AUM).\n\nBloomberg first reported about the imminent approval of the spot ETFs, with the listing details being finalized in time with Hong Kong Exchanges & Clearing (HKEX). The report stated that the products could be launched by the end of this month, marking a significant development in the region's cryptocurrency market.\n\nThe approval of these ETF products in Hong Kong is anticipated to be a major driver for the cryptocurrency market, positioning the city as a leading digital asset hub in Asia. While the United States approved spot Bitcoin ETFs in January, resulting in a record-breaking price surge that propelled Bitcoin to reach $73,000, it has not yet approved Ethereum ETFs. In contrast, Hong Kong approved both Bitcoin and Ethereum spot ETFs at the same time. Meanwhile, expectations for the approval of spot Ether ETF products in the U.S. remain subdued due to the lack of SEC engagement with the applicants. JPMorgan analysts placed the approval of Ether ETFs by the final deadline in May at 50%.\n\nFollowing the news of the approval, BTC surged 2.81% in the past 24 hours to trade at $66,526, up from the lows of $62,000. Meanwhile, ETH gained 4.88% and is currently trading at $3,246. The crypto markets had a brutal sell-off last week following escalating tensions in the Middle East, which propelled fears of a blown-out war."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1BUGs5SFpIamRoRWRzNHNjYVphRzNqaFNkcy1rMUtrMGpkMGpleHVGcm9TajBOeUw1NnN0eWREUFFzLXJhSUcwTlVod1pBX2tDbklScE84TnhvZThnTnFpS0s4UHhadUMtMVREMUk3UVIxeU1rUENmM1lFUdIBgAFBVV95cUxOVkpWNXEtWTZSVTBPWXFmUHpBcURJV2dJNkRMb0d6R3lzcG5xLWs5VnFqNU15ZHRzMUJpZkhKUkZhdWFrcmZRZW1RM1ZkbGUxUE80YzllTUhpUDd1d0VUbVBKY0o5T05TVVlWbkhwd2M2QWdmb2ZsU1p2OGE2RV8tcQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum vs. Bitcoin: Is 60% ETH Price Collapse on Horizon? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBenjamin Cowen, a crypto analyst and trader, has raised concerns about the potential significant price collapse of Ethereum (ETH).\n\nAdvertisement\n\nIn a recent analysis, Cowen hinted at the possibility of a 60% plunge in the price of ETH, citing the loss of crucial support levels for the ETH/BTC trading pair.\n\nThe ETH/BTC trading pair, which compares the value of Ethereum to that of Bitcoin, is widely regarded as an important indicator of market sentiment and relative strength between the two largest cryptocurrencies.\n\nAccording to Cowen's analysis, the recent loss of important support levels in the ETH/BTC pair could signal further downside for Ethereum's price in the near term.\n\nAccording to the crypto analyst, on the past two occasions, ETH/BTC broke major support, and the ETH/USD pair fell 60% from its previous local high in three to six months. He mentioned that ETH/BTC has just lost support, and the implications of this development are unknown presently.\n\nThe last 2 times that #ETH / #BTC broke support, #ETH / #USD dropped 60%+ from the prior local high over the next 3-6 months.\n\n\n\nAgain, #ETH / #BTC just broke support.\n\n\n\nNothing with investing is guaranteed, but please consider all outcomes. pic.twitter.com/RUMYEJwCaM — Benjamin Cowen (@intocryptoverse) April 16, 2024\n\nCowen's warning comes amid a period of heightened volatility and uncertainty on the cryptocurrency market, with Ethereum experiencing fluctuations in its price and trading volume.\n\nThe loss of support for the ETH/BTC pair adds to the uncertainty surrounding the Ethereum price as it fights to maintain the crucial $3,000 level.\n\nETH was down 3% in the last 24 hours to $3,055 at the time of writing. According to crypto analyst Ali, the next critical support zone for Ethereum is currently between $2,000 and $2,430, where around 9.37 million addresses hold nearly 53 million ETH.\n\nWhile the prediction of a 60% drop made by Cowen is stark, it is important to realize that predictions are not certainties. While historical trends and potential outcomes might be crucial to consider, past performance might not indicate future results.\n\nIn separate news, the Ethereum community is debating a change to the ETH monetary policy in response to proposals aimed at limiting the staking pool's rapid expansion. This discussion was triggered after two Ethereum researchers proposed slowing ETH issuance and thereby reducing staking incentives."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNVHU1S3NyanU4UWdKODl1R1E2aXZLQU5JMVBsWnJrVkpQSFYta0M5N0w4QU1TOUM0U0tKV2taM0FKOS02NWZHRHJkMWR6MW4yYm9qSTZDT1lFZG9qRkpsZy0zU1JXNHpPSXhrWkV3bVI4cldWTjZfY0dzWVZ5NUVaZFlzc3RqZjlPS1ZfRU5YbGN2aV9CY0p3MkNBUUJveGJL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong approves Bitcoin and Ethereum ETFs as US lingers on ETH approval - CryptoSlate",
        "content": "Hong Kong further solidified its status as a crypto hub, with several issuers reporting approval of their spot Bitcoin and Ethereum Exchange-Traded Funds (ETFs) applications on April 15.\n\nHowever, Hong Kong’s foremost financial regulator, the Securities and Futures Commission (SFC), has yet to release an official statement on this development.\n\nSFC has not responded to CryptoSlate’s request for comment at press time.\n\nSpot Bitcoin ETFs\n\nChina Asset Management, one of the issuers, disclosed that its Hong Kong entity received regulatory approval to offer virtual asset management services, paving the way for Spot Bitcoin and Ethereum products.\n\nIts statement reads:\n\n“China Asset Management (Hong Kong) has received approval from the Hong Kong Securities and Futures Commission to provide virtual asset management services to investors. It now plans to issue ETF products that can invest in spot Bitcoin and spot Ethereum.”\n\nChina Asset Management aims to launch the products by teaming up with OSL Digital Securities. BOC International Prudential Trusteeship has been selected as its custodian.\n\nSimilarly, Bosera Capital and Harvest Global Investments announced that the financial regulator has approved their applications for Bitcoin and Ethereum spot ETFs. However, these announcements have been deleted as of press time.\n\nMeanwhile, market observers believe that the approved crypto ETFs would attract fresh investments to the region and revolutionize the market by providing a more efficient and less risky way of managing assets through the in-kind creation model.\n\nCrypto hub status\n\nThe reported approval of these crypto ETFs further positions Hong Kong as a pioneer crypto hub within Asia.\n\nOver the past year, Hong Kong has attracted significant attention and praise from the crypto industry due to its pro-crypto regulatory approach.\n\nCathie Wood, CEO of Ark Invest, recently lauded the country’s robust pro-crypto regulatory framework, saying:\n\n“Hong Kong is the ‘leader’ in terms of policy. It strongly encourages the development of innovative technology and entrepreneurs. The system of investment and mutual cooperation with the government has given the institution a good model.”\n\nMentioned in this article"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNeHh4Z0E3emozTERQWFJwRmtYajZGREtXS1d1dFJhODh6TWRzRXpJSlR6ZEdXZnRMNG44SlVNNTVUOUU2R3l4eXJqOU45bXRtNkhYNkJjS2lVdnNPSU9YLTBrclNMcGFoblRRdTdYSzg3U0tGdmFWX01DMkFSM1lwZFNqR1JMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Halving 2024: How Bitcoin (BTC), Ethereum (ETH), and Furrever Token (FURR)’s are Poised to Transform in the New ETF-Driven Market Landscape - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 15, 2024 (GLOBE NEWSWIRE) -- As the cryptocurrency community approaches the 2024 Bitcoin (BTC) halving, excitement builds not just for the potential effects on Bitcoin's price, but also for the broader implications for the market, including Ethereum (ETH) and emerging assets like Furrever Token (FURR) . This particular halving event, set for April 2024, coincides with significant market developments, notably the rise of Bitcoin Exchange-Traded Funds (ETFs), which could reshape investment strategies and market liquidity. Bitcoin's upcoming halving will reduce the reward for mining transactions by half, potentially constricting supply and influencing prices in a market that has already seen Bitcoin, Ethereum, and others like Furrever Token, make substantial gains. The interplay between these factors and the new dynamic introduced by ETFs could lead to unprecedented outcomes in the crypto space.\n\nBitcoin (BTC) Halving: A New Chapter in Crypto With the Rise of ETFs\n\nThe Bitcoin (BTC) community is poised on the brink of the 2024 Bitcoin halving, an event that could catalyze the cryptocurrency landscape. Scheduled for April 2024, this halving is not just another cycle in Bitcoin's existence but may mark a significant turning point for broader crypto adoption. Unlike previous halvings, the upcoming event coincides with the emergence of Bitcoin Exchange-Traded Funds (ETFs), introducing a dynamic that could reshape market reactions post-halving.\n\nBitcoin's supply is finite, capped at 21 million coins. Every four years, the Bitcoin network undergoes a 'halving' where the block rewards given to miners are reduced by half. This mechanism decreases the rate at which new bitcoins are created, aiming to prevent inflation and preserve scarcity. Historically, each halving event has led to considerable bullish trends in Bitcoin’s price. For example, after the 2012 halving, Bitcoin’s price escalated from around $12 to over $1,000 within a year. Similar patterns followed the 2016 and 2020 halvings, with prices peaking at around $20,000 and over $60,000, respectively.\n\nWhile past performance due to halving is notable, it's crucial to recognize that these price surges also aligned with significant global economic events, such as the European debt crisis, the ICO boom, and the COVID-19 pandemic. These events underscore the influence of broader economic contexts on Bitcoin’s market behavior, indicating that halving impacts are intertwined with global economic health and investor sentiment.\n\nStory continues\n\nThe 2024 halving introduces a novel factor that could significantly influence Bitcoin's market dynamics—the approval and operation of spot Bitcoin ETFs in the United States. These financial products allow a wider range of investors to engage with Bitcoin without the complexities of direct cryptocurrency handling, potentially enhancing mainstream adoption. The first quarter following the introduction of these ETFs saw about $12.1 billion in total inflows, suggesting a strong demand for Bitcoin through this new investment avenue.\n\nThe presence of Bitcoin ETFs could potentially absorb some of the post-halving sell pressure typically expected from miners reducing their holdings due to lower block rewards. By offering a new route for capital inflow into the Bitcoin market, ETFs provide a buffer against the volatility usually associated with reduced miner income.\n\nAs the 2024 halving approaches, the interplay between reduced miner rewards and the influx of funds via ETFs could mirror yet another halving effect, softening potential price drops and supporting gradual price increases. This synergy between ETF adoption and evolving market structures lays a robust foundation for Bitcoin's sustained rise, potentially influencing the entire cryptocurrency ecosystem.\n\nAs the cryptocurrency market matures, the 2024 Bitcoin halving emerges as a pivotal event, augmented by the integration of ETFs into the market structure. For investors and market participants, understanding these shifts is crucial. Staying informed and adaptable will be key in navigating the intricacies of this halving event, enabling stakeholders to capitalize on emerging opportunities and mitigate potential challenges. In this evolving narrative, Bitcoin not only retains its status as the leading cryptocurrency but also demonstrates its resilience and adaptability in an ever-changing financial landscape.\n\nEthereum (ETH) Dips Below the $3,200 Mark as Whales and Institutions Offload Holdings\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, is currently experiencing significant selling pressure, exacerbated by large-scale dispositions from whales and key institutional players. As the broader cryptocurrency market faces a downturn, with over $900 million in liquidations recorded in the last 24 hours, Ethereum has not been spared, seeing its price struggle to maintain support levels.\n\nRecently, Ethereum's price momentarily dipped below the $3,200 mark to reach $3,161 before recovering slightly to hover around the $3,280 level, marking a 5.62% decrease within a single day. This volatility has been partly attributed to substantial sales by major Ethereum holders. According to data from Lookonchain, four significant entities offloaded a total of 31,683 ETH, worth approximately $106 million, contributing to the downward pressure on prices.\n\nThe transactions involved well-known entities in the crypto space:\n\n- Cumberland deposited 17,206 ETH onto exchanges, valued at around $57.3 million.\n\n- Wallet address 0xC3f8 moved 7,976 ETH to Binance, totaling about $26.6 million.\n\n- Wallet 0x1717 transferred 4,000 ETH, worth approximately $13.32 million, to various trading platforms.\n\n- Alameda/FTX was reported to have moved 2,500 ETH to Binance, which amounts to roughly $8.33 million.\n\nThese moves reflect a broader trend of large-scale Ethereum sales, which can significantly impact the market due to the substantial volumes involved.\n\nThe continuous flow of ETH to exchanges suggests that the selling pressure may not abate soon. Another report from Whale Alert highlighted an additional transfer of $158 million worth of Ethereum to Binance by an unknown wallet, indicating the potential for further sell-offs in the open market.\n\nAside from market actions, Ethereum is grappling with several ecosystem challenges that may be influencing investor sentiment negatively. Recent developments have cast doubt on the prospects for an Ethereum ETF, as regulatory and market hurdles continue to loom large. This uncertainty, combined with the active shedding of assets by major stakeholders like Alameda/FTX, suggests a tough road ahead for Ethereum.\n\nAs Ethereum navigates through these turbulent market conditions, the community and potential investors are closely monitoring these developments. The influx of large volumes of ETH onto exchanges and the accompanying sell-off activities by prominent institutional players are crucial factors that market participants will need to consider. These dynamics are pivotal in shaping Ethereum's short-term price movements and broader market standing amidst an already volatile financial landscape.\n\nFurrever Token (FURR) Priced at $0.00048 as Presale Exceeds $780,000\n\nFurrever Token (FURR) is swiftly making its mark as a distinguished investment in the vibrant cryptocurrency market, drawing significant interest for its robust growth potential and appealing investor opportunities. Demonstrating outstanding success through its presale events, FURR has consistently attracted substantial investments. Presently in its sixth presale phase, the token has successfully raised over $780,000, illustrating its escalating popularity and the strong endorsement it enjoys from the cryptocurrency community.\n\nFURR positions itself as an exceptionally attractive investment by offering the potential for investors to achieve up to 15X returns from each presale stage. Currently priced at $0.00048, the token presents an opportune entry point for investors looking to leverage its projected growth.\n\nThe token's appeal is further reinforced by the robust community support it commands. With more than 4,300 active participants on its official Telegram channel, FURR is at the center of dynamic discussions, collaborative initiatives, and regular updates, all of which enrich the investment experience for its community members.\n\nLooking to the future, FURR's strategic roadmap and development plans signal a strong commitment to carving out a significant presence in the meme coin market. The team behind FURR is focused on rolling out innovative features, forging strategic partnerships, and launching targeted marketing efforts, all aimed at boosting the token's adoption and enhancing its market value.\n\nOverall, Furrever Token stands as a highly compelling investment proposition, supported by solid fundamentals, an active and enthusiastic community, and a promising outlook for expansive growth. As FURR advances toward achieving its strategic goals, it is well-equipped to provide significant returns to early investors who tap into its potential.\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOMVRYLVduU1ZEeTZxenhQalQ3cW9GTzAzaThsY0RheE5fVGR2QWpVazJ6NUF1NjNaRzc2eWI0NnVWVVhqSmJUNlBtclZ6Mkx1em9FeXotb0UxNVBnSkxrbVJZZ0hfd1dyQ2p0OGZoVm16UVhBWFhQVk4xb2w2NE41N24zQUdpd2la?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Which Crypto to Buy in 2024: Navigating Ethereum (ETH), Dogecoin (DOGE), and Furrever Token (FURR) Market Trends - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 15, 2024 (GLOBE NEWSWIRE) -- In the tumultuous sea of cryptocurrency trading, Ethereum (ETH) has recently demonstrated remarkable volatility, swiftly rebounding from a sharp drop to stabilize at a higher level, capturing the attention of both seasoned traders and crypto whales. This event underscores the persistent dynamism and significant capital movements within the crypto market. Concurrently, Dogecoin (DOGE) enjoys a hopeful rally, buoyed by broader market optimism and speculative interest ahead of the Bitcoin halving. Amidst these established giants, Furrever Token (FURR) continues to carve out its niche, showing impressive presale momentum and drawing substantial investments from a growing community of supporters. These developments highlight the ongoing activities and strategic plays in the cryptocurrency space, driven by key events and whale movements that often dictate market directions.\n\nWhales on the Move as Ethereum (ETH) Rebounds From $3,400\n\nEthereum (ETH) has recently undergone a dramatic 24-hour period of trading that saw its price experiencing significant volatility. Initially, the cryptocurrency suffered a sharp 3.1% decline, dropping to $3,411, which led to the liquidation of tens of millions of dollars worth of positions within just an hour. However, not long after this steep drop, Ethereum saw a robust recovery, reaching a high of $3,615 before settling at $3,512 by the end of the day. Despite these substantial fluctuations, Ethereum's price remained essentially flat over the course of the 24-hour trading period.\n\nDuring this period of intense trading, the activities of major cryptocurrency investors, often referred to as 'crypto whales', were particularly noteworthy. According to a report from Spot On Chain, one such whale, known by the identifier \"0x347\", made a significant move by depositing 9,000 ETH into Binance. This deposit, valued at approximately $32 million, stands as the largest ETH deposit by this entity to date. After this transaction, \"0x347\" is now in possession of 29,738 ETH, which has an approximate market value of $106 million and has accrued an estimated profit of $68.5 million.\n\nIn addition, other reports by Lookonchain highlighted contrasting activities from another whale who took advantage of the market's dip to acquire 10,309 ETH, worth around $35.82 million. This purchase was part of a broader strategy that included a considerable investment just before a significant rise in Bitcoin's value on April 8.\n\nThe diverging actions of these major Ethereum holders reflect the mixed sentiments and strategies within the market regarding the short-term direction of Ethereum's price. While some see the recovery as a bullish sign indicating potential for further upward movement, others remain skeptical, viewing the rebound as merely a technical correction rather than the start of a sustained upward trend.\n\nStory continues\n\nWith Ethereum constantly at the center of market speculation and analysis, the differing approaches of significant market players highlight the speculative and often unpredictable nature of the cryptocurrency market. As Ethereum continues to evolve, it remains a focal point for both opportunity and caution within the dynamic landscape of cryptocurrencies.\n\nDogecoin (DOGE) Climbs 6% as Market Outlook Stays Hopeful\n\nDogecoin (DOGE), the leader among the world's meme cryptocurrencies, has experienced a surge, climbing 6% in the last 24 hours to reach $0.203. This increase comes amidst a broader wave of optimism in the cryptocurrency market, spurred by the upcoming Bitcoin halving event. However, the excitement was short-lived as Dogecoin's price dipped to $0.192, culminating in a weekly gain of 3.2% and a monthly rise of 9.85%. Despite these fluctuations, Dogecoin maintains its status as the largest meme coin by market capitalization.\n\nAn intriguing aspect of Dogecoin's current market position is that it trades at a considerable discount, 73% below its all-time high of $0.7316. This significant gap suggests potential undervaluation, fueling speculations that Dogecoin might be poised for substantial gains in the near future, especially as the Bitcoin halving approaches.\n\nMarket analysts remain optimistic about Dogecoin's trajectory, predicting potential price increases leading up to the halving event slated for April 20th. This event is anticipated not only to impact Bitcoin but to have a ripple effect across various digital currencies, potentially ushering in another bull market.\n\nThe technical indicators on Dogecoin’s price chart reinforce this optimism. The Relative Strength Index (RSI), after peaking at 70, has seen a slight retreat, expected to stabilize around 60 or 55, suggesting that any declines might be short-lived and followed by further gains.\n\nAdditionally, trading volumes for Dogecoin have shown remarkable growth, with a 13% increase from the previous day, reaching around $2.52 billion. This heightened activity is indicative of growing investor interest, further evidenced by substantial purchases by whales on various trading platforms in recent days.\n\nConsidering these factors, there is a strong likelihood that Dogecoin will experience significant price movements one or two more times before the Bitcoin halving event. This period could be critical for investors looking to capitalize on the anticipated market dynamics. As always, while the potential for high returns exists, the volatile nature of cryptocurrency investments calls for caution and thorough analysis before making any financial commitments.\n\n\n\n\n\n\n\n\n\n\n\n\n\nFurrever Token (FURR) Priced at $0.00048 as Near %200 Return Still Possible\n\nFurrever Token (FURR) is rapidly gaining traction as a standout investment in the dynamic cryptocurrency landscape, capturing widespread interest due to its impressive growth potential and lucrative opportunities for investors. Demonstrating remarkable success across its presale phases, FURR has consistently drawn significant investments. Currently, in its sixth presale phase, the token has accumulated over $780,000, underscoring its popularity and the strong backing it has garnered from the cryptocurrency community.\n\nOffering investors the potential to achieve up to 15X returns from each presale phase, FURR positions itself as an exceptionally appealing investment within the crypto realm. Priced at just $0.00048, it offers an accessible entry point for investors keen on capitalizing on its expected growth trajectory.\n\nThe token's allure is further bolstered by the robust community support it enjoys. With over 4,300 active members on its official Telegram channel, FURR is at the heart of a vibrant hub for discussions, collaboration, and regular updates, which enriches the investment experience for its community members.\n\nLooking to the future, FURR’s strategic roadmap and developmental initiatives indicate a strong commitment to achieving a dominant position within the meme coin sector. The team behind FURR plans to implement novel features, forge strategic partnerships, and engage in targeted marketing efforts, all designed to enhance its adoption and increase its value in the market.\n\nIn essence, Furrever Token presents a compelling investment proposition, backed by solid fundamentals, an active and engaged community, and a promising outlook for substantial growth. As FURR continues to progress towards achieving its strategic goals, it is well-placed to provide significant returns to early investors tapping into its potential.\n\n\n\n\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\n\n\n\n\nMedia Contact: Robert Smith support(at)furrevertoken.com https://furrevertoken.com/\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQeGl5aUdYMzJXNUZFcEluRXQ3UDZIWmNRb0hKNWRCYkxsLVg2OXA1Tk9xQ2tsZGx3SkNVTUgyZ3B5Y2ZCUzZtaTBSS0lFN3A0NmV2TExWbWdqbDVLOWNaS3FWY0gweEZPM2JKQ294bEU0YU02UUpwai1UbWcta3RnbDVaVXZLZDNJOThFbVRMWW53ZkVmQlZEdnVzNXE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Markets Regulator Approves Bitcoin and Ethereum Spot ETFs - Unchained",
        "content": "Four Hong Kong-based asset managers have been given the green light to launch spot Bitcoin and Ethereum ETFs.\n\nThe Hong Kong SFC has given in-principle approval to four asset managers to launch spot BTC and ETH ETFs.\n\nThe Hong Kong Securities and Futures Commission (SFC) has given the initial approval to a first batch of firms to launch spot bitcoin and ether exchange-traded funds (ETFs).\n\nChina Asset Management, Bosera Capital, HashKey Capita and Harvest Global all disclosed that they had received in-principle approval from the markets regulator late on Monday afternoon Hong Kong time.\n\nIt is now a fight for capital between Hong Kong and New York to flow into their Bitcoin ETFs Game theory at work! Love to see it — Alistair Milne (@alistairmilne) April 15, 2024\n\nChina Asset Management has partnered with OSL Digital Securities and BOC International Prudential Trusteeship to provide infrastructure and custody services for the firm’s proposed spot crypto ETFs.\n\nLast week, a Matrixport report seen by CoinDesk suggested that the approval of a Hong Kong-listed Bitcoin Spot ETF could attract “billions of dollars of capital” from investors in mainland China.\n\nThe report’s authors said their assumptions were rooted in the fact that these investors would capitalize on the Southbound Connect program, which allows mainland Chinese investors to acquire up to HK$540 billion worth of Chinese stocks per year.\n\nHowever, Chinese blockchain reporter Colin Wu later said that Hong Kong bitcoin ETF issuers he had spoken to had clarified that their spot crypto ETFs would definitely be off limits to investors from mainland China, which still has a blanket ban on the trading and ownership of digital assets.\n\nSeveral issuers of Bitcoin ETFs in Hong Kong told WuBlockchain that southbound funds from mainland China are definitely unable to buy cryptocurrency ETFs, and the Matrixport report is false. An earlier Matrixport report indicated that Bitcoin spot ETFs listed in Hong Kong are… — Wu Blockchain (@WuBlockchain) April 13, 2024\n\nSpot bitcoin ETFs in the U.S. have seen an overwhelming response since their launch in January – the funds (barring Grayscale’s GBTC) boast a cumulative $53.3 billion in assets under management (AUM)."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQbFRzZWRVMUpyUVZkX0pYaG8zMUNWTThGZmZTdHJOTURXcy1telFpUnV0UlFJOVpjakZqaXZCdzFleWU5QzRFRlJsMnFueTU0SXVxQm1ZeHhmR3gwaWxISXBkLU9DQTR3YzdYYmpaeVpjendPM0pyamdXQWdBbk5WLW96VTdEeXpXN2RtcFRCblpKX3dxaE5GVmZBTld1alRIcnM1eFpUd2wtYjJWckYtaGJNU0JnWHZJOXVaY1U1WU9TN05DSjRNd1F2YmVsckpIdktLa19CQVNJTUdmMnJsOHp3UFhjZ9IB6wFBVV95cUxPa2E4NUNob1VRZVdrekVNSUNaTEhrUzhuekpsZ1M1dVdKNkVpQ1BXSkZ6TGZISkhxdUZ5cF9hMGJEcjhxZ2Y5ejYtTkxnQmJvLU5jR0xyd3dIYndfU2VWRk0zNnJ0X1Y4Tl8wSDRRTDdfcllMRjYzR05DcThtVlpMZC1FVHRtSDhQUTQwQWd3TmlzakI2eVRjV05pTGM1WlQ4dElEMlB6OXRKdWw1VTZXSmctU2FGVnhCejd1dGFaRFlVck1XYVFIaG1wTnJLWm9FZ1k1R0JnQllrMVlQV0RRcE1RUmpnY0xaVGZj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum declines as crypto market crash increases bearish sentiment - FXStreet",
        "content": "Ethereum risk reversal sunk by 20% on Tuesday following nervousness surrounding the recent crypto market crash.\n\nETH liquidated long positions reached $67.37 million in the past 24 hours as short traders prevailed.\n\nGlassnode shared insights into the recent Ethereum issuance reduction proposal that has sparked criticism from the crypto community.\n\nEthereum's (ETH) price briefly dipped below $3,000 on Tuesday after tensions surrounding a potential Iran-Israel conflict suppressed the effect of Hong Kong's spot ETH approval. Regardless of the price dump, the recent ETH issuance reduction proposal has made the rounds again following research firm Glassnode's report.\n\nRead more: Ethereum recovers from dip as Hong Kong ETH ETF approval sparks whale buying spree\n\nDaily digest market movers: risk reversal dips, liquidated long positions, ETH issuance\n\nEthereum headlines the crypto market again with increased attention surrounding it. Here are your key market movers:\n\nEthereum investors are showing increased nervousness as ETH risk reversals have sunk 20% on Tuesday, according to QCP Broadcast. Generally, crypto bulls are exercising caution as Bitcoin and other altcoins have also posted losses following the prevalence of the Iran-Israel conflict. QCP further highlights that the market is shorting ETH gamma, indicating a sharp move either upward or downward could be amplified.\n\n\n\nFollowing the Hong Kong spot ETH ETF approval, the second largest digital asset saw increasing discussions, making it the most trending token among traders, according to data from Santiment. Despite the increased attention, ETH shorts have risen by 54% as bearish sentiment around the digital asset continues increasing.\n\n\n\nThe crypto market liquidation heat map validates this as Ethereum has seen over $81.9 million in liquidations in the past 24 hours, according to data from Santiment. Liquidated long positions account for $67.4 million of the total ETH liquidations, with the largest coming from an ETH-USD swap valued at $6 million.\n\nAlso read: Ethereum price stagnates as EIP-3074 brings smart contract functionalities to wallets\n\nThe Ethereum Foundation's proposal to reduce ETH issuance still faces criticism despite clarifications that the aim is to maintain Ethereum's status as money and a balance in the network's governance power, according to Glassnode.\n\n\n\nThe rise of restaking and liquid restaking tokens increases ETH's inflation rate and impacts several ETH holders. \"In other words, there is a wealth transfer taking place from a shrinking pool of non-staked ETH holders, towards a growing pool of staked ETH holders,\" says Glassnode.\n\n\n\nAs a result, the \"real yield\" could shift the \"role of money\" within the Ethereum ecosystem from ETH to liquid staking tokens or restaking tokens because of their significantly high yields. \"A side-effect of such a development would be the projects which issue these derivative tokens gaining an outsized influence over the governance and stability of Ethereum's execution and consensus layers,\" stated Glassnode.\n\nTechnical analysis: ETH to trade below $3,301\n\nEthereum bears prevailed in the past 24 hours as its price has found it difficult to recover from the weekend slump. After a brief move toward $3,300 on Monday, expectations were that it would maintain a sideways movement in the $3,210 to $3,406 range. However, ETH declined further, settling around the $3,000 support.\n\nETH/USDT 1-hour chart\n\nRead more: Ethereum price recovers slightly as whales begin accumulation spree\n\nConsidering current volatility, ETH may trade inside the range of $2,852 and $3,301, both formed on Saturday. A move above the range may see it breaking past the $3,406 resistance of April 7 and testing the 3,618 key level of April 11. A further upward move will see ETH sustain bullish momentum. However, a move below the range will see ETH entering a bearish trend.\n\nThree factors will affect this thesis: the upcoming Bitcoin halving, a potential Iran-Israeli conflict, and the Securities & Exchange Commission’s (SEC) decision on a spot Ethereum ETF.\n\nEthereum is trading around the $3,000 support at the time of writing."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPWkFDQVl6dE1LR1dXQUgxRUgwZzEtYUE2eEJqMnA1Nk9LTTBPSmpXeEY5UWVWX1ZLa0FqZjViSlhwWWg3TjdEZExfVXNKcWpFckFmdWF3eGJJWHJUVlZ1S2F1R1ZsSDRxRGNDQlF4cTM0SExBb01ZNkVHbXU3dTVDVkh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "OKX Latest Exchange to Roll out Mainnet of an Ethereum Layer 2 Blockchain - Unchained",
        "content": "OKX’s 50 million users can withdraw tokens from the exchange to its “X Layer” to transact on onchain applications built on the layer 2 scaling solution.\n\nOKX has generated more than $5.2 billion in 24 hour trading volume, making it the third largest exchange after Binance and Bybit.\n\nCrypto exchange OKX on Monday launched the public mainnet rollout of “X Layer,” its layer 2 solution designed to link users with the Ethereum ecosystem.\n\nX Layer is the latest layer 2 built with the Polygon Chain Development Kit (CDK), a framework that enables developers to create blockchains based on zero-knowledge proofs. Zero-knowledge (ZK) proofs can be tapped by developers to increase privacy and improve scalability.\n\nRead more: What Are Zero-Knowledge Proofs?\n\nAs a result of the mainnet launch, OKX’s 50 million users globally can withdraw tokens from the exchange and onto its Ethereum-linked layer 2 if they want to transact onchain — including interacting with decentralized applications (DAPPs).\n\nOKX’s platform token, OKB, used to pay network gas fees, increased 14% in the last 24 hours to trade at $59.15, data from CoinGecko shows. The move comes as OKX, which holds over $22 billion in crypto custody, has become the third-largest exchange by 24-hour trading volume with over $5.2 billion, behind only Binance and Bybit.\n\nThe public mainnet launch of X Layer follows in the footsteps of crypto exchanges Bybit and Coinbase releasing their own layer 2 blockchain network, Mantle and Base, respectively. Each has the aim of onboarding millions of people onchain.\n\nPolygon’s CEO Marc Boiron, told Unchained that more crypto exchanges would be using the Polygon CDK to build out their own layer 2 networks.\n\n“There’s obviously some level of ‘Hey, Base is doing this, and we see Bybit doing this,’ but I think a lot of this is really just a big opportunity that exists and specifically in this ecosystem, where with Polygon you have the AggLayer that connects it all,” Boiron said.\n\nX Layer plugs into Polygon’s AggLayer, a protocol that enables an aggregated blockchain ecosystem to unify various layer 2 networks and allow users to move assets across chains.\n\n“X Layer’s connection to the AggLayer solves the fragmentation of liquidity and users across chains on the AggLayer so they can all grow together,” Boiron said in an additional statement. “OKX’s 50M users now have an easy path to onboarding to X Layer and all the other chains connected to the AggLayer.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE0wWU9YRmMtX1RaMFlMVFhDMVhSdzV0ZDNhWjlmMDBqMmcydzRNUFIzcWhJWkV6SzhCS1Vvb1h1OXh5ejA2RU1xQ1NfNEh2aTJnUTVQN2RhZngydnkyZy1DWFFfOHY3TEYwU20w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong SFC approves Bitcoin and Ethereum spot ETFs - Crypto Briefing",
        "content": "The Hongkong SFC has approved spot BTC and ETH applications from HashKey Capital, Bosera Capital, Harvest Global, and China Asset Management.\n\nShare this article\n\nSeveral prominent asset management companies, including China Asset Management (Hong Kong), Bosera Capital, and HashKey Capital Limited, have announced that their applications for Bitcoin and Ethereum spot exchange-traded funds (ETFs) have been approved by the Hong Kong Securities and Futures Commission (SFC). This approval allows investors to directly use Bitcoin and Ethereum to subscribe for corresponding ETF shares.\n\nChina Asset Management (Hong Kong), an asset management company in the Hong Kong market and an overseas subsidiary of China Asset Management, has received approval from the SFC to provide virtual asset management services to investors. The company now plans to issue ETF products that can invest in spot Bitcoin and spot Ethereum.\n\nTo facilitate this endeavor, China Asset Management (Hong Kong) has partnered with OSL Digital Securities Co., Ltd., a leading player in the virtual asset industry, and BOC International Prudential Trusteeship Ltd., a prominent custodian. Together, they are actively researching and deploying strategies to offer these innovative investment products to their clients.\n\nChina Asset Management, established in Hong Kong in 2008, was among the first batch of Chinese asset management companies to expand overseas. Its parent company, China Asset Management, is one of the largest fund companies in China, with total assets under management exceeding US$266 billion as of December 31, 2023.\n\nOver the past 16 years, China Asset Management (Hong Kong) has developed a strong local investment research team and offers a diversified range of products, including long-term stock and bond funds, hedge funds, ETFs, leveraged/inverse products, and separate accounts. The company is committed to providing investment advisory services to individual and institutional investors across Hong Kong, Greater China, Asia Pacific, Europe, and the United States.\n\nIn addition to China Asset Management (Hong Kong), Harvest Global Investments has also announced that the SFC has approved in principle their Bitcoin and Ethereum digital asset spot ETF products.\n\nThe approval of these spot ETFs by the Hong Kong Securities and Futures Commission marks a significant milestone in the integration of traditional finance and the rapidly growing digital asset space. It demonstrates the increasing acceptance and legitimization of cryptocurrencies as an investable asset class and is expected to attract more institutional and retail investors to the market."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9JZk05bjZuMjlxSlNVc05JU1ZBMVJVQVRMaU1zSXp1c0tFTWl5Ul9yeGpvWFU4cWE5T3VJUEZzOVNZTXV6MWJLR01EWlZSMmpSWGtUSzNTYkxWc01vMGUxNF9TaDJ0T05CMnRmeTYxaEpTXzMyb2lpX2ZQV1ZDelnSAYcBQVVfeXFMTnZINldReXFnamdDZkVNakE2bkNzem5UeURwNVE5VEdPdU4zUEFDdWR5NHlVQ0RsTGpGMGFvOEhOVGFsckUtMlE4VFJ4Rmotb3Nqa2hHMUlncnNUOHVhdzl1UWM3My1jNG9ScW9DRzRjc1hFQklSdU5rZFlHaWNPY2lqdUhEc3BZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Spot Bitcoin, Ethereum ETFs Approved in Hong Kong - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHong Kong's securities regulator has given conditional approval for a number of spot Bitcoin and Ethereum ETF applications.\n\nIn separate statements Monday morning, China Asset Management and Harvest Global Investments announced the in-principle approval of their applications by the Hong Kong Securities and Futures Commission (SFC). Harvest Global Investments subsequently deleted its statement, likely pending an official statement from the regulator.\n\nDigital asset platform OSL announced in separate press releases that it would act as the \"sub-custodian partner\" for China Asset Management and Harvest Global Investments' ETFs.\n\nBosera Asset Management also reportedly announced that it had received conditional approval for its ETF application, which will be jointly managed with HashKey Capital.\n\nAD\n\nAD\n\nIn a statement, OSL CEO Patrick Pan said that its appointment as sub-custodian to China Asset Management, \"demonstrates our commitment to advancing digital asset investments in Hong Kong, mirroring the trend of reputable partnerships seen in the U.S. market.\"\n\nThe news comes just months after the U.S. Securities and Exchange Commission (SEC) granted approval to multiple spot Bitcoin ETF applications, which have seen billions of dollars in inflows since their launch in January.\n\nHowever, the U.S. SEC has proved more reluctant to approve a spot Ethereum ETF, delaying its response to multiple applications. Meanwhile, the Ethereum Foundation revealed that it is being investigated by a \"state authority\"—which, while not confirmed to be a U.S. regulator, has contributed to a growing pessimism among analysts as to the chances of an Ethereum ETF being approved.\n\nWhile the Chinese mainland has engaged in a years-long crackdown on cryptocurrency, Hong Kong has embraced the sector, rolling out a Virtual Asset Trading Platform (VATP) licensing regime in June 2023 in a bid to position itself as a crypto hub.\n\nAD\n\nAD\n\nIn August 2023, HashKey and OSL became the first licensed crypto exchanges to offer services to retail users in Hong Kong."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPYnNwcnZMUk81SVJnc2tTR2J1WU16R1VWUldzSWs0cUkya054c3RKQWRUNktWQ2kwR3ZiMndDQ3pIamJCajJlYU5kMUlMNU1uaTk1eXdKSkFpQmpjY0o5blVvYXpUOHgtSHRTcWpRMzd4UGNLdDY0bWZ4b25PV2dNOFNfd9IBiwFBVV95cUxPT3dabWFid3NNdW4zMFpjeW5xWkM4QXh3cER6UlBpUFlKTGhBQXhiTmpINEdiaFZOcUFwRVRJVnVCT2FmYVViaWw3cTNhMERXRWE4QkxscEhXTnVzaVNmeWlEYVFvaU8xb1JmN2F5N0l2TG1oMHJ5NktYb3pvWkRoS1FrdTBpVjktdWo0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "OKX Launches Ethereum Layer-2 Network in Challenge to Coinbase's Base - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto exchange OKX announced Monday that its Ethereum-based layer-2 scaling network, X Layer, has entered public mainnet—becoming the latest name-brand blockchain to offer crypto users faster and cheaper transactions than Ethereum's own mainnet.\n\nBuilt using the Polygon CDK, OKX’s X Layer is also one of the first to take advantage of Polygon’s so-called AggLayer. Unveiled by Polygon in January, the solution looks to make many different blockchains feel as if they are one through a shared network state and liquidity that lets funds seamlessly flow from one network to the next.\n\n“We are building an ecosystem that is as seamless and interoperable as possible,” OKX’s Chief Marketing Officer Haider Rafique said in a statement, adding that “X Layer has limitless potential thanks to [OKX’s] strong community.”\n\nThe Singapore-based exchange, which has over 50 million users globally, is one of crypto’s largest by trading volume. Over the past day, OKX has seen $4.9 billion worth of crypto change hands—more than the $4 billion in trading volume registered meanwhile at Coinbase, America’s leading crypto exchange, according to CoinGecko.\n\nAD\n\nAD\n\nSimilar to OKX’s embrace of Polygon’s tech, Coinbase’s layer-2 network Base is built using the OP Stack from Optimism, a toolkit from another popular Ethereum layer-2 network. Since launching last July, Base has attracted around 8 million users while processing 154 million total transactions, according to data from Dune Analytics.\n\nIn addition to cheap transactions, layer-2 networks make interacting with decentralized applications (dapps) more feasible for users because they cost less to use. Through X Layer, users have access to 170 dapps, which is “slated to increase exponentially,” OKX said in a statement.\n\nAs of now, notable dapps released on X Layer include the decentralized exchange QuickSwap, community-building platform Galxe, and the infrastructure platform Thirdweb.\n\nOne noticeable difference between Base and Layer X is the latter network’s embrace of zero-knowledge (ZK) proofs. Allowing someone to prove that a statement is true without divulging the statement itself, the concept in cryptography is core to Polygon’s updated architecture and a vision for greater interoperability across chains.\n\nAD\n\nAD\n\n“X Layer is a monumental next step in the industry's ambition to build a truly unified Web3,” Polygon CEO Marc Boiron said in a statement. “The X Layer’s connection to the AggLayer solves the fragmentation of liquidity and users across chains.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOcW5WdGZEZTNjbUdMWDJNYkdZMG0zbkF6TFRFM1IyVFZITTNaMlhHUndHZ1l4bUw0WlJXRVpuYWJyeHpYbTdobFBNMWE0Sm5fVmRWOUpUR093QVYySU5RVnBIMUtBYnFjOGkxVVhXNEhrU2dxSEExVldaSmgwNnpNRkQ4eGZEX0FlQjI4UG530gGWAUFVX3lxTE9sN3o0WDE2azd4eUVtVC1xdDVnTDFJbEJoZWJnMjBtTnY3UVBVQUpUNlhrUzgyZWNKeFpJUTBHZ3BUdWJxSnZqYkNJLW4tczlSblRtU1lHWDZVd0ZObVVDdW91R0dTRWlXNi00OGp3MHZ0ckZiclQzWHJjeHF1dFlLbnJDZ1cxZmFTRnNpMGFiQ01wOF9udw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong's Bitcoin and Ethereum ETFs Could Fetch $25 Billion—If China Plays Nice - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHong Kong’s spot Bitcoin and Ethereum exchange-traded funds (ETFs) could begin trading by the end of the month, the veteran analyst behind 10x Research told Decrypt.\n\n“While no trading date has been set, expectations are for April 30,” said 10x Research founder Markus Thielen. He also writes research reports for Singapore-based trading platform Matrixport and was previously its Head of Research and Strategy.\n\nThielen's comments come the day after Hong Kong gave conditional approval for a number of spot Bitcoin and Ethereum ETF applications managed by China Asset Management, Harvest Global, Bosera, and HashKey, respectively.\n\nAs a result of the U.S. approving spot Bitcoin ETFs in January, there was a substantial increase in demand for crypto asset exposure, which has helped push along the most recent bull run. But according to Thielen, the level of success of Hong Kong ETFs heavily depends on whether Chinese mainland investors can purchase them.\n\nAD\n\nAD\n\nThe Shanghai Stock Exchange’s southbound stock connect allows qualified mainland China investors to access eligible Hong Kong financial assets. The southbound connect has a daily quota of ¥42 billion—and if exceeded, trades will be rejected. But in recent years, this quota hasn’t been reached.\n\n“This program allows mainland investors to buy up to ¥500 billion ($69 billion USD) of Hong Kong-listed stocks annually—or equivalent to HK$540 billion annually,” Thielen told Decrypt. “During the last three years, the annual spare quota was HK$100 billion to HK$200 billion ($15 billion to $25 billion).\"\n\n\"If Chinese investors could buy,\" he added, \"this is how much mainland investors could allocate—as an upper limit.\"\n\nHowever, this future seems unlikely for now, as Thielen believes that the ETFs will not become part of the southbound program for at least six months.\n\nAD\n\nAD\n\n“Most market participants expect Chinese mainland investors to be unable to buy these products and that they will not be added to the southbound connect program,” Thielen explained. “Currently, Hong Kong ETFs need to have been listed for six months, but regulation could always change.”\n\nThat said, Thielen suggested that due to “China’s property worries” and decade-long weakness in the stock market, the country could look to Bitcoin to diversify its assets.\n\n“Although some forms of Bitcoin activities are banned in China, the ban might be primarily motivated by the fear of social unrest due to scams, illegal capital raising, etc,” Thielen said. “A regulated product like the Bitcoin and Ether ETFs is more favorable.”\n\nDespite China’s ban of crypto trading and mining in 2021, the country has remained at the forefront of crypto conversations. In 2023, top crypto exchange Binance processed $90 billion of Chinese transactions in a single month—accounting for 20% of Binance’s worldwide volume at the time.\n\nSince then, Hong Kong has positioned itself as the next crypto hub—opening trading to retail investors and now approving crypto spot ETFs—which experts told Decrypt could be China using the territory as a “testing ground.”\n\n“Nothing happens in Hong Kong without China's blessing—not even a raindrop,” Thielen added. “So when the two leading financial market authorities (HKMA and SFC) approve Bitcoin and Ethereum ETFs, there must be a conscious decision and a calculation around the impact this might have.”\n\nHowever, Thielen suggested that this might not be as bullish as many crypto enthusiasts first thought, due to cultural differences in investing.\n\n“ETFs have limited success in Asia as investors like to take direct/concentrated bets, instead of buying a basket of something,” he said. However, in this case, as the ETFs represent a single asset rather than 10 to over 100 stocks, it’s much closer to being a direct bet.\n\nAD\n\nAD\n\n“Therefore, the success rate could be much larger than that of other basket-time ETFs,” he added.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNSWF5eV93cS1zVVE5aEZPX2xPYW1wMzJ1OHRYZUtXcWY4S2REbHpiTEpqazlfOTMxZE1BZlRvbFVyUjVhRnlDTzV3Ql9FZU5wRzJpMjNINVZINUR4UXoyeWtBS3pZUWZWVHh1LXJibkQtVlUxV2VHYUdoV0tZTnZ6Y21jOFBKTkpoYmdRZDhXYUJmNHhJX0Vj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong SFC Approves Spot Bitcoin and Ethereum ETFs - Crypto Times",
        "content": "Hong Kong just scored a big win in the world of cryptocurrency. The Securities and Futures Commission (SFC) gave a thumbs up for trading Bitcoin and Ethereum ETFs, making Hong Kong the pioneer in offering Ethereum ETFs, leaving the US still in the decision-making phase.\n\nHK etf approval means btc and eth are becoming mainstream assets that even your mother could buy from a bank.\n\n\n\nThis is a game changer. — Joseph Young (@iamjosephyoung) April 15, 2024\n\nBig players like China Asset Management, Bosera Capital, and Hashkey Capital Limited got the green light from the SFC to launch Bitcoin and Ethereum ETFs. Now, investors can dive into these ETFs and own a piece of Bitcoin and Ethereum directly.\n\nChina Asset Management’s Hong Kong branch got a nod from the Hong Kong SFC to provide retail asset management services for spot crypto ETFs. They aim to launch ETFs for Bitcoin and Ethereum in partnership with OSL and BOCI International. OSL will serve as the “first virtual asset trading and sub-custodian partner” for these ETFs.\n\nBosera Asset Management and Hashkey Capital have just received conditional approval from the SFC for their spot crypto ETFs. These innovative products, the Bosera HashKey Bitcoin ETF and the Bosera HashKey Ether ETF, empower investors to easily use Bitcoin and Ethereum to subscribe for ETF shares.\n\nHarvest Global Investments receives preliminary approval from the SFC for two significant digital asset spot ETFs.\n\nMr. Tongli Han, CEO and CIO of Harvest Global Investments, said, “This in-principle approval for Harvest Global Investments’ products in two major digital asset spot ETFs not only underscores Hong Kong’s competitive edge in the digital asset space, but also demonstrates our unrelenting pursuit of promoting innovation in the industry and meeting diversified investor needs.”\n\nThese ETFs are scheduled for launch via a collaboration with OSL Digital Securities, the first digital asset platform licensed and insured by the SFC."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOWExDcUxHR1VBVmJmNTkwWjdtcndRc194RkZ1WUNRRTd0T0p0X1pRQTBBVHRuWVVBSHlkaTJUZHJVUXlnSGMtVkV4R2JLTlB6MjM0ODFFZFF1S3JZSFZVeVkwNWVxUVAtTjNLNEN2OV9BTUZVQzFULThYbjAteEtZelhlckpaVExuYURuNzFhd2lFQTQ2TmNqMkJjdDNlbTQwVjVUS0xqbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Trending tickers: Oil, Goldman Sachs, Bitcoin and Ethereum - Yahoo Finance UK",
        "content": "Oil prices dipped on Monday following increased tensions between Iran and Israel over the weekend. (Reuters / Reuters)\n\nOil prices tracked lower on Monday morning in European trading hours, as markets digest news of Iran's attack on Israel over the weekend. Comments from Israeli officials suggest the conflict is \"not over\" as market watchers wait to see what will happen.\n\nMoney was taken off the table following a near-six month high of $92.18 for Brent crude last week. Crude futures headed 0.9% lower, to trade at $84.87 (£63.08) a barrel, while Brent crude was 0.8% lower and trading at $89.74.\n\nRead more: FTSE 100 LIVE: European stock markets mixed amid rising tensions in the Middle East\n\nIran said it had launched drones and missiles towards Israel in retaliation for a 1 April attack on its consulate in Damascus, Syria. Israel has not confirmed whether it carried out the attack. Iran's retaliation raises concerns about broader conflict in the middle east and the passage of oil supplies.\n\nGoldman Sachs (GS)\n\nBank Goldman Sachs is set to report earnings on Monday before the opening bell in the US, with quarterly results set to be lower for the three months to the end of March.\n\nEarnings are expected at $8.56 per share, down from $8.79 per share in the same quarter a year ago, according to Bazinga data.\n\nRead more: Stocks that are trending today\n\nThe company is projected to report quarterly revenue of $12.9bn, compared to $12.2bn.\n\nShares closed 2% lower on Friday and were down a further 0.6% in premarket on Monday.\n\nMonday also sees earnings report from Morgan Stanley and Bank of America.\n\nBitcoin (BTC-USD) and ethereum (ETH-USD)\n\nBitcoin and other digital assets rallied on Monday morning, following a drop over the weekend, as news hit that Hong Kong has given the initial green light for spot bitcoin and ether ETFs.\n\nChina Asset Management, Harvest Global Investments and a partnership between HashKey Capital Ltd and Bosera Asset Management (International) Co told the market of initial approvals in separate statements earlier today.\n\nRead more: Pound rises against dollar after hitting lowest point in five months\n\nHong Kong's approval comes following the a nod from the US Securities and Exchange Commission to allow spot bitcoin ETFs, a move which brought the likes of Blackrock into the market. Since then, bitcoin's price has risen from around $42,000 to above $66,300 today.\n\nThe digital asset was trading more than 3% higher by mid-morning on Monday. Ethereum was also 5.4% higher, to trade at around $3,250.\n\nWatch: IDF on 'High Alert' after Iran launched hundreds of drones and missiles\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOQzdJc2JzUVpremVGWmJuM2lfTzk3UEhiRnNyY1FPVVpqUEJ0aE1vb01HWnAzTV9DeDV2b01RbFduSlVlVG1WLVdFQ1B1cGhLSUI5NGUxb29tWlRhZk1FREdHQ1c0SjVVcm1MZzZzSGlUVWhwNTIwaVRieTRzTXM2N2RZU0tOVU5WLTIxdVVld1hBcUJUYlI4YjZ5WWVHd2U3ZVVxYkZiMEpHZ2R3RVlBRk5pLWpWVEdfS0t0ZmNRbkFnNlpRNFJacjNjTnVmT25XU053dmtqSWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum 'Underperforms,' But Trader Expects New All-Time Highs: 'Great For Staking' - Benzinga",
        "content": "Cryptocurrency trader Alex Krüger shared his insights on Ethereum ETH/USD, the second-largest cryptocurrency by market capitalization, suggesting it will trade at new all-time highs in the future.\n\nWhat Happened: In an April 15 tweet, Krüger was bullish on the asset.\n\n“I expect ETH to trade ATH,” he said. Krüger is “long $ETH” and uses ETH, saying it is “useful” and “decent collateral and great for staking.”\n\nHowever, he also points out that “ETH underperforms. “Those not using it for staking are down bad,” according to Krüger. He attributes this underperformance to the fact that “most people in crypto already own too much ETH” — a topic he has been discussing for some time.\n\nKrüger warns against being a maximalist, stating, “Don’t be a maxi. It will only cost you money.” For those who find themselves overexposed to $ETH, he suggests rebalancing their portfolio “during market crashes.”\n\nEmphasizing the importance of relative performance in the crypto market, Krüger urges investors to consider diversifying their assets to maximize returns and minimize risks.\n\nAlso Read: Move Over Shiba Inu, Doge: OKX Lists Soaring Memecoins WIF And MEW\n\nWhy It Matters: The approval of Hong Kong’s first spot Bitcoin and Ethereum ETFs is a significant milestone in the city’s journey to become a leading hub for cryptocurrency investment in Asia.\n\nThis move comes on the heels of the U.S.’s introduction of similar ETFs. So far, they have already attracted billions in net inflows. As Hong Kong opens its doors to mainstream crypto investment, it sets the stage for increased adoption and liquidity in the region.\n\nDespite an ongoing market correction, analysts remain optimistic about the overall health of the crypto bull market, suggesting that the downturn is a temporary setback rather than a macro trend.\n\nWhat’s Next: The importance of Ethereum as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Arthur Hayes: ‘That Was The Dip, Now We Rip,’ Asks 490K Followers What Coins To Buy\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBBY3FRaExGTUxHMjdPdE90cEpIbGlkSmF5eUt5cTRiVEZoaVVMZDRoQ0NpTm5Nc3oxdG13ZVNjTzhwaVBHdVAyb1VpdU5tbDJld3BYc0lNNGhNMl9yMURudHg5MGtqekFYY2VaQ3ZMa0hTajg4Q3lzbUJNNy0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price : Will ETH Price Recover In 2024 ? - CoinGape",
        "content": "Ethereum has been facing challenges in holding onto its top spot in the market among altcoins. The bears causing the global cryptocurrency market decline are also dominating ETH. After dropping more than 11% in the last month, it appears the coin is loosing ground to Bitcoin. With the Bitcoin halving event on the horizon for April 20, 2024, the crypto community is eagerly anticipating whether the price of Ethereum will see a rebound. Let’s explore thoroughly to discover the potential.\n\nMarket Performance of Ethereum Price\n\nadvertisement\n\nIn the last 24 hours, Ethereum experienced a 5.19% drop in its price, falling to $3,086.39. The significant drop in its market performance has also been highlighted by the significant decrease of ETH, by 14.27% and 11.36% in the last week and month respectively.\n\nAccording to CoinMarketCap, Ethereum holds the title of the second largest cryptocurrency with a market capitalization of $371.15 billion. Moreover, the coin experienced a drop of around 5.86% in its trading volume, reaching $21.77 billion, in the last 24 hours. This decrease shows lower liquidity and trader interest in the coin.\n\nETH price reached its highest point at $4,891.70 on November 16, 2021. After that, Ethereum has experienced a decrease of around 36.67% reaching the current price.\n\nFactors Determining the Recovery of Ethereum Price\n\nVarious factors play a role in the recovery of ETH price as discussed below.\n\n1. Bitcoin Halving\n\nBitcoin Halving might also impact the rise in ETH trading price. The event that takes place after every four years, has a notable effect on the cryptocurrency market. It could impact the Ethereum (ETH) price in different ways. Initially, the halving decreases the amount of new coins being introduced into circulation. This limited availability may result in higher demand as investors look to spread out their investments. If the price of Bitcoin increases after the halving, Ethereum and other cryptocurrencies are expected to also see price hikes because of the increased interest in the market.\n\nAlso, Bitcoin halvings result in excitement and speculation within the investment community. This feeling can also affect other cryptocurrencies. Anticipating positive impacts from Bitcoin halving, individuals might choose to invest in other cryptocurrencies such as Ethereum, leading to an increase in their value.\n\n2. Ethereum ETFs\n\nIncreased attention from institutional investors and major companies in Ethereum may bring stability and boost the price. The potential launch of new spot Ethereum exchange-traded funds (ETFs) in May, 2024 could lead to a surge in Ethereum’s value, similar to the impact of Bitcoin ETFs. However, analysts are concerned about the SEC approval process, with the likelihood decreasing from 70% to 30% due to a lack of communication from regulators. Investors should be cautious about expectations surrounding the approval of Ethereum ETFs.\n\n3. General Cryptocurrency Market Recovery\n\nA recovery in the cryptocurrency market can result in Ethereum’s price bounce due to various factors. Firstly, as investor confidence grows with the market’s rebound, more individuals are likely to invest in Ethereum. Secondly, renewed capital inflows into cryptocurrencies typically include Ethereum due to its reputation and use cases. Additionally, Ethereum often follows Bitcoin’s trends, so when Bitcoin’s price rises during a market recovery, Ethereum’s price also tends to increase. Moreover, market liquidity and trading volume can rise during a recovery, leading to smoother price movements and potential upward pressure on Ethereum’s price. Furthermore, increased interest in blockchain technology and decentralized applications can drive further demand for Ethereum. Institutional investors may also be attracted to Ethereum during a recovery, contributing to its price growth.\n\n4. ETH’s Price Forecast\n\nBoth the Exponential Moving Average (EMA) and Simple Moving Average (SMA) show that short-term periods of 10, 20, and 30 days are signaling a bearish trend based on technical indicators. The Ethereum price is below thes moving averages, showing the possibility of a price drop in the short-term.\n\nSimilarly the EMA and SMA for extended durations like 50, 100, and 200 days are also indicating a downward trend. indicating a bearish direction. The current price of ETH is below these moving averages, showing that the overall price movement of Ethereum remains bearish.\n\nThe MACD with 12 and 26 periods is giving a Buy signal, suggesting a possible short-term turnaround.\n\nThe MACD, which is a momentum indicator, calculates the variance between two moving averages, and the Buy signal could indicate a slight move towards an upward trend for ETH.\n\nHowever, there is a Sell signal shown by the EMA across different time periods, ranging from 10 days to 200 days. This indicates that Ethereum’s price might keep experiencing downward pressure in the near to medium future. The RSI (Relative Strength Index) at 37.6 is in the neutral range. It indicates that ETH’s price is neither overbought or oversold, suggesting there may be potential for a price reversal if the RSI moves further towards either extreme.\n\nOn the downside, should the price of ETH, it will find support at $2698.5. Should the decline further past the level, it will find another key level at $2698.5. Any more losses might see the price drop further to $2361.2\n\nIf the bulls fail to protect the $2698.5 support, the price might decline toward $2361.2.\n\nOn the upside, the price is now facing resistance near the $3581.4 level and the trend line. The next major resistance is near the 3789.7 level. A clear move above this level of resistance could send the price toward $4127.\n\nConclusion\n\nDespite facing hurdles and declines, Ethereum price shows indications of potential recovery and opportunities for a comeback. The future Bitcoin halving and possible introduction of Ethereum ETFs may have a positive effect on the price of Ethereum. Moreover, the collective rebound of the crypto market could help reverse the direction of Ethereum’s price movement. Investors need to monitor important support and resistance levels, alongside changes in technical indicators like RSI, EMA, and MACD, to detect any shifts in momentum. Ultimately, Ethereum’s future success will be influenced by various factors, making it crucial for investors to remain informed and prudent."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOVVI5RUxaSUJvMnF3bUhVakw2dlVpeS1TeEVPVEZUV3gwQkpyTTdwOWt3OVFwODk1STQ4UzVCZjd1dGQxWVlkcmcyQXhKb0p5T3VmbjRqbTBmaFVRb0hka3NzZXdXd0ZNdFg2NTFuX1R0Q3NuRE5xMVF5Y003Z3gwUmZmVEJnMVNrdHpWWUJWNTVoNGdKN2J0a1VHREdHWlhfMXAxcTBHU0piSF9uc2JUbnJ2bmlkWVV2TVV5Y3pYWS1qZGRBaXR1azMwVEVOclk3U2tJZHI1WHp6N09fWXRlZWNnN0RWc0RS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong's First Bitcoin, Ethereum Spot ETFs Get Regulatory Nod: 'Welcome To The Party, China!' Says Crypto Analyst - Benzinga",
        "content": "Hong Kong’s securities regulator has approved the city’s first spot Bitcoin BTC/USD and Ethereum ETH/USD exchange-traded funds (ETFs).\n\nWhat Happened: The Hong Kong units of Bosera Asset Management and China Asset Management have been granted regulatory approval by the Hong Kong Securities and Futures Commission (SFC) to roll out the ETFs, reported Reuters.\n\nThis comes on the heels of the U.S.’s introduction of the first U.S.-listed ETFs tracking spot bitcoin just three months prior.\n\nCrypto Analyst Lark Davis took to social media platform X to share his enthusiasm about the news, stating, “Hong Kong just approved spot Bitcoin and Ethereum ETF applications. Welcome to the party, China!”\n\nBREAKING: Hong Kong just approved spot Bitcoin and Ethereum ETF applications.\n\n\n\nWelcome to the party, China! — Lark Davis (@TheCryptoLark) April 15, 2024\n\nSee Also: Iran Launches Drone Attack On Israel In Escalation Of Tensions, Bitcoin Drops Sharply In Response\n\nThis approval is a landmark in Hong Kong’s path to becoming the first Asian city to recognize popular cryptocurrencies as a mainstream investment tool. The launch of similar ETFs in the U.S. has already drawn approximately $12 billion in net inflows, setting a benchmark for other regions.\n\nWhy It Matters: Crypto Analyst Davis has been vocal about the potential of cryptocurrencies. Earlier in February, he predicted Bitcoin could reach $150K in the next bull market. In April, Davis forecasted a Bitcoin boom in 2024, attributing it to the U.S. elections and expected Federal Reserve interest rate cuts.\n\nHowever, a drone attack by Iran on Israel on Sunday caused a sharp decline in the crypto market. Despite the turmoil, analysts predict a rebound in the altcoin market.\n\nPrice Action: Bitcoin is trading up by 1.03% in the last 24 hours at $66,455, and Ether is up by 3.48% today at $3,255, according to the data from Benzinga Pro.\n\nRead Next: 14.8 Trillion Shiba Inu Tokens Liquidated In Just 24 Hours Amid Market Downturn\n\nImage Via Pixabay"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOLWl5aDM1LUpERnRVcHEzS1N5YkRTcWI1R0o0aDh3VVhlN0pHMmtUNHJWQlVHRVBGVzJNTE1OMEFGRVo3c3F0bFhsbGdyS09LRmMyZXVFVmhfbVhXanB0QTNfdklSdHFLdkthVk5oUkZDSVB4T1JCbU91OFZoZmZ6d2FnWUtCSzRvNnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Can Ethereum (ETH) Hit All-Time High After Bitcoin Halving? - Watcher Guru",
        "content": "The highly anticipated Bitcoin halving event draws near, set to occur on April 20, 2024, according to Watcher.Guru’s active tracking. The cryptocurrency community is abuzz with speculation about the potential impact on various digital assets following the event.\n\nAmong the coins garnering significant attention is Ethereum (ETH), the second-largest cryptocurrency by market capitalization. Many enthusiasts and investors are now pondering whether ETH has the potential to reach its all-time high of $4,891.70 in the aftermath of the halving.\n\nThe Bitcoin halving, which takes place approximately every four years, has historically been a catalyst for substantial growth across the cryptocurrency market. This event reduces the reward for mining new Bitcoin blocks by 50%, thereby reducing the supply of new Bitcoins entering circulation.\n\nA surge in Bitcoin’s price often results from this reduction in supply and steady or increasing demand. This has positively influenced the broader crypto market, including altcoins like Ethereum.\n\nAlso read: Shiba Inu (SHIB) & Dogecoin (DOGE) Price Prediction This Week\n\nChangelly Analysis Predicts Significant ETH Price Increase\n\nAccording to a recent analysis by Changelly, a prominent cryptocurrency data provider, Ethereum could hit $3,171.61 on April 21, 2024, just one day after the Bitcoin halving.\n\nFurthermore, Changelly’s long-term forecast for Ethereum is even more promising. The analysis indicates that by June 2025, ETH could potentially reach $4,964.07, surpassing its previous all-time high and setting a new record for the cryptocurrency.\n\nIn addition, Changelly has also provided their insights on Ethereum’s potential price trajectory for April 2024.\n\nAlso read; Cryptocurrency: Whales Scooped Up These Coins Amidst Market Dip\n\nBased on the price fluctuations observed at the beginning of 2023, these experts expect the average ETH rate to be $3,139.16 in April 2024. They have also provided a range for ETH’s minimum and maximum prices, with $3,088.52 and $3,189.79, respectively.\n\nThese predictions still indicate a significant upside potential for Ethereum in the coming year. As the Bitcoin halving approaches and market sentiment remains bullish, many believe that ETH is well-positioned to benefit from the anticipated market-wide growth."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE90b2FwNy0zQWRMUnJ6UjhYc0czd1M0MThIVVpPRTVUZ0NfdXZEMDAwY1pmOHg2Ukg5bE9YYW1YQzlRNWVkZ0drOUVlVm02elVkY3daTVBuMURmTk5PYl9wQ1EzdUZFWk9uZ1BMLdIBckFVX3lxTFA3dVZ4QnQ3YXNYY2lXUXZtUU1PVTdOM0p3X002UHM0d2luZ29OSmdXUVpGcnRwMnpqZndidTNVdUxLekRxR08wWDkyaU1kakVrbWwyeFFGVWpkSTZYTTBHYno5WllvaElSblN4N3dXWTVyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "OKX debuts Ethereum L2 network X Layer - Forkast News",
        "content": "Cryptocurrency exchange OKX has launched X Layer, an Ethereum layer-2 scaling solution, to its public mainnet.\n\nDeveloped using Polygon’s Chain Development Kit, X Layer uses zero-knowledge proofs to enhance security and interoperability.\n\nThe newly introduced X Layer is fully compatible with the Ethereum Virtual Machine (EVM).\n\nX LAYER aims to unlock and accelerate the global adoption of the Web3 economy, ensuring greater individual freedom and opportunity for millions worldwide. We’re incredibly excited about what’s to come and welcome you to join us as we work to bring the vision of X LAYER to life.\n\n“X LAYER is integrated with OKX Exchange (CEX) and the OKX Web3 Wallet,” OKX Chief Marketing Officer Haider Rafique said in a statement on Tuesday.\n\n“Users can seamlessly bridge assets from the two platforms to LAYER to interact with the DApps deployed on the network.”\n\nRafique expanded on three of X Layer’s long-term purposes: to simplify on-chain decentralized applications, to empower creators, and to make transactions faster and cheaper."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxONDhXajBlSk9PeG9CUkpxNmhUeXg2TVRYRmZ0NFRHb1V5NkdETHFlQ2F0bmpYbUc2WGRTeEhpUVNldGdjYWlNd2pGZVRUSkdtN2g3VG1rdDlSUS1oNFVCNVpqQlhYTGE5TFEtT2F4ZlA0a0pQZmNyeVJ6SVNoTVpJR25kdGJHSjM5RmZXVHQ3b25DYzdT0gGaAUFVX3lxTFBQZ0NhQnNKN1ExV29vZ3prbHVkUFdld3BmVEg3Z1Bwd1M0dkw5RVNVUEJZdHl2dnpHWkgyXzRJbUdreWNJYTlHYVFNWXJESUhudUxTZE10QWVhRElhM0FxUWJLNVdTc2ZkRDQ1MUxKY0lFZjEyVk1hNEJacThJVS1TcGhLQ1R6VDI4dmNfenZkS2dPZzZZcGZyUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Weighs-In On Default Transaction Privacy on Ethereum - CoinGape",
        "content": "Conversations regarding privacy on the Ethereum blockchain have taken a new twist in the crypto community. At its core, the discussion centers on whether Ethereum, as a foundational layer of blockchain technology, should inherently provide transaction privacy. Recently, Vitalik Buterin, co-founder of Ethereum, offered his insights into this contentious issue.\n\nThe question raised is pivotal “Should a base layer like Ethereum offer transaction privacy as a default feature?” This query encapsulates broader concerns about the balance between privacy, transparency, and stability within blockchain networks. By delving into Buterin’s perspective, we can gain valuable insights into the complexities of this debate.\n\nadvertisement\n\nVitalik Buterin’s Opinion\n\nVitalik Buterin’s perspective on default transaction privacy aligns with the analogy of the Transmission Control Protocol (TCP). He draws a parallel between Ethereum’s protocol and the operation of TCP, which functions in a clear text manner, leaving encryption tasks to higher layers. Buterin argues that Ethereum could adopt a similar approach, delegating encryption responsibilities to upper layers while maintaining a stable base layer.\n\nThis viewpoint highlights the importance of adaptability and resilience in the face of evolving encryption protocols. By separating encryption concerns from the base layer, Ethereum can ensure stability while accommodating advancements in privacy technology. Buterin’s stance underscores the pragmatic approach needed to navigate the complex interplay between privacy, security, and technological progress in blockchain networks.\n\nAlso Read: BlackRock Co-founder Predicts Market Comeback, Cites $9 Trillion Cash Pool\n\nImplications and Discussion\n\nButerin’s perspective carries significant implications for Ethereum and the broader blockchain ecosystem. The adoption of default transaction privacy at the base layer could enhance user privacy and security, addressing concerns about data surveillance and identity theft. However, it also raises challenges related to regulatory compliance, as opaque transactions may hinder efforts to combat illicit activities such as money laundering and terrorism financing.\n\nFurthermore, the implementation of default transaction privacy may impact network scalability and efficiency, as cryptographic operations can impose computational overhead. This trade-off between privacy and performance underscores the need for careful consideration and strategic decision-making in blockchain protocol design.\n\nAlso Read: Shiba Inu Community Burns 774M SHIB Despite Market Crash, What’s Next?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxQNkl6QVBEaGpTSVFNTlFFY0Q0WGJ0MjlRRms2cGh5dU5iam03ak1qbnN3alVhMmdNRFExbXZ5cGExeFMwTWI4TE1RQ3JTNnIyeVhjcFBZd3lCRjlrS2ZYQU9VQ0ppZU9iZHVSdmNCeHR5aFRmOFBIT01yNGYzUXozQVl6Tnk2eXVGY0l5V0JJS1NpUVJaYlZCdlc5QVVuaExmRlBFWExhYk1VdW1HUlFmSmwtTUx2NGg2TmtIUDItanYwbXFhcC1fTkhXUzFpVzJkdzJoVGVUVjdyZ1NhMmhaeWF2LXFvUk1BSHZ6MEdaT3R0ZjBzNVpDZ1lNZ9IBgAJBVV95cUxNV0ZXQVRYZEtRRUhKUU50Y25nc2VkbkJfaXpGZmYxdDcxRFZqRXFSR3pDLV90ME5pNldYck5MU2E2cHdVbkM3OXFDUEdkeS1JRG5hNURjX2pEVmotWTVNTmJBdmdRSC1DVWN4OEExTzhIM2tPZ0h5Qk9BcTZDM1lvZHNFaEc3YTd6OFdYVF9YZmMtTVFpYXNUODdCTHFISV82THlMV0tBbzhseWJ4ZU8wMUN4X3VQMFh6N0ZPTDhoaVY3YmYyX0RVWmRqVkVUV3pVSm5VLW5FSzBlUE04UDVDZ0pzRHdhRVJ0RDdZOGtDaTNGdXJaWlpQZEswVzMxNjJN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC leads crypto market weakness amid Middle East risk flush - FXStreet",
        "content": "Bitcoin price could dip below $60,000 before BTC halving date amid elevated market risk.\n\nEthereum price brews bullish reversal toward $4,000 contingent on how BTC bulls play their hand.\n\nRipple price could revisit weekend lows below $0.4500 amid mounting overhead pressure.\n\nBitcoin (BTC) price has the broader cryptocurrency market on standby, awaiting a definitive directional bias. Like in the case for most altcoins, Ethereum (ETH) and Ripple (XRP) are in the red on the back of chaos in the Middle East between Iran and Israel.\n\nGeopolitical tensions between the two countries have markets in risk-off mode. For instance, Bitcoin price dipped to $62,000 on Saturday when reports confirmed that Iran had launched dozens of drones at Israel. However, following reports by Iran’s United Nations (UN) Mission that the country’s retaliatory attack on Israel was “deemed complete,” Bitcoin price bounced above $65,000 on Sunday.\n\nI know a guy who sold all his Bitcoin at $61,666 because Iran was apparently “very serious” about destroying Israel this time and that global nuclear warfare was “inevitable”. Now he’s in a state of panic as BTC has bounced back to $65,000 and he doesn’t know what to do. Scary. — Mike Alfred (@mikealfred) April 13, 2024\n\nAs indicated in a previous report, the crypto markets are dumping because of a general atmosphere of fear and risk aversion in financial markets. Investors are looking to liquidate their positions to reduce risk and move toward more traditional safe-haven assets like Gold and Silver.\n\nNevertheless, the market has the BTC halving in sight, out barely five days with just about 642 blocks remaining.\n\nAlso Read: Bitcoin price tanks to $62K ascribed to geopolitical tension a week to BTC halving\n\nBitcoin price could revisit $60,000\n\nBitcoin price downside momentum could have more play before the halving. The pioneer crypto remains below crucial support provided by the ascending trendline after a slip below three days ago. Stuck in the lower section of the market range between $61,970 and $73,122, where selling pressure climaxed and buying pressure peaked, respectively, the odds favor the bears.\n\nFor starters, the Relative Strength Index (RSI) is below the ‘50’ mean level with an overall southbound inclination. This, coupled with the position of both the Awesome Oscillator (AO) and the Moving Average Convergence Divergence (MACD) in negative territory reinforced the bearish outlook.\n\nWhile a retest of the $61,970 base is likely, the dire case could see Bitcoin price go as low as the $60,000 psychological level before a pullback.\n\nBTC/USDT 1-day chart\n\nOn the other hand, a show of strength by BTC bulls could see Bitcoin price reclaim above the bullish trendline, confirmed by a flip of the 50% Fibonacci placeholder into support above $67,546. This could draw more bulls to the scene, sending BTC price above the $69,000 threshold. In a highly bullish case, BTC could reclaim the $73,777 all-time high before an attempt at further upside.\n\nAlso Read: Bitcoin price unable to tag $67K despite Hong Kong BTC and ETH spot ETF approvals\n\nEthereum price works out a bullish reversal, but BTC won’t let it happen\n\nEthereum price is consolidating within a falling wedge, which is a bullish reversal pattern. Contingent on whether BTC shows strength or crashes further, ETH price could respond in kind. A show of strength could send Ethereum price higher. A breach of the upper boundary of the governing chart pattern above the $3,750 level would signal the opening of a long position.\n\nETH/USDT 1-day chart\n\nConversely, with the broader market still in the red, Ethereum price could continue the fall below the 100-day Simple Moving Average (SMA) at $3,023. A candlestick close below $2,750 would invalidate the bullish thesis.\n\nAlso Read: Ethereum whales pushes its price up as Hong Kong approves spot ETH ETF\n\nRipple price next move hinges on RSI bounce\n\nRipple price could have more downside momentum to come amid growing overhead pressure due to the 50, 100 and 200-day Simple Moving Averages (SMAs) at $0.6094, $0.5754, and $0.5837, respectively.\n\nWith the RSI well below 50 and the MACD and AO in negative territory, XRP price could slide to $0.4500. Even worse, it could establish a lower low below the April 13 bottom, tagging the $0.4000 psychological level.\n\nXRP/USDT 1-day chart\n\nOn the flip side, traders buying the correction could bode well for Ripple price. While a move above the $0.6000 psychological level would be ideal, the bearish thesis would only be invalidated upon a candlestick close above $0.6685. Traders should watch for the RSI bouncing above the 30 threshold for possible entry.\n\nAlso Read: XRP recovers from weekend massive decline after developers propose native lending on XRP Ledger"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNOWpoVmxEeXdBcHhZRGlBeHVSZmhxTVY1ZkI4ZzQtdFR2OHlYNFRkZ0JfQVEtU25LQjJFcUpBOEJGQmxRUjZTTGhxNFpDckhsTFAxbVU0OWwwanAzNlJqZlhuWXo1SXh0Y2M3eWk4RVBLQW9jYjAwSXRXYVJNM3RxR1FwcnBxNTc4bmfSAY8BQVVfeXFMTVRZUWZnM1RpbVlFRU14SnVmczhFTDJKemdkOXNMcHB2VUMxc19MZGlhUFFyTGRrQ3BSSlRHbUFBOGJ3b3dZdnBabGdmdEZTcmlQSGtwNVdIV2ZXTy14cFE4V3Nxa2RmS1BmR1ZVRjZveWZBcEhfTnBkOVpibmJYbUlHeG9JVGkzWU9YS0NBc28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: ETH Key Support Level To Watch Amid Mass Selloff - CoinGape",
        "content": "Amid a widespread selloff in the cryptocurrency market, the Ethereum price trajectory has attracted significant attention from traders and analysts alike. Meanwhile, the recent decline in the Bitcoin price has further contributed to the decline in the broader crypto market.\n\nNotably, as discussions intensify regarding the potential for further declines, key support levels for Ethereum emerge as crucial indicators for market sentiment and future price movements.\n\nadvertisement\n\nAnalysts Unveils Crucial Support Zone For Ethereum\n\nAs Ethereum faces downward pressure amid the ongoing market turmoil, attention turns to critical support levels that could influence its trajectory. Notably, renowned crypto analyst Ali Martinez highlights a key support zone for Ethereum, ranging from $2,000 to $2,430.\n\nMartinez said that within this range, approximately 9.37 million addresses collectively hold nearly 53 million ETH, underscoring its significance as a potential turning point for Ethereum’s price direction.\n\nMeanwhile, Ali Martinez’s analysis sheds light on the intricate dynamics shaping Ethereum’s current price momentum. Highlighting the importance of the critical support zone, Martinez’s insights serve as a focal point for cryptocurrency market participants evaluating Ethereum’s resilience amid market volatility.\n\nWith speculation rife over the possibility of further selloffs, Martinez’s observations prompt a reevaluation of Ethereum’s market fundamentals and potential recovery paths.\n\nAlso Read: Bitcoin Selloff To Continue During Bitcoin Halving Event\n\nWhat’s Next?\n\nDespite the prevailing market downturn, optimism persists within the crypto community, fueled in part by recent regulatory approvals. Notably, Hong Kong’s green light for Bitcoin and Ethereum ETFs has injected a sense of confidence, echoing the positive sentiment following the U.S. Spot Bitcoin approval. Besides, the anticipation surrounding the upcoming Bitcoin Halving event adds another layer of intrigue, as historical data suggests a potential uptick in market momentum post-Halving.\n\nHowever, it’s worth noting that while historical trends offer insights into potential market movements, they do not guarantee future outcomes. Concerns over short-term volatility, particularly in the lead-up to the Bitcoin Halving, raise questions about Ethereum’s immediate price trajectory. As investors weigh the implications of market dynamics and regulatory developments, Ali Martinez’s analysis serves as a guidepost for navigating the uncertain terrain of the crypto market.\n\nAs Ethereum grapples with the fallout from the broader market selloff, attention shifts to critical support levels and expert analyses for guidance. While challenges persist, the crypto community remains cautiously optimistic, drawing on past precedents and regulatory developments to chart a course forward.\n\nMeanwhile, the Ethereum price was down 7.48% and traded at $3,013.42 during writing, while its one-day trading volume stayed near the flatline at $22.42 billion. Amid the recent price dip, the ETH price has lost nearly 16% over the last seven days. Notably, the Ethereum Futures Open Interest lost 6.01% to $10.91 billion over the last 24 hours, CoinGlass data showed.\n\nAlso Read: Vitalik Buterin Weighs-In On Default Transaction Privacy on Ethereum\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNN21Lb3VZYk5ST1NWa3gxdjV0NnRBb24tMmhKc2VkZ05keTItZ2ZpblVjcmFHTWs1eS1KbnAyT1BPTmFmOHMzZHVfZmZfdVZ5VkNwYmNrRk01NkMzRE9TR29NUG1JWXJ5MXpEbE1oc0tHeEtNbnpyLUpvTDk2dDVUQU9XOVhmbGQ2QXZZZtIBkgFBVV95cUxPUDhIeHdlZGRRWmxMWFVuaHB6YjI1ODU0eE01Z05JXzNvWDJyRnJZbVQ0MFZ5Sy1sM19UWnMta3JSTlRKNHBHRjlTREt2S2RldmE1TXZwNDkweGNaRFpESF9XSU80cXJRQnhRQXN6S1R2UlA3MXYyTm12TEgzMnBvaWpjd3c0enJ4Y3ItYkxIRFd3UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum undervalued after ETH’s 8% drop – What’s next? - AMBCrypto News",
        "content": "ETH’s fall has caused holders to rethink their belief in the coin’s potential.\n\nThe MVRV ratio showed that altcoin was undervalued.\n\nLong-term holders of Ethereum [ETH] have signaled that they are also concerned about the cryptocurrency’s potential, AMBCrypto discovered.\n\nWe found out after examining the Long-Term Holders Net Unrealized Profit/Loss (LTH-NUPL). The metric considers the behavior of investors with a UTXO of at least 155 days.\n\nHolders are not calm\n\nIf the metric displays red, then investors are scared that the cryptocurrency might capitulate. Color blue suggests euphoria or greed.\n\nAt press time, the LTH-NUPL had moved from green to yellow. Green signifies the viewpoint that the price might continue to appreciate. But with Ethereum at yellow, it means that holders of the altcoins are now anxious and unsure about its potential.\n\nThe change in sentiment could be linked to ETH’s price action. On the 12th of April, the cryptocurrency crashed below $3,200. When market participants thought that the collapse was over, another one occurred.\n\nThis time, it was the unsettling state in the Middle East that sent ETH to $2,850. However, press time data showed that the price has reclaimed $3,000 again.\n\nBut will the price be higher than this in the short term? AMBCrypto evaluated the possibility by assessing the Seller Exhaustion Constant.\n\nSelling pressure may take ETH to another level\n\nAn increase in the Seller Exhaustion Constant indicated that sellers are running out of steam. If this was the case, the price of ETH might be gearing up for a significant upside.\n\nHowever, data from Glassnode showed that the metric dropped to 0.036, meaning that bears were not out of the way yet. Should the reading continue to go lower, ETH’s price might also fall.\n\nIn this instance, Ethereum holders might move from being optimistic to displaying their fears. The price of the cryptocurrency could also be affected, and another decline toward $2,800 could be next.\n\nConversely, a spike in the metric could change the state of things for the better. If this happens, ETH could try revisiting $3,200 to $3,500 within a short period.\n\nFurthermore, the Market Value to Realized Value (MVRV) ratio suggested a possible bounce for ETH. At press time, the 30-day MVRV ratio was -11.22%.\n\nThis reading was proof that most ETH holders who accumulated recently were at a loss. However, the MVRV ratio also shows if an asset is undervalued, at fair value, or overvalued.\n\nSince the metric was negative, it suggested that Ethereum was in an undervalued state. Take for instance— the 20th of March when the metric was around the same spot, and the price was $3,100.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nDays later, the value of the cryptocurrency rallied to $3,669. There were other instances where a similar thing happened.\n\nTherefore, the long-term potential of ETH might remain bullish and holders might eventually put two feet forward."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQc1l5UkRQZGp0a0ViTmx0cW9TWmp2LTJXTjZwNGNPZmJnSHF3S3QtZ2E0Q3JVWEVXWUw3RVFOVGI2XzJqTVNkd1cwYzJydWRacTlPT0d6d3lhdEM2YU5xc2tuLUplNllTSkNROXZyTExuX2EwNVhPS09USy1sVGpHTzNtMDNOUDJDWnBhTVlON1Q2V25sWGY4UzEzeV83NTlhRXllWWw1Rk5XdGV2YVHSAbMBQVVfeXFMTWRIOUFxUkNxdFhPbFJXRFFYYmNPU2tzZEJLYXRudnRhQmNadFFUamt0SXdWU2VuT3hTQXZibGdqa0RseUJaYzVYT3lCWUtGVDdFMGFQcjJnQ1doLU54dk1RVUVkRGJHT3ZxUXk0V2gtSUh1QjFWQ1oxeW11dE1BT1NXTVRhUS1yZk5Oa2NTMkxKYlNweFY4UDU2YTJlVF9pcUtRalRDdTZPSG5HNndybFktUVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Issues a Warning for the Upcoming Hong Kong Bitcoin, Ethereum ETFs - CryptoPotato",
        "content": "Hong Kong regulators recently approved spot Bitcoin and Ethereum exchange-traded fund applications, but Bloomberg ETF analyst Eric Balchunas predicts that the local ETF market may not perform as well as the US due to the current lack of big players and the possibility of high fees.\n\nAccording to Balchunas, the Hong Kong Bitcoin and Ether ETF market may generate $500 million in inflows, which is small compared to the over $15 billion from BlackRock’s spot Bitcoin ETF product alone in the United States.\n\nHong Kong Spot BTC ETF Smaller than the US\n\nThe Hong Kong Securities and Futures Commission (SFC) on April 15 granted in-principle approval for spot Bitcoin and Ethereum ETF products from China Asset Management, Harvest Global Investments, and Bosera Asset Management in partnership with HashKey Capital.\n\nWhile the spot crypto approvals are a major milestone for Hong Kong, which is determined to position itself as a central digital assets hub, there are speculations that the city-state may not witness large inflows like in the United States.\n\nBloomberg ETF analyst Eric Balchunas, in a tweet, predicted that the Hong Kong ETF market could see an inflow of $500 million, debating another prediction that estimated $25 billion.\n\nAccording to Balchunas, key factors such as the absence of major players in the Hong Kong ETF market and the possibility of these issuers charging high fees could hinder demand for the products.\n\nThe ETF analysts added that the potential local issuers are small compared to the behemoths in the United States. The US boasts financial giants such as the world’s largest asset manager, BlackRock, and Fidelity, which has nearly $5 trillion in assets under management (AUM).\n\nIn terms of fees, one to two percent, as speculated by Balchunas, may prove uncompetitive for Hong Kong Bitcoin ETF issuers, with US ETF providers offering 0.25% and lower.\n\nAs previously reported by CryptoPotato, Grayscale, which currently charges 1.5% for a management fee on its spot Bitcoin ETF, said there would be a reduction over time, following the maturity of the ETF market.\n\nThe company’s management fee is significantly higher than its rivals and has seen continuous outflows compared to competitors such as BlackRock, which continues to record gains.\n\nWhen Spot Ethereum ETF in the United States?\n\nMeanwhile, the Hong Kong spot Bitcoin ETF market could see an uptick if bigger players are involved and mainland Chinese investors are allowed access to the product, according to Balchunas.\n\nAlthough the US spot Bitcoin ETF market is larger than Hong Kong’s, the latter may have an edge over the United States, being one of the first jurisdictions with an approved spot Ethereum ETF.\n\nSince greenlighting almost a dozen applications in January 2024, the US Securities and Exchange Commission seems to be reluctant to give its approval for a similar product tracking the price of Ether, the second-largest cryptocurrency by market capitalization.\n\nBlackRock, Grayscale, Frank Templeton, Fidelity, and Invesco are among the applicants for a spot Ether ETF. The American regulator recently delayed its decision on Ethereum filings from BlackRock and Fidelity after previous delays on other applications.\n\nHowever, some analysts believe the SEC’s approval of a spot Ethereum ETF in the United States may not happen in 2024."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOZzFRZ3AxT241WGctQ3ZlaHVIYkZGdU4wQ3F1LURmNmNlR25jWkRtVGlrRUdPaWdmd2lDSEMyYTNZYVJpcklKVHh1T1FSdHh5eEpfcHRQZXFiTjJXVEdJaG0taWNzekRPT1JsR0dGem53dE5fWEpwSG4xU3pZM1VLcE1SV2o0Z3hNcy15T2JmUHdZWUNYMzJudWxucExqOUNRS2pPSHU0d2N1WkR3cDJmRk9SRWk5QdIBuwFBVV95cUxQa3VKQ1ZLbEtPWTlOZzZ4Y3EtNmk4ZFpUNEMtbHZJdk8xOUtWaEY5RDZ5MlVsTjlTdkdvazJQWWI0Sl9hZnhDalBzbENXM1VieWZJMEh1Y25mNVY0RmFhSkhxZXhtV3o5N2hxX1VoUDRVeDI3RUJGR0pHM0RvOUN2RS1HUWpzNmhZV2syeGxPODRCeV9wYTA0Y0tfeUlGMFlndHZ1SGZEMExNM2xRRUlHRWt6U3FuQXl0Njln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Most Brutal XRP Price Drop in Years, Is Ethereum (ETH) About to Lose $3,000? Is Bitcoin (BTC) Really Doomed? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP witnessed its most brutal price drop in years, plummeting by 20% in two days. Typically, XRP is characterized by low volatility, the magnitude of this plunge was particularly catastrophic.\n\nThis sharp decline pushed XRP's value down, breaching several crucial support levels. The fall was abrupt, slicing through the anticipated support near the $0.58 mark with ease, and coming to rest just above the $0.48 level.\n\nOur main focus now turns to the asset's next technical support levels. The 200-day EMA stands out as a potential bounce point, roughly at the $0.57 mark, slightly above where the plunge halted. Should XRP stabilize and recover above this line, it could instill a semblance of confidence back into the market.\n\nDespite the shock, growth scenarios remain on the horizon. For a bullish reversal to gain credibility, XRP would need to reclaim its position above the resistance formed near the $0.58 level. But considering the current state of the market, that goal seems surreal.\n\nAdvertisement\n\nEthereum on verge\n\nEthereum is teetering on the edge, with its price just above $3,050 after a significant drop. This precarious position has the crypto community asking: Is Ethereum about to dip below the symbolic $3,000 mark?\n\nThe recent price trajectory has not been kind to Ethereum, as the 100-day exponential moving average (EMA), currently near the $3,050 level, is being tested. This average has often provided some buoyancy, but its strength as a support level is not ironclad. Should Ethereum fail to maintain this level, a drop below $3,000 seems increasingly plausible.\n\nHowever, it is worth considering the potential for a reversal. The start of a new week could see market dynamics shift as investors look to capitalize on what they perceive as bargain prices. This buying pressure at local lows has the potential to reverse the downtrend, at least temporarily.\n\nFrom a chart perspective, if Ethereum holds its ground above the $3,050 support, there is room for cautious optimism. A rebound from this level could push prices back toward the resistance at $3,400. This would indicate a resurgence of buying interest and could help avert a more substantial decline.\n\nIf Ethereum breaks below the $3,000 threshold, the next significant level of support rests at the 200-day EMA, which is around $2,695. A slip to this lower boundary could mark a more pronounced bearish phase for Ethereum.\n\nLooking ahead, the key for Ethereum is whether it can summon the strength to defend the $3,000 level. If it does, and particularly if it can then surge past the 100 EMA, the narrative might shift back to a positive one.\n\nBitcoin fails\n\nBitcoin has surprised us all with the substantial price drop that now makes the majority of market participants worry about the future of this bullish cycle.\n\nThe drop to levels around $64,300 may signal a trend reversal, marking the end of the recent bull run.\n\nDespite the recent dip, Bitcoin has not completely left its support levels. The 50-day moving average currently sits near $58,417, offering a glimmer of hope as a potential bounce-back point. If Bitcoin can stabilize and hold above this MA, a reversal remains a possibility.\n\nA deeper look at the chart suggests that the $64,300 drop could open up a scenario where Bitcoin tests the next support level, which is the 100-day MA near $60,000. Holding above this could be crucial for maintaining a bullish outlook. If it does, and investor confidence remains steady, there is a chance for Bitcoin to recover and aim for resistance levels once again, possibly around $67,500, where it recently faced pushback."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNQWhtNFJ0MWFpdWRPUlZUZ2VXWTVOdWlyaHpMbC1vYXUzV2pXcWRMSV9RMHFhSTktOFQwUGdVS1RFam9vZGhIbE1iaGJ3dWp2VjBRS015bmlyMWFWRGN6ZnlDUkg4QnY2YjVHQlA1akY3SWIxWnAxcnpXdk9xZl9BWmxfQ2hLRVcyVGljMGg1OXF5aTJxUDd2QktYM1I1cGZMelIyQnF5S0w1Ul9STGExLWhLVTk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong embraces the crypto revolution: Bitcoin and Ethereum ETFs approved - The Cryptonomist",
        "content": "Hong Kong has given the green light to various spot ETFs on Bitcoin and spot ETFs on Ethereum, managed by China Asset Management, Harvest Global, Bosera, and HashKey. The asset managers, at the moment, have not disclosed the launch schedule.\n\nLet’s see below all the details.\n\nHong Kong opens the doors to crypto investment with spot Bitcoin ETF\n\nLast week Hong Kong gave the green light to the requests for several spot exchange-traded funds (ETFs) on Bitcoin and Ethereum, as the region continues its race to become a regional hub for cryptocurrencies.\n\nChina Asset Management, one of the leading Chinese asset managers, has announced that its Hong Kong subsidiary has obtained preliminary acceptance from the Hong Kong Securities and Futures Commission.\n\nThis is in order to offer retail asset management services related to crypto spot ETFs. The company plans to launch spot ETFs on Bitcoin and Ethereum in collaboration with OSL and BOCI International.\n\nOSL has confirmed to act as the “first virtual asset trading partner and sub-custodian” of China Asset Management for the upcoming ETFs.\n\nEven the two spot crypto ETFs from Harvest Global Investments have received preliminary acceptance from the SFC, as stated by the company itself.\n\nIt is expected that these ETFs will be issued in collaboration with OSL, in order to effectively mitigate issues related to excessively high margin requirements.\n\nOSL has guaranteed that it will provide a safe trading environment, managing the underlying assets with precision and reliability.\n\nHong Kong’s pro-crypto stance\n\nEven Bosera Asset Management, a subsidiary of Hong Kong of a major Chinese asset manager, and HashKey Capital have confirmed that they have received conditional approval for two crypto spot ETFs that they will manage together.\n\nHowever, it was not immediately clear what this “conditional approval” entails.\n\nThe two have declared their intention to launch a spot ETF on Bitcoin, called Bosera HashKey Bitcoin ETF, and a spot ETF on Ethereum, called Bosera HashKey Ether ETF.\n\nBoth funds will allow investors to subscribe to ETF shares using Bitcoin and Ethereum directly. At the moment, a precise launch date has not been communicated.\n\nBosera commented that the introduction of Virtual Asset Spot ETFs not only provides new opportunities for asset allocation to investors, but also strengthens Hong Kong’s status as an international financial center and hub for virtual assets.\n\nUnlike mainland China, which has imposed restrictions on cryptocurrency trading and mining, Hong Kong welcomed cryptocurrency companies last year.\n\nIn June 2023, Hong Kong officially launched its licensing regime for cryptocurrency trading platforms, allowing two authorized platforms, HashKey and OSL, to offer retail trading services.\n\nETF on Ethereum: United States beaten\n\nAdrian Wang, CEO of Metalpha, a digital asset company based in Asia, shared with The Block that Ethereum spot ETFs could soon become a benchmark in the industry.\n\nSpecifically, he stated the following:\n\n“I believe that the Ethereum ETF could have a more significant impact than the Bitcoin ETF. Investors currently have several options to gain exposure to Bitcoin through mining-related stocks, but there are no stocks related to Ethereum yet.”\n\nAngela Ang, former regulator at the Monetary Authority of Singapore and senior policy advisor at TRM Labs, highlighted that the approval of Ethereum ETFs in Hong Kong precedes that of the United States.\n\nTherefore, representing an important milestone in Hong Kong’s journey to become a leading center in the cryptocurrency sector. He stated:"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQekJRMUJtOGRsSUJEbWE4YlJDalJRMUdCTm1raXNZRDM4cjh4bXZrYXdDTXFpV3oyNlhpdHNUQUs1dkxuWjJ2Sl84bWFUTHFXRmluQ1hLTVl3cElMZEh6dFYzc0taNlhWVVpPNXNBal9JYWZlVE5ldndBanFTYURvUlpTWHg1eEtibWVUS0x6cW1xWFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "SOLOWIN HOLDINGS Selected as a Key Participating Dealer for Harvest Global’s First Spot Bitcoin and Ethereum ETF in Hong Kong - Yahoo Finance",
        "content": "Solowin Holdings\n\nHONG KONG, April 16, 2024 (GLOBE NEWSWIRE) -- SOLOWIN HOLDINGS (Nasdaq: SWIN) (“SOLOWIN” or the “Company”), a securities brokerage company that offers comprehensive financial services primarily to Chinese investors, today announced that Solomon JFZ (Asia) Holdings Limited, its operating subsidiary, has been selected as one of the three participating dealers for Harvest Global’s spot Bitcoin and Ethereum ETF in Hong Kong. Harvest Global was one of the just three ETF providers to receive conditional approval from the Hong Kong Securities and Futures Commission (SFC) this week to launch spot Bitcoin and Ethereum ETFs.\n\n\n\nMr. Thomas Tam, Chief Executive Officer of SOLOWIN, commented, \"We are excited to play a crucial role in the launch of Harvest Global’s first spot Bitcoin and Ethereum ETF in Hong Kong. This milestone will not only provide investors with new asset allocation opportunities but also reinforces Hong Kong's reputation as a top international financial centre and a hub for virtual assets. As a key participating dealer, we will leverage our expertise in financial products and our deep understanding of the local market to offer the ETF to a broad spectrum of investors and clients. Our partner, OSL Digital Securities, will act as the trading platform and sub-custodian for the ETF. We are committed to providing the highest quality of services to clients and upholding the highest standards of regulatory compliance and security. Being part of this groundbreaking initiative will position us to attract a wider range of investors and strengthen our position in the virtual asset market.”\n\nThe conditional approval, coming just three months after the U.S. introduced similar ETFs which attracted around US$12 billion in investments, marks a significant regulatory advancement for Hong Kong’s aspirations to be a global virtual asset hub. The virtual asset spot ETFs in Hong Kong will also introduce an in-kind subscription mechanism that allows investors to buy into the ETF using Bitcoin or Ethereum directly. This is expected to act as a transformative vehicle for channelling significant investment into the virtual asset space.\n\nAbout Solowin Holdings\n\nBased in Hong Kong, SOLOWIN HOLDINGS is a versatile securities brokerage company strategically focused on high-net-worth investors worldwide. It offers a wide spectrum of products and services, spanning from traditional assets to virtual assets through its advanced and secure one-stop electronic platform, Solomon Win.\n\nExperiencing robust growth since 2021, SOLOWIN HOLDINGS distinguishes itself through its subsidiary, Solomon JFZ (Asia) Holdings Limited (“Solomon JFZ”), licensed by the Hong Kong Securities and Future Commission. Solomon JFZ empowers the company to deliver unparalleled one-stop financial solutions to both individual investors and corporate clients. The diversified offerings include Securities Brokerage, Investment Banking, Asset Management, Virtual Assets, and cutting-edge FinTech Services. For more information, visit the company’s website at http://ir.solomonwin.com.hk .\n\nStory continues\n\nForward-Looking Statements\n\nCertain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations and projections about future events that the Company believes may affect its financial condition, results of operations, business strategy and financial needs. Investors can identify these forward-looking statements by words or phrases such as “may,” “will,” “expect,” “anticipate,” “aim,” “estimate,” “intend,” “plan,” “believe,” “is/are likely to,” “potential,” “continue” or other similar expressions. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations that arise after the date hereof, except as may be required by law. These statements are subject to uncertainties and risks including, but not limited to, the uncertainties related to market conditions and other factors discussed in the “Risk Factors” section of the registration statement filed with the SEC. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to review other factors that may affect its future results in the Company's registration statement and other filings with the SEC. Additional factors are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov .\n\nFor investor and media inquiries please contact:\n\nSOLOWIN HOLDINGS\n\nInvestor Relations Department\n\nEmail: ir@solomonwin.com.hk\n\nAscent Investor Relations LLC\n\nTina Xiao\n\nPhone: +1-646-932-7242\n\nEmail: investors@ascent-ir.com\n\n\n\n"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQd3JyS0g1ZE9KNGpleWgtZEN3MkhFVDJHQzBvOHVaNnpWdGxzV3RBV1BINHRUV1QzbmxrX18zRHdiNG1VTmdWNjVzMjhycDV0UFZaai1sQlNmblh4Ykg5Q3dVSGlvUGJ4MnlRUVg0dWh3Qjg3ZkhlVHZwRWlHNHR1QTF1dWdwY2hvb0NidnJEMU9tVGV2VWdIbXhoaFg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin pushes Tornado Cash alternative: ‘Privacy is normal’ - DLNews",
        "content": "GM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nThe restaking rush continues with EigenLayer and Karak launches.\n\nUpgradable code costs Blast DeFi users $26 million.\n\n“Privacy is normal,” says Vitalik Buterin after using Tornado Cash alternative Railgun.\n\nKarak challenges EigenLayer in restaking race\n\nEigenLayer just hit a new milestone on its restaking road map, letting those who have deposited tokens to the protocol delegate them to node operators.\n\nNode operators are individuals or organizations that let users delegate their restaked Ether to them. They then opt in to provide actively validated services, which earn delegates a boosted yield on their restaked Ether.\n\nDelegated tokens will secure EigenDA, the first of many protocols expected to benefit from restaking on Ethereum. However, restakers will have to wait a few more weeks to start earning boosted yields.\n\nAnd EigenLayer isn’t the only one. Karak, EigenLayer’s main competitor, has launched private access, letting those with an invite start to restake on the protocol.\n\nSo far, Karak has drawn in $195 million in deposits — still far below EigenLayer’s $12.6 billion.\n\nLike EigenLayer, Karak has launched its own points system, called Karak XP.\n\nJoin the community to get our latest stories and updates\n\nPoints systems usually indicate a DeFi protocol is planning to launch and airdrop a token.\n\nWith two restaking protocols offering potential airdrops, whichever one announces a token first should receive a big boost from the attention.\n\nPac Finance users lose $26 million in seconds\n\nA sudden, unexpected code change at Blast lending protocol Pac Finance cost users $26 million, highlighting the risks of upgradable smart contract code.\n\n“This was a result of the liquidation threshold being altered unexpectedly without prior notification to our team,” Pac Finance said on X.\n\nPac Finance is a fork of Aave, the biggest lending protocol in DeFi.\n\nA fork is where a developer team uses the open-source code from an existing DeFi protocol to launch a similar protocol — often on a different blockchain or with minor changes.\n\n“Fundamental problem with forking code is the lack of in-depth knowledge of the software and the parameters,” Stani Kulechov, founder and CEO of Avara, the company behind the Aave protocol, said in an X post.\n\nThe incident highlights the risk of upgradable code in DeFi protocols. If a protocol chooses to keep its code upgradable, those with permission can change the rules that govern the protocol at any time — often without warning.\n\nNot all DeFi protocols allow for code upgrades. Uniswap, Curve Finance, and many other protocols make their code immutable, meaning once it’s deployed on a blockchain, it cannot be retroactively changed.\n\nVitalik on privacy protocol Railgun\n\n“Privacy is normal,” Ethereum co-founder Vitalik Buterin said in an X post on Monday, responding to the fact that he had just transferred 100 ETH — worth about $310,000 — through privacy protocol Railgun.\n\nPrivacy is normal.\n\n\n\nRailgun uses the privacy pools protocol ( https://t.co/DekkatsMR5 ) which makes it much harder for bad actors to join the pool without compromising users' privacy.https://t.co/MG0huDzpAu — vitalik.eth (@VitalikButerin) April 15, 2024\n\nPrivacy is normal.\n\n\n\nRailgun uses the privacy pools protocol ( https://t.co/DekkatsMR5 ) which makes it much harder for bad actors to join the pool without compromising users' privacy.https://t.co/MG0huDzpAu — vitalik.eth (@VitalikButerin) April 15, 2024\n\nRailgun is similar to sanctioned protocol Tornado Cash in that both allow users to break the chain of traceability between blockchain transactions.\n\nHowever, Railgun uses the Privacy Pool protocol, an idea put forward in an academic paper co-authored by Buterin in September.\n\nPrivacy Pools tries to solve the issues with Tornado Cash — namely that it has facilitated an estimated $1.2 billion worth of illicit transactions for criminal organisations such as North Korea’s Lazarus Group.\n\nIt lets honest users create a cryptographic proof that shows the money they put into the protocol didn’t come from wallets associated with stolen funds or illicit activity, while at the same time keeping the origin of the money secret.\n\nThe hope is that if all honest users generate these proofs, bad actors attempting to launder money through the protocol will be the only ones left without them, letting crypto exchanges and law enforcement identify and exclude these users.\n\nData of the week — Railgun overview\n\nPrivacy protocol Railgun’s popularity has grown, even before Buterin mentioned it in his X post.\n\nRailgun has facilitated almost $1 billion in transaction volume since its launch in May 2022.\n\nrailgun Railgun is processing more transaction volume in recent months. (@railgun_project)\n\nThis week in DeFi governance\n\nVOTE: Uniswap DAO votes for Manta Pacific onboarding package\n\nPROPOSAL: Arbitrum DAO wants to activate the blockchain’s Stylus upgrade\n\nVOTE: SafeDAO votes to make its SAFE token tradable\n\nPost of the week\n\nPseudonymous crypto trader GCR made their first X post in almost a year over the weekend as Iran’s drone attack against Israel jolted the crypto market.\n\nGCR is one of the most revered crypto traders on X, building a strong reputation by making numerous accurate predictions.\n\nWhether you buy into their takes or not, GCR’s posts have the power to move markets and sway sentiment — so they’re definitely worth paying attention to.\n\nIf you've been sidelined, believe this is a good opportunity to scale into high conviction tokens\n\n\n\nIf you're fully invested, just survive, hold your spot positions and do not capitulate\n\n\n\nSomeone once said, liquidations are a forced transfer of wealth from traders who need… — GCR (@GCRClassic) April 13, 2024\n\nIf you've been sidelined, believe this is a good opportunity to scale into high conviction tokens\n\n\n\nIf you're fully invested, just survive, hold your spot positions and do not capitulate\n\n\n\nSomeone once said, liquidations are a forced transfer of wealth from traders who need… — GCR (@GCRClassic) April 13, 2024\n\nWhat we’re watching...\n\nGM\n\n\n\nTether's tokenisation platform will soon be available to everyone.\n\nA masterpiece.\n\nFully non custodial.\n\nMulti chain.\n\nMulti asset type.\n\nSuper customizable.\n\n\n\n+T — Paolo Ardoino 🍐 (@paoloardoino) April 14, 2024\n\nGM\n\n\n\nTether's tokenisation platform will soon be available to everyone.\n\nA masterpiece.\n\nFully non custodial.\n\nMulti chain.\n\nMulti asset type.\n\nSuper customizable.\n\n\n\n+T — Paolo Ardoino 🍐 (@paoloardoino) April 14, 2024\n\nTether CEO Paolo Ardoino hints at his firm’s new tokenisation platform.\n\nThe move comes on the back of BlackRock’s tokenised fund BUIDL, which has attracted almost $300 million on Ethereum.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUjVBTTM1TkY1UmZ5aHBuOHZrWEd5RC13WUROZ19vVEE2Z2dTNUtFVFVDV0pmVHVtNEdIYnhoWjVBZnJIOHoyVGFXLU1wY21wUGZjTlE4T1gtWUdEaU05bG4zcF9nZDl1RmNLMlpXRzNJTi0tWGtROHl6QWRUM1A1NTVRd3pvZ0Ez0gGQAUFVX3lxTE1vUzl2MXczRjA2WGtHR01YTXdfTnRCaEpSTTU3U0h1aGZLWUZNZkpyU1lJUjdyZWVaeXJOalZSYXRCRW82enlQMDZ0M185VzBpdzZ4Rjk0QUs0WHJVWTZBYjR1LUE3cFBtU1psMnVyM2VJNUxXajRVSkFuRnpSODdLLV9ZZUhBNlg3VkhISkwxag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Saga Reveals Massive Airdrop With Ethereum, Solana, and Avalanche Projects - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGaming-focused layer-1 blockchain Saga has announced an airdrop campaign so huge, the team is calling it: Power-Level Over 9000! It’s a “Dragon Ball Z” reference that spawned a memorable internet meme, and now it’s conveying the scale of this sizable rewards push.\n\nIn partnership with over 100—not quite 9,000—projects and games across various blockchain networks, users who stake their SAGA tokens will be eligible for bundles of token and NFT airdrops “over the coming months,” the announcement says.\n\nEach airdrop is grouped in “vaults” that feature multiple projects giving out various prizes. Notable games across various chains, such as Avalanche first-person shooter Shrapnel, Ethereum metaverse game The Sandbox, and Ethereum racing game Wilder World are all involved in the campaign, with more to be announced.\n\n“At Saga, we take immense pride in fostering collaboration and unity within the Web3 gaming community,” Saga said in the announcement, “With partners hailing from diverse ecosystems, including Ethereum, Solana, Cosmos, Polygon, and Avalanche, our airdrop campaign serves as a testament to our unwavering commitment to bringing the Web3 gaming community together.”\n\nAD\n\nAD\n\nWhile there are projects outside of the Saga ecosystem participating in this event, the “majority” of drops will come from “chainlets” that use the Saga network.\n\nSaga is a layer-1 network that enables developers to launch their own layer-1 chains, instead of deploying projects on the Saga mainnet. The chains that developers launch are called chainlets and can support other chainlets within the Saga network.\n\nThe fresh-faced layer-1 network made a name for itself with its previous airdrop campaigns, which led to a record-breaking $13.4 billion staked on Binance to earn SAGA token rewards.\n\nAD\n\nAD\n\nLast week, Saga launched its mainnet alongside its token listing on major cryptocurrency exchange Binance. This new airdrop campaign is its first big marketing push now that the token is live.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPOXNxajhlVGJITnFzRVpEOW1UeW44ejlSWVdHVWVJSzJTQnJ4TVA5Um9VSEYtc0dsaE5oX3REejF4aWVHY1YtZU0yNGU5d3h5a1QxVXlLMU9qd3luZmZHQXdUcklsLU9Gd0R1Z3dESGstcXJPSFFYQUFhbEw2SERFZm9xck00eG11TUxQRmV3cV9OY3ZCX1o1YV9odm4tQUs3SnVYclNaNjhBcGVvTGwyWmc3c9IBuAFBVV95cUxPYnhTcGFmYXRkWXJFaTFXeXVKVVhrdklDUXA2dmE5SlBQc0JiaG9WeHVpOG9OYi1Dc1pPRXUyMTZ1WkVIMjc1X0pYSFcyV2Nac25CNldMVE1kc2JTZG1jVmhBZG5JOW13NFdPeEpBa3EycmNrdU95a0pOaUJKQWpGQ0NxRzZ0d1N6MUgzWUwzV3hFbmtoNHVZTUpLS294SjFYTkZDaW5faldjaUM2TTNnUkcxU04tNFox?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Secures $3,000, Cardano's (ADA) Dramatic Drop Irrelevant, Will Shiba Inu (SHIB) Recover After 30% Plunge? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCardano has witnessed a substantial drop to the $0.4 region, suppressing the price by over 20%. Despite the dip, the ascent suggests a potential rally through the 200 EMA, challenging the downtrend with limited volatility and apathetic trade volume.\n\nCardano's price action has been a roller coaster, with its recent plunge to the $0.4 support level and a subsequent bounce back. At the time of writing, ADA has seen its value soar above $0.48, instilling a fresh wave of inflows into the market.\n\nIt is noteworthy that the descent has not influenced the coin’s longer-term trend, which has been bearish with an absence of significant volume — a hint that the market is still in search of a solid direction. However, the surge above the 200 EMA will push the coin into the bullish zone once again.\n\nIf ADA fails, the $0.4 level remains a crucial bastion of support, and its endurance will be critical in preventing further declines. However, if the marketwide recovery continues, there is a good possibility of a prolonged continuation of the rally.\n\nAdvertisement\n\nShiba Inu takes hit\n\nShiba Inu has seen a sharp 30% decline. But one way or another, the only question in most holders' minds is: \"Will Shiba Inu really recover?\"\n\nThe token's dip to the $0.00002165 mark has been met with a mixture of concern and anticipation. A rebound from this level could signal a strong support base, potentially pivoting SHIB back into an uptrend.\n\nAs for the chart, the Bollinger Bands have been preceding the drop as their narrowing was a strong signal of an upcoming price surge. Now, with SHIB having slipped below the crucial 50-day moving average, the only thing left is to wait for a return above this aforementioned level.\n\nThe trading activity is pretty quiet, which shows that people are not too confident about SHIB right now. The RSI is suggesting that selling pressure prevailed over buys on the market, pushing the value of the token down.\n\nSHIB will face its first big test at the $0.00002880 level. If it can go beyond that, we might see the price move up toward $0.00003.\n\nAs for what's next for SHIB, it is really tough to say, considering the lack of fundamental development around Shiba Inu. However, there is always the possibility of a further price reversal and the return of the buying power on the market in general, which is going to push the value of tokens like Shiba Inu further up - especially if the risk appetite among investors returns.\n\nEthereum's comeback\n\nEthereum has made a strong and sufficient comeback, easily returning above the $3,000 threshold. The pivot suggests that Ethereum could continue its path upward despite this minor setback.\n\nFollowing the dip that moved the market, the price action has been affirmative, reclaiming the $3,000 mark with conviction. This level now forms a bedrock of support, cementing the current price range.\n\nSpecifically, the key support at approximately $2,700 is highlighted, a level where the asset has previously beaten the substantial buying pressure. The resistance can be found around the $3,600 zone.\n\nAs the price started rising, the volume started moving up, showing a lot of interest on the market. This rise in trading, along with the clear increase in price, has helped the upward trend to gain strength.\n\nThe intersection of technical indicators with market sentiment heralds a bullish scenario, where the previous peak at approximately $3,950 is not unreal.\n\nHowever, the most recent surge of volatility on the market might not go unnoticed, and it is important to avoid any risky moves that might drastically affect your portfolio."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPbTRSaWVYN0Nqc1VsLXUwSndzTWY2MGJYeW5iRkRJLVFHejc0ZUh6d1F5ekZ3cHNYTlFxNlpWZzhqM3NwME1RcTFoM1VGb05vYWN2bHNiNjk4cUlxZl9XWFcwM0hkVXo5RTFHUXhsN3ZPVU04MFY2aFRFYTFBTExCMGlBSEstcXBGOXE0cdIBlAFBVV95cUxPcGNfeWtHQzl3Y252Sk1obnhDVGMybVRpYUl0ajV6TUFsM2g5NzUyNTdmaXhWTG01VEw1a2QyYUV1MFVVbWc3SUxxRkZ6Ulo0ejBBdDl5eFBWdDlhZDA0Qm00MVFEbHc0T0pDbXkwWnVobldBWGpaX01WUTZtdy1MZklrZmxveG9yUVZ2SlQ4N0tQRnJw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "ApeCoin Nears All-Time Low as Bored Ape Ethereum NFT Prices Plummet - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nApeCoin, the Ethereum-based token tied to Yuga Labs’ namesake NFT collection, is firmly in the doldrums alongside its Ape-themed analogs following a tumultuous week for the broader crypto markets.\n\nThe token has slipped 30% over the past seven days amid market turbulence sparked by growing geopolitical tensions in the Middle East. Extending losses over the past year, the price of ApeCoin has plummeted 74% since this time last April to a current price of $1.19, according to CoinGecko.\n\nApeCoin’s brush towards its all-time low price of $1.01 (set last October) comes as the token’s official steward, the ApeCoin DAO, weighs several proposals from community members. Notable initiatives include establishing a “dominant presence” at an upcoming NFT conference in Portugal and a rewards app for ApeCoin and Yuga NFT holders.\n\nMeanwhile, the Bored Ape Yacht Club’s floor price, representative of the cheapest NFT from the collection listed for sale on a marketplace, has fallen 67% over the past year to $33,000 (11 ETH) from $103,000 (52 ETH), according to data from NFT Price Floor.\n\nAD\n\nAD\n\nThat leaves the floor price for Bored Apes within 1 ETH striking distance of other notable PFP collections, including Pudgy Penguins, CyberKongz, and Grifters by XCOPY—despite broader headwinds in the NFT market over the last year-plus.\n\nPublished at the exact BAYC top pic.twitter.com/xFBSzdR0JP — UubzU (oob-zoo) (@UubzU) April 15, 2024\n\nThe Bored Ape Yacht Club became synonymous with NFTs as pricey, digital status symbols in 2021 and early 2022. And as Yuga Labs’ Otherside game took aim at the metaverse, for example, Bored Apes peaked in floor price, reaching a minimum price of 152 ETH, or $429,000 in April 2022.\n\nApeCoin is expected to be the de facto currency for Yuga Labs’ new projects, including the Otherside, which has held limited playtests but has yet to open up to players on an ongoing basis.\n\nAD\n\nAD\n\nIn February, Otherside General Manager Eric Reid addressed the project’s pace in a blog post, acknowledging that “people are skeptical—if not downright pissed—from the lack of regular information on Otherside.”\n\n“Building something like Otherside is measured in years, not weeks or months,” he continued. “Building the platform and refining our long-term vision has been challenging.”\n\nEarlier this month, the Bored Ape community was confronted with a cultural loss. Two years after it opened, the Los Angeles-based burger joint Bored & Hungry shuttered its doors, hanging up its hat—for the time being—on monetizing IP from the NFT collection in the United States. But there are locations still open in Asia.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNelhqOHd1aHN5LVZLQnZBejMweE1KNHF5TUxkaWxBWVR2OTlodmNSU0szQjVzajRqNnhDV2UxcXRrbEl2MlVFNFJHSjBWU2NnNk9BZkdIY3pxQ3dZQjBLNVdaanFsQXozUW9KbnJKWm9KOXgzMXFtY1VCSmpNODNWanMzSERRcU1OZW9jNTRNWWtVQdIBlwFBVV95cUxPQ1BENDdPN2YtbHVjbjl4Q0VOWlZ2LVRoeU5FREdmSk1ITkUzVU53RF9UN3hULWx4TWQ3WUl1Y3V2elU1WkMzX3c5VlRyT1RYWTFiUnVOY3RVb1lMTW5QMlVkak5oSF8xRmtzd1lNWGV1dG5jR0d2d1R1cUZjSDZkWWhGcEJDd21yYkdVNFI1blVDemJjTlJv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Witness $126 Million Outflow, CoinShares Report - CoinGape",
        "content": "The past week witnessed a significant downturn in Bitcoin’s weekly inflow, which dwindled to $126 million amidst heightened market volatility. This decline was largely influenced by the prevailing uncertainty surrounding Bitcoin halving and escalating geopolitical tensions in the Middle East. These factors collectively exerted notable selling pressure, causing Bitcoin’s price to plummet to a low plummet to a low of $61,600. The ripple effect extended to major altcoins, exacerbating the correction across the cryptocurrency market.\n\nCoinShares’ latest report provided insights into the evolving landscape, particularly highlighting Bitcoin’s cooling inflow compared to previous weeks. This contrast indicates a subtle retreat in investor participation, reflecting a degree of apprehension in the market. Conversely, Ethereum continued to face challenges, marking its 5th consecutive week of outflows, with $29 million exiting the market. These trends underscore the volatility and uncertainty prevailing within the cryptocurrency ecosystem, necessitating caution and strategic decision-making among investors.\n\nadvertisement\n\nRegional Disparities and Investment Trends\n\nRegional disparities were evident in cryptocurrency investment trends, with the US witnessing the largest outflows totaling $145 million, followed closely by Switzerland and Canada. Despite these outflows, Germany emerged as a notable exception, capitalizing on recent price weakness as an opportunity for investment, with $29 million in inflows. This divergence highlights varying investor sentiments and strategies across different regions in response to market conditions.\n\nDespite Bitcoin experiencing outflows amounting to $110 million last week, it maintained positive inflows month-to-date, showcasing resilience amidst market turbulence. Furthermore, while altcoins, excluding Solana, exhibited positive performance, with lesser-known names like Decentraland, Basic Attention Token, and LIDO attracting inflows, suggesting diversification strategies among investors seeking opportunities beyond Bitcoin.\n\nAlso Read: Ordinals Hints At Comeback Amid Bitcoin Halving And Runes Protocol Launch\n\nDigital Asset Investment Products and Investor Sentiment\n\nDigital asset investment products faced minor outflows totaling $126 million last week, indicating a degree of caution prevailing among investors amid stalled positive price momentum. This cautious sentiment was further reflected in the drop in ETF activity relative to the overall market, underscoring investor hesitancy in committing to cryptocurrency assets.\n\nHowever, amidst this cautious sentiment, short-bitcoin broke its 3-week spell of outflows, garnering minor inflows of $1.7 million. This move suggests a strategic response from investors possibly seeking to capitalize on recent price weakness and market fluctuations.\n\nAlso Read: Germany’s Biggest Federal Bank Partners Bitpanda To Offer Crypto Custody\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQLU0tbVdXTUdPU3dmelZqNEx1dWFpeWtGdXM3MFdQdXJNOGpadzBOcGxwYUg2SDF5V3VQTHZaVm5CMGlmZHppSTdKVjRBVkRDOHg3US1DVHZ1cmtybm9LdTNyenphX3hsMkRCUy1kY181TENmRDBSUEpnNmdVMXk0eWRkSU1KTGdwOWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Approves Spot Bitcoin and Ethereum Application - Watcher Guru",
        "content": "Hong Kong has approved spot Bitcoin (BTC) and Ethereum (ETH) ETF (Exchange Traded Fund) applications. The region is the second to do so in 2024, following the SEC’s (Securities and Exchange Commission) historic decision to approve 11 spot BTC ETFs in the US. However, although the US has approved 11 spot Bitcoin ETFs, the country has yet to greenlight an Ethereum ETF. According to some analysts, a spot ETH ETF could be approved in the US later this year.\n\nJUST IN: 🇭🇰 Hong Kong approves spot #Bitcoin & Ethereum ETF application. — Watcher.Guru (@WatcherGuru) April 15, 2024\n\nAlso Read: 3 Cryptocurrencies to Buy Before They Hit the Big Post Bitcoin Halving\n\nThe approval of spot ETH and BTC ETFs may lead to another rally for the cryptocurrency markets. The US spot BTC ETFs played a significant role in BTC hitting a new all-time high earlier this year. BTC hit $73,737 in early March with a rally fuelled by increased inflows into spot BTC ETFs.\n\nWill Bitcoin and Ethereum rally after the ETF approval in Hong Kong?\n\nSource: Bitcoinist\n\nGiven that the US spot BTC ETFs were responsible for BTC hitting a new all-time high, there is a high probability that a similar pattern will unfold after the Hong Kong approvals.\n\nAccording to CoinCodex, Bitcoin (BTC) will reclaim its all-time high later this month. Moreover, the platform anticipates BTC to continue on a bullish trajectory for the next few weeks, predicting it to hit $85,906 on May 13, 2024. Hitting $85,906 from current levels would translate to a growth of about 32%.\n\nOn the other hand, CoinCodex anticipates Ethereum’s (ETH) price to consolidate at around current levels, predicting it to trade at $3242.95 on May 1, 2024.\n\nWith Bitcoin’s (BTC) halving just around the corner, we may witness another massive rally in the crypto market. Both Bitcoin (BTC) and Ethereum (ETH) could hit new all-time highs, fuelled by the Hong Kong spot ETFs and BTC’s halving later this month."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxONk1xWVNwbVoyckUzWVRhXzdVZTFoNW1ZTTcxTGo0eG9zQ3lsbTZjSWdfTDdKMmdZOG11d1F0MkJBLTNUSHNCZmVzZnBvd2FJdjFlTGpfSkQ2VFdYRGZySTJ0Tnhsd3VpSzM1QV9oOTZKRHZ6VlJDbUZ4LTdEY0Z4X2FmVC1XbXA1djVZYVZla3BFWHB0U08taW83SktuNDZnMGwwTWQxVjU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin Makes Waves with 100 ETH Railgun Deposit - Crypto Times",
        "content": "Ethereum co-founder Vitalik Buterin has recently made a notable transaction by depositing 100 ETH into Railgun, a decentralized finance (DeFi) platform known for its privacy features. This move, involving approximately $330,000, was noted by blockchain monitoring tool Scopescan on April 15.\n\nThe transaction was executed through Buterin’s well-known ENS-tagged wallet, vitalik.eth, marking another instance of his engagement with the protocol over recent months.\n\nMarket Reaction to Buterin’s Deposit\n\nFollowing Buterin’s deposit, the crypto community saw immediate financial effects. Railgun’s native token, RAIL, experienced a sharp increase, climbing over 120% in value. This surge reflects a recurrent pattern where the endorsement or participation of high-profile figures like Buterin can influence market dynamics. Buterin’s involvement with various Ethereum-based projects continues to impact their valuation and investor interest directly.\n\nMoreover, in response to the discussions surrounding his latest transaction, Buterin stated, “Privacy is normal,” emphasizing the importance of secure, anonymous transactions without compromising security. This deposit highlights the ongoing interest and development in DeFi platforms offering such features."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNYWtzNkpvSkRGdFdLR2F6V1BHYTZEdUU4VVZqZ1M3UFU3SkNlRmttNkNOS2ZjMDUtSVNBa1FOdEN2bE5hTVhKZW55b1hXXzB2LUc4bXVuYTJPTW5HRW44cXVEOUFrLS1jdXh0dTl4RXNZWkw5akJhVDNidTVtam1XYk9FTVZXblBtcmh2SkNOd9IBlAFBVV95cUxQenE0V01yYV9Qd1AxVGtGd0FNM3otUmJnSlplREpJN1FRY3BZYkdON2dSSjVFUGVvWWJ1MmNfemFUZFZGMTZBRzVpdWdMX3Nqd0Y2bVJEUnlRVlhhazJEbkpDSzZVYVZvWi1OVm02QmxOQ1lmNE05NFBUYWZIb3dQN05ONTkxell0ZGtHVndTTk1LeXVf?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Are Institutional Investors Losing Interest in Ethereum? - CoinGape",
        "content": "Ethereum (ETH) has fallen following recent crypto liquidations this week. While most outflows can be attributed to the general market sentiment, institutional funds play a major role in the asset’s wider acceptance.\n\nThis year, the United States Securities and Exchange Commission (SEC) approved spot Bitcoin (BTC) ETFs which saw an inflow of traditional investors in the market. Spot ETFs also gave the asset more legitimacy amid initial fears and uncertain regulation.\n\nadvertisement\n\nSpot ETFs rallied the market pushing the price of the asset to an all-time high above $72,000 with bulls making higher projections. These inflows to Bitcoin and crypto assets turned institutional investors to Ethereum.\n\nReduced Institutional Flows\n\nThe clamor for a spot in Ethereum ETF garnered steam this year after multiple filings to the SEC. Institutional investors see the staking feature of Ethereum as a bullish driver for the asset price. Secondly, being the largest smart contract network, on-chain decentralized finance (DeFi) activities will surge the asset’s price.\n\nHowever, the price of the assets has plummeted in recent weeks and its existing institutional products have seen sharp outflows. On April 15, a report from CoinShares showed a $22 million outflow from Ethereum last week. These flows bring total monthly exits to $51.3 million. However year-to-date flows stand at $23 million.\n\n📉 Last week, investors were hesitant as the positive price momentum stalled. Digital asset investment products experienced minor outflows, totalling US$126m. Get our insights in our full report as well as more data by region, issuer and asset: https://t.co/dkMoXGWfw1 pic.twitter.com/H5qjaasbuR — CoinShares (@CoinSharesCo) April 15, 2024\n\nMost commentators suggest that the AUM for Ethereum isn’t moving as fast as Bitcoin last year when the market leader gained ground while anticipating spot ETFs. Bitcoin’s AUM soared with its price in Q4 2023 while Ethereum’s products are at $13.8 billion despite widespread anticipations.\n\nEthereum Price To Recover?\n\nThe price of Ethereum is down due to macroeconomic factors and reduced sentiment but institutional flows have contributed to the status quo. At press time, Ethereum price is at $3,052, a 13% drop this week and 15% this month.\n\nBulls maintain optimism of a possible run should spot Ethereum ETF get approval in the United States. Similarly, a general market uptrend will boost institutional inflows in Ethereum because of a ripple effect in decentralized finance activities.\n\nAlso Read: Solana Wins The Bear War, Enters In Top 5 Cryptocurrencies: What’s Next?\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZ3JHbmVDNG1fTHNpQWdBYVAwU2FvVTRFd2N6VTVYcllNck5mMGhZU0JuMGdLOS1XRl9aX2ZtYXlhdjdNaGNhSEF4QU1kVktXOFl1RWtKejBJTG9OeG9BVk1HNzhscVllZ25TcC1Cc0hheF9ha0RETnFaMGt5MHlDeEZ1SVh6d1hHT3Z0SA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "China To Carry Out Bitcoin, Ethereum, XRP Price Inflation: Report - CoinGape",
        "content": "China may be about to explode in XRP, Ethereum, and Bitcoin prices with the latest launch of ETF. Forbes reports that crypto investors already anticipate that Hong Kong and the United States will battle for cryptocurrency inflows into their respective funds due to the revelations.\n\nChina To Inflate BTC, ETH, and XRP Price\n\nBosera Capital, Harvest Global, and China Asset Management have announced that they have received approval to sell spot Ethereum and Bitcoin ETFs in Hong Kong. Forbes highlights that crypto investors already anticipate that Hong Kong and the United States will battle for cryptocurrency inflows into their respective funds due to the revelations.\n\nadvertisement\n\nThe demand that these ETFs are going to create might be way more than what is in supply. This could create a surge in price for Bitcoin, Ethereum, and even XRP.\n\nRead Also: Bitcoin’s Funding Rate and Resistance Threatens Price Rebound\n\nBitcoin ETF’s Success in The US\n\nForbes states that over $50 billion in assets under management have been drawn to the fleet of new spot Bitcoin ETFs allowed by the U.S. Securities and Exchange Commission (SEC) in January. Ever since the approval came, investors flocked to gain exposure to Bitcoin after ten years of application denials.\n\nWith assets under management of about $15 billion and $9 billion, respectively, Wall Street behemoths BlackRock and Fidelity have emerged as the two biggest of the new Bitcoin ETF issuers.\n\nWith the success of ETFs in the US, the likelihood of these ETFs performing exceptionally well in Hong Kong is being priced in by market participants.\n\nWill Mainland China Purchase Bitcoin ETFs?\n\nAs of right now, the territory is completely prohibited from cryptocurrency in Mainland China. Thus, at this point, it appears unlikely that it will have access to Ethereum and Bitcoin ETFs that are listed in Hong Kong. Hong Kong issuers have confirmed that regulatory restrictions prevent mainland Chinese funds from purchasing exchange-traded funds (ETFs) related to cryptocurrencies.\n\nRecent correspondence from ETF providers headquartered in Hong Kong has dispelled myths regarding the financial acumen of mainland Chinese participants in the Southbound Stock Connect program. The Southbound Stock Connect program, which was created to promote cross-border investment between mainland China and Hong Kong, does not include digital currency products due to China’s position on bitcoin risk.\n\nRead Also: Mark Cuban Wires $275M In Taxes, Sends Crucial Message To Community\n\nNausheen Thusoo\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPY3AtNTBCQUt2a2VtVDlmVE15cFZjVkVkTmpYSy03WVBlMEhWMjRLQXc3cTFBMmFYVEVGTUVoMC1WWUxMWFFocW1qclFrb0wyQkE1MDlaaUstQzFjVmx3dzdZY3JySGgzMklSOVVJREEwMzFWWVVEa2RrdW05WWtVdEI5Sy1TeHU1ZGxnWHhWcHF4VDVK0gGaAUFVX3lxTE10Q2FfbFJOWXo1R3Z3M0JuOGxGOTNjNTlvWEJsSEEtTVF6VFZHWXY4N29zQVpMTUVRM2hxWjE2UEo5WHVWanRnbGtSR21lLXh3TElIbmpFZHFYZE0tXzV0RTFubW42TWIxRU1KUklVSGhyd1VwS1c5THJ1ZXhXbWFXQ2tzUXdubGFfM2hjS0Vid3AxZFBPTkVXc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum ETFs: Will Hong Kong get an edge with new approvals? - AMBCrypto News",
        "content": "Hong Kong has approved the first batch of spot BTC, ETH ETFs.\n\nSome ETFs will have in-kind creation and redemption features.\n\nHong Kong has followed the US steps by approving crypto ETFs tied to Bitcoin [BTC] and Ethereum [ETH].\n\nAt least three asset managers—Bosera, ChinaAMC (HK), and Harvest Fund—have received initial approvals.\n\nInterestingly, Gary Tiu, executive director at Hong Kong-based OSL Securities, noted that the approval could offer Asia an edge over the US. In a recent interview, the exec claimed,\n\n“Right now, the U.S. has not approved any spot products. So, the Hong Kong managers are certainly standing in a very good position when they launch the ETH products in Hong Kong for sure.”\n\nOSL was approved as the first sub-custodian partner for ChinaAMC’s BTC and ETH ETFs.\n\nIt is worth noting that the US spot ETH ETFs May approval odds have dimmed amidst the US SEC’s silence on the filings. But that’s not the only edge Hong Kong’s ETFs could have over the US.\n\nBTC, ETH ETFs in-kind subscription\n\nThe ETF product from Bosera, in partnership with HashKey Capital, will have an “in-kind” subscription. It means that users can subscribe directly to the ETF shares using BTC or ETH.\n\nAlternatively, investors can redeem their shares and receive actual BTC or ETH in return. On the contrary, the U.S. spot BTC ETFs only allow cash settlements on the underlying asset.\n\nInvestor and crypto market commentator, Simon Mow, highlighted the difference as an opportunity for Asia to accumulate more BTC.\n\n“The Hong Kong Bitcoin ETFs will feature in-kind creation and redemption. This is a move to one-up the U.S. ETFs. The race is on to accumulate BTC in Asia”\n\nAt press time, BTC traded at $66K, up 2.5% in the past 24 hours, per CoinMarketCap, a few hours after the approvals.\n\nHowever, Antony Scarramucci, Bitcoin maxi, and former White House executive, claimed that the development hasn’t been priced yet.\n\n“Hong Kong has approved Bitcoin and Ethereum ETFs. Not priced in.”\n\nVanEck analysts had previously said Chinese investors were behind the recent gold accumulation and price surge. Ergo, the analyst viewed the approval of the Hong Kong ETFs as a rallying force for BTC.\n\nBut, the ETFs’ first trading dates haven’t been disclosed. It is worth noting that the Hong Kong approvals show most parts of the vetting process are complete.\n\nThe launch and first day of trading will happen later and hasn’t been disclosed by the Hong Kong Securities and Futures Commission.\n\nEven so, Gary Tiu of OSL affirmed that the approvals show that the launch day is “very soon.”\n\nThe approval of spot ETH ETFs makes Asia a first-mover. However, it remains to be seen how the overall market will react to the ETFs when they begin trading."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxOSkdXVlRVME1CTHRDSDFaRkFrdkZMNWdRM0x6d0YzTHZQVXZsdnB1ZTktMVlNcGFoZkVxVFpRQUo0SUZpNVhfYkZZbWI2TkJJMUlyYlVURktXR1lmTHdNNEFqWS1rUEVqWjE0NTRvbWlTMkdXS3lhZW9FbUE4SDB0T2pIMjRWcG56VnhsbzJXRUFHZm8wU0J5a2dyRVp5S29VZjkzWG5MM2lPTnNHN2RJeTR1amJZN09fWFZMR2VIeWo0MVE4cGlPSHdvOGwwejJWVmxPVUVkYWx1NGZqM2dkMWVtZ1dua1ltMmZiUFpycjhaY1BhUWNYUW16YTVndllpbGhFX1lkRl93eVdqbjNvNDlBR0RtTElB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Approves Spot Bitcoin and Ethereum ETFs, Enabling In-Kind Redemptions and Anticipated to Energize Local Crypto Market - China Money Network",
        "content": "UNLOCK DATA\n\nSubscribe & Access the Best Data and Intelligence on Chinese Venture Capital and Tech\n\nRegister Now\n\nWant to read this important story?\n\nAccess thousands of news articles and data posts over the past 9 years!"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQSDFaazhVdFp5RDlUZGNVZ3VzREFObDUxSmFOTG5rOGZVaGhjQUNNb25DTENLUzE0dE50LTZQVjg5TTB0T0hSajh4d0tZR0Z0NWNXU1NlbjNsWU9ibmlQTGlodTJfellBYlJGUW45dGhtQ0dOeHZxdVhjazFUOUpENkhOV29MdTNRSC1nTlZjWdIBlAFBVV95cUxPelBiQ1hLUWVYSTNvTzFWa3RoS3ZNUUY0Vlp1ckpvWFVnamlYQ2FSWXROc2Z4SjE3NngtZmQ3cU9FalZSQ2YzTzVDNEdZZ0JlZmkxX1JxbnNvWHJXUkF4SFhROC1tY18yVHNER3RuWEttVkctRU9mRlItX2VfV1JEMzVieDZfbExnbWh6OGZzODhPcldz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum regains its groove? All about ETH’s 7% uptick in 24 hours - AMBCrypto News",
        "content": "ETH was up by more than 7% in the last 24 hours.\n\nMetrics and indicators looked bullish on the token.\n\nEthereum’s [ETH] massive price decline seemed to have come to an end as the king of altcoin’s price increased in the last 24 hours.\n\nIn fact, as per AMBCrypto’s analysis, things might turn bullish for the king of altcoins, which might allow ETH to recapture its lost value.\n\nEthereum is buckling up\n\nThe crypto market witnessed a crash on the 12th of April, which had a major impact on ETH’s price.\n\nThe downtrend pushed the king of altcoins’ price under $3k, which raised alarms and caused panic among investors.\n\nHowever, the last few hours witnessed a change in market trend as most cryptos daily charts turned green.\n\nSjuul, founder of AltCryptoGems and a popular crypto analyst, recently posted a tweet revealing that if ETH manages to go above $3,050, a bull run might begin.\n\nThe good news was that ETH managed to move above that level. According to CoinMarketCap, ETH was up by more than 7% in the last 24 hours.\n\nAt press time, it was trading at $3,257.33 with a market capitalization of over $391 billion.\n\nTo see whether this is the beginning of a full-fledged recovery, AMBCrypto checked Ethereum’s on-chain metrics.\n\nOur analysis of CryptoQuant’s data revealed that its exchange reserve was dropping, signifying a drop in selling pressure.\n\nUpon further analysis, we found quite a few other bullish metrics. For example, the token’s active addresses increased by 12%. Meanwhile, its transaction count also surged by nearly 10% compared to yesterday.\n\nAdditionally, ETH’s Funding Rate was green. This meant that long-position traders were dominant and were willing to pay short-position traders.\n\nWhat are the next possible targets?\n\nAMBCrypto then analyzed Ethereum’s daily chart to see the possibility of the token continuing its price uptick. ETH’s Relative Strength Index (RSI) registered a sharp uptick on the 15th of April.\n\nThe Money Flow Index (MFI) also followed a similar trend, hinting at a continued price increase. ETH’s price rebounded from the lower limit of the Bollinger Bands, further suggesting that the bull rally might continue.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nOur look at Hyblock Capital’s data pointed out quite a few levels that ETH might reach this week if the bull rally actually sustains. The first target for ETH might be $3.34k, as liquidation would rise at that level.\n\nIf a successful breakout happens above that, then ETH might as well touch $3.6k or even $3.8k in the following days."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE81SzZGMFY5V0ROOVA2OFNwZnJXamJHSEllUlJnbHo5Y3J2WWE2dmh2QV9MdWdfUWttQTQ4NGg3ME5GVzVNYXcyR3ZyWVdqYnhRbWNvaDZnQW10V2tUbG95aThQbUVqUF9tU1HSAW9BVV95cUxOWWJTZGVGa2JBaGZncEhKVmcxS2J1d3BlaEREdDBMU0tqUmEzXzNmaE1wT1NPYlhWMExYT0hhQ1NPWGsyX3JnR1VlbVQzM2NNbWw5clM5UmhSdlFLRWxLSlA1eGVkN2pLX1F3dTVqTW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum behind Render’s 18% rally? - AMBCrypto News",
        "content": "The token’s value increased, and so did ETH.\n\nRNDR’s popularity grew among traders, suggesting a significant price hike in the long term.\n\nRender [RNDR], the native token of the distributed GPU network built on Ethereum [ETH] jumped by an incredible 18.85% in the last 24 hours.\n\nThis performance made RNDR one of the top assets with the best recovery rate after the broader market experienced a drawdown. Interestingly, the bounce happened as ETH itself was able to reclaim $3,000 and rise above it.\n\nHowever, there were other reasons the price of RNDR increased. The first thing AMBCrypto noticed was the increase in social dominance.\n\nDid ETH “Render” help?\n\nAnalyzing data from LunarCrush, we observed that Render’s social dominance increased by a mind-blowing 116% within the same timeframe the value skyrocketed.\n\nThe increase in social dominance implied that the project’s popularity among traders surged. From our findings, traders were attracted to RNDR because of its fundamentals.\n\nAnyone conversant with the market would have observed that many market participants are bullish on projects with the DePIN narrative. DePIN stands for Decentralized Physical Infrastructure Networks.\n\nIn the crypto space, projects built around this narrative like Render, use tokens to incentivize holders who utilize the protocol.\n\nFurthermore, AMBCrypto observed another proof of the interest in RNDR. This time, it was the trading volume. According to Santiment, Render’s trading volume rose to 556.65 million on the 14th of April.\n\nThis increase represented a 37.72% jump from the value on the 13th. However, the volume decreased slightly at press time, indicating that RNDR might not have a solid backing to continue its upswing.\n\nSentiment stays the same\n\nDespite RNDR’s potential, it seemed traders were not yet convinced about its short-term performance. This was evident from the Weighted Sentiment analyzed on-chain.\n\nThe metric tracks the average positive or negative comment about a project. If the reading is positive, it means most market participants have a bullish view. On the other hand, a negative reading suggests a bearish perception.\n\nAt press time, Render’s Weighted Sentiment was -0.45. With this position, demand for RNDR might decrease in the short term. Should this be the case, the price of the token might fall below $9.\n\nBut that does invalidate the long-term optimism around the project. AMBCrypto concluded this after checking the amount of holders.\n\nOn the 25th of March, the total amount of RNDR holders was less than 80,000. However, that figure had increased to 85,600 at press time.\n\nRealistic or not, here’s RNDR’s market cap in ETH terms\n\nAn increase in the number of holders was a sign of traction on the network and adoption of the token. If this continues, RNDR’s price could head to new highs.\n\nHowever, it is important to note that there might be corrections in the process. But as long as the DePIN narrative remains relevant in the market, the token might be destined for a higher value."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOU2Z2ZlFHd2dKV1JfMXhWY05qbFpNS01tY014MHFuRldsakF5VVhiN2FYOXNIRmVfRFN0RFh6cE1SdFJGSUlyQVRUaVZpWjhHTlZ6TWFEWnRnQ0cyZkg4WThxSzZvRlY4Z1AwanJLbUFHTi1sdHRqZE5waVQwanFTZzdCSDZPZG1SR3VLcGh6VTVpcl9aemJGYThXTnVWMUIyZ1FmZHFIeFB5d1pHZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Finding Support Level at $3K as Bitcoin Halving Approaches - FX Leaders",
        "content": "eth-usd\n\nThe cryptocurrency market is eagerly awaiting Bitcoin halving to see what will happen to the values of key cryptocurrencies.\n\nEthereum (ETH) is up today but has lost much of its recent gains. The coin is hanging close to the $3K mark with a price of $3,076 (ETH/USD). For now, the coin is down 15% over the last month. That mirrors Bitcoin’s performance over the last 30 days as well- slightly up today, but significantly down overall.\n\nBoth coins have been struggling lately and may continue to do so unless the halving can inject some momentum into them. Ethereum’s trade volume is dipping, down 9% from the previous day, and many investors seem to be adopting a stance of wait and see what happens after the halving.\n\nHow Ethereum Could Hit $4,000 This year\n\nIf the ETH price is going to make it to $4,000 in 2024 as many industry insiders say, then a few key factors will have to work in its favor. The first of those is Bitcoin’s halving, which could give Bitcoin, Ethereum, and many other crypto coins a significant boost.\n\nNext, ETF approval for Ethereum could help it along as well, making Ethereum seem more stable, at least in one of its forms. ETF approval is still pending in some parts of the world, but a number of countries have approved ETFs already. The latest of those was Hong Kong, which gave the legal nod to ETFs on Monday. Because ETF approval is an ongoing process, we could see major ramifications for Ethereum all throughout the year from this sector.\n\nThere are also a number of cryptocurrency regulations in the pipeline that could be approved or denied, and these are proposed laws from many different countries. If some of those are passed in favor of crypto currency, Ethereum will be able to enjoy some positive press and greater consumer confidence."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQc19PNmNIRlJ4RE5nSkhyUWZ4aGRROEVFWUc5OVZHQTJuNnBZMFk0NmhqdHY0aE5vaGxDX3l4aFZTUXI2NE0tc09qc2ZKTEtGRXh3X2EtLVVrZ1lBTUk1R1FMS3hqRXZINThWNFh4N3Q3T1g1YVZiUnI4ZUd1ekktdUVuVXFlakhBNHNrbUl6RXp1MUh1STk5X0ZYRnMxSXFXSFVTdEN3TE93SHc1STBENEdGYnlKLVZSeXhxREw3RzkyZDdUOG1fYm9R0gHPAUFVX3lxTE9qTFozekhTSkI2bVU4RFdBbGZvcm01bm8zZlpkbU9vTGh5eko3Q1lZNTNYYm52WU9WQ1d2S3YxX09EZUVSXzloN3RCQ3p1RjlTQ2xia011VU40WURsZzl0SUhYV09JUE90eG5nSy1FUmo5MGtZN0lkZndzS0ljSWpYZnBncGI4bjQ2Wmk2czI3MUc5bTh0THd6aUs1d2pwNTNwOWo3NlpicFdHZTdySHRiS1ptQ1RmN3p5dU5Ed19IMUdfSUlIbFBTbzhnNEd5VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Will Solana (SOL) Beat Ethereum (ETH) This Bull Run? Top Analyst Says This New Project Going 10X is More - Bitcoinist",
        "content": "Solana has rapidly gained attention in the crypto market due to its high speed, low transaction fees, and scalability, setting it apart from Ethereum and other blockchains. These attributes make Solana a promising alternative for developers and users looking for a low-cost and fast trading experience.\n\nSolana and its community members are optimistic about the future trajectory of the project due to network developments. Ethereum has also undergone several updates in recent weeks. This article will discuss the current developments in the Solana and Ethereum networks and their market performance to access the next leading token in the upcoming bull market.\n\nSolana rolls out v1.17.31 update to solve congestion issues\n\nSolana (SOL) has been among the list of top-performing cryptocurrencies recently. With massive on-chain activity and transactions, the Solana blockchain has witnessed network outages several times indicating its expanding user base and market traction. With the launch of new meme coins, Solana’s DEX volume has surged to $1B again.\n\nTo overcome the congestion issues to hold large transactional activity on the Solana blockchain, Solana developers rolled out a network upgrade, version 1.18.11 on the devnet. After this initial step, on April 15, Solana announced the deployment of version 1.17.31 on the mainnet affirming improvements aimed at eliminating existing congestion issues until the official release of version 1.18 on the mainnet.\n\n.@Solana MainnetBeta validators: the v1.17.31 release is now recommended for general use. This patch contains enhancements which will help alleviate some of the ongoing network congestion, and will be followed by further enhancements in v1.18. Please upgrade when there’s less… — Anza (@anza_xyz) April 15, 2024\n\nWhales accumulate ETH tokens worth $278 million\n\nEthereum (ETH) has witnessed a surge in network activity as investors accumulate ETH tokens during the market dip. With the potential to surpass $8000 in the upcoming bull market, investors show optimism toward Ethereum’s trajectory. According to reports, whale transactions recorded $278 million worth of ETH tokens across various wallets.\n\nDespite the recent 8% correction in the $ETH price (24H), whales are still buying $ETH! 1. Whale 0x435 spent 70M$ USDC to buy 23,790 $ETH at ~$2,942 4 hours ago: • In total, the whale has accumulated 60,808 $ETH ($191M) from #Binance and DEX in the past 15 hours, after each… pic.twitter.com/ujZRULGAkX — Spot On Chain (@spotonchain) April 14, 2024\n\nThe approval of Ethereum ETFs in Hong Kong on April 15 marks a positive development for the Ethereum ecosystem. Moreover, Puffer Finance, a liquid staking project built on Ethereum’s restaking protocol has secured $18 million in funding to launch its mainnet. This technology allows Ethereum validators to reduce their capital requirement to just 1 ETH, significantly lower than the previous 32 ETH requirement.\n\nSolana vs Ethereum\n\nWhile both Ethereum and Solana are leading figures in the DeFi space, Solana has the potential to outperform Ethereum in the upcoming bull run. This is not historically impossible as Solana surpassed Ethereum in DEX volume amid the recent meme rally, a significant milestone for its ecosystem and community.\n\nWhile Both these legacy projects compete for the leading position, market analysts project another emerging deFi project which can outpace Ethereum due to massive potential much faster than Solana. DTX Exchange is a hybrid platform currently in its presale which is set to moonshot once it goes live in the main market.\n\nDTX Exchange is ready to lead the deFi space with $230k raised in presale\n\nThe emerging 1000x leverage platform, DTX Exchange (DTX) aims to revolutionize trading and investment with unprecedented trading features. The platform maximizes the profit margins and provides accessible trading to empower early traders.\n\nThe platform offers distributive liquidity pools to reduce slippage so investors can mitigate risks associated with concentrated liquidity, allowing trading across diverse markets including forex, crypto, equities, and CFDs.\n\nWith a robust infrastructure and unmatched security features, DTX Exchange provides an exceptional trading experience with no KYC fuss and non-custodial wallets so holders can trade freely with their digital assets across any exchange without the fear of security breach.\n\nThe crypto community eyes DTX as the next leading project in the deFi space after it raised expectations by raising $230k in public presale stage 1 within a few days. The presale price of $0.02 marks an ideal time for early adopters to be a part of a bright future with DTX, with massive growth potential and access to governance and mega airdrops.\n\nLearn more:\n\nVisit DTX Presale\n\nRead Whitepaper\n\nJoin The DTX Community\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxQb25lVjZfeG5mVE9UejR1bXhoRjJ0SzN4eVowaTNyMDZYdEpnb3N0RDhLUnV1QnBnSk5ZYXJ0bUh6aS1aTEs3ZzZxWnkwZkozUkZiQWhvSzNrY0lTMXlqeDFNQnBFejU5Q2N3ck9RQkFwQl84Yk80WEJYWFpwQi1GLVVKWjEwbndReVZCRl9iR2tkeDItNVpwWHpBaktybFZqZ1g2TXZJVl83LWpIVXQ0X1BtWWtRTV8zSTdkbUVjbGNZUl9hSFhwTUh0Yy1Uc2RCUXBwd1V5cDRqOExkV1RUTWJ6WTlJcVQxLV9vZlZudkxXRDA2anhobW42cUY3Z2tsaU5Wb1I4aWYzaU5ENmfSAZsCQVVfeXFMTk9VbjVabDJkOWNvS3A5cXFFZi04cnB3SkJfY1ZiRWR5bU14Ukxld09STUtyNUUwdExfSlFzbXN1bkZDamV2WTBwV2ZZUTBROUs1RmQzU3dOd1ZBMEpCVjhENmVhWnRaUUlhY20wZzZMTTdmaDlfdkZOcDdnUEtINDZGTDV6X1hLWkRXREFtTDlBRnRGR2pSaWZ1a1M3S2paMWdVQjFwb1Z5ZDhEbDliRkc4N2c4UHoyamlhYm5EOFV5MElLQ0JfNHhhaHFoMmFtQ3JNSmFFQWJzZlhNQ3l2VnFCa1hSOEtHcVBMd1lnOWc3SXhHTkJyNy1xb1FqN3AxT2t4bXRkVUJFVnNwWllhcEVxSVl2Z3N5U2pLUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) and dogwifhat (WIF) See Massive Leap; InQubeta (QUBE) Enters Final Stage of Presale, Tipped For 100x Upswing - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPYnJOY0pVb2lXRlB1RGVDNWNfSDBBVWxGVHpfZFNybWhtdmh0dEE3UVMzT0hES0R5ZkRHbnNOTThwOVR6YmFOZkMtNkNyM0RWRDFmX21hdGU5dmc4Z2JsOFNTZHM1ZllUcW1vTXB0S2wxTnNrbzNhTkEzREI5OXVVRXFoQW1KMVlCOUp1U1l2ZlJwb3NLcl90Zk93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong could become Asia’s crypto hub with Bitcoin and Ethereum ETFs - City A.M.",
        "content": "Hong Kong could become Asia’s crypto hub with Bitcoin and Ethereum ETFs\n\nAfter the weekend’s volatility due to the increasing conflict in the Middle East, crypto saw some positive news coming from Hong Kong yesterday. Bitcoin and Ethereum spot exchange traded fund (ETF) applicants in Hong Kong posted on social media that authorities had approved their applications. The region will be the first in Asia to offer spot ETFs. Is this the beginning of Hong Kong’s crypto dominance?\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nAfter the weekend’s volatility due to the increasing conflict in the Middle East, crypto saw some positive news coming from Hong Kong yesterday. Bitcoin and Ethereum spot exchange traded fund (ETF) applicants in Hong Kong posted on social media that authorities had approved their applications. The region will be the first in Asia to offer spot ETFs. Is this the beginning of Hong Kong’s crypto dominance?\n\nOn Monday, four China and Hong Kong-based asset managers stated they have received approval for their spot Ethereum and Bitcoin ETF applications. The “one country, two systems” principle uniquely positions Hong Kong as China’s bridge to international financing. However, tight Chinese government capital controls limit international investments in non-yuan denominated assets. Regardless, an exodus of capital has occurred in Chinese markets, as perceptions of China’s economic prospects remain pessimistic. Deteriorating profits for Chinese financial firms appears to be a catalyst for change. Asset managers are now more open to diversifying their product offering into an emerging sector, such as crypto, through enabling ETFs.\n\nOver the past 12 months, the Shanghai Composite Index is down by over 8%. In comparison, the US’s S&P 500 is up nearly 25% and Bitcoin is up by nearly 120%. Gold has also experienced recent appreciation, as it pushed to new all-time highs on Friday of nearly $2,400. Gold’s move has been driven by Chinese citizens according to John Reade, chief market strategist at the World Gold Council. Eric Balchunas also reported last week that Chinese buying pushed a gold stock ETF to a 30% premium before it halted trading. Evidently, Chinese demand for decentralised international assets, acting as stores of value, is high.\n\nHowever, for now, Chinese investors are still unable to legally buy crypto, even if the demand is there. China has seemingly banned crypto several times, with the 2021 ban still in place. Nevertheless, non-compliance has not stopped Chinese investors from stacking crypto. According to ChainAnalysis, from May 2022 to June 2023, Chinese crypto volumes reached $86 billion, with Hong Kong’s volumes hitting $64 billion.\n\nHowever, Hong Kong may have incoming crypto ETF competition in Asia. South Korea’s newly elected government has vowed to support Bitcoin spot ETFs. South Korean crypto demand is so high, Bitcoin is currently trading at a 7% premium on South Korean exchange UpBit. The exchange’s trading volumes also skyrocketed by over 172% from February to March. Let’s see who wins the battle for Asian crypto supremacy."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxONkNfVkVhQTQ3TEtYVUpOT1VDNy1Pdy1QVjExWU1NRm1ZbUlPdTVtTFBKeXRGOFlTem01Zm85VktkOUxTY2dUT2NNSWVZaENCUDZ5ckN4S3l0dXNyVUJhLXE5MVJYQ1lQTW1WU19NWWNGcTNkY0dCZ2JtME9MUkR4NGdpN2VhWVlNcXNPcDdjMlFZUmtyUzBnbmNUTDZpMDBJeTQwazExTTVBZlVpQjFqb2kwZklhNlpB0gHGAUFVX3lxTE5GcWZaQVJSYmhNUVVtZGxRQVptMkJQSUw3bTk2T0VUSlBOUmg0RTF1Z2d3ZkFoNGJqVDhuY2R1bzJucnpVLWF4MUNEX0I3WkdGRmZmcjVoc005MlY4ZWNjRnBUX0RNakljY3BlSVJ0ZXZ1OGIyUDFxMkNYdXJ0RFRnN0dmUmwwQkN0UDRRR3FkTzdXLWlwWlRwaXBQejBscFc3RktzT3kydXhIeWh6TW04ZkRaVzdFT1o1LUJyVWhMbU1sb3pCQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Solana Plunge As CORE Pumps 35% - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPbElmQXBwMGdYWUpZbUY5c0VBVW1kWS1OU0gyaklDdEdrZUZJY2RiYTMzS2RCekwyeF9XVXBCdWtnNjNOZTY4bkFtd1gtS0ZKdmJrVTdHX1Q5VUlSM2s1OUllRUtPVzFzeFZrTzdBNGVIanI0cHcwblRJNlJ5R3NaS2RzTHAzaUtvcXhkVlBSaHNUYmpUcllsdFJHUWdQbTdBX1BjeVdMSHF2WkpEX2NBSDdkTnh4ekxEenRTUktSS0FmbkNIZDIyR1RPcV82ZUM1aThlcEhpT2ZkWXPSAegBQVVfeXFMTnJjVlFIN1dYdjRzLVcyb2pnQ0hKR2Q4TVBINHhZU19ZTmZtZlB1Sy01U2pBODMxVU16NURjSmU0Rm1BWG81NjNEenhIRDNXVjFpRmY5ekdOX2wzS3R3djZyRmNwUTRjNWlGd1IzbjRxXzNnVnBSS0h2SGRxcW50dTBNRlVxUkNGYnZrb1l1aUU0NmhmS19nc1ItNmJZX1F3Slc5UnUyQW5zNEY1Zkx4WEZTQjRkWlQzNjFOVzFqOVNvOVlpWlFOQ1FuYnQzcmhCdGJ1NE9sZU9HdGltVlhJZG5ELTd6RVFUUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP Price Prediction For April: Huge Gains on the Horizon? - Analytics Insight",
        "content": "The presale we are referencing broke all sorts of records when it reached its hard cap of $10 million in less than two weeks(!) as investors immediately fell in love with the meme coin. It begs the question why this meme coin? We have had lots of Dogecoin alternatives before so why is Dogecoin20 the one that looks like it is going to be the one to finally challenge Dogecoin (DOGE)?"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOQUY0bmFtRUJRMXdSMXZCQ2d5enpEYnBJU1FKZXMyc1lZUUUycF9OTnl3YzhjUXp1SUg0UkdlZmVoNFlwOE05UnAtQ3hWaGhuRXFGYlF6M0xRd2VLam1XbXI5aWxiT19BRFNEb2ExV2VwRmRjbEJhdzFmUVlnb1BSU2JPaHJZWHAzYXdVdVBSOXNPU1Bscy02cnc5RGs0am13UGFTS2F3VlFOSnN3Zmg0bk5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong approves first bitcoin, ethereum spot ETFs - The Star Online",
        "content": "SHANGHAI: Hong Kong's securities regulator approved the first spot bitcoin and ethereum exchange traded funds (ETFs) on Monday, a milestone on the way to becoming Asia's first city to accept the popular cryptocurrencies as a mainstream investment tool.\n\nIn separate statements, the Hong Kong unit of Bosera Asset Management and China Asset Management said they had received regulatory approval from the Hong Kong Securities and Futures Commission (SFC) to launch the ETFs.\n\nThe step comes just three months after the U.S. launched the first U.S.-listed ETFs to track spot bitcoin. The U.S. launch set an example for other regions as it has already drawn roughly $12 billion in net inflows. - Reuters"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxPTThrNDY4eW1aNE9iTnZ0elIwcTZXNGlrMERKSXk2cnFkcWFQVWVKeU4xNGN4QmNWMVIyV3NxWkVsMUNrRmtid25wWjRoTkZVcXhpQlo2YWVPcUhzZEN0VU1KOGpPLXBKanVqaEduMFgyelZYN1B4akNNX1BXMTRPWHJYUkRVYldmaXVGT3RHb1dJODFzYnJhdFdMVGlhamxIZ0Q3TUs4SkdWN1ZtUFJja1ZqbjhxVHh4QnhYU0tnUHc5aUcxZlh0cXQ4LUJ6d0FzLW5GWEsxakFPM2FlLTJ5bTY4SlBXekF2TXpPNHhUN3VjaUluQUxock5acWxoeDc5TVdoRtIBkgJBVV95cUxQcURkaHJTSE9iWWJZS0dxZHREYk9nTWNVc3I4NDNSVmp6dEh5VDYxRWVvc2F1RDYtSlhyVTEtQXYwWnhlcEZ2M2V1SUtoVDdPYWlKR2dydFRndGF4Qk9ucGJRVGdVSWVYTUpuNjJiYkZoQ0tOMk5POWJMYWxXN2tUVjlIUFE5bDJaT0kxV1dRWFI2SGVBVzJtdlJYeEU1eUREektwMERpX2NwM2Z6SmFSTVZCNTZuR3h4RXYzVVpORGdyRkJCVGNCR1pSREdwUFlxaVlYU2JEX0RHaGhEM2pWQ0x0TURaamIxV09xTGFjcDRHYlBYUlQtWmRZbkNJZUQ0MkJpMV92RDg3RHhZSDBUNUpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Top Coins Analysis: Crypto Market Recovers as Bitcoin Surpasses $66K, Ethereum Above $3K as Other Altcoins Rally - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQd2VOZnhMQ2ZHX2NaT2FqcEozZG5malNuRHZNdVBtVlplTXBQTDZuUTBQZTVTRTVKaTJ6X3J3cUl5cjdSenBSVnBPQV94bDlvNTFDdU5TeTN3cmNuUlIzSVJLLVNlTjVSZElsLUU4TExraWFIUTVSd2FNcUd0aUxVOVFLeUk3VjM0YmtFWmJzTEpuTXd1Zkl5ODhoLUtlVkQwVUF5OVVXeXVhT3hhdDBXNHlOQlM4VzVzb1hsU3R30gHDAUFVX3lxTE9oWDFOMmJzNTh6a0N1Vlk5b043dDBuTXBzV1A0U1gzUkMyUWl1ZVBmMjhLU0VzajVuNnhmcFB6akZ1MldlZ3hmRFl0MDhEOTJxczA2MDN1R19vN1R4bzdvdW4xMmlTVzVqQkx4M3Mxb2pQTGtoQ1AzaG9wTGtDRXc4VVRmY2R6dXN5ZjhzeEl3VE02aTh1M0g3bV9TUjZ6Sng5eEZOVmEzOUJuS0syZ0NnaWVtUlNvMUhfLS1PV0FlZXgwaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 21:04:47 GMT",
        "title": "Solana Price Jumps 7% On Bitcoin And Ethereum ETF Approvals, Network Congestion Update - NewsBTC",
        "content": "Solana’s price saw a notable recovery on Monday after a steep decline over the past seven days. This was supported by positive developments in the Bitcoin (BTC) and Ethereum (ETH) markets, which came alongside the approval of exchange-traded funds (ETFs) for both cryptocurrencies in Hong Kong.\n\nAdditionally, Solana addressed its ongoing network congestion issues with a new update, aiming to rectify transaction failures and outages.\n\nNew Update Tackling Implementation Bug\n\nAccording to Mert Mumtaz, CEO of Helius Labs, Solana’s recent network congestion issues were attributed to an implementation bug rather than a fundamental design flaw. Mumtaz clarified that Solana’s current predicament results from a flaw in implementing a specific protocol.\n\nAccording to Anza, a spin-off of Solana Labs, Solana has released a new update to its validator client software to combat this. The update, v1.17.31, aims to reduce network congestion and will be followed by further improvements in v1.18.\n\nAnza emphasized the update’s significance, urging MainnetBeta validators to adopt it. The enhancements introduced in the update are expected to mitigate Solana’s ongoing network congestion issues.\n\nRelated Reading\n\nBitcoin Goes Pro: UFC Winner Wants $300,000 Bonus Paid In BTC 5 months ago\n\nFurthermore, validators were advised to upgrade their systems when there is less than 5% delinquent stake, ensuring they have sufficient time to monitor the node after the upgrade.\n\nAny issues encountered during the upgrade were to be reported to ⁠mb-validators. Solana Status, a trusted source, corroborated the announcement, recommending the v1.17.31 release for general use.\n\nTrent.sol, Solana’s developer and operations manager, emphasized that the effectiveness of the update would be proportional to its adoption across the network.\n\nWhile the improvements primarily target Solana’s Stake Weighted Quality of Service (SWQOS) and may not result in significant changes to the reliability of unstacked Tensor processing units (TPU) traffic, Solana users were advised to keep delinquency below 5% during the upgrade process.\n\nFurthermore, Anza hinted at additional enhancements in the pipeline, urging users to stay tuned for further updates.\n\nSolana Price Rebounds With 7% Surge\n\nAfter unveiling updates to enhance network efficiency, the Solana price has surged by over 7%. This surge has helped offset the ongoing downtrend experienced by Solana, which amounted to nearly 21% over the past month.\n\nIn addition, the Hong Kong SFC has officially approved several spot Bitcoin and Ethereum ETFs, including asset managers such as China Asset Management, Bosera Capital, HashKey Capital Limited, and an in-principle approval for Harvest Global Investments.\n\nThis regulatory approval has not only positively impacted the prices of Bitcoin and Ethereum but has also instilled a sense of positivity in the overall cryptocurrency market. As a result, the top 10 cryptocurrencies have witnessed significant uptrends, riding on the wave of these developments.\n\nRelated Reading\n\nDespite the recent surge in Solana’s price, SOL’s trading volume has decreased by -44.70% in the last 24 hours, indicating a recent decline in market activity, according to CoinGecko data.\n\nSolana’s current trading price of $151.40 presents the first obstacle in the cryptocurrency’s path toward further price gains. If this hurdle is surpassed, the next significant resistance lies at $170, which would signify a recovery of SOL’s gains recorded over the past month.\n\nOn the other hand, the $130 mark has proven to be a strong support level for Solana, representing the foundation of SOL’s one-month bullish structure, which propelled its price rally to nearly three-year highs of $210 on March 18.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNa3prVzVZcUh3VUR4QjJqNXcyVzBLZWRyb0hzcWNPWllWc1BsYUlsVEF0U055S2VoUVQ1Zm4tTnYyS3JPeTFoV2NhT3plUXVpd3ZFNEMyTE1nZFo3dTBnbWZEU0JIbVdack5xWDVuUWtiTWRuakVUQlNYZ0FDSVEzSNIBhgFBVV95cUxNWnVFeVhzUmI5dktfcE5aWWI0bUlqeHVMcWtlbW80VEJiVFpHc2xsWFhqRzRqN0ZhWVR5aEZCaHhWbDc3ek9KMDJEc3NBWjJqX2ZPdnpqVmNNX2dMYjk5TGxqSUdRMzgtUDJHV2h1dmhvUExWUVlMQ19VblVTUE1Qam8xQi1LZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:04:57 GMT",
        "title": "Breaking: Spot Bitcoin And Ethereum ETFs Approved In Hong Kong - NewsBTC",
        "content": "The Hong Kong Securities and Futures Commission (SFC) has officially approved several spot Bitcoin and Ethereum exchange-traded funds (ETFs), a decision that marks a significant development in the region’s burgeoning crypto market. These approvals were granted to prominent asset managers including China Asset Management, Bosera Capital, and HashKey Capital Limited, alongside an in-principle approval for Harvest Global Investments.\n\nHong Kong’s SFC Approves Bitcoin And ETH ETFs\n\nChina Asset Management’s Hong Kong unit, as detailed in their press release, has received SFC approval to launch spot Bitcoin and Ethereum ETFs. This initiative is part of a collaboration with OSL Digital Securities Limited and BOCI International, aiming to provide retail asset management services with direct cryptocurrency subscriptions.\n\nSimilarly, Bosera Asset Management and HashKey Capital have announced that they have received conditional approval from the SFC for their own spot crypto ETFs. These products, named the Bosera HashKey Bitcoin ETF and the Bosera HashKey Ether ETF, will allow investors to directly use Bitcoin and Ethereum to subscribe for ETF shares, as stated in their press release.\n\nRelated Reading\n\nHarvest Global Investments has also been spotlighted with the SFC’s in-principle nod for two major digital asset spot ETFs. According to their press release, Mr. Tongli Han, CEO and CIO of Harvest Global Investments, remarked, “This in-principle approval for Harvest Global Investments’ products in two major digital asset spot ETFs not only underscores Hong Kong’s competitive edge in the digital asset space, but also demonstrates our unrelenting pursuit of promoting innovation in the industry and meeting diversified investor needs.”\n\nThese ETFs are set to be launched through a partnership with OSL Digital Securities, the first digital asset platform licensed and insured by the SFC, highlighting a significant stride in addressing common market challenges such as excessive margin requirements and price premiums.\n\nRelated Reading\n\nBitcoin Stays Sub $70,000 As Hong Kong Readies April-End ETF Launch 5 months ago\n\nThe press release from Bosera and HashKey highlights that the introduction of these virtual asset spot ETFs will not only provide new asset allocation opportunities but also reinforce Hong Kong’s status as an international financial center and a hub for virtual assets. This move is aligned with the city’s strategic push to establish itself as a regional leader in financial innovation, particularly in the digital asset sector.\n\nThe approvals are indicative of Hong Kong’s progressive regulatory framework which aims to integrate digital assets within its financial ecosystem safely and securely. The establishment of these ETFs is expected to provide a regulated, innovative investment avenue for both retail and institutional investors in the region. While there is not as much hype as there is around US ETFs, some analysts believe the impact could be similar.\n\nThese approvals come on the heels of rumors last Friday about the potential approval of these ETFs. The market had been abuzz with speculations, and today’s confirmation has provided the Bitcoin and ETH prices with a much needed boost. BTC is up 2.2% since the announcement, surpassing the $66,000 mark. The approved ETFs are reportedly set to launch by the end of April.\n\nAt press time, BTC traded at $66,535.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9TTFdSTkg1cnh2NGdWYkR4M2hLR29GREZjeTJKWEF5OXU0cGpNaG5lUTlVRWdDdDJGZFIwczB3OUZJTU5mWEF4TnpJOWhhUEt4bXctcExHZkx6MEJib3U2aEhnZS1XVFM1ajdkMzFiQ2xhSmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in Trouble: What’s Going On? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nBitcoin and Ethereum in Trouble: What’s Going On?\n\nStory Highlights Major cryptocurrencies like Bitcoin and Ethereum are down significantly, likely due to recent geopolitical tensions.\n\nDespite typical pre-halving surges, the market is tumbling instead, causing investor panic and selloffs.\n\nWhile investors flee, traders are jumping in, but this doesn't indicate overall bullish sentiment.\n\nThe crypto world is once again engulfed in a downward spiral, with major players like Bitcoin and Ethereum showing significant losses. As of now, Bitcoin has dropped by nearly 5% in the past day, while Ethereum’s decrease exceeds 5%. Even BNB and Solana haven’t escaped unscathed, experiencing declines of 7% and 10% respectively.\n\nThe Pre-Halving Frenzy\n\nWith investors scratching their heads over the market’s turmoil, it’s essential to delve into the factors driving this dramatic downturn.\n\nThe much-anticipated Bitcoin halving is just around the corner, set to happen in about four days. Historically, halving events have been met with excitement, leading to significant price surges before, during, and after. At the start of 2024, Bitcoin broke not one but two all-time highs, sparking optimistic predictions from industry experts and outsiders alike. FOMO was rampant, driving market activity into a frenzy. It seemed like smooth sailing for cryptocurrencies.\n\nBut It Was a Bust!\n\nThe party didn’t last long. Corrections, a typical occurrence before halving events, soon kicked in. Experts reassured investors, but over the weekend, the market witnessed a plunge reminiscent of the early-year volatility.\n\nGlobal Turmoil Meets Crypto Chaos\n\nThe brewing geopolitical tensions between Iran and Israel spilled over into the crypto world, as cryptocurrencies became the go-to assets during the crisis. Investors panicked and swiftly sold off their holdings, triggering a market-wide downturn.\n\nThis sparked a flurry of sell-offs, with hundreds of millions of dollars being dumped in just two days. Interestingly, this chaos led to a surge in trading activity on major exchanges like Coinbase, Binance, and Bybit.\n\nAn Opportunity for Investors?\n\nWhile investors fled, savvy traders seized the moment. It’s a common trend; when markets go haywire, opportunities for traders abound. However, it’s important to note that this doesn’t necessarily signal bullish sentiment. Recent data from Coinglass highlights a significant increase in Bitcoin derivatives trading, with volumes soaring by over 10% in a single day, reaching a staggering $99 billion. The prevailing long/short ratio suggests a predominantly bearish sentiment among traders.\n\nDespite the turbulence, experts remain optimistic, maintaining their predictions of Bitcoin soaring to $100k, Ethereum reaching $10k, and BNB hitting $5k."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPLXFaR0JhM052LVY5OFFnMWFBc2FIM2JrZjZCUFZ4QkowOXJiV2Y0S2d5ZEFuYTVncDE3UE1XSU1hbWp2R2tCem5Qb2FLVkJhcThlZjlZUGJyWXhJUk1hS2lXLVFNWDMtbHZDUUNZeVV6b1J3Z0R2TndMcF9WTlR0MDBvVnE0dURibDJNLW8wRFB5QjNDX1hLd3EyRExGX0xsMDdfZWlEbTNuOURI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Price Prediction: How High Can BTC & ETH Price Surge This Bull Run - Coinpedia Fintech News",
        "content": "Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there.\n\nCrypto analyst Crypto Kid delivered a mixed message to the cryptocurrency community, sounding the alarm on a potential Bitcoin downturn.\n\nWhile acknowledging the short-term dip, Crypto Kid delved into the analysis of Bitcoin’s price action, highlighting the formation of a double top pattern and the significance of key support levels. He outlined potential scenarios, indicating that if Bitcoin fails to find support at critical levels, a further decline to $66.7k could signal a bearish trend reversal.\n\nHe talked about how history often repeats itself in the cryptocurrency market. Back in 2020, Bitcoin followed a pattern where it formed a bullish pennant, took some time to consolidate, and then surged. He compared this to his current analysis, suggesting that Bitcoin could follow a similar path, possibly hitting $90k-$92k or even $100k.\n\n\n\nHe also mentioned a potential rise in altcoins. Regarding Ethereum, he noted that it hasn’t reached a new all-time high yet, but he predicted it could reach $6,800 based on its current trend.\n\nHowever, amidst the cautionary tone, Crypto Kid shifted gears to discuss the potentially game-changing news of Hong Kong spot ETF approvals. He stressed the significance of these approvals, noting that they could unlock billions of dollars in capital inflow into Bitcoin.\n\nRead Also : Bitcoin, Ethereum and XRP Price Prediction For This Week: Will Bears Dominate Halving Spree?\n\nWith Bloomberg expecting an approval announcement as early as Monday, Crypto Kid painted a bullish picture of the potential influx of institutional and retail investment into Bitcoin.\n\nDrawing parallels to previous market trends, Crypto Kid predicted a surge in Bitcoin’s price following the approval of spot ETFs, fueled by FOMO from Asian investors seeking exposure to Bitcoin through regulated investment vehicles. He cited the success of other ETFs and the massive inflows they attracted, indicating the potential for similar, if not greater, enthusiasm for Bitcoin ETFs.\n\nDid You Know : MicroStrategy Doubles Bitcoin Profits as BTC Price Soars 463%"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPVWFtOE1ST3B6aWx3cmtLN3hYZzFoNzFiXy1DbWFjR1ZIQnhTOW1KVGZpN1pSbUZsQkRYcllnRUp5N2RZSG5rcko4VThfZHQxOUJZaGV6V3NvbklQUzNxNlZuVjZfWVduQXZiN1hzSGV1ZFlfNDA4eEhZdU5OaVo5dEpncE9jUGpqZWRNMzRxc1pUWGJZUkFNR0Nodjc2c1B3NU03SmJob1ByTFVDeWg4aHFTaFh1T1lLTGtnX1AwbW9GeTg2LVHSAcsBQVVfeXFMUEJIVXZkSjV3UlA4VU16SjlMRWMyZ3ZVWFNxeHNiZV9TVXlwcHVVdHBiTy1hRC1VdldENnB0bEdDcmlYdEszekJYMkFEUXk1QTVkZ1IzRG0yWGgwRDU5a2NJNDdjNGRQLVpFdUZqaVFnWEVDTm5acldaMWRZR01qNDNuWGlOMndoTjlmNFVSY2hBTW85bGVUT2cyaWVHc3YxRU45cWNEYUljZ2ZOMW40RERCRTFsU0FCTkFOWlFKSkdaUHN0RThva1Jtb2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum and XRP Price Prediction For This Week: Will Bears Dominate Halving Spree? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nBitcoin, Ethereum and XRP Price Prediction For This Week: Will Bears Dominate Halving Spree?\n\nThe crypto markets took a hit from the rising CPI data in the U.S., increasing the volatility in the already volatile market. With close relations to the U.S. market, despite being the flag-bearer of decentralization, Bitcoin’s price crumbled this week.\n\nWith a sharp 4% fall last night, Bitcoin’s price closed the day at $67,150, recovering from the low of $65,320. The downfall of the market leader sent a bearish ripple through the altcoin sector.\n\nThe sell-off wave erased $784 Million in long liquidations this Friday, as per the data from Coinglass.\n\nSo, with the bearish prowess growing strong, will the Bitcoin, Ethereum and XRP price trends take a nosedive next week? Or, will the growing anticipations around Bitcoin Halving kickstart a bull run like a phoenix out of its ashes?\n\nIs $100,000 Just A Pipe Dream For Bitcoin?\n\nAmidst the market-wide panic, the BTC price chart shows a massive bearish candle arising from the overhead trendline. This pullback tests the 50D EMA and signals a minor correction within the bullish flag.\n\nTradingview\n\nFurther, despite the sell-off, Bitcoin sustains above the 23.60% Fibonacci level and presents a lower price rejection. Hence, the underlying demand remains significant for Bitcoin.\n\nHence, as the day of Bitcoin halving comes closer, the chances of a bullish spike are increasing. With this surge, the BTC price could lead to a breakout rally of a flag pattern to prolong the prevailing uptrend.\n\nAs per the price levels and the psychological barriers, the biggest crypto could reach the $100,000 mark. However, in the short-term, the coming week could find the bullish surge driving the BTC price higher to $76,000.\n\nEthereum Under Stress, Tension Grows Over $3,000 Level\n\nWith the Bitcoin price under correction, the biggest altcoin shares the heat of increased supply in the market. However, the Ethereum price is sustained above the psychological mark of $3,000, with a long-term projection of a lower price rejection.\n\nTradingview\n\nThe lower price rejection shows a similar underlying demand to Bitcoin, increasing the reversal chances. However, the 7.50% drop last night closes the ETH price under the broken resistance trendline of a rising channel.\n\nThis questions the reversal possibility. Nevertheless, the RSI divergence in the ETH price trend bolsters the possibility of reversal.\n\nFurther, as per the trend-based Fibonacci levels, the ETH price could hit the $4,000 mark for a new breakout attempt.\n\nWill The Sleeping Giant Wake Up This April?\n\nWith a massive supply dump in Bitcoin and Ethereum, altcoins like Ripple have no other option but to face a similar fate. The XRP token price loses 10% of its market value to fall to $0.54.\n\nTradingview\n\nThe downfall tests the bullish dominance at the ascending support trendline in action since early 2023. Further, the dynamic resistance in the weekly timeframe fails to provide any significant momentum for a reversal.\n\nNevertheless, the RSI divergence, coupled with the lower price rejection at the baseline, hints at a stronger comeback. The altcoin could surge this week to break the triangle if the highly anticipated altcoin season arrives with Bitcoin Halving.\n\nAs per trend-based Fibonacci levels, the $0.8966 level is a suitable target for the triangle breakout rally.\n\nWhat’s Next For Bitcoin, Ethereum, and XRP Price?\n\nDespite the sell-off last night, the Bitcoin and altcoins are preparing for a fightback next week. The lower price rejection, prevailing uptrend and the upcoming Halving could boost the market to new heights. Hence, the downfall brings an opportunity to buy blue-chip crypto at a discount."
    }
]