[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQVFEwaktMd2daOGVWMHB6dDdNNEVUOF8tSHotdjN0RnVab0tSM2dldUMzNDE1MFZYTTQ1ZHBEcUg5d0xvSHF6Wm12dGxYRV9pQkhRWVJmTE9lN2l1cExEVEJSUnlBVDVTZW5lT3c3OHJCU1M1OHpZSXZNYVlDUVRSRi1vVzVVUVF1VnhhS0RTT01Fa3k4cVotZWJGZFNXd0hRMkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "BlackRock, other issuers update S-1 filing for spot Ethereum ETFs, raising expectations for July launch - CryptoSlate",
        "content": "Seven spot Ethereum ETF applicants amended their registration statements with the SEC on June 21, leading to increased expectations of a trading launch in early July.\n\nFranklin Templeton, VanEck, Invesco Galaxy, BlackRock, 21Shares, and Fidelity submitted updated S-1 registrations for their respective funds.\n\nGrayscale submitted an amended S-3 registration for its Ethereum Trust and an additional amended S-1 statement for its mini Ethereum Trust. Bitwise did not amend its registration statement.\n\nBloomberg ETF analyst Eric Balchunas continued to predict July 2 as an over/under date for the funds’ launch following the latest filings, saying:\n\n“Anyway that’s basically a wrap. Ball in SEC’s court now.”\n\nHe also maintained his view that Ethereum ETFs are unlikely to attract more than 20% of the AUM Bitcoin ETFs have attracted.\n\nFees disclosed\n\nFranklin Templeton disclosed a 0.19% sponsor fee in the updated filing. The firm will waive the fee for the first $10 billion assets for six months. Meanwhile, VanEck disclosed a similar 0.20% sponsor fee, which it intends to waive for the first $1.5 billion assets until an unstated date in 2025.\n\nBalchunas believes the low fees will pressure BlackRock to announce sub-30 basis point sponsor fees for its fund as well. Notably, both BlackRock and Fidelity have yet to disclose sponsor fees for their ETFs.\n\nExperts believe BlackRock’s fee, in particular, will be a key detail that could lead to heightened competition among the firms. Balchunas said the asset manager’s fee is the most important missing detail other than the launch date.\n\nAccording to the analyst:\n\n“[BlackRock’s] fee is the sun that the rest will need to orbit around.”\n\nThe launch of spot Bitcoin ETFs in January notably led to a “fee war” among issuers, each vying to offer competitively low fees. Currently, spot Bitcoin ETF fees largely range between 0.19% and 0.39%, though Grayscale’s GBTC has a higher 1.5% fee.\n\nSeed investments\n\nInvesco Galaxy disclosed a $100,000 seed transaction on June 17 in which the seed investor purchased 4,000 Shares at $25 per share.\n\nGrayscale disclosed a $100,000 seed share purchase for its mini Ethereum trust. On May 31, the sponsor purchased 10,000 shares at $10 per share.\n\nFidelity said its seed capital investor, FMR Capital, purchased 125,000 shares at $37.99 per share on June 4, contributing $4.7 million to the trust.\n\nMeanwhile, BlackRock previously reported $10 million in seed funding for its ETF.\n\nMentioned in this article"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPLWhJeGNPbFZnR0ZaWC1iWkFkZ3VFNFJZR0l2UkJkc2F5N0JuM2o1OU5qbTh3bUNSS3p5bnUzUlM3WG1yMnFRMWZqUFR3R0V0d3ZWWkhPOXhVbnNSSkd2V21ldUtnT29BejFNTEFGQ1ZRdXlJWXFtWkZ2UVNuYjZoWEc0NU1CT29IYjg40gGQAUFVX3lxTE9JZXJ5TW5VQW9VcHl2SFFyX3hnTVF6MnFtanhFVmRwU1A1UVl1eVB4aWxGdG5seENxYzlfemp5SUFvbmdzM1d2Y1hfeFFhaXRQLVBZd2FCckZUQWxYLWhrb01TMnk2bVEtNlBZLUdsMW9nTmVFV1pobWFfWmgtTENaMnFyY1NaaVdaVFlvSEZGdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval This Week? Nate Geraci Believes It Is Possible - U.Today",
        "content": "In what could be a pivotal development, anticipation is mounting as experts speculate on the imminent approval of spot Ethereum ETFs. For example, Nate Geraci, the president of ETF Store, has sparked discussion on X by suggesting that approval could come next week.\n\nAdvertisement\n\nGeraci's prediction aligns with the sentiments of industry insiders such as Bloomberg's Eric Balchunas, who foresees an ETF debut as early as July 2, strategically timed to coincide with the U.S. Independence Day holiday.\n\nI’m deciphering this as spot eth ETFs will be approved this week…\n\n\n\nJust me tho. https://t.co/rFrMThytgC Advertisement June 23, 2024\n\nMoreover, former SEC official Jay Clayton echoed the prevailing industry sentiment, reinforcing expectations for imminent approvals.\n\nWhen, not if\n\nThe Ethereum ETF saga unfolds against a backdrop of growing institutional interest in the crypto market, particularly BTC and ETH as two major assets.\n\nCurrently, the SEC is reviewing revised proposals from major asset managers, including VanEck, BlackRock, Grayscale and Invesco Galaxy Digital. These filings, which follow recent updates to their S-1 reports, had also disclosed a management fee in particular.\n\nInterestingly, amid the buzz, Hashdex, a notable player in the ETF arena, has withdrawn its application for a spot Ethereum ETF without disclosing reasons or future plans, but presented a mixed Ethereum and Bitcoin solution.\n\nFor now, all eyes remain on the SEC's upcoming decisions, which could mark a significant milestone in the integration of crypto into the TradFi markets. With speculation high and anticipation building, next week promises to be a potential turning point for Ethereum ETFs."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQSjlKYjlNY1RmVDZaT0VOMjc4VFdWWmMzNmVUb2FUQ3llWDNpQWJvNHh0N0s2c3lER3FFdWFvUmt2U1hLZnowS2pKVlh2TW15clFOVHV5SVdPenAzY195eXRDcy1XbXVoUXhfc2pEZjZUOTBPV2EwSVRESXJBRTB3Q2Vna1VJQkF2MWfSAY8BQVVfeXFMT1M5QWpTd084UnNKWi0wRk1WMzYzZ1BWT2V3aVZnSERZV2JQQTZ2bmRXd0lPZzRZbFlEeUxuNlJiR19ldTVkempMMkN4TGxSRjhqQU9OSWdQdHRWYWttOUpac1hVd0pGVjNhMEhoVU51MlRLR2t6eEJhWnZhWEV5R2NqaVVyNm1TUFlpMktPdkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "‘Fight isn’t over,’ despite SEC closing Ethereum 2.0 probe – Exec - AMBCrypto News",
        "content": "SEC concluded its 14-month Ethereum 2.0 probe without charging Consensys\n\nConsensys asserts that the fight continues, with two more SEC probes being contested\n\nThe long-standing legal battle between the United States Securities and Exchange Commission (SEC) and Consensys, the firm behind the MetaMask wallet, appears to have finally come to an end.\n\nFor nearly 14 months, the SEC had been investigating Ethereum [ETH] 2.0 and Consensys.\n\nFor context, Ethereum 2.0 refers to the post-Merge era when the network transitioned from Proof of Work (PoW) to Proof of Stake (PoS). However, according to Consensys, the battle is far from over.\n\nImpact of SEC ending the investigation into ETH 2.0\n\nThis development has sent ripples through the entire crypto community, raising the crucial question – What impact will this have on the broader industry?\n\nCommenting on the issue, Laura Brookover, Head of Litigation & Investigations at Consensys, told CNBC,\n\n“Well, we were very pleased, to receive the letter noting that the investigation into Ethereum 2.0 has been concluded, and that it was concluded without charges against Consensys.”\n\nShe added,\n\n“It’s the right result, it’s the result that should have happened, a year ago. But of course, the fight isn’t over yet.”\n\nBrookover also emphasized that the Ethereum investigation is just one of three separate probes that Consensys is currently challenging in its lawsuit in Texas.\n\nShe pointed out that these investigations are a significant part of the legal action they have undertaken to protect their operations and the broader Ethereum ecosystem.\n\nThe story so far…\n\nThis all started way back in 2018 when the SEC alluded that Ether was not a security. However, in 2023, the SEC quietly changed its position, asserting authority over Ether as a security and launching an investigation into Ethereum.\n\nThis prompted Consensys to file a lawsuit against the SEC on 25 April 2024, with an aim to protect the Ethereum ecosystem. The plaintiffs sought a court order to halt the investigation, arguing that Ether is a commodity and thus outside the SEC’s jurisdiction.\n\nThis legal action spurred significant concern from policymakers, including members of Congress and the general public about the SEC’s investigation into Ethereum 2.0.\n\nIn fact, on 7 June, Consensys sent a letter to the SEC asking for confirmation that May’s ETH ETF approvals, which classified Ether as a commodity, would end the Ethereum 2.0 investigation.\n\nResponding to the same, the SEC in an 18 June letter claimed,\n\n“We do not intend to recommend an enforcement action by the Commission against your client, Consensys Software Inc., with respect to this investigation.”\n\nThe fight isn’t over yet\n\nDespite the SEC’s decision to close the investigation, however, the letter lacks the transparency the industry needs. It fails to explain why the SEC closed the investigation and how this decision impacts other ongoing investigations and enforcement actions.\n\nThis leaves many questions unanswered and underscores the need for clearer regulatory guidelines in the rapidly evolving cryptocurrency landscape. Expanding on the same, Brookover concluded,"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPdUJIWEdEV0ZRaHNkYlE3MzRZS1Z1TEZCeXhhbUx6Z1NYV29YRjR2VlFQZWFuYk0wT2hxNThjQTBnOE1nd0xlTUcxTlY2NnZoLWlJYV80T2JTYmgwUlktZ3diRDlTSmNyN09aVkwtRURobGU5dGpYa1Yxdjdzb0Zzcl83QldTdnh4WVllSmtBajZPWHNFNWdpS1Q1WGFpcE5UQVJwel9GTWY3RDVobXR5Z1RwUHJCelJZSnBQMHY0MXQ0bFo5V1psSDdxS1_SAdIBQVVfeXFMTVJwdzJQcGt6elNWYjVUaHRXczNOTWFQdUNMbTM3NFFyVHV3MmZsdWh0YjBqeDNZbjFmYUNGVlkxVWxXcmVhY0k4VTRMWi0wdnV5OTEtXzY2eFF1WnNjMEU5NmJUd0hTSmdRX1Rxcmx4aWd3OXZhQTBQNzBOYW8zVGhWZEUxa2JlMDAwc241dXVXNTNJRUxaZ2MxMkZXdUozSWZwb3Y4blZRbWcyOTBTX2JLamZIT1U5X1dWSDUtb05uZjJROFRKYXpreng3a2phQ3NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Indicator Suggesting Ethereum Winding Up for Move to the Upside, According to Analyst Jason Pizzino - The Daily Hodl",
        "content": "A closely followed crypto analyst says that the top altcoin Ethereum (ETH) may be gearing up for a swing to the upside.\n\nIn a new video update, crypto strategist Jason Pizzino tells his 329,000 YouTube subscribers that one indicator suggests the leading smart contract platform is gearing up for rallies.\n\nAccording to Pizzino, ETH’s average true range (ATR) – an indicator that measures volatility by showing an asset’s trading range over a specified period – is hinting at an approaching breakout.\n\n“Ethereum [is] looking pretty good – putting in lower highs and higher lows at the moment. We have covered the average true range as another signal that the market is winding up for another move to the upside.\n\nSo we’re watching the ranges of the bars contract and they typically go dead for several weeks, maybe even months, but as we get towards the end of the bull market, these periods get shorter and shorter.”\n\nLooking at the trader’s chart, he seems to predict that Ethereum’s ATR will fall as ETH trades within a triangle structure. A triangle is typically seen as a continuation pattern where an asset witnesses price compression before a big move in the direction of the prevailing trend.\n\nPizzino goes on to say that traders should be on the lookout for Ethereum’s ATR as he says ETH may abruptly fly and leave them sidelined.\n\n“And that is where things get very wild – if you’re not in, that can destroy your portfolio because you’re trying to get in and it just takes off without you…\n\nAt the moment for ETH, everything still looks on track and it’s playing ball with the other strong altcoins.”\n\nEthereum is trading for $3,502 at time of writing, a marginal increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNSVRCYUxLSTV6SkZqc1RQNGNSU3Q2SHlyOHhwNnZOVWNIdV9IZEpsTk1lYm11cWZfWjI4OGdqQmhoZXBhTW9mUFI5eWd6M2NNTWxnOEpWdFczZ3k0ZllUcS0xel9Za3I5Y0V3V09GUUVJa25rb3FkUjQ1dTZicmtuUnFFS3IzOHc0Uk9hRXRKaS1GWEV1SW1fcVU1eTUtZW9jbHpETWpMd0VEQUF3R0JBc3JXbUNVdkdSR3ZmWVpXZ29zUzZUMEphMHV0eHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Solana Price Analysis: SOL Traders Could Earn 80% Profits from Ethereum ETFs Launch - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNb0wzSnlqdTlYMTl5X2NTY1dUZ0lKbTBBS2tWUTZEdlkxRklPNEdJaHBCbWNLS0FzeVZia1BXdUYtMmtIRllYUHZSQWxmeWtFMGFmdXJzVWRSV3BTR1FzcXFrdGN2RDA3c1BIZUk2UWZKbnVrYUtjRzB5enhzVjVrMTdIWEYzNWM0RFpCWlZ4OXdTZlc2V0dEdWNRd3VYVVdGQXlaQlRR0gGrAUFVX3lxTE1ES3hxbzNseG9pRlIwRC1FRERJeXZ0UEE5dmxKODhzajQ5aUhIRjlsRDVsWnEzcm9DZmlGTDE3WXBlT1ZJb1BFdHlZbVdWY3o1VE5hYXFzQjdReTdrU2pUVURtajV1VllaYXlGdlpyY3ZROWJkZHlxaHIwWnhWczhCcHRpR0hNOVhSeU5HaEhoQjlJVFJfa3A5S3Jqc3laT2ZuN0QyRThONVdYSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Eyes $3900 Rebound as On-Chain Data Favors Ethereum Over Bitcoin - CoinGape",
        "content": "The second largest cryptocurrency Ether witnessed medium volatility for the past two weeks, hovering above $3360. The prolonged correction in Bitcoin and development around spot ETH ETF are fueling the uncertainty sentiment in this asset resulting in sideways action. However, with the broader trend bullish the Ethereum price shows growth in on-chain data indicating a potential for bullish reversal.\n\nAlso Read: S&P Global: Ethereum Restaking Can Give Birth to ‘Internet Bond’ Market, Will SEC Approve?\n\nadvertisement\n\nKey Support Levels In Ethereum Price Amid ETF Updates\n\nEthereum coin entered the current correction trend in late May as the price reverted from the $3975 level. With Bitcoin price leading a downward trend, the ETH price of 15.5% to seek support at $3360, concising with the 100-day EMA.\n\nThe long-tail rejection candles at this support indicate the intact demand pressure likely bolstered by the development in Spot ETH ETF. Six companies have updated their SEC applications for Ethereum ETFs, as highlighted by Satoshi Club.\n\n📜Six companies have submitted amended applications to the SEC for the registration of spot Ethereum ETFs. Two of them disclosed the commission fees of 0.19% and 0.2%. Three companies indicated the initial investment volume, which is significantly lower than that of… — Satoshi Club (@esatoshiclub) June 22, 2024\n\nTwo firms disclosed fees of 0.19% and 0.2%, while three revealed initial investment volumes significantly lower than BlackRock’s. With the recent success of Bitcoin ETFs, the U.S. listing of spot ETH is anticipated for a major impact on Ether price.\n\nAccording to CryptoQuant, Ethereum’s Market Value to Realized Value (MVRV) ratio is outpacing that of Bitcoin, suggesting an uptick in market activity for Ethereum. This increase is often a precursor to broader market movements, historically leading to rallies in other altcoins following Ethereum’s lead.\n\nThus, even if the overhead supply pressure persists, the ETH price may likely fall 6% before witnessing high demand pressure at the ascending trendline. This dynamic support intact since November 2023 bolsters a series of higher lows maintaining a buy-the-dip sentiment.\n\nIf the support holds, the ETH price could take the next recovery leap targeting the $3900.\n\nHowever, for buyers to regain better control of this asset, a breakout from the above overhead trendline (blue line) is crucial which could assist the ETH price prediction to target ATH at $4842.\n\nTechnical Indicator:\n\nPivot Levels: With the ETH price projecting a potential for a new high, the Pivot indicator highlights potential resistances at $5371, followed by $6000.\n\nRSI : A daily Relative Strength Index slope wavering around the 50% mark indicates a neutral sentiment among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUndSbVNhbXJGam5fWDlRajdpMzdHUEZuZVRHQUtLME03MEppcDczbzI2MHRoZzk4Yl9CUjhRQXhaWjVtRWVHbFhxU2FwN253QTVLUmhHTVJrOXFQX1dJejlISVA2aDdTdV9aWDFrd3ZFZEtKcXZfZjY4VXR3ZnE3dEt30gGKAUFVX3lxTE81T1hPRmpIX2RPZFhMREVHSW9TQmJudTZ3Tk15YXhFeXdxZFVWbW1TUWJ6T3FSN0lKSjlGZnZESm5KTnR2RTEwMXN4bFNhOWNBT2NhLTBKc3pxbUVON09uRDhMTExVbTFKUEtzT21NUVBZWWF2YXZlOWtDX3RBRVZHdUFIQVF2a2tnQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Ethereum Stays Afloat as Crypto Market Sinks - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt’s been another uninspiring week for Bitcoin, with the top crypto asset chopping sideways to enter the weekend below $64,500, notching another 2.6% loss in the last seven days.\n\nIt's extra disappointing given how MicroStrategy bought another $786 million in BTC this week, which the company’s founder says it never plans to sell. Still, MicroStrategy’s demand was overpowered by an onslaught of sell pressure from other long-term Bitcoin whales, including the German government.\n\nCryptoQuant noted that the broader crypto market is starting to lose momentum due to a lack of new investor demand. It follows, thenn, that most momentum-based meme coins like PEPE, DOGE, SHIB, and WIF are all down 5%, 9%, 13%, and 25%, respectively, on the week.\n\nAD\n\nAD\n\nToncoin also lost some of its momentum from last week, dropping 10% after previously rising to all-time highs on hype from projects within its gaming ecosystem. It remains a top ten crypto by market cap, and is only $300 million away from overtaking Dogecoin.\n\nDefying the market’s momentum to some degree is Ethereum. Its trading at $3,492 as of writing, hovering within a percent of its price seven days ago as Ethereum spot ETFs inch closer to reality. Multiple asset managers have now unveiled the fee on their ETFs, and Bitwise even published a commercial advertising ETH to old-school TV audiences.\n\nSolana—Ethereum’s top smart contract competitor—was less fortunate, sliding another 6% this week to $134.92.\n\nOne of the network’s high-flying Trump-based memecoins, DJT, amassed a $110 million market cap this week, and made headlines on rumors that it may have been launched by Trump’s team itself. One of the ex-president’s legal consultants later confirmed that the coin wasn’t launched by Trump nor his offspring.\n\nEven crypto stocks couldn’t retain momentum this week. Coinbase (COIN) fell 8%, MicroStrategy (MSTR) fell 1.96%, and DeFi Technologies (DEFTF)—which soared after buying Bitcoin earlier this month—has cratered 29.9% this week after crypto reports spread doubt about the company online.\n\nAD\n\nAD\n\nAll the negative momentum from altcoins this month has many analysts saying the crypto bull market may already be over. Still, BitMEX co-founder Arthur Hayes doubled down on his bullish thesis this Thursday that now is the time to ape into shitcoins and “buy the fucking dip” – before global money printers go brr.\n\nPrices as of 3am ET. Edited by Ryan Ozawa."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPa085cXVBV0Vjb3JfNllmMzRWYUNUUE5FZXdheUZIaW9uMGhrdjFVNnNMenZrbFJEbkNwU0tiSkdVQmJicEl6cUxfRzR2UG1nUmkxSDAtM0hDSkVhb0hJdllZa1hIZXpQNVdXcWVKZnVnZDVDZTJOai0xSHlvOWZfSTF30gGHAUFVX3lxTE5VZVoyMkl1S01qVkhncXp6aW80MlZGSXZrNklQY2ppRm03RTJYb0JvUFNKa2NkaHlNREs1TUMxczhwWjJFcW9qUTV3Y3A0WnFJZXVObE50dWtEUUJhOVZsbzRKeGFJN2I5MDRhTFlVS0NyZFlKaHlDUkFucy00SXpzTWo0OEZEOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) vs. Ethereum (ETH): Which Will Win Q3 2024? - CryptoPotato",
        "content": "The world’s number one and two leading cryptocurrencies by market capitalization, daily transaction volume, and crypto exchange volume have almost perfectly tied for ROI from Jan. 1 through the middle of June.\n\nFor comparison, the S&P 500 Index notched up nearly 15% over that same period. But that’s more than the broad stock market benchmark usually makes in an entire year.\n\nSo even during an unusually good two quarters for U.S. stocks, Bitcoin and Ethereum delivered investors four times more ROI. In other words, Bitcoin broke the government’s investment planning tool. Again.\n\nThe average annualized ROI for Bitcoin and Ethereum price performance since Jan. 1 is aces. The top two cryptocurrencies are pacing for a +116% year.\n\nThat’s a return so high that the compound interest calculator tool on Investor.gov does not even allow users to enter interest rates above 100%.\n\nBy the way— if you enter $100 a month into the calculator for 15 years at an estimated interest rate of 15% (above average for the S&P 500), with a daily compounding frequency, you end up with $68,815 in 15 years for capitalizing your country’s economy with a total of $18,100 in contributions.\n\nIf you do the same exercise with Bitcoin or Ethereum profits, and just enter 99% for the interest rate – the result is a little different (more like a bajillion dollars).\n\nQuestion is which cryptocurrency will outdo the other in Q3, or will Bitcoin and Ethereum come remarkably close again to earning the same amount of profit for crypto investors in the next half of the year?\n\nHere are six salient factors that may be worth considering. Some are more bullish for BTC, some for ETH, and some are a wash between the two blockchain network giants.\n\n1. Fed Dollar Inflation (Advantage Bitcoin)\n\nThe center of gravity for the entire global financial system is the U.S. federal funds rate. It represents the cost for Federal Reserve banks to borrow cash from the ultimate lender in the economy.\n\nThe Fed interest rate calibrates the dollar interest rates for loan products all the way down the food chain to store credit cards and pay day lenders. When it goes up or down, so does the rest of the financial economy with it.\n\nBut when it goes up that’s a big headwind that puts downward pressure on prices for stocks and cryptocurrencies. However, when it goes down, there’s a big tailwind for investment products that tends to put upward pressure on their market prices.\n\nIt looks like there will be one interest rate cut for the U.S. dollar later this year. “If all of it happens to be as forecasted, I think one rate cut would be appropriate by year’s end,” said Philadelphia Fed President Patrick Harker on Monday. After the Fed left rates unchanged last Wednesday for the seventh FOMC meeting in a row, Investopedia reported:\n\n“A bevy of tamer-than-expected inflation numbers over the past week has supercharged expectations that a Federal Reserve rate cut is ahead, but Fed officials themselves are proceeding with caution.” “What we’ve been getting is good progress on inflation, with growth at a good level and with a strong labor market,” said Fed Chair Jerome Powell. “Ultimately, we think rates will have to come down to continue to support that. But so far, they haven’t had to.”\n\nMeanwhile, other central bank economies, like those in the United Kingdom and South Korea, are getting antsy to cut rates.\n\nNot if, but when the Fed eventually begins to trim rates back down again, it will be a tailwind for crypto, but especially for Bitcoin – because of its deflationary tokenomics, with a hard supply cap of only 21 million BTC tokens to ever be issued by the blockchain network.\n\n2. DeFi and DApps (Advantage Ethereum)\n\nBitcoin is like digital gold, but Ethereum is like the automotive economy that burgeoned in the 20th Century as a result of the Industrial Revolution. Bitcoin is scarcity in the digital world of cyber abundance.\n\nIt turns out that a world without scarcity is missing something useful. Meanwhile, Ethereum is a vehicle to bring different parts of the economy closer together so they can engage in smart financial markets.\n\nMetaMask, Oasis App, MakerDAO, and Uniswap usage statistics continue to wow in 2024. In February, MetaMask announced a 55% surge in users from 19 million to 30 million in a matter of four months.\n\nThe numbers are almost as high as the 2022 peak for MetaMask installations now. The company behind the Ethereum wallet says those 30 million users manage 100 million accounts with MetaMask.\n\nOasis App is a decentralized app (dApp) built on Ethereum. According to data hosted by BitDegree the app’s balance was worth some $1,769,996,160 in market value Thursday and the dApp had executed 308,620 transactions in the last 30 days (a 100% increase over the prior month).\n\nEthereum MakerDAO is one of those beefy, serious DeFi dApps making the Ethereum vision happen. The decentralized app’s native cryptocurrency, the stablecoin DAI, is a small economy unto itself, with a market capitalization this week exceeding $5.4 billion.\n\nMeanwhile, Uniswap continues to impress. The leading decentralized exchange (DEX) for cryptocurrencies absolutely dominates other DEXs, ranking in fees almost as high as $100 million in total over the previous 30-day period.\n\nThe only Web3 apps to generate more fee revenue in the past month were: Bitcoin, Ethereum, Tron, and Lido.\n\n3. Institutional Adoption (Advantage Bitcoin)\n\nBlackRock CEO Larry Fink noted in March how the Bitcoin exchange traded fund was the fastest growing ETF in history.\n\nBlackRock CEO Larry Fink says the $IBIT Spot #Bitcoin #ETF is the fastest growing ETF in history\n\npic.twitter.com/NOsDlFgROi — Simon Dixon (@SimonDixonTwitt) March 27, 2024\n\nAgainst every other cryptocurrency, Bitcoin and Ethereum both have an advantage in regard to regulatory approval. But against each other, Bitcoin still has a clear advantage going into Q3 2024. Hundreds of millions of dollars flow into and out of the Washington-regulated Bitcoin ETFs daily.\n\nFormer U.S. President Donald Trump now has the confidence to promote cryptocurrency to voters on the campaign trail. Before the last presidential election in 2020, Trump said he was anti-Bitcoin and crypto.\n\nThat is a strong signal of institutional and mainstream crypto adoption for Bitcoin and Ethereum. Trump recently said he wants all Bitcoin to be mined in the United States and he thinks it can help win the AI arms race.\n\nMeanwhile, VanEck announced Thursday that it will be launching the first Bitcoin exchange-traded fund in Australia.\n\n4. Prague Electra (Pectra) Update: (Advantage Ethereum)\n\nThe Dencun Update – the most recent major upgrade to Ethereum – was a massive boon to Ether’s market value on crypto exchanges. Ether price went parabolic buying the news from Jan. 24 until the upgrade happened on Mar. 13.\n\nEthereum devs plan to ship the Pectra upgrade by early 2025, maybe in Q4 2024, so this will be a bullish tailwind supporting ETH price in the background for the medium term.\n\nPectra is short for the Prague-Electra update.\n\nThe Wall Street stock analysts over at TipRanks recently praised the Pectra upgrade in an article featured on Nasdaq for the update’s enhanced rollups and new staking limit for ETH validators: 2,048 ETH.\n\n5. Meme Coins (Advantage Ethereum)\n\nEthereum is still dominating meme coins, but the emergence of fungible token issuance on Bitcoin through the UTXO function using a technique branded Runes and some big hits in Q2 – like Dog Go To The Moon (Runes) – shows Bitcoin is a relevant player in this niche as well.\n\nThrough the Bitcoin Ordinals technique, BTC-minted NFTs remain popular and transacted in volumes of five and ten million dollars daily in June, according to Dune Analytics data.\n\nThe Ethereum meme coin economy, however, is a multi-billion dollar concern that continues to drive capital inflows to Web3 like the world’s gone mad.\n\n6. Competitive Analysis (Advantage Bitcoin)\n\nThe competitive landscape is an important factor in the horse race between BTC and ETH. These are far from the only two cryptocurrencies in the world in 2024.\n\nEthereum grows faster because of motivation from its competition, but it has far more competitors than Bitcoin. Market share in a competitive landscape is a real issue for this currency. It’s not just a technology, toy, or platform; it’s a business.\n\nWhile BNB, Solana, Cardano, Avalanche, Aptos, and a hundred others compete with Ethereum for DeFi market share, there is only one Bitcoin with only 21 million BTC. The Web 2.0 dons, Messrs Jack Dorsey and Mark Zuckerberg, both know the Web3 competition for those oranges is about to get fierce."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNd1pnWGRJZk90NVZCd2J2cTMxeUVfSzZaUHloVTJLZGNkUU9JOTRNdlE3cUsydVUwblBYc3lIZE11T0QxMXNtcGx1RmMzUVpxV095Rnp3TmVJekFJWWZLRUNHODRrOEtBUTR3VzdEZUVoSGV0UWdqbTZyNHRiVFNmQ1NqUXdUSTRNbDNMRURud1ZMUF9TeG40czlNOVZyOS1uNjBWMENyYnFibFFSWEU2LW95eXNxcDBNQVdkd3RDWXNsU2h3UHlrRXFZT052V2tPSEdOeGUzTVVlWWta0gHiAUFVX3lxTFBibWFHVTFuNUJIVmZHZWtoNFpfZlctQXVGWWgzNExyUHpGNGdlWmhvWWlTOERiRXV6ekJMbzNhc1pFSkNGcGtVemNHd1VsMlRKTU1hX0thRzRhLUprTmlmdDg3dENXbGtLZUdNX1c0eFdNOGhSVzNrX0tFZHREUko5STNVTjBZSGctdXpsdDk3bGtndUVuY3Z3cUhmS2d6b2NsbTY1ZG1MU21UWDV5eEpkamZNcm4zeXpPdXQ1R0FrR1NfUjBpNE81VHBqUFdTQmtnVlFuX2Z3Nk8xNklfYnVsd3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum On-Chain Metric Suggests Potential for Altcoin Market Rallies, According to Analytics Firm CryptoQuant - The Daily Hodl",
        "content": "An Ethereum (ETH) on-chain metric suggests the altcoin market could be primed for a price surge, according to the digital asset analytics firm CryptoQuant.\n\nThe firm says on the social media platform X that Ethereum’s Market Value to Realized Value (MVRV) indicator is rising faster than Bitcoin’s (BTC) MVRV.\n\n“This suggests that ETH’s market is heating up. Historically, when Ethereum surges, other alts tend to follow.”\n\nMVRV is the ratio of a digital asset’s market capitalization relative to its realized capitalization (the value of all the assets at the price they were bought). It is used to assess whether the token is undervalued or overvalued.\n\nETH is trading at $3,514 at time of writing. The second-ranked crypto asset by market cap has largely traded sideways this week.\n\nCryptoQuant also notes that Bitcoin is trading below the critical support level of $65,800, which the firm says suggests a potential 8%-12% correction toward $60,000.\n\nBTC is priced at $64,148 at time of writing. The top-ranked crypto asset by market cap is down nearly 1.5% in the past 24 hours and more than 3% in the past week.\n\nJulio Moreno, CryptoQuant’s head of research, says on X that the Bitcoin market is currently at its least bullish point since September 2023, based on its bull market cycle indicator.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNT1docF9SMTdLRE5yUTNHdmdRVERaVHdFOWlIQU9KbGgtSXd6WHRvM3M1aXY4clVoU0tTbVpUTW9nS21wbl9rbUtJUzRMTkxtNkZuMDA0dUREbzhKRWhxdEFHMDA3TVZ0TW0xZ25qaWNnLVFzNkJjQUhJUjBPbVEwME0tQkVpQl9KbVlWbmVR0gGTAUFVX3lxTE9jZmpxbFl3UzQ0VkZ5cmdaZ2ZZcmVyNEFLTElkTlh4cEoxZVNLZkFfWU0zNGFvWkozZEtrNHlMblk0LXFaUjdNYXRkZTh6Qi1xWkJqbm9uWWpLZ2wzbGh5aHVGUWlGY0hHRG85cVdsT1FSMEl2dVFFQVJ6LUN6TWhyOHZDNmlTN0s2dnZUbFhVbHdpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Updated Filings Submitted by Applicants: Hot Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nPopular Chinese crypto journalist and blogger Colin Wu has reported that senior ETF analyst of Bloomberg Eric Balchunas revealed documents showing that the spot Ethereum ETF applicants have updated their S-1 filings.\n\nThose applicants include BlackRock, Fidelity, Grayscale and VanEck giants.\n\nEthereum ETF filings updated\n\nAccording to the aforementioned documentation submitted by the companies, Franklin has set its Ethereum ETF fees at 0.19%, and as for VanEck, this figure is set at 0.2%, as was announced on Friday.\n\nBesides, BlackRock, the world’s largest money manager, made a disclosure of a $10 million seed investment as a major undisclosed investor acquired $10 million worth of its future ETF (ETHA) shares.\n\nAdvertisement\n\nEric Balchunas believes that the likely date of the spot Ethereum ETF approval is July 2.\n\nDocuments released by Bloomberg analyst Eric Balchunas show that eight spot Ethereum ETF applicants, including Bitwise, Fidelity, VanEck, Franklin, 21Shares, Grayscale, BlackRock, and Invesco, have submitted updated versions of their S-1 documents. Franklin set its fees at 0.19%… https://t.co/bal52OEs6C — Wu Blockchain (@WuBlockchain) June 22, 2024\n\nEarlier this year, in January, the same companies had their spot Bitcoin ETF filings finally approved by the Securities and Exchange Commission (SEC). Once trading started, the ETFs began accumulating large amounts of BTC on a daily basis.\n\nBTC ETF outflows rise to major negative record\n\nAnalytics X account @spotonchain spread the word about yet another day of outflows faced by spot Bitcoin ETFs. According to a recent tweet by this entity, these ETFs have been seeing negative inflows for the entire past trading week.\n\nOverall, on Friday, the exchange-traded funds that track the spot Bitcoin price saw $545 million withdrawn from them. Grayscale faced a $34.2 million withdrawal, and BlackRock’s IBIT ETF just had a zero netflow on Friday.\n\nStill, @lookochain reports that BlackRock did have an inflow of 23 BTC, and Invesco Galaxy Bitcoin ETF acquired 229 BTC. According to the same source, Fidelity and Bitwise saw outflows of 787 BTC and 485 BTC, respectively.\n\nEthereum scores victory against SEC\n\nAs reported by U.Today, earlier this week, Consensys reported that the SEC had finally ended its investigation into Ethereum 2.0. This was a major victory for the Ethereum team and ETH holders since the regulatory agency announced that it did not find any grounds to label ETH as a security.\n\nThis propelled the ETH price up by approximately 5%, as the coin’s price soared above $3,500.\n\nOn Thursday, the second largest cryptocurrency surpassed the $3,600 level. However, since then, ETH has seen a plunge, going down to $3,486 by now."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQbVNTQ2kzOFc4MkM1UGtUUlBpNkVROHNZd0lBaklmM3RHVnlNRnU1SVZ2R01BOW1DczZKOTgtMUFmWlVTZFJMcWhxTnd6VkR0WFhycjI3ODRjRXVkQWRwTXNqd0ZNSzVTTkM4bTdUcTZqSjA2WHE3TUFERnEzTEpJN1lublR1cWVMRGc2d9IBkgFBVV95cUxNWHlzUXFQb2hOQlJuNm1VV19yMHpUbFJaSDZYZkxJbHdseklwdU9NSnl5OFFHajNtS29GT0ktUHFlU2FBMkQzQWFSYXVMTGVxVWszdkFTdnpmT2lhQlJjS3BKRU4zOEhETC1KdHNqdDd3Y3BQZG5tWjJRdGxKLTNhb1JLUldmUHVJbVFUUzlYLTd6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: VanEck, BlackRock file their S-1’s and that means… - AMBCrypto News",
        "content": "S-1 filings were sent by firms such as VanEck and BlackRock to the SEC\n\nETH’s price action has remained the same, with network growth recording an uptick\n\nEthereum’s [ETH] price has been clinging on to the $3,500-level for quite some time now. However, recent progress in the ETF space could lend the world’s largest altcoin some much-needed respite on the charts.\n\nS-1 filings on the rise\n\nInching closer to launch, eight applicants for spot Ethereum ETFs, including major players like Bitwise, Fidelity, VanEck, and BlackRock, filed updated versions of their registration statements with the SEC ,according to Bloomberg analyst Eric Balchunas. These S-1 filings mark a key step in the approval process for these ETFs.\n\nFranklin and VanEck have already disclosed their expense ratios, with Franklin setting its fee at 0.19% last month and VanEck following suit on Friday at 0.2%. BlackRock, on the other hand, revealed a $10 million seed investment in its proposed ETF.\n\nThe SEC will now review the updated filings and provide any feedback to the issuers before a final decision is made. This development is a positive sign for investors who have been eagerly awaiting the launch of other spot Ethereum ETFs, potentially opening up easier access to Ethereum for traditional investment portfolios.\n\nBalchunas also offered a tentative date of 2 July as a target for the launch of these Ethereum ETFs. While this is not an official confirmation, it does provide a clearer timeframe for investors who are eagerly awaiting access to these ETFs.\n\nHere, it’s important to note that the SEC still needs to review the filings and potentially request changes before final approval is granted. However, Balchunas’ prediction suggests a potential launch window in the coming weeks, if the SEC’s review process progresses smoothly.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,502.74, with its price down by 0.29% in the last 24 hours. Despite the decline in price, however, its network growth surged significantly over the last few days. A hike in network growth indicated that the number of new addresses interacting with ETH had grown materially.\n\nAs interest from new addresses grows, the chances of ETH rising to its previously-claimed highs also increase.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nCoupled with the hike in network growth, the velocity of ETH also surged. This implied that the frequency with which ETH was trading at had risen significantly over the last few days."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQdmxLZWJpVVhNeFFuLTZHSG5oSnQ0a2ZoMGdqNnNrbTc5SXdpb3lvVnBObjZzcXdYaVlYenBSZjk5T096bkdGcnFNMmxOcmVITkc4RzBza0lCejNmTTZnWDQ3OFVxTVpNLWlIaWwxMEFIQ2J1ajh3azJ6MjVhN2ZXZC1Ia1NvbWFtRWNDVk5VYXNDYlZGMUZZaVhMMnVRRFXSAaQBQVVfeXFMT0ZwZERqcDRmUWxBQUxOdUNrcUdqZXBycXptcFU5bmJNWWNtWmVQemgtdDlNaGNBSDB6THFRNkRqdFcxb3BnOGVka2FFWGplV0MyYWVieTVXV2VmcUNtaEFISjdpYjA1TFpBbVdaWGtYaEZHS2NpRjU3QjRfREV5R3JGZHl5ejZjYmdwVHBQNWFOMU85bW50SllFTnJ2YVRwV2laUDQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "YieldMax Applies For Ether Options ETF Amid Spot Ethereum ETF S-1 Amendments - CoinGape",
        "content": "YieldMax, a popular ETF issuer, has recently submitted a filing with the US Securities and Exchange Commission (SEC) to introduce an Ether Option Income Strategy ETF. The ETF will be listed on the New York Stock Exchange (NYSE) Arca, as detailed in a June 21, 2024 filing. Moreover, this strategic move comes just before the potential launch of Spot Ethereum ETFs in the United States.\n\nYieldMax’s Ether Option Income Strategy ETF\n\nThe proposed ETF from YieldMax will employ a synthetic covered call strategy. It will be designed to leverage the volatility of underlying Spot Ethereum ETFs for generating profits for investors. Moreover, by selling call options, holders of Spot Ethereum ETFs can earn additional income and manage their risk exposure effectively.\n\nadvertisement\n\nMeanwhile, it’s important to note that the fund will not consider direct investments in Ethereum or any upcoming Spot Ethereum ETF. Instead, Tidal Investments will be actively managing the Ether Option ETF, with ZEGA Financial providing sub-advisory services. For context, ZEGA Financial is an investment advisor registered with the U.S. SEC and specializes in derivatives-based trading.\n\nFurthermore, this new filing follows the previous launch of YieldMax’s Bitcoin Option Yield Strategy ETF (YBIT) last year. The YBIT ETF is also listed on NYSE Arca and carries an expense ratio of 0.99%. Meanwhile, there is significant activity around Spot Ethereum ETFs.\n\nAccording to latest filings, all eight applicants recently submitted S-1 amendments to the SEC. Moreover, these amendments provide more details on fees and seed investments. The applicants include prominent names such as BlackRock, 21Shares, Fidelity, Grayscale, Franklin Templeton, VanEck, Bitwise, and Invesco.\n\nAlso Read: Breaking: Fidelity Files Updated Spot Ethereum ETF S-1\n\nApplicants Submit Amended S-1 Filings For Spot Ethereum ETFs\n\nBlackRock, VanEck, Invesco Galaxy, Franklin Templeton, Grayscale, and 21Shares submitted a new round of amended S-1 filings to the SEC on Friday. Earlier, Bitwise and Fidelity had also submitted their amendments. As of now, only Franklin Templeton and VanEck have disclosed their fees, which are set at 0.19% and 0.20%, respectively.\n\nFurthermore, Eric Balchunas, a senior ETF analyst at Bloomberg, commented on the competitive fee pricing. In a post on X, he stated, “VanEck’s fee of 0.20% is quite low, putting pressure on BlackRock to keep their fee under 30bps.”\n\nThe SEC has already approved the 19b-4 forms for these ETFs last month. However, the registration statements need to be finalized before trading can commence. Whilst, some firms have also disclosed the seed capital invested in these ETFs. This highlights their commitment to the funds and providing the initial capital necessary for trading.\n\n21Shares US LLC, the sponsor of the 21Shares Core Ethereum Trust ETF, has made a seed investment of $340,739 by acquiring 20,000 shares. Moreover, Franklin Templeton and Invesco Ltd. have each disclosed initial capital investments of $100,000 for their respective Ethereum ETFs. Meanwhile, BlackRock, demonstrating significant commitment, disclosed a substantial seeding payment of $10 million.\n\nThe market is now keenly awaiting the SEC’s final decision, with the launch date rumored to be July 2. The SEC’s rigorous review process ensures that all disclosure and regulatory procedures are thoroughly completed before ETFs can begin trading. Hence, the S-1 amendments suggest continuous discussions between the SEC and applicants.\n\nAlso Read: Breaking: Standard Chartered Becomes First Bank to Launch Spot Bitcoin, Ethereum Trading\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9sZTZpMVJwejBCWm9JYi13NFpXOW5ndUhDRlkzVVFxdEVpLURHcjRqWUtCTGI3bFI1WDZ3VmkyZUVqUTFqOHVRdDU5YWVzOUN5ZGNaeFluSWJJaG45TG9iR1R1ZVA4c2FkMkxIVG0wQdIBdEFVX3lxTE9vNmZESk5lOEl4ZUgtRnZfMkFXdWYyR29wVVhXZ1F2d011NFVUSW9MU1hhV0E1aEtFX2NCUHRzNDdDRGYyZ25tZ3JRVzYwRzctNmY2OXZMdGNBSVhWMXBGTmtmcVJ3Y1dXY0VuemVKcGxiLXk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Trust Discount Shrinks to 1% - U.Today",
        "content": "As noted by ETF analyst Nate Geraci, the Grayscale Ethereum Trust discount has plunged to 1.45% from a peak of nearly 50% within a year.\n\nAdvertisement\n\nSuch a stunning development is due to the approval of a slew of Ethereum exchange-traded funds.\n\nJust a month ago, the fund was trading at a more than a 20% discount to net asset value (NAV). However, the U.S. Securities and Exchange Commission made a sharp U-turn by approving several 19b-4 forms. The sudden reversal shocked seasoned market observers who expected the SEC to shoot down spot Ether ETF filings and paved the way for a significant price rally in May.\n\nHowever, it is worth noting that these products are yet to start trading since their approval is a two-step process. Now, the SEC has to green-light numerous S-1 registration forms. As reported by U.Today , SEC Chair Gary Gensler said that he expected the products to launch this summer without giving a more precise time frame.\n\nAdvertisement\n\nGeraci recently suggested that the final approval of Bitcoin ETF products could take place as soon as next week.\n\nEarlier this week, prospective ETF issuers, including BlackRock, Fidelity and Grayscale, submitted their updated filings.\n\nWill Grayscale drop fees?\n\nGrayscale's GBTC found it hard to compete with other ETFs from such heavyweights as BlackRock and Fidelity due to its exorbitant fees that are five times higher than the average fee for the other products (0.3%). Grayscale refused to lower fees for its crown jewel despite facing massive outflows.\n\nWhile some believe that Grayscale might now move to lower fees in order to record horrendous outflows, Geraci does not believe that this will be the case. The analyst has predicted that Grayscale will conduct the fee war via the Ethereum Mini Trust.\n\nMoreover, Geraci does not expect Grayscale's Ether ETF to record massive outflows: \"My guess is decent outflows, but not as bad as we saw w/ GBTC.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNdzhtN1N1TkgxaFBEeXl4MXRJODVzX1hSaWJJY3k3UUNjREVwX2NoQm5hN1RXMlBUUldoZmFhMzMzOGJrWWh4TFN0UkYzQVhaREtkZ2JMZ211MmZDT3JJWElKY1lzUUJ2Nkh4OXNwT0p0a0RoM3RKdW54Z2xxcmhnNnBoV3ZmQdIBiwFBVV95cUxNUEI1bkVCV2x6XzFaQ2diOGZYeXl2Wm9zV1VTTDBrNGdVOWFIU3BLTnl4ZGU5NzBiNTNDbVUyV0t2TVdpUzhISW01VXI2NGtwRl94akRCMF9ycHFuZVdnazgyblVQWk9sdTl3QXZlWWFjazg4NUxHVHhULTVkcjBsd3JDZHhiVk5Jb3M0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum to $4K? Spot ETF approvals have analysts thinking… - AMBCrypto News",
        "content": "Market enthusiasm around ETH ETFs might not be as strong as most expected, according to analysts\n\nOther market observers believe ETH could cross $4K after ETF launch\n\nDoubts about market demand for U.S spot Ethereum [ETH] ETFs have been compounding, even as analysts maintain a possible launch by early July. In fact, there’s been a debate about whether ETH ETFs can attract demand on a scale similar to that of spot Bitcoin [BTC] ETFs too.\n\nFor perspective, according to Farside Investors’ data, BTC-related products have now hit +$14 billion in net flows and over $50 billion in assets under management (AUM) since their debut in January.\n\nHowever, most analysts believe that ETH ETFs could meet only a fraction of the aforementioned demand. For instance – Quinn Thompson, Founder of crypto hedge fund Lekker Capital, recently reinforced the overall market’s lukewarm outlook.\n\n“The market is fading the positive impact of the upcoming ETH ETF way too hard.”\n\nMixed views on ETH ETFs\n\nJPMorgan analysts are part of the bearish camp too. They recently projected that ETH ETFs could attract about $1 billion to $3 billion in net inflows in the second half of 2024.\n\nAnother bearish figure was shared by Bloomberg ETF analyst Eric Balchunas, who projected that the products could capture only 20% of the BTC ETF market share. His projection was based on the current demand for ETH vs BTC on the Futures market.\n\nOn the contrary, other analysts, like K33 Research’s Vetle Lunde, estimated that demand for ETH ETF products could hit $4 billion in net inflows in the first five months alone.\n\nFor example, Bitwise CIO Matt Hougan is in the bullish camp and views the second half of 2024 as full of ‘tailwinds’ for ETH demand.\n\nA recent Deribit Insights report also painted a bullish future based on recent Options data. It noted,\n\n“Decent clip of ETH Sep 4k Calls bought ($12m premium), and BTC Jun 65k+July75k Calls rolled to increased exposure in Dec 75+90k Calls, showing increased mid-term optimism.”\n\nQCP Capital analysts reiterated the said optimism based on Options data, reiterating that ETH could surge above $4K and retest its record high of $4.8K."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcGtGaFl4amUzclpoV0QzSGFOeF9vSWxBVzRJZ2xveFdvbnozQ1l0R1dWSGNGWG9Zc1VlY0M5MV9VWUNMczRLcXlDcERNSnJiSVBKbHk0WGR2MDk5VTlJeDZUbTMtTHhwTnNNWFQyb0NTQ3ZBZzJTbDFubndPWlZXUkVNQ0lYNEduN1h0MklqUXk5cmcydHpFMUt6c1NnTUdVV2o3ZVdGM2N4d2ZXanlBU3ZYcmo3RVQ2cnNWVmFhUDFQOXJYSjViZlJn0gHPAUFVX3lxTE5LSE9LWFR5cktWTzkzaHZfeV9zMlEzLVJtMUR1QS16SDFtbGFqaUQyZGZfc1BEY2ItMlZQSmJPVXF0TzAtYXV0MGxMYzV2a0JOMW51YVlLR2Z1NG1VZU9pNEp3aTBEdzhuRXVCcTRkaEhEa3FPblF5NEQtVS1NNV9ROTVjWmZGbEN1bEhWcUh6akJ3ZWdfTDQ1TjNSdjJjeTc0Vm95aWxENkJmbER0ZWZMZ1ZEd1Q0RDV3c0JROFBUVGVLX3B3MDR2Tm9VbXkycw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Banking Giant Standard Chartered To Launch London-Based Bitcoin and Ethereum Trading Desk: Report - The Daily Hodl",
        "content": "British banking titan Standard Chartered is reportedly going to roll out a Bitcoin (BTC) and Ethereum (ETH) trading desk based in London.\n\nAccording to a new report by Bloomberg, anonymous sources familiar with the matter say that the financial services giant is venturing into the world of spot market crypto trading.\n\nThe sources say that the new desk is close to launching, though no specific date was mentioned, and that it will be part of the bank’s foreign exchange trading service.\n\nAs stated by Standard Chartered to Bloomberg in an email,\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability.”\n\nLast year, Standard Chartered launched Libeara, a blockchain platform that aims to assist firms with real-world asset tokenization.\n\nEarlier this year, analysts at Standard Chartered raised their price prediction for the top crypto asset by market cap in 2025 by 50% due to the success of spot market Bitcoin exchange-traded funds (ETFs), which were greenlit by regulators in January.\n\nAt the time, analyst Geoff Kendrick said in a note to investors that the bank is raising its 2025 price target for the crypto king from $100,000 to $150,000.\n\nBitcoin is trading for $64,132 at time of writing, a 1.55% decrease during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNUGd4aVpFUXNyc0NQTzN1NFloWGZRRVBnVlFfNmtkQWVfWmVWR1l4NmpGak1xYVkySkhud3FSUGljT3lUYjRzOF92SlNnT0treUc3ZzE1cmNjbU9qWkR2S0lLSnRwMk9mSGM0OFdJb1J6dWxKN2F2Zkk1WnUwNldYZ0RPT091RDNBTng0elRKRUZZd0VuZUo5czFtTdIBoAFBVV95cUxOYzBaMkppV1czdTlyNzM4VkdYY0dib0ZRaDNQTVB0eTdkQ0RtMklod3pkR1Y0aGNTdHd6X1JSNW5hM3Jtb0tFeEhrcFp5Y0U2SlF4VW8yeVNORXNkZ0VCV1BfQS1ja0E4NzRVMHotT2hXdDVkQWJTNGtVUVhGdjhBT2ttYU5MdnRTQ2hrcXhvMy0tMElqS21DT082dEx3eGxW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "PEPE’s correlation with Ethereum might play out THIS way for the memecoin - AMBCrypto News",
        "content": "Data revealed that the memecoin’s strong ties to ETH could stall further growth\n\nHigh exchange outflows might help PEPE\n\nFrog-themed memecoin Pepe [PEPE] was one of the few top-50 cryptocurrencies to register gains in the last 24 hours. At press time, PEPE was trading at a value of $0.000011, following a 3.35% hike its its value on 21 June.\n\nHowever, AMBCrypto found that the uptrend might not last. One reason for the same may be the memecoin’s correlation with Ethereum [ETH]. According to IntoTheBlock, PEPE’s correlation with ETH was. 0.91 at press time.\n\nETH has strong links with PEPE\n\nThe aforementioned figure was far above the correlation it shares with Bitcoin [BTC], which stood at 0.60. Values of the correlation ranges from -1. to +1. When the reading is close to -1, it means that prices hardly move in the same direction.\n\nHowever, if the reading is close to +1, it means that prices head in the same direction most times. And that was the case with ETH and PEPE.\n\nBut unlike PEPE, ETH did not appreciate on the charts. Instead, it moved sideways, trading at $3,502 at press time.\n\nShould the price of the altcoin continue to consolidate or encounter a decline, PEPE’s price could retrace too. Beyond that, only a few memecoins also jumped, meaning a lot of capital was not flowing into the category to kickstart a rally.\n\nOn the contrary, exchange flows seemed to suggest that ETH might not be able to halt the uptrend. At press time, PEPE’s exchange inflows were 845,000.\n\nMemecoin is in a tight spot\n\nInflows measure the number of tokens being sent into exchanges. When this number is high, it means that selling pressure could be intense, and could probably lead to a price decline.\n\nOn the other hand, Santiment data revealed that the exchange outflows were much higher at 131.07 million. The rise in the outflows means that those accumulating the token are refraining from keeping them on exchanges.\n\nInstead, participants are keeping them in non-custodial wallets. Should this activity continue, PEPE might overlook its strong ties with ETH, and the price could appreciate on the charts.\n\nIf this is the case, the value of the token could hit $0.000013 in the short term. However, traders might not need to be cautious.\n\nThis, because of the holdings distribution data. Consider this – Addresses by holdings revealed the 30-day change of the number of participants buying more of a token at a certain threshold.\n\nIn most cases, the retail cohort rarely impact prices like large investors. At press time, the number of addresses holding $1,000 to $10 million worth of the token had fallen.\n\nConsidering the most recent sell-offs across the market, PEPE might now struggle to keep up with its former bullish momentum.\n\nRealistic or not, here’s PEPE’s market cap in ETH terms\n\nIf this happens, the prediction to $0.000013 mentioned above could be invalidated. Therefore, PEPE’s price could move at the same pace as ETH, and its price might remain around the $0.000011 zone."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNaXBQLXlNbVE2anRaejVlS3VPMEZha2ZTQ0pIY0V0RFhSWlpBM0tsdkVfbGp0V25EQ2VJQ1VmZndxN0xYN09vNzUycmtiVEZDWmhKcUlCZVFrcjV6RmF0RERDQ2tNenpNdWt3QW5lS1NLUHZobXZqWG5Jc0dCZFFYaVlMYXlQSFh4THowYWZKMk8wRnfSAZgBQVVfeXFMTmRCZUd4V3A2NUZ6ZzQ1QkhxN2NQT3o2RFRWMktWOUlOWUtBVGk0RndRdTZOc1NzZFRKN3ZjUnYtTFg3eXRCbGd2akk0RndseG5SRXRScW11eHdWcm5uZmZaUnVsN3F5eDU1ektqYnBfU0ZKNDVxM2piVGZNVFRYVThLZ2lYNnhEOUIwVzVCUWsxeV8xZ2E4emo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s 2024 – Here’s what you should expect from its price - AMBCrypto News",
        "content": "Ethereum Classic (ETC) flashed a general downtrend with decreasing price highs and lows, coupled with diminishing trading volumes\n\nA bearish ‘death cross’ suggested a potential long-term downtrend\n\nEthereum Classic (ETC) has been a staple in the cryptocurrency market, but never expected to go 100x. Still, 2024 is widely anticipated to be a very bullish year for the market, even more so than it has already been. However, things have slowed down recently, and markets have tumbled.\n\nSo, what about ETC? What’s its fate for the rest of the year?\n\nSince late May and into June, the trend has appeared generally bearish as ETC’s price made lower highs and lower lows – A classic indication of a downtrend. This recent decline in price can be coupled with diminishing trading volume – A sign of a reduction in investor interest and market fatigue.\n\nTypically, low volume during a downtrend might suggest a lack of conviction in the sell-offs, but it could also mean that fewer buyers are present to push the price back up.\n\nA hike of +5.56% means heightened trading activity in ETC derivatives, which can be speculative buying or selling. In fact, the notable spike seemed to align with a peak in ETC’s price line, possibly pointing to a speculative rush that was not sustained and led to price retraction.\n\nDeath Cross signals prolonged downtrend\n\nThe 50-day moving average recently crossed below the 200-day moving average, indicating a bearish ‘death cross.’ This pattern typically is a sign of a long-term downtrend.\n\nThe price peaked at around $35 in March, followed by a sharp decline. After that, it consolidated around the $30-mark before breaking below the 200-day moving average.\n\nPrevious support levels can be observed around the $25-level, which have now been breached and may act as resistances if a price recovery attempt occurs. The next key support is likely around the $20-level, which could be tested if the prevailing bearish trend continues.\n\nIn conclusion, the hike in selling volume plus the breach of prior support levels tells us that the bears are here to stay."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPSXpYcDZSNnEyS3JreGtxUkx6RzhsaFBXY0w2a2RTc1ZHOGdkcERFUjJSY3VtZGc0aGFrQWp4dktrT2pSNFYzNkFCSjI5blJtY0lwWjdsMWQ2a3pPcUF0NW95c0U0ZnFfVzRTZzQzbTFHSmE3WVJaMDg3aVg1UjgwR3ZYOW9CZ9IBiwFBVV95cUxNZGZrcFptdHM1ZFdsMHJjbkEwVk4xRVFmdC1sV3RrRk5DdWRWd3R0dUx2TWoxSm5ycTFKM2ozbFFvWmZUVVc4WERMUUk0c2s5TFlZUEtpZ3hOZUYxTjljR2dLTlFCTzMteFY5OEhJczNZbkV5elotbmJUUUZXWUM3YXE4YzFIUFFuVGYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Top 5 Reasons Why Ethereum Price Is Poised For A Reversal - CoinGape",
        "content": "The Ethereum (ETH) price has recently shown remarkable resilience amidst a broader market downturn. Currently, the ETH price is sustaining above $3,400. Moreover, several factors indicate that a price reversal might be on the horizon for ETH. Here are the top five reasons why Ethereum is poised for a comeback.\n\n1. Surge In Ethereum Active Addresses\n\nEthereum has seen a significant increase in active addresses, reaching a three-month high of 617,170. This spike in activity is a positive indicator of growing user engagement and network utilization. Increased active addresses often correlate with higher transaction volumes and stronger market sentiment. As more users interact with the network, it could drive demand for Ethereum, potentially boosting its price.\n\nadvertisement\n\n2. ETH/BTC Ratio Remains Strong\n\nThe ETH/BTC trading pair has remained above the crucial 0.05 BTC level. Michaël van de Poppe, a well-known market analyst, emphasized the importance of this threshold. “As long as $ETH stays above 0.05 BTC, everything is fine, and a reversal in the trend is on the horizon,” he noted. Hence, maintaining this level indicates relative strength against Bitcoin, suggesting investor confidence in Ethereum’s performance.\n\nAlso Read: YieldMax Applies For Ether Options ETF Amid Spot Ethereum ETF S-1 Amendments\n\n3. Spot Ethereum ETF S-1 Amendments\n\nThe filing of S-1 amendments by prominent financial firms for Spot Ethereum ETFs is another significant development. Companies like BlackRock, Fidelity, Grayscale, and VanEck have submitted detailed amendments to the SEC, indicating their commitment to launching these funds.\n\nThe approval of these ETFs could attract substantial institutional investment into Ethereum. Moreover, Bloomberg analyst Eric Balchunas underscored the competitive pricing, which could drive further optimism in the market. He stated, “VanEck’s fee of 0.20% is quite low, putting pressure on BlackRock to keep their fee under 30bps.”\n\nMoreover, the anticipation of ETF approval is creating a positive buzz around Ethereum. The latest S-1 amendments signal a positive shift as applicants are expected to be engaged in regular discussions with the U.S. SEC. This could lead to an imminent approval of these ETFs, which could bring significant capital influx into the market.\n\n4. Introduction of Ether Option ETF\n\nYieldMax has recently filed for an Ether Option Income Strategy ETF. This proposed ETF will employ a synthetic covered call strategy to generate income by capitalizing on the volatility of underlying Spot Ethereum ETFs. Furthermore, the Ether Option ETF aims to provide additional income via selling of call options.\n\nWhile it will not directly invest in Ethereum, it signifies a growing interest in derivative products linked to ETH. Such innovative financial instruments can attract more investors and provide new avenues for trading and income generation.\n\n5. Growing Institutional Adoption\n\nStandard Chartered, an international banking giant, recently announced plans to open a trading desk for spot Bitcoin (BTC) and Ethereum. This move marks the bank as the first to enter spot crypto trading. Standard Chartered’s new crypto-focused operations will be part of its FX trading unit and run from London.\n\nThe bank’s involvement is a testament to the increasing institutional adoption of cryptocurrencies. Binance CEO Richard Teng welcomed the move, noting that it “indicates the mainstream adoption of crypto is picking pace.” Institutional participation can significantly impact market liquidity and investor confidence, potentially driving up the Ethereum price.\n\nAlso Read: Breaking: Fidelity Files Updated Spot Ethereum ETF S-1\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNd2RoMVhsa01uQ05YSEdqWE1jWWxTRE9DYTVBUG0xTXNEZEIycW9mMWRhQ1NZMXlPVXFObmtSb3U3NmliSzlRUDlyUVJuSXNudnJTbW9rZlE0TFhwLTlsZXlaMmNaWnpMdmIxdEtHeWNLWlpLd0pHSmNVdWhfSlZJci1meTdTX1BrOUh0SHhtQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Vous devriez surveiller Ethereum maintenant - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nMichaël van de Poppe, renowned crypto analyst, anticipates a significant rise in altcoins, driven by Ethereum’s remarkable resilience. While Bitcoin shows signs of weakness with substantial capital outflows from US-based ETFs, Ethereum demonstrates impressive stability. This dynamic could well herald a major turning point for the altcoin market.\n\nEthereum stands out for its resilience\n\nAs the crypto market undergoes a bearish phase, Ethereum stands out with notable resilience. Recent data shows sustained activity from Ethereum “whales,” which contrasts with the movements around Bitcoin.\n\nA wallet linked to Justin Sun acquired 9,338 Ether, worth over 30 million dollars. A purchase that demonstrates increased confidence in Ethereum’s future performance. In contrast, Bitcoin whales, notably influenced by the German government, continue to liquidate their positions, increasing downward pressure on the market. Similarly, Bitcoin ETFs face massive outflows. Conversely, Ethereum appears to be gaining renewed confidence, potentially setting the stage for a rise in altcoins.\n\nAn imminent rise in altcoins\n\nAccording to Michaël van de Poppe, Ethereum’s resilience could herald a new era for altcoins. The renowned analyst highlights that the ETH/BTC pair, which has recently shown signs of strength, could trigger a significant rise in altcoins after more than two and a half years of a downtrend. Van de Poppe believes that as long as the ETH/BTC pair holds above the key level of 0.05, a trend reversal is possible. This analysis is based on on-chain data revealing increased accumulation of Ethereum by whales, contrasting with Bitcoin liquidations. This technical signal indicates that Ethereum’s crypto price could climb exponentially against the US dollar, driving positive dynamics for the entire altcoin market.\n\nInstitutional interest in cryptos other than Bitcoin continues to grow, as evidenced by the imminent launch of Solana’s exchange-traded product (ETP) in Canada. This trend reflects a diversification of institutional investment portfolios, once largely dominated by Bitcoin, towards alternative cryptos with attractive growth prospects.\n\nBitcoin’s dominance, measured in terms of relative market share, is also poised for a major reversal. This outlook could favor a rotation of investor liquidity towards altcoins and thus amplify their performance. towards altcoins and amplify their performance.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPdE1Ra0hjN3VpU1FOZFc2UEpaZnFEN21rUm9YYU9UYjlyclNMSFBTcjA3aW12MjVwZm1fTDB1SmtSY0JfVjN4ekhRMUZPamVVRGhnMFdsODhpVWdLbGVhYm8tYWhrSEFrVXdWUEMzcFk4dVROUU5RWllTYmdEZl9URDJUeC0zVzBVWVpsYXRIa1l6X1pBZ0HSAZsBQVVfeXFMTmYzbEt2V2tld2cxLUxrYUx2c2gyYnA5UUdrMjQ5enVzSDhyRkh4UWd4bjhxVjVKam1VR0RfbnRUWjlOaUIxNDVmdzlvbzcwNzg2Y1p5N1FlM3dxZ2VJOHdsNHJSOVlPM3NTRjdCWkRzX0RKTjlDalZKZHhrQ09wTG5xalhfTUI2UjNwS3FuYzZDUXk0WGRBMU9ZSzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whale Offloads 10k Coins Amid ETH Price Dip, What’s Next? - CoinGape",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by global market cap, has once again turned heads across the broader crypto market. In the past 24 hours, ETH has exhibited highly turbulent price action, sparking significant interest and activity among major investors, known as whales. According to on-chain data, over 9,000 ETH tokens were transferred to Coinbase in the past four hours, capturing the attention of market participants.\n\nEthereum’s Whale Activity and Market Speculation\n\nThe recent price recovery of Ethereum (ETH) within the last four hours has been particularly noteworthy. On-chain data reveals that a whale, identified as 0xe61, deposited 9,553 ETH, valued at over $33.4 million, into Coinbase. This considerable transaction has led to widespread speculation regarding the future direction of ETH’s price.\n\nadvertisement\n\nGiven the recent dip in Ethereum’s value, some believe the whale might be selling off to mitigate potential losses. Currently, Ethereum’s price stands at $3,489.38, with a 24-hour trading volume of $5.1 billion. This represents a -1.17% price decline over the past 24 hours and a -1.85% decline over the past seven days. With a circulating supply of 120 million ETH, the market cap is valued at $426.7 billion.\n\nAdditionally, Ethereum’s open interest has decreased by 2.5%, reaching a valuation of $11.5 billion. Despite these declines, the ETH price is sustaining above the $3,400 mark. Various factors suggest that a price reversal might be imminent, including a relative strength index of 43.70, indicating increased selling pressure from the bears.\n\nAlso Read: DOGE, SHIB, and BONK Leads Memecoin Recovery, Is The Worst Over Now?\n\nIndicators of a Potential Price Reversal\n\nSeveral indicators point towards a potential price reversal for Ethereum. One of the most significant factors is the increase in active addresses, which has reached a three-month high of 617,170. This surge in activity is a positive sign of growing user engagement and network utilization.\n\nAdditionally, the ETH/BTC trading pair has remained above the crucial 0.05 BTC level, which is an important threshold according to market analyst Michaël van de Poppe. Another major development is the filing of S-1 amendments by prominent financial firms for Spot Ethereum ETFs. Companies such as BlackRock, Fidelity, Grayscale, and VanEck have submitted detailed amendments to the SEC, demonstrating their commitment to launching these funds. The potential approval of these ETFs could bring substantial institutional investment into Ethereum.\n\nBloomberg analyst Eric Balchunas highlighted the competitive pricing of these ETFs, with VanEck’s fee at 0.20%, which could pressure BlackRock to keep their fees under 30bps. These combined factors suggest that Ethereum could be on the verge of a significant price reversal. Investors are advised to closely monitor these developments as they could present substantial opportunities in the near future.\n\nAlso Read: Binance CEO Richard Teng Affirms Binance’s Support To BtcTurk Amid Recent Hack\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQM0xqcFVEXzZsUkJhTmlIcHZ6ajVWYVFQRDdtb1hpVHZjNzNXV2Z4Wm5aX2xuQnhYRmRfRmlBUTE1VWhwSGZxUmFUclJCelpBZUwyVzB3cU9HUDBoeTd0Y3NEajNjS0F2MFA1ZWFWSjVibHBOSEl0X2owc3hTQ21lSC1OUHE4UUptdHFIbnMtVHFUUFUxWURsdWZER3hkcVpGM0pKc09KYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Pantera Capital Sees Solana As A Serious Future Rival To Ethereum - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Mikaia A.\n\nAnalysts from Pantera Capital, Franklin Bi, Cosmo Jiang, and Eric Wallach, have recently presented Solana as a real threat to Ethereum. Thanks to its monolithic architecture, Solana is on the verge of establishing itself as a leading blockchain, capable of capturing a significant share of the market dominated by Ethereum.\n\nSolana: The “Ethereum Killer” Activated\n\nSolana positions itself as a serious “Ethereum Killer”, thanks to a monolithic architecture that recalls the integrated approach of Apple with macOS.\n\nAccording to Pantera Capital, this design gives Solana notable advantages: a seamless user experience, accelerated innovation, and enhanced security.\n\nThese characteristics make Solana particularly attractive to developers, the cornerstone of any blockchain’s success.\n\nThe NFT deposit platform DRiP, for example, benefits from Solana’s capabilities to send millions of NFTs at reduced fees, demonstrating the network’s technological superiority.\n\nPantera also highlights the versatility of Solana, issuer of the SOL crypto, capable of supporting various use cases challenging to implement on modular blockchains like Ethereum.\n\nProjects such as Hivemapper and Phoenix show how Solana’s monolithic architecture allows for the development of innovative applications.\n\nAdditionally, Franklin Templeton had already highlighted Solana’s advanced technology, describing it as ideal for the next waves of crypto adoption.\n\nAs a result, Solana is emerging as a major player ready to reshape the landscape of blockchain and crypto.\n\nGrowth of Solana: The Numbers Speak for Themselves\n\nThe rise of Solana is not limited to technological promises. Solana’s fundamentals show impressive growth, consolidating the bullish argument.\n\nThe number of unique active addresses on the network has increased from 14,000 in October 2020 to nearly 1.34 million recently. At the same time, Solana’s priority fees have exploded, reaching a historic high of over $60 million in March 2024, signaling growing demand.\n\nThe trading volume on Solana’s decentralized platforms and the record number of crypto launches bolster this momentum. Solana has even established itself as the preferred platform for retail crypto investors and meme traders, surpassing Ethereum in NFT volume.\n\nThese indicators show that Solana is not just a theoretical competitor but an expanding player ready to capture a significant share of the crypto market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPaTdySDA5M3ViQWpIRlRER09wQ3h2RGxPWmI3ZVNDbE5jRngzR0dINkVscFcta2NwbWptbE9wWFRSbmsxNGhyVFJWbUJMU1FPcm1MM1gxOXphTDlsXzhiaHVJMl85b1VSV1owcnp6WEdWOXhtS0V5MjhxbTlYcmhKYVZleWtxTmxnSDc1SS1rU3JfQdIBlwFBVV95cUxOVWNSc1lnOE4tc0xPbEJlTmxNNDhIRG1TMVU5WURhcXdaSDF0cHNMRkpGYWl4d1JBZFRIb2Jfd0Z5VTJWcnpURHp1MUcweVRyMTV3Q2VBSTRaRkZtOGZOdnJSeldNTHZxWTN1UnJ0T1V6cjlKYk9zb3dqdWZNOW13WWhLOGFrc0wzaTd2b1pQYzdKQmlRbmlj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Drops Below $3,500 as Whales Transfer $79M to Coinbase - CoinGape",
        "content": "Ethereum (ETH) price has been in bearish momentum in the last 24 hours, swaying between an intra-day high and low of $3,536.84 and $3,447.94, respectively.\n\nThis 24-hour low was hit after Whales shifted Ethereum coins worth around $79,167,723 as of press time.\n\nadvertisement\n\nEthereum Whale Activity Amid Market Dip\n\nWhale Alert, an onchain tracking platform, has identified two significant ETH transactions in the last three hours. According to the report, the whales moved 13,166 ETH worth around $45,888,084 and 9,485 ETH worth $33,279,639, respectively, to Coinbase and Coinbase Institutional. These large transfers mostly lean toward potential sell-off pressures, indicating a shift in market sentiment toward the bears.\n\n🚨 🚨 13,166 #ETH (45,888,084 USD) transferred from unknown wallet to Coinbase Institutionalhttps://t.co/a5M791DY2D — Whale Alert (@whale_alert) June 21, 2024\n\nAccompanying this trend, ETH’s market capitalization and 24-hour trading volume fell by 1.53% and 5.97%, respectively, to $425,200,317,554 and $15,311,427,759. This dip in the trading volume suggests a declining interest among traders. If this bearish momentum persists, the following support to monitor would be $3,460 and $3,440.\n\nHowever, bulls would need to close above $3,500 for a bullish reversal. According to Coinglass, this potential reversal is supported by a slight increase in open interest by 0.78% to $15.79 billion.\n\nIs ETH Price Poised For a Bullish Recovery?\n\nDespite being bearish in the last 24 hours, Ethereum’s price has been bullish over the previous seven days, rising 3% in anticipation of spot Ethereum ETF trading approval. Last week, according to Coingape, Bloomberg analysts updated their approval timeline to July 2.\n\nConsequently, with the issuers expected to file updates to their spot Ethereum ETF S-1 registration form today, ETH’s bullish momentum may be looming. So far, the issuers that have submitted their S-1 updated filings are Fidelity Investments, Bitwise, and BlackRock.\n\nThese ETSs are expected to impact the Ethereum price due to the potential of increasing demand for ETH. Moreover, according to a report by K33 research, the ETFs may attract over $4 billion in inflows in the first five months, projecting that the price may hit $5,500 by August.\n\nSource: CoinMarketCap\n\nIn addition, with the SEC having dismissed its 14-month investigation of Ethereum, analysts project that Spot Ethereum ETF trading approval may be imminent. Despite this, Ethereum was exchanging hands at $ $3,477.36, a 1.51% decline from the intra-day high at press time.\n\nRead Also: 9 Crucial Ethereum (ETH) Tailwinds Spotted By Bitwise CIO\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOcU41SDBkODIxZFFKakJ1ek9mQVF3VTZqU3p2Zi1ENUlPbm91Mm5PZWxfbk9jTThMRVN0c21lQWQwLWJiMlVxUktZSTVOVW9tdk5ZS2drUDBYVWFUeFVhYmxiYnFMbDF5NFJOUFdla0F1QXpiZUNPUlF2NUxpUWVMV25WaHBTNGU0eHV4TE12bUpNUTJXS09hLVBGOGFpcVU0YnZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "VanEck sets 0.20% fee for proposed spot ethereum ETF - ZAWYA",
        "content": "Investment management firm VanEck plans to charge a fee of 0.20% on its proposed spot ethereum exchange-traded fund, according to a U.S. Securities and Exchange Commission filing on Friday.\n\nThe SEC approved applications from Nasdaq, CBOE and NYSE last month to list ETFs tied to the price of ether, potentially paving the way for the products to begin trading later this year.\n\nNine issuers, including VanEck, ARK Investments/21Shares and BlackRock, hope to launch ETFs tied to the second-largest cryptocurrency after the SEC in January approved bitcoin ETFs in a watershed moment for the industry.\n\nA spot ethereum ETF allows investors to gain exposure to the price of ethereum without the complications and risks of owning ethereum directly.\n\n(Reporting by Pritam Biswas in Bengaluru; Editing by Vijay Kishore and Shilpi Majumdar)"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPY190VHBKVEZfTG5sT3l6UUdXS2JBOGpsNHIwUXF5NlpSWDU3TzktWW11MEJlMXRjOFJJUTcyV2RpYmpWMnFRX09fX2ZCaS0tN2FBbUpXVGZhMmd4U3cyaW9yNzM0MkdjdVRaLU9JcEx5UWdZalliNkFnaHp3bHBNYUpieFhZN2tuVGpMQmZMOEVPTTdmWkVBQnhHX21XaktodUdyZ09EUklTVkZkdHhoeWg5WmVzTi1wTDdlNFR0Wk1lR2RFRjFEWndKWFNtMzDSAdwBQVVfeXFMTjZWWHBSUDdPUkNNd294Z0N1UF9sRE8xNTg0US1yX00ydzVZZ0JBRWRfcnU0a0lDaVR1cjBXY0tEenJvRVZlampFcXoySjVMeC1VZjNXc2RLMnRxelNoRVBsaDVWYWc5aVFXLTNtdWU1QjdUczc5Z2ZvZ2MyTTJsMTFvOUhndzRpMHBJS3RyZS1jVm14RzRzWFpaTDl6RWRuU2VYcmVWQmZldWxYR1p2Wkg1ZkxISFhqcEEtT09yVTVDaHBxLWFfWFFDSGkwN01HWUo5WWI1RTA1R3cxbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Sees Surge in Activity, Is it Poised for Price Rebound Soon? - Analytics Insight",
        "content": "Ethereum has seen an increase in active addresses, which are now at their highest in three months at 617,170. This increase, as pointed out by crypto analyst Ali Martinez, shows that more users are actively using the network.\n\nAn increase in active addresses is usually associated with higher transaction volumes, which signify improved market sentiment. With more users coming into the Ethereum network, the requirement for ETH may increase, which could positively impact the price of ETH."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQTFM4OWRwNnFrWGRtLXVWTktNNjZkMlhrTWE2VmIxWFVTZFVhUTFCUTZLRGg0MWtGaG9kXzJ6eHQycncwY1RpMXdKSUd2cy1SZVMwSG9ZUGhOUmdXZG9INmlwTnRQYnMwdThKbUhOWHBJVEtydnlSU0pMVkZkd1hReld6TXJpNEw5RE1YM0ZsdU1TakRxamhTblJwZFNlcFhZVmQzaVRiYllQcVQzcnlXbTViUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "VanEck sets 0.2% fee for proposed spot Ethereum ETF - The Business Times",
        "content": "INVESTMENT management firm VanEck plans to charge a fee of 0.2 per cent on its proposed spot Ethereum exchange-traded fund (ETF), according to a US Securities and Exchange Commission (SEC) filing on Friday (Jun 21).\n\nThe SEC approved applications from Nasdaq, CBOE and NYSE last month to list ETFs tied to the price of ether, potentially paving the way for the products to begin trading later this year.\n\nNine issuers, including VanEck, ARK Investments/21Shares and BlackRock, hope to launch ETFs tied to the second-largest cryptocurrency after the SEC approved bitcoin ETFs in a watershed moment for the industry in January.\n\nA spot Ethereum ETF allows investors to gain exposure to the price of Ethereum without the complications and risks of owning Ethereum directly. REUTERS"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNXpLWERJbWR6cjdXSkxneEtNRkFUUTVKRUFCOHk0ZWQtYzdKdEZaaWEwQno4N1YwMUtibkE1emZ4RGRYcmdOcHdfMHp5RWpWbl91a2NxUTF0amthell0U3NVcXYxMVlyQnJlTDczVWNWZ1MxNW85dWJJWlI3eEgwNnBhWXBJalM3THNlZlo3aER6dEhBeWhYOHM0N3czU0nSAaQBQVVfeXFMTkRudExJOXVQcGJRMTlHdFY3NkNNSUgyREVzMkpFUnlYd01aNmNZRDFWNnhuTVRhTXVEMG9sNlk4cGtsa1UwbUJEb2s2SUI1TlZDTFA3N200SzU0TndwdTZKYjBzV1RLdTYxX092T0l6d1pXQzhSeEkwOWdGbVkzdXVzNUVXd2dTS2JqMVgwNmJDWE9yUlRzSEo0SlZNYTZvZ19JV2Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Records Surge In Active Addresses – Incoming Price Rebound? - NewsBTC",
        "content": "Ethereum (ETH) is currently down by 0.75% as its price continues a range-bound movement seen all week. However, in its monthly timeframe, the most prominent altcoin displays a concerning performance with a reported loss of 6.40% according to data from CoinMarketCap.\n\nHowever, popular crypto analyst Ali Martinez has picked up a notable development on the Ethereum network which could spell good fortunes for price action in the coming days.\n\n\n\nRelated Reading\n\nEthereum Price Retreats: Market Sentiment Slowly Shifts Bearish 3 months ago\n\nEthereum Active Addresses Soar To 3-Month High At 617,170\n\nIn an X post on June 22, Martinez reported a significant spike in the active addresses on the Ethereum blockchain. Using data from blockchain analytics company Santiment, the crypto analyst noted there were 617,170 active Ethereum users on June 21, marking the highest value for this metric in the past three months.\n\n#Ethereum just saw its largest spike in active $ETH addresses in three months, reaching a total of 617,170 active #ETH addresses. pic.twitter.com/CSqBOnQhEr — Ali (@ali_charts) June 22, 2024\n\nThis development has sparked much speculation in the Ethereum community as a rise in active addresses often signifies an increase in network activity which is quite important following Ethereum’s overall negative performance in the last month.\n\nIn theory, this is a positive omen for ETH’s price as higher activity corresponds with a rise in user transactions thus driving higher demand for the cryptocurrency and ultimately producing a price rebound. Many Ethereum enthusiasts would likely hope that this turns out to be the case when the altcoin breaks out of its current condition between $3,400 and 3,600.\n\n\n\nRelated Reading\n\n3 Reasons To Invest In Ethereum, 1 To Stay Bitcoin-Only: Bitwise CIO 3 months ago\n\nETH Propped For Major Rebound\n\nIn other news, another crypto analyst Michaël Van De Poppe has also added to Ethereum’s chances of staging market recovery. Using the ETH/BTC price chart, van De Poppe stated that as long as ETH trades above the 0.05 price mark, the token’s downtrend is set to undergo a reversal soon.\n\nCurrently, ETH trades around $3,504.42 with a 1.56% decline in the past week. Notably, the token’s daily volume is down by a staggering 52.93%, presently valued at $7.50 billion.\n\nIf the bulls are able to mount massive pressure forcing an upward breakout, ETH may return to the $4,000 last seen in March. However, if the bears retain market control, Ethereum could fall as low as $3000, representing a potential 14% decline from its current price.\n\nIt’s worth stating that all predictions are merely speculations and offer no guarantee. Investors are admonished to conduct proper research before buying any asset.\n\nETH trading at $3,511 on the daily chart | Source: ETHUSDT chart on Tradingview.comFeatured image from, chart from Tradingview"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQLU8yZ0ZiVkl2WHdmanhXWjFQWTZmd3ZxaGhOYWkwWk5tWGUybWUtZ1dnOUJQS19RakdUWmpHUHF6S0tPV2NTWjc4REE5RVRReDBESjN6Q3pwNXRrYk1zUWZMa0VQUmQtaVdHQ1NyTjUybGZEdWZTM1RGenRsS2pPZ0dOTHFIcEFvNUxoUTlPbHg4LTN1cXR4VldJSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "ETH price prediction as Ethereum records largest spike in active addresses - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is witnessing increased activity both on its network and from the legal front. Amid these developments, attention is being paid to the valuation of Ethereum as the decentralized finance (DeFi) asset continues to battle key resistance levels.\n\nIn recent developments, the network has experienced a surge in active addresses, according to data provided by crypto analyst Ali Martinez in an X post on June 22.\n\nThe data shows that Ethereum saw its largest spike in active ETH addresses in the past three months, reaching 617,170. This uptick in activity suggests increasing interest and engagement with the Ethereum blockchain, which could affect its price trajectory.\n\nEthereum active daily addresses chart. Source: Santiment/ali_charts\n\nThe increase in active addresses could be interpreted as a sign of growing network usage and confidence in the platform. Historically, such spikes in active addresses have often preceded price rallies, as increased activity can indicate higher transaction volumes and more utility.\n\nIn addition to the increase in active addresses, Ethereum is also witnessing a rise in other metrics. According to data provided by crypto analytics platform CryptoQuant, Ethereum’s Market Value to Realized Value (MVRV) indicator is rising faster than Bitcoin’s (BTC) MVRV.\n\nMVRV is the ratio of a digital asset’s market capitalization relative to its realized capitalization. It is used to assess whether the token is undervalued or overvalued.\n\nEthereum price prediction\n\nThe spike in user activity coincides with a period when Ethereum is largely subdued, aligning with overall crypto market sentiments. In this line, CoinCodex, a platform utilizing AI-driven machine learning algorithms, has offered Ethereum’s price prediction in the short term.\n\nAccording to data retrieved from the platform on June 23, ETH will likely trade at $3,552 by July 1, 2024. The forecast reflects a modest price gain of 1.6%.\n\nEthereum price prediction. Source: CoinCodex\n\nEthereum remains in focus after the Securities and Exchange Commission (SEC) moved to close its “Ethereum 2.0” investigation of ConsenSys. According to ConsenSys, the SEC’s enforcement division notified the blockchain company that it was closing its investigation into Ethereum 2.0. The SEC noted that it “would not bring charges alleging that sales of ETH are securities transactions.”\n\nEthereum price analysis\n\nAs of press time, Ethereum was valued at $3,497, having recorded minimal gains of about 0.05% in the last 24 hours. On the weekly chart, Ethereum is down 2.5%.\n\nEthereum seven-day price chart. Source: Finbold\n\nOverall, over the past seven days, Ethereum has faced significant downward pressure, influenced by regulatory news. The key support level to watch is around $3,495, with major resistance at $3,550. If Ethereum can maintain above $3,495, it might attempt to break through $3,550; failure to hold $3,495 could lead to further declines.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPYUdJMG9mREZ4SjRpODk0UXNYUVJaaDBvREZpVGFPaGdiMjdINzRTR1dMZTRsMHU1Y2ZJb243eXFJS0JFV2dYTnVzMnF0LXh4RVB2aFVNVFUzX0V1UmtoRE1rbnNwTXFWeGhzRnVqX3pJRmFlam92S09vNU5iUmg5aDlSeEVPYlhCSnY3U2lzWnpyam56b2dpSGU1bXdZaUYybENFR2JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum or Silver? We asked ChatGPT-4o which asset is a better investment for 2024 - Finbold - Finance in Bold",
        "content": "As the broader cryptocurrency market faces a downturn, Ethereum (ETH) has demonstrated notable resilience, maintaining its value above $3,400. At the same time, silver (XAG/USD) is holding firm at a key support level of $29.00, rebounding as US bond yields come under pressure.\n\nThe evolving economic environment has led investors to reevaluate their strategies, comparing the benefits of Ethereum as a leading digital asset with the crucial role of silver in emerging technologies and its responsiveness to industrial demand fluctuations.\n\nEthereum: The innovator’s choice vs. Silver: The steady performer\n\nEthereum’s potential for aggressive growth and high volatility makes it an appealing speculative investment. Its foundational role in the decentralized finance (DeFi) ecosystem and smart contract functionality offers significant upside potential.\n\nAdditionally, Ethereum’s continuous technological advancements, such as the transition to Ethereum 2.0 and growing institutional interest, add to its attractiveness as a high-reward investment. Standard Chartered, an international banking giant, recently announced plans to open a trading desk for spot Bitcoin (BTC) and Ethereum, enhancing Ethereum’s market presence.\n\nEthereum’s flexibility and innovation within blockchain technology provide a hedge against traditional financial market instability and inflation, positioning it as a forward-looking investment choice.\n\nSilver, on the other hand, provides stability and growth potential tied to emerging technologies and global sustainability trends. Unlike Ethereum, silver is less volatile and benefits from its dual role as both an investment and an industrial commodity.\n\nIts sensitivity to industrial demand cycles and use in high-tech solutions position it for steady appreciation. Silver’s traditional role as a hedge against inflation and economic downturns makes it a reliable choice for more conservative investors.\n\nChatGPT’s analysis: Ethereum vs. Silver investment prospects\n\nAccording to ChatGPT-4o, the decision largely depends on individual investment strategies and risk tolerance.\n\nInvestors looking at Ethereum should be comfortable with higher risks and the potential for high rewards. This includes tech enthusiasts captivated by blockchain innovations, long-term believers in the future of decentralized finance (DeFi) and NFTs, and institutional investors seeking advanced digital assets.\n\nEthereum’s recent resilience, growing user engagement, and potential ETF approvals make it a compelling choice for those aiming for significant growth.\n\nChatGPT Ethereum investment prospects. Source: Finbold and ChatGPT\n\nOn the other hand, silver suits conservative investors who prioritize stability and steady growth. Silver’s extensive use in electronics, solar panels, and medical devices ensures ongoing demand, making it a reliable industrial commodity.\n\nAdditionally, silver serves as a traditional hedge against inflation and economic downturns, appealing to those who prefer tangible, physical assets. Its role as both an investment and an industrial commodity makes silver a sound choice for those seeking a balanced and secure addition to their portfolios.\n\nChatGPT Silver investment prospects. Source: Finbold and ChatGPT\n\nUltimately, diversification with both Ethereum and silver can be a way to manage risk and potentially benefit from the growth of both major assets. The choice between Ethereum and silver should align with individual investment goals, risk tolerance, and interest in the technological aspects of cryptocurrencies.\n\nEthereum and Silver recent price performance\n\nEthereum and Silver 6 months performance. Source: TradingView\n\n\n\nAs of 2024, six months performance for Ethereum and silver presents a clear contrast in investment returns. Ethereum has seen a significant rise, with an increase of 39% in six months, showcasing its volatile yet high-growth nature with its current price at $3,505.\n\nIn comparison, silver has gained 30% in six months, with its current price at about $29.5 per ounce.\n\nIn conclusion, both Ethereum and silver offer unique investment opportunities suited to different risk profiles and market perspectives.\n\nEthereum’s innovative edge and high-growth potential make it an attractive option for those willing to embrace volatility and technological advancements. In contrast, silver’s stability and industrial applications provide a safer, more conservative investment route.\n\nDiversifying with both assets could offer a balanced approach, allowing investors to capitalize on the strengths of each while mitigating overall risk.\n\n\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]