[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNMnh5VEg0SGFaaEIzUXAybFpaUlN2SkdLNGRvM1FPcmlvQ29tTF84Z29LbEN2X2ZQang1Q1BZUTNZbEItTVozZkpfeC00cGwyenk5ZmVqU2xnR2d2U0VjRHJRT1pTZm4wQTdmLTcyVTNPeVpzUFBWRlUzaW1LQzUyNmNSRExDdy1rd3NZaWx1LWpBZ2JxTW1adU1NdGVtM3paWEFVNjFvUVpZWUpE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "MIT grads’ $25 million crypto crime puts spotlight on Ethereum front-running - Fortune",
        "content": "If you graduate from the Massachusetts Institute of Technology with elite computer skills, you can make great money working for a tech company—or even more money working on Wall Street. But if that doesn’t grab you, and you want to get even richer, you can always try your hand at white-collar crime like twentysomething brothers Anton and James Peraire-Bueno. The pair came up with a scheme that let them pocket $25 million in just 12 seconds. Unfortunately, it ended badly, as the feds announced yesterday in a press release that reads like a pulp novel.\n\n“Unfortunately for the defendants, their alleged crimes were no match for Department of Justice prosecutors and IRS agents,” wrote the DOJ. For good measure, the release quotes an agent who declares the crime was solved “with cutting-edge technology and good-ole-fashioned investigative work.”\n\nPurple prose aside, the case involves some impressive detective work as well as a sophisticated explanation by Justice Department lawyers of a new type of alleged crime involving the Ethereum blockchain. The crime involves the arcane business of “Maximum Extractable Value,” or MEV, which entails packaging transactions in a block in a way that allows those who construct the blockchain to profit from others’ transactions.\n\nThe miners who build blockchains do not, of course, do this out of the goodness of their hearts. Instead, the process relies on incentives that allow miners—in the case of Bitcoin, Ethereum, and other chains—to obtain a reward in the form of both coins and transaction fees for adding a new block. When Ethereum switched to a new blockchain construction process known as proof-of-stake, however, it created new opportunities for miners to make money—including by front-running trades included in the blocks they package. This is what people mean by MEV. (Bitcoin investment firm River, as well as the DOJ’s criminal indictment, has a good explanation of how exactly it works).\n\nMEV has been around for a while now, and while a number of people in crypto find it distasteful, it is not illegal—and indeed, similar things go on in the world of traditional finance such as the practice known as payment for order flow. The Peraire-Bueno brothers, however, took things a step further when they detected a bug in a popular piece of software used to carry out MEV. This allowed them not to simply front-run Ethereum users’ transactions, but to tamper with them in a way that allowed them to outright rob them.\n\nAll of this is likely to draw new scrutiny of the murky practice of MEV, and potentially lead to calls for reform among the Ethereum crowd. As for the Peraire-Bueno, the episode also showed that people with MIT degrees are also capable of old-fashioned stupidity. Not only did they get caught, but the DOJ also found evidence they conducted web searches about things like money laundering and how to get away with financial fraud. Don’t Google your crimes, people! Finally, the brothers can at least take comfort that they are not the only MIT grads to be charged with crypto crimes—the school is also the alma mater of a certain Sam Bankman-Fried.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe government of El Salvador has mined 474 Bitcoins in the last three years via volcano-powered rigs, contributing to the country's overall holding of 5,575. (Reuters)\n\nCircle is moving its legal base of operation from the U.S. to Ireland, a move that could increase the firm's tax bill. (Bloomberg)\n\nTornado Cash developer Alexey Pertsev is appealing his money laundering conviction. (CoinDesk)\n\nBitcoin jumped back above $65,000 partly in response to encouraging CPI data. (CNBC)\n\nCanadian authorities arrested a self-proclaimed “crypto king” who took $40 million from around 160 investors and blew most of it on travel and luxury cars—a decision that also led to him being kidnapped and tortured by those he scammed. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nBitcoin wallet for sale:"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA2bnhZWjVlWFgwWjdZOExLLUp2aHdKTFNySS13VnlpOWltTng1cUZLdmhNY0JGOHZQSUNoWEJCWEV6V2doNUVtNndDSkR4VXhNdFlab2Z1RW91TUV4eDdLVm1OVmRlT1ZDR3Q5YWFjSHpuaTVyWWfSAWxBVV95cUxOaUpkVWM0Vmdkc2R4UmRJNGNTUDV0RWxsZTJDaDdfLUZjWTNRcExGel9SQXVnemd3VVF6VnJmRUowR2ZaQTJvLU53cWlDM0tnMXJVcXdaVDZtM3RTQ04tNWlMSS11anA4TVZOWDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two former MIT students charged with stealing $25 million of crypto in 12 seconds - CNN",
        "content": "CNN —\n\nTwo brothers who studied at the Massachusetts Institute of Technology were arrested on Wednesday on US charges that they carried out a cutting-edge scheme to exploit the Ethereum blockchain’s integrity and steal $25 million worth of cryptocurrency.\n\nFederal prosecutors in Manhattan called the scheme perpetrated by Anton Peraire-Bueno, 24, and James Peraire-Bueno, 28, “novel” and said the case marked the first time that such a fraud had ever been the subject of U.S. criminal charges.\n\nAuthorities said they executed their elaborate heist in April 2023, stealing $25 million from traders in just 12 seconds by fraudulently gaining access to pending transactions and altering the movement of cryptocurrency.\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,” U.S. Attorney Damian Williams said.\n\nAn indictment charged them with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. Anton Peraire-Bueno was arrested in Boston, while James Peraire-Bueno was arrested in New York.\n\nTheir lawyers did not immediately respond to requests for comment.\n\nBoth brothers had attended Cambridge, Massachusetts-based MIT, where according to prosecutors they studied computer science and math and developed the skills and education they relied upon to carry out their fraud.\n\nThe indictment alleged that for months, the Peraire-Bueno brothers plotted to manipulate and tamper with the protocols used to validate transactions for inclusion on the Ethereum blockchain, a public ledger that records each cryptocurrency transaction.\n\nProsecutors said they did so by exploiting a vulnerability in the code of software called MEV-boost that is used by most Ethereum network “validators,” who are responsible for checking that new transactions are valid before they are added to the blockchain.\n\nProsecutors said that after carrying out the heist, the brothers rejected requests to return the funds and instead took steps to launder and hide the stolen cryptocurrency."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPcHlCbktmc1RUX2pDNDZWY2d4YjZUdFJERk5rdGdTWTEtU3RWTWNBUDNhVC1fc2dKdHRzTDNSb0NjSGt1LV9iZ05XaUpWYk41LXJPcDVQaEN5aEwwbjRNa1NNVFJsZFEwT0hlaWZtbWZneS1KX2VNRV9vM0lCNU9VX2JBUms4NTZsZ0Y0RkUyejdKQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two MIT students charged for exploiting Ethereum blockchain bug, stole $25 million in crypto - Mashable",
        "content": "Two brothers alleged stole $25 million from the Ethereum blockchain after exploiting a flaw in a popular cryptocurrency software. Credit: GEOFFROY VAN DER HASSELT/AFP via Getty Images\n\nJust when you've thought you've seen everything when it comes to cryptocurrency theft, two brothers attending MIT have uncovered a brand new way to steal millions.\n\nAccording to a U.S. Department of Justice (DOJ) announcement on Wednesday, Anton Peraire-Bueno and James Peraire-Bueno have both been charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. The brothers allegedly found a way to exploit the Ethereum blockchain and stole $25 million in cryptocurrency as a result.\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,\" U.S. Attorney Damian Williams for the Southern District of New York said in a statement. \"The brothers, who studied computer science and math at one of the most prestigious universities in the world, allegedly used their specialized skills and education to tamper with and manipulate the protocols relied upon by millions of Ethereum users across the globe.\"\n\n\"Once they put their plan into action, their heist only took 12 seconds to complete,\" Williams continued. \"This alleged scheme was novel and has never before been charged.\"\n\nHow two MIT students exploited the Ethereum blockchain\n\nWhile one part of the brothers' scheme may have taken only 12 seconds, the DOJ indictment makes it clear that they meticulously planned and prepared for months in order to successfully exploit the Ethereum blockchain.\n\nOn the Ethereum blockchain, transactions aren't verified in chronological order, but by \"maximum extractable value\" or MEV, essentially how much value can be earned by validators from the transaction. Validators verify transactions, and in turn, add new blocks to the blockchain.\n\nMashable Light Speed Want more out-of-this world tech, space and science stories? Sign up for Mashable's weekly Light Speed newsletter. Loading... Sign Me Up By signing up you agree to our Terms of Use and Privacy Policy Thanks for signing up!\n\nAccording to the DOJ, the two MIT students exploited a flaw in MEV-Boost, an open-source software used by 90 percent of Ethereum validators. Upon discovering the exploit, Anton and James Peraire-Bueno set up a series of validators using shell companies in order to conceal their identities. The DOJ alleges it took \"several months\" for the two to prepare for their scheme.\n\nThe Peraire-Bueno brothers set their plot in motion by creating \"bait transactions\" in order to trick \"victim traders\" into revealing their trading behaviors.\n\nIn April 2023, the two pulled off their $25 million crypto heist by \"luring\" in the victim traders' MEV bots with eight transactions containing \"illiquid cryptocurrency\" to frontrun and then transfer into stablecoins and other liquid cryptocurrencies. These bundled \"Lure Transactions\" from the brothers were timed to be verified by one of their own validators.\n\n\n\nFrom there, the brothers further exploited the system by forging signatures to deceive the blockchain relay into releasing the transaction information, which they then manipulated. As a result, Anton and James Peraire-Bueno walked away with $25 million and proceeded to take further steps to conceal their alleged crime.\n\n“These brothers allegedly committed a first-of-its-kind manipulation of the Ethereum blockchain by fraudulently gaining access to pending transactions, altering the movement of the electronic currency, and ultimately stealing $25 million in cryptocurrency from their victims,” said Special Agent in Charge Thomas Fattorusso of the IRS Criminal Investigation (IRS-CI) New York Field Office in a statement. “In this case, IRS-CI New York’s Cyber Unit simply followed the money.\"\n\nAccording to the DOJ, the two left a trail of incriminating evidence, including a document laying out the exploit in full detail, breaking their scheme into \"four stages:\" The Bait, Unblinding the Block, The Search, and The Propagation.\n\nIn addition, in the weeks and months following the exploit, the brothers search history unveiled queries for terms such as \"top crypto lawyers,\" \"wire fraud statute of limitations,\" \"money laundering,\" \"fraudulent Ethereum addresses database,\" and searches related to which countries the U.S. has extradition agreements with.\n\nThe two face up to twenty years in prison for each charge."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOa0FCcV9JTWg2MHMwaTdoRnN5U29rR19nby1HV3Q5RFVNbUZzU01jQzJoa2VWT210cVBpTi1fUW5ZSVJhRy1SRmR3eF9KbG1xTUxjU1ZqWDR5YURNYWpHQmZhMVJKRTVHcjBuNTZxV01INDBZZWN0T0hkZFZEY1F6aFlkNUxKZFJfYV9DajRQWnE2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two brothers accused of stealing $25 million worth of crypto - The Verge",
        "content": "Two brothers were taken into federal custody Tuesday for allegedly stealing about $25 million worth of cryptocurrency in just a few seconds in a “first-of-its-kind manipulation” of the Ethereum blockchain. The brothers — Anton Peraire-Bueno and James Peraire-Bueno — studied math and computer science at MIT and used the skills they had acquired “at one of the most prestigious universities in the country” to exploit “the very integrity of the Ethereum blockchain in order to fraudulently obtain” the funds, prosecutors say. The brothers were charged with wire fraud, conspiracy to commit wire fraud, and conspiracy to commit money laundering.\n\n“Unfortunately for the defendants, their alleged crimes were no match for Department of Justice prosecutors and IRS agents, who unraveled this first-of-its-kind wire fraud and money laundering scheme,” Deputy Attorney General Lisa Monaco said in a press release.\n\nThough the heist was carried out in a matter of seconds, the brothers spent months plotting it, charging documents claim. The indictment claims that the Peraire-Bueno brothers “carefully planned and executed” the attack, beginning sometime in December 2022. The brothers allegedly created “an online document” laying out their four-step plan: 1) The Bait, 2) Unblinding the Block, 3) The Search, and 4) The Propagation.\n\nThe brothers set up a series of Ethereum validators “in a manner that concealed their identities through the use of shell companies, intermediary cryptocurrency addresses, foreign exchanges, and a privacy layer network,” according to the indictment. They allegedly targeted three traders — whose behavior they had studied for months ahead of time, prosecutors claim — and set up “a series of test transactions or ‘bait transactions’” to attract bots the traders used.\n\nProsecutors claim the brothers exploited a vulnerability in Etherum’s code that has since been patched. “In doing so, they fraudulently gained access to pending private transactions and used that access to alter certain transactions and obtain their victims’ cryptocurrency,” the Department of Justice’s press release claims.\n\nAfter stealing approximately $25 million worth of cryptocurrency, the Peraire-Bueno brothers allegedly laundered the funds through several shell companies. The brothers’ online search history in the weeks following the alleged theft included “top crypto lawyers,” “how long is us statue [sic] of limitations,” “fraudulent Ethereum access database,” and “money laundering statue [sic] of limitations.” Charging documents claim one victim and their lawyer repeatedly contacted the Peraire-Bueno brothers between April and June of 2023, as did a representative from Ethereum."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE8yZjc1eUJ1THQ3VFp6SmxsSU4xN3N6TXNxSkJHRGJDejBjejJnc0RRejA5RkIydkhHNFpUdXpfRU5HcXBOclhLa3M2MmNIZTVOWU9nQ21ZcUw5alFwWlYxQjNRWdIBaEFVX3lxTE5FVGFKbnk2NTl5ek5fNE04LXZ3UDByZ0JtU21jUHJ2OGVsYWhxZFFoQU1sWGN3aUd3Sm0taFdDaUh0V25qeUQ1eEpxT2F1cXBUdE01QVFtVUllQ29qTWFLRTkycEZhV0tG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Breaks $3,000: Are We Saved? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum has secured a breakthrough above $3,000, but the current state of things suggests that the second-biggest cryptocurrency on the market might still face some troubles. The price has started an immediate reversal, and Ether could face additional selling pressure if it falls below $3,000 again.\n\nAdvertisement\n\nCurrently, Ethereum is trading around $3,005, with resistance levels at $3,200 and $3,400. If ETH can break through these levels, it could signal a stronger bullish trend than now. However, if Ethereum falls below $3,000, the support levels to watch are $2,900 and $2,800. A drop below these levels could indicate an aggravation of the bearish trend.\n\nRecent price action shows that Ethereum is struggling to maintain its upward momentum. The 50-day EMA around $3,067 and the 200-day EMA near $2,800 are critical levels to monitor. Breaking through the 50 EMA would be a positive sign, while falling below the 200 EMA could trigger more selling pressure.\n\nAdvertisement\n\nOn-chain data provides additional insights. The number of active addresses on the Ethereum network has been fluctuating, indicating varying levels of user activity. Currently, the number of active addresses is around 450,000, down from recent highs. Transactions on the network have also shown some variability, with daily transactions hovering around one million.\n\nThe net ETH emission after EIP-1559 has been slightly negative, suggesting that more ETH is being burned than minted. For now, the situation has changed as activity on the L1 of Ethereum dropped substantially.\n\nEthereum's recent breakthrough above $3,000 is a promising development, but the asset is still facing some issues. Key levels to watch are $3,200 and $3,400 on the upside, and $2,900 and $2,800 on the downside."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQUEVSYzZzdzdaOU15eUgyZ3JSbTc4QlN0eTF4RER2dlBPaV9DRkhsdEV3NUhiLTJmWVZCOExteXRLTUpEaGV1Q2dWMl9icTE2N0tZYW1yZWtDT09EWFVGbFFYajN4Ti1Qbm9LcjBXOV92VTVRc0RjVS14V2ZJdUlndEEzcTVmSjM1em1sM25udVFSLUxOU2xHaXRyLTlvbENtUkZhcmc0bFpZa1R2WjdpSzFQN0JQNWxoUjZONC14NkzSAcYBQVVfeXFMTlE1Rmpab3lRYlZtVldSclpLVTRoRlQzYVdaZGhVWk9MMGw1b1FzdEhfdlV3SXl1cDhaRktYTTAwcHVMZDNMX3RaSmVzNU5IdENpMjBHYkZtdTY3dm1pWkR2QWtrVFNwZFpSdmlWUUNWMHd4NUhPdjBiT0s3ZWE2aFlGeEtVSmp0MXNKTWJDeWFDWUlBZm1aTDIzUzNyZXdfSV9rUG5sWmVPTVJZZ2NSNnlLSHVSR2lUaEtXaEtWczlMWlVQUUhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "How MIT Brothers Allegedly Cheated a Noxious-But-Accepted Ethereum Practice for $25M - CoinDesk",
        "content": "\"In this process, a relay acts in a manner similar to an escrow account, which temporarily maintains the otherwise private transaction data of the proposed block until the validator commits to publishing the block to the blockchain exactly as ordered,\" the prosecutors wrote. \"The relay will not release the transactions within the proposed block to the validator until the validator has confirmed through a digital signature that it will publish the proposed block, as structured by the builder, to the blockchain.\""
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQb0g4cUFMUDAzZEFKbGs1UXZOaFVVQ0s4NHNsanVxZm1BbllTZ1FxVk8wNXJnOU9rVzlyb2NaZnpBbHFwcE52ei1WZWhraFRQMjJvVFhZbUZUanl0RFMyZ29KdEQ1eWZndm91SldJcFpVcHViZUprWGhvV2hUbXJwQVdfMmpKSDJBcGRvUNIBlAFBVV95cUxQeVdRWGFfVkpoTVNyZ3BlTzVqc1V3YWdvb0c0ZFl3Z2t6YWRVMU5HTEwwcnVPN3RjUHEtbnRXYi15aGtrOHZuLUNjNEtRWXNCQWUwcHRQTG9kSEs3TkdJQm9Rei1Uc2tzUWRyMGhnQ3Y4RmNmWGpDa1NOU2pSV0FucWNnNHdSX1Jfdi00enZsSHdCdjdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Crypto Is Getting Political—Ethereum Giant Consensys Wants to Stay Out of It - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs crypto emerges as an increasingly partisan issue in the 2024 presidential election—what with Donald Trump making overtures to the industry, and President Joe Biden threatening to kill legislation intended to protect it—American crypto companies have begun feverishly spending to aid the campaigns of pro-crypto candidates across the country.\n\nIndustry mainstays like Coinbase, Andreessen Horowitz, and Ripple Labs have already dedicated tens of millions of dollars to influencing key Senate and House races this year. Meanwhile, crypto leaders have begun openly embracing Trump in a manner unthinkable four years ago.\n\nBut amid the crypto industry’s rise as a force in American election fundraising, one of the country’s most valuable crypto firms has opted to stay out of partisan politics altogether.\n\nConsensys, the $7 billion Ethereum software giant, has notably refrained from backing crypto-friendly candidates in the 2024 election. To the company’s founder and CEO, Joe Lubin, this is a deliberate choice intended to ensure the crypto industry’s long-term success (disclosure: Consensys is one of 22 investors in Decrypt).\n\nAD\n\nAD\n\n“Politically, we've liked to remain neutral,” Lubin told Decrypt. “It doesn't make sense for us to choose one broken party over another.”\n\nRelying on one political party or faction to support crypto is not as sustainable a long-term strategy as solidifying the industry’s legality via the judiciary, the Ethereum co-creator believes.\n\n“The way through all of this, the way that we land… is to rely on the courts,” he said.\n\nLast month, Consensys filed a preemptive lawsuit against the U.S. Securities and Exchange Commission (SEC), arguing that the regulator has no legal authority to classify ETH as a security—a position it has secretly held for over a year, the suit revealed.\n\nAD\n\nAD\n\n“The lawsuit with the SEC is a good platform for us to help people understand the benefits of the technology,” Lubin said. “I don't think we need to be politically partisan or make political donations in order to be a very clear and loud voice on this topic.”\n\nThat’s not to say, though, that the entrepreneur has eschewed politics altogether—far from it. Lubin says that Consensys regularly has closed-door conversations with politicians and regulators about the importance of crypto to America’s future.\n\nWhat’s key, though, is that those conversations are aimed at creating broad—forgive the pun—consensus around crypto.\n\n“We may not be visible,” Lubin said of Consensys’ political machinations, \"but we are certainly doing things.\"\n\nEdited by Andrew Hayward"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOYUE1WUY1dkZpR0NMUFpMUkNQZ1l5NDdWWENLYU1XcUxEOFM3Snd1dEwtSktXelZRMWJmc3NFVVBLZ3hIc0c0cEduRHh6YkM3Z0JDVU9LSmVxYnBKZjJyYmdMbUlNRXhIc3YtVGtLUU9VdExGMUw5czBnc3RUbVJfaHYzTVhYWThpZWFrSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Two brothers arrested for allegedly stealing $25M of crypto in 12 seconds - The Washington Post",
        "content": "Two brothers have been arrested and charged with wire fraud after federal prosecutors in Manhattan accused them of stealing around $25 million worth of cryptocurrency from traders in an elaborate online heist that prosecutors described as a “first-of-its kind” scheme. Anton Peraire-Bueno, 24, of Boston, and James Peraire-Bueno, 28, of New York, allegedly carried out “a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds,” Deputy Attorney General Lisa Monaco said in a statement Wednesday.\n\nProsecutors accused the men of fraudulently gaining access to pending cryptocurrency transactions on the ethereum blockchain and then redirecting the proceeds in April 2023.\n\nLawyers representing Anton Peraire-Bueno did not immediately respond to an overnight request for comment and the identity of James Peraire-Bueno’s attorneys was not immediately clear.\n\nAdvertisement\n\nAccording to the unsealed indictment, the two brothers “studied mathematics and computer science at one of the most prestigious universities in the country.” They used “the specialized skills developed during their education, as well as their expertise in cryptocurrency trading” to exploit the integrity of ethereum, a decentralized blockchain network that has hosted an average of more than a million transactions per day since at least 2023, the indictment alleged.\n\nWhile the indictment did not name the university the brothers attended, the Massachusetts Institute of Technology confirmed in an email that Anton Peraire-Bueno earned a bachelor’s degree in Computer Science and Engineering in February 2024, while James Peraire-Bueno earned a bachelor’s degree in Mathematics with Computer Science, and in Aerospace Engineering in June 2019, as well as a master’s degree in Aeronautics and Astronautics in June 2021.\n\nAccording to the indictment, the two men “manipulated and tampered with the process and protocols by which transactions are validated and added to the ethereum blockchain,” thereby gaining fraudulent access to pending transactions and giving them the ability to steal funds.\n\nAdvertisement\n\n“Once they put their plan into action, their heist only took 12 seconds to complete,” said U.S. Attorney Damian Williams for the Southern District of New York.\n\nShare this article Share\n\nIn December 2022, they created and shared an online document with each other that laid out their plans, before engaging in test or “bait” transactions to identify three victim traders, according to prosecutors. After stealing approximately $25 million from them in April 2023, the brothers took “numerous steps” to hide their identity, including setting up shell companies and using multiple private cryptocurrency addresses and foreign cryptocurrency exchanges to hide the money, prosecutors alleged.\n\nThe brothers then ignored repeated requests from one of the victims, their lawyer and a representative from ethereum to return the stolen money, and instead carried out transactions in an attempt to hide both the source and ownership of the funds, according to the indictment.\n\nAdvertisement\n\nThe pair were arrested Tuesday. Each brother is charged with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering. If convicted, they face a maximum sentence of up to 20 years in prison for each count."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOZjFqNkFlckdwSEkxeWc4ZXUzaW1veFNUT2hIaGYwYy1XalE4Q1lQTDNRZGhIbmVuWkZFUWI0Qk5ocjFueEFQTHRZcFhhWmpuX1FEMTI1b1MwYmRLUHZXdjlFTmgyZnRfT2szUVVlQnlyelVHQmd1S0ZRR3E4V2o5bUdIdTdEWWRmUFk2b09uT2xkdS1uMkN4Nm1uM0kyd1JXcUpvSWROQzVGX0FwWnhQRVpmTnBmVHljSTdPeHY5Wlo2UTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Volatility ahead as ETH 2.0 Withdrawals Spike 4,000% - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxObVBEYVhVMVFsTF9TRWVxTEZ2eHpQa3JQVE41R2d6T01QRkJsWnFrM29ubWhEMy1zcmZZTTlCdzZSMERwd21RUjlhWWIwaXE0VmZtZnROZmJvT0JmNFJPWmUwbHJCRmk5cUdRWmZJMDVNWC01VllBZkVfdFo5T0o4WkZDZ0d3MmJ1Tnhza012NHFrZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Trades Above $3,000 Price Mark, What’s Next? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nEthereum (ETH) has posted strides today with a few erratic price swings. With the bulls staging a comeback, ETH has exceeded the $3,000 price mark.\n\nHowever, while ETH shows moderate gains in the 24-hour timeframe, it has yet to recover its losses in the past weeks. Ethereum price reflects a 1% decline in the last seven days and 1.5% in the past month.\n\nBut the bulls are fast at work, vying to push Ether to higher highs. With ETH already above $3,000, what’s the next target?\n\nPrice Analysis:Ethereum (ETH) Faces Key Resistance Level at $3,059\n\nEthereum (ETH) trades at $3,032, inching closer to a significant resistance level of $3,059. This $3,059 level has previously acted as a support, so a decisive break above it is crucial for further ascent.\n\nA successful breach of the $3,059 resistance would solidify Ethereum’s bullish momentum and push it above the bearish channel, restraining its upward trajectory.\n\nFurther, Ether holds a Relative Strength Index (RSI) of 51, indicating a slight bullish momentum in the market.\n\nThe Moving Average Convergence Divergence (MACD) indicator is above the signal line, further reinforcing the positive sentiment surrounding Ethereum. However, Ethereum (ETH) is still below the 50-day SMA indicator. However, from all indications, it could break above this level soon.\n\nThe alignment of these technical indicators suggests that Ethereum could be poised for an upward movement, provided it can decisively conquer the $3,059 resistance level.\n\nMassive ETH Movements by Whales Hints at Potential Price Surge\n\nSeveral crypto whales have moved significant amounts of Ethereum (ETH) from the popular exchange Coinbase to unknown wallets. The transactions involved the transfer of 7,563 ETH, worth approximately $22 million each time.\n\nThe first whale, identified as 0x091d, moved 7,563 ETH worth $22,215,383 from Coinbase to an unknown wallet. Another whale, 0xd26e, also transferred 7,563 ETH, valued at $22,210,308, to an unidentified wallet.\n\nAdditionally, whale 0xfe73 shifted 7,563 ETH worth $22 million from Coinbase to an anonymous wallet. In the final transaction, whale 0xf627 moved 7,563 ETH, valued at $22.19 million, to an unknown destination.\n\nThese substantial whale movements often signal their intention to hold their Ethereum holdings for an extended period. By transferring their ETH to unknown wallets, they are likely preparing to accumulate more coins or hold their existing positions, anticipating a potential price increase.\n\nGiven Ethereum’s bullish technical indicators and recent price action, these whale movements could indicate impending upward pressure on the coin’s price.\n\nThe whales may be positioning themselves to capitalize on a potential breakout or rally in the Ethereum market. However, market participants should exercise caution and consider all relevant factors before making investment decisions.\n\nAI-Powered Meme Coin, WienerAI, Soars Past $2 Million in Presale\n\nArtificial intelligence (AI) and meme coins are two of the hottest trends in the cryptocurrency market. WienerAI, a newly launched project, combines these powerful narratives into one exciting offering.\n\nCurrently, WienerAI is holding a presale event, during which investors can purchase the project’s native token, $WAI. The presale has already raised over $2 million, demonstrating strong interest from the crypto community.\n\nInvestors can buy $WAI tokens at $0.000708 during the presale. However, this price will gradually increase as the presale progresses. The earlier investors participate, the lower the price they can secure.\n\nWienerAI: The Meme Coin with Serious Utility for Crypto Traders\n\nWienerAI isn’t just a meme coin; it offers much more practical utility than regular coins. Behind its fun nature lies a powerful trading bot designed to enhance the experience of decentralized finance (DeFi) users.\n\nWienerAI’s trading bot provides free, instant token swaps across various decentralized exchanges (DEXs), such as Uniswap, Bakeryswap, and Pancakeswap.\n\nThis feature helps eliminate the frustration of lengthy waiting times typically associated with buying cryptocurrencies. Additionally, the bot resists miner extractable value (MEV), ensuring users are not front-run by malicious bots.\n\nBy offering seamless and secure token swaps, WienerAI aims to bolster the overall DeFi user experience, making it more efficient and accessible for traders. This innovative utility has generated excitement within the crypto trading community, as many see the potential benefits WienerAI can bring to their trading activities.\n\nMeme Coin Goes Big on Community: WienerAI Allocates 60% of Tokens to Presale, Staking, and Rewards.\n\nWienerAI’s token allocation plays a central role in the project’s operation. A significant portion (30%) is allocated to the ongoing presale. Another 20% is reserved for staking rewards, incentivizing long-term holding and participation.\n\nAnother 20% is designated for community rewards, while 10% of the tokens are allocated for exchange liquidity. Finally, 20% is dedicated to marketing efforts, fueling the project’s growth and raising awareness.\n\nIn true meme coin spirit, this distribution puts the majority of tokens into the hands of the community. At the same time, it ensures resources are available for sustained growth and development.\n\nCurrently, staking rewards for WienerAI offer incredible returns of over 487%. This opportunity is available on a first-come, first-served basis. The annual percentage yield (APY) will gradually decrease as more tokens are staked.\n\nAlready, the community has staked over 2 billion $WAI, showcasing their eagerness to accumulate more tokens. Those seeking to maximize their upside potential should act swiftly before the presale ends.\n\nTo stay updated on the latest news and developments regarding WienerAI, follow the project on X (formerly Twitter) or join its Telegram channel. Alternatively, visit the official website to purchase tokens and begin staking immediately.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNbG1tN3BkWmxKZDlXcENKTkdyY1dicnBqaWhEVzFTQUFkcGcya2xhX2dGVk1tLTJhOENNOEQ4YkhmWEI1R3FnNEJtbXFYRnU4a252TWdaRjlWMkdmcWFnNmktblBlNXA1MS01OWtzTTdNVWtSdWFpbnE4akRTdGlvSjNDc25EZlpvWEtCb09mc3pVZnJJNVFFRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Missed Out On Ethereum? This Little-Known Cryptocurrency Could Be On Track For a Big Move - The Motley Fool",
        "content": "Crypto investors hope that Sui can become the proverbial next Ethereum.\n\nSince its launch nearly a decade ago, Ethereum (ETH 0.04%) has skyrocketed in price from around $0.30 to about $3,000, making it one of the most successful crypto investments of all time. On its path to the top, Ethereum has gained a dominant market share in just about every niche of the blockchain world and now ranks as the second most valuable crypto in the world, with a huge $354 billion market valuation.\n\nThose are difficult footsteps to follow, but there's one cryptocurrency that is starting to remind me a lot of what Ethereum looked like in 2015. You've probably never heard of Sui (SUI 7.18%), but it has very quietly become a Top 50 crypto, as ranked by market cap. It may still be early, but there are several good reasons it could be ready for a major move.\n\nWhat is Sui, and why should you care?\n\nThe first thing you should know about Sui (pronounced \"swee\") is that it is a Layer 1 blockchain, just like Ethereum. But it claims to be much faster, efficient, and cheaper to use than Ethereum. In theory, at least, Sui offers the potential to handle 297,000 transactions per second, with record-breaking low latency (lag time) and 100% uptime, which measures reliability. That makes the blockchain a great fit for both decentralized finance (DeFi) and Web3 gaming.\n\nThe cryptocurrency also has a world-class founding team, with top executives and developers from Facebook (before it was rebranded as Meta). While at Facebook, these technologists worked on blockchain projects such as Diem, which was Facebook's initial stab at a worldwide digital currency. Given this pedigree, venture capitalists have been more than willing to invest over $300 million into Mysten Labs, the company behind Sui.\n\nJust keep in mind, the Sui blockchain officially launched in May 2023, so it's still very early innings here. Ethereum has literally had an eight-year head start, and it's going to be difficult wrangling away market share in key blockchain niches such as DeFi. But there is no denying that Sui is a new blockchain challenger that needs to be taken seriously, if only because of all the money and top talent behind it.\n\nSui has a mobile crypto strategy\n\nSui also has a fantastic catalyst for 2025: The launch of a new handheld gaming device that will be completely integrated with the Sui blockchain. The new device, known as the SuiPlay0x1, is still in the developmental phase, and won't be available until next year.\n\nIn terms of appearance, this new device has been compared to both a PlayStation Portable and a Steam Deck. In terms of cost, it will likely be priced around the $500 mark, so it won't be cheap. And in terms of which games will be available to play, it will include games from Sui, as well as several other gaming partners.\n\nBut will this new product be a hit? That might be a question that only teenagers and young adults will be able to answer. My best advice is to create a list of all games coming to Sui, show them to any young adults or teens in your household, and ask them what they think. Early reviews on social media have been positive, but there are a lot of unknowns.\n\nHow high can Sui soar?\n\nBack in July 2015, when it officially launched, Ethereum traded for less than $1. By March 2016, it reached the $10 mark. By May 2017, it reached the $100 mark. So, in just its first two years, Ethereum skyrocketed in value by more than 100-fold. And that was just the start, as Ethereum eventually went on to hit an all-time high of $4,892 in 2021.\n\nCould we see the same phenomenon with Sui? Right now, Sui trades around the $1 mark. If people think that its new mobile crypto strategy is going to be a hit, Sui might start to make a move to the $10 level, if not higher. But think really big -- what if Sui starts taking market share away from Ethereum in key areas such as DeFi? The sky's the limit for how high Sui might go.\n\nOf course, we've heard this story before when it comes to cryptocurrencies claiming to be the next Ethereum. Nobody has been able to topple the market leader yet, so maybe it's unlikely that Sui will be able to succeed when others have not. But if you missed out on Ethereum the first time around, Sui might be worth a closer look."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRjNsLUUzcDZ4dFFxWVdkTDIyNUdFQU9UX3NDVUw5TTNCeUlQYlltR2IyamI4WDZwbzFocTRCRDRxd3pQMWc5UE5xTk03Z0UtNGlBM2NkMlA5X0RMUjN0UXExS05ZbWdOR254TlluSEtTVVh3RW10eGdDRHdfbTd6aS1DVjdwTzlmVE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Deadline Approaches for SEC’s Spot Ethereum Decision - Nasdaq",
        "content": "By May 23 — exactly a week from now — the SEC will need to reach a decision on VanEck’s spot ethereum application.\n\nVanEck isn’t the only one aiming to get approval. The deadline for ARK Investment Management’s filing with 21Shares is May 24, just a single day after VanEck's. Recently, ARK and 21Shares updated their application to remove a staking clause.\n\nMinimal Hope\n\nAs for what to expect from the SEC, analysts aren’t exactly enthusiastic. Ric Edelman, head of the Digital Asset Council of Financial Professionals, recently told CNBC he “would be astonished if the SEC said yes at this point,” citing the lack of correspondence between the SEC and VanEck.\n\nVanEck CEO Jan van Eck is not optimistic that the SEC will approve the firm’s ethereum ETF application just yet. In April, van Eck told CNBC he expected his firm’s ethereum filing to “probably be rejected.”\n\n“The way the legal process goes is the regulators will give you comments on your application, and that happened for weeks and weeks before the bitcoin ETFs — and right now, pins are dropping as far as ethereum is concerned,” the VanEck CEO added.\n\nA March filing regarding BlackRock’s petitioned spot ether ETF indicated the SEC may be considering labeling ethereum as a security, not a commodity. The filing delayed BlackRock’s decision until June and asked for public comment on whether ETH is a security or a commodity.\n\nMeanwhile, Grayscale Investments has withdrawn its filing for an ethereum futures ETF. This comes while Grayscale awaits approval on its proposal to convert the Grayscale Ethereum Trust into a spot ether ETF.\n\nDespite the pessimism over the SEC’s next moves, the price of ethereum is doing quite well. The cryptocurrency is currently hovering around the $3,000 range. This marks a stark gain in more than a year: Ethereum sat closer to $1,800 in May 2023.\n\nLooking ahead, the SEC’s debate over whether ethereum is a commodity or a security could keep spot ethereum ETFs off the market for now. Ether’s regulatory status will ultimately determine whether or not spot ether is here to stay.\n\n﻿\n\nFor more news, information, and strategy, visit the Crypto Channel.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPT2FuZTBHci13SlAydGVEWmdPYWM4M2VIeG5kQ2ZpemtweHp6RFA5RFVLM0lxWi1SY2pZRXVtclRYQnFET3ZhWDE0dVpHVkhTV01qRlNUZVJfTFV0ZjFhanJQZ1MwN1F5eEo4T0loRjdZLUtTTTBiMXlYaWgwckVwQlBLeXUzckFG0gGQAUFVX3lxTE11R2hKWEp2WkNacEUwMjcyb2NVTDF2THVNTW5GNGFWUFQySnJ5YkRMaGl2ajBTYVRfaFBDdml1ODJfOWxqUmdEZ01KY0ZURFQzYVk4UGwydlZNWXBzUDNVaUdzNXBMT2UzVWJOTE5HYlB6aHhCUXBvWHBsMFdRNjhXblFmWkhpX0pqVVFxSkpDMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Coming Sooner Rather Than Later, Says Coinbase - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA spot Ethereum exchange-traded fund (ETF) could hit the market sooner than expected, says Coinbase, despite growing industry observer pessimism.\n\nIn a note this week, America’s biggest cryptocurrency exchange said that “while there is uncertainty around a timely approval given the SEC’s apparent silence with issuers,” it’s only a matter of time before such a product hits the market.\n\nThere’s a long list of top asset managers—including VanEck, BlackRock, and Franklin Templeton—who have filed paperwork with the Securities and Exchange Commission to release an Ethereum ETF.\n\nSuch a product would give investors exposure to ETH, the second biggest digital coin by market cap, via shares that trade on a stock exchange.\n\nAD\n\nAD\n\nBut Wall Street’s biggest regulator has been slow to give a response to applicants, and has pushed back decision deadlines, echoing its earlier approach to spot Bitcoin ETF approvals before finally pulling the trigger in January.\n\nThis is usually normal in the ETF application process, but the SEC’s reluctance to talk about the investment vehicles has led analysts from the likes of Bloomberg and CoinShares to say that such crypto funds would not get the green light by the May deadline.\n\n“As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial,” wrote David Han, institutional research analyst at Coinbase.\n\n“Even if the first deadline on May 23, 2024 encounters a rejection,” he added, “we think there is a high likelihood that litigation could reverse that decision.”\n\nAD\n\nAD\n\nLast year, crypto fund manager Grayscale won an appeal against the SEC to convert its Bitcoin fund into a spot ETF in a high-profile case.\n\nThe SEC then reluctantly said yes to 11 Bitcoin ETFs on January 10. The investment products have since been massively successful, taking in billions of dollars of inflows.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMingJBVV95cUxPZGkzUFU2QVRJVVltN1VmX2hSa3JvRms1UEoyY0lNelA2a1laa1MyRlctUlFrbk1hdVNLYUtJMEtlQ2dEbERiLTE4elVLNm1pVDNYaFdzYzV6eW1iQVE5MW95T3BJWWI4ZmdNRHR2b1NVZWZsdVBjUjlmMDlaVUFEeEtkRmRqV1hXY0szTWZLUHdxUGZZc0hpNjBVTGpfalZNWXJpSGZuMGlCTDlBcFVxTy1kSExxa2E1WFBXbk5NWl9IYzRzZERTT2ZsX3JwakdFRzVoRDUySGJfMVJtd1NMSkFWS1lHXzZsdWUzNXcwMTNweVB4UXEzX1Z1TnpYendHZTlVU1o0UWdDQ043U2JVdEwzSGhjcnRVSlN5U3Fn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Brothers charged with stealing $25 million in Ethereum in 12 seconds — Cryptocurrency heist exploited transaction validation process - Tom's Hardware",
        "content": "In what U.S. prosecutors are calling the first case of its kind, a pair of brothers have been charged with stealing $25 million worth of cryptocurrency in just 12 seconds. They're now charged with wire fraud and money laundering for the April 2023 heist.\n\nAnton Peraire-Bueno, 24, and James Peraire-Bueno, 28, were reportedly educated at the Massachusetts Institute of Technology (MIT) in mathematics and computer science. Using the skills they learned at MIT, prosecutors say the duo found a way to exploit the Ethereum transaction validation process.\n\nThe brothers allegedly used that exploit to gain fraudulent access to pending transactions on the Ethereum blockchain, a public ledger that records and validates cryptocurrency payments.\n\nThe pair was arrested on May 14 on the indictment handed down from the United States District Court of the Southern District of New York. The indictment against the brothers was unsealed (PDF) on Wednesday, May 15, 2024.\n\nInvestigators say the brothers altered enough transactions in 12 seconds to redirect $25 million in cryptocurrency to themselves instead of the intended recipients.\n\nIn a press release, U.S. Deputy Attorney General Lisa Monaco stated that the brothers used \"a technologically sophisticated, cutting-edge scheme they plotted for months and executed in seconds.\" She also explained that agents from the Internal Revenue Service (IRS) played a crucial role in solving the riddle of where the cryptocurrency went.\n\nA representative for Ethereum confronted the Peraire-Bueno brothers, but they refused to return the funds. Instead, they worked to launder and hide their ill-gotten gains, prosecutors allege.\n\nStay On the Cutting Edge: Get the Tom's Hardware Newsletter Get Tom's Hardware's best news and in-depth reviews, straight to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nU.S. Attorney Damian Williams stated the exploit \"calls the very integrity of the blockchain into question.\" Even though this theft was the first of its kind, prosecutors are prepared to uncover any other new forms of cybercrime. \"As cryptocurrency markets continue to evolve, the Department will continue to root out fraud, support victims, and restore confidence to these markets,\" Monaco pledged.\n\nThe Peraire-Bueno brothers face one count each of conspiracy to commit wire fraud and conspiracy to commit money laundering. If convicted, they each face more than 20 years in prison."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE55dDhBZElYaDhWSGhiVk5mZmlUZjFaNnhWclQxX2RhRzl1cDlYUzNxYzhuWWtlXzZScXVKU19IWFY2Vi1mdVAyZmFtQ1Qxamlsa3B4RnJMTjBDOEUwal9Kc01EMzdxZmpMTm1VQUNGeDFkMDN0R21zbU5KMFlxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Bitcoin Rises 1.5%, Ethereum's Breakthrough to $5,000, and Why Furrever Token Is the Next Big Thing - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 17, 2024 (GLOBE NEWSWIRE) --\n\nThe crypto market is buzzing with excitement as Bitcoin experiences a 1.5% rise, signaling strong momentum for the leading cryptocurrency. Meanwhile, Ethereum is on the cusp of a significant breakthrough, with analysts predicting it could soon reach the $5,000 mark. Amid these developments, a new and captivating player, Furrever Token, is emerging as a potential game-changer in the crypto space. Combining the charm of cat-themed content with blockchain technology, Furrever Token offers a unique investment opportunity with the promise of astronomical returns. As Bitcoin and Ethereum continue to capture headlines, don't overlook the irresistible appeal and innovative potential of Furrever Token—the next big thing in cryptocurrency.\n\nBitcoin Surges 2%: Institutional Investments in Bitcoin ETFs Skyrocket\n\nBitcoin (BTC) is currently trading at around $65,738.46, experiencing a nearly 2% increase since yesterday. Over the past week, more than 600 firms have disclosed substantial investments in spot Bitcoin exchange-traded funds (ETFs) in their 13F filings with the United States Securities and Exchange Commission (SEC).\n\nAccording to the filing data, professional investment firms have reported owning $3.5 billion worth of Bitcoin ETFs. Major players include Morgan Stanley, JPMorgan, Wells Fargo, UBS, BNP Paribas, Royal Bank of Canada, and hedge funds like Millennium Management and Schonfeld Strategic Advisors.\n\nMillennium Management leads the pack with $1.9 billion invested across various Bitcoin ETFs, including BlackRock’s iShares Bitcoin Trust (IBIT) and Fidelity’s Wise Origin Bitcoin Fund (FBTC). Schonfeld Strategic Advisors follows with a $479 million investment, primarily in BlackRock’s and Fidelity’s funds. Boothbay Fund Management and Pine Ridge Advisers have also declared significant holdings in spot Bitcoin ETFs.\n\nMorgan Stanley stands out with a $269.9 million investment in the Grayscale Bitcoin Trust (GBTC), making it one of the largest holders. Other notable investors include Aristeia Capital, Graham Capital Management, CRCM, and Fortress Investment Group, each with substantial investments in IBIT.\n\nSpot Bitcoin ETFs, which launched in January, saw massive demand in the first three months. Despite a recent slowdown in inflows, the sustained interest from hundreds of financial institutions underscores the growing institutional confidence in Bitcoin’s potential. As Bitcoin’s price continues to rise, these substantial investments highlight the increasing mainstream acceptance and adoption of the leading cryptocurrency.\n\nStory continues\n\nEthereum's Potential Surge Amid SEC Decision Anticipation\n\nEthereum (ETH) currently trades at around $2,950.80, down 0.5% from yesterday but poised for a potential short-term bullish surge after a five-day stagnation. This momentum is fueled by discussions on declining revenue on the ETH Mainnet and the looming SEC decision on spot ETH ETFs.\n\nOpinions are divided on the SEC's verdict for VanEck's spot ETF application due May 23. Nate Geraci of ETF Store believes rejection is unlikely, citing past ETH futures ETF approvals and staking option removals. However, some speculate denial due to ongoing Ethereum security classification investigations.\n\nSEC scrutiny began in April 2023, yet ETH futures ETFs were approved in September, highlighting regulatory complexity. Ethereum now aims to surpass $3,000, facing resistance at $3,103 and $3,161. Short-term bullish sentiment is evident, with ETH long liquidations decreasing, open interest rising to 1.97%, and anticipation of increased price volatility pre-SEC decision.\n\n\n\n\n\nFurrever Token: Analysts Predict the Next Big Thing in Crypto\n\nFurrever Token (FURR) is capturing the attention of the crypto world, with analysts predicting it could be the next big thing. Built on the BNB-20 blockchain, Furrever Token stands out by combining blockchain technology with the universal appeal of cute cat imagery. This unique approach transforms everyday crypto interactions into delightful experiences, featuring charming cat-themed stickers, emojis, and visuals that enhance user engagement.\n\nOne of the key features driving interest in Furrever Token is its engaging community challenges. These regular events encourage users to share their love for cuteness and participate in fun activities, fostering a warm and inclusive community atmosphere. The project also promises future exclusive content, ensuring that the community remains excited and engaged with new and delightful surprises.\n\nSecurity and compliance are top priorities for Furrever Token. The smart contract has been audited by Securi Lab, providing a safe and trustworthy platform for all users. Additionally, the team’s tokens are locked for a year, demonstrating a commitment to the project’s longevity and stability.\n\nFurrever Token's impressive tokenomics include a total supply of 9 billion tokens, with 65% allocated for presale, 25% for DEX allocation, and 10% for the team. The presale has already raised over $1.1 million, nearing the end of its stages and aiming to raise $1.9 million. With a current price of $0.000648, Furrever Token offers an attractive entry point for investors.\n\nMoreover, Furrever Token has launched a $20,000 Highest Total Buys Competition, where 10 lucky winners will share the prize. The competition runs until May 27, 2024, providing an additional incentive for new investors to join the community.\n\nFurrever Token has gained organic growth with nearly 4,000 members in its active Telegram channel. This growing community and the project's innovative approach position Furrever Token as a promising investment opportunity, blending the charm of cats with the potential of cryptocurrency for unparalleled rewards. Don't miss out on being part of this adorable revolution in the crypto world!\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nJoin $20,000 Furrever Token Giveaway\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPdWtMQXhEQzY1TzlibWU3U21ZenFFWmF6b2N1MFdYbE9VSEI1S0gwM0piWUY2d2NKWTZ3UDJNdGdzZzI5UHZwMWExS0x0cGhHa0lOOU9DYThYRkZBOF9PY0JNZTRaTWFUVzRtT1IyckNZaVVmX2twLUwzczhRRHB0ZVduYlROZGFZb0lFVWh3b0FuaDlhajlCcHVDWk9xNGFxNkdV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "SEC approval of spot ethereum ETFs would benefit all investors - American Banker",
        "content": "The SEC, having already approved spot bitcoin ETFs, ought to follow through and grant the same approval to spot ethereum funds. Doing so would create a new surge of investment, with positive economic impacts, writes Rachel Lin, of SynFutures. Unshu - stock.adobe.com\n\nOpinions vary widely on the potential approval of spot ethereum exchange-traded funds, or ETFs , by the U.S. Securities and Exchange Commission . Despite mounting uncertainty about when or if the regulator will approve the new financial instrument, there is optimism ahead pertaining to the prospects of an ethereum ETF approval — akin to the fervor for the once long-awaited bitcoin ETF .\n\nThe BTC ETF proved pivotal in driving institutional interest in the digital asset class, particularly in regions like Hong Kong, Singapore and Dubai, where investors sought new growth opportunities after missing out on the stock market surge. Its success was the impetus to drive investors that once shunned cryptocurrencies to finally make the leap in a more secure fashion.\n\nAs the second-largest digital asset, ethereum boasts a vast ecosystem that positions it as a front-runner in the digital economy. Regulatory clarity, coupled with institutional investment, is poised to propel ethereum to unprecedented heights. Beyond mere price action, the approval of ethereum ETFs holds symbolic importance, solidifying crypto's status as a legitimate asset class and reinforcing its role in the evolving financial landscape.\n\nThe trend toward regulatory clarity is unmistakable, evidenced by the SEC's acknowledgement of ethereum's non-security status in permitting futures trading. This sets a clear precedent for the approval of a spot ethereum ETF. To deviate from this path would not only highlight regulatory ambiguity but also undermine market confidence. Moreover, proactive regulatory initiatives in various jurisdictions like Hong Kong, where plans for spot bitcoin and ethereum ETFs have just been greenlit, highlights the growing global acceptance and recognition of the potential of ethereum-based financial instruments. These developments underscore the urgent need for the SEC to align its regulatory framework with evolving market dynamics and maintain competitiveness in the global landscape.\n\nUndoubtedly, market demand from institutional investors serves as a driving force behind the push for ethereum ETF approval. The lineup of heavyweight players eagerly awaiting the green light — BlackRock, Fidelity, Invesco with Galaxy, Grayscale, VanEck, 21Shares with Ark and Hashdex, and most recently Bitwise — underscores the potential for ethereum ETFs to unlock new avenues for investment and liquidity. This influx of institutional capital could not only boost ethereum's market profile but also catalyze the development of more sophisticated products and services within the ethereum ecosystem.\n\nCryptocurrency House votes to nullify crypto custody guidance; Biden vows veto The House advanced a resolution that would roll back a Securities and Exchange Commission resolution that banks argue cuts them out of the crypto custodying business, but President Biden said he would veto it if it passes the Senate. May 9\n\nMoreover, the fact that the global ETF assets under management, or AUM, have exceeded $11 trillion suggests that investors are increasingly turning to ETFs as a preferred investment vehicle. While ETFs represent 13% of equity assets in the United States, indicating a significant adoption rate, their penetration is comparatively lower in Europe (8.8%) and the Asia-Pacific region (4.6%). The lower penetration rates of ETFs in Europe and the Asia-Pacific region suggest potential opportunities for growth. As more ETF products become available tailored to regional preferences and regulatory requirements, we may see a further expansion of the ETF market globally.\n\nConsidering the lessons learnt from BTC ETFs and the increasing recognition of crypto as a viable alternative asset, especially in a cooling economy, ETFs offer a less burdensome and tax-efficient means of exposure to cryptocurrencies. They simplify the complexities associated with owning crypto outright and broaden accessibility from individual retirement accounts all the way to large institutional accounts.\n\nThe broader impact of ethereum ETF approval reverberates across both short and long-term horizons. In the short term, we can expect increased trading activity and price volatility for ethereum and altcoins in the days leading up to the SEC's decision. However, in the long run, institutional adoption facilitated by ethereum ETFs could spur ecosystem growth, paving the way for a more robust and diverse range of financial instruments. Moreover, approval would provide much-needed regulatory clarity, particularly for ethereum-based financial products, mitigating uncertainty and fostering a conducive environment for innovation.\n\nIn light of the regulatory precedent, global trends and market demand, it appears increasingly likely that the SEC will grant approval for ethereum ETFs, notwithstanding delays and regulatory hurdles. I confidently predict that this will propel prices of bitcoin and ethereum to new heights. These milestones will reflect the growing confidence in cryptocurrencies and herald a new era of mainstream adoption and acceptance.\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMWxhdWk0RV9kWHpQdmVWWmxMYjVBVkxJMXhOdG9yM2dOeUliTmZ3M1lBdEs4YllReVV2UmVRa3NQZ0FKbGM5T0Vfd0dHS1Ewbm9lazNjMTBfb0JVdzNjeWdQREtISEtmTFFnVUxZbzJIa2N4WFg2dzYyMnRIcWdNQzlqbHRIS2hxQUpHYmVaVHNuQ0JQQmxaejZBQlNmX3VWb3U3VmVlanl5WFdxT05sQk1ac3XSAboBQVVfeXFMUEhfVDRHd2h6cXBRRWdyVlRDY05yTTAwSWNBeWtZeV9BVlZDX2hkTENDcDZMSEVWRFdMdkdVR0tpc19RRHRFUHFjQVBCT2hhdTNJLTgxdm1zbGwyT3ZEVGFadGpqZ2tDRnJhSmN6ai1UNHFwa0VPSDBkZFFnanVpQUt4aU9pUHhYSGZyVmtRWjl0X1VVd3ZpNjJhanEtMlVVbFhJbWVMNG9XTUJ1ZzRjaGpaaU9PVjJPWkJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ether Could Surprise to the Upside in the Coming Months, Coinbase Says - CoinDesk",
        "content": "Ether Could Surprise to the Upside in the Coming Months, Coinbase Says\n\nThe cryptocurrency does not have major supply-side overhangs such as token unlocks or miner sell pressure, the report said.\n\nBy Will Canny May 17, 2024 at 10:04 a.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQVmg1MWJSNHhfTzFFd3FfeTB3VXZDYzU3R2YzUkgyUm41ZlltbUtndF9uMF9ERmgxUkRYZy1JVzJuT2d2RjQteEFmTDRUS1BPLW10X3RJczktVXdiZ1EwNnh5VkFQUDFVTExna1JuSU9FN21mS2VIb2VSTDJYSW5EZUdONzlMYWdjVm5udEwyVdIBlAFBVV95cUxPX1ZvTk9mMXhhc0hlRWlfOGhJYlZsTjBTQ3Mza0JESkdBQUJ5aGVnQmNtekhUVnR2Ym5QZGE3enZpWEJMMmlueFVldFlqT3V2dUZiQk9WMmpSRnkyYjBxbTFKMElqX29pRjY2aVFocDNVVFk4YnZZaXNUdzZuc29aaDRmLVZXdlhjbjBab3JXSGlpaWVG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ancient Ethereum Wallets Unload a Lot of ETH Amid Major Price Breakout - U.Today",
        "content": "In an eye-catching development, ancient wallets connected to Vitalik Buterin, the cofounder of Ethereum (ETH), have resurfaced amid the current surge in ETH prices.\n\nAdvertisement\n\nReports indicate that 200 ETH, equivalent to a staggering $600,000, originating from the very wallets that once funded Buterin's ventures, have recently been traced to a transaction with the U.S.-based cryptocurrency exchange, Kraken.\n\nThe saga began nine years ago when an address known as \"0x5eD\" initially funded Vitalik Buterin's wallets. Just two days after this historic transaction, a substantial amount of 2,000 ETH was swiftly transferred from \"0x5eD\" to another address labeled \"0x2FE.\" Remarkably, these ETH holdings remained dormant within \"0x2FE\" for nearly a decade, until they were abruptly sent onward to \"0x9D2.\"\n\nAdvertisement\n\n200 ETH ($600K) from the address that originally funded Vitalik’s wallets has just been sent to Kraken.\n\n\n\n0x5eD, after funding Vitalik's wallets 9 years ago, sent 2,000 ETH to 0x2FE - only 2 days later.\n\n\n\nThis ETH was held for 9 years in 0x2FE before being sent on to 0x9D2, an… pic.twitter.com/Ytq0FcSX2K — Arkham (@ArkhamIntel) May 17, 2024\n\nThe most recent twist in this enigmatic narrative unfolded mere hours ago, when \"0x9D2\" deposited 200 ETH back into Kraken.\n\nEthereum (ETH) price outlook\n\nThe timing of these transactions is particularly noteworthy, occurring against the backdrop of a significant uptrend in the price of ETH.\n\nETH to USD by CoinMarketCap\n\nDuring today's trading session, the price of Ethereum is up almost 6%, reaching a high of $3,110 in the last week and a half. Importantly, over the past three days, the price action has almost completely reversed the decline of the previous nine days.\n\nAs a reminder, the deadline to accept or deny an Ethereum spot ETF is coming in less than a week and is the first of its kind among altcoins.\n\nWhy old wallets associated with the founders of Ethereum are sending tokens to the exchange while the price of ETH is rising, and all this is happening a week before the decision on the Ethereum ETF, is perhaps the biggest question in the crypto world right now."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQ1ZqTzFtdFhXRGU2UGZkLUVLejlfNTlZN2VQVW1zWWJUeW5IeXlvM05rOEQ2UHM4Y3JMSTRja1kwVzZHLVE0azZXbmVZMnlfSXBLZ3BzdDZzaTk2QlhkbjFYTEc0WTdtM1I0cDB6ci1lb1BTOENXeHhRcGVoVVVHRUtIMmhQQk43bHlFaXlRLUtKaERDWEJYUE9aeVbSAaIBQVVfeXFMTnhoRy1OT2t2c0xqaHJxazQtSWlYa2E2dXY2RlljR1FHblVIMzV5UUJLdWJfdHRfbGJxaWpyeC1vR29PZGdaZWswZU5oVUZwNXVJNXQySTRlNHBmejFOOGlDb20tbFQ5YkZHOEx0enlFUGxnODQ5ZzFRaTRTZmNQdjdRM3pET215ZGMzTk5tanRsUXhNMzFMRVc3RUlMWmZyUl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price to Reach $10,000 by the End of 2024? Analyst Weighs In - CryptoPotato",
        "content": "TL;DR\n\nEthereum’s price recently surpassed $3,000, with analysts predicting further significant gains.\n\nDeclining MVRV ratio, negative exchange netflow, and potential approval of a spot Ethereum ETF in the US could drive ETH’s value higher.\n\nIs ETH Gearing up for an ATH?\n\nThe cryptocurrency market has experienced a significant uptrend in the past few days, with numerous digital assets rising to multi-week highs. Although not witnessing such a substantial increase, Ethereum (ETH) is also among the notable gainers.\n\nIts price surpassed the $3,000 mark, representing a 4% increase on a daily scale. Numerous analysts believe this could be the starting point of a bull run that can take place in the near future.\n\nThe X user Michael van de Poppe is among the optimists. He claimed recently that ETH is on its way to reaching a higher timeframe support level. “The good times are there in a few weeks’ time,” he assumed.\n\nCryptoYoddha was even more bullish, envisioning a price explosion toward the $10,000 milestone by the end of the year.\n\nLast but not least, World of Charts argued that ETH has started breaking the “falling wedge consolidation” on a 12-hour timeframe. “Trend is already up and expecting continuation towards $4500 in coming weeks,” the analyst forecasted.\n\nObserving Some Important Factors\n\nOne element signaling that ETH’s value could be on the verge of a rally is the Market Value to Realized Value (MVRV). It helps to identify if the asset is overvalued or undervalued. A high ratio suggests a market top, while a low one may indicate a good buying opportunity. The MVRV has been on a significant downfall since mid-March.\n\nAnother factor is ETH’s exchange netflow, which has been predominantly negative in the past month (according to CryptoQuant’s data). Shifting from centralized platforms towards self-custody methods is considered bullish since it reduces the immediate selling pressure.\n\nLast but not least, ETH’s price may head north in case of the approval of a spot Ethereum ETF in the United States. However, such a green light may also lead to the same immediate “sell-the-news” event witnessed after the BTC ETF approvals in January."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOTkFKMk5lR0xFQUVRZGJaa2x6ck10aVE1NEhyRmdfV1EwZWEydjhUUVVET1pScFFVd3dZODZhMENWWjZCMVNfSGNvLUlQMmFfRnVya3ZvVGFEQlAwMTFYLTl2RFA1X043WXE2YUJDYV9VOXVzcE5wVy1TRWxpcmphZVhDUS1wZUM5d2FNVHBjN2JMdUthTHgxajJlbFVsNV81SHN2YzBEcUx1TTQ5M3Z3Z05rVzI3WmFTUENTdjBidUIwNm9qZHfSAcsBQVVfeXFMUEVMLWZTZXdnR1luRnpEdkF2U2JmYnpsYlFPMXd6UEY4cXQtdGRNVFdFcWxEQ2JyNTA4UXlFMVBBVDN0aGhBLVBxdXBtbWRtUFNyMFlnZjJkUGJyM01LeXJCa0RXNVhIRkphNHZVT2s5a09HbFVUOUNSUkFpaW02ZDZHR29hZnFCQW5uaTN5cG1qMjFaZ0t2djVfWldXZ1Znb1JFZEVrOER0c0R6eUdnV2hDOFJrSmRobFBtaW9YR0dlYk9rLWdhN0RvOWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum Flashing Bearish Signal, According to Crypto Analyst Benjamin Cowen – Here’s His Outlook - The Daily Hodl",
        "content": "Widely followed cryptocurrency analyst Benjamin Cowen is warning that the price of Ethereum (ETH) could depreciate drastically.\n\nCowen tells his 801,000 YouTube subscribers that Ethereum has fallen below the bull market support band (BMSB), an indicator consisting of a 20-week simple moving average and a 21-week exponential moving average used to determine whether the price of an asset is in bullish or bearish territory.\n\n“The last time that Ethereum fell below its bull market support band was actually about 30 weeks ago. Or the last time it was below its 20-week simple moving average was about 30 weeks ago. So it’s been quite a while and now we have closed below it once again.”\n\nAccording to Cowen, the price of Ethereum fell drastically during two previous times that closely resemble the current moment when the second-largest crypto asset closed below the BMSB.\n\n“In both cases, after it fell below the Bull Mark Support Band, Ethereum/US dollar then fell about another 50%…\n\n…50% from here [around $2,970] puts ETH all the way back down at around $1,400.”\n\nEthereum is trading at $2,902 at time of writing.\n\nThe widely followed analyst says that he foresees the Ethereum/Bitcoin (ETH/BTC) pair bottoming out over the coming weeks though the Ethereum/US dollar (ETH/USD) pair could take longer to form a bottom.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQSkdJZHV5clpmN0ZJbHNDWjNoWWFPdXA2aFhBbkU0T05Oc3E3NDJELUQ4WFBJTG1IV1dHWEc3Nll1Zzg4dUQ4R1ZiNlIwcGp1azlmMktEdjNjNEx0QkZPTFZ0R1FramR6bGFCY3NrU2g1RWctNllqa0NJdURTbXpYaVVSVFVMbU93QTRCQ2UyaUhIQjZJU0loUmZFaWVYdkZVMmhUTll5SXZNVFFDbjBfOHpwckhJWkJ3eFd0a2ZSeUtrWXAwY2M00gHMAUFVX3lxTE1HSUVWUy1aTEs1VlpZbzMzVlc4NXAxTXl2OThVTnNNWExtSlFIX3gwbVFhc2g1SkdqWkNDWDRsdkMzVXRaaFB5Z2swa2JqMlpnejVXSmQwVS1xWVJmNG5GRXhWUDAtUWJGdC01eHotbjFJWVBWX2ZwWWZWSnQ0YjhlQW1IdFB3U2lMUGREX0lLdkV6YTRKaWZLV0VoUkRlZHp1MmhmNHhPeFRTcEQxZWZCMXNpWmVTakV4cENPa3k3bzVtbkZnNlFaVUwtRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Billionaire Mike Novogratz Says New ‘Market Events’ To Propel Bitcoin, Ethereum and Solana Higher - The Daily Hodl",
        "content": "Galaxy Digital CEO Mike Novogratz is predicting that new “market events” will propel Bitcoin (BTC) and other crypto assets to the next leg up.\n\nIn Galaxy Digital’s Q1 earnings call, the billionaire says that a break out for Bitcoin, Solana (SOL), Ethereum (ETH) and other digital assets could still be a few months away, following a period of sideways trading.\n\nHe says Bitcoin could trade in a range of $55,000 and $75,000 until the upcoming US presidential election in November provides clarity on crypto regulations or the Federal Reserve cuts interest rates, which he believes could send crypto higher.\n\n“Listen, we had a lot of tailwinds in Q4 and Q1 – the adoption of the [Bitcoin exchange-traded funds] by far the biggest. That was the giant wake-up call that this is now an institutional asset. We also had the halving that we’ve now put in the rearview mirror. There was also a view that the Fed would bring rates down significantly this year and that view has changed. It’s changed in the market; it’s changed here in Galaxy and so I think we’re at a consolidation phase in crypto.\n\nBitcoin, Ethereum and everything else, Solana, will consolidate. What does that mean? It means [Bitcoin trades] probably somewhere between $55,000 and $75,000 until the next set of circumstances, the next set of market events brings us higher…\n\nI think that’s probably where we are certainly for this quarter, maybe next quarter until either (a) the Fed starts cutting rates because the economy finally slows or (b) we get through the election and I think the election will bring clarity, one way or the other, to the crypto regulatory landscape.”\n\nBitcoin is trading for $65,884 at time of writing, up nearly 7% in the last 24 hours. Meanwhile, Ethereum is trading for $3,019 at time of writing, up 4.4% on the day and Solana is trading for $155 at time of writing, up 8.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPakFzOEhEU2g2REMtc1dzQkdMRnN3MTcyUjdPNE43ZXZ5b1JjckhFdnN4QmNLUHNXS0N6WW8taFkxVV9rTTc2Z0VLR2VMYUNSV01YbW13b2IwRHZOZlRJU1QxRFRaS3lLQjF4M2djNkFYNTQyVGJIbTVoRDJuSlg3RkFTclQtVGNTZGl6QVlKUHZxOGQ0b3g3ZUNrS3RZWktLN0Vzdi0zVFhuSENzR3QyUk9KWTJ3T0twSDZibTdVempib1NlX3lfTUlXZkJtT18yaURNd2p30gHbAUFVX3lxTE9RR0JCelQ5b2xtWGVqS1Vtd2hkNnh6REFReXZlUHdjcElDcnQ0Sll0c0VYenpTWVVOTzF5WVNVeVp1NmFKSkFSbERUdXIxTHZlMUlhOVRSTVFyOHJWZkVtZTd4eHhidFM0QlJPUWxoaGszaFd5d2FHN21paElITjQyUkkyczZ2aFRDWHQzNkRtSWJqaUxIR1VXSVlQbktYSWNxU2tSeG1WejB5TzV6TzMwSGFTNk1seHhibk5zTHBJbElLSU4yY0pxUF9qcFR1WnkzWjF6aUtma2FHSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says Ethereum Competitor To Rip Higher, Predicts Outlook on Dogecoin and One More ETH Rival - The Daily Hodl",
        "content": "A closely followed crypto analyst predicts one Ethereum (ETH) competitor is about to have a massive breakout against Bitcoin (BTC).\n\nPseudonymous trader Kaleo tells his 638,000 followers on the social media platform X that the smart contract platform Avalanche (AVAX) could soar against BTC by more than 84% from its current value.\n\n“AVAX/BTC: I might be crazy bros, but I still believe AVAX rips higher from here.”\n\nLooking at his chart, the analyst suggests that AVAX/BTC is printing a bullish flag pattern on the daily chart and could soon reach 0.000950 BTC ($62.13).\n\nAVAX/BTC is trading for .000515 BTC ($33.89) at time of writing, down more than 3% in the last 24 hours.\n\nNext, the analyst predicts ETH competitor Solana is about to soar against Bitcoin (SOL/BTC) after printing a bullish pattern on the daily chart of higher high prices and higher low prices.\n\nHe believes SOL/BTC could soon cross the 0.0032 BTC ($209) level.\n\n“SOL/BTC: Solana is still one of the biggest no brainer long plays out there. Don’t fight strength.”\n\nSOL/BTC is trading for 0.00243 BTC ($160) at time of writing, up more than 3% in the last 24 hours.\n\nLastly, the analyst predicts that Dogecoin (DOGE) will breakout based on a 2021 pattern when the memecoin rallied after the soaring meme stock GameStop (GME) hit a market top. GME had a massive rally this week but has since retraced.\n\n“I’m going to make this simple for you. Here’s a chart of Dogecoin versus GME. You may not remember this, but it was GameStop that led the way back in early 2021. It wasn’t until after it topped that DOGE started sending. Dogecoin is overdue for a good pump. It’s almost time.”\n\nDOGE is trading for $0.15 at time of writing, up slightly in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/your/dTosh"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPVXdfRkg1MzBNa2JzX01KSjJxMEZDVlRXRnh2UnBHVVBvQmFtWjFtNU52Q3ZGNVBNZkNxMEZjeV92RTVJM3l2R01qYXR0cU1xaFd0cUlOaVRiblpiWXZwTkVuR0t6RkY5bWlmdU5hOHE5NFlLVlBEcERQYUhUZEwwdG5R0gGHAUFVX3lxTE5iNjZ4OWtfTnlwa0JKUW81QjNMcmR0TDZud1dKZ1lsazRkYVVkNzUyV2xIUThxa21uUWRQbEtnTmlTU0VSN3FIQUlNTDRES2ZycUpOY0FOYVZDbDRBUTdBWnJpVlVvcVotVFdReEtybHFqXzNpdUl1c2k1NVplZWMxTDVpZndxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Reveals Future of Ethereum and 'Free Internet?' - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVitalik Buterin, the cofounder of Ethereum, recently engaged in a discussion on X (formerly known as Twitter), shedding light on the future of Ethereum and the ambitious goal of building a free and open internet. This interaction, initiated by a tweet from Josh Stark, showcased a diagram illustrating different mindsets in the crypto community, ranging from definite optimism to indefinite pessimism.\n\nAdvertisement\n\nJosh Stark’s diagram categorizes mindsets into four quadrants: definite optimism, indefinite optimism, definite pessimism and indefinite pessimism. Stark labeled \"Crypto Twitter\" as oscillating between indefinite optimism and pessimism, which perfectly highlights the bouncing sentiment in the community that relies on most minor moves in the industry. In response, Buterin emphasized the importance of definite optimism, particularly within the context of \"crypto farcaster\" and \"Lens.\"\n\nCrypto farcaster is definite optimism. Lens too.\n\n\n\n2x points if you used a non-warpcast client at least once.\n\n\n\nNever lose sight of the ultimate goal: to build a free and open internet that is also trustworthy.\n\n\n\nCan't do that with theory and larping, need to actually use the tech. pic.twitter.com/RlVXMH0S2S — vitalik.eth (@VitalikButerin) May 16, 2024\n\nCrypto farcaster and Lens are platforms that embody definite optimism by actively working toward a decentralized and open internet.\n\nAdvertisement\n\nButerin’s message is clear: the ultimate goal of the crypto movement is to create a free and open internet. He cautioned against getting lost in theoretical discussions and emphasized the need for practical application of blockchain technologies. We have already seen the technology perform as a tool of decentralization in various digital fields. With Ethereum's role on the market declining, Buterin's call could be a signal for developers to amp up their attempts to build useful applications for users.\n\nHowever, Ethereum's recent performance has been somewhat challenging. Despite Bitcoin reaching new all-time highs, Ethereum has struggled to break through its previous ATH. The second-largest cryptocurrency by market cap has faced resistance and volatility, reflecting broader uncertainty on the market. This struggle highlights the importance of Buterin’s message: the need for continuous innovation and practical applications to drive the ecosystem forward."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQUVFpbVducFFJaFptSDJIVmFjcGwzMTNFamJsNTY3cWtGeGVyMkl1V29VYmtBcmVKZDg0U0FIdklRYlV2MmNCN0VDTWg0V3NUaTNySGZuNVFwLWs4ZUFoU1R1OXJYNV9yanlhOUxiNUlkUFBHMWQ4NHJTc0tPZVMwTEdUcGs1bFl3UVdQS0J5VU4wWi0zaEtvcnBtVVU3YnZPMXBKU3NLdVgwUlYyalhkNlNCcmJtTDRueVBldFI0VVJ4RUdIYkY1UTFKOU01Sjk3NGVTNjJCYXEyOUhNbHNuUdIB5gFBVV95cUxNMGd6cmVaMkhZU0d4LVVqSF9yQ0NjSU10UEd2RXI5dC12OW1mM2Q3V2NVTXRJUWowazlCLTY3bVFnaFRIUmxkb3pEZThFQ1lCd0ZXaVRmUXI5Y2xCanlkNVVGYU9ZemEyaXVXZjZ6cVJCc21XWW5lUW5LNkpzckxVa1B1b0JzdTBjckU4ZW9aSERObXRjczlNRExNbXFPQ1dwcm1KbzdDcGV2b0YtbnludXdLbHRhOUdTaTZhYUFEa3U2bUdKT0Y1LUdCM0YyT0I4UFdyZWNGSWF6U0Z6ZVR1dUEyYU9adw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "$25 million stolen in 12 seconds: MIT graduates pull off crypto heist in Ethereum blockchain scheme | Today News - Mint",
        "content": "The Federal prosecutors in Manhattan on Wednesday arrested two brothers who studied at the Massachusetts Institute of Technology, alleging they carried out a cutting-edge scheme to steal $25 million worth of cryptocurrency and exploit the Ethereum blockchain’s integrity, reported the New York Post.\n\nAccording to the report, the federal prosecutor identified the accused as Anton Peraire-Bueno, 24, and James Peraire-Bueno, 28. They cited that this was the first time that a fraud like this had ever been the subject of US criminal charges.\n\nStating that the Peraire-Bueno brothers executed their elaborate heist in April 2023, the federal officers say they stole $25 million from traders in just 12 seconds after fraudulently gaining access to pending transactions and then altering the movement of cryptocurrency.\n\n“As we allege, the defendants’ scheme calls the very integrity of the blockchain into question,” New York Post quoted US Attorney Damian Williams as saying.\n\nThe authorities have charged the Peraire-Bueno brothers with conspiracy to commit wire fraud, wire fraud, and conspiracy to commit money laundering.\n\nThe report also mentioned that Anton was arrested in Boston, while James was held in New York.\n\nThe Peraire-Bueno brothers attended MIT in Cambridge, Massachusetts, where they studied computer science and math. Prosecutors claim they used their skills and education to commit fraud.\n\nThe prosecutors claimed that both plotted for months to manipulate and tamper with the protocols used to validate transactions for inclusion on the Ethereum blockchain.\n\nIn addition, the prosecutors said that the Peraire-Bueno brothers exploited a vulnerability in the code of software called MEV-boost, used by most Ethereum network 'validators'. These validators check whether new transactions are valid before they are added to the blockchain."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPM2xQckJlV0R4MFMySmJQZHFXb2dIX3JNOF81d0liNF9taGxFX3g0SXhsb0V1dE14TG00NWQ2VDg2eklzUEt0YmF4bDE4LTF2YlhJQlZJVHJuc0dQcHRuLVBnX2dTOVVack1OYjFGN2Q4RVl1UFZCMnFHZlJqLXZGVkEwUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "MAOCAT Unveils Plan to Become the Next Top Ethereum-based Memecoin - Yahoo Finance",
        "content": "Maocat\n\nMAOCAT is a project that seeks to contribute to changing the memecoin crypto niche.\n\nHong Kong, May 17, 2024 (GLOBE NEWSWIRE) -- The MAOCAT project has officially stated its strategy to become the next big thing in Ethereum-based memecoins. With unique features like fixed staking, launchpad, and NFT marketplace, MAOCAT aims to offer a diverse ecosystem for cryptocurrency enthusiasts.\n\nAfter years of dog domination in the memecoin world, cats finally get to shine with MAOCAT's promising growth potential. The ongoing presale is just the beginning of this ambitious project, with more developments and features to come.\n\nHow This Team Plans to Launch the Next Big Ethereum-based Memecoin\n\nThe project's team believes MAOCAT could be the next big Ethereum-based memecoin to explode in popularity and value. Some hints of its potential already exist, such as the outstanding success of its current presale.\n\nAt the time of this writing, MAOCAT had already sold over 60% of its pre-sale allocation. Considering how fast the team reached this threshold, the growth indicates a high demand for this project.\n\nThe team's roadmap is divided into different phases. Specifically, Stage 1 includes:\n\nThe launch of MAOCAT.\n\nStaking opportunities for $MAO.\n\nThe creation of various social media accounts to connect with the community.\n\nIn Stage 2, users can claim their $MAO tokens and see them listed on exchanges. Additionally, the team aims to expand its presence on bigger and better exchanges while working on game development. The team is also excited to reach the milestone of having 10,000 holders of $MAO.\n\nFinally, Stage 3 will see the launch of the highly anticipated MAOCAT game and 10,000 NFTs. These unique NFTs will go live on the popular OpenSea platform and an NFT marketplace created by MAOCAT.\n\nThe Growing Ecosystem of MAOCAT: From SWAP to Launchpad to NFTs\n\nThere are four elements that make up the exciting and rapidly expanding ecosystem of MAOCAT. These elements include the MAO CAT NFT collection, an NFT Marketplace on ETH, MAO SWAP (DeFi 2.0), and MAO GAME.\n\nThe upcoming NFT marketplace will be a platform where users can buy and sell their unique MAO CAT NFTs. With NFTs' growing popularity, MAOCAT aims to provide its users with a seamless and secure marketplace experience.\n\nThe NFT collection will find its home in this marketplace. This feature will offer NFT holders a range of rarity tiers and unique benefits. Whether owning a rare or legendary MAO CAT NFT, users have multiple ways to be part of this exclusive community.\n\nStory continues\n\nThe ecosystem also includes MAO SWAP, a DeFi 2.0 platform allowing efficient and flexible trading through its innovative liquidity mechanism. With MAO SWAP, users can farm and stake their tokens to earn a fixed APR and other rewards.\n\nLastly, the upcoming MAO GAME will offer an interactive gaming experience with collectible NFTs as in-game assets. This particular mix of features goes beyond the typical memecoin project and focuses on token utility. The $MAO token lets users access all ecosystem elements and join various events, creating a great experience for MAOCAT supporters.\n\nAbout MAOCAT\n\nAt its core, MAOCAT is a project that seeks to contribute to changing the memecoin crypto niche. This sector is often entirely about dogs, which can surprise many, considering how popular cats are on the internet.\n\nBeyond the cat-based project, there's a rather large ecosystem in place for the MAOCAT community. This ecosystem will offer its users a range of benefits and opportunities, such as staking, trading, NFTs, and gaming.\n\nMAOCAT is gaining popularity and has already sold over 60% of its pre-sale allocation. In more practical terms, early investors bought over $300,000 worth of tokens in this phase.\n\nThe team behind MAOCAT has a clear roadmap for bringing this project to its full potential. The project's website is a great source for learning about MAOCAT's features and progress. As always, the social pages below let anyone connect with the community and stay updated on all things MAOCAT.\n\nX (Twitter) | Telegram | Instagram | YouTube\n\n\n\nDisclaimer: This is a press release and does not contain any financial advice. Readers should do their own research before taking any actions related to the company mentioned. You are solely responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. Cryptocurrency is volatile.\n\nCONTACT: James L. team at maocatcoin.org\n\n\n\n"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNaU45WjBlYmNDYzFQaFVJckI4dmZ4ODVwUWNUdC10LWc4eHRLTjlVOTRrR2NheEx4ZWNTU0JGRThLa1I5MGd6OXZ4UHIwVGxBRUM3WmhxbGxPODl5QUJmMnZ5ZkJ3WDVQeXl2YzFJQXpzWG1PamY5U0lYaGJObFFkNHFJZFRaalJ1bGl3S0czLVZLbUc0aUMycjh4X0VsV2s3RDNlQmlCUGw2RWxXdUVN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "$10,000 Ethereum (ETH) by Year-End? Analyst Makes Bold Price Prediction - CryptoGlobe",
        "content": "Prominent cryptocurrency analysts have recently expressed bullish sentiment on Ethereum ($ETH), the second-largest cryptocurrency by market capitalization, with one suggesting it will surge to over $10,000 by the end of the year.\n\nMichaël van de Poppe, a cryptocurrency analyst with over 700,000 followers on the microblogging platform X (formerly known as Twitter), expressed optimism, suggesting ETH is on track to reach a higher support level and added that the “good times are there in a few weeks time” after noting ETH is “at end stage of the correction.”\n\n#Ethereum is at the end stage of the correction.\n\n\n\nThere's around 10% more to be going down on it, as then we're reaching a higher timeframe support level.\n\n\n\nThe good times are there in a few weeks time. pic.twitter.com/21mZeSUAxx — Michaël van de Poppe (@CryptoMichNL) May 15, 2024\n\nEthereum is at the time of writing trading at $2,975 after losing around 2% of its value over the last 24-hour period and being flat over the past month, and while it significantly underperforms when compared to the flagship cryptocurrency Bitcoin ($BTC), which dropped 0.3% over the past 24 hours after moving up 8% over the last 30-day period.\n\nNevertheless, another cryptocurrency analyst, CryptoYoddha, took an even bolder stance and suggested Ethereum is set to surge past the $10,000 before the end of the year.\n\nAs reported, another popular analyst, Ali Martinez, has recently noted that the TD Sequential is presenting a “buy signal” on Ethereum’s daily chart and suggested the cryptocurrency could “see a rebound of one to four candlesticks” on its daily chart.\n\nThe TD Sequential indicator is a popular tool among traders and analysts for identifying potential buy or sell signals in the market. Developed by Tom DeMark, the indicator is designed to forecast the timing of price points where a trend could exhaust itself and reverse.\n\nIt does this through a series of numbers (sequentials) plotted on price charts, which are based on specific criteria related to the closing price of an asset over a set number of periods. When the indicator signals a “buy,” it implies that the asset’s price is likely to increase, making it an opportune time for investors to consider entering the market.\n\nFeatured image via Unsplash."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQa1hoVmJnVXNfZGNUVno3bXEwSW5ndjJmT0dnYXV5YkItWHVnZkhnb2lUU3dmdkJxNTNlOGk0MWZRM0NmT1ZfS1FiVWkydW5fOGVydUVlSkM0c0pfSDE2ejNkWXFuQTFRT2pKWEF0dnRwYkpDbHQzcUkwbDExLV9ObGlRNjLSAYwBQVVfeXFMTms3UXg2RlRpaUwwRHRhN09rbFhrM3ZGRTFxUlZYU2NWMVhIa0diMDJZdWdYLXd0U1o5TkxRQlFhSDJrdnpOWTBMQkFzdnFZSGh0VDlqYUpIcVhBUzF2aXN3emllcmxJaF81YzFaRnA4TDlIbVEtc0ZmUEpaQlpWSHdHaDg0NkJJYzkyWEg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Why Did DeGods Leave Solana for Ethereum? 'I Was Just Being a Pussy', Says Founder - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a candid tweet Thursday, DeGods and y00ts NFT project founder Rohun Vora (aka Frank DeGods) took a critical look at his previous decisions, especially those made during tumultuous times for the well-known collections. His reflection sheds light on the pressures of community expectations and being a founder.\n\n“I used to try to move mountains to appease the community in times of chaos,\" he began. \"Every single time it's backfired.\"\n\nThroughout the years as the leader of DeGods, he has made many decisions to try and please his holders and keep the buzz going. For example, the team went through many art changes, including a planned upgrade and self-proclaimed art “downgrade.” On Thursday, the team said that it would make no further art changes to DeGods.\n\nBut the biggest and most controversial move was bridging DeGods NFTs from Solana to Ethereum last year, along with y00ts from Solana to Ethereum sidechain network Polygon—though they then moved y00ts to the Ethereum mainnet and returned a $3 million grant from Polygon Labs.\n\nAD\n\nAD\n\ni used to try to move mountains to appease the community in times of chaos. every single time it's backfired. the truth is, on the internet you either stand by your conviction or you're a pussy. i've been a pussy in the past. like the bridge off SOL. everyone in the community… — Frank (33.3%) (@frankdegods) May 16, 2024\n\nMaking the decision to bridge the projects off of the Solana blockchain happened as the community was in a state of panic following the collapse of crypto exchange FTX in November 2022, which preceded Solana’s price collapsing to a low of about $8—roughly 97% from its 2021 peak.\n\nFrank, feeling the pressure, made the call to move the projects to the Ethereum ecosystem, which houses the most valuable NFT projects. He framed the move at the time as one designed to elevate DeGods into the big leagues of NFT culture.\n\n\"Like the bridge off SOL,” Frank wrote. “Everyone in the community was panicking (myself included) during FTX. I tried to fix their anxiety. In reality, I was just being a pussy.\"\n\nAD\n\nAD\n\nFrank contrasted his past actions with his current mindset, emphasizing the importance of standing by your convictions.\n\n\"The truth is, on the internet you either stand by your convictions or you're a pussy,\" he tweeted. Frank stressed that succumbing to short-term pressures and seeking immediate approval often backfires. It’s a lesson he learned by leading one of the most prominent NFT projects, and one that has faced considerable challenges—many self-inflicted, as he admitted.\n\nFrank recently announced the launch of an optional bridge back to Solana for both DeGods and y00ts. This move allows the community to decide whether to stay on Ethereum or return to Solana, reflecting his desire to provide flexibility and choice. There are no strong-armed incentives this time around. It's just an option.\n\n\"I said I want to allow our community to come back home and I meant it. I still do,” he wrote, though they launched the latest bridge with decidedly less fanfare than the original.\n\nDecrypt reached out to Frank for additional comment, but did not receive an immediate response.\n\nFrank’s tweet offers a raw and honest look at the challenges of leading an NFT project amid the constant demands of holders, particularly amid a diminished market for such assets. The bridge back to Solana and increasing openness about the past appear to be moves to atone for lingering regrets, all while the projects attempt to move forward.\n\nyou can now bridge your DeGods & y00ts between solana & ethereum. pic.twitter.com/EXCIwcvbY5 — de (@delabsxyz) May 1, 2024\n\nAD\n\nAD\n\nLooking forward, Frank expressed his belief in building a robust and resilient community, rather than one that constantly seeks validation through reactive measures.\n\n\"I believe that antifragility is the answer,” he wrote. “That's my conviction. Not just building the best community, but the strongest one.\"\n\nEdited by Andrew Hayward"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE0tbzVndVYyVFNZSGd5d1p2eWRDT05uOEpacTYyc0JacmVNd0dQdy1rVE80cXVxamtrcW9KSTJ0MWxKRW12Z3gwdUhWemp6Sm5zRWZQS0dyUkVUWlNoMjJ6WVl4WkE5WWfSAWxBVV95cUxNa1hpekxnRkNaQXE2SXNhY3MwQk8xX1NReVRzajJaUjc3RDd2aUlRMUZKcFdaM05JU2ctWWJoaGFTeDBoYUtNZ3RzOFFxM1MtTmJmczAwelJlTEoxczNNMVJyNlRfUm5yb28wY0c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 15:11:26 GMT",
        "title": "Ethereum (ETH) Price Prediction for May 16 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA further market decline can be postponed, according to CoinMarketCap.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe price of Ethereum (ETH) has risen by 0.83% since yesterday.\n\nImage by TradingView\n\nDespite today's growth, the rate of ETH is looking bearish on the hourly chart. If the daily bar closes below the local support level of $2,973, bears may again seize the initiative, which can lead to a drop to the $2,900 zone.\n\nImage by TradingView\n\nBulls could not keep the rise going after yesterday's bullish closure. If the situation does not change by the end of the day, there is a chance to see a test of the support of $2,852 until the end of the week.\n\nImage by TradingView\n\nFrom the midterm point of view, none of the sides is dominating as the price is far from the main levels.\n\nHowever, if buyers lose the $2,900 zone, the accumulated energy might be enough for a breakout, followed by a move to the $2,600-$2,700 range.\n\nEthereum is trading at $2,957 at press time."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQY0ZYTVhqdk1Rbm02WFpTTlNsSGNsZWNmY0dlelREaWkxY2tLSXBOZUViUU5wblFOb2MteTA1c0kxZEVfbUFNNURLUE1oZzlYd2F5bC1ka3J2b1BMUUp2X3Y5ZzFhamp3ZmlNLUh6anJBeTdSdkJraGZ3aW9BRjhFek1OWnA0WklaUm44ZTNzNmZ1a0dWSzhGZl9xNWN4MTlLV2lNc29HNU9OQVNSN2MwVlBwRE53Zmdsem1DMTNfWmhRdmNMVzZJZFNsaXJBZEVMMGRmZ2ZYQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Undergoes Technical Correction: Market Adjusts After Recent Increase - TradingView",
        "content": "Ethereum price tested the $3,040 zone and corrected gains. ETH is now testing the $2,925 support and might aim for a fresh increase.\n\nEthereum started a downside correction after the bears defended $3,040.\n\nThe price is trading below $2,960 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bearish trend line forming with resistance at $2,965 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh increase unless there is a close below the $2,925 support.\n\nEthereum Price Dips Again\n\nEthereum price started a fresh increase above the $2,950 and $2,960 levels, like Bitcoin. ETH even cleared the $3,000 level before the bears appeared near $3,040.\n\nA new weekly high was formed at $3,039 and the price recently started a downside correction. There was a move below the $3,000 level. Ether dipped below the 50% Fib retracement level of the upward move from the $2,860 swing low to the $3,039 high.\n\nEthereum is now trading below $2,960 and the 100-hourly Simple Moving Average. However, the bulls are active near the $2,925 support and the 61.8% Fib retracement level of the upward move from the $2,860 swing low to the $3,039 high.\n\nImmediate resistance is near the $2,960 level. There is also a connecting bearish trend line forming with resistance at $2,965 on the hourly chart of ETH/USD.\n\nNewsBTC\n\nThe first major resistance is near the $3,000 level. An upside break above the $3,000 resistance might send the price higher. The next key resistance sits at $3,050, above which the price might gain traction and rise toward the $3,150 level. If there is a clear move above the $3,150 level, the price might rise and test the $3,220 resistance. Any more gains could send Ether toward the $3,350 resistance zone.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $2,965 resistance and the trend line, it could continue to move down. Initial support on the downside is near the $2,925 level.\n\nThe next major support is near the $2,900 zone. A clear move below the $2,900 support might push the price toward $2,850. Any more losses might send the price toward the $2,740 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,925\n\nMajor Resistance Level – $2,965"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObEp4VkhKdFJ3VWtvbnF0dkYzOUhiSmlVOThESTZxSk5ab01lZXZUZ25idkpvbk1jczY5MnM5dG9LMlhSLTdUM0k0eF82eXo4TE1rS3g2aVMxSVJtRDdqMnNPLWJSZ1RTaXp6cXVpOGZsakR1aU1CYnFYQmdGZi1PcGVVdEhFazl4dTByc0hySWV4VGhLZ2VF0gGcAUFVX3lxTFA2VkR5bnlMM3F4MW9DWEVXOFFXZHZRTWNSRkZOQmN6MG1TZ2R6a0EydDhpUVhkai1VUHJlMW9NY2lXUjluRGo4aUFqaTBLVHFzY0tHTl9rUEtPdWM1VDl3eWppRXBOc1dLQkdWLUpLdzUyUGFqN2JyREN5V2NkbkdCSmRCRUlzTG5iTGhBRTJRSXdqUFd5VlVJWFJJZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH): Can Buyers Bounce Back From This Range Low? - Blockhead",
        "content": "Ethereum (ETH) buyers held the price floor at the $2.9k support level, as selling pressure continued to persist. Over the past month, ETH has traded between a broad price range with $3.2k serving as the range high and $2.9k serving as the range low.\n\nWith ETH trading just above the $2.9k support level, it has presented buyers with an opportunity to leverage the price zone for a possible reversal.\n\nPrice Range Offers Long Opportunity\n\nETH’s latest price rejection came at the range high of $3.2k on May 6. This brought another wave of selling pressure that saw the altcoin retest the range low of $2.9k. However, it also presented an opportunity for buyers to rally.\n\nETH/USDT on TradingView (4H Timeframe)\n\nAnalyzing the previous price action in the trading range showed that ETH had successfully achieved bullish rebounds thrice from the support level. This makes it a solid price zone for buyers with the tendency for a repeat of the price movement.\n\nA look at the chart indicators indicated bullish movement. Capital inflows rose to +0.08 as indicated by the Chaikin Money Flow (CMF). Yet, the selling pressure kept the Relative Strength Index (RSI) under the neutral 50 mark. Bulls will need the RSI to flip bullish for a sustained upward rally.\n\nBuyers can consider entries at the current market price of $2.9k with a target zone of $3.1k to $3.2k. However, a bearish candle close below the $2.9k support level would invalidate the bullish thesis and interested buyers would have to consider the $2.7k support level for new entries.\n\nETH Long/Short Ratio | Coinglass\n\nTraders in the futures market leaned slightly bullish on the higher timeframes which could serve as encouragement for spot traders. However, the tight margins mean the trades could easily swing either way and open long positions should be managed properly to avoid getting caught out by sharp price drops.\n\nDisclaimer: This article does not constitute trading, investment, financial, or other types of advice. It is solely the writer’s opinion. Please conduct your due diligence before making any trading or investment decisions."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNWURhU0xaa05pWEhBU3RKOXc1S01rR0tITnQzQmxwYmhVN241V3FQNTR0TlZKRHBKdUdiZ3dJOUhIaG1yMjlqeXdzS2lHeGI0cmN4bm9kU1V3RkdrU0ktWlFYT0kwZlpZNS1LckYzbGhURzJSaUFuWlNqZ3gyRnhtVzJxSzV1a2NYdjNTdmhyaFV4enE1VWxN0gGcAUFVX3lxTE9IVW5jeTFmUFVrUmdnRElDYldWaGgzalhxV1VJbVpmbDF0Q1VORTlhenp6SGNBTWI5RlMyNFJVZS11ODRvYl9FTUhiaF9rSVhSUVFia1JZVEN3MURvTDhyckN5UFYzaUdVM1ZJcjk1cXJFaWh0VkVUaGEzU181Mjd2YjNVVHlaSmxybUhZdk5mTGFnUElFdVBIS0J2Sw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Top 4 Ethereum Meme Coins to Buy in 2024 for $100,000 Profit Potential - CoinGape",
        "content": "This week has been notably bullish for the cryptocurrency market as the Bitcoin price showed a notable rally from $60000 to $67000. Amid a sudden change in market dynamics the meme sector often shows a major move due to their inherent volatile nature and susceptible to speculating trading. The opportunity seekers can consider Ethereum based meme coins to buy such as Shiba Inu Coin (SHIB), Pepe (PEPE), Floki (FLOKI), and MOG Coin (MOG) projecting the potential of substantial growth.\n\nThe Meme coin frenzy is abuzz in the crypto space, with Solana-based and Ethereum-based meme coins leading the charge. Ethereum’s popularity in the meme coin sector stems from several factors. It has a vast user base, ensuring extensive reach and adoption. Additionally, Ethereum’s integration with DeFi applications offers added utility to meme coins.\n\nadvertisement\n\nDespite Solana’s growing presence, Ethereum’s established network and extensive ecosystem continue to dominate the meme coin landscape, making it the go-to platform for these digital assets.\n\n1. Meme Coins To Buy – Shiba Inu Coin (SHIB)\n\nShiba Inu Coin (SHIB) continues its impressive rise in decentralized finance, marked by a robust 12% value surge. Known as the second meme coin, SHIB has shown a 7% increase over the past week, signaling a bullish trend.\n\nCurrently priced at $0.00002447, SHIB is poised for further growth and maintains its upward momentum. It holds the 11th spot on CoinMarketCap, boasting a market cap of $14.42 billion.\n\nThis ascent is driven by several factors, including heightened trading activity, strategic token burns, and the rise of other meme coins like BONK, BOME, and WIF. Additionally, the rollout of Shibarium plays a significant role in SHIB’s appeal.\n\nThese elements collectively make Shiba Inu an attractive prospect for potential investors aiming for substantial returns.\n\n2. Pepe (PEPE)\n\nPepe (PEPE), an Ethereum-based cryptocurrency, is also gaining significant attention. With a current market cap of $4.04 billion, Pepe coin has secured the 24th position in market rankings. The Pepe price stands at $0.000009691, experiencing a remarkable 482% surge over the past year. This performance marks PEPE as the leading meme coin on CoinMarketCap.\n\nOver the past week, PEPE has seen a significant 20% rise, solidifying its status as a key player in the altcoin market. Its recent value surge following a bullish breakout positions PEPE as a prime option for investors looking to capitalize on the altcoin season in the 2024 bull run.\n\n3. Floki (FLOKI)\n\nFloki (FLOKI), initially known as a meme coin, has now made significant strides in the Web3 space. Incorporating aspects of the Metaverse, decentralized finance (DeFi), and non-fungible tokens (NFTs), it has earned the nickname “The People’s Crypto.” Floki’s blend of meme appeal and real-world utility sets it apart in the cryptocurrency sector.\n\nAccessible on both the Binance Smart Chain and Ethereum, Floki is available as BEP-20 and ERC-20 tokens, respectively. FLOKI recently experienced a notable surge following the approval of a major token burn proposal by the FLOKI DAO.\n\nThis development, along with recent major listings and exchange integrations, has sparked optimism within the FLOKI community, suggesting a potential continued rise.\n\nCurrently, the Floki price is $0.0002007, showing an 11% decrease in the last 24 hours. Despite this, it saw a significant 15% increase over the past week. The crypto community is watching closely, anticipating further gains in the 2024 bull run.\n\n4. MOG Coin (MOG)\n\nMOG Coin (MOG) is also making waves in the cryptocurrency world with its unique meme-driven approach. MOG Coin price value now stands at $0.0…06229, marking a 0.10% increase in the last 24 hours.\n\nSince the start of the year, MOG has skyrocketed by an impressive 3753%, positioning itself as a top affordable meme cryptocurrency for potentially massive gains in the 2024 bullish market.\n\nBottom Line\n\nEthereum meme coins like Shiba Inu, Pepe, Floki, and MOG are poised for impressive returns in the 2024 bull run. With the market’s upward trend, these coins present promising opportunities for investors looking to capitalize on the growth of the crypto market.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQOGRBTWJGMXZnZXM2VkFYNmVfYkhNdFZxRGRqRmVaZDdJcHgzeGpONW5Uc0x4Z2JaS3NsOXBrRWFabzFBTERZNk5YZTRIa0thcDFBdDhyR052N2g2c1NoRkEzeExRRF9nZGhQMEVVbkgzaHJIcGNQalJLdXo3WG03M3NOZ2EzSTlWRHdBYkp6Y0FtLUk4YlFKVFM3REY5UE5jX0lrMGcyRkNjQUszMC1mem1YZ2TSAboBQVVfeXFMUElvUjBLMUd0bHN1eF9DV3pvWU9wdFlEdENFb2ZybDdEYk9VTW1mRlpHRkYxS1h5YUcxLVN4MDFkZEtHMzFwMk1fSjdtNU1IRXUzelBBbk5QTVlsYjVkck01UUFHVU5OcHRhSDBROVp3ZUtMeWN0WlluUUxWM1owemRlX2JkS2cxeHRfYzBuRDJJaTFYQmdKZXlVcG1GN2oySEhIU1E5SEtHZlJEbHhzZzgwTHhsZzZFM1VR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 10:04:38 GMT",
        "title": "Ethereum and Shiba Inu Investors Pivot to DTX, Banking on Its Potential for Massive Returns | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum (ETH) and Shiba Inu (SHIB) are experiencing price declines, leading many investors to turn to DTX Exchange (DTX) for potential opportunities. DTX, a new presale crypto, has an impressive ongoing presale, cutting-edge trading features, and the potential for substantial gains even in a volatile market. It’s, therefore, no wonder that such a strong market leader would naturally influence ETH and SHIB investors. Here’s more!\n\n>>> BUY DTX TOKENS HERE <<<\n\nEthereum (ETH): Will It Get Over Its Poor Performance?\n\nMay 2024 saw a strong start for the global cryptocurrency market as investors heaped on cash inflows throughout the first week. But the market has not rallied as much since the first week of May ended, with bears erasing much of the earlier gains.\n\nEthereum (ETH), the second-largest cryptocurrency, felt the bearish pressure and saw a price decline, shedding some of its earlier highs. From the beginning of Q2 to the second week of May 2024, Ethereum’s (ETH) price declined by 21% from $3,648 to a low of $2,881.\n\nThe lacklustre performance of Ethereum (ETH) may be due to unfavorable perceptions and several setbacks regarding Ethereum ETF approval chances in the United States. Furthermore, the ongoing decrease in ETH open interest compared to spot market activity may hinder the possibility of Ethereum’s price surpassing $3,100 by the end of May 2024.\n\nShiba Inu (SHIB): Experts Anticipate a Rise to $0.00003 By the End of May 2024\n\nShiba Inu (SHIB) has been one of the best-performing meme coins in 2024. In the first week of March, Shiba Inu’s price jumped by 338.49% to a high of $0.00004534 from its starting of the year amount of $0.00001034.\n\nConsequently, Shiba Inu’s (SHIB) market cap grew from $6 billion to $21 billion in the same period. However, things have not been so rosy for Shiba Inu in Q2 of 2024 as SHIB has traded below the $0.00003 price level, erasing most of its earlier gains.\n\nStill, things look up for SHIB. Experts predict that the Shiba Inu coin burn in the second week of May could help push the price to the $0.00003 level by the end of May 2024. Conversely, a market downturn and a shift to a bearish outlook could see Shiba Inu (SHIB) tumble to $0.000022 in the same period.\n\nDTX Exchange (DTX) Attracting Investor Interest With Its Presale Gains and Potential for Growth\n\nInvestors are increasingly drawn to the new presale token DTX Exchange (DTX) as they seek more stable investment opportunities amidst the uncertain future of Ethereum (ETH) and Shiba Inu (SHIB). One of the reasons why DTX Exchange (DTX) stands out is its strong emphasis on security and wide range of features.\n\nIn addition, DTX Exchange (DTX) offers an inclusive platform that enables anyone to quickly start trading with its high leverage of 1000x. The signup process is straightforward, and there are no KYC requirements. In addition, the platform offers a DTX Wallet for secure cryptocurrency storage and various trading options for global equities.\n\nThe platform’s attractive features, such as lower trading fees, opportunities for governance participation, and the possibility of airdrops, make it an appealing option for individuals seeking to expand their cryptocurrency portfolio. In addition, DTX provides a trading platform that combines the advantages of decentralized and centralized exchanges, offering a wide range of features.\n\nDTX Exchange (DTX) successfully raised over $2 million in its private/seed sale and an additional $100,000 in a public presale, all within an impressive two-day timeframe. Given the current token price of $0.04, investors eagerly anticipate a significant increase of 50% to $0.06 in the next stage.\n\nGiven its cutting-edge features and strong market position, DTX is well-positioned to take advantage of the changing dynamics resulting from the ETH and SHIB movements. This makes it an excellent choice for investors looking for the best coins to invest in 2024.\n\nVisit DTX Exchange Presale\n\nJoin The DTX Community\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPYkpxVFFvdGRlcEFWdksxRmhXNGxEbmFkcks5eFZSZHJFNlpGSHl1MFRjdnU3UFItdnFFbU1GRjNtcEs0cEI3WVF0UllsWGg4cXFkazFtWHN6Y3NXQ0xBUG5Ld3N4TDE2Ni1MRFBoeUdjUXRvUFVPX09YMzZObThzUGlhU21zNUIwYWdMbVJKdmc1M0x4YklGVnRUQ2Z0bXZDYjd2SEN0NDk5bmVWV3k3X9IBvgFBVV95cUxPQ2ZJNnQ5MmdEWU9KSDA1eENPT2s2dmtUcjZ1cWNTcUM5cmZMUjRzemYxWjVDMVNXQS0yNG41Qlc5eFpiRmtWaDh2WHVaQW1ncWEzYVVFTkR6VVI4T2x1X0tUN0luaXNITF9JS1pYd2Y5YUw0VV91ZEhwQTBHVUJaeVBxMi1yNnpwMEVFS2VEWXRMMk15ZzFKZXJPdDkyUng5Vk81c0ZwcDdaTHJHV1VldjFPMm9ReGtBdktXY1pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum Code Review 2024: Is It Legit Crypto Platform? - Customer Feedback! - Outlook India",
        "content": "Step 1 - Registration\n\nThe first step is to register on Ethereum Code. You can visit the official website and click on Register. Fill out the registration form with basic information, such as name, date of birth, phone number, and email address. After you submit the form, the Ethereum Code verification team will verify all your information and will send a confirmation link to your email. You can click on the link and move to the next step.\n\nStep 2 - Fund Your account\n\nThere is no need to pay any registration fee while opening an account in Ethereum Code. The system is free of charge. However, users have to invest in their trading accounts. The minimum deposit required is $250 and it can be increased according to individual trading goals, risk tolerance, and other factors. This platform supports different payment methods, such as Credit/Debit cards, net banking, and wire transfers.\n\nStep 3 - Start Trading\n\nOnce you complete the registration process and fund your account, you can now start real-time trading. Select the cryptocurrencies or assets you want to invest in and set the parameters according to your trading goals. The system will automatically do the rest of the tasks based on price performance, risks, and market conditions. You can take charge if you want to handle things by yourself.\n\nRegister On Ethereum Code\n\nEthereum Code: Pros and Cons\n\nIn the last sections, we have discussed different aspects of the Ethereum Code trading system in detail. Here we will discuss the pros and cons of this system. It will help you gain a better understanding of whether investing in Ethereum Code is right for you. So, here are some of the pros and cons of Ethereum Code.\n\nPros:\n\nFree trading system\n\nSupports multiple assets\n\nUser-friendly and intuitive interface\n\nNo registration fee\n\nCustomization options are available\n\nThe latest technologies have been used\n\nOpportunity to diversify the portfolio\n\nFree demo mode\n\nAutomated trading\n\nSafety and security features\n\nProvides accurate market data\n\n24/7 customer support\n\nCons:\n\nA few countries, such as the United States, France, Cyprus, Iran, and Iraq have strict trading policies. As a result of this, Ethereum Code cannot be used in these countries.\n\nEthereum Code - Minimum Deposit\n\nEthereum Code is a free trading system and when we compare this platform to other trading systems, we can see that the former is quite affordable. There is no need to pay a registration fee while registering on this platform. No other fees like platform fees, deposits, or withdrawal charges are levied from the users. Users should deposit an initial amount of $250 to begin live trading. The amount can be increased according to individual choices. Users can also withdraw this fund at any time. It is important to note that customers are not charged any hidden charges or transactional fees.\n\nEthereum Code - Cryptocurrencies\n\nTraders can diversify their portfolios through the Ethereum Code trading system. They can invest in a wide range of cryptocurrencies through this single system. Some of the mainstream cryptocurrencies supported on this platform are Bitcoin (BTC) Ripple (XRP), Ethereum, Binance Coin (BNC), and so on. Apart from these, the platform also supports Forex pairs, CFDs, and other asset classes. Some of the cryptocurrencies supported on this platform are noted below.\n\nBitcoin (BTC)\n\nEthereum Classic (ETC)\n\nEthereum (ETH)\n\nRipple (XRP)\n\nBinance Coin (BNC)\n\nCardano (ADA)\n\nPolkadot (DOT)\n\nDash (DASH)\n\nMontero (XMR)\n\nRipple (XRP)\n\nYou can visit the official page, to view the complete list of cryptocurrencies supported on this platform.\n\nEthereum Code - Customer Support\n\nEthereum Code has an efficient team of customer support, who can help resolve any issue, such as technical, transactional, or trading doubts. The team is available 24/7 and users can reach out to them by calling their toll-free number or sending an email. The team consists of experts in resolving any issue and they also can help clear any doubts. You can view the Ethereum Code customer support details on the official website.\n\n\n\nTry Ethereum Code For Free\n\nEthereum Code - Countries Available\n\nThe Ethereum Code trading system is available in most countries across the world, except in some, where strict trading laws are implemented. So, here are the countries where Ethereum Code is available and traders can use it to make profits.\n\nMalaysia\n\nSingapore\n\nJapan\n\nHong Kong\n\nVietnam\n\nUnited Kingdom\n\nGermany\n\nBelgium\n\nSweden\n\nNetherlands\n\nFinland\n\nNorway\n\nSpain\n\nMexico\n\nBrazil\n\nPoland\n\nSwitzerland\n\nSlovenia\n\nSlovakia\n\nTaiwan\n\nThailand\n\nEthereum Code - Customer Reports\n\nSo far Ethereum Code has received positive responses from its users. By consistently using this platform many of them have made a lot of profits. They have also said that what made the platform efficient in terms of making higher profits is its user-friendliness, overall market analysis, and the integration of advanced technologies. With the help of this platform, users can identify the right trading opportunities.\n\nThe system has a Trustpilot rating of 4.6 / 5 and a Sitejabber rating of 4.3/ 5. So, the user responses and ratings suggest that Ethereum Code is legitimate.\n\nAuthentic reviews are available on different platforms, such as Reddit, Quora, and X. From the Ethereum Code customer reviews, we can understand that it is a genuine and efficient trading system.\n\nIs Ethereum Code A Scam?\n\nEthereum Code is not a scam\n\nWe have already discussed different factors about the Ethereum Code system in the previous sections of this review. One of the important factors among these is that this platform is free to use. Users do not have to pay any charges to use this platform. The minimum amount required to start trading is $250 and can be increased according to one’s trading goals. The important thing here is that users have full autonomy over their funds and can withdraw the amount at any time.\n\nStrict and safe encryption systems have been integrated into this platform to protect user privacy and data. Technologies such as two-factor authentication and other code systems are used to prevent data breaches and external attacks. In addition, Ethereum Code users have testified that the platform has helped them make high profits and expand their trading portfolio. Ethereum Code is a legitimate trading system and worth trying.\n\nEthereum Code - The Verdict\n\nEthereum Code is a free trading system aimed to help traders identify trading opportunities and make more profits. The system has been designed using advanced technologies, like artificial intelligence, algorithms, and analytics. It is said that the system generates accurate trading signals that come into use when searching for profitable times.\n\nEthereum Code is a top-rated (4.5 stars!) investment platform that makes learning about investments accessible and understandable. It stands out with its smart use of technology, providing accurate market analysis and tools that are easy to use.\n\nEthereum Code stands out compared to other crypto trading platforms in terms of its user-friendly interface, advanced features, and high success rate of 85% this web-based system seems legitimate\n\nThe technologies make the platform highly efficient and many users have reported that it has helped them to make higher profits. Risk management tools are also integrated into this platform to identify the risks and automatically stop orders. Ethereum Code is a secure trading system because all the safety measures, such as two-factor authentication and secure codes are used to protect it from external breaches. Evaluating all these aspects, Ethereum Code looks like a legitimate trading platform and is worth a shot.\n\nTry Your Trading Potential With Ethereum Code\n\nEthereum Code - FAQs\n\nHow does Ethereum Code ensure accurate market analysis?\n\nEthereum Code ensures accurate market analysis by using advanced technologies and algorithms.\n\nIs prior trading experience required to use Ethereum Code?\n\nNo. Prior experience is not required to carry out trading on Ethereum Code as the platform is user-friendly and offers an automated mode.\n\nCan Ethereum Code be accessed on any operating system?\n\nYes. Ethereum Code can be accessed on any operating system. This is a web-based platform that requires stable internet connectivity and a reliable web browser.\n\nWhat about the Ethereum Code customer support?\n\nEthereum Code has a trusted and dedicated customer support team that is available round-the-clock to assist in your trading journey on the platform.\n\nCan funds be withdrawn at any time from the Ethereum Code account?\n\nTraders can withdraw funds from their Ethereum Code trading account at any time. The funds can be transferred directly to their e-wallet.\n\nVisit Ethereum Code\n\nDisclaimer: The above is a contributor post, the views expressed are those of the contributor and do not represent the stand and views of Outlook Editorial"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE9VZ29JbmFnZUxvSkxRVU9oOU9GS3VmanRwTWs3UEIzbW4yOERBRnlfMGtDVEZrVnBsTTFDNHQ5LWNJbkwwcERlRW9lS1d5Q0xsZkZiMjlXdTJVTmt3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "What is Mantle Network (MNT): exploring Ethereum's first modular Layer-2 solution - OKX",
        "content": "Mantle Network is a pioneering modular Layer-2 solution designed to help scale the Ethereum network efficiently, handling more transactions faster than before. The tool achieves this by bundling transactions together using Optimistic Rollup technology, reducing gas fees and speeding up transaction times.\n\nIt's understandable why the Mantle Network and its technology has gained plenty of interest, with scalability a hot topic among crypto commentators. By providing a fast and cost-effective solution, Mantle Network aims to make decentralized applications (DApps) more accessible and user-friendly for all on Ethereum.\n\nCould it be a catalyst that unlocks more of Ethereum’s potential? Read on as we explore Mantle Network and its functionality, the advantages it brings to the space, the role of the project's MNT token, and more.\n\nTL;DR\n\nMantle Network's unique modular design improves performance and handles Ethereum's blockchain trilemma by separating execution, consensus, settlement, and storage.\n\nMantle Network uses Optimistic Rollup tech to speed up Ethereum transactions and reduce gas fees.\n\nInitially called BitDAO, Mantle is now backed by Bybit. This provides financial support and EVM compatibility for seamless Ethereum contract integration.\n\nMantle Network aims to lower fees and boost speeds to make DApps more user-friendly and accessible by increasing scalability.\n\nThe project's native token, MNT, plays an important part in the network's security and efficiency, and supports community governance.\n\nWhat is Mantle Network?\n\nMantle Network is an advanced Layer-2 solution for Ethereum. It uses Optimistic Rollup technology to increase transaction speeds and lower gas fees. Transactions are processed off-chain, but still settled on Ethereum to capitalize on the network's security.\n\nOriginally known as BitDAO, Mantle Network is backed by Bybit, a crypto exchange. This relationship not only provides the project with financial support but also helps attract a sizable user base, positioning Mantle Network as a strong contender in the Layer-2 ecosystem.\n\nMantle Network is built around a unique modular architecture. Unlike other blockchains, it separates execution, consensus, settlement, and storage into specialized modules. This modular design not only enhances scalability and performance but also maintains the network's compatibility with Ethereum Virtual Machine. As a result, existing Ethereum applications can migrate to Mantle Network with minimal modifications.\n\nMantle Network's Optimistic Rollup technology assumes transactions are valid and only checks for fraud if needed, improving efficiency. Meanwhile, the tool incorporates advanced data availability technologies like EigenLayer, which helps reduce the fragmentation of security on Ethereum and bolsters security for DApps using Ethereum-based modules. For Mantle Network users, this provides cheaper and more accessible data storage while inheriting Ethereum’s security.\n\nMantel Network's integration of governance and utility drives the ecosystem's economic model, providing network security, functionality, and the maintenance of a decentralized and efficient blockchain environment. As a consequence, the technology's unique features and strong support make it a promising contributor to Ethereum's future scalability.\n\nHow Mantle Network works, and its advantages\n\nMantle Network comprises a variety of advanced tools and technologies that combine at Layer-2 to boost Ethereum's scalability. Read on to understand the network's architecture and the advantages it brings.\n\nValidator nodes and transaction compression\n\nValidator nodes are essential to Mantle Network's operation, and they bundle user transactions into compressed blocks. This compression reduces the size of the associated data, reducing gas fees and increasing transaction throughput.\n\nOptimistic Rollup technology\n\nOptimistic Rollups assume transactions are valid by default and only verify them if there's a challenge. This allows Mantle Network to handle a greater volume of transactions quickly and at a lower cost. When a batch of transactions is processed, it's posted to the Ethereum mainnet as \"calldata,\" a cheaper storage method that makes sure the data is accessible without overloading the Ethereum network.\n\nIf a user suspects a transaction is invalid, they can submit a fraud proof. The Ethereum mainnet then checks the transaction to make sure it's valid. If the transaction is fraudulent, the validator's bond is slashed, providing a strong incentive for honest behavior.\n\nEthereum compatibility and a modular architecture\n\nMantle Network supports Ethereum contracts and tools by allowing developers to quickly move their DApps to the network with minimal steps.\n\nMeanwhile, the network's modular architecture enhances its overall efficiency by separating the execution, consensus, settlement, and data availability functions into distinct layers. This modular approach improves performance and addresses scalability, security, and decentralization challenges — often called the blockchain trilemma.\n\nData availability and security\n\nMantle Network uses EigenLayer's EigenDA to ensure accessible and secure transaction data. This advanced technique offers high throughput while protecting data integrity.\n\nWhat are the drawbacks of Mantle Network?\n\nWhile the functionality explored above brings a host of advantages to users of Mantle Network, there are some drawbacks to keep in mind.\n\nOptimistic Rollups can be complex\n\nOptimistic Rollups are complex. They assume transactions are valid, which can lead to delays if a transaction is challenged. This fraud-proofing process takes time, which can be a problem for applications that need immediate confirmation.\n\nCentralization risks exist\n\nOne concern is the risk of centralization, especially with the control of the sequencer in Optimistic Rollups. At first, the sequencer might be centralized, posing security and operational risks.\n\nAlthough Mantle Network plans to decentralize its sequencer to lower these risks, the transition process itself could still have weak points and cause a single point of failure.\n\nOver-dependence on Ethereum\n\nMantle Network relies on Ethereum for security, but this can be a double-edged sword. While it benefits from Ethereum's robust security, the network has also been affected by congestion and high gas prices on the mainnet. This can hurt Mantle Network's performance and cost-effectiveness during busy times on Ethereum.\n\nCompetition within the Layer-2 space\n\nAnother challenge for Mantle Network is the competition from other Layer-2 solutions such as Arbitrum, Optimism, and zkSync. To stay competitive, Mantle Network must keep innovating and growing its ecosystem. That requires a lot of resources and a constant commitment to development to stay ahead.\n\nDevelopers face a learning Curve\n\nThere's a learning curve with Mantle Network's modular architecture. Although the modular design offers flexibility, it also adds complexity. Developers might need extra time and resources to understand the network's components, potentially slowing down development and deployment.\n\nWhat's the role of the MNT token in Mantle Network?\n\nMNT is the native token of Mantle Network. It's held in the Mantle Treasury and can therefore be considered \"not in circulation\", according to the project website. Meanwhile, the Mantle Governance process manages token distribution.\n\nMNT plays a variety of roles in the network.\n\nGovernance: MNT token holders can vote on important network decisions, such as upgrades, funding, and other key matters. Each token equals one vote, protecting a community-driven and decentralized Mantle Network.\n\nTransaction fees: Mantle Network uses the MNT token to pay transaction fees. It helps keep the network running and gives the token a purpose.\n\nStaking: You can stake MNT tokens to help secure the Mantle Network. This means locking up your tokens to support network functions like validating transactions.\n\nSupporting ecosystem growth: MNT tokens fund ecosystem growth initiatives, including supporting new projects, grants, and other development activities that expand the Mantle Network ecosystem.\n\nWhat's next for Mantle Network?\n\nIn 2024 and beyond, the Mantle Network is expected to grow and develop in several key areas.\n\nMost notably, Mantle Network's technology will reportedly be enhanced, with a particular focus on its modular architecture. The network's modular design simplifies the process of making upgrades and scalability improvements by separating functions like execution, consensus, settlement, and data availability into distinct layers. As a result, hard forks are no longer needed.\n\nDecentralization is also expected to be an important focus for the project going forward. Governance and decentralization are already a priority for Mantle Network. As the first DAO-based Layer-2 solution, the project emphasizes decentralized governance. Token holders decide on protocol upgrades and fund allocations, making sure any changes align with community needs. Mantle Network plans to decentralize its sequencer, making the network more resilient, secure, and less prone to censorship.\n\nEnhancements to staking on the network are another area of development, particularly with the Mantle Liquidity Staking Protocol (LSP). With LSP, users can stake ETH for yield-bearing mETH, making the network more useful and offering further incentives to the community.\n\nWhat's more, Mantle Network is expected to form new strategic partnerships aimed at enhancing interoperability and expanding the ecosystem. These collaborations should connect Mantle Network with DeFi protocols and Web3 applications, strengthening its market position.\n\nThe final word\n\nEthereum's scalability challenges are well documented, and Mantle Network is another Layer-2 solution that aims to ease this limitation for users and developers. The tool uses Optimistic Rollup technology to speed up transactions and reduce gas fees on Ethereum, but its influence goes further still.\n\nMantle Network's modular architecture provides compatibility with existing Ethereum applications, while its Optimistic Rollup technology assumes transactions are valid and only checks for fraud if needed, improving efficiency further.\n\nAs the Ethereum network continues to evolve while facing competition from established and emerging projects, solutions such as Mantle Network provide a compelling reason to use and build on Ethereum."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPd0h0aTFyYS1feER5WkpfUjBYOE5rSU5CMEJTRE5uUmpLMENSTk4tMXBiSjNMNjgxajBiQzlObXZBc3dTUy1laGdRR1FNVE5PUUg4Wi1RMkhrTFZER1A3OTNENGFhWm5pRDRiMEo4UU1FU1pLNklPdldwbnhDeU91S0pheHlWZUp4Q0UyLVA4NFpPM2ZkYjFlOUx3bUVNMkJXRkYwU0dOVU5MMjNqVlVWdlpMTHNXdUUwV284elZ2SFMwZThrakhMUjk4c1ZldnpCbFlSUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Crypto Watch: Market consolidates as Bitcoin, Ethereum decline slightly - Business Today",
        "content": "In the past 24 hours, Bitcoin (BTC) hit a high of $66,750 before falling to $65,408, marking a 0.82 per cent decline. This surge caused a wave of liquidations, yet the overall outlook for Bitcoin remains optimistic. Despite a potential short-term pullback, analysts anticipate new record highs for the cryptocurrency.\n\nRelated Articles\n\nEthereum (ETH) has managed to surpass its 20-day Exponential Moving Average (EMA) but is struggling with Bitcoin's volatility. According to Rajagopal Menon, VP, WazirX, the social sentiment around ETH is cautiously positive. However, the Elder-Ray Index signals a buyer's market. He suggests ETH faces potential bearish trends, with a significant drop to $2,864 possible. He said, “ETH is trading within a descending triangle, signaling potential bearish trends. A significant drop to $2,864 is possible. Breaking the upper trend line could target $3,100. Next week's SEC decision on ETH ETFs is crucial.”\n\nParth Chaturvedi, Investments Head at CoinSwitch Ventures, highlighted that the overall crypto market has been relatively stable, trading in a narrow range despite the U.S. Senate voting against an SEC accounting rule. President Joe Biden has indicated he might veto the resolution.\n\nBitcoin and Ethereum are currently trading around $65.4k and $2.9k, respectively, down 0.8% and 1.9%. He said, “Trading around $65.4k and $2.9k, BTC and ETH are down by 0.8% and 1.9% respectively. While the broader market is in the red, a clear outlier amidst the leading cryptos is LINK (+13.6%). The Depository Trust and Clearing Corporation (DTCC) in the U.S., along with Chainlink and major US banks, completed a successful pilot to accelerate the tokenization of funds. This collaboration is a step further towards the adoption of blockchain technology in the traditional asset management sector.”\n\nHe further said that on the policy front, both Turkey and India have made strides in developing crypto regulations. The Securities and Exchange Board of India (SEBI) has proposed the appointment of multiple regulators to oversee crypto trading, moving towards a more structured regulatory framework. This recommendation has been submitted to a government panel advising the finance ministry on policy formulation.\n\nShivam Thakral, CEO of BuyUcoin, noted that recent Consumer Price Index (CPI) data shows signs of cooling inflation, which has sparked optimism in financial markets. This optimism has been fueled by the possibility of a rate cut by the US Federal Reserve if inflation continues to decrease. He said, “ The crypto market reacted immediately as BTC touched the $66,000 mark while ETH is hovering around the $3,000 mark. As per the media reports, India’s market regulator SEBI also suggested crypto trade oversight which brings us a step closer to regulated crypto trading in one of the major digital asset markets in the world.”\n\nDisclaimer: The information provided on the website does not constitute investment advice, financial advice, trading advice, or any other sort of advice and you should not treat any of the website's content as such. Do conduct your own due diligence and consult your financial advisor before making any investment decisions."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPbEJQRTBXVkgxeFpzZEVPUndWakRad2RkdGZOTG5sNlFBWkxDMEdaZklLOGR5SWJfTlhVSURNeU9uVFRsRkpPdEdOX1F5dXVRV2tNY2ZwNktkN2lUQjFTdDN3SWVHNDBSSXNUQWFxU1pVdTFVWkpVVnBCNnYwa1hKYWFxVENYOHNTdEdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto: Bitcoin Rally Leaves Ethereum Far Behind! Why? - Cointribune EN",
        "content": "Thu 16 May 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe crypto markets experienced a bullish week, but Ethereum seems to be struggling to keep up with Bitcoin’s rapid pace. While the total market capitalization increased by 5.5%, ETH failed to fully capitalize on this bullish momentum.\n\nCrypto: Ethereum Struggles to Keep Up with the Bullish Trend\n\nETH closed above $3,000 more than five days ago and has underperformed BTC by 22% since the beginning of 2024. This trend highlights the difficulty Ethereum is facing in maintaining its value against Bitcoin. Additionally, U.S. macroeconomic data seems to support the rally of some rare assets.\n\nAs a result, the markets reacted positively to the Consumer Price Index (CPI) data, which showed a 3.4% year-on-year increase in April, in line with market expectations. Unfortunately, this indicator was not enough to boost Ethereum as it currently is with the queen of crypto.\n\nThe Growing Uncertainty Among Investors\n\nSome crypto analysts believe that the upcoming SEC decision on May 23, 2024, regarding VanEck’s request for a spot Ethereum ETF, is a key reason for Ethereum’s inability to break the $3,000 resistance level. The uncertainty surrounding this event is leading traders to delay their investment decisions until the outcome is more certain.\n\nHowever, despite long-term optimism regarding Ethereum’s prospects, a rejection by the SEC could lead to a short-term market correction. Eric Balchunas, Senior ETF Analyst at Bloomberg, has expressed doubts about the approval of an Ethereum ETF in 2024, given the regulator’s cautious approach toward products that could be classified as securities, particularly those that include native staking services.\n\nIn conclusion, while the crypto markets have had a positive week, Ethereum still needs to prove its ability to keep up with the market leader, Bitcoin, in this bullish race.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQdWVSNUVNdzBCdTJiai0weFhSV25yX1hKMFk1d2I5Ynlaal9VWHkxVHlzLUFzNlgzVDhILXF6UG1UZWFJQl8yQURGTWY1VXBfRTQ5eEQ3R1VKV1Bfb090UWNlZ2ZVUVQ4b2sya0k5M0lUMDhoTGsxOHA0dlNNaWJwNjdxZGhmeS1mY3NZbC1GYVBaT0haa29ibklKSHp6TWVBTm9hN2dpeDl2YVnSAbABQVVfeXFMTU42TXpiVnUyYXprWVZTN1lzT0xSdlZxdV9fd1NoMllnNWlKd2VEc0IwUDVydk9GVU53NVA0MUNwRTRvZklGQnBjV0NaTWg0MnpSYk5BcV9BVkJYVjdobkttalNvYzg3SjVfMVNsRlNKbDBUejFzTTFxTkhjamZmZ0dqUDM3eVZtMDZxM3BZS1FPbUNUaHJ0Y2F1UFBoQWp0QW9FWlFMZ25KbzhoWHRvbzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 16: Bitcoin Surpasses $65K, Ethereum Gains, Floki Grabs Spotlight - CoinGape",
        "content": "The top crypto prices today rallied after the cooking U.S. CPI data was released on Wednesday, May 15. The Bitcoin (BTC) price surged past the $65,000 mark. Moreover, the Ethereum (ETH price regained the $3,000 level. In addition, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also recorded significant gains.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price soared 6.38%, reaching $65,835.21 at the time of writing on Thursday, May 16. On the other hand, it’s trading volume spiked 59.83% to $41.96 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.29 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price rallied 3.69% to $3,009.62 at press time with a market valuation of $361.51 billion. Whilst, ETH saw its trading volume jumped 29.61%, reaching $15.57 billion.\n\n3. Solana Price\n\nThe Solana price rallied behind the $160 level, regaining the bullish momentum today. The Solana price climbed 13.33%, settling at $143.90. In addition, SOL witnessed a 70.42% hike in trade volume to $4.22 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price inched closer to the $0.52 mark again. The XRP price recorded a surge of 3.24%, reaching $0.5185. On the other hand, XRP’s trading volume shot up by 11.78% to $1.19 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price rallied 7.05% to $0.4595 today. Whilst, ADA recorded a hike of 37.57% in its 24-hour trading volume, settling at $400.18 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price soared 7.14% to $0.1565 while its rival, Shiba Inu price rocketed 8.73% and traded at $0.00002509.\n\nAlso Read: Tech-Savvy Investors Bet On 3 Altcoins To Buy In May For 50X Profit\n\nTop Crypto Gainers Today\n\nFloki (FLOKI): The Floki crypto price surged 10.77% and traded at $0.0002158.\n\nThe Floki crypto price surged 10.77% and traded at $0.0002158. Pepe Coin (PEPE): The PEPE price soared 6.10% to $0.00001141.\n\nThe PEPE price soared 6.10% to $0.00001141. Arweave (AR): The AR price rallied 4.90% to $41.22.\n\nThe AR price rallied 4.90% to $41.22. Wormhole (W): The Wormhole price rose 2.88% to $0.5436=\n\nTop Crypto Losers Today\n\nWorldcoin (WLD): The WLD price lost 9.30% to $4.79.\n\nThe WLD price lost 9.30% to $4.79. Ethena (ENA): The Ethena crypto price slumped 6.98% to $0.7021.\n\nThe Ethena crypto price slumped 6.98% to $0.7021. Celestia (TIA): The TIA price dipped 6.77% to $8.19.\n\nThe TIA price dipped 6.77% to $8.19. Dogwifhat (WIF): The WIF crypto price slipped 5.98% to $2.92.\n\nTHORChain (RUNE) and Bonk (BONK) also registered massive gains today. Meanwhile, the latest data from the U.S. Labor Department highlighted that the U.S. Consumer Price Index (CPI) surged by 0.3% in April, which was lower than the market estimation of 0.4%. Thereafter, the Bitcoin price climbed from $62,000 to over $65,000.\n\nAlso Read: Bitcoin Price: Will Softer CPI Send BTC To $70,000 In May?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNbndVQTV2UEJHYnJsMm1hanFPWU0tRm5SZEFMRVpkTjVjWEFLcGE2OGlsemJxQmphejZNTjVCVXYxSjlFbEE4aFlMaUw1Z0hSc3lab3daY18zNnllV3VKaTRQRlZsZnNiSGh3WENtQnhxYm15d1Y4X2JPc3YzZ255a1Z5YkpWNnhZMGVUQ25vUVVCNnVfbHloeUt2bEJ3QdIBowFBVV95cUxQcWsyYWp3QjRWZjRpOXhUQjl2MHlPaDZlLUZ5UmlHTlc2TVVCaVY4dmNhNFB1SWdOLURabTl5ZUVLdlQ1c3NnSDQ1VEZydkl5d0Uwa0xrenFPNWlmcENHTjFGbm1nR1V0RGNQcThWaUZuYWx1SFFPVTB5Z2hHblRiNllmbzZnZ1ZOTWZLRDlRTVR4aFRqeGtjc2I0OC1kaVJlaDBV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 17: Bitcoin & Ethereum Retreat, Chainlink Bags Top Gainer Crown - CoinGape",
        "content": "The top crypto prices today registered declines, however, Bitcoin (BTC) price managed to sustain above the $65,000 mark. Whilst, the Ethereum (ETH) price extended lower than the $3,000 level. In addition, other top altcoins, such as Solana (SOL) and XRP also witnessed a modest drop while Cardano (ADA) gained.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price dipped 0.52%, reaching $65,499.97 at the time of writing on Friday, May 17. On the other hand, it’s trading volume plunged 28.74% to $29.90 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.29 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price lost 1.92% to $2,949.67 at press time with a market valuation of $354.32 billion. Whilst, ETH saw its trading volume plummeted 21.86%, reaching $12.15 billion.\n\n3. Solana Price\n\nThe Solana price sustained above the $160 level and dipped slightly today. The Solana price was down 0.25%, settling at $162.13. In addition, SOL witnessed a 26.47% drop in trade volume to $3.10 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price slumped below the $0.52 mark again. The XRP price recorded a dip of 0.23%, reaching $0.5175. On the other hand, XRP’s trading volume dropped by 8.10% to $1.09 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price rallied 1.11% to $0.4645 today. Whilst, ADA recorded a plunge of 9.75% in its 24-hour trading volume, settling at $361.14 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price slumped 4.09% to $0.15 while its rival, Shiba Inu price tumbled 2.94% and traded at $0.00002436.\n\nAlso Read: Smart Money Has An Eye For 2 Crypto To Buy For 10X-50X Potential In 2024\n\nTop Crypto Gainers Today\n\nChainlink (LINK): The Chainlink crypto price surged 13.25% and traded at $15.78.\n\nThe Chainlink crypto price surged 13.25% and traded at $15.78. Immutable (IMX): The Immutable price soared 6.72% to $2.50.\n\nThe Immutable price soared 6.72% to $2.50. Arweave (AR): The AR price rallied 5.77% to $46.21.\n\nThe AR price rallied 5.77% to $46.21. Hedera (HBAR): The HBAR price rose 3.47% to $0.1136.\n\nTop Crypto Losers Today\n\nBook Of Meme (BOME): The BOME crypto price slipped 9.45% to $0.01149.\n\nThe BOME crypto price slipped 9.45% to $0.01149. Stacks (STX): The STX price lost 8.16% to $1.97.\n\nThe STX price lost 8.16% to $1.97. Wormhole (W): The W crypto price slumped 5.25% to $0.5353.\n\nThe W crypto price slumped 5.25% to $0.5353. Ethena (ENA): The Ethena price dipped 4.93% to $0.6919.\n\nPolygon (MATIC), Sui (SUI), and Fantom (FTM) also gained significantly today. However, the broader market trend remained bearish.\n\nAlso Read: 3 Top Reasons Why Catcoin (CAT) is trending Today\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOQ1BTVTdqcXRRbXRSVUZKSHVxWGtDaHAxVzJtUEJMd005b3NXb1lXVmhrOVJmMzh4X2hlc2x4RkR3MWViX0RlTkNyNzV2OTR6SmQ1MWtTNUlwRFB0bm1WM2hrcXpmR013SmJabTQySUROSU1HQjFXMlFSaUhCZWlzUVcwQlUxQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum price corrects technically after the rise - CryptoNewsZ",
        "content": "Ethereum is currently testing its $2,925 support, and it anticipates a massive price hike in the coming days. After the bears defended $3,040, ETH entered a downside correction stage.\n\nAccording to recent market reports, the Ethereum price trades below $2,960, as does the 100-hourly Simple Moving Average. The recent market trend is linked to a bearish trend line, and the pair is hopeful of a new price increase. The crypto world was amazed after learning about the price dip in Ethereum.\n\nLike Bitcoin, Ethereum saw a fresh increase above the $2,950 and $2,960 levels, and its price noted a shortcoming correction very recently. According to crypto experts, bulls hover around the $2,925 support level. The immediate resistance of the Ethereum price is estimated to be near the level of $2,960, coupled with a bearish trend line. The first major resistance level is calculated to be near $3,000, and any increase in gains will escalate Ether toward a very high resistance zone.\n\nAdvertisement\n\nEthereum prices will continue to dip if It can’t clear the $2965 resistance. The downside initial support is around $2925. Ethereum’s upcoming major support is around the $2900 zone, and a move below that level will lead to a price hike. Experts predict that Ethereum prices will persist at low levels in the near future, and Ethereum’s modified price will test the Fibonacci support.\n\nThe potential impacts of the Ethereum price dip include a downward trend and bullish reversal, among others. The current crypto market trend is a transformative phase for Ethereum, and the current Ethereum price is approaching noteworthy Fibanocci support levels.\n\nThe prospects of Ethereum reaching a low level depend heavily on market conditions and buyer sentiment. In the coming days, an Ethereum price trend reversal and upward movement is possible. After a fresh price hike, the price of Ethereum has declined by around 31.34%.\n\nThis recent development coincides with a negative trend in the MACD histogram, and Ethereum is currently experiencing a Fibanocci support level of approximately $2866. The upcoming Fibanocci support will be around $2,100, and maintaining a high position will pave the way toward sustaining the current trend.\n\nAs far as the Ethereum price is concerned, it is certain that the upcoming days will see a bullish trend. It is anticipated that a return to the upward trajectory will occur as the Ethereum price potentially switches back to $2,866. The downward trajectory of Ethereum against Bitcoin exists even now, and the RSI (Relative Strength Index) continues its neutral stance despite the recent developments. It is a fact that the Ethereum price is at risk of breaking down from an escalating trend line.\n\nAdvertisement\n\nThe Ethereum price swing will be a deciding factor in predicting the market trends of the upcoming days. Bearish market trends and short-term breakdowns impact Ethereum’s future growth trajectory. There is a minute possibility of the correction deepening in the upcoming days, and Ethereum is known as an asset characterized by high risk and lucrative rewards."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQanlVbFhqZHVzNEpPZjg2TlRPTWxlMXNmN09BVnRvcFdUQXlvakhTbjU1cFBZQnN4SzE1TFprQTVyWUxfd3NXNXRhdG5SdklRdUstOVBncEJZaDFSNmZxS1J3UEhXUXdvOFo1ZjhwMm5fakdUUHVvZTdCMEtpNmY1UzRrZ0pmNllHdHpBejF3eHhMMnloTXfSAaMBQVVfeXFMTzBXRWF0Z1Q5MEhDMG92YUY3X2RDMFFKOXVzRlp6akVlQUlfQjNtZWNDb1A1Uks2VlVBZFViUjBqM25QR2l4dTdnZTdBaEdQTW15bWVCQUtkVk15eVJrbTVVRl93T3lXVU50cDZyMUY1R1lKRVNFV1Y2djNDWnlyNzhua24yYWF6a0c5Q1lfQ3NfbVZXRlJIMC1NOHZFdVZvZ24ydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 May 2024 07:00:00 GMT",
        "title": "Ethereum Price on May 17, 2024: A Detailed Analysis - Analytics Insight",
        "content": "Investors should remain cautious in the short term, keeping an eye on critical support and resistance levels. As the market navigates through regulatory challenges and technological developments, Ethereum is well-positioned to maintain its status as a cornerstone of the blockchain ecosystem. Whether you are a short-term trader or a long-term investor, understanding these dynamics is crucial for making informed decisions in the ever-evolving world of cryptocurrency."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPby1RbFZLQXZoV2d2Tm5jWFlzcFRQLTdRQzdNSVZHZGdFSXZ6aE5BeFh1UlhDSF95bjJaZTFOeVNtaTFvZkZqQ1BNcHVHeDVlMHNuY2w5VDdNcjlLRWN2blFUWDN1WDlMM3A5SUpVcmZsMTd4SVlMWlRURV9IRGx6TXlSWDNzMmNHOEFsUDVZOTFTa3VhZ2FhNEJlQVZGbjFteTFFdXJobWN4SFEycFJmSmR6ZzlnZHVuaWNXd3Rnb1FGYjVWQnB0ekxleWlMc3hKMVFnZGV6aGRaNXhQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "BlockDAG Illuminates Piccadilly Circus: Ethereum Price Soars While Fantom Faces Market Cap Shocks – What’s Next? - Techpoint Africa",
        "content": "Among the dynamic world of cryptocurrencies, BlockDAG emerges as a notable contender amidst the volatile Ethereum price predictions and Fantom's (FTM) declining market cap. Recently showcased at London’s Piccadilly Circus, BlockDAG has captured the attention of major investors and is quickly becoming a digital asset to watch.\n\nFantom (FTM) Continues Growth Despite Market Fluctuations\n\nDespite some setbacks, Fantom has impressively doubled its market cap to $2.6 billion. Although there has been a dip in token revenue, the platform's growth in USD and total value locked (TVL) demonstrates a solid base for expansion. Enhanced by reduced staking requirements, Fantom is bolstering its network security and decentralization, making it a compelling alternative to Ethereum due to its focus on scalability and low transaction fees.\n\nEthereum Faces Price Resistance\n\nAs a foundational platform for smart contracts, Ethereum is currently grappling with price resistance around the $3,000 threshold. A successful break above this level could signal an upward trend, however, projections currently indicate potential drops to $2,880 or even lower. This volatility poses risks for short-term investors but could represent an opportunity for those looking at the longer-term potential. Despite these challenges, Ethereum continues to be a central hub for developers and a key player in the decentralized applications landscape.\n\nBlockDAG: Innovating and Captivating the Crypto World\n\nBlockDAG is quickly gaining traction in the crypto community with its distinctive approach to mining and engaging its community. Highlighted by its vibrant display in Piccadilly Circus and an event at the Las Vegas Sphere, BlockDAG is on the radar of many crypto enthusiasts.\n\nThe upcoming launch of its X1 mobile mining app on June 1 is particularly exciting, promising to make mining accessible and efficient through a user-friendly platform. This app will enable smartphone users to mine BDAG coins without excessive battery or data use and will feature a leaderboard and referral system to foster a robust community ecosystem.\n\nBlockDAG: Poised to Be the Top Crypto Investment in 2024?\n\nWith the crypto landscape constantly evolving, new opportunities arise as established entities like Ethereum and Fantom navigate their own challenges. Amid this, BlockDAG stands out with its innovative solutions and community-focused initiatives.\n\nThe launch of the X1 app and its focus on making crypto mining accessible positions BlockDAG as an exciting new project that could lead the market. For investors searching for fresh and promising opportunities in the cryptocurrency sector, BlockDAG offers an appealing option, especially with its ongoing presale capturing significant investor interest.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    }
]