[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcUxlcWNveTI2OFJmbDdObEJVbUY2MFRKeEZXSE9pNVBxb1hoU1I4WXR0X2ltc3RYeU9kTldKaFNZbm9UMFlSOTdMSjRoLWxGN3hzWmtfS0FpNUJ1eFNNd1gxMFF0anVKM19wNGV5Z3RxWmtTbFBZaWo3MnU4bTZkS0ZCY241VE5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "What is cryptocurrency? What to know about this increasingly popular digital currency before investing - Business Insider",
        "content": "Paid non-client promotion: Affiliate links for the products on this page are from partners that compensate us (see our advertiser disclosure with our list of partners for more details). However, our opinions are our own. See how we rate investing products to write unbiased product reviews.\n\nCryptocurrencies are digital assets that are created and run on a blockchain.\n\nBitcoin and ether are two popular cryptocurrencies, but there are many others.\n\nInvesting in cryptocurrency can be extremely risky, and the underlying technology is very new.\n\nInvestors need to understand how cryptocurrencies work, who creates and controls them, and why you might want to buy cryptocurrencies.\n\nWhile there may be opportunities to build wealth, there are a lot of risks involved with crypto investing, and you need to be mindful of scams.\n\nWhat is cryptocurrency?\n\nCryptocurrency is a decentralized digital currency that investors can buy and sell along the blockchain. Unlike banknotes or minted coins with a tangible physical form, cryptocurrencies can only be accessed using computers and other electronic devices.\n\nA decentralized currency is not issued by a government or financial institution. In fact, no single person, company, or government controls a cryptocurrency's blockchain. Instead, it's run by a decentralized network of computers worldwide. Anyone with advanced technology skills and coding experience can create a cryptocurrency.\n\nThe lack of a central authority can also make cryptocurrencies more secure. \"It's hack-proof because there's no one central point of failure,\" explains David Donovan, executive vice president at Publicis Sapient.\n\nHow do cryptocurrencies work?\n\nWhile there are thousands of cryptocurrencies, many with unique traits, they all work similarly. It's hard to avoid jargon when discussing cryptos, but the concepts can be relatively easy to understand.\n\nBlockchain technology\n\nA cryptocurrency's blockchain is a digital record of all crypto transactions. Copies of the blockchain are stored and maintained by computers around the world. They're often compared to general ledgers, part of traditional double-entry bookkeeping systems where each transaction leads to debit and credit in different sections of the books.\n\n\"It works like a general ledger — it's that simple,\" says Donovan. Perhaps you start with two coins and send one to someone. \"On the blockchain, it would say I'm sending you one coin, and I now have one coin, and you have one coin.\"\n\nEach grouping of transactions is turned into a block and chained to the existing ledger. Once a block is added, it can't be reversed or altered — which is why people describe blockchains as \"immutable.\"\n\nSome cryptos have their own blockchain. For example, there are Bitcoin and Ethereum blockchains. However, some cryptos are built on top of an existing blockchain rather than starting from zero.\n\nEther is the cryptocurrency native to the Ethereum blockchain, but is also available for trading on other exchanges like Coinbase, Binance.US, Ninjatrader and Robinhood.\n\nPublic transactions under pseudonymous\n\nCryptocurrencies have another defining feature. The blockchains are public ledgers, which means anyone can see and review the transactions that occurred. However, they can also provide a degree of anonymity.\n\n\"You have a private key, which is how you initiate transactions, and a public key, which is how someone identifies you in the market,\" says Donovan.\n\nA blockchain's transactions are tied to a crypto wallet's public key, but nobody necessarily knows who controls that wallet. This is why cryptos are often described as pseudonymous — the public key is a person's pseudonym.\n\nComing to consensus\n\nCryptocurrencies commonly use one of two mechanisms to create a system of trust and determine which transactions are valid and added to their blockchain:\n\n\n\n\n\nProof of work . This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power.\n\n. This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power. Proof of stake. This is a newer and less energy-intensive mechanism. \"Proof of stake is they validate transactions on the blockchain by people putting value on the line,\" explains Parisi. \"They stake some of the currency they own to make sure they only validate true transactions.\"\n\nTypes of cryptocurrencies\n\nAccording to CoinMarketCap, there were more than 25,149 different cryptocurrencies with a global market value of about $1.16 trillion as of May 30, 2023. Some of the most popular cryptocurrencies include:\n\nBitcoin\n\nDogecoin\n\nEther\n\nLitecoin\n\nTether\n\nBinance coin\n\nDai\n\nTRON\n\nCronos\n\nUSD coin\n\nBitcoin cash\n\nBitcoin, the first cryptocurrency, was launched in 2009 as an alternative type of decentralized and digital money. Since then, people have also created cryptocurrencies that serve other functions or are designed for specific types of transactions. All non-Bitcoin cryptocurrencies are often referred to as altcoins.\n\n\"Cryptocurrencies can have many different uses,\" says Parisi. \"Some are used in gaming environments to earn rewards in a game, while others facilitate payments. Some are designed for cross-border remittances … some are designed for micro payments.\"\n\nFor example, stablecoins are a type of cryptocurrency that try to maintain a steady and fixed exchange rate with another asset, such as the US dollar. Governance tokens are another example of a specialized cryptocurrency. They give token holders voting power in a corresponding crypto project.\n\nInsider's Featured Crypto Apps Public Investing\n\nWealthfront Investing Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Editor's Rating 4.35/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Editor's Rating 4.34/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Start investing On Public's website Start investing On Wealthfront's website\n\nWhat is digital currency?\n\nDigital currency is a type of currency that can only be accessed in an electronic form, such as through a computer or mobile phone. This money has no physical equivalent, unlike tangible forms of currency like banknotes or minted coins. But just like physical money, digital currencies can be used to purchase goods and services.\n\nHowever, you'll be limited to online platforms and communities, such as investing platforms, gaming sites, and gambling portals. Some of the most popular forms of digital currency include cryptocurrencies, central bank digital currencies (CBDC), and stablecoins.\n\n\"There's a strive toward decentralization,\" says Nisa Amoils, a managing partner at A100xx Ventures. \"Digital currencies like cryptocurrencies continue to be a worthwhile investment for many investors.\"\n\nDigital currencies come in two forms:\n\nCentralized currency: Currencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public.\n\nCurrencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public. Decentralized currency: Currencies not issued by governments or financial institutions. Instead, decentralized currencies operate through peer-to-peer financial networks to eliminate the middleman (aka banks) and allow lending, trading, and borrowing directly with merchants.\n\nDigital currencies like crypto are often appealing to investors who are wary of government-issued funds and are that are seeking alternatives.\n\n\"Some people who had been excluded from the traditional financial system, or have had their currencies devalued, are seeking an opportunity to participate in the markets, and this is a retail-driven phenomenon first,\" says Amoils. \"There's this crisis of trust, and people want wealth creation for themselves. And so that spurred this whole kind of trading speculative movement.\"\n\nHow to invest in cryptocurrency\n\nYou can start investing in cryptocurrencies through existing crypto exchanges and investing platforms. Some of the best cryptocurrency exchanges (such as Kraken and Coinbase) offer assets like staking rewards, goal-planning features, low fees, and more.\n\nSome of the best investment apps that offer cryptocurrencies (such as Robinhood Investing) include a range of investment types, low fees, market access, and more.\n\nIf you want to get more advanced and start trading, note that you can strategies such as shorting crypto that are popular with day traders who don't buy and hold for the long term.\n\nYou can create your own crypto\n\nAnyone with coding skills and/or advanced technical knowledge can create their own cryptocurrencies — although this is not always an easy feat and isn't recommended for beginners. The three ways to create crypto are:\n\nBuilding a new blockchain: The most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more.\n\nThe most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more. Modifying a blockchain: If you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge.\n\nIf you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge. Building upon a blockchain: The simplest way to make your own coins or tokens is by expanding upon an already existing blockchain. But keep in mind that the success of your cryptocurrency will be reliant on the success of the original blockchain. Some blockchains that allow this are Binance and Ethereum.\n\nAre cryptocurrencies secure?\n\nThe blockchain technology behind cryptocurrencies can help ensure that the coins and systems remain secure. \"What's never been refuted is the value of blockchain,\" says Donovan. \"The way the ledger system is set up and every transaction is recorded. And the fact that it's immutable.\"\n\nHowever, that doesn't mean you don't need to worry about security. The crypto world is rife with scams. Of course, that's also true of traditional financial systems and currencies. Someone asking you to pay with a gift card or wire transfer is a red flag that you're dealing with a scammer. But several factors could make crypto scams especially worrisome.\n\nFor example, cryptocurrency transactions can't be reversed. There's also less regulation of cryptocurrencies and platforms than of traditional financial services in the US. Plus, some people may feel pressure to act quickly and send or invest their money because they're worried about missing out on an opportunity.\n\n\"One way to avoid a scam is to invest in more well-established cryptocurrencies,\" says Parisi. \"You still may be subject to scams or fraud in terms of how you hold it, send it, or receive it.\" But you can have some certainty that the cryptocurrency itself isn't a scam.\n\nAre cryptocurrencies a good investment?\n\nCryptocurrencies may present a good investment opportunity, and there are many ways to invest in the crypto world.\n\nYou could buy a coin (or coins) and hold onto them, hoping they'll increase in value. Or you could use your coins in a decentralized finance (DeFi) platform to earn interest through staking or lending. You also might take a more traditional route, such as an exchange-traded fund (ETF) that is tied to cryptocurrencies. There could even be opportunities to invest in projects or supporting industries rather than in the cryptocurrencies themselves.\n\n\"From an investment perspective, crypto is rapidly evolving,\" says Parisi. \"You shouldn't put an amount of assets you're not willing to lose. It should be, relatively speaking, a small portion of your portfolio.\"\n\nBefore making any investment, consider the potential pros and cons:\n\nPros Cons Easy to invest\n\nDiversify your portfolio\n\nThere is a lot of opportunity\n\nFaster and cost-effective transactions\n\nDecentralized currency\n\nSecurity and transparency through the blockchain Cryptocurrencies can be very volatile\n\nSome crypto projects may fail\n\nThe investment may be a scam\n\nEnvironmental impact due to excessive power consumption through ASIC computers\n\nLacking refund and cancellation policies\n\nShould you invest in crypto?\n\nWhile cryptocurrency investing is a hotly debated topic, it's worth understanding what's going on so you can make an informed decision. If you decide to get started, you could fully jump in or just dip your toe.\n\n\"Learn about crypto by opening up wallets, accounts, trading currencies, and learning more about the use cases,\" says Parisi. \"But do it in a reasonable way. We're still in the early days, and regulation of crypto is still evolving.\"\n\nDonovan suggests opening an account with a regulated and publicly traded company like Coinbase. But, he says, \"It's really about being smart and using the system to take baby steps.\"\n\nCrypto FAQs\n\nWhat is Bitcoin? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Bitcoin is a cryptocurrency, an electronic version of money that verifies transactions using cryptography (the science of encoding and decoding information). As Bitcoin educator, developer, and entrepreneur Jimmy Song says, Bitcoin is \"decentralized, digital, and scarce money.\" Bitcoin is decentralized because this code is run by thousands of computers (i.e., 'nodes') spread across the globe, digital because it exists as a set of code that determines how it operates, and scarce because its code caps its overall volume to 21 million bitcoins.\n\nWhat is Ethereum? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Ethereum is an open-source, decentralized computing platform network. The Ethereum network works like the Bitcoin network in that it's built on blockchain technology, essentially a digital public ledger where financial agreements can be verified and stored entirely by software — without the intervention of a third party.\n\nWhat are privacy coins? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Privacy coins are cryptocurrencies that obscure transactions on their blockchain to maintain the anonymity of users and their activity. Participants in a transaction will know the amount transacted and the parties involved. However, the same information will be unobtainable to any outside observer.\n\nWhat is a crypto wallet? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. A crypto wallet is a software program or physical device that allows you to store your crypto and allow for the sending and receiving of crypto transactions. A crypto wallet consists of two key pairs: private keys and public keys. A public key is derived from the private key and serves as the address used to send crypto to the wallet.\n\nWhat is hash rate? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Hash rate is a measure of the total computational power being used by a proof-of-work cryptocurrency network to process transactions in a blockchain. It can also be a measure of how fast a cryptocurrency miner's machines complete these computations.\n\nWhat is yield farming? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Yield farming is a means of earning interest on your cryptocurrency, similar to how you'd earn interest on any money in your savings account. And similarly to depositing money in a bank, yield farming involves locking up your cryptocurrency, called \"staking,\" for a period of time in exchange for interest or other rewards, such as more cryptocurrency.\n\nWhat is crypto staking? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Crypto staking is similar to depositing money in a bank, in that an investor locks up their assets, and in exchange, earns rewards, or \"interest.\" \"Staking is a term used to refer to the delegating of a certain number of tokens to the governance model of the blockchain and thus locking them out of circulation for a specified length of time,\" says Nicole DeCicco, the owner and founder of CryptoConsultz, a cryptocurrency consultancy in the Portland, Oregon area.\n\nLouis DeNicola Louis DeNicola is the president of LD Money Media LLC and an experienced writer who specializes in consumer credit, personal finance, and small-business finance. He is a Nav-certified credit and lending specialist, a multi-year attendee of an 18-hour advanced credit education seminar, and a volunteer tax preparer through the IRS's VITA program. Louis works with various publishers, credit bureaus, Fortune 500 financial services firms, and FinTech startups. In addition to Insider, you can find his work on Experian, FICO, Credit Karma, FICO, and Lending Tree. You can connect with Louis on LinkedIn or reach out to him directly at ladenicola@gmail.com Read more Read less Tessa Campbell Investing and Retirement Reporter Tessa Campbell is an investing and retirement reporter on Business Insider’s personal finance desk. Over two years of personal finance reporting, Tessa has built expertise on a range of financial topics, from the best credit cards to the best retirement savings accounts. Experience Tessa currently reports on all things investing — deep-diving into complex financial topics, shedding light on lesser-known investment avenues, and uncovering ways readers can work the system to their advantage. As a personal finance expert in her 20s, Tessa is acutely aware of the impacts time and uncertainty have on your investment decisions. While she curates Business Insider’s guide on the best investment apps, she believes that your financial portfolio does not have to be perfect, it just has to exist. A small investment is better than nothing, and the mistakes you make along the way are a necessary part of the learning process. Expertise: Tessa’s expertise includes: Credit cards\n\nInvesting apps\n\nRetirement savings\n\nCryptocurrency\n\nThe stock market\n\nRetail investing Education: Tessa graduated from Susquehanna University with a creative writing degree and a psychology minor. When she’s not digging into a financial topic, you’ll find Tessa waist-deep in her second cup of coffee. She currently drinks Kitty Town coffee, which blends her love of coffee with her love for her two cats: Keekee and Dumpling. It was a targeted advertisement, and it worked. ExperienceExpertise:Education: Read more Read less"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYzBsRlA0T0lMenBtLS1xUXJIcjlVbjFCWXY5N0xrRTRRQXlWRVhhOGMxYm9VLVNsTWJxOE1NQlFDN1VIaGNTNUJLSWlldV9vcVl6M2ltc2FTZkdFZHh2cVoyalRaLXV5eVZObjY4V1VQVFFob3dtNXFCRngxZWh1VXdISXZhVmlJSkE2ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Will Hit $5,000 by 2025 - The Motley Fool",
        "content": "There are two key catalysts that could propel Ethereum to a new all-time high next year.\n\nUp more than 50% through the first half of 2024, Ethereum (ETH -7.12%) now appears to be on track to regain its all-time high of $4,891 from the previous crypto bull market rally. Given Ethereum's current price of $3,400, that would imply a rally of more than 40% within a relatively short period of time.\n\nThat's certainly possible, given how well Ethereum has performed over the first half of the year. But a lot still needs to go right. Here's a closer look at two key factors that could propel Ethereum to the $5,000 mark by 2025.\n\n1. Continued growth of Ethereum's blockchain ecosystem\n\nFirst and most importantly, Ethereum needs to see continued growth in core segments of its sprawling blockchain ecosystem. One of the most important of these segments is known as decentralized finance (DeFi), which refers to traditional financial products and services reinvented with the help of blockchain technology. As such, DeFi offers the potential for faster, cheaper, and better solutions than those currently offered by traditional Wall Street providers.\n\nIn order to come up with a reasonable future price forecast for Ethereum, it is important first to come up with a ballpark figure for how much market value Ethereum can realistically create over the next few years. Cathie Wood of Ark Invest, for example, has crunched the numbers and determined that blockchain networks such as Ethereum could potentially generate $5 trillion in new market value by 2030.\n\nThat may sound like a huge, pie-in-the-sky number, but not when you take into account emerging trends such as asset tokenization, which refers to the process of transforming traditional financial instruments into digital assets that live on the blockchain. The faster that the process of asset tokenization takes place, the more valuable Ethereum becomes. According to consulting firm McKinsey, asset tokenization could be a $2 trillion market opportunity by 2030, and Ethereum stands to be a key beneficiary.\n\n2. Mainstream investor acceptance of Ethereum ETFs\n\nEven if you don't buy into the idea of blockchain-powered financial products transforming the modern financial system, there is one other path to Ethereum soaring to the $5,000 mark: the imminent launch of the new spot Ethereum ETFs, which are scheduled to begin trading this summer. In a bullish scenario, as much as $4.8 billion in new investor money could flow into these new ETFs, helping to boost the price of Ethereum.\n\nTo get a sense of how much of a boost these ETFs may provide, consider the example of the spot Bitcoin (BTC -4.33%) ETFs, which began trading in January. Over the ensuing six months, the price of Bitcoin soared from approximately $45,000 to $70,000, for a gain of nearly 55%. For the sake of argument, let's assume that the new Ethereum ETFs are not as successful as the Bitcoin ETFs, and the gains are not as significant. But even a rally of 40% would still be enough to propel Ethereum to the $5,000 mark by 2025.\n\nIs Ethereum a $2 trillion asset?\n\nIn fact, a price forecast of $5,000 may turn out to be conservative. For example, investment firm VanEck came up with a base-case price forecast of $22,000 for Ethereum for the year 2030. This assumes that Ethereum can continue to make inroads in areas such as DeFi and Web3, and that key blockchain metrics continue to see improvement over the next five years. At a price of $22,000 per coin, Ethereum would have an implied valuation of more than $2 trillion, making it more valuable than all but a handful of companies in the world.\n\nIf you are thinking about investing in Ethereum, keep in mind that crypto can be incredibly volatile and unpredictable. There's always the chance that Ethereum will no longer continue to see rapid gains after a remarkable first decade of growth. Tech issues could prevent it from scaling past a certain point, and the arrival of new competitors could blindside it.\n\nThat being said, if you think that we're on the cusp of a major bull market rally, Ethereum should definitely be on your radar as a cryptocurrency capable of soaring in value over the next several years."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNcEJCZWJ5bjJyQWwxSlM5djhYQW9Gdm1wWHRyNzZETHhRd1hnTzRkbnlodGxtZHZtMDNUcjNMcmV2dWtMcmN3NHFsT3IyQkdvQXpHeGk0azZvRTlMS2kwZ2JhemNwLUhhYmlqcm43OTBKS1hvY2w4UFVKdkdIWXR2TVl3LWZralVZbWlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst - Yahoo Finance",
        "content": "Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst\n\nBitcoin and Ethereum consolidated, while Dogecoin rose as President Joe Biden announced his withdrawal from the 2024 presidential race.\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded 9:15 p.m. EDT) Bitcoin (CRYPTO: BTC) +1.52% $68,136.71 Ethereum (CRYPTO: ETH)\n\n+0.83% $3,540.81 Dogecoin (CRYPTO: DOGE) +5.50% $0.1397\n\nWhat Happened: The world's largest cryptocurrency, Bitcoin, traded flat until the news of Biden dropping out of the contest broke, injecting positive volatility in the market. King Crypto recorded a weekly close above $68,000 and is up more than 10% over the week.\n\nEthereum moved in the $3,500 zone, anticipating bullish impetus as it awaits the final approval of exchange-traded funds tracking its spot price. The investment products are likely to go live this week.\n\nIn the last 24 hours, 56,837 traders were liquidated, with the total liquidations at $165.54 million, More than $100 million in bullish bets were liquidated.\n\nDon’t Miss:\n\nBitcoin's Open Interest rose 1.08% to $37.21 billion in the last 24 hours, complementing the price increase. This is typically indicative of a bullish sentiment.\n\nThe Cryptocurrency Fear & Greed Index flashed \"Greed\" at the time of writing, signaling significant buying sentiment in the market.\n\nTop Gainers (24-Hours)\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded at 9:15 p.m. EDT) Celestia (TIA) +16.30% $7.55 Core (CORE) +15.12% $1.65 Avalanche (AVAX) +12.27% $32.54\n\nThe global cryptocurrency market stands at $2.48 trillion, up 1.65% in the last 24 hours.\n\nStock futures edged higher Sunday night. The Dow Jones Industrial Average Futures gained 0.12%, as of 9:15 p.m. EDT. Futures linked to the S&P 500 added 0.22%, while Nasdaq 100 Futures rose 0.36%.\n\nTraders monitored political developments in the wake of Biden dropping out of the 2024 presidential race. It will be interesting to see how the market opens this week in response to this significant development.\n\nLast week, major indices like the S&P 500 and the Nasdaq Composite registered their biggest weekly losses since April.\n\nSee Also: Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield.\n\nAnalyst Notes: Popular cryptocurrency trader CrypNuevo anticipated significant volatility in the Bitcoin market after Joe Biden's announcement.\n\nStory continues\n\n\"Expecting a volatile price action instead; therefore, I think it’s likely to see a move down first. Then we can go up to liquidity at $68,900,\" the trader predicted.\n\n\n\n\n\n$BTC Sunday update:\n\n\n\nIt was going to be a quiet week ahead, but Biden just announced that he is not running for re-election.\n\n\n\nExpecting a volatile price action instead; therefore, I think it's likely to see a move down first. Then we can go up to the liquidity at $68.9k.\n\n\n\n🧵👇 pic.twitter.com/3XfaZITYWL — CrypNuevo 🔨 (@CrypNuevo) July 21, 2024\n\nWidely-followed analyst Rekt Capital stated that a weekly close above $65,000 could bolster Bitcoin's chances of reclaiming $71,500 in the following week.\n\nWith the apex cryptocurrency closing near $68,000, it’ll be intriguing to see if the predictions come true.\n\n\n\n\n\n#BTC\n\n\n\nEvery time Bitcoin Weekly Closed above ~$65000 (blue) in an uptrend...\n\n\n\nBitcoin would revisit ~$71500 in the following week\n\n\n\nCould history repeat itself?\n\n\n\nWe know it often does\n\n\n\nWhat about this time?$BTC #Crypto #Bitcoin pic.twitter.com/KosyX2ezIh — Rekt Capital (@rektcapital) July 21, 2024\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBKTFBJVmJrMG9IYzQ5UUszQy1CQ3k2S3cxbjI0bmdJT1pNanNWVnRUNFZua1U5NGhRbnNkdWdGTU5TY3EyRVI5Rlc0LXB4N2M5c3paS2ZjRVdkWFRsUE9KTFc1dWNSQzdwSTlfd2Yyc1Y5V251?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum On The Verge Of Breaking $3,500 Resistance: Analyst Predicts $4K Surge - TronWeekly",
        "content": "Popular cryptocurrency trader Crypto Jack posted a convincing Ethereum (ETH) price prediction. In a recent post on X, the analyst analyzed that Ethereum is on the verge of achieving a major achievement after struggling to overturn resistance at $3,500. This could potentially open up the possibility of a new target of $4,000.\n\nCrypto Jack emphasized the importance of the current level of Ethereum that is considered resistant. After the breakout of the triangle, ETH faced the resistance at $3,500. This struggle is almost over, or at least, the signs on the market could signal an inclination towards an upward direction.\n\nTraders and investors have paid a lot of attention to ETH’s price pattern and movements. Consequently, ETH tends to evade major trends since it remains the second biggest cryptocurrency based on market capitalization. The $3,500 resistance has been both psychologically and technically a major hurdle to ETH from attaining its desired value. Going beyond this level might be an indication of a strong bullish market that would further boost the market sentiment.\n\nEthereum Poised For Breakout\n\nCrypto Jack’s $4,000 target prediction supported by a technical analysis of ETH and the current state of the market. He mentioned that a triangular patterned breakout in the chart indicated the likelihood of an upward trend. He said that it is soon going to cross it and become a much higher number and asked the crypto fraternity to get ready for the next resistance level.\n\nThe prediction towards Ethereum to hit $4,000 has well captured the interest of the cryptocurrency space. This bullish aspect is further supported by the fact that Ethereum seems to be expanding on the technological front with newer developments and integrations in the sectors of DeFi, NFT, and smart contracts.\n\nThe overall sentiment seems to be charging up with the crypto market’s center of attention being on the price of Ethereum. Bitcoin has also gone up and is giving a good sign to altcoins such as ETH hence giving a positive view for the altcoins. From Crypto Jack’s recommendations, one is inclined to support the premise that Ethereum is about to rally big time.\n\nCrypto Jack predicts that there may be a revolutionizer that would catapult ETH to $4,000, and everyone in the crypto space would wallow in it. While market trends continue to develop, Ethereum is waiting on the sidelines and looking forward to the start of the bullish trend to buy it."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNZ3V3cEtBUHlyRmM2MjJPUi1NR3hCTHBrcl85TXhJZG1EZVNkNGtWOWlyM0d3aV96Tk9aSjd4c0ZHWDBHZTJvUktyc1JZeG94dDQxcmVYWDNYNWFUQU1rTVNqblVsem5RT0FwcHZ4N2ZEUzNtbFlaUmdTd3JhdU13Y2tkNGctT2x6TXJKT1pqT3M0S2UzYVJTZW9qa2lYcG90MzdEQ3UwRkdXeGdreGfSAbYBQVVfeXFMUEJjdkE1TFFGNV9mNmVidDNQX0x6ZDJvTEhzWUtsNHBHNl93eHdrdHhIM3FOUmMyMUZVcFNJa0lrQ1EwREhiQ0lqLW9vSWxyQm5tb1hrYl94ZjhPcDdPRmlaSm80RWIzdmRpU01OOGoyRl8yMGFLN3NhSGVzX2w2bThoZDktVE5yTzBwRWwycGVTZ1VEVV80VWdGclZBNkpDZzM4cURjdmZZSFFIeVBFYUM5M2VYX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Mixer Tornado Cash Has Received Almost $2 Billion in 2024 Despite Sanctions - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the first six months of 2024, more than $1.9 billion has been deposited onto Ethereum mixer Tornado Cash (TORN). Although things have slowed down in July—the protocol has seemingly attracted only $65.1 million worth of deposits, according to data provided by crypto analytics service Flipside.\n\nGiven Tornado Cash’s nature as a mixer, the total value locked (TVL) metric used for judging an ecosystem’s activity level is not as reliable. Total value locked refers the the value of assets that have been deposited into a decentralized application. That's why TVL isn't typically used to measure activity on Tornado Cash. The expected use case is to deposit funds and then withdraw anonymized funds—rather than keep them in the protocol for a long time like with most decentralized finance services.\n\nStill, DeFiLlama data for Tornado Cash’s TVL shows sizeable growth, with the protocol starting the year at under 160,000 ETH and currently standing at nearly 168,600 ETH. In U.S. dollars, this is a growth from $374.4 million to the current value of $572.82 million — when taking asset value growth into account.\n\nAD\n\nAD\n\nWhat is Tornado Cash?\n\nTornado Cash is a coin mixer that was created to preserve the privacy of crypto users. Using zero-knowledge proof cryptography, the protocol anonymizes user deposits and allows their withdrawal to a new address that cannot be traced to the old one.\n\nThe Ethereum mixer has seen inflows from wallets associated with major hacks, including the hacker behind the Poloniex hack sending $3.3 million worth of Ethereum (ETH) to the mixer back in early May. Due to transactions linked to hacks—including some allegedly linked to North Korea—the U.S. Treasury Department sanctioned Tornado Cash in early August 2022.\n\nThis was then followed by the lengthy legal prosecution against Tornado Cash developers which was seen as a major overreach by much of the crypto community. This prosecution is still ongoing, with a last week ruling delaying the money laundering trial of Tornado Cash co-founder Roman Storm, over the objections of the prosecution.\n\nCoinbase's chief legal officer Paul Grewal said in April that the U.S. Treasury is \"bending old laws past their breaking point\" by placing blame for Tornado Cash’s misuse on developers and TORN holders.\n\nImmutable, open-source software code isn’t property, which creates a real issue for Treasury, as it’s authorized to regulate only 'property' in which a foreign national has an interest, he said at the time.\n\nAD\n\nAD\n\nEthereum co-founder Vitalik Buterin said in late May that Tornado Cash developer Alexey Pertsev being sentenced to 64-months in prison was “really unfortunate,” and continued to back privacy-centric crypto tools, encouraging people to develop “next-gen” solutions.\n\n\"I think a lot of people have been going under the assumption [...] that just building software is something that’s okay,\" he said during a fireside chat at DappCon in Berlin, \"and is a totally legal and legit way to fight for privacy.\"\n\nEdited by Stacy Elliott."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNeXpnXzlvcUFaX1g1SFpmeDFFanJKNHdpVUZFZHFwaTU4N2J1cWU5VXBER3NrTUgzcUU0Q2dFWk8tMjF1MURocF9XelM0aVVra2psTTFaWjBDaGt5V19GSERFTkZsZnR3eE1qdDF6dVFFMmZDbzZkRWQ5ZDFmeEFYZFptVVdjbGZFRFI3OU82ekVwVXBkN05tV3FPR0RPLUc1c0J1ajZuR3MwZnZJRlVZNjdiOXhQUWdhSzJfVm1yYUxzVTlYMWptWGp2TFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Biden Bowing to Trump Could Clear $704M Resistance for ETH - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNMC15d28wTmVPdzFkODhCckx5Nk40TkhIR1NqbG1Cb2xOa2tNZUFnZi1iajVvMUpsVWVHWFhWazNTZ1lzMTltLWt2ckpLOWRVa2t1OE5tTkt6VGNRbkxOYW1wZ0JISkdHdHIzMzdKaU9XYVFYR2JWN2liOFA3bjJnamFyM3U3Z2NCWWM0NS1UR3FxcTB5ODBsRHFtQjRRQl800gGmAUFVX3lxTFBqWTFGREhraHd0V1BlQU11TlNadmZWakp5bFZPekJsNlhKWHVtZ2VGb180QVV4N3dRTVNZdV95U2tfR2hjb1M3TFJmVmhJRFhHM3ZnQXFEZjJHUzltd3ZGSVQ1VUEzNV9mUWVJZVRrUVdRRjlTUWlfODFRUFRublZMOVNFRkV2T0thX2dYbVZTZGlrcU1TM0lKTG1BYU94d1ZKTjhJMlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Cboe Unveils the Official Launch Date for Five Spot Ethereum ETFs - The Daily Hodl",
        "content": "The Chicago Board Options Exchange (Cboe) is giving the launch date for five spot market Ethereum (ETH) exchange-traded funds (ETFs).\n\nCboe’s new listings page shows that Ethereum ETFs from issuers 21Shares, Fidelity, Franklin Templeton, Invesco and VanEck are scheduled to roll out on Tuesday, July 23rd.\n\nLast week, Bloomberg senior ETF analyst Eric Balchunas said Ethereum ETFs are likely to begin trading on Tuesday after the U.S. Securities and Exchange Commission (SEC) asked issuers to make final changes to their form S-1 registration statement.\n\nCrypto market participants have been anticipating the rollout of Ethereum ETFs since May when the SEC abruptly shifted its stance on the investment products.\n\nAnalytics firm IntoTheBlock says that deep-pocketed crypto investors are rushing to load up on Ethereum in anticipation of the ETF launch.\n\n“$126 million worth of ETH was withdrawn from exchanges [last] week, signaling accumulation ahead of the ETF launch.”\n\nWhile whales appear to be bullish on ETH, crypto analyst Kaleo thinks the ETF launch will lead to a brief price spike before Ethereum witnesses a correction. According to Kaleo, the ETF launch will turn out to be a sell-the-news event.\n\nBut after the pullback, the trader predicts that ETH will soar above $4,550.\n\n“If you’re really bullish on this cycle, one more sweep of the lows would be an absolute gift. We’re heading way higher from here – just think we might need a bit more patience before the fun really starts.”\n\nAt time of writing, Ethereum is worth $3,521, a slight increase on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQUnAyNjZtQ3B1NjdMNWJXVWE5NWplRzFmOWk1RkJqelBZZ1VpUTRGTklJX29pRDk5RmkzcTU4MUE1Z1ZKU3NWMDEzWFNyTDVVNkdfWVVMNThtRklpa2RYREpmRzhhamNabmdwbENTUnNoVE00Ukhoa2lMNGQwMnBOTHFUc0NNREFJVXVLVHdHMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "5 Tokens to Buy Before the Ethereum ETF Trade Starts - Brave New Coin Insights",
        "content": "5 Tokens to Buy Before the Ethereum ETF Trade Starts\n\nThe cryptocurrency market is currently experiencing a calm period, a sort of calm before the storm. Traders and investors are eagerly awaiting the next big bull run. During this time, altcoins present some of the best entry points. Although they have begun to show signs of rising, they haven't yet skyrocketed, making them ripe for investment. With the Ethereum ETF trade on the horizon, this transitional phase hints at massive potential gains across the board.\n\nThis article unveils five tokens that are particularly poised for impressive growth as the market braces for the ETF impact.\n\nCYBRO Presale Advances as Demand for AI-based Tokens Surges\n\nThe CYBRO presale has rapidly advanced to its fifth stage, amassing over $1.3 million. This AI-based yield aggregator offers users the potential to enhance their earnings within the Blast ecosystem, delivering unparalleled rewards for staking ETH and stablecoins. Smart investors see great potential in $CYBRO tokens as the Artificial Intelligence (AI) is the hottest trend in crypto nowadays,\n\nBenefits for CYBRO Token Holders:\n\nCompetitive staking rewards\n\nAccess to airdrops\n\nReduced trading and lending fees\n\nA robust insurance program within the platform\n\nIndustry experts forecast a potential return on investment of 1200%, with CYBRO tokens currently available at a presale price of just $0.03 each. This technologically advanced initiative has already garnered attention from prominent crypto whales and influencers, reflecting strong market confidence and interest..\n\n\n\nWith only 21% of the total token supply allocated for the presale and approximately 64 million tokens already sold, now is an opportune moment to secure a position in this innovative project, which holds significant potential to become a major player in the cryptocurrency space.\n\n>>Join CYBRO and aim for future returns up to 1200%<<\n\n\n\nHigh Hopes for ETH as Altcoin Season Nears Amid Bullish Patterns\n\nEthereum, also known as ETH, is the second largest cryptocurrency by market cap. It’s known for its smart contract technology, which allows developers to create decentralized apps. Despite recent market dips, ETH is showing strong patterns similar to 2021. This suggests the coin could see significant gains soon. Its technology has many uses and a solid track record, making it an attractive option. With the potential for a bull run, ETH stands out as a promising investment.\n\n\n\nXRP: The Hidden Gem Ready to Shine Despite Market Challenges\n\nXRP, developed by Ripple Labs, is designed for fast and low-cost international payments. Unlike Bitcoin, XRP focuses on making cross-border transactions easier and quicker for banks and payment providers. The coin’s technology allows for almost instant transfers with minimal fees, making it an attractive option in the financial world. As we see repeat patterns from 2021, XRP’s strong fundamentals and real-world use case could make it a top performer in this market cycle. Its resilience and utility make it a hidden gem worth watching.\n\n\n\nSOL’s Hidden Potential: Why Solana Could Be the Star of the Next Bull Run\n\nSolana (SOL) stands out with its fast and low-cost transactions. This coin uses a method called Proof-of-History, making it different from other coins. Developers love it because it can handle many transactions at once. This makes it great for DeFi and NFTs. With the market now looking for strong coins after the latest dip, SOL could be in the spotlight. Patterns from 2021 suggest a chance for another big rise. Solana looks very attractive as the next big thing in the crypto market.\n\n\n\nTON Coin: A Hidden Gem Ready to Shine in the Next Altcoin Boom\n\nTON Coin is catching eyes in the crypto world. Originally developed by Telegram, it’s designed for fast transactions and strong security. It uses blockchain tech to deliver blazing speed and low fees. Even with the latest market slump, similar to 2021 patterns, smart investors are seeing its potential. The unique technology and vision behind TON make it a strong contender in the next altcoin surge.\n\n\n\nConclusion\n\nETH, XRP, SOL, TRX, and TON might have limited short-term potential. However, CYBRO, an innovative DeFi platform, provides unique chances for investors. Its AI-powered yield aggregation on the Blast blockchain enhances earnings. It offers lucrative staking rewards, exclusive airdrops, and cashback on purchases. The user experience is exceptional with easy deposits and withdrawals. CYBRO focuses on transparency, compliance, and quality, making it a standout project. Strong interest from crypto whales and influencers further underscores its promise.\n\n\n\nSite: https://cybro.io\n\nTwitter: https://twitter.com/Cybro_io\n\nDiscord: https://discord.gg/xFMGDQPhrB\n\nTelegram: https://t.me/cybro_io\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE11TTRTekxsZHJpQ0xfRDlwc1lobzlMbmQ0WDgyUDBMWGV4XzVCa0xxOFJ2ZTR1VElsLXFzZzJjdW83TjJxX05FSFd2OF9sUWp6XzVzbTJnbTA5bm9NSk02dtIBZkFVX3lxTE05ZHdkNW5hZm5RY3U1bmJZaGNDYkJCbE9WcGRjTklmRk84SHJzeTQtMWVhSXNCdkQ3eG01WTRvVkJVdUhXYWpwcWFab1B2TXBTNDVWN1JKT0xGX0VRREJ5bkVobDkwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "What is Optimism (OP): Guide to One of Ethereum’s Layer-Two Scaling Solutions - CryptoPotato",
        "content": "The cryptocurrency industry, in general, has become much more popular in the past couple of years. This saw the development and launch of hundreds if not thousands, of decentralized applications (dApps) in various fields, such as DeFi, gaming, learning, trading, investing, and so on.\n\nThere are many reasons for this, including but not limited to the massive bull run in 2021, the rise of non-fungible tokens, the popularity of memecoins, and more. This saw hundreds of thousands of users flocking to whatever the next trend may be.\n\nUnlike previous cycles, however, this time, we also saw regular users take advantage of on-chain availabilities and interact with various dApps such as Uniswap, OpenSea, and so forth. And while this had a massively beneficial effect on the industry’s growth and valuation, it also highlighted some very critical issues.\n\nBlockchains like Ethereum—where the lion’s share of dApp activity takes place—struggled in terms of affordability, scalability, and even accessibility. Layer one alternatives like Solana also proved insufficiently effective in handling the massive load of user requests.\n\nThis brought up a topic that’s been largely discussed in the cryptocurrency community for years—scalability. Now that scaling solutions have become essentially imperative for the industry’s future growth, projects like Optimism have seen the light of day.\n\nOne of the most popular Ethereum scaling solutions, Optimism aims to solve some of the network’s underlying issues, with a particular focus on scaling.\n\nQuick Facts About Optimism\n\nOptimism’s mainnet went live on December 2021\n\nOptimism launched its native token (OP) on May 31st, 2022.\n\nA total of 231,000 addresses were eligible to claim 214 million OP tokens.\n\nQuick Navigation\n\nWhat is Optimism?\n\nOptimism is an Ethereum scaling solution. In essence, its purpose is to help the main network run smoothly by taking some of its transactional load. In technical terms, Optimism is an “Optimistic rollup,” and it’s important to understand what rollups do before diving deeper.\n\nWhat is a Rollup?\n\nRollups are one of the multiple scaling solutions intended to help Ethereum achieve a higher transaction throughput.\n\nThe Ethereum Foundation explains that they “perform transaction execution outside layer 1, and then the data is posted to layer 1 where consensus is reached.”\n\nThe main benefit of this is that it reduces the load on the main network while also guaranteeing the broadcasted information by its native security.\n\nThere are two main types of rollups, mainly differentiated by their security models:\n\nZero-Knowledge (ZK) Rollups – these run the computation off-chain and then submit proof of validity to the chain.\n\n– these run the computation off-chain and then submit proof of validity to the chain. Optimistic rollups – these assume that transactions are valid by default and only run computation through fraud-proof if there’s a challenge.\n\nOptimism falls within the second category, and, as you may have probably guessed already, its parent chain is Ethereum.\n\nHow Does Optimism Work?\n\nThe big idea that makes Optimism interesting to most is the Optimistic Rollup. The following is a brief explanation of the concept’s fundamental principles.\n\nHowever, the TLDR is that an Optimistic Rollup is another way of calling a blockchain designed to take advantage of the security of another network that acts as a parent one.\n\nBlock Storage\n\nAll of the blocks on Optimism are stored within a specific smart contract that’s built on Ethereum and is called CannonicalTransactionChain – CTC to make it easier. They are helped within a list that’s inside of the CTC, and it’s append-only.\n\nThe CTC contains code that guarantees that the current list of blocks can’t be altered by newer transactions on Ethereum. However, this guarantee can be broken if the Ethereum network itself undergoes a reorganization (reorg) and the order is changed.\n\nBlock Production\n\nThe ‘sequencer’ is the single party that manages block production on Optimism. It helps with the network by delivering the following:\n\nInstant transaction confirmations and state updates;\n\nConstructing and executing layer-two blocks;\n\nSubmitting user transactions to layer one.\n\nIt has no mempool, which means that the transactions are accepted (or rejected) immediately. This happens in the order they are received. When someone sends a transaction, the sequencer will check if it’s valid (pays a sufficient fee) and apply it to the local state as a block that’s pending. These pending blocks are then batched and periodically submitted to Ethereum’s network for finalization.\n\nThe main goal of this batching is to reduce the overall transaction fees by spreading certain fixed costs over all of the transactions within a single batch. Of course, this fee may vary depending on the network load at the time when the transactions were sent to the sequencer.\n\nBlock Execution\n\nIt’s important to understand that Ethereum nodes download blocks from Ethereum’s network that’s peer-to-peer. Optimism nodes, on the other hand, download blocks directly from the CTC append-only contract.\n\nTwo primary components make up Optimism nodes: the Ethereum Data Indexer and the Optimism Client Software.\n\nEthereum Data Indexer\n\nIt’s designed to reconstruct the optimism blockchain from blocks that are published to the CTC contract. It’s also called the data transport layer.\n\nOptimism Client Software\n\nThis one closely resembles Geth, which means that Optimism, overall, is very similar in its design to Ethereum. This is also because Optimism shares the same Ethereum Virtual Machine (EVM), account and state structure, gas metering mechanism, and fee schedule.\n\nFault Proofs\n\nUsing an Optimistic Rollup means that state commitments are published to Ethereum’s network directly without requesting proof of their validity. Fault proofs are requested when a state commitment is challenged. If it’s challenged successfully, it is removed and eventually replaced by another one.\n\nThis documents provide a more in-depth and technical explanation of the terms and overall process described above.\n\nHow to Bridge Assets Between Layers\n\nWith layer-two scaling solutions such as Optimism, being able to swap assets between different layers is obviously of paramount importance.\n\nThere are multiple ways to do it. First and foremost, you can hop on the official website and use the bridge provided there. This would only require you to have a Web3 wallet such as MetaMask.\n\nFrom there, you have to select the network from which you want to bridge tokens. This is the supported list:\n\nThere are also options to bridge from centralized exchanges, but it’s critical to note that these happen through providers that Optimism has simply linked to—meaning there’s no endorsement. You should proceed with caution and after conducting thorough due diligence.\n\nFrom there, the process is particularly simple, as all you need to do is confirm the amount and sign the transaction in your wallet.\n\nThere are a couple of options for bridging assets from optimism. You can use a third-party bridge or the official bridge instead. The following is an example of the latter, but keep in mind that bridging from Optimism to Ethereum takes seven days.\n\nAll you need to do is click the arrow in between the value boxes, and this will switch the above transaction. If you haven’t added Optimism to MetaMask, this will also handle it for you. From there, you only have to confirm the amount and sign the transaction:\n\nGovernance: Optimism’s Model\n\nThe native cryptocurrency of the Optimism ecosystem is the OP token.\n\nOptimism is governed by the so-called Optimism Collective. According to the official website, the collective is:\n\n“… a band of companies, communities, and citizens working together to reward public goods and build a sustainable future for Ethereum.”\n\nThat said, the governance of the Optimism Collective itself will consist of two separate houses: The Token House and the Citizens’ House. Let’s break it down.\n\nThe Token House\n\nThe launch of the OP token and the Token House set forth the beginning of the governance of Optimism. OP itself was distributed to hundreds of thousands of addresses, who engaged in community-oriented behavior through the first airdrop (more on that later.)\n\nIn any case, members of the Token House are responsible for deliberating, submitting, and voting on various proposals. To do so, OP holders can either vote directly o choose to delegate their voting power to a third party.\n\nIn essence, the Token House votes on proposals of the following types:\n\nProtocol u grades\n\nInflation adjustment\n\nTreasury appropriations\n\nRights protection\n\nGovernance fund grants\n\nThe Citizens’ House\n\nAt its core, the Citizens’ House is an experimental attempt at a non-plutocratic governance model. It is responsible for retroactive public goods funding.\n\nThe above brings us to our next point, which is the OP token.\n\nIntroducing the OP Token\n\nThe OP token was launched through an airdrop, which distributed a total of 5% of the total supply.\n\nThat said, qualifying users included:\n\nDAO voters\n\nMulti-Sig signers\n\nRepeat Optimism users\n\nGitrcoin donors\n\nIf you suspect you are eligible, you can check out any associated wallets on the official claim page.\n\nMany wonder if there will be a new airdrop, and the short answer is – yes. The team has made it clear that it plans to allocate a total of 19% of the supply for this purpose. Here’s what the overall tokenomics of OP look like:\n\nPlease visit the official website for a more complete look at the economics behind the Optimism ecosystem.\n\nConclusion\n\nOptimism has quickly become one of the most popular Ethereum scaling solutions. Most recently, the Optimism Foundation released a proposal to upgrade the Optimism mainnet to Bedrock, which is a new generation of decentralized Rollup architecture developed by Optimism Labs. Speaking on the matter, the team said:\n\n“We are confident that the post-Bedrock experience will be a positive change for developers in the Optimism ecosystem and have received consistent excitement for the upgrade from our partners. We are committed to making this upgrade a success and are eager to see the results in the months and years to come.”\n\nIt’s also very interesting to monitor how the different layer twos fare in the coming years as the battle between optimistic rollups and ZK-rollups continues."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUlFZc2NvellZZm1odG4wb1Fkbi1OaXR5dHpYa1M3cVdrTWpxLXJaZzh1NzF0OUZFQnhnZWhqT2NGcjVDOFYtdUlpN2kySHdkTFBNcjVmUE5WN19WX1F2UkZmVkNLcXJNS0ZHb2hEUXlEcjg5Q0t3Snp5Y3MzNW9KckpTb2dZRWtvRkRfNUIzYUJiaDBSU0HSAZsBQVVfeXFMTUp0TkNEMzdQVGc5VUdhMDBkeDhzMENPT2NxX3dnTjFCZVVFQ1NXTDRYaVZaTUp1YzlEY1NPTG5RMnllbjVvQm1WVFFIbWplaWlJX0lPTGM5cm90c0lEa1o1ZkI5NXp1UHFsWV9GblBLUFpBMVRrVDhqajhXdDUwNFF2OEZNWjF6U25YYmRDTnZTQnltOFQ0TC1rZzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Withdrawals on Exchanges Skyrocket on Spot ETF Mania, Data Says - U.Today",
        "content": "Advertisement\n\nBased on Glassnode's data, cryptocurrency analyst Leon Waidmann of BTC-ECHO platform indicates massive accumulation interest of Ethereum (ETH) investors. Owners of ETH bags are moving them out of exchanges, which typically is a strong bullish indicator.\n\n$126,000,000 in week: Ethereum (ETH) investors drained exchange reserves\n\nEthereum (ETH) investors are withdrawing their riches from exchanges at an increased pace. As the multi-month trend gained traction, centralized crypto platforms lost $126 million in equivalent in just seven days. The report was shared by Leon Waidmann, a seasoned cryptocurrency analyst, with his X followers.\n\nThis trend started in March 2024, but it gained steam only in Q3, 2024. The local \"top\" of exchanges reserves amount was registered after Ethereum (ETH) set its three-year high above $4,000.\n\nAccelerated withdrawals from exchanges typically are being interpreted as an indicator of investors confidence. As such, amid the new phase of spot ETF hype, Waidmann is enthusiastic about what is next for the ETH price:\n\nAdvertisement\n\nNext big $ETH rally incoming!\n\nEthereum (ETH), the second largest cryptocurrency, is changing hands at $3,500 as of press time. In the last 24 hours, its price gained 1%.\n\nEthereum's (ETH) trading volume lost 15% and declined to $13.3 billion.\n\nSpot Ether ETF launch date finally confirmed\n\nAs covered by U.Today previously, on July 20, the U.S. Chicago Board Options Exchange (CBOE) confirmed the launch of spot ETH ETF in the United States at July 23, 2024.\n\nEthereum ETFs from Fidelity, Invesco Galaxy, Franklin Templeton, VanEck and 21Shares will be available in the first cohort of exchange-traded products based on spot Ether.\n\nWhile this event is typically expected to be a major bullish catalyst for the Ethereum (ETH) price, some experts are cautious about its role.\n\nTop U.S. bank JP Morgan foresees lower interest in ETFs on Ether compared to this of Bitcoin ETFs in January 2024."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQaUpScVMtZ0pVa3QyWHdMeWwxUnRMQzFIUlZBQlRjMXVMWnRFTktqbVk2MDJMSE5fcTM5dUhkWDBOUFFQMHdiV3RxcDVkOGFRaFlZSWlBTFJ1UzVTVTdnajE4N3BTLTFTWTFJclVHMmdmUUVLaHYydTZ4WklVYWZkbmlrc0V4ZDdvNkZ4NmJqR0t4clVwSFRWR3FsdXVhd2pJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Crypto: The Ethereum ETF Soon to Hit the Market, Here is the Key Date! - Cointribune EN",
        "content": "Sat 20 Jul 2024 ▪ 3 min read ▪ by Evans S.\n\nEvery new milestone is eagerly anticipated by investors in the crypto sphere. The latest news? The launch of the first spot Ethereum ETFs, scheduled for July 23, 2024.\n\nThe big day for Ethereum ETFs is approaching\n\nThe Chicago Board Options Exchange (Cboe) recently confirmed the date: the spot Ethereum ETFs will start trading on Tuesday July 23, 2024.\n\nAmong the listed funds, there are prestigious names such as 21Shares Core Ethereum ETF (CETH), Fidelity Ethereum Fund (FETH), Franklin Ethereum ETF (EZET), Invesco Galaxy Ethereum ETF (QETH), and VanEck Ethereum ETF (ETHV). This diversification offers investors a multitude of choices to allocate their funds according to their preferences and investment strategies.\n\nETFs (Exchange-Traded Funds) allow investors to gain exposure to Ethereum without having to directly buy the crypto. Indeed, it significantly simplifies access to the market.\n\nMoreover, ETFs offer a regulated and secure way to invest, which could attract more institutional investors, thereby bringing increased stability and legitimacy to the crypto market.\n\nThe Securities and Exchange Commission (SEC) gave its preliminary approvals in May, marking a significant shift in its position towards Ethereum.\n\nThis turnaround surprised many observers, as the SEC had previously scrutinized Ethereum-centric companies very closely, seemingly treating this asset differently from Bitcoin. Indeed, the final approval of the ETFs by the SEC, expected before July 23, is a formality eagerly awaited.\n\nWhat This Means for Investors\n\nWith these new ETFs, investors have new options to diversify their portfolios. Instead of focusing solely on Bitcoin, they can now add Ethereum to their investment strategy via a more traditional financial product. This diversification can reduce risks and maximize opportunities for gains, particularly in a market as volatile as crypto.\n\nThe arrival of Ethereum ETFs is also likely to attract more institutional investors to the crypto market. These investors, who often manage significant portfolios, are looking for secure and regulated ways to access this growing market. ETFs offer exactly that: exposure to Ethereum without the complexities and risks associated with direct crypto ownership.\n\nIt is plausible that the introduction of spot Ethereum ETFs will have a significant impact on the asset’s price. The increase in institutional demand could drive prices higher, bringing a new dynamic to the market. However, as always in the crypto world, it is essential to remain vigilant and not fall prey to excessive speculation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOX1BhTkJBdnc4MHBiSFV5QW93bGRfSjVrRmVBZDd3UHZlNENzUGdqcVA3d3RGaDZKQlZIMXRnZnYxdmlVVkhRNjA0SE5yR3psS2lKQUFRSVZnRm9HTUd6aHd1V25aTmc4Q3FRSWQ2VHBWRWhrYVB3dE8yX2NLUGRObHpSVnQyWTd6X2fSAY8BQVVfeXFMUDBhY2pxTVJicG5YRlljZWlzdnFXdnBHc1lQaVRVcDdFeEl4VC1nSFNCTWpfRHRaOU5FMWRrenZHTzFCQWpNQndKTk5uZl9EM2YzQ2o1Q0lpVDUxam5JTDVBU0tfZTVKZlZ4NERQM1pFaUFvTFdpbGJXbTlXUV9zeVZSMG9vVFdpMjdUR21RSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Mini Trust, Key Spinoff Concerns Addressed - CoinGape",
        "content": "After Grayscale announced the fee slash for its Ethereum Trust spinoff to an Ethereum Mini Trust ETF, some crypto enthusiasts are curious to know more about the product. Quite a number of people are concerned about how it would operate, considering that it is a new shift.\n\nMechanics For Grayscale Mini Trusts\n\nJames Seyffart, a Senior Bloomberg ETF Analyst, took out time to explain the mechanics of the new Grayscale product. He noted that it would essentially be the same for the Grayscale Bitcoin Trust and BTC Mini Trust ETF. That is, if you own 1,000 shares of ETHE, you should receive 1,000 shares of mini ETH. This is from a share point but from a value point of view, it is quite different.\n\nadvertisement\n\nA person who has $1,000 in ETHE or GBTC, will end up with $900 in the original fund and $100 in the new mini ETFs after the spinoffs.\n\nDoing a thread on the situation for @Grayscale‘s spinoff for $ETHE & $ETH because I’ve gotten about a million questions on it. The mechanics will be essentially the same for $GBTC & $BTC spinoff. If you own 1,000 shares of $ETHE, you should receive 1,000 shares of mini $ETH. 1/ pic.twitter.com/Er66mj5L46 — James Seyffart (@JSeyff) July 19, 2024\n\nMarkedly, July 18 was initially announced as the record date for the first issuance and distribution of shares of the new Grayscale Ethereum Mini Trust. However, it has now been rescheduled for July 23 while the spinoff for GBTC to BTC Trust is scheduled to happen on July 31 as earlier announced.\n\nGrayscale BTC And ETH Mini Trusts Share Distribution\n\nAs a criteria for share distribution, Seyffart stated that one had to be the owner for those shares on the record date. He went on to say the record date was the reason for the drop in ETHE trading price on Thursday when trading commenced. Seyffart believes that GBTC will follow similar trend when its spin off happens in about two weeks.\n\nAccording to the ETF Analyst, ETHE has a current market value of $29. “Theoretically the $ETH shares would hit your brokerage accounts at a much lower handle (price per share) because you are getting an equivalent number of shares in the new fund but its 1/10th of the value of your original position. Somewhere around $2-$3 per share?”\n\nHe says the same applies to GBTC which has a current value of $59 per share. The BTC Trust should trade between $5-$6 per share based on the trading price as of today.\n\nMeanwhile, the sponsor fee for both the Grayscale Bitcoin Mini Trust and the Ethereum Mini Trust has been fixed at 0.15%. This makes the duo the cheapest crypto ETF products in the market to date.\n\nRead More: Telegram To Launch Web3-Enabled Mini App Store, Here’s All\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOYS1DN1BJVngwM2RHMkVydjJNT2F1ZjJpZGx2NG9KOExkSjhDM0IyR0J0NDV2TzQ5WXF2ZE5uZ3YyTWh2TGtCRFh5WGNRQnl1X0ZuUFVIck1TdkZBLVZ6OHVzSmxoQU9kWmx3ZEJzTlB6RENCaWZ5QXk4MmpaQlBjMmFrMGNxTmtQb0QxcTFIbDBOVl9ORFB2Qg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a No-Brainer Buy After the Bitcoin Halving? - The Motley Fool",
        "content": "If history is any guide, Ethereum could be on track to post stellar gains during the current Bitcoin halving cycle.\n\nThe Bitcoin (BTC -4.33%) halving that took place on April 19 was one of the most eagerly anticipated events of the year for crypto investors. Three previous halving events in 2012, 2016, and 2020 have led to spectacular gains for Bitcoin, and the expectation was that this year's halving would kick off yet another bull market cycle.\n\nWhat many investors may not realize, however, is that other cryptocurrencies can also post spectacular gains once the Bitcoin halving cycle starts. One crypto on my radar right now is Ethereum (ETH -7.12%), which could be on track for rapid price appreciation over the next 12 months. Let's take a closer look at why.\n\nBitcoin's impact on the Ethereum ecosystem\n\nKeep in mind that Ethereum is both a cryptocurrency as well as a blockchain ecosystem. This is important, because any new bullish sentiment around Bitcoin tends to benefit the components of these blockchain ecosystems, simply due to the greater interest that investors have in everything crypto-related. This can include everything from non-fungible tokens (NFTs) to decentralized finance (DeFi) exchanges, all of which are built on top of the Ethereum blockchain.\n\nIn many ways, then, the Bitcoin halving is a rising tide that lifts all blockchain boats. This is exactly what happened during the previous Bitcoin halving cycle that kicked off in May 2020. Growing excitement around the Bitcoin halving led to investors looking for other cryptocurrencies that could benefit, and that naturally led them to Ethereum, which has the largest and most diversified blockchain ecosystem of any cryptocurrency.\n\nAs a result of all the new money flooding into the Ethereum ecosystem from crypto investors, the value of Ethereum began to soar. Over a 12-month period starting from the date of the Bitcoin halving in May 2020, Ethereum soared by more than 1,732%.\n\nOf course, there's no guarantee that this same phenomenon will occur yet again for Ethereum in 2024. After all, past performance is no guarantee of future performance. But there are simply so many use cases for Ethereum that I'm increasingly confident that investors will find new sources of value within its sprawling blockchain ecosystem.\n\nLaunch of the new spot Ethereum ETFs\n\nThe second reason why Ethereum could soar in the post-halving cycle has to do with the imminent launch of the new spot Ethereum ETFs. The Securities and Exchange Commission officially gave the go-ahead for these new Ethereum ETFs at the end of May. By coincidence, this happened to line up with the date of the Bitcoin halving in mid-April. So it's now only a matter of time before investor money starts to flow into these ETFs, helping to push up the price of Ethereum.\n\nAdmittedly, there's not as much investor demand for the spot Ethereum ETFs as for the spot Bitcoin ETFs. But as much as $3 billion might flow into these ETFs by the end of 2024. At the very least, this new influx of money would help to soak up any new selling pressure in the crypto market.\n\nHow high can Ethereum go?\n\nThe combination of these two factors could send Ethereum higher over the next 12 months. A growing number of analysts and investors now think that Ethereum could regain its all-time high of $4,891 sometime by the end of 2025. And, from there, Ethereum could soar as high as $22,000 by the year 2030, according to investment firm VanEck.\n\nObviously, a lot needs to go right for Ethereum to skyrocket in value. So keep your eyes on the shifting sentiment around the Bitcoin halving, and how that influences investor perceptions of the value that can be unlocked within blockchain ecosystems. If history is any guide, Ethereum might end up being the no-brainer buy of this Bitcoin halving cycle, just like it was in 2020."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQX1FnN1VSQVBzVGw5dzNYN1BpbnA0QlJUWERBYTdQbjlwVHhDYWJWRGdHUTdWeVB0bkhzSVpNczBZNDRjbi15ckF2N01xU1l0RnZUb1IySV9MTkYxY2R0U3M1VFZycWFadmp1bUJIa01JYkNIVV9tMXd1ZUctVVJWVXlLaE5ScUx4dkowU1k1MWJnb2h1c2hZY2dxLWJsTjdZWnkwNUxtQW1tTXNrOVlIdXFBMlJISy1na3FUWDFDZzFFaVlxclpkRWltVmhVRzBNMHVaS1V3TmlYbVUtWWNQRdIB5gFBVV95cUxQSmtVRVpmZU55M1VnSm5VTGxiYjRvT21YUzQ1RlBPR2xQYUs3LTdSQ1ZUbW15Yk5xN1E3VFlCWjcxY0NrbW56aFM3WlEtZVFYSmpsTjAzZUd3SG9Ma0UxcnRNZ3VNam5GQS1maWZ0azhsclhPWmV4LUljYlVrelktVXlPTThyUUo3RDY4UmhWRS05eFJ6bHNWZ2FOYTU2MWtJR1VENVJnNFJ4M1V4LU9FTk0xS2ZlS0NPQ2VkM0dBeXdEUmRsT2doZDlNRlpaTzdLNkhBRWk1QVp1bE1kV2ZtTlRETnNGQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Solana and Crypto Markets Look Ready To ‘Send’ As Stars Align, According to Investor Chris Burniske - The Daily Hodl",
        "content": "Crypto investor Chris Burniske says that Bitcoin (BTC), Ethereum (ETH), Solana (SOL) and the crypto market in general look ready to make a run.\n\nThe former head of crypto at ARK Invest tells his 292,200 followers on the social media platform X that several catalysts are now lining up, hinting that digital asset markets are on the verge of a rally.\n\nAccording to Burniske, a partner at venture capital firm Placeholder, the highly anticipated launch of Ethereum-based exchange-traded funds (ETFs), Republican presidential candidate Donald Trump speaking at an upcoming Bitcoin event and the current state of BTC, ETH, and SOL charts all suggest major bullishness for crypto markets.\n\n“With ETH ETFs slated to go live, Trump speaking at The Bitcoin Conference, and BTC, ETH, SOL charts that look like [they do] (while equities are weak), it’s hard to see a world where we don’t send next week.”\n\nReuters recently reported that preliminary approval for ETH ETFs was granted while The Bitcoin Conference is set to take place from July 25th-July 27th.\n\nBTC, ETH, and SOL are trading for $67,333, $3,528 and $174 at time of writing, respectively.\n\nThe venture capitalist also provides an update on his prediction that the total market cap of crypto assets will eventually reach $10 trillion. According to his chart, the road to $10 trillion is currently “23%” complete as it sits around $2.2 trillion.\n\nEarlier this month, Burniske said in an interview with Real Vision CEO Raoul Paul that he’s keeping a close eye on the Move ecosystem, which was originally built by social media giant Meta and then used to develop layer-1 blockchains Sui (SUI) and Aptos (APT).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOTVVwR1JCTXJIbUpGcVpOb3d5Y2lfSk95UlpGNk1iWDRsMGE2bEh5MVBGZjVNQmJTbTRNem1kQjk3cllGZHBiNEZFeElIOU1DYXFZYTJ5Ym92Tk1VWnBwcFdDNURZVFl0Uy1mNDZNSXBfWDZfbWJ0bmM0TTIzZXZhSkhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Futures signal a bull market! - Cointribune EN",
        "content": "Sun 21 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum futures market is currently in the spotlight, with recent data indicating a significant increase in open interest. This situation raises questions about the future direction of ETH crypto: are we facing a bullish or bearish trend?\n\nAnalysis of the Ethereum Futures Market\n\nOpen interest for Ethereum futures has recently reached all-time highs, reflecting increased investor confidence in the future rise of ETH prices. A key indicator, the taker buy-sell ratio, shows a strong increase in buy orders. Suggesting a bullish trend for the crypto.\n\nOpen Interest for Ethereum Futures\n\nBinance and Bybit dominate this market with respective open positions of $4.55 billion and $2.4 billion. Significantly influencing price movements. This concentration of activity on a few major crypto platforms can have a noticeable impact on the overall market.\n\nWill ETH Crypto Soon Explode?\n\nBased on funding rates, they can signal excessive optimism if they are high. When funding rates exceed 1.2% per week, it can indicate that the crypto market is overheating and likely to correct. Currently, the funding rate is at 0.04%, or about 0.8% on a weekly basis. This could indicate moderate but noteworthy growth.\n\nExperts agree that ETH could see significant growth in the coming weeks. According to some analyses, ETH price could reach around $6,216.99 by the end of 2024. Other long-term forecasts suggest that ETH could reach up to $40,000 by 2030. These predictions are based on the growing adoption of dApps and continuous improvements in blockchain technology.\n\nCurrent data from the Ethereum futures market shows a moderately bullish trend! Supported by high open interest and an increasing buy ratio. However, investors must remain vigilant for signs of excessive optimism that could precede corrections. By closely monitoring key indicators and staying informed on crypto market trends, investors can better navigate the volatile environment of Ethereum futures.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQY05FS1FvS1duNEpsaTJESmI4TkFUUXQwd3J3X2xGRjBRMVpYQ3hwOFdjOXlUak5tRXo1bHhSNDZhNjU0dmtmbU1fdjNwT01qRGZFbHpONzJTMGlMY3A2elE1WWduT3FRR01sOV9BU2t3ak5SZXdxT2JpZWxHXzF5QU5JMW1mZ9IBiwFBVV95cUxQb296ZE05YS0yM3NVZ1hfNExTOVRsWUkzMnphVmc2SXc2LS1pbVE4NWpFVXExSVJtLWFPRVB1aW5XSEhMYzV0LXoyV3BlTmZMQ1lZM25sWUo4Ri1iMmxhLWM4bUVVUjNRN1RYU2xoVmcwMlhLNTdEVUhERTFOaDE1YkFXakptSEs1QlRN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Rally to $5,000 Imminent As Exchange Reserves Shrink - CoinGape",
        "content": "The cryptocurrency market is poised to end the third week of July on a bullish note. Bitcoin reached a peak of $67,466 on Friday, marking a 15% weekly surge, while Ethereum price surged to a high of $3,540, achieving a 13.7% rise over the week. Looking ahead, Ethereum will capture significant investor attention as five spot Ethereum exchange-traded funds (ETFs) are slated to commence trading on the Chicago Board Options Exchange on July 23.\n\nEthereum Price Poised for a Breakout with Upcoming ETFs Launch\n\nEthereum, the second-largest cryptocurrency by market cap showcased a remarkable recovery in the past two weeks. The bullish turnaround has boasted the assist from $2811 to $3481 registering a growth of 23.8% while the market cap surged to $419.2 Billion.\n\nadvertisement\n\nThe recent price jump above daily EMAs (20, 50, 100, and 200) accentuates a positive shift in market sentiment. Moreover, the 4-hour chart revealed the V-shaped recovery daily as the inverted head and shoulder formation.\n\nThis bullish reversal chart pattern signals a bottom formation and potential for a new breakout opportunity for traders.\n\nMoreover, the Ethereum transition to Proof-of-Stake (PoS) has catalyzed a significant decline in ETH exchange reserves, as highlighted by on-chain analyst elcryptotavo. Since the PoS implementation, Ethereum holders have increasingly opted to stake their ETH, reducing exchange liquidity.\n\n#Ethereum ticking bomb 💣 🚀 #Ethereum reserves on exchanges have been dropping since the move to Proof-of-Stake (PoS) and the approval of the #ETH ETF has only accelerated this trend. 📉💪 How much more will the ETF impact the reserves? 🤔💼 #Crypto #Blockchain #ETHNews… pic.twitter.com/sj4m6eV4lD — EL CRYPTO TAVO (@elcryptotavo) July 18, 2024\n\nThe approval of the Ethereum ETF has further intensified this trend by providing a new investment vehicle for institutional and retail investors. This scarcity effect is expected to drive up Ethereum prices as supply constraints become more pronounced.\n\nFurthermore, the Chicago Board Options Exchange (Cboe) has officially announced that five Ethereum spot ETFs, managed by VanEck, Invesco, Fidelity, 21Shares, and Franklin Templeton, are set to begin trading on July 23.\n\nThus, the Ethereum price forecast hints potential breach of the overhead neckline at $3550 and a 9% rise before challenging Flag pattern resistance.\n\nThe Ether coin has developed this continuation pattern amid the past 4 months of consolidation. The pattern’s two parallel trendlines as major resistance and support allow buyers to recuperate the exhausted bullish.\n\nThe Relative Strength Index indicator at 59% indicates a positive trend for ETH’s future and the potential of entering a high momentum.\n\nA potential breakout from flag resistance will better signal the uptrend continuation and bolster buyers to chase the $5500 target.\n\nFrequently Asked Questions (FAQs) 1. What are Ethereum spot ETFs? Ethereum spot ETFs are investment funds traded on stock exchanges, which hold Ethereum as their underlying asset. 2. What does a decline in ETH exchange reserves mean A decline in ETH exchange reserves refers to a decrease in the amount of Ethereum held on cryptocurrency exchanges 3. Will Ether price hit new high? Amid the upcoming launch of Spot Ethereum ETFs and formation of continuation pattern flag, the ETH price is well-positioned to challenged $4891 peak\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcUFYRUZhSWJBUXlrTjJMSW9BMkVNMUJfTEh2UVZGSFpOZjlDcUtvNjZ4Mi1MQXRmRXVNUkNUTEd6UVB5MXhoc3Z3WDVSNWdfbVN5WFJ5UGNFMHpoZzZHM3pqRlNodXYyaERhTzhsRE5NMVd0NXdqYl9ybkNWeHhyaThkN29Pc0ozemJjWGxQM3ZSQk1iMmFGTNIBngFBVV95cUxPU2hqdXVwNGJwaldySmE1NkZjVXVyREN5dmxRaFhBVEVYWWxob3F3Y190UEVvR09EVEszc1Rfd1dQQ3Zub2E0ZGwxMV84M0VwUjZocHpSRE05cmdWRW9TbUxGZWZ4ZnZvRWhzZnRYVmVSY3Zyc0pNZ2gzai15X21tMmZ4WlRjOC1ZSlFFZmltODVHaUdMT3pHWjg1UnJtdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Critiques Ethereum’s Decentralization Compared to Bitcoin - CoinGape",
        "content": "Ethereum co-founder Vitalik Buterin has a detailed analysis of decentralization in Ethereum compared to Bitcoin and other networks. The issue of centralized mining and staking in blockchains has remained contentious as analysts view models shifting from the core. Buterin also addressed debates with the mainnet and layer 2 solutions.\n\nVitalik Buterin Lauds Decentralization on Ethereum\n\nHe pointed out that Ethereum is in a better place than Bitcoin in terms of robustness and decentralization. Speaking at the ETHCC in Brussels, Vitalik Buterin noted that two mining pools account for 50% of the computing power of Bitcoin while four make up 75%. Drawing lines with Ethereum, he said that a large portion is unidentified which means they are operated by a group of individuals or independent stakers.\n\nadvertisement\n\nHe added that The Lido portion comprises 37 different validators, making the overall system largely decentralized. This generally attracts benefits like a multi-client ecosystem, different users across jurisdictions, and a multi-center knowledge ecosystem.\n\n“There are Geth execution clients and non-Geth execution clients, and the proportion of non-Geth execution clients exceeds that of Geth execution clients. A similar situation also occurs in the consensus client system.”\n\nEthereum moved to a proof-of-stake consensus model after the much anticipated Merge. This essentially swapped miners with stakers reducing its energy use. However, while this method was tipped to aid the network, centralization claims were hammered by critics because of the 32 ETH benchmark.\n\nAlso Read: WazirX Hack Update: Will Investors Get Their Money Back?\n\nValidators and Threshold: A tradeoff\n\nVitalik Buterin highlighted the obstacle of the 32 ETH staking threshold explaining the tradeoff for a cheaper fee. Today, the network has about 1 million validators and if the minimum threshold lowers to 4 ETH, the network would have about 8 million validators and so on increasing the trade-off.\n\n“So, it’s a tradeoff. Ethereum has historically tried to be in the middle of that tradeoff. But if we can find any way to improve it, then we have extra stat points that we can choose to spend on reducing the minimum requirements, or on making it easier to run a node.”\n\nIn a related development, the Ethereum co-founder described blockchains as truth machines providing the same over messages.\n\nA blockchain is a “truth machine” in the specific sense that it provides consensus approximate-truth over when messages were sent. It doesn’t tell you “was the moon landing real?”. This reduces the blockchain’s attack surface by a lot, but it does mean we need other tools to… — vitalik.eth (@VitalikButerin) July 20, 2024\n\nAt press time, ETH price is trading at $3,492, up more than 2% in the last 24 hours. The trading volume is flat over the last day as the market prepares for spot Ethereum ETF launch next week.\n\nAlso Read: Ripple (XRP) Case Update: Lawyer Dismisses SEC Meeting and Settlement Link\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxONEYzZkJGTlR4NlNrTGE5bjRVTmR0bDVxZmJrNGduTFZHZ2xNd2hCdmoybGFCQWx4QnNNSVE5Q1duM19VRE5IbHFSekVKcFVXZmRUSVVCZTBWbFdWRkM3NThFaXU4eTJwS1VPSGg0cTJHTEtxMDRaX2Y2UnFHV00zVElUQTlUWU1ZbTA4eE9CYkdzaGVvd3BqZ2xoTWJsZlJqeTlGT2xpaHdvVVhrdDZDdG5Db2JBdk9YQmxz0gHAAUFVX3lxTE9uMEQ4Yk9BdGZienJob0NyaEFUS1BmTTNKZDRUVS11MlBIeXhKM05yR3loY2Z5NUNaTGdzMVRxbDIwTWFVbjY5eDEyVU15eW1JRjRieVNyTkFPdm5wdDRVRDZOMHJMNDNBN3RPWjZpdXhmNEZNbGdYRnFIN3N0VnVIZVlZbVBJUXUwc1g0bUFnZ212bndzamxTQ1RodXNWcXhNdVdoYmVQY0lUVUNmLXhpYy1IWlYyRGJDZGJKcVZzUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Why these altcoins may not rise despite Ethereum ETF impact - FXStreet",
        "content": "Altcoins market cap against Ethereum has been on a multi-year decline.\n\nEthereum has outperformed several altcoins despite wider market assumptions that they provide leveraged exposure to its price.\n\n2x long ETH could yield better results than purchasing altcoins ahead of the Ethereum ETF launch, said analyst.\n\nA recent analysis by onchain analyst Thor Hartvigsen reveals that Ethereum could outperform altcoins after the launch of ETH ETFs despite wider market assumptions that these tokens provide leveraged exposure to ETH.\n\nEthereum has performed fairly better than most altcoins\n\nIn a recent issue, Thor Hartvigsen of On Chain Times noted that investing in Ethereum-related altcoins to gain leveraged exposure to ETH may be a poor strategy ahead of the ETH ETF launch.\n\nHartvigsen highlighted that it's difficult to find specific altcoins that can outperform ETH, as the total altcoin market cap vs. Ethereum has been in a multi-year decline.\n\nIn an analysis comparing Ethereum against tokens across the Layer 2 ecosystem, alternative Layer 1s, DeFi and memes that are assumed to have a high correlation with it, ETH outperformed several of these tokens year-to-date except TON, BNB, PENDLE, ENS, MKR, PEPE and SHIB.\n\nETH vs. Altcoins\n\nThe price correlation between ETH and the tokens that managed to outperform it also reveals a different story, as most of them are 60% or less correlated with ETH. This \"indicates that more of their performance is a result of other factors (potentially BTC correlation or idiosyncratic variables),\" wrote Hartvigsen.\n\nThe analysis also revealed that only a few altcoins have significantly higher volatility than Ethereum, leaving less potential for huge upside should ETH rally following ETH ETFs going live.\n\n\"Buying these altcoins as a way to get leveraged exposure to ETH is, in my opinion, a foolish game as you're taking on a lot of additional risk you might not be aware of. If you're looking for leveraged ETH exposure, simply putting on a 2x ETH long on e.g., Aave is more sensible. Here, you achieve a 100% correlation and a beta value of 2,\" Hartvigsen advised."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPU2ZLWWV4UzlGdkY3d0xKVXJqNjBFZklQREJJVnEzTF9XOUlMcENJaGtFVVVTd3ZoTzZtZmVYNkF4cUpMZmdDb3VwcU9MSFp6aU1wNy1JcEE5eFVTMUc5dXNaa2dQRmxkQXlBelVHU3dXT0xtVFVzb1preUZ4aFh2YWRic0YycWxNQWVzbEE2V20xVkVmdXBoTVZma9IBoAFBVV95cUxOVGhEMW1BOVIxajJtVmdPaGExWXM4VnhkVk50TmZyVkt5YVhRMXZsZXZFc3F6U2FlOWM1bU1ZT25kc3E1ZjQzOTlpTy04RnJ4dVpsd2xmVnlhckZ5SEU3dFpvaE1tRm5wUDdFdWZkbTRVUjhhQWpWclRocXVsQWl1TUZRSENHcncwdHktOUZXc3FsUHh2MWZWM3BOSEh5THlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Polygon ranks second to Ethereum for tokenized assets – Will it help MATIC? - AMBCrypto News",
        "content": "Polygon network has seen a surge in RWA interest, including a recent ECB trial.\n\nMATIC traction on the price charts has slowed slightly, with $0.51 as a key price level.\n\nPolygon [MATIC] founder Sandeep Nailwal has acknowledged rising Real World Asset (RWA) interest in the Ethereum [ETH] L2 network. His remarks followed the European Central Bank’s (ECB) recent bond issuance trial.\n\n‘So many RWA’s launching on Polygon organically is very encouraging…Polygon POS is already second only to Ethereum mainnet in terms of the RWA value created.’\n\nHowever, according to RWA.xyz data, the statement was overstated. The platform showed that Polygon was the fifth-largest network based on total market cap, especially in the US tokenized securities market.\n\nWill the RWA interest boost MATIC price?\n\nThe rising RWA interest revealed some positive network effects, as denoted by a surge in MATIC’s daily active addresses, per Sentiment data.\n\nAdditionally, the news update on the ECB trial on the network flipped MATIC’s Weighted Sentiment to positive. However, the metric dropped towards the neutral level as of press time, which could dent market sentiment on MATIC.\n\nAt the time of writing, the daily active address also tanked, which could derail further price upside with fewer users engaging with the altcoin.\n\nMATIC recovery cooled off\n\nOn the price front, MATIC surged 3% on 19th July after Nailwal’s remarks. However, MATIC’s overall recovery in July stalled above $0.55 and retraced to $0.51. The mixed reading on key price chart indicators signaled traders’ caution.\n\nNotably, the RSI (Relative Strength Index) recovered but remained muted below the average level (50). It meant that the recent recovery didn’t gather enough buying pressure to guarantee a stronger upside.\n\nAdditionally, CMF (Chaikin Money Flow) was above average but hovered near the equilibrium level, denoting inflows surged but stagnated in the past few days.\n\nThe above readings suggested that MATIC could struggle to break the overhead hurdle and daily order block above $0.55 (red).\n\nHowever, the $0.51 level was also a crucial demand interest level, as shown by the chart and whale order data.\n\nThe bounce at $0.51 was marked by about $26 million in buy orders in the derivatives market on Binance exchange. Additionally, demand surged in the MATIC spot market, with over $500K in bids at the level.\n\nHence, given the whale interest and massive volume at $0.51, it was a crucial level for any MATIC speculator looking for market entry into the altcoin."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPdXNZM1YyTFZYYXQ0Wmh3OWRWbVhiYWJWbXh0YlM3SWhPY0hLbUdxVXNVUXR0bUZZSHlHVkszWWRJakw3aktSX0NITVVpR0ZnUUdaTUxJeEJHUGhhNndpaF9BY2dMYnRBVEk5d1B2M2EzekFFcm5QeUxBQUZ0RzV2RjNOODJvWTRhcmctZXpUb0Y5MDdGUUtnTTVYT2tRdnczRmowQmxBcjhxb3VpWWl4TEp6TkVPdFdieEdnOG9RekFCdVROb19ObjZNVk91QV95bEhtTGF0QmhEY0JrWWpF0gHkAUFVX3lxTE1samxmQ0VyOTE4U29ZSXJsMFpDRXJJc3RQX21rTXZ2X2tvM2ZadHFSLXVLT0NUYUw3LV9rVEdXb2FqWFExZ0w0c3NKS1dGbHRjUlZRRnBsQWVHaUhZSmVXaTZabGw0ZnFwTkVGRldzVkItZTA2eTQyTkVFaVV4Y2lHS2xTVThNQ1ZfN0dxZUU0Vm84WXE2QXVJZ2k3dHdNTTBvWE92Y0R4YVo5R1NGcDVDV0lJUEJYVlIwNlFGUE9OVThFbEJWRmZTdUxFY1BwQ0ktRWJNd29mYWNpeFBVTE1xMmNobw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Heading To $3.7k, Rollblock (RBLK) Presale Pushes Past $1Million, Render (RNDR) Continues In The Red - Crypto News Flash",
        "content": "There are some notable shifts, the Ethereum price is climbing and the interest in AI crypto like Render (RNDR) is growing. On the other hand, gaming platform Rollblock (RBLK) is drawing significant investor interest, with its presale surpassing $1 million, positioning itself as a promising option for investors who are looking for a big payout.\n\nEthereum (ETH) eyes new highs\n\nEthereum is on a roll. Recently, it broke past the $3.500 resistance level and is currently trading at $3.408. This shows strong potential for more gains. The next big target is $3.467, and if ETH can push through this, we could be looking at $3.700 soon.\n\nSeveral things are boosting this positive outlook. The Relative Strength Index (RSI) for Ethereum is at 55, which means there’s still room for the price to grow before the asset becomes overbought. This suggests that the current rally might continue without a significant pullback anytime soon.\n\nAnother factor driving the Ethereum price up is the upcoming launch of Ethereum spot Exchange-Traded Funds (ETFs) in the United States. This is expected to attract more institutional investors, pushing demand and the Ethereum price even higher.\n\nRender (RNDR) struggles despite rebranding\n\nRender (RNDR) isn’t having the best time. Despite a recent rebranding effort supported by Crypto.com, it’s facing some tough challenges. Now called RENDER, the token aims to boost its platform for AI and entertainment applications, tapping into the growing AI crypto market by offering underutilized GPU capacity for various AI projects.\n\nUnfortunately, these efforts haven’t paid off yet. RNDR is down 7.9% at $6.00, making it one of the day’s biggest losers. It had hit an all-time high of $14 but has been under steady selling pressure since April. This downward trend has continued despite the rebranding, signaling a bearish outlook.\n\nThe rebranding to RENDER was supposed to spark new interest and support from the crypto community, but the market response has been lukewarm. Analysts believe that while the long-term potential of AI crypto is strong, RNDR has significant short-term hurdles to overcome. The current price trend suggests that it might face more downward pressure before seeing any substantial recovery.\n\nRollblock (RBLK) presale surpasses $1 million\n\nUnlike many tokens out there, Rollblock focuses on the online gambling industry, and this fresh approach is attracting a lot of investor attention. The presale has already pulled in over $1 million, with tokens priced at a reasonable $0.017 each.\n\nWhat makes Rollblock stand out? It’s the clever revenue-sharing model. Token holders get a cut of the daily profits from the casino, ensuring a steady income stream. This not only boosts the token’s value but also promises consistent returns, a rare feature in the crypto space.\n\nRollblock also caters to both centralized and decentralized gaming fans, offering a seamless and engaging experience for a wide range of users. This dual approach is crucial in the competitive world of online gambling.\n\nThe online gambling market is set to grow significantly in the coming years. Rollblock’s smart positioning in this booming industry makes it poised for impressive growth. As more users and investors hop on board, the demand for RBLK tokens is likely to soar, pushing up the price and offering substantial returns for those who get in early.\n\nIn conclusion, Rollblock (RBLK) stands out as a compelling investment opportunity in the current crypto landscape. Its innovative revenue-sharing model, combined with a low entry price, makes Rollblock a more stable and lucrative alternative to top meme coins. While the Ethereum price is rising and interest in AI crypto like Render is growing, this doesn’t guarantee success for all projects in these categories.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\n\n\nWebsite: https://presale.rollblock.io/\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNcXB6SWNZRXdvdTNTeWtCV0RuV2JSeWRPVGYyRGc1clNmTXpQekFjTVhwTEtjcVlnY3pMUmNrcFZOLVZ1N1pDekVXc21IclVpdzV1Z3lKcFdDMThWb3E0WXR6dTJFamxKLUx4bEVYeGYxMWtWRWgwUUF1aEU4M3Z3enJuNlVqRmtVeVc00gGQAUFVX3lxTFBLckVfa2VYOTFqbm5Eb1FRVUZLWExNOEJOaURnQ1lsV0xndlV1Zk0yOWFJM2ZRWGItbjhoQ2dUbXp5R1BlWFM1cnZEbFBkRnFVaWRRMUJhSzdLb2M0YVdGTWFGUjBPOE9pWlRLUjE3OGxyQXVCOVZJS29aSDBicFRCTXotNEU5OGxCSmtkZVdyMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "ETH Supply Surge Casts Shadow on Spot Ethereum ETF Excitement - CoinGape",
        "content": "We are just three days away from the approval of the spot Ethereum ETF, and the excitement among investors is pretty high. However, rapidly increasing ETH supply over the past two months is one of the major concerns going ahead.\n\nETH Supply Increasing by 60K Per Month\n\nPopular market analyst Benjamin Cowen stated that the Ethereum supply has been increasing by 60K per month since April. He added that if this continues to happen until December this year, the ETH supply in circulation will be similar to that before the Merge event back in September 2022.\n\nadvertisement\n\nOver the last 30 days, the supply of ETH is up by almost 60,000 ETH. pic.twitter.com/3XuFUjZDPC — Benjamin Cowen (@intocryptoverse) July 19, 2024\n\nIn the last three months, the Ethereum supply has surged by 150,000. “Currently, since the merge the supply is -298,000. But that will only take 5 months to revert at this pace,” said Cowen.\n\nCowen added that the major driver for the Ethereum price surge moving ahead would be nothing but the monetary policy. Unless and until the Fed pivots and moves to quantitative easing, Cowen doesn’t expect a major surge in Ethereum going ahead.\n\nAccording to Cowen’s analysis, the ETH/BTC trading pair experienced a false breakdown below its lows in Q2 2016, followed by genuine capitulation in Q4 of the BTC halving year. If the current pattern mirrors 2016, Cowen suggests that the final capitulation for ETH/BTC may not commence until September 2024. This timeline would allow sufficient time for the initial excitement surrounding the spot ETF, relative to BTC, to diminish.\n\n“If you follow monetary policy, last cycle ETH/BTC broke support the same month that the Fed cut rates,” said Cowen. Well, reports suggest that the Fed Rate cuts could commence sometime around September this year.\n\nAlso read: Fed To Mirror ECB Rate Pause? Here’s What It Means For Bitcoin\n\nCiting historical charts, Cowen explains that the ETH/BTC pair wicked down to the lows in August, while making a substantial rally the next month in September. He believes that a similar pattern could repeat this time as well.\n\nWill spot Ethereum ETF Absorb the Supply?\n\nWith the spot Ethereum ETF hitting the market next week, investors are excited about strong inflows that could follow. Issuers like BlackRock, Fidelity, Grayscale, and others announced their fee structure earlier this week.\n\nMany market analysts have been expecting multi-billion dollar inflows coming into Ethereum ETF by the end of 2024. However, this may not happen immediately after the approval. Some analysts also believe that there’s a chance of a sell-the-news kind of event to occur.\n\nAlso Read: Is Ethereum ETF Launch “Sell The News” Event Like Bitcoin ETF?\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPLTVTd3VKN3UyMXoxYXpMNUdrWkJXRUQyNHNPX1g0N09IeEJNQmQwNGRNZDNybmIydFA5VXhTOE01bWEyQ3hxTF9zeGdNT3NXdUVReGtkU2JWZVc2V1pPaHlORndSOG5JT1N1dEpBN0FmZXJjMU5OcUdJenNxaS1ZMmhYaUVYblBHRXdpbG5lUlJGMDJ1LV80M21FWjlmVmF6cXRZRV8za2FjZWpObWZoOE9yM1dVWFNNTEZHSHVOU1ViSnh2akZJWDlNT0ZkZnBSQk9HeVZR0gHbAUFVX3lxTE9tM0FJX21tV1hpeGNCenA4dVF6X0NkQTMzYzZzQU5rZ2E2LWttOEZvVGl2MXphSlFHdlJvSll0SmJDazN3QzAzR3lLWHlVV1EwX2V1bnVGMDdHLXJTbl9lemdJRlBwa3hPaDFmcTVoUHBPMDNvck56OFN3NENUSnRETWRjZnRzcDF5RmdIb0dOT05UZUhJbXhVcF9BTDAtNXk4NEdSZ3VGNjlVYnNXZXFIakgwX0tMYVdlTVVHcnJYTkZKeVc4VmU3QkZoOTY2ZkR2VWc4YnpIdUtQMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "First Bitcoin and now ETH ETFs: Where is the market headed next? - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nETH ETF products are expected to start trading this summer, fueling ongoing market optimism. Institutional market data provider Kaiko has released a report, projecting that Ethereum will outpace Bitcoin following the launch of spot Ether ETFs. The current conversation centers on whether Ethereum can reach $5,000 by the end of 2024.This year, spot crypto ETFs have dominated market spaces, attracting billions from investors. The approval of spot Bitcoin ETFs on January 11 sparked renewed market optimism, paving the way for Ethereum. The success of Bitcoin products has increased investor interest in Ethereum, driving crypto prices to new highs.Just as the current web is the result of countless contributions from a diverse range of programmers, Ethereum is the product of the innovative efforts of thousands of individuals, each bringing unique ideas to the table. These pioneers are working tirelessly on various facets of blockchain technology, decentralized applications, smart contracts , and more. Their collective ingenuity and dedication are what drive Ethereum's continuous evolution, making it a powerful, decentralized platform that is reshaping industries and paving the way for the future of digital finance and beyond.Traditional investors are increasingly drawn to Ethereum because of the smart contract functionality and the numerous decentralized applications (dApps) in its ecosystem. The Ethereum ecosystem hosts over 4,000 dApps and millions of smart contracts. With the growing adoption and utility of Layer 2 solutions within the Ethereum ecosystem, these figures are expected to increase significantly over the next few years.According to the latest data, the total value locked (TVL) in Ethereum Layer 2 networks has surged to an all-time high of $47 billion, marking a tenfold increase since March this year. This milestone underscores the growing importance of Layer 2 solutions within the Ethereum ecosystem. Arbitrum One leads with a TVL of nearly $19 billion, followed by OP Mainnet and Base, each exceeding $6 billion. Other networks, including Blast, Mantle, Linea, and Starknet, also boast TVLs surpassing $1 billion.The introduction of ETFs is pivotal as they attract institutional investors who bring substantial capital and a long-term investment outlook, thereby contributing to market stability. This influx is expected to significantly accelerate the growth of the asset class.The Bitcoin ETFs have already set a positive narrative in the market, with over $50 billion invested in 10 newly launched Bitcoin ETFs within five months of their introduction.Institutions already invested in Bitcoin ETFs are likely to diversify into these newly approved Ethereum ETFs. If Ethereum ETFs experience similar success, substantial institutional investments combined with bullish speculative trading could drive ETH prices to new all-time highs.According to media sources, VanEck, a global fund manager, expressed optimism regarding the future potential of Ethereum Layer 2 networks. The firm forecasts that these networks could achieve a valuation exceeding $1 trillion by the year 2030.Moreover, Ethereum’s upcoming Pectra upgrade, scheduled for Q1 2025, is anticipated to be a significant milestone for the network. This upgrade will further help Ethereum maintain its leadership in dApps and smart contracts, advancing the broader blockchain industry.Building on the success of the Dencun upgrade, Pectra aims to enhance Ethereum's efficiency and functionality through various Ethereum Improvement Proposals (EIPs), notably EIP-3074. This proposal introduces features such as grouped transactions, allowing users to sign into a transaction only once regardless of its complexity, thereby improving transaction management and wallet usability. Furthermore, Pectra aims to streamline network operations, reduce transaction costs, and simplify complexities. A notable aspect of EIP-3074 is its \"social recovery\" feature, enabling users to recover access to their crypto wallets without relying on seed phrases.Ethereum has been on a strong bullish trajectory, currently trading around $4,000. Its current momentum suggests it is well-positioned to sustain and potentially continue its upward rally.With the introduction of Bitcoin and ETH ETFs, the floodgates have opened for more crypto exchange-traded products, including the potential for a Solana-based ETF. This surge in Crypto ETFs marks a shift in perception, transitioning crypto from being perceived solely as a speculative asset to becoming a foundational element of investment portfolios.The increased involvement of financial institutions adds further credibility to crypto assets.This broader acceptance is expected to drive mainstream adoption and reflects a maturing regulatory environment, which in turn contributes to legitimizing the entire digital asset space.(The author Sumit Gupta is Co-founder, CoinDCX. Views are own): Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPOHlGQVlBMEVoUDh4a2l5eVdBQzNHcnRId3hCYWxreDJrMlgzREU5eWJrUWJqSGxQNEtfeS1MaXBfc1RsVks3RmJJdmxqdGxiMUl6RUd3b0RzV3hSQjNEdGhNdUVpWmQtRWZ6bFh3eEp6Tnl6bDRyRkhyT3JCTHVHLVhuNV9HazJGWTFFcTZYeGhXTjd4RmRz0gGcAUFVX3lxTE1nRlpiS2gzWTRDTWZFdEhKVFJyTkU4V0pHeW1lOUg3T1dxU1FnWjlZRVEycWVZVEVwbkRIeVBUTGlpTXdIYVNITkI5ZEYzNW9TdFlhaVF2Vm5GS0ZGNlNRYnBVcVZOcXM1SGlxcDRaMGZhbVVrZHRRemVWVERWZ1dfVjBxd0lsaGkxR0V2dWtFemJWcWVVcmFoLTJhRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs See $1.2B Inflow as CBOE Sets Ethereum ETF Launch Date - CryptoPotato",
        "content": "Spot Bitcoin ETFs have racked up around $1.24 billion in inflows over the past week as spot markets recover.\n\nPreliminary figures from Farside Investors suggest that Friday, July 19, saw inflows of $384 million, with Fidelity leading the pack at $140 million inflows.\n\nThis marks eleven consecutive trading days with a positive flow to these institutional investment products. Even Grayscale saw an inflow of $20 million to its GBTC spot ETF on Friday, the first positive flow day for the fund for a week.\n\nEthereum ETF Dates\n\nOn July 19, the CBOE announced that five spot Ethereum ETFs will begin trading on July 23, “pending regulatory effectiveness.”\n\nThe five products set to start trading next week are the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF.\n\nCboe new listings… It’s happening. Almost go time. pic.twitter.com/V1wCcxYoCH — Nate Geraci (@NateGeraci) July 19, 2024\n\nHowever, the Security and Exchange Commission has yet to officially sign off on S-1 documents for the respective funds.\n\nMost of the issuers have stated that they will temporarily waive or discount fees to compete for market share, as reported by CryptoPotato.\n\nAlso, on July 19, Grayscale announced plans to spin off a portion of its flagship Grayscale Bitcoin Trust (GBTC) into a new ETF, the Grayscale Bitcoin Mini Trust (BTC).\n\nThe firm will allocate 10% of its spot Bitcoin ETF assets to the new fund, which is likely to have a more competitive fee structure than the 1.5% charged on GBTC.\n\nMoreover, the firm will do the same thing when its Ethereum product is converted to a spot ETF. Existing ETHE shareholders will receive a proportional distribution of shares in its new Grayscale Ethereum Mini Trust (ETH) on July 31.\n\nOn July 19, Bloomberg ETF analyst James Seyffart said that from a value point of view, “a theoretical person has $1,000 in ETHE or GBTC. After the spinoffs occur, it should essentially be $900 in the original fund and $100 in the new mini ETFs.”\n\nDoing a thread on the situation for @Grayscale‘s spinoff for $ETHE & $ETH because I’ve gotten about a million questions on it. The mechanics will be essentially the same for $GBTC & $BTC spinoff. If you own 1,000 shares of $ETHE, you should receive 1,000 shares of mini $ETH. 1/ pic.twitter.com/Er66mj5L46 — James Seyffart (@JSeyff) July 19, 2024\n\nETHE Exodus?\n\nThere are currently 271,793 BTC worth around $18.2 billion in Grayscale’s GBTC ETF and $9.2 billion in Ethereum in its yet-to-be-converted ETHE fund.\n\nGrayscale’s crypto funds are among the longest-running in the industry, with GBTC launching in 2013 and ETHE in 2017.\n\nThere has been concern about an exodus similar to that from GBTC from ETHE when it gets converted, but distribution to the more competitive Ethereum Mini Trust should alleviate some of the outflow pressure."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcWJVc3pmNnJtSENFSVhoZHB6NlI0NTFhWWppb3BITUxZRmRXN1E0OFp3bnlvR0JfRjY2WHdwZHQ1UXp1YlRmcnRIdlZVMC1WREpiVXpPcUNSQkZHVWtRbWhzdEdfSVNNX3ZBMG00MmlkQUoxcjlqY0ZwTjBMUF9MOVpUeTFNMWxGdGfSAY8BQVVfeXFMT2ZXUnNfOUJwTkl0ODV1dFZ3WlI2Y3NjbXZzUldpdnlkbDJoS2ZYOTc0amRsd3BnMGE4Wnh2YXRvZ3JWNkV4ZENONk1MakRYVFI0dzluSzJMdkJuVU1MY3VVNl9ZNWZpbXNRdGoxWVd2Tm8ybUxsbVFiaXo5WlI3LUo5ZHhjZlVyX2l0NDVTcTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum’s road to $3.9K – Here’s what can and should not happen! - AMBCrypto News",
        "content": "Ethereum has been on the verge of surging past the $3.5k resistance level over the last five days\n\nTraders can anticipate a rally towards $3.9k, but chances of a bearish reversal thereafter would solidify\n\nEthereum [ETH], at the time of writing, was trading below the $3.5k-$3.6k resistance zone. Its momentum has stalled over the past week. In fact, a recent report revealed that the taker buy-sell ratio fell below 1 too.\n\nThis indicated a reduction in buying pressure in recent days.\n\nThe daily RSI signaled bullish momentum, but the OBV was closer to the lows of a range from May. This was not a good sign for the bulls.\n\nHence, AMBCrypto investigated whether the on-chain metrics leaned bearishly or bullishly.\n\nRecent positive netflows explain stalled momentum\n\nThe exchange netflow data revealed that over the past week, 57.98k ETH flowed into exchanges. Over the past month, 70.11k ETH flowed in.\n\nThis meant more inflows than outflows, which in turn precipitated potentially greater selling pressure in the altcoin’s market.\n\nAdditionally, the in/out of the money graph revealed that by volume, the $3171-$3276 zone was the strongest demand zone.\n\nMeanwhile, the $3.5k and $3.7k resistance levels might pose as opposition to the market’s bulls.\n\nOn-chain metrics underline Ethereum’s stagnancy\n\nThe 180-day mean dollar invested age (MDIA) metric has been trending higher since April. A prolonged uptrend is not welcome as it indicates reduced network activity and investments getting stagnant.\n\nOn the other hand, the development activity has been robust regardless of ETH’s price trend, which long-term investors would appreciate.\n\nThe daily active addresses and network growth saw a spike on 22 June, but both metrics have receded since. The age-consumed metric has also been quiet over the past week.\n\nOverall, the metrics showed that Ethereum would have a tough time climbing past the $3.6k-$3.7k resistance.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis point was reinforced by AMBCrypto’s analysis of the liquidation heatmap. After sweeping the pool of liquidity at $2.8k, Ethereum has rebounded healthily. Two liquidity clusters at $3.7k and $3.9k loomed ahead.\n\nIt could attract prices to them and reverse the trend, just as investors get excited about the potential for Ethereum to break the $4k resistance level."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUGxmbmtzcXVzeEVWZHVQQ2tPZ29zUUprNVFvdE1Ya2tJbURjVW44OHV4S0VNVktua2YxbzVyVXZRdkMtNXQzX05ySEExQmNrT09Qa2E1UlBuaHdWN0xBTWZlLXZVUGh4ZGpldGZ5ZC1RZy0yZ29OM0oxaUc5QkppVndoQXVVSzNsZkJUYmdoWXZRQVRrNjQ4VVd30gGfAUFVX3lxTFBxb2daTWlRcnByc2hQaklibEw1dnFOZXNQUW0xa3NrSHlSaGRVUFB4LXNzYV9ndWcxLW9JYlRJd0JoVE9qdkphWll5Zzdpd21DV1llS2lUWkdxQzVZeWQxUkh5SFJldXVyQUpiSDB6VFIyRWR4Uzk1U3RtX3BITElONnZVWHo1VjRqRDFCbnIydEdLcmM0UWxUZ1ZqX3pxOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum to $5000 after Spot ETF launch? These market trends could be key… - AMBCrypto News",
        "content": "A key indicator suggested that Ethereum might touch $5k in the coming months\n\nNonetheless, a few of the other market indicators turned bearish and flashed red\n\nThe hype around Ethereum [ETH] ETFs has been rising lately, with the launch date drawing closer with every passing day. Investors’ expectations of the king of altcoins have also risen, with many expecting the crypto to hit new bullish heights on the back of the Spot ETFs’ launch.\n\nEthereum ETFs create buzz\n\nIt is in this context that IntoTheBlock recently shared a tweet highlighting something very interesting. According to the on-chain analytics platform, $126 million worth of ETH was withdrawn from exchanges this week. This number suggested that investors have been considering accumulating ETH.\n\nAMBCrypto’s analysis of CryptoQuant’s data also told a similar story. We found that the token’s exchange reserves dropped sharply, reflecting a hike in buying pressure.\n\nNotably, this has been happening days before the much-awaited Spot ETH ETF launch. Connecting the dots, investors might be expecting the king of altcoin’s price to skyrocket after the launch.\n\nMoreover, ETH’s Coinbase premium was green too, meaning that buying sentiment has been strong among U.S investors.\n\nApart from this, AMBCrypto reported previously that investors have been showing confidence in ETH. ETH’s taker buy/sell ratio, for instance, saw notable spikes above the value of 1 in recent weeks, indicating shifts in market dynamics. Here, a taker buy/sell ratio above 1 is a strong indicator of aggressive purchasing by bulls.\n\nWe then took a look at Glassnode’s data to find out where Ethereum might go if this bull rally continues.\n\nAccording to the Pi Cycle Top indicator, ETH’s price has started to move above its possible market bottom. If the indicator is to be believed, then ETH might touch $5k in the coming months.\n\nIs a further uptrend likely?\n\nAMBCrypto then assessed Santiment’s data to find out whether the road to $5k is something to expect in the short term. We found that its MVRV ratio rose sharply, which can be inferred as a bullish signal.\n\nAt press time, Ethereum’s MVRV ratio had a value of over 5.97%. Ethereum’s network growth was also high, indicating that more addresses were created to transfer the token. Additionally, its daily active address remained stable last week, reflecting robust network activity.\n\nFinally, the technical indicator MACD displayed a clear bullish advantage in the market. However, at the time of writing, ETH was testing a crucial resistance. It’s imperative for ETH to break above that level in order to sustain its bull rally.\n\nThe Money Flow Index (MFI) was in the overbought zone and can exert selling pressure in the short-term.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, the Chaikin Money Flow (CMF) also registered a downtick.\n\nTaken together, these indicators suggested that ETH might take more time to climb above its resistance level on the charts."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMirgJBVV95cUxPbGw3cVNsWWpURWZreG5FbGQxNDJLTkVFQVVJbWplci10bzBVZWZJVGplRlF6dFdiUHpZQlY2YWoyV1lSWjBlNWRqbm1xMDRtdmRMOUxsSHplTF9pWl9DYWRjbUxYcHpyWHcxUXdlZzFwckxVNlF6WVlXY0k4UzdLcGVaTi1NNXg1c2hyUWFJc2wtR2J4eFhUU0NFV0lyNFRhY2JNUU5LclFlVVFTWXc0dTdGTU9DWGVjS2VzMGhhalJNWnBkLWt4Z3hmb1RQRGtOUnJJOWNSSUxhcWl5VjNDWnp4blZodjNKV3JNR2tSTlRQTVRWamtWREdJbnBZVFRfVTN6d3ZySmZNbTJkUEswR3RPUG1NUlJ2WEszdmRZLWFDZWNMWlRiUURRM2lCQdIBuwJBVV95cUxQd0Y5aVpjNW15R3U5ZDlSQ052QWoycWZJNlJKSWYwRmZ1ekhVY3RhYVBOd29qVW5xa1RBbnlqUU13Q3FIc00wSEVrTWpHQnRZMGVkTkR3d1czRjIxemNzaFNBTVZJbC1mR05OZEdVOTRKVE93NmhZaDVwdDNsSzl5V1NNY2lyaEdydkdNZVg1cktaOHpwM0ZjYmthb2dza3VTN01PdVQxWTNnQlpNWjd6NTl6Ni11VnpMamVMS1dPODYzMnJJaFd5V3gtYm5LR0VmTFdPUl9oWWlvclpCeUxKb2hONHdlQlFFalhucE81LWZ0UHBESFA0YlVRVDVIQ20tVUJzWWZleWFkS1JhS01VODFCYURxSDRkQ1g5LWk1NE15SEx6MWwwakdGWGlzdkpOS09aOVlnOEJhdHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Poised for Breakout as It Expects an Important Week of ETF Decision Amid SEC Commodity Classification - Bulls Target $4K by July End - Analytics Insight",
        "content": "This classification is of great significance for the cryptocurrency industry and this will allow other crypto assets to possibly change their regulatory status over time giving some reprieve to founders and investors in this space.\n\nSeveral economic indicators and regulatory developments are expected this week making it a crucial one for the cryptocurrency market. There is particular excitement around the SEC pending decision regarding spot Ethereum ETF approval. Moreover increased expectations on US Q2 GDP growth from 1.4% to 1.9% could add more fuel to investor optimism.\n\nETH Technical Analysis\n\nEthereum's price action has been dynamic in recent weeks. After reaching a high of $3,973 on May 27th ETH experienced a breakdown from a bullish flag pattern temporarily invalidating the short-term bullish pressure. The price found support around $2,809.41 on July 5th creating a low point."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9xbUI5V0tJWmxnak5WY3lBTEVWX01qT2cyM0pkLTBMSmlPYkQ5Y0ZrVzFDT2J6YnhBRzJWV0pucE1LT2F6QjRSeUF1b2VVcHR2RWhiN0ZpejBybWJmaVFHSUUxdnFKZ2dVTGFHY2dOcGhPNVFUUkxqMtIBfkFVX3lxTE1fcXRUcUQta3hwYW10LXdtNHVTNlRsdEdYTHlrdllUdFR6cmpXMmNYMW1aOXpTSHpOOW1MdFhpOWRjelVqd0stRTJ0OFdQZmdER3ZrMUt1MEsxNGRoRlBKZk1sQTQxZnFfa3pMMlB3NlRCTjUtS3B3ZnhaZFkydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 10:02:39 GMT",
        "title": "CBOE Global Markets Lists Spot Ethereum ETFs, Confirms Launch Date - NewsBTC",
        "content": "The Chicago Board Options Exchange (CBOE) has confirmed the launch date for Spot Ethereum ETFs, revealing when five Spot ETH ETFs will commence trading in the crypto market.\n\nCBOE Finalizes Launch Date For Spot Ethereum ETFs\n\nOn July 19, the CBOE released a new issue notification on its official website concerning the launch of Spot Ethereum ETFs trading. According to the notification, five Spot ETH ETFs will begin trading on the Chicago Board Options Exchange on July 23, 2024, pending regulatory effectiveness.\n\nPreviously, analysts, including Bloomberg Senior ETF analyst, Eric Balchunas, had predicted that Spot ETH ETFs could start trading on July 2. However, Balchunas has since revised his forecast, suggesting in another X (formerly Twitter) post that ETH ETFs would likely launch on July 18.\n\nRelated Reading\n\nCrypto Market Rebounds From Lows, But Why Are Cardano Holders Suffering Losses? 2 months ago\n\nAmid the fluctuating timelines for Spot Ethereum’s debut, the CBOE’s confirmation carries significant weight, aligning with the summer launch date projected by the United States Securities and Exchange Commission (SEC). The adjustment to a July 23 launch date is partly due to delays from several Spot Ethereum ETF issuers, who have needed to amend and resubmit their S-1 registration forms to the SEC for review and approval.\n\nThe five Spot ETH ETFs set to begin trading on July 23 include Fidelity Ethereum ETF Fund (FETH), Ark 21Shares Core Ethereum ETF (CETH), Franklin Ethereum ETF (EZET), VanEck Ethereum ETF (ETHV), and Invesco Galaxy Ethereum ETF (QETH).\n\nThe launch of these Spot Ethereum ETFs represents a significant milestone in the crypto market, providing investors the opportunity to gain exposure to ETH without the significant risks of volatility often associated with cryptocurrencies. Furthermore, the introduction of Spot Ethereum ETFs is set to bring greater diversification in the crypto market, offering investors a new trading option beyond Spot Bitcoin ETFs.\n\nWhile CBOE’s confirmation of Spot Ethereum ETFs launch is a promising development for the crypto market, the real focus will be on the performance and demand of these ETFs, as their success could set a precedent for more crypto ETF filings in the future.\n\nWill ETH ETFs Match Bitcoin ETFs Demand Post Launch?\n\nThe performance of Ethereum Spot ETFs has been a hot topic in the crypto space, as analysts constantly analyze whether the demand for ETH ETFs could potentially match or even surpass that of Spot Bitcoin ETFs.\n\nRelated Reading\n\nCan Burns Send The Shiba Inu And LUNC Price To $0.01? Expert Chimes In 2 months ago\n\nMatt Hougan, the Chief Investment Officer (CIO) of Bitwise, predicts that Ethereum Spot ETFs will be a resounding success, gathering about $15 billion in new assets within the first 18 months in the market. The Bitwise CIO also stated that the demand for ETH ETFs will surge significantly, potentially propelling the price of ETH to a $5,000 all time high.\n\nIn contrast, Samson Mow, the CEO of JAN3, a Bitcoin technology company, believes that Spot Ethereum ETFs will not be as bullish as Spot Bitcoin ETFs. He further added that Ether ETFs will massively underperform Bitcoin ETFs in the market.\n\nWhile there are differing opinions regarding the success of Spot Ethereum ETFs, it remains uncertain just how well these investment products will perform following its launch.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQN2FPYm85UjF2eC1FU2hibGROR3J0ZnB6X3d6QUt3VXpMcjM3YmRLRUJzN1cyeWNEcEVRV1dxNHA3djlGblQwdEJuRDJpSG1VcnBxY2tvbzFGRkdwOUpIMGxpdWdVWmdnTTF6U2lXRTN6TGJBZDQzajdaUWVRWXBSYVRyRDI2OERabEdaZUU4YXh5TEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "AI predicts Ethereum price for August 1 amid ETF launch expectations - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is currently showing signs of recovery after a recent sell-off phase. This has led to a notable rebound, suggesting the potential for a continued uptrend.\n\nThe launch of five spot Ethereum exchange-traded funds (ETFs) on the Chicago Board Options Exchange (CBOE) marks a significant milestone for the cryptocurrency market.\n\nThese five spot Ethereum ETF products, including 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF, will begin trading on July 23.\n\nThis launch has generated considerable excitement among investors, as industry experts predict significant price movements for Ethereum driven by the influx of both institutional and retail capital.\n\nFinbold has leveraged ChatGPT-4o, OpenAI’s advanced and recent AI chatbot model, to offer insights into how Ethereum is likely to trade by August 1, considering key factors influencing Ethereum’s future price trajectory.\n\nKey factors influencing Ethereum’s price\n\nChatGPT-4o highlighted several factors likely to impact Ethereum’s price. Ethereum’s transition to Proof of Stake (PoS) has eliminated new ETH issuance, creating a scarcity effect that increases the value of the existing supply as demand rises.\n\nThe introduction of Ethereum ETFs will attract significant interest from both retail and institutional investors, pushing prices higher in the short term.\n\nFee waivers by ETF issuers are expected to drive initial inflows into these ETFs, further boosting demand. Continued institutional adoption is projected to bring approximately $15 billion in net inflows over the next 18 months.\n\nWith 28% of ETH staked and no forced selling pressure from miners, the reduced market supply supports long-term price stability and growth.\n\nAdditionally, United States Securities and Exchange Commission (SEC) approval signals a favorable regulatory environment, boosting investor confidence and encouraging broader market participation.\n\nBitcoin’s (BTC) price surge following its ETF launch sets a precedent, suggesting similar substantial price appreciation for Ethereum.\n\nChatGPT-4o Ethereum price prediction\n\nGiven these factors, Ethereum’s transition to proof-of-stake, initial ETF demand, fee waivers by issuers, sustained institutional adoption, reduced market supply, regulatory approval, and historical precedent, the environment is primed for Ethereum’s price to reach $4,500 in the short term.\n\nChatGPT-4o on key fatcors influencing ETH price . Source: ChatGPT/Finbold\n\nChatGPT-4o ETH price prediction. Source: ChatGPT/Finbold\n\nIn the long term, Ethereum could reach $6,500 as institutional adoption and market integration drive sustained growth.\n\nEthereum price analysis\n\nCurrently, ETH is priced at $3,490.63, with a 2% increase in the past 24 hours and a 10% increase over the past seven days.\n\nEthereum 7-day price chart. Source: Finbold\n\nIn light of the upcoming ETF launch, AI predictions suggest significant price movements for Ethereum by August 1.\n\nInvestors and traders should closely monitor these developments, as the expected influx of capital and the positive regulatory outlook are likely to drive Ethereum’s price to new heights.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE54LXl1dTFZODNsYXZ6SE9JMm9lVE9ucmxPY0JGa2sxc1JkWXVickRSclhVRFpBWU9ZNjVkQXA5VlJ6SjJYN0N4djM4WGMyZGxTamt0UkdUSi1sNElfVENhQUdORThobXVuYzZtcE0yaGt1MU1hajJYQjF30gF_QVVfeXFMTzJZalRESVZtMlRLWGQya2pKaGVUTTl3RDZPTFd1b1NpNllTS0FIWmhFd2ZqMmdNSnd2T2plNjhQM1BTZWU5dVU2NU5Xa3hvbDBPWE5XQXFORFp5LVk4NDVUMmJGWXh4d3o1MTViVUJQbXdaWVZ6NDdEMXV6cmwzSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "ETH ETFs Drop on July 23rd: Will Ethereum Price Hit $5000? - Coinpedia Fintech News",
        "content": "Zafar is a seasoned crypto and blockchain news writer with four years of experience. Known for accuracy, in-depth analysis, and a clear, engaging style, Zafar actively participates in blockchain communities. Beyond writing, Zafar enjoys trading and exploring the latest trends in the crypto market.\n\nStory Highlights Nine Ethereum ETFs are launching next week, with Grayscale offering the lowest fees.\n\nEthereum's price chart, upcoming ETFs and pro-crypto sentiment could push ETH to a new all-time high above $5,000.\n\nExperts predict that a combination of factors, including ETF launches and positive market conditions will lead it to new heights.\n\nEthereum enthusiasts have long awaited the day when Ether (ETH) would break its previous all-time high and soar to new heights. Various market and non-market factors have hindered this progress, but the current circumstances appear favorable. This time, it seems ETH might finally reach $5,000 or even higher.\n\nLet’s dive into the reasons behind this optimism.\n\nThe Anticipated ETH ETF Launch\n\nFollowing the introduction of Bitcoin ETFs, the crypto world is eagerly awaiting the launch of Ethereum ETFs. The process has been in motion for several months, and according to James Seyffart, a research analyst at Bloomberg, nine ETH ETFs are set to launch next week. Seyffart shared a chart in a tweet, listing the ETH ETF firms, their fees, and other vital information.\n\nSource : James Seyffart Tweet\n\nThe chart clarified several aspects of the Ethereum ETFs. Firms like Grayscale, Franklin, VanEck, Bitwise, and 21Shares have fees ranging between 0.15% and 0.21%. Out of the nine ETFs, Coinbase will be the custodian for seven. Five ETFs will be listed on the Chicago Board Options Exchange (CBOE), three on the New York Stock Exchange, and one on Nasdaq. Notably, Grayscale has reduced its fee from 0.25% to 0.15%, making it the ETF with the lowest fee.\n\nAccording to a CBOE notice, ETF trading will commence on July 23, 2024.\n\nMarket Momentum is Thriving\n\nThe daily chart for Ethereum shows strong positive momentum. At the time of writing, ETH is trading at $3,492.8. Multiple moving averages (MA) support the current price from below. The 50-day MA is closest to the current candle, with the 100-day MA situated between the 50-day and 20-day MAs. The trend suggests that the 20-day MA will cross above the 100-day MA, potentially driving the price higher.\n\nSource : TradingView\n\nETH is currently contending with a resistance zone. However, the Moving Average Convergence Divergence (MACD) indicator suggests that the bulls are gaining strength. Once ETH breaks through this resistance, it will face significant monthly resistance at $3,750, followed by weekly resistance between $3,850 and $4,050.\n\nSeveral external factors also contribute to the optimistic outlook for ETH. The upcoming Ethereum ETF launches and the Bitcoin conference in Nashville, where pro-crypto presidential candidate Donald Trump will be speaking, are significant. Trump’s favorable stance on cryptocurrencies is bolstering market sentiment.\n\nA New All-Time High on the Horizon?\n\nCombining the positive data from the Ethereum chart, the imminent launch of Ethereum ETFs, and the boost from Trump’s pro-crypto stance, all signs point to ETH breaking past its resistances and setting a new all-time high. Experts predict that this time, ETH could surpass $5,000.\n\n\n\nAlso Read : Grayscale Launches Exclusive Decentralized AI Fund for Investors\n\nThe stage is set for a potential Ethereum explosion. Are you all in?"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNYVFGcjF0LTVMZXgwUXQxYnlaTDFmYTctdVA1bXhRUG43OERpMzdyeS12b1dDS0psaVdHVjZ4N29RVVRsckZWTUU0M29UaEoyVTJyTVc5cEtWdlhmSC1ZamtyN2Z2cUdyQ2RfV0RYdmdNeGpnQjNVVVBvcXMtSGY4QTFyOTRmUHpqajNZNjl4N2xrYXNaU21odnF3blo2TEQwRUV0aWZKc0wxMmJ0cEtWN3FURlhLMjRjMVFHMlBwN2t6NFFGSW1jd2RR0gHPAUFVX3lxTE9FN2NBSnJYRUxlSXBaVXZpME1Va2ZKX1pCSVhHLWlKM3JxRldSTlFfNjZoaGVrTnUzT08xMGlKaGUyWDYzWU1UMU5oSW15eGx5WF9nci1LV1FlTzF3Mko3VjFqYkdTZndGYzZtOEFNV0p4RjlZZ09MV1FyRHpyNklmRVdfc2twUWdVOWhVY0dfcTJHMHQxSjVqSkdfQXhtNzJqUGM4bXVoS3BxX3VwaWZ4WEFUcFBvSjFGSHF3V1ZhdkdHRWk4Rk5tLXR4bTBMRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Year-End Predictions: $100,000 and $10,000 Targets Appear Feasible Amid ETF Excitement - Coinpedia Fintech News",
        "content": "Writer by choice, CryptoCurrency Writer, and Researcher by chance. Currently, focusing on financial news and analysis, as well as cryptocurrency news and data. One may not call me a crypto “Enthusiast” but trust me I'm getting there.\n\nOver the past few weeks, important events have impacted Bitcoin, including those related to Mt. Gox. Despite the challenges, the Bitcoin chart is now approaching a potential breakthrough at the $70,000 mark. Analyst Tim Warren, Host of Investing Broz, predicts a possible rally to $82,000 and then towards $100,000. Key resistance is around $66,500, but if bullish momentum continues, this could become a strong support level.\n\nBitcoin’s Potential Breakthrough and Price Predictions\n\nOn The Paul Barron Network, he said, “My chart shows a descending channel with a price prediction of $82,000. This pattern indicates that breaking this resistance with higher volume is extremely bullish. If we break above $70,200, we could see a significant move towards $95,000.”\n\nThe analyst added that the rest of the year is going to be even more exciting with the launch of the Ethereum ETF next week. He raised the question of whether investors will start taking profits from Bitcoin and reallocating into Ethereum, as it seems poised for a significant run.\n\nEthereum ETF Launch and Market Impact\n\nEthereum has recently broken out of a megaphone pattern. The first target is the previous high of around $4,100. In a broader perspective, Ethereum has been in a sideways channel since March, with a breakout prediction towards $5,600 or higher once the ETF starts trading.\n\nHe explained that if Bitcoin rallies to $82,000-$90,000, Ethereum could reach around $5,600. Additionally, a 10% correction in the stock market could lead to a shift of profits into cryptocurrencies, including Bitcoin and Ethereum.\n\nThe analyst added that the upcoming ETF could draw in traditional investors, especially with low trading fees from major financial institutions like Franklin Templeton, Fidelity, and BlackRock. Despite expected volatility, he believes Ethereum will trend upwards, hitting new highs possibly before the U.S. election season.\n\nFor year-end predictions, he suggested Ethereum could realistically reach between $8,000 and $10,000 by January 2025, with a long-term target of $18,000 to $20,000 by the end of the bull market.\n\nAlso Check Out: Top 10 Reasons Why Crypto Bull Run Is On Horizon"
    }
]