[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE11cXJRMjd0ZUstM0JZVmFTRDFoeHhpVGE4RWJnWFBaTUQ2Rlh6aGxnQW1LQU12OXh6STBsQWtxeUVCS3U4NWY4VUg5cGFzVGJMU29vZGdfRDdTLWtiZGFFR0VvdFVGUGRNX0cwbU52NDRhZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Set For Significant Surge, Eyes 0.125 BTC Target - TronWeekly",
        "content": "Jelle­­, a noted cryptocurrency trader, has pre­­sented a detaile­­d analysis of the ETH/BTC trading pair over the past thre­­e years. He highlights a classic Wyckoff re­­-accumulation pattern, indicating that Ethereum (ETH) is on the­­ brink of a significant upward movement.\n\nHe be­­gins with the Preliminary Support (PSY) phase around 0.030 BTC, whe­­re substantial buying interest e­­merged, establishing initial support. This phase­­ was followed by the Automatic Rally (AR), driven by inte­­nse buying pressure, pushing ETH’s price­­ to approximately 0.045 BTC. The rally culminate­d in a Buying Climax (BC) at around 0.085 BTC, marking a peak before a re­actionary decline.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 4\n\nIn the Se­condary Test (ST) phase, the price­ dropped to approximately 0.065 BTC, confirming the support leve­l following an initial peak. Afterward, the Uppe­r Trading range (UT phase B) indicated a consolidation pe­riod, during which prices fluctuated betwe­en 0.065 BTC and 0.080 BTC. This consolidation period showed that se­lling pressure was being absorbe­d and hinted at a potential breakout.\n\nDuring the­ Creek phase, the­ price followed a desce­nding trendline, marking the final stage­s of accumulation before a breakout. The­ Spring phase, which occurred around 0.048 BTC, involved a brie­f shakeout to test support leve­ls, resulting in a temporary decline­ before a rebound. The­ recent price move­ments indicate a rebound, se­tting the stage for a notable upward tre­nd.\n\nEthereum Price Forecast\n\nJelle­ identifies the curre­nt phase as the Test phase­, confirming support around 0.053 BTC. This phase is crucial as it validate­s the­ spring and pre­­pares for the­ ne­xt rally phase­­, potentially targe­ting re­sistance­­ leve­ls. The­ anticipate­­d commenceme­nt of spot ETFs trading in the­­ coming weeks is e­xpe­­cted to bring substantial institutional investme­nt, providing the­­ necessary mome­ntum for Ethereum’s surge.\n\nETH is curre­­ntly trading at $3,069, marking a 3.55% increase in the last 24 hours. Howe­­ver, trading volume has decre­­ased by over 12%. Daily indicators reve­­al a significant downtrend, with the 50-day and 100-day Exponential Moving Ave­­rages (EMAs) positioned well above­­ the current price le­­vel. The 50 EMA stands at approximately $3,372.33, and the­­ 100 EMA is around $3,329.70, indicating a bearish market sentime­­nt.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 5\n\nThe Relative Stre­­ngth Index (RSI) indicator, currently at 38.09, signals bearish mome­­ntum. Despite being be­­low the neutral 50 leve­­l, the RSI shows a slight upward movement, hinting at pote­­ntial bullish divergence. Although in the­­ oversold territory, this suggests the­­ recent price downtre­­nd might be nearing exhaustion.\n\nWhile­ ETH face­s downward pre­ssure, a shift towards positive­ price­ action is possible­ if bullish momentum stre­ngthe­ns. Je­lle’s fore­cast pre­dicts a short-te­rm rise to 0.090 BTC, with a longe­r-te­rm targe­t of 0.125 BTC. Ethereum’s future­ looks promising as the­ market anticipate­s the­ impact of institutional inve­stments and spot ETFs.\n\nRelated Readings | Ethereum’s Strength Surpasses Bitcoin: Analyst Predicts Bullish Trend"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQa010eEc1bzVVbjBzUHp4d3BqSVptdFI4Y01sbHBYZnloLThrQmQ0UFdrcHRITWFrMjZINFpQSy1pdU43QWlMaFlicXFIUUlITmotWG94ZHJoTUdmTEFtSDg0Si1wOVRaajZzYW82RGM3UTZBYlNtVGhOUzd4Z2Z2LVNCdEhmVVlfNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum – what investors need to know - ETF Express",
        "content": "Tim Lowe of Attestant writes that, created in 2009, bitcoin is a “Peer-to-Peer Electronic Cash System”. Vitalik Buterin extended bitcoin and launched Ethereum in 2015, a “Decentralised Application Platform”.\n\nETH and BTC are the tokens used to pay transaction fees and to reward those running blockchain software. BTC is referred to as an inflation hedge or digital gold. ETH could be digital oil, fuel that enables Digital Apps (dApps). Ethereum dApps enable tokenisation, financial infrastructure, games and even social media networks. Applications also enable Ethereum’s use as a backbone for blockchains known as Layer 2s. These are designed around specific requirements such as speed, then use Ethereum as a secure, settlement layer between chains and institutions.\n\nThe market capitalisation of cryptocurrencies has grown over the last five years, however they are still volatile. Bitcoin can be considered digital gold… for the brave. Physical gold still has substantially lower volatility. Despite the differences in the blockchains, they are still highly correlated in terms of price. Changes in BTC price currently drive the crypto market as a whole.\n\nIssuance of new tokens is one area of difference and is defined in the software of each blockchain rather than by committees. Bitcoin issues a fixed number of BTC “rewards” every block paid to “miners” operating the network. Initially 50 BTC per block, the software enforces a 50 per cent reduction every 210,000 blocks (~4 years). From July 2024, the reward was 3.125 BTC and will halve again in 2028.\n\nEthereum requires “Validators” to provide an ETH “Stake”. Rewards are issued in proportion to the stake. Ethereum also removes a portion of transaction fees from circulation. Block rewards increase new ETH, transactions remove ETH from circulation. Since 2022 the supply of ETH has reduced by 335k ETH.\n\nValidators running the Ethereum software earn rewards (~3.071 per cent) however this is complex and has created a new industry where technical service providers run the software on behalf of holders in return for a small percentage of the rewards. This provides an opportunity for all ETH holders to earn yield.\n\nLonger term, staking maybe a differentiator between ETH ETFs. The US issuers initially had this as part of their products but for now, it has been removed.\n\nThere are big differences in energy usage across blockchains. Ethereum relies on the Validators ETH Stake as a security guarantee, but bitcoin Miners can only process transactions if they commit computation to the network. Computation makes it expensive for a malicious actor to disrupt the network. For both blockchains, a substantial economic investment is needed by the Software Operators. With Ethereum, the investment is ETH, with bitcoin it is in computation which requires energy.\n\nGold does not need new functionality in order for it to be considered valuable. Many bitcoin developers believe the same – bitcoin does one thing well and no more, but that is the point. In contrast, Ethereum has a roadmap with releases introducing new functionality every six months.\n\nThe success and adoption of blockchains is driven by the software ecosystem. An annual report published by Electric Capital found over 16,000 Ethereum developers, more than any other Blockchain by a very large margin. Bitcoin was found to have only 1,853 developers.\n\nAccounts holding more than USD100 have grown across both blockchains with a sharp uptick in recent months. Ethereum transactions are steadily growing and account for around four times that of bitcoin. If Ethereum “Layer 2” blockchains are included, the transaction count is far higher and growing.\n\nAs the growth and adoption of cryptocurrencies continues, we are seeing governments around the world take a wide spectrum of regulatory actions. El Salvador became the first country to adopt bitcoin as a legal tender; they have since been followed by other countries. In contrast, cryptocurrencies are subject to different types of bans. As the assets become more widely adopted and understood, hopefully regulation will follow.\n\nA more mundane risk is the displacement of ETH and BTC as the dominant cryptocurrencies. Given how embedded bitcoin is in the public consciousness, this maybe more of an issue for Ethereum. However, Ethereum is well established as a platform for dApps and has by far the largest ecosystem. This combined with the nature of software enables Ethereum to include the best innovations found in competing platforms.\n\nCryptocurrencies are software and so there is always the risk of defects. There are however mechanisms in place to reduce this risk, for example Ethereum is run using multiple versions of the software developed by different teams.\n\nOn the surface bitcoin and Ether are very similar assets currently with a high degree of price correlation. There are however distinct differences that may, in the longer term, cause a divergence in their price. Ethereum has the potential for a big increase in adoption across a wide variety of sectors whilst the narrative around bitcoin as a store of value and hedge against inflation is growing. Diversification across both assets maybe the best strategy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOMXhaYXpWNGlQWW03bjIyWThLTkU4TjQ0NVFud3VyVy1nV2NLUGFBWjNEZGVsZUpOUTNsd3ZIclFTdG5vdEc3Um53b0JUZ3pYTlRIallwOEZPb0NOMDlDa1paVDFLS045bWVlYzBaZklJTXVEbS1WZEt5eG01YXkxRzFNNXlVWWZ1RDlOXzNiVlRIMUlINjFPYVRrR1FnbzZ1RXl3QmN30gGrAUFVX3lxTE5iTTUxY0NwZFphcHc2d1lnVGZIV1lhb3dOcmN2MmtLcmpYVXhCUmJNc3h1S3lkX0I3VktrSGtUeXRra3ZuUm41eDM5TUJVNjlFT1M3anlIbm9fbEtyV19xNHJPc2poaDMxRFpkM0xVSElwUE5qa05iWUJETy03NnhWUERYQTJ0THBjVm5pRlZuQjBQSkwwM3pXaUQxRDlUQ0gxZ3YzT3FGUmVISQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF countdown: Bitwise CIO sees 'birth of a new asset class' - CNBC",
        "content": "Wall Street is getting ready for a new batch of cryptocurrency exchange-traded funds: ethereum.\n\nSpot ether ETFs could hit the market as soon as this week, pending U.S. Securities and Exchange Commission approval, and Bitwise Asset Management's Matthew Hougan plans to get in on the action.\n\n\"What you're seeing is this sort of the birth of a new asset class,\" the firm's chief investment officer told CNBC's \"ETF Edge\" on Monday.\n\nHougan's firm is applying for spot ether ETFs.\n\n\"If you want to invest in the growth of tokenization, ethereum is like the picks and shovels play,\" Hougan said. \"It underpins all of it. … I think that is going to appeal to a lot of people.\"\n\nHe thinks cryptocurrency ETFs overall are a multiyear story. Hougan is referring to the first spot bitcoin ETFs that launched in January. He sees their success as a good indicator of the future.\n\n\"It's [bitcoin] moving into the mainstream,\" he noted. \"That's going to be a multiyear story.\"\n\nSpot bitcoin ETFs have attracted about $15 billion since their launch and currently hold two of the top ETF inflows this year, according to FactSet.\n\nHougan views bitcoin's recent success as unprecedented and sees it as a bullish indicator for spot ether ETFs.\n\n\"If we get five or 10 or 15 billion dollars in the first two years of these ethereum ETFs, that is a massive runaway success,\" Hougan said."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPUFhQWDRvOVdWVkR1ZS1ST3dRNGcxS3YwcmV5VDU2bW9SNGFMVXgyUE5iV2k5aVppZU1tMXFHa1ZPODZhVG9DUWFicWZrcDhtV2R1YzZNZVN5bGQxR0J4b242MVVOUTFMT19IRTQ5OFhReWZyXzVqaEdDUGV0TzRFTWdETTNJa254NGJ6NjUwc0pyOXdkTHAyOVUtQjBiOUw2QlNYaUw0WHkxMDMtcFVfQy0wdVlvcUk0R3h3bGtnRUo5MVBSWXfSAcsBQVVfeXFMTjNKTGxOVDREX1NwdV80WnhRVW1PZHRGeVlEUDdNR2dGM0lRQktFTzRaNF80ODV0SW9WTHp1c29nM0VHVTdjREJ4Q3M5aGJocTV4TzNpMmJHcmxwaGZZeEZWeVF3NU5BdnpLV0g0cmJlczM2YXBWNW9wX2F2MlhDX1Fhck5YbUtHYnZEMTVEUnFyYThIbGhTaUNLZ1Y2UnVBa3ZUNGVQTWRvcy1WT2FLeS1Mb0JwcFZTYVVMNmlOd1pjWXEtQllZcGVmWFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Reflects On Strengths, Weaknesses of Ethereum, 'Hardening' the Blockchain - CoinDesk",
        "content": "“So if you want a robust ecosystem, it needs to be simple,\" Buterin told the crowd. \"It should not have these, like, 73 random hooks and some kind of backwards compatibility because of some random dumb thing that this random guy called Vitalik came up with in 2014.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQUENSc1BPWGw0MjdfQ1QwbW1wVS1qR05GZzRFR1JpblFMdEhZZ2lJTFZjSUFKX1FyMFNoc1RRcFpySno3YjRpdVBOcUZ5LVBTc1V0RkVIU2s5RHUzd2IyRGg5dERfVU1ZOUxhUlg5UjRRY2dBQUVUQkdwVEhLNm9wa1A1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF approval is looming: 2 reasons to avoid - crypto.news",
        "content": "Ethereum price has crawled back in the past two days as investors focus on the approval of spot Ethereum ETFs by the Securities and Exchange Commission (SEC).\n\nETH price rose to $3,112 on Tuesday, 10.5% above where it traded at last Friday. There are hopes that the SEC will approve ETFs soon as companies continue filing their final documents with the agency.\n\nVanEck submitted its amended filing on Monday, while Invesco filed on Tuesday morning. Bitwise and 21Shares have also made their filings. Analysts believe that these funds could start trading as soon as this week.\n\nFirst S-1 just rolled in today from VanEck.. they already had their fee so nothing to see here really, they just putting ball back in SEC's court. Expecting the rest today except for Bitwise who did theirs last week. pic.twitter.com/gF6OZTKIrs — Eric Balchunas (@EricBalchunas) July 8, 2024\n\nThese funds come a few months after the SEC approved spot Bitcoin ETFs, which have seen over $14 billion in inflows.\n\n2 reasons to avoid spot Ethereum ETFs\n\nEthereum funds will provide non-traditional crypto investors a good way to track the price of Ethereum without the need to deal with some of the complexities of crypto, such as wallet keys. As such, funds will be ideal for large institutional investors who find it overly complex to deal with real coins.\n\nHowever, there are two main reasons why investors should consider investing in Ethereum instead of ETFs.\n\nFirst, buying and holding ETF in a hot or cold wallet is in reality a relatively simple process. One can easily do that using one of the popular exchanges like Binance, Coinbase, and OKX, crypto.com, among many others.\n\nAfter buying Ether, the only fee that customers pay is when they are selling their coins to exit the investment.\n\nIn contrast, Ethereum funds will have an expense ratio, likely around 0.25%. In its filing, Invesco Galaxy revealed that its fund will have a unified sponsor fee of 0.25%. This means that a $100,000 investment will attract an annual fee of about $250. Over ten years, if Ether remains steady, an investor would pay $2,500 in fees.\n\nThe fee differential explains why Bitcoin has had a better return than spot Bitcoin ETFs. In the past six months, Bitcoin has risen by 24.31% while the other ETFs have risen by about 20.7%. This spread will compound over time.\n\nBitcoin vs IBIT vs FBTC vs ARKB ETFs\n\nSecond, Ethereum funds will not have staking features, which provides steady income to investors. Data compiled by StakingRewards shows that the total staked Ether stands at over $100 billion, giving it a staking ratio of 27.16%. It has a yield of about 3.29% and a $100k investment will return nearly $3,300 a year.\n\nTherefore, since Ether and spot ETH ETFs will move in sync, it seems like a better idea to just stake Ether."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPeTVnX2J0cTBwVnlhUDZaNzFHSDd2VkxYbWJrMGg2UWRxSXEwQ2lxZGtyOUptbkZmUTZIOGFCazd6MU5jZ3dGbmlCNjRTN2IyRkRIS3RQVFR3WUxZZll5TUtnVmd1eFlPOXdhd2FITEliMVFYWlhYVGdKbURvcGNvR0JZb1gyQXoyWEp3ZGRFNmFuMVBRMnZWUUlmUlF2UGU5NHJTUXJPczY5dVBZdDNHbVhrTjZya3FfbmI2djVhNllWMVRZcE4zbkdyNXM5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "WonderFi Launches Strategic Bitcoin and Ethereum Buying Plan to Diversify Treasury Assets - Newsfile",
        "content": "\n\n\n\n\n\nWonderFi Launches Strategic Bitcoin and Ethereum Buying Plan to Diversify Treasury Assets New program reflects WonderFi's confidence in the long-term value of both cryptocurrencies, while also creating a hedge against fiat currency inflation July 10, 2024 8:00 AM EDT | Source: WonderFi Technologies Inc.\n\nToronto, Ontario--(Newsfile Corp. - July 10, 2024) - WonderFi Technologies Inc. (TSX: WNDR) (OTCQB: WONDF) (the \"Company\" or \"WonderFi\"), Canada's leader in regulated crypto trading, is excited to announce that it has implemented a strategic plan to incorporate Bitcoin and Ethereum into its treasury assets, with the intent of diversifying its treasury and creating a hedge against fiat currency inflation.\n\nWonderFi made its initial purchases of Bitcoin and Ethereum under the new plan on July 5th and intends to invest an average of USD 100,000 per week into these two leading digital assets in the third quarter. The Company will employ dollar cost averaging (\"DCA\") in the purchases to manage potential volatility as it builds its portfolio. WonderFi may also stake the Ethereum it acquires to earn incremental Ethereum through staking rewards. The new program will be evaluated at the end of the quarter, with a decision to pause, modify or terminate the program at any time.\n\nThe July 5th purchase acquired each asset at an average price below USD 56,500 and USD 2,980, respectively. This adds to the 40 Bitcoin and 320 Ethereum that the Company already holds in treasury.\n\n\"WonderFi is deeply committed to the crypto ecosystem and now is an ideal time to demonstrate our confidence in the long-term value of both cryptocurrencies,\" said Dean Skurka, President and CEO of WonderFi. \"The crypto market continues to evolve meaningfully, and this program is an excellent opportunity to take advantage of the long-term upward momentum we're seeing.\"\n\nOver 324,000 Bitcoin, with a current market value of over USD 18 billion, are currently sitting in corporate treasuries, according to BitcoinTreasuries.net.1\n\n1. As of July 9th, 2024, publicly disclosed Bitcoin treasury holdings can be found here: https://bitcointreasuries.net.\n\nABOUT WONDERFI\n\nWonderFi is a Canadian leader in regulated crypto trading with over $1.5 billion in assets under custody across all brands, including Bitbuy and Coinsquare.\n\nDesigned to provide investors with diversified investment exposure across the global digital asset ecosystem, the company has expanded its presence internationally to include operations in Australia, and through SmartPay, a global crypto payments platform.\n\nFor more information, visit www.wonder.fi.\n\nThis news release constitutes \"a designated news release\" for the purposes of the Company's prospectus supplement dated December 23, 2022, to its short form base shelf prospectus dated September 7, 2022.\n\nMedia / Investor Relations\n\nFor additional information, please contact:\n\nHayley Sucharek\n\nKaiser & Partners\n\nHayley.Suchanek@kaiserpartners.com\n\n289.681.2477\n\nCharlie Aikenhead\n\ninvest@wonder.fi\n\nForward-Looking Information and Statements\n\nThis press release contains certain \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable Canadian securities legislation and may also contain statements that may constitute \"forward-looking statements\" within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Such forward-looking information and forward-looking statements are not representative of historical facts or information or current condition, but instead represent only the beliefs of WonderFi Technologies Inc. (\"WonderFi\" or the \"Company\") regarding future events, plans or objectives, many of which, by their nature, are inherently uncertain and outside of the Company's control. Generally, such forward-looking information or forward-looking statements can be identified by the use of forward-looking terminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\", \"projected\", \"planned\", \"estimated\", \"soon\", \"potential\", \"anticipate\" or variations of such words.\n\nBy identifying such information and statements in this manner, the Company is alerting the reader that such information and statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such information and statements. In addition, in connection with the forward-looking information and forward-looking statements contained in this press release, the Company has made certain assumptions. Among the key factors that could cause actual results to differ materially from those projected in the forward-looking information and statements are the following: taxation, controls or regulations and/or changes in the administration of laws, policies and practices and political or economic developments in Canada and other jurisdictions in which the Company carries on business or in which the Company may carry on business in the future; and material adverse changes in general economic, business and political conditions, including changes in the financial markets and compliance with extensive government regulation, decisions to modify, pause or discontinue certain treasury management strategies. These risks are not intended to represent a complete list of the factors that could affect the Company; however, these factors should be considered carefully. Should one or more of these risks, uncertainties or other factors materialize, or should assumptions underlying the forward-looking information or statements prove incorrect, actual results may vary materially from those described herein. The impact of any one assumption, risk, uncertainty, or other factor on a particular forward-looking statement cannot be determined with certainty because they are interdependent and the Company's future decisions and actions will depend on management's assessment of all information at the relevant time. A more fulsome description of risk factors that may impact business, financial condition and results of operation with respect to WonderFi is set out in its management's discussion and analysis and financial statements for the period ended March 31, 2024, available on its SEDER+ profile at www.sedarplus.ca.\n\nAlthough the Company believes that the assumptions and factors used in preparing, and the expectations contained in, the forward-looking information and statements are reasonable, undue reliance should not be placed on such information and statements, and no assurance or guarantee can be given that such forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information and statements. The forward-looking information and forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake to update any forward-looking information and/or forward-looking statements that are contained or referenced herein, except in accordance with applicable securities laws. All subsequent written and oral forward-looking information and statements attributable to the Company or persons acting on its behalf is expressly qualified in its entirety by this notice. All financial amounts referenced herein are in Canadian dollars unless otherwise expressly identified.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/216058"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQX0F5bF9XaUUzWmxQWjBUT2dyV21VUUxlcUlvcm45b3dsYUUzb0VqcWYwdERLSUp3WGdmQ1gwTWhjeUVmM3U5RHlhcWtXcXl1VTRqZ0JNRksxLU1oWWFpQ1ZZZXhKSnB0TGNodkxNc0RramJoeXUwdXY4d29TZGNCTkhvQ0Y1bDVQc0dOX1d2b2p4eVhBMVFGRDNkT0x2LUxmUElIUU9MckQwQUtxQkc3WThaRkFfa0ZOTU90Y2lvSldtc0tJWTdCRkFnLUxYMy1NcW9KN1FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum's Bull Case: '$5,000+ In 2024, But It Won't Be A Straight Road,' Says Trader - Benzinga",
        "content": "Crypto trader and researcher Teng Yan predicts a bullish future for Ethereum ETH/USD, forecasting a value of over $5,000 in 2024.\n\nWhat Happened: In a Tuesday post on X, the trader anticipates the launch of spot Ethereum ETFs around July 15, which he believes could trigger a relief rally.\n\nYan also expects the initial spot ETF flows to surpass expectations over 12 months. He argues that traditional finance investors who have invested in the Bitcoin BTC/USD ETF will likely diversify by buying ETH as well, thus capturing a broader segment of the crypto market and reducing perceived single-asset risk.\n\nThe trader expects Ethereum prices to reach $5,000 or higher in 2024 and also there is a lot to be bullish about in the near-midterm. However, he cautions it will not be a \"straight road.\" He added, \"With the summer holidays, big capital may not be available to buy until August.\"\n\nAlso Read: Ethereum Traders Offload $41M In ETH, But ‘Bears Will Get Exhausted,’ Trader Asserts\n\nWhy It Matters: Yan’s bullish forecast comes at a time when Ethereum sentiment is at its lowest despite the imminent ETF launch. He believes that many sidelined investors and traders perceive the current market as a bear market inflection point. However, if prices start rising convincingly, these investors will likely buy back in.\n\nYan also points out the improving macro environment, with markets pricing in a 73% chance of a rate cut in September. He also mentions the possibility of Trump winning the election, which could result in a better regulatory outlook for crypto.\n\nThe trader also foresees a better regulatory outlook for crypto as Donald Trump holds a good chance of winning the election.\n\nWhat’s Next: The influence of Ethereum as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPYUZMMWs2MmpjdlFpY25XRnJBbUhnZjBrWjBUX1E4bmpMTnl2X3c4RE42Zkt4V2tIaUtxcXVtdkRDdnhjQ2JWMGVodzZiU1REdTBHWXFZQzZuRDQ1NVR2RUExT2had3hxVUp5eTAtckNHRnBLemhtdTVpZ3BwVkRRNE1sOUNxdUtIWFUtd1gzM0kwRVJNYm4xMVgzeXl3SERyYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CCO says Ethereum ETFs ‘close to finish line’, SEC open to other funds - CryptoSlate",
        "content": "Bitwise CCO Katherine Dowling said spot Ethereum ETFs are “close to the finish line” while noting that the SEC is “quite welcoming” about discussions regarding other products.\n\nOn July 9, Dowling told Bloomberg that the SEC and ETF issuers are addressing fewer issues in each S-1 amendment, pointing to a close launch.\n\nDowling affirmed SEC chair Gary Gensler’s assertion that the agency will fully approve issuers’ registration statements over the summer but described an open time frame. She said:\n\n“You know, everyone has a different definition of summer. It’s been a little bit of a long, hot summer for the issuers waiting ….”\n\nDowling said that Bitwise intends to set itself apart from other applicants, including giants such as BlackRock and Fidelity, as a “crypto specialist” with years of focus on the sector.\n\nBitwise filed its most recent amendment on July 3, while many other applicants filed on a July 8 deadline. Applicants must still add certain details, including sponsor’s fees, in future amendments.\n\nSEC welcoming to other discussions\n\nDowling also said that Bitwise has spoken to the SEC about potential new products “coming down the pipe.” She described the conversations positively, stating:\n\n“I think our communication with the SEC about the prospects for these products has actually been quite welcoming.”\n\nHowever, she agreed with Bloomberg ETF analyst Eric Balchunas that some products may only be approved under a new SEC chair.\n\nOtherwise, she said, it could take considerable time to bring the products to market due to the history of previous product approvals and the lack of future markets underlying the potential products.\n\nDowling did not identify the products in question. Currently, the only other pending spot crypto ETFs are VanEck and 21Shares’ spot Solana (SOL) ETFs.\n\nBitwise has not applied for a similar product as of press time.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQR19qalNKX1JUcXNmcE9JaDhEcHV1Qm5fZzVnck1PNGlYTHYyaUEwcmFoVmViOGpWblBxS05NcHZrZTZoMm5VdUM5Ty1abW14WF9hUEZGSENCalI4MFVWV1dLbjdSUkFfVlo4RDc4T1JMSExuZlFhRm8wdEZHakhWMFpmTEI3T2ZlUW1TSEN6YW9ITnVDY1JKekFRQVFsa09hT0cyWHB4VURyLVEybUdDckluQdIBuAFBVV95cUxPWjk4UjAwSG1UZVdMSFBUeGd1NU01dDlQOS1OWTJubjVMcGNYMmkxNWd4VThaMm1HTXJfQU5BYUNfdWFreG5uVkpfLXVaZWJEeEZUdXd3bThBQnY4OFNOQnVPUDVsWGVtNnE1Wm9STV9CUUtwS1BjYWM3c1lkTHlxSF94UEVPOFBDb2xVUl9JZXp0b0JFeXNzRC1LSmVkcTRVM1ZLOVVCem9WZjVuNFVMSEV5ZDRkV2hC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top Crypto Analyst Predicts Swift Ethereum Recovery, Says Big Run Coming for ETH - The Daily Hodl",
        "content": "A widely followed crypto strategist believes that the leading altcoin Ethereum (ETH) is close to carving a mid-cycle bottom.\n\nIn a new video update, pseudonymous analyst Bluntz tells his 264,400 followers on the social media platform X that Ethereum is about to conclude its ABC corrective wave.\n\nBluntz practices the Elliott Wave theory, which states that a consolidating asset tends to witness an ABC correction before igniting a fresh five-wave surge.\n\n“Looking at ETH/USD, we’re basically down here at the lows again, but I think it would be very odd if we just moved up from here…\n\nI think ultimately ETH needs to sweep $2,800, take out the low and reclaim it and then finally we would have what looks like a proper ABC down on Ethereum… [I think] we go sideways here on ETH for a little bit and take the lows and then look to bounce.”\n\nAccording to the analyst, Ethereum’s ABC correction will eventually resolve to the upside, sending ETH initially to a new all-time high of $6,000 before pulling back and rallying to a cycle top of $8,000.\n\n“I still firmly believe ETH has not had its big run yet and I do think it will definitely be coming this cycle. It’s just late.\n\nIt’s probably going to be induced by the ETH ETF narrative, which is supposedly coming out any day now. Everyone’s talking about it, everyone’s expecting it to be this giga-bullish ETH news. So I think what will most likely happen in my opinion is ETH will sell off first, take the lows, f**k everyone over and then start to get bid up heavily.”\n\nAt time of writing, Ethereum is worth $3,048.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4wWWxDQ1lud0JQeDNMQzhHT281alVPMUx0a0RxOGZUa0VqdDlISlI4SzNIRmJ3cjk3YXJMY3VVU2I1M29IMlBZYXdfQ2RINy1Qalp6YVFsS0pKUUo1SW43QmJrYnpKUThfUDczTWVxb1BVbGhDY2Ywbi1n0gF_QVVfeXFMTnNfVlY5YS1mVk94cU5NTFFoSlJpUHozNGdNWkYxY2FHYUs4T0tVTUI4V3pOTHFkYWtzVmF3VTl0MXBDc0JFUk5SS18tc0RuNEp4ZWx6YURPOVpvOFpGYktsaUZFWVlDZERXSjdlUmlvT1AzZ1NucDltZVVMUjVJMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "$34 Million in Ethereum (ETH) in 24 Hours, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) whales have started to make major moves amid the ongoing uncertainty on the market. Per the latest tweet from Whale Alert, 11,215 ETH were transferred from an unknown wallet to crypto exchange Coinbase earlier today.\n\nAdvertisement\n\nThis latest ETH transaction is estimated to be worth around $34.35 million. It is a major move as it appears that the whale has shifted ETH in order to trigger a sell-off. Moreover, the timing of this sell-off is crucial as it comes amid the recent market crash.\n\nThe broader crypto market has been consolidating after last week’s crash. The price of Ethereum, the leading altcoin, has crashed 16.68% over the last 30 days. This shows the intensity of this market dump, impacting major coins like Ethereum and Bitcoin (BTC) .\n\nWhile many are still expecting a price recovery from ETH, it appears that some traders are dumping their holdings. In the case of this Ethereum whale, they have almost $34.35 million in ETH. Since this is a major amount, it can further impact the market and push the ETH price to lower levels.\n\nAdvertisement\n\nWhales always play a crucial role on the digital asset market. The buying and selling from these traders leave short-term impacts on the price movements of a particular coin. In this case, the Ethereum price can absorb the toll of this sell-off. It may hinder the potential recovery of the coin after a recent downturn.\n\nETH price outlook\n\nAs of press time, Ethereum is trading around $3,072. While the price is up 0.52% in the last 24 hours, it has failed to recover from the previous losses. The recent bearish sentiment has not been good for bulls, causing uncertainty on the market."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNMWdWOTNkcDR1ZFV5X2lDZWZSdjJXcUpDWUlKemJmU0RXSklHa0w4SXp5QUxXeDNFenpXcm8tWHd5NXhOT0dlT2I2VWY4RDBuUkhZVTUzM2dYb2JRcHd3S1dIdGNRT2pfWUItRXVEZUh1QU5pUW9iQzNiemZyaDNVVlNSMlI4Wk54ZFU1RmFsS3NvNlMyX3dzcUgtN0JNZTdOLXh2cHdJONIBrAFBVV95cUxPQkFMYTU0ekV4bkF4ZndISHpPbWJ0ZkNZa3ZoakY5N3lWbzR3RTU2ZTUxN2E5S0NyamJSVlkzX0hwTFFGam12V3NQNmZRRnRoalhvN3BzVVZqc1lwbVM4TUQzSURLc1FnQ0ZCTjNQaERDZnd5NXV4TWtyOGd5dnRTN2x0dWJMT0xIU3B0NVczYkdSc21oVHJaSXVZTUNaZlNoaWtfb2RBVF94dmdM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "MEV Has Spread to Bitcoin, in Subtler Forms Than on Ethereum - CoinDesk",
        "content": "Three years ago, Bitcoin went through an update called Taproot , which made the network more expressive. This expressivity also accidentally made the Bitcoin equivalent of NFTs possible through Casey Rodarmor’s Ordinals protocol . This is what I mean by “trading bitcoin for other bitcoin”: “NFTs” can work on Bitcoin because the Ordinal protocol is able to see which satoshis (the smallest unit of bitcoin, a hundred millionth) are inscribed with arbitrary data which can be a picture or text or something else . These collectibles are called inscriptions so as to not be confused with NFTs (which are separate tokens). If you were buying an inscription, instead of buying an entirely new token as you would on Ethereum, you’re just buying some bitcoin that’s only special when seen through the lens of the Ordinals protocol."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE4zWURYZjBEZ2pCZGxoZHNVM0NrNENWaktUTU5fZklWRU1mU05iUmRjcHhvaGlKemFuaHNrdS1ULUFRQUE2TEZGdU1LVkI4cFJVSDlESG5MNzdIYzNtc1ZhRzdhZmxPTGZjN2fSAW9BVV95cUxPZENUZkxkTnc4OVZqVmdWOEJudEtBQW5YVFVrOWVGUWxPMkpWclJlcFBuR01uY3pPRzBVeFFEdnhqa3pHYWw4akhJalFVbXphemVJWGE5b1dvWXhyMS1EUnZ6c0tqVmQyNkZlMjBLbms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Will Ethereum ETFs Flop? Opinions Are Mixed - U.Today",
        "content": "The leading analysts and pundits are divided when it comes to predicting how Ethereum exchange-traded funds (ETFs) are going to perform following their much-anticipated launch.\n\nAdvertisement\n\nBloomberg’s James Seyffart recently spoke about this sentiment. The analyst says that half of his audience thinks that Ethereum ETFs attracting at least 20% of the assets recorded by Bitcoin ETFs would be considered to be very bearish. At the same time, the other half would view such inflows as super bullish. “No one knows anything,” the analyst summarized.\n\nFor instance, banking titan JPMorgan is convinced that they are going to attract only a small fraction of the inflows logged by Bitcoin ETFs. Its researchers estimated that its inflows could be as low as $1 billion this year. This, of course, would not bode well for Ether bulls given how dominant the ETF narrative has been over the last few months.\n\nAdvertisement\n\nMike Novogratz's Galaxy Digital is way more optimistic, predicting that these products could attract up to 50% of the net flows into Bitcoin ETFs in just five months. Cryptocurrency exchange Gemini has predicted that Ether ETFs could see up to $5 billion worth of inflows.\n\nIt is worth noting that the launch of Ethereum futures ETFs was a massive flop with \"shockingly low\" volumes. This is unlikely to be the case for spot ETFs due to the involvement of major names such as Blackrock and Fidelity, but it remains to be seen whether they will be able to hold a candle to their Bitcoin counterparts.\n\nAs reported by U.Today, the SEC is expected to complete the approval of several spot Ethereum ETFs this month after several potential issues submitted their S-1 forms earlier today."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQcFBETVhPM0xONWVpX1BXMDhYaldob3ZSdWRfUHE0dHNqY1VmTVI4VUllNFBNVUwwV290RVB1bklVQ2N0ajlLMFNhdTR3c1F4UXpOZENiTXo0dXJTdHlxYjhpRk9NNWJvd2s2WFdFcHFZc0phUTBsaHpaT3EzLTQxa3U3RDU2M0Z1QWw2UldZcEVzVU1oZXp4dXkyckxBbXEwNkt3ZFVsUUbSAa4BQVVfeXFMT0M4dGd3VVNUdHV3WXJxa0tkdnpzOURlQXRVVGtCWDBUZkdNaUVHa2pSLWh0WUVqd3RzMHdnUlU1Q3NXTHBob0JGNmh1V1MyNlIteEpwamJ2WU9jVmZIcXZNVDBHR2RfLXNleVNTaXFnNHNqWXFPVGxUTUY1ZHhDVU96NWNuQzFVTF9KM0N4dk51NEpkNlVuSllsWlpUbEY2YmNJaFpaUEREMXZXUjln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "How Staking Rate Benchmarks Can Build Digital Assets Markets - CoinDesk",
        "content": "The CESR benchmark offers a tool for operators to measure and enhance their performance within the Ethereum ecosystem. By leveraging CESR alongside operational metrics like Rated RAVER , operators can achieve greater transparency, trust, and efficiency. As the Ethereum network continues to evolve, these benchmarks will play an increasingly vital role in guiding and evaluating validator success. CESR will continue to be used by market participants, validators and financial institutions worldwide when engaging in products that reference Ethereum as the first bedrock financial rate of return for the Internet."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNRkpuSV9sRk5ubkUxQXFKN1VoSkNBS29yR29PeDFxakQwZDc2emhQNzUybno0dEVKNmJJbEJlLXI0SU56ODZaNjM3blc5YUFvZEZTRndWMlNERWZsRG5BNkJmOTRSU0o1LWl2X1VmbmJGVXFQQVY3LWd2NGE5cG9oRUNwMVJoQ03SAY8BQVVfeXFMT1pnU2h4STljTkVMVDA1OFk0UE1naHNIaVNtLWZiUUc4U0dsel9yMDRhRDYtaXpuV29QYWU1TFJCd3prUzZ5N3dTXzhBRHdhcU54WEV6MUp4QjVZZWdhUV9lRGk2M2JFa2lUQ0FDN1ZhOENMSUd4M08tRUdXRlhMNXVYR1JyTld5Zk5IUDFYRUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Telegram-Linked TON Will Connect to Ethereum Ecosystem via Layer-2 Network - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Open Network (TON), the blockchain that’s closely tied to popular messaging app Telegram, is getting its first layer-2 scaling network in a collaboration with Polygon Labs.\n\nThe TON Applications Chain (TAC) is being designed as a connection to the Ethereum ecosystem, utilizing Polygon's Chain Development Kit (CDK) and AggLayer interoperability protocol to enable Ethereum Virtual Machine (EVM) applications to function within the TON ecosystem.\n\nThe layer-2 chain, built on top of TON, is billed as an “official layer-2 coming in partnership with TOP (The Open Platform),” a TON representative confirmed to Decrypt. TOP built the Wallet Bot mini app for Telegram, and is working on other initiatives related to TON and Telegram.\n\n\"This collaboration enhances our ability to bridge the gap between TON and Ethereum ecosystems, delivering seamless decentralized app integration within Telegram and fueling unprecedented growth in user engagement,” said TAC CEO Pavel Altukhov, in a release.\n\nAD\n\nAD\n\nThe TAC layer-2 announcement comes amid a Telegram gaming boom that’s being fueled by crypto incentives, following the launch of Notcon and its NOT token on TON. A newer game, Hamster Kombat, has racked up over 200 million players in recent weeks ahead of its own token launch on TON, targeted for this month.\n\nTelegram itself has increasingly embraced TON in recent months, including by using it to pay channel operators a share of ad revenue. The scaling network is being billed as a way to bring more decentralized finance (DeFi) action to TON. Michael Egorov, founder of Curve Finance, is part of the founding team behind TAC.\n\n\"[The] collaboration of TAC and Polygon Labs is bringing the necessary EVM expertise to TON,” Egorov said in a press release. “With that, TAC can connect hundreds of millions of Telegram users with DeFi, possibly driving the next wave of DeFi adoption.”\n\nNo timeline for the layer-2 chain launch was announced. Decrypt reached out for clarification on that point, but did not receive an immediate response.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBlZGw1eDhyY2pYMzRQQUFYU3NJakFmY01ucGJDV1doOEZEUk1vUGp1MFM5OTlrc2JqVkw5eUZIVzNCdm1lejAycS0wVFJ4REI1YXVjM2hiYl8yMXI4UmdjS0hMWU9LU2JYSTBjYUNOS1p5eUcxSHROeS1yRGNiY2vSAYQBQVVfeXFMTnZwOHc3VlN4bWJQRUp6SlZaUmpyWXJwMS1ONjh0akpFd3dWNWdQLW01MHVfdmNBdV9tTGhNV3RaVjFYR0dqSjFaeUt5ZVltMkxkUEx1VHdZWFl4Z1B4LWxYQUdMS0JhRWtITGE2alBVYjQ5REtHZmdveTlLQjJhUEkyQWdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, has once again sparked speculations among crypto market participants. Meanwhile, all eyes are on the crypto amid soaring anticipation over a potential Ether ETF launch soon.\n\nHowever, ETH has recently reclaimed the $3K level, but on-chain data indicates that it faces significant resistance at $3,200. So, let’s take a closer look at why the $3.2K level poses a significant threat to Ethereum’s price.\n\nadvertisement\n\nEthereum Holders Ready To Sell ETH\n\nA recent Into The Block data revealed that approximately 2 million addresses that previously traded Ethereum at around the $3,200 price level are currently holding ETH at a loss. This paves the path for potential selloffs as these addresses break even with price gains ahead, adding selling pressure to the asset.\n\nHowever, a bullish catalyst in the pipeline might prevent this from happening. For context, the approaching launch of an ETH ETF (exchange-traded-product) could serve as a catalyst for a remarkable rising price action in the future. Aligning with this, the commencement of ETF trading could counteract the selling pressure, in turn generating positive momentum in the asset due to money inflow.\n\nHowever, it’s worth noting that Ethereum has continued to struggle to reach its resistance level of $3,200.\n\nAlso Read: Institutional FOMO On Spot Bitcoin ETF As German Govt Continues BTC Sell-off\n\nETH Price Faces Turbulency\n\nAt press time, the ETH price showed a 0.20% dip in value, trading at $3,100.56. The token’s 24-hour bottoms and peaks were $3,025.51 and $3,129.02, respectively.\n\nCoinglass data further validated ETH’s turbulent movement, spotlighting an uncertain investor sentiment in the market. ETH Futures OI jumped 0.51% to $12.67 billion, while its derivatives volume dipped 30.71% to $21.15 billion. Notably, the RSI was recorded to be hovering at 40, underscoring that the asset is neither overbought nor oversold.\n\nHowever, it’s crucial to note that the current market sentiments could take a paradigm shift ahead with the approval of spot Ethereum ETFs. CoinGape Media recently reported that a whale bagged a staggering 16K ETH in light of the looming ETF.\n\nAltogether, broader market sentiments remain optimistic about Ethereum’s future price movements, although traders and investors currently exercise caution due to the highly volatile nature of the crypto realm.\n\nAlso Read: Solana ETF Approval Stands Strong: VanEck Exec\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPT2Fjd2hxSGZxelpmMHRxakNWWC12Q1daSDdnX08yU2RrTUpFVjFJREFYcHRtYWpMSmt0bjZwU1FBcG9jcExYVWdJUURMamVIbnNkRmJvNkJ0VEQxWnB5cUR6enhDa1hla1NDNjRHdFdoV1pxd29qcUtWRjVtaEpMdVNR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Nears Launch As Issuers Submit Amended Filings - Yahoo Finance",
        "content": "Spot Ethereum ETF Nears Launch As Issuers Submit Amended Filings\n\nSeveral asset managers have submitted amended filings to the SEC for the spot Ethereum ETFs. VanEck submitted an amended registration statement for its spot Ethereum ETF, now rebranded as The VanEck Ethereum Trust. Following closely, 21Shares filed a new registration for its spot Ethereum ETFs. Grayscale also joined the fray with two amended filings: one for its $28 billion Grayscale Ethereum Trust and another for a more cost-effective \"mini\" ETF.\n\nThe wave of filings continued with Franklin Templeton, Fidelity, and BlackRock each submitting their own amended filings for spot Ethereum ETFs. Notably, none of the filings disclosed planned fees, a detail that Bloomberg ETF analyst Eric Balchunas noted the SEC has not yet required. Balchunas suggested that another round of updates including fees is expected before final approvals, predicting a potential approval date around July 18th.\n\nVanEck's amended registration statement saw some regulatory language regarding custody removed. This deleted section had previously described how Ethereum withdrawals would be processed through the entity designated to safeguard assets for the fund. These changes mirrored adjustments made by Bitwise the previous week, which included details on the SEC's stance regarding compliance in the crypto market.\n\nVanEck’s filing also highlighted Gensler's call for federal legislation focused on digital asset trading to prevent transactions, products, and platforms from \"falling between regulatory cracks.\" Similarly, 21Shares’ amended filing included disclosure language on the SEC’s regulatory efforts.\n\nDespite the SEC approving several key filings for spot Ethereum ETFs in May, the regulator still needs to approve S-1 forms from eight asset managers. Gensler has previously stated that the approval process hinges on asset managers' ability to provide full disclosures."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOeUNIQjJJODBQX3hjN1hyMzV3ZVdyUFphWURGZkhDUEVsclNCaVBZbHpHRERrZDZKQ0xkUkdJcGJPcTFqanVEWk9vM1c1dGtEMFVYX3lrY2JTR251YXMxc2VJYWJ3YlNTZVkyRk5TSEdBSEQ4QzVmbldpdC1HTmJJQkRuSFFWUWlURVk0N3gtaHpScHpUNjRoT1l1Unk5RXFqY2V3OHozaGhlcWl3b2R6ZFVNd2hmWVhBeUo5OUpWelhCOU9zOUFxQVRGV3d2Sm5iUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "The strengths and weaknesses of Ethereum according to Vitalik Buterin - The Cryptonomist",
        "content": "The co-founder and intellectual leader of Ethereum, Vitalik Buterin, recently shared his thoughts on the strengths and weaknesses of the blockchain during the EthCC (Ethereum Community Conference) held in Bruxelles.\n\nAddressing a packed room, Buterin offered an honest assessment of the current state of the platform, outlining both the challenges and opportunities that await Ethereum.\n\nThe strengths of Ethereum according to Vitalik Buterin\n\nButerin began his speech by highlighting the numerous strengths that have contributed to the success of Ethereum. One of the key aspects he pointed out is Ethereum’s ability to support complex smart contracts, which have enabled the creation of a vast ecosystem of decentralized applications (dApp). These applications range from decentralized financial services (DeFi) to non-fungible tokens (NFT), demonstrating the versatility and breadth of the Ethereum blockchain.\n\nFurthermore, Buterin spoke about the robust development of the Ethereum community. The platform is supported by a global community of developers, researchers, and enthusiasts who constantly contribute to the improvement and security of the network. This community not only develops new technologies and applications, but is also engaged in the governance of the network, ensuring that Ethereum remains a decentralized and democratic platform.\n\nAnother strength cited by Buterin is the transition to Ethereum 2.0, which represents a crucial shift from proof-of-work (PoW) to proof-of-stake (PoS). This change will not only significantly reduce the network’s energy consumption but also increase the scalability and security of the platform, making Ethereum more sustainable and capable of handling a larger number of transactions.\n\nThe weaknesses of Ethereum and the solutions\n\nDespite the numerous successes, Buterin has openly acknowledged the current weaknesses of Ethereum. One of the main problems is scalability. The Ethereum network has struggled to handle a high volume of transactions, resulting in high fees and long confirmation times. This problem has become particularly evident during periods of high demand, such as the bull of DeFi and NFTs.\n\nButerin also spoke about the challenges related to security. Despite the ongoing efforts to improve the security of the network, Ethereum remains vulnerable to various types of attacks, including smart contract exploits and network-level attacks. The complexity of the platform and the wide attack surface require constant vigilance and continuous innovations to maintain the security of the network.\n\nAnother area of weakness concerns usability. Buterin emphasized that, despite significant progress, the user experience on Ethereum remains complicated for non-experts. The setup of wallet, the management of private keys, and the interaction with dApps can be discouraging for new users, limiting the mainstream adoption of the technology.\n\nButerin concluded his speech by outlining strategies to “strengthen” Ethereum and overcome its weaknesses. The solution to scalability, he explained, lies in technologies such as shards and rollups. Shards will allow Ethereum to divide the workload among different parallel chains, significantly increasing the network’s capacity. Rollups, on the other hand, aggregate many transactions into a single one, reducing the amount of data that needs to be processed by the main network.\n\nRegarding security, Buterin emphasized the importance of continuous research and collaboration with security experts to develop new protection mechanisms. He also highlighted the importance of bug bounty programs and security audits to identify and fix vulnerabilities before they can be exploited.\n\nTo improve usability, Buterin has proposed a series of initiatives aimed at simplifying the user experience. These include the development of more intuitive interfaces, user education, and the implementation of safer and easier-to-use custody solutions.\n\nConclusion\n\nThe intervention of Vitalik Buterin at EthCC provided a clear and honest view of the current state of Ethereum, highlighting both its strengths and weaknesses. His reflection was a call to action for the Ethereum community, encouraging developers and users to collaborate to overcome challenges and continue to innovate. With the right strategies and a collective commitment, Ethereum is well positioned to strengthen its position as a leader in the world of blockchains and smart contracts."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNXk2Z0FVMjhhQ2tLQURnMThVdzNUUlZPa2pLdHBqZ0VfaHhIUWZjOTNpMVMwRzN3RkNSQ0tIaTI2NzIxOUtCNHJZcTlCWWRaSjZfa2RFQXEyR3ZycEduTXMtX19iQmF2TEQ5N1ZDQjk5T2VGdGl6TUpwZGtZbmVjRnVPV0VpQkZNMEJIbl95ODlRWEZCVjhuX1RB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "News regarding Ethereum (ETH) ETFs: towards a new bull run? - The Cryptonomist",
        "content": "News regarding the approval of Ethereum (ETH) ETFs, which could trigger a new bull run in the cryptocurrency market, with the United States SEC playing a crucial role.\n\nLet’s see all the details below.\n\nThe SEC at the center of the wait for spot ETFs on Ethereum (ETH): latest news\n\nAs anticipated, Ethereum ETFs are considered a possible spark for a new bull run, but the approval of the US SEC is crucial.\n\nThe regulatory authorities, traders, and investors are eagerly awaiting the presentations of the form S-1 for the spot Ethereum ETFs, which are expected to be available by the weekend.\n\nToday, the entities that have applied for ETH ETFs, including BlackRock, 21Shares, Fidelity and Grayscale, will submit the S-1 forms to the SEC after making the requested changes.\n\nThe first half of 2024 was dominated by the issue of Spot ETFs on Bitcoin. Now, the attention has shifted to ETFs on Ethereum.\n\nNate Geraci, co-founder of the ETF Institute, tweeted:\n\n“the amendments to the ETF S-1 of the spot ETF should be made tomorrow… How quickly will the SEC be able to reverse course?”\n\nGeraci emphasizes the importance of commissions, adding that the issuers might be ready to launch the products in the coming weeks.\n\nBitwise, an asset management company, has recently updated its S-1 registration with the SEC to list and trade shares of ETH ETFs.\n\nThe CIO of Bitwise, Matt Hougan, predicts that ETH ETFs will attract at least 15 billion dollars in net flows by 2025. Hougan, in particular, states the following:\n\n“Everyone wants to know how much the exchange-traded product (ETP) of ether spot will attract in terms of net flows. My answer: 15 billion dollars in the first 18 months. It is not a random guess. It is what the data suggests.”\n\nFocus on the price of Ethereum\n\nAt the moment, Ether has slightly recovered from last week’s drop, trading at around $3,042. The price has increased by 0.7% in the last 24 hours, but remains 12.2% lower compared to seven days ago.\n\nThe recent history of Bitcoin shows how the approval of the Spot BTC ETF led to a 58% surge in just a few months. On January 10, the day of the approval of the Spot ETF on BTC, the price of Bitcoin was $46,105, rising to $73,097 in March.\n\nThe approval of the Spot ETF on Ethereum could bring the markets back into the green. Based on historical data, the approval of a Spot ETF on ETH could push the price of Ethereum above $4500, assuming a 50% increase.\n\nIn any case, the 1-hour chart of ETH/USD showed a recent bullish trend that started at $2,803, highlighted by a significant bull candle that reached $3,096 before a slight retracement.\n\nA bullish engulfing pattern indicates a possible continuation of this trend, although the recent declines suggest a consolidation phase. The volume analysis reveals a peak during the bullish movement.\n\nHowever, the decreasing volume during the consolidation suggests that, if the volume were to increase again, the bull trend could resume.\n\nOn the 4-hour chart of ETH/USD, Ethereum has confirmed a downward trend recently bouncing from the low of $2,803. A strong increase on July 8 indicates a significant bull movement, potentially suggesting a short-term reversal.\n\nHowever, the recent candles with small bodies and reduced shadows also highlight a certain degree of uncertainty in the market. The volume analysis supports this bullish movement with higher volume, indicating a genuine buying interest.\n\nThe daily chart shows a clear downward trend in the last month, with ETH falling from around $3,889 to a low of $2,803.\n\nContradictory forecasts: analysts divided on the future of Ethereum ETFs\n\nWith the imminent launch of spot exchange-traded funds (ETF) on Ethereum, the financial community is divided on the possible consequences of this debut.\n\nIf the Bitcoin ETFs have led to a significant increase in the price of BTC, analysts are not sure that Ethereum will follow the same path.\n\nRyan Lee, chief analyst at Bitget Research, expressed skepticism regarding the impact of ETFs on Ethereum compared to those on Bitcoin, stating:\n\n“Bitcoin and Ethereum are two assets with different fundamentals and a distinct market appeal. When ETFs on Ethereum start trading, ETH will capture about 2.5% of its market capitalization. If this bull scenario were to materialize, the spot ETF on Ethereum could see $11.55 billion in assets under management.”\n\nOn the other hand, Galaxy Research predicts that inflows into Ethereum ETFs will be slower compared to those into Bitcoin.\n\nCharles Yu, vice president of research at Galaxy, has estimated that “Ethereum spot ETPs will see about 5 billion dollars in net inflows in the first five months of trading.”\n\nDespite the moderate expectations of some, other observers are very optimistic about the future of Ethereum post-launch of the ETFs. Steno Research predicts that ETH could reach at least $6,500 by the end of the year, thus surpassing the previous all-time high of ETH by 33%.\n\nStandard Chartered offers an even more bullish forecast. Specifically suggesting that the approval of spot ETFs on Ethereum could lead to up to 45 billion dollars of inflows within the first 12 months. Potentially pushing the price of ETH to $8,000 by the end of 2024.\n\nHowever, not everyone shares this optimism. Jupiter Zheng, partner of the Liquid Fund of HashKey Capital, predicts a short and modest initial rally followed by a strong “sell-the-news” event.\n\nEvent in which investors might sell their positions after the launch of the ETFs, leading to a price correction."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdm5RcjNUWlVHT3NPdHl5VnBMLUE0dDBmc1JXLXdnQ2VzaUN4dy05WVJseVlZeF9lSkNsbGliVUNScHdsMXUyZ08tUk5GOWhYSkc2Yk9tdzVMWE9ydHR6Tkt6aDItUllkMlpwWXhRT1NMaHR3ZlAxN0toWEJ1T2ZrcXU4bndBVHViZVI2OE1wbzY5Z2oyN2t3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Countdown to Launch: Spot Ethereum ETFs Could Debut This Friday - TipRanks",
        "content": "Spot Ethereum (ETH-USD) ETFs could be listed as soon as this Friday. With all eyes on the SEC, the anticipation is building for what could be a major milestone in cryptocurrency investment.\n\nThe Race to Approval\n\nThere’s a mad dash to get these spot Ethereum ETFs approved and listed. Last week, several issuers submitted their amended S-1 forms, a critical step in the process. Notably, these filings didn’t include fee information, which means there’s still some back-and-forth to be expected with the SEC.\n\nAccording to CoinDesk, Invesco and Galaxy have already set their fees at 0.25%, while VanEck was ahead of the curve by publishing their fee structure earlier. This indicates that progress is being made, but there’s still some fine-tuning needed before the final green light.\n\nTiming Is Everything\n\nUnlike the 19b-4 filings for spot Bitcoin ETFs approved in May, there’s no hard deadline for the SEC to make a final decision on the ether ETFs. This means we’re looking at a fluid timeline that could see approvals rolling in either by the end of this week or in the next few weeks.\n\nNate Geraci, president of the ETF Store, expressed his optimism on X, suggesting that the week of July 15 is a likely time frame for these listings. Geraci’s insights are backed by the recent flurry of activity and the SEC’s history of quick turnarounds once all requirements are met.\n\nOn the Edge of Approval\n\nIf the SEC provides feedback by the end of Tuesday, issuers could file their final amendments by Wednesday. Historically, the SEC has taken about two days to issue final approvals after receiving the necessary documents. This timeline aligns with the possibility of spot Ethereum ETFs starting to trade by Friday, provided everything goes smoothly.\n\nImpact on Price of Ethereum\n\nThe listing of spot Ether ETFs may have an impact on ETH’s price. As noted by Nate Geraci, the approval and subsequent trading of these ETFs will provide a more accessible and regulated way for investors to gain exposure to Ethereum. This increased demand could drive up the price of ETH. Historically, similar events with Bitcoin ETFs led to a surge in Bitcoin prices, and many analysts believe Ethereum will follow a similar trend. The anticipation alone has already sparked increased interest and activity in the market.\n\nAt the time of writing, Ethereum is sitting at $3,085.\n\nA New Era for Investors\n\nThe launch of spot ether ETFs will open the doors for more regulated investment in Ethereum, the second-largest cryptocurrency by market cap. This development is not just a win for institutional investors but also for the average investor looking for a safer way to gain exposure to Ethereum.\n\nSo, as we count down the days, it’s clear that the launch of spot ether ETFs is closer than ever. Whether it’s this Friday or a few weeks down the line, the crypto community is on the edge of its seat, ready for the next big leap.\n\nFor now, we wait and watch, as the SEC’s final decision could come any day. And when it does, the world of cryptocurrency investment will never be the same."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOdjRzRnYzMkoydEdxeDBVZ1kyY3RHbjdiQlBxTUljaERFeHBqUFRvZDU2cHp3SU5uVV9JcUdrMGNOTlIwZEc3eFlpdG9kMzZsb21WYWtmMzBSNkF1YXpSQXdlRGE2U0pVdUJRdExQNkRlTzEzZDkxU2pkMGd5OHoweVlLNEszN0RUai05cXI2Rk1xTE5pdHhUTnB3c040N3BPNDl2Mno3M0JKdEotVWd4S01HdEdVSzZFM2F1SFJ1WG9Id9IBxwFBVV95cUxPeVRkXzVPZ0l0VGkxaW5nLUdVeTN6Vkh5UWlHUXdjYjZpQlNEbVowdV9YbTdWLW1XQmNhQTUxNDZoeEcxWk1LZFJIMkpYZkZDMHlwa2pTbWtkQ0ZKVW9ENFJwRmg1QWZhQmM4NlZtQnRTcWZfSVJwcVZ3S0RJOG1XbG9xQ3RBS2JkUzBucGhvazJ6SVpRVk52U1NOVTJIcXRQeXFzOXljOHpFY01SY1lHdU92TWpiLXAzanFNYm54Tm9ELTd6N3lv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Key dynamics to watch ahead of launch of Ethereum ETFs - FXStreet",
        "content": "Ethereum ETFs close to finish line, says Bitwise executive.\n\nEthereum investors are buying the dip despite FUD from potential Golem selling spree.\n\nEthereum bearish pressure has slowed, but key resistance could prove critical ahead of ETH ETF launch.\n\nEthereum (ETH) is up 2.3% on Wednesday as investors continue buying the dip in hopes of a rally following the launch of spot ETH ETFs. However, other key metrics like break-even prices and Golem sales provide a deeper understanding of what to expect as the launch draws nearer.\n\nDaily digest market movers: Ethereum accumulation, Golem sales\n\nWith the potential launch of spot ETH ETFs drawing closer amid the wider market stagnancy, investors are readjusting their portfolios. Bitwise chief compliance officer Katherine Dowling confirmed that the launch is \"close to the finish line.\"\n\n\"We're seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC,\" said Dowling in a Bloomberg interview.\n\n\"So that points all signs in the direction that we are close. We're close to the finish line on the launch,\" she added.\n\nThe Securities & Exchange Commission (SEC) approved spot ETH ETF issuers' 19b-4 filings in May, but the agency needs to greenlight their S-1s before the products can begin trading.\n\nEthereum's recent descent saw more investors accumulating the altcoin, as revealed in CryptoQuant's data. These investors are considering the dip as an opportunity to purchase ETH at a discount before ETH ETFs launch in tandem. The lower ETH goes, the more investors buy.\n\nETH New Accumulating Adresses Balance\n\nSantiment data shows that some of these purchases have been flowing into staking platforms. The Ethereum 2.0 staking contract now holds 47.36 million ETH or about 34% of ETH's entire supply. Notably, the contract's holdings have more than tripled from just under 11% of ETH's supply it held in 2022.\n\nETH2 Beacon Deposit Contract\n\nMeanwhile, Golem, which raised 820,000 ETH through an ICO in 2016, has been on a potential selling spree. After transferring 40,000 ETH to address \"0x159a\", the address deposited 3,000 ETH worth $9.3 million to Binance, Bitfinex and Coinbase in the past few hours, according to Lookonchain. Golem has deposited about 32,000 ETH to exchanges in the past six days.\n\nETH technical analysis: Ethereum faces a key resistance at $3,200\n\nEthereum is trading around $3,130 on Wednesday, up 2.3% on the day. ETH's total liquidations in the past 24 hours are at $33.58 million, with long and short liquidations accounting for $23.18 million and $10.40 million, respectively, according to data from Coinglass.\n\nETH's long and short ratio shows traders are slowly reducing their bearish sentiment as the ratio has increased to 0.989. However, Ethereum's Fear and Greed Index is at number 30, indicating fear persists in the market despite increasing accumulation from whale addresses.\n\nInto The Block's data shows that more than 5.6 million addresses broke even after ETH reached $3,000, a potential sell sign for these addresses.\n\nIt could be that whales bullish on the ETH ETF approval accumulated selling pressure from retail traders who potentially sold off their tokens after ETH reclaimed the $3,000 psychological level.\n\nAs ETH's price slowly tilts toward the upside, it may face a resistance at the $3,200 level. According to IntoTheBlock, approximately 2 million addresses that purchased ETH around this level could sell if they break even. However, a price catalyst like the ETH ETF going live can prevent such a move.\n\nETH/USDT 4-hour chart\n\nOn the downside, the $2,800 to $2,852 level remains a key support if the bearish pressure increases.In the short term, ETH could bounce off the $3,064 level, where $3.32 million ETH longs risk liquidation."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQWnl0eHpiQ2tOSWJGSGJsV1cybmxLSHRsM3BuLS1xVEo5a2hTM0p0WkdBVGZIZkR4MWV3RnkxT25sZEFQaEpWdF9USE4zMXk3bHU3MU5tZFJoRjU3bEtOc3NPSWFScDI3SjJhOUZWeWlqZkN0R2NJVkVsT01uam1lMkNFTExTelhYTVJrQ0F5ZzhFMDl3S3NLeHp2cWZROE93QzFkbVkzZjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Rome Protocol secures $9 million to bring Solana capabilities to Ethereum Layer-2 - CryptoSlate",
        "content": "Rome Protocol has secured $9 million in a funding round to integrate modular services from the Solana network into Ethereum’s ecosystem.\n\nThe protocol stated that its funding round included several notable investors like Hack VC, Polygon Ventures, HashKey, Portal Ventures, Bankless Ventures, Robot VC, LBank, Anagram, TRGC and Perridon Ventures.\n\nThe round also included notable angel investors, such as Solana’s Anatoly Yakovenko and Austin Federa. Other investors included Nick White, Santiago Santos, Comfy Capital, and Jason Yanowitz.\n\nRome protocol\n\nAccording to the protocol, the platform would be designed to integrate Solana’s capabilities into services on Ethereum.\n\nThis approach will allow Ethereum-based rollups to use Solana as a shared sequencer, thereby confirming transactions faster, enhancing privacy and scalability, and reducing blockchain costs.\n\nRome Protocol pointed out that Ethereum’s isolated sequencer feature raises concerns about liquidity fragmentation, weakest link security, and interoperability on the network’s rollup-centric roadmap. Due to this, many rollups rely on centralized sequencers, which risk censorship, limited visibility, and critical downtime.\n\nTo solve these challenges, Rome Protocol will enable rollups to use Solana’s existing validators as shared sequencers for transactions, state maintenance, and transaction publication. This approach aims to turn Solana’s 50,000+ transactions-per-second (TPS) capacity into infrastructure for Ethereum rollups. It also ensures atomic composability with transactions confirmed on Solana before submission to Ethereum.\n\nRome Protocol will allow developers to focus on their applications rather than building new cross-chain interoperability infrastructure. Ethereum developers canuseg familiar technologies like OP Stack for execution and state maintenance.\n\nShared sequencer architecture\n\nThe proposed shared sequencer architecture includes the Rhea, Remus, Romulus, and Hercules features.\n\nRhea will ensure fair sequencing and submission to Solana, while Remus will enhance atomic transactions across rollups.\n\nAccording to the protocol:\n\n“Rhea enables fair and blind sequencing of rollup transactions. All transactions are treated equally and processed on a first-come, first-served basis. Remus enables atomic execution of cross-rollup transactions as a premium service.”\n\nRomulus will facilitate atomic transactions across Solana and various rollups, while Hercules will accept ordered transaction blocks from Solana.\n\nMentioned in this article"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQeWhhc1dGRzFkeE02ZEE5TlZtT0NUeDdYdkwtYTBkN3g2Z2QyTWxlTE8wNGpOeEJMUkRxS2dNYkNQQ1BUTUNhQmFxa2FFZ09XY1pqTU1GSlFBN0Q0VnkyY1puU2dHclpobUtNYkEyQWNlZnRuMlYxYmc0Uzg3a0N3Y2FfQkx3RjF4OHdJbDlZQjRDLV8zQjlEcEdRZURxMFVyOVVha0pQeVMtNnNPdFJNUEdpaG03MWFB0gG-AUFVX3lxTE8wcHdfeGVibjJrNmR1cG1qQ3NqQW1yZ2lLeEN3c3JzcTFDVFhNOGFOR2dnWi1BZWtQdUpVZnZxQV9iZTUwNHVWaWZxUU8tOWhvV3BiRjlRY05Ed3VqM3hZbmFXcEhHQXZTdExSNW5MOWstTVFYN044UDFkTjRKNU1WNWZCVGwyVzVFdDF6VEJWZHZIck5LcEduQWhoWkQ1bmxiZkNIeVNsN090MzloSjFOaEJrdHNhY0lHak9DT2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Blockchain Startup Rome Raises $9M to Serve Ethereum Layer-2s Through Solana - CoinDesk",
        "content": "A sequencer is the component of a layer-2 blockchain that batches up transactions and sends them to the base Ethereum blockchain to be settled, and some experts say these sequencers need to be decentralized to eliminate what can be single points of failure. A DA project is designed to store the reams of transactional data generated by Ethereum layer-2s, and to do so at a lower cost than what it takes to put the data onto the main Ethereum chain."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNalpZOVc2Nk9DaHFqcGthZE1CYVBDWU0zOG1pOUQ3OTMzUDFDNW1qWlJPOU9XeUc2OUZQWGtOWnppOWRRMzVOZ2ZkLWc4YU9teTJ1OHM0YnJlSTFhX2FzMF8zUXk2MGZ6WW5FUDVCeXZZbXlYelZkSmhhTTBHSzlVUtIBhgFBVV95cUxNalhoUDliUFZET1B0UEQzMGFTaDIyZTdMbEJ6Y25HTk5BNXlPd3A2N2ZjS0oxMnlBN21lRThBTTZrR0hVTFF3WGg4dGY4OTZkSDFNWVhnYXlFTUtRNEREVjdEYkVKRWM1allyeU1rOGJOeGVfdWxDY2s2bUZSREliZHdBNVZiUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Staking frenzy grips Ethereum: 33.9% of ETH now staked - AMBCrypto News",
        "content": "Interest in staking Ethereum surged significantly over the past few days.\n\nNetwork growth for ETH fell materially despite the surge in price.\n\nOver the last few days, Ethereum [ETH] has seen massive volatility in terms of price movement, which has impacted sentiment around the token significantly.\n\nInterest in Ethereum staking surged\n\nThe ETH2 Beacon Deposit Contract, the backbone for staking deposits in Ethereum 2.0, has reached a new peak, locking in a whopping 47.36 million ETH. This represents a significant chunk of the total supply, amounting to 33.9%.\n\nThe value is more than triple the amount staked just two years ago, which was only 10.9%. The surge in deposits indicates growing confidence in Ethereum 2.0 and its potential to revolutionize the Ethereum blockchain.\n\nWith a significant portion of ETH locked up in staking deposits, the circulating supply of ETH effectively decreases. This can lead to upward pressure on the price due to basic principles of supply and demand.\n\nMoreover, since staked ETH is locked up for a period of time, it’s less likely to be sold on the open market in the short term. This can help reduce downward pressure on the price, especially during periods of market volatility.\n\nDaily activity on the network fell\n\nHowever, despite the surge in ETH staking, the overall interest in the Ethereum ecosystem waned.\n\nAMBCrypto’s analysis of Santiment’s data revealed that the overall active addresses on the Ethereum network declined significantly over the past month.\n\nMoreover, this decline in activity coincided with the number of NFT trades occurring on the Ethereum network falling.\n\nThis suggests that despite the potential benefits of staking, fewer people are actively using the Ethereum network for other purposes.\n\nThis could be due to a number of factors, such as high gas fees, a lack of new applications, or a general bearish sentiment in the cryptocurrency market.\n\nAt press time, ETH was trading at $3,087.00 and its price had grown by 10.91% since the 10th of July. Despite the surge in price, the overall trend for ETH remained bearish.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, the network growth for ETH fell materially, indicating that new addresses were losing interest in ETH.\n\nCoupled with that, the velocity at which ETH was trading at had also fallen,, implying that the frequency at which ETH was being exchanged had declined."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPX09jaGxjOFJYTTVNd2xqaEg2WUtyMkEzbWZ6dWthc2dDSUZFdXkzbzlDSm5xRWcwTHdqcDFhLU5OeXJnXzIzaXZQanNFRk1hVi15eUlBdndBQW5lNHFhVjNMTTdubk1VVVJ3ZUFZWnoyOTVQMGFHMUtnUDlOWFhYSVh6Vnh1VFpjVVhZMUxHTXl5cHhsUTdNSdIBoAFBVV95cUxQRk9GUVFWcjFaUG50NVVqNG9vNHVVOWZ6RjhwWG03SGtIemdCQVpyU0lmLVl4bUxkZV9aajJQdWpJQW55Q1NJWDU0bW9aal9aY2wxTmVqeUtsRUw2Sjh3RmpRRDBCX1ppMFhMQXNwcHRzaTRzR2JobC1uZng3US0zVHhuVm5OQy1XNzV1czBVcjdCeDZ1T2ZoOENaVUtzMlRz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chairman Says Bitcoin and Ethereum Are Commodities—Case Closed? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto Twitter was quick to celebrate Wednesday following congressional testimony from Rostin Behman, in which the chairman of the Commodity Futures Trading Commission (CFTC) said a recent federal court ruling reaffirmed Bitcoin and Ethereum’s status as commodities.\n\nWhile the Securities and Exchange Commission’s (SEC) Chairman, Gary Gensler, has said that Bitcoin isn’t under his agency’s regulatory purview, a cloud of uncertainty still lingers around crypto’s second largest coin—despite the abrupt approval of spot Ethereum ETFs in May.\n\n“In its decision, the court reaffirmed that both Bitcoin and Ether are commodities under the Commodity Exchange Act (CEA),” Behman said, referring to a fraud case pursued by the CFTC in the U.S. District Court for the Northern District of Illinois against an unregistered entity.\n\nBTC and ETH are commodities. pic.twitter.com/HKzgkRaWkn — Dan (@DN_Founder) July 10, 2024\n\nAD\n\nAD\n\nDecided by Judge Mary M. Rowland, the case’s defendant argued that the CFTC’s statutory authority, when it comes to regulating commodities, “does not extend to any cryptocurrencies.” However, the judge ruled that Bitcoin and Ethereum are well within the CFTC’s regulatory scope based on the case’s similarity with other decided cases and language within the CEA.\n\nBut Rowland's decision, and Behman's citation, doesn't mean Ethereum's status is set.\n\nEven though other courts can take the decision into consideration, which was reached in trial court, Rowland’s ruling isn’t binding within the Northern District of Illinois—let alone the rest of the country—Anthony Tu-Sekine, a partner at Seward & Kissel, told Decrypt.\n\n“Anything that happens on the trial court level is not really binding on the other courts in that jurisdiction,” he said. “This is good news, not bad news, but it’s probably not that big.”\n\nAD\n\nAD\n\nCFTC officials first described Ethereum as a commodity in 2019, when then-chairman Heath Tarbert spoke at Yahoo Finance's All Market Summit. While the SEC has never claimed that Ethereum is a security, a since-dropped investigation into “Ethereum 2.0” raised questions.\n\nWhen it comes to the intersection of crypto and securities laws, judges within the same jurisdiction have issued conflicted rulings. For example, in the U.S. District Court for the Southern District of New York, Judge Analisa Torres found in the SEC’s case against Ripple that the sale of certain cryptocurrencies on secondary markets isn’t subject to securities laws.\n\n“There's another case in the Southern District where the judge actually disagreed with [Torres’] conclusion,” Tu-Sekine said, referring to a ruling in the SEC’s case against Terraform Labs.\n\nU.S. District Judge Jed Rakoff declined to extend Torres’ reasoning while letting the SEC’s case proceed last summer, citing the Howey Test, a framework outlined by the Supreme Court which is used to determine whether an asset is a security.\n\n\"Howey makes no such distinction between purchasers, and it makes good sense that it did not,\" Rakoff wrote. \"The court declines to draw a distinction between these coins based on their manner of sale.\"\n\nStill, the SEC implicitly signaled that Ethereum is a commodity when it approved applications for spot Ethereum ETFs in May, Tu-Sekine said.\n\nIf an investment vehicle invests in securities, there are certain regulatory forms that are required along with that, which isn’t the present case among asset managers currently jockeying for a spot Ethereum ETF, Tu-Sekine noted.\n\nStill, Behman’s comments Wednesday were hailed on Crypto Twitter as a major development, as influential accounts like Degen News blasted out tweets in all-caps.\n\nAD\n\nAD\n\n“What a time to be alive,” one user commented.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPV1JnX00zRE4yamxpQkQwcWctcHNTNDRVYk5KY0JGQVpRNDZwWXJPYWZxTUJSckV4ZlNiUHVWNmNsLU9aUkVuQm9pOWxkVUNmUnJzSFg2bUI1Nk8zZWN6ZEJFTm4tdDFkaFZ1VVpWTW10dkloZURqNm1MZ2JSdlpVX2pKOVB3UdIBiwFBVV95cUxNNGZhamU5TFd4Ulg0MjFfbjBRZ2JPVHN2bzd6dnVrWG5XSW1YaThlMUlwWHJxekhGelRQNWN1dkVaczBoU0dfZF9vVUR4b2dIR1VRMVF5Q2x4N09qT2ZNV2J3bVVYMFJWNXlCNnhNZkhQRGhQWVVwVDgwQjZySFk0Umo2bzVRMDEtWFVN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: How whales failed to reverse ETH’s bearish trend - AMBCrypto News",
        "content": "Most short-term traders experienced losses and would be eager to exit their positions in case of a price bounce.\n\nThe $2.8k level is likely to be revisited as support, but it is unclear if the bulls can hold on thereafter.\n\nThe Ethereum [ETH] flow from exchanges took a turn recently and strayed deep into negative territory in June, but this has not turned out the way investors were hoping it would. Instead of appreciating, the prices continued to drop.\n\nBearish sentiment was prevalent in the market, as seen by the price drop below $3k. This psychological level is likely to be contested hard, but the selling pressure behind ETH has been unforgiving.\n\nWhale accumulation did little to halt bearish trend\n\nIn June, the 7-day simple moving average of the exchange netflow dropped deep into the negative territory. It stayed negative till the 28th of June.\n\nIn the past ten days, it has crept into the positive territory, accompanying the sharp price drop seen in July.\n\nThe negative netflow indicated Ethereum tokens moving outside of exchanges and signaled accumulation. Despite this, the prices continued to slump.\n\nInvestors would be hoping that this is the final jolt of pain before the trend turns bullish.\n\nThe supply distribution analysis showed that the 10k-1M ETH holders have increased since mid-May. The 1k-10k ETH wallets moved higher toward the end of June but have fallen lower again over the past week.\n\nTogether it indicated the large whales with 10k+ ETH accumulated, but most other wallets have reduced their holdings.\n\nWhere can traders expect prices to find relief?\n\nAMBCrypto noted from the in/out of the money data that the $2850-$3000 zone was a strong support zone due to the number of holders.\n\nOver the past three days, the price decline to $2.8k saw a bounce to $3k but it is unclear if the buyers can withstand the sellers’ onslaught any longer.\n\nAround the current market price, 60.25% of the addresses were out of the money, which meant that price bounces would likely be sold as holders look to exit at break-even. This can add to the downward pressure.\n\nThe MobChart data outlined large limit orders on the order books for Ethereum. The $3100 and $3170 levels have $3.7 million worth of limit orders. Above them, the $3220-$3250 region and $3500 have just over $5 million, marking these as strong short-term resistances.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe $2800 level has just under $10 million worth of buy orders and might be tested once again. Overall, the metrics show that in the short term, bears were in control.\n\nThe exchange outflow in June did little to halt the price decline, and the best bulls can hope for now is a period of consolidation around the psychological $3k support."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQdWM2NDFJMlh6Y25lREltcy0yQzVWV0VJZ2wxVVpsaEZOeGRhYkZ2aW9Tb2VvZy1DWUhESVhDbVVtRndacVFMMTNqYlJBLWRkLUVqelRUdGdWQ2g4am5PWmVqUXZvRVNqYzcwMFZvNm53dXg3enB4bDlaS2VZUEFJcWVKd2oteVhJdWtqRDZWVDc3a25DMTdXenk5S3BneTJLZkdhbjNjaVBoVFhoVTExczhCUVpTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Prices and forecasts on crypto Bitcoin (BTC), Ethereum (ETH), and Binance Coin (BNB) - The Cryptonomist",
        "content": "For some time now, there have been three cryptos dominating the markets, Bitcoin, Ethereum, and BNB: today we will analyze some predictions of their prices.\n\nBitcoin is the first ever to be created and the one that alone capitalizes more than half of the entire crypto market.\n\nThe second is Ethereum, which is the main altcoin that is often followed by all the others.\n\nThe third is BNB, the cryptocurrency of the main crypto exchange in the world (Binance).\n\nPerformance of BTC: which crypto is performing better among Bitcoin, Ethereum, and BNB?\n\nThe trend of the price of Bitcoin underwent a significant change a few days ago.\n\nFrom February 28 to July 3, 2024, for more than four consecutive months, it had effectively moved sideways within a wide range between $57,000 and $72,000, with small and brief excursions a bit above and a bit below.\n\nInstead, starting from July 2, it began a descent that on July 4 led it to break down the bottom of that range.\n\nTo tell the truth, already on July 7th it had returned above $57,000, but on July 4th the medium-term trend seems to have changed.\n\nIt is not yet clear if the new trend is descending, or if it is just a lowering of the bottom of the lateralization range.\n\nThe latest predictions on the price of Bitcoin (BTC)\n\nThe analysts do not agree with the forecasts, but what happened between yesterday and today seems to have definitively ended the decline that began on July 2.\n\nFrom $63,000 back then to $53,500 on July 5th, the drop was 15%, but it has already been partially absorbed. The current situation seems to have returned to perfect normality, so that drop seems to have completely run its course.\n\nHaving said that, there are no certainties that another one cannot be triggered.\n\nThere are several analysts who expect further similar declines in the coming weeks, so much so that some are hypothesizing a bottom at $52,000, $51,000, or even below $50,000. There are also many other even more pessimistic forecasts circulating, but they generally do not come from expert analysts.\n\nIt should be noted, however, that there are also many analysts who instead hypothesize only the beginning of a new phase of lateralization, simply within a lower range, whose bottom would be between $51,000 and $53,000, while the top is not yet clear (it could also be above $60,000).\n\nMany, however, expect a change in trend in the autumn, perhaps already anticipated at the beginning of September or the end of August. Among those who expect this change in trend, optimism seems to prevail.\n\nPerformance of Ethereum: the crypto between Bitcoin and BNB\n\nThe trend of the price of Ethereum has been following that of Bitcoin quite closely since the end of May.\n\nThis thing, however, appears anomalous, given that precisely between this week, or at the latest next week, the spot Ethereum ETFs should land on the US stock exchanges for the first time.\n\nThe upward movement of ETH’s price at the end of May was due precisely to the news of the approval of these ETFs, but since then it has simply started to follow those of BTC.\n\nComparing the price of Ethereum with that of Bitcoin, one realizes that in May ETH had risen from 0.046 BTC to 0.057 BTC, but then it stabilized.\n\nIndeed, in mid-June it had also fallen below 0.052 BTC, and now it is around 0.053 BTC.\n\nAt this moment, despite the imminent arrival of ETFs, the price of Ethereum does not seem to have the strength to move independently compared to that of Bitcoin, at least in the short term.\n\nPredictions on the price of Ethereum (ETH)\n\nAfter the actual launch on the stock exchange of spot ETH ETFs, many believe that the price of Ethereum could fall.\n\nObserving the chart of the last few weeks, it indeed seems that the markets do not believe that these new financial derivatives can achieve a great result, at least in the immediate future.\n\nFurthermore, there is always the risk that the Grayscale Ethereum Trust, once transformed into an ETF, may start liquidating large amounts of ETH, just as happened with BTC in January.\n\nBut if in the medium-short term many are not optimistic about the price of Ethereum, in the medium-long term the expectations change.\n\nIn fact, should Bitcoin wake up in the autumn, the presence of ETF on ETH spot on the US exchanges could benefit the price of Ethereum quite a bit.\n\nJust think that after the arrival of the spot Bitcoin ETFs the price of BTC rose from about $45,000 to over $70,000, after initially dropping below $40,000.\n\nThe trend of BNB\n\nThe trend of the price of BNB follows that of Bitcoin, and of Ethereum, but it also follows the alternating fortunes of Binance.\n\nTo tell the truth, for years now Binance has been the largest crypto exchange in the world, and its dominance seems to be unchallenged, but last year it had several problems with the authorities, especially in the USA.\n\nTaking Ethereum as a reference, the price of BNB last year fell below 0.1 ETH, after being above 0.26 ETH at the end of 2022.\n\nIn March of this year, however, it started to recover, first climbing to 0.17 ETH and then even above 0.20 ETH. Now it has returned to 0.17 ETH.\n\nTaking instead as a reference the US dollar, a month ago it recorded its all-time high, at around 717$. It should be noted that Bitcoin also recorded its new all-time high this year, in March, while Ethereum did not.\n\nSo during the course of 2024 BNB has performed better than ETH, so much so that it is now at +64% since the beginning of the year. However, it should be remembered that in 2023 it had not performed well, while both ETH and BTC had already recorded really interesting gains.\n\nPredictions on BNB and the Binance ecosystem\n\nMaking predictions about the price of BNB is more difficult, because much depends on the alternating fortunes of Binance.\n\nAlthough today it is possible to state that in the event of a new bull run Binance seems destined to perform well, and consequently BNB, last year, for example, it was very difficult to predict that Binance would solve all its problems, as it eventually did, allowing the price of BNB to take off again.\n\nIn this case, in fact, in addition to the simple movements of the market, and the law of supply and demand, the economic results of Binance also matter, which are not easily predictable."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQQ3p4N0xHblhUVFVIdmZNZ2VKUmxjOU5lb1BTS3k0OGs5OFdZS2pKd2x2Xy1DNWd3b0J1cE8tRUl5Nm5WeUJtcFZVOVRUbEVlZTdSRHROcmRjMVBfZklVMjcwc3lja3BxRnM3SVphZkRWUFpRX0ljUGhfVXJGS2ZkMGl2bUc3V3BFQUx4TFBsaVZJQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "How High XRP Could Go if Ethereum Surpasses $50,000 - The Crypto Basic",
        "content": "This article explores the potential for XRP’s value surge if altcoin leader Ethereum reaches $50,000, as industry pundits anticipate.\n\nXRP and Ethereum have both lost significant percentages of their values in recent times as the crypto asset market battles with bearish forces. At a market value of $2,960, Ethereum currently sells at a month’s low.\n\nIn particular, ETH investors are nursing a loss of approximately 20% in the last 30 days. On the other hand, XRP is trading at a year’s low at $0.4245, though it reflects a 15% loss in the last 30 days.\n\n- Advertisement -\n\nWhile XRP and Ethereum currently exhibit underwhelming performances, the crypto community remains ambitious about their prospects. One such audacious view is the expectation of the altcoin market leader to be worth $50,000. With XRP closely following ETH on the ranking, The Crypto Basic assesses XRP’s potential value while Ethereum trades at $50K.\n\nXRP Potential Price When Ethereum Hits $50K\n\nAmong the believers in an Ethereum price point of $50K is U.S. investment firm VanEck. The billion-dollar asset manager made the proposition last year based on a detailed examination of the asset. VanEck expects this outlook to materialize by 2030, a timeline analysts at the Changelly exchange agree with.\n\nAt its current market value of $2,960, Ethereum needs to advance by 1,590% to attain the $50K threshold. While the altcoin leader boasts a market cap of $355 billion, the $50K price would elevate this valuation to over $6 trillion.\n\nMeanwhile, with XRP exchanging hands at $0.4245, the fourth largest altcoin could potentially be worth $7.1 should it perfectly replicate Ethereum’s 16X surge to $50K.\n\nThis figure aligns with the estimation of OpenAI’s ChatGPT when consulted. However, the AI chatbot issued a disclaimer that the $7.1 is merely a simplistic estimation, stressing that the actual values of XRP could vary based on multiple elements.\n\n- Advertisement -\n\nWhen Can XRP Attain $7.11?\n\nLike ETH, a $7.11 price point for XRP would mark an unprecedented history. At this point, XRP could wield a fully diluted market cap of $717 billion, a significant advancement from the current $42.45 billion.\n\nInterestingly, Changelly’s analysts believe XRP could achieve the $7 price region by 2030, coinciding with their projected timeline for Ethereum to hit $50K. However, ambitious voices in the XRP community believe $7 is a realistic target for this bull market.\n\nIt is worth noting that while XRP ranks closely with Ethereum, XRP’s recent performance pales compared to that of the altcoin leader. For instance, Ethereum was among the best-performing assets during the Q1 bull frenzy. In contrast, XRP underperformed 61% of the top 100 ranking crypto assets in Q1, which worsened to 77% based on the most recent data."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPcnA2UUVlTTVfSUJXdHZZU2hObnRoOHZLRk5xbXV1LU5GVDNwd2ZDRkhTQ0ZWM2NNWXgwMWF2Q1NFOERyXzMweUJBUk50emREY0t2bHJJQm5VTzd4OElIb1ozaWh5Q1FueXQ4M0IwWDUyVnhCZlVvaTNhLVFGNHNkaUh2U0xMWFdhN29STzQ4dWxhb0E2YVdVS3VsUFpnTy0wTkRmWnVrbTgzYmVzTGhsbDRZYlg4eTJYWEljY2lLanRSYXYxSTRudDJWcnZhMHpSRTFGcFRqVjBkMl9oM0UyZXhZWHNHSS1S?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Other Crypto-related Thefts Soar To $1.38B In First Half Of 2024, Almost Double Compared To Last Year: Report - Benzinga",
        "content": "In a recent revelation by blockchain research firm TRM Labs, cryptocurrency thefts have seen a drastic increase in the first half of 2024, amounting to a whopping $1.38 billion.\n\nWhat Happened: The volume of stolen cryptocurrency, such as Bitcoin, Ethereum (CRYPTO: Ether) and Dogecoin DOGE/USD, in the first half of 2024 has doubled in comparison to the same period in 2023, CNBC reported on Tuesday. The report by TRM Labs disclosed that hackers made away with $1.38 billion worth of crypto from Jan. 1 to June 24, marking a significant rise from the $657 million stolen during the same timeframe a year ago.\n\nThe five largest hacks accounted for 70% of the total amount stolen in the first half of 2024. The most substantial theft involved over $300 million worth of Bitcoin BTC/USD from the Japanese crypto exchange DMM Bitcoin.\n\nDespite the constant number of attacks, the report noted that the crypto ecosystem’s security hasn’t seen any significant changes that could have led to the increase in thefts. However, the firm pointed out that higher crypto prices in the first half of 2024 could have contributed to the increased value of stolen crypto.\n\nCrypto firms are advised to adopt a multi-layered defense strategy, including regular security audits and robust encryption, to combat hacks and exploits. TRM Labs also recommended educating employees and implementing a comprehensive incident response strategy.\n\nSee Also: Peter Schiff Says Bitcoin ETF Buyers ‘HODLing’ Amid King Crypto’s Plunge But Warns ‘Much Larger Drop …May Come As Soon As Next Week’\n\nWhy It Matters: Earlier this year, phishers stole $47 million in crypto, primarily through fake accounts on Elon Musk‘s social media platform X. The victims were primarily lured to phishing websites through comments made by impersonator accounts on X.\n\nIn May, the popular Web3 game Gala Games was hacked, resulting in a loss of $214 million. The hacker exploited a loophole on the platform and minted 5 billion GALA tokens, which were worth $214 million at the time of the exploit.\n\nThe theft of Bitcoin mining machines has also been making headlines in July. Jameson Lopp, a Bitcoin advocate, highlighted two significant busts involving the theft of Bitcoin mining equipment, questioning the robbers’ objectives.\n\nRead Next:\n\nImage via Shutterstock"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPb2hRNVA3b3BiSEtoUTNtaXZoTkpJd2NZdkVaMW1GQ1d2c2Z6LWZ2WXE1VmZwOVlORnlJMnBNVnNOck5rdGdMcG12YTRGRk01NElkbEp5cjV0d29heTlqTzlFeFJSN0ltZnpLLXUwZDR1TDBuN0NQU2hodE5lN1NYUERBM3A2b0xORzRlcVRmRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Says SEC is Open to Solana ETF After Ethereum Launch - Watcher Guru",
        "content": "Cryptocurrency asset management firm Bitwise has recently said that the US Securities and Exchange Commission (SEC) is open to a Spot Solana ETF after the previously approved Ethereum iteration launches. Indeed, the ETH investment product is expected to begin trading in the next week.\n\nSpeaking to Bloomberg, the firm’s CCO Katherine Downing noted that the agency appears “quite welcoming” to the idea of other crypto-based ETFs. Additionally, Downing said that the Ether ETF is “close to the finish line.” Many issuers have already filed the amended S-1 forms this week.\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks\n\nSolana ETF in the Works After ETH Debuts?\n\nBitwise’s Downing discussed the potential for investment products like a Solana ETF amid the ongoing Ethereum process in the recent interview. She noted that issuers have “dialogue with the SEC about the possibility of what’s coming down the pike with new products.”\n\nHowever, Downing did note that those products “may have to wait on a new SEC chair,” if Gary Gensler is removed in January of this year. She maintained that he could get in the way. Specifically, Downing noted Gensler’s involvement creates a “long haul” to get products to market. Especially given his history with the industry.\n\nAlso Read: Solana Mirroring 2021 Bull Run Pattern: New All-Time High Soon?\n\nStill, Downign described the agency’s response to talk regarding more products as “quite welcoming.” That certainly increases the odds of a Solana-based ETF. Applications for such an investment product have already been filed by asset managers like VanEck.\n\nEarlier this month, GSR Markets released a report on the potential product. There, they noted SOL has “cemented itself as part of Crypto’s Big Three.” Therefore, it is only natural it follows ETH and BTC with the next crypto-based ETF. Yet, the question now is when. With two approvals in 2024 already, many expect a Solana ETF to not be viable until 2025."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUHF0M0dLamwySHMzMFdBZ0kxTUY3SkFlVS1BQl9VSVM4WU9PMDI1SndXVkU3LUhPNzlRd29KYzI4UmFCWmt1dnBIMkFrem82Z0pCamZLSW5kOGNEeklQOWxLMHV0U0U4MGtOOElsVlRyQjBZb3lJbVFlcGxHWjFEUUJtb3NJODIxeVlrZVQ2STNIbEtWVmpZdDhn0gGfAUFVX3lxTE54UFR3YTBfb3I2UHNzbjB5OExiY2JhZmlJbFFFbzFGOV9BM1BGN1RNcVlXTGlWa1lPS3dVTE1RZWRjNG1uMHlZMFpGTTExWlpRYjBCR29tYkdjaFJIbE16WnFXVEdDRVYxc01uRWkzU3VZcDJSN2cyemlCdUlCR0dXUGlKX2dDV2VuZ3Jjb3ZTWWNsREhQeVI3WThNQkJ1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Dwindling Open Interest Hints Sluggish Climb To $4,000 - CoinGape",
        "content": "Since last weekend, the cryptocurrency market has showcased a sluggish trend with most of the major assets wavering sideways. However, the second-largest crypto by market cap Ethereum has maintained a better position amid the development in Spot ETH ETFs. After the recent market correction, the Ether price has established firm support at $2815, providing buyers with an opportunity for a counter-attack. But will the current market dynamic support this rally?\n\nAlso Read: Ethereum Price Analysis Warns $2500 Breakdown As Bearish Pattern Emerges\n\nadvertisement\n\nEthereum Price Forecast: Can ETF Speculation Drive Prices Higher?\n\nThe Ethereum price has been under an active correction trend since May end. From the peak of $3974, the altcoin tumbled 29.27% before finding suitable support at $2815. The horizontal level coincides closely with the 23.6% Fibonacci retracement and 50W EMA creates a strong accumulation area for investors.\n\nA bullish upswing this week has uplifted the asset 10.3% to trade at $3116, while the market cap jumped to $373.9 Billion. This recovery likely followed the recent update to the S-1 registration statement by ETF issuers of Ethereum, along with market speculation that this instrument will start trading by mid-July.\n\nHowever, until final approval is secured, Ethereum may struggle to gain sufficient recovery momentum.\n\nAlso Read: Crypto Prices Today July 10: BTC Touches $59K Amid ETF Inflows, ETH Holds Above $3K\n\nMoreover, the Ether coin experienced a significant drop in Open Interest during the early July sell-off. According to data from Coinglass, Ethereum’s Open Interest fell from $14.98 billion to a low of $11.97 billion, marking a 20% decrease.\n\nThis substantial reduction in OI suggests a decline in traders’ commitment or market liquidity for ETH, potentially indicating decreased confidence or interest from investors.\n\nIf the market supply pressure persists, the ETH price could rechallenge the $2815 support. The horizontal level, which also serves as the neckline of a double top pattern, could intensify selling pressure and potentially lead to a drop toward $2000.\n\nOn a contrary note, if the ETF excitement pushes the Ethereum price above $3325 resistance, the sellers will start losing grip over this asset. A potential breakout from the downsloping resistance trendline will signal major market change and bolster crypto buyers to chase $4000.\n\nTechnical Indicator\n\nEMAs: The 50D and 100D Exponential Moving Average wavering around $3325 increases the resistance power for this level\n\nADX: The Average Directional Index slope rising to 37% indicates that the downward momentum remains strong, showing no signs of weakening.\n\nFrequently Asked Questions (FAQs) 1. What does Open Interest mean? Open Interest refers to the total number of outstanding derivative contracts, such as futures or options, that have not been settled. 2. What is the S-1 registration statement? The S-1 registration statement is a filing required by the U.S. Securities and Exchange Commission (SEC) for companies planning to go public, including ETFs (Exchange-Traded Funds). It provides detailed information about the ETF's business operations, financial condition, and risk factors. 3. What is a Double Top Pattern ? A Double Top Pattern is a bearish technical analysis pattern that occurs when the price of an asset hits a high, retraces, rises again to a similar high, and then declines.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxONm1BelJHamUzLVRWZFlaVmFJLUVBTmNETTkxNnIyb2FWVFdVR3Z1amRncF9hN2FTdEVYeWNKb1BZZnN2b01SRFpHQ0s3RkU1YlBPdGxWV0dZZ2pjcEx4bVpOckhpaUFGcXFhSnJFb3JZbjA5ZG5SZFlxUXFxbTZOMVhRWjIxUnPSAYwBQVVfeXFMT0k1S1E5TkMxd1VVZnczWENibU5WcnBKODRpakg2RUtRN2pSdnFTaGR6cEpfSndVTHcxZlgwMnNHR2xKcTRxVzFwN0NGclp0Q1FuaDlSRGZ6aWpua2ZkdUlIdnR4X3NGOHQ2NEpBRGZxMkU1UmpmMk93cVE0aHR2aDJlNnVYSEw4MkEwak0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis Warns $2500 Breakdown As Bearish Pattern Emerges - CoinGape",
        "content": "The second-largest cryptocurrency Ethereum initiated July’s second week on a bullish note. Following the recent market sell-off, the ETH price found suitable support at $2815— a multi-month horizontal level intact in February 2024. This support coincides closely with the 23.6% Fibonacci retracement creating a pivotal point for Ether to rebound or lead further correction. Will the developments in ETF approval help this asset regain bullish momentum?\n\nAlso Read: ETH/BTC Price Prediction: Is Ethereum Price Reversing or Is It a Bull Trap?\n\nadvertisement\n\nEthereum Price Analysis: Key Levels to Watch as ETF Approvals Loom\n\nThe first of July contributed significantly to the ongoing correction in Ethereum as its price fell from $3516 high to $2815 registering a loss of 20%. The aforementioned level aligned closely with 50W EMA and 23.6% FIB creating a high area of interest for buyers.\n\nIn the last 48 hours, the Ether price jumped 8.76% to trade at $3071, while the market cap jumped to $370.2 Billion. Amid the broader market consolidation, the upswing can be attributed to the development of ETH ETF approval.\n\nAlso Read: Crypto Prices Today July 9: BTC Bounces Near $57K Propelling Crypto Market Rally\n\nFirst S-1 just rolled in today from VanEck.. they already had their fee so nothing to see here really, they just putting ball back in SEC’s court. Expecting the rest today except for Bitwise who did theirs last week. pic.twitter.com/gF6OZTKIrs — Eric Balchunas (@EricBalchunas) July 8, 2024\n\nVanEck recently updated its S-1 registration statement for its forthcoming spot Ethereum ETF, introducing only minor revisions concerning the custodial aspects of the fund. The filing occurred early on Monday, positioning.\n\nNotably, firms like 21Shares, BlackRock, Fidelity, Franklin Templeton, and Grayscale also submitted their filings later that same day. This collective movement among investment heavyweights suggests a growing institutional interest in cryptocurrency-based ETFs.\n\nMarket participants anticipate that trading for these Ethereum ETFs might commence in the second half of July.\n\nIf approved, the ETH price could sustain its recent reversal and rise 25% to downsloping resistance trendline around $3800.\n\nA bullish breakout from the overhead is crucial for ETH buyers to signal uptrend continuation.\n\nOn a contrary note, the Ethereum price shows a double top formation in the daily chart. This reversal pattern keeps the possibility for extended correction intact. A potential breakdown from the $2815 will intensify the pressure and could plunge $2000.\n\nTechnical Indicator\n\nEMAs: The crypto buyers could get a better confirmation of a bullish reversal if the price reclaimed immediate resistance of 200D Exponential Moving Average at $3080. The ETH coin current below indicates a net bearish sentiment.\n\nRSI: The Relative Strength Index (RSI) reverted from the oversold region indicating the overextended selling has brought some cool-off in price for selling to regain strength.\n\nFrequently Asked Questions (FAQs) 1. What is an ETH ETF (Ethereum Exchange-Traded Fund)? An ETH ETF is a financial product that tracks the price of Ethereum and trades on traditional stock exchanges. 2. What is the 50W EMA? The 50-Week Exponential Moving Average (50W EMA) is a technical indicator that averages the closing prices of an asset over the past 50 weeks, giving more weight to recent prices. 3. What is a double top formation in technical analysis? A double top formation is a bearish reversal chart pattern that indicates the potential end of a uptrend and the start of an downtrend.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQOHRJUjJIeC1YLTNmOWQ3NlZwUThPQ0NjSmdTMk1pY0tlN202Vmk5Zmw0VjhIVkZtejAtQXM2eDNudFQwVV90STV0VzBkZHdZenBOZ2tWbWN1d2phRXlkYzNzbENLUkFuRzlTZTkxd3dsVDRTUEhXcldFMHd3dG41N19EWU9ENW1EdDE3WHBtcG1MU3pBaDlKd2kzSdIBoAFBVV95cUxNZHNxdVJndXV1WnE5WEQtRDJ5X0w1cHUyMFpSQi16emlTRkxlb05kdmx0MkpCbWZURFVvZW81cEhlaTBmd2dIY20zRXI1bUU1SFFza3lKOFJxeDBmRzFFQUsxdXJJQjhlMWdCTkNiOF9HMG9LQnlTMWhiOVU4Um9ISWdaU01rZm1rUUpMQjNqbmZiSlhVMVZoZHpfa3NuX3Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Launch Anticipated on July 18, Bloomberg ETF Analyst - CryptoPotato",
        "content": "Bloomberg ETF analyst Eric Balchunas predicted on X that July 18 would be the “best guess” for the spot Ethereum ETF launch.\n\nThis comes after the Securities Exchange Commission (SEC) issued S-1 amendments, which required companies to amend their registration statements and submit their applications.\n\nBalchunas Notes Minimal Changes in Latest Filing\n\nIn the latest series of amendments filed by asset managers regarding spot Ethereum ETFs, Eric Balchunas described the changes as minimal, noting that there was “nothing to see here” in two of the earliest filings.\n\nBecause the SEC asked for the S-1s on July 8th but told issuers the fee wasn’t nec yet. They will give guidance back to issuers soon along with the game plan. Then the docs come will come back with fees (and every other blank) filled it and then it’s Go time. https://t.co/S4u8HaMckh — Eric Balchunas (@EricBalchunas) July 8, 2024\n\nThe recent S-1 and S-3 amendments pertain to asset managers’ ability to issue ETFs. This differs from the 19b-4 filings that permit exchanges to list and trade these funds upon launch.\n\nOn Monday, VanEck initiated the wave of amendments by submitting an updated registration statement for its spot Ethereum ETF, renaming the product as The VanEck Ethereum Trust. This was promptly followed by 21Shares, which also filed a new registration for its spot Ethereum ETFs.\n\nGrayscale joined the trend with two amended filings: one for its substantial $28 billion Grayscale Ethereum Trust and another for a more cost-effective “mini” version of the trust. Franklin Templeton, Fidelity, and BlackRock also filed amended registration statements for their respective spot Ethereum ETFs.\n\nDespite these updates, none of the filings on Monday disclosed the planned fees for the ETFs. Balchunas mentioned that the SEC had yet to mandate this information, suggesting that a final round of updates, including fee details, would precede the launch, after which “it’s go time.”\n\nCompanies Update ETH ETF Filings\n\nRecent amendments have brought some minor changes. VanEck’s registration statement saw the removal of specific regulatory language regarding custody, particularly a section that described how Ethereum withdrawals would be managed through the fund’s chosen custodian.\n\nIn addition, other minor changes align with those made by Bitwise the previous week, reflecting the SEC’s stance on compliance within the crypto market. These sections emphasize SEC Chair Gary Gensler’s concern about inadequate protection for investors using crypto exchanges and highlight the potential implications for securities laws.\n\nSimilarly, 21Shares included disclosure language in its amended registration statement regarding the SEC’s regulatory efforts and other minor details.\n\nGrayscale’s updated filing for its “mini” Ethereum ETF introduced a new section clarifying that none of the Ethereum in the product will be staked. This refers to the process where Ethereum tokens are delegated to the network in exchange for rewards.\n\nNotably, none of the applications before the SEC include plans for Ethereum staking, and some applicants have preemptively removed related language from their proposals."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPMHVoeGNKSmhuck1FV3Z2U2YtZG9TeDFRbjlHZDlFR0ZObEczVExXUWdkZlhDNk9PUXZVS0Mzd1pjR0JDXzRQN1BqQ0V6cGE2TnFja3BFcDhBaDNjYTBoX29vVlFfbXhLNHpYZUdfRmdLZkgwdXZpNGlMOXhVM0lKWENFamxIYTVoMU0zZTdQVjBfVExTbHZ30gGcAUFVX3lxTFBveU5WZ0NUbmdWZFNwSkJIbnVTMlhyYThMcmVfOHNRWWl1bTRKcmpSVjFpZFhlbDlQaS0xZFNyeHN6TmI5TlFvZ2xzUG5HcWNoMGFyOWpzVEtmWlNrbXJtWTRRYzZWMVBpYjZWNFpIWGtEZXJqSEZqdjBRXzY5ZlhmaEhPTW1FUlFSRm1XcWNKcTBoSWduTWVzakxSRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum finally breaks above $3K: How ETH was able to regain its highs - AMBCrypto News",
        "content": "Ethereum has finally caught a breather in the last 48 hours.\n\nThe price held steady above the $3,000 price range.\n\nEthereum [ETH] maintained a stable trading range in the $3,500 zone until it encountered significant declines that substantially reduced its price.\n\nDespite this downturn, the flow of Ethereum across exchanges has been mixed, reflecting varied sentiments among traders.\n\nEthereum recovers from declines\n\nAMBCrypto’s analysis of Ethereum on a daily time frame revealed a volatile start to the month. On the 1st of July, ETH was trading at approximately $3,430.\n\nThe following day, it experienced a slight decline but stayed within the $3,400 range.\n\nHowever, the subsequent days brought more pronounced decreases, and by 5th July, Ethereum’s price had dropped to around $2,980.\n\nETH experienced more fluctuations after that, oscillating between gains and losses. By the 8th of July, there was a noticeable recovery with a nearly 3% increase, bringing its price to about $3,018.\n\nAs of this writing, it was trading with an increase of over 2% at approximately $3,083.\n\nAdditionally, the Relative Strength Index (RSI) also showed a slight increase in tandem with the price.\n\nDespite this improvement, the RSI sat below the neutral 50 mark at press time, specifically around 40, indicating that while the market sentiment is recovering, it still remained bearish territory.\n\nEthereum’s stable sentiments\n\nThe analysis of Ethereum’s exchange netflow from CryptoQuant revealed a fluctuating pattern between inflows and outflows, indicative of mixed trader sentiment.\n\nOver the past two days, the netflow has been positive, meaning that more Ethereum has been deposited into exchanges than withdrawn. This suggests that traders are likely preparing to sell or trade, anticipating either taking profits or mitigating losses.\n\nConversely, in the days leading up to this, the netflow was negative, indicating that withdrawals of Ethereum from exchanges were more prevalent than deposits.\n\nThis trend is typically associated with traders moving their holdings to private wallets for long-term holding or reducing exposure to exchange-related risks.\n\nThe fact that there hasn’t been a significant skew towards either heavy inflows or outflows suggests that traders’ sentiment has remained relatively unchanged, and normal market dynamics continue.\n\nVolume confirms buyers’ dominance\n\nThe analysis of Ethereum’s trading volume over the past 48 hours indicates a noticeable increase, suggesting a revival in market activity.\n\nAccording to data from Santiment, there was a brief dip in trading volume to around $10 billion on the 7th of July.\n\nRealistic or not, here’s ETH market cap in BTC’s terms\n\nHowever, this decline was short-lived, and by the 8th of July, the trading volume had surged to over $21 billion. As of this writing, the volume remained high at over $19 billion.\n\nThis increase in trading volume, particularly with the current price trend, implies that buying activity has been more dominant than selling."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOLVVIb3BaVEdJdTZKNTdCLUhsYlZxYXItakNRbGlsSGJQVXpHaW8tdXA0LXZSSHR5SnJ5TWY3RDFvR1pMRTl6SlVZWkE3MXYxZjJCY01hb0lVN29pQlhTS2F0YU5MZGIwSU5iWTNFTGJ3WXpadFdyZ1dsT3JaZnRJdVVqa9IBiAFBVV95cUxQR2NQdzJ6c0tYTFdldkJmekFSOHp5TjFyRjNJSjZRZ2ZPOWNNblowUnJlWFBGVllEdTF1eXZLMnhKcm1NY1NOUk8wNHJPSHd1cFlqSWhPUjFZVU9pN1p6Q0pFQmZXSmlyeEs5VWtqWTFDd1pNWDFrNExjcWV0UXJKZmg5eVE5VmFq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin v. Ethereum: Why BTC is Dominating the Battle - CryptoPotato",
        "content": "The 2023-24 crypto cycle has witnessed a deviation from historical norms in the ETH/BTC ratio. The ratio, in question, is a key indicator of capital rotation and risk appetite in the market.\n\nDespite the beginning of a bull market in late 2022, the ratio has unexpectedly continued to decline. Experts suggest that there are two factors at play with regard to this relative underperformance.\n\nUnexpected ETH/BTC Ratio\n\nAccording to the latest joint report by Glassnode and CME Group, the approval of spot Bitcoin ETFs in the US in January 2024 is the first factor that significantly boosted buy-side pressure for the leading crypto.\n\nSecondly, the intense competition among Proof-of-Stake (PoS) blockchains has been challenging Ethereum’s dominance in areas such as liquidity, capital attraction, user experience, and, most importantly, scalability.\n\n“Historically, the largest asset, Bitcoin, tends to lead the market during bear markets and early bull markets but lags during the more speculative phases of late-stage bulls. The ETH/BTC ratio is a tool many analysts consult as a gauge for the degree of capital rotation taking place, which is based on Ethereum serving as a bellwether asset for general risk appetite. However, an interesting shift from the cyclical norms has occurred during the 2023-24 cycle.”\n\nHowever, experts from Glassnode and CME Group expect this landscape to evolve as the introduction of spot Ether ETFs in the country could potentially catalyze a reversal of this downtrend.\n\nInvestors are eagerly waiting to spot Ethereum ETFs. This week, several prominent asset managers, VanEck, Grayscale, Fidelity, BlackRock, 21Shares, Franklin Templeton, and Bitwise, have submitted their revised spot ETH ETF S-1 registration statements with the US Securities and Exchange Commission (SEC).\n\nThe regulator set July 8 as the deadline for issuers to submit their amended drafts. Industry experts are optimistic that the securities watchdog could approve the drafts within the next two weeks as issuers have already completed a significant portion of the necessary preparations.\n\nIt’s worth noting that while the SEC approved issuers’ spot ETH ETF 19b-4 applications on May 23, they also need to greenlight their S-1s before trading can begin.\n\nEthereum On-Chain Metrics\n\nAmidst improved sentiment, Ethereum has managed to retain its position above the $3,000 level.\n\nMoreover, the latest data suggest that the altcoin is currently near a potential bottom, as evidenced by the Ethereum Realized Cap, which currently stands at $240 billion. With the market cap close to or below the realized cap, many holders are at a loss. Historically, this indicates a late-stage bear market, implying that Ethereum’s price might be poised for a bullish reversal.\n\nMeanwhile, Ethereum’s current Market Value to Realized Value (MVRV) ratio is showing signs of improving profitability and is in the recovery and bull market phase. The MVRV ratio has been steadily increasing since mid-2023, which was depicted as the late stage of a bear market, and is now above 1.0, indicating that the average Ethereum investor is holding unrealized profits."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPbXYwbGxrOFVqdEVTWVkxSXBaeW9WNWFvR09ZbkZGRkVPaFVqQnZSUjA4V2NrdjhvRGg1MWlxNm5IX0hkM21lenJyVUFwTl9IdmYtV2MxbWF1UUFURmdKamp2d0pjdWVHZUVJUjIxTWlLV1FhQmNCTlc5T3E0elZSaTE5WHJ5WC1kcVNTcUYtbVFNN3MtOVdpcldWODhMS3lfd0VQQUhGYy1rdWxkT3ZR0gG0AUFVX3lxTE9fZGo1Ql9abWR2WjkzcC1mM0tlT0FGYXZlMVlCV0ZJSnVJcjFQOVctV1Raa2FyRGVPZzdGcWxvSWJuRXl5c1daaVRLMlVjOGw2MDQ0Wmx6TnRQYWQ2QjJERFJrZVVxOERpYVhqRGNvSGVMeFpHZG5NRjJHdkFZTjhlQldSaWZCUHA5YVVBM2ZNZG9nZmYwYzJpazN6NU5zdE9oSXdZdHhKX3B1WEVURlNlX3dWcQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "TON Blockchain Ecosystem to Get New Layer-2 Network Based on Polygon Tech - CoinDesk",
        "content": "A key feature of the TAC project is that it will be compatible with Ethereum Virtual Machine, or EVM, which is akin to the Ethereum blockchain's operating system. Such compatibility is crucial because developers who have built applications under the widespread Ethereum standard could easily port over to the new TAC layer-2 network within the TON ecosystem."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOT05rbXhfZVdaeFZ5OGcxbGs4Z3Q4djZWNkZtM1RhYWV5MlBBMXctLXhqNXdCWW9NcXg0U0ZUaVBnOWRmTHhZVnJDZ3E4ODRZcWJIOEpwTnJOX050TFZHaVZNVUstay14Q25DbGxGamtlRk1FcUxTTnduemxPdjN2Y0VKOHlOVWw2RGJIRUt4TEtYZEFSUHZudE1xdlRMdjVNUnFJbFV30gGrAUFVX3lxTFA5ZXBNZEpCakdzSU5RYWZ5d0RqcUxONElISnRCSTM0LVZXMHl3VXo5TWhjTzdWTWo3WVNsOGlWUFZ4S1kwdm52NjJSb21fVUQyM0JuY1FJQnZaRXJVRlFUT1FkaU1Hb1ZaUjMySTFLSENmcG5ydUJnbktTUE1WWE0wMmt1OVBZWjBfQVh2NVpBS1BoNVN3RENEdXlyb2V4V2tqWmFQMmFKWVVaOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Is Ethereum Price Reversing or Is It a Bull Trap? - CoinGape",
        "content": "Ethereum price increased by 5.6% in the last 24 hours to trade at around $3,070 during European business hours. The increase comes against the backdrop of Germany’s continued Bitcoin sell-off. BTC also saw an increase of 3.4% over the last 24 hours, and is trading at $57,189.\n\nadvertisement\n\nEthereum Price To Rebound If This Happens\n\nETH price broke below a falling channel on Thursday last week, a non-bullish move on its part. Ethereum price plummeted to a low of $2,811 as Bitcoin continued to bleed. However, ETH price found another support below around $2,815, using it as a cushion against the fall. The price of ETH consolidated around this local bottom over the weekend before showing some renewed strength on Monday going into Tuesday.\n\nThe Ethereum price action has revisited the 200-day simple moving average (SMA), which is currently acting as a resistance. If Ethereum breaks above this key indicator, market sentiment may turn to bullish.\n\nEthereum price prediction shows the asset may likely break above the 200-day SMA but succumb to the overhead 50-day SMA, falling into a consolidation zone between $3,371 and $2,811. This will also put it back into the falling channel.\n\nIf ETH bulls can exert more power, they can break above the falling channel and the potential consolidation zone to hit the previous yearly high of $3,967. On the flip side, if the bears prevail, ETH price may break below the $2,815 support and drop lower to $2,200, with temporary cushioning around $2,490.\n\nOn the other hand, Bitcoin price hit a low of $53,550 in the recent sell-off (which may still be in play) before bouncing back, as data from CoinGecko shows. The asset seems to have found support around the $55,000 level, though history suggests this may not hold for long. If BTC continues to fall, the next major support is around $50,000, and below that, $46,000.\n\nWhy is Ethereum Price Rising?\n\nThe markets today have spots of green, with Ethereum among the biggest gainers. VanEck was the last to file an S-1 for its spot Ethereum ETF yesterday, indicating a high likelihood of ETF approval soon. As of July 9, 2024, all spot Ethereum ETF applicants have filed their updated S-1s.\n\nMeanwhile, while Germany continues to sell Bitcoin indiscriminately, ETFs saw $384 million in inflows last week, showing that investors are using the fear in the market to get exposed to BTC at discounted prices.\n\nBottom Line\n\nEthereum’s price movement shows signs of a potential reversal, but uncertainty lingers as market participants debate whether this uptick represents a genuine trend change or a deceptive bull trap. Close monitoring of key indicators may provide clarity on whether ETH can sustain its momentum relative to BTC in the coming days.\n\nFrequently Asked Questions (FAQs) 1. Which firms have filed for Spot Ethereum ETF? Grayscale, VanEck Fidelity, 21Shares, Franklin Templeton, BlackRock, and Bitwise have all submitted filings for a spot Ethereum ETF. 2. When will Spot Ethereum ETF launch? Speculations say that Ethereum ETF will launch mid-July. 3. Can Ethereum reach $5000? According to analysis, after the launch of a spot Ethereum ETF, ETH could rally to $6,600.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPVXBjYXJsemd6eUtwb3lqVUFMNkxmaEFQNmtvTVp3WTl4QkxCX2FxY2E1ZlZjdzZXVUZ3d2QwTk9MZTYwYTJCSXNIVEhmQkY4MHF5VXRGdXpwZ1JXWTJaaFVyU2d0Tk9QVnVXQUtKYUF6R0h4OUVjeHF3bXdPQmVLOU5zNGFyV3UtNS1VV1NqOVZmNDFFc3dxTXYzONIBoAFBVV95cUxOQ3hnTTNyeDA4dkMwanQweWgzMU9Wczg3b19fOUloS0VDWExla1ZVRG1rWmVIUUdOS1EyWko0bHh5WV8wSUg0TTdHUDkwbWZUaGhxVXg5Nkk5TW1TSXJKUDFNU1pzYWZOTFRTR2VhbnV5ejFBZ1o1bW9iWmtCMDdnWXctbTJPX0ZzN3FaTjl1SUZWaFhWNnN1LUUzWmtoajRS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Gearing up for a New ATH After the Market Crash (Analysts) - CryptoPotato",
        "content": "TL;DR\n\nEthereum briefly fell below $3,000 but has since recovered, with bullish predictions targeting prices up to $8,000.\n\nOptimism is partly driven by the potential launch of spot ETH ETFs in the US, expected by some industry participants as early as mid-July.\n\nThe Next Target\n\nThe cryptocurrency market decline witnessed at the end of last week and the start of the new one has negatively affected Ethereum’s (ETH) price, which briefly tumbled below the $3,000 mark. In the past 24 hours, though, bulls stepped in, pushing the valuation above that level.\n\nMany crypto enthusiasts seem unfazed by the latest crash, predicting a strong rally for ETH in the foreseeable future. Lucky—an X user with over 2 million followers—described the asset’s plunge below $3,000 as “a natural gift.” However, he cautioned investors to keep an eye on the sector in the next few days before making “any big moves.”\n\nMikybull Crypto believes ETH’s price has “fully completed its retest on the bull pattern breakout,” expecting an uptick to as high as $4,000.\n\nMcKenna and Poseidon were even more bullish. The former set a target of $5,000, while the latter forecasted a new peak of as high as $8,000 to be reached sometime next year.\n\nOne major factor that could trigger an upward momentum is the eventual official launch of spot Ethereum ETFs in the United States. Recall that the US Securities and Exchange Commission (SEC) approved eight such products but they are not live yet. According to Bloomberg’s Eric Balchunas, July 18 seems like the “best guess” for a launch date.\n\nPrevious Predictions\n\nThe X users Captain Faibik and Crypto Tony were among those touching upon ETH’s price trajectory during the market correction. The former recommended buying the dip, forecasting that the asset will “bounce back.”\n\nCrypto Tony suggested that everything would be under control as long as bulls held the important resistance level of $3,270. However, ETH dipped well below that mark, currently trading at less than $3,100 (per CoinGecko’s data)."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQNmFqZXBNVVhYUmZubS1GZmN6WThTV2hWaWo2X2RvZVpJdDMyazhDSlZvaHhEUVRaQ3EtaU9PSDAwNnIzanVMU0tyUk84S1JrMkh0NjB0N0VhMW1yZ1VaZFNrOS1CR194V0hlZ2ZNbEY3Ui1CTnF1Tjg1cUhSQ2RudTNsQ2FFX1dMUm14cHQtRUROc1lxLVhYU3BrUzJSYjB6dVJablA4Sjg3bXMwU095aTc1b3HSAboBQVVfeXFMUHh3MEdndW5kZXowMnRnN2RYem54RnE2ckZFR29NUmY3VWFDY2dDLW1jWkRYRk90ZWJ1NGRyQnVEcW9OSG1FT1RldGQyUmd4TTByQnpnUXNIN3cteHFrRENVV1lmUnhodWFsNVFSX0FNbDVjTjhVNWNkVFZUTXRQYjV1UlBma2Frb0JWa29UUVo5R0RRTHpjR1BLV0Z3Y1dJdkNCelQySElHU3NySmlKVHdPMnRXdnplQ19n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Hitting New Records: 47.36 Million ETH Stake in the ETH2 Beacon Deposit Contract - CryptoPotato",
        "content": "Ethereum 2.0 staking has seen significant growth, and a major milestone has been reached. As such, the deposit contract for staking Ethereum on the Beacon Chain reached an all-time high of 47.36 million ETH this week.\n\nInterestingly, this accounts for 33.9% of the entire Ethereum supply.\n\nETH2 Staking Milestone\n\nAccording to the data shared by the crypto analytic platform Santiment, this is a dramatic increase from two years ago when it held only 10.9% of the supply, effectively more than tripling its share.\n\n“The ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high 47.36M ETH, This is good for 33.9% of the entire supply, and more than tripling since the 10.9% it held two years ago.”\n\nSantiment also highlighted the redistribution of ETH over different wallet tiers. As such, wallets holding more than 10 million ETH, representing the Beacon Deposit Contract, increased their share by 23% of ETH’s supply in the past two years.\n\nOn the other hand, holdings for other wallet categories have declined, with 10K+ETH wallets (excluding the Beacon Deposit Contract) dropping 5.3% and wallets with 10K or less ETH decreasing by 17.7% over the same period. This shift signaled a growing participation in Ethereum 2.0 staking.\n\nImpact of Growing Participation in Ethereum Staking\n\nDespite the growing inclination towards staking, data suggests that both staking reward rates and inflation rates have unexpectedly decreased.\n\nThe reward rate represents the annual percentage return for staking ETH, similar to interest earned for contributing to network security. Meanwhile, the inflation rate measures the pace at which the total ETH supply grows, with new ETH minted as staking rewards contributing to the inflationary trend.\n\nThe lower reward rate implies that stakers will receive less new ETH per staked token in the near term. However, the reduced inflation rate means the overall ETH supply is expanding more slowly. This could benefit ETH’s value in the long run."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPbUdxckUtZ3U3aFhlQ2pqVTlhSTc2UFhvUFJHWi1xZEJwTFNMb1RjZThCRHBicm5PS3ZESWRPU0tJOUQ1UVBYczJoZGpYckppb1c0ZXp5N3A2ZnVpY3dxN1hqcU1wcnE3aURjTV82RlhXeUZQQ1c5RHRhUEFQNWNoeFAyeS1sd05CRFZSb0pSSEbSAZYBQVVfeXFMTjYxSm1LVXl3dGZwWVlZOUpTRkZZLW5QaV93MkVSZ3pxRVpOcnlGY21tYlBrR1VWaVJGUFZITWctclcwa3FQZk1QVWdTa2lHSHIzajBVcU1SM0VwaGpha3lZcnFUUGhmekxLUVpwYjBCX0VHRU9FYjEyTUtYa1dPZVluZFJXQWF2WW0wejNYdjB2R3BpSFdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF approaches: Comparing ETH and BTC’s states pre-launch - AMBCrypto News",
        "content": "Ethereum ETFs were gaining much popularity in the United States.\n\nETH was down by 12% last week, but a few market indicators hinted at a trend reversal.\n\nEthereum [ETH] has been facing multiple price corrections over the past month. This happened at a time when its much-awaited ETH ETFs launch was drawing in.\n\nTherefore, let’s take a look at what’s going on with ETH to find out whether its launch would benefit the king of altcoins and allow it to outshine Bitcoin [BTC] in the coming days.\n\nEthereum ETF hype isn’t enough?\n\nInvestors and the crypto market as a whole have been waiting patiently for the launch of ETH ETFs. As per the latest data, the possible launch of Ethereum ETFs can be expected on the 15th of July.\n\nAMBCrypto’s look at Google Trends’ data showed that the popularity of Ethereum ETFs has been consistent throughout the last 30 days in the United States, reflecting the hype around them.\n\nAlthough the launch date was getting closer and the market seemed excited, Ethereum continued to struggle to raise its price.\n\nAccording to CoinMarketCap, ETH was down by more than 125 in the last seven days. At the time of writing, the token was trading at $3,045.32 with a market capitalization of over $366 million.\n\nA possible reason behind this bearish price movement could be the lack of confidence in ETH among investors.\n\nAMBCrypto’s analysis of Santiment’s data revealed that ETH’s Weighted Sentiment moved southward substantially last week. This clearly meant that bearish sentiment around the token was dominant.\n\nBitcoin vs. Ethereum ETF\n\nSince ETH remained bearish despite the launch getting closer, AMBCrypto planned to compare both Ethereum and Bitcoin’s states ahead of their ETF launches.\n\nOur analysis revealed that BTC’s price started to gain bullish momentum way before its ETF launch date.\n\nTo be precise, BTC’s price started to move in November 2023 and peaked during the BTC ETF launch on January 10, 2024. However, soon after the launch, BTC’s price started to decline.\n\nOn this front, Bitcoin was clearly dominating Ethereum. However, to see whether ETH was planning something bullish a week ahead of the ETF launch, we then analyzed ETH’s daily chart.\n\nWe found that Ethereum’s Relative Strength Index (RSI) registered an uptick after touching the oversold zone.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAdditionally, the Money Flow Index (MFI) also followed a similar increasing trend. This indicated that ETH might turn bullish in the coming days.\n\nNonetheless, the Chaikin Money Flow (CMF) moved southward. The MACD also displayed a bearish advantage in the market."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQOE00U2t3czRIdmJ4VlhoamtLdnU4YUxBaTlKQnVVUlpoRUhKYmJtRzRuT0VmTnotTkFPRTBoOXpOMldMelEtdUJkOTZpczE1Tlo4NkRJMTQzNElvTWRtSjZVZkpzM0t6RzVsaWFpRktXaFJ4YXVEck05dkR3bG01VERPX2IzMjJibHoyYU9QN1pNbWoxLVA5MF9EOEJCQk94SW50RUdpWkFqYk8yc2NWT2g4eTYxUURRSFd3cnp2MkFUZk5nRDZoMlJ1bFNXWHhrUHM1YTJsLWFjd2o0YnpCeHpwSGNDVFY20gHuAUFVX3lxTE1mQWc4S3NiQlpMNEtiUjZTRnZpajBYNG8xdXp1eHJXa0NhamZ4QTdrcUZEUzhSVVJJaGpCdzhHRHJuNEFtQ3U1RTJseFdkZE9ickppTUlWTWJhRzdqbzdqRnFONHpHZGJLTXNGVVQ5QlhLeW9DUm1NbENEMTJsV3VITEhia1YyU05OYlBYajFJeklVSlJkNUdsMWNDaW5CelBITTk0STRTeHB3UWszcjRONmdsT2tHWk9vLVVQWi1fUUFVTnFBYlZ6VUJ1X1pKbDBnTUZrZDZtQmFLZ05uN3c4RDhUb0V1ellUVTFDZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin eyes upside move on bullish technicals - FXStreet",
        "content": "Bitcoin price action shows a bullish divergence on the momentum indicators, signaling a bullish move.\n\nEthereum finds support around the key level at $2,817, with an impending rally eyed.\n\nRipple price finds support around the weekly support level of $0.413, with potential recovery on the cards.\n\nBitcoin (BTC) price action indicates a bullish signal from the Relative Strength Index (RSI) and the Awesome Oscillator (AO) indicators, foretelling an upward trend. Ethereum (ETH) and Ripple (XRP) are mirroring Bitcoin's path, finding stability at critical levels and suggesting potential price increases shortly.\n\nBitcoin price looks promising as technical indicators show bullish divergence\n\nBitcoin price encountered resistance at the weekly resistance level of $58,375 in the past four days and trades below it around $57,810, 0.56% down on Wednesday.\n\nAdditionally, the formation of a lower low in the daily chart on July 5 contrasts with the Relative Strength Index's (RSI) higher high during the same period. This development is termed a bullish divergence and often leads to the reversal of the trend or a short-term rally.\n\nIf BTC closes above the $58,375 weekly resistance level, it could rise 9% to revisit the daily resistance at $63,956.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes below the $52,266 daily support level and forms a lower low in the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 4% decline in Bitcoin's price to revisit its daily low of $50,521 from February 23.\n\nEthereum price eyes rally following support retest\n\nEthereum price found support on Monday at the $2,817 low of May 1, bouncing 1.58% the next day. At the time of writing, it trades 0.49% down at $3,059 on Wednesday.\n\nIf ETH closes above the $3,240 level, it could rise 8.8% to retest its daily high from July 1 at $3,524.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective neutral levels of 50 and zero. For bulls to sustain momentum, both indicators must rise above these critical levels, potentially supporting the ongoing recovery rally.\n\nAdditionally, if ETH closes above the $3,240 level, it could extend an additional rise of 5.5% to retest its next daily high at $3,717 from June 9.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below $2,817, forming a lower low in the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 7% decline in Ethereum's price to revisit its daily support at $2,621.\n\nRipple price shows potential recovery rally\n\nRipple price found support around the weekly level of $0.413 on Monday and bounced 1% the next day. At the time of writing, it trades 0.2% down at $0.434 on Wednesday.\n\nIf XRP’s daily close above the $0.450 level, it could rally 11% to revisit its daily resistance at $0.499.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective neutral levels of 50 and zero. For bulls to sustain momentum, both indicators must rise above these critical levels, potentially supporting the ongoing recovery rally.\n\nAdditionally, if XRP closes below the $0.499 level, it could extend an additional rise of 6.4% to retest its next daily high at $0.532 from June 5.\n\nXRP/USDT daily chart\n\nConversely, if the Ripple price daily candlestick closes below $0.413 and forms a lower daily low, it could indicate that bearish sentiment persists. Such a development may trigger a 16% crash in Ripple's price to revisit its low of March 12 at $0.347."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWXRJM3RQNDV6a294Mmg2QlhvTlAxRXJFeTdMVzBVTU4zMHVzR3VnRXFtbi1lNmZDbUs2c0dmWnlzZksxZFJXSllhSlJmMUp1UkQwbTZEbTB1R3g3QUdJS0JQOTdyYkVSbmgxYmJwSXFZV3JpRnd3RE5RV1owR25LUnhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Crypto : Ethereum au bord du gouffre ? - Cointribune EN",
        "content": "Wed 10 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nAs Ethereum is not far from the critical zone of $3,200, sell signals are multiplying among investors. This resistance, combined with expectations regarding the launch of an ETF on Ether, creates a tense and uncertain market climate. The current volatility could have major consequences for the future of the second-largest cryptocurrency.\n\nEthereum facing resistance at $3,200\n\nEthereum, the second-largest crypto by market capitalization, recently crossed the $3,000 mark, but it encounters major resistance at $3,200. This price barrier is critical, on-chain data shows that about 2 million addresses that bought Ethereum around this level are currently at a loss. These investors might choose to sell their cryptos to recover their initial investments, increasing the selling pressure on the market.\n\nHowever, the imminent launch of an ETF (Exchange-Traded Product) on Ether could change the game. This event is likely to inject new capital into the market, counterbalancing the selling pressure and generating a positive momentum for prices. Despite everything, Ethereum struggles to break through the $3,200 resistance, illustrating the current fragility of its position.\n\nMarket sentiments and projections\n\nDespite the optimism surrounding the launch of the ETF on Ether, the price of Ethereum remains unstable. Currently, ETH is oscillating around $3,100, with recent fluctuations indicating uncertainty among investors. Data from Coinglass shows a slight increase in Open Interest in ETH futures, reaching $12.67 billion, while the derivatives volume has dropped significantly. This combination highlights a sense of caution and expectation in the market.\n\nThe Relative Strength Index (RSI) of Ethereum, currently at 40, indicates that the asset is neither overbought nor oversold, marking a neutral position that could shift either way. The situation is worsened by large purchases, such as the recent acquisition of 16,000 ETH by a whale, showing that some investors are anticipating a rise due to the ETF.\n\nThe short-term outlook for Ethereum is thus marked by high volatility and persistent uncertainty. The selling pressure at $3,200 remains a major obstacle, but the launch of the ETF will undoubtedly bring a capital influx that will change the game.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPVUVsVVFVU3RQemh0NzZNZ0dsdE05NTM4eVc0S2pqSlB0MW1WYnloRWtsTTNZVmJ1R1ZEb3ZKYUNJeUYzOGplRW02QzFlRUdrcHJsVmhCd1N0MkpZNzZoNFd5XzlmQ3ZPb3c1YkNvZ09JeDMydHVZRkR0X0tRNzVTNG5FUDZCNzRLbXVnTEkwejU1ek5VV2t1dU1aQ2RyT0txYVZsRGtQM0p1Zy14dElaclFOTTdGUFNCVThfX09EWkFWbG5xa3VN0gHMAUFVX3lxTE55UndvZXkxdElSN2pnQ2NJSVNTMlpTei1oTGI3MF9SYUtZMVhKYmQ2dzl1LThETnNNSG40ZXZnVFNLSHVQbGtRUTRhZFloMXlRSnZEMXF5R3NELWtwSDA2aTdJeHFmQm1sWkowWHlDME52cXF4ZlU2R1NiY3dMLUl2b1Y5cnJRdlZsb0drOFVlQnlIaHVUbWFPWVZkbl82M0pkRzJsVHJnMGpBVUhWd2ZtUXR4U0cxQVJvTXAzS3ZIOGxuRHlJWkZTZlJ5TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Crypto Whales Gobble Up Over $76,000,000 Worth of Ethereum-Based Altcoin in One Week, Says Analyst - The Daily Hodl",
        "content": "A closely followed on-chain analyst says crypto whales are heavily loading up on an altcoin running on the Ethereum (ETH) network.\n\nAli Martinez tells his 66,900 followers on the social media platform X that deep-pocketed investors accumulated tens of millions of dollars worth of the decentralized oracle Chainlink (LINK) in just seven days.\n\n“Chainlink whales have snapped up over 6.2 million LINK this past week, totaling approximately $76.88 million!”\n\nLast week, Martinez warned that Chainlink appears to have broken down from a head-and-shoulders reversal pattern after it took out support at $12.\n\nTraders keep a close watch on charts flashing a head-and-shoulders pattern as it suggests that the asset is poised to witness downside price action.\n\nWith LINK trading slightly above $13, the trader now warns that the Ethereum-based altcoin may be in the process of flipping a previous support level into resistance.\n\n“Be careful with Chainlink! The recent upswing to $13 could have been a retest of the head-and-shoulders pattern’s neckline.”\n\nLooking at the trader’s chart, he seems to predict that LINK could nosedive to as low as $6.80, a potential decline of nearly 50% from current levels.\n\nAt time of writing, LINK is trading for $13.10, up over 6% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQMDlmc2xSb0syaXQyTFlVNHN5aV82RFR5SzJwQjZ3RnEzb1Q5d1NuN0xiOU5ULVZmc1dpYUc4VmVBYmJMdzJVVzFNdkg5N1pBbXN5RnBHUG5pNG5nVWRydlRpQ2FEV1lqTUxveGdIMHdxT2I5MnpmQnM4YTRsVTFWSm1ZaHBKM2Vkek9QMl9B0gGTAUFVX3lxTFBCMFVsUVhTaFRxNUVpWjVBekdVbHVyaVI2QXhhaDlTSDRHRVVhenBoTEFpdjVuRGtzYjBoODkyaTl3djNUYjhqcnZ5cHljTVJlcFJ3aXBSYnhIcGhpc211SkFvSmtZb1pRbUllUkN3U0llMlRwTlZfVlF4SlpsQzVqd2JFMURuM04xb3pNSDQ5bFZnZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Executive Says Ethereum ETF Is Close to the Finish Line - CoinGape",
        "content": "Katherine Dowling, the Chief Compliance Officer of Bitwise has expressed optimism on a near approval of spot Ethereum ETFs in the United States. This comes on the heels of spot ETFs S-1 amendments filed by issuers to the Securities and Exchange Commission (SEC). Crypto users await possible approvals to drive inflows in the market.\n\nBitwise Executive Points to Approvals\n\nBitwise CLO Katherine Dowling stated that Ethereum ETFs are close to the finish line of the launch. In a recent Bloomberg interview, she highlighted the status quo including other developments with the financial regulator. Responding to talks of Ethereum being a harder-to-sell asset than Bitcoin, Dowling answered in the negative noting that the asset has its market structure.\n\nadvertisement\n\n“It is explainable, not as easily explainable as the qualities of Bitcoin, but we are six months behind here and close to a launch of these spot ETH ETFs. Chair Gensler said it’s gonna be sometime over the summer; everyone has their different definitions of summer… but we’re seeing in the S-1 amendments that there are fewer issues vetted back… that points to all signs that we are close to the finish line of the launch.”\n\nFurthermore, she added that products can be marketed more than currencies used to buy items but technology innovations with Bitwise increasing investment education efforts. Recently, all potential ETF issuers filed their amended S-1 with the SEC. Bitwise filing includes waiving the sponsor for $500 million in assets.\n\nCompetition Good For The Market\n\nThe Bitwise executive noted that it is great for investors for multiple issuers to get approved at once adding that the company sets itself apart as the crypt market specialist. Highlighting the company’s strengths, she pointed to efforts with traders and other market factors. Several crypto users also share similar sentiments on the benefits of diverse ETF issuers. The launch of these products will drive investment in the market as it opens up a new investment window.\n\nAlso Read: Decade Old Dormant Bitcoin (BTC) Address Wakes Up To 10,419% Profit\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPX21idm1YYXpXazFLTUROZmRyNGh1MThGdDM1bUJ5S2M5MzNWZnk4ZmRYNWJwRG8zRlhKODF0VEptWnlJa3FndnZlY1owTmtUWVR5ajEyeVY2aUhNVy1iYU16c3VsbThXWUZ1UFE4TWRkaE5vdGFHVkVrUElQZkJaUUVLektndjZFZ0ZRTNIBkgFBVV95cUxPUEZSV21BbzdZTUQ3aGM1R0NPTTY1N2VvdHBSUDJMMmkwYkJmWVJpenB4XzZHdGRvaWJVX2J5YV9RRlcyRGlxSXZKOTJXTjJqNzROZzJUMVE2YTRycEFBMVhJck1HZUd3X2pQR2NSOElldzdLQTRSQldSLUNobW9JWEs1SGkzS09iWlk4bldtQTNOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Buy signal for ETH? Double-bottom on price chart says… - AMBCrypto News",
        "content": "A bullish double-bottom price action pattern has been spotted on Ethereum in the 4-hour time frame.\n\nShort sellers are not expecting ETH to reach the $3,250 level, if it does reach this level, $1.65 billion worth of short positions will liquidate.\n\nThe world’s second-biggest cryptocurrency Ethereum [ETH] has experienced a price surge of over 5.5% following the recent update on spot Ethereum ETF (Exchange Traded Fund) in the United States.\n\nAfter this ETF update, the overall crypto market turned green and investor sentiment shifted positively.\n\nWith this impressive price momentum in the last 24 hours, ETH has just reached near the 200 Exponential Moving Average (EMA). Additionally, it is just one candle away from bullishness as it is lagging slightly behind 200 EMA.\n\nEthereum bullish double bottom breakout\n\nAccording to expert technical analysis, ETH was looking bullish as it formed a double-bottom price action pattern in a 4-hour time frame and at a neckline near the $3,085 level.\n\nIf it gives a breakout and 4-hour candle closing above the neckline, there is a high possibility for ETH to hit the $3,250 and $3,300 levels.\n\nFurthermore, this bullishness in the Ether chart is also getting support from the Relative Strength Index (RSI), which is in the oversold area and signals a potential recovery.\n\nDespite this bullish double-bottom pattern, ETH has been consolidating within a tight range between the $2,850 and $3,080 levels for the last five days.\n\nHowever, this consolidation is taking place at an important support level, and a breakout or breakdown from this consolidation zone may cause a significant price momentum in either direction.\n\nEther’s strong support level and liquidation area\n\nHowever, ETH has reached this level more than four times since April 2024. Regardless of market conditions, ETH prices have consistently bounced back to either the $3,250 level or the $3,670 level, as shown by historical data on a daily chart.\n\nThis time traders expect a similar price surge from this level.\n\nFollowing the ETF update, ETH’s Open Interest (OI) surged by more than 5.5%, indicating that investor and trader interest and confidence have returned, according to data from an on-chain analytic firm CoinGlass.\n\nMeanwhile, traders liquidated a notable $59.94 million of their positions, out of which bulls have liquidated $23.75 million of long positions and short sellers liquidated a notable $36.16 million of short positions, as per CoinGlass data.\n\nIf ETH hits the $3,250 level in the coming days, nearly $165 billion of short position will liquidate. Over the last seven days, short sellers have been expecting that ETH won’t reach the $3,250 level, as per the latest liquidation data from CoinGlass.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAt press time, ETH was moving near the $3,075 level and it experienced a 5.5% price surge in the last 24 hours.\n\nIf we look at the performance of ETH over a longer period, it has lost nearly 10% of its value. Whereas, in the last 30 days, ETH is down by 16%."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNR2syVkRhRjdOT0Fhb3U2Slc5SUdmOU9kUnBjb0pwcjFqNnM1cERtcXB0UXFoU1VjTTdJYXQxNkp3cnByMm9aQXgxUjMyLTgwYXBBazMtRlEyNXdyQlJ4Z2R4X01qNGR2cXRRUElxUEY1alBrNThLeEpZeUdBM3o2cTdreHo4YVQzckxiY0oxTlZHSlBoaVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Race Heats Up as SEC Approvals Loom - FX Leaders",
        "content": "eth-usd\n\nThe long-awaited approval of spot Ethereum ETFs in the US appears to be nearing the finish line. This week, several asset managers including VanEck, 21Shares, Grayscale, Franklin Templeton, Fidelity, and BlackRock all filed amended registration statements with the SEC for their respective Ethereum ETF products.\n\nTL;DR\n\nThe SEC has yet to disclose fees for the proposed ETFs, but analyst Eric Balchunas expects one more round of filings with fees included before final approval. He speculates a possible approval date of July 18th.\n\nVanEck’s amended filing removed details on how Ethereum withdrawals would be processed, potentially reflecting a concession to the SEC’s ongoing concerns about crypto custody practices.\n\nSimilar to Bitwise’s filing last week, these amended registrations highlight the SEC’s focus on investor protection in the crypto market. They reference SEC Chair Gary Gensler’s concerns about inadequate protection for investors using crypto exchanges and his call for stricter regulations on digital asset trading.\n\nGrayscale’s amended filing clarifies that its “mini” ETF will not involve staking, a process where Ethereum tokens are used to earn rewards. This aligns with the trend of applicants removing staking language from their proposals before receiving approval.\n\nEthereum Price Remains Volatile\n\nDespite the positive developments regarding ETFs, the price of Ethereum (ETH) has fallen significantly since its peak near $4,000 in late May. As of today, July 8th, 2024, ETH is trading around $3,051, reflecting broader headwinds in the cryptocurrency market.\n\nGrayscale Announces “Mini” Ethereum ETF Distribution\n\nIn a separate development, Grayscale Investments revealed the record date for the first issuance and distribution of shares of its new Grayscale Ethereum Mini Trust. This is set to occur on July 18th, 2024, and will add to the firm’s existing suite of crypto investment products. Existing Grayscale Ethereum Trust (ETHE) shareholders will be entitled to receive shares of the Mini Trust in proportion to their holdings. Notably, the Mini Trust will not involve staking and is designed to offer a lower-cost alternative to the original ETHE.\n\nEthereum’s First-Ever Hackathon Announced\n\nThe Ethereum blockchain is gearing up for its first-ever hackathon, with a $2 million prize pool aimed at attracting security researchers to identify vulnerabilities in its codebase. This “Attackathon” will be a four-week long competition hosted by the Ethereum Protocol Security (EPS) research team in collaboration with bug bounty platform Immunefi.\n\nEthereum Price Analysis\n\nTechnical analysts are cautiously optimistic about Ethereum’s short-term prospects. The price appears to be forming a base above $2,820 and could potentially break resistance at $3,160 and rise towards $3,320. However, a failure to clear the $3,150 resistance level could lead to another decline towards $2,960 or even $2,820."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTlQyNWUwUUtQUEtWMDVSeEtfd2twMjVyTXhkSHFZbzJMaGJHWnhnZU1fMDhoeFRZcFV3ZFRXVmt1VXd5UFNTbl9sbUZ0dHNfeFVNNW9iSzN2aEtiUlZ3azh1SkFmQXpQMW5QWkZUQ09ENHFoRHdCeXFDSzVxZTF3LXdvdVh0S3lmTU5vbDhJT1pHNW9oNmZNWnE1MjfSAaoBQVVfeXFMTnZQNE9WdDBWbDVhYmFJb1luTi1uV0pabTVEaDVNWGVkTlNQY19oWDJKaUplZ2JuRWFuUmN4bTV2MzdXeFltYzI2dlNWOVdPZW8zQ1RKd1VNbl84VEJDMXhRRWZmblkxeFd3MjBBdVROTm1mYk1jUXlIM0FwdXZrRGE5Q1VvOTNEdkRneEhkZDIzLVJXNVVNMnA5Q09BamZmTDllcWlwR1lKS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Code Review 2024 – Is It A Legit Trading Platform? - Outlook India",
        "content": "What is Ethereum Code?\n\nEthereum Code is an online trading and educational platform that offers a wide range of trading and learning perks. It has been created to assist users with various needs and delivers reliable information and trading sources to begin with.\n\nThe user-friendliness of Ethereum Code allows users to get a personalized experience that can be achieved by customizing the dashboard easily. Moreover, the platform features comprehensive learning resources that can be used for upskilling trading techniques by users of all kinds. It features:\n\nAccess to the crypto market for trading needs\n\nHigh-end trading tools for accurate trading\n\nRisk assessment and tips\n\nEducational resources for learning needs\n\nPersonalized organizational dashboard\n\nHow Does Ethereum Code Work?\n\nOne of the best things about Ethereum Code is that it operates as a bridge between users, trading brokers, and educational companies. It allows users to access market insights for trading while learning from reputed educational sources.\n\nExplore Ethereum Code’s Official Website\n\nUnlike other trading sources, it uses high-end and sophisticated trading bots that assist traders in their journey. In addition, it carefully sources educational materials so that traders can benefit from what they learn and implement it practically.\n\nWhile trading, it analyzes the preferences of the users and finds opportunities in the market accordingly. Hence, it's like a trading assistant that you can assign a task and let it handle the rest. All you have to do is sign up, check out the opportunities waiting for you, and trade to earn the benefit.\n\nFeatures of Ethereum Code\n\nLet’s check out some appealing features of Ethereum Code:\n\nPersonalized Platform Experience\n\nAn attractive thing about Ethereum Code is that it allows users to customize their dashboard according to their preferences. This feature is usually limited in other platforms where you can only add limited resources to your dashboard.\n\nHowever, with Ethereum Code, you can easily add resources from educational to trading and tools on your dashboard. This kind of personalization makes navigation easy and the interface clean, giving the user good control over what they want to interact with.\n\nSupports Different Cryptocurrencies\n\nWhile working with any trading platform, users need to consider the kind of currencies it supports and allows trading with. Fortunately, the Ethereum Code allows trading in various currencies, including but not limited to Ether, Shiba, etc. as well as mixing these currencies for trading needs.\n\nHigh Success Rate\n\nSuccess rate matters a lot when choosing a trading platform. Success rate defines the rate of positive trading returns based on the insights the trading bots share. If the success rate is low, then you shouldn’t be bothering with the platform at all.\n\nFortunately, with Ethereum Code, you can rest easy as it offers more than a 95% success rate. Although this rate is claimed, it's not entirely true and can vary based on the trading processes used by the traders.\n\nHowever, the platform creators still state that the platform features a high success rate, which makes it a compelling choice for a trading platform to begin with. Again, it's strongly recommended that the users adopt only legitimate ways of trading and investing only the amount that they can risk losing while working with a broker for risky trades.\n\nEasy Withdrawals\n\nWhile using most market platforms, it was discovered that the users had a hard time withdrawing their invested money. Moreover, it was also identified that users faced difficulties while trying to withdraw their profits. But thankfully, Ethereum Code facilitates the users in this matter.\n\nIt not only allows the users to withdraw their profits or transfer them to other sources but also withdraw their entire capital to close the account or for any other reason. After proper authentication, customer support assists the users in proceeding with their withdrawals, which are usually processed in 48 hours.\n\nDemo Account\n\nWhile it features numerous learning resources to begin your trading journey with, it also facilitates the users with practical trading through a demo account. The demo account is formed just to give a hands-on experience to the users of how the platform and trading with it works.\n\nIn other words, the demo account is filled with the exact features and tools that one can find in the real-time account except it features demo money. Hence, the users can trade without the fear of losing their investment.\n\nOnce the users have experienced trading, they can easily switch to the real account and start trading. The demo account is always available for the users whenever they want to switch and strengthen their learning or test various trading techniques.\n\nRobust Customer Service\n\nCustomer service plays an important part in the functionality of any trading platform. From entertaining the queries to resolving the issues, it has to be readily available so that the users can reach out to it in times of distress.\n\nFortunately, Ethereum Code features such robust customer service that is available to the users 24/7. Whether it’s an issue with withdrawals, payments, etc. or you want to know how to get started with Ethereum Code, the customer service will entertain your queries and will assist with everything.\n\nCatalog of Useful Educational Resources\n\nAs it’s an investment learning platform, Ethereum Code features numerous educational resources. These resources are carefully sourced so that they can entertain queries related to trading, eventually helping the users strengthen their concepts.\n\nMoreover, some of these resources are free to access and easily available when you sign up for the platform. As for others, these carry a small fee since they offer certifications and can help you earn a reputation as a well-versed and certified trading expert.\n\nHowever, it’s a small fee to pay for such an organized and useful catalog of educational sources, which is why Ethereum Code is reliable enough.\n\nHigh-End Security\n\nWhen it comes to choosing a trading platform, you cannot overlook the level of security and safety the platform has to offer. Crypto trading platforms hold sensitive information regarding payment methods as well as user profiles. Hence, it's only evident that this information is secured with high-end measures.\n\nThankfully, Ethereum Code ensures that its platform, the data, and the users are protected at all costs. It uses strong encryptions and two-factor authentication methods to guarantee only legitimate users are accessing the platform.\n\nSome Downsides to Ethereum Code\n\nEven though the platform offers a series of compelling perks and features, to begin with, it still has some downsides that the users should be aware of:\n\nLack of an App\n\nSimply put, there isn't any Ethereum Code app; however, the creators are vigorously working on creating and launching one.\n\nAvailability Issues\n\nEven though Ethereum Code is available to users in countries such as Germany, China, the UK, etc. it's not available to users in the US. Hence, in order to access Ethereum Code in the US, you'd need to use a VPN. However, VPN use isn't recommended for high-end trading since internet fluctuations can cause errors in the reports and insights fetched by the platform, causing losses.\n\nHow to Get Started with Ethereum Code?\n\nNow that we’ve gone through what Ethereum Code is, how it operates, and its features, it’s time to let you know how you can join and get started with it. Check out the process below:\n\nSigning Up\n\nThe first step is signing up with Ethereum Code. You need to visit the official website of Ethereum Code and click on register or sign up to create your account. Once you do, you’ll be directed to a form where you’d need to input your contact information including username, email, contact information, etc.\n\nExplore Ethereum Code’s Official Website\n\nConnecting with an Expert\n\nOnce you input your details, you’ve officially created your user account. Shortly afterward, you’ll receive an email on your provided address, indicating that you need to verify your account.\n\nOnce you do, you’ll connect with a customer service representative that will ask some basic questions. These questions will include your investment and trading goals, risk approaches, and other metrics.\n\nThe representatives will ask these so that they can customize your dashboard layout as well as feature relevant educational materials for you to begin with.\n\nInitial Deposit\n\nAfter connecting with an expert and sharing your trading requirements, you'll be directed to a payment form where you need to share your payment details. This will be used for depositing your initial capital of $250.\n\nThis amount is required to complete your registration as a legit user as well as provide initial capital that you can use later for trading. In addition, you can also add more funds to this capital amount and use it later instead of re-depositing the amount again.\n\nChoosing Your Account Type\n\nFollowing the submission of your investment capital, you’ll be directed to the page where you need to choose the account that you need to begin with. This includes the demo account that we mentioned earlier.\n\nIf you're a beginner or even a professional who wants to begin your journey experiencing the platform, then you can choose the demo account right away. Once you've done getting hands-on experience, you can switch to your manual account easily.\n\nHave Celebrities Endorsed the Ethereum Code?\n\nAs far as our Ethereum Code review shows, the platform hasn't been endorsed by any celebrities. Hence, it's safe to say that any website claiming that Elon Musk or Jeff Bezos supports the Ethereum Code is false and users should abstain from following such sources.\n\nMoreover, it’s also recommended that the users only follow the news sources provided by the platform itself instead of following any other material online. Ethereum Code has a community page as well where it shares recent updates in the market as well as news about the platform.\n\nIn any case of collaboration or official launches, users can easily refer to this page or reach out to customer service to know the details.\n\nIs There a Dedicated Ethereum Code App?\n\nUnfortunately, there is no Ethereum Code app in the market and the creators are working diligently to create and launch one. Hence, Ethereum Code is under work; however, it's recommended that users not trust any such apps available on the market since they are not legit.\n\nThe platform creators have clearly shared that any such applications are not legit and they don't take any responsibility for losses or scams occurring through these apps. It's only recommended that users stick with the official website of Ethereum Code for updates on its app launch.\n\nIs Ethereum Code Legit?\n\nPerhaps one of the reasons why the Ethereum Code is quite recommended for traders is that it operates as an investment educational platform. It not only allows traders to invest and trade cryptocurrency but also allows them to learn from its numerous educational resources.\n\nThe availability of online resources, robust customer service, and amazing workability and design allow Ethereum Code to feature competitive trading perks for users. Hence, it's well-equipped to offer risk assessment and trading expertise, giving better insights into trading even on other platforms.\n\nFinal Thoughts\n\nEthereum Code is a legit platform that has a trading success rate while offering great means for users to learn more about trading. The customer service is readily available to assist with all matters and the high-end security measures make it quite compelling to be chosen for a trading platform."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQYUZ4V0NsbmxhZXVpLV9wRTFwdnZ1YTNiT2tZSFhoMHhPQkdGS1lLNkdOTVBtVTNnT3dpTTMxSFA4elFFUkFVLWdiZkFFNW1Bc0tBVEkyNnB1R19fQzdiZVFvVk1tY2dnSGhPaTJ1U1dtMkxzQkhtQmhFM09lUmNHelo4dUpXSkp3ZkFFVHZ5V0NUcVI0VURkcVhXSdIBoAFBVV95cUxQb3hGS2FpeDFmQTlnSUx3SG9fUUJCLW1ub1NNUnBmaTFVblIwZnYtOWhCazBFNGhPcE50NUxtX2d5UVIxaU1hdzBrUHpmSzZSXzBRcUlrZ1lvSzRnaUdZcmZwT1ZELWNuSWtMYnVCYzFyTExKSjcyXzV2VkV0SFFYZl9INWpxdFZZRHctM3FENXZUeDBBVVFsTDMwX3ZqMzJl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) Rockets 13% Sequel To Major Listing Announcement - CoinGape",
        "content": "Ethereum Name Service (ENS) has experienced a significant boost, surging over 12% following a major announcement by Upbit, South Korea’s largest cryptocurrency exchange. The news of ENS being added to Upbit’s Korean won trading market has sparked considerable interest in the token.\n\nENS, operating as a decentralized naming system on the Ethereum blockchain, has been making notable progress in simplifying blockchain interactions for users. The system’s key feature allows users to purchase easily readable names such as “bob.eth” and link them to various blockchain identifiers including addresses, content hashes, and metadata.\n\nadvertisement\n\nDetails of the Upbit Listing and Trading Restrictions\n\nUpbit’s decision to list the ENS token on its Korean Won (KRW) market is set for July 9, 2024, with the listing going live at 18:30 KST. This move is anticipated to significantly enhance the token’s liquidity and make it more accessible to South Korean investors, potentially expanding ENS’s user base in the Asian cryptocurrency market.\n\nThe exchange has outlined several transaction restrictions for the new listing. Buy orders will be restricted for about 5 minutes after the listing goes live, while sell orders priced below 10% of the previous day’s closing price will face similar restrictions. Market price and pre-order options will be limited for approximately an hour post-listing. Upbit has set the previous day’s closing price for ENS at 0.00047124 BTC, which equates to 37,951 KRW.\n\nUpbit has also implemented strict deposit and withdrawal guidelines for ENS. These include supporting deposits and withdrawals only on the Ethereum network, implementing the “travel rule” for additional review of deposits from non-listed virtual asset operators, requiring mandatory “ownership verification” for personal wallet addresses, and potentially requesting explanations for the source of funds for large deposits from unknown sources.\n\nAlso Read: Invesco Galaxy Misses Spot Ethereum ETF S-1 Deadline, Will Approval Be Delayed?\n\nENS Market Performance and Protocol Expansion\n\nRecent market data shows the ENS token trading at $28.73, marking a significant 12.27% increase over the past 24 hours. The token has seen a substantial trading volume of $427.7 Million during this period, indicating strong market activity and interest. With a circulating supply of 32 million tokens, ENS currently holds a market capitalization of $849.7 Million.\n\nThis increased attention asides the listing announcement could be attributed to the rising adoption of ENS domains, as more users seek simplified and memorable addresses for their crypto wallets and decentralized websites. ENS has expanded its capabilities beyond its initial ‘.eth’ domains, now supporting integrated use of traditional DNS names like .com, .org, and .io. This expansion has significantly broadened the protocol’s appeal and utility within the Ethereum ecosystem.\n\nFurthermore, the ENS token plays a crucial role in the protocol’s governance, granting holders voting rights on decisions affecting the Ethereum Name Service ecosystem. This decentralized governance model aligns with the broader principles of blockchain technology, potentially contributing to its growing popularity and value in the cryptocurrency market.\n\nAlso Read: Spot Bitcoin ETFs Inflow At 3-Week High, Institutions Buying Heavily Ahead Key Events\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOR2FveW1wY3dtZmRZNFhxSEctSmhPVUpzVHpxNXgwbng2ZkV5LUJROHVnd1RwbWJ5YkRoU01FZXNJcHpPOTQ4WEFTY0tEUjdpUm5UX0VGU0thOFRoMXhfdlBUZHpXX1pCZURwWURlb0Fia3VWaVo1NlNEX3hjekNsTmlyQnZqX1gyZExiM3pXVXFtcGhoUkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Ruled as Commodities in Illinois, CFTC Chair Says - Watcher Guru",
        "content": "At a Senate Committee hearing today, CFTC Chairman Rostin Behnam said both Bitcoin and Ethereum were ruled as commodities in the state of Illinois. Indeed, Behnam noted that last week saw a district court rule in favor of the agency in a fraud case, offering a judgment with important ramifications.\n\nBehnam noted that the decision, “reaffirmed that both Bitcoin and Ether are commodities under the Commodities Exchange Act.” The question of the cryptocurrency’s status as a security or a commodity has been a consistent issue between the industry and the US Securities and Exchange Commission (SEC).\n\nJUST IN: 🇺🇸 CFTC Chairman says Illinois court ruled #Bitcoin & Ethereum are commodities. pic.twitter.com/zkmvQQ8ThN July 10, 2024\n\nAlso Read: Donald Trump to Spark a Bitcoin Rally in the Second Half of the Year if Elected\n\nCFTC Chair Reaffirms BTC and ETH Commodity Classification\n\nSource: Blockchain Reporter\n\nIn the United States, there is an important difference between a security and a commodity. The latter is a basic good that is used in commerce and interchangeable with similar goods. Assets like gold, oil, or agriculture would be various commodities.\n\nAlternatively, a security is an asset that indicates ownership stake in a publicly traded company. Moreover, who governs the assets is an even more important distinction. Commodities are patrolled by the CFTC, while securities are overlooked by the SEC. The lack of clarity on crypto has led the latter to embrace increased enforcement over the market.\n\nSource: Bloomberg\n\nAlso Read: CFTC Calls Ethereum & Litecoin Commodities in KuCoin Lawsuit\n\nHowever, according to Behman, anywhere between 70% and 80% of all cryptocurrencies are non-securities. For Bitcoin and Ethereum specifically, the CFTC Chair notes that a recent court ruling affirmed their commodity status. If this sets off a trend of similar rulings, there could be an overwhelming shift in the crypto market.\n\nThe presence of crypto-based ETFs for both BTC and ETH is a good sign. That set’s a precedent for both, with it classifying the assets as a commodity ETF. Moreover, it could lessen the industry’s continued difficulty with Gary Gensler and the SEC. The SEC Chair has been outspoken in his unsavory opinion of the market as a whole."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQZEZ0dW5uc2VPeHdNMDZvemxONWVCQUJKREp1R2s3Y0FsdWFSZnRvRmxLU2JGemhZUmhNWGZCM19FYXcydk9ZVlRfdDJEWEpySHFUUDNOb0h4QU92MzZwd1JsM3A3eFdiT1hFZnI4cXVkSURXMURNenBUNDQxczBWU0lSdV9tQkVueGIxSHV0eGNKMXJVM0EtMUY2SlFWVzd2Qy1lRW5RZVJkUC1vSnFZajZWcFFBRF94MjFiOW93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Tether: the daily trading volumes exceed the combined total of Bitcoin and Ethereum - The Cryptonomist",
        "content": "Tether (USDT) is recording dizzying daily trading volumes, surpassing the combined total of Bitcoin, Ethereum, and other crypto. In 24 hours, traders exchanged USDT for over 55 billion dollars, almost double BTC and more than three times ETH.\n\nTether: daily trading volumes exceed those of Bitcoin and Ethereum combined\n\nAccording to reports, it seems that Tether is dominating the daily trading volume scene across the entire crypto market.\n\n#ICYMI: Tether 24 hour trading volume surpasses Bitcoin, Solana, USDC and Ethereum combined\n\n\n\nRead the full article 👇 https://t.co/rgvjPLCboo pic.twitter.com/1TQvGjuNfx — CryptoSlate (@CryptoSlate) July 8, 2024\n\n“ICYMI: the trading volume of Tether in the last 24 hours surpasses Bitcoin, Solana, USDC, and Ethereum combined. Read the full article”\n\nIn fact, in 24 hours, USDT was traded by traders for over 55 billion dollars, doubling the 28 billion dollars of BTC and tripling the 15 billion dollars of ETH.\n\nNot only that, doing some calculations, Tether maintains a volume higher than the combined volume of Bitcoin, Ethereum, in addition to USD Coin, Solana and First Digital USD, highlighting its significant presence in the market.\n\nThis is possible because USDT remains the most used (and most favored) stablecoin in trading pairs, capable of providing coverage from the typical volatility of cryptocurrencies.\n\nTether and daily trading volumes beyond those combined of Bitcoin and Ethereum and other assets\n\nIn general, the daily trading volumes of Tether have remained robust throughout 2024, remaining above 25 billion dollars. This allows Tether to strengthen its position as a key liquidity provider in the cryptocurrency ecosystem.\n\nNot only that, on March 16, 2024, Tether recorded the highest peak of daily trading volumes of 130 billion dollars.\n\nUSDT is also the largest stablecoin in terms of market cap. At the time of writing, in fact, Tether records a total market capitalization of over 112 billion dollars.\n\nIn addition to winning over crypto traders, Tether is also succeeding in its mission to extend the adoption of USDT to other sectors as well.\n\nIn fact, recently, Tether has entered the Philippines, where it will be possible to use USDT for payments to the Social Security System (SSS), managed by the State. This public service manages social security and employee compensation, and its payment is mandatory by law.\n\nClosing cycles to open new ones\n\nOther recent news also talks about Tether strategies that on one hand close roads that are no longer viable, but on the other hand open new ones.\n\nIn fact, the issuer of the largest stablecoin has announced the end of the minting of USDT on the EOS and Algorand platforms. Specifically, the minting of USDT on the two blockchains ended in late June, but the company has reassured users that the transition will be carried out meticulously and with minimal disruptions.\n\nThus, while on one hand Tether is closing a circle that began some time ago, on the other hand it assures users that it will decide to allocate resources where they can improve and innovate in the crypto sector.\n\nJust the week before, meanwhile, Tether had already announced an important piece of news regarding the launch of a new stablecoin collateralized in gold. It is called Alloy by Tether (aUSDT) and it is pegged to the US dollar but, instead of being collateralized in dollars, it will be collateralized in gold.\n\naUSDT is not even a stablecoin in the style of Tether Gold (XAUT), as the latter is a simple stablecoin pegged to the value of gold.\n\nTherefore, aUSDT is pegged to the dollar and technically over-collateralized in gold, meaning the total market value of all gold reserves held by Tether as collateral for aUSDT exceeds the market of all issued aUSDT tokens."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOdWhmWEptcFVQZkRwRHRpS3RteDdwdndiYUdGdVVTRm9TMnlNaDgxTHU2SFFWZl9OcjdOTVIyNFBNeGk3SFlsTnBqRTlEWUcyM1FxOXRNUWM0NEVuYlA5WWloLWJkdnNYeWRza2N5Tm4tSC1iZjVob1llWW00S3RXS3B6TXRQT0dmcXdqQWpsWWY0Y3dXYkdDbFpVWGZKdHhNMUVCTUl5bUNMLU5BTlRndENwUE5HQUNUbENkMDl3TjF6TVpSSGFwTG80QkhoWEVoSU5sTnN30gHbAUFVX3lxTE9EMnZiaXVrMkdXOXJrWmFpbExhbXBMRXFQZ2xYZkNRVnBNMVdCck9YbkRWa0d2UTc0bjFIQjM2SnR1NXNLcHBCa05nT1RfWmM3bXlTZm84VzVxTUV6M05MWXVWanVYMmFLbnc3VkxMajJYZDEzclJCdHBGT05PX0F1RERtYVlfQ25zODFUTlJDdzFwNDJZeWxIU3pHUG8zLV9lNXdVRGZnOGotaW5RcXdBY3VVZWdLODVNNzRzUEdIR2RhQW5MQkNXN1BqWi1keVJmQ2tvc3pQa3lvOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Solana & Meme Coins — Asian Wrap July 09 - FXStreet",
        "content": "BONK rallied nearly 8% on Monday as the meme coin began its recovery from heavy losses experienced following the Mt.Gox repayment going live and German government BTC offloading. PEPE also joined in the recovery, posting a 6% gain as bulls look to be buying the dip.\n\nSolana (SOL) kicked off the new week with a lot of action on Monday after Cboe filed VanEck and 21Shares' Solana ETF application. Meanwhile, SOL surpassed Ethereum and Arbitrum in 24-hour decentralized exchange (DEX) volume due to increased trading on the Raydium protocol.\n\nEthereum (ETH) is down 0.3% on Monday as prospective spot ETH ETF issuers returned their amended S-1 registration statements to the Securities & Exchange Commission (SEC). Meanwhile, ETH long-term holders are gradually returning to the market after years on the sidelines.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOY0lVaDRackxuUlhLYjZnbzJyRmJCLTkyeExSb3JobzBDVzZBUzlseDlaRmh4Sm1sSXByWU4tOVRFVFdPMHpHY2pYeTIyM01WdGdmTDY5N0xRSFkzM3NZNzMwTlpMQUt5N055azJRMTFlQjdpb1ZybWwtdktPdjhnSGZwLVAtMkNobHVUbnljbllydTl1T0NMMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin visits Waterloo - University of Waterloo",
        "content": "On Saturday, July 6, nearly two hundred students gathered for an ask-me-anything event with Vitalik Buterin, the co-creator of the Ethereum blockchain and a former University of Waterloo student.\n\nButerin studied computer science at Waterloo and worked as a research assistant for cryptographer and computer science professor Ian Goldberg. In 2013 he wrote a white paper proposing Ethereum. Buterin was awarded a $100,000 USD grant from the Thiel Fellowship in 2014 and subsequently left Waterloo to work on Ethereum full-time. Today, Ethereum is second only to Bitcoin in market value.\n\nIn his talk, Buterin discussed the math behind the blockchain, areas for innovation and the future of cryptocurrency. “Will crypto become the Esperanto of finance, the Linux of finance or the Internet of finance?” he asked rhetorically. “I think it depends — there are a lot of countries, particularly in the developing world, where there is a lot of demand for cryptocurrency because the traditional banking system is not effective.”\n\nButerin also distinguished between early-stage technologies (like cryptocurrency, AI and space travel) and later-stage technologies (like the pharmaceutical industry), arguing that early-stage technologies are an ideal space for ambitious thinking, innovation and employing pure math, engineering and science. “There’s a real focus right now on building amazing things,” he said.\n\n“We are incredibly lucky to have Vitalik come into town to talk about Ethereum and its future roadmap,” said systems design engineering master’s student Monica Tsang. “He encouraged us to work on the optimistic, idealistic side of blockchain development instead of chasing quick money. Being a jack-of-all trades will help us learn new knowledge fast in this quickly changing blockchain space!”\n\nButerin emphasized the importance of shared values in technological ventures, both for practical reasons and for ethical ones. “Make sure you and your co-founders are aligned on values, both in terms of what you want to achieve in the world and also what you want to get out of the project,” he said. “Consider what kind of relationship you want to have with each other, with your investors, with your users and with your community.”\n\nButerin’s talk was the finale of a four-day workshop series, “Solidity 101 Bootcamp,” sponsored by De University of Ethereum, VentureMiner and the Faculty of Mathematics. The bootcamp was billed as a comprehensive educational program designed to empower the next generation of blockchain developers.\n\n“It was such a thrill hosting Vitalik Buterin,” said Stephanie Whitney, director for Research & Innovation Partnerships in the Math Innovation Office. “The audience was blown away by how thoughtfully he outlined avenues for contributing to the blockchain ecosystem. We can’t thank him and the Ethereum Foundation enough for this amazing opportunity.”\n\nYou can learn more about Ethereum on the Ethereum Foundation website. You can learn more about the Math Innovation’s Entrepreneurship and Impact Series, including future visitors, on the Math Innovation Website."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPMjJrZDRpTDVMcmY4RHY5VXpXbDZmWm0zTkZJejJwbk13RzVMSDdCazI2WktUZnNSWEJhMnYwMWVmTlBEaE04VGdNanliWWFxdzlfaUVyX0cyZW8xMkM4a1hwZlI5STV2R0llNnhjaHYwYzNRdGdFd3RXS0ZqUFBMYTBQTWdrQXhLQ2hoeXhCdGNRaS1DdW9xV1ZDZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Goes In-Depth on Ethereum and How to Make it Stronger - Watcher Guru",
        "content": "One of the creators of the largest smart contracts blockchain, Vitalik Buterin took the stage at the Ethereum Community Conference (EthCC) to discuss the network, its strengths, weaknesses, and how to make it even better. At the Brussel’s event, Buterin noted the strides the blockchain has taken, but what work lies ahead to optimize its offerings to a growing user base.\n\nThe keynote speech, to a room of more than 1,000 onlookers, covered a variety of topics. Among them was Buterin’s concerns regarding transaction censorship. Moreover, the co-founder revealed a unique proposal to those in attendance that would have a massive impact on the overarching issue.\n\nSource – Watcher Guru\n\nAlso Read: Ethereum: Vitalik Buterin Wants to Redesign the Network\n\nButerin Talks Ethereum’s Strengths, Weaknesses, and ‘Hardening’ The Network\n\nIt's time! It's time! @VitalikButerin is speaking right now in the Gold Hall 🥳\n\n\n\nWe have a full house of eager beavers ready to hear his keynote 🦫✨\n\n\n\nIf you can't find a seat, please check out the streams in the Silver and Copper Halls 🫶 pic.twitter.com/e9xpRFy29s July 10, 2024\n\nThe network’s co-founder, Vitalik Buterin, recently spoke on Ethereum at a keynote talk. There, he expressed his belief that Ethereum thrives as a “large and reasonably decentralized staking ecosystem.”\n\nThis proved to be its greatest strength, according to Buterin. Moreover, it is supported by a growing community that is both international and highly intelligent. Yet, there is still room to make it better. The co-founder noted that solo staking is still very difficult. Currenlty, the process requires 32 ETH to become a validator, while running a node is increasingly complicated.\n\nHowever, Buterin did note that these issues, “are very addressable.” Specifically, he discussed various improvements that would allow for a simplified protocol. “So if you want a robust ecosystem, it needs to be simple,” he said. “It should not have these, like, 73 random hooks and some kind of backward compatibility,” just because it was created by Vitalik himself.\n\nSource: CoinDesk\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks\n\nHe also voiced his worry about the 51% attacks on the blockchain. However, he noted a solution isn’t all that simple. Buterin said it “depends on a lot of assumptions around coordination, ideology, and various other things, and it’s not clear how to do something like that as well in 10 years.”\n\nButerin did share a proposal with attendees. He noted the difficulty in recovering from attacks when the chain finalizes. Therefore, he proposed increasing the quorum threshold from 75% to 80% to prevent that.\n\nIn the end, the Ethereum leader noted a clear path forward for the newor. “I think there’s value in really doubling down on these strengths and at the same time, recognizing and fixing our inadequacies and making sure that we actually live up to our very high standards.”"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOd28wMVFYX2hteEZMdzVSUEtMYkJDNUY1YlJFazhod0psYWw5MjN4aTRXbWhBdGNrMkdrOFg3eXNWQV9JaHZ6RGwtVFlFU3pOaWpJQWppczBhZ3lXbS13WVdPb01HTUgxRzFuY3kxNGthMFpwU3M0T3BRYjk3czhsVHF1ODlwMTlUcU1Ca0lSVDRxWEZ1ek1GNHIyLVhxY2dGOXE1UkJnRTVJU1lRdmlLRU1VZDBDTzE0dldTOVNLald1RXVxUDcwcE1xenNxdU1vRGJ2a2NSMl9LMk1CYUJGRkhEblY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Final Approval of Spot Ethereum ETF Expected to Enable Trading Next Week, Following Multiple Amended S-1 Filings - Crypto News Australia",
        "content": "Major financial firms like Fidelity and BlackRock have updated their Spot Ethereum ETF filings in compliance with the SEC July 8 deadline.\n\nEthereum’s price remains stable above US$3,000 following positive regulatory developments and expectations of ETF approvals.\n\nFuture ETF prospects for altcoins like Solana, Cardano, and XRP depend on upcoming political and regulatory changes.\n\nThe Spot Ethereum exchange-traded fund (ETF) saga goes into the next round. All applicants have now updated their S-1 filings: Fidelity, VanEck, Franklin Templeton, 21Shares, Grayscale and BlackRock.\n\nRelated: Republican Platform Promises to Halt ‘Un-American’ Crypto Crackdown, Opposes Government Digital Currency\n\nThese have been filed according to the request by the Securities and Exchange Commission (SEC) which had asked to stick to the deadline of July 8.\n\nThe filings do not include details related to fees, as the SEC has informed issuers that these are not needed yet. Senior ETF analyst Eric Balchunas said there shouldn’t be too much back-and-forth from now on – with trading to start soon.\n\nAdvertisement\n\nThey will give guidance back to issuers soon along with the game plan. Then the docs will come back with fees (and every other blank) filled [in] and then it’s go-time. Eric Balchunas Eric Balchunas\n\nEthereum Price Holds Above US$3K Mark\n\nMeanwhile, the price of the second-largest crypto by market cap has remained steady at over US$3K (AU$4.5K) since the most recent overnight dip. The current price is a solid 6.4% increase from yesterday.\n\nEthereum (ETH), 1-day graph, source: CoinMarketCap\n\nThe price of ETH seems tied to any news around these funds, with many observers firmly expecting a launch without further delays. The odds of the funds being approved increased dramatically last month when the SEC dropped an investigation about ETH’s status as a security.\n\nPresident of ETF Store, Nate Geraci, said he would be shocked if these funds are not trading within the next two weeks, eyeing July 15 for the first trading day.\n\nWill be *shocked* if spot eth ETFs not trading w/in next 2 weeks…\n\n\n\nLater next week a possibility, but think week of July 15th more likely.\n\n\n\nInterestingly, price of eth ↓ 20%+ since \"surprise\" 19b-4 approvals in late May. — Nate Geraci (@NateGeraci) July 6, 2024\n\nOther Altcoin ETFs Next? Chances of Solana, Cardano and XRP\n\nWith the Ethereum ETFs done and dusted – going by the experts at least – the next likely candidates for a fund are probably Solana, Cardano and XRP. VanEck and 21Shares have applied for a US listing of these funds and there has been talk around Cardano and XRP to also get a listing.\n\nHowever, many observers are highly doubtful if any of this is happening in the near future. If President Joe Biden remains in office – which is still out in the open given his recent shaky public appearances – some believe any such request for a fund for SOL, XRP or ADA will be shot down.\n\nRelated: Defying Market Fears, Notcoin and Celestia Rally, with TIA Gaining 27%\n\nOthers are hopeful that if elected, self-proclaimed crypto-president Donald Trump could fix the broken relationship between the US-crypto sector and the US Government. Only time will tell whether that expectation will be fulfilled."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxPR0M2WTB5d2J0SEthNkg5Ymg3eS1vVWx5ZXlqdDN0RVdCNDI2WVZnc2Fab2ViZHFZaWhRa0JRTU9wMmlySlp4a1lrQUlJYnhDUTVRNGlyRVlCLWVGVmw5QlN0UnZhTFZCN2VVUDRvYzRwN1NSNFRoenlHRzJuajZuRm54Qkw0eVAwQVJhVUlDVE1CV0k0TzJSQ1VfZUtIN1NzX0ZVcWxOS29rVWZxcm9jeHNpNlVDZk1MTndJd19LeG1USnFGQ1hCclVsRlBMWWlPUWtEdzd3aTJMN182VHpxVy1kSmkzMFdoMU9QeklTX3NJSV84VnNhQWxpV3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrency Crash: Ethereum Down 15% This Week, MATIC Heading Towards 30 Cents, Investors Hedge With Rollblock As Price Soon To Jump - Techpoint Africa",
        "content": "With crypto markets in a serious slump the Ethereum ecosystem is grinding out new support levels. After a legendary run up from 2019-2021, the price of Ether ($ETH) has underperformed Bitcoin and most other majors. Investors are left wondering where the edge is today.\n\n\n\nL2 networks on Ethereum have led the slide downwards over the past weeks, with Polygon ($MATIC) settling last week at levels not seen since the bear market in 2022. With more losses expected in July, keen investors are turning to new protocols such as Rollblock ($RBLK) which is defying market conditions after raising more than $1Million and generating gains in excess of 55%!\n\nEthereum ($Eth) Struggles To Maintain Price Parity With Bitcoin\n\nDespite continued development of features and the switch to the ESG friendly Proof-of-Stake protocol, Ethereum ($ETH) has failed to keep pace with Bitcoin. It’s continued to underperform even with an upcoming ETF approval in the pipeline, slipping under the $3000 mark routinely over the past week.\n\n\n\nNew major networks such as Solana and The Open Network attract retail investors, while institutions continue to favor the stability and trust of the Bitcoin network. There appears to be no love for the middle as the jack-of-all trades Ethereum misses the mark with both speculators and long term capital allocation.\n\nPolygon ($Matic) Fails To Attract New Investors\n\nPolygon ($MATIC) blockchain was the first network built on top of Ethereum ($ETH). Designed to enable cheaper and faster transactions while maintaining the security of the base network, Polygon initially attracted investors looking for $ETH beta. This thesis has not played out the way they anticipated, with dozens of rollup networks now built on top of Ethereum, Polygon is struggling to remain relevant.\n\n\n\nPolygon has also failed to keep investor money on the protocol. With less than $1 billion of funds on the network after reaching a high of over $10 billion in 2021, the Polygon network appears to be largely forgotten by keen speculators. With a price of just 50 cents at the time of writing, Polygon is down over 80% from its bull market highs.\n\nRollblock ($RBLK) Soars Amid Market Declines\n\nHaving crossed the million-dollar mark in less than two months, Rollblock is becoming one of the markets most popular crypto presales. This highly lucrative project combines the best of DeFi innovations with traditional betting, offering a comprehensive experience not available elsewhere. The project uses blockchain and AI to offer greater security than traditional casinos, making it impossible to change bets once placed while recording all transactions on the blockchain.\n\nThe casino itself hosts over 150 games, including classics like roulette and slots, as well as digital games. These will soon be complemented by sports betting, which will let players place wagers on sports such as the NFL, NBA, soccer, golf, and more.\n\nTo support both users and investors, Rollblock has implemented a revenue share model that shares up to 30% of the platform's revenue with $RBLK token holders. To achieve this, Rollblock will use revenue to buy $RBLK from the open market. To create a deflationary effect, half of these tokens will be burned, and the remaining half will be allocated to staking rewards, where stakers can earn some of the highest APYs in the market.\n\nAnother key element of the Rollblock ecosystem is its ease of access. Unlike traditional casinos which require extensive background checks, Rollblock requires no KYC to get started. Instead, players can sign up using their email or cryptocurrency wallet. After signing up they can deposit over 20 major cryptocurrencies. This ease of access has sped up Rollblock adoption, with almost 5000 users signing up in Q2.\n\n\n\nRollblock is currently in the third stage of its presale, and $RBLK is selling for $0.0154. The token has already seen two price increases over the last week, and as a result thousands of investors are doubling down on what experts are calling the hottest presale of the year. As the project's momentum snowballs, analysts believe that 100x returns could be on the table.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNNXNmcDhHR3ZfdklXeExpOHpjQzVPeHFlOFNvZ0JLTExrMXlZVXhZM2ZfbU1KSTNaeWNweDNEU050ODlkVUlZbGtlM3VRcTJzMHVRbEtjTGhtYV9NY05jZjFVbGFNdmJIZ0VIeWlZdVkwNUo2Z3M5SnZNdXNHVWtOQmpKNEFoOC1xWktENkVGeHpkeFFPMzBFaERNWnZnb2NhWGRPQ19wOFlweWY2cXU0dVM3MWJvcFFOcnh3TzdSWHFRaFJHREV5M2lOVmU1eTZ2TFJzeFlTbkppSVRt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 10:10:51 GMT",
        "title": "News Explorer — Ethereum Foundation and Immunefi Launch a Security Audit Competition for the Protocol's Code - Decrypt",
        "content": "Jul 9, 9:31 am\n\nUnchained Crypto\n\nEthereum Foundation and Immunefi Launch a Security Audit Competition for the Protocol's Code\n\nThe Ethereum Foundation and Immunefi have launched the \"Attackathon,\" a security audit competition aimed at finding vulnerabilities in the Ethereum protocol's code. The event is open to developers and projects, with a reward pool initially seeded at $500,000 and a goal of raising over $2 million. Immunefi, which has facilitated bug bounty programs in the past, will handle the payment process and display the allocation of funds transparently."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPSml2ZkhlbGx1U3d0dFZ4NGQ0YlVTc2s2ZkNEcjZRdWx1OW84a01jLXFJQVc4VTVXLTEyN2xnZE02NFlubDNzeVNlRGxUcHBNZUlqWGo5WDB3WHdZOWtRVEhrTWI4cDJwZFR4cXduMHhPS2pfUzU0Y1V0Vk9DTVpScU1xVUVvM3JidDlKT2J0WWh4UDVKUHJqbng2VjYyb243eWozSVJST0dqb1VxN1RJbXlPMTJ0d9IBwwFBVV95cUxPXzNBMXAyMzhzdXdYY3dNeGtVMkJESFc2UDVYMlZoZnFwWnQyRWJKb1NRenY3ZUxZb2h4cmFfdTBCR2VEX19Dc0M0WVBqQnZpNHVNSmR3ZDhTRW4xNXF4dDc2UDhFajJweTB0cklPUjJvcElCM2JHVVlQRUVWNFZJQXZfSHZLaUNHYkxIcXVEbmZ0enN2djJLT08yMVhRYXlCX0RIeElEVXg1SGUwaVdLcS1fLVc4RFhmS3poNTdGaDVDRUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top 10 Most Popular Cryptocurrencies in July 2024 - Analytics Insight",
        "content": "Which crypto will boom in 2025?\n\nPredicting which cryptocurrencies will experience significant growth in 2025 involves analyzing current trends and technological advancements in the crypto market. Ethereum (ETH) is poised to maintain its upward trajectory with the ongoing development of Ethereum 2.0, enhancing scalability and energy efficiency, crucial for its dominance in decentralized applications (dApps) and DeFi.\n\nCardano (ADA) stands out for its focus on scalability and security, boosted by recent smart contract capabilities through the Alonzo upgrade, attracting developers and investors alike. Solana (SOL) continues to shine with its high-speed, low-cost blockchain, ideal for DeFi and NFT projects, fostering its adoption.\n\nPolkadot (DOT) offers innovative solutions for interoperability and scalability by connecting multiple blockchains, positioning it favorably for growth. These cryptocurrencies, driven by robust ecosystems and technological advancements, present strong potential for booming in 2025 amidst evolving market dynamics.\n\nWhich crypto is best to buy now?\n\nCurrently, Ethereum (ETH) stands out as a strong buy due to its recent transition to Ethereum 2.0, which enhances scalability and reduces energy consumption. Additionally, Solana (SOL) is gaining popularity for its high-speed, low-cost transactions, making it ideal for DeFi and NFT projects.\n\nCardano (ADA) is also noteworthy, thanks to its emphasis on security, scalability, and sustainability, coupled with its recent smart contract capabilities. These cryptocurrencies have robust ecosystems, technological advancements, and strong community support, making them promising investments for the present and the future.\n\nWhich crypto has 1000x potential?\n\nPolygon (MATIC) has the potential for significant growth due to its role as a layer-2 scaling solution for Ethereum, addressing critical scalability and transaction cost issues.\n\nWith increasing adoption in the decentralized finance (DeFi) space and partnerships with major projects, Polygon is well-positioned for explosive growth. Its ability to enhance Ethereum's functionality while maintaining security makes it a promising candidate for substantial returns, potentially reaching 1000x gains as the crypto market evolves.\n\nWhat is the most popular cryptocurrency?\n\nBitcoin (BTC) is the most popular cryptocurrency, recognized as the pioneer and leader in the crypto market. Launched in 2009 by the pseudonymous Satoshi Nakamoto, Bitcoin has the largest market capitalization and the highest daily trading volume. Its status as digital gold and a hedge against inflation makes it a favorite among both institutional and retail investors.\n\nBitcoin's widespread acceptance, security, and established reputation solidify its position as the most popular and influential cryptocurrency.\n\nWhat are the top 5 coins to invest in 2024?\n\nIn 2024, investors should consider allocating funds into Bitcoin (BTC), Ethereum (ETH), Cardano (ADA), Solana (SOL), and Polkadot (DOT) due to their strong market positions and promising developments. Bitcoin remains the leader in cryptocurrency, valued for its stability and store of value characteristics.\n\nEthereum's ongoing upgrade to Ethereum 2.0 enhances its scalability and utility for smart contracts, while Cardano focuses on scalability and sustainability, bolstered by recent advancements in smart contract capabilities.\n\nSolana stands out with its rapid transaction speeds and low costs, making it attractive for DeFi and NFT applications. Polkadot's innovative approach to interoperability offers seamless connectivity between diverse blockchains, enhancing its appeal for developers and investors seeking diversified blockchain solutions. These coins exhibit robust ecosystems and technological innovations, positioning them as top choices for potential growth and investment in 2024."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE80b1AwTnpmdm92a0pnczVQSDJld25tSS02TmNSMmk0N2lVWTZkT25vTms0d2V5ZkJoZTByNkxiMnhEQlVCc1dSeXNHYkpYOWUwUi1wdDFIQk8zaWJ5aWpGeEgzcWNVbmZvWWJIM2VlMVhkd9IBd0FVX3lxTE00b1dzUjV4NlB3aENFam1WWEFYVXk5eHNsUUlGVUhmdDhBOGp2eXpMeHZRM01ZOU9vTHRPVW1MdEUzaWViSDRjc25mdmRNUElwOEI2RTFwaDVMSVRua3J2SEk5YlVMU0pOalNhclBkZkcxMmh2T2hv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 03:29:56 GMT",
        "title": "Ethereum Price Targets Upside Break: Positive Indicators Light the Path - NewsBTC",
        "content": "Ethereum price seems to be aiming for a decent recovery. ETH could gain bullish momentum if there is a clear move above the $3,110 resistance.\n\nEthereum is slowly moving higher above the $3,000 level.\n\nThe price is trading above $3,000 and the 100-hourly Simple Moving Average.\n\nThere is a short-term declining channel or a bullish flag forming with resistance near $3,080 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above the $3,110 resistance.\n\nEthereum Price Eyes Steady Recovery\n\nEthereum price remained stable above the $2,880 support zone. ETH started a decent upward move and climbed above the $2,950 resistance, like Bitcoin. The price even cleared the $3,050 resistance before the bears emerged.\n\nThe pair tested the $3,120 resistance zone. A high was formed at $3,110 and the price is now consolidating gains. There was a minor decline below $3,080. The price declined below the 23.6% Fib retracement level of the upward move from the $2,895 swing low to the $3,110 high.\n\nEthereum is now trading above $3,000 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $3,080 level. There is also a short-term declining channel or a bullish flag forming with resistance near $3,080 on the hourly chart of ETH/USD.\n\nThe first major resistance is near the $3,110 level. The next major hurdle is near the $3,150 level. A close above the $3,150 level might send Ether toward the $3,220 resistance. The next key resistance is near $3,320. An upside break above the $3,320 resistance might send the price higher toward the $3,500 resistance zone.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,110 resistance, it could start another decline. Initial support on the downside is near $3,020. The first major support sits near the $2,975 zone and the 61.8% Fib retracement level of the upward move from the $2,895 swing low to the $3,110 high.\n\nA clear move below the $2,975 support might push the price toward $2,920. Any more losses might send the price toward the $2,820 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $2,975\n\nMajor Resistance Level – $3,110"
    }
]