[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1ZQ2ZDaTF6TXd4S2o0U05kREpJcG5NbWhzOTFjakN0OGlKWUFvRzd0Q1BQdVNyOXpUalZXZS1ZWVJDMnJvY0FBMFNueDhjUVYwNmIxN0pjUWgwalhud1plOU8tSGRUb3IyTl91WDFmdk9rcnhxVUI1WTdGU2ptTlnSAYQBQVVfeXFMTjRkSng5dkpVbG13a00zbG9LQWhLRjRhNTFsbTBDRnRDNVRlWkRaSmZJMUhsZG1sd1h3WFZILXNmOUFRWmdkVWcyalA2dG9zUGhHOWg1MjdSR2JydGpQMnFGRTU2bzc0ZFkyeFpmek9PWHk5RGRQbkEwS2JkNUh0dVpwZEZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 22:04:25 GMT",
        "title": "Ethereum Top 10 Whales Now Control 41 Million ETH, A Record - Bitcoinist",
        "content": "On-chain data shows the ten largest Ethereum whales have continued to expand their holdings recently, now carrying 41 million ETH.\n\nEthereum Top 10 Whales Have Set A New All-Time High For Their Holdings\n\nAccording to data from the on-chain analytics firm Santiment, the largest whale wallets have continued to display an optimistic pattern for the cryptocurrency. There are two indicators of interest here: the supply held by top exchange wallets and the supply held by top non-exchange wallets.\n\nThe former keeps track of the total amount of Ethereum that the ten largest wallets attached to centralized exchanges are holding right now. In comparison, the latter measures the amount sitting in the ten largest self-custodial wallets on the blockchain.\n\nBoth types of addresses would count as “whales,” but those attached to the exchanges would be more likely to control an entity like the platform itself rather than a “normal” investor, like a self-custodial wallet would most likely be.\n\nThe chart below shows how the Ethereum supply held by these two cohorts has changed over the past year.\n\nThe value of the two metrics have gone opposite ways in recent days | Source: Santiment on X\n\nThe graph shows that the supply held by the top ten whales outside exchanges has been constantly going up during the past year, while the addresses attached to exchanges have been rather up and down.\n\nGenerally, investors keep their coins inside self-custodial wallets whenever they want to hold onto them for extended periods. So, these off-exchange whales continuing to increase their supply is undoubtedly a positive sign for the cryptocurrency.\n\nAs is apparent from the chart, the supply of these whales has crossed the 41 million ETH mark following the latest continuation of the uptrend, which is a new all-time high.\n\nWhile this rise has come, the top ten Ethereum exchange wallets have seen a plunge instead, as they now hold just 8 million ETH, the lowest amount in about 24 weeks.\n\nA shift of supply towards self-custody is always a good sign for the health of the market, as bankruptcies like that of the FTX exchange already showed during this bear market what happens when central platforms like these go bust.\n\nThe less ETH that’s present on the exchanges, the less the price would be affected if they happen to go out of business. And that’s not all; the supply on exchanges can also be considered the available selling supply of ETH, which has also reduced with this drawdown.\n\nTherefore, this pattern of the self-custodial wallets growing in size while the exchanges lose coins is an encouraging development for the asset. Though while that may be true, supply concentrating on just ten wallets is still something negative, as these humongous entities now control one-third of the supply.\n\nETH Price\n\nAt the time of writing, Ethereum is trading just below the $2,100 mark, down 1% in the past week.\n\nETH has overall gone up during the past 24 hours | Source: ETHUSD on TradingView\n\nFeatured image from Vivek Kumar on Unsplash.com, charts from TradingView.com, Santiment.net"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1zaUEzcUg0VS1MR0tRM2VDY3BBZ3JZMVZySkpnQ0xIVHlILVZfTndIbTF2VldqTXZwcEhNMExMQ0xlOVZQbUJlMWdFX0R1VnNSWkVhVDM4OUJHREF1b3FkUHh2VUxuVjVSM2Uzb2JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 20:33:15 GMT",
        "title": "Ethereum validator and node growth leads to emissions decline: Report - Blockworks",
        "content": "The Ethereum network’s greenhouse gas emissions have dropped by an estimated 99.97% since its shift to proof-of-stake, despite a big rise in node count.\n\nThat’s according to new research by the Cambridge Centre for Alternative Finance. The organization has upped its crypto research effort after in April launching the Cambridge Blockchain Network Sustainability Index (CBNSI) — a measure that detailed Ethereum’s electricity consumption pre- and post-Merge.\n\nThe Ethereum network currently is responsible for 2.8 kilotonnes of carbon dioxide equivalent (KtCO 2 e) on an annualized basis, the CCAF said in a Friday report.\n\n“To contextualize, this would equate to the emissions from five round-trip airplane flights from London to New York, the annual energy consumption-related emissions of 450 UK households, or the annual carbon sequestration capacity of 270 acres of forest,” the report states.\n\nEthereum switched to a proof-of-stake consensus model in September 2022. The Ethereum Foundation had estimated the Merge would reduce the blockchain’s power consumption by 99.95%.\n\nRead more: Ethereum switches to proof-of-stake after 7 years of work\n\nBut electricity usage is only one piece of an environmental impact assessment, according to the Friday report.\n\nAdditional data was required to convert electricity consumption to greenhouse gas emissions. The CCAF used off-chain data from the peer-to-peer communication of Ethereum nodes to gather both electricity usage and the geolocational distribution of nodes.\n\nThe number of Ethereum validators has grown 57% since April 1, reaching 880,822. Ethereum nodes have grown to 14,072, reflecting a 23.2% increase over that span.\n\nThe network’s annual electricity consumption increased by 21.2% in those eight months, from 6.19 GWh to 7.50 GWh — roughly the annual electricity use of 2,000 English households, the Cambridge data shows.\n\nAs for where the nodes are, Europe and North America are home to 43.3% and 40.5% of them, respectively, following the Merge.\n\nSource: Cambridge Centre for Alternative Finance (CCAF)\n\nThe CCAF estimates pre-Merge greenhouse gas emissions were about 10.3 MCO 2 e. The latest post-Merge figure of 2.8 KtCO 2 e reflects a 99.97% drop despite a substantial increase in the number of Ethereum nodes, the report notes.\n\nThe network is now powered by nearly 48% sustainable energy — including 32% renewables and 16% nuclear — the CCAF estimates, with the remaining 52% coming from natural gas, coal-fired power, and oil.\n\nThe CCAF said it next looks to enhance its Cambridge Bitcoin Electricity Consumption Index (CBECI). Despite Ethereum’s shift to proof-of-stake, bitcoin’s proof-of-work consensus model is a cornerstone of its identity, the report acknowledges — making a similar transition “not as straightforward as it might appear at first glance.”\n\nThe research institute adds: “The narrative of Ethereum and Bitcoin’s different paths is not just a tale of technological advancements but also reflects different ideologies and priorities of their communities, highlighting the multifaceted complexity inherent in the evolution of leading blockchain networks.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNTzVHQVpvR3dnSXlVVmk2SDIzbVh6NDB2MHZETTFLdkJBd2hSNHR3b3gyMkpteGFGRkd6V2p3TTk0UlhqUld0NmdHRW91WVpnTXVNb3dyb05OTkhLQTdNN096bEVVMDFkNnJKR3JRSDdUWWpBT1RPSlV0bEVCMldSLXpMbTNMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Vitalik is the public intellectual the tech world needs right now - Fortune",
        "content": "Vitalik Buterin is best known for creating the world’s second-most-valuable blockchain, Ethereum, when he was just 19 years old. In the past few years, though, Buterin’s influence has expanded well beyond the world of crypto and into the broader realm of ideas where the young polymath—who taught himself Mandarin while traveling the world—offers important treatises on technology and the future.\n\nThe latest example is a 10,000-word essay Buterin published this week titled “My techno-optimism.” It’s a response to the much-discussed “manifesto” with a similar title by the influential venture capitalist Marc Andreessen. Buterin’s piece endorses many elements of the manifesto, including an affirmation that technology has delivered marvelous benefits to humanity, and that fear and overzealous regulation have limited progress in fields like biotech. But while he endorses a foot-on-the-gas approach, especially to solve the climate change crisis, Buterin also calls for a more cautious approach when it comes to AI.\n\nWhile the Ethereum creator has long been a leading thinker in computer science, he has also become one in the governance of technology and society. Here is Buterin on the crack-up at OpenAI and the problem of putting guardrails on technology by means of small councils of elite decision-makers:\n\n“[It was] a well-intentioned effort to balance the need to make a profit to satisfy investors who provide the initial capital with the desire to have a check-and-balance to push against moves that risk OpenAI blowing up the world. In practice, however, their recent attempt to fire Sam Altman makes the structure seem like an abject failure: It centralized power in an undemocratic and unaccountable board of five people, who made key decisions based on secret information and refused to give any details on their reasoning until employees threatened to quit en masse.”\n\nDrawing on his experience in trying to build decentralized communities in the Ethereum realm, Buterin provides new and important insights into how to think about AI—including how to avoid the very real possibility that humans end up as pets to machine overlords. He is, of course, hardly the only one with big ideas about the future of technology. But what makes Buterin stand apart is his deep capacity for empathy and lack of ego.\n\nUnlike Andreessen and Balaji Srinivasan—another tech genius whose ideas carry a lot of weight in the debate over technology—Buterin doesn’t have contempt for those who disagree with him, and he doesn’t frame the debate in the shrill us-versus-them tone of the venture capital elite.\n\n“I believe that these [technologies] are deeply good, and that expanding humanity’s reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” he writes. In a troubled moment where too many people are consumed with fear and negativity, it is welcome to read a tech genius who relies on empathetic persuasion. If you want a shorter and more approachable window into Buterin’s worldview, you can also check out this new Fortune Q&A, which includes the moral case for supporting Ukraine and the fascinating sci-fi realm of the popular book and film The Three Body Problem. Have a great weekend.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBitcoin bulls are predicting the currency, which is up around 130% in 2023, will end the year at $40,000 even as it has struggled to maintain a consistent foothold above $38,000. (Bloomberg)\n\nRep. Tom Emmer (R-Minn.), a GOP House leader, warned about a legal framework for stablecoins based around CBDCs that he says could “swallow up” crypto in a “surveillance security state.” (Fortune)\n\nPolygon secretly gave preferential status to Draft Kings in the form of millions of dollars’ worth of subsidies to a validator run by the sports betting site—an effort that is now kaput. (CoinDesk)\n\nA new survey of the Bitcoin mining industry raises concerns about its use of water, which it claims is about equal to the annual consumption of Washington, D.C. (The Verge)\n\nAmid a broader reckoning in the VC industry, Tiger Global slashed valuations in its venture fund, including markdowns of 94% to OpenSea and 64% to Bored Ape Yacht Club. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nOne version of the future:"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNTzVHQVpvR3dnSXlVVmk2SDIzbVh6NDB2MHZETTFLdkJBd2hSNHR3b3gyMkpteGFGRkd6V2p3TTk0UlhqUld0NmdHRW91WVpnTXVNb3dyb05OTkhLQTdNN096bEVVMDFkNnJKR3JRSDdUWWpBT1RPSlV0bEVCMldSLXpMbTNMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Vitalik is the public intellectual the tech world needs right now - Fortune",
        "content": "Vitalik Buterin is best known for creating the world’s second-most-valuable blockchain, Ethereum, when he was just 19 years old. In the past few years, though, Buterin’s influence has expanded well beyond the world of crypto and into the broader realm of ideas where the young polymath—who taught himself Mandarin while traveling the world—offers important treatises on technology and the future.\n\nThe latest example is a 10,000-word essay Buterin published this week titled “My techno-optimism.” It’s a response to the much-discussed “manifesto” with a similar title by the influential venture capitalist Marc Andreessen. Buterin’s piece endorses many elements of the manifesto, including an affirmation that technology has delivered marvelous benefits to humanity, and that fear and overzealous regulation have limited progress in fields like biotech. But while he endorses a foot-on-the-gas approach, especially to solve the climate change crisis, Buterin also calls for a more cautious approach when it comes to AI.\n\nWhile the Ethereum creator has long been a leading thinker in computer science, he has also become one in the governance of technology and society. Here is Buterin on the crack-up at OpenAI and the problem of putting guardrails on technology by means of small councils of elite decision-makers:\n\n“[It was] a well-intentioned effort to balance the need to make a profit to satisfy investors who provide the initial capital with the desire to have a check-and-balance to push against moves that risk OpenAI blowing up the world. In practice, however, their recent attempt to fire Sam Altman makes the structure seem like an abject failure: It centralized power in an undemocratic and unaccountable board of five people, who made key decisions based on secret information and refused to give any details on their reasoning until employees threatened to quit en masse.”\n\nDrawing on his experience in trying to build decentralized communities in the Ethereum realm, Buterin provides new and important insights into how to think about AI—including how to avoid the very real possibility that humans end up as pets to machine overlords. He is, of course, hardly the only one with big ideas about the future of technology. But what makes Buterin stand apart is his deep capacity for empathy and lack of ego.\n\nUnlike Andreessen and Balaji Srinivasan—another tech genius whose ideas carry a lot of weight in the debate over technology—Buterin doesn’t have contempt for those who disagree with him, and he doesn’t frame the debate in the shrill us-versus-them tone of the venture capital elite.\n\n“I believe that these [technologies] are deeply good, and that expanding humanity’s reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” he writes. In a troubled moment where too many people are consumed with fear and negativity, it is welcome to read a tech genius who relies on empathetic persuasion. If you want a shorter and more approachable window into Buterin’s worldview, you can also check out this new Fortune Q&A, which includes the moral case for supporting Ukraine and the fascinating sci-fi realm of the popular book and film The Three Body Problem. Have a great weekend.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBitcoin bulls are predicting the currency, which is up around 130% in 2023, will end the year at $40,000 even as it has struggled to maintain a consistent foothold above $38,000. (Bloomberg)\n\nRep. Tom Emmer (R-Minn.), a GOP House leader, warned about a legal framework for stablecoins based around CBDCs that he says could “swallow up” crypto in a “surveillance security state.” (Fortune)\n\nPolygon secretly gave preferential status to Draft Kings in the form of millions of dollars’ worth of subsidies to a validator run by the sports betting site—an effort that is now kaput. (CoinDesk)\n\nA new survey of the Bitcoin mining industry raises concerns about its use of water, which it claims is about equal to the annual consumption of Washington, D.C. (The Verge)\n\nAmid a broader reckoning in the VC industry, Tiger Global slashed valuations in its venture fund, including markdowns of 94% to OpenSea and 64% to Bored Ape Yacht Club. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nOne version of the future:"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxObTVPMV92NC1pUXEyT2FlS3pWWHRnazE4RUtTWjB3cG53WUpqdWlqU09aVm1Wam1Gd1llYkg2YWxmSlF2WmI2UGdtLVlmRkk5UlE4b3lWLWdvOTcwV3l6S2ppcHdHR3FaY0x0RUx5U3lfbUhSQmlsVVNEVG1aQW5ETmtCT1JPTnA1OGJCTVZjX0FpMDJqOW5tVnZORmFUSmpPczdtUV9iNzFIc3h0clFr0gG0AUFVX3lxTE10QzktRTBZX2N0LUJvZ0YtR1RacTJqeVFEa0JtYUhYNlVpVzk3LWFlOVlZWTlUZ2JEbUlCOFdVTkxnWFhWSS1CajZ3M2JWZWNHT1BlNFBnN3pNZzQ5cVFhcTUzUDVJYi1hM2xtczVxRk5TQ29vaHNtckpuUEFpVHJBM3FxVjJTclpILTF3OWNBM2JaTUg5bmVrVXk1UUtpSV9LeDhTUHY2Ql9yNWptbkxrTVNSVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Beyond Ethereum: Unveiling the Potential of Innovative Blockchain Ecosystems - Coinpedia Fintech News",
        "content": "Sara is steadily working on cryptocurrency evaluations, news, and fluctuations in digital currency prices. She is guest author associated with many cryptocurrencies admin and contributes as an active guide to readers about recent updates on virtual currencies.\n\nOver the past decade, Ethereum has established itself as the leading blockchain platform, revolutionizing the world with its bright concept of decentralized applications (dApps) and smart contracts. However, as the blockchain industry continues to evolve, new and innovative ecosystems are emerging, challenging Ethereum’s dominance. In this article, we will explore the rise of these alternative blockchain ecosystems and shed light on the Ultima ecosystem, which stands out as a prime example of innovation and potential.\n\nEthereum’s Strengths and Limitations\n\nThere’s no denying Ethereum’s groundbreaking contributions to the blockchain industry. With its robust smart contract capabilities, Ethereum has enabled the creation of a vast ecosystem of dApps and DeFi protocols. However, Ethereum has faced significant challenges, particularly in terms of scalability and high gas fees. As the demand for dApps and DeFi projects grew, Ethereum’s network congestion became apparent, leading to slower transaction times and exorbitant fees.\n\nThese limitations have impacted the user experience and hindered the scalability of the Ethereum ecosystem. Additionally, the switch to staking, while promising in theory, has raised questions about whether it has truly lived up to users’ expectations and the actual rewards it offers.\n\nThe Emergence of New Blockchains\n\nAs Ethereum grapples with its limitations, alternative blockchains have emerged, aiming to provide solutions and compete for market share. Binance Smart Chain, Solana, and Polkadot are a few examples of these rising stars challenging Ethereum’s dominance and aiming to provide solutions to the scalability and cost issues.\n\nHowever, among these alternatives, the Ultima ecosystem has garnered attention for its unique offerings and outstanding features. Ultima is building a comprehensive ecosystem of blockchain products and introduces the DeFi-U platform, which aims to revolutionize decentralized finance and provide users with a seamless and efficient experience.\n\nUltima: The Innovative Blockchain Ecosystem\n\nAt the heart of the Ultima ecosystem lies a commitment to innovation and cutting-edge technology. Compared to Ethereum, Ultima boasts faster transaction processing of the Smart Blockchain it is built on, setting new parameters for speed and efficiency. Additionally, the ecosystem offers lower transaction costs, making it more cost-effective for users to engage in various activities.\n\nULTIMA, the native token of the Ultima ecosystem, implements a halving mechanism to increase its scarcity and value. This strategy reduces the rate of new tokens entering the market by half every 10,000,000 blocks, ensuring a controlled supply and preventing inflation. Currently, slightly over 50 ULTIMA tokens are coming off the block daily. In 2024, this number will decrease to 25, and by 2028, the daily supply will reach just 1 token, introducing scarcity and potentially driving up the token’s value over time.\n\nThis scarcity-focused approach encourages early adoption and creates a sense of urgency for participants to engage with the platform and acquire ULTIMA tokens. Early adopters and long-term holders of ULTIMA tokens can benefit from potential price appreciation and access to ecosystem advantages. Ultima has plans to expand the ecosystem with future products such as a crowdfunding platform, marketplace, cryptocurrency debit card, UltimEx cryptocurrency exchange, and Ultima Travel Club. These additions aim to make the Ultima ecosystem comprehensive for its user base, which already exceeds 3 million users worldwide.\n\nUltima’s flagship product, DeFi-U, is a delegated liquidity pool that allows users to activate profit in ULTIMA tokens. The splitting mechanics of rewards distribution offers split licenses for lifelong benefits in ULTIMA tokens through blockchain technology and smart contracts, allowing both experienced and new users to engage directly with blockchain technology. Unlike Ethereum’s complex staking process, splitting simplifies participation, attracting a wider user base and promoting active ecosystem engagement.\n\nWhat’s Wrong with Staking?\n\nEthereum, which initially operated on a Proof of Work (PoW) consensus mechanism similar to Bitcoin, has since transitioned to a Proof of Stake (PoS) mechanism following the Ethereum 2.0 upgrade, also known as the “Merge.” This update has been eagerly awaited and discussed for a long time because it raised a lot of hopes.\n\nHowever, as time went on, there occurred some challenges associated with staking. One of the main reasons why the tech hasn’t become massively adopted was its complexity, for staking requires users to lock their tokens directly on the blockchain with operators or validators.\n\nStaking tokens can be risky due to factors like slashing and penalties, client software bugs, and unstaking periods. Trustworthiness is crucial when choosing a validator, and different teams should be used to maintain the software. The bear market has negatively impacted public perception of staking, making it essential to choose trustworthy and reliable validators.\n\nWhy Splitting Is Better Than Staking\n\nThe splitting technology offered by Ultima presents several advantages over traditional staking mechanisms, which may make it more appealing to both experienced cryptocurrency enthusiasts and newcomers. Here’s a detailed comparison of why splitting could be considered better than staking:\n\nAccessibility and Ease of Use: Traditional staking often requires a certain level of technical knowledge and understanding of blockchain technology. Ultima’s splitting tech is more appealing to both experienced and newcomers. It simplifies the process by allowing users to acquire SPLIT tokens via a license and smart contract, making it more accessible to the average person without technical expertise.\n\nLiquidity Concerns: Staked tokens are often locked up for a certain period, reducing liquidity and limiting users’ ability to respond to market movements. With splitting, daily rewards in ULTIMA tokens are claimable after 24 hours, offering more flexibility and potentially higher liquidity.\n\nPrice Volatility: Cryptocurrency markets are known for their volatility. Staking rewards are typically in the form of the native token, whose value can fluctuate widely. In the case of splitting, the combination of a halving mechanism with a limited supply of ULTIMA tokens is designed to potentially increase token value over time, which could offer a more stable reward system.\n\nLongevity of Rewards: With splitting, users receive daily rewards for the rest of their lives as long as they hold SPLIT tokens in their Smart Wallets. This model provides a clear, long-term benefit structure, whereas staking rewards may vary based on changes in protocol rules or tokenomics.\n\nCommunity Growth and Token Scarcity: The Ultima ecosystem is designed to grow with its community, and as more people use ULTIMA tokens, the market supply decreases due to the halving mechanism and limited token supply. This could potentially drive up prices and make rewards more valuable over time, benefiting early adopters and consistent participants.\n\nExpanding Horizons: Shaping the DeFi Landscape\n\nAs the blockchain space continues to mature, new ecosystems are emerging, challenging Ethereum’s dominance and offering innovative features and solutions. The rise of innovative blockchain ecosystems, such as Ultima, showcases the potential beyond Ethereum. With its cutting-edge technology, user-centric approach, and unique advantages, Ultima is poised to shape the future of decentralized finance, providing users with a more accessible, secure, and efficient DeFi experience. As the blockchain landscape continues to evolve, embracing these innovative ecosystems will unlock new opportunities and possibilities for individuals and the broader blockchain community."
    }
]