[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNZXJPd2otV3RCRDlyMGkyTE5YMmRSYnh0ZzFPY0NhODVYa3FwNjBBZWY3T2ZQYWJpZVM3MTc5Qi1yTEF3cWEyOGt5OVo1U3F0VHlyZTYyRHBLVUl1RUR6dmxRakI0NTBLOUdXbGN0THkxMnBnazMweTJYdjlyZlphbGtrLUltNEozM1otUE9RV2VrZ01QVFF3U3lGcEdiSVpkUzgyVEsxTnAtVTjSAbABQVVfeXFMTm5pb1ZEbXVJNDlpeFlXcWtJSTlwcTI0dkxEX0ZEc0YzMXk1Vkp5dTFNYW1xaVhPaW9fYmtIR19fNDFvTW16UlBqWFlhUTdySzNuaUo0ZV9iLWJSMzBUdk1HRWtGUGl3MDdCcV9RaVNRcDk0MjNGdmV1Y0dvallTNldkX2FXQTFVaHN2amNwMG1WLXRmTjJLMHJxbFVqblJFOEZRQUdMZGczU2tsamJMb2o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Important Binance Announcement Affecting Bitcoin (Bitcoin) and Ethereum (ETH) Traders - CryptoPotato",
        "content": "TL;DR\n\nBinance Withdraws Ruble Pairs: Binance is ending support for several P2P trading pairs with the Russian ruble, including BTC/RUB and ETH/RUB, effective January 31, 2024, following its exit from the Russian market. Transition Options for Users: Russian users can switch to CommEX for continued ruble trading or use Binance’s options for withdrawing or converting rubles before the deadline. New Listings and Margin Trading: Binance added new tokens like PIVX and trading pairs to its Margin Trading program, allowing leveraged trades with higher profit and risk potential.\n\nBinance to Exit Russia\n\nThe world’s largest cryptocurrency exchange by market capitalization – Binance – announced it will no longer support certain P2P trading pairs tied to Russia’s national currency – the ruble.\n\nThose pairs include BTC/RUB, ETH/RUB, USDT/RUB, BNB/RUB, FDUSD/RUB, BUSD/RUB, and RUB/RUB, as the amendments are scheduled to take effect from January 31, 2024.\n\nBinance’s move follows the previous decision to exit the Russian market by selling the entirety of its local business to the crypto platform CommEX.\n\n“Therefore, users can continue P2P trading with Russian ruble (RUB) free of charge on the CommEX platform,” the exchange explained.\n\nThose willing to jump on board need to register with a CommEX account and connect it to the corresponding Binance one. Alternatively, clients have the option to withdraw their Russian rubles via Binance’s fiat partners before January 31, 2024, convert RUB into digital assets, or trade RUB for crypto on the Binance Spot market.\n\nBinance’s Latest Listing\n\nBesides removing certain trading pairs, the leading marketplace has expanded some its offerings with more tokens.\n\nLast week, it added PIVX (PIVX) as a new borrowable digital asset on Cross Margin and Isolated Margin. It also included ADA/FDUSD and DOGE/FDUSD, among other trading pairs, in its Isolated Margin program.\n\nBinance Margin Trading allows eligible clients access to funds from the exchange for use in leveraged trades. Thus, traders can deal with greater sums and adjust their positions appropriately.\n\nIt is worth mentioning that margin trading could bring greater profits in the case of successful trades. Nonetheless, it could lead to more significant losses if the market moves in the opposite direction."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9kbE45Q19iZEdLVHMyTUsyWFdTQWVpT1E2NlNiSkJaZUp0UHNrX1VuaW5sRFhNSU5TdF9lUFpTU1o5QjQzQnRiQTNudFdXUXB3enJucUg5T2gzR3ZNSG96TUs4VmgtenNsS0hGQklxb1Z4U09KcW930gF_QVVfeXFMUGxUZ0otM0ZiSEdUc1ZsbWRWNFpHbXdRdW1BbUt1RzNzZ3lhNGdxM1JFRzJzUllmeENhT2IybmxWb2NPWVR2QWkyWHJobEJ0dEZ5VEk1WUJGaDQ0alk1T0l3QTZNN2VsQjZFY19aS09DQzZ1Q0JlbmJlNXdIVFlDaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Dip 7% as Crypto Markets Cool - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin fell below $41,000 and Ethereum below $2,200 on Monday as crypto markets took a dive after having rallied for the better part of two months.\n\nBitcoin is currently trading at $40,758, down 7% in the past day. This is after the market already saw $330 million in crypto futures contracts liquidated on Monday morning as BTC fell below $43,000. Total liquidations have now reached $516 million, according to CoinGlass.\n\nStill, the 1-day dip is relative. It's still 5% higher than it was at the start of the month, when BTC was changing hands for $38,688. The same can be said of Ethereum, which has lost 7% since yesterday and is currently trading for $2,185. That's 7% higher than what it started the month at, according to CoinGecko.\n\nThe global crypto market capitalization, which has hovered around $1 trillion for the better part of the year, now sits at $1.6 trillion—down 6% since yesterday.\n\nAD\n\nAD\n\nElsewhere in the market, alts were taking a beating. ORDI (ORDI), which last week saw explosive growth and set an all-time high of $68.37, has slumped 14% in the past day. The token, easily the most popular BRC-20 token built on Bitcoin’s Ordinals protocol, is now trading for $45.11.\n\nPepecoin (PEPE), which last week jumped 26% during a spike in meme coin activity, has also cooled off. As of this writing, it has fallen 13% in the last day and is trading for $0.00000138.\n\nEven as the some of the largest digital assets by market cap take a hit, there's been good news for some alts.\n\nA new report from digital asset manager CoinShares finds that institutional investors have been especially keen on Solana (SOL) and Avalanche (AVAX). Exchange-traded products meant to track the two coins saw $5 million worth of deposits last week. And while most of the gaming token category went red on Monday, Immutable (IMX) saw a 10% gain.\n\nAD\n\nAD\n\nMeanwhile, Binance USD (BUSD)—a dollar-pegged stablecoin—lost its peg for a while on Monday. As of this writing, BUSD had dropped as low as $0.97, according to CoinGecko. Even though it's a defunct stablecoin, there are still roughly 1.4 billion of the tokens in circulation.\n\nOne possible reason for the price turbulence: Most BUSD margin trading and futures contracts were automatically closed today, according to a Binance blog post.\n\nBUSD has been on a steady decline since the SEC sent a Wells Notice to New York-based firm Paxos, which used to handle minting and redemptions of BUSD on behalf of crypto exchange Binance. In the aftermath, Paxos and Binance said that users could continue to redeem their tokens until February 2024.\n\nThe exchange said BUSD tokens that aren't redeemed before Binance stops support will automatically be converted to FDUSD, a stablecoin issued by FD121 Ltd.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxNaEMyWERtLVlNNkhQR1JadzlRQW9zVnFiSFdWOUVKa2dZRm9SMG1XVEltNHVZZ3k3Zkw4dEYtSDB2MWd4ekhlNU1xbzk2V1VGZ3dVMVpIZE42VDlpRkc0MEtmY0k4UmdONE1lVzdCWEMxTWpQdkhwNjJYZE9mT1NBNVkwcWtCdFV2VzY4elo4dUdVQUVPYjJMd21QbHh3dnhpUWpXdWRlbUpXN3BaZmdiWk9GT0ZCbmVwSFppM0JCaEdPdW1UTzFxeDg4UzZnWWhIZjVLWFY0VDZQOFlaejFTUUtMbXROaWhCcU5qQmhlVXdkWE3SAfgBQVVfeXFMUGF1NnhIZEg5aUs4WnV6dWpDazJwVUlNSlZZRkljVXZwSlY1cVo1bEQxZ1dveGxZd09IWmV4S3pZNUg5UUt0bkNpM3lOWGwyU0ZfR0hyeng3RXFMWDBXcnpEZDk3ZjRIUUpZQWExREFPWG92VWhPNjhEZmdWTUFrcjNCVzlIeUZISlBjRjZJb0E0bkJyNXV6OWtnbm95THd5OXRTUElhNVdHWU1rN0FRb2ZfbGNKdWNlNThQZllZLVF4Tml5QkIxd3pLamZrTDlwV3lHaXh2RndDNjUtSUh2UGNMamU4Zl84bGVYc1BtTm5Vc2JUUDNzR2Y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Tailwinds abound for BTC as Google suggests ETF readiness - FXStreet",
        "content": "Bitcoin price could lose critical support at $40,000 as RSI confirms BTC is ripe for selling.\n\nEthereum price clings firm to the uptrend and records a healthy pullback as $2,147 support continues to hold.\n\nRipple price risks an extended 7% fall to the $0.5773 support level as XRP bulls show weakness.\n\nBitcoin (BTC) price remains bullish despite the catastrophic setback recorded during the early trading hours of the Asian session. While several other narratives support the big-picture bullish outlook, spot exchange-traded funds (ETFs) have a role to play in it.\n\nAs traders and investors continue to anticipate the US Securities and Exchange Commission (SEC) giving approvals for the product launches between January 5 and 10, even Google has taken a hint. An official announcement reveals that \"advertisers offering Cryptocurrency Coin Trust targeting the United States [will be allowed] to advertise those products and services\" beginning January 29, 2024. Notably, this is the same month that spot Bitcoin exchange-traded funds (ETFs) are expected to gain approval in the US.\n\nBitcoin price delivers a healthy retest\n\nBitcoin (BTC) price folding back to record an intra-day low of $40,400 was a healthy retest as the $40,000 psychological level continues to hold as support. If the level holds, then it could precipitate the idea that new all-time highs are in the cards.\n\nMeanwhile, the upside potential remains strong for Bitcoin price as BTC is still not ripe for selling until the Relative Strength Index (RSI) crosses below the 70 level. With the Awesome Oscillator (AO) showing large volumes of green histogram bars, the bulls still maintain a strong presence in the market though. The RSI could simply hold above 70.\n\nIncreased buying pressure above current levels could see Bitcoin price overcome the weekly supply zone extending from $40,698 to $46,999. A weekly candlestick close above the $43,860 mean threshold would confirm the continuation of the primary trend.\n\nSuch a move would set the tone for Bitcoin price to flip the supply zone into a bullish breaker, confirmed by a move above the $48,725 resistance level.In a highly bullish case, Bitcoin price could extend to tag the $66,098 resistance level into a support floor.\n\nBTC/USDT 1-week chart\n\nConversely, if the weekly supply zone defends as a resistance order block, Bitcoin price could pull south, losing the support at $40,000. A decisive weekly candlestick close below this level would put BTC on the cliff, potentially rolling over to the $30,000 psychological level.\n\nAlso Read: Bitcoin braces for volatility-filled week with November CPI data release, Fed decision\n\nEthereum price sell-off threatens upside potential\n\nEthereum (ETH) price also crashed alongside Bitcoin, losing almost 9% in market value. However, the move remains a healthy pullback as the $2,147 support level did not break. As long as ETH remains above the $2,000 psychological level, the upside potential remains alive.\n\nIncreased buying pressure could see Ethereum price clear the $2,403 range high even as it continues to consolidate within the confines of an ascending parallel channel.\n\nETH/USDT 1-day chart\n\nOn the flipside, increased seller momentum could plunge Ethereum price out of the bullish chart pattern, confirmed by a break and close below critical $2,147 support. ETH might then confirm the continuation of the fall by breaking and closing below the midline of the supply zone turned bullish breaker at $2,075. The move could clear the path for the largest altcoin by market capitalization to spiral to the $2,000 psychological level.\n\nAlso Read: Ethereum leads altcoins north as Bitcoin halts amid bull trap fears"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNTko1bEhRTV9YWWhKakgxZE1LTE1qaUZTZXJWYWx3NzRZNTRuSmFmUmtYV3p3aWNXMnI2MnF3X3RXWUdzWDBVTjJIVC1kcl9ObF9mR0JzSEF6YXVpZXhFbXZBaWVrUjQwR1FHZS1EZlJhU1pwQzNhNVlDRlJHOG4zRHBCUldKaGRzeWJWNFpQUzk3MVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum prices cool off, traders bullish on this altcoin - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nAfter a euphoric week, leading cryptocurrencies Bitcoin (BTC) and Ethereum (ETH) ended Sunday in the red, and selling continued to this week’s open. Currently, Bitcoin is trading at $42.1K, down 4.07% today, while Ethereum is at $2.23K, down 4.87%.\n\nHowever, traders continue to rally behind Bitcoin ETF Token as its presale surges toward $3.5 million.\n\nMarket overconfidence corrected, but analysts fear another flush\n\nWarning signs of a steep correction have been everywhere over the past few days. Many analysts urged market participants to proceed cautiously, but some believe another flush is imminent even after the recent correction.\n\nCoinMarketCap’s Crypto Fear and Greed Index entered the “extreme greed” zone, indicating that the market may be overbought. This represents a high-risk time for new buyers to enter the market, as a selloff is necessary to restore balance.\n\nMeanwhile, crypto funding rates recently reached a local high. This indicates significantly more long orders than short orders in the market, causing bulls to pay a premium to rebalance.\n\nHigh funding rates are often followed by a “flush,” where futures positions are forcibly closed, causing prices to cascade in the opposite direction.\n\nYou might also like: Will Bitcoin ETFs follow gold ETFs’ path to success?\n\nThis was highlighted by the analyst Mister Crypto, who suggested that Bitcoin’s high funding rates were “signaling a top.”\n\nIn the analysis, Mister Crypto noted that Bitcoin’s price retraced by 20% each time its funding rates reached their recent levels.\n\nGiven Bitcoin has pulled back less than 5% so far, this could indicate a much deeper correction is imminent.\n\nMeanwhile, prominent X commentator MrChief predicts that the market will “pullback enough to stop out early buyers & get bears super excited then reverse back up.”\n\nHowever, other analysts believe the crypto market may be poised for a longer-term pullback. One is RektCapital, who referenced earlier market cycles’ price action to suggest that “the Bitcoin Pre-Halving top may be very close.”\n\nThat said, the Bitcoin halving is just 137 days away and spot Bitcoin ETFs are on the cusp of approval by the Securities and Exchange Commission (SEC). As such, the market looks poised for a solid mid-term trajectory.\n\nEven so, market participants seeking growth appear to be considering Bitcoin ETF Token whose presale is in progress.\n\nBitcoin ETF Token presale raises $3.4 million in 1 month\n\nBitcoin ETF Token has raised almost $3.5 million in one month. The project features multiple use cases, rewarding holders as the SEC approves spot Bitcoin ETFs.\n\nThe project features a deflationary mechanism. 25% of its supply is reserved to be burned across five Bitcoin ETF milestones.\n\nAdditionally, there is a 5% burn tax on transactions, reducing by 1% at each target.\n\nThese scarcity-focused features, combined with the anticipated $1 trillion in liquidity entering the crypto market from the Bitcoin ETFs, could support Bitcoin ETF Token.\n\nYou might also like: Bitcoin breaks above $40k, Bitcoin ETF Token raises nearly $2.5m\n\nFurther supporting this is the project’s current early stage and low market cap at launch of just $12.39 million.\n\nBitcoin ETF Token also has a staking mechanism, offering a 79% APY. Even so, this will decrease as more tokens are staked, incentivizing buyers to get in early to maximize their gains.\n\nThe project also offers a Bitcoin ETF Alerts service. This is a news feed that pulls latest Bitcoin updates from around the web into one place. The feature aims to foster a more active and engaged community.\n\nVisit Bitcoin ETF Token Presale"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQNGhIWktCTG9SWGJORXFka2EyWmRtUmdKVDdfU2dtRGxadjE2SGMxSUV0X1U1QTBDS0lGdkpXeXR2MUxCOXdlcjdsZWNOTHAtSG1DamhMVHQxU1hTYlJObldCR1g4Nm5JNjVYLVRNSGlQSlNQalN5OHRFcjVSZklBMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Ethereum faces a moment of truth with latest crypto rally - Fortune",
        "content": "In early December, the sudden popularity of a new species of NFT called Buterin Cards led Ethereum gas fees—the cost to carry out a transaction on the blockchain—to briefly soar to around $10. Even though the fees soon fell back to around $1, the episode was an unpleasant reminder of earlier crypto booms when Ethereum became practically unusable just as it was soaring in popularity. This famously occurred with the arrival of an early NFT package known as Crypto Kitties in 2017, and with the massive speculative frenzy of the 2021 crypto bubble.\n\nDuring those earlier episodes, Ethereum boosters begged for understanding since the blockchain, which was the first to popularize smart contracts, was still a new technology. The crypto world was largely understanding since growing pains for a project of this scale are inevitable, and due to the specific challenge of the “blockchain trilemma”—an axiom that says it is easy to build for two of the three qualities of speed, security, and decentralization but not all three. As we appear to be entering a new crypto bull market, though, it’s not clear if people will be as patient.\n\nThe frustration around gas fees is partly a financial one—no one likes to pay more than they expect. But it’s also rooted in a philosophical disconnect: The promise of Ethereum is that it’s supposed to be a cheaper and safer technology than the conventional financial system. The reality for many people who first try Ethereum, however, is that the proposed gas cost exceeds the cost of the underlying transaction.\n\nI asked Paul Brody, an Ernst & Young executive who has written a well-reviewed book titled Ethereum for Business, to see if he is concerned that the blockchain’s ongoing gas headaches might mean it is running out of time to prove it is ready for primetime. He told me he is not, pointing to the flourishing layer-2 ecosystem, which lets users carry out the bulk of transactions on auxiliary blockchains like Optimism at a fraction of the cost. Those transactions are then bundled up and stamped on the main Ethereum blockchain, providing the same immutable record.\n\nLayer-2 technology has indeed grown by leaps and bounds since 2021, spurred in part by Ethereum’s successful switch to a proof-of-stake model for its blockchain, and costs on the side chains are far lower. But as I pointed to Brody, the experience of using a layer-2 chain is still clumsy and complicated, and off-putting to nontechnical people.\n\nBrody acknowledged that the L2 experience remains “absolutely horrible” but says this is only a temporary situation, and that it won’t be long until it becomes abstracted away with better designs. Meanwhile, he added that Ethereum remains the dominant smart contract for companies by an order of magnitude, and that this growth will only continue—a refutation of claims by Solana and other rivals that tout their lower gas costs as proof they can replace Ethereum.\n\nFor now, Brody appears right that Ethereum remains in the pole position when it comes to being the world’s go-to smart contract platform. That said, if the next crypto boom is once again defined by eye-popping Ethereum fees, patience will begin to run out.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe SEC asked a Washington, D.C., court to incorporate admissions included in Binance's recent settlement with the DOJ, claiming they strengthen its ongoing case. (Bloomberg)\n\nPudgy Penguins, a rare recent NFT success story that includes the sale of stuffed characters in Walmart, announced it will soon launch an interactive digital world. (CoinDesk)\n\nIn a possible sign of an effort to be more conciliatory with regulators, Tether says it is freezing the wallets of individuals sanctioned by U.S. financial crimes watchdog OFAC. (The Block)\n\nThe departure of one-time fixtures of the crypto world like Sam Bankman-Fried and Changpeng Zhao has led some to see a \"power vacuum at the top of the crypto industry.\" (NYT)\n\nBitcoin briefly fell 7% before clawing back some of those losses to sit around $42,000, a likely sign of traders taking profit in an overheated market. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nComplaining about the price of gas:"
    }
]