[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPM1V6RVJZem43OW9TTklGeGRhMUFfYlgxUVE1aVdsR2FSd2JJZ2lLVFdaVlBxSGJya2Y5dnV2Um1pQVJOX1M0WUoyRzhWNWRmdVN2TkxLeEVGU2V6UUxmbVlCN2FrWkJzMDRBTkNqT0FzRElxbkxDMFVyeW5rTWRYVlBhT1dmdS1J0gGOAUFVX3lxTFA0cUVNZTVEaVFTejhyMmZla2w2MGJnQnFRNTNWWElKY1J4UmwwbEZXejlab1pwWV85LWp2V0hxLXpzR0U3dkFKcHpMMTFTeVROZU42c3ZXZXZMc3Z4eUl5Nl9ucVlXTnJXeHk2eEp3NzI5TzhMLUYtLVRqLVJPeFJJZmtIcEpfRXhmQUFCOXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "'Narrative Shift Away From ETH': Investor Justin Bons on Non-EVM L1s - U.Today",
        "content": "Advertisement\n\nIn Q4, 2023, the cryptocurrency segment is going through \"awesome\" processes as mainstream narratives are moving toward truly scalable L1s, a seasoned cryptocurrency expert says. Did EVM L2s fail to deliver on their promises?\n\nSOL, AVAX, NEAR, EGLD: Justin Bons indicates \"narrative shift\" and L2s' failure\n\nThe blockchain sphere is witnessing a major \"narrative shift\" nowadays. Instead of Ethereum (ETH), all eyes are on its L1 competitors, Cyber Capital CIO Justin Bons says in a recent X post.\n\nScalable first-layer blockchains like Solana (SOL), Avalanche (AVAX), Near Protocol (NEAR) and MultiverseX (formerly Elrond, EGLD) are beneficiaries of this shift.\n\nAdvertisement\n\nThis process is validating Ethereum's (ETH) strategy to bet on Layer 2 solutions (rollups) as a core scaling instrument, Bons concluded.\n\nAs a result of this shift, the \"blockchain trilemma\" may have finally been solved. As covered by U.Today previously, in his earliest statements, Bons appreciated the scaling opportunities of Tezos (XTZ) and The Open Network (TON).\n\nThe Cyber Capital CIO is an adamant critic of the current state of Bitcoin (BTC), Ethereum (ETH) and its L2s as well as XRP.\n\nNew Solana (SOL) summer catalyzed by retro airdrops?\n\nAccording to his views, these assets lack security and decentralization. Also, he stressed that a blockchain should make its L1 scalable instead of relying on rollups and sidechains.\n\nSolana (SOL) as a dangerous Ethereum (ETH) competitor is yet again in the spotlight for analysts in December 2023. As the blockchain exceeded Ethereum (ETH) in DEX trading and NFT sales, experts recall its 2021 rally to three-digit zones.\n\nAt the same time, the interest in Solana (SOL) is triggered by the activity of retroactive airdrop farmers. Inspired by Jito Network's (JTO) generous rewards, they are completing tasks to be eligible for Jupiter, Orca and other potential airdrop campaigns expected in Q1, 2024."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNRHBJei13dThNTno0SE9zUzNPbEhiZm9heF95R3Rkazl2T29QckZud0ZodGdCeXFTbHNSOGYwa1AzdUMxXzRoMUxfZ19NMkVxa2xDd2h0bWl1QjV4RWtaQTVxUmNrRk12dVY1cTlHWUFXdWtiTkFFeEFDLWlERXFHQzZTaWdsTGlMRmRzalp0Y2RnMzlXYzZZZ0VHSEI3WU5xZXRKZjF2dFlHZEZPUG9LbEQxbHFQMGNNRzg5c2xpWjJXSF8zVzh0ODRVY2l4VkRWa2kyZGIzcHrSAd4BQVVfeXFMTmlPWXkwZ0tsbjZva3V0S2IxSFBVbVFlTHJHTmMyUXRXNVZ5RFZ4SXNIcXFwOEtydV9nQ2NJV1htR2Q4RHFHSTQxakZ3TGI0R3M4Y21Od1BzOFFsdnJIT29fNXd1dWZCTHk2QWE3elFxSkZ6aV9IUVo3cDdtUExzYnNUaXhVRDJxWDdERnhoWFZqQTZzLTNXYzdTTVRyQmdiOERIUVVVVHNCeFViSzJ0SUVPdnhROVhSTGZoanZnbXMwaWt2aTl5WnNLZUZLajc2WkkxaVBBZW5LMlB6a3FR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum, Shiba Inu and One Altcoin That’s Exploded Over 250% in Two Months Flashing Bullish Signals: Santiment - The Daily Hodl",
        "content": "Cryptocurrency analytics platform Santiment is naming three digital assets that it says possess long-term bullish prospects.\n\nSantiment says that Ethereum (ETH), Shiba Inu (SHIB) and the artificial intelligence-focused crypto project Fetch.ai (FET) are witnessing a reduction of the supply held on exchanges by their top 10 holders.\n\nAccording to Santiment, the moving of the three crypto assets by the respective top 10 holders from exchanges is a “bullish long-term signal”.\n\nThe crypto analytics platform says that in the case of Fetch.ai, the top 10 largest wallets have reduced their FET holdings on exchanges by 26.1% in the last three months. The top 10 holders of Ethereum and Shiba Inu, on the other hand, have cut their holdings on exchanges by 4.3% and 2.7%, respectively, over the past 90 days.\n\nEthereum is trading at $2,306 at time of writing, while Shiba Inu is changing hands at $0.0000106. Fetch.ai is priced at $0.729 at time of writing, up by 259% from its October 23rd price of $0.203.\n\nEarlier this week, Santiment said that the supply of Ethereum on exchanges had reached a new low since the official launch of the second-largest crypto asset by market cap.\n\n“As Ethereum’s market value hangs just above $2,170, the largest exchange wallets continue to move coins into smaller wallets or off exchanges entirely. 240,000 ETH has been collectively moved from these wallets in 24 hours, a 2.99% drop in coins held.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPS0kzN19fUFM3U0N2U2pVOEdTMkhyLXpLOVB0OTRXWEpNeU5SMFBqdGR5bTdpb3JpTVVZOEZ3aU4xX2Vqcy1hSkRvVFRSZHpwSkxab25aZ1dDcmpoMXotTnhMRDY2OERRaDNmNEVpQjFjUUJsMTlMbHo0akI5bTZXa0VTaXZLNi10b2hKQXZXSkhzSnNiUE5sSk9sWVJBTUc4Z0VkcEdIYWlmb0xDQ0NHV09RWnhWSG44Yi1Ib19mUlJFZGhfanBoRFhhQThoQXNy0gHWAUFVX3lxTE5CVFdzWXZEY1hSTnJUenVkOGhkZHZjZVJBUmFPcVFjTzF1SURhTFIwNUhsMXB6N1dINGpia3h4YktWOUs4Tjh0V2FMdEt2Mk04Qk1lUFhwOTgxUmo5SGdvdE1hT3l4NkRaUU45NlhES1JQV0VjZ0Jnd0ZMV09uSEFub1RxeDkxS0xwXzNFUTluM0J3WHQzS0w3bklxRTZpeGRIMjB3bmdCYUpHTVZIVGlmWll1enVjVnBrSlF2OGw1N1Q5cWpFWnpZZmJsd1JUSXNPOHo5R2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "New Lows Incoming for Bitcoin, Ethereum and Altcoins, Warns Analyst Who Nailed the 2022 Crypto Collapse - The Daily Hodl",
        "content": "A widely followed crypto trader is warning that Bitcoin (BTC) and other altcoins could soon make an abrupt trend reversal toward new lows.\n\nPseudonymous trader and crypto bear Capo tells his 781,400 followers on the social media platform X that Bitcoin could soon revisit the low $30,000s and bring a sudden market correction to alts after they rally one more time.\n\n“As posted on TG (Telegram) a few days ago, BTC is probably forming a local top here at $40,000-$45,000. ETH could reach $2,500s, and some alts could have the last pumps. After this, a full reversal to new lows is likely over the next few weeks…\n\nI believe new lows are still to come before the real bull market begins.”\n\nThe trader elaborates on his reasoning in a thread about why “we might still see new lows over the coming months.”\n\n“Let’s start with BTC on HTF (high timeframe). We have seen a bullish trend during 2023. Many think that this is the start of a new bull market, but in my opinion, this is a corrective move. Now the price is at a major resistance zone. Confirmations are on the chart.”\n\nHe uses the Elliott Wave theory, which attempts to forecast price movements based on crowd psychology that is manifested in waves. The Elliott Wave theory suggests that price impulses happen in five waves after three-wave “ABC” corrections.\n\n“BTC EW (Elliott Wave) perspective: the bearish trend during 2022 was an impulsive move that broke the 2020-2021 bull market trend. Now, the move from the $16,000 low looks like a corrective move (wave B/X). This move tends to be followed by another impulsive move (wave C/Y).”\n\nLooking at Ethereum, the trader predicts that ETH could decline as low as $550 after facing resistance at around the $2,600 level.\n\n“[ETH] has broken a key level and the next major resistance is $2,500-$2,600. It has a lot of liquidity below that should be taken eventually. The bearish confirmation would be a clean break below $2,000-$2,100.”\n\nHe suggests other altcoins are surging from an inflow of money from Bitcoin sales, which he says often indicates a market correction is coming soon.\n\n“Money is flowing from BTC to altcoins. This usually happens during the last phases of a bullish trend. Some altcoins could pump more, but the trend is overextended and reaching to an end. When OTHERS (altcoins index) reaches the green zone, we should see a strong correction.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQLTNialN3NDZROGo4Q2R4T1VQcFNkZmVKQk1wN0l3VWdqemdnWmpTTnRIQ3JVSGdwZWxjWjczYVJUajdpMllJSkZ2MUJMOW1Ga1ZzOUlDSUo3X3o5SnJVZDNmaVhtS3ljMU5XSUtLbkViWWY2M2djSjlRNHFCZFB1TS1aZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, and EigenLayer – A Play in Three Acts - CryptoSlate",
        "content": "The following is a guest post from John deVadoss, the Co-founder of InterWork Alliance.\n\nAct One: From a Crisis, A New Institution Emerges\n\nOn July 30, 2008, the United States Housing and Economic Recovery Act, intended to address the subprime mortgage crisis (which had precipitated the then ongoing Global Financial Crisis), was formally signed. Two weeks later, on Monday, August 18, 2008, the domain bitcoin.org was registered.\n\nBy November 2008, Quantitative Easing was in action, and the United States Federal Reserve had started buying mortgage-backed securities. In January 2009, the code for Bitcoin was released as open-source, and by March 2009, the Federal Reserve held close to two trillion US dollars of bank debt, mortgage-backed securities, and Treasury notes.\n\nSuppose the goal was to beta-test digital currency at scale towards disintermediating secondary and tertiary financial institutions by directly linking citizens and a central bank. In that case, Bitcoin has been a spectacular success, heralding the upcoming era of CBDCs. If the goal were to make the common man conversant with digital currencies and their usage, Bitcoin would have succeeded remarkably.\n\nA revolutionary breakthrough when it was released, Bitcoin is many things to many people: a virtual currency, a new kind of money, a store of value, and the promise of freedom. But, more than anything, Bitcoin is a new monetary institution for the digital age. Bitcoin has demonstrated that digital monetary institutions are the future; it has done its job by moving the goalposts from why to when.\n\nSome see in Bitcoin and its pseudonymous creator(s), a Robin Hood-type legend, a Zorro-like hero, or a populist protagonist standing up against the system. It is not for me to deconstruct the thematic illusions, but as the old adage goes, the truth is bound to make you smile when it arrives.\n\nAct Two: The Rise of a Monolith and its Discontents\n\nBitcoin begat Ethereum, a 21st-century application platform to rival any of Silicon Valley’s so-called enterprise-grade, global-scale platforms. And the Ethereum team did it all in the open, on with a crew of mostly volunteer developers spanning time zones and political and geo-political boundaries, long before working from home was a thing, shepherded by the genius of their founders and core developers.\n\nWhy Ethereum? Contrary to popular perception, Bitcoin is more than an application; it is more than the collection of technical capabilities that comprise the network and certainly more than a token. It is an institution, a self-governing institution. But it is not a platform. Bitcoin, when it was released, had a level of scripting extensibility, but it was not yet ready to enable developers to build new instances on top of it.\n\nEthereum, with its vision of being the world’s computer, set out to create the definitive decentralized platform abstraction, a blockchain with built-in Turing-complete programming support, allowing developers to write smart contracts and to create decentralized protocols, services, and applications. And by any measure, the Ethereum project has been stunningly successful.\n\nProgrammable money, fiat-backed stablecoins, and the digitization of real-world assets are but some of how Ethereum has reshaped the world of monetary policy. Lending/borrowing platforms, prediction markets, and insurance are some of the financial domains in which Ethereum has helped rewrite the rules for historically highly intermediated products.\n\nAs a result of its extraordinary success, scaling has turned out to be a critical issue for the Ethereum project; it is worth noting that its scalability issues result from the project’s prioritization of decentralization and security over scale. Scaling enhancements are anticipated to address network congestion and reduce transaction costs; Ethereum’s gas fee problem has been a recurring theme.\n\nThere are two primary ways to scale the Ethereum network: on-chain and off-chain. On-chain refers to enhancements to the base layer and modifications to the network. Off-chain refers to the use of a separate network(s) (so-called Layer 2) to process transactions; Layer 2 networks may choose to emphasize scale over decentralization and security as they can benefit from the base network’s strengths in these areas.\n\nNow, here is where things became very interesting. The so-called “on-chain” proponents appear to be reluctant to let go, while the “off-chain” exponents appear to be eager to innovate. This is the classic saga of a maturing platform: how much loose coupling? How much composability? And on the other side, how much to enshrine on-chain before it becomes a net detractor for innovation?\n\nFor obvious reasons, Ethereum does not want to end up primarily as a reconciliation ledger for other Layer 2 networks and roll-ups, but at the same time, a monolithic approach imposes limits on a platform and its ecosystem and impacts a platform’s ability to continue to grow its developer base. Things came to a head when Ethereum did its Merge update to Proof of Stake from Proof of Work.\n\nTrust is now a facet of staking and not mining anymore; was the value now more in the tokens and with the stakers? Or did it still lie in the underlying capabilities? And for how long? Could they be swapped out with newer, more innovative capabilities? And this leads to Act Three.\n\nAct Three: A New Economic Platform Advances\n\nEthereum begets EigenLayer, a first-of-a-kind economic platform.\n\nIn retrospect, it may appear linear, but it was genius, a first-class paradigm shift. The world may not be different with a change of paradigm, but the developer now works in a different world as they say, with a new mental model. We will look back and see a distinct transformation between decentralized applications in the Pre-EigenLayer era and those in the Post-EigenLayer era.\n\nAnd it was the Merge, with the shift to PoS that enabled EigenLayer to reframe the decentralized application model; PoW has no notion of negative incentives, but with PoS, while validators may earn rewards, their stake may also be slashed for misbehavior. With the advent of PoS, EigenLayer is able to programmatically bootstrap and scale Ethereum’s trust model to guarantee economic security for a host of new protocols and services.\n\nDevelopers can secure their services without the need to create their validators, or to launch tokens, etc. The promise of loose coupling can now be extended to economic abstractions by creating markets for decentralized trust. A fascinating three-act play thus far, it remains to be seen what act four portends.\n\nJohn deVadoss is a co-founder of the InterWork Alliance, and he serves as on the Governing Board of the Global Blockchain Business Council."
    }
]