[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPQVlsUUJwZ0RqQkZUSE14QWZyNWlQWG5rRm91a0I4WHRIeGtTMUppTHRZbnFOV29KQUN4UUNkR21ETEdtX29SWWdVNVhtd29pb2FiM2ROWVAtdW8zZGFUZWlWdnNGNDBwaHBqS0ZrNFRsMzdDS190NWZGVjNoWnh4bGVHbmc1cHFMcHRiSXlDekJ4T1NlYTR1TDVpRjk5NmZSOU41ZTZiNHI1OGdZdzhjN1pReHRYRTFUTEszdjB6M0hzSzAwRmpxa2ZyMW15TzZIdGRldWdqU1_SAd4BQVVfeXFMUGZzQ1VTWTh3NUV0Vnd4bGFJZmF2UjJmczJ3N1ZraUs1cFN5bkt0VDJIQTJtU3haT0h5YXQ5MjlWUGt0WjItelV6WExkVmtuUWpBc0d0V0tBdWJTX0NuYTZaVTZ6VzRLZnBvd2t3aFBEVThHYnRHMVZpaTNpb1AwRlZTXzh6SVNXNUp2cG9aNnVHcEZrZEw1Tm1DN3dHMEhWc2FCQzBvbDZ4YTlubGowV0RLY3lOcW5NUTQ4NWpYdW1ENm9Kbk5zUXQyRlgzUmZSOHRodXFLelk4eFNHQVpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Top Trader Predicts Rallies for Ethereum and One Artificial-Intelligence Coin, Says Altcoins Have Ways To Go - The Daily Hodl",
        "content": "A trader who nailed the top of the 2021 Bitcoin (BTC) bull market believes rallies are in sight for Ethereum (ETH) and one additional altcoin.\n\nPseudonymous analyst Pentoshi tells his 711,700 followers on the social media platform X that Ethereum looks poised to take out a resistance level that has held for over a year.\n\n“A few thoughts on ETH here.\n\nIt didn’t come this high to not take out the yearly highs at the very least.\n\nMight let some shorts build up first in that area tho to build liquidations\n\nIf BTC ETF (exchange-traded fund) is approved, good chance ETH rallies harder seeing as it’s next.”\n\nLooking at the trader’s chart, Ethereum’s long-term resistance level appears to be at $2,144. At time of writing, Ethereum is worth $2,038.\n\nAnother altcoin on the trader’s radar is the artificial intelligence (AI)-focused Fetch.ai (FET). According to Pentoshi, FET will likely skyrocket once it takes out resistance at $0.49.\n\n“If it reclaims $0.49, this going to $0.69 in my opinion.”\n\nAt time of writing, FET is worth $0.413.\n\nPentoshi is also keeping a close watch on TOTAL 3, which tracks the total market cap of crypto excluding Bitcoin and Ethereum. According to the trader, TOTAL 3 looks bullish and still has more room to move to the upside before hitting a resistance level, suggesting that altcoins could see more rallies in the coming weeks.\n\n“Still a ways to go next few weeks overall. Sharp pullbacks are gifts.”\n\nAt time of writing, TOTAL 3 is trading at $406.356 billion.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/monkographic"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQemFVNmJ5YWpFQWR4dUJIMlR1QjBuZTFRT29TSm0wek9HZFNaaGcwZDQydXYteGYtaWRKR0M2Q3dzU1BhaGplWDNjTlk3OW5aRUE5aU02ZXoxY1BGamNROFI2RHdmTGIyejZSM1ZDVW5VRXpmWG5JdU1Wa2NiVnllZnNVUm50TE1HalHSAY8BQVVfeXFMT3VieW9qektoQUVJd2RTcEZWUDZYSm1XeDRpLWJjRk14eEVIWUVuUGRIX2xVRHlMNXp6OW9MbHBPS01vclNiLWE5cWVxbXN5M0JSbTh6VktESnBicW9CRHgtaW9TOWxxM0VTQXppWlFpWWZXa2hIUnZKeUUwWDNtcE14YUctWlNVbWl2Qm42NHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Institutional and Whale Demand for Bitcoin and Ethereum Skyrockets - U.Today",
        "content": "Advertisement\n\nBitcoin, Ethereum and Polygon are experiencing a remarkable surge in large-scale transactions, also known as \"whale transactions.\"\n\nNotably, Bitcoin has seen an 80% increase in transactions valued over $100,000.\n\nSimilarly, Ethereum's large transactions have soared by 170%, while Polygon has witnessed an unprecedented rise of over 3,800% compared to their respective volumes just 30 days ago.\n\nLarge transactions\n\nData from the past week highlights the scale of this uptick in high-value transactions. Bitcoin recorded 16,410 transactions in the last 24 hours, peaking at 22,570 transactions on Nov. 9. The lowest was 12,810 transactions on Nov. 5.\n\nAdvertisement\n\nIn terms of transaction volume, Bitcoin saw $24.4 billion in the last 24 hours, with a high of $39.02 billion and a low of $18.1 billion within the same week. Ethereum's large transaction count stood at 3,560 in the last 24 hours, reaching a seven-day high of 7,590 transactions and a low of 3,040.\n\nIts transaction volume echoed this trend, with $2.91 billion in the last 24 hours, peaking at $6.59 billion and a low of $2.47 billion.\n\nFor Polygon, the number of large transactions reached a seven-day high of 209 transactions, the same as its count in the last 24 hours, with a low of 34 transactions. The transaction volume mirrored this surge, with the last 24 hours seeing $194.42 million, a seven-day high of $357.59 million and a low of $28.81 million.\n\nRenewed institutional demand\n\nThe significant increase in whale transactions across these cryptocurrencies is largely attributed to renewed institutional interest. The crypto market is abuzz with anticipation for the launch of spot Bitcoin ETFs by January 2024, a development that is expected to further fuel institutional demand.\n\nAdditionally, BlackRock's plans to introduce a spot Ethereum ETF have added to this excitement. Institutional demand plays a crucial role in the crypto market, as it not only brings substantial capital but also lends credibility and stability to the digital currency ecosystem.\n\nThe entry of large financial players and the creation of more accessible investment vehicles like ETFs are seen as key drivers for long-term growth and mainstream acceptance of cryptocurrencies."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOZVB3QzNPZXBjVGhZZ1c3eWRpYjdEVUJfcUlZVk4wdk1qUEhzbzRqTlo5V0kyazg0dU5FRWxpM3ZDNk5YYTVCYzV5Y3duLUpaeHhSNS1TZjA4Yl9XYXg1Ulo2elB5cE00R184Uld5Z3VOUjVsUWVpYTA3NnF3N0txVUFlOEVxVnRhcG1WSEszdEo1QV82OFV0RHVRNkczVDhvY2J3bnpFbnlCbFZlWkJxRER0NEpwOVVtNnFRdC1xQlQtZ1NBLS1aeXRCajd4ZkVZYUZrYdIB2gFBVV95cUxOTTBMZnNicjdWd080Tzl5MGhLZjJhMzJySWRfVlRIZXRrX0JpSy1odzhCLXZRaE9hX1M5NExTZ3dZUm1kNWVtTzVEQzJpakJvYnFNY0twalJEbjR4U2JyTVBTMXo5WlNudU5DbHZsNC0teHl3eHNvNWR3WENKZE1DMVQ1ZGN4YlJ2bU5fVzVwX2owTDBMVlBwLVhGNjFpT2o4V2dIbGlhQjBILUVPc3ZMMExRZ2o2ZW9xc0RkLUtfRTBIU1ZFMHdTOFdaSG5CUVY2UU1Ud3o2bUpDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says Ethereum Is About To Outperform Bitcoin As Crypto Enters Late Spring - The Daily Hodl",
        "content": "Macro guru Raoul Pal says that the top smart contract platform Ethereum (ETH) is set to outperform Bitcoin (BTC) as the crypto markets enter into a new “spring” phase.\n\nThe former Goldman Sachs executive tells his one million followers on the social media platform X that based on the Tom Demark Sequential indicator, ETH is setting up to outrun BTC.\n\nThe Demark Sequential aims to identify points of trend exhaustion or price reversal.\n\n“That is the weekly DeMark 9 count for the ETH/BTC cross. ETH most likely outperforms from here as per usual at this stage in late Crypto Spring.”\n\nPal goes on to say that Ethereum-based exchange-traded funds (ETFs) will be the “holy grail” for asset managers, at least until some form of competition emerges.\n\n“An ETH ETF is the holy grail for asset managers as they can capture the yield and only give price performance to the ETF holders. It is a super profitable business until it gets competed away eventually.”\n\nHowever, one prominent crypto analyst has a stance that contradicts Pal’s assessment of Ethereum outperforming Bitcoin.\n\nRecently, crypto strategist Benjamin Cowen issued an alert, saying that Bitcoin Dominance (BTC.D) – which tracks the percentage of the total market cap that belongs to Bitcoin – will continue to be bullish, meaning that altcoins, including ETH, will lag behind BTC.\n\n“My crypto portfolio for the last couple of years has been predominantly just Bitcoin because I suspect that it will outperform most of the rest of the market – not all of the market, but most of the rest of the market – and that’s why the dominance has gone higher.”\n\nEthereum is trading for $2,080 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE53UEp6bm81V1l6VXRZUjFOcE9ZbXBMS2ZNakRmVndUOTNPWG1mRXNzNi1pQjNFUmpOczlWNXZfSmVBUGRPSGJibzNCd1F5UmFSVTNwUF9ROVAzSEJwb1NMY0QyWVZzME41cnFr0gFwQVVfeXFMT3FZai1LcjRSVE0wM09yZzA1NkFiTnZDYTl2MEw5VTE2eEFFS3RQSnVja2l4Y1pscV9hZmYwRFIxbHZKaVNEbjBLc1ROMEhGWE5jSF9xM2U4TnlZOTFDTnpGTFAxTE5lSUxob0pVSnVFeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 03:01:54 GMT",
        "title": "Ethereum Insider Ready For Battle: ETH Founders' Fraud Proof Coming In 4-5 Days | Bitcoinist.com - Bitcoinist",
        "content": "Steven Nerayoff, one of the earliest advisors for Ethereum, has had various debates and discussions concerning Ethereum in the past few weeks. The former lawyer for the crypto firm has never wavered from his position that Vitalik Buterin and Joseph Lubin, the co-founders of Ethereum, engaged in fraudulent activity during the early days of the network and that the SEC was corrupt in its dealings with Ethereum.\n\nWhile speaking in a Space hosted on social media platform X, Nerayoff revealed he has recorded proof that could heavily implicate Ethereum co-founder Vitalik Buterin.\n\nFormer Ethereum Advisor Claims to Have Proof of Fraud\n\nNerayoff has always asserted that the extent of fraud in the Ethereum ecosystem’s early days surpasses the scale of the FTX scandal, which led to the exchange’s bankruptcy. This saga has continued in this high-stakes battle over the transparency and decentralization of one of crypto’s largest ecosystems.\n\nNerayoff had been initially talking with other speakers on the podcast about the SEC’s plan to ultimately decide who and what becomes a security in the crypto industry before switching topics to the ETHGate scandal.\n\nAccording to Nerayoff, the Ethereum Foundation had run into troubles in 2015 as it actually looked like it was going under. Buterin reportedly ran to Nerayoff for help to save and restructure the foundation, as he had created the utility token and ICO for ETH.\n\nNerayoff mentioned this conversation with Vitalik ran up to three hours, and he had it recorded, and it is ready to be released as a free NFT and a transcript in the next four to five days.\n\n“So he asked me to restructure the entire Ethereum Foundation to save it and I’ve got the whole thing recorded. I’m going to drop it. We’re doing it as an NFT. It’s free, but everybody can have it,” he said.\n\nThe Ethereum former advisor also talked about how the SEC basically gave a free pass to Ethereum amidst the ETH Gate scandal. The SEC had initially considered ETH’s utility token as a security before former director Will Hinman gave a speech noting that BTC and ETH were decentralized and not securities. On the other hand, the SEC went after Ripple and XRP on claims of centralization.\n\nHowever, Nerayoff is of the notion that ETH was centralized when the speech was made, and neither Joe Lubin nor Vitalik Buterin could boast of its decentralization at that point. Furthermore, Nerayoff noted that there was internal documentation at that point that indicated that the network hadn’t met the requirements in order for it to be decentralized.\n\nThis internal documentation was reportedly only accessible by Nerayoff, prompting regulators to go after him on charges of extortion. Prosecutors have since dropped these charges, but Nerayoff claims it was all a setup. He also claimed the SEC, FBI, and the DOJ fabricated the evidence, and it was all done in a bid to take him out.\n\nNerayoff’s accusations have been explosive and threaten to shake investor confidence in Ethereum. Many members of the XRP community have also questioned the SEC’s inconsistencies.\n\nNerayoff failed to go into details of his conversation with Buterin, and he said he wasn’t going to mention which particular laws were broken. Still, he did insinuate that it contained proof that Ethereum’s early founders themselves did not believe the network was decentralized during its launch.\n\nThe release of Nerayoff’s recording could spur legal action against Buterin and other ETH founders. When asked if his recorded evidence could lead to criminal charges for Buterin and Lubin, Nerayoff said that’s up to the SEC and the DOJ.\n\nETH bulls still holding price steady above $2,000 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Cryptopolitan, chart from Tradingview.com"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNQlJVM2JMQXZZM3pFQTZGUUZVd19uTjZhRWt3SlE4MmFLUG9zLWZub1BvVUJpczN0bXNPemFXeDV3elhQX1RYLUJXNE5pZ0lOR3ZxQ01vdHpqQm5ReDh5eW9DWWlLWjQ0dmJ3VnFycVpfcWJMZjZCbHlzVFotOEhVV1c4UnEtckN5T2NqTTBKYXZfT3NE0gGcAUFVX3lxTE8zbVVVX0w5MHFSdVczZVA4aWlDOXBZRmg2bTFuVjlNeU9uclF5RUdFS2w2dUtCU0dLdzYxekN0UDVQbm90TE5Dem1tX2wzOXpqREVGc0RuS2YxNGJNbGJpaWM2Qm5XX2hCS2ZuR1BUSHdtQTd1dTNIR1RTaUR0cVZjSExlYmFzVmgzQTJ1bUJyN0lfQXlOOWJpMUlybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Why WNBA Star Jewell Loyd Relies on Crypto—And Why Bitcoin and Ethereum Are Her 'Anchors' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNobody in the WNBA can put the ball in the basket quite like Jewell Loyd, whose 939 points scored for the Seattle Storm this past year set the league’s single-season scoring record. That surpassed Diana Taurasi’s previous record of 860 points scored in 2006.\n\nOff the court, Loyd has become the face of crypto-savvy athlete investors for Coinbase, which has been the exclusive cryptocurrency partner of the NBA and WNBA since 2021.\n\nThe 30-year-old Chicagoland native bought her first Bitcoin in 2013 while playing collegiately at Notre Dame. Loyd and her brother, former pro basketball player Jarryd Loyd, entered the crypto market together after growing up with parents who stressed the importance of financial literacy.\n\n“I was one of the first people to come out and publicly say I’m investing in crypto and taking some of my salary in that,” Loyd told Decrypt. “Right after that, any team we played always had one person who came up to me like ‘Yo, why'd you do this? What is this?’\"\n\nAD\n\nAD\n\nImage: Klutch Sports Group\n\n“That was my time to educate,” she continued, “which was cool because I wasn’t the kid in school that everyone asked how they figured a question out. I was the one always asking questions. So to have that reversed was kinda cool.”\n\nCoinbase creates crypto educational content in partnership with the WNBA, and introduced an in-person crypto crash course to rookies at the 2022 WNBA Draft. Loyd converts a portion of her WNBA salary into cryptocurrency through the Coinbase app, with Bitcoin and Ethereum comprising her majority holdings.\n\n“To me, those are like the anchors,” she said of Bitcoin and Ethereum, the leading cryptocurrencies. “A basketball analogy is that you always need a good center. And those two are good centers for me.\"\n\nAfter making her fifth All-Star team this past season, Loyd signed a two-year, $463,000 contract extension with the Storm to remain where she’s won two WNBA titles (2018, 2020) since Seattle drafted her with the first-overall pick in 2015.\n\nAD\n\nAD\n\nWith salaries not nearly as lucrative as their male NBA counterparts, many WNBA players play overseas during offseasons for added income. Crypto’s decentralized nature has been useful to Loyd as she’s played for professional teams based in Turkey, China, South Korea, and Spain.\n\n“[Coinbase] has been one of my personal favorite partnerships with the WNBA, because obviously I’m invested in it—but it also lets women get ahead in the financial world,” Loyd said. “I’m very lucky to play overseas and live overseas, but sending money and using money overseas is very hard. Having a [faster] and more inexpensive way to transfer money overseas and back and forth makes sense.”\n\nCoinbase gave out $120,000 in Bitcoin to players on the New York Liberty and Las Vegas Aces as part of its sponsorship of the WNBA Commissioner's Cup midseason tournament in August. The league has also offered NFTs to fans though Coinbase, such as a digital collectible to commemorate Loyd’s Storm teammate Sue Bird for those who attended Bird’s jersey retirement ceremony at Seattle’s Climate Pledge Arena in June.\n\nLoyd said that Crypto’s biggest assist has come during her continued efforts to aid Rwanda, where Loyd and her brother send computers and money to support locals.\n\n“We’re always trying to figure out ways to send money to help our cause, and without using crypto, it would have been so much harder,” she told Decrypt. “When they need it right away, it gets there. It’s more efficient and we see more change that way with the community we’re working with.”\n\n“Working in Rwanda, they’re so talented. They just don’t always have the resources,” Loyd added. “I’m very passionate about giving to the next generation of kids and athletes. Anyone who wants to learn, I’m willing to help them.”\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    }
]