[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPU1RiS19PcmtsM3g5M0xtTXR2TTZKMHBaR0RiVFN2YUhkWnhiaWk1b2R4T3ctMFpJR3pDV3B2WVZHX21SY0NnVVJEOUFNUjNkOG5kaENnaWZZb2t6TTEyd19LdGdpZmxnR2U4OFV0eUdLTFZ1Z1c4WGg1YVVIYUVBNVdjdnV0NjFsaE5qU2p3UDBPQ01kTEhBOS0yZFJxdVJ5emlvcERJQ0ZjNjNmNkI5dFFteG1QZjhXN3M5bldtaEZDR1pkaFN30gHMAUFVX3lxTFBDT0NrVXRKWm9YX19mRU1OV3ZFOU1JMk9MSndhV2NSdjlmV0NEWmJJZERidnFXZnh4UUVTcXVQWUVMQnB3SURubmhFZEowZUdvWmRZQVp4NzhFWlZCcEdsMVo2djhRM0tmYjlGQURpVDhkNlV6UWllR01WU0NnVl9ROTY5WEZRUVE3U25peDdCOGktTzBaOXRHcXgtTWtYTnB1VWZoaUVJMkdYeDFheW80eWo5bnhlQXRFZWxZOWdaQkZxb21rV2c0cTE2Mw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum-Based DeFi Altcoin Explodes Amid New Spike in Whale Activity: Analytics Firm Santiment - The Daily Hodl",
        "content": "An Ethereum (ETH)-based decentralized finance (DeFi) protocol has exploded in price amid a recent spike in whale activity and new addresses, according to the crypto analytics firm Santiment.\n\nYFI, the native asset of automated yield-farming protocol Yearn.Finance, is trading at $10,242 at time of writing.\n\nSantiment notes that the number of YFI transactions valued at more than $100,000 recently surged to its highest level since July 2022. New address growth has also been “exponentially increasing,” according to the analytics firm.\n\nDespite its recent gains, YFI remains nearly 89% down from its all-time high of $90,786, which it hit in May 2021.\n\nSantiment also notes that Ethereum fees have risen back to their highest levels in four months.\n\nIn terms of the overall crypto market, Santiment says digital asset traders still have a bullish bias, which has historically made markets more likely to flatten or fade.\n\n“Crypto markets have flattened the past three days, but traders are still showing signs of optimism and FOMO. Historically, price rises are most likely to occur after the crowd becomes fearful and keywords like sell, top, or scam rise on social media.”\n\nThe 129th-ranked crypto asset by market cap is up more than 71% in the past seven days.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE4zS1ZpYURyWFI5MDVSWXFqejgzT2F5SjhTWUh4S1dVejFJYVZBOHo1bmJLeU01T0Z5SzJjWU9rVDBlWDVrZGJHQWJhTFpQLVVMR2VmbXExZXdHUVJQT1NWUlJrT1dCWlF4cC1IaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 17:55:32 GMT",
        "title": "SEC postpones decision on Grayscale’s proposed ETH ETF rule change - Blockworks",
        "content": "The Securities and Exchange Commission on Wednesday announced that it will “designate a longer period within which to take action on the proposed rule change” for Grayscale’s Ethereum Futures Trust.\n\nThe filing pushes the deadline to Jan. 1, 2024.\n\nIn the filing, the SEC said that the “Commission shall either approve or disapprove, or institute proceedings to determine whether to disapprove, the proposed rule change.” Essentially, the regulatory agency has another window to push back a decision.\n\nBloomberg analyst James Seyffart posted on X that the delay of the 19b-4 filing was not “remotely surprising.”\n\nLoading Tweet..\n\nGrayscale filed in early October to convert its Ethereum Trust into an ETF.\n\n“As we file to convert ETHE to an ETF, the natural next step in the product’s evolution, we recognize this as an important moment to bring Ethereum even further into the US regulatory perimeter,” Grayscale CEO Michael Sonnenshein said in a statement at the time.\n\nIn August, Grayscale scored a court win against the SEC after it sought to convert its bitcoin trust (GBTC) to an ETF.\n\nThe judges didn’t order the SEC to give Grayscale’s proposal a greenlight, but rather ordered the regulatory body to re-examine the application it originally denied.\n\nThe panel of judges agreed that the original denial, but the allowance of bitcoin futures ETFs was “arbitrary and capricious.”\n\nAlongside spot bitcoin ETFs, firms are now vying to get spot ether ETFs off the ground. Ark Invest and 21Shares plan to introduce five funds holding both bitcoin futures and ether futures this week. Both filed for the products back in August.\n\nIn early October, six ETFs holding ether futures launched, with roughly $20 million or so in combined assets under management as of early November.\n\nAdditionally, ETF watchers are keeping a close eye on the SEC’s approach to the spot bitcoin ETFs after big traditional finance firms such as BlackRock threw their hats in the ring.\n\nThe SEC also postponed decisions on the big ETFs in late September ahead of a potential government shutdown.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPallKU2RvTXBJcUJrR3pTT3VjZTRsaEhmbC1jUHN6WGM1QllJbEdhdHU4WmpvMGZnal9aTWIwbDlFbWg3cXIyQlctVzEzclVSbWlkQmJsQVZjX2pJMks3YnRiaHBKS29kMy10YWRNRjJOTzBINThiREdHT1dlbHZBcDhsREN4dkF1WE9PNUk0cmN1V0FlS19Keno4RFc5bVhhVERFZnFVM1c1emlnMnJJU3NwRjjSAboBQVVfeXFMTWtpOVZGa01yTXVBQlV5YmJPVUVHYWVPNnVVTWtHOFRveTRNQV91TjVsMEI1Q1hObTFjeGNWVjVta1VsYjV6UGdMbHVHQUE4dmVrbU1oOEExN2huNmZja2N4QmpzUmFIRXFYRUQyMGk2bklIRU45RGlxMm1RR0Z4bnZtZVVqamZQRnhPRkU3QXNfSG53NC1SNW1CMjd4czg1N2JrV21ORVlkYUhiUXhUaF9hWVR1Q0M4eHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana surges amid altcoin rally, nearly triples its price over the past month - CNBC",
        "content": "The price of the Solana token jumped Wednesday amid an ongoing rally in altcoins and bullish remarks on the token from famed tech investor Cathie Wood.\n\nSolana was last higher by nearly 18% at $65.65. It has nearly tripled in price in the past month.\n\nThe spike comes a day after Ark Invest CEO Cathie Wood applauded its performance this year on CNBC.\n\n\"Solana is doing a really good job,\" she told CNBC's \"Squawk Box\" on Tuesday. \"Ether was faster and cheaper than bitcoin [back] in the day – that's how we got ether. Solana is even faster and [more] cost-effective than ether.\"\n\nWood went on to say on CNBC Pro Talks that she \"really does like Solana\" while also noting that its downtime – the time the network is down, under maintenance, or suffering an outage – \"is much higher than it is for Ethereum.\"\n\n\"People are willing to put up with that because maybe the transaction sizes are not as large or for some reason are not as important, they just want speed and cost as their top priority,\" Wood told CNBC PRO. \"Each one of [the networks] is going to have a place.\"\n\nSolana, the sixth largest crypto token by market cap, according to CoinGecko, became the darling of the crypto world in the 2021 bull market as it sold investors a vision of something like Ethereum, but without the slow and expensive transactions.\n\nActivity on Solana has been growing all year, particularly in liquid staking protocols like Jito, according to data provider Kaiko. The token has topped the list of the most traded altcoins on US-available exchanges this year, outpacing dogecoin , litecoin , Polygon's MATIC and Ripple's XRP .\n\nMore recently, the token is following a broader crypto market rally led by bitcoin, that began Oct. 24, when the coin doubled for the year and topped $35,000 for first time since May 2022. Shortly, after ether followed, rising to the key psychological level of $2,000. Historically, the altcoin rally tends to follow ether.\n\n\"After Oct. 24 bitcoin started losing its momentum, which during bitcoin bull markets causes traders to go down the risk curve and switch to alts as a way of chasing huge profits,\" said Mikołaj Zakrzowski, an analyst at data provider CryptoQuant.\n\nThis time a year ago, the coin was facing a crucible moment after the FTX blowup sent it down 70% over two days and briefly traded under $10. FTX and its now-fallen leader Sam Bankman-Fried were widely credited with providing substantial money and resources behind the Solana project to get it off the ground.\n\nSolana is up about 550% this year and has been one of the best performing cryptocurrencies of 2023. By comparison, bitcoin and ether have gained about 127% and 70%, respectively."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPallKU2RvTXBJcUJrR3pTT3VjZTRsaEhmbC1jUHN6WGM1QllJbEdhdHU4WmpvMGZnal9aTWIwbDlFbWg3cXIyQlctVzEzclVSbWlkQmJsQVZjX2pJMks3YnRiaHBKS29kMy10YWRNRjJOTzBINThiREdHT1dlbHZBcDhsREN4dkF1WE9PNUk0cmN1V0FlS19Keno4RFc5bVhhVERFZnFVM1c1emlnMnJJU3NwRjjSAboBQVVfeXFMTWtpOVZGa01yTXVBQlV5YmJPVUVHYWVPNnVVTWtHOFRveTRNQV91TjVsMEI1Q1hObTFjeGNWVjVta1VsYjV6UGdMbHVHQUE4dmVrbU1oOEExN2huNmZja2N4QmpzUmFIRXFYRUQyMGk2bklIRU45RGlxMm1RR0Z4bnZtZVVqamZQRnhPRkU3QXNfSG53NC1SNW1CMjd4czg1N2JrV21ORVlkYUhiUXhUaF9hWVR1Q0M4eHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana surges amid altcoin rally, nearly triples its price over the past month - CNBC",
        "content": "The price of the Solana token jumped Wednesday amid an ongoing rally in altcoins and bullish remarks on the token from famed tech investor Cathie Wood.\n\nSolana was last higher by nearly 18% at $65.65. It has nearly tripled in price in the past month.\n\nThe spike comes a day after Ark Invest CEO Cathie Wood applauded its performance this year on CNBC.\n\n\"Solana is doing a really good job,\" she told CNBC's \"Squawk Box\" on Tuesday. \"Ether was faster and cheaper than bitcoin [back] in the day – that's how we got ether. Solana is even faster and [more] cost-effective than ether.\"\n\nWood went on to say on CNBC Pro Talks that she \"really does like Solana\" while also noting that its downtime – the time the network is down, under maintenance, or suffering an outage – \"is much higher than it is for Ethereum.\"\n\n\"People are willing to put up with that because maybe the transaction sizes are not as large or for some reason are not as important, they just want speed and cost as their top priority,\" Wood told CNBC PRO. \"Each one of [the networks] is going to have a place.\"\n\nSolana, the sixth largest crypto token by market cap, according to CoinGecko, became the darling of the crypto world in the 2021 bull market as it sold investors a vision of something like Ethereum, but without the slow and expensive transactions.\n\nActivity on Solana has been growing all year, particularly in liquid staking protocols like Jito, according to data provider Kaiko. The token has topped the list of the most traded altcoins on US-available exchanges this year, outpacing dogecoin , litecoin , Polygon's MATIC and Ripple's XRP .\n\nMore recently, the token is following a broader crypto market rally led by bitcoin, that began Oct. 24, when the coin doubled for the year and topped $35,000 for first time since May 2022. Shortly, after ether followed, rising to the key psychological level of $2,000. Historically, the altcoin rally tends to follow ether.\n\n\"After Oct. 24 bitcoin started losing its momentum, which during bitcoin bull markets causes traders to go down the risk curve and switch to alts as a way of chasing huge profits,\" said Mikołaj Zakrzowski, an analyst at data provider CryptoQuant.\n\nThis time a year ago, the coin was facing a crucible moment after the FTX blowup sent it down 70% over two days and briefly traded under $10. FTX and its now-fallen leader Sam Bankman-Fried were widely credited with providing substantial money and resources behind the Solana project to get it off the ground.\n\nSolana is up about 550% this year and has been one of the best performing cryptocurrencies of 2023. By comparison, bitcoin and ether have gained about 127% and 70%, respectively."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNdGU1SXBvdXRzVmJzWktoOG5HNTlwa05WMVFHRU42clB6YXZiY0p0cllFOFZwUFF1X3hXS1ZnMmRYaTYzakx1djhtTTZ0NGRUZm1jblU4X25jekpjUml5ZVRiRXZPMzFnVUdmbnExcFlGa2R3eF91czJVV3h4a3llZTBaR3FKMjZUTVhYSEs0clZ6cTBZOWgtOEhlNVZfVDdqN3hpQWRBb2JsVVZpUU96N0Z6WG45TlF1MXhIazJacHRZcGZpWGZTaEZmV0Npemd2OEp3WS1ndzVpMmhwZ0RNUXhZdjl6MFVBbUdSR2o1TEFrdnVK0gH6AUFVX3lxTFBNdER4aHdINlBPSC11SXJmbkJVLXltYWVFTkh6RjhUVEhOQUxXLTdJNTdjejdtNFA0eE1TaVA5WGJNNnhKVUdSRkVkam9JWEs0YjUtVnpaUjY2X2djZlI1RzJYdnJiYWE0QVJ0U1ZaUFRvb25YejR5QW45S21NTUZ0T2ZYb3Q3ODZiWXF2elJyZ0hZTk02aGdKb0EwMzBySDFhdm1Jc0kxM2VKbWk3anFZTmFPZjlXbE55ZmFlbXVmN196dC1nbDBuTFE0T1NDenkzRWNiVDlPZ2NrbVJDZTNtOGlqRW1abl9fRmpvaXAtbkFiTDhnX1JZU2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC bulls take advantage of recent dip with $40,000 in sight - FXStreet",
        "content": "Bitcoin price could climb 7%, recouping the ground covered since the November 9 rejection from the $37,972 range high.\n\nEthereum price defends the $1,935 support level at all costs, with success likely to initiate a 10% rally to $2,200.\n\nRipple price shows weakness, breaks the triangle to the south as the 25-day EMA provides support at $0.6183.\n\nBitcoin (BTC) price is showing strength again after a stark correction on Tuesday that bruised the market. Ethereum (ETH) is following the trend set by the largest cryptocurrency by market capitalization. However, the same cannot be said for Ripple (XRP), at least not yet, as the remittance token's price is showing weakness.\n\nAlso Read: Bitcoin price drops, $90 million in open interest wiped out amid jitter over spot BTC ETF window closing\n\nBitcoin price pulls north as momentum restores\n\nBitcoin (BTC) price is pulling north, trying to recover all the ground lost in the recent crash that saw up to $90 million in open interest wiped out of the market. With the 25-day Exponential Moving Average (EMA) coming into play at $34,572, BTC is trying to reclaim territory above the critical resistance at $36,788.\n\nFor a confirmed move north, investors should watch for Bitcoin price to break and close above the $36,788 level. This will set the tone for BTC to target the $37,972 range high before reaching the $38,000 psychological level.\n\nIn a highly bullish case, Bitcoin price could extend its reach to tag the $40,000 psychological level, with such a move constituting a 10% climb above current levels.\n\nThe Relative Strength Index (RSI) is tipping north, suggesting momentum is rising, while the Awesome Oscillator (AO) holds in positive territory. This adds credence to the bullish thesis.\n\nBTC/USDT 1-day chart\n\nConversely, another rejection from the $36,788 resistance level could see Bitcoin price losing support due to the 25-day and 50-day EMAs at $34,572 and $32,456, respectively, before dipping into the supply zone turned bullish breaker where it could test the 100-day EMA at $30,528.\n\nAlso Read: Over $1 billion worth of BTC susceptible to be sold as Bitcoin price hints at short-term correction\n\nEthereum price holds above $1,935\n\nEthereum (ETH) price maintains above the $1,935 level, a crucial support that could spell doom for ETH if lost. With the RSI tipping north and the AO holding in the positive zone, ETH could scale north, restoring itself above the $2,029 support in order to ride the ascending trendline. This could ship the second-largest cryptocurrency by market capitalization to the $2,136 range high.\n\nETH/USDT 1-day chart\n\nHowever, if selling pressure increases, Ethereum price could slip below the $1,935 support. A decisive move below this level would confirm the downtrend, with ETH likely to test the 25-day or 50-day EMA at $1,892 and $1,806, respectively.\n\nIn a worse case, Ethereum price could tag the 100-day EMA at $1,763, with a break and close below it invalidating the bullish thesis under the $1,753 support level.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price breaks the triangle\n\nRipple (XRP) price has shown weakness, breaking out of the triangle to the downside amid reducing volatility. Increased selling pressure could send XRP below the 25-day EMA at $0.6181. A break and close below the $0.5981 would lower optimism for a move north.\n\nXRP/USDT 1-day chart\n\nHowever, if buyer momentum increases, Ripple price could restore back above the lower trendline of the triangle above $0.6584, which would set the tone for a move to $0.7000.\n\nIn a highly bullish case, the gains could extend toward the Fair Value Gap (FVG) between $0.7519 to $0.7623, with Ripple price filling the inefficiency and restoring balance.\n\nAlso Read: XRP price could extend gains with Ripple’s likely win through $20 million settlement with SEC"
    }
]