[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTHdweHpUVDZHM3Qzc3haUVA2SXE3cmlvdnJZekd6NF9nMENmYnRNaGotOU9HQlJocWh5Q2NFMTZ0RlpmZ1A1RkhaZEZZdEhaRndqZDJxTHY2WXQ1a0xBYUFjQTZ6Q1Q5TUNZMU5DNUdDYjVyM3VuTk4xY3dEdFlVY21scw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Study lowers Ethereum price expectation for next 7 years - crypto.news",
        "content": "Cryptocurrency experts have lowered their predictions for Ethereum (ETH), over the next few years, according to a new survey from Finder.\n\nThe survey asked 31 industry specialists for their ether price forecasts for the end of 2023, 2025 and 2030. The average predictions were down compared to a previous Finder survey conducted in July 2022.\n\nThe panel predicted Ether will be worth $1,840 on average by the end of 2023, down from a prediction of $2,451 in July. The 2025 forecast fell to $5,824 from $5,845 previously, and the 2030 prediction declined to $14,411 versus $16,414 in the earlier survey.\n\nFinder calculates the average forecasts by removing the top and bottom 10% of responses and taking the mean of the rest, a technique known as the truncated mean. This is designed to eliminate outliers and arrive at a more consistent consensus.\n\nYou might also like: Investor optimism fuels meme coins growth: predictions and market analysis\n\nWhile still bullish long term, some panelists cited near-term economic challenges and competition from other blockchains as reasons for tempered short-term expectations.\n\nETH has a huge growth potential. […] Growth is [currently] limited by high rates in TradFi. In [the] case of reaching a soft landing by US authorities, ETH[‘s] price will increase dramatically, but not until the middle of next year. Ruslan Lienkha, chief of markets at YouHodler\n\nOthers pointed to historical price patterns around Bitcoin (BTC) halvings. “Historically, as we approach a Bitcoin halving, Ethereum tends to revisit its price valuations from earlier that year,” explained Pav Hundal of cryptocurrency exchange Swyftx.\n\nThe panel predicted ETH could climb as high as $2,800 but also slump to $1,200 or below by year-end 2023. Nearly half see it finishing the year between $1,751 and $2,000.\n\nMost experts said now is a good time to hold or buy Ether, though around 17% believe it is currently overvalued. Asked if and when ETH’s total market value could surpass Bitcoin’s, 43% of panelists said they don’t expect that to ever happen. But around 20% think the ‘flippening’ — with Ethereum’s market cap overtaking Bitcoin’s — could occur by 2030."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQclhDNWZScDJRUHVWOTFKdTZpNmZiMWJUREtockktNTNvSllOMVN4bVV5andiTno5NHI2YzBORk1xaXZxZXhFWWxaRjRhUjNhUDF2VG9YYmdQR3V2Um1JcWM4VS16NVdPWERVZXZvVnEwSjhYdUszLUZPNjdnNGFyU19EVmU2YkFudXdlT21mLXhuSE8tQ295Nl91bmxLVFhJelZla3hzaEpONzZ4U191Zm0zRV9XeS1kWEhhWm1mMnd5d9IBxwFBVV95cUxNMnI4b3hvbjNaeVlJZWJkX3dyM2VFSUlRXzNVNG9ld0NNNnJmS1lVaHFoaEhGQUNVdUpZQXBDU19zNTlLU3h1Q09fdWVWU2RFamtJOG16NTVkdV8tN19UbGRINDR1WER4UDdtaTQyWUhpVTItNkprUlJUSU5GVVB4R1g4U1V2QjBKeTlnLWpIYlYzNVNRSkJJdDRKMExkck9CWlFLLW05V3ZRenI0WVplbmRtam9Qc3NONDVnbUZVQVhHWG9tN3hF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report - The Daily Hodl",
        "content": "An Estonian banker has confirmed himself to be the owner of an Ethereum address with over 250,000 ETH worth nearly half a billion dollars – but says he lost the keys.\n\nIn a new interview with Vikerraadio in Estonia, LHV Bank founder Rain Lõhmus was asked about something he said years ago about getting into Bitcoin (BTC) and Ethereum in their early days but then losing access to his wallets.\n\nAsked if he ever found his keys, Lõhmus says,\n\n“No, and I haven’t made much effort either. It’s no secret that I have a wallet with 250,000 Ethereum units, anyone can calculate for themselves what it’s worth.\n\nInterviewer: That’s hundreds of millions?\n\nYeah, and I can’t solve this alone; if someone thinks they can, I’ll take all offers. My own best plan is to build Rain Lõhmus as an AI and see if he can get his memories back.\n\nLõhmus said the dangers of handling your own keys and seed phrases was one of the weak points of crypto.\n\n“I absolutely agree that this is a very weak point of this system, which makes you think that this perfect decentralization has other risks that you don’t usually think about. But it’s very common for me to lose passwords. I went to renew my ID card passwords today; if it were crypto, I’d be in a big crisis again, but luckily the police and border police work.”\n\nBased on the information shared by Lõhmus, on-chain analysts have identified his Ethereum address, and according to Etherscan, it is the fourth biggest holding of ETH excluding exchanges, the Ethereum Foundation, and the Wrapped Ether (wETH) address.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong/Natalia Siiatovskaia"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeGVzS2EwRjBMZUhibmxWcHdKbWFXOV81d3l2QXpJdk02d2dLMzgzYUJhTVZWSC1mUWEyQmhzNWRnSU5PY0hGdVdyMkxNeXNrempWMVJkRGt5WGJVQy11Q2xkWWpqbE1GOFF3UjdDTUZNcVJpYXV6TmR4aE8tQTlnaEZLMzE2MWs4aXdj0gGTAUFVX3lxTE4xWVBnZHBONzZ0eFhlcll2YmhnRXZJTjl3TWdvdW11ZVgyMnN0d05ldml4QThQOUpzb0RDd1RFY3pUNy0tMTNmSFNRTXdfT1pXUldaQXk1WGxySFNmZVBpOFF1aGkzcmptWklDRWZwSzFza3FMUF9uRHBvZjZXdTdsZ1hmQmpGQ2NGejNHd29WT2tNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rival Solana Is Back—Experts Say It's No Surprise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana is once again the talk of crypto, and its native coin SOL is benefiting from the attention. The price of SOL is up over 9% today, hitting a 24-hour high of $44.41.\n\nOver the past 30 days, it has exploded in value by over 88%, according to CoinGecko—making it the biggest winner of all the major cryptocurrencies.\n\nAnd despite its association with the collapsed FTX crypto exchange and its criminally convicted founder Sam Bankman-Fried, experts say Solana’s recent rise shouldn’t come as a shock.\n\nWidely considered a competitor to Ethereum, Solana aims to be the go-to network for on-chain applications and experiences. Ethereum proponents argue that the leading smart contract network offers greater stability and security, but Solana is objectively cheaper and faster for those wanting to build or use lending protocols, games, and other applications that utilize blockchain technology.\n\nAD\n\nAD\n\nSolana gas fees right now stand at $0.000522; to make a transaction on Ethereum, it costs $6.58 on average.\n\nFor this reason, Solana has grabbed the attention of Visa, Shopify, and developers wanting to build on the network.\n\n“Solana adopts a streamlined approach, emphasizing high base layer throughput while simplifying the developer experience,” portfolio manager at Yield App Akash Mahendra told Decrypt, highlighting how much data can be processed by the blockchain.\n\nMahendra added that major partnerships and institutional interest are also helping drive up the price of SOL.\n\nAD\n\nAD\n\nIt wasn’t that long ago that Solana was getting a bad rep. FTX, once one of the biggest and most recognizable brands in the crypto space, was heavily invested in Solana.\n\nEx-FTX boss and co-founder Sam Bankman-Fried was a prominent Solana supporter, and the company invested in numerous Solana-related projects. FTX launched a marketplace for Solana NFTs, and even co-created Serum, which at one point was considered a foundation of the Solana DeFi space. At its peak in 2021, Solana commanded a market cap of $78 billion and boasted a $10 billion DeFi ecosystem.\n\nFTX then collapsed in a highly publicized bankruptcy while holding over $1 billion in SOL. The cryptocurrency plunged as a result.\n\nBut big players still see real value in the project.\n\nIn August, Solana’s payment protocol Solana Pay integrated with the e-commerce platform Shopify, allowing merchants to accept stablecoin USDC via the blockchain. This collaboration “capitalized on Shopify’s influential 10% share in the U.S. online retail sector, which translates to an estimated $444 billion in global transactions,” according to Mahendra.\n\nThen, payments giant Visa announced in September that it had chosen Solana’s blockchain for its stablecoin ambitions. This, according to Solana Foundation’s head of strategy Austin Federa, “validates the importance of the network’s unmatched speed and scalability.”\n\nThese two moves were seen as bullish by investors who have since been plugging fresh cash into the project. And things really picked up in the last month.\n\nPatrick Felder, founder & CIO at Prismatic Capital, told Decrypt this was because when Bitcoin and the broader crypto market started rallying, SOL was the most deeply oversold asset in the space following news that FTX’s new management might sell off large amounts of SOL.\n\nAD\n\nAD\n\nBut this, according to Felder, was “massively overblown” FUD (fear, uncertainty and doubt) and “triggered a massive short squeeze.” In the world of trading, a short squeeze is when the price of an asset shoots up unexpectedly due to short sellers (those who’ve bet on the asset going down) exiting their positions.\n\nThis happened with SOL, according to Felder, as many had bet on Sam Bankman-Fried’s FTX trial hurting the asset's price.\n\nThe Solana community’s annual conference, Breakpoint, took place at the end of October, leading to an even bigger rally, added Felder.\n\nThe irony is that at Breakpoint last year, the price of SOL had plunged by 60% in the week following the FTX crash. Spirits were low. But now, the coin has made a stunning comeback.\n\nAs always the question is, will it last?\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTUwyZVJMWndTWUhnZkZtUl9JdS0tcVBKWXdkTnc2RXhLQzBSNDNnZEFnUTZSOGFxUW5XY3dTZ2tvNnduYjJkTDJoc2Z2LTVxY1FwSU40M1BIVGlCSVZsdm9JcG1LY3Nmdl9kY3NvOTZjVmx4a2I4NS1US2hXX0FGbGN0a2FlS1NaS1hwdXZEdGRZZFpMZDZWM1JQdVU5djJQbDdpRXo0X3hTbl9fdHZj0gG0AUFVX3lxTE5qUjVQT3VKNVZ5cXh1UnNnZi1lblhtYmY4SG12SDRNejY0OVJDbmNHbzQ2QWltdFJCeG9acXh4bzVXaHNQd1kwRXNsdFdjVjhDdnBmMFMxc01kemFwenEtUVBVWHJxc2ZrVS12M3FJX25oT3VhY19EX3hmOWk1U0JqTmtmQndKTzF1LUt2QlM3Q1djdXhBSkxlQmNCU09xT001OF90bDNMek1BaGRVT1V2alV4Uw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Going To $5.8? Here’re The Levels To Watch - CoinGape",
        "content": "Ethereum (ETH) price is pulling back after taking a breather in the wake of the climb to $1,900 earlier this week. The prominent smart contracts token needs to sweep fresh liquidity preferably at $1,800; the immediate support. Traders may take this opportunity to lock in the gains, a move likely to trigger a larger sell-off.\n\nHowever, with a bull flag pattern validated on the weekly chart, investors do not need to panic, as the next rebound could overcome resistance at $2,000 and pave the way for gains to a new all-time high of $5,800, foreshadowed by the Finder’s panel.\n\nadvertisement\n\nA higher support is anticipated above $1,800 as Ethereum collects liquidity for the next breakout above $2,000. For now, it might be prudent to let the consolidation play out before betting on either longs or shorts.\n\nEthereum Price Bullish Scenario – Bull Flag Pattern\n\nThe weekly chart highlights the formation and validation of a bull flag. This is a bullish flag pattern, formed by a couple of price rallies set apart by a consolidation period.\n\nThe flagpole represents the bullish muscle blindsiding sellers who then briefly assume control over the price (the channel), as profit-booking takes place, but eventually, the price breaks out to a higher level.\n\nIn Ethereum’s case, the bull flag breakout has already been validated. However, due to the resistance at $1,900, buyers lack the momentum to complete the 49.44% breakout target of $2,678.\n\nWith Ethereum price holding above all three moving averages, including the 50-week Exponential Moving Average (EMA), the 100-week EMA, and the 200-week EMA, the uptrend has a higher chance of resuming than a correction taking place below $1,800.\n\nTraders should be on the lookout for how Ethereum price responds to the support provided by the 100-week EMA (blue) at $1,806. A retest of this support could prove highly bullish and trigger a larger breakout.\n\nHowever, trading below $1,800 might be detrimental to ETH price as it may discourage traders from booking new long positions afraid of capitulation. Below $1,800, the next key support areas are the 50-week EMA (red) at $1,757 and the 200-week EMA (purple) at $1,633.\n\nFinder Analysts Predict Ethereum Price Rise To $5.8k By 2025\n\nFinder, a platform that brings together predictions from different industry leaders, has predicted a potential surge in Ethereum price to $5,800 by 2025.\n\n“On average, our panel thinks Ether (ETH) will be worth US$1,840 by 2023 before rising to US$5,824 by 2025 and then US$14,411 by 2030,” Finder’s latest report states.\n\nMeanwhile, Ethereum is expected to close the year at $1,840 based on the average prediction of the panel of 31 crypto industry specialists. The panel appears to have changed its tune toward the bearish side, following a previous optimistic prediction of $2,451 in July.\n\nMost panelists believe that “ETH has a huge growth potential” especially with the growing interest in “Ethereum staking and [ETH’s] exceptional low inflation rate” which points to a potential short squeeze likely to culminate in a remarkable upside in the ecosystem, believes Ben Richie, the managing director at Digital Capital Management Pty Ltd.\n\nHowever, some specialists like Ryan Grace, the head of tasty tastycrypto said that like Bitcoin price, Ethereum price is bound to encounter macro headwinds which could limit its upside action in the short-term, especially with the Federal interest rates above 5%.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNbUtnQlkzMHBzODlyZWtRM2RqdV9hT05VbzN1bXVOcjFvWENVWFV4MEFqWGhUTllTSUd5UmNzTHRNTDBBNUhxMzNpWjdsZHRTbzdwQm9TbEtPME9ZOHlRZ25EUGtKLVpCY2pES0g5OVhHSDFOMnFrOE0tVzNxamoxVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Analysis of Ethereum’s on-chain data and ETH price - The Cryptonomist",
        "content": "During 2023, Ethereum Layer 2 sector, and more generally the entire blockchain infrastructure landscape, has seen strong growth in terms of new users not in price.\n\nThe DeFi sector saw a 52% increase in activity this year, driven by the strong development of the L1 interoperability and scalability platform.\n\nIndeed, Ethereum users seem to prefer decentralised finance to other NFT and gaming activities, with on-chain trend data clearly indicating the dominance of this sector as the first choice of individuals on the network3.\n\nMeanwhile, the speculative cryptocurrency market continues to make progress, with ETH topping $1,900 per unit overnight, only to retreat slightly this morning.\n\nCompared to the beginning of the year, the price of the industry’s second most capitalised crypto has risen sharply, but will this be the case in 2024?\n\nWill Ethereum’s technology be able to dominate and attract the next billion users?\n\nAll the answers in this article.\n\nOn-chain data in the Ethereum market and classification of user habits\n\nOn-chain data for 2023 shows that the Ethereum infrastructure and its entire ecosystem is booming.\n\nThe entire layer 2, bridging platforms and web3 services sector is growing rapidly, with a positive estimate of 149.28% of new users compared to the beginning of the year.\n\nIn particular, the niche that seems to be attracting the most attention is that of DeFi, which, as we will see later thanks to the metrics provided by Nansen, has achieved higher user traffic than other decentralised industries.\n\nMore specifically, we start collecting on-chain data by looking at the change in the number of active addresses on the Ethereum blockchain over the course of 2023.\n\nAs of October 2023, there are over 300,000 entities that have successfully completed at least one transaction, such as transferring assets to another address.\n\nThis shows that, despite two turbulent years consisting of price collapses of most cryptocurrencies, global crises and hack attacks on the largest DeFi infrastructures, there is still a user base working on Ethereum on a daily basis.\n\nTrying to go deeper, thanks to Nansen’s custom queries, we can sample active users on Ethereum to understand their attitudes in 2023.\n\nWe classify the people in question as\n\nDeFi users : addresses that have used DEX, lending and yield farming platforms, opened positions with decentralised futures, executed stablecoin payments, exploited yield optimiser or arbitrage protocols, etc.\n\n: addresses that have used DEX, lending and yield farming platforms, opened positions with decentralised futures, executed stablecoin payments, exploited yield optimiser or arbitrage protocols, etc. NFT scammers : addresses that have participated in NFT auctions, played crypto casinos, roamed the metaverse, invested in NFT liquidity platforms, bet on GambleFi;\n\n: addresses that have participated in NFT auctions, played crypto casinos, roamed the metaverse, invested in NFT liquidity platforms, bet on GambleFi; Scaling solution enthusiasts: addresses that have used scaling solutions such as rollups, cross-chain interoperability platforms, bridges, sidechains and L2.\n\nAccording to the data recorded by Ethereum’s various web3 applications, we can conclude that the majority of active users have made DeFi their primary choice in 2023.\n\nAbout 92,000 addresses are classified as ‘DeFi users’, while only about 40,000 preferred NT and scaling substrates overall, according to a snapshot from 12 October.\n\nSince March, there has been a strong increase in scaling protocols, supported by the trend of Ethereum rollups and alleged airdrops for early adopters.\n\nIn contrast, the NFT niche has lost over 50 percent of its on-chain assets over the past year.\n\nAnother way to analyse the regularity of Ethereum users is to look at the FIRST on-chain transaction made by NEW addresses in 2023.\n\nBasically, all wallets that were funded by other entities in 2023 and executed a transaction within 7 days were analysed.\n\nOnce again, DeFi seems to be the preferred choice of the crypto world’s degenerate, with the majority of transactions flowing to this sector.\n\nAccording to data from 12 October, only 17% of new users used Ethereum scaling solutions as their first transaction, but this figure is up on the beginning of the year.\n\nOn the other hand, transactions in the NFT market were less frequent, falling from 24% at the beginning of the year to 6% on 12 October.\n\nDeFi confirmed its dominance by recording a significant increase in this metric, with data showing 66% at the beginning of the year and 76% on 12 October.\n\nEthereum (ETH) price analysis and predictions\n\nAs mentioned above, it’s not just Ethereum’s on-chain data that will have supporters of the smart contract platform smiling in 2023, but also the performance of the ETH price, which has risen by more than 50% over the past 10 months.\n\nAfter starting the year just above $1,200 per unit, the Ethereum coin returned to the $2,000 area around April, then went through a mild distribution phase until the rally of the past three weeks.\n\nCurrently, the price of ETH remains firmly above the 50 EMA, suggesting another leg higher before the end of the year.\n\nThe RSI is rising on the weekly time frame and there is plenty of room for further upward movement.\n\nThe Super Trend Indicator, which has been very useful in predicting the beginning and end of previous bull/bear cycles, has called for a buy around the middle of the year (remember that it arrives a little later than market logic).\n\nIf we compare the current phase with that of 2020, when the Supertrend indicated a buy opportunity with ETH at around $250, we could say that we expect at least 4 more months of crypto price rises.\n\nGrafico settimanale del prezzo di Ethereum (ETH/USD)\n\nIndicatively, 2024 should be a good year for Ethereum and its cryptocurrency. Next year we can expect the halving of Bitcoin, which is usually the market’s best stimulus, and probably the SEC’s approval of the first crypto spot ETF tradable on US stock exchanges.\n\nIn addition, the Fed could also provide a positive boost to the price of Ethereum, with US interest rate forecasts signalling a high probability of quantitative tightening in favour of economic expansion with reduced debt costs.\n\nAll in all, the price of ETH is likely to exceed at least $3,000 next year. Several analysts agree that it will surpass its previous all-time high of $4,950.\n\nDespite this, ETH is still suffering in the pair against BTC and is down -25% since the beginning of the year.\n\nThis means that so far it has been cheaper to hold bitcoin than ethereum.\n\nIt will be interesting to see if this trend starts to reverse with the start of the new year, as it did during the last bull run in 2020."
    }
]