[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPdGFsVmNUMjVZQzZHX1Z5eldIYnNIMWNTMl9YUkxSaGxSSmFoYjNpVVl2eHZUQWhvaGhpUGFLOGk2aHJLWnZ5OVg5S2FqMy15bGNOcnZ6OV9JWjZvYzFuTFNMRUhJYnlPVlhIZXRWUlJOSTB2am5kNUlFNmJhdTNDZ1l3U2tVTEhRc3ZjUEFBMnU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Decline in ETH/BTC ratio shows Bitcoin’s rising market dominance - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5zLVoyQTNkMTQ0b3VQeGIzczlNUDJyUHFfVDNLcWRLM2ZBNXRNa2JsdWJaRDNBS2h0WGtJSGx3a2FRcnA5VWhLeDVDSGxrQ1U0TXM4MTVMZEhxSkVNVFhxN2twUGlqV2JUS05IZDNn0gFzQVVfeXFMTXdkT1FXZmRob0NsazdDWGRSZUhDWDM1S0tackVQbUNUWmpzQjM0MHBDTnlwSmt4c0gwUFYyU3ZJNlJEcko1OWJSajRnR2xoUWNBYXF5NFEySzk1TTNkQWpURVYwSGYwV3FRMVFBb1JXU1lrRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF: SEC Kicks Off Clock for Fidelity - U.Today",
        "content": "Advertisement\n\nThe U.S. Securities and Exchange Commission (SEC) has officially acknowledged Fidelity Investments' filing for a spot Ethereum exchange-traded fund (ETF). This follows Fidelity's application on Nov. 17.\n\nThe filing kicks off a public comment period, during which interested parties can voice their views on the viability of such a product. The SEC is supposed to announce its decision after 240 days.\n\nFidelity's Ethereum gambit\n\nEarlier this month Fidelity Investments filed for a spot Ethereum ETF, extending its crypto investment offerings beyond its earlier Bitcoin ETF application.\n\nThe application stressed the importance of such a product for U.S. investors, suggesting that a regulated Ethereum ETF would provide safer investment options compared to the current alternatives.\n\nAdvertisement\n\nThis move gained further relevance against the backdrop of a recent court ruling questioning the SEC’s stance on rejecting spot crypto ETFs while allowing futures-based ETFs.\n\nHigh approval odds\n\nAnalysts James Seyffart and Eric Balchunas have expressed optimism about the approval odds for Ethereum ETFs, citing a recent surge in similar applications and the SEC's evolving approach to crypto-based financial products.\n\nThey estimate a 75% chance of Ethereum futures ETFs being approved, particularly in light of the SEC's prior approval of Bitcoin futures ETFs.\n\nHowever, the market's response to existing Ethereum futures ETFs, which debuted in early October, was underwhelming. These ETFs recorded a total trading volume of around $1.7 million in their initial hours, a sharp contrast to the successful launch of the first futures-based Bitcoin ETFs."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9ib1VFamxQNEZGdjF2V3BTOHdMYno5N0prYzJTbmRSZ01XZV9BazZSdnRzUjRJbjExd2lWQU11UlpCZWg0SFptY2xhclFaX3JWZ1c5TEp4U0ZZendDSDlST1Bna25HQlNwVFdka28tN0kzYXl6cy1tR2VFTnNPZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC Acknowledges Ethereum ETF Filing by Fidelity - Crypto Briefing",
        "content": "SEC is evaluating a proposed Ethereum ETF from the $4.5 trillion money manager.\n\nShare this article\n\nThe US Securities and Exchange Commission (SEC) has acknowledged receipt of an application by asset management giant Fidelity to list a spot Ethereum exchange-traded fund (ETF), according to today’s SEC filing.\n\nThe filing from Cboe BZX Exchange proposes listing and trading shares of the Fidelity Ethereum Fund, structured as a commodity-based trust that would hold ether. The trust aims to track the performance of the Fidelity Ethereum Index, less expenses and liabilities.\n\nHas been long known that Fidelity entered the spot ETF race but this filing *essentially* starts the ~240+ day clock for their spot #Ethereum ETF. Just another step in the process. Will have definitive deadline dates in the coming weeks https://t.co/0C6NKcxNNz pic.twitter.com/gdW9ZQDgs9 — James Seyffart (@JSeyff) November 30, 2023\n\nThe SEC has several Ethereum ETF applications under review that it must approve or deny, including filings by major financial firms BlackRock, ARK Invest, VanEck, Hashdex, Invesco, and Galaxy Digital Holdings.\n\nFidelity Digital Assets Services would serve as the regulated custodian for the trust’s ETH holdings. The filing argues that the CME Ether futures market is of significant size for surveillance-sharing purposes to meet SEC listing standards that aim to prevent fraud and manipulation.\n\nThe SEC has yet to approve a spot Bitcoin or ETH ETF in the US. However, the agency is reportedly preparing to allow simultaneous listings of spot-based Bitcoin ETFs in January. The Fidelity filing aims to make the case that an ether spot ETF should also receive approval.\n\nThe proposal starts a 45-day clock for the SEC to approve, deny, or extend the deadline. The SEC is now seeking public comments on the proposed rule change to list the Fidelity Ethereum Fund ETF.\n\nETH is trading flat -0.1% over the last 24 hours, according to Coingecko."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZl9FdnFRYXBENjJibTE0cnZtUW15NXU3aUo5eml2TmJCX0V2UFFZeUloM0hHMWtycGtvRTFTUXBvMlUyeTVnX01qVDE0UDcxa0xoVmg5Y3JVNDUwVVduN2h3VTlrbVZkVFRtRU9YYUtjR0NOeGhEcEFuSU43Tl95YmNhc1BQUl9BMjBTX0pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC opens comment period for Fidelity’s proposed Ethereum ETF - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) began to accept comments on Fidelity’s proposed spot Ethereum ETF through a Nov. 30 filing.\n\nThat filing indicates that the securities agency is now soliciting comments on a proposed rule change from Cboe BZX. If approved, that rule change will allow the exchange to list and trade Fidelity’s Ethereum Fund shares.\n\nThe SEC’s request for comments resembles similar filings regarding other spot crypto ETF proposals. It asks for comments about surveillance, custodianship, and market manipulation, among other matters. Notably, the filing highlights a surveillance sharing agreement that Coinbase and Cboe BZX established in June, a critical component also found in many other pending spot crypto ETF proposals.\n\nThe filing also acknowledges a lack of existing U.S.-regulated and U.S. exchange-traded investments that provide exposure to ETH, whereas European markets already offer regulated investments that provide exposure to spot crypto assets.\n\nDecision likely by March 2024\n\nThe filing sets a timeline for the SEC to approve, disapprove, or start proceedings to determine whether to disapprove the proposed rule change. These comments are considered in the final decision-making process. The SEC is required to reach a decision within 45 days of the current notice’s publication in the federal register; however, the SEC can extend the decision period by up to 90 days and then further by 60 days if necessary.\n\nThough exact deadlines may differ, Bloomberg ETF analyst James Seyffart estimated that the SEC’s next decision deadline for Fidelity will be Jan. 21, 2024, and its final decision will be March 8, 2024. He added that he will have knowledge of “definitive deadlines in the coming weeks.”\n\nFidelity initially filed for its spot Ethereum ETF on Nov. 17, days after its competitor BlackRock filed for an equivalent fund on Nov. 15. Both firms also filed for spot Bitcoin ETFs this summer starting in mid-June.\n\nSeveral other asset managers, including Ark Invest, VanEck, and Grayscale, also have pending spot crypto ETF proposals.\n\nMentioned in this article"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPRHBES1c1M0pldUVFcjN6dWFlOHEtLXEwUGMyM2Z5U3paNm9XWkl1bk9fN09tSjdQbVlrRGtJcDVFb1BwQjVHQi0tQ09sdHF3YzlGTUVHYjltSDR2b2pESXZxbmR2Q041Tk5RM2pxY1VfRzNGb1pHcE9hQmxqWXdlOHV1bHBBcHNwWlFvU2ZXZTVQOXFZZnJuR3JzaFdqNUxHY3R6cjBPTmx5MWJ5RHRQTVFKenNyVTdNNjBtaVd6RGtLOXdvZ1FIN2pKNjZYVUp0NUo1Z21n0gHbAUFVX3lxTE11amJQMzBFYWk3S1UzNS1fRjRKWkZHZUJpd2JWMzROemJmdlRVMjhVS1NrRzdnSFJFdk94TTFWRXdoc0d0Um9BNS03UzdzWG1zdXBvYW5GRUdIUlFnQVM1UVVQaDlLek1zY204cndFdl9IQ01ZZTdUUWhzRzJfb2FoZ2ItOVVFQUlFMVFFOHAyTlhFTlVSM0lRSDREX2puc05ldlFMUGh1T0ZjTmdZTlJXZnk4WS1TZ2RPekZUQTB3azBBTzZWYmxyYVZ2UzJzVmtVbW9qWmtfWE52VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH top-down analysis hints upside is capped at $2,500 - FXStreet",
        "content": "Ethereum price trades in a clear consolidative trend on the weekly time frame between $1,933 and $2,141 barriers.\n\nThe daily chart for ETH shows a sweep of Monday’s high is likely to be followed by a sweep of Monday’s low at $1,985.\n\nIf Bitcoin price undergoes a steep double-digit correction, Ether could also slide to $1,933 and $1,829 support levels.\n\nEthereum (ETH) price shows an ongoing consolidation with no directional bias. But a closer look at the daily chart shows that a potential correction might ensue, especially if Ether is influenced by Bitcoin (BTC).\n\nEthereum price prediction thesis and short-term bias\n\nAccording to Exchange-Traded Fund (ETF) analysts, Bitcoin spot ETF is likely to be approved in January 2024. This development has caused FOMO among market participants, making the overall market outlook resoundingly bullish. Interestingly, this is one of the main drivers of the 2023 bull rally.\n\nRead more: Week Ahead: Bitcoin’s bull trend in question as spot ETF momentum fades\n\nBut as the holiday season begins to kick in, liquidity in the market will diminish. Hence, cryptocurrency prices are likely to face manipulation. Additionally, Bitcoin price has already started to slow down its rally and has flashed multiple sell signals.\n\nIf Bitcoin price faces a minor correction, altcoins will shed double digits easily due to the nature of the connection between the two. Likewise, the Ethereum price will also see a correction to key support levels.\n\nRead more: Bitcoin Weekly Forecast: ETF delay and weekly swing failure could crash BTC to $30,000\n\nThis top-down Ethereum price analysis takes a look at ETH from weekly and daily time frames and forecasts buy-the-dip levels.\n\nEthereum price at critical levels on the weekly chart\n\nEthereum price has been in a multi-month consolidative trend that has produced an ascending triangle setup. While the technical formation is inherently bullish, it is only after a successful breakout. So far, ETH has not produced any discernible breakouts, just failed attempts.\n\nThe ascending triangle setup contains equal highs and higher lows, connected via trend lines. This setup shows that investors are becoming increasingly bullish and buying dips at an increasing rate.\n\nA breakout above the $2,000 psychological level was the first sign of a bullish move, but there has been a lot of back-and-forth around this level. To be precise, ETH is hovering between the second quarter high at $2,141 and weekly support at $1,933. This has been happening for the fourth consecutive week.\n\nWith Bitcoin’s trend weakening and signaling a potential double-digit correction, Ethereum price might also catalyze a downside move to flush early longs. In such a case, ETH might eye a retest of the monthly open at $1,814 and a sweep of the monthly low at $1,782. This move would constitute a 9% to 12% move.\n\nETH/USDT 1-week chart\n\nETH bulls likely to take a backseat soon\n\nThe daily chart for Ethereum price shows more nuanced key levels, some of which coincide with the ones seen on the weekly.\n\nFor starters, this week’s Monday range extends from $2,071 to $1,985. While the Monday high was swept on November 28, investors can expect a sweep of the Monday low in the coming days.\n\nA quick move to the downside with the intention of sweeping Monday’s range could lead to a steep correction, especially if it is backed by BTC bears. In that case, investors need to take a look at the 40% Ethereum price rally witnessed between October 12 and November 10. This upswing created a local top at $2,138, and the midpoint of this move rests at $1,829, which coincides closely with the monthly open at $1,814 and monthly close of $1,782.\n\nAll in all, the $1,750 to $1,850 range seems like a good place to buy the dip if it ever comes to that.\n\nETH/USDT 1-day chart\n\nWhile the short-term bearish or correction outlook is logical, it is completely contingent on Bitcoin’s sell signals. If BTC lures shorts via a minor correction and proceeds to blast through $40,000, it would obliterate short sellers and cause a massive liquidation event that could sustain a move beyond $40,000.\n\nIn such a case, Ethereum price could overcome the $2,232 hurdle and eye a retest of the weekly resistance level at $2,521."
    }
]