[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNVW5IQWdNYnlIT3BiQjQxWGxwS25ZdXhUV0x1Z1JkSUJ4dHBfSU5TWjFjeC1EdFVpWkFEVlpPXzN3VGhqWVdLV2tSUHQ0X01fMWdKOUcwdUlNMm5aMDZSc2N3dXEwVElDQ1NKODJJM3lNT0dLbTJYbTMzc2U5aFNKVm5QUlUwNWZRa0NLd1VfRnhzTGxMWllWWDhrenk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Wants Ethereum To Become ‘Cypherpunk’ Again - Crypto Times",
        "content": "The developer and co-founder, Vitalik Buterin, wants Ethereum to become cypherpunk again, as it was in 2017 before financial applications took dominance over the network.\n\nIn his latest blogpost shared on December 28, Vitalik said that Ethereum was originally introduced as a “decentralized shared hard drive,” which ought to serve peer-to-peer messaging and decentralized file storage.\n\nHe amplified that Ethereum’s vision faded in 2017 after it saw a variety of DeFi applications boom and “financialization.”\n\n“Having lived through that era, the number one culprit that I would blame as the root cause of this shift is the rise in transaction fees,” said Vitalik, adding that “When the cost of writing to the chain is $0.001, or even $0.1, you could imagine people making all kinds of applications that use blockchains in various ways, including non-financial ways.”\n\nWhen the transaction fees go up, it’s only used and essentially fueled by “degen gamblers” who are willing to play more and more as coin prices go higher and “they are getting richer.”\n\nVitalik also noted that Ethereum has advanced in other ways, which include innovations such as rollups, zero knowledge (zk) proofs, account abstraction, and more. He also reminded everyone of the core values on which the foundation of Ethereum is built.\n\nMake Ethereum Cypherpunk Again – Vitalik.eth.limo\n\nFurthermore, he also noted developments on Ethereum that address internal as well as outside-ecosystem issues, claiming that while Bitcoin is trying to solve two or three problems, Ethereum has many communities that focus on different visions.\n\n"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPaE1uSDExUXJYSkZBelNXX3VlTE82NDlzeUNwMy1VQ1RTOVFvc0ctcG5wUUpGc3J5Y2hoSVFEZGlpc0hJMXl2Z2h0Y0MzaHpyMU9SbFFQMnZSNWU1ekxna1M1dTkyclZQTDNjSFE4NklxdlpzRDN3My1hYmN4SE9YUXNLRjh0Rzc3bm9NTmN1SlYyU3pqM0pUVWJSS2w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Solana's Impressive Comeback, a Real Threat to Ethereum's Supremacy? - Cointribune EN",
        "content": "Fri 29 Dec 2023 ▪ 3 min read ▪ by Fenelon L.\n\nWith its SOL token back well above 100 dollars, Solana marks a resounding comeback and positions itself as a formidable opponent to Ethereum’s dominance. Let’s dissect the mechanisms of this resurgence.\n\nDoes Solana’s Shadow Loom Over the Realm of Ethereum?\n\nLaunched in 2020, Solana bets everything on speed. Its blockchain can process 65,000 transactions per second, compared to a mere 15 for Ethereum. A considerable advantage for attracting decentralized finance (DeFi) projects and cryptocurrencies.\n\nIn 2021, this argument captivated the masses. SOL surged spectacularly, from $1 in January to $260 in November. Its proponents even announced that Solana was on track to overtake Ethereum in the smart contracts market.\n\nHowever, the FTX debacle changed the game. The crash of Sam Bankman-Fried‘s platform, closely linked to Solana, sent SOL below $10. The blockchain also faced criticism for its technical vulnerabilities. Its future seemed uncertain.\n\nA Spectacular Comeback\n\nYet, the tide began to turn at the start of 2023. SOL rebounded sharply to $20 after the FTX collapse, and then surpassed $100 in mid-February.\n\nSeveral factors explain this rebound. On one hand, investors are returning to cryptocurrencies after difficult months. On the other hand, new projects are emerging on Solana, attracted by its low transaction fees.\n\nTrading volumes are surging, fueled by risky speculation. Last weekend, Solana even overtook Bitcoin and Ethereum in terms of spot transaction volume in SOL/USDT, reaching an impressive $1.037 billion on Binance.\n\nDoes this spectacular comeback mean that Solana is threatening the dominance of Ethereum? Not yet. With 29 billion dollars of assets locked, Vitalik Buterin‘s blockchain remains well ahead. Solana is worth 15 times less, at 1.5 billion according to data from DefiLlama, despite its rapid growth.\n\nNevertheless, this contender poses a serious threat. Solana continues to attract projects thanks to its low fees and record speed. If it overcomes its stability issues, it could continue to gain market share from Ethereum in the coming years. Their rivalry promises to be thrilling.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOb3ZGU1hSSjl3YVYzTWxNMF9qU3RKc2hqRkU4RWMtWlpXbXpIcWR6VjUzVm5Oa2pVeDdmMDMyZHdQSVQ0YmNfTTFIR2hERGtJNVlma19uVmJWOS1LTVpxR0tUbTZ0UFJiTm9nbU9kUUFfVFRVRElwYlhKcnhIWFN1NnMtMWpHNnRsdUMwai00cDdiYTJxQ3p5bE0wclc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Arthur Hayes on Why Bitcoin Is Money and ETH Is a Shitcoin He Loves - Unchained",
        "content": "Episode 587\n\nArthur Hayes, Chief Investment Officer of Maelstrom, delves into the anticipated bull run in crypto, the potential collapse of the traditional financial system, and his unique take on Bitcoin, Ethereum, shitcoins, and more.\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Pandora, Castbox, Google Podcasts, Amazon Music, or on your favorite podcast platform.\n\nAs 2023 nears its end, the crypto community is abuzz with speculation: will the relentless crypto winter give way in 2024? Crypto OG Arthur Hayes is confident that crypto is on an upswing. According to Hayes, these market cycles are historically recurrent, indicating a potential bull run in the near future.\n\nIn this episode, Hayes offers his insights on a range of compelling topics, from what he believes will be a resurgence of central bank money printing between 2024 and 2027 to the effect spot Bitcoin ETFs will have on crypto markets.\n\nHe also shares his views on the post-FTX blockchain landscape, the dynamics of Ethereum and memecoins, and why he thinks Tether won’t last.\n\nShow highlights:\n\nWhy Arthur believes that central banks across the globe might resort to printing money again between 2024 and 2027\n\nWhy he’s anticipating a bull run in the crypto market within the next year\n\nWhether the financial system established post-World War II is on the verge of a breakdown\n\nWhat Arthur recommends investors should do in the event of a spot Bitcoin ETF launch\n\nWhy he is confident that the launch of a Bitcoin ETF won’t immediately lead to a massive surge in prices\n\nHow, according to Arthur, the collapse of FTX actually validated the resilience of the blockchain ecosystem\n\nWhether the DCG crisis is likely to have a far-reaching impact on the crypto industry\n\nWhy Arthur maintains a bullish stance on ETH and the Ethereum ecosystem, despite labeling it a “shitcoin”\n\nWhether he sees the use of the Bitcoin blockchain for trading memecoins (BRC-20s) as problematic\n\nWhy Arthur thinks Tether’s dominance will be challenged with the entry of major U.S. banks into the stablecoin market\n\nWhy he firmly believes that AI systems will favor Bitcoin over traditional forms of money\n\nWhy, in Arthur’s view, China may not aim to become the issuer of the global reserve currency\n\nThe investment strategy of Arthur’s family office, Maelstrom\n\nThank you to our sponsors!\n\nGuest\n\nLinks\n\nMacroeconomics\n\nBitcoin ETFs and markets\n\nSBF and FTX\n\nCZ and Binance\n\nEthereum, Solana, memecoins:\n\nArtificial intelligence\n\nStablecoins:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTmVpNWVxbGZhdHp3UGdRYzNwaldNTnljaDVqd043dllDQloxNjBuejRaMVlIeVd6NTYtQXJiMzJ2bWpKV3dBZDE1UV9rUEdLeUw2bF9fRFhuQzdETmZ6bmF1N29aaWtxRG9malNwSUw2RmdNV3ZuTFUtREg1RnQwZFFwdFdJRmx4dXo3WmtTWmJDQkJtdjJZMzJWbWZyU2dhSV8zc2tUT1ktUGxUN2dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Vitalik wants Ethereum to be more ‘Cypherpunk’ hailing the social layer as its core USP - CryptoSlate",
        "content": "Ethereum’s co-founder Vitalik Buterin shared his insights on the evolving landscape of the crypto ecosystem on Dec. 29, mainly focusing on Ethereum’s role in shaping a more open and decentralized internet in a blog post entitled “Make Ethereum Cypherpunk Again.”\n\nSince its inception, Ethereum has journeyed beyond being a mere extension of Bitcoin with smart contracts. Buterin recalls early memories of using Bitcoin in Berlin’s Bitcoin Kiez and at PorcFest, a libertarian gathering, highlighting the intertwined nature of technological and social aspects in the crypto world. These experiences stress the broader vision of crypto: fostering a free, open society where technology, social, and economic elements harmoniously interact.\n\nThe initial concept of “web3,” as coined by Ethereum’s co-founder Gavin Wood, envisioned Ethereum as a fundamental component of a more open internet stack. This vision aimed to overcome the limitations of the free, open-source software movement of the 1980s and ’90s, which did not account for modern internet applications’ collaborative and centralized nature. Ethereum, along with technologies like peer-to-peer messaging and decentralized file storage, was seen as a decentralized, shared hard drive crucial for extending the spirit of open source into today’s interconnected world. For Buterin, the chart below outlines the core benefits of decentralized technologies.\n\nHowever, Buterin notes a shift in focus since around 2017, with a diminished emphasis on consumer crypto payments and non-financial applications. This shift is partly attributed to rising transaction fees on the Ethereum network, which have priced out more minor, non-financial uses in favor of financial applications dominated by speculative activities. According to Buterin, this change has led to a misalignment with the original vision of Ethereum and the broader crypto space.\n\nLooking ahead to 2024, Buterin highlights several positive developments in Ethereum’s technology that could steer the platform back toward its foundational principles. These include advancements in rollups, second-generation privacy solutions, account abstraction, light clients, and zero-knowledge proofs. These technologies address the challenge of scalability and embody the values of decentralization, censorship resistance, and open participation.\n\nAs part of a broader technological vision, Buterin states, Ethereum continues developing its original components and “sister technologies” such as decentralized messaging and decentralized storage. Introducing zero-knowledge proofs adds a new dimension, enabling privacy and authentication simultaneously. For instance, Buterin notes how Zupass, a zero-knowledge-proof-based system, successfully implemented anonymous voting, demonstrating the potential of Ethereum-based technologies in achieving privacy without sacrificing security.\n\n“We can start to see the contours of what an Ethereum-y cypherpunk world would look like, at least on a pure technical level. We can be holding our assets in ETH and ERC20 tokens, as well as all kinds of NFTs, and use privacy systems based on stealth addresses and Privacy Pools technology to preserve our privacy while at the same time locking out known bad actors’ ability to benefit from the same anonymity set.”\n\nButerin also emphasizes Ethereum’s role in developing a decentralized tech protocol stack, competing with traditional centralized systems. This stack includes banking, social media, and identity verification alternatives, highlighting Ethereum’s commitment to building tools that interoperate with a broader ecosystem rather than creating isolated empires.\n\nThe social layer of Ethereum is equally crucial, according to Buterin. He acknowledges the need for a balance between incentive-driven and community-oriented approaches. Large-scale public goods funding and cooperative efforts within the Ethereum ecosystem are steps toward this balance, yet there is much room for growth and improvement.\n\n“There is a unqiue mix of valuing a warm and cohesive community, but at the same time remembering that what feels “warm and cohesive” from the inside can easily feel “oppressive and exclusive” from the outside, and valuing hard norms of neutrality, open source and censorship resistance as a way of guarding against the risks of going too far in being community-driven.”\n\nUltimately, Buterin envisions Ethereum as a platform that excels technically and economically and fosters a robust and value-driven community. Buterin closes his post by stating,\n\n“If this mix can be made to work well, it will in turn be in the best possible position to realize its vision on the economic and technical level.”\n\nButerin believes integrating technical innovation with social and ethical principles could potentially lead Ethereum to realize its original vision of a decentralized, open, and equitable digital world.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxOd0c4Q0RNSHNTRWY3T0RGRXRWdEp3UV9GUE9ISnpJeWJmcjJsZF9VZkNZLUVSM29iMGxfWFZvaVJKTC1pQUhTMWdFNl8xazE0WTZjYlR5M1RYODVZWDhVTl95R1BNQkt1WEtVUmlSR2pacjhkZi1fZC1wVFpZampwOWY1dWVTa2lnU2ctS05kWlRHdzd3X29MUHpySXVmXy1lcE9UTWc1Ny01LVphcTNBRlN3ZGxDa3J3SFJBS2RvQzhCa1lOOTRCczBEYUF5dUFaa3h2c2V2Ym50VTBJWjM4N3BVcVlmMEVtQlhraTh2cy1ReGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "ZkSync: L2 privacy surpasses Ethereum blockchain - The Cryptonomist",
        "content": "ZkSync, a layer-2 blockchain developed by provider Matter Labs and focused on scalability and privacy, has surpassed the Ethereum mainnet for the first time in terms of number of transactions executed.\n\nIn the last 30 days, Zksync has recorded a total of 34.7 million transactions compared to Ethereum’s 34.2 million.\n\nThis is mainly due to the new trend of inscriptions, which after targeting the Bitcoin network, is now expanding within the EVM chains sector.\n\nWe will see if the attention on this type of digital products will remain high even in 2024.\n\nAll the details below.\n\nZkSync, a privacy and scalability-focused rollup, outperforms the Ethereum blockchain thanks to the trend of inscriptions\n\nThe zero-knowledge rollup ZkSync, which focuses its efforts on optimizing scalability and privacy, has managed to outperform the Ethereum blockchain, which it relies on as a second-layer solution.\n\nIn the last 30 days, according to L2Beat data, there have been a total of 34.7 million transactions on ZkSync, while on its main network there have been 34.2 million transactions, resulting in a positive difference of approximately half a million transactions.\n\nWith this record, L2 ranks first in the EVM network ranking that has recently recorded the most tx, ahead of competitors Arbitrum, Optimism, DyDx v3, Base, and ImmutableX.\n\n\n\nThese data are justified by the recent introduction and diffusion of “inscriptions”, which is a metadata registration feature originating from Bitcoin, on all networks that support the Ethereum virtual machine, including the vast Ethereum L2 landscape.\n\nRegistrations allow you to obtain alternative NFT to the classic resources generated through smart contracts, adding information such as text, images, videos, and even additional code within the ID of a transaction, all without losing the advantages of privacy and security.\n\nThis, although it may seem more cumbersome and sometimes even obsolete, allows you to save fees when it comes to including complex data within a smart contract and therefore is preferred by developers and users.\n\nThe data from L2Beat shows that the zkSync blockchain recorded its largest increase in monthly transactions on December 16th.\n\nIt was then that the synchronization registration was launched on the network and accounted for 4.6 million out of the 5.3 million transactions on that day alone, according to Dune’s data aggregated by Dragonfly analyst Hildobby.\n\nIt is rare for an L2 network to surpass its main network in on-chain metrics, but given the interest and development that has been revolving within the Ethereum rollup sector lately, and the increasingly captivating narrative of inscriptions, it is possible that in the future these opportunities will become more frequent.\n\nThe ZkSync Cryptographic Ecosystem\n\nThis is not the first time that the layer-2 blockchain Zksync has made headlines, having become the protagonist of several records in the last year, thanks above all to a growing cryptographic ecosystem.\n\nThe zero-knowledge rollup solution was launched in March and has immediately succeeded in scaling the Ethereum mainnet, without compromising the security and privacy of the infrastructure.\n\nIn a short time, it has established itself as one of the leading players in the EVM chain sector, reaching a significantly high Total Value Locked.\n\nSpecifically, as of today ZkSync has a TVL of 581 million dollars, second only to Arbitrum and Optimism’s optimistic rollup versions, which have locked values exceeding one billion dollars, and to competitors Metis and Base.\n\nIt is not excluded that the cryptographic solution of Matter Labs will be able to further climb the rankings in the coming months, reaching the top 3 of the most used L2s in the world, especially if a gas token is launched to support its growth.\n\nLooking closer at the composition of this blockchain, we see that the protocols that have contributed the most to its growth are mostly DEX, which allow on-chain cryptocurrency exchange through an AMM (Automated Market Maker) platform.\n\nAmong these, the favorites of DeFi users have been ZKSwap, SyncSwap, Mute.io, Maverick, Velocore, Space.Fi, IziSwap, Pancakeswap, and ZkSwap Finance.\n\nOverall, DEXs on Zksync encompass the majority of TVL managed on the network, channeled into a multitude of decentralized pools that allow for the free exchange of cryptographic resources.\n\nThe category that has had the most impact on the success of ZkSync is the Lending platforms such as Reactor Fusion, Zero Lend, and ZkLend.\n\nFinally, we find decentralized applications for derivative trading such as Derivio, Holdstation, Satori, Rollup Finance, and Fulcrom.\n\nFurthermore, it is necessary to consider the boost of on-chain activities that has been given thanks to the narrative of crypto airdrops, which have encouraged Ethereum rollup users to prefer this blockchain precisely because of the possibility of a reward for its early adopters.\n\nWith $458 million raised in funding from external investors, Zksync promises to carry out one of the largest airdrops in the history of the blockchain world.\n\nThis factor, together with the new trend of inscriptions, could bring the L2 network to another level, where imagination still cannot reach."
    }
]