[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNa3hiLUd3Y0RTbGVUY0NwLVYzZEVPUm1YMVBPajVKRTkzWjBQalBIalp3RW56TXhiVkduOHlDeFhqUkw4c3M5WFJyeVdXazR1UHhfdHUzZXFnaU5qblJncHMtRTh4MHR1elVxeGRidGdONXRYZk52WnVISmtWTlFYSUp0cnpLLU5HbnhEdnVCbjk5WGJ2OUNrbEY2X2U3SDU0WHQwUzVVMVBJcXk3OGJ4WC1QRjJMT1F2X09yTGJtZ2twOU9WVnJHOFRjSy1ZVklmaFR2RWJySXQ2QnpJ0gHiAUFVX3lxTFBWRzhkT1ExLXZWa0wyMHFIeUk0YXhPbjZQOXQ3eE9wR25JaHZ0bXVxeFVoU2xiV0xxTnhjVjZ1Rm5NeGtTM0pXclZjcnB5dUlNU3VTYUhadlQzVlFWMHBGajVFN2hjYzlEWmsxR3hvbENVX0NHWUlVWEdLaGRxaFk3T3UtVjJqblJEamJZRE1BSEI3Z0RnYXIwckFvYjJWVE1ZWUV5cTZORXMzeXZfdW9pOXZJOW5WT3lQczBSQjc3LUhVUnBGX3l5N2dMTHAyaEVlQ3FEUEU3cXFsQWlmN3pYSEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "ETH Soars Above $2K as BlackRock iShares Ethereum Trust Registered as Corporate Entity in Delaware - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZEpnRlJlcmhyRUV5cmNfMUx2bERRNnV5ZzVjcUpUODlpLVZhdU5XdmNyRDduMFRWTFdnc3ZSM2lncDFLcGxoYkJibHNHazcwd2ZnQzM5ZGczdGhIM2wtbmFueUtIdFlOVTl1WTFuM2FfTFFkR3NxbjR0cmpfREdzQ09mNllHa3BjdlhvdVZ6RXlMY2ZD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Price Analysis: Ethereum Hits 6-Month High on BlackRock ETF Speculation - Crypto Briefing",
        "content": "Share this article\n\nEthereum prices topped $2,050 Thursday, reaching the highest level since May. The rally comes amid rumors that BlackRock may soon file for an Ether ETF.\n\nThe chart shows Ethereum remains in a clear uptrend, with the 50-day SMA and 20-day EMA providing dynamic support.\n\nHowever, the RSI is overbought at 80, signaling the rally may be overextended short-term. This could lead to a pullback or consolidation as the indicator cools off.\n\nUpside resistance may emerge around the current highs and psychological levels above $2,000. Support could be present around the key moving averages.\n\nIf the uptrend continues, Ethereum could target new highs above $2,100. But overbought conditions raise the chance of a correction, which could retest previous lows if the trend shifts bearish.\n\nBlackRock registered the iShares Ethereum Trust this week, sparking speculation it will submit an ETF application to the SEC soon. The asset manager took a similar step before filing for a Bitcoin ETF."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPZnIxQmxUMVVWS2llbVRtQ0hpTWNjalNDVmQ2ZXFZajRCYTVQTXdfUFR5WGVxVlRyWnhSOWxyZDZNMXl2Ul9TT2UtQlczalFkeXRiUlRTaWpSZEFTTkNnR3Vybmp4MjZWbkVVRG1QQVFSckc2Y242ZHpQY3Y0eFdNSGpyUFNzRXB5aXY0MzBmQXljeVIzeFhDUk930gGfAUFVX3lxTFBSQTZkZFF1MFIzcy1HWHpwbnRwcVgzNDRDZjladTNmN3dBSWYxMmx3eVZ6WVJVT2N5bzRzR3c5OTBRZExESngzZHdaU2ZjRkJyMmV6eUI3Z3ZvNkxUZW45RTd1cUhUeDZZb0tfTUNBWTVIanMyYTVwV3RWQ2N4NjRRcWRUZ3VzWlFMSlhqbm9Tamxjc2xnRnJPZnFobzFwcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "BlackRock appears to take first steps toward an ether ETF - CNBC",
        "content": "The BlackRock logo is displayed at its headquarters in New York City, Nov. 14, 2022.\n\nAsset management giant BlackRock appeared to take the first steps toward an ether ETF on Thursday, sparking a rally in the cryptocurrency.\n\nThe website for Delaware's Division of Corporations showed that an iShares Ethereum Trust was registered Thursday. A similar notice for the iShares Bitcoin Trust came one week before BlackRock's filing for a bitcoin ETF in June.\n\nBlackRock declined comment on the matter. The firm's iShares product is the leader in exchange-traded funds with more than $2.3 trillion in assets under management.\n\nThe price of ether jumped 7% on Thursday, topping $2,000 for the first time since April. Bitcoin's price saw a similar rise when asset managers began filing to launch ETFs this summer.\n\nThe Securities and Exchange Commission has still not approved a bitcoin ETF. The regulator has long opposed such a fund and blocked Grayscale's attempt to convert its bitcoin trust product into an ETF, though a court overruled that decision in August.\n\nThe SEC did not appeal that court decision but still could choose to block Grayscale's conversion and the other bitcoin funds in the pipeline, including BlackRock's, for other reasons.\n\nIf the SEC does allow bitcoin ETFs, then ether funds would likely be next in line. Ether is the second most popular cryptocurrency behind bitcoin.\n\nDon't miss these stories from CNBC PRO:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZ3gxTUY3M0tRanlUY2lpQmFwcHIxWHdpeWlRNEJhZkgxTVE1WnJrQXpNb0VPQ0F2al9mblNjSXY4S3lmUUtrNE9uM3lkSGZDRV9xb3cxbDdQU0oyM1p4czhuNklTWFJGVVY0eG9uXzFsNVVUdmo2eTI1NEk4X1JBTGFubjJ4OGJOb0paXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "ETH crosses $2k as BlackRock’s Ethereum Trust ETF filing surfaces - CryptoSlate",
        "content": "BlackRock has taken the initial step toward filing for a spot Ether ETF, with the iShares Ethereum Trust recently registered in Delaware.\n\nThis move is reminiscent of BlackRock’s iShares Bitcoin Trust, which was registered in a similar fashion seven days before the ETF application was filed with the U.S. Securities and Exchange Commission (SEC).\n\nIn the context of an industry bristling with anticipation for the approval of a spot Bitcoin ETF, BlackRock’s move potentially signals a pivotal moment for Ethereum, shedding light on its status as a prospective asset class in institutional investment portfolios.\n\nDespite the positive indications, it’s important to recall the precedent set by the SEC’s handling of Bitcoin ETFs. As reported by CryptoSlate in October 2023 Source, despite rumors indicating otherwise, the SEC had not approved the iShares Bitcoin ETF. The regulator had delayed its verdict on several proposed rule changes, which included applications from leading firms such as Fidelity (Wise Origin), VanEck, WisdomTree, and Invesco.\n\nIn light of this, BlackRock’s iShares Ethereum Trust registration, while a significant development, leads us into a territory of considerable uncertainty. The SEC’s previous hesitance to approve Bitcoin ETFs might cast a long shadow over BlackRock’s budding Ethereum trust, potentially heralding a new cycle of applications, approvals, delays, and rejections.\n\nAs the crypto community watches these developments with bated breath, two things have been game-changers for the industry: Grayscale’s court victory and BlackRock’s entry into the market. Ethereum ETFs, in this context, may just be the next frontier. However, for now, all eyes are trained on the SEC as the crypto industry awaits its verdict on the pending rule changes and the potential approval of BlackRock’s iShares Ethereum Trust.\n\nBlackRock’s Ethereum Trust filing surfaces as another key narrative to monitor closely. As the crypto industry continues to evolve and mature, such developments underscore the increasing intersectionality of traditional finance and digital asset markets, hinting at a prospective future where digital currencies like Ethereum may become more commonplace in institutional investment portfolios.\n\nMentioned in this article"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWDZZcUtCRDBjNDFwaDQzNEg2aEs4UFUzdVJOLTl0dUZuQXJrNnlSWm1YTXU4XzY2YmE2YTZudl96R1ZQbkdPbURmRnJnV2xIQVM0VUhrU00tb056NWlKY2Njc3BPTTlhUEJaVnFUQ3Jad2JpWUw1eDFEa0VKQ1E3aGhDLUpmRkpkX25BZk1OUXpsR2RqMTE3dDVGNDdtNmlqam5z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin approaches $38,000 and Ethereum crosses $2,000 as ETF fever continues to buoy the crypto market - Fortune",
        "content": "The world’s largest cryptocurrency by market capitalization continued to push past year-long highs, as Bitcoin approached $38,000 late Thursday morning, an approximately 7% increase in the past 24 hours, according to data from CoinGecko. Its peak of $37,935 was the highest the coin has reached in more than 18 months.\n\nEther, the token for the Ethereum blockchain and second-largest cryptocurrency by market capitalization, was also up, crossing the $2,000 mark for the first time since July on the back of an 8% day-over-day price upswing.\n\nThe market capitalization for all cryptocurrencies increased approximately 5.4% day-over-day to $1.45 trillion, as some of the other largest coins on the market saw large gains as of Thursday morning, including Cardano (8.2%), Solana (9.9%), and Chainlink (12.7%). The movements in the crypto markets far outpaced the stock indices, with the NASDAQ and S&P 500 basically flat over the past 24 hours.\n\nBitcoin’s recent upswing is mainly due to “optimism around a near-term spot Bitcoin ETF approval and a resulting short-squeeze,” Brian Rudick, a senior strategist at crypto trading firm GSR, told Fortune, referring to a Bitcoin-based financial product that traditional investors can trade. And on Thursday morning, BlackRock registered the name “iShares Ethereum Trust” in Delaware, an indication “that it is likely to file a spot ether ETF application soon,” he added.\n\nDavid Lawant, head of research at crypto brokerage and trading platform FalconX, echoed Rudick’s assessment. Bitcoin “continues to perform well as the market focuses on the U.S. spot ETF approval process,” he told Fortune, adding that the “big star of the day” has been Ethereum, following news of BlackRock’s registration of the “iShares Ethereum Trust” name.\n\nhttps://datawrapper.dwcdn.net/ToPGM/2/\n\nThe rapid rise in the prices of major cryptocurrencies continues a month-long rally in the digital assets market. The total market capitalization for all cryptocurrencies has rocketed about 30% since Oct. 9, rising alongside optimism over the likely approval of a spot Bitcoin ETF, or exchange-traded fund.\n\nTraditional investors, who manage trillions of dollars in capital, are largely constrained by the investment products available on portfolio management platforms like Vanguard or TD Ameritrade. If the Securities and Exchange Commission were to approve a spot Bitcoin ETF, which lets traditional investors trade on current Bitcoin prices, crypto industry boosters are betting that tremendous amounts of capital would flow into the Bitcoin—and crypto—markets.\n\nWhile the industry has repeatedly tried and failed to convince the SEC to approve a spot Bitcoin ETF, BlackRock, the largest asset manager in the world, filed an application for its own spot Bitcoin ETF in June. Since then, the crypto markets have rallied, and other financial institutions have filed their own ETF applications, hoping to cash in if the SEC were to approve the application from BlackRock, which has a sterling record of past ETF approvals.\n\nAnd starting Thursday, a brief period for the SEC to approve a spot Bitcoin ETF opened, according to Bloomberg Intelligence analysts, who believe that, even if approvals don’t come in November, there is a 90% chance of approval by January.\n\n“There is significant hype surrounding the recent comments from Bloomberg regarding the ETF ‘window,'” James Butterfill, head of research at CoinShares, told Fortune. “Admittedly, it is always a little worrying when prices rise so sharply. That said, as we enter into this new bull market, it is worth reflecting on the point that we remain well below the all-time-highs seen in 2021.”"
    }
]