[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNdi0zV21RblROUmJQVE9BR0RPX1pjNkxlN1QyVDh1cHpzZy1UZmVDVWhIS09DWE9hVjFOU3pqa2hZU1BqZXVJUTRJdE1xMENSUkQ0bWNiTkpyNmRFVmVNYUVmeTRkb1ZUU0dNbnFTZy1tN3FMRnpKN0psdmNKR24xUFEwM3doa3BDSWVEM1N3UUZoMHF5OTdUTnVSMlhLNDlm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 31 Dec 2023 08:00:00 GMT",
        "title": "Goldman Sachs crypto head expects pension fund investor to surge with Bitcoin & Ethereum ETFs - Crypto Briefing",
        "content": "Crypto ETF approvals could attract a portion of the $5.6 trillion US pension market to crypto.\n\nShare this article\n\nThe approval of exchange-traded funds (ETFs) for spot Bitcoin and Ethereum will unlock “the universe of the pensions, insurers, etc,” says Mathew McDermott, global head of digital assets at investment banking giant Goldman Sachs.\n\nIn an interview with FOX Business, McDermott discussed the future impact of spot ETF approval on institutional adoption and commercial opportunities within the digital asset sector.\n\nAccording to McDermott, spot crypto ETFs will create “institutional products that can be traded by institutions that don’t need to touch the base assets.” This will enhance liquidity and attract more pension funds, insurance firms, and other institutional investors to crypto.\n\nWith the US pension market now over $5.6 trillion, it’s easy to see why McDermott envisions spot crypto ETFs attracting institutional capital. The approval of such products would enable more institutional participation in the digital asset space.\n\nMcDermott noted that while spot crypto ETFs may have a gradual impact rather than an immediate spike, he expects to see “a broadening and a deepening of liquidity and those looking to trade the product” in 2023.\n\nThe Growth Potential in Digital Assets\n\nLooking ahead to 2024, McDermott believes the blockchain industry will continue expanding due to increasing real-world adoption and supportive regulations. Over the past year, clearer policies and frameworks have already driven more institutional involvement in crypto.\n\nEarlier this year, Goldman Sachs announced the launch of its tokenization platform, GS DAP, to streamline the issuance, management, and trading of tokenized assets across various asset classes.\n\nIn 2020, Matthew McDermott joined Goldman as head of digital assets. Known for his visionary approach to financial markets, he believes blockchain technology is key to revitalizing and empowering the financial system."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNdi0zV21RblROUmJQVE9BR0RPX1pjNkxlN1QyVDh1cHpzZy1UZmVDVWhIS09DWE9hVjFOU3pqa2hZU1BqZXVJUTRJdE1xMENSUkQ0bWNiTkpyNmRFVmVNYUVmeTRkb1ZUU0dNbnFTZy1tN3FMRnpKN0psdmNKR24xUFEwM3doa3BDSWVEM1N3UUZoMHF5OTdUTnVSMlhLNDlm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 31 Dec 2023 08:00:00 GMT",
        "title": "Goldman Sachs crypto head expects pension fund investor to surge with Bitcoin & Ethereum ETFs - Crypto Briefing",
        "content": "Crypto ETF approvals could attract a portion of the $5.6 trillion US pension market to crypto.\n\nShare this article\n\nThe approval of exchange-traded funds (ETFs) for spot Bitcoin and Ethereum will unlock “the universe of the pensions, insurers, etc,” says Mathew McDermott, global head of digital assets at investment banking giant Goldman Sachs.\n\nIn an interview with FOX Business, McDermott discussed the future impact of spot ETF approval on institutional adoption and commercial opportunities within the digital asset sector.\n\nAccording to McDermott, spot crypto ETFs will create “institutional products that can be traded by institutions that don’t need to touch the base assets.” This will enhance liquidity and attract more pension funds, insurance firms, and other institutional investors to crypto.\n\nWith the US pension market now over $5.6 trillion, it’s easy to see why McDermott envisions spot crypto ETFs attracting institutional capital. The approval of such products would enable more institutional participation in the digital asset space.\n\nMcDermott noted that while spot crypto ETFs may have a gradual impact rather than an immediate spike, he expects to see “a broadening and a deepening of liquidity and those looking to trade the product” in 2023.\n\nThe Growth Potential in Digital Assets\n\nLooking ahead to 2024, McDermott believes the blockchain industry will continue expanding due to increasing real-world adoption and supportive regulations. Over the past year, clearer policies and frameworks have already driven more institutional involvement in crypto.\n\nEarlier this year, Goldman Sachs announced the launch of its tokenization platform, GS DAP, to streamline the issuance, management, and trading of tokenized assets across various asset classes.\n\nIn 2020, Matthew McDermott joined Goldman as head of digital assets. Known for his visionary approach to financial markets, he believes blockchain technology is key to revitalizing and empowering the financial system."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTE1weFNQOXpkbjlIV3ZNdWFFZU81T0lPaVYxRXp1Wm1TQk1YYWlITWJLX3NOUWZiZXZyYVF5VDlvMll4RGVoVmFkak96dGlhX0l0bkg2dVppMEjSAV5BVV95cUxOOEFkcHFhN2J1eG1VSWNYR0JVYzFLOHM5cExKX3BqTzJrYzdDYzFUazFkLVdOc3l2Zmg4aW5CTDdGNnlMeWJ6SnFtRHZwS0RWbEJ5dmo3QU90eUZCcWR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 31 Dec 2023 08:00:00 GMT",
        "title": "Popular Analyst Puts Solana At $1,000 And XRP At $7, Here's The Roadmap | Bitcoinist.com - Bitcoinist",
        "content": "A popular crypto analyst has predicted a massive increase for Solana and XRP, foreseeing both cryptocurrencies reaching new all-time highs in 2024.\n\nXRP and Solana 2024 Price Prediction\n\nProminent crypto influencer Ben Armstrong has recently published a new crypto price prediction for XRP, the native token of the Ripple network and Solana (SOL). Armstrong made his predictions live on his YouTube channel on December 31.\n\nAccording to the crypto influencer, the price of Solana is expected to skyrocket to $1,000 and XRP to reach $7 within the year. “I believe that XRP will hit $7 and Solana will hit $1000 in 2024. That is not the top, that is not their peak,” Armstrong stated.\n\nNotably, the current market value of Solana stands around $108.75 while XRP which is still below the $1 peg is trading at $0.63, as reported by CoinMarketCap. This would mean an around 1,000% increase for Solana and a 1,100% increase for XRP.\n\nArmstrong outlined a roadmap for his predictions, involving factors such as Ripple’s Initial Public Offering (IPO) and the Ethereum Spot Exchange Traded Fund (ETF) becoming catalysts for the cryptocurrency’s price surge.\n\n“Here’s the difference between XRP and Solana’s bull run. Solana has had its run up into the bull. It will continue to do well but it already has massively overinflated numbers. XRP is going to slowly wind up and at the end when the Ripple IPO launches that’s when XRP will go through the freaking roof. Because not only will it have the IPO, it will also have the Ethereum ETF going,” Armstrong said.\n\nXRP price recovers from crash | Source: XRP price recovers from crash | Source: XRPUSD on Tradingview.com\n\nXRP To Outperform Solana\n\nIn his YouTube video, Armstrong predicted the future trajectory of XRP up to 2025. His projections revolve around the aftermath of the Ethereum Spot ETF potential launch and the possible introduction of an XRP ETF.\n\nThe crypto influencer expressed confidence in XRP outperforming Solana in the future. This prediction could be attributed to the recent positive developments occurring within the XRP ecosystem including the improved regulatory clarity and the widespread acceptance of XRP in major crypto exchanges and countries globally.\n\n“When the ETF gets launched, Ethereum is going to go sky high but what’s gonna happen is people are gonna start thinking about the next coin. What’s the next one that’s gonna get the ETF? This will be in 2025 when this happens. That’s when the XRP gets to long tail at the end of the blow-off top. I think XRP ends the bull run, and Solana starts it,” Armstrong stated.\n\nFeatured image from CoinGape, chart from Tradingview.com"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPaFlOaWhkeVl6MTJYUGRsVkZwaXNYbXp6MFp1cloyMFRDclFDNy1xNmx4MjF5VkV1UW5LRnN6X1E3Zk9hUGdpZ0RLODdKYjBsWjVSUkRJVWJCNEFua0NxQWlVMEh4UjFJWWhFNndFanVLbE5kYjFwdllzREd3eEREVVVvM09QUdIBiwFBVV95cUxNbG9wTXdwS1duSjRwd0M5dDJWR1hoclA2bWh3dGd1c0k3aWxGVHBoWC0wOTVwNzlRWFJWN0dVdkRrcnhVaWI1bmJvMEZTWE1NRmZ2Z1ZRUzhmT2l6b2VtUmVUdU02Q1pYRzFleUwzeUdiRGFCNnBieWc0UW54SWpndE85eURVTTBFbnhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 31 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Rich List 2023: Who Are The Top 10 Largest ETH Holders? - CoinGape",
        "content": "The last twelve months have been nothing short of a wild ride for Bitcoin, Ethereum, and other altcoins, from BTC price revival — the cryptocurrency jumped by more than 160% in 2023 — to innovations in the Web3 industry and non-fungible tokens (NFTs), to the government crackdowns on the industry.\n\nEven amid all this hullabaloo, crypto continues to be an enticing money-making gig. Take the record 19 billionaires — 7 more than last year — who made a fortune after investing in cryptocurrency and blockchain technology.\n\nadvertisement\n\nWhat links Elon Musk, the Winklevoss Twins — owner of crypto exchange Gemini — and Michael Saylor? They’re all connected to some cryptocurrency. While Musk and Tesla are, more often than not, tied to Dogecoin and Bitcoin, respectively, the other two names have significant Bitcoin holdings.\n\nLargest ETH Holder Owns 29% of All Ethereum Tokens In Circulation\n\nWhen it comes to Ethereum, it’s a different story altogether. Even the largest holders of ETH are often out of the limelight. However, data from Etherscan revealed that crypto exchanges were the largest holders of ETH in 2023, which shouldn’t come as a surprise, given ETH’s availability on every exchange.\n\nLet’s look at the numbers. Remember, these are only ballpark estimates.\n\n\n\nThe Beacon Chain Contract holds more than 35 million ETH, controlling over 29% of all ETH tokens in circulation, making it the largest ETH holder as of Dec 28, 2023. Coming in second place is Wrapped ETH (WETH) with more than 3.2 million ETH, worth around $7.7 billion.\n\nBinance has significant ETH Holdings\n\nIt’s only fitting that the world’s largest crypto exchange, Binance, is the third-largest single address for ETH, holding more than nearly 2 million ETH. Kraken, which was sued by the US Securities and Exchange Commission (SEC) last month for deceptive practices, grabbed the fourth spot, with ETH holdings of roughly 1.6 million.\n\nPopular trading platform, Robinhood is fifth on the list. At the time of writing, it had more than 1.4 million ETH under its belly, which loosely translates to about 1.24% of all ETH tokens in circulation.\n\nNotably, two other wallet addresses in the top 10 — each holding more than 550,000 ETH — are linked to crypto exchange giant Binance. Rounding off the top 10 are Arbitrum: Bridge, with holdings of over 1.3 million, and Bitfinex, with more than 450,000 ETH.\n\nIt’s also worth mentioning that an ETH address linked to Vitalik Buterin, one of the founders of Ethereum, named VB 3, holds more than 240,000 ETH.\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBQenVGT2JxV1N6ZV9MZU1lZldGcnREMk5jVmRwNmJMZ1k5OXZDS2tCc2J3YmFTeVljVWRZTVZsQ3lwSlVnUXlULWgxdDFOZ19DdlZJc1BOeFMyRnZJdF9tenZMbEhJdlFNMlBV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 31 Dec 2023 08:00:00 GMT",
        "title": "It’s a Solanaissance: These 5 charts will cure the Ethereum vibecession - Blockworks",
        "content": "Ethereum is out and Solana is in.\n\nEthereum, its mess of layer-2s and neverending scaling roadmap are doomed to be usurped by its younger “monolithic” rival.\n\nAt least, that’s what the rabblers on X are saying.\n\nThe sagging ETH-to-BTC ratio surely isn’t helping. Bitcoin has swelled 160% this year, while ETH hasn’t even doubled. Anyone who sold their bitcoin for ether in January would’ve so far lost a quarter of their BTC on that trade.\n\nSolana’s bitcoin ratio is up more than 300%. SOL’s dollar price is now 10 times what it was at the start of the year, although it’s still down almost two-thirds from its record high at the top of the last bull market.\n\nSolana truthers would also point to the network’s cheap fees and engaged community, which have lately inspired a boom in Solana-native NFTs, memecoins and decentralized exchanges. Solana even flipped Ethereum for DEX volume for the first time earlier this month.\n\nProjects are now plotting additional airdrops to incentivize on-chain Solana activity, hinting at far more buzz to come.\n\nBut it’s not all doom and gloom for Vitalik fans.\n\nAn Ethereum vibecession may have given way to a Solanaissance, but these charts should pick up your spirits.\n\nEthereum’s number has definitely gone up\n\nOne could sift through the minutiae of blockchain tech stacks — debate the finer points of the appchain thesis and the security concerns surrounding consensus. Or, we could just focus on price.\n\nEther’s earliest recorded price was $3 when it opened trade way back in 2015. ETH now trades for $2,300 — a 76,000% return over its whole history (not counting the additional gains made on its ICO price).\n\nBitcoin’s all-time returns would completely dwarf ether’s and solana’s. Let’s just pretend they wouldn’t\n\nSolana has done well but not that well, posting a meager 40,000% since its debut in mid-2020, about half ether’s returns.\n\nAnd we all know that markets are always right.\n\nEvery second dollar locked is on Ethereum\n\nCrypto has so many use cases. You can buy other cryptocurrencies with it. You can buy NFTs with it, and maybe some Dallas Mavericks merchandise.\n\nYou can even buy movie tickets or Adidas shoes with crypto — although you’ll have to send your bitcoin to a payment processor who will dump it for fiat on behalf of the merchant.\n\nIf using crypto as actual money doesn’t appeal, you could always lock it up in a blockchain and earn yield on it. Maybe even lend it out to other people who might buy other cryptocurrencies with it.\n\nEven Ethereum layer-2 network Arbitrum has more TVL than Solana\n\nThere’s about $53 billion in crypto locked up in DeFi protocols, and more than half of that is on Ethereum. Only 2.6% is staked with Solana platforms, equal to about $1.4 billion.\n\nTVL gets a bad rap by those who say it doesn’t properly reflect how people interact with competing blockchains. Ignore them, they’re probably Solana fans.\n\nUsers pay more to use Ethereum (a good thing)\n\nWe get it, there are cheaper blockchains to use than Ethereum. Solana is one of them.\n\nLow fees are great for anyone who wants to wash trade NFTs and memecoins, but they’re not so great if you want people to actually make money by contributing to the network.\n\nEthereum users have paid more than $2.3 billion to use the blockchain this year. Over on Solana, users have forked out less than $20 million — under 1% of Ethereum fees.\n\nEven ignoring Ethereum, crypto users have paid way more to use Bitcoin and Tron than Solana\n\nGranted, Ethereum fees don’t go directly to validators anymore, they’re instead burned to reduce the supply, which, in a roundabout way, benefits all ETH holders.\n\nSolana, on the other hand, subsidizes the network’s low fees by printing tokens, effectively penalizing all SOL holders with inflation.\n\nActive addresses and where to find them\n\nUntil we all scan our eyeballs with the Worldcoin orb and blend our biometrics with the blockchain, nailing down exactly how many people really use crypto is practically impossible.\n\nAll that shouldn’t get in the way of pretending.\n\nAdding up the cumulative number of active addresses every day this year across 29 different blockchains shows Ethereum, Solana and even Bitcoin aren’t even the most popular chains.\n\nThere’s no telling how many of these are unique individuals. Whatever, big numbers are good numbers\n\nThe cumulative daily active addresses for Justin Sun’s Tron is almost 600 million. Binance’s BNB Chain has attracted more than three times the active addresses of Solana.\n\nEthereum mainnet’s count is only slightly ahead of Solana’s, but including layer-2s like zkSync Era, Arbitrum and Optimism gives more than 300 million.\n\nEthereum against the world (wide web 2.0)\n\nCrypto market caps are terribly inaccurate. They’re easily gamed, never take lost supplies into account and hardly ever reflect the real liquidity of the underlying token.\n\nThis often results in valuations far higher than what could be realistically extracted from the market itself. Sounds bad, but most of that can be also said of market capitalizations for stocks.\n\nIn any case, if Ethereum was a stock, with which industries would it compete?\n\nSure, comparing crypto to stocks is apples to oranges. It still feels right\n\nEthereum’s whole “world computer” shtick could force it alongside cloud stocks like Amazon, Cisco and IBM. The network’s power to process stablecoin payments would otherwise put it against PayPal, Visa and Mastercard.\n\nWell, Ethereum’s market cap, averaged out over the past six months, is three times PayPal’s and seven times more than the stock valuation of Cash App creator Block (formerly Square).\n\nSolana’s current market cap is now above Block’s, but its average since June is lower than all of them.\n\nDavid is an Editor based in the Netherlands focused on data-driven journalism. Previously, he wrote for TheNextWeb’s crypto vertical before launching Protos in 2021. He’s a reformed hardline Bitcoiner passionate about permissionless and decentralized networks. Contact David at [email protected]\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]