[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOc1MzR3QtNDF6NENTb3lZUzNXRzltT25WeFVnbzliRDYzSjV2TENnMmlBcVBKNWdnRTZ2S0VsUGJjckpEb1NlRFZfd3JqeXpnckRuZXk3TjBJeWV6Zi1hOUJlbjFERXEzdnBwSVlOdUJ5WnJkS0FBaDZadDgzRGsweVFVcWI3ODQ1aEtLa0tNc1daMjNpZ1ZhX19lV0dmLTBjU0lSbUVSanFtY3duWlFpRnl1c1pNc0tsdGEyMjNpTGZYN0pa0gHKAUFVX3lxTE5VZjZ1M3JmZEo1MjZRRWJHcVRCM0Rya1BaSUk0TU5pUHVWUTJMMDZEOTJYRV9SX3NITjl2MUNoN0liSTdseGdZVWpkU21iWW9IZXpORjRKbXhkdVJuZmVBZHUyUWtZdkxzRDN6VXprZWlpaThiUTRfbUY1eFItUVl3ZjNneFZBc2tOMGhzOVk5a1MxalU0ZVBLYTJTZGY5eEtjVWl0Zm9DSGVja0dTVmMxWVJfcjk4M21hWnc1c25reklwaDVpTXREZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Incoming Ethereum ‘God Candle’ Will Catch Many off Guard, Says Crypto Analyst – Here’s His Outlook - The Daily Hodl",
        "content": "A closely followed crypto trader believes that Ethereum (ETH) is gearing up for a sudden massive move to the upside that will take many by surprise.\n\nPseudonymous crypto analyst Inmortal tells his 203,700 followers on the social media platform X that Ethereum could soon approach the $3,000 level, a more than 34% increase from its current value.\n\n“Ethereum god candle will catch many people off guard.\n\n‘ETH is dead.’\n\n‘ETH is broken.’\n\nDo you think this market gives a s**t about that? Human greed has no limits.”\n\nThe trader shares a chart comparing ETH’s current price pattern to a similar historic Bitcoin (BTC) price pattern, suggesting that ETH is about to go on a massive rally, flipping a key resistance level at around $2,400 into support.\n\nHe also predicts that Ethereum will soon soar out of a descending triangle against Bitcoin (ETH/BTC) and hit 0.069 BTC ($2,926) next month.\n\n“Do it.”\n\nETH/BTC is trading for 0.05251 BTC ($2,228) at time of writing.\n\nNext up, the trader gives a bullish outlook on ETH competitor Solana, sharing a chart where he predicts SOL will increase to about $500, a more than 350% increase from its current value, by early 2025.\n\nSolana is trading for $111 at time of writing, down 6.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNYlEwd0I0STZDZUFyMmhZTWhxNE5IYXpVanJYWHdHYjlSbHZnWDNQMFc3Tmg1aThSS282R0tlWnJjaEFqQ2RFS2FnbFVFMThObWdaR0ZSVjEzZ2tjdWhLNFhCZ0tiZjVpTzZJRGZfQ0Fhcm1rbmVVQWQ2OWNCcmV5RTljZ0V4NTQwNnZxMFFJYlFiTkt6eE5kbTZCMGd1TlNkNllTRkQydFhSWU1jdzlNcng0MGxjQWVCR210c1kwVi0xVU5oWldn0gHMAUFVX3lxTFAzTHlhLXA0R095WC1wRlA4cy1fQ3hQMWdGMm0xa0RVVnBaeVJqV3VrZ0ZMcGFDYlRsMHQ4YTZMcWJmZnNMYlFxa2dZS0hfaEdDQnhOcWk2d0tTOTRHa2pCRHdMR1ZsSXI4LUxhVHBrdDlYQzlvRjJJTGViOUVUZkJjV3Vqa2k4SmhRZ3hYejlmaVRyazZpNWZkbDhvWGt5Rm4zMjlnV2h6T1RfY2JZamlQTkgzYjcyY25hVFBlTXpKRjg3YjU5RXh5cTg1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Tether Mints $8,000,000,000 in USDT on Ethereum (ETH) and Tron (TRX) Within Three Months: On-Chain Data - The Daily Hodl",
        "content": "The stablecoin issuer Tether has minted $8 billion worth of USDT on Ethereum (ETH) and Tron (TRX) in the past three months, according to the crypto tracker Lookonchain.\n\nLookonchain notes the Tether treasury just minted $1 billion in USDT on Ethereum on Monday.\n\nTether CEO Paolo Ardoino says the recent minting was an “inventory replenish” on the Ethereum Network.\n\n“Note this is an authorized but not issued transaction, meaning that this amount will be used as inventory for next period issuance requests and chain swaps.”\n\nUSDT is the largest stablecoin by market cap and aims to maintain a 1:1 peg to the US dollar.\n\nEarlier this month, Ardoino announced in a letter to lawmakers that Tether was onboarding federal law enforcement agencies like the United States Secret Service (USSS) and the Federal Bureau of Investigation (FBI) as a means of combating crime.\n\n“Tether continues to play a critical role in assisting law enforcement. As recently highlighted by the U.S. Department of Justice (DOJ), our work has helped thwart bad actors and aid victims’ recovery.\n\nTether recently onboarded the United States Secret Service into our platform and is in the process of doing the same with the Federal Bureau of Investigation (FBI). These strategic relationships reinforce our commitment to supporting law enforcement in combating nefarious activities and contributing to the recovery of victims’ funds.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOWnZfc1JyV3B3RDRWbGZJajFGaW1CZE9xMjRhM21IbmR6UDlub1psODhycFNPU0Y4MFo1LTVFMzFhbHJEOXZLSm55Q0lyTkJkTDJwOFdBRnliVW9aaS1GT3YwTFJXMXVlX3B6MjI5YjRPbmRLeVhjTkhfWkRUSkF4TTBvZkZDbWcxaUZscGl4WlZGcXFqbC1DejRIZGFRbW8tdDhDTm9WZkJrTGJieWxQdzJfWkVObXRLb1RfT1l1YjFfTUxENVRGMGlsSHAtd9IB0wFBVV95cUxPNkVhWkItY1VyQUM1WWJWcGIxRE1IVFR4bzg0QXI3bXhLLVM0dlNlMldHWlQxUUZ1dlY0MWVlM0otTU4ydTd0R0x1YkNIb0FHYVhjM0dJaG03OHRlME9RclJ3YjY1bzhKRFFZUzJHRG95QVRDV1JZQTF1N3lFVXlhNEF3SHZsZ1NTQ2k5WGQ0akQwS0Nia09vLWxsaGFsUWxsd3daVjA3T2hpV05saEx0ZDhWUDBMNFhmRl9hUklqU3d3YS03bzIwX3V4TGNxcGNwaWlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "New Whales Suddenly Accumulate Chainlink (LINK) and One Additional Ethereum-Based Altcoin: Lookonchain - The Daily Hodl",
        "content": "Deep-pocketed investors are suddenly scooping up massive amounts of Chainlink (LINK) and one other Ethereum (ETH)-based altcoin, according to on-chain data.\n\nThe blockchain data tracker Lookonchain noticed that newly created crypto whale wallets were accumulating two digital assets Wednesday using the top global crypto exchange Binance.\n\nOne crypto whale scooped up more than $4 million worth of decentralized finance (DeFi) protocol Maker (MKR), according to Lookonchain.\n\n“Fresh whale wallets are accumulating MKR and LINK today.\n\n0xE68E withdrew 3,150 MKR ($4.55M) from Binance [Wednesday].”\n\nMaker is trading for $1,489 at time of writing, up 4.8% in the last 24 hours.\n\nLookonchain says another whale is accumulating large amounts of decentralized oracle provider Chainlink, having loaded up more than $2 million worth of LINK Wednesday, on top of the nearly $5.8 million the whale bought 10 days prior.\n\n“0x8eAD withdrew 136,146 LINK($2.05M) from Binance [Wednesday] and has withdrawn 384,006 LINK ($5.79M) from Binance in the past 10 days.”\n\nChainlink is trading for $16.40 at time of writing, up 9.4% in the last 24 hours.\n\nLookonchain also noticed that one crypto whale made enormous profits trading decentralized finance (DeFi) lending protocol Aave (AAVE).\n\n“In 3.6 years, this early AAVE buyer turned $500,000 into $13 million, making $12.5M (25x)! He sold 30,000 AAVE($3.01M) via Cumberland to take profits [Tuesday] and has 100,000 AAVE($10M) left. He spent 500,000 USDC to buy 12.5M LEND at $0.04 on May 6, 2020 (migrated to 12,500 AAVE).”\n\nAave is trading for $109.50 at time of writing, up 6.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPSEhDSVJ3cWtYbGpEcS1NanMyWHZQelBNc1M5MXU4YWdtVWhWbldRZ1I4SWh6RC1PQk90YVI5NExfWkVSYzdwellTbDd3a280czJpZ21CZmFtWUstY3ZsLTdpZ00ydFYxeWhmcV9qQ1NmeWV5UXZjcEdhY2NwTTZ4TU10Q0c5Z2V0dTc3V2pOV1EtbS1wRTdLaGxwUXZRb0RrNlY4bzRNTnhXdW9MRUNodmlZT250a2hicG5fczN1RXp3bGRfTEhja1p6bk9NdUlSSVl4U25sTzDSAd4BQVVfeXFMTVhxWVFPd0h4WmxVNWFvdm5vNVQxUUJHU0F2TFM5LWMxTEtsQlJ4TzZ4RGdwaWJqWDBoYXNwYVcyTU0yLWJmMHlIa3d1WllzMGVVRW5FbFBpQndHSHJJWFBaYzRZRFJ2S1pXblhjVXdiWFBfRXlZR0NaUkxaT25qYXBrdURFY3NQRVZ4QWRmSHMtanE3aGRLOWh3ZmwwWmc5T001WXNBQjVkcHFVMV9iTDhaaWhsT0RrMFlzMnN6TlRCZnZvTVJvd3dTT1VPX0ozRXdmSmlJdE9ZTkJsVVNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Unveils Massive Price Target for Surging Ethereum Rival, Calls Altcoin This Cycle’s Darling Chain - The Daily Hodl",
        "content": "A trader who accurately called the bottom of Bitcoin’s (BTC) 2018 bear market thinks that the uptrend of one Ethereum (ETH) challenger that has massively outperformed the broader crypto markets this year is far from over.\n\nPseudonymous analyst Bluntz tells his 233,400 followers on the social media platform X that the people who are calling for the end of Solana’s (SOL) big rally this year will most likely miss out on the altcoin’s surge to a fresh all-time high (ATH).\n\nAccording to Bluntz, Solana has a lot more gas left in the tank as he predicts that SOL could still print gains of more than 257% from current levels.\n\n“SOL is still 113% away from ATH. Why is everyone so hell-bent on calling tops? What the f**k is wrong with y’all?\n\nJust buy dips all the way to $400.\n\nNot a single person is ever going to remember the guy who may or may not have been successful in shorting a 10% move down, but they will remember the chads who long all the way to inevitable all-time highs.\n\nDon’t overthink it, SOL is this cycle’s darling chain, embrace it.”\n\nAt time of writing, SOL is worth $112, up more than 1,000% from this year’s opening price of $9.99.\n\nLooking at the low time frame charts of Solana, the trader thinks that the altcoin is poised for another leg up against both the US dollar and Bitcoin (SOL/BTC).\n\n“Nice little 12% dip there on SOL in a monster uptrend with a few more legs to go in my opinion on the BTC pair and USD pair. Don’t fight the trend.”\n\nBluntz uses the Elliott Wave theory in his technical analysis in an attempt to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset witnesses a five-wave uptrend to be followed by an ABC correction before the next leg up.\n\nLooking at the analyst’s SOL/USD pair, he seems to suggest that the pair is in a position to rally once more after completing an ABC correction. For the SOL/BTC pair, he appears to predict that it could rise above 0.0034 BTC, worth $144.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPWTJaMlpjd0ttSGttYV9aXzVLSlh1YzVqVTR6enJiOTFaclo5ako3NzVJUWc3LTd1d2Vfb2RrbkdYNV9xRVZVY0xUMUZxcWYzY1o1dTJBQ2M0R2plZVF1ZmRUeWRtaWpHb1B4MGZUaDlKVm5kWEdWWlBOMUVDYXh4d1A0d2NlWlA5S29N0gGQAUFVX3lxTE1kOW1aUHZfbUJGaFV6TUc1cmgydFMxWHFyVUNDOGZQeTYyZTc0WW1YN19Da3NBeGoyazNNM214VFg3LV8wV0pSemYxUEJabHdDcExRUnRwN0hRM3p3Q01KS3dsQnZVWTRQVnpmU094TGZ0ODE2ME9NakZGTlROWDJTZnBHWHJ2bjlwS3NESW53eQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Exits Correction Trend With 6% Jump, Is $2600 Within Reach? - CoinGape",
        "content": "Despite the ongoing uncertainty in the crypto market, the second largest cryptocurrency Ethereum (ETH) has managed to sustain above the $2150 level. This level coincides closely with the 23.6% Fibonacci retracement level indicating the overall trend of this asset remains bullish. With an intraday gain of 5.3%, the ETH price has just offered a breakout above the resistance trendline which traced the correction trend indicating an early signal of uptrend continuation.\n\nAlso Read: Ethereum Ain’t Dead: Here’s Why Ethereum Can Outperform Bitcoin in Q1 2024\n\nadvertisement\n\nIs ETH Price Ready to Surpass $2500\n\nThe ETH price breakout from the overhead trendline should release the build-up momentum\n\nThe coin buyers may face potential supply pressure at $2400, followed by $2665\n\nThe intraday trading volume in Ether is $12.8 Billion, indicating a 30% gain.\n\nAfter witnessing steady growth from mid-October to early December, the Ethereum price shifted its projection sideways in line with the current market uncertainty. This last three weeks’ consolidation gives a view of price sustainability at higher levels and a short breather per buyers to recuperate the rest of the time.\n\nInterestingly, the ETH price was actively rebounding from two converging trendlines which acted as a dynamic resistance and support. Today, the Ethereum price witnessed a significant inflow, which led to a decisive breakout from the upper trendline in the 4-hour time frame chart.\n\nShould this candle close above the breached level, the buyers would obtain an early signal of uptrend continuation. With sustained buying the ETH price should surpass the last swing high resistance of $2400 to obtain a better confirmation and entry opportunity.\n\nAs per the Fibonacci extension tool, the post-correction rally can chase a potential target of $2665 aligned with the 0.618 FIB level\n\nKey Level to Watch\n\nWhile the current market outlook for Ethereum seems strongly bullish, the coin buyers may face renewed supply pressure at the $2400 mark. In case this resistance triggers another correction, the coin holders can rely on an ascending trendline that has been offering dynamic support to the ETH price for nearly two months. The coin price rebounded several times from the support project the buyers continued to accumulate at market dips, which is a strong signal of an established uptrend. On the contrary, a breakdown below this support would trigger a significant correction in ETH price\n\nBollinger Band: The flattish upper boundary of the Bollinger Band indicator offers an additional layer of resistance at $2400\n\nVortex Indicator: A bullish crossover between the VI+ and VI- slope signals a recovery trend in active.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]