[
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPQlNnc2JjYVNZUVhKQ0JtQlVpNGUzbkpaR0YxRGpFemRmaDZOWFRyUE5ob05yRklzMUhpcUhpcW9iYVBvNDBGMFFQdW03Vk91WUFPQW9UQ0U4d1h5UGdGTXl3VUNCMDZUbVJCcWIxQkpNRzlUdUZadWJHUU84Q1VDetIBhgFBVV95cUxNekctRjU0QWxaMEVyMEdpelEzNENoUnN0ellFSDI3cURwUzhUV0NjbTdCWHJUMloweUtmd2hCcTNQWGxCMnFSdGFvN0hVdU9ab3ZkNHZsZWdHQzhkajY2QWZPanBheVJsVEliZVRkZ043aVNsRVJ3ZWZUMXBwR0lfZFpPTXFQZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "ETH Soars as BlackRock Files for Ethereum Spot ETF with SEC - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nChinese crypto blogger and journalist Colin Wu tweeted that the fund management giant BlackRock, with trillions of USD in assets under management, has submitted an application to the U.S. regulator SEC to launch a spot Ethereum exchange-traded fund.\n\nAdvertisement\n\nThe company made an S-1 filing on Nov. 15. Before that, a week ago, BlackRock filed the same application to the SEC through the Nasdaq exchange. Back then, the second largest cryptocurrency, ETH, responded by soaring above the $2,100 high.\n\nNow, on the news of BlackRock filing to the SEC directly, the price has also began to grow, printing a big green hourly candle on the ETH/USD chart. At the time of this writing, Ethereum is changing hands at $2,079.\n\nAdvertisement\n\nEarlier this year, BlackRock also submitted a filing with the SEC to launch a spot Bitcoin ETF. The regulator is currently reviewing around a dozen spot Bitcoin ETF requests, and it has delayed the decision on three of them so far (BlackRock not among them).\n\nStill, many experts believe that by early January 2024, the regulator will approve those BTC funds.\n\nDespite the news of some Bitcoin ETF delays, the price of the world's largest crypto, Bitcoin, soared to the $37,774 high on the Bitstamp exchange on Wednesday."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQQklUa2t1LUh1djRMNDRURC02Vl9OQUpfbWd1endaLXlveEFwcE43ejJpZnVxMTFrYkZhaW5MX0xzXzRHUEoyNGFDZ0hCMnhmbm5QNHQxOG1fZ0JlcUdiTFlZZV9nNDZwcE5qV0sxWU5NWmZhU29LQ2NnSUVQVEZ5UmpGSjFoSmhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "SEC Receives BlackRock's Ethereum Spot ETF Application - Crypto Briefing",
        "content": "BlackRock brings legitimacy to Ethereum with new ETF filing.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC) has received a registration statement on Form S-1 from BlackRock for an exchange-traded fund (ETF) that will hold ETH, the native token of the Ethereum network.\n\nAccording to the Form S-1, the iShares Ethereum Trust is structured as a Delaware statutory trust. It will hold ETH as its primary asset and issue shares to investors that will be listed and traded on Nasdaq.\n\nThe stated objective of the Trust is to reflect the performance of the price of ether. The Trust will value its ether holdings based on the CF Benchmarks Ether-Dollar Reference Rate index.\n\nThe sponsor of the Trust is iShares Delaware Trust Sponsor LLC, an affiliate of BlackRock, the world’s largest asset manager. BlackRock Fund Advisors will serve as the trustee, while Coinbase Custody, will act as the custodian for the Trust’s ETH.\n\nCoinbase will also serve as the prime broker for the Trust. According to the filing, the prime broker will facilitate the sale of the Trust’s ether as needed to pay expenses and fees.\n\nThe filing notes that the Trust may hold rights to acquire other digital assets through forks, airdrops, or similar events related to its ether holdings. However, the sponsor has discretion on whether to claim these assets.\n\nA substantial portion of the S-1 discusses various risks related to investing in the Trust and ether itself. These include volatility risk, security threats, regulatory uncertainty, and competition from other digital assets and blockchain platforms.\n\nThe SEC will now begin its review process to determine whether to approve the proposed ether ETF. The regulator has rejected several previous applications for spot bitcoin ETFs but has yet to rule on an ether ETF.\n\nThe official filing comes days after BlackRock registered the iShares Ethereum Trust entity with the Delaware Department of State Division of Corporations. Hours after the filing, Nasdaq also submitted a 19b-4 filing with the SEC, confirming that BlackRock is working on launching a spot ether ETF.\n\nBlackRock’s size and influence could help sway regulators towards finally approving a spot crypto ETF in the US. As the world’s largest asset manager with over $10 trillion in assets under management, BlackRock brings institutional legitimacy to the volatile crypto space."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5hUmUtSmlvOUtKNzQ4UmJCWUI4X1I0Y2F0QlFXRnE3VFcyNUZXZ0RBRE9aSnBRTkJIcmpyc2JFbWIwRmZzWEd4YmtBbDZtdTRka3dyVktzMC1TeFJHRkJhWkhWVXJVU25icnhTcdIBckFVX3lxTE1hVEdYN0VXQUdrbWwwT29DbEZuOGRheHhNbmx0S2hZbVF3aVlnXzR1ZmJSbnlvODN3amoyTUNHU3JnMGxmRkhacWw5UWVVOVFRTDI4OWVfMVlKWmswOWJPLU9vLS1NcXJqRnEzQ1FMZ3pEUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Insider Promises Big Reveal In 48 Hours - Bitcoinist",
        "content": "Steven Nerayoff’s impending disclosure concerning alleged fraudulent activities by Ethereum founders Vitalik Buterin and Joe Lubin is drawing closer, with a scheduled reveal in just 48 hours.\n\nNerayoff, a figure with intimate knowledge of Ethereum’s early days, has been vocal in recent weeks about the alleged misconduct of the platform’s founders. This anticipated revelation, set for November 16, follows a series of accusations that Nerayoff claims overshadow even the notorious FTX scandal.\n\nEthereum Insider Starts 48-Hour Countdown\n\nSpeaking via X (formerly Twitter), Nerayoff revealed that the release of his proof of the fraud allegations against Ethereum’s founders “Should be within 48 hours hopefully less. Logistics, setting up smart NFTs, etc.”\n\nHis recent communications have increasingly targeted Buterin, suggesting a deeper involvement in alleged fraudulent activities. He asserted, “Remember this video when I drop the recording & what I tell Vitalik about 2.0 and to fix misaligned incentive structures. Is Vitalik the savior they bill him as to make Ethereum scale or is he the reason it never scaled? Decide for yourselves.”\n\nNerayoff continued, questioning the originality of Buterin’s contributions: “Did Vitalik invent anything? No he did not. Ethereum never scaled because of him.” Furthermore, he accuses Buterin and Lubin of deliberately focusing on proliferating what he alleges were fraudulent ICOs, thus hindering the entire crypto sector.\n\nHe claims, “[The] only killer app was issuing Utility Tokens on ICOs both of which I invented. Vitalik & Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people.” Nerayoff further touts that Joe Lubin’s ConsenSys’s “only revenue generating business” in the early days was to “issue ICOs mainly through Token Foundry.”\n\nThe Ethereum insider also challenged the efficacy of Buterin’s white paper, crediting Gavin Wood for Ethereum’s initial success: “His [Buterin’s] white paper was unworkable. Gavin fixed it in his yellow paper & he’s the reason 1.0 got out the door. Vitalik is the reason 2.0 never got out the door.”\n\nIn a stark statement, Nerayoff positions himself as a whistleblower, intent on exposing a decade of corruption, “Look, I’m going to be strategic & only focus on what I can prove not just allege. I am only doing it to reveal the truth but then others will have to untangle the rest of the 10 years of corruption. I know this much, the Free Pass is going to cost somebody something.”\n\nWhy Do Buterin And Lubin Not Fight Back?\n\nHe also questioned the lack of legal action against him, suggesting that the absence of denials or lawsuits lends credibility to his allegations: “Why isn’t anyone suing me for these ‘outrageous’ allegations? They have armies of lawyers & billions of dollars. Nobody will even deny they did unethical things they ignore it. If I was clean I’d simply say no.”\n\nNotably, Nerayoff also revealed today that many parties involved have contacted him since he spoke publicly on the Ethereum fraud, underscoring the seriousness of his allegations:\n\n“I made sure this story would go public & not dependent on me by giving info for major press before I came forward. Notice not a single denial or even answers to basic questions of impropriety from anyone. Makes one question how deep & wide this goes.”\n\nAt press time, the Ethereum price stood at $2,030 after being rejected at the yearly high.\n\nFeatured image from Bloomberg.com, chart from TradingView.com"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQbTZQY1lKRGUydFNHcFkxeVZNMFFYbGdiZGNLMThNQUpPLVVDM1lTT2NTdmFDQ3FLMUhUZVhiV2w5WjJJdEFGMjRudThwY1dqOXlDMjh6X1V2dS1tbUtWMmtrYlMyUmR3YUJUeDJOMGJqT2o2V0VsajNzMFh6SFo1TnZKTEowdlQ0eGdGbkg1UEpnamxL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "JPMorgan Chase, Siemens, and FedEx show that blockchain finance is more than a buzzword - Fortune",
        "content": "Innovation is a funny thing. It often arrives with an excess of hype and then fades into disappointment—before reemerging in full bloom. A case in point is JPMorgan Chase’s “JPM Coin,” a corporate stablecoin launched shortly after the 2017 crypto bubble that seemed doomed to languish as a proof of concept that would never catch on in the real world.\n\nIn recent weeks however, the story around JPM Coin has changed dramatically as the bank announced that it is notching daily transaction volumes above $1 billion and that its big corporate clients are finally tapping into the coin’s promise to provide “programmable” money.\n\nIf you’re unfamiliar with JPM Coin, it’s a digital dollar that the bank created on a private version of the Ethereum blockchain. This means that clients with access to the coin (or ones like it) can enjoy the benefits of crypto technology—including 24/7 transactions and smart contracts—within a secure corporate environment. Well, that’s how it’s supposed to work in theory.\n\nIn reality, the past six years have been marked by a series of announcements involving banks and companies saying they’ve carried out a blockchain transaction—involving dollars or equities or commodities—and that’s been the end of the matter. While the transactions did occur, they didn’t really matter since they were mostly one-off events that didn’t lead to any changes in day-to-day commerce.\n\nThis has quietly begun to change, however, as companies have moved past the PR phase of blockchain and started tapping into its actual benefits. I spoke with Naveen Mallela, the head of coin systems (yes, that’s a title) at JPMorgan Chases’s Onyx unit, and he explained that the likes of Siemens, Cargill, and FedEx are all using these tools in daily operations.\n\nMallela told me that customers are viewing JPM Coin less as a stablecoin than as a tool to manage commercial deposits and take advantage of programmable money. I pushed him on that, asking what exactly he means by programmable. He explained that it means creating automated instructions for funds you control. A primitive illustration is autopay for bills but, thanks to blockchain, companies can now carry out far more sophisticated operations.\n\nMallela gave three persuasive examples of programmable money in action: companies using blockchain to carry out cash sweeps that used to happen once a day, but that can now occur anytime; finance firms using smart contracts to monitor and address margin calls for securities; and companies arranging for shipping payments to be released at various stages of a voyage.\n\nBy relying on smart contracts to handle these operations, companies can deploy cash and staffing resources more efficiently. And this is likely only the beginning. Mallela notes that IFTTT (“if this, then that”) instructions are becoming commonplace in the corporate blockchain environment and that companies will find more and more ways to use them.\n\nMeanwhile, programmable money is sprouting up in the investment sector as well—JPMorgan Chase and Apollo just launched tokenized funds in Singapore, while a startup called Superstate, founded by the creator of the popular DeFi protocol Compound, just raised $14 million to do the same in the U.S. All of this shows that while blockchain-based finance is still far from mainstream, it has quietly taken a giant leap forward.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBinance is launching a new crypto exchange in Thailand alongside Gulf Energy, a giant conglomerate run by the country's second-richest man. (Bloomberg)\n\nPaxos is launching a new USD-pegged stablecoin in Singapore after becoming the second company to obtain a key approval from the country's Monetary Authority. (The Block)\n\nThe SEC deferred on two more crypto ETF applications, including Grayscale's bid to launch one for ETH futures, though many predict approvals in January. (Bloomberg)\n\nArk's Cathie Wood plugged Solana on TV, helping to push the altcoin's price to three times what it was in January. (CNBC)\n\nBitcoin soared 6%, wiping out losses from earlier this week and returning the currency to just under $38,000. (Coindesk)\n\nMEME O’ THE MOMENT\n\nGary + Liz foreva:"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFByMUR0Y2xXcXN1NC1SVmZiV3IyUW42Vmp3eDJQTFZFc0tTc05TWGpJWFQ1TldMSkphcnJ6bTd3WTJBV2hxUklNa1lxSTFBcFE2bXNYZllkTUdWY2U2OHRjTEh0MlFPU0libkVnRDZ4djk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ethereum won’t flip Bitcoin anytime soon, but Ordinals could change that - Blockworks",
        "content": "Bitcoin block space looks set to be the hottest commodity in crypto.\n\nBitcoin once again occupies more than half the entire crypto market, having outperformed ether by nearly double so far in 2023. Now, the long-prophesied “flippening” of ether over bitcoin is even further in the future.\n\nThe market currently values Bitcoin three times higher than Ethereum. Bitcoin’s market cap, at $727 billion, has swelled by $400 billion in 2023 — a figure bigger than Mastercard’s entire stock valuation and about twice that of Netflix’s.\n\nEthereum’s valuation has grown by $100 billion, jumping from under $145 billion in January to nearly $245 billion today.\n\nSome anticipate that Ethereum’s market cap will one day eclipse Bitcoin’s, despite the latter’s half-decade head start.\n\nThings were looking good coming out of the 2019 bear market and into 2021’s explosive bull cycle. DeFi summer and NFT mania boosted interest in Ethereum, at times driving up fees for certain actions beyond $250.\n\nBitcoin‘s market value was 925% of Ethereum’s — $130 billion to $14 billion — at the end of 2019 (bottom of the bear market).\n\nThat figure had shrunk to under 200% by the end of 2021 (peak bull market).\n\nBitcoin’s market value is now 300% of Ethereum’s.\n\nThe Bitcoin rally has widened the gap\n\nThe case for flippening has recently taken a hit by a different flip: The Bitcoin network now rakes in more fees than Ethereum for the first time since December 2020.\n\nOver the past four days, Bitcoin users have paid miners about $40 million to have their transactions processed.\n\nEthereum users, meanwhile, forked out less than $27 million ether (most of those fees have been burned, slightly reducing Ethereum’s overall supply).\n\nLayer-2 Ethereum networks Arbitrum and Optimism haven’t bridged that gap as they each generate less than $200,000 in fees per day right now.\n\nThe fee-flippening (flee-pening?) is awkward when you consider the sheer amount of use cases supported by Ethereum. Decentralized exchanges, DAOs, memecoins, NFTs, stablecoins, DeFi and GameFi all run atop Ethereum.\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nBitcoin, on the other hand, had for the longest time mostly had one application — bitcoin transactions. But the rate of on-chain transactions had until recently sustained very little growth since 2015. Perhaps due to its “digital gold” narrative and the rising ubiquity of alternative cryptocurrencies.\n\nOver the past five years, Ethereum users have paid $17 billion in fees, Bitcoin users just $2.9 billion\n\nAll that changed with Ordinals — a protocol for inscribing individual units of bitcoin (BTC) with unique data to create digital collectibles, first launched in January.\n\nMusic, text, art, video and even code for browser-based DOOM clones have since been inscribed to Bitcoin, resulting in an on-chain collectibles market worth thousands of BTC. Bitcoin users trade Ordinals as Ethereum or Solana users would trade NFTs.\n\nToday, anywhere from around a third to one half of Bitcoin transactions contain Ordinals, driving up demand for blockspace as well as transaction fees. At times today, “medium priority” transactions went for around $11 compared to around $2.30 for the same on Ethereum (more priority generally means faster processing), although those prices have since come down.\n\nTron comes in third overall for monthly fees, mostly thanks to stablecoin Tether\n\nSo is Bitcoin netting more fees than Ethereum good for Bitcoin? Maybe not.\n\nSome Bitcoin insiders worry the network isn’t properly equipped to handle Ordinals and potential influxes of interest in its original use case, BTC payments.\n\nThe CryptoKitties incident in December 2017 — during which a NFT game grew so popular that it spectacularly clogged Ethereum — first showed that Ethereum probably couldn’t handle serving as the “World Computer” just yet.\n\nThen, the 2021 bull market saw NFT mint costs soar to $250 at times — a reminder of how necessary it was to port activity to smaller chains, including rollups. Still, memecoins and low quality token projects ratcheted up fees beyond $20 earlier this year, drastically reducing Ethereum’s usefulness for non-critical tasks.\n\nThe NFT craze of 2021 made Ethereum block space the hottest commodity in crypto. Even while tanking its utility.\n\nOrdinals may end up having the same effect on Bitcoin, especially if demand keeps up and the bull market truly hits.\n\nAt that point, it would seem reasonable to value Bitcoin and Ethereum more similarly. It might just take another run.\n\nUpdated Nov. 16, 2023 at 4:25 pm ET: Corrected reference to percentages in bullet points.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]