[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOb2RfdmZRNm83V3pKWnBMLXZzYjhtanZoZWFrSXUzWklxSk1EWjYxZktpdU1IelZWN0k3N2tUMEQ5ZTM5RzcwMUsxa19YbXBLODlyQjY1bW1IclhmQTBSYmE0NTZvWV9SdVVveDI2QmpYR0h5QmlPOVJ6dFdDX0xPLVNJelhHVHE1QWfSAY8BQVVfeXFMUE1CcHZtRUh6RnE3UFdBbmhNdGY2MmZfMEpLNS1iRE5SbVVjbFdXem9vc0lBTGFIQ29lMUl2RGsydGxDdm9ZRnlGeGgyZThqQXlwZzhUaHdvcmhVQXRRNHVIaFFtMFJhLVBoQlY0bk11MVZRdkFraGFXRThiZ2xBdFFBdUMwdFQwenpmY281ZW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF: Grayscale Boss Optimistic Ahead of Major SEC Decision - U.Today",
        "content": "Grayscale CEO Michael Sonnenshein is reportedly \"optimistic\" about Ethereum ETF approval prospects.\n\nAdvertisement\n\nThe head of the latest cryptocurrency asset manager expects the agency to do \"the right thing.\"\n\nAs reported by U.Today , Grayscale recently withdrew its Ethereum futures ETF application after it was delayed in November. According to ETF analyst James Seyffart, it was a Trojan horse filing that was meant to get a 19b-4 order from the SEC.\n\nHowever, according to multiple analysts, Grayscale's withdrawal likely means that it is not going to pursue another lawsuit against the SEC.\n\nAdvertisement\n\nLast August, Grayscale scored a massive victory against the agency, which eventually paved the way for the approval of a slew of Bitcoin ETFs in January.\n\nGrayscale's GBTC recently recorded its first days of inflows after months of non-stop bleeding.\n\nDespite the success of Bitcoin ETFs, the consensus appears to be that the SEC will shoot down several Ethereum ETF applications this March based on the complete lack of engagement with ETF issuers.\n\nRecently, key Ethereum backer Consensys, which is helmed by Ethereum co-founder Joseph Lubin, took the SEC to court over its attempt to label the leading altcoin as a security.\n\nIn late April, Bitcoin and Ethereum ETFs started trading in Hong Kong, but their debut was rather underwhelming."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZGp2R2VObnM5bW14cnByZWNRazRBcUM3NV9teC04VWRBbVgwaF94RjB4NUVuUVpHUkZvTWVQSHV3QWQxU3U1dmpfT2RzbUViNmlBX1JIUmIwVVRFWnNHVWNZMG5uTXJncWdla0J6aDd0czA5dnlGQ0VqYmF2S28yQWMtRUZYX0RjS2JldVhIT3BkUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Traders Increase Short Positions as Grayscale Withdraws Ethereum Futures ETF Application - Yahoo Finance",
        "content": "Traders Increase Short Positions as Grayscale Withdraws Ethereum Futures ETF Application\n\nThe price of Ethereum (ETH) has been hovering near a crucial support level at $3,010, experiencing a 2.57% drop over the past 24 hours, according to CoinMarketCap data. During this time, traders have shown a growing belief that the price will continue to decline, as they have accumulated significant short positions.\n\nThis development comes after Grayscale Investments decided to withdraw its application for an Ethereum futures exchange-traded fund (ETF) on May 7, just ahead of the scheduled decision by the United States Securities and Exchange Commission (SEC). The fate of spot Ether ETF applications, also set to be determined in May, has further fueled speculation regarding the classification of Ether as a security.\n\nLiquidation data indicates that if the price of Ether rises by 3%, approximately $345 million worth of short positions could be liquidated. In contrast, a 3% drop to $2,920 would only result in the liquidation of about $237 million in long positions.\n\nAnalysts and the crypto community have grown increasingly skeptical about the approval of a spot Ether ETF by the SEC. However, concerns about Ethereum extend beyond ETF approvals. The low usage of Ethereum has resulted in the challenge of its burn mechanism keeping up with issuance to validators. Furthermore, Ethereum has underperformed in comparison to Bitcoin, attributing it to a lag in speculative interest from short-term holders (STH)."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQazVWWVdEb3JGenNCN09fdWVKU1JTTU11Vm9heUR4TGxQcmRkVGpoVnJfaUQtOE14ckNwOERTeWFGcFp3T3JpY01wRlA3Ykh5bkNyMTR4Q1RGNFdvNnlxY2xfX2RMeGxUcWxnTUVwV1paZmdZZnFPRUdZZXNrWkxDUnBOdFVUSnZKREZjOFl0TkZuMnNlUU40TDM0bFgwTEtLSC1HVVlsSjU5Qm5RT1FhWmR4ek5lTmwtV3hIdjJTOVQyZFNJc3JZU2lzQkpMOVJaeldvNkR4a9IB3AFBVV95cUxQSHBqN2lTRlEySlVmdEUyTWhpLUhFSmE0Z1lyQ3BuNUpCM01DbHVYVVg2RHc4OWRjT3Y4a3l1SzZINW9oY0tzdUhVU1c0LWFpUjFuZHUzRWpUR0g3V3ZORmNwMHRDM042VGw2S0FRalg0ZVBOMTBSYlZOdGo2S2xPaE9PYXRNcXU2VlY4MlJ4UWVmS3MxX1BkLUpxLVY2TnVySUlEb2ZQLVg4eHJJTE1YckwxdDQwR25TMlJQMGw5djdZS3Vyc3M4Vk94Uk1neENRdWwxVi1VaHB2bERX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Analyst Benjamin Cowen Warns Ethereum ‘Still Facing Headwinds,’ Says ETH Will Only Go Up if Bitcoin Does This - The Daily Hodl",
        "content": "The widely followed analyst Benjamin Cowen is saying that Ethereum (ETH) is at risk of facing more downside over the coming months.\n\nIn a new video, Cowen tells his 801,000 YouTube subscribers that monetary policy is likely to negatively affect Ethereum.\n\n“I think that ETH/USD is still facing some headwinds here, especially following the potential rejection of the spot exchange-traded fund (ETF)…\n\n…I think the impact that people are going to feel is just from tighter monetary policy. They’re going to blame it on the spot ETF and they’re going to capitulate potentially into that.”\n\nAccording to Cowen, the Ethereum could go up on one condition.\n\n“If ETH goes up from here, it would only be due to Bitcoin going up a lot more.”\n\nThe widely followed analyst says that the Ethereum/Bitcoin (ETH/BTC) pair, on the other hand, is likely to keep falling under most circumstances based on history.\n\n“So if Ethereum goes up, Ethereum/Bitcoin is probably going to keep going down. If Bitcoin goes sideways, Ethereum/Bitcoin is going to keep going down in my opinion. And if Bitcoin goes down, Ethereum/Bitcoin probably goes down because Bitcoin has been doing all s of things since 2022 began. In eight of 10 quarters, Ethereum/Bitcoin has gone down whether Bitcoin went up, down or sideways. Ethereum/Bitcoin generally went down.”\n\nETH is trading at $3,002 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPSEhxemRCdEdTVlk0RWRoa0pDZmFTZnA2SmJ3U0VGVHQ0YWQtS2VzNGRNR19uTEdodzNpSjlVeU94SHdtYkpTeXdsOExPMHdZaTdpNGdDQ2s4eTNHcHZ5Ylc2dWdXdFBLcnVqckZMNkhJSVhWV3lUNGc1cjhGOWNyMVJabm5pQVp2eVhzVDRnd0ExUE1McDlXNkJuQjFfTHpWbUtTRmhXMWpWdEtFbXlVd25QaE9YZ9IBuwFBVV95cUxOeXk5UWpPYUNtVXRpUm5kQURWMURXbUxiN1RFUWNScVRoX0FuVlBwSWwyLXVBRHZQeWZaRVRBTHhZNGxKbjV3bnRnek9lQVhXZ2ZGZTJTX3BFS3lTZldHSHd4MXNLb2ZsQ0NhWEpOUFFUZFBwR3FaVkNQUDhJT1U3TDdsalhac2Z1UVhQd2JYOU00djBaY1hWeENuYWRFNHJWV0JWaGJwRGc3T1BOUmRCbHlSOWg4Vk5obWc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Here’s Why Ethereum (ETH) Has Been Lagging Behind Bitcoin (BTC), According to Glassnode - The Daily Hodl",
        "content": "Market intelligence firm Glassnode says Ethereum (ETH) has been lagging behind Bitcoin (BTC) for one key reason.\n\nIn a new analysis, Glassnode says that Ethereum has not seen the same level of increased capital from new buyers that Bitcoin has in the current market cycle, which drove the crypto king to new all-time highs (ATHs).\n\nThe analysts say that the approval of spot Bitcoin exchange-traded funds (ETFs) was likely a main driver for the increase in short-term holders who bought BTC in the last 155 days.\n\n“In the run-up to Bitcoin’s all-time high on March 14th, there was a noticeable increase in speculative activity. Specifically, capital accumulation has been observed among short-term holders (STHs), with the USD wealth held within coins moved within the last six months approaching $240 billion, near ATHs. However, this trend has not been mirrored for ETH, which has not yet seen price break above the 2021 ATH.\n\nWhilst Bitcoin’s STH-Realized Cap is nearly on par with the last bull run peak, ETH’s STH-Realized Cap has barely lifted off the lows, suggesting a markedly lackluster inflow of new capital. In many ways, this lack of new capital inflows is a reflection of the underperformance of ETH relative to BTC. This is likely in part due to the attention and access brought about by the spot Bitcoin exchange-traded funds.”\n\nThe Realized Cap metric records the price at which each coin moved and aims to gauge how many holders are in profit or at a loss.\n\nThe analysts suggest ETH could see a large capital inflow if the U.S. Securities and Exchange Commission (SEC) approves spot Ethereum ETF applications later this month.\n\n“The market is still awaiting the SEC’s decision for approval of a suite of ETH ETFs expected towards the end of May.”\n\nBitcoin is trading for $61,454 at time of writing, down more than 2.6% in the last 24 hours. Meanwhile, Ethereum is trading for $2,970 at time of writing, down more than 2.7% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNdkJtY2NKX2pzaFlkVTh1aGlqY2plcndNbWdjbTVRNkl2WFkyN0MzT3ZxeFdVRU1DXzkxdkxVU0FtSU5LUUhyWHFiZGFsWWpBSFA2MWwtR2JHSU5PdDRvRHdBczRKMXhkOFFQYXQxa0FId3V6WVZiWktkM1p1ZXZmVDliejhmRVNpcVRSRWFOdjFVdDRQYmdyaXNuRnA1ZnR0VFhaYkZ4Ny1JV1hHeUgyZElUSHZFRk4tMXcxeTBfZFpQZW5MNDFGa1FIR0tKdmJsVmNWUklJeGdIVnBxbTJaLXFFelTSAeoBQVVfeXFMTjdxZk9IdElPTl9FaVMwSm1EYW15OTdfaU1NMUJFdGtJMGlZMm5uM0VjX1pXTERrX3NwWnBzMjRvNkcybDZQZEdpeFBEdVoxNHY1WlF0NjIxUnBRVUtvN2lKZmxFY0kwZEdFSjg0Vm1mcWdaNVVNODZmWGZaa2psaGtaX0R3SnVmMWhzN3J4RkpYdTV4d3NBYzNCVm5Eb2xVZHM5ekQ3d0V3RWhJLTRLb2dkeGk2R284YS1JUEYxejRseDVxdVk4OS1JeGRTMXhMTkZmdnU1Q25LNHE0Sjl1TGZpY19RVm0yMkVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum could experience bullish run, ETH ‘ultrasound’ money narrative at risk - FXStreet",
        "content": "Ethereum’s ‘ultrasound’ money narrative is at risk after the Dencun upgrade, said CryptoQuant.\n\nEthereum's EIP-7702 would address concerns raised about the previous EIP-3074.\n\nEthereum's recent price action suggests it may be gathering momentum for a bullish run.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as a recent report from CryptoQuant reveals its ultrasound money narrative is at risk. Also, the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074.\n\nRead more: Ethereum resume sideways move as Grayscale files to withdraw Ethereum futures ETF application with the SEC\n\nDaily digest market movers: Ultrasound money, EIP-7702, Ethereum Foundation\n\nEthereum is set to see interesting updates on its blockchain following recent developments. Here are key market movers for the top altcoin:\n\nA recent report by CryptoQuant highlights that Ethereum is becoming inflationary following the Dencun upgrade in March. After the Merge that saw Ethereum transitioning from a Proof-of-Work (PoW) to a Proof-of-Stake consensus mechanism, the network began burning gas fees at a significant rate that saw a significant reduction in the growth of ETH's circulating supply.\n\nHowever, since the Dencun upgrade, when the introduction of \"blobs\" reduced Ethereum's network activity to boost its scalability and reduce user fees, the amount of gas fees burned has reduced significantly.\n\n\"Before the Dencun upgrade, the higher network activity on Ethereum meant higher fees burned and hence less ether supply. However, after the Dencun upgrade, the total amount of fees burned has decoupled from the network activity,\" noted CryptoQuant. As a result, this puts ETH's 'ultrasound' money narrative at risk since its circulating supply would begin increasing over time.\n\n\"We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, and the narrative of 'ultrasound' money has probably died or would need much higher network activity to come back to life,\" said CryptoQuant.\n\nFurthermore, following several concerns raised about EIP-3074, which was considered for inclusion in the upcoming Pectra upgrade, Ethereum co-founder Vitalik Buterin and co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett proposed EIP-7702 as an alternative.\n\n3074 = upgrade for normal \"EOA\" wallets to give some smart wallet functionality\n\n4337 = standard for smart contract wallets\n\n\n\n3074 was slated for inclusion, v likely worried the long term implications of\n\n1) compatibility btwn 3074 and 4337 wallets\n\n2) 3074 breaking in a future… — hayden.eth (@haydenzadams) May 7, 2024\n\nEIP-7702 introduces a new transaction type that would allow externally owned accounts (EOAs) to temporarily act as smart contracts during a transaction. Like EIP-3074, the new proposal would enable better ways to abstract gas fees, batch transactions, and improve the user experience. However, it goes further by improving compatibility with the ERC-4337 standard for smart contract wallets — an issue with EIP-3074 — and being more future-proof.\n\nSome crypto community members have speculated that EIP-7702 would replace EIP-3074 in the upcoming Ethereum Pectra upgrade. One X user commented, \"I think it would probably make more sense to include in Pectra than 3074.\"\n\nFireblocks' VP of Technology Arik Galansky also commented on the proposal saying, \"It's a long while since Ethereum introduced changes that are user-oriented rather than scaling-oriented and this one is right on point.\"\n\nA few weeks ago, EIP-3074 sent the AA world into shambles.\n\n\n\nInitially it looked like it's synergetic with ERC-4337, since they do different things. One enables EOA migration, another enables decentralized mempools.\n\n\n\nHowever, the nitty gritty details looked suboptimal: it's hard… — Ivo e/acc (@Ivshti) May 7, 2024\n\nAlso read: Ethereum traders show uncertainty, SEC delays decision on Invesco's ETH ETF application\n\nMeanwhile, the Ethereum Foundation appeared to be dumping ETH again on Wednesday following a transfer of 1,000 ETH worth $3 million to middle multisig address 0xbc9, according to data from Spot On Chain.\n\nThis transfer is the latest action in a larger trend where the Ethereum Foundation has sold 1,766 ETH for 4.81 million DAI stablecoin at ~$2,725 since the beginning of 2024. The ETH sales, done in small batches through the same middle multisig address 0xbc9, often coincide with brief Ethereum price declines, noted Spot On Chain.\n\nETH technical analysis: Ethereum could be gathering momentum for a bullish run\n\nThe market remained quiet on Wednesday as Ethereum continued trading around the $3,000 mark. Despite the calm market, ETH derivatives volume in May has risen higher — close to 60% — than that of Bitcoin, according to QCP.\n\nRead more: Ethereum could see a brief rally despite Michael Saylor's jab at ETH ETFs\n\nThe reason for the increase may be the market pricing in volatility over the Securities & Exchange Commission's (SEC) upcoming decision on Van Ecks' spot ETH ETF application on May 23, noted QCP. This also explains why the market is slightly tilted toward a downward movement as many expect the SEC to deny spot ETH ETF applications.\n\nWhile current price action indicates ETH may continue a horizontal movement in upcoming weeks, historical data suggests the largest altcoin could be gathering momentum for a bullish run. Considering ETH has remained in the $2,852 to $3,300 range for nearly a month, it could attempt a sustained breakout above the upper level of the range if it sees a slight bullish trigger.\n\nETH/USDT 4-hour chart\n\nOnchain data also shows most whales have been accumulating ETH around this range in anticipation of a price rally. A bearish event could see it break below the lower level of the range briefly, presenting a buying opportunity.\n\nEthereum is trading at $3,013 on Wednesday, May 8, down 0.7% on the day."
    }
]