[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBVWlRGcFRpUmJ2QUhHdU14MHJiOGcxb0tLeXhHVFV1NWxOWnZXcFdlRHduZ1dWU01kQXNoc1UzcFdPeGtrZ29sYlJEc3Yzd2VPZmFEenFYREtiTDR6TXozQm1meDJUd0xKYUEwcDgwLS1LbVHSAXtBVV95cUxOSnpianV6RXViZFFUTFFhZmRJdEJGbUREeEphVjRjcWJMQ21nUm0wN1BTeGY3SWpNNWN0ZzdpRE4wRDZ5VWV0NGZmQjBEU3l5ZE8tWTI0ZDJfd3JVcGZvMmQ0MWJRZWYxcXQ0bjRHcHFyTDg2clg1akY5NG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Mostly Flat as Solana Price Sags 5% - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum were mostly flat on Tuesday morning while the Solana price sagged by 5% compared to yesterday.\n\nEven while trading mostly flat, the price of Ethereum managed to very briefly inch past the $3,000 mark before falling back to $2,932.95 at the time of writing, according to CoinGecko data. It's down 0.4% from yesterday but has gained 11% since last week.\n\nMeanwhile, Bitcoin seems to be taking a breather after looking like it was going to reach $53,000 yesterday. At the time of writing, Bitcoin is changing hands for $51,491.97—a 0.8% drop from the same time yesterday, according to CoinGecko data.\n\nBTC has been enjoying a lot of attention and renewed enthusiasm because of all the action on spot Bitcoin ETFs in the U.S. Net flows for the funds have already surpassed $3 billion as of last week.\n\nAD\n\nAD\n\nAll that hype has been compounded by the upcoming Bitcoin halving, which traders are expecting will launch the world's oldest and biggest assets by market capitalization into a bull market.\n\nThings for Solana have been more of a mixed bag.\n\nThe total value locked in DeFi projects on the network—launched in 2020 as a direct competitor for Ethereum—has topped $2 billion for the first time in a long time. But SOL, the native token of the ecosystem, has taken a beating on its price since yesterday.\n\nAt the time of writing, SOL is changing hands for $105.40—down 6.5% since yesterday and 3.2% lower than it was a week ago, according to CoinGecko data.\n\nAD\n\nAD\n\nThis year, Solana has seen a ton of activity because of several large-scale airdrops, like Jupiter, Dymension, and meme coin WEN.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQZjFUVmh2T1UyV285WVQyWmhKNGtHUmE2eE5yam9KU2ZORnNSR3hZNHFNNXFNWVo1WXNTdlBLcG5FN2lmMlM0Q2RKc3dDQlRoRy1LVEpuSml6M3lKV042T19ZdkJVb1VqemRqWVFSNjdMVHlQWTFKc2VObTBFd055OVNURnFraUY4RWs0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ethereum approaches $3,000 milestone ahead of Dencun upgrade - Crypto Briefing",
        "content": "Ethereum’s price surged over 9% in the past week, while Bitcoin was up around 3%.\n\nShare this article\n\nEthereum (ETH) is setting its sights on the $3,000 mark as the Dencun upgrade inches closer. According to data from TradingView, Ethereum’s price has exceeded $2,980 in the last 24 hours, up over 27% year-to-date. This milestone marks Ethereum’s most triumphant return to the $2,900 range since May 2022.\n\nThis surge in Ethereum’s valuation is largely attributed to a confluence of positive market developments and speculative anticipation surrounding the potential approval of a spot Ethereum exchange-traded fund (ETF).\n\nAccording to data from SpotOnChain, a whale has recently amassed a staggering 54,721 ETH, valued at over $150 million, through transactions on Binance and the decentralized exchange 1inch, averaging a purchase price of over $2,845 per ETH.\n\nFurther examination of this whale’s portfolio via the SpotOnChain reveals a current holding of 74,383 ETH, equating to around $216 million. This accumulation signifies a near tripling of their Ethereum holdings in just 24 hours.\n\nIn addition to the ETH holdings, this investor also acquired about 5,485 stETH, liquid staking assets from Lido Finance, valued at nearly $16 million.\n\nLiquid staking on Ethereum has attracted a huge amount of users. The total value locked in the liquid staking protocols has skyrocketed almost 600% since January last year, as reported by DeFiLlama . With the Dencun upgrade underway, liquid staking on Ethereum might see even greater growth in the future.\n\nScheduled for March 13, the Dencun upgrade will introduce several improvements, including the highly-anticipated Ethereum Improvement Proposal 4844 (EIP-4844), or “Proto-Danksharding.” This feature is expected to significantly reduce transaction fees, particularly benefiting layer 2 rollup chains.\n\nApart from the Dencun upgrade, there’s also a lot of hype surrounding the potential approval of a spot Ethereum ETF, with prominent asset managers such as BlackRock, ARK Invest, and Franklin Templeton among the eight filing for the investment fund.\n\nMay 23 is a critical date for a potential spot Ethereum ETF as the US Securities and Exchange Commission (SEC) prepares to rule on VanEck’s application. Interestingly, some developments experienced during the approval process for spot Bitcoin ETFs are resurfacing, as seen in ARK Invest and VanEck’s recent update to their spot Ethereum ETF filings.\n\nGiven Bitcoin’s price rally from around $27,500 to over $46,900 (according to data from CoinGecko) leading up to the decision on its spot ETF, March is shaping up to be a defining month for Ethereum."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQcHY1RV90ZjBCNU1hMmhncTIyZEs5UnJqUVJiYkRoeVY5b3BmSGlhcW44a1dzVURiQlo4QXdlcjdJQUp3VzBCbkprbWJuR2FQQzNUZEU5VHhQbURRWHRKZEp5czExUlBxYm5HdGU5R1NVRGJLcW1uZlhpWExROVlOaTk5bmZOV2pwYlI5Uzc2bmNyYlB5Q0l2NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Why Ethereum, Filecoin, and Hedera Are on Fire Right Now - The Motley Fool",
        "content": "Speculation about cryptocurrency ETFs continues, but a lot is going on under the crypto hood.\n\nThe crypto market's hot streak is continuing, and since the market closed on Friday, there have been some big movers. And in some of these cases, the moves have been driven by real developments, not just hype.\n\nEthereum (ETH -0.88%) has risen as much as 8.1% since the stock market closed on Friday, Filecoin (FIL -0.78%) jumped by 40.7%, and Hedera (HBAR -2.34%) was up 38.7%. As of noon ET Tuesday, the tokens were up 5.4%, 30%, and 22.1% since Friday.\n\nBig crypto moves all around\n\nEthereum is rising in part because traders are still speculating that regulators will approve more crypto ETFs beyond the Bitcoin (BTC -0.45%) ETFs launched in the last few months. The next coin that is likely to get approval for one is Ethereum because of its size and recognition in the market.\n\nIf an ETF were approved, the purchasing activity around the coin could push Ethereum higher, in a similar fashion to the way Bitcoin has responded. Just last week, $2.4 billion flowed into Bitcoin ETFs.\n\nFilecoin's rise was prompted by more fundamental news: It announced it will store Solana's (SOL -0.46%) block history, allowing Solana to move to more decentralized storage. This should be a win for both cryptocurrencies; Solana can now focus more attention on expanding the high-throughput network while Filecoin gets a significant partner.\n\nLesser-known token Hedera is benefiting from the growth in its SaucerSwap decentralized exchange, which now has over $127 million in total locked value, a gauge of how much investors are putting into the exchanges on the ecosystem.\n\nBuilding the foundation of crypto's future\n\nIndividually, these moves may seem small. But together, they tell a story about where crypto is headed in the near future.\n\nBitcoin ETFs have been approved, which suggests that eventually, ETFs for Ethereum and other tokens could arrive too, bringing more money into the ecosystem and driving values higher. If an Ethereum ETF gets approved, there may soon be dozens of crypto ETFs.\n\nThe Filecoin and Hedera news is more useful for the industry long term. As more tokens and exchanges are launched, it's necessary for market makers to put value into the ecosystem, and that's part of what we're seeing with the SaucerSwap exchange. Filecoin helping Solana store its blockchain history moves that token toward the decentralized vision that so many advocates would like to see.\n\nIf Solana and Filecoin can work together to create an extremely fast, high-throughput blockchain with accessible storage, it would be a win for all blockchain users. This is where I think we will see more utility and financial products built in the near future.\n\nCrypto is maturing before our eyes\n\nTwo years ago, crypto was still in the speculative trading days, and speculation in that market still exists, but major tokens like this are now focused on building real utility on blockchains. If that utility is combined with more investors putting money into the crypto ecosystem, it could create a reinforcing loop of value creation."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQOFJjWVVHSWhVV2ZtUWZaWWowWG1FN05PVGxyQ0dPYk1Sb1Y1LUR2NDdGRF9NNDJHV3VtYUxHR2tiVFU2SGhnY1JtU3pkS3Y4ekFjY3JRQ0s0UmxaeC1mYmRYMEFveENVRTRibmpmVDlFTE1oTU1xNnByRnUwaDZGQlExdlJ2UjhuYy1WalVaVGE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Overtakes BTC -Is $4k ETH a Valid Prediction? - crypto.news",
        "content": "Ethereum price surged past $3,000 on Feb. 20, eclipsing Bitcoin’s 22% growth; ETH 2.0 staking deposit trends observed this week suggest the gap could widen even further.\n\nThe media frenzy surrounding the Bitcoin ETF approval saw BTC price outperform ETH in the early days of the 2024 market rally. However, this market trend has flipped since the start of February.\n\nAs investors make long-term bets, the bulls may capitalize on the rising ETH 2.0 staking deposits and declining market supply to drive a rally above $4,000.\n\nEthereum surpasses BTC despite record-breaking ETF inflows\n\nBitcoin has dominated media headlines in recent weeks and for good reason. Since the U.S. Securities Exchange Commission (SEC) approved the Bitcoin ETFs on Jan. 11, BTC has received unprecedented interest from institutional inflows.\n\nAs of Feb. 19, after barely six weeks of trading, the 10 newly-launched ETFs had acquired over 654,000 BTC, worth more than $36 billion. Despite the record-breaking BTC ETF inflows, ETH price performance has managed to skip past BTC.\n\nEthereum (ETH) vs. Bitcoin (BTC) Price Performance | Feb.1 to Feb. 20, 2023 | Source: TradingView\n\nThe historical price chart shows that BTC prices increased 24.2% in February, rising from $41,864 to a monthly peak of $52,985.\n\nMeanwhile, ETH price has delivered a much more impressive showing, with a 33.7% rise from $2,241 to the $3,000 milestone on Feb. 20, the first time since Apr. 26, 2022.\n\nInvestors place long-term bets on Ethereum\n\nThanks to the seamlessly executed Dencun upgrade, Ethereum has received its fair share of media praise.\n\nThe on-chain data trail shows that investors playing the long game, staking coins to front-run gains from an imminent ETH ETF approval, have been pivotal to ETH’s blistering price action, which eclipsed BTC in February.\n\nInvestors have pulled coins worth over $1.5 billion in the past week as they deposited 504,799 ETH into ETH 2.0 staking contracts on Feb. 13 and Feb. 20.\n\nThis saw the total staking deposits on the Proof of Stake (PoS) network rise to 30,064,242 ETH, according to the official data culled from the Beacon chain.\n\nInvestors Deposit 504,799 ETH into Ethereum 2.0 Beacon.chain | Feb. 13 – Feb. 20 | Source: BeaconCha.in\n\nDuring a bull market, a significant increase in staking deposits is a positive trend for any PoS network. An increase in staking deposits enhances network security and stability amid rising network activity and signals that most large ETH investors are looking to play the long game despite elevated prices.\n\nA $1.5 billion increase in ETH staking while prices are trending at a 2-year peak indicates a surge in investor confidence and commitment to the network’s security.\n\nIf this trend persists, the drop-off in market supply amid soaring market demand could see ETH price extend its lead over BTC in the weeks ahead, especially considering that the Bitcoin network lacks a comparable large-scale staking yield incentive.\n\nForecast: Can Ethereum’s price reach $3,500?\n\nDrawing data-driven insights from market trends, ETH price appears primed for further upswing toward $3,500 in the weeks ahead.\n\nHowever, historical accumulation trends suggest that ETH faces stiff resistance at the $3,200 territory.\n\nIntoTheBlock’s global in/out of the money (GIOM) data groups all existing ETH investors by their entry prices. The GIOM shows that 12.9 million existing holders had acquired 4.74 million ETH at the minimum price of $3,212.\n\nHowever, considering this is the largest cluster of holders that bought ETH above the current prices, a decisive breakout above $3,200 could effectively open the door to a larger upswing towards the $3,500 mark, as predicted.\n\nEthereum (ETH) Price Forecast, February 2024 | Source: IntoTheBlock\n\nThe bears could still invalidate this lofty prediction if the price tumbles below $2,500. Still, in this scenario, the 5.2 million addresses that acquired 4.1 million ETH at the minimum price of $2,548 could mount a significant buy-wall."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPbl9nVjZyODU3T0kwb1VwZGVpUDlaNzViQmJfUjFpVERYcW1OQjk5QnI5blBOaXlvR2tOajhkdEk2Y1dnWkFmUGdrdUM4QlB0LUVCdXNsWnNsREFWdGJUR2c0cFBzMUVJbDFlQU9aT0daSURzVUZrRXJSZWNWTzBQc3lKQ09OcFZCVThYRnJKMTNfclXSAZgBQVVfeXFMTmxaTmlfYkV5NHNZVGdZZktKY0xWZ3N2TTV1RUcyTmNqZXplRGlSZEVseEVpZGdzQ2pnZXB6Y09ndVk2R1YxYm5OWWhpSU5qSlZwMXBzMjFXekllOWFQTUZrc0x3SGZRdHNqS3NHT3lycmNSVVJNNkdIQnU5MEFPQXluN25DLWJXUzRkdkxYTTFnQW5FWXdoaEo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "XRP Brutally Denied, Ethereum (ETH) Flirts With $3,000, Did Bitcoin (BTC) Plateau? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP's recent price trajectory has been met with a stark rejection, as it encountered a near-impenetrable resistance level that has halted its upward momentum. This resistance confluence is particularly formidable as it aligns with the 100, 50 and 200 EMAs, key technical indicators closely monitored by traders for significant price movements.\n\nThe current price level has proven to be a substantial barrier for XRP, as the EMAs have converged to form a tight band of resistance. This band has effectively capped the price, acting as a ceiling that XRP has struggled to breach. The close proximity of these EMAs indicates a critical decision point for the asset; a break above could signal a strong bullish turn, while continued rejection may cement the current level as a robust ceiling.\n\nFurther exacerbating the situation is the noticeable lack of trading volume. Volume acts as fuel for price movements, with higher volumes often associated with strong price action. The tepid volume accompanying XRP's approach to this resistance suggests a lack of conviction among buyers, which can often precede a price retreat.\n\nFrom a technical perspective, the resistance zone around $0.58 to $0.60 is the area of interest. XRP's recent approach to this level was met with swift denial, indicating that overcoming this barrier will require a significant influx of buyer interest and volume.\n\nAdvertisement\n\nOn the support side, the $0.50 level is one to watch. It has served as a historical psychological and technical support level, providing a foundation for price rebounds in the past. Should XRP retreat, the response of buyers at this level could determine the asset's short-term fate.\n\nEthereum almost there\n\nEthereum is on the cusp of breaching the pivotal $3,000 mark, showcasing formidable strength in an otherwise tepid market. Its resilience and upward momentum may well act as a catalyst for broader market optimism.\n\nThe ascent toward $3,000 has been marked by consistent higher lows and higher highs, a bullish pattern that suggests strong buying interest at every dip. Technical indicators have turned favorable, with Ethereum recently pushing past the 50-day and 100-day EMAs — a sign that the momentum could sustain.\n\nSupport levels for ETH have been notably robust. The primary support at the $2,750 mark, which aligns with the 50-day EMA, has been defended well by the bulls. This level is critical as it has been tested multiple times, proving to be a springboard for subsequent rallies. On the upside, the psychological and technical barrier of $3,000 stands as the next significant challenge. A decisive close above this level could open the gates for further exploration into uncharted price territories, with potential intermediate resistance at $3,200.\n\nETH's exceptional performance can be partly attributed to the ongoing development within its ecosystem. The introduction of ERC-404, a new token standard that combines the versatility of NFTs with the fungibility of standard tokens, is an innovation that could further solidify Ethereum's position as the leading platform for decentralized applications.\n\nBitcoin faces opposition\n\nExamination of the BTC chart reveals that the asset is experiencing a consolidation phase, which is often a precursor to a trend continuation rather than a sign of stagnation.\n\nCurrently trading above the $50,000 mark, Bitcoin has maintained a steady position near this psychological threshold. The consolidation phase is characterized by a narrowing price range, with Bitcoin oscillating between support and resistance levels that converge over time. This tightening of price movement is often associated with the accumulation of assets by traders and investors, setting the stage for a potential breakout.\n\nThe key support level for Bitcoin lies around the $48,000 area, which aligns with the 50-day EMA. This level has been tested and held firm on several occasions, indicating strong buying interest. On the flip side, the immediate resistance is located near the $53,000 mark. A convincing break above this level could signal a bullish continuation, potentially targeting previous highs or setting new records."
    }
]