[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9aWER6R1dRbWF2T3g2WDdlMEFNOHV6VGVkTHZWNEttcDQ4UmtqeWYxUGJyeXB5T0NRaHItbi02b2t3OTloc05PelRVMDJZbU83QVA0YnJCbDZGekdJbXpiV2tPUnQ1YmprUnlXNEJHU2_SAXZBVV95cUxNOEZrdnk3OG0xck9NQXFlWWxXcmg2V21XTTNndzVTV1pTYjFDd1FSNTVnVjk5V1dhcDJBWVFkd1YwNXpZY2JkZVc2eERuTUE3MFlDY0x0bUJfUDQ5Mk9tMWx3dkNlbURlYlNOS2lUWklzTmpna09R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Top Analyst on Ethereum ETF: \"Silence Is Violence\" - U.Today",
        "content": "The odds of Ethereum exchange-traded funds (ETFs) being approved this May remain low , according to leading ETF analyst Eric Balchunas.\n\nAdvertisement\n\nAccording to a recent report by Barron's, several ETF issuers have had meetings with the SEC regarding Ether ETFs. However, the regulator has yet to provide these companies with much-needed feedback.\n\nThe SEC was engaging in a consent \"back-and-forth\" on the cusp of greenlighting Bitcoin ETFs earlier this year. However, it is not willing to actively engage with ETF issuers this time around, with discussions being mostly one-sided, according to a recent report by Barron's.\n\nAdvertisement\n\nThe SEC is supposed to provide comments on a slew of Ethereum ETF applications for the approval process to move forward. So far, however, they have refused to offer any sort of feedback even during personal meetings based on the recent reporting. \"Silence is violence,\" Balchunas noted.\n\nIn March, the SEC postponed its decision on multiple Ethereum ETF filings, including the one from financial giant BlackRock.\n\nAs reported by U.Today , the Bloomberg ETF expert previously estimated that the odds of an Ethereum ETF being approved in May were at just 25%.\n\nLast week, the regulator finally called for comments on the applications by BlackRock and other firms.\n\nEthereum ETF proposals are facing multiple headwinds: from pressure in Congress to growing scrutiny over the regulatory status of the largest altcoin."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOclZ2OXJ0OFczWXc3bl94dTVkb2Zsd3hDZG4wU1FFeFYzQ2RWaFZ4dHB1SUQtZzg0V3B0a0hQNHl2amR2UEw3VXZ0U3FDVndjaGJCNDVpdWZqZ2dfT3pwalE0blNEbEJBMUVMT0djT0NnZG1LU3FSbnBvVU0tZmFnLdIBhgFBVV95cUxOUlJiYWdBUzVpZ1l3ZWcwUzV4akdmTkxIQ3k2R1pDckpnM19lbEIyLWpvVXRCZDYxYnhyTDhHdk1oU3FaQmlCY3VXZjdIbGtSQ1pMZzV0MG1ob2h6eVUySmFWaEVDNkNwUDBSVGtQZkhZZlRqemhLRjQxQllOaEVvUEthWTFoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Whales Rack up $40 Million in ETH as Price Rebounds - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) is showing significant strength on the crypto market, with its price surging today. As of the latest update, ETH is trading at $3,627, marking a 7.02% increase over the past 24 hours. The surge in Ethereum's price has coincided with a remarkable influx of trading activity. The 24-hour trading volume of ETH has surged by 67.95%, reaching an impressive $15.04 billion.\n\nAdvertisement\n\nDuring this bullish run, crypto tracking platform Spot On Chain reported the emergence of two new Ethereum whales, identified as 0x666 and 0x435. These entities collectively withdrew 11,657 ETH, worth approximately $40.28 million, from prominent crypto exchange Binance. The transaction occurred when ETH was priced at around $3,455.\n\nThe $ETH price sharply rebounded by ~4% in the past 2 hours, now beyond $3,500!\n\n\n\nDuring this period, our system detected two more whales, 0x666 and 0x435, that withdrew a total of 11,657 $ETH ($40.28M) from #Binance at ~$3,455!\n\n\n\nFollow @spotonchain and set alerts for $ETH now so… https://t.co/Tz4or4Pzc0 pic.twitter.com/ZoVXTtDWZq — Spot On Chain (@spotonchain) April 8, 2024\n\nThe accumulation of such a substantial amount of ETH by these whales suggests growing confidence and bullish sentiment surrounding Ethereum's future prospects. Whale activity is often closely monitored by market analysts as it can provide valuable insights into the market's direction.\n\nAdvertisement\n\nWhen large whales make significant purchases or withdrawals, it can create a ripple effect, influencing smaller investors and traders to follow suit, thereby amplifying the bullish momentum. Furthermore, the increased concentration of ETH in the hands of a few large entities could lead to reduced market liquidity, making the price more susceptible to sharp fluctuations.\n\nMarketwide rally\n\nEthereum's rally is part of a broader upward trend in the crypto market. Bitcoin, the leading cryptocurrency by market capitalization, has also experienced a surge, climbing above the $72,000 mark. The impending Bitcoin halving, scheduled for approximately 11 days , is believed to be injecting additional bullish momentum onto the market.\n\nThe Bitcoin halving event, which occurs approximately every four years, involves a reduction in the reward given to Bitcoin miners for verifying transactions. Historically, Bitcoin halvings have been associated with significant price rallies, as the reduced supply of new coins often leads to increased demand and scarcity ."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOSzdHVjI3MmhfY0hxZTdMUFo2czBYQXV3Qlh6TTloYU9RbmljQjN4MjlPTVNvd08taTR2TjB2a2xqTVRvMUxPbEJDMlI5NF9IQkN3N0ZubWV4ZkNVMkhlaWdLX3BLbUF4RmVZcDFGV2NfOW0weDIzenF6M0VWd1VoZkJtelhmZGpoSmZ5RlhweHY1Q2R5WUtV0gGcAUFVX3lxTE1ValJFLVBhVmt3MTNDUTVvRWFFRE02cXd1cVNkRktRWjJwNi16S1JXTDJhaWdkbUlXUXh5Q2FtMXQ1NlpDWFlaWklHMXkxRmxyMFFEemtUNW16VDlkc2ZNLTVXdWhLQi1DQmhyb3ZROUtMcWJHb0hVU0lOTVFITXYta3podzFxeThiYm9VSkY0dXdVc1hSQUZvMmljUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin on Verge of $70,000, XRP Comeback Begins, Ethereum (ETH) Support Plays Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin is now close to reaching $70,000. Digital gold could be on the verge of a breakthrough. Right now, it is trading around $69,311, and many are watching to see what will happen next.\n\nThe chart shows that Bitcoin has been going up and down, without a distinctive pattern, but it is still close to the $70,000 mark. This is a very important level that could tell us if Bitcoin is going to start moving toward another ATH or keep consolidating. If Bitcoin can get past this level, it could go even higher, which would be big news for the cryptocurrency market.\n\nBut the market is giving mixed signals. This makes it hard to say for sure if Bitcoin will pass $70,000 soon. There is a chance it could go up to test this level, but it is not clear if it will be able to stay above it.\n\nFor Bitcoin to keep growing, the asset should stay at least above 50 EMA, but it is not an easy task considering questionable market inflows right now.\n\nAdvertisement\n\nIf Bitcoin can stay above these support levels and move past $70,000, it could be the start of another big increase in price.\n\nGood news for XRP\n\nAfter a tough period of time for XRP, there is some good news: XRP has moved above its 100-day exponential moving average (EMA) again.\n\nRight now, the price of XRP is at $0.5967. Breaking the 100 EMA line is important because it can be a sign that the price might start moving upward once again. If XRP can keep up this momentum and stay above the 100 EMA, the next big test will be at the 50-day EMA, which is at about $0.62. If XRP can break through this too, it might just prove that it is ready to climb toward an yearly high once again.\n\nHowever, even with this positive move, there is a chance that XRP might not keep rising. It is possible that the price will not go up much more and that this is not the start of a real comeback. To be sure that XRP is really making a comeback, we need to see if it can hold above the 100-day EMA and then break past other important prices like the 50-day EMA.\n\nInvestors and people who watch the crypto markets are going to be paying close attention to XRP. If it can stay strong and move past more resistance levels, then it could mean that XRP is making a real comeback. But if it cannot, and the price falls below the 100-day EMA again, it might suggest that XRP still has a way to go before a true recovery starts.\n\nEthereum is safe\n\nEthereum is at a key threshold. Its price is being squeezed between an upward trendline and the 50-day exponential moving average (EMA), which may lead to a big move in price soon.\n\nCurrently, Ethereum is trading around $3,391. The chart shows that the price is just above the upward trendline, which has been acting like a support, helping to stop the price from falling further. This line is moving up slowly, which could mean that the price of Ethereum might go up with it.\n\nThe 50-day EMA, right now at about $3,400, is right above the current price. This EMA often acts as resistance, which can push the price down. Ethereum is stuck between this resistance above and the support trendline below. If the price can break above the 50-day EMA, it could rise to the next resistance level around $3,545.\n\nBut if Ethereum cannot stay above the trendline, it might fall to the next support level, which is the 100-day EMA at around $3,090. If it drops below this, the price could go down to the 200-day EMA at $2,665.\n\nFor now, the market is sending mixed signals. This means that Ethereum's price could go both ways, and it is not clear which way it will go. Investors are watching closely to see if Ethereum can stay above the trendline and break past the 50-day EMA."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPaEtaNmJLaDZBN2hNOWNNTTRVRm1XTHJTdmE4bFJFTXRBYWRIZHBuRmZVWHZKOVlQTDQ5N0V5Wm9ldzc2VkRRR1gxVUVMV3Y5V0E4RGFJWlNQZ2tSZjVkeHAzcFJnX0FDbnRwWmhHQkFSUnZzOXpNQUEzVGpZa21xMUdkOFBNcE5tZy14VXYtZGgyRWVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum, Bitcoin, and Dogecoin Rallied Today - The Motley Fool",
        "content": "Major cryptocurrencies rallied to new highs thanks to multiple tailwinds.\n\nSeveral major cryptocurrencies started the week on a high note today amid a confluence of positive catalysts, including potential short squeezes, technical trading tailwinds, and -- perhaps most surprising -- geopolitical tailwinds from leading Chinese money management firms.\n\nWhen all was said and done, as of the close of Monday's regular session, the price of Ethereum (ETH -1.29%) was up 9.1%, Bitcoin (BTC -1.73%) had rallied 3.8%, and Dogecoin (DOGE -3.75%) gained a little over 2%.\n\nOn a possible crypto short squeeze, technical tailwinds\n\nAccording to Coinglass data this morning, the digital asset market has seen more than $176 million in liquidations over the past 24 hours, the vast majority of which (around $124 million, or 72%) came from liquidations of open short positions.\n\nAs the price of major cryptocurrencies has rallied in recent weeks -- spurred by a combination of factors, including strong inflows into Bitcoin ETFs, an upcoming Bitcoin halving event, and expectations for the possible approval for the first spot Ethereum exchange-traded funds (ETFs) -- it appears that short-sellers are effectively being forced to close their bearish positions. The resulting surge in buying demand can cause a so-called short squeeze, sending digital asset prices even higher in the process.\n\nMeanwhile, technical trading patterns may also be playing a role. According to the widely followed Bitcoin analyst TechDev on social media platform X, the price of Bitcoin appears to be consolidating above key technical levels and trading averages that have historically preceded significant rallies for the world's most prominent cryptocurrency.\n\nIs China entering the Bitcoin ETF market?\n\nIf that wasn't enough, Chinese financial news site Securities Times reported on Monday that multiple China-based financial giants, including Harvest Fund and Southern Fund, have submitted applications through Hong Kong subsidiaries for their own spot Bitcoin ETFs. Those applications are currently awaiting regulatory approval.\n\nThis news is particularly significant, given China's previous public hostility against Bitcoin. In 2021, China's top regulators even banned crypto trading and mining, sending the price of Bitcoin plunging at the time. It became evident in recent years, however, that China's ban on crypto wasn't absolute, and crypto trading and mining has reportedly continued to thrive in the country. If China is indeed softening its stance, it would serve as only the latest significant validation for the global adoption of Bitcoin and other cryptocurrencies.\n\nThe U.S. Securities and Exchange Commission (SEC) only approved the world's first 13 Bitcoin ETFs in January 2024. The historic approvals served as arguably the most prominent validation yet of cryptocurrencies as a legitimate investment asset class. Because ETFs can be bought and sold throughout the normal trading day via nearly any online brokerage -- in contrast to requiring investors to set up separate crypto trading accounts with a crypto-specific firm -- they're a much more accessible investment medium for anyone considering making cryptocurrencies a meaningful part of their portfolio.\n\nBitcoin ETFs have experienced enormous inflows since then; late last month, for instance, the ARK 21 Shares Bitcoin ETF (NYSEMKT: ARKB) registered net inflows of more than $200 million, becoming the third Bitcoin ETF in the U.S. to cross the $200 million mark this year.\n\nFor perspective, China's Harvest Fund and Southern Fund manage over $230 billion and $280 billion in total assets, respectively. So, if their Bitcoin ETF applications pass regulatory muster through their Hong Kong subsidiaries, and the mainland Chinese government continues to opt for a more cautious approach with indirect approval, it could signal a massive positive shift toward more pervasive crypto adoption over the long term from the world's second-largest economy.\n\nThat certainly doesn't guarantee that Bitcoin, Ethereum, and Dogecoin will continue this incredible rally indefinitely. But as cryptocurrencies, in general, continue to enjoy greater adoption on a global scale, it's hardly surprising to see the prices of the most prominent digital assets continuing to reach new highs."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOQmJyeS1FaTQ2TzVsQzZWcjZGVHJCZ0pJUk1sS1VLRFFXT05aWDhWZ3VMZzZUWXdoMkpWVmd2cXdOS21IQ0VSU1Z5Z1VUaHpubnFsNWJqalpVUzA3bWtxWEdzazF4UlFTallFOW1HbXA4ZnpVSFQ4QmxrVG9zMUw1NHM2OXh0WG5hTzZOYnRZTnlQOEIzQThLejEyenk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "ZkLink looks to solve Ethereum’s fragmented liquidity with a layer 3 — but there are risks - DLNews",
        "content": "Layer 2 blockchains have helped scale Ethereum, bringing transaction costs down to cents compared to those on the main Ethereum network.\n\nBut despite their successes, layer 2s have created a new problem called liquidity fragmentation — the splitting up of once-concentrated capital across multiple separate blockchains.\n\nLiquidity fragmentation poses several problems. Smaller, unconnected pools of capital spurs volatility and means users get worse prices on their trades.\n\nZkLink is one project working to solve liquidity fragmentation on Ethereum.\n\nIt has created a so-called layer 3 network — zkLink Nova — which is connected to eight Ethereum layer 2s. zkLink has launched MergeToken on Nova, which is a smart contract that consolidates assets — bridged from layer 2s to Nova and of equivalent value — into a single token.\n\n“We’re setting the precedent for a practice that we hope more projects will adopt to make the web3 trading environment friendlier,” said Vince Yang, CEO and co-founder of zkLink.\n\nBefore layer 2s, as well as other blockchains like Solana, Ethereum hosted the lion’s share of onchain activity, pushing the network to $102 billion worth of DeFi deposits in 2021.\n\nEthereum liquidity is spread across multiple layer 2 blockchains.\n\nBut in recent years, onchain activity is increasingly moving to layer 2s — separate networks built on top of Ethereum that offer faster and cheaper transactions. Much of Ethereum’s vast capital has jumped ship, flowing to layer 2s like Arbitrum, Optimism and Base, among others.\n\nJoin the community to get our latest stories and updates\n\nMergeToken will initially merge versions of stablecoins USDC, USDT and DAI, followed by Wrapped Bitcoin and Ethereum liquid staking tokens in the future.\n\nThe hope is that by reunifying Ethereum’s scattered liquidity on its layer 3, zkLink can increase capital efficiency within the Ethereum ecosystem and provide a better user experience and trade prices.\n\nBut there are also risks.\n\nIn order to make zkLink’s plan work, users must bridge their assets from other layer 2 blockchains to Nova, then lock them up in an upgradable smart contract controlled by a multi-signature wallet — a crypto wallet that requires multiple password-like private keys to send transactions.\n\nThis system creates a big pool of assets that can become a lucrative target for hackers. In 2022, the Ronin crypto bridge, which also kept assets in a multi-signature wallet, was hacked for $624 million after the private keys that controlled it were compromised.\n\nAddressing security concerns\n\nYang told DL News there are 3 external vulnerabilities zkLink attempts to protect its users from: bridge contract risk, MergeToken smart contract risk and governance risk.\n\nBoth the bridge contract and the MergeToken contract lock up assets in single places — like bank vaults filled with gold bars.\n\nAnd like such bank vaults, which before the advent of digital money were all too often a target of thieves, these smart contracts that hold millions of dollars worth of crypto have also become lucrative targets.\n\nHackers have previously used social engineering techniques to steal the private keys that control smart contracts, while others have used code exploits to trick contracts into giving them their contents.\n\nYang said zkLink’s contracts have been audited by its security partners, ABDK and Secure3.\n\nHe also said that the multi-signature wallet that controls the MergeToken smart contract is tied to a governance committee made up of multiple projects separate from zkLink.\n\nA governance committee made up of 12 projects and institutions, including market maker Wintermute and venture capital firm Ascensive Assets, will oversee all current and future merger proposals.\n\nZkLink said upgrades to the MergeToken smart contract require a two-thirds vote from committee members. Upgrades will also be only executed after a seven-day timelock period, giving the committee and users time to review the changes to the contracts.\n\nFixing liquidity fragmentation\n\nCertain tokens, such as Circle’s USDC stablecoin, are not always equal across different layer 2s. When a user sends USDC to Nova, it is represented as a different asset depending on which layer 2 blockchain it came from.\n\nZkLink Nova offers the same faster and cheaper transactions by using zero-knowledge proofs, the same technology that underpins layer 2s like zkSync and Starknet. But it also reunites liquidity split among several different versions of the same assets issued across the ever-growing list of layer 2s.\n\nBut the boons of reunifying liquidity are only accessible to those on Nova, Yang told DL News.\n\n“The MergeToken is a function unique to Nova and dApps built on Nova can access the aggregated liquidity pool,” he said.\n\nDeFi users will have to look to other projects, such as cross-chain bridge and messaging projects like Wormhole, Axelar and LayerZero to break down the barriers between separate blockchains once and for all.\n\nBut for now, zkLink’s offers one of the first available solutions to liquidity fragmentation that users and developers can start playing around with.\n\nUpdate, April 8: Added that upgrades to the MergeToken smart contract will only be executed after a seven-day timelock period, and clarified that zkLink’s bridge contract and MergeToken contract lock up assets in different places.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com."
    }
]