[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNZDN0ZTlSalhFSnQyZDQxZmNaRDdUXzlqYVlvaGg5NFhLNmU3U25lZFVYNVhiOWtWTlBxSFNhZDdsem5qVkZBNlNSb1RWbGx4SjBWaXFTeGtUTmdkeHpJekVXM3NfWi0wajZ2aG5VaDJSbVQ5aFFmdGJxd1VfTk5UdGZpWVNlYVU1WHZ0UG8wLWZuZTdOaE1SVjgxbVJkVFdJQnFjZGpTZlVQOGdlNjZtQkF3WTI2cmQ2dGFOMGtMRHlSd0k1T1g5ZHJHMEVVcW1SeXZBczZfdm03UdIB5wFBVV95cUxNM0NDMm1YVVBUZ2RRR1lRYTc3MzBQTVRjMUZsanVLbGQ1dGtxbHg1TklqZGlJbzk5SDJMM092dVgzenI4NHNKV2RCcVhJdUxPWlg2TmhaOFNlVHJGVTAxWVBFU2g2SDE3d0pCZXV3eVVUSzNQQ2RZaUM0ZlJpbVlzR3R1ZU5JQXR2LVJ1c2x4cUpZSTRsUi1EU0ZJdTZ2cXlGQzdXRnNna3lDLThocmtqZ19VOUVkX0NtX25GVEJuS2hvbVVfaFpmUVY1dlFnNHhUNkZPU2NIdk5XczlTSWkycVZmRmU5cTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Crypto Market Shows Signs of Rebound as Bitcoin and Ethereum Lead the Charge - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNWFQwRTdJQ1JpNnNRVTVmREowVDkzN2xwNmZCY3ZkeHRzU1V5bkJVc0s0aTVxRzMxUEhNUDdnU3ZlbngzZlBUSnFLcVF4ZV9kMUhNOGxMSFQzZVYybTUzOFY3YVM0LWZrR1dmSmVrMTNPa2pfcGpTT1hMWDVlaDVaeXkxaENvYlZEUEZuNXVSTzZCWEQ3YmlJbHp2cjZHNjg3cGFNYUlQLVBRMmd0MmhEV0Ixa0Nfbm04YXRVSlBlbGVqYTJ4YnQ4MHJfTVQxUdIB0wFBVV95cUxOSTAtMEZGM3Via2tISURBb2Rkdmp6b2d3ZHdfWmlFbGM0VmpfVWFGa1M3QTBuMEdjU2xxc2lUV2kzRW8yNHRfWjJDTy05cWlsc3RYREU3TjRQTy11MkFyQU41RFBOeUFqZ1VSeDNaUy1EbkdFbUZhcEU4ZV83UHcxaWxFZngweHFYTlN6UEFNSENhakhTVkNucUxncFpxZkVSRkhrSzB3bktxUFFMUTIyT2d4eHNHN1JBZjFPSzl3TG1OOGVtRGpzbzNWb3lOdWRORFVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Grayscale amends Spot Ethereum ETF filing, ETH trades sideways below $3,700 - FXStreet",
        "content": "Grayscale filed an amendment to its Spot Ethereum ETF, a Form 19b-4.\n\nAs one of the largest crypto asset managers, Grayscale says investors deserve access to Ether in the form of a Spot ETF.\n\nEthereum price trades sideways at $3,686, taking nearly 2% loss on Saturday.\n\nGrayscale manages $10.87 billion in assets in its Ethereum Trust, and the asset manager recently amended its filing for a Spot Ethereum ETF.\n\nGrayscale’s lawsuit was one of the key driving forces behind the Spot Bitcoin ETF approval, the amendment filed by the asset manager could be a sign of the Securities and Exchange Commission moving things along in the process of deciding upon a Spot Ethereum ETF, according to crypto experts on X.\n\nAlso read: Ethereum ecosystem needs a major mindset shift for global impact, says Vitalik Buterin\n\nGrayscale files amendment to its Spot Ethereum ETF\n\nGrayscale intends to convert its Ethereum Trust to a Spot Ethereum ETF. The asset manager announced that it filed an amendment and took an important step to uplist ETHE to the NYSE Arca.\n\nWe just filed Grayscale #Ethereum Trust's amended Form 19b-4 filing. This is an important step in our effort to uplist $ETHE to @NYSE.\n\nMore from @CraigSalm https://t.co/y5Mg1bvqU8 — Grayscale (@Grayscale) March 15, 2024\n\nGrayscale believes that investors deserve access to Ethereum in the form of a Spot Ethereum ETF and the asset manager builds a strong case for the same, just as it did for Spot Bitcoin ETFs.\n\nGrayscale asserts that the Chicago Mercantile Exchange’s (CME) surveillance on Ethereum was sufficient to safeguard investors. Further, there is a strong correlation between Ethereum’s Spot and Futures markets, therefore the SEC must approve Spot Ethereum Exchange Traded Product (ETP) on the same basis as it did for the futures product.\n\nAt the time of writing, Ethereum price is down nearly 3% on the day. The altcoin is trading sideways, at $3,686 on Saturday, after successful completion of its Dencun upgrade.\n\n(This story was corrected on March 17 at 13:55 GMT to say \"just as it did for Spot Bitcoin ETFs,\" not \"Spot Ethereum ETFs.\")"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOM1dhODZKeTM2bVAyYjg5NWlHQlU3bDkwRXJMaGpRbTlDSVdxT1h1dnRHQnpMN3ExLUREZkxKZDAwWFlXQ3ZKVE9jRVBwMUJfajZKdXZDdEN4cWo3RUV2b0ltR2VLdEY4dzU2TDZDZGdWVFN0Z2lyZjhVWHRjU0p4TGxVVGNjRkZlZ1FSQkRKMXVZV0tvSFVLb0hPUW5yTGdtYk1FeFJfR0JuY2V5d1JULVltelVtd0k1M29qeEtKOHFEYklweFhrQVA4bWlMUXJSeWtmRUFwaDM4TTjSAeABQVVfeXFMUEJSSkQ3MUdWZ0xsQUl1LXk2U28yX1pfMG90QllSRmFhb3FEcWRmbExWVlJzMWlJTmpUOXVOeHpYcWVmY0VGQ2lOeS0wM2lDN3JvRmJNTmY5TUdQYlNYcF9ENmNseVo1cnpoai1rX2RKcG53NWQxWUFWS0Q0MWxQcTlEUzUzdV9oUXhHR18wWkgxVFpodHpsT0NzdVdlVjZ1cWRBTHAtRU1UeE9EWC0wd0ZCdWU0VXBYQVc4cTR2bDZLTmt1VlhQSTlHemdNbC1aSVhiVzhZcTlGd2RsTDdfTmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Trader Says Large-Cap Ethereum Rival To Explode by Over 180% This Cycle, Updates Outlook on Floki and Chainlink - The Daily Hodl",
        "content": "A widely followed analyst and trader is offering his forecast on three crypto assets.\n\nStarting with the fifth-largest crypto asset by market cap, the analyst pseudonymously known as Inmortal tells his 209,800 followers on the social media platform X that Solana (SOL) could replicate its rival Ethereum’s (ETH) explosive rally from early 2020 to late 2021 and skyrocket by similar multiples.\n\nEthereum went up from the low of a price of just under $90 reached in March of 2020 to an all-time high price of just below $5,000 which was recorded in November of 2021.\n\nFrom the current price, Solana could go up by approximately 182% from the current level, according to Inmortal. If the fifth-largest crypto asset were to reach Inmortal’s peak-of-the-cycle target, Solana would have recorded a 60x gain from the December of 2022 low.\n\n“Previous cycle ETH went from $80 to $4,800.\n\nThis cycle SOL will go from $8 to $480.”\n\nTurning to Floki (FLOKI), Inmortal says that the memecoin is undergoing vertical accumulation, a situation where the price of an asset range-trades while gradually inching upwards.\n\nBased on the pseudonymous analyst’s chart, it appears that Inmortal is suggesting that FLOKI could fall significantly after breaking above the all-time high of slightly under $0.00034 before going on to rally in a parabolic move.\n\nFLOKI is trading at $0.000247 at time of writing.\n\nNext up is the blockchain oracle Chainlink (LINK). According to the pseudonymous analyst, LINK could be preparing for the second wave of a rally.\n\nBased on Inmortal’s chart, it appears that the analyst sees LINK rallying by around 68% from the current level to a price of $32.\n\nChainlink is trading at $19 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPejhZdk11STE4QVpyT2trSVo4aGhMRmtfX3B3aUtmSnktdlJrci1SMUp4QW1nWVdfM1l2WDduanVyUnZnR2RWU0NjOUhfS0x2T0ZsVHBocm5IRGl3dUFRakZwQjhQTTNvdzdyOU5wdl9oTXo3WEdkbkI4ZzQzV1E0VkY2NEZMb3ZTUEM2S2ZwNGUxZ0F4OHlmcVRGT0VoX1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "The crypto future of Ethereum: the launch of the Metis Alpha - The Cryptonomist",
        "content": "Crypto news: the launch of Alpha marks the activation of the decentralized sequencer of Metis, representing a significant step forward for the scalability of Ethereum through the implementation of this milestone.\n\nLet’s see below all the details.\n\nMetis Crypto Sequencer: Steps Forward for Ethereum\n\nAs anticipated, Metis, the Layer-2 scalability platform of Ethereum comparable to the EVM, has launched the Alpha version of its innovative Decentralized Sequencer. This marks a significant step towards the decentralization of rollups.\n\nThe decentralized Sequencer represents a significant advancement compared to the single sequencer model currently adopted by other Layer-2 rollup solutions.\n\nThis launch positions Metis as the first rollup of Ethereum to adopt a decentralized approach to its sequencer. Rollups represent one of the most promising scalability solutions, but currently they have some drawbacks.\n\nTo fully ensure the security of Ethereum, a decentralized fraud/validity proof system and a decentralized sequencer are needed.\n\nSo far, no other rollup has focused on the decentralization of the sequencer, making them vulnerable to single points of failure and potentially subject to censorship.\n\nWith this new feature, instead, by keeping control over a single sequencer, the foundations maintain almost total control over the network and its revenues.\n\nSecurity, fairness, and community involvement in the crypto network\n\nThe adoption of a decentralized sequencer by Metis allows multiple entities to manage the sequencers. This improves the security and decentralization of the network and enables a more equitable revenue sharing with users.\n\nA distributed sequencer also paves the way for crucial functions such as seamless and secure sequencer rotation, the ejection of malfunctioning or harmful entities, and increased network stability.\n\nUsers can contribute to maintaining the decentralization, transparency, and stability of the network by becoming sequencers and participating in the consensus process.\n\nThe participation of multiple entities makes it more difficult for malicious actors to control or compromise the order of transactions.\n\nThe Sequencer nodes can earn rewards in METIS tokens for their role in block production and transaction processing within the network.\n\nActive participation from the community can lead to greater recognition within the group, paving the way for future collaborations or potential partnerships.\n\nFurthermore, during the first year, all sequencer nodes will benefit from a Mining Rewards Rate (MRR) of 20%.\n\nMetis gets a price rally with listing on Binance\n\nMetis has experienced a significant increase of about 27-30% after the announcement of its inclusion on the Binance trading platform.\n\nThe inclusion on Binance of the crypto has effectively introduced the project to a wide range of traders and investors, increasing its liquidity and accessibility.\n\nThe surge in the token price can be attributed to various factors, including the increase in visibility and credibility resulting from being listed on Binance, as well as the growing market interest in Layer 2 scalability solutions like Metis.\n\nParticularly significant is the fact that Binance has waived the listing fee for Metis, demonstrating confidence in the potential of the project and commitment to promoting innovation in the cryptocurrency sector.\n\nThe designation of “Seed Tag” conferred to Metis by Binance highlights its status as an innovative project, which could involve greater volatility and risks compared to other listed tokens.\n\nThe increase in Metis prices and its listing on Binance have coincided with a broader recovery in the cryptocurrency market.\n\nBitcoin has recently surpassed its previous all-time high, exceeding $71,000.\n\nOn the other hand, Ethereum has temporarily exceeded $4,000, further contributing to the bullish sentiment around Metis and other promising blockchain projects."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxNd09tb1ZSTzQ4UkFhSE5tUUY5RFZYdXRBRFhnSWZ5b1NRZS1vUEJXRFQ3cXpzdlZ1aTgyeUxKZ0hwSE95VGhBUGZ0b0hnbC01VThET3Y5aXhjT25Ec1VNQUlDQzJORmU4bWM1M0E3b1NpMUtQNnB1WXJvSVBGTnNDQVFtdDRsU3pRVm1vU2RxQy0zbVBvY1NLT1V3M0Y3MERLWFdGWHNidnVXdS1NS0pQTTFselVLbFlSNjRzVXlPazRmS2FUUTUySVlYdzVqakZPbDZlNXFlMmcyRVJGX2RuU2ViallRRG9jbjJUbWFKb0d3ZHowTFE5TNIB_gFBVV95cUxPemVrSG9kODB3WTVEMUxVTTFaeGdnOTBhdHhBX2pMQW9waHZTVFd4eDV6cEpaV2ZaZzJEQmR4bHcxTW5UZUNYZ1Q2WDJNQ1g3d1o0b3NlYlFQWTRIZ19MV0ZKNkx3d3hZYlhVU2FBbzdwa1RBRmwtYVcyNVR2RlpmbzNDZEs4cVdVQWVYZzNOZW1ObFhsX29rckdvNXRndEh5Q1RuNGc5SEpsVWM3N2Z0Z05pcng3VFNnUWE4d2w2ZHN3VnNRNl9rYktYNVNDN0dyb20xX0tNV1lhTUl6ZWlTWnBxcUxQWXVFV0RrZWViS1VBbmRaYVowQkhGbW1SQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC as low as 60K would still be a good buying opportunity - FXStreet",
        "content": "Bitcoin price could extend the fall to $60,000 without invalidating the bullish thesis.\n\nEthereum price could drop 10% if BTC weakness prevails\n\nRipple price could drop 7% to $0.5740 before the next leg up.\n\nBitcoin (BTC) price has crashed, and with it, altcoins have followed in a cascade of dumps that has seen over $530 million in total liquidations across the cryptocurrency market. However, the thesis remains bullish, with the current correction likely a good buying opportunity for late bulls before the next move north.\n\nAlso Read: Over $530 million in crypto positions forcibly closed as Bitcoin price dips on Friday\n\nIs $60,000 the next level as Bitcoin price dumps?\n\nBitcoin price remains below the $69,000 threshold, which had capped the upside potential for BTC since November 2021. Technicals suggest a continuation of the fall, amid a nose-diving Relative Strength Index (RSI), which suggests momentum is falling.\n\nThe histogram bars of the Awesome Oscillator (AO) are flashing green, a sign of the bears’ having a strong presence in the BTC market. Additionally, the volume indicator is showing large red bars, showing the downtrend is gaining strength.\n\nBitcoin price could extend the fall, which means investors could still have an opportunity to buy lower before a strong move north ahead of the BTC halving. One trader and analyst on X, @Cryptomanran, indicates, “A 20% or 30% dip would be completely normal and healthy in a bull market, especially a month before the halving.”\n\nA 20%/30% dip would be completely normal and healthy in a bull market, especially a month before the halving.\n\n\n\nWe could go as low as $55k/$60k easily and that would be a crazy buying opportunity.\n\n\n\nI’m not rushing to buy anything yet… — Ran Neuner (@cryptomanran) March 15, 2024\n\nNevertheless, investors are encouraged to conduct their own research. In a dire case, however, Bitcoin price could slip below the $60,000 psychological level for a liquidity grab of the March 5 low of around $59,005.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls act now, buying BTC at current levels, Bitcoin price could recover. To confirm the uptrend, investors must watch for a candlestick close above $64,044, the mean threshold of the supply zone between $71,290 and $73,193. Such a move would clear the path for BTC to reclaim the $70,000 psychological level, or higher to clear the $73,777 peak before a new all-time high.\n\nAlso Read: Bitcoin price slumps further from Thursday's record high above $73K\n\nEthereum price suffers the wake of a weakening BTC\n\nEthereum price is nose-diving, taking direct cues from BTC despite the recent Dencun Upgrade, which was expected to be a bullish fundamental to positive impact ETH price. With technicals flashing bearish, Ethereum price could extend the fall to test the $3,527 support.\n\nIf the aforementioned level fails to hold as support, Ethereum price could slip past this buyer congestion level, potentially going as low as the $3,200 level, a 12% drop below the current price.\n\nETH/USDT 1-day chart\n\nConversely, a re-entry by the bulls could see Ethereum price recover. A flip of the formidable resistance due to the equal lows of $3,722 into support after a strong spike in bullish momentum would improve the chances of continuing the uptrend. This development could result in ETH heading straight to the $4,093 range high.\n\nAlso Read: Ethereum L2 bridge deposits skyrocket after Dencun Upgrade\n\nRipple price eyes a 7% drop\n\nRipple price is down 15% after a peak of $0.7440 on March 11. Amid falling momentum and a downtrend that is gaining strength, XRP price could extend the fall 7% to $0.5740 before a possible recover.\n\nHowever, in a dire case where this level fails to hold, Ripple price could extend lower to the $0.5368 support level where the bulls could have another buying opportunity.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if bullish momentum increases, Ripple price could reverse the direction. A move above the $0.700 psychological level would inspire more buy orders, reinvigorating the trend for XRP price to clear the $0.7500 range high.\n\nIn a highly bullish case, Ripple price could reach the $0.8000 psychological level. Such a move would denote a 27% climb above current levels.\n\nAlso Read: XRP price plummets to $0.67 as holders brace for SEC vs. Ripple lawsuit deadline"
    }
]