[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9VMjY4WGFmbFpaN0tYRUdqODJJUm1OcTZodjVaTzhTck9qX3g0VVlXc2FOYUhYc01zV3lGYlJqYk1ISmhYS0puZVVjX1d6eWVCbk54dWhCbVJybzY0NXVmX3hqR1Q2OUZYRExkcHBoTjNfaHFvVkViM01XSTJvZFnSAYcBQVVfeXFMTUdvR0JOZ3JYUGRLaUtXMEhzQmtaclVfOGNadV9KUTBxYmFpcWJDd2V0WjhLSE42b0xFYTNJNTJXYXc5d01zSlV5N3R0WW43aGVrX1JhNXRyZnp2OWpZMW5JZTJyZlVOQm1xTHJsTF9xVEh0aEZIcmxXOXM4Y3hWRlc1R1ctSlpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "SEC Pushes Back BlackRock Spot Ethereum ETF Application—Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Securities and Exchange Commission has, for the second time, delayed decision-making on a proposed spot Ethereum ETF from investment giant BlackRock.\n\nThe original application to create the iShares Ethereum Trust was submitted to the SEC in November, which the federal regulator delayed two months later, asserting the need for a “longer period within which to take action.” A new deadline of March 10 had been set—and has now been thrown out, according to a Monday filing.\n\nThe SEC has pushed back its decision on several other spot Ethereum ETF applications, including from Fidelity, Invesco, and Galaxy Digital. Bloomberg ETF analyst James Seyffart predicted that delays would continue until May 23, which is the drop-dead deadline for applications from VanEck and Cathie Wood’s investment firm Ark Invest. Those applications were submitted on Sept. 6, 2023—Fidelity's originating in 2021—and saw their decisions first delayed two weeks later.\n\nSEC just delayed @InvescoUS & @galaxyhq's #Ethereum ETF. 100% expected and more delays will continue to happen in coming months. The only date that matters for spot #ethereum ETFs at this time is May 23rd. Which is @vaneck_us's final deadline date pic.twitter.com/gkVZL2QuPK — James Seyffart (@JSeyff) February 6, 2024\n\nAD\n\nAD\n\nInterest in spot Ethereum ETFs is intensifying as Bitcoin surgest toward a new all-time high—coming within 6% of the hotly anticipated milestone today. The Bitcoin frenzy is largely attributed to the success of spot Bitcoin ETFs, which saw $1.84 billion in inflows in just one week. The possibility of the same happening with Ethereum—which just hit its highest price in over a year—is creating pent-up demand.\n\nThe upcoming Dencun upgrade for the Ethereum network is also seen as a bullish signal.\n\nETFs based on Ethereum futures have been available since October."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ0haSjVnRmxTX3BfbmttN0hlSXBDVmpycUp2czZhMFZYR0ZFYUp1MmFJYUV2UElPTlgxT051ekcyNUZfOVV4ZU5UenM0TlVoNEV5TUhCUVpXQm9tMlpRaERrMGpmT0ZCZG9rRjhuNHgzSnhTYkluam1wVDhaY2Z5aHVHdldlN1VLN2fSAZIBQVVfeXFMUGhzYTlQWGs4U0ItQVdxVjNPZWlIaVV5WU15ZmFIcE9jMFVEUXF0cklJb0hmOGx5V0c0T2pYN0xlNE1Dby1lTjdMRHd4YVJLWjlBTjJqNlNuMDliaHhRd1Y4aXJFeG94ZS1DVVo0bld4RXlUQV9FSzYySkpOTzB4N0VFc1dPcG9BcjZEWGoydks5OGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Gas Fees Skyrocket Again, Pushing Price of NFT Transactions Near $400 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAll good things come at a cost—and in this case, skyrocketing prices across the crypto market have also triggered an equally steep rise in Ethereum gas fees.\n\nOn Ethereum, massive levels of network traffic pushed gas fees beyond 174 gwei by midday Monday according to Etherscan, incurring significant costs for traders attempting to complete various types of transactions within the blockchain’s ecosystem.\n\nTo give an indication of the severity of the gas fee uptick: The average charge to complete a typical NFT transaction on Ethereum eclipsed $372.29 at certain points on Monday. This means users, even if they were swapping profile pictures (PFPs) among friends for free, would have to pay hundreds of dollars just to see those transactions completed.\n\nSwapping tokens on Ethereum cost almost as much at several points on Monday, upwards of $220 per transaction. Such prohibitively expensive fees potentially eliminate the value of certain crypto transactions, as the costs could eliminate any potential profits from flipping tokens.\n\nAD\n\nAD\n\nBorrowing on Ethereum cost above $186 per transaction at certain points on Monday; attempting to escape such steep prices by bridging funds from Ethereum to another blockchain cost over $70 on average.\n\nIn the last 24 hours, the largest gas guzzler in the Ethereum ecosystem has been Uniswap, a protocol for trading fungible ERC-20 tokens. Over $4.2 million worth of ETH has been burned completing transactions on the platform in the last day.\n\nThe uptick in exorbitant on-chain surcharges comes as cryptocurrencies like Ethereum and Bitcoin—as well as on-chain assets like NFTs—are experiencing massive surges in value.\n\nOn Monday morning, ETH hit $3,500 for the first time since the start of 2022. Minutes later, an Ethereum-based CryptoPunks NFT sold for a whopping $16.03 million worth of ETH, the second-highest price ever fetched by a piece in the popular PFP collection.\n\nAD\n\nAD\n\nThe gas fee surge also comes just days before Ethereum’s much-anticipated Dencun upgrade, which is set to substantially reduce transaction costs on Ethereum layer-2 scaling networks via a novel data storage method called proto-danksharding.\n\nSeveral layer-2 developers recently told Decrypt that they anticipate Dencun will so significantly reduce gas fees in the Ethereum ecosystem, that the concept of such charges may soon become obsolete.\n\n“We’re going to enter a world where most users are just not going to experience gas at all,” Polygon Labs VP of Product David Silverman previously told Decrypt, “and it becomes abstracted away.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNRm90bVhsVVFCMEROQXpOR0V3OHI3Uk5DU1FzWGlCcDNZeEFXSS1GR3Ztb3NzVDNtUnd1dHZFZ3VHaDZuR05KRzF6REotQlppWGhHSS15ZDVPU0d1b20zVElQWmlheU5nWWFVMFlEMVloRWpFR1U2UWJaNXQ4N2dnc2xDX3htZzFGWFFtMWNwWG5CTUVwc3RuQUJkTXJKOExkeXR1Q21IMWlZaFU1bUhBWTZMWk01V09fV1FqVE1sZUdTMkN2LUZpMWRFVmVFRV9rU3BOMUU0R0JCZUhyRllFNmh2WS1XVElGbWt1Vkt6RF9RXzZ6TXVyN0VmVi13SUNMdXdndjN5OGhTTHpsQTFyZ0xzYko5R03SAZwCQVVfeXFMTmZPd3ZyWjVuYVJvSVdIUjdGMnh2NGRiVWZCaERyVDJZRVFqSkFjN0RKS1RXT1BLWVNBM1pDRGowOS1HRTZINk50QXI0VHc5TmxaSmFELWFNRnRrZDdwN21vbjFvT29BWHhuSmJSYWVNczA4cUlvQVlWZFJtVDdoUkZOZzRwWjdzZlBWUUF4X0pzd2hnX1NodEYzQS1YeEFFdGZhWEltN09Pdl9RbDJCakcyX1ZhVEYxZ3pkT014XzdieWpIY2djVXJjdDRpVHJFRHlTTGZCaDNrTi1qRXZMQnJvaUxGSVEzT3g1cDhnUE5TTDZoQ3NkUE1LM1ZEaVQ3N0s3Vnp0dFFlUVllMkVuOGtJVkpUMGgtdFZFR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price on March 4: Bitcoin trades above $63,000; Dogecoin, Shiba Inu jump up to 11% - The Economic Times",
        "content": "Tech view by ZebPay trade desk\n\n\n\nAgencies\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nTop cryptocurrencies were trading higher in Monday's trade. While Bitcoin rose 2.2% in the last 24 hours and traded at $63,275 around 11:21 am IST, other major cryptos such as Cardano, Ethereum, Dogecoin , Shiba Inu, and Polkadot surged up to 11%. However, a few of the top crypto tokens such as Avalanche, Chainlink, Polygon, Solana, and XRP were the laggards.Meanwhile, the global cryptocurrency market cap surged 1.5% to around $2.38 trillion in the last 24 hours.\"Bitcoin traded above the $63,000 mark over the weekend. The upswing in price is attributed to growing mainstream adoption of spot Bitcoin ETFs and the approaching Bitcoin Halving event. BTC is eyeing towards $67,150 resistance level, if the momentum continues, a close above it this week could signal the potential for a new all-time high,\" said Edul Patel, CEO of Mudrex.Meanwhile, Shivam Thakral, CEO of BuyUcoin, said, \"Ethereum, on the other hand, is trying to break the $3,600 level, which could potentially push the second-largest cryptocurrency beyond $4,000.\"The total crypto market volume over the last 24 hours is $110.12B, which makes a 28.38% increase. The total volume in DeFi is currently $9.6 billion, 8.71% of the total crypto market 24-hour volume. The volume of all stablecoins is now $129.27 billion, which is 88.33% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $1.244 trillion. Bitcoin's dominance is currently 52.36%, according to CoinMarketCap. BTC volume in the last 24 hours rose 65.6% to $34.75 billion.\"In the past 24 hours, around $59.27 million worth of Bitcoin positions, with $38.52 million in shorts, were liquidated. This surge is linked to the growing mainstream adoption, notably propelled by the introduction of Spot Bitcoin ETFs, cultivating a stronger holding mentality among investors,\" said Rajagopal Menon, Vice President at WazirX.Bitcoin's recent surge to over $62,000 has captivated crypto enthusiasts and surprised sceptics alike, marking a period of exponential growth. The rally witnessed in February even set a record, representing the longest monthly green candle in Bitcoin's history. Despite this remarkable rise, several key factors and upcoming events suggest that this may just be the beginning of a significant bull run with further potential gains.Bitcoin after taking multiple support at $40,000 resumed the up move and rallied up to $52,985. The asset was facing stiff resistance at $52,000 and started consolidating between $52,000 and $50,000. Post this move, BTC finally gave a breakout above the range and surged up to $6,248. The asset has a strong resistance at $64,000 and $69,000 and to further rally it needs to break, close and sustain above these levels. $52,000 and $56,000 will act as a strong support for the asset."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNRm90bVhsVVFCMEROQXpOR0V3OHI3Uk5DU1FzWGlCcDNZeEFXSS1GR3Ztb3NzVDNtUnd1dHZFZ3VHaDZuR05KRzF6REotQlppWGhHSS15ZDVPU0d1b20zVElQWmlheU5nWWFVMFlEMVloRWpFR1U2UWJaNXQ4N2dnc2xDX3htZzFGWFFtMWNwWG5CTUVwc3RuQUJkTXJKOExkeXR1Q21IMWlZaFU1bUhBWTZMWk01V09fV1FqVE1sZUdTMkN2LUZpMWRFVmVFRV9rU3BOMUU0R0JCZUhyRllFNmh2WS1XVElGbWt1Vkt6RF9RXzZ6TXVyN0VmVi13SUNMdXdndjN5OGhTTHpsQTFyZ0xzYko5R03SAZwCQVVfeXFMTmZPd3ZyWjVuYVJvSVdIUjdGMnh2NGRiVWZCaERyVDJZRVFqSkFjN0RKS1RXT1BLWVNBM1pDRGowOS1HRTZINk50QXI0VHc5TmxaSmFELWFNRnRrZDdwN21vbjFvT29BWHhuSmJSYWVNczA4cUlvQVlWZFJtVDdoUkZOZzRwWjdzZlBWUUF4X0pzd2hnX1NodEYzQS1YeEFFdGZhWEltN09Pdl9RbDJCakcyX1ZhVEYxZ3pkT014XzdieWpIY2djVXJjdDRpVHJFRHlTTGZCaDNrTi1qRXZMQnJvaUxGSVEzT3g1cDhnUE5TTDZoQ3NkUE1LM1ZEaVQ3N0s3Vnp0dFFlUVllMkVuOGtJVkpUMGgtdFZFR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price on March 4: Bitcoin trades above $63,000; Dogecoin, Shiba Inu jump up to 11% - The Economic Times",
        "content": "Tech view by ZebPay trade desk\n\n\n\nAgencies\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nTop cryptocurrencies were trading higher in Monday's trade. While Bitcoin rose 2.2% in the last 24 hours and traded at $63,275 around 11:21 am IST, other major cryptos such as Cardano, Ethereum, Dogecoin , Shiba Inu, and Polkadot surged up to 11%. However, a few of the top crypto tokens such as Avalanche, Chainlink, Polygon, Solana, and XRP were the laggards.Meanwhile, the global cryptocurrency market cap surged 1.5% to around $2.38 trillion in the last 24 hours.\"Bitcoin traded above the $63,000 mark over the weekend. The upswing in price is attributed to growing mainstream adoption of spot Bitcoin ETFs and the approaching Bitcoin Halving event. BTC is eyeing towards $67,150 resistance level, if the momentum continues, a close above it this week could signal the potential for a new all-time high,\" said Edul Patel, CEO of Mudrex.Meanwhile, Shivam Thakral, CEO of BuyUcoin, said, \"Ethereum, on the other hand, is trying to break the $3,600 level, which could potentially push the second-largest cryptocurrency beyond $4,000.\"The total crypto market volume over the last 24 hours is $110.12B, which makes a 28.38% increase. The total volume in DeFi is currently $9.6 billion, 8.71% of the total crypto market 24-hour volume. The volume of all stablecoins is now $129.27 billion, which is 88.33% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $1.244 trillion. Bitcoin's dominance is currently 52.36%, according to CoinMarketCap. BTC volume in the last 24 hours rose 65.6% to $34.75 billion.\"In the past 24 hours, around $59.27 million worth of Bitcoin positions, with $38.52 million in shorts, were liquidated. This surge is linked to the growing mainstream adoption, notably propelled by the introduction of Spot Bitcoin ETFs, cultivating a stronger holding mentality among investors,\" said Rajagopal Menon, Vice President at WazirX.Bitcoin's recent surge to over $62,000 has captivated crypto enthusiasts and surprised sceptics alike, marking a period of exponential growth. The rally witnessed in February even set a record, representing the longest monthly green candle in Bitcoin's history. Despite this remarkable rise, several key factors and upcoming events suggest that this may just be the beginning of a significant bull run with further potential gains.Bitcoin after taking multiple support at $40,000 resumed the up move and rallied up to $52,985. The asset was facing stiff resistance at $52,000 and started consolidating between $52,000 and $50,000. Post this move, BTC finally gave a breakout above the range and surged up to $6,248. The asset has a strong resistance at $64,000 and $69,000 and to further rally it needs to break, close and sustain above these levels. $52,000 and $56,000 will act as a strong support for the asset."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPcHpzZ2JLVk92R0hGZnZXdXZibWxoX2NTWm01R3NRM3RjeGt2QWhfelh2aVA1VEJQRElUM0g2Vm1pTWR4NE52a2gxWEpBZlpuOWMzMHgtQjB1cmR1Z1R6NGVTdGUwUGQySlhjMVZBdlROT0o5a1l5T3l3SF9FY1pXRE9EUWVVa0hINFFHbmxwbGg1bDdST3VLUjhyUndxbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Predicted to Hit $4k as Traders invest $400m - crypto.news",
        "content": "Ethereum (ETH) price reached another 2024 peak at $3,530 around 06:00 GMT on March 4 as strategic traders look to place bullish bets early before ETFs open for trading.\n\nDespite the price upswing, ETH price still appears undervalued relative to the value of capital funneled into the derivatives markets over the weekend.\n\nWith Ethereum open interest currently trending at historic peaks, can the bulls capitalize on the positive momentum to drive the rally above $4,000.\n\nEthereum open interest rose $400M over the weekend\n\nEthereum price appears on the verge of registering on another bullish outing this week. The rapid decline in Bitcoin dominance (BTC.D.) sparked speculations that Ethereum could gain more traction as investors began to increasingly lean into the altcoin markets.\n\nUnsurprising, speculative traders spent the weekend piling on bullish bets on ETH futures markets. Crypto derivatives analytics platform Coinglass’ open interest charts presents an aggregate of the total value of funds currently invested in derivatives contracts for a specific cryptocurrency asset.\n\nAs depicted below, ETH open interest stood at $11.4 billion at the close of trading on March 1. That figure has now increased by $400 million over the weekend, reaching a 3-year peak of $11.8 billion at the time of writing on March 4.\n\nEthereum (ETH) Open Interest vs. Price | Coinglass\n\nEffectively, this implies that while ETH prices pulled back 6% from $3,500 towards $3,300, speculative traders continued to double down on their bullish positions. Furthermore, the\n\nThere’s a widespread anticipation that with over 97% of current BTC holders now in profit, a number of them will likely continue to reinvest some of their gains into altcoins as observed last week.\n\nIf this scenario plays out, and Bitcoin ETFs billion-dollar buying frenzy once again sends BTC prices soaring in the coming week, ETH price stands a chance of making another leg-up towards $4,000.\n\nEthereum price prediction: Can ETH reach $4,000 this week?\n\nAt the time of writing on March 4, Ethereum price is currently trading above $3,500, up 5% from the 24-hour low of $3,365. Drawing inferences from the $400 million capital inflows into ETH derivatives markets over the weekend, Ethereum price looks set to make another attempt at breaking above $4,000 for the first time in 3-years.\n\nHowever, historical accumulation trend shows that ETH faces stiff resistance around the $3,650 area.\n\nIntoTheBlock’s in/out of the money data shows that 1.1 million addresses had acquired 205,890 ETH at the maximum price of $3,572. Considering that they’ve been holding at a loss since December 2021, many of those investors could exit as ETH nears their break-even point\n\nBut if the bulls can scale that sell-wall, it could generate stronger bullish momentum for a $4,000 retest, as predicted.\n\nEthereum (ETH) price prediction, March 2024. Source: IntoTheBlock\n\nAlternatively, the bears could regain control of the markets if they can force a sharp downswing below $3,000. But currently, this seems far-fetched considering the looming support buy-wall mounted at $3,100 territory."
    }
]