[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPLWhJeGNPbFZnR0ZaWC1iWkFkZ3VFNFJZR0l2UkJkc2F5N0JuM2o1OU5qbTh3bUNSS3p5bnUzUlM3WG1yMnFRMWZqUFR3R0V0d3ZWWkhPOXhVbnNSSkd2V21ldUtnT29BejFNTEFGQ1ZRdXlJWXFtWkZ2UVNuYjZoWEc0NU1CT29IYjg40gGQAUFVX3lxTE9JZXJ5TW5VQW9VcHl2SFFyX3hnTVF6MnFtanhFVmRwU1A1UVl1eVB4aWxGdG5seENxYzlfemp5SUFvbmdzM1d2Y1hfeFFhaXRQLVBZd2FCckZUQWxYLWhrb01TMnk2bVEtNlBZLUdsMW9nTmVFV1pobWFfWmgtTENaMnFyY1NaaVdaVFlvSEZGdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval This Week? Nate Geraci Believes It Is Possible - U.Today",
        "content": "In what could be a pivotal development, anticipation is mounting as experts speculate on the imminent approval of spot Ethereum ETFs. For example, Nate Geraci, the president of ETF Store, has sparked discussion on X by suggesting that approval could come next week.\n\nAdvertisement\n\nGeraci's prediction aligns with the sentiments of industry insiders such as Bloomberg's Eric Balchunas, who foresees an ETF debut as early as July 2, strategically timed to coincide with the U.S. Independence Day holiday.\n\nI’m deciphering this as spot eth ETFs will be approved this week…\n\n\n\nJust me tho. https://t.co/rFrMThytgC Advertisement June 23, 2024\n\nMoreover, former SEC official Jay Clayton echoed the prevailing industry sentiment, reinforcing expectations for imminent approvals.\n\nWhen, not if\n\nThe Ethereum ETF saga unfolds against a backdrop of growing institutional interest in the crypto market, particularly BTC and ETH as two major assets.\n\nCurrently, the SEC is reviewing revised proposals from major asset managers, including VanEck, BlackRock, Grayscale and Invesco Galaxy Digital. These filings, which follow recent updates to their S-1 reports, had also disclosed a management fee in particular.\n\nInterestingly, amid the buzz, Hashdex, a notable player in the ETF arena, has withdrawn its application for a spot Ethereum ETF without disclosing reasons or future plans, but presented a mixed Ethereum and Bitcoin solution.\n\nFor now, all eyes remain on the SEC's upcoming decisions, which could mark a significant milestone in the integration of crypto into the TradFi markets. With speculation high and anticipation building, next week promises to be a potential turning point for Ethereum ETFs."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNdzhtN1N1TkgxaFBEeXl4MXRJODVzX1hSaWJJY3k3UUNjREVwX2NoQm5hN1RXMlBUUldoZmFhMzMzOGJrWWh4TFN0UkYzQVhaREtkZ2JMZ211MmZDT3JJWElKY1lzUUJ2Nkh4OXNwT0p0a0RoM3RKdW54Z2xxcmhnNnBoV3ZmQdIBiwFBVV95cUxNUEI1bkVCV2x6XzFaQ2diOGZYeXl2Wm9zV1VTTDBrNGdVOWFIU3BLTnl4ZGU5NzBiNTNDbVUyV0t2TVdpUzhISW01VXI2NGtwRl94akRCMF9ycHFuZVdnazgyblVQWk9sdTl3QXZlWWFjazg4NUxHVHhULTVkcjBsd3JDZHhiVk5Jb3M0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum to $4K? Spot ETF approvals have analysts thinking… - AMBCrypto News",
        "content": "Market enthusiasm around ETH ETFs might not be as strong as most expected, according to analysts\n\nOther market observers believe ETH could cross $4K after ETF launch\n\nDoubts about market demand for U.S spot Ethereum [ETH] ETFs have been compounding, even as analysts maintain a possible launch by early July. In fact, there’s been a debate about whether ETH ETFs can attract demand on a scale similar to that of spot Bitcoin [BTC] ETFs too.\n\nFor perspective, according to Farside Investors’ data, BTC-related products have now hit +$14 billion in net flows and over $50 billion in assets under management (AUM) since their debut in January.\n\nHowever, most analysts believe that ETH ETFs could meet only a fraction of the aforementioned demand. For instance – Quinn Thompson, Founder of crypto hedge fund Lekker Capital, recently reinforced the overall market’s lukewarm outlook.\n\n“The market is fading the positive impact of the upcoming ETH ETF way too hard.”\n\nMixed views on ETH ETFs\n\nJPMorgan analysts are part of the bearish camp too. They recently projected that ETH ETFs could attract about $1 billion to $3 billion in net inflows in the second half of 2024.\n\nAnother bearish figure was shared by Bloomberg ETF analyst Eric Balchunas, who projected that the products could capture only 20% of the BTC ETF market share. His projection was based on the current demand for ETH vs BTC on the Futures market.\n\nOn the contrary, other analysts, like K33 Research’s Vetle Lunde, estimated that demand for ETH ETF products could hit $4 billion in net inflows in the first five months alone.\n\nFor example, Bitwise CIO Matt Hougan is in the bullish camp and views the second half of 2024 as full of ‘tailwinds’ for ETH demand.\n\nA recent Deribit Insights report also painted a bullish future based on recent Options data. It noted,\n\n“Decent clip of ETH Sep 4k Calls bought ($12m premium), and BTC Jun 65k+July75k Calls rolled to increased exposure in Dec 75+90k Calls, showing increased mid-term optimism.”\n\nQCP Capital analysts reiterated the said optimism based on Options data, reiterating that ETH could surge above $4K and retest its record high of $4.8K."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPdUJIWEdEV0ZRaHNkYlE3MzRZS1Z1TEZCeXhhbUx6Z1NYV29YRjR2VlFQZWFuYk0wT2hxNThjQTBnOE1nd0xlTUcxTlY2NnZoLWlJYV80T2JTYmgwUlktZ3diRDlTSmNyN09aVkwtRURobGU5dGpYa1Yxdjdzb0Zzcl83QldTdnh4WVllSmtBajZPWHNFNWdpS1Q1WGFpcE5UQVJwel9GTWY3RDVobXR5Z1RwUHJCelJZSnBQMHY0MXQ0bFo5V1psSDdxS1_SAdIBQVVfeXFMTVJwdzJQcGt6elNWYjVUaHRXczNOTWFQdUNMbTM3NFFyVHV3MmZsdWh0YjBqeDNZbjFmYUNGVlkxVWxXcmVhY0k4VTRMWi0wdnV5OTEtXzY2eFF1WnNjMEU5NmJUd0hTSmdRX1Rxcmx4aWd3OXZhQTBQNzBOYW8zVGhWZEUxa2JlMDAwc241dXVXNTNJRUxaZ2MxMkZXdUozSWZwb3Y4blZRbWcyOTBTX2JLamZIT1U5X1dWSDUtb05uZjJROFRKYXpreng3a2phQ3NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Indicator Suggesting Ethereum Winding Up for Move to the Upside, According to Analyst Jason Pizzino - The Daily Hodl",
        "content": "A closely followed crypto analyst says that the top altcoin Ethereum (ETH) may be gearing up for a swing to the upside.\n\nIn a new video update, crypto strategist Jason Pizzino tells his 329,000 YouTube subscribers that one indicator suggests the leading smart contract platform is gearing up for rallies.\n\nAccording to Pizzino, ETH’s average true range (ATR) – an indicator that measures volatility by showing an asset’s trading range over a specified period – is hinting at an approaching breakout.\n\n“Ethereum [is] looking pretty good – putting in lower highs and higher lows at the moment. We have covered the average true range as another signal that the market is winding up for another move to the upside.\n\nSo we’re watching the ranges of the bars contract and they typically go dead for several weeks, maybe even months, but as we get towards the end of the bull market, these periods get shorter and shorter.”\n\nLooking at the trader’s chart, he seems to predict that Ethereum’s ATR will fall as ETH trades within a triangle structure. A triangle is typically seen as a continuation pattern where an asset witnesses price compression before a big move in the direction of the prevailing trend.\n\nPizzino goes on to say that traders should be on the lookout for Ethereum’s ATR as he says ETH may abruptly fly and leave them sidelined.\n\n“And that is where things get very wild – if you’re not in, that can destroy your portfolio because you’re trying to get in and it just takes off without you…\n\nAt the moment for ETH, everything still looks on track and it’s playing ball with the other strong altcoins.”\n\nEthereum is trading for $3,502 at time of writing, a marginal increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNd2RoMVhsa01uQ05YSEdqWE1jWWxTRE9DYTVBUG0xTXNEZEIycW9mMWRhQ1NZMXlPVXFObmtSb3U3NmliSzlRUDlyUVJuSXNudnJTbW9rZlE0TFhwLTlsZXlaMmNaWnpMdmIxdEtHeWNLWlpLd0pHSmNVdWhfSlZJci1meTdTX1BrOUh0SHhtQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Vous devriez surveiller Ethereum maintenant - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nMichaël van de Poppe, renowned crypto analyst, anticipates a significant rise in altcoins, driven by Ethereum’s remarkable resilience. While Bitcoin shows signs of weakness with substantial capital outflows from US-based ETFs, Ethereum demonstrates impressive stability. This dynamic could well herald a major turning point for the altcoin market.\n\nEthereum stands out for its resilience\n\nAs the crypto market undergoes a bearish phase, Ethereum stands out with notable resilience. Recent data shows sustained activity from Ethereum “whales,” which contrasts with the movements around Bitcoin.\n\nA wallet linked to Justin Sun acquired 9,338 Ether, worth over 30 million dollars. A purchase that demonstrates increased confidence in Ethereum’s future performance. In contrast, Bitcoin whales, notably influenced by the German government, continue to liquidate their positions, increasing downward pressure on the market. Similarly, Bitcoin ETFs face massive outflows. Conversely, Ethereum appears to be gaining renewed confidence, potentially setting the stage for a rise in altcoins.\n\nAn imminent rise in altcoins\n\nAccording to Michaël van de Poppe, Ethereum’s resilience could herald a new era for altcoins. The renowned analyst highlights that the ETH/BTC pair, which has recently shown signs of strength, could trigger a significant rise in altcoins after more than two and a half years of a downtrend. Van de Poppe believes that as long as the ETH/BTC pair holds above the key level of 0.05, a trend reversal is possible. This analysis is based on on-chain data revealing increased accumulation of Ethereum by whales, contrasting with Bitcoin liquidations. This technical signal indicates that Ethereum’s crypto price could climb exponentially against the US dollar, driving positive dynamics for the entire altcoin market.\n\nInstitutional interest in cryptos other than Bitcoin continues to grow, as evidenced by the imminent launch of Solana’s exchange-traded product (ETP) in Canada. This trend reflects a diversification of institutional investment portfolios, once largely dominated by Bitcoin, towards alternative cryptos with attractive growth prospects.\n\nBitcoin’s dominance, measured in terms of relative market share, is also poised for a major reversal. This outlook could favor a rotation of investor liquidity towards altcoins and thus amplify their performance. towards altcoins and amplify their performance.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPdE1Ra0hjN3VpU1FOZFc2UEpaZnFEN21rUm9YYU9UYjlyclNMSFBTcjA3aW12MjVwZm1fTDB1SmtSY0JfVjN4ekhRMUZPamVVRGhnMFdsODhpVWdLbGVhYm8tYWhrSEFrVXdWUEMzcFk4dVROUU5RWllTYmdEZl9URDJUeC0zVzBVWVpsYXRIa1l6X1pBZ0HSAZsBQVVfeXFMTmYzbEt2V2tld2cxLUxrYUx2c2gyYnA5UUdrMjQ5enVzSDhyRkh4UWd4bjhxVjVKam1VR0RfbnRUWjlOaUIxNDVmdzlvbzcwNzg2Y1p5N1FlM3dxZ2VJOHdsNHJSOVlPM3NTRjdCWkRzX0RKTjlDalZKZHhrQ09wTG5xalhfTUI2UjNwS3FuYzZDUXk0WGRBMU9ZSzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whale Offloads 10k Coins Amid ETH Price Dip, What’s Next? - CoinGape",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by global market cap, has once again turned heads across the broader crypto market. In the past 24 hours, ETH has exhibited highly turbulent price action, sparking significant interest and activity among major investors, known as whales. According to on-chain data, over 9,000 ETH tokens were transferred to Coinbase in the past four hours, capturing the attention of market participants.\n\nEthereum’s Whale Activity and Market Speculation\n\nThe recent price recovery of Ethereum (ETH) within the last four hours has been particularly noteworthy. On-chain data reveals that a whale, identified as 0xe61, deposited 9,553 ETH, valued at over $33.4 million, into Coinbase. This considerable transaction has led to widespread speculation regarding the future direction of ETH’s price.\n\nadvertisement\n\nGiven the recent dip in Ethereum’s value, some believe the whale might be selling off to mitigate potential losses. Currently, Ethereum’s price stands at $3,489.38, with a 24-hour trading volume of $5.1 billion. This represents a -1.17% price decline over the past 24 hours and a -1.85% decline over the past seven days. With a circulating supply of 120 million ETH, the market cap is valued at $426.7 billion.\n\nAdditionally, Ethereum’s open interest has decreased by 2.5%, reaching a valuation of $11.5 billion. Despite these declines, the ETH price is sustaining above the $3,400 mark. Various factors suggest that a price reversal might be imminent, including a relative strength index of 43.70, indicating increased selling pressure from the bears.\n\nAlso Read: DOGE, SHIB, and BONK Leads Memecoin Recovery, Is The Worst Over Now?\n\nIndicators of a Potential Price Reversal\n\nSeveral indicators point towards a potential price reversal for Ethereum. One of the most significant factors is the increase in active addresses, which has reached a three-month high of 617,170. This surge in activity is a positive sign of growing user engagement and network utilization.\n\nAdditionally, the ETH/BTC trading pair has remained above the crucial 0.05 BTC level, which is an important threshold according to market analyst Michaël van de Poppe. Another major development is the filing of S-1 amendments by prominent financial firms for Spot Ethereum ETFs. Companies such as BlackRock, Fidelity, Grayscale, and VanEck have submitted detailed amendments to the SEC, demonstrating their commitment to launching these funds. The potential approval of these ETFs could bring substantial institutional investment into Ethereum.\n\nBloomberg analyst Eric Balchunas highlighted the competitive pricing of these ETFs, with VanEck’s fee at 0.20%, which could pressure BlackRock to keep their fees under 30bps. These combined factors suggest that Ethereum could be on the verge of a significant price reversal. Investors are advised to closely monitor these developments as they could present substantial opportunities in the near future.\n\nAlso Read: Binance CEO Richard Teng Affirms Binance’s Support To BtcTurk Amid Recent Hack\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]