[
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZTJ6b2xIczdDcHdOa01WckpISFZEYmc0T2lxOWM0eE02RkluQmFuT1JISUVOYzBmbk10SVdTTXJhRmlSbWRDWU1xbXNDNlpSYVppS2xDRGlLbWtpR0J3ZFZ0UXJod0R6UFI2YVBQdmpGRnotVEFzdTF2VEd0eW5iVmczUXVQbzUy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "What's Going On With Ethereum Classic? - Benzinga",
        "content": "Ethereum Classic ETC/USD is trading up by 2.23% to $24.12 during Tuesday’s session after the SEC approved the first Ethereum spot ETFs, which began trading Tuesday.\n\nThe introduction of Ethereum spot ETFs is a significant event for the cryptocurrency market, primarily benefiting ETH.\n\nInstitutional investors, who are more likely to invest through ETFs, will focus on ETH rather than ETC. This shift in attention and investment could cause a relative decrease in demand for ETC.\n\nSee Also: What’s Going On With Wells Fargo Shares? Analyst Lowers Price Target\n\nInitial reactions might have included speculative buying of ETC due to its association with Ethereum.\n\nHowever, as the market rationalizes, investors may realize that the direct beneficiary of the ETF approval is ETH, not ETC. This realization can lead to a sell-off in ETC as the enthusiasm wanes.\n\nAs retail investors look for cheaper alternatives to ETH, they might initially drive up ETC’s price. However, with the spotlight on ETH due to the ETF, the perceived value proposition of ETC might diminish, causing investors to reallocate funds back to ETH, leading to a drop in ETC's price.\n\nThe cryptocurrency market is also highly correlated. If Ethereum (ETH) is experiencing a downturn despite the positive ETF news, broader market sentiment could turn negative, affecting ETC as well. Traders might sell ETC in response to overall bearish trends in major cryptocurrencies like ETH and Bitcoin.\n\nNow Read:"
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNRjZycjRmNVpXeElOOS13SHZYY3ctZ2IxOU5senY0c0hZVjZIMlQwQlVHdG5pejBNZE53Qk1HZkVWeXBuR2hGWFdBZ3JDVjQtT19raDlxZ1oxLV9EOE9DdDlBQ29hUk5RRkVFdm5nczZKSVBoaUltWkdnemNFRXREWEFRSlBuUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Wintermute: Ethereum ETFs May Face Lower Than Anticipated Demand, ETH Could Gain 24% - Yahoo Finance",
        "content": "Wintermute: Ethereum ETFs May Face Lower Than Anticipated Demand, ETH Could Gain 24%\n\nAs the Ethereum (ETH) spot exchange-traded funds (ETFs) is officially approved by the SEC and set to launch on July 23, Algorithmic trading firm Wintermute believes demand may not live up to the high expectations set by many analysts\n\nWintermute's latest report offers a more conservative outlook on Ethereum ETFs. \"Analysts hold varying views on Ethereum ETFs, with most estimates putting year-one annualized flows in the $4.8-$6.4 billion range,\" the report states. However, Wintermute forecasts lower-than-anticipated demand, predicting flows closer to $3.2 to $4 billion. The firm expects Ethereum ETFs to capture only 15% to 20% of the flow observed for Bitcoin ETFs and forecasts a price increase of 18% to 24%.\n\nThis projection is significantly lower than some more optimistic forecasts, such as one analyst's prediction that ETH could hit $5,000 following the ETF launch, representing a 50% increase. As of now, Ethereum is trading at approximately $3,475.66.\n\nWintermute attributes its cautious outlook to two main factors. First is the absence of a staking mechanism within the ETFs, which could diminish their appeal to yield-seeking investors. Staking allows users to delegate Ethereum tokens to the network in exchange for rewards. The inability to stake within these ETFs might make them less attractive compared to direct Ethereum holdings.\n\nSecondly, Wintermute points to the lack of a cohesive narrative to attract investors. Unlike Bitcoin, which has successfully promoted itself as \"digital gold,\" Ethereum's more complex ecosystem and diverse applications could make it challenging to present a unified investment thesis. However, the report notes that Ethereum's dual functionality, as both a digital currency and a platform for decentralized applications, could still appeal to investors interested in technological innovations and the varied applications of blockchain technology."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE42M0ltX3l5NjdrVkZLckFNV0FGT2wwejQ0WVRIWTZFNVNKdFNBWWRCcHVxNmoySXpBdWVIN2ozdGJTcmJkQkp6QXBUcmpXN25lMnFkUWZVQlR3VTFaLWhEMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs debut on US markets as trading commences - Crypto Briefing",
        "content": "Ethereum's utility has been highlighted as ETFs launch on major US exchanges.\n\nKey Takeaways First-ever spot Ethereum ETFs begin trading in the US today.\n\nEthereum ETFs expected to attract up to $1 billion in initial monthly inflows.\n\nShare this article\n\nToday marks a watershed moment in the US financial markets as the first-ever spot Ethereum ETFs commence trading.\n\nApproved by the US SEC, these funds allow investors to directly engage with the world’s second-largest cryptocurrency.\n\nJay Jacobs, BlackRock’s US head of thematic and active ETFs, highlighted Ethereum’s utility, stating, “You could think of Ethereum as a global platform for applications that run without decentralized intermediaries.”\n\nThe SEC allowed S1 registration statements to become effective on Monday afternoon, giving final approval for the funds to begin trading. This development comes less than three months after spot Bitcoin ETFs were launched in January.\n\nEight issuers are offering spot Ethereum ETFs with varying fee structures:\n\nGrayscale Ethereum Mini Trust (NYSE: ETH): 0.15% post-waiver fee\n\nFranklin Ethereum ETF (CBOE: EZET): 0.19%\n\nVanEck Ethereum ETF (CBOE: ETHV): 0.20%\n\nBitwise Ethereum ETF (NYSE: ETHW): 0.20%\n\n21Shares Core Ethereum ETF (CBOE: CETH): 0.21%\n\nFidelity Ethereum Fund (CBOE: FETH): 0.25%\n\niShare Ethereum Trust (NASDAQ: ETHA): 0.25%\n\nInvesco Galaxy Ethereum ETF (CBOE: QETH): 0.25%\n\nAdditionally, Grayscale’s existing Ethereum Trust (NYSE: ETHE) will continue trading with a 2.5% fee. Six of the funds will use Coinbase as a custodian, while VanEck has chosen Gemini and Fidelity will self-custody its ether.\n\nAnalysts project more modest inflows for Ethereum ETFs compared to their Bitcoin counterparts. Citigroup estimates between $4.7 billion and $5.4 billion in inflows over the first six months of trading. Nate Geraci, president of The ETF Store, suggests Ethereum ETF demand may reach about one-third of what was seen with Bitcoin ETFs.\n\nThe ETFs are available to both institutional investors and retail traders. Notably, six of these funds have chosen Coinbase as their custodian, with others opting for different custody solutions. The trading platforms and their respective fees vary, with the Grayscale Ethereum Mini Trust and the Invesco Galaxy Ethereum ETF among those listed.\n\nComparatively, Ethereum ETFs are expected to see lower initial inflows than their Bitcoin counterparts, with projections suggesting up to $1 billion in net inflows monthly for the first half-year. Despite the smaller market size relative to Bitcoin, the introduction of these ETFs is poised to provide a new avenue for cryptocurrency investment."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE15eVhHRGNKVEp6WmtPaTUwb1AzTld6TlZ3WjlpUS1mWWZlSU1JSmlEcVBkWkphcUlobHNJSE1kSHhCYVluNWRVV1g1VXlrTUNaUEZuX1JMVGpubEhnRDlwN3JwVWRmTnRWclYtWmRDT0h2MGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "BlackRock's spot Ethereum ETF begins pre-market trading amid muted demand predictions - Crypto Briefing",
        "content": "Trading for spot Ethereum ETFs is scheduled to start today at 9:30 AM EDT.\n\nKey Takeaways BlackRock's Ethereum ETF started pre-market trading early on July 23, 2024, after SEC approval.\n\nAnalysts estimate up to $5.4 billion inflows into the ETFs within six months.\n\nShare this article\n\nBlackRock’s Spot Ethereum ETF has commenced pre-market trading early Tuesday, following the SEC’s approval for multiple spot Ethereum ETFs.\n\nThis development allows mainstream investors to directly invest in Ethereum without managing the digital asset themselves, although functionality for staking and other stake-based derivatives have been removed prior to the approval.\n\nIn an advertisement video for its Ethereum ETF, BlackRock’s US Head of Thematic and Active ETFs Jay Jacobs said:\n\n“While many see Bitcoin’s key appeal in its scarcity many find Ethereum’s appeal in its utility […] you could think of Ethereum as a global platform for applications that run without centralized intermediaries.”\n\nHere's BlackRock's Ether pitch to normies via @JayJacobsCFA: \"While many see bitcoin's key appeal in its scarcity many find ethereum's appeal in its utility.. you could think of ethereum as a global platform for applications that run without decentralized intermediaries\" $ETHA pic.twitter.com/ffyglfSTiB — Eric Balchunas (@EricBalchunas) July 22, 2024\n\nThe SEC’s approval for major asset management firms including Fidelity, Grayscale and Franklin Templeton, represents a major milestone for Ethereum and the broader crypto market. Trading of these ETFs is scheduled to start today at 9:30 AM EDT. At the time of writing, Ethereum’s price stands at approximately $3,525, up 1% over the past 24 hours, according to data from CoinGecko.\n\nWhile some analysts predict these ETFs could see inflows of up to $5.4 billion in the first six months, algorithmic trading firm Wintermute offers a more conservative outlook. The firm forecasts lower-than-anticipated demand, projecting inflows closer to $3.2 to $4 billion. Wintermute expects Ethereum ETFs to see 15% to 20% of the flow observed for Bitcoin ETFs, potentially leading to an 18% to 24% price increase for ETH.\n\nTwo factors for ‘muted demand’ on Ethereum ETFs\n\nWintermute attributes its less optimistic forecast to two key factors.\n\nPrimarily, the absence of a staking mechanism within the ETFs may diminish Ethereum’s appeal as an investment vehicle. Staking, a core component of Ethereum’s security model since its shift to proof-of-stake in 2022, allows users to earn rewards by delegating tokens to the network.\n\nThe inability to stake Ethereum within these ETFs could make them less attractive to yield-seeking investors. Crypto Briefing’s previous coverages on this matter explain the nuances in detail.\n\nWintermute also cites the lack of a shared narrative to attract investors as a potential hurdle for Ether ETFs. Unlike Bitcoin, which has successfully tapped into the “digital gold” narrative, Ethereum’s more complex ecosystem and diverse applications may make it challenging to present a unified investment thesis to potential ETF buyers.\n\nDespite these challenges, Ethereum’s dual functionality as both a digital currency and a platform for decentralized applications and smart contracts may appeal to investors interested in technological innovations and diverse blockchain applications, Wintermute claims. The launch of Ethereum ETFs represents a significant step in making crypto investments more accessible to mainstream investors, potentially impacting both the crypto market and the broader financial landscape."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQcTVoMV90Um9FT1h3eGJjMG8yX0hjT2c2b1lZMDZPMGRCOElaZ1NTb2RyNVd2d3F2YVRoQUhWUUREaVJhQlNGOEdTRUxWQUpmU0R3SU1RVDN0SUFTVWwxRmMzYnZTMThLT3gzaFhOaWh5Rllhb3FBVGZsWWdKWmNsamNMdXpyRXozOFNncXpGTkZJQU9fbnVRekZtU1QzeXlJdW1heTExdUp1bUg1bkFmadIBtgFBVV95cUxQcUF1RGJKY0thUll2UzZRT0o3RVBGWklMbXRmaFVuQWI0OXJKVW9RWXE2OVJMcUpjTnQ0dloyMHU0Q2JENVE1dlJDSVNDSjdVTHJiZ0VNS0JFX1F1UThURHRjZnZJQTRHdW5KY2hJclhsdzltaXRGWWMxeU5ZUmZRcW8wTDNZRDRGMm5Ibnk5SjFMdV9JVGVXd1h1ZDlKU1pCc1U0c2FRNGY5RUxVd3pUdGhfdnBHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot ether ETFs are set to trade Tuesday. Here’s what it means for the Ethereum blockchain - CNBC",
        "content": "Nurphoto | Nurphoto | Getty Images\n\nSpot ether exchange traded funds are set to begin trading on Tuesday. Crypto enthusiasts are hopeful it will broaden the investor base for Ethereum, a blockchain technology many argue has a far wider use case than bitcoin. These ETFs will invest directly in ether, which is the cryptocurrency used in the Ethereum network. There are already ether ETFs that track futures contracts, but these are the first to track spot ether. Spot ether ETF applications Grayscale Ethereum Mini Trust (ETH)\n\nGrayscale Ethereum Trust (ETHE)\n\nBitwise Ethereum (ETHW)\n\nVanEck Ethereum (ETHV)\n\n21Shares Core Ethereum (CETH)\n\nInvesco Galaxy Ethereum (QETH)\n\nFidelity Ethereum (FETH)\n\nFranklin Ethereum (EZET)\n\niShares Ethereum Trust (ETHA) Like the spot bitcoin ETFs that launched in January, most are waiving fees initially — in many cases for up to a year.\n\nBitcoin ETF have been a hit. Will ether ETFs be the same?\n\nBy the standards of ETF launches, spot bitcoin ETFs have been a success: They recently topped $17 billion in net flows year to date since their debut. For a new asset class, that is a big hit. However, at $1.3 trillion in total assets, bitcoin has about three times the value of ether, which has about $414 billion in assets. That may limit the initial appeal of ether ETFs. Bitcoin prices rose going into the launch of spot bitcoin ETFs. Ether has been a bit spottier: It is up 50% in 2024, but most of the gain came in the first three months of the year. Still, for Ethereum enthusiasts, the primary value of a spot ether ETF is that it's a perfect vehicle to educate the public about the use cases for Ethereum, which are far greater than anything bitcoin has to offer. Ben Johnson, Morningstar's head of client solutions and an ETF research veteran, noted that while bitcoin is often advertised as digital gold, \"Ethereum is more like picks and shovels.\" \"The case for the former is that it is finite and could be a store of value, the latter is not finite and being used to build some real-world applications,\" he said.\n\nWhat the Ethereum platform does\n\nMany investors have never been impressed with bitcoin, primarily because the use case seems limited: It is purely a digital currency. But the Ethereum platform is different. Bitcoin and Ethereum both utilize blockchain, which is a decentralized, immutable ledger to record transaction histories, but they have very different purposes. Bitcoin uses the blockchain as a digital currency. Ethereum utilizes digital money just like bitcoin, but its blockchain has broader purposes. (Ether is the cryptocurrency used in the Ethereum network, but in practice the terms Ethereum and ether are often used interchangeably.) Ethereum is a platform for building smart contracts, which are self-executing programs that enforce a pre-existing contract or agreement. It can be as simple as \"If I do this, you do that.\" The key is that they execute automatically, are done on the blockchain (the Ethereum network) and produce the same result each time they are executed. They also have a wide variety of applications. The most common use is for decentralized finance, or \"DeFi.\" This is just a fancy term for using financial services on the blockchain. In theory, you could perform almost any banking services: Users can send, lend or borrow money, open a savings account, trade stocks or derivatives or other cryptocurrencies, get insurance. Theoretically, you could also do real estate transactions. Users can perform these functions using software called \"decentralized apps.\" The use case goes beyond financial services. Users can play games. Corporations could use it for tracking supply chains. It could even be used as a clearing platform to settle stock trades. Another application for Ethereum: stablecoins. These are cryptocurrencies whose value is pegged to another asset, usually the dollar. Because cryptocurrencies like bitcoin and ether are volatile, many DeFi applications rely on stablecoins for lending, borrowing and trading. The promise is a transaction network that — in theory — could be a much cheaper and faster way to do business.\n\nDoes this open the floodgates for more crypto ETFs?\n\nIt's not clear whether this latest development will open the floodgates for more crypto ETFs — or whether the U.S. Securities and Exchange Commission will find a way to stop the potential tidal wave. Any applicant for other crypto ETFs would still need to show that the underlying market was not subject to manipulation, a crucial requirement for approval of these funds. But a lot may depend on the political climate. In the past, for commodities, the SEC has traditionally required a regulated futures market to trade alongside the asset. Right now, that only exists for bitcoin and ether, so it would take time to develop futures markets for other crypto products. \"Under the current regime in Washington, that would not change,\" Matt Hougan, chief investment officer of Bitwise told me. \"But if you get a change of regimes in Washington, that could change.\" Regardless, expect a lot of trading. \"These new ETH ETFs will likely trade a lot,\" Johnson at Morningstar told me. \"I'd guess that if and when options on these ETFs become available, this will all go into overdrive.... These ETFs effectively add a whole new wing to the crypto casino.\"\n\nIs Ethereum essentially a tech play?"
    }
]